[{"id": "2d757edbf6f6e8684b318c2cac917df88c294fdf", "text": "Document.\n\nAppointment of Charles Williams,\nEsquire as Justice of the Peace\nin and for the North-West Territory.\n\nMrs. Alice Cox\n(1890)\nDocument.\n\nAppointment of Charles Williams,\nEsquire, as Justice of the Peace\nin and for the North-West Territories.\n\nMrs. Alice V. (signature)\nSpence\n(1890)\nTitle of Collection: Pioneer Questionnaires No. 2 General\n\nType of Document(s): Oversize Drawer 28\n\nDescription of Document(s): Certificate - App't. as Justice of the Peace for the North-West Territories, January 18, 1897\n\nTransferred to OS Drawer 28\nTitle of Collection: Pioneer Questionnaires No. 2 General\n\nType of Document(s): Oversize Drawer 28\n\nDescription of Document(s): Certificate\n\n- App't. as Justice of the Peace for the North-West Territories, January 18, 1897\n\nTransferred to OS Drawer 28\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. If there is any doubt about leaving blank spaces, use extra sheets of paper. If there are not sufficient spaces to answer the questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n(All questionnaires)\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so do not worry about leaving blank spaces.\n\nUse extra sheets of paper if necessary, so that you have plenty of room to answer the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Miss Gordon U.S.\n2. Your address: 1375 153 Waskola Saskatchewan\n3. Date: January 27th 1956\n4. Where were you born? (Give name of place and country): Winnibigoshen, Manitoba\n5. What was your father's name and occupation? Farmer\n6. When did you come to Saskatchewan? (Give month and year): July, 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Shellmouth, Manitoba\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.). I was a young girl\n9. What were your reasons for coming West? I came with my family\n10. How did you learn about the West? Through other people, Reading about it, Railroad or government information?\n\nOne more and family\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Alice Gordon\n2. Your address: 1375 153 Wrake Rd, Saskatoon\n3. Date: January 27, 1946\n4. Where were you born? (Give name of place and country): Winnipeg, Manitoba\n5. What was your father's name and occupation? William Gordon\n6. When did you come to Saskatchewan? (Give month and year): July, 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Shellmouth, Manitoba\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you have used \"I was a small child\", etc.) I was a young girl\n9. What were your reasons for coming West? - I came with my family\n10. How did you learn about the West? (Through other people? Reading about it?) Through other people\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was very good, and they came instead too.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I travelled with the family.\n\n13. What means of transportation did you use? Wagon and oxen.\n\n14. What incidents of the journey West do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc. We had tents at a place then called Silver Creek, Manitoba. We camped there for a week to rest the cattle. One evening while there, a young man came up and said he was from the North West Mounted Police and wanted to see us. We went with him to his camp and he gave us some food. We were very grateful.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a place near Qu'Appelle, Saskatchewan until we left for the North West Territories. We became Saskatchewan in 1925-6.\n\n16. Where did you settle or take up land? We settled in the area of Qu'Appelle, Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We lived in Qu'Appelle, Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? We worked on farms and homesteads. We farmed also in the area of Regina, Saskatchewan. We also worked on Lake Diefenbaker.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was very good, and they came west too.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I travelled with the family.\n\n13. What means of transportation did you use? Wagon and oxen.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We had tents all the way. After Yellow River Creek, we camped in a week to reach the cattle. One evening while there, a young man came up and said \"Hello.\" That love had nothing to do with me. We moved on and one of my brothers mentioned a homestead near North West Territorial. He decided to go there in 1905-6.\n\n15. Where did you first stay when you arrived in Saskatchewan? We moved to the place called Placer Butte.\n\n16. Where did you settle or take up land? Placer Butte.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I lived in Town of Weyburn. Then farmed also in the District.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I worked as a farmer and then as a teacher. I worked in Provincial Parks and then as a guide for a few years in the Peace River Region. I also worked at Lake Baloo, etc.\nof no one getting hurt so then he knew it was a thief who ask for the horse and buggy—my brother found out after that this man intended to sell the horse and buggy—and skip with the money—but he was caught too soon—my brother didn't do any thing about—just let him go—we trust—it was a lesson for that man—\n\nwhip my brother watching after him (said) there is something wrong there—and he was a good runner—many times had taken prize for 100 yard dash at the races—so he used his talent on this occasion—and took a short cut across the country and managed to over take the man—my brother scrambled into the back of the buggy and grabbed the lines, halted the horse and told the fellow to get out—then my brother drove to the Rail Road Camp and asked if any man had got hurt that day—they replied No—we knew of\nOf no one getting hurt so then he knew it was a thief who asked for the horse and buggy—my brother found out after that this man intended to sell the horse and buggy—and ship with the money—but he was caught too soon—my brother didn't do any thing about—just let him go—we trust—it was a lesson for that man—\n\nwhip very brother watching after him (said) there is something wrong there—and he was a good runner—many times had taken prize for 100 yard dash at the races—so he used his talent on this occasion—and took a short cut across the country and managed to over take the man—my brother scrambled into the back of the buggy and grabbed the lines, halted the horse and told the fellow to get out—then my brother drove to the Rail Road Camp—and asked if any man had got hurt that day—they replied No—we knew of\nto our camp—limping quite badly on one leg—and said he was working on the new Rail Road dump which was being put through the Silver Creek District at that time—and a tree had fallen on his leg and would my brother lend him his horse and buggy—to go to the next town. He needed to get some things. So my brother hitched up the horse to the buggy for him—he got in and took the reins from my brother—he had not gone far until he whipped the horse into a fast trot—and then into a gallop and lashing the horse with the\nto our camp—limping quite badly on one leg—and said he was working on the new Rail Road dump which was being put through the Silver Creek District at that time—and a tree had fallen on his leg and would my brother lend him his horse and buggy—to go to the next town—he needed to get some things—so my brother hitched up the horse to the buggy for him—he got in and took the reins from my brother—he had not gone far until he whipped the horse into a fast trot—and then into a gallop and lashing the horse with the\nTo our camp - camping quite badly or one leg - and said he was working on the new Rail Road dump which was being built through the Silver Creek Quicksilver at that time - and a tree had fallen on his leg and would my brother lend him his horse and buggy - to go to the next town - He needed to get some things - to give Brother Histoty up the Horse to the buggy for him - he got in and drove the reins from my brother he had not gone far until he whipped the horse into a fall foot and then into a gully and leaving the horse with the\nto our camp - camping quite badly on one leg - and said he was working on the new Rail Road dump which were being put through the Silver Creek Quicksilv at that time - and a tree had fallen on his leg and would my brother lend him his horse and buggy - to go to the next town - He needed to get some things to give brother for him - he got in and drop the reins from my brother he had not gone far until he whipped the horse into a fast trot and then into a gallop and leaving the horse with the\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote occasionally but the mails didn't come very often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nYes, there were some people came over to do the work and lived at our place.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe Canadian Pacific Railroad was built and the settlers moved west.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nWe always went to church and school in the town.\n\n25. To our camp-stumping guests badly on one leg and said he was working on the new Rail\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote occasionally but the mail did not come.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to settle between because of your recommendation? It was a good place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe community was well and good getting settled yet. We lived very near the Gravelle Valley and the creek on the other side. There was plenty of room around all the time. Children were small and able to help. We had a house in the hills and what our father had only in the open country and came every year on the Bunkhouse. We had a house in the hills and what our father had only in the open country and came every year on the Bunkhouse.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of transportation?\n\nWe always went to church at the Baptist Church in the town. We had a carriage in the hills and what our father had only in the open country and came every year on the Bunkhouse.\n\nWhen all the new roads were held in the hills and what our father had only in the open country and came every year on the Bunkhouse.\n\nThere was working on the new Rail Road.\n25. When was the first car used in the community? About the year 1908\n\n26. If you owned a car before 1914, when did you buy it? That makes 3. We didn't own an auto until about 1920 when we bought a Chevrolet.\n\n27. Where was your trading center? How far from your house? Near the town of Wapella, Saskatchewan.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) No, because we moved to other towns for shopping and other needs.\n\n29. How often did you shop in the early days? Usually on Saturdays. We were very busy then, but they are gradually dying off in nowadays.\n\n30. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n31. In the very early days my father and mother sent once or twice a year to the Eaton's Company at Toronto for merchandise—also I remember them sending frequently a wire saying \"from quilt—we are ever glad to have it—and there is no well in pioneer days.\"\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision? Yes, my brother and I both came with the idea of staying permanently which they did.\n25. When was the first car used in the community? About the year 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house? Were farmers near the town of Wapella or the farm?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing better means of travel, etc.)\n\n29. How often did you shop in the early days? (In the early days, only)\n\n30. When did you start buying goods regularly? We began buying goods regularly after 1910.\n\n31. When did you first begin to buy through the mail order catalogues? (If ever)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? With the idea of starting permanently? Or did you just try it out? When did you settle this question? You say brother and mother came...\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mentioned, it here giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and location of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first time given; (5) reason for change.\n\n1. My husband's brother gave Hazelcliffe its name because they went to young Hazelcliffe and\n\n2. The Cut-Off Creek I presume was named after\n\n3. The Cut-Off Creek was named after\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention them here:\n\n37. If you or any of your family or friends were \"first\" to have or do something (such as owning the first automobile, organizing the first lodge, etc.), give: (1) name and date; (2) name and date; (3) name and date.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to explain why they were so named.\n\n1. Because there were no young boys known and called \"Hazel Cliff.\"\n\n2. The Cut-River Creek was named before our town.\n\n3. The Cut-River Creek was named before our town.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old pamphlets, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nIn our town and community, I believe we gained...\n\nBetter roads and highways are needed to improve movement and bring more trade and commerce to our town.\n\nMany other improvements, better building schools, churches etc.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below.\n\nGive name and address here:\n\nBox 153 Wapella Bank\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old programs, old photos, old books, community newspapers, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nSome little time ago I was asked by the Saskatchewan Archives Office to send in three different types of material which they did - the Archives Office acknowledged having received them and thanked me.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nI have an elderly son living in Regina, Saskatchewan.\n\nIf you have any other information about these things, please let me know.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nBetter roads and highways are needed. Better improvements and better buildings are needed.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here.\n\nMiss Barbara Lark\n\nBox 153 Kappella Lake\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may not be possible for you to answer, so don't worry about leaving blank spaces. Feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this Province or not.\n\nIf more than one member of the family can answer the questions, should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Western Canadian Pioneers' History\" is still being circulated. If you answered this, and would be willing to do so, please put a check mark and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be sent at a later date. Some of those are listed below. Please mark the ones you are willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Office at the University of Saskatchewan as part of the provincial records. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan\nSaskatoon, S. W.\nVis, Mrs. Alice\nWapella. 1890\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON SUBMITTING THE QUESTIONNAIRE:\n\nIt is difficult to \"cover\" a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It's OK to make notes of reply if there isn't sufficient space to answer the questions. Don't hesitate to give additional or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and should be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Experience,\" has been circulated. If you answered this, and would be willing to do so, please put a check mark next to it. If you did not answer this, and would be willing to do so, please put a check mark next to it.\n\nSaskatchewan Archives questionnaires on other subjects will be sent at a later date. Some of these are listed below. Please mark the ones you are willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and Churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Office at the University of Saskatchewan as part of the Provincial Archives. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, SK.\n\nHandwritten note:\n\nHoyt Douglas Gordon of the R.C.M. Police\nOttawa Ontario - I have a number of Grand Children - and some Great Grand Children\nLloyd Douglas Gordon of the R.C.M. Police\nOttawa Ontario - I have a number\nof Grand Children - and some Great\nGrand Children\nLloyd Douglas Gordon of the RCM Police\nOttawa Ontario - I have a number\nof Grand Children - and some Great\nGrand Children\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA tool of investigation to the pioneer experiences early by transients.\n\nIt is difficult to acquire a general questionnaire in pioneer life because no individual was ever asked to answer it nor exactly the same experiences or methods of living. It is not possible to get experiences other than those which have been experienced by others who have lived in pioneer life.\n\nThis questionnaire is intended for persons who lived in pioneer life in Canada between 1874 and 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days That Will Never Be Forgotten,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Days That Will Never Be Forgotten,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nAll Questionnaires:\n\n| Pioneer health conditions |\n|---------------------------|\n| Pioneer social life, sports and recreation |\n| Pioneer housing and shelter |\n| Pioneer education and churchwork |\n| Pioneer farming experiences |\n\nPresentation of Questionnaire:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan\nSaskatoon, SASK.\nVis, Mrs. Alice\nWapella, 1930\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name\n2. Your address\n3. Date\n4. Where were you born? (Give name of place and country) at-Grandfather's farm\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not read or write when you came.)\n9. What were your reasons for coming West? (Give family, etc.)\n10. How did you learn about the West? (Through other people? Reading about it? Ballad or government information?)\n\n\"I was in my teens,\" etc.) I was very young then, and my family had moved west to take up land and farm.\n\nMy husband, George Gordon, belonged to the N.W.M. Police and often appeared at Regina, Prince Albert, and other places when he left the line. He also farmed at Hazeldean.\n\nThrough a splendid young man who had very little education, brothers where they worked on farms in a humble manner in Ontario, my eldest brother worked amongst the Indians and my youngest brother was sent for work amongst the Indians. My father was going to build a house to go and live on land at Wapella. But when the young man from the west, let my brothers go to school for a few months.\nVis, Mrs. Alice\nWapella, 1930\n\nPIONEER EXPERIENCES! A GENERAL QUESTIONNAIRE\n\nPLEASE PRINT ALL PROPER NAMES AND PLACE NAMES IN CAPITAL LETTERS. IF YOU ARE NOT SURE THE NAME IS CORRECT AS YOU HAVE GIVEN IT, PLEASE SAY SO. IF YOU WISH TO HAVE SOMEONE ELSE DO THE WRITING FOR YOU, THIS IS QUITE ACCEPTABLE.\n\n1. Your full name:\n   Mrs. Alice Vis\n\n2. Your address:\n   Wapella\n\n3. Date:\n   January 28, 1953\n\n4. Where were you born? (Give name of place and country of grandparents)\n   Wapella\n\n5. What was your father's name and occupation?\n   William Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   1890\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   I was in Canada when I was a very little girl.\n\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, if you would rather not say how old you are, please say so.)\n   I was in my teens.\n\n9. What were your reasons for coming West? (Tell us why you came here.)\n   To take up land and farm.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    Through a friend who had been there.\n\n11. Describe your experiences in the early days in Saskatchewan.\n    We had to build our own homes from scratch. It was hard work, but we persevered.\n\n12. What were the biggest challenges you faced in settling in Saskatchewan?\n    The harsh weather conditions and lack of resources.\n\n13. How did you adapt to the new environment?\n    We learned to be self-sufficient and resourceful.\n\n14. What advice would you give to someone planning to settle in Saskatchewan today?\n    Be prepared for the challenges and embrace the opportunities.\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   I traveled with my family.\n\n13. What means of transportation did you use?\n   We used wagons and oxen to pull them.\n\n14. How did you feel about the journey? What was the most memorable part?\n   I felt excited and nervous at the same time. The most memorable part was seeing the vast plains and the beautiful scenery.\n\n15. How did you earn a living before coming to Western Canada?\n   My father did both farming and ranching and forming cattle.\n\n16. What did you like best about living in Western Canada?\n   I liked the open spaces and the opportunity to be independent.\n\n17. What did you dislike about living in Western Canada?\n   I disliked the isolation and the harsh weather conditions.\n\n18. How did you earn a living after coming to Western Canada?\n   After coming to Western Canada, I started working in the mining industry.\n\n19. What did you like best about living in Western Canada?\n   I liked the opportunity to work in the mining industry and the chance to make a good living.\n\n20. What did you dislike about living in Western Canada?\n   I disliked the long hours and the difficult working conditions.\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   I traveled with my family.\n\n13. What means of transportation did you use?\n   Carried luggage on a baby carriage.\n\n14. How did you feel about the trip? (Was it fun, exciting, etc.)\n   It was very exciting and enjoyable.\n\n15. How did you feel about the weather?\n   The weather was pleasant and sunny.\n\n16. How did you feel about the food?\n   The food was delicious and varied.\n\n17. How did you feel about the people you met?\n   The people were friendly and welcoming.\n\n18. How did you feel about the overall experience?\n   Overall, it was an amazing and unforgettable experience.\n19. How often did you write to relatives or friends in your old home?\n\nWe did write to our old friends and family at least once a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOh yes, many happy memories stand out in my mind of those early days. My mother and I who were three and my 2-year-old nephew lived in my father's house. We had a cow and a horse, and we would go to town every Saturday to buy groceries. It was a hard life, but we were happy.\n\n24. What was the most important thing about your life in Saskatchewan?\n\nThe most important thing about my life in Saskatchewan was the opportunity to work and provide for my family.\n29. How often did you write to relatives or friends in your old home?\n\nWe did write letters to our old friends back.\n\n30. If you got married, give the name of your husband or wife along with the date of marriage.\n\nMy husband was married in 1949 to Emma Johnson.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nWell yes, in this big country that ad my family grew up in, they came to be a large and very friendly community.\n\n22. If other members of your family (brothers, sisters, parents etc.) came West tell when they came and where they settled.\n\nMy oldest brother came West in 1950 at Hazel Cliff School. He had been farming in Maine.\n\nHe was a good friend of mine and came west to farm.\n\nTo be sure, my father's mother's brothers and sisters.\n\nThis wife had a dear friend.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOh yes, many happy memories abounded out in our David.\n\nOn those early days, my mother and I worked hard and played hard.\n\nThe fields of growing golden grain, the fields of harvesting, the fields of harvesting, the fields of harvesting.\n\nAnd when our first child was born, we had 2500 acres.\n\nHow happy we were going to school, how much we looked forward to walking down the road.\n\n24. What kind of schools did you attend?\n\nWe attended the Methodist Church and Sunday School.\n\nWe attended the school in the early years.\n\n25. How far did you travel to attend school?\n\nWe traveled about nine miles.\n\n26. What kind of transportation did you use?\n\nWe used horse-drawn buggies and wagons.\n\n27. What kind of work did you do?\n\nWe did farm work and did not travel very much.\n\n28. What kind of work did you do?\n\nWe did not travel very much.\n\n29. What kind of work did you do?\n\nWe did not travel very much.\n\n30. What kind of work did you do?\n\nWe did not travel very much.\nAbout 1908\n\nMuch in those days is meant the very early days.\n\nOn those who do much work to do in breaking up the land which was very bushy then and needed a lot of work getting it cleared and broken up. How ever we were able to go to church in the community - we often had house parties well all both young and old would get together and have games and other amusements and a good lunch - my father kept a great interest in his work English but he loved singing the old Scotch songs. Annie Savory and all the rest of us knew also a great deal of folk music as he was a good singer and full of telling bees and while the neighbour women to come and on the evening all their family would come by and we would have a grand time. Remember we as young girls did enjoy that - every summer there would be an excursion train go from Langenburgh to Rhinebeck for a day's outing - we very little that in we would go out with the team and wagon and came them there would become back - we enjoyed that day - as my uncle was married and living at Rhinebeck of late a chance to see the band play and hear the Galloping Ginny Band play on until he retired at the age of 65. He died when he was seventy-two years old.\nAbout 1908\n\nMuch in those days is meant the very early days.\n\nOn those who do much work to do in breaking up the land—which was very badly done—and planting a lot of work getting it cleared and broken up—there was no better as going to church in the community—we often had house parties well all both young and old would get together and have games and other amusements and a good lunch—my father being a good violinist and a good singer—my mother and all the rest of my brothers and sisters also a great talk at parties—or he were a good singer and full of life.\n\nI forget—remember how my brother would have building bees and invite the neighbors between 6 o'clock and 9 o'clock and the evening all their family would come by—and we would have a grand time—remember we as young girls did enjoy that every summer there would be an excursion train go from Langenburg to Obernburg—for a day or two—we very little knew that on our world go out with the team and wagon and because there would become back—we enjoyed that day—as my uncle was married and living at Obernburg—a chance to see the old Obernburg and hear the Salvation Army Band play—or until he retired at the age of 65—he died at the age of seventy-five years.\nmuch in those days I mean the very early days as there was so much work to do - in breaking up the land - which was very badly done and needed a lot of work getting it cleared and broken up. How busy we all were going to church in the community - we often had house parties well all both young and old would get together and have games and other amusements and a good lunch - my father loved a good entertain - he was English but he loved singing the old Scotch songs - Annie Laurie and All the Red Coats - as he was a good singer and full of fun.\n\nI forget to mention how my brother would have quilting bees and invite the neighbors here to come to sew - and in the evening all their family would come too - and we would have a grand time - remember we as young girls did enjoy that. Every summer they would have an excursion from 95 to Longueville - that in we would go out with the team and wagon and leave them there until we came back - we enjoyed that day - as my sister was married and living at Monmouth - I hope a chance to see her and hear the Salvation Army Band play.\nmuch in those days I mean the very early days.\n\nAs there was so much work to do - in breaking up the land - nothing was very busy. There and broken up. How ever as well as going to Church in the Community - we often had house parties. We all both young and old would get together and have games and other amusements and a good lunch - my father was a good entertainer - he was English and he loved singing the old Scotch songs. Annie Fawke and Bill the red gay brother in law were also a great help at parties as he was a good singer and full of jokes. Remember how my brother would have grilling bees and invite the neighbors to come to see - and in the evening all their family would come too - and we would have a grand time. Remember we as young girls did enjoy that - Every summer there would be an excursion team go from Sorgenburgh to Vermillion for a day's promenade - we very often lost that day as my sister was married and living at Vermillion. We were a chance to see her after and hear the Saloon Choir County Band play.\n34. Did any people move away from your district prior to 1913? What reasons did they have for moving?\n\nSome people moved away some went to Allentown, some to Pomeroy, Allentown, Wilbert, some to Lancaster. We moved Smith's Hopewell in the year 1913. We wanted to get nearer the school for our young children.\n\n35. Did many people move away during the 1920s? If so, why?\n\nNot many from this district with all the changes of those years we have at Hopewell generally had a little crop and garden during the day 300.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was the first justice of the peace in Hopewell. He was also a school district. He was chairman of the Board of Education. I have been an officer of various organizations such as Hopewell Women's Association, Hopewell Church Club, etc.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts; Post offices; Villages; Railways; Stations; Creeks; Hills, etc.) Try to give: (1) Name (2) Origin and meaning of name (3) Any changes in name since the first name was given (4) Date of its adoption (5) Any reason for change. Give dates of new name as above in (1), (2), (3).\n\nMy husband and I gave Hopewell its name about the year 1895. The names were not changed.\n\nI am enclosing to you some old copies and also the original of my Father No. the Office of Justice of Peace in 1897.\n\nPlease will you return them to us.\n\nI could write much more on my pioneer experience but I am afraid I would be too long.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome people moved away some\n\n35. Did many people move away during the year 1913? We wanted to get our children\n\nthe school for our young children\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nmy father was the first justice of the peace in Hayfield\n\nmy mother was the former school board member of the Board\n\nI have been a county organization such as\n\nWomen's Club - Women's Association of the Guild\n\nChurch - etc.\n\n37. If you or any of your family or friends were \"pioneer\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, graduating the first Lodge, etc.)\n\n38. How old the place is your community got its name? (School districts; Post offices; Villages; Townships; creeks, hills, etc.) Try to give: (1) name (2) date of the original place-name (3) origin and meaning of the name (4) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMy husband and mother gave Hayfield\n\nwe are still changing\n\nI am enclosing to you some old newspapers\n\nand also the official journal of my Father do\n\nthe office of Justice of Peace in 1897.\n\nPlease write you return them to me.\n\nI could write much more on my pioneer experience but I am afraid it would be too long.\n\nHave Alice Vie\n6.\n\n37. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written resolutions and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archivist by donation of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n4c. If you have children or grandchildren, please give their names where they live\n\nI have an only child - John Charles - born in Regina, Saskatchewan\n\ngirl - Agatha - born F.H. Thomas, Charlottetown, Prince Edward Island\n\nson - Harold G. - born in my town of Lloydminster, Saskatchewan\n\nwife - Mrs. Mary - born George Turner, Lloydminster, Saskatchewan\n\nson - Roy - born Granger, British Columbia - R.C.M. Police, Winnipeg, Manitoba\n\nI have eleven children -\n\nA1. What do you think are the most important changes in your community since you first came West?\n\nSpring Wheat-Changes have taken place during our life time - The local development here at Wapella is all discovery - which is proving to be very good well and good quality of oil\n\nMiss Alice Vis Neopalla Sandalowich\n\nPlease give the names and addresses of other historians who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\n6.\n\n30 Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, their ages, their addresses, their occupations, etc., and your relationship to each child.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSpring Great Change has taken place during our life time - The total development here at Wapella is all discovery which is proving to be very good well planned great quality of oil.\n\nPlease give the names and addresses of other persons who could answer these questions.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below.\n\n[Signature]\n\n[Signature]\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_508.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 89640, "total-output-tokens": 12376, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 136, 7], [136, 293, 8], [293, 544, 9], [544, 796, 10], [796, 2456, 11], [2456, 4122, 12], [4122, 5288, 13], [5288, 6400, 14], [6400, 7812, 15], [7812, 9177, 16], [9177, 9986, 17], [9986, 10799, 18], [10799, 11315, 19], [11315, 11829, 20], [11829, 12364, 21], [12364, 12860, 22], [12860, 13863, 23], [13863, 15387, 24], [15387, 16826, 25], [16826, 17704, 26], [17704, 18702, 27], [18702, 19567, 28], [19567, 20868, 29], [20868, 22256, 30], [22256, 24017, 31], [24017, 26107, 32], [26107, 26232, 33], [26232, 26354, 34], [26354, 28162, 35], [28162, 28162, 36], [28162, 29805, 37], [29805, 31568, 38], [31568, 32763, 39], [32763, 33426, 40], [33426, 34464, 41], [34464, 36371, 42], [36371, 37573, 43], [37573, 38793, 44], [38793, 39873, 45], [39873, 40907, 46], [40907, 40907, 47], [40907, 40907, 48], [40907, 42742, 49], [42742, 44244, 50], [44244, 45902, 51], [45902, 47133, 52], [47133, 47280, 53], [47280, 47434, 54]], "primary_language": ["None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]