[{"id": "af174089396a4022be520eaf7196390953897a26", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA set of instructions to the person completing this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\n6. Later data - Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. JANET DOWNIE\n\n2. Your address: ROLLA, BRITISH COLUMBIA\n\n3. Date: APRIL 28, 1952\n\n4. Where were you born? (Give name of place and country)\n   TROTTICK near DUNDEE - SCOTLAND\n\n5. What was your father's name and occupation?\n   WILLIAM DOWNIE\n   OATMEAL MILLER\n\n6. When did you come to Saskatchewan? (Give month and year)\n   MAY - 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   18 years old\n\n9. What were your reasons for coming West?\n\n   I came to my uncle who had seven sons and no daughters, and my aunt wanted help, and I was not satisfied with the working conditions for a servant girl in Scotland and I have never regretted coming to Canada.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n\n    My husband and I came to Saskatchewan in 1901. We learned about it from a letter in the Farmers Advocate from a letter written by a farmer in the Carrot River valley a district now known as Melfort (Reginald Betty) was the writer, and he told the truth. So we came after seeing the country and settled there for 24 years and would have stayed on had not my husband's health failed and Dr. ordered him to a milder climate.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. JANET DOWNIE\n2. Your address: ROLLA, BRITISH COLUMBIA\n3. Date: APRIL 28, 1952\n4. Where were you born? TROTTICK near DUNDEE - SCOTLAND\n5. What was your father's name and occupation? WILLIAM DOWNIE\n6. When did you come to Saskatchewan? MAY 1901\n7. Mention any other places where you lived before coming to Saskatchewan giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may be a small child.)\n\n9. That were your reasons for coming West?\n\nMy husband and I came to Saskatchewan in 1901. We learned about it from a letter written by a farmer in the county. We came after seeing the country and settled there for 4 years and now we have stayed an hour past my hundredth birthday. Climate...\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. JANET DOWNE\n\n2. Your address: ROLLAND, BRITISH COLUMBIA\n\n3. Date: APRIL 28, 1952\n\n4. Where were you born? (Give name of place and country)\n   TROTTICK NEAR DUNDEE - SCOTLAND\n\n5. What was your father's name and occupation?\n   WILLIAM DOWNE\n   OATMEAL MILLER\n\n6. When did you come to Saskatchewan? (Give month and year)\n   MAY - 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   18 years old\n\n9. What were your reasons for coming West?\n   I came to my uncle who had seven sons and no daughters, and my aunt wanted help, and I was not satisfied with the working conditions for a servant girl in Scotland and I have never regretted coming to Canada.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    My husband and I came to Saskatchewan in 1901. We learned about it from a letter in the Farmers Advocate from a letter written by a farmer in the Carrot River valley a district known as Melfort (Reginald Betty) was the writer, and he told the truth so we came after seeing the country and settled there for 24 years and would have stayed on had not my husband's health failed and his ordered him to a milder climate.\nSASKATCHEWAN ARCHIVES SUSPENSIONS\n\nNo. 2\n\nPILOT EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct or if you have any questions about the writing at your disposal, please say so. If you rather have someone else do the writing at your disposal, this is quite acceptable.\n\n1. Your full name: MRS. JANET DOWNIE\n\n2. Your address: ROLLAND, BRITISH COLUMBIA\n\n3. Date: APRIL 28, 1952\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. What did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\n\"I was 18 years old.\"\n\nMy husband and I came to Saskatchewan in 1901. We learned about it from a letter written by a farmer in the Carrot River valley district, and he had heard of the land (Regina) as the writer and his wife and settled there for 24 years and would have stayed on had not my husband fallen ill to a malarial climate.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWhen I left Scotland my father did not like the idea of me coming but my mother said if I was to better myself by all means go. And I have had better health here.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI travelled from Scotland with friends.\n\n13. What means of transportation did you use?\n\nBy boat from Glasgow to Montreal second class (cost just 50 fifty dollars from Dundee to Winnipeg Manitoba) horse buggy from railroad to farm four miles. This was in Manitoba on the Winnipeg and Brandon line.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWhen I came to Saskatchewan in early June came by train to Prince Albert had two small children aged 3 and 2 then by team for 64 miles when we came to the Saskatchewan river was running so high the boatmen would not bring us across so we had to walk several miles lying at our feet in the morning. The boatmen took us across in the evening of our own risk. The roads were terrible to take 22 hours to come 16 miles through a boggy slough. We landed at an old house very tall.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe last place was Letha Springs about five miles away. Later we got a PC called Ethelton named after the daughter of an old pioneer Mr. Gail Ethel.\n\n16. Where did you settle or take up land?\n\nIn the Ethelton District in the Carrot River valley the land is the best in Canada there.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMy husband and I moved to Chilliwack in December 1925. He died September 1927. I moved to the Okanagan Creek area in 1929 and am living there near my two daughters.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn Scotland I was a servant in private houses. When I came to Western Canada as a maid I helped my aunt and received seven dollars a month and did work that no girl would do now for sixty a month times have changed.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWhen I left Scotland my mother said \"Oh, you'll never go back there again.\"\n\nBut my father said \"Go, you'll have a good time.\"\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled from Scotland with friends.\n\n13. What means of transportation did you use?\n\nBoat first 50 miles by boat then by railroad to Prince Albert.\n\n14. What was the journey like? Do you remember any particular incidents?\n\nThe journey was very long and tiring.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy husband and I moved to Chilcotin in December 1925.\n\n16. How did you settle in the land?\n\nWe bought land near Chilcotin.\n\n17. How did you earn a living before coming to Western Canada?\n\nI was a servant in England.\n\n18. How did you earn a living after coming to Western Canada?\n\nI worked as a housewife and received seven dollars a month and did wash that no girl would do now for sixty cents.\n19. How often did you write to relatives or friends in your old home?\n\nWhen Mother was alive I wrote once every two weeks and to several friends quite often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married the oldest son of my uncle. My husband's name was Alexander Dwayne. I did not change my name and am still Jane Dwayne.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, three other families came and settled near us on our recommendation of the land and a place to make a home. Two of the families are still there.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nYes, three other families came and settled here. My mother came from Scotland in 1878 and started a blacksmith shop on our farm at a place which is now Handview, Manitoba. Then two more brothers came to Handview around then or four. I just don't remember some of the family are there yet.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nIn the first two years of my married life I often could not write a letter for a month. I had not the price of a stamp. When my letter did not arrive at my mother in Maine, the next letter from her would have been dollar bills in it. We got our groceries with a pound or two of butter at $5.40 lb and a few eggs at 6¢ each. I had four children, two of them born no one with me while my husband was gone to get a neighbour who had a O. But those days the neighbours were kind and helpful and we helped each other out. I wish I could have been with Mother at childbirth, with no O but it was a very trying experience.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot very much in Saskatchewan and had to go to Prince Albert 64 miles to do any business. Had a little grocery store about five miles away. We church in the homes for several years then got a church built by the minister with help from the people. We visited the few neighbors quite often had gatherings and dances in the homes of with a violin or three stringed fiddle by a neighbour's boy and we had good times together. The distance about six mile limit travel by horses and lumber wagons for many years.\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall, when they came and where they settled.\n\n23. Is there any particular experiences of pioneer days that stand out in your memory which you would like to record?\n\n24. Had you traveled about much in the early years? (For hundreds of miles) attending church, visiting friends, etc.)\n\n25. How often did you write to relatives or friends by your old home?\n\n26. When did you first arrive at your new home?\n25. When was the first car used in the community?\n   *Think about 1910 or Shadd got one*\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   *We got a car in 1913, a Model T Ford*\n\n27. Where was your trading center? How far from your home?\n   *Prince Albert, 64 miles until the railroad came to Melfort, think about 1903.*\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   *After the railroad came to Melfort and little towns sprang up around the post office, then there were buggies and cars which made travel easier.*\n\n29. How often did you shop in the early days?\n   *About twice a year once in summer and then just before Christmas that is in the largest town.*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   *It was after I left there I think perhaps about 1932 they nearly all go now I notice when I visited that district three years ago.*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   *I never purchased from the mail order house, for anything I could get at the local store but dry goods I sent for as soon as the local stores got the dry goods and clothing I got them also. I still don't send to the mail order stores I believe in trading in the home town.*\n\n32. When did you first have a telephone and what company provided it?\n   *I don't remember the year. It was a company started by the farmers called the Fleet Service Syndicate.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   *As soon as we came to Saskatchewan to the farm my husband decided to buy the first time he saw it. In May 1901 a section at three $100 dollars an acre from Gundy and Gundy in Winnipeg.*\n25. Than was the first car used in the community?\n26. If you bought a car before 1914, when did you buy it? What make?\n27. Where was your traveling center? How far from your house?\n28. Did you continue to travel there? (Indicate any changes due to new terms appear-\n   ing, better means of travel, etc.)\n29. How often did you shop in the early days?\n30. When (if ever) did people in your district first start going to town regularly\n    on Saturdays?\n31. What kind of articles did you buy by mail order? Indicate also what fraction of\n    your total purchases were by mail order and any changes in the proportion of\n    purchases made by mail order since the pioneer period.\n\nI never purchased from the mail order house\nfor anything. I would get at the local store\nthat they had goods I needed, as at the local\nstore got the dry goods and clothing 89¢\nthem also, I only don't send to the main\norder stores selling in trading in the\nPoveshell Town.\n\nAs soon as we came to Saskatchewan\nwe decided to buy\nthe first time we came in May 1901\na section at three $100 dollars an acre from\nGundy and Sandy in Winnipeg\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo I cannot recall anyone moving away, a good many moved into the districts around and they have stayed until death or ill health has made them move.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo, the descendents of the pioneers are occupying the land of their parents.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was school trustee for several years and I had different offices in the Ladies aid which was the only women's organization those days. It was around 1903 and 1905 they started but I cannot remember.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nWe got our first car in 1913. I am sending a picture.\n\nThere were three cars in the Valley before we got ours.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSletts Springs P.O. got its name from a farmer by the name of John Slett who settled on a farm which had a spring of water which never went dry and which seemed bottomless if anything fell into it such as ice boxes and things that never came out.\n\nEthelton P.O. Station and little town got its name from a farmer an old pioneer who wanted to honour his daughter Ethel. There were hills but they had no name. There was a creek that ran through the district named Goose Hunting Creek. They said it got its name from a lake (the source of the creek) the favorite hunting ground for geese. I don't know whether that is right or not. I don't remember the dates there has been no change in names.\n5.\n\n36. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nNo I cannot recall any one moving away a good many moved into the districts around and they have stayed there until death or ill health has made them move.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo. The decrease of the farmers was accompanied by the land of their parents.\n\n26. If you or some member of your family have held public office, or have been active in civic organizations, mention here, giving dates wherever possible.\n\nMy husband was School Trustee for several years and I had different offices in the Ladies Aid which was the only women's organization then. It was around 1903 and 1905 they started but I cannot remember.\n\nWe got our first car in 1919. I am sending a picture.\n\nThere were three cars in the valley before me you know.\n\n37. If you or any of your family or friends were interested in the district mention it here giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School Districts, Post Offices, Villages, Railway Stations, Streets, Hills, etc.). Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change.\n\nThe name of John Elliott who settled on a farm which had a spring of water which was very handy and which we always called \"water hole\" if anything came out which was heavy and things if they needed water.\n\nElliott GO Station and little town called to honour his daughter Ethel. She was killed but they had no name for a town so they named it after her name.\n\nGould was a man who came through our district and said he would name a lake (the source of the creek) the \"Gould Lake\" if he could find a name for it. So they named it after him.\n\nIt is said that Gould never knew the name that has been used for many years because the name has been changed in name.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\n1. Photos of first Ford Car Picnic, organized by the Women's Institute, Lake Leech, 1915.\n\n2. Log house frame house, team of horses.\n\nEnvelopes containing 10 snaps, one of which is to be returned to Mrs. Downie, Rolla, BC. This one is \"Our first car - the family 1915.\"\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have two daughters both here in the Peace River Country. Rolla B.C. married the oldest Margaret Downie married to Mr. Marie the youngest Harold Mac married to Alfred Eagles Staff. Five Granddaughters Gay Wiles married to Stanley Loring shorts Editor and the Morning Herald Vancouver B.C., Thelma Wiles married to Gerald Root a free lance actor in Vancouver B.C. A granddaughter Audrey Hallworths in the Park School Toronto Dawson Creek. The other two going to school and in high school one in grade 6 in Bathurst School.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe railroads from Winnipeg to Prince Albert through Melfort then branch lines from Melfort to Saskatoon and from Melfort to Humboldt one going through Ethelton and a good trading center in Melfort Saskatchewan.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJames Reams Ethelton Sask\nMeth Felix Believin Ethelton Sask\nMr. Saunders Rathlau Sask\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMy granddaughter did _______________________\nthe printing for me all the rest I filled out myself.\nQuestions regarding historical sources material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections, and reminiscences? (Describe).\n\n1. Name of place you have lived in longest.\n\n2. Name of town where you were born.\n\n3. Name of town where you were married.\n\n4. Name of town where you now live.\n\n5. Name of town where your parents lived.\n\n6. Name of town where your grandparents lived.\n\n7. Name of town where your great-grandparents lived.\n\n8. Name of town where your great-great-grandparents lived.\n\n9. Name of town where your great-great-great-grandparents lived.\n\n10. Name of town where your great-great-great-great-grandparents lived.\n\n11. Name of town where your great-great-great-great-great-grandparents lived.\n\n12. Name of town where your great-great-great-great-great-great-grandparents lived.\n\n13. Name of town where your great-great-great-great-great-great-great-grandparents lived.\n\n14. Name of town where your great-great-great-great-great-great-great-great-grandparents lived.\n\n15. Name of town where your great-great-great-great-great-great-great-great-great-grandparents lived.\n\n16. Name of town where your great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n17. Name of town where your great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n18. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n19. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n20. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n21. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n22. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n23. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n24. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n25. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n26. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n27. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n28. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n29. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n30. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n31. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n32. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n33. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n34. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n35. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n36. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n37. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n38. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n39. Name of town where your great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-grandparents lived.\n\n40. If you have children, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nMy granddaughter did all the writing for me.\nMrs. Janet Downie\n\nBalla, B.C.\n\n2 photos\n10 snaps\n(missing)\none Chicago\n\nMay 14, 1952.\na pioneer to\nFletto Springs\nabout 1897\nJohn Fletto\nA Trampers To\nLetto Springs\nAbout 1894\nJohn Lelett\nMrs. Murphy\ncame West 1904\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_621.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 8830, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1930, 5], [1930, 3713, 6], [3713, 5520, 7], [5520, 6632, 8], [6632, 8431, 9], [8431, 9685, 10], [9685, 11863, 11], [11863, 12887, 12], [12887, 15341, 13], [15341, 16035, 14], [16035, 18143, 15], [18143, 19253, 16], [19253, 21457, 17], [21457, 23571, 18], [23571, 25797, 19], [25797, 31648, 20], [31648, 31648, 21], [31648, 31648, 22], [31648, 31648, 23], [31648, 31735, 24], [31735, 31786, 25], [31786, 31837, 26], [31837, 31837, 27], [31837, 31837, 28], [31837, 31837, 29], [31837, 31864, 30], [31864, 31864, 31], [31864, 31864, 32], [31864, 31864, 33], [31864, 31864, 34]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "en", "None", "None", "None", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]