[{"id": "fa0e0801e27666580ba8f51a762f655431f6b23b", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nHislop, W.F.,\nAroloa.\nTo Sask. - April, 1932\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another.\n\nSome of the questions here will not apply to everyone; therefore, others may prove impossible for you to answer, consequently, please leave blank spaces, fill in answers if possible, or make up particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1874, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or copy for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days That Yielded Western Canadian Pioneers East,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMy Father Brot Dominguez and Car to\nWisconsin in 83 freight cars at that time\nwere small they held 640 bushel each\nDressed out Nov 30th arrived at Wisconsin Apr 7th\nMy oldest Brother John came with him on first car\nthey were allowed 16 head of cattle & horses He had\n2 old horses 4 Cows 3 sheep 1 little white Don\n1 dog and 1 cat 11 hens and 1 Rooster also another half\nhousehold of feet farming drill set 1 sleighs\n3 sheepers of my Father met him at Wisconsin they\nhad homesteaded at Moore Butten in 1881 they had\neach a 40 acre of land they loaded up the afternoon of April 7th\nstarted for Moore Butten the cows and ponies followed sleighs\nthey had unloaded in crate but she broke 1/2 mile out\nof Wisconsin from then on she walked with cows\nshe raised 9 little pigs that summer that was our winters\ngreat they came out tonight on way they shovelled snow\n& ground them without tent the car rode in drum & farming\nmill when tent set up cat would jump out and mills\ntent when tent taken down in morning the cat would\njump into farming mill the 3 sheep all lives were not\nin lamb I had 1 end lamb its other half were ram and ewe\nbut its ram died so had no ram and no sheep anywhere\nwithin 100 miles or even in N.Y. as far as Father knew\nbut a family by name Warner who settled near whitewater they\nBrot Car settlers off to the spring of 1884 they came from\nBrussels Father's Brother sent a love visit rain lamb with\nthem form Father drove around the lake fall of 84 and got\nthe rain lamb when coming West on Freight train it\nstopped 2 hrs in Chicago Father went for walk the Dog\nCows by name came with him he returned to Freight Car\nin good time but our dog he anxiously watched for it\nexpecting the train to pull out any minute but finally\njust before the train moved the dog appeared tepid then\nCar and it reached Moore Butten safely\nFather's first immigration was to Greenbush in 1853. They purchased land there from Mr. Wall for $400. They worked hard.\n\nIn 1862, our brother John married Elizabeth Brown. They were allowed to homestead 160 acres. He had two dogs and several sheep. They also raised chickens.\n\nIn 1873, they moved to Wisconsin. They had a total of nine children. They started off poor but they ended up rich.\n\nThey had a good life. They worked hard and saved money. They bought land and built a house.\n\nThey lived happily until John died in 1900. Elizabeth continued to work hard and raise their children.\n\nThey were a hardworking family who always looked out for each other.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: William T. Hislop\n\n2. Your address: Arcola, Sask.\n\n3. Date: June 4th, 1953\n\n4. Where were you born? (Give name of place and country): Ont. Grey H. Huron Co.\n\n5. What was your father's name and occupation?: Thos. Hislop Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): Apr 11th, 1883\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: Grey H. Huron Co. Out. Bruce P.O. 1873 to 1883\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 10 yrs Born Feb 23rd 1873\n\n9. What were your reasons for coming West?: Came with Father Mother Sister & Brothers\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Father came west in 1882 homesteaded built pole shanty and stable went east west winter sold out we all came west in '83\nHirola W.T.\nArcola.\n\nTo Sask. - April, 1883\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: William T. Hislop\n2. Your address: Arcola\n3. Date: March 30th, 1953\n4. Where were you born? (Give name of place and country): Grey Co., Ontario\n5. What was your father's name and occupation?: Thomas Hislop, Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 11th, 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: Grey Co., Ontario, Co. Our Prarie, P.C.A.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" if you were in your teens, etc.)\n9. What were your reasons for coming West?: To earn a living and find better opportunities.\n\nSister & Brothers\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Father came west in 1883\n    Homesteaded two-mile plot shortly after stable-two-acre eastward\n    Winter sold out—we all came west in 1883\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   *with Mother Sister Brother and Uncle*\n\n13. What means of transportation did you use?\n   *Railroad*\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n   *changed cars 5 times Wingham London Chicago St Paul Winnipeg stayed in Wpg from Saturday morning to Monday morning reached Hopeville same night after dark left next morning for Moose Lake by sleigh horse team distance 65 miles reached destination 3rd night 1/2 stage in log house at Butter Creek the creek had broke transferred to wagon to cross the water was running 2 or 3 ft deep steep banks high snow melting reached shanty before dark and living on same place today*\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   *same place as today*\n\n16. Where did you settle or take up land?\n   *Sp. July 30 T# 8 R# 4 W# 5 and Father's homestead filed on in 1842.*\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   *Farming*\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\nRailroad\n\n14. What incidents of the journey best do you remember? (People you met on the way? Meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nchanged cars 5 times through London Ontario\n\nSt Paul Wisconsin stayed in loop from Saturday morning to Monday afternoon reached Minneapolis Saturday night after dark left for Edmonton Sunday morning after dark left for Edmonton for breakfast at 6:30am reached Calgary Tuesday morning at 9:30am another creek its creek head broken by washed away river other water was running on 3 bluffs steep slopes high river on same side today\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSame place as today\n\n16. Where did you settle or take up land?\n\nField on 8 R 7 W 2nd quarter homestead\n\n17. Mention any other places you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How about you now?\n19. How often did you write to relatives or friends in your old home?\n   about once a month\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n   Eva Kippman Dec 3/9/3 8 miles N.W. of Carlyle\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n   Father, mother & Brothers/Sister Apr 11st 1883\n   Moose Jaw District all lived and died here\n   1 sister still living in Areola\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record?\n   hauled our wheat and products to Moose Jaw 65 miles\n   till 1891 then to Carlton 45 miles for 7 years\n   3799\n   alarmed from 92 to 1900 when R.R. came to Nicola\n   threshing machine accident Sept 11-1914 by which\n   my Brother John was killed aged 48 the feeder belt\n   came off went to put it on put foot on hub of front wheel\n   it slipped off put hand on separator feeder belt caught\n   under grain belt wound up his arm tore arm off Died\n   3 1/2 hrs later\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n   much freighting Brother Joe made 2 trips to Moose Jaw\n   with wheat season of 1884/85 took 4 days to go and come\n   with horses 5 days with oxen 65 miles\n   I had horses Brother Archie made many trips to Moose Jaw\n   some gas with oxen loaded with wheat church was\n   held in our shanty for some months summer 1883\n   shanty size 14'x16' in 2 beds stone cut board bricks\n   chairs 30 or 40 people came to service Mr. Leed was\n   student he walked from place to place service held\n   every 2 weeks presbyterian Mr. Leed afterward became\n   principal of Regina Boardian School where he died many\n   years ago\n   and starting for mission 1881\n19. How often do you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\n25. What was your occupation at this time?\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   [Handwritten text not legible]\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction or your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   [Handwritten text not legible]\n\n32. When did you first have a telephone and what company provided it?\n   [Handwritten text not legible]\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1911\n\n26. If you own a house before 1914, when did you buy it? Next month.\n\n27. What was your trading center? (Name town)\n\n28. Did you continue to make them? (Initiate any changes due to new terms appear-\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since then.\n\n32. Did you ever have a telephone and what company installed it? Still own it.\n\n33. Were you ever forced to change your place of residence?\n\n34. When did you come to Saskatchewan the first time? Was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome people moved away in early days reason great distance from R.R.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSome moved away few returned\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nFather 1st J.P. 1883 1st postmaster of Clare 1884\n1st Returning Officer Inwood Inter Cours 1884\nsent Bushed to London to Colonial and Indian Exhibition\nLondon Eng. 1886 to Bronze Medal for still have it\nin my possession the first year grown in 1885\nFather was a director of the first Greenfield agricultural society\nformed in 1885 fair held in old Carlyle held about Oct. 1st 1887\n13 miles from here\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1) & (2), (3).\n\nClare post office named after place in Ireland\nsuggested by Mr. Mortimer an early settler at meeting\nheld at outstanding summer of 83 shop & did not operate\ntill early in 84 the name Arcola was suggested\nby a post Office Inspector by Mr. Ford the name\nagreed by settlers was the same as another P.O. in\nWestern Canada so shop changed it to Arcola the hills\nwere called potato hills it was named by me in 1883 as it\nresembled potato hills but at that time Hopewell lake\nafter H.J. Hopper who built shanty and wintered huts\nthere 1890-91 McLeary lake after Sam McLeary who built\nshanty there to cut logs for house in early winter of 1893-4\nHopewell town lake after Jim Dan Hopper who built shanty\nand stabling for their stock 1887\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nSome people moved away in early days.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome people moved away from R.R.\n\n36. If you or some member of your family have held public offices, or have been active in any charitable clubs mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were interested in politics, give details.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person (2) date and reason for change. Give facts of name above in (1) and (2).\n\n39. Did any of your ancestors serve in the military?\nA short account of first meeting held at our shanty to petition for post office and recommend J. P. about 25 people gathered. It was decided to petition for J. P. to be named Clare. Hugh Hazzard and Irishmen wrote out petition. It was signed by all Diet. That was early in summer of 1883. The postmaster General recommended the P.O. It was established early in winter of 84. Thos Hielop Jr. Father was recommended for Justice of the Peace on motion of Tom Reed an Englishman born in 1804 but who settled in Outmore section when young man. His homestead was 5 miles south of here. Hazzard lived 1/2 miles West and North of here. Brother and sister fed the people that evening after meeting. Young men played catch with ball.\n\nCapt. Mr. Pierce who promoted and established Cunningham Manor and Diet held meeting here in July of 1884 to get bonuses for building grist mill. His oldest son Duncan and R. Bird later member Moose River Trading Co. They had Democrat and 2 horses. They stayed with us overnight. Duncan and Bird slept in stable to protect team from horse thieves several of farmers of 45 bonus to mill some gave 60 15 bonus per year till paid the mill started to operate fall of 1886. The Capt. was big man near 6'5\" corpulent must have weighed at least 240 lbs. Our 3 horses was stolen early in July one Sunday night in 84. Father walked to Carlyle next morning 13 miles there. J.G. Turiff a store keeper lent him horse and buckboard. He drove to junct of Missouri Creek and Souris River 30 miles to identify M.W.P. P. 6 of ours camped there 6 weeks later police brought back 3 horses. Lone police name Leagre was scouting in North Dakota South Souris River to came on 2 driving some horses 3 of them ans description of ours he took possession. Bro. then home they were ours.\n\nW.T. Hielop\nA short arc of new meeting held at our\nshady to petition for poor relief and\nrecommend P. about 75 people attended\nit was treated to petition for p.68 to Harold Clare\nit was signed by all\nsummer of 1883 the postmaster General\nrecommended its P.O. it was established early in\nwinter of 84 when Philip Gray started to run\ntown road as a ditch crew. Born in 1804 but\nwho settled in Carne near action when young been\nhis house lead across similar route where he raised\nlined 13 miles near and bought three brothers\nSister had six people that became after preaching\nyoung men played catch with till\n\nCapt. Mr. Pierce who promoted and established\nBannington Branch and Pier held meeting here\nin July 8/1884 to get Bannor for building's\ngreat Amill his older son Duncan and R. R. Reid\nWater number three Bannor trading Co. play had\nthree nights Duncan and Bird played in plate\nto protect team from horse stolen several 87\nFarmers $48.00 would be paid for each 60\n18 Bux per year till paid the grill estate & operate\nfully 8/886 the Calvary by means near 68\nCorps led around Knowles yard at least 2400\nonly 3 hours was stolen early ~ July one sunday\nnight in 84 father walked to Carlyle over morning\n13 miles there. G. Swafford also helps them him\nhouse and purchased he drove to bannor\nand Bannor River 26 months later police brought back\ncampaigned 6 weeks later police brought back\nto 3 homes slow police known because they was\nacquiring in house Bob Smith Louis River to cause\non 8/886 some horses 3 yd claim and description\nof ours to take possession Bro then know they were ours\n\nW. T. Pickett\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of old letters, old photos and photographs, written recollections and reminiscences, pamphlets, etc.? If so, please describe them.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any:\n\n40. If you have children or grandchildren, please give their names, where they will be living, and occupations.\n\n5 children: 9 grandchildren\n\nAnnmarie married to Mr. Smith\nGlenn married to Mrs. Smith\nLillian married to Mr. Smith\nDonald married to Mrs. Smith\nEllen married to Mr. Smith\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe coming of the railroad\n\nTo reach the first big change was the discovery of oil in 1879\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n[Signature]\n\n[Address]\n6.\n\n39. Questions regarding historical source materials:\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon?\n\nInitiate your preferences, if any.\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations:\n\nChildren: [Names]\nGrandchildren: [Names]\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThe evening of the railroad coming by automobile\n\nTo the first day charge was the Blower attached to locomotive\n\nPlease give the names and addresses of other persons who could answer these questions.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\nAn Account of Church & School History of\nthis parish in one family since 1883\nthe final missionary in this parish was\nPresbyterian Student Rev. James Freeland from\nKinnettles. He came in May and left in October\n1st Oct-1878 to 1879 he held service every 2 weeks along\nthe north side of Preston Road. He worked from place to\nplace through the parish ministering Presbyterian\nchurch camps to Carlisle / 30 miles across the river from\nhere in fall of 1873 his missionary Rev. Wilson\nhad a wife the settlers built him a house by\nQuince Hill and played 3 yrs then Rev. Powell\nwho started 3 yrs both married with children\nand they all lived in building until Carlisle\nThe second presbyterians arrived 4 yrs\nfrom P.E.I. The earner in May left Carlisle at the end of\nOctober back held service every 3 weeks that way 1879\n1878 Student Anna Jackson played for months\nthen returned by horseback a trip church\nand I think the Home Mission saw 950 in\n1879 ordained by James Brownly from Scotland to\nserve in winter was held in April house church\nwas named in fall of 1879 699 people there\nfound stayed for 3 yrs then earner was called\nfor four months. In 1887 named Glass Pro 83\nthen bought and build in 1887\nthe first church was opened May 1887\nthen school was opened May 1887\neach year was received from hilltop Schoolhouse\nthe schoolhouse needed a new roof in 1888\nits final season it was for 6 months each yr 1887\nyear the S.S. completed a whole 6 months\n1887-88 grew to 100 students for 2 months\nand 3 in 1888 Rev. Godley traveled by foot east\nRev. Godley had happy and Buck Board her husband.\n\n(Place Name)\nBy your signature\nW.J. McKeep\nAn account of the church and school history of\nthis parish from 1879 onwards.\n\nThe first missionary in this parish was\nPresbyterian Student. He came from\nGlencarlin in 1879 and stayed there\nfor two weeks every month along\nthe north side of the river. He worked from place to\nplace the next year.\n\nIn fall of 1883 he moved to Carleton\nChurch and continued preaching there until\n1885 when he moved to Newcomb.\n\nThe second missionary was an ordained\nPresbyterian who started in 1886 and married with children.\n\nThe third missionary was a student from\nP.E.I. He came in May and left in July.\n\nOn June 24th, 1887 the school opened\nand I think the name was \"Newcomb School.\"\n\nThe fourth building was opened in 1888\nand closed in 1890.\n\nThe fifth building was opened in 1891\nand closed in 1893.\n\nThe sixth building was opened in 1894\nand closed in 1896.\n\nThe seventh building was opened in 1897\nand closed in 1899.\n\nThe eighth building was opened in 1900\nand closed in 1902.\n\nThe ninth building was opened in 1903\nand closed in 1905.\n\nThe tenth building was opened in 1906\nand closed in 1908.\n\nThe eleventh building was opened in 1909\nand closed in 1911.\n\nThe twelfth building was opened in 1912\nand closed in 1914.\n\nThe thirteenth building was opened in 1915\nand closed in 1917.\n\nThe fourteenth building was opened in 1918\nand closed in 1920.\n\nThe fifteenth building was opened in 1921\nand closed in 1923.\n\nThe sixteenth building was opened in 1924\nand closed in 1926.\n\nThe seventeenth building was opened in 1927\nand closed in 1929.\n\nThe eighteenth building was opened in 1930\nand closed in 1932.\n\nThe nineteenth building was opened in 1933\nand closed in 1935.\n\nThe twentieth building was opened in 1936\nand closed in 1938.\n\nThe twenty-first building was opened in 1939\nand closed in 1941.\n\nThe twenty-second building was opened in 1942\nand closed in 1944.\n\nThe twenty-third building was opened in 1945\nand closed in 1947.\n\nThe twenty-fourth building was opened in 1948\nand closed in 1950.\n\nThe twenty-fifth building was opened in 1951\nand closed in 1953.\n\nThe twenty-sixth building was opened in 1954\nand closed in 1956.\n\nThe twenty-seventh building was opened in 1957\nand closed in 1959.\n\nThe twenty-eighth building was opened in 1960\nand closed in 1962.\n\nThe twenty-ninth building was opened in 1963\nand closed in 1965.\n\nThe thirtieth building was opened in 1966\nand closed in 1968.\n\nThe thirty-first building was opened in 1969\nand closed in 1971.\n\nThe thirty-second building was opened in 1972\nand closed in 1974.\n\nThe thirty-third building was opened in 1975\nand closed in 1977.\n\nThe thirty-fourth building was opened in 1978\nand closed in 1980.\n\nThe thirty-fifth building was opened in 1981\nand closed in 1983.\n\nThe thirty-sixth building was opened in 1984\nand closed in 1986.\n\nThe thirty-seventh building was opened in 1987\nand closed in 1989.\n\nRev. Godley travelled by foot in 1875\nRev. Godley had horse and buckboard but had horses\n\nPlace: [illegible]\nBy: [illegible]\nW.T. [illegible]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_402.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 8365, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1976, 3], [1976, 3800, 4], [3800, 5634, 5], [5634, 6294, 6], [6294, 7649, 7], [7649, 9009, 8], [9009, 10315, 9], [10315, 11473, 10], [11473, 13472, 11], [13472, 14166, 12], [14166, 15257, 13], [15257, 16264, 14], [16264, 18456, 15], [18456, 19260, 16], [19260, 21059, 17], [21059, 22651, 18], [22651, 23902, 19], [23902, 24809, 20], [24809, 26439, 21], [26439, 29429, 22], [29429, 29584, 23], [29584, 29738, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]