[{"id": "8f1bcaba02ab8daf759db6ca67d0f8ef81132da2", "text": "WHAT DID WESTERN CANADIAN PIONEERS EAT?  \nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Catherine R. Young\nAddress 306 York Ave., Regina\nBirthplace Redcliff, Alberta\n\n1. INDUSTRY QUESTIONS\nWhat year did you start housekeeping in Western Canada? 1895\nWhere did you set up housekeeping? Portage la Prairie\nWhere had you been living before that? Regina\nFor how many people did you prepare meals? 3 (my husband, self, son)\nHow far was it to your nearest store? On the prairie, 12 miles\nHow often could a visit be made to the store? Occasionally\nWhat groceries did you usually buy in those earliest years? Sugar, flour, beans, tea, coffee, cornmeal, currants, dates, rice, tapioca, B chuckle, olives, fruits, rolled oats, evaporated milk.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? Ogilvie's Royal, Household, & Purity Flour\nIn what quantities did you buy it? By the 100 lbs.\nWhat was the usual price per hundred pounds of white flour? about $3.50\nHow much did you use graham flour? around 30 lbs per year\nWhole wheat flour? about 20 lbs\nWas flour milled locally? No, how far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? $1.00\nWhat other grain products did you use? Corn meal\nCornmeal? 40 lbs Whole wheat? 20 lbs Farine?\nOther?\nDid you grind your own wheat for porridge? Yes, bought from dealers\nHow did you grind it? Handground at home Dealers\n1. INTERESTING QUESTIONS\n\nWhat year did you start housekeeping in Eastern Canada?\n\nWhere did you set up housekeeping?\n\nHow long have you been living there?\n\nFor how many people did you prepare meals?\n\nHow far was it to your nearest store?\n\nHow often could a visit be made to the store?\n\nWhat groceries did you usually buy in those earliest years?\n\n2. FLOUR AND MILK PRODUCTS\n\nIn what quantities did you buy flour?\n\nThat brand of white flour cost how much per hundred?\n\nHow much did you use rye flour?\n\nWhole wheat flour?\n\nWas flour milled locally?\n\nWhat was the usual price for a twenty pound bag?\n\nDid you grind your own wheat for porridge?\n\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 6 lbs.\nWhat was the price for a ten pound sack of white sugar? 50¢\nWhat brand of golden corn syrup did you use? Bee Hive\nWhat size of tin of syrup did you usually buy? 16 oz.\nAt what price? around $0.45\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Had dairy herd\nbutter? churned cream eggs? Poultry chickens: 50¢/dozen\nWhat was the price of butter? 10¢/lb. of eggs? 12¢/dozen\nDid you pick eggs for winter? Yes, how? kept them\nDid you make butter? Yes, how? only butter\nDid you make cheese? Yes, how? only butter\nWhat kind of cheese? Cottage cheese\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Butchering our beef\nand pork\nHow did you get fresh meat? raised the animals\nHow often did you get fresh meat? a portion\nHow did you preserve meat? salted, dried & smoked\nWas there a \"beef ring\" in your neighborhood? Yes, after some years\nIf so what year was it organized?\nDid you use game? Yes, what kinds? Pheasant, chicken\nFor how long? 30 or more years\nWhat part did fish play in the family diet? The rest\nWas the fish fresh, cured, or canned? Yes, canned salmon\nKinds? Fresh pickerel, fresh perch, white jackfish all purchased from store or fishermen mostly smoking\n2.\n\n3. SUGAR AND SYRUPS\n\nIn what quantity did you buy extra sugar? (Specify brand, price, and quantity.) $5.00\n\nWhat was the price for a ten pound sack of white sugar? $5.00\n\nWhat brand of rolled oats syrup did you use? Blue Bird\n\nWhat size of tin of syrup did you purchase? 1 lb.\n\nAt what price? $0.75\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Head dairy herd\n\nWhat was the price of butter? $0.10 per lb.\n\nDid you make eggs for income? Yes\n\nDid you raise butter? Yes\n\nDid you raise chickens? Yes\n\nWhat kind of cheese? Cheddar\n\n5. MEAT AND FRESH PRODUCE\n\nHow much money did you save during the war? $100\n\nHow often did you get fresh meat? Weekly\n\nFor what purpose did you get fresh meat? For family consumption\n\nWas there a \"meat plant\" in your neighborhood? Yes\n\nIf so what was it organized? Amish Church\n\nDid you raise fowl? Yes\n\nFor how long? 30 or more years\n\nWhat part did fowl play in the family diet? Meat\n\nWas the flesh fresh, canned, or cured? Fresh\n\nWas the fowl raised, purchased from store, or mostly gardening?\n\nWas the fowl raised, purchased from store, or mostly gardening?\n6. BEVERAGES\n\nWhat kind of tea did you buy? \nAt what price? \nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nThat other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of:\nPotatoes \nCabbage \nCarrots \nOnions \nTurnips \nBeets \nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? \n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \npeas? \ncorn? \nbeans? \nSaskatoons? \nother foods? \nThat year did you first preserve fruit by canning? \nThat year did you first preserve vegetables by canning? \nThat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar?\n3. Orange Peels\n\n6. Buyings:\n\nWhat kind of tea did you buy? Saladada. As what price? $1.50 per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Beans. As what price? $2.50 per lb.\n\nThat other beverages were named?\n\n7. Vegetables:\n\nWhat year did you first grow your own supply for the winter off?\n\nPotatoes\n\nCarrots\n\nOnions\n\n1903\n\n1904\n\n1905\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 20 lbs.\n\nWhat was the price of prunes? $0.80 per lb.\n\nWhat other dried fruit did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currants or others?)\n\n8. Preserving:\n\nIn the early years did you preserve any foods by canning? No.\n\nPeas\n\nCorn\n\nBeans\n\nSustained by Applesauce\n\nOther foods? Applesauce\n\nThat year did you first preserve fruit by canning? 1915\n\nThat year did you first preserve vegetables by canning? 1915\n\nDo you still preserve foods by canning or drying? Yes\n\nTo what extent? The amount needed for personal consumption.\n\nDid you make your own vinegar? No\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         | yes                                           |                                                  |                                   |                     |\n| Macaroni              | yes                                           |                                                  |                                   |                     |\n| Graham flour          | yes                                           |                                                  |                                   |                     |\n| Brown sugar           | yes                                           | since I remember                                 |                                   |                     |\n| Molasses              | yes                                           |                                                  |                                   |                     |\n| Table salt            | yes                                           |                                                  |                                   |                     |\n| Common salt           |                                               |                                                  |                                   |                     |\n| Lily white syrup      |                                               |                                                  |                                   |                     |\n| Toilet soap           | yes                                           | Baby soap                                        |                                   |                     |\n| Baking powder         | yes                                           |                                                  |                                   |                     |\n| Baking soda           | yes                                           | since I remember                                 |                                   |                     |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   |                     |\n| Vinegar               |                                               |                                                  |                                   |                     |\n| Raisins - seeded      | yes                                           | early                                            |                                   |                     |\n|                       |                                               | seedless                                         |                                   |                     |\n| Raisins - seedless    |                                               |                                                  |                                   |                     |\n| Rice                  | yes                                           | since I remember                                 |                                   |                     |\n| Currents              |                                               |                                                  |                                   |                     |\n| Store jam - kinds?    |                                               | made my own                                      |                                   |                     |\n| Cheese (Cheddar or store cheese) | yes | since I remember | | |\n| Vanilla               |                                               |                                                  |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? **Fresh Yeast at first**\n\nDid you make yeast for your own use? **Yes** Using starter? **Yes**\n\nUsing hops? **Yes** Salt rising? **No**\n\nDid you buy baking powder? **Yes** Baking soda? **Yes**\n\nCream of tartar? **Yes** Did you make your own baking powder? **No**\n| Item                  | Yes/No | Notes               |\n|-----------------------|--------|---------------------|\n| Baking soda           | Yes    |                     |\n| Brown sugar           | Yes    |                     |\n| Graham flour          | Yes    |                     |\n| Honey                 | No     |                     |\n| Table salt            | Yes    |                     |\n| Yeast                 | Yes    |                     |\n| Raisins               | Yes    |                     |\n| Rice                  | Yes    |                     |\n| Carrots               | Yes    |                     |\n| Chocolate             | Yes    |                     |\n| Vanilla               | Yes    |                     |\n\n10. Baking\n   - What type of yeast did you use? **Yes**\n   - Did you make yeast for your own use? **Yes**\n   - Using starter? **Yes**\n   - Used hops? **Yes**\n   - Did you buy baker's powder? **Yes**\n   - Did you take your own baking powder? **Yes**\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names | |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nDid you get water for drinking and for cooking? (well, river, slough, dugout) Dug a well lined it and put in a pump.\n\nHow far was this water from your home? About 50 ft.\n\nHow was it brought to the home? (pail, barrel, tank) Pump.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nFrom 1903 till 1935 lived on own half section 2 miles from the town of Carlyle Saskatchewan North toward Moose Mountain.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout) \n\nIf so, how was this water from your home? \n\nHow was it brought to the house? (pail, barrel, tank)\n\nRegarding water supply, mention any facts which have taken place since you first started homesteading, giving date, if possible.\n\nYear 1903 till 1935 lived on own half section\n\n2.9 mile from the town of Carlyle & at Kitchener\n\nNorth toward grove of mountain ash\n13. SOAP\n\nDid you buy laundry soap or make your own? ...........................................\n\nIf you made your own, did you use lye? ........... good ashes? ................\n\nWhat kinds of laundry soap did the grocer handle? .................................\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Paper & Butters\n\nWhere did you get your fuel? ... Old Barns\n\n..................................................................\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ..........................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ..............\n\n..................................................................\n\nBy whom was your first cook stove made? ...........................................\n\nWhat year was it purchased? ...................... Price? ......................\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ..........\n\n..................................................................\n\nFor preparing food? (china, earthenware, wooden bowls, other) .............\n\n..................................................................\n\nWhen did you first see enamel ware? ..............................................\n\nAluminum? ..............................................\n14. FUEL\n\nThat fuel did you use in the earliest days? (Give dates)\n\nThere did you not your fuel? (Give dates)\n\nIf you could, tell me how you were sure that kind of fuel was used.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food? (Chutes, earthenware, wooden bowls, other)\n\nThen did you lift?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nI have seen a lot of changes in wrappings from bulk to fancy boxes and paper wrappings, I am not sure what they were called but I do not recall the dates of these changes. But I do know that with all these changes the prices have gone up, up, up.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1893 Breakfast\nOatmeal Porridge\nFried Pork & Eggs\nor boiled eggs\nfruit or honey\nbowl of bread\ntea & cream butter\n& sugar\n\nLuncheon\nMeat & gravy\nPotatoes & vegetables\npie or pudding\nbread & butter\ncold meat & fried potatoes\nhomemade fruit\ntea & cream & sugar\n\nSupper\nBread & butter\ncold meat & fried potatoes\nhomemade fruit\ntea & cream & sugar\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nPortage la Prairie, Manitoba Dec 25, 1893\nHusband and baby son & myself\nRoast Chicken - Potatoes - Cold Slaw - Cranberry Sauce\nXmas Pudding - Brown Cake - Tea - Cream\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nOur cupboard was always full of groceries. We always lived on a farm until about 15 years ago. We were all workers, didn't sit around and starve.\n17. What was your first Christmas dinner in wartime Canada?\n\n18. What was your first Christmas dinner in wartime Canada?\n\n19. Were you ever refused to almost starvation level living on one or two local products? Give details.\n\nOur cupboard was always full of groceries we always had on a farm until about 15 years ago. We were all very hardworking around and flour.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThe utensils for cooking are better and with better stoves etc preparing meals was easier, but I do not think the food is prepared any better. There is more abundance of food on the market, and a lot of new ideas have been learned from good cook books.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI lived on the farm until 1940 and always depended on homegrown vegetables & meat with the exceptions of foods which can't be grown on the farm.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI have answered this questionnaire as well as I can remember, and as I well be 91 years old on March 3rd, I figured, you will understand that it is a long time back to remember details and some I have not filled in for that reason. My eyesight is not too good since last few years and my hand writing is not so good. However I have been glad to give what information I could and still think Saskatchewan is the best place in the world to live. We moved to Portage La Prairie Man., in the spring of 1893 and\n20. Mention any noticeable differences in the preparation of meals in the past.\n\n21. When did you begin to rely on preserved foods and prepared foods instead of homegrown and home preserved foods? (Give an early date and a later date.)\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods in other ways, including pioneer days in the early years of settlement. Include areas not mentioned above, quality, methods of purchasing, etc. (Use back of paper if more space is needed.)\nOur two sons and three daughters were born there. While there we rented land 12 miles from Portage la Prairie. In the spring of 1903 we moved by train to Carlyle Saskatchewan where my youngest had a homestead preemption. This was ½ section 2 miles north of the town of Carlyle. We also bought 4 sections of grazing land on the foothills of Moose Mountain where we pastured our cattle in the summer months. Our youngest son was born in Carlyle in 1905. So I really had eight to keep house and cook for, and did all my own work and sewing without help except a girl for a few days at threshing time or a few weeks if the weather was bad, and she had to board about 25 men until weather was fit to thresh again.\n\nMy husband passed away on Jan 27, 1940 and since that I have made my home with my daughter Mrs. G.A. Reeves in Regina and my son Archie Young in Carlyle. I spend the winters in Regina and most of the summers at Carlyle pretty and beautiful Carlyle Lake.\n\nMrs Catherine Young\nRegina Saskatchewan\nOur two sons and three daughters were born there. While there we rented land 1/2 mile from Portage Lake.\n\nIn the spring of 1913 we moved by team to Carlyle, Saskatchewan where Mr. Young had a homestead near town. We went west to auction 2 miles north of town early. We also bought fourteen acres of land on the still of Morar Mountain where we operated our cattle in the summer months.\n\nOur youngest son was born there early in 1908. He finally took flight to help house and work and acquire without help except a girl for a few days of the winter. Home for a few weeks that I could was hard, and you can imagine about 25 more until we met our first threat again.\n\nMy weekend passed away on June 27, 1940 and since that I have made my home with my daughter Mrs. G.A. Raine in Regina and my dear Archie Young in Carlyle. I appreciate the winters in Regina and most of all the summers at Carlyle particularly beautiful Carlyle Lake.\n\nPeggy Young (signature)\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_122.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5645, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1566, 5], [1566, 2231, 6], [2231, 3511, 7], [3511, 4636, 8], [4636, 5780, 9], [5780, 6872, 10], [6872, 11520, 11], [11520, 12511, 12], [12511, 16277, 13], [16277, 16742, 14], [16742, 18264, 15], [18264, 18879, 16], [18879, 20452, 17], [20452, 20818, 18], [20818, 22323, 19], [22323, 22846, 20], [22846, 23851, 21], [23851, 24807, 22], [24807, 24807, 23], [24807, 24807, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]