[{"id": "a635623a0782697e69b41a98f32c65081c43b7cf", "text": "S-X2\n904. Doyle Catherine M. (Mrs. Andrew M.)\nS-X2\n904. Doyle Catherine M. (Mrs. Andrew M.)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces or answers. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n✓ All questionnaires will try to answer all questions.\n\n✓ Pioneer health conditions\n✓ Pioneer social life, sports and recreation\n✓ Pioneer housing\n✓ Pioneer education and churchwork\n✓ Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WORD OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer; so don't worry about leaving blank spaces. Just try to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires will be answered all ways.\n- Pioneer health conditions.\n- Pioneer social life, sports and recreation.\n- Pioneer housing and churchwork.\n- Pioneer farming experience.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: CATHERINE M. DOYLE\n2. Your address: L.E. RAY, SASK.\n3. Date: MAY\n4. Where were you born? (Give name of place and country) MANITOBA\n5. What was your father's name and occupation? WM. KRAUS, Farmer\n6. When did you come to Saskatchewan? (Give month and year) JULY 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   I was in my second year, 1895, 16 years 9 months.\n\n9. What were your reasons for coming West?\n   My parents came in April 1906 and were convinced to stay by a friend who was coming to Yorkton as we were together to Winnipeg a few months earlier.\n\nMy family had a friend in New Mexico who heard about Manuretta. He came to Manuretta and learned about the climate and decided to move there. He came home to Manuretta N.W. He encouraged my Father and Mother to come also, so my Father and Mother came to Manuretta in May 1905 and found out that it was a good place to live.\nPIONEER HISTORY QUESTIONNAIRE\n\n1. Your full name: CATHERINE M. DOYLE, L.E.\n2. Your address: 4 E. RAY, SASK.\n3. Date: MAY 1906.\n4. Where were you born? (Give name of place and country) MANITOBA, CANADA.\n5. What was your father's name and occupation? WM. KRAUS, FARMER.\n6. When did you come to Saskatchewan? JULY 1906.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Weyburn, Canada? (You do not need to answer this question if you were under 18 years old at that time.)\n   I was 16 years old in 1906.\n\n9. What were your reasons for coming here?\n\nMy parents came in April 1906 and I was encouraged to come by a friend who was coming to Yorkton and we came together to Weyburn.\n\n10. How did you travel to Weyburn?\n\nMy father had a friend named Mr. Smith who lived in Weyburn and he came to Manitoba and talked about Weyburn. He came to Weyburn and encouraged my family to come to Weyburn. We came to Weyburn in May 1906.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey did not like the idea, thought it was too far north and we would get lost and I lost weight.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith a friend & two small children to Winnipeg, then met in with a mail coming to Minnedosa & by railroad all the way from Minnedosa to Mennonite Beach.\n\n13. What means of transportation did you use?\n\nRailroad all the way from Minnedosa to Mennonite Beach.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWe met two boys who had went to Kansas college within the North, N.W. during the winter of 1906 when we came to the border town they heard me & had a boat both at U.A. and David, when shipped friend who I met and I got to Minnedosa by train and into town to meet us, as my family had asked him to meet new homes dark and raining then arrived to be no platform as we fell in what we called a ditch.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nStayed the first night in Minnedosa N.W. and next day returned to the homestead where my parents, father & children lived.\n\n16. Where did you settle or take up land?\n\nHomestead Town in 1906 near Minnedosa.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFrom July 1906 to 1922. N.E. 1/4 Sect 10 Town 36 Rg 21\n\nFrom April 1922 to Nov 1948 N.E. 8 1/4 Sect 11 Town 35 Rg 21\n\nTwo years stayed with relatives.\n\nLiving in Kellard since April 1950.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWant to submit before coming to Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey did not like the idea, thought it was too far north and we would get lost and die.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith a friend & two small children to Winnipeg, then met in with a girl coming to Prince Albert by train.\n\n13. What means of transportation did you use?\nRailroad all the way from Montreal N.D.U. to Prince Albert.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nI met two boys who had went to farm college within three months. During the winter of 1906 when we came to the border they heard us to have a boat load at U.A. and a third. When I got to Prince Albert I met a friend who I met and I got to Prince Albert by train. We then traveled to Prince Albert by train. We met my mother dark and raining. She arrived at the next station so we fell into what we called a ditch.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nStayed the first night in Prince Albert and next day returned to the homestead under my parents, further west.\n\n16. Where did you settle or take up land?\nMama & I toured in 1906 to Prince Albert.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nFrom July 1906 to 1922. In 1922 to 1948. From April 1948 to Nov 1948. Living in Regina with relatives.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nI went to school before coming to Canada.\n19. How often did you write to relatives or friends in your old home?\n\nVery often she wrote at least once a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nANDREW M. ROYLT, April 26, 1922\n\nMarried at St. Patrick Church, Oat Hill, Mass.\n\n21. Did anyone else come to settle?\n\nA number came in account from Fall River.\n\nMy two sisters and my brother came with my parents in May 1906 and settled on N. E. Lot 10 Town 35 Range 21 W 2nd.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\n23. In three particular experiences of pioneer days that stand out in your memory which you would like to recount:\n\nA sad experience happened in July-August 1906, after and his wife and two girls were always friendly and kind and not harsh or cruel. They were very hardworking families, three in the house and yet there was never any lack of food or clothing.\n\nOne Sunday in October 1907 just when the snow was going down, the wind was blowing a gale up a tree. My father was hard at work trying to get the tree down. He fell down, and the wind kept blowing until he was buried under the tree.\n\n24. Did you travel about much in the early years? (For business, visiting friends, etc.)\n\nNo, we traveled very little by what means of travel.\n\n25. Visiting friends, etc.\n\nOnly two times was necessary, attended church and visited neighbors in summer and winter. Would play cards or games or visit friends. Winter was very cold and snowy. We had to go out to get our supplies and horses and sleds in winter. How did the neighbors travel by overland trail?\n19. How often did you write to relatives or friends in your old home?\n\nVery often she kept up correspondence.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nANDREW M. DOYLE, April 26, 1922\n\nMarried at St. Patrick's Church, Oak Ridge, Tennessee.\n\n21. Did anyone else come to visit you?\n\nA number came on account of the fall of the house.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came visit,\n\nTell when they came and where they met.\n\nMy two children R. H. and L. L. came with my parents in 1906 and visited me in 1914.\n\n35 Years 21st 2nd.\n\n23. In these particular experiences of pioneer days that stand out in your memory which you would like to recount:\n\nA sad experience happened in July or August 1906, after\n\nand his wife of two years was always friendly with me. But\n\nand my father was smiling. He looked very ill and died\n\nin that day. Because death had been so hard for them, there\n\nhe was in 1907 and sat too many new potatoes again.\n\nOne Sunday in October 1907 when I was all\n\ngoing down, I went visiting with my friend. We all\n\nheard the wall fall by a tree up a hill. My feet fell\n\nand I fell to the ground. I got up and walked away.\n\n24. Did you travel about much in the early years? (For business, attending church,\n\nvisiting friends, etc.)\n\n25. How often did you attend school?\n\nOnly two terms each year, attended school about\n\nan hour a day. Visited friends and neighbors a lot in\n\nwinter. Would play cards or games or visit anyone.\n\n26. What kind of transportation did you have?\n\nOxen, horse, mule, donkey or horse and wagon\n\nin summer and horse and buggy in winter. During\n\nthe neighbor's house by overland road 8 hours.\n25. When was the first car used in the community?\n26. If you owned a car before 1924, when did you buy it? What make?\n27. Where was your traveling center? How far from your home?\n28. Did you continue to travel there? (Indicate any changes due to new terms appear-\nand it was a little prairie trail. (In early days)\nin 1921 Kelso became town and was only\n1/2 mile.\n29. How often did you shop in the early days?\nAbout once every two weeks.\n30. What (if any) did people in your district first start getting to town regularly\non Saturdays?\nAfter most of them had cars in 1922-1923.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\nWhat kind of articles did you buy in this way? (Include also what catalogue?)\nYour total purchases were by mail order and any others as in the proportion of\npurchases made by mail order since the pioneer period.\n\nWe used the order catalogue within 2 years we\nneeded clothes, hats, boots &c. when first\ncoming to Canada. Names ordered grocer K.T.\nusually everything else but in about 1910 we\ntraded mostly in towns for what we could get\nbut also ordered clothing from catalogue.\n\n32. When did you first have a telephone and what company provided it?\n1916 North Kamloops Rural Telephone Co.\n\n33. When you came to Sandalwood the first time was it with the idea of starting\npermanent or did you make up your mind after trying it out? Then did you\nmake this decision?\n\nJust came because my parents bought me.\n\nAfter we were here some years we had no\nchoice as we had no money to move and it\nwas the only home we had. Then when I moved\nin 1921 it was our permanent home.\n25. When was the first time in the community?\n\n26. If you owned a car before 1934, when did you buy it? That makes:\n\n27. How far from your home?\n\n28. Did you continue to work there? (Indicate any changes due to new terms, adjustments, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. What (if any) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? You make up your mind after trying it out? Make this statement.\n\n34. What became of my parents' belongings?\n\n35. After we were here many years we had no choice as we had no money to move and it was the only house we had. Others who moved around in 1922 it was too permanent. I know.\n34. Did any people move away from your district prior to 1921? What reasons did they have for moving?\n\nYes, many moved away. Some moved west first because too much work in hard work to buck land and third too backward, thought it was too hard to make a home.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome moved, I do not think any returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMy father was trustee on school board from 1908 until his death in 1942. He was also trustee on church until his death in 1942. He was also church president and was secretary of the P.T.A. in church from 1907 until 1950 when it was dissolved.\n\n37. If you or any of your family or friends were involved in any activities in the district, mention them here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) the origin and meaning of place name; (2) origin and meaning of the first name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change.\n\nFather's name: H. (Summit S.D. 1909) and was changed to Father's name: H. (Summit S.D. 1916), County Office.\n\nManuscript: 1/10/1809 in the year 1916, County Office.\n\nT.J. We had two towns, N. & S. But Town 35 was built later on and named to my Father's place N. 2/4 but Town 35 Range 21. Was built to name it named after our town and N. 10 all but the government named it Manassas when Kelley became a town but Kelley was named after Jack Kelley. A cabin called in old field over hill.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, my parents moved away. They moved away because there was not enough land and too much work to be done on the farm. They thought it was too hard to make a living.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome moved, but I do not think any returned.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was trustee on school board from 1908 until his death in 1941. He was also trustee on church board from 1907 until his death in 1941. He was also trustee on church board from 1907 until his death in 1941.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, building, organizing the first lodge, etc.)\n\nJames Quinlan, farmer, built the first garage in town in 1933.\n\n38. For did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) date of occupation or person responsible; (2) date of adoption; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change.\n\nFather's name: (S. D., 1809) and was changed after\n\nMother's name: (S. D., 1809) and was changed after\n\nT. J. M. was named by Mr. Smith because it was of\n\nP. J. M. was named by Mr. Smith because it was of\n\nR. J. M. was named by Mr. Smith because it was of\n\nNancy R. was named by Mr. Smith because it was of\n\nLaurie and M. O. were named by Mr. Smith because it was of\n\nwhen Riley became a town and Riley was named after\n\nso we always called Mr. Riley and Mr. Riley was called Mr. Riley.\n\nJack Kelley. A cabin stood in Wilford over Hill.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes many moved away. One reason was first second too much brush and too hard work to buck land and third too backward. Thought it was too hard to make a home.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSome moved. I do not think any returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Father was trustee on school board from 1908 until his death in 1942. He was also trustee on church & director on telephone. My Husband was trustee on church & school for 20 years. I was secretary at St. Patrick's Church from 1907 until 1950 when I moved to Leloy. I was secretary treasurer for North Lancing Rural Telephone Co. 1933\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (2), (3), (5).\n\nOur school was built in 1908 and was named after Father Simnett. (Simnett S.D. 1809) and was changed to Manuel S.D. 1809 in the year 1916. Our post office was named M.E. Simnett because it was at M.E. Simnett House, N.E. 1st 2 Towns 35 Range 21 but later on was moved to my Father's place N.E. 1st 10 Towns 35 Range 21. We tried to name it Manuel after our town but the government named it Manuel when Leloy became a town our post office was closed so we all got mail at Leloy. Leloy was named after Jack Leloy, a soldier killed in World War I.\n5. Did any people move away from your district prior to 1940? That person did.\n\n34. Did any people move away from your district prior to 1940? They have not moved away. Our nearest was from back land and child to backland, though it was too hard to make a home.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome moved, I do not think any turned.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here giving dates when possible.\n\nMy family was active in church and also active in church until the late 1940s. We were also active in church from 1967 until our family moved to Idaho.\n\n37. If you or any of your family or friends have ever served as president of any organization, mention it here (if possible).\n\nI am not sure if my family has ever served as president of any organization.\n\n38. How did the places in your community get their names? (School districts, post offices, etc.)\n\nThe town was named after my father, John T. (Simmons). It was named in the year 1910 because it was at the time of its formation. The date and reason for its name are unknown.\n\n39. Any other interesting facts about your community?\n\nOur town became a town in 1910 but the government named it Monroe County. It was named after my father, John T. (Simmons). It was named in the year 1910 because it was at the time of its formation. The date and reason for its name are unknown.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a few old photographs but would like to part with them but might find them useful.\n\nAnn is two old ladies spinning wool on a wheel bought from Alberta. They were called third wife in early years and have brought many babies to the colony in children. Ann is a bunch of old people going for a joy ride with others.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nOne good thing was the dugouts as the farmers could keep cattle & hogs and I think the bush cutters were wonderful as the farmers who could get some cash could get bush cut then finish the land and raise crops. Homesteads that was all poplar groves are now wheat & grain fields.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n37. Questions regarding historical source materials:\n   Do you have any personal or family heirlooms such as old letters, old photos, old newspapers, old postcards, etc.? If so, please describe them.\n\n   I have a few old photos but I don't think they're worth much.\n\n   Would you be willing to lend them to the Provincial Archives for display?\n\n   (1) Yes\n   (2) No\n\n   If yes, what would you like them to be used for?\n\n   (a) To illustrate a particular event or period in history.\n   (b) To show the development of technology over time.\n   (c) For educational purposes.\n   (d) Other:\n\n   (Please specify)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes to your community since you first came here?\n\nOur grandparents didn't have the opportunity to go to school. They could only read and write, which made it difficult for them to get jobs. Our parents got better jobs because they could read and write. Now our children can attend better schools and have more opportunities.\n\n42. Please give the names and addresses of other pioneers who could answer these questions.\n\n[Names and addresses not visible]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906D-G_904.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 7057, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 46, 3], [46, 92, 4], [92, 2019, 5], [2019, 3903, 6], [3903, 5078, 7], [5078, 6099, 8], [6099, 7864, 9], [7864, 9492, 10], [9492, 11168, 11], [11168, 12895, 12], [12895, 14519, 13], [14519, 15418, 14], [15418, 17234, 15], [17234, 19138, 16], [19138, 21187, 17], [21187, 22641, 18], [22641, 24240, 19], [24240, 25452, 20], [25452, 25452, 21], [25452, 25606, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]