[{"id": "016625c62de5838ac75ad9327396ad3d84c88814", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe experiences of pioneer life are not sufficient alone to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All Questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: William Alexander Fisher\n\n2. Your address: [Address not visible]\n\n3. Date: [Date not visible]\n\n4. Where were you born? (Give name of place and country): Alma, Ontario\n\n5. What was your father's name and occupation? Robert Fisher\n\n6. When did you come to Saskatchewan? (Give month and year): 1900\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) 9 years old\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as given, please say so. It is quite acceptable to have someone else do the writing at your discretion.\n\n1. Your full name: W.C.L.I.A.M. ALEXANDER FISHER\n\n2. Your address: 1134 Main Street, Regina, Saskatchewan\n\n3. Date: Feb. 28th, 1955\n\n4. Where were you born? (Give name of Place and country): Alma, Ontario\n\n5. What was your father's name and occupation? Farmer\n\n6. When did you come to Saskatchewan? (Give month and Year): 1900\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - Regina, Ontario: lived there for 4 years\n   - Small town, I was in my teens, etc.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\n   - I felt my natural self\n   - I had heard much about the West\n   - I wanted to see it and some of its attractions\n   - I was interested in the opportunity to earn money\n   - I was interested in the opportunity to earn money\n   - I was interested in the opportunity to earn money\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    - Railroad or government information?\n11. What did your friends and relatives think of your decision to come to Western Canada? Why thought the decision was good?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? Why thought the decision was good?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went regular church att. also in the homestead trip and done quite a bit of visiting we had a team and buggy.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went regular church attimes in the homestead by and done quite a bit of writing we had a team and buggy.\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What makes? 1910\n\n27. Where was your trading center? How far from your house? 1/2 mile\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) After a few years the CPR built a line from Lindsay to Peterborough and we were 13 miles a few years ago and CNR built line and were 2 miles then the dry years came and we fell out of it until we got our own road and we had transportation and came to Lindsay and purchased 1935 Blue no we travel.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? Place and frequency.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? In what proportion of your total purchases were you by mail orders, and any changes in the proportion of purchases made by mail order since the pioneer period?\n\n32. When did you first have a telephone and what company provided it? 1911\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? 1902\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How far from the town did you live? (Indicate any changes due to new towns appearing)\n\n30. When did you first begin to buy through the mail order catalogues?\n\n31. What kind of articles did you buy in this way? (Indicate any changes in the proportion of purchases made by mail order since the pioneer period)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of settling permanently? Or did you make up your mind after trying it out? When did you make this decision?\n5. Did any people move away from your district prior to 1974? What reasons did they have for moving?\n\n34. Did many people move away during the 1930s? Did many return?\n\n35. Did you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n36. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give meaning of the name (date of its adoption), any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did you or anyone in your family have a hard time during the 1930s? Did many return?\n\n36. If you or some member of your family was active in any organizations, mention it.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.)\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify, or the Archives Office at the University in Saskatoon?)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have 4 children: 8 girls / Boy Charles Fisher. Parents: Mrs. Fisher and Mr. Fisher. We also have 2 boys. Anna and Albert. Anna has 2 girls and Albert has 2 boys.\n\nThey are second girl a Mrs. Joe Thorpe. From her we have 2 boys going to school. The youngest girl a Mrs. Ethel. From her we have 3 children: 1 girl and two boys.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire, and that we may hear from them occasionally.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nWilliam Alexander Fisher\n\nIf you have any additional information about William Alexander Fisher, please provide it here:\n\nWilliam Alexander Fisher\n6.\n\n39. Questions regarding Historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers, old photographs, minute books of community organizations, etc.? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify, or the Archives Office of the University of Saskatchewan)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have 4 children & 8 girls (Boy Claude Fisher, farmer, lives at\n\nWe still own the house where we lived when we moved to\n\nWe also own a house at\n\nAnna and Albert have two girls + one boy\n\nWhat do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire, and their ages.\n\nIf someone else has filled in this questionnaire for you, please have this person\n\nGive name and address\nI was brought a car in the winter of 1910-11 at University from the Franklin Co., but I was only able to get a small 10. I had to get a much bigger car. I tried to make it myself out of a three of them. In the fall of 1911 we left the farm when I was working for an American firm building Shinnecock and in the summer of 1912 I came to the city of Binghamton without a houseboat. But in the spring of '13 I went to get a houseboat and I was obliged to pay $100 for 1912 before I could get 1913. (I think this is a record that the city might like to have about) That year the summer of the cyclone, I helped with the rescue work. Down at 900 2nd Street that night we heard two blocks from the cyclone area, we heard 1876 Pov street. We heard 16 people in our house after the cyclone and for a month after and our shelter was torn. On 12th of July 12 days after the storm no one was hurt through it officially my wife died seven days at home. Could not afford to go to the hospital Dr. Smith was our doctor to do you any harm was killed in action and I had a cousin that was in the same hospital at the time she was a nurse. But she was not hurt. She has been in Victoria and her family came to the west in 1912 but she is dead now. But she has a son at William E. R.\nI was brought a car at winter of 1910-11 in Assembly from the Buick Co., or was it my own? The community was small. I got a mule that on my own. I had to work it out of a piece of land. In the fall of 1911 we left off the farm when I was working for an American farmer.\n\nI went by car to the summer of 1912 in the city of Bingham without a license but in the spring of '13 I went to get a license and I was obliged to pay $100 for 1912 before I could get 1913. (I think this is a record that the city had not been able to have about) That was the summer of the cyclone. I walked with the rescue work down at 9th & Pine Street that night we tried twice blocks from the Cyclone area, we lived 1876 Pine street.\n\nWe had 16 people in our house after the Cyclone and for a month after and our shelter was torn. On July 12 days after the storm to you see we went through it sufficiently my wife died seven days at home, could not afford to go to the hospital Dr. Smith was our doctor he was your only man was killed in action and I had a cousin that was in the army hospital at the time she was a nurse. But the army must have had a hero in Australia and for Florida came to the west in 1912 but he's dead now. But the hero a hero at William E.\nWilliam A. Fisher\nMasonovic\nSask.\n\nis a cousin of mine\n\nLance Manuel\nWilliam A. Fisher\nMasonovic\nSask.\n\nis a cousin of mine\n\nLaurie Francis\nI worked in the Roundhouse in Canada, but it was Rat Portage then in the year 1898. I was turners helper. I used to shut all incoming engines for coal then drive them over the ash pit, and men would crawl underneath them and poke out the ashes. When they had the fires all clear, then the turner would put them on the turn table and put them (the engines) in the Roundhouse or send them out on another trip. They were just small engines in those days. Just had a few big ones.\n\nRemember, we all worked on one engine for a week or more cleaning and polishing it and turning it up with flags and Bunting to be hooked onto a troop train of soldiers that was coming from B.C. The boys were on their way to South Africa. When the train pulled in and we had to take our engine out it was raining torrents so you know what would happen to the flags & Bunting. But we had done it anyway and were proud of it this must have been 1899 in the fall.\nI worked in the Roundhouse in Canada, but it was Rat Portage then in the year 1898. I was turners helper. I used to spot all incoming engines for each then drive them over the ash pit, and men would crawl underneath them and heave out the ashes. When they had the fires all clear, then the turner would put them on the turn table and put them (the engines) in the Roundhouse, or send them out on another trip. They were just small engines in those days. Just had a few big ones.\n\nRemember, we all worked on one engine for a week or more cleaning and polishing it and turning it up with flags and Bunting to be hooked onto a troop train of soldiers that was coming from B.C. The boys were on their way to South Africa. When the train pulled in and we had to take our engine out, it was raining torrents so you knew what would happen to the flags & Bunting. But we had done it anyway, and were proud of it. This must have been 1899 in the fall.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_608.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5145, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1603, 5], [1603, 3123, 6], [3123, 3909, 7], [3909, 5336, 8], [5336, 6035, 9], [6035, 6729, 10], [6729, 7512, 11], [7512, 8299, 12], [8299, 9574, 13], [9574, 10448, 14], [10448, 11396, 15], [11396, 11939, 16], [11939, 13326, 17], [13326, 14409, 18], [14409, 15675, 19], [15675, 16914, 20], [16914, 16983, 21], [16983, 17054, 22], [17054, 17992, 23], [17992, 18934, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]