[{"id": "5fd2a0aa5a981667ed186fb948fd4b70d0fbecd0", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in pioneer days can give exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The best thing to do is to give details or describe particular events to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1905, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not. If there is not sufficient space to answer the questions, they should be written on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What did Western Canadian Farmers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires listed:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed Questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name MRS. JAMES ANDERSON\n2. Your address G.R.E.G. HERD\n3. Date MAY 25 1953\n4. Where were you born? (Give name of place and country) HARTFORD ONTARIO\n5. What was your father's name and occupation? GEORGE SLOAT FARMER\n6. When did you come to Saskatchewan? (Give month and year) AUG. 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Bealton Ont from 1897 to 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 23\n9. What were your reasons for coming West? We lost two babies with lung trouble. And I thought the west might be healthier and also my husband wished to try homesteading as it is pretty hard to start up in Ont on nothing.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). My husband came out on the harvest excursion in 1904 then in the spring of 1905 his brother came and took up land also filed on our homestead for us.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy people were very sad about it my father said he thought we had done very well and didn't see why we were not satisfied. Mother said if Jim wants to go—go.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe came by ourselves with our two children.\n\n13. What means of transportation did you use?\n\nWe came on the CPR harvest excursion.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIt was the second time only I was ever on the train my baby was only five months old and as it was very warm and crowded on the train he cried steady and an old gentleman said if we would get him a drink of water it might sooth him so we did, and he went to sleep. I had not realized before that water could be had on the train. Some of the boys were drinking quite a bit and got rowdy before morning. Some were very nice.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt a little boarding house at Lipton.\n\n16. Where did you settle or take up land?\n\nWhere we are now it was Mankinich P.O. Town.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nDelrinville was our first P.O. South of Cypress we worked for a farmer and his wife and family. We spent one winter in Regina 1946-47.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWe were on a farm for a while then my husband worked with a village blacksmith and in a saw mill for a while and day's work at most any thing.\n19. How often did you write to relatives or friends in your old home?\n   Every week or two until we came on the homestead then we didn't get a chance to send out letters only about once a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   James Ira Anderson married Oct 25th 1899 at Hagersville Ont.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, Clark Vanloon and his family at Davidson.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   Just to visit us and help some on the farm. Brother and sister 1911, Brother in 1912 another in 1916, Parents in 1917.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   When we completed our journey to the homestead from Cypress in the spring of 1906 we had our furniture on a wagon rack and we drove on the top, the snow and frost was just going out and sometimes one wheel would cut through and the wagon would tip until we thought we might upset and we tied our cow to the wagon and she didn't want to go homesteading and would lie down and drag and I was afraid she would hang herself so finally they cut her loose and went back next day for her. It was too exciting for me.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   I went out so seldom people in town after about ten years yet thought my husband was a bachelor (not the store keeper of course).\n25. When was the first car used in the community? about 1918\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Our first was 1918 a Chevrolet.\n\n27. Where was your trading center? How far from your home?\n   Markinch 14 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We trade mostly in Southey now as they took the bank from Markinch years ago, and Southey has more business places. We first traded at Esterhazy until in about 1907 when these other towns got a start.\n\n29. How often did you shop in the early days?\n   about once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   about 1940 I believe\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n   1908 clothing and groceries furniture harness repairs etc. I would say about half of our trading was done at Eaton's Winnipeg in the stores until 1915 or about that.\n\n32. When did you first have a telephone and what company provided it?\n   General Electric in 1915-16\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes we had our homestead and meant to prove up on it no matter what.\n34. Did any people move away from your district prior to 1924? What reasons?\n\nThey didn't succeed very well with farming.\n\nThey also bought more land around their farms in town rather than store and as soon as\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices or have been\n\nreceive in any organization mention it here, giving dates whenever possible.\n\nMy husband and I were school trustees in 1913 to 1915. I think\n\nI was superintendent of the Sunday School from 1928 to\n\n1938 in the summer months.\n\nI have been an altar of the Church (St. Mary's) since 1949 to 50.\n\nAny son is an officer of the church (St. Mary's) 1915 to 16\n\nowned a donkey about 1919\n\n\" \" \" Chiladale Nollison (St. Mary's Church) 1915 to 16\n\n37. If you or any of your family or friends were \"fired\" to have or do something\n\nin the district mention it here giving dates wherever possible. (Such as coming\n\nthe first automobile, opening, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post\n\noffices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(1) name and occupation of person suggesting place-name (2) date and meaning of the name\n\n(3) date of its adoption (4) any changes made since the first name was given\n\ndate and reason for change. Give facts of new name as above in (1) to (4).\n\nall I can tell you of this is the Highland School\n\nand Post Office. It was suggested by a bachelor\n\nWilliam One Cloud and named after a rancher\n\nthat handled his cattle there before the\n\nland was taken and for a time after.\n\nThis name was Robert Gregg.\nQuestions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos and photographs, written records, newspapers and periodicals, and realia (artefacts)?\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying;\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.\n\nIndicate your preference, if any.\n\nIf you have children or grandchildren, please give their names, where they live, and their occupations.\n\nWould you like to add any other information about your family history?\n\nPlease give the names and addresses of other pioneers who could answer this person's questions.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here.\n\nThe machinery is amazing. Tractors, combines, tillers, grain harvesters, plows, tractors, and the paddy and cars. It's wonderful and impressive, highways, all the time, hospitals and doctors.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_818.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2909, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1852, 2], [1852, 3304, 3], [3304, 4999, 4], [4999, 6676, 5], [6676, 8235, 6], [8235, 9911, 7], [9911, 11032, 8], [11032, 11032, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]