[{"id": "54490b8324cc5f94a2a4e71893a17c036b04f698", "text": "Saskatchewan Archives Questionnaire\n\nNo. 2\n\nPioneer Experiences: A General Questionnaire\n\nA word of explanation to the reader:\n\nIt is difficult to answer a general questionnaire in pioneer life because no individual who is asked to answer it has exactly the same experiences or memories as another. Some of the questions here will not apply to your experiences or they may prove impossible for you to answer. So don't worry about leaving blank spaces.\n\nIf there is not sufficient space to answer the question, write extra sheets of paper. If there is not sufficient space to answer the question, write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Pieta: What Did Western Canadian Pioneers Get?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer whistling and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA work of compilation by the PIONEER HISTORY COMMITTEE\n\nIt is difficult to traverse a general questionnaire so pioneer life because no individual who is asked to answer it has equally the same experiences. Some of the questions here will not apply to your answers, but others may prove impossible for you to answer, and don't worry about leaving blank spaces. The best thing to do is to describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Eastern Canada before 1874 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pioneers,\" What Did Western Canadian pioneers have to say? is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be printed at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n| All Questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life; sports and recreation |\n| Pioneer housing |\n| Pioneer education and character |\n| Pioneer farming experience |\n\nInstructions of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nRobert Roycroft\n\nTo Saska - April, 1905\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: ROBERT ROYCROFT\n2. Your address: 9 HAUNAVON\n3. Date: JUNE 22, 1905\n4. Where were you born? (Give name of place and country): IRELAND\n5. What was your father's name and occupation? THOMAS ROYCROFT\n6. When did you come to Saska toawan? (Give month and year): APRIL 1905\n7. Mention any other places where you lived before coming to Saska toawan: NEW YORK, NEW YORK\n8. How old were you when you first came to Western Canada? (You do not need to state your birth date or question if you would rather not or you may use \"I was a child\")\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThe same instinct that brings the birds North has as any man. Country offers opportunity to a young man. And that what do mind today is opportunity, not all a go positions & who hundred but to get & come home.\nRobert Raycroft\n\nTo Saska - April, 1905\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Robert Raycroft\n2. Your address: 9 Haunakon\n3. Date: June 27, 1932\n4. Where were you born? (Give name of place and country): Co. Cork, Ireland\n5. What was your father's name and occupation? Thomas Raycroft - Farmer/Planter\n6. When did you come to Saskatchewan? (Give month and year): April 1905\n7. Mention any other places where you lived before coming to Saskatchewan, etc.: England, New Mexico, May 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThe same instinct that brings the birds North has brought me here. As any new country offers opportunity to a young man, I decided to make the move today. It is a spontaneous decision, not a calculated one.\n\nMy plan is to work hard and put it into practice. I am confident that I will succeed.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought I was too adventurous in my age.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nC.P.R. We met the train at the station with a check train. And got thrown from the platform but not\n\n14. What incidents of the journey do you remember? Please list them in order:\n\na. Boarded on the Canadian Pacific Railway at 5:45 p.m.\nb. Met yard on Good Friday, April 1898, Boarded at 6:00 p.m.\nc. Stayed here until the next day, April 19th, Boarded at 7:00 p.m.\nd. Left with my family on the 24th, Boarded at 8:00 p.m.\ne. When I came, you could see the electric light in the house.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nGlenbow, 1 year, Regina, 5 years and in Okanagan, April 1913\n\n16. Where did you settle or take up land?\n\nNowhere.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFor a holiday of travel &风采—every month of every\n\nand took my life's family to see the beauty\n\nPov in 1924, New Canada from River & Ocean\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI learned that I had a turn of the century job & got to be a good mechanic. I went to the Saskatchewan Fair in 1917, attended the fair, and got work doing in the health & welfare. I moved to 3rd\n\napplied for. For 25 years, you could show 30 years' experience. Bread and\n\nmake my living by working outside of the job.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought I was too adventurous in my age.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nP.R.C. We met the train at Edmonton and took a check train. And got thrown from the train but not hurt.\n\n14. How long did the journey take? Do you remember?\n\nAbout 6 weeks.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nGlenavon. Year: January 5th and in February 1st 1913\n\n16. Where did you settle or take up land?\n\nNow\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFor a Holiday of Travel - New Mexico and Texas\n\nAnd took up a 160-acre tract in the Wambly district in 1924. New Canada from Beam to Ocean\n\n18. How did you earn a living before coming to Western Canada? How about you came?\n\nI learned the trade of a turner in Burnsville But I got a good mechanic's work that to the Rock Island City for $7.00 per week plus a car. And got well paid for it in Beulah, North Dakota. January 3rd 1913\n\nApprenticeship for 25¢ per hour 35¢ per hour 50¢ per hour Bread and milk my family by working outside of my house.\n19. How often did you write to relatives or friends in your old home? Regularly.\n\nOn 78 years I still work with my schoolteacher in school. He was very kind to me. They thought I could help him.\n\n20. If you got married, give the name of your husband/wife along with the date.\n\nYoungest brother & brother-in-law, Sept. 14-1909\n\n21. Did anyone else come to Saskatchewan because of your recommendation?\n\nYes, very many of them. My son Bartley (my eldest)\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell where they came from and where they settled.\n\nYoungest brother & brother-in-law, Sept. 14-1909\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThat it took a lot of energy and good judgment to\n\n24. Did you travel about much in the early years? (for business, attending church,\n\nvisiting friends, etc.) How long? How far? By what means of travel?\n\nTraveling on the oxen hauling 40 to 50 pounds of wheat at 3 miles per hour over a distance on the average of\n\n30 to 40 miles out away from home by 250\n\nbut we were free for 6 to 5 years ahead of the railroad but we\n\nhad some country store where supplies of food could be had\n\nBut women worked very hard.\n19. How often did you write to relatives or friends in your old home? In England, we\n\nOne year I still visited with my schoolteacher in Ireland, but\n\n20. If you got married, give the name of your husband/wife along with the date\n\nnext place of residence.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, a place\n\nto visit?\n\n22. If other members of your family (brothers/sisters, parents, etc.) came first\n\nstill when they came and where they settled.\n\nNow new things\n\n23. Is there any particular experience of pioneer days that stands out in your\n\nmemory which you would like to recount?\n\nPhot. & Text a bit rugged. \"Great graduation to\n\nPioneer boy development, and those who had to get\n\nto the top as the pioneer did from many countries.\n\nWe learned to live with people from many races,\n\nAnd found them just as human as we are,\n\nAnd facing the same difficulties we were affected\n\njust as we were. They were good neighbors\n\njust as we were.\n\n24. Did you travel about much in the early years? By what means of travel?\n\nvisiting friends, etc.) new streets, new farms,\n\nJourney was difficult to the meanest worker of what\n\nor travelling with oxen hauling 40 to 50 pounds of wheat\n\nat 3 miles per hour over a long way from here by 250\n\n30 to 40 miles out west. The average load now to today's\n\ntruck at 50 miles per hour + the average load now to today's\n\nlet way line for 9 to 5 hours ahead of the road back to\n\nhad drive Country store where/why this Ford could be had\n\nBut tomorrow world every where + little wonder\n25. When was the first car used in the community?  \n1907 - A Mitchell\n\n26. If you owned a car before 1914, when did you buy it? What make?  \nNone\n\n27. Where was your trading center? How far from your home?  \n1906 - 40 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)  \nNo, as I had a store, a grocery store next door but we hauled our supplies 40 miles.\n\n29. How often did you shop in the early days?  \nMany folks too supplied with them to the Homestead that lasted 3 months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?  \nAs soon as the railway came there was some attraction, they came from as much as 70 miles.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?  \nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.  \nI never did, and mail order was never successful as the mails were not very regular - not very safe and besides the mail order couldn't operate without the local dealer to display samples so there are very few can judge goods from a picture until they see a sample or some new counter.\n\n32. When did you first have a telephone and what company provided it?  \nBell Telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?  \nThe day I started out.\n25. When was the first car used in the community? 1907 - S. Mitchell\n\n26. If you owned a car before 1914, when did you buy it? What make? None\n\n27. Where was your trading center? How far from your house? 1906 - 40 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new terms, etc.) Yes\n\n29. How often did you shop in the early days? Weekly\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? No\n\n31. What kind of articles did you buy in town and how did you pay for them? I bought groceries, clothes, and other necessities.\n\n32. When did you first have a telephone and what company provided it? Bell Telephone\n\n33. When did you come to Saskatchewan the first time? 1911\n\n34. If so, did you make up your mind after trying it out? Yes\n\n35. The day I started out.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo, as they were just coming in then, not until the\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome did many go & none of them returned but replacements.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI took to municipal life early and was Deputy Mayor of Langley in 1917 & first Mayor of Sherrington 1918. Councilor for 7 terms also on the school board 2 terms & ran school 24 hrs. Have Hot & Cold water for any children to get a bath and a nice shower. Bath rooms to do it in & I was the originator.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWe too have a fine town. A heated swimming pool 4,000 gals of water heated by the two big engines that produce the electric power of the town & district for 100 miles around.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nFrom various reasons. The town of Sherrington from Sherrington of the C.P.R. President, Langley from W.B. Langley. C.P.R. offered me the freight dept., school from some little name who had been a teacher and was active in the formation of school district. Our school the first one is Strathcona School, and some of those same folks wanted the main street called Strathcona Ave. But I put the twist in that, our main street is Centre St & then we have 1st west street in that, our main street is Centre St & then we have 1st west street second - third, fourth, and the main idea East, that is the streets running North South. And the cross streets are Avenue 1-2-3-4-5-6-7-8.\nNo so they was just coming in thus. Not until the\n\n35. There was no hope so they would always attempt to get by with the\n\nAid of Government assistance or whatever help they could.\n\n36. Did many people move away during the 1930s? Did many return?\n\n37. If you or some member of your family have held public offices, or have been\n\nactive in any organizations, mention its name, giving dates wherever possible.\n\n38. In your own words describe your community (town, village, etc.)\n\n39. How did the places in your community get their names? (School district, Post\n\noffice, village, railway stationing, street, hill, etc.) Try to give (1) the\n\nand occupation of person suggesting place-name; (2) origin and meaning of the\n\n(3) date of its adoption; (4) any changes in names since the first name was given;\n\ndate and reason for change. Give dates of any name as above in (1), (2), (3).\n\nFrom various sources, the town of Plummer was named\n\nShannaney of the C.P.R. Railroad, Youngman from C.P.R. Youngman\n\n& P.T. offered in the Taylor Gift, derived from Anna Miller, Anna\n\nwho lived there a teacher and was active in the formation of the school board.\n\nOur Robert the fourth son of Robert Cleghorn (or Butts) and the\n\ndaughters of Robert married the Man of Polled Cleghorn (or Butts) but the\n\nthird son, Our main set to Charles at this time we knew not how\n\nsecond, third brothers, and the Cows which are German. 12-345678\n\nRunning North South and the Cows which are German. 12-345678\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nDon't throw away.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (Indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave 3 children: Theo Edward, Managing Director, Wholesale Hotelier, Regina; University training, a good musician; Mary Esther, the wife of a local lawyer in Murrays Bay; Edith, teacher, supervisor of Education in Regina and has just completed graduating from the University of Alberta with a Masters Degree and is the referee of the Regina Dept of Education.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI think the change of Government was that changed the composition of the whole state of affairs. It changed the manner of our lives.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nSince I've been here 39 years I think we have at least 3 distinct sets of settlers and the present lot came two when we had a young Cowan. Grand roads, cars trucks, babies, tractors etc.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nDid they not know anything about what the settler had to do\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(include your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nPlace 3 children, two Edward, Maurice, Dorothy, and Ethel Gladys.\n\nMary Gethin, the wife of a physician in Winnipeg, died.\n\nEdith became a teacher after finishing high school and has since completed graduating from the University of Calgary with a Masters degree and is now teaching.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI think the change I commented on that changed the composition of the school board is the best.\n\nCompliments of our house,\n\nSignature of writer\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here and write your name and address on what the other wrote.\n\nAnd they only knew anything about what the other wrote.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_866.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5742, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1582, 5], [1582, 3452, 6], [3452, 4665, 7], [4665, 5999, 8], [5999, 7565, 9], [7565, 8812, 10], [8812, 10075, 11], [10075, 11622, 12], [11622, 13237, 13], [13237, 14066, 14], [14066, 16292, 15], [16292, 17768, 16], [17768, 19560, 17], [19560, 20805, 18], [20805, 20961, 19], [20961, 21112, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]