[{"id": "ad0786aed6cc89a2b485c43a92cc645d588fe8ec", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space for answers to the questions.\n\nDon't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n() Pioneer diet\n() Pioneer schools\n() Pioneer churches\n() Pioneer recreation and social life\n() Pioneer farming experiences\n() Folklore in Saskatchewan\n() Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1971, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: William Albert Cohoon ...............................................................\n2. Your address: 323-9th Ave S, Saskatoon ......................................................\n3. Date: April 24th ..................................................................................................\n4. Where were you born? (Give name of place and country) ......................... Ben Acton\n5. What was your father's name and occupation? ............................................. George G. Cohoon, Farmer\n6. When did you come to Saskatchewan? (Give month and year) ............... 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible. .............................................................. Head head of Ben up to this time.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) .................................................. 17 years old.\n9. What were your reasons for coming West? ................................................ To see how I could like the country and to take a homestead if I thought I would like the country.\n10. How did you learn about the West? (Through other people? Reading about it?) Railroad or government information? ................................................... It was easy to carry about the West so so many others had been out here and would talk about this country.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: William Albert Cohoon\n2. Your address: 323 9th Ave S, Shakopee\n3. Date: April 24th\n4. Where were you born? (Give name of place and country): Ben Acton\n5. What was your father's name and occupation?: George H. Cohoon, farmer\n6. When did you come to Shakopee? (Give month and year): Had lived at Ben up to this time.\n7. Mention any other places where you lived before coming to Shakopee, giving dates whenever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a child\")\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nTraveling by train to the country and to take a homestead if I thought I would like the country.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy folks were agreeable but thought I should have waited for a few more years.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nYes, I traveled with many others from the same locality in the Okanagan valley.\n\n13. What means of transportation did you use?\n\nBy train on the CPR.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe first train I worked on was the Dominion Pacific Railway, which was quite a prominent freighter in that part of Manitoba. I also worked on the Canadian Pacific Railway, which was very well known.\n\nOn the way, we saw lots of Indians on the train, and they were very friendly.\n\nThey were anxious to see us, and we were very pleased to see them.\n\nWe passed the Rocky Mountains, and the view was beautiful.\n\nWe arrived at Fort Macleod, Alberta, after a long journey.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed at Fort Macleod, Alberta, for a few days before heading west.\n\n16. Where did you settle or take up land?\n\nI took up land near the town of Macleod, Alberta.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have lived in Macleod for two years, working for the Canadian Elevator Co.\n\n18. How did you earn a living before coming to Western Canada?\n\nI was helping on my father's farm in Ontario before I came west and started farming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\nMy brother homesteaded near Medicine Hat and often he married his wife back to Toronto and not product in Canada.\n\nFor the Provincial government they are the best people.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell them they came and where they settled.\n\n23. In any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI have had plenty of unusual experiences but I feel that my most trying time was when the District and Cooperation of the Cooperative Society. It almost cost me my life.\n\nEvery thing they did we were doomed hard with many professors times when we go into the cooperative stores and mission offices.\n\n24. Did you travel about much in the early years? (For business, attending school, visiting friends, etc.) How often? How far by what means of transportation?\n\nIn the first year I had only been to the district store to travel to Beaverlodge sometimes with the district store.\n\nIn 1908 when the Co-op Club was organized I went around and got around there.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to South Dakota because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\nMy brothers homesteaded near Pierre and often he married he went back to Pierre and got married to a woman for the Provincial government they were the first settlers.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI have had plenty of experiences but perhaps the most trying time I ever knew was the winter of 1876-77.\n\n24. Did you travel about much in this early period? (For instance, attending church, visiting friends, etc.) How often? How far?\n\nIn the first year I had only been to town a distance of 50 miles by 1909 while in South Dakota I traveled extensively and got around quite a bit.\n25. When was the first car used in the community? \n   We had a horse drawn buggy in about 1910.\n\n26. If you owned a car before 1914, when did you buy it? \n   I didn't own a car until later.\n\n27. Where was your trading center? \n   There was a P.A. and Fisk called Northfield 3 miles from my home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, away up country to this for supplies.\n\n29. How often did you shop in the early days?\n   Some of the outfits would make a trip to St. Paul every week or two.\n\n30. What kind of articles did you buy in this way? \n   Usually get goods by mail order.\n\n31. When did you first begin to buy through the mail order catalogues?\n   I have never been a very steady buyer from the mail order houses but usually put away for goods that cannot be easily procured locally.\n\n32. When did you first have a telephone and what company provided it?\n   Bell Telephone Company called the Graceville Rural Telephone.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I came in 1904 but because you knew they'd probably have someone there at least.\n25. When was the first car used in the community?\n   We had a Model T Ford about 1910.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I didn't own a car until 1914.\n\n27. Where was your trading center? How far from your home?\n   There was a P.R. and T.S. store in town.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, we continued to trade there.\n\n29. How often did you shop in the nearby towns?\n   Once or twice a month.\n\n30. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   I bought groceries, clothing, and other household items.\n\n31. Have you been buying anything already bought from the mail order house?\n   No, but usually get goods from the local stores.\n\n32. When did you first have a telephone and what company provided it?\n   The Bell Telephone Company installed the first phone in 1917.\n\n33. When you came to Saskatchewan, the first thing was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I decided to try the west out before I came in 1904 but of course never knew then.\n\nI couldn't have gone once there at least.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. Did any people move away so they didn't like farming and some could not make a success of farming and sold their homesteads and left the valley? Some moved to other parts of the province.\n\n40. Was there a few units away to the north country or to Franklin, Idaho, some came back but the majority did not return.\n\nRural Telephone Co. for many years.\n\nOf course they also use cattle, horses and some still use mules.\n\nAn early settler of the district, Mr. B. L. B. Brown, was born in 1870 in New Hampshire. He came to Idaho in 1890 and settled near the town of Buhl. He was a pioneer farmer and rancher who lived in Idaho for many years. He died in 1945 at the age of 75.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railroad stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names and reason for change.\n\n39. Are there any interesting stories about the early settlers of your district?\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWhere is my possession? (Name of town) (Describe)\n\nThat might be of interest, also some old photographs and pamphlets.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, again or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_754.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4693, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1709, 5], [1709, 3273, 6], [3273, 5084, 7], [5084, 6172, 8], [6172, 7753, 9], [7753, 8417, 10], [8417, 9750, 11], [9750, 10828, 12], [10828, 12105, 13], [12105, 13480, 14], [13480, 15036, 15], [15036, 15909, 16], [15909, 16991, 17], [16991, 17983, 18], [17983, 18138, 19], [18138, 18292, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]