[{"id": "5d2e4d347bf5cc55dee6a053f4c5bdec6f1bb885", "text": "NOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ......................................................\n2. Your address ..........................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...........................................\n5. What was your father's name and occupation? .............................................................\n6. When did you come to Saskatchewan? (Give month and Year) ........................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .............................................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) I was 11 years old.\n9. What were your reasons for coming West? Came with my family.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) My uncle, Robert Jaques talked my father into going west. He had gone west to Yellowgrass three years before and was in love with the country so he talked my father into leaving the sailing and to go west.\n1. Your full name: Edna Jaques\n\n2. Your address: 228, Park Ave., Regina, Sask.\n\n3. Date: April 15th, 1955\n\n4. Where were you born? (Give name of place and country): Collingwood, Ont.\n\n5. What was your father's name and occupation? Captain on the Great Lakes\n\n6. When did you come to Saskatchewan? (Give month and year): 17th March 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). I was 11 years old.\n\n9. What were your reasons for coming West? came with my family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) My uncle, Robert Jaques talked my father into going west. He had gone west to Kellorgrass three years before and was in love with the country so he talked my father into leaving the sailing and to go west.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI think my grandfather thought we were crazy but later on in 1904 he came west and my grandmother and homesteaded (he was 76 then). He died before completing his three years but Dad got the quarter it is still in the family, my brother Clyde farms it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use? C.P.R. train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThere were many Indians in and around Moose Jaw at that time. I can remember them squatting on the side walks in their bright shawls and leather clothing on the men.\n\n15. Where did you first stay when you arrived in Saskatchewan at another uncle's nest? Jaques who came out as a very young man to work on the Crow Nest, Jaques part of the railway was just going in. He arrived at Moose Jaw with 75¢ in his pocket enough for supper, bed and breakfast. He left at dawn with a bunch of workers for the Crow Nest. Later homesteading at Buffalo Lake, where we went first.\n\n16. Where did you settle or take up land? Dad filled on the homestead on March 17th, 1902.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived there all the time, my brother still lives on the Old homestead, he farms 480 acres, Dad's quarter Grandpa's Quarter and a quarter Dad bought. Dad's homestead was 22-14-42a, N.E. ¼.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI think my grandfather thought we were crazy but later on in 1904 he came west and my grandmother and homesteaded (he was 76 then). He died before completing his three years but Dad got the quarter it is still in the family by my brother Clyde farms it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use? C.P.R. train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.) There were many Indians in and around Moose Jaw at that time. I can remember them squatting on the side walks in their bright shawls and leather clothing on the men.\n\n15. Where did you first stay when you arrived in Saskatchewan at another uncle's house? Jacques who came out as a very young man to work on the Crow nest farm part of the railway that was just going in. He arrived at Moose Jaw with $50 in his pocket enough for supper, bed and breakfast. He left at dawn with a bunch of workers for the Crow Nest. Later homesteading at Buffalo Lake, where we went first.\n\nMarch 17th, 1902.\n\n16. Did you settle or take up land? Dad filled on the homestead on\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived there all the time, my brother still lives on the old homestead. We farms 40 acres, Dad's quarter, Grandpa's quarter and a quarter Dad bought. Dad homestead was 2211-41, N.B.E. EX\n\n18. How did you earn a living before coming to Western Canada? How after you come?\n19. How often did you write to relatives or friends in your old house? They kept up correspondence with relatives in Ontario until they all died.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married in 1921, Ernest Jamieson of Winchester, Ont.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n| Name       | Age |\n|------------|-----|\n| Bruce Jaques | 17  |\n| Clyde Jaques | 14  |\n| Edna Jaques | 11  |\n| Marge Jaques | 9   |\n| Arlie Jaques | 6   |\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? Broughooses running away, lack of water, loneliness. We were the FIRST settlers in the district now known as Briercroft. We drove out from Moose Jaw in the district now gone store in Moose Jaw. Sometimes they wrote a letter in to see if there was no station there at that time, so they were just dropped off in a big box there at my father or Bruce went to Drinkwater on the P.R. There was no bridge there so they'd walk a plank on top load them on to the wagons and drive about 10 miles home. That's the way we got our groceries for the first two years.\n\nThere were no schools or churches or people, just us, but buggy loads of land seekers start coming in, then they'll make a line for our place, my people fed them free. (Can you imagine that) scores and dozens of them, gradually the little settlement grew a lot of batchelors, built little shacks but in about five years there were other families coming in.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? We visited the Coventry settlement now and then, about 8 miles from us toward Moose Jaw, Went to church in someone's house I remember.\n\nFrances Coventry and his brothers formed a little settlement, they had a school house, and there was a bridge over the river there. They were very good to us, as I recall.\n19. How often did you write to relatives or friends in your old house? They kept up correspondence with relatives in Ontario until they all died.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married in 1921, Ernest Jamieson of Winchester, Ont.\n\n21. Did anyone else come to Skeetcheson because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n| Name       | Age |\n|------------|-----|\n| Bruce Jaques | 17  |\n| Clyde Jaques | 14  |\n| Edna Jaques | 11  |\n| Madge Jaques | 9   |\n| Artie Jaques | 6   |\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? Broughoes running away, lack of water, loneliness. We were the FIRST settlers in the district now known as Briercrest. We drove out from Moose Jaw with a team of broughoes on a lumber wagon. Sometimes they wrote a letter in to say what no station there at that time, so they were just dropped off in a big box there was no bridge there so they'd walk a plank on top of the CPR dam and walk a mile carry our groceries on their backs load them on to the wagon and drive about 10 miles hole. That's the way we got our groceries for the first two years.\n\nThere were no schools or churches or people, just us, but scores and dozens of families started coming and they all made a bee line for our place. We had a school house and church and they all thought that there were other families coming in.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? We visited the Coventry settlement now and then about 8 miles from us toward Moose Jaw. Went to church in someone's house I remember.\n\nFrances Coventry and his brothers formed a little settlement, they had a school house and there was a bridge over the river there. They were very good to us, as I recall.\n25. When was the first car used in the community? My father had the first car, and Overland, he got it in 1911, the year the C.N.R., railway came.\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Dad bought it in Moose Jaw, although there was no one to share, gas lights that shined your eyebrows off every time he lit it.\n\n28. Where was your dwelling nearest the town line? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. Did you continue to trade there? Then a store was built in Drinkwater dam so they could drive over it and draw grain after an elevator was built, and so someone had grain to sell. The going was very slow at first, as frost seemed to get the wheat every year.\n\n30. How often did you shop in the early days? about once a month.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. In 1911, the year the C.N.R., railway came, a certain number of subscribers had to walk in the snow until it started to snow.\n25. Was the first car used in the community? My father had the first car, an Oldsmobile, he got it in 1911. The year the C.N.R. railway came.\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\nDad bought it in Moose Jaw. It was a four seater with no cop, four doors, a horn, although there was no one to start, gas lights that singed your eyebrows off every time he lit it.\n\n27. Where was the trading center for tax from your house?\n\nMoose Jaw, 35 miles away. Then a store was built in Drinkwater about 1911, continued to trade there. (Indicates any changes due to new towns, sayings, better means of travel, etc.)\n\n28. Dad wrote to Ottawa and a bridge was built just above the C.P.R. dam, so they could drive over it and draw grain after an elevator was built and someone had grain to sell. The gohr was very slow at first, as frost seemed to get the wheat every year.\n\n29. How often did you shop in the early days?\n\nAbout once a month.\n\n30. When did people in your district first start going to town regularly on Saturdays? After the railway came in, in 1911.\n\n31. When did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe never used the mail order houses very much, Dad thought the small store keepers needed money to keep going, so we bought mainly all our stuff from the local stores. Moose Jaw had usually as Briarcrest never had any women's clothing, neither had Drinkwater, only men's overalls, shoes, socks, wind breakers, etc., just rough clothing.\n\n32. When did you first have a telephone and what company provided it?\n\nI think it was about 1908. Dad got that started too. He needed a certain number of subscribers and had to talk an old demon when into it. She was afraid of it and slept in the barn until a thunder storm came. When you came to Drinkwater the first time was it worth buying permanent life? Or did you make up your mind after trying it out? When did you make this decision?\n\n**Mr. Dad** just intended to stay three years but he stayed a lifetime, around 36 years I think.\n34. Did any people move away from your district prior to 1914? What reasons?\n\nA lot of bachelors got out, they were too lonely but it was a beautiful rich district, good soil and good crops and most of them (the homesteaders) lived and died there. Now their sons and grandsons farm the homesteads.\n\n35. Did many people move away during the 1930's? Did many return? Not many, they swept it out. Some of the young men went to war but every one of them came home (think God) and all said they never wanted to leave the country again as long as they lived.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMad was a J.A., all his life, a post master, Bruce Jaques my brother has been on the council for twenty years. We all worked for the church. Dad held the first school built, the first Masonic Lodge chartered, the first store, the first church, the first school board, the church board, the first store in the town. He sold it to Horatio, a relative from Ont.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nI don't remember the first dates.\n\nDad had the first post office too, about 1904 I think, he made a little pigeon hole XXXX on a partition in their bedroom that was the first post office, after we drove to Drinkwater for the mail once a week. Tuesdays, after that twice a week, Dad put up a little store right on the farm and run it for about five years did a roaring business too, as it was a kind of half way house between Drinkwater and the Dirt hills and the country beyond.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of the selection (4) any changes in names since the first name was given, etc., and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMy mother named our farm Briercroft. We were driving along a trail and came to a tiny hill, she said to Dad, that's what we'll call our farm, Briercroft, because the hill was covered with brier roses. When the railroad came they asked us for the name for the nearest town.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nA lot of bachelors got out, they were too lonely but it was a beautiful rich district, good soil and good crops and most of them (the homesteaders) lived there and died there. Now their sons and grandsons farm the homesteads.\n\n35. Did many people move away during the 1930's? Did many return? Not many, they went out. Some of the young men went to war but every one of them came back. (Chalk Gold) and some they never wanted to leave the country assinai as I wrote in my book.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here giving dates wherever possible.\n\nDad was a J.P., all his life a post master, Bruce Jaques by brother We all worked on the council for twenty years. Dad had the first school built, the first Masonic Lodge, telephone, graded road. The church was started in our homestead shack then went to the school and after the village was started they built a church, (united) church store in the school board, close church, Board House, also located in the store in the town. He booked it to Herb White, a relative from one.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates whenever possible.\n\n(Bob as owning the first automobile, combine, organizing the first lodge, etc.). I don't remember the dates.\n\nDad had the first post office too, about 1904 I think, he made a little pigeon hole box on a partition in their bedroom that was the first post office. We drove to Drinkwater for the mail once a week. Tuesdays after that twice a week. Dad put up a little store right on the farm and run it for about five years did a roaring business too as it was a kind of half way house between Drinkwater and the Dirt hills and the country beyond.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMy mother named our farm Briercroft. We were driving along a trail and came to a tiny hill, she said to Dad, what will we call our farm, Briercroft, because the hill was covered with briar roses. When the railroad came they asked us for the rate for the nearest town.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe)\n\nMy brothers, Clyde and Bruce Jaques, Briercrest, have a lot of fine old photographs. Bruce likely has the old Masonic book and I XXXXX imagine Mr. Hillson has the old church book.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University of Saskatchewan?\n\n........... (indicate your preference if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have one daughter, Joyce Jamieson, married now to Murray Sagar, 288 Donlea Drive, Toronto.\n\nShe has three children, two boys and one girl XXXXXX.\n\n41. What do you think are the most important changes in your community since you first came here? The new railway that came in 1911 and the little village that sprang up. Although burnt up twice it is still a lovely community, with hundreds of trees planted around the town.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nBruce Jaques,\nClyde Jaques,\nWm. Hillson,\nHomer Watt,\nEd Evans\nMrs. Wm. Elliott\n\nMrs. Lorne Hillson,\nMrs. Jessie McRee\nMiss Ockburn\nFred Ockburn\nMrs. Victor Rusk\nErnie Sanderson\n\nDonald Findlay\nGlenner Westrum\nAll of Briercrest.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of communities, oral traditions, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nMy brothers, Clyde and Bruce Jacques, brother-in-law, have a lot of fine old photographs. Bruce likely has the old masonic book and I XXXX imagine Wm. Hillson has the old church book.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have one daughter, Joyce Jamieson, married now to Murray Soper, 228 Donlea Private, Toronto.\n\nShe has three children, two boys and one girl XXXXXXXX Toronto.\n\n41. What do you think are the most important changes in your community since you first came here? The new railway that came in 1911 and the little village that sprung up. Although burnt up twice it is still a lovely community, with hundreds of trees planted around the town.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\nPrince Jacques, Mrs. Lorrie Hillson, Donald Findlay\nClyde Jacques, Mrs. Jessie McRee, Selmer Westrum\nWm. Hillson, Mr. Ockburn, All of Briercrest.\nHomer Watts, Fred Ockburn,\nEd Evans, Mrs. Victor Rusk\nMrs. Wm. Elliott, Ernie Sanderson\n\nIf someone else has filled in this questionnaire for you, please have that person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_654.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 5922, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1523, 5], [1523, 2565, 6], [2565, 4248, 7], [4248, 5928, 8], [5928, 8107, 9], [8107, 10164, 10], [10164, 11422, 11], [11422, 13665, 12], [13665, 16126, 13], [16126, 18711, 14], [18711, 20475, 15], [20475, 22203, 16], [22203, 22358, 17], [22358, 22512, 18]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]