[{"id": "642e93c71e9ebd08463d8ac1e4a8c0f4152a6793", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. Don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name Joseph Hammerschmidt\n2. Your address Friedenstal Alta.\n3. Date Sept. 26, 1955\n4. Where were you born? (Give name of place and country) Checko-Slovakia Schilighan (town)\n5. What was your father's name and occupation? Farmer and village tailor\n6. When did you come to Saskatchewan? (Give month and Year) May 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Minnesota 1900 to 1904 North Dakota 5 months\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 18 years\n9. What were your reasons for coming West? homesteading, adventure, travel. I had only some months school in this country. So don't mind the spelling. You can't teach an old dog new tricks just to stubborn to learn.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Drang Sang advertised the land in the Wanderer a weekly from St Paul Minn., a government agent of the land for a time. He started a colony near Humboldt a few year before. Then he made a trip to Tramping Lake and picked that land. Got another settlement called Joseph's Colony. For German Catholics. A certain lady with influence in Government wrote an article wanting to abolish settlements of the same class of people. She wanted them to go to the prairie and in the bush and get lost. The weak will inherit the earth in spite of all opposition.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Joseph Hammerschmidt\n2. Your address: 806 3rd Ave., Estevan, Alta.\n3. Date: July 24, 1957\n4. Where were you born? (Give name of place and country): Chuckawalka, Saskatchewan (town)\n5. What was your father's name and occupation?: Farmer and village tailor\n6. When did you come to Saskatchewan? (Give month and Year): May 1907\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Minnesota 1907 to 1909 North Dakota 5 months\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 18 years\n9. What were your reasons for coming West?: Homesteading, adventure, travel. I had only recently attended school in this country, so didn't want to be behind to learn.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Reading about it.\n\nThe spelling is not consistent throughout the text.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Friends said not to go to this land.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I went all alone.\n\n13. What means of transportation did you use?\n   Hired through to Winnipeg, then took C.P.R. to Regina.\n   I didn't know of the low rates for homesteaders, paid 4 cents a mile.\n   But I made up later, making many trips to Canada for low rates.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Bought meals for other hoboes who investigated my pocket book. I had a money belt under my shirt and kept only silver in my purse. Then met other young farmers going to Borden. I helped him carry a heavy suitcase containing gears for a windmill. We slept on floor in private house. He told me before hand that talked in his sleep. I woke up in the middle of night him pulling my arm. (not my leg.) He was a nice man.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Saskatoon, Borden a few days. Then I went to work on the C.N.R. as a helper on the pioneer or tracklayer. Then west of the Elbow or Redden on the Saskatchewan River to Battleford.\n\n16. Where did you settle or take up land?\n   East of Dramping Lake.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   In 1914 I went into the army till 1918. Then I bought land in the Peace River Country, there at Friedenstal, where I have resided since. I have a section of land here. Two big boys are running the place. Pam retired on the farm. I will try to write about a few other places where I have been on the lake.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Working on farms and woods in winter. After\n   Railding sod houses in summer, doing in B.C. in winter.\n   After three years I farmed with 4 oxen. Bought one good team\n   at Caduce Alta, with which I started boys fall winter right there.\n   Then traveled per wagon east to Dramping Lake in May 1909.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey went do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn 1914 I went into the army till 1918. Then I bought land in Saskatchewan.\n19. How often did you write to relatives or friends in your old home?\n   Once or twice a year\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Oliver Schonberger on 10th March 1931 at Friedenstal\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Not on my recommendation. But on Prang Gang's advertisement in the Hammerschmidt paper. A large settlement around Tramper's Lake. There are now 25 parishes. There are just as many here as there are in Europe. This settlement was started in 1912. I joined in 1918. They started with oxen here. But brought in horses from Montana.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   There are a few relatives in Ontario and in Minnesota. There are many. I was down there about 2 years ago. There are many relatives there. But most of them would never think of coming to Canada. I am the only one.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   After the track reached Battleford then came another bridge across which we could not go. I went to work with a grading outfit. The boss rode ahead on horseback to pick the trail. We got as far west as Edmonton. We had a large outfit of horses and mules and about 70 men. There was a Hotel with liquor at Edmonton. The man bought drinks and got drunk. I had to save my money. Once we slept on the Prairie for dinner. When an Indian came along with an ax to earn his living, he asked me what I knew. I knew it was against the law, they gave him wishes. He danced for the boys and said god took away big country from Indians, because he was lazy, and gave it to the white men. Then I had to travel with him. I was the youngest, and gave it to the whole men. Then I had to travel with him. I was the youngest, and gave it to the whole men.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   I was on the go all the time, building sod houses and barns, and digging wells. The church was only 4 miles from my place. I went there every Sunday on foot. Several times I went to North Dakota on threshing time, where I got from three to four dollars a day. There was a widow with 3 daughters who had a homestead. We would go there Sunday afternoon. One day she was jealous of me, and told the widow that the sod barn I had built for Mr. Speck had caved in. I had already received $25 dollars, the price for the barn, in advance. If the man comes along now with his stock, he will find no shelter. So I ran 12 miles barefoot to look, and found the barn perfect. I said nothing.\n29. How often did you write to relatives or friends in your old home?\n\nOnce or twice a year.\n\n30. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nOliver John Hammerschmidt on March 10, 1931 at Bucyrus, Ohio.\n\n21. Did anyone else come to Bashkortostan because of your recommendation? It was a place to settle.\n\nWe came here in 1948. We came from Wisconsin.\n\nThere were 25 families. We came from Illinois.\n\nRiver City, Illinois, and we lived there until 1948.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThere are a few relatives in Colorado and in Minnesota. We don't know how many.\n\nConcerning the Canadian, I am not sure.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nAfter the track reached Battleford, they came another stagecoach, which was called the \"Great Western.\" We traveled with a group of about 100 men.\n\nWe had a large outfit of horses and mules, and about 700 men. There was a Hotel with a large number of rooms. The man bought them for us.\n\nThough I knew of a young woman, they gave her to me. She was very kind.\n\nI traveled about much in the early years. (For business, attending the church, visiting friends, etc.)\n\nHow often? How far? By what means of travel?\n\nI went on the go all the time, building sod houses and helping with everything.\n\nThe church was only miles from my place. I went there every Sunday.\n\nSeveral times I went to work in Idaho, but I was living there when I got homestead. We moved to Idaho that summer after we got married.\n\nStill the Indians thought the railroad would build for Mr. Spence, but somehow I had already received 95 dollars. The question for the Indians was answered.\n\nIf the main comes a long way with his stock, he will find our shelter. The train will make sure of the stock and provide the train freight. We will have something to eat.\n25. When was the first car used in the community?\n   I came with a doctor from Battleford in his car in 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Bought my first car in 1929. Chevrolet\n\n27. Where was your trading center? How far from your home?\n   William Delaney had a store close to church. Got his stuff from Battleford.\n   He is still living at Calahoo Alta., west of Edmonton Alta. Has over 30 years.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Some farmers brought horses from the states in 1905. Frank Sandmeyer brought every trading outfit in 1907. He bought all the farms in the country.\n   Grand Trunk was built 1907. Road was made by plowing a furrow where the wagons wheels went. Prairie fires would burn holes into the ground forming hummocks, making it terrible rough.\n\n29. How often did you shop in the early days?\n   Us a bachelor I would go once or twice weekly to buy oatmeal and flour and some belly pork. For week we would have nothing but oatmeal and dumplings.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   We knew nothing of that custom in early days. We bought some on Sundays after mass, also got the mail. Which was at the store.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   We knew nothing of that custom in early days. We bought some on Sundays after mass, also got the mail. Which was at the store.\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We didn't have so much money then to throw around for mail orders.\n   We called these catalogues the devil's bible. They were only used in toilets. They were a great temptation for women. The course of domestic trouble. My wife has sold clothes full of thread all eaten by moths.\n\n33. When did you first have a telephone and what company provided it?\n   We had Peace River telephone in 1918 by the farmers themselves.\n\n34. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   During Sir. Wilfrid Laurier administration we got very much attached to the country. You couldn't get standing room coming in. Afterwards, when war broke, you couldn't get standing room going out. Later I just wanted to go to the wilderness to get away from it all. From New York to Chicago to Peace River where the West and the fox say one another good night. People are not rooted in western Canada. Conditions are too uncertain.\n\nThey are only victims of exploitation.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWe sent Frank Sandmaier to Ottawa in 1910 one of 200 farmers to ask for reciprocity on farm machines. Sir Wilfrid promised to make it election platform. When much propaganda he was thrown out. Then many people started to leave the country. More would have gone but could not sell their property. I went to the United States.\n\n35. Did many people move away during the 1920s? Did many return?\n\nThe depression in the 20s caused another exodus. New people came in, but I do not know of only one who came back and he had his farm rented, and now took it up again. The young are more content, indifferent, drifting, unwilling to work. Let tomorrow take care of itself.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been active for the last 20 years as entertainer, theatrical performer, musician, and singing in our parish hall and church choir.\n\nFor the next 3 years I like to keep in the background and take it easy.\n\nI am a convinced Social Crediter, most of the time its better for me to keep my big mouth shut. I even walking down the street when one man keeps me a big kick in the butt. He said that makes fun.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI guess I was the first who moved a house 26 x 30, 2 miles across the prairie with 2 oxen, alone. With block and tackle.\n\nPeter Yams Jr. of Bredenstuhl lived at Tramping Lake with me. His wife was that started this settlement here in 1912. He retired on the farm here two boys is a doctor one a draftsman the other runs the farm. He is well versed and might be able to tell you many things.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur closest town on the Grand Trunk was called Coblenz at the suggestion of a German fellow during the first war. It was changed to Cavel, the name that existed as a spy in Belgium on the Battle River. Breaks then was a bad hill that was called the Pobo Hill, after a pioneer living on the flat below. Queen him cut wheat on the first day of October. There was an old trail from Battleford to Swift Current that but a ½ stage ride. Soft footed oxen would pull out on the prairie making new cuts halfway between both towns we had the 60 miles fresh where we got our wood. Then it was hilly and sandy with slush containing water most all summer.\n36. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWe send Branch Headquarters to Ottawa in the fall of 2014.\n\n35. Did many people move away during the 1914-1918 war? Did many people return during the same period?\n\nThe discussion on the war caused another epidemic. New people came to settle out here and now we are back to the old days.\n\n36. If you or some member of your family have held public office, or have been active in any organization, give name, date, position, and purpose.\n\nA friend who moved here moved his family and church services.\n\n37. If you or any of your family or friends were able to have or do something in the district mention it here giving dates whenever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nI grew up the first who moved a house 26x30, 2 miles north of town.\n\n38. How did the names get their names (school districts, post offices, villages, railway stations, creeks, hills, etc.)?\n\nGives: (1) name and occupation of person suggesting name; (2) origin and meaning of the name; (3) date of its adoption; (4) changes in names since the first name was given; date and reason for change.\n\nGive facts of new name as above in (1), (2), (3), etc.\n\nOur closest town on the Grand Island was called Colborne at the suggestion of a German fellow during the first war. It was changed to Carleton because that was a spy in England on the Battle River.\n\nBesides this was a big hill that was called the Peter Hill after a fisherman living on the lake. Others have called it the Peter Hill ever since.\n\nThis was an old house from the battlefield to the nearest settlement that had a village.\n\nHobby was a creek which became famous for making new rails.\n\nThis was an old railroad track that ran through the area where we got our gravel. This was a very muddy river that was containing all our gravel. This river was mostly affected.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nFather Ebert, a priest at North Star, Alta., has an old pamphlet that describes all the incidents of the beginning of the Tramping Lake settlement.\n\nThe churches keep close record of these things.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFarmer Elmo Hammerschmidt, grandchild Sisbet.\n\nat home - Joe Hammerschmidt Jr.\n\nMary, nurse in Fairview hospital, close by.\n\nOttilia at home.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI was reluctant to change from horses to tractors, only for the boys. I consented to change to tractors and combines and swather. I said, \"You will be slaves to machines, cars and banks.\" But so it is! Machines and repair going up, land farm produce going down. It is however, not good but man made mismanagement. So we should not take it too hard. A good thing makes good times. Social Credit could help, by creating interest free money. We still have homesteads here. People living in the bush, as poor as ever before. Winter conditions as bad as ever experienced in the early days.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nGeorge Reiniger Leipzig, Sask.\n\nBill Delany Calahoo, Alta.\n\nSr. Pete Gans Friedenstal, Alta.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations? (Describe.)\n\nPamphlet that describes all the amenities of the beginning of the Framingham Lakes settlement.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Section or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nDear friends,\n\nI want to relate my experience with my homestead.\n\nLet me make it clear at the very beginning that adventure is what I wanted, and it was what I got. Now if there had been stories about any place in my native town, I would have traveled over the prairie to miles a day (not every day). I traveled over the prairie to miles a day (not every day).\n\nAfter arriving in Shoshone on May 19th, we soon found a man who wanted to go to Wyoming Lake. We had been there for a week or so. A priest would accompany us until we could find a place to settle. We met the young priest at the train station.\n\nThe priest was the only man in the bunch. I couldn't go along for I did not have money enough to start farming. So the best thing for me to do was to work for months and then build a shack.\n\nFilled on my homestead until and unless within an age of William Ross in Portland. Each settler gave $13 dollars towards building the church. George Reisinger my countryman let the expectation. He is still at the same place. After everything with the steel gang for 2 months as a worker, I went with a grading outfit. At Longview we met the bar colonists who had come there the year before. The railroad was built expressly for them. I met the English locomotive engineer on the prairie, feasting three weeks plenty bottles. I heard hilarious laughter. We slept over a badger well. Seems fair to face with the English Cristo-gracy. With my bundle on my back I looked at them, for a brief moment. They saw me. Then I turned around and walked away.\n\ncoincident, one which made a lasting impression on my mind. The government could issue the money and build all the railroads. Then we would not have to pay extra for the passage.\nDear friends I want to relate my experience with my homestead.\n\nLet me make it clear at the very beginning that adventure was not what I wanted, and it was not. None of these hard luck stories have any place in my narrative. I was young and full of fury. I traveled over the prairie 60 miles a day (not every day) on foot. I was able to go the distance.\n\nAfter arriving in Salt Lake City, we went to the town of Salt Lake City. We had been there for a week or so. We would wait until the first pioneers to the new homes. Some of the farmers who had money would settle there. We met the young priest at the Town. He said he would be forward to the trip with great anticipation.\n\nThe priest was the only man in the church. I could not go alone. For God did not have money enough to start farming. So the best thing for me to do was to work for six months and then build a shack.\n\nI filled on my homestead now. It was done within an age.\n\nWilliam Brown Norton. Each settler gave us dollars towards building the church. George Reining my countryman let the expectation. He is still at the same place. After working with the steel gang for two weeks, we met the bear colonists, who had come there the year before. The railroad was built expressly for them. We met the English immigrants gathered on the prairie, feasting. They were plenty bottles. I heard hilarious laughter. We slept over a bedraggled noble farms face to face with the English Christo-gravity. With my bundle on my back I looked at them, for a brief moment. They saw me. Then I turned around and came back again.\n\nThey said, \"We will meet a lasting impression for our convenience, one which would last a lifetime.\" They were right. We would build all our mind. The government could not see the money and build all.\nThe English settler were not satisfied. It seems they expected a white house and a red barn on their places.\n\nOne of them shouted at me: God bring success upon the man that brought us into this god forsaken country to starve to death. We could get drunk at Fogelman's, Owen's, the only ones that had a gun but no ammunition, or we would have shot up the town. Pay on your English man for a.\n\nWe could tell them by their liberty chopped up except.\n\nWhen over the boys got time, I would accompany them out into the country looking for land. There was black soil and grass three deep. I had my land, or I would have taken some weight there. One day at morning time a wagon got stuck in a wet place. We hitched 4 horses on the back. As it jerked back, the front wheels jerked and the wagon tipped over. There was a great shout: man under the load! We threw plows and therapies in all directions, and found the poor fellow with a rope broken arm. There was a dealer somewhere on the 200 mile line, but where? East or west. Both boys took the buckey and went first west to the next outlet. Then he found out that the dealer was east, so he took the enlarged map away with the buckey the next morning. I learned later, that one could alleviate the pain by putting hot and cold towels, dirt in hot and cold water on the swollen part, changing this often continuously. The swelling gets blue and more heat. This is well to remember. Jimmy says a little or at least alleviated much pain. This is what is called the water treatment. You must be done at once after the accident. Be sure to make it plenty hot.\nThe English settler where not satisfied. It seems they expected a white house and a red barn on their places.\n\nOne of them shouted at me: God bring success upon the man that brought him into this god forsaken country to save us to dead. We'll go down at Plymouth. Our only son that had a gun but no ammunition, or we would have shot up the town. Pray for your English man, for a\n\nWe could tell them by their dirty chopped up except.\n\nWhen own the boys got time, I would accompany them out into the country looking for land. There was black soil and grass fence deep. I had my land, or I would have taken some weight there. One day at morning time a wagon got stuck in a new place. We hitched horses on the back. As it jumbled back,\n\nthe front wheels jack knifed and the wagon tipped over. There was a great shout: man under the load! We threw plows and themselves in all directions, and found the feet fellow with a rope broken arm. There was a doubt somewhere on the 200 mile line but where? East or west. Both the corn took the buckey and went first west to the next outlet. Then he found out that the dealer was east so he took the improved manner away with the buckey the next morning. I learned later that once could alleviate the pain by putting hot and cold towels, dirt in hot and cold water on the swollen part.\n\nChanging this continuously. If the swelling gets blue apply more heat. This is well to remember. Always save a life or at least alleviate much pain. This is what is called the water treatment. Opiates be done at once after the accident. Be sure to make it plenty hot.\nThe English settler when not satisfied. Of seems they expected a white house and a red barn on their places.\n\nOne of them shouted at me: God being outers open the man that brought us into this god forsaken country to starve to death. We'll hang you at Fort Smith, if we can find the only one that had a gun, but no ammunition, so we could have shot up the town. Pay to you Englishman far-a.\n\nWe could tell them by their ability chopped up except.\n\nWhen even the boys got home, I would accompany them out into the country looking for land. There was black soil until grass fence deep. I had my land or I would have taken some weight there. One day at morning time a wagon got stuck in a muddy puddle. We hitched horses on the back of it jerked back, the front wheels jack-knifed and the wagon tipped over. There was a great shout: man under the load! We threw plows and scrapers in all directions. There was a doctor somewhere on the 200 mile line, but where? East or west. Both men took the buckshot and went first west to the next outfit. Please found out that the doctor was east. So he took the wounded man away with the buckshot the next morning. I learned little. That our could alleviate the pain by putting hot and cold towels, slight in hot and cold water on the swollen part, changing this continuously. With swelling get blues apply more heat. This is well to remember. You may save a life or at least alleviate much pain. Pain which is called the water treatment. Opium is done at once after the accident. Be sure to make it plenty hot.\nThe English settler was not satisfied. It seems they expected a white house and a red barn on their places.\n\nOne of them thought at one: God being out of the man that brought him into this godless country to starve to death. Our Lord got church at Southampton. Over the only one that had a gun but no ammunition, so we would have shot up the town. Pay on you Englishman far.\n\nWe could tell them by their dirty clothes up except.\n\nWhen own the Englishmen would accompany them out into the county looking for land. This was black soil and grass nine deep. Had any land, or ground, would have taken some weight there. One day at morning time a roughy got stuck in a new place. We hitched horses on the back as it jerked back.\n\nThere was a great shout: man under the load! All three plows and the front wheels jack-knifed and the wagon tipped over. There was a broken arm. There was a doctor somewhere on the 900 mile line, but where? East or west. Both men took the buckeye and went east-west to the next outfit. Please found out that the doctor was East, so he took the buckeye with the buckeye the next morning. Or will it be that he could alleviate the pain by putting hot and cold towels, slept in hot and cold water on the swollen foot.\n\nChanging this off continuously. Apple swelling gets blues apply more heat. This is well to remember. Always use a life or at least a little much hair. This is what is called the winter treatment. Should be done at every other the accident. Be sure to make it plenty hot.\nThere was one big thunderstorm that took all our tents down except our sleeping tent which we had thrown by sheer force. After two months with grinding out felt, it was time for me to go back to my homestead to build my shelterhouse. Back to Battleford 200 miles away. I figured the best way would be to go on the Saskatchewan river that flows past that town. I bought my canoe, which I could easily carry in Battleford. I traveled north to the river and made a raft, covered it with spruce bows and set her adrift. I spread my blankets on top and went to sleep. When I woke up, I took my long pole to see how deep the water was and—umph! I was stuck in a sandbar.\n\nThis happened several times during the night. Each time I had to get out, carry food and light and push with all my might to get the raft free again. Next night it started to rain. I found a nice spot at an overhanging branch. Leaning on a place I lined it with spruce bows. I placed my blankets on it and went to sleep. Often waking up, I heard foxes barking along the river banks and the water boiling from the rain.\n\nPoveshell came loose from the overhanging branch. Showers of sand and gravel would settle down. I was on the go—two day break. I soon saw that this would mean no—no large tree that I had seen the day before in the south. I could not see in the north. At this time I had only been making a long horse shoe bend. It might take me another week to make Battleford, and my provisions were getting low. I had to abandon the voyage north and head west. The water was low, making no headway. The writer was low.\nThere was one big thunderstorm that took all voice from me except our sleeping tent which we had thrown by sheer force. After two months with the grinding out of acres, time for me to go back to my homestead to build my sodhouse. Back to Battleford 200 miles away. I figured this journey would be to go on the Saskatchewan river that flows past that town. Forget my diligence, which I could only earn in Battleford. I traveled north to the river and made a raft, covered it with spruce bows and set her adrift. I spread my blankets on top and went to sleep. When I woke up, I took my long pole to see how deep the water was and—umph! I was stuck on a sandbar.\n\nThis happened several times during the night. Once I had to get out carefully and lift and push with all my might to get the raft free again. Next night it started to rain. I found a nice spot at a riverbank and the raft was safe. I landed it with spruce bows spread over my blankets on it and went to sleep often awakening up. I heard foxes barking along the riverbanks and the water babbling from the rain.\n\nPoppies swelled once loose from the overhanging branch. Showers of snow and gravel would settle down. I was on the go—two-day break. I soon saw that this would mean no—no large tree that I had seen the day before in the south. I could now see in the north. All this time I had only been making a lonely horse shoe bend. It might dash me to then a week to make Battleford, and my foolishly now getting late. I shall abandon the raft.\n\nNorth across where also driving my raft. Chuck Quay making no headway. The water was low.\nAt times I came to a stop. The tender told me that\nLoydminster was about 25 miles away. I began to think\nmy legs and feet would get there before night fell. I stayed over\nnight at Loydminster. The early part of the house gave\nme a lack of milk. I soon found that there was no milk\nin these folks. They were honest and straight forward.\n\nThe steel had been making headway. In two days\nworking I got to the end of the steel. Then I helped on\nthe work train to Butteford. It was the end of August.\n\nNobody had heard a thing of an Tramping Lake settle-\nment. For the pioneers had gone out from darkkaton,\nand never had met a settler. Butteford also with a\nTramping Lake, thirty miles of barren wilderness. Not a soul\ndid I see anywhere. I had a little map and took my directions from\none lake to another. At last I came to Ploma Lake west of arbutus in\nnew families here is no place. I saw a bunch of wild horses. They\nraised their heads high, darkled it and flew. Female they came very\nclose. Took a look at that strange animal. Then they turned\naway and disappeared over the hills. I said to myself thank god here\nis the last lake, I hurried towards the water. It was hot. I knew nothing\nof the pack was worrying me down. The water was my next step.\nI could not tell the end. I walked a hundred yards and there was\na spring with cool clear water. After ten more miles I came to the\nsettlement. The pioneer house was made of lumber and covered church.\nThe other pioneer house, build around it in joshua hicks. My home.\nWe'll at once be away. The tender told me that\nJoydminister was about 25 miles away. We began to think\nmy legs would get there before nightfall. We stayed over\nme a pack of milk. We soon found that there were no quill\nin those folks. They were honest and straight-forward.\n\nThe steel had been making headway. In two days,\nwe'll be to the end of the steel. Then we'll be on\nthe work train to Battleford. It's the end of August.\n\nNobody had heard a thing of a Trampiny Lake settle-\nment. For the pioneers had gone out from darktown\nand never heard of Battleford. So with a\nTrampiny Lake, thirty miles of barren wilderness, not a soul\ndid I see anywhere. I had a late map and took my directions from\nyou lake to another. At last I came to Roma Lake west of Arbutus in\nmore families here in which you can see a bunch of wild horses. They\nreceived their heads high, dashed it and fell. Female they came very\nclose, took a look at that strange intruder. Then they turned\naway and disappeared over the hills. I said to myself \"Thank you, here\nis the last lake, I have seen towards the east. It was hot. I was sweating\nthe puck away anyway. I was very thirsty. I walked a hundred yards and there was\na spring with cool clear water. After ten miles down to the\nsettlement. The streets were very muddy. I walked around it in socks. My home.\nIn 1913 I went to work on the Grand Trunk furnishing the telegraph line into Prince Rupert. Then a mining town, now on the coast. When the job was done I started my travel into Alaska and the Yukon. The wages were better there, $15 dollars a month, that I could not make anywhere else. In Alaska the currency was all gold coins. I got a job doing road work in the mountains.\n\nIn a large lumberhouse where crude barrel kegs filled with hay. There we spread our own blankets. The men would throw these pants on the wooden bunks before going to sleep. With the gold coin anything on their pockets. To me old men who seemed as careless as this was too much of a temptation. He sniggered around at night, and took a coin or two from each pocket. In the summer time it never gets real dark even at night. So one man saw him finishing his pocket. He got up in his underwear took his stove pitcher and hit the man twice below over the head. The man fell down like a stack call. I jumped out of bed and shouted: \"Get all mighty! What's the matter now?\" Then the big man told us, I fixed the son of a bitch. Rough justice had been dealt out.\n\nNothing more was done or said. But when the news heard what happened he chased the men away. We didn't want no thieves here.\n\nThey have no more gold coins now. This modern game of checks, fed up with me, and confidence man. He would break out the inside of the conveyance the gold and fill the space with lead. We'd be the banditment of gold coins, the good old times are here over.\n\nNow the gold days are over at Fort Macleod, Prov. I tried to get a job in a gold mine. There was a big gold mine at Speculator just across from where the capital of Alaska. It was very tough mine over the 4 miles distance. Got the street I'm on stillish.\nIn 1942 I went to work on the Grand Trunk furnishing the telephones line into Prince Rupert. Then a turning train, now on the train. When the gold was done I started my travel into Alaska and the Yukon. I always where better there, $500 a month, that was all gold coins. I got a lot doing real work into the mountains.\n\nIn a large lumber house where crews located beds filled with hay. There we spread our own blankets. The men would throw them pants on the wooden benches before going to sleep. With the gold coins hanging in their pockets. To me old men who served as lumbermen, this was too much of a temptation. He snuck around at night, and took a coin or two from each pocket. The owner of the lumber yard looked. He got up in his underwear took the stove, Tucker and hit the man five six blows over the head. The man fell down like a stack call. I jumped out of bed and shouted:\n\n\"Get all neighbors what's this matter now?\" Then the big man told us, \"I fixed the son of a bitch. Rough justice had been dealt out.\n\nNothing more was there to say. But when the news heard what happened he chased the man away. We didn't want no trouble here.\n\nThey had no more gold coins now. This modern time of Books, kindness, and confidence man. He would break out this inside of the company house the gold and fill the space with lead. With the abandonment of gold coins, the good old times are here once.\n\nNow the gold lays buried at Fort Amherst. I tried to get a job in a gold mine. There was a big gold mine at Spence Hill just across from Juneau the capital of Alaska. A few years back me over the 4 miles distance. (The street) 9 main an allish.\nby telling him Davis was looking for a job in the gold mine.\n\nHe said: \"Young man, there is no place for you here. The mines are dangerous. The roof is too high and there are many falling rocks.\n\nThey bring them up in boxes. They told him he could go back when the rainy season came. Meanwhile, I took a look at the stamp mill and watched the gold washing process for concentrates. (Page 2)\n\nI walked through the small town, that was only about a block long,\n\nstrung along the beach. When I came to the land block I found some\n\nquick looking buildings with southeastern Pacific and\n\ninsurance in all looked deserted. When suddenly a stranger walked in front of me.\n\nIt lady in a nightgown stepped out and said: \"Hey kid, come over\n\nhere, come here. Now I know this is a seed legal district. I learned\n\nright away and walked back. When a door gun shot, and another\n\nLady shouted: come over here, kid! come here! Together, they decided\n\nto run across the street. When a door opened three times, and another\n\nLady called to me. Now I start there like an animal at the beginning\n\nlooking for a way to escape. Then I saw a new road leading\n\ntowards the cliffs, a distance of 10 yards. I rushed there and started\n\nto climb the bank and over hill. As I looked back, I saw that the\n\nstreet was now filled with women yelling shouting and laughing.\n\nHer, I'll come back here. It's going to be tough. I found a great berry\n\nmuch has grown since before. There was a kind of berries,\n\nThey were all ripe and nobody had ever been there before. They were\n\nthe largest and smoothest berries I've seen in my life. When I reached\n\nman, he put him in a garden of grapes and berries. Didn't succeed,\n\nwould please him most. Here was no forbidden fruit. He had let\n\naches down below. The parodies arose up here. Didn't show his hand\n\nSome time later, the ocean flooded. The mines and farms were out.\n\nStevens never reclaimed. The place is a ghost town and the land went to\n\nGeneral...\nby accident from Drews looking for a place for your feet. The mine is\ndangerous. The roof is high and there are many falling rocks.\nPlaying here in Mexico (Pan) took him several weeks back,\nwhen the heavy rain came. Meanwhile I took a bath at the steam mill,\nand watched the field washing process for concentration. (Pan)\nstrolled through the small town, that was only about 5 blocks long,\nstrung along the beach. When I went to the land block I found some\nquick looking buildings with red curtains. I was interested and\nall looked deserted. When suddenly a large group of people came\nat last in a mighty rush. They yelled and said they had come over\nfrom across the street. Now I knew there was a real deal district. I turned\nright around and walked back. With a deep sigh, I sat down and thought\nhard about it. I could not come here. I got back to my place\nto run across the street. When an hour went by, I saw another\nparty called to me. Now I knew there was a real deal district.\nLooking for a way to escape, I found a great big\nmatchbox. I never seen before. There was much kind of stories.\nThey were all right and nothing had ever been there before. They were\nthe largest and most beautiful. Before I went back to my life. When I got back\nman, I put them in a good looking fruit basket. Didn't you see\nhow they looked? I'm sure you did. It's hard to\nachieve down below. The parades arise up here. Didn't you hear\nsome time late the ocean break? The mine and above the ocean\nthere was no water. The place is a ghost town and I'm sure\nit was never reclaimed. The place is a ghost town and I'm sure\nIn conclusion, I regret the passing of those days.\n\nI used to travel a lot and enjoyed myself. Today I don't have that opportunity.\n\nIt just looks like this business man was trying to eat you up.\n\nOn the early days, the railroadman paid only 25 cents for a meal.\n\nno matter what was cheap or not. I don't think so much\n\nand never had a sick day once life. Those early days are\n\nin what hard work you do. I remember the days when\n\nonly people went to work every day and had considerable\n\nthe day after, I read my Bible every day and found considerable\n\nsatisfaction in spiritual contemplation. The Lord always gets the\n\nhappier he should become. He seems to be getting closer to heaven.\n\nI will give you some of my experiences on the wilderness. You are last\n\nin the woods, look at those trees. They are brighter on the southwest side.\n\nmeet with truth, since the sun is hottest on the southwest. If you have\n\nnothing to eat, try the branch of old pine tree. There is a thin layer under\n\nthe main trunk. That a person can eat and love. After traveling over\n\nthe prairie the stones are bleached on the southwest and mossy on the\n\nnorth. If you have no food, there is a weed growing near places.\n\ncollecting German sauce among them some of the stems get thick\n\nas a little finger, and has blueish blossoms. I taught to keep my pockets\n\nfull of these stems. They last like crackers. Give them to you for\n\nmuch smaller than juice. They quench thirst and relieve hunger.\n\nChildren should learn this in school, and also learn how to survive.\n\nIf you have no matches, drive twigs into the ground, you'll find\n\none on the top of both sticks, and make a crosspiece painted on each\n\nend, put that on the hole, make a little fire to cook several times around the stick.\n\nStart a strong fire away from the puddle, until you reach the\n\nKingdom of God. And now fare thee well.\nIn conclusion, I regret the passing of those days.\n\nI used to travel a lot and enjoyed almost every day. Today, I don't have the opportunity to go anywhere. It seems so much harder now.\n\nIt just looks like the countryside around me is trying to eat my eyes.\n\nIn the early days, the railroadman paid only 25 cents for a meal.\n\nNow, when you're charged, it's 75 cents. I don't mind it though.\n\nThere are many things to consider in life. You must be careful and think twice before making any decision.\n\nThe day after, I recall my little worry day and feel considerably satisfied in spiritual contemplation. The situation gets better.\n\nHe should become aware of getting closer to heaven.\n\nI'm giving you stories of experiences on the wilderness. You will last another month without seeing the sun in the afternoon. If you have nothing to eat, then the branch will provide. There is a thin layer under the main bark. That is a good source of food.\n\nIf you travel over the prairie, the stones are bleached on the southeast and mossy on the north. You haven't found there is a variety of flowers called German Wallflower. Some of them get thick, a little fangy, and have blueish blossoms. Picked to deep my pockets full of these items. They last longer than others.\n\nChildren should learn this in school, and also learn how to survive.\n\nIf you have no matches, drive two sticks into the ground, roughly half an inch apart. Then put the hell, roll a leaf, and place several times around the stick.\n\nStore the leaves away, according to your clothes, each piece away.\n\nKangaroo of God. And never fear the well.\nIn conclusion, I respectfully request the passage of the old laws.\n\nI need to travel a lot and employ a new method. Today I shall hardly get anywhere. Please be merciful and take all the pictures out of life.\n\nIt just looks like this. Cruising ocean was trying to eat you up.\n\nIn the early days, the railroadman paid only 25 cents for a meal.\n\nNo matter what was charged to others, I didn't drink or smoke\n\nand never had a sick day in my life. Occasionally they demanded\n\nin what hard work you did. I worked hard and steadily, always\n\nnobody could manage to subdue extenuating, enjoy life and pursue\n\nthe day after. I read my Bible every day and find considerable\n\nsatisfaction in spiritual contemplation. Therefore many get the\n\nhappier he should become because he gets closer to heaven when\n\nI willingly give you some of my experiences in the wilderness. If you are lost\n\nin the woods, look at the trees. They are bright on the southeast side\n\nnot in the south where the sun is hottest in the afternoon. If you have\n\nnothing to eat, strip the branch of the majestic tree. There's thin layer under\n\nthe main trunk. That is poison and there. If you travel over\n\nthe pine needles, stones are blacked on the southeast and mossy on the\n\nnorth. If you have no food, there is a weed growing near places.\n\ncalled in German \"Sauerampfer\" some of the stems get very thick\n\nas a little finger, and has a blueish blossom. Picked to their midpoint,\n\nfull of those stems they last a week. But then as you go,\n\nwill swallow the juice. They quench thirst and will fill hunger.\n\nChildren should learn this in school, and also learn how to survive.\n\nIf you have no matches, draw two sticks into the ground through a hole\n\non the top of both sticks and make a crosspiece twisted on each\n\nend, put that in the hole, rally a bell in the seven times around the stick.\n\nAnd fill back up for two minutes. Your clothes each piece easy.\n\nYour a strong survivor according to the principles, until you reach the\n\nKingdom of God. And now face the well.\nIn conclusion, I regret the passing of the old days.\n\nI used to travel a lot and enjoyed almost every place. Today I don't have any particular place in mind.\n\nIt just looks like this beautiful mountain is trying to call you.\n\nIn the early days, the railroadman paid only 25 cents for a meal.\n\nNo matter what was charged to others, I didn't think it was worth having your family members eat there. However, they did.\n\nThe day after, I read my Bible every day and found considerable satisfaction in spiritual contemplation. The church always gets the happiest he should become. Because by getting closer to heaven, they will give you something to experience in the wilderness.\n\nIf you are lost in the woods, look at the trees. They are bright on the southeast side.\n\nMeet them to the south since the sun is hottest in the afternoon. If you have nothing to eat, try the branch of the pine tree. Then go to the maple tree.\n\nThis main trunk that is growing tall and fine. If you travel over the prairie, the stones are blazed on the southeast side.\n\nNorth if you have no food. There is a weed growing near the base called a German dandelion. It has a blueish blossom. It is a little fleshy, and has a blueish blossom. It is good to be eaten.\n\nFull of those stones, they last like rock. But then as you go, until swallowed the piece. They grow on the east and west side.\n\nChildren should learn this in school, and also learn how to survive.\n\nIf you have no matches, drive toothpick into the ground through a hole and put that in the shelter. Build a shelter with several holes around the stick.\n\nStart a fire with coals and build the fire until you reach the kingdom of god. And never face the well.\nThere is a thin layer under the main bark that a person can eat and live. If you travel over the prairie the stones are bleached on the southwest and mossy on the north. If you have no food, there is a weed growing most places called German Sawtooth; some of the stems get as thick as a little finger, and has a bluish blossom. I used to keep my pockets full of those stems, they last like rubber. Chew them as you go, and swallow the juice. They quench thirst and abolish hunger. Children should learn this in school, and also learn how to swim.\n\nIf you have no matches drive two sticks into the ground, gouge a hole on the top of both sticks, and make a crosspiece pointed on each end, put that in the holes, make a belt or rope several times around the stick, and fill back up so it will not fall off. Wool from your clothes catch fire easily.\n\nStar a straight course, avoiding the pitfalls, until you reach the Kingdom of God. And now fare thee well.\nthe main bark, that a person can eat and live. If you travel over\nthe prairie the stones are bleached on the southwest and mosses on the\nnorth. If you have no food, there is a weed growing most places,\ncalled German Sawcaper, some of the stems get as thick\nas a little finger, and has a blueish blossom. I used to keep my pockets\nfull of those stems, they last like rubber. Chew them as you go,\nand swallow the juice. They quench thirst and abolish hunger.\nChildren should learn this in school, and also learn how to swim.\n\nIf you have no matches drive two sticks into the ground, gouge a hole\non the top of both sticks, and make a crosspiece pointed on each\nend, put that in the holes, make a belt or rope several times around the stick,\nand fill back an fort. Wool from your clothes catches fire easily.\nStar a straight course, avoiding the pitfalls, until you reach the\nKingdom of God. And now fare thee well.\nIf you have no...\nIf you have no...\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_843.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 44, "total-input-tokens": 73040, "total-output-tokens": 14622, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1665, 7], [1665, 3241, 8], [3241, 5120, 9], [5120, 6485, 10], [6485, 8647, 11], [8647, 9304, 12], [9304, 12126, 13], [12126, 14133, 14], [14133, 16958, 15], [16958, 16958, 16], [16958, 19963, 17], [19963, 21915, 18], [21915, 23961, 19], [23961, 24933, 20], [24933, 26657, 21], [26657, 28435, 22], [28435, 30033, 23], [30033, 31623, 24], [31623, 33171, 25], [33171, 34682, 26], [34682, 36272, 27], [36272, 37867, 28], [37867, 39383, 29], [39383, 40714, 30], [40714, 42486, 31], [42486, 44130, 32], [44130, 46094, 33], [46094, 47696, 34], [47696, 49558, 35], [49558, 51159, 36], [51159, 53185, 37], [53185, 54879, 38], [54879, 55834, 39], [55834, 56747, 40], [56747, 56765, 41], [56765, 56783, 42], [56783, 56938, 43], [56938, 57092, 44]], "primary_language": ["None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]