[{"id": "432e7ff93c4401d8a50145adc98a7f46b224e658", "text": "A Copy of Mr. J. Allen's Diary during Journey from Toronto to Phoebus Forks Bank. April 15th to June 12th 1862.\n\nWe left Union Station Toronto via Grand Trunk Railway on Wednesday morning April 19th 1862 at 8:15 a.m., arriving at St. Paul on Saturday night at 11:00 P.M. April 23rd, at which place we were compelled to stay 16 days on account of a flood. We slept in cattle cars.\n\nMost of the Officiators were very uncivil.\n\nWe started from St. Paul on Monday night May 6th at 11 P.M., arriving at Brandon on Sunday May 14th at 3 P.M.\n\nHere Mr. John Stillborne buried one of his twins who had died on the way. On these six days trip I never knew or found such uncultivated and uncivilized conductors in all my life.\n\nI asked one a question as to the journey being so slow and he replied \"to hell with you and your questions\". Another said to me \"Be damned to your Question's you will get there some time this year\".\n\nWe left Brandon on Thursday night at 6 P.M. May 16th. After travelling about four miles we rested. Here Mr. R.J. Fleming who had been with us thus far bade us goodbye, and went back, but most of our hearts were almost too full to return the compliment.\n\nFriday May 17th. After travelling about four miles we went through 7 awful sloughs, travelling only 3 miles in ten hours.\n\nMay 20th. We only travelled 2½ miles. It was a terrible cold night with frost, had to cross six sloughs, had to use 10 yoke of oxen to a wagon. William Hartwell's wagon was stuck so we had to unload.\n\nSunday May 21st. We rested and had a good prayer meeting. Bless the Lord; He was with us and blessed us all; There was a good attendance at the Prayer Meeting and we all had a glorious time.\nA Copy of Mr. J. Allen's Diary during Journey from Toronto to Pembina Forks Bank, April 16th to June 12th 1892.\n\nWe left Union Station Toronto via Grand Trunk Railway on Wednesday morning April 19th 1892 at 8:15 a.m., arriving at St Paul on Saturday night at 11:30 p.m. April 22nd, at which place we were compelled to stay 16 days on account of a flood. We slept in cattle cars.\n\nMost of the officials were very uncivil. We started from St. Paul on Monday night May 6th at 11 p.m., arriving at Brandon on Sunday May 14th at 3 p.m.\n\nHere Mr. John Stillborne buried one of his twins who had died on the way. On these six days trip I never knew or found such uncivilized and uncivilized conductors in all my life.\n\nI asked one a question as to the journey being so slow and he replied \"to hell with you and your questions.\" Another said to me \"we damned to hell with you and your questions.\" Another said to me \"we damned to hell with you and your questions.\"\n\nYour Question's you will get there some time this year.\"\n\nWe left Brandon on Thursday night at 6 p.m. May 16th. After travelling about four miles we rested. Here Mr. R.J. Fleming who had been with us thus far gave us goodbye and went back but most of our hearts were almost too full to return the compliment.\n\nFriday May 18th, after travelling about four miles we went through 7 awful sloughs, travelling only 8 miles in ten hours.\n\nMay 20th, we only travelled 2½ miles, it was a terrible cold night with frost, had to cross six sloughs, had to use 10 yoke of oxen to a wagon. William Hartwell's wagon was stuck so we had to unload.\n\nSunday May 21st. We rested and had a good prayer meeting. Bless the Lord! He was with us and blessed us all; There was a good attendance at the Prayer Meeting and we all had a glorious time.\nA Copy of Mr. J. Allen's Diary during journey from Toronto to Pheasant Forks Sask., April 19th to June 12th 1883.\n\nWe left Union Station Toronto via Grand Trunk Railway on Wednesday morning April 19th 1883, at 8:15 a.m., arriving at St. Paul on Saturday night at 11:30 p.m. April 22nd, at which place we were compelled to stay 16 days on account of a flood. We slept in cattle cars. Most of the Officials were very uncivil.\n\nWe started from St. Paul on Monday night May 6th, at 11 p.m., arriving at Brandon on Sunday May 14th at 3 p.m.\n\nHere Mr. John Stillborne buried one of his twins who had died on the way. On these six days trip I never knew or found such uncultivated and uncivilled conductors in all my life.\n\nI asked one a question as to the journey being so slow and he replied \"to hell with you and your questions\". Another said to me \"be damned to your Question's you will get there some time this year\".\n\nWe left Brandon on Thursday night at 8 p.m. May 18th. After travelling about four miles we rested. Here Mr. R.J. Fleming who had been with us thus far, bade us goodbye, and went back, but most of our hearts were almost too full to return the compliment.\n\nFriday May 18th. After travelling about four miles we went through 7 awful sloughs, travelling only 3 miles in ten hours.\n\nMay 20th, we only travelled 2½ miles, it was a terrible cold night with frost, had to cross six sloughs, had to use 10 yoke of oxen to a waggon. William Hartwell's wagon was stuck so we had to unload.\n\nSunday May 21st. We rested and had a good prayer meeting, Bless the Lord; He was with us and blessed us all; There was a good attendance at the Prayer Meeting and we all had a glorious time.\nA Copy of Mr. Allen's Diary during Journey from Toronto to Pleasant Forks Bank - April 15th to June 12th 1862.\n\nWe left Union Station Toronto via Grand Trunk Railway on Wednesday morning April 19th 1862 at 8:15 a.m., arriving at St Paul on Saturday night at 11:30 p.m. April 22nd, at which place we stayed two days on account of a flood, much of the officials were away visiting relatives or sick in bed.\n\nWe started from St Paul on Monday night May 6th at 11 p.m., arriving at Brandon on Sunday May 14th at 3 p.m.\n\nHere Mr. John Stillborne buried one of his twins who had died on the way.\n\nOn the six day's trip I never knew or heard much cultivated and uneducated conductors in all my life.\n\nI asked one question as to the journey being so slow and so regulated.\n\n\"Will you go to hell with you and your questions?\" Another asked me \"Are damned to your question?\"\n\n\"I will not get there some time this year.\"\n\nNo left Brandon on Thursday night at 6 p.m. May 18th. After travelling about four miles we rested. Here Mr. J. Fleming who had been with us three days, said he was going back, but most of our hearts were almost too full to return like company.\n\nFriday May 18th. After travelling about four miles we went through 7 difficult bluffs, travelling only 6 miles in ten hours.\n\nMay 20th, we only travelled 22 miles, it was a terrible cold night with frost, had to cross six sloughs, had to use 10 yoke of oxen to a waggon. William Hartwell's wagon was stuck so we had to unload.\n\nSunday May 21st. We rested and had a good prayer meeting. Bless the Lord! He was with us and blessed us all; There was a good attendance at the Prayer Meeting and we all had a glorious time.\nThe meeting was held in Ward Bros Tent.\n\nMonday May 23rd. We travelled 18 miles & went through 5 large sloughs.\n\nTuesday. WE travelled 14 miles & went through 7 large sloughs. One must have been a mile long.\n\nWed May 24th. We travelled 9 miles & went through 8 sloughs & on to Flatt Creek. We came through a terrible district of Sand Hills.\n\nArrived at 3 p.m. The oxen were terribly player out. Here we had to lighten our loads & left the things with a man in a tent.\n\nThursday May 25th. Travelled 18 miles. Passed through 5 large sloughs & went through 4 water courses. At Gopher Creek it was 4 ft deep, the weather has been fine for the last 5 days. Worked 18 hrs this day.\n\nFriday May 26th. Traveled 18 or 19 miles. Went through 3 very large sloughs, in the morning of this day we crossed a river, in the evening had terrible drawing for 3 miles to the camp, we worked this day 15 hrs.\n\nSaturday May 27th. Rested this day as Ward Bros had an ox sick.\n\nSunday May 28th. Rested. W.D. Fitzpatrick preached us a good sermon, his subject being \"The grace of our Lord Jesus Christ.\" All felt well.\n\nThank God:\n\nMonday May 29th. Thavled 15 miles, crossed 6 rivers or some of them were very wide creeks, 10 alkali beds, 15 sloughs, a very heavy day, 15 hrs.\n\nTues May 30th. Travelled 14 miles, crossed 6 creeks, went through eight sloughs, & miles of heavy drawing, worked 15 hours to day.\n\nWed May 31st. Crossed 4 rivers, some of them very wide, one of them must have been more than 30 yds, as H Q Stillborn's rope & mine were each 6 ft & it took 10 logging chains to reach across, we just got out of the river when starting up Mr John Stillborn's Goat got run over. How it was the poor thing wasn't killed was a mystery to all, but she got over it.\n\nWe went through 12 sloughs to day & travelled 15 miles & worked 17 hrs.\nThe meeting was held in Ward Bros Tent.\n\nMonday May 23rd. We travelled 18 miles & went through 5 large sloughs. One must have been a mile long.\n\nTuesday. We travelled 14 miles & went through 7 large sloughs. We came through a terrible district of Sand Hills.\n\nWednesday May 24th. We travelled 9 miles & went through 8 sloughs & on to Platt Creek. We came through a terrible district of Sand Hills. Here we had to lighten our loads & left the things with a man in a tent.\n\nThursday May 25th. Travelled 16 miles. Passed through 5 large sloughs & went through 4 water courses. At Gopher Creek it was 4 ft deep, the weather has been fine for the last 5 days. Worked 18 hrs this day.\n\nFriday May 26th. Traveled 18 or 19 miles. Went through 5 very large sloughs, in the morning of this day we crossed a river. In the evening had terrible drawing for 3 miles to the camp, we worked this day 15 hrs.\n\nSaturday May 27th. Rested this day as Ward Bros had an ox sick.\n\nSunday May 28th. Rested. W.D. Fitzpatrick preached us a good sermon, his subject being \"The grace of our Lord Jesus Christ.\" All felt well.\n\nThank God: Monday May 29th. Travelled 15 miles, crossed 6 rivers or some of them were very wide creeks, 10 alkali beds, 15 sloughs, a very heavy day, 15 hrs.\n\nTuesday May 30th. Traveled 14 miles, crossed 6 creeks, went through eight sloughs, & miles of heavy drawing, worked 15 hours today.\n\nWednesday May 31st. Crossed 4 rivers, some of them very wide, one of them gust have been more than 30 yds, ash Q Stillborn's rope & mine were each 6 ft & it took 10 logging chains to reach across, we just got out of the river when starting up Mr John Stillborn's boat got run over, how it was the poor thing wasn't killed we & ministry to all, but she got over it.\n\nWe went through 13 sloughs to day & travelled 15 miles & worked 17 hrs.\nThurs June 1st\nWent through 7 most terrible streams today, it took us up to our waist in water for an hour. I stood on one side of the water course & Jack McKee on the other side handling the oxen in the stream. Out here young Johnnie Webster thought he would face the stream with H Q Stillborn's yoke of oxen, but unknown to him the side went straight down, the oxen plunged in & Johnny flew over their heads, & called for help, Jack McKee laughed at him & said \"hold on to the oxen Johnny\", but Johnny replied \"can't you see I'm off & in the water?\" Only travelled 10 miles & worked 15 hrs.\n\nFriday June 2nd\nCrossed 4 heavy streams, 16 sloughs, five miles awful heavy drawing, went through great flats knee deep with water, it must have been near two miles through it. We traveled 11 miles today, and worked 12 hours.\n\nSaturday June 3rd\nWe went through one mile of alkali bed and 4 sloughs, it was heavy drawing all the way, we crossed one large river in which 4 wagons stuck and had to be unloaded. Travelled only 3½ miles & worked 15 hours.\n\nSunday June 4th\nTo day we rested, Mr Thos Todd preached a good sermon at night, & a splendid feeling we all had, Thank God for it!\n\nMonday June 5th\nWent through 20 sloughs & 4 streams, drawing was very heavy all the way, travelled 14 miles & worked 15 hours.\n\nTuesday June 6th\nWent through 18 sloughs & crossed 6 streams, heavy drawing all the way. Here H Q Stillborn lost his dog, travelled 10 miles and worked 14 hours.\n\nWednesday June 7th\nCrossed 5 rivers & 9 sloughs, travelled 18 miles & worked 16 hours.\n\nThursday June 8th\nWent through 4 large streams & 4 sloughs, went down a tremendous ravine 1½ miles long into the Qu'Appelle Valley.\n\nAt the top of this hill Mr William Stillborn driving one of his brothers\nThursday June 1st\nWent through 7 most terrible streams today. It took us up to our waists in water for an hour. I stood on one side of the water course & Jack stood on the other side handling the oxen in the stream. Out here young Johnnie Webster thought he would face the stream with his stillborn's yoke of oxen, but unknown to him the side went straight down, the oxen plunged in & Johnny flew over their heads & called for help. Jack Mckean laughed at him & said \"hold on to the oxen Johnny\" but Johnny replied \"can't you see I am off & in the water?\" Only travelled 10 miles & worked 15 hours.\n\nFriday June 2nd\nCrossed 4 heavy streams, 18 sloughs, five million acre feet heavy drawing, went through great flats, knee deep with water, it must have been near two miles through it. We traveled 11 miles today & worked 12 hours.\n\nSaturday June 3rd\nWent through one mile of alkali bed and 4 sloughs. It was heavy drawing all the way. We crossed one large river in which 1 wagon stuck and had to be unloaded. Travelled only 3½ miles & worked 15 hours.\n\nSunday June 4th\nTo day we rested, Mr. Thos. Toll preached a good sermon at night, & a splendid feeling we all had, Thank God for it!\n\nMonday June 5th\nWent through 20 sloughs & 4 streams, drawing was very heavy all the way, traveled 14 miles & worked 15 hours.\n\nTuesday June 6th\nWent through 18 sloughs & crossed 6 streams, heavy drawing all the way. Here H Q stillborn lost his dog. traveled 10 miles & worked 14 hours.\n\nWednesday June 7th\nCrossed 5 rivers & 9 sloughs, traveled 18 miles & worked 16 hours.\n\nThursday June 8th\nWent through 4 large streams & 4 sloughs, went down a tremendous ravine 1½ miles long into the Qu'Appelle Valley. At the top of the hill Mr. William Stillborn driving one of his brot...\nwagons went over the hill, wagon oxen and all, breaking his brother's house stove. At the time I was lame with a bad knee, so I asked Jedgwick and Walter Willis to carry me to look at the hill, when I seen it I said that will do take me back to the waggon and drive my waggon to the hill, and then lock my off hind wheel. Mr Stillborn at once cried out \"Mr Allen you are locking the wrong wheel\", I replied \"I replied No.No. always lock on the side to the hill\" or you will be drawn down the hill. I drove myself down and I was the first down. When his time came for going down the hill he persisted in locking his nigh wheel with the result named, the others followed my example and locked the off wheel and all came down all right. At the bottom of this hill was a muskeg into which one of Mr Webster's oxen ran for water and got mired, & would have been killed, but he got my oxen & pulled him out. We travelled 16 this day in 15 hours.\n\nFriday June 9th. Travelled only 4 miles & got across the Qu'Appelle River,. It took us just 10 hours to cross that river, we worked that day just 14 hours.\n\nSaturday June 10th This was a good but terribly hot, we went through 4 small sloughs & travelled 14 miles in 12 hours.\n\nSunday June 11th. We rested today by a large lake at which Mr C. Robison from Cumberland, England the man with a mule and a ox for a team, preached to us a good encouraging sermon.\n\nMonday June 12th We set out at 2.40 a.m. a tremendous draw all day with 9 or 10 sloughs to go through,. WE arrived in camp at top of hill at Pheasant Forks at 6 p.m. in township 21 sec#14, We travelled the distance in 15 hours & 20 minutes, At dinner my knee burst, which had been bad for 9 days,. My fellow travelers like good brothers came to my aid, doing all my heavy work, for all of which I am deeply grateful.\nwagon went over the hill, wagon oxen and all, breaking his brother's house stove. At the time I was lame with a bad knee, so I asked Mr. Gedwick and Walter Willing to carry me to look at the hill, when I seen it I said that will do take me back to the waggon and drive my waggon to the hill, and then lock my off hind wheel. Mr. Stillborn at once cried out \"Mr. Allen you are locking the wrong wheel.\" I replied \"No, No, always look on the side to the hill\" or you will be drawn down the hill. I drove myself down and I was the first down.\n\nWhen his time came for going down the hill he persitated in looking his nigh wheel with the result named, the others followed my example and locked the off wheel and all came down all right. At the bottom of this hill was a muskeg into which one of Mr. Webster's oxen ran for water. And got mired, & would have been killed, but he got my oxen & pulled him out. We travelled 16 this day in 15 hours.\n\nFriday June 6th. Travelled only 4 miles & got across the Qu'Appelle River. It took us just 10 hours to cross that river, we worked that day just 14 hours.\n\nSaturday June 10th. This was a good day. 4 small sloughs & travelled 14 miles in 12 hours.\n\nSunday June 11th. We rested to day by a large lake at which Mr. G. Robison from Cumberland, England the man with a mule and a ox for a team, preached to us a good encouraging sermon.\n\nMonday June 12th. We set out at 8.40 a.m., a tremendous draw all day with 9 or 10 sloughs to go through, we arrived in camp at top of hill at Pheasant Forks at 6 p.m. in township 21 sec. 14, distance in 15 hours & 20 minutes, at dinner my knee burst, which had been bad for 9 days. My fellow travelers like good brothers came to my aid, doing all my heavy work, for all of which I am deeply grateful.\nand cannot possibly forget it.\n\nTuesday June 13th. I spent 8 hours looking over land with view of choosing homestead and fixed on section 30 township 21.\n\nWednesday June 14th. Spent 8 hours again for purpose of inspection and still like sect 30 better than any I have seen.\n\nThursday June 15th. Settled to have Section 30 N.E. Quarter.\n\nI should state here that nearly all if not all the tongues of our wagons were broken, & almost every logging chain.\n\nFriday & Saturday June 16-17th we rested & we all were in need of it.\n\nSunday June 18th. I preached in the morning, had a most attentive large company & a most precious time for which I do thank God.\n\nOur text was: \"I have given you an example. Christ therefore was our example.\n\nMonday June 19th. We moved from the Forks to our respective homesteads.\n\nTuesday June 20th. Began plowing.\n\nWednesday June 21st. Sowed 2 bush of oats. ½ bush peas & 8 bushel of potatoes, all of which came up first class.\n\nI sowed the oats & peas on the grass & broke them in, they came through the sod on July 4th, just 11 days after sowing.\nTuesday June 13th. I spent 8 hours looking over land with view of choosing homestead and fixed on section 30 township 21.\n\nWednesday June 14th. Spent 8 hours again for purpose of inspection and still like sect 30 better than any I have seen.\n\nThursday June 15th. Settled to have Section 30 N.E. Quarter.\n\nI should state here that nearly all if not all the tongues of our wagons were broken, & almost every logging chain.\n\nFriday & Saturday June 16-17th we rested & we all were in need of it.\n\nSunday June 18th. I preached in the morning, had a most attentive large company & a most precious time for which I do thank God.\n\nOur text was: \"I have given you an example. Christ, therefore, was our example.\"\n\nMonday June 19th. We moved from the Forks to our respective homesteads.\n\nTuesday June 20th. Began plowing.\n\nWednesday June 21st. Sowed 3/4 bush of oats, 1/2 bush peas & 8 bushel of potatoes; all of which came up first class.\n\nI sowed the oats & peas on the grass & broke them in, they came through the sod on July 4th, just 11 days after sowing.\nNote to his friends Mr. and Mrs. Jno Stillborn.\n\n\"Now my dear friends I think I have given you a fair statement of all we went through. There may be few little things I did not see, so you must take the statement as in the main correct, as far as my observations.\n\nGod grant we may never have another journey like it. With kind christian love to you all, not forgetting the dear young men. Oh; how I did enjoy myself with them & you all, I do trust that they each will become burning & shining lights for our Dear Savior.\n\nJust tell them that I shall not forget them at family prayer.\n\nI have not been so well these last few days, the ride shook my poor back but I trust in our Heavenly Father, I know he will not leave His poor old servant. If I can I will send Dear Hector a few words that will help him with his paper.\n\nI hope you can make this out, for my hand begins to tremble so that I can't do as I would, but am thankfull I can do as well as I do.\n\nMrs Allen wishes to be remembered to Mrs Stillborn and you all.\n\nwe are yours\n\nIn Jesus Christ\n\nJ.& S.A. Allen.\nNote to his friends Mr. and Mrs. Jno Stillborn.\n\n\"Now my dear friends I think I have given you a fair statement of all we went through. There may be few little things I did not see, so you must take the statement as in the main correct, as far as my observations.\n\nGod grant we may never have another journey like it. With kind christian love to you all, not forgetting the dear young men. Oh! how I did enjoy myself with them & you all, I do trust that they each will become burning & shining lights for our Dear Savior.\n\nJust tell them that I shall not forget them at family prayer.\n\nI have not been so well these last few days, the ride shook my poor back but I trust in our Heavenly Father I know he will not leave His poor old servant. If I can I will send Dear Hector a few words that will help him with his paper.\n\nI hope you can make this out, for my hand begins to tremble so that I can't do as I would, but am thankful I can do as well as I do.\n\nMrs Allen wishes to be remembered to Mrs Stillborn and you all.\n\nwe are yours\n\nIn Jesus Christ\n\nJ.& S.A. Allen.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... J.A.S. A.R.T.H.U.R. S.M.I.T.H. ...\n2. Your address ....... 2551 Edgar St. ...........\n3. Date ................ May 17th 1952 Regina.\n4. Where were you born? (Give name of place and country)\n   Kingston, Ontario\n5. What was your father's name and occupation?\n   James Smith, minister Methodist\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Toronto, 1849-1852\n   Greenold, from 1893 to 1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was 14 years old came on Harvest Excursion 1888\n9. What were your reasons for coming West?\n   To get work, and a start on farm\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Information obtained from company who obtained land from government the Primitive Methodist Colonization Company located at Pleasant Lakes\n1. Your full name: JAS. ARTHUR SMITH\n\n2. Your address: 2551 Edgar St., Regina\n\n3. Date: 20th April, 1932\n\n4. Where were you born? (Give place of birth)\n   - James Smith, Regina\n\n5. What was your father's name and occupation?\n   - James Smith, bricklayer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   - April 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Prince Albert, 1879-1892\n   - Qu'Appelle, 1893-1902\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child\")\n   - I was 19 years old\n\n9. What were your reasons for coming West?\n   - To get work, and a start on farm\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n    - Information obtained from Railroad or Government Information.\n\n    - Land from government\n    - Land from pioneer friends\n    - The Dominion Government\n    - Information company\n    - Located at Pleasantville\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   A good move for your own\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   came by myself\n\n13. What means of transportation did you use?\n   G.T.R. train to\n   Wabosley to Pheasant Forks\n   by stage 45 miles\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Pheasant Forks\n\n16. Where did you settle or take up land?\n   Pheasant Forks S25 T21 R9 W4 1/2\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Regina\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Attended school\n   Trade painter & Paper Hanger\n   Farming since 1892\n   Retired 1940\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nA good move for young man\n\n12. Did you travel with a party (family, friends or others)?\n\nYes\n\n13. What means of transportation did you use?\n\nG.P.R. train to Brandon, Manitoba\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBrandon, Manitoba\n\n16. Where did you settle or take up land?\n\nBrandon, Manitoba\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWinnipeg\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAttended school at Brandon, Manitoba\n\nLived in Brandon since 1912\n19. How often did you write to relatives or friends in your old home?\n\nonce a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n28 October 1897\nEthel Jackson\nGraveland, Manitoba\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n1915\nMrs Rose Jamison\nLumber Lake\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn 1900 year a settlement took place many railroads were being built, villages built, school districts formed and population increased. Province of Saskatchewan was formed year 1905.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDid not travel much in early years visited friends used the horse and buggy.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nwrite a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n1897 Edward Jackson\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your mind? On April 1st, 1905, I came to Saskatchewan.\n\nIn 1900 year a schoolhouse was built. School district formed and population of the settlement was farmed Year 1905\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDid not travel except visited friends in early days and after\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make? Bought car in June 12th, 1911 make Ford.\n\n27. Where was your trading center? How far from your home? Lemberg 17 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). C.R.R. built from Melville to Regina 1907 trading centre Deff bar and truck means of travel now\n\n29. How often did you shop in the early days? once in two weeks\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? Line built 1909 Lemberg Central Phone Co. Rural\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Came west to make home and remain in Saskatchewan.\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make? Chevrolet\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\none or two weeks\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\ncame west to make home and remain in place\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nmore people moving in\nyoung people starting\nhomes getting material\n\n35. Did many people move away during the 1930's? Did many return?\n\nvery few moved away\nstayed on their farm\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nmember Duff & District 1905 - 1907\nmember Duff Grain Growers association\nmember M. L. A. Pleasant Hills 1917-1929\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nBought Ford car June 1911.\nBought cream separator 1903.\nBought East Gas Tractor 1910\nBought combine 1929\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n5.\n\n34. Did any people move away from your district prior to 1924? If so, please list their names.\n\nYoung people mostly moved away\nHomosque pretty much\n\n35. Did many people move away during the 1925-26? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here. If not, explain why this interview is possible.\n\nGrandson John S. Smith - 1905-1907\nGrandson David Green - 1908-1911\nGrandson Harold Green - 1912-1915\nGrandson H. L. Green - 1916-1920\n\n37. If you or any of your family or friends were interested in having or doing something in the district at that time, list here including dates whenever possible. (Such as organizing the First Church, etc.)\n\nBorough Council for June 1911\nBorough Council Session for 1908\nBorough Council Session for 1910\nBorough Council Session for 1929\nBorough Council for 1916\nBorough Council for 1920\n\n38. How did the places in your community get their names? (School districts, Post Office, Villages, railroad stations, creeks, hills, etc.) Try to give: (1) name and origin of place; (2) date of incorporation; (3) date of change in name; (4) reason for change; (5) data or to support change; (6) name(s) of new name above; (7) reason for change.\n\nGive details of new name(s) above.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJackson Smith, Son, Carrot River\nCarroll Smith, Grand-Daughter, C. River\nJames Smith, Grand-Son\nRobert Smith, Grand-Son\nSusan Smith, Grand-Daughter\n\n41. What do you think are the most important changes in your community since you first came West?\n\nchange from horse power threshing machine 1885-1900\nchange from horse power machine to steam 1890\nchange from steam to gas electric 1910\nchange from binder and stocky to combine 1928.\n\nJas. Arthur Smith\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_______________________\n_______________________\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(include your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_630.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 10257, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1686, 5], [1686, 3469, 6], [3469, 5157, 7], [5157, 6832, 8], [6832, 8651, 9], [8651, 10480, 10], [10480, 12243, 11], [12243, 14007, 12], [14007, 15824, 13], [15824, 17598, 14], [17598, 18674, 15], [18674, 19725, 16], [19725, 20795, 17], [20795, 21863, 18], [21863, 23283, 19], [23283, 24344, 20], [24344, 25278, 21], [25278, 26103, 22], [26103, 27135, 23], [27135, 28035, 24], [28035, 29295, 25], [29295, 30134, 26], [30134, 31425, 27], [31425, 32726, 28], [32726, 34155, 29], [34155, 35097, 30], [35097, 35097, 31], [35097, 35251, 32]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]