[{"id": "20fa3da7f8dde22ef87c666059d7f7d95e752f05", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nPioneer Recreation and Social Life.\n\n1. In the first five years, how many homes were near enough to you for visiting basis and family? Eight.\n\n2. How often did you usually visit neighbors? Twice a month.\n\n3. Did you usually visit on a Sunday, or other days? Yes, Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually without invitation.\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? Usually for dinner.\n\nWhat about meals? Did you stay when not invited beforehand? Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (Can't say) Was the term \"make pollock\" used, or was some other expression dropped in?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Tea and cake or bread.\n\n5. Did the whole family go, or did someone stay home to look after the place? All went out.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Not often.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nOne shriveling bee in 1916.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nCard parties and dances, but not seldom attended as we were not brought up that way.\n\nWere these more frequent in later years? Give dates. What about the times of the first and last which would win first on and off times.\n\nDid you follow any kind of informal schedule, such as going by number from one home to another at definite times, once a week, once a month, etc.?\n1. In the first few years how many homes were near enough to you for visiting? \n2. How many of these were bachelor's homes?\n3. Did you usually visit on a Sunday, or other days?\n4. Were you often invited to other homes, or did most visiting done without an invitation?\n5. What time of the day did you go? In the morning and spend the day, or in the afternoon, etc.?\n6. Did you stay when not invited beforehand?\n7. What about meals? Did you stay when not invited beforehand?\n8. How was the invitation to a meal worded when people had come unexpectedly?\n9. If no meal, what other refreshment might be offered to visitors who had dropped in?\n10. Did the whole family go, or did someone stay home to \"look after the place\"?\n11. Did you ever have \"these\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n12. Tell what you remember about such gatherings, giving dates if possible, telling what the \"reasons\" were for, and how often they occurred.\n\nOur story begins in 1916.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nCard parties and dances but not all of them attended as we were not brought up that way.\n\nWere these more frequent in later years? Give dates. Tell about the times of the first and what drove us just on and off town.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, etc.?\n8. Tell what use was made of the school house for community dances, box seats, and other activities. (Include also the school Christmas tree, potlucks, etc., if you have not described these on the school Christmas tree, potlucks, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What dances were popular in the early days?\n\nWas there card playing for a prize?\n\nWas there ever any disrepancy between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nIf was accepted by most everyone but me.\n\nI didn't want to have the spaniel sit before my children, but some of them play cards sometimes.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. Include also the school Christmas tree, pictures, etc.\n\nIf you have not described these on the school Christmas tree, please do so.\n\nDescribe for social and Christmas parties and other parties.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. What was your first community hall built? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? A club, local, or private group, or county hall?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of home or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings?)\n\nIt was used by all the people who attended church and school at the same time.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8), and how did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nIn the school house also neighbors came also\n\n11. What card games were popular in the early days?\n\nAll women attended us can't say\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nStk\n\nWas there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas there any difference between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nIt was accepted by most everyone but me.\n\nI didn't want to have the example set before my children, but some of them play cards now.\n3. What attempts at formality, or \"socializing,\" do you remember in small towns such as yours and its main village, calling names, matters treated ceremonially.\n\n13. Was the obituary known in your community? If so, describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not wholesome but that were popular at parties and give approximate dates when you can when these changes in visiting or social life became noticeable.\n\nSome of the people got lost on their way and circled a few times before it became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\nThey provided flowers for the dead, fuel for the sick and plenty of entertainment for all. Food supplies and treats for the children at various times helped the blind and the old ones, all who are in need.\n13. Was the shivaree known in your community? \n\nDescribe what you remember about shivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular in visiting or social life before the Reforms.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nThen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nThey provided flowers for the dead if sick and plenty of entertainment for all. They supplied and treated the children at various homes. Helped the blind.\n18. Name any other organizations that were in existence in your community before 1914, giving their name, when it was first organized, its activities, and the people who belonged (men, women, young people), whether it included all or only one relatively small area (for example, within a school district) or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire and handbooks connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\n21. What games did boys play in summer? (Baseball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer? (Skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\nDid you often have radio lantern shows? Give dates if possible. 1928\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nDomestic life\n\nOutdoor life\n18. Name any other organizations that were in existence in your community before 1914, giving the name, whether it was a club (boy's, women's, young people), whether it is still active today, and purpose only in one relatively small area (for example, within a school district) or was centered in the town or village and included the surrounding community. (There is space in the church questions to include organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? In the school house.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDentrite, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDad you often have magic lantern show? One Olive takes it possible, 1928\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer? (sand, marbles, fly kites, etc.)\n\nWhat games did girls play in summer? (skipping rope, play house, etc.)\n\nWhat games did children play in winter? (snowball fight, tag)\n\nWhat games did children play in fall? (fall court, tag)\n\nWhat games did children play in spring? (spring court, tag)\n22. What winter games were played outside - for example, skating, snowballing, sledging, etc.? \n\n23. What winter games were played indoors in winter? Card games such as \"Happy Families,\" \"Whist,\" or others; checkers, chess, or other card games.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. That arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \nWhat games were played indoors in winter - card games such as whist, pinochle, checkers, dominoes, old maid, pitch and other card games? \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children hunt or play with animals or birds? \nChildren had plenty of time for games but had to be careful not to disturb the animals.\n\n25. What year was the date of the first picnic that you attended in Saskatchewan? \nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district club, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. What were the arrangements made for smaller groups? \nFamilies and friends formed smaller groups.\n\n30. What arrangements were made for eating? \nThere was a general lunch, or did\n\n31. What did you have to eat and drink? \nTea, lemonade, pie, cake, etc.\n\n32. What time of the day did it start, and how long did it last? \nTill dark or six. And then we went dancing.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. What did the children wear? (e.g., uniforms, etc.)\n\n35. Describe any different kinds of pictures which you have seen in the early days, such as the large community picnic, school, or family affairs, activities, picnics, etc., held at various times.\n\n36. Describe the events which were popular in your community in the early years, telling who took part in them.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. How long did it continue?\n\n39. Name any other sports teams that were organized before 1910, giving dates of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n40. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n41. When was the first indoor rink built, and what was it used for?\n\nThis is an indoor rink built about 1951 and used for curling.\n33. Describe any features of this picnic which you remember as outstanding.\n\nall floats for the children were provided free\n\nOrange slices, candy, peanuts, and gum\n\na collection from the men paid for it.\n\nevery one went in willingly I think about so many\n\n34. Name any different kinds of places which you knew of in the early days?\n\nsuch as the large common or field, school or schoolhouse (usually called schoolhouse), plowlots, etc., when boys, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible,\n\ngive dates when changes became noticeable.\n\n36. Describe the sport or game which was most popular in your community in the early years.\n\ntelling who took part in the various games and sports (tennis, baseball, mostly young people).\n\n37. For what year was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1910\n\nHow long did it continue? 1915-1920\n\n38. Name any other sports teams that were organized before 1910, giving date of organization, if possible, and tell whether they played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nbaseball and hockey 1910\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nfirst played on lake rink built 1940\n\nThis is an indoor rink built about 1951 used for curling\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plant?\n   Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known\n    hockey hall of fame or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names you brought, if possible. If not, tell as nearly as you can how many\n    books you bought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years at the school gate\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n46. Did an annual \"sports day\" become established in your community? Yes\n\nDid it grow out of or replace the nature community plant? Yes\n\nWho was responsible for starting the first sports day? Mrs. Haywood Smith\n\nWhen was the sports day usually held? (which month or any special day such as May 24th or July 4th)\n\n47. Are there any from your community who have become members of well-known literary clubs? No\n\n48. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n49. To what extent did you exchange books with neighbors?\n\n50. Did you buy many books after you came west? Give details.\n\n51. What books were sent to you as gifts in early years?\n\n52. Have you ever had any \"travelling library\" books in your community or school?\n\n53. Was there a school library? Yes\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n54. Did parents ever use their children's school texts books as additional reading material? Yes\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? Then started 1933\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFamily Harold and Alisterford (Out) Star\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWe lost interest in our home today as we didn't like recognizing names mentioned. We take the free press guide.\n\nAnd to get the year's preview guide Over Country Guide.\n\nOn Chalmers' Chattawas & Home Journal\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you bought to the west with you do you still have?\n\nAll still have all the books we brought but the opening of the chimney fire (we ant it and forgot list).\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nOne we didn't seem to find time to read much\n52. Has there ever been a community library in your district or town? If so, when was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who held its librarian, and what arrangements were made for borrowing books.\n\n53. What newspapers or magazines did you subscribe to when you first came to this area?\n\nFamily Harold and Watford (Cont.) Stan\n\n54. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\nWe first included an own home library at our place, recognizing the importance of owning a guide. Our Country Guide used to get the year's growing guide. Our Country Guide used to get the year's growing guide.\n\nDid you ever obtain the free monthly Lady's Home Journal material?\n\nGive dates and tell how and where you got them.\n\n55. What books or papers that you brought to the west with you do you still have?\n\nAll still have all the books we brought but the opening of the chimney fire (we didn't find it) got lost.\n\n56. Did you find a lack of reading material or sources of information in your early days in this west a hardship? Explain.\n\nOne we didn't seem to find them. To need much\nMusical Entertainment\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nOrgan 1918 violin 1922 guitar 1930\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nI used to sing to my children a great deal.\n\n60. In the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nYes, a measure of singing at the dances.\n\n61. Was there a band in your community? Explain.\n\nYes, to come extend.\n\n62. Did you ever make up any of your own songs or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNo.\n\n63. Was there a band in your community? Yes.\n\nWho started it? The Smith boys.\n\nHow many were in it? About four.\n\nWhat instruments were included?\n\nDrums, violins, saxophones, banjo.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nOne uniform. I believe they practiced about once a week at their homes and they played just for local dances but not much lately.\nMusical Instrument\n\n56. What musical instruments did you bring with you?\n\n57. Did any of your neighbors have a collection?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nOregon 1918 - October 22, 1920\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nI used to sing to my children a great deal.\n\nIn the community? (were there musical concerts, parties, etc.) Describe.\n\nYes, a measure of singing at the church.\n\n60. What were some of the favorite songs in the house? (Ragged old Flag, God Bless America, etc.)\n\nSmile To Night, Old Black Joe, Swing Low, Sweet Chariot, Wedding Hymn, A Downward and Upward, The Church House Band.\n\nIn the community? Folk songs, When Father joined the choir, Thirdly, If I could, I would, I'd go out with my wife through the town, The old folk music, or music of the country you came from, probably your home or community? Explain.\n\n61. To come explain.\n\nDid you ever make up any of your own songs, or make up words to fit an old tune as a joke, an anniversary, or because of some special happening in the community? Explain.\n\n62. Was there a band in your community? Yes\n\nWho started it? The Smith Boys\n\nHow long did it continue? 10 years\n\nWhen was it started? 1930\n\n63. How many were in it? 142\n\nWhat instruments were included? Drums, Violin, Saxophone, Trumpet\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nOur uniforms were blue. They practiced about twice a week at their homes and they played just for local dances but not much lately.\n64. Has anyone from your community become well known or famous in the world? If so, give name and date and place of public appearance.\n\n65. Is there an important or famous person connected with the early days? What is the reason for this connection?\n\nHobbies and Special Interests:\n\n66. Do you have any collections, such as stamps, coins, paintings, signatures, arrowheads, etc.? If so, describe them briefly.\n\n67. Did you make notes of the weather, time of arrival of birds, flowering time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, roasting, making of pioneer days; not already mentioned.\n\nOne lady that used to win all ladies races also shuffling. Was unfortunate in having her home burnt down with two children in it. The district collected funds about 1910. That was to replace the home.\n64. Has anyone from your community been well known or famous in the past?\n\n65. Is there an important or famous building or place in your community now so connected with the early days? That is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Describe a few details of them.\n\nGive details of this collection, telling when you started it, how big it is, what it contains, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of ships, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nGENERAL\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, flowers, etc.; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nOne lady that used to own all Padda's property also died. Also unfortunate in having her home burnt down with two children in it. The district collected funds about 1910. The house was destroyed.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905A-E_2021.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7025, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1763, 7], [1763, 3262, 8], [3262, 4291, 9], [4291, 6431, 10], [6431, 8045, 11], [8045, 9255, 12], [9255, 10269, 13], [10269, 11675, 14], [11675, 12660, 15], [12660, 13879, 16], [13879, 14973, 17], [14973, 16386, 18], [16386, 17564, 19], [17564, 18549, 20], [18549, 19893, 21], [19893, 21191, 22], [21191, 22519, 23], [22519, 24254, 24], [24254, 25357, 25], [25357, 26611, 26], [26611, 26766, 27], [26766, 26920, 28]], "primary_language": ["None", "None", "None", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]