[{"id": "a23b0e5153201e036f27b65cac19f77de1430111", "text": "1. Your full name: Mrs. Lena Kernan Bacon\n\n2. Your address: 81 Canada, Girvin, Sask.\n\n3. Date June - 1944\n\n4. Where were you born? (Give name of place and country) Reutegen, Switzerland\n\n5. What was your father's name and occupation? Fredric C. Kernan, a farmer\n\n6. When did you come to Saskatchewan? (Give month and year) June 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. New County Nebraska\n\n8. How old were you when you first came to Western Canada? You do not need to answer this question, if you would rather not or you may say \"I was a small child.\"\n\n9. What were your reasons for coming West? To take a homestead and care for my child and myself financially.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMy father visited Western Canada, fell in love with the prospect of wheat farming. He brought a section of land one mile north of Girvin, Sask., and came home with an order for homestead land - thus said story regarding homestead land - 17 mi. S.W. of Girvin. He bought one section of land one mile N. of Girvin and it is still in the family.\n\nWe had read about Saskatchewan in the newspapers and wanted to see for ourselves.\nMRS. LENA KERNEN BACON\n\n1. Your full name: Lena Kernan Bacon\n2. Your address: Girvin, Sask.\n3. Date June - 1944\n4. Where were you born? Switzerland\n5. What was your father's name and occupation? Fredric T. Kernan, a farmer\n6. When did you come to Saskatchewan? June 1944\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. New County Nebraska\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age at that time)\n9. How did you learn about the weather? (through other people? Reading about it? Railroad or government information?)\n\nMy father divided Western Canada, fell in love with the province of wheat farms. He bought a section of land one mile north of Girvin, Sask., and came home with an intention of homesteading. Shortly after, he bought one section of land - 17 miles southwest of Girvin. We took up the family one mile north of Girvin and it was still in the family.\n\nWe had read about Saskatchewan in newspapers and went to see for ourselves in 1921.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey considered it a pipe-dream even my father didn't want me to go later or if my heart was fixed nothing could stop me.\n\n12. Did you travel by yourself or with a party (family, friends or other people)?\n\nI traveled alone with my five year old daughter.\n\n13. What means of transportation did you use?\n\nBy train\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nThis is also recorded in my manuscript in the hands of Mrs. E. Kerner.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith my two brothers Fred and Chas. Kernern at Girvin.\n\n16. Where did you settle or take up land? 17 mi. S.W. of Girvin, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nREGINA.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMining - This is also recorded in my manuscript.\n11. What did your friends and relatives think of your decision to come to Western Canada? They considered it a pipe-dream.\n\nEven my children didn't want me to go, but my heart was filled; nothing could stop me.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I traveled alone with my five year old daughter.\n\n13. What means of transportation did you use? By train.\n\n14. Most incidents of the journey. Best do you remember? (People you met on the way, meetings with Indians, attractions on the journey, accidents or other excitement.)\n\nThis ad appeared in my newspaper in the hands of Mrs. E. KERNEN, at GIRVIN.\n\n15. Where did you first stay when you arrived in Saskatchewan? With my two brothers Fred and Elmo KERNEN, at GIRVIN.\n\n16. Where did you settle or take up land? 17 mile. S.W. of GIRVIN, SASK.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nREGINA.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nNursing - This is also recorded in my former manuscript.\nI kept a daily record and until\nhome each week or two.\n\n20. If you got married, give the name of your husband or wife along with the date\nand place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place\nmy mother came to visit me, but had no\ndesire to remain.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\nwe'll write their names and where they settled.\n\nMy two brothers Fred and Chas. Norman lived at\nYakima, later moved to Skeetcheston. Mr. Fred and Mrs.\nNorman came from Yakima, Washington.\n\n23. Is there any particular experience of pioneer days that stands out in your\nmemory which you would like to record?\n\nThese experiences are also recorded in my\nmanuscript.\n\n24. Did you travel about much in the early years? (For business, attending church,\nvisiting friends, etc.) How often?\n\nI did not travel much, once to Indian Head\nthe Agriculture Experimental Station in the winter\nto Regina, to follow my nursing profession.\n\n#2. I conducted school at Paskatoon for my home\non the Homestead from 1905 to end of 1908\n\n#3. I had no way of travel on the Homestead But we walked,\nbut we could on every new corner in that\ncommunity on foot.\n\nIn all, and year later, with children, we had a School House.\nI kept a daily record and until\n\nmy death came to visit me, but had no desire to remain.\n\nMy two brothers Fred and Elmo Kernan lived at\n\nmy home when they moved to Saskatchewan. My\n\nbrother Fred moved to Idaho in 1924.\n\nIn these early pioneer days that stand out in your\n\nmemory, which you would like to record?\n\nThese experiences are also recorded in my\n\nhandwriting.\n\nI did not travel much, once to Indian Head\n\nfor the Agriculture Experimental Station and the winter\n\nto Regina to follow my nursing profession.\n\nI conducted school at Rosebud for my home\n\non the Homestead from 1915 to end of 1908.\n\nI had no way of travel on the Homestead but walked\n\nbut we called on every new comer in that\n\ncommunity on foot.\n\nIn all our years later, with writing, we had a school house.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house? GRAY, 17 mi. N.E.\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, Grayson was our trading place until we left in 1908.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy? In this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn 1915 I went to Canada for wallpaper and bought carpet to cover a homemade lounge, and lace to make collars for Christmas gifts.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI was forced to change my decision because of the severe winters and my daughter was already to enter school. During the summer taught all the children in the area at a tent. There were seven in all. One year later, with thirty-two, we had a schoolhouse.\n25. When was the first car used in the community? X\n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Where was your trading center? How far from your home? GRVIA, 17 mi. N.E.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, Grinnan trading\n\nPlace arrived at after 1908.\n\n29. How often did you shop in the early days? X\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? X\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn 1915 I went to Eaton's for wallpaper and Imperial Carpets to cover homemade drapes, and lace to make collars for Christmas gifts.\n\n32. When did you first have a telephone and what company provided it? X\n\n33. When you came to Saskatchewan the first time was it with the idea or staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, intended to make it my home.\n\nI was forced to change my daughter's school during the summer because of the winter school. During the summer we taught all the children in the area and a total of nine were sworn in all. One year later, with thirteen, we had a schoolhouse.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nYes, our family moved to Virginia in 1919.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMost all the farmers are still on their farms fifteen years and my home still stands.\n\nDuring the Great Depression, many families moved into the city.\n\n36. If so, some members of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSchool and Rockefellor. The first public community school was built by Rockefeller.\n\nThe School (Ellen) taught in that area but now resides living in Rockford and resides in the Chicago City in North America.\n\n37. If so, any of your family or friends were forced to have something in the district mission, or have given dates wherever possible, such as emigration, the first automobiles, or those originating to the first stage, etc.\n\nI was the first professional nurse in all three parts. In 1918 and cared for all the obstetrical cases without a doctor.\n\nOne case of pneumonia, brought Typhoid. The nearest man with a hospital over shoulder for a man with a disability over.\n\n38. How all the places in your county get their names? (State district, Post Office, villages, railway stations, creeks, hills, etc.)\n\n(1) Name of town (2) Name of town (3) Date of its origin (4) Key changes of name since then (5) Date and reason for change.\n\n(1) The Ellen District ward named before arrived in 1904 also the Rockville Valley and Sand Hills in that area.\nThe Ellen District was named before I arrived in 1944, also the Sandhill Valley and Sandhill Hills in that area.\n\nMost all the farmers will still be farming future years and my home state into Oklahoma.\n\nSchool and Bible School after Billy Sunday.\n\nCommunity church of 1919. Kobern taught the school (Ellen Riot) the still owns land in that area but now retired living in Arkansas and Florida in the choice city in North America.\n\nI was the first professional nurse in all that fourth in 1947-1948 and cared for all obstetrical cases without a doctor.\n\nOne earl of foremanship, the case of Taffybird should be for a man with a pleasing voice.\n\n(1) The Ellen District was named before I arrived in 1944, also the Sandhill Valley and Sandhill Hills in that area.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, old pamphlets, old photographs, personal recollections and reminiscences? (Describe.)\n\nI have the picture of the Eldon East School house, and my home school-house also my experiences during my four-year stay in Canada (from [illegible])\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Faculty of the University of British Columbia?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n- Bacon who was in Canada with me, she married, lives on a farm near Woodward, Okla.\n\nThey have 3 sons, 2 are in the service of their country. The youngest at 14 years old on the farm.\n\nThe eldest Mr. Bill Tom Elizabeth Bull and Grand Michael Bull.\n\n41. That do you think are the most important changes in your community since the first census was taken?\n\nChurches and schools, higher education, factories, combines, high dollar farming implements, autos, and a known how to take care of the chin when the severe cold and drought leaves you with arthritis.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n7th Form Lynch-Humboldt No. 8\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old photographs, old newspapers, old letters, old documents, old photos, old postcards, old newspapers, old reminiscences? (Describe)\n\nI have the pictures of the Eldon Post School hours, and my home little house also my afternoons during our four-year stay in Canada (I'm not sure if I wrote this).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (either way, please give their names, where they live and occupations.)\n\n40. If you have children or grandchildren, please give their names:\n\n- Bacon who was in Canada with me, she is married now on a farm near Woodward Creek.\n- They have 3 sons, 2 are in the service of their country. The youngest 4 years old on the farm.\n- Mr. & Mrs. John Eldon Roland (Michael) 1849.\n\n41. What do you think about the future of your family? (Please give your name and address)\n\nChurches and schools are important to the future of your family.\n\n42. Please give the names and addresses of other persons who could answer this questionnaire.\n\nMr. and Mrs. Jake Friggs Fugate & Leah.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here: X\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_742.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4244, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1278, 7], [1278, 2375, 8], [2375, 3437, 9], [3437, 4506, 10], [4506, 5789, 11], [5789, 6566, 12], [6566, 8010, 13], [8010, 9480, 14], [9480, 11051, 15], [11051, 11812, 16], [11812, 13367, 17], [13367, 14775, 18], [14775, 14930, 19], [14930, 15084, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]