[{"id": "19dae78809191d33aee936726e148484f5cc0738", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nTo be difficult to answer a general questionnaire to pioneer life because no individual was in a position to answer. It has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about having blank spaces. This sheet is intended to give you an idea or spark the particular answers, if any, you wish to answer.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945, and may be answered by anyone who has personal experience of the pioneer period whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nPioneer Questionnaire\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" Part 2d, Western Canadian Pioneer Days, is still being circulated. If you have not already done so, please fill out your questionnaire and return it to us.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nProtection of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of its permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: JOHN A MACMURCHY\n\n2. Your address: S.E.M.A.N.S.\n\n3. Date: JAN. 22, 1955\n\n4. Where were you born? (Give name of place and country)\n   Glen Ross, Ontario\n\n5. What was your father's name and occupation?\n   Donald MacMurphy, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   May, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Norman, Western Ontario April 1900 to May 1905\n   Eden, Manitoba Sept. 1902 to Aug. 1902\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was six years old when I came to Norman.\n\n9. What were your reasons for coming West?\n   Came with family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Mostly listening to other people, including my father who came to what is now Saskatchewan in 1904\n1. Your full name: John A. MacMurphy\n\n2. Your address: S.E.M.A.N.S.\n\n3. Date: Jan 22, 1955\n\n4. Where were you born? (State name or place and country)\n\n5. What was your father's name and occupation?\n\n6. How did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you were in my teens, etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMy father who came to what is now New Westminster in 1904.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With family\n\n13. What means of transportation did you use?\n   Railroad to Regina and Lumsden, then caravan to homestead\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   We had lots of rain that spring of 1905. We laid up a week at Craven. Then left for the north. One amusing incident happened when we were cooking dinner one day, consisting of wild duck and prairie chicken, and a number of the R.M.W.P. came down.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At a neighbor's shack until we built our own house\n\n16. Where did you settle or take up land?\n   My father homesteaded in 1904. I homesteaded in 1913\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Have been here ever since excepting three months in B.C.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Farming\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nRailroad to Regina and Brandon,\nthen caravon to homestead\n\n14. What accidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences)\n\nWe had lots rain that of any year\nwe lost up a house at Cheyenne\nleft for the month. But camping inclosed\nhelped when we were cooking dinner\noverday consisting of wild ducks and buffalo\nchicken, and a number of Mr. Mungo Pease\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy mother homesteaded in 1904 I homesteaded in 1913\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nThere were once specifying\nthree townships in BC\n\n18. How did you earn a living before coming to Western Canada? How about you now?\n\nFarming\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe came all together. Father, Mother, two brothers (who also homesteaded) and a sister.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot much. When we went anywhere it was by wagon or democrat.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nWe came all together. Father, mother, two mothers (who also homesteaded) and a sister.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to relate?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWhen we went anywhere, it was by wagon or democrat.\n25. When was the first car used in the community?\n   From first car used in 1908, a railroad contractor.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   It was a Ford.\n\n27. Where was your trading center? How far from your home?\n   First Cremona, then Strasbourg, finally Lumsden (in 1908).\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Yes.\n\n29. How often did you shop in the early days?\n   Maybe once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the pioneer period.\n   About 1905, and it was mostly clothing as near as I can recall.\n\n32. When did you first have a telephone and what company provided it?\n   About 1911, local co., The last money from telephone co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes.\n25. When was the first car used in the community?\n26. If you owned a car before 1914, when did you buy it? What make?\n27. Where was your trading center? How far from your home?\n28. Did you continue to trade there? (Indicate any changes due to new means appearing, better means of travel, etc.)\n29. How often did you shop in the early days?\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n31. When (if ever) did you first begin to buy through the mail order catalogues?\nWhat kind of articles did you buy in this way?\n32. When did you first have a telephone and what company provided it?\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nOctober 1911 a local co., MacMurchy, John A.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWrite a few. A number just came—\nstayed and then sold when they obtained title.\n\n35. Did many people move away during the 1930's? Did many return?\n\nWrite a few not many\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was chairman of the Trustee Board of the first school built here in 1908. He was first president of the L.M. Telephone Co. in 1911. He was a member of the Methodist Church and was instrumental in getting the first preacher stationed here in Sept. 1905. In summary he was Chairman of Board of Trustees for first church built in 1911.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool District named after Queen Alexandra\nAlexandra S.D. #1908\n5. Did any people move away from your district prior to 1904? What reasons did they have for leaving?\n\nWhile a few, a number went home.\n\n35. Did many people move away during the 1920s? Did many return?\n\nDidn't a few\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was chairman of the school board of the\n\n37. If you or any of your family or friends were \"frisky\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nIn the district mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (school district, post office, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above.\n\nSchool district named after Queen Alexandra\n\nAlexandra, IL #1905\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe only thing I know of is the minutes of the German S.D. #2425 which was started in 1909. I am secretary of this S.D. and have the old minutes book in my possession.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(Indicate your preference, if any) .......................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n__________________________\n\n41. What do you think are the most important changes in your community since you first came West?\n\n__________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n__________________________\n6.\n\n59. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, photographs, old newspapers, old books, old manuscripts? (Describe)\n\nThe only thing I know of is the manuscript of the diary of Mrs. B. and her husband which was started in 1909. I am secretary of the Historical Society of the Old Millers who lived in my hometown.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since your first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_857.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4593, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1978, 5], [1978, 3666, 6], [3666, 5043, 7], [5043, 5789, 8], [5789, 6958, 9], [6958, 8014, 10], [8014, 8835, 11], [8835, 9647, 12], [9647, 10933, 13], [10933, 11795, 14], [11795, 13268, 15], [13268, 14446, 16], [14446, 15763, 17], [15763, 16955, 18], [16955, 16955, 19], [16955, 17109, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]