[{"id": "2de81ee512cc2e8348bc65720ce8a250dbe68ca5", "text": "Mrs. Nickolay Reminiscences of a Pioneer\n\nJulia Elisabetha Daughter of Carl Johann Nickolay is comming at the age of 17 year old from then married in 1906 with Mr Paul Obreche still live on his homestead in rural Kansas.\n\nWe left our country of Hungary known as a little village near Budapest with a party of 110 emigrants or destination for western Canada partly all for Southern oler. Boyko was our agent.\n\nWe arrive at Bozeman the 27th of May 1903 father mother and 5 brother my sisters and I.\n\nUnder our interpreter read by two children a watchful blow a wagon with a box a few bushel of grain seed and garden seeds a few provisions for our way.\n\nThe next day we all set for our last step of our journey through the wilderness to go to our new home which was a homestead the 1/4 of section of 12 top 39 range 26 46 2 mile far of over the prairie on the S.E. some 40 mile away.\n\nWe arrive at dawn on the 1st of June 1903 at the new home yet with a morning\nTo Question No. 39 of Questionnaire No. 2 General\n\nMrs. Priskulsky Reminiscences of a Pioneer\n\nJulia Elisabetha Daughter of Leo Priskulsky is commencing at the age of 17 year old\n\nfrom then married in 1906 with Joseph Priskulsky\n\nstill live on his homestead in rural Tennessee\n\nWe left our country of Hungary between\n\na little village near Budapest with a party\n\nof 110 emigrants on destination for western\n\nCanada partly all for Brother-in-law Boyko\n\nwas our agent\n\nWe arrive at Bozeman the 27th of May\n\n1903 father mother and 5 brother my\n\nsisters and myself\n\nUnder our itinerary we travel by two\n\na chuck wagon with a box\n\na few bushels of grain seed and garden seeds\n\na few provisions for our way\n\nThe next day we all set for our\n\nlast stop of our journey through the wilderness\n\nto go to our new home which was a homestead the\n\nNorth section of 22 for 39 range 26 4 mile from\n\nover the prairie on the NE. some 40 mile away\n\nWe arrive at dawn on the 1st of June\n\n1903 at the new home first with a morning\nTo Questionnaire No. 2 General\n\nMrs. Miskolzy: Reminiscences of a pioneer\n\nJulia Miskolzy, daughter of late Mr. John Miskolzy, coming at the age of 17 year old from Hungary in 1906 with her parents.\n\nWe left our country of Hungary to live on the homestead in rural America.\n\nWe arrived near Budapest with a party of 110 emigrants or emigration for western Canada partly all for Southern Oler. Boyko was our agent.\n\nWe arrive at Boosilten the 27th of May 1903.\n\nFather, mother and 5 brother my sisters and I.\n\nUnder our instructions dad by two oxen a walking plow a wagon with a box a few brook of grain seed and garden seeds.\n\nA few provisions for our way.\n\nThe next day we all set for our last stop of our journey through the wilderness to go to our new home which was a homestead the 1/4 of sections of 29. Top 39 range 26 the 2nd for 40 mile away over the prairie on the S.P. some 40 mile away.\n\nWe arrive at dawn on the 1st of June.\n\n1903 at the new home spot with a growing\nMr. Miskolzi: Reminiscences of a pioneer\n\nJulia Miskolzi, daughter of late fellow Miskolzi, commencing at the age of 17 years old.\n\nOnce they immigrated in 1906 with my dad and me still living on his homestead in rural Illinois.\n\nWe left our country of Hungary, fleeing a little village near Budapest with a party of 110 emigrants or destination for western Canada partly all for Southern Ont., Boyelo two our agent.\n\nWe arrive at Bowden on the 27th of May.\n\n1903 Father, mother and 5 brother my sisters and I.\n\nUnder our instructions dear Bye two.\n\nCarry a walking plow a wagon with a box a few bundle of prairie seed and garden seeds.\n\nA few provisions for our way.\n\nThe next day we all set for our last stop of our journey through the wilderness to go to our new home which was a homestead the 1/4 of section of 29, top 39 range 26 dist 2 mile for $1 over the prairie on the SE. some 40 mile away.\n\nWe arrive at dawn on the 1st of June.\n\n1903 at the new home spot with a growing\nII\n\nThere was no house to enter at this sight\nseeing my younger brother got on crying\nand saying where is our home and where are\nwe going to stay overnight\nOur parent unblinking and looking at\nthe wagon box upstairs\nin saying This is our home for Tonight and so\non the wet ground we made our first\nSure wasn't a happy impression for a family\nof nine without shelter and $36 in dollar left\nof money on hand\nBut all enthusiastic of seeing in a new\ncountry of liberty and prosperity land the next\nmorning without delay Dad as being a farmer\nfrom home set on this new wrangling place\nand start breaking a strip of this wild prairie\nwith mother able to other and if we lift off\nthe crust and piled it off for buildings\nand then after replow the same plot to seed\nit up Because each of money we didn't have\na due to work the land\nFrom this seeding we had enough\ngrain for our flour and legume for raising\na fairly good winter\nII\n\nThere will be no house to enter at this night\nseeing my younger brother got on crying\nand saying where is our home and where are\nwe going to stay overnight\nOur parent unhitching and loading of\nthe wagon by ourselves\nin saying This is our home for Tonight and so\nunder on the wet ground we have our first\nfire wasn't a happy impression for a family\nof nine without shelter and $36 in dollar 45\nof money on hand\n\nBut all enthusiasm of being in a new\ncountry of liberty and foreign land the next\nmorning without delay Dad as being a farmer\nfrom home set on this new wilderness place\nand start breaking a stripe of this wild prairie\nand mother also brother and I we light off\nthe crust and piled it off for building\nand then after replow the same plot to seed\nit up Because lack of money we didn't have\na due to work the land\nFrom this seeding we had enough\nrain for our floor and resume for raising\na fairly good winter\nDuring the early summer we had the willitt and meeting of Mr. Kile Delagassy and Mercotte homes teem too which found me some work in a sawmill and planer and then my brother Frank in the winter work on the C.N.R. bridged at Borden and Gladstone. And from then on we all well manage to farm and earn our home and never got very to have pioneer this ground Janet Clewam country.\n\nJohn Mike\n\nHank\n\nSteve\n\nHarvey (signature)\nDuring the early summer we had the visit of Mr. Kole Deagasty and Mercotte homes too which found me some work in a sawmill and then my brother Frank in the water work on the C.N.R. bridged at Borden and also on the And from then on we all well manage to form and earn our home and never got very to have pioneer this grand habit.\n\nCleawan country\n\nJohn Mike\n\nFrank\n\nSteve\n\nHovey (signature)\nFormation de la paroisse en abrégé\n\nLa seule et unique préoccupation des découvreurs s'était de faire connaître la vrie spirituel au population environnante. Le clergé Pascal missionnaire évangélistes devait être incité à voyager et était de fournir des prêtres de doctrine pour surveiller ses ouailles. Il désigne un jeune monastère de l'île à la prêche et professeur de musique pour Mr Vallet J.B.C., Bourelle de la place de Mante de la nouvelle France. À cette tâche qu'il entreprit courageusement, loin des bienfaits de la paroisse de Lévis avec seulement quelques familles y compris les célèbres Batacay. Mr arrive le 22 août 1904 au soir.\n\nLe lendemain il dit sa première messe sur la section W.8. - 1 - Tapis 39 1/2 - W.2 une demie nuit de l'année, il couche à la belle étoile, car il ne savait ni ne voyait de réveil, c'était la pleine ouverture. Son seul guide c'était sa carte de \"système\" après sa meute clôt il vaute l'orizon et après une huit à l'isle au large sur un coteau si curieux c'était elle même elle-même qui lui donne les renseignements voulu\nLa seule et unique préoccupation des\npèlerins était de faire connaître la vie\nspirituelle au population environnante.\n\nLe curé Pascal, missionnaire évangélique,\navait été chargé de cette tâche de\nfournir des prêches de cloche pour surveiller\nses ouailles. Il désigna un jeune monastère\nment clérical à la prêche et professeur de musique\npour aller à l'école J.B.C. Brouet, de la place\nde l'Église de la nouvelle France. Cette tâche\nde maintien de la nouvelle France était\nqu'il entreprenne courageusement, loin des\ndifficultés. Il voulut comme loyale empruntant fondé\nla paroisse de Lévis avec seulement qu'une\nguinguette de familles y commerçait le soir.\n\nLe lendemain il dit sa première messe sur\nla section de l'Église / - trop 39 28 - N° 2 une\nguitare à pied de l'Église, il couche à la belle\nétoile, car il ne savait ni ne voyait de réuni-\nance c'était la plus ancienne ouverte.\n\nPuis il alla à la carte de \"l'apostolat\"\nguidé s'était sa meute clôté il aurait l'origine et\naprès sa meute clôté il aurait l'origine et\navant une huit à l'île au large sur un\ncoteau si curieux était alors étonné d'arriver\n\nqui lui donne les renseignements voulu\nAu début de son arrivée comme il était la seule pièce du territoire jusqu'au 1908 il desservait les familles de Nomadat et la voute de Stèle Bourrée. En effet, il rendait service au Ukrainien quand il était nécessaire. Il se liait avec enthousiasme au comité N.T. du district qui englobait aussi les familles hongroises arrivées depuis 1903. Les climatiques réclamaient le nommage liturgique par leurs chants accompagnés à ceux des canadiens et français colonisant jusque là ce qu'il construisit leur église en 1910.\nTITRE\n\nL'ÉTAT DE LA RÉGION DE L'ARRÊTÉ COMME IL ÉTAIT LE SEUL PIÈCE DU TERRITOIRE HONGROIS ET 1908 IL DÉSIGNAIT LES FAMILLES DE NOMADES ET EN LA COMMUNE DE BOURRIE.\n\nTous rencontraient le service au hongrois quand il était nécessaire de l'arrêter avec enthousiasme.\n\nAu cœur du district qui est aussi connu par les climatiques réelles des horizons hongrois et par leurs chants accompagnés à ceux des canadiens et français certains jusqu'à ce qu'il construire leur église en 1910.\nEnsuite une échelle pour de honnête\nqui il choisit le 18 de 1928-29 qui devint\nde demeure et celle des filles de la province\nqui viennent l'année suivante y fonder maison\nEst-elle leur premier couvent de bonne\nheure au printemps de 1905 avec l'aumône\ndes premiers colons alors MM Delagrange les familles\nmarcotte des Joseph Faillie\nPierre Blain et Jean Béry\nMamie Jean petit chapelle qui était\nla renforcée pour la célébration de la Sainte\nOffice jusqu'en 1907 lorsque les paroissiens\npar souscription volontaire bâtirent l'église paroissi-\nsiale par l'entremise de l'architecte Mr\nDrouot elle est encore la même bâtie\nmais remisée en 1929\nL'église était à compagnie de son\nnouveau élève Joseph Faillie\nmais. Ces États de demeure dans une petite\nchaumière construite sur la S.C du 2-9-28-4-1929\net ces États aussi qu'il célèbrait la messe pour\nla fin de 1904 et le commencement de 1905 aux\ncolonistes. En attendant une noble\nBéatrice Abélée Deyrie et que vouloir\nsacrifier de vie et ses biens à l'aide de\nla paroisse toute nouvelle et sans résistance\nIl\n\nEnsuite une échechée pour de honnêteté\nqui il choisit le 18 de 39-25-11 qui devient\nde demeure et celle des filles de la province\nqui viennent l'année suivante y fonder maison\nEt qu'ils leur premier couvent de bonne\nheure au printemps de 1905 avec l'aumône\ndes premiers colons alors de M. Delagrange les familles\nmarcotte de Mr Joseph Faillière\nPierre Blain et Jean Perrey\n\nMarianne dans cette chapelle qui était\nla renommée pour la célébration de Sainte\nOffice jusqu'au 1907 Louisiane les marionnettes\npar, souscription volontaire bâtirait il église paroissi-\nsiale par l'entraînement de l'architecte Mr\nGroux elle est encore la même bâtie\nmais remodelée en 1929\nElle était accompagnée de son\nnouveau clocher Faillière tout nouvellement\nélevé. Ces fois-ci demeure dans une petite\nchaumière construite sur le site du 2-9-28-11\net ces fois aussi qu'il célèbrait la messe pour\nla fin de 1904 et le commencement de 1905 aux\ncolons paroisiens. En attendant une église de\nDemocelle Faillière Delagrange construire de\nsacrifier de vie et des biens à l'aide de\nla paroisse tout nouvelle et demeure\nQuestion n° 28 du questionnaire général de 1918.\n\nComment nota place à une somme\n\nde 1902 à présent\n\nAvant la colonisation la région\n\nqui comprend à présent Alberten, Robidoux,\n\nAlvina, Carpentier, Gondre et Paul-Homar, était\n\nconnue sous le nom du lac des Buffles à Bruffe.\n\nParce que auprès de ce lac au cœur non loin\n\nil y a une protection précieuse d'air d'élément\n\nmatériel qui faisait éclater les promesses perpétuelles\n\nd'Alvin, et qui était une grande protection pour\n\nles animaux sauvages, là où il allait se réfugier.\n\nEt pendant les journées de forte température\n\net aussi s'il y a un de C minéral qu'il fallait\n\nC'était après avoir naturellement arrivé en\n\nfut ouvert à l'émigration ! Et que le premier colon\n\nde Plaisir Marquette accompagné de son frère Joseph\n\net Aimé, savantiste avec les engins qui\n\narpente la ligne du chemin de fer en 1901 et 1902\n\nafin d'y trouver un moyen de transport\n\npour l'été, après année suivante les contracteur y\n\npourrait la terrassement pour y passer l'hiver et y passer\n\nla nuit en 1905\nAvant la colonisation de la région qui correspond à maintenant Obetenim, Boképont, Aléna, Garantier, Gondia et Budé (nommé), c'était connu sous le nom du lac des Buffles à Baffo.\n\nParce que auquel de ce lac au cœur nous est matériel qui faisait état, les pionniers prenaient l'habitat et qui était une grande protection pour les animaux sauvage là où il allait se réfugier.\n\nEt aussi il y a un de minerais qui s'entraîne\n\nC'est-à-dire après avoir naturellement arrivé dans l'obstination 1900 de cette sauvage inconnue fut ouvert à l'immigration ! Et que le premier colon\n\net même, avant tout avec les engins qui aperçut la ligne du chemin de fer en 1901/1902 afin d'y nouer un moyen de transportation vers l'est ; et ils annulé suivant les contrats qui y passa\n\npour la terrassement pour y passer fini à y passer\n\nLa ville en 1905\nComme il faut un nom à cette nouvelle place,\ncelui de \"Gibbs\" a été donné comme \"très\" de la ville,\nmais au \"Joseph Marcotte\". La première famille\narrive en 1907 venant comme \"équation\" et même\ntemps qu'il est né avec son père Aimé\nde fournir les fourrages au privilège du\ncontracteur de la terrasse de la rivière \"Bourget\".\nLa rivière \"Gibbeshaven\" jusqu'à \"Bruno\".\nAlors voici qu'en 1905 le département\ns'aperçoit qu'il y avait une autre place du même\nnom de \"Italy\".\nUne réunion fut convoquée et la\nproposition avait été décidée en faveur de marcer\nville \"mais comme le 6 premiers et municipaux fari\nelle était Marcotte leur décision était que marco\nte a marcotte était la place \"long\nUn officier marcotte d'une intelligence\nvoyante alla à Minneaplys auprès de Mr. Howell\nd'interroger homme et affaire de temps. Là qu'il\nd'obtenir son nom pour être nouvelles place de\nConcordia y est sur son contentement, le nom de\nnotre place devient \"Marcotte\" qui reste même\nnulle à toute la en ancien et aussi le nom de son\nJeanson \"Vondam\" aujourd'hui Nouvelle\nPampa à 9 milles à l'est celui de la ville.\nComme il faut un nom à cette nouvelle place,\ncelui de ville a été donné comme tribut de la\nfille de l'ancien maréchal de la première famille\narrivée en 1907 venant comme \"agriculteur\" et sans\nmême temps qu'il entreprenne avec son frère Charles\nde fournir les fourrages au propriétaire du\ncontrat de la terrasse de la voie ferrée d'agriculture\nla rivière Valbelle, jusqu'à Bruxelles.\n\nAlors voici qu'en 1905 le département\nsigne pour qu'il y avait une autre place du même\nnom de Valby.\n\nUne réunion fut convoquée et la\nproposition avait été décidée en faveur de maréchale\nmais comme le 6ème et principal faucon\nville était blancotte leur décision était que maréchale\nà maréchale était trop long\net elle affaiblit maréchale d'une intelligence\npropre à aller à l'immigration, après de elle affaiblit\nd'attirer homme et affaire de temps. Là plein\nd'obtenir son nom pour le site nouvelle place de l'ouest\nConnaissant et sur son consentement, le nom de\nnotre place devient : Maréchale, qui reste même\nnoble à toute les en cien et aussi le nom de son\ngarçon Valby au fond de lui Nouvelle\nPana à gare à partir celui de sa famille\nEn 1923 vit que la localité était canadienne, avant même un non plus propre.\n\nAlors d'en en avoir discussion et précision, devenu on est encore celui de St-Hélène en mémoire de la noble bienfaîtrice renommée la veille France, depuis ces forces, et ses bien à la formation d'entreprises saines, et aujourd'hui prospère fraîche fut propose celui de Paul homme deuxième épique de Pierre-Étienne qui est devenue le non précédent.\n\nYves (Gilles Leray) non allégorique ouverture du premier colosse sur clématite\nEn 1923 vit que la localité était cana-\ndienne avant même un mon plus propre.\n\nAlors il est en avoir été mission et pression\npour nous en être mémoire celui de St-Hélène\nen mémoire de la noble bienfaîtrice renutile\nla vieille France, l'agriculture, et au bien à\nla formation d'entreprise saine, et aujourd'hui\nprospère fraîche fut moyenne celui de Paul\nhomme d'œuvre ou père de Pierre et elle qui\nest devenue le mon mément\n\n(Quelle heure) par allégorie extérieure ou même\ncolonie ou clairvoyance\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_709.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5872, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 959, 5], [959, 1968, 6], [1968, 2947, 7], [2947, 3929, 8], [3929, 4849, 9], [4849, 5770, 10], [5770, 6191, 11], [6191, 6582, 12], [6582, 7648, 13], [7648, 8796, 14], [8796, 9313, 15], [9313, 9793, 16], [9793, 10844, 17], [10844, 11939, 18], [11939, 12974, 19], [12974, 13805, 20], [13805, 14902, 21], [14902, 16024, 22], [16024, 16530, 23], [16530, 17026, 24], [17026, 17181, 25], [17181, 17336, 26]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]