[{"id": "dc44ae55e89bafb39d72f8c5144773fdb5661d78", "text": "Married in 1890.\n\n1. INTERESTING THINGS\n\nWhat year did you start homesteading in eastern Canada? 1879.\n\nWhere did you set up housekeeping? Churchbridge, Leonard District.\n\nThere had you been living before that? Churchbridge.\n\nFor how many people did you prepare food? Total, 4.\n\nHow far was it to your nearest store? Churchbridge.\n\nHow often could a visit be made to the store? Occasionally.\n\nWhat groceries did you usually buy in those earliest years? Sugar, flour, apples, salt, spices, raisins, currants occasionally.\n\nDavid Apple, Salt, Spices, Raisins, Currants occasionally.\n\n2. FLOUR AND OTHER FOOD PRODUCTS\n\nWhat brand of white flour did you use in the early years? Churchbridge.\n\nIn what quantities did you buy it? 50 lbs.\n\nThat was the usual price per hundred pounds of flour? $1.25.\n\nHow much did you use per month? 50 lbs.\n\nWas flour milled locally? Yes.\n\nThat was the price for a twenty pound bag of flour? $0.45.\n\nWhat other grain products did you use? Oats, cornmeal.\n\nOats? Yes.\n\nDid you grind your own wheat for porridge? Yes.\n\nHow did you grind it? By hand.\nMarried in 1890.\n\n1. TERRITORY. WHERE DID YOU COME FROM?\n\n   What year did you start homesteading? ________\n   Where did you set up housekeeping? ________\n   How far had you been living before that? ________\n   For how many years did you live there? ________\n   How far was it to your nearest store? ________\n   How often could a visit be made to the store? ________\n   What groceries did you usually buy in those early years? ________\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\n   What brand of flour did you use in the early years? ________\n   In what quantities did you buy it? ________\n   What was the usual price per hundred pounds of flour? ________\n   How much did you use each month? ________\n   Chose what flour? ________\n   Was flour milled locally? ________\n   What was the price for a twenty pound barrel of flour? ________\n   What other grain products did you use? ________\n   Cornmeal? ________\n   Other? ________\n   Did you grind your own wheat for porridge? ________\n   How did you grind it? ________\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? What was the price for a ten pound sack of old sugar? What brand of golden corn syrup did you use? What size of tin of syrup did you use? At what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Did you make butter? Did you keep eggs for hatching? Did you make cheese? What kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? How often did you get fresh meat? How did you preserve meat? Was there a \"beef ring\" in your neighborhood? If so what year was it organized? Did you use names? For how long? What part did fish play in the family diet? Was the fish fresh, cured, or canned?\n3. SUPPLIES AND SERVICES\n\nIn what quantity did you buy milk? (in ounces) _______.\n\nThat was the price for a ten pound sack of white sugar? _______.\n\nThat brand of golden corn syrup did you use? _______.\n\nThat size of tin of syrup did you use? _______.\n\nAt what price? _______.\n\n4. DAIRY PRODUCTS\n\nHow did you keep a supply of fresh milk in the early days? _______.\n\nDid you make butter? _______.\n\nDid you make cheese? _______.\n\n5. THAT OLD FARM\n\nWhat was your meat supply in the early years? _______.\n\nHow often did you get fresh meat? _______.\n\nWas there a \"beef ring\" in your neighborhood? _______.\n\nIf so what year was it organized? _______.\n\nDid you use rams? _______.\n\nFor how long? _______.\n\nThat part did fish play in the family diet? _______.\n\nWas the fish fresh, canned, or smoked? _______.\n\nKinds of fish? _______.\n3.\n\n5. B.S.Y. 240.65\n\nWhat kind of tea did you buy? (Tea or coffee) Price?\n\nPrice? 50.\n\nThat other beverage was made by?\n\nPrice? 150.\n\nThat other beverage was made by?\n\nPrice? 200.\n\n7. VEGETABLES\n\nWhat was the price of potatoes per bushel when you sat up housekeeping?\n\nPrice? 95.\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1885.\n\nCarrots 1885.\n\nTurnips 1885.\n\nIn what quantities did you buy dried navy beans?\n\nHow did you buy prunes, (in bulk or by the box)?\n\nThat year did you first prepare vegetables by canning?\n\nThat year did you first prepare vegetables by freezing?\n\nThat year did you first prepare vegetables by dehydrating?\n\nDo you still preserve food by canning or dehydrating?\n\nTo that extent?\n\nDid you make your own vinegar?\n\n8. PRESERVING\n\nIn the early years did you preserve any food by drying?\n\nPeas?\n\nBeans?\n\nOther foods?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve food by canning or dehydrating?\n\nTo that extent?\n\nDid you make your own vinegar?\n5. Buy-outs:\n   - What kind of tea did you buy? (Oleana or brown) (1 lb. $1.50)\n   - Price? $1.50\n   - That other brown tea was what? (Price $1.25)\n   - How much did you buy? (Price $1.25)\n\n6. Vegetables and Fruits:\n   - What was the price of potatoes per bushel when you set up homesteaders?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter of?\n   - Potatoes 1895\n   - Turnips 1895\n   - Cabbage 1895\n   - Carrots 1895\n   - Onions 1895\n\n7. In what quantities did you buy dried navy beans?\n   - How did you buy prunes, (in bulk or by the pound)?\n   - How did the grocer handle prunes (by box)?\n   - How did the grocer handle apples?\n   - What was the price of prunes? (Price $1.00)\n   - What other dried fruits did you use in the earliest days? (apples, peaches, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. Preserving:\n   - In the early years did you preserve any foods by drying?\n   - Beans? (Price $1.00)\n   - Other foods? (Price $1.00)\n   - That year did you first preserve fruit by canning? (Price $1.00)\n   - That year did you first preserve vegetables by canning? (Price $1.00)\n   - Do you still preserve foods by canning or drying? (Price $1.00)\n   - To what extent? (Price $1.00)\n   - Did you keep any vegetables? (Price $1.00)\n| Item                        | Year | Price |\n|-----------------------------|------|-------|\n| Soda biscuits               | 1889 | 1 lb. $0.25 |\n| Macaroni                    |      |       |\n| Graham flour                | 1890 | 9 lb. Bulk $0.10 |\n| Brown sugar                 |      |       |\n| Molasses                    |      |       |\n| Table salt                  |      |       |\n| Cream salt                  |      |       |\n| Lily white syrup            |      |       |\n| Toilet soap                 |      |       |\n| Baking powder               |      |       |\n| Extract vanilla             |      |       |\n| Dried peas                  |      |       |\n| Brine corn                  |      |       |\n| Vinegar                     |      |       |\n| Butter                       |      |       |\n| Rice                        | 1890 | 3 lb. Bulk $0.15 |\n| Currants                    | 1900 | 3 lb. Bulk $0.25 |\n| Store jam                   |      |       |\n| Choose (cheddar or store)    |      |       |\n| Vanilla                     |      |       |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast cakes mostly.\n\nDid you make yeast for your own use? Never used using starters. Always used.\n\nUsing hops? Yes, bought from local salt shaker. Baking soda used.\n\nDid you buy baking powder? Yes, bought from local salt shaker.\n\nCrushed turmeric? No, never used.\n\nDid you make your own baking powder? No, always bought.\n11. **FOOD**\n\n| Item                        | Approximate Price at the Time |\n|-----------------------------|------------------------------|\n| Canned salmon               | 25¢                           |\n| Other canned fish that are purchased early in the year | 5¢ per can                   |\n| Apples - fresh by barrel    | 1903                          |\n| Apples - dried              | 1903                          |\n| Lettuce                      |                               |\n| Tomatoes                    |                               |\n| Bananas                     |                               |\n| Lemons                      |                               |\n| Oranges                     |                               |\n| Cornflakes                  |                               |\n| Other prepared breakfast    |                               |\n| Breakfast cereals           |                               |\n| Cream                       |                               |\n| Porrl tapioca               | 1895                          |\n| Minuto tapioca              | 1895                          |\n| Sago                        |                               |\n| D. teas                     |                               |\n| Patinata                    |                               |\n| Icing sugar                 |                               |\n\n12. **WATER SUPPLY**\n\nThere did you get water for drinking and for cooking? (Well, river, cistern, dugout)\n\nHow far was this water from your house? (Pull, barrel, tank)\n\nHow was it brought to the house? (Pull, barrel, tank)\n\nHas any change been made since you first started homemaking?\n\nIn 1900 when we moved to churchland, we had a well.\n11. **MEAT, MILK, ETC., PRICES IN THE EARLY DAYS**\n\n| Item          | Price in 1910 | Price in 1915 |\n|---------------|---------------|---------------|\n| Beef          | $2.50         | $3.00         |\n| Pork          | $1.50         | $2.00         |\n| Lamb          | $3.00         | $4.00         |\n| Butter        | $0.50/lb      | $0.60/lb      |\n| Cheese        | $0.50/lb      | $0.60/lb      |\n| Eggs          | $0.10/dozen   | $0.12/dozen   |\n| Milk          | $0.10/gallon   | $0.12/gallon   |\n\n**Other Items**\n\n- Apples - Fresh by barrel 1903\n- Apples - Dried we could always get Dried Apples from 1890.\n- Tomatoes - Fresh before that I remember for years until about 1910.\n- Bananas - Sold in the stores probably about 1900 or later.\n- Lemons - Before my children knew what they looked like.\n\n**Other Prepared Foods**\n\n- Breakfast cereals - Five cents.\n- Corn Flakes - Eight cents.\n- Porrl tapioca 1895 - Bulk 2 lbs 25¢\n- Minuto tapioca - 25¢ a pkt.\n- Sago - 1915\n- Dates - 1915\n- Salt nuts - I did not use sugar, a luxury.\n\n**Water Supply**\n\nThere did you get water for drinking and for cooking? (Well, river, lake, etc.)\n\nIf so far was this water from your house? 400 yards.\n\nHow was it brought to the house? (Well, barrel, tank)\n\nDid you start housekeeping, living fairly well, before we had a well?\n\nOn 1900 when we moved to Church Bridge we had a well.\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kind of laundry soap did the grocer supply? Regular brown soap.\n\nAnd later bought by the case from J. L. Coe & Co., New York?\n\n14. FUEL\n\nThat fuel did you use in an earlier house? Hardwood.\n\nWhere did you get your fuel? From the hamlet.\n\nDid you ever change to another type of fuel? No.\n\nI used some kerosene since 1919, and since 1946 have used all coal for one stove. And fuel oil for an oil burner.\n\n15. HEATING AND COOKING APPLIANCES\n\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest days? (Give dates) Yes.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nWhen first married we used a small ordinary cook stove old as the hills almost.\n\nBy whom was your first cook stove purchased? Mrs. Smith.\n\nWhen was it purchased? 1870.\n\nWhat type of stove did you use? Tin, iron, wood, etc.\n\nFor preparing food? (chili, cornbread, etc.)\n\nEnough for serving dinner, enough for 20 hours.\n\nThen did you first use electric? 1889.\n\nAluminum? About 1905.\n13. Did you buy laundry soap made your own? Yes\n\nIf you reply no, why not? We\n\nWhat kind(s) of laundry soap did the grocer \"sell\" you? Regular, powdered, etc.\n\nAnd when bought by the case from? (Year)\n\n14. Fuel\n\nWhat fuel did you use in the last five years? (List)\n\nWhere did you get your fuel? (List)\n\nDid you make any changes in the use of fuels which have taken place since you first started housekeeping? (Give dates where possible)\n\nI used some kerosene since 1919, and since 1946 I have used all coal for one stove. And fuel oil for an oil burner.\n\n15. Methods of Cooking (Indoor or Outdoor)\n\nFor cooking, did you use an indoor fireplace or open hearth in the basement?\n\nDevice? (Give dates)\n\nDid you use an outdoor fireplace or back oven? (Give dates)\n\nWhen first moved in, we used a small ordinary cook stove old as the house itself.\n\nBy whom was your first cook stove purchased? (Name)\n\nWhen purchased? (Year)\n\nPrice? ($)\n\nFor preparing food? (Give dates)\n\nThen did you acquire? (Year)\n\nAluminum? About 1905.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family or family unit.\n\nBreakfast: Bowl of Fruition or Oatmeal with milk and sugar.\n\nDinner: A roast of Pork, Potatoes and turnips and a custard Pudding.\n\nWinter Year: Children awake at winter.\n\nSupper: Fried Potatoes, Bread & Butter and homemade jam.\n\nIn the children's families, there was a Christmas dinner in eastern Indiana.\n\nThe first years we always went to our parents for Christmas.\n\nAbout 1905 we had a Christmas dinner in Indiana.\n\n18. That year did you serve your Christmas dinner in eastern Indiana?\n\n19. How many children did you have? 2 boys and 3 girls.\n\n20. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nThere had been a time or two when we had precious little more than bread and potatoes.\n\nThat was in the 1890 Period 1893-1894 there was no way of making money, and we did not have any cows then and they did not lay in the winter, and we only had 2 cows and not much butter. Later we got some cows and a becama went up in Ashbridge and we shipped cream to rather a man collected the cream twice a week and took it to the creamery, we always had a little money after that.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the rain and list the members of the family then living.\n\nBreakfast—Bowl of Farina or Oatmeal with milk and sugar.\n\nBreakfast—Bread and Butter occasionally. If an egg, or bacon.\n\nTea—The children a cup of tea.\n\nDinner—a roast of Pork, Potatoes and Turnips and a custard pudding.\n\nWinter—Yea, children with or without.\n\nSupper—Boiled Potatoes, Bread & Butter and homemade jam.\n\nFor children sometimes Currants or molasses.\n\n1900—4 children 2 boys 8½ years, 2 boys 3 and 1.\n\n18. That year did you have your first Christmas dinner in Eastern Canada?\n\nThe first years we always went to our parents for Christmas.\n\nAt most half of them in 1905 or 6, before we had a house.\n\nAbout Goose, Turkey, Potatoes, carrots, turnips and a Christmas pudding.\n\n5 children 2 girls 13 and 11, 3 boys 8 and 6 and 4. And 2 young grown friends. Besides my husband and myself.\n\n19. Have you ever returned to almost starvation level living on one or two locally produced foods? Give details.\n\nThere had been a time or two when we had previous little more than bread and potatoes.\n\nThat was in the 1890 period 1893 to 1894 there was no way of making money, and we did not have any hens then and they did not lay in the winter, and we only had 2 cows and not much butter. Later we got some cows and a creamery went up in Blair Athol and we shipped cream to either a man collected the cream twice a week and took it to the creamery. We always had a little money after that.\nIn the early days the meals were very plain. Meat and vegetables primarily, a little pudding for dinner, no fancy cakes and pies, a dried apple pie was a treat and a plain cake a luxury.\n\nA custard pudding was quite common, as it only needed a little sugar to be bought.\n\nWhen did you begin to rely on purchased foods instead of home grown or home made?\n\nI have never relied on purchased foods.\n\nalways home grown and home made.\n\neven made my bread when living alone until 6 or 7 years ago, when buying one loaf at a time was better than buying 3 or 4 as there was too waste to save, buy and freeze.\n\ndried out before I could use them up.\n\nPlease add other details.\n\nfor groceries also for articles of clothing.\n\nSome undertaking to pay for 2 prs of shoes for two small children with eggs, 60c. Dog shoes $1.50 a pair but the shoes were better quality than we get today for $8.00 I used to put pieces on the soles of their shoes ourselves when their shoes were worn, my husband got the pieces of old worn shoes all through the year as article our husband was alive he did one of our favorite articles of diet was Bannock which my husband used to make with flour, Soda and Buttermilk, just put them hot them about each think then cut in medium pieces and bake them, used to make flap jacks from the same ingredients and mixed to a batter and fry them in a little butter and eat them with a little sugar, usually a little butter and eat them with either of these Bannocks or flapjacks.\nIn the early days the meals were very plain and meat and vegetables principally. We had pudding for dinner, no fancy cakes and pies, a dried apple pie was a treat, and a plain cake a luxury.\n\nA custard pudding was quite common, as it only needed a little sugar to be brought.\n\nWe used eggs and butter primarily for exchange for groceries also for articles of clothing.\n\nSome were taking to pay for 2 pairs of shoes for two small children with eggs for 25c. We paid $1.75 a pair but the shoes were better quality than we got from our neighbors. We used to put pieces on the soles of their shoes ourselves when their shoes were worn out. The husband got the pieces of old worn shoes all through the years while any household was above the line of poverty, articles of diet was Borden's which my husband used to make with flour, soda and salt, and sugar to make them taste good, and then bake them. We used to make jelly cakes from the same ingredients and mixed in a little sugar, usually a little butter and egg, and a little honey, with either apples, bananas or figs.\n\nWe made a full meal with either of these.\n\n---\n\n20. Notice any outstanding differences in the preparation of meals in the original home compared to today.\n\n---\n\n21. Would you begin to rely on purchased foods and prepared foods instead of home grown and homemade?\n\n---\n\n22. Please add other details.\nOn the early days the meals were very plain. Meat and vegetables principally, a little pudding for dinner, no fancy cakes and pies, a dried apple pie was a treat, and a plum cake a luxury.\n\nA custard pudding was quite common, as it only needed a little sugar to be bought.\n\nWhen did you begin to rely on purchased foods instead of home grown and home made?\n\nI have never relied on purchased foods always home grown and home made.\n\nEven made my bread when living alone until 6 or 7 years ago, when buying one loaf at a time was better than baking 3 or 4 as there was no waste to one loaf and you dried out before you could use them up.\n\nWe used eggs and butter principally for exchange for groceries also for articles of clothing.\n\nSome undertaking to pay for 2 or 3 of shoes for two small children with eggs. A Dozen $1.50 a pair but the shoes were better quality than we get now for $1.50 I used to put pieces on the soles of their shoes ourselves when their shoes wore out. Husband got the pieces of old women shoes he had worn, all through the years while my husband was alive.\n\nOne of our favorite articles of diet was Bannock which my husband used to make with flour, buttermilk and honey. We would use them almost like thick pancakes from the griddle and bake them. I used to make flapjacks from the same ingredients and mixed to a batter and fry them in some grease with a little sugar over a low fire a little butter and eat them with a little sugar over a low fire.\nOn the early days the meals were very plain. Meat and vegetables principally. A little pudding for dinner, no fancy cakes and pies, a dried apple pie was a treat, and a plum cake a luxury.\n\nA custard pudding was quite common, as it only needed a little sugar to be bought.\n\nWhen did you begin to rely on purchased foods instead of home grown and home made?\n\nI have never relied on purchased foods always home grown and home made even made my own bread when living alone until 6 or 7 years ago when buying one loaf at a time was better than buying 3 or 4 as there was no waste to save, long and 3 or 4 dried out before you could use them up.\n\nWe used eggs and butter primarily for exchange for groceries also for articles of clothing.\n\nSome misunderstanding took place for 2 prs. of shoes for two small children with eggs for a Dg. shoe $8.50 a pair but the shoes were better quality than we got them for $8.50 I used to put prices on the sides of their shoes myself when they showed wear worn, on the back and put the price of old worn shoes. But all through the age and while my husband was able to work one of our principal articles of diet was Bananas which my husband used to make with flour, Baked and browned in the oven then kept them about 1 week and then they were good for a long time. I used to make flap jacks from the bananas and bake them. I used to make banana bread from the same ingredients and my husband would say \"a little sugar, a little butter and a little of this, bananas or applesauce\" we would make a good meal with either of these.\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and local prepared foods? (Give as many details as possible).\n\nI have never relied on purchased foods.\n\nAlways home grown and home made.\n\nEven though my bread when living alone until 6 or 7 years ago when buying only at a time was better than buying 3 or 4 there was no waste to one loaf and 3 or 4 dried out before you'd use them up.\n\n22. Please add other details from your early experiences of buying groceries and eating foods in other ways, quality, availability of merchandise, prices, problems, storage, appearance and other details. (Use back of paper if more space is needed).\n\nWe used eggs and butter specifically for exchange for groceries also for articles of clothing.\n\nSome weeks taking to pay for 2 pair of shoes for two small children with 4 to 6 day jobs $1.50 a week but the shoes were better quality than we got from our $8.00 a week to put pieces on the salary of them shoes only when their shoes wore out.\n\nMy husband got the pieces of old women shoes to knit all through the year while my husband was able to knit one of our favorite articles of diet on Sundays which my husband used to make with flour, breads and butter. We'd give them part them about 1/3 thick then put in medium pieces and bake them. I used to make jelly pads from the same ingredients and mixed to a batter and fry them in some lard and eat them with a little sugar over a hot butter and eat them with a little sugar over a hot\nIn the early days, the meals were very plain,\nwith meat and vegetables principally, with pudding\nfor dinner, no fancy cakes and pies, a dried apple\nfor a treat, and a plain cake a luxury.\nA custard pudding was quite common, as it only\nneeded a little sugar to be tasty.\n\nWhen did you begin to rely on purchased foods and prepared foods instead\nof home-made and homemade?\n\nI have never relied on purchased foods\nalways home grown and home made.\nEven made my own bread when living alone\n6 or 7 years ago, when buying one bag\nat a time was better than buying 2 or 3\nthere was no waste to save, long ago and 30 years\ndried out before you could use them up.\n\nPlease fill in other details: From your early experience of buying groceries\nand purchasing foods in this area, further please tell us in more detail about\nyour experience with purchased foods, quality, storage of purchased foods,\nprice, etc.\n\nWe used eggs and butter primarily for exchange\nfor groceries, also for articles of clothing.\n\nSome would take to pay for 2 or 3 of shoes for two small\nchildren with eggs or butter, which was hard to put\npieces on the sale of their shoes, when these shoes were\nworn out. Husband got the pieces of old women's shoes to sell\nall through the years while only husband was alive 1916\n\nAll through the years while only husband was alive 1916\none of our family's articles of diet was Biscuits which my\nhusband used to make with flour, Bicola and butter, which\nwe used to make them about 4 times a year from the\nbiscuit and bread, passed to make sloppy joes from the\nbiscuit and bread, and used to a bottle and gay them in\nsome ingredients and cooked with a little sugar over a fire.\nWe ended up with a good meal with either of these, Biscuits or Sloppy Joes.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1890_42.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6940, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1076, 5], [1076, 2086, 6], [2086, 2785, 7], [2785, 3610, 8], [3610, 4803, 9], [4803, 6102, 10], [6102, 6102, 11], [6102, 7549, 12], [7549, 9273, 13], [9273, 10643, 14], [10643, 11739, 15], [11739, 12757, 16], [12757, 14053, 17], [14053, 15603, 18], [15603, 17087, 19], [17087, 18456, 20], [18456, 19931, 21], [19931, 21490, 22], [21490, 23000, 23], [23000, 24749, 24], [24749, 24749, 25], [24749, 24749, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]