[{"id": "94c3ade3f430b2dce4f29b756b28faaa36f12fdd", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Miss J.H. Conlin\nAddress 33 1/2 - 13 Ave., Regina\nBirthplace Hollywood, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Eastern Canada? 1904\nWhere did you set up housekeeping? 12 1/2 Ave., North of Regina\nWhere had you been living before that? Collingwood, Ont.\nFor how many people did you prepare meals? From 8 to 20\nHow far was it to your nearest store? 10 miles\nHow often could a visit be made to the store? once or twice a week\nWhat groceries did you usually buy in those earliest years?\nmostly canned tomatoes - corn syrup - dried prunes & apples - flour, sugar, cereal, yeast\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\nIn what quantities did you buy it? 100 lbs. packs\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use graham flour? about 20 lbs. per year\nWhole wheat flour? very little\nWas flour milled locally? No, far away? What year?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use? Rolled Oats\nCornmeal? 4/10 Whole wheat? Farina? 4/10\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\nConlin, Mrs. J.H., Regina.\n\n1. INTERVIEW QUESTIONS\n\nWhat year did you start housekeeping in eastern Canada? 1904\n\nWhere did you set up housekeeping? Regina, Saskatchewan\n\nThere had you been living before that? Regina, Saskatchewan\n\nFor how many years did you prepare meals? 30\n\nHow far was it to your nearest store? 1 mile\n\nHow often could a visit be made to the store? Monthly\n\nWhat groceries did you usually buy in those earlier years?\n\nmostly canned tomatoes, corn syrup, dried beans, applesauce, sugar, cereal, yeast\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\n\nIn what quantities did you buy it? 5 lbs. each\n\nWas there any difference in price per hundred? No\n\nHow much did you use Graham flour? About 30 lbs. annually\n\nWas flour milled locally? No, for away? That far?\n\nWas the price for a twenty pound bag of rolled oats? $0.75\n\nWhat other grain products did you use? Rolled oats\n\nGormley? Yes\n\nOther? No\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lb. sacks.\n\nWhat was the price for a ten pound sack of white sugar? About $4.00.\n\nWhat brand of golden corn syrup did you use? Edward Darling.\n\nWhat size of tin of syrup did you usually buy? 20 oz.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cow.\n\nBought from... (illegible)\n\nButter? Made it.\n\nEggs? Had them.\n\nWhat was the price of butter? $1.50.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese? Cottage cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Mostly cured.\n\nPork, wild game, venison, rabbit.\n\nHow did you get fresh meat? In winter, we butchered a beef.\n\nHow often did you get fresh meat? In summer, once a week.\n\nHow did you preserve meat? Curing, smoking.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so, what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Duck, Rabbit, Pheasant, Partridge, Pheasant, Chicken.\n\nFor how long? When meat was needed.\n\nWhat part did fish play in the family diet? We could buy fresh fish, but not in winter.\n\nWas the fish fresh, cured, or canned? Cured, canned, salmon.\n\nKinds? Salmon, catfish, pickerel.\n\n(Handwritten note: Fresh fish in winter; canned fish in spring.)\n3. APPLES AND FRUITS\n\nIn what quantity did you buy apples recently? [Blank]\n\nWhat was the price for a ten pound sack of apples bought last week? [Blank]\n\nThat brand of rolled oats seems just what I want! [Blank]\n\nWhat price of tea or coffee did you usually buy? [Blank]\n\nAt what places?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? [Blank]\n\nDid you make butter? [Blank]\n\nDid you make cheese? [Blank]\n\n5. MEAT AND FISH\n\nWas there a \"meat ring\" in your neighborhood? [Blank]\n\nDid you use meat? [Blank]\n\nFor how long? [Blank]\n\nDid you ever buy meat from the market? [Blank]\n\nDid you ever buy meat from the butcher? [Blank]\n\nDid you ever buy meat from the grocer? [Blank]\n\nDid you ever buy meat from the butcher? [Blank]\n\nDid you ever buy meat from the grocer? [Blank]\n6. BEVERAGES\n\nWhat kind of tea did you buy? \nAt what price? \n\nWhat kind of coffee did you buy? (beans or ground) \nPrice? \n\nWhat other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \n\nCould you get potatoes at the store? \n\nIf not, where from? \n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes \nCabbages \nCarrots \nOnions \nTurnips \nBeets \n\nIn what quantities did you buy white navy beans? \n\nHow did you buy prunes, (in bulk or by the box)? \n\nWhat weight? \n\nHow did the grocer handle prunes (by box)? \n\nWhat was the price of prunes? \n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \n\npeas? \ncorn? \nbeans? \nSaskatoons? \n\nother foods? \n\nWhat year did you first preserve fruit by canning? \n\nWhat year did you first preserve vegetables by canning? \n\nWhat year did you first preserve meat by canning? \n\nDo you still preserve foods by canning or drying? \n\nTo what extent? \n\nDid you make your own vinegar? \n\n---\n\n1930\n6. What kind of tea did you buy? \n   What kind of coffee did you buy? (Oxen or ground) \n   What other beverages were bought? \n   Price? \n\n7. Where did you get your vegetables? \n   If not, where from? \n   What year did you first grow your own supply for the winter? \n   Potatoes \n   Cabbages \n   Carrots \n   Turnips \n   Beets \n   In what quantities did you buy white navy beans? \n   How did you buy prunes, (in bulk or by the box)? \n   What weight? \n   How did the grocer handle prunes (by box)? \n   What was the price of prunes? \n   What other dried fruits did you use in the earliest days? (apricots, currants or others?) \n\n8. Preservation \n   In the early years did you preserve any foods by canning? \n   Other foods? \n   That year did you first preserve fruit by canning? \n   That year did you first preserve vegetables by canning? \n   That year did you first preserve meat by canning? \n   Do you still preserve foods by canning or drying? \n   To what extent? \n   Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | How was it sold? - In bulk, 10 lb., sack, can etc. | Are you usually bought at one time. | Price of this amount |\n|-----------------------------|-----------------------------------------------------|------------------------------------|----------------------|\n| Soda biscuits               |                                                     |                                    |                      |\n| Macaroni                    |                                                     |                                    |                      |\n| Graham flour                |                                                     |                                    |                      |\n| Brown sugar                 |                                                     |                                    |                      |\n| Molasses                    |                                                     |                                    |                      |\n| Table salt                  |                                                     |                                    |                      |\n| Common salt                 |                                                     |                                    |                      |\n| Lily white syrup            |                                                     |                                    |                      |\n| Toilet soap                 |                                                     |                                    |                      |\n| Baking powder               |                                                     |                                    |                      |\n| Baking soda                 |                                                     |                                    |                      |\n| Dried peas                  |                                                     |                                    |                      |\n| Dried corn                  |                                                     |                                    |                      |\n| Vinegar                     |                                                     |                                    |                      |\n| Raisins - seeded            |                                                     |                                    |                      |\n|                             |                                                     |                                    |                      |\n|                             |                                                     |                                    |                      |\n| Rice                        |                                                     |                                    |                      |\n| Currants                    |                                                     |                                    |                      |\n| Store jam - kinds?          |                                                     |                                    |                      |\n| Cheese (Cheddar or store cheese) |                                                     |                                    |                      |\n| Vanilla                     |                                                     |                                    |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal cake yeast\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names | |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  | 3½¢ 25¢                               |                               |                                                |\n| Other prepared breakfast cereals - give names | |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ...............................................................\n\nHow far was this water from your home? ..............................................\n\nHow was it brought to the home? (pail, barrel, tank) ..............................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Mostly made own own\nIf you made your own, did you use lye? Yes\nWhat kinds of laundry soap did the grocer handle? Slightly Smalight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Hard\nWhere did you get your fuel? From cliffs\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\nCoal was used more extensively from around 1920\nElectricity was being installed in country around 1946, north of Regina.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\nDid you use an outdoor fireplace or bake oven? (Give dates) No\nBy whom was your first cook stove made? Peggy Ross\nWhat year was it purchased? 1904 Price? $30.00\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Some iron, some enamelware\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware\nWhen did you first see enamel ware? About 1900\nAluminum? About 1912\n16. **SHAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**Breakfast**\n- Rolled Oat porridge - fried potatoes - eggs\n- Bread, butter - jam or syrup - coffee/tea\n- Milk & cream\n\n**Dinner**\n- Soup, meat - Potatoes - pickles - Bread, butter\n- Toffee - Pie - syrup or prunes - tea\n\n**Supper**\n- Pancakes - eggs - syrup - tea\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? ...................... Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n26. Give a typical day's menu (breakfast, dinner & supper) for the earliest years.\n\nBreakfast: Roll oats porridge - fried tomatoes - tea\n\nDinner Supplement: Potato pie - pickles - bread & butter\n\nSupper: Pancakes - eggs - tea\n\n17. What year did you serve your first Christmas dinner in eastern Canada?\n\n18. How many people attended? Give the name. Last known present at five years old.\n\n19. If you were living on rations or starvation level living at any age, give details.\n\n20. Would you agree to be paid for your work?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWe were more or less content, with meat, potatoes, canned tomatoes, pickles, hot brown rolls. Bread homemade, pan cake, and corn syrup was used very little for dessert. Then we were wanting a little extra. We served it with cream poured over it.\n\nBefore apples were on the market in Regina, we had apples shipped from Ont. in barrels. So had pies & sauce.\n\nWe grew the common variety of vegetables in gardens for ourselves use mostly - tomatoes or cucumbers.\n\nUntil about 1946 we grew no apple tomatoes - great green ones.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nBy 1912 we could buy sweet vegetables in cans also some fruit - jams & pickles. Probably by 1915 we could buy pineapples.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding differences in the transportation of mails in the\n\n21. When did you begin to rely on preserved foods and preserved foods instead\n\n22. Please add other details from your early experiences of buying groceries\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904A-H_131.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4177, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1419, 3], [1419, 2467, 4], [2467, 3808, 5], [3808, 4606, 6], [4606, 5782, 7], [5782, 6780, 8], [6780, 10618, 9], [10618, 10618, 10], [10618, 14368, 11], [14368, 14368, 12], [14368, 15446, 13], [15446, 15446, 14], [15446, 16403, 15], [16403, 16924, 16], [16924, 18168, 17], [18168, 18403, 18], [18403, 18403, 19], [18403, 18403, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]