[{"id": "a83c0269a665abaded574270244c255fd77770af", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\n(Instructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Charles George Pickard\nAddress: Fertile, Sask.\nBirthplace: Brandon, Manitoba.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1901\nWhere did you set up housekeeping? At Roston, Manitoba\nWhere had you been living before that? At Findlay, Manitoba, at home\nFor how many people did you prepare meals? 4 men, boarding with us working for C.P.R.\nHow far was it to your nearest store? We lived in Roston, a very small place at that time.\nHow often could a visit be made to the store?\nWhat groceries did you usually buy in those earliest years? Meat, flour, tea, coffee, yeast cakes, eggs, dried fruits, apples, baking powder, baking soda, butter, numerous other things. Had to buy everything while living in Roston.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS After moving out to the Prairies in 1904\n\nWhat brand of white flour did you use in the early years? Harwood, Queen\nFirst year bought flour after that got our wheat ground at the mill.\nIn what quantities did you buy it? Bought several bags so as always to have flour on hand.\nWhat was the usual price per hundred pounds of white flour? Around $1.50 per bag.\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? At Roston How far away? 16 miles What year? 1905\nWhat was the price for a twenty pound bag of rolled oats? Around 75¢\nWhat other grain products did you use? Cornmeal, used some Whole Wheat, Farina\nOther? Mace Johnny cake\nDid you grind your own wheat for porridge? Some times would grind some to have a change from rolled oats\nHow did you grind it? Had a little grinder\n\nRECEIVED\nJUL 26 1955\nSASKATCHEWAN ARCHIVES\nSASKATOON\nPIONEER DAYS: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, SASK., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Charles George Pickard\n\nAddress: [illegible]\n\nBirthplace: [illegible]\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? [illegible]\n\nWhere did you set up housekeeping? [illegible]\n\nWhere had you been living before that? [illegible]\n\nFor how many people did you prepare meals? [illegible]\n\nHow far was it to your nearest store? [illegible]\n\nHow often could a visit be made to the store? [illegible]\n\nWhat groceries did you usually buy in those earliest years? [illegible]\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nAfter moving out to the Prairies in 1944\n\nWhat brand of white flour did you use in the early years? [illegible]\n\nFirst year bought flour after that got our wheat ground at the mill... [illegible]\n\nIn what quantities did you buy the [illegible] durum? [illegible]\n\nWhat was the usual price per hundred pounds of white flour? [illegible]\n\nHow much did you use graham flour? [illegible]\n\nWhole wheat flour? [illegible]\n\nWas flour milled locally? [illegible]\n\nHow far away? [illegible]\n\nWhat was the price for a twenty pound bag of rolled oats? [illegible]\n\nWhat other grain products did you use? [illegible]\n\nCornmeal? [illegible]\n\nRice? [illegible]\n\nOther? [illegible]\n\nDid you grind your own wheat for porridge? [illegible]\n\nHow did you grind it? [illegible]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Usually tried to buy 100 pounds at a time.\n\nWhat was the price for a ten pound sack of white sugar? Around $7.50 per hundred pounds.\n\nWhat brand of golden corn syrup did you use? Edwardsburg & Sons.\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt what price? $.94 lb.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Bought a few cows brought with us.\n\nButter? Made our own butter.\n\nEggs? Had our own hens brought there with us.\n\nWhat was the price of butter? $2.00 lb.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Curried meat, pork, venison, beef, and game.\n\nHow did you get fresh meat? Usually when we killed a pig or beef in the winter time.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? Made a brine in a barrel in the cellar and packed the barrel in it.\n\nWas there a \"beef ring\" in your neighborhood? Not until later years.\n\nFor how long? For a number of years until it got fairly well settled then the great turkey went away.\n\nWhat part did fish play in the family diet? Not so much, could only get it in the winter time.\n\nWas the fish fresh, cured, or canned? Fresh fish, frozen.\n\nKinds? Pike, fish from the lakes.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Usually 5 lbs. in 10 lb. bags.\n\nWhat was the price for a ten pound sack of white sugar? $4.75.\n\nWhat brand or golden corn syrup did you use? E. & J. Young.\n\nWhat size of tin of syrup did you usually buy? 1 lb.\n\nAt what price? $.50/lb. x 75¢/lb. Answer: $0.375/lb.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Bought at local farms.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? Cheese.\n\nWhat was the price of butter? $2.50/lb.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Purchased from local stores.\n\nHow did you get fresh meat? Purchased from local stores.\n\nHow often did you get fresh meat? Weekly.\n\nHow did you preserve meat? Canned, frozen, and salted.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so, what year was it organized? Answer: Not sure.\n\nDid you use game? Yes.\n\nFor how long? Answer: Not sure.\n\nWhat kind of fish play in the family diet? Fish.\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKinds? Answer: Not sure.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea, purchased in Toronto. At what price? $1 per 3 lbs.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee beans purchased for me.\n\nPrice? $0.25/lb. What other beverages were used? Coffee, bought by the pound.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? ...........\n\nCould you get potatoes at the store? Yes, from somewhere.\n\nIf not, where from? ..................................................................\n\nWhat year did you first grow your own supply for the winter of 1905?\n\nPotatoes .......... Cabbage .......... Carrots .......... Onions .......... Turnips .......... Beets\n\nIn what quantities did you buy white navy beans? Did you use navy beans? No, I would prefer to put them away until next fall.\n\nHow did you buy prunes, (in bulk or by the box)? Mostly by the box, sometimes by the pound.\n\nWhat weight? By the pound. How did the grocer handle prunes (by box)? Yes, ............\n\nWhat was the price of prunes? ......................\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants, or others)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ........................\n\npeas? ........... corn? ........... beans? ............. Saskatoons? .............\n\nother foods? ..................................................................\n\nWhat year did you first preserve fruit by canning? Early years.\n\nWhat year did you first preserve vegetables by canning? Early years.\n\nWhat year did you first preserve meat by canning? A number of years ago.\n\nDo you still preserve foods by canning or drying? By canning.\n\nTo what extent? Not so much now; only an old folks' dish here and there, but not as much. We can buy a chicken for summer use, want to can a lot when the family were home living in the family.\n\nDid you make your own vinegar? Yes, tried, too, but not as good as the...\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blank. How much did you buy? (beans or ground) Blank. What kind of coffee did you buy? (beans or ground) Blank. What other beverages were used? Blank.\n\nPriest Joshua H.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of 1905?\n\nPotatoes\n\nCabbage\n\nCarrots\n\nTurnips\n\nBeets\n\nBeans\n\nLettuce\n\nOkra\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes? (in bulk or by the box?)\n\nWhat weight by each box?\n\nHow did the grocer handle prunes (by box) etc.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, figs, etc., peach, loganberries, raisins, currants for others)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by dry life?\n\nPeas\n\nCorn\n\nBeans\n\nSaskatoon berries\n\nOther foods?\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent? Did you have a large garden? Did you have a large orchard? Did you make your own vinegar?\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-----------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                     |                                   |                     |\n| Macaroni              |                                               |                                                     |                                   |                     |\n| Graham flour          |                                               |                                                     |                                   |                     |\n| Brown sugar           |                                               |                                                     |                                   |                     |\n| Molasses              |                                               |                                                     |                                   |                     |\n| Table salt            |                                               |                                                     |                                   |                     |\n| Common salt           |                                               |                                                     |                                   |                     |\n| Lily white syrup      |                                               |                                                     |                                   |                     |\n| Toilet soap           |                                               |                                                     |                                   |                     |\n| Baking powder         |                                               |                                                     |                                   |                     |\n| Baking soda           |                                               |                                                     |                                   |                     |\n| Dried peas            |                                               |                                                     |                                   |                     |\n| Dried corn            |                                               |                                                     |                                   |                     |\n| Vinegar               |                                               |                                                     |                                   |                     |\n| Raisins               |                                               |                                                     |                                   |                     |\n| Rice                  |                                               |                                                     |                                   |                     |\n| Currants              |                                               |                                                     |                                   |                     |\n| Store jam             |                                               |                                                     |                                   |                     |\n| Cheese (Cheddar or store cheese) |                           |                                                     |                                   |                     |\n| Vanilla               |                                               |                                                     |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast tablets .......................\n\nDid you make yeast for your own use? .......... Using starter? ............\n\nUsing hops? Mother's wash to use before baking .............. Salt rising? ................\n\nDid you buy baking powder? yes .................. Baking soda? yes .............\n\nCream of tartar? yes .................. Did you make your own baking powder?\n\n.................................................................\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Year you first remember seeing it in the store | How was it built? | Was it usually bought at bulk, 20 lbs., sacks, etc., once time | Any, you praise of this amount |\n|-----------------------------|-----------------------------------------------|-------------------|---------------------------------------------------------------|-------------------------------|\n| Soda biscuits              |                                               |                   |                                                               |                               |\n| Macaroni                    |                                               |                   |                                                               |                               |\n| Graham flour                |                                               |                   |                                                               |                               |\n| Brown sugar                 |                                               |                   |                                                               |                               |\n| McLemore's                  |                                               |                   |                                                               |                               |\n| Table salt                  |                                               |                   |                                                               |                               |\n| Common salt                 |                                               |                   |                                                               |                               |\n| Lilly White syrup           |                                               |                   |                                                               |                               |\n| Toilet soap                 |                                               |                   |                                                               |                               |\n| Baking powder               |                                               |                   |                                                               |                               |\n| Dried peas                  |                                               |                   |                                                               |                               |\n| Dr. Lee corn                |                                               |                   |                                                               |                               |\n| Vinegar                     |                                               |                   |                                                               |                               |\n| Raisins                     |                                               |                   |                                                               |                               |\n| Rice                        |                                               |                   |                                                               |                               |\n| Store jam                   |                                               |                   |                                                               |                               |\n| Cheese                      |                                               |                   |                                                               |                               |\n| Vanilla                     |                                               |                   |                                                               |                               |\n\n10. BAKING\n\nWhat type of yeast did you use? Regular yeast, etc.\n\nDid you make yeast for your own use?\n\nUsing hops? Yeast made & used before? Salt rising?\n\nDid you buy baking powder?\n\nCream of tartar? Yes, did you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names | |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minute tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) There was a well on the old homestead before we moved to the farm................\n\nHow far was this water from your home? About a few yards from the house, dug into the well & built after so as to be near to the water.\n\nHow was it brought to the home? (pail, barrel, tank) By pail..............\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|------|----------------------------------------|-----------------------------|-----------------------------------------------|\n| Canned salmon | | | |\n| Canned sardines | | | |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh | | | |\n| Apples - dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| Tomatoes - canned | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Other dryed breakfast cereals - give names | | | |\n| Pearl tapioca | | | |\n| Minute tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Icing sugar | | | |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) How far was this water from your home? How was it brought to the house? (pail, barrel, tank) Regarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Made some & bought some.......\n\nIf you made your own, did you use lye? Yes........... wood ashes? No\n\nWhat kinds of laundry soap did the grocer handle? Royal Crown, etc.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal, wood, etc.\n\nWhere did you get your fuel? From farmers, etc.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nFarmers have all their own wood now. After they run out, they burn straw, etc.\n\nBuy a little coal for winter months. This last couple of years quite a number have bought propane for stoves also oil burners for heating the house. Do not need coal or wood with these burners.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ......................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ............\n\nBy whom was your first cook stove made? __________________\n\nWhat year was it purchased? 1921.......................... Price?.............\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ...........\n\nFor preparing food? (china, earthenware, wooden bowls, other) ............\n\nWhen did you first see enamel ware? ...........................................\n\nAluminum? ...........................................\n13. SOAP\n\nDid you buy laundry soap or make your own? If so, how?\n\nIf you made your own, did you use soap? What kind of soap did you use?\n\nWhat kind of laundry soap did the grocer handle? (e.g., brown bars, white bars)\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? (e.g., wood, coal, oil, gas)\n\nWhere did you get your fuel from?\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping.\n\nAny little and pleasant memories? (e.g., the old cook stove, the wood-burning stove)\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Name, place, date)\n\nWhat year was it purchased? (Give date)\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nThis is put up in brown paper or cardboard, also coffee in lined paper containers by local manufacturers.\n\nAlso dried fruits in packages. Meat all foods comes wrapped or in containers in just half as much room.\n\nSanitary than years before.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nOur menu for breakfast was porridge with milk + sugar. Bread toasted on the stove with butter + a boiled egg in the summer. In winter, didn't have the eggs.\n\nFor dinner, baked pork, baked beans, fried potatoes + some vegetables. If we had it from the garden, cooked made with eggs + milk or bread pudding. In the winter, usually tried to have fresh meat.\n\nFor supper, warmed up potatoes, eggs + fried or boiled + what ever fruit we had picked + canned.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the present and give their approximate ages at the time.\n\nRoast chicken, potatoes, pickles, one vegetable, bread + butter, a steamed butternut pudding with raisins in it.\n\nMrs. Pickard, myself + two small children, also a nephew + a young boy from Winnipeg who stayed the winter with us.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nAlways had enough to eat whatever we had sometimes not much variety.\n\nSome times only bread + milk for supper. Would heat the milk in a pot + break the bread in them serve in these bowls with sugar because fond of this.\n16. WHAT FOODS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received\nwith the food you purchased (give dates where possible).\n\nShow a label or description of the food purchased in containers in your possession.\n\n17. Give a typical daytime menu (breakfast, dinner and supper) for the earliest\nyear you can remember. Give the year and list the members of the family\nwith their ages at the time. State the approximate ages, e.g., winter or\nsummer. Only mention food purchased when purchased, e.g., bread, tea, milk, etc.\n\n18. What year did you serve your first Christmas dinner in Western Canada? In\nthe early days, the family would have had a special meal on Christmas Day.\n\n19. Were you ever reduced to almost starvation level living on one or two locally\nproduced foods? Give details.\n\nAlways had enough food while we had a normal family\nSome temporarily (bread & milk) but never crowded, had to make do at\ntimes.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. Early days we grew good gardens & raised all we could because we had no money to buy with. Baked our own bread also catch when ever we had one canned our vegetables or fruits. Did not buy much more than tea & coffee. Raised more on our own hens than for a living. Today hardly a woman in this district keeps her own hens. If she does keep a cat or get a cat, may be treated to not grow so much garden can buy all vegetables in cans also canned fruits of all kinds. If this buy canned meat, kith, pork, canned pork or think in cans or go to the Butcher shop for meat. Hardly ever hear of anyone killing their own meat. Ship whatever animal they have to dispose of & then buy there meat in a much easier way. Hardly any farmer milks a cow buys bottled milk or in cans.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nWe have never relied much on prepared foods. Have our little garden & prefer our own food as much as possible. Since the 30's we have had fairly good crops in this district & many now seem to rely on purchased foods. Prepared foods rather than home prepared foods.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nProblems of storage now is easier as most people own a fridge either with Propane or Electric to keep there meat & other things cold.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. (Give as many details and dates as possible.)\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and those prepared foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details.\n\n23. Problems of Storage now in various areas. (See back of page 19 more space is needed.)\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Charles George Pickard...\nAddress: Fertile, Sask. ...............\nBirthplace: Brandon, Manitoba...\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904 ................\n\nWhere did you set up housekeeping? At Roston, Manitoba ................\n\nWhere had you been living before that? At Findlay, Manitoba at home ..........\n\nFor how many people did you prepare meals? Four or boarding without working for the B.P.R.\n\nHow far was it to your nearest store? We lived near Roston, a very small place at that time.\n\nHow often could a visit be made to the store? ...........................................\n\nWhat groceries did you usually buy in those earliest years?\nGreat flour, tea, coffee, yeast cakes, eggs, dried fruits, apples, baking powder,\nBaking soda, butter, numerous other things. Need to buy everything while living in Roston.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS after moving out to the Prairies in 1904\n\nWhat brand of white flour did you use in the early years? Harvest Queen ...\n\nFirst year bought flour, after that got four wheat gristled at the mill ..........\n\nIn what quantities did you buy it? Bought several bags so as always be sure of having flour on hand.\n\nWhat was the usual price per hundred pounds of white flour? Around $2.50 per bag.\n\nHow much did you use graham flour? ..........................................................\n\nWhole wheat flour? .....................................................................................\n\nWas flour milled locally? At Rainbow How far away? 16 miles. What year? 1925\n\nWhat was the price for a twenty pound bag of rolled oats? Around 75¢ ....\n\nWhat other grain products did you use? ..........................................................\n\nCornmeal? Used Screened Whole Wheat? .................. Farina? ................\n\nOther? ...........................................................................................................\n\nDid you grind your own wheat for porridge? Sometimes would grind some to have a change from rolled oats.\n\nHow did you grind it? Had a little grinder .....................................................\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it back.\n\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Saskatchewan, Canada\n\nName: Mrs. Charles George Pickard\n\nAddress: [illegible]\n\nBirthplace: Brandon, Manitoba\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904\n\nWhere did you set up housekeeping? A.P. Red River, Manitoba\n\nWhere had you been living before that? A.P. Red River, Manitoba\n\nFor how many people did you prepare meals? [illegible]\n\nHow far was it to your nearest store? [illegible]\n\nHow often could a visit be made to the store? [illegible]\n\nWhat groceries did you usually buy in those early years? [illegible]\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [illegible]\n\nIn what quantities did you buy it? [illegible]\n\nWhat was the usual price per hundred pounds of white flour? [illegible]\n\nHow much did you use graham flour?\n\nWhole wheat flour? [illegible]\n\nWas flour milled locally? [illegible]\n\nWhat was the price for a twenty pound bag of rolled oats? [illegible]\n\nWhat other grain products did you use? [illegible]\n\nDid you grind your own wheat for porridge? [illegible]\n\nHow did you grind it? [illegible]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Usually tried to buy 100 pounds at a time.\n\nWhat was the price for a ten pound sack of white sugar? ... about $7.50 per hundred pounds.\n\nWhat brand of golden corn syrup did you use? Edward's Syrup.\n\nWhat size of tin of syrup did you usually buy? 1/2 pint.\n\nAt what price? $0.45 per can.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Bought from a cow or bought from a neighbor.\n\nCould keep it for two-three days without spoiling?\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Purchased from local stores.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so, how was it organized? By the farmers.\n\nDid you use game? Yes.\n\nFor how long? For a number of years until it got fairly well settled then the game became scarce.\n\nWhat part did fish play in the family diet? When shooting season in the spring so many are allowed to be killed.\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKinds? Pikes, fish from the lake.\n1. SUGARS AND SYRUPS\n\nIn what quantity did you buy \"daily sugar\" usually? Usually how much in June and July?\n\nWhat was the price for a ten pound sack of white sugar? (Amount $4.75)\n\nWhat brand of golden syrup did you use? (Brand: Brown Sugar)\n\nWhat size of tin or syrup did you usually buy? (Size: 1 lb.)\n\nAt what price? (Price: $0.75)\n\n2. DAILY PRODUCTS\n\nDid you buy, rent a supply of fresh milk in the nearby town? (Yes)\n\nCould you get cream from the dairy? (Yes)\n\nThat was the price of butter? (Price: $1.50)\n\nDid you pack eggs for fresh eggs? (Yes)\n\nDid you make butter? (Yes)\n\nWhat kind of cheese?\n\n3. MEAT AND FISH\n\nWhat was your meat supply in the nearby town? (Pork)\n\nHow did you get fresh meat? (Purchased at the market)\n\nHow often did you get fresh meat? (Weekly)\n\nHow did you preserve meat? (Canned)\n\nWas there a \"meat plant\" in your neighborhood? (No)\n\nIf so, what year did it operate? (Year: 1920)\n\nDid you use name? (Name: Smith's Meat Plant)\n\nFor how long? (Duration: 10 years)\n\nDid you buy fish from the nearby town? (Yes)\n\nHow much could you get at once? (Amount: 1 lb.)\n\nWas the fish fresh, cured, or canned? (Fresh)\n\nWas the fish from the Atlantic Ocean? (Yes)\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea purchased in store. At what price? $1 for 3 lbs.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee beans purchased at local store.\n\nPrice? $3.50 per lb.\n\nWhat other beverages were used? Carrots bought in bulk by the pound.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store? Yes or no.\n\nIf not, where from? Local farmers.\n\nWhat year did you first grow your own supply for the winter of 1905?\n\nPotatoes, Cabbages, Carrots, Onions, Turnips, Beets.\n\nIn what quantities did you buy white navy beans? Did you have any saved from last year?\n\nHow did you buy prunes, (in bulk or by the box)? In bulk.\n\nWhat weight? 25 lbs.\n\nDid the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes?\n\nThat other dried fruits did you use in the earliest days? (apricots, pears, apples, etc.)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas, corn, beans, Saskatoons.\n\nOther foods?\n\nThat year did you first preserve fruit by canning? Early years.\n\nThat year did you first preserve vegetables by canning? Early years.\n\nThat year did you first preserve meat by canning? Early years.\n\nDo you still preserve foods by canning or drying? Yes, by canning.\n\nTo what extent? Not much, as we only had food left over, but we do not need so much.\n\nStill can beef & chickens for summer use, and I can a lot when the family uses some of our surplus.\n\nDid you make your own vinegar? Yes, tried two batches, as good as the bought-in vinegar.\n6. **BEVERAGES**\n\n   What kind of tea did you buy? (Black, Green, or Oolong) How much did you buy? (Ounces or Pounds)\n\n   Did you buy any coffee? (Yes or No)\n\n   Did you buy any other beverages? (Specify)\n\n7. **FOODS**\n\n   What was the price of pork per bushel? How much did you pay?\n\n   If not, what was the price of beef per hundredweight?\n\n   What year did you start growing tomatoes?\n\n   Potatoes\n\n   Turnips\n\n   In what quantities did you buy these vegetables?\n\n   How did you buy them? (In bulk or by the box?)\n\n   What other dried fruits did you use in the fall? (Apples, pears, plums, etc.)\n\n8. **PRESERVING**\n\n   In the early years, did you preserve any foods by drying?\n\n   Other foods:\n\n   That year did you first preserve fruit by canning?\n\n   That year did you first preserve vegetables by canning?\n\n   Do you still preserve foods by canning or freezing?\n\n   To what extent? (Specify)\n\n   Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                    |                     |\n| Macaroni              |                                               |                                                   |                                    |                     |\n| Graham flour          |                                               |                                                   |                                    |                     |\n| Brown sugar           | by Pound or Sack                               |                                                   |                                    |                     |\n| Molasses              | in Sack                                       |                                                   |                                    |                     |\n| Table salt            | in bulk or small                               |                                                   |                                    |                     |\n| Common salt           |                                               |                                                   |                                    |                     |\n| Lily white syrup      | in Pails                                      |                                                   |                                    |                     |\n| Toilet soap           | with red within                                |                                                   |                                    |                     |\n| Baking powder         | in Sack                                       |                                                   |                                    |                     |\n| Baking soda           | in Package                                    |                                                   |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               | bought by quart                                |                                                   |                                    |                     |\n| Raisins               | seeded by Pound                                |                                                   |                                    |                     |\n|                       | seedless                                       |                                                   |                                    |                     |\n| Rice                  | by Bulk By Pound                               |                                                   |                                    |                     |\n| Currants              | by Pound                                      |                                                   |                                    |                     |\n| Store jam             | kinds? Raspberry or Strawberry or mixed        |                                                   |                                    |                     |\n|                       | in small wooden Pails                          |                                                   |                                    |                     |\n| Cheese                | (Cheddar or store cheese) by Pound             |                                                   |                                    |                     |\n| Vanilla               | in Bottle                                     |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast cakes .......................\n\nDid you make yeast for your own use? .......... Using starter? ..........\n\nUsing hops? Mother used to use Hops ...... Salt rising? ................\n\nDid you buy baking powder? yes .................. Baking soda? yes ............\n\nCream of tartar? yes .................. Did you make your own baking powder?\n9. Please fill in the following to the best of your memory:\n\n| FOOD                        | You was it? | And you usually bought at bulk, can, etc., one time |\n|-----------------------------|-------------|-----------------------------------------------------|\n| Soda biscuits in bulk       |             |                                                     |\n| Macaroni                    |             |                                                     |\n| Graham flour                |             |                                                     |\n| Brown sugar                 |             |                                                     |\n| Molasses                    |             |                                                     |\n| Table salt                  |             |                                                     |\n| Common salt                 |             |                                                     |\n| Lily white syrup in Pools   |             |                                                     |\n| Toilet soap without wrapper |             |                                                     |\n| Baking powder in boxes      |             |                                                     |\n| Baking soda in packets      |             |                                                     |\n| Dried peas                  |             |                                                     |\n| Dried corn                  |             |                                                     |\n| Vinegar (half-proof)        |             |                                                     |\n| Raisins - seedless          |             |                                                     |\n| Rice by half by pound       |             |                                                     |\n| Currants by pound           |             |                                                     |\n| Store Jam - Kinda?          |             |                                                     |\n| Cheese (cheddar or store cheese) by pound | | |\n| Vanilla in bulk             |             |                                                     |\n\n10. Baking\n\nWhat type of yeast did you use? Royal yeast cake\nDid you make yeast for your own use?\nUsing starter?\nUsing hops? Salt rising?\nDid you buy baking powders? Yes\nDid you make your own baking powder?\nCream of tartar? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                 |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                                 |\n|                             | dried                                  |                               |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             | canned                                 |                               |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     |                                        |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names. | | | |\n| Pearl tapioca               |                                        |                               |                                                 |\n| Minute tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) From a well Mr. Pickard dug before we moved up to the farm...........\n\nHow far was this water from your home? Just a few yards from the house, dug the well first & built a house so as to be near the water.\n\nHow was it brought to the home? (pail, barrel, tank) By Pail.................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon | | | |\n| Canned sardines | | | |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh | | | |\n| - dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| - canned | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca | | | |\n| Minute tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Icing sugar | | | |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) How far was this water from your home? How was it brought to the home? (well, barrel, tank) How was it brought to the home? (well, barrel, tank) Regarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Where did you get your fuel? Mention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? Did you use an outdoor fireplace or bake oven? By whom was your first cook stove made? What year was it purchased? What types of utensils did you use? For preparing food? When did you first see enamel ware? Aluminum?\n13. SOAPS\n\nDid you buy laundry soap or make your own? (Name brand)\n\nIf you made your own, did you use lye? (Yes/No)\n\nWhat kinds of laundry soap did the grocer handle? (Specify)\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? (Specify)\n\nWhere did you get your fuel? (Specify)\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Specify)\n\nWhat year was it purchased? (Specify)\n\nWhat types of utensils did you use? (Iron, copper, tin, homeware)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nOur Menu for Breakfast was Porridge with milk + sugar. Bread toasted on the stove with Butter.\n\nFor Dinner in Summer, Salt Pork, Potatoes + some vegetables if we had it from the garden. Custard made with eggs + milk or Bread Pudding. For the winter usually tried to have fresh meat. For supper warmed up Potatoes, eggs fried or baked + whatever fruit we had Pickled or canned.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at the time.\n\nRoast chicken, Potatoes, Pie + one vegetable. Bread + Butter + Steamed Sweet Raisin Pudding with raisins in it.\n\nMr. Pickard, my self + two children also a nephew, a young boy from Winnipeg who stayed the winter with us.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nAlways had enough to eat what ever we had sometimes not much variety. Sometimes only Bread + milk for supper. Would heat the milk in the pot, break the bread in, then serve in thin bowls with sugar. We were fond of this.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers associated with the food you purchased (give dates where possible).\n\nThere is just one other item, the glass bottle of milk. It was used for milk, but not for water.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the past and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nOur house in Bradfield was very small. We had a small living room, a dining room, a kitchen, and two bedrooms. The bedrooms were very small, and we often had to sleep on the floor.\n\nFor dinner, we would have roast beef, potatoes, and vegetables. For supper, we would have fish and chips.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give details.\n\nI served my first Christmas dinner in Western Canada in 1945. It was a very special occasion because it was the first time I had ever cooked for someone else.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nI always had enough to eat, but there were times when the quality was very poor. I remember one particular winter when the potatoes were very bad.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. Early days we grew good gardens tried to produce all we could because we had no money to buy while baked our own bread also eggs when ever we had one, canned our vegetables & fruits. Did not buy much more than tea & coffee. Relied more on our own resources for a living.\n\nToday hardly a woman in this district lacks her garden. They can get a calf, pig & beef up. But nowadays much garden can buy at vegetables in cans also canned fruit of all kinds. After two canned meat. (Not afraid) canned pork & beans in cans go to the butcher shop for meat. Hardly ever lacks of any meat. Killing store own meat. Shipwreck ever arrived. They have to depend for them buy there meat in much easier way. Hardly any farmer needs a cow buys bottled milk or in cans.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible). We have never relied much on prepared foods have our little garden stills costs to prepare our own food as much as possible. Since the 30's we have had fairly good crops in this district & so many seem now to rely on purchased foods & prepared foods rather than home prepared foods.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandizing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed). Problems of storage now is easier as most people own a fridge either propane or electric to keep their meat & other things cold.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home-prepared foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing food in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed.)\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904K-Z_143.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 36, "total-input-tokens": 59760, "total-output-tokens": 11957, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1986, 3], [1986, 3585, 4], [3585, 4934, 5], [4934, 6087, 6], [6087, 8096, 7], [8096, 9370, 8], [9370, 14004, 9], [14004, 18230, 10], [18230, 22023, 11], [22023, 23156, 12], [23156, 24609, 13], [24609, 25617, 14], [25617, 27413, 15], [27413, 28367, 16], [28367, 30132, 17], [30132, 30820, 18], [30820, 33266, 19], [33266, 34583, 20], [34583, 35694, 21], [35694, 36874, 22], [36874, 38473, 23], [38473, 39406, 24], [39406, 44316, 25], [44316, 46756, 26], [46756, 50403, 27], [50403, 51577, 28], [51577, 52280, 29], [52280, 53164, 30], [53164, 54652, 31], [54652, 55950, 32], [55950, 57710, 33], [57710, 58303, 34], [58303, 58303, 35], [58303, 58303, 36]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]