[{"id": "d3aee5b8ce48df6a17e042690d74d0d48c0da231", "text": "Please print name and address in capital letters.\n\nYour full name: FRANCOIS GAUTHIER\n\nPresent Address: Martensville, Sask.\n\nPioneer Address: Martensville, Sask.\n\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1911, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease fill in name and address in capital letters.\n\nYour full name: FRANCOIS GAUTHIER\n\nPresent Address: MARCELLE, Sask.\n\nPlanner Address: MARCELLE, Sask.\n\nYear you came to Saskatchewan — 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 7 or 8\n\nHow many of these were bachelor's homes? 3\n\n2. How often did you usually visit neighbors? every week\n\n3. Did you usually visit on a Sunday, or other days? Sunday\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? invited or not invited\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? afternoon. Stayed for supper and passed the evening\n\nWhat about meals? Did you stay when not invited beforehand? good meals. Not necessary to be invited during early days. Always welcomed.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) make yourself at home eat what there is.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? wine (home made) soft drink.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? someone stay at home to look after the place\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nbee to build a house or a barn or to thresh or saw wood. During the first years.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. yes\n\nWere those more frequent in later years? Give dates, less beginning 1910\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? during winter specially, going by turn from one home to another at definite times.\n1. In the first few years how many homes were near enough to you for visiting back and forth? 7 or 8\n\n2. How many of these were bachelor's homes? 3\n\n3. How often did you usually visit neighbors? Every week\n\n4. Did you usually visit on a Sunday, or other days? Sunday\n\n5. How often invited to other homes, or was most visited done without an invitation? Invited or not invited\n\n6. What time of the day did you go? In the morning and spend the day? Or in the afternoon, etc.? Afterwards, stayed for supper and passed the evening\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal treated? Was people had come unexpectedly?\n\nThat is, was the term to make plans made, or was there any other expression\n\norally? Make yourself at home out what time?\n\nIf no meal, what other refreshment might be offered to visitors who had\n\nstopped by? Wine (home made) soft drinks.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"tea\" when groups of neighbors came together to put up a building, make quilting, or other such activity? Tell what the \"tea\" was for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, what\n\ndrivers or dances in homes? Describe. Yes\n\nWere these more frequent in later years? Give dates. I see beginning 1910\n\nDid you follow any kind of informal schedule such as going by just going by\n\none house to another at definite times, every two weeks, once a month, twice a month, etc., during winter specially, going by turn from one house to another at definite times.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nNone except Christmas Tree for School Children\n\nHow much of your social life was centred around the school, and within the school district? Describe. Nil\n\n9. When was your first community hall built? 1922\n\nWhat material was it made of? Lumber How large was it? 22x60\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Mr. LeHouillier - Free offerings Roman Catholic Population\n\nWas it built in the village or town, or was it a country hall?\n\nVillage\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nSocial Gatherings and parties.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nThe entire family attended excepted those in charge of the youngsters at home.\n\nHow were babies and small children provided for?\n\nBabies at home.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nBivery barn\n\n11. What card games were popular in the early days?\n\nWhist - Petro-Euchre Euchre-Casino Old Lady\n\nWas there card playing for a prize? Yes\n\nWhat dances were popular? Old times\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Accepted by all.\n8. Tell what use was made of the school house for community games, box socials, and other activities. (Include also the school organization, teachers, principal, etc., if you have not described these on the School Questionnaire.) \n\n9. How much of your social life was centered around the school, and within the school district? Describe all.\n\n10. When was your first community hall built? 1922\n\nWhat material was it made of? Lumber\n\nWho built it? The community through special funds, the municipality, some organization, etc.? Mr. Lehouillier - Free offerage - Roman Catholic population\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? For example, if you lived in the country, did you have to use the local school house for district gatherings, and make use of the hall for all gatherings, etc.? Social gatherings and parties.\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize? Yes\n\nWhat dances were popular? Old times\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain, no\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Accepted by all.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? Very polite as brought up in Quebec or in France.\n\n13. Was the chivaree known in your community? yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. Smart Chivarees were organized when a new married couple refused to have a dance.\n\nIt was then what we can call a forced dance.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nDistrict was well organized in 1910 and then familial life desapered gradually (by familial life, I mean that in pioneer days, we were considering our neighbor as a brother even if he was a negro.)\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Roman Catholic Church Organisation.\n\nGive the date and reason for it being organized.\n\n1904 to have a Church to pray God.\n\n16. Was there a Saskatchewan Grain Growers local in your community? no\n\nTell when it was organized, and what steps led to its organization.\n\nno\n\nApproximately what proportion of the farmers in the community belonged to it? none\n\nHow many women belonged? --- How often did it meet? ---\n\nWhat were some of the activities carried on by this organization?\n\n---\n\n17. Was there a Homemakers' Club in your district? no\n\nWhen was it organized? 1935\n\nApproximately how many women belonged to it? 15\n\nDescribe what you remember of its activities and services. ----\n12. What strengths & weaknesses, do you remember in small towns, such as Lumsden, etc.? Also when calling, calling cards, visiting friends occasionally.\n\n13. Was the Obliviate known in your community? Yes\n\nDescribe what you remember about obliterates, telling how common they were, when a man married or got a flu, etc., or when a woman got pregnant.\n\nIt was then when we call a friend dear.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling if any games, dances, etc., were held. Mentioned that there were changes in visiting or social life because of the church.\n\nDistrict was well organized in 1910 and then familial life disappeared gradually (by festival life), I mean that As pioneers days, we were considering our neighbor as a brother even if he was a stranger.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Roman Catholic Church Organization.\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized? 1935\n\nApproximately how many women belonged to it? 15\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nnone\n\nWhat means were commonly used by organizations for raising money?\n\nmeetings\n\n19. Where did various organizations hold their meetings?\n\nstores\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? no\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? yes Give dates if possible. 1912\n\nWho provided the lantern and the slides? outsiders\n\nWhat were the slides about? foreign lands\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? marbles, fly kites, ball.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? skipping rope, play house\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, also where they met, whether it included people only in a relatively small area (for example within a school district), or was centered in the town or village and included the surrounding community. (There is space in the torn questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? no\n\nDescribe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? yes Give dates if possible. 1912\n\nWho provided the lanterns and the slides? outsiders\n\nWhat were the slides about? foreign lands\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   skating\n\n   What games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   cards, checkers for adults\n\n   music and song happy families for youngsters\n\n   Did the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   there was much time for game, music, songs\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   no\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?  \n   Give year and month if possible.  \n   July 1905\n\n26. Who organized it?  \n   Roman Catholic Parish\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   entire community\n\n28. Was it the first picnic held in the community?  \n   yes\n\n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   ball games, races, stampede,\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   mentioned above\n\n31. What did you have to eat and drink?  \n   mentioned above\n\n32. What time of the day did it start, and how long did it last?  \n   from 11 a.m., until late at night\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as whist? \n\nTinies, whist, or other card games? \n\nCards, checkers, or other games? \n\nMusic and song, families for youngsters? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\nThere was much time for games, music, songs.\n\n24. Did children invent games connected with such things as buffalo bones, arrows, hand, gopher or other objects or animals, or games in the snow? Describe.\n\nNo\n\nPIONICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. July 1905\n\n26. Who organized it? Roman Catholic Parish\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball games, races, sharpshooting\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Mentioned above\n\n31. What did you have to eat and drink? Mentioned above\n\n32. What time of the day did it start, and how long did it last? \n\nFrom 11 A.M., until late at night\n33. Describe any features of this picnic which you remember as outstanding.\n\nHappy day welcome every year\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nAnnual picnic organized every year by the Roman Catholic Church\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n1910 - more organization by facilities of communications\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nMentioned above\n\n37. For what game was the first team organized in your community to play against neighboring teams? Hard ball\n\nWhat year? 1912 How long did it continue? Always\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nNone\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1922 hockey\n\nWhen was the first indoor rink built, and what was it used for?\n\nNone\n33. Describe any features of this place in which you remember as outstanding.\n\nHappy day welcome every year\n\n34. Describe the different kinds of places which you knew of in the early days such as the large community places, school or Sunday School, picnic, family picnics etc., etc., 1911 about any differences in numbers attending activities, food and drinks, when held, etc.\n\nAnnual picnic organized every year by the Roman Catholic Church.\n\n35. What changes have you noticed in Picton since the first year? If possible give dates when changes became noticeable.\n\n1910 more organization by facilities of communications\n\n36. Describe the sports which were popular in your community in the early years telling who took part in these various games and sports (boys, women, mostly young people).\n\nMentioned above\n\n37. For what game was the first team organized in your community to play against or neighboring teams?\n\nHurling Ball\n\nWhat year? 1912\n\nHow long did it continue? Always\n\n38. Name any other sports which were organized before 1912; giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nNone\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.), 1943 hockey\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1920\n   Did it grow out of or replace the earlier community picnic? no\n   Who was responsible for starting the first sports day? Paul Colleaux\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). No fixed date. During July\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n   no\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n   School books brought by my older brothers.\n\n43. How many of your neighbors brought books with them? I don't know\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n   Popular Mechanic. Local newspaper.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n   no\n\n48. Was there a school library? no\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material? yes\n7.\n\n40. When did an annual sports day become established in your community? No\n\nDid it grow out of or replace the earlier community picnic? No\n\nWho was responsible for starting the first sports day? Paul Gauthier\n\nThen was the sports day usually held (what month, or any special day, such as May 24th or July 1st)? No fixed date. During July\n\n41. Are there any from your community who have become members of well-known\n\nhistory, hall of fame, or other teams? Give names, and dates.\n\nno\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n\nnames and authors, if possible. If not, tell as nearly as you can how many\n\nbooks you brought, and what kind.) (See extra sheets if necessary)\n\nSchool books brought by my older brothers.\n\n43. How many of your neighbors brought books with them? I don't know\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nPopular Mechanics • Local newspaper\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates. no\n\n48. Was there a school library? no\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to\n\nread at home?\n\n49. Did parents ever use their children's school texts books as additional reading\n\nmaterial? yes\n50. Has there ever been a community library in your district or town? no\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? The Patriote and Le devoir.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   We add later one English newspaper.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? no\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? we have no more\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. yes\n50. Has there ever been a community library in your district or town? If so:\n   - When was it started?\n   - Is it still in existence?\n   - If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing money.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   - The Patriotes and Le devoir.\n   - We added later one English newspaper.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   - Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   - We have no more\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   clarinette\n\n57. What instruments did any of your neighbors have?\n   violon - acordion - mouth organ\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   violon - piano\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   once a week - after noon and evening\n\n   in the community? (were there musical concerts, was there group singing at parties, etc.) Describe. yes\n\n60. What were some of the favorite songs in the home?\n   French songs\n\n   in the community? french songs\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. yes\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. no\n\n63. Was there a band in your community? no\n   When was it started?\n   Who started it?\n   How long did it continue?\n   How many were in it?\n   Who was bandmaster?\n   What instruments were included?\n\n   Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n56. What musical instruments did you bring west with you?\n   - Clarinets\n   - Violins\n   - Accordions\n\n57. What instruments did any of your neighbors have?\n   - Accordions\n   - Violins\n\n58. What musical instruments have you bought since you came to the west? (Give dates, prices if possible, and tell where you bought them.)\n   - Violin\n   - Piano\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? (Describe once a week—after noon and evening parties, etc.) Yes\n\n60. What were some of the favorite songs in the home?\n   - French songs\n   - In the community? French songs\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain. Yes\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No\n\n63. Was there a band in your community? Who started it? When was it started? How long did it continue? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nnone\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nmore important. Education and density of the population\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? no\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. no\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nnone\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? no\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community been well known or famous in any musical, artistic, or other fields? If so, name.\n\n65. In what area do you feel most important in your community now as compared with the early days? List all the reasons for this change.\n\nHobbies and Special Interests:\n\n66. Do you have any special interests, such as stamp collecting, painting, photography, etc.? If so, describe them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? No\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, races, entertainments, etc., (use back of page or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905F-M_2037.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7993, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1130, 5], [1130, 2255, 6], [2255, 4190, 7], [4190, 5808, 8], [5808, 7812, 9], [7812, 9233, 10], [9233, 11055, 11], [11055, 12625, 12], [12625, 13981, 13], [13981, 15173, 14], [15173, 16777, 15], [16777, 18291, 16], [18291, 19735, 17], [19735, 21180, 18], [21180, 22619, 19], [22619, 24057, 20], [24057, 25092, 21], [25092, 26130, 22], [26130, 27477, 23], [27477, 28697, 24], [28697, 29896, 25], [29896, 30783, 26], [30783, 30919, 27], [30919, 31073, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]