[{"id": "f4f5fea5ecf3b3df3dab8200b977195ed9bf33d3", "text": "It is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use the spaces of paper if there is not sufficient space to answer the question. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets of paper for a separate questionnaire.\n\nWrite them on separate sheets of paper for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 3, entitled \"Pioneer Diets What Did Western Canadians Pioneer Diets Eat?\" is still being circulated. If you have not (read) answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n() Pioneer health conditions\n() Pioneer social life, sports and recreation\n() Pioneer housing\n() Pioneer occupation and otherwork\n() Pioneer farming experience\n\nPresentation of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nUniversity of Saskatchewan,\nSaskatchewan Archives Board,\nGassman Hall, Box 3,\n\nNO. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA VOTE OF APPRECIATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA list of questions relating to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so do not worry about having blank spaces. The questionnaire is designed to give details, or describe particular events, if they fail to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1937, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diets: What Did Western Canadian Farmers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nAll questionnaires on other subjects will be prepared at a later date, names of these are listed below. Please mark the ones you would be willing to answer.\n\n| All questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing and churchwork |\n| Pioneer education and churchwork |\n| Pioneer farming experiences |\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Provincial Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nKnown by various names (e.g., Baskatun, Baskatun, Baskatun).\n\nComing to BASKATUN Ewan J was very much afraid of them but they always seemed inclined to be friendly. They were such delightful people always. They were very friendly and generous about the time we came near the government had notice. It seemed so strange at first sight of the ceremony of making peace by killing to which they officially went afterwards, and were collecting or receiving presents for the ceremony but were being received back to their own province by the ROYAL N.W.M.R. accompanying a few weeks from our travel to say good-bye.\n\nThe Indians had so little room in any house although there seemed many hundreds of all kinds and ages there, squaws and children, with ponies fitted with saddles ready for larger persons. The squaws worked and carried the emigrants' children and the dogs were herded into the barns to fatten, carrying enough provisions to last them a long and interesting parade and they were very disappointed also.\n\nBut many hundreds later they were forced to stay till the end of the journey by their enemies. We were away of being running the plains during the rebellion to the great relief of our settlers. After years they were allowed back and were kindly invited to work for free under skilled workers or landlords helped by many brothers.\nknew how to make them very smooth and fine.\n\nComing to Basque Country, we were very much afraid of him, but they always seemed willing to be friendly with us. They were such delightful people, always. They came through fear, they always came peaceful.\n\nAbout the time we came west, the government had ordered it. It was to make an end of the ceremony of making peace by killing to satisfy His Majesty very pleasantly, and were collecting or buying horses for the ceremony but were being ordered back to their own business by the Royal N.W.M.P. comprising a few people from New England to carry out their orders. We carried Him of the entire tribe, remained many hundreds of feet behind and were forced to carry pots, pans, food, peppermints, etc., and carried His enemies children and the dogs were forced into the river. They made a long and interesting parade and they were very disappointed also.\n\nAnd many people lost their homes to stay here in this country by their enemies. Their wives were planning the future during the rebellion to the great relief of our settlers. But from then on, they were kindly to those who worked for them even skilled workers or housewives had never been known.\nThe writer, who is now in her ninety second year, has been glad to contribute his share to the architect's efforts but has wrong regret that it has not been done. It seemed almost impossible to decide if to say me else as it seemed in sport, \"Do a tale that is told.\"\n\nI am sure His kindness who are Off-Sprout-Pole a pride in the success of its province so they have accomplished so much in the time the older wooded provinces have taken.\n\nMay they go forward and prosper. Until the old and the new big concert series.\n\nMargery McCannel\n\nMargery McCannel\n\nP.S. McCannel\nSte 4-819 Nicola St\nVancouver B.C.\nThe writer, who is now in her ninety second year, has been glad to contribute in this small way to the architect's efforts but have regretted that it has not been done. It seemed almost impossible to decide it so away the idea as it seemed, in spirit, \"in a tale that is told.\"\n\nI am sure the pioneer who are still living today a pride in the success of the province so they have accomplished so much in the time the older woodsmen have been here.\n\nEnjoy this go forward and prosperity. Well!\n\nThe old and the new\n\nKeep coming smooth\n\nMargery McCannel\n\nMargery McCannel\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n2. Your full name: MARGERY McCANNEL\n\n3. Date: APRIL 15-1956\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1884\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. NONE\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n11. How did you get here? (By train, by horseback, etc.)\n\n12. Any other comments or observations?\nSASKATCHEWAN ARCHITECTURAL QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A CENTRAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MARGERY M'CANNELL\n2. Your address: 915 N. NICOLA ST., VICTORIA, B.C.\n3. Date: APRIL 15, 1956\n4. Where were you born? (Give name of place and country) MIDDLESEX COUNTY, ENGLAND\n5. What was your father's name and occupation? WILLIAM M'CANNELL - FARMER\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. MIDDLESEX COUNTY, ENGLAND\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may be.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nHAD JUST PASSED TWENTY-THIRD BIRTHDAY\n\nI had been engaged to go to the new land; and at this time I had no idea what I was doing. I had heard stories of the great adventure which the government had planned for young people. It made me very happy to think that I could make my way across the ocean and make my home in this new land.\n\nThe name of [REDACTED] was used to replace his name.\n11. What did your friends and relatives think of your decision to come to Western Canada? Why each gave his best wishes as well as helping us in a more substantial way, and our own wishes were very appreciated so we were able to be good about it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We traveled by ourselves via Chicago to St. Louis (Canada) via R.Roads westward. Everything was very smooth and comfortable.\n\n13. What means of transportation did you use? We used the railroad at first, but after a short while we switched to horseback. We had a very enjoyable trip and arrived safely.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nI think what impressed me most on the journey was the friendly atmosphere and the beautiful scenery. We traveled through the mountains, plains, and deserts in the dead of winter, and our team was amazing. We lucked out and never got stuck in the mud, which was a huge relief.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a friend's house for a few days until we found work.\n\n16. Where did you settle or take up land? We settled near the town of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. After finishing school, we moved to Calgary, Alberta, and then to Edmonton, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How after you came here?\n\nWe started off working on farms, but then moved into a garage business. We also worked as laborers and did odd jobs around town.\n\n19. Any other comments? We were very happy to be in Western Canada and enjoyed every moment of our stay.\nII. What did your friends and relatives think of your decision to come to Western Canada? Why did you choose to travel in such an adventurous way and our own adventure was very exciting?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? How did you travel? By train, bus, car, or other means?\n\n13. What means of transportation did you use? How did you travel? By train, bus, car, or other means?\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you settle or take up land? (Please describe the location and any other details about your settlement.)\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. Any other comments or observations?\n3. How often did you write to relatives or friends in your old home?\n\nWe wrote to our home fairly often, every two weeks.\n\n4. What was your favorite way to travel? Did you ever travel by air?\n\nWe traveled by air several times.\n\n5. If you were married, give the name of your husband or wife along with the date and place of marriage.\n\nMARCH 11/48 MELISH WILLIAM M. MIDDLESEX CO., ONT\n\n6. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nWe would not know as we believed we were fortunate enough to find a good place.\n\n7. How long did you live there?\n\nWe lived there for about five years.\n\n8. If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\nThey came West in 1886.\n\n9. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe first store for many miles around was opened in 1884.\n\n10. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\nWe traveled quite a bit.\n\n11. How often? How far? By what means of travel?\n\nWe traveled frequently by horseback.\n\n12. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n13. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n14. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n15. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n16. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n17. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n18. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n19. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n20. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n21. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n22. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n\n23. Did you have any special experiences during your time here?\n\nWe had many adventures, including being stranded in a blizzard.\n29. How often did you write to relatives or friends in your old home?\n\n30. How hard do you have to work at your job?\n\n31. How much money do you make per year?\n\n32. How many children do you have?\n\n33. How many years have you been married?\n\n34. What was your husband's occupation?\n\n35. What was your wife's occupation?\n\n36. How many years have you been married?\n\n37. What was your husband's occupation?\n\n38. What was your wife's occupation?\n\n39. How many children do you have?\n\n40. How much money do you make per year?\n\n41. How hard do you have to work at your job?\n\n42. How often did you write to relatives or friends in your old home?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMcNAMARA, J.J., 1862-1895 - J married Donald S.\n\nMcNAMARA, a leader of the Great mining rush two decades ago.\n\nIn 1900, he was given the land office in Regina where he lived for twelve years, a very short time compared to the charge of a very busy place.\n\nDuring the last few years of his life, he moved away during the 1900s.\n\nDid many return?\n\nAND NOMINEE, D.M., many years.\n\n35. If you or some member of your family have held public offices, or have been active in any organizations, mention when, where, and what offices.\n\nDONALD S. McNAMARA, who was elected to the Regina City Council in 1887.\n\nWhen he acquired the property in 1887, he moved back to Regina in 1900.\n\n1898 years owning land in Regina.\n\nCharge of the Provincial Land Office until 1906.\n\nWhich he obtained a real estate license under the Act of 1887.\n\n36. If you or any of your family or friends were involved in any way, do something in the district mentioned here, giving dates wherever possible. (Such as opening the first automobile, combining, organizing the first lodge, etc.)\n\n(The six original members of Regina's Old Timers' Club in 1882 were:\n\nDonald S. McNamara\n\nJohn McNamara\n\nNeil McNamara\n\nArchibald Macdonald\n\nDoctor Rossillivray\n\nDonald Redougan)\n\n37. How did the places in your community get their names? (School districts; Post offices; Villages; railway stations; creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) year and naming of the name; (3) date of its adoption; (4) any changes in names since above in (1); (5) date and reason for change.\n\nGive facts of new names as above.\n\nThe permanent name of Prince Louise was given by Donald S. McNamara.\n\nTheir city name came from Vancouver January 1st, 1944.\n\nDONALD S. McNAMARA, a resident of Regina, Victoria and Alberta.\n\nIn this year 1918, we moved from Regina to Vancouver.\n\nWe moved to Vancouver where Donald died in service.\n\nWe went to Vancouver where Donald died in service.\n\n1925\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nMcCannell, Donald, 1862-1953, married Donald S.\n\nMcCannell, a leader of the Great Selkirk Rebellion in 1885, was born in St. Croix, Minnesota, in 1862. He lived for twelve years during the winter of 1885-1886 at Red River, Manitoba, where he joined the Red River Rebellion. In 1886, he moved to the Red River Colony and became a member of the provisional government. He was elected to the Legislative Assembly of Manitoba in 1887 and served until 1892. He was appointed a Justice of the Peace in 1892 and served until 1896. He died in 1953.\n\nDonald S. McCannell, born in St. Croix, Minnesota, in 1862, was educated in the Red River Colony and became a member of the provisional government. He was elected to the Legislative Assembly of Manitoba in 1887 and served until 1892. He was appointed a Justice of the Peace in 1892 and served until 1896. He died in 1953.\n\n35. How did the names in your community get their names? (School districts, Post offices, Villages, railway stations, creeks, hills, etc.) Give (1) name and occupation of person suggesting place-name (2) street-name and date of its adoption (3) date and reason for change.\n\nThe permanent name of Prince Louis was given by General Marquis de Lorne, in honour of his late brother.\n\nThese are the names in Valence: January 1st, 1944\n\nDonald S. McCannell, in honour of Prince Louis.\n\na.g.d = 89 years old\n\nIn this year 1944, we moved from Regina to Victoria and typewrote the card above with the hopes that it would be sent to Vancouver when we were able to arrive. We went to Vancouver in 1945.\n\n1945\n32. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written reminiscences and reminiscences? (Describe)\n\nI am including a copy of photographs of the military men of Regina who had organized a group of soldiers when the need was felt during the Rebellion. Would you be willing to lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan.\n\nIndicate your preference, if any.\n\nNO CHOICE\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMARY FRASER MILLER (LEWIS) BARBER, born January 18, 1918, died July 15, 1976, aged 58 years.\n\nSON DONALD MORGAN MCCANNEL, born February 22, 1918, died September 29, 1978, aged 60 years.\n\nSON NEIL ROSS MCCANNEL, killed at Mons, France, November 5, 1918, aged 20 years.\n\nSTUDENT.\n\nGRANDCHILDREN - MARGERY LEWIS - NURSE - LONDON, ENGLAND - HOME\n\nHARRY ROSS LEWIS - FRUIT IMPOSER - REGINA - HOME\n\nSARAH ROSS - HOME\n\nJOHN D. ANDERSON - SPECIALIST - M.D. - REGINA - HOME\n\nW. O. ANDERSON - AUTOMOBILE REPAIRER - REGINA - HOME\n\nDOUGLAS R. ANDERSON - STATISTICS - REGINA - HOME\n\nBOBBY ANDERSON\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThe person who answered this questionnaire was addressed\n\nMrs. D. S. McCannel has filled in this questionnaire. Age 91 years +\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written reminiscences, old newspapers, old programs, minutes books of community organizations, old pamphlets, old photographs, written reminiscences and reminiscences? (Nearby)\n\nI am enclosing a copy of a photograph of the military men of Regina who had organized a group of soldiers.\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preferences, if any:\n\nNO - CHOOSE\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSON - HEIL ROSS MCCANNEL - KILLED AT MAINZ, FRANCE 2 NOV. 5 1918\n\nGRANDCHILDREN - MARGARET LEWIS - NURSE - LONDON, ENGLAND - HOME\n\nHARRY ROSS LEWIS - FIRST IMPERIAL ORDER REGINA - HOME\n\nJOHN D ANDERSON - ACTOR - WINNIPEG - HOME\n\nMRS. D S MCCANNEL - REGINA - HOME\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThe person I wish to be interviewed is Mrs. McCannel Age 91 years +\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_434.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6276, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1893, 5], [1893, 3705, 6], [3705, 5047, 7], [5047, 6244, 8], [6244, 6850, 9], [6850, 7420, 10], [7420, 8484, 11], [8484, 9982, 12], [9982, 11761, 13], [11761, 12766, 14], [12766, 15499, 15], [15499, 16134, 16], [16134, 16134, 17], [16134, 16134, 18], [16134, 18209, 19], [18209, 19875, 20], [19875, 21679, 21], [21679, 23038, 22], [23038, 23193, 23], [23193, 23344, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]