[{"id": "011d83e83e9c481eb2345560e1812b6a536c47c8", "text": "1. What led you to the particular district in which you settled? \n   - Word from a friend who homesteaded there\n\n2. What was the extent of this information and what alternatives did you consider?\n   - He merely said that this is 34-94-11.\n\n3. What was your previous experience in farming?\n   - Worked for 1/2 acre of stover for 5 years at Breendonk, Man in 1903\n\n4. Did you have any other land (homestead, range, etc.)?\n   - No\n\n5. What other land did you purchase?\n   - South west 1/4 of 34-94-11, known as g\n\n6. How many acres of Homestead Company land, C. P. R. land, or school land?\n   - 160 acres\n\n7. What was the purchase price per acre?\n   - $1.50\n\n8. What was the largest amount you purchased at one time?\n   - $1,500\n\n9. How much land did you purchase?\n   - 160 acres\n\n10. What was the date of your purchase?\n    - 1909\n\n11. What was the date of your settlement?\n    - 1909\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 6\nPlainsman Pioneering Superintendent.\n\n1. What led you to the particular district in which you settled?\n   Word from a friend who homesteaded there.\n\n2. Through what information about it obtained?\n   The story by me that this is 9494.11.\n\n3. What was the extent of this information and what alternatives did you consider?\n   This plot of land was vacant but faced 1/2 acre of slopeworth worked for 2 years at Brandon Man in 1903.\n\n4. What was your previous experience in farming?\n   It was under what circumstances did you learn?\n\n5. Did you homestead? Yes\n   If so, give description of the land (township, range, distance from the railway).\n   Where, when, and how did you file your homestead entry? In October 1904 and filed in Battleford forges in March of next year.\n\n6. How much information did you have about the land when you filed your entry?\n   Much filled on without survey or map.\n\n7. Did you obtain a pre-emption?\n   No\n\n8. What other land did you purchase? South west quarter 316.1 acres.\n\n9. What was the purchase price per acre?\n   $5.50 per acre.\n\n10. What was the total amount you purchased at one time?\n    (from draft)\n\n11. Three quarters 480 acres\n7. Did you retain the original homestead? Yes\n\nIf you moved, tell where and for what reason.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n\nHow did you finance your original purchase of land? Paid cash if you could in cash and the balance was one third of every mortgage.\n\nDid you at any time mortgage your property or obtain loans? Yes\n\nWhat interest rates did you pay? 5% per cent\n\n9. What were your first buildings? (Give dates). Book Sheds 1905\n\nplaced a man to put it up\n\nWhat material was used and where was it obtained? Wood from a dry\n\n10. What type of farming did you engage in, originally and later? (Grain, yes)\n\nlivestock, mixed, etc.) yes\n\n11. How many acres did you break the first year? five acres 1905\n\nThe second? 10 acres\n\nThe third? 45 acres\n\nDid you use oxen, horses, or steam power for breaking? Tell fall 1909 then buy horses\n\n12. What breaking crop did you grow? Wheat\n\nWhat other grains did you grow? Oats\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?)\n\nshort horn here circa 1909 then in 1915 heifers\n\nthree and some young stock and about 15 pigs\n7. Did you retain the original homestead? Yes\n\n8. If you moved, tell where and for what reason. Moved to Petrolia in 1941 because my wife fell cancer and had to be close to doctor.\n\n9. How much did you pay for the land? $500\n\n10. How did you finance your original purchase of land? Paid cash\n\n11. How long was it before you had completely paid for your land? 1925\n\n12. Did you at any time mortgage your property or obtain loans? Yes\n\nWhat interest rate did you pay? 6% per cent\n\n13. What was your first building? (Give dates). Good shack 1905\n\n14. What material was used until where was it obtained? Wood from a dry shed\n\n15. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.) Yes\n\n16. How many acres did you break the first year? Five acres 1905\n\nThe second? Ten acres\n\nThe third? Nine acres\n\nDid you use oxen, horses, or steam power for breaking? Tell full 1909 then change horses\n\n17. What other grains did you grow? Oats\n\n18. What kinds and breeds of livestock did you raise? (Give dates at which started each, if discontinued, date)\n\nShort horn beef cows 1909 then 1916 herd\n\nThree and some yearling stock and about 15 pigs\n11. If you used oxen, how many did you have? \n   When and where did you obtain them? \n   Did you have any memorable experiences with them? \n   Did you have any memorable experiences with them? \n\n12. In fall 1907 was taken wheat to Saskatoon \n    had sleds by buyer and there was open in middle \n    where did you first use horses for motive power \n    where did you obtain them in 1909 at sale close to a \n\nMr. Robinson\n\nWhat was the largest number of horses you kept? mine\n\n16. With what machinery did you start farming? \n    When if ever going them three furrow \n    Mr. Lanchon had one approximately 15\n\n17. What was the first tractor you used and when? \n    Was it used for belt power or for field power? \n    If this was not the first tractor in your district, do you remember the \n    first? give details.\n\n18. To what extent did other farmers of the family assist in farming operations?\n\nWhat was the first hired help you had? \nWhat wages were paid? \nTo what extent did you make use of hired help during your farming career?\n\n19. Do you recall examples of informal co-operative efforts in your district, \n    such as neighbors working together, \"beef,\" etc.? \n\nMonday we worked together \ngetting the co-op elevator going \nand building a community hall in 1909 \nand a little in use for church Hope Hall\n14. If you used oxen, how many did you have? \nWhen and where did you obtain them? \nDid you have any memorable experiences with them? \nDid you have any memorable experiences with them? \n\n15. In fall 1907 was taken wheat to Saskatoon \nhad shipped by buyer and there was open in middle \non loggin hard water and there was open in middle \nin fall 1909 at sale close by a \nMr. Robinson \n\nWhat was the largest number of horses you kept at one time? \n\n16. With what machinery did you start farming? \nWhen did you start farming? \nWhen did you start farming? \nWhen did you start farming? \n\n17. What was the first tractor you used and when? \nWas it used for belt power or for field power? \nIf this was not the first tractor in your district, do you remember the first? \nGive details. \n\n18. To what extent did other farmers of the family assist in farming operations? \nWhat was the first hired help you had? \nWhat wages were paid? \nTo what extent did you make use of hired help during your farming career? \n\n19. Do you recall examples of informal cooperative efforts in your district, such as neighbours working together, etc.?\non my Homestead 4 Nov 1834\n\n[signature]\n\n[signature]\n20. Did you follow the practice of summer fallowing to begin with? No\n   If not, when did you begin? 1909\n\n21. What rotation of crops did you practise?\n\n22. Where did you obtain your original seed? From neighbors\n   What was the variety? Red fife then Marcella in 1914\n   The price? 80 cents\n\n23. What was the earliest date of seeding you recall? (Give year). 1905\n   The latest? 1909\n   What was the earliest date of harvesting you recall? October\n   The latest? 1911\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, damage, methods of control, with respect to the following: hail, frost, wind and dust, blizzards, floods, drought, prairie fires, rust, smut, grasshoppers, cutworms, sawflies, caterpillars, mosquitoes, hawks, gophers, coyotes.\n\n1911 heavy frost here & inch of ice three nights crop badly frozen did not get it all through till spring 1912 tough and damp after drying got 30¢ per bucket would have been better to have burnt it. In 1916 bad hail storm about Aug 5th or 6th all hailed out, only need 40 per cent instead of 100¢ from Municipal hail insurance of Regina never suffered any more worse Hailstorm I have seen not sound but slugs 2 to 3 inches long suffered also from dust part of crop blown out in 1930, and 33 and 1937, breeks no crop suffered some from sawfly and Hoppers\n20. Did you follow the practice of summerfallowing to begin with? If not, when did you begin? 1909\n\n21. What rotation of crops did you practice?\n\n22. Where did you obtain your original seed? From neighbor.\n\nWhat was the variety? Red Pipe from Marcus in 1914\n\nThe price? $0.50 per lb.\n\n23. What was the earliest date of seeding you recall? (Give year): 1905\n\nWhat was the latest date of harvesting you recall? September\n\nThe latest? 1911\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, damage, methods of control, with respect to the following: hail, frost, wind and hail, blizzards, floods, drought, pests, rust, smut, grasshoppers, cornborers, earworms, cornsmut, cornstalk borers, hawks, crows, etc.\n\n1911 heavy frost here & ruined our three mighty crops badly frozen did not get it all through till spring 1912. Drought and dearth after drying got 30 per bushel would have been better to have burned it\n\nIn 1916 bad hail storm about May 4 or 6th\n\nIn 1916 only seed 40 per acre\n\nall harvest only 100, from University plot\n\ninstead of 100, from neighbor's plot\n\nImprovement of Red Pipe never noticed any more worse hailstorm I do three inches leaf round July 1st, 18 inches after crop brown dory deadford also from last part of crop never ate red in 1930, and 33, and 37, dory stays no crop red, deadford some from dory and Hopkins\n25. What weeds were present in your district when you first arrived and which were most common?\n\nStink weed came in from seed a neighbor had bought. Had to pull it and burn it, not spraying them day, me and wife spent hours at night pulling.\n\n26. What new varieties of seeds appeared after you settled? (Give date of appearance if possible).\n\nLamb's quarter, mushing, thistle, tumbleweed, mustard, wild oats, shepherd's purse.\n\n27. What method of harvesting and threshing grain did you first use?\n\nBy binder and had crops threshed by neighbor steam outfit.\n\nFor any new ones required in these operations? Cutting by hand myself at first, then used a binder.\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\n1904 wheat hauled to Saskatoon with own team and after 1904 horses.\n\nWas most of your grain hauled in the fall, or did you do winter hauling with team and sleigh?\n\nMostly in fall and in winter by sleigh.\n\nSo what point?\n\nForty-five miles, seven miles, nine miles.\n\nWhat prices did you receive?\n\n29. Was the first elevator ever used for loading grain in your district? (Give dates).\n\nNO\n\nIn what year was the first grain elevator constructed in your district by what company?\n\n1909 by city, in 1930 by Wheat Pool.\nA sick breed came into your house and a neighbor had thought to pull it out but not to worry as might feeling.\n\nfamily member, raising their heads, turned.\n\nturning mustard until oats, shepherds, purse\n\nby binder and had crops checked by neighbor, became no gift.\n\nthese may well additional, every day.\n\n1907 wheat finished to bush hollow until own end of May 1909 harvest.\n\nmostly in fall and one written by Lloyd.\n\nfor forty five weeks growing quickly, growth.\n\nno\n\nTo whom you will the dates this statement submitted to your supervisor.\n\nby hand signature 1909 Wheatfield\n\nand 1930 Wheatfield Food\n30. What variations do you recall in prices for your produce? the highest? the lowest?\n   thirty cents per bushel 95 cents\n\n31. Did you engage in ranching? No\n   If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by procuring registered seed, purebred livestock, etc.?\n\n33. Did you participate in any exhibitions or fairs? Yes\n   Indicate the nature of your exhibits and the prizes won.\n   Horses and prizes\n\n34. What agricultural organizations did you join? Tell when and for how long.\n   Cooperative Company\n\n35. Did you raise poultry? Some\n   Was this for household use or for market? Mostly household\n   When did you first buy chicks from hatcheries?\n\n36. When did you commence gardening? Depend on the season\n   What garden crops were then grown? Potatoes, cabbages, etc.\n30. What variations do you recall in prices for your produce? \n   Thirty cents per bushel, please.\n\n31. Did you engage in ranching? Yes\n\nIf so, give details as to kind and number of cattle. In the early years of \nthe ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock—\n   *Note: Purchased seed, purchased livestock,\n\n33. Did you participate in any exhibitions or fairs?\n   Indicates the nature of your exhibits and the prizes won.\n   *Note: Cooperative Company\n\n34. What agricultural organizations did you join? Tell when and for how long.\n   Cooperative Company\n\n35. Did you raise poultry?\n   Yes, for household use or for market.\n   When did you first buy chickens from hatcheries?\n\n36. When did you commence gardening?\n   *Note: On the season\n   What garden crops were then grown?\n   Potatoes, cabbages, etc.\n7. Were seeds obtained? Local\n\nWhat were some of the varieties planted?\n\n27. Did you have native trees about your farmstead? No, just five poplars.\n\nWhen did you first plant trees, if any? 1917\n\nWhat kind? Willow, elm, sycamore\n\nAre they still living, or did they die out after a period of time?\n\nIf so, any special cause? Yes, lots of them so unhealthy, fell high ones all around my buildings.\n\n28. When did you fence any significant part of your land? 1910-1925\n\nWhat was your reason for doing so? To keep my stock in and others out.\n\nWhat type of fencing was used? Pago around 12 acres of hedges and Barb & Point around my three 4.\n\n39. Did you ever attempt to irrigate gardens or crops? No\n\nTo what extent? (Give dates).\n\n40. How was milk kept and cream saved? In the basement.\n\nWhen did you get a cream separator? 1912\n\nWhat kind of churn did you use? Manual\n\nWhat quantities of butter were made? About seven lbs per week.\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? In trade by local merchants.\nThere were seeds obtained:\n\nWhat were some of the varieties planted?\n\n37. Did you have anything to do about your farm during the war? (Just fill in options)\n\nWhat did you think plant would be worth in 1914?\n\nWhat kind of Willow Elm, Caragana\n\nAre they still standing or did they die out after a period of time?\n\nIf so, any special causes why lots of them so unhealthy\n\nDid high prices all around my buildings\n\n38. What did you think was going to happen at your house by 1910-1925\n\nWhat was your reason for not doing?\n\nWhat type of fencing was used?\n\nRange around 12 acres of land\n\nand Barn & Povency surrounded with fence\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates).\n\n40. How was milk kept and cream saved in the basement?\n\nWhen did you get a cream separator?\n\nWhat kind of cream did you use?\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchant?\n\nin trade by local merchants\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? \n\nNO\n\nHow were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\nYes called twice 1904 do not remember names\n\n44. Was there ever an extra large or \"bonanza\" farm in your district?\n\nIf so, what was its size and who was the owner?\n\nNO\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Whom do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\n42. Did you keep bees or do you remember anyone else keeping bees in your district? Yes\n\n43. Do you recall members of the North Meat Board Polling Station? Give any details about the frequency of these visits, names of poll-takers, dates.\n\nYes, called twice 1909 do need recounting.\n\n44. Was there ever an extra large or \"Boronia\" farm in your district? If so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. When do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice such as the earliest, most successful, most helpful to innovation, contributing most to the public life and development of the community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3473.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5362, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 883, 7], [883, 2093, 8], [2093, 3360, 9], [3360, 4532, 10], [4532, 5841, 11], [5841, 6958, 12], [6958, 6958, 13], [6958, 7011, 14], [7011, 8364, 15], [8364, 9751, 16], [9751, 11005, 17], [11005, 11606, 18], [11606, 12538, 19], [12538, 13427, 20], [13427, 14462, 21], [14462, 15441, 22], [15441, 16492, 23], [16492, 17436, 24], [17436, 17583, 25], [17583, 17737, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]