[{"id": "c8418b079540d0608789b6df25f60425758e4913", "text": "S-X2\n620. Cameron Jessie E. (Mrs. John Roderick)\nS-X2\n620. Cameron Jessie E. (Mrs. John Roderick)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n_________________________\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF APPRECIATION TO THE PERSON\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about answering blank spaces. The purpose of this interview is to get information about the pioneer life in Saskatchewan, Canada, before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer States: What Did Western Canadian Pioneers Get?\" is still being distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nX All questionnaires\n[ ] Pioneer health conditions\n[ ] Pioneer social life, sports and recreation\n[ ] Pioneer housing\n[ ] Pioneer education and churchwork\n[ ] Pioneer farming experience\n\nInstructions of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nCultural Resources Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Jessie E. Cameron\n2. Your address: Elrose, Sask.\n3. Date: March 17, 1952\n4. Where were you born? (Give name of place and country): Dundee, Ontario\n5. What was your father's name and occupation?: Donald Alexander Chisholm - Farmer\n6. When did you come to Saskatchewan? (Give month and year): August 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Montreal - 1899-1901 -\n   Rest of my life up to then at Dundee, Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n\n9. What were your reasons for coming West? Newly married - had married August 14, 1901 - and left for the west Aug, 15/01\n   Parents were strict in those days, and were particular as to who your son met - I just about committed a crime in those days when I married a Conservative,\n   my parents were Liberal - so my marriage was just about an abomination with my very gay\n   and the West called us.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?:\n    Through other people - friends & relatives who had come ahead of me - 5-1 years ago.\n    Reading matter was scarce and all we knew about government was \"Laurier\"\n    \"John A.\" and the C.P.R. ? and somehow\n    after Candidates were elected, ?\n1. Your full name: Mrs. Cameron Jessie E. (Mrs. John Roderick)\n\n2. Your address: 2114544 B Rd., 1981\n\n3. Date: March 1981\n\n4. Where were you born? (Give name of place and country): Germany\n\n5. What was your father's name and occupation?: Donald Alexander Christie - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): August 1941\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n\nMontreal - 1949-1941\nMontreal - 1949-1941\n\nPartly my life up to then at Stranaglen, Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not have been there at that time).\n\n9. What were your reasons for coming West? (If so, explain):\n\nMarried August 1941 - and left for the west and stayed\n\nParents were sick - they died and we promised to take care of our children\n\nWe came because we heard about a better life\n\nMy parents were very poor - we came to try our luck\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information)?\n\nThrough other people - heard from friends\n\nHad a letter from someone who had been there\n\nRead \"Street Guide\" and \"P.M.\"\n\n\"John A.\" and \"The Canadian Pacific\"\n\n\"I am a Canadian\" book by John Ross Robertson\n11. What did your friends and relatives think of your decision to come to Western Canada? Friends and relatives thought we were foolish and the western ones thought we were wise.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We traveled during an harvest season to the west and we were met by happy large family. All easterners.\n\n13. What means of transportation did you use? By train. A goodly number of the immigrants planned to return but there were several who planned to remain in the west.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). When we arrived at Winnipeg we were told that 900 unemployed and no chance for the Easterners to get hard work. The newly arrived were too full of spirit to worry. My husband said \"Let's go on to Brandon. I have been there three times.\" I said \"OK. I am game.\" However we met a farmer and he advised us to go on to Brandon and then we looked to settle until the following spring with a farm with a large acreage.\n\n15. Where did you first stay when you arrived in Saskatchewan? Sask., N.W.T. (This was in 1902 before Scott was formed.) We worked on the farm of Mr. Stewart, we picked cotton because Mr. Stewart could not afford to pay us.\n\n16. Where did you settle or take up land? We homesteaded in 1908 at Franklin, Sask., and still own the land that we purchased.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Borewood in 1941, and came to live at my daughter's house in Elmore in 1943. At that time I was working on a farm in Ontario. Then in 1945 at 65 I took up Indian work on the farm and started with the Sask. Indians in 2 years. We paid $1500 for the land.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Earning a living in my young days was the best. I was a woman - my parents farmed and they were able to work - and lots to eat - and I could turn out so many young people to earn their living. After we came by ourselves with each other to build and develop our lives in Saskatchewan, that was earning living.\n11. What did your friends and relations think of your decision to come to Western Canada? (List names, places, etc.)\n\n12. Did you travel by yourself or with a party? Family, friends? Or other group?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Mention any other places where you have lived since coming to Saskatchewan\n\n17. How did you earn a living before coming here?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFriends thought we were foolish and the western ones thought we were wise.\n\nAnd we were for the \"Open Spaces\" of life.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nTravelled during an harvest season to the west and we were met by happy large family of Easterners.\n\n13. What means of transportation did you use?\n\nBy train. A good number of the immigrants planned to return, but there were several who planned to remain in the west.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWhen we arrived at Winnipeg, we were told that 900 unemployed and we changed for the Easterners to get harvest work. The newly widowed too fell into despair to worry. My husband said, \"Let's go on to Brandon, I have two weeks' time,\" and \"OK, I am game.\" However, we met a farmer and he advised us to go on to Brandon. And then we worked to gather until the following spring with a farmer with a large acreage.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSask., N.W.T. (This was in 1902 before Saskatchewan joined. We worked on the farm of Mr. Stewart, who later became Commissioner Stewart. But this story is not very interesting.)\n\n16. Where did you settle or take up land?\n\nWe homesteaded in 1908 at Pincher Creek, Sask., and still own the land that is my son's.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nResided in 1941, and came to live at my daughter's house in Calgary. In 1943-44 I let 63 year old man work in Ontario. Then in 1945-65, took up Indian work in the prairies, and then with the Scott Andrews for 2 years - my place at Balcarres, Sask., then at White Bear Reserve, Carlyle, Sask.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nEarning a living in my young days was the best job. Working - my patience, hard work and time was lost - work - and lots to eat - and a good time with so many young people to be around with. After we came, by helping each other to build and develop our (Saskatchewan), that was earning a living.\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\n12. Did you travel by yourself or with a party (family, friends or other groups)? \n\n13. What means of transportation did you use? \n\n14. What hardships of the journey have you remembered? (People you met on the way, meetings with Indians, experiences on the prairies, accidents or other conditions.) \n\n15. Where did you first stay when you arrived in Saskatchewan? \n\n16. Where did you settle or take up land? \n\n17. Mention any other places where you have lived since coming to Saskatchewan. \n\n18. How did you earn a living before coming to Western Canada? How after you came? \n\n19. Any other comments? \n\n20. Any advice to others who may be considering coming to Western Canada?\n19. How often did you write to relatives or friends in your old home?\n\nAlways, fondly writing — and for a long time.\n\nMy letters were weekly ones.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried day before we left for the West.\n\nJohn Rodenbeck Cameron, August 14, 1921 — Dundurn.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes — two brothers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nTwo brothers before 1910.\n\nBoth homesteaded north of Forget, Sask.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes — the enthusiasm & newcomers to the west.\n\nTo subscribe to pioneer newspapers — and to daily\n\nTo weekly papers — and hear songs we all wrote\n\nTo dreams local, musical, humorous\n\nHappenings when young girl & fifteen\n\nThis was only one little observation — There\n\nare stories of pioneer happenings I could mention\n\n— enough to fill pages — but time will not\n\nallow — (not to fill up the space)\n\nThe enthusiasm & homesteaders to develop the prairies\n\nnotable.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOh yes — The pioneer days were friendly happy days.\n\nSo different from the \"Turkey-trot\" today — In the\n\nearly days we were afraid the friends & relatives\n\nwould not come to see us — nowadays we are afraid\n\nthey will come. Then rural school (social times)\n\nwere life savers, and with church activities and\n\nmeeting neighbors, we did not have to go over 4 or\n\n5 miles. Means of travel at first were wagons —\n\nthen buggies.\n\nWe attended all the pioneer, hall games —\n\ndances — in the Surrounding villages & districts.\n\nWe had to attend — to keep established there\n\nand to help build up our province.\n25. When was the first car used in the community? 1916\n\n26. If you owned a car before 1914, when did you buy it? What make? ✔\n\n27. Where was your trading center? How far from your home?\n   Village of Fundalater — 4 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes — My husband always advised the support of your own home village or town and to this day my son and I are believers in dealing in the place you get your mail.\n\n29. How often did you shop in the early days? Once a week — usually on Saturday afternoons\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   It was the custom in the home — Standing day to take Saturday afternoon off, to go to town.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   From 1905 on — and usually clothing — we carry apparel and bedding — and any other article that was not in our village stores.\n   Could not state the fraction of total purchases by mail order.\n   There do not seem to be much of a change in the mail order purchases — as well many of the smaller villages of towns do not handle clothing — and those who do — handle out-of-style wearing apparel — and goods.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Oh no! — We thought we could make enough money in the west — less than 10 years to buy a real nice home in Ontario. That's something that happened the building of homes in the West, so many thought so we did.\n   The longer we stand, the harder it was to go back East — Then when our children were of school age — we knew the West was our future.\n25. Then was the first car used in the community? 1916\n\n26. If you owned a car before 1917, when did you buy it? What make?\n\n27. Where was your trading station? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new postal appearance, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did you first begin to buy through the mail order catalogues?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of purchases made by mail order and what percentage in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. Then you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after seeing it out? When did you make this decision?\n\n34. Then you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after seeing it out? When did you make this decision?\n\n35. Then you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after seeing it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo, people were moving in to our district. We happened to be in the one of the best homestead districts in South Dakota as far as the climate. The people who came here were German, Welsh, English, Hungarian, Swedish and Scottish.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, a fairly number went to North part of province, and very few, if any, returned to the same district.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was Commissioner of P.M. 190 for 7 years and school teacher for several terms, 1917-1925. For myself, I have held an executive position in the various organizations I belonged to. Was Provincial Secretary, 1927-1930. Village President, Sec. Treas., 1930-1942. Telephone Co. Sec. Treas., 1935-1942. Only women in province to be Administrative Manager, with following positions. In the 30's my work among boys was greatest. My story would take too long to tell any one.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nFirst School Meeting was held in our homestead shack to organize a School District in 1907. My husband was one of the first trustees.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1); (2); (3).\n\nOur School District - \"Edwards\" was called after an old settler, the late Charles Edwards who lived there 93 yrs. of age.\n\n\"Elrose\" was called Elrose by one of the first settlers here who came from a town in the U.S.A. called \"Melrose\". He was fond there was another \"Melrose\" on the prairie so they took off the \"M\" and called it Elrose.\n\nSee \"Elrose\" for later information.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe only old records I have is a minute book of Brown Grove Church of the early 1800s. That is the Women's Section of the G.A.F.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n3 grown up & happily married in homes. Their sons:\nRodriek A. Cameron - Findlater, Sask., James\nMrs. Joe Donaldson - Elrose - Husband, Bob, daughter, Janet\nMrs. Helen Grey - Elrose - Farmer\n\n5 grandchildren - Dale Cameron - Cameron Grey,\nHeather Grey - Wayne Grey - Mrs. Lloyd Baines\n2 great grand children - Sheri and Sandi Baines\n\n41. What do you think are the most important changes in your community since you first came West?\n\nHome life is not what it was on the early days. Of course a great development has taken place - with the schools, churches, roads, telephones, cars - and radios! But home life suffers - Parents are too busy to pay much attention to the spiritual needs of the child - all attention to the spiritual needs of the child - the greatest need of the world today. To keep up with the times - too many of us are working life out - to keep life in.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nRodriek A. Cameron, Findlater, Sask.\nMrs. Ed. Grey, 101-27th St., Saskatoon, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n___________________________\n___________________________\nQuestions regarding historical records materials:\nDo you have any photographs or do you know the whereabouts of diaries, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you be willing to lend them to the Provincial Archives for display?\n\n(1) Be willing to present them to the Archives (Division of the Legislative Library), (2) Be willing to present them to the Archives Office at the University in Kingston.\n\nIf so, please give the following information:\n\nName of person who owns them:\nAddress:\nPhone number:\nDate of birth:\nOccupation:\nPlace of residence:\nPlace of birth:\nPlace of death:\nAny other information you think might be useful:\n\nIf you have children or grandchildren, please give their names, where they live and occupations:\n\nWhat do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. B. E. Terry,\n101-27th St., Scarborough, Scarborough,\n\nIf anyone else has filled in this questionnaire for you, please state his name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe only old records I have is a minute book of Grain Growers' Grade 2 Bank of the early 1920s. That is the Women's Section of the G.G.A.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?...\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n3 grown up children married in homes of their own:\nRodger A. Cameron - Kindlater, Sask., farmer\nMrs. Joe Donaldson - Elrose - Husband, Bob Stewart, farmer\nMrs. Glenn Grey - Elrose - farmer\n\n5 grandchildren - Dale Cameron - Cameron Grey\nHeather Grey - Wayne Grey - Mrs. Lloyd Barnes\n2 great grandchildren - Sheri and Sandi Barnes\n\n41. What do you think are the most important changes in your community since you first came West?\n\nHome life is not what it was in the early days. Of course a great development has taken place - with the schools, churches, roads, telephones, cars and radios. Home life suffers. Parents are too busy to pay much attention to the spiritual needs of the child - all attention to the material needs of today. To keep the greatest need of the world today, to keep up with the times - too many of us are losing sight of life but to keep life in \"working life out to keep life in\"\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nRodger A. Cameron, Kindlater, Sask.\nMrs. Ed. Grey, 101-27th St., Saskatoon, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n__________________________\nWould you or the person who owns them allow:\n\n1. To be willing to lend them to the Provincial Archives for exhibition?\n2. To be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf so, please give your name and address.\n\nIf not, please explain why.\n\nIf you have children or grandchildren, please give their names, their ages, and occupations.\n\nWhat do you think are the most important changes in your community since you moved here?\n\nPlease give your name and address.\n\nIf someone else has filled out this questionnaire for you, please have this person give name and address here:\n\nMiss. E.E. Gray, 101-27th St., Saskatoon, Sask.\nElrose\n\nElrose was known originally as La Berge, after Albert La Berge who was a pioneer farmer here and who operated on a large scale. The question of changing or not changing the name came up at a meeting of the people in the late fall of 1913, and a Louis Chibert, who was in the building and contracting business at the time, suggested Elrose and this was favored by the majority and accepted by the C.M.R. The coming of steel in 1912 speeded up the growth of the little burg and establishment have continued to expand to this day. The first train came in 1913.\n\nThe first settlers were all squatted on the area east of the present site (what is now No 4 Highway east of town) when the C.M.R. surveyed they chose the present location and they all moved. It was an spectacular race for first rate business locations for those who got the first rate business locations through Elrose and Highway No 44 is 1/2 mile north of Elrose.\n\nAbove is information spot from old timers here.\n\nJ.E.C.\nElmo\n\nElmo was founded by Mr. Albert de Ruyter who came to Texas from France. He bought land and built a house in 1893.\n\nThe name came up at a meeting of the building committee who were in the building and contracting business. The name was suggested by Elmo and the name was accepted by the C.M.R. Railroad Company in 1912.\n\nThe original townsite was located near the railroad tracks. The town was incorporated in 1913.\n\nThe first settlers were Mr. and Mrs. Smith. They came from Illinois. They arrived in Elmo in 1914.\n\nThey moved into the present location and they built their homes there. They also operated a store for the residents.\n\nRoute 66 runs through Elmo and Highway No. 4 runs north of Elmo.\n\nNo. 44 is 1/2 mile north of Elmo.\n\nJ.S.C.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_620.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7554, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 49, 3], [49, 98, 4], [98, 2100, 5], [2100, 3836, 6], [3836, 5347, 7], [5347, 6660, 8], [6660, 8859, 9], [8859, 9467, 10], [9467, 11742, 11], [11742, 12511, 12], [12511, 14504, 13], [14504, 14504, 14], [14504, 16593, 15], [16593, 17807, 16], [17807, 20098, 17], [20098, 20098, 18], [20098, 22142, 19], [22142, 23266, 20], [23266, 25349, 21], [25349, 26073, 22], [26073, 27063, 23], [27063, 27811, 24], [27811, 27947, 25], [27947, 28102, 26], [28102, 28238, 27], [28238, 28372, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]