[{"id": "396529b95be86b40d81fbbe578f02f68d9e3c808", "text": "S-X2\n817. Almond George\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. MEAL OF INTRODUCTION TO THE PIONEER\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual experience is exactly the same. It has exactly the same experiences as another. Each question will have its own answers. There are sheets of facts which are not particularized. They are designed to answer questions. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Facts That Would Be Answered,\" will still be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects are also available at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Provincial Office at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\n\nSaskatchewan, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure how to spell a name or place, try writing it out in full. If you have any difficulty, this will be quite acceptable.\n\n1. Your full name: GEORGE ALMOND\n2. Your address: 2691 Nanaimo St., Vancouver, B.C.\n3. Date: MAR. 30, 1953\n4. Where were you born? (Give name of place and country): Hayton, Kent, England\n5. What was your father's name and occupation? James Almond, Gardener\n6. When did you come to Saskatchewan? (Give month and year): March 30, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Hayton, England\n   - Plumas, Manitoba from April 1903\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years old at that time.)\n   - I was in my teens!\n9. What were your reasons for coming West?\n   - To get away from the crowded city\n   - Want to have adventure and perhaps a better chance in life.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nIn 1903 our family included myself, a brother of settlers, and an account of a journey of settlers from England to Saskatchewan by the RMS Javas Barr.\n\nLater turned the Barn Chalmers.\n\nShocked passengers with a number of other people in the district & embarked on the SS Manitoba on the 31 day of March 1903.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMost people seemed to think it was a foolish idea, at my age.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nNorth to Ross Lake.\n\nThen down to Lethbridge & Blumberg Mtn.\n\n13. What means of transportation did you use?\n\nBy train.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nHad shoulder pain.\n\nOn the way west, there was a stage accident that prevented travel by rail on the train.\n\nThe stopping at the numerous small stations, fueling a few of the young fellows behind the railroad cars.\n\nThe train on young fellow behind the railroad cars.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaskatchewan.\n\n16. Where did you settle or take up land?\n\nHaysmiller district.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n\nWorked in the factory in England then in growing & Canada worked on the farm.\n\nTo farm experiences, later went through the day on the Haysmiller district.\n19. How often did you write to relatives or friends in your old home?\n\nAbout every week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried on April 1914, Mr. Roy A. Lamb, at Saskatoon, Saskatchewan.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, tell when they came and where they settled.\n\nNo.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell how many came and where they settled.\n\nFrom 1907 to 1919, several members of my family arrived in the district.\n\n23. Is there any particularly interesting experience of pioneer days that stands out in your memory which you would like to share with others?\n\nI recall one of the neighbors' stories about the early days. They used to travel by horseback through a backwoods forest into a pasture, and sometimes around in circles until they got lost.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc., how often were you away from home?\n\nIn the early days, travel was not easy. Travelers had to be careful to avoid getting lost.\n\nTravel on foot was common. Horses were used occasionally, but horses made their appearance and were used by the young settlers and farmers, and the young settlers had plenty of opportunity to travel.\n\nAnd plenty of opportunity to travel churches.\n25. When was the first car used in the community? about 1906\n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Where was your trading centre? How far from your home? about 10 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns approx-\n\nimately better means of travel, etc.) until 1929 our trading centre was Haydenville.\n\nthen the C.P.R. built a branch line through\n\nrun immediately abolish + several small\n\ntowns affiliated closely by.\n\n29. How often did you shop in the early days? about twice a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? I would say about 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the past ten years.\n\nWe started to buy from the mail house\n\nafter we received patents on our homesteads\n\nand would say we bought about $100 worth\n\nof our requirements by including Pool\n\nHardware Hardware Co., Foster or other\n\nthe business was reduced their prices greatly\n\nfrom $100 in the emmaville\n\n32. When did you first have a telephone and what company provided it? 1921\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you name this decision?\n\nThe early to the province with\n\nThe idea of staying and well\n\nwell satisfied.\nMy Father was deceased, also my Pilot.\n\nChairman of the Floydsmoor Board of Education.\n\nMcKean School is the largest school in Peekskill.\n\nWe had a large turnover, thankful in 1947.\n\nI myself bought the first new car in the township in 1915.\n\nFloydsmoor was named after\n\nPoveshugh Kelso, and his\n\nSchool district\n\nNellie Moore's daughter was\n\nalso married off him.\n\nTheir two most famous marriages that started off in\n\nmy immediate district.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have in my possession an enlarged photograph of the first log house built about 1906 on the Homestead.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) Immediate!\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMargaret Phillpotts, hostess in H.B Store Vanier\nP.S. Almont Real Estate\nW.T. Almont & \" Vancouver B.C.\nThree grandchildren, Joan Barry & Allen Phillpotts school age.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI would say the oil discovery and natural gas in the Lloydminster district, and the rapid growth of the town.\n\n__________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr Robert Hoetby,\nMarshall, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_817.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2446, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 24, 1], [24, 1724, 2], [1724, 3223, 3], [3223, 4463, 4], [4463, 5874, 5], [5874, 7467, 6], [7467, 7909, 7], [7909, 9398, 8], [9398, 9398, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]