[{"id": "94f6a56c9972f52db02bcf98a36ae36a09e460bd", "text": "S-X2\n269. Edwards, (Mrs. George)\nWHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Geo. Edwards\nAddress Lambourn, Sask.\nBirthplace London, England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Eastern Canada? 1910\nWhere did you set up housekeeping? Lambourn District\nWhere had you been living before that? London, England\nFor how many people did you prepare meals? Four\nHow far was it to your nearest store? Three miles\nHow often could a visit be made to the store? Each day if necessary\nWhat groceries did you usually buy in those earliest years?\nFlour, tea, sugar, syrup, salt, soda, baking powder, raisins, beans, dried peaches, coffee, beer, tobacco, coal and candles\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Imperial Household and Fine Rose\nIn what quantities did you buy it? 98 pounds\nWhat was the usual price per hundred pounds of white flour? $2.95\nHow much did you use Graham flour? None\nWhole wheat flour? None\nWas flour milled locally? No\nHow far away? 9 miles\nWhat was the price for a twenty pound bag of rolled oats? 75 cents\nWhat other grain products did you use? None\nCornmeal? No\nWhole wheat? No\nFarina? No\nOther? None\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n1909. Edwards, Mrs. Geo.\nLashburn.\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Centre, Box 100, University of Saskatchewan, Saskatoon.\n\nName: Mrs. Geo. Edwards\nAddress: Barry Lake\n\n1. PERIOD OF RESIDENCE\n   What year did you start homesteading in eastern Canada? 1910\n   Where did you come from before that? Barry Lake, England\n   How many people did you bring with you? 2\n   How far was it to your nearest store? 5 miles\n   How often could a visit be made to the store? Each day\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   In what quantities did you buy flour? 98 pounds\n   What was the usual price per hundred pounds of white flour? $3.94\n   How much did you use cracked flour? None\n   What kind of flour did you buy? Hard Red\n   Was flour milled locally? No\n   What was the price for a twenty pound bag of rolled oats? 75¢\n   Did you grind your own wheat for grinding? No\n   Did you grind your own corn? No\n   Did you raise your own grain? No\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 and 20 lb. bags.\n\nWhat was the price for a ten pound sack of white sugar? 85 cents.\n\nWhat brand of golden corn syrup did you use? Rockingham.\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt what price? 70 cents.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nBy milking cows.\n\nButter? By churning eggs? From chickens.\n\nWhat was the price of butter? 10-25 cts.\n\nDid you keep eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? By raising beef, chickens, and wild fowl.\n\nHow did you get fresh meat? By butchering own animals.\n\nHow often did you get fresh meat? Fresh by freezing in winter.\n\nHow did you preserve meat? Canned beef and pork, packed in lard.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Prairie chickens, ducks, rabbits.\n\nFor how long? About 3 months in the fall.\n\nWhat part did fish play in the family diet? None.\n\nWas the fish fresh, cured, or canned? Canned.\n\nKinds? Salmon, sardines, herring.\n2.\n\n3. SUGAR AND STARCH\n\nIn what quantity did you buy milk at last? 10 cts. 60 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 85 cts.\n\nWhat brand of molasses syrup did you use? Brandt's\n\nThat size of tin or syrup did you usually buy? 1 lb.\n\nAt what prices? 70 cents\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? Yes, from cows raised on the farm.\n\nThat was the price of butter? 10-35 cents.\n\nDid you trade for butter? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese? Cheese\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days?\n\nHow did you get fresh meat? By killing animals.\n\nHow often did you eat fresh meat? Twice a week.\n\nHow did you store meat? In the refrigerator.\n\nWas there a \"meat river\" in your neighborhood? No\n\nIf so what year was it organized? 1910\n\nDid you use canned meat? Yes\n\nFor how long? About 3 months on the farm\n\nWhat part did fish play in the family diet? None\n\nWas the fish fresh, cured, or canned? Canned\n\nKind of fish? Salmon, haddock, herring\n6. BEVERAGES\n\nWhat kind of tea did you buy? \nAt what price? \n\nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nThat other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of:\nPotatoes 1908, Cabbages 1908, Carrots 1908, Onions 1908, Turnips 1908, Beets 1908.\n\nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \npeas? \ncorn? \nbeans? \nSaskatoons? \nother foods? \n\nWhat year did you first preserve fruit by canning? \nWhat year did you first preserve vegetables by canning? \nWhat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar?\n6. What kind of tea did you buy? At what price?\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel when you last bought them?\n\nIf not, where from?\n\nThat year did you first grow your own supply for the winter of:\n\nPotatoes 1908\nCarrots 1908\nOnions 1908\n\nIn what quantities did you buy white new beans?\n\nHow did you buy prunes, (in bulk or by the box)?\n\nThat other dried fruit did you use in the earliest days? (apricots, pears, apples, peaches, lumberry, raisins, currants or others?)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by:\n\npeas?\ncorn?\nbeans?\nother fruits?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1910                                          | Boxed 10 lbs.                                    | 1 box                              | 35 cents            |\n| Macaroni              |                                               |                                                  |                                    |                     |\n| Graham flour          | 1910                                          | Bulk                                             | 4 lbs.                             | 25 cents            |\n| Brown sugar           | 1910                                          | Cans                                             | 5 lbs.                             | 25 cents            |\n| Molasses              | 1910                                          |                                                  |                                    |                     |\n| Table salt            | 1910                                          | 50 lbs.                                          | 50 lbs.                            | 50 cents            |\n| Common salt           | 1910                                          |                                                  |                                    |                     |\n| Lily white syrup      | 1910                                          | Pints                                            | 5 lbs.                             | 45 cents            |\n| Toilet soap           |                                               | Bar                                              |                                    |                     |\n| Baking powder         |                                               | Tins                                             | 5 lbs.                             | 50 cents            |\n| Baking soda           |                                               | Pints                                            | 1 lb.                              | 6 cents             |\n| Dried peas            |                                               |                                                  |                                    |                     |\n| Dried corn            |                                               |                                                  |                                    |                     |\n| Vinegar               |                                               | Bulk                                             | 1 gal.                             | 25 gal.             |\n| Raisins - seeded      |                                               | Bag                                              | 5 lbs.                             | 25 cents            |\n| seedless              |                                               |                                                  |                                    |                     |\n| Rice                  |                                               | Bulk                                             | 10 lbs.                            | 5 cts.              |\n| Currants              |                                               | Bulk                                             | 5 lbs.                             | 5 cts.              |\n| Store jam - kinds?    |                                               | Tins                                             | 4 lbs.                             | 50 cts.             |\n| Cheese (Cheddar or store cheese) | | Mixed fruits and pure jam | Bulk 15 lbs | 25 cts |\n| Vanilla               |                                               | Butter                                           |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast cake\nDid you make yeast for your own use? No\nUsing starter? Sometimes\nUsing hops? No\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder?\n| Item                  | Price |\n|----------------------|-------|\n| Soda bimuto          |       |\n| Yeast meal           |       |\n| Graham flour         |       |\n| Brown sugar          |       |\n| Molasses             |       |\n| Table salt           |       |\n| German true pepper   |       |\n| Dried eggs           |       |\n| Dried beans          |       |\n| Dried corn           |       |\n| Vinegar              |       |\n| Mustard - seedless   |       |\n| Mustard - seedless   |       |\n| Raisins              |       |\n| Currants             |       |\n| Store jam - Kluski?  |       |\n| Cheese (Cheese or store cheese) |       |\n| Vanilla              |       |\n\n1D. Baking\n\nWhat type of yeast did you use?\nDid you make yeast for your own use?\nUsing hops?\nSalt rising?\nDid you buy baking powder?\nDid you take your own baking powder?\n\nYes... No...\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1910                                   | 25¢/lb                        | Better than today.                             |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names |                         |                               | Salmon, Sardines, Herring.                     |\n| Apples - fresh              |                                        |                               | Apples fresh by the barrel.                    |\n| dried                       |                                        |                               | yes                                            |\n| Lettuce                     |                                        |                               | no                                             |\n| Tomatoes - fresh            |                                        |                               | no                                             |\n| canned                      |                                        |                               | yes                                            |\n| Bananas                     |                                        |                               | yes                                            |\n| Lemons                      |                                        |                               | yes                                            |\n| Oranges                     |                                        |                               | yes                                            |\n| Cornflakes                  |                                        |                               | 25¢/lb                                         |\n| Other prepared breakfast cereals - give names. |                         |                               | Porridge, Grape Nuts                           |\n| Pearl tapioca               |                                        |                               | yes                                            |\n| 3 lb for 25¢                |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               | no                                             |\n| Sago                        |                                        |                               | yes                                            |\n| Dates                      |                                        |                               | in bulk @ 4¢/lb                                |\n| Walnuts                     |                                        |                               | yes                                            |\n| Icing sugar                 |                                        |                               | yes                                            |\n|                              |                                        |                               | 5 cents each                                   |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) **Well**\n\nHow far was this water from your home? **About 20 yards**\n\nHow was it brought to the home? (pail, barrel, tank) **Pail**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. **PEAS PILL F. M. FIELD NO. 107 OF THE BEST IN THE COUNTY**\n\n| Item                  | Approximate Price at the Market |\n|-----------------------|---------------------------------|\n| Corn meal             | 25¢/lb                          |\n| Canned apples         |                                 |\n| Other canned          |                                 |\n| Vegetables            |                                 |\n| Apples - fresh        | 3¢/lb                           |\n| dried                 |                                 |\n| Lettuce               |                                 |\n| Tomatoes - fresh      | 2¢/lb                           |\n| canned                |                                 |\n| Bananas               |                                 |\n| Lemons                |                                 |\n| Oranges               |                                 |\n| Corn Flakes           |                                 |\n| Other prepared        |                                 |\n| Bread                 |                                 |\n| Cream                 |                                 |\n| Nuts                  |                                 |\n| Pearl tapioca         |                                 |\n| Minato tapioca        |                                 |\n| Sugar                 |                                 |\n| Dates                 |                                 |\n| Salt nuts             |                                 |\n| Iced sugar            |                                 |\n\n12. **WATER SUPPLY**\n\nThere did you get water for drinking and for cooking? (well, river, cistern, dugout)\n\nHow far was this water from your home? (well, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nAny other water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bought\nIf you made your own, did you use lye? Yes\nWhat kinds of laundry soap did the grocer handle? Royal Crown, Sunlight\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\nWhere did you get your fuel? Butts, wood off hands\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nCoal and Oil  Coal  1920\nOil  1948\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? Empress, Perry & Findlay\nWhat year was it purchased? 1910 Price? $25\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\nIron pots and tin utensils\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? About 10 years ago\nAluminum? 1915\n6.\n\n13. **SNOW**\n\nDid you buy lumber last fall? If so, how much?\n\nIf you did not buy lumber, did you make your own?\n\n14. **FIRE**\n\nWhat fuel did you use in the fall last year?\n\nThere was snow on the ground.\n\n15. **HEATING AND TYPES OF UTILITY**\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nThat year was it purchased?\n\nWhat type of fuel did you use?\n\nFor preparing food? (chili, northern, corn, roast, boil, other)\n\nWhen did you first see natural gas?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers associated with the food you purchased (give dates where possible).\n\nBalsa-panne bags! 1941 dated container and another 2 others.\n\nPaper bags\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast\nOatmeal porridge\nPancakes\nFried pork\nBiscuits\nSyrup\n\nDinner\nPotatoes\nPork\nOne other vegetable\nPudding\n\nSupper\nFried potatoes\nEggs\nFruit, mostly dried\nCake or cookies\n\n1905\n\n18. What year did you serve your first Christmas dinner in Western Canada?\n\n1910\n\nGive the menu. List those present and give their approximate ages at that time.\n\nRoast chicken, Roast pork, apple sauce\nPotatoes, turnips, Christmas pudding\nMiner pies\nMorgan brothers\nMiss Laura Sibley\nMr. & Mrs. John Tillbliss\nTom Conklin\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the date and list the members of the family with their ages at the time. State the approximate month, e.g., winter or spring.\n\n18. What did you serve for your first Christmas dinner? An Eastern Sunday?\n\n19. Were you ever reduced to almost starvation level living on rations or locally produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere aren't any but there's a difference in the products and utensils to prepare them with.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere aren't any but there is a difference in the products and utensils to prepare them with.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nPrinted Matter Only\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910A-M_269.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5416, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 33, 4], [33, 1461, 5], [1461, 2458, 6], [2458, 3665, 7], [3665, 4705, 8], [4705, 5882, 9], [5882, 6744, 10], [6744, 11211, 11], [11211, 12068, 12], [12068, 16054, 13], [16054, 17978, 14], [17978, 18977, 15], [18977, 19594, 16], [19594, 20690, 17], [20690, 21109, 18], [21109, 21800, 19], [21800, 22492, 20], [22492, 22492, 21], [22492, 22512, 22], [22512, 22667, 23], [22667, 22821, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]