[{"id": "9ef4e0012a8851bdccbf8457bcc775223d614eaf", "text": "Sometime about 1896, the farmers of the Cordis neighborhood formed a company, and during the summer of 1897 they built a grain elevator at Cordis. This was ready for the harvest that year. I am not sure how it was financed but I believe a good deal of negotiation with the railroad was necessary before a siding was built to serve the elevator. This was probably one of the earliest farmer-owned elevators in the territory of Area.\n\nEarly in this century the school board engaged a teacher named Thomas Ward, and about the same time the Anglican congregation built St. James Church, the grounds of which adjoined the schoolgrounds. A rectory was built, too, and the Rev. W. Simpson and his wife came to minister to the flock. The leading families in this congregation asked the bishop to send them a man who would not only be friendly with members of other churches but would encourage them to join in the communion service.\n\nThe school, church, and rectory were across the road from the corner of our farm. We had helped with the building expenses, and often attended the services at the Methodist church to which we belonged, was at some distance. My children attended the S.S., where they used the David C. Cook lesson helps and the periodicals. For some time I read the periodicals.\nSometime about 1896, the farmers of the county map showed around a community and during the summer of 1897 they bought a piece of land at Cowden. This was ready for the harvest that year. Some of them knew it was with the railroad was necessarily before a living was built to serve the elevator. This was probably one of the earliest farms in the county. The school board engaged a teacher named Thomas Clark and asked him to come to the territory of Cowden. A meeting was held to elect the school board members. The leading families in the congregation would be only be friendly with members of other churches who favored various services.\n\nThe school church and rectory were across the road from the corner of a farm. We had helped with the building of the church and others which are being used now at Cowden.\nthe Bible Class.\n\nUp to the time that Rev. Mr. Simpson and his wife came, there had been little neighborly among the women around Cordie. The men had their elevator company, eleven farmers had formed a syndicate and bought and operated a threshing machine, run by a horse-power. We were friendly enough, but had no regular occasions to meet.\n\nMrs. Simpson with organized a W.A., which worked as a ladies' aid for local church needs and also as a missionary society, working in connection with the German work in India. In the winter we met every week, in the homes of the members, did sewing or other needlework, took part in devotional exercises and enjoyed a social hour. Sometimes we gave an afternoon to sewing or quilting for a member, took one or two extra sewing machines to a home, and by various arrangements about cutting, lasting and finishing we often did a very worthwhile day's work for a busy mother, and earned money for our projects.\n\nWomen who have been comparatively isolated, kept home by small children, can realize what these meetings meant to us, especially as Mrs. Simpson was adept at making us all feel at home and work together pleasantly. We took our babies (I had twins) and after school\nThe Bible Class.\n\nUp to the time the Rev. Mr. Simpson came and took up his mission among the Indians around Cowichan, the Indians had their elevators constructed by the Reverend Mr. Simpson and a dynamo installed at the school. This created a thrilling atmosphere, until they had more regular services. At this time, Rev. Simpson quietly organized a W.C.T.U., which was worked as a charity aid for those church needs and also as a missionary society, ministering in connection with the Presbyterian work in Canada. In the winter we did sewing or other needlework, wrote letters, devotional exercises and enjoyed a social hour. Sometimes we gave an afternoon to sewing or knitting for a member who took our two cents during the year. We always did a very worthwhile deed, whether for a truly needy or merely charitable person.\n\nMr. Simpson also has been constantly visited by Mrs. Simpson's children, who have visited him many times. He has always been a dear friend and a constant helper. We feel ashamed and grateful for all he has done for us.\ngirls belonging to the various homes came and took charge of the little ones.\n\nDuring this time Mr. Ward, a music enthusiast, taught music in the school, and also organized a church choir. I will leave the account of what this meant to the church, the school, and indeed to the whole school system, for my daughter to tell you about, as she was really in it all.\n\nBesides the above activities, Mrs. Mrs. Simpson, utilizing the help of a varied assortment of trained people, whom they formed into the neighborhood, organized the St. James Institute. A large stable was built to accommodate the horses people drove to church, and over it, a hall for recreational and educational purposes.\n\nAfter threshing was over, meetings were held every week. Mr. Ward naturally took charge of the music, and among farmers and hired men he found singers and a violinist. An ex-circus performer took charge of part of the physical training for which horses and parallel bars were built by the young men, also a high bar. Indian clubs were provided, and another young Englishman trained a squad.\n\nHalf the evening was used for exercise, including various drills etc., half for business or literary efforts. Boys who could hardly stand up in school answered questions saw experienced men act as chairmen, secretaries, etc., and learned to\ngirls belonging to the various classes came out\nand charge of the little ones.\nDuring our time in Ward, a music\nenthusiast brought music into the school,\nand also organized a church choir. We all\nhave the dream of what this means to\nthe church, the schools, and ourselves to tell\nwhat school system you may actually be in.\nBesides the above activities, our\nstudents visiting the high school carried\na lot of work, and we also organized\nformer students and adults. A large table was\nlaid out for the church people to come\nto church and over it, a hall for recreational\nand other outdoor purposes.\n\nAfter these things were over, meetings were held\nevery week. Sometimes naturally the charge of the\nmusic and among the members, an evening\nin formal singing and a concert. An evening\nperformance and a charge of the physical training\nfor which there was also a trip to hear, perhaps\nby the young men and another young lady\nthere frequently and another young lady\n\nThere was a gymnasium\nHalf the evening was used for dinner or library\nreading until the third stanza of the next\nsong. Boys and girls would stand behind them and\nask questions, see, etc., and learned to\nbe chairman, secretaries, etc., and learned to\ntake their turns without embarrassment. There were debates, and of course refreshments provided in turns by the ladies. The young folk learned to serve on committees.\n\nToward the end of the season, the young men arranged and served a banquet with guests invited from Regina. Most of the food bought, and tables arranged by the young men. I remember once at least where some of the ladies baked rolls. There was a head table where the honored guests were seated, a young man efficiently and gracefully acted as toast master. Everything went along beautifully, and we were all proud of our country lads who could so well arrange and conduct a formal affair like that.\n\nMany of these young men have used the training received in this Institute in larger spheres, and all remember with gratitude the splendid work done in the community by Rev. Mr. Simpson and his talented wife, and Mr. Ward, an eccentric but very efficient and hard working schoolteacher.\n\nMrs. L. M. Purdy\nTake their stirring without embarrassment. Their\nown abilities, and of course enthusiasm permitted\nus to turn by this idea. The young ladies turned\ntoward the end of the evening the young\nladies arranged and served a delicious\nbuffet dinner. The ladies and ladies arranged\nthe young ladies' green under dress at their\narrival above of the ladies behind rolls. There\nwas a third table within the honored guests\nwere seated a young man's friendly hand\nbeautifully dotted all to be beautiful. Everything\naround our community ladies who could so\nwell arrange and construct a formal\naffair little state.\n\nMany of these young men have used the\ntraining received in their institutes with\nlargest hearts, and all remember with\ngratitude the splendid effort done in the\nCommunity by Rev. Ben Shipp and his\ntalented old Mr. Wood an eccentric but\nvery efficient and hardworking schoolmaster.\n\nMrs. L. M. Priddy\nAs promised by my mother, Miss L.M., firstly, I am writing some of my memories of early days at Charlie, Saskatchewan, and Peggy Creek, S.D. No. 64.\n\nMr. Thos Ward was ten years in the school, living with his stepson, Harold Talbot, well-known for a time as importer and breeder of Clydesdale horses. Mr. Ward, however, used to say that all he owned was his bucking pony, his piano and violin.\n\nHe was an unorthodox but good teacher, giving us a good grounding in the regular school subjects, but his great love was music. We sang at least four times a day, beginning and ending each session morning and afternoon. I started school in May 1904, about the middle of his tenure, so everyone was well used to his ways and we didn't realize that all schools were not like that.\n\nIt was a school inspector, Mr. Norman Black, later Dr. Black of the Regina Collegiate, who first drew public attention to Mr. Ward's work. Of course his school chorus and choir were the backbone of community programs, but Dr. Black took Mr. Ward and his school to demonstrations before the teachers' convention, I think in 1925, in Regina at the Alexandra School, now Regina Youth Centre.\nSo ironic by my writer, Miss O. O.\n\nSurely I am writing some very momentous\nyears always at Charlie, dear, friend Betty\n\nThis school was ten years on the old,\nloving with his stepson, Harold Tyler, well-known\nfor a time no supporter and teacher of the\nWyndale House. Mr. Ward, however, tried to\nway that all the school was his favorite\nplay, his piano and violin.\n\nWe were all somewhat but good teachers,\ngiving me a great grounding in the subject\nand ending each session morning and\nafternoon. I started school in May 1954, about\nthe middle of his tenure, so everyone was\nwell used to his ways and we didn't realize\nthat all schools would not like that.\n\nIt was a school collector, Mr. Norman Black,\nlater Dr. Black, the Capron College, who\nfirst drew public attention to his work.\n\nOf course his school chorus and choir were the\nbackbone of community happenings; but Dr. Black\ntook Mr. Ward and his school to prominence\nbefore he retired, concentrating think and work\nin Europe at the Alexander School, now Capron\nCentre.\nIt was a small group. I remember Mr. Ward made up words for a song about \"Thirteen girls and one small boy.\" There was another boy, but he was visiting but that winter.\n\nIn the spring of 1909, the first Sask. Musical Festival was held in Regina. This took in the whole province. What must seem unbelievable to present-day Festival goers, there were no classes of any kind for children.\n\nMr. Ward, being leader of the St. James church choir as well as the school, formed two groups, one entered as a church choir, the other as a ladies' choir. The first was composed of the older school girls, their older sisters who had been trained in the school previously, and some mature men of the neighborhood. I doubt if any of the ladies were much out of their teens. The ladies' choir took in the school girls from 10 years up and the ladies from the church choir. So I being the youngest member of the Condie Ladies' Choir, was the youngest member of the first Sask. Musical Festival.\n\nOur Choirs were quite a sensation, and drew favorable comment in the news reports. The Prince Albert contingent were late arriving and\nIt was a small group I remember best.\n\nFirst, made up words for a song about \"Christian Girls\" and one small boy. There was another boy, but he was visiting that night.\n\nOn the evening of 1909, the first church service was held in Regina. This took place in the whole province. What must seem unbelievable to present-day Biblical preachers, there were no classes of any kind for children, being taught by the St. James Church choir as well as the school formal two groups, one entered as a church choir, the other as a ladies' choir. The first was composed of the older school girls; their older sisters who had been trained in the school previously and some mothers from the neighborhood. I doubt if any of the ladies were much out of their teens. The ladies' choir took in the school girls from 10 years old and the ladies from the church choir.\n\nI believe the youngest member of the ladies' choir was the youngest member of the choir. Our ladies were quite a contrast, and their appearance commented on the news reports. The Prince Albert contingent were late arriving and...\nmissed our first appearance, so we were requested to sing the second evening. Not expecting this, my sister and I had our warmer red dresses on, instead of the all white of the rest of the choir. I forget how many appearances we made, but it was decided that there should be a special prize for the \"youthful Condie choir,\" I suppose it being considered that we did not fit into any of the scheduled classes.\n\nThe final evening in the Auditorium was a tremendous affair, ending up with the presentation of prizes. On the spur of the moment someone decided I should accept the shield for our choir, but it was too much for a shy little girl to stand out on the platform with the massed choirs behind me and the great sea of faces in front, but with the support of another small girl, Violet Lander, I was able to do it.\n\nThe shield was of oak with copper plaque from Nelson's flagship, the Victory. I don't know whether this material rath out, but I believe these shields are no longer being presented.\n\nAs a result of this triumph, the Condie choir was invited to participate in the concert given in honor of Earl Grey and Ruby Grey the evening after the laying of the\nwere requested to sing the second meeting. Not expecting this, my voice was heard that our warmer but closely crowded all white of the seat of the choir. How many affections we made it was decreed that there should be a special place for the \"faithful brother choir,\" yet not anywhere at liberty whatsoever that we did not fit into any of the dedicated classes.\n\nThe final evening in the Auditorium was a memorable affair, ending up with the concert. Someone decided I should accept the shield for our choir; but it was too much for a little girl to stand out on the platform with the musical sisters behind me and the great sea of faces in front but with the support of another small girl, Violet Sudder, I was able to do it.\n\nThe shield was presented with another plaque from Hell's Flagship, the Victory. I didn't know what her had practical and yet, but believe these shields are no longer being presented.\n\nAs a result of this triumph, the Claude choir was invited to participate in the current program in honor of both Guy and Ruby Grey the evening after the laying of the\ncornerstone of the new Parliament Buildings in Regina. I can't give the date, but that is surely found from official records. That evening for the first & last time we had stage fright and had to make a second start.\n\nI believe that the work of Mr. Ward had a great deal to do with demonstrating in Sask. what can be done in children's chorus work, and encouraging greater attention to music in the schools.\n\nI nearly forgot one other event which was not a public one, but I believe unique. This must have been about 1908. Mr. Wilson, later Dr. Wilson of the English department of the U. of S., was teaching in the Regina High School. He had a Glee Club there, but the members considered a 4-part setting of \"Little Orphant Annie\" too difficult. We told them he knew a little country school that could learn it, so sent it to Mr. Ward, with the request that when we had learned it, we sing it for him over the long-distance telephone. This we did, going to the telephone office at Airdrie. How well it sounded I don't know, since there was no such thing as a microphone, but we sang it satisfactorily in all four parts anyway.\nconvention. The new Parliament Buildings in Regina. Didn't give the date, but that is entirely from my records. What remains for the first part? Time we had stage fright and had to make a second start.\n\nStage believe that the work I did had a great deal to do with demonstrating an ideal, what can be done in children's chorus work, and encouraging greater attention to music in the schools.\n\nI nearly forget one other event which was not a public one, but I believe unique. This must have been about 1908. Mr. Wilson, later Dr. Wilson of the English Department of the U.S.F., was teaching in the Regina High School. He had a Club there, but the members concealed a secret setting. It was a little elephant corner. Too difficult, but told him he knew a little country school that could learn it, so sent it to her. Glad, with the request that when we had learned it, we sing it for him over the long-distance telephone. This we did, going to the telephone office at Claville. Now will it sound like a microphone, but we sang it satisfactorily in all four parts anyway.\nMr. Ward is still living, at least was a short time ago, at Collingwood, Ont., his home town. He is still a wonderful pianist, able to play anything placed before him. His ten years at Conlee meant much to the district, and to music among young people of the province.\n\nHarriet M. Purdy\nBalcarres, Sask.\n\nP.S. I have just been informed that Mr. Ward was later in charge of music at the Macomber Normal School, and that Mr. P. Staples of Regina would be able to give you more information about that part of his career.\n\nA. G. P.\nMr. Ward is still living at least near a short time ago at Willingwood, Ont., his home town. He is still a wonderful pianist, able to play anything Alfred before him. His ten years' art and knowledge must much to the district, and to music among young people of the province.\n\nHarriet M. Povesh\n\nP.S. I have just been informed that Mr. Ward was later in charge of music at the Normal School which that Mr. G. Stephens of Regina would be able to give you more information about that part of his career.\n\nC. H. Povesh\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( X ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( X ) Pioneer housing\n( X ) Pioneer education and churchwork\n( X ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- [ ] All questionnaires\n- [x] Pioneer health conditions\n- [x] Pioneer social life; sports and recreation\n- [x] Pioneer housing\n- [x] Pioneer education and churchwork\n- [x] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the Permanent Record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name (Mrs.) Lena May Purdy.\n\n2. Your address (P.O. Box 37) Balcarres, Sask.\n\n3. Date May 12, 1952.\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. Did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West? About 1878 & 79 Canada had what we later called a depression. Many companies dismissed employees. My father tried many short-term employment but failed to find a permanent position. People were talking about the prairies especially about Manitoba. I went back to school, father was acquainted with some of the organizers of the settlement colony, and was offered a position in the surveying party.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nI am not sure, but it seems to me there was general interest in the new land that was being opened for settlement. The contract with the C.N.R. had been signed and so, with a good deal of hope feeling, the railroad was being built, and many being out to work were thinking of the land where farms could be placed at once without the wearisome struggle with the forest of the early days in Ontario and Quebec. In my mother's early days in Ontario and Quebec, and my father's people had been U.E.L., as well as my father and pioneering was in the blood.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI do not remember, only that when Mother was getting ready to join Father in 1883 she was given a good deal of help. She faced many difficulties, including getting to quilt time, doing chores, and gathering supplies.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nMy mother, three little girls, 2, 7, & 3, in a big coach through Chicago, where we had to cross the river from one side to another, but were helped by strangers.\n\n13. What means of transportation did you use?\n\nRailroad through the U.S., then Toronto, C.P.R., from Winnipeg to Regina. There was no regular time-table, our train a day arrived when it got there.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMother heard the young preachers talking, counting their little money, deciding they could not eat during the week. She introduced herself, offered a share of the liberties, a great big basket, and fed so many friends, and when they needed it, she told them how best she could help. She visited Chicago, as they ate as long as they journeyed there, and one, Rev. Mr. Wright, who was pastor of the Presbyterian church in Regina, came all the way and helped off the train. Two trainmen were very good to us children. One day we picked a bundle of barley grass, two sticks put together, brown at the top and yellow at the bottom. The man talked to us, asked if we were very pretty, said we might stop a while, but we were so busy helping.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn Regina we stayed with friends, but went to Father's homestead through the week, while he broke some land with two oxen, and he and mother put up about 40 tons of hay. Mother played the organ at the Methodist Church in Regina on Sundays.\n\n16. Where did you settle or take up land?\n\nFather's homestead was on N.W. 22, 18, 22, W. 2nd.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI taught school in several places by the territory of Alta, and in 1895 married Angel E. Purdy and went to Boggy Creek to live on his farm. In 1910 we sold the land and moved into Regina where our six children attended school until the youngest finished high school. My husband died in 1924, and in 1925 Smith, my sons and daughters moved to Laramie, Nebraska.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nOf course I was only a child before coming west, but somehow I was able to help on the homestead. Studied at home as there was no school. Mother teaching me at first, later studied alone until I was able to write exams in Regina, and now began to teach school, usually spending the winters at home.\n11. What did your friends and relatives think of your decision to come to Eastern Canada?\n\n12. Did you travel by yourself or in a group? (Family, friends, or other companions).\n\n13. What means of transportation did you use? (Train, boat, car, etc.)\n\n14. What was the weather like during your journey?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. How did you settle or take up land in Saskatchewan?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. Have you ever been living before coming to Western Canada? How long did you stay there?\n\n19. What was your occupation in Western Canada? How did you earn your living?\n\n20. Any other comments or questions?\n19. How often did you write to relatives or friends in your old home?\n\nFather and Mother both corresponded regularly with relatives and friends. I had my correspondence too. Mother's letters often included stamps on her letters.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband, Russell Atherton Purdy, was married at Wynyard, Nov. 24th, 1876, by Rev. Jas. Woodworth.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nI am not sure, though several cousins came.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nI have answered this in other paragraphs.\n\nMy mother was a U.E.L. stock, brought up on a farm, taught a private school where she taught the 3 R's, music and needlework; then had a scholarship to Wesleyan Female College in Hamilton where she taught and studied.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe droughts of 1886, preceded by terrible prairie fires in the fall of 1885. Of course the rebellion of '85 when Indians stole our two cows but brought them back next day. Later an Indian told Father \"Young men want to be big braves, steal cows, when they come to camp, we know whose cows gave our children milk.\" When he visited, so we made him take them back. The bumper crop of 1894, not enough machinery or men to handle it, early winter, everything from Ontario to help. The building of the Cottage Grove School in 1893, the fights in our neighborhood, and I was ready after attending the previous winter to teach it with my 2nd class certificate.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe attended church services first no settlers' homes, then in Preston Church, which we helped build. It was opened in the spring of 1889. We always went to the picnic at the Old Crossing on the Wallawana Creek on the 4th. There was only one 2 ½ mile Old Crossing in the Wolfville Valley. At the 12 mile old crossing was about 3 miles from home, Canada where the train was about 30 miles from home. Church 5 miles. We had some picnic wagons, 6 by 7 miles, church 5 miles. We went to Picnic and back by ox sled. Later I went to Picnic and back north of Welby to stick to the County settlement. S. C. Woodworth to Welby, first schooling, and to Welby in 1874—another drought year. Part of each trip was by R.R., partly horse drawn stage or horse and buggy.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell us their names and when they came.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n25. We attended church, and we always had a good time.\n25. When was the first car used in the community? I am not sure. The first car was bought at Boissevain in 1908 by Mr. Condie.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   At first we dealt mostly with Regina, 18 miles, but did some business in Prince Albert.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Father continued to do business in both places. Later dealt a good deal in Lumsden when Lumsden was built, also about 10 miles. When I married there was a little hamlet at Condie, 2½ miles from my husband's farm where we bought some things but did most business in Regina, 12 miles.\n\n29. How often did you shop in the early days?\n   No regular trips. For household needs kept a card in my cupboard where supplies were bought periodically. We often bought flour, sugar, salt, etc., from Eaton's catalogue.\n\n30. How many people in your district first started going to town regularly on Saturdays?\n   I never noticed any such habit until after we left Regina, but in the following years we lived in the city many districts had started. The habit was well fixed around Balcarres before 1925.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   We organized our own telephone company near Condie in 1909.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we intended to stay no matter what happens. We could have a house of our own, a farm where we could produce our food, improve the land, plant all sorts of things that would grow. We had lived in a city in related homes, but I think always had been farm-minded.\n25. When was the first car used in the community? January 1907.\n\n26. Did you have any other cars before this one? No.\n\n27. Where was your trading contact? How far from your home?\n\n28. Did you continue to trade there? Yes.\n\n29. How often did you shop at this store? Weekly.\n\n30. What kind of articles did you buy there? Clothing, groceries, household supplies.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? 1909.\n\n32. Then did you first have a telephone and what company provided it? Yes.\n\n33. Then you came to无线电town the first time was it with the idea of staying permanently? Yes.\n\n34. Did we make a house and move there? Yes.\n\n35. Did we have any other cars after this one? No.\n25. When was the first car used in the community? I am not sure. The first car was owned by Mr. Joseph, photographer in Lumsden.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   We lived two miles north of the town in Regina, 8 miles but we could be there in 10 minutes.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n   I have continued to do business in both places. Later I dealt a good deal in Lumsden when the store was built, about 10 miles. When I married there was a little family at Condie, 2½ miles from my husband's farm where we bought some things but did most business in Regina, 12 miles.\n\n29. How often did you shop in the early days? (Indicate regular trips for household needs, trips to carding mill, etc., when supplies were low, and how many trips per week/month/supplies needed.)\n   I never went to Regina, but in the last few years we lived in the city many districts may have started. The habit was well fixed around Balcarres before 1925.\n\n30. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   I have no record but must have been early. I knew when I was preparing for marriage, early in 1896. I sent a large order to Eaton's in Toronto for goods to make up, cottons, suits for dresses and aprons. After being married we often sent for a large shipment, tea, raisins, currants, rice, barley, spices, toilet soap. Patience bought most of our dry goods stores from Regina, though we had ready-made clothing come along. Eaton's and Simpson's got many orders.\n\n31. When did you first have a telephone and what company provided it?\n   We organized our own telephone company near Condie in 1909.\n\n32. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we intended to stay no matter what happened so we could have a house of our own, a farm where we could produce our food, improve the land, plant all sorts of things that would grow. We had lived in a city in related houses, but I think always had been farm-minded.\nBetween the farm at Cottonwood and Regina there were two creeks, the Cottonwood and Clarence, without bridges; no supplies had to be strict by the spring floods, so that cattle across were possible again.\n29. Between the farm at Cottonwood and Regina there were two creeks, the Cottonwood and Wasana, without bridges, so supplies had to be stored before spring floods, to last until roads were passable again.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA good many left after the first dry year in 1886. Others left as soon as they received help for their homesteads—these apparently being all they came for.\n\n35. Did many people move away during the 1930's? Did many return?\n\nI cannot tell. We had sold our farm at Condé because my husband was not well enough to continue farming in 1910. My father left his farm about 1921 or 22 because land and mother were old. Others did much the same, sometimes leaving sons to continue. But among people knowing those who left did so because of age or reasons aside from the depression.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father, Anthony Neville, was among the early I.T.S. in area. Mother kept the Cottonwood R.R. for a number of years, after 1896, but I am not sure of exact dates. Father was a trustee of the Wasaga Church, secretary of the Cottonwood School District for several years. My husband, Joseph C. Purdy, was a trustee of the Bigg Creek School between 1904 and 1910. His father was one of the organizers of the school in 1885.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI think my mother, Mrs. A. Neville, was the first regular organist in the Methodist Church in town. She played at any rate from July 1883 to April 1884. Father helped to build the church in the winter of 1872-1873. I was the first school teacher in Country No. D. Kaith, Moorejaw, and school teacher in Cottonwood. We organized the Baptist Church in Cottonwood neighborhood. Father and I led S.S. in Cottonwood neighborhood. Father and I were always called on in case of accidents or sickness.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (date and reason for change). Give facts of new name as above in (1), (2), (3).\n\nCottonwood R.R. was named for the Cottonwood Creek near by. Forest School District was named by settlers who came from Forest City, Wasaga R.R., who named it for the creek. Condé Station and R.R. were named because they were on the farm of Robert Condie, one of the early settlers. Most of these names seem to come naturally.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA good many left after the finish of the year in 1886.\n\nOthers left because of the new school law that came into effect.\n\n35. Did many people move away during the 1920s? Did many return?\n\nI cannot tell, but I believe our family always did.\n\nMy father died in 1910. My mother died in 1912. We moved back to Canada in 1914.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention work done, offices held, dates served, etc.\n\nMy father was a Justice of the Peace for several years.\n\n37. If you or any of your family or friends were involved in any way in the first automobile, describe it.\n\nI do not know anything about automobiles.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.)\n\nTry to give: (1) name and origin of place; (2) date of adoption; (3) any changes in name since then; (4) date and reason for change.\n\nCottontown & Raymond named for the cotton grown there.\n\nRaymond named for Robert Raymond who came to Canada from England.\n\nThey were named for their families.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWe have the program of the 1st Music Festival in Regina, a little listing of the organization of the Methodist Church at Wascana, a few other things that may be of interest.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy children: Muriel M. Purdy, X-ray operator and laboratory technician; Reginald Murray, Registered Dietitian; Herbert M. Purdy, R.P., poultry producer, Balcarres, Sask.; Laurence E. Purdy, farmer, East Wask., Jersey cattle club, B.S.A.; J. Linton Purdy, M.S.C., feed analyst, Skelton's feed mill; Herbert A. Purdy, M.S.C., former chamber of commerce, living at 1222 Pender Ave., Toronto.\n\n41. What do you think are the most important changes in your community since first came West?\n\nThe settlement by mostly the land in the southern part of the province and grading roads, making the great plains fires of the past impossible. Also courses branch railroads, telephones, hospitals, churches, factories, the Wheat Pool Co-operations, horticultural societies, better schools etc.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Jas. Stephens, Balcarres, Sask.\nTry Mr. Wilbert Frew, Prince, Sask.\nMr. H. A. Joassant, Edgeley, Sask.\nMr. Frank Thomas, De' Appleby, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n___________________________\n___________________________\n6.\n\n95. Questions regarding historical source materials:\n\nDo you have any photographs or do you know the whereabouts of diaries, old letters, old papers and pictures, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWe have old newspapers, old photos, old letters, old diaries, old reminiscences.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Ottawa, or the Archives Office at the University of Toronto?\n\nIf you have any information about your ancestors, please give their names, where they lived and occupations.\n\nMy children are:\n\nMaud M. Purdy, born in Ontario, Canada\n\nHarriet M. Purdy, born in Ontario, Canada\n\nHoward M. Purdy, born in Ontario, Canada\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community in the last twenty-five years?\n\nFirst case please!\n\nThe settlement of the land and the development of the town.\n\n42. Any other comments or suggestions?\n\nNot particularly.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nMr. J. A. Joannant, 21, Chipley Street.\n\nTry Mr. Willard Brown, Renown Road.\n\nIf someone else has filled in this questionnaire, please sign this person's name and address here:\n\n_________________________\nMrs. D. A. McIntosh,\nKimmaird B.C.,\nHolds a Saskatchewan Class Teacher Certificate.\nGrandchildren:\nDaniel R. McIntosh, Kimmaird\nJohn R. D. McIntosh\nElizabeth May C. Purdy\nBlair Ross Jack\nJohn Purdy\nGlenn Purdy 3174 Wellesley St\nToronto\nAll at school except Daniel\nMrs. D.A. Kneibloch,\nKings Arms B.C.,\nHolly Creek Community Church,\nGrandville, B.C., Ontario, Canada.\n\nElizabetta Bray & Purdy\n\nJohn Purdy (1774-1852)\nEliza Purdy (1779-1863)\n\nAll aboard except Daniel\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_416.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 44, "total-input-tokens": 73040, "total-output-tokens": 11707, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1287, 5], [1287, 2100, 6], [2100, 3317, 7], [3317, 4363, 8], [4363, 5684, 9], [5684, 6894, 10], [6894, 7865, 11], [7865, 8765, 12], [8765, 9929, 13], [9929, 10953, 14], [10953, 12068, 15], [12068, 13147, 16], [13147, 14316, 17], [14316, 15395, 18], [15395, 16522, 19], [16522, 17591, 20], [17591, 18119, 21], [18119, 18635, 22], [18635, 20618, 23], [20618, 22579, 24], [22579, 24309, 25], [24309, 24309, 26], [24309, 27197, 27], [27197, 27910, 28], [27910, 30558, 29], [30558, 31238, 30], [31238, 33370, 31], [33370, 34085, 32], [34085, 36533, 33], [36533, 36533, 34], [36533, 36738, 35], [36738, 36943, 36], [36943, 39657, 37], [39657, 40885, 38], [40885, 42904, 39], [42904, 44430, 40], [44430, 44694, 41], [44694, 44896, 42], [44896, 45043, 43], [45043, 45189, 44]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]