[{"id": "b988e1894c8c7dbc101967c175662e6f9217eb9d", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name: MADDOWIE\n\nPresent Address: BOLIA, BC\n\nPioneer Address: FETHALTON\n\nYear you came to Saskatchewan: 1901\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER RECREATION AND SOCIETY LIFE\n\nNOTICEABLE VISITING, PARTIES, HUSBAND DANCING AND ATTENDING THAT TIME OF THE DAY DID YOU GO? IN THE MORNING AND ENDE THE AFTERNOON OR EVENING?\n\nWHAT ABOUT MEALS? DID YOU STAY WHEN NOT INVITED AFTERBEHAND? WHAT WAS THE INVITATION TO A MEAL USED TO TAKE POTLUCK USED? WAS THERE AN EXPECTED OFFERING?\n(RIGHT-UP)_PLEASE_ NO... YOU WENT TO THE COFFEE SHOPS WITH YOUR FAMILY WHENEVER YOU WERE ABLE TO DO THIS AS WE USE. IF NO MEAL WAS OFFERED BY VISITORS WHO HAD DROPPED IN, WAS SOMEONE OFFERED TO TEA BREAKFAST?\nONETIME A GALLOPS WOULD BE USED TO TELL THE POEMS.\n\nSURE! WESTERN AREAS OFFERED EXECUTIVE OPPORTUNITIES FOR BUILDING OUTDOOR ACTIVITIES SUCH AS SWIMMING, HIKING; BUILDING ON THE LAND.\n\nTHEY ESTABLISHED CHURCH SERVICES WHICH MEETING TIMES VARYED FROM 1907 TO 1924.\n\nIT WAS COMMON TO GO TO CHURCH SERVICES ONCE WEEKLY.\n1. In the first few years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Always? Sometimes? Never?\n\n3. Did you usually visit on a Sunday, or other days? Usually Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Invited without invitation.\n\nThat time of the day did you go? In the morning and spent the afternoon there? Or in the afternoon and spend the evening there? What about meals? Did you stay when not invited beforehand? Yes, if husband and family were there as well (that is, was the invitation to a meal served when people had come unexpectedly? No, but you came to visit anyway).\n\nIf no meal, what other refreshment might be offered to visitors who had dropped by? A cup of tea and a cookie.\n\n5. Did the whole family go, or did someone stay home to watch after the plants?\n\n6. Did you ever have house with groups of neighbors come together to put up a building, make quilts, or other such activities? Tell what type of activities were held, and how often they occurred.\n\n7. In the early years that you were here, were there many parties, what kind of parties were they? Describe.\n\nYes, we had parties at each other's homes and had sing-a-longs and games at Jane's home that were frequent in later years! Olive dates and dances were also frequent.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks once a week, once a month, etc.? Not to the homes not away to nearby local fields doing plowing and gathering. The whole family liked to go out gathering.\n2. Tall trees were used as the school house for community classes, but suitable alternatives (wooden slats for the school children's tree planters, etc.) and other materials were also used.\n\n1. When parties, dances, etc., were held in homes, social houses or halls (as referred to in question 8, 9, and 10) did not serve really as such.\n\n10. The dance was popular at various dances held and so forth.\n\n9. What kind of food was eaten?\n\n8. Tall trees were used as the school house for community classes, but suitable alternatives (wooden slats for the school children's tree planters, etc.) and other materials were also used.\n\n7. How were dances arranged between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n6. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n5. How were dances arranged and fed in the winter time at these parties?\n\n4. How were dances arranged and fed in the winter time at these parties?\n\n3. What sort games were popular in the early days?\n\n2. Tall trees were used as the school house for community classes, but suitable alternatives (wooden slats for the school children's tree planters, etc.) and other materials were also used.\n\n1. When parties, dances, etc., were held in homes, social houses or halls (as referred to in question 8, 9, and 10) did not serve really as such.\n8. Tell what was not made of the school house for community dances, box socials, etc.\n\n9. How much did your school cost? (If you have any information about this, please give it.)\n\n10. What games were popular in your school? (Examples: marbles, hopscotch, etc.)\n\n11. What card playing for prizes? (Examples: bridge, poker, etc.)\n\n12. Was there any disagreement between dancing and non-dancing residents in the planting of potatoes and corn? Explain.\n\n13. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What meetings in particular, or \"series,\" do you remember in small towns, such as school and town hall meetings, antiques shows, election town meetings, etc.? Describe what you remember of its activities and services.\n\n13. Are the churches known in your community?\n\n14. Were there any clubs, such as the Elks Club, Masonic Lodge, etc., that you belonged to? If so, describe them.\n\n15. What was the name of the first organization of any kind that you can remember becoming associated with your community?\n\n16. Was there a Scandinavian church service held in your community?\n\nTell when it was organized, and what steps led to the organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged\n\nHow often did it meet\n\nThat were some of the activities carried on by this organization\n\n17. Was there a Homemakers' Club in your district/area? If so, when was it organized?\n\nApproximately how many women belonged to it\n\nDescribe what you remember of its activities and services.\n\nAnd what have you done since then?\n\n18. What do you think are the most important things that you have learned in life?\n12. What activities did you participate in during your community's early years?\n\n13. Name the clubs known in your community.\n\n14. Describe what you remember about these clubs, telling how women benefited from them.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\n16. Give the date and reason for its being organized.\n\n17. Was there a Homemakers' Club in your community? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\n18. If so, when did it meet? What were some of the activities carried on by this organization?\n\n19. Did you have any of these activities started in 1925? They have been very useful.\n18. Name any other organizations that were in existence in your community before 1945, giving the name of each, date when it was first organized, its activities.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so,\n\n21. What games did boys play in summer (jump rope, ball, marbles, fly kites, etc.)? What games did girls play in summer (skipping rope, play house, etc.)?\n\n22. What were the slides about?\n\n23. Who provided the lantern and the slides?\n\n24. Did you often have magic lantern shows? If so, give dates if possible.\n\n25. What means were commonly used by organizations for raising money?\n\n26. What events were commonly used by organizations for raising money?\n\n27. In the school house\n19. Name any other organizations that were in existence in your community before 1914, giving their name (if any), when they began, if known, whether they included men and women only, or both; whether they were relatively small areas (for example, within a school connection); or was central in the town or valley and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, play house, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What other games were played outside - fox and hounds, skating, etc.?\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent names connected with things such as butterfly bones, arrowheads, gophers or other objects of interest, or games in the snow? Describe.\n\n25. What was the date of the first plowing that you attended in Saskatchewan?\n\n26. Who organized the plowing club in 1972 and why did they do it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the county community?\n\n28. Was it the first plowing held in the community?\n\n29. What were the maneuvers at the plowing you attended (ball games, races, band, etc.)? Tell anyone who was actually there what they remember.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? What would you consider to be a good meal today?\n\n32. What time of the day did it start, and how long did it last?\n\n33. What was the favorite food eaten and how much did you consume?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as Whist? \n\nCard games also Chess? Checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain. \n\nWhat of the parents joined with the children in the games? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe. \n\nWhen the snow got soft they made snow men and animals and of the snow built houses with blocks of snow.\n\nPIONEER AND SPORTS\n\n25. What was the state of the first plow that you attended in Saskatchewan? \n\nGive your best sketch if possible. The first plow I can remember is the Plow that came to the district. It was a big plow and was used by Mr. Smith. \n\n26. The organization of the ladies of the Methodist Church was started in 1904. \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? Yes \n\nIf not, do you know the date of the first one that had been held? \n\n29. Were the arrangements at the picnic you attended (ball games, races, etc.)? Ball games races, each was splendidly arranged. \n\n30. That arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? They cooked the meal together and all eat together. \n\n31. What did you have to eat and drink? Fruit salad, apple juice, ice cream and gophers. \n\nWe had our own lunch. \n\n32. What time of the day did it start, and how long did it last? \n\nAbout 1 o'clock lasted all afternoon. \n\nThank you kindly.\n33. Describe any features of the plant which you remember as outstanding.\n\n34. Describe any different kinds of plants which you knew of in the early days, such as the large community plots, school or Sunday School gardens, family plots, etc., tell about any differences in numbers attending meetings, food and drink, when held, etc., also, how many children attended.\n\n35. What changes have you noticed in plants since the first war? If possible, give dates when changes became noticeable, also the cause.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly).\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1941, giving date of organization if possible, and tell something of their activities—played in competitions in larger centres, played at local sports days, entered in competitions from neighboring towns, played at local fairs, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). Do you know anyone who played there?\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this place which you remember as outstanding.\n\n32. Describe any different kinds of plants which you knew of in the early days, such as the large community plants, school or Sunday School plants, etc., food and drink, when held, etc.\n\n33. What changes have you noticed in plinths since the first years? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling people, young people, old people, etc.\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\n36. How long did it continue?\n\n37. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n40. When did an annual \"sports day\" become established in your community?\n\nDid it grow out of or replace the earlier community festival?\n\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (blank month) or any special day such as May 24th or July 4th.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\n42. What books did you bring with you when you came east? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them and how many?\n\nWhat kind of books and how many do you look\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came east? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\nGive titles and dates.\n\n48. Was there a school library? When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community planning\nthat was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (May, June, July, August)\n\n41. Are there any other games played at school during the year?\n\n42. How many books did you bring with you when you came here? (Give a list of the\nnames and authors, and how many.)\n\n43. How many of your neighbors brought books with them? (Give a list of the\nnames and authors, and how many.)\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever used any \"traveling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library? When was it begun?\nTo what extent were books borrowed from the school library for adults to\nread at home?\n\n49. Did parents ever use their children's school texts as additional reading\nmaterial?\n50. Has there ever been a community library in your district or town?\nWhen was it started? What library did it start?\n\nIs it still in existence?\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? How long did you subscribe to each?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others. Also change matters often.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nGive titles and authors and approximate date.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. If so, how some books and newspapers helped you keep in touch with friends and relatives.\n\n56. Diana Gordon\n8.\n\n51. Has there ever been a community library in your district or town?\n   When was it started? (Oct. 1914)\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n52. What newspapers or magazines did you subscribe to when you first came to the west? The Family Herald Weekly Star\n   The Tribune Weekly and the Advocate Weekly\n\n53. Describe later changes in your subscriptions, telling why you changed certain subscriptions and added others.\n\n54. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n55. What books or papers that you brought to the west with you do you still have?\n\n56. Have Bible pilgrims Progress and any guestbook.\n\n57. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes, they were many starving days when we could do nothing but wait until we could have something to eat. We had some hens raising chickens on an empty field, and an urge to make our room a small garden.\nWhat musical instruments did you bring west with you?\n\n56.\n\nTell what you remember of the activities, how often practice was held, where,\n\nIf members had uniforms, what events the band played for.\n\nTell what you remember of the activities, how often practice was held, where,\n\nWhat instruments were included?\n\nHow many were in it?\n\nWho was bandmaster?\n\n63. Was there a band in your community? If so, when was it started?\n\nWho started it?\n\nHow long did it continue?\n\n62. Did you ever make up any of your own songs, or make up words to fit an old\n\ntune as a joke on somebody, or because of some special happening in the\n\ncommunity? Explain, never heard of any\n\n61. Was \"folk music\", or music of the country you came from, popular in your\n\nhome or community? Explain. If so, what was a favorite\n\nsong? What was a favorite dance? How was it done?\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n59. How large a part did singing and other forms of music play in your home en-\n\ntertainment in early years in the West? Describe.\n\n58. What musical instruments have you bought since you came to the west? Give\n\ndates, please if possible, and tell where you came to the west? Give\n\n57. What musical activities did any of your neighbors have and family had at\n\nhome? Include family members who lived at home and who attended\n\nschool away from home.\n\n56. What musical instruments did you bring west with you?\n\nMusical Entertainment.\nMusical Entertainment\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your relatives have? (e.g., piano, organ)\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices, if possible, and tell where you got them.\n\nWe bought a piano in 1915 for $250 delivered.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, parties, etc.) Describe.\n\nMusical entertainments in the community just we had singing at parties.\n\n60. What were some of the favorite songs in the house?\n\nThe Band and Quartet (or solo) often sang \"Home Sweet Home,\" \"The Star Spangled Banner,\" \"Oh! Susanna,\" \"My Country 'Tis of Thee,\" etc.\n\n61. Was \"folk music\" or music of the country you came from popular in your home or community? Explain.\n\nYes, there was \"Gullah\" music, Scotch highland tunes, also Irish airs.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNever heard of any.\n\n63. Was there a band in your community? Who started it? How long did it continue?\n\nThere was no band in our district.\n64. Has anyone from your community been well known or famous in the musical world? Give name and date and place of public appearance.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collectors,\" such as stamps, stones, paintings, sculptures, etc.? Have you bought and sold anything recently?\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, etc., etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. In music as in any other field, what is the reason for this change?\n\n66. Do you have any hobbies, such as stamp collecting, painting, gardening, etc.? If so, describe them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, etc.?\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheet if necessary)\n\nFor the Memorial Day of 1914 those who had been when veterans came would go around and hail as many as they could and we would go to the larger hall and entertain them talk any thing we had in the house for lunch. The ones who played the violin (I'll sit by) and we would have a good time and make new friends and these meetings would be and maybe we could have debates and talks by local farmers on subjects such as summer following and raised garden and how best the food can be grown and raised there.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1901_1964.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6614, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1213, 5], [1213, 1213, 6], [1213, 2112, 7], [2112, 3815, 8], [3815, 5245, 9], [5245, 5878, 10], [5878, 7029, 11], [7029, 7782, 12], [7782, 8583, 13], [8583, 9516, 14], [9516, 10694, 15], [10694, 12520, 16], [12520, 13798, 17], [13798, 14832, 18], [14832, 16108, 19], [16108, 17170, 20], [17170, 18319, 21], [18319, 19610, 22], [19610, 21059, 23], [21059, 22350, 24], [22350, 23228, 25], [23228, 24571, 26], [24571, 24726, 27], [24726, 24889, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]