[{"id": "15abe5a24258db5ccfee37fc904bea38197f1bbe", "text": "Winteringham, Mrs. Sarah\nCarlyle.\n\nTo Sask. - April, 1888\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible to answer; so don't worry about leaving blank spaces. Be sure to give detailed answers to describe particular events or any help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a complete questionnaire.\n\nOther Questionnaires\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did You Eat?\", is still being circulated. If you have not already answered this, and are still willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer furniture and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nWinteringham, Mrs. Sarah\nCarlyle.\n\nTo Sask. - April, 1888\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Winteringham\n2. Your address: Carlyle, Sask., Canada\n3. Date: Nov. 15, 1885\n4. Where were you born? (Give name of place and country): Claraire or Pine Creek, Ont.\n5. What was your father's name and occupation?: Ted Winteringham, Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 25, 1885\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - [Blank]\n8. How old were you when you first came to Western Canada? (You do not need to swear this statement.) I was 17 years old.\n9. What were your reasons for coming West?\n   - I accompanied my parents and one uncle and four brothers. My older brother had worked on the C.P.R. building before I left, whereas all our other brothers had worked on the red mile family farm when they were younger. We had heard stories about the red mile family moving west and decided to take their chance in the new world.\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nSee the above.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friends were surprised and were all excited about the prospect of a large family.\n\n12. Did you have any particular (family, friends or other groups) in mind when planning your trip?\n\nI had no particular plans.\n\n13. What means of transportation did you use?\n\nBy train and by horseback.\n\n14. What is included in the journey? (List do you remember?)\n\nPeople you met on the way, adventures or other experiences.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy family had a log house and we all stayed there until the fall.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nJust lived at home on the farm.\n19. How often did you write to relatives or friends in your old home?\n\nFor the first few years I wrote twice a month, once a month at first gradually quitting less.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried likely Winteringham and Carlyle on March 24, 1896.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nMy sister and her husband came in 1889.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nThey came to Carlyle.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to relate?\n\nOur homestead was very close to the North Boundary, Saskatchewan and we had lots of experiences and Indiana side were always hungry and always begging for food and clothes.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting relatives, etc.)\n\nHad no business, the men went to Montana to buy what was needed. Church service was held in the homes in all summer and in the winter there weren't any services. There were few horse paths then. My father was the first person buried in what is known as the Old Prairie Cemetery and was named after him, it is the only cemetery in Carlyle today.\n25. Then was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n\"We didn't own a car until 1916 — a Ford.\"\n\n27. Where was your trading center? How far from your home?\n\n\"Oxford. 3½ miles.\"\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n\"I didn't change much the family people did trade at Alden & Oxford city by this time I was living there.\"\n\n29. How often did you shop in the early days? How often do you shop now?\n\n\"We would go weekly. Now we go twice or three times a week.\"\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n\"Only two years ago they started to go to church regularly on Saturdays.\"\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n\"What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\"\n\n\"When we first came over there were no stores in Oxford so the first thing that we went outside for was things like flour, sugar, tea and coffee mostly from Sears, Roebuck, etc. We had well with the families of the pioneers who would be well informed.\"\n\n32. When did you first have a telephone and what company provided it?\n\n\"About 1910 — Oxford Rural Telephone Co.\"\n\n33. When you came to Soka toteman the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n\"It was with the idea of playing permanently and we stayed.\"\n5. Did any people move away from your district prior to 1942? What reasons did they have?\n\nA few families came were glad & return.\n\nThey showed little acres & all well climate\n\n6. If you or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n7. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here. (Such as owning the first automobile, building, organizing the first lodge, etc.)\n\n8. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and conception of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the place-name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe only name I know to be approved correctly\n\nOld North Church was moved from original site\n\nOld Town School and district - named for my father. His name was still used when given deliver 1895-1900.\nYes, I am very pleasant and my persona.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library (again, to be kept on file at the University in Edmonton)?\n\nIf you have children or grandchildren, please give their names, where they live and occupations:\n\nMargaret Winteringham: Calgary - Teacher\n\nWould you be willing to help us in any way?\n\nWhat do you think are the most important changes in your community since you first came West?\n\nImproved schools, better hospitals, better roads, better homes.\n\nModern homes.\n\nPlease give the names and addresses of other pioneers who could answer this question:\n\nMrs. Mrs. Johnson, Robert Street\nMr. Mr. Cameron, Carlisle Street\nMrs. Mrs. Hargreaves, Calgary Street\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. E. Johnson\n\nThank you.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1888_482.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 16600, "total-output-tokens": 2415, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1912, 3], [1912, 3062, 4], [3062, 3812, 5], [3812, 5181, 6], [5181, 6870, 7], [6870, 8004, 8], [8004, 8993, 9], [8993, 9147, 10]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]