[{"id": "2fce7fe686bc2cb7863961e85212ef97ba52d6d9", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n鮮朝\n\nVOL. VI.—Part I.\n\nSupplied gratis to all Members of the Society.\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\nSeoul, Korea: The Korean Religious Tract Society.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trubner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1915.\nCONTENTS.\n\nThe History of Korean Medicine ........................................... I\n\nAfforestation in Korea ......................................................... 35\n\nMinutes of Annual Meeting .................................................... 43\n\nReport of the Council .......................................................... 43\n\nAppendix:\n\nOfficers .............................................................................. 45\n\nList of Members .................................................................. 46\n\nCatalogue of Publications ....................................................... 49\nTHE HISTORY OF KOREAN MEDICINE.\n\nN. H. BOWMAN, M.D.\n\nSEVERANCE UNION MEDICAL COLLEGE, SEOUL, KOREA.\n\nThe life story of Korean Medicine is based upon a traditional inheritance from the dim past, before the time when history began to be a matter of record, and the subject does not claim our attention today because it is a monument of ancient skill, for in fact it is not, but because it comes to us as a part of the traditions and history of the Korean people.\n\nAfter careful study of the subject the following outline is suggested for consideration.\n\nI. The Chinese origin (2838-2648 B.C.)\n   (a) Sil-long-se (신농씨 神農氏)\n   (b) The Pon-cho (본초 本草)\n   (c) The Pharmacy sign (신농유업 神農遺業)\n\nII. The medical treatises and authors with a chronological outline of the Korean library of medicine arranged according to the dynasties and the date of their occurrence.\n\nIII. The revision of the Pon-cho (본초 本草) 1393 A.D. and the bibliography.\n\nIV. Emperor Sin-chong's (신종 神宗) proclamation (1608 A.D.)\n    (a) You-han, (류한 劉漢) the royal household physician.\n    (b) The Pon-cho (본초 本草) becomes a book and the accepted standard for Chinese Medicine.\n    (c) The description of the Pon-cho (본초 本草)\n\nV. The Moon-Chang (문장 門塲) and the introduction of the Pon-cho (1628 A.D.)\n\nVI. The Pang-yak-hap-pyun (방약합편 方藥合編) as a standard for Korean medicine. (1838 A.D.)\nVII. The description and translation of a part of the Pang-yak-hap-pyun (방약합편方藥合編)\n\nVIII. The origin of Acupuncture and its subsequent development.\n\nIX. The organization of the Sil-long-se adherents, 1913 A.D. and the granting of the title of \"Scholar of Medicine\" by the Japanese authorities.\n\nX. Conclusion.\n\nI. In the traditions of China is to be found the first glimpse of what the Korean people believe to have been the origin of their medicine.\n\nThe legendary story begins with (a) Sil-long-se (신농씨 神農氏), the second of the five ancient rulers of China, who founded a dynasty, which lasted from 2838-2648 B.C. This personage has been honored with the title of \"Father of Medicine\" and he is reputed to have written an original manuscript on medicine, called the (b) Pon-cho (본초本草) which analysed in its component parts signifies the first manuscript (\"Pon\"-ist, \"Cho\"-manuscript). (c) This tradition is commemorated in the form of a sign on all retail drug shops where native medicines are prepared and sold. The final syllable (honorific) is dropped and the word for inheritance, you-aup (유업遺業) is added, thus the sign reads Sil-long-you-aup (신농유업神農遺業) \"inherited from Sil-long-se\" or inherited medicine, which in point of significance corresponds to the English word pharmacy, except that it is never employed to indicate the science of pharmacy, because there is no such distinction in Korean medicine.\n\nWholesale drug shops of native medicines are called Yak-gai (약계藥契) but they are purely commercial and have no part whatever in the subject under discussion. Thus the traditional story of Sil-long-se (신농씨神農氏) ends and the Pon-cho is lost sight of for a period of about four thousand years when it reappears within the province of history to which\nreference will be made later in the order as it appears in the synopsis.\n\nII. The library of medical books is in possession of the practitioners of native medicine and the number and kind varies considerably. Some have at least one book on medicine and that book is in most instances the one of the six written by a Korean on the subject of medicine. Others possess more, but they are of Chinese origin and written in Classic Chinese. The greatest number of medical books found in the possession of any one practitioner of native medicine was seventy two, fifty two volumes of which were by one author and that set was an elaborate edition of the Pon-cho.\n\nReferring to the chronological outline of the Korean Library appearing herein, there are two books derived from the Whang dynasty (황제현원씨 黃帝軒轅氏), the founder of which was the 3rd of the five ancient rulers of China (2697–2597 B.C.). They are included because both of these books have until recent years been in the possession of many of the present day practitioners of native medicine, but at present both of the books are out of print, and it is not likely that another edition of them will ever be issued again in Korea.\n\nThe other books included in the outline are bonafide members of the present day Korean medical library, and are in actual use by the practitioners of native medicine. Some of the books have a supplementary sheet which mentions a large number of other books of Chinese authorship, that were never in use in Korea by the Korean people, therefore no mention will be made of them.\n\nThe next books in order of time do not appear until 56–59 A.D. after which time they occur in fairly regular order of one or two books for about every 250 years until the Mung (명 明) (Chinese \"Ming\") dynasty (1368–1628) is reached.\n\nDuring this time a greater number of books came into use, all of which may be noted by consulting the chronological outline herein attached and further delineation of the Korean Library of Medicine will be deferred except as it becomes\nnecessary to refer to it in treating with special topics of this discussion.\n\nIII. The revision of the Pon-cho (본초本草) occurred in the Mung (명 明 (Ming) dynasty) (1368–1628 A.D.) during the reign of Mung-tai-cho (명태조 明太祖) 1393 A.D. The Pon-Cho was revised by one E-Se-Chin (리시진 李時珍) a Chinese doctor and scholar living at Ko-wol (고월 古越) China. In the revision of the Pon-Cho the author incorporated many new rules, which he took from contemporary sources or from his predecessors; however be this as it may, the bibliographic outline of the Pon-Cho herein given will show the sources drawn upon.\n\nThe rule of pulse science is strongly emphasized throughout the Pon-Cho and frequent references are made to one or other of the books or authors of the bibliography. Whether all are books to which reference is made is uncertain, as some were probably names of teachers, but this is a matter of conjecture. These references indicate much of interest as to the character of the teaching in Medicine in China at that time.\n\nBIBLIOGRAPHY OF THE PON-CHO.\n\n| TITLE OF BOOK | KOREAN | CHINESE | ENGLISH DEFINITION |\n|---------------|--------|---------|-------------------|\n| 의결교증 脈訣巧證 | 脈訣巧證 | A book of clever proof on the pulse. |\n| 의결비숙화서 脈訣非叔和書 | 脈訣非叔和書 | Pi-sook-wha's book on the pulse. |\n| 의학귀경판의 脈學奇經八脈 | 脈學奇經八脈 | Eight beautiful rules of the canon of pulse science. |\n| 신농본경명례 神農本經名例 | 神農本經名例 | Rule of the original canon of Sil-long-se. |\n| 력대제가본초 歷代諸家本草 | 歷代諸家本草 | Catalogue of medicine of all the households of the preceding dynasties. |\n| 도씨별록합약 陶氏別錄合藥 | 陶氏別錄合藥 | The rule of gathering and\n분제법 측 分 剂 法 則 dividing medicine according to the special records of Do-se.\n\n의림종약 醫 林 輯 略 A summary of brief extracts from various authors.\n\n본초화 本 草 話 A catalogue of remarks on medicine.\n\n성신한람 擬 生 開 覽 Important decision on the preservation of health.\n\n소시용약례 四 時 用 藥 例 Rule of the use of medicine according to the four seasons.\n\n승강비요 升 降 備 要 Seung-Kang Pi Yo.\n\n지약비고 奇 藥 備 考 Wonderful remarks on medicine.\n\n약성원칙 藥 性 原 解 Original interpretation of the nature of medicine.\n\n지미음양 氣 味 陰 陽 Original remarks on sex.\n\n승강부침 升 降 浮 沈 To float and sink alternately, as if to ascend and descend.\n\n표본음양 標 本 陰 陽 The primeval force developed from original remarks.\n\n오미편승 五 味 偏 勝 Five tastes contraindicating the use of medicine.\n\n복약금기 服 藥 禁 忌 Medicines to be avoided.\n\n임신금기 妊 娠 禁 忌 How to avoid becoming pregnant.\n\n오미의기 五 味 宜 忌 Five tastes to be avoided.\n\n십칠 제제 七 劑 A treatise of ten remedies.\n\n리동원수증 李 東 垣 隨 症 Seven kinds of medicine.\n\n용약례례 用 藥 例 Rule of treating disease according to Yi-Song.\n\n진장기제허 陳 藏 器 諸 虛 Chin-chang-ke’s rule of the use of medicine in chronic diseases.\n\n용약례례 用 藥 例\n\n장조화한법 張 子 和 汗 The rule of three; diaphoretic, emetic and purgative.\nRules for emetics.\n\nRules for purgatives.\n\nRules for diaphoretics.\n\nIV. In 1608 A.D., just 215 years after E-se-chin (리시진 李時珍) revised the Pon-cho, the Emperor Sin-chong (신종 神宗) of the Mung (명 明) (Ming) dynasty issued a proclamation throughout his empire making diligent inquiry of every man for the best treatise on the subject of medicine known to the Chinese people. Whereupon an heir of E-se-chin (리시진 李時珍) took the revised Pon-cho to the royal court of his majesty. (a) The royal household physician, You-han (류한 劉漢) by virtue of his position became the head of the Royal Commission before whom came all replies and findings on the subject in question. After having examined the revised Pon-cho, the Royal Commission pronounced it most excellent, in testimony thereof the Emperor's Seal was placed upon it. (b) The Emperor ordered it copied and made into a book which is the first mention of the Pon-cho being anything more in form than a manuscript, as the word signifies. From this time on the Pon-cho became the recognized standard for Chinese medicine. The Emperor also ordered that the book be taught to the \"Clever sons\" of the empire according to their selection by the doctors. (c) The Pon-cho is a book of varying proportions, but the subject matter is the same in all the editions. The smallest number of volumes found in any one edition was fifteen, and the greatest number was fifty two. The script is all in Classic Chinese (순한문 純漢文). It contains many drawings of animals, snakes, birds, plants, flowers and vegetables, representing in all one thousand eight hundred and seventy one agents, described in 60 parts and having a diagnostic and a therapeutic index.\n\nCLASSIFICATION OF MEDICINE ACCORDING TO THE PON-CHO.\n\n| Korean | Chinese | English Translation |\n|--------|---------|---------------------|\n| 던슈류 | 天水類 | 13 Products of paddy fields watered by the rains. |\n| Products of paddy fields watered from the ground. |\n| Fire, Atmospheres, Flame, Fever, etc. |\n| Earth. |\n| Gold stone. |\n| Precious stones. |\n| Stone (I). |\n| Stone (II). |\n| Stone |\n| Mountain grass (I). |\n| Mountain grass (II). |\n| Green grass. |\n| Damp grass (I). |\n| Damp grass (II). |\n| Poisonous grass. |\n| Mushroom found growing on rocks and pine wood. |\n| Five Fruits. |\n| Appetizing fruit. |\n| Vine grass (I). |\n| Vine grass (II). |\n| Water grass. |\n| Stone grass. |\n| Vallisneria spiralis, a water-plant. |\n| Various grasses |\n| Hemp, Barley and Rice. |\n| Panicled millet and millet. |\n| Beans. |\n| Brewing of alcoholic liquids. |\n| Peppery and acrid Vegetables. |\n| Soft vegetables. |\nCucumbers, melons, and vegetables.\n\nWater vegetables.\n\nMountain fruit.\n\nMiscellaneous fruits.\n\nHousehold goods.\n\nCucumbers.\n\nWater fruit.\n\nFragrant wood.\n\nOld wide spreading trees such as Zelkova Keaki.\n\nShrubs.\n\nParasitic plants, like mistletoe.\n\nBamboo.\n\nMiscellaneous trees.\n\nIndex of the species of trees.\n\nForest animals.\n\nMountain animals.\n\nDomestic animals.\n\nBeasts.\n\nRats.\n\nParts of human body.\n\nFamous remedies.\n\nEgg embryo (I).\n\nEgg Embryo (II).\n\nTransformed beings.\n\nCentipedes.\n\nEarth worms (?)\n\nDragon\n\nSnakes.\n\nFish.\n\nSkin Fish (without scales).\n\nAllied species of skin fish (?)\nTortoise and fresh water turtles.\n\nMussels, clams and bivalves.\n\nWater fowls.\n\nSquab, fowls.\n\nV. Twenty years after the Pon-cho received imperial recognition by the Emperor Sin-chong, (신종 神宗) the famous Chinese and Korean Market called Moon-chang (문장 門場) was established in N.E. China in the Laotung or Yo-tong (요동 遼東) province 700 li (333 1/3 English Miles) from the nearest Korean prefect, Wiju (의주 義州) and 300 li (100 English miles) from the Eastern border of the Laotung or Yo-tong province which was the Yalu River, the N.W. Boundary of Korea. This market was established at the close of the Mung (Ming) (명 明) dynasty in the year 1628 A.D., and was continued for a period of 230 years during which time it was the greatest ginseng (인삼 人蔘) market in the world. The market was as the word signifies the \"Door of trade\" for Korea in China. It was the only point in Chinese territory at that time open to the Korean merchantmen. The Koreans took their merchandise there for disposal and the Chinese did likewise. The trade consisted chiefly of ginseng from Korea and silk from China; however there were other commodities bought and sold by both countrymen. The Pon-cho became the official catalogue of classification for all medicines of the two countries and any one not contained in the Pon-cho was marketed under some disadvantage. In the meantime Korean Medicine of various kinds developed in point of importance both in practice in Korea and in commerce at the Moon Chang. The book of antiquity, the Pon-cho, no longer covered the new field of medicine which had sprung up from Korea, therefore the necessity arose for either revising the Pon-cho again or of writing an entirely new book on medicine in order to conserve the trade interests of the Korean constituency. In the first instance a revision of the Pon-cho by a\nKorean who most needed it, would have been a failure as a business proposition since the Chinese preferred the old to the new, and also, because Korea was to China only a child and surely what was not bred in the bone of a Chinaman could not come out in the flesh of a Korean.\n\nVI. Therefore a new book called the Pang-yak-hap-pyun (방약합편 方藥合編) was written by one Whang-do-soon (황도순 黃道淳) a Korean doctor and scholar of the Chinese classics living at Sauk-chung-dong (석정동 石井洞) Seoul, Korea. For all ethical intents and purposes, the author incorporated the fundamentals of the Pon-cho in his new book. In introducing the book the author used the name of the great teacher Confucius, whom he claimed to represent, admonishing all who should read the book to follow its precepts as the author had done, thereby dispelling all doubt as to authenticity in the minds of the Chinese to whom the drugs were to be sold and justifying the practice of Korean medicine in Korea. The book was written in mixed script (Chinese context with Korean connectives). The first edition was published in the 447th year (1839 A.D.) of the Yi (이 李) dynasty (Korea) seventy six years ago. Eleven years later the second edition appeared. The third and present edition appeared just sixteen years after the first, all of which were written by the same author. The first edition appeared just twenty years before the Moon-chang (문장 門塲) the border market or the \"door of trade\" was discontinued. Following the third and last revision of the book the market continued for only four years.\n\nVII. The Pang-yak-hap-pyun (방약합편 方藥合編) is a book of only 58 pages containing a diagnostic index of diseases and therapeutic indications for the use of 223 agents as medicine.\n\nThe book answers more nearly to the description of a catalogue of medicine and is practically so regarded, but it does not contain a price list of any description. It is in all essentials a tradesman's commentary on medicine, embodying many prescriptions for as many ills. Many of these prescriptions are\npopularly known to the laity who buy them from the drug shops, Sil-long you-aup (신농유업 神農遺業) and take them home to use after the fashion of domestic medicine.\n\nSA-AN-TONG'S EYE WASH.\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n|               | 당귀   | 當歸    | A drug supplied by several members of the Umbelliferae family. |\n|               | 황련   | 黃連    | Rhizomes of the Coptis teeta. |\n|               | 적작약 | 赤芍藥  | The roots of Paeonia albiflora. |\n|               | 방풍   | 防風    | Caraway seed. |\n|               | 힘인   | 杏仁    | Apricot seed. |\n|               | 성디황 | 生地黃  | Rehmannia glutinosa. |\n\nUses—A wash for sore eyes.\n\nKOONG-RE-TANG'S GINSENG REMEDY.\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n|               | 천궁   | 川芎    | A kind of medicine used for head troubles and as a tonic. |\n|               | 당귀   | 當歸    | A drug supplied by several members of the Umbelliferae family. |\n|               | 반하   | 半夏    | Pinellia ternata, a bean-like medicinal plant. |\n|               | 봉출향 | 蓬木香  | Mugwort and Atractylis ovata. |\n|               | 인약   | 砂仁    | Putchuck root. |\n|               | 사오감 | 烏藥    | Inferior cardamons. |\n|               | 인계   | 甘草    | Lindera strychnifolia. |\n|               | 초상피 | 桂皮    | Licorice. |\n|               |        |         | Ginseng. |\n|               |        |         | Cinnamon bark. |\n\nUses—A remedy for dropsical conditions.\n### NUMBER II, STOMACH MEDICINE.\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n| 창출 | 蒼术 | Atractylis ovata. |\n| 진피 | 陳皮 | Dried orange-peel. |\n| 후박 | 厚朴 | The Magnolia hypoleuca. |\n| 반하 | 半夏 | Pinellia ternata, a bean like medicine plant. |\n| 적복령향상 | 赤茯苓香藿香人参草果 | Red China \"root.\" |\n| 과인초 | 草果 | Betony of bishopwort. |\n| 감초 | 甘草 | Ginseng. |\n| 감초감초 | 甘草 | The ovada cardamon. |\n| 감초 | Licorice. |\n\nUses:—Summer dispepsia.\n\n### A DIARRHOEA REMEDY.\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n| 당귀 | 當歸 | A drug supplied by several members of the Umbelliferae family. |\n| 초롱당천궁 | 草龍膽川芎 | Gentiana scabra. |\n| 외대강방 | 桃子黃花防風活 | A kind of medicine—used for head troubles and as a tonic. |\n| | | The seed of a kind of aspen. |\n| | | Rhubarb. |\n| | | The Peucedanum decursivum. |\n| | | Caraway seed. |\n\nUses:—A liver regulator.\n\n### THE FOUR MEDICINE REMEDY.\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n| 숙디황백작약 | 熟地黃白芍藥 | Cooked Rehmannia glutinosa. |\n| | | White roots of Paeonia albiflora. |\nA kind of medicine—used for head troubles and as a tonic.\n\nA drug supplied by several members of the Umbelliferae family.\n\nUses:—Tonic expectorant for cough, spitting of blood, etc.\n\n**E-Chung Tang's Internal Remedy.**\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n| 인삼출강초건강감초 | 人蔘白术乾薑甘草 | Ginseng. A variety of Atractylis ovata. Dried ginger. Licorice. |\n\nUses:—For jaundice and vomiting.\n\n**Sam-So-Um's Ginseng and Perilla Nankmensis.**\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n| 인삼엽호하소전반 | 人蔘蘇葉前胡半夏 | Ginseng. Perilla nankmensis. Angelica. Pinellia ternata, a bean-like medicinal plant. |\n\nUses: For \"colds\" accompanied by fever.\n\n**Pal-Mul's Medical Decoction of Eight Ingredients.**\n\n| Medicine Name | Korean | Chinese | English |\n|---------------|--------|---------|---------|\n| 인삼출 | 人蔘白术 | Ginseng. A variety of Atractylis ovata. |\nWhite China \"root.\"\nLicorice.\nCooked Rehmannia glutinosa.\nWhite roots of Paeonia albiflora.\nA kind of medicine—used for head troubles and as a tonic.\nA drug supplied by several members of the Umbelliferae family.\n\nUses:—For impoverished blood and general debility.\n\nYONG SUK SAN'S CAMPHOR AND CALCAREOUS SPAR REMEDY.\n\nMedicine Name\n\n| Korean | Chinese | English |\n|--------|---------|---------|\n| 한수석 | 寒水石 | A calcareous spar. |\n| 쥬사 | 朱砂 | Cinnabar. |\n| 룡뇌 | 龍腦 | Camphor. |\n\nUses:—For croup in children.\n\nCHUNG-WHA-PO-UM'S FEVER ERADICATOR AND NERVE TONIC.\n\nMedicine Name\n\n| Korean | Chinese | English |\n|--------|---------|---------|\n| 현삼 | 玄蔘 | A kind of medicinal plant, Scrophularia Oldhami. |\n| 박작약 | 白芍藥 | White roots of Paeonia albiflora. |\n| 숙디황 | 熟地黃 | Cooked Rehmannia glutinosa. |\n| 당귀 | 當歸 | A drug supplied by several members of the Umbelliferae family. |\n| 천궁 | 川芎 | A kind of medicine—used for head troubles and as a tonic. |\n| 황박 | 黃柏 | The yellow bark of the Phellodendron amurense. |\n| 지모 | 知母 | Anemarrhena asphodeloides. |\n| 덴화분 | 天花粉 | Starch obtained from the root of the Trichosanthes japonica. |\n| 감초 | 甘草 | Licorice. |\nUses:—For fever and to increase the negative principle in one's nature.\n\nPYENG WE SAN'S STOMACH REMEDY.\n\nMedicine Name\n\n| Korean | Chinese | English          |\n|--------|---------|------------------|\n| 창출    | 苍术    | Atractylis ovata. |\n| 진피    | 陳皮    | Dried orange-peel. |\n| 후박    | 厚朴    | The Magnolia hypoleuca. |\n| 감초    | 甘草    | Licorice.         |\n\nUses:—For cramps of the stomach following the ingestion of food.\n\nThe amount of each ingredient contained in the foregoing formulas averages from 25 to 75 grains, making a quart of finished decoction. The more progressive practitioners of native medicine regard the Pang-yak-hap-pyun with scorn, because they look upon any book of medicine that is not written in classic Chinese as being too inferior for their consideration. In fact for a practitioner of native medicine to depend upon a copy of the Pang-yak-hap-pyun only is considered prima facie evidence that he can not read classic Chinese, otherwise he would do so and avail himself of the store of knowledge contained therein. Therefore it is to be noted that there are two classes of these practitioners of native medicine, namely, those who read classic Chinese and those who can not, a distribution which is known and recognized by even the laity.\n\nACUPUNCTURE.\n\nVIII. Acupuncture bears the same relation to native medicine as surgery does to modern day scientific medicine. The essentials of this art and practice are taken from the Whang-chai-yung-choo-kyung (황제령추경 黃帝靈樞經), one of the two books originating in the Whang (황제 黃帝) dynasty (2697–2597 B.C.). The authorship of this book and its fellow is ascribed to the Emperor. Whether or not the ruler was the real author or whether the title was given honori-\nficially, and the real author remained unknown, is doubtful. It may be noted that such manuscripts as appeared in this dynasty and the one preceding are ascribed to the founder of the dynasty, but after this time a different order obtains—(see chronological chart). Therefore Emperor Whang (황황) bears practically the same relation to acupuncture as Sil-long-se (신농씨 神農氏) does to native medicine.\n\nOf the two books referred to as occurring in this dynasty, the one mentioned is the only one which deals with the art of acupuncture and for this reason the other book will not be considered further.\n\nThe fundamental principle underlying this practice is based on the assumption that the blood becomes stagnated and will not flow properly through the natural channels of the body. Acupuncture is also believed to hasten relief, over and above what might be expected from the use of drugs.\n\nThe Korean name for this art is \"Ch'im\" (침針) which is a term applied to any kind of an instrument used in piercing the flesh of the body, however the term in its original use and the one adhered to in this discussion was applied to needles only. At some subsequent time however the word jim (침灸) came to be used, but to signify a different form of treatment by the application of heat with or without medicine. The jim is altered by modifiers to indicate what article is employed, for instance the mugwort (Artemesia) a weed growing in all parts of Korea, is used quite extensively for this purpose under the name of Sook jim (숙침 艾灸) which is employed in two forms, the poultice and the fire ball. The poultice is prepared by boiling a quantity of the leaves and the stalk, then placing it in a cloth and wringing until the water is expressed. The hot pulp remaining is then used as a poultice. The fire ball called 쓰 or 쓰 is made by crushing a small quantity of the stalk and rolling it between the palms of the hands, after which the ball, varying in size from a pea to a walnut, is set on fire and placed over different portions of the body. The \"Pillow jim\" (목침침 木枕灸) is made by heating the wooden block on\nwhich the Koreans rest their heads while sleeping and applying it to different portions of the body for various ailments. With this explanation of the jim, (찜 炎) or the second term, the discussion of the ch’im, the first and original word will now be resumed.\n\nIn 59 A.D. during the reign of Choong Mung (중명 中明) appeared the Wee-hak-eep-moon (의학입문 醫學入門) a medical Primary in which is included a few more rules for the application of the ch’im and elaborating on the rules of the Whang-chai-yung-choo-kyung, (황대령추경 黃帝靈樞經) the original source of the ch’im practice. After this there appeared a succession of books, but none of them were of any special significance until 420 A.D., when the Tong-eeen-kyung appeared, which was written by one Wang-you-il (왕유일 王維一). This author modeled a man out of copper, which is signified by the title of the book, meaning the Copper man book. He elaborated on all the previous teachings of his predecessors and constructed a chart illustrative of the Copper man’s anatomy, which is to this day the accepted standard of anatomy amongst the practitioners of native medicine. In connection with this anatomical scheme it was believed that there are (1) blood vessels (2) nerves and (3) channels.\n\nThere are five kinds of channels illustrated (a) The spleen and stomach (비위경 脾胃經) (b) the liver (간경 肝經) (c) the lung (폐경 肺經) (d) pericardium (심포경 心包經) and the (e) gall (담경 胆經).\n\n(a) The channels given off from the spleen and stomach convey nutritious material for final distribution to the different parts of the body.\n\n(b) This organ gives off channels for the distribution of gall and it is believed, now as it was then, that the eye is directly connected with the liver by means of a gall channel, which accounts for the yellowish discoloration of the eye in jaundice.\n\n(c) The channels originating from this organ are suppos-\ned to contain air during foetal life but after birth when respiration is established blood in supposed to enter, which continues through life.\n\n(d) The oil channels are connected with an oil sac remotely situated in the region below the diaphragm. This probably corresponds to the omentum and possibly the base of the mesentery.\n\n(e) These channels are confined to the upper half of the body and they have no connection with the liver. They are the receptacles for a complimentary fluid which is supposed to be the seat of courage.\n\nAll the above named channels are supposed to contain blood but in a modified form, due of course to the presence of the respective substances which they receive and convey.\n\nThe chart of anatomy consists of three parts, Sam Cho 삼초 三焦.\n\n(1) Regional (2) Visceral (3) Surgical.\n\nThe Regional consists of three divisions:\n\n(a) Upper third of the trunk—thorax, Sang Cho 상초 上焦\n\n(b) Middle third of the trunk—abdomen, Chung Cho 중초 中焦\n\n(c) Lower third of the trunk—lower abdomen, Ha Cho 하초 下焦\n\n(2) The Visceral—In this chart there are 32 anatomical structures named, which may be noted by referring to the chart. See chart number I.\n\n(3) The Surgical—The blood vessels, nerves and channels represent the chief items of consideration. These structures are described as large and small, with erroneous origins and distributions, except for the fact that some of the blood vessels are shown to originate in the heart. The nerves are supposed to originate independent of the brain and cord and have abrupt endings. Along the supposed courses of these blood vessels, nerves and channels, certain points for the application of the chim are described in great detail. Each point is described as a\nseparate operation for a different group of symptoms all of which are based on the pulse law, but there is no definite principle taught in any of the pulse laws and the observer is left to exercise his own judgment and to formulate his own interpretation of the symptoms. These points, described as sites for the application of the ch'im, are determined by surface measurements from a given point in the respective region. See charts II and III.\n\nFor example—on the face, these points are determined by measurement in a given direction from the corner of the eye.\n\nOn the forehead—from a point midway between the eye brows.\n\nShoulder region—from the center of the axilla and the point of the shoulder; the chest—from the center of the mammary gland and from the cardinal point at the end of the sternum where the aorta is supposed to end.\n\nThe abdomen—from the umbilicus. The Pelvis—from the center of the pubic arch in front and the center of the sacrum behind.\n\nOn the limbs—from points before, behind and from either side.\n\nThe extremities—from the ball of the foot and great toe.\n\nThe toes—from the 1st and 2nd joints of each. The same rule applies to the hands and fingers. Special stress is laid on the significance of all promontories of the body as suitable points for the application of the ch'im.\n\nThe total number of operations described and the corresponding number of groups of symptoms indicating the operation are one hundred and sixty, but for the sake of brevity only a few are herein given. The majority of the names of the operations have no special significance or corresponding meaning in English, therefore it would be of no special value to burden these pages with all their names.\n\nExample:\n\nOperation No. 2. \"Cloudy gate\" (운문 雲門) or Axilla. Cauterize five times \\( \\frac{3}{10} \\) of an inch deep for the relief\nof stomach sickness, painful arms and back, stopping of chest, cough and indigestion.\n\nNo. 15—\"Gathering Valley\" (합곡 合谷). Cauterize three times \\( \\frac{2}{10} \\) of an inch deep between the thumb and forefinger for headache, foul sores, painful eyes, ringing of ears, sore mouth and throat, toothache, fever and malaria.\n\nNo. 24—\"Five Li\" (오리 五里). Three inches up the arm from the elbow. Use no needle but cauterize ten times for spitting of blood, painful arm and shoulder, weak arms and legs, fever, enlarged glands of the neck, cough and malaria.\n\nNo. 27—\"Big Barn\" (거골 巨骨). Cauterize \\( \\frac{15}{100} \\) of an inch deep three times between the shoulder and neck for blood poison of chest, aches of the shoulder, arm and back.\n\nNo. 28—\"Heaven pot\" (천정 天鼎) cauterize one inch after the Poo-tol (부들 扶突) \\( \\frac{4}{10} \\) of an inch deep, 3 times for the dumps, sore throat and hard breathing.\n\nOther ambiguous names given to these operations are—\"four white\"—\"earth barn\"—\"welcome\"—\"man welcome\"—\"house itch\"—\"milk center\"—\"milk root\"—\"water root\"—\"return\"—\"calf nose\"—\"three li\"—\"young sea\"—\"small sea\"—\"bent wall\"—\"heaven window\"—\"hearing hole\"—\"through sky\"—\"germ pillow\"—\"heaven post\"—\"three focus\"—\"white ring,\" etc.\n\nThe next book in order is the Chun Kum Pang (천금방 千金方), \"a thousand gold,\" written in 632 A.D. which is practically a repetition of the foregoing with individual interpretations by the author. The Ch'ım-Koo-Tai-Sung (청구대성 针灸大成) 1682 A.D. is a book devoted exclusively to the use of the ch'ım and is the first instance of any book being devoted to this subject alone. It delineates the virtues of the ch'ım and describes the successes obtained by this method of treatment, which is also the first attempt to give anything like a clinical account of results. It introduces a new ch'ım which the author calls a Yak jim (약침 藥灸) or \"medicine jim.\" This jim has been described in the foregoing pages.\n\nThis chronology of medical books brings the subject down\nto the Yi (李) dynasty (Korea). There is one book, Tong-wee-paw-kam (동의보감東醫寶鑑) of Korean origin written by one Haw-Choon (허준許浚) and entitled \"A valuable treatise on Oriental Medicine,\" that is much employed by practitioners of native medicine who regard it as a reliable source of information for both medicine and acupuncture. Of late years the book has been revised and the old copper man's anatomy has been replaced with modern cuts taken from European anatomical books. However the old sect of practitioners of native medicine do not accept these innovations and they continue to believe in the old copper man anatomy.\n\nThe other books originating in Korea and included in the chronological outline do not treat of the subject of acupuncture.\n\nThe following is a list of books taken from the Chronological Outline of the Korean Library of Medicine already given to show which ones are concerned with the subject of acupuncture.\n\n| KOREAN          | CHINESE            | ENGLISH         |\n|-----------------|--------------------|-----------------|\n| 황제령추경       | 黃帝靈樞經        | Wang-chai.      |\n| 의학입문        | 醫學入門          | Wee-hak-eep-moon. |\n| 동원십서        | 東垣十書          | Tong-won-sip-saw. |\n| 동란경          | 難經              | Nan-kyung.      |\n| 동인경          | 銅人經            | Tong-teen-kyung. |\n| 천금방          | 千金方            | Chun-kum-pang.  |\n| 침구대성        | 針灸大成          | Ch'im-koo-tai-sung. |\n| 동의보감        | 東醫寶鑑          | Tong-wee-paw-kam. |\n\nIX. In 1913 all the practitioners of native medicine in Seoul, Korea, were requested by the Japanese authorities to assemble for the purpose of effecting an organization, which was done. A chairman and secretary were elected and a membership of one hundred and fifteen was recorded in this organization. Each member of the organization who presented a membership certificate signed by the chairman and secretary of the organization, accompanied with a registration fee, to the police department, was granted an article of writing (March 1914) conferring upon the applicant the title of \"Scholar of\nMedicine” 의성醫生 which in effect is a license to practice native medicine in Korea for a period of five years. Later this was extended to cover the life time of the doctor so licensed.\n\nThis unique regulation has served the purpose of incorporating this class of practitioners under government supervision and preventing the perpetuation of the practice of native medicine in Korea.\n\nX. In the preceding paragraphs the evolution of medicine from prehistoric times has been outlined—its appearance upon the far horizon of history in China and its introduction into Korea has been set forth. The old manuscripts of Chinese origin buried from the English-speaking world in a mass of strange and scattered hieroglyphics have been brought to light for our perusal. The knowledge gained by this study will not, of necessity, give to us in this 20th century of intellectual environment greater energy of thought, but it will give us a better understanding of the life-story of Oriental medicine and its history in Korea.\nANATOMICAL CHARTS\nEXPLANATION OF ANATOMICAL CHART. No. I\n\n1. Brain.\n2. Throat.\n3. Lungs.\n4. Pericardium.\n5. Heart.\n6. Spleen.\n7. Diaphragm.\n8. \"Oil Sac,\" omentum?\n9. Stomach.\n10. Neck of spleen. ligament?\n11. Neck of stomach. cardia?\n12. Neck of liver. Inf. vena cava?\n13. Internal Anus. pylorus?\n14. Liver.\n15. Small intestines.\n16. Inside of large intestines.\n17. Large intestines.\n18. Gall Bladder.\n19. Kidney.\n20. Original source of urine. Renal vessels?\n21. Urethral sphincter.\n22. Bladder.\n23. Straight intestines.\n24. Center of breast.\n25. Navel.\n26. Inside face of navel.\n27. Urinary meatus.\n28. Sphincter.\n29. End of large intestine.\n30. Anus.\n31. Seven parts of heart.\n32. Three parts of spinal column.\n\nI. Thoracic Portion.\nII. Abdominal ,\nIII. Pelvic ,\nANATOMICAL CHART No. 1.\n## CHRONOLOGICAL OUTLINE OF THE KOREAN LIBRARY OF MEDICINE\n\n### CHINA\n\n| Dynasty | Date           | Book   | Name               | Definition                  | Author                    | Degree     |\n|---------|----------------|--------|--------------------|------------------------------|---------------------------|------------|\n| 신농씨   | 2383-2648 B.C. | Korean | 본초               | An original manuscript      | 신농씨                     | 황제       |\n| 神農氏   |                | Chinese| 本草               |                              | 神農氏                     | 炎帝       |\n|         |                | English| Pon-Cho            |                              | Sil-long se                | Emperor    |\n| 천원씨   | 2697-2597 B.C. | Korean | 황해소문            | A treatise on medicine      | 천원씨                     | 황제       |\n| 軒轅氏   |                | Chinese| 黃帝素問            |                              | 軒轅氏                     | 黃帝       |\n|         |                | English| Whang chai-so moon |                              | Whang chai hon-one se      | Emperor    |\n|         |                | Korean | 황해정속경          | A treatise on medicine      | 천원씨                     | 황제       |\n|         |                | Chinese| 黃帝續編經          |                              | 軒轅氏                     | 黃帝       |\n|         |                | English| Whang chai-yung choo kyung |                        | Whang chai hon-one se      | Emperor    |\n| 중명     | 76-59 A.D.    | Korean | 경악전서            | A treatise on medicine      | 장기빈                     | 医師       |\n| 中明     |                | Chinese| 慶岳全書            |                              | 張介賓                     | 醫師       |\n|         |                | English| Kyung ak chun-saw  |                              | Chang gai-peon             | Physician  |\n|         | 59 A.D.        | Korean | 의학입문            | A medical primary           | 리정                       | 医師       |\n|         |                | Chinese| 醫學入門            |                              | 李健                      | 醫師       |\n|         |                | English| Wee-hak-cep moon   |                              | E.Chung                    | Physician  |\n| Dynasty | Date       | Book   | Name                  | Definition                        | Author     | Degree |\n|---------|------------|--------|-----------------------|-----------------------------------|------------|--------|\n| 后漢    | 223-221 A.D. | Korean | 금제우함경              | A treatise on medicine            | 장기       | 의원   |\n|         |            | Chinese| 金櫃玉函經            |                                    | 張機       | 醫員   |\n|         |            | English| Kum gay-ok-ham-kyung  |                                    | Chang-ke   | Physician |\n| 원      | 260-227 A.D. | Korean | 동원십서               | A library of ten volumes on medicine | 리고        | 의원   |\n|         |            | Chinese| 東垣十書              |                                    | 李杲       | 醫員   |\n|         |            | English| Tong-won sip-saw      |                                    | E-ko       | Physician |\n|         | 260 A.D.   | Korean | 하간육서               | A library of six volumes on medicine | 류완소     | 의원   |\n|         |            | Chinese| 河間六書              |                                    | 劉完素     | 醫員   |\n|         |            | English| Ha-kan-yuke-saw       |                                    | You-wan-so | Physician |\n| 진      | 284-286 A.D.| Korean | 난경                  | A list of diseases not hard to control | 편작       | 의원   |\n|         |            | Chinese| 難經                  |                                    | 扁鵲       | 醫員   |\n|         |            | English| Nan-kyung             |                                    | Pyun-chak  | Physician |\n| 송      | 420 A.D.   | Korean | 동인경                | A treatise on medicine and anatomy | 왕유일     | 의원   |\n|         |            | Chinese| 銅人經                |                                    | 王維一     | 醫員   |\n|         |            | English| Tong-een-kyung        |                                    | Wang-you-il| Physician |\n| 당      | 61c-632 A.D.| Korean | 천금방                | A treatise on medicine            | 손사막     | 의원   |\n|         |            | Chinese| 千金方                |                                    | 遠思邈     | 醫員   |\n|         |            | English| Chun-kum-pang         |                                    | Son-sa-mo  | Physician |\n| 明      | 1375 A.D.  | Korean | 의학정전              | A treatise on medicine            | 우박       | 의원   |\n|         |            | Chinese| 醫學正傳              |                                    | 周博       | 醫員   |\n|         |            | English| Wee-hak-chung-chun    |                                    | Oo-pak     | Physician |\n| Year       | Language   | Title                                                                 | Description                                      | Author          |\n|------------|------------|----------------------------------------------------------------------|--------------------------------------------------|-----------------|\n| 1375 A.D. | Korean     | 만병회초                                                      | A remedy for every ill.                          | Kong-sin        |\n|            | Chinese    | 萬病回春                                                      |                                                  | Physician       |\n|            | English    | Man-pyung-whay choon                                             |                                                  |                 |\n| 1375 A.D. | Korean     | 증치준증                                                      | A rule of control in disease                    | Wang-oo-tai     |\n|            | Chinese    | 證治準繩                                                      |                                                  | Physician       |\n|            | English    | Choong che choor-sung                                           |                                                  |                 |\n| 1375 A.D. | Korean     | 본초강목                                                      | A revision including the general features of the original manuscript. (Pon Cho) | Ese-chin        |\n|            | Chinese    | 本草綱目                                                      |                                                  | Physician       |\n|            | English    | Pon-cho-kang mok                                               |                                                  |                 |\n| 1375 A.D. | Korean     | 장씨류경                                                      | A treatise on medicine                           | Chang gai peen  |\n|            | Chinese    | 張氏類經                                                      |                                                  | Physician       |\n|            | English    | Chang se you kyung                                             |                                                  |                 |\n| 1650-1660 A.D. | Korean | 의문법통                                                      | A law of medicine                               | You chang       |\n|            | Chinese    | 醫門法律                                                      |                                                  | Physician       |\n|            | English    | Wee-moon paup yule                                             |                                                  |                 |\n| 1657-1688 A.D. | Korean | 의종금강                                                      | Instructions for first aid                       | O chun-kum      |\n|            | Chinese    | 醫宗金鑑                                                      |                                                  | Physician       |\n|            | English    | Wee-chong kunn-kan                                             |                                                  |                 |\n| 1896-1910 A.D. | Korean | 침구대성                                                      | A treatise on acupuncture by needle and cautery | Yang-kai choo   |\n|            | Chinese    | 針灸大成                                                      |                                                  | Physician       |\n|            | English    | Chinn-koo-tai-syung                                            |                                                  |                 |\n| Dynasty | Date       | Book       | Name                        | Definition                                      | Author          | Degree   |\n|---------|------------|------------|-----------------------------|-------------------------------------------------|-----------------|----------|\n|         | 1392-1909  | Korean     | 위성의방선요                  |                                                 | 세종             | 의성     |\n|         |            | Chinese    | 衛生醫方選要                 |                                                 | 世宗             | 醫生     |\n|         |            | English    | Way-saing-wee-pang-syen-yo  |                                                 | Say-chong        | Physician |\n|         | 1526 A.D.  | Korean     | 동의보감                     | A valuable treatise on Oriental medicine        | 허준             | 의원     |\n|         |            | Chinese    | 東醫寶鑑                     |                                                 | 許浚             | 醫員     |\n|         |            | English    | Tong-we-po-kam              |                                                 | IIaw-choon       | Physician |\n|         | 1777 A.D.  | Korean     | 제중신편                     |                                                 | 강명길            | 의원     |\n|         |            | Chinese    | 濟衆新編                     |                                                 | 康命吉            | 醫員     |\n|         |            | English    | Chai-choong-sin-pyun        |                                                 | Kang-myung-keel  | Physician |\n|         | 1801 A.D.  | Korean     | 방약합편                     | A treatise of medicine containing prescriptions | 황도순            | 의원     |\n|         |            | Chinese    | 方藥合編                     |                                                 | 黃道淳           | 醫員     |\n|         |            | English    | Pang-yak-hap-pyun           |                                                 | Wang-tow-soon    | Physician |\n|         | 1839 A.D.  | Korean     | \"                            | Revision                                        | 황도순            | 의원     |\n|         |            | Chinese    | \"                            |                                                 | 黃道淳           | 醫員     |\n|         |            | English    | \"                            |                                                 | Wang-tow-scon    | Physician |\n|         | 1855 A.D.  | Korean     | \"                            | Revision                                        | 황도순            | 의원     |\n|         |            | Chinese    | \"                            |                                                 | 黃道淳           | 醫員     |\n|         |            | English    | \"                            |                                                 | Whang-tow-soon   | Physician |\nAFFORESTATION IN KOREA.\n\nREV. E. W. KOONS.\n\nNOTE.—The manuscript of this article was submitted to the Department of Forestry (森林課) of the Government-General, and the changes and corrections kindly made there have been incorporated in it as printed.\n\nThe traveller who coasts, as many of us have done, along the shores of this Peninsula, and finds only desolate, rain-scarred hill-sides, will decide even before he has set foot on the land, that he can dismiss \"Forestry\" from his note-book with the single entry, reminiscent of the well-known chapter on \"Snakes in Ireland,\" \"There is no Forestry in Korea.\"\n\nAnd even though he traverses the country from end to end on the Fusan-Wiju Railway, he will find little reason for changing his mind on this matter. Yet as a matter of fact, more than 4/5 of the whole area is under the jurisdiction of the Forestry Bureau, and more than ¼ is covered to-day with virgin forests, of stately pines and sturdy oaks; while the larger forest animals, bears, leopards, and tigers, roam the lonely glades, and prey upon the deer and boar there.\n\nIt may be well to mention in passing a matter of strictly historic interest. Though the causes of the war between Russia and Japan were many and complex, the final occasion was a Forestry Concession in Korea. The Russians had permission to cut and handle lumber on the Yalu, and with this as a pretext, they had made a settlement at the little port of Yongampo, at the mouth of the Yalu. Their refusal to abandon this was the match which lighted the great conflagration.\n\nIn the Summer of 1904 I visited Yongampo, and saw the one-time Russian lumber mills running at full capacity, with a host of Chinese, Japanese, and Korean hand-sawyers also at work. I have never seen finer timber than the great 40 and 60 foot pieces that had come down to them from the forests of North Pyeng An Province (平安北道).\nThe figures used in this article are from the Government publications, chiefly the 1914 edition of \"Latest Korea\" (最近朝鮮事情)—I wish here to express my gratitude to those who furnished the information, and so carefully revised my hasty figures. Also I should say that most of the hard work of gathering and translating the material was done by Mr. W. C. Narh, Teacher of Natural Sciences in the John D. Wells Academy, who has made a specialty of Forestry, and kindly put all his knowledge of technicalities at my service.\n\nThe Forestry Bureau issues a remarkably fine map, showing with great detail the location of all Forest Areas. The areas covered with big trees are in green, those covered with brush and small trees in red, the land available for afforestation in yellow, and the cultivated areas in white. A glance at this shows that the greater part of the real forests are in the far North. But all through the country are scattered forests of good size, some of them in or near Seoul itself.\n\nThese trees have been protected by their inaccessibility, or for religious or sentimental reasons. The former consideration accounts for the great forest stretches in Ham Kyung (咸鏡道), Kang Won (江原道) and Pyeng An (平安道) Provinces. The \"sacred groves\" surrounding temples, shrines, and tombs owe their existence to the second class of reasons. We cannot but be thankful for the instinct of reverence that has spared these fine woodlands, often close to good markets.\n\nIt is evident to anyone who takes the trouble to make a few observations, that the forest areas in Korea have been steadily dwindling, even in the past few decades. Less than forty years ago, one of the higher passes on the road between Seoul and Pyeng Yang was so infested with tigers that travel was seriously hampered. The Regent, known to history as Tai Wun Kun (大院君), had the forests cleared away for three miles on either side of the road. This was in line with progress, for it got rid of the tigers and encouraged travel; but it destroyed a forest that has never been replaced. Doubtless\nthis has been the history of many a forest. The growth of population has worked against the forests in two ways. It has increased the demand for building materials, while it also pushed the line of cultivation higher on the hills year by year. A few years ago it was common, in my old itinerating field in Whang Hai Province (黃海道), to find new clearings in the making, with the ground freshly burned over, and a few little fields wrested from the all too scanty forest lands.\n\nAnother factor is the export trade in lumber, railway sleepers, and charcoal. Leaving out the firewood that is smuggled out of the country, mostly by junks that cross the Yellow Sea and put in at some little creek, to return home a few weeks later loaded with bundles of wood, the Customs figures amount to ¥152,440 in 1910, and more in 1912.\n\nThe imports for the same years show clearly enough the need of afforestation. In 1910 they amounted to more than ten times the exports, and in 1912 to ¥2,263,982, or more than fourteen times the exports. It is interesting to know that the imports from the United States amounted in 1912 to ¥86,000, or more than half the whole amount of exports. An important part of this is veneer, used for finishing the railway cars, etc. This, as well as much of the building lumber imported from the United States is of a nature that will not be produced in this country for many years to come.\n\nThis importation of lumber illustrates only a part of Korea's dire need of more forests, and better care for the trees already growing. We are all familiar with the gullied hill-sides, and their corollary, the sand-choked water-courses, that wander sluggishly through the plains below, or, too often, turn aside from the shallow channels their own sediment has blocked, to devastate the fields, and cover them with a forbidding layer of sand and stones.\n\nWe know the furious floods of Summer, and the dreary drouths of Fall and Spring. Many a time I have come into Chairyung (載寧郡) late at night, and found a group of women patiently waiting at each of the little seep-holes (I\ncannot call them springs) where the water trickles out of the rocks. They would wait half the night, in the cold and darkness, for the sake of one more jar of water for use the next day. These are among the penalties a land pays when it has been stripped of its forests. Afforestation will mend these conditions; it may even affect the climate and agricultural possibilities. We who live in Seoul cannot doubt that the bare hills encircling the City intensify the heat of Summer, as they reflect the sun's rays from their bare slopes.\n\nStill, I am not as extreme a believer in afforestation as the visitor who was taken to see Puk Han (北漢). He took a good look at those granite peaks, rising sheer above the city walls, and finally said \"They will be all right, when they are covered with pines.\" Forestry has its limits, and we can all be glad that the prospect of seeing Puk Han turned into a forest is too far away to worry our generation.\n\nThe largest body of real forest, that is, of big trees (成林地), is in South Ham Kyung Province (咸鏡道). It covers 5,737 square miles. The smallest is in South Chulla (全羅南道), 333 miles. Kung Ki (京畿道) is 9th among the 13 Provinces, with 458 miles. This is a large area, when you consider Seoul's constant demand for lumber and fuel. Most of it is in groves surrounding graves, either Royal or private.\n\nThe whole area of forests (of big trees), is about 20,000 square miles, almost 30 per cent of the whole country. Much of this is owned by the State, a large part of the remainder by Buddhist Monasteries, some by individuals or clans. Much of it has no legal owner, as titles to Forest Lands were not clear in the old days. It is only since 1910 that any concerted effort at delimitation has been made. It is reassuring to read, on Page 179 of the \"Report of Progress\" for 1912-13, that in the case of forests whose owners have failed to make the proper reports \"they may be transferred to their bona fide owners.\"\n\nThe present forestry law wisely provides that no trees\nmay be cut in these forests, whether owned by the State or privately, without permission from the Governor-General or the Provincial Governor, and it makes one of the conditions for this permission the planting of seedlings to replace the trees that are to be cut.\n\nNext in importance to this 20,000 miles of big trees, is the more than 25,000 square miles of young trees, brush, etc., called 種樹發生地. This is the basis of the native fuel supply. Much of the land is owned by individuals and clans, but more by the State. Most of it is cut over each year, the brush being cut short, and part of the branches taken from the trees. These cuttings come to us in the shape of the young mountains of brush for fuel that move majestically through the streets of every town or city in Korea.\n\nThe third area under the care of the Forestry Department is the waste land, not used for agriculture, and not furnishing a regular crop of marketable fuel, and so, as a rule, not claimed by any owner. There are 16,000 square miles of this, and it is all open for afforestation, except some comparatively small tracts already taken by individuals and firms.\n\nThe land under cultivation is 11,123 square miles. This makes the following proportions for the various kinds of land:\n\n| Cultivated fields | ... | ... | ... | ... | ... | ... | ... | ... | 15.3% |\n|-------------------|-----|-----|-----|-----|-----|-----|-----|-----|-------|\n| Forests of Big Trees | ... | ... | ... | ... | ... | ... | ... | ... | 27.4\" |\n| Bushes and Small Trees | ... | ... | ... | ... | ... | ... | ... | ... | 35.4\" |\n| Open for Afforestation | ... | ... | ... | ... | ... | ... | ... | ... | 21.9\" |\n\nAs the Forestry Department has charge of all but the first, the rather startling statement at the beginning of this article is justified. As a basis of comparison, we may note that the area under cultivation in Japan Proper is 18.5 per cent, and in Germany (before the war) 93.6 per cent.\n\nIn the Northern part of the country they are composed mostly of slender-leaved woods, and are enumerated as 19 varieties, pines greatly predominating. In the Southern part there are 116 varieties of forest trees, with 3 kinds of bamboo included. Here they are mostly broad-leaved, like the oak.\nWe should note that fruit trees are not included in this enumeration. Let those who are familiar with the chestnut and the persimmon (not the puckery little object that goes by that name in the United States, but the *Persimmon De Luxe* that we have here) judge the importance of this omission. I recall the occasion when I was making a long trip in the country, and my supply of dried prunes, that stand-by of the itinerator, was running low. We came to a village where the \"market\" was being held, and I despatched my boy to get a supply of fruit. He came back empty-handed, for with three kinds of fruit for sale, he could not decide which would be best. Cross-questioning developed the fact that the three kinds of fruit were chestnuts, potatoes, and turnips!\n\nThe Government made its beginning of this in 1907. Seedling stations were opened in 1908, and by 1913 these numbered 319. They are maintained by the Government-General, by Provincial and Prefectural authorities, and (a few only) private enterprise. The Imperial Grant made at the time of annexation is also used in supporting some of these stations, particularly for raising mulberry trees, for the sake of the silk-worm industry. One of these mulberry groves can be seen inside the Su Ku Mun (水口門) of Seoul, and one of the large seedling stations is outside the West Gate, directly between the proposed site of the Chosen Christian College and the City. It is worth a visit. The Government Stations reported in 1912 almost 25 million plantlets, and the Government-General spent on this work over ¥166,000 that year. The rapid growth of Afforestation can be seen from this Table: It shows the principal agencies now doing this work, and dates when they began, as well as their relative results.\n\n| Planted by | Year | Trees | Acres | Year | Trees | Acres |\n|------------|------|-------|-------|------|-------|-------|\n| General Government | 1907 | 72,000 | 30 | 1913 | 1,015,000 | 276 |\n| Local and Provincial Authorities | 1911 | 15,000 | 13 | 1913 | 836,000 | 518 |\n| Private Enterprise | 1910 | 1,947,000 | 1,243 | 1913 | 38,355,000 | 47 Sq. Mi. |\n\nThis \"Private Enterprise\" is principally the work of the\nMitsui Firm and the Oriental Development Company, both of which are planning to raise material for railway and other construction on a large scale.\n\nThe last figure will be better understood when one remembers that it means 3 little trees planted in one year for every man, woman, and child in this country, and yet that only one acre in 300 of those available for afforestation was planted.\n\nAn interesting part of this work is planting for Memorials (記念植樹). This is done by the people, along roads, on common village property, and in other similar locations. In 1913, 12,431,000 trees were planted in this way, almost one for each person in the country. Arbor Day is observed on April 3d, and the highest officials set the example of tree-planting on that day.\n\nSeeds and seedlings from the Government Stations are distributed free to encourage afforestation. In 1913 over 14,885,000 trees (one for each person in the country) and 645 bushels of tree-seeds, were so distributed. The varieties so far cultivated are the Pine, Acacia, Poplar, Chestnut, and Wild Oak. The silk-worms that produce the thread used in making Pongee feed upon the leaves of the last-named. Two Experimental Farms are trying various kinds of trees, in the hope of finding those best adapted to local conditions.\n\nGovernment land will be assigned to those who are fitted to carry out afforestation projects. This may be in the form of a lease, or a deed. Usually the former is given for a time, as an experiment, and is followed by the latter, when the one in charge has proved his fitness. So far some 400 or 500 of the 16,000 square miles available has been so taken, but the amount is rapidly increasing year by year.\n\nThis assignment is made after an application has been filed with the Local Authorities. If it has their approval, it is transmitted to the Forestry Bureau, which takes action. The qualifications essential to an applicant are two, namely: Finan-\ncial ability to carry out the enterprise, and zeal for this sort of work.\n\nIf more than one person applies for the same piece of land, and all have the above qualifications in equal measure, the preference is given to the one who shows the following:\n\n1. Public Spirit.\n2. Former Relation to the Land — See Government-General Regulations, 1912, Number 10, Paragraph 1.\n3. A Native of the District.\n4. Immigrants (those who have come in a body).\n5. A former claim upon the land.\n\nThe need of afforestation is evident to all. We who have made our homes in this land can congratulate ourselves, and the people of Korea may well be glad, in knowing that this great and pressing problem is so well met by the Government. We can also be glad that private enterprise is sharing the work, and hope that it will be so profitable that this will be greatly extended. Most of all, we rejoice to know that the Government is showing the people how to do their part, and that they are taking advantage of its assistance.\n\nThose 12 millions of Memorial trees are a hopeful sign for Korea.\nMINUTES OF THE ANNUAL MEETING OF THE KOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHeld in the Seoul Union, Friday, Feb. 5, 1915.\n\nDr. Mills presided, while Dr. Gale read a most interesting and instructive paper on the \"Marble Pagoda,\" giving the true story of its origin. A unanimous vote of thanks was passed.\n\nAt 5:00 the Annual Business Meeting was called to order, with Dr. Mills in the chair. All the officers except Dr. Kruger were re-elected. In his place as Councilor Hon. R. S. Miller, U. S. Consul-General, was elected.\n\nThe members present at this meeting were: Bishop Harris, Mr. Bonwick, Dr. Gale, Mr. J. H. Morris, Mr. Hugh Miller, Mr. F. H. Smith, Mr. R. S. Miller, Mr. J. F. Genso, Dr. Ludlow, Mr. Snyder, Mr. Burdick, Mr. Cable, Dr. Mills, Dr. Noble, Mr. Bunker, Mr. Beck, Mr. Lay, Mrs. Gale, and Mr. Koons.\n\nREPORT OF THE COUNCIL.\n\nThis has been a prosperous year for the Korea Branch of the Royal Asiatic Society. Council meetings have been held monthly except during the summer.\n\nNearly forty persons have been elected to membership during the year. The Treasurer reports dues received from 79 members. His balance sheet is as follows:\n\nBalance Sheet R. A. S. Account 1914.\n\n| Description                          | Amount |\n|--------------------------------------|--------|\n| Deposit in Bank                      | ¥703.79|\n| Cash on hand 1/1/14                  | ¥116.12|\n| Dues and Fees                        | ¥184.53|\n| Sales by Custodian                   | ¥49.50 |\n| Bank Interest                        | ¥1.50  |\n|                                      |        |\n| Cash for Printing                    | ¥141.81|\n| Postage and Sundries                 | ¥44.37 |\n| Chairs (30) for Seoul Union          | ¥58.50 |\n| Deposit Receipt                      | ¥703.79|\n| Cash in Bank 12/1/14                 | ¥106.97|\n\n¥1055.44 ¥1055.44\nThe Librarian makes the following report:\n\nLibrarian's Report.\n\nThe following Exchanges have been received during the year:—\n\nGeographical Journal of R. G. S. London.\nBulletin of the American Geographical Society.\nJournal of the Royal Asiatic Society, London.\nTransactions of Asiatic Society of Japan.\nTransactions of Bombay Branch of R. A. S.\nAnnual Report of Smithsonian Inst. 1911 and 1912.\n\nOnly six books have been loaned for reading during the year.\n\nThe following is the stock in hand at the present time:—\n\n| No. | Title          | Vol. | Part | Year | Price |\n|-----|----------------|------|------|------|-------|\n| 240 | Transactions   | I    | 1    | 1900 | @3.00 |\n| 280 | do             | II   | 1    | 1901 | @2.50 |\n| 321 | do             | II   | 2    | 1902 | @3.00 |\n| 274 | do             | III  | 1    | 1903 | @2.50 |\n| 357 | do             | IV   | 1    | 1912 | @1.50 |\n| 408 | do             | IV   | 2    | 1913 | @2.50 |\n| 403 | do             | IV   | 3    | 1913 | @2.50 |\n| 358 | do             | V    | 1    | 1914 | @2.50 |\n\nWe are now ready to send to the printers the manuscripts for Vol. VI, Part I, which will contain the paper on \"Korean Medicine\" by Dr. N. H. Bowman, and on \"Afforestation\" by Rev. E. W. Koons.\n\nThere is promise of a number of other papers for 1915, and we hope for a still larger membership during the year.\nOFFICERS FOR 1915\n\nPresident\nRev. J. S. Gale, D. D.\n\nVice President\nRalph G. Mills, M. D.\n\nCorresponding Secretary\nS. A. Beck.\n\nRecording Secretary\nF. W. Koons.\n\nTreasurer\nD. A. Bunker.\n\nLibrarian\nGerald Bonwick.\n\nCouncillors\nR. S. Miller, (American Consul General)\nI. Yamagata, (Editor \"Seoul Press\")\nA. H. Law, (British Consul General)\nLIST OF MEMBERS, KOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHONORARY MEMBERS.\n\nAllen, Hou, H. N., M. D. LL. D. ... ... Toledo, Ohio, U.S.A.\nGubbins, J. H., C. M. G. ... ... ... c/o Foreign Office, London.\nHulbert, H. B., Prof. ... ... ... Springfield, Mass., U.S.A.\nJones, Geo. H., D.D. ... ... ... 150 Fifth Avenue, New York.\nJordan, Sir John ... ... ... ... Peking, China.\nRoss, Rev. John, D. D. ... ... ... Moukden, Manchuria.\n\nORDINARY MEMBERS.\n\nAlbertson, Miss M. M. ... ... ... Seoul.\nAsami, R. ... ... ... Judge of Supreme Court, Seoul.\nAvison, Dr. O. R. ... ... ... Seoul.\nBadcock, Rev. J. S. ... ... ... Pai Rchun.\nBeck, Rev. S. A. ... ... ... Seoul.\nBolljahn, J. ... ... ... Seoul.\nBonwick, Gerald ... ... ... Seoul.\nBowman, Dr. N. H. ... ... ... Seoul.\nBridle, Rev. G. A. ... ... ... Suwon.\nBrinckmeier, R. ... ... ... Chemulpo.\nBunker, Rev. D. A. ... ... ... Seoul.\nBunker, Mrs. D. A. ... ... ... Seoul.\nBurdick, Rev. G. M. ... ... ... Seoul.\nCollyer, Rev. C. T. ... ... ... Wonsan.\nCrispin, J. F. ... ... ... London, England.\nCutler, Dr. M. M. ... ... ... Pyeng Yang.\nElliot, Sir Charles ... ... ... University of Hongkong.\nForsyth, Miss Helen ... ... ... Seoul.\nGale, Rev. J. S., D. D. ... ... ... Seoul.\nGenso, J. F. ... ... ... Seoul.\nGillett, P. L. ... ... ... Shanghai, China.\nGreenfield, Rev. M. W. ... ... ... Taiku.\nGriffin, J. T. ... ... ... Yokohama, Japan.\nGrove, Rev. P. L. ... ... ... Pyeng Yang.\nHall, Mrs. R. S., M. D. ... ... ... Pyeng Yang.\nHarris, Bishop, M. C. ... ... ... Seoul.\nHaven, Rev. Dr. W. I. ... ... ... Bible House, Astor Place, New York.\nHoffman, Rev. C. S. ... Kangkei.\nHoldcroft, Rev. J. G. ... Pyeng Yang.\nHooker, J. T. ... Spartanburg, S. C., U. S. A.\nIrvin, Dr. C. H. ... Fusan.\nKanazawa, Dr. S. ... Imperial University, Tokyo, Japan.\nKavanaugh, J. ... Shanghai, China.\nKoons, Rev. E. W. ... Seoul.\nKruger, Dr. F., Ph. D. ... German Consul General, Seoul.\nLay, A. Hyde ... British Consul General, Seoul.\nLeadingham, Dr. R. S. ... Mokpo.\nLudlow, Dr. A. I. ... Seoul.\nMcEachern, Rev. John ... Kunsan.\nMcGarry, F. ... Seoul.\nMacrae, Rev. F. J. L. ... Kuchang.\nMiller, Hugh ... Seoul.\nMills, Edwin W. ... Tul Mi Chung Mine, Korea.\nMills, Dr. R. G. ... Seoul.\nMin Yung Chan ... Seoul.\nMoffett, Dr. S. A. ... Pyeng Yang.\nMoore, Rev. J. Z. ... Pyeng Yang.\nMoose, Rev. J. R. ... Seoul.\nMorgan, Hon. E. V. ... Dept. of State, Washington, D. C.\nMorris, Rev. C. D. ... Pyeng Yang.\nMorris, J. H. ... Seoul.\nNiwa, S. ... Japanese Y. M. C. A., Seoul.\nPye, Miss Olive F. ... Seoul.\nReiner, R. O. ... Taiku.\nRhee, Dr. S. M. ... Honolulu, Hawaii.\nRhodes, Rev. H. A. ... Kangkei.\nRichard, Rev. Dr. Timothy ... Shanghai.\nRobbins, Miss H. P. ... Pyeng Yang.\nScidmore, Hon. G. H. ... American Consul General, Yokohama, Japan.\nScranton, Dr. W. B. ... Chicksan.\nShidehara, Dr. ... President Hiroshima Higher Normal School, Japan.\nSmith, Rev. F. H. ... Seoul.\nSmith, Dr. R. K. ... Andong.\nSmith, Rev. W. E. ... Pyeng Yang.\nSnyder, L. H. ... Seoul.\nStarr, Prof. Frederick ... Chicago University, Chicago, Illinois.\nSwearer, Rev. W. C. ... Kongju.\nStillman, E. G., M. D. ... 830 Park Ave., New York.\nTate, Rev. L. B. ... Chunju.\nTaylor, W. W. ... Seoul.\nLIST OF MEMBERS.\n\nTownsend, W. D. ... ... ... ... Chemulpo.\nTrollope, Rt. Rev. Bishop M. N. ... ... Seoul.\nUnderwood, Rev. Dr. H. G. ... ... Seoul.\nVan Buskirk, Rev. Dr. J. D. ... ... Seoul.\nWada, Dr. Y. ... ... ... ... Director, Meteorological Observatory, Chemulpo.\nWelbon, Rev. A. G. ... ... ... Andong.\nWhittemore, Rev. N. C. ... ... ... Syenchun.\nWilliams, Prof. F. W. ... ... ... New Haven, Connecticut, U. S. A.\nYamagata, Mr. Isoh ... ... ... Editor \"Seoul Press,\" Seoul.\nCATALOGUE\n\n\"TRANSACTIONS OF THE KOREA BRANCH OF THE ROYAL ASIATIC SOCIETY.\"\n\nVOLUME I. PART I only. 1900.\nPrice Yen 3.00.\n\nContents:—\nInfluence of China upon Korea.\nKorean Survivals.\nColossal Buddha at Eun-jin.\nMinutes of General Meeting.\n\nAppendix:—\nOffice Bearers.\nList of Members.\nConstitution and By-Laws.\n\nVOLUME II. PART I. 1901.\nPrice Yen 2.50.\n\nContents:—\nKang-Wha.\nThe Spirit Worship of the Koreans.\n\nVOLUME II. PART II. 1902.\nPrice Yen 3.00.\n\nContents:—\nHan-Yang (Seoul).\nKorean Folk-Tales.\nMinutes of General Meetings.\nReport of the Council.\n\nAppendix:—\nOfficers.\nList of Members.\n\nVOLUME III. PART I only. 1903.\nPrice Yen 2.50.\n\nContents:—\nCh'oe Ch'e-Wun: His Life and Times.\nThe Culture and Preparation of Ginseng in Korea.\nMinutes of Annual Meetings.\nReport of the Council.\n\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of the Landes Library.\n\nVOLUME IV. PART I. 1912.\nPrice Yen 1.50.\n\nContents:—\nThe Old People and the New Government.\nThe Korean Alphabet.\n\nVOLUME IV. PART II. 1913.\nPrice Yen 2.50.\n\nContents:—\nJapanese-Korean Relations after the Japanese Invasion of Korea in the 16th Century.\nThe Village Gilds of Old Korea.\nCoinage of Old Korea.\nMinutes of Important Meetings.\n\nVOLUME IV. PART III. 1913.\nPrice Yen 2.50.\n\nContents:—\nMarriage Customs of Korea.\nSelection and Divorce.\nThe Celestial Planisphere of King Yi Tai-Jo.\n\nVOLUME V. PART I only. 1914.\nPrice Yen 2.50.\n\nContents:—\nSome Recent Discoveries in Korean Temples and their Relationship to Early Eastern Christianity.\nA Plea for the Investigation of Korean Myths and Folklore.\nCatalogue.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko61roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 62, "total-input-tokens": 89994, "total-output-tokens": 20474, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 417, 5], [417, 417, 6], [417, 1034, 7], [1034, 1034, 8], [1034, 2377, 9], [2377, 4135, 10], [4135, 6162, 11], [6162, 7753, 12], [7753, 8893, 13], [8893, 10780, 14], [10780, 11478, 15], [11478, 12071, 16], [12071, 13899, 17], [13899, 15939, 18], [15939, 17437, 19], [17437, 18579, 20], [18579, 19522, 21], [19522, 20669, 22], [20669, 22401, 23], [22401, 24499, 24], [24499, 26357, 25], [26357, 28073, 26], [28073, 29910, 27], [29910, 31889, 28], [31889, 33955, 29], [33955, 34967, 30], [34967, 34985, 31], [34985, 35732, 32], [35732, 35756, 33], [35756, 35756, 34], [35756, 35756, 35], [35756, 35756, 36], [35756, 35756, 37], [35756, 35756, 38], [35756, 37975, 39], [37975, 40582, 40], [40582, 44278, 41], [44278, 47170, 42], [47170, 49051, 43], [49051, 51111, 44], [51111, 53193, 45], [53193, 55204, 46], [55204, 57455, 47], [57455, 59629, 48], [59629, 61572, 49], [61572, 62645, 50], [62645, 64502, 51], [64502, 65866, 52], [65866, 66204, 53], [66204, 67781, 54], [67781, 69376, 55], [69376, 69855, 56], [69855, 70543, 57], [70543, 71428, 58], [71428, 71428, 59], [71428, 71428, 60], [71428, 71428, 61], [71428, 71428, 62]], "primary_language": ["None", "en", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]