[{"id": "3f588cccfd5376288824280a2bcb367869015e29", "text": "CONTENTS\n\nRomanization of the Korean Language\nby G. M. McCune\nUniversity of California\nE. O. Reischauer\nHarvard University 155\n\nThe Yi Dynasty Annals of Korea\nby G. M. McCune ... 57-82\n\nMinutes of Annual Meeting and Reports 83-88\nOfficers for 1939 ... ... ... ... ... 89\nList of Members ... ... ... ... ... 90-94\nExchanges ... ... ... ... ... ... 95\nTHE ROMANIZATION\n\nOF THE\n\nKOREAN LANGUAGE\n\nBASED UPON ITS PHONETIC STRUCTURE\n\nG. M. McCune,\nUniversity of California\nE. O. Reischauer,\nHarvard University\n# TABLE OF CONTENTS\n\nI. Introduction .................................................................................................................. 1\n\nII. The Vowels .................................................................................................................. 10\n    Simple vowels .............................................................................................................. 10\n    Labialized vowels and diphthongs ............................................................................. 14\n    Yotized or palatized vowels ....................................................................................... 16\n    Long and short forms of the vowels .......................................................................... 18\n    Irregularities in the pronunciation of the vowels ........................................................ 20\n    \"Disintegration\" in individual vowels ......................................................................... 21\n    Assimilation between vowels .................................................................................... 22\n\nIII. The Consonants ......................................................................................................... 24\n     Plosive consonants .................................................................................................... 25\n     Unvoiced plosives ..................................................................................................... 27\n     Voiced plosives ......................................................................................................... 28\n     \"Forced\" plosives ....................................................................................................... 39\n     Aspirated plosives ..................................................................................................... 31\n     Non-plosive consonants ............................................................................................ 32\n     Nasal consonants ...................................................................................................... 33\n     Lateral and semi-rolled consonants .......................................................................... 34\n     Fricative consonants .................................................................................................. 35\n     Rules for the Romanization of the consonant letters ............................................... 36\n     The medial glottal stop (sad sict) and irregular assimilation between consonants .... 43\n     The consonants in new spelling and their Romanization ......................................... 46\n\nIV. Other Considerations .................................................................................................. 49\n     Syllables and words in Romanization ....................................................................... 49\n     The Romanization of proper names and titles ........................................................... 52\n     The simple use of this system of Romanization ....................................................... 53\n\nCharts and Tables\n     Vowel Chart .............................................................................................................. 10\n     Vowel Diagram ......................................................................................................... 11\n     Consonant Chart ....................................................................................................... 24\n     Chart of Plosives ....................................................................................................... 26\n     Chart of Non-Plosives ............................................................................................... 32\n     Syllabic Table ............................................................................................................ 56\n     Chart of Euphonic Changes of the Consonants ....................................................... 57\nI. INTRODUCTION\n\nAlthough the Hepburn system for Romanizing Japanese is almost universally accepted, and the Wade-Giles system for Romanizing Chinese is used by most English-speaking people, no standard Romanization has been adopted for Korean. This lack has been a handicap to the scholarly study of Korea. For this reason Occidental residents in Korea and native philologists have supported us in our effort to supply this need. These scholars have given us invaluable assistance in carrying out the phonetic studies necessary for the construction of this system.\n\nThe lack of a generally accepted system of Romanization has led to great diversity and many inconsistencies in the Romanization employed by Occidental scholars writing about Korea. These variations have caused little difficulty to scholars in Korea, who are familiar with the names and terms Romanized, especially when Chinese characters and the native Korean script (onmun 論文) are given with the Romanization; but for the scholarly world at large, where a knowledge of either written or spoken Korean, or even of Chinese characters cannot be presupposed, the amazing differences in the Romanization of the same name or word by different scholars, and sometimes by the same man, can only lead to confusion and error.\n\n1. It is impossible to mention all those who have aided us in the preparation of this Romanization. First we should acknowledge encouragement received from the Korea Branch of the Royal Asiatic Society and from Dr. Horace H. Underwood, President of Chosen Christian College and the author of An English-Korean Dictionary (Seoul, 1925) and other works on Korea, who has given us advice on difficult problems. Mr. A. A. Pieters, who revised and edited the 1931 edition of Gale's dictionary, likewise gave us much useful aid. We are especially indebted to the excellent Korean phoneticians, Professors Choi Hyon Pal (Choe Hyonbae 趙賢培) and Cho Hyun Bong (Chong Inbo 鄭寅博) and Cho Hyun Bong (Chong Inbo 鄭寅博) all of Chosen Christian College (朝鮮基督敎) for valuable assistance. We also wish to express our sincere thanks to Professor Hagueneau of Paris, who has painstakingly examined and criticized early drafts of this paper and generously given us numberless suggestions. Also we are indebted to Professor Blissceff of Harvard for suggestions and advice.\nHowever necessary it may be, the actual task of devising a suitable system of Romanization is an extremely difficult one, for the Korean language has a very complex phonetic structure. In spite of this, the task is by no means impossible, as many have supposed, for a surprising degree of exactness can be attained by the use of the Latin alphabet.\n\nThe Japanese authority, Mr. Ogura, cites no less than twenty-seven systems employed in Romanizing Korean, and his list is by no means complete. Of these, however, only the system originated by the French missionaries, the German system of Eckardt, and that of Gale in the *Korean-English Dictionary* have received any very wide acceptance in the past; but not one of these is adequate or complete. The French system, as that of the French missionaries is called in Korea, has many good points; but in a country like Korea, where even more than in China or Japan, the Occidental population is almost entirely English-speaking and English is the \"international language\", the French system of Romanization, based as it is on the French pronunciation of the Latin alphabet, is not acceptable for use by English-speaking people or by the scholarly world as a whole. Furthermore, this system does not take into consideration the vital problem of euphonic changes, and treats the *omnun* vowel digraphs most inadequately. Eckardt's system is in some respects better than the French, but that too, is inadequate on many points, and, as presented, is too confusing for use by one not thoroughly acquainted with the Korean language. Gale's system has been adopted by the\n\n1. Ogura Shimpel 小田進平: *Omnum no Rōmaji Hyōkikō 論文のローマ字記法* (A System of Romanizing Omnum) in *Oda sensai Shōju Kinen Chisen Ronshū 小田先生聖壽紀念講演論集* Kajō, 1934, pp 85-141.\n\n2. French: *Dictionnaire Coréen-Français*, Yokohama, 1881. Much the same is to be found in M. C. Imbert-Huart, *Manuel de la langue coréenne parlée à l'usage des Français*, Paris, 1889.\n\nGerman: P. A. Eckardt, *Koreanische Konversations-Grammatik*, Leipzig, 1923.\n\nEnglish: J. S. Gale, *A Korean-English Dictionary*, Seoul, 1897. 3rd rev ed., 1931. Ed., A. L. Pieters.\n\nHarvard Journal of Asiatic Studies, but, unfortunately, is quite incomplete, and in a few places is even misleading.\n\nIn recent years certain scholars have proposed various systems for transcribing the Korean language with considerable phonetic exactness, but since these systems introduce various phonetic symbols not familiar to the average person, there is little possibility that they will ever be used for more than philological and phonetic research. Consequently, they do not meet the need for a system of Romanization for general use in scholarly work of a non-philological nature.\n\nSome have argued in favor of the use of the Japanese or Chinese Romanizations for Korean proper names and words written in Chinese characters. As Japanese is now the official language of the land, the use of Japanese Romanizations for certain modern proper names is probably quite justifiable, but despite the fact that most of the scholarly works and reference books on Korean are now appearing in Japanese, few Occidental scholars will feel it wise to ignore the existence of the Korean language. Furthermore, in native Korean words, the use of a Japanese reading is patently impossible. Although the Korean reading of Chinese characters is on the whole quite close to the original Chinese, the use of the Chinese reading in place of the Korean is no more justifiable than is the use of the Japanese reading. Despite these facts, many of the works published outside of Korea in the past have used at least in part either the Japanese or the Chinese pronunciation in place of the Korean.\n\nA few words should be said about the Korean language and its writing. Korean is a polysyllabic agglutinative\n\n---\n\n1. Examples are ㅇ, ㅎ, ㅈ, and ㅊ, which are used by Haguensauer in his excellent article, \"Système de transcription de l'alphabet coréen,\" *Journal Asiatique*, cxxii, (1933), pp. 145-161. Such symbols are scientifically more exact than the letters of the Latin alphabet in representing certain sounds; and we urge the use of a such scientific systems of transcription for phonetic and philological studies; but for practical reasons phonetic symbols can not be admitted into a system of Romanization for general use.\nlanguage, bearing close resemblance in structure and grammar to the Altaic languages and to Japanese, but not to Chinese. The vocabulary is composed primarily of words of two types, native words and Sino-Korean words. The latter are either borrowed words from the Chinese, but pronounced in the Korean manner, or are new words coined in Korea from Chinese characters. Recently many words of Japanese and Western origin have been added.\n\nIn writing the language a mixed script is usually employed. Chinese characters (hanja 漢字) are used for writing the Sino-Korean words, and ᄂmnun, the native alphabet, is used for spelling purely Korean words and grammatical elements. In the past, men of learning avoided the use of ᄂmnun as far as possible because they considered it to be too vulgar for the educated; and Korean literature until very recent times was written almost exclusively in a modified form of literary Chinese (hanmun 漢文). However, except for some minor differences, there are standard ᄂmnun spellings for all Chinese characters, and these are readily found in any character (hanja) dictionary of Korean. Thus, Sino-Korean words as well as native Korean words can be written in ᄂmnun, just as both Sino-Japanese words and native Japanese words can be written in kana.\n\nLike all alphabets, ᄂmnun is not a perfect phonetic medium, but it represents the pronunciation of the Korean language with considerable exactness. Although invented and first employed in the fifteenth century, not until recently has it come into general use among the educated classes. The ᄂmnun spellings of Sino-Korean words has been rather definitely determined in the past, but the spelling of native Korean words has never been standardized, and the dictionaries, which have appeared from time to time, have altered the spelling to conform to the changes in pronunciation resulting from the natural evolution of the spoken language. In some respects this lack of standardization is confusing, but the basically phonetic character of the ᄂmnun spellings has reduced considerably the number of obsolete spellings and radical inconsistencies between the present standard orthography and the pronunciation of Korean words. Therefore, as in the case of the Japanese kana, ᄂmnun provides the natural and easiest point of departure for any system of Romanization. Our system, like all other Korean Romanization systems, takes the ᄂmnun as the basis for its approach to the problem.\n\nA short description of the formation of words by the ᄂmnun letters will help those unfamiliar with them to understand the problem and follow the examples given in this article. The language is polysyllabic, but the ᄂmnun letters are written together as syllables, probably because of the influence of Chinese ideographs. The individual ᄂmnun letter, however, has a phonetic value and independent form roughly equivalent to those of a letter of the Latin alphabet.\n\nThe word hanmun mentioned above may be used as an example. The first syllable 한 (han), is composed of three symbols, the initial consonant ㅎ (h), the vowel ㅏ (a) and the consonant ㄴ (n). The second syllable is also composed of three symbols, the consonant ㅁ (m), the vowel ㅜ (u) and the consonant ㄴ (n), which together form the syllable 문 (mun). The two syllables are pronounced together as the single word, hanmun.\n\nThe variation found in the ᄂmnun spelling is one factor which has made the devising of a Romanization system especially difficult. Recently two Korean philological societies have been revising and standardizing the spelling, and now most publications in the Korean language are employing the\nmajority of the corrections urged by one or the other of these two societies. The existence of these different spellings, old and new, has increased the demand for a better organized system of Romanization than has hitherto existed. If confusion is to be avoided, a system must be devised which, by certain clear rules, reduces as far as possible all variant ᄊᆞᆷᆞᆷ拼ings to the same Romanization, as is done in the case of the much simpler problem in Japanese of reducing シャウ (shi-ya-u), ショウ (shi-yo-u), and セウ (se-u) all to simple shō. This idea, in Korean is not always actually possible of achievement, but in the vast majority of cases it can be attained, although hitherto the systems of Romanization for the most part have not faced the problem.\n\n1 These two societies have set up rival systems of ᄊᆞᆷᆞᆷ spelling. The older of the two societies, the Cheos Ohakhoe 趙學會, calls itself in English the Korean Language Research Society, and its system of spelling has been named the Han'gul 統一 or United System. The Choson Ohak Yonghoe 韓國語學會, calls its system the Changun 統一, the name by which ᄊᆞᆷᆞᆷ was first designated. The differences between these two systems do not affect to any appreciable degree our Romanization of native spellings. We have chosen examples from the Unified System, the general principles of which are to be found in a publication of the Korean Language Research Society entitled Han'gul mach'um-pip l'agirion 한국어총합법 (Rules for the Unification of Spelling to Conform to the Unified System), Seoul, 1933, 2nd ed., 1937. A list of native Korean words spelled according to this system, Choson p'yo-junmal mum 前言表音表音 (A Compilation of Korean Words with their Standard Spelling), 2nd ed., Seoul, 1937, has also been published by the society. It contains an elaborate index and indicates the variant spellings and pronunciations of each word. At present the society is compiling a complete Korean dictionary including all native and Sino-Korean words and phrases.\n\n2 Many of the variations in the ᄊᆞᆷᆞᆷ spelling of Korean words are the result of dialectical differences. No system can reduce these differences to the same Romanization, for they represent different pronunciations, and therefore all one can do is to decide which dictionaries spell according to the standard pronunciation, and Romanize accordingly. However, the greatest differences in ᄊᆞᆷᆞᆷ spelling have been brought about by phonetic evolution which has resulted in a plurality of spellings for the same sound in modern Korean. It has been one of our chief aims to devise rules by which these variant spellings can be Romanized alike, just as they are pronounced alike.\n\nBelow are some examples to show how different ᄊᆞᆷᆞᆷ spellings result in different Romanizations in some of the older systems. It will be noted that the Romanization of our system, given in the last column, is in all cases the same, as it should be in any really adequate system. The first illustration is a native Korean word, while all the others are Sino-Korean words.\n\nThe need for a new and adequately analyzed system of Romanization is, we believe, apparent, but before proceeding to the exposition of our system, explanation should be made of its aims and principles. Let us emphasize the fact that the system is not an exact phonetic notation employing the symbols of the phonetician. Good systems of this nature have already been devised by Hagueneuer and others. We have not intended that it be used in phonetic or in technical philological research. Rather, we have made it for general scholarly and non-scholarly use where phonetic symbols would be cumbersome and annoying and where strict phonetic exactness is not demanded. We have therefore attempted to effect a compromise between scientific accuracy and practical simplicity. Because of the inadequacies of the Latin alphabet and the complexities of the phonetic structure of Korean, it has not been possible to avoid all diacritical marks; but we have attempted to reduce these to the minimum. In short, we have tried to make the system throughout as simple as possible without being misleading.\n\nOur aim in this article is merely to present the system of Romanization to the public. It has not been our purpose to make a detailed exposition of the phonetic structure of Korean. This has already been done by many fully qualified Korean, Japanese and European phoneticians, although often with differing conclusions. We have discussed the\n\n| Spelling | ᄊᆞᆷᆞᆷ | Meaning | French | Gale | Eckardt | McCune-Reischauer |\n|----------|--------|---------|--------|------|--------|------------------|\n| Gale     | 갓보다 | to be   | kit-peu-ta | kitpeuda | kitpūta | kippuda |\n| Gov.Gen. | 갓부다 | happy  | kit-pou-ta | kitpūda | kitpūda | kippuda |\n| Univ.Sys.| 기쁘다 |        | ki-ppee-ta | kibpeuda | kibpūda | kippuda |\n| Gale     | 스피 | historical | sa-keui | sa-geui | sakūi | sagūi |\n| Univ.Sys.| 사기 | record  | sa ki    | sa-gi   | saki   | sagi   |\n| Gale     | 조선 | Tjo-sen | Cho-sen | Tjoson | Cho-sen | Choson |\n| French   | 조선 | Korea   | Tjo-sen | Tjoson | Cho-sen | Choson |\n| Univ.Sys.| 조선 | Tjo-sen | Cho-sen | Tjoson | Cho-sen | Choson |\n\nGov.Gen. signifies the Government General dictionary, Univ.Sys. the Unified System, and French, the French Dictionary. It will be seen that the system of the French missionaries makes no attempt to meet the problem of variant spellings, whereas Gale's and Eckardt's systems do in some cases.\npurely phonetic aspects of the question to a certain extent, in order to explain our reasons for choosing certain Latin letters to represent certain Korean sounds; but we have restricted these phonetic explanations as far as possible, and in cases where there could be no reasonable doubt as to a satisfactory means of Romanization, we have omitted them entirely.\n\nOur Romanization is not merely a method of transcribing ḍimun, letter by letter, into a different alphabet, for which purpose Ogura's literal Romanization will serve. We have devised our Romanization with the purpose of providing a comprehensible guide to the standard modern pronunciation of Korean for those unfamiliar with the language, as well as for those who know it. In this regard our approach differs from that of many Koreans and western scholars who feel that the Romanization can ignore the euphonic changes of Korean and let the reader, who presumably knows the language, supply them automatically. It has been our aim to represent each radically different Korean sound by one distinct symbol, despite variations in the ḍimun orthography.\n\nOur Romanization has been devised only for the modern pronunciation of Korean, and does not take into account obsolete pronunciations; but, since there are dialectical differences, it has been necessary to determine which modern pronunciation should be considered as the standard dialect. In keeping with the practice of most other lands and in keeping with the precedent set by the Korean phoneticians and philological societies which have been sponsoring the revised spelling systems, we have accepted the pronunciation of the educated middle class of the capital, Seoul (Keijo), as the standard Korean pronunciation.\n\nIn Romanizing it is also necessary to determine what is one's criterion for the phonetic value of the letters of the Latin alphabet. There is the possibility of disregarding any criterion besides the phonetic structure of the language under consideration; but this approach, as with Nipponshiki Romaji, the new Japanese Romanization system, would unquestionably lead to Romanizations which would be very misleading to the average foreigner. We believe that there can be little doubt that it is best to follow the general practice of most Romanization systems of basing the Romanization of the vowels on their normal value in the Italian language. The problem of the consonants is more difficult, but we have felt that we might best follow the lead of the Hepburn and Wade-Giles systems in basing our Romanization of the consonants on their normal value in English. The formula \"the vowels as in Italian and the consonants as in English\" has proved itself to be a great success in the case of the Romanization of Japanese both for the scholar and for the casual user of the system; and, though in Korean the phonetic problems are much more complex than in Japanese, we believe that this formula can be successfully applied to Korean also. Furthermore, in following this formula we make our system conform for the most part to the Hepburn and Wade-Giles systems. This is particularly desirable, because most of those who are interested in Korean studies are familiar with the systems used for the Romanization of the Chinese and Japanese languages.\n\n1 Ogura, op. cit. See the charts, opposite pp. 10 and 24.\nII. THE VOWELS\n\nThe *omun* vowel-letters¹ are listed in the chart on the opposite inserted double page. It shows the phonetic transcriptions of Ogura and Jung,² Haguenauer's transcription, Ogura's literal transcription, our Romanization, and the Romanizations of Eckardt, the French missionaries, Gale and Jung in the order named.\n\nEach of these *omun* vowel-letters does not represent only one vowel-sound, but several which are closely related. Such a group is called a vowel phoneme. It is impractical to provide Romanizations for each variation within a single phoneme, for this would require a series of purely phonetic symbols. Furthermore, only a phonetician with a thorough knowledge of the Korean language would be able to record these differences correctly. The most noticeable variation is to be found in the length of the vowel-sounds. This is to be discussed in a later section.\n\nFor the sake of clarity we have divided the Korean vowel-letters into three categories according to their standard pronunciation: simple vowels, labialized vowels and diphthongs, and yotized or palatalized vowels.\n\nSIMPLE VOWELS\n\nThere are eight vowel-letters in Korean which clearly represent simple vowels, but two others are often included in this group to make a total of ten.³ The following phonetic chart by the Korean phoneticians, Yi, Yi and Jung,⁴ will help to indicate the approximate pronunciation of these ten vowel-\n\n---\n\n¹ In order to avoid confusion, we have chosen to differentiate between a vowel-letter and a vowel-sound by these compound words. A digraph or trigraph is a compound vowel-letter, and a diphthong is a compound vowel-sound.\n\n² Jung Insub, *The International Phonetic Transcription of Korean Speech-sounds*, Seoul, 1935.\n\n³ The two doubtful cases, *ŋ* and *ŋ* we have classed among the labialized vowels. See pp. 14-15.\n\n⁴ Jung Insub, op. cit.\n| VOWEL CHART |\n|-------------|\n| **PHONETIC TRANSLITERATION** | **OTHER ROMANIZATIONS** |\n| **Korean** | **Ogura** | **Haig** | **McGonegal** | **Reischauer** | **Romanization** | **French** | **Gale** |\n| **Letters** | **Figures** | **Jung** | **Transliteration** | **Transliteration** | **Romanization** | **Pronunciation** | **Name** |\n| a | a, ai | a | a | a | a | a | a |\n| e | e, ei | e | e | e | e | e | e |\n| i | i, ii | i | i | i | i | i | i |\n| o | o, oi | o | o | o | o | o | o |\n| u | u, ui | u | u | u | u | u | u |\n| y | yu, yu: | yu | yu | yu | yu | yu | yu |\n\nNote: The table provides phonetic transcriptions for various Korean vowels, along with their corresponding Romanizations in different systems such as Ogura, Haig, McGonegal, Reischauer, Romanization, French, and Gale.\nletters, although it must be remembered that there is still considerable dispute between phoneticians over the exact values of many of the vowels and consonants of Korean.\n\nUnfortunately, there are only five vowel-letters in the Latin alphabet, \\(a\\), \\(e\\), \\(i\\), \\(o\\) and \\(u\\). For Romanization purposes these letters have, as a rule, been used to represent the five vowel-sounds which are closest to the five Italian vowel-sounds thus represented. An analysis of the above chart shows that there are five Korean vowel-letters which represent these five vowel-sounds, and therefore there can be no doubt that these five should be Romanized by the corresponding Latin letters. They are, \\(t\\) (\\(a\\)), \\(l\\) (\\(o\\)), \\(T\\) (\\(u\\)), \\(I\\) (\\(i\\)) and the digraph \\(e\\).\n\nPrevious systems of Romanization have differed widely\n\n---\n\n1 Lower \\(a\\) \\(\\sim\\), as it is called to distinguish it from upper \\(a\\), \\(T\\), is now eliminated in most publications, being replaced usually by upper \\(a\\). Unless one is sure of a better rendering, it is best to treat it as a simple \\(t\\) (\\(a\\)) when one finds it in old texts and dictionaries. See p. 21.\nin representing the vowel-letters -i, —, and ḥ (ḫ). Phonetic symbols would naturally be the best means of representing their pronunciations, but in a system of Romanization these, of course, cannot be employed. One has, therefore, the choice of Romanizing them either as digraphs (combinations of two Latin letters) or single letters supplemented by diacritical marks.\n\nThe vowel-sound represented by -i is phonetically transcribed as a or a: by Jung, and as a by Ogura and Haguenauer. Jung thus gives it the approximate value of the initial vowel in above (above) or the long vowel of bird (bird) in southern English pronunciation. According to Ogura it is the vowel-sound of want (want). Generally speaking it may be said to belong to the o ‘family’, although it is not characterized by lip-rounding.\n\nWe have chosen the Romanization o for this vowel-letter. The Latin letter o was selected because it represents the Italian vowel-sound phonetically closest to the Korean vowel-sound represented by -i and because the latter is, generally speaking, most readily identified as a short o. The diacritical mark — was selected as probably the most intelligible and least misleading diacritic for this vowel-sound. Some examples of the Romanization of -i are: yǒngga 영가 (English language), omōai 어머니 (mother), and Koryo 고려 (Korean kingdom).\n\nThe second of these three vowels, written — in ṣunun, has no phonetic counterpart in any well-known language; but some phoneticians compare it to the Russian й. It may be described phonetically as a close central vowel sounded with lips spread. There is no wholly satisfactory phonetic symbol to represent it. Ogura has devised the symbol ū, and Jung uses ū, a modification of a standard phonetic symbol.\n\nWe have chosen the Romanization ū for the vowel-letter —. We have discarded the commonly used digraph eu be-\n\ncause it calls to mind the French eu which is lip-rounded instead of lip-spread. From the phonetician’s viewpoint, the symbol ū would probably be most accurate, but because the pronunciation of — is closely related to u and is often confused with T (u) by Occidentals, we have chosen the letter u instead. The same diacritical mark as that used with -i (ö) is employed in order to minimize the varieties of diacritics and because it serves as well as any other mark to identify this vowel sound. Examples of the Romanization of — are: ūmsik 음식 (food) and kūrūi 구루 (dish).\n\nThere is one irregularity in the pronunciation and Romanization of the lip-spread vowel ū —. When preceded in the same syllable by the labials, m n, p or b d, pp nd and p’ n, it loses its lip-spread characteristics and becomes a simple u.\n\nThe third of the three vowel-letters under consideration is the digraph ḥ, the standard pronunciation of which is phonetically transcribed as æ or e. The first is the symbol of the English a of cab (kaeb), the latter, the French é of même, or the German ö of Lärm. Phonetically it lies between e and a and therefore there is justification for Jung’s use of e’, and Haguenauer’s use of é. However, according to Jung’s chart, the pronunciation of ḥ is closer to a than to e and etymologically it seems to have the a element in it.\n\nWe have decided to Romanize ḥ as ae. The use of a single letter with a diacritical mark was ruled out for various reasons, particularly because of the difficulty in choosing be-\n\n1 The Unified System has eliminated the use of — (a) after these labial consonants and has substituted T (u) for it, except for the spelling of certain parts of speech. An illustration of this change of spelling is afforded by the word puk (north), spelled ṣ by Gate, and in most hanchea dictionaries, but as ṣ in the United System and in the Government-General dictionary.\n\nThe vowel-letter — has also another variant pronunciation. After s, ss x, ch or j, teh x, and ch’ x, it is often pronounced as a short i. Since it may be pronounced either as a or i in these cases, we have thought it best to disregard this phenomenon in Romanization. Examples are: kišūl 키슬 (heads), sūba 슈바 (to see), chūchūt 츄츄 (immediately), itchūk 이Chuck (early) and chūngye 츄게 (flight of steps).\nbetween the letters \\(a\\) and \\(e\\). Although the latter is more acceptable phonetically, it would fail to satisfy Germans, who identify the vowel-sound it represents with \\(\\ddot{a}\\), or English-speaking people, who identify it with the \"short\" English \\(a\\). The digraph \\(ai\\) which has been commonly used in the past is not acceptable because it is used in both the Hepburn and Wade-Giles Romanization systems for an ai diphthong. The Romanization \\(ae\\) is obviously superior from the phonetician's viewpoint; for this combination is used as a ligature (\\(e\\)) to represent one of the two pronunciations of this vowel-letter. The digraph \\(ae\\) also calls to mind the alternative spelling of the German \\(\\ddot{a}\\), the normal pronunciation of which is similar to that of \\(H\\). Examples of the Romanization of \\(H\\) are: \\(taemun\\) (main entrance), \\(paektu\\) (whitehead) and \\(sae\\) (bird).\n\n**LABIALIZED VOWELS AND DIPHTHONGS**\n\nIn Korean the vowel-letters \\(o\\) and \\(u\\) are both used in certain combinations to represent the half-vowel \\(w\\). The former, \\(o\\), combined with \\(t\\) (\\(a\\)) and \\(H\\) (\\(as\\)), spells \\(ot\\) and \\(ot\\) which are Romanized \\(wa\\) and \\(wa\\) respectively. The latter, \\(u\\), is combined with \\(t\\) (\\(i\\)) and \\(t\\) (\\(e\\)) to spell \\(ui\\) and \\(ui\\), Romanized \\(wo\\) and \\(we\\) respectively.\n\nThe \\(omun\\) digraph \\(ui\\) varies in pronunciation from a labialized \\(i\\) (\\(wi\\)) through a semi-labialized form to a simple vowel-sound, corresponding closely to the German \\(ü\\) and the French \\(u\\). There is some dispute as to the normal pronunciation of \\(ui\\) in standard dialect, as the variant renderings of Ogura, Jung, Haguenauer and others clearly show. Although it is generally pronounced as a simple vowel-sound throughout southern and eastern Korea and occasionally in the capital region itself, the simple vowel form cannot be considered its standard pronunciation.\n\nExcept as a syllabic initial, however, the labial element in the pronunciation of \\(ui\\) in the standard dialect is weaker than it is in the other labialized vowels. This is particularly true when it is preceded by the consonants \\(s\\), \\(ch\\) or \\(j\\).\n\nIn some respects \\(ui\\), representing a semi-labialized vowel, might be the best Romanization for \\(ui\\). But since the Romanization \\(wi\\) is necessary to represent the fully labialized form of this vowel as a syllabic initial, and since \\(ui\\) is easily confused in pronunciation with a diphthong, we have preferred to Romanize it \\(wi\\) throughout. One exception to this rule is that after the labial consonants \\(m\\), \\(n\\), \\(p\\) or \\(b\\), \\(pp\\) and \\(pp'\\), the labial element is lost in the vowel, and therefore, in these cases, \\(ui\\) is to be Romanized as simple \\(i\\).\n\nThe digraph \\(ot\\), like \\(ot\\), is pronounced as a simple vowel throughout southern Korea, and some authorities regard this as its standard pronunciation. As a simple vowel it may be phonetically transcribed \\(o\\) or \\(a\\) and it thus quite similar to the German \\(ö\\). Haguenauer, however, describes it as a semi-labialized \\(e\\), which may be phonetically transcribed \\(we\\), a pronunciation which is often heard in capital dialect.\n\nWe Romanize this vowel-letter, \\(ot\\), as \\(oe\\) in order to suggest both the simple vowel form and the semi-labial form, and also because \\(oe\\) is close to the \\(omun\\) spelling, \\(o\\) (\\(o\\)) plus \\(i\\) (\\(i\\)). The pronunciation of the labial element of this vowel is more noticeable when it is not preceded by a consonant, as in \\(oeguk\\) (foreign states), but is almost negligible after most consonants, as for example, in the common surname Ch'oe.\n\nThe only vowel-letter representing a diphthong is the\n\n---\n\n1 These consonant and vowel-letter combinations are not very common in \\(omun\\), and never occur in words directly derived from the Chinese. Such syllables Gaic spells according to the older orthography with \\(ui\\), but the United System in keeping with the Gaic employs the simple vowel-letter \\(i\\) (\\(i\\)), and the Government-General dictionary uses \\(ui\\). Examples of uses of this vowel-letter, \\(ui\\), are included in the following list.\n\n| Romanization | Gale | Gov.-Gen. | Unit. Sys. | Meaning |\n|--------------|------|------------|-------------|---------|\n| nabi         | 나비 | 나비        | 나비        | butterfly |\n| mewshada     | 미워하다 | 미워하다 | 미워하다 | to hate |\n| weshin       | 위신 | 위신       | 위신       | prestige |\n| kwesin       | 퀴신 | 퀴신       | 퀴신       | spirits |\n| twi          | 티 | 티         | 티         | after, behind |\n| chwi         | 치 | 치         | 치         | mouse |\ndigraph ㅏ. This is a rising diphthong, composed of the two elements, — (ü) and ㅣ (i), and the natural and easiest way to Romanize it, is simply üi. This digraph, ㅏ, however, represents a diphthong only as a syllabic initial, and after h ㅎ. After all the other consonants it is pronounced like the simple vowel-letter ㅣ and should therefore be Romanized as i in these cases.\n\nYOTIZED OR PALATIZED VOWELS\n\nThe Korean vowel-letters ㅑ, ㅒ, ㅕ and ㅖ representing yotized or palatalized vowels, are formed by adding one stroke to each of the simple vowel-letters ㅏ, ㅓ, ㅗ and ㅜ to indicate that the vowel-sound is preceded by a yod element. The yod element could be Romanized either as i or y, but, since the use of i for it would lead to confusion between yotized vowels and diphthongs, we have adopted the use of y. These four vowels, therefore, are to be Romanized ya, yo, yu respectively, except where special rules noted below lead to the omission of the y.\n\nThere are only two ㅇ만 digraphs and trigraphs representing yotized vowels, ㅐ and ㅔ. The first of these, which\n\n1 There are many other diphthongs in Korean but they are all written in ㅇ만 as two syllables. For example Sǔl 洙 contains a common Korean diphthong, 洙 어우, the component parts of which are always written separately.\n\n2 Because of the phenomenon, the Unified System has changed the spelling of ㅓ to ㅣ where in a single syllable ㅓ follows any consonant but h ㅎ. When the syllable hŭi occurs at the beginning of a word it is often pronounced hi, but this assimilation does not always take place. It rarely occurs when ㅐ appears as any but the first syllable. A few examples will illustrate the Unified System of spelling and the principles of the Romanization of ㅐ.\n\n| Romanization | Gale | Unit. Sys. | Meaning |\n|--------------|------|------------|---------|\n| üsa          | 의사 | 의 사 | doctor |\n| kouli       | 고의 | 고 의 | summer trousers |\n| hŭnhi       | 훈의 | 훈 의 | military doctor |\n| hŭmang      | 훈망 | 훈 망 | hope |\n| kich'a      | 기차 | 기 차 | steam train |\n| p'ida       | 피다 | 피 다 | to bloom |\n\n3 The two virtually obsolete digraphs ㅐ and ㅔ, which seem to represent yotized vowels are only found in the syllables ㅐ, ㅔ and ㅖ. They are to be Romanized shui, ch'ui and ch'we respectively, because, as is explained below, the yod element is always dropped after the two consonants s ㅅ and ch' ㅊ.\n\nis rarely used, signifies a yotized form of the vowel-sound represented by ㅐ (ae), and is therefore to be Romanized yae. The second, the digraph ㅔ, demands special consideration, because, though frequently used, its pronunciation is irregular in so far as the yod element is concerned. As a syllabic initial the yod element is clearly heard; but after consonants it is very weak even in careful diction, and many speakers omit it altogether. To attempt to indicate, in Romanization, a distinction between weak and strong yod elements would be difficult and impractical. We have consequently come to the conclusion that the digraph ㅔ should be Romanized ye in all cases where special rules do not lead to the complete omission of the yod element.\n\nOne important rule regarding the Romanization of the vowel-letters ㅑ, ㅒ, ㅕ and ㅖ, is that the yod element of all yotized vowels has been completely lost in standard pronunciation following the consonants s ㅅ, ss ㅆ, ch or j ㅈ (ㅊ), tch ㅊ, and ch' ㅊ (ㅌ). Consequently, in such cases,\n\n1 The digraph ㅐ occurs frequently in Sino-Korean words, while the digraph ㅔ occurs only in two uncommon forms, ㅐ (ae) and ㅔ (ke). The digraph ㅐ, however, is not used often in native Korean words.\n\n2 When pronounced as a syllabic initial it is written ㅐ, ㅔ and ㅖ, since the consonants ㅐ (t, r) or ㅔ (r), occurring at the beginning of a word, are silent before yotized vowels in capital dialect.\n\n3 After h ㅎ and r ㄹ, occurring as other than word initials, the yod element is more distinct than after k or g ㄱ, ㄲ and a medial n ㄴ, it is not used after other consonants or else is entirely unpronounced because of a general phonetic law discussed below. Examples of these variations follow.\n\n| Romanization | ㅇ만 | Meaning | Strength of yotization |\n|--------------|-----|---------|-----------------------|\n| yeanan       | 계산 | calculation | strong |\n| yemul        | 이물 | gift | strong |\n| unhye        | 우혜 | favor | weak |\n| sarye        | 사례 | thanks | weak |\n| kyesan       | 계산 | computation | almost omitted |\n| p'yehang     | 폐방 | deserted room | almost omitted |\n\n4 When occurring before yotized vowels, t or d ㄷ and t' ㅌ are pronounced the same as ch or j ㅈ and ch' ㅊ. See page 28. Theoretically ㅐ should also be included, but it is never used in ㅇ만 with a yotized vowel-letter.\nthe y is to be omitted in Romanization.\n\nLONG AND SHORT FORMS OF THE VOWELS\n\nWe have already mentioned the variations in the length of the Korean vowels. These variations, which are usually accompanied by differences in articulation, are particularly marked in the cases of e ɛ, ye ɛ̆, i ɪ, u ʊ and yu ŭ. In native Korean words the length of the vowels differs greatly in the different dialects with the result that both individuals and dictionaries vary considerably in evaluating them. However, in Sino-Korean words the length of the vowel, with but a few exceptions, is determined by the tone of the character in Chinese. Characters of the first or second tone (shang-p'ing 上平 and hsia-p'ing 下平) usually have short vowels in Korean, while those of the other tones (shong-shēng 上聲, ch'ū-skēng 去聲 and ju-shēng 入聲) are characterized by long vowels. One general exception to this rule is that syllables ending in k t p h and l ə are always short.\n\nAlthough dictionaries sometimes disagree as to the length of the vowels in native Korean and Sino-Korean words, they usually indicate whether the vowels are long or short. Gale's dictionary indicates the length of the first vowel in all words. The Government-General dictionary goes further in marking all long vowels in each word. Thus it is quite possible, merely through the use of dictionaries, to determine which vowels are long and which are short. However, it is usually unnecessary to indicate differences in vowel lengths in Romanizing, for the distinction is not important in most words, and with the exception of a few cases in which the vowels e, i and u are concerned, there can be little confusion caused by the failure to mark the length of the vowel.\n\nWe suggest, therefore, that the Romanizer employ a critical mark to indicate a long vowel only where he feels that confusion is likely to occur unless a distinction is made between long and short vowels. As an indication of the long vowel, we suggest the use of the long sign — over all vowel letters but e, where we recommend the use of the accent acute, ē.\n\nA few examples will help to indicate the difference between the long and short forms of a few vowels, and will illustrate how they may be specially Romanized in the cases where it is desirable to distinguish between the two forms. The i of 김 is short, Kim, in the common surname, but long, kim, in the word for steam. The letter T indicates a short vowel in munan 문안 (inside the gates), but a long vowel in mānan 문안 (respectful salutation). Similarly ŭ is short in kyul 과 (tangerine) but long in yāmōng 유명 (famous). The vowel digraph ɛ̆ represents a short vowel in megi 먹기 (food) but a long vowel in méda 메다 (to carry on shoulders), while the corresponding yotized form ɛ̆ is short in yemul 예물 (present) but long in yēsan 예산 (agreement).\n\n1 Jung's two phonetic renderings of each of the Korean vowel letters will give some idea of the differences between the long and short forms and the accompanying differences in their oral formation. This can also be roughly illustrated by a few English words. In each case the English word is followed by no means identical with the Korean, but is written in order to indicate the nature of the change in the Korean vowel. The short and long forms of the Korean vowel represented by i may be compared to the i's in hit and machine; the two forms of the vowel written T to the u's of put and rule; and the long and short forms of the vowel represented by ŭ to the vowels of bad and they.\nIRREGULARITIES IN THE PRONUNCIATION OF THE VOWELS\n\nThere are some other irregularities in the pronunciation of the Korean vowel-letters besides those already taken into consideration. These for the most part occur in native Korean words, but they are also found in Sino-Korean words. They are sometimes regarded as simple corruptions or colloquialisms, but the phonetician naturally recognizes in them expressions of the normal development of the spoken language. As the ṁmun spelling of native Korean words is usually phonetic rather than traditional, new spellings have sometimes conformed to these irregular pronunciations; but this has not always been the case. The result is a number of inconsistencies in ṁmun spelling which cannot be ironed out by rules of Romanization. Therefore, although we take note of them, we cannot make provisions for them in our system of Romanization.\n\nThe Chosŏn p'yejim mai ṁmun, a publication of the Korean Language Research Society, mentioned above, indicates the standard pronunciation and the revised spelling of irregular Korean words; but usually it is best to Romanize irregular Sino-Korean words according to the traditional pronunciations reflected in their standard spellings. Fortunately, in ordinary Romanization, these irregularities will rarely be encountered and will, therefore, cause little difficulty.\n\nStudies of Korean dialects by Korean and Japanese philologists have helped to make possible the formulation of certain general principles concerning some of these irregularities. These may be classified in two general categories, first, \"disintegration\" and variation in vowels which are difficult to pronounce or are subject to change for other reasons, and second, the transformation of vowels through assimilation with other vowels.\n\n\"Disintegration\" in Individual Vowels\n\nOne vowel-sound in which the process of \"disintegration\" is already complete is the sound of the original Korean vowel represented by lower a ʌ, which has lost its phonetic identity. The vowel-letter ʌ naturally has afforded one of the chief problems of the ṁmun revisionists, who have discarded it in modern spelling. Generally it is now pronounced as a ʌ in the standard dialect, but in native Korean words this is not always the case. The most important alternative pronunciation of this vowel-letter is ʌ̆, which is often its pronunciation when it occurs as the second syllable of a word. For example, 오늘 (today) is now pronounced onul, and is written 오늘이 in the Unified System.\n\nMuch less extreme cases of \"disintegration\" and variation are afforded by the yotized vowels, labialized vowels, and simple vowels written in ṁmun as digraphs. In the case of yotized vowels there is a tendency to omit the yod element when the vowel is preceded by a consonant in the same syllable. One example of this is yo ʌ, which may become e or i or sometimes ae. Occasionally this transformation has become well enough established in certain words to have led to an alteration in revised spelling systems, as in the word pyogae 벼귀 (pillow), pronounced and now spelled pegae 벼귀. A more unusual example of this phenomenon occurring in a Sino-Korean word is found in the syllable kil 길 which in the word 길 (violet) is pronounced and spelled kil 길 (kilgyong 길경).\n\nAlmost all of the ṁmun digraphs have variant pronunciations. For example, in parts of southern Korea the\ntendency is to pronounce ae ᴛ and e ᴛ alike, and ui ᴛ and i ᴛ alike; in central Korea, oe ᴛ and we ᴛ are confused in some words; and in the north, ae ᴛ is sometimes pronounced ai ᴛ.\n\nThe labialized vowels are not commonly used following consonants, but when they do occur there is a tendency either to omit the labial element or to modify the vowel-sound. For example, 국 (national isolation), traditionally spelled swaguk 국, is now pronounced and spelled swaeguk 국.\n\nAssimilation between Vowels\n\nCertain Korean vowels often influence the pronunciations of other vowels which precede or follow them. This phenomenon is called assimilation between vowels. A simple example of this is afforded by the word chami 자미 (interest), pronounced chaemi 자미 because of assimilation between a ᴛ and i ᴛ. The only vowels which affect their neighboring vowels consistently enough to demand consideration here are the yotized vowels and i ᴛ, which often affect the vowels which precede them. The affected vowels in these cases are thus pronounced as if written with the i (i) stroke added: a ᴛ becomes ae ᴛ, o ᴛ becomes eo ᴛ, u ᴛ becomes ue ᴛ and u ᴛ becomes wi ᴛ. In native Korean words this assimilation is frequent but is not always made. Spelling has often conformed to the change in pronunciation. In Sino-Korean words, the assimilation is less frequent and is found only in commonly used words.\n\nIn native Korean words, i ᴛ is often directly assimilated into a preceding vowel, changing it as noted above. For example, ttaida 타이다 (to be under arrest), is pronounced ttaeda 타이다. In Sino-Korean words, the two vowels do not become one, although assimilation takes place. For example, kain 個人 (an individual) is pronounced kaein 개인.\n\nEven when a consonant intervenes between a vowel and an i ᴛ, the former is similarly affected. A familiar example is the native word pangi 방이 (onion), which is pronounced paengi 방이. A Sino-Korean example is ch'umi 趣味 (artistic taste), pronounced ch'umini 츠미. This phenomenon occurs most regularly and frequently in verb forms where the syllables i ᴛ, hi ᴛ or ki ᴛ are inserted between verb stems and verb endings, either to denote the causative or to make active verbs passive.¹\n\nYotized vowels often influence the pronunciation of a preceding vowel in much the same way as i ᴛ. They are not directly assimilated, however, even when no consonant intervenes. Examples are saeyanghada 사양하다 (to refuse), pronounced saeyanghada 사양하다, and namp'yon 남편 (husband), pronounced naemp'yon 남편.\n\nAlthough this general rule of assimilation may be followed for many words, particularly for verb forms, it is impossible to apply it strictly to the rules of Romanization because of its inconsistency. Even though the colloquial speech employs these euphonic changes, the unassimilated form is recognizable and acceptable in standard pronunciation, and thus it is not necessary to alter Romanization rules to meet the assimilation.\n\n¹ Examples are:\n\n| Active Verbs | Causative or Passive Verbs |\n|--------------|---------------------------|\n| Romanization | Meaning                  | Romanization | Meaning                  |\n| chapt'a      | 착다 to catch             | chaphida     | (chaephida) 착하다 to be caught |\n| palt'a       | 벗다 to strip            | pokkida      | (pekkida) 벗기다 to cause to strip |\n| mok'ta       | 먹다 to eat              | mogida       | (megida) 먹이다 to cause to eat |\n| chuk'ta      | 죽다 to die              | chugida      | (chwigida) 죽이다 to cause to die |\n\nMuch of the material for this section has been taken from Choi's Uri mal pox.\nIII. THE CONSONANTS\n\nIt is generally possible to Romanize each of the *onmun* vowel-letters with but a single Latin letter or digraph, but because of the influence of euphonic change upon the consonants, there must generally be a plurality of Romanizations for each of the consonant letters. To the Korean most of these euphonic changes are so natural that he considers them self-evident, but to those not familiar with the language they are bewildering at first, because they are not phonetically necessary in western languages. Therefore, a system of Romanization which does not take these euphonic changes into consideration will be misleading and inaccurate.\n\nThe name of one of the ancient Korean kingdoms is spelled 신라 Sin-ra but is pronounced Silla. The name of the Yalu River is written 압록 Ap-rok but is pronounced Amnok. A simpler example is the name of another ancient kingdom spelled 고구려 Ko-ku-ryŏ but pronounced Koguryŏ. Many people familiar with Korean are inclined to dismiss the last case as of small importance, but the distinction between the unvoiced plosive *k* and the voiced plosive *g*, though ignored in *onmun*, cannot be overlooked in any system of Romanization which is to be used by those who do not know the Korean language.\n\nIn order adequately to Romanize the consonant letters, it is necessary to take into consideration their positions in the word in relation to the other letters and not merely as individual letters. This is most easily done by treating each *onmun* letter separately as initial, medial and final letters.\n\nThe chart on the opposite inserted double page lists all the *onmun* consonant letters, Ogura's literal transcription for them, his phoretic transcriptions for each letter in initial, medial and final positions, our Romanizations for the same three positions, and the Romanizations of Haguenaue, Gale, Eckardt, the French missionaries, and Jung, in the order named. The *onmun* letters are arranged in the usual Korean order.\n| Consonant Chart |\n|-----------------|\n| **Initial**     | **Medial**    | **Final**   | **McCune-Reischauer ROM.** | **Eng.-Gale ardth** | **Fokk.-Fr. Jung** |\n| k               | k             | k           | k                           | k                   | k                   |\n| n               | n             | n           | n                           | n                   | n                   |\n| t               | t             | t           | t                           | t                   | t                   |\n| r               | r             | r           | r                           | r                   | r                   |\n| p               | p             | p           | p                           | p                   | p                   |\n| s               | s             | s           | s                           | s                   | s                   |\n| ř               | ř             | ř           | ř                           | ř                   | ř                   |\n| č               | č             | č           | č                           | č                   | č                   |\n| ť               | ť             | ť           | ť                           | ť                   | ť                   |\n| ž               | ž             | ž           | ž                           | ž                   | ž                   |\n| ě               | ě             | ě           | ě                           | ě                   | ě                   |\n| ď               | ď             | ď           | ď                           | ď                   | ď                   |\n| ň               | ň             | ň           | ň                           | ň                   | ň                   |\n| ř               | ř             | ř           | ř                           | ř                   | ř                   |\n| č               | č             | č           | č                           | č                   | č                   |\n| ť               | ť             | ť           | ť                           | ť                   | ť                   |\n| ž               | ž             | ž           | ž                           | ž                   | ž                   |\n| ě               | ě             | ě           | ě                           | ě                   | ě                   |\n| ď               | ď             | ď           | ď                           | ď                   | ď                   |\n| ň               | ň             | ň           | ň                           | ň                   | ň                   |\n\n*Underlined letters in the McCune-Reischauer \"final\" column are for Romanizations in the new spelling systems.*\n\n*• signifies that the consonant is uppronounced, thus omitted in Romanization.*\nAs will be seen by the chart, an attempt has been made in our system of Romanization to strike a balance between phonetic accuracy and general utility. Therefore, minor variations in pronunciation have been disregarded, but major differences have all been included. Our system of Romanizing the consonants is more complex than that of other systems, and, therefore, some may feel that it is not satisfactory for ordinary use, but when one sees the radical variation in the pronunciation of most of the consonant letters as recorded by Ogura, one will realize that all the simple systems, where most of the ḍmman consonant letters have but a single equivalent in Romanization, are very misleading and inaccurate.\n\nIn order to make clear the problems involved in the choice of Latin letters for the Romanization of the ḍmman consonant letters, we have first analyzed the consonants themselves from a phonetic point of view and have then discussed the variant Romanizations of each ḍmman letter. The Korean consonants may be conveniently divided into two general categories, the plosives and the non-plosives.\n\n**PLOSIVE CONSONANTS**\n\nThe plosive consonants may be divided into four series according to the articulating organs used in each. They are the labial plosives, which we call the *P* series, the dental plosives or the *T* series,¹ the velar plosives or the *K* series and the palatal plosives or affricates, which we call the *Ch* series.² The following chart shows the various forms of the\n\n---\n\n¹ The point of occlusion of the Korean dental plosives is actually between the dental and alveolar regions, and consequently, they are sometimes called alveolar plosives.\n\n² The consonants written in ḍmman as ṁ, ṁ, and ṁ are transcribed phonetically by Jung as ṁ, ṁ, and ṁ, indicating that they are plosives, whereas they are considered to be affricates or fricatives by Ogura (ḥ, ḥ, and ḥ), Haguener and others.\n\nThe use of symbols such as ṁ, ṁ, ṁ, and ṁ might be preferable for their Romanization but would introduce a new diacritical mark. The Romanizations of the French missionaries, ṁ, ṁ, and ṁ imply combinations of voiced and unvoiced consonants and, when written together with other consonants, would result in clumsy and confusing groups of Latin consonant\nfour plosive series. Each *omun* letter is accompanied by its Latin equivalent when it is pronounced as a plosive but not when, in accordance with euphonic changes, it is pronounced as a non-plosive consonant.\n\n| CHART OF PLOSIVES |\n|-------------------|\n| Articulation      | Labial | Velar | Dental | Palatal |\n| Unvoiced          | ᵗ p    | ᵗ k   | ᵗ t   | ᵗ ch ** |\n| Voiced            | ᵗ b    | ᵗ g   | ᵗ d   | ᵗ j **  |\n| \"Forced\"          | ᵗ pp   | ᵗ kk  | ᵗ tt  | ᵗ tch   |\n| Aspirated         | ᵗ p'   | ᵗ k'  | ᵗ t'  | ᵗ ch' ** |\n\n* Also ᵗ as a syllabic final. See p. 28 and 29.\n** Also the corresponding letter of the T series when followed by ᵗ or a yotized vowel. See p. 28.\n\nIn English the plosives are easily and conveniently classified as pairs of unvoiced and voiced consonants (p, b; k, g; t, d). In Korean, however, besides the differentiation of voicing, the degree of aspiration and the presence or absence of glottal closure affect their pronunciation. These variations make it necessary to devise a Romanization scheme for the plosives which will provide proper distinctions between the four types indicated on the chart above.\n\nLetters. Since no other substitutes seem satisfactory, we have felt it best to follow our general rule of basing the Romanization of consonants on their nearest equivalent in English. We have, therefore, used the Latin letters ch, j, tch and th' for this series. Because most of the foreign residents of Korea are English speaking people and favor the use of these Romanizations and because the Hepburn and Wade-Giles systems use the same letters for similar sounds, we have chosen these Romanizations in preference to others which might be more satisfactory to non-English-speaking people.\n\n1 The average Korean does not distinguish between the voiced and unvoiced sounds of these plosives, as will be seen by the fact that both are written by the same *omun* letter. On the other hand the average American or Englishman does not distinguish between Korean unvoiced and aspirated\n\nUnvoiced Plosives\n\nThere is considerable dispute as to whether the unvoiced plosives as initials are unaspirated or are slightly aspirated. Even if there may be some slight aspiration, these forms are never confused with the fully aspirated plosives by Koreans. As medials these unvoiced plosives vary considerably in pronunciation, especially when they precede or follow voiced phonemes and are assimilated to become entirely different phonemes themselves. When they precede or follow unvoiced consonants they do not change radically, but are somewhat influenced by their neighbors. In the final position the palatal plosive (ch) never occurs. The others are incomplete plosives characterized by occlusion at the point of articulation and probably accompanied by glottal closure. For the purposes of Romanization the variations in the phonetic value of the unvoiced plosives may be ignored, because they are slight and because they are clearly indicated by the positions of the plosives in the word.\n\nThe unvoiced labial plosive (p) is represented by ᵗ or\n\nPlosives. Three Korean words illustrate this: *gal* ᵗ (arm), *pal* ᵗ (foot) and *sebal* ᵗ (bow). To an American or Englishman the difference between the first two is very difficult to note, and many foreigners pronounce them alike. The Korean, on the other hand, often insists that he pronounces the ᵗ in *gal* and *sebal* the same, although the difference is striking to the western ear.\n\nMany Koreans prefer to Romanize both the voiced and voiceless forms as b, d, g, and j, but this is altogether unsatisfactory for westerners. Others wish to Romanize them as p, k, t, and ch, but this is equally unsatisfactory. A few examples will illustrate the necessity of Romanizing the voiced and voiceless forms differently if the system is to be used as a medium for foreigners.\n\n| *omun* | Meaning | Variant | Romanizations | McCune-Reischauer Romanization |\n|--------|---------|---------|---------------|-------------------------------|\n| 고기   | fish    | ᵗ cooi | ᵗ hoki        | ᵗ kogi                        |\n| 부비   | extra expense | ᵗ bubu | ᵗ pupi        | ᵗ yubi                        |\n| 단단히 | tightly | ᵗ dandanhi | ᵗ tantanhi | ᵗ tandanhi                    |\n| 제자   | disciple | ᵗ jeja | ᵗ checha      | ᵗ cheja                       |\n\n1 Gim Shon Gi concludes from recent kymograph experiments that they are slightly aspirated (*Le Maître Phonétique*, 3rd series, No. 58, April-June, 1937), but most other phoneticians claim that they are unaspirated. Jung transcribes them phonetically as ᵗ, ᵗ, ᵗ, and ᵗ.\n\n2 See note 5 on p. 31.\nby the digraph ㅂ and the velar (k) by ㄱ or by the digraph ㄲ. The unvoiced dental plosive (t) is usually represented by ㄷ, but as a word final it is represented by ㅅ, as in ㅈㅅ (five). The unvoiced palatal plosive (ch) is represented usually by ㅊ, but also by a ㄷ followed in the same syllable by an ㅣ or a yotized vowel.\n\nOne other consonant should be mentioned under the heading of the unvoiced plosives, although it is not regularly represented by an independent ㅇ letter and is not included on the Plosive Chart. It is the glottal stop which occurs as part of the articulation of the \"forced\" plosives and also elsewhere as a medial. It is customary to represent the glottal stop by the letter ㅎ, but the spelling is not uniform. When this letter is used in the medial position it is called the ㅅ (middle ㅅ). It is discussed more fully in a later section.\n\nVoiced Plosives\n\nThe voiced plosives occur only in the middle of a word\n\n1 See pp. 41-42 for a discussion of these digraph spellings.\n2 In standard spelling no letters of the T or Ch series occur as syllabic finals, and only ㄱ and ㄲ of the other plosives. See pp. 46-47 regarding the appearance of the other plosive letters in new spelling systems.\n3 This is true with all forms of the dental plosive series (except ㅌ) which become palatal plosives before ㅣ or a yotized vowel. In northern dialects this phenomenon does not occur and instead the yod element is usually simply omitted from the yotized vowels. However, it occurs throughout the rest of Korea, including the capital, and in the Unified System has led to the substitution of the corresponding forms of the Ch series for letters of the T series when they are pronounced as palatal plosives. The following are a few examples of this phenomenon with the new spelling.\n\n| Romanization | ㅇ | Meaning |\n|--------------|---|---------|\n| chibang      | ㅊ | territory |\n| cheja        | ㅊ | disciple |\n| sonjajon     | ㅅ | church |\n| chido        | ㅊ | railway |\n\nIt should not be assumed that i never follows the plosives of the T series. For example the ㅇ syllable ㅈ should be Romanized ㅈ. In such cases care must be taken in Romanizing to be sure that the correct spelling has been used, since ㅌ (belt) is often written ㅌ. The latter spelling has been adopted by the Unified System.\n\nbetween voiced consonants (m n l ng o and sometimes l ㄹ) and vowels. Because of an established rule of assimilation, the otherwise voiceless plosives, p b k t d and ch ㅊ have borrowed the voicing of their neighboring sounds and have become b g d and j.\n\nThe voiced labial plosive (b) is always represented by ㅂ and the velar (g) by ㄱ. The voiced dental plosive (d) is represented by ㄷ (used as a syllabic initial) or ㅅ (used as a syllabic final). The voiced palatal plosive (j) is represented by ㅈ or by a ㄷ followed by i ㅣ or a yotized vowel.\n\n\"Forced\" Plosives\n\nThe \"forced\" plosives have been the subject of considerable dispute among phoneticians, who disagree about the question of articulation and designation. Haguenauer calls them quasi-geminées, and Jung terms them \"implosives\" or \"double plosives\". Ogura transcribes them phonetically with the symbol of a glottal stop preceding the explosion.\n\n1 The ㄴ is quite variable in its influence on following plosives. In native Korean words the presence or absence of assimilation is largely dependent on the degree of independence of the two syllables. For example ㅁ (objects) is ㅁ, but ㅁ (fish) and ㅁ (drop water) are ㅁ and ㅁ respectively because the syllables are treated in the mind as felt to be an independent unit. However, this is not invariably the case, for the word ㅁ (wood) is pronounced ㅁ. In Sino-Korean words, on the other hand, there is a definite rule that assimilation nearly always takes place between the ㄴ and ㅂ or between ㄴ and ㄱ, but rarely between ㄴ and ㄷ or ㄴ and ㄱ. The following words illustrate this rule.\n\n| Romanization | ㅇ | Meaning |\n|--------------|---|---------|\n| woldi        | 월 | monthly expenses |\n| woldip       | 월 | monthly wages |\n| woldo        | 월 | a type of sword |\n| woldong      | 월 | the end of the month |\n\n2 Sometimes ㅅ as a syllabic final between vowels represents s as it always does as a syllabic initial. This is usually true when it occurs before a postposition or a verb inflection, although this general rule cannot be relied upon except in the Unified System of spelling. When occurring between vowels within the inflected part of a word, ㅅ represents d. For example ㅅ (hat) is ㅅ, but when the nominative postposition is added, it is ㅅ.\n\n3 Ogura's phonetic transcriptions are 'g' and 'k', 'b' and 'p', 'd' and 't', and 'dz' and 'ts'. Jung also indicates glottal closure by the use of the International Phonetic symbols 'b', 'p', 'b' and 'j'. The only point of complete agreement among phoneticians is that these plosives are unaspirated. Most phoneticians, however, also agree that they are unvoiced and have a certain glottal element.\nA possible explanation is that the glottis is first briefly closed and then is opened simultaneously with the explosion of the consonants. These consonants are peculiarly resonant and are therefore commonly confused with the simple voiced plosives by Occidentals. We have called them \"forced\" plosives in accordance with a Korean term used to describe them, *teon sori* (진소리), meaning \"forced sounds.\"\n\nThe \"forced\" plosives occur only as initials and medials. There is some discussion as to whether they have the same phonetic value in both positions. Ogura makes a distinction between the two, as can be seen from the Consonant Chart, but his conclusion that the medial is unvoiced and the initial voiced is open to doubt, and, though the force of the explosion is probably lighter when the \"forced\" plosives are initials than when they are medials, no variation in Romanization seems necessary.\n\nThe \"forced\" labial plosive (*pp*) is usually represented by *p* or *m*, the velar (*kk*) by *k* or *n*, the dental (*tt*) by *c* or *w* and the palatal (*tch*) by *f* or *x*. As medials the \"forced\" plosives may also be represented by an unvoiced plosive preceded by the letter *a*, since the latter symbol when used as a syllabic final preceding an unvoiced plosive usually represents a glottal stop.\n\n1 This is the most widely used name for these plosives in Korea. The small *a* attached to the plosive letters is always called the *teon sori* (forced) and the same adjective is applied often to the entire plosive. Sometimes the adjective *tchakkkodup* (identical-doubled) is used for them. The Unified System names the forms it uses, *m*, *w*, *x*, the *seong* (twin) letters.\n\n2 For exceptions see section on *sori sori*. The unvoiced plosives following another plosive are pronounced very much like \"forced\" plosives because the occlusion of the preceding plosive acts as the glottal stop which is a characteristic of the \"forced\" plosives. Since the Romanized form of the plosive letters as \"forced\" plosives in these cases would result in large groupings of Latin consonant letters and would probably confuse the reader rather than aid him, it is best to Romanize the \"forced\" plosives occurring in such cases as common unvoiced plosives in keeping with the *omun* orthography. A person familiar with the language can tell from the combination of the two plosives that the second is a \"forced\" plosive. An example of this phenomenon and of its Romanization is the name of a Korean kingdom *Paekche* (백제) which is pronounced like *Paekche* (백제).\n\nAccording to these rules of Romanization the combination of a *a* or *u*\n\nThe choice of suitable Romanizations for the \"forced\" plosives is more difficult than in the case of the other plosives. *B*, *g*, *d*, and *j* are not advisable because, first, they have already been employed for the simple voiced plosives, and, second, because these letters should not be used to represent unvoiced sounds. The addition of diacritical marks to these letters or to *p*, *k*, *t* and *ch* would result in further complications and would probably not be very intelligible. Therefore, for want of more suitable Romanizations, we have decided to represent the \"forced\" plosives, in accordance with one form of their *omun* spelling, as a doubling of the unvoiced plosive letters. The first three, consequently, are to be Romanized as *pp*, *kk* and *tt*; and the fourth, the palatal plosive, as *tch*, since *chch* is obviously too awkward.\n\nAspirated Plosives\n\nThe aspirated plosives occur only as initials and medials. The aspiration is always quite strong. We have indicated the aspiration by the usual symbol ' following the unvoiced plosive letters. Since this is used in the Wade-Giles system for the Chinese aspirates and also in most Korean Romanization systems, it is the most suitable symbol to use as the sign of aspiration.\n\nThe aspirated labial plosive (*p') is represented by *p*, the velar (*k') by *g* and the dental (*t') by *e*. The aspirated palatal plosive (*ch') is represented by *x*, or by *a* followed by *i* or a yotized vowel. The aspirated plosives, with the exception of the palatal aspirate (*ch'), are also often repre-\n\npreceded by the same letter is to be Romanized the same as the medial \"forced\" plosive digraphs *p* or *m*. For example *pp* and *pp* are both Romanized *ppki*. Actually their pronunciations are not exactly the same, for the medial consonant of the latter is a simple \"forced\" *k* and that of the former is a compound consonant with a *k* preceding a \"forced\" *k*. However, for the sake of simplicity, it seems best to Romanize these two alike, since they are quite similar.\nsented by their respective unvoiced letters as syllabic finals (ㅂ, ㅍ, ㅊ) when they are followed by the glottal fricative ㅎ (h). When the assimilation is complete between the syllabic final and the fricative, the result is a simple aspirated plosive. But since the assimilation is not always complete and the two are sometimes pronounced separately, we have thought it best not to Romanize such combinations as aspirated plosives but as unvoiced plosives plus h.\n\nNON-PLOSIVE CONSONANTS\n\nThere are seven letters in the Korean alphabet representing non-plosive consonants. The sounds which they normally represent together with our Romanizations for them are given in the following chart.\n\n| CHART OF NON-PLOSIVES |\n|------------------------|\n| Labial | Dental | Velar | Glottal |\n| Nasal   | p m    | l n   | o ng   |\n| Lateral | e l    |       |        |\n| Semi-rolled | e r |       |        |\n| Fricative | s, sh |       |        |\n\nThe ㄹ (l) and ㄹ (r) might better be considered alveolar rather than dental consonants, but because of the relationship between them and ㄴ (n) and ㄷ (t) we have listed them as dentals.\n\n1. Some examples of these combinations are:\n\n| Romanization | Ouman | Meaning                  |\n|--------------|-------|--------------------------|\n| hap'ha da   | 합하다 | to join together         |\n| sok'hi      | 속히   | quickly                  |\n| han'hee     | 한희   | scientific society       |\n| mo'tha da   | 못하다 | to be unable to do       |\n\nNasal Consonants\n\nIt should be noted that these consonants have no off-glide when they occur as word finals.\n\nThe labial nasal (m) occurs as an initial, medial and final. It usually is represented by the letter ㅁ. It is also sometimes represented by the letter ㅂ, since the labial plosive (p) becomes a labial nasal (m) before nasals, as in 임내 imnae (mimicry) and 십명 simmyong (ten persons). It is also occasionally represented by the digraphs ㅂm, 1 and ㅂm, 1.\n\nThe dental nasal (n) occurs as an initial, medial and final, but it never occurs as an initial before ㅣ or a yotized vowel. 2 It is usually represented by the letter ㄴ, but it is also sometimes represented by the letter ㄹ, since the dental lateral (l) becomes nasalized when it occurs as a word initial before a vowel other than ㅣ or a yotized vowel, as in 낙태 nakche (failure), and 독립 tongnip (independence). The dental nasal (n) is also sometimes represented by the letter ㅅ, since the latter as a dental plosive (t) becomes nasalized through regressive assimilation before the nasals and through reciprocal assimilation before the dental lateral (l). Examples of ㅅ as a dental nasal are 갓모 kanmo (hat covering) and 갓양 tannyang (500 cash).\n\nThe velar nasal (ng) occurs only as a medial and\n\n---\n\n1 See page 42.\n2 In words which were once pronounced and are still usually spelled in standard orthography with an initial ㄴ (n) followed by ㅣ or a yotized vowel, the consonant is simply omitted in the capital dialect. In the north it is retained, and there the dental lateral (l) is also pronounced as a dental nasal when it occurs initially before ㅣ or a yotized vowel. For example ㅅ (teeth) and ㅂ (a common surname) are both pronounced ㅂ in the north but are pronounced ㅂ in the capital. The United System spells both as ㅂ.\n\nTheoretically it is possible for ㅂ to appear before ㅣ as an initial, for ㅂ would be the correct Romanization of the syllables ㅂ and ㅂ. However, the latter is not used and the former occurs only in a very few native onomatopoetic words.\nIt is usually represented by the letter \\( \\theta \\). It is sometimes represented by the letter \\( \\gamma \\) (and the digraph \\( \\gamma \\)), since the velar plosive (\\( \\theta \\)) becomes a velar nasal (\\( ng \\)) before nasals through regressive assimilation and also before the dental lateral (\\( l \\)) through reciprocal assimilation. Examples of \\( \\gamma \\) as a velar nasal are 국인 \\( kuaymin \\) (the nation) and 착한 \\( changnun \\) (play).\n\n**Lateral and Semi-Rolled Consonants**\n\nThe dental lateral (\\( l \\)) occurs only as a medial and final. As the final consonant of a word, like all other Korean consonants, it has no off-glide. Phonetically speaking, this lateral is quite \"clear\", and thus is more like the French than the English \\( l \\). It is usually represented by the letter \\( \\theta \\) as in pal \\( \\theta \\) (foot) and halmon \\( \\theta \\) (grandmother). It is also sometimes represented by the letter \\( \\gamma \\), since the dental nasal (\\( m \\)) becomes a dental lateral (\\( l \\)) when preceding or following another dental lateral, as in Silla \\( \\gamma \\) (a Korean kingdom) and oljun \\( \\gamma \\) (quickly).\n\nThe dental semi-rolled consonant (\\( r \\)) never occurs except as a medial between vowels or between a vowel and the glottal fricative (\\( h \\)). Like the lateral (\\( l \\)), it is \"clear\", and thus is not similar to the usual English \\( r \\) but is more like the clear French \\( r \\). It is represented only by the letter \\( \\theta \\), which normally represents the dental (\\( l \\)) but is pronounced with a semi-roll between vowels and before \\( h \\). Examples are found in maru \\( \\theta \\) (floor) and irhm \\( \\theta \\) (name).\n\n---\n\n1. In ancient pronunciation it was also used as an initial. For example, the Chinese character for fish \\( \\theta \\) was once probably pronounced \\( \\theta \\), though now it is pronounced \\( \\theta \\). In compounds employing this character the \\( \\theta \\) sound is often retained in modern pronunciation. For example, \\( \\theta \\) plus \\( \\theta \\) is pronounced \\( \\theta \\) (peach) and \\( \\theta \\) plus \\( \\theta \\) is pronounced \\( \\theta \\) (carp). In both these examples Gale's dictionary spells the words as pronounced (\\( \\theta \\) and \\( \\theta \\)), and in other similar cases the standard \\( \\theta \\) spelling has been changed to fit the pronunciation.\n\n2. The letter \\( \\theta \\) as a syllabic initial is now used as the sign of the absence of a consonant, although at one time there was a distinction between the two letters, one, \\( \\theta \\), representing the absence of consonant sound, the other, \\( \\theta \\), representing the \\( ng \\) sound.\n\n3. See page 42.\n\n---\n\n**Fricative Consonants**\n\nThe dental fricatives (\\( s \\), \\( sh \\)) and (\\( ss \\)) occur as initials and medials only. The first two are represented by the same letter, \\( \\theta \\). Before \\( \\theta \\) (\\( \\theta \\)), \\( \\theta \\) is pronounced much like the sound written \\( sh \\) in English, and consequently, we have Romanized it \\( sh \\) in this case, as in the word \\( shweia \\) (fifty). Before the vowels \\( i \\), \\( \\theta \\), \\( \\theta \\) and the labialized vowels, it has this same tendency, but less noticeably except in non-capital dialects, and so we have Romanized it before these and all other vowels as a simple \\( s \\). For example, \\( san \\) \\( \\theta \\) (mountain) and \\( simmun \\) \\( \\theta \\) (newspaper) have quite different initial consonants although they are Romanized the same. This consonant is usually accompanied by aspiration, but there is no agreement among phoneticians as to its degree or significance. Since there is this disagreement, and since the Occidental usually does not notice the aspiration, it seems best not to add the sign of aspiration in Romanizing this consonant.\n\nThe third dental fricative (\\( ss \\)) is known as a \"forced\" \\( s \\). Like the \"forced\" plosives its articulation is probably accompanied by glottal closure and greater tension, which produce somewhat stronger pressure at the point of friction than in the case of the simple \\( s \\). In accordance with the \\( \\theta \\) spelling of this consonant and our Romanizations for the \"forced\" plosives, we have Romanized it as \\( ss \\). This fricative is represented by the compound letter \\( \\theta \\), as in \\( \\theta \\) \\( ssuda \\) (to be sour).\n\nThe glottal fricative (\\( h \\)) occurs only as an initial and medial. As an initial it is pronounced with more friction in some words than in others, but, since the difference is slight and usually of no importance in the identification of the word, we have not made provisions for this variation. As a\n\n---\n\n1. Haguenaue and Ogura do not note this aspiration in their transcriptions. Gim Shon Gi notes that this fricative is consistently aspirated wherever it occurs. Pieters notices a distinct glottal aspiration when the \\( s \\) is a word initial followed by the vowels \\( i \\), \\( \\theta \\), \\( \\theta \\), \\( o \\) and \\( ae \\).\nmedial between vowels and between voiced consonants and vowels the aspiration is generally very light and sometimes scarcely noticeable. As noted above, this fricative (h), following unvoiced plosives, is sometimes assimilated with them to produce aspirated plosives. For example the word sokhi 속히 (quickly) is pronounced sok'i. However, because this assimilation is not always complete, it is best to disregard it in Romanization. The glottal fricative (h) is represented only by the letter ᵃ and is always Romanized h.\n\nRULES FOR THE ROMANIZATION OF THE CONSONANT LETTERS\n\nIn the preceding two sections the Korean consonants and their euphonic changes have been discussed from the phonetic point of view. In this section each ḍnmun consonant letter will be considered from the point of view of its Romanizations. The rules governing these Romanizations are listed in the following pages, applying only when standard spelling is used. Romanization problems introduced by new spelling systems are discussed in a later section especially devoted to them. The order of letters is the common Korean order found in the Consonant Chart. The definitions are from Gale's dictionary.\n\n| ḍnmun letter | Position | Rules for Romanization | Examples | Rom. ḍnmun Meaning |\n|---------------|----------|------------------------|---------|--------------------|\n| L (ⁿ)         | Initial  | 1. Not Romanized before i and yotized vowels. | i       | teeth               |\n|               |          | 2. N before other vowels. | nol     | day                |\n|               | Medial   | 1. L when preceded or followed by e l. | allas   | quickly            |\n|               |          | 2. N in all other cases. | yolkok  | connection         |\n|               | Final    | 1. Always N. | Hananim | God                |\n|               |          |                     | hanmun  | Chinese            |\n|               |          |                     | son      | mountain           |\n\n| ḍnmun letter | Position | Rules for Romanization | Examples | Rom. ḍnmun Meaning |\n|---------------|----------|------------------------|---------|--------------------|\n| C (ⁿ)         | Initial  | 1. CH before i and yotized vowels. | chibang | territory          |\n|               |          | 2. T before other vowels. | tasol   | five               |\n|               | Medial   | 1. J before i and yotized vowels when preceded by a vowel or by m, n, and ng. | chongji | heaven and earth |\n|               |          | 2. D before other vowels when preceded by a vowel or by m, n, and ng. | mudang  | sorceress         |\n|               |          | 3. Ch before i and yotized vowels when preceded by k, l, and s. | yulcho  | contract          |\n|               |          | 4. T before other vowels when preceded by k, l, and s. | pyoktol | brick             |\n|               | Final    | 1. Always K (occlusives) | kok     | earthenware jar   |\n\n(Used in new spelling only)\n### ROMANIZATION OF KOREAN\n\n| ႀ (n, l) | Position | Rules for Romanization | Examples | Rom. ႀennon Meaning |\n|----------|----------|------------------------|----------|---------------------|\n| Initial  | 1. Not Romanized before ㅣ and voiced vowels. |  |  |  |\n|          | 2. N before other vowels. |  |  |  |\n| Medial   | 1. R between vowels and before ㅎ. |  |  |  |\n|          | 2. L before all other consonants and after ㄴ, ㄹ, and ㅂ. |  |  |  |\n|          | 3. N after other consonants. |  |  |  |\n| Final    | 1. Always L. |  |  |  |\n\n| ႁ (m) | Position | Rules for Romanization | Examples | Rom. ႀennon Meaning |\n|-------|----------|------------------------|----------|---------------------|\n| Initial | 1. Always M. |  |  |  |\n| Medial  | 1. Always M. |  |  |  |\n| Final   | 1. Always M. |  |  |  |\n\n| ႃ (p) | Position | Rules for Romanization | Examples | Rom. ႀennon Meaning |\n|-------|----------|------------------------|----------|---------------------|\n| Initial | 1. Always P. |  |  |  |\n| Medial  | 1. B between vowels and after ㅁ, ㅂ, ㅇ and ㅎ. |  |  |  |\n|          | 2. M before ㅁ, ㅂ, ㅇ and ㅎ. |  |  |  |\n|          | 3. P before and after all other consonants. |  |  |  |\n| Final    | 1. Always P (occlusive). |  |  |  |\n\n| ႄ (ng) | Position | Rules for Romanization | Examples | Rom. ႀennon Meaning |\n|--------|----------|------------------------|----------|---------------------|\n| Initial | 1. Not Romanized. |  |  |  |\n| Medial  | 1. Not Romanized as syllabic initial. |  |  |  |\n|          | 2. NG as syllabic final. |  |  |  |\n| Final    | 1. Always NG. |  |  |  |\n\n| ႅ (s) | Position | Rules for Romanization | Examples | Rom. ႀennon Meaning |\n|-------|----------|------------------------|----------|---------------------|\n| Initial | 1. SH before ㅣ(이) ㅚ. |  |  |  |\n|          | 2. S before others vowels. |  |  |  |\n| Medial   | 1. SH when a syllabic initial before ㅣ(이) ㅚ. |  |  |  |\n|          | 2. S when a syllabic initial before other vowels (except after ㅣ) and when a syllabic final before ㅅ and ㅆ. |  |  |  |\n|          | 3. N before ㅁ, ㅂ, ㅇ and ㅎ. |  |  |  |\n|          | 4. T before ㅅ, ㅎ and letters of the T and Ch series, and before other plosives when in a compound word. |  |  |  |\n|          | 5. D when a syllabic final before vowels except before postpositions. |  |  |  |\n|          | 6. P before ㅂ, ㅍ when not in compound words. |  |  |  |\n|          | 7. K before ㄱ, ㄲ when not in compound words. |  |  |  |\n| Final    | 1. Always T (occlusive.) |  |  |  |\n\n| ႆ (al) | Position | Rules for Romanization | Examples | Rom. ႀennon Meaning |\n|--------|----------|------------------------|----------|---------------------|\n|        |          |                        |          | egg                 |\n|        |          |                        |          | Germany             |\n|        |          |                        |          | farmer              |\n|        |          |                        |          | room                |\n### ROMANIZATION OF KOREAN\n\n| Onmun letter | Position | Rules for Romanization | Examples |\n|--------------|----------|------------------------|----------|\n| 스 (ch)      | Initial  | 1. Always CH.          | chang    |\n|              | Medial   | 2. J between vowels.   | tojang   |\n|              | Final    | 3. CH after all other consonants, t k p, l, and s. (Used only in new spelling.) | mechang  |\n|              |          |                        | apchil   |\n|              |          |                        | mulchil  |\n|              |          |                        | yetchok  |\n|              |          |                        |          |\n| 치 (ch')     | Initial  | 1. Always CH'.         | ch'a     |\n|              | Medial   | 2. Always CH'.         | kimchi   |\n|              | Final    | (Used only in new spelling.) |          |\n|              |          |                        |          |\n| ㅌ (k')      | Initial  | 1. Always K'.          | k'o      |\n|              | Medial   | 2. Always K'.          | wash'ing |\n|              | Final    | (Used only in new spelling.) |          |\n|              |          |                        |          |\n| ㅌ (t')      | Initial  | 1. Ch before l and r.  | ch'ending|\n|              | Medial   | 2. T before other vowels. | tasan   |\n|              | Final    | 3. CH before l and r.  | tongchol |\n|              |          |                        | chot'a   |\n|              |          |                        |          |\n| ㅍ (p')      | Initial  | 1. Always P'.          | p'al     |\n|              | Medial   | 2. Always P'.          | sop'an   |\n|              | Final    | (Used only in new spelling.) |          |\n|              |          |                        |          |\n| ㅎ (h)       | Initial  | 1. Always H.           | hana     |\n|              | Medial   | 2. Always H.           | manhi    |\n|              | Final    | (Used only in new spelling.) | hakhoe  |\n|              |          |                        |          |\n\n### ROMANIZATION OF KOREAN\n\n| Onmun letter | Position | Rules for Romanization | Examples |\n|--------------|----------|------------------------|----------|\n| 지 (k)       | Initial  | 1. Always KK.          | kkakchi  |\n|              | Medial   | 2. Always KK (except after t h, where it is K). (Used only in new spelling.) |          |\n|              | Final    |                        |          |\n| ㅊ (tt)      | Initial  | 1. Always TT (theoretically tch before l t and yotized vowels but never used.) | ttang    |\n|              | Medial   | 2. Always TT (except after s, where it is T). (Not used.) |          |\n|              | Final    |                        |          |\n| ㅍ (pp)      | Initial  | 1. Always PP.          | ppuri    |\n|              | Medial   | 2. Always PP (except after p, where it is P). (Not used.) |          |\n|              | Final    |                        |          |\n| ㅆ (ss)      | Initial  | 1. Always SS.          | ssida    |\n|              | Medial   | 2. Always SS (except after s, where it is S). (Used only in new spelling.) |          |\n|              | Final    |                        |          |\n| ㅈ (jch)     | Initial  | 1. Always TCH.         | jcharida |\n|              | Medial   | 2. Always TCH (except after s, where it is CH). (Not used.) |          |\n|              | Final    |                        |          |\n\nOnly three consonant digraphs, ㄺ, ㄻ, and ㄼ, appear in standard spelling, and these only as syllabic finals in native words. The general rules for the Romanization of these\n\n---\n\n1 In ancient Korean, compound consonants occurred as initials. For example, ㅅ (s) was formerly pronounced ㅂ (b). For this reason the names of grains often contain a ㅂ (b) medial, as in ㅂ (b) (hulled millet) and ㅂ (b) (hulled rice), which are compounds of ㅂ (b) with ㄱ (g) (millet) and ㄱ (g), the surname of the last dynasty of Korean kings.\ndigraphs are given below. Only ㄹ and ㅂ are used as word finals. The other, ㅁ, is used exclusively for verb roots and is thus always followed by syllables indicating inflectional endings. The ㄹ is often silent in consonant combinations, as shown by the rules of the following chart, and in such cases the vowel is usually slightly prolonged.\n\n| Onmun letter | Position | Rules for Romanization | Examples | Rom. Onmun Meaning |\n|--------------|----------|------------------------|----------|-------------------|\n| ㄹ            | Initial  | (Not used)             |          |                   |\n|              | Medial   | 1. LG between vowels. 2. L before letters of the X series. 3. NG before ㅁ, ㄴ and ㄹ. 4. LR before ㅅ h. 5. K before all other consonants. | kalgi 깔기 rake mokkumhada 모크무하다 to be clean  |  |\n|              | Final    | 1. K (occlusive)       | tak 타 chicken |                   |\n| ㅂ            | Initial  | (Not used)             |          |                   |\n|              | Medial   | 1. LB between vowels. 2. L before letters of the r series. 3. M before ㅁ, ㄴ and ㄹ. 4. LP before ㅅ h. 5. P before all other consonants. | nobi 노비 the width yalp'anhada 알판하다 to be thin naminamul 나미나물 name of flower |  |\n|              | Final    | 1. P (occlusive)       | nilphum 니플럼 grief napek'i 나페키 the sole |  |\n| ㅁ            | Initial  | (Not used)             |          |                   |\n|              | Medial   | 1. LM between vowels. 2. L before ㅁ. 2. M before other consonants | olmagada 올마가다 to move kimgida 김기다 to starve |  |\n|              | Final    | (Not used)             |          |                   |\n\n1 In some dialects the pronunciation of the ㄹ is retained, particularly with ㅂ. For example, tak 타 is pronounced talk.\n\nTHE MEDIAL GLOTTAL STOP (SAI SIOT) AND IRREGULAR ASSIMILATION BETWEEN CONSONANTS\n\nThere are certain exceptions to the rules for the Romanization of the consonants which demand special consideration. The largest group of exceptions are in the Romanizations of ㅂ, ㄱ, ㄷ and ㅈ and ㅂ, ㄱ, ㄷ and ㅈ. Under certain conditions the normal assimilation, which would result in the voicing of those consonants, does not take place, as, for example, in the word hancha 한차, which, according to the rules, should be hanja. In such cases the voice is stopped by glottal occlusion before the pronunciation of the plosive. This irregularity is often found in words in which the semi-independent character of a part of the word has prevented the normal assimilation, or in compound words which may have once been separated by a postposition. There are also other factors which may produce the medial glottal stop.\n\nThere are several ways in Korean orthography to denote the presence of this glottal stop. This is generally accomplished by the use of the letter ㅅ, called the sai siot in this case. Sometimes this is done by attaching the letter ㅅ to a preceding syllable ending in a vowel, as in the spelling twikkan 티간 (outhouse). Sometimes the glottal stop is indicated by changing a plosive letter of the second syllable to its \"forced\" form, as in sotting 손등 (the back of the hand). Perhaps the most satisfactory method of indicating its presence, at least for dictionary purposes, is that used by the Government General dictionary, where the letter ㅅ is inserted independently between syllables when the glottal stop occurs.\n\n1 Some commonly used Chinese characters which are usually preceded by a glottal stop in combination with other characters are 字 (character or word), 病 (disease), 症 (symptom), 約 (contract), 病 (disease) and 法 (law). One cause for the presence of this glottal stop is probably phonetic. That is, the dentals ㅅ, ㄷ and ㅈ and the palatal ch ㅊ are preceded by a glottal stop when following the dental l ㄹ. In native Korean words the glottal stop is commonly found after prefixes which may once have contained a final consonantal element, such as tui 뒤 (rear), u 우 (above) and hu 후 (after). Several studies on the cause of the medial glottal stop have been made by Korean philologists, but as yet the problem has not been fully investigated.\nstop occurs. Thus the word hancha is written 한차. Gale's dictionary makes no attempt to indicate these irregularities in Sino-Korean words, but in native words the spelling has generally been adapted to them.\n\nIt has been necessary to make special rules of Romanization for these irregularities, but at the same time these rules have been formulated with a view to keeping the system as simple as possible. First, when the sa: sit is used in the Government-General dictionary between vowels and plosives, or at any time before the letter s, the plosives or s should be Romanized as their respective \"forced\" consonants, that is, doubled. Second, when the sa: sit occurs between consonants and plosives, the plosives are to be Romanized as if they were initials and the preceding consonants as if they were finals. This irregular spelling is sufficient to indicate the break between the two consonants caused by the glottal stop.\n\nOther exceptions to the rules of Romanization occur with the use of s as a syllabic final in the medial position. As shown above it is often used to indicate a glottal stop, but at other times it is used to represent s or the dental plosive t and its phonetic variations. Of the rules governing its Romanization (see page 39) the last three need further explanation.\n\nRule 5, the Romanization of s as d. When a syllabic final before a vowel, s is Romanized d unless the following vowel is an inflexional ending, in which case it is Romanized\n\n1. The use of the symbol in the Government General dictionary does not always indicate the glottal stop, but often indicates a brief pause between the syllables, or at times represents the various pronunciations of a syllabic final s. Before plosives and s it always indicates the glottal stop; however, before other consonants it should be considered as silent: 1) after vowels, as if it were attached to the preceding syllable, thus 우도 udot (outer clothing) and 우도 gema (ancient sayings); 2) between consonants to be disregarded, as in 칼날 kallat (knife blade) and 칼날 kaagot (black candy).\n\n2. Examples of the medial glottal stop, the variant spelling of the Government General and Gale dictionary, the Unified System's orthography and our Romanization follow.\n\nThis rule is invariable in the Unified System of spelling but may have exceptions in other systems. It may be followed as a general rule. Thus 우도 is udot (outer clothing) but 우도이 (the same word with the nominative postposition added) is udot.\n\nRules 6 and 7, Romanization of s as p and k before s p and s k respectively. These rules only apply to words which cannot be broken up into separate independent words. According to Rule 4, the s is Romanized t before these plosives in all compound words. In non-compounds, however, the s usually indicates a glottal stop before s p and s k, (which transforms them into \"forced\" plosives). Even words formed by adding prefixes should be considered compounds, but there is considerable variation in pronunciation and it is impossible to make a hard and fast rule for the Ro-\n\n| Romanizations | Gov. Gen. | Gale | Unif. Sys. | Meaning |\n|---------------|-----------|------|------------|---------|\n| twokkan       | 톡간      | 톡간 | 톡간        | outhouse |\n| kippal        | 기설      | 기설 | 기설        | flag hunting |\n| tambaetiae    | 담배대    | 담배대 | 담배대     | smoking pipe |\n| utchari       | 우자리    | 우자리 | 우자리     | upper seat |\n| issae         | 이세      | 이세 | 이세       | space between teeth |\n| munkan        | 문간      | 문간 | 문간       | space inside gate |\n| chinjop       | 친접      | 친접 | 친접       | military tactics |\n| sontang       | 손당      | 손당 | 손당       | back of hand |\n| pangchang     | 방창      | 방창 | 방창       | room curtain |\n| hancha        | 한차      | 한차 | 한차       | Chinese characters |\n| sangsori      | 상소리    | 상소리 | 상소리   | low language |\n\n1 Although Gale's dictionary may be used as a guide for the standard pronunciation and Romanization of words containing the s between vowels in the body of the word, it cannot be used for adding postpositions. For example, kkot (flower) followed by the nominative postposition -e is not kkotse but kkotse (spelled kkotse in the Unified System).\n\nThe Government General dictionary has even greater variation in orthography, for example 우도 is the spelling for udo (all sorts).\nromanization of these combinations.\n\nOther irregularities in assimilation between consonants occur but are not generally important. One such is the occasional pronunciation of two medial \\( l \\) \\( n \\) as \\( l \\), when the second is followed by a yotized vowel. An example of this irregularity is \\( mannyo \\) 만년 (ten thousand years) which may be pronounced \\( mallyon \\). Another case is the assimilation of \\( p \\) by a following \\( k \\), through which the labialization of the former is lost and the two together become the \"forced\" plosive \\( kk \\), as in \\( pakkurit \\) 박그릇 (rice bowl), which may be pronounced \\( pakkurit \\). Another example is the change of the dental nasal \\( n \\) to a labial nasal \\( m \\) before labial consonants, as in \\( simbal \\) 신발 (shoes), sometimes \\( simbal \\), and in \\( simmun \\) 신문 (newspaper), sometimes \\( simmun \\).\n\nThere is also the common change of the nasal \\( m \\) and \\( n \\) to the velar nasal \\( ng \\) before the velar plosives, as in the word \\( kanggi \\) 강거 (a cold), usually \\( kanggi \\), and \\( chonggi \\) 덩거 (electricity), usually \\( chonggi \\). In all these cases the unassimilated pronunciations of the consonants are quite understandable and are usually considered more correct. Therefore, in ordinary Romanization, problems of this sort are best ignored.\n\nTHE CONSONANTS IN NEW SPELLING AND THEIR ROMANIZATION\n\nIn new systems of orthography the spelling of the consonants has been considerably revised in order to divide clearly between word roots and inflectional endings or postpositions. For the most part this has resulted in the shifting of letters from their positions as syllabic initials to the bottom of the preceding syllable, as in \\( nae \\) 낮에 (daytime), and \\( ye \\) 없이, formerly \\( ye \\) 없이 (without).\n\n1. One factor which complicates this problem is that, through accidental assimilation, the \\( t \\) of compounds sometimes is assimilated with the following \\( p \\) or \\( k \\) to produce the \"forced\" plosives. For example \\( kakka \\) 가까이 (string to hang hat by) may be pronounced in rapid speech as \\( kakka \\) 가까이. The latter, however, is not considered good pronunciation and should be avoided.\n\nSuch cases afford little difficulty in Romanization.\n\nThe use of \\( h \\) however, as a syllabic final, generally serves another purpose. Before unvoiced plosives \\( i \\) indicates that the plosives are aspirated, as in \\( cho \\) (to be good). In the new spelling the letters \\( c \\) (\\( t \\)), \\( e \\) (\\( t' \\)), \\( x \\) (\\( ch \\)) and \\( x \\) (\\( ch' \\)), when used as syllabic finals, should all be treated like the letter \\( h \\) of standard spelling, except when they occur as medials between vowels or before \\( h \\) (\\( h \\)). Between vowels they may be Romanized as if they were syllabic initials rather than syllabic finals; and before \\( h \\) (\\( h \\)), the \\( e \\) (\\( t' \\)) and \\( x \\) (\\( ch' \\)) are unaffected, but the \\( c \\) (\\( t \\)) and \\( x \\) (\\( ch \\)) are assimilated, usually, with the \\( h \\) and become aspirates. Similarly the aspirate \\( j \\) (\\( k' \\)) and the \"forced\" plosive \\( n \\) (\\( kk \\)) may be treated as \\( j \\) (\\( k \\)), and the aspirate \\( p \\) (\\( p' \\)) as \\( p \\) (\\( p \\)).\n\nNew spellings also use many new consonant digraphs as syllabic finals. Below is a small chart showing those used in the Unified System. The chart includes, 1) rules for Romanization as medials before vowels, 2) as word finals, 3) the \\( ammun \\) letter which may be used as a substitute for the digraph when the problem of determining the assimilation before consonants comes up, and 4) examples of words in which these digraphs are employed.\n\n1. This spelling preserves the verb root within the syllable as well as the independent character of the postposition. Thus the relative participle is written \\( jang \\) and the verbal connective \\( jang \\) instead of \\( jang \\) and \\( jang \\) as formerly. The form \\( jang \\) is pronounced \\( jang \\) (as it was formerly written). Thus in Romanization, a syllabic final \\( j \\) should be represented as follows: \\( h \\) before vowels, \\( s \\) before \\( s \\), aspiration for the unvoiced plosives, and disregarded elsewhere.\n\n2. Examples of these plosives are as follows:\n\n- \\( gide \\) (to believe); \\( gudum \\) 믿음 (belief); \\( jutta \\) 탄다 (to shut); \\( tuch'ta \\) 타다 (to shut up); \\( taldan \\) 탈단 (shut, adj.); \\( pat \\) 발 (field); \\( pach'i \\) 발 (field, nom.); \\( pat'e \\) 발여 (to the field); \\( kkol \\) 꽃 (flower); \\( kkolch'i \\) 꽃여 (flower, nom.); \\( kkolmari \\) 꽃여 (flower fruit); \\( nat \\) 날 (day); \\( raje \\) 낮여 (in the day); \\( matcham \\) 낮여 (day sleep).\n\n3. Examples are: \\( guk \\) 부엌 (kitchen); \\( pakke \\) 밖에 (outside); \\( ap \\) 앞 (the front); \\( ammun \\) 앞문 (front door).\nIV OTHER CONSIDERATIONS\n\nSYLLABLES AND WORDS IN ROMANIZATION\n\nIt has been customary in Romanizing Korean to divide words into syllables by means of hyphens. Ordinarily hyphens are used in Chinese Romanizations and not used in Japanese, thus providing a choice of precedents for the Romanization of Sino-Korean words. Although the Korean language is strongly influenced in vocabulary by the so-called monosyllabic Chinese language, it retains its characteristics as a polysyllabic agglutinative language. Thus in Korean, a given syllable may vary widely in pronunciation according to the nature of the other syllables in the word, whereas in Chinese a syllable is little affected by its neighbors except in tone. A simple example, the word Silla, will help to clarify the point. In Chinese, *hsin* 新 plus *lo* 羅 are pronounced Hsin-lo but in Korea, *sin* 新 plus *na* (na) 那 are pronounced Silla. To hyphenate this name as Sil-la would imply that it is composed of two parts which individually are *sil* and *la*, which is obviously misleading.\n\nThe use of the hyphen may be justified if it is either an aid in identifying the Chinese character or a help in pronunciation. The phonetic individuality of the Chinese character is much less marked in Korean, because of euphonic changes than in Chinese. For example, the character 年 with the *omnun* spelling *n* is pronounced and Romanized *yon*, *nyon*, *lyon* and *yol* depending on the preceding and following syllables; and *chong* might represent the *omnun* spellings 程, 程, 程, 程, each of which denote independent groups of Chinese characters. Obviously, then, the identity of the character behind the Romanization is no clearer with the hyphen than without it if euphonic changes are to be included in the Romanization. From the standpoint of pronunciation the hyphen is generally just as unnecessary and often\n\n1 E.g., *yong'yo* 年表 (chronological chart), *simnyon* 十年 (ten years) *ch'illyon* 七年 (seven years) and *yollae* 年来 (for years).\nactually misleading. To hyphenate Togil 독일 (Germany) as Tog-il would lead to its mispronunciation. One may conclude, therefore, that the use of the hyphen to separate syllables has no justification either as an aid in identifying the Chinese character or as a help in pronunciation, and is consequently best avoided.\n\nWithout doubt it would be convenient to use a hyphen to separate letters which represent two separate sounds but which, when occurring together, might otherwise be thought to represent digraphs, such as oe, ae, ui and ng. However, the common practice in the case of such vowels is to indicate a break in the pronunciation by placing the mark \" over the second vowel. The first two vowel combinations would thus be Romanized oe and ae to distinguish them from the digraphs oe and ae. With ui no distinguishing mark is necessary, since the digraph itself represents a diphthong.\n\nWhen n and g are pronounced separately the symbol ' may be used to separate them. Thus 던과 is to be Romanized chon'gi (electricity) and 정인 as chongin (lover).\n\nIn Romanizing sentences, book titles and the like, the problem of a correct division into words is important. It is difficult to define what is a word in any language, and the problem is particularly complicated in Korean where divisions have been traditionally made by syllables and by clauses. Therefore in Romanizing groups of words a division into units roughly comparable to those in European sentences should be made if the Romanization is to be intelligible to the average Occidental.\n\nOne cannot lay down hard and fast rules for word divisions, and much depends on the special considerations and needs of each individual problem of Romanization. How-\n\n1 These combinations very rarely occur except in sentences when a noun is followed by a postposition as, for example, 태어나서 (in the earth) and Chongnoe 홍로에 (on Bell Street). In other cases also where two independent vowels occur together in Romanization, the same sign may be used over the second vowel if the Romanizer fears that otherwise the word might be mispronounced. For example, 조국 조국 (prison).\n\never, a few recommendations will help bring some uniformity. The problem with native Korean is different from that of Sino-Korean and these two types of words should therefore be considered separately. In native Korean, as in native Japanese, the verb, including what may be called adjectival verbs or verbal adjectives, should be written together as a single unit, no matter what its length or complexity. Thus, verb stems with their auxiliary verbs and inflectional endings are to be Romanized as single words.1 The nouns, likewise, should be written together with their postpositions, including those called case endings, not separately as in Japanese, because phonetically the two are so merged that it would often be difficult and misleading to attempt to divide them. The few remaining native words, such as adjectives, adverbs, and the like, may be Romanized individually as their corresponding form would be in English.\n\nIn the case of Sino-Korean words, as in modern Chinese and Sino-Japanese, there can be no clear criterion for the separation of groups of syllables by words other than the word-feeling of the language itself. The character combinations found in dictionaries serve as good indications of this division; but only through much experience can one master the division of Sino-Korean words, which, after all, is always partially a matter of individual interpretation.\n\nDespite the above recommendations, in all Romanization problems, except the most simple, there will be considerable doubt as to the proper division of a phrase into words. This problem will have to be solved in most cases by the individual. There are many cases where there is a partial division does not seem great enough to justify writing them as separate words. It is for such cases that we have reserved the use of the hyphen; but we believe that on the whole it should be used as sparingly as possible.\n\n1 It is possible in Romanization to divide verbs formed by Sino-Korean nouns plus such verbs as hada 하다 (to do) and ieda 이다 (to become) into their two component parts, but since many of them have become common Korean verbs we prefer generally to Romanize them as single words.\nEuphonic changes often occur in spoken Korean between independent words, as in many European languages. This the Romanization of a sentence word by word does not represent as clearly as it might the pronunciation of the sentence as a whole. Nevertheless, a division of the sentence into word units seems to provide a more intelligible Romanization for the use of Occidentals, than a division by syllables or clauses.\n\nThe following sentence illustrates our suggestions for the division of a sentence by words.\n\n한글 운동은 원산군청에 이르러 문헌 연구를 위한 연구가\n진행되고 있다.\nHan'gŭl undongan Yŏnsan-gunchoe irŭ-ri k'in aegunul tanghayotta\n(The Han'gŭl movement was placed in an extremely critical position during the reign of the ruler Yŏnsan.)\n\nTHE ROMANIZATION OF PROPER NAMES AND TITLES\n\nProper names like words should not be divided into syllables, as has often been done in the past. For example, the geographic term 光州 should be Romanized as Kwangju. Irregularities occurring in proper names such as in P'yŏngyang 平壤 which is colloquially pronounced P'iyang or P'a-yang, should usually be ignored in Romanizations intended for scholarly use.\n\nPersonal names demand special consideration. As in China, the great majority of surnames are monosyllables representing a single character, while a few are two character names. The given name, which follows the surname, usually has two characters but sometimes only one. In both two character surnames and two character given names the general rules of euphonic change should be observed, and the two syllables should be written together.\n\nThe problem of the euphonic changes between a surname and given name or title is very difficult. A man known as Paek Paksa 박박사 (Dr. Paek) might prove to have the full name of Paeng Nakchun 백박준 because of the assimilation of the final k of his surname and the initial n of his given name. The use in Romanization of both Dr. Paek and Paeng Nakchun for the same person would result in considerable confusion. Therefore it seems best for Romanizations purposes to disregard euphonic changes between surnames and given names or titles, so that the above name should be Romanized Paek Nakchun.\n\nFor ordinary social use our Romanization often may not prove suitable for personal names. Even in scholarly work there are also a few instances of rather well established Romanizations for proper names which might be left unchanged, just as the names of some of the provinces of China still have traditional Romanizations not in accord with the Wade-Giles system. There is, for example, Seoul, which some may prefer to the Soul of our system. Another very important example is 李, the surname of the kings of the last Korean dynasty and still a very common Korean surname. Actually it is pronounced in the standard dialect and should be Romanized Li, but some may prefer to retain the older Romanization, Yi, because that is already the familiar form. In any case the other Romanizations of 李, Ri and Li, should not be used.\n\nTHE SIMPLE USE OF THIS SYSTEM OF ROMANIZATION\n\nThis Romanization system, with but a very few exceptions, may be applied by the use of two simple charts, the Syllabic Table and the Chart of Euphonic Changes of the Consonants which are to be found at the end of this article.\n\nIn using the Syllabic Table, the corresponding \"forced\" plosive letters, ḷ k', ḷ p', ḷ t' and ḷ ch', and the aspirated forms, ḷ k', ḷ p', ḷ t' and ḷ ch', may be substituted when called for in the columns of the four unvoiced plosive letters, ḷ k, ḷ p, ḷ t and ḷ ch. Also ḷ ss may be substituted for s and sh in the ḷ column. Special note should be taken of the double Romanizations given in the ḷ and ḷ\ncolumns. The first in each case should be used for the first syllable of a word and the second for all other syllables. The Romanizations of the consonant letters as finals are included at the bottom of each column.\n\nFor those inexperienced in Romanizing Korean we suggest the following procedure:\n\n1. Write the word in 한문, transcribing it from the Chinese characters if it is a Sino-Korean word.\n\nExamples: Sino-Korean word, \"museum\" 博物館 equals 박물관. Native word, \"bowl\" is 사발.\n\n2. Romanize each syllable separately according to the Syllabic Table, adding the syllabic consonantal endings as given.\n\nExamples: 박 equals pa plus k and is therefore pak. This process will give pak mul kwon and so pal.\n\n3. Correct the medial consonants according to the Chart of Euphonic Changes of the Consonants and then write the syllables together.\n\nExamples: pak plus mul gives a medial of k plus m. In the horizontal K column, where it intersects the vertical M column, will be found the correction ngm. Therefore pak mul becomes pangmul. This process will give the words correctly Romanized as pangmidgwan and sabal.\n\nThis very simple process will prove adequate for almost all Romanization problems, but occasionally there are irregularities which do not come within the scope of these two charts, and for these reference must be made to other sections of this paper. For example, the variation in the value of ㅅ as a syllabic final in the medial position is discussed on pages 44 to 46. The Romanization of the three consonant digraphs, ㄹ, ㅂ and ㅍ, is discussed at the end of the section on \"Rules for the Romanization of the Hanmun Consonant Letters.\" Other irregularities are discussed in \"Irregularities in the Pronunciation of the Vowels,\" \"The Medial Glottal Stop (Sai Siot) and Irregular Assimilation between Consonants\" and \"The Romanization of Consonants in New Spelling.\"\n### Chart of Euphonic Changes of the Consonants\n\n(Syllabic finals are listed vertically and initials horizontally.)\n\n| Vowels | CH | CH' | H | K | K' | M | N | P | P' | R | S | T | T' |\n|--------|----|-----|---|---|----|---|---|---|----|---|---|---|---|\n|        | j  | ch' | h  | g  | k' | m  | n  | b  | p' | r  | s  | d  | t' |\n|        |    | ich |    |    | kk |    |    |    | pp |    | ss |    | tt |\n| K(ŋ)   | g  | kch | lch' | lch | kk | ngm | ngn | kp | kp' | ngn | ks | kss | kt' | ktt |\n| L(ɛ)   | r  | lch | lch' | lch | lk' | lm | l | lb | lp' | ll | ls | lss | lt' | ltt |\n| M(ɔ)   | m  | mj | rch' | rch | mb | mg | mk | mkk | mm | mm | mb | mp' | mpp | mn | mss | md | mt' | mtt |\n| N(ʌ)   | n  | nj | rch' | rch | nh | ng | nk' | nkk | nm | nn | nb | np' | npp | ll | ns | nd | nt' | ntt |\n| NG(ɔ)  | ng | ngj | ngch' | ngch | ngh | ngg | ngk' | ngk | ngn | ngn | ngb | ngp' | ngpp | ngs | ngss | ngd | ngt' | ngtt |\n| P(ɛ)   | b  | pch | pch' | pch | pk | pk | pk' | pkk | mm | mm | pp | pp' | pp | ps | pss | pt | pt' | ptt |\n| T(ʌ)   | d  | teh | teh' | teh | tk' | ttk | nm | nn | pp | lp' | top | na | ss | tt | tt |\n\nThe letters of this chart are arranged in the order of the Latin alphabet for the convenience of users. Combinations which are italicized may be subject to exceptions. Irregularities are also likely to occur in all combinations in which the unvoiced plosives, k, p, t and ch, become voiced plosives, g, b, d and j. These exceptions are discussed in the section entitled \"The Medial Glottal Stop (Sai Sèo) and Irregular Assimilation between Consonants.\"\n## SYLLABIC TABLE\n\n| Consonants | 1st | 2nd |\n|------------|-----|-----|\n| Vowels     |     |     |\n\n| ㅏ | a   | ka 가 | pa 바 | ta 다 | cha 차 | na 나 | na 라 | ra 마 | sa 사 | ha 하 |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| ㅑ | ya 야 | kya 가 | pya 바 | cha 차 | ya 나 | nya 냐 | ya 라 | rya 마 | mya 마 | sa 사 | hya 하 |\n| ㅓ | ö ㅓ | kö ㅓ | pö 버 | tö 터 | chö 저 | nö 녀 | nó 놈 | nö 러 | nö 머 | sö 서 | hõ 하 |\n| ㅕ | yö ㅕ | kyö ㅕ | pyö 베 | chö 더 | yö 녀 | nyö 녀 | yö 러 | ryö 머 | myö 머 | sõ 서 | hyõ 하 |\n| ㅗ | o 오 | ko 고 | po 보 | to 도 | cho 조 | no 노 | no 로 | ro 모 | so 소 | ho 호 |\n| ㅛ | yo 요 | kyo 요 | pyo 요 | cho 요 | yo 요 | nyo 요 | yo 료 | ryo 모 | myo 모 | so 소 | hyo 호 |\n| ㅜ | u 우 | ku 구 | pu 부 | tu 두 | chu 쥐 | nu 누 | nu 루 | ryu 무 | su 수 | hu 후 |\n| ㅠ | yu 유 | kyu 유 | pyu 유 | chu 쥐 | yu 유 | nyu 유 | ryu 무 | myu 무 | su 수 | hyu 후 |\n| ㅡ | ü ㅡ | kũ ㅡ | pu 부 | tũ 드 | ctũ 조 | nũ 느 | nũ 루 | ru 무 | sũ 스 | hũ 후 |\n| ㅣ | i 이 | ki 기 | pi 피 | chi 치 | i 니 | ni 리 | ri 미 | si 시 | hi 히 |\n| ㆍ | a ㆍ | ka ㆍ | pa ㆍ | ta ㆍ | cha 차 | na 나 | na 라 | ma 마 | sa 사 | ha 하 |\n| ㅐ | ae 에 | kae 에 | pae 에 | tae 에 | chae 에 | nae 네 | nae 데 | rae 래 | mae 마 | sae 사 | hae 해 |\n| ㅔ | e 에 | ke 게 | pe 페 | te 테 | che 체 | ne 네 | ne 데 | re 래 | me 메 | se 세 | he 헤 |\n| ㅖ | ye 에 | kye 에 | pye 에 | che 체 | che 체 | ye 네 | nye 냐 | ye 래 | rye 래 | mye 메 | se 세 | hye 헤 |\n| ㅚ | oe 왜 | koe 왜 | poe 왜 | toe 왜 | choe 왜 | noe 노 | noe 데 | roe 래 | moe 모 | soe 사 | hoe 헤 |\n| ㅟ | wi 위 | kwi 위 | pi 피 | ti 디 | chi 치 | ni 니 | ni 리 | ri 미 | si 시 | hui 희 |\n| ㅞ | we 웨 | kwe 웨 | pwe 웨 | twe 웨 | chwe 웨 | nwe 네 | nwe 데 | rwe 래 | mwe 마 | swe 사 | hwe 헤 |\n| ㅚ | we 웨 | kwe 웨 | pwe 웨 | twe 웨 | chwe 웨 | nwe 네 | nwe 데 | rwe 래 | mwe 마 | swe 사 | hwe 헤 |\n\n### Syllabic finals\n\n| ng ㅇ | k ㄱ | p ㅂ | [t] | [t] | n ㄴ | l ㄹ | m ㅁ | t ㅌ | [h] |\n| Okkun Letter | PHONETIC TRANS'N | Hag'r Trans'n | Ogura Literal Trans'n | McCune-Reischauer Romanizat'n | OTHER ROMANIZATIONS |\n|--------------|------------------|---------------|------------------------|-------------------------------|---------------------|\n|              | Ogura            | Jung          |                        |                               | Eckardt            |\n|              |                  |               |                        |                               | French             |\n|              |                  |               |                        |                               | Gale               |\n|              |                  |               |                        |                               | Jung               |\n| ㅏ            | a                | a, a:         | a                      | a                             | a                  |\n| ㅑ            | ya               | ya, a         | ya                     | ya                            | ya                 |\n| ㅓ            | e, ee            | e, e:         | e                      | e                             | ü, ö               |\n| ㅕ            | ye               | ye            | yę                     | yę                            | yę                 |\n| ㅗ            | o                | o, o:         | o                      | o                             | o                  |\n| ㅛ            | yo               | yo            | yo                     | yo                            | yo                 |\n| ㅜ            | u                | u, u:         | u                      | u                             | ou                 |\n| ㅠ            | yu               | yu            | yu                     | yu                            | you                |\n| ㅡ            | ü                | ü, ü:         | ü                      | ü                             | eu                 |\n| ㅣ            | i                | i, i:         | i                      | i                             | i                  |\n| ㅐ            | ae               | ae            | ae                     | ae                            | [ai]               |\n| ㅔ            | ye               | ye            | ye                     | ye                            | [ye]               |\n| ㅚ            | oe               | oe            | oe                     | oe                            | [oe]               |\n| ㅟ            | wi               | wi            | wi                     | wi                            | [wi]               |\n| ㅝ            | wo               | wo            | wo                     | wo                            | [wo]               |\n| ㅞ            | we               | we            | we                     | we                            | [we]               |\n\nNote: The table provides phonetic transcriptions in various systems such as Ogura, Jung, Hag'r, McCune-Reischauer Romanization, and other romanizations like Eckardt, French, Gale, and Jung.\n| Consonant Chart |\n|-----------------|\n| **Č** | k | k | k, g, j, ʔk | k | K | K, G, NG | K | k, g, h | k, g, k, ng | k | g |\n| L | n | n, nd, O | n, n³, l | n | N, O | N, L | N | n, l, o | n | n, l | n | n |\n| C | t | t, ts, tz | t, t, d, ts, dz | t | T, CH | T, D, CH, J | t | t, d (č) | t, d | t, d | t | d |\n| Z | r | (r), n, O | r, l | l | N, O | R, L, N | L | r, l, n, o | r, l | r, l | r, l | r, l |\n| M | m | m, mb | m | m | M | M | M | m | m | m | m | m |\n| H | p | p | p, ʔp, b, m | p | P | P, B, M | P | p, b, m | p, b | p, m | p | b |\n| S | s | s | s, ʔs, v, d, n | t | S, SH | T, N, P, K | T | s, š, t, n | s, t | s, d | s, t | s, d |\n| O | ň | ň | ň | ň | ň | ň, NG | NG | ň | ng | ng | ng | ng |\n| Č | č | č | č | č | č | č, dž | č, dž | č, dž | č, dž | č, dž | č, dž | z, d |\n| Č' | č' | č' | č' | č' | č' | č' | č' | č' | č' | č' | č' | č' |\n| Č | k' | k' | k' | k' | k' | k' | k' | k' | k' | k' | kh | kh | k, g |\n| Č | t' | t', ts', ts' | t', ts', ts' | t' | T', CH' | T', CH' | t' | t' (č') | t' | th, tch | ht | t, d |\n| Č | p' | p' | p' | p' | P | P | P | p' | p' | ph | hp | p, b |\n| Č | x | x, ġ | x, ġ | x | H | H | H | ġ | ġ | ġ | ġ | ġ |\n| Č | sk | ʔg | ʔk | KK | KK | k | kk | g | g | kk | gg, g |\n| Č | st | ʔd, ʔdz, ʔdz | ʔt, ʔts | TT | TT | t | tt | d | d | tt | dd, d |\n| Č | sp | ʔb | ʔp | PP | PP | p | pp | b | b | pp | bb, b |\n| Č | ss | ʔs | ʔs | SS | SS | t | ss | s | ss | ss | ss, d |\n| Č | sc | ʔdz, ʔdz | ʔts, ʔts | TCH | TCH | t | tč | j, ň | dž | ttj | zz, d |\n\n*o signifies that the consonant is unpronounced, thus omitted in Romanization.*\n*Underlined letters in the McCune-Reischauer \"final\" column are for Romanizations in the new spelling systems.*", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/ras-1939.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 41, "total-input-tokens": 71648, "total-output-tokens": 32249, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 350, 2], [350, 504, 3], [504, 4582, 4], [4582, 6914, 5], [6914, 11277, 6], [11277, 14913, 7], [14913, 20372, 8], [20372, 23717, 9], [23717, 25586, 10], [25586, 26381, 11], [26381, 27528, 12], [27528, 31680, 13], [31680, 36286, 14], [36286, 40960, 15], [40960, 44461, 16], [44461, 47848, 17], [47848, 51414, 18], [51414, 53398, 19], [53398, 56234, 20], [56234, 58505, 21], [58505, 63139, 22], [63139, 68089, 23], [68089, 72758, 24], [72758, 76247, 25], [76247, 81190, 26], [81190, 84143, 27], [84143, 87126, 28], [87126, 91051, 29], [91051, 95155, 30], [95155, 99466, 31], [99466, 104189, 32], [104189, 106180, 33], [106180, 110477, 34], [110477, 114135, 35], [114135, 116005, 36], [116005, 116005, 37], [116005, 117600, 38], [117600, 119375, 39], [119375, 122427, 40], [122427, 124125, 41]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, true, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, true, true, true, true, true], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]