[{"id": "8da2e89ec1eaa7670af019a59757dfb63649d66a", "text": "CORRESPONDENCE\n\nBETWEEN THE INDIA OFFICE AND THE ROYAL ASIATIC SOCIETY\n\nON THE SUBJECT OF\n\nTHE INDIAN TEXTS AND RECORDS SERIES\n\nTOGETHER WITH THE Minutes of Council on the same Subject\n\nAND Certain Official Letters (printed by permission)\n\nLONDON\nIndian Texts and Records Series\n\nOFFICIAL CORRESPONDENCE AND MINUTES OF COUNCIL\n\nI.\n\nMay 8, 1900. Minute of Council, No. 7.\n\nA draft letter to the Government of India on the establishment of a series of materials for the History of India was considered and approved, subject to a few alterations. Sir Charles Lyall consented to settle the final draft.\n\nII.\n\n(1). June 12, 1900. Minute of Council, No. 7.\n\nThe Letter to the Government of India on a proposed Indian Historical Series was read, as settled by Sir Charles Lyall, and approved. The Secretary was requested to add the details of the estimated cost, viz., £240 a volume, before sending the letter off.\n\n(2).\n\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET,\nLONDON, W.,\n12th June, 1900.\n\nSir,\n\nI am desired by the President and Council of this Society to ask you to be kind enough to lay the following considerations before His Excellency the Viceroy.\n\nThe Society venture to ask the Government of India to take into consideration the desirability of publishing a series of historical volumes corresponding to the Rolls Series and\nthe publications of the Historical Manuscripts Commission, published by the English Government.\n\nIt is perhaps unnecessary to point out how great have been the results of the publication long ago of two such volumes. The \"Memoires sur les Contrées Occidentales,\" translated by Julien from the Chinese of Hiouen Thsang, and published by the French Government in 1857, have been the foundation of almost all that has been written since on the Archaeology of India. And the publication, in 1837, by the Government of Ceylon, of the \"Great Chronicle\" of that island has afforded evidence on which many of the main conclusions as to the early history of India depend.\n\nThe cost of such a series as is proposed would be very small. It would be desirable only to undertake such works as are both of real importance, and also of such a character that their publication would not pay commercially—conditions also observed in the case of the Rolls Series. The Society could undertake to produce two volumes annually at the cost of £240 per volume (see detailed estimate annexed), and any sums received by the sale of them could be applied towards the cost of future volumes.\n\nThe volumes would consist partly of texts, partly of translations, such as the two above mentioned; partly of indices or dictionaries (similar in method to, but smaller in scale than, Smith's well-known dictionaries) of proper names, personal or geographical, of importance for the history of India; and partly of monographs summarizing the historical data scattered through the numerous Oriental texts now accessible to scholars.\n\nThe documents in question would have little or no literary merit. They would be materials out of which the history of the development of the social conditions, the industries, and the political relations of the peoples of India could be reconstructed. The texts to be translated or explored would not be histories in our modern sense, even when they purport to be chronicles. In both these respects they would be like the historical documents published in the Rolls Series.\n\nThe series might be called the \"Indian Historical Series.\" To be a success it would have to be placed under skilled general editorship, and each volume should be entrusted to a scholar so trained in the methods of historical research as to be able, in introduction, notes, and indices, to gather together or elucidate all the historical information obtainable from the document he edits or explores.\n\nFor these reasons it would be desirable that, for the present at least, the series should be supervised here; and the authors\nof the first volume to appear should be European scholars of the first rank. But the editor might be instructed to make use also of native Indian scholarship whenever it should be possible to do so.\n\nNo money would be necessary till January, 1902, as at least eighteen months must elapse, after the approval of the scheme, before any payments would be required.\n\nThe above estimate of cost is inclusive—that is, it covers the cost of editorship, authorship, printing, binding, insurance, and other miscellaneous charges—and with the gradual increase of the number of volumes on sale the series would in course of time, it may be hoped, become self-supporting.\n\nThe publication of such a series is essential to the future progress of the study of Indian History and Archaeology. And considering the smallness of the amount required and the number of precedents that might be quoted in its favour, this Society venture to hope that the proposed scheme will meet with the approval and support of the Government of India.\n\n**Estimate Referred To.**\n\n*Printing.*—It would be better to secure an inclusive contract price for composition, press work, and paper. The Society's considerable experience shows that such a contract could be secured for £3 for 500 copies of a sheet of sixteen pages, octavo, and of thirty-eight lines to a page. There would be some extras, the most important being corrections. For corrections 10s. a sheet might be allowed, and for all the other extras 10s. a sheet. That makes an inclusive charge of £4 a sheet, or calculating twenty-five sheets to a volume, £100 a volume.\n\n*Authorship.*—Authors might be paid at the rate of 64s. for each such sheet of sixteen pages octavo, the payment to be due on publication of the work. It would be reasonable to make a stipulation that the author should be responsible for author's corrections in proof exceeding 10s. a sheet. Each volume would cost under this head £80.\n\n*Editorship.*—The General Editor of the Series might be paid at the rate of 24s. for each such sheet, making for the volume £30.\n\n*Binding.*—A substantial binding in buckram or cloth could be obtained for about eightpence a copy—say, about £16 for the whole edition of 500 copies. It would not, however, be necessary to bind at once more copies than would be likely to be required. This could be done for £8, and subsequent expenditure under this head could be met from the sales.\nMiscellaneous.—Warehousing and insurance of the stock, carriage and postage of proofs, letters and books, office and clerical expenses, advertisements and contingent expenses. These are estimated to cost about £22 for the first year, and could be met afterwards from the sales.\n\nIII.\n\nFrom J. P. Hewett, Esq., C.S.I., C.I.E., Secretary to the Government of India, Home Department; to the Secretary, Royal Asiatic Society, 22, Albemarle Street, London, W.\n\n11th September, 1900.\n\nI am directed to acknowledge the receipt of your letter dated the 12th June, 1900, in which, on behalf of the President and Council of the Royal Asiatic Society, you request the Government of India to take into consideration the desirability of publishing a series of historical volumes corresponding to the Rolls Series and publications of the Historical Manuscripts Commission brought out by the English Government.\n\n2. In reply, I am to say that the Governor-General in Council entirely agrees with the Royal Asiatic Society in thinking that a series of historical volumes regarding India corresponding to the Rolls Series might be published with advantage, and he is indebted to the President and Council of the Asiatic Society for their useful and timely suggestion. His Excellency in Council is endeavouring at the present time to obtain from England the services of a competent librarian with literary attainments and an acquaintance with Oriental literature and history for the new Public Imperial Library, which is to be established at Calcutta. This gentleman will be able to consult not only the volumes in the Imperial Library, but also the records of the different departments of the Government of India. The Governor-General in Council would prefer, before considering the detailed arrangements for the publication of a series of volumes such as is contemplated by the Royal Asiatic Society, to consult the Librarian, who will, it is hoped, reach Calcutta before the end of the current year. I am directed to say that the Government of India will send you a further communication regarding the proposal made in your letter, and, in doing so, to assure you that it will receive their careful and attentive consideration.\nIV.\n\n(1). To His Excellency the Right Honourable the Governor-General of India in Council.\n\nINDIA OFFICE,\nLONDON,\n5th December, 1902.\nNo. 37 of 1902.\n\nPROPOSED INDIAN HISTORICAL SERIES.\n\nMy Lord,\n\nWith reference to the letter of your Excellency’s Government in the Finance and Commerce Department, No. 191, dated 3rd July, 1902, regarding the publication by the Royal Asiatic Society, of London, of an “Indian Texts Series” and an “Indian Records Series,” I forward herewith, for your information and for such action as you may deem advisable, copy* of the papers noted in the margin. Subject to your approval of the proposals therein made by the Society, it is presumed that as regards the choice of authors for the various volumes to be included in the “Texts Series,” full discretion will be left to the Editor selected by the Royal Asiatic Society for that purpose. As regards the “Records Series,” however, it is understood that the selection of works and of authors to prepare them will be in the hands of your Excellency’s Government in the Home Department for the purpose of carrying out the details.\n\nI have the honour to be,\n\nMy Lord,\nYour Lordship’s most obedient humble Servant,\n(Signed) GEORGE HAMILTON.\n\n(2).\n\nINDIA OFFICE,\nWHITEHALL,\nLONDON, S.W.,\n4th November, 1902.\n\nSir,\n\nI am directed by the Secretary of State for India in Council to forward herewith for submission to the Royal Asiatic Society copy of a letter from the Government of India in the Department of Finance and Commerce, No. 191, dated\n\n* To Royal Asiatic Society, dated 4th November, 1902. From ditto, dated 12th November, 1902. To ditto, dated 3rd December, 1902.\n3rd July, 1902, and to inform you that the proposals therein contained in connection with the publication of a series of Indian Texts and Historical Volumes have been sanctioned.\n\nThe precise conditions of the grants to be made to the Royal Asiatic Society are contained in the accompanying memorandum, and I shall be glad to learn that the Council are prepared to accept them.\n\nI am, sir,\n\nYour obedient servant,\n\nA. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\n(3). To the Right Honourable Lord George Francis Hamilton, His Majesty's Secretary of State for India.\n\nSimla,\n3rd July, 1902.\nNo. 191 of 1902.\n\nMy Lord,\n\nWe have the honour to forward, for your lordship's information, a copy of the correspondence, noted in the annexed list, on the subject of a suggestion made by the Royal Asiatic Society, London, regarding the publication by the Indian Government of a series of historical volumes corresponding to the Rolls Series and the publications of the Historical Manuscripts Commission.\n\n2. The Society suggest that the volumes should consist partly of texts and partly of translations, and should also include indices or dictionaries of proper names, personal or geographical, of importance for the history of India, and monographs summarizing the historical data scattered through the numerous Oriental texts which are accessible to scholars. The Society are of opinion that, while these documents would have little or no literary merit, they would constitute materials out of which the history of the development of the social conditions, the industries, and the political relations of the peoples of India, could be reconstructed. They suggest that the series might be called the Indian Historical Series; that each volume should be entrusted to a scholar trained in the methods of historical research; that the series should be placed under skilled general editorship in England; and that the editor might be instructed to make use of native Indian scholarship whenever it is possible to do\nso. The Society offer us their assistance in the matter of publication, and undertake to produce two volumes annually at a cost of £240 per volume.\n\n3. The proposals of the Society meet with our cordial support, and we would make the following suggestions in connection therewith for your lordship's approval. We would divide the series into two parts—the one to be called the \"Indian Records Series\" and the other the \"Indian Texts Series.\" We propose that the Indian Records Series should consist of selections, notes, or compilations from the records of the Indian Governments or of the India Office, supplemented and elucidated where necessary by local inquiry. This series would correspond generally with the English Historical Manuscripts Series, except that the latter deals with private, whereas the former will deal with public records. The greater part of this work would be done in India. But lacunæ in our records might often be supplied from the India Office Records, and we are of opinion that the general editing of this portion of the work should be done in England.\n\n4. The Indian Texts Series should consist of annotated editions of or translations or abstracts of or compilations from the works of Indian writers, such as Blochmann's \"Ain-i-Akbari,\" Stein's \"Rāja Tarangini,\" Julien's \"Hwen Tsang,\" or Beale's \"Buddhist Pilgrims.\" As regards less important authors, little more than brief tables of contents would be needed. At the same time, as suggested by the Royal Asiatic Society, indices, dictionaries, and monographs should not be neglected. The former should aim, not so much at complete information as at complete bibliography. The salient facts being given and sufficient information to identify the man or place, mere references would be sufficient to sources of information which are readily accessible to scholars, though information from sources more difficult of access might be abstracted with some fulness. This series would correspond generally with the Rolls Series, except that it would deal with times prior to British rule. We think that it should be not only edited, but also for the most part written at home, although we would emphasize the suggestion of the Royal Asiatic Society that the editor should be instructed to make use of Indian scholarship (European or native) to the fullest extent. The management of the series should, however, be left to the Royal Asiatic Society.\n\n5. The two series would thus be quite distinct as regards authorship and editing. We would propose that two volumes a year in each series should be published, and that the Royal\nAsiatic Society should be entrusted with the publication of both series if, after a scrutiny of their estimate, which we have no means of making, your lordship considers that their terms are reasonable. With this object we would make a grant of Rs. 15,000 a year for the next five years to meet the expenditure involved in the proposals, which we trust will meet with your lordship's approval. In that event, we would ask your lordship to inform the Royal Asiatic Society of what has been decided upon. We propose to retain in our own hands the decision as to what books should be published in either series, and in what order.\n\nWe have, etc.,\n(Signed) Curzon.\n\nMEMORANDUM OF TERMS.\n\n1. The Royal Asiatic Society to arrange for the publication in each year of two volumes of the \"Texts\" Series of an average of 400 pages, with maps and illustrations (if necessary), at a cost of £250 each, Government having no further financial responsibility beyond payment of that amount.\n\n2. The Royal Asiatic Society to arrange also for the publication of two similar volumes of the \"Records\" Series in each year for the same sum, on the understanding that the expenses for authorship (which would be in the hands of either the Government of India or the India Office) will not exceed £80.\n\n3. The Royal Asiatic Society to nominate an Editor for each series for the approval of the Authorities.\n\n4. The Royal Asiatic Society to submit to the India Office for sanction a list of texts, etc., to be taken in hand, and to be prepared to add thereto any other texts the Government might desire to have edited; the Society, further to, publish any \"historical\" works which the authorities might select from the Government archives.\n\n5. The Royal Asiatic Society to present 100 copies to Government free of charge.\n\n6. The price of each volume not to exceed 10s.\n\n7. An account of sales to be kept, and the nett amount received to accumulate till it reaches £250, when an additional volume is to be published with the proceeds free of charge as against Government.\n\n8. Payment to be made as each volume is published, and the five years to commence from the date of the first payment.\n9. Reasonable notice to be given by Government as to their intention to continue, or otherwise, these payments after the expiration of the term of five years, when the conditions would be open to revision.\n\n(4).* November 11, 1902. Minute of Council, No. 11.\n\nOn a letter from the India Office, in reply to the letter dated the 12th of June, 1900, addressed to the Government of India, a draft reply was read and adopted, accepting the proposed terms for the publication of an Indian Historical Series, and making suggestions as to works it would be desirable to include in the series.\n\n(5).\n\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET,\n12th November, 1902.\n\nSir,\n\n1. The Council of the Royal Asiatic Society have received with the greatest satisfaction your letter of the 5th November, 1902, conveying a generous offer to grant to this Society for a period of five years an annual sum of £1,000, to be expended in the production of two volumes of a Texts Series and a like number of a Records Series. I am directed by the President and Council to express their appreciation of the liberality of the Government in a direction which will, it is hoped and thought, materially tend to advance Oriental scholarship and learning, and thereby to draw closer together His Majesty's subjects in the Eastern and Western hemispheres.\n\n2. The Council gladly accept the conditions specified in the paper which accompanied your letter under reply. Among the conditions thus accepted, the first stipulates that the Government is to have no further responsibility beyond the payment of £250 per volume, and that each volume is to have an average length of 400 pages. It will be the duty of the Editor to see that this limit of size is, as far as possible, adhered to. But it is evidently foreseen, in the wording of the condition, that it may be necessary occasionally to make one volume a little larger and another a little smaller than this average limit, so that one will cost a little more, and the other a little less than the £250. The Council presumes, therefore, that the stipulation contemplates the application of any sum saved on a shorter volume being applied to make good the deficiency on a larger volume. Understanding the condition in this sense, the Council is\n\n* This No. (4) was, of course, not among the enclosures of IV. (1).\nwilling to undertake that the contemplated series of publications shall not cost the Government more than the actual sum mentioned—namely, £250 a volume.\n\n3. It is also hoped, in the event of its being found impossible to produce a volume, prepared under the sanction of the Secretary of State, within the period defined, that the sum of £250 specified to defray its cost will become payable on publication at a later date.\n\n4. The object of the Council in making these observations is to draw attention to the fact that while on an average it will be possible to produce the volumes of the size mentioned, and to produce them annually, yet it will not be practicable to adhere closely, in each case, to a particular size or date.\n\n5. Perhaps to avoid possible misconception the Council may be permitted to assume that the closing words of Clause 2 of the Memorandum of Terms are intended to be read as \"will not exceed £80 for each volume.\"\n\n6. The Council desire to nominate for your approval Professor Rhys Davids as Editor of the Texts Series. With reference to the Record Series, as the works will, it is understood, be handed over to the Society by Government ready for press, it will apparently suffice if the Council entrust to Miss Hughes, the Assistant Secretary of the Society, the clerical duties (including revision of the press when necessary) which will devolve upon them. In cases of doubt and difficulty Mr. A. N. Wollaston, a Member of the Council of the Royal Asiatic Society, has kindly consented to assist in any way which may appear desirable.\n\n7. With reference to the list of texts, translations, indices, etc., to be submitted to the India Office in accordance with Clause 4 for sanction, the Council find it difficult to select, among the many volumes that are of pressing necessity, those that are most pressing. But it will venture to submit that it will be advisable, so far as possible, to adhere in the publication of the Series to the chronological order, not only on account of the intrinsic interest of the older periods, but because the later periods can only be properly understood in the light of the earlier. In their following suggestions the chronological order is, for the sake of clearness, adhered to.\n\n8. In the oldest period, the Vedic, the texts have been nearly all published, and many have been translated. But the want of any proper index, either of names or subjects, is a great obstacle to the use of the accessible materials. The preparation of such indices is the most pressing want for this period.\n\n9. A working edition of the Rig Veda is also much wanted,\nAufrecht's edition is out of print; the author does not intend to republish it. Since his and Professor Max Müller's editions appeared a very large number of separate articles, monographs, notices, etc., have been printed, in which isolated hymns or verses are discussed. Professor Weber, of Berlin, in whose \"Indische Studien\" Aufrecht's edition had appeared, expressed the hope that an edition containing notes referring to all these helps to the study of the Veda would be one of the first to be undertaken whenever an \"Indian Historical Series\" should be established. Professor Macdonell, of Oxford, shares this view. And the Council recommend that this work should be put in hand, but that the historical indices mentioned in the last paragraph should be published first.\n\n10. For the period from 600 B.C. to the time of Aśoka, which may fairly be called the Buddhist period, a critical edition of the texts of the early Upanishads with translations and complete historical indices is much required. This should be included, if a competent scholar can be found to undertake it in the time, in the list of books to be first undertaken. The priestly text-books of this period have been fully represented in previous publications, and the texts of the Pali books have been published, and in part translated. But a classified historical index to the latter is very much needed. The Jain texts, of great importance for this period, have not yet been critically edited. One at least of the first volumes should be devoted to supplying this deficiency.\n\n11. For the period subsequent to Aśoka a pressing want is an edition, in one or two volumes, of the texts of all the inscriptions from, say, 230 B.C. to 130 A.D., with historical introductions and a complete *index verborum*, such as M. Senart has already given us for the Aśoka inscriptions themselves. Much material relating to this period is now buried in Chinese and Tibetan books, most of them translations from Indian books. If competent scholars can be induced to undertake the task, it would be very desirable to have a volume of translated extracts from each of these languages, giving for each extract the name and date of the work quoted and (if it be a translation) of the Indian book.\n\n12. For the following period the inscriptions are the most important evidence, and the following three volumes are suggested:\n\n(a) The Inscriptions of the Gupta period, translated (so far as is deemed desirable), with historical introduction and indices, not only of names, but also historical subjects, such\nas social conditions, trade, agriculture, taxation, arts and industries, etc.\n\n(b) A similar volume for later Inscriptions of Northern India.\n\n(c) A similar volume for later Inscriptions of Southern India.\n\n13. Buddhist Sanskrit Texts composed in this period are still extant. The Śikṣā Samuccaya would be a good selection for a start in making the historical contents of these texts known. As the text has been published at the cost of the Russian Government, a translation, with indices to the names mentioned, and to the references occurring to social and economic conditions, etc., would be sufficient.\n\n14. For the Brahmin literature which can be dated with any certainty within this period the greatest desideratum is a critical edition of the Mahābhārata. This would, however, be a task beyond the limits, either of time or money, fixed for the present scheme, and an index of the names in the existing uncritical editions is being elsewhere published. It would not, therefore, be desirable to attempt to deal, under this scheme, with the Mahābhārata.\n\n15. A place might be reserved in the series for a volume in which the historical references scattered through the most important of the Purāṇas should be collected and indexed. But the other works suggested above are more urgent.\n\n16. For the Muhammadan period the Council would suggest the publication either of an historical index to the Ta‘rīkh ul Utbi, a monograph on Sultan Mahmud of Ghazni (to include the data given in the commentary of Menini so far as they deal with historical persons and places), or of the Ta‘rīkh-i Muḥammadi (Muhammadan dates), by Mirza Muḥammad Ḥārīsī.\n\n17. Finally, it would be very desirable to include, among the early issues, one or perhaps two volumes of historical maps of India, each map to be prepared by a scholar who is an authority for the particular period illustrated by the map, and to be accompanied by a short explanatory introduction, and the whole to be accompanied by suitable indices.\n\n18. Many other works are urgently required, but the volumes suggested will fully occupy the limit of time at present fixed for the scheme, and will be an important step towards providing for the study of Indian history such indispensable tools as are in the hands of every student of history in the West.\n\n19. Scholars to whom these volumes might be entrusted\nhave agreed to co-operate. In some cases they are temporarily committed to other engagements, and the sum allowed, under the scheme, to authors is not sufficient to set them free. It is not possible, therefore, to specify now at what time or in what order the suggested volumes might be ready for publication. But such details of publications can be left in the hands of the Editor. And the Council would ask now only for a general sanction to the suggestions here made, and for authority to the Editor to make arrangements for the publication of such of the above volumes as will be found sufficient to satisfy the requirements of the scheme within the specified period of five years.\n\nT. W. Rhys Davids,\nSecretary.\n\nThe Under-Secretary of State for India,\nIndia Office, S.W.\n\n(6).\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n3rd December, 1902.\n\nSir,\n\nI am directed by the Secretary of State for India in Council to acknowledge the receipt of your letter of the 12th November, 1902, respecting the grant to the Royal Asiatic Society of an annual sum of £1,000 for a period of five years to be expended in the production of two volumes of a Texts Series, and a like number of a Records Series, and in reply to inform you that the arrangements proposed seem calculated to meet the requirements of the case. It must rest, however, with the Government of India, to whom the correspondence will be forwarded, to decide as to (a) the appointment of Editors, and (b) the works to be taken in hand.\n\nIn paragraphs 2 to 5 of your letter under reply you explain in full detail the interpretation put by the Council upon certain of the proposals submitted to them, and I have to inform you that you have correctly interpreted the wishes of the Secretary of State in Council.\n\nI am, Sir,\nYour obedient Servant,\nA. Godley.\n\nProfessor Rhys Davids,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\nV.\n\nINDIA OFFICE,\nWHITEHALL,\nLONDON, S.W.\n5th December, 1902.\n\nDear Mr. Risley,\n\nYou will receive by this mail an official despatch from the Secretary of State in reply to Finance and Commerce letter, No. 191, dated 3rd July, 1902, respecting the Royal Asiatic Society's Indian Texts Series and Indian Records Series.\n\nWith reference to the first series the enclosures to the despatch in question explain themselves, and it is only necessary to add that the Royal Asiatic Society did not, in their reply to the India Office letter dated 4th November last, mention the names of the scholars whose co-operation has been invited. The Council, however, wish me to state to you that the following gentlemen have promised to assist:\n\nProfessor Macdonell, of Oxford\nProfessor Bendall, of Cambridge.\nMr. Fleet.\nMr. Irvine.\nMr. Rapson, of the British Museum.\nMr. Thomas, of this office.\nProfessor Jacobi, of Bonn.\nProfessor Franke, of Königsberg.\nDr. Hoernle, of Oxford.\nMr. Keith of the Colonial Office (a very promising Sanskrit scholar).\n\nAs regards the latter series, I gather from Mr. Williams' letter of 20th February, No. 611, to the officer in charge of the Records of the Government of India that it is the wish of the Government at Calcutta that Mr. Hill's work on the siege of that town in 1756 by Nawab Suraj-ud-daula should be published as the first of the Records Series. I am in a position to state that this important selection of papers will be most warmly welcomed by the Council of the Royal Asiatic Society. It is understood that it will fill two volumes of a size and style similar to the \"Letters received by the East India Company from its Servants in the East,\" and I may add en passant that this last-mentioned series is suggested as a pattern so as to maintain continuity of style. Moreover—at least it is hoped such will be the verdict—it is in every way suitable.\nI shall get estimates for printing, and have told Hill to proceed as quickly as possible with his work, so that when formal approval comes from India everything may be in train, for obviously we want to get the two volumes finished while the author is in England. I understand the selection of papers is complete, and Mr. Hill has also finished his researches amongst the Dutch and French Records, as well as in this office and at the British Museum. The introduction will be taken in hand as soon as the MS. is in type, or, rather more accurately, as soon as the MS. begins to be set up in type. For this reason we should be glad of an early intimation of the wishes of the Government of India.\n\nAs regards the next work to be published in 1904, I would suggest for the consideration of the Government of India that an edition in one volume of the Charters of the East India Company with critical notes would be useful and interesting. Some time ago Sir Arthur Wilson, late a High Court Judge at Calcutta, and now an Appeal Judge in this country, was interesting himself in the matter, but I hardly know whether, now he has left us, he will care to give the time to the subject. In any case, as it is, of course, not possible to anticipate the wishes of the Government of India, and it may be that some works are in contemplation across the water I shall not mention the matter to Sir Arthur Wilson till I know how things stand.\n\nYours, etc.,\n(Signed) A. N. WOLLASTON.\n\nVI.\n\nTo the Right Honourable Lord George Francis Hamilton,\nG.C.S.I., His Majesty's Secretary of State for India.\n\nSIMLA,\n23rd April, 1903.\nNo. 93 of 1903.\n\nMy Lord,\n\nWe have the honour to submit, for your lordship's consideration, a proposal which has been made to us by Mr. E. Denison Ross, Principal of the Calcutta Madrasah, for the publication of an Arabic History of Gujarat, the manuscript of which has recently been discovered by him in the library of the Calcutta Madrasah. The writer was a contemporary of Akbar, and his work is understood to be of exceptional interest, and to throw new lights upon the history of Gujarat and of the Muhammadan rulers of India down to and including the time of Akbar. Mr. Ross proposes to under-\ntake the publication in the first place of the Arabic text with an English introduction, and, secondly, of an English translation with notes.\n\n2. It has been ascertained that the transcript of the text will be ready by May, and Mr. Ross proposes to devote to the work the vacation months of June and July, and, further, asks to be put on special duty in England on two-thirds pay during August and September. The transcripts will occupy two volumes of text containing 500 octavo pages each, and the translation will take up two volumes of about the same size, including introduction, notes, and the necessary explanatory dissertations.\n\n3. The proposals made by Mr. Ross have our cordial support, and we would ask your lordship to agree to his being placed on special duty in England according to his suggestion.\n\n4. As intimated in our Despatch No. 17, dated the 23rd April, 1903, we think it desirable that this History of Gujarat should be published as an extra work of the Indian Texts Series, and we hope that your lordship will approve of this suggestion, and will invite the Royal Asiatic Society to accept it. In addition to their intrinsic value, which will make the volumes an appropriate addition to the Texts Series, they will represent a discovery made and work done in India, and their publication by the Royal Asiatic Society will tend to encourage Indian scholarship. Our reasons for proposing that the book should be published as an extra work outside the general arrangements which have been made with the Royal Asiatic Society are, first, that its publication under these arrangements would absorb two years' issues with a subject which lies outside the scheme suggested by the Society; and, secondly, that, owing to Mr. Ross's qualifications both as regards philology and historical research, the intervention of the General Editor will not be required for this work. It will be for the Council of the Royal Asiatic Society to settle the type and paper to be used and the style of binding with reference to the requirements of the series as a whole, and Mr. Ross will be expected to conform to their arrangements in these matters.\n\nWe have, etc.,\n(Signed) T. Raleigh.\nVII.\n\nSIMLA,\n23rd April, 1903.\nD.O. No. 89.\n\nDear Mr. Wollaston,\n\nI am desired to reply to your demi-official letter, dated the 5th December, 1902, in which you discuss the details of the scheme under which the Royal Asiatic Society will publish an Indian Records Series.\n\n2. I am to say that the Government of India agree that the volumes entitled \"Letters received by the East India Company from its Servants in the East\" should form the pattern for the \"Records Series,\" and that the first number of the series should consist of Mr. Hill's work on the siege of Calcutta in the year 1756.\n\n3. The Government of India wish to give the second place in the series to a collection of extracts connected with the early history of Fort William, which is now being prepared by Mr. C. R. Wilson, who is acting as officer in charge of the Records of the Government of India. This collection will serve to illustrate Mr. Hill's work, and to present what may be called the topographical aspects of the subject. Mr. Wilson is about to take leave to England, and it is proposed to place him on special duty for a period of two months on the expiry of his leave. During this period of leave and deputation, Mr. Wilson will complete the editing of his work, and get it ready for publication.\n\n4. For the third place in the series I am to suggest a collection of the Minutes of the Governors-General of India. Such a collection would possess great personal and historical interest, and would probably not take a very long time to publish. A preliminary question which would have to be settled is the number of volumes to which the series would extend. It might not be possible to limit the number to two, and it would seem to be primâ facie desirable that the volumes containing the Minutes should follow in consecutive order. Next might be taken up the publication of the Orme manuscripts in the India Office, or a portion of them, classified under suitable headings. These manuscripts are, it is understood, collected in a systematic form, and would admit of speedy publication.\n\n5. It has also been suggested that a valuable collection or calendar might be made from the French, Dutch, and Danish Records relating to India which exist in Europe outside England. It is believed, for instance, that there are records in Paris which are of great interest in connection with the\nhistory of the Carnatic. But in this case, and also in the case of the proposal to publish a volume of the Charters of the East India Company, with critical notes, which is made in your letter of 3rd December, further inquiry and consideration would seem to be needed before coming to a final determination. Both schemes would require much research and very special qualifications on the part of the writers.\n\nYours faithfully,\n\n(Signed) H. H. Risley.\n\nA. N. Wollaston, Esq.,\nRegistrar and Superintendent of Records,\nIndia Office.\n\nVIII.\n\nTo the Right Hon. Lord George Francis Hamilton,\nG.C.S.I., His Majesty's Secretary of State for India.\n\nSIMLA,\n23rd April, 1903.\nNo. 17 of 1903.\n\nMy Lord,\n\nWe have the honour to refer to your lordship's despatch No. 37 Public (Records), dated the 5th December, 1902, regarding the publication by the Royal Asiatic Society of London of an Indian Texts Series and an Indian Records Series. We have learnt with great pleasure that the Society has consented to undertake this work.\n\n2. The proposals of the Society made in Professor Rhys Davids' letter to the India Office of the 12th November, 1902, have our general approval, and we desire to express our satisfaction that Professor Rhys Davids should have been nominated by the Council as Editor of the Texts Series.\n\n3. The only matter with regard to which our views differ somewhat from those expressed by the Society is the principle on which works should be selected for publication in the Texts Series. It is proposed, in paragraph 7 of Professor Rhys Davids' letter, to adhere, as far as possible, to the chronological order, and in the following paragraphs of that letter a series of works is suggested relating to the successive periods of Indian history. We are of opinion, however, that there are grave objections to carrying out the work on these chronological lines. The system would inevitably lead to great delay, and would also deprive us of that initiative in suggesting subjects for publication to which we think we are\nentitled. In support of our opinion that the method suggested is unsuitable, we would refer to the fact that in publishing the comprehensive Cyclopædia of Indo-Aryan Philology and Antiquities which was commenced by Bühler, and is now being continued by Kielhorn, no attempt has been made to work on chronological lines, but volumes are produced relating to different branches of the subject according as they happen to be ready. We hope that your lordship will agree with the views which we hold on this point, and that the Royal Asiatic Society will find no difficulty in accepting them.\n\n4. As regards the actual works to be taken up, we would suggest that the series should begin with the following:\n\n(a) A collection of historical maps of India;\n(b) An index of the names and subjects of the Vedic texts; and\n(c) The Arabic History of Gujarat, which has recently been discovered in the Library of the Calcutta Madrasah.\n\nThe first two works are included in the scheme described in Professor Rhys Davids' letter, and as regards the third, we are recommending to your lordship in a separate despatch (No. 93, dated the 23rd April, 1903) that it should be published by the Royal Asiatic Society as an extra work outside the general arrangement that has been concluded with them, although forming a part of the general series. The first two works would each consist of two and the third of four volumes, and we think that the whole collection of eight volumes would contain a due admixture of books appealing to pure scholars and of books which would be welcomed by the larger public which is interested in the history and geography of ancient India.\n\n5. In concluding our remarks on the Texts Series, we would add that, subject to the freedom which we think should be allowed us in selecting works for publication, we agree with your lordship that full discretion should be left to the Editor to choose the authors for the various volumes to be included in the series.\n\n6. As regards the Records Series, we approve of the arrangements proposed in paragraph 6 of Professor Rhys Davids' letter. The Registrar and Superintendent of Records of the India Office has placed himself in communication with our officiating Secretary in the Home Department for the purpose of carrying out the details, and we have instructed\nour Secretary to communicate our suggestions to Mr. Wollaston.\n\nWe have the honour to be, my lord,\n\nYour Lordship's most obedient, humble Servants,\n\nT. Raleigh.\nE. Fg. Law.\nE. R. Elles.\nA. T. Arundel.\nDenzil Ibbetson.\n\nIX.\n\n(1). June 18, 1903. Minute of Council, No. 10.\n\nA draft reply to a letter expected from the India Office relating to the Indian Historical Series was read and approved. Mr. Wollaston and Prof. Rhys Davids, Editor of the Text Series, were appointed a Committee, with power to act, to make any alterations that might be necessary if the letter under reply when actually received should differ from the draft now submitted to the Council.\n\n(2).\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n23rd June, 1903,\n\nSir,\n\nWith reference to previous correspondence terminating with my letter of the 3rd December, 1902, I am directed by the Secretary of State for India in Council to forward here-with for the information of the Royal Asiatic Society copies of the papers noted on the margin relating to—\n\n(1) The Indian Texts Series; and\n(2) The Indian Records Series.\n\nAs regards the latter of these subjects, no observations are necessary. But with reference to the former it will be observed that the Government of India, while approving generally the arrangements which formed the basis of discussion between this office and the Royal Asiatic Society, suggest certain modifications in regard to the works selected for publication. His lordship will be glad to learn that your Council are prepared to accept the proposals now submitted.\n\nAs regards the publication of four additional volumes so as to comprise the recently discovered Arabic History of Gujarat with an accompanying translation of the text, I am to point out that the arrangements notified in the India Office letter of the 4th November, 1902, would not appear\nto be closely applicable, inasmuch as the volumes are, it is understood, likely considerably to exceed the limit of 400 pages laid down in the Memorandum of Terms which formed an enclosure to the letter in question, while the payment to your Society for editing (£30 per volume), which formed part of the original scheme, would not be necessary in the present instance. Such being the case, the Secretary of State for India in Council is prepared to refund to the Royal Asiatic Society any outlay, not exceeding in all £650, for the four volumes, which may be incurred on account of composition, press-work, paper, binding, and incidental expenses. The conditions contained in Clauses 5, 6, 7, and 8 of the Memorandum of Terms would remain in force, except that the date of the first payment would not be the commencement of the period of five years for which the arrangements are to run.\n\nThe work of translating and editing this History would be entrusted to Professor Denison Ross, and no expense would fall upon the Royal Asiatic Society in respect of his remuneration.\n\nI am, Sir,\nYour obedient Servant,\nA. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nX.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n26th June, 1903.\n\nDear Mr. Risley,\n\nYour letter of 23rd April, 1903, duly received. Wilson has arrived in this country, and also Denison Ross, and official despatches will shortly be addressed to the Government of India on the subject of their leave, etc. I may inform you \"unofficially\" that the Royal Asiatic Society came into line as regards the various proposals submitted to them by the Viceroy's Government.\n\nI forward for consideration a memorandum by Mr. Irvine, retired I.C.S., regarding an edition of Manucci's work on his travels in India at the time of Aurangzib. I have discussed the matter with him, and gather that in his opinion (in which I warmly concur) the volumes, if published in the Indian Records Series, would be at once valuable and interesting.\nI enclose letters* from Mr. Irvine giving some further details, and shall be glad to learn that the Government of India are prepared to include this work in the above-mentioned series. It will be seen that it would not be ready for two or three years, and would not, therefore, interfere in any way with the volumes now in hand.\n\n(Signed) A. N. WOLLASTON.\n\nXI.\n\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET,\nLONDON, W.,\n28th June, 1903.\n\nSIR,\n\nYour letter of the 23rd June having been laid before the Council of the Society, I am desired to say that they recognise the force of the arguments used by the Government of India in paragraph 3 of their letter of the 23rd April, No. 17 of 1903, and are quite prepared to adopt the modifications therein suggested.\n\nIn paragraph 4 authority is given to make the necessary arrangements for publishing—\n\n(1) A collection of historical maps of India.\n(2) An index of the historical names and subjects in the Vedic texts.\n(3) An Arabic history of Gujarat (text and translation).\n\nWith regard to the maps, the Editor is in correspondence with the authors to whom the preparation of them, and of the explanatory texts and indices to accompany them, will be intrusted; and so far as he is able to conclude from the answers at present received, he is of opinion that the volumes may be ready in the course of next year.\n\nWith regard to No. 2, Professor Macdonell, of Oxford, who has been selected as author, has already work in hand which will occupy him to the end of this year. He does not think it will be possible for him in such case to complete his labours before the midsummer of 1905. Publication before the end of 1906 is, therefore, uncertain. Even assuming, which is doubtful, that it might be possible, by entrusting the work to another hand, to have it finished more quickly, it is submitted that Professor Macdonell is the most competent scholar in this branch of inquiry, and the Council do not think it would be desirable to save time at the expense of efficiency.\n\nI am also directed to point out that it is not advisable that\n\n* Dated 24 and 25 June, 1903.\nafter the volumes have once commenced to appear, there should be any gap in the publication of the series. The Council would venture, therefore, to suggest that the Editor should have authority to make arrangements for the preparation of some additional volumes beyond those already sanctioned. It may be taken, perhaps, for granted that three or four years will elapse from the date when an author is allowed to commence his work before it can be ready for publication. It would, of course be understood that, in doing so, the right of the Government of India to select other works for publication should not be impaired. Any works so selected would always take precedence of the volumes in hand. Authors will not object, but rather be glad, to have some further time allowed them.\n\nAs regards the history of Gujarat, the Council observe that the expenditure for composition, etc., is limited to a sum not exceeding £650 for the four volumes. It is perhaps doubtful whether this sum will suffice, but every effort will be made to keep the disbursements within this estimate. So much, however, depends upon the Editor as regards corrections, legibility of text, and so forth, that it is scarcely possible to forecast closely the precise cost of the work, nor must it be overlooked that, as two volumes are to be printed in Arabic type, ordinary charges for printing will be not inconsiderably enhanced. I am also desired to point out that the information supplied with regard to the extent of the work is scarcely sufficient to enable the Society to form any accurate judgment as to what its size and consequent cost will be. In these circumstances the Council assume that the Secretary of State would be prepared to give an assurance that no loss should devolve upon the Royal Asiatic Society.\n\nWith reference to the Indian Records Series, the Council hope they may be permitted to express their warm approval of the selection of works which it is contemplated to publish. Tenders for printing and binding having been received, they are in a position to state that the original estimates are not likely to be exceeded.\n\nT. W. Rhys Davids,\nSecretary.\n\nTo the Under-Secretary of State,\nIndia Office.\nXII.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n1st August, 1903.\nR. and L., 883.\n\nSir,\n\nI am directed by the Secretary of State for India in Council to acknowledge the receipt of your letter of the 28th June, 1903, a copy of which will be forwarded to the Government of India for such orders as they may wish to pass thereon.\n\nAs regards the history of Gujarat, I observe that the Council are somewhat doubtful whether the sum of £650 named in the India Office letter of the 23rd June, 1903, will suffice to cover the expenditure on composition, etc.\n\nIt is understood that Professor Denison Ross has not yet commenced the translation, which will probably not, therefore, be completed for some considerable time. In these circumstances it has been determined to confine the present proposals to the Arabic text, the cost of which will be limited to a maximum of £400. The publication of the further volumes (English) will stand over till such time as it would be practicable for the Royal Asiatic Society to furnish an estimate as to their cost.\n\nI am, Sir,\nYour obedient Servant,\nPercy.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nXIII.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n2nd September, 1903.\nR. and L., 1,057.\n\nSir,\n\nIn continuation of my letter R. and L. 613, dated the 23rd June, 1903, I am directed by the Secretary of State for India in Council to inform you that it has been decided to include in Dr. Wilson's forthcoming work on Old Fort William a number of plans and views at an estimated cost of £75.\n\nArrangements have been concluded with Mr. Griggs for the supply of these plates, and payment will be made direct to him by this office upon their delivery. The sum of £10, allotted in the general scheme for the provision of illustra-\ntions, will consequently be deducted from the amount to be paid to your Society for this particular volume.\n\nI am, Sir,\n\nYour obedient Servant\n\nHORACE WALPOLE.\n\nTHE SECRETARY,\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET, W.\n\nXIV.\n\nINDIA OFFICE,\nWHITEHALL,\nLONDON, S.W.,\n18th September, 1903.\nR. AND L., 1,318.\n\nDear Mr. Risley,\n\nI had hoped to have sent you this week a few lines in regard to the publication of Manucci's Travels, but I have not been able to see Mr. Irvine till to-day, and time will not permit me to do more on this occasion than say that no difficulties are likely to arise.\n\nWould you kindly ascertain the wishes of the Government of India on the following point? You will recollect that provision has been made for the publication of two volumes of the Texts Series and two volumes of the Records Series in each year, and that this arrangement is to continue for a period of five years—of course, subject to renewal, if so desired. I am now in a position to inform you that Mr. Hill's work on the Siege of Calcutta will occupy three volumes (unless, of course, you direct a curtailment), and Wilson's History of Fort William is likely to fill two volumes. You are aware, from the correspondence which accompanied the Secretary of State's despatch, No. 37, Public (Records), of 5th December, 1902, that the period of five years is to commence from the date of first payment. This will fall due some time during the early part of 1904, in which year both Hill's and Wilson's works will probably be published. As five volumes will, therefore, appear simultaneously, or nearly so, the question of necessity arises as to what is to be done.\n\nThree courses are open for adoption:\n\n1. To defer the publication of one of the two last-mentioned works till the commencement of 1905.\n2. To consider the scheme for the Records Series as commencing in 1902, when it was originally sanctioned by the Government of India.\n3. To commence the Series in 1904, and to consider the three further volumes published in that year as \"extra\" in\nthe same way as will be done in the case of Ross's History of Gujarat.\n\nIn my opinion (1) is undesirable from every point of view, and, indeed, practically impossible, as payment would have to be made when the work is ready for publication.\n\nEliminating, therefore, (1), there remains in the first place (2), which it will be observed would make provision for six volumes, but leaves an odd volume, which would create a difficulty. Further, it would make greater than ever the difference of date at which the two series are to commence, as the Records Series would start from 1902, while at the earliest the Texts Series would not begin till 1904, possibly 1905.\n\nIn all the circumstances, therefore, would it not be well to consider Wilson's work in two volumes as normal for 1904, and throw in Hill's three volumes as \"extra\"?\n\nIn your letter of 23rd April you suggest that the third place in the series should be allotted to a collection of the Minutes of the Governors-General. This is a matter, of course, entirely in the hands of the Government of India, but so far as I* can be said to represent the Royal Asiatic Society, their readiest acquiescence in this admirable suggestion may be taken for granted. If the present proposal to treat Hill's three volumes as \"extra\" be adopted, the Minutes would appear in 1905. It may be doubted (as you yourself say) whether it would be possible to confine them within two volumes, especially if (as may possibly be deemed advisable) the series is accompanied by historical résumés and explanatory annotations. So that not improbably provision will have been made for the issue during the years 1905 and 1906. It is scarcely necessary on the present occasion to discuss matters in advance of those dates.\n\nI am, etc.,\n(Signed) A. N. WOLLASTON.\n\nIt may be well to let you know that we have sanctioned an expenditure of £75 (or £55 beyond the amount of £20 allowed under this head) to provide illustrations for Mr. Wilson's work on Fort William.\n\nH. H. RISLEY, Esq., C.I.E.\n\n* I find the R.A.S., in their letter of 28 June, 1903, agreed to this.—(Intd.) A. N. W.\nXV.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n25th September, 1903.\n\nDear Mr. Risley,\n\nI find as a result of Mr. Irvine's visit to me on 18th September, to which I referred in my letter to you of that date, that the translation of Manucci's Travels will fill four volumes of the Indian Texts Series, and that two of them will, perhaps, be ready for publication during the course of 1904. As this is to some extent doubtful, would it not be well to earmark these four volumes for the years 1905 and 1906, so that the historical maps mentioned in the letter from the Government of India to the Secretary of State, No. 17, Home Department (Public), dated 23rd April, 1903, could appear in 1904 as arranged?\n\nAssuming that the Royal Asiatic Society make the formal proposals regarding the Manucci Travels to which you refer in your letter of 3rd August, 1903—a matter which will be settled towards the close of this year, when people reassemble after the recess—do you think my present suggestion would find favour with the authorities in India? If otherwise, it is obvious that under present arrangements there will be a hiatus in 1905, as Professor Macdonell's work on Vedic Texts will not be ready at the earliest till 1906, and perhaps not then (so that it could easily be transferred to 1907), and nothing (other than Manucci's Travels) is on the stocks to appear in 1905.\n\nYou will not fail to observe that the plan now sketched out provides a regular flow of volumes in the Texts Series for the years 1904, 1905, 1906, and 1907.\n\nVery truly, etc.,\n\n(Signed) A. N. Wollaston.\n\nH. H. Risley, Esq., C.I.E.\n\nXVI.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n3rd November, 1903.\n\nR. and L., 1,473.\n\nSir,\n\nI am directed by the Secretary of State for India to forward for the information of the Royal Asiatic Society\ncopy of the papers noted on the margin* relative to the Indian Text Series and Indian Records Series.\n\nI am, Sir,\n\nYour obedient Servant,\n\nA. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nXVII.\n\nTo the Right Hon. Lord George Francis Hamilton,\nG.C.S.I., His Majesty's Secretary of State for India.\n\nSimla,\n1st October, 1903.\nNo. 60 of 1903.\n\nMy Lord,\n\nWe have the honour to acknowledge the receipt of your lordship's despatch, No. 21, Public (Records), dated the 7th August, 1903, forwarding a copy of correspondence with the Royal Asiatic Society in regard to the Indian Texts Series and Indian Records Series.\n\n2. We observe that the Society approves of the works we have suggested for publication in either series, and accepts the modification proposed in our Public Despatch, No. 17, dated the 23rd April, 1903, of the principle on which volumes should be selected for publication in the Texts Series. The Society asks at the same time that, with a view to securing a continuous issue, the Editor of the latter series may be given authority to arrange for the preparation of some additional volumes beyond those referred to above, on the condition that works selected by us should take precedence of others in hand. We give the required authority with pleasure, on the understanding that the subjects of the additional volumes will be taken from among those enumerated in the Society's letter of 12th November, 1902. We would further point out that these volumes, together with those already approved, should be limited to ten, so as to cover the period of five years for which the arrangements for the publication of the Series have been tentatively sanctioned.*\n\n3. We request that your lordship will cause our observations to be conveyed to the Royal Asiatic Society for information.\n\nWe have, etc.,\n\n(Signed) T. H. Raleigh.\n\n* Letter XVII., October 1st, 1903. Letter XVIII., August 3rd, 1903.\n† Vide our Financial Despatch, No. 111, dated the 3rd July, 1902 (above No. IV., 3).\nXVIII.\n\nSIMLA,\n3rd August, 1903.\nD. O. 182.\n\nDear Mr. Wollaston,\n\nI have received your letter of the 26th June, 1903, with which you forward a memorandum by Mr. Irvine regarding an edition of Manucci's account of his travels in India at the time of the Aurangzib.\n\nThe suggestion made by you in consultation with Mr. Irvine that the work should be published as one of the Indian Records Series, has been considered by the Government of India. They are of opinion, having regard to the scheme submitted in their Financial Despatch, No. 191, dated the 3rd July, 1902, which has been accepted by the Royal Asiatic Society and the Secretary of State, that Manucci's work is not one which can be properly included in the Indian Records Series. The Governor-General in Council will, however, be prepared in due course to agree to the book being issued as one of the Indian Texts Series if formal proposals to that effect are made by the Royal Asiatic Society.\n\nYours, etc.,\n\n(Signed) H. H. Risley.\n\nA. N. WOLLASTON, Esq., C.I.E.,\nRegistrar and Superintendent of Records,\nIndia Office.\n\nXIX.\n\n(1). November 10, 1903. Minute of Council. No. 9.\n\nDraft replies to letters of the India Office, dated 1st of August and 3rd of November, were read and corrected and passed.\n\nROYAL ASIATIC SOCIETY,\n22, Albemarle Street, W.,\n11th November, 1903.\n\nSir,\n\nYour letter (R. and L. 883) dated the 1st of August was laid before the Council at its meeting yesterday.\n\nIn reply, I am desired to state that the Society has been given to understand by Professor Denison Ross that the extent of the Arabic text will amount to seventy-five sheets of sixteen pages each in print. Provided that this estimate should be found to be correct, and that the cost of corrections, alterations, etc., should be kept within the limit of 10s. per sheet, the amount of £400 proposed in your letter would not be exceeded.\n\nAs the MS. has not been submitted to the Society, and as\nthe Society has no control over any such extra expenses as may be incurred by order of the Editor, it is not possible to give more than the general assurance as given above. But under the circumstances the Council trust that that will be considered sufficient. And it is presumed that, should the cost of production exceed the limit of £400, the Government will be prepared to meet the excess.\n\nI am, Sir,\n\nYour obedient servant,\nT. W. Rhys Davids,\nSecretary.\n\nThe Under-Secretary of State for India.\n\n(3).\n\nRoyal Asiatic Society,\n22, Albemarle Street,\nLondon, W.,\n11th November, 1903.\n\nSir,\n\nI am desired by the Council to acknowledge the receipt of your letter of the 3rd inst., enclosing copies of a letter (No. 60 Home), dated 1st October, 1903, from the Government of India, and of a letter (D.O. 182), dated the 3rd August last from Mr. Risley to Mr. Wollaston.\n\nThe Council notice with great pleasure the decision of the Government of India conveyed by the first letter, which will greatly facilitate the establishment of the Indian Texts Series.\n\nWith regard to the edition of Manucci's Travels in India in the seventeenth and eighteenth centuries, it is evident that those travels cannot be considered, strictly speaking, as part of the Indian Records. But it would also be very incongruous to include them in a series of texts and other documents dealing with periods of history of so much more remote antiquity, such as it is proposed to publish in the Indian Texts Series. Should the Government wish these travels, of so much interest for the period to which they refer, to be included among the volumes to be published under the existing arrangement with the Society, the Council would be glad to publish them, but would venture to suggest that it would be less incongruous to bring them out in the Indian Records Series, to which they are so much more nearly related in point of date.\n\nI am, Sir,\n\nYour obedient Servant,\nT. W. Rhys Davids,\nSecretary.\n\nThe Under-Secretary of State for India.\nXX.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n13th November, 1903.\n\nDear Mr. Risley,\n\nYou will see from the annexed papers* (1) that the arrangements respecting the preparation of volumes of the Text Series in advance are finally settled; (2) that the Royal Asiatic Society are anxious that the Manucci Travels should appear in the Records Series.\n\nI much hope this latter suggestion will find favour with the Government of India. My reasons are twofold. First of all, as it appears to me, the Texts Series should be confined to learned works by learned scholars, and as a general rule should embody the researches of savants in connection with times long past. The next argument on my part is that the inclusion of four volumes in the Texts Series would for all practical purposes render any further \"advance\" preparation impracticable, thus:\n\n1904, Historical Maps, as settled.\n1905, Manucci.\n1906, Ditto.\n1907, Vedic Texts.\n1908, Vacant.\n\nIn other words, only two additional volumes could be taken in hand. Of course, if Manucci be removed from the list, there would be a blank for 1905 and possibly for 1906, as \"advance\" volumes would not be ready.\n\nThe Government of India apparently recognise the force of this argument, inasmuch as they treated Professor Denison Ross's Arabic work as an \"extra\" beyond the ordinary series.\n\nIn my letter of 18th September last I suggested that Hill's three volumes should in like manner be treated as an \"extra,\" in which case the Records Series would stand thus:\n\n1904, Wilson.\n1905, Manucci.\n1906, Ditto.\n1907, Forrest.\n1908, Vacant.\n\nColonel Ranking, who was lately home here, is very anxious that his History of the College of Fort William should be published, and it has occurred to me that perhaps the Govern-\n\n* Letter No. XVI., Nov. 3, 1903, and Letter XIX. (2), Nov. 11, 1904.\nment of India might see fit to include his work in the Records Series, and thus complete the Series connected with Calcutta. If so, should it appear in 1905, and push on Manucci to 1906 and 1907?\n\nKindly at your early convenience let me know the decision on all these points, as negotiations with Forrest will await your reply.\n\nI am, etc.,\n(Signed) A. N. WOLLASTON.\n\nXXI.\n\nHOME DEPARTMENT,\nCALCUTTA,\n19th November, 1903.\nD. O. No. 240.\n\nDear Mr. WOLLASTON,\n\nI am desired to acknowledge the receipt of your letters of the 18th and 25th September, 1903, regarding the order of publication of the works intended for the Indian Texts Series and the Indian Records Series.\n\nIn reply, I am to say that the Government of India find it impossible to forecast exactly what number of volumes will be ready by a given time. They have decided, however, after a careful consideration of all the circumstances, to approve the following arrangement provisionally:\n\n| Year | Texts Series | Records Series |\n|------|--------------|----------------|\n| 1903 | Arabic Texts of the History of Gujarat, two volumes. | Mr. Hill’s work on the Siege of Calcutta, three volumes. |\n| 1904 | Historical Maps of India, one volume. | Mr. Wilson’s work on Fort William, two volumes. |\n| 1905 | Manucci’s Travels. | Mr. Forrest’s Collection of Clive papers. |\n| 1907 | Index of Vedic Names, etc. | |\n\nIt will be seen from the above scheme that it is intended to publish only six volumes in the first two years, instead of eight. The Arabic Text of the History of Gujarat will, as has already been decided, form part of the series, but the cost of publishing them will not be charged against the annual grant of Rs. 15,000. Under this arrangement there will, therefore, be no difficulty in bringing the expenditure involved within the grant.\n\nYours, etc.,\n(Signed) H. H. RISLEY.\n\nA. N. WOLLASTON, Esq., C.I.E.,\nREGISTRAR AND SUPERINTENDENT OF RECORDS,\nINDIA OFFICE,\nLONDON, S.W.\nXXII.\n\nHOME DEPARTMENT,\n\nCALCUTTA,\n10th December, 1903.\n\nDear Mr. Wollaston,\n\nI am desired to acknowledge the receipt of your letter, dated the 13th November, 1903, forwarding a copy of papers which show (1) that the arrangements respecting the preparation of volumes of the Indian Text Series in advance are finally settled, and (2) that the Royal Asiatic Society are anxious that the Manucci Travels should appear in the Indian Records Series rather than in the Texts Series. You support the Society in their desire that the Manucci Travels should appear in the Records Series, and you further suggest for the consideration of the Government of India the question of publishing Colonel Ranking's History of the College of Fort William in the same series.\n\nIn reply, I am to invite attention to my demi-official letter, No. 240, of the 19th November, 1903, and to say that the Government of India would prefer to adhere to the arrangement described therein, under which the Manucci Travels will be included in the Texts Series. The chief reasons which have led them to maintain this position are:\n\n(1) That, as admitted by the Royal Asiatic Society, the Manucci Travels cannot be considered as part of the Indian Records;\n\n(2) That the edition of these Travels will form a work of similar character to, and not very distant in point of date of compilation from, the Arabic History of Gujarat which is to appear in the Texts Series; and\n\n(3) That, if the Travels are transferred from the Texts to the Records Series, there will be a great gap in the former, while the latter will be overcrowded.\n\nI am to add that Colonel Ranking's compilation has already been examined by the Government of India, who are of opinion that it is not desirable to publish it in the Indian Records Series.\n\nYours, etc.,\n\n(Signed) H. H. Risley.\n\nA. N. Wollaston, Esq., C.I.E.,\nRegistrar and Superintendent of Records,\nIndia Office,\nLondon, S.W\nXXIII.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n10th December, 1903.\nR. and L. 1,548.\n\nSir,\n\nI am directed by the Secretary of State for India in Council to acknowledge the receipt of your letter of the 11th November, 1903, in which, while stating that the sum of £400 named in Earl Percy's letter of the 1st August, 1903, will probably suffice to cover the cost of production as regards the Arabic text of the History of Gujarat edited by Professor Denison Ross, the Royal Asiatic Society express a hope that any deficit which may occur will be paid by Government.\n\nIn reply, I am to state that, should the amount in question eventually prove insufficient, the Secretary of State for India will be prepared to take into consideration any estimate which the Society may submit for the completion of the work.\n\nI am, Sir,\n\nYour obedient Servant,\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nHorace Walpole.\n\nXXIV.\n\nJanuary 12, 1904. Minute of Council, No. 11.\n\nA Letter from the India Office on the cost of Dr. Ross's Arabic History of Gujarat was referred to the Finance Committee.\n\nXXV.\n\n8th January, 1904.\nR. and L. 44.\n\nDear Mr. Risley,\n\nAs the two first works to be included in the Indian Records Series are progressing steadily towards completion, the question arises, What arrangements are to be made as regards indexing?\n\nThe Government of India will probably desire that each work should be fully and carefully indexed. In my opinion, this can be most satisfactorily done either by the editor himself or by someone acting under his control. Any additional expense to which the Editor is put might be considered by the Government of India in fixing the amount of his honorarium.\n\nShould this view be taken by the Government, may I suggest that you should communicate their decision direct\nto Dr. Wilson? More than half of the text of his work is in type, and it is desirable that the index should be commenced without delay.\n\nYours faithfully,\n(Signed) A. N. WOLLASTON,\nRegistrar and Superintendent of Records.\n\nH. H. RISLEY, Esq., C.I.E.,\nSecretary to the Government of India,\nHome Department.\n\nXXVI.\n\n15th January, 1904.\nR. and L. 44.\n\nDear Mr. Risley,\n\nSince writing you last mail, I have seen Professor Rhys Davids on the subject of the preparation of indexes to the Records and Texts Series. He told me that it was the invariable practice at the Royal Asiatic Society to require authors to provide their own indexes, and that Professor Max Müller followed the same rule in the Sacred Books of the East Series.\n\nI may add that Mr. Hill has expressed his willingness to compile the index to his volumes in the Records Series.\n\nYours faithfully,\n(Signed) A. N. WOLLASTON,\nRegistrar and Superintendent of Records.\n\nH. H. RISLEY, Esq., C.I.E.,\nSecretary to the Government of India,\nHome Department.\n\nXXVII.\n\nHome Department,\nCalcutta,\n3rd February, 1904.\n\nDear Mr. Wollaston,\n\nWith reference to your letters noted on the margin,* I am desired to inform you that, in view of the practice at the Royal Asiatic Society, Mr. Wilson is also prepared to provide the index to his work on Fort William, and that the future compilers of volumes for the Indian Records and Indian Texts Series will follow the same practice.\n\nYours sincerely,\nA. N. WOLLASTON, C.I.E.,\nRegistrar and Superintendent of Records,\nIndia Office.\n\n(Signed) H. H. RISLEY.\n\n* R. and L. No. 44, dated 8-1-'04; R. and L. No. 44, dated 15-1-'04.\nTo the Council of the Royal Asiatic Society.\n\nI beg to report that the Government of India have selected the following volumes for the Records Series, viz.:\n\n\"Bengal in 1756-57,\" by S. C. Hill, three volumes.\n\"History of Old Fort William,\" by C. R. Wilson, two volumes.\n\nThe first work will probably extend to from 1,200 to 1,400 pages (three volumes), while the latter (two volumes) will, it is understood, be considerably smaller, so that perhaps the average of 400 pages will not be exceeded.\n\nMessrs. Billing have agreed to print the work at a cost of £3 per sheet of sixteen pages, exclusive of corrections. As an allowance of £1 a sheet is made in the estimate under this latter head, it may be reasonably expected that this amount will not be exceeded.\n\nThe binding will, it is hoped and believed, come within the estimated amount (8d. a copy).\n\nThe author will be paid by Government, and the amount (£80) provided under this head will be deducted from the sum payable to the Royal Asiatic Society, while the rate for the Editor's remuneration is fixed in the agreement.\n\nThere is, therefore, every probability that these five volumes can be produced for the stipulated sum.\n\nA. N. WOLLASTON.\n\nMarch 8, 1904. MINUTES OF COUNCIL, No. 15.\n\nLetter from Mr. Wollaston, dated 23rd February, 1904, describing the state of the printing of the first volumes of the Indian Records Series was read.\n\nXXX.\n\nDEAR MR. RISLEY,\n\nI had hoped that by this date I should be in a position to give you precise information in regard to the matters referred to in your letters dated respectively 7th October and 10th December, 1903; but I fear all I can do on this occasion is to intimate that I am led to understand that Forrest is going to do \"Clive\" for the Records Series, as you suggest,\nand that this will occupy five volumes. If this should prove accurate matters would stand thus:\n\n1903. Hill's Bengal, 2 volumes.\n1904. Hill's Bengal, 1 volume.\n1904. Wilson's Fort William, 1 volume.\n1905. Ditto, 1 volume.\n1905. Forrest's Clive, 1 volume.\n1906. Ditto, 2 volumes.\n1907. Ditto, 2 volumes.\n\nSuch being the case, the series of five years will be completed.\n\nAs soon as I can get a definite reply from Forrest embodying his proposals in detail, I will again address you. Meanwhile, it may be well, perhaps, to let you know what is probable.\n\nVery truly yours,\n\n(Signed) A. N. WOLLASTON.\n\nXXXI.\n\nINDIA OFFICE,\nWHITEHALL,\nLONDON, S.W.,\n29th April, 1904.\n\nDear Mr. Risley,\n\nYou will see from the enclosed papers* that Sir Richard Temple is prepared if the Government of India concurs to produce two volumes for the Indian Records Series, so as to embody the researches which he has made relating to Sir Streynsham Master. If his proposals are sanctioned—and they seem to me worthy of support—I venture to suggest that Forrest's Clive papers which he has definitely agreed to take in hand be limited to three volumes instead of five. I have reason to believe that this might well be done. One not inconsiderable advantage of the scheme now sketched out is that, should there be delay in the appearance of Forrest's volumes, the two which Temple would produce (the materials for which are largely complete) would appear in 1905, and so a hiatus would be avoided. The entire list would then be complete for the five years for which the arrangement with the Royal Asiatic Society has been sanctioned—a remark which, of course, refers only to the Records Series. The Texts Series has two volumes still to be supplied, and I understand Professor Rhys Davids is making some settlement in this direction.\n\nVery, etc.,\n\nH. H. Risley, Esq., C.I.E. (Signed) A. N. WOLLASTON.\n\n* Letter from Sir R. Temple, dated 27th April, 1904, with an enclosure.\nXXXII.\n\n(1).\n\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET,\nLONDON, W.,\n20th May, 1904.\n\nSIR,\n\nI am desired by the Council to forward to you the enclosed copy of a letter from Mr. W. Irvine on the subject of illustrations to his forthcoming translation of Manucci's \"Storia da Mogor,\" and to ask for your decision on the matter.\n\nI have the honour to be, Sir,\nYour obedient Servant,\nT. W. RHYS DAVIDS,\nTHE UNDER-SECRETARY OF STATE FOR INDIA. Secretary.\n\n(2).\n\nHOLLIS CROFT,\n49, CASTELNAU,\nBARNES, S.W.,\n28th April, 1904.\n\nSIR,\n\nIn continuation of my letter of the 15th March last, and with reference to your letter of the 9th of that month, informing me that an edition (translated) of N. Manucci's \"Storia da Mogor,\" to be prepared by me, had been included in the Indian Texts Series under your editorship, I beg to submit the following proposal for the addition of illustrations to the work thus sanctioned.\n\n2. A work of an historical and biographical nature like that of Manucci is one eminently suited for, and in need of, illustrations; while, owing to the comparative cheapness of the many processes recently introduced, there are few works of the sort which now appear without views or portraits. Illustrations are now looked for as a matter of course in all such publications. I am sure that the inclusion of a series of portraits would add immensely to the attractiveness of the work, and increase its sale. A new class of purchasers would be reached, for, outside the students of history, biography, and travel, who might seek to possess the book for its own sake, illustrations, especially reproductions of Indian miniatures, would create a demand from art collectors and from the great body of amateurs who value books as much by their appearance as by their contents.\n\n3. In the present instance there is no necessity to search for appropriate pictures, or debate which of them ought to be selected. As pointed out by me in the note printed in the Journal of the Royal Asiatic Society for October, 1903, p. 728, Manucci himself collected a very fine set of Indian\nportraits, fifty-six in number. The volume containing these is now in the Bibliothèque Nationale at Paris, and has been fully described by Mr. E. Blochet in his \"Inventaire et Description des Miniatures des MSS. Orientaux,\" pp. 225-229 (Paris, 1900).\n\n4. My proposal is that these fifty-six miniatures be reproduced in black and white (the cost of coloured reproduction is prohibitive). They could be assigned equally to the four volumes, one appearing in each as a frontispiece—say, the two portraits of the author (Nos. 1 and 2), Taimūr (No. 3), and Aurangzeb (No. 13)—the rest being placed at regular intervals in the rest of the volume. Or they could be placed together and brought out in an extra volume, accompanied by translations of Manucci's descriptions. Below the author's portrait I would propose to insert a facsimile of his signature to the letter addressed to the Doge and Senate of Venice.\n\n5. I enclose copies of estimates furnished by Mr. Sauvanaud of Paris for the negatives, and by Messrs. Bemrose and Sons, Limited, for the impressions; also an outline of the proposed size of the page and the print, as sent by me to Paris when calling for the estimate. Mr. Sauvanaud has done similar work to the satisfaction of Mr. Blochet, by whom he is recommended; and Messrs. Bemrose and Sons are the printers of the Connoisseur, in which the art reproductions are of the very highest quality. The cost according to these estimates would approximately be:\n\n| £ | s. | d. |\n|---|----|----|\n| 56 negatives, 4 proofs of each, at 5 francs = 280 francs, say | 11 | 4 | 0 |\n| 28,000 prints (500 × 56), 4½ × 6¼, on paper 8¾ × 6¼, half-tone blocks, and titles in black ink | 116 | 0 | 0 |\n\n£127 4 0\n\nOr, to cover possible errors, say £140 for four volumes; this would come to £35 extra per volume, or to about 1s. 6d. per copy of an edition of 500 copies. If sanction were accorded to raising the selling price of these volumes from 10s. (as sanctioned) to 15s., the extra cost would be recovered, even if half only of the edition were sold. But, in the first instance, it would be necessary to increase the Government grant per volume from £250 to £285.\n\nI have the honour to be, Sir,\n\nYour most obedient Servant,\n\nWM. IRVINE.\n\nPROFESSOR T. W. RHYS DAVIDS, LL.D.,\nEDITOR, INDIAN TEXT SERIES,\n22, ALBEMARLE STREET.\nXXXIII.\n\nFrom Mr. Forrest, 28th May, 1904, to ditto, 30th May, 1904.\n\nINDIA OFFICE,\n31st May, 1904.\nR. AND L. 721.\n\nDear Mr. Risley,\n\nI transmit herewith copy of correspondence with Mr. G. W. Forrest, from which it will be seen that he is prepared to edit the Clive Papers for the Indian Records Series.\n\nYours, etc.,\n\n(Signed) A. N. WOLLASTON,\nRegistrar and Superintendent of Records.\n\nH. H. Risley, Esq., C.I.E.,\nSecretary to the Government of India,\nHome Department,\nSimla.\n\nXXXIV.\n\nJune 14, 1904. Minute of Council, No. 7.\n\nMr. Fleet withdrew a motion standing in his name in the minutes, and moved, instead of it, the following motion on the same matter:\n\nIn respect of all those volumes of the Indian Text Series for the selection and management of which this Council is responsible, and proposals for which have not already been laid before, and formally endorsed by, this Council, the Secretary of this Society, as Editor of the Series, shall formulate his proposals and submit them to this Council by including them in the usual Lists of Agenda, and each such proposal shall, at the meeting of this Council to which it is first made known, be referred for report to a committee the members of which shall, as far as possible, be chosen for a special acquaintance with the subject of the contemplated volume or volumes, and the committee shall make its report with opinions and recommendations to, as far as possible, the next subsequent meeting of the committee.\n\nThe Resolution was carried.\n\nXXXV.\n\nJune 14, 1904. Minute of Council, No. 8.\n\nThe Secretary proposed that in the Indian Text Series there should be published a volume to contain an edition with complete Index Verborum, but without plates, of all the Kharoshthi inscriptions on Metal or Stone, exclusive of the Asoka Edicts, to be entrusted to Prof. Rapson and Mr. Bergny. The proposal was referred to a committee consisting of Professors Macdonell, Bendall, and Rapson, Mr. Fleet and Mr. Thomas.\nXXXVI.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n28rd June, 1904.\nR. and L. 707.\n\nSir,\n\nIn reply to your letter dated 20th May, 1904, I am directed by the Secretary of State for India in Council to inform you that the question raised therein of the amount to be spent on illustrations to Mr. Irvine's translation of Manucci's \"Storia da Mogor\" has been referred to the Government of India, on the receipt of whose reply a further communication will be addressed to you.\n\nI am, Sir,\n\nYour obedient Servant,\nA. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nXXXVII.\n\nHome Department (India),\nSimla,\n29th June, 1904.\n\nDear Mr. Wollaston,\n\nI am desired to reply to your letters of the 15th and 29th April on the subject of the selection of works for the Indian Records Series. In your earlier letter you suggested the following arrangements for the five years' series:\n\n1903. Hill's Bengal, 2 volumes.\n1904. Ditto, 1 volume.\n1904. Wilson's Fort William, 1 volume.\n1905. Ditto, 1 volume.\n1905. Forrest's Clive, 1 volume.\n1906. Ditto, 2 volumes.\n1907. Ditto, 2 volumes.\n\nYour later letter forwards a copy of papers regarding an offer made by Sir Richard Temple to produce two volumes for the Series embodying the researches which he had made relating to Sir Streynsham Master. You consider that Sir Richard Temple's proposals are worthy of support, and you suggest that arrangements should be made to bring them into the five years' series by limiting Forrest's Clive papers to three volumes instead of five. You say that you have\nreason to believe that this curtailment might well be made, and that the revised scheme would have this advantage—that Sir Richard Temple’s volumes could be produced in 1905, whilst there is likely to be delay in the production of Forrest’s book.\n\n2. I am to say that the Government of India agree to the proposals made in your letter of the 29th April, and think that it would be better to include in the series both Sir Richard Temple’s and Mr. Forrest’s books rather than to fill up one half of the whole series with Mr. Forrest’s volumes. You will no doubt arrange with Mr. Forrest for the compression of the papers he proposes to publish into the three volumes.\n\n3. The Government of India understand that under the revised proposals made in your letter of the 29th April the order of publication for the five years will stand as follows:\n\n1903. Hill’s Bengal, 2 volumes.\n1904. Ditto, 1 volume.\n1904. Wilson’s Fort William, 1 volume.\n1905. Ditto, 1 volume.\n1905. Temple’s Master, 1 volume.\n1906. Ditto, 1 volume.\n1906. Forrest’s Clive, 1 volume.\n1907. Ditto, 2 volumes.\n\nYours, etc.,\n(Signed) H. H. Risley.\n\nA. N. Wollaston, Esq., C.I.E.,\nRegistrar and Superintendent of Records,\nIndia Office.\n\nXXXVIII.\n\nJuly 5, 1904. MINUTE OF COUNCIL, No. 6.\n\nMr. Wollaston moved that a draft letter to the India Office, copies of which had been circulated, should be adopted, and letter sent. The letter related to a suggested agreement, between Mr. John Murray and the Secretary, as to that firm acting as publishers to the Society. Resolved: That before coming to any agreement with Messrs. J. Murray and Co., the Secretary of the Incorporated Society of Authors should be asked to give an opinion on the terms offered by them; and further, that the whole matter be referred to the Finance Committee for report. The thanks of the Council were accorded to Mr. Wollaston for the trouble he had taken in the matter.\nXXXIX.\n\nJuly 5, 1904. Minute of Council, No. 7.\n\nMr. Fleet moved the adoption of the report of the Committee appointed by resolution No. 8 of June last. Resolved: That the general idea of a volume on Kharoshthi inscriptions to be entrusted to Prof. Rapson and Mr. Bergny be approved; that a letter be written to the India Office asking whether such a modification of the terms under which the Texts Series is published would be allowed as to allow the sum agreed upon for two octavo volumes with a few plates to be applied to the production of one quarto vol. with many plates, draft of such letter to be settled by a committee consisting of Messrs. Rapson, Thomas, Fleet, and Grierson; and that when Mr. Bergny's work has been received in its completed form, it be submitted to the same committee to report on the advisability of the publication of this work, edited and supplemented by Prof. Rapson, as a volume in the Texts Series.\n\nXL.\n\nJuly 5, 1904. Minute of Council, No. 8.\n\nThe Secretary undertook to submit a report to the October Council on the Authors selected and the details settled for the volumes on the Historical Geography of India.\n\nXLI.\n\nRoyal Asiatic Society,\n22, Albemarle Street,\nLondon, W.,\n\nSir,\n\nIn accordance with the authority given by your letter, R. and L. 1,473, dated the 3rd of November, 1903, the Council of this Society have had under consideration the advisability of proposing for publication in the Indian Texts Series a volume to contain all the known Kharoshthi inscriptions of ancient India on stone or metal, other than those of King Aśoka, which have already been published in a convenient form elsewhere.*\n\nIt has become clear, in the course of this inquiry, that the publication of such a volume would necessitate a departure in two directions from the scheme laid down for the Indian Text Series:\n\n1. It would involve a change of format. The octavo form is ill suited to the publication of inscriptions, and it would be advisable to abandon this for the form which has been found by experience most suitable for the purpose—viz., that adopted by the \"Epigraphia Indica.\"\n\n* The proposed volume would not include Kharoshthi inscriptions found elsewhere than in India—as, for instance, those discovered by Dr. Stein in Chinese Turkestan.\n2. It would have to be illustrated as fully as possible by facsimiles of all existing Kharoshthi inscriptions, so far as it is possible to obtain them. The illustrative plates should be included in the same volume as the letterpress, in such a way that each plate should appear close to the letterpress in which the inscription which it illustrates is discussed.\n\nThe former of these changes would not necessarily involve any additional expense, and in view of the fact that these inscriptions are not numerous, and are for the most part quite short, it is not likely that the cost of the letterpress would equal the amount allowed for the printing of a volume of the series—viz., £100.\n\nThe cost of illustrations, on the other hand, would very greatly exceed the amount allowed by the scheme for the illustration of a volume—viz., £10. It is not possible to give any accurate estimate of the cost of the illustrations until a preliminary inquiry has been made as to how far it will be possible to obtain from India estampages, or photographs, of the inscriptions which are known to exist, but the limit of the expense required for this purpose may safely be put at £200.\n\nThe total expense of the proposed volume would, therefore, probably be greater than the amount assigned by the scheme to the printing of one volume of the series, but it would certainly not exceed, and might be less than, the cost of two volumes of the Series.\n\nOf the ten volumes already sanctioned for five years, the authors and subjects of eight have been already chosen or sanctioned by the Government of India. There remain two volumes of which the authors and subjects are not yet settled, and the Council, by the letter above referred to, has been authorized to make suggestions as to these.\n\nUnder these circumstances I am desired to ask whether it would be permitted to apply the £500 already sanctioned for the two remaining volumes to the production of a single volume on the Kharoshthi inscriptions, such volume to contain the necessary plates, and to be of the size and shape necessary to enable each plate to appear near to the letterpress in which the inscription it refers to is explained.\n\nIn case the production of this one volume should cost less than the £500, the balance would, under the agreement, be available for the cost of any subsequent volume or volumes which the Government might authorize to be published in the Indian Texts Series.\n\nI have the honour to be, Sir,\n\nYour obedient Servant,\n\nT. W. Rhys Davids,\nSecretary.\nXLII.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n18th August, 1904.\nR. AND L. 1,026.\n\nSir,\n\nI am directed by the Secretary of State for India in Council to acknowledge the receipt of your letter of the —th July, 1904 (received 26th idem), in which you discuss the advisability of including in the Texts Series a volume by Professor Rapson on Kharoshṭhī Inscriptions of Ancient India.\n\nAssuming that it is desirable that such a work should be published—a matter which would rest with the Government of India, to whom the papers have been referred—Mr. Secretary Brodrick, after careful consideration, is disposed as at present advised to think that it might more fittingly be included in the \"Corpus Inscriptionum Indicarum.\" It is doubtless known to the Royal Asiatic Society that volume 2 of that series has been reserved for a work of this nature, and the publication under consideration would seem to carry out, at any rate in part, the proposed scheme. Should the Government of India concur in this view, Mr. Rapson's work would presumably be uniform in size with the third volume of the series, which is slightly larger than the first volume.\n\nOn receiving from the Government of India an expression of their wishes in the matter, a further communication will be addressed to you.\n\nI am, Sir,\n\nYour obedient Servant,\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nA. Godley.\n\nXLIII.\n\nOctober 11, 1904. Minute of Council, No. 6.\n\nThe Secretary made a report on the Authors selected and the details settled for the proposed volumes on the Historical Geography of India. The Authors selected were Prof. Macdonell for the Vedic period, the Editor for the Buddhist period, and Mr. Vincent Smith for a map to illustrate Alexander's invasion. Authors for other maps would have to be selected. There would be maps to illustrate the Kushan, Kshaharata, and Gupta Dynasties, and to show India as it stood in A.D. 650, with special reference to the Valabhi Kings, A.D. 750; Chalukya, A.D. 850; Rashtrakuṭas, A.D. 950; ditto, A.D. 1050; Cholas, 1150;\nLate Chalukyas and Kanauj, with perhaps another for the Hoysalas in A.D. 1250. The latter maps had been entrusted to Prof. Hultzsch; but he had now written to say that he could not undertake the work till next August, which was beyond the limit of time fixed. Probably Mr. Vincent Smith would undertake to begin the work at once if he were asked to do so. As to the form of the work, it was proposed to divide each map with squares with a capital letter over each at the top and a small letter opposite each on the sides, and to show the degrees also at the top and bottom and sides. The volume of maps would have an Index of names only, with references to the squares. The volume of letterpress to be in dictionary form, with a short article on each name, giving authorities. A general introduction and introductions (limited to about 10 pages) to each map would be added. Each map, except the Alexander one, to be a map of all India, and of the same size.\n\nResolved: That Mr. Pargiter should be asked to contribute a map to illustrate the geographical data in the Epics, and that room be made for this by omitting one of the later maps; that Prof. Hultzsch should be asked, in spite of the objection as to time, to undertake the other maps from the Gupta period onwards.\n\nXLIV.\n\nOctober 11, 1904. MINUTE OF COUNCIL, No. 14.\n\nLetter from the India Office on Mr. Rapson’s proposed volume on Kharoshthi Inscriptions was read.\n\nXLV.\n\nOctober, 1904. MINUTE OF COUNCIL, No. 15.\n\nOn the proposal of Mr. Wollaston himself, Mr. Grierson and Dr. Gaster were appointed a committee to consider and report on the publishing agreement with Mr. Murray; and the report of the Secretary to the Society of Authors upon that agreement was referred to that committee. So much of resolution No. 6, of July last, as referred the whole of this matter to the Finance Committee was hereby rescinded.\n\nXLVI.\n\nINDIA OFFICE,\nWHITEHALL,\nLONDON, S.W.,\n28th October, 1904.\nR. AND L. 1,436.\n\nSir,\n\nMr. Hill’s work on “The English in Bengal, 1756-57,” which is to fill the first three volumes of the Indian Records Series, is now in type (with the exception of the index), and\nmay be expected to be ready for publication within the next two or three months. A set of the proofs is forwarded here-with.\n\nUnder the scheme, the responsibility of publishing the work and placing it before the public rests with the Royal Asiatic Society. It will be necessary, however, to settle the number of copies to be distributed for the purpose of review, and Mr. Secretary Brodrick would be glad of an expression of opinion on the part of your Council on this point. A further question is whether copies are to be placed on sale in India, and, if so, whether this should be arranged by the Royal Asiatic Society or by the authorities in Calcutta. It will probably be necessary to make a reference to the Government of India, but Mr. Secretary Brodrick desires in the first instance to receive any observations your Council may wish to make on the subject.\n\nI am, Sir,\nYour obedient Servant,\nA. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nXLVII.\n\n(1).\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n2nd November, 1904.\nR. and L. 1,462\n\nSir,\n\nIn continuation of my letter, No. R. and L. 707, dated June 28th, 1904, I am directed by the Secretary of State for India in Council to forward a copy of a despatch received from the Government of India, intimating their approval of the proposals made for the illustration of Mr. Irvine’s version of Manucci’s “Storia da Mogor,” and sanctioning for this purpose an additional expenditure not exceeding £25 per volume.\n\nThe duplicate miniatures to which reference is made are Nos. 12 and 51 in M. Blochet’s list.\n\nI am, Sir,\nYour obedient Servant,\nA. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n(2). To the Right Hon. St. John Brodrick, His Majesty's Secretary of State for India.\n\nSIMLA,\n6th October, 1904.\nNo. 34 of 1904.\n\nSir,\n\nWe have the honour to refer to your despatch, No. 25 Public (Records), dated the 1st July, 1904, which deals with the question of increasing the allowance for illustrations in the case of certain of the volumes of the Texts and Records Series to be published on our behalf by the Royal Asiatic Society.\n\n2. After informing us of the additional expenditure of about £85 which you have sanctioned for the preparation of maps and plates for the late Dr. Wilson's \"Old Fort William,\" and for Mr. Hill's work on Bengal, you deal with a proposal made by Mr. Irvine that his four volumes of Manucci's History should be illustrated by the reproduction of a collection of miniatures, most of which are portraits of the Mogul Emperors and their principal nobles. You ask us to communicate our wishes with regard to this proposal.\n\n3. We agree with the arguments in favour of the suggestion made by Mr. Irvine in his letter of the 28th April, 1904, which accompanied your despatch, and we think that the illustrations will both increase the sale of the volumes and will also add greatly to the interest of the work. We are therefore of opinion that an additional expenditure of £25 per volume may be incurred for the illustrations. We also approve of the suggestion that the slight saving which will be effected by the omission of a duplicate miniature may be applied towards the provision of a map.\n\nWe have the honour to be, Sir,\n\nYour most obedient, humble servants,\n\nAMPTHILL.\nKITCHENER.\nE. F.G. LAW.\nE. R. ELLES.\nA. T. ARUNDEL.\nH. E. RICHARDS.\nJ. P. HEWETT.\n\nXLVIII.\n\nNovember 8, 1904. MINUTE OF COUNCIL, No. 12.\n\nResolved that a volume containing a classified list of the find places and other details of the recorded discoveries of ancient Indian coins be included in the Indian Texts Series; that that\nvolume be taken in hand as soon as possible, and that it be prepared under the supervision of Prof. Rapson in association with Dr. Codrington and Dr. Fleet as a consultative committee.\n\nXLIX.\n\nNovember 8, 1904. Minute of Council, No. 13.\n\nRead letter from the India Office, dated 2nd November, sanctioning £25 per volume extra for plates for Mr. Irvine's \"Manucci.\"\n\nL.\n\nNovember 8, 1904. Minute of Council, No. 14.\n\nLetter from the India Office on publishing arrangements referred to the Committee appointed by Resolution No. 15, of October, for report.\n\nDate of letter, 28th October, 1904.\n\nLI.\n\n(1).\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n16th November, 1904.\nR. and L. 1,492.\n\nSir,\n\nIn continuation of previous correspondence on the subject of the Indian Records Series, I am directed by the Secretary of State for India in Council to forward, for the information of the Council of the Royal Asiatic Society, a list of the works chosen by the Government of India to fill the ten volumes to which, as you are aware, the series was to be, in the first instance, limited.\n\nI am at the same time to inform you that the Government of India desire to extend the series by the addition of two, or possibly three, volumes on the early history of the city of Madras, to be compiled by Lieutenant-Colonel H. D. Love, R.E. They propose that these volumes should be issued after the publication of the works already selected—i.e., about the year 1908.\n\nMr. Secretary Brodrick would be glad to learn whether the Royal Asiatic Society is prepared to arrange for the publication of these extra volumes upon the same terms as the regular series.\n\nI am, Sir,\nYour obedient Servant,\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\n\nA. Godley.\n(2). INDIAN RECORDS SERIES.\n\n1903.\n\"Bengal in 1756-57,\" edited by S. C. Hill, vols. i. and ii.\n\n1904.\n\"Bengal in 1756-57,\" edited by S. C. Hill, vol. iii.\n\"Old Fort William,\" edited by Dr. Wilson, vol. i.\n\n1905.\n\"Old Fort William,\" edited by Dr. Wilson, vol. ii.\n\"The Diary, etc., of Streynsham Master, 1675-80,\" edited by Sir Richard Temple, vol. i.\n\n1906.\n\"The Diary, etc., of Streynsham Master, 1675-80,\" edited by Sir Richard Temple, vol. ii.\n\"Papers relating to Lord Clive,\" edited by G. W. Forrest, C.I.E., vol. i.\n\n1907.\n\"Papers relating to Lord Clive,\" edited by G. W. Forrest, C.I.E., vols. ii. and iii.\n\nLII.\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET,\nLONDON, W.,\n25th November, 1904.\n\nSir,\n\nThe Council of the Royal Asiatic Society, at their meeting on 8th November, 1904, accepted a proposal, made by Professor Rapson and seconded by Mr. Fleet:\n\n\"That a volume containing a classified list of the find-places and other details of the recorded discoveries of ancient Indian coins be included in the Indian Texts Series.\"\n\nThe purpose of this volume would be to bring together in the most convenient form all the historical evidence afforded by the numerous discoveries of ancient Indian coins which have been reported or described in archaeological reports, the Journals of the various Asiatic societies, and books and periodicals dealing with the subject of Indian antiquities and numismatics.\nIt is proposed to make a search through this large and widely-scattered literature, and to record the facts of each case in tabular form. There can be no doubt that such a record, giving a conspectus of the evidence afforded (1) by the coins themselves, (2) by the contents of the various hoards discovered, and (3) by the geographical distribution of the different classes of coins discovered, would be of great service to the study of the history of ancient India.\n\nProfessor Rapson undertook to draw up the plan of this work, to superintend its progress, and, if found advisable, to write a preface dealing with the main results which follow from this collection of the numismatic evidence. In carrying out this task he will have the advantage of consulting two members of the Council who are well known authorities on subjects of Indian archaeology—Dr. Codrington (Indian coins) and Mr. Fleet (Indian inscriptions).\n\nIt was proposed that the actual work of searching through the works above mentioned and tabulating the results shall be carried out by some person chosen by Professor Rapson and approved by the Council of the Royal Asiatic Society; and that the remuneration of £80 given to the compiler of one of the volumes of the Indian Texts Series should, in this instance, be devoted to the payment of the person so chosen and approved.\n\nUnder these circumstances I am desired by the Council to ask whether this volume may be included in the Indian Texts Series, and whether, under the terms of the letter from the Government of India, dated Simla, 1st October, 1903 (D.O. 182 Public), enclosed in your letter of the 3rd November, 1903 (R. and L. 1,473), arrangements may now be made for the preparation of this volume.\n\nI am, Sir,\n\nYour obedient Servant,\nT. W. Rhys Davids,\nSecretary.\n\nLIII.\n\nDecember 13, 1904. Minute of Council, No. 8. (Not confirmed.)\n\nReferring to the letter quoted in Resolution No. 13 of November, 1904, Mr. Irvine stated that, as the cost of the plates would be well under the special grant authorized by the India Office, and as the photographer stated that his charge would have to be increased unless he could be allowed to take all the photographs at once, it would be advisable to have all the plates prepared without waiting till the volumes of the letter-press were ready. The Hon. Treasurer, concurring, Resolved that the plates should be prepared accordingly, according to the estimates received from Messrs. Sauvanaud and Bemrose.\nLIV.\n\nDecember 13, 1904. Minute of Council, No. 9. (Not confirmed.)\n\nThe Secretary announced, with reference to Minute No. 6 of October last, that Professor Hultzsch was unable to undertake the work on the projected work on the historical geography of India.\n\nLV.\n\nDecember 13, 1904. Minute of Council, No. 13. (Not confirmed.)\n\nMr. Thomas moved to fill the remaining vacancy in the Indian Texts Series with a volume containing an Index to the Pali Tripitaka, by the Editor: and for the appointment of a sub-committee to report on the actual position of the completed scheme of the Indian Texts Series. The President ruled that this amounted to two motions, and put as the first the above motion down to the word \"Editor.\" Mr. Fleet moved as an amendment that the matter be postponed, and that, instead of the proposed work, a translation either of Buddhaghosa's Historical Introduction to the Samanta Pāsādikā, or of Santi Deva's Śikṣā Samuccaya, should be substituted. On a discussion, the amendment was lost (5 to 8). The motion was then put, and carried (8 to 5). The second motion, as above to the end, was then put and carried (8 to 5), and the President was requested to nominate the members of the sub-committee.\n\nLVI.\n\nDecember 13, 1904. Minute of Council, No. 14. (Not confirmed.)\n\nA motion by Mr. Fleet, seconded by Dr. Codrington, for issue of a printed compilation of correspondence and important resolutions of Council relating to the Indian Texts and Records Series was carried unanimously.\n\nLVII.\n\nDecember 13, 1904. Minute of Council, No. 15. (Not confirmed.)\n\nA motion by Mr. Fleet regarding the work on Historical Geography for the Indian Texts Series was postponed.\nLVIII.\n\nDecember 13, 1904. Minute of Council, No. 16.\n\nTwo reports were submitted by the Committee appointed by Resolution No. 15, of October, 1904, to report on the proposed publishing arrangement with Mr. Murray. One of these reports was signed by Mr. Wollaston, Mr. Grierson and Dr. Cust, the other by Mr. Kennedy, Dr. Codrington and Dr. Gaster. After discussion it was resolved that whereas it was desirable to act as far as possible in accordance with the wishes of the India Office, and it was not certain what those wishes were, the matter be left in the hands of the President, who was kind enough to undertake to interview Sir Arthur Godley on the subject.\n\nLIX.\n\nIndia Office,\nWhitehall,\nLondon, S.W.,\n14th December, 1904.\nR. and L. 1636.\n\nSir,\n\nI am directed by the Secretary of State for India in Council to acknowledge the receipt of your letter of the 25th November, 1904, proposing that a volume of the Texts Series be devoted to the publication of a classified list of the places where found and other details of the recorded discoveries of ancient Indian coins, to be prepared under the direction of Professor Rapson.\n\nAs this subject was not included in the proposals made by the Royal Asiatic Society in their letter of the 12th November, 1902, the matter is being referred for the consideration of the Government of India under the ruling contained in their letter in the Public Department, No. 60, dated 1st October, 1903, a copy of which accompanied my letter dated 3rd November, 1903, No. 1,473, R. and L.\n\nOn receipt of their reply a further communication will be addressed to you.\n\nI am, Sir,\n\nYour obedient Servant,\n\nHorace Walpole.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, W.\nSir,\n\nWith reference to recent correspondence respecting the Record Series, I am directed by the Secretary of State for India in Council to make the following observations:\n\nThe Series, as you are aware, has gradually been increasing in extent, and provision has now been made for the publication of 13 volumes of 500 copies each—making an aggregate of no less than 6,500 volumes.\n\nMr. Secretary Brodrick has been led to understand by the President of the Royal Asiatic Society that should it be deemed advisable in view of the magnitude of the undertaking to enter into direct negotiations with Mr. John Murray so as to secure the commercial advantages which a large firm of publishers is in a position to offer, in such case the Council would raise no opposition to this arrangement and would be prepared to cancel the scheme now in force.\n\nIn these circumstances, Mr. Secretary Brodrick is disposed to act upon this suggestion and I am to state that the arrangements relative to the Record Series may be considered as cancelled should the Council of the Royal Asiatic Society agree to that course.\n\nAs regards the Texts Series, however, I am to inform you that Mr. Secretary Brodrick will address the Government of India as to their wishes in the matter, and a further communication will in due course be sent to you upon the subject.\n\nI am, Sir,\n\nYour obedient Servant,\n\n(Signed) A. Godley.\n\nThe Secretary,\nRoyal Asiatic Society,\n22, Albemarle Street, S.W.\nLXI.\n\nROYAL ASIATIC SOCIETY,\n22, ALBEMARLE STREET,\nLONDON, W.,\nFebruary 16th, 1905.\n\nSIR,\n\nYour letter of the 11th January was laid before the Council of Tuesday last.\n\nI am requested to say that while the Society is prepared to carry out the arrangement proposed by your letter No. R. and L. 1735, of January 11th, yet if Mr. Secretary Brodrick should be of opinion that it would be for the advantage of the Record Series that it should be placed in the hands of a publisher the Society would be willing to agree to cancel the scheme now in force, as was explained by the President of the Society; and I am requested to enclose a copy of the Resolution No. 16* passed on this matter at the meeting of the Council held on the 13th of December, 1904.\n\nI have the honour to be, Sir,\n\nYour obedient Servant,\n\nT. W. RHYS DAVIDS,\nSecretary.\n\n* See No. LVIII.\nIndian Texts Series.\n\nREPORT OF THE SUB-COMMITTEE.\n\nThe Sub-committee appointed in pursuance of a resolution of Council, dated December 13, 1904, \"to report on the actual position of the completed scheme of the Indian Texts Series,\" and consisting of Sir Raymond West, Dr. Grierson, Messrs. Dames and Thomas, nominated members, together with the officers, begs to submit:\n\n1. Printed copies of the Correspondence and Minutes of Council relating to the Indian Texts and Records Series;\n\n2. The following report, containing an outline of the scheme therein devised, with an interpretation of the same and some proposals for consideration.\n\nI. The agreements constituting the \"Indian Texts Series\" have been made between two parties, the\nGovernment and the Royal Asiatic Society, and they include:\n\n(a) The publication of two volumes annually under the management of the Royal Asiatic Society, \"if, after a scrutiny of their estimate, which we have no means of making, your Lordship considers that their terms are reasonable\" (Correspondence, pp. 8, 9, para. No. 4, 5).*\n\n(b) The terms contained in the Memorandum of Terms (p. 9), with the Society's interpretation, pp. 10, 11, para. No. 2-5, and the assent of Government to the latter (p. 14).\n\n(c) A general sanction of the proposals contained in the Society's letter of November 12, 1902 (pp. 10-14).\n\n(d) The following specifications:\n\n1. Reservation to Government of the right (a) to decide \"what books should be published, and in what order\" (pp. 9, 14); (b) \"to initiate subjects for publication\" (pp. 19, 20, para. No. 3, 5).\n\n2. Reservation to the Royal Asiatic Society of \"the management of the Series\" (p. 8, para. No. 4) on its \"giving us their assistance in the matter of publication\" (p. 8, para. No. 2).\n\n3. Selection of Professor Rhys Davids as Editor (pp. 11, 19, para. No. 2), with authority (a) to choose the authors for the various volumes to be included in the Series (p. 20, para. No. 5); (b) \"to make arrangements for the preparation of some additional volumes beyond those already sanctioned\" up to a total of ten volumes, \"on the understanding that the subjects of the additional volumes will be taken from those enumerated in the Society's letter of November 12, 1902\" (pp. 24, 29), and with instructions (a) \"to\n\n* The fulfilment of this condition is implied in (b).\nmake use of Native Indian scholarship whenever it should be possible to do so” (pp. 4, 8, para. No. 4); and (b) “to see that this limit of size” (400 pp. 8vo. per volume) “is, as far as possible, adhered to” (p. 10, para. No. 2).\n\n4. Inclusion in the Series of the following volumes:\n\n(a) For 1903.—Arabic Text of the History of Gujarat, in two volumes* (p. 20, para. No. 4, pp. 23, 33), to be printed and published by the Society at a cost of £400, a guarantee against eventual loss to the Society being given by the Government (pp. 21-2, 24, 25, 30-1, 33, 35).\n\n(b) For 1904.—A collection of historical maps of India, in two† volumes (p. 13, para. No. 17, p. 20, para. No. 4, pp. 23, 28, 32, 33, 53).\n\n(c) For 1905-1906.—Manucci’s “Storia da Mogor,” in four volumes, containing illustrations at an extra cost of £25 per volume (pp. 22-3, 28, 30-34, 39-40, 42, 48-50, 52).\n\n(d) For 1907.—An Index to the names and subjects of Vedic Texts, in two volumes (p. 11, para. No. 8, p. 20, para. No. 4, pp. 23, 32, 33). See VIII. 6 infra.\n\n5. Suggestion on the part of Government that in general volumes should be produced “as they happen to be ready” (p. 20, para. No. 3).\n\nII. To the Government, therefore, are assigned:\n\n(a) The right to decide “what books should be published and in what order” (pp. 9, 14);\n\n(b) The right “to initiate subjects for publication” (pp. 19, 20, para. No. 3, 5);\n\n(c) The provision of the sum of £250, upon the publication of each volume, in full settle-\n\n* These volumes are to be additional to the two per annum provided for by the annual grant.\n\n† One volume is suggested on p. 33 (see recommendation infra).\nment of its financial responsibility (Memorandum of Terms, p. 9, para. No. 1, 8);\n\n(d) The approval of an Editor nominated by the Society (Memorandum of Terms, p. 9, para. No. 3).\n\nIII. To the Society are assigned:\n\n(a) The management and publication of the Series (p. 8, para. No. 2, 4), subject to the stipulations contained in the Memorandum of Terms, p. 9, para. No. 5-7;\n\n(b) The right of submitting \"to the India Office for sanction a list of texts, etc., to be taken in hand,\" and the obligation of being \"prepared to add thereto any texts the Government might desire to have added\" (Memorandum of Terms, p. 9, para. No. 4);\n\n(c) The distribution of the sum of £250 per volume;\n\n(d) The nomination of an Editor for the approval of the Authorities (Memorandum of Terms, p. 9, para. No. 3).\n\nIV. In connection with the functions thus left within the province of the Society, we find only one general regulation already sanctioned by the Council—namely, the regulation concerning proposals for new volumes when submitted by the Editor, which are to be referred to an expert Committee (p. 41).\nV. But the following additional works have been recommended to Government:\n\n(e) An edition in one or two volumes, with complete Index Verborum, of all the Kharoṣṭhī inscriptions on metal or stone, exclusive of the Aśoka Edicts (pp. 41, 44-45).\nRejected by the Government in favour of publication in the Corpus Inscriptionum Indicarum (p. 46);\n\n(f) A volume containing a classified list of the find-places and other details of the recorded discoveries of ancient Indian coins (pp. 49-50, 51-52).\nUnder consideration by the Government (p. 54);\n\n(g) An Index to the Pali Tripitaka, in one volume (p. 53).\n\nVI. And the choice of authors for the different volumes is as follows:\n\n(a) Professor E. D. Ross (pp. 16, 17, 22, 25, 30, 35);\n\n(b) Partly undecided (see pp. 23, 44, 46-47, 53);\n\n(c) Mr. W. Irvine (see Ref. ad 3);\n\n(d) Professor Macdonell (p. 23);\n\n[(e) Professor Rapson (pp. 44-46);]\n\n(f) An author, as yet unnamed, to work under the superintendence of Professor Rapson,\nDr. Codrington, and Dr. Fleet (pp. 52, 53, 54);\n(g) Professor Rhys Davids (p. 53).\n\nVII. It would seem desirable to make further rules of procedure, as follows:\n\n(a) As concerns III. (b) and IV., that every proposal for new volumes should, on provisional approval by the Council, be referred to an expert Committee, which should be instructed to take into its consideration any alternative suggestions which may be at the same time referred to it by the Council;\n\n(b) As concerns III. (c), that no financial proposals should come before the Council except on the recommendation and accompanied in each case by the report of the Finance Committee, and that, in default of fresh recommendations on the part of that Committee, the distribution of the sum of £250 per volume should be made in accordance with the scheme originally submitted to the Government* (pp. 4-5), provided always that in no case should the remuneration of Editor and Author exceed £30 and £80 respectively per volume; further, that the attention of\n\n* But left by Government unprejudiced by sanction (see Memorandum of Terms, p. 9).\nauthors should be drawn to the fact that, subject to the maximum of £80 aforesaid, the rate of remuneration is fixed by the sheet and not by the volume;*\n\n(c) As concerns I., 3 and III. (a) (including all questions between the Publisher and the Editor), that questions regarding transliteration and kindred matters should be referred to an expert Committee, and that the exterior of the volume should be settled by the Council on the recommendation of the Editor.\n\nVIII. The Sub-committee begs further to submit the following observations and recommendations:\n\n(a) In Mr. Risley's demi-official letter of November 19, 1903 (p. 33), the collection of Historical Maps of India, to which elsewhere (p. 20, para. No. 4, pp. 23, 28, 32) two volumes are assigned, is confined to one volume. It is a matter for consideration which arrangement is to hold good, and, in case the material is sufficient for two volumes, whether they would most conveniently be bound together in one cover;\n\n* There is therefore an inaccuracy in Mr. Wollaston's letter to Mr. Risley (Correspondence, p. 37). The remuneration of the Editor of the Text Series is left to the discretion of the Royal Asiatic Society.\n(b) It should be definitely ascertained from Professor Macdonell whether his proposed Index to the Names and Subjects of Vedic Texts will be sufficient to fill two volumes, as arranged, and whether the matter may not be more conveniently condensed into one volume, either of about 400 pages or possibly of somewhat larger size.\n", "source": "olmocr", "added": "2025-09-26", "created": "2025-09-26", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/correspondencebe00grearich_bw.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 72, "total-input-tokens": 102868, "total-output-tokens": 30628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 247, 5], [247, 1333, 6], [1333, 3933, 7], [3933, 6349, 8], [6349, 8562, 9], [8562, 10211, 10], [10211, 12243, 11], [12243, 14846, 12], [14846, 17012, 13], [17012, 19345, 14], [19345, 21957, 15], [21957, 24517, 16], [24517, 26874, 17], [26874, 28754, 18], [28754, 30637, 19], [30637, 32847, 20], [32847, 35035, 21], [35035, 37399, 22], [37399, 39423, 23], [39423, 41739, 24], [41739, 43575, 25], [43575, 45574, 26], [45574, 47684, 27], [47684, 49883, 28], [49883, 51653, 29], [51653, 53695, 30], [53695, 55803, 31], [55803, 57609, 32], [57609, 59621, 33], [59621, 61559, 34], [61559, 63565, 35], [63565, 65391, 36], [65391, 67338, 37], [67338, 69261, 38], [69261, 71076, 39], [71076, 72693, 40], [72693, 74471, 41], [74471, 76416, 42], [76416, 78493, 43], [78493, 80811, 44], [80811, 82780, 45], [82780, 84329, 46], [84329, 86236, 47], [86236, 88517, 48], [88517, 91041, 49], [91041, 93099, 50], [93099, 95245, 51], [95245, 96939, 52], [96939, 98874, 53], [98874, 100620, 54], [100620, 102028, 55], [102028, 104504, 56], [104504, 106190, 57], [106190, 107913, 58], [107913, 109374, 59], [109374, 110228, 60], [110228, 110963, 61], [110963, 112569, 62], [112569, 114207, 63], [114207, 115304, 64], [115304, 116279, 65], [116279, 117382, 66], [117382, 118568, 67], [118568, 118896, 68], [118896, 118896, 69], [118896, 118896, 70], [118896, 118896, 71], [118896, 118896, 72]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]