[{"id": "128ad049cdcd10d8c42db4ec3fabcf076008658c", "text": "ROYAL ASIATIC SOCIETY.\n\nTRANSLITERATION REPORT.\n\nReprinted from the \"Journal of the Royal Asiatic Society,\" October, 1896.\n\nPUBLISHED BY THE SOCIETY,\n22, ALBEMARLE STREET, LONDON, W.\n1896.\nTRANSLITERATION.\n\nThe subject of a uniform system of transliteration of Oriental characters has for a long time occupied the attention of the Council of the Royal Asiatic Society. In May, 1890, a Committee was formed, on the motion of Professor Sir M. Monier-Williams, K.C.I.E., to prepare a scheme, in conjunction with other learned societies, to be brought before the International Congress of Orientalists.\n\nAfter long deliberation and careful consideration of the scheme propounded by Professor the Right Hon. F. Max Müller, and accepted by the Oxford University Press, of the scheme adopted by the Government of India, on the recommendation of Sir W. W. Hunter, K.C.S.I., of the papers contributed by Sir M. Monier-Williams, K.C.I.E., to this Society's Journal in 1890, and to the proceedings of the Berlin Congress, and of the schemes adopted by the Société Asiatique, the Deutsche Morgenländische Gesellschaft, the Bengal Asiatic Society, and the Pāli Text Society, this Committee presented their Report to the Council held on the 8th of May, 1894. That report was adopted by the Council, and published in the Society's Journal for July, 1894.\n\nIn the autumn of that year the Tenth Oriental Congress was held at Geneva; and, on the motion of Lord Reay on behalf of the Society, a representative Commission was appointed to consider the subject. The Report of this Commission was presented to the Congress before it separated, and was adopted by the Congress. The scheme prepared by the Commission (containing two systems—one for Sanskrit and the other for Arabic) was ordered to be incorporated in the Proceedings of the Congress, and was recommended for adoption by all Orientalists. A translation of this scheme was published, with the Report, in the Society's Journal for October, 1895.\nThis Report states that—\"The Commission took as a basis for its work the Report of the Royal Asiatic Society's Special Committee, and the systems of transliteration usually adopted in France, in Germany, and by the Bengal Asiatic Society. The Commission does not pretend to have discovered a perfectly scientific system.\"\n\nThe Council is of opinion that it is advisable to take this opportunity of recommending the system thus placed before the world. Much care and pains have been taken over the subject, and there does not seem any probability of further steps being taken, at all events for some years to come. It has come to the decision, therefore, to recommend those Oriental scholars over whom it has influence to endeavour to adopt the system proposed by the Oriental Congress at Geneva. It observes, however, that there are some slight diversities between the scheme for Sanskrit and that for Arabic, and a few emendations have been suggested to bring them more fully into harmony. The Council, therefore, now republishes, together with its own resolution on the subject, the two systems suggested by the Geneva Congress; and adds a few suggestions (chiefly by way of harmonizing them), together with specimens of transliteration in various languages, so that all Oriental scholars may clearly understand what is recommended.\n\nThe following is the resolution that has consequently been passed:—\"Resolved that the Council of the Royal Asiatic Society, having given the most careful consideration to the Report on Transliteration prepared by the representative Commission appointed by the Oriental Congress at Geneva, while not entirely agreeing in all the details, gives the entire scheme its general approval; and earnestly recommends all connected with this country who are engaged in Oriental studies to set aside their own individual feelings and predilections, and, as far as possible, to employ this method of transliteration, in order that the very great benefit of a uniform system may be gradually adopted, and Oriental studies may thereby be facilitated.\"\nTABLE I.\n\nTRANSLITERATION OF THE SANSKRIT AND ALLIED ALPHABETS ADOPTED BY THE GENEVA CONGRESS.\n\n| Sanskrit | Latin |\n|----------|-------|\n| अ        | a     |\n| आ        | ā     |\n| इ        | i     |\n| ई        | ī     |\n| उ        | u     |\n| ऊ        | ū     |\n| ऋ        | r     |\n| ढ़        | ṛ     |\n| ण़        | ṣ     |\n| त़        | ṭ     |\n| थ़        | ṛh    |\n| द़        | ḍ     |\n| ध़        | ḍh    |\n| ऩ        | ṇ     |\n| त़        | t     |\n| थ़        | th    |\n| द़        | d     |\n| ध़        | dh    |\n| ऩ        | n     |\n| प़        | p     |\n| फ़        | ph    |\n| ब़        | b     |\n| भ़        | bh    |\n| म़        | m     |\n| य़        | y     |\n| ऱ        | r     |\n| ल़        | l     |\n\n| Sanskrit | Latin |\n|----------|-------|\n| अ        | a     |\n| आ        | ā     |\n| इ        | i     |\n| ई        | ī     |\n| उ        | u     |\n| ऊ        | ū     |\n| ऋ        | r     |\n| ढ़        | ṛ     |\n| ण़        | ṣ     |\n| त़        | ṭ     |\n| थ़        | ṛh    |\n| द़        | ḍ     |\n| ध़        | ḍh    |\n| ऩ        | ṇ     |\n| त़        | t     |\n| थ़        | th    |\n| द़        | d     |\n| ध़        | dh    |\n| ऩ        | n     |\n| प़        | p     |\n| फ़        | ph    |\n| ब़        | b     |\n| भ़        | bh    |\n| म़        | m     |\n| य़        | y     |\n| ऱ        | r     |\n| ल़        | l     |\n| Symbol | Description          |\n|--------|----------------------|\n| v      | Visarga              |\n| ś      | Jihvāmūliya         |\n| ṣ      | Upadhmanīya         |\n| s      | Avagraha            |\n| h      | Udatta               |\n| l      | Svarita              |\n| m      | Anudatta             |\n\nNote:\n- (in Pali l-) indicates the use of l in Pali script.\n- (Anusvāra, Niggahita) refers to the anusvara and nigrahita marks.\n- (Anunāsika) refers to the anunasika mark.\nTABLE II.\n\nTRANSLITERATION OF THE ARABIC ALPHABET ADOPTED BY THE GENEVA CONGRESS.\n\n[Notes in square brackets refer to pp. 6, 7.]\n\n| Arabic Letter | Transliteration |\n|---------------|-----------------|\n| ا at beginning of word | permissible gh |\n| ا omit; hamza elsewhere | f |\n| ب b | ق q |\n| ت t | ك k |\n| ث t permissible th | ل l |\n| ج j permissible dj | م m |\n| ح h | ن n |\n| خ h permissible kh | و w [or v, Note 5] |\n| د d | ه h |\n| ذ d permissible dh | ي y |\n| ر r | vowels - a, - i, - u |\n| ز z | lengthened ā, ī, ū |\n| س s | diphthongs āy and āw [ai and au, Note 4] |\n| ش s permissible sh | e and o may be used in place of ī and ū |\n| ص s [see Note 1] | also ē and ō in Indian dialects, ū and ō in Turkish |\n| ض d [ḍ, Note 2] | ل of article ال to be always l. |\n| ط t or ṭ [only ṭ, Note 3] | ظ z or ṛ |\nADDITIONAL IN PERSIAN, HINDI, AND PAKSHTŪ.\n\nپ \\( p \\)\nچ \\( c \\) permissible \\( ch \\)\nژ \\( z \\) permissible \\( zh \\)\nگ \\( g \\)\n\nTURKISH LETTERS.\n\nک when pronounced as \\( y \\),\n\\( k \\) is permitted.\nن \\( n \\)\n\nHINDI AND PAKSHTŪ.\n\nث or \\( t \\)\nذ or \\( d \\)\nض or \\( r \\)\n\nPAKSHTŪ LETTERS.\n\nخ \\( ts \\)\nج \\( g \\)\nن \\( n \\)\nش \\( ksh \\)\n\nAlso in India will be recognized \\( s \\) for \\( ص \\), \\( z \\) for \\( ض \\), and \\( z \\) for \\( ض \\).\n\nThe above scheme contains, it will be seen, two schemes—one for the transliteration of Sanskrit, Pāli, and the allied alphabets, and one for the transliteration of Arabic and the allied alphabets. These two tables are inconsistent with one another on several points. In applying the Congress scheme, therefore, to the transliteration of Hindi (which is written both with Sanskrit and Arabic letters) the same word would have to be transliterated differently according to the alphabet before the transliterator. These points are as follows:\n\n(1) The sound represented in English by \\( sh \\) is represented in the first table by \\( s \\), and in the second by \\( s \\) (\\( sh \\) being permissible). On the other hand, the \\( s \\) is used in the first table for the Sanskrit \\( ش \\) (\\( sh \\)) and in the second for \\( ص \\) (\\( z \\)). The practical difficulties arising from this discrepancy are, however, so small that the Council would merely point out the discrepancy.\n\n(2) The sign \\( d \\) is used in the Sanskrit table for \\( د \\) (the cerebral \\( d \\)), and in the Arabic table for \\( ض \\) (\\( dād \\)). This discrepancy could be avoided by selecting \\( d \\) for the \\( dād \\).\n(3) The alternative transliteration \\( t \\) allowed for \\( b \\) in the second table clashes with the use of the same sign in the first table. This alternative transliteration might be dropped out of Table II.\n\n(4) The diphthongs \\( ai \\) and \\( au \\) in the first table are replaced by \\( ay \\) and \\( aw \\) in the second. It would be better to adhere to the first table.\n\n(5) The transliteration \\( w \\) for the \\( , \\) in the Arabic table clashes with that proposed for the \\( \\text{श} \\) in the Sanskrit table. Both \\( v \\) and \\( w \\) might be allowed for each of these letters.\n\n(6) The sound represented by \\( ch \\) in the English orthography is transliterated \\( c \\) in the Sanskrit table, and \\( ç \\) (\\( ch \\) being permissible) in the second table. It would be more consistent to adopt \\( c \\) throughout.\n\nThere are also one or two other matters which are worthy of notice.\n\n(7) The signs \\( z \\) and \\( ź \\), and \\( d \\) and \\( t \\) are each of them used in Table II as the transliteration of two different letters.\n\n(8) No sign has been suggested in the Arabic table for the transliteration of the wasla. The comma above the line \\( ' \\) used in the table to represent the hamsa might be used for the wasla, and either a stroke or a circle above the line (‘ or ¢) might be used for the hamsa.\n\n(9) No sign has been suggested in the Arabic table for the silent \\( t \\). The sign \\( ḥ \\) might be used to represent this letter.\n\n(10) A stroke beneath the line (thus \\( ḫ \\) or \\( ṣ \\)) might be suggested to signify that a letter written in any alphabet to be transliterated is not to be pronounced.\nSubject to the suggestions above made, which will, the Council hopes, meet with the approval of Continental scholars, the following passages would illustrate the scheme as adopted by the Congress.\n\nSANSKRIT.\n\nṚg Veda : opening lines—\n\nAgním īle puróhitaṁ yajñásya devám ṛtvíjam hótāram ratnadhātamam.\nagnih púrvebhir íshibir ídyo nútanair úta sá deváṁ éhá vakṣati.\n\nNalopākhyāna : opening lines—\n\nĀsid rājā Nalo nāma Vīrasenasuto balī upapanno guṇaiḥ īśtair rūpavān aśvakovidah atiṣṭhan manujendrāṇāṁ mūrdhni devapatir yathā uparyupari sarvesāṁ āditya iva tejasā.\nDigha: opening words—\n\nEvam me sutaṁ. Ekāṁ samayāṁ bhagavā antarā ca Rājagahaṁ antarā ca Nālandāṁ addhānamaggapāṭipanno hoti mahatā bhikkhusaṅghena saddhiṁ pañca mattehi bhikkhusatehi.\n\nARABIC.\n\nOpening chapter of the Qurʾān—\n\nCh. ix, v. 1.\n\nCh. x, v. 14.\n\nBismi’llāhi’l-rahmāni’l-rahīmi. Al-hamdu lillāhi rabbī’l-‘alamīna’l-rahmāni’l-rahīmi māliki yaumī ’l-dīni. Īyāka na‘budu wa īyāka nasta‘īnu. Ihdinā ’l-sirāṭa’l-mustaqīma širāṭa’lladīna an’amta ‘alaihim gairi ’l-magdūbi ‘alaihim wa lā ’l-dāllīna.\n\nCh. ix, v. 1. — Barā’atun mina’llāhi wa rasūlihi ila ’lladīna ‘ahadtum mina ’l-musrikīna.\n\nCh. x, v. 14.—Wa jā’athum rusuluhum bi’l-baiyināti wa mā kānū liyu’minū.\nNotes—\n\nHamza at the beginning of a word is omitted, as prescribed on p. 5. Only the vowel is written. Ex. asad, a lion; plur. usd. Insān, a human being.\n\nHamza elsewhere—a stroke ' or circle °.\n\nWasla is represented by an apostrophe. See Note 8, p. 7.\n\nThe diphthongs have been written ai and au, not ay and aw. See Note 4, p. 7.\n\nPERSIAN.\n\nOpening words of the Gulistan—\n\nمَنْتُ خَدَائِرَا عَزَّ وَجَلَّ كَهُ طَاعَتَشْ مُوجَبَ فَرِيَاتَسْتَ وَبِشَكْر\n\nإِنَّ دَرَشَ مَزِيدَ نَعْمَتَ هُرَ نَفْسِيَ كَهُ فَرَوَ مَسْرُودَ سَمَدَ حَيَاَتَسْتَ وَجَوْن\n\nبَرَ نَبَيَادَ مَفَرَقَ ذَاتَ پَسَ دَرَهُ نَفْسِيَ دَوَ نَعْمَتَ مَوْجُودَسْتَ وَبَر\n\nهُرَ نَعْمَتَ شَكْرَیَ وَاجَبَ.\n\nMinnat ḥudāīrā ‘azza wa jalla kih ṭā‘ataş mūjib-i-qurbast. Wa bişukr andaraş mazid-i-ni‘mat. Har nafasī kih farū mīravad mumidd-i-hiyātat. Wa cūn bar niâyad mufarriq-i-zāt. Pas dar har nafasī dū ni‘mat maujūdast. Wa bar har ni‘matī şukrī wājib.\nThe Council would take this opportunity of suggesting the following scheme for the transliteration of Hebrew.\n\n| Hebrew | Latin |\n|--------|-------|\n| א      | a     |\n| ב      | b     |\n| ג      | g     |\n| ד      | d     |\n| ה      | h     |\n| ו      | v     |\n| ז      | z     |\n| ח      | ch    |\n| ט      | t     |\n| י      | y     |\n| כ      | k     |\n| ל      | l     |\n| מ      | m     |\n| נ      | n     |\n| ס      | s     |\n| ר      | r     |\n| ש      | sh    |\n| ת      | th    |\n| פ      | p     |\n\nDagges forte = double letter\nHEBREW.\n\nGENESIS I, 1-5.\n\nבראשית ברא אלהים את השמים ואת הארץ: והארץ היתה תהה ובהה וחשך על פניו תחומ רוח אלהים מרחפת על פניו הימים: ויאמר אלהים יאמר אלהים יאמר אלהים את הים כי טוב ויבא אלוהים בין הים כי טוב ויהי החשך: ויקראו אלהים את הים יומ ויהי השמש קרא לילה ויהי ערב ויהי בקר יום אחר:\n\nBore'si't bārā' 'ēlōhīm 'ēt hassāmayim v'ēt hā'āres. V'hā'āres hāy'tah tōhū vābōhū v'hōšek 'al p'nēi t'hôm. v'rūah 'ēlōhīm m'rahefet 'al p'nēi hammāyim. Vayyo'mer 'ēlōhīm yōhī 'ōr vayōhī 'ōr. Vayyar' 'ēlōhīm 'ēt hā'ōr ki tōb vayya'bdel 'ēlōhīm bēin hā'ōr ūbēin haḥōšek Vayyiqrā' 'ēlōhīm lā'ōr yōm v'laḥōšek qārā' lāy'lāh. vayōhī 'ereb vayōhī bōqer yōm 'ehād.\n| No. | TERMINI OF THE ROUTE | NAMES OF PTOLEMY'S STATIONS ALONG THE ROUTE | MODERN NAMES OF THE STATIONS ALONG THE ROUTE |\n|-----|----------------------|---------------------------------------------|---------------------------------------------|\n| I   | Euphrates to Sēra by way of Samarqand, Kashgar, and Akso (Marco Polo's route) | Marakanda—Auxakia—Issedon Skythikē—Damma—Piaia—Issedon Sērikē—Paliana—Thogara—Daxata—Sēra Métropolis. | Samarqand—Kashgar—Harshar—Filsan—Hamū—Pa-lin Hai Lake—Edisha (Marco Polo's) or I-tei-nay—Long-chou—Feng hsien—Hai-an Fu—Lo-yang, capital of China. |\n| II  | Southern route from the Euphrates to Sēra by way of the Stone Tower (mentioned by Ptolemy) | Marakanda—Lithinos Pyrgos—Issedon Sērikē, after which it followed the preceding route. | Samarqand—Khoten—(Lake Lob)—Edisha; and thence along the preceding. |\n| III | Khoto to Tibet and India | Lithinos Pyrgos—Kouta—Batang Kaisara—Arizasa—Arizapa—Batanagra—Labokla | Khoten—(Kirret)—Hante—Simla—Gurdaspur?—Hoshiarpur (or Amritsar)?—Batala?—Lahore. |\n| IV  | Chercian to Ablō | Fid Khauriana—Edana | Chercian to Ablō. |\n| V   | From Ablō Lake to Ablō | Fid Khauriana—Edana | Chercian to Ablō. |\n| VI  | Thokplung to Ablō | Stoma—Heorta—Rhapha—Kanogria—Kasada—Samapura—Edana | Thok-plung—Tiruta—Reyong-rival Lake—Samapura—Stambhā—Leotong (Takshamba)—Ablō. |\n| VII | Thokplung to Delhi, via the Daka Pass | Stoma—Passula—Margura—Orma—Sanchaka—Sārā—Sambalaka (1) | Thok-plung—Ganek—Daka—Shingur—Sukerch (or Bijapur)—Samalak (or Simpla?) near Delhi. |\n| VIII | From Delhi to China | Fid Urathnēni—Arkhina—Orosana—Asanabara—Sadoga—Edana | Fid Urathnēni—Arkhina—Orosana—Asanabara—Sadoga—Edana |\n| IX  | China to Tibet | Fid Urathnēni—Salatha—Pandasa—Pestunna—Adenaga—Arizabam Marura—Sahara | Wu-chou—Ha-k'ou (Tu-sien-lu)—Sein—Shahondo—Sidong—Ablō. |\n| X   | Sutchuen to Burmā (and Bengal) | Fid Urathnēni—Salatha—Pandasa—Pestunna—Adenaga—Arizabam Marura—Sahara | Wu-chou—Ha-k'ou (Tu-sien-lu)—Sein—Shahondo—Sidong—Ablō. |\n| XI  | Nanking to Yunnan | Fid Kokonagara—Rhadamanokota—Kimara—Pandasa | Kiu-kiang—Kwei-yang (or Shih-ch'ien)—Hein-yi—Lin-an Fu (or Yunnan Lake). |\n| XII | Yunnan to Gulf of Martaban | Fid Pestunna—Rhinghiri—L. Latrana—Pandasa—Edanga | Fēng-ngai (Tai Lake)—Ch'eng-tung (Kiang-hung)—1. M. Lai—(Taihwa)—Rangoon on Gulf of Martaban. |\n| XIII | Laos to Tonkin | Fid Doura—Barvokora—Kortaiha Métropolis | 1. Luang Phrabang—M. Phien (Chiang-Khwang)—Khiu-dit (Hainh). [Song-kien route.] |\n| XIV | Across the Malay Peninsula (Krub Istham) | Takola—Balonga | 2. Luang Phrabang—M. Phien (Chiang-Khwang)—Khiu-dit (Hainh). [Song-kien route.] |\n| XV  | Sea-route from the Persian Gulf to India and China. | Touching Malibolos—Aphérion—Palura or Pakura; thence across to Sada; then by way of Tēmaia, Golden Kieronos; Takola—Zaba—Kattigara. | Pak-a-Chum—Chun—near the Irrawaddy River. |\n| XVI | Sea-route from the south of India or Ceylon to the Sumatra Archipelago (Palembang in Sumatra). | Sighting on route Argyrē, the Barusāi, Sindai, Sahalelai, and ending the journey at Labadun. Perhaps the ships continued sometimes to China, via the Sityrōn islands. | Manipulatam—Gopudra—Puri Bluff (above the mouth of the Ganges); chance access to Sundarbans; then by way of Cape Comorin to the mouth of the Tākāla River, the Mahanadi River—Hari-cum. This is the sea-route mentioned by Ptolemy himself. It may be looked upon as certain that besides the above-mentioned principal points on route, the ships in Ptolemy's time touched also at Akādra (Koh Tron or Hatton Harbour) and at Rakhāna (Canton). |\n| XVII | Hung-chou to Nanking | Road leading from the metropolis of Sinaï to the haven of Kattigara, running in a south-west direction. (Ptol., lib. i, c. 17, §5.) | Old mandarin road from Hang-chou to Nanking. N.R.—For 'south-west,' read 'north-west,' owing to the coast of China having been erroneously held by Ptolemy to turn southward instead of northward. |\n\n**Note.**—The stations added by the Latin translator of Ptolemy's treatise, such as Gulf of the Sinai, etc., were purposely omitted from the present list and from the map, as there is no proof that they were known in Ptolemy's time.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transliterationr00roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 35800, "total-output-tokens": 6663, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 189, 3], [189, 189, 4], [189, 189, 5], [189, 189, 6], [189, 1986, 7], [1986, 4060, 8], [4060, 5415, 9], [5415, 5891, 10], [5891, 6702, 11], [6702, 8311, 12], [8311, 9923, 13], [9923, 10487, 14], [10487, 11155, 15], [11155, 12068, 16], [12068, 12608, 17], [12608, 13255, 18], [13255, 13255, 19], [13255, 13255, 20], [13255, 13255, 21], [13255, 13255, 22], [13255, 17437, 23], [17437, 17437, 24], [17437, 17437, 25], [17437, 17437, 26]], "primary_language": ["en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, true, false, false, false, false, false, true, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]