[{"id": "517e6f4b3da3c9bade9a6590cd21e52f3d19f63f", "text": "PAPERS\n\nON THE\n\nCULTIVATION OF COTTON\n\nIN\n\nINDIA.\n\nCOMMITTEE OF COMMERCE AND AGRICULTURE\nOF THE ROYAL ASIATIC SOCIETY.\n\nLONDON:\nPRINTED BY HARRISON AND CO.,\n45, ST. MARTIN'S LANE.\n\nM.DCCC.XI.\nSee also item 3A.\nON THE\n\nINTRODUCTION OF PERNAMBUCO COTTON\n\nON THE\n\nWESTERN SIDE OF INDIA.\n\nBy CHARLES LUSH, M.D., Bombay Medical Establishment.\n\nThe appearance of Major-General Briggs's excellent paper on Cotton, has rendered it unnecessary to recount the obstacles which experimentalists in India have met with, in substituting North American cotton for the inferior annual crops of the Indian peninsula. The causes of the want of success in growing cotton from North American seed on the Bombay side of India, of a quality equal to the original, were pointed out in a report I made to the Government, which was published after the experiments intrusted to me were completed in 1836. Since that time the general result of experiments on Upland Georgian cottons, not only in the southern part of India, but even as high up as Delhi, (according to extracts from a correspondence of an American gentleman lately published in the Athenæum,) has been a failure. To those who were still sanguine on this one point, I should imagine that the facts collected by General Briggs would be conclusive. But if more be required, let them ask how many bales of good clean cotton grown in India from American seed have made their appearance in the market since the year 1829, when the Court of Directors of the East India Company began to send out supplies of seed of that description, and to urge the Indian governments to institute experiments. The several agricultural societies and chambers of commerce have been active in importing and distributing seed, and disseminating information; but where are the commercial results?\n\nEvery impartial reader of General Briggs's résumé of the important national question of growing superior cotton in India, must feel convinced that this is no simple affair to be decided by sending out to India, American seed, American planters and pickers, and American\nsaw-gins, even presuming that such means will fulfil their end to the utmost. It is a complicated and many-headed question, to be taken up in detail. May I be permitted to request the attention of the Committee to one fraction only of this extensive subject?\n\nIs there any species of cotton which will not only bring a high price in the market, but capable of an almost indefinite increase of consumption, which, under favourable circumstances, will not degenerate, will be an addition to the present produce of the country, not a substitution, and one capable of being cleaned [seeded] by the most simple machinery, or even by the hand?\n\nI believe the Pernambuco cotton will fulfil these several conditions. I take the liberty of quoting from the pamphlet* already alluded to, and cited by General Briggs, the following passages:\n\n\"The Pernambuco, or kidney cotton, (Gossypium acuminatum of Roxburgh,) is already naturalized in this country [India], but in peculiar situations, old gardens of red lateritic† soil, as at Belgam and Darwar, and hedges where ashes are thrown. What we call 'black cotton soil,' when unmixed, appears almost poisonous to it, especially if irrigated. In the latter case it bears rotten abortive pods, and neither the seed nor the cotton comes to perfection. In part of the experimental farm near Broach (Guzerat), where the black soil was mixed with red sand, it grew sufficiently well.\n\n\"At the Seegeehullee farm ‡ (Southern Maratha country), whether irrigated or left dry, it grew straggling and produced nothing. At Dapooree near Poona, in black soil, it has never ripened its seed, but produces shrivelled, half-formed pods. It is therefore clear that whenever favourable localities are found for this cotton, it will be an addition to the produce of the country, not a substitute of a doubtful and varying crop for a certainty§.\"\n\nA reference to Koster's Travels in Brazil will give ample information on this cotton. It appears from his statement that it flourishes most in high and dry places where the soil is red or mixed with yellow, and it seems to be manured by the ashes of newly cleared jungle, which is its favourite site.\n\n* Written in 1836.\n† For a description of Laterite, vide F. Buchanan's (Hamilton) Journey to Mysore, &c. &c.\n‡ Black soil.\n§ This alludes to the unsuccessful attempts to substitute \"Upland Georgias\" for \"Surats.\"\n\"Of the Pernambuco cotton it still remains to import seed as it does not abound, to naturalize it and then to search for tracts of country where it is likely to succeed on a large scale. The circumstance of its growing in many spots [in India] with a staple equal to the original, is a clear proof that it may be got to produce permanently a long staple, which no other kind in this part of India has yet been proved to do.\"\n\nThe main difficulty would seem to be to find sufficient land in the neighbourhood of the Western Ghats, unappropriated by more profitable or favourite crops, to grow this Pernambuco staple on a large scale. Of the provinces I have visited, I should consider the Wynnaad the most promising; in fact, wherever there is a sufficient tract of sandy alluvial at the bases of the higher primary, and trap rocks, anywhere but the districts of \"black cotton soil\" will afford good hope of success. Much sandy and gravelly soil, similar to that in which the Pernambuco has been seen to grow in an undegenerated state, is to be found in several of the Western Talooks of the Southern Maratha country. The following passage is from the interesting statistical report of Mr. Thomas Marshall, printed by the Bombay Government in 1822, and describes the soil and situations required, which, when I was employed in those districts up to 1835, were still unappropriated.\n\n\"The certainty that the high gravelly plains will not bear profitable crops of grain, and the almost equal certainty that they will bear trees and shrubs, naturally suggest the inquiry whether they may not be advantageously turned to the culture of some plants of shrubby growth, not requiring either much shelter or any great nicety of treatment. The two which occur to me as offering the best prospect of success, are the coffee, and the Bourbon cotton plants. The former grows in almost every situation where it has been tried, and though it be far more productive in rich soils, its berry is of a much superior quality in poor lands, and such is certainly its native soil of Arabia. The Bourbon cotton* is, I understand, remarked for succeeding best on rather high gravelly lands where the water does not lie, and no useful plant seems to require so little care. The violence of the southwest monsoon might perhaps confine the culture of these plants to the eastern aspects of these high plains, but spontaneous shrubs seem to grow equally well on either exposure.\" — Statistical Report on the Talook of Belgam, p. 61.\n\n* Straggling plants of Bourbon, as well as of Pernambuco, cotton, are found in this district, but the Pernambuco is the better staple.\nThe seeds of the Pernambuco cotton being situated in the centre of the division of the pod and adhering together, and but slightly connected with the fibre, can be readily separated from the staple by the human hand. Where labour is plentiful and expedition an object, it can be immediately prepared for the market after gathering, and be freed from the admixture of leaf and dirt, by undergoing a hand picking simultaneously with the separation of the seed. Thus, as regards this cotton, all difficulties about churkas, and roller, and saw-gins are avoided.\n\nIn order to show what prospect there is of success in the market for an increased supply of cotton, of the Pernambuco quality, I have sought for and obtained the following information, from a merchant of Bombay, well acquainted with the cotton market here and in India, in a letter dated Liverpool, 17th October, 1839.\n\n\"Since I have been here, I have made many inquiries respecting the usefulness of Pernambuco cotton, and the information I have gained here, has been confirmed by the opinion of several individuals extensively engaged in cotton manufactures in Manchester and Glasgow. It may therefore be relied on as pretty correct.\n\n\"You must, however, recollect that spinners and manufacturers have a great dislike to change the cotton which they are in the habit of using, some machinery being better adapted for one sort than for another. Also, it must be borne in mind, that in estimating the probable increase of Pernambuco, supposing it can be supplied at a cheaper rate, (even manufacturers are liable to be deceived;) but I think that they err on the safe side, owing to the disinclination to change just alluded to. This disinclination to change, however, disappears as soon as they can discover distinctly that it is their interest to do so. There is so much competition amongst them, that every one is obliged for his own preservation to adopt every improvement, and to study with the utmost nicety the means of producing the best cotton-yarn or goods at the lowest possible price. Perhaps you are not aware that the trade of a spinner is quite distinct from that of a manufacturer, although it not unfrequently happens that the same person is both. A spinner spins only cotton-yarn, a manufacturer weaves the yarn into cloth. But there is a large proportion of cotton-yarn, or thread, spun to be exported to foreign countries, and which, therefore, is not used by the manufacturer at all.\n\n\"The quantity of cotton-yarn exported last year amounted to 113,753,197 lbs. weight. Pernambuco cotton might be used with\ngreat advantage in making a large proportion of this sort of cotton-yarn, (supposing always that the price be sufficiently low.) If it could be supplied as cheaply as fair bowed American cotton, we might safely estimate its consumption for this particular purpose at 60,000,000 lbs. weight, which will make 150,000 bales of 400 lbs. each.\n\n\"The quantity of cotton used in Great Britain for manufacturing goods or cloth last year, may be taken in good round numbers at 250,000,000 lbs. There are two kinds of yarn or thread used in making cloth, one called the warp, which runs lengthways, the other called the weft, which runs across. Pernambuco cotton would do very well for the former; but a shorter and finer staple is preferred for the latter, and even at the same price American cotton would probably be taken for the purpose.\n\n\"Surat cotton, if clean, answers this purpose exceedingly well.\n\n\"If we deduct from the 250,000,000 lbs. used in manufacturing goods, the weight of cotton used as weft, for which Pernambuco is not applicable, and also the weight of articles of low price, such as candle-wicks, waddings, paper, &c., which can be made of the refuse of inferior kinds of cotton, there will remain perhaps 100,000,000 lbs. for which Pernambuco is the best adapted of any cotton known, which would amount to 250,000 bales of 400 lbs. each.\n\n\"We should thus have an annual consumption of 400,000 bales, supposing the price to be as low as American, which at the present time may be taken at 7½d. to 8d. per pound, giving a total value of 6,500,000l.\n\n\"The following is a statement of the entire consumption of cotton in England and Scotland during the year 1838.\n\n| Bales | Average weight | Total weight | Extreme prices |\n|-------|----------------|--------------|----------------|\n|       |                |              | Jan. 4, 1839   |\n| American cotton | 938,163 | 373lbs. | 349,936,664 | 7d. to 9½d. per lb. |\n| Brazil | 147,392 | 171 | 25,204,032 | 9½d. ,, 10¾d. ,, |\n| Egyptian | 40,273 | 284 | 11,437,532 | 12½d. ,, 17d. ,, |\n| East India | 94,468 | 363 | 34,291,884 | 5½d. ,, 6¾d. ,, |\n| West India | 16,519 | 316 | 5,220,004 | 7d. ,, 9d. ,, |\n\n\"American sea-island was worth at the same time from 17d. to 2s. 3d. per pound, and choice marks as high as 3s. per pound.\n\n\"I enclose a letter from very respectable cotton brokers here, which I think will give you all the additional information you may require.\"\nLiverpool, October 17, 1839.\n\nSir,\n\nWith regard to the queries you have put to us, we beg to hand you the following answers, viz:\n\n1st. Do you consider Pernambuco cotton of a quality suited to the general use of spinners and manufacturers?\n\nAns. Yes, Pernambuco cotton would be generally used if it could be got in quantity at the price of good fair boweds.\n\n2nd. Would manufacturers use a larger quantity of Pernambuco, if it could be sold to them at a lower price than it now bears, compared with other kinds of cotton?\n\nAns. Most certainly: at $1\\frac{1}{2}d.$ less, three times the quantity.\n\n3rd. Is there any price at which Pernambuco would be used generally, to the exclusion of short-stapled American cotton, and what that price may be, supposing bowed cotton of fair to good fair quality to be worth $7\\frac{1}{2}d.$ per pound?\n\nAns. It would be preferred to fair Orleans, and used in any quantity that could be produced, for it is a better cotton than American, and would command a preference at $7\\frac{1}{2}d.$ to $8d.$ per pound, to fair American at $7d.$, and good fair at $7\\frac{1}{2}d.$ per pound.\n\n4th. To what extent would the consumption of Pernambuco be carried, if it could be supplied in any quantity at the same prices as boweds of fair to good fair quality, estimating the whole consumption of the kingdom at 1,200,000 bales?\n\nAns. The extent could not be calculated, we could almost say, to any extent if well cleaned, for twist and reeled yarn for export, home use, say 300,000 to 400,000 bales of 400 lbs. each per annum.\n\nA. S. Finlay, Esq.\n\n(Signed) GLADSTONE and SERJEANTSON.\nREPORT\n\nOF THE\n\nCOTTON COMMITTEE OF THE AGRICULTURAL AND HORTICULTURAL SOCIETY OF INDIA.\n\nPreamble.\n\nYour Committee remark that it will be, no doubt, in the recollection of the Society, that their assistance and co-operation in the furtherance of the views of the home authorities for the improvement of the cotton cultivation with the presidency of Bengal, including the north-western provinces, has been requested by Government; that the Society have been informed by Mr. Secretary Halliday by his letter, under date the 22nd of October last, that several American workmen, expected to arrive in Calcutta in the month of December, 1839, would be placed under their directions and orders, should the Society undertake the charge, that in 'reply' the Government were informed, that the Society accepted the proffered trust; and that the Cotton Committee, reinforced by several Members conversant with the subject under discussion, have been in consequence requested to prepare a report, and propose a plan for carrying into execution the contemplated project.\n\nYour Committee having taken the subject matter referred to them into their most serious consideration, are of opinion, that it will be advisable to discuss the subject under the various heads which naturally suggest themselves.\n\nI. Station and Disposal of the American Workmen.\n\nThe stations at which the workmen should be located, and the mode of disposing of them.\n\nAs only three American cultivators and four machine workmen\nare intended by the Government to be assigned to the Bengal Presidency, it will be necessary to place at each selected station one cultivator and one machine workman, to be disposed of hereafter as circumstances may suggest. It would doubtless have been advisable for obvious reasons, had the number of workmen which your Committee originally had been informed were to be assigned to this Presidency been placed at the disposal of the Society, to have located the cultivators by pairs, to prevent the delays and inconveniences likely to ensue from sickness and other similar causes; but as the number is so much restricted, your Committee are of opinion they should be located at three Sudder stations, in the neighbourhood of which the best cotton is grown, and to abandon for the present any intention of trying experiments in those parts of the Presidency where the least doubt as to success may be entertained.\n\nYour Committee are of opinion that the stations for the workmen should be in the north-western provinces, and entirely on the right bank of the river Jumna, the cotton cultivation in that part of the country being so far superior to the Doobab cotton, that the latter is extensively imported into Bundelcund, for the fraudulent purpose of being mixed up with the Banda and Jalown cotton.\n\nThe stations selected by your Committee are, 1st, Agra,—2nd, Banda, in Bundelcund,—3rd, Jubulpore, in the Saugor and Nerbudda territories.\n\nYour Committee have not failed to take into consideration in the selection of the stations, the necessity of placing them in situations where facilities of transport abound. It is obvious that there can be no reasonable objection made to the extension of operations by the Society to these districts, from which private speculators can with profit transport cotton to Calcutta for sale, on the score of difficulty of access, or deficiency of transport, and other similar impediments; but the facilities and the selected stations, it is known to your Committee, much exceed any difficulties which may be expected to arise, for Agra and Bundelcund are situated close to the river Jumna; and from Jubulpore to Mirzapur, on the banks of the Ganges, the great cotton mart of the north-western provinces, a bridged and metalled road of 269 miles in length, equal to any in England, has been made by Government; and at all the stations the means of transport, namely, to the river, hackeries, camels, and bulloeks; and on the river boats of every description abound.\nII. Duties of the Workmen and their Assistants.\n\nYour Committee are fully impressed with the conviction that, in order fully to carry out the wishes of the Government and of the Home Authorities, an experiment of cotton should be undertaken on a grand scale, for which purpose a quantity of land should be cultivated, under the special superintendence of the Society, and on the principle of Neez cultivation; and they should also take a considerable quantity of land to be cultivated according to the Ryottee system. The Neez cultivation should be situated close to the Sudder stations of the workmen, and should not exceed the number of acres each workman can personally superintend, both in the ploughing, in the sowing, in the weeding, and in the gathering of the cotton crop. The quantity should not be less than two hundred acres for each workman, and the soil should be the average cotton soil of the district, and not the choice garden grounds. The Ryottee cultivation may with advantage extend to a considerable distance from the stations, and the quantity of land should be, the extent the workmen and their assistants can with facility properly superintend. As the villagers refuse to let the whole of the land of their villages for any particular crop, and as some parts of the land are more favourably suited for cotton cultivation than others; for instance, the land close to Nullahs answers best in the Nerbudda valley: the Ryottec cultivation will extend to a considerable distance from the Sudder station. It therefore appears to your Committee requisite to assign to each workman—first, an associate or assistant conversant with the language and agricultural processes of the country; and second, Zilladers selected from the best cotton cultivators, who will be placed each in charge of small districts, under the superintendence of the American workmen.\n\nThe duty of associates or assistants should be to act as interpreters to the workmen, and to aid and assist them in every way they may be required; but they are to be considered subordinate, and under the orders of the workmen. The difficulty of obtaining persons qualified for such duties in the north-western provinces your Committee acknowledge; but they would suggest that the local authorities of the districts in which the workmen will be located should be consulted, both as to the selection, the rate of pay, and other subsidiary arrangements, before any final decision be arrived at.\nIII. Cultivation of the Cotton.\n\nThe Zilladars, who must be inhabitants of the cotton districts, should be selected by workmen with the sanction of the agent of the Society, and to them a salary of six rupees per mensem should be assigned. A liberal salary has been suggested, in order that the best men may be procured, and to remunerate them for the sacrifices they will have to make in given up prejudices, and in performing duties to which they are unaccustomed.\n\nThe Neez cultivation should be kept up more as a pattern for the agriculturist, and as evidence of what may be done by care, attention, and skill, and for the purpose of acclimating and bringing into general notice foreign seed; but the workmen should likewise be left at liberty to cultivate on their khas lands the indigenous cotton of the country, with a view to its eventual improvement, and to ascertain to what extent it can be brought to the perfection necessary to cause it to compete with American cotton.\n\nThe object of the Ryottee cultivation should be principally for the culture of the best indigenous cotton. The seed should be furnished by the Society, and should consist of the country, that is, Dosse, seed of the best description procurable, and free from all admixture with other grain. The land should, when procurable on such terms, be rented from the Zemindar, or the person to whom it has been let; and the rentee should engage to plough, and sow the land and reap the crop, under the superintendence and according to the directions of the American workmen and their assistants; they should, by their cubolents, be bound under a penalty to prepare the land according to a prescribed system, not to sow, as they usually do, other grain with the cotton; to weed the crops when required by the workmen, and to pick the cotton at such times, and in such a manner, as the workmen may direct.\n\nYour Committee observe that these measures and precautions will ensure the growth of the best native crops, and will enable the workmen to collect and transmit to the Society cotton cleaned by machinery, well picked and free from dirt or leaves.\n\nIV. Payment for the Culture.\n\nThe payment to Ryotts or Zemindars should be a certain sum per maund over and above the bazar rate, deducting the land rent: but in cases where the Society may rent land from the Zemindars,\nand have it cultivated by the Ryotts, if possible, on the above conditions, and they should in a similar manner be remunerated for their labour. It will be obvious, that by this intermixture of Neez and Ryottee cultivation, the former cultivated exclusively by the workmen and the latter by the Ryotts, subject to the superintendence of the workmen and their assistants, we shall obtain the best description of cotton, both from foreign and native seeds, with no more expense in the Ryottee cultivation than the cost of superintendence, and the premium over and above the market price of cotton; we shall diffuse the superior knowledge and manner of proceeding of the American system; we shall educate a body of at least eighty or one hundred intelligent natives into the mysteries of the new and improved system of agriculture, and the Society will have at their service, in the course of a couple of years, a body of well-instructed agriculturists, fit to form stations to educate more pupils, all to be obtained at a small price, comparatively speaking; for the superior nature of the cotton produced under such advantageous circumstances, will, we may calculate on with great certainty, nearly repay the expenses incurred by the experiment. It should, the Committee observe, always be borne in mind, that the chief object of our ambition should be rather to improve the produce of the country, and to stimulate the people to adopt our improvements, than to introduce seeds or new agricultural implements, which may or may not succeed, and that we can, comparatively speaking, do little good by Neez cultivation, except with the view above mentioned.\n\nV. SUPERINTENDENCE.\n\nThe aid of the Commissioners of Revenue, or of the Collectors of the Districts, or both, will be essentially necessary for the superintending, advising, and guiding in a general way the workmen, who should be directed always to apply to them for advice and assistance when requisite: and your Committee are of opinion that the Huzor Tehsil Peshkars of each district should be the officers selected by the local officers to choose the fields, make the previous arrangements and bargains for the land, and to pay the rent and make the requisite advances; but the purchase money of the cotton, which will be sent to Calcutta to the Society, the workmen should pay. Your Committee further desire to observe, that the civil servants of the Government in charge of districts, although perfectly competent, and no\ndoubt willing, to afford the Society all general aid and assistance, yet their proper avocations will in general prevent their undertaking any minute supervision, and it would therefore be advisable to appoint at each station a person of weight, influence, and general knowledge of the custom of the agricultural classes as agents to the Society. At Agra, it is understood Dr. Falconer's servicees will be available for this purpose: and at Jubulpore, Lieutenant Charles Brown, Junior Assistant to the Commissioner, will willingly grant his valuable aid: but in Bundlecund, there is no information before them by which your Committee can be guided in their choice, but they entertain no doubt but that a competent person willing to afford his assistance will be found either at Banda or Culpee. It has been suggested that the Omlahs attached to the opium department of Bundlecund, who have lately been discharged on the abandonment of the opium cultivation in that province, may be available for the cotton experiment; and your Committee would recommend that this suggestion should be taken into consideration, and if approved of and deemed expedient, adopted.\n\nThe cultivators and assistants should report progress periodically to the Society through the agent, and should also furnish copies of their reports to the Commissioner of the division, who should be requested to favour the Society.\n\nVI. Calculation of the Expense of the Experiments.\n\nYour Committee observe, that in ignorance of the agreements made by the Honourable Court of Directors with the American workmen, and from the nature of the proposed measures, it will not be possible to prepare an estimate of the expenditure which will be required to work out the scheme, except in regard to the assistants and to the Zilladars, whose salaries will probably be as follows:\n\n3 Assistants, 300 Rupees each . . . . . . . . . . . . 900\n60 Zilladars, at 6 Rupees each . . . . . . . . . . . . 360\nOffice expenses, peons, &c., for each station, 100 . . . 300\n\nCo.'s Rs. per mensem . . . . . . . . . . . . 1560\n\nFinally, on this point your Committee are of opinion that the labours of the Secretary to the Society will be much increased by the correspondence which the agents and local officers will hold with the\nSociety on the subject of this interesting experiment; and although they are not at present prepared to suggest any specific addition to his salary and to his office establishment, yet they consider it but just and proper to draw your attention to the subject, with a view to future consideration.\n\nVII. Premia.\n\nThe premia to be offered in accordance with the intentions of the Home Government will be best divided, the Committee think, into two scales of rewards, the first division or scale to be for the management of the cotton cultivation of the country, so as to raise it on an equality with the average price of the best upland Georgian cotton realizable in the Liverpool market for the time being, and for this purpose the Committee propose the following terms:\n\nFirst Scale.\n\nFor any cotton, the growth of the provinces appertaining to the government of Bengal and Agra, not less than three hundred bales in quantity, (each bale to weigh 320lbs. avoirdupois,) and to be cleaned by machinery, which shall realize in the Liverpool market, at the time of sale, the average price of the best lots of American upland Georgian cotton, sold at the same time in the same market, the sum of twenty thousand Company's Rupees, or 2000l. sterling.\n\nConditions.—1. The cotton must be bona fide the property of one individual, and be the produce of the province of Bengal, Behar, Orisa, Assaur, Benares, Oude, Rohilcund, Agra, Delhi, Bundlecund, Malwah, or Saugor and Nerbudda territories, but of no two or more provinces conjointly.\n\n2. The proprietor must furnish a certificate on honour, countersigned by the Commissioner of the province or other chief authority, that the cotton exhibited by him for competition for the reward, is the property of himself solely, and has been obtained by him from a single province. All cotton entered for competition shall be duly registered at the office of the Secretary, on or before the first day of October, 1843, at which time the Agricultural and Horticultural Society will enter on the examination of the bales, and the documents which have reference to them; and should the Society deem the sample bale selected for examination to contain cotton likely to realize the object for which the prize is offered, that then the proprietor shall make over the whole quantity to the custody of the Society, and\nbe furnished in return with a duly attested acknowledgement to that effect.\n\n3. The cotton so made over shall be shipped at the port of Calcutta, and be forwarded to Liverpool, where it shall be brought forward at as early a day as possible after being landed, and sold at the ordinary public cotton mart in the town of Liverpool to the highest bidder, having first been appraised by two sworn brokers of that town.\n\n4. On the receipt of the account of sales being received by the Society from the consignees, the sum realized for the cotton so sold shall be duly compared with the official price currents of the day, and if the amount realized by the sale of the aforesaid cotton be one that can be fairly considered to average the current price of the best upland Georgian cotton of America, that the prize shall be considered to have been justly won, and a certificate, signed conjointly by the President and Secretary of the Society to that effect, shall be furnished, to authorize the payment of the reward out of the Government Treasury to the individual who earns it.\n\n5. The cotton under transport to England to be hypothecated for the benefit of the proprietor, and on the receipt out-turn of the consignment, and a balance struck, which, whether the view be realized or not, shall be duly furnished to the competitor, and all moneys appertaining to the transaction be immediately made over to him, without any deduction whatever on the part of the Society of commission or money profits.\n\n6. The cotton shipped under these conditions shall be insured in one of the Calcutta offices, and the charge for the same be borne by the competitor.\n\n7. No lot presented for competition shall be entitled to gain more than one prize.\n\n8. Prizes to the foregoing amount shall be offered annually for a period of three years, commencing from the first day of October, 1843.\n\n9. The Society reserves to itself the right of rejecting the claims of any competitor without assigning a reason for so doing.\n\nSecond Scale.\n\nFor any cotton the growth of the provinces appertaining to the government of Bengal or Agra, not less than three hundred bales in quantity, each bale to weigh 320 lbs. avoirdupois, and to be cleaned\nby Hauldworth Churka, or any other more approved machinery, which shall realize price in the Calcutta market, very much superior to that of the ordinary indigenous cotton of the country sold at same time—\n\nFirst Prize. The sum of 10,000 Co.'s Rs., or 1000l. sterling.\n\nSecond Prize. The sum of 5000 Co.'s Rs., or 500l. sterling.\n\nConditions.—1. The cotton brought forward for competition must be the property of one individual, and the produce of a single province of either the Bengal or Agra presidencies, Oude included.\n\n2. The proprietor must furnish a certificate on honour, countersigned by the Commissioner or other chief appointed officer of the provinces, that the cotton offered for competition is the growth of that province.\n\n3. The cotton entered for competition under this scale, shall be duly made over to the Agricultural and Horticultural Society for examination, and eventually, if it thinks proper, public sale.\n\n4. Before the cotton so offered to the Society is disposed of, an appraisement, by at least three well known cotton dealers, shall be obtained, which appraisement shall contain a statement whether the party or parties so appraising is or are prepared to take the lot at the price mentioned by them in their valuation paper.\n\n5. On the Society being convinced that the cotton presented for competition is very superior to the ordinary indigenous cotton of the country, and can therefore realize a superior price, the same shall be sold by public auction at Calcutta, after which the produce shall be made over to the competitor, and a certificate, signed by the President and Secretary of the Society, announcing that that the reward shall be furnished to him, which certificate shall be authority for the payment of the prize at the Government Treasury.\n\n6. The Society reserves to itself the right of rejecting the claims of any competitor without assigning a reason.\n\n7. Prizes to the foregoing amounts shall be offered annually, for a period of three years, commencing from the first day of October, 1843.\n\nF. C. SMITH, Chairman.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/b22390832.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 23210, "total-output-tokens": 8160, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 192, 1], [192, 210, 2], [210, 2079, 3], [2079, 4459, 4], [4459, 7100, 5], [7100, 9688, 6], [9688, 12119, 7], [12119, 13726, 8], [13726, 15215, 9], [15215, 17720, 10], [17720, 20187, 11], [20187, 22533, 12], [22533, 25016, 13], [25016, 27286, 14], [27286, 29631, 15], [29631, 31845, 16], [31845, 33910, 17], [33910, 33910, 18]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]