[{"id": "6e8b4cdfdf5f246c29c093c5d2fbc6518c6652a8", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n鮮朝\n\nVOL. VIII.\n\nSupplied gratis to all Members of the Society.\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\n\nSeoul, Korea: The Korean Religious Tract Society.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trubner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1917.\nINTRODUCTION TO THE STUDY OF BUDDHISM IN COREA.\n\nBy the Right Rev. Mark Napier Trollope, D.D.\nBishop in Corea.\n\n(Authorities used are referred to in the footnotes. As far as possible the transliteration of Corean names and words has been avoided, the full Chinese and Corean equivalents being given in the text. No system of transliteration having met with universal approval, I have, where necessary to transliterate at all, followed in the main the system adopted by the French Fathers in their Dictionnaire Coréen Francais, sometimes adding a phonetic rendering for clearness sake. Most of the phonetic systems of transliteration in vogue are quite unscholarly and etymologically impossible. I have also obstinately adhered to my life-long practice of spelling Corea with a C. I shall be pleased to alter that practice when it becomes usual to spell Corinth, Constantinople and other similar names in English with a K.)\n\nI make no apology for asking the members and friends of the Corean branch of the Royal Asiatic Society to turn their attention to the study of that great religion known to us as \"Buddhism,\" 佛敎 or 佛道 which has played so important a part in the history of the Asiatic Continent. It is indeed a subject of fascinating interest and extreme importance whether we regard it intrinsically, as a contribution to the religious and philosophic thought of the world, or extrinsically from the point of view of the wide sway it has held and still holds over millions of our fellow creatures. I do not purpose to enter in any detail into the rather foolish controversy as to whether Buddhism boasts more adherents than Christianity or any of the other great religious systems of the world—a controversy of which the issue depends almost wholly on where you place the vast population of China. There are of course no accurate statistics of the population of the Chinese Empire available. But men like Professor Rhys Davids, who are anxious to place the clientele of Buddhism at the highest possible point, cheerfully estimate the population of China at five hundred millions and\nthen throw the whole into the Buddhist side of the scales. Compared with this, the fact that he similarly places the whole population of Corea (reckoned when he wrote at eight millions) in the same scale may be described as a mere flea-bite. But it is also an evidence of the absolute unreliability of such guess-work statistics. However great a rôle Buddhism may have played centuries ago in the Corean peninsula, it is ridiculous to describe Corea as being now, or as having been at any time within the last five hundred years, a Buddhist country. And although Buddhism has retained its hold on China much more successfully than on Corea, great sinologues like Dr. Legge and Dr. Edkins agree in maintaining that it is ludicrously inaccurate to speak of the China of to-day as a \"Buddhist country,\" even in the very vague sense in which we can describe the nations of the European and American continents as \"Christian countries.\" Even so however the wide spread of Buddhism in Asia is remarkable enough. Although practically extinct now for nearly a thousand years in India the land of its birth—when, after a vogue of nearly fifteen centuries, it was finally ousted by Brahmanism and Mahometanism—Buddhism can still, in one form or another, certainly claim to this day to be the religion of practically all Ceylon, Burmah, Siam, Annam, Cambodia and Cochin China, as well as of Thibet and Mongolia, while its professed adherents in China proper probably number not less than fifty millions, and, as we know, so careful a student as the late Professor Lloyd reckoned that it was still entitled to be called at least \"the creed of half Japan.\" In round figures therefore Buddhism can probably claim even now not less than a hundred\n\n1 See his popular little manual entitled \"Buddhism: being a sketch of the life and teachings of Gautama the Buddha.\" Twenty third thousand. S.P.C.K. London, 1912.\n\n2 The latest statistics give the population of Corea at a little less than fifteen million, the number of Buddhist temples as 1412 and of monks 6920 and nuns as 1420, i.e. 8340 in all. For five centuries, i.e., from the 14th to the 19th, Buddhism was forbidden all access to the capital and other great cities of Corea.\n\n3 The Creed of Half Japan: by Arthur Lloyd, M.A., London, 1911.\nmillion devotees. If moreover, as Bishop Copleston\\(^1\\) has remarked, we remember that in those ancient days, when Greeks and Romans, Jews and Christians were still comparatively few in number and Mahomet had not yet arisen, vast unnumbered multitudes in India and China and Central Asia were \"taking refuge in the Buddha,\" it is quite possible that, up to the present moment in the world's history, more men and women have sought salvation in Buddhism than in any other religious system.\n\nThe subject before us today is the place occupied, and the part played, by this world-famous religion in the country now known to us as Chosen or Corea. But it is impossible to think or talk intelligibly on this limited subject without first sketching in the background, so to speak, and refreshing our memories on the subject of Buddhism in general, at least in its main outlines. I beg you, therefore, to note carefully the limitations I have placed on myself in the title of this paper. As Professor Rhys Davids says, \"to trace all the developments of Buddhism, from its rise in India in the fifth century B.C. . . . . . down to the present time, would be to write the history of nearly half the human race.\"\\(^2\\) My programme is something more modest, as this paper is only intended to serve as an introduction to the study of Buddhism—and of Buddhism as it has found expression in Corea. In other words I hope that this paper will only be the fore-runner of many more on this subject to be subsequently read before this Society by students far better equipped than myself. Much of what I have to say will be very elementary and possibly already familiar to some of those listening to me. But I want to get it down in black and white, partly with a view to refreshing our memories, and partly in order that we may have it handy for reference as we proceed further in our studies. At the same time I do not want to overload the paper with material which, however interesting in itself, has no bearing on the study of Buddhism in Corea. Roughly speaking, we\n\n---\n\n\\(^1\\) *Buddhism, primitive and present, in Magadha and Ceylon*, by Reginald Stephen Copleston, D.D., Bishop of Colombo. London, 1892.\n\n\\(^2\\) Rhys Davids, *op. cit.* p. 8.\nknow the order in which, and the dates at which, the Buddhist faith reached the various countries where it has since taken root. And it will be necessary to discard all reference to the Buddhism of those countries which lie, so to speak, off the main stream of our investigations.\n\nBuddhism, we know, is an Indian religion, and had its original habitat in and near the old kingdom of Magadha, in the basin of the river Ganges, some four or five hundred miles N.W. of Calcutta, in a district still called Behar, because of the numberless Vihara or Buddhist monasteries with which it was at one time covered. And the Holy Land of the Buddhists stretches over this district northward from the neighbourhood of Benares to the borderland of Nepal. As I have already reminded you, Buddhism has long been extinct in India, the land of its birth. But Buddhism is an essentially missionary religion, and its emissaries, pushing southwards from India, had evangelized the island of Ceylon as far back as the third century B.C. And as the Buddhism of Ceylon probably preserves, in its Pali scriptures, the most authentic tradition as to the original contents of the Buddhist faith, reference to it is more or less inevitable in any study of the subject. On the other hand, the Buddhism of Burmah, Siam and Cambodia, however interesting in itself, need not delay us, as, even if these countries were not originally evangelized from Ceylon, the connexion between the Buddhism of Ceylon and that of the countries of the Indo-Chinese peninsula was in subsequent years so close as to make it unlikely that these last would throw any additional light on the subject immediately before us.\n\nIt is these countries, Ceylon, Burmah, Siam and Cambodia, which preserve in the main the tradition of the Hinayana 小乘 or \"lesser vehicle\"—popularly known as \"Southern Buddhism.\" And this, as we shall see, differs so widely from the Mahayana 大乘 or \"greater vehicle\" variety,—popularly known as \"Northern Buddhism,\"—with which we are chiefly familiar in China, Corea and Japan, that one sometimes wonders how they come to be regarded as branches of the\nsame religion. By way of making as clear as possible, in a rough and ready way, the difference between Hinayana and Mahayana, the lesser and greater vehicles, I do not think I can do better than quote the following words of Professor Lloyd, after premising that, as Pali is the sacred language of Hinayana Buddhism, so Sanskrit 梵書 범서 is that of the Mahayana variety, and that it is from Sanskrit originals that practically all the Buddhist Scriptures with which we are familiar in China, Corea and Japan have been translated.\n\nProfessor Lloyd says:—\n\n\"The word Mahayana means \"The Large Vehicle\" or \"Conveyance,\" and is used to distinguish the later and amplified Buddhism from the Hinayana or \"Small Vehicle,\" which contains the doctrines of that form of Buddhism which is purely Indian. . . . It would be a mistake to suppose that the Greater Vehicle differs from the Lesser only because it contains in it more of subtle dialectic and daring speculation. The case is not so: the Pali books are every whit as deep and every whit as full of speculation as their Sanskrit rivals. The Hinayana is the Lesser Vehicle only because it is more limited in its area. It draws its inspiration from India and India only. . . . But when once Buddhism stepped outside the limits of India pure and simple, to seek converts amongst Greeks and Parthians, Medes, Turks, Scythians, Chinese and all the chaos of nations that has made the history of Central Asia so extremely perplexing to the student, immediately its horizon was enlarged by the inclusion of many outside elements of philosophic thought. It was no longer the comfortable family coach in which India might ride to salvation: it was the roomy omnibus intended to accommodate men of all races and nations, and to convey them safely to the Perfection of enlightened truth.\"\n\nThe northward move of the early Buddhist missionaries appears to have followed the valley of the Ganges and the Jumna—in a north-westerly direction rather than due north—and to have passed over the watershed, which separates the\n\n1 Lloyd, op. cit., pp. 1-2.\nhead waters of these rivers from those of the Indus, into the Punjab and Cashmere, and further on still into the lands lying between what is now the north-west frontier of India and the Aral and Caspian Seas. Here in lands, known vaguely to the old geographers of Europe as Parthia, Bactria and Scythia, and now largely covered by Afghanistan and Turkestan, flourishing Buddhist communities had been founded in the second century B.C., and here Indian religion and culture had shaken hands with the religion and culture of Persia and of Greece, carried thus far east under the standards of Alexander the Great and his generals. And although these lands were to fall later under the sway of Mahometanism, they remained strong enough and long enough in their Buddhist faith to send out fresh shoots eastward across the deserts of Central Asia into the Chinese Empire. Thus the Buddhism which found its way into China early in the Christian era, and ultimately from China into Corea and Japan, was of the \"Northern\" or Mahayana variety (Greater Vehicle) and was already tinged, before its arrival in the Far East, with foreign elements, borrowed certainly from Persia and Parthia, and possibly also from countries even farther west. It is interesting to note in this connexion that recent historical research has done much to prove the veracity of the old tradition which made S. Thomas the Apostle the first Christian Missionary in these lands on the borders of India, Persia and China. And it is by no means improbable that that interfiltration of Christian and Buddhist ideas, which certainly occurred later in China, owing to the missionary labours of the Nestorian Church, may have began thus early. One thing is, I think, quite plain—namely that Buddhism came into China originally from these countries on the western borders of the Empire, which occupied the territories now roughly covered by the geographical term Turkestan, and not directly from India or Indo-China in the south. Indeed the huge mountain-barrier of the Himalaya and allied ranges, which stretch over fifteen hundred miles from the borders of Turkestan to the northern confines of Burmah, formed a quite sufficient barrier to prevent any such direct\ncommunication. And this possibly accounts for the prominent part played by \"the West\" in all Chinese, Corean and Japanese Buddhism. In after years the Chinese and allied peoples may have learned that India—or T'yen-ch'youk-kouk 天竺國 덴축국 (Chon-Chook-kook) as the Buddhists called it—was the real home of Buddhism and lay to the south: but it had come to them from the west, and Sye-yek-kouk 西域國서역국 (So-yok-kook), or the \"kingdom of the Western region,\" is still the name by which the Buddha's home-land is known to his far-eastern devotees, while myriads of Buddhist believers live and die in the hope of attaining, through the good offices of Amida, to the unspeakable bliss of the \"Western paradise\" 西天서천. Similarly the first Europeans who found their way to Japan were known as Namban 南蠻남반 or \"barbarians of the south,\" because they reached Japan via the China Seas, long before more accurate geographical knowledge led to their being called \"Sei-yo-jin\" 西洋人서양인 or \"western ocean men.\"\n\nWith regard to the arrival of Buddhism in China, there seems no reason, in spite of vague rumours and traditions on the subject, for believing that it was any way known there until the latter part of the first century A.D.—that is, about the time when the twelve Apostles were busy spreading the Christian faith in the west. Chinese annals are usually reliable and the Chinese annals quite clearly connect the first advent of Buddhism in China with the mysterious dream of the Emperor Ming-ti 明帝명태 of the later Han dynasty 後漢紀후한기 in A.D. 62. As a result of this dream, in which, on several successive nights, he had seen (I quote Professor Lloyd¹) \"a man in golden raiment, holding in his hands a bow and arrows and pointing to\n\n¹ Creed of Half Japan, p. 76. Professor Lloyd and others with him think that these first \"Missionaries\" to China may after all not have been Buddhists at all, but Christians. After pointing out how the truth of the old legend about S. Thomas the Apostle's mission to the East has been rehabilitated in recent years, he draws attention to the curious parallelism between the Emperor Ming-ti's dream, and the vision of S. John the Apostle (Rev. VI. 2) a prisoner on Patmos about this date.\nthe west,\" he had equipped and sent off westwards a mission to seek for the teacher whom his dream had seemed to proclaim. While on their journey westwards his envoys met in the mountain passes two travellers of foreign name and nationality, leading a white horse laden with sacred scriptures and religious emblems. Convinced that in these men they had found that which their Emperor had sent them to seek, they turned back with them and introduced them to the Chinese capital, then situated at Loh-yang, 洛陽 락양, in the present province of Honan 河南 하남. Here they were well received and housed in a temple, which is said to be still standing and to be still known by the name of \"The White Horse Temple\" 白馬寺 빅마사. This mission was short lived, as both missionaries died shortly afterwards in about the year 70 A.D. They had however apparently succeeded in translating into Chinese some of the scriptures they had brought with them. And of these, one—the \"Sutra of the 42 sections,\" 四十二章經 사십이장경 containing a collection of short and pithy sayings of the Master—has, after going through many editions and revisions, come down to our own day. Apart from this however, this first missionary effort on the part of Buddhism (if it was a Buddhist mission!) seems completely to have died out. And nearly eighty years elapse before we hear of a fresh batch of Buddhist missionaries arriving in the Chinese capital in the year 147 A.D., this time under the leadership of a Parthian prince, Anshikao, who appears to be known under a slightly different name (Axidares') to European history. From that time onwards Buddhism took root in the Chinese Empire, although it was not until the beginning of the fourth century A.D. that Chinese subjects were actually allowed by the Chinese authorities to become professed monks and nuns of the new religion. And it is indeed a remarkable fact that during the first two centuries of its existence in China, the authorized representatives of Buddhism appear to have been exclusively foreigners.\n\n1 See Lloyd, op. cit.: pp. 117-119.\nThe career of Buddhism in China has been a chequered one, ranging from the warmest patronage by some of the Emperors of the various dynasties under which it lived to the bitterest persecutions suffered under others. Throughout, it has had to meet the implacable hostility of the Confucian literati, such as Han Moun Kong (Han Yu) 韓文公(愈) 한문공(유), one of the foremost statesmen, philosophers and poets of the Tang dynasty 唐紀 당나라, whose protest against the public honours with which the Emperor had caused an alleged relic of the Buddha to be conveyed to the imperial palace in the year 819 A.D., is still reckoned a master-piece of Chinese literature, and renowned as one of the most celebrated of Chinese state papers.¹\n\nMeanwhile through good report and ill report—and there has been plenty of the latter, whether well or ill deserved—Buddhism has survived through all these centuries and spread throughout the length and breadth of China, covering the land with temples and monasteries and propagating its tenets, in\n\n¹ This document is such a delicious specimen of the overweening arrogance characteristic of the Confucian literati whether of China or Corea, that it seems worth while to transcribe the following passage—\"Buddha was a barbarian. His language was not the language of China. His clothes were of an alien cut. He did not utter the maxims of our ancient rulers nor conform to the customs which they have handed down. He did not appreciate the bond between prince and minister, between father and son. Supposing indeed this Buddha had come to our capital in the flesh, under an appointment from his own state, then your Majesty might have received him with a few words of admonition, bestowing on him a banquet and a suit of clothes, previous to sending him out of the country with an escort of soldiers, and thereby have avoided any dangerous influence on the minds of the people. But what are the facts? The bone of a man long since dead and decomposed is to be admitted forsooth within the precincts of the Imperial Palace.\" He then goes on to beg that the bone may be destroyed by fire or water, adding \"The glory of such a deed will be beyond all praise. And should the Lord Buddha have the power to avenge this insult, then let the vials of his wrath be poured out upon the person of your humble servant.\"\n\nSee Giles, History of Chinese Literature pp. 201-3 and Mayers, Chinese Reader's Manual, p. 50.\nhowever corrupt a form, so far and wide, as to lend not a little plausible justification to the oft-repeated description of China as a \"Buddhist country.\"\n\nFrom the third century of our era onwards an ever increasing number of Buddhist missionaires found their way from India into China, while not a few Chinese undertook expeditions to India, in order to visit the sacred scenes of the Buddha's life and to obtain relics, images and authentic versions of the Buddhist scriptures. Of these last, the two most famous were the monks Fa-hien 法顯 법현 and Yuan Chwang 元奘 원장 or 玄奘 현장 (or Hsiouen Chang), of whom the former left China in A.D. 399 and returned fifteen years later, and the latter starting in A.D. 629 did not return until A.D. 645.¹ The vivid and very human records of these two indefatigable pilgrims have come down to us intact, and are of great historical value, as we are told, on the authority of those responsible for the Archaeological Survey of India, that \"if it were not for the Chinese pilgrims who visited India, we should know next to nothing of the history of that country for several centuries.\" Yuan Chwang is said to have brought back with him to China no less than six hundred and fifty seven volumes of Buddhist scriptures in Sanskrit, not a few of which he translated into Chinese. And you will find his name, as well as that of another indefatigable translator, Kumārajiva 鸠摩羅什 구마라십—a celebrated Indian Missionary who reached China about A.D. 400—prefixed to many of the Chinese versions of the Buddhist classics now in use in Buddhist temples in Corca.\n\nThe industry of these and other translators was undoubted. But it is an open question whether it did not bring a curse rather\n\n¹ It is interesting to note that Dr. Legge in publishing an edition of Fa-hien's travels for the Clarendon Press (Oxford) used a version of the book which had been published by a Corcan editor in Corca in 1726. It is also worth noting that in the list of Chinese pilgrims to India, extracted from old Chinese works and printed in the introduction to Mr. Beal's Life of \"Hinen Tsiang,\" the names of no less than six Corcans appear. The Nestorian missionaries arrived in the Chinese capital A.D. 635, and may have met Yuan Chwang.\nthan a blessing with it. Professor Rhys Davids\\(^1\\) protests against the \"great misconceptions with regard to the supposed enormous extent of the Buddhist Scriptures,\" maintaining that in their English dress they are only about four times as great in bulk as the Scriptures of the Old and New Testaments. But he is speaking only of the Pali scriptures of \"Southern Buddhism.\" The Sanskrit Canon of \"Northern Buddhism,\" with its Chinese versions and appendices, has assumed dimensions which are the despair of the student. Professor Lloyd\\(^2\\) speaks of \"that overwhelming flood of Buddhist books and translations which has served to make the history of Buddhism in China such a hopeless chaos.\" And it is hardly surprising under these circumstances to hear that the Buddhist world in China, \"distracted by the immense volume and bulk of its religious books,\" welcomed a reaction under Bodhidharma 達摩大師 달마 대사 and other teachers, in the 6th century, who boldly taught that you cannot get Buddhism from books, and that if you want enlightenment, you must get it by meditation, 禅 선 while others, weary of the confusion, resorted to the simple expedient of walking into a library, closing their eyes and stretching forth their hands, in faith that they would be guided to the book which was to simplify their Creed. Hence arose the distinction between the Syen and the Kyo—or as we should say between the \"mystical\" and \"dogmatic\"—sects, 禅敎兩宗 선교양종, which are the only two recognized in the Corean Buddhism of to-day.\\(^3\\)\n\n---\n\n1 Rhys Davids. *Buddhism*. p. 20-21. But cf. Beal's *Catena of Buddhist Scriptures from the Chinese*.\n\n2 Lloyd. *Creed of Half Japan*. pp. 152, 210.\n\n3 It is of course common knowledge that Buddhism had split into a number of divergent sects before it left its native India. Some of these variations were transported to China, which added not a few sects of its own. In Japan the process of sectarian subdivision has gone on until the number of sects into which the followers of Buddha are divided may be counted by the score, if not by the hundred. Of these the most important are the Shingon 真言宗, Tendai 天臺宗, and Zen 禅宗, the Jodo 浄土宗, the Shin 直宗 (commonly called Hongwanji) and Nichiren 日蓮宗.\nThe mention of Bodhidharma's name reminds me to note in passing, before we leave Chinese Buddhism, a fact which marks the shifting of the centre of Buddhist gravity from India to China. For Bodhidharma, a native of South India, was the twenty eighth in lineal succession of the Patriarchs, who had presided over the Buddhist Church in India since the death of its founder. And in the year 520 A.D., taking the alms bowl of Buddha and the patriarchal succession with him, he migrated from India to China, wearied probably with the internal dissensions of Buddhism and the increasing hostility of Brahminism in his native land. True to his principle of meditation, on arriving at the temple of Syo-rim-sa 少林寺 소림사 at Lohyang, the then capital of China, he is said to have remained seated in silent meditation, facing a blank wall, for nine years until his death, thus becoming famous all down the ages as \"the wall-gazing Brahmin\" 壁観婆羅門 벽관파라문.\n\nWith him we must leave this brief sketch of early Buddhism in China, for nearly one hundred and fifty years before Bodhidharma's day, in the year 372 A.D. history records the arrival of the first Buddhist missionary in Korea, or—to speak more accurately—in Kokourye, the northernmost of the Three Kingdoms into which the peninsula was then divided—Silla, Paiktyei and Kokourye 新羅 신라 百濟 백제 高句麗 고구려. The new religion spread rapidly through the three kingdoms, and before the close of the sixth century A.D. had passed on to Japan. But into the fascinating subject of Japanese Buddhism I must not wander. Immensely interesting as it is, it is plainly a later off-shoot from the Buddhism of Corea and cannot throw much light on that religion in Corea itself, for the relations between the two countries during the centuries which followed\n\n---\n\n1 There is a small temple of this name, Syo-rim-sa, outside the north west gate of Seoul.\n\n2 The first Buddhist missionary, the monk Marananda, is recorded to have reached Paiktyei in 384 A.D. while 528 A.D. is given as the date of the introduction of Buddhism into Silla. In 552 A.D. the Corean records tell of the first introduction of Buddhism into Japan, by emissaries of the king of Paiktyei.\nwere never intimate enough to allow of much reflex action by Japanese Buddhism on that of Corea. And the great lights of Japanese Buddhism of a later age, like Kobo Daishi, appear to have gone straight to the fountain-head in China for more advanced study and to have drawn their inspiration from there rather than from Chosen.\n\nOn the other hand China and Corea were bound together by much closer ties, civil and ecclesiastical. And so it happens that the development of Buddhism in Corea was largely affected by what was going on in China. And when Thibet in the fifth and sixth centuries of our era embraced a form of Buddhism, drawn partly from India and partly from China, and, in embracing it, remoulded it in a form unknown elsewhere in the Buddhist world, this new variety of the old religion (which was largely connected with spells and magic and which afterwards under the name of Lamaism extended to Mongolia) not only reacted on the Buddhism of China, but to a certain extent on that of Corea also.\n\nSo far we have been considering the religion known as \"Buddhism\" merely as an external phenomenon and watching its progress through the centuries as it gradually permeates the peoples of Southern, Central and Eastern Asia. It is time now to turn our attention to its contents. And here our difficulties crowd upon us thick and fast. In considering these difficulties, I wish to say at the outset that I do not regard it as any part of my business here to take up a critical attitude or to institute comparisons between Buddhism and Christianity, to the advantage or disadvantage of one or the other, though occasionally a reference may be allowed to what is very familiar to us in our Christian experience, simply to make things clear by way of comparison or illustration. I speak indeed as a convinced Christian, convinced too that the Catholic Faith as enshrined in the creeds of the Church is not merely one among many possible religions, all equally excellent, but the One True Religion. I am however no reckless iconoclast and my religious convictions do not in the least prevent me from approaching such a\nreligion as Buddhism with a respectful and even sympathetic interest. But the difficulty and complexity of the subject are enormous.\n\nTo begin with, Buddhism is by origin an Indian religion. And the Indian mind has always evinced a positive distaste for mere history and for the recording of bare facts as such. Moreover the teacher whom we know as the Buddha left no writings. Nor is there any fixed canon of scripture, universally accepted by all Buddhists, to which we can appeal either for the facts of his life or the main outlines of his teaching. Mahayana differs from Hinayana, \"Northern\" from \"Southern\" Buddhism, the Sanskrit from the Pali canon and both from the Chinese.\n\nAll forms of Buddhism everywhere, indeed, agree that the Buddhist canon of Scripture is comprised in the Tripitaka, 三藏 삼장 or \"Three receptacles,\" which may be said to correspond roughly to the Two Testaments (Old and New) of the Christian Bible. All are moreover agreed that these \"Three receptacles\" consist of\n\n(a) The Vinaya 律藏 롤장 section, which gives the disciplinary rules of the Buddhist community.\n\n(b) The Sutra 經藏 경장 section, which professes to give the discourses uttered by the Buddha during his lifetime.\n\n(c) The Abhidharma 論藏 론장 section which includes a number of metaphysical and miscellaneous treatises.\n\nBut there the agreement ceases, nobody being able to state precisely what is and what is not included in the several sections.¹\n\n¹ A comparison with the corresponding facts relating to the Christian Scriptures of the Old and New Testaments may here be permitted by way of illustration. All Christians, Protestant and Catholic, Eastern and Western, are agreed and have been agreed since very early times that the New Testament is composed of precisely twenty seven well-known documents and no more. (It is interesting to note that this is the number given on the Nestorian Monument, erected at Si-ngan-fou in China in 782 A.D.) Nobody thinks of putting the Apocryphal Gospels (of which many are extant) or even the authentic writings of such well-known contemporaries of the Apostles as S. Clement, S. Ignatius, or S. Polycarp on the\nA further difficulty arises from the syncretistic character of Buddhism. It has the most extraordinary capacity for absorbing into its system, and making part of itself, any religious beliefs, however alien to its first principles, which may be prevalent in the countries to which it goes. Tree-worship and serpent-worship almost everywhere, Shivaite and Brahmin elements in Ceylon, nat-worship in Burmah, ancestor worship in China, Kami-worship in Japan, the almost monotheistic worship of Adibuddha in Nepal, the terrible superstitions and the magical cult of the Bon-worshipper in Thibet, have all found a welcome from \"Buddhism\" and been assimilated in turn.\n\nIn Corea, for instance, nearly every Buddhist temple has two subsidiary shrines—one to the \"Seven Stars\" 七星 천성 of the constellation known to us as the \"Great Bear,\" and one to the \"Spirit of the Hill\" 山神 산신 on which the temple stands—neither of which can have much to do with Buddhism proper. But the oriental mind, not having been trained as our minds mostly have been, along the lines of inexorable Aristotelian logic, simply revels in what too often appears to us a bewildering inconsistency, coupled with a habit of hazy inaccurate analysis, and a willingness to accept as \"facts\" statements supported by the slightest evidence or by none at all. The literary fertility of the Chinese has made the confusion worse confounded. Sutra after Sutra has been composed in, or translated into, Chinese, with the words \"spoken by Buddha\" 佛說 불설 on the title page, but without the slightest evidence as to the truth of the statement and much evidence to the contrary. And in this connexion we need to remember that no reliable or connected biography of \"the Buddha\" has reached\n\nsame level as the Canonical Scriptures of the New Testament, still less of inserting in the Canon great Christian classics like St. Augustine's Confessions, Thomas à Kempis' Imitation of Christ, Bunyan's Pilgrim's Progress or Milton's Paradise Lost. There is very nearly the same agreement about the Scriptures of the Old Testament except for a margin of fourteen not very important books, accepted by Roman Catholics, rejected by Protestants and assigned a middle position by the Church of England, under the title \"Apocrypha.\"\nus. We have to piece it together, as best we can, from different works in different languages, dealing with different periods of his life and all of doubtful date—the old Pali chronicles and scriptures of Ceylon bearing away the palm for authenticity and reliability, as evidenced by the remarkable discoveries made by those responsible for the Archaeological Survey of India.\\(^1\\) Until recently there was an acknowledged discrepancy of nearly five hundred years between the earliest and latest dates assigned to the birth of \"the Buddha.\" And so lately as 1893, in the \"outlines of Buddhist doctrine,\" drawn up under the auspices of the leading Buddhist sects in Japan for circulation at the Chicago Parliament of Religions, the date of his birth was given as 1027 B.C., whereas it is now almost universally admitted that he died in his eightieth year about 480 B.C. He must therefore have been born about the middle of the Sixth century B.C., and was, roughly speaking, contemporary with Confucius in the east, and Pythagoras in the west, and flourished somewhere near the period when the Jews were returning to Palestine after the Seventy Years' captivity in Babylon.\n\nIn endeavouring to form some idea as to what the main contents of the Buddhist religion really are, it seems natural to recur to that which is probably the oldest and most authentic formula in Buddhism—a formula as characteristic of Buddhism as the Trinitarian baptismal formula is of Christianity—known in Sanskrit as Trisarana, or the \"Three Refuges\" 三歸 삼귀:\n\n(A) I take refuge in Buddha 領依佛귀의불.\n(B) I take refuge in Dharma, or the Buddhist \"law\" 領依法귀의법.\n\n---\n\n\\(^1\\) The Sanskrit work known as the Lalita Vistara, on which most of the Chinese (and therefore Corean and Japanese) lives of \"the Buddha\" are based, seems to date at the earliest from the early centuries of the Christian era, i.e. five or six hundred years or more after \"the Buddha's\" lifetime. Professor Rhys Davids puts its historical value, as evidence for the facts of \"the Buddha's\" life, on about a par with the historical value of Milton's Paradise Regained, as evidence for the facts of the life of Christ.\n(C) I take refuge in Samgha, or the Buddhist \"church\" 諸依僧伽의 숭.\n\nThis formula is, I think, in universal use wherever Buddhism of any variety is known. And it will be convenient to arrange our thoughts under these three heads.\n\n(A) \"I take refuge in Buddha.\" But whom or what do we mean by \"Buddha\"? For \"Buddha\" is not, strictly speaking, a personal name at all. It is a title which, according to the tenets of Buddhism, has been already borne by many individuals previous to the one whom we know as \"the Buddha,\" and which will be borne by many others in ages yet to come. It is used to describe the state of those who have attained to Bodhi, or complete intelligence, and so, having broken away from the bondage of sense-perception and self, are completely holy and ready to enter Nirvana 涅槃. The universe in which we live has, according to Buddhist theory, already passed through many Kalpas or previous periods of existence, each of which produced numberless \"Buddhas.\" According to one computation the last three Buddhas of the previous Kalpa and the first four of this (of whom our Buddha is the latest to appear so far) make up a group of seven \"ancient Buddhas\"1. According to another computation our Buddha is the fourth in a series of five belonging to this kalpa, of whom three (Krakuchanda, Kana-kamuni and Kasyapa) preceded him, and the fifth, Maitreya, or Mi-ryek 勒勤 미력 is the \"coming saviour\" for whose advent all devout Buddhists are waiting.\n\n---\n\n1 Hanging on the walls of most of the larger temples in Corea may be seen a large picture, representing the worship offered to \"Buddha\" by the Buddhist Church on behalf of those who have died in the midst of one or other of the avocations of ordinary daily life, which are portrayed in the lower part of the canvas with a vigour and humour recalling the \"Kermesse\" pictures of some of the Dutch painters. But the \"Buddha\" represented as the object of worship in this curious picture consists not of a single figure but of \"seven Buddhas\"—Chil-ye-rai, 七如來 칠여래 who are portrayed in a row at the top of the picture. These \"seven Buddhas\" stand in some not very easily explained relation to the mystic Trinity of Buddhas of which mention is made lower down.\nIt is a curious thing that, although figures of this \"Coming Saviour\" are not very frequently found over the altars in the Buddhist temples of Corea, the name Miryek has become permanently attached to the isolated stone figures standing in the open air—many of them of great size and obviously of great antiquity—which are to be found in so many places. So much is this the case that Miryek—somewhat like (Bodhi) Dharma in Japan—seems to have become a common term in Corea for all such statues, to which (if I remember rightly) the name of Buddha is never given. This devotion to Miryek, or Maitreya, in Corea, needs some further elucidation, which cannot however be entered on here.\n\nThose who, like Maitreya (Miryek), have, after many previous existences, reached the stage in which they are ripe for the attainment of Buddhahood in their next earthly existence but who have deliberately delayed the attainment, in order that they may devote themselves to the salvation of others before they pass into Nirvana, are known as Bodhisattwa, 菩薩보살. And these form a numerous and popular class of divinities, who play a very important part in Mahayana Buddhism and to whom I shall have to refer again.\n\nNot only, however, is it the case that many other individuals, besides the one familiar to us as \"The Buddha,\" have in past ages attained, or will in future ages attain, to Buddhahood, but every Buddha, including the one best known to us, has passed successively through a great many previous existences in the three worlds of heaven, earth and hell, as man or beast or spirit, as a preliminary to the attainment of Buddhahood and Nirvana. And one of the most popular books in the Buddhist Canon is the Jataka, giving the story of the five hundred and fifty previous lives lived by him whom we know as \"the Buddha\" before he appeared in the world for the last time as Gautama Sakyamuni, or Siddartha, the princely son of Suddhodana, the King of Kapilavastu and his queen the lady Maya.\n\nIt is however with this historic \"Buddha,\" the man who was born, as we have seen, about 560, and who died about 480\nB.C., that we have chiefly to do. And, to prevent confusion, let us begin by recounting some of the names by which he is best known. European writers on Buddhism are always apt to take too much for granted in their readers, and, by ringing the changes on these various names without any warning or explanation, to create a great deal of avoidable confusion.\n\nFirst then, there is the name Buddha, 佛 or 부처 which is, as we have seen, strictly speaking a title and not a name, and which is, as such, used of many others besides the historic Buddha. It is moreover, I think, quite plain that the term \"Buddha\" became used for something very like the Christian term \"God\" or \"Godhead\" or \"the Divine Essence,\" in some of the later, more mystical and more highly developed forms of Mahayana Buddhism, prevalent about the date when Buddhism passed from China to Corea and thence to Japan. Hence we find the curious mystic Trinity of Vairochana Buddha, 菩薩那佛비로사나불 Loshana Buddha, 菩薩那佛로사나불 and Sakyamuni Buddha 釋迦牟尼佛석가모니불, which presents so many curious points of resemblance to the Christian doctrine of the Trinity, that it would seem as if it must have been partly derived from it, although in the main it is doubtless a reflection of Hindu theology. In this Trinity it will be observed that the historic \"Buddha\" (Sakyamuni) plays a comparatively subordinate part, the term \"Buddha\" (like the Adi-Buddha of Nepal) standing for something like \"the Divine essence,\" of which Vairochana (explained in Chinese as \"law-body\" 法身), Loshana (\"recompense-body\" 報身) and Sakyamuni (\"transformation-body\" 化身) are emanations.\n\n---\n\n1 The terminology of Buddhism presents one of the greatest difficulties to the beginner. The same name or word is spelt differently in Pali and Sanskrit and differently again in the various vernaculars of the countries where Pali and Sanskrit scriptures are used—e.g., in Singhalese, Burmese, Siamese, Thibetan, Mongolian. Their translation or transliteration into Chinese characters brings in a further difficulty, as the characters are of course pronounced differently in Corean, Japanese and the various dialects of China. E.g., the character 佛 is Poil in Corean, Butsu in Japanese and Fo in Chinese.\nleast one of the largest and oldest Buddhist temples in Corea, the Buddhas exposed for worship over the high altar are three colossal seated figures of Vairochana (in the middle) Loshana (on Vairochana’s left hand) and Sakyamuni (on Vairochana’s right hand).\n\nSecondly, there is the family name Gautama, not much used, I fancy, in Corea, China and Japan, but commonly used as a distinctive personal name by European writers.\n\nThirdly, our Buddha is known as the Prince Siddartha, 悉達太子 실달리조, which was his official title as his father’s son, and heir to his father’s throne, before he withdrew from the world.\n\nFourthly, there is the term Sakyamuni 釋迦牟尼 석가모니 (or as Coreans pronounce it Syek-ka-mo-ni), the saint or ascetic of the Sakya tribe, of which his father was king.\n\nFifthly, there is a variation of this, Syek-ka-ye-rai, 釋迦如來 석가여래 very commonly used in Corea, the termination Ye-rai being composed of two Chinese characters meaning “thus come,” and standing for the Sanskrit term Tathagata, which is the highest epithet of all who attain to Buddhahood.\n\nSixthly, there is the honorific title “world honoured one” 世尊세존 which is commonly used in Chinese and Corean Buddhist books as a title of respect. And with this may be mentioned—\n\nSeventhly, Bhagavat, a Sanskrit title commonly used of any Buddha, and meaning “a man of virtue or merit.”\n\nIt will perhaps simplify matters if, in the rest of this paper, I refer to him as Gautama Buddha, although it is strictly speak-\n\n---\n\n1 The famous monastery of Tai-pep-chu-sa, on Sok-ri-san, in the prefecture of Po-eun in North Chyoung Chyeng To.\n\nThis monastery was founded in A.D. 553. Sok-ri-san (Hill of farewell to the world) is known to Coreans as the “little Diamond Mountain.”\nAn ancient bas-relief\n\nA typical Amcia or small detached cell dependent on the mitin monastery\ning an anachronism to use the title \"Buddha\" previous to his attainment of Bodhi or Buddhahood in his thirty sixth year. Until that event he was in strict parlance only a Bodhisattwa.\n\nGautama Buddha then was the son of a king or petty rajah, named Suddhodhana, but known to the Coreans as Cheng-pangoang, 精飯王 정반왕 who reigned over a small country about one hundred and thirty miles or so north of Benares, the capital of which was Kapilavastu 迦毘羅國 가비라국. His mother, the lady Maya 摩耶夫人 마야부인 died a week after giving birth to her son, who was brought up in his father's palace by her sister (also one of king Suddhodhana's wives), the lady Maha prajapati—famous ever after, not only as Gautama Buddha's foster mother, but also as the first woman admitted into the Buddhist Community, and the first abbess of the first Buddhist convent for women.\n\nThere is, as I have already said, no authentic and reliable biography of Gautama Buddha. But the story of his life, as accepted by Corean Buddhists, is divided into eight chapters, recording the eight chief events or periods of his life. These \"eight scenes\" 括相 팔상 are portrayed in a large picture, divided into eight sections—or in eight separate pictures—to be found hanging in a prominent place in most Buddhist Temples in Corea. And for fifty sen you can buy nowadays at any bookstall in Seoul a little En Moun booklet, called the Pal Syang Rok 括相錄 팔상록 which sets out at length in eight chapters, illustrated by these eight pictures, the Story of Gautama Buddha's life.\n\n(I) The first scene shews us the incarnation of Gautama Buddha in the womb of his mother Maya, who in a dream sees her son that is to be, coming down on a white elephant out of the Tushita heaven 兜率天 도솔련 where he had been spending his last previous existence (as a Bodhisattwa).\n\nI It must be remembered that Buddhism speaks of many different heavens. The Tushita heaven is that occupied by all Bodhisattwas,\n(II) The second scene shews us the birth of the child Gautama Buddha in the park of Lumbini, fifteen miles east of Kapilavastu, together with the wonders which attended his birth, and the announcement of the news to his father king Suddhodhana.\n\n(III) The third scene shews us Gautama Buddha, now known as Prince Siddartha, grown to man's estate and having his eyes opened to the hollowness and misery of this life by the sight of an old man, a sick man, a funeral and a holy hermit, during his perambulations outside the gates of his father's palace.\n\n(IV) The fourth scene shews the Prince Siddartha (Gautama Buddha) now thoroughly awakened to the miseries of this world with its ceaseless round of birth, old age, sickness and death effecting his escape from the palace, in spite of the obstacles placed in his way by his royal father. As egress by the gates is impossible, his faithful horse carries him over the palace wall, the four heavenly kings supporting the horse's feet until he reaches the ground in safety.\n\n(V) The fifth scene shews us Gautama Buddha burying himself as a hermit in the wilds of the Himalaya mountains, where he devotes himself for six years to a life of great austerity) after cutting off his hair and sending it and his other belongings back to his father by the hand of his faithful groom Tchandaka, who accompanied his master thus far.\n\n(VI) The sixth scene shews Gautama Buddha, wearied out with his austerities, sitting under the Bodhi-tree before they finally appear on earth as Buddha. Maitreya, the \"coming saviour,\" is now resident in this heaven.\nand, after a severe struggle with the King of Evil, Mara Pisana, and his satellites, attaining to complete enlightenment and therefore to Buddhahood.\n\n(VII) The seventh scene shews Gautama, now a completely enlightened Buddha, returning to Benares, where, in the famous deer park, he proceeds to \"set in motion the wheel of the law,\" by preaching the doctrine by which the world may be saved, to the five ascetics who had been with him in the Himalayas, and who now become his first Arhats or disciples, and the first monks (Bhikshu) of his community.\n\n(VIII) The eighth and last scene shews Gautama Buddha at the end of a long life of unwearied missionary labours, now in his seventy ninth year, surrounded by his five hundred disciples or Arhats, uttering his last discourses and then dying and passing away into Nirvana: after which his body is cremated and his relics divided into eight portions for safe keeping.\n\nNow if I were to keep you here a week I could not find time to fill in all the details of this story, many of which are full of human interest and beauty, nor endeavour to sift the obviously legendary from the obviously true, though there is much on which one would gladly linger. We must however leave the story as it is here in outline and pass on to consider what follows, only premising that of course the greater part of Gautama Buddha's labours took place in the space of nearly fifty years which elapse between the two last scenes, as he is reckoned to have been about thirty six years old when he attained to Buddhahood and started out on his missionary journeys.\n\n(B) And now let us pass to the second of the \"refuges\"—\"I take refuge in Dharmia (or the law),\" and consider briefly what this \"law\" was, in which Gautama Buddha thought that he found salvation under the Bodhi tree and which he spent his\nlife in propagating. We must remember that Gautama Buddha's life was lived against a Hindu back-ground and that his religious system was a reform of the older Hinduism or Brahmanism, which never ceased to pursue the newer faith with bitter hostility. And it is important to remember that Gautama Buddha deserted the Pantheism of the old Hindu religion for a blank atheism which had no place for God in any sense of the word familiar to us. Brahma, 梵王 범왕 who to the Hindu was the \"father of all living\" and into whose Essence all devout Hindus hope to be re-absorbed, remained indeed, and is, like his companion deity Indra or Sakra, 帝釋王 데석왕 a familiar figure in Buddhist mythology and in Corean Buddhist art. But they are only two among the \"gods many and lords many\" who people the many heavens of Buddhist theology. For in Buddhism every world has its appropriate surrounding of many heavens and hells, tenanted by Devas or good spirits, and Asuras or evil spirits. But all these are only beings like ourselves, who are passing through various stages of existence, in accordance with acquired merit or demerit, but who will sooner or later have to return to earth and to go through the same process as Gautama Buddha, if ever they are to attain salvation by entering Nirvana. Again we must remember that Gautama Buddha imported wholesale into his system the old Hindu idea of the \"transmigration of souls,\" in accordance with which all sentient beings are passing through a ceaseless rotation of existence 輪迴 윤회—described as \"the great ocean of birth and death\" 生死 大 海 싱 소태회—as beast or man or spirit, until they acquire sufficient merit to \"reach the other side\" 到彼岸 도피안 of the ocean of misery. Into the complicated question of what place the soul of the individual plays in Buddhism I cannot enter now. It is one of the points on which western logic finds it most difficult to follow the eastern teacher. For, while denying the existence of the individual soul and refusing to admit that man's being consists of anything but an agglomeration of Five Skandha, 五 羣 오중 or attributes, which are dispersed at death, he somehow managed to believe that the Karma,\n行法 험법 i.e. merit or demerit acquired by the individual during life, could survive the dissolution of the individual and undergo a fresh incarnation in some other being—man, beast, god or devil—who was thus at the same time one with, and yet different from, the one just dead.\n\nWith his mind full of such thoughts as these, Gautama Buddha under the Bodhi Tree evolved the \"Four Noble Truths,\" 四諦 사대, the apprehension of which is necessary to every one who wishes to enter on the path of Buddhahood and gain Nirvana. These four dogmas are summarized as follows:\n\n(a) The dogma of misery 苦諦 고혜—that all existence is misery.\n\n(b) The dogma of thirst or craving 聚諦 취혜—that this misery is due to the thirst or craving for what this world or the next has to give.\n\n(c) The dogma of extinction 滅諦 멸혜—that it is possible to extinguish this thirst or craving, and therefore to escape from the misery of existence.\n\n(d) The dogma of the path 道諦 도혜—that there is a path leading to the extinction of thirst or craving and therefore to release from the misery of existence.\n\nGautama Buddha then proceeds to elaborate this path to salvation under eight headings known as the Eight Correct Gates or Eightfold Noble Path, 八正門 팔명문, shewing that salvation (i.e. the extinction of desire, and therefore of the misery of existence) is to be attained by:\n\n(1) Right views (or belief) 正見\n(2) Right aims (or resolve) 正思惟\n(3) Right speech 正語\n(4) Right action (or behaviour) 正業\n(5) Right means of livelihood (or occupation) 正精進\n(6) Right endeavour (effort) 正定\n(7) Right mindfulness (or contemplation) 正念\n(8) Right meditation (or concentration) 正命\n\nThese are nowhere very clearly expounded, and they certainly do not appear to bulk very largely in Corean Buddhism.\nWhen I spoke to a learned old Buddhist abbot on the subject last summer, he brushed all this—which is really fundamental Buddhism—on one side as being mere Syo-seung-pep 小乘法 소승법 or the teaching of the \"little vehicle,\" while he himself urged the importance of the Tai-seung-pep 大乘法 대승법 or the teaching of the \"great vehicle,\" with its emphasis on the Six Paramita 六度律도 (Buddhism is great on these numerical categories) or means of \"passing to the other side\" of the ocean of existence and misery. And I am bound to say that I find these six \"cardinal virtues\"—charity, morality, patience, energy, contemplation and wisdom—more intelligible and attractive than the other. Both systems are apparently based on the recognition of another numerical category, the Twelve Nidana 十二因縁 십이인연 i.e. the concatenation of all forms of existence through a chain of cause and effect numbering twelve links, viz. death, birth, existence, clinging to life, love, sensation, contact, the six senses, name and form, perfect knowledge, action and ignorance. Sanskrit scholars are not agreed as to the right rendering of these twelve terms and I must say that this is one of the cases in which my mind wholly fails to follow the principle on which such a strange and apparently arbitrary assortment of varied conceptions is grouped together under a single heading. And until I have made a much profounder study of Buddhism, I can neither hope myself to understand, nor to make clear to others, the truth which is presumed to underly it.\n\nMore interesting to us, because more practical than these rather confused metaphysical conceptions, are, I think, the famous Ten Commandments 十戒 십계 of Buddhism, which are binding in a greater or less degree on all disciples of Buddha, and which have probably contributed more than anything else to its strength and vigour. They are:\n\n1. Not to kill any living thing,\n2. Not to steal,\n3. Not to commit impurity,\n4. Not to lie,\n(5) Not to drink wine,\n(6) Not to eat at unseasonable times (? to eat flesh),\n(7) Not to take part in singing, dancing or theatrical performances,\n(8) Not to use flowers or perfumes for personal adornment,\n(9) Not to sit on a high broad bed or couch,\n(10) Not to possess gold, silver or jewels.\n\nBy an \"economy\" which would doubtless find favour in some western countries, only the first half of the decalogue is strictly speaking binding on the laity, the observance of the whole being limited to those who are admitted to the \"professed\" order of monks and nuns.¹\n\nBefore passing away from the duties incumbent on the devout Buddhist, reference must be made to Dhyana, 禅 선, a word which for want of a better equivalent is most commonly rendered \"meditation\" or \"abstract contemplation.\" So characteristic of Buddhism is this exercise of the faculties that \"professor of meditation\" 禅 師 선 수 has come to be one of the polite terms used in addressing a Buddhist monk, while Buddhist temples are poetically described as \"halls of meditation\" 禅 院 선 원.\n\nDhyana, in one or other of its stages, may be described as the crown of all the Buddhist's efforts after moral self-control, (in obedience to the Ten Commandments) and after perfect knowledge (in accordance with the Four Noble Truths and the Eightfold Noble Path). In its highest form—described as a sort of ecstatic trance, in which the mind reaches \"a state of absolute indifference, or self-annihilation of thought, perception and will\"²—it is nothing less than the actual threshold of Nirvana itself. In some of its more elementary forms, leading up to this, the practice of Dhyana is supposed to form part of the daily\n\n¹ Hence the technical term for \"ordination\" or \"profession,\" i.e. admission to the order of professed monks or nuns, is 계 받 다 i.e. to receive the Commandments.\n\n² Eitel: Handbook of Chinese Buddhism, s.v. Dhyana.\nduty of every devout Buddhist. Like the expectation of entering Nirvana, however, it seems to have entirely dropped out of practical politics in the Buddhism of the south—at least in Ceylon and Siam. Of China we are told that though it survives in a debased and mechanical form in some monasteries, in many others it has been entirely discontinued.\\(^1\\)\n\nIn Japan, as we know, one of the most numerous and highly esteemed sects of Buddhism lays such stress on the practice that it is known distinctively as the Zen (or contemplative) sect 禅宗 선종; while in Corea all the various sects of Buddhism have for centuries been grouped under these two headings, the mystical (contemplative) and the dogmatic sects 禅敎 雨宗 선교 양종. As a matter of fact few traces of the practice appear to survive in Corean Buddhism—except so far as it is perhaps represented by the sort of coma likely to be superinduced by the monotonous repetition (for hours or days or even months or years at a stretch) of the formula Nam mou Amida Poul, 南無阿彌陀佛 납무아미타불 accompanied by the ceaseless banging of a gong or drum, or both. It is hardly worth while labouring the distinction between Dhyana and the meditation recommended to us by the great Christian mystics and systematized for us by S. Ignatius Loyola and the other great masters of the spiritual life, who did so much to bring vital religion back to life again in western Europe in the sixteenth and seventeenth centuries. Instead of the desperate attempt to think oneself away into nothingness, the Christian mystic practices meditation, or \"mental prayer,\" with the view of identifying himself more wholly with the One Source of all life, light, joy and beauty. And whereas both practices start from a rigorous effort after perfect moral self-control, the Christian practice of meditation aims at bringing into play and exercising in turn all the faculties of the human soul one by one—the memory, the intellect, the imagination, the emotions and the will—instead of limiting itself to the intellect and then trying to annihilate that.\n\n\\(^1\\) Hackmann: Buddhism as a Religion, p.p. 222-3.\n(C) There remains the third of \"the Refuges\"—\"I take refuge in Samgha (or the Buddhist church).\" Although Gautama Buddha had come to see the comparative valuelessness of mere asceticism as such, he had foreseen the difficulty likely to be experienced by mere individuals living in the world, in their endeavour to follow his teaching. One of his first steps therefore was to form his followers into a community of celibate men—to which afterwards women were somewhat grudgingly admitted. And this visible Church which has been established wherever Buddhism has been preached, is the third of \"the Three Refuges.\" It is a refuge in the sense that normally men and women can only hope to attain such salvation as Gautama Buddha promised by living thus retired from the world and its ties (a very different conception from that which underlies Christian monasticism): and it has come to be a \"refuge\" in another and lower sense, because the merits of the community have come to possess a vicarious value for mere members of the laity, who shew their appreciation of the community's value and spiritual privileges by generous benefactions.\n\nIt is noteworthy that Gautama Buddha expressed great trepidation about admitting women to his community. And when he at last yielded to the urgent insistence of his beloved disciple Ananda, prompted by Maha prajapati (Gautama's aunt and fostermother, who afterwards became the first superior of the first convent for women), he afterwards expressed his great regret at having given any such permission and prophesied the speedy downfall of his \"law\" as a consequence!! The communities of nuns or Bhikshunis have led a chequered existence. And though in Corea for instance there are many convents of Buddhist nuns, usually known as Seung-pang 僧房 승방, in other countries like Ceylon (and, I think, Burmah) they no longer exist. In any case the highest hope held out to woman under the Buddhist system is that in some future existence she may be born as a man and so have a chance of qualifying for Buddhahood and Nirvana.\n\nI greatly regret that the time at my disposal does not per-\nmit of my dwelling in detail on some of the leading disciples of Gautama Buddha, or of the long line of Patriarchs, who ruled over the Buddhist Church in India, until the Patriarchal succession was removed by Bodhidharma to China in the 6th century A.D., shortly after which date it died out.\n\nBut one must just refer in passing to Gautama Buddha's own son Rahula (one of the first to be admitted to his father's community),¹ and to his cousin Devadatta, who was the Judas of the company and was finally swallowed up in hell, as well as to the beloved disciple Ananda 阿難尊者 아난존자, also a relation of Gautama Buddha and his personal attendant throughout his long ministry, and the aged Kasyapa,迦葉尊者가설존자, who took the seat of Patriarch immediately after his master had passed into Nirvana, and was followed in that office by Ananda. You will often see the portraits of these two last mentioned, standing right and left of the enthroned Buddha, amid a crowd of attendant Bodhisattwas, in one of the pictures most commonly displayed over the high altar in Buddhist temples in Corea. With regard to the Patriarchs no two lists agree after we have passed the names of Kasyapa and Ananda, the first two to hold the honoured office. But certain names like Asvagosha 馬鳴마명 and Nagarjuna 龍樹용수 have, for one reason or another, attained a far greater fame than that reached by the greater number of those who have borne the title. In the great temple of Hoa-chang-sa,² not far from Songdo, I came across a very interesting series of painted portraits of all the twenty-eight Patriarchs, down to Bodhidharma, which seems to merit more care than it receives. And more interesting still is the wonderful series of fourteen life-sized and life-like portraits of\n\n¹ Gautama Buddha had been married to his wife Yasodhara before he retired from the world. Authorities are not agreed as to whether Rahula was born just before or just after his father left home. In any case the touching story of his midnight farewell to his sleeping wife and child, is a later addition to the Buddha legend.\n\n² 華嚴寺寶長長藏寺鳳凰寺端山寺山郡郡\nSakyamuni\nVairochana\nBuddha\n\nTai-sai-chi\nSvayambhunath\nBuddha\n\n(Note man standing in front of central figure.)\nthe earliest Buddhist Patriarchs, executed in stone bas-relief over a thousand years ago and still to be seen in the extraordinary rock-temple of Syek-koul-am, near the old Silla capital of Kyeng-chu in South Corea.¹\n\nAnd now having said so much, one is conscious that one has left out at least one half, and that not the least important half, of the Buddhism of Corea, and indeed of all Eastern Asia. For as yet we have not even touched on all that surrounds the great name of Amida Buddha, 阿彌陀佛 아미타불 and the blissful paradise of the West, 西方極楽世界 서방극락세계, or 西天淨土 or \"pure land\" 淨土정토, over which he rules, and which he promises to those who turn to him. And here we are indeed face to face with a great difficulty. Although Amida's name occurs in a Sutra which bears, as most others do, the words \"spoken by Buddha\" on the title, there is every reason to suppose that Amida worship, and all that surrounds it, formed no part of the original Buddhist faith. It is wholly unknown to the Buddhism of the south, and would appear to be a reflection of elements—partly Persian, partly perhaps Jewish and Christian—imported into Buddhism during its contact with the civilisation of Greece and Persia at the beginning of the Christian era. However that may be, it has succeeded in establishing itself so firmly in the Buddhism of the Far East that Amida Buddha (who does not even pretend to be a historical character) is at least as prominent a figure in the Buddhist temples of Corea and neighbouring countries, as Syek-ka-moni (i.e. Gautama Buddha) himself. Indeed, in the temples of some of the largest and most popular Buddhist sects in Japan, like the Jodo and the Shin (or Hongwanji), Amida Buddha fills the place occupied by Our Lord Jesus Christ in the Christian Church, while the historic Buddha (Gautama) ranks hardly higher than \"Moses or one of the prophets.\" Most of the devotions one hears in Buddhist temples even in Corea are addressed to\n\n¹ 석 석 경 慶 군 窟 주 州 암 菩 군 郡\nAnida Buddha. And one of the favourite pictures, in any large Corean temple is the Keuk-rak-kou-p'oum, 極楽九品극락구품 shewing the nine stages of the Blissful Paradise of the west, to which Amida Buddha admits those who trust in him. And though he has so largely pushed the historic Buddha Gautama (or Syek-ka-moni) on one side, and though his \"paradise of the West\" seems to be in flat contradiction to all that Gautama Buddha himself taught, no Buddhist devotee in Corea seems to vex himself about, or even to be aware of, the inconsistency. The explanation usually given is that, great as is the bliss of the \"western heaven,\" it is still something far short of the \"Nirvana,\" which must be the ultimate aim of all true Buddhists. But so great are the mercies of Amida Buddha that he throws wide open to all who trust in him the gates of his paradise, entrance into which carries with it the promise of an easy passage into Nirvana, after but one more re-incarnation. But for all practical purposes, Amida's rather sensuous paradise would appear to have usurped the position of Nirvana as the ultimate goal of Buddhist faith among most of the peoples of the Far East.\n\nSide by side with Amida Buddha and Syek-ka-mioni (i.e. Gautama) Buddha, but always in a position subsidiary to the one or the other, mention must be made of the numerous and popular class of secondary divinities, known as Bodhisattvas, 菩薩보살 to whom reference has already been made. Of these the most popular in Corea are the six following:\n\n(1) Miryek Posal, i.e. Maitreya 弥勒菩薩미력보살 or the coming Saviour, who will become a Buddha on his next incarnation. His figure is sometimes found in a separate shrine in some of the larger temples, sometimes as one of the attendant figures on Amida or Syekkamoni Buddha, over the high altar in the chief shrine. As already explained, the name Miryek is popularly given to all the isolated stone figures,—most of them of great antiquity—which may be found scattered far and wide over the hills and dales of Corea.\n(2) Ti-tjang Fosal 地藏菩薩 디장보살, who most commonly occupies the central position in the chapels specially devoted to the souls of the departed 安府殿 명부단 in the larger temples in Corea. Here he sits surrounded by his assessors the Ten Kings 十大王 십대왕 of the nether world, behind whose figures are depicted the ten several hells over which they respectively hold sway. He is one of the most popular Buddhist deities in Japan, where his name is pronounced Jizo Bosatsu and where he is represented especially as the kindly patron of departed children.\n\n(3) Koan-syei-eum Posal 觀世音菩薩 관세음보살 (Sanskr : Avalokitesvara Bodhisattwa) and\n\n(4) Tai-sei-chi Posal 大勢至菩薩대세 지보살 (Sanskr : Mahasthana Prapta Bodhisattwa) The figures of these two Bodhisattwas will often be found, standing or seated, in attendance on either hand of Syek-ka-moni Buddha (i.e. Gautama) or Amida Buddha, over the high altar in the chief shrine of a Corean Buddhist temple. Not unfrequently they are crowned. The tangled history of Koan-syei-eum—famous in China as Kwan-yin and in Japan as Kwan-non, the so-called \"Goddess of Mercy\"—would fill a volume in itself. Appearing first in Southern Buddhism as a male, it is as a female that this deity has become popular in China and Japan, although in Corea all specifically feminine traits appear to be absent.\n\n(5) Moun-sou Posal 文殊菩薩 문수보살 (Sanskr : Mandjusri Bodhisattwa) and\n\n(6) Po-hien Posal 普賢菩薩 보현보살 (Sanskr : Samanta Bhadra Bodhisattwa). The figures of these two Bodhisattwas—the former sometimes riding on a tiger, the latter on an elephant—are also fairly constant attendants on the central Buddha in Corean Buddhist temples, with or instead of the two just mentioned.\nThere is some reason for thinking that some at least of these Bodhisattvas were historical personages—early Buddhist missionaries in China, Nepal and elsewhere,—who have gradually been \"canonized\" by popular acclaim. To the more enlightened Buddhist they are personifications of some of the qualities of Buddha, his pity, his might, his wisdom and the like.\n\nYou will see how largely my paper is introductory to the great subject with which I want to deal. It is indeed only a porch, and I hope that subsequent writers, more competent and better equipped than myself, will introduce us to the building itself, with all its varied interests, and tell us something in detail of the history and development of Buddhism in the Corean peninsula. If I have not wholly worn out your patience, may I close this paper by indicating one or two lines along which I should like to see research pursued?\n\nFirst. I hope that someone may be found to give a connected history of Buddhism, in Corea from the year 372 A.D. when the monk Syoun-to 順道金土 arrived from China at the court of Ko-kou-rye, with the Buddhist missionary's usual impedimenta of books and images. Such a history of the Buddhist Church, after noting its spread from Ko-kou-rye to Paik-tjyei in A.D. 384 and to Silla in A.D. 528, would trace its fortunes through the palmy days of the Silla (A.D. 668-935) and Korye (A.D. 935-1392) dynasties, down to the day at the end of the fourteenth century A.D. when (largely, as it seems, through the fault of some of its leading representatives) it fell into disfavour with the rise of the Yi dynasty to power—a disfavour from which it has never recovered except for one brief period during the reign of King Sei-tjo, 世祖大王 세조대왕 A.D. 1456-1469. Such a history would moreover have much to tell us not only of the main outlines of Buddhist history in this country, but also of the lives of famous missionaries from India and China, who found their way hither, as well as of natives of the Corean peninsula, who attained to rank and fame in the Buddhist community. Some at least of the larger temples in Corea have interesting galleries of portraits of the more famous abbots who\nhave borne rule within their walls. In this connexion it is worth noting that Mr. Beal, in his introduction to \"The Life of Hiuen Tsang,\" quotes from a well-known Chinese book of Buddhist biography¹ the names of no less than six inhabitants of Corea, among the pilgrims who in the latter part of the seventh century A.D. found their way from China to India, to visit the sacred scenes of Gautama Buddha's life.\n\nSpace too must be found for such a famous trio as Chi-kong, 指空 지공 Mouhak, 無學 무학 and Ra-ong, 懶翁 라-옹 whose portraits you may see in the great monastery of Hoa-chang-sa² near Songdo and in what is left of the even greater temple of Hoi-am-sa³ in Yang-chu prefecture, some thirty miles north-east of Seoul. Chi-kong (\"he who points to the void\") was a native of India, who appears to have found his way to Corea as late as the fourteenth century of our era, while Ra-ong and Mou-hak were respectively court chaplains and preceptors to Kong-Min-Oang 恭愍王 공민왕 (A.D. 1352-1388) the last of the Korye kings and Yi Tai-tjo 李太祖 리 태조 (A.D. 1392-1399) the founder of the Yi dynasty. And the tombs (or Pou-tou) raised over the relics (or Sa-ri) of this famous trio may still be seen among the striking remains of Hoi-am-sa, above referred to. If such a line of historical study as I have indicated is to be pursued, I would plead not only for a careful search in the printed records of the realm, like the Sam-kouk-sa 三國史 삼국사 and the Tong-kouk t'ong-kam 東國通鑑 동국통감 but also for a study of the many inscribed tablets, still remaining on the sites of a large number of the older temples in Corea.\n\nSecondly, there is the literature of Corean Buddhism. Of course this must be largely the same as the literature of Buddhist China. But it would be interesting to see which of\n\n¹ The 高僧傳 quoted in Beal's Life of Hiuen Tsang. London 1911 pp. XXV-XLI.\nthe Buddhist Scriptures have taken firmest hold of Corea and how far it has been found possible and useful to translate them into En Moun. M. Courant in his great Bibliographie Coréenne gives a list of nearly one hundred different Buddhist books, which to his knowledge have been printed in Corea. But I myself possess some which do not come in his list, and there must be many others. My own impression is that a study of the Buddhist books most in use in Corean temples will reveal the fact that there is very little of the old literature, common to north and south and to both Greater and Lesser Vehicles, but that most of it represents an era when the Buddhism of the north had largely parted company with that of the south and had become infected with many of the superstitions which had been imported from Thibet. But I should fancy that \"The Lotus of the Good Law\", 妙法蓮華經요법련화경 so dear to Nichiren in Japan, and the Amida and kindred Sutras are the most popular of all.\n\nThirdly, I should like to see a series of monographs on some of the most famous monasteries of Chosen, most of which preserve in their archives some record of their foundation and history. Now that the Diamond Mountains in Kang-ouen-to 江原道金剛山 강원도금강산 have been rendered so accessible, I suppose we may hope before long to have detailed and reliable accounts, historical, artistic and topographical, of the great abbeys of You-Tyem-sa 檜帖寺 유덤사 Chang-an-sa 長安寺 장안사 Fyo-houn-sa 表訓寺 표훈사 and Sin-kyei-sa 新溪寺 신계사, as well as of the lesser shrines by which they are surrounded. But it is a great mistake to suppose that, when we have exhausted the Diamond Mountains we have come to the end of all, or even of the most interesting, of the Buddhist temples of Corea. Not far from Gen San and from the Diamond Mountains is the great and famous temple of Syek-oang-sa, in the prefecture of An-pycn 安邊郡釋王寺 안변군석왕사, while I myself found an almost unworked mine of great historical and artistic interest last summer in Tai-pep-chu-sa, 報恩郡大法住寺 보은군대법주사 the great\ntemple in the prefecture of Poeun situated in the famous mountain-range of Syok-ri-san, which divides Chyoung-chyeng-to from Kyeng-syang-to. But the most interesting of all are probably to be found in the southern provinces of Kyeng-syang-to and Chyen-ra to (Cholla do), which boast among others the great temple of Foul-kouk-sa 慶州郡佛國寺 경주군불국사 (glorious even in its decay, it must have been a dream of beauty in its pristine splendour) and many another replete with reminiscences of the old Silla court at Kyen-g-chu. Heretofurther south are the three great metropolitical abbeys of Buddha, the Law and the Church, namely Tong-to-sa in Yang-sin prefecture 梁山郡通道寺 양산군통도사, Hai-in-sa in Hap-chyen prefecture 陜川郡海印寺 합천군희인사, and Song-koang-sa in Syoun-t'yen prefecture 順川郡松廣寺 순천군송광사.\n\nTucked away in the hills and valleys close round Seoul must be some scores of monasteries and nunneries, great and small, all or most of which could a tale unfold, though the great establishments of military monks 僧警승영 in the hill-fortresses of Pouk-han 北漢山城 북한산성 and Nam-han 南漢山城 남한산성 have fallen on evil days, resulting in the destruction of not a few of the temples with which they used to be thickly covered. The old island fortress of Kanghwa (some 30 odd miles N.W. of Seoul) still boasts one temple of great historic interest, Chyen teung-sa, 江華郡傳燈寺 강화군전등사, but most of the subsidiary temples have fallen into decay or disappeared altogether. It is a curious fact that, although Buddhism has been in such disfavour with the Yi dynasty, it seems always to have been the custom to erect a Buddhist temple in the neighbourhood of a royal tomb. Such a temple is the important one of Pong-eun-sa, in Koang-chu prefecture 廣州奉恩寺 광주봉은사 (on the opposite side of the Han river to the Seoul Waterworks at Teuk-syem), near the tomb of King Syeng-chong 成宗大王 성종대왕 (A.D. 1470-1495) while an even larger one, Ryong-chyou-sa, stands about three or four miles south of Syou-ouen 水原郡龍珠寺 수원군용주사 near the tomb of King Chyeng-tjo 正祖大王 정조대왕\nwho reigned A.D. 1776-1800. It is impossible to give here a list of all the Buddhist temples in Corea: but the publication of such a list—or at least a list of the most famous ones—is a task that might well be undertaken by our branch of the Royal Asiatic Society, and would be of real value to the student.\n\nLastly, I would ask for a careful consideration of the architectural arrangements, and also of the objects of worship, displayed in Corean temples, as well as of the routine of life followed therein. So far as my investigations have carried me, the usual arrangement of a temple of fair size is as follows. Omitting reference to the entrance gates and pavilions, as well as to the bell and drum towers, the stone pagodas and ornamental lanterns, there is first and foremost the \"Great Chamber,\" 大寮 큰방 or common refectory and dormitory of the great body of the monks—the abbot (formerly known as Ch'ong-syep, 總攝 총섭 but nowadays as Chou-chi 住持 죄지) alone living apart. And adjoining this is the great monastic kitchen. Generally on the far side of a courtyard at the back of the \"Great Chamber\" is the central shrine or Pep-tang 法堂 법당. If its name board displays the characters for \"Temple of supreme bliss\" 極樂殿 극락단 I am told that you may expect to find the figure of Amida Buddha occupying the central place over the altar, probably flanked by figures of Koan-syei-eum Posal and Tai-syei-chi Posal. If on the other hand the name board bears the inscription \"Temple of the Great Hero,\" 大雄殿 대웅단 you may expect to find Syek-ka-moni Buddha (i.e. Gautama) seated in the middle, flanked either by the two same Bodhisattwas or by Moun-sou Posal and Po-hien Posal, though occasionally other Bodhisattwas like Ti-tjang Posal or Mi-ryek Posal are found in this position. Less frequently you will find Yak-sa Yerai 藥師 如來 약사여래 the \"healing Buddha\" (usually a white figure), whose place in Buddhism I have never been able satisfactorily to ascertain, seated in solitary state over the altar of the central Pep-tang. And in one of the largest temples I have ever seen in Corea, the titanic figures over the altar represent the mystic\nBuddhist Trinity, Vairochana, Loshana, and Sakyamuni (referred to above on p. 19). The altar is usually a handsome piece of panelled wood-work, running nearly the whole length of the building—the panels in some cases being beautifully carved and coloured.\n\nApart from the central shrine, there is nearly always in the larger temples, a Myeng-pou-tyen 真府殿명부전 or \"Temple of the Nether World,\" devoted to the souls of the departed. Here the kindly Ti-tjang Posal sits enthroned with his ten assessor judges, whose statues are backed by blood-curdling pictures, depicting the horrors of the several hells over which they preside. In the larger temples you will sometimes also find a special shrine, containing the images of Gautama Buddha's five hundred Arhat or disciples 羅漢殿라한전, with the Master himself seated in the midst. In others not quite so large this secondary shrine will contain only Gautama Buddha himself and sixteen Arhat. (Curiously in China this more restricted number is always eighteen). And nearly everywhere, in temples great and small, you will find two tiny shrines devoted respectively to the cult of the Constellation of the Great Bear (the \"Seven stars\") 七星閣칠성각 and to the \"Spirit of the Hill\" 山神산신 on which the temple stands, with sometimes a third one to the \"Lonely Saint,\" 獨聖人독성인 who is, as far as I can make out, the Chinese recluse Chi-kai, 知凱지가 founder (in the sixth century A.D.) of the famous T'ien-tai (Japanese Tendai) 天台天台 school of Buddhism, so-called after his place of retirement, T'ien-tai-san, in the neighbourhood of Ningpo.\n\n\"The picture which confronts the student of Buddhism in Corea is,\" says Mr. Hackmann¹, \"on the whole a very dull and faded one.\" Possibly this is true, possibly also the day of Buddhism in Corea is past. Still sufficient of that past survives into the present day to shew how powerful it once was and to make its study one of enthralling interest. For a thousand\n\n¹ In his interesting work \"Buddhism as a Religion,\" published in London 1910.\nyears—from 372 to 1392 A.D.—it exercised an almost undisputed sway over the inhabitants of this peninsula—a sway so prolonged and so undisputed that it cannot fail to have left its mark. The number of its professed adherents may now be comparatively small, and many of its most famous shrines have fallen into decay. But the countless solitary stone pagodas and figures of Miryek to be found all over the country witness to the former wide spread of what must have been once a very living faith, while there is hardly a mountain in Corea whose name does not hear testimony to the domination of Buddhist ideas and phraseology in the older days when the names were fixed. And the place-names of many a village and hamlet (\"Pagoda Village,\" \"Temple Valley,\" \"Township of Buddha's Glory,\" \"Hamlet of Buddha's mercy\" and the like) tell the same tale. Possibly too, in that indefinable charm and affectionateness of manner which most of those who know them find in the Corean people, is to be seen an even clearer mark of the past influence of that great Teacher, who, whatever his faults and shortcomings, certainly laid supreme stress on gentleness and kindness to others, and of whom we may say, (with that stout old Christian traveller of the middle Ages, Marco Polo) \"Si fuisset Christianus, fuisset apud Deum maximus sanctus.\"\nAPPENDIX.\n\nVOCABULARY OF SOME OF THE COMMON TERMS USED IN KOREAN BUDDHISM.\n\nAbbot (old title). 총섭 總攝\n,, (present title). 죠지 住持\nArhat (disciple of Buddha). 라한 羅漢\nBeg for alms, To (of mendicant monks). 동량하다 乞僧\nBodhisattwa. 보살 菩薩\nBuddha (in general). 부처 or 불 佛\n,, (Sakyamuni). 석가모니불 釋迦牟尼佛\n,, ,, 석가여리 釋迦如來\n,, (Amida). 아미타불 阿彌陀佛\nBuddhism. 불교 or 불도 佛教 or 佛道\nLayman. 속인 俗人\nMonk (general term). 종 대사 僧 大師\n,, (polite). 대사 大師\nMonastery (general term). 절 寺\nMonastery (small cell). 암자 庵子\n,, (for women). 승방 僧房\nNirvana. 널반 涅槃\nPagoda. 탑 塔\nRosary (of prayer-beads). 념주 念珠\nScriptures (Buddhist). 불경 佛經\nTemple (place of worship). 법당 法堂\nTemple lands. 불항탑 佛亭畷\nWorship (of Buddha). 불공하다 佛供\n,, 념불하다 念佛\n,, 저웁니다 献齋\nCOREAN COIN CHARMS AND AMULETS\n\nA SUPPLEMENT\n\nBy Frederick Starr\n\nThe literature regarding Corean coin-charms is almost confined to H. A. Ramsden's book—Corean Coin Charms and Amulets—printed in 1910. In that work the learned numismatist, whose death is a real loss to the study of Oriental coins, is practically the pioneer in an interesting but unknown field. He went earnestly into his subject and described and figured 207 pieces, some of which are only size varieties. He suggested a classification of types and his book must be the foundation for all further study of the subject. The paper here offered must be considered merely as a supplement to his work, adding to his list new types which he failed to secure. It will be assumed that the reader is familiar with the Ramsden book or has it at hand for reference. Most of the new types herein mentioned are in the collection of the author, the few pieces that are in other hands are referred to their present owners. Mr. Ramsden reprinted his book, in brief sections, in the Philatelic and Numismatic Journal, of which he was editor at the time of his death; in that reprint he added some types, most of which are described here. As, however, he assigned no numbers to these and the Journal is exceedingly difficult to find for reference, we have proceeded as if such announcement had not been made. We have arranged our new types in the order of classification suggested by Ramsden and have then numbered them consecutively, beginning with number 208. In cases where the pieces fit into his classification, we have mentioned the numbers in Ramsden which these would naturally follow to facilitate reference and comparison. We do not feel that Ramsden's classification was perfect; in fact we think it could easily be improved; but a new classification\nwould require a complete overhauling and republication of all material. We have therefore made no changes. Ramsden gives full varietal value to size differences, even when slight, assigning independent numbers to each; this seems particularly undesirable, but even in this we have followed him.\n\nTwo hundred and seven of these coins was a very considerable number and one who knew Ramsden's diligence as a collector might well anticipate that the list could not be greatly extended; sixty-six pieces are however here described and listed. Where these are only new combinations of designs illustrated by him no attempt is made to figure the pieces, but a mere statement of the combination in Ramsden's numbers is given. Of new designs, rubbings or photographic illustration and description are given. In description Ramsden's formula is regularly followed. The author confesses to confusion in the use of the terms obverse and reverse and admits inconsistencies. Sometimes he has felt that the pictorial side should be considered the obverse in pieces where there are characters on one side and a pictorial design on the other; this is surely a justified assumption in those charms, where figures in high relief occur on one side, while a nearly flat surface occupied by characters surrounding a simple symbol forms the other. But one who knows the extreme significance attributed to characters in the Orient may well doubt whether the pictorial side is the more important one in such a case for example as No. 256.\n\nRamsden's classification was into fifteen classes, as follows:\n\n(a). Large round coin ... ... ... 1 (1)\n(b). Figures and animals in high relief ... 2 to 20 (19)\n(c). Bats and butterflies ... ... ... 21 ,, 41 (21)\n(d). Fish shapes ... ... ... 42 ,, 44 (3)\n(e). Fan shapes ... ... ... 45 ,, 50 (6)\n(f). Weight shapes ... ... ... 51 ,, 70 (20)\n(g). Octagonal shapes ... ... ... 71 ,, 80 (10)\n(h). Hexagonal shapes ... ... ... 81 ,, 83 (3)\n(i). Scallop and star shapes ... ... ... 84 ,, 104 (21)\n(j). Pierced or open-work round coins ... 105 ,, 146 (42)\n(k). Round, with pictorial designs ... 147 ,, 160 (14)\n(l). Round with fancy designs ... 161 ,, 170 (10)\n(m). Round with plain characters ... 171 ,, 190 (20)\n(n). Round with simple fret-work character 191 ,, 197 (7)\n(o). Miscellaneous and odd shapes ... 193 ,, 207 (10)\n\nThe number of types listed under each class is given above in brackets.\n\nPerhaps the most interesting of these coin charms are those with human figures in high relief on one side. They attract the attention of the most careless observer and present a great and perplexing variety. There are usually two figures, one of which holds a cup, the other a gourd. Of these two figures Ramsden says; they \"present a difficulty of identification. Japanese collectors believe them to represent male and female figures, of man and wife, in relation to the principal object and purpose to which they are intended. Kainz, on the other hand, although not specially attributing these charms to Corean origin, says that they represent the two door-keepers, Yuek and Liu, 'welche in den Haenden Vasen halten and gegen boese Machten schuetzen sollen'.\" While the Japanese view is natural and the difference between the objects carried by the two persons is suggestive, there is no reason to consider these figures in Corea male and female; they are rather \"the heavenly twins,\" \"the boys, messengers from heaven,\" whose wooden figures form a part of the outfit used regularly in the wedding ceremony.\n\nThese coins with human figures in high relief show perplexing variation and in the endeavor to give easy identification of any given specimen I have constructed a little table, which is here reproduced. Ramsden had nine varieties, I have sixteen; two of his are not in my collection, so that the table shows eighteen varieties. The number of the figures and the number of circles, single or double, used in connection with them are used as a first basis of recognition, while the reverse design is then noticed. Should collectors find other types, it\nwill be easy for them to check them into the table in their proper places.\n\n**TABLE OF CHARM-TYPES WITH HUMAN FIGURES IN HIGH-RELIEF.**\n\n| I. One figure | II. Two figures |\n|---------------|----------------|\n|               | No circles     |\n|               | 1 on each side |\n|               | 2              |\n|               | 3              |\n|               | 5 circles      |\n|               | 6              |\n|               | 7              |\n|               | 8              |\n|               | 9              |\n\nReverse design.\n\nThose marked O are in my collection; those marked x are in Ramsden but not owned by the author.\n\nIn his translation of characters on the pictorial pieces, notably in the series of pierced or open-work coins, Ramsden appears to overlook the fact that famous Chinese poems are either given or implied. His translations are no doubt adequate for numismatic needs. To know that No. 120 bears the words \"sage\" and \"congratulatory animal\" may be sufficient but what the inscription really conveys is—\"Kirin salute when a sage is born.\" Numbers 123 and 126 together make a famous couplet. Ramsden says: \"virtuous woman, charming\" (No. 123) and \"morally a great man\" and \"speak well\" (No. 126); better translations of the latter are \"morally great man\" and \"good partner.\" Taken together these give \"A charming virtuous woman is a good partner for a morally great man.\" Number 133, which Ramsden translates \"bird ceremony,\" \"congratulatory animal\" are better translated\n\"sage,\" \"hōo salute\" and is analogous to No. 120—\"hōo birds salute when a sage is born.\" Number 134, \"fish leaps,\" \"dragon mounts\" (better \"dragon-gate\") becomes in sense \"at the dragon gate the fish leaps,\" which is rather easily understood. Number 136, \"plum, bambu, spring rich\" is equivalent to \"plum and bambu are the wealth of the springtime.\" There is really a good deal of the poetic in this series of charms, and one who studies them from the side of art and psychology will find much of interest.\n\nWe may now present our new material. Out of the 66 pieces 55 are our own; one belongs to Edwin Wade Koons of Seoul and ten to Shioya Kisaburo of Iwakuni, Japan. I am obliged to these gentlemen for the rubbings illustrating their pieces.\n\n(b).—Figures and animals in high relief.\n\nNo. 208. Octagonal.\n\nObverse: Male figure in high relief; back-ground a mesh of lines, which may be meant for characters. (Plate III. 2)\n\nReverse: Curious figure of a standing man; made in lines of low relief; characters at sides.\n\nNo. 209.\n\nObverse: Two figures standing; no circles at sides; inner margin of rim-band serrate; otherwise like No. 5. (Plate III. 4).\n\nReverse: Square with fortune character; constellation; three stars above, four below.\n\nNo. 210.\n\nObverse: Same as No. 5. Two figures with circle on each side.\n\nReverse: Same as No. 18; seal character for good luck at centre; butterflies above and below, birds at sides.\nNo. 211.\n\nObverse: Two figures; single circles on each side; seven cup-depressions in the broad, flat, rim; inner border of this plain, not serrated as in most similar types. (Plate III. 7).\n\nReverse: Same as No. 10. Swastika pattern.\n\nNo. 212.\n\nObverse: Same as No. 5. Two figures with circle on each side.\n\nReverse: Square with characters, fortune; three stars above, four below.\n\nNo. 213.\n\nObverse: Same as No. 5. Two figures with circle on each side.\n\nReverse: Same as No. 9. Yin-yang symbol, with three-star constellation above and below.\n\nNo. 214. Like No. 6, but smaller.\n\nNo. 215.\n\nObverse: Two figures; butterfly above, bat (or leaves?) below; cf. No. 6; two circles on each side and two circular characters. (Plate III. 1).\n\nReverse: Same as No. 17. Yin-yang symbol, surrounded by characters.\n\nNo. 216.\n\nObverse: Two figures; three circles above and below; double circles at sides. (Plate III. 3).\n\nReverse: A slight variation from No. 17. Yin-yang symbol, surrounded by eight characters.\n\nNo. 217.\n\nObverse: Two figures; eight circles.\n\nReverse: Plum blossom design.\n\nThis piece, inserted in the table, with the specimen in hand, has disappeared; fuller description is therefore impossible.\nNo. 218. With suspension-loop.\n\nObverse: Butterfly. Same as reverse of No. 5. Larger in size.\n\nReverse: Swastika pattern. Same as No. 10.\n\nNo. 219. Same designs; smaller size; no suspension loop. Obverse, as the reverse of No. 5; reverse, as No. 10.\n\nNo. 220.\n\nObverse: Butterfly, or bee (?).\n\nReverse: Yin-yang symbol with double circles at sides; clouds above and below.\n\nNo. 221. Narrow, sharply-marked rim.\n\nObverse: A butterfly, raised, on a flat surface. (Plate III. 9).\n\nReverse: Within the narrow rim, is a wide ring of the same flat surface; within, above and below are bats and between them a squared character, 福, blessing; double circles at the sides of this.\nNo. 222. Crenate; with suspension loop.\n\nObverse: Crane and plum-blossom. (Plate III. 4).\n\nReverse: As No. 17. Yin-yang symbol and characters.\n\nNo. 223. With pierced knob at top for suspension.\n\nObverse: Two flying cranes, facing different directions.\n\nReverse: Eight characters, apparently the same as in Ramsden's No. 92 surrounding an eight pointed central space.\n\n(c).—Bats and Butterflies.\n\nNo. 224. With pierced knob at top, for suspension.\n\nObverse: Two birds in flight and a bat; seven circles, distributed over space between; rim of two concentric circles. (Plate III. 8).\n\nReverse: Rim of three concentric circles of differing width; Yin-yang symbol and seven pittings in a central\nsquare field; at sides two concentric circles, with centre-pittings; characters above and below—天地; heaven, earth. (Cf. No. 2).\n\nNo. 225. Crenate. With suspension loop.\n\nObverse: In upper field two birds and a bat (cf. No. 3); a kirin in lower field. (Plate III. 10).\nReverse: Same as No. 17; a yin-yang symbol, surrounded by eight characters.\n\nNo. 226. Butterfly-form; outline conventional crenate circle; pierced circles bring out design and openings mark out legs and thorax; characters on each side of body, on the middle of wings.\n\nObverse: 長福; long-life, blessing.\nReverse: 康寧; peace, comfort.\nRamsden's No. 24, but with openings through.\n\nNo. 227. Cf. No. 25; but open-work. Two bats facing; central square hole, bordered by double line; four characters at each side.\n\nObverse: 長福康寧; long-life, blessing, peace, comfort.\nReverse: 富貴多男; many sons, wealth, nobility.\n\nNo. 228. Two bats facing; central square hole; four characters on each side of piece.\n\nObverse: 五子登科; five sons pass examination.\nReverse: 相輝組綴; shine reciprocally.\nComparable with 26, 27 of Ramsden, but with different detail.\nNo. 229. No doubt derived from a design like No. 36, but no actual butterflies; centre a five-petalled flower.\n\nObverse: 九五福康寧; nine, five, fortune, peace, comfort.\n\nReverse: 八千歲春秋; spring and autumn (i.e. age) eight thousand years.\n\nNo. 230. Butterfly, neatly and sharply worked out; square hole in the body; antennae, open-work. One character on each side of the body.\n\nObverse: 金鼎; golden vessel (for food).\n\nReverse: 玉燭; jewel-candle.\n\nNo. 231. Butterfly pattern; stamped out; thick; crude work; alike on both sides.\nNo. 232. Like Ramsden's 32, but set into a rim as a coin-like piece. Copper. (Shioya collection).\n\nNo. 233. Compare this with the last number; the design is the same but the horse takes the place on both sides of one character and part of two of the bats. Copper. (Shioya collection). There is probably a stamped-out brass or bronze form of this same type in the regular Korean series.\n\nObverse: 子昌盛; prosperous sons.\nReverse: 寿康寧; long-life, peace, comfort.\nNo. 234. Like Ramsden's 38, but set into a rim, as a coin-like piece. Copper. (Shioya collection).\n\n(f).—Weight Shapes.\n\nNo. 235.\n\nObverse: Characters, one on each side of square hole; four small circles, one above and one below each character.\n\nReverse: Similar arrangement, but no small circles. Like Ramsden's 62, except for the four circles on obverse.\n\nNo. 236. Square characters as each side of square hole.\n\nObverse: 福壽康寧; long-life, blessing, peace, comfort.\n\nReverse: 富貴多寧; wealth, nobility, full of peace.\nNo. 237.\n\nObverse: One character on each side of the square hole 寿福; long-life; fortune.\n\nReverse: Designs of uncertain significance; a constellation and a gourd?\n\nNo. 238. Rather wide, flat, rim; square characters on each side of the square hole; cup depressions in the horns.\n\nObverse: 寿福; long-life, blessing.\n\nReverse: 康寧; peace, comfort.\n\nNo. 239.\n\nObverse: Conventionalized rounded characters, one on each side; small circle above and below each.\n\nReverse: Similar arrangement. Characters are undecipherable.\nNo. 240. Ramsden's 56 without crenate margin and set in wide-rimmed, solid, coin-like piece. Copper. (Shioya collection).\n\nNo. 241. Compare with Ramsden's 62. The characters and general plan are the same; but margin not crenate, and the whole is set into a wide-rimmed, coin-like piece. Copper. (Shioya collection).\n\nNo. 242. Different from any weight-shaped piece in Ramsden or Starr collection. Set into a wide-rimmed, solid, coin-like piece. Copper. (Shioya collection).\nObverse: 寿福; longevity, happiness.\nReverse: 康宁; peace, ease.\n\n(g).—Octagonal Shapes.\n\nNo. 243. Octagon; knobbed. Circular hole at centre; characters on both sides.\n\nObverse: 孝悌忠信禮義廉恥; loyalty, fidelity, piety, brotherliness, ceremony, righteousness, integrity, shame.\n\nReverse: 寿福康宁…………; peace, propriety, frugality, long-life, happiness………….\n\n(h).—Hexagonal Shapes.\n\nNo. 244. Hexagonal, with knobs at corners; four characters on each side.\n\nObverse: 忠孝傳家; loyalty, fidelity, for generations.\n\nReverse: 寿福康宁; nobility, fortune, peace.\n\nNo. 245. Same as No. 244, but smaller in size.\n(i).—Scallops and Star Shapes.\n\nNo. 246. Two sides alike; characters 太平萬歳; peace through ten-thousand years. Openwork, stamped out.\n\nNo. 247. Ramsden's 92 set into a wide-rimmed, solid, coin-like piece. Copper. (Shioya collection).\n\nNo. 248. Pierced near border with three threes of holes and a triple hole at top, for suspension. Characters in central circular spaces—如意; all to your desire.\nNo. 249. Crenate circle; circular hole; each division of the crenate outline, has a shallow disk-pit sunk in it, eight on each side. Thick, crude.\n\n(j).—Pierced or open-work round coins.\n\nNo. 250. Open-work coin, A demon rides upon a hoō bird, which is eating kiri. The two sides are practically the same.\n\nNo. 251. Open-work coin. Two hoō birds and clouds. The two sides are alike.\nNo. 252. Ramsden's 128, but is solid and set into a wide-rimmed, solid, coin-like piece. Copper. (Shioya collection).\n\nNo. 253. Open-work coin; circular central hole; neat, sharp rims; two large leaves, one on either side of hole, bear characters.\n\nObverse: 祥雲滿香; lucky cloud full of fragrance.\nReverse: 和風甘雨; peaceful breeze, sweet rain.\n\nNo. 254. Open-work coin; circular central hole; sharp rims; four spaced plum-blossoms; characters above and below.\n\nObverse: 寒梅着花; cold, the plum blossoms.\nReverse: 香旺; fragrance gushes forth.\n(k).—Round with Pictorial designs.\n\nNo. 255. Large, thin, open-work coin. Central part is No. 160 of Ramsden; then comes the open-work zone, and the rather wide rim.\nObverse: Mountains, clouds, water, herbage, pine, deer, tortoise, crane. On central coin, four yin-yang symbols alternate with characters—壽富多男—many sons, long-life, wealth.\n\nReverse: Open-work zone much the same. On central coin the characters—吾君萬年—may our lord live ten thousand years.\n\nNo. 256. Large medal, with suspension ring; bold, high work; broad rim.\nObverse: Characters grouped, with circles alternating—壽富貴男—sons, long-life, wealth, nobility.\n\nReverse: Fret pattern, repeated disconnectedly sixteen times, around border; two dragons, facing, heads down, with jewels.\n\nNo. 257. Large coin-like piece, with an octagonal hole. Has been pierced, near the rim, with seven perforations, apparently for suspension and to make it serve as a chatelaine.\n\nObverse: Around central hole a mass of clouds; around this a wide zone bearing the characters—永言配命自求多福—eternal word adapted to fortune, truth harmonizes with fortune.\n\nReverse: Mass of clouds around central hole; upon the outer zone the constellation of Ursa major and waves.\n\nNo. 258. Same as No. 154, but larger, and slightly varied details; note tail of male , and female .\nObverse: 凤儀薫殿; Phoenix appearing salute, fragrance fills palace.\n\nReverse: Phoenix (hoō birds) fill space around the central hole.\n\nNo. 259. Companion piece to preceding.\n\nObverse: 聖世遊麟; in the age of a sage, kirin come out and play.\n\nReverse: Two kirin fill the space around the central square.\n\nNo. 260. Coin, square-holed; flat, rather wide rim.\n\nObverse: Characters 龍鳳; dragon, phoenix (hoō).\n\nReverse: A dragon and phoenix (hoō).\nNo. 261. Round, coin-like; wide rim; square central hole.\n\nObverse: 壽福康寧; long-life, happiness, health, peace.\n\nReverse: Figures, one on either side.\n\nNo. 262. In delicacy of work and nature of design this reminds of the open-work numbers 112-133; The rubbing permits little more to be made out than the flying bird. Because the pattern is markedly different from any other the cuts are inserted. Wide-rimmed, solid, coin-like piece. Copper. (Shioya collection).\n\nNo. 263. Wide-rimmed, solid, coin-like piece. Copper. (Shioya collection).\nObverse: Four characters about central square hole. 五一成節; five—succeed jointly.\n\nReverse: Clouds and sun design? Comparable to last, but neither is sharp.\n\n(m).—Round with Plain characters.\n\nNo. 264. Coin-like, but with narrow rim and inner raised line; the central square hole is also double bordered; of pewter or some lead alloy.\n\nObverse: 五子登科; five sons passed examination.\n\nReverse: 連仲三元; may the dynasty continue through thrice a universe. (Heaven, earth and man)\n\nNo. 265. Large, coin-like.\n\nObverse: 太平安樂; peace, case, luck.\n\nReverse: 壽富多男; long-life, wealth, many sons.\nNo. 266. Very like ordinary coinage; wide-rim.\n\nObverse: 忠孝傳家; loyalty and fidelity, from generation to generation.\n\nReverse: 衣冠繼世; garment and crown (position) pass from father to son.\n\nNo. 267. Very like ordinary coinage.\n\nObverse: 萬壽無疆; ten thousand years of age, no limit.\n\nReverse: 如岡如陵; like a hill, like a mountain.\n\n(n).—Round, solid, with single concave character.\n\nNo. 268. Broad rimmed, coin-like; large character on either side in raised but hollowed work; loop for suspension.\nObverse: 海; sea.\nReverse: 富; wealth.\nThis may represent a series completely unknown to Ramsden.\nAlso without loop.\n\nNo. 269. Broad-rimmed, coin-like; large character on either side, in raised but hollowed work; loop for suspension.\nObverse: 多; many.\nReverse: 男; sons.\n\n(o).—Miscellaneous and odd Shapes.\n\nNo. 270. Stamped out; the two boys; no inscription. The two sides differ strikingly in the support or lower part. (Koons collection.)\n\nNo. 271. Two jewel-symbols crossing. (Cf. No. 205).\nNo. 272. Sharply stamped-out piece; pouch-shaped; alike on the two sides; bears conventionalized characters—壽; long-life. 福; happiness.\n\nNo. 273. Open-work piece; thick; poor work.\n\nObverse: Has four pit depressions in the round knobs.\nReverse: Flat, without pittings.\n\nThe pieces in Mr. Shioya's collection give rise to some curious questions. He has perhaps eighteen or twenty specimens of which all but ten (numbers 231, 232, 233, 239, 240, 241, 246, 251, 261, 262) which are here illustrated and described are included in Ramsden and are identical with Corean specimens in size, type and inscription, but are made of copper. Those here illustrated are fundamentally the same as Ramsden's specimens,—except 232, 241, 261 and 262—but are included in coin-rims and are solid, like coins; these also are all of copper, not of brass or bronze like the Corean specimens. All of them are from Formosa and were collected there by Mr. Shioya personally; he was much surprised when I attributed a Corean origin to them. In his collection there was also one of the elaborate chatelaines, identical with No. G. 8, of my classification. An independent origin in Corea and Formosa is quite impossible: such identity of types, inscriptions, and combinations of unrelated elements is not to be expected. Where did these things originate? Are they Formosan, introduced from there into Corea, or were they introduced into Formosa from Corea? When and how, and\nwhy, were they introduced from one to the other? Which is the probable older idea—pieces stamped out in weight-shaped, crenate, or butterfly-like forms, or similar patterns and shapes included in rims and made in coin-like form? In other words which is more primitive and natural, the Corean or the Formosan type? There is another alternative, theoretically possible and very simple and immediate. Might the types have been developed in China, fully fixed and conventionalized, and then transferred to Corea and Formosa, both of which have indeed looked to China as a teacher? Chinese numismatics is a long-established science; Chinese coins, coin charms and amulets are well known. Ramsden himself, had perhaps the finest collection of Chinese coins in foreign hands—it is inconceivable that a Chinese series of this kind, parent of the Corean and Formosan, could have been overlooked.\n\nWhen we come to study the chatelaines in detail we shall find that the chatelaines of class G—\"combinations of coin charms\" are usually composed of elements which are identical with the coin-charms described and figured by Ramsden. Occasionally in these chatelaine combinations we find elements not yet known as independent pieces. We believe that we are justified in all such cases in assuming that these actually do exist as coin charms and might be added to the list. We have not added them, but the studious reader will easily pick out such here and there and will have no difficulty in locating them in their proper place in the classification.\n\nTo us, who approach this entire subject more from the ethnographic than the numismatic viewpoint, the chatelaines to which these coin-charms are attached are quite as interesting as the coin-charms themselves. Ramsden only hints at their variety and illustrates but a half-dozen types representing several different classes. We have made a considerable collection and have thought it worth while to go into some study of them (a) because they represent a special art; (b) because they exhibit an exuberance of fancy and imagination; (c) because one of them, for one reason or another, call for special com-\nment; and (d) because with a great series before us, we can suggest a classification and point out types and groups. These chatelaines form the basis or backing for an elaborate and complicated mass of ornament and symbolism. To them are attached streamers of ribbon upon which these coin charms are threaded; the ribbons are of different colors and the coin charms or coins—for sometimes true coins are also used—vary in size and form. A well made example may carry scores of coin charms upon a dozen or more ribbons. Such objects are called by the Corean name of *yurl-shoi-pai* and were given to brides or were constructed by them from coin charms, gathered and hoarded for the purpose. The chatelaine backs are liberally furnished with metal rings, to which the keys of the young housekeeper were suspended. The form, bulk and weight of these things must have seriously interfered with their convenient use as key-carriers, but the good luck influences from the coin charms with their favorable symbols and auspicious inscriptions no doubt more than compensated. (Plate I.)\n\nWhile Ramsden attempted to exhaust the subject of the coin charms themselves he did not do the same by the chatelaines. He pictures but six examples, selecting them to illustrate a few classes. He recognized four groups: (a) the happy couple; (b) the long life character; (c) open work designs in great variety; (d) a mass of coin charms. Of these he considered (a) and (b) the older. This classification is entirely inadequate and we venture to propose a new arrangement. We assign letters to the classes or groups and numbers independently under each, so as to permit of locating new types readily in the scheme.\n\n**Proposed Classification of Chatelaines.**\n\nA. Solid; crenate; with two figures, good-luck character and crane. Ramsdens No. 20, or a variant of it.\n\nB. Solid; demon-head at top; with two figures and central character.\n(a) With evenly rounded border.\n(b) With crenate border.\n\nC. Heavy, solid work; high relief; alike on the two sides.\n\nD. Open work: dragon patterns.\n\nE. Central character; heavy and firm, but with some open-work; foliate or floriate decoration.\n\nF. Fragile, floriate or foliate, open-work; with or without central character and dragon elements.\n\nG. Combinations of coin charms.\n(a) Frail forms, related to preceding group.\n(b) With enclosing fret-work border.\n(c) With simple border, or none at all—resolving itself into a simple mass of attached coin charms.\n\nH. A single, simple piece, like a coin charm.\n(a) Round—solid, or open-work.\n(b) Octagonal.\n(c) Of fancy form; as the butterfly—Ramsden's No. 22.\n\nI. Solid; heavy; sharply stamped; pouch or gourd forms.\n\nWe will now pass to the detailed description of types under these groups.\n\nA. The chatelaine is Ramsden's 20, or a variant. We believe this is always a chatelaine or carrier (Plate II.) and never a coin charm as Ramsden thinks. The varieties it presents are shown in Plate IV. We shall call the side that bears the two figures the obverse. We have seen five obverses and three reverses.\n\n1. Obverse: flying cranes, facing in opposite directions, above and below the conventionalized character for long life; at right and left the two figures; in spaces two double circles and two marks of uncertain meaning. Reverse: a flower-like device, which stamped out becomes Ramsden's No. 17—with eight characters. (Plate II. Plate IV. 5).\n\n2. Obverse: a flying crane above, a bat below, the conventionalized character for long life; at right and left the two\nfigures; in spaces between character and figures are two double circles on each side. Reverse: as last. (Plate IV. 1, 5).\n\n3. Obverse: a flying crane above, a bat below, the conventionalized character for long life; at right and left the two figures; outside these a double circle on each side; in spaces around the central character four single circles. Reverse: as last. (Plate IV. 2, 5).\n\n4. Obverse: a flying crane above, a flower (or cloud pattern) below, the conventionalized character for long life; the two figures at the sides; outside of them a double circle on either side. Reverse: two dragons, one above, the other below, the conventionalized character for long life. (Plate IV. 3, 6).\n\n5. Obverse: a flying crane above, a cloud pattern below, the conventionalized character for long life; the two figures at the sides. Reverse: two dragons; one above, the other below, the conventionalized character for long life. (Plate IV. 4, 7).\n\nB. Solid; with demon-head at top. Two clearly marked, subdivisions—(a) with evenly rounded margin; (b) with crenate, or more or less irregular, margin.\n\n(a) 1. Obverse: two figures at the sides of the conventionalized character for long life; in the spaces between—above, a double circle, below, a cupule; around are five flying bats. Reverse: a dragon around a cloud pattern; plum blossom above; a flight of ten birds around; with nine characters between 福富貴多男子—meaning long life, blessing, strength; peace, wealth, honor, many sons. (Plate V. 1, 3).\n\n2. Obverse: the same as preceding. Reverse: Corean dog with flower; double circles and trio of small circles in triangle; a flight of seven birds around; also the nine characters as in preceding and some interspersed decoration. Plate V. 1, 4).\n\n3. Obverse: the two figures at sides of conventionalized character for long life closely surrounded by dots; outside of them double circles on each side; flight of five bats around.\nReverse: plum blossom design; surface around sprinkled with plum blossoms made of dots; double circle above; the nine characters of the preceding designs. (Plate V. 2, 5).\n\n(b) 1. Obverse: great character for long life; two double circles and four cupules symmetrically around it; the two figures in pairs on either side; outside these a double circle on each side; around are eight kirin. Reverse: a broad rimmed octagon, with plum blossom at centre and the eight characters around, meaning—\"One accomplishment leaves merit, amassing money is not treasure\"; around all is a flight of five bats. (Plate VI. 1, 3.)\n\nThis exists also in slightly coarser reverse.\n\n2. Obverse: great character for long life; four cloud symbols; around are eight kirin. Reverse: same as preceding. (Plate VI. 2, 3).\n\n3. Obverse: great character, 黃金萬, \"yellow gold ten thousand\"; two flying birds; figures of old man and woman; a butterfly below. Reverse: great character 寶進招, \"treasure calls\"; around on each side a flying bird, a butterfly, bhotan, bambu; at bottom, a bat. (Plate VI. 4, 5).\n\nC. Heavy, solid work; while at first sight suggesting B. b. it really differs in every detail. Two sides alike. At the centre is the highly conventionalized character for \"joy\"; surrounded by a complicated pattern composed of four or more butterflies. (Plate VII. 1.)\n\nD. Open-Work; dragon designs.\n\n1. Two finely executed dragon figures, symmetrically facing, in clouds. Obverse: raised, convex work; finely detailed. Reverse: hollowed, concave work; with characters 福主之昊太而身達虹赤喜蒼龍據腹而文皇之兆祥 \"when blue dragon writhes, many good omens appear as in the days of Munwhang; when red rainbow encircles the body, immense wealth grows up as in the period of Taiho.\" (Plate VII. 2, 3).\n\n2. Largest of all the chatelaines in my collection, measuring over $9 \\times 6$ inches. (The full-size rubbing is reproduced\nin the folding plate I). In a frame composed of two dragons facing, are ten large coin-like charms; the two sides are practically alike save for the characters on the coins.\n\n3. Octagonal frame; two dragons within; cloud above and mountain below a central plaque upon which are punctate characters 康寧, \"strength, peace.\" Alike on two sides. Yellow brass. (Plate VII. 4).\n\nE. Central character; heavy and firm, but with some open work; foliate or floriate decoration.\n\n1. Obverse: Available space divided into upper and lower panels; on the lower is the character for long life; on the upper, a plant in bloom. Reverse: on the lower panel is the conventionalized character for long life; on the upper, a plant design. (Plate VIII. 1, 2).\n\n2. Obverse: Much like preceding, but the two figures stand at the sides of the character and small details vary. Reverse: The character is less compact and is composed of coarser lines. The entire piece is smaller, but gives the impression of shortness with relatively greater breadth. (Plate VIII. 3, 4).\n\nF. Fragile, poor material; open-work, foliate and floriate designs; two sides alike.\n\n1. Central character for high, surrounded by a mass of foliate and floriate open-work. (Plate VIII. 5.)\n\n2. Flower-like design, surrounded by mass of foliate open-work. (Plate VIII. 6).\n\n3. Mass of foliate and floriate open-work, guarded at sides by dragons facing inward. (Plate VIII. 7).\n\nG. Combinations of coin charms.\n\nThis group is the most varied of all and ranges from well-made attractive forms to pieces of loose workmanship, ricketty and almost repellant. It may be roughly subdivided into lesser groups, but these scarcely deserve independent numbering. We may recognize (a) frail forms, somewhat like the last group; (b) forms with an enclosing border of fret-work;\n(c) forms with a simple border or none at all—becoming indeed mere masses of attached coin charms.\n\n1. Central part made up of nine charms—butterfly, coin-like, and open-work—all described in Ramsden; surrounded by a somewhat squarish, double, frame of foliate open-work, ending above in two dragons. (Plate IX. 1).\n\n2. Central part composed of eight butterfly, coin-like and stamped out charms, most of them given in Ramsden; double border of foliate and dragon design open-work. (Plate IX. 2). Notice the curious stamped out design above the butterflies; it is not yet known as an independent piece.\n\n3. Central part composed of nine butterfly, coin-like and open-work charms, all given in Ramsden; simple border of foliate and dragon open-work. (Plate IX. 3). While we constantly mention this work, here and in group F as \"foliate\" the dragon-idea is usually present in the foliation and in the present case we believe both bats and butterflies are suggested in this foliate border. In other words, we here have to do with undoubtedly ancient decorative designs, which have become conventionalized and broken down to the degree that the original ideas are almost or quite forgotten.\n\n4. More or less fan-shaped mass of coin-charms, thirteen in number and all given in Ramsden. At the centre is a large open-work coin-like piece; to it are loosely attached, by ugly connecting strips, coin-like, fan, butterfly, and weight charms; a handle is added. (Plate X. 1). This piece is a sample of the least attractive of all the chatelaines; the material is poor and rotten, breaking easily; the casting is badly done. Two specimens of this class, differing in the component charms, are here shown; others have been seen, one being larger than any here shown.\n\n5. Of same general character as the last, but with different component elements; without handle. (Plate X. 2).\n\n6. In this neat and attractive specimen, we pass to the second subdivision suggested above—those with a border of fret-work. Yet in some respects it is related to the two un-\nattractive and badly-made chatelaines just described. It too is fan-shaped, made up of known elements; but these are in direct contact, well cast, from sharp originals, in good material. All the elements are known as independent charms except the four small round bits bearing characters, which surround the upper butterfly; these seem to be parts of our No. 245. (Plate X. 3). The fret-work frame in this and the four following specimens is open-work.\n\n7. General form somewhat fan-shaped. Centre a mass of nineteen coin-like, open-work, fan and butterfly charms; also the four small round bits above mentioned; surrounded by a fret-work frame and surmounted by dragons. Here are combined the fan-shape of the last three specimens and the foliate-dragon open-work idea. The type differs from the other fret-work frames in having no protecting outer rim. (Plate XI. 1). The sides differ.\n\n8. Centre, a group of nine rather large coin-charms, all in Ramsden; surrounded by a horse-shoe shaped frame of fret-work, with an outer protecting rim and surmounted by the foliate-dragon open-work. (Plate XI. 2).\n\n9. General form rectangular; at centre is the great character for joy; surrounded by a frame of fret-work with outer protecting rim; surmounted by a group of charms—butterfly, coin-like, small round bits with characters—and foliate work. (Plate XI. 3).\n\n10. General form rectangular. Group of twenty-one coin-like, one stamped-out, and two butterfly charms; frame of fret-work with protecting rim; surmounted by foliate-dragon work. (Plate XI. 4).\n\n11. General form octagonal. Border, a narrow solid frame with fret design; within this the fundamental design is a tray vessel with a growing plant; above is the character for joy; scattered about, among the branches of the tree are nine coin-charms. (Plate XII. 1).\n\n12. Fan-shaped. Nineteen coin charms, grouped closely\nin a circular arrangement; all within a plain, narrow, solid rim. (Plate XII. 2).\n\n13. Circular. Around a central open-work coin charm (our No. 245) are grouped nine charms of Ramsden's group (n)—Round with single fret-work character. All are enclosed by a narrow, solid, rim. In Ramsden's work but seven specimens of this group are given; in this chatelaine there are nine. The two not in Ramsden's list are 康 and 貴;—\"ease\" and \"nobility.\" (Plate XII. 3).\n\n14. Around a central coin charm are grouped a circle of nine, all of which are in Ramsden: there is no outer frame or rim of any sort. (Plate XII. 4).\n\n15. Somewhat rectangular frame of foliate-floriate-bat-butterfly-dragon design; within are twelve coin-like charms; above there are three butterfly charms. The two sides are practically alike, differing only in the characters on the charms. (The full-sized rubbing is reproduced in folding-plate II.)\n\nH. A single, simple, piece; like a coin charm, but intended for a chatelaine carrier, not for suspension to one.\n\n1. Large, round, coin-like charm, with some openings through; alike on the two sides; pierced, for carrying pendants, by three holes below; for suspension loop, by two above. Around a central design, that of Ramsden's No. 160, a broad zone is occupied by pictorial elements—mountains, waves flying cranes, pine trees, kiri, etc. (Plate XIII. 1).\n\n2. Octagonal; heavy; thick and solidly made; suspension projection above. Obverse: characters 壹藝遺業積金非寶, \"one accomplishment, leaves merit; amassing money is not treasure.\" Reverse: characters 忠孝傳家詩書教子, \"Teach family fidelity and obedience; give next generation knowledge and culture.\" (Plate XIII. 2, 3).\n\n3. Ramsden's butterfly charm, No. 22, should be here; it is primarily a chatelaine, although often hung with coin charms upon one.\n\nI. Solid, heavy, sharply-stamped pieces; gourd or pouch-shaped, or with gourd or pouch as an essential element.\n1. Gourd-shaped. *Obverse*: two cranes and rushes; fungus (or kiri) above; characters 瑞山; Yō-san. *Reverse*: chiefly occupied by flower sprays; above, a pong (hōo) bird in flight with cloud. (Plate XIII. 4, 5).\n\n2. Pouch, drawn together at top. *Obverse*: characters 長福, long-life, fortune. *Reverse*: the doubled character for joy 喜. (Plate XIV. 1, 2).\n\n3. Pouch, somewhat constricted, or a vessel for storage; *Obverse*: the conventionalized character for long life, surrounded by graceful plant designs. *Reverse*: surface completely covered with plant designs. (Plate XIV. 3, 4).\n\n4. Similar pouch-form the main element. *Obverse*: a gate-way, below which is a cartouche-like space bearing seal characters; below this is a line of Corean characters, 부모은천엽수; Pumo un chun yung su. *Reverse*: a butterfly and octagonal coin-charms and two small bits with characters, all being enclosed and protected by a narrow semicircular border or frame. (Plate XIV. 5, 6).\n\nWe have thus brought together, described and figured forty-three chatelaines. A few others are known to us but are not in our collection; a few others are likely to turn up. They form a group of art objects upon which the old Corean fancy was exuberantly lavished. They deserve to be known and will repay careful examination. They are particularly interesting as showing how forms and decorations are related and pass into one another; they are richly symbolical; they admirably illustrate the process of conventionalization and the loss of knowledge of the origin of traditional patterns.\n\n**List of Plates.**\n\nI. Chatelaine with ribbons and coin charms, showing way in which they were used.\n\nII. Mass of ribbons and charms attached to chatelaine; to show that Ramsden's No. 20 is truly a chatelaine and not a coin-charm.\n\nIII. Coin charms with high relief designs.\nPLATE IX.\nIV. Chatelaines: Class A.\nV. ,, ,, B.\nVI. ,, ,, B.\nVII. ,, ,, C. D.\nVIII. ,, ,, E. F.\nIX. ,, ,, G.\nX. ,, ,, G.\nXI. ,, ,, G.\nXII. ,, ,, G.\nXIII. ,, ,, H. I.\nXIV. ,, ,, I.\nMINUTES OF THE ANNUAL MEETING OF THE KOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHeld in the Seoul Union, Feb. 1st, 1916.\n\nDr. Gale presided, while Prof. Starr gave a lecture on \"Korean Coin Charms\" and followed it with some remarks on the similarity between Korean and early American art.\n\nThe Society held its Annual Meeting immediately after.\n\nDr. Gale resigned as President, and with much regret the Society accepted the resignation. Elections were held as follows.\n\nPresident, Mr. Lay; Vice-President, Dr. Mills; Corresponding Secretary, Dr. Gale; Librarian, Mr. Beck; Recording Secretary, Mr. Koons; Treasurer, Mr. Bunker. Councillors, Dr. Hishida, Mr. R. S. Miller and Bishop Trollope.\n\nThe Treasurer's report showed deposits and cash amounting to ¥950.15.\n\nThe Council met immediately after adjournment, all members being present but Mr. Bunker.\n\nThe following names were proposed for membership: Miss Van Wagoner, Dr. Scheifley, Mr. Lucas.\n\nA motion prevailed that, in future, all writers of papers shall be entitled to reprints, gratis, up to twenty copies.\n\nMr. E. W. Mills was also given permission to make reprints of his own article on Mining, to the number of forty.\n\nDr. Mills presented plans for works on \"Acupuncture and Cautery\" and a \"Native Pharmacopoeia,\" each to be of about 300 pages. It was decided that while the original idea of the Society had not been the publication of such works, a committee be appointed to look into the matter of printing. Secretary and Librarian were appointed as this committee. Adjourned.\n\nE. W. Koons,\nRecording Secretary.\nCOUNCIL MINUTES.\n\nThe council met at the home of Dr. Gale, at 4:30 P.M., Jan. 23rd, 1917. Present all members but Dr. Mills and Hon. R. S. Miller.\n\nMinutes of the previous meeting (Feb. 1st, 1916) were read. The Corresponding Secretary presented a letter from E. W. Mills, enclosing 100.00 yen in payment for the extra copies of his paper.\n\nThe Publishing Committee presented Vol. VII, Part I, of the Transactions, it containing Mr. Mills' Monograph on \"Mining\" and a list of members of the Society.\n\nA proposition of change the date of the Annual Meeting to some time in June was presented, and the same will be brought forward at the Annual Meeting, Feb. 15.\n\nThe following amendment was also proposed \"To create a 'Life Membership,' on the payment of 50.00 yen. \"In the case of members who have been paying annual dues, 2.00 yen shall be deducted for each payment made, in case one wishes to become a life member.\"\n\n\"After Annual dues have been paid for 25 years, a member shall ipse facto become a Life Member.\"\n\nThis is to be presented at the Annual Meeting. The names of G. H. Morrison, of Peking, and R. A. B. Ponsonby-Fane, of Hongkong, were presented, and after the rules had been suspended, they were elected as members.\n\nMoved and carried to ask Bishop Trollope to prepare a paper on Buddhism for the coming Annual Meeting.\n\nAdjourned.\n\nE. W. Koons,\nSecretary.\nANNUAL MEETING, FEB. 14, 1917.\n\nHeld at the Seoul Union, Mr. Lay presiding.\n\nThe Council reported 5 new members elected during the year, and the publication of Vol. VII. Part I. of the Transactions, \"Gold Mining in Korea.\" The Librarian reported accessions to the library, both by purchase and as exchanges. The first 38 volumes of Transactions of the Asiatic Society of Japan are the most noteworthy.\n\nThe Librarian also recommended further purchases for the Library, and urged greater use of it by the members.\n\nThe following motion was passed. \"Resolved that the Librarian circulate lists of the books now in the library, and that members be asked to hand in lists of books that should be purchased.\"\n\nAn amendment changing the time of the Annual Meeting to June was proposed.\n\nA second amendment was proposed, as follows. To create a class of Life Members. A. on payment of a fee of 50.00 yen (this amount was changed to 30.00 yen) B. After payment of annual dues for 25 years.\n\nRev. J. U. S. Toms, Col. French, and Dr. Deming were elected members. Elections resulted as follows: President, Bishop Trollope; Vice-President, Dr. R. G. Mills; Corresponding Secretary, Dr. J. S. Gale; Librarian, S. A. Beck; Recording Secretary, E. W. Koons; Treasurer, F. H. Smith; Councillors A. H. Lay, R. S. Miller, Dr. Hishida.\n\nMeeting adjourned,\n\nE. W. Koons,\nSecretary.\nOFFICERS FOR 1916.\n\nPresident.\nArthur Hyde Lay, C.M.G.\n\nVice-President.\nRalph G. Mills, M.D.\n\nCorresponding Secretary.\nJ. S. Gale, D.D.\n\nRecording Secretary.\nE. W. Koons.\n\nTreasurer.\nD. A. Bunker.\n\nLibrarian.\nS. A. Beck.\n\nCouncillors.\n\nHon. R. S. Miller (American Consul-General).\nDr. S. Hishida (Imperial Government service).\nRt. Rev. Bishop M. N. Trollope (Church of England).\nOFFICERS FOR 1917.\n\nPresident.\nBishop Trollope.\n\nVice President.\nDr. R. G. Mills.\n\nCorresponding Secretary.\nDr. J. S. Gale.\n\nRecording Secretary.\nE. W. Koons.\n\nLibrarian.\nS. A. Beck.\n\nTreasurer.\nF. H. Smith.\n\nCouncillors.\n\nArthur Hyde Lay, C.M.G., (British Consul General.)\nR. S. Miller, (American Consul General.)\nDr. S. Hishida (Imperial Government service.)\nLIST OF MEMBERS,\nKOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHONORARY MEMBERS.\n\nAllen, Hon. H. N., M.D., LL.D. ... Toledo, Ohio, U.S.A.\nBrown, MacLeavy J., C.M.G. ... London.\nGubbins, J. H., C.M.G. ... c/o Foreign Office, London.\nHubert, H. B., F.R.G.S. ... Springfield, Mass., U.S.A.\nJones, G. H., D.D. ... 150 Fifth Ave., New York City.\nJordan, Sir John, K.C.M.G. ... Peking, China.\n\nORDINARY MEMBERS.\n\nAlbertson, Miss M. H. ... Seoul.\nAsakawa, Prof. K. ... New Haven, Conn., U.S.A.\nAsami, R. ... Judge of Supreme Court, Seoul.\nAvison, O. R., M.D. ... Seoul.\nBadcock, Rev. J. S. ... Seoul.\nBaird, Rev. W. M., Ph.D. ... Pyeng Yang.\nBeck, Rev. S. A. ... Seoul.\nBell, Rev. Eugene ... Kwangju.\nBennett, W. G. ... Chemulpo.\nBolljahn, J. ... Seoul.\nBonwick, Gerald ... Seoul.\nBowman, N. H., M.D. ... Beeville, Texas.\nBrockman, F. N. ... Seoul.\nBridle, Rev. G. A. ... Suwon.\nBrinckmeier, R. ... Chemulpo.\nBunker, Rev. D. A. ... Seoul.\nBunker, Mrs. D. A. ... Seoul.\nBurdick, Rev. G. M. ... Seoul.\nCable, Rev. E. M. ... Seoul.\nCameron, Miss Christine ... Seoul.\nCollyer, Rev. C. T. ... Wonsan.\nCram, Rev. W. G. ... Songdo.\nCrispin, J. F. ... London, England.\nCunningham, Rev. W. B. ... Chinju.\nCurtice, R. S. ... Seoul.\nCutler, Miss M. M., M.D. ... Seoul.\nCynn, Prof. Hugh H. ... Seoul.\nDeming, Rev. C. S. ... Seoul.\nElliot, Sir Charles ... University of Hongkong.\nErdman, Rev. Walter C. ... Taiku.\n| Name                  | Location                        |\n|-----------------------|---------------------------------|\n| Frampton, G. R.       | Seoul                           |\n| French, Colonel      | Seoul                           |\n| Frey, Miss            | Seoul                           |\n| Gale, Rev. J. S., D.D.| Seoul                           |\n| Genso, J. F.          | Seoul                           |\n| Gillett, P. L.        | Nanking, China                  |\n| Gordon, IIon, Mrs. E. A.| Tokyo                          |\n| Gray, Mrs. William    | London, England                 |\n| Greenfield, Rev. W. M.| Taiku                           |\n| Gregg, G. A.          | Seoul                           |\n| Grove, Rev. P. L.     | Iiaju                           |\n| IIall, Mrs. R. S., M.D.| Pyengyang                       |\n| Hall, Rev E. F.       | Berkeley, Cal., U.S.A.          |\n| Harris, Bishop M. C., LL.D.| Tokyo                          |\n| Haven, Rev. W. I., D.D.| Bible House, Astor Place, New York |\n| IIirst, J. W., M.D.   | Seoul                           |\n| IIodges, Rev. C. H. N.| Kang Wha                        |\n| Hoffman, Rev. C. S.   | Kangkai                         |\n| IIoldcroft, Rev. J. G.| Pyengyang                       |\n| IIooker, J. T.        | Spartansburg, South Carolina, U.S.A. |\n| Irvin, C. H., M.D.    | Fusan                           |\n| Joly, Mrs.            | Seoul                           |\n| Joly, Percy B.        | Shanghai                        |\n| Kanazawa, Dr. S.      | Imperial University, Tokyo, Japan |\n| Kavanaugh, J.         | Shanghai                        |\n| Koons, Rev. E. W.     | Seoul                           |\n| Kruger, F. D., Ph.D.  | Berlin                          |\n| Lay, Arthur Hyde, C.M.G.| British Consul General, Seoul. |\n| Leadingham, R. S., M.D.| Mopko                          |\n| Lucas, A. E.          | Seoul                           |\n| Ludlow, A. I., M.D.   | Seoul                           |\n| Lyall, Rev. D. M.     | Chinju                          |\n| Macrae, Rev. F. J. L.| Masanpo                         |\n| McEachern, Rev. John  | Kunsan                          |\n| McGary, E.            | Seoul                           |\n| Miller, Hugh          | Seoul                           |\n| Miller, Hon. R. S.    | Seoul                           |\n| Mills, E. W.          | Peking                          |\n| Mills, R. G., M.D.    | Seoul                           |\n| Min Yung-chan         | Seoul                           |\n| Moffett, Rev. S. A., D.D.| Pyengyang                       |\n| Moore, Rev J. Z.      | Pyengyang                       |\n| Moosc, Rev. J. R.     | Seoul                           |\n| Morgan, IIon. E. V.   | c/o Department of State, Washington |\nMorris, Rev. C. D. ... ... ... Pyengyang.\nMorris, J. II. ... ... ... Seoul.\nMorrison, G. II. ... ... ... Peking.\nNiwa, S. ... ... ... Y.M.C.A., Seoul.\nNoble, Rev. W. A., D.D. ... ... Seoul.\nNorton, A. II., M.D. ... ... Haiju.\nPieters, Rev. A. A. ... ... Chairyung.\nPonsonby-Fane, R. A. B. ... ... Hongkong.\nPye, Miss Olive F. ... ... Seoul.\nReiner, Prof. R. O. ... ... Pyengyang.\nRhee, S. M., Ph.D. ... ... Honolulu.\nRhodes, Rev. H. S. ... ... Syenchyun.\nRichard, Rev. Timothy, D.D. ... Shanghai.\nRobbins, Miss H. P. ... ... Pyengyang.\nRufus, Rev. W. Carl, Ph.D. ... Ann Arbor, Mich.\nScheifley, W. J., D.D.S. ... Seoul. [Japan.\nScidmore, Hon. G. II. ... American Consul-General, Yokohama,\nScranton, W.B., M.D. ... Dairen.\nSharp, Rev. C. E. ... ... Pyengyang. [School, Hiroshima, Japan.\nShidehara, Dr. ... ... President Hiroshima Higher Normal\nShiraton, Dr. K. ... Imperial University, Tokyo.\nSmith, Rev. F. II. ... ... Seoul.\nSmith, R. K., M.D. ... ... Andong.\nSmith, Rev. W. E. ... ... Pyengyang.\nSnyder, L. II. ... ... Seoul.\nStarr, Prof. Frederich, Ph.D. ... University of Chicago.\nStillman, E. G., M.D. ... ... 830 Park Place, New York City.\nTate, Rev. L. B. ... ... Chunju.\nTaylor, A. W. ... ... Seoul.\nTaylor, W. W. ... ... Seoul.\nToms, Rev. J. U. S. ... ... Seoul.\nTownsend, W. D. ... ... Chemulpo.\nTrollope, Rt. Rev. Bishop M. N. ... Seoul.\nUnderwood, H. H. ... ... Seoul.\nUnderwood, Mrs. H. H. ... ... Seoul.\nVan Buskirk, J.D., M.D. ... ... Seoul. [Chemulpo.\nWada, Dr. ... ... Director, Meteorological Observatory,\nWambold, Miss K. C. ... ... Seoul.\nWelbon, Rev. A. G. ... ... Andong.\nWeller, O. A. ... ... Seoul.\nWhittemore, Rev. N. C. ... ... Sensen.\nWilliams, Prof. F. N. ... ... New Haven, Conn., U.S.A.\nYamagata, Mr. Isob ... ... Editor \"Seoul Press.\"\nYun, Mr. T. II. ... ... Central Y.M.C.A., Seoul.\nCATALOGUE.\n\n\"TRANSACTIONS OF THE KOREA BRANCH OF THE ROYAL ASIATIC SOCIETY.\"\n\nVOLUME I. PART I only. 1900.\nPrice Yen 3.00.\n\nContents:—\nInfluence of China upon Korea.\nKorean Survivals.\nColossal Buddha at Eun-jin.\nMinutes of General Meeting.\n\nAppendix:—\nOffice Bearers.\nList of Members.\nConstitution and By-Laws.\n\nVOLUME II. PART I. 1901.\nPrice Yen 2.50.\n\nContents:—\nKang-Wha.\nThe Spirit Worship of the Koreans.\n\nVOLUME II. PART II. 1902.\nPrice Yen 3.00.\n\nContents:—\nHan-Yang (Seoul).\nKorean Folk-Tales.\nMinutes of General Meetings.\nReport of the Council.\n\nAppendix:—\nOfficers.\nList of Members.\n\nVOLUME III. PART I only. 1903.\nPrice Yen 2.50.\n\nContents:—\nCh'oe Ch'e Wun: His Life and Times.\nThe Culture and Preparation of Ginseng in Korea.\nMinutes of Annual Meetings.\nReport of the Council.\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of the Landes Library.\n\nVOLUME IV. PART I. 1912.\nPrice Yen 1.50.\nContents:—\nThe Old People and the New Government.\nThe Korean Alphabet.\n\nVOLUME IV. PART II. 1913.\nPrice Yen 2.50.\nContents:—\nJapanese-Korean Relations after the Japanese Invasion of Korea in the 16th Century.\nThe Village Gilds of Old Korea.\nCoinage of Old Korea.\nMinutes of Important Meetings.\n\nVOLUME IV. PART III. 1913.\nPrice Yen 2.50.\nContents:—\nMarriage Customs of Korea.\nSelection and Divorce.\nThe Celestial Planisphere of King Yi Tai-Jo.\n\nVOLUME V. PART I only. 1914.\nPrice Yen 2.50.\nContents:—\nSome Recent Discoveries in Korean Temples and their Relationship to Early Eastern Christianity.\nA Plea for the Investigation of Korean Myths and Folklore.\nCatalogue.\n\nVOLUME VI. PART I. 1915.\nPrice Yen 2.50.\nContents:—\nThe History of Korean Medicine.\nAfforestation in Korea.\nMinutes of Annual Meeting.\nReport of the Council.\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VI. PART II. 1915.\nPrice Yen 2.50.\n\nContents:—\nThe Pagoda of Seoul.\nHunting and Hunter's Lore in Korea.\n\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VII. PART I. 1916.\nPrice Yen 2.50.\n\nContents:—\nGold Mining in Korea.\n\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko08roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 142, "total-input-tokens": 204578, "total-output-tokens": 38672, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 412, 5], [412, 412, 6], [412, 412, 7], [412, 412, 8], [412, 2501, 9], [2501, 4783, 10], [4783, 7014, 11], [7014, 9138, 12], [9138, 11216, 13], [11216, 13439, 14], [13439, 15644, 15], [15644, 17700, 16], [17700, 17700, 17], [17700, 17700, 18], [17700, 20121, 19], [20121, 22360, 20], [22360, 24581, 21], [24581, 26762, 22], [26762, 28886, 23], [28886, 31024, 24], [31024, 33289, 25], [33289, 35444, 26], [35444, 37662, 27], [37662, 39763, 28], [39763, 41980, 29], [41980, 43716, 30], [43716, 43811, 31], [43811, 43811, 32], [43811, 45740, 33], [45740, 47329, 34], [47329, 49159, 35], [49159, 51320, 36], [51320, 53058, 37], [53058, 55001, 38], [55001, 56889, 39], [56889, 59002, 40], [59002, 61119, 41], [61119, 63209, 42], [63209, 63320, 43], [63320, 63320, 44], [63320, 65294, 45], [65294, 67311, 46], [67311, 68990, 47], [68990, 71158, 48], [71158, 73000, 49], [73000, 75021, 50], [75021, 77025, 51], [77025, 79152, 52], [79152, 81159, 53], [81159, 82486, 54], [82486, 83178, 55], [83178, 84990, 56], [84990, 86998, 57], [86998, 89062, 58], [89062, 90565, 59], [90565, 91990, 60], [91990, 93192, 61], [93192, 93864, 62], [93864, 94556, 63], [94556, 95656, 64], [95656, 96177, 65], [96177, 96636, 66], [96636, 97152, 67], [97152, 97667, 68], [97667, 98141, 69], [98141, 98724, 70], [98724, 99117, 71], [99117, 99500, 72], [99500, 100033, 73], [100033, 100199, 74], [100199, 100559, 75], [100559, 101333, 76], [101333, 101768, 77], [101768, 102307, 78], [102307, 102887, 79], [102887, 103377, 80], [103377, 103869, 81], [103869, 105315, 82], [105315, 107461, 83], [107461, 109376, 84], [109376, 110991, 85], [110991, 112920, 86], [112920, 114795, 87], [114795, 116605, 88], [116605, 116605, 89], [116605, 116605, 90], [116605, 118648, 91], [118648, 120524, 92], [120524, 120524, 93], [120524, 120524, 94], [120524, 122447, 95], [122447, 124278, 96], [124278, 124278, 97], [124278, 124278, 98], [124278, 124278, 99], [124278, 124278, 100], [124278, 124278, 101], [124278, 124278, 102], [124278, 124278, 103], [124278, 124278, 104], [124278, 124278, 105], [124278, 124278, 106], [124278, 124278, 107], [124278, 124278, 108], [124278, 124278, 109], [124278, 124278, 110], [124278, 124278, 111], [124278, 124278, 112], [124278, 124288, 113], [124288, 124288, 114], [124288, 124288, 115], [124288, 124288, 116], [124288, 124288, 117], [124288, 124288, 118], [124288, 124288, 119], [124288, 124288, 120], [124288, 124288, 121], [124288, 124288, 122], [124288, 124288, 123], [124288, 124288, 124], [124288, 124458, 125], [124458, 126030, 126], [126030, 127402, 127], [127402, 128764, 128], [128764, 129143, 129], [129143, 129504, 130], [129504, 130890, 131], [130890, 133673, 132], [133673, 135488, 133], [135488, 136277, 134], [136277, 137216, 135], [137216, 137602, 136], [137602, 137602, 137], [137602, 137602, 138], [137602, 137602, 139], [137602, 137602, 140], [137602, 137602, 141], [137602, 137602, 142]], "primary_language": ["None", "en", "None", "None", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "en", "None", "en", "None", "en", "None", "None", "None", "en", "None", "en", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "ja", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]