[{"id": "51baa33651e9b1483671fb6f26655dbbf6042739", "text": "ROYAL ASIATIC SOCIETY\n\nOF\n\nGREAT BRITAIN AND IRELAND.\n\nSPECIMEN CHAPTERS\n\nOF\n\nAN ASSYRIAN GRAMMAR.\n\nBY\n\nTHE REV. E. HINCKS, D.D.,\n\nHON. M. R. A. S.\n\n[December, 1866.]\nLINGUISTIC PUBLICATIONS\nOF\nTRÜBNER & CO.,\n60, PATERNOSTER ROW, LONDON, E.C.\n\nMESSRS. TRÜBNER & Co. respectfully solicit orders for all classes of Publications connected with the History, Antiquities, Geography, and Languages of the East, published abroad. Messrs. Trübner & Co. have established agencies in all parts of the East, of Europe, and America, and are thus enabled to furnish such publications with as little delay as possible, and at prices below the hitherto customary charges.\n\nAuthors desirous of printing their own books may be furnished with Specimens, and Estimates for Paper, Printing, and Binding, and every facility will be afforded them, if works are intended for publication, of bringing the same advantageously before the public.\n\nAlcock.—A Practical Grammar of the Japanese Language. By Sir Rutherford Alcock, Resident British Minister at Jeddo. 4to., pp. 61, sewed. 18s.\n\nAlcock.—Familiar Dialogues in Japanese, with English and French Translations, for the Use of Students. By Sir Rutherford Alcock. 8vo., pp. viii. and 40, sewed. Paris and London, 1863. 5s.\n\nBenfey.—A Practical Grammar of the Sanskrit Language, for the Use of early Students. By Theodore Benfey, Professor Pull. Ord. of Sanskrit in the University of Goettingen, etc., etc. 8vo., pp. xviii. and 228, cloth. 7s. 6d.\n\nGoldstücker.—A Dictionary, Sanskrit and English, extended and improved from the Second Edition of the Dictionary of Professor H. H. Wilson, with his sanction and concurrence. Together with a Supplement, Grammatical Appendices, and an Index, serving as a Sanskrit-English Vocabulary. By Theodor Goldstücker. Parts I. to VI. 4to. 1856—1864. Each Part 6s.\nA great number of years have now elapsed since I began to collect materials for an Assyrian grammar; an object, of which I have never since lost sight. Of late, I have been preparing my materials for publication; but a preliminary question has suggested itself:—\"If I were to publish a grammar, who would read it?\" The persons for whose instruction I should naturally write would be either persons who were acquainted with other Semitic languages, and who were desirous of comparing the grammars of these with that of the oldest and the best developed language of the family; or else persons, who desired to study this language for its own sake, and who sought the aid of a grammar, in the absence of an oral instructor, to teach them the first principles of this \"Sanskrit of the Semitic tongues,\" which they might afterwards improve upon by their own studies.\n\nI believe that persons of both these classes would derive benefit from such a grammar as I should publish, if they would only make use of it. I fear, however, that no person of either of the classes has so much faith in me, and in my knowledge of Assyrian grammar, as to make use of it. My only readers would probably be my critics;—those, who have attained some knowledge of the Assyrian language—considerable knowledge, I may say, so far as respects the meaning of words,—but whose published translations show that, as respects grammar, their views are extremely different from mine; and, of course, if my views be correct, extremely erroneous. My only readers would thus be, with perhaps one or two exceptions, hostile critics, who must condemn what I have written, because, by laying down rules which they have disregarded and violated in their translations, it indirectly condemns those translations.\n\nIn the case of one eminent Assyrian writer on the con-\ntinent, the certainty that I should meet with hostile criticism is more obvious than it is in the case of others. Dr. Oppert has published an Assyrian grammar, of which I have already stated that, besides minor errors, it was pervaded by three erroneous general principles, \"so as scarcely to leave a page free from what I consider pernicious error.\" One of these three principles, Dr. Oppert, in a late article in the Journal Asiatique, intimates that he has abandoned, or is disposed to abandon. To the other two he clings pertinaciously. Now, as I cannot retract the unfavourable opinion above expressed, and as, according to my views of Assyrian grammar, I cannot think the translations from Sargon, which MM. Oppert and Ménant have published, to be even approximately correct, I could not possibly expect any criticism from those gentlemen but of the most adverse description.\n\nUnder these circumstances, I have thought it advisable to deviate materially from my original plan. Instead of publishing an entire grammar, I will, in the first instance, publish specimen-chapters only; treating of the declensions of substantives and adjectives, and of the permansive forms of verbs;—a subject on which Dr. Oppert, in the Journal Asiatique for last year (Tome vi. p. 297), has mis-stated both my views and the facts to which he appeals. Instead, too, of stating what I believe to be the grammatical rules of the Assyrian language, dogmatically, as would be the natural course of the writer of a grammar, I will deduce them from those leading positions on which all are agreed, by inductive proofs, in the order which appears to me the best for this purpose; different as this order is from what I should adopt if I were exempt from the necessity of writing otherwise than dogmatically. My examples must be numerous, because they are not merely illustrative, but justificatory. It will readily be understood that where I bring forward a number of proofs in support of any assertion, it is one which is not generally accepted, and is likely to be controverted; but except in the one case of the permansive forms of the verb, which I have already mentioned, I do not mean to point out directly what I believe to be the errors of others. It will answer my end,\nand will be pleasanter to myself, if I merely seek to establish\nthe correctness of my own views. This being done, the in-\ncorrectness of any views that are inconsistent with them will\nfollow as a matter of course.\n\nA few words should be said here on the principles on which\nI have conducted my investigations. I have sought the rules\nof Assyrian grammar by induction from passages, the mean-\ning of which I considered to be perfectly known, occurring in\nwritings of a good age; the induction being guided by a\ngeneral knowledge of Semitic grammar. I have taken no\naccount of passages, however well their meaning may be\nknown, which are found in texts of a late age, probably written\nby persons who had a very imperfect knowledge of Assyrian,\nand of whom it was not the native tongue. Neither have I\nassumed the identity of Assyrian and Hebrew rules of gram-\nmatical construction in cases where there is no inductive evi-\ndence of it.\n\nAs to the transcriptions of Assyrian words and texts which\nI give, I think that it is unnecessary to say much. Were I\nto publish a grammar, it should contain a list of all the char-\nacters representing syllables consisting of a single vowel, or a\nvowel preceded or followed by a consonant, and of all those whose\nvalues were syllables consisting of a vowel both preceded and\nfollowed by a consonant, and which occurred in any text quoted\nin the grammar. To each character its transcription should\nbe attached. I represent, as every one else does, ܒ, ܓ, ܕ, ܗ, ܘ,\nܙ, ܚ, ܛ, ܝ, ܟ, ܠ, ܡ, ܢ, ܣ, ܥ, ܦ, ܨ, ܩ, ܪ, ܫ, ܬ, by b, g, d, z, k, l, m, n, p, r, and t.\nI also represent ܦ by ḥ, ܨ by ṭ, ܩ by s (which was anciently\nsounded either st, or sk; the former being, like ܫ, repre-\nsented by the Arabic ى, the latter by ش, and by the Greek\nξ, which occupied the same position in the alphabet, and had\nthe same figure as the Phœnician 𐤁), ܨ by z, ܩ by q, and ܫ\nby s. The remaining five letters, ܐ, ܗ, ܝ, ܐ, ܝ, are indiscri-\nminately transcribed as ' with the following exceptions:\nܐ is transcribed by ya; ܗ by u or yu; ܝ after an-\nother ܝ by a or ya; ܐ, when a copulative, by va; and\nܝ by h or ih. I use the vowel e alone to represent ܝ,\nè standing for ἙΤΤΤΤ. The grave accent over a vowel is not intended to mark a distinction of sound, but to show that a homophone of the character usually representing the syllable without the accent is used in place of that character. I use four vowels in transcriptions, a, i, u, and e, which I believe the Assyrians pronounced as long i, or ī. I think that no Assyrian scholar will find any difficulty in restoring the text of my transcriptions; but if he do, he can consult the original text, to which I refer him. To explain my references, I will observe that B. means Botta's plates; L., the first series of British Museum plates, edited by Mr. Layard; I. and II., the two volumes of the second series of British Museum plates, edited by Sir H. Rawlinson. The number which precedes this is the number of the plate in each series, and the number at the end is the line in the plate; with a distinctive mark before it, if necessary, the meaning of which will be seen when the plate is referred to. In some of the plates of the second series, I use r, c, and l for right, centre, and left. In these references, and in the transcriptions, I have followed as closely as I could Mr. Norris.\n\nI believe that the main point in which I differ from Mr. Norris in my transcriptions is that I do not attempt to distinguish in most cases between the several breathings and semivowels. I do not think that we can distinguish them by inspection of the Assyrian characters. We can only do so by knowledge derived from some other source. I find, for instance, Ἑ occurring in four words; between ma and du, between na and du, between ta and bu, and between da and nu. I transcribe it in the four instances by 'a. I happen to know from the Hebrew that in the first word the 'a represents א, in the second א, in the third א, and in the fourth א; the four words signifying much or great from אאאא, glorious from אאאא, good from אאאא, and a judge from אאאא. In another word which had no Hebrew equivalent, I should not know how to render the characters so as to make a distinction; and I therefore do not make it in the cases where I am able to do so. Some persons would in all these instances represent the Ἑ\nby accenting the preceding vowel. In most cases, however, I think that this would be an error. Where it is plain to me that two characters represent together but one syllable, I cut off one of the vowels by an apostrophe; but I do not consider it a matter of course to do so, nor do I use an accent in all cases where I do so.\n\nWhen two syllables are joined together without a point, it will be understood that they are, in the original, not represented phonetically, but by monograms, ideograms, or Accadian roots, as they have been variously called. In such cases I generally give the cuneiform characters in brackets, with i.e. after them, before I give the words that I read. When, however, the signification of the monogram is well known and universally admitted, I omit the cuneiform characters.\n\n[Chapter V.] On Verbs, and first on their permansive parts.\n\n1. Generally speaking, a verb admits of seven principal conjugations, of which the first six correspond to the first six of the recognized Hebrew conjugations; the seventh being the causative of the third. I denote them by the seven first Roman numerals. Other conjugations are occasionally met with, but are less frequent. It will, of course, be understood that no one verb is used in all the conjugations.\n\n2. Each of these seven admits of a secondary or augmented conjugation, which I denote by the proper Roman numeral followed by t. The augmented conjugation regularly inserts t or te after the first radical letter, or in the conjugations V.—VII. after the preformative s. In some cases the insertion of this letter or syllable is the only difference between the augmented conjugation and its principal one; but in other cases, other changes are introduced which will be mentioned in the sequel.\n\n3. The inserted t is sometimes changed into d or t, through the influence of the letter with which it comes in contact; and sometimes through its influence that letter undergoes a change. Another irregularity, which is apt to be more puzzling, is that in most verbs defective in the second radical\n(concave verbs) the dental precedes the first radical in place of following it. Thus, we have from אָנֹכִי, in the aorist of I.t, it.bu.ni, instead of ib.tu.ni, “they came on” (90 L. 63).\n\n4. Generally speaking, again, the verbal forms belonging to each conjugation may be divided into two great classes, which I call permansive and mutative. The former denotes continuance in the state which the verb signifies in that conjugation; the latter denotes change into that state. Each portion of the forms belonging to the conjugation has tenses and verbal nouns. The permansive tenses are analogous to the so-called Hebrew preterite, having no preformatives, but having terminations added, (except in the third person singular masculine, which has none, as in Hebrew), by which the number, person, and gender are distinguished. The mutative tenses, on the contrary, are analogous to the so-called Hebrew future, having one or other of the preformatives יְנַע always prefixed to the root, whether or no there be any distinctive addition at the end.\n\n5. The distinction here made between permansive and mutative forms is in my judgment a fundamental one, on the proper development of which all accurate knowledge of the Assyrian language must depend. Now, Dr. Oppert, has in a recent number of the Journal Asiatique (Tome vi. p. 297), ridiculed the existence of any such forms as what I call permansive, characterising them as being a mere fancy of mine. The first thing then that I have to do is to establish the existence of such forms by a number of clear examples.\n\n6. I will begin with comparing two sentences from adjoining columns of Taylor’s Cylinder, in which the same root occurs,—a perfect root having three letters incapable of change,—namely, מָלֵא. It signifies in Arabic celavit (Frey. iv. 10), and this may be the meaning in the single passage in the Hebrew Bible where it occurs (see Ges. 723). At any rate this seems clearly the meaning in the two Assyrian passages which I will cite. In the former of these, 40 I. 68, Sennacherib, after mentioning the destruction of certain towns concluding with ‘ak.mu, “I burned,” proceeds thus. I omit a simile which is evidently parenthetical. Qu.tur n’a.ak.mu.ti.\nsu.nu . . . . . p'a.an [→] i.e.] same.e rap.su.ti 'u.sak.tim, \"the smoke of their being burned (like a ponderous cloud) the face of the wide heavens I made to conceal.\" The verb is here in the 1. s. of the aorist of (the causative) Conjugation V., having two objects expressed, that which is made to produce, and that which is made to undergo, the change. The preceding verb 'akmu is the 1. s. of the aorist of I. of the verb נָעַם. Let us now proceed to 41 I. 45. I omit another comparison to a cloud, which is parenthetic. [←] i.e.] epir sepı.su.nu . . . . p'a.an same.e rap.su.ti ka.ti.im, \"the dust of their feet (like, etc.) the face of the wide heavens is concealing.\" In my judgment, nothing can be clearer than that katim is the 3. m. s. of the principal permansive tense. Dr. Oppert says that I \"substitute participles for the 3. s. m.\" By a participle I presume he means what I call the nomen mutantis. No doubt the latter would be katim, or, as I should write it for distinction, kâtim; but this would stand before what it governs; it should then be translated \"the concealer of (the face of the wide heavens),\" and it would require a verb to complete a sentence. It might as well be said that the second word in Genesis was a participle, or any other 3. m. s. of the preterite in the Bible. In this portion of Taylor's Cylinder we have no less than six long lines and a half in which there is nothing that he acknowledges to be a verb. In l. 43, Sennacherib begins to describe an attack upon him by an immense multitude of his enemies, whom he compares to locusts. All are doing the same things in constant succession, and accordingly, in speaking of what they do, he uses only permansive tenses. In l. 44 we have te.bu.'u.ni, \"they are coming on,\" the 3. m. p. of the permansive of I.t. of the verb נִבְאֵל. It has exactly the same relation to it.bu.ni, \"they came on,\" cited in § 3, as ka.ti.im in l. 47 has to itktum, \"it concealed.\" Passing over a permansive verb in l. 48, the discussion of which would lead to a digression, we have in l. 49, after the description of the position taken by his enemies, zab.tu.va, \"they are occupying, and,\" followed by a mutative verb. Surely it cannot be maintained with any\nshow of reason that zab.tu, followed as it is by the copulative enclitic which connects verbs, and verbs only, and this by an acknowledged verb, is anything else than a verb, and yet it has no preformative. The verb נָבַע is a very common one in the mutative tenses of both I. and V.\n\n7. Before going further, I will give paradigms of the declension of the three principal tenses of the imaginary verb נָבַע;—the permansive present, the aorist, and the mutative present, or present simply. The latter is written indifferently with g or gg; the duplication of the second radical being euphonic, and not characteristic of the third conjugation. What really characterizes this conjugation is the use of u as the vowel of the preformative. It is invariably so used in Conjugations III., V., and VII., and their augmented conjugations; and never so in any other conjugation, unless the first radical of the verb be י. Each of these three principal tenses admits a secondary tense formed by the addition of u to forms which end in the third radical, and of ni to those which end in an added vowel. The most important of these secondary tenses is that derived from the present, which is clearly a future.\n\n8. Paradigms of the three principal tenses of Conjugation I.:\n\n| Permansive Present | Aorist | Present |\n|-------------------|--------|---------|\n| 1. s. paglaku, or paglak | 'apgul | 'apaggil, or 'apagil |\n| 2. m.s. paglta | tapgul | tapaggil |\n| 2. f.s. paglti | tapguli | tapaggili |\n| 3. m.s. pagil | ipgul | ipaggil |\n| 3. f.s. paglat | tapgul | tapaggil |\n| 1. p. pagilnu | napgul | napaggil |\n| 2. m.p. pagiltunu | tapgulu | tapaggilu |\n| 2. f.p. pagiltina | tapgula | tapaggila |\n| 3. m.p. paglu | ipgulu | ipaggilu |\n| 3. f.p. pagla | ipgula | ipaggila |\n\nThe forms of the second person plural may require correction; but I believe that all the others may be depended upon. I use i as the vowel after the second radical in the permansive and ordinary present, and u in the aorist. These are the most\ncommon vowels, but many verbs have different ones. Perhaps the third person feminine singular sometimes ends in \\(a\\), that is \\(a\\), like the Hebrew \\(\\text{א}\\). An apparent example is in 18 I. 62, where the nominative is singular, \\(sa\\), referring to \\(\\text{עבנ}\\) \\(\\text{אזיטו}\\), “a projecting summit;” and we have \\(\\text{سعقلعلا}\\) in the printed text, and \\(\\text{لا}\\) as a variant. The latter is, however, the reading of far the most copies, \\textit{if not of all}. In 33 I. 2-48, we have \\(\\text{سعقلعلا}\\); but there the nominative is plural, \\(\\text{عبانااتصاد}\\), “the summits of the mountain.” In 24 I. 51, we have also \\(\\text{سعقلعلا}\\), but here the nominative is masculine singular; and the final \\(a\\) is, as very often happens, a representative of \\(va\\), the copulative enclitic, and not an inflexion of the verb.\n\n9. What are called the personal pronouns of the first and second persons are really, as I have stated long since, permansive presents of a verb signifying “to be here,” \\(\\text{ادسم}\\); and \\(\\text{انا}\\), “ad,” “to,” or “for,” is to be referred to the same root, \\(\\text{ان}\\). The true personal pronouns are the afformatives of the permansive present, \\(\\text{اكو}\\), \\(\\text{نحو}\\), and \\(\\text{تا}\\), with its derivatives. It is these which the comparative grammarian should compare with the Indo-European pronouns. By the way, I never said, as Dr. Oppert represents me to have said, that the second person of the permansive present ended in \\(ka\\) and \\(ki\\), as in Ethiopic. What I said was, that the fact of the first persons ending alike in Assyrian and Ethiopic ought not to be relied on as proof of a special connection between those two languages, because the Ethiopians had \\(k\\) in the second person, as well as in the first, while the Assyrians had not.\n\n10. I will now give some other examples of permansive presents: In the descriptions of permanent features of a country, which are so frequently found in the historical inscriptions, the permansive tense is constantly used. Thus e.g. in 11 I. 43, etc., we read of “high mountains, which, like the edge of a sword, \\(\\text{سامتيو}\\), are piercing; which, for the passing of chariots, \\(\\text{لايا ناتيو}\\), are not fitted.” The exact force of the roots \\(\\text{سامتيو}\\) and \\(\\text{لايا ناتيو}\\) or \\(\\text{لايا ناتيو}\\) may be questioned, but the general sense is clear. The king tells us that he left his chariots behind, and crossed the mountains without them;\nand here he uses the aorist. In 22 I. 105, we have kir.hu.su kima 'u.b'a.an sad.e sa.kin, \"Its top (or head) like the summit of a mountain was lying,\" or simply \"was.\" The verb יָשַׁע in its mutative parts signifies, actively, \"to place,\" or \"make;\" in the permansive parts \"to lie,\" or \"be.\" This is something like what happens in several Greek verbs, as ἔστημι, and in Latin, where facio, as well as fio, is etymologically connected with fuo.\n\n11. The permansive present is also habitually used in the passive conjugations; for the state denoted by these forms is generally a permanent one. So in Greek we have τετυμμένοι εἰσὶ, and in Latin, to a greater extent, pulsatus sum, etc., as well as pulsati sunt. Thus, we have 42 I. 11, ra.ki.bu.si.in di.ku, \"their riders were killed,\" and soon after, si.na mus.su.ra, \"they (f.) were abandoned.\" In 38 L. 8, we have z'u.uh.hu.rat su.bat.sa, \"its site (was made, i.e. as often in Hebrew) was judged to be small.\" Examples might be quoted almost without end.\n\n12. I will now pass to the first person. Dr. Oppert objects to an example which I gave formerly. In 19 I. 101, we read, as it is printed, ina li.me ū.ma, ina Ninua uz.ba.ku, which I have translated \"In the eponymy of a certain person, in Nineveh I am stopping.\" I ought, however, to have translated it, \"In the same eponymy.\" The character in two copies that I have collated is not that for ū, the copulative conjunction, but that which occurs so commonly on the tablets, signifying \"the same.\" There can, I think, be no doubt that this is the correct reading in all the inscriptions; and that the copyists have substituted a common character for one which was not familiar to them. In 18 I. 69, we have Ina li.me an.ni.ma, \"in the eponymy of this person,\" that is, \"of myself.\" This is one of the many substitutes for the pronoun \"my,\" which we meet with in the Assyrian inscriptions. This is sometimes contracted into an.ma, as in 40 L. 50. The אִי seems to be used to indicate that a peculiar mode of expression is used; or perhaps it may signify \"and so forth.\" Speaking of these substitutes for the possessive pronouns, I consider it due to Dr. Oppert to acknowledge the great merit of his late dis-\ncovery of the signification of *raman*, which had been so long a puzzle to Assyrian students. I adopt his explanation as perfectly correct, and I have met with five or six passages, besides those cited by himself, which it explains in the most satisfactory manner. *O si sic omnia!*\n\n13. The explanation of *uẓ.ba.ku* given above, “I am stopping,” clashes with Dr. Oppert’s view in two respects. It is a permansive present, a tense which he does not acknowledge; and it is that of the verb נָעַם, a defective in נָעַם, of which he has affirmed in his grammar that the Assyrians had none. It appears then absolutely necessary for the maintenance of his system that he should do away with this passage; and I will quote from p. 297, what he says on the subject: “D’abord, on ne lit jamais *usbaku*, mais toujours *usbakuni* dans les inscriptions de Sardanapale III., dans la phrase; ‘Pendant qu’ils me retinrent à Ninive, etc.’ *Ušbakuni* est la 3me pers. du pluriel de נָעַם à l’iphtéal avec le suffixe. Sans suffixe, ce serait *yuššabaku* נָעַם, ou même *yušabaku* נָעַם (G.A. § 128), et contracté avec le suffixe (ibid. § 197) נָעַם. Voilà à quoi se réduit la 1re personne en *ku*. Et ce seul example, si même il était avéré, ne pourrait avoir une grande portée, quand on le compare aux milliers de formes des aoristes fournies par les textes.”\n\n14. I have given the whole of this passage from M. Oppert’s text; and I must say, that I think I have never read a passage of the same length, in which there are so many mis-statements as to matters of fact. The word *uẓbaku* does occur in the passage cited; and when he denied that it did so, Dr. Oppert must have trusted to a treacherous memory. There is no *ni* after it in the printed text; there is no various reading noted in 19 I. 101; and, moreover, I collated, some years ago, very carefully, all the copies of the inscriptions brought over by Mr. Layard, which substantially coincide with that which is printed, and I am thus in possession of some important various readings which are not printed; and I can say most positively that there is *not a single copy* which contains any other reading than *uẓbaku*, which Dr. Oppert says “on ne lit JAMAIS!” Elsewhere, e.g. in l. 94 of the same plate, *ni* is added; but there the sentence begins with *ki*, “when;”\nand I translate \"when in Ṣur I was stopping.\" This is the secondary permansive tense noted at the end of § 7. Where there is no ki at the beginning of the sentence, there is no ni at the end of uẕbaku. In the second place, the existence of the verb יָעַבְנִי is, so far as I am aware, a pure fiction. I never recollect to have met it, and I believe no one else has met it. It has been imagined purely for the purpose of neutralizing a text, the existence of which is inconsistent with two grammatical dreams. But in the third place, even if the existence of this verb be granted, it could not produce by any legitimate process such a grammatical monstrosity as yušbakuni. Dr. Oppert cannot produce any similar form. Išbakuni would be legitimate; and so would isabkuni, or with št or šš in the place of s; yušbakuni might pass also for Conj. III.; but the substitution of yu for i before šb—such a form as yupgaluni—is unparalleled. Yu and i are not interchangeable, as he says in his grammar, the former is used in Conj. III., the latter in Conj. I.; but these two conjugations, the Pihel and Qal of the Hebrews, he has blended together in hopeless confusion.\n\n15. But, perhaps, the most extraordinary sentence in the passage I have quoted is the last. The first question at issue is, whether the Assyrians had, like the Hebrews, at least one tense in each conjugation, in which there were no preformatives. It is in regard to this tense that we are at issue; that they had also a tense or tenses in each conjugation, which had preformatives, we are agreed. Now if I can establish even a single instance, in which a verb has no preformative, my case is proved. The fact is, however, that there are hundreds of instances of permansive verbs in inscriptions of every age, from Tiglath Pileser to Darius. Dr. Oppert says that sarraku, even if it should not be read sarratus,—a supposition which the variant form in ak (of which presently) proves to be untenable,—may mean \"I am a king,\" and yet not be a verb. Here I differ from him. I say, in common I believe with all grammarians, that a word which includes in itself a pronominal subject, a copula and a predicate, is essentially a verb. It might as well be denied that malakta in 2 Sam. iii. 21, was a verb, because malkē, \"kings of,\" is a noun. In 17\nI. 32, etc., there are, after the completion of a sentence, no less than eleven words ending in *aku*. I take them to be permansive presents in the I. s., ten of them belonging to triliteral verbs in the first, third or fourth conjugations, and the eleventh to a quadrilateral. It is not the slightest objection to this view that substantives or adjectives are in use, containing the former part of the alleged verb. So it is in all the Semitic languages. There is a *nomen permanentis*, and a *permansive present*, the beginnings of which generally agree, though their endings are generally as different as the cases of *rex* and the persons of *rego*. In the proper names *Nabuna'id*, “Nebo is glorious,” and *Na'id-Mar.duk*, “Marduk is glorious,” as well as in *na.h.da.ku* in l. 32, we have the permansive present; in E.I.H. I. 3, on the contrary, *ru.ba.'a na.'a.dam*, “the glorious prince,” gives us the *nomen permanentis*, here an adjective.\n\n16. In the Babylonian inscriptions the *u* at the end of the I s. is dropped. Thus in E.I.H. I. 39, we have *p'i.it.lu.l'a.ak be.l'u.ut.s'u.un*, “I am habitually worshipping their lordships.” The *u*, it will be observed, is also dropped in this affix, as it sometimes is in the affix *su*, when added to a word ending with a vowel. This is the I. s. of the permansive present in the first augmented conjugation of *היה*. Before this, in l. 10, the king had used the permansive past (badly spelled), *b'i.it.l'u.hu b'i.e.l'u.ut.s'u.un*, “he has been habitually worshipping their lordships.” In the Nakshi-Rustam inscription, l. 9, we have *s'a.al.l'a.ak*, “I am ruling,” as the translation of *patiyakhshiya*, or rather of the latter part of this Persian word; for the preposition at the beginning is expressed in the Babylonian text by a separate preposition. I was curious to see what Dr. Oppert would make of this, and I turned to his transcription of it into Hebrew characters in the Z. D. M. G. XI. 136. I was no little surprised to find that he makes two words out of these four characters, namely, *שׁוּבְנָא אֲלֵיהֶם*. The latter of these two words he has substituted for the termination *ak*, which he did not understand! This led me to look further into his transcriptions. In l. 24 there is a passage, the true reading and signification of the first word of\nwhich was suggested to me by Mr. Talbot. ✡ is zub as well as lib. The reading is zub.bu.'u sa 'ana.ku zi.ba.'a.ka. I take the ka to represent ak, which would look very awkward after ba.'a; while if the ✡ were omitted it would be natural to read zibak; the word is really ziba'ak. I translate, \"they are always made to will what I am willing.\" Here, again, Dr. Oppert transcribes the four characters by ✡ instead of ✡, introducing a second imaginary word in place of a termination which he does not understand.\n\n17. These are not the only instances of permansive verbs in the Nakshi-Rustam inscription. In l. 26, we have kul.lu, \"has been holding,\" a deponent verb like dominatus erat; and in the following line we may restore the damaged word of Conj. IV. na.su.'u, \"are carrying,\" from ✡. This word occurs again l. 18 (\"The Ionians who maginat on their heads) are carrying;\" as does the preceding word in l. 11 (\"my laws) they are holding;\" ✡, which must be here read ha, being added to the singular, to form the feminine plural. An eighth permansive form occurs in l. 21, where in speaking of the depraved state of the people before Darius became king, the obscure word summu.hu is used. To these eight instances of permansive words I think myself entitled to add two others in which 'anaku is used as a verb, there being no other in the sentence. Now, I can only count thirty-one mutative verbs in this inscription; so that the permansive verbs are in the inscription about a fourth of all the verbs. In the inscriptions generally they are perhaps a fifth or sixth of the whole; but this is a very different proportion from \"one to thousands.\"\n\n18. I will now give some examples of permansive forms of two verbs, the meanings of which have been strangely misconceived, ✡, \"to have,\" and ✡, \"to be.\" Both are used in the mutative, as well as in the permansive tenses; and in the former verb, there is a great liability to confusion, the aorist being in both the first and third persons singular i.si, as in E.I.H. 10, 15, where we have the derivative form 'a.ya 'i.si na.ki.ri, \"let me not have enemies.\" The 3 s. of the permansive form would, I presume, be written precisely alike; and i.su.'u and i.sa.'a would be the 3 p. m. and f. in both the\naorist and the permansive tense. We have, however, in 9 I. 58, a form which is clearly permansive, ma.hi.ra (in another copy sa.ni.na) 'as ta.hazi la i.sa.a.ku, \"a confronter (or rival) in the close combat I have not.\" In l. 44 of the same plate we have ma.hi.ru la i.su.u, \"a confronter has not had;\" and in 42 L. 40, the name given by Sennacherib to his palace is sa sa.ni.na la i.su.u, \"which has not had a rival.\"\n\n19. The verb \"to be\" occurs frequently in a variety of mutative forms; as in 3 m. s. Conj. I. sa.nin ul ib.si, \"rival (or adversary) there was not,\" 18 I. 43; mal.ku gab.r'a.a.a ul ib.si, \"king prevailing against me there was not,\" 145 B. 1; for which we have in 171 B. 7, gab.r'a.a.su ul ib.su.u, \"one prevailing against him (whom) there was not.\" Here the u at the end of the verb is not the formative of the preterperfect, but a relative enclitic; and it may be so in some of the instances of the permansive past which I have given. It is to be observed that the u and ni of all the secondary tenses are annexed immediately to the primary tense; whereas, if an objective affix follow, the enclitic is placed after it. Thus, in 89 L. 40, we have, after sa, i.qa.bu.su.ni, \"which (the people of Ḫatti) call.\" Here i.qa.bu is the 3 p. m. of the present of בּוֹרֵר; su the affix \"it,\" which, in combination with the preceding sa, must be translated \"which,\" as in Hebrew; and ni the relative enclitic is after the affix. Were the perfect to be expressed, we should have i.qa.bu.ni.\n\n20. Other forms of this verb are i.b'a.as.su.u, 3 m. p. present \"do not exist,\" E.I.H. 2, 20; I have also met i.b'a.as.si in the singular; and on Bellino's cylinder l. 31 we have the infinitive 'a.di la ba.s'i.e 'u.sa.lik.su.nu.ti, \"till there was none (left) I made them depart.\" In 38 I. 18, this is repeated with two various readings, i for e, and su for su.nu.ti. The singular su is very often used, when there is no definite antecedent, in the sense of \"people,\" as in 47 B. 88, etc. In 65 I. 2, 13, we have 'u s'a.al.m'i.is (for 'usalmisu) to express the ma.da 'u.s'a.al.mi of E.I.H. 6, 43, \"the people I caused to see.\" Once more we have the 1 s. of the aorist of נִשְׁלַח in Conj. V. in 42 L. 44, 'a.gam.mu 'u.sab.si \"a lake I made\" (lit. \"I caused to be.\")\n\n21. The permansive form of this verb is most commonly\nfound in the parenthetic formula ma.la (or mal) ba.su.'u, \"as many as there are.\" I must here observe that while I have always, in common with Sir H. Rawlinson, assigned to mala an affirmative signification, instead of a negative one, as Dr. Oppert assigned to it in his grammar, I never attributed to basu'u the signification of number, as I am represented to have done in Dr. Oppert's late paper. He now admits that mala basu'u means \"all,\" though he does not yet see his mistake in supposing ba.su.'u to mean \"bad\" or \"contemptible.\" That this word and its Accadian equivalent na.la, as I read it with some small doubt, means simply \"to be,\" I feel perfectly sure. But, as this is rather a matter for a lexicographer than a grammarian, I will not discuss it here.\n\n22. It remains for me to give the forms of the permansive tense in the different conjugations; of pagil Conj. I. enough has been said; I have also given examples of pitgul Conj. I. t. Another occurs in 37 I. 66, where Sennacherib speaks of people, \"who to the kings my fathers,\" la kit.nu.su, \"were not submissive,\" from שְׁנֵי. The conjugation generally indicates repeated action, and the tense that this repeated action was continued for a length of time.\n\n23. The permansive of Conj. II. is of the form napgul; and of II. t. I presume it would be naptegul. I have, however, met with no instance of the latter, and only one of the former. It occurs in 40 L. 3, sa.gis n'a.an.zu.zu, \"they were fixed on high.\" The root is נָגַל. The n of the root is here preserved, but it is often assimilated to the z when it comes in contact with it; and we have thus apparently, though not really, a root of which all the letters are נָגַל. In the present text, which is to me in great measure obscure, the verb quoted lies between two other permansive ones, pit.lu.lu Conj. I. t. and n'u.uṣ.su.ru Conj. III., which, again, is followed by n'u.um.mu.ru in the same conjugation.\n\n24. The permansive form of Conj. III. is but rare: the form is paggal. Examples are qar.ra.da.ku, \"I am very strong,\" 17 I. 32; and al.la.ku bir.k'a.a.a, \"my knees are moving briskly,\" 16 II. c. 30. This is the 3 f. p. from לָלֶה. In the following line we have another permansive verb, la.'a\nni.ha se.p'a.a.'a, \"my feet have not any rest.\" This is from נוה in a conjugation peculiar to concave verbs, which is in the mutative parts analogous to Conj. III. of perfect verbs, but in the permansive parts has generally a passive or neuter signification. Another example will be found in §11. Examples of Conj. IV., of which the form is puggul, have been already given in §§11 and 17. The verbs in the last section are בָּלְהוֹ and בָּנְמוֹ.\n\n25. I have not met with the permansive form of Conj. III.t. or IV.t., nor of V. or V.t. The former of these I should from analogy expect to be sapgal; and the latter, perhaps, satpegal. Conj. VI. makes supgul; so, at least, I infer from the defective and otherwise irregular verbs in this tense which alone I have hitherto found. From בָּלְהוֹ we have certainly su.lu.ku, \"they were made to go,\" 49 I. 4, 30; and I suspect su.qu.ru, in an obscure passage, 39 L. 44, to be another 3 m.p. from בָּלְיִם. On the other hand we have su.ga.lu.la and su.qu.lu.la from בָּלְיִם in 18 I. 62, as if the form had an additional syllable. The fact, however, of the additional vowel being in different copies a and u, suggests that it is irregularly introduced; perhaps in order to distinguish to the eye a derivative of this root from one of בָּלְיִם or בָּלְיִם, which were both in use; or perhaps, because the liquid l admitted a vowel before it (see §24 of Chap. II.) I would therefore read suglula.\n\n26. There are two verbs in a permansive tense beginning with בָּלְיִם, of which the conjugation has been doubted. In the one this character is followed by qul, in the other by kun. There can be no doubt that the verbs are בָּלְיִם and בָּלְיִם; but the initial character admits two readings. It may be sit, and the verbs would then be in Conj. I. t.; or it may be mus, which, as a variety of examples prove, may be interchanged with mus before פ or נ. Thus, mus.ki and mu.us.ki are both used for the name of the country, Musuk, Heb. מֻסּוּק. Thinking that the significations of the verbs in question were not such as suited the Conj. I. t., it occurred to me that m was here substituted for s as a preformative, on account of the first radical being s, the conjugation being VI. As, however, I have found no such tense beginning with mu, or mus, and as 'u.s'a.as.kin is met with in Conj. V., with the preformative\ns before a first radical s, I am now inclined to think that the sixth conjugation has never m for its preformative, and that we should read sit.ku.nat su.bat.sun in 41 B. 39, \"their dwelling is lying;\" and in the Equinox tablet, K. 15, sit.qu.lu, (the day and night) \"are balancing one another.\"\n\n27. Of the permansive form of Conj. VI. t. I have as yet met only one example. It is in some respects a very valuable one, as it clearly establishes the existence of a permansive past, terminating in u. The nominative is singular, and there is no relative particle on which it could depend. It occurs in 51 I. 1, 32, where we have la su.te.su.ru mu.ze.e mi.e.sa, \"the exit of its waters had not been made straight.\" The verb is יְשַׁע, and the form is probably sutpegul; but from the weakness of the first radical, this is not certain. I have not met with the permansive form of either VII. or VII. t.\n\n[Chapter II.]—Nouns.\n\n1. In the present chapter I propose to consider the declension of Assyrian substantives and adjectives. In the following chapter I will treat of their syntax, endeavouring to show under what circumstances each of the forms, the connexion of which is explained in the present chapter, is found to be used. In a future chapter I will treat of the connexion between the primitive forms of nouns and their significations; nouns which have the same primitive form bearing, in a very great degree, the same relation in their meanings to their verbal roots.\n\n2. I think it best to reserve the full consideration of the forms of nouns, as connected with their significations, till I have treated of the verbal forms of roots; but as I shall have to speak of these forms occasionally in connexion with declensional differences, I feel it necessary to define the terms of which I shall have to make use.\n\n3. A perfect Assyrian root consists of three consonants, which are called its radical letters; and every Assyrian word derived from such a root consists of three consonants at least, and two vowels at least. Words which differ from one another only in their radical letters are said to be of the same\nform. Thus marzi and namri are of the same form; as are puluhti and tukulti; musaskin and musalbir; gabsa'ati and rapsa'ati, etc.\n\n4. If we assume a root of three letters, we can always exhibit a derivative of this root of the same form as any derivative of any other root that we may meet with. It has been the custom with Hebrew and Arabic grammarians to assume יָד as a standard root. It was chosen on account of its signifying \"to do\" or \"to make,\" which seemed the most natural type of a verbal root; but it is objectionable on account of the weakness and uncertainty of sound of the second radical. I substitute for this a י, which gives an imaginary root, but one which is very convenient. The words in the preceding section would become, by substituting the three letters of this root for the three in each of them, pagli, pugulti, musapgil, pagla'ati; and I take these as the names of the forms to which these words respectively belong.\n\n5. All the forms given in the preceding section are forms of nouns; but there is a difference between them. One of the four, musapgil, is a primary form, or theme; the three others are derived forms, or cases. Observe that, besides the principal theme, which is singular, there are plural and dual themes, and sometimes feminine themes, singular and plural. In the present chapter I will show how the cases are derived from the theme, and to a certain extent how the theme may be recovered from one of its cases. The same derived form may, however, be derived from different primary forms. For example, pagli is a case, the theme of which may be pagal, pagil, or pagul. Had we only the words marzi and namri before us, we should have no means of judging to which of three possible themes we should trace each of them. Other derivatives of the themes in question are required before we can say that the former theme is maruz, the latter namir.\n\n6. The themes last given differ from musapgil, in that they contain no consonant but the three letters of the root. I call such themes as consist of the three radical letters, with two short vowels intervening, simple themes. Those which contain any addition, reckoning as such a quiescent letter, נ, א, or י,\nwhich may be considered as lengthening a vowel, I call augmented themes.\n\n7. The following are the different kinds of augmentation which an Assyrian root may have, and it may have two or more of them at the same time. First, it may have a prefixed addition consisting of one or more servile letters with a vowel or vowels, as in musapgil; 2nd, it may have a medial addition of a servile letter, as in pitgul, or in pagil, where the first syllable would be in Arabic ل, in Hebrew י or י; 3rd, it may have the middle radical doubled, as in paggal; 4th, it may have the final radical doubled, as in paglat; or 5th, it may have one or more servile letters added at the end as in puglān or paglūt. I do not consider the at or it at the end of feminine nouns as constituting an augmented theme, but as a declensional modification of a theme. The form pugulti in § 4 I consider to be a feminine case of pugul, or a case of puglat, the feminine theme of pugul.\n\n8. There are many feminine themes of this description. Some of them are substantives denoting females, or what are considered to be such, where the true themes denote the corresponding males. Thus sa.p'i.in is “a sweeper away,” applied to a king, 40 B. 25; sa.pi.n'a.at is the same, applied to a chariot, which is conventionally feminine, 41 I. 82; mu.rap.pis, 33 L. 9, and mu.rap.pi.sat, 38 L. 5, mean “enlarger,” and are applied to the king and to the sceptre respectively. Adjectives, which always agree with their substantives in gender, form feminine themes of this description: they are, however, rarely used in the theme, either masculine or feminine. A few nouns are used in the masculine and feminine forms without distinction, as puluh and pulhat, “fear;” and there are several which are only found in the feminine form, as hirat, “a wife;” irzit, “a land,” or “the earth;” isat, “fire;” amat or tamat, “a sea.”\n\n9. Besides these, there are many feminine themes, which have a collective signification, and may very often be translated as plurals. In 42 B. 70, we have u.kin lib.n'a.aṣ.su, “I made fast its bricks;” aṣ.su stands for at.su by a euphonic change which will be explained in § 56 of this chapter. The word\nis *libnat*, the feminine theme of *libin*, which would signify \"a single brick.\" It is not a plural, as might perhaps be thought. The plural would be, according to analogy, assuming *libin* to be a feminine, *lib.na.a.ti.su*. Besides, it is declined as a feminine singular; and similar nouns are accompanied by adjectives in the feminine singular. It is, as I have stated, a collective singular, used for a plural. There are above a score of such collectives, from perfect and imperfect roots, in frequent use in the texts.\n\n10. All nouns terminating in *at* or *it* servile are feminine; other nouns may be so. Examples of such are *haluz*, \"a castle\" (I put the second vowel of the theme in roman, because I am not sure what it is; see § 5). In 52 I. No. 3, 2.16, we have *ha.al.zi ra.bi.tim*, \"of the great castle;\" and the plural occurs with feminine adjectives (*-t* being used for the first syllable) 146 B. 6, 7. In 17 II. 32 l. we have *li.sa.an li.mut.tu*, \"a sore tongue,\" the adjective being feminine. Other examples of feminine nouns, not so by syllabic addition (or, as Hebrew grammarians express it, by motion), are *um*, \"a mother;\" *istar*, \"a goddess;\" (I believe, a loan word, originally signifying \"a star;\") *umman*, \"an army;\" *uzun*, \"an ear;\" *qat* or *qa'at*, \"a hand\" (we have *qa.aş.su*, \"his hand,\" 49 B. 32 and 8 II. 45 r; the plural in the principal case is *qa.ta.tu* 8 II. 40 r, which proves that the *t* is radical), and all augmented forms ending in *ût*, as *sarrût*, \"a kingdom\" or \"reign.\"\n\n11. Nouns have three numbers, the singular, the dual, and the plural. The dual is not often used, and only, I believe, in the theme (§ 5); the cases of the dual do not seem to be distinguished from those of the plural. The dual is of course most frequently used for nouns which express objects that are in their nature double; but I think that I have met with duals of other nouns.\n\n12. Nouns in the singular number have three cases in addition to the theme. I call these the first or principal case, the second case, and the third case. They are used so differently from the nominative, genitive, and accusative cases of European languages, that I think, on mature considera-\ntion, the use of these terms decidedly objectionable, as likely to mislead. Their use will be explained in the following chapter. Here it will suffice to say that the first case ends in \\( u \\) or \\( um \\): it appears from the grammatical tablets that the Assyrians considered this to be the leading form of the noun. The second case ends in \\( i \\), \\( e \\), or \\( im \\); and the third in \\( a \\) or \\( am \\). The third case is only used in the singular number.\n\n13. Before I speak of the formation of these cases from the theme, I must go back to the classes of roots. I stated in § 3 that a perfect Assyrian root consisted of three radical consonants. It does not follow, however, that every root which consists of three consonants is perfect. Not to speak of roots having for the first radical a \\( \\aleph \\), which is often assimilated to the following consonant, and which sometimes disappears altogether; nor of surd roots, as they are called, of which the second and third radicals are the same, and which have some peculiarity consequent upon this; there are certain weak letters, the existence of which in a root renders it imperfect.\n\n14. I consider \\( \\aleph \\), \\( h \\), \\( l \\), \\( y \\), and \\( y \\) to be weak letters; I do not include \\( n \\) in the list; preferring to regard those roots in which a weak letter is found where cognate languages have \\( n \\), as substituting an \\( h \\) or \\( y \\) for it. This is the case in a few roots, of which the most common are \\( \\aleph \\), \\( h \\), \\( l \\), \\( y \\), and \\( y \\). I consider the corresponding Assyrian roots to be \\( \\aleph \\), \\( h \\), \\( l \\), \\( y \\), and \\( y \\); as I consider the Assyrian root corresponding to the Hebrew \\( \\aleph \\) to be \\( \\aleph \\). In this root the second radical never exhibits any symptom of weakness.\n\n15. All these letters are capable of causing the assimilation of the preceding and following vowels, which sometimes causes the contraction of two syllables into one; for when a weak letter has the same vowel before and after it, the two may coalesce, though they do not necessarily do so. An example may be given in the third person singular of the present of a verb with a weak letter for its first radical, suppose \\( \\aleph \\). Instead of \\( i' allak \\), which would be the regular form, the Assyrians first substituted \\( i \\) for \\( a \\), assimilating the vowels, and then contracted \\( i' il \\) into simple \\( il \\). Thus they wrote \\( illak \\), a dissyllable, where a regular verb would have three syllables.\n16. So, when the second radical was weak, they wrote \\( ru'uq \\) for \\( ra'uq \\), like \\( maruz \\), and perhaps pronounced \\( ru.uq.ti \\) as a dissyllable, when the corresponding form of a perfect root would have three syllables. It must be observed, however, that when the two vowels of the form were characteristically different, an assimilation could not take place; for example, in the form \\( pâgil \\), the nomen mutantis, no assimilation is permitted.\n\nWe have \\( qa'is \\), 17 I. 9, and \\( qâ'i.sat \\), 66 II. 9, \"an ensnarer (of the living),\" applied to a god and a goddess. See Gesenius under \\( \\aleph \\), 2. Examples of assimilation when the third radical is weak will be given presently.\n\n17. Besides these irregularities, which are common to the five weak letters, three of them, \\( \\aleph \\), \\( \\aleph \\), and \\( \\aleph \\), are liable to be dropped altogether. In the case of one of these being the middle radical, this may always be considered a case of contraction, and it may be so sometimes when the first or third radical disappears; but the dropping of a letter of which I speak here, and of which I will shortly give examples, is not the result of contraction. Where a perfect root would have a complete syllable, though a short one, a root beginning or ending with one of the letters in question will sometimes drop it, apparently on the principle that a short unaccented vowel, having no substantial consonant to support it, is a nullity. Such Hebrew forms as \\( \\aleph \\), \\( \\aleph \\), and \\( \\aleph \\) will show what I mean. In the first and second, weak letters, called by Hebrew grammarians \\( \\aleph \\) and \\( \\aleph \\), are altogether omitted; of these letters, the latter is in Assyrian certainly \\( \\aleph \\), and the former is possibly \\( \\aleph \\). In the second and third examples an \\( \\aleph \\) is written, but regarded as a nullity.\n\n18. I now come to consider the different modes of declining themes. The most natural mode is simply to add to the theme the three terminations, which I will here call \\( u \\), \\( i \\), and \\( a \\), reserving till the next chapter an explanation of the modifications of these terminations indicated in § 12. This natural declension is always used when the theme terminates in a strong consonant preceded by a long vowel, such as that of\nthe form pagâl, the infinitive, or nomen mutationis, or that of the augmented forms in ān or ūt, whatever may precede the last syllable. It is also used when the last consonant of a monosyllabic theme is strong, provided that the theme be not derived from a surd root. Examples are mut, “a husband,” whence muti; ab, “a father,” whence abu, abi. Lastly, it is used when, the last consonant being as before, the last vowel, though short, is so completely separated from the preceding vowel, that a contraction is impossible. This happens in many forms where a double letter intervenes, as tapgal, pitgul, musapgil, etc.\n\n19. There are three cases indicated in the preceding section in which the noun is not declined in the natural manner there indicated. 1st, The last consonant may be a weak one; 2nd, the theme may be a monosyllable derived from a surd root; and 3rd, the theme may terminate in a strong consonant, preceded by a short vowel; and this may be separated from the preceding vowel by so thin a partition that a contraction becomes possible, and generally takes place; the last vowel being dropped. I will treat of these three cases in their order.\n\n20. If the theme terminates in a weak letter, the preceding vowel is assimilated to that of the case. Thus from ‘azî, “going out” (root ṈN), we have ḥāzūw, 67 I. 2. 37. So we have from the theme which signifies “a crown”—it is uncertain what it is—‘a.gu’u, ḥāzūw, ‘a.ge’e, and ‘a.ga’a in the three cases. In 30 II. 19 r. we have ‘a.gu’u e.lu’u, “the high crown,” where both adjective and substantive end in weak consonants. Examples of the other cases will be found in 9 I. 5 and 21. So again from the theme for “mouth,” we have ḥāpu’u in 39 II. 1 l., ḥāpi’i 39 II. 5 l., and ḥāpa 1 L. 14. Here also the actual theme is uncertain; nor is the root itself less so. Perhaps it is ṈN. If so, two weak letters would come together, and a contraction would take place, as it certainly does in ḥāpi’si ‘a.hi, “another work,” 16 I. 20.\nI cannot think, however, that a contraction takes place as a matter of course, and that we should read 'agû, elû, pû, etc., when a second vowel is expressed.\n\n21. In monosyllabic themes derived from surd roots, or from which surd roots are derived (for I suspect that many of these themes are adopted from foreign languages, and that the verbal form, if in use, is derived from the substantive or adjective), the final consonant is repeated before the case-ending. Thus from sar, \"a king,\" we have sar.ru; from lib, \"a heart,\" lib.bu; from um, \"a womb\" or \"mother,\" um.mu. A few dissyllables also double their last letter, as agam, \"a lake,\" whence a.gam.mu, 41 L. 44. Perhaps this should be considered as derived from a quadriliteral root. The word is singular, for it is referred to by sa.\n\n22. The omission of the last vowel before the case-ending is very common. It always takes place in the forms pagal (but not pagâl, the infinitive), pigil, and pugul, and in augmented forms like muptagil, in which the second radical stands alone between the last two vowels. It takes place for the most part in the forms pagil and pagul, as in n'a.am.ri, from namir, mar.zi from maruz, and many others; but there are exceptions. In 7 I. F. 24 we have bit.su la.bi.ru, \"his old house;\" older inscriptions have la.be.ru, 20 I. 3; and it is only in the inscriptions of Nebuchadnezzar that I find l'a.ab.ri, 65 I. 2. 39. We must, however, distinguish the form pagil, the nomen mutantis, and pagûl, nomen mutati, from pagil and pagul, which like pagal belong to the nomen permanentis. Both forms may belong to the same root, and to the eye may be the same. Thus mâlik, which would make mâ.li.ku, and in the feminine mâ.li.kat, 66 II. a. 4; or \"king,\" ma.lîk, which would make ma.lî.ku, 145 B. 1. So dal.hu, 74 B. 13 (whence da.li:h.tu), means \"troubled, being in disturbance;\" but dâlih, dâ.li.hat, means \"the putter in disturbance, the disturber,\" 66 II. a. 4.\n\n23. The three forms piggal, piggul, and puggal require special notice. The two former are derived from the third\nconjugation, and the last from the fourth. It will appear very strange to an Hebraist, but it is certainly the case, that the duplication of the second radical is very apt to disappear, and the initial vowel to be the sole characteristic of the conjugation; the forms thus become pigal, pigul, and pugal, and the first two of these generally, though not always, drop the second vowel in their declension. Thus for gissar, the intensive form of gasar, we have gisar; and in the second case \\( \\text{gissar} \\), 17 I. 1, a little more forcible than \\( \\text{gissar} \\), which we have in the parallel text, 32 I. 1. The meaning is “bold, daring;” and we have the feminine \\( \\text{gisar.tu} \\), 66 II, a. 1. The word which is constantly used for “enemies” in the Behistun inscriptions is similarly contracted. It is nikrutu; in the singular it would be nikru, from nikar. So \\( \\text{limnu} \\) in 48 B. 31 is from liman, for limman, “annoying” or “injurious.” But this word gives occasion for another remark. The word limnu may come from a theme limun, as well from liman; from the nomen mutati as well as from the nomen permanentis. We have, in fact, in 17 II. 32.\n\n\\( \\text{pu'u limnu} \\), “an injured mouth;” followed by \\( \\text{lis'a.an limutu} \\) (for limuntu), “an injured tongue;” the text evidently speaks of wounds. The two adjectives are distinct in the feminine singular, which would be with active signification \\( \\text{limat.tu} \\), but are confounded in all other parts.\n\n24. In some adjectives, however, of these forms the final vowel of the theme is not dropped. I have met \\( \\text{i.sar.ru} \\) from isar for issar. The reason of this I take to be that the initial vowel is here virtually formed by contraction. The root is \\( \\text{iy} \\); and the i of the root and the i of the form combine together, so as to form an obstacle to further contraction. The retention of the vowel in suturu may be explained on the same principle, the root being \\( \\text{iy} \\) and the form supgulu, so that two u’s combine in the first syllable. It is less easy to account for pumalu; perhaps the a is long by nature, or perhaps the liquid third radical may have rendered it desirable that a vowel should precede it. I am the more inclined to\nthink this, because I find ba.ta.lum in 38 II. 74 r.; but in 50 I. 4, 28, I find b'a.at.lu.ti. The theme is batil, as the feminine form ba.t'i.il.tu in 172 B. 5 proves conclusively; the a before the l must therefore be euphonic.\n\n25. The feminine theme may be said to be formed from the principal case of the masculine by changing u into at or it. I am not able to give any rule by which it can be absolutely determined which vowel should be used; and in most adjectives it cannot be known, the theme not being in use, and its vowel being dropped in the cases. On the whole, however, I find at to be more frequently used than it; and I believe it is exclusively used when the theme is a nomen mutantis of any of the conjugations, or a monosyllable derived from a surd root.\n\n26. The feminine cases are generally formed by adding tu, ti, and ta to the theme, properly so called; sometimes, however, by adding u, i, and a to the feminine theme. The latter mode is the only one possible, if the theme be a monosyllable derived from a surd root. Thus from sar, \"a king,\" we have sarrat, \"a queen,\" in the theme, and sarratu in the principal case. From hirat, \"a wife,\" on the contrary, we may have hirtu, though hiratu is also in use. So also from napsat, \"a life,\" theme napis, we have sometimes napsatu, but more frequently napistu. Adjectives almost always form their feminine cases by adding tu, etc. to the proper theme, at least if the root be a perfect one, though they sometimes admit the other form also. Thus we have saplitu, \"low,\" as well as sapiltu; mahritu, \"old,\" as well as mahirtu. From dan, however, we could only have dannatu; and, on the contrary, from eli only elitu.\n\n27. The addition of the feminine case-endings to the theme sometimes causes a change in its last letter. For instance, n is changed into t, as in the instances already given in § 23; the masculine case lim.nu corresponding to the feminine li.mut.tu, for limuntu. So we have li.bit.tu, for libintu, 49 B. 52. The feminine theme is libnat. It is probable that\n\\(d\\) and \\(t\\) when final were also assimilated to \\(t\\) when they preceded it in the feminine cases; but the Assyrians did not in writing distinguish these letters from \\(t\\) when terminating a syllable.\n\n28. The letters \\(s\\), \\(z\\), \\(š\\) and \\(ṣ\\), were sometimes, but not necessarily, changed to \\(l\\) before the \\(t\\) of the feminine cases. I believe, however, that none of the three last-mentioned letters is ever found preceding the \\(t\\). It is changed either into \\(s\\) or into \\(l\\). Thus in 17 II. 27 \\(l\\). we have \\(ma.r'u.us.tu\\), evidently the feminine of \\(mar.zu\\). In 16 I. 76 we have \\(ma.r'u.us.ta\\); and in a parallel text, 27 I. 92, we have \\(ma.ru.ul.ta\\). In the upper part of 27 I. 10 we have \\(ri.sti\\) for \\(rizti\\); and, again, in 12 I. 90 we have \\(ri.h'i.il.ti\\), evidently for \\(rihiẓti\\). As to \\(s\\) itself we have \\(lu.b'u.us.ti\\), “clothing,” 38 II. 48 \\(m.\\), but much oftener \\(lu.bul.ti\\). A comparison of the text last quoted with 67 II. 62 must, I think, satisfy every one that these are the same word. I at one time read the initial character \\(ṭib\\), and translated it, “what was dyed with;” and I perceive that Dr. Oppert and M. Ménant have done the same; but here we have \\(lubulti matisunu\\), “clothing of their people,” just as in 38 II. 48, 49 \\(m.\\) we had \\(lubusti ilutisunu\\), “clothing of their godships.” It follows that \\(birmi\\), which usually follows \\(lubulti\\), does not signify a dye-stuff but a material; no doubt “wool,” \\(\\text{Fepfou}\\); compare \\(vellus\\) for \\(velves\\) (as \\(mollis\\) for \\(molvis\\)). The other word, which is commonly joined with \\(birmi\\), \\(ku.kum\\), or \\(kum?\\) for I suspect that the first character is a nonphonetic determinative of names of plants, I take to mean “flax” or “cotton.”\n\n29. The Assyrians formed their plurals in several ways, of which I will treat in succession. Some plurals are formed by the addition of \\(n\\) for the theme, and \\(nu\\) and \\(ne\\) for the case ending, to the third case of the singular. These are sometimes written in full phonetic characters; but very often the theme, or the principal case of the singular, is accompanied by the character \\(n\\). This combination must be understood to denote the proper plural form, which the reader is presumed to know;—and this constitutes one of the chief\ndifficulties in reading Assyrian. Sometimes, however, as a guide to him is added, which I read ne; because, while ne and ni were expressed alike, te and ti were distinguished; and it is te which is used similarly to when the plural theme terminates in t.\n\n30. Examples are dup.p'a.a.ne, \"clay tablets,\" K. 116; where K. 131 has and K. 136 only. All these tablets contain the same text. So we have hal.za.ne, \"castles.\" 32 I. 50 and hal.zu with plural sign (to be read halzan or halzane) 146 B. 6, 7, 8. Observe that the prefixed to this word is a nonphonetic determinative. In 28 I. 1, 12, we have har.s'a.a.nu, \"woods;\" and in 145 B. 2, har.sa.ne, in the second case. In 39 II. 11 l., pa.'a.nu. from pa.'a (§ 20) is \"mouths,\" as the Accadian equivalent proves; but in 17 II. 31, pa.'an is used for \"a face;\" it takes, however, a plural adjective. In 33 L. 6, e.mu.q'a.an, \"powers,\" and in 30 II. 14 r., ri.s'a.an, \"heads,\" are written in full. The singulars emuq and ris are in common use.\n\n31. The plural in an only appears in a limited number of substantives, some of which admit also different plurals. It is, I believe, never used in the case of an adjective or of a substantive which is feminine by termination. Several plurals in an are, however, feminine, as well as the singulars from which they are formed, as appears from the adjectives which accompany them. Such are emuqan, risan, and halzan, cited in § 30. It would, therefore, be incorrect to say that an was the termination of the masculine plural. I believe that originally, in the language from which all of the Semitic family have diverged, the addition of am or av to the singular theme rendered it plural; and that at was added as a feminine termination to both singular and plural. Thus the theme alone was of either gender, as was the plural in am or av; but at in the singular and avat in the plural were distinctively feminine. From the original am, which was retained in Phoenician, came the Hebrew im, and the Assyrian and Himyaritic an; from\nthe av came the Egyptian u. The Aramaic and Arabic forms, in which both vowel and consonant are different from what they were originally, are probably of later origin than the others.\n\n32. Another form of the plural ends in t in the theme, and in tu and ti in the cases. Originally, I conceive, as I stated in the last section, this termination was awat or awat, and was peculiar to feminines by termination. This was in time changed to at, sometimes contracted to at; but in the cases there is generally, though not always, an between what belongs to the theme properly so called and the preceding; and this should, I conceive, be sounded as a distinct syllable. In Arabic, as well as in Masoretic Hebrew, the termination or is pronounced as one syllable, but the quiescent letter which is always inserted indicates contraction; and the Hebrew holam manifestly stands for awa.\n\n33. This plural in at is almost always used for feminine adjectives, and for substantives feminine by termination. It is also used for many substantives which are feminine otherwise than by termination. Thus we have um.ma.n’a.at, “armies,” 146 B. 4, and um.ma.na.te, 151 B. 12, from umman. In 37 II. 11, the plural of “mouths” is stated to be pa.a.tum or pa.a.nu; pu.u in the singular and pa.an have masculine adjectives, 17 II. 32 and 31 l. I presume, however, that pa.a.tu would take a feminine one. Irregularities of this kind are found in all languages.\n\n34. Examples of this plural when the singular is feminine by termination are zi.ra.a.te “high, supreme,” 33 L. 6; e.la.tum, “high,” 30 II. 14 r.; dan.na.a.ti, “strong,” 146 B. 6; mar.za.a.ti, “difficult of access,” 146 B. 7; all which adjectives are in concord with the plurals in an mentioned in § 31; hi.ra.ti ra.ba.a.ti, “great wives,” 153 B. 12, from hirat. This is a theme feminine by termination; but it must not be supposed that hir would mean “a husband.” The latter I take to be ha.ar, whence h’a.a.a.ru, 36 II. 40 l.; hi.ra.tum and hi.ir.tum in line 43 l.\nare equivalent forms (see § 26), or perhaps dialectic variations, of the principal case of hirat, “a wife,” which is in the same relation to the former theme as din or dinat, “a law” or “judgment,” to da’an, “a lawgiver” or “judge.”\n\n35. Besides the two plurals of which I have hitherto spoken, which I take to have been the original forms common to all the Semitic languages, there are other forms which the Assyrians appear to have developed after their separation from those who used the other languages of the family. One of these is the masculine plural in ut in the theme, and utu and uti in the cases. It differs from the feminine plural last mentioned in having u in place of a at the end of the theme, and \\( \\text{u} \\) for \\( \\text{a} \\). The \\( \\text{u} \\) is, however, oftener omitted than expressed, contrary to what takes place in the case of \\( \\text{a} \\).\n\n36. This plural is used by all adjectives and by the nomina mutantis of all the conjugations. All these admit feminines by termination; and it may be laid down as a general rule that a masculine plural in ut can be changed into a feminine plural in at; or if not into that, into et (see § 37); but many feminine plurals in at do not admit masculine plurals in ut. For example, sarra’ate is good Assyrian for “queens,” but for “kings” they would say sarrane; sarruti would come from sarrut, “a kingdom” or “reign.” Examples of these plurals need not be given here. They will appear in the following chapter, and are everywhere to be met with.\n\n37. Some feminine substantives and adjectives form their plurals in etu, etc., in place of atu, ate; or, perhaps, I should say, as well as in atu, ate. In 33 I. 10 we have \\( \\text{a.na ru.q’e.e.ti} \\), “to distant places (he fled);” in 153 B. 12 we have is.re.ti nam.ra.a.ti; the latter word is certainly an adjective in the feminine plural, “shining,” or the like. Whatever, then, may be the meaning of isreti, it is clearly used as a substantive feminine and plural. Nebuchadnezzar speaks E. I. H. 3. 13 of having made and purified (?) the isre’et of Babylon, and l. 65 those of Borsippa. The spelling is not exactly the same in any two of the three passages, but there can be no reasonable doubt that the word is the same. These examples establish the existence of the feminine plural in et; and I confess\nthat I cannot affirm with confidence anything more than that it exists.\n\n38. I may, however, mention a conjecture which has occurred to me. Can et be a feminine plural of adjectives used in place of āt when they are not accompanied by substantives, but are used as substantives, with \"persons, places, or things,\" understood after them? This explains the ruqeti of 33 I. 10, and the mugalleti of E. I. H. 10, 16, \"may I not sinfully incline ('ar.si, from יָשַׂי) to the blasphemous persons!\" the feminine plural being used to express contempt. In a similar context in 68 I. 2. 30, hi.te.ti, \"sinful persons,\" is substituted. It explains also the of N.R.8, where the adjective an.ne.ti cannot be attached to the substantive which follows it; but we must translate, \"these (are) the countries;\" and so in similar contexts. But how, it may be asked, can isreti be explained on this supposition? May it not be the feminine plural of יִשְׂרָא isar, meaning \"the straight places, the avenues?\" \"lightsome avenues\" well suits the context in 153 B. 12; and Nebuchadnezzar may have said, \"avenues of Babylon (and Borsippa) I caused to be made, and I cleansed, or kept clean.\" In a future chapter I will give reasons for assigning to יִשְׂרָא the primary sense of \"cleansing.\" It does not appear to me that the spelling of isret is inconsistent with its derivation from isar. So far as I have observed is preferentially used when a word begins with a radical letter, and when it begins with a servile i. In the Assyrian text, and in one of the Babylonian ones, the word begins with ; in the other Babylonian one the first syllable is expressed by e.is, which, however, may have only meant that the initial i was very long, and which, on the authority of the other two passages, we may safely pronounce to be bad spelling. I do not recollect any place in which et occurs as a formative of the feminine plural, which is inconsistent with the theory which I have here proposed. Nevertheless, I am far from having the same confidence in it as I have in my other statements. I can only say that if the difference between et and āt be not\nwhat I have suggested, I am quite unable to explain what\nthat difference is.\n\n39. A very common form of the Assyrian plural remains\nto be spoken of, namely, that in which no syllable is added\nto form it, but the plural cases are either the same as the\nsingular, or modifications of the singular forms. The dis-\ntinction between the two numbers is indeed sometimes made\nby a change of case, as will be shown in the following chapter;\nbut even this is often not to be perceived, and the context\nbecomes our only guide. I will first give examples in which\nthe singular and plural are identical.\n\n40. As this identity of the singular and plural is what most\npersons would consider very improbable, it is necessary to\ngive some very clear instances of it. I do not rely on such a\npassage as 'i.lu.ti.su.nu, \"of their godships,\" already quoted\nin § 28. In fact, 'iluti is here singular; derived nouns in ut\nnot admitting a plural. In 15 I. 106, 113, it occurs joined\nto an adjective in the feminine singular. Neither do I rely\non lib.bi.k'u.un, \"your hearts,\" 9 I. 19, though I have myself\nno doubt that libbi is here plural, because words which are\ncertainly singular occur elsewhere, accompanied by plural\naffixes. I will, however, bring forward clear instances of\nplurals, the same as the singular, accompanied by plural\nadjectives.\n\n41. In 152 B. 2, 1, we have šuk.ki nak.lu.ti, which I would translate \"well-built houses;\"\nbut whatever be the exact translation, it is clear that šukki\nis here used as a plural, and equally clear that it is the\nsecond case of the singular. Again, we have in 41 B. 57,\nmal.ki la.bi.ru.ti, \"ancient kings,\" another example that\ncannot be contested. And so in 41 I. 74, s'u.u.ri ma.ru.ti,\n\"fatted oxen;\" in 144 B. 10, 11, yu.me ma.'h.du.ti, \"many\ndays.\"\n\n42. In other cases forms identical with the singular are\nsubstituted for the theme with a plural sign. Thus in 38 B. 67,\nwe have for \"gates;\" in another copy of the\nsame inscription, 50 B. 74, ba.bi is substituted. This noun\nadmits also a plural in *at*. We have in 39 L. 22, *ba.ba.*'a.ti*. Variations of this sort occur in almost all languages; and there does not appear to me to be any difference in the use of these plurals, so that one could be called definite and the other indefinite.\n\n43. A similar example occurs as to ḫa. ḫa. ḫa. ḫa., *ba.tul*, with the determinative of males prefixed, and the plural sign added, 21 I. 43; in 22 I. 109, *ba.tu.li*, with the same determinative, but without the plural sign, is substituted. To both of these words is added *ba.tu.la.ti* with the determinative of females prefixed. The meaning is obviously \"pure boys\" and \"pure girls.\" Other instances occur in which two nouns are coupled together, one of which is evidently plural from its form, while the two are evidently in the same number. Even if the passage 21 I. 43 did not exist, we might infer that *ba.tu.li* in 22 I. 109 was plural, from its being coupled with *ba.tu.la.ti*, which is manifestly so.\n\n44. The same principle applied to the formula \"oxen\" and \"sheep\" gives us two more plurals of this sort. In 67 II. 41 we have ḫa. ḫa., the monogram for an ox, followed by ḫa., the plural sign, and ḫa. ḫa. ḫa., ḫa., the copulative conjunction; then comes ḫa.e.e.ne., \"sheep,\" which the context proves to be a plural. In 41 I. 82 we have, in place of this, *rag.ge* ḫa. ḫa.e.ne., and in E.I.H. 2. 28 *r'a.ag.ga* ḫa. ḫa.e.e.nim. The construction, it will be observed, in the last two passages, is different. Surely, it is a fair inference that *raggi* is plural as well as ḫa.e.e.ni. I am rather disposed to draw a further inference, namely, that ḫalap, which corresponds to ḫa. ḫa., was only used in the singular number, and that *raggu* was used as its plural. On this question, however, I do not think that I have evidence which warrants a positive opinion.\n\n45. The above examples, to which might be added many others, must, I think, satisfy every one that the Assyrians had a plural of the same form with the singular; though there was some slight difference in the use of the cases. I now proceed to consider plurals which are modifications of the singular, not identical with it. The principle of these\nmodifications is that in dissyllables, the last of which is not lengthened by a quiescent letter, the singular inclines to have the accent on the former syllable, and the plural on the latter. Monosyllabic themes admit no such modification; nor those in which, the middle radical being weak and the two vowels the same, they coalesce in the declension into one, as ḍālā, zi'in, whence zenu. Nor again is this distinction possible where the last vowel of the theme is necessarily long, as in batul, § 43.\n\n46. As a general rule, however, such a noun as pigil would add its case-ending, in the singular to pigil with the accent on the first syllable, and would thus form piglu, etc., with the second vowel suppressed; while the plural would retain the second vowel; and would perhaps admit also another change consequent on this. For example nakru is used for \"an enemy,\" but nakiri for \"of the enemies,\" the theme being nakir.\n\n47. I have spoken of this distinction being rendered more marked by another change consequent on this. The Assyrians were accustomed to double the consonant of an accented syllable. This is the reason why the second radical is commonly doubled in the present of the first conjugation, as in i.qab.bi, \"he says,\" and numerous other instances, which must not be supposed to be Pihel forms. In conformity with this usage the last consonant of the noun is often doubled in the plural. Thus, in 43 I. 43, we have sal.gu na.hal.lim, \"the snows of the valleys;\" while in the parallel text, 40 I. 77, we have na.'h.li, \"of the valley.\"\n\n48. Where the first radical was a very weak one, that admitted of being altogether dropped, it was, I think, dropped in plurals of this kind. Instances of this are necessarily rare; and I am not sure that there are sufficient to establish the usage. I remark, however, that in the same nouns that could drop the initial syllable in the plural, that syllable is dropped in the singular when the noun is in what Hebrew grammarians call the state of construction. It may have appeared strange that I have spoken of the noun, when without a case-ending, as the theme and not as the construct form. I have done this\nadvisedly. It will be seen in the following chapter that the second case is repeatedly used,—almost, if not quite, as often as the theme,—where the Hebrews would use the construct form; and it will be seen also that the theme is repeatedly used where the Hebrews would use the absolute form. If I were, therefore, to give the name of construct form to the theme, I should be using a term that would certainly mislead. I think, however, that the theme was in some instances pronounced differently when it did and when it did not indicate a state of construction; that the theme pigil, for instance, was pronounced pigil when in construction, and pígil when not so; and I think that, consequent upon this difference, when the first radical was so weak that the first syllable might be dropped, it was dropped when the noun was in construction.\n\n49. Taking, then, *agal or *agil as a type of such a noun as I have described, I think we should have for the theme when absolute *ágal or *ágil; for the theme in construction, gal or gil; for the first case of the singular, *aglu; and for the first case of the plural, galu or gilu. Such is the conclusion at which I have arrived by induction; but I give it doubtingly; the examples being few, and what others would probably explain differently from what I do. I think there are three nouns following this type which occur with and without the initial syllable, namely, those which signify “a son,” “a servant,” and “a bull.” From the first we have *a.b'i.il.su, “his son,” E. I. H. 1. 33; *ab.lam, “son,” 51 I. No. 1, 2. 16, in one of the copies, the other having the usual monogram for “son.” Without the initial syllable we have, I think, ba.lu.sa, “her sons,” in 66 II. 5. It must be owned, however, that this passage is obscure; and others would interpret it otherwise. On Hebrew and Greek transcriptions but little reliance can be placed, so far as the vowels are concerned; but I am disposed to take “Baladan” as authority for the theme being *abal as well as *abil.\n\n50. As respects the second noun, we have in 95 B. 6, *ar.du for “servant,” before kan.su, “obedient,” where 145 B. 24 has the monogram ; also in 10 II. 15 l. we have *ar.dda, “a servant,” in the third case. On the other hand, in 1 L. 1,\nwe have, I think (but I admit that there is no positive proof, and others take it differently), *rid* for \"servant of (Assur).\" As for the third word, *r'i.i.mu* is given in Porter's transcript of portions of the E. I. H. inscription as the equivalent of \\( \\text{\\small{r'i.i.mu}} \\), § 59. This group certainly signifies \"bulls.\" On the other hand, *'ar.mi* is a singular noun in the second case, denoting some male animal; and it appears to me probable that it is the singular of the other word. A fourth example may perhaps be the plural *ni.si* from *anis*, see § 57. This is a case in which the few examples bearing on the question appear to throw light on one another. Without, therefore, maintaining that the positions advanced in the last three sections are established, I think that they are highly probable; and I state them here in order that they may be tested by further examples, should such occur.\n\n51. It remains for me to speak of the dual number of nouns; but here again I confess that I can only speak doubtingly. It appears to me that a dual theme in *a*, formed precisely as the third case of the singular, must be admitted to exist. I have only met with it, however, in a few nouns; *qa.ta*, \"hands,\" (where the *t* is radical, for we have the plurals *qa.ta.tu*, *qa.ta.te* in 6 II. 40, 41), *se.pa*, \"feet,\" *bir.k.a*, \"knees,\" and perhaps *ma.ia* or *ma.da*, \"peoples.\" I once thought that a distinction might be established between the second case of the dual and that of the plural; but I rather think now that such is not the case.\n\n*Appendix on the possessive pronominal affixes.*\n\n52. It has been necessary in several places to assume a knowledge on the part of the reader of the possessive pronominal affixes attached to nouns. A complete knowledge of these affixes is essential to a grammatical knowledge of the inflexions of nouns; and I believe that no complete and correct list of them has yet been published. I will therefore endeavour to supply the deficiency in the following sections.\n\n53. The affixes attached to the case endings are always\nexpressed by the addition of one or two characters to those which express the noun. They are the following:\n\n1. s. \\( \\text{a} \\); instead of which we find more commonly after the second case \\( \\text{ya} \\), \"my.\"\n\n2. s.m. \\( \\text{ha} \\), and f. \\( \\text{ki} \\), \"thy.\"\n\n3. s.m. \\( \\text{su} \\), \"his,\" f. \\( \\text{sa} \\), \"her.\"\n\n1. p. \\( \\text{ni} \\), \"our.\"\n\n2. p.m. \\( \\text{ku.nu} \\); f. \\( \\text{ki.na} \\), \"your.\"\n\n3. p.m. \\( \\text{su.nu} \\) or \\( \\text{s'u.un} \\); f. \\( \\text{s'i.in} \\), \"their.\"\n\n\\( \\text{na} \\) is used for the affix of the 3. p. of both genders; it is interchanged with \\( \\text{s'u.un} \\), cf. 164 B. 23 and 165 B. 17; and with \\( \\text{s'i.in} \\), cf. 38 B. 69 and 46 B. 76.\n\n54. The affix of the 3 s.m. after an unaccented \\( u \\) is often shortened to \\( s \\); this happens most commonly after the feminine first case \\( tu \\); and the \\( tus \\) is then expressed by \\( \\text{uk} \\).\n\nOn the other hand, after an accented \\( u \\), an additional character is generally introduced after the first case, as it would be written without the affix. This character is \\( \\text{a} \\) or \\( \\text{a} \\) before \\( \\text{a} \\), the affix of the first person singular (which, however, is not to be read as an additional syllable) and before those of the second and third persons \\( \\text{uk} \\) and \\( \\text{us} \\) respectively. Before the affix of the first person plural I should from analogy expect \\( \\text{un} \\), but I have as yet met with no example of it.\n\n55. Although this reduplication, which may be compared with that of § 48, may be used after the \\( u \\) of the first case whenever it is not preceded by a \\( t \\), formative of the feminine; there are some words, after which it occurs, which should be particularly noticed. Such are the prepositions, \\( \\text{kirbu} \\), \"within,\" \\( \\text{ziru} \\), \"upon,\" and \\( \\text{panu} \\), \"before,\" which are used before pronominal affixes in place of the \\( \\text{kirib} \\), \\( \\text{zir} \\), and \\( \\text{pan} \\), which are used before nouns. Examples are \\( \\text{zi.r'u.u.a} \\), \"upon me,\" 41 I. 45; \\( \\text{pan.uk.ki} \\), \"before thee (f.),\" 66 II. 2. 7, 8; in a similar inscription addressed to Nebo, 85 L. 15, \\( \\text{pan.uk.ka} \\);\nk’i.ir.b’u.us.sa, “within it,” E. I. H. 10, 12; zi.r’u.us.su.un, “upon them,” 39 I. 78. Such also is the noun of non-existence yanu, whence ya.n’u.u:a, “I am not,” 42 II. 14 r.; and in the two preceding lines, ya.n’uk.ka, “thou art not,” ya.n’u.us.su, “he is not.” I may also notice ki.bi.t’u.uk.ka, “it is thy will” or “in pursuance of thy will,” E. I. H. 10, 1; ki.bi.tus.su, “in pursuance of his will,” 16 B. 141. The t of this word is radical. I think it is invariably used of the divine will, which was not to be resisted.\n\n56. The affixes annexed to the theme are the same as those annexed to the case endings, except for the first person singular; and for the third person in all its forms, when the theme ends in a dental or sibilant. In the last case, § is substituted for s in the affix; the preceding consonant being sometimes retained, sometimes omitted, but most frequently changed into another §. That is to say, the affixes of the third person given above can never follow 𒂗, 𒂗, 𒂗, 𒂗, 𒂗, 𒂗, 𒂗, 𒂗, or 𒂗; or any character, the value of which terminates with any of these; but after these letters 𒂗 is substituted for 𒂗, 𒂗 for 𒂗, and 𒂗 for 𒂗. Examples are hi.n’i.it.su, “its ditch,” E.I.H. 6. 60, or hi.r.i.su, 65, I. 2. 7, or hi.r’i.is.su, E.I.H. 6. 30. All these are used in parallel texts, and are evidently equivalent. The last of the three forms is, however, the commonest. Other examples are ru.pu.us.su, “its breadth,” from rupus, 7 I.F. 23; e.pi.su.un, “their work,” from epis, 132 B. 18. It is needless to multiply them, as they are everywhere to be met with. To the rule here laid down there are no exceptions; and the student, if he thinks that he sees it violated, may be quite sure that he is mistaken as to his reading of the text.\n\n57. The affix of the first person attached to a theme which ends in a consonant is generally i; sometimes a is substituted, but only, I believe, in Babylonian inscriptions. Examples are ‘a.ba, “my father,” E. I. H. 7, 48; b’i.e.la, “my lord,” 66 I. 18. This affix, whether i or a, is not represented by a separate character, but by a change of the last\ncharacter of the theme, which, with this affix, is the same as the second or third case. Examples are very numerous; but they appear to have been overlooked, or set down as mistakes, by others. I will give a very few out of a long list. In 151 B. 16, Sargon says, *ak.zu.ra* *us.m.a.ni*, “I prepared my camp.” Five lines after, speaking of his enemy, he says, *ik.zu.ra* *us.m’a.an.su*, “he prepared his camp.” These translations may be only approximate; but there can be no doubt as to the “I,” “my,” “he,” and “his.” Again, *b’i.in.ti* *ad.din.su*, 145 B. 18, is, “my daughter I gave to him;” *u.s’a.az.bil ra.ma.ni*, 49 I. 4, 11, is, “I caused myself to carry.” Both these texts are correct as they stand; and the emendations that have been proposed would render them the contrary. We have also *qa.ti* for “my hand,” 10 I. 98; *mu.ti*, “my husband, 10 II. 4 l., *as.sa.ti*, “my wife,” do. 10 l. This last is for *an.sa.ti*, the feminine theme of *an.is*, “a man,” from which I derive the plural *ni.si* mentioned in § 50. All these nouns occur with other affixes, *qa.as.su*, “his hand,” 49 B. 32, *m’u.uš.su*, “her husband, 10 II. 2 l.; and *as.sa.ti.su*, “to his wife,” do. 9 l.\n\n58. The use of *šu* for “her” in this ancient text must not be passed over. We have also *at.ta* for “thou (woman);” do. 10 l. This fragment of the ancient laws of Assyria is probably the oldest text in the language that we possess. The tablet, indeed, is not older than the seventh century B.C.; but it is a transcript of one of the highest antiquity. Now, it is very remarkable that, in the Hebrew Pentateuch, the masculine pronoun of the third person singular is often used for the feminine; that is to say, if we go by the written letters and neglect the Qeri and vowel points. The distinction between the pronouns of the second person, masculine, and feminine is also in several places only made in the vowel points. I think it is a fair inference from this, that in the earliest stage of the language “thou” and “thy,” masculine and feminine, had but one representative; and that “his” and “her” were expressed alike, as they were in Latin, and as they still are in the languages derived from it.\nGoldstucker.—Panini: His Place in Sanskrit Literature. An Investigation of some Literary and Chronological Questions which may be settled by a study of his Work. A separate impression of the Preface to the Facsimile of MS. No. 17 in the Library of Her Majesty's Home Government for India, which contains a portion of the Manava-Kalpa-Sutra, with the Commentary of Kumarila-Swamin. By Theodor Goldstucker. Imperial 8vo., pp. 268, cloth.\n\nGoldstucker.—A Compendious Sanskrit-English Dictionary, for the Use of those who intend to read the easier Works of Classical Sanskrit Literature. By Theodor Goldstucker. Small 4to., pp. 900, cloth. [In preparation.]\n\nGrammatography. A Manual of Reference to the Alphabets of Ancient and Modern Languages. Based on the German Compilation of F. Ballhorn. In one volume, royal 8vo., pp. 80, cloth. 7s. 6d.\n\nThe \"Grammatography\" is offered to the public as a compendious introduction to the reading of the most important ancient and modern languages. Simple in its design, it will be consulted with advantage by the philological student, the amateur linguist, the bookseller, the corrector of the press, and the diligent compositor.\n\nHaug.—Outline of a Grammar of the Zend Language. By Martin Haug, Dr. Phil. 8vo., pp. 82, sewed. 14s.\n\nHaug.—Essays on the Sacred Language, Writings, and Religion of the Parsees. By Martin Haug, Dr. Phil., Superintendent of Sanskrit Studies in the Poona College. 8vo., pp. 278, cloth. 21s.\n\nHaug.—The Aitareya Brahmanam of the Rig Veda: containing the Earliest Speculations of the Brahmans on the meaning of the Sacrificial Prayers, and on the Origin, Performance, and Sense of the Rites of the Vedic Religion. Edited, Translated, and Explained, by Martin Haug, Ph.D., Superintendent of Sanskrit Studies in the Poona College, etc., etc. In 2 Vols., or 8vo. Vol. I. Contents, Sanskrit Books, Preface, Introductory Essay, and a Map of the Sacrificial Compound Sacrifice. pp. 312. Vol. II., Translation, with Notes. pp. 54.\n\nHernisz.—A Guide to Conversation in the English Languages, for the Use of Americans and Chinese in California and elsewhere. By Stanislas Hernisz. Square 8vo., pp. 274, sewed. 4 days de 4 days\n\nThe Chinese characters contained in this work are from the collections of engraved on steel, and cast into moveable types, by Mr. Marcellin Legrand, etc., Imperial Printing Office at Paris. They are used by most of the Missions to China.\n\nHoffman.—Shopping Dialogues, in Japanese, Dutch, and English. By Professor J. Hoffman. Oblong 8vo., sewed. 3s.\n\nJusti.—Handbuch der Zendsprache van Ferdinand Justi. Altbaetrisches Waerterbuch. Grammar Chrestomathie. Four parts 4to. sewed, pp. xxii, and 424. Leipzig, 1864. 24s.\n\nKidd.—Catalogue of the Chinese Library of the Royal Asiatic Society. By the Rev. S. Kidd. 8vo., pp. 58, sewed. 1s.\n\nLegge.—The Chinese Classics. With a Translation, Critical and Exegetical, Notes, Prolegomena, and Copious Indexes. By James Legge, D.D., of the London Missionary Society. In Seven Vols. Vol. I., containing Confucian Analects, the Great Learning, and the Doctrine of the Mean. 8vo., pp. 526, cloth, price 2l. 2s. Vol. II., containing the Works of Mencius. 8vo., pp. 634, cloth, price 2l. 2s.\n\nManava-Kalpa-Sutra: being a portion of this ancient Work on Vaidik Rites, together with the Commentary of Kumarila-Swamin. A Facsimile of the MS. No. 17 in the Library of Her Majesty's Home Government for India. With a Preface by Theodor Goldstucker. Oblong folio, pp. 268 of letterpress and 121 leaves of facsimiles. Cloth. 4l. 4s.\n\nMedhurst.—Chinese Dialogues, Questions, and Familiar Sentences, literally rendered into English, with a view to promote commercial intercourse and assist beginners in the Language. By the late W. H. Medhurst, D.D. A new and enlarged edition. pp. 226. 8vo. 15s.\n\nMorley.—A Descriptive Catalogue of the Historical Manuscripts in the Arabic and Persian Languages preserved in the Library of the Royal Asiatic Society of Great Britain and Ireland. By William H. Morley, M.R.A.S., 8vo., pp. vii. and 160, sewed. London, 1854. 2s. 6d.\nMuir.—Ori of India, illustrated Vedie with 440, cloth\n\nRam Raz.—Native Ju Great Brit 1834. Ori\n\nRawlinson.—JUL 15 1944 and Assyrian brief Notice Asiatic Soc 1860.\n\nRawlinson.—Nineveh. Layard, Es\n\nRenan.—An Agricultur Shemitic Na P'Institut. 1\n\nVeda Sai Fifth to last 18 and from whi these nou 49 B. 32, \"to his 58cs of 1\n\nVishnu-Puran lated from the Puranas. By Notes, by Dr.\n\nWilson.—Work of the Royal A Germany, etc., and II.—Also Hindus, by the Dr. Reinhold.\n\nWilson.—Essays connected with Edited by Dr. R\n\nWilson.—The PH A Lecture delive fessor H. H. Wi LD 21-10m-5,'43 (6061s) London, 1852.\n\nWilson.—SELECT SPECIMENS of the THEATRE of the HINDUS, translated from the original Sanskrit. By Horace Hayman Wilson, M.A., F.R.S. Second Edition. 2 vols., 8vo, pp. lxx. and 384, 415, cloth.\n\nWise.—COMMENTARY on the HINDU SYSTEM of MEDICINE. By T. A. Wise, M.D., Bengal Medical Service. 8vo., pp. xx., and 432, cloth.\n\nLONDON: TRÜBNER & CO., 60, PATERNOSTER ROW.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/specimenchapters00hincrich_bw.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 48, "total-input-tokens": 64638, "total-output-tokens": 27636, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 167, 3], [167, 1830, 4], [1830, 3655, 5], [3655, 5913, 6], [5913, 8073, 7], [8073, 10266, 8], [10266, 12331, 9], [12331, 14548, 10], [14548, 16775, 11], [16775, 18783, 12], [18783, 21255, 13], [21255, 23467, 14], [23467, 25784, 15], [25784, 28088, 16], [28088, 30408, 17], [30408, 32657, 18], [32657, 34979, 19], [34979, 37205, 20], [37205, 39557, 21], [39557, 41675, 22], [41675, 43876, 23], [43876, 46057, 24], [46057, 48262, 25], [48262, 50786, 26], [50786, 53094, 27], [53094, 55085, 28], [55085, 57148, 29], [57148, 59391, 30], [59391, 61435, 31], [61435, 63753, 32], [63753, 65773, 33], [65773, 67777, 34], [67777, 70105, 35], [70105, 72228, 36], [72228, 74237, 37], [74237, 76425, 38], [76425, 78592, 39], [78592, 80848, 40], [80848, 82930, 41], [82930, 85152, 42], [85152, 87264, 43], [87264, 89453, 44], [89453, 93525, 45], [93525, 94486, 46], [94486, 94486, 47], [94486, 94486, 48]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]