[{"id": "aadfba8a4627b544a8d3c5d804a7432e4e4c7110", "text": "THE WAI SENG LOTTERY\n\nBY\n\nG. T. HARE\n\nCivil Service, Straits Settlements\n\nSINGAPORE\n\nPRINTED AT THE GOVERNMENT PRINTING OFFICE\n\n1895\nTHE WAI SENG LOTTERY\n\nBY\n\nG. T. HARE\n\nCivil Service, Straits Settlements\n\nSINGAPORE\nPRINTED AT THE GOVERNMENT PRINTING OFFICE\n1895\nPREFACE.\n\nAs not a few readers in the Straits Settlements have wished to learn something about the celebrated Wai Seng Lottery of Canton, and as no one else seems inclined to explain it, I have ventured to write a few lines on the subject during the leisure hours of vacation leave. My only excuse for taking it upon myself to do this, was that there is, as far as I know, no other printed work extant, easy of access and reference, that deals with this question. However imperfect, therefore, the following lines may be, they are at least the first in the field, and may prove useful as a guide to some Government Officers and of some little interest to the general reader. I wish to add that I am indebted to Messrs. Litton and Saunders of the Civil Service of the Straits Settlements resident in the City of Canton, for some information with reference to the Wai Seng Lottery as carried on in the Canton Province.\n\nG. T. HARE.\n\nCanton, April, 1894.\n闍姓\nTHE WAI SENG LOTTERY\nBY\nG. T. HARE,\nCivil Service, Straits Settlements.\n\nCHAPTER I.\n\nHISTORY OF THE WAI SENG LOTTERY IN THE CANTON PROVINCE.\n\nWhen enquiry goes below the surface in China, there is nothing more difficult to get at than facts, and investigation of any particular subject is often carried on in the teeth of systematic attempts at evasion or perversion of the truth. It is only after much enquiry, comparison and sifting that I have ventured to accept any information about the origin and history of the Wai Seng Lottery. The early history of the Wai Seng Lottery is hard to trace. It is said to have originated in the city of Canton about the time of the reign of the Emperor TO KWONG (道光) (from 1821-1851), and to have sprung, in the first place, from a kind of private sweepstakes, held occasionally by some classes of students in the large college in the city, on the names of their friends and other fellow-students who went up for examination at the Civil Competitive Examination in the provincial capital of Canton. In these literary sweepstakes, the names of the competitors\nwere all written on separate pieces of paper, and drawn for on the eve of the examination. A few cents (at most half a dollar) was put into the pool by each drawer, and every sharer in the sweepstake that drew a successful candidate got a share of the pool. This seems to have been the origin of the Wai Seng Lottery in its present form. It was not, however, till the reign of the Empress HAM FUNG (咸豐) (1851-1862) that this system of private sweepstakes developed into a public lottery. It seems to have been developed and extended in the first place by certain proprietors of another kind of lottery called the White Pigeon Lottery or Pak Kop Piu (白鴿標). This is a very old Cantonese lottery that is said to have been in existence for over two hundred years, and the principle of the game is guessing most of the winning characters that are declared by the lottery manager out of certain 80 characters taken from a Chinese classic.\n\nAs the idea of the Wai Seng Lottery is much the same (that is, selecting or guessing the characters of the surnames of candidates successful at the Government competitive examination), it is not unlikely that those interested in the White Pigeon Lottery saw in these early private sweepstakes on the names of successful candidates the means of creating a new form of lottery, which was sure, from its connection with the public examinations, to become immensely popular and very lucrative. However this may be, there can be no question that, by the end of the reign of HAM FUNG, the Wai Seng Lottery was firmly established as a working organisation in Canton, but it does not seem at that time to have extended beyond the city. At the beginning of the reign of TUNG CHI (同治) (about 1870), the Wai Seng Lottery had gained a firm footing and dominated all other forms of lotteries in importance and value. It was at the beginning of this reign, too, that the lottery first attracted the serious attention of the Government. Vigorous efforts were made to suppress it, and finally the owners of the lotteries moved away to the Portuguese territories of Macao, and began to work from this new basis of operations. As Macao is only\nhalf a day's journey from Canton, it was possible to carry on the same business with Canton there with impunity. The Wai Seng owners were, however, prosecuted by the Macao Government and compelled to come to terms. The result of the treaty that followed was the establishment of the first Wai Seng Lottery farm in Macao. The agreement was that the new Wai Seng farm should pay three million dollars for a lease of six years to the Portuguese Government. The Cantonese authorities were thus checkmated, and the lottery was carried on in Canton from Macao just as before, till the thirteenth year of the reign of the Emperor Tung Chi (1875). At that time the Viceroy of the Two Kwongs, Ying Hon (英翰), determined to put an end to the lottery. In spite of his efforts, however, it was still carried on, and finally the Viceroy, finding that he could not suppress it, decided to come to terms with the lottery owners (who were, of course, all Cantonese subjects), and control it instead. With this object in view, he addressed the Government in Peking on the subject, pointing out how the Portuguese Government was making a large revenue out of the people of the Canton Province, and asking for the sanction of the Government to recognize and farm the lottery in Canton under the name of the Tsun Yik Ui (進益會), or Society for the Advancement of Progress. The proposed Canton farm, however, fell through. The political opponents of the Viceroy in the capital seized on this memorial and made it a ground for attacking him and accusing him of maladministration of provincial affairs, and finally, after some delay, the Viceroy Ying Hon was degraded and removed from the Canton Province. The negotiations for a Canton Wai Seng farm, therefore, fell through, and the successor of Ying Hon, a Viceroy called Lau Kwan Yat (劉坤一), did everything he could to stamp out the lottery in Canton, but with not much more success than his predecessor. Things went on pretty much the same as before, till the arrival of the next Viceroy Cheung Chi Tung (張之洞). This famous scholar and statesman also did all he could to suppress the lottery, but finding that this was impossible, he determined\nto obtain the sanction of the Chinese Government to a Wai Seng farm in Canton. Remembering, however, the fate which befell the former Viceroy YING HON, who had been degraded from office for recommending this step, the Viceroy CHENG CHI FUNG set to work in a more diplomatic way. Before publicly addressing the throne in a memorial on the subject, he wrote a long private memorandum on the question, and sent it to the CH’Ü MAT (樞密), or Privy Council in Peking, for consideration and remarks. This memorandum was strictly private, but I am informed that it reiterated most of the statements made by the Viceroy YING HON. Briefly these were, that owing to the love of the Cantonese for this literary lottery and the passive obstruction and unwillingness to help on the part of the trading and well-to-do classes who habitually bought their tickets at Macao, the Canton Provincial Government found it impossible to suppress this form of gambling; that at the same time a foreign Government, i.e., the Portuguese, were deriving great benefits from the action of the Canton Government, and that the people of Canton were losing their moneys in enormous sums, without any compensating advantage, to the Portuguese, and that as the Macao Government would not give up the Wai Seng farm in Macao, things would grow worse in time, and the evil grow to greater proportions than it would were it under control. The Viceroy CHEUNG CHI TUNG was given to understand that a memorial recommending the establishment of a Wai Seng farm in Canton would be favourably received, and accordingly he memorialised the throne to that effect. The memorial in question reiterates the points mentioned above at great length, and concludes with a proposition (one of those delightful compromises for saving “face” for which the Chinese are so renowned) that, as it is found impossible to suppress the lottery, the guilty owners be allowed in future to come forward, and, on condition of being heavily fined every year for their crime in carrying on such an illegal affair, be permitted to establish the lottery in the city of Canton. It is for this reason that the Canton Government refuses in name to recognize the system as a farm, and calls it an organisation for the limitation and arrest of the Wai\nSeng Lottery or Tsit Ts'ap Ui (截緝會). As mentioned above, the result was a foregone conclusion, the memorial was favourably received, and the required sanction given. The Viceroy CHEUNG CHI TUNG then called a meeting of certain of the Cantonese traders, who were said to be carrying on the lottery in Macao, and asked them to start a farm in Canton. These traders declined, and others were asked to undertake the business. After nearly a year's delay, a syndicate was formed and a lease to carry on the Wai Seng Lottery for six years was sanctioned. This syndicate carried on the business in Canton for about four years, but found it impossible, in the face of the opposition from the Wai Seng farm in Macao, to pay the Government revenue and make both ends meet. The first syndicate was, therefore, with the consent of the Government, dissolved. Before letting another lease, the present Viceroy of the Two Kwongs LI HON CHEUNG (李翰章) induced the Cantonese traders who were the owners of the Wai Seng farm in Macao to come to terms and contract to run the Canton and Macao farms together. His efforts were successful, and the farm in Macao and Canton are now owned by partners in one common syndicate. It is this syndicate that is carrying on the Wai Seng business now in Canton and Macao.\n\nCHAPTER II.\n\nGENERAL.\n\n\"Wai Seng\"* (賭姓), or literally the surnames of the Examination Hall, is the name of a lottery peculiar to the Province of Canton. The gambling element in the lottery consists in guessing the surnames of the successful competitors at the three great examinations held by the Chinese Govern-\n\n* The Cantonese pronunciation of Chinese words is given in this pamphlet.\nment for the Civil and Military first, second and third degrees. It is impossible to understand fully what a Wai Seng Lottery is or make clear to the general public what a burning and absorbing interest it has for the Chinaman, without first explaining the system of the Civil and Military examinations, on the results of which this famous lottery turns. The enthusiasm roused by these Civil and Military competitive examinations is felt just as keenly by the Chinese in the Indian Archipelago as in China proper. Distance and time cannot lessen it. Foreign scenes and new ideas do not supplant it. It is, in spite of abuses, the one solid unchanging element in the Chinese economy that every Chinaman instinctively learns to pin his faith to. The local interest aroused by these examinations in China is immense, and the success or failure of relations and friends at these examinations is eagerly looked forward to. High honours in the examination lists reflect credit on, and ennobles a family, a village, a town or a province, and is sure to open an avenue to success in life. To have produced scholars who pass first on the examination lists in the metropolis is a lasting honour to the birth-place and family of the fortunate competitors. However much there may be to find fault with in other matters in China, this system, at any rate in theory, can only evoke admiration and wonder. It is founded on a solid rock, on a principle that experience has shewn cannot well be bettered. It opens, without distinction of persons, a career of usefulness in the public service to all men of real ability and industry. It creates an aristocracy of talent which there has never been anything like before in history. It is an admirable means for promoting and preserving the study of a difficult language; it is a perpetual source of encouragement to all real students, and a stimulus and sedative to restless and ambitious spirits. Changing dynasties and alien Emperors have never ventured to tamper with it. For nearly two thousand years it has been held sacred by subject and prince. It is the great conservative feature in Chinese policy that has done more than anything else to mould the better characteristics of the Chinese race and consolidate the empire. Remembering this, it is not diffi-\ncult to see how this competitive system has, century after cen-\ntury, increased in importance and interest for the Chinese.\nAlthough the Canton Province does not rank first as the mo-\nther of scholars and statesmen, there is perhaps no province\nin which more universal interest is taken in success at the\npublic examinations, or in which more honour and name is\nearned on taking a degree. This is perhaps chiefly due to the\nimmense population and great wealth of the province. The\nnumber of competitors at the various examinations in the Can-\nton Province is larger than in other places. This is undoubt-\nedly due to the greater wealth of the Cantonese in the towns\nand especially in the country, to the common funds or ances-\ntral property which is drawn on by competitors with the ap-\nproval of the elders of the clan to defray expenses connected\nwith examinations and preparation for them. Another feature\nin the Canton Province is that the majority of merchants who\nmake money always have at least one or two of their sons\ntrained for entering at the public Examinations with a view to\ngetting an official status for the family. There is perhaps no\nother province where there is a larger number of well-to-do\nreading men than in Canton. This general desire to get\nan official status in the family in Canton is probably due to the\nfact that the province being so wealthy is over-run with a larger\nnumber of expectant officials and other officers than elsewhere,\nand that this has given a strong official tone to Canton\nsociety in general and led to a general desire among the\nmercantile classes to be on a footing of some equality in one\nway or another with the officials. At any rate, for one reason\nand another, the interest taken by the Chinese in these public\ncompetitive examinations is keener and more general in the\nCanton Province than elsewhere. It is on the keen and enthu-\nsiastic interest taken in the competitive examination that the\nWai Seng Lottery is based, and in order to thoroughly under-\nstand it, it is necessary to have some knowledge of the gene-\nral principles and details of the various examinations. With-\nout this knowledge it is difficult to understand many points\nconnected with the Wai Seng Lottery and the way in which\nmalpractices and abuses come in. At the risk of being found\ntedious, it is, I am afraid, unfortunately necessary for the general reader, in order to understand the Wai Seng Lottery, to first glance at the following skeleton sketch of the Chinese system of competitive examinations. Students of Chinese will not find anything new in this outline, and are recommended to skip it.\n\nThe Chinese Competitive Examination System.\n\nThis all important system furnishes a passport for successful candidates at the Civil and Military examination to admission into the public service of the country.\n\nThe competitive examination system was first introduced in the Han dynasty, about 2,000 years ago, and has been carried on up to the present day without much change or alteration. There are four competitive examinations in chief—two held in the provinces, and two held in the metropolis, Peking. Each examination follows the other in gradation, and it will be best to notice them in order, beginning from the examination that stands first in the gradation, but lowest in order of merit.\n\nThe District Examination, or To Shi (道試).\n\nThis examination takes place every second year in every district (a territorial sub-division) of the province. The degree given at this examination is called the Sau Tsoi (秀才), or B. A. or Licentiate degree. This examination is conducted by the Literary Chancellor of the Province, and degrees are conferred by him. This official has his office in the provincial capital, but every second year proceeds to the prefectural capitals and holds an examination for the students in the districts forming the territorial division of the prefecture. As it is the custom that the Literary Chancellor be boarded and lodged by the subordinate officials who receive him, he usually manages to extend his tour in the country over his three years of office, and live upon other people. His travelling expenses are, in accordance with Chinese custom, furnished by the various officials along his route. The Literary Chancellors, or Director of Education as they are sometimes called, are always men of ability, usually graduates of the Hon Lam Academy in\nPeking. Before presenting himself for this district examination, a student has to pass two preliminary examinations before the District Magistrate and Prefect of the territorial sub-division he lives in. If successful at these two preliminaries, the student can enter for the district examination before the Director of Education, and if successful at this third examination is entitled to compete at the provincial or triennial examination—the examination which comes next in order of merit. The number of candidates who go up for the district examination is numbered by thousands, and the number of degrees given to students in each district not more than from 20 to 50. Naturally the competition is very keen, and the chances of success very small. The public who stake on the results of these various competitive examinations, do not buy many tickets for the district examination in the Canton Province. There is a general feeling that the class list is too much likely to be unduly tampered with. There is very little confidence felt in the Literary Chancellor, or, more especially, in his subordinates. The Wai Seng offices do not do one quarter so big a business over these district examinations as over the others. The taking of this first degree, Sau Tsoi, does not lead directly to employment in the public service, but may (if the holder of it gets no other degree) ultimately lead to his getting some small office in his district in connection with the control and registration of the students who go up for the examination and with the superintendence of the Confucian temples. As a matter of rank, a scholar of the first degree is re-ipsa an official, and becomes entitled to certain small privileges in his intercourse with officials holding substantive appointments, and he cannot be subjected to Corporal punishment without first having his degree taken away from him at the recommendation of the Literary Chancellor.\n\n2. The Provincial Examination, or Heung Shi (鄉試).\n\nThe competitive examination is held in the 8th moon of every third year in the provincial capital. In the Canton Province, this examination, of course, takes place in the city of Canton. Only graduates of the first degree can enter for it.\nThe examination is held by a Commissioner specially appointed in Peking from amongst men of high literary rank called the Grand Examiner or Chu Hau (主考), assisted by an Assistant Examiner or Fu Hau (副考) and thirteen other scholars selected locally from among the District Magistrates and expectant district office officials. These thirteen scholars, or Shap Sam Fong (十三房), although they come from other Provinces are local men with local interests and are very liable to be tampered with. This examination is even more keenly contested than the first. Some 8,000 to 10,000 competitors often enter at Canton, and there are only 88 in the Canton Province that can be admitted to degrees. The degree given at this examination is called the Kü Yan (舉人), or M. A. or Provincial Graduate degree. This degree is almost sure to bring some substantive reward in time, as at the worst a Kü Yan can always command a good position as a teacher or private coach, and a few of them, if they have money and influence, get small appointments in the provinces or at the metropolis. This provincial examination is very popular with the Wai Seng staking public, and as much business is done over it as over any other examination. Nearly 3,000 Wai Seng stakebooks (i.e., 3,000 separate lotteries, each book containing 1,000 stakes) have been known to have been made up over one of these examinations.\n\n3. The Metropolitan Examination, or Ui Ski (會試).\n\nThe Kü Yan or M. A. who is successful at the provincial examinations in the autumn proceeds direct to Peking in the spring of the next year to enter at the third examination. These metropolitan examinations are held triennially, and some 5,000 or 6,000 Ku Yans or M. A.'s from all the eighteen Provinces of China assemble at Peking to compete. There are only some three hundred degrees that can be given. Each province has a limited number granted to it. This is an innovation of the present Tartar dynasty. Formerly the Kü Yan from all the provinces competed against one another. The degree obtained by passing this examination is called Tsun-Tsz (進士). There are only 16 degrees allotted to the\nProvince of Canton. The Wai Seng Lottery has nothing to do with graduates in other provinces, and is, of course, only concerned with the result of the examination of those Kü Yan or M. A's. who belong to the Canton Province. With the examinations at the Palace that follows the Tsun-Tsz examination, the Wai Seng Lottery is not concerned. The chief difficulty of the staking public as regards this Ui Shi examination, is that it takes place a long way off, and that it is often hard to find out who has \"scratched\" for the examination, or started intending to compete and turned back without going to Peking at all. As it is always open to such graduates to go up a second time, stakers are often disappointed by finding that the men whose surnames they have backed have not entered for the examination at all. There are, however, now, regular agencies in Peking who telegraph information to Canton and to Singapore stating what graduates have arrived and who have \"scratched\" and whose names are being generally supported, and so on. The successful Tsun-Tsz, after passing another examination, are either elected members of the Hon Lam Academy, or presented to various minor posts in the Government service. If they are made members of the Academy, they usually remain in Peking and serve on one of the Government Boards till they obtain some substantive office either in Peking or in the provinces. In addition to the regular examinations held every three years in the province and capital, occasionally extra Civil and Military examinations are held in honour of some public auspicious event; such extra triennial examinations are called examinations held by Imperial grace, Yan Shi (恩試) or Yan Fo (恩科).\n\nThe Military examinations are held very much like the Civil ones. In the Civil ones the subjects set for examination are the five Chinese classics and the four books with composition in prose and poetry. In the Military ones degrees are given for excellence in feats of strength and Military gymnastics. The Military examinations are held by the Governor of the Province or by officers appointed by him. On the whole the Military examinations are said to be fairly well conducted. The Wai Seng staking public, too, can go to the drill\ngrounds and judge for themselves of the merit of the Military competitors. Some of the Wai Seng officers and heavy Wai Seng stakers have regular touts in their employ, who make a business of habitually frequenting the guard-houses and drill grounds to report on the prowess of competitors.\n\nIt is on guessing correctly the surnames of the successful graduates at these three Civil and Military competitive examinations that the Wai Seng Lottery turns, and it was absolutely necessary to notice the system before considering the lottery itself.\n\nCHAPTER III.\n\nEXPLANATION OF THE METHOD OF BUYING WAI SENG TICKETS.\n\nAs stated in the introductory remarks, the gambling element in this lottery consists in guessing correctly the largest number of the surnames of successful candidates in the various Civil and Military competitive examinations described in the previous pages. That is the general principle of the lottery. It is now necessary to explain the system in detail. For the sake of clearness, let us suppose that a certain man proposes to buy a one-dollar ticket in a lottery held either on the first, second or third examination for Civil or Military degrees. Let us further presume that he has never bought a Wai Seng ticket before, and proposes to learn the modus operandi in full. Suppose, then, for example, he determines to buy a one-dollar ticket on the second or provincial examination held at Canton every third year for the Kü Yan or Civil M. A. degree. There are ten offices in the city of Canton where he can buy tickets. He goes to one of them and gets a flying sheet or advertisement called a Kai Chiu (街招), which sets forth the conditions on which the lottery is held. (See Papers I, III, IV, V.) He knows that the general principle of the lottery is that the prizes are won by guessing the largest number of surnames of competitors who pass at the Government examination. He has first to ascertain what surnames he is allowed by the rules of the game to select, and then he finds out which are the best surnames to choose out of\nthose not tabooed by the conditions of the lottery. Let us see what surmanes the staker cannot select; these are:\n\n1.—Common surmanes such as Chân (陳), Li (李), Ho (何), Wong (黃), &c. Of these common surnames, a large number is barred by all the ten Wai Seng offices—some barring more, some barring less. The number of common surnames barred, too, depends on the nature of the examination and the number of competitors who go up to be examined, thus in the lottery held on the Ui Shi examination in Peking, when only 16 degrees are given to the Canton Province, and the number of competitors very small, no surnames are barred. In the Provincial first and second examinations it is absolutely necessary to bar some surnames, or the lottery would be impossible, thus for the B. A. and M. A. degrees there are always a number of competitors, ranging from some 3,000 up to 10,000, examined on each occasion. Amongst a large number like this, the common surnames, of course, occur very frequently like the inevitable Jones, Smith, Robinson in English; if therefore all the stakers selected these common surnames (as they certainly would, because there would be sure to be some successful competitors of these surnames amongst so large a number of men) in large number, the lottery would, in most cases, become impossible. Every one would select the same common surnames and have a very fair chance of a prize, and as there are only three prizes in a Wai Seng book, the three prizes divided up between so many stakers (a thousand in every book) would not be worth having. Accordingly, before every examination is held, the Wai Seng offices publish a list of the barred surnames. In Paper I it will be seen that 69 surnames are barred, in Paper III that 66 surnames are barred, and so on.\n\n2.—The surnames of Manchoos and Bannermen are barred. These names are barred chiefly because the number of competitors is very small and the number of degrees given them very limited. The stakers could, with very little enquiry, easily find out the surnames of those who are likely to succeed, and this would make the guessing of the surnames too easy.\n3.—Surnames of which the Chinese characters are written in a closely similar manner are often objected to and barred by some firms, because of the trouble that is often made by unscrupulous stakers who try to extort money from the offices on the grounds that the characters have been wilfully written and printed wrongly.\n\n4.—In the second provincial and third metropolitan degrees, the surnames of the candidates who receive the second or third degree by Imperial decree are barred. This is only fair, as the general public cannot learn who are going to receive such honours, and the few who did know it would have an unfair advantage over the others, as they would, of course, select the surnames of those who were going to get a degree honoris causa so to speak.\n\n5.—In the third or metropolitan examination, the surnames of Kü Yans or M. A's. who have gone up for this examination in the previous year and scratched and are now going up again are barred. This is only just because the public would not otherwise know correctly what M. A's. or Kü Yans are going to compete or not. In this examination only the surnames of M. A's. who have applied at the Provincial Treasury for sanction to proceed to Peking for the examination are staked on.\n\n6.—In all examinations the surnames of candidates about whom there is any dispute or objection raised after the examination, are barred. Such cases take some time to settle, and if the objection is quashed and the candidate subsequently admitted, his surname is not reckoned. These cases do not usually occur till after the examination is over, and as it is the same for all who have bought the surname of a competitor objected to, there is no injustice about this provision.\n\nThe staker now knows what surnames he cannot select. All the other surnames are not barred, and he can choose 20 of them at will. In the third or metropolitan examination, as there are only 16 degrees given to M. A's. or Kü Yans from the Canton Province, he can only select 16 surnames. To assist him in doing this there is abundant information at hand. In the first place, the Wai Seng offices find out by means\nof their agents the surnames of the students or graduates who are going to compete, and publish lists of these or of the large majority of them for the information of the public. (See Papers III, IV, V.) Further lists shewing the number of times various surnames have already been bought by the public in one particular book of 1,000 selections of 16 or 20 surnames are published, directly after the first two or three Wai Seng books have been made up. (See Paper XIII.) In addition to this, a large number of books are printed giving information in detail about what position on the class list students and graduates have taken before in previous examinations with a view to the public being able to gauge their chances of success at the examination they are about to enter for. Any one who has read the short note on the examination system in Chapter II will see, by looking at the Wai Seng guides marked A, B, C, D, E, F, G, how one can trace, so to speak, the performances of a winner, or, in other words, his position in other examinations on the class lists. Thus, for instance, if I see from a Wai Seng guide that Chân Wo (陳和) was first on the list for the first degree, and find him going up the year after for the second degree, I should certainly select his surname, as he would be almost certain to pass. These Wai Seng guides are like guides to the turfs that give the previous performances of the horses. In actually selecting his 20 surnames, our friend is guided by his own knowledge of the abilities and prospects of the intending competitors and by the information or Hong Ts'ing (行情) of his friends and others, who profess to have special \"tips\" to give about the examination for the second degree we have supposed our friend is going to stake on. Very often the Wai Seng offices (when trade is very brisk) publish flying sheets made up to date, shewing how many times each surname has been bought (See Paper ). The staker has next to decide which particular firm, out of the ten, he will honour with his custom. He will probably elect to buy his ticket in an office that he knows something about or in which he has acquaintances or is otherwise directly or indirectly connected with. In Canton, there is very little to choose between the va-\nrious shops. The conditions under which the lottery is held are about the same in each case. Perhaps one or two offices will not bar so many surnames as the other, and make the guessing of the surnames easier. If our staker does not know anything about the offices or anyone in them, he will most probably go to the biggest. In the Straits, there is much more competition for business between the various Wai Seng firms, and in order to get more business some of them offer bonuses for the higher priced Wai Seng stakes. (See Paper IV.) After the staker has decided on the office with which he is going to deal, he next makes up his mind as to how he will buy his $1 ticket. He can buy his ticket on credit if he knows an agent of the office who will trust him, or he can go in person to the office and buy his ticket over the counter. If he buys his ticket on credit, he must pay up his $1 to the agent directly the Wai Seng book is made up. If he fails to do that, the agent will, of course, not pay his $1 into the Wai Seng office account, and if the staker wins a prize, it is not paid him, and the unfortunate agent who trusted our friend has to make good his dollar. Let us suppose, however, on this case that the staker pays his money down. He has written out the 20 surnames he proposes to put his money on, and takes them to the Wai Seng office, pays his $1 to the shroff, and hands in his surnames to the chief clerk. The clerk has a manuscript book before him divided into a thousand columns, into one of which columns he copies the 20 surnames selected. It is now necessary to first explain that in all examinations, Wai Seng stake books consist of one thousand columns of 20 or 16 different strings of surnames selected by the backers. First, the Wai Seng stake book itself has a serial number to settle its place in the series of the many Wai Seng stake books of 1,000 columns of characters that are made up, and, secondly, over the head of every column of 16 or 20 surnames (1,000 columns in all) is written another serial number called the Tsz Kwai (字軌) as an index to the position of any one particular column among the 1,000 columns of these strings of surnames. Instead of using numerals to catalogue the series of different books and the columns of charac-\nters on them, the Chinese characters of a certain classic called\nthe 1,000 Character Classic, (the Ts'in Tsz Man 千字文),\nare used. The clerk now informs the staker that he is mak-\ning up the Wai Seng book, or Kün (卷), numbered Lu (驢)\nin the book series and he has sold 495 tickets. Our friend\ntherefore gets ticket 496 given him. The character used for\n496 in the Millenary Classic is Heng (卿), so he has now got\na ticket numbered Heng (or 496) in the Wai Seng stake book\ncatalogued Lu (驢). (See Paper VIII.) The clerk now pro-\nduces a ticket (see translation of it, Paper VIII) called a Piu\nKan (票根) on which the character Heng (i.e., ticket num-\nber 496) and the serial number of the book, i.e., Lu, is writ-\nten. On this ticket he writes the name of the staker in such\nway as the staker pleases, usually a nickname is given or the\nstaker's name is abbreviated. In the Straits, fictitious names\nare invariably given. He then writes the name given by the\nstaker into the corresponding column in his 1,000 column\nmanuscript Wai Seng stake book. He then places the ticket\nexactly along column Heng (i.e., column 496) and stamps\nit and the manuscript book (when the staker's 20 surnames\nare copied in) together. He further takes the list of surnames\nbrought by the staker and the ticket, and placing them side by\nside also chops them together, and then files the former. If\nready money is paid then a further chop to that effect is im-\npressed; were the ticket on credit there would be a chop to\nthat effect on it. This system of double chops is adopted to\nprevent forgery. Our friend is then informed that the Wai\nSeng stake book, or Kün Hau (卷口), will be issued 3 days\nafter the 1,000 columns have been filled up, i.e., after 1,000\nlists of 20 surnames have been handed in by stakers. This\nKün Hau, or series book numbered Lu, is merely a reprint of the\ncharacters in the manuscript book kept by the clerk with\n1,000 columns in it, with the 1,000 lists of 20 surnames se-\nlected by the stakers printed in full. In Canton, when a Wai\nSeng ticket is bought the staker is furnished by the Wai Seng\noffice with an order called a Ho Tan (號單) (See Paper XIV),\non presentation of which he is entitled to a Wai Seng stake book free of charge. On the Ho Tan he receives is written the number of his stake book in the series of stake books being issued and the style of the firm he has bought his ticket from. In the Straits, no such Ho Tan is issued. In Canton, stakers go to the Wai Seng office to get the book when it is printed; in the Straits, this Wai Seng stake book Kün Po (卷部) or Kün Hau (卷口) is brought round by the agents of the firms. On opening this book catalogued Lu, by turning to the 496th column in it numbered Heng, we see the 20 surnames selected by the staker. The position of the staker is now this. He is in a separate lottery, holding one of a thousand tickets, each usually but not necessarily consisting of a different combination of 20 surnames. If our friend's ticket contains a larger number of surnames of men who are successful at the examination than any other in the series he takes the first prize, or Shau Pin (首票). The staker, therefore, has now to wait till the list of the successful candidates is issued. When that happens, he takes his Wai Seng Kün (catalogued Lu in the series of books) to see how many of the surnames selected by him have passed. If no one has more surnames than he has (which he can also tell by looking through the 1,000 columns of the combination of surnames selected by the rest) then he knows he has got the first prize. Suppose, however, that he has 17 successful surnames and that another staker has also 17 successful surnames; in this case he has either to divide the first prize with the other or he may yet win if he has a larger number of successful passes (not surnames) than the other, e.g., suppose that 16 of the surnames of both stakers are the same but that the 17th character or surname is, in our friend's case, say Mui (梅) and in the other's case Man (文); if in our friend's case there are two more of the surname Mui (梅) who passed and in the other's case only one man of the surname Man (文) who passed, then our friend still gets the first prize, because he has one more pass than the other, i.e., our friend has got 18 passes in all, while the other has only 17 passes in all.\nFurther Details as to the Method of the Wai Seng Lottery.\n\nThe above illustration of how a staker sets about buying a ticket has been kept separate from other considerations for the sake of clearness. It is now necessary to supplement this to shew how the staker stands in regard to the lottery as a whole. The prices usually paid for Wai Seng tickets are 50 cents, $1, $2, $3, $5, $10 and $20. Now our friend who bought a $1 ticket has nothing to do with the tickets sold at these other prices, and those who buy tickets at those prices too have nothing to do with the $1 ticket. Those who buy dollar tickets are in a separate class by themselves. As in the case of the $1 tickets, as explained above, all the tickets sold at the other prices are made up into books of 1,000 tickets each. The various priced books are each catalogued with Chinese characters to shew their position in the book series, and every column of 1,000 strings of surnames selected by backers is also numbered with a character to shew the place of any one particular column in the Kün (卷) or Wai Seng stake book. If our friend, for instance, had bought a $10 ticket as well as a $1 ticket, his list of surnames would be put into the $10 book series, an entirely separate lottery that has nothing to do with the lottery held on the $1 series. If our staker bought another $1 ticket and selected a different combination of surnames, he may or may not have another ticket in the same book. If he bought another $1 ticket with the same combination of surnames as that already bought, of course his ticket would be placed in another of the $1 book series, to give him a further chance of winning a prize in another $1 book series. It is on the number of the books of ticket of these various prices that the amount of business of a Wai Seng office depends. Thus we see from Paper VI that in the examination on which we have supposed our friend to buy a $1 ticket, there were 185 $1 books of 1,000 columns made up, or, in other words, there were 185 separate lotteries held in the $1 price class. The extent of the business of an office depends largely on its stability and capital, and the reputation of the firm, and on its relations with trading and literary classes in general. In buying the $1 ticket our friend found that the Wai Seng office in its\nrules (see Paper I, translation of them) requires him to observe certain conditions and further undertakes on its part to look after the interest of the staker fairly. Thus in the first place the office does not allow him to stake on certain surnames. Of the 20 surnames selected from the rest, if our friend by mistake writes less than twenty or if he repeats a surname twice, or give any of the surnames that are barred, he has only himself to blame. He cannot get the list of 20 surnames back and correct his mistake. If a man has a surname composed of two characters (i.e., a double surname) the staker must count the first character only of the two characters. The staker must be careful to preserve his ticket, or Piu Kan (票根), intact. If it is broken or the chop defaced or torn, the office will not pay prizes on its presentation. If the ticket should be lost by the staker, he gets nothing even if he is winner of the first prize. If our staker is a bad penman and writes any of his 20 surnames unintelligibly or erases some and writes others and so confuses the list, he may find that they are printed incorrectly. The office will not be responsible for any mistake arising out of this. On the other hand, the Wai Seng firm has certain duties to perform towards our staker. The Wai Seng office itself does not print and bind the Wai Seng stake books. This may lead to mistakes. When a manuscript book of 1,000 stakes is completed in the Wai Seng office, a copy of it is made and sent to the printers, when printed and revised by the printer, it is brought back and again revised in the Wai Seng office by comparison with the original manuscript of 1,000 columns. In spite of the careful revision, mistakes will occasionally be made and the staker must keep his eyes open to see that his 20 surnames are printed correctly in full, and that they are bound up and placed in the proper serial book under the proper index ticket number. If the Wai Seng firm were by any chance to mislay our friend's list of surnames, it is bound to substitute another list of surnames likely to be successful and give it to him in place of his original list. Our staker would, in this most improbable event arising, be sure to insist on having a very good list of new surnames given him. After a book is closed (i.e., after 1,000 stakes have been\nbought,) the Wai Seng office fixes 5 days or 3 days as the time to be occupied in printing. After this is done, the public go and get their Wai Seng stake book, and it is then that all the possible errors referred to at such length in the rules (see Paper I) are, if any occur, to be reported to the Wai Seng office. If our friend had waited till the last moment before he bought his $1 ticket, he may find himself placed in an incomplete Wai Seng stake book. The stake books made up last often contain only 700 or 800 stakes (instead of the full 1,000) as it is often then too late to sell any more tickets or the public may not want to buy more. If our friend finds himself placed in such a stake book and gets one of the three prizes awarded, he will only get a prize in proportion to the number of stakes in the book, e.g., in a 1,000 column $1 paid stake book, the first prize is nominally $600. If only 500 tickets have been sold and the book is then closed, the first prize will not be more than $300, probably much less. The general principle that guides a staker in picking out his 16 or 20 surnames is that the big or more common surnames will be more likely to get degrees. As noticed above, the Wai Seng office always taboos a large number of the most common surnames except on the lottery for the metropolitan examination at Peking. In looking through all Wai Seng stake books, it will be seen that the first 7 or 8 surnames in each column are always those that are the biggest or most numerous next to those barred. In the metropolitan examination, when there are no surnames barred, the general public have nearly as good a chance of selecting successful surnames as the experts and proficients, book-makers so to speak, who make a regular business of collecting Hong Tsing (行情), or special tips about the chances of the competitors. The reason why the big surnames are selected first is that firstly there are always a large number of candidates of these surnames, and secondly that candidates who belong to families bearing a big surname are more likely to pass, as it is presumed that they have had a more costly education and are better fitted to compete than men of small or less numerous surnames who more commonly belong to poor families.\nThe Prizes won and the Deductions made from them.\n\nIn all Wai Seng stake books, there are three prizes given. It makes no difference what the price of the ticket is, every stake book or Kün Hau has three prizes. The prizes, of course, vary in value according to the value of the Wai Seng stake book. The prize for a $20 book is, of course, greater than for a $1 book, and so on. Let us suppose our friend has won the first prize in the $1 book he staked in and that two of his acquaintances have won the second and third prizes.\n\nIn a $1 Wai Seng stake book of 1,000 stakes the first prize is $600, the second prize $200, and the third prize $100. These figures, however, are only nominal. The Wai Seng office expenses are heavy, and it has to make money out of the business as well. Professedly $900 is paid away in prizes, this only leaves $100 to the office to pay all its expenses with and make its profit out of. As a matter of fact, however (as will appear shortly), we shall see only $700 is paid in prizes to the three winning stakers. The lottery on a $1 Wai Seng stake book nominally leaves the office with only $100 in hand, $900 being paid in prizes. From this $900, however, the following deductions are made. First, book money or expenses for printing are deducted. This comes to $76, and Keng Fai (經費) or office expenses amounting to $90 are next deducted. This $90 is the percentage deducted by the Wai Seng Government Department which licenses the various offices that do Wai Seng business. Discount is next deducted at the rate of 2 taels 1 mace on every 100 taels. This amounts to $18 odd. This discount, or Un Shui (員水), deduction is apparently a mere squeeze. Before the Canton mint was built, there was very little small silver current, and the Wai Seng offices took broken (sycee), or Sui Ngan (碎銀), and the deduction was made to make up the loss on the silver. Now that there is ample small silver current, coined by the great Canton Mint, this deduction is merely extra profit. To recapitulate the deductions in a tabulated form:—\nOne thousand dollars are received as stakes at $1 a stake, ... $1,000\n\nBook or printing expenses, ... $76\n\nPaid as revenue to the Government Wai-Seng Department, ... $90\n\nDiscount, ... $18\n\nRetained by the Wai Seng offices as commission, ... $100\n\nRemainder left to be devoted to paying prizes, ... $716\n\n$1,000\n\nThus, roughly, there are only $716 to be devoted to paying the three prizes. On calculation of these deductions in detail, it appears that the first prize is actually $479, the second prize $158, and the third prize $79, though nominally they are called $600, $200 and $100 prizes. By looking at the above figures, we can also see roughly what profit the Wai Seng office makes on the sale of a $1 book of 1,000 stakes. The office has to pay $716 in prizes and $90 to the Wai Seng Government Department, that is, $806—that leaves a balance of $194 on the $1,000 paid for the 1,000 tickets. Of this $194, $76 is deducted for printing expenses, but as a matter of fact the printing of the book only costs $20, the office therefore makes $56 on the deduction made for printing. There remains the $100 reserved by the Wai Seng office as its legitimate commission for carrying on the business. The total profit, therefore, roughly, of the Wai Seng office is about $156. As a hundred of these $1 books are often made up on all the more important civil examinations by all the ten licensed offices, each makes a profit of about $15,600 on the sale of a hundred $1 books, and the profit of the ten Wai Seng offices, if lumped together, would, in such a case, amount to $156,000.\n\nIn Canton, occasionally there is a further special deduction of 11 per cent. made for various charitable purposes, such\nas for famine relief funds, inundations of the Yellow River' and so on.\n\nThe above calculations refer solely to a $1 book of 1,000 tickets. The prizes given and the deductions made in all other different priced books are calculated pro rata in exactly the same way. Thus, take a $25 book of a thousand tickets. The figures come out, roughly, as follows:\n\nOne thousand tickets at $25 each is $25,000\n\nPaid as revenue to the Wai Seng Government Department, ... $2,250\nCommission of Wai Seng offices, ... ,, 2,500\nDiscount, ... ,, 450\nPrinting (same as for a $1 book), ... ,, 76\nPrizes, ... ,, 19,724\n\n$25,000\n\nIn a $25 Wai Seng stake book, the three prizes are respectively, first prize $15,000, second prize $5,000, and third prize $2,500—in all $22,500 is put aside for paying prizes. From this $22,500, however, $2,776 is deducted for paying revenue, discount and printing expenses, leaving $19,724 to be divided into 3 prizes in the same proportion as in the $1 stake book. The nominal prizes (i.e., before deductions pro rata for revenue printing and discount are made) in the other priced stake books are as follows:\n\nA 50 cents ticket in a 50 cents book is the lowest that can be bought—first prize, $300; second prize, $100; third prize, $50.\n\nA $1 book (described above).\n\nA $2 book—first prize, $1,200; second prize, $400; third prize, $200.\n\nA $3 book—first prize, $1,800; second prize, $600; third prize, $300.\n\nA $4 book—first prize, $2,400; second prize, $800; third prize, $400.\n\nA $5 book—first prize, $3,000; second prize, 1,000; third prize, $500.\nTHE WAI SENG LOTTERY.\n\nA $6 book (these are rare)—first prize, $3,600; second prize, $1,200; and third prize, $600.\n\nA $10 book—first prize, $6,000; second prize, $2,000; third prize, $1,000.\n\nThe $25 book is described above. The great majority of stakers buy $1, $2 and $3 stakes. The $5 and $10 books are the most popular among the large trading classes. Very few books of the $20 or $25 price class are sold. There is usually too much trickery, both on the part of heavy buyers and the Wai Seng offices, to make it safe for the general public to invest in the high priced tickets. In the Straits, the largest number of tickets bought are the 50 cents and $1 ones. No books of a higher price than $10 are opened here, and few of these are sold. The $5 books are the most patronised by the better classes here.\n\nIn the Straits Settlements, winners of prizes are better off than in China. The prizes given there are the same, e.g., $600, $200 and $100, being the first, second and third prize in a $1 book; and the rest are in the same proportion as in Canton. In the South, the Wai Seng office only deducts printing expenses and a contribution towards the revenue it pays to the Johor Government. The calculation is as follows:\n\nOne thousand tickets at $1 each, ... $1,000\n\nDeduct printing expenses, ... $76\nRevenue contribution (estimated as above, 8 cents in a dollar), ... ,, 80\nCommission of office, ... ,, 100\nPrizes, ... ,, 744\n\n$1,000\n\nIn Canton, only $716, roughly, is spent on prizes, and in the Straits the public gets about $28 more. In the South, although the Wai Seng firm pays only about $30,000 a year to the Johor Government, it deducts nearly as big a contribution (8 cents in the dollar to the 10 cents in a dollar in Canton) as the Canton Kong Si does, which has to pay about $885,000 a year to the Government.\nCHAPTER IV.\n\nCONSTITUTION OF THE WAI SENG LOTTERY.\n\nIn the Canton Province, the privilege of holding Wai Seng Lotteries is granted by the Provincial Government to a public syndicate composed of several wealthy traders, who are further guaranteed or secured by other local men of high literary standing or official position. At present the Canton syndicate is practically guaranteed and controlled by a Metropolitan or Tsun Tsz graduate called LAU HOK SUN (劉學詢). This man has a large property and a bank, and is on familiar terms with all the high officials in the city. This privilege, a very lucrative one, is not let out to tender, but is a matter of arrangement, favour and money with the Governor-General and his subordinates. The privilege is limited to six years, and the syndicate is allowed to open a Wai Seng yamen, or public office, and consider itself a regular department of the Provincial Government. The Wai Seng Department is furnished with an official seal, and is now generally regarded as one of the most important Government Boards for raising revenue for the Provincial Treasury. The revenue raised by the syndicate or farm is an important one, because it pays its taxes to the Treasury direct. The collection of the revenue and its transmission to Government is very simple and there is no opportunity (as with most Chinese taxes) for the money to stick in people's hands on the way. The present Wai Seng syndicate is composed of two Kongsis (公司) called respectively the Kung Wo Tong (公和堂) and the Sui Sheng Tong (瑞成堂). These two chops jointly and severally undertake to pay and collect the Wai Seng revenue for the Government, and to be generally responsible for everything connected with the entire business. Every year the syndicate has to pay $886,660 into the Treasury, or rather to the Shin Hau Kuk* (善後局), or Board of Reorganisation, or $5,320,000 in all in the six years during\n\n* The Shin Hau Kuk (善後局), or Board of Reorganisation,\nwhich the syndicate is limited to run. The revenue is paid quarterly. Some doubt whether the syndicate can afford to pay so big a sum as this, but, as will subsequently appear when we consider the amount of business done by the Wai Seng firms there can be little doubt that the syndicate can afford to do it, and though the revenue, or price of the farm, so to speak, is big, yet there is enough left over to enable the syndicate, *ceteris paribus*, to make a handsome profit. In addition to the five million dollars odd that the syndicate pays as revenue to the Government, there is a squeeze of one million dollars to be paid during the six years the farm runs. This million dollars is divided amongst the higher officials and their subordinates. It is a squeeze that the syndicate has to pay for its privileges. The million dollars is paid by instalments of $166,660 every year. If there are extra examinations during the six years' lease, the officials insist on having bigger presents or squeezes. Under any circumstances, not less than $1,000,000 must be paid them during the six years of the farm.\n\nIn the city of Canton, the syndicate sub-lets the Wai Seng business to ten Wai Seng offices called Cho'ng (廠). The names of the ten offices are at present as follows:\n\n1.—Lo Fu Kwai Tsun (老富貴全); 2.—Fu On Wing (富安榮); 3.—Shiu Ch'eung (兆昌); 4.—Chim\n\nwas originally started after the Tai-Ping rebellion, with a view to restore order. It is composed of a Committee of the Provincial Treasurer, Chief Justice, and the Commissioner of the Salt and Grain Departments. In Canton, this board is very largely supported by the revenue now collected from the Wai Seng syndicate, which pays its collections into its coffers. It is from the funds of the Shin Hau Kuk in Canton that money is now chiefly drawn for defraying expenses connected with the reorganisation of the Military and Naval Forces and the purchase of modern armaments. Its actual administration is usually in the hands of expectant officials of high rank who have not yet obtained a substantive appointment in the Province.\nUn (占元); 5.—Tai Fu Kwai (大富貴); 6.—Cheng Sheng Sun (正誠信); 7.—Meng Sheng Li (名成利); 8.—Shi Li Wo (時利和); 9.—Kwong Tung Shun (廣同順); 10.—Po Tai Wo (保太和). These Ch'ong are all situated in the 7th or 8th Ward Streets outside the city. Every one of these ten offices makes a regular written contract with the Kung Wo Tong and Sui Sheng Tong syndicate. The two principal terms are—first, that a deposit of $40,000 be placed by each office in the hands of the syndicate as security; and, secondly, that 10 per cent. on all the prize money given in every Wai Seng stake book (whether it is a 50 cents, $1 or $25 book) be paid to them. The security of $40,000 is exacted by the syndicate to protect itself against any Wai Seng office failing to pay this percentage in full. The Wai Seng business is a large concern.\n\nA number of agents, or Keng Shau (經手), are employed to tout for business all over the town, especially at private houses. If the public trust the agent, they can buy their tickets through him, but the Wai Seng office will not stamp the ticket sold by the agent as paid till he has actually paid the money for it in, and the staker cannot get a prize paid till his ticket is so stamped. In every Wai Seng office there is a large staff of men, ranging from 40 to 100 or more, living on the premises and connected with one or the other detail of the business. It is on the integrity and character of the managers and agents that the success of the concern largely turns. As a business, the lottery is bound to pay and pay well and quickly. The only loss that can be incurred is through the dishonesty of the manager and agent or by stakers who buy on credit defaulting. The Wai Seng shops that occasionally close, nearly all do so owing to losses incurred by embezzlements and defalcations and not to want of business or inability to make money out of the affair. The Wai Seng business is confined in the city of Canton to ten licensed offices that there may not be too much competition. But a very large business is done in Wai Seng stakes in the country and in the other large towns outside Canton in the province. These lotteries are all held in-\ndependently of those in Canton. Various forms of agencies exist outside the city of Canton for the sale of tickets. All the ten Wai Seng offices in Canton have regular agents or firms in the country, who issue tickets on their behalf and receive a commission of about 5 per cent. on the tickets sold. Firms that do this commission work are called Wai Seng Thing Ka (艇家). In some towns in the province there are certain Wai Seng establishments which receive money and issue tickets for all the ten offices in Canton. Such establishments are called Tsung Kuk (總局). In many of these Tsung Kuk the Canton offices seem to have a share. In most country places at a considerable distance from very big towns there are also separate offices or Ch'ong (廠) licensed by the Canton Wai Seng Government Department, or Kong Sho (公所), carrying on an independent business. These Ch'ong send their agents round and tout through the villages and establish branches of their own at all country market towns. In this way the whole province is honeycombed with Wai Seng agencies of one sort and another; and the business does not stop at the Canton Province. It extends into the neighbouring province of Kwong Sai, and is carried on in Macao and also sub rosa in Hongkong. In the Treaty Ports of Amoy, Shanghai, Tientsin and even in Peking there are also small agencies for the sale of the Canton Wai Seng tickets. The Wai Seng Lottery in Macao is in a curious position. In writing the history of the Wai Seng Lottery in the Canton Province, we saw that the Wai Seng Lottery after being suppressed in Canton by the Viceroy LAU KWAN YAT (劉坤一) in about 1860, migrated to Macao and was carried on in Canton by agents from that port till some eight years ago, when the lottery was licensed by the Provincial Government in Canton. At first the old Macao and the new Canton Wai Seng Lotteries competed, but finally amalgamated. The present arrangement is as follows. In Macao, the Wai Seng business is licensed by the Portuguese Government and pays a small revenue of about $50,000 a year. The same Macao Wai Seng Department further pays a sum of about $40,000 to $50,000 a year to the Can-\nton Wai Seng Government Department. This sum is paid for the privilege of selling Macao Wai Seng tickets in Canton. Large numbers of Canton people purchase Macao Wai Seng tickets, because they think people in Canton with their superior information about the candidates, have a better chance than the public in Macao of guessing who is going to pass. In Canton, where information about candidates and their chances of success is very general, every one competes with his neighbour on equal terms, and the actual winning of a prize can only be ascribed to the fortunate staker's good luck. Large numbers of residents in Canton connected with the Straits Settlements in one way or another, on the same principle, invest freely in Wai Seng tickets in Singapore and Johor believing that they will be sure to score off the less well-informed China-men living there. While mentioning this, one might add that it is a common thing for Chinese to form themselves into partnerships or clubs for buying Wai Seng tickets. The point is that if a large number of tickets are bought, the partnership will, if it is well informed, run a better chance of getting a prize.\n\nThus, suppose 50 Fo Ki (夥計), or shop assistants (and this is the class that generally do it), club together and buy 100 tickets in a $1 book of 1,000 stakes, it is obvious that they have, as compared with the staker who only buys one ticket, a far better chance of guessing the winning surnames. If a prize is won, the club or kongsi divides it. This practice is also occasionally followed by big trading firms, who club together to buy the $10 or $20 tickets, and some of the malpractices connected with this lottery are carried out by wealthy stakers who use the common fund of the club to bribe candidates or examiners.\n\n**Constitution of the Wai Seng Lottery in Johor and Singapore.**\n\nThe Wai Seng Lottery was first introduced into the Straits Settlements some ten years ago. It began in a very small way and was first of all carried on publicly in Singapore. After the lapse of five years or so, the matter began to attract general public attention, and the Chinese (all Cantonese)\ninterested in it found it unsafe to actually carry on the business in Singapore. Advances were then made to the Johor Government, and finally that Government started a Wai Seng farm. The farmer pays about $3,000 a month to the Government, and sub-lets the right to open Wai Seng Chong (麻), or offices, to various Wai Seng houses. From these offices the farmer receives 5 per cent. commission on the prize money. The farmer can (as in Canton) of course tell exactly how much money is paid in prizes by calculating the amount from the Tse Kau Tan (謝教單), or prize lists, issued after the publication of the examination class lists. The names of the largest and best known Wai Seng offices that have been running (prior to 1894) during the last six years are as follows:\n\n1.—Shi Li Wo (時利和); 2.—Wing Kat Tseung (永吉祥); 3.—Tak On Wing (得安榮); 4.—Kung Thai Heng (公泰興). These Wai Seng offices all have their headquarter office, &c. in Johor. But Johor is only used as a basis of operations. Nearly all the business of the lotteries is carried on sub rosa in Singapore, and in order to avoid detection and fine, all the Wai Seng papers are got up in a fictitious way so as to be capable of two interpretation when produced in a law court as evidence. There is further too, of course, a great deal of money spent in Singapore in keeping informers and others quiet to allow the Johor Wai Seng people to carry on their work in peace. The great majority of people in Singapore buy their Wai Seng tickets through the Johor agents, who are continually passing between the two Settlements. A number of shops too in Singapore undertake to sell tickets on behalf of the Johor offices, and receive a commission of 4 per cent. on the number of tickets sold. Private individuals too who get orders from their friends to any extent go to Johor and buy tickets there for ready money, and the Wai Seng office pays their expenses to and from Singapore. But this Wai Seng business in Johor has branches in many places. The offices licensed there commission various firms in Penang, Taiping, Klang, Rhio, Banka, Billiton and many other places to sell tickets on their behalf. In Penang, there are two Wa\nSeng Lotteries, called the Meng Li Sheng (名利成) and Fu Kwai Ts'ün (富貴全), that use the Siamese port of Kedah as their basis of operations. They are carried on independently of the Johor houses, but are both small concerns of no great importance. The chief difference in the Canton and Johor lotteries consists in the system of security. In Canton the Kung Sho (公所) practically guarantees the stability and bond fides of the offices licensed by it, and the public have little or no fear of an office closing and bolting with the money staked without paying the prizes won. But in Johor and the Straits Settlements that is just what everyone is afraid of and what has happened before now. The farm being in Johor, could not be touched if it played fast and loose with the public in Singapore. To get over this difficulty, the following system has been adopted.\n\nEvery Wai Seng office licensed by the farm in Johor furnishes the security of some big trading firm in Singapore. That is to say, in other words, that certain firms in Singapore allow it to be publicly known that they will undertake to make good any embezzlement or defalcation of the Johor office they stand security for. In most cases, the firms in Singapore who give this security have branches of their trading houses in Johor and are always connected with, if not the actual owners of, the Wai Seng offices in Johor. What particular trading firm stands security for any particular Wai Seng office in Johor, becomes a matter of common knowledge amongst the Cantonese, Teo-Chews and others that buy tickets. It cannot, of course, be published openly, as the Police might then lay hands on the proprietors of the shops that give this security. In Johor, the Wai Seng farm is let to the highest tenderer and is limited to a term of six years. The business done in the Straits is, of course, nothing like so large as in Canton, but still is not inconsiderable. When the two last Civil and Military examinations for the Metropolitan or Tsun Sz degree were held in China, tickets were purchased (as proved by the prize lists subsequently published) in the Straits and other places in the South to the total value of half a million dollars. When the oldest and largest Wai Seng office in the Straits, the\nShi Li Wo (時利和), closed in 1892, it was commonly said that this house had made a clear profit of over half-a-million dollars during the seven or eight years it was running.\n\nInstead of paying $36,000 a year to the Johor Government as revenue, the Wai Seng farm could, of course, pay even double or treble that sum without any difficulty, and if the Government of the Straits were to follow the example set by the Viceroy of Canton and license the system in Singapore, I expect something considerably over a hundred thousand dollars a year would be tendered for such a farm. There is no business connection or partnership of any kind between the Wai Seng offices in Canton and in the Straits and Johor. Each is carried on by quite a different class of people. At the same time the Wai Seng offices in the Straits Settlements and Johor occasionally adopt the same chop as those of the Canton houses, e.g., Shi Li Wo (時利和) or Fu Kwai Ts'ün (富貴全), in hopes, no doubt, of bettering their business by this means. Most of the Canton Wai Seng firms are owned by Cantonese who have money in America, the Philippines, Hongkong or the Straits and who on their return to Canton, finding they have no status or position by the side of old established houses in other lines of business in the city, have put their money into a concern that makes much money at once safely and quickly. In the Straits Settlements and in Johor the position of the class of traders who indulge in this trade is not so good as in Canton, and they are not infrequently gentlemen with antecedents one could hardly be proud of. The name of the present syndicate in Johor is the Lün Mi T'ong (聯美堂), and the farmer is a Teo-Chew called Lim Siang (林相).\n\nIn the Autumn of 1893, the Officer Administering the Government, Mr. W. E. Maxwell, C.M.G., took up the question of Wai Seng Lotteries in the Straits and Johor States, and by his energy and firmness practically broke up the whole system by seizing several of the leading traders in Singapore who had been for some years promoting these lotteries and thereby systematically breaking the gambling laws of the Col-\nThe Johor Wai Seng farm has not yet hit on any new plan by means of which it can now carry on the business in British territory with more or less impunity as before; but the profits of the business are so large, the interest taken by the Chinese in the Straits in the examinations in China so keen and warm, and the ingenuity of the Chinaman at running a coach-and-four through our Ordinances so great, that it will be merely a question of time before some other plan is found for carrying on the lottery as before. There are practically only two ways of dealing with the lotteries effectually. One is to get the Wai Seng farm abolished in Johor—for without some such basis as Johor, the lottery cannot be carried on; the other is for the Government of the Straits Settlements to license the lottery. If the latter were done, the Johor farm would break up at once, and the British Government receive instead of the Johor Government the big revenue that would accrue from the new farm. In the general opinion of the Chinese in Canton and the Straits, the Wai Seng Lottery is not a degrading and immoral form of gambling like Fan T'an (番攤), Po Tsz (寶字) and the Pak Kop Piu (白鴿票) or White Pigeon Lottery, which like the notorious Hokkien Hoe He (Wha-Wey) Lottery (花會) opens daily. The Wai Seng Lottery is only carried on when there is an examination, and, roughly, there are only some 60 odd examinations during the six years a farm runs. A staker only loses a few dollars at most, unless he plunges, and has a fair chance of winning a prize. This lottery is particularly popular in Canton with the shop-keeping, trading and shop assistant classes, and is regarded by all classes in much the same light as a European looks on a sweepstakes for the Derby or on the Manila Lottery. The official classes and literary men (who naturally know more about the candidates and the examinations than the mercantile public) buy these lottery tickets very largely and win many prizes. So common and fashionable is it now-a-days in Canton to risk 50 cents or a dollar or two on these periodical literary examinations, that anyone who objected to it as an immoral practice would be considered a prude. All right-thinking Chinamen agree\nthat to have no Wai Seng Lottery at all would be best. But this is merely an ideal statement of opinion. The firmest supporters of the abolition of the Wai Seng Lottery will buy tickets on the sly, and say nothing about it if he draws a blank. Let him, however, get a prize, and it becomes in his own eyes and to his friends a special act of providence. The Wai Seng Lottery is, as long as the Cantonese are with us, likely to be as permanent as its European rival—the Manila Lottery. If, therefore, the Wai Seng Lottery and its people are permitted to flourish and abound across the water, the more will the Chinese of Singapore contribute to the success of the Wai Seng farm in Johor. The policy for the Government here is under any circumstances, to prevent Singapore being drained of money by the large remittances sent to Johor in support of this popular lottery. The Chinese in Canton who buy tickets in Singapore and Johor hoping to get the better of the Chinamen living in the South, do not often succeed, for the Hong Ts'eng (行情), or information about the candidates and their chances of success, is nearly as good in the Straits as in China. Cantonese firms in Singapore that buy these tickets largely have agents in Canton and, in the case of the Metropolitan examination, in Shanghai and Peking, and they telegraph information as to what surnames are being supported and what surnames are being suppressed.\n\nAbuses connected with the Wai Seng Lottery.\n\nBribery and corruption is an old established custom in China. The custom is universal and (every one being prepared for it in anything to do with the official world) more or less universally condoned. At any rate the Chinese code of morality on this point differs widely from the Western one. This element enters to a limited extent into the public competitive examinations. There is no wholesale selling of degrees at these public contests, but there is no doubt that few, if any, examinations are held when money is not spent to get a few degrees. Although the competitors at the examinations always range from 1,000 or more up to 8,000, 9,000 or more, even these few cases do not pass unnoticed, and if anything like a general\nsystem of selling and buying degrees was attempted, the literary classes, especially the poorer bodies, would certainly rebel. In referring to one or two of the abuses that are practised at the examinations in connection with the Wai Seng Lottery, it is important to bear in mind that any games played with a very few surnames may upset the whole bag of Wai Seng tickets. Out of 16 or 20 surnames well informed stakers can guess fairly accurately some 10 or 15 surnames. The element of uncertainty comes in in dealing with the remainder. If foul means are resorted to either by the stakers or a union of stakers or by the Wai Seng offices, to settle anything with certainty about these remaining surnames, it is obvious that the general public has, compared with such a body, little chance of winning prizes. And that such abuses are occasionally practised both by the public and by the Wai Seng people there can be no doubt. At the same time, however, the Wai Seng offices do not dare to do anything outrageous, as they are responsible to the Wai Seng Government Department for carrying on the lottery honestly, and would be exposed to a heavy fine and possibly to the loss of the whole business if any gross case of cheating were detected. The following are the most serious malpractices referred to.\n\n1. Suppressing surnames, Kam Seng (禁姓), i.e., excluding a surname or surnames which the public have bought heavily. There are two ways of doing this. The examiner and his staff may be bribed not to pass such a surname. Or, failing that, the candidate with the surname to be excluded may be personally approached and asked, for a little consideration, to scratch at this examination in question. The candidate loses nothing by doing this, as he can go up again at the next examination. It is commonly said that this fraud is more often practised by heavy buyers of stakes than by the Wai Seng office. Five years ago, a Wai Seng office was caught suppressing surnames, and fined $20,000, and this money was confiscated and devoted to the building of a public college.\n\n2.—Impersonation by a man who either enters the Examination Hall instead of the competitor, and does all his work, or who merely writes the essays and poems for the competitor\noutside the Examination Hall and has them conveyed to him by some means. As the competitors at these examinations are numbered by thousands, and the official arrangements for preserving order and identifying the candidates incomplete and futile, there is no difficulty in (what is called by the Chinese) engaging a gun (請槍) either to personate a man, or merely to do his work. These \"guns,\" or substitutes, are always clever men, who are paid a hundred dollars or so down on entering the Examination Hall and also receive a post-dated I. O. U. for a thousand dollars or more to be paid in the event of the \"gun\" getting a degree for the man he personates. In the first examination very few \"guns,\" if any, enter the hall, but in the second examination, when the candidates number nearly 10,000, some twenty or forty guns are pretty sure to be engaged. It by no means follows that these guns are engaged by heavy Wai Seng buyers or by the Wai Seng offices to pass incompetent candidates and so upset people's calculations; on the contrary, in most cases the personators are engaged by the wealthy competitors in hopes of getting a degree. For candidates with money this practice is cheaper than actually bribing an examiner and all his assistants direct. Still there can be no doubt that guns are occasionally engaged on behalf of those heavily interested in lotteries. With reference to this and other malpractices, however, one must bear in mind that the scheming of one party may spoil the scheming of another party, and that the scheming of both does not necessarily secure prizes for the conspirators in every lottery, but only in the particular lottery in which they have invested.\n\n3.—Direct bribery of the Literary Chancellor and the grand examiners. This is not a common occurrence, and when it does occur is almost sure to be carried out on behalf of some very wealthy or highly connected competitors. If such competitors, however, happen to have out-of-the-way surnames which no Wai Seng staker has thought it worth while to select, the giving of degrees to such unknown and presumably incompetent men will naturally upset everyone's calculations and make a general hash of the expected results.\n\n4. Years ago before the Wai Seng Lottery was licensed and\nrecognised by the Government, several Wai Seng offices were in the habit of reserving 500 stakes in every book of 1,000 stakes for themselves and selecting the same surnames as the public, did. In this way they were bound to share in the prizes won by the public. This was a very clumsy fraud and easily detected and could not be practised now.\n\nThe Wai Seng office certainly has the pull over the staking public, as it can always keep a few stakes for itself in each Wai Seng book in the various price-classes and, by putting off the issue of them till as late as possible, have learnt with more or less approximate certainty what tricks are (if any) being played with some of the candidates. But the Wai Seng office cannot even do this to any great extent or with any very great advantage over the public. It can only keep back, at most, on one pretext or another, a very few books in this way, and even to counterbalance this, there are a number of old hands amongst the stakers who also hold on till the eve of the examination and buy their tickets (especially in the high priced class books) when the Hong Ts'eng (行情) as to who has bribed the examiners, who is going to scratch, and who has engaged substitutes, has been got out of the wire-pullers. Of course, in the country and elsewhere outside the city, the agents of the Wai Seng offices and others with special knowledge, can buy up tickets against the less well-informed; but this is counter-checked to some extent. Many of these agents who are sent to buy up tickets against the villagers and others receive (unknown to their employers) regular \"tips\" for good Hong Ts'eng and a promise of 10 or even 15 per cent. if a prize is won. There is no doubt that many of the malpractices carried on in connection with these lotteries are upset by one miscalculation or another, and that it is very difficult for any one (whether he belongs to the Wai Seng office or to the staking public) to engineer the lottery so successfully as to make the result a foregone conclusion. Now and then a very skilful job may be carried through successfully, but so many jobs fail to come off or are upset by other \"jobs\" which are being carried on by others, that no\none thinks that the lottery is spoilt by these peculiarities. A Wai Seng Lottery is certainly a glorious uncertainty, and the intrigues and conspiracies that go on over it seem but to increase the fascination that this game of chance has for the Chinaman's mind. It must always be remembered too that the reputation of the Provincial Government is always at stake over the working of the Wai Seng business, and that with an ordinary well-principled official at the head of affairs, any gross abuse is sure to lead to trouble. A striking instance of this occurred shortly after the Viceroy CHEUNG CHI TUNG leased the first farm. The Literary Chancellor at that time was one Ip CHEUK TO. He held the Prefectural Examinations at Wai Chau for the two districts of Kwai Sin and Pok Lo. At this time the public staked nearly as freely on these district examinations as they do now on the bigger competitive ones, and a very large sum of money was staked on the candidates for the two districts mentioned above. When the official list of successful competitors was published there, men with the surnames of WONG, CHUNG and LIU (王鍾康) were found to have been passed. These three men were outsiders, so to speak, on whom the public generally had not staked at all, believing that they had no chance of getting a degree. Loud complaints were raised in Canton, and charges were made against the Literary Chancellor of having taken money to let these men pass. The Viceroy CHEUNG CHI TUNG took the matter up and instituted an enquiry into the whole case. The result of the enquiry was that the charges were held to be proved. The Literary Chancellor retired, and the Viceroy compelled all the Wai Seng offices to surrender the Wai Seng stake books for examination before any prizes were paid. After the books had been examined, the Viceroy gave orders that all the money won in prizes by stakers who had won by having those three surnames (WONG, CHUNG and LIU) amongst the surnames of successful candidates were to be held privy of collusion, and finally the money won by them was all confiscated by the Government. The confiscation amounted to a very large sum, and was used by the Viceroy to assist in founding the Kwong Nga Shü-Ün, or Canton and Kwong Sai College, situated outside the city walls of Canton.\nCHAPTER V.\n\nEXTENT OF AND AMOUNT OF BUSINESS OF THE WAI SENG LOTTERY.\n\nAt the present time Wai Seng Lotteries in Canton are held on the results of the Civil and Military examinations as follows:\n\n1.—Civil District Examinations for the first or Sau Tsoi Degree.—As stated in the introductory remarks, these examinations are held at the prefectural cities in whose territorial jurisdiction the districts are placed. At present, lotteries are held on examinations in the following districts:\n\n(a)—Kwong Fu Prefecture.—Lottery held on the results in the Nam Hoi, Pun Ü and Shun Tak districts.\n\n(b)—Wai Chau Prefecture.—Lottery held on the results in the Kwai Shin and Pok Lo districts.\n\n(c)—Shiu Heng Prefecture.—Lottery held on the results in the Ko Lu and Hok Shan districts.\n\n(d)—Shiu Chau Prefecture.—Lottery held on the results in the Ying Tak and Lok Cheung districts.\n\n(e)—Ch'iu Chau Prefecture.—Lottery held on the results in the Hoi Yeung, Ch'iu Yeung and Kit Yeung districts.\n\n(f)—Ko Chau Prefecture.—Lottery held on the results in the Mau Meng, Tin Pak and Fa Chau districts.\n\n2.—Military Examination for the First Degree.—At this military examination the lottery is only held on the results in the districts of Nam Hoi, Pun Ü and Shun Tak in the Kwong Fu Prefecture.\n\n3.—The Civil Provincial Examination.—A lottery is held on this examination that takes place every three years in Canton.\n\n4.—The Military Provincial Examination.—A lottery is held on this triennial examination at Canton.\n\n5.—The Civil Metropolitan Examination.—A lottery is held on this examination that takes place every three years at Peking.\n6. The Military Metropolitan Examination.—A lottery is held on this triennial examination at Peking.\n\nWe see, therefore, if we take three years as a limit for computation, that during that space of time twelve lotteries are held on the Civil District Examination, two on the Military District Examination, one on the Civil Provincial Examination, one on the Military Provincial Examination, one on the Civil Metropolitan Examination, and one on the Military Metropolitan Examination, or, in other words, that there are 18 examinations during three years on which lotteries are held. But the Wai Seng syndicate runs for a term of six years. Accordingly, it holds lotteries altogether on double this number of examinations—on 36 examinations in all. This takes no account of extra triennial examinations that may be granted by the Emperor as an act of grace. With this knowledge, it is now possible, very roughly, to get some idea of the amount of business done by the Wai Seng syndicate and the ten offices in Canton. The following calculation does not take into account the lotteries held outside Canton in other times and places, in nearly all of which the ten Canton city Wai Seng offices have shares. To find out roughly the amount of business done by the Canton offices, it will be easiest first of all to confine the calculation to the one-dollar stake books.\n\n1. District Examinations.—On these examinations, the least business is done. We must except, however, the district examinations of Pun Ü, Nam Hoi and Shun Tak, as the public stake largely on them. There are ten Wai Seng firms, five of which, roughly, do a business about double or more than double the amount of that of the other five. The five biggest offices each make up about 100 one-dollar books on a district examination, the others make up about 50 books apiece. The calculation of the 6 years will be, therefore, as follows:\n\n- 5 offices sell 500 one-dollar books.\n- 5 offices sell 250 one-dollar books.\n\n750 one-dollar books or 750,000 one-dollar stakes. $90 revenue is paid by each Wai Seng office on every thousand dollars. Accordingly, on $750,000, a revenue of $67,500 is paid.\nOn 28 examinations held during the six years of the syndicate's lease of the farm, a sum of $750,000 \\times 28$, or $21,000,000$, is invested in the form of one-dollar stakes. The revenue paid to the syndicate on the 28 examinations during the six years is, therefore, the revenue for six examinations, i.e., $90 \\times 750$ one-dollar books of 1,000 stakes, or $67,500$ multiplied by 28, or $1,890,000$. The above is a very rough calculation, because it is almost impossible to fix, in the case of the district examinations, the number of various priced ($2, $3, $5, &c.) stake books sold by the ten Wai Seng offices. By taking $1 as the basis of calculation, we cannot have greatly over-estimated the amount, especially as on the District Examination of the Kwong Fu prefecture nearly twice as much business is done as over the other examinations.\n\n2. Civil Provincial Examinations.—These are the most popular with the public, and the business done by each firm much more equal. At an ordinary Heung Shi or Kui Yan (M. A.) examination, the business done by the Wai Seng offices stands in the following proportion:\n\nFive offices sell about 500 volumes each, and five sell about one-quarter of that amount or less. In this examination, the higher priced books are largely sold, and it will be necessary to follow the business done over this examination more in detail.\n\nThe calculation given below is made up from comparison of several of the prize lists published by the various Wai Seng firms:\n\nOne Wai Seng office sells 10 ten-dollars books on each of which books $900 is collected, ... = 900 \\times 10 = $9,000 revenue.\n\nDitto 5 twenty-dollar books on each of which book $1,800 is collected, ... = 1,800 \\times 5 = 9,000 revenue.\n\nDitto 40 three-dollar books on each of which books $270 is collected ... = 40 \\times 270 = $10,800 revenue.\n\nCarried forward, ... $28,800\nBrought forward,... $28,800\n\nOne Wai Seng office sells 80 two-dollar books on each of which books $180 is collected, ... = 80 \\times 180 = $14,400 revenue.\n\nDitto 220 one-dollar books on each of which books $90 is collected ... = 90 \\times 220 = $19,800 revenue.\n\nDitto 145 fifty-cents books on each of which books $45 is collected, ... = 45 \\times 145 = $6,525 revenue.\n\nTotal Revenue paid = $69,525\n\nRoughly speaking, the number of Wai Seng books given above may be estimated to fairly represent the amount of business done by the five larger Wai Seng houses. The total revenue paid by five houses would, therefore, be $69,525 \\times 5$ or $347,625. The revenue contributed by the other five Wai Seng houses is only about one-quarter so big, and the revenue paid may be put down as $86,906, that is to say, that $434,531 will be paid as revenue by ten offices in all on one examination. During the six years the Wai Seng syndicate runs, there are two Civil Provincial Examinations, so that the revenue paid on the two examinations during the six years will be $869,062.\n\n3.—Military Provincial Examination.—The calculation to be made for this examination is about a half or less than that made for the civil one. Roughly $400,000 may be put down as the revenue contributed by the Wai Seng farm on the two military examinations held at the Provincial Capital, Canton.\n\n4.—The Civil Metropolitan Examination.—This examination is the favourite with the public. There is less hocus pocus over it and no common surnames are barred, so that everyone has a better chance of guessing the winning surnames. The following calculation of the business done over this examination is made up from the prize lists published after the examination. At this examination 5 Wai Seng houses\ndo a business about equally big, and the other 5 houses about one-half as big.\n\nOne firm sells 23 ten-dollar books on each of which $900 revenue is collected, ... = 900 \\times 23 = $20,700 revenue.\n\nDo. 39 three-dollar books on each of which $270 revenue is collected, ... = 270 \\times 39 = $10,530 revenue.\n\nDo. 88 two-dollar books on each of which $180 revenue is collected, ... = 180 \\times 88 = $15,840 revenue.\n\nDo. 185 one-dollar books on each of which $90 revenue is collected, ... = 185 \\times 90 = $16,650 revenue.\n\nTotal Revenue paid, = $63,720\n\nFive Wai Seng offices doing business at this rate would therefore, pay a revenue of $318,600. The revenue paid by the five other offices can be put down as about half, say, $159,300, or altogether the ten offices pay $477,900 as revenue for one examination. As there are two such triennial examinations during the six years the syndicate runs, the total amount contributed by the ten houses in six years is $955,800.\n\n5. The Military Metropolitan Examination.—This is the most popular of the military examinations, and the business done by the Wai Seng houses may, roughly, be put down as a half that done over the corresponding civil competition. The amount of revenue, therefore, contributed over these two examinations held during the six years the Wai Seng farm runs by the ten Wai Seng houses may be roughly put down as $477,900.\n\nTo recapitulate:\n\nTotal revenue paid on 28 District Examinations, ... ... ... $1,890,000\n\nCarried forward, ...$1,890,000\nTHE WAI SENG LOTTERY.\n\nBrought forward,...$1,890,000\n\nTotal revenue paid on 2 Civil Provincial Examinations,...869,062\nTotal revenue paid on 2 Military Provincial Examinations,...400,000\nTotal Revenue paid on 2 Civil Metropolitan Examinations,...955,800\nTotal Revenue paid on 2 Military Metropolitan Examinations,...477,900\n\n$4,592,762\n\nThe revenue accruing from Wai Seng business carried on outside Canton may be roughly put down as half a million at least. It is probably considerably over a million.\n\nSay that one extra Civil and Military, Provincial and Metropolitan Examination (124 examinations in all) is held. The Revenue from that would be about one million.\n\n$1,000,000\n\n$6,092,762\n\nThe above calculation is at best very imperfect, as it is impossible to get hold of prize lists for all the examinations extending over a period of six years. I do not think, however, after making many enquiries, that the above figures are by any means an over-estimate. The revenue paid over the 28 Civil and Military Examinations is certainly under-estimated, as large numbers of $2 and $5 Wai Seng lottery books are made up over it, and in this calculation only $1 Wai Seng books have been taken. The figures given as to the other examinations are fairly approximate. The calculation is only interesting as shewing that it is quite possible for the syndicate to pay five millions as revenue to the Government for the Wai Seng farms during a period of six years, and further allows a big margin for making \"presents\" to the higher officials.\nTHE WAI SENG LOTTERY.\n\nTRANSLATIONS.\n\nGuide Books.\n\nBook A, a Wai Seng guide\n„ B, „ „\n„ C, „ „\n„ D, „ „\n„ E, „ „\n„ F, „ „\n„ G, „ „\n„ H, „ „\n\nMiscellaneous.\n\nPaper I. A Wai Seng stake book, Canton.\n„ II. Do. do., Singapore.\n„ III. Do. advertisement, Singapore.\n„ IV. Do. do., do.\n„ V. Do. do., Canton.\n„ VI. Do. prize list, Canton.\n„ VII. Do. do., Singapore.\n„ VIII. Do. ticket, Canton.\n„ IX. Do. do., Singapore.\n„ X. An order for Wai Seng tickets, Singapore—Form of.\n„ XI. Receipt for money paid for Wai Seng tickets, Singapore—Form of.\n„ XII. Two Wai Seng guides in the form of advertisement, Singapore.\n„ XIII. A guide to assist the public in selecting stakes, Canton and Singapore.\n„ XIV. An order for Kün Hau or Wai Seng stake book, Canton.\n\n[The Chinese texts of Guide Books A to H and of Papers I to XIV are printed after the Translations.]\nWAISENG GUIDE BOOK A.\n\nDistributed by the Kwong Thai Heng Wai Seng Firm.\n\n(Cover.—Impressed.)\n\nList of the names of all the Civil Kü Yan graduates who passed at previous examinations in the Canton Province.\n\nPage 1.—List of Civil Kü Yan graduates of the Canton Province who were passed by the Chief Examiner (大主考) H. E. WONG CHI HON and the Assistant Examiner (副主考) YUK KWAN at the Peng Tsz Examination in the second year of Kwong Sü.\n\nThe full or actual list (正榜) Chung Pong. (1)\n\n1st Name.—The Kai Ün (解元) (2) or Primus Head of the list Wong In Tseung, San-On district, age 35, on the established list (附生). (3)\n\nHere follows a list of the 89 names of the successful graduates. A few names exhibiting certain peculiarities in the status of the graduates are added below:—\nThe A Ün (亞元) (2) or Secondus on the list is\n\n2nd Name.—Lo Hi Hiu, Nam Hoi district, age 37, on the established list. (3)\n\n3rd Name.—(2) Cheng Shiu Heung, Cheng Ün district, age 25, on established list.\n\n4th Name.—(2) Au Tsung Ch'o, Pun Ü, age 37, on the established list.\n\n5th Name.—(2) Lo Po Hi, Nam Hoi district, age 31, a senior B. A. (副貢生). (4)\n\n6th Name.—Wong Kâu, Shun Tak district, age 25, on the supplementary list (增生). (3)\n\n7th Name.—Mak Hung, Nam Hoi district, age 41, a senior B. A. (貢生) (4) or Kong Shang.\n\n8th Name.—Au Tsam S'am, Kwong Chau Prefecture, age 31, a salaried B. A. or Lam Sang (廪生). (5)\n\n9th Name.—Leung Heng Kwai, Pun Ü district, age 21, an official graduate or Kun Shang (官生). (7)\n\n10th Name.—Siu Kwai Heng, Chiu Yeong district, age 34, a Pat Kong Shang (拔貢生), or selected B. A. (5)\n\n11th Name.—Ng Ying Kai, Shun Pak district, age 23, a Kam Shang (監生), or graduate of the Peking University. (6)\n\nNext follows a list of 14 proxime accessitis on a supplementary list called the Fu Pong (副榜). (1) This closes the list for the second year of Kwong Sü. From page 2 to page 26 exactly similar lists of the names of Civil Kü Yans follow in chronological order. A few more names are added here to explain certain peculiarities in the status of some of the graduates.\n\n12th Name.—Chan Heng Kwai, Pun Ü district, age 31, a Yau Kong Shang (優貢生), or superior Kong Shang. (8)\n\n13th Name.—Leung Lun Tso, Shun Tak district, age 29, a Lam Sang selected to be a Kung Shang expecting\nto fill the post of a Sub-director of Studies in a district, Fan To (訓導). (9)\n\n14th Name.—Ho Hon Cheung, Heung Shan district, age 21, an Official or Kun Shang graduate on the established list.\n\n15th Name.—Ng Tseung Lau, Shun Tak district, age 59, and Pat Kong Shang, or selected B. A. expecting a post as Writer in the Cabinet.\n\n16th Name.—Luk Ying Hun, Pun Ü district, age 45, a senior B. A. or Fu Kong Shang expecting a post as Official Sub-director of Studies in a district. (9)\n\n17th Name.—Tseung Hong, a Manchoo, age 26, a Cavalry Officer. (10)\n\nAt the end of each list is written:\n\nThe list was declared or published on such and such a day.\n\nThe flowers (11) were stuck in (the caps) on such and such a day.\n\nNOTES TO GUIDE BOOK A.\n\n(1) There are always two lists, or Pong (榜), in the second Provincial Examination. It is the graduates whose merits are as great as those who have got a place in the chief Cheng (正) list, but who fail, owing to there being no more places, to get a place in it, who are put in this secondary or Fu (副) list. A place on the secondary list is like our proxime accessit.\n\n(2) The first graduate or Primus is called Kai Ün (解元), the second or Secundus A Ün (亞元); the first five names including the Kai Ün are called Keng Fui (經魁), the sixth name is called A Fui (亞魁), the last name on the list is called Lam Pong (欖榜) or Tin Kwan (殿軍).\n\n(3) The number of degrees obtainable in every Province\nhas been increased by recent decrees. Accordingly graduates of the first degree or B. A.s are now divided into two classes—those who are ranked as passed within the limited number of degrees allowed by ancient regulations (e.g., the Fu Shang (附生) or appointed graduates), and those who are ranked as passing outside that number in the new places added in modern times (i.e., the Tsang Shang (增生) or additional graduates.)\n\n(4) The term a Kong Shang (貢生) or presented graduate is generally applied to those who come nearest to getting the Kü Yan or Provincial degree. It is a literary degree or title given to those who rank just below a Kü Yan, an M. A. or graduate of the second degree. For this reason such graduates are often called Fu Pong Kong (副榜貢) or graduates of the first degree who were classed in the supplementary list at the M. A. examination. They are divided into two classes, the second class being called Fu Kong Shang (附貢生) or accessory additional Kong Shangs. The title of Fu Kong Shang may be purchased, Kün Kong (捐貢). Such Kong Shangs are popularly known as Tung Kong (銅貢) or brass graduates. The B. A. or Sau Tsoi who buys this degree can proceed direct to Peking for the Metropolitan examination or Ui Shi (會試). Kong Shangs and some Fu Kong Shangs are almost invariably B. A.s whose names appear as proxime accessitis on the Fu Pong in the M. A. examination in the Provincial capitals.\n\n(5) The position of a Lam Shin Shang or Lam Shang (廪膳生 or 廪生) lies immediately above that of a Sau Tsoi or B. A. and immediately below that of a Kong Shang. He is a senior B. A. and receives a grant, Lam Luk (廪祿), or stipend paid from the granary, from the Government funds. The position is gained by seniority and some B. A.s are admitted annually to the post Po Lam (補廪) or to be placed on the list of stipendiary graduates. A Lam Shang holds a position of considerable dignity. In all matters con-\nnected with the official world he is chosen to be spokesmen for his brother Sau Tsoi or B. A.s, and it is absolutely necessary for a Tong Shang or student to obtain the guarantee and recommendation of a Lam Shang as to his antecedents being respectable, &c. before he can enter for the Prefectural examination. Without this Lam Po (廉保), the Tong Shang cannot compete. Once in twelve years one Lam Shang graduate is chosen out of each district or Ü.n (縣) in the Province—this is called selecting Kong Shangs (拔貢). A B. A. who has been a Lam Shang for twelve years and is not chosen as a Kong Shang is honoured with the title of Sai Kong (細貢) or secondary Kong Shang.\n\n(6) The Kwok Tsz Kam (國子監) or Peking University bestows the title or degree of Kam Shang (監生). This title is purchased on matriculation and places its owner on a nearly similar footing to a Sau Tsoi or B. A. graduate. A Kam Shang graduate is allowed to compete direct for the second or Kü Yan degree in the Shun Tin Fu Prefecture, Peking. Provincial degrees called Kam Shang are also granted by the Fan Toi or Treasurer. They are of two kinds. The cheapest (30 taels odd) is merely purchased for show or to serve some interest. The degree entitles the bearer to wear a gold button, and its possession often gives the owner of it a larger share in the ancestral property than he would otherwise get. The second kind is dearer and is purchased, as in Peking, to enable the candidate to compete direct for the M. A. or Kü Yan degree. Those who purchase Kam Shang degrees in Peking compete at the Peking examination for the M. A. or Kü Yan degree. It is easier to get the M. A. degree at Peking than in Canton, as the competition there is not so severe and the number of degrees granted more in number.\n\n(7) A Kun Shang (官生). This means that the candidate Ho Hon Cheung comes of a good official family. This is theoretically of no use to him in the examination but the fact is noted in these books for the public's information. A Kun Shang is more likely than others to get passed through favour or by corrupt influences.\n(8) Yau Kong Shang (優貢生). This is a degree conferred every third year after examination by the Literary Chancellor on the senior or most deserving B. A. or Sau Tsoi. Usually four Yau Kung Shang degrees are given to each Prefecture in the Province.\n\n(9.) Fan To (訓導), a Sub-director of Studies. In every Prefecture Department and district in a Province there is an officer (and often an assistant attached) who acts as registrar and superintendent of the candidates for the B. A. or first degree. They are sometimes also placed in charge of the Confucian Temples, where they often expound the sacred edict of Hong Hi. A Director of Studies in a Prefecture is called Kau Kun (教官), in a Department Hok Cheng (學正), and in a district (as here) Kau Ü (教諭). A Kau Ü's assistant is called Fan To (訓導). These posts are usually held by Kü Yans and occasionally bought for some 600 or 700 taels. The position is one of considerable dignity and standing.\n\n(10) The Manchoos and bannermen are admitted to the Civil and Military examinations, but it is very rare to find them competing in the Civil examinations. The majority of them enter as candidates in the Military examinations.\n\n(11) Tsam Fa (簪花). This refers to a ceremony in vogue in all the Provinces. When a Civil or Military Sau Tsoi or B. A. has obtained the second or M. A. degree, he is entitled to be entertained at a banquet by the officials of the Province, usually by the Fu Toi or Governor. This banquet is called the Luk Meng In (鹿鳴宴) because an ode of poetry of that name is sung at it, and in Canton is given in the Governor's Yamen. Before sitting down to the feast the Kü Yans kneel down before the Fu Toi who calls an officer called a Tsun Po Kun (巡捕官) and gives him a small bouquet of gilt tinsel flowers and this official puts them in the hats of the Kü Yans. This ceremony always takes place three days after the publishing of the examination list. Similarly, Civil and Military Kü Yans on obtaining the Metropolitan or Tsun\nSz degree are entertained at a feast in the Palace by the Emperor which is called the King Lam In (皇林宴) or Peking banquet. Sau Tsois or B. A.s are also entertained by the Prefect of their administrative division at a banquet called the Kan In (芹筵) or water-cress banquet on obtaining their degrees.\n\nWAI SENG GUIDE BOOK B.\nNew Edition, the 18th year of Kwong Sü.\n(Cover.)\n\nYing Tak District.\n\nA new book for those who seek fame and riches.\n\nPage 1.—List of candidates who were examined in the Ying Tak District by the local Magistrate in the Examination Hall placed in the division marked T'in (天)(1) in the 18th year of Kwong Sü together with the name of the first on the list.\nYeong Yat Fan, the On Shau (案首) or On Ün (案元) head of the list.\n\nHu Tsing I.\n\nLai Shung Kwong, &c., &c. Here follows a list of the names of 97 more students who were examined in the T'in (天) class.\n\nPage 2.—After this follows the names of 30 more students who were placed in the division marked Ti (地).\n\nPage 3.—A complete list of the surnames of those who were examined in the district examinations of Ying Tak, in the 18th year of Kwong Sü. The surnames are all classified for convenience of reference.\n\nUnder character or class T'in (天) = Class I.\nChü Wing Wa (1) /o, /o, /o, /o, &c., &c.\n\nUnder character or class Ti (地) = Class II.\nChü Pat Fan 6°, 3°, 2°, 2°, 2°.\n\nUnder character or class Ün (立) = Class III.\nChü Fung Yan 4°, 5°, 5°.\n\nHere follows a long list of several hundred names just as above.\n\nNOTES TO GUIDE BOOK B.\n\n(1) In all Examination Halls in China the thousand characters found in the Chinese Tsin Tsz Man (千字文) or Millenary Classic are employed instead of the numerals to mark the place or class of the tables or cells where the competitors write their essays.\n\n(2) The Tong Shang (童生) or students who wish to present themselves for the first or B. A. examination, have to pass preliminary examinations before the Magistrate of their own district and the Prefect within whose territorial jurisdiction their district lies. The student who takes the first place on the list at these preliminary examinations is called an On Shau (案首) and as the On Shau is almost certain to get his\nB. A. degree when examined later on by the Literary Chancellor of the Province, his name is, of course, always picked out by stakers on lotteries for the District B. A. examinations. In the same way the Prefect selects an On Shau at the preliminary examinations he holds. This On Shau may or may not be the same as that selected by the District Magistrate, but both are sure to get a place in the first Provincial or B. A. examination held by the Literary Chancellor. Many Wai Seng firms taboo the names of the On Shaus.\n\n(3) Chü Wing Wa /o /o /o /o /o /o. In each of the seven preliminary examinations held by the District Magistrate and Prefect, there are seven different papers set. The candidates are divided into classes of fifties in order of merit. Thus the first fifty (including the On Shau) in one subject would be marked /o; any one placed in the next fifty would be marked /o and so on. Thus in the present case Chü Wing Wa went in for five examinations out of the seven and got placed in the first fifty in five subjects. Very few, if any, candidates, except those who try to be the On Shau, pass or enter for all the seven preliminary examinations. But the three first examinations out of the seven, must be passed by all the candidates both before the Magistrate and Prefect before they are entitled to compete at the Prefectural or B. A. examination before the Literary Chancellor or Hok Toi (學台). The Prefect's system of marking and classifying the successful students is the same as that described above. Of course very large numbers of candidates are ploughed by the Magistrate and Prefect and not allowed to go up for the first degree. Many candidates offend, from inexperience, against the literary courses; many too, who have no chance whatever of passing, go up for these preliminary examinations as it is made an excuse for borrowing money for expenses either from the trustees of the ancestral property in the towns and villages or from relatives and friends. The seven examinations held are all directed to testing the result of the candidates in writing essays and composing poetry, different subjects or texts being set every day.\nPage 1.—A list of all the Civil Kü Yans or M. A.s of the Kwong Tung Province who attended the 3rd examination at Peking in the 18th year of Kwong Sü at the Yam Shan examination.\n\nLi Wai Sam, Pun-Ü district, passed in the Ki Mau year, was 49th name on the list, age 41, on the established list.(1)\n\nLi Shin Ün, Nam Hoi district, and Lam Sang (2) or salaried B. A., passed in the Ki Mau year, was 12th name on the list, age 37.\n\nLi Kin Fan, Shun Tak district, a Lam Sang (2) or salaried B. A., passed in the Yam Ng year, was 49th name on the list, age 27.\n\nLi Cheung Meng, Shun Tak district, a Kam Shang (3) or Northern B. A., passed in the Kap Tsz year at the Peking examination, was the 234th name on the list.\n\nLi Sz Fan, Heung Shan district, a Kong Shang (4) or senior B. A., passed in the San Yau year.\nPun Po Hong, Pun-Ü district, a Kun Shang\\(^{(5)}\\) or official graduate, was the 37th name on the list, age 30.\n\nYeong Ü Fan, a B. A. selected or fixed upon by the Ying Ün college as worthy of a degree\\(^{(7)}\\), Nam Hoi district, on the established list, passed in the Kwai Tsz year, head of the list or Kai Ün\\(^{(6)}\\), age 34.\n\nOn the following pages comes a list of several hundred more names similar to this. They are arranged in order, so many of one surname being classified together. At the end of the book, the surnames which occur only once are all placed in a separate list. On the last page of the book, following the enumeration of all these surnames, is written:\n\n\"This is a list copied from the records of the Provincial Treasurer of all the Kū Yans or M. A.s who have applied for permits to proceed to the Metropolitan examination, from the 23rd day of the 12th Moon. If any more applications for permits are made, the firm will print a supplement containing the names of the applicants.\"\n\nNOTES TO GUIDE BOOK C.\n\n\\((1)\\) \\((2)\\) \\((3)\\) \\((4)\\)\n\nSee Notes to Book A.\n\n\\((5)\\) A Kun Shang (官生) See Notes to Book A.\n\n\\((6)\\) See Notes to Book A.\n\n\\((7)\\) In most Provinces, there are numbers of celebrated colleges where students may board and lodge or live at home and only attend lectures and examinations at, under the superintendence of some literary professor of high standing with a view to reading for literary degrees. It is very difficult to obtain admission to these colleges, as the matriculation is often very strict. The college tutors are paid by the Provincial Government, and the most deserving students are rewarded for excellence in their work. These colleges or Shū Yün\n(書院) are mostly supported by endowments from the Government. Thus in Canton the Ying Ün Shü Yün (應元書院) receive students chiefly to study for the B. A. or first degree, the Üt Wa Shü Yün (粵華書院) is chiefly confined to Kü Yans or M. A.s reading for Metropolitan examination. The great college called the Kwong Nga Shü Yün (廣雅書院) founded by CHANG CHI TUNG, the late Viceroy, has accommodation for 400 students, 200 rooms being allotted to Kwong Sai men and 200 rooms to Kwong Tung men. The heads or wardens of these colleges are called Shan Cheung (山長) or Yün Cheung (院長) and are always men of the highest literary attainments or graduates celebrated as \"coaches.\" When a student or graduate is about to enter for one of the examinations, the Shan Cheung will examine him, and, if worthy, publish his name as a candidate or graduate who is fixed on, or selected as sure to get his degree. This, of course, is of little use to the student in the actual examination, as the examiner then presumably knows nothing of this, but a knowledge of it is useful to the public who buy Wai Seng as a proof that this student or graduate is a man of real ability.\n\n(8) All Kü Yans or M. A.s proceeding to Peking for the Metropolitan examination must first go to the Provincial Treasurer of the Province they belong to, and obtain from him a Man Pang (文憑) or testamur stating the marks by which the applicant may be identified, where he lives, who his family is, &c. Without this certificate the Lai Po (禮部) or Board of Rites in Peking will not recognize a Provincial Kü Yan. The Kü Yan also draws about 20 taels from the Provincial Treasurer for expenses for the journey to Peking and back. Accordingly, the records of the names of the Kü Yan kept in the Treasurer's or Fan Toi (藩台) office are sure to be trustworthy.\nPage 1.—A list of the Civil B. A.s or Sau Ts'ois (秀才) who passed an examination in the 13th year of Tung Chi under the presidency of His Excellency Cheung in the Shiu Chau Prefecture in the first year of the examinations held by him.\n\nIn the Prefecture of Shiu Chau.—Lo Sz Ying, &c., &c., &c.\n\nIn the Kuk Kong District.—Tang Lun Sau, &c., &c., &c.\n\nIn the Ying Tak District.—Chan Ki Fun, &c., &c., &c.\n\nIn the Lok Cheung District.—Chu Kin Piu, &c., &c., &c.\n\nPage 2.—A list of all the B. A.s or Sau Ts'oi graduates who were passed in the Shiu Chau Prefecture in the second year of Kwong Sü by His Excellency Ng in the second year of the examinations held by him.\n\nHere follows a list of the names of the B. A.s and of the different districts to which they belong—just as above.\nYing Tak District.—Pang Iu Tsung, Ka Ngak.(3)\nKuk Kong District.—Ch'an Po Sin, Kwong Ngak.(4)\nSiu Chau Prefecture(5).—Sin Keng Pong; and so on as before.\n\nNOTES TO GUIDE BOOK D.\n\n(1) Candidates are termed Tsun Sau (俊秀) or man of promise, before they have passed any examination; Tong Shang (童生) or student, when they have matriculated, so to speak, or get a certificate from their District Magistrate; Sau Tsoi (秀才) or B. A., when they are passed by the Literary Chancellor (學台) of their Province.\n\n(2) The two examinations held by a Hok Toi or Literary Chancellor during his three years of office in a Province are called in order Sui Hau (歲考) and Fo Hau (科考), and the third year in which there is no examination for the first or B. A. degree is called the Tai Fo Hau (大科考).\n\n(3) Ka Ngak (加額), an addition to the established number of degrees, or Hok Ngak (學額) for an administrative division. Such additional degrees are often given by the Government to various districts for special reasons, e.g., a rich merchant may assist the Government with money and ask for an addition of a degree or two to his district in return for his services. Such additional degrees have also been given in return for military services. Naturally any person who is fortunate enough to get additional degrees for his district, acquires no little distinction amongst his fellow district men.\n\n(4) Kwong Ngak (廣額) an extension of the established number of degrees. This refers to exactly the same system as that mentioned in Note 3, with the difference that the Kwong Ngak is a still further extension of the Ka Ngak, e.g., if two Ka Ngak degrees have been granted to a certain\ndistrict over and above what is called the Wing Ngak (永額) or old established number, and, for further reasons, another degree in addition is further given, the third degree is called Kwong Ngak, i.e., a still further extension of the Ka Ngak.\n\n(5) To every Prefecture in a Province as well as to the various districts which go to make up the Prefecture, a certain member of degrees are given. These are called Fu Hok (府學).\n\n---\n\nWAI SENG GUIDE BOOK E.\n\n(Cover.)\n\nList of the Tong Shang (童生) or students (1) who were examined in the classics (2) together with the students who were classified as \"pearls left out of the list\" (3) at previous B. A. examinations.\n\nPage 1.—List of students, Man Tung (文童), who were examined in the Classics by His Excellency Ip, in the 11th year of Kwong Sü.\n\nKuk Kong District.—Lau Po Tsang.\nYing Pak District.—Chan Sing Fai.\nNo students came forward from the Lok Chiong District for examination in the Classics, and there were no \"pearls left out of the list\" in the above districts.\n\nList of students of the Shiu Chau Prefecture who were called up for re-examination in the Classics in the 11th year of Kwong Sū.\n\nKuk Kong District.—Tsang Yat Fu.\nLok Cheung District.—Wong Shan Cheng, &c., &c., just as before to the end of the book.\n\nNOTES TO GUIDE BOOK E.\n\n(1) All literary men while still in *statu pupillari* or till they get a degree are called Man Tung or Tung Shang (文童 or 童生) or \"students.\" The term is usually only applied to those who have entered at the District examinations and not yet passed the first or B. A. examination.\n\n(2) The list of candidates at the first or B. A. examination called \"unselected pearls\" or \"pearls left out of the lists\" (遺珠), answers to the Fu Pong (副榜) or supplementary list of Kü Yans in the second or M. A. examination. These \"pearls\" are like a *proxime accessit*. The number is quite uncertain, not like the Fu Pong of the second examination, in which the number of *proxime accessitis* is limited to 14. It is left to the Hok Toi or Literary Chancellor to pick out as many \"pearls\" as he thinks fit. It is, of course, important for the Wai Seng staking public to know who these pearls are as they are nearly sure to get a degree at the next examination.\n\n(3) Keng Ku (經古) or the examination in the Classics is held by the Literary Chancellor or Hok Toi shortly before the examination for the first degree or B. A. It is a kind of preliminary examination for that degree inasmuch as it is stiff and chiefly confined to an accurate knowledge of the text and commentaries of the nine Classical books. The names of the\nstudents who are considered \"passed in the Classics\" by the Hok Toi or Literary Chancellor are published by him, and these fortunate students are pretty sure to get a degree at the B. A. examination that follows immediately after the Keng Ku. Wai Seng stakers when staking on the results of a B. A. examination always look out sharply for the names of those who have passed in the Classics. Many firms divide their stake books into two classes—those closed before and those closed after the publishing of the list of successful passmen in the \"Classics.\" In addition to questions on the Classics, papers on general knowledge are often set. There is a Keng Ku examination also held by the Hok Toi for graduates of the first degree.\n\n---\n\n**WAI SENG GUIDE BOOK F.**\n\n*(Cover.)*\n\nA complete list of the Kū Yans or M. A.s from the Canton Province who passed at the Peking Provincial Examination.(1)\n\n---\n\n*Those who buy this book should look into it carefully. The Lun Yuk Lan Shop in the 8th Ward in the City of Rams (i.e., Canton).*\n| Cheng Ju Kwan | Ho Tseng Fu | Loi Peng Sham |\n|---------------|-------------|---------------|\n| 219th name Chiu Yeong district. | 91st name Siu Heng Prefecture. | 7th name Pun Ü district. |\n\n| Chan Ting Tsun, | Shek Wo Kwan, | Chan Wa Kwan, |\n|-----------------|---------------|---------------|\n| 245th name on the list, Sun I district. | 111th name on the list, Pün Ü district. | 58th name on the list, San Ui district (now a Tsun Sz.) |\n\n| Chan Kwok Leung | Sün Peng Kwai, | Yeung Mo, |\n|-----------------|---------------|-----------|\n| 292nd name Tsang Sheng district. | 108th name on the list, Kit Yeung district. | 78th name on the list, Ying Tak district. |\n\nThe Yam Sut year in the first year of the reign of Tung Chi. The names of 9 Kü Yans or M. A.s from the Canton Province who passed at the Peking Provincial Examination.\n\n**NOTES TO GUIDE BOOK F.**\n\n(1) The degree of Kü Yan or M. A. is easier to obtain in the Provincial examination held at Peking because the number of candidates is fewer and the number of vacancies greater than in the other Provinces. Thus there is only one Kü Yan degree given to a hundred or more licentiates in Canton and five or more to a similar number in Peking. The class of\nmen who attend the Pak Wai (北關) or Northern examinations are usually the sons of wealthy people. The great majority of the B. A.s who enter for the Northern M. A. degree are from other Provinces and first purchase the Kam Shang (監生) degree at the Kwok Tsz Kam College, Peking. This degree enables them to compete direct for the Chik Ta Provincial degree.\n\n---\n\nWAI SENG GUIDE BOOK G.\n(Cover.)\n\nEssays of Kü Yans from the Canton Province recommended by the Eighteen Assistants (1) at the Metropolitan Examinations.\n### ALREADY PASSED.\n\n| Kong Tsin Au | Ng Shu Mui, Under-Secretary to the Board of Rites. |\n| San Cheung Tsin | Wan Lam Chan Hung Department, San Mi year. |\n| Chung Ü Kwai | |\n| Shek Sam Nam | |\n| Sheng Shui Hoi district. | |\n\n**Same as above and so on through the book to the end.**\n\n| Chin Li Lau | |\n| Tsung Fung Tung | |\n| Lin Sham Shu | |\n| Tsang Shun Nam | |\n| Sheng Tak Hoi district. | |\n\n**Prepared for Examination.**\n\n| Cheung Chu | |\n| Kai Peng | |\n| Peng Kwan | |\n| Nam Hoi San Ui district. | |\n\n---\n\n### NOTES TO GUIDE BOOK G.\n\n(1) In the examination for the various degrees, the Chief Examiner is assisted by several Assessors. Thus in the first degree the Literary Chancellor, on his appointment, engages graduates of the first, second and third degrees, usually friends and connections, to proceed with him to the Province to which he has been sent, to aid in correcting essays and selecting the best candidates.\n\nIn the examination for the second degree, the Chief Examiner and Assistant Examiner is helped by thirteen Assessors called the Shap Sam Fong (十三房). These Fong Kun (房官) see the compositions of the graduates and students before the\ntwo examiners do, and hand up a certain number for them to finally select passmen from. So, too, in the third examination, there are 18 Assessors (as here) called the Shap Pat Fong (十八房)\n\n(2) Tsin Cheung Ü was \"passed\" Chung (中) by the examiners.\n\n(3) Pi Chung (備中) prepared to pass. This means that Chu Kwan Peng's essays were amongst those accepted by the two examiners out of those recommended by the Fong Kun (房官) or Assessor Ng Shu Mui, but that the examiners did not, for some reason (probably because there were already a full number picked out to fill the vacant degrees) give him a degree. Wai Seng stakers, of course, spot a man who is \"Pi Chung\" and select his surname for their lists. In some Wai Seng Guides graduates are also said to be \"Pi Shi\" (備試) or prepared for examination. This means that their compositions were selected by the Fong Kun as possessing merit, and put on one side for the acceptance and selection of the Grand Examiner and Assistant, if the first batch of essays and writings presented by them were not sufficient or rejected as inferior.\nNOTES TO GUIDE BOOK H.\n\nThe Preliminary Examination or Fuk Shi (覆試) takes place in Peking at the time of the triennial Metropolitan examination for the Tsun Sz (or LL.D.) degree: All the Kü Yans (or M. A.s) who passed at the Provincial examination in the Autumn of the previous year, have to present themselves at this examination in the Palace, Chiu Hau (朝考) as it is called. It is theoretically a test examination to make sure that the Kü Yans are really men of ability and have not got their degrees under any false pretences or by any unfair means. Practically it is not more than a formality previous to entering for the Ui Shi (會試) or Peking examination proper. The Kü Yans from the 18 Provinces of China are divided into several classes or \"Tang\" (等) according to their merit, and a man's position in the class list affords some index, to a certain extent, of his chances of getting a Metropolitan degree. In the list translated, only the names of Cantonese Kü Yan graduates are given (and this accounts for the irregularity in the numbering, e.g., the list goes from first name to fifth name, the intermediate names being those of men from the other Provinces) for, of course, the Wai Seng staker is only concerned with betting on the Kü Yan from Canton. The first name, however, on each class list or \"Tang\" is given whether the man is a Canton graduate or not, for general information. Only such Kü Yans as pass their Fuk Shi are allowed to enter for the final or Ui Shi examination.\n**THE WAI SENG LOTTERY.**\n\n**PAPER I.**\n\n*A Wai Seng Stake Book, Canton.*\n\n*(Cover.)*\n\n| Meng Sheng Li *(i.e., the name of the Wai Seng firm.)* |\n|--------------------------------------------------------|\n| The firm (Meng Sheng Li) is in the 7th Ward in the City of Canton. |\n| Kün Hau *(卷口)* or Volume Lo. |\n| The Examination for the Civil Kü Yan or M.A. degree for the Province of Canton held in the Kwai Tséz year by special Imperial grace. |\n\n*(Page 1.)*\n\n| The prize for the third winner is $100. | The prize for the second winner is $200. | The prize for the first winner is $600. | For the Volume Lo one dollar is paid. |\n|------------------------------------------|------------------------------------------|------------------------------------------|--------------------------------------|\n| 6 taels is deducted from this for printing expenses. | 13 taels is deducted from this for printing expenses. | 36 taels is deducted from this for printing expenses. | In all one thousand stakes have been received. |\n\nHere follows a long list of 69 surnames that the public are not allowed to select.\nFor determining the surnames of those who pass and of the first on the list (Primus) in the Civil Kü Yan examination for the Canton Province held by special grace of the Emperor in the Kwai Tsz year, the Cheng (榜) or actual Pong (榜) or list of successful graduates published by the officials is to be the final proof. Any degrees given by special favour or in addition (1) or extra (2) together with the ordinary established number are all counted.\n\nChinese Manchou bannermen and those who receive the degree of Kü Yan or M. A. by Imperial favour (3) together with the 69 surnames mentioned above as tabooed are not counted. Twenty surnames of any other of the candidates may be selected at will. If more than twenty are written, the extra ones will be cut out beginning from the end of the list of names. If less than twenty are written or if the same surnames are written more than once, or if any of the tabooed surnames are given, the fault rests with the staker. The first character in double character surnames is to be taken as the surname selected. The staker who selects the largest number of surnames of successful candidates is the winner. If two or more stakers select the same number of successful surnames then the one who selects the largest number of the names of all the candidates who have passed is the winner. If stakers select an equal number of successful graduates and an equal number of successful surnames, the prize is divided equally. Every Wai Seng volume contains 1,000 stakes. If the volume contains a lesser number of stakes, the prize awarded will be proportioned accordingly. From every tael awarded as prizes, the Wai Seng office deducts one mace for office expenses. The money for printing expenses together with discount of 2 taels 1 mace on every 100 taels is also deducted from the prizes. In every Wai Seng volume there are three prizes given. For ready money a Wai Seng ticket is given, and if the staker wins, the prize will be paid to him on its presentation at our firm. If credit is given by any one of our firm (4) and the money for the Wai Seng ticket is not\npaid in to us by him, the staker must hold that person responsible for payment of the prize. Gentlemen who trust our agents can buy tickets of them, but the money must be paid when the Wai Seng book is closed (i.e., usually when a 1,000 stakes have been bought). If the money is still owing (i.e., has not been paid by the agent to our firm) then no prize will be given, and if the staker loses, the agent has to pay up the money for the ticket in question. Notice of this is given beforehand to avoid disputes about the matter afterwards.\n\nRULES OF THE LOTTERY.\n\n(Page 3.)\n\n1. If the Wai Seng ticket or Kan (根) is broken and spoiled or the serial number pasted over and altered, or if the seal impressed by our firm is torn off, the ticket will be treated as null and void. If the Wai Seng ticket is lost, no prize will be paid.\n\n2. The printing of Wai Seng books is entrusted by our firm to others. No matter whether characters are written with too many or too few strokes, or not printed in full or printed obscurely, or whether one character is written in several ways, or whether the common or classical form of the character is written or whether characters are inverted in printing—in all these cases, the characters in question as found in the book are still to be reckoned as correct. The public are not to complain that the characters are not written in accordance with the official or clerkly style.\n\n3. As soon as the surnames selected by the public are written down in our manuscript Wai Seng staking book, no one can have them back to add to or alter them, and so cause delay to the issue of the books. If there are characters in the original list of surnames presented by the staker which are erased and others written for them, the Wai Seng firm will not be responsible for anything arising out of this.\n\n4. The Wai Seng firm will do its best by repeated careful revisions, to ensure accuracy in getting the lists of surnames printed correctly in the Wai Seng stake books. Still\nit is impossible that we shall succeed in revising all correctly. Compensation, therefore, will be made to the stakers in accordance with the following scale:—For one character printed wrongly in the Wai Seng book, for every mace invested in tickets, two candareens (20 per cent. of the stake) will be paid back; if two surnames are printed wrongly for every mace invested, four candareens (40 per cent. of the stake) will be paid back; if three surnames or over ten surnames are printed wrongly, the same compensation as for printing two surnames will be given. If two surnames repeated are only printed once, or if any of the tabooed surnames are printed by mistake, or if the number of surnames selected is printed short of a few characters, in all these cases half of the money invested by the staker will be paid back. If in the hurry and press of printing, the surnames selected are inserted in the wrong volume, then if this wrong volume is a dearer priced one than that really bought by the staker, and into which his list of surnames should have gone, the necessary deduction will be made in paying prizes; if this volume is a cheaper priced one, then the necessary addition will be made. We make a provision, however, that whenever the original list of surnames presented by the staker is written obscurely, no compensation will be given for characters printed twice or printed incorrectly.\n\n5. If the Wai Seng firm chances to lose the surnames selected by the stakers, other surnames likely to be successful will be selected by the firm itself on behalf of the stakers and put in instead. If any mistake is made over the serial number of the ticket by one character being put before or after the other out of its place and the serial number in the book does not agree with the index number on the ticket, still the characters in the book under this number are to be reckoned correct. If these characters do not satisfy the staker, on the book and ticket being returned, the original stake will be paid back. This must be considered a misfortune that cannot be helped and no one will be permitted to take advantage of this and make it an excuse for asking us for compensation or insisting on the characters on his original list being reckoned.\nIt is our settled custom to deal with the case in this way and reckon the characters actually in the Wai Seng book as the correct ones.\n\n6. The Wai Seng firm does not print the names of the stakers over the surnames selected in the Wai Seng book. These lists of surnames are all arranged in series under the heads of the indexing characters contained in the Tsin Tsz Man (千字文).\n\n7. The preparation and binding of the Wai Seng books is entrusted to others; if owing to press of work or hurry, several pages of one book are inserted in another, or if some books have too many and other books too few leaves inserted, or if the cover of the book is pasted on the wrong book, or if the character which passes as the serial number of the book is printed wrongly, the public are requested to bring the book back at once and change it. If the book is not brought and changed our firm will deal honestly with the public in the matter. No one may make this an excuse for causing trouble and extorting money.\n\n8. All Wai Seng books are distributed to the stakers within the space of five days after the books are closed on presentation of the receipt form given to the stakers when their lists of surnames were handed in. If the public come too late to get their books, or if, in the case of misprints, they do not come and report, it will be considered as their own fault and no compensation will be paid, and in the latter case, the characters printed in the books will be reckoned as correct.\n\n9. As soon as the names of the graduates who have passed and the amount of the prize due to the stakers are known the winners should come at once to our firm and report their names so that we may make enquiries and compare the tickets and books. The list of successful candidates sold by people in the streets will not be accepted as correct, and no one may employ them as an excuse for extorting prize money falsely. The official list of graduates posted on the wall fronting the Governor's Yamen is to be accepted as final evidence. Fifteen days after the ceremony of Tsam Fa (簪花) when full enquiry\nhas been made, the prizes will be paid on presentation of the receipt given by us for the surnames selected. If after the books have been distributed, some accident happens and we are prevented from holding this particular lottery, the expenses incurred for printing will be deducted from the money staked and the remainder given back to the stakers. Our firm will not act dishonestly, but be perfectly straightforward and just in this matter. If you are satisfied, gentlemen, with these rules, we propose to open our lottery. If you doubt our integrity, pray do not honour us with your custom.\n\n**Remarks on the Rules.**\n\nThese rules are, as it were, the contract between the staking public and the Wai Seng proprietor. They speak for themselves and call for little comment. Although here are most elaborate provisions made by the proprietor against various contingencies occurring both to protect the Wai Seng firm from extortion and to safeguard the interests of the public, as a matter of fact very few of these cases ever do arise. The rules on the whole seem fair and are strictly abided by. Very few errors are ever made in the printing and binding, because the printing firms in question are paid very highly for the work they do and keep an extra number of hands on to revise Wai Seng books before they leave the shops, when they are again revised by the Wai Seng firm and its agents. Fair compensation is given in certain cases (see rules 4 and 5), when the Wai Seng firm is to blame for serious errors. If by any chance (of course a most unlikely contingency) a staker's list of surnames is lost, the firm selects another list for him and puts that in instead. This rule looks shaky at first sight, but is perhaps necessary, as it would never do to allow the stakers to bribe clerks in the Wai Seng firm to mislay their papers in order to let them send in other lists of surnames in the place of that lost at the very last moment. If a real case of the kind occurred, the Wai Seng firm (which has the very best Hong Tsing (行情) or information about graduates and their chances of success, would be bound in its\nown interest as a matter of good name, to give the staker whose list was lost fairly good list of surnames in place of the list lost.\n\nRule 9 states that the Wai Seng firm will not accept as true the class lists sold in the streets. This refers to the class lists prepared by the bookshops in Canton that deal almost entirely in Wai Seng literature. The best known of these shops are the Lun Yuk Lau (麟玉樓), Tsoi Keng Tong (載經堂) Wong Man Ying (黃文英), and Sam Ün Tong (三元堂), nearly all situated in the western suburbs of Canton.\n\nWhen the Provincial degrees (B. A. and M. A. or Sau Tsoi and Kü Yan) are given, agents from these shops get the earliest information from the Examination Hall (some of these men actually wait on the roofs of the Examiners’ room and tick off the successful names as they are read out aloud) and return with it to their shop, which immediately prints a class list. As thousands of stakers are burning to know whether they have got a prize or not, these lists or Shi Luk (試錄), sell immensely. But the Wai Seng firm, in order to protect itself against possible mistakes and against objections being raised to successful graduates, refuses to accept these Shi Luk as final. In the case of the first Provincial examination, only the class lists published by the Hok Toi or Literary Chancellor in his office, and in the case of the second M. A. examination by the Governor in his office are accepted. In the case of the Metropolitan examination, the class list as published in the Pekin Gazette is accepted.\n\nThe end of Rule No. 9 deals with the possibility of the Wai Seng firm being suppressed by the Government or of its being found impossible to carry it out owing to some great calamity, such as a fire and a famine, epidemics or inundations. The rules, as a whole, are very comprehensive and ensure the proprietors of Wai Seng firms against every conceivable loss, and are not, as far as I can see, unfair to the public. As far as trickery goes in manipulating Wai Seng lotteries, it is open to the buyer of stakes as well as to the Wai Seng proprietor to\nbribe both the examined and the examiners; and although the Wai Seng proprietors with their big capital can bribe more heavily, they dare not habitually do anything very outrageous in the face of the keen and intelligent interest taken in their proceedings by a discerning public, because this would get them into difficulties with the officials, and expose the firm to the chance of being heavily fined.\n\nNOTES TO PAPER I.\n\n(1) \"Book expenses\" or \"Book money\" properly refers to the expenses of printing. It is a periphrasis in other words for \"commission.\"\n\n(2) See Note 4 to Book D.\n\n(3) The degree of Kü Yan or M. A. is occasionally given to candidates of 80 years or upwards who have competed unsuccessfully at several prior examinations; and by decree it is also given to Sau Tsoi or B.A. whose family has assisted the Government by contributing largely to its resources in famines, inundations and other times of danger. Sons of eminent statesmen too occasionally get the Kü Yan degree given them by special decree as an act of grace.\n\n(4) In the Straits, most Wai Seng tickets are bought on credit. Many big trading houses keep regular running account with the various Wai Seng firms. In Canton, ready money is paid in most cases and discount given for it. Both in the Straits and in Canton, the Wai Seng Kong Sz is very firm about insisting on every one, who has bought on credit, paying up directly a book is closed. The confidence of the public in the agents whom they get tickets from on credit, in the first place, has not, as far as I know, been abused in the Straits. The agent acts honestly both to the public, to whom they pay the prizes won, and to the Wai Seng firm, to whom they pay in the stakes collected by them. If the agent does not pay in the money he has collected to the Wai Seng firm, he is cashiered, and the firm refuses to pay any prizes won by the public who have bought the agent's tickets. This would, of course, be little compensation for embezzlement by an agent on\na large scale. If the staker is dishonest and cheat the agent by not paying for the ticket he has got on credit, the Wai Seng firm suffers no loss and the agent is bound to pay up the stake for the defaulter under penalty of being dismissed.\n\nPAPER II.\n\nA Wai Seng Stake Book, Singapore.\n\n(Cover.)\n\nThe 1,000 character classic for the education of the young.\n\nThe (examination for the) Military Degree Tsun Sz.\n\nSerial number Tsin.(1)\n\n(Page 1.)\n\nA knowledge of Chinese characters is very necessary and very important. As to the origin and invention of Chinese characters, we find that the discovery was due to the two ancient worthies TSONG and TSU, and the rules of conduct of their times became a pattern for after ages to follow. Moreover the languages spoken by men are all different, but one single written character can be made to answer the necessities of social intercourse. Men may be separated in distant lands a long way one from the other, but a few written lines enable them to communicate their feelings the one to the other. The use of the written character is indeed great. Accordingly we have printed a collection of characters of an elementary type and trust that the gentle reader will study them. The above notice is given for the information and convenience of the general public.\n(A new rule is now in force that six candareens (are to be deducted) from every dollar for office expenses. As to the rest, everything is to be in accordance with the established regulations.\n\n| Tsun | $2. |\n|------|-----|\n| Yut = 10 | Chan Li Wong Ho Cheung Cheng Yeong Hung Luk Lam Kwong Tong Hu |\n| Yat = 9 | Chan Li Wong Ho Cheung Cheng Yeong Hung Luk Lam Kwong Tong Hu |\n|      | Chan Li Wong Ho Cheung Cheng Yeong Hung Luk Lam Kwong Tong Hu |\n\n|     | Fong | Hung | Chau | Ün | Wong | ün | Tin |\n|-----|------|------|------|----|------|----|-----|\n| Yut = 10 | Chan Li Wong Ho Cheung Cheng Yeong Hung Luk Lam Kwong Tong Hu |\n| Yat = 9 | Chan Li Wong Ho Cheung Cheng Yeong Hung Luk Lam Kwong Tong Hu |\n|      | Chan Li Wong Ho Cheung Cheng Yeong Hung Luk Lam Kwong Tong Hu |\n\n| Chan Li Ho Weng | Chan Li Wong Ho Leung | Chan Li Ho Leung | Chan Li Ho Leung | Chan Li Ho Leung | Chan Li Ho Leung |\n|-----------------|----------------------|------------------|------------------|------------------|------------------|\n| Lan Lau Pat Iu  | Fong Fong Fong Fong   | Hung Hung Hung    | Alung Fung Fung  | Lau Laung Lau    | Ng Ng Ng Ng      |\n| Chei Chau Chau  | Chau Chau Chau        | Chau Chau Chau    | Chau Chau Chau   | Chau Chau Chau   | Chau Chau Chau   |\n| Tsang Tsang Tsang | Tsang Tsang Tsang | Tsang Tsang Tsang | Tsang Tsang Tsang | Tsang Tsang Tsang | Tsang Tsang Tsang |\nNOTES TO PAPER II.\n\n(1) The character Tsin (賤) is the number of the volume or Kün Hau (卷口), i.e., shews the number of the present Tsin Volume in the series of volumes issued by the firm for the examination in question.\n\n(2 & 3) The words Tin (字軌) &c. are the Tsz Kwai (字軌) or index number, the words underneath in each column Chan Li, &c. are the 14 surnames selected by stakers.\n\n(4) The character Tsun (秦) (one of a series) is used instead of a numeral by the Wai Seng firm to number the Wai Seng volume or Küns (卷) as they are made up.\n\nThe $2 means that this Wai Seng book or Kün is a $2 prize book.\nOur firm is in the Great Street of the new Country (i.e., Johore) in the city of Canton in the Kwong Tung Province.\n\nThe Primus (a) selected by the Prefect and District Magistrate are not among the taboosed surnames and may be staked on with the rest.\n\n| The B. A. or Sau-T'soi Examination in the three districts of Kit-Yeong, Chi'iu-Yeung and Hoi-Yeung. |\n| --- | --- |\n| If any one buys tickets for others and comes to Jo-hor with ready money to get them, he will get a commission of $3 on every book, if he pays attention thereto in every respect, then in every case, the young and old are treated fairly in this matter. |\n| Kono Ta'i Hsing. |\n| (Name of the Wai-Seng Lottery Firm.) |\n\n| Price 50 cents. | Price $2. |\n| --- | --- |\n| Price $1. | Price $3. |\n\nHere are printed the conditions of the Lottery. They are translated below, Section II. See over the page.\n\nSixty-six surnames are written here.\n\n| Price of the goods (a) |\n| --- |\n| Price $5. |\n\nA bonus ($5) of $10 will be given to the first winner in the $5 volume series, and a number of prizes in the $1 volume series.\n\nWe begin selling tickets today. Ready money must be paid.\n\nThe Wai Seng books that are filled up first will be distributed first. The books that are made up later will be distributed before the list of the students who have passed in the classics is published. (1)\n\nA few of the surnames are given here.\n\nHere follows a list of 143 surnames.\n\nThe surnames are too many to be all printed.\n\nTaboed surnames.\n\nA translation of this section is given over the page Section I.\nTHE WAI SENG LOTTERY.\n\n(Section I.)\n\nA list of the first ten names arranged in order of merit as selected respectively by the Prefect and Magistrate at the two preliminary examinations for the B A. degree in the three districts of Hoi Yeung, Ch'iu Yeung and K'it Yeung.\n\n| Section I. | The 3 On Shau or heads of the list (3) selected by the Magistrate in the Hoi Ch'iu K'it districts. | The 3 On Shau or heads of the list (3) selected by the Prefect in the Hoi Ch'iu K'it districts. |\n|------------|-------------------------------------------------------------------------------------------------|-------------------------------------------------------------------------------------------------|\n|            | Chau Man | Cheng Meng Tak | Lò I | Chau Man | Cheng Tso Sheng | Wong Ki Un. |\n| Yau ²      | Chiu ²    | Wong ²         | Cheng ² | Cheng ² | Lam ²          |\n| Kwok ³     | Iu ³      | Lau ³          | Lam ³  | Chang ³ | Lò ³           |\n| Hü ⁴       | Lam ⁴     | Lai ⁴          | Sün ⁴ | Chiu ⁴  | Chan ⁴         |\n| Ch'an ⁵    | Cheung ⁵ | Ch'an ⁵        | Yau ⁵ | Ü ⁵     | Kó ⁵           |\n| Lam ⁶      | Lam ⁶     | Cheung ⁶      | Ch'an ⁶ | Cheng ⁶ | Ng ⁶          |\n| Un ⁷       | Liu ⁷     | Ch'an ⁷        | Lam ⁷ | Iu ⁷    | Ch'an ⁷        |\n| Li ⁸       | Hü ⁸      | Wong ⁸         | Hü ⁸  | Hü ⁸    | Lau ⁸          |\n| Yeung ⁹    | Iu ⁹      | Lau ⁹          | Wong ⁹ | Cheung ⁹ | Che ⁹          |\n| Wong ¹⁰    | Wong ¹⁰   | Chim ¹⁰        | Chau ¹⁰ | Siu ¹⁰  | Sham ¹⁰        |\n\n(Section II.)\n\nFor determining the surnames of the successful candidates for the B. A. or Sau T'soi degree in the Hoi Yeung, Ch'iu\nYeung, and K'it Yeung districts of the Teo Chiu Prefecture in the Yam Shan year, the official list of the B. A.s or Sau Tsois is to be final proof. In this list, degrees given in addition or extra, together with the Prefectural degrees and the ordinary established number of degrees, are all to be included. The candidates whose names are upon the examination list and who attend the Tsam Fa (簪花) ceremony (see Translation, Book A, Note ii) are alone held to be passed. If objections are raised to any graduate (4) and the matter is not immediately settled and the graduate's name is added to the list after the ceremony of Tsam Fa is over, such names will not be reckoned. Besides this, graduates from other Prefectures and other districts and graduates living in the districts (5) in question who do not belong to them, together with the above-mentioned 66 tabooed surnames, are all not reckoned. Under these limitations the public may select any other 20 surnames. If more than 20 surnames are selected, the extra ones will be cut off from the end of the string of names. If less than 20 surnames are written, or if the same surnames are written more than once, or if any of the tabooed surnames are selected, the fault rests with the staker. The first character in double-character surnames is to be taken as the surname selected. The staker who selects the largest number of the surnames of successful candidates is the winner. If two or more stakers select the same number of successful surnames, then the one who has the largest number of the names of all the candidates who have passed, is the winner. If stakers select an equal number of surnames and an equal number of names of all the successful candidates, the prize is divided equally. Every Wai Seng volume contains 1,000 stakes. If the volume contain a lesser number of stakes, the prize awarded will be pro rata. Every Wai Seng volume has 3 prizes. From every dollar paid in prizes 6 can-dereens are deducted for expenses. The printing expenses are also deducted from the prize money. Everything, rules and regulations, are in accordance with the old practice. Further particulars are not given here. If the public do not believe in our integrity we shall think ourselves lucky if they do not patronize us.\nNOTES TO PAPER III.\n\n(1) This refers to an examination in the Chinese classics held by the Literary Chancellor previous to holding the B. A. or Sau T'soi examination. In Canton, in lotteries for the B. A. or Sau T'soi degree, very often two sets of books are made up—one before the publishing of the list of those who have done well in the preliminary examination in the classics is published and one after the list is published (see Note 3, Book E).\n\n(2) This so-called \"goods\" are, of course, Wai Seng tickets, and a subterfuge to avoid detection.\n\n(3) The On Shau or first on the list selected by the Magistrate and Prefect at the preliminary examination are almost sure to be passed by the Literary Chancellor, as it would, from a Chinese point of view, be an implied insult to them were the Hok T'oi to reject their proteges or fancies.\n\n(4) Literally \"if there is an attack and overthrow,\" Kung Fuk (攻覆). No one of low or degraded antecedents can enter the Examination Hall to compete for degrees, e.g., the sons of prostitutes and actresses, the lictors and other base underlings in Chinese yamens, all kinds of play-actors, the boat people or Tan Kas in Canton, domestic slaves and their children, and people with natural deformities, lepers, &c. are not allowed to compete. Every candidate must shew a clean record, free from any taint of this kind, for three generations. If the candidate's antecedents are really shaky and he happens to pass, a protest is very often lodged against him by those who are acquainted with the real facts, and the man's degree is taken away if the facts are proved. Money, however, is always freely spent both to conceal such facts in the first place and to hush up the matter if it is discovered afterwards.\n\n(5) A bonus, P'o Kam (袍金), literally, robe-money. This giving of bonuses of $200 or $100, &c. to the winners of the first prizes in the dearer sorts of Wai Seng books is peculiar to the Straits. The idea, of course, is to induce the public to lay dearer tickets, and is usually resorted to by a firm when the business is dull or when the competition of other firms is very keen. A few years ago the Shi Li Wo (時利和) firm in Singapore gave as much as $300 away in bonuses on the $5 ticket books.\nTHE WAI SENG LOTTERY.\n\nPAPER IV.\n\nA Kai Chiu (街招) or Advertisement o\nTHE WAI-SENG LOTTERY.\n\nNOTES TO PAPER VI.\n\n(1) The figures 2, 1, 1, 1 written at the side of the surnames Chiu, Mak, Mui, Man, mean that 3 men of the surname Chiu and 2 men of the surname Mak, Mui and Man respectively have passed.\n\n(2) By looking through the Che Kau Tan (謝教單) one can see the amount of business done by a Wai Seng firm.\n\nThe following calculation shews how much money was staked. The figures are picked out from the original prize list, which is, of course, printed in full:\n\n$  c.\n23 books of the $10 series were made up,\neach book containing 1,000 stakes = 230,000 oo\n39 books of the $3 series were made up\neach book containing 1,000 stakes = 117,000 oo\n60 books of the $2 series were made up\neach book containing 1,000 stakes = 120,000 oo\nPlus a further number of 28 books of this series made up = 56,000 oo\n\nA Newspaper published by Yat Ki. (6)\n\nWe beg the public to point out any errors.\n### PAPER VII.\n\n*Tse Kau Tan* (謝教單) or *Prize List, Singapore.*\n\n| T. | Shu. | To. | Heng. | Fei. | Ka. | Chi's. | Ko. (3) | YAM SHAN YEAR. |\n|----|------|-----|-------|------|-----|--------|--------|----------------|\n|    | First prize. | First prize. | First prize. | First prize. | First prize. | First prize. | First prize. | The surnames of the B.A.s passed at the Lam Hoi, Pun-Ü & Shun Tak districts. |\n|    | 11 surnames, 27 graduates. | 12 surnames, 27 graduates. | 12 surnames, 27 graduates. | 11 surnames, 27 graduates. | 11 surnames, 27 graduates. | 11 surnames, 27 graduates. | Wa and Sek (3) divide into 2 shares. |\n|    | Ho T'sz Mang & Sin divided into 4 shares. | Divided into 22 shares. | P'ek and I divide equally. | Ch'eung sole winner. | Divided into 113 shares. | Tong Wai Sun Mat T'o Shan & Wok, divide into 7 shares. | Mau Ko Nga Mak Tó Lung Sham Chin Lai Au Wun U |\n|    | Second prize. | Second prize. | Second prize. | Second prize. | Second prize. | Second prize. | Second prize. | Twenty surnames, twenty-seven graduates. |\n|    | 11 surnames, 26 graduates. | 11 surnames, 26 graduates. | 11 surnames, 26 graduates. | 11 surnames, 26 graduates. | 11 surnames, 26 graduates. | 11 surnames, 26 graduates. | (4) Divided into 135 shares. |\n|    | Divided into 95 shares. | Divided into 405 shares. | Divided into 138 shares. | Divided into 128 shares. | Divided into 679 shares. | Divided into 115 shares. | |\n|    | Third prize. | Third prize. | Third prize. | Third prize. | Third prize. | Third prize. | Third prize. | |\n|    | 10 surnames, 25 graduates. | 10 surnames, 25 graduates. | 10 surnames, 25 graduates. | 10 surnames, 25 graduates. | 10 surnames, 24 graduates. | 10 surnames, 25 graduates. | Ts'ing sole winner. |\n|    | Ko Yau Kan Tip and Shak divided into 5 shares. | Divided into 656 shares. | Lok and Shang divide equally. | Lan Om T'in Fung & Ts'eng divide into five shares. | Divided into 655 shares. | |\n\n---\n\nTHE WAI SENG LOTTERY.\nTHE WAI SENG LOTTERY.\n\nNOTES TO PAPER VII.\n\n(1) The figures by the side of the surnames mean that four men of the surname Ko (高), four men of the surname Mak (麥), three men of the surname Lung (龍) passed.\n\n(2) The word Ko (高) is the Chinese character used to shew what the name of the Kün Hau (卷口) or Wai Seng volume is.\n\n(3 & 4) The characters Wa (華) and Sek (釋) are the Tsz Kwai (字軌) two of the characters of the Millenary Classic, used as a serial number to shew where the surnames selected by the two stakers come in the Kün Hau or Wai Seng volume. When more than half-a-dozen people or so share the prize, the prize list never publish all the serial numbers or Tsz Kwai (字軌), as it would take up too much space to print.\n\n(5) This is, of course, only an extract from the prize list. There are many more prizes won (continued on other sheets) exactly like this. The money staked on this particular examination (a B. A. or Prefectural one, the least important one) as calculated from the prize list (some of which is not printed here) comes to about $60,000.\n\n(6) Many of the Wai Seng firms in Singapore employed various names and styles in place of their real names—the second name or symbol used for the real name, as here Yat Ki (日記) used for the name of a lottery really called Wing Shiu Ts'eung (永兆祥), was always known to habitual stakers or explained by the touts and other lottery agents. The prize list is here called a \"newspaper\" to avoid detection.\nPAPER VIII.\n\nWai Seng Ticket.\n\nThe City of Canton.\n\nThe Civil Kü Yan Examination for Kwong Tung held by Imperial Grace.\n\nMENG SHENG LI.\n\nWhen gentlemen who patronize us pay ready money, they should come to the Wai Seng firm to buy their tickets. A chop denoting that ready money has been paid for the ticket will be impressed and it can then be presented at the firm for payment if a prize is won. If our agents give credit and issue tickets before the money for them is paid, these tickets will not be honoured, and the agent must be held responsible for the payment of the prizes. No one is allowed to produce such a ticket and come to the shop and ask for the prize money. Further, no prize will be paid to those whose tickets have the seal and writing torn and spoilt. Notice of this is given to avoid discussion about the matter afterwards.\n\nNOTES TO PAPER VIII.\n\n(1 & 2) Lo (羅) is the number of Kün Hau, Heng (卿) is the Tsz Kwai or catalogue number.\n\n(3) Buyers of tickets very rarely write their names in full on the tickets they buy. Usually a nickname is written or one of the character or characters of the name is given with the character Ki (記) \"style\" suffixed. This is probably because the Wai Seng business is not held in much repute amongst the respectable classes.\n\n(4) The other half of the seals is impressed on the counterfoil of the manuscript book of tickets kept by the clerk.\n### PAPER IX.\n\n**Wai Seng Ticket and Receipt Form.**\n\n*Wai Seng ticket or Kan (根) as sold in Singapore.*\n\n---\n\n#### Receipt for number 968.\n\nFor the Honorable Mr. Wino Li (name not visible).\n\nThe 9th Moon of the Yam Shan year Kwong Su.\n\nReceipt form.\n\n---\n\n#### Seal.\n\nCollected by Wong Ki (signature not visible).\n\nActual sum paid, $6.50\n\n---\n\n#### Wai Seng Ticket or Piu Kan (票根) as sold in Singapore.\n\n---\n\n#### The Yam Shan year Kwong Su.\n\nA share ticket received by Soo and Soo.\n\n---\n\n#### The Yam Shan year in the reign of Kwong Su.\n\nA ticket received by Soo and Soo.\n\n---\n\n#### The Great Seal of the New Canton Province (i.e., Johore), half of the seal being on the counterfoil.\n\nExamination in the Canton Province for the Civil Third Sz degree.\n\n---\n\n#### A share ticket issued by Shi Ki (signature not visible).\n\nOne ornamental piece; price, one dollar.\n\n---\n\n#### Money not paid.\n\n---\n\n#### (a) Triang.\nTHE WAI SENG LOTTERY.\n\nNOTES TO PAPER IX.\n\n(1 & 2) The character T'o (陶) is the number of the Wai Seng volume or Kün Hau (卷口), i.e., here T'o is used for the numeral 95. The character Tsang (增) is the term or Tsz Kwai (字軌) used for a numeral shewing where in the volume T'o, the surnames selected by the staker are printed on the second ticket.\n\n(3) This, of course, means that the ticket is a one-dollar one; the words \"share in a mine\" are merely put in to disguise the real nature of the document of the second ticket when the Wai Seng ticket is called an ornamental jade sceptre. Tickets are sometimes called \"boxes of tea\" Ch'a Siong (茶箱), rings Kai Chi (戒指), bric-a-brac Ku-un (古玩), and so on.\n\n(4) This number 5,505 refers to the number of tickets sold.\n\n(5) This number 506 refers to the number of the Wai Seng ticket in the Wai Seng book.\n\n(6) Heng Ki, Shi Ki, are abbreviated or symbolical ways of writing the names of the two firms Kung T'ai Heng (公泰興) and Shi Li Wo (時利和) in full. This is done to avoid detection.\n\n(7) Wong Ki (旺記) is also an abbreviated form of the agent (whatever his name was) who collected this money and paid it into the account of the Wai Seng firm. In Singapore, the great majority of tickets are bought through agents whom the public trust. If, however, the agent goes wrong and does not pay in the money to the Wai Seng firm, it refuses, of course, to pay the prizes.\nTHE WAI SENG LOTTERY.\n\nPAPER X.\n\nOrder for a Wai Seng Ticket.\n\n141 [This is a private number of the Wai Seng firm.]\n\nChop Wing Fat.\n\nDr. to Fung Ki (the Wai Seng firm) of Johore.\n\nTo\n\nShin (2) o one Ko, ... $1.00\nShim (2) o one Sin, ... $1.00\nHün (2) o one Tung, ... $2.00\n\nTotal, ... $4.00\n\n(Note.)\n\nDiscount for silver—7%.\n\nDo. coppers—Market rates.\n\nCivil Sau Ts'oi Examination of the Ko-Yiu, Sz Wui, and Hok Shan Districts.\n\nYam Shan Year.\n\nNOTES TO PAPER X.\n\n(1) Fung Ki (逢記) is an abbreviated form of the full name of the firm Fung Ün Li (逢原利), and is written in this symbolical way to escape detection.\n\n(2) Shin (禪), Hun (宜) are the numbers of the Wai Seng books. Sin (仙), Ko (羔), Tung (冬) are the Tsz Kwai (字軌) in the books. Thus the Wing Fat shop has bought two one-dollar tickets and one two-dollar ticket.\nPAPER XI.\n\nForm of Receipt for Money paid for Wai Seng Tickets, Singapore.\n\nKo Si and Hok (Districts).\n(i.e., Ko Tu, Si Jui and Hok Shan).\n\nNo. III.\n\nReceipt from Chop \"Old Ban San,\" the sum of $11.50, nett $10.69, being price for goods. (1)\n\nThis bill is given to be kept as a proof.\n\nDated the 12th of 2nd Moon of Kwong Sui, Yam Shan year.\n\nNOTE TO PAPER XI.\n\n(1) \"Goods\" or Fo (貨) or \"articles\" Kin (件) are the two commonest periphrastic disguises employed in the Straits to avoid using the word Wai Seng ticket or Pi'iu Kan (票根).\n\nPAPER XII.\n\nWai Seng Guide in Advertisement Form, Singapore.\n\nChu Chuk Nin, Nam Hoi, San Mau Year's Examination, passed at Shun Thin Prefecture, (1) No. 20 on the list of graduates.\n\nChü Yiu Chong, Wai Chau, salaried licentiate, age 57 years, Yam Ng Year, No. 63 on the list of graduates.\n\nLu Wai Hing, Phun Yü, on the established list, age 39 years, Ping Chi Year, No. 9 on the list of graduates.\nTHE WAI SENG LOTTERY.\n\nLu Shan Ching, San Wui, on the established list, age 19 years, Ki Ch'au Year, No. 92 on the list of graduates.\n\nThen follows a list of several hundred names of Kü Yans.\n\nList presented by the Meng Shang Li Wai Seng Office, Canton City.\n| Lai | P'un | Lau | Yeung | Wong | Ch'eueng | Li | Ho | Leung | Ch'an |\n|-----|------|-----|-------|------|----------|----|----|-------|-------|\n| 538 | 561  | 579 | 650   | 844  | 877      | 942| 962 | 977   | 995   |\n\n| Yau | Ngan | Mak | K'ong | Kong | Chiu | Ts'eng | Fu | Ng | Chau |\n|-----|------|-----|-------|-----|------|--------|----|----|-----|\n| 165 | 169  | 170 | 203   | 208 | 226' | 246    | 262| 265| 287 |\n\n| Hang | Ch'oi | Chung | Cheung | Siu | Lung | Tang | T'am | T'o | Ch'ui |\n|------|-------|-------|--------|----|------|------|------|-----|------|\n| 49   | 53    | 54    | 56     | 58 | 60   | 61   | 63   | 70  | 71   |\n\n| Fong | Kwan | Kwai | She | Sung | Lo | Ü | Lu | Ip | Man |\n|------|------|-----|-----|------|----|---|----|----|-----|\n| 21   | 22   | 23  | 25  | 27   | 28 | 29 | 30 | 31 | 32   |\n\n| Yau | Mok | Ku | Lai | Yung | T'ong | Chi | Shek | Sham | Chong |\n|-----|-----|----|-----|------|-------|-----|------|------|-------|\n| 3   | 4   | 4  | 5   | 6    | 6     | 7   | 8    | 8    | 9     |\n\n| Tso | Fok | Ün | Kam | Hung | Shin | Wai | Cheuk | Ün | Sheng |\n|-----|-----|----|-----|------|------|-----|-------|----|-------|\n| 1   | 1   | 1  | 1   | 1    | 1    | 1   | 1     | 1   | 1     |\n\nA list published by our firm containing one hundred and five surnames arranged in order of merit as chosen proportionally by the public taken from the $2 Kin (元) Wai Seng stake book.\n\nKap Ng Year.—The Examination for the Civil Metropolitan or Tsun Sz degree. In staking on this lottery no surnames are barred.\nNOTE TO PAPER XIII.\n\nThe figures underneath each surname shew how many times in a thousand columns (each containing 16 different surnames selected by the stakers) each respective surname has been selected. Thus the surname Chan (the surname which heads the list) has been selected by 995 stakers. The next surname Leung has been selected by 977 stakers, and so on. The surnames are arranged in, so to speak, order of merit. The surnames which have been staked on most, head the list and the other surnames which have not been selected so largely all follow in due order. When no surnames are barred, every one naturally picks out most of the biggest ones first as there is more likelihold of guessing right as there are, of course, more candidates with the same surname belonging to the big surnames; if one man, for instance, of the Chan surname does not pass, another man of the same surname may. Very few people select the small surnames (such as the last 21 surnames in this list) (as there are, of course, not likely to be more than one man of these rare surnames going up for the examination) unless they have some special knowledge about the abilities and performances of the men or know that bribery and corruption is to play a part in getting degrees for them.\nPAPER XIV.\n\nA Wai Seng Ho Tan (號單) or Order for a Stake Book, or Kun-Hau (卷口).\n\nTsun-Tsz. (1)\n\nCHIM ÜN (2).\n\nKAM (3).\n\nSTAKE BOOK.\n\nÜN-YÜN (4).\n\nNOTES TO PAPER XIV.\n\n(1) Tsun Tsz (進士) Metropolitan graduate or LL.D. shews that the lottery is being held over the Peking or Ui Shi Examination.\n\n(2) Chim Ün (占元) chop of the Wai Seng office.\n\n(3) Kam (金) is the Chinese character serialising the stake book.\n\n(4) Ün-Yün (元源) is either the name of the Printer of the ticket or some covert mark of the firm for keeping account of the number of the receipts issued.\n限\n陳李張黃何梁潘馮劉羅吳楊葉關蔡蘇黎謝趙盧鍾鄧林\n光緒二十年甲午會試新舉人錄\n\n| 一等 | 一等列一百名 |\n|------|--------------|\n| 一名方補慶江蘇 | 二八龍建章順德 |\n| 五名范公謨番禺 | 三一陳鵬翔新會 |\n| 七名凌福彭番禺 | 四十梁冠澄順德 |\n| 十四麥孟華順德 | 二十許炳奇番禺 |\n| 四三王士宗欽州 | 五七方士華東莞 |\n\n| 二八龍建章順德 | 五十梁紹獻南海 |\n| 三一陳鵬翔新會 | 五一何應榜廣府 |\n| 五二黃煊林三水 | 七二易鳳流肇府 |\n| 七五沈維松南海 | 七七顏克鏞連平 |\n| 八三崔以銘南海 | 坊 |\n且最要者字也而最重皆亦字乞造字之\n| 月 | 日 |\n|----|----|\n| 荒 | 洪 |\n| 宇 | 宇 |\n| 黃 | 黃 |\n| 地 | 天 |\n\n訓蒙千字文\n\n大號賤\n现银交易广\n\n各卷先满先派部迟满之卷准于四月\n\n| 卷 | 姓 | 限 |\n|----|----|----|\n| 一 | 谢 | 教 |\n| 二 | 费 | 银 |\n| 三 | 舍 | 例 |\n| 四 | 赠 | 懒 |\n| 五 | 赠 | 懒 |\n\n不\n\n（一以壬辰年考取广东全省文会元进）\n\n为据以本省乡试及中北围新旧举人\n\n会试中式进士俱皆同计除去别省进\n\n皆不计不限姓任拣十六姓为额写多\n\n乃係自愧双姓取头一字作姓先取中\n\n论名多为第一同中同分各卷以收壹\n\n谢教照数均派各卷均列三名中式谢\n\n费银六分及其部银均在谢教内扣除\n\n旧例兹不细载倘有怀疑幸勿赐教\n諸君光顧現銀交易\n\n列畧姓不限\n\n洪魏利繆畢符房池翁成全藍安薛甘萬姜詹丁祝曹翔敖秦宋屈阮倪程任甄殷卓蒲湛庾海梅源夏戚盤刑言覃鮑駱禰漆俞紀錢列虞毛古仇老樊聶伊康倫柯翟危官羊雲檀游左柴柳沙明向蒙蔣姓氏太多不能盡錄\n\n鋪在粵東省城第七甫東向開張\n| 树名 | 宫名 | 首名 | 壬名 | 真独得名 | 绵独得名 |\n|------|------|------|------|----------|----------|\n| 恩广东全省文 | 周 | 范方 | 江程 | 招康 | 顾卓 |\n| 郡科入黙姓列 | 梅 | 文 | 胡 | 龍 | 康 |\n| 共十七姓 | 升二名 | 均十六份 |\n\n共九十五三十姓均六百七十一\n| 姓 | 名 |\n|----|----|\n| 恩 | 順 |\n| 廣 | 東 |\n| 全 | 省 |\n| 文 | 周 |\n| 麥 | 梅 |\n| 文 | 胡 |\n| 龍 | 廖 |\n| 易 | 沈 |\n| 己 | 鄉 |\n| 邑 | 科 |\n| 入 | 黑 |\n| 姓 | 列 |\n| 范 | 方 |\n| 江 | 程 |\n| 招 | 康 |\n| 顧 | 卓 |\n| 共 | 十 |\n| 七 | 姓 |\n| 井 | 二 |\n| 名 | 均 |\n| 六 | 份 |\n\n共十七姓，共二名，均六份。\n| 树 | 深 |\n|----|----|\n| 名 | 名 |\n| 花名 | 花名 |\n| 均四份 | 均四份 |\n| 名 | 名 |\n| 花名 | 花名 |\n| 均四份 | 均四份 |\n\n| 宁 | 宁 |\n|----|----|\n| 名 | 名 |\n| 花名 | 花名 |\n| 均四份 | 均四份 |\n| 名 | 名 |\n| 花名 | 花名 |\n| 均四份 | 均四份 |\n\n| 晋 | 晋 |\n|----|----|\n| 名 | 名 |\n| 花名 | 花名 |\n| 均四份 | 均四份 |\n| 名 | 名 |\n| 花名 | 花名 |\n| 均四份 | 均四份 |\n\n倘有错漏祈为指知\n\n日记新闻纸\n| 多 | 軽 | 肥 | 於 | 車 |\n|---|---|---|---|---|\n| 首名 | 首名 | 首名 | 首名 | 首名 |\n| 均二份 | 均二份 | 均二份 | 均二份 | 均二份 |\n| 高 | 名 | 名 | 名 | 名 |\n| 十三姓 | 十三姓 | 十三姓 | 十三姓 | 十三姓 |\n| 均一百三 | 均一百三 | 均一百三 | 均一百三 | 均一百三 |\n| 名 | 名 | 名 | 名 | 名 |\n| 十五份 | 十五份 | 十五份 | 十五份 | 十五份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 清 | 清 | 清 | 清 | 清 |\n| 獨得 | 獨得 | 獨得 | 獨得 | 獨得 |\n\n---\n\n| 多 | 軽 | 肥 | 於 | 車 |\n|---|---|---|---|---|\n| 首名 | 首名 | 首名 | 首名 | 首名 |\n| 均二份 | 均二份 | 均二份 | 均二份 | 均二份 |\n| 高 | 名 | 名 | 名 | 名 |\n| 十三姓 | 十三姓 | 十三姓 | 十三姓 | 十三姓 |\n| 均二百三 | 均二百三 | 均二百三 | 均二百三 | 均二百三 |\n| 名 | 名 | 名 | 名 | 名 |\n| 十九份 | 十九份 | 十九份 | 十九份 | 十九份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均六百七 | 均六百七 | 均六百七 | 均六百七 | 均六百七 |\n| 名 | 名 | 名 | 名 | 名 |\n| 十九份 | 十九份 | 十九份 | 十九份 | 十九份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均二百三 | 均二百三 | 均二百三 | 均二百三 | 均二百三 |\n| 名 | 名 | 名 | 名 | 名 |\n| 十八份 | 十八份 | 十八份 | 十八份 | 十八份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均四份 | 均四份 | 均四份 | 均四份 | 均四份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均四百零三 | 均四百零三 | 均四百零三 | 均四百零三 | 均四百零三 |\n| 名 | 名 | 名 | 名 | 名 |\n| 十七份 | 十七份 | 十七份 | 十七份 | 十七份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均六百五 | 均六百五 | 均六百五 | 均六百五 | 均六百五 |\n| 名 | 名 | 名 | 名 | 名 |\n| 十六份 | 十六份 | 十六份 | 十六份 | 十六份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均五份 | 均五份 | 均五份 | 均五份 | 均五份 |\n| 著名 | 著名 | 著名 | 著名 | 著名 |\n| 均五份 | 均五份 | 均五份 | 均五份 | 均五份 |\n\n---\n\n南番順文洪宮八點姓\n省城恩科文鄉科\n\n名利成\n\n馬卷澤記定到\n\n卿字號該銀壹大員\n\n諸君光顧現銀到店投票蓋同鋪面現銀圖章該謝\n\n教憑單到店領取如相信經手未銀發單者認人不\n\n認單該謝教為經手是問不得携單到店索討並毀\n\n爛圖章字跡亦不得領取謝教先此聲明以免後論\n\n光緒癸已年月日發單\n陶字廣東全省文進會鑛股壹份\n光緒壬辰年\n山大街新時記股份單\n兹收到第 號\n\n大寶號貨銀\n\n光緒壬辰年 月 日 收單\n\n鳴 永字如意壹柄該銀壹員\n\n光緒壬辰年 月 日\n\n文會元進士 與記發單\n\n曾\n高四鶴文覺宮\n\n禪○一員\n禪○一員\n仙一員\n\n共該銀四員正\n\n壬辰年\n\n山新逢記單\n高四鶴\n\n兹收到第號\n\n大寶號貨銀給單付執為據\n\n光緒壬辰年月日\n\n公泰興收記\n\n收單\n光緒十八年壬辰科續刻文試新舊舉人起錄羊第八麟玉樓\n\n陳文燦新會付甲子歲癸酉二百零二名\n陳湯聘新會乙亥科順天百十一名\n甲午恩文進士不限姓\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/publications191socigoog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 170, "total-input-tokens": 243422, "total-output-tokens": 48680, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 0, 9], [0, 133, 10], [133, 133, 11], [133, 264, 12], [264, 264, 13], [264, 1216, 14], [1216, 1216, 15], [1216, 2316, 16], [2316, 4476, 17], [4476, 6647, 18], [6647, 8921, 19], [8921, 10599, 20], [10599, 12893, 21], [12893, 15206, 22], [15206, 17306, 23], [17306, 19533, 24], [19533, 21662, 25], [21662, 23905, 26], [23905, 25956, 27], [25956, 28091, 28], [28091, 30228, 29], [30228, 32489, 30], [32489, 34766, 31], [34766, 36918, 32], [36918, 39114, 33], [39114, 41437, 34], [41437, 43773, 35], [43773, 46034, 36], [46034, 48090, 37], [48090, 49794, 38], [49794, 51358, 39], [51358, 53189, 40], [53189, 55151, 41], [55151, 57234, 42], [57234, 59385, 43], [59385, 61549, 44], [61549, 63693, 45], [63693, 65869, 46], [65869, 68129, 47], [68129, 70254, 48], [70254, 72473, 49], [72473, 74668, 50], [74668, 76915, 51], [76915, 79180, 52], [79180, 81388, 53], [81388, 83686, 54], [83686, 85307, 55], [85307, 87464, 56], [87464, 89337, 57], [89337, 91109, 58], [91109, 92622, 59], [92622, 94159, 60], [94159, 95006, 61], [95006, 95780, 62], [95780, 97276, 63], [97276, 98702, 64], [98702, 100613, 65], [100613, 102698, 66], [102698, 104687, 67], [104687, 105366, 68], [105366, 106868, 69], [106868, 109027, 70], [109027, 109833, 71], [109833, 111538, 72], [111538, 113338, 73], [113338, 114116, 74], [114116, 115772, 75], [115772, 116595, 76], [116595, 118367, 77], [118367, 119398, 78], [119398, 120615, 79], [120615, 121129, 80], [121129, 122287, 81], [122287, 123362, 82], [123362, 123362, 83], [123362, 124856, 84], [124856, 125957, 85], [125957, 128062, 86], [128062, 130057, 87], [130057, 132311, 88], [132311, 134399, 89], [134399, 136520, 90], [136520, 138602, 91], [138602, 140605, 92], [140605, 141908, 93], [141908, 143292, 94], [143292, 143896, 95], [143896, 145452, 96], [145452, 147090, 97], [147090, 149363, 98], [149363, 151607, 99], [151607, 151676, 100], [151676, 151676, 101], [151676, 152586, 102], [152586, 154562, 103], [154562, 156025, 104], [156025, 157425, 105], [157425, 158338, 106], [158338, 159744, 107], [159744, 160562, 108], [160562, 161495, 109], [161495, 161754, 110], [161754, 163300, 111], [163300, 164570, 112], [164570, 165129, 113], [165129, 165129, 114], [165129, 165129, 115], [165129, 165129, 116], [165129, 165129, 117], [165129, 165129, 118], [165129, 165129, 119], [165129, 165129, 120], [165129, 165129, 121], [165129, 165129, 122], [165129, 165129, 123], [165129, 165129, 124], [165129, 165129, 125], [165129, 165129, 126], [165129, 165129, 127], [165129, 165129, 128], [165129, 165129, 129], [165129, 165129, 130], [165129, 165129, 131], [165129, 165129, 132], [165129, 165129, 133], [165129, 165129, 134], [165129, 165129, 135], [165129, 165155, 136], [165155, 165155, 137], [165155, 165155, 138], [165155, 165425, 139], [165425, 165425, 140], [165425, 165425, 141], [165425, 165442, 142], [165442, 165516, 143], [165516, 165516, 144], [165516, 165516, 145], [165516, 165516, 146], [165516, 165798, 147], [165798, 165918, 148], [165918, 165918, 149], [165918, 166109, 150], [166109, 166109, 151], [166109, 166356, 152], [166356, 166356, 153], [166356, 166657, 154], [166657, 167905, 155], [167905, 167905, 156], [167905, 168035, 157], [168035, 168065, 158], [168065, 168133, 159], [168133, 168133, 160], [168133, 168175, 161], [168175, 168175, 162], [168175, 168219, 163], [168219, 168219, 164], [168219, 168277, 165], [168277, 168277, 166], [168277, 168287, 167], [168287, 168287, 168], [168287, 168287, 169], [168287, 168287, 170]], "primary_language": ["en", "None", "None", "None", "None", "None", "None", "None", "None", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "zh", "None", "zh", "zh", "zh", "None", "zh", "None", "zh", "None", "zh", "zh", "zh", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, true, false, false, false, false, false, false, false, false, true, false, true, true, false, false, false, false, false, true, false, false, true, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, false, true, false, true, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, true, false, true, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]