[{"id": "eb3249d0c83387963fb23ae88cb2b34f74b82a18", "text": "JOURNAL\nOF THE\nCEYLON BRANCH\nOF THE\nROYAL ASIATIC SOCIETY,\n1910.\n\nVOLUME XXII.\nNo. 63.\n\nEDITED BY THE HONORARY SECRETARY.\n\nThe design of the Society is to institute and promote inquiries into the History, Religions, Languages, Literature, Arts, and Social Condition of the present and former Inhabitants of the Island, with its Geology and Mineralogy, its Climate and Meteorology, its Botany and Zoology.\n\nPrice: to Members, Rs. 1; to Non-Members, Rs. 2.\n\nCOLOMBO:\nH. C. COTTLE, GOVERNMENT PRINTER, CEYLON.\n1911.\nThe design of the Society is to institute and promote inquiries into the History, Religions, Languages, Literature, Arts, and Social Condition of the present and former Inhabitants of the Island, with its Geology and Mineralogy, its Climate and Meteorology, its Botany and Zoology.\n\nCOLOMBO:\nH. C. COTTLE, GOVERNMENT PRINTER, CEYLON.\n\n1911.\nCONTENTS.\n\nCouncil Meeting : February 7, 1910 .. .. 1\n\nCouncil Meeting : March 16, 1910 .. .. 3\n\nAnnual General Meeting : March 16, 1910 .. .. 5\n\nPaper read :\n\"The Age of Sri Parakrama Bahu VI. (1412-1467 A.D.),\" by Edward W. Perera .. .. 6\n\nAnnual Report for 1909 .. .. 45\n\nArchaeological Survey, 1909 : Synopsis of work done by the .. .. 49\n\nOffice-Bearers for 1909, election of .. .. 57\n\nCouncil Meeting : June 9, 1910 .. .. 60\n\nPaper not read :\n\"Fourth Supplementary Paper on the Monumental Remains of the Dutch East India Company in Ceylon\" .. .. 63\n\nGeneral Meeting : August 3, 1910 .. .. 70\n\nPaper read :\n\"Tantri-Malai : some Archaeological Observations and Deductions,\" by John Still .. .. 73\n\nGeneral Meeting : September 29, 1910 .. .. 101\n\nPaper read :\n\"Kandyan Provinces,\" by the Hon. Mr. P. Arunachalam, C.C.S. .. .. 103\n\nCouncil Meeting : November 17, 1910 .. .. 123\nERRATUM.\n\nPage 99, line 16, for \"Bodhisatravó\" read \"Bodhisatvayó.\"\nJOURNAL\n\nOF THE\n\nROYAL ASIATIC SOCIETY,\n\nCEYLON BRANCH.\n\nCOUNCIL MEETING.\n\nColombo Museum, February 7, 1910.\n\nPresent:\n\nMr. R. G. Anthonisz. Mr. A.M. Gunasékera, Mudaliyár.\nMr. M. K. Bamber, M.R.A.S. Mr. D. B. Jayatilaka, B.A.\nMr. E. B. Denham, B.A., C.C.S. Mr. R. C. Kailásapillai, Mudaliyár.\nMr. C. Drieberg, B.A., F.H.A.S. Mr. P. E. Pieris, M.A., C.C.S.\nMr. Simon de Silva, Mudaliyár.\n\nMr. J. Harward, M.A., Honorary Secretary.\nMr. G. A. Joseph, Honorary Secretary and Treasurer.\n\nBusiness.\n\n1. On a motion proposed by Mr. M. K. Bamber, and seconded by Mr. C. Drieberg, Mr. Harward took the chair.\n\n2. Resolved that the following Members be elected:\n\n(1) E. Burgess, Assistant Bacteriologist: recommended by G. W. Sturgess.\n(2) L. Vibert, I.C.S. (non-resident): recommended by J. A. Daniel.\n(3) C. S. Vaughan, C.C.S.: recommended by H. C. P. Bell.\n(4) B. C. Cooray: recommended by J. Harward.\n\n3. Laid on the table Circular No. 293 of November 26, 1909, containing the opinions of Messrs. J. P. Lewis and R. G. Anthonisz on the Paper entitled \"Fourth Supplementary Paper on Monumental Remains of the Dutch East India Company in Ceylon,\" by Mr. F. H. de Vos.\n\nResolved,—That the Paper be accepted and published in the Journal.\n4. Considered a motion from Dr. A. Willey, suggesting the expansion of the scope of the Journal so as to admit of the publication of short notes, reviews, and queries relating to the literature, history, and archaeology of Ceylon.\n\nRead letters from Dr. Willey and Mr. Arunachalam regretting their inability to propose and second the motion owing to absence from Colombo.\n\nResolved,—That the consideration of the motion be postponed till Dr. Willey and the Hon. Mr. Arunachalam are able to be present.\n\n5. Laid on the table a Paper entitled \"Tantri-malai,\" by Mr. J. Still.\n\nResolved,—That the Paper be referred to Messrs. H. C. P. Bell and Simon de Silva, Mudaliyár, for their opinions.\n\n6. Laid on the table a Paper entitled \"Ancient Mátara,\" by Mr. F. Jayatilaka.\n\nResolved,—That the Paper be referred to Messrs. J. P. Lewis and P. E. Pieris for their opinions.\n\n7. Considered the matter of inserting in full the remarks of Prof. Vidyabhusana regarding the alleged discovery of a very ancient inscription at Mihintale.\n\nResolved unanimously,—That Dr. Vidyabhusana's detailed description be not printed.*\n\n8. Considered date and business for next General Meeting.\n\nResolved,—That the matter be left in the hands of the Secretaries, after consultation with the President.\n\n* See Journal, vol. XXI., No. 62, p. 338, 1909.\nCOUNCIL MEETING.\n\nColombo Museum, March 16, 1910.\n\nPresent:\n\nMr. P. Freüdenberg, Vice-President, in the Chair.\nDr. A. Willey, D.Sc., F.R.S., Vice-President.\nMr. Simon de Silva, Mudaliyár.\n\nMr. D. B. Jayatilaka, B.A.\nMr. A. M. Gunasékera, Mudaliyár.\n\nMr. J. Harward, M.A., Honorary Secretary.\nMr. G. A. Joseph, Honorary Secretary and Treasurer.\n\nBusiness.\n\n1. Read and confirmed Minutes of last Council Meeting held on February 7, 1910.\n\n2. Resolved the election of the following Members:\n\n(1) H. G. Bois: recommended by G. A. Joseph.\n(2) A. R. Slater, B.A., C.C.S.: recommended by E. B. Denham.\n(3) G. M. Cookson, B.A., C.C.S.: recommended by A. W. Seymour.\n(4) T. Gracie: recommended by A. Willey.\n(5) B. Hill, B.A., C.C.S.: recommended by G. A. Joseph.\n\n3. Laid on the table Circular No. 294 of November 26, 1909, containing the opinions of Messrs. H. W. Codrington and P. E. Pieris on the Paper entitled \"Some Aspects of the Laws and Constitution of the Sinhalese Kingdom,\" by the late Mr. C. M. Fernando.\n\nResolved,—That in view of the opinions expressed by the gentlemen to whom the Paper was referred, and inasmuch as the greater part of the Paper has already been printed elsewhere, Mr. C. H. Z. Fernando be thanked for forwarding the Paper to the Society, and be informed that the Council regrets its inability to accept it for the Society's Journal.\n\n4. Laid on the table Circular No. 21 of February 12, 1910, containing the opinions of Messrs. J. P. Lewis and P. E. Pieris on a Paper entitled \"Ancient Máṭara,\" by Mr. F. Jayatilaka.\n\nResolved,—That in view of the remarks on the Circular by the gentlemen to whom the Paper was referred it be not accepted, but that the writer be thanked for forwarding it to the Society.\n5. Laid on the table Circular No. 22 of February 12, 1910, containing the opinions of Messrs. H. C. P. Bell and Simon de Silva, Mudaliyár, on the Paper entitled \"Tantri-malai,\" by Mr. J. Still.\n\nResolved,—That the Paper be accepted for reading at a Meeting and be published in the Journal.\n\n6. Laid on the table \"Notes on Katuwana Fort,\" by Mr. J. Still.\n\nResolved,—That the Notes be referred to Messrs. J. Harward and P. E. Pieris for their opinions.*\n\n7. Laid on the table a letter from Mr. Donald Ferguson, forwarding a Paper entitled \"Mulgiri-gala,\" and the manuscript used by Le Grand in his translation of Ribeiro.\n\nResolved,—That Mr. Ferguson be heartily thanked for presenting the Library of the Society with the manuscript used by Le Grand in his translation of Ribeiro, and also for his Paper on \"Mulgiri-gala.\"\n\nResolved,—That Mr. Donald Ferguson's Paper on \"Mulgiri-gala\" be referred to Messrs. P. E. Pieris and J. Still for their opinions.\n\n8. Laid on the table a letter from the Manager, Panini Office, Allahabad, asking for an exchange of Publications.\n\nResolved,—That the applicant be asked to supply further details as to what he offers and what he desires in return.\n\n9. Read and passed the list of Members whose names are to be struck off the List and published in the Annual Report.\n\n10. Read and passed the Annual Report for 1910.\n\n11. Considered the nomination of Office-Bearers for 1910. Under Rule 16 Messrs. Simon de Silva, Mudaliyár, and P. E. Pieris retire by reason of seniority, and Messrs. E. R. Goonaratna, Mudaliyár, and H. W. Codrington by reason of least attendance. Two of these Members are eligible for re-election.\n\nResolved,—That Simon de Silva, Mudaliyár, and Mr. P. E. Pieris be re-elected, and that the vacancies in the Council be filled by the appointment of Messrs. E. W. Perera, Barrister-at-Law, and John Still, Land Settlement Officer.\n\n* The Notes were offered, through the Director, Colombo Museum, to the \"Spolia Zeylanica,\" on behalf of Mr. Still. They were not intended for the Asiatic Society, to which they were wrongly forwarded. Mr. Still has withdrawn them.—B., Ed. Sec.\nANNUAL GENERAL MEETING.\n\nColombo Museum, March 16, 1910.\n\nPresent:\n\nThe Hon. Sir Hugh Clifford, K.C.M.G., President, in the Chair.\n\nMr. P. Freudenberg, J.P., Vice-President.\n\nMr. E. Burgess.\nMr. B. C. Cooray.\nHon. Mr. H. L. Crawford, C.M.G.\nMr. E. B. Denham, B.A., C.C.S.\nRev. J. P. de Pinto.\nMr. Simon de Silva, Gate Mudaliyar.\nMr. D. Devapuraratna, Proctor, S.C.\nMr. A. H. Gomes.\nMr. W. F. Gunawardhana, Mudaliyar.\nMr. A. M. Hamid.\nDr. C. A. Hevavitarana, M.B., C.M.\nMr. D. B. Jayatilaka, B.A.\nMr. E. W. Jayewardene, Barrister-at-Law.\n\nMr. D. Montagu, A.M.I.C.E.\nMr. P. E. Morgappah.\nVen. M. Sri Nanissara.\nDr. A. Nell, M.R.C.S.\nMr. J. P. Obeyesekere, B.A., Barrister-at-Law.\nMr. S. Obeyesekere, Barrister-at-Law.\nRev. J. Pahamunai.\nMr. E. W. Perera, Barrister-at-Law.\nMr. F. C. Roles.\nMr. W. A. Samarasinha.\nDr. Donald Schokman.\nMr. J. M. Seneviratna.\nMr. A. W. Seymour.\nMr. D. E. Wanigasuriya.\nMr. Sam Williams.\n\nMr. J. Harward, M.A., Honorary Secretary, and Mr. G. A. Joseph, Honorary Secretary and Treasurer.\n\nVisitors: Ten ladies and twenty-four gentlemen.\n\nBusiness.\n\n1. Read and confirmed Minutes of last General Meeting held on December 18, 1909.\n\n2. Mr. Joseph announced the election of Members since the last General Meeting.\n\n3. The Chairman drew attention to a number of antiques recently disinterred by the Archaeological Survey at Polonnaruwa which were exhibited on the table, mentioning that there was a description of them in the Annual Report.\n\n4. The Chairman then called upon Mr. E. W. Perera to read the following Paper:—\nTHE AGE OF SRÍ PARÁKRAMA BÁHU VI.\n\n(1412–1467.)\n\nBY EDWARD W. PERERA,\n\nBarrister-at-Law of the Middle Temple and Advocate of the Supreme Court of Ceylon.\n\nINTRODUCTION.\n\nThe principal authorities for the period comprising the reign of Srí Parákrama Báhu VI. are Valentyn and De Couto’s accounts of Sinhalese history and the Rájávaliya. In certain parts De Couto’s version, compiled in 1550 from Sinhalese records, now destroyed, appears to be more reliable and complete than the Rájávaliya narrative. Valentyn, who also derived his information from Sinhalese sources, probably from a variant text of the Rájávaliya which is no longer in existence, supplements in certain particulars the facts noted in the Sinhalese chronicle.\n\nThe Rájávaliya account dealing with the period under review appears to be a bare summary of events of reigns compiled from State records, and to have been put together about the later end of the sixteenth or the early half of the seventeenth century. Errors of scribes, omissions, and the disarrangement of the narrative prevent us from entirely trusting the record. However, a careful comparison of the Rájávaliya with the accounts of Valentyn and De Couto enable us to gain a correct knowledge of the principal events of the reign of Srí Parákrama Báhu VI. and of the time shortly before and after. But for the details of the picture, for information regarding the state and character of the king, the condition of the country, the progress of education, the form of administration, the social habits, and the material advance of the people, one has to go to the literature of the period. It was an age of deep literary activity, and fortunately much of that literature has descended to us, giving us a glimpse of pure Sinhalese manners and culture shortly before they came under Portuguese influences.\nOf these contemporary works, one of the most important from the historical point of view is the *Perakumbásirita*, ascribed to the priest Śrī Ráhula. It is a poetical panegyric of Śrī Parákrama Báhu, containing details of his ancestry and celebrating the victories and magnificence of his reign. A series of poems called *sandéṣa*, or poetical epistles, composed during this epoch, contain references to passing historical events, and furnish a complete picture of the contemporary life of the period. A synopsis of the argument of the *sandéṣa* poems would afford one an idea of the general character of these compositions. The Sinhalese *sandéṣa* poem, based on the model of Kálidása’s *Méghadúta*, the “cloud-messenger,” embodies, as its name implies, a message to be conveyed by some bird to the shrine of a god, invoking his blessing either on the sovereign or on a member of the royal family, or imploring the aid of the divinity for the triumph of the imperial arms. The poem generally opens with an apostrophe to the particular bird to whom the “message” is to be entrusted, next the capital whence he starts is described, and the bird bidden to worship the Tooth-relic and take leave of the king before setting forth. This affords the poet an opportunity to describe the fortifications, the streets, the temple of the Tooth, and other sacred and secular buildings of the city, and to sing the splendour of the court and the glories of the king. Next follows an account of the chief villages and towns, the principal landmarks and natural features of the country, such as temples, shrines, hospices, fortified posts, tanks, mountains, forests, and streams along the route by which the carrier bird has to fly. From these descriptions, though poetical, and in places highly coloured, a discriminating reader may glean many interesting particulars regarding the state of the Island and the condition of the people. Finally, the city whither the bird is bound and the shrine of the god to whom the message is despatched is singled out for praise. The *sandéṣa* closes with the words of the “request” to be breathed into the ear of the divinity, and a prayer for the prosperity of the realm and victory for the king. The majority of these *sandéṣas* were written during this epoch, and, as stated before, furnish valuable data for a\nsocial study of the period. Almost all the principal highways and cities of the time traversed by these winged messengers are described. The Sēlalihini Sandēsa, \"the sēla message,\" written circa 1450 by the priest Śrī Rāhula, describes the route between Kōttē and Keḷaniya. The distance being short, the bird is made to take a circuitous course, by way of Gurubēbila (Hanvēlla) on to Keḷaniya, to enable the poet to describe the intervening country.¹ The Paravi Sandēsa, \"dove message,\" by the same author, describes the route between Kōttē and Dondra, the dove-messenger flying along the seabeach road now traversed by the railway from Colombo to Mátara. The Girā Sandēsa, the \"parrot-message,\" by an unknown poet, is a very valuable poem, teeming with allusions to contemporary events and manners, and describes the route from Kōttē to Totagamuva and the educational establishment Vijaya Bāhu Pirivena of Śrī Rāhula. The Havsa, or Tisara Sandēsa, ascribed to the High Priest Vīdāgama Maitreya, conveys a message by a \"swan\" from the capital to the Buddhist hierarch Vanaratana Māhasāmi, then presiding over the ecclesiastical college of Padmāvati Pirivena at Kēragala. This work illustrates in detail the aspect of the capital, and contains a vivid presentation of the royal durbar with the different ranks of officials who stood before the throne. There is yet another Tisara Sandēsa belonging to the same period by a different hand, which unfortunately I could not consult, the poem not being printed, and no manuscript being available to me for reference.\n\nThe Kovil Sandēsa,² \"the cuckoo (koil) message,\" apart from its literary excellence, has great value from a historical point of view. It was composed by the priestly warden of the Irugalkula Pirivena at Mulgirigala in the Southern Province, and invokes a blessing on Sapumalkumāra, who was then administering Jaffna as prince regent, soon after the conquest, and contains a contemporary picture of the capital city of Jaffna and its environs. The poems of Śrī Rāhula glow with an intense patriotism and affection for the royal family, and even in the Kāvyasēkhara, which deals with a birth tale of the Buddha, there are scattered allusions to the ancestry, virtues,\n\n¹ But vide Appendix B.  \n² Still unpublished.\nand accomplishments of the king and the princess royal Ulakundali-dévi,\\(^1\\) at whose request the poem was undertaken.\n\nThe glossaries, two of which were compiled during this reign, *Piyummala*, *Ruvanmala*, and the *Námávaliya*, furnish information, though not so ample as might be wished for, of the character of the public and domestic architecture, of the articles and utensils in ordinary use, of games and pastimes, and of the grades of society. The ampest and most accurate of these is the poetical glossary of the *Ruvanmala*, composed by the king on the model of the *Amarasiṅha*. The *Piyummala* is an older collection of words on the basis of the *Abhidánappadípiká*. The *Námávaliya* is a poetical composition by the chieftain Nallúrutun, *sannas* minister, made in 1411, earlier than the *Ruvanmala*, and not so complete.\n\nA prose work, the Sinhalese *Thúpavansa*, probably written by an author of this period, furnishes us with a detailed description of the ancient Sinhalese royal dress and ornaments, and the ordinary attire and furniture in use in the country, though treating of the history of an earlier time. However, as manners and customs change so very little in the East its date scarcely affects its value. In addition to the sources already indicated, a series of stone inscriptions and copperplate grants (*sannas*) have preserved to us a wealth of personal and administrative detail of great historical importance. I have specified in an appendix\\(^2\\) all the lithic and copperplate records bearing on this reign, noting the references where they may be found. Three grants which have yet to be accurately copied, translated, and annotated, I have included in an appendix\\(^2\\) with a tentative translation. For the text I had to depend on transcripts more or less imperfect. There is yet another stone record, I am informed, inscribed during this reign, which is hewn on the rock at the Galapáta Vihára in the Kalutara District. Unfortunately I have not been able to secure a copy of it. Perhaps the most interesting of the series is the Pepilyána inscription, which contains rules regulating\n\n---\n\n\\(^1\\) This form of the name, instead of Ulakuḍa Dévi, occurs in the *Kovul Sandésa*.\n\n\\(^2\\) These I have deferred for a later chapter.\nthe internal economy of a great ecclesiastical establishment of the period, with directions regarding the lodging and entertainment of wandering monks and scholars. Similarly, the Uggalboda Déválé sannas furnish information regarding the public duties imposed on great chieftains and the character of the honours accorded to them by royal decree.\n\nThus, the main sources for the history of the period in review are (1) the historical accounts of De Couto, Valentyn, and the Rájávaliya; (2) passages in Sinhalese contemporary literature; (3) Chinese annals relating to the fourteenth and fifteenth centuries; (4) the testimony of royal grants and stone inscriptions. Besides these, much assistance might have been ordinarily derived from archaeology and tradition, those twin hand-maidens of historical investigation. But, as unfortunately the capital of the period and the adjoining districts had long been a prey to Portuguese invasion and fanatical vandalism, scarce anything in the nature of ancient monuments has survived. Besides, the sea-board districts, both in ancient as in modern times, being the most subject to foreign influences, much of the ancient traditional lore has disappeared, though a few legends still linger in the remoter villages.\n\nIt has been found to be convenient to arrange the subject in four divisions. In the first an attempt has been made to trace the political events of the reign, preserving as much as possible with the imperfect data available the chronological sequence of events. In the second has been sketched the territorial and political divisions, the organization and administration of village communities, and of the provincial governments; and the constitution of the realm in the fifteenth century has been outlined, so far as may be gathered from the meagre materials available. This chapter will be merely tentative, in view of the dearth of written information on the subject. The present, so far as the writer is aware, is the first attempt to collect that information into a connected shape. The third part has been devoted to the social condition of the country, the food, attire, mode of living of the people, games and festivals, instruments and tools, the disposition and appointments of the court, and their public and private buildings, weapons and fortifications, and arts and handicrafts, so\nfar as they throw light on the state of Society at the time. My remarks as to the tentative character of the undertaking apply equally to this branch of the subject. It must be noted, however, that materials though scattered are more abundant for a social survey than for a sketch of the constitution. Under a fourth head is included an account of the literature of the period. It was an age of general culture, as it was of successful military achievement, and many of the productions of that time have descended to us. Unfortunately some of these works, though it must be confessed only a few, have still to be published. Greater attention has been directed to the consideration of the life and character of the men themselves who created the era rather than to an elaborate critical analysis of their work. The estimate of their work falls more to the province of the critical scholar than to the historical student. Besides, some account of their productions is available, while no account of the lives of the brilliant band of scholars who lent lustre to the time has yet been attempted. This method has commended itself as the best calculated to understand their work and the prevailing spirit of the age.\n\nŚrī Parákrama Báhu VI. was the last great monarch of a single Lanká, and his reign marks an epoch. A careful consideration of his times enables us to judge how far the Sinhalese had declined since the great days of Anurádhapura and Polonnaruva, what was the nature and degree of the culture they possessed when the Portuguese landed in Ceylon, and to what extent their customs and institutions have been modified or superseded by the adoption of foreign ideals and the impact of European civilizations.\n\nI.—1412–1467 A.D.¹\n\nŚiri Sangabo Śrī Parákrama Báhu VI. came to the throne under tragic circumstances. Legend says that with his own hand he struck off the head of the usurper Alakésvara at the bidding of Vídágama Mahá Sámi. This monarch was the\n\n¹ Vide Journal, R.A.S. (C.B.), vol. XVIII., p. 301, App.; Rájávaliya, p. 68.\nson of Śrī Vīra Vijaya Bāhu VI. (circa 1400–1411) by his queen Sunētrā Dévi of the Girivaṇḍa, and was born circa 1395.\n\nEscaping with her two infant sons when Kōtté was sacked and the king taken captive by the Chinese, Sunētrā Dévi fled with them in disguise and concealed them in the regions\n\n---\n\n1 Vide Appendices A, B (Valentyn).\n\n---\n\n“Ho sprang of the unblemished race of monarchs who thus bore mighty sway with such majesty and power, the son of the monarch Sevulu* Vijaya Bāhu† and grandson of king Parākrama Bāhu,† Queen Sunētrā Mahā Dévi the creeper that twined round the wishing tree, the Lemeni Jaya Maha Léna Lord‡ bore this beautiful Bōdhisatva, this royal child.”—Perakumbāsirita, v. 27.\n\n* The Sevulu family was a branch of the Solar race; for origin of the name, vide Rājaratnākara, p. 52.\n\n† “Grandson of Parākrama Bāhu,” in third line, probably refers to the maternal grandfather of the king, Dambadeniya Bandar Parākrama Bāhu, the father of Sunētrā Dévi.—Couto says that it was he who was carried away by the Chinese. “This captive king had a daughter (i.e., Sunētra Dévi), a widow, with two infant sons (i.e., Śrī Parākrama Bāhu VI. and the sub-king Máyādunné Parākrama Bāhu), whose fate willed it that they should escape the Chins on the day of the sacking, and she fled with them into the interior.”—Journ., R.A.S. (C.B.), 1904, vol. XVIII., No. 55, p. 303, App. H. Probably Śrī Parākrama Bālu was the adopted son and heir of his maternal grandfather, Dambadeni Bandar Parākrama Bāhu, an under-king who wielded supreme power at Kōtté on the death of his son-in-law Vijaya Bāhu (cf. Lee’s Ribeiro, p. 24). Saddharmaratnākara, in a passage the sense of which is rendered obscure by its compression, states that Vīra Alakēśvara was taken captive by the Chinese. It would thus follow from Couto and the Saddharmaratnākara that Sevulu Vijaya Bāhu was probably at Kōtté while his brother Vīra Bāhu was ruling in Gampola, and on the former’s death his father-in-law, Parākrama Bāhu of the Girivaṇḍa, probably became king of Kōtté, till he was captured by the Chinese through the perfidy of his clansman Alakēśvara. But no definite conclusion can be come to till all the Chinese literature on the subject is available for reference.—Journ., R.A.S. (C.B.), 1904, loc. cit., App. A., p. 295.\n\n‡ Sevulu Vijaya Bāhu was descended from Sumitra, of the Lemeni (Sk. Lambhakarna) royal clan, who escorted the Bō-tree, and was created Jaya Mahā Léna, “Chief Secretary for War,” by king Devenipētissa, hence in third line called Jaya Mahā Léna Lord.\nround Sítávaka from the Dictator Alakésvara, who sought to kill the princes in order to strengthen his position. Legend has cast a halo round the youth of Śrī Parákrama Báhu, telling how, hunted from retreat to retreat by the emissaries of the tyrant, like many another hero of antiquity, his life was miraculously spared by the loyalty of humble herdsmen and peasants. Ultimately the prince, then styled Śrī Epáno, took refuge in the monastery at Rayigama, where the priest Vidágama Mahá Sámi of the blood royal befriended the youth, formed a conspiracy to assassinate Alakésvara, and placed him on the throne.\n\nThe prince would appear to have been sixteen years of age when he slew Alakésvara. This event took place about the year 1411. After this tragedy Śrī Parákrama Báhu seems to have returned to Rayigama, where he continued for three years. In 1415 he removed his seat to Kótté, and in the same year was duly anointed king. Hence arises the confusion of two distinct dates found in contemporary records of the accession of this monarch. Some date his reign from the actual year he acceded, others from the year he was formally installed. He embellished the capital with fine stone buildings, palaces, and a range of monasteries, opened up streets, and fortified the citadel with a girdle of ramparts.\n\nValentyn, probably following a more complete version of the Rájávaliya, records: \"Thereupon, having been crowned (which period is described as having been 1,958 years after the death of Budun, or 1,415 years after the birth of Christ), he remained three years at Reygamme (Rayigama), then removed to Cotta (Kótté), then built a fine city entirely of solid blue\n\n---\n\n1 Sk. Ádhipáda, \"Arch-duke,\" title of the Sinhalese Crown prince.\n2 Rájávaliya, p. 68; De Couto, Journ., R.A.S. (C.B.), vol. XX., p. 68.\n3 Journ., R.A.S. (C.B.), vol. XVIII., No. 55.\n4 Perakumbásirita, v. 28, indicates that he was crowned at Rayigama.\n5 Rájávaliya (Gunasekara), p. 68.\n6 \"This Maha Pracura (Parákrama) transferred his court to the city of Cota (Kótté), which he founded over again in the same fashion, and with the same motive as the kings of the Decan (Dekkan) so long afterwards founded the city of Xarbedar.\"—De Couto, Journ., R.A.S. (C.B.), vol. XX., No. 60, p. 68. The \"motive\" referred to is the miraculous circumstance of hunted animals turning on their pursuers.\nstone, and a beautiful palace of the same stone, but with a sort of new bangled galleries, and with a number of new temples of devils, and of the idols that he worshipped. Here he dwelt in company with a priest (i.e., Śrī Rāhula), whom he esteemed very highly, preserved here the relics of Budun, and built a special house or monastery for his priests.\"\n\nThe place referred to was the royal pile known as the Pas Mál Péya, \"the Five-storied Palace,\" which probably had been built on the principle of the similar quadrangular structures at Anurádhapura and Połonnaruva, the different tiers diminishing as the stories ascended. The magnificence of the building has been sung by the bards who flourished at the capital; among them by Śrī Rāhula in his Sēlalihini Sandēsa:\n\n\"Departing straight into the palace where\nOf moonstone built stand the long lines of walls,\nWhere waving in the wind smooth strings of pearls\nHang from the palace eaves where glitter gems\nShining upon the solid golden spire.\"¹\n\n\"Thence in a trice repair to the royal bower which stands with rows of mighty walls wrought of moonstone (crystal), where\n\non the ground hallowed by an anchorite's hermitage, which determined the Sākyas' choice of Kapilavastu as the site of their future city, according to the old Buddhist legend. As shown by Couto, the story reappears in tracing the origins of other Indian towns, and perhaps for the first time in Ceylon it has been adopted as fixing the site of Kōtté. Later, the legend was again introduced by the annalists to account for the choice of Senkadagala Nuvara (Kandy) as the capital.\n\nTravels by De Marignolli, p. 369, contains the following reference to Kōtté:—\"If we suppose he (i.e., Cain) built his city after the murder of Abel......this city of his is thought to have been where now is that called Kota, Ceyllan, a place where I have been.\" Note (by Burnell):—\n\"Kotta, or (Buddhist-classically) Jayawardhanapura, near Colombo, is first mentioned as a royal residence about 1314, but it again became the capital of the Island in 1410.....It appears to be represented as such in the great map of Fra Mauro, under the name of Cotte Civitas.\"\n\nMarignolli left Constantinople, May, 1339, passing overland to Pekin .... returning via Zaeton to Quillon in Malabar, December, 1346, or 1347, from which place he sailed about the end of 1348.... and appears to have been accidentally driven by the winds to Ceylon. He returned to Europe, 1353 (see \"Ceylon,\" by an Officer, vol. I., p. 263).\n\n¹ Macready's Sēlalihini Sandēsa, v. 17.\nwave in the gentle breeze strings of smooth pearls upon the eaves of roofs glittering with the solid golden spire around which dart the sheen of gems.\"¹\n\nThe site of the palace on an eminence overlooking the ancient royal street now disused is still known as Pasmálpéya-watta, \"the garden of the five-storied palace,\" but scarce one stone is left on another where the mighty Parákráma held court.² \"The new temples of Devils and of the Idols that he worshipped\" clearly refer to the Hindu Déválas in the capital. Alakésvara had raised shrines for Vishnu, Lakshmana, and Kártikéya on the four corners of the city wall,³ and the king maintained them and perhaps added to them.\n\nStill in two places in the ancient town, called to this day púna lin, granite columns sunk into the ground mark the spot where the sacred vessel (púnáva) of the god had been deposited. One of the most magnificent of these shrines was the Mahasen Mahá Páya, the great palace of Mahasen, described as having risen on the southern side of the city flashing like \"a blazing orb.\"⁴ Dedicated to the god of war, the presiding genius of\n\n---\n\n¹ In Ancient Ceylon pinnacles of royal and ecclesiastical edifices were usually wrought of gold or silver and surmounted with precious stones. According to Hiuen Tsiang (Buddhist Records of the Western World (Beal), vol. II., p. 248), a large ruby crowned the spire of the Daladá Máligáva at Anurádhapura.\n\n² Possibly this was the former site of the Seneviraja-vásala, Alakésvara's residence.—Journ., R.A.S. (C.B.), vol. XVIII., p. 389.\n\nHere also stands, or rather stood till very recently, the granite coronation platform of the kings of Kótté, overlooking the tank where Alakésvara was assassinated.—Journ., R.A.S. (C.B.), vol. XVIII., No. 55, p. 305, App. G.\n\n³ Journ., R.A.S. (C.B.), vol. XVIII., No. 55, p. 285, App. A.\n\n⁴ The palace of the god-king Mahasen, variously adorned, you will behold on the southern side, within the city of our king, appearing like a shining ball from thousand rays, flashing with solid gems, with banners of the lord of fowls (i.e., the cock, sacred to the god) rising on golden handles.\"—Sélatihini Sandésa, v. 25.\nthe city, the shrine contained a painted image of Kártikéya, adorned with jewels.\\(^1\\) The Mahasen Mahá Páya was hung with banners borne on gilt handles bearing the god's device, the emblem of a cock (sévulu), and was probably sheathed with copper.\\(^2\\) The most important edifice built by the king was the Daḷadá Máligáva, \"the Temple of the Sacred Tooth.\" It was a three-storied structure\\(^3\\) in the form of a Crown,\\(^4\\) constructed of stone with finely carved granite pillars, surmounted by a pinnacle of solid gold. The building would appear to have been supported by four detached chapels or shrines in stones at its four angles, dedicated to the four Hindu gods Náta, Saman, Vishṇu, and Síva. Hindu influence was very strong at the period, chiefly due to the ascendency of the Alakésvaras in the Councils of State and the numbers of Brahmins who crowded to court from the neighbouring peninsula. Moreover, the king himself seems to have favoured Hinduism. He possessed a wide knowledge of Sanskr̥t, and was probably influenced by the Hindu sacred works he had read, by the Brahmins by whom he was surrounded, and by the teachings of the Royal Tutor Śrí Ráhula, who was deeply skilled in all the lore of the Hindus, and would appear to have entertained liberal notions on the question of religion. This epoch saw in a marked degree the compromise between Hinduism and Buddhism which had existed in Ceylon from the earliest times. This toleration sprang from two causes: the spirit of the adaptability of Hinduism to changed conditions and alien ideals on the one hand, and on the other to the\n\n---\n\n\\(^1\\) With a joyous mind bow down and offer the tribute of your heart to the god-king Mahasen, refulgent in the blaze of glory, acquired what time he seized the spear against the Titan-king Padma Asura, and piercing him transpired (Mount) Meru.\"—Paravi Sandéśa, v. 42.\n\n\\(^2\\) Selalihini Sandéśa, v. 25; Kovul Sandéśa, Col. Museum MS. E 6 and G., p. 37 (reverse of page).\n\n\\(^3\\) Selalihini Sandéśa, v. 16; Mahávaṇsa, ch. 91, v. 17.\n\n\\(^4\\) Paravi Sandéśa, v. 39.\nwisdom of the Buddhist hierarchs who realized the peril to\nthe church in an attitude of avowed hostility to a faith\nwhich was favoured by the king, nobles, and even by the\npeople.\n\nHowever, this catholicity did not make the king neglect\nhis claims to the Buddhist church. The Mahāvaṇsa records\nwhat he did for the national palladium. \"For the Tooth-\nrelic of the Sage, the king caused to be built a three-storied\npalace delightful and beautiful to behold, and made a golden\ncasket finely set with the nine gems, and he encased it in\nanother golden casket set with excellent gems, shining with\nvari-coloured rays, which he encased in another golden casket.\nMoreover, when he had made a great and excellent covering\ncasket, gilt with the best and most resplendent gold, that king,\nwho longed for happiness during the continuation of existence\nand even at extinction (nirvāna), placed the Tooth-relic\nwithin the four caskets.\"¹\n\nParākrama also built presumably within the city a spacious\nmonastery² for the priests, which was early in the reign presided\nover by the hierarch Mahā Sāmi Vanaratana, the Saṅgha-rāja,\nthe supreme pontiff. A great pōya-gé,³ or \"ordination\nhall,\" with the sacred boundary duly laid out, rose in the city\nin testimony of the king's devotion. Here under the direction\nof Parākrama numbers of novices were periodically received\ninto the church amid great public rejoicing.\n\nIn memory of his mother, Śrī Parākrama Báhu built a\nmagnificent shrine and a college for priests at Pēpiliyāna,\n\n¹ Mahāvaṇsa, ch. 91, v. 17.\n² Rājāvaliya (Gunasēkara), p. 68.\n³ මාර්ගය සහ අධිකාරීන් වෙත පොයා ගැනීම සහ අධිකාරීන් වෙත පොයා ගැනීම\n\nThe temple which the glorious lord Śrī Parākrama built for the pur-\npose of frequently causing the rite of ordination to be performed, when\nassisted by the great body of the clergy he had erected and joined the\nsacred boundary. Friend, (that) behold and with heart and mind well\npleased take your way.—Girā Sandēśa, v. 57.\ncalled after her the Sunétra Dévi Pirivena.\\(^1\\) It was beautifully painted and had an áráma, or grove attached to it, the whole being surrounded by a high stone wall with carved gateways. Numerous fields and villages were dedicated to it, and for three days the priests who had assembled for the dedication from the three kingdoms of the Island were lavishly treated. Here, by royal command, the Buddhist Canon, the Tripiṭaka, with the Atṭhakathá, its \"commentary,\" and tīká, \"gloss,\" was inscribed, and lands were allotted to the maintenance of the scribes who were daily engaged in the task. It was an age of great literary activity and educational progress. Ecclesiastical colleges or pirivenas flourished throughout the country and were presided over by abbots, distinguished alike for their knowledge of theology, as for their piety and devotion to the faith: the great Padmávati Pirivena at Kēragala, under the presidency of the Rájaguru Vanaratana Saṅgharája, the Áranyak (\"the woodland cloister\") at Palábhatgala under the rule of the scholarly Śrí Dharmakírti Saṅgharája, the Vijaya Báhu Pirivena at Toṭagamuva under the control of Śrí Ráhula Saṅgharája, the Śrí Ganánanda Pirivena at Rayigama under the warden of the Mahá Nétra temple, the High-Priest Maittreya Mahá Stavíra, and the Sunétra Mahá Dévi Pirivena at Pepiliyána under the direction of Tipiṭaka Mangala Saṅgharája, the Master of the Tripiṭaka. These abbots were great scholars, skilled in all the arts, sciences, and secular learning of the time. The range of their scholarship and the reason of the renown they enjoyed may be judged by a study of their works which have descended to us. Their influence is still felt, for the greatest scholars in\n\n\\(^1\\) Within the delightful golden temple (vihára), which our noble king had built for dedication to the triple gem in memory of the saintly queen-mother, who like Aditi to the Solar race the mother of the sun, lived in the hearts of the people, Friend, joyfully enter the image-house of the Sage so that you may hereafter attain divine salvation (mólksha), and with the contemplation of the famed virtues of the Sage lay aside sloth, springing from the boundless ocean of transmigration (i.e., being mortal in the toils of earthly existence it costs an effort to take to religious services), and repeating the virtues of the Sage, worship the images and the paintings, and carry the merit to your heart.—Girá Sandéśa, v. 63.\nthe next five centuries lived in the afterglow of their classic tradition, and modelled their thoughts and language, both poetry and prose, on the productions of the fifteenth century.\n\nIt would appear that the choice of Śrī Parákrama Báhu to the throne was ratified by the Emperor of China, who claimed the overlordship of the Island after the capture of the late monarch. According to Chinese records the election of this ruler was confirmed by an edict from Nankin.\\(^1\\) The monarch realized that at this crisis it would not be politic to repudiate the suzerainty of China, which at most was shadowy, and bring on a repetition of the evils which an open flouting of Chinese authority had brought about in the preceding reign. He bided his time till he reorganized the kingdom and consolidated his power to throw off the allegiance to the Dragon throne. The suzerainty involved a yearly tribute,\\(^1\\) which was first paid to the envoys who brought the ratification from China. The second time they came after an interval of five years. Next they came \\textit{circa} 1459,\\(^2\\) but at this period the Sinhalese monarch was at the zenith of his power. The Lord of \"the three-fold Sinhala\" and the overlord of South Indian cities would acknowledge no master, and the Chinese junks sailed away without the tribute. This was the last time that the imperial Chinese galleys swept our seas, but they were soon to be replaced by the keels of a power far more formidable than the Manchu Tartars.\n\nTo soothe the national sentiment which had been outraged by the previous royal alliances with the alien Girivansa\\(^3\\) which brought on the Alakésvara dominion, Śrī Parákrama Báhu married a princess from the village of Kiravella\\(^4\\) in Beligal kóralé, described as a daughter of the Lord of the Uda-pas-raṭa, \"Five highland districts\" (Kandy), and a descendant of the Sákya prince Anuruddha.\\(^5\\) At the instance of Vídágama Mahá Sámi, he installed his younger brother Máyádunné\n\n---\n\n\\(^1\\) Tennent's \"Ceylon,\" vol. I., p. 624.\n\n\\(^2\\) Tennent's \"Ceylon,\" loc. cit., p. 625.\n\n\\(^3\\) Probably the Sk. equivalent of the Tamil royal dynasty of Malaiman, which had its seat at Conjeveram. \\textit{Attanagaluvansa} (Sinhalese), p. 1.\n\n\\(^4\\) \\textit{Rajávaliya}, p. 68; Valentyn.\n\n\\(^5\\) \\textit{Mahávansa}, ch. IX., p. 37.\nParákrama Báhu in the government of the Hatara Kóralé, the Four Kóralés, with the dignity of Yuva-rája. He held court with great pomp at Máyádunu Nuvara, later Sítávaka, as described in the Paravi Sandéśa.\n\nThe king had no male issue by his queen, but he had a daughter, Ulakundali or Ulakuda Déví, a princess who was educated in all the learning and accomplishments of the time. She was married circa 1449–1450 to a prince of the old Sinhalese royal line called Cholca Raya.¹ Having no male offspring of his own, the king was anxious to obtain a grandson of the true line to succeed him on the throne. The king’s wish is reflected in the poetical message contained in Śrí Ráhula’s Selalihini Sandéśa, invoking the god-king Vibhísana at Kelaniya, for the blessing of a son for the princess Ulakuda Déví. The prayer was granted, and the birth of the crown prince was celebrated in the capital with all the manifestations of public rejoicing. We catch an echo of the prevalent note of joy in the stanzas of Śrí Ráhula recording the event:\n\nIn the 36th year (of King Parákrama Báhu, i.e., 1451), in the ninth month of the bright moon, when the full moon was seen in the heaven in conjunction with the star (asterism) Aslisa, was born the royal babe wondrously fair, to be a constant source of prosperity to the Solar race.\n\nWith the noise of the thunder of hoofs of steeds galloping (to the tune of) chiming bells hung to them, with the sound of the flapping of chowry-tied ears of lordly tuskers, with the loud blare of pealing, crashing musical instruments (music) and trumpet-shells of victory, like another ocean rose the city’s ceaseless roar.²\n\nNo Sinhalese prince for the last three centuries had been born with fairer hopes or under brighter auspices, and few met with so untimely and tragic an end.\n\n¹ It is difficult to identify the Sinhalese name in the Portuguese disguise of De Couto, obviously a corruption. According to tradition the husband of Ulakuda Déví was Nallúrutun, Sannas Minister, at whose request the Selalihini Sandéśa, invoking an heir to the princess, was composed.\n\n² Selalihini Sandéśa, vv. 109, 111.\nWhile still a mere youth his grandsire, jealous of preserving the crown in his family, swore him in as heir to the throne and prince-regent (yuva-raja). This action was prompted by a danger which the king’s own generosity had called into being. One Panikkan,¹ an adventurer of royal race from the neighbouring coast of Malabar, found an asylum and a Sinhalese bride at the court of Kótté. He had by her two sons, Champaka Perumal, called by the Sinhalese Sapumal Kumárayá, and Jayavíra, known to the people as Ambulugala Kudá Kumárayá,² whom Śrí Parákrama Báhu adopted as his sons according to the ancient custom of instituting, probably apprehending, the failure of male issue. Some time after that the empress gave birth to a daughter, the princess Ulakuḍa Déví, mother of Jayavíra.\n\nUltimately, the rivalry between his warlike and ambitious foster sons and his grandson created an element of civil strife in the State, and proved the means of finally extinguishing Parákrama’s own line on the throne. Fears for the future welfare of the kingdom did not alone occupy the king’s attention. Soon after (circa 1451–1452), a graver peril requiring immediate attention confronted the monarch. Perhaps encouraged by the success of previous invaders, the king of Canara menaced the realm. De Couto thus refers to the event: “Not long afterwards the emperor was very unexpectedly attacked by a large army that had been sent by the king of Canara to Ceylon with a numerous fleet, but the prince having speedily gathered together some troops defeated that mighty army, which act gave him a very formidable name throughout the whole East, and caused him to be greatly beloved by his people.”³ According to the Kovul Sandéṣa the fort of\n\n¹ De Couto, Journ., R.A.S (C.B.), vol. XX., p. 69.\n² Śrí Kuḍá Kumárayá, younger prince, called Ambulugala from the capital of his principality. His name was Jayavíra, which was also the name of the king’s grandson, the son of Ulakudayá Dévi.\n³ It would appear from references in contemporary literature that Parákrama Báhu carried the war into the enemy’s territory, but this cannot clearly be ascertained, because of the undoubted invasion of India soon after. Perhaps the succeeding events formed part of the same campaign, and originated in the attempt of the king of Canara to conquer Ceylon.\nJávakakótté (Chávákachchéri) was built and manned by Malays to keep back the Canarese. A contemporary bard alludes to the event in the following lines:\n\nHaving made the four oceans the bounds of his impartial august sway, he blew away the fierce wrath of the famous Kannaḍi (Canarese) king.\n\nIn this reign we see the beginnings of that trade in cinnamon to secure which the Island became in later times the battleground of the Dutch and Portuguese. Shortly after repulsing the Canarese invader the king despatched a vessel with cinnamon to the Malabar Coast, which landed in the bay of Adirámapatṭanam or Adrampet. But the ruler there, Rája Víra Rámá Malava Ráyar, probably a feudatory of the Lord of Chola, made a descent on the vessel, plundered the cargo, and took all the men captive. So successful had been his reorganizing policy that when intelligence of this wanton act of aggression reached Kótté it found the monarch strong enough to take immediate measures in retaliation. He organized a punitive expedition, and a large fleet carrying troops sailed at the royal bidding to punish the insolence of the Tamil prince. Parákrama’s troops ravaged his country with fire and sword. Víra Rámá himself was slain. Thence the Sinhalese forces entered the Chola (Mysore) country, and plundering several villages and a port on their march, they stormed the fortress Mákudam Kótté, comprising seven dependent villages, which thereafter yielded a yearly tribute to Kótté.\n\n---\n\n1 Girá Sandéśa, v. 132.\n2 In Valentyn, Driampatṭanam; in the Rújávaliya, Áyapattana, corrupted in some MSS. to Yapápatṭana, was Adrampet (Adrampatnam, Advira Rámapatnam in Tamil, “the city of the great hero Rámá”), seaport in the Pattu Kotta táluk, Tanjore Dist., Madras Presidency, lat. 10° 20' 10\" N., and long. 79° 25' 40\" E. The sea trade is chiefly with Ceylon, whither rice is exported in exchange for betel and timber.—Hunter's Indian Gazetteer.\n3 Rújávaliya, p. 69; Valentyn.\nvictory the army returned home rejoicing. The following stanzas from the Girā Sandēsa refer to these events in glowing strains:\n\nThe army that this noble Lord despatched, crowded in vessels, when they had captured the intervening foreign countries, seized the seaport of Rāyanvala.\n\nHe despatched in one great armament (lit. at one and the same time) his mighty army on broad great ships, for battle chiefly against the country of Chola in India and Rāmapaṭuna (Adi-rampatnam), the seaport.\n\nHe subdued the might of the Tamil host, ever lusting for battle: on the plains of India he raised on high the sound of victory, and on fair Lankā conferred the benefits of that victory.¹\n\nAnother poet, the priest Śrī Rāhula, thus alludes to these conquests:\n\nHe mastered the text of the Tripitaka in the words (tongue) it had been preached by our Master. He stormed the mountain strongholds, built aloft, and burst asunder the gates of Kannada\n\n¹ Girā Sandēsa, vv. 125, 126, 127.\n² Perakumbāsirita, v. 75.\ncity (Canara). Fair with jewelled ornaments the delightful king Parákráma of golden hue, extirpated the race of the hostile Mukara¹ king who offered him battle and slew his queen.²\n\nThere was tranquillity in the realm and predominance abroad when provincial independence rose again at the call of the Kandyans. The kingdom of the \"five highland districts,\" Kandaúda Pas-rata,³ or the Kandyan kingdom, was at this period ruled by an under-king called Jótiya Siṭu Raja.⁴ Probably an able adventurer, not of princely rank, as his name implies, had vaulted to the Kandyan throne and had up to the present acknowledged the over-lordship of Kótté by an annual payment of tribute. Ambitious to reign as an independent prince, he ceased to furnish the annual contingent of labourers for the customary service to the emperor, and declined to forward to the capital the share of the revenue due to the imperial treasury.⁵ He sought to win over his subjects by a magnificent display of imperial power. He summoned the people of the five districts to assemble for his public assumption of supreme authority, and he bid for the support of his chieftains by lavish grants of villages and great titles of honour, which were more prized by the Kandyan nobles we are told even at that period than endowments of land.⁶ When intelligence of the revolt of king Jótiya Siṭu reached the court, the emperor summoned the army, gave the chief command to Jayavíra Kuḍá Kumárayá, who was stationed at Ambulugala, and entrusted him with the task of reducing the highlands (circa 1463–1467).⁷ The untrained mountaineers\n\n¹ Mukkaras, an Indian tribe.\n² I.e., by killing the queen he destroyed the chance of king Mukara obtaining an heir, and thus destroyed his race.\n³ Udunuvara, Yaṭinuvara, Hárispattuva, Héváheta, Dumbara.\n⁴ As his name signifies, Jótiya Siṭu Rája probably did not belong to any of the recognized Kshatriya ruling houses, but was a member of the Vaisya caste (Velanda) to which the Setṭi or Siṭu (Sk. srēśṭha, \"nobles\") belonged. Accessions to the noble orders by Setṭi were frequently made from the ranks of the common people, the qualification being the possession of a certain stated amount of wealth. The title thus conferred became hereditary.\n⁵ Rájávaliya, p. 69.\n⁶ Valentyń's \"Account of Sinhalese History.\" (Appendix B.)\nwere no match for the seasoned soldiers of the royal army. Hundreds of the Kandyans were mown down, and many of the nearest blood relations of the rebel prince were taken captive and sent to the capital. Jótiya Situ was himself driven out of the highlands,\\(^1\\) and his territory entrusted to a prince of the Gampola royal line\\(^2\\) and to a council of ministers with the obligation of vassalage to the throne.\\(^3\\) The victor returned in triumph to Kótté and presented himself before the emperor, who sent him back to his provincial government loaded with ranks and honours.\n\nSome years later, the king proposed to consolidate his power by bringing the scattered jurisdiction of the Vanni chieftains under the central authority. Centuries ago, the intervening belt of country between the kingdom of Jaffna and the Sinhalese provinces of the Sat Kóralé and Uda-pas-raṭa had been overrun by warlike bands of Tamils from the opposite coast, under turbulent chieftains called Vanniyárs. They settled in this wild territory, carved out kingdoms for themselves, and defied the authority of successive Sinhalese rulers.\n\nPowerful monarchs like the great Parákrama, Vijaya Báhu III., and Pandita Parákrama Báhu II., induced them more often by gifts than by force to acknowledge the Sinhalese\n\n---\n\n\\(^1\\) ओ च रेतं अर्धे दिवं\n\n\\(^2\\) प्रेतं शरणं देवं देवं\n\n\\(^3\\) प्रेतं शरणं देवं देवं\n\n\\(^4\\) ति ति ति ति ति ति ति ति\n\n—प्रकृतिकाव्यम्, 58 अ.\n\nWhat time Jótiya assembled his four-fold array, the body of darkness which went by the name of king Jótiya Situ was scared away by the Solar king Parákrama, like another king Bátiya, and fled for refuge to a foreign clime.—Perakumbásirita, v. 58.\n\nThroughout this stanza there is a play on the name of Jótiya, meaning “moon or star,” which is difficult to be adequately rendered into English. King Bhátiya Tissa, circa 500 B.C., according to tradition, is credited with having repelled a formidable invasion of an Indian tribe called Káka Mukkáru.\n\n\\(^2\\) The Gampola royal house sprang from one of the princes who escorted the Bó-tree and belonged to the Solar dynasty.\n\n\\(^3\\) According to Valentyn, Kuḍá Kumárayá was himself granted the principality.\nsupremacy. But the homage thus rendered was only at intervals and during their reigns. For nearly the ten previous centuries, owing to the dissensions in the kingdom, the Vanni chieftains left to themselves, had grown powerful and recognized no over-lord. The district had become Tamil, the thick jungles which covered the land made the country inaccessible, and the rocky fortresses where their forts were pitched made their strongholds impregnable. Parákráma decided to reduce them. At this period the tract was divided into eighteen districts or Vannis, each ruled by a Vanniyar or chieftain. They warred and hunted, and roamed the thick woods with the wild elephants in unrestrained liberty, until the silence of their solitudes was broken by the tramp of the royal army. Parákráma Báhu himself marched at the head of his forces, and personally directed operations from the city of Dambadeniya, which he made his headquarters. After a stubborn campaign, during which several hill forts were stormed, the Vannis at length submitted. They paid a yearly tribute of elephants to the suzerain, which they continued to render to Kótté till the reign of Don Joãõ Dharmapála (1551-1597).\n\nThe conquest of the Vannis on his frontiers alarmed the king of Jaffna, and he took precautions to safeguard his dominions. Relying on his former prestige, Árya Chakkravarti defied the Sinhalese monarch by having himself also proclaimed emperor of Ceylon. By this act he publicly asserted his claim to Sinhalese territory and reminded his neighbour of the time when the king of Jaffna exacted tribute from Sinhalese lands and ports. Šrí Parákráma Báhu had at length obtained the provocation for putting in execution a design which he had long meditated. He was incensed at the affront, and determined, to quote his own words, “there should no longer be two kings in Ceylon.” He entrusted the royal army for the conquest of Jaffna to his general, Sapumal Kumára, with this grim message to be conveyed to the lord of Jaffna: “Tell him,” jested the king, “since it ill becomes that Ceylon should have two emperors, I have sent my general to relieve you of that\n\n---\n\n1 Mahávaṇsa (Wijesinha), pp. 272, 280.\n2 Perakumbasirita, v. 46; Paravi Sandéśa, v. 34.\n3 Rájávaliya, p. 68.\nnew title, and as you could not rest and were not content with what you had, to give you somewhat more rest.”¹ The conquest of Jaffna, though lightly undertaken, was not easily achieved. The power which scarce half a century ago had owned the allegiance of the greater portion of the Island, and was still mistress of the seas, would not yield her independence without a struggle. Ārya Chakkravarti’s outposts offered a stubborn resistance to the invader, and the Sinhalese general, after having raided several villages belonging to the kingdom of Jaffna and taken many prisoners of war, had to retire without being able to penetrate to the northern capital.² The presentation of the Tamil captives from Jaffna at court concealed from the people the failure of the main object of the expedition, and gave to the war in the popular imagination the character of another triumph of the Sinhalese arms. However, Śrī Parákrama Báhu was not content with the results of the campaign. Soon his army was again in motion under the same general to conquer the north.³ Sapumal Kumára captured the chain of border fortresses which had been erected by the king of Jaffna as a security against any attack on the capital.⁴ When intelligence reached him that the Sinhalese commander had burst his defences and was marching on the city, he despatched three of his most distinguished chieftains to oppose his progress. First went forth Kontakára Demalis, then advanced Panigavaram, who was followed by Valamunivorusa.⁵ In a short space, they were one after another all cut down by Sapumal Kumárayá. The anxious monarch, at length, it is stated, despatched a brave chieftain called Varakára,⁶ who had taken an oath to hew the Sinhalese leader in pieces, to resist the enemy’s advance. As he forced his passage through the enemy’s ranks Varakára was stabbed by the Sinhalese ere he made his way to Sapumal Kumárayá. Mounted on a black charger Sapumal Kumárayá entered Jaffna\n\n¹ Valentyn.\n² Rájávaliya, pp. 68, 69.\n³ The route taken by Sapumal Kumárayá’s army may be followed in the Kovul Sandésa. The old road lay from Kótté through Kelaniya, Wattala, Negombo, Chilaw, Mannar, Chávákachchéri (Jávaka Kótté).\n⁴ Rájávaliya, loc. cit.\n⁵ Conta Cara Demalis, Panigevorum, Valamunivorussa, Varacara—Valentyn.\nin triumph, unconscious of any danger. However, he had misjudged the wily character of his foe, and nearly paid with his life the penalty of his rashness. Árya Chakkravarti had placed an ambush of a choice body of his troops called the Doluvara to strike down the prince's horse.\\(^1\\) From the histories it would appear that he almost fell into the snare. The conqueror of Jaffna was a champion of exceeding great size, of prodigious strength, of a fine majestic presence, and a clever horseman.\\(^2\\) He extricated himself from the press as much by his skill in striking down the foe who crowded round him as by his fine horsemanship. \"He curvetted his steed with spirit and grace,\" runs the chronicle, \"struck the foe in the very centre and made the streets of Jaffna run red with blood.\"\\(^1\\)\n\nÁrya Chakkravarti fled the realm.\\(^3\\) His queen and children were taken captives to Kótté to deck the triumph of the conqueror.\\(^1\\) In a stanza of the Selalihini Sandésa is reflected the prevalent popular feeling of the time, the note of eager expectation, and the confident hope of victory with which the people awaited his return.\n\n\"Lo! Sapumal Kumárayá returns from Jaffna ta'en,\nLeader midst a mighty host that follows in his train,\nAbove the snowy chatra spread with many a gem bedight,\nHimself on steed of sable hue, recalls the Sun god's light.\"\n\n\\(^1\\) Rájávaliya, loc. cit.\n\\(^2\\) De Couto, Journ., R.A.S. (C. B.), vol. XX., p. 69.\n\\(^3\\) In fierce blaze of majesty that king (i.e., Sapumal Kumárayá) always (shone) like the sun, and the fame of his might reached even the eighteen States of India. Heedless, unmindful of affairs, Árya Chakkravarti, having brought great misery on himself, leaving his country fled across the ocean.—Kovul Sandésa, Colombo Museum MS., H. 16, p. 51 (reverse).\n\\(^4\\) Macready's translation, Selalihini Sandésa, v. 28.\nWith the spoils of war Sapumal Kumára presented himself before Parákrama at court. Honours and distinctions were showered on him, and he was again despatched as a royal commissioner to settle affairs in the newly acquired country. We catch a glimpse of the prince in some verses in the Korul Sandéśa, which was addressed to him at the period by the incumbent priest of Tilaka Pirivena at Dondra, congratulating the conqueror of Jaffna on his victory and invoking a blessing on him and his army:\n\nJoyfully convey this message to the thrice-auspicious great royal prince Sapumal, who driving afar off king Árya Chakkavarti, having consolidated Jaffna, now flourishes.\n\nJaffna at the time of the conquest was a populous city with wide streets, storied houses, fine gardens, palaces, and Hindu temples. Various races, such as the Tamils and Mallalas, composed its army, which included the brave regiment of the Doḷuvara, the special guard of the king of Jaffna. This army which was not disbanded, we find easily reconciled to the changed situation, and along with the Sinhalese troops garrisoning the city under the orders of Sapumal Kumárayá:\n\nSapumal Kumárayá remained as ruler of Jaffna for some time, actively engaged in settling the country and exercising the royal prerogative of administering justice in open\n\n---\n\n1 Kovul Sandéśa, Colombo Museum MS., pp. 49–50. Among the shrines mentioned are temples dedicated to Rámá and the god-king Punála.\n\n2 (?) Sk. dridha, strong, hardy, and vara, noble.\nShortly after he was succeeded by a nephew of the last king, Árya Chakravarti, called Árya Chakravarti Addum Perumál, who was placed on the throne with the obligation of vassalage to the Sinhalese crown. Sapumal Kumárayá thence appears to have gone as viceroy to the ancient capital of Yápahu, the seat of the provincial government of the Hat (Seven) Kóralé, which he continued to rule till summoned to the imperial throne. Of the events that followed the death of Śrí Parákrama Báhu and of the origin and youth of the princes Sapumal Kumárayá, Jayavíra Kudá Kumárayá, and Jayavíra the king’s grandson, who were all afterwards destined to play so important a part in the history of the Island, the old Portuguese historian De Couto alone of the annalists has preserved\n\n---\n\n1 Although it would appear from the Rájávaliya (Gunasékara’s translation), pp. 69, 70, and Kovul Sandesa, that Sapumal Kumárayá continued as ruler of Jaffna after the subjugation of the peninsula till he left it at the head of an invading force to march on Kótté, the facts would seem to be otherwise. Valentyn and the Yalpana-Vaipava Malai (Brito), pp. lxxv.-lxxvi., the former derived from Sinhalese sources, and the latter, a Tamil historical record, both agree that Jaffna was restored to a nephew of Árya Chakravarti. Valentyn alone gives the name Arietattoe Adduru Prauwmal, clearly a corruption. The error in the Rájávaliya appears to have arisen from the similarity of the names Yápápatuna (Jaffna) and Yápahu (in Hat Kórale), and their confusion by ignorant copyists. The Kurunégala Vistaraya, an old topographical record, compiled about the 15th or 16th century, incidentally mentions the fact that Sapumal Kumárayá ruled as viceroy at Yápahu after leaving Jaffna, and thus gives the clue to the mystery.\n\n3 The events following the death of Śrí Parákrama Báhu more properly belong to the reign of Jayavíra Parákrama Báhu. De Couto considerably modifies the relation in the Sinhalese Rájávaliya and throws a different complexion on the conduct of the conqueror of Jaffna.\nto us the memory. \"This king had no son, but had a daughter who was married to Cholca Raya of the race of the ancient kings, by whom he had a son, whom his grandfather swore in as heir to the throne. In the time of this king there arrived at the city of Cota (Kóṭṭé) from the opposite coast a panical\\(^1\\) of the caste of those kings, a man of great activity and sagacity, whom the king welcomed, and married him to a woman of rank, by whom he had two sons and a daughter; these lads were brought up in companionship with the prince (\\textit{i.e.}, Jayávira\\(^2\\)), with whom there was also a first cousin of these lads, the son of a sister of his mother's. These three lads grew up, and came to have such power in the kingdom, that the king noticed in them a change of disposition, from which he feared that on his death they would murder his grandson.\\(^3\\) And dissembling in regard to this, he resolved to separate them, which he did, commanding the two brothers to go and subject for him the king of Jaffnapataõ, which had rebelled against him, conferring on the elder one, who was called Québa Permal (Champaka Perumál), the title of king of that dominion with the obligation of vassalage. This man, who was a very great horseman, and of the greatest size and strength of any of that time, in a few days made himself master of that dominion.\"\\(^4\\)\n\nBefore closing the record of this reign one important act of civil administration deserves to be noted. When he had consolidated the country Šrí Parákrama Báhu appears to have placed on a proper basis the taxation of the country. There is no information available from which we can ascertain the basis on which the adjustment proceeded. However, it is probable that the reform was of far-reaching effect, though the priestly chronicler would have us believe that it was\n\n---\n\n\\(^1\\) Ordinarily Panical or Panikar is identical with the class of \"fencing-masters\" or \"astrologers\" (\\textit{vide Hobson-Jobson}). I am inclined to think that Panical here is the proper name Pannikan, common in the neighbouring coast. Besides, Panical is described as being a member of the royal caste, which he would not be if he belonged to the class of \"fencing-masters\" or \\textit{panicals}.\n\n\\(^2\\) Son of Ulakudaya Dévi and the grandson and heir-apparent of Šrí Parákrama Báhu VI.\n\n\\(^3\\) An apprehension which subsequent events justified.\n\n\\(^4\\) De Couto, Journ., R.A.S. (C.B.), vol. XX., pp. 68 and 69.\neffected solely for the benefit of the church. The only information on the subject is the following statement recorded in the *Rájaratnákara*.\\(^1\\) \"Throughout the whole of Lanka he set apart and made over to the Tooth-relic lord land dues and port dues.\"\n\nAfter having his grandson, during his own lifetime, sworn in as ruler, Mahalu Parákrama Báhu, the \"aged\" king,\\(^2\\) as his subjects loved to call him, passed away in the 55th year of his reign and in the 52nd after his coronation (1466–1467).\\(^3\\) Summoned to the helm of a disorganized State while yet a boy, he displayed a capacity and a genius in statecraft far beyond his years, and only matched by the greatest of his predecessors. Confronted with the danger of foreign invasion ere he was securely seated on the throne, he displayed the ready resource of a great commander by rapid concentration and sudden attack in beating back the invaders; as later he displayed a wary strategy and dogged patience in his campaign against the Vannis.\\(^4\\) His wise and far-reaching statesmanship was seen in his temporizing policy with the Chinese, in the adjustment of the taxation of the country, and in diverting the activities of his ambitious foster son, Sapumal Kumárayá, from intriguing against the succession of his grandson into the profitable channel of reducing Jaffna.\\(^5\\) He combined qualities seldom united, of skilful generalship and rare administrative power, with scholarship and love of culture. Along with the lofty courage, religious devotion, and ability to rule, which distinguished the race of Asóka,\\(^6\\) he had inherited their exquisite sense of taste, their love of magnificence, and passion for noble buildings.\\(^3\\) He found a State distracted by civil\n\n---\n\n\\(^1\\) Printed edition, p. 46.\n\n\\(^2\\) \"Mahalu\" also means \"elder.\" Perhaps the king was so styled in later years to distinguish him from his grandson Jayavíra Parákrama Báhu, whose administration probably commenced during the lifetime of his grandsire.\n\n\\(^3\\) According to the chronicles he was sixteen years of age at the date of his accession (1411–1412): hence the king was born *circa* 1395, and died in his 72nd year.\n\n\\(^4\\) *Girá Sandésa*, v. 128.\n\n\\(^5\\) Couto, Journ., R.A.S. (C.B.), vol. XX., p. 69.\n\n\\(^6\\) Valentyn, *Girá Sandésa*, v. 138.\ndissension, shorn of her former possessions, a prey to foreign adventurers, yielding tribute to an alien nation; he left a united realm, comprising the whole Island, respected by his neighbours abroad as the most formidable power in the East, having all her former territories restored, with new conquests added of cities over sea which acknowledged his over-lordship. His mild and beneficent sway and his victories deeply attached him to his subjects, who, as we read in contemporary verse, compared him to his namesake the Great Parákrama; and as the shadows of his long reign lengthened, his grateful people called to mind the old prophecy, which foretold the dawn of a bright era under a great and righteous emperor who would rule the world with clemency and justice; and they loved to behold mirrored in their beloved sovereign the righteous lord who would bear sway \"when twice five thousand years have rolled away.\"\n\n\"O tell me, traveller, from whence you wend your way? — From Samanala, Brahman, have I arrived this day. What news from god Sumana, who holds thereo'er chief sway? When thousand twain, and hundreds five, of years have passed away, The world to rule, a king shall come, so folk who dwell there say! King Perakum, then citizen, that is, whom all obey.\"  \n\nThe fabric of Government that he had reared with such patience and toil withstood the incessant attacks made on it by civil discord and foreign aggression for nearly the space\n\n---\n\n1 Girá Sandésa, v. 128.  \n2 Girá Sandésa, v. 129.\n\nTell (me) O! traveller! where do you come from?—O! Brahman, (I am returning) from having gone to Samanala. What news is there in that country, O! Brahman, from the chief god Sumana? When two thousand five hundred years shall have elapsed, they say there will come a king, the chief of the world. Then it can be said, O! citizen, that is the king Perakum of this day.—Perakumbásirita, v. 112. (Skeen's Adam's Peak, p. 39.)\nof a century before it ultimately crumbled to pieces under the impact of disintegrating forces; still, whatever of native institutions, manners, and dignities that have survived to this day in the maritime lowlands may be traced to his age. The peace and tranquillity and the greatness of his reign were such that in the dark days of Portuguese tyranny and religious persecution men looked back to his time as to a golden age, and awaited a national deliverer in a successor of his line who would continue his victorious tradition, build anew the walls of his capital, and revive the glory and the ancient faith of the Sinhalese monarchy.\n\nAPPENDIX A.\n\nIt is strange that there should be so much misconception about the identity of Śrī Parākrama Bāhu VI.'s parents, considering that there is direct contemporary evidence on the point.\n\nThe Kudumirisa sannasa of this king refer to a grant by the \"late king my father,\" which proves that Śrī Parākrama Bāhu VI. was the son, not of a mere prince, but of a reigning sovereign (C.A.S. Jour., VII., 25–82).\n\nThe Pepiliyāna inscription records the erection of a shrine in memory of the Queen-mother Sunētra Mahā Dévi of the Girivaṇsa (C.A.S. Jour., X., 34).\n\nThe Perakumbá Sirita, after describing the founder of the royal house, Prince Sumitra \"of Ásoka's lineage,\" created Jaya Mahā Léna, and the achievements of the other great monarchs of this line, explicitly mentions the parents of the king. I subjoin a literal translation by Mr. W. P. Ranesinghe. He adds, that \"it is probable that Lemeni Jayamahala was crowned Vijaya Bāhu,\" and suggests that \"there must have been many Jayamahalénas from the time of Devenipétissa to that of Parākrama Bāhu VI.\"\n\n\"In the unblemished line of such illustrious sovereigns of power and great sway was the son of Vijaya Bāhu of the Sēvulu race and grandson of King Parākrama, a prince who was an embryo\nBuddha, born of the great Queen Sunétra, who was like a golden vine entwining the wish-conferring tree like Lemeni Jayamahala.”—v. 27.\n\nŚrī Ráhula in the Kávyasékhara describes in glowing stanzas the lineage of the king and the names of his parents. Here too, the dynasty is traced to “Prince Sumit of the Sólár dynasty, who was maternal uncle of Mahinda, son of Dharma Ásóka, 237 B.C.” (Part XIV., vv. 61, 62.)\n\nPrince Sumit was invested by Dévanampiya Tissa with the rank of Jayamahálena, “Chief Secretary for War,” amid great pomp, and given the hand of Princess Sumana of Magadha, a novice who resided at the temple of Sanghamitta (Part IV., v. 66).\n\nTo them and their descendants was assigned the custody of the Bó-tree (Part XIX., vv. 67, 68; Bódhivansa).\n\nThe following verses (Kávyasékhara, 69-71 in Part XIV.) support the other authorities regarding the parentage of the king: “In this the thirty-fourth year of the reign of King Parákrama Báhu, the celebrated Kávyasékhara was composed and terminated in language elegant. He was an ocean of gem-like virtues, a diadem on the heads of all kings, grandson of Jayamahaléna, who was an ornament to the Lambakarna race. He came from the good lineage of the illustrious Vijaya Báhu of the Sévulu race and of the puissant Parákrama the Great and of Agrabodhi and Vijaya Báhu.” Mr. W. P. Ranesinghe, to whom I am indebted for the translation, says that according to these lines, “the descent of Śrī Parákrama Báhu from all the above kings, including Vijaya Báhu, is clear, and confirms the statement in the Péarakumbá Sirita and the Rájávaliya.”\n\nValentyn states that the monarch was “of the unsullied race of the Emperor Socca (Ásóka) Rajá and of the family of Ittahassammata (Mahásammata), and of Simit (Sumit) Rajá, a nephew of the Emperor Praccaram (Parákrama) Vijé (Vijaya) Rajá, and a son of the Emperor Savlu Vija (Sévulu Vijaya) Bahu Raja, and of the Empress Simittra Déwa (Sunétra Dévi).”\n\nThe Rájávaliya, although the pages referring to the Chinese invasions have been tampered with, says that Vijaya Báhu was the father of Parákrama Báhu, and that his mother was Sunétra Dévi.\n\n“Here it must be observed that it was in the year 1958 of the illustrious Buddhist era, on Thursday, the seventh day of the bright half of the month Wesak, and the asterism Phusa, that King Vijaya Báhu was taken captive. Whereupon his Queen, Sunétra Dévi, left the city and went to Visidagama, taking her son with her.”—p. 67.\n\nE. W. Perera.\nAPPENDIX B.\n\nThe following translation of Valentyn’s account of this period is by Mr. Donald Ferguson, and appeared in the Ceylon Observer, September, 1897:\n\n\"The King Boewanaca (Bhuvaneka) Bahu Raja, learning that his dominions were now entirely freed from all enemies, returned once more with a quiet heart to his kingdom of Degampala. But the Cingalese swore that they would never acknowledge such a coward as their king; but there was then a prince, reared in the Pagode of Vida Gamma, who, on account of his illustrious origin, might be compared to the sun, as he was of the princely blood, and of the unsullied race of the Emperor Socca (Ásóka) Raja, and of the family of Ittahasammatta Raja, and of Simit Raja, a nephew of the Emperor Praccaram Viga (Parákrama Vijaya) Raja, and a son of the Emperor Savluviga (Sévulu Vijaya) Báhu Raja, and of the Empress Simittra Dewa.\n\n\"This prince was set upon the throne of the Emperor of Cotta, with the name of Rucaule Praccaram Bahu Raja, on the 8th day (new moon) of the month of May, upon a Thursday, by the Gane or Priest Atahasuwamie, also of the royal house, residing in a Pagode.\n\n\"He married a princess of the royal house from the village of Quirivella, who was of the family of Othurudda Comara.\n\n\"Thereupon having been crowned (which period is described as having been 1,958 years after the death of Budun, or 1,415 years after the birth of Christ), he remained 3 years at Reygamme (Rayigama), then removed to Cotta, there built a fine city, entirely of solid blue stone, and a beautiful palace of the same stone; but with a sort of new fangled galleries, and with a number of new temples of devils, and of the idols that he worshipped. Here he dwelt in company with a priest (Śrí Ráhula), whom he esteemed very highly, preserved here the relics of Budun, and built a special house or monastery for his priests. He also took as his adopted sons two princes of imperial blood, Sappoe (Sapumal) Comara and Coeda (Kuḍá) Comara, to whom he showed very great favour.\n\n\"Some time after that the empress gave birth to a daughter, to whom was given the name of Ulacoedajanam Dewa, which Dewa betokens a goddess in their language.\n\n\"Not long afterwards the emperor was very unexpectedly attacked by a large army that had been sent by the King of Canara to Ceylon with a numerous fleet; but the prince having\nspeedily gathered together some troops, defeated that mighty army, which act gave him a very formidable name throughout the whole East, and caused him to be greatly beloved by his people.\n\n\"Shortly afterwards he sent a vessel with cinnamon to the opposite coast of Malabar, which came to land in the Bay of Driampatam; but it was attacked in a hostile manner by the ruler there, Rajam Malavaragam (Malava Ráyar), and all that was in it was carried off, besides that he took all the men captives.\n\n\"The emperor hearing of this caused the country of this ruler to be immediately ravaged by his troops with fire and sword. Thence they proceeded to another territory, named Soliratta, captured the town of Mahacoelan Cottaja, further destroying seven of its dependent villages, after which victory they returned rejoicing.\"\n\n\"While all was now quiet in the emperor's dominions in Ceylon, there was in the highlands a prince, named Jottia Sitti or Jothia Stoenam Raja, who, having been accustomed to pay tribute annually to the emperor, now informed him that he did not intend to do so in future. He thereupon caused his people out of the five districts over which he ruled to be assembled, and resolved to sever himself from the emperor, and to assume authority as a prince on his own account; therefore, in order to induce his followers the more firmly to adhere to him, he partitioned out to various nobles many villages and lands, and conferred upon them great titles of honour (on which the Cingalese are much set).\n\n\"The emperor having heard of this sent a great army against him, slew many thousands of his people, took prisoners many of the nearest blood relations of this rebellious prince (and when he had driven the prince himself out of Candi), established one of his adopted sons, Ampoeloewagala Comara, a vassal who paid him tribute annually as King of Candy.\n\n\"Some years afterwards eighteen other village chiefs of the Vannias submitted to the emperor, by which his kingdom was further greatly increased.\n\n\"The King of Jaffnapatnam, fearing that the emperor would be further revenged upon him in one way or another, took all needful precautions against this, but meanwhile also had himself proclaimed as Emperor of Ceylon, which the Emperor of Cotta had no sooner learnt, than he resolved on the spot to make himself master of Jaffnapatnam, and sent an army under Sappoe (Sapumal) Comara thither, and let the king know through that general that since it was improper that Ceylon should have two emperors, he had sent that general to relieve him of that new title, and as he could not rest, and was not content with what he had, to give him somewhat more rest.\"\n\"This general in the first place seized many of the king's territories; but when the latter heard that he had begun to draw near to the city of Jaffnapatnam, he sent one of his courtiers, Conta Cara Demalis, and then a second and third, named Panigevorum and Valamunivorussa,\\(^{17}\\) to stop him; but they were all three in a short time slain by Sappoe Comara, who now made it evident that he intended, with his blue horse with the green mane,\\(^{18}\\) to invest the city.\n\n\"The anxious king, seeing him arrive, sent Varacara,\\(^{19}\\) a bold knight, against him, who had undertaken to hew him in pieces, but he was stabbed by his men ere he came near him. Meanwhile the Prince Sappoe Comara got into the city, conquered it and all the king's realm, took many of his nobles prisoners, and brought them in a body, since the king himself had fled, to the emperor, who appointed one of his nephews, by name Ariattetoe Addum Prauwmal,\\(^{19}\\) King of Jaffnapatnam.\\(^{20}\\)\n\n\"After that this emperor reigned in great peace for the space of fifty-five years, spending most of the end of his lifetime in the service of the gods.\"\n\nNotes.\n\n1 Vidágama. (See Upham's Rajavali, pp. 266–267, and Bell's Kégalla Report, pp. 5, 42, 93, for details regarding the romantic story of the youth of Parákrama Báhu VI.)—D. F.\n\n2 Read \"Mahásammata,\" for the meaning of which see Macready's Sēlalihini Sandésa, p. IX. (?) Cf. the inscriptions of Parákrama Báhu VI. in Bell's Kégalla Report, p. 95; C.B.R.A.S. Jl., VII., p. 199; X., p. 100.—D. F.\n\n3 Parákrama Báhu VI. was the son of Vijaya Báhu VI. and his Queen Sunétra Dévi (\"Sowlu\" = Sēvulu = Sakalakala). [Sēvulu = Sākya, and has nothing to do with Sakalakala; vide Appendix A.—E. W. P.] I cannot identify the Parákrama Vijaya who is here said to have been the uncle of Parákrama Báhu VI.—D. F.\n\n4 This represents the Sinhalese rivikula = of the Solar race. Cf. Sēlalihini Sandésa, vv. 18, 96; and P. B.'s inscriptions, U. S.—D. F.\n\n5 The Rajavali has \"The seventh day.\"—D. F.\n\n6 A blunder for \"Maháswámi.\"—D. F.\n\n7 Kiravella. (See Bell's Kégalla Report, pp. 5, 83.)—D. F.\n\n8 For Anuruddha.\n\n9 On this see Bell's Kégalla Report, p. 81.—D. F.\n\n10 Sapumal Kumáraya and Kudá Kumáraya, the sons (?) of Parákrama Báhu VI. (See Bell's Kégalla Report, pp. 5, 42, 83.)—D. F.\n11 Ulakudayá Déví, regarding whom see Bell’s Kégalla Report, pp. 5, 83.—D. F.\n\n12 In this connection, however, déví means princess.—D. F.\n\n13 Cf. Upham’s Rajavali, pp. 269, 270.\n\n14 “Jottia” or “Jothia” evidently = yódaya, warrior; but who this warrior king was I cannot say. Upham’s Rajavali (p. 270) calls him “Sojana Sewo Rajah.”—D. F. [He was Jotiya Situ Raja, vide Gunasékara’s Rájávaliya, p. 69, and Perakumbá Sirita, 258.—E. W. P.]\n\n15 Ambulugalá or Kudá Kumáraya, the younger of the two princes mentioned above.—D. F.\n\n16 Cf. Upham’s Rajavali, p. 270.—D. F.\n\n17 I do not find the names of these men given elsewhere.—D. F.\n\n18 Mr. Bell, in his Kégalla Report (p. 83), quotes a stanza from the Selalihini Sandésa, and gives the following translation in verse:\n\n“Lo! Sapumal Kumáraya returns from Jaffna ta’én,\nLeader, midst a mighty host that follows in his train,\nAbove the snowy chatra spread with many a gem bedight,\nHimself, on steed of sable hue, recalls the Sun God’s light.”\n\nThe original has nil-turanga, which literally means a blue steed; but black is doubtless intended. Whence the “green mane” was derived I do not know.—D. F.\n\n19 I find no mention elsewhere of this man.—D. F.\n\n20 I cannot identify this individual. Cf. C.B.R.A.S. Jl., XI., p. 514 note.—D. F.\n\n21 Cf. Yalpana-Vaipava-Malai, pp. lxxv.–lxxvi.—D. F.\n\nE. W. Perera.\n\nAPPENDIX C.\n\nThe following is the route taken by the carrier-bird in the Selalihini Sandésa from Kótté to Kelaniya. I have adopted Mr. W. P. Ranesinghe’s identification of places, which he has been kind enough to furnish me with, in this most typical of the sandésas. The identity which I have noted in the text of Gurubēbila with modern Hanwella, on the authority of a High Priest of Kelaniya, though based on tradition, appears to be unfounded, in view of Mr. Ranesinghe’s explanation of how Gurubēbila came to be corrupted into Wánagurugodēlla:\n\n(1) Kótté.\n(2) Kontagantoṭa (ferry on the Diyavannāwa).\n(3) Anganpiṭiya (not mentioned in sandésa).\n(4) Isuru Kóvila = chapel or church built on the site of the déwála from its materials.\n\n(5) Kaikáwala=(Tam. kai, hand, and káwal, guard) the sentry-post where the watch was kept by guards armed with bows, spears, and swords = (?) Kaduwela.\n\n(6) Gaméhéna (not mentioned in sandésa).\n\n(7) Valambalamá = Vélitaláwa = Talangama.\n\n(8) [Valpola].\n\n(9) Sumutána = Himbutána.\n\n(10) Gurubévilá = Vana-guru-godélla; godélla has the same signification as bévilla, contracted into bévila, a “mound.”\n\n(11) Diyaheba (not mentioned in sandésa).\n\n(12) Guruluketa = Burrulla-keta = Burulketa.\n\n(13) Velandagoda = Belagama.\n\n(14) Veralána.\n\n(15) Kitsirimevan Kelaniya = (Megoda) Kelaniya on hither bank.\n\n(16) Maskeliya, on hither bank of the river, where the “fish” (mas = matsya) “gambol” (kelanavá).\n\nE. W. Perera.\n\nAPPENDIX D.\n\nFrom the “Ming-shih,” or History of the Ming Dynasty, and “Hsi-yang-ch’ao-Kung-tien-lu,” or Records of Tribute Missions from the West, we learn that the famous eunuch Chengho carried Chinese arms as far as Ceylon during the reign of Zunlo (1403 to 1425).—Report of the U. S. National Museum, under direction of Smithsonian Institute, for year ending June 30, 1888, p. 428.\n\nE. W. Perera.\n\nAPPENDIX E.\n\nMr. Perera says that “the Sélalihini Sandésa describes the route between Kótté and Kelaniya. The distance being short, the bird is made to take a circuitous course, by way of Gurubébila (Hañwella) on to Kelaniya, to enable the poet to describe the intervening country.” This is not correct. The bird would appear to have taken the then usual route, and the places described in the work all lie between Kótté and Kelaniya. Gurubéulla mentioned in the sandésa is the village now known as Vanagurugodélla, situated about midway between Kótté and Kelaniya, and not Gurubébila in Hañwella. In the Hansa Sandésa, the swan\nconveying a message from Kótté to Kéragala in Síná Kóralé has taken the same route as far as Kélaniya, and in that work the situation of Gurubeúla is clearly defined. The bird is told that from Gurubeúla he could see the village Gotatuwa on his left and Welandagoda on his right, and the great Viháré (Kitsirimé) before him. The temple Kitsirimé is on the left bank of the river facing Kélaniya, and the villages of Gotatuwa and Welandagoda are on either side of Vanagurugodélla.\n\n(2) Mr. Perera quotes a stanza from Péarakumbá Sirita in support of his theory that Śrí Parákráma Báhu was the son of Víra Vijaya Báhu. This stanza has been entirely misunderstood and incorrectly translated. The meaning of the stanza is clear, i.e., that Parákráma Báhu was the son of Lémeni Jayamahala, whose father was Vijaya Báhu and grandfather Parákráma Báhu. Parákráma Báhu herein referred to was Parákráma Báhu the Great of Polonnaruwa, as may be seen from the Kávyasékhara of Śrí Ráhula, and not Śrí Parákráma’s mother’s father, as stated by Mr. Perera. It can be shown from other contemporary writers that Śrí Parákráma Báhu was the son of Jayamahala.\n\n(3) It is stated that “the king’s wish is reflected in the poetical message contained in Śrí Ráhula’s Séalalihini Sandésa, invoking the lily-coloured god Vishnu at Dondra for the blessing of a son for the Princess Ulakuḍa Dévi.” This is incomprehensible. The message was clearly sent to the god Vibhísana at Kélaniya, and there is no mention in the work either of Dondra or of the lily-coloured god Vishnu.\n\n(4) Mr. Perera goes on to say that “Parákráma Báhu struck off the head of the usurper Alakésvara at the bidding of Vídágama Mahá Sámi.” I can think of no authority for this statement. The Rájávaliya, the only work which speaks of this event, does not support it.\n\nSimon de Silva.\n\nAPPENDIX F.\n\nI must protest against the slur cast—unconsciously no doubt—upon a name held in high honour in the history of the Buddhist church. It is unfair to connect Vídágama Mahá Sámi with the assassination of Alakésvara, on what must be considered very slight and doubtful evidence.\n\nI cannot agree with the identification of Gurubeúla mentioned in the Séalalihini Sandésa with Gurubeúla near Hanwella. The place mentioned in the poem is on the direct road from Kótté to Kélaniya, and is at the present time known as Vanagurugodélla.\nThe translation of the verse quoted from the Perakumbā Sirita (p. 7) is not accurate. It should read: \"A royal personage—a future Buddha—was born to the Queen Sunētra Mahā Dévi—the golden vine that entwined the celestial tree, the lord Jaya Mahā Lena, grandson of King Parākrama Báhu, who was the son of King Savulu Vijaya Báhu . . . . . .\"\n\nLastly, I cannot support the attempt to make Alakēsvara a foreign usurper. It is contended that Girivaṇsa, to which he belonged, was a Dravidian family in India. But according to the Nikāya Sangrahawa (p. 24) the full name of this family was Amaragirivasa. Amaragiri is another name for Dévanagala (in the Kégalla District). The original settlement of the Alakēsvara family was apparently Dévanagala; and though the original founder may have come from India, the family had long been in the Island, and the great Alakēsvara ought not to be regarded as a Dravidian usurper.\n\nD. B. Jayatilaka.\n\nAPPENDIX G.\n\nFirst, with regard to the death of Alakēsvara. I do not think that that great statesman was murdered at all; least of all by Visidāgama, the chief hierarch of the Buddhist church. The commanding personality of Alakēsvara had been absent from the field of Ceylon politics for many years before Parākrama Báhu VI. came to the throne. The presumption, therefore, is that he had been long dead at that time, and that the story of his usurpation and of his tragic death which followed in consequence is all a picturesque fable invented in later times.\n\nSecondly, I do not think that King Parākrama Báhu VI. was the son of Śrī Vīra Vijaya Báhu VI., although that has always been the accepted opinion, and is so still. The authority quoted from Perakumbā Sirita—far from supporting the accepted opinion—seems to go far to destroy it. It says that King Parākrama Báhu was the son of Jaya Mahā Lena (Secretary for War), a nobleman of the Lēmēni branch of the royal race. Now, Jaya Mahā Lena and Śrī Vīra Vijaya Báhu are clearly not identical. For the one was merely a royal scion, while the other was a king; and the one belonged to the Lēmēni branch of the royal stock, while the other belonged to the \"Mehenawara Vaṇsa,\" the branch sprung from the priestess. I think, therefore, that the paternity of Parākrama Báhu VI., as given by the writer, according to the received opinion, must be considerably revised.\n\nW. F. Gunawardana.\nAPPENDIX H.\n\nIt is unfortunate that Mudaliyár Simon de Silva took no part in the discussion at the Meeting. His Memorandum (Appendix E) subsequently sent in is on much the same lines as Mr. D. B. Jayatilaka’s criticisms. I shall first shortly deal with the two minor points (1) and (3) contained in the Mudaliyár’s Memorandum.\n\n(1) As explained at the Meeting, I had no decided opinion in regard to the identification of Gurubēbila, and was prepared to accept any reasonable explanation from those who had greater local knowledge. For further information on the question, vide Appendix C.\n\n(3) Vishnu for Vibhísana was an oversight, since corrected.\n\n(2) The Mudaliyár challenges what he calls my “theory that Śrī Parákrama Báhu was the son of Vira Vijaya Báhu,” on the assumption that I have “entirely misunderstood and incorrectly translated” the stanza from the Perakumbá Sirita. No reason is given why grammatically or otherwise the words cannot be rendered in the sense taken by Mr. W. P. Ranesinghe, who has favoured me with a translation. His rendering (vide Appendix A) makes it convey the meaning that Parákrama Báhu VI. “was the son of Vijaya Báhu of the Sevulu race and grandson of King Parákrama.” It will scarcely be contended that this careful scholar, too, “entirely misunderstood and incorrectly translated” the stanza. It is the only way it can be rendered consistently with the other contemporary authorities, which bear out that Śrī Parákrama Báhu VI. was the son of Sevulu Vijaya Báhu.\n\nFurther, it is stated in the Mudaliyár’s Memorandum, that “Parákrama Báhu herein referred to was Parákrama Báhu the Great of Polonnaruwa.” This cannot be, as Parákrama Báhu the Great (1164–1197) was not the “grandfather” of Śrī Parákrama Báhu VI. (1412–1467). According to the Kāvyasēkhara, which is cited in support of this view, it was a “Jaya Mahá Lena” who was “grandfather” of Śrī Parákrama Báhu VI. (vide Appendix A). Even if “grandfather” be taken in the extended sense of “ancestor,” the Mudaliyár will not be supported by the authority to which he appeals, for the “grandfather” or “ancestor” mentioned in the Kāvyasēkhara is Jaya Mahá Lena and not Parákrama Báhu the Great. That Jaya Mahá in that stanza refers to the “ancestor,” the founder of the house, there is very little doubt. De Couto states that Śrī Parákrama Báhu’s mother’s father was King Parákrama Báhu, which is consistent with the statement in the Perakumbá Sirita. The Mudaliyár\nshould have cited \"the other contemporary writer\" from whom \"it can be shown that Śrī Parākrama Bāhu was the son of Jaya Mahala.\" That monarch's own sannas declare that his father was \"king,\" and the Rājāvaliya and Valentyn bear out that he was Vijaya Bāhu VI. (vide Appendix A).\n\n(4) In saying that he \"can think of no authority\" for my statement that \"Parākarama Bāhu struck off the head of the usurper Alakēsvara at the bidding of Vīdāgama Mahā Sāmi,\" the Mudaliyār has forgotten to quote the two previous words of the sentence, \"Legend says.\"* The Rājāvaliya, which he declares \"does not support it,\" states: \"In this manner the prince lived in obscurity until he had attained the age of 16 years, when the elder Visidāgama summoned the leading men, and having consulted together, sent for the prince; and, without the knowledge of Alakēsvara, brought him out to the people under the asterism Phusa, on Thursday, the 7th day of the bright fortnight of the month Wesak. Having caused Alakēsvara to be put to death, he raised the prince to the throne under the name of Śrī Parākrama Bāhu.\" The legend merely supplies the detail who was the agent the priest employed to kill the usurper.\n\nThe identification of Gurubēbila with Hanwella would appear to have as much warrant as its identification with Vanagurugodēlla. But I expressed no decided view, and will yield to special local knowledge.\n\nThe question of the origin of Alakēsvara has no immediate bearing on the subject, and was fully dealt with by me in a previous Paper. The contemporary authorities quoted there show conclusively that he belonged to a Dravidian family from Conjeveram, whose settlement was at Rayigam. The proposition that the family name is Amaragirivasa cannot be maintained, as the word merely means that Alakēsvara resided at Amaragiri.\n\nE. W. Perera.\n\n5. Simon de Silva, Mudaliyār, submitted a Memorandum dissenting from some of Mr. Perera's statements,†\n\n6. Mr. D. B. Jayatilaka said that the Paper was very interesting and threw a flood of light upon an exceedingly obscure period of Ceylon history. He drew the attention of the Meeting to a few points in regard to which he could not agree with the writer.‡\n\n7. W. F. Gunawardana, Mudaliyār, disagreed with two points in the Paper.§\n\n* The \"legend,\"—if such exists, is so manifestly unworthy of credence that it should best be not countenanced.—B., Ed. Sec.\n† See Appendix E. ‡ See Appendix F. § See Appendix G.\n8. Mr. Harward, referring to the Paper and its subject in a general way, drew attention to the interest attaching to the study of the Chinese invasions of Ceylon, the tribute paid by Ceylon, and the circumstances in which that tribute was terminated. They had not had the Chinese point of view developed, except in the very brief extracts from the Chinese chronicles given in the first volume of Sir Emerson Tennent's \"History of Ceylon.\"\n\n9. Mr. Perera, in reply, said that the chief bone of contention seemed to be that he should have charged a hierarch of the Buddhist church with murder. That was no reflection on the faith. It had happened before that a monk had killed a man, and it might happen again. A cowl did not always make a monk.*\n\n10. The Chairman, in proposing a vote of thanks to Mr. Perera, said it was Papers of that kind which really illustrated the value of a Society such as that to which they belonged; because it brought into the light of day obscure alleys in the history of the country in which they were all living, and called forth discussions such as those to which they had listened that evening. Far be it from him to attempt to adjudicate upon the various points raised. Whether the king, whose history they had just listened to, was himself or was not himself was a point upon which none of them, he felt sure, at a moment's notice would like to pronounce, after the authoritative declaration that he was not himself which they had received from Mudaliyār Gunawardana. He felt sure that later they would receive from the same quarter a justification of that belief, if only in the form of a Note that might be appended to some issue of the Journal.\n\nThe vote of thanks was carried cordially.\n\n11. Mr. J. Harward read the Annual Report of the Council for 1909:\n\nANNUAL REPORT FOR 1909.\n\nThe Council of the Ceylon Branch of the Royal Asiatic Society have the honour to submit their Report for 1909.\n\nMEETINGS AND PAPERS.\n\nFive General Meetings of this Society have been held during the year, at which the following Papers were read and discussed:\n\n(1) \"Letters from Rájasinha II. to the Dutch,\" by Mr. Donald Ferguson.\n(2) \"Jnana Vasishtam,\" by the Hon. Mr. P. Arunachalam, M.A., C.C.S.\n(3) \"Notes on Delft,\" by the Hon. Mr. J. P. Lewis, M.A., C.C.S.\n(4) \"The Dutch Embassy to Kandy in 1731–32,\" by Mr. P. E. Pieris, M.A., LL.M., C.C.S.\n\n* Mr. Perera subsequently replied to certain other criticisms in a Memorandum. See Appendix H.—B., Ed. Sec.\nLECTURES DELIVERED.\n\n(1) \"History of Indian Art,\" with lantern illustrations, by A. K. Coomáraswámy, D.Sc.\n(2) \"The Antiquity of Stone Architecture in India and Ceylon,\" with lantern illustrations, by Mr. D. M. de Z. Wickramasingha.\n\nA Paper entitled \"The Kandyan Navandannó,\" by Mr. H. W. Codrington, B.A., C.C.S., was accepted for publication without being read at a Meeting.\n\nMEMBERS.\n\nDuring the past year forty-five new Members were elected, viz., A. S. de Silva; E. S. Dassenaike, B.A., LL.B.; H. L. de Mel, Proctor, S.C.; W. A. Samarasingha, D. Devapuraratna, Proctor, S.C.; F. Gomesz, B.A.; A. H. Gomesz, F.B.A., F.N.F.A.; K. J. Saunders, B.A.; J. L. Pieris, Gate Mudaliyár; A. O. Jayawardana; J. W. de Silva, Proctor, S.C.; W. Wijeyesekera; R. Sagara jasingam; C. F. W. Halliley; A. W. Seymour, C.C.S.; G. A. F. Senaratna; Dr. D. Schokman, F.R.C.S.E.; C. E. de Vos, Barrister-at-Law; T. Reid, B.A., C.C.S.; F. H. Chambers, B.A., C.C.S.; T. A. Hodson, M.A., C.C.S.; H. Skinner; W. T. Southorn; T. E. Karunatilaka; Hon. Mr. C. T. D. Vigors, C.C.S.; J. D. Brown, B.A., C.C.S.; G. F. Plant, B.A., C.C.S.; B. Horsburgh, M.A., C.C.S.; T. A. Carey, B.A., C.C.S.; Dr. V. Goonaratna, L.M. & S.; S. Obeyesekere, Barrister-at-Law; C. A. Galpin; F. Jayatlaka, Proctor, S.C.; E. G. Brooke; J. M. Senaviratna; T. Maclachlan; S. J. Williamsz; Rev. L. A. Joseph, M.A., B.D.; Dr. T. B. Kobbekaduwe, M.R.C.S. & L.R.C.P.; Ven. M. Sri Ñanissára; S. O. Canagaratnum; C. C. J. Senaviratna, Proctor, S.C.; H. Perera, Gate Muhandiram; Rev. J. P. de Pinto and Rev. Father J. Pahamuney, O.M.I.\n\nLIFE-MEMBERS.\n\nMessrs. P. E. Pieris, M.A., C.C.S., and D. M. de Z. Wickramasingha have become Life-Members.\n\nRESIGNED.\n\nFive Members have resigned, viz., Messrs. A. Anson, O. W. Heinman, J. Mathieson, T. Southwell, Mr. Justice A. Wood Renton, and Mr. E. S. W. Senáthi Rájá.\n\nDEATHS.\n\nThe Council record with regret the death of the following Members:—Messrs. C. M. Fernando, M.A., LL.M.; G. W. Jayawardana, J.P.; J. P. Perera, Proctor; A. M. Perera; J. de S. Rajepaksa, J.P., Mudaliyár; and M. Suppramaniyan.\n\nThe Council passed the following vote of condolence on the death of Mr. C. M. Fernando:\n\nResolved—\"That the Council of the Ceylon Branch of the Royal Asiatic Society wishes to express its sympathy and condolence\nwith the family of the late Mr. C. M. Fernando, M.A., LL.M., and to express its sense of the loss which the Society has sustained by his death:\n\n\"By the death of Mr. C. M. Fernando, M.A., LL.M., Senior Crown Counsel, Ceylon, this Society has lost one of its most valued Members. He joined the Society in 1889, and was a Member of the Council from 1896, and was the senior Member. He was a regular attendant at Meetings, and to the part which he took in its discussions and to his contributions, the Proceedings of Meetings and the Journals of this Society owe much of their interest and value.\"\n\nTo the Journals of this Society Mr. Fernando contributed the following Papers:\n\n(1) \"The Music of Ceylon,\" No. 45, 1894.\n(2) \"The Inauguration of the King in Ancient Ceylon,\" No. 47, 1896.\n(3) \"A Note on the Palæography of Ceylon,\" No. 55, 1904.\n(4) \"Two Old Sinhalese Swords,\" No. 56, 1905.\n\nThe Society has now on its roll 316 Members; of these, 33 are Life Members, 10 Honorary Members.\n\nDEFAULTERS.\n\nThe following names have been removed from the list of Members for non-payment of subscriptions:—A. W. Andree, G. W. Bibile, A. Chinniah, W. Jayawickrama, Pandit Gopi Nath, G. C. Lee, J. M. Weerasuriya.\n\nPUBLICATIONS.\n\nTwo Numbers of the Journal, Vol. XX., No. 60, and Vol. XXI., No. 61, were published during the year.\n\nNo. 60 consists of the valuable \"History of Ceylon from the earliest times to 1600 A.D. as related by João de Barros and Diogo de Couto,\" specially translated and edited for the Society by Mr. Donald Ferguson, and forms Volume XX. of the Society's Journal.\n\nNo. 61 contains, in addition to the Proceedings of the Council and General Meetings, the following Papers:\n\n(1) \"The Origin of the Tamil Velálas,\" translated by Mr. V. J. Tambipillai.\n(2) \"Amongst the last Veddás,\" by Dr. Moszkowski.\n(3) \"Notes on recent work among the Veddás,\" by Dr. C. G. Seligmann, M.D.\n(4) \"Portuguese Ceylon at the beginning of the Seventeenth Century: a Sketch,\" by Mr. P. E. Pieris, M.A., C.C.S.\n(5) \"Sumptuary Laws and Social Etiquette of the Kandyans,\" by Mr. T. B. Paranátella.\n(6) \"Kandyan Music,\" by Mr. S. D. Mahawalatenna.\n(7) \"The lesser known Hills of the Batticaloa District and Lower Úva,\" by Mr. F. Lewis, F.L.S.\nLIST OF MEMBERS.\n\nA list of Members, giving the names of all the past and present Office-Bearers from the beginning of the Society in 1845, corrected up to August 31, 1909 (compiled by the Society's Clerk and Librarian, Mr. F. D. Jayasinha), was published during the year and issued to Members.\n\nTHE LIBRARY.\n\nThe additions to the Library, including parts of periodicals, numbered 404.\n\nThe Library is indebted for donations to the following:\n\nThe Government of India; the Archaeological Survey of India; the Linguistic Survey of India; the Secretary of State for India in Council; Dr. A. Caroll; Cuerpo de Ingenieros de Menas del Peru; the Postmaster-General, Colombo; Messrs. H. D. Watson; Mr. L. S. S. O'Malley, I.C.S.; F. Otto Schrader, Ph.D.; R. V. Russell, I.C.S.; C. Brown; F. Max Nabe; Professor T. W. Rhys Davids, Ph.D.; Dr. A. K. Coomaraswamy; the Hon. the Colonial Secretary, Ceylon; L. de La Vallée Poussin; Baron Cana de Vaux; C. R. Lanman; G. A. Grierson, C.I.E., Ph.D.; T. Southwell; J. A. T. Schwory; H. R. Nevill, I.C.S.; G. H. Girtz; R. D. Salsburg; W. W. Atwood; the Director of Public Instruction, Ceylon; Sir R. C. Temple, C.I.E.; G. L. Corbett; R. H. S. Hutchinson; the Archaeological Survey of Ceylon; W. F. Gunawardana, Mudaliyár; Major K. D. Erskine, I.A.; G. L. Raymond, L.H.D., &c.; M. A. Stein; M. M. Din; the Siam Society; the Archaeological Survey of Burma.\n\nFor valuable exchanges received during the year the Society is indebted to the following:\n\nThe Musée Guimet, Paris; the Société Zoologique, Paris; the State Archives, Netherlands; California Academy of Sciences; the Royal Society of Victoria; the Royal University of Upsala; the Academy of Natural Sciences, Philadelphia; the Smithsonian Institute; the Anthropological Society of Bombay; United States Department of Agriculture, Washington; the United States Geological Survey, New York; the United States Bureau of Education, Washington; the Anthropologische Gesellschaft Koeniggraetzerstrasse, Berlin; Bataviaasch Genootschap van Kunsten en Wetenschappen, Batavia; the Secretary Deutsche Morglandische Geeselschaft-Halle, Germany; the American Oriental Society; La Société Imperiale des Naturales de Moscow, Russia; the Asiatic Society of Japan; the Royal Asiatic Society of Great Britain and Ireland; the Asiatic Society of Bengal; John Hopkins University, Baltimore, United States of America; the Anthropological Institute, London; the Geological and Natural History Survey of Canada; the Royal Colonial Institute, London; the Straits Branch of the Royal Asiatic Society; Koninklijk Instituut voor de Taal-Land en Volken Kunde van Nederlandsch Indie, Holland; the Director-General of Archaeology, India; K. K. Naturhistorischen, Hopmuseums, Austria; L'École Française, d'Extreme-Orient, Hanoi, &c.\nARCHÆOLOGICAL SURVEY, 1909.\n\nThe Council has secured from the Archæological Commissioner a brief summary of the operations of the Archæological Survey during 1909.\n\nA much-needed increase to the Archæological vote, under the sub-heads of \"Labour\" and \"Preservation of Ancient Monuments,\" sanctioned from 1909, has permitted of field operations being conducted with redoubled vigour. No previous year in the life of the Archæological Survey has witnessed equal progress, especially at Polonnaruwa and Sigiriya.\n\nI.—ANURÁDHAPURA.\n\n1.—Clearing.\n\nWith the sum of Rs. 5,000 now made yearly available to the Archæological Commissioner for freeing ruined areas of scrub and rank weeds, all the larger spaces dotted with ruins were kept clear at Anurádhapura.\n\nIn addition, was started the systematical clearing of the jungle which has for centuries enveloped the numerous caves and ruined sites at Mihintalé, known to exist, but barely accessible, on and around the clustered hills.\n\nIt is hoped to follow up this sweep of the undergrowth by resuming excavation of the Mihintalé ruins, commenced as long ago as 1893, but since deferred owing to more pressing claims at Anurádhapura and elsewhere.\n\n2.—Excavations.\n\nVessagiriya.—The ruins of the ancient Monastery at Vessagiriya surround three rock hummocks, which lie in line north and south close to the main road from Anurádhapura to Kurunégala. The most northerly rock (A), and the ruins situated to the east of the second rock (B), were dealt with between 1906–1908.\n\nDuring the past year (1909), after some heavy cutting, the sites on rock B (two small dágabas and a viháré), its caves, and all ruins adjoining it to the west, have been unearthed.\n\nA quincunx group, probably a viháré and four piriven off its angles, with several appurtenant buildings, stand between the middle rock (B) and the southernmost rock (C).\n\nTo round off excavations at Vessagiriya the exploiting of these and of the ground immediately round the foot of rock C alone remains.\n\nII.—POLONNARUWA.\n\nThe Archæological Survey made marked advance in 1909, both in opening up the ancient City and its environs to view by axe and katthy, and in laying bare its far reaching ruins.\n\nWith the exception of a few special sites (mainly those appertaining to the two large Dágabas, Rankot Vehera and \"Kiri Vehera\") the decade since 1900 (when the Archæological Survey\nfirst broke ground at Polonnaruwa) has witnessed the excavation of all the chief structures of \"Pulastipura,\" from the mistermed \"Demala Mahá Séya\" on the north as far south as the \"Potgul Vehera\" Monastery, a stretch of four miles.\n\n1.—Clearing.\n\nThe parking of the city was continued by Moor axemen. With a larger gang of Sinhalese at work, the whole of the confines within the walls of the Citadel and City were freed of underwood, except here and there at a few picturesque silvan clumps within which no ruins seem to exist above ground.\n\nOutside the City, northward, all the ruins surrounding the two large Dágabas, the \"Gal-Viháré,\" and the \"Una-gala Vehera\" hillock, were also re-cleared.\n\nTo the west, across Tópávēwa tank, the heavy jungle gripping a group of ruins (\"Sítala Málígāwa,\" &c.), which stand quite isolated from the main ruins situated to north and east of the bund, was cut down and burnt.\n\n2.—Excavations.\n\n\"Demala-Mahá-Séya.\"\n\nThis brick-built Buddhist temple is of the type of the so-called \"Jétawanaráma\" and \"Thúpáráma\" Vihárés. In size it considerably exceeds the latter.\n\nExteriorly, the brick and stucco ornamentation of its moulded basement and wall face, though carried out on very similar lines, departs from the simplicity of \"Thúpáráma,\" and is more lavish even than that of \"Jétawanaráma.\" This plethora of surface mouldings and ornament palls on the eye from overcrowding of details and want of proportion.\n\nThe south and east walls stand in fair preservation, but the back (west) wall and much of the north have fallen, whilst the vaulted roof of vestibule and shrine has wholly collapsed.\n\nIn 1885–86 the vestibule was unearthed, under the direction of Mr. S. M. Burrows, and disclosed remains of interesting frescoes (Buddhist legends, &c.) on its inner walls.\n\nUnfortunately no steps were taken to protect these paintings, and in the fifteen years' interval before the Archaeological Survey commenced work at Polonnaruwa, they had faded beyond recognition.\n\nThe first task of the past season's excavation was the removal of the débris which literally choked the entresol, leading on from the vestibule, as well as the shrine itself, up to the top of the walls, which are 25 feet high in places.\n\nThe difficulty of dealing with this immense mass of caked brick and mortar talus, which filled the passage and shrine, rendered the work both slow and dangerous, in view of the crumbling state of the later built inner walls.* Ultimately the whole space was\n\n* A Moor cooly was buried to the neck by the fall of part of a wall.\ncleared without damaging either the frescoes on these screen walls, or what remains of the colossal statue of Buddha (hiti-pilima) which stands erect against the back wall. This immense figure, formed of brick heavily plastered, is headless and had lost its right leg below the knee.*\n\nThe frescoes are full of interest. They depict legendary episodes from the life of Gautama Buddha. The main piece on the south wall shows the \"Tathágata,\" stiffly posed in a boat with two rowers, who are admirably represented. Though not so well preserved as the paintings in the \"pockets\" at Sigiri-gala, those found on the walls of \"Demala Mahá Séya\" yield nothing to the latter in variety and spirited execution. Many of the figures are larger than life-size.\n\nThe extreme flimsiness of the screen walls (clay conglomerate packing, plaster coated) on which the frescoes are painted threatens their rapid disintegration, if not entire destruction. Every effort has, therefore, been made to preserve them for at least some time, in order to secure, before it is too late, copies in oil as far as the worn paintings can be reproduced.\n\nA jungle stick roof, thatched with cadjans, has been thrown across the shrine to shelter it from the north-east monsoon rains.\n\nThe Buddha has also been specially protected by temporarily trussing the figure in a stick \"crate\" with ramba grass. But the image is tottering to its fall, and may not survive long.\n\nCircular Ruin.\n\nAbout a hundred yards south of \"Demala Maha Séya\" is a brick ruin, with remains of circular wall. The excavation of this structure (presumed to be a \"Wata-dá-gé\" hitherto) has yielded no satisfactory identification at present.\n\nIt has proved to be pillarless, and the walls did not apparently enshrine a dágaba, as at the well-known \"Wata-dá-gé\" near \"Thúpárama\" Viháré. The diameter within the wall is about 58 ft.\n\nViháré.\n\nBetween the \"Pabulu Vehera\" (Dágaba) and the little Hindú temple of granite sacred to Śiva (Dévalé No. 2) a mound with crude masses of brickwork was next tried.\n\nExcavation has shown it to be an oblong Viháré, with vestibule once stoutly columned, and a shrine heavily walled in brick and mortar so as to bear up a vaulted roof. One or two broken images were exhumed here. The floor is laid in lime concrete coloured in a pattern of blue and red framing.\n\n\"Pabulu Vehera.\"\n\nThis is the present-day name of the third in size of the completed Dágabas of Polonnaruwa. It lies some distance south of the two larger Thúpas and within the City wall.\n\n* The leg was roughly renewed to save, if possible, further dismemberment, or not improbably total fall, of the figure.\nThere are manifest indications of the deliberate destruction of its superstructure (kota and hatarēs kōṭuwa) in the tons of brick débris, mortar bound, now burying the base of the Dágaba.\n\nSo far only a vihāré, hugging its south-west face, has been excavated, simultaneously with the above-mentioned vihāré near the Śiva Dévalé. In its inner sanctuary were found a huge limestone hiti-pilima of the Buddha, fallen headlong, and another figure, with tall head-dress.\n\nMonastery near the North Gate of the City.\n\nClose outside the Northern Gateway through the ancient City wall lie the ruins of a small Monastery, within premises some 50 yards square. This Monastery was excavated thoroughly. The most marked structures are a vihāré and a dágaba.\n\nThe vihāré was of the familiar Polonnaruwa plan, with three images (of which the pedestals are in situ) ranged side by side towards the back. Some of the figures were uncovered on the floor—all broken.\n\nThe dágaba differs from any yet examined at Polonnaruwa. It stood on a brick-faced maḷuwa, or platform, 57 ft. four-square, raised 7 ft. 6 in. from ground level, and was reached by a steep flight of granite steps. The stairs are footed by a moonstone and a pair of Nāga dvārapālas. The revetment of the maḷuwa is faced in front by a most effective dado of twenty full-faced lions, between pilasters, sharply moulded in brick tiles. The dágaba proper had at base a diameter of about 30 ft.; but it has been so mercilessly wrecked that its true outlines are difficult to recast.\n\nTreasure seekers had penetrated into the bell of the dágaba by a diagonal shaft, and gutted its garbha, or \"relic chamber,\" which is partially exposed as they left it. This chamber really comprised three cellas, superimposed one above the other, each measuring 3 ft. square nearly, and each containing wall niches for clay saucer lamps. The floor of the uppermost cella was paved by a stone yantra-gala of 25 partitions; the second by a plain slab on which rose a small octagonal pillar, the \"Indra-kīla;\" the third, and lowest, by a second yantra receptacle, but of brick and in 9 divisions.\n\nOf the original deposits in these cellas, the only antiques ignored by the vandals were seven tiny bronze cobras found in two partitions of the bottom yantra receptacle.\n\nCity Wall.\n\nThe City wall to the west has been laid bare, inside and out, where the main road from Minnériya twice cuts through it.\n\nRuins within Tópávēwa Tank.\n\nNot far west of where an ancient horowwa (sluice) of Tópávēwa tank pierces the bund, occur four isolated ruins.\nDévalés.\n\nFurthest north are the remains of a pair of Hindú fanes. The larger of the two showed the familiar plan of a dévalé containing three apartments, a front hall, vestibule, and the innermost chamber. The bottom of the walls alone survives. The argha slab (its lingam is missing), unearthed in the middle of the adytum, fixes the cult as that of Siva.\n\nThe other ruin is no more than a small chamber, walled by well-dressed granite slabs, with a pilla (spout) projecting. It once formed the sanctuary of some kóvil, of which nothing more exists at this day.\n\nDágaba.\n\nSouth of these Hindú shrines a jungle-covered mound about 20 ft. in height was opened late in the season. This finally gave proof of having once served as a dágaba. The hatares kotuwa (square tee) has wholly disappeared, but a large portion of the tapering kota, or pinnacle, with 23 of its concentric rings intact, was unearthed on the slope of the mound where it must have fallen when the dágaba was destroyed centuries ago.\n\nThe dágaba was apparently somewhat over 50 ft. in diameter, and touched tangentially at the cardinal points a square stereobate. Faint outlines of an outer maluwa about 80 ft. square are traceable.\n\nIt is not surprising to find that this dágaba, like the smaller one near the North Gate of the City, had not escaped rifling by Southern Indian aliens.\n\nA breach had been made into the top of the bell to a depth of nearly 12 ft., uncovering two cellas. In the first a series of stone pillar-slabs (including the \"Indra-kíla\") were found fallen into the relic chamber, owing to the breach. This topmost cella had been quite denuded of all its contents save a single coin of Sáhasa Malla (1200-1202 A.D.)\n\nFollowing the breach lower down, about half of a brick yantra receptacle was unearthed, with 16 (of the full 25) partitions unbroken. The rest had evidently been destroyed and their contents appropriated.\n\nFrom the surviving divisions an extraordinarily varied set of miniature bronzes—gods, animals, reptiles, and implements—were taken out.\n\nTo ascertain the sectional construction of the dágaba, it was decided to sink a shaft below these breached relic chambers down to ground level. A further series of most interesting archæological articles came to light at different depths.\n\nBelow the broken yantra receptacle—doubtless the bottom of the second cella—a third cella, in size a cube of 3 ft., was struck. This contained the most important \"find\" of all—a squared pedestal of limestone (1 ft. 8 in. by 9½ in.), with seven horizontal ribs (probably to represent Mount Maha Méru) and splayed at top pyramidically. This pedestal (of which three sides respectively still show traces of red, yellow, and white colouring—with blue, red, yellow, and white on the fourth side and top) stood on three small detached supports as tripod. It was crowned\nby a beautifully modelled karaṇḍuwa of beaten gold, 3 in. high, shaped like a diminutive dāgaba. The karaṇḍuwa contained seventeen small gems of no intrinsic value.\n\nUnderneath this third chamber lay a nine-holed yantra receptacle of brick, each partition of which produced a brood of cobras, a mother and four young, in bronze, or 45 nāgas in all.\n\nBelow this again were found more valueless gems mingled with sand and lime mortar. Finally, a copper plate (once probably inscribed but now so corroded as to yield no trace of writing), a coin or two, and a chank resting on a tripod.*\n\nMāligāwa.\n\nThe last of the three sites attacked within Tōpavēwa tank was a widespread mound covered with tall forest trees. It is situated within sight of the Promontory lying south-east.\n\nThe lower portion of the mound is rubble-banked with relapāna, or rubble pitching, as breakwater protection against the wavelets of the tank which once lapped it.\n\nWhen the trees had been cut and débris removed from the summit of the mound an extensive single structure steadily developed its ground plan, as its walls and cross walls were gradually unearthed.\n\nFurther, it became more and more evident that the structure was purely secular—without doubt a māligāwa or residence of some chieftain, if not of royalty.\n\nNo stone was used in the construction of this palace, or mansion, and comparatively little brick. Walls, floor, steps, all are of clay and lime concrete, thickly encased in, or overlaid with, lime plaster. The walls still stand from 3 to 5 ft. in height, showing most clearly the internal arrangement of corridors and rooms.\n\nAccess could be gained to the building only by a staircase in the middle of the north face, rising to a bay portico and landings, from which three gangways diverged and completely encircled the structure. At the back (south) there is another bay, from which steps descended, not directly but westward, on to the rubble-faced platform.\n\nEntering the building from the front, the first chamber is a spacious hall, nearly 39 by 32 ft. in dimensions, the front portion of which was once supported on 24 wooden pillars. There was passage directly through this hall to an elongated room of the same breadth, but only 6 ft. 6 in. in depth. This again leads into a verandah, 9 ft. 4 in. wide at the back, by barely 6 ft. 5 in. along the flanks of the hall and narrow room which it also skirts. The hall admitted into this verandah through cramped side openings. The verandah at the east was bare, and from it stairs originally mounted to upper storeys, which must have been entirely of wooden construction.\n\nThe corresponding verandah on the west contained a lavatory, cut off by a cross wall, but accessible from the back verandah.\n\n* All these \"finds\" will be deposited in the Colombo Museum.\nThe walls of chambers and verandah still show openings where windows were placed at intervals. Vertical holes in the walls point to some eighty stout posts being engaged in them (to add strength), in addition to the twenty-four pillars in the hall which were free standing.\n\nThe floor is laid with a thick coating of lime plaster, no doubt formerly coloured in a red and blue carpet design, for on the walls are still to be seen portions of a dado—a brilliant red framing. The whole structure—chambers, verandah, and three gangways—covered an area of 84 feet square.\n\nThe only \"finds\" made were a small killotaya, or chunam box, still containing lime probably six centuries old, a coin of Sáhasa Malla, and a skull which crumbled to the touch.\n\n3.—Restoration.\n\n\"Thípáráma\" Viháré.—The work of filling in the many and dangerous cracks in the walls and roofs of the shrine and vestibule, and the rebuilding, where necessary, of the doubtful inset arch at the doorway into the shrine, was completed by the end of the 1908 season.\n\nLast year, therefore, it was safe to turn attention to the square duplicated tower.\n\nThe soffit of the vaulted roof of the shrine was first pointed to ensure greater stability.\n\nThe cleaning of the tower, prior to dealing with its cracks, disclosed that it had formerly been gutted from the top, in the expectation of finding treasure, and the breach subsequently refilled with loose débris. All is now set right; the tower has been rendered quite impervious to rain, and the countless abrasions and pittings in its wall and roof roughly mended to save further rapid weathering.\n\nThe flat roof of the shrine was relaid in cement concrete in 1908.\n\nLast season the \"weepholes\" through the parapet (which of old merely allowed rain water to run down and wear away the wall face of the building) were corbelled out as bracket spouting, so as to ensure the drainage being thrown clear of the basement plinth.\n\nWata-dá-gé.—The pavement of the inner and upper maluwa surrounding the central dágaba (within the brick wall) was taken up and laid with a radiating slope.\n\nWith no roof to shelter the dágaba and its circular maluwa, now that the concentric rings of tall granite columns no longer stand, the space became virtually converted during wet weather into a shallow tank with no egress for the water.\n\nA conduit has now been cut, through both its granite plinths (outer and inner) and the brick wall, in the middle of each quadrant, to pass off water from inside to the exterior maluwa, whence existing gargoyles discharge it on to the ground. The pavement surrounding the dágaba will in future, therefore, be always rapidly drained.\nIII.—Sigiriya.\n\n1.—Clearing.\n\nThe annual clearing of scrub within the enceinte of \"Sigiri Nuwara\" was carried out.\n\n2.—Restoration.\n\nIn 1908, the western half of the \"Lion-staircase house\" at the foot of the ladders leading to the summit of the Rock was refaced strongly in stepped masonry, cement-pointed, as a protection against further wash from rain water falling over the Rock.\n\nLast season the east side of the structure was similarly renewed. Attention was then given to the South Approach to the \"gallery.\" The upper flights of steps on this Approach were excavated in 1895, and subsequently restored partially by adding continuous retaining and half walls on the off side.\n\nBut of the lower tiers, which had been long ago washed down the slope of the hill, nothing remained; and, to render the South Approach traversable from end to end, it was necessary to rebuild these. Before the last season's work at Sigiriya closed in April, three staircases and landings were partially constructed, almost uniting the upper flights of steps with the broad terrace below from which the original staircase ascent was made.\n\nSimultaneously, a broad stairway of rubble stone, set in mortar, was erected from the tank bund, at the foot of the hill, as far as the terrace on which the Archaeological Survey Camp is placed.\n\nAnother season's work should see the junction of these stone and brick stairs effected, by the building of one or two short intermediate flights of steps and the levelling of the pathway along intervening terraces. It will then be possible to reach the \"gallery\" and gain the top of Sigiri-gala by a succession of staircases the whole way from the driving road at the foot of the ascent to the hill.\n\nŚiva Dévalé No. 2.\n\nThe vestibule of this chaste Hindú shrine, which threatened to fall unless promptly rebuilt, was wholly dismantled, and has been well reset.\n\nThe shrine walls have opened out in places, and with the dome need more attention than had been anticipated. These will be seen to next season.\n\nIV.—Epigraphical Work.\n\nPart IV. of the \"Epigraphia Zeylanica\" appeared early in 1909. Mr. Wickremasinghe is believed to have Part V. in hand.\n\nEye-copying and securing ink \"squeezes\" of the lithic records of the Island was steadily continued last year. The inscriptions of the North-Western Province are now being gradually collected.\n\nIt has been decided by the Government that all \"estampages\" of Ceylon inscriptions are, after being photographed, to be stored\nat the Colombo Museum for the benefit of the students of the palaeography and ancient language of the Island as deducible from its cave rock, slab, and pillar records.\n\nCOUNCIL.\n\nUnder Rule 16 Messrs. C. Drieberg and R. G. Anthonisz had to retire by seniority, and the Hon. Mr. S. C. Obeyesekere and the Hon. Mr. Justice A. Wood Renton by least attendance, but two of these gentlemen being eligible for re-election, Messrs. R. G. Anthonisz and C. Drieberg were re-elected, and the vacancies in the Council were filled by the appointment of Messrs. E. B. Denham and M. Kelway Bamber.\n\nThe vacancy caused by the death of Mr. J. Parsons was filled by the appointment of Mr. D. B. Jayatilaka, and that caused by the death of Mr. C. M. Fernando was filled by the appointment of the Hon. Mr. H. L. Crawford, C.M.G.\n\nPRESIDENTSHIP.\n\nThe vacancy caused by the resignation of the Hon. Mr. John Ferguson, C.M.G., was filled by the appointment of Sir Hugh Clifford, K.C.M.G., who was Vice-Patron of the Society the previous year.\n\nFINANCES.\n\nAnnexed (see page 58) is a balance sheet, showing the expenditure and receipts for 1909.\n\n12. Dr. Nell proposed the adoption of the Report which, he said, was very gratifying. It showed an increase in the number of Members, and it was interesting to note that a good number of Civil Servants were joining the Society. The Society is now as flourishing as it was 25 years ago.\n\n13. Mr. Roles seconded and, as a former Treasurer, congratulated the Society on its substantial balance.\n\n14. The Chairman thought the Report was, on the whole, satisfactory, not only in the direction indicated by Dr. Nell, but also from the point of view of the finances of the Society, which at any rate at the present moment, were thoroughly sound.\n\nThe Report was then adopted.\n\nOFFICE-BEARERS.\n\n15. The Chairman pointed out that he would be away from the Island from the end of the ensuing month till next year, and stated that in these circumstances he thought it altogether undesirable that he should be re-elected President.\n\n16. Mr. Harward said that at a Meeting of the Council it had been unanimously decided to ask Sir Hugh Clifford to retain his position as President. Other Presidents absent from the Island on furlough had retained the position and resumed the duties on returning, and he thought he was not going too far in saying that\n## Balance Sheet for 1909.\n\n### RECEIPTS.\n\n| Description                  | Amount | Total |\n|------------------------------|--------|-------|\n| Balance from 1908            | —      | 260 76|\n| Life Membership Payments     | —      | 75 0  |\n| Entrance Fees                | —      | 194 25|\n| Government Grant             | —      | 500 0 |\n| Annual Subscriptions:        |        |       |\n| 1901–1905                    | —      | 73 50 |\n| 1906                         | —      | 31 50 |\n| 1907                         | —      | 148 50|\n| 1908                         | —      | 335 0 |\n| 1909                         | —      | 1,380 0|\n| 1910                         | —      | 77 6  |\n| Sale of Publications         | —      | 34 88 |\n| Rs. 1,260.85 on Deposit Account with interest at 3½ per cent. for twelve months | — | 1,304 97|\n\nTotal .. 4,415 42\n\n### EXPENDITURE.\n\n| Description                  | Amount | Total |\n|------------------------------|--------|-------|\n| Printing Account             | —      | 1,862 16|\n| Charges Account              | —      | 435 10 |\n| Books Account                | —      | 13 40 |\n| Salaries Account             | —      | 938 26 |\n| Postage Account              | —      | 215 0 |\n| Balance to 1910 in Bank of Madras | — | 951 50 |\n\nTotal .. 4,415 42\n\nGERARD A. JOSEPH,\nHonorary Treasurer.\nat no period within his memory had the Society been more prosperous than during the short Presidency of Sir Hugh Clifford. He thought he was expressing the wishes of all in hoping that the Chairman would reconsider his decision.\n\n17. The Chairman said he was very sensible of the honour they had done him, but his own strong opinion in the matter was that the President of the Society should be present in the Colony, and should be an active force both on the Council and at the Meetings of the Society. It seemed to him that to elect any person President a few weeks before his departure from the Colony, when during the remainder of the current year he could not, humanly speaking, be in it, was not to do quite full justice to the Society and not to fill the Presidential chair in a way that was likely to serve the Society’s best interests.\n\n18. Being further urged the Chairman said he did not wish to press his objection, and the office-bearers were then, on the motion of Mr. E. W. Jayewardene, seconded by Dr. C. A. Hewawitarena, elected as follows:\n\nPresident.—The Hon. Sir Hugh Clifford, K.C.M.G.\n\nVice-Presidents.—The Hon. Messrs. J. P. Lewis and P. Arunáchalam, Dr. A. Willey and Mr. Philipp Freudenberg.\n\nCouncil.—Mudaliyárs A. M. Gunasékera, Simon de Silva, and R. C. Kailasapillai, the Hon. Mr. H. L. Crawford, and Messrs. C. Drieberg, R. G. Anthonisz, E. B. Denham, M. K. Bamber, D. B. Jayatilaka, P. E. Pieris, E. W. Perera, and J. Still.\n\nHonorary Treasurer.—Mr. Gerard A. Joseph.\n\nHonorary Secretaries.—Messrs. H. C. P. Bell, J. Harward, and Gerard A. Joseph.\n\n19. Mr. Roles inquired the date of Mr. Lewis’s departure.\n\nThe Chairman said that it was the same as his own, but he gathered that the Council put forward his name as a Vice-President out of compliment to so learned, distinguished, and useful a Member.\n\nVote of Thanks.\n\n20. Mr. Perera proposed a hearty vote of thanks to the Chairman, who had been not only an ornament but an active force for the good of the Society.\nCOUNCIL MEETING.\n\nColombo Museum, June 9, 1910.\n\nPresent:\nThe Hon. Mr. P. Arunáchalam, M.A., C.C.S., Vice-President,\nin the Chair.\nMr. R. G. Anthonisz.\nHon. Mr. H. L. Crawford,\nC.M.G.\nMr. C. Drieberg, B.A., F.H.A.S.\nMr. A. M. Gunasékera, Mudaliyár.\nMr. D. B. Jayatilaka, B.A.\n\nMr. R. C. Kailásapillai, Mudaliyár.\nMr. E. W. Perera, Barrister-at-Law.\nMr. P. E. Pieris, M.A., LL.M., C.C.S.\n\nMr. G. A. Joseph, Honorary Secretary and Treasurer.\n\nBusiness.\n\n1. Read and confirmed Minutes of last Council Meeting held on March 16, 1910.\n\n2. The Chairman, before proceeding with the business of the Meeting, addressed the Meeting in regard to the death of King Edward VII.\n\nThe first business to-day is in connection with the great and sudden calamity which has fallen on us since we last met. In the absence of the President, Sir Hugh Clifford, from the Island, it falls to me as Vice-President to submit for your acceptance a resolution, which I would ask you to pass in solemn silence.\n\nThe loss we deplore is of no ordinary sovereign. In the discharge of the duties of his exalted station, His late Majesty won the respect, love, and devotion of all his subjects. They knew that their welfare was his highest aim, and that for it he worked with unceasing toil. Up to his last breath he remained steadfast and true to that ideal of service which shone so long on his crest as Prince of Wales: *Ich dien.* His memory will be enshrined in the hearts of a grateful people. Well would it be for us if we strove, each in his sphere, to keep that ideal before us. It was the privilege of this Society to be linked to his gracious personality as Patron of our parent Society. His Majesty's lively interest in art, science, and literature was well known, and was manifested in the active encouragement and support of numerous institutions throughout the Empire for their advancement. Above all, the British Academy, which he founded, will be an enduring testimony to his patronage of literature. By his\nsuccessful efforts in the promotion of international harmony and goodwill he laid the whole world under his debt, and was universally hailed as the Great Peacemaker; and what nobler title can there be to the remembrance of posterity?\n\nTo that Gracious Lady, the widowed Queen, in her affliction, our thoughts have daily turned ever since the sad news was flashed to us by the wires, and we pray that God in His goodness may give her strength to bear her sorrow. King Edward and Queen Alexandra have always seemed very near to us in Ceylon. His Majesty honoured the Island with a visit extending over many days in 1875, and captivated the hearts of all. The links then formed were renewed and strengthened when Their Majesties sent their two beloved sons, still in their teens, among us in the year 1882, and later their present Majesties in 1901. Our Island was thus specially favoured among the King’s dominions.\n\nHis late Majesty’s interest and attachment to Ceylon was shared by all the Royal Family. This was brought home to me in a striking manner in the winter of 1904, when Mrs. Arunáchalam and I were in England, and Her Majesty Queen Alexandra was graciously pleased to honour us with a private audience at Buckingham Palace. Impressed as we were—and who is not?—by the Queen’s marvellous beauty and gracious manner, we were scarcely less impressed by the interest manifested in this Island and its people and the concern for their welfare—an interest so deep that Her Majesty expressed her disappointment that it had not been possible for her to accompany the King to Ceylon in 1875, but Her Majesty still hoped to pay the Island a visit. The happiness of welcoming Her Gracious Majesty among us can now be scarcely hoped for. But should that good fortune be granted to us, no need to say that the Queen Mother is assured of a universal welcome of the most loyal affection and devotion. It is impossible for any formal words to express our grief at the close of so great and beneficent a career as that of His late Majesty and our sympathy with the widowed Queen. But such as it is, I ask you to pass this resolution and to authorize the Honorary Secretary to forward it to His Excellency the Governor for submission to His Majesty the King and the Queen Mother.\n\nThe following vote of condolence was passed in solemn silence, all Members standing.\n\nResolved,—“To place on record the grief of this Society and its sense of the profound loss sustained by the British Empire, and by the world of art, science, and literature, by the death of His Majesty King Edward VII., Patron of the Parent Society, and to submit the same with our humble condolence to His Majesty King George V., the Queen Mother, and the Royal Family.”\n\n3. Resolved,—That the following Members be recommended for election:\n\n(1) C. A. Davis: recommended by H. van Cuylenberg, G. A. Joseph.\n\n(2) C. V. Brayne, C.C.S.: recommended by J. A. Daniel, G. A. Joseph.\n(3) C. M. Lushington, C.C.S.: { J. A. Daniel.\nrecommended by G. A. Joseph.\n\n(4) T. A. Abdul Raheem: recom-\nmended by J. A. Daniel.\nG. A. Joseph.\n\n(5) J. O’K. Murty, C.C.S.: recom-\nmended by J. A. Daniel.\nG. A. Joseph.\n\n(6) R. B. Strickland, M.A.: recom-\nmended by A. Willey.\nG. A. Joseph.\n\n(7) D. A. W. Bandaranayaka,\nProctor, S.C.: recommended\nby D. B. Jayatilaka.\nG. A. Joseph.\n\n(8) J. A. Varey, Irrigation Engi-\nneer: recommended by J. W. Robertson.\nG. A. Joseph.\n\n(9) J. E. Rode: recommended by G. A. Joseph.\nA. H. Gomes.\n\n4. Laid on the table a Paper entitled \"The Earliest Dutch Visits to Ceylon,\" by Mr. Donald Ferguson.\nResolved,—That the Paper be referred to Messrs. F. H. de Vos and R. G. Anthonsiz.\n\n5. Laid on the table a Paper entitled \"Translation of Kávyasékhara, Chapter I.,\" by Mr. A. O. Jayawardana.\nResolved,—That the Paper be referred to Messrs. P. E. Pieris and A. Mendis Gunasekera, Mudaliyar.\n\n6. Laid on the table a letter from Mr. J. Still regarding his \"Notes on Katuwana Fort.\"\nResolved,—That the Notes be referred to Mr. P. E. Pieris, in terms of Council's Resolution at the last Meeting, and then, with the remarks of Messrs. Harward and Pieris, be sent to Mr. Still.\n\n7. Laid on the table a letter from Mrs. A. K. Coomaraswamy regarding the translation of Professor Geiger's Maldives Paper.\nResolved,—That the matter do stand over.\n\n8. Laid on the table Circular No. 79 of March 19, containing the opinions of Messrs. P. E. Pieris and J. Still on the Paper entitled \"Mulgiri-gala,\" by Mr. Donald Ferguson.\nResolved,—That the Paper do lie over till the cost of reproducing the Plates be ascertained.\n\n9. In view of Dr. A. Willey's (Vice-President) departure from Ceylon—\nResolved,—To express the Society's appreciation of the valuable services rendered to it by Dr. A. Willey, M.A., D.Sc., F.R.S., as Vice-President, and to the cause of Science in Ceylon as Director of the Colombo Museum, and its deep regret at the severance of his connection with Ceylon, and to recommend to the Society that he be elected an Honorary Member for life under Rule 7.\n\n10. Resolved,—That a General Meeting be held early in July, and that the date and the business be left in the hands of the Secretaries and Vice-President.\nHier leyt begraven\nJuff. Maria Magdalena\nvan der Heyden huyfvrrouwe\nvan den E. Heer Carel Bolner\ncommandeur der stadt en landen van Gale Maturee\noverleeden den 12 Januari\nA° 1697\nFOURTH SUPPLEMENTARY PAPER ON\nTHE MONUMENTAL REMAINS OF THE DUTCH EAST\nINDIA COMPANY IN CEYLON.*\n\nBy F. H. de Vos,\nBarrister-at-Law, and Member of the Society of Dutch Literature,\n&c., of Leyden.\n\nRecent excavations on the site of the \"Groote Kerk,\"† Church street, Galle, have resulted in the discovery of two Dutch tombstones, sketches of which, kindly made for me by Mr. D. W. Goonawardena, of the Police Court of Galle, are submitted with this Paper. These tombstones have been laid down on the floor of the Dutch Reformed Church, Galle.\n\n1.\n\nSee Plate I.\n\nTranslation.—Here lies buried Juff. Maria Magdalena van der Heyden, wife of the Hon. Carel Bolner,‡ Commandeur of the City and Lands of Galle and Matara. Died on January 12, 1697.\n\nRemarks.—Carel Bolner was a native of Dantzig. He was an Assistent, 1670 (Colombo), Koopman and Pakhuismeester, 1686 (Colombo), Koopman and Administrateur, 1688 (Colombo), Commandeur, 1693–1704 (Galle), Governor of Malacca, May 10, 1704–1707. Maria Magdalena van der Heyden, born in Hoorn, was his second wife, he having married her in Colombo on February 1, 1682. He married thirdly, in Colombo, on March 5, 1702, Susanna van Schayck,§ baptized in Colombo May 5, 1661, daughter of Andries van Schayck of Utrecht and Abigail Ketelaer of Ter Goes. She died in Malacca on\n\n* Journal, vol. XV., No. 49, p. 213; vol. XVII., No. 52, p. 12; vol. XVIII., No. 54, p. 51; vol. XVIII., No. 56, p. 393.\n† Journal, vol. XV., No. 49, p. 267.\n‡ 50 Navorscher 238, 54 Navorscher 175.\n§ Ceylon Observer, May 9, 1906. Journal, Straits Branch, Royal Asiatic Society, No. 34, July, 1900, p. 20.\nFebruary 4, 1707. Before her marriage with Carel Bolner, Susanna van Schayck had contracted two other marriages: (1) with Hendrik Schook, Koopman, and (2) with the Rev. Hermanus Specht of Utrecht.\n\n2.\n\nSee Plate II.\n\nTranslation.—Gravestone covering the dead body of Juff. Piaternella de Ridder, widow of the late Captain-Lieutenant Cornelis Verdonk. Died September 14, 1698, aged 24 years and 8 months.\n\nArms.—The arms are those of the Verdonk family. Rietstap* gives the following blazon:\n\nVerdonk.—Bruxelles. (An. 6 juillet, 1737 : chevaliers du St. Empire 28 déc. 1737.) Ec. aux 1 et 4 d’azur au lion d’arg. arm. et lamp. de gu. aux 2 et 3 d’azur à trois gerbes d’or, liées de gu. Cq. cour. C le lion iss.\n\nThe second and third quarterings are the arms of some family allied by marriage to the family of Verdonk.\n\nRemarks.—Cornelis Verdonk was perhaps the son of David Verdonk and Angeneta Roberts Alma.† There was a Dirk Verdonk, an Assistant, Colombo, 1677.\n\n3.—St. Stephen’s Church, Fort Frederick, Trincomalee.\n\nHier onder legt begraven\n\nRebecca Schodt\n\nIn haar leven huysvrouw van\n\nden oppercoopman en opperhoofd\n\nder Ceylonse ooste districten\n\nMartin Rein\n\nGebooren te Colombo den 22\n\ndecember anno 1690 en\n\noverleden den 6en jany 1760\n\noud 69 jaar 5 maanden en 15 dagen.\n\n* “Armorial Général.”\n† Journal, Straits Branch, Royal Asiatic Society, No. 34, July, 1900, p. 13.\nGravesteen deckende het doode lichaem van Iuff Pieter Nella de ridder wed Wyle den capitain Luytenant Cornelis Verdonk overledenden 10 sep tember anno 1690 oud 24 iaaren en 8 maanden\nTranslation.—Hereunder lies buried Rebecca Schodt, during her life the wife of the Opperkoopman and Chief of the Eastern Districts of Ceylon, Martin Rein. Born in Colombo on December 22, 1690, and died on January 6, 1760, aged 69 years 5 months and 15 days.\n\nRemarks.—Rebecca Schodt was perhaps the daughter of Claas Schodt of Hamburg, Dissave of Colombo, and Sara de Meestre of Colombo, whom he married in Colombo, July 21, 1680.\n\nMartin Rein was Dissave of Matara, 1737–1739. He was a native of Hesse Cassel, and arrived in Ceylon in the year 1731, in the ship \"Noordwoordigsveen.\"\n\n4.—Mannar.\n\nHIER RUSTEN IN DEN HEERE\nOP 23 FEB. 1740\nMEJUFR. JOHANNA COORN\nVROUW VAN DEN HEER\nJOHAN\nVAN DER SPAR EN OP\n28 MEY 1775 HAAR ED.\nKLYNZOON DEN JONGEN\nHEER JOHANNES CHRISTIANUS VAN DER SPAR\n\nTranslation.—Here rest in the Lord, on February 23, 1740, Johanna Coorn, wife of Johan van der Spar, and on May 28, 1775, her grandson, Johannes Christianus van der Spar.\n\nRemarks.—This tombstone was discovered in two pieces in Mannar by Mr. J. P. Lewis, C.C.S., one forming the front doorstep to the Parsonage of the Roman Catholic Church of St. Mary, and the other the back doorstep of the Parsonage of the Roman Catholic Church of St. Sebastian. The stone is now in the Fort Church, the Bishop of Jaffna having kindly handed over the two portions to the Government Agent.\n\nJohan van der Spar and Johanna Coorn were the parents of Mattheus van de Spar, the Administrateur of Galle, born in Jaffna, May 19, 1730, died in Galle, November 24, 1806.\nMattheus was first married to Dorothea Cornelia van Dam. They were the parents of Johannes Christiaan van der Spar, baptized in Galle, January 15, 1758, died in Mannar, May 28, 1775. Mattheus van der Spar was Opperhoofd of Mannar in 1775. His grandfather, Johannes van der Spar, was also Opperhoofd of Mannar when he died in 1719.\n\n5.—Dutch Cemetery, Galle.\n\nHIER ONDER LEGT BEGRAVEN HET LYK VAN WILLEM CAREL DE SILVA, IN LEVEN BAAS TIMMERMAN\nGEBOREN DEN 8 JAN. 1775 EN OVERLEDEN DEN 2 JANUARY 1820, ’S MORGEN OM 4 UUR,\nOUD 44 JAAREN 11 MAANDEN EN 24 DAGEN ZALIG ZYN DE DOODEN\nDIE IN DEN HEERE STERVEN\n\nTranslation.—Hereunder lies buried the body of Willem Carel de Silva, during his life master carpenter. Born on January 8, 1775, and died on January 2, 1820, at 4 o’clock in the morning, aged 44 years 11 months and 24 days.\n\nBlessed are the dead which die in the Lord.\n\n6.\n\nA silver memorial plate purchased by the Museum:\n\nTER.\n\nGEDAGTENIS: VAN DEN\nEERSAMEN\nNICOLAAS HUYSELAAR,\nIN ZYN LEVEN BAAS DER\nSMITS, EN KUYPERS;\nGEBOOREN TE STYNBACH,\nDEN 13 APRIL, 1714, OVERLEEDEN\nTE KOLOMBO,\nDEN 19 APRIL, 1774\nOUD 60 JAAREN\nEN 6 DAAGEN.\nTranslation.—To the memory of the worthy Nicolaas Huyselaar, during his life Baas of the smiths and coopers. Born in Steinbach on April 13, 1714. Died in Colombo on April 19, 1774. Aged 60 years and 6 days.\n\nRemarks.—Nicolaas Huyselaar arrived in Ceylon in the ship \"Horsen\" in 1742 as a ship's corporal. He was married to Anna Catharina Grim, born in Colombo 1726, the daughter of Hendrik Grim of Weenen and Anna de Almeida.\n\n7.—Gold Medal with Chain.\n\nGEGEEVEN\nDOOR DEN HEER RAAD ORDINAIR\nEN GOUVERNEUR VAN CEILON\nWILLEM JACOB VAN DE GRAAFF\nAAN\n\nJOHANNES DE SARAM WIJEYESEKERE ABERATNE TWEEDE MAHA MODELIAAR VAN 'S GOUVERNEURS PORTA OM HEM EN ZYNE NAZAATEN NA HEM TE DIENEN TOT EEN TEKEN YAN EERE EN ERKEN-\nTENIS VAN ZYNE IN ALLE GELE-GENTHEEDEN TEGENS DE EDELE NEDERLANDSCHE KOMPAGNIE BEWESENE TROUW IN VOORSCHREEVE ZYN POST EN OM HEM TER EERE TE STREKKEN EN TOT EENE BELOONING VOOR DEN YVER EN WELMEE-\nNHEID DOOR HEM GETOOND TER BEVORDER-\nING VAN DE KANNEEL KULTURE ZOO IN ZYN GEHOUDE DIRECTIE OVER HET ZUIVEREN EN AANPLATEN VAN ENE UITGESTREKTE STUK 'S GRONDS TE DEMETIGODDE DAT IN DE WANDELING GENAAMT WORD \" 'S GOUVERNEURS TUIN \" ALS IN HET SCHOOONMAAKEN EN MET KANNEEL BEP-\nLANTEN VAN GRONDEN OP ZYN EIGE KOSTEN WAARVAN VERSCHEIDE ZEER GOEDE STUKKEN DOOR HEM AAN DE KOMPAGNIE VOOR NIETS ZYN AFGESTAAN DIE ZEDERT AAN DE KANNEEL-\nSCHILLERS ZYN AFGEGEVEN EN VAN WELKE ZYN\nYVER TOT 'S KOMPAGNIES DIENST HY EEN NIE-UWE BLYK HEEFT GEGEVEN MET OP ZIG TE NEEMEN DE ZORG OVER DE AANPLANTINGEN VAN KANNEEL KOFFI EN PEPER IN DE VIDAANNIEN VAN KALANIE EN AMBATLE KOLOMBO DEN 23 AUGUSTUS 1792.\n\nTranslation.—Given by the Raad-Ordinair and Governor of Ceylon, Willem Jacob van de Graaff, to Johannes de Saram Wijeyesekere Aberatne, Second Maha Mudaliyar of the Governor's Gate, to serve as a token of honour to him and his posterity after him and as an acknowledgment of the constant fidelity shown by him in his aforesaid office to the Honourable Dutch Company, and to conduce to his honour and as a reward for the zeal and interest shown by him in the advancement of cinnamon cultivation, not only in his superintendence of the clearing and planting of an extensive piece of land in Demetegodde, commonly called \"The Governor's Garden,\" as also in the clearing and planting with cinnamon at his own expense of lands, of which many very good lots were given for nothing to the Company, and which were since given to the cinnamon peelers, and he having given a fresh proof of his zeal in the Company's service by undertaking the duty of planting with cinnamon, coffee, and pepper the vidane-districts of Kalanie and Ambatle.\n\nColombo, August 23, 1792.\n\nRemarks.—On the reverse two seals, (1) charged with a lion rampant carrying in his left paw a sheaf and in his dexter a drawn sword, with the motto \"Eendracht maakt macht\" round the border; (2) charged with a three-masted ship in full sail with the words \"Vereenigde Nederlandsche Oost-Indische Compagnie\" round the border.\n\nThis medal is the property of Mr. J. Louis Perera, Proctor, Kollupitiya, the great-grandson of the donee.\n\nJohannes de Saram Wijeyesekere Abeyratne was the son of Domingo de Saram Wijeyesekere Abeyratne, Guard Mudaliyar, and Dona Catharina Tillekeratne. He married on January 30, 1774, Francina Perera Samaranaike, and had a daughter,\nAnganeta de Saram, who married John Paul Perera Goonewardene, Second Atapattu Mudaliyar. Their son John Louis Perera married Caroline, the daughter of the Kuruwe Mudaliyar, S. L. Perera. The possessor of the medal is a child of the last-named spouses.\n\n8.\n\nRemarks on Plate No. 44:—\n\nJacob Verboom was a native of Rotterdam, and was married to Maria Berenberg of Batavia. He married secondly, in Batavia, October 3, 1720, Elisabeth Henrietta Mondiger,† who died in Batavia, August 22, 1730, after having married in Batavia on June 16, 1729, Adriaan de la Barre of Gorcum, the widower of Helena Vrythove.\n\n* Journal, R.A.S. (C.B.), vol. XVIII., No. 54, p. 74.\n† Journal, R.A.S. (C.B.), vol. XVII., No. 52, p. 49.\nGENERAL MEETING.\n\nColombo Museum, August 3, 1910.\n\nPresent:\n\nThe Hon. Mr. P. A runáchalam, M.A., C.C.S., Vice-President,\nin the Chair.\n\nThe Hon. Sir J. T. Hutchinson, Kt., M.A., Vice-Patron.\n\nMr. E. Burgess.  \nMr. B. C. Cooray.  \nMr. C. A. Davis.  \nMr. E. B. Denham, B.A., C.C.S.  \nMr. S. de Silva, Gate Mudaliyár.  \nMr. W. A. de Silva, J.P.  \nMr. D. Devapuraratna.  \nVen. F. H. de Winton.  \nMr. A. H. Gomes.  \nMr. T. Gracie.  \nMr. B. Horsburgh, M.A., C.C.S.  \nMr. P. E. Morgappah.  \nDr. A. Nell, M.R.C.S.  \nMr. C. Namasivayam, J.P.  \nRev. M. Sri Nánissara.  \nMr. J. P. Obeyesekere, B.A., LL.B.  \nRev. J. P. de Pinto.  \nMr. T. A. Abdul Raheem.  \nDr. W. P. Rodrigo, M.R.C.S.  \nMr. F. C. Roles.  \nDr. D. Schokman, F.R.C.S.E.  \nMr. C. C. J. Senaviratna.  \nMr. W. T. Southorn, B.A., C.C.S.  \nRev. S. Sumangala.  \nMr. F. A. Tiseverasingha.\n\nMr. G. A. Joseph, Honorary Secretary and Treasurer.\n\nVisitors: eight ladies and seventeen gentlemen.\n\nBusiness.\n\n1. Read and confirmed Minutes of last General Meeting held on March 16, 1910.\n\n2. The following Resolution which had been passed at a Meeting of the Council of the Society was notified to the General Meeting:—\"To place on record the grief of this Society and its sense of the profound loss sustained by the Empire and by the world of Art, Science, and Literature by the death of His Majesty King Edward VII., Patron of the parent Society, and to submit the same with our humble condolence to His Majesty King George V., the Queen-Mother, and the Royal Family.\"\n\n3. A further Resolution passed by the Council was also notified:—\"To express the Society's appreciation of the valuable services rendered by Mr. A. Willey, M.A., D.Sc., F.R.S., to it as Vice-President, and to the cause of Science in Ceylon as Director of\nthe Colombo Museum, and its great regret at the severance of his connection with Ceylon. It is recommended to the Society that Dr. Willey be elected an Honorary Member for life under Rule 7.”\n\nThe recommendations of the Council were adopted by the Meeting.\n\n4. The Chairman moved—“That this Society desires to record its profound regret at the death of Mr. Donald W. Ferguson, and its appreciation of the very valuable services rendered by him to the Society and to historical research in Ceylon, and to express its deep sympathy with his family.”\n\nIn doing so Mr. Arunáchalam said: “It is my sad duty to announce to the Society the death of one of its most valued members—Mr. Donald Ferguson. He belonged to a family which has for almost a century been identified with Ceylon, and has laid the Island under many obligations. He began life as a journalist on the staff of his father’s paper, the Ceylon Observer, and rose to be one of its editors.\n\nFollowing the tradition of his cousin, Mr. John Ferguson, who was till recently our President, and of a great journalistic figure in the past, Mr. John Capper, of the Ceylon Times, who was for many years our indefatigable Secretary, Mr. Donald Ferguson did not confine himself to journalism, but entered with zest into literary work, of which our Society reaped a good harvest.\n\nCompelled by ill-health to leave Ceylon, he settled down in Croydon and devoted himself with undiminished ardour to his favourite literary pursuits, chiefly the history and antiquities of Ceylon. The quantity and quality of his work, which would have been great for a person in vigorous health, were truly surprising when one remembers the conditions under which that work was produced.\n\nHe was a man of varied and profound research, master of many languages, ancient and modern—perhaps the greatest linguist on the roll of our Members. There was scarcely a branch of Ceylon history or antiquities in which his opinion was not listened to with attention and respect.\n\nBut the field which he made specially his own was the Portuguese and Dutch period of Ceylon history, and especially the Portuguese period. No Member has made more numerous or more valuable contributions to our journal. I hold in my hand a long list of those contributions. The most important of them was the translation which he undertook for our Society of “Barros and de Couto’s History of Ceylon,” and completed with exhaustive notes, receiving the well-merited thanks of the Society.\n\nHe laboured for us and thought of us to the end. Not long ago he presented this Society with a precious MS. copy of “Ribeiro’s Ceylon,” which had been used by Abbe le Grand in making his translation. A Paper which was recently received from him on the “Earliest Dutch Visits to Ceylon” will shortly appear in our Journal. When his doctors had given up hopes of his recovery, he wrote a pathetic note, expressing his regret that he would not live to complete other tasks he had set himself.\nHe was indeed a rare type of scholar. His life should be an example and a stimulus to us all, and his memory will be cherished with gratitude by this Society. I am sure I am echoing the unanimous views of the Society in desiring to place on record our appreciation of his services, the sense of our loss, and our sympathy with his bereaved family.\n\nBefore submitting the formal motion, I venture to express the hope that his valuable collection of books and MSS. will not be dispersed, and that it may please the Ceylon Government to acquire it for the Island.\n\n5. The motion was seconded by Dr. A. Nell, supported by Mr. P. E. Morgappah, and carried.\n\n6. The Secretary next announced that the following gentlemen had been elected to Membership in the Society since the last Meeting:—Messrs. C. A. Davis; C. V. Brayne, B.A., C.C.S.; C. M. Lushington, C.C.S.; T. A. Abdul Raheem; J. O'Kane Murty, C.C.S.; R. B. Strickland, M.A.; D. A. Wickramasinghe; J. A. Vareey; and J. E. Rode.\n\n7. Mr. Joseph read the following Paper by Mr. John Still:—\nTANTRI-MALAI:\n\nSome Archaeological Observations and Deductions.\n\nBy John Still.*\n\n*Tantri-malai* is the name now given to a wilderness of rocks situated about two miles west of the Malwatu-oya and about twenty miles due north-west of Anurádhapura. For many centuries the place has been abandoned, and although it was at one time an important monastery, with perhaps an adjacent town, at the present day its very name is lost.\n\nDespite its situation in quite uninhabited country, and on the edge of one of the largest stretches of wild forest in the northern half of the Island, Tantri-malai has been frequently visited. A notice of it appears in Mr. Parker's recent book, \"Ancient Ceylon\" (pp. 244–5), and a fuller account in the Archaeological Commissioner's Annual Report for 1896.†\n\nMr. Bell, on his visit in October, 1896, encountered the stormy rainy weather which usually ushers in the north-east monsoon in that part of the country; and of the other visitors, most, if not all, made but short stay at the rock. It, therefore, happens that I am able to record a certain amount that is new, for I spent a week there, living in a cave and devoting my whole time to exploration of the rocks.\n\nThe rocks of Tantri-malai differ from those tumbled labyrinths the ancient Sinhalese most usually chose for their early monasteries. They are less a collection of boulders than a huge series of frozen waves of stone, separated one from another by narrow gullies full of jungle and tangle and thorns. Owing to this formation there are fewer caves than usual, and in consequence fewer inscriptions; for the earliest inscriptions were generally cut on the brows of caves.\n\nBroadly speaking the rocks divide into two groups, with a sinuous stretch of grass land between them, which at its\n\n* Mr. Still served as Assistant to the Archaeological Commissioner from January 1, 1902, to December 31, 1907.—B., Ed. Sec.\n\n† A footnote to page 7 of this Report gives a list of other accounts of Tantri-malai in diaries of Civil Servants. See Appendix B.—B., Ed. Sec.\nlower—southern—end widens out into a little tank formed by an embankment thrown from rock to rock. At the time of my visit (December, 1909) this intervening grass land was a rather swampy meadow, the favourite haunt of wild buffaloes. But in the days when the monastery flourished it too must have been submerged by the waters of the tank. With the large area of non-absorbent rock to collect and transmit the rain, it is probable that a very considerable population might have subsisted by means of this reservoir; always supposing, of course, that no water was drawn off for irrigation purposes, and of this there is no indication in the way of either sluice or channel. In this dry land, and remote from the river, water conservance was of the first importance, and I am inclined to attribute an early date to this little reservoir.\n\nBut the history of Tantri-malai goes back far beyond the tank—at least I think so—and it seems to me that in its various remains we can read of four different ages of occupation, ending in tragic abandonment. It may be that in this I have tried to see too much in the stones and their record; but the evidence, such as it is, forms the subject of this Paper, and those who cannot accept the conclusions may perhaps form others from the observations.\n\n1.—Earliest Period.\n\nIn the south-eastern quarter of the area of rocks there stands a boulder, which by its overhanging sides forms a shelter convenient alike to man and beast. At the present day it is obviously the den of beasts, and in it are bones which show it has been used by leopards.\n\nBut in prehistoric times it must have been the refuge of human beings, for in it I found chipped fragments of chert and a piece of crystal. These were not in any sense implements, but they may have been the waste chips thrown away while implements were being made. For they are of material quite foreign to their surroundings, such as could hardly have come to be where they were by accident. Of their age, I am quite incompetent to form even an estimate; but to their newness I can put a limit—the limit is 2,000 years ago. The cave where they were found has a drip-ledge\ncut along its face; but it bears no inscription. However, from other inscriptions which will be given later, it is clear that a monastery existed in the Tantri-malai caves about 100 years before Christ, and it is permissible to believe that this cave was occupied at much the same date.\n\nThe floor of the cave in monastic times was rudely paved with uncut pieces of flat stone, and some ten inches of earth intervened between this and the bed-rock floor. It was on the rock floor that these chips were found. They may be later than I think, but the earth above them and below the pavement held nothing, not even fragments of brick or pottery; so I think they must be very early. If they had been found all about the cave and at a more modern level they might be taken to be fire-strikers of early Sinhalese date; but there were no other fragments of similar stone, and these were alone nearly a foot below the old paved floor. The only other objects found at this lowest level were two pieces of what is apparently a fresh-water shell. These results are slender; but there are several other caves which might yield more if carefully excavated, especially those at Ándiyá-gala, about three miles south of Tantri-malai.\n\n2.—First Buddhist Monastery.\n\nWhen the fine eagerness of early Buddhist zeal led monks and nuns to seek out restful solitudes throughout Ceylon, they very often chose for themselves homes among the rocks. Apart from the history literature affords, all that we know of the early monasteries has been gathered from caves, buildings, and inscriptions on rocks. Throughout the Island, and especially in the northern plain, there are scores of such monasteries. It is hardly an exaggeration to say that in the North-Central Province and the Wanni nearly every considerable rock outcrop shows some trace of early occupation. Probably it was the water holes they contain which led people to occupy them, for a great many of these rocks contain deep narrow pools which hold a supply of drinking water throughout the dry weather—in many cases the only available drinking water for several miles. This water and the shelter of their caves formed their attraction.\nAt Tantri-malai, as in so many other places, the first settlement of which we have any definite record was a Buddhist monastery founded in the early centuries B.C. To support this view there are three inscriptions,* two of the second or first century B.C., and one perhaps a hundred years more modern. None of these have been published before, but the first was copied by Mr. Bell in 1896. It consists of eleven letters cut\n\n\\[ \\text{Ba ra ta pi da ha ti sa te ra ha} \\]\n\nin the rock just above one of the best of the natural cisterns, and reads \"Ba ra ta pi da ha ti sa te ra ha.\" As stated above, the letters are of early form, and may be as old as the second century B.C. \"Baratapida\" may be a name; in which case the record would read \"[that which] belongs to Baratapida and the monk Tissa\"; or \"Barata\" may be a name, and pi da perhaps derived from pudanavá, to offer.\n\nThe next record, of about the same date, is cut in the rock by the side of a long cave about 60 yards to the east of the last inscription. It is low down at the east end of the cave.\n\n\\[ \\text{A ti a ji ri ya ba ti} \\]\n\n\\[ \\text{ya ma ta u pa si ka na ga ya} \\]\n\nIt reads \"A ti a ji ri ya ba ti ya ma ta u pa si ka na ga ya,\"\n\n* See Appendix B.—B., Ed. Sec.\nand possibly a few more letters now obliterated. The earlier part of it is beyond me; but from the latter half it is plain that the cave was once the abode of a lady named Nága, who had devoted herself to religion.\n\nThe last inscription of approximately this period is cut in the rock above a small natural cistern about 150 yards north-north-east of Upásiká Naga’s cave.\n\n\\[ \\text{Ba ta su ma na ha ta la cha da} \\]\n\nJudging by the shapes of the sa, ma, and ha, this belongs to about the time of Christ. It reads “Ba ta su ma na ha ta la cha da,” and appears to be complete. Bata Sumana may be taken equally to mean “Brother Sumana,” or to be a single name; but what his talachada may have been I am not able to explain; tala could possibly be read talé, which means the blade of any sharp instrument, and the record may be simply that Bata Sumana cut his name.\n\nBeside these three definite date-fixing records, there are several other remnants of the early monastery.\n\nProbably the first monk or devotee who settled there lived in the fine natural cave, afterwards the cell of Upásiká Naga; but as the community grew, further accommodation had to be provided, and perhaps the cave where the chert flakes were found, and two others near to it, were then occupied. All three have drip ledges cut above their brows, but none bear inscriptions.\n\nI attribute to the same period a number of small stone buildings which occur almost at random on quite a number of the rocks. These are in most instances close to some natural cistern, which leads me to believe that they existed before the construction of the tank. There are about twelve of these buildings in all, each built of rough stone fragments which show no wedge marks and which seem to have been naturally fractured. I call them buildings, but as a fact they are no more than little rectangular platforms with no\nsteps or entrances of any kind. Their sides are formed of large rough stones laid in straight rows, and within the space thus formed they are filled up with stone rubble. Some contain brick débris, others do not, but possibly it may have all been washed away. The four sides of these platforms face approximately the four cardinal points, though in all cases their north is 20 or 30 degrees west of the north, as my compass gives it. They must have been the sites of buildings of some sort, but it is hard to imagine their exact nature: they can hardly have contained much brickwork, for almost all traces of brick have disappeared: they probably were not tiled, for I did not find even a single fragment of tile. It is therefore fairly certain that they were built of wood. Their length from north to south, as a rule, slightly exceeds their width from east to west, and in all cases they were small. I measured several, with the results given below: 16 ft. by 13 ft.; 18 ft. by 15 ft.; 18 ft. by 17 ft.; 15 ft. by 15 ft. From their ruined state measurements must be only approximations.\n\nOf the earliest monastery, we have, therefore, the following traces:—One large natural cave, spacious enough to shelter thirty people at least, with an inscription of the first or second century B.C.; an adjacent natural cistern, with an inscription of the same period; another natural cistern, with a rather later inscription; and a number of small rudely built stone platforms, once the sites of buildings in which the stones were collected, not quarried, for they bear no wedge marks; also three lean-to caves beneath boulders in which are no inscriptions, but which have cut drip-ledges.\n\n3.—First Post Christian Monastery.\n\nOf the next period, the most important item is the dágaba which stands on the apex of the largest and highest rock. From its bricks Mr. Parker (\"Ancient Ceylon,\" page 244) supposed this dágaba to belong to the second century or early first century B.C. If he is correct, then the dágaba must be added to the description already given of the first monastery; but, for several reasons, I am inclined to disassociate the\ndágaba from the early buildings I have described. Firstly, the stonework round about the dágaba all shows wedge marks, i.e., it was quarried stone, but that of all the little buildings was not quarried; secondly, the three inscriptions are all remote from the dágaba and in the other group of rocks; thirdly, the bricks in and around the dágaba, although chipped and broken, still retain their form, while those in the buildings on the rocks are so destroyed and washed that their débris is almost indistinguishable, and it was not possible from any fragment I observed even to tell that it had had straight sides or angles.\n\nFor these reasons I am inclined to believe that the dágaba is of later date than the other buildings described, and I would prefer to place it with the few buildings on the rock below it on the eastern side. Here there are not only wedged stone pillars, in which the oval wedge marks correspond both in size and in their intervals with those in the wedged stones around the dágaba, but there are also abundance of brick fragments which still to some degree retain their form. Still further to connect these buildings with the dágaba, there is the fact of their position, grouped upon either side of the steps which lead to the dágaba and to nowhere else.\n\nNow, the first described buildings were in nearly every case placed just beside a rock cistern, sometimes one on either side of it. These other buildings, larger, less ruined, and containing quarried stone, are not near any such water hole, but are close to the tank. It appears therefore that the tank was by this time the source of water supply. So from a tiny settlement we can trace the monastery's growth until there were stone-pillared buildings, a dágaba,* and a tank.\n\nIt is interesting to note that from the summit of the dágaba rock several of the great dágabas of Anurádhapura can be plainly seen on a clear morning, without the aid of a glass: Jétawanáráma and Abhayagiri stand out distinctly. It is\n\n* At this ruined dágaba I found a brick bearing a design of two lotus flowers. Almost similar bricks were found at Aluthalmilléwa, near Padawiya tank, by the Archaeological Survey in 1891 at a dágaba, with an inscription of king Wasabha, who reigned in the later half of the first century A.D. See Annual Report, Archaeological Survey, 1891, p. 10.\nvery hard to believe that the names of such great landmarks could get mixed, and that their identity can have been ever forgotten, as Mr. Parker supposes. The Mahá Séya Dágaba on Mihintalé kanda, full four and twenty miles away, is also plain to see.\n\n4.—Last Monastery on Tantri-malai.\n\nThe last and greatest monastery of Tantri-malai ended in a tragedy. As we have not succeeded in discovering the ancient name of this place, we cannot trace its history, but tragedy, catastrophe, and sudden flight, or death, are plain to see in its archaeology.\n\nUpon the rock which the dágaba crowns there is an image of Buddha, and below it another.\n\nThe former is a sedent figure carved from the rock in high relief, seated upon a throne, with lions carved on the panels. The figure faces to the north and looks towards the dágaba. From almost its very feet there started a grand flight of broad low steps cut in the face of the rock, and designed to lead to the dágaba; but they were never used. Their edges are as sharp as when the mason left them; eight steps are finished, and half of the ninth. Then came calamity.\n\nOn either side of the great sedent image, 8 ft. high upon his throne, the artist had designed four panels, each to contain a smaller sedent image some 3 ft. high. All of the eight panels, four on either side, are traced in the stone, but not one is finished. One has been roughly blocked out, another has been carved almost to the semblance of a man, others are hardly commenced, as they were on that evil day the craftsman left them.\n\nTo the north of the dágaba, at the foot of the rock, an enormous image of Buddha was carved in the side of the hill. As he lies he is 40 feet long, but he was never finished. The work was very nearly done, but not quite.\n\nTo the south-west of the dágaba, in the forest, is a stock of wedged pillars and coping stones. They lie where they were quarried, but they were never taken to their places. One long stone has a beaded edge cut with great care, but it was never used.\nIt is as plain as any written history could be. It is an instance of the true value of archaeology as a stimulus to the imagination. In what is now a solemn jungle there must have been a tragedy. Tantri-malai lies right in the track from Mannár to Anurádhapura; and it was at Mannár that the Tamil invaders used to land, and to Anurádhapura that they used to march.\n\nIt remains to find out the date of these great images. Mr. Parker places them, and indeed the whole of Tantri-malai, in the second or first century B.C., or at the latest in the first century A.D. Mr. Bell, Archaeological Commissioner, attributes them to the time of Parákrama Báhu the Great, in the twelfth century A.D. Fortune placed in my way the means of deciding this wide difference of opinion; for I found an inscription which seems to settle the point.\n\nOn a rock adjacent to that on which the dágaba and great images are, there are three buildings which by their more modern style and infinitely superior preservation palpably belong to a period quite distinct from that of the other ruins.\n\nOne is a square building on a rock, having a circumambient verandah of broad dressed slabs of stone; another is a chamber hewn from the rock and walled up in front with cut and dressed stone; and the third is a little box-like structure on the summit of the rock in which the cave is hewn. Its stonework resembles that in the cave below, and is neat work adorned by slight pilasters in relief. Mr. Bell in his Report appropriately calls it a \"campanile,\" adding its traditional name, Pot-gula, or \"library.\"\n\nThese three buildings are quite obviously of the same date and style. From the evidences of sudden cessation of work, never afterwards resumed, and especially from the half-cut steps, it may be confidently assumed that no important stone work was undertaken at Tantri-malai subsequent to the dispersal of the masons. The images cannot therefore be of earlier date than the three buildings just described, for these exhibit much skill in stone work, and the hewing out of a rock chamber with a cubical content of 1,170 ft. (22 ft. 7 in. by 8 ft. by 6 ft. 5½ in.) indicates that both time and labour were available. We can therefore roughly date the images\nfrom the campanile, &c. The images may be as old, but can be no older.\n\nNow on the stones of the campanile letters are to be found lightly traced by the point of a chisel. There is only one on any given stone, and in all I discovered nine of them cut, evidently to help the builder in placing the stones correctly.\n\nSINGLE LETTERS ON STONES OF THE \"POT-GULA.\"\n\nFrom their form the letters can be at once, and with certainty, ascribed to the latter half of the eleventh or to the twelfth century A.D. So that Mr. Bell's estimate* is entirely supported by first-rate evidence. And it may be assumed that these huge images, which in their style and colossal proportions so nearly resemble those at the \"Gal-viháre\" in Polonnaruwa, were commenced by Parákrama Báhu I., or at least in his reign. And perhaps in the raid of Kálínga Mágha, which followed soon after, they were abandoned, and Tantri-malai left to grow up in forest and to become a home of buffaloes and bears.\n\nIt is satisfactory to have archæological evidence regarding the date of these great stone figures; but even without it I think it would have been obvious that they could not belong to the simple times of early Buddhism. The idea of huge images was not entertained until several centuries after Christ. They in their way are fine, but it is not the way of the simple monks who lived in the early cave monasteries.\n\nBefore leaving this side of the archæology of Tantri-malai, it may be added that I found nothing to support Mr. Parker's\n\n* \"They manifestly belong to much the same period of lithic sculptured art as the five examples at Polonnaruwa.\"—Annual Report, A.S., 1891, p. 8.\ntheory that \"Upátissa Nuwara\" may have been near or at Tantri-malai.* Upátissa, the capital before the rise of Anurádhapura, must have been a large town, and I think that had it been here, we should certainly find some systematic water supply in use from the earliest times, instead of finding, as we do, that the first monastery was dependent upon the water-holes.\n\nSo far I have dwelt only upon the history of Tantri-malai as revealed by its archaeology; but there is another question which may be found interesting.\n\nIn three caves at Tantri-malai, in a cave at Billéwa, and in a cave at Ándiyá-gala, two places a couple of miles apart and some three miles respectively south and south-west of Tantri-malai, I found rude drawings or paintings on the walls and roof. In each case the cave in which the pictures are is one which has a drip-ledge cut and has certainly been used as part of a monastery; but the drawings are of a most primitive style, and certainly do not belong to the period of monastic occupation. The cave at Billéwa has an inscription cut in characters which may belong to the third or fourth century A.D.; the Ándiyá-gala cave has an inscription of the same or a little earlier date; while, as we have seen, Tantri-malai was occupied up to the end of the twelfth century A.D. The drawings are therefore comparatively modern.\n\nThe neighbourhood is almost entirely uninhabited, but the nearest villages on both the north and the south are occupied by Wanniyás. These people are called \"Verdar\" by their Tamil neighbours on the north and \"Veddó\" by the Sinhalese to south of them, the word in either case meaning the same. They admit that they are Veddás of the Dunna gat warigé, the \"clan of the bow,\" but they call themselves Vil Wanniyár. For they are bi-lingual, and speak both Tamil and Sinhalese impartially. They claim community of race with the Tamankaḍuwa Veddás, but say that their clan is a separate one.† Curiously enough they claim descent from the Súriya-waṇsa, the original royal stock of the Sinhalese.\n\n* \"Ancient Ceylon,\" page 245.\n† The Veddó of Tamankaḍuwa are of the Tala-warigé clan.—B., Ed. Sec.\nThey are nice, simple, honest people of the forest, rather shy at first, but willing when acquainted to tell one all their lore. It appears probable that the pictures in the caves are the work of their ancestors. However, the present people deny all knowledge of this, and say that no one draws like that now.\n\nI have copied to scale and in their correct colours all the pictures I found; but beyond this and a few remarks as to their appearance, I do not feel competent to discuss them.*\n\nIn the majority of cases the subject appears to be the human form; some hold bows in their hands, and one holds in his two hands what may be regarded either as a bow and an arrow or a sword and shield; others appear to be animals and birds, and a fine spotted leopard is among the best, though his head is unfortunately missing; other subjects are mere diagrams, and among these too are obviously bows and arrows, and one apparently the sun. All belong to the same school of art, though I should not expect to find them the work of a single person, owing to the various methods used to express the head. Several are almost spirited sketches, and obviously portray motion. A feature which distinguishes them from most scribblings of the same sort is their chastity and sexlessness. The colour principally used is ash gray, but in two instances black is found, and in three a dull red. All alike seem to have been painted with the artist's finger as a brush, and all are on the bare rock, not on plaster.\n\nMy hope in copying them was less that they would prove of great interest in themselves, than that they might aid in linking up this northern tribe of Veddás or Wanniyás with the others of their race.†\n\nI conclude with a few measurements taken with the idea of testing Mr. Parker's brick theory, and some comments thereon.\n\n* Appendix A.\n\n† The Archaeological Commissioner discovered and photographed Veddá \"ash pictures\" at Arangoda-gala and Konattegoda-gala near the Mádura-oya, during his circuit of 1897 through Tamankaduwa (Annual Report, A. S., 1897, p. 15). Similar drawings have since been found in Bintenna by Prof. C. J. Seligmann (Journ., C. A. S., Vol. XXI., No. 61, 1908, p. 77).—B., Ed. Sec.\nMr. Parker says of Tantri-malai:—\"The bricks of the dagaba are 3·23 in. thick and 9·04 in. wide, Bt. (breadth × thickness) being 29·2, and the length either 18 in., making the contents 525 cubic inches, or, if it was six times the thickness, 19·38 in., which would make the contents 565 cubic inches. In either case the size points to a time late in the second century, or early in the first century B.C.\"*\n\nAt the dagaba I measured the ten most perfect bricks I could secure, with the result tabulated below. Where I have put \" & + \" it means that the brick was broken, i.e., 10 × 3 × 8 & + means that the last measurement has an uncertain quantity greater than eight:\n\n| Brick Dimensions | Bt. |\n|------------------|-----|\n| 2\\(\\frac{3}{4}\\) in. × 7\\(\\frac{1}{4}\\) in. × 9\\(\\frac{1}{2}\\) in. | 3\\(\\frac{1}{4}\\) in. × 8\\(\\frac{1}{2}\\) in. × 10 in. & + |\n| 3\\(\\frac{1}{4}\\) in. × 8\\(\\frac{1}{2}\\) in. × 10\\(\\frac{1}{2}\\) in. & + | 2\\(\\frac{3}{4}\\) in. × 10\\(\\frac{3}{4}\\) in. × 12\\(\\frac{1}{2}\\) in. |\n| 1\\(\\frac{3}{4}\\) in. × 9\\(\\frac{1}{4}\\) in. × 7 in. & + | 2\\(\\frac{3}{4}\\) in. × 8\\(\\frac{1}{2}\\) in. × 10 in. |\n| 3 in. × 7\\(\\frac{1}{2}\\) in. × 9\\(\\frac{3}{4}\\) in. | 2\\(\\frac{3}{4}\\) in. × 9 in. × 9\\(\\frac{1}{2}\\) in. & + |\n| 3\\(\\frac{1}{4}\\) in. × 7\\(\\frac{1}{4}\\) in. × 11 in. | 3 in. × 8\\(\\frac{1}{2}\\) in. × 10\\(\\frac{1}{2}\\) in. |\n\n∴ Bt. = 24·22, and average thickness 2·85.\n\nFurther on, Mr. Parker writes: \"Colossal, sitting, and reposing statues of Buddha cut out of the solid rock, at which the bricks are of pre-Christian date or the first century A.D.,\" &c.\n\nAt the sedent Buddha a well-preserved wall enables one to measure a large number of bricks easily. Eight widths were 9 in., 9 in., 9 in., 9\\(\\frac{1}{2}\\) in., 10\\(\\frac{1}{2}\\) in., 11 in., 11\\(\\frac{1}{2}\\) in., averaging 9·81 in.; eight lengths were 5\\(\\frac{1}{2}\\) in., 5\\(\\frac{1}{2}\\) in., 6 in., 6 in., 6 in., 6\\(\\frac{1}{2}\\) in., 6\\(\\frac{1}{2}\\) in., 6\\(\\frac{1}{2}\\) in., averaging 6·06 in.\n\nThe average thickness of 30 bricks was 2\\(\\frac{1}{2}\\) in. Bt. thus is 15·15, and average cubic contents 148·62. On referring to Mr. Parker's Table of Measured Bricks† I find that their size would render these bricks liable to be included in those of 800–1350 A.D.\n\nThere is no brickwork near the recumbent Buddha which yields such sure results, and I only succeeded in finding two fragments worth measuring: these were respectively 2\\(\\frac{1}{2}\\) in.\n\n* \"Ancient Ceylon,\" pp. 244, 245. † Loc. cit., p. 673.\nby $8\\frac{1}{2}$ in. by (?) and $2\\frac{1}{4}$ in. by 9 in. by (?). It is possible that they were brought in recent times from the dagaba to serve as stands for joss sticks, and in any case their evidence is not enough to go upon.\n\nI have given these measurements at somewhat tedious length, because they are part of my foundations for a disbelief. They are not the whole of the foundations, for I have measured bricks before, and generally only to find that their variation rendered them insecure evidence upon which to found theories.\n\nWith all respect to an accomplished archaeologist, I venture to predict that Mr. Parker's \"Table of Measured Bricks\"—what is ordinarily called Mr. Parker's \"brick theory\"—will never supply a really reliable criterion of the antiquity of ruins. The measurements given above show how two independent people could obtain quite different results from the same material, and I believe that in many other places we should find as great a divergence. Beyond the fact that old bricks are large and newer bricks smaller, I do not believe the ancient Sinhalese had so standardized their brick-making that any measurements based upon the assumption of such a standard are reliable in giving a date even approximately; though as secondary and corroborative evidence such measurements may be valuable.\n\nOne other observation in the neighbourhood of Tantri-malai bears upon the same brick theory, though in itself it is epigraphical in nature.\n\nOn page 211 of \"Ancient Ceylon\" Mr. Parker, in giving a list of the data from which his brick theory was, built up, says: \"The list of structures of various periods will probably be accepted as belonging to the dates here assigned.\" But to one of these I am unable to agree. No. 8 is given as an inscription in a cave at Milléwa-gala Vihare near Tantri-malai, \"in letters of the first or second century A.D.\" which Mr. Parker ascribes to Ila-Nága or one of the earlier Nágas of the second century. The same inscription was copied by Mr. Bell in 1896, and by me in 1909; all three readings are the same, and there is no question of identity. The name in the inscription is Na ka ra ja. The writing is identical with that used in Mahá Séna's inscriptions of the end of the third\nand beginning of the fourth century A.D., and in these he is variously called Senanaka and Naka. So, if my view of this can be accepted, we get third-fourth for first-second century. In other caves at Billéwa* there are inscriptions of various dates. They can only be judged by the form of the script; but two appear to belong to a period at least as early as the first century B.C. So we have in one place lithic records covering a period of about 400 years. If I am correct in this it must greatly detract from the value of the bricks as data. We have no means of judging to which part of this 400 years they belong, save by their own intrinsic characteristics; but as they are given as data this would be mere moving in a circle.\n\nIt is with reluctance that I disbelieve a theory so well calculated to solve many of Ceylon's archaeological puzzles; but I am convinced that brick measurements as criteria of dates must be accepted with the greatest caution.†\n\nAPPENDIX A.\n\nPAINTINGS FOUND IN CAVES.\n\nPlate I.—A: Group consisting of the sun and three figures, two human and the third doubtful, from the roof of a small cave at Tantri-malai. B: Group of animals or birds and two human figures, apparently of an adult and a child, from a large cave at Tantri-malai.\n\nPlate II.—Group from the same cave. The central figure is a leopard with red and black spots; the figure standing behind it is\n\n* Mr. Bell (Archl. Report, 1896) calls it Billéwa, and so it sounded to me; Mr. Parker calls it Milléwa; but we all mean the same place.\n\n† Mr. Still's view is supported by the Archaeological Commissioner. After many years' examination of brick ruins of all ages, mostly in the North-Central Province, Mr. Bell has had reluctantly to abandon \"the brick theory,\" except to the very limited degree of the broad generalization, arrived at by Mr. Still independently, that \"old bricks are large and newer bricks smaller.\" All bricks of 18 in. in length and upwards indubitably belong, with extremely rare exceptions, to an early period.—B., Ed. Sec.\na man wearing red armlets. The right hand figure appears to be a man standing by some animal, perhaps a bear. The small figure at the bottom is painted in red.\n\nPlate III.—A: Bow and arrow, from a large cave at Tantri-malai. B: Talagoya (?), from a large cave at Tantri-malai. C and D: Human figures, from a large cave at Tantri-malai. E: Human figure and the moon, from a large cave at Tantri-malai. F: Apparently two human figures in a house, from a large cave at Tantri-malai.\n\nPlate IV.—Figures from the same cave. Two human, the rest doubtful.\n\nPlate V.—Curious diagrams from a cave adjoining the last. One might represent a human being standing in the mouth of a cave.\n\nPlate VI.—In the same cave. Further diagrams: Two armed figures carrying bows; large bow and arrow. This is the clan mark of the local Waṇṇi people, and is branded upon their cattle.\n\nPlate VII.—A: A man with bow and arrow, from Āndiyā-gala. B: Sun, from Āndiyā-gala. C: Talagoya (?), from Āndiyā-gala. D: Two human figures in a house, from Billēwa. E: Human figure, from Billēwa.\n\nPlate VIII.—Group of figures from Billēwa. Sambhur on the right; in the centre a peacock, with something above it; human figure low down on the left. The other diagram is unintelligible.\n\nJOHN STILL.\n\nAPPENDIX B.\n\nINSCRIPTIONS AT TANTRI-MALAI.\n\nWith all due deference I find myself unable to accept Mr. Still's reading of the three inscriptions, quoted in his Paper.\n\nInscription (1).\n\n\"Ba ra ta pi ḍa ha ti sa te ra ha.\"\n\nMr. Still says:—\"Baratapida may be a name; in which case the record would read '(that which) belongs to Baratapida and the monk Tisa'; or Barata may be a name, and piḍa perhaps derived from pudanavā, to offer.\"\n\nThis is hardly correct. Evidently the difference between the hard ḍ (ḍ) and the soft d (ḍ) did not occur to Mr. Still, or he would not have derived piḍa (ḍa) from pudanavā (पुदनवा).*\n\nPiḍa is from \"pinda,\" a lump, and pudanavā from puḍ, to worship.\n\nMy rendering of the inscription is: \"belongs to the monk Tissa of (the family of) Baratapiḍa.\"\n\n* Yet chada in Inscription (3) is held to be chada. Confusion of dentals and cerebrals is not unknown in ancient inscriptions.—B., Ed. Sec.\nCave Paintings.\n\n\\(\\frac{1}{8}\\)th actual size.\nCave Paintings.\n\n\\(\\frac{1}{8}\\)th actual size.\nTANTRI-MALAI.\n\nPlate V.\n\nCave Paintings.\n\n½th actual size.\nANDIYA-GALA.\n\nPlate VII.\n\nA. B. C.\n\nBILLEWA.\n\nD. E.\n\nCave Paintings,\n½th actual size.\nCave Paintings.\n\n\\(\\frac{1}{8}\\)th actual size.\nInscription (2).\n\n\"A ti a ji ri ya ba ti ya ma ta u pa si ka na ga ya.\"\n\nWith regard to this inscription Mr. Still says:—\"The earlier part of it is beyond me, but from the latter half it is plain that the cave was once the abode of a lady named Nága, who had devoted herself to religion.\"\n\nThis interpretation cannot be maintained, as the term \"upásiká\" is not applied to a devotee living in a cave or a forest. Such a person is called \"tapas.\"\n\nI would read the inscription as: \"a gift of the Upásiká Nága, the mother of Bati (Bhati), the master of elephants.\"\n\nInscription (3).\n\n\"Ba ta su ma na ha ta la cha da.\"\n\nOf this, Mr. Still says:—\"Bata Sumana may be taken equally to mean 'Brother Sumana,' or to be a single name; but what his talachada may have been I am not able to explain; tala could possibly be read talé, which means the blade of any sharp instrument, and the record may be simply that Bata Sumana cut his name.\"\n\nThis explanation seems rather far fetched. The inscription, in my opinion, simply means: \"the shelter of Batasumana.\" Tala means \"place\" and chada (from chad) \"shelter,\" \"cover,\" \"shade,\" &c.\n\nMarch 8, 1910.\n\nSimon de Silva.\n\n[In order to render Mr. Still's Paper as full and interesting as possible, Mr. H. C. P. Bell, Archaeological Commissioner, has furnished copies of entries recorded by successive Government officials in their Diaries after visiting Tantri-malai.*\n\nSupplementary notes made by Mr. Bell,† with illustrations from photographs taken by himself in 1896, and drawings of the \"Pot-gula\" and Cave Shrine, are also added.]\n\nAPPENDIX C.\n\nACCOUNTS OF TANTRI-MALAI.\n\nI.\n\nThe rocks, or rather series of bare granite hills, at Tantri-malai are well worth inspection. The naked granite lies in a black mass of undulating hills of solid rock, with plots of shallow grass in the depressions of the undulations, the whole rock mass covering about a square mile.\n\n* Appendix C. † Appendix D.\nOn the highest point of the rock are the remains of a dagaba with a bo-tree planted in earth brought up from the jungle below; and on opposite sides of the rock on which the dagaba stands are two enormous rock statues of Buddha.\n\nOne is in the sitting posture, nearly 6 ft. high, with two women, one on each side, fanning the deity with \"yak tail\" fans; on each side of the statue is a woman with one of these fans, below that a lion on each side, and below that again a dragon on each side. The statue is cut more than 2 ft. into the living rock, and the face of the carving bears traces of the cement on which the colours of paint were laid on the statues, as at Anuradhapura.\n\nOpposite this statue are a flight of steps cut in the rock, and between the statue and steps the remains of temple.\n\nOn the other side of this stone hill is the other statue, in the usual \"nirvana\" attitude, but of enormous proportion. It is 45 ft. long by nearly 15 ft. deep across the arms and chest, and the whole is cut 5 or 6 ft. deep into the solid rock. The nose has been broken off and lies beside the statue. It is about 18 in. long, and it was with difficulty I could lift it in both hands. The tradition amongst the people is that the wild bees incessantly make their combs in the nostrils, and that the Veddás in the neighbourhood as incessantly eat the honey.\n\nBoth statues are still very perfect.\n\nOn a smaller stone hill near the one described above stands a small square stone temple made of rectangular stone, with only 5 or 6 cubic feet space inside and with a small door facing the east.\n\nThe appearance of the upheaved mass of undulating rock covering nearly a square mile is very striking.—Diary, July 15, 1883.\n\nS. Haughton,\nAssistant Government Agent,\nMannár.\n\nII.\n\nAt Tantri-malai there are a series of huge granite rocks. On one of the highest there is a trig station. Mihintale and other Anuradhapura hills are plainly visible—also another trig station on Mullamalai, and one overlooks low-country all round as far as the eye can reach, except on the south-west, which is higher ground.\n\nThere is here a well-cut and preserved reclining figure of Buddha, which I made out to be 38 ft. long, cut in the face of the granite rock, which seems to have been split for the purpose of giving a flat perpendicular surface.\n\nOn the top of a rock further off is a bo-tree, I think—a ficus at any rate—and below it another figure of Buddha in a sitting posture cut in the face of the rock. Stone pillars, some standing,\nothers fallen, once supported a roof over the path leading to the figure. The sitting figure is cut in a recess hewn out of the rock. On either side of the sage are figures of gods or demi-gods fanning him. There are cut figures on either side of the recess, and stone steps leading up to the bō-tree.\n\nOn another, almost inaccessible, rock at a little distance, is a square building of cut stone, and in the base of the rock is an artificial cave in which a priest has lately been spending a \"retreat\" of three months. The cave is now uninhabited except by bats, and I wonder how the priest could have stood the stench.—Diary, April 20, 1886.\n\nW. J. S. Boake,\nAssistant Government Agent,\nMannár.\n\n---\n\nIII.\n\nTo Tantri-malai and back to Olukkulama, 16 miles. I went to this place in order to make a few measurements, as requested by a marginal note on my Diary of April 20, and also to make a few sketches; but was rather put out of conceit with the expedition on hearing from Mr. Ievers that a Capt. Hogg had already been there and taken photographs, which he had sent to the Governor, who had passed them on to the Asiatic Society.* However, I am glad I went, and it may be that I have noted some little thing which has escaped previous observers.\n\nI have been trying to fix the position of the place on Ferguson's map, which is the only one I have with me; but I cannot find any place on the map nearer to it than Olukkulama, which is somewhere about the 38th mile on the Mannár road.\n\nIt lies in a south-westerly direction from Olukkulama, and one passes by Kappachi of the Vavúmiyá district across the Aruvi-ár through the Veddá village of Nochhikulama of the North-Central Province, and by the base of the Mullamallai rocks.\n\nAt Tantri-malai went first to the cave below the rock. The cave was cleaned out and there were some mats and chatties, but the priest was said to have gone to Anurádhapura. The cave I did not measure the dimensions of; but the entrance is blocked up by a mud wall leaving just room for a man to squeeze in. Within, it is about 10 ft. by 6 ft., and there is standing room. It is cut about half way up the rock, and the distance from the base of the cave to the top of the building on the rock is 34 ft. measured over the surface of the rock.\n\nOpposite to the entrance to the cave, which was formerly of cut stone and having a porch, there is another rock of much greater dimensions, and on the slope of it is constructed a raised\n\n* Capt. Hogg, R. E., photographed the sedent and prone Buddhas Nos. 23, 24, 25), in the seventies.—B., Ed. Sec.\nplatform paved with slabs of rock, some of which measured 10 ft. 10 in. by 3 ft. 3 in. thick—some of them *in situ*. The platform is about 20 ft. square.\n\nI then went to the sitting Buddha, which is excavated out of the solid rock near the top of the highest rock in the place. The sitting portion of the figure is obscured by bricks and stones. I took a sketch from the steps leading to the dágaba on the top of the rock.\n\nWhat the height of this rock is I do not know, but I should judge it to be from 150 to 200 ft. to the top from the level out of which it rises.\n\nThe dágaba is a small one, and the bó-tree seems to be growing in it.\n\nThe full length figure is exactly 40 ft. long, and I regret to say that the right arm is broken off. The nose, of which the nostrils are fully carved, came off some years ago.—*Diary, August 23, 1886.*\n\nW. J. S. Boake,\nAssistant Government Agent,\nMannár.\n\n---\n\nIV.\n\nI went to Kappachi in the morning, and, after inspecting the village and tank, on to Tantri-malai in the Anurádhapura District.\n\nHere there are some very interesting ruins; two Buddhas carved in high relief out of the solid rock, and a curious little stone house on the top of a rock very similar, though on a smaller scale, to one at Dondra in the Southern Province.*—*Diary, September 23, 1886.*\n\nG. M. Fowler,\nAssistant Government Agent,\nVavúniya.\n\n---\n\nV.\n\nWent to inspect the ruins at Tantri-malai. They consist of a group of rocks covering a space of about 60 acres as far as I can see. Fine grassy glades separate some of the larger rocks. The place must have been the abode of Buddhist priests, for ruins of *pansalas* are to be found.\n\nThere is a most picturesque little square block-house on the top of a conical rock about 30 ft. high. The little house is built of cut stones laid one on top of the other, one stone running the whole\n\n* The Dondra ruin, built on high ground, differs. It was once the penetrale, or inner shrine, of a Hindu Déválé.—B., *Ed. Sec.*\nlength of the building. The roof is flat, and is similarly made of cut stones. Cornices of carved stone project on the outside edge. There is a tradition that ancient manuscripts were kept in this \"book house\" (S. Poi-gé), and a copy of a portion of the Mahá-wansá is said to have been found in it about a hundred years ago.\n\nAt the base of the rock and immediately below the \"book house\" is an oblong chamber, 11½ ft. long, cut into the solid rock to a depth of 7½ ft. It is not a chamber built up on the slope of a rock, as is usually found, but is cut square into solid rock. The front must have been closed in by cut stones, part of which still remain in position.\n\nThe remains of an old palace [sic] similar to those at Anurádhapura are to be found on the rock on the opposite side to this chamber.\n\nOn the slope of another rock is the recumbent figure of Buddha carved out of the solid rock, standing out slightly; and scattered about are pillars, &c. There is also an old bó-tree surrounded by a very old dry stone wall.\n\nI had to give up further exploration on account of heavy rain.\n\nFour holes in rock above chamber to let beams in, pillars, &c., showing that there was a room in front of the chamber. The size of the book house is, height 5 ft., 5 ft. broad, and 5 ft. long, by rough measurement.\n\nA Buddhist priest from the Seven Kóralés, Kurumégala District, came and asked for permission to occupy and improve Tantri-malai, as pilgrims were in the habit of going there, and that he wished to restore the place with the aid of alms and contribution.\n\nHe said he had a book in his village containing a full description of Tantri-malai. He described it as an old history of the place. It stated that the stone chamber on top of the rock was a \"book house,\" and that it was rifled of its contents during the time of the Dutch.\n\nAsked the priest to produce the history, and said that I would recommend to Government the granting of the rocks to him, provided he gave some guarantee that he would restore the place.—Diary, December 18. 1889.\n\nC. A. Murray,\nGovernment Agent,\nNorth-Central Province.\n\nVI.\n\nThe Tantri-malai ruins have been described by Mr. Haughton in his Diary of July, 1883, but his description of the sitting Buddha and surrounding figures is not quite right.\n\nThe \"guardians\" on each side of the central figure are on a level with its shoulders, and underneath each of them is a makara (mythical animal composed out of a crocodile, an elephant,\nand a peacock); underneath each makara is a lion rampant with face turned away from the figure. Mr. Haughton puts the \"dragons\" under the lions.\n\nThe figure is cut in a recess in the face of the rock, and as the face slopes away towards the top the recess is much deeper at the bottom than at the top. It is about 5 ft. deep at the bottom and about a foot or so at the top. It is about 9 ft. long by 8 ft. in height. The figures being protected in this way from the weather are in an excellent state of preservation—as good as new, in fact. The head of Buddha is surrounded at the back by a cobra's hood.*\n\nThere are pillars in front of the recess, and holes in the rock where the beams of the roof evidently rested, showing that originally there was a temple built up against the rock, with the face of the rock containing the recess to form its back wall.\n\nOn the right of the recess, i.e., on the right hand side of the figure, are two similar figures of Buddha [sic] about half the size, also cut in the rock, but not recessed. One of these is so obliterated by exposure to weather as to be hardly distinguishable as a Buddha.† Mr. Haughton does not mention these figures. Over the recess are three lines cut in the rock, to carry away the rain water I suppose.\n\nIn the side of the large rock surmounted by the small house (described by Mr. Fowler in his Diary of September 23, 1886) there is a rectangular chamber cut out of the rock (about 8 ft. long by 6 deep and 6 high, as well as I remember). This I found occupied by a Buddhist priest and his servant, a deaf and dumb man, who have lately established themselves here.—Diary, November 22, 1890.\n\nJ. P. Lewis,\nAssistant Government Agent,\nVavúniya.\n\nVII.\n\nGot to Tantri-malai in the evening and had a look round the ruins.\n\nThere is very little forest of any value on the country between the Arippu road and this. One forest about three miles long on each side of Tambiyáwa has satin and palu, but to no great extent. The country was excessively dry until we reached Tantri-malai, where it had rained recently and rock holes were full of good water.\n\n* In reality a plain circular nimbus, similar to that behind the head of the sedent Buddha in the Cave Shrine at \"Gal Viháre,\" Polonnaruwa.—B., Ed. Sec.\n\n† The figures are not Buddhas, and are cut in panelled recesses.—B., Ed. Sec.\nMr. Ridout and I visited the ruins, some of which he measured.* They have several times been described. I had never been here before, and I must confess to disappointment.—Diary, September 24, 1891.\n\nR. W. IEVERS,\nGovernment Agent, North-Central Province.\n\nVIII.\n\nThe ruins at Tantri-malai are well worth visiting. The sedent Buddha with a guardian on either side and lions below are a beautiful piece of carving, and should be photographed. The recumbent Buddha has been much damaged about the face and right arm.\n\nThe nice little square stone room on top of the rock, said to be a \"Pot-gula,\" is very curious, and in good preservation. I have never seen a similar one. It looks modern from a distance.\n\nI have ordered the bund of the tank to be restored, and then there will be water at Tantri-malai, which will be a boon to travellers.—Letter, July 24, 1896.\n\nE. M. BYRDE,\nGovernment Agent, North-Central Province.\n\nIX.\n\nAt Tantri-malai.† North-east monsoon breaks; heavy rain every afternoon. Engaged during the fine mornings in excavating the lower part and sinhasana of the sedent Buddha (ot-pilimaya), clearing the colossal prone image (seta pilimaya), both rock carved. Took measurements, notes, and photographs.\n\nTantri-malai is an enormous reach of flattish rock, stretching far and wide. Near the edge of a gal-wala is a single line inscription—the only record yet discovered here. The stone-carved images recall, and may be contemporary with, the \"Gal Vihare\" at Polonnaruwa.\n\nThe main points of interest are:—\n\n(i.) \"Pot-gula\" (so-called), and Cave beneath.\n(ii.) Sedent image on ornamented asanaya with makara torana behind, all rock carved.\n(iii.) Dágaba.\n(iv.) Recumbent image of Buddha, hewn from the rock.\n\n* Mr. Ridout's drawing of the \"Pot-gula\" is reproduced on Plate A.—B., Ed. Sec.\n† Notices of Tantri-malai occur in the Official Diaries of Messrs. S. Haughton (1883); W. J. S. Boake (1886); G. W. Fowler (1886); C. A. Murray (1889); J. P. Lewis (1890); R. W. Ievers (1891).\n(i.) \"Pot-gula.\"\n\nMr. C. A. Murray's description is concise:\n\n\"A most picturesque little square block-house on the top of a conical rock about 30 ft. high. The little house is built of cut stones laid one on top of the other. The roof is flat, and is similarly made of cut stone. Cornices of carved stone project on the outside edge.\" It has one entrance.\n\nThere is a tradition that ancient manuscripts were kept in the house, hence its name \"Pot-gula.\"\n\nBelow the \"Pot-gula\" (6 ft. 2 in. by 5 ft. 4 in. high)* is an oblong chamber cut into the solid rock (measuring 12 ft. 6 in. by 7 ft. 6 in. by 6 ft. in height)* with remains of dressed stones, which closed in the front. This might have been the true \"Library,\" the campanile on the crest of the rock being intended for some other purpose. Owing to its confined inner space (3 ft. 2 in. by 4 ft. 10 in.)* it could admit only one person seated.\n\nOpposite the \"Pot-gula\" on a larger rock is the square basement of some building formed of large dressed slabs.\n\n(ii.) Sedent Buddha.\n\nThe image with its moulded sinhásana (throne with dado of lions) is cut in high \"sunk relief\" from the steep side of the rock undulation. The figure is 8 ft. in height; its ásana 3 ft. 3 in. high by 9 ft. in length, and 5 ft. 6 in. in depth.* At the back is conventionally represented part of a well conceived makara torana, with rampant lion supporters, facing outwards on either side; and, above, a couple of chámara bearers.\n\nThe execution of the whole falls short of the finish and magnitude of the not dissimilar ot-pilimaya at the \"Gal Viháré,\" Polonnaruwa.\n\n(iii.) Dágaba.\n\nOn the highest point of the Tantri-malai rocks is a small dágaba dwarfed by its surroundings.\n\n(iv.) Recumbent Buddha.\n\nBeyond the dágaba (which stands between it and the sedent Buddha) is carved a colossal full length figure. The image measures 38 ft. from head to feet.* It has scaled badly from exposure to the elements. The right arm and nose are broken; and altogether the figure is in a sorry condition as compared with the seta pilima of Polonnaruwa, which is exceptionally perfect.\n\nNo rock record is known fixing the name and age of the Tantri-malai ruins, but they manifestly belong to much the same period of lithic sculptured art as the fine examples at Polonnaruwa.—Diary, September 30 to October 5.†\n\nH. C. P. Bell,\nArchæological Commissioner.\n\n* For revised measurements see Appendix D.—B., Ed. Sec.\n† Archæological Survey, Annual Report, 1896, pp. 7, 8.\nAPPENDIX D.\n\nADDITIONAL ARCHAEOLOGICAL NOTES.\n\nTANTRI-MALAI.\n\n1.—“Pot-gula.”*\n\nThis box-like campanile—probably a “meditation cell”—constructed, sides and roof, of eight courses of clean-hewn granite slabs, stands on the summit of a bowl-shaped upheaval of the Tantri-malai rock outcrop.\n\nIts stones are dry laid and plain dressed, except at the four corners, which are cantoned by simple narrow pilasters with bracket heads.\n\nThe vertical walls are crowned by a heavy (1 ft. 6 in.) projecting cornice of double cyma and rectangular moulding, finished by a straight blocking course (5 ft. 9 in. square). Roof slabs horizontally trabeated. Within, the walls slide into the flat roof by a chamfer and fillet.\n\nMeasurements:—Plan, dimensions 6 ft. 2 in. square (outside), 3 ft. 2 in. (inside); height, 5 ft. 2 in. to 5 ft. 8 in. (outside) according to level of rock base, 3 ft. 7 in. to 4 ft. (inside); entrance, 2 ft. 4 in. wide.\n\n2.—Cave Shrine.†\n\nCut into the bottom of the rounded rock, upon which the “Pot-gula” was erected.\n\nMeasurements:—Inside, 12 ft. 10 in. broad by 8 ft. 6 in. deep at present floor level (silted up), but 6 ft. 10 in. at horizontal roof; height, 6 ft. 2 in. at entrance, 6 ft. 10 in. within.\n\nA gal-āsanaya, or stone seat, at the back of the cave, is barely visible above the accumulation of bats’ deposit which has gradually buried it.\n\nThe entrance (3 ft. 9 in. in width), on the north, is at the middle of the front wall of cut stone (1 ft. 6 in. thick), which stretched 7 ft. to either side of the doorway. This wall is now only 4 ft. in height.\n\nAbove the brow of the cave, below a katārē, or drip line, are cut four mortices, which once took the ends of roof beams.\n\nOutside the wall a single complete pillar (with semi-octagonal shaft) and one or two stumps show that a vestibule formerly preceded the cave.\n\n3.—Sedent Buddha.‡\n\nThe Archaeological Commissioner, in October, 1896, found the small brick-walled shrine in front of the sculptured image and its accessories choked with débris, which hid everything up to the Buddha’s waist. The shrine itself was freed of brick and earth; but time and weather did not then permit of thorough excavation of the walls outside and along the base of the rock to left and right, or of other desirable digging at Tantri-malai.\n\n* See Plates A and C. † See Plates B and C. ‡ See Plates D and E.\nThe ot-pilimaya, or seated image, its ásanaya, and \"supporters\" are all carved from the rock matrix in a sharp-sided recess (11 ft. 5 in. high by 9 ft. 3 in. broad, with a depth of 6 ft. at the bottom, and only 2 ft. 10 in. at top) cut into a northern shelving face of the rock plateau at one of its steeper, but not very deep, undulations.\n\nAs the top edge of the ásanaya touches the rock's sloping surface, only its front is shown, no space having been left on either hand to carry the carving round so as to exhibit its sides. In breadth 9 ft. 3 in., it rises 3 ft. 3 in. above the rock floor.\n\nThe lines of the moulding are the familiar ogee plinth, block between fillets, and cyma coping. The central dado (1 ft. deep) is divided into five panels by four pilasters having spreading base and capital. Conventional lions of the homely \"china-dog with frilled-mane\" type, seated cat-like fronting (sejant guardant), occupy the three middle panels, and a profile lion, turned outward (passant guardant), each of those at the end.\n\nThe Buddha, sculptured in three quarter round, is seated well back (2 ft.) on his throne. The figure is represented in the posture almost universally adopted in Ceylon—the dhyána mûdra, or attitude of meditation—crossed-legged (the right foot and ankle above the left, soles upwards), and hands with open palms laid on the lap similarly. The robe (saṅgala sivura) droops from the left shoulder, hiding the left arm, but exposing the right breast and arm.\n\nAn oval face, thick fleshy lips, pendent ears (no longer weighted with the rings of royalty), and sleepy half-closed eyes give to the countenance a sleek expressionless look.\n\nA sirespota, or \"glory,\" crowns the ushnishika (skull protuberance) above the stiff hair curls of the head, which is backed by a plain raised circular bhámandala or halo.\n\nThe intention was doubtless to cut behind the figure a torana of uprights and cross bars like that at the Cave Shrine of \"Gal Viháré,\" Polonnaruwa; but, beyond the completion of the pair of makara heads (with trunks coiled) which would have terminated the ends of the uppermost transons, none of the carving of the arch was executed.\n\nAt the \"Gal Viháré\" the sedent Buddha is not only flanked (as at Tantri-malai) by a pair of rampant lions, but \"supported\" on either side by an attendant bearing a chámara, or fly whisk, with two gods (Bráhma and Vishnu) of the Hindú Trimurti above the torana and sésata overhead. Here exigences of space forced the sculptors to compress the four anthropomorphic figures into two, supplanting the déviyó by the chouri holders (coiffured in turbans instead of mukūta head gear) and to forego the chatra altogether.\n\nMeasurements:—Buddha, height (exclusive of the sirespota, 8 in.) from ushnishika to thighs, 7 ft. 6 in.; from knees to rock at back, 3 ft. 9 in.; across shoulders, 4 ft. 4 in.; waist, 2 ft. 1 in.; elbow to elbow, 4 ft. 9 in.; across knees, 7 ft. 7 in.; head, 8 ft. 8 in. by 1 ft. 6 in.; ears, 1 ft. 4 in. long; hand, 2 ft. 1 in.; foot, 2 ft. 2 in.\n\nThe rampant sinhayó (3 ft. 9 in. high) of the Indian yáli, or horned variety, are represented in profile, addorsed, facing to\nright and left, and half bearing on their own the makara heads. They stand 9 in. above the āsanaya.\n\nEach chāmara kāraya (2 ft. 11 in. in height) is heavily, but differently, adorned with a variety of ornaments; both wear the upavīta, or Brāhmanical cord.\n\nSome 6 ft. on either side of the recess containing the Buddha are incised—more or less shallowly—four oblong panels from 3 to 4 ft. in size. The three outer panels on the right are merely outlined; as are the two towards the left end. But in the first and second panels respectively the carving of a figure in relief has been begun, though it is barely \"boasted out.\" The first panel on the left alone holds a figure, roughly finished, seated cross-legged, with hands in lap like the Buddha, but differentiated by its mukuta, or tall-peaked head dress.\n\nPerhaps the intention was to delineate eight Bodhisatrayō.\n\nFrom the one, central, entrance to the shrine of the Buddha (no longer roofed) there is gradual ascent by a couple of steps succeeded by two flights of nine, separated by short landings—all of easy going, with low risers and very broad tread. These stairs, 8 ft. 6 in. in breadth, are cut crisply in the galpota, or rock outcrop, and lead up towards the dāgaba situated on its summit. Sockets at the half-way landing betoken a former pillared and roofed portico.\n\n4.—Recumbent Buddha.*\n\nThe gigantic sēta pilimaya is sculptured at a brow of the plateau below the dāgaba, also facing north. It represents the Mahāparinibbāna of Gautama Buddha, and was manifestly intended to be a close replica of the colossal recumbent image of the \"Gal Vihārē,\" Polonnaruwa.\n\nThe carving of the head, forearm, and bolster which underlies them, was never quite finished. Further, the head and left bent forearm have been deliberately damaged, and the features of the face are now indistinguishable.\n\nThe whole length of the recess in which the figure lies is 40 ft. 8 in.; but the image itself, finished with a sirespota,† would not measure more than 38 ft. 4 in., or simply from the ushnishika to the soles of the feet only 36 ft.\n\nThe figure is shown in the orthodox pose. It lies on its right side, with head supported upon the right hand, both resting on a bolster. The left arm and hand, with extended fingers, lie flat along the side, whilst the feet are stiffly placed one upon the other. All but the right breast and hand is covered by the upper robe; the under robe (andana sivura) is just seen exposed at the ankles.\n\nMeasurements:—Head, 5 ft. 2 in. across; ear, 3 ft. 10 in. by 10 in.; height, left shoulder to right forearm, 10 ft. 10 in.; height at thigh, 7 ft. 3 in.; left arm, 13 ft. 3 in.; hand, 5 ft. 3 in. by 1 ft. 6 in.; foot, 2 ft. 8 in. broad.\n\n* See Plate F.\n\n† Capt. Hogg's photograph (No. 25) shows the sirespota or flame process. It is now virtually obliterated.\nThat monarch's inscription and the testimony of the Maháwaṇa prove that the images of the \"Gal Viháré\" at Pojomaruwa were undoubtedly executed by Parákrama Báhu the Great (A.D. 1164–1197).\n\nThe rock-sculptured figures at Tantri-malai were also almost certainly carved, if not by the same ruler, at least by Niṣṣanka Malla (A.D. 1198–1207), his only worthy successor prior to the subjugation of the Island by the Southern Indian invaders under Mágha, which followed within a few years.\n\nThat sudden inroad, and the chaos that ensued, probably prevented the completion of the images, &c., and brought about the final abandonment of Tantri-malai as a Buddhist monastery.\n\nH. C. P. BELL,\nArchæological Commissioner.\n\n8. The Ven. the Archdeacon, Messrs. B. Horsburgh, P. E. Morgappah, and Rev. Suriyagoda Sumangala took part in the discussion which followed the reading of the Paper.\n\n9. Mr. B. Horsburgh said:—Having had the advantage of a visit to Tantri-malai in the company of Mr. Still, I can testify to the fidelity and carefulness of his description of that most interesting place; and, so far as my knowledge goes, I would also subscribe to the general correctness of the conclusions he has drawn from the silent eloquence of the rocks.\n\nThe evidence of some sudden and overwhelming disaster falling upon the little community while it was engaged in beautifying the settlement by the rock carvings of the two Buddhas and the flight of steps to the dágaba is most direct and impressive.\n\nI make no pretensions whatever to archæological knowledge, but it seems to me that in the name itself there is some confirmation of Mr. Still's theory, that the disaster was due to a raid of Tamil invaders. The name appears to be partly Sinhalese and partly Tamil. The \"malai\" can, I think, only be the Tamil word meaning \"hill,\" while the \"Tantri\" is distinctly Sinhalese in form, and is found in the existing gé name of Tantrigé or Tantrigamagé. I know of no Tamil word at all like it.\n\nAbout 2½ miles E.N.E. of Tantri-malai is a small group of rocky hills, much higher than Tantri-malai, which bears the name of Mulli-malai, an entirely Tamil name. We had not time to explore this Mulli-malai further than by climbing to one of its highest points, but we saw no signs of general religious occupation, such as are so much in evidence at Tantri-malai.\n\nTantri-malai was, therefore, the chief settlement, and the invaders would probably know its Sinhalese name, whereas they had to invent one for Mulli-malai.\n\nWe approached Tantri-malai from the east, crossing the Mal-watu-oya to Mulli-malai, and then taking a compass line through the forest to Tantri-malai, a route probably followed by no other white man, and it was interesting, in view of what Mr. Still\nPlate A\n\nTANTRI-MALAI\n\"PO-T-GULA\"\n\nHALF ELEVATION AND SECTION.\n\nPLAN.\n\nScale, 4 Feet to an Inch\nTANTRI-MALAI CAVE\n\nCROSS SECTION.\n\nPLAN.\n\nScale, 8 Feet to an Inch.\n\nPlate B\nsays regarding the position of Tantri-malai between Mannár and Anurádhapura, to find in traversing a gorge between two spurs of Mulli-malai distinct traces of a paved road, which may well be a portion of the ancient track.\n\nMr. Still’s notes on the \"Wanni minissu,\" who are, of course, Veddás, are very interesting. I have seen the drawings he describes, but can offer no explanation of them. They are such as might have been made by a hunting party held up in the caves for a few days in idleness owing to heavy rain, or—and the fact that their descendants deny all knowledge of them is significant—they may have some religious or ceremonial meaning, because, when visiting the nearest village of these people to Tantri-malai, we observed some cattle in the field branded with the identical bow and arrow that is drawn in the caves. I am, however, quite incompetent to say if totemism has anything to do with it.\n\n10. The Ven. the Archdeacon proposed a vote of thanks to Mr. Still for his interesting Paper.\n\nMr. Horsburgh seconded.—Carried.\n\n11. The Chairman said he was sorry Mr. Still was not there that night, but that he would be very pleased to convey to him the vote of thanks which had been proposed. They were much obliged to Mr. Horsburgh for his suggestive remarks.\n\n12. With a vote of thanks to the Chairman, proposed by Sir J. T. Hutchinson, the Meeting terminated.\n\nGENERAL MEETING.\n\nColombo Museum, September 29, 1910.\n\nPresent:\n\nThe Hon. Mr. H. L. Crawford, C.M.G., in the Chair.\n\nThe Hon. Mr. P. Arunáchalam, M.A., C.C.S., Vice-President.\n\nMr. B. C. Cooray. Mr. F. Lewis, F. L.S.\nMr. E. S. Dasanaika, B.A. Mr. M. A. C. Mohamed.\nMr. D. Devapuraratna. Mr. A. E. Murrell.\nMr. A. H. Galpin. Mr. P. E. Morgappah.\nMr. T. Gracie. Rev. M. Sri Nánissara.\nDr. S. C. A. Hevawitarana, M.B., Dr. A. Nell, M.R.C.S.\nMr. E. W. Jayawardene. Mr. R. C. Proctor.\nMr. C. H. Jolliffe. Mr. J. E. Rode.\nMr. T. E. Karunatilaka. Mr. W. A. Samarasingha.\nMr. A. Lewis. Mr. J. M. Senaviratna.\nMr. A. R. Slater, B.A., C.C.S.\n\nMr. G. A. Joseph, Honorary Secretary and Treasurer.\n\nVisitors: seven ladies and fifteen gentlemen.\nBusiness.\n\n1. Read and confirmed Minutes of last General Meeting held on August 3, 1910.\n\n2. Announced the election of the following Members since the last General Meeting:\n\n(1) J. C. Fernando: recommended by { E. W. Perera.\n                                      C. Batuwantudawe.\n                                      A. Nell.\n                                      G. A. Joseph.\n                                      J. Still.\n                                      G. A. Joseph.\n                                      F. H. de Winton.\n                                      C. W. Horsfall.\n                                      J. A. Daniel.\n                                      G. A. Joseph.\n                                      E. Evans.\n                                      G. A. Joseph.\n                                      G. A. Joseph.\n                                      J. A. Daniel.\n                                      E. W. Perera.\n                                      C. Batuwantudawe.\n                                      J. A. Daniel.\n                                      G. A. Joseph.\n                                      R. H. Ferguson.\n                                      G. A. Joseph.\n                                      G. A. Joseph.\n                                      J. P. de Pinto.\n\n3. The Hon. Mr. P. Arunáchalam read the following Paper entitled \"Kandyan Provinces\":—\nKANDYAN PROVINCES.\n\nBy the Hon. Mr. P. Arunachalam, M.A.Cantab., C.C.S., M.L.C.\nVice-President, R. A. S. (C. B.).\n\nI.\n\nThe Ordinance No. 12 of 1840 was an enactment made (as stated in the preamble) for the prevention of encroachment on Crown lands by persons without any probable claim or pretence of title. Section 6, which is the most important section of the Ordinance, has been the cause of much litigation between Crown and subject, of heated discussion by lawyers and politicians, and of frequent judicial interpretation. It provides that—\n\n(1) All forest, waste, unoccupied, or uncultivated lands are presumed to be the property of the Crown until the contrary is proved;\n\n(2) All chenas and lands, which can only be cultivated after intervals of several years—\n\n(a) If situated in the districts formerly comprised in the Kandyan Provinces, are deemed to belong to the Crown and not to be the property of any person claiming the same against the Crown, except only on proof by such person—\n\n(i.) Of a sannas or grant for the same, together with satisfactory evidence as to the limits and boundaries thereof; or\n\n(ii.) Of such customary taxes, dues, or services having been rendered within twenty years for the same as have been rendered within such period for similar lands being the property of private proprietors in the same districts; and\n\n(b) If situated elsewhere in the Island, are deemed to be forest or waste land within the meaning of subsection (1).\nA distinction is thus created between lands situated in the districts formerly comprised in the Kandyan Provinces, and lands situated elsewhere. A special mode of proof is prescribed in order to rebut the presumption in favour of the Crown in the former case. But the expression \"the districts formerly comprised in the Kandyan Provinces\" has not been explained in the Ordinance. What is the precise meaning of the expression is not clear, and has not been authoritatively decided. Owing to the lapse of time and the research now necessary among ancient documents, the question is a difficult and complicated one. It raises points of historical and political as well as legal interest as to the constitution of the ancient Kandyan Kingdom, the changes introduced therein from time to time under British rule, and the territorial limits within which the system of law called the Kandyan Law prevails.\n\nII.\n\nIn Robertson's Case, 1886, 8 S. C. C. 36, and in Wijésinha v. Wijésinha, 1891, 9 S. C. C. 199, the Supreme Court referred to the Proclamation of February 11, 1815, which was issued upon the annexation of the Kandyan Provinces, in illustration of the expression. In Robertson's Case, Burnside, C.J., said:\n\n\"The Kandyan Provinces, denominated in the Proclamation of February 11, 1815, 'The Four Korales,' 'The Saffragam Korale,' and 'The Three Korales,' were by that Proclamation declared to be integral parts of the British possessions in the Island of Ceylon, and from thenceforth were received under the sovereignty and protection of His Majesty the King of Great Britain; since which time they have continued to be and form a part of, and have been absorbed into, this Colony of Ceylon. * * * Moreover, the old divisions which defined the original Kandyan Provinces, at the time of the cession, and separated them from the other Provinces, have long since disappeared, and the Kandyan Provinces, as Provinces apart from others, no longer exist, and it would not, I take it, at the present day, be possible to define any particular area of this Colony as the Kandyan Provinces. True it is, that there may be found throughout the Ordinances, references to the 'Kandyan Provinces' eo nomine, but this is\nundoubtedly a loose mode of expression, rendered conspicuously so by the interpretation clause of the Marriage Ordinance, No. 3 of 1870, which defines 'Kandyan Provinces' to mean the 'Provinces mentioned in Schedule B,' and Schedule B enumerates only one entire Province, the Central, with parts of the Eastern, Western, North-Western, Southern, and Northern Provinces—an area widely different from that mentioned in the Proclamation. The expression 'Kandyan Provinces' has, therefore, no legal significance as defining any particular area, distinct and apart from the topographical division of the Island into the several Provinces, Northern, Southern, Eastern, Western, North-Western, Central, North-Central, and very lately, Uva. These together comprise the whole territory of the Colony, but the subdivisions, whether for administrative, judicial, or revenual purposes, are ever changing at the will of the executive or legislative authority, and if there were any such thing as a provincial domicile, it would necessarily be subject to the ever varying changes of provincial boundaries, which to-day might fix the domicile in one Province, and to-morrow transfer it to another, without any actual change of residence.\"\n\nIn the same case Clarence, J., said:\n\n\"It is impossible to speak precisely as to any territorial limits of this application of Kandyan Law, since we are entirely without any definition precising any area over which it may be supposed to extend\"; and Dias, J., said: \"The best definition which I can give of the Kandyan Provinces is, that it is so much of the Island as is not included in the Maritime Provinces. With regard to the exact limits of the Kandyan Provinces we have no precise information, and probably when the whole Island became a British possession it became unnecessary to ascertain and define the exact limits of the two Provinces, Kandyan and Maritime. The first, and, so far as I know, the only official paper which deals with the subject is the Proclamation of February 11, 1815. The definition there given is too general, and wholly insufficient to fix the identity of the old Kandyan Provinces. In Wijésinha v. Wijésinha, Clarence, J., repeated: \"It is a matter of much\ndifficulty to ascertain within what territorial limits the so-called Kandyan Law is to be considered prevailing.\" In a recent case (Kapuruhami v. Medapola Appuhami, 1910, C. R. Kurunegala, 17,990, Wood-Renton, J., referred to Wijesinha v. Wijesinha as a binding authority.\n\nThe Supreme Court was mistaken in supposing that the only official document dealing with the subject was the Proclamation of February, 1815, or that it set forth the whole of the Kandyan Provinces. That Proclamation, after describing the armies of His Majesty the King of Great Britain as having occupied and entered into complete possession of \"the Kandyan Provinces, denominated the Four Korles, the Suffragam Korle, and the Three Korles,\" and that the Chiefs and people of those Provinces had fully and freely surrendered themselves to His Majesty the King of Great Britain, declares the same to be integral parts of the British Possessions of the Island of Ceylon, and adds that \"many other provinces of the Kandyan Kingdom have been entered and are partially occupied by the British forces.\" (Legislative Acts of the Ceylon Government, 1853, vol. I., p. 177.)\n\nAccording to Sir John D'Oyly (\"A Sketch of the Constitution of the Kandyan Kingdom,\" 1818*), the Kandyan Kingdom consisted of twenty-one grand divisions, of which the twelve principal were called dissávani (counties) and the majority of the rest rata (districts).\n\nThe dissávanis were each placed under the order of a Chief or Governor called Dissáwa. They were the Four Kóralés,\n\n* Prepared by him when administering that Territory (1815-1824), and published (in part) in the \"Transactions of the Royal Asiatic Society of Great Britain and Ireland\" (1833), vol. 3, pp. 191 et seq., at the instance of the Vice-President Sir Alexander Johnstone, who was Chief Justice of Ceylon, 1811-1820; reprinted in the Sessional Papers, 1891, pp. 107 et seq. Complete copies exist only in manuscript. There is one in the Colombo Museum. The whole of this interesting work deserves publication after collation of all existing manuscripts by a competent editor. Sir John D'Oyly was a very distinguished member of the Ceylon Civil Service. After a creditable career at Cambridge, where he was 2nd Chancellor's Medallist in Classics and a Senior Optime, he entered the Ceylon service in 1802, rose to be Resident and First Commissioner of the Government in the Kandyan Provinces, and was created a Baronet in 1821 for his services in conducting the negotiations in connection with the Kandyan Convention. He died at Kandy in 1824.\nthe Seven Kóralés, Úva, Mátalé, Sabaragamuwa, the Three Kóralés, Walapané, Udapaláta, Nuwarakaláwiya, Wellassa, Bintënna, and Tamankaḍuwa. The other nine districts were respectively under the authority of Chiefs who, except the last two, were distinguished by the name of Ratémahatmayás. They were Udunuwara, Yaṭinuwara, Tumpané, Hárispattuwa, Dumbara, Héwáhēta, Kotmalé, Uḍa Bulatgama, and Pāṭa Bulatgama (p. 17).\n\nIII.\n\nThe term Kandyan Provinces, as distinct from Maritime Provinces, was used by the British Government to designate the Provinces of the Kandyan Kingdom. See, e.g., Order in Council of April 12, 1832, published at p. 371 of vol. I. of the Legislative Acts of the Ceylon Government, 1853, where the terms Maritime Provinces and Kandyan Provinces are contrasted.\n\nThe boundary between the Maritime districts acquired by the British at the capitulation of Colombo in 1796, and the Dominions of the Sinhalese Monarchy ceded to the King of Great Britain by the Convention of 1815, had been clearly defined by a Treaty between the Sinhalese Government and the Dutch East India Company in the Śaka year 1688, equivalent to 1766 A.D.\n\nThe material portions of that Treaty* are as follows:\n\n\"Second Article.—The illustrious Lord Emperor, and the illustrious the principal members of His Majesty’s Great Council of Ministers ...... recognize the ...... States General of the United Provinces and the Company of Hollanders (in the East) as the rightful and independent overlord (कोड़ियाँ देश) of the several districts of this Island of Lanka, which had been held by the Company before the war now concluded, to wit, Yapa Pattanama, the districts thereto belonging, Hettikula Pattuwa, Mannarama, with the places\n\n* The Treaty in the original Sinhalese appears in vol. 16 of the Journal of the Royal Asiatic Society, Ceylon (p. 62 et seq.), with a translation by Mr. H. C. P. Bell, first published in the Orientalist, vol. 3, p. 115. The translation given above differs slightly from Mr. Bell’s.\nappertaining thereto, the country from there, (that is to say) Kalpitiya and the places appertaining thereto; Kolamba Disava, Galu Korale, Matara Disava, Puliyanduva, Trikunamale, with the places appertaining thereto. . . . . . *\n\n\"Third Article.—Moreover, all the sea board round the Island not held by the Company before the war . . . . . is to be given over to the above-named . . . . . Company, . . . . . to wit, on the West from Kammala to the furthest limit of the Yapa Pattanama Government, on the east from Yapa Pattanama to the Walagiya-ganga †; this coast line thus given up is a distance of one Sinhalese gawwa, more or less, inland, provided (however) that the demarcation (of the boundary) may be suitably carried out according to the rivers and mountains that fall (into line).\n\n\"Fifth Article.—On the other hand, the . . . . . Company recognizes the Supreme Government (of His Majesty) as the Sovereign and independent Lord Paramount of the other districts of this Island of Lanka.\"\n\nIn accordance with the above Treaty the boundary of the seaboard mentioned in the third article appears to have been defined by a surveying compass, and the Compass road then opened on the west coast still exists under the name Kompas-pára from Kammala northwards, marking the line of separation between the districts governed by the Roman-Dutch Law and those where the Kandyan Law prevails.\n\nIV.\n\nThe Proclamation of February 11, 1815, it will be seen, mentions by name only a part of the Kandyan Provinces, equivalent in the main to the modern districts of Ratnapura\n\n* Yapapattanama = Jaffnapatam, or Jaffna.\nHettikulapattuwa = Chettikulam.\nMannarama = Mannar.\nKolamba Disawa = Colombo.\nGalu Korale = Galle.\nPuliyanuduwa = Puliyanivu, or Batticaloa.\nTrikunamale = Trincomalee.\n\n† This is very probably the Karadi Aru of the Trincomalee District. Both names mean the Bear River.\nTANTRI-MALAI.\n\nPlate C.\n\nArchl. Survey photo.\n\n\"Pot-gula\": Cave Shrine.\n\n1896.\n\nSkeen & Co. block.\nSEDENT BUDDHA.\n\nExcavated, 1896.\nand Kégalla. Another Proclamation was issued on March 2, 1815, after the capture of the Kandyan King, and as a result of a Convention held with the chiefs of the Kandyan Provinces. This Proclamation declares the dominion of the Kandyan Provinces to be vested in the Sovereign of the British Empire, and that the administration of civil and criminal justice and police over the Kandyan inhabitants of the said Province is to be exercised according to established forms and by the ordinary authorities, but does not specify the names or limits of those Provinces. (Legislative Acts of the Ceylon Government, 1853, vol. I., p. 179.)\n\nThe Constitution and administration remained unaltered, except that a resident on behalf of the King of Britain was placed at the head, viz., Mr. (afterwards Sir) John D'Oyly, assisted by Mr. Simon Sawers as First Assistant to the Resident and Agent of Government at Badulla, and by Mr. Henry Wright as Second Assistant and Agent of Government at Kandy.\n\nUnder the Minute of April 28, 1815, the Kandyan Provinces were divided into five divisions and placed under the administration of a Board consisting of a President, a Judicial Commissioner, and a Revenue Commissioner, with the Commanding Officer of the Troops in the interior. This Board, with the Adigárs and principal chiefs, formed the Great Court of Justice, from whose sentence there was no appeal, except to the Governor. The civil authority was exercised as before by the native Dissáwas.\n\nI have not been able to trace this Minute, which I quote from Ievers' Manual, North-Central Province, p. 62. It is not to be found either in the Kandy Kachcheri or in the Colonial Secretary's Office. The Acting Government Agent of Kandy, Mr. Hellings, has kindly supplied me with a copy of a warrant or commission dated September 30, 1816, establishing the Board and prescribing its duties. The warrant is printed in the Appendix. The Board, it will be seen, does not include the Commanding Officer of the Troops, but only the Resident (John D'Oyly), the Accredited Agent in charge of Judicial business (James Gay), and Accredited Agent in charge of\nRevenue business, &c. (Simon Sawers). The Commanding Officer apparently did not join the Board till 1819.*\n\nThe Government Almanacs of 1817 and 1818 (pp. 65-69) enumerate the following Kandyan Provinces:\n\nFour Kóralés, Seven Kóralés, Úva, Mátalé, Sabaragamuwa, Three Kóralés, Walapané, Udapaláta, Nuwarakaláwiya, Wellassa, Tamankaḍuwa, Bintenna, Udunuwara, Yaṭi-nuwara, Tumpané, Hárispattu, Dumbara, Héwáhęta, Kotmalé and Upper Bulatgama, Minnéri and Lower Bulat-gama.\n\n* The following is a list of the members who, as far as can be ascertained, composed the Board:\n\n1816.\nJohn D'Oyly, Resident and First Commissioner.\nJames Gay, Second Commissioner, and in charge of the Judicial Department.\nSimon Sawers, Third Commissioner, and in charge of the Revenue Department.\n\n1819.\nJohn D'Oyly, Resident.\nLieut.-Col. Kelly, Commanding the Troops.\nEdward Tolfrey, Judicial Commissioner.\nSimon Sawers, Revenue Commissioner.\n\n1821.\nSir John D'Oyly, Resident.\nColonel H. Tolley, Commanding the Troops.\nSimon Sawers, Judicial Commissioner.\nHenry Wright, Revenue Commissioner.\n\n1822.\nSir John D'Oyly, Resident.\nLieut.-Col. H. Sullivan, Commanding the Troops.\nSimon Sawers, Judicial Commissioner.\nHenry Wright, Revenue Commissioner.\n\n1824.\nLieut.-Col. Greenwell, Commanding the Troops.\nSimon Sawers, Judicial Commissioner.\nHenry Wright, Revenue Commissioner.\nThe office of Resident was abolished in 1824, upon the death of Sir John D'Oyly.\n\n1825.\nLieut.-Col. C. Cother, Commanding the Troops.\nSimon Sawers, Judicial Commissioner.\nJohn Downing, Revenue Commissioner.\nOn November 21, 1818, a Proclamation was issued (Legislative Acts, 1853, vol. I., p. 223) after the suppression of the Kandyan insurrection, delegating the general executive and judicial authority in the Kandyan Provinces to the Board of Commissioners, and under their superintendence to Resident Agents of Government in the Dissávanis, with the Kandyan chiefs under them. Sections 53 to 55 of this Proclamation fix the jurisdiction of these officers for Administrative and Judicial purposes, and enumerate the divisions in the Kandyan Provinces.\n\n(1) Four Kóralés\n(2) Mátalé\n(3) Uḍapáláta, including Upper Bulatgama\n(4) Uḍunuwara\n(5) Yaṭinuwara\n(6) Tumpané\n(7) Hárasiyappattu\n(8) Dumbara*\n(9) Héwáhēta\n(10) Kotmalé\n\nWhich were assigned to the Board of Commissioners, with an Agent of Government at Attápitiya in the Four Kóralés, and another at Nálanda in Mátalé.\n\n1827.\nLieut.-Col. C. Cother, Commanding the Troops.\nJohn Downing, Judicial Commissioner.\nHenry Pennell, Revenue Commissioner.\n\n1829.\nLieut.-Col. Martin Lindsay, Commanding the Troops.\nJohn Downing, Judicial Commissioner.\nGeorge Turnour, Revenue Commissioner.\n\n1830.\nLieut.-Col. Martin Lindsay, Commanding the Troops.\nHenry Wright, Judicial Commissioner.\nGeorge Turnour, Revenue Commissioner.\n\n1832.\nColonel Clifford, Commanding the Troops.\nOthers as above.\n\nThe Board was abolished in 1833 and replaced by Government Agents of Provinces under the Proclamation of October 1, 1833.\n\nMr. George Turnour, Revenue Commissioner of the Kandyan Provinces, was afterwards Treasurer of the Island from 1841 to 1843, and is now best remembered by his scholarly translation of the Mahávánsa from the Páli, and by the prize established in his name at the Colombo Academy (now Royal College).\n\n* Minnéri of the previous list was merged in Dumbara.\n(11) The part of Walapané lying west of the Kuḍá and Umá-oya\n(12) Hurulu, Támarawęwa, Máminiyá, and Ulugalla pattus of Nuwarakaláwiya*\n\nWhich were assigned to the same Board of Commissioners.\n\n(13) Úva\n(14) Wellassa\n(15) Bintęnna\n(16) Wiyaluwa\n(17) Royal village of Madulla\n\nAssigned to the Agent of Government resident in Úva.\n\n(18) Seven Kóralés\n(19) Northern and western parts of Nuwara-kaláwiya*\n\nAssigned to the Agent of Government resident in the Seven Kóráles.\n\n(20) Sabaragamuwa\n\nAssigned to an Agent of Government resident there.\n\n(21) Three Kóralés\n\nAssigned to an Agent of Government resident there.\n\n(22) Tamankaḍuwa\n\nAssigned to the Collector of Trincomalee.\n\nA Census was taken of the population of the Kandyan Provinces in the year 1821. From the records that have been preserved in the Colombo Museum, the Registrar-General’s Office, and the Government Record Office, the Kandyan Provinces of which the Census was taken were:\n\n(1) Yatinuwara, consisting of the town and suburbs of Kandy and “villages within the rivers and districts beyond the rivers.”\n\n* The assignment of jurisdiction in Nuwarakaláwiya by this Proclamation having been found “too indefinite and productive of inconvenience,” the Minute of the Governor of September 18, 1819, assigned Kiralowa, Matombuwa, Undurawa, Kalagamuwa, Hurulu, Mahapotana, and Maminia pattus to the Board of Commissioners and under them the Agents of Government in Matale; and Parawaha, Kahalla, Negampaha, Kalagam, Eppawala, Ulugalla, and Nuwaragam pattus to the Agent of Government in the Seven Korales.\n(2) Udunuwara.\n(3) Udapalata.\n(4) Uda Bulatgama.\n(5) Kotmalé.\n(6) Harasiyapattu.\n(7) Tumpané.\n(8) Dumbara.\n(9) Hewaheta.\n(10) Walapané.\n(11) Úva (upper and middle divisions).\n(12) Úva (lower division).\n(13) Wellassa.\n(14) Bintenna.\n(15) Sabaragamuwa.\n(16) Three Kóralés and Lower Bulatgama.\n(17) Four Kóralés.\n(18) Seven Kóralés (upper and lower divisions).\n(19) Matalé.\n(20) Nuwarakaláwiya (western and eastern half).\n(21) Tamankaḍuwa.\n\nAnother Census appears to have been taken in the year 1832, and the following Kandyan Provinces, as distinct from Maritime Provinces, are shown in the record of the Census results in the Government Almanac of 1834. Apparently the Census did not embrace all the Kandyan Provinces, but only—\n\n(1) Udaraṭa.\n(2) Four Kóralés.\n(3) Three Kóralés.\n(4) Seven Kóralés.\n(5) Matalé.\n(6) Sabaragamuwa.\n(7) Tamankaḍuwa.\n\nThe Government Almanac of 1832 (pp. 91–92) gives the districts of the Kandyan Provinces as follows for the purposes of jurisdiction under the Proclamation of November 21, 1818:\n\n(1) Úva and Bintenna.\n(2) Sabaragamuwa.\n(3) Seven Kóralés and north part of Nuwarakaláwiya.\n(4) Three Kóralés.\n(5) Tamankaḍuwa.\n(6) Kandy.\n(7) Four Kóralés.\n(8) Mátalé and east part of Nuwarakaláwiya.\n(9) Hárasiyapattu and Tumpané.\n(10) Héwáhęṭa south of Maha-oya and Walapané.\n(11) Lower Úva and Wellassa.\n\nV.\n\nLieutenant-Colonel Colebrooke, one of His Majesty’s Commissioners of Inquiry on the Administration of the Government of Ceylon, in his report of December 24, 1831, to the Secretary of State, says:\n\n\"The Kandyan Provinces, which had been first acquired by the British Government in 1815, were settled on their present footing after the rebellion in 1818, and have been separately administered by the Governor, without the assistance of his Council. These Provinces were placed under the immediate superintendence of a Board of Commissioners, which Board is now composed of the Commandant of the Troops in Kandy and two Civil Servants, having charge respectively of the Judicial and Revenue Departments. The Kandyan territory is divided into eleven provinces or districts, of which five, situated above the hills around Kandy—(1) Udaratte, (2) Four Korales, (3) Matale and east part of Nuwarakalawa, (4) Harasipattoo and Tumpane, (5) Hewahette and Walapane—are placed under the immediate superintendence of the Board of Commissioners, to whom the Government Agents resident in those districts directly refer. The districts situated more remotely from Kandy, and below the hills, are also placed under Government Agents, who are intrusted with the same authority which is exercised by the Collectors in the Maritime Provinces. In one district (Seven Korales), a separate agent for part of the judicial affairs has been appointed, but the Government Agents in that and all the other districts are charged with the civil and judicial duties and with those of police. With the exception of\nthe Government Agencies in the three Provinces of Saffragam, Seven Korales, and Tamankaduwe, which are held by Civil Servants, these offices have been filled by officers of the regiments stationed in the Island.\n\n\"The separate administration of the Kandyan Provinces is maintained under the Convention which was concluded in the name of His Majesty with the Kandyan chiefs in 1815,* and modified in some of its provisions by a Proclamation of the Governor,† issued after the rebellion in 1818, by which the authority of the chiefs was curtailed. By the 4th clause of the Convention of 1815, the dominion of the Kandyan Provinces was vested in His Majesty, subject to the condition of maintaining the laws, institutions, and customs of the country; and by the 5th clause the religion of Bhood was declared inviolable, and its rights, members, and places of worship were to be maintained and protected.\" (\"Rámanáthan's Reports,\" 1820–33, p. 204.)\n\nLieutenant-Colonel Colebrooke added (ibid, p. 216): \"The maintenance of separate and independent establishments in the Maritime and the Kandyan Provinces has been impolitic, in the check it has opposed to the assimilation which it is on every account desirable to promote between the various classes of whom the population is composed. By maintaining a separate Government at Kandy the influence of the chiefs has been upheld, to the prejudice, in some instances, of the people. The Kandyan districts which are situated below the mountain have a nearer and more natural connection with those of the coast, with which they maintain a trading intercourse.\"\n\nAs the result of this report, a Proclamation was issued on October 1, 1833, by which the distinction between the Kandyan and Maritime Provinces was abolished, and the whole Island was divided into five Provinces—the Northern, the Southern, the Eastern, the Western, and the Central, which were declared to consist of the following districts. I have italicized the names of the Kandyan Provinces and districts under the previous constitution.\n\n* See Convention dated March 2, 1815.\n† See Proclamation dated November 21, 1818.\n\"The Northern Province shall consist of the country hitherto known as the districts of Jaffna, Mannar, and the Wanny; as the Dessavony of Nuvarakalawiya; and as the Island of Delft.\n\n\"The Southern Province shall consist of the country hitherto known as the districts of Galle, Tangalle, Matura, and Hambantotte; as the Dessavony of Saffragam, and as the Province of Lower Uva and Welasse.\n\n\"The Eastern Province shall consist of the country hitherto known as the districts of Trincomalie and Batticaloa; and as the Provinces of Tamankadewa and Bintenne.\n\n\"The Western Province shall consist of the country hitherto known as the districts of Colombo, Chilaw, and Putlam; as the Dessavonies of Seven Korales, Four Korales, and Three Korales; and as the Province of Lower Bulatgama.\n\n\"The Central Province shall consist of the country hitherto known as the districts of Kandy, Yattinuwara, Udunuwara, and Harasiapattoo, Tumpane, Dumbara, Hewahette, Kotmale, Upper Bulatgamme, and Weyeloowa; and as the Dessavonies of Uva, Matelle, Udapalata, and Wallapana.\"\n\nVI.\n\nThe expression in the Ordinance No. 12 of 1840, section 6, \"Districts formerly comprised in the Kandyan Provinces,\" therefore, emphasises the fact that since the Proclamation of October 1, 1833, there were no longer in law any provinces that could be called the Kandyan Provinces, and means the territory covered by the Dissavanis and Ratas enumerated by Sir John D'Oyly (pp. 106-7 supra), and the divisions set out in the Proclamation of November 21, 1818 (pp. 111-12), the western boundary between the Kandyan and Maritime Provinces being the Kompas-pára referred to at p. 107.\n\nThe conclusion I have arrived at I have since found to be supported by an old map of Ceylon in the possession of the Surveyor-General. It was prepared in 1822 by the then Surveyor-General, Capt. Schneider, and was a few years ago\ndiscovered in turning out some old records in the loft.* In this map the Kandyan Provinces are indicated as consisting of the divisions I have mentioned. A copy of the map is attached to this Paper.\n\nAs to the history of the Kandyan Provinces subsequent to 1833:\n\nIn 1837 Bintenna was transferred from the Eastern to the Central Province, and in 1845 the district of Alupota, which consisted of Lower Úva and Wellassa, was added from the Southern Province. The Central Province, so constituted, remained till 1886, when Bintenna east of the Mahaweli-ganga, Wellassa, and Úva were formed into a separate Province called the Province of Úva.\n\nIn 1839 the district of Alupota was subdivided and distributed among Hambantota, Batticaloa, and Úva districts (\"Ceylon Manual,\" 1910, p. 308).\n\nIn 1845, by Proclamation of October 1, 1845, the Seven Kóralés were, with Chilaw and Puttalam districts, taken from the Western Province and formed into a separate Province\n\n---\n\n* No record exists in the Surveyor-General's office relating to Captain Schneider's map. Captain Schneider was a Military Engineer in the service of the Dutch Government, who served under the British Government until his death about 1849 or 1850. From a note on page 259 of the \"Ceylon Manual\" for 1909, he appears to have been employed extensively on the irrigation works of all the maritime parts of the Island; and he also acted as Civil Engineer and Surveyor-General between 1812 and 1816. It is presumed that the map which he drew in 1822 and published in 1826 was compiled from the surveys which he had to undertake while making his reports on irrigation, and from the documents available in the Department at the time, and that he presented the map to the office. The Surveyor-General referred me to the Government Archivist, who, however, had no information regarding Captain Schneider's map.\n\nThe first map of the Island of Ceylon prepared after the British occupation was, the Government Archivist believes, one issued from the office of the Surveyor-General of the Madras Presidency in 1813. This is said to have been prepared in response to a private communication from Sir Robert Brownrigg to General Abercrombie, and a copy was furnished to the Ceylon Government. The Archivist is not aware if this map is extant anywhere. On reference to the Surveyor-General as to this map of 1813, he states: \"This is the first time I have heard of it. I have no copy of it in my possession. There are, I believe, some old maps in the Museum, of which it may be one.\" The Museum authorities, who were consulted, say that the map is not in the Museum.\ncalled the North-Western Province, the headquarters remaining at Puttalam till 1856, when they were transferred to Kurunégala.\n\nIn 1873, by the Proclamation of September 6, 1873, Demala hatpattu of the Puttalam district was attached to the newly created North-Central Province, but was re-transferred to the North-Western Province in 1875 by Proclamation of January 1, 1875, and is still treated as a Kandyan district for the purposes of the Kandyan Marriage Ordinance, No. 3 of 1870, schedule B.\n\nIn 1845, by the Proclamation of October 1, 1845, the Dissavani of Saffragam was transferred from the Southern Province to the Western Province, except the Yakawala Hatara Báge, which still remains in the Southern Province and is treated as a Kandyan district under the Ordinance No. 3 of 1870, schedule B.\n\nIn 1889 Saffragam (with that exception) and the Four Kóralés and Three Kóralés and Lower Bulatgama (assigned in 1833 to the Western Province) were formed into one Province called the Province of Sabaragamuwa.\n\nIn 1873, by the Proclamation of September 6, Nuwarakaláwiya (which had been assigned in 1833 to the Northern Province) and Tamankaduwa (which had been assigned to the Eastern Province) were formed with the Demala hatpattu of the North-Western Province into a Province called the North-Central Province. Demala hatpattu was restored to the North-Western Province by Proclamation of January 1, 1875.\n\nIn 1886 (by the Proclamation of February 1 of that year) the present Province of Úva was created, as stated above.\n\nThe Provinces created in 1833, therefore, differed from those of the present time as follows: the Western Province of 1833 embraced in addition to its present area the modern North-Western Province and the district of Kégalla; the Central Province embraced besides its present area the greater part of Úva Province; the Southern Province in addition to its present area included the Ratnapura district and lower Úva and Wellassa of Badulla district; the Northern Province included Nuwarakaláwiya of the North-Central Province;\nwhile the Eastern Province included Tamankaḍuwa of the North-Central Province and Bintenna of the Badulla district.\n\nFor the purposes of the registration of Kandyan marriages under the Ordinance No. 3 of 1870, the following Provinces are (by section 4) declared to be meant by the term \"Kandyan Provinces\" :\n\nThe Central Province.\nSeven Kóralés\nDemala Pattu of Puttalam\n\nThe Uḍa, Palle, and Radda Palatas of Bintenna; the Vannames of Nadene, Nadukáḍu, and Akkaraipattu; the Sinhalese villages in the division of Panawa—all in the Batticaloa district; Tamankaḍuwa; the Sinhalese villages in the Kaddukulam pattu, in the district of Trincomalee\n\nSabaragamuwa.\n\nFour and Three Kóralés and Lower Bulatgama\n\nYakawala in the Southern Province.\nNuwarakaláwiya in the Northern Province.*\n\nThe Ordinance No. 9 of 1870 has added to this list \"all Sinhalese villages in the Mannar District.\"\n\nAPPENDIX.\n\n(Note to page 109.)\n\nBy His Excellency Lieutenant-General Sir Robert Brownrigg, Baronet and Knight Grand Cross of the Most Honourable Military Order of the Bath, Governor and Commander-in-Chief in and over the British Settlements and Territories in the Island of Ceylon in the Indian Seas, with the Dependencies thereof.\n\nROBT. BROWNRIGG.\n\nTo the Hon. John D'Oyly, Esq., Principal Accredited Agent for the Kandyan Provinces, called Resident; James Gay, Esq., Accredited Agent with the immediate charge of Judicial Business; Simon Sawers, Esq., Accredited Agent in the immediate charge of the Revenue and of Public Services.\n\n* Now in the North-Central Province.\nWhereas it appears to Us, the said Governor, that, besides the separation of the Judicial and Revenue business from the immediate charge of the Resident, it is expedient that he should be further aided and relieved by the formation of a Board of Commissioners (at which he will preside), as well to collect and report such matters of information as are desired by Government as to take order for the performance of His Majesty's general service in the administration of the Kandyan Provinces. And further, that a Secretary should be appointed to the Residency, to be duly sworn to the faithful discharge of his duties in that capacity, and particularly that he will be secret and not disclose the business of the Residency otherwise than in the due course of his office:\n\nWe therefore direct that from the First day of October next, all heads of reference, minutes, and letters, whether from Us, the said Governor, or the Secretary for the Kandyan Provinces, heretofore transmitted to the Resident, with the inclosures and documents of reference belonging to the same, and also all such as shall hereafter be addressed to the Resident, shall be considered as addressed to the Board of Commissioners and be kept in an office under charge of the Secretary, or in particular cases under the joint keys of the Commissioners, excepting such as the Resident shall in the first instance and from time to time deem fit to be reserved for his own separate disposal, as secret and political, of which he will in the first instance transmit a list and afterwards from time to time notify to the Secretary for the Kandyan Provinces all such papers as shall be so reserved.\n\nThe acts and proceedings of His Majesty's Civil Servants in the public business shall be noted in the minutes of the Board summarily and by heads only, without detail or entry of papers, and all papers having reference to such acts and proceedings are to be compiled in a regular and orderly manner and specified in the minutes by distinct references.\n\nThese entries are to be made by the Secretary of the Residency from memoranda furnished at a sitting or otherwise by the several members of the Board according to their respective duties, namely, by the Resident concerning all that may relate to his general and superintending powers and concerning all that relates to business not appropriated to the immediate charge of the other Commissioners; by the Judicial Agent and Revenue Agent concerning their particular Departments and such other matters as may come under their charge or management or to their knowledge.\n\nThe sittings of the Board will be held from time to time, after the expiration of the present month, at appointed times, not less than thrice a week. The days and hours of such meetings shall be communicated by the Resident or Senior Commissioner present to the Secretary, and by him notified to the other Commissioners or Commissioner, and it will be the duty of the Secretary to procure and communicate such appointment at least 24 hours before the hour of sitting.\nA sitting may be held at the time and place appointed by any two members (the whole having been duly warned), and their proceedings will be noted in the usual manner, but all practical measures proposed or resolved at any such sitting are referred to the provisions hereinafter contained under the head of taking order for the public affairs.\n\nIn matter of information it will be the duty of the Board and of its several members from time to time to procure and deliver in for transmission to the Kandyan office, for the information of Government, all such documents, facts, and particulars of information as may come to their possession and knowledge concerning—\n\n1st.—The rights, privileges, and powers saved to the Chiefs and Headmen by the 4th clause of the Convention;\n\n2nd.—The civil rights and immunities secured to the people by the same clause;\n\n3rd.—The laws, institutions, and customs in the same clause mentioned;\n\n4th.—The customary maintenance and protection promised by the 5th clause to the religion of Boodhoo, its rites, ministers, and places of worship;\n\n5th.—The established forms and ordinary authorities for the administering justice confirmed by the 8th clause;\n\n6th.—The Royal dues, both of Service and Revenue, appropriated to His Majesty’s use by the 11th clause;\n\n7th.—The constitution and interior economy of all officers and departments, with regard to which the statements promised by all the Chiefs to His Excellency at his last visit to Kandy but only furnished in part and by a few of the Chiefs, are to be demanded and transmitted to Colombo;\n\n8th.—The charges and modifications of these institutions by the effect of the new Government and their wilful perversion from corrupt or tyrannical motives; errors in judgment, or neglect; and\n\n9th.—The remedies expedient to be applied to all such defects.\n\nAnd with respect to taking order for public affairs We do hereby authorize the Board at any sitting to be appointed and held as aforesaid to consider, deliberate, and resolve concerning all matters whatsoever of the general administration of the Kandyan Provinces on the motion of anyone of the Commissioners, excepting such matters as the Resident shall in the first instance or from time to time reserve to himself as secret and political. Provided, however, that no resolution of the Board be acted on or any measure carried into effect until the same shall have received the assent of the Resident, or in his absence from the Residency the Senior Commissioner present. Hereby reserving in the fullest manner to the Principal Accredited Agent or Resident, and in his absence from the Residency granting to the Senior Commissioner present, all political, superintending, and controlling powers which have at any time heretofore been lawfully exercised by the Principal Accredited Agent called Resident, and saving the laws, institutions, and customs of the Kandyan Provinces. Confirming also the Convention as explained and modified by Our\nProclamation dated the 31st day of May, 1816, and retaining all Our public acts and other orders in their full force, and calling the attention of the Board to all minutes and other documents of general instruction, and particularly to the matters of an address made by Us, the said Governor, to the assembled Chiefs at Kandy on the 20th day of May last.\n\nFor all which purposes and such others as shall from time to time be signified by instruction from Us, the said Governor, or by Our order, We do hereby appoint you Commissioners and to form a Board as before mentioned.\n\nColombo, the Thirtieth day of September, One thousand Eight hundred and Sixteen.\n\nBy order of His Excellency the Governor,\n\nJames Sutherland,\nSecretary, Kandyan Provinces.\n\n4. A discussion followed, in which Messrs. F. Lewis, R. C. Proctor, and the writer of the Paper took part.\n\nMr. Proctor: Will the difficulty which is met in defining the limits of \"Kandyan Provinces\" under our law be lightened by a strict interpretation of the word \"formerly\" in the phrase \"in the districts formerly comprised in the Kandyan Provinces\"? What limit of time was intended by our legislators to be fixed by the word \"formerly\"?\n\nIf the times when the Dutch ceded their territories to the British were intended, then the definition of Mr. Justice Dias may be accepted for practical purposes, i.e., \"so much of the Island as is not included in the Maritime Provinces.\" At the same time there were divisions that were neither under the Dutch nor under the dominion of Kandy, e.g., the Wanni district. This was not subjugated by the Dutch, and often served as a buffer. Kandyan law did not apply to this division.\n\nCan the word \"formerly\" refer to times anterior to the occupation of the Dutch?\n\nThe Portuguese documents extant are misleading and unreliable in the matter of defining limits of what then comprised the Kandyan Provinces. The Kandyan King was often addressed by them as Lord of Jaffna, Batticaloa, and of the Pearl Fisheries, when in fact he was not.\n\nThe political constitution of the Kandyan Provinces should throw some light on the subject. Even before the invasion of Ceylon by the European powers, the Kandyan Provinces did not represent a well-defined area. The village (Sin. gama) was not only a geographical, but also a social, ecclesiastical, and political unit. An association of several villages formed a Kóralé, two or more Kóralés formed a Hatpattuwa, an association of Hatpattu formed\na Dissavony. These Dissavonies formed the Kandyan Provinces—a Commonwealth—the head of which was the Kandyan King. It was not uncommon for some Hatpattu or Dissavonies to break loose from the Commonwealth and set up independent principalities, so that the Kandyan Provinces expanded and contracted as the association of villages joined the confederacy or cut themselves away, according to events. The looseness of the tie between the villages and Dissavonies and the constitution will account perhaps for the difficulty of fixing the limits of the Kandyan Provinces at this date.\n\nOne fact is however clear, viz., that the distinction created by our law in the modes of proof prescribed in order to rebut the presumption in favour of the Crown between lands situated in Kandyan Provinces and elsewhere, is based on historical actualities. In Provinces which had come under the influence of European powers possession of lands was individualistic, while in the Kandyan Provinces it was socialistic. Hence the distinction.\n\nWhat limit of time is intended to be fixed by the word \"formerly\"?\n\nThe Hon. Mr. Arunáchalam: I take \"formerly\" to mean before the Proclamation of October 1, 1833.\n\n5. A vote of thanks to the Hon. Mr. Arunáchalam for his Paper was accorded, on the motion of Dr. A. Nell, and seconded by Mr. F. Lewis.\n\n6. The proceedings of the Meeting terminated with a vote of thanks to the Chair, proposed by the Hon. Mr. P. Arunáchalam and carried unanimously.\n\nCOUNCIL MEETING.\n\nColombo Museum, November 17, 1910.\n\nPresent:\n\nMr. P. Freudenberg, J.P., Vice-President, in the Chair.\n\nThe Hon. Mr. P. Arunáchalam, M.A., C.C.S., Vice-President.\n\nMr. S. de Silva, Gate Mudaliyár. Mr. R. C. Kailasapillai, Mudaliyár.\n\nMr. A. M. Gunasekera, Mudaliyár.\n\nMr. G. A. Joseph, Honorary Secretary and Treasurer.\nBusiness.\n\n1. Read and confirmed Minutes of last Council Meeting.\n\n2. Resolved,—That the following gentlemen be elected Members of the Society:\n\n(1) B. S. Cooray: recommended by A. Nell.\n(2) J. Pearson, D.Sc., &c., Director, R. A. Mirando.\n   Colombo Museum: recommended E. Evans.\n   by G. A. Joseph.\n(3) F. L. Baker, Assistant Superintendent of Surveys: recom- J. Still.\n   mended by G. A. Joseph.\n(4) J. A. D. Senarat: recommended by J. Still.\n   G. A. Joseph.\n(5) A. H. Pertwee: recommended by A. Nell.\n   G. A. Joseph.\n(6) O. A. A. Jayasekera, Proctor: recom- R. A. Mirando.\n   mended by A. Nell.\n\n3. Considered the question of the cost of printing the Paper (with illustrations) entitled \"Mulgiri-gala,\" by Mr. Donald Ferguson.\n\nResolved,—That Mr. P. E. Pieris be kindly asked to edit the Paper on the lines indicated by him, and that he do specify the illustrations which he would recommend should be reproduced.\n\n4. Laid on the table Circular No. 143 of June 11, 1910, containing the opinions of Messrs. P. E. Pieris and Mudaliyár A. Mendis Gunasekera on a Paper entitled \"Kávyasékara, Chapter I.,\" by Mr. A. O. Jayawardana.\n\nResolved,—That Mr. Jayawardana be thanked for sending the Paper to the Society, but informed that the Council regret they are unable to accept it.\n\n5. Laid on the table a Paper entitled \"Rebellion of Ederille Rála, 1594–1596,\" by Mr. P. E. Pieris, C.C.S.\n\nResolved,—That the Paper be referred to Messrs. F. H. de Vos and Simon de Silva, Mudaliyár.\n\n6. Laid on the table a letter from Mr. H. C. P. Bell regarding the translation of Professor Geiger's Papers on the Maldives.\n\nResolved,—That this Society cannot afford to pay for the translation of these valuable studies of the Maldives, but that the Council do recommend the matter for the favourable consideration of Government.\n\n7. Read a letter from Dr. A. Willey thanking the Society for electing him an Honorary Member.\n\n8. Resolved,—That, if possible, a General Meeting be held in January next, and that the business be left in the hands of the Secretaries.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/journalofceylon221910roya_bw.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 180, "total-input-tokens": 265588, "total-output-tokens": 75992, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 513, 9], [513, 513, 10], [513, 854, 11], [854, 854, 12], [854, 1734, 13], [1734, 1802, 14], [1802, 3031, 15], [3031, 4353, 16], [4353, 6084, 17], [6084, 8211, 18], [8211, 9756, 19], [9756, 11589, 20], [11589, 13926, 21], [13926, 16201, 22], [16201, 18468, 23], [18468, 20821, 24], [20821, 22862, 25], [22862, 25417, 26], [25417, 27782, 27], [27782, 30325, 28], [30325, 32488, 29], [32488, 34563, 30], [34563, 36523, 31], [36523, 38973, 32], [38973, 41290, 33], [41290, 43419, 34], [43419, 45744, 35], [45744, 47703, 36], [47703, 48701, 37], [48701, 51019, 38], [51019, 53211, 39], [53211, 55469, 40], [55469, 57751, 41], [57751, 59613, 42], [59613, 61113, 43], [61113, 63170, 44], [63170, 65618, 45], [65618, 67917, 46], [67917, 69850, 47], [69850, 71736, 48], [71736, 74219, 49], [74219, 76575, 50], [76575, 79247, 51], [79247, 81548, 52], [81548, 83546, 53], [83546, 85380, 54], [85380, 87750, 55], [87750, 90121, 56], [90121, 92583, 57], [92583, 95029, 58], [95029, 97506, 59], [97506, 99806, 60], [99806, 102035, 61], [102035, 104826, 62], [104826, 107206, 63], [107206, 109770, 64], [109770, 112411, 65], [112411, 114977, 66], [114977, 117829, 67], [117829, 120635, 68], [120635, 123297, 69], [123297, 125787, 70], [125787, 128147, 71], [128147, 129490, 72], [129490, 131489, 73], [131489, 133479, 74], [133479, 136417, 75], [136417, 138653, 76], [138653, 138653, 77], [138653, 138832, 78], [138832, 140450, 79], [140450, 141832, 80], [141832, 142015, 81], [142015, 142015, 82], [142015, 143548, 83], [143548, 144682, 84], [144682, 146059, 85], [146059, 147989, 86], [147989, 148701, 87], [148701, 150467, 88], [150467, 153442, 89], [153442, 154482, 90], [154482, 156533, 91], [156533, 158687, 92], [158687, 160860, 93], [160860, 162093, 94], [162093, 163960, 95], [163960, 166097, 96], [166097, 168441, 97], [168441, 170461, 98], [170461, 172693, 99], [172693, 174345, 100], [174345, 176483, 101], [176483, 178682, 102], [178682, 181173, 103], [181173, 183420, 104], [183420, 185460, 105], [185460, 187639, 106], [187639, 187639, 107], [187639, 187639, 108], [187639, 187687, 109], [187687, 187687, 110], [187687, 187735, 111], [187735, 187735, 112], [187735, 187794, 113], [187794, 187794, 114], [187794, 187794, 115], [187794, 187794, 116], [187794, 187794, 117], [187794, 187794, 118], [187794, 187880, 119], [187880, 187880, 120], [187880, 187928, 121], [187928, 187928, 122], [187928, 189857, 123], [189857, 192372, 124], [192372, 194946, 125], [194946, 196926, 126], [196926, 199398, 127], [199398, 201739, 128], [201739, 203737, 129], [203737, 206222, 130], [206222, 208587, 131], [208587, 211748, 132], [211748, 214590, 133], [214590, 217341, 134], [217341, 217437, 135], [217437, 217437, 136], [217437, 217514, 137], [217514, 217514, 138], [217514, 219627, 139], [219627, 221036, 140], [221036, 222504, 141], [222504, 224714, 142], [224714, 226931, 143], [226931, 229486, 144], [229486, 231488, 145], [231488, 233368, 146], [233368, 233467, 147], [233467, 233467, 148], [233467, 233467, 149], [233467, 233467, 150], [233467, 233500, 151], [233500, 233500, 152], [233500, 233500, 153], [233500, 233500, 154], [233500, 235633, 155], [235633, 237185, 156], [237185, 238985, 157], [238985, 240550, 158], [240550, 241614, 159], [241614, 243470, 160], [243470, 245597, 161], [245597, 247469, 162], [247469, 250085, 163], [250085, 252142, 164], [252142, 253697, 165], [253697, 256749, 166], [256749, 259727, 167], [259727, 262200, 168], [262200, 264008, 169], [264008, 266055, 170], [266055, 266055, 171], [266055, 266055, 172], [266055, 266055, 173], [266055, 266055, 174], [266055, 266055, 175], [266055, 266055, 176], [266055, 266055, 177], [266055, 266055, 178], [266055, 266055, 179], [266055, 266055, 180]], "primary_language": ["None", "None", "None", "None", "None", "None", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "nl", "en", "en", "nl", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "None", "en", "None", "en", "None", "None", "None", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]