[{"id": "498aeb4b036ceb1883c816dc68c43b1f444e1a4a", "text": "ESSAY\n\nON THE\n\nARCHITECTURE OF THE HINDUS.\n\nBY RÁM RÁZ,\n\nNATIVE JUDGE AND MAGISTRATE AT BANGALORE; CORRESPONDING MEMBER OF THE ROYAL ASIATIC SOCIETY OF GREAT BRITAIN AND IRELAND.\n\nWITH FORTY-EIGHT PLATES.\n\nLONDON:\n\nPUBLISHED FOR THE ROYAL ASIATIC SOCIETY OF GREAT BRITAIN AND IRELAND,\n\nBY JOHN WILLIAM PARKER, WEST STRAND;\n\nTO BE HAD ALSO OF\n\nMESSRS. DE BURE, BROTHERS; AND MESSRS. DONDEY DUPRÉ AND SON, PARIS,\n\nAND MESSRS. BLACK, YOUNG, AND YOUNG, LEIPZIG,\n\nBooksellers to the Society on the Continent.\n\nM.DCCC.XXXIV.\nPREFACE.\n\nThe introduction to the European public of an \"Essay on Hindu Architecture,\" and by a Hindu, would seem to mark an epoch not only in the history of the science but also in that of the Hindus themselves.\n\nTheir palaces, their temples, the stupendous pyramidal gateways leading to the latter, the colonnades and porticoes with which they are surrounded; some of \"a thousand pillars,\" others equally remarkable for their elevations, richness, and grandeur of design, have for ages been the objects of admiration to the traveller in the East; and, though it had long been known, proverbially, that the Hindus possessed treatises on architecture of a very ancient date, prescribing the rules by which these edifices were constructed, it remained for the author of this essay to overcome the many, and almost insurmountable obstacles to the substantiation of the fact, and to the communication of it to the European world in a well known language of Europe.*\n\n* The Royal Asiatic Society is chiefly indebted to one of its members, Richard Clarke, Esq., for the accomplishment of this important and desirable object. This gentleman, then recently returned from India, suggested to Rám Ráz to undertake some work which should\nAs of most other sciences among the Hindus, the rules and precepts of architecture and sculpture had been, with some solitary exceptions, locked up in the Sanscrit language; and, as the study of this language was limited, in general, to the higher classes; the only means of improvement left to the artist, who in all cases would be of a subordinate class, were the verbal instructions delivered to him by these superiors, when they might happen to require his assistance; together with the impress on his mind resulting from practical experience. To reduce the knowledge thus acquired to a system, and to promulgate it in a language comprehensible by the vulgar, would, in most cases, have been thought an encroachment on the privileges of the higher orders; and being, therefore, handed down unavoidably from father to son by tradition only, it must, in the natural course of events, have been often obscured or totally lost. Moreover, the study of this, as well as of other sciences, has been very generally laid aside by the higher classes for acquirements more in unison with the tone and feelings of the times; while the treatises themselves, scattered and neglected, became nearly valueless to all but the humble artisan, who gathered up here and there a fragment, and hoarded the occult lore, sometime to be learnt by stealth, or as best might suit the purpose of his lordly and priestly master.\n\nimpart to the European world, through the Royal Asiatic Society, information not yet before them; and he recommended the \"Architecture of the Hindus\" as a topic worthy of the abilities and talents of his native friend. The circumstances under which he acceded to the proposition, though already brought to the notice of the public in \"Rickards's India,\" merit and indeed claim insertion in an introduction to his work. They are detailed in two letters from the author to Mr. Clarke, extracts from which will be found in a subsequent page.\nPREFACE\n\nTo collect these remains from far and near; to read, collate, and comprehend them, with the terms and phraseology of the science, was no ordinary undertaking: the assistance of the artist on the one hand, of philologists on the other; corroboration by reference to existing edifices, and the ability to exhibit the results at length deduced, in the technical and scientific language of a foreign people, were all equally necessary to the completion of the task.\n\nIt must, however, be understood that the author does not profess to give the whole system of architecture as known to the Hindús at any particular period, or indeed, a complete translation of such portions of those treatises as he was able to collect; but, from his deductions and illustrations, such an exposition as might enable the European reader to form an opinion of what that system may once have been.\n\nSuch was the attempt of Ram Ráz.* How far he has been successful the public must decide. Men,† whose authority will, it is believed, be readily acknowledged, have spoken of his work in terms of the highest commendation; and if it shall appear that he has established the claim of his countrymen to the possession, in an eminent degree, of a knowledge in the art,—and this at a period when its principles were but little understood among Europeans, he will have accomplished a task which he fondly looked forward to with every confidence of success; and one, it is hoped, which\n\n* It is painful to state, that ere the result of his labours has passed through the press, accounts from India have announced the decease of this most worthy member of the Royal Asiatic Society.\n\n† Messrs. William Wilkins, R.A., William Daniell, R.A., and Charles Cockerell, F.S.A.—(Vide the Tenth Annual Report of the Royal Asiatic Society, p. 89.)\ncannot be uninteresting, or devoid of utility, to the followers and promoters of science in general.\n\nThe present may not be an improper occasion, as the author of the accompanying essay is no more, to offer a few brief notices of his life. They are, however, merely such as the recollections of the writer to whom the subject of these notices was intimately known for several years, can supply, yet they may, perhaps, as a tribute to his memory, be received with indulgence.\n\nRām Rāz was born at Tanjore, in the Carnatic, about the year 1790. He was small of stature, of a delicate frame, of a fair complexion for an Asiatic, and had a remarkably brilliant and piercing eye. On public occasions there was in his manner, though on the whole graceful and easy, a diffidence which might lead the cursory observer to undervalue his abilities; but by those to whom he was known in private, it was more justly attributed to innate modesty and humility. His name implies that he was of a superior caste; and he used to boast of being a collateral descendant of Rām Raj, or Rām Rāz,* the last of the kings of Vijayanagar; and as the name is often met with in the genealogy of those princes, it is not improbable that it may have thus descended to him.\n\nHis parents, it would seem, were poor; and that he was partly indebted to fortuitous circumstances for the little education which he received when a boy; a portion of this, however, fortunately for him, consisted in learning to read and write the English lan-\n\n* Rāj or Rāja, according to the Sanscrit pronunciation: Rāx or Rāza, according to the pronunciation of the same term in the vernacular languages of the South of India.\nguage. He was first attached to one of the Native Regiments of Infantry, as a clerk, it is believed, to the Adjutant; and, subsequently, as Vakil, or native agent to the regiment. While in these situations he prosecuted the study of the English language; and by acquiring a more grammatical knowledge of the several* vernacular dialects which he had been taught in early life, he added to a character for natural quickness of intellect and correctness of conduct, that of an accomplished interpreter. How long he remained in this situation, or whether leaving it at this period he obtained any other, is not known; but in the year 1815, we find him employed as a clerk in the office of the Military Auditor General. While in this employment a circumstance accidently brought him to the notice of the gentleman before mentioned. He had undertaken to translate from the Mahratta into the English language a code of Regulations drawn up by order of the late Tippú Sultan, the sovereign of Mysór, for the guidance of his revenue officers. Such a work, it will be readily conceived, could not form a part of his duties as clerk in a military audit office, and it must therefore have been a voluntary task.\n\nHis translation was in every respect so correct, and the notes and illustrations accompanying it exhibited so eminent a degree of knowledge in the several languages from which the terms and phrases used in the original were generally borrowed, as well as of the Mahratta and English, and at the same time displayed so much talent in the elucidation of the various parts of the subject\n\n* It is not uncommon that in the same town or village two, three, or more vernacular languages will equally prevail; and that boys are taught, though very imperfectly, to read and write in the whole of them.\nby comparison and by contrast with the English system of revenue, as at that period to give rise to considerable doubt of its being the unassisted performance of a Hindu. Satisfied that it was so, this gentleman, his early patron, who besides the several offices which he held in the civil department of the Madras Government, was also Senior Member of the College of Fort St. George, gladly availed himself of so fair an opportunity to countenance and encourage talents and conduct such as he observed in our author; and procured for him, first, the appointment of Head of the College Office, and afterwards that of Head English Master to the native classes of that institution.\n\nIt was while in the latter situation that he was, for upwards of five years, intimately known to the writer of these remarks, who, shortly before his quitting India, had the satisfaction of recommending him to the First Commissioner in Mysór, by which means he was placed in a sphere of action where talents such as his could not long remain unknown, and which soon raised him to the responsible and highly honourable post of Judge and Magistrate.\n\nBy a regular course of private study while at Madras, he had added to his other accomplishments, not only a knowledge of the Sanscrit language, but also of algebra, geometry, the higher branches of mathematics, and of geography and astronomy; and at one time he had classes in these branches of science, the scholars of which were an honour to his industry and talents; by many of whom his assiduity, ability, and zeal, will be long held in grateful remembrance.\n\nOf his death no particular accounts have yet been received. It is said that the climate of Mysór was not congenial to him;\nand perhaps the duties of his situation there were too arduous for his weakly frame. He had no family, but he had adopted a daughter whom, together with his widow, an aged mother, and a brother who was in some mercantile profession at Madras, he has, it is supposed, left to enjoy the little wealth which his frugality, rather than any adequate return actually awarded to his merits, enabled him to realise. But however this may have been, his loss as a man of talents and of science, as well as a highly valuable servant of the British Government, is deeply to be regretted.\n\nThe writer* of these remarks has the pleasure to announce that he expects shortly to receive from the friends of the deceased, ample materials whence a full and authentic view of the author's life may be drawn, should such a record be thought sufficiently interesting to the public, to induce its acceptance by the Royal Asiatic Society.\n\n* After the volume was sent to press, he received from the widow of the deceased a letter, from which the following is an extract:\n\nTo Captain Harkness.\n\n\"Bangalore, East-Indies, 22d May 1833.\n\n\"As my late husband in his lifetime had mentioned to me the existence of a friendship between yourself and him, and which, by letters found after his decease, I feel convinced existed in your mind towards him, I have taken the liberty to address you on the subject of my misfortune, not only in the loss of one so dear, so amiable, but also in being subjected to the mercenary and avaricious views of his brother.\n\n\"I beg to call to your remembrance the number of years my late husband was in the Honourable Company's service; first, as Vakeel to the Second Battalion of the\nSixteenth Regiment of Madras Native Infantry; then in the Military Auditor General's Office; next in the College at Madras; and, lastly, as Native Judge in the Hoosoor Adawlut Court at Bangalore, embracing a period of twenty-three years, during which he never failed in his different situations to obtain the respect and approbation of his superiors, and every one who had an acquaintance with him, as the various letters and testimonials from highly respectable individuals now in my possession will testify. It may also be in your recollection that he constantly and steadily pursued a course of study which has tended, in a certain degree, to the embellishment of Oriental Literature. His contributions to the London Asiatic Society, of which he was a corresponding Member, and his Illustrations of the Architecture of Hindostan, and other efforts of his genius, have obtained the public thanks of that Society, and of other learned individuals both here and in England.\"\n\nExtract of a Letter from Ram Raz to Richard Clarke, Esq.\ndated Madras, 13th October 1827.\n\n\"Since my last letter to you, I have collected ample materials for an essay on our architecture. I am now engaged in examining them, and hope to be able to send you the result of my examination by the next season. Works on Silpa Sástra are very scarce in this part of the country; and even the few scattered fragments that can be had are scarcely intelligible to our best educated pundits, as they are so full of memorial verses and technical terms, that none but those who have been regularly initiated in the study of the art, can comprehend them fully. As to our Silpás themselves, you know they are generally men of very limited acquirements, and totally unacquainted with the science, so that the task of explaining this obscure subject has become exceedingly difficult. I often attempted to unravel it with the assistance of many artists and pundits who had been supposed to know anything of the matter, and as often despaired of meeting with any success; at length I have fortunately found a good sculptor of the Cammata tribe, a native of Tanjore, who is well acquainted with the practical part of the Hindú architecture, and with most of the terms used in the art. With his valuable aid I have already been enabled to solve many intricate problems, and to remove many difficulties against which I had long been struggling. It is a melancholy truth, that\nthose venerable sages to whom our works on arts and sciences are attributed, in endeavouring to communicate instruction to the world have been guided rather by a mistaken ambition of rendering themselves reputable by the difficulty and abstruseness of their style, than by an anxiety to make themselves intelligible. And to this indeed is that almost general ignorance among the Hindús in the arts and sciences chiefly ascribable. I have now in my possession four standard treatises on architecture, and expect to have some more from different provinces; and I confidently hope that the result of my investigation will enable me to present to the Royal Asiatic Society, through you, a correct account of a science which may be now considered as almost lost for want of encouragement to study it.\"\n\nTo Richard Clarke, Esq.\n\n\"Madras, 13th January 1828.\n\n\"In the last letter which I did myself the honour of addressing to you, I expressed a hope that I should be able to forward to you an Essay on Hindú Architecture by an early opportunity; but I fear I have been too premature in forming such a hope. I little calculated upon the time that would be necessarily required for me to surmount the various difficulties with which I have to contend in elucidating a subject now so little known in this part of the country. Little did I foresee the extent of the field into which my research has since led me. It is true I have procured several treatises on architecture, sculpture, &c.; and I have already mentioned to you how much I am indebted to Dr. Aitkin for the two manuscripts which he had the kindness to procure me; but our best pundits have given them up as altogether inexplicable; and although these works are all composed in Sanskrit, yet, with the exception of some topics connected with religious rites, sacrifices, and astrology, (which occupy indeed a considerable portion of the Silpa Sástra, and with which we have no immediate concern,) I might, without any exaggeration, affirm that the whole is no more intelligible than the darkest oracles are, at least, to those who are unacquainted with the science itself. Our pundits, it is well known, are skilful enough in scholastic disputation respecting grammar, logic, and law; to which, perhaps, may be added, a qualification, though less general, in mythological poetry and metaphysics, and a partial knowledge of astronomy and medicine; but our architecture, sculpture, painting, &c. have been for ages confined to a class of people...\"\nwhom our ancient legislators have ranked amongst the lower orders of society. This class, perhaps, jealous of the Brahmins, whose sacerdotal authority they have always opposed with a spirit of independence, or more naturally, apprehensive of competition in their trade, took particular care to conceal the sacred volumes which have descended to them, from the rest of the people; but as they have on their own part been long denied the benefit of Sanskrit literature, these treatises could be but of little use to themselves; and the consequence has been, that while the practical part of the science continued to be followed up amongst them as a kind of inheritance from generation to generation, the theory became gradually lost to the whole nation, if not to the whole world. Even the few scattered fragments which have escaped the hand which either jealousy or the fear of competition has raised to conceal or rather destroy the science, are now quite unavailable to those who kept them to themselves and to the priests. The former being compelled to refer to the latter for the interpretation of the superior dialect, and the latter to seek from the former for definitions of technical terms, which neither the one nor the other seem to have been able to explain or understand accurately. This circumstance, more than any other, has cost me considerable time and expense, without any adequate advantage. Our best dictionaries, at least the best that I have been able to procure, do not contain a single architectural term, and the best of our workmen have been so long disused to their own ancient style of building durable public edifices, that it is not to be wondered at they should now ascribe their ignorance of the art as revealed from heaven to the want of encouragement, which appears indeed to have ceased on the decline of native rule. Such is the state of knowledge among those to whom we could look for any illustration respecting an art, the study of which has been so long neglected in this country; and the few manuscripts too, which have escaped the corroding hand of time inevitably contain numerous errors and defects which it requires no small labour and time to correct and supply.\n\n\"These difficulties, combined with want of time on my own part to surmount them, discouraged me for a long while, and it is but lately I commenced to translate and to take down extracts and notes of some parts which I have been enabled to make out. There still remains a great deal to be done; nevertheless, great reason have I to think that what I have already executed will facilitate my future progress. At all events, if it please heaven, I hope to be able to send you at least a part of the work by an early opportunity: and though I cannot promise that my performance will be such as to meet with the approbation of the Royal Asiatic Society, yet I trust it may not prove altogether\nunacceptable to that learned body of men, inasmuch as it may tend to draw attention to this important subject, connected as it is with the state of arts and sciences in India in early days.\n\n\"The subject itself is curious, and highly deserving the attention of the antiquarian and the philosopher. A correct account and accurate elucidation of the art of building practised by the Hindús, must throw considerable light on the early progress of architecture in general. Some of the western authors have traced a certain resemblance in the leading features of the buildings in Egypt and India, and have thence concluded that there has very early been a communication of architectural knowledge between the two countries. But it is not altogether improbable that this resemblance may be merely owing to accident; inasmuch as in architecture as well as in every other art indispensably necessary to the comfort of mankind, two or more nations may possess something in common, without having any intercourse with each other, for the wants felt by man being the same, it is not surprising that the remedies resorted to for supplying them should be also similar or nearly so. If, on the other hand, however, both these countries had actually any communication in early ages, it is hard to determine which of them may have been indebted to the other. The western writers on antiquities have not placed this matter beyond a doubt. And for my own part, I will not venture to affirm anything with certainty, until I have collected sufficient information to form an opinion as to this alleged affinity in the architecture of Egypt and India. I humbly presume, therefore, that until the Silpa Sútra of the Hindús is correctly illustrated and laid before the public, the question as to whether the art owes its origin to the one or the other of the two countries must remain problematical.\n\n\"Whilest the subject of my present research opens upon me such a wide field of delightful prospect notwithstanding the difficulties I already anticipated, I cannot but acknowledge, with painful sensations, my own incompetency for the task which your kindness has assigned to me, and regret most sincerely that it has not fallen into abler hands. Diligence and fidelity, however, in the execution of the work entrusted to me shall not be wanting on my part; but the result of my labours can be only commensurate to the ability I possess compared with the difficulty of the subject.\n\n\"I hope what I have already said will give you some notion of the nature of the undertaking in which I am engaged, and of the little progress which I have hitherto been enabled to make in consequence of unavoidable delays arising partly from the difficulty of the subject, and partly from the want of leisure. You are too well acquainted\nwith my trifling acquirements to entertain high expectations in the performance of the task assigned to me. I only propose to write a short but comprehensive Essay on Indian Architecture from the materials I may be able to collect; to which I shall perhaps add some descriptions of a few temples and porticoes, principally taken from the Carnatic, with corresponding designs.\n\n\"Wishing you and your family every success and prosperity in life,\n\n\"I remain,\n\n\"Sir,\n\n\"Your most obedient and faithful servant,\n\n(Signed) \"RAM RAZ.\"\nESSAY\n\nON THE\n\nARCHITECTURE OF THE HINDUS.\n\nIt is true that the Hindus were in possession of numerous treatises on architecture, sculpture, &c., which collectively are called the Silpa Sāstra,* but unfortunately few traces of them remain. There appears to have been, according to some, thirty-two, and according to others sixty-four, standard treatises on the above-mentioned arts, but of these, excepting a few scattered fragments which are occasionally to be met with among the artists themselves, nothing but the titles of the works are now generally known to the learned. Speaking of these treatises, Sir William Jones expresses it as his opinion that they contained useful information on sixty-four different arts and manufactures; but while I admire his extraordinary talents and extensive knowledge of Asiatic literature, I cannot but think that he was misinformed as to the number of subjects comprised in the Silpa Sāstra, as from the similarity of the contents of the remains of several of these treatises, and which will be hereafter noticed, there is reason to think that\n\n* From silpa, manual art, and sāstra, science. This term, though in its general signification it comprehends the whole of the mechanical arts, is applied commonly, and perhaps by way of pre-eminence, to architecture.\nthe whole thirty-two, or sixty-four, if there did exist so many, must have treated principally, if not entirely, of sacred architecture and sculpture.\n\nIn a series of memorial verses preserved among the artists, are recorded the names of the authors or titles of the above-mentioned sixty-four treatises. Of these, thirty-two are called Muc'hya, or principal, and thirty-two Upa or subordinate. I have not been able to ascertain who was the author of these verses, but they contain little more than the titles of the works in question, and which are mostly patronymics of the deities who were believed to have revealed the particular art or arts on which each work treated, or of the authors of the treatises themselves, the renowned Rishis or holy men, who are said to have flourished in the earlier ages.\n\nMany works of acknowledged antiquity attest the existence of a number of treatises on Silpa Sāstra; and every artist proverbially knows that there have been thirty-two principal, and as many subordinate works on this subject. In a Tamil controversial work entitled Iru-samaya-villacam, or \"the illustration of the two systems,\" (i.e. of Vishnu and Siva), supposed to have been written in the fifteenth century by a Vaishnava,* in refutation of the doctrines of his opponents, or rather in commendation of his own, a work which is held in high estimation, especially among the Vaishnavas in Southern India, the author, in the course of his arguments to prove the supremacy of Vishnu over Siva, has been led incidentally to cite certain passages from the Silpa Sāstra, which describe the sites to be assigned for the erection of temples for Vishnu and Siva: the former to be in the middle of the town or village, as the most acceptable place for a deity whose characteristic attributes are benignity, mercy, and preservation; and the latter without the village, as proper for one possessed of opposite qualities. This work recognizes a great number of the treatises abovementioned, and enumerates twenty-nine of them by their titles, concluding the list with the\n\n* A follower of Vishnu.\nwords \"and others;\" but which of these works it was that he consulted on the point of discussion, the author does not inform us: there is reason, however, to believe that many of them had been lost long prior to the period at which he wrote.\n\nSome shattered remains of the treatises entitled Mānasāra, Māyāmata, Cāryapa, Vayghānasa, Sacalādhicāra, Vinacarmiya, Sanducumāra, Sāraswatya, Pāncharatram, and others included in both the lists, are still occasionally, though rarely, to be met with in Southern India; and notwithstanding that I have been able to procure considerable portions of the four works first named, and a few detached chapters or sections of each of the rest, it was with considerable difficulty; and unfortunately, the manuscripts which I have collected, are not of a very useful description. Mutilated as they invariably are in many important parts, almost every line of them is not only disfigured by gross errors, perpetuated by a succession of ignorant transcribers, but the technical terms and memorial verses with which the whole abounds, are so little understood either by the artists or the pundits of the present day, that it requires no ordinary exertion to comprehend and explain the exact import of even a single section.\n\nThe first work, entitled Mānasāra, is the most perfect I have seen, and perhaps the most perfect on the subject that now exists. It is stated to be the production of a sage named Mānasāra, and is of great celebrity in the south of India, as affording copious information on every branch of the art on which he treats, but particularly on that of building sacred edifices; and it is often consulted by the artists as the highest authority for the solution of contested points in architecture. This work appears, according to an enumeration of the contents given in the preface, to consist of fifty-eight adhyāyas or chapters,* each of which is devoted to a particular topic;\n\n* In order that a more accurate idea may be formed of the subjects contained in this work, a particular description is given of the contents of each adhyāya as taken from the preface.\nbut the portion I have in my possession contains no more than forty-one chapters, in which are described the measures used in architecture, sculp-\n\nThe first chapter treats of the measures used in architecture, sculpture, carpentry, &c.; the second describes the qualification of a Silpi, and gives a brief account of the origin of the five different classes of artists, said to have been descended from Visvacarma, and to have followed respectively the occupations of sculptors, joiners, braziers, jewellers, and blacksmiths. The third, fourth, and fifth chapters explain the nature and qualities of the soil on which buildings should be erected—such as temples, palaces, and private dwelling-houses for the several classes of people. The sixth contains rules and directions for constructing a gnomon, for the purpose of determining the several points of the compass. The seventh treats of the parts into which the ground-plan of the cities, towns, temples, palaces and houses should be divided. The eighth chapter gives a minute description of sacrifices and other devotional rites, to be performed on various occasions in the building of temples, houses, &c. The ninth chapter treats of villages and towns, and prescribes rules for the formation of streets, and the allotment of fit places for the erection of temples, and for the residence of the different classes of people. The tenth contains a description of the different sorts of cities; the eleventh treats of the dimensions of the several sorts of edifices; the twelfth of the Garbhavinyasa, or laying the foundation-stone in the centre of the intended building; the thirteenth of Upapithas or pedestals; the fourteenth of Adhistana or basement; the fifteenth of the several species of pillars, with their respective dimensions; the sixteenth of Prastaras or entablature; the seventeenth of the junction of the several parts of timber work, with reference to their points; the eighteenth of Vimanas, temples, or palaces in general. Twelve successive chapters, from the nineteenth to the twenty-eighth, contain descriptions of temples surmounted by pyramidal domes, consisting of from one to twelve stories, with their respective dimensions. The twenty-ninth chapter treats of Pradakshinas or outer courts of temples; the thirtieth of the attendant deities, and the parts respectively assigned to each within the walls of the temple; the thirty-first of Gopuras or pyramidal buildings, or turrets raised over the gateways leading into the temples; the thirty-second of Mantapas or porticoes, or resting-places for the deity; the thirty-third of Salius or halls; the thirty-fourth of cities; the thirty-fifth of private dwelling-houses; the thirty-sixth and thirty-seventh of gates and doorways, with their dimensions; the thirty-eighth and thirty-ninth of the palaces and their appendages; the fortieth of princes with their titles; the forty-first of the building of cars and other vehicles of the gods; the forty-second of couches, cushions, and the like; the forty-third of the thrones for the gods and for princes; the forty-fourth of ornamental arches; the forty-fifth of the Calpatars or the all-productive tree, which is supposed to\nON THE ARCHITECTURE OF THE HINDUS.\n\nture, &c.; the different sites to be selected for building temples and houses; the mode of determining the different points of the compass; the several sorts of villages, towns, and cities, with directions for building them; the different parts of an edifice, its ornaments, pedestals, bases, pillars, entablatures, &c.; the various sorts of temples, consisting of from one to twelve stories high; the construction of mantapas or porticoes, gates, and doorways, palaces, &c. &c. The remainder of the work appears to contain ample information respecting the whole process in the construction of images, and of cars and other vehicles in which the gods are carried in procession; but these subjects are more immediately connected with sculpture and carpentry than with architecture. It may be proper to notice, however, that a considerable portion of the whole is occupied with a minute description of the mysteries, rites, and sacrifices to be performed on various occasions, in the building of temples, houses, villages, towns, and cities; the ceremonies attending the consecration of images; the mode of determining the propitious moment for commencing to lay the foundation of an edifice, as well as rules for predicting the future prosperity of him who causes the edifice to be raised, by the aspect of the stars, the situation of the building with respect to the cardinal points, and other astrological devices.\n\nto be planted in Indra's heaven, and to supply all the wants of those who have the happiness of taking shelter under it. The forty-sixth chapter treats of Abhishécas or ablutionary rites, by which images are sanctified; the forty-seventh of jewels and ornaments worn by the gods and mortals; the forty-eighth of statues of Brahma and other deities; the forty-ninth of the Lingam the emblem of Siva; the fiftieth of seats and forms raised for the reception of images; the fifty-first of the form of Sacti the goddess of nature; the fifty-second and fifty-third of the images worshipped by the Baudddhas and Jainas; the fifty-fourth describes the statues of Yeshas, Vidyddharas, and other choristers; the fifty-fifth those of the saints or holy men; the fifty-sixth and fifty-seventh those of the Devas or gods, with their respective vehicles; and the fifty-eighth concludes with rules for chiselling the eyes of the statue, and the ceremonies to be performed on the occasion.\nThe second work, entitled Māyāmata, is ascribed to Māya,* probably the author or compiler of the Sūryasiddhānta, a work on astronomy of the greatest repute, and who is stated in the Rāmdyana of Vālmīc to have prepared the altar for the sacrifice performed by Dasāratha the King of Ayodhya (Oude), and father of Rāma. It differs little from the Mānasāra in the main arrangement of the subjects. It opens with the mystical rites performed in honour of the Vāstu, or the spirit presiding over the ground on which buildings are erected, and proceeds to give rules for the examination of the soil, the preparation of it for buildings in general, the construction of a gnomon for the purpose of determining the cardinal points, the division of the ground-plan into several parts for religious as well as domestic purposes, and the performance of sacrifices previous to the commencement of the work; after which it describes the several sorts of villages, cities, and fortresses, upapithas or pedestals, the adhisthānas or bases, the pādas or pillars, the prastaras or entablatures, the ornaments used in cavettos under the cupola, the seats raised for the reception of idols, the sīcharas or the domes of temples, the ceremonies observed in laying the first and the last stone of an edifice, the several sorts of temples, the courts by which they are surrounded, the pyramidal gateways, the mantapas or porticoes, the altars to be raised in the front of temples, and concludes with instructions for the carving of images, &c.\n\nThe third work, entitled Cāyapa, is attributed to the sage whose name it bears, a personage celebrated in sacred writings of great antiquity. He is considered as one of the progenitors of mankind, and ranked the first amongst the seven holy men who were preserved from the universal deluge,\n\n* Māya is also stated in the Mahābhārata to have erected a splendid palace for the residence of the five sons of Pādā, a poetical description of which occupies a whole book of that celebrated work. He is supposed to be one and the same person with him who erected the altar for Dasāratha, and the seeming inconsistency of his being contemporary with Rāma and Chrishna, in two such remote periods as the Creta and Dwapara Yugas, mythological writers reconcile by assigning a supernatural term to the life of the personage in question.\nand who peopled the earth soon after that great event. This treatise, though more succinct than the two former, contains sufficient information on the subject of sacred architecture and sculpture; the whole is composed in a dramatic form, and is stated in the preface to have been revealed to the author personally by Siva; and in consequence, the former is frequently addressed throughout the book by the appellation of Dwijottama, \"the best of the twice-born,\" and the like. The subjects contained in this work are nearly the same as those contained in the Mānasāra, but the arrangement is somewhat different. It commences with the description of the several sorts of soil which are considered proper for buildings, and proceeds to the preparatory rites and sacrifices to be performed in honour of the Vāstupurusha, or the spirit presiding over the ground appropriate for the erecting of temples and houses; thence to the mode of constructing a sanc'hu or gnomon for the purpose of ascertaining the points of the compass, and thence to the laying of the foundation-stone, and the ceremonies to be observed on this occasion. It afterwards describes the pedestals, the bases, the gates of the temples, and doorways of houses, pillars, capitals, and other ornaments; the seats raised on the pavements of temples, and niches for the reception of images; aqueducts or water-courses; the several sorts of vimānas or shrines with the pyramidal towers, consisting of from one to sixteen stories; the tōranas or ornamental arches erected over gateways and pillars; doors and their dimensions; statues of the gods, saints, and holy men, &c.\n\nThe fourth treatise, called Vayghānasa, is the work of a sage so named, and who was the founder of a sect of Vaishnava priests. It is written in a sort of metrical prose, and is rather ritual than architectural; and as the author in the latter part of the work frequently cites the authority of Cāsyapa, and as the work itself is included among the subordinate treatises enumerated in the list, it appears to be comparatively a modern performance. It opens with an encomium on the land of Bharata,* as being\n\n* India.\npeculiarly sacred, and adapted for the performance of holy rites and sacrifices; and thence proceeds to describe the various sacrifices ordained in the Veda, to be performed when the purpose is to obtain special boons or favours, either temporal or spiritual, such as progeny, riches, wisdom, absolution from sin, purification, &c. It next treats of the mystical rites practised in honour of Vāstu, preparatory to the building of sacred edifices, or of altars for sacrifices; of villages, towns, and cities, the fruits to be derived from building and peopling them with Brāhmans; the construction of temples dedicated to Vishnu, with rules for carving the images of that deity and his attendants, on whose attributes the author occasionally dwells with that devotion and zeal which characterize all his followers.\n\nThe work entitled Sacalādhicāra, an excellent but rather voluminous performance, is attributed to Agastya, a sage whose history occupies a conspicuous place in the Purānas. Some few sections only of this work are to be now met with; and the portion which has as yet come under my own observation, is exclusively on the subject of sculpture as connected with the formation of statues; but it is so diffuse, that if we suppose the whole work to be written in a similar style, it must considerably exceed the volume of Mānasāra, the largest at present of my collection.\n\nAs I have but a few detached pieces of the other works mentioned above, they do not appear to call for any distinct notice. Some of these pieces are descriptive of the construction of temples, some of the towers over gateways, some contain directions for laying the foundation of a building, some treat of the auspicious and inauspicious seasons for the commencement of an edifice, and others of the manufacture of images and so forth. However, as the rules contained in these fragments differ very little in substance from those laid down in the Mānasāra and other treatises on the same subject, I shall seldom have occasion to refer to them in the course of this essay.\n\nThe exact age of each of these treatises it is very difficult to ascertain. Tradition gives to most of them an antiquity altogether extravagant; and\nON THE ARCHITECTURE OF THE HINDUS.\n\nhowever diligent the endeavour to obtain authentic information on this point, success can hardly be expected to attend it, when we consider in what obscurity and oblivion the ancient history and chronology of the Hindús are involved. Of Mánasára,* the sage to whom the first treatise is attributed, I have not been able to procure any distinct historical notice; but, as has already been mentioned, the supposed authors of the other treatises, entitled Cásyapa and Máyámata, are, under these names, greatly celebrated in the Puránas and other sacred writings of antiquity. That all these treatises were composed in the South of India, there appears indeed no reason to doubt, for they seem to have been the standards by which the existing religious structures were reared throughout this part of the peninsula.\n\nThe most interesting circumstance connected with these treatises, is their toleration of the worship of the Jainas and Baud'dhas; the authors of them having carefully pointed out distinct sites to be set apart in villages and towns for the erecting of their temples, and having likewise prescribed rules for constructing images of the objects of adoration by these sects. This prescription marks, though indefinitely, the age of these compositions to have been posterior to the great schism which took place between the Hindús and Jains, and which terminated in the overthrow of the latter. The contentment, too, of this latter sect with the inferior situation assigned them by their conquerors for their divine worship, in a place contiguous to that which, among Hindús, is usually appropriated to the shrines of inferior deities and malignant spirits, evinces their complete subordination at the period alluded to.\n\nAnother circumstance in that portion of the foregoing treatises which has fallen into my hands is worthy of notice. They prove by internal evidence, that they were written at a period subsequent to the canonization:\n\n* Some say Mánasára is not the name of the author but the title of the work itself, signifying \"the essence of proportion,\" and which, from this etymology, I am inclined to believe; but whatever may be the real name of the author, I shall make use of the word both as the name of the author and the title of the work throughout this essay.\nof Apper, Sundarer, Sammander, Mánicyavásarer, and other holy men, several of whom are supposed to have lived between the third and fifth century of Saliváhn. The ground on which this proof rests is, that in the chapters which prescribe rules for carving statues, directions are likewise given for carving those of the personages here mentioned, who have been admitted among the inferior divinities, and assumed their places around the temple of Siva, particularly in the South of India. But some learned men to whom I mentioned this circumstance, rather than concur in an opinion which detracts from the antiquity of these works, are inclined to think that the passages in question are modern interpolations.\n\nThe small portion which has come under my observation of the work called Sacaládhicára, \"the universal authority,\" does not furnish sufficient data to form any opinion of the precise time at which it was composed; and in the section which gives rules for carving statues, that is, in the only part I have seen of it, I find no mention of the saints above referred to. It is generally believed to have been composed by Agastya, under the auspices of the founder of the Pándya government, a circumstance which, if admitted, would give to this work a very high antiquity. It is, however, difficult to trace the exact period when the Pándya principality was originally established. Mr. Wilson, in his prefatory remarks to his catalogue of the M'Kenzie collection, places this event three or four centuries before the Christian æra, although in another place he fixes the date of the civilization of the South of India, ten centuries before Christ; but the data on which this conjecture is formed is imperfect, being derived from a source which can be no authority in matters of this nature.* There exists indeed a long list of the princes of the Pándya, and their contemporary Chóla and Chéra dynasties, many of whom appear to have reigned long anterior\n\n* The author, it would appear, identifies the civilization of the South of India with the establishment of the Pándya principality; events which Professor Wilson conjectures, on the authority of the traditional records of the South, to be distinct, and of different eras.\nto the Christian era, and their celebrity to have attracted the notice of Ptolemy. The few facts, it is true, that have been recorded of these dynasties, or preserved by tradition, are unfortunately inadequate to the formation of a connected sketch of their history, or to trace their chronology with precision; but the various accounts which are obtainable of these ancient monarchies, though they usually commence with the earliest ages, and are blended with marvellous and extravagant fictions, would still afford ample historical proofs of the establishment of these principalities at an earlier period than what has been hitherto assigned them by western antiquarians. And as the Mahábhárát, which is believed to have been composed by Vyása, in the beginning of the Caliyug, makes mention of the Pándya and Chóla governments, we must give them credit for a higher antiquity.\n\nThat the religion and literature, as well as the political constitution of the South, were derived from the North, the earliest seat of the Hindú empire as well as of arts and sciences, and that the southern peninsula was before that period a vast uncultivated forest, inhabited by small insulated tribes, speaking a jargon which hardly furnished them with terms expressive of their immediate and natural wants, there is scarcely any doubt. While in this state of society, the sage Agastya, to whom the treatise under examination is attributed, appears to have brought hither the first colony of Brahmans and other classes from the north, and with them the Hindú religion and literature, in form the same as at the present day. He is believed to have been the inventor of the letters now in use in the Tamil, and the first who refined that language on the principles of the Sanscrit or northern dialect; and as this personage is stated also to have officiated both as minister and spiritual teacher to the founder of the Pándya principality, it is not unlikely, that the usefulness of the art of building to such an infant state, should have induced him to write a treatise on the subject.\n\nThe foregoing notice of the contents of the several treatises, or fragments of treatises, may seem to promise a good deal of useful information on the arts of which they treat; but, in truth, the architectural portions of them, if\ndivested of all the extraneous matter with which they abound, contain little more than a dry detail of the technical names, and of the proportions of the several members of a sacred edifice. It has already been stated that considerable portions of the works above-mentioned, are replete with minute descriptions of religious rites, to be performed on various occasions from the commencement, to the completion of a building, as well as rules and aphorisms drawn from its situation, aspect, &c. for predicting the future destiny of the builder. The latter, however, form no part of the present inquiry, and they are interesting so far only as being descriptive of the customs of the ancient Hindús, with regard to their belief in divinations, omens, prodigies, &c., a belief which is still fondly adhered to by their posterity. With respect to other branches of the art on which information is wanting, it is stated by good authorities, and there is reason to believe the statement, that military architecture is treated of at length in some of the ancient treatises on Arthasástra, or political science, and particularly in one attributed to Chánacya, the well-known minister of Chandragupta.*\n\nThe same authorities also state, that ample instruction for the building of private dwelling-houses, is contained in other works, professedly written on civil architecture:† but as these books are not at present to be met with, it has been thought advisable to restrict this research to religious architecture.\n\nI now proceed to a more detailed consideration of the portions of the treatises in my possession, trusting that it may serve to elucidate both the theory and practice of the art. In doing this, I purpose occasionally to introduce extracts from the authorities which I may consult, and to make\n\n* A celebrated prince who reigned in Pátáliputré when Alexander visited the upper Hindústan; the same who is known to the Greek writers by the name of Sandracottus.\n\n† Since writing the above, a respectable friend of mine had the kindness to procure me, from Travancore, a copy of a work entitled Mánushydloya Chandrica, which, as its name implies, treats of that branch of the art which applies to private houses, but of the description built in that kingdom.\nmy own observations regarding any affinity which to me may seem to exist between the Indian and European systems.\n\nThe first chapter of the Mānasāra treats of the several measurements used in architecture, sculpture, &c. In measuring space, the Hindūs commonly take their reckoning from the most minute quantity or extent; and Mānasāra, like others who have treated on the subject, begins his measure from paramānu, which he defines to be the particle perceptible only to the eyes of the sages, perhaps thereby importing the atoms spoken of in the writings of philosophers, while others have identified it with one of those subtile particles of substance which are seen floating in the reflected light of a sun-beam. \"Eight\" of these paramānus make one ratharēnu, or grain of dust raised up by the wheels of carriages; eight ratharēnus one valāgra, the point of a hair; eight valāgras are equal in size to a louse; eight lice to a grain of yava; three, three and a half, and four yavas make one angula, or finger of the inferior, middle, and superior sorts respectively. Twelve angulas make one vitasti or span; two vitastis one hastha or cubit, which is equal to twenty-four angulas, and is sometimes called cishcu hastha, lesser cubit, in contradistinction to prajāpatya hastha, which is equal to twenty-five angulas. Twenty-six angulas make one dhanurmusti or the grasp of a bow; twenty-seven angulas, one dhanurgraha or the handle of a bow. Thus the hasthas are fourfold; the first or cishcu is employed in the construction of couches, vehicles, and the like; the second or prajāpatya is used in building temples, pyramids, &c.; the third or dhanurmusti in constructing houses; and the fourth or dhanurgraha, in the measurement of villages, towns, and cities. According to some, however, the cishcu hastha is adopted for all these purposes indiscriminately. Again, four hasthas make one dandā or staff, which is called sometimes yesti, and sometimes dhanus; and eight dandās are equal to one ryju, a cord which is employed in measuring all sorts of land. In raising sacrificial altars, a particular sort of angula is used, equal in size to the intermediate space between the two middle joints of the middle finger of the carta, or master, and which is thence called mātrāngula.\nThe second chapter of the *Manasāra* treats of the qualities of an architect (*Silpi lacshanam*); and as preliminary thereto, of the origin of artists of the several kinds, and which is traced to *Viswacarma* the heavenly architect. This personage is stated to have had four heads, probably in allusion to the supernatural talents with which he was endowed, and to his invention of so many useful arts. Another *Viswacarma*, *Twasta*, *Maya*, and *Manu* are named as his sons, and said to have left four other offspring, whose names, however, are not mentioned in any of the works under examination, but of whom the first is affirmed to have been by profession a *sthapati*, architect; the second *sūtragrahi*, the measurer; the third *vardhaci*, the joiner; and the last *tacshaca*, the carpenter; and all of whom are considered as indispensably necessary to the building of an edifice. Their intermarriage, also, with the families of some noted persons of the Hindū mythology, is adverted to as a further proof of the divine origin of the artists; and the whole concludes with a short notice of their requisite qualifications, of which the following passages from the *Manushydālaya Chandrica* will convey some idea.\n\n“An architect (*sthapati*) should be conversant in all sciences; ever attentive to his avocations; of an unblemished character; generous, sincere, and devoid of enmity or jealousy.”\n\n“Of nearly equal qualification with him should be the *sūtragrahi*; he may be either the son or disciple of the *sthapati*; he should be particularly skilled in mathematics, and be strictly obedient to the will of the *sthapati*.”\n\n“A *tacshaca*, who is thus called from part of his avocation being to pare the rough wood, should be of a cheerful temper, and well versed in all mechanical arts.”\n\n“A *vardhaci* is he who is dexterous in joining wood, and uniting other materials one with another; he should be of a calm disposition, and acquainted with drawing and perspective,”\n\n“As it is impossible to build houses and the like without the aid of the\n\n* A treatise on civil architecture referred to in the preceding note.\nfour descriptions of artisans, sthapati and so forth, let the enlightened twice-born* gratify them in every respect, so that buildings may be erected.\"\n\n\"Woe to them who dwell in a house not built according to the proportions of symmetry. In building an edifice, therefore, let all its parts, from the basement to the roof, be duly considered.\"\n\nThe word sthapati is from stha, that which is fixed or formed, and pati, lord or master, and consequently, like the Greek Αρχιτεκτων, signifies a person who presides over the erecting of an edifice, the formation of a statue, and the construction of a chariot, &c. The principal qualifications of an architect consist in a knowledge of various branches of learning, such as arithmetic, geometry, drawing, sculpture, mythology, astrology, &c., the usefulness of all of which to a master-builder is too obvious to require any comment. Nor are these qualifications altogether unlike those which Vitruvius and other western architects have prescribed as indispensable to their profession, if we except the knowledge of medicine, music, and even anatomy, which the latter have thought proper to add to the qualifications of an architect. It is curious to observe, that among other moral qualities enumerated in the texts above cited, as requisite in the Hindú architect, is included \"sincerity,\" a virtue, the want of which in the artists of India is proverbial.\n\nThe third chapter of the Mānasāra professes to treat of the nature and qualities of the ground on which buildings are to be erected. It opens with the definition of vástu, a term used to express the ground on which any superstructure is raised, as signifying that which is inhabitable, and directs a careful examination of the site to be selected for building, as to its fitness for the purpose from its colour, smell, taste, form, and touch. It then goes on to divide the soil into four sorts, and to point out in the order of superiority what is considered auspicious for the residence of each of the four classes, with reference to the five qualities above-\n\n* Brahmans, C'shetriyas, Vais'yas, or men of the first, second, or third classes.\nmentioned. Nay, some have gone even so far as to forbid the lower class from occupying the ground suited to the higher, and vice versa, on pain of incurring the severest vengeance of heaven; but the principle on which these distinctions are founded is altogether nugatory. It signifies little whether the ground designed for the residence of a Brahman be square or oblong, white or red, sweet or sour, provided that the situation is convenient, and that it furnishes a firm bottom for laying the foundation; nor is it possible to find a place possessing all the qualities required by this prescription for the residence of any one of the classes; and, in order perhaps to obviate this difficulty, another more general classification of the soil into three sorts is added, with a declaration that the two first will answer the purposes of all classes of men without exception.\n\n\"The best sort of ground should abound with milky* trees, full of fruits and flowers; its boundary should be of a quadrangular form, level and smooth, with a sloping declivity towards the east, producing a hard sound, with a stream running from left to right, of an agreeable odour, fertile, of an uniform colour, containing a great quantity of soil, producing water when dug to the height of a man's arm raised above his head, and situated in a climate of moderate temperature. The ground possessed of qualities directly opposite to those mentioned above is the worst, and that which has a mixed nature is the middling.\"\n\nThe ground to be avoided is described in a special manner as follows:\n\n\"That which has the form of a circle, a semicircle, containing three, five, or six angles, resembling a trident or a winnow, shaped like the hinder part of a fish, or the back of an elephant, or a turtle, or the face of a cow, and the like; situated opposite to any of the intermediate quarters north-west, and the like; abounding with human skulls, stones, worms, ant-hills,\n\n* Chadira (memosa of Linn.), cadumba (naseclea), nimba (morgosa), champaca (michelea), punnága (menua of Linn.), amlaca (emblíca of Linn.), pátala (bignonia), saptapharna (echites of Linn.), and some others, belong to this species of trees.\nbones, slimy earth, decayed woods, coals, dilapidated wells, subterraneous pits, fragments of tiles, lime-stones, ashes, husks of corn; and exposed to the wafted effluvia of curds, oil, honey, dead bodies, fishes, &c.: such a spot should be avoided on every account.\"\n\nThe following rule is laid down in the first section of the Cāryapa, for the purpose of ascertaining the solidity of the ground on which the foundation is to be laid. \"Having dug a pit a hasta in depth, in the middle of the ground, return the earth into it, and according to the space which the latter may now take up with reference to that which it occupied before the digging of the pit, whether more, less, or the same, the ground should be considered as good, bad, or indifferent; the good and indifferent sorts are acceptable, but the bad should by all means be avoided.\"\n\nAfter the ground has been chosen with due regard to its qualities, the sthapati, in an auspicious moment, must cause the rites of purification to be performed, the prescribed oblations made, and consecrated water to be sprinkled on all sides, accompanied with invocations for the prosperity of the builder. The soil is then ploughed, certain ceremonies prescribed for this occasion also being observed.\n\nThe fourth chapter of the Mānasāra contains rules for the construction of the plough, and directions for ploughing the ground, preparatory to erecting temples, &c. \"A plough,\" says the author, \"must be made of the chadira,* nimba,† or of the wood of any other milky tree. It must be from one to one and a half hasta in length, with a tapering point resembling the leaf of a bambu, furnished with a share of three, five, or six angulas long and two thick, and with a beam of three yards in length. This machine is to be yoked to a pair of oxen of equal size and of the same colour, either white, black, red, or gray. The oxen should be strong, and such as have not exceeded the middle age. Oxen with horns bent down, mained, weak, meagre, toothless, or lame, should be rejected; those with a white\n\n* Memosa of Linn. † Margosa.\nspot on their legs and foreheads, with eyes resembling the petals of the lotus, are to be preferred. They should be decorated with fillets and the like, and their horns and hoofs with gold or silver rings. The sthapati, clad in fresh garments, and adorned with garlands of flowers, waits the auspicious moment to present his offerings to the deity, and then, guiding the oxen, draws the first furrow. After this, sudras,* hired for the purpose, complete the ploughing of the whole ground. A minuter description of the plough is contained in the first section of the Cāryapa, the insertion of which may not be irrelevant in this place, as affording some proof that, how rude soever this useful implement of the Hindú husbandmen of the present day may appear, it has been originally constructed on principles derived from no slight knowledge of mechanical laws. The author says, \"the plough should be made from the wood of any species of milky trees, such as are used in sacrifices, and according to the prescribed form; let the beam be three hastas long, with a projection of seven angulas from the yoke, and its bottom six angulas broad, four thick, tapering gradually from the lower to the higher end, with a slight indenture about the middle. The inverted piece at the lower end of the stilt or handle should be nine angulas long, two broad, and one and a half thick. The mould-board should be twenty-four angulas long, and its height above the beam, five. Let a head be fashioned in the bosom of the mould-board, of fourteen angulas in length, and the remainder of the inverted piece may be said to be taken up by the hole in which the beam and the handle are joined together. Let the mould-board be six angulas broad and four thick, with a point shaped like a pin, and gradually diminished towards the front; three times five angulas are said to be the interval between the beam and the fore end of the mould-board, to which the coulter should be fixed. The yoke pole is equal in length to the beam, with holes at both ends, and a leathern strap attached to each, of two hastas in length, and of the thickness of the little finger.\"\n\n* Men of the fourth class.\n\"Having yoked the oxen,\" continues the same author, \"a little more to the right than to the left of the pole, or towards the right hand of the driver, and having recited the appropriate prayers, let furrows be drawn towards the east or west, the grass being plucked out in the first instance. Let sesamum seeds, pulse, and kidney-beans be sown, with incantations pronounced over them, and let due reverence be paid to the spiritual teacher, and the oxen and the plough to which they are attached presented to him. When the crops are matured, and the flowers in bloom, let them be grazed on by cattle, and let cows remain on them for one or two nights. The ground will become purified by the froth flowing from the mouths of the cows, and by their ordure, after which you may commence building in the centre thereof.\"\n\nThe next thing of seeming importance treated of by Hindú architects, is the mode of ascertaining the cardinal points by means of a gnomon. It is indispensably necessary that all the quarters should be distinctly and precisely marked on the spot on which buildings are to be erected, for the purpose of giving them an suspicious aspect, and of preventing their being opposite to any of the intermediate points, which are declared to be inauspicious. The sixth chapter of the Mánasátra is exclusively devoted to this subject, the fifth containing directions for performing certain religious rites to propitiate the presiding deities of the soil. The first section of the Cásyapa combines both these topics, and the fifth of the Muyúmata corresponds with the sixth of the Mánasára; but the portions of the manuscripts which are in my possession are so imperfect from the causes before noticed, that the whole taken together, conveys but a very imperfect idea of the subject treated on, and recourse has therefore been had to other sources to supply the defect.\n\nThe mode of ascertaining the points of the compass by the shadow of a gnomon is extremely simple. \"On a smooth level piece of ground is erected a gnomon,\" which according to some, \"should be of sixteen angulas in height, and of the same diameter at the bottom; the whole should\nbe shaped like the leaf of an opening bud, tapering gradually from the bottom to the top.\" \"Around this a circle is drawn with a cord of twice the height of the gnomon, by fixing one end of it to its base and carrying the other around it. Points are marked in the circumference where the shadow of the gnomon projects, both in the forenoon and afternoon, that is at any given hour after sun-rise, and at the same time before sun-set; and between these points a right line is drawn so as to join them; the point marked by the morning shadow will shew the east, and that marked by the evening shadow the west. Then, from each of these two points, and with a radius equal to the distance between them, describe two more circles cutting each other, and resembling (in their points of intersection) the head and tail of a fish, between which draw a right line, which will point to the south and north. Again, from the southern and northern points, which touch the circumference of the inner circle respectively, and with the same radius, describe two more circles, and the points of intersection on the two other sides will indicate the east and west.\" The text goes on with repeating a similar process for ascertaining the intermediate points. Some treatises require the first circle to be described around the gnomon,\nnot previous to making the morning and afternoon shadows, but afterwards; and in this case, the shadow being marked in the first instance, the circle is described from the centre of the gnomon, with a radius equal to the length of the shadow, plus half the diameter of the gnomon.\"\n\nVarious rules have been laid down for the purpose of rectifying the variation of the shadow owing to the irregularity of the sun's motion in the ecliptic, the simplest of which seems to be as follows: The place where the shadow of the gnomon projects, on two successive days at the same hour, being marked, the difference between those two days, is taken as the variation of the shadow for sixty ghaticas or twenty-four hours. The interval between the times at which the western and eastern points were marked on the preceding day is multiplied by the difference of the shadow measured for one day, and the product being divided by sixty ghaticas, the result will give the difference of the shadow for the given time; it will then be only necessary to remove the eastern or western point so far towards the south or north, according as the difference of the shadow on the second day may be in either of those directions, or as the sun is in the southern or northern solstice.\n\nAnother rule for finding the true points is given in the Surya Sid'dhánta. \"But, in consequence of the precessional variation of the times of the shadow marked in the east and west of the circle, the difference in the sine of the declination between those times, being multiplied by the hypotenuse of the shadow at either of those times, and the product divided by the cosine of the latitude, the quotient will give the angulas; remove the western point so many angulas in the opposite quarter of the sun's declination, and the eastern point will become due east; or else, according as the sun is in the northern or southern solstice, the eastern point may be removed the same distance in that direction.\"\n\n\"Having marked,\" says the commentary, \"a point in the middle of a level piece of ground, from that point, and with a radius equal to the length of the shadow projected at the third ghatica after the sun's rise, plus half of\nthe diameter of the gnomon (because the shadow is measured from the circumference of the gnomon), let a circle be described, and in the centre of it let a *sanc'hu* be erected, of twelve *angulas* in height and of the same diameter: mark points where the shadow falls before and after noon on the east and west of the circumference; then having computed the sines of the declination three *ghaticas* after sun-rise, and three *ghaticas* before sun-set, multiply the difference between these two sines by the hypothenuse of the shadow at the third *ghatica* after sun-rise, and the product being divided by the cosine of the latitude of the place, the quotient will give the *angulas* or their integral parts. Then remove the eastern point so many *angulas*, &c. according as the sun is in the south or north latitude; by this means all the points of the compass may be rectified.\"\n\nPassing over several sections of the *Mānasāra* which are not immediately connected with the main purpose of this essay, and reserving one or two of them for future consideration, we now come to the thirteenth and fourteenth, which treat of pedestals and bases.\n\nThe Hindū orders may be said to consist of four principal parts, namely, the *upapitha* or pedestal, the *athisthāna* or base, the *sthamba* or pillar, and the *prasṭāra* or entablature. Western architects consider the base, not as a distinct member, but as a constituent part of the column; and this is not altogether at variance with the practice of the Hindū architects, for they likewise include the base and capital in taking the height of the pillar, and even consider the pedestal as a necessary part of the order. However, the latter invariably treat of a pedestal and base as separate bodies, as they are sometimes employed without pillars. These several members of the order have also been subdivided into various inferior parts, and the whole are curiously compared to the several parts of the human body, in all which particulars a striking similarity may be perceived between the Indian and European systems.\n\nThe two first members now under consideration derive their names as *upapitha* and *athisthāna*—the former from *upa*, under, and *pitha*, a seat or\nbench, and the latter from athi, upon, and stha, to stand. Both are for the most part composed of the same mouldings; but the most remarkable feature in which they differ is the square dye, which is peculiar to the former. The pedestal is not only placed under the base of a column or pilaster, but frequently employed, both singly and together with the latter, as a pavement for temples and porticoes, over cornices of edifices consisting of several stories in height, and also as a platform for thrones, and as seats for statues. In the latter situations especially, their decorations will be found to have employed much of the skill of the Hindú artists, and the most finished specimens of them may be justly said to surpass anything of the kind in the Grecian or Roman orders, both in the beauty of their proportions and richness of their ornaments.\n\nThe several mouldings which enter into the composition of pedestals and bases are, 1. upána; 2. campa; 3. gal'a, can'tha, griva, or candhara; 4. uttara; 5. vajina; 6. prativajina; 7. pat'tica; 8. álinga; and 9. antarita; all which are of a quadrangular form: and 10. cumuda; 11. padma; 12. capóta, &c., which are circular. And as these mouldings frequently occur in the description of the several sorts of pedestals and bases which will be presently exhibited, a brief notice of their respective forms and uses, as well as of their correspondence with the mouldings of similar members in western architecture, may not be a useless preliminary, especially, as it may tend to the disclosure of any mistakes into which I may have fallen, in identifying the mouldings described in books, with those found in the existing models of the art, the technical terms above-mentioned being no longer in use. (See Plate I.)\n\nTo begin, then, with the circular mouldings: the section of that which is called cumuda (10), literally nymphæa esculenta, is a semicircle projecting from a vertical diameter, and corresponds with the astragal, bead, or torus of the Grecian orders. It is chiefly employed in bases and cornices.\n\nThe moulding called padma, (11) literally lotus, is supposed to resemble a petal of that flower. It is a sort of compound figure, partly convex and\npartly concave; and its section is composed of two opposite curves, meeting at the bisecting point of a line drawn between the points of recess and projection, and very much resembling the *cima recta* and *reversa* of the western architects. This moulding is distinguished into greater and less, and forms the principal ornaments of Indian architecture. It is generally employed in detached pairs, in bases and cornices, one facing the other in opposite directions, and is formed upright or the reverse according to its situation, either as a crowning member of the former or the supporting ornament of the latter. The concave part of it, when placed with its bottom reversed, is often so designed as to project forward or rise up, after having touched, as it were, the fillet below, with a small perpendicular curvature, resembling in shape the petal of the lotus, with its pointed head somewhat inclined towards the top. In some specimens, this moulding is placed at the base of columns, and looks very much like an *apophyge* or ogre of the Ionick and Corinthian orders, being formed either with a curved line having more or less convexity at the top, or with an upright tangent to the concave part below. It is sometimes made exactly in the form of an ovolo of the western architects.\n\nA *capotam* (12) is a section of moulding made in the form of a pigeon's head, from which it takes its name. It is a crowning member of cornices, pedestals, and entablatures. When employed in the latter, it often connects utility with beauty, in as much as the beak of the bird is so placed as to serve the purpose of a spout to throw off the water falling on the cornice. In this office it resembles, in some measure, the *corona* of the Grecian order.\n\nThe square members above-mentioned are nothing more than rectangular figures or parallelograms, differing from one another only in their degrees of altitude and projection. Of all the rectangular mouldings, a *campa* (2) has the least height, and its projection, though generally equal to its altitude, frequently varies according to the position of the principal members which it is employed to connect or to separate; and it answers in every respect, to the fillet or *listel* of the western architects.\nAn upána (1) corresponds exactly with the plinth, both in the import of the term and the purpose to which it is applied.\n\nA cantha, gala or griva, &c. (3) literally means the neck; and when employed in pedestals, it is made very high, and resembles the dado, but everywhere else it serves as a sort of neutral member, from which the projections of the rest of the mouldings are measured.\n\nA vájina (5) is distinguished from the campa, by the former having a greater projection than the latter.\n\nA pratívájina (6) is the same thing made in pedestals to answer to the vájina; its form, though generally rectangular, is sometimes, when placed in cornices, found to be externally a little more inclined to one side than to the other; and in this situation it very much resembles the cavetto.\n\nA pat'tá or pat'tica (7) signifies a band. It is often confounded with the moulding called vájina, especially in pedestals and bases, as it appears to be of the same form, to be used in the same situation, and to have the same height and projection with the latter; but when employed in architraves and friezes, its height and projection increase considerably.\n\nAn uttara (4) is used sometimes to signify the whole architrave, and sometimes to denote a particular member of the pedestal and entablature, called by the western architects corona.\n\nAn álinga (8) generally has the same altitude with the fillet, but a greater projection than it; and,\n\nAn antarita (9) has the same height with the álinga, but as much recession as the latter has projection. Both these members are placed alternately together, and when used, are always thus inseparably connected.\n\nOF PEDESTALS.\n\nHindú architects have invariably taken the dimensions of their pedestals from those of the bases to which they are attached; but as to the number of parts to be given to the height of pedestals, with reference to the number of parts contained in the base, there exists a multiplicity\nof contradictory rules. On this subject Mānasāra, our principal guide, expresses himself in so obscure a manner, that I must acknowledge my inability to understand him thoroughly. He, however, appears to prescribe a greater variety of heights and projections to pedestals than any other author. He divides the pedestals into three sorts, according to the magnitude of the edifices in which they are to be employed, and makes their height, if I understand him rightly, to consist of from one-quarter to six times the height of the base, and their projections as far as one-third of their own respective heights. But such a loose manner of prescribing rules for the dimensions of architectural members must be considered objectionable, and but little compatible with science and taste.\n\nIn a Tamil fragment of a manuscript, purporting to be a translation of Mayāmata, it is said—\"The height of the shaft or pillar is to be divided into four parts, and one to be given to the base, which may or may not be accompanied by a pedestal; and in the case where a pedestal is joined to the base, the height of the pedestal may be either equal to that of the base, or twice or three times as much.\" Here, the greatest height given to a pedestal, namely, \"three times\" that of the base, is equal to a little more than a third part of the highest column, which is not perhaps a bad proportion.\n\nAccording to Mānasāra, there are three kinds of pedestals; of which the first is called vēdibhadra, the second pratibhadra, and the third manchabhadra. Each of these are again divided into four sorts, making in all twelve, and each differing from the other in formation and in its ornaments, whatever may be its height in regard to the base with which it is connected. The remainder of this chapter is taken up with a detailed enumeration of the parts composing the different sorts of pedestals, but as I have marked the proportions in the designs themselves (Plate I.), it would be superfluous to specify them in this place. To enable the reader, however, to form a judgment on the original rules from which the drawings are made, the following extracts respecting the three principal kinds of pedestals are submitted.\nON THE ARCHITECTURE OF THE HINDUS.\n\n\"The height of the upapitha (pedestal) being divided into twenty-four parts, let five be given to the upána,* one to the campa,† twelve to the cantha,‡ one to the campa again, four to the pat'tica,§ and one to the campa above.\" This refers to the first sort of pedestal of the kind called védi-bhadra. Fig. 1.\n\n\"Divide the height of the upapitha into twenty-six parts, and let three be given to the upána, one to the campa, two to the padma,|| one to the campa, eleven to the cantha, one to the campa, two to the padma,¶ three to the capóta, one to the dinga, and one to the antarita.\" This refers to the first sort of the pedestal called pratibhadra. Fig. 5.\n\n\"Let the height of the upapitha be divided into thirty equal parts, give three to the upána, a half to the campa, three to the mahambuja, a half to the campa, two to the candhara, a half to the campa, a half to the eshudra-padma, two and a half to the capóta, two to the prativájina, eight to the gala, one to the uttira, a half to the campa, a half to the padma, three to the upper capóta, and two and a half to the dinga,\" &c. This refers to the first sort of the pedestal called manchabhadra. Fig. 9.\n\nThis chapter closes with rules respecting the projection of the highest and of the most prominent parts of the pedestal, &c. &c. in these words: \"The projection of the base or upána is equal to its height, or two, three, or four times as much more than its height; that of the padma is also equal to or twice as much as its height; and that of the cumuda or the capóta is always equal to, or something less than its own height. The padma should be ornamented with the petals of the lotus, the square fillets with forms of gems, blossoms, foliages, &c., and the cantha with figures of vyálas,** sinhas,†† or of leaves, flowers, and the like.\"\n\n* Plinth. † Fillet. ‡ Dado. § Platland. || Cima reversa.\n¶ Cima recta. ** A fabulous animal. †† Lion.\nOF BASES.\n\nThe height of a base is equal to either a half, three-quarters, or a whole diameter of the shaft. When placed under pillars of an inferior sort, in porticoes and the like, and without a pedestal, its height is stated to be one-fourth, or one-third of that of the whole pillar. To bases, or rather basements, raised under pilasters in vimānas, &c., Mānasāra gives twelve different heights, to be used in so many different stories one above another; the first height consisting of thirty angulas, and the last of four hastas, each of the intermediate ones being increased in the proportion of six angulas. The same author also prescribes the heights of pedestals to be constructed in the houses of the several classes, as follows: Brahmans should have them of four hastas; C'shetriyas, of three; Vaisyas, of two; and Sūdras, of one hasta. The remaining parts of this chapter enumerate, at much length, the proportions of the component parts of no less than sixty-four different sorts of bases, under various denominations, as prati bandha, ecabandha, prati-crama pushpapushacala, sribandha, manchabandha, srēnibandha, &c. &c.; but as it would be extremely tedious to repeat in detail the measures of the different members of each sort, I pass them over here, referring the reader to Plates II. and III., which contain designs of twenty-eight sorts of bases, with the heights and projections of all their parts therein notified.\n\nOF PILLARS.\n\nThe fifteenth chapter of the Mānasāra treats of the several sorts of pillars, their various dimensions, forms, and ornaments, as does likewise the ninth section of the Cāsyapa: the two together seem to afford all the requisite information on this head. \"The height of a pillar,\" says Mānasāra, \"when placed on a base only, or both on a base and pedestal, is measured from the plinth (of the former) up to the lowest part of the entablature,\" that is, from the base to the capital inclusive. A passage in the Cāsyapa states, that the measurement may also be taken from the cimbia\nof the shaft, exclusive of the base. \"Let the height of the pillar,\" continues the first-mentioned author, \"be divided into twelve, eleven, ten, nine, or eight parts, and one be taken for the breadth of the foot of the shaft; and the same being divided again by the number of parts of which the height of the pillar may consist, let the upper extremity of it be diminished by one of those parts respectively.\" \"The height of the pillar,\" says Cāsyapa, \"may be three times that of the base, or six or eight times that of the pedestal; the breadth of the pillar may be a sixth, seventh, eighth, ninth, or tenth part of its height; if it be made of wood or stone, one-third, or one-fourth, or one-sixth of the height if it be a pilaster joined to a wall (cudyastambha).\"\n\nVarious names are given to pillars, by way of distinction, with regard to their forms: \"A square pillar is called brahmacánta; an octangular one, vishnucánta; that which is circular or has sixteen sides, rudracánta; that which has five sides, sivacánta; and that which has six sides, s'chandacánta.\" The whole shaft may be of the same form, or in pillars of other forms, than square; the bottom, middle, and top may be quadrangular, and the intermediate spaces of other forms. \"If the whole shaft from bottom to top be uniformly cylindrical and devoid of ornament, it is called chandracánta.\n\nA minute technical description is here given by the two authors above-mentioned, of the various ornaments with which the several sorts of pillars are adorned, but as an accurate idea can be formed of them only by ocular observation of these decorations, it has been deemed unnecessary to follow our text too closely on this subject. It may, however, be useful to take a general view of the different kinds of pillars and their ornaments as described by Mánasára, illustrating them by designs, partly taken from his descriptions, and partly from the models found in temples and porticoes of a pure Hindú style.\n\nPillars of Indian architecture may, with respect to the dimensions, be divided into seven sorts.\nON THE ARCHITECTURE OF THE HINDUS.\n\nThe first sort* is a column six diameters high; it is rarely made but upon a high base and pedestal. The entablature is more than half the altitude of the column; and the intercolumniation generally four diameters. The pedestal is of the second sort of the pratibandha kind, see Plate I.; and its height is equal to that of the base, which is one-third of that of the column itself, or two diameters. The base is called manchabandha, and is divisible into thirty parts. The capital is equal in height to the upper diameter of the shaft, and its projection is equal to its height. The form of the capital is called pushpabandha. \"The height of the capital,\" says Mánasára, \"may be either equal to the breadth of the shaft, or one-half or three-quarters of it, according as it may appear proportionate to the size of the column.\" Let the breadth of it be either one, one and a-quarter, half, or three-quarters of the diameter.\" I cannot find in any of the authors a description of this capital, and it is only mentioned by name by Mánasára and others. I have given the design of it from the specimens found in buildings in the vicinity of Madras; and the artists call it in Tamil pútaleibódicai, literally \"flower-headed capital.\"\n\nThe entablature placed on this column does not differ from that placed on other pillars, except, perhaps, in the height, which I have already stated to be very great. On this subject Mánasára observes generally, \"The whole height of the entablature may be either three-quarters, one, one and a-quarter, one and a-half, one and three-quarters, or twice that of the base.\" \"The height of the entablature may be a half, one-fourth, or three-quarters of that of the shaft.\" \"Or the height of the pillar being divided into eight parts, six, five, three, or two may be given to that of the entablature.\" \"The height of the entablature is measured from the architrave up to the corona.\" Its form will be described in another place.\n\n* In the following description of pillars every member belonging to an order is considered, and particularly the entablature, which is made the subject of a distinct chapter in the Mánasára.\nON THE ARCHITECTURE OF THE HINDUS.\n\nThe second sort of column is seven diameters in height; it is placed in most examples upon a base and pedestal; the base is two diameters high; it belongs to the species called cumbhandha. (See Plate II.)\n\nThe pedestal is equal in height to three-fourths of the base, and is of the kind called védibadhra (Plate I.) The column is also placed, as may be seen in another design (Plate IV.), only on a pedestal which is equal to half the height of the pillar, and which is one of the sorts called munchabhadra. The capital given to the first design of this pillar is taken from a model found at Tiruvattir, near Madras; it is the same which Mánasára and others call tarangabódhica, and is one diameter high and projects equal to its height. Speaking of this sort of capital, Mánasára says, \"it should be decorated with tarangas* and other appropriate ornaments; the height of the capital being divided into twelve parts, let the form of tarangas occupy three of them, let the bódhica (capital), which should resemble the cobra de capello, occupy six, and adorned with flowers and the like, and let one part above this be given to * * * *,† one to the cima, and one to the listel. The projecting part of the bódhica should be fashioned like the stalk of a plantain flower. At the upper extremity are the tarangas, of equal height or something more. The lower part of the head of the bódhica is one-third of the upper in breadth, and a third of the former being divided into five parts, one of them is given to the cavetto, one to the fillet, two to the cima, and one to the listel: and the whole should be decorated with foliages, rows of gems, and the like.\" In another place the same author says, \"Let the capital (bódhica) be made to consist of one, two, three, four, five, or six faces, according to the situation in which it is placed.\"\n\nThe other form of capital given to the column in the second design, is taken from a mantápa at Maylapúr. It is to be met with in many other\n\n* Literally waves, a term applied to denote the projecting moulding employed in capitals, terminating by a number of undulating lines. See Plate IV. fig. 2.\n† Here a word in the original manuscript is not legible.\nancient buildings, and is what the artists call in Tamil surul-bódhica, roll capital. I cannot find any particular description of it, except a passage in the Mánasára, which says, \"the projecting ornaments on the sides of the capital are made either in the form of an inverted apex or of a chacra, wheel, or circle.\" It is one diameter in height, and projects but three-quarters of the diameter.\n\nThere is not any particular rule respecting the intercolumniation of these or any other sorts of pillars; but in porticoes, where these pillars are found, the space between one column and another exceeds three diameters. The general rule laid down in the Mánasára is this: \"The intercolumniation may be either two, three, four, or five diameters; it is measured in three ways, 1st. from the inner extremity of the base of one pillar to that of another; 2dly. from the centre of the two pillars; and, 3dly. from the outer extremities of the pillars including the two bases.\" The latter method of measuring the intercolumniations is, I am inclined to believe, applicable to the pilasters in gateways or temples only, not to simple colonnades.\n\nThe third sort of column, with its base and capital, is eight diameters high, with a diminution of the shaft at the top of the eighth part of the thickness at its bottom. The base occupies half a diameter, and this height is to be divided into ten parts; two to be given to the plinth, one to the fillet; three to the cinacia and its fillet, one and a half to the cavetto, the same to the torus, and one to the cimbia. The whole projection of the base is half of its height. The following passage from the Mánasára refers to this kind of base: \"Let a base ornamented with the lotus be made under the foot of the pillar, one or two diameters in height, and let it be adorned with figures of demons, lions, and the like.\"\n\nThe height of the capital, which is made after the manner of the p'hállica* is three-quarters of the lower diameter of the column, and is\n\n* The forms of this ornament may be seen in Plate VI.\ndivided into thirteen parts; two are given to the abacus, one to the fillet, two to the madana,* seven to the cimarecta, and one to the cimbia. The upper part of the shaft, about one and a half diameters below the capital, being divided into twenty-four parts, three are given to the collarino with its fillet, three to the ovolo, three to the lower collarino, five to the lower torus with its cimacia, and ten below to the strings of pearls (muctadháma).* The projection of the capital is one diameter, or about an eighth part beyond that of the lowest part of the base; the fillets project the full, and the torus three-quarters of their respective heights.\n\nThe height of the entablature is one-fourth of that of the column. It is to be divided into twenty-one parts, eight are given to the architrave, seven to the cornice, and six to the vyálam.† Of the eight parts of the architrave, one is to be given to the cavetto, three to the tema or benda (uttara) with its listels, two to the cimarecta, and two to the upper facia (vájina). Of the seven parts of the cornice, one occupies the fillet, and the remainder the ovolo (prastara); and of the six parts of the cornice, three to be given to the cavetto, two to the pratívájina, and one to the fillet. The projection of the vájina‡ of the architrave is equal to that of the capital, that of the prastara is twice as much, and that of the cornice equal to its own height. After making a similar division of the entablature, our author lays down the following rule respecting the projection of the members. \"The height of the architrave being divided into four, five, six, seven, or eight parts, one should be given to its projection beyond the pillars. The capóta§ projects equal to its height, or to three-fourths of it, and the vájina one-fourth.\" \"The álinda recedes about one diameter, and the antarita projects equal to its own height, and the same may be said of the prati.\"\n\n* The forms of this ornament may be seen in Plate VI.\n† A moulding used above the cornice, and which takes its name from being generally ornamented with the figures of the animal called syála.\n‡ A square moulding so called.\n§ The projecting member of the cornice.\nThe fourth sort of column is nine diameters high. The base is one of those called *pratibhadra*, and is one diameter in height. It is without a pedestal.\n\nThe base is to be divided into eighteen equal parts, two to be given to the plinth, one to its fillet, three to the cimarecta, three to the cavetto with its listel, three to the torus, three to the upper cavetto, two to the platband, and one to the cimbra. The projection of the plinth is one-third of the height of the whole base; the torus and the platband project equal to their respective heights.\n\nThe upper ornaments of this column occupy two diameters, and the capital takes three-quarters of the diameter, which is to be divided into ten parts: two to be given to the abacus, which projects half a diameter, one to the strings of pearls, one to the fillet, four to the cimacia, and one to the circular cimbia. The ornaments under the capital are to be divided into sixteen parts: of which give two to the cavetto or collarino, one-and-a-half to the cima, four to the torus, which projects perpendicular to the plinth, or three-quarters part of its height; one and a-half to the lower cima, three to the lower collarino, two to the astragal, which projects equal to its own height, and two to the third cima and its fillet, below which a space equal to three diameters is taken up by strings of pearls, but which are omitted in some columns of a similar description.\n\nThe fifth sort of column is ten diameters high, including the base, which ought to be three-quarters of the diameter. It should be divided into twelve parts: two for the plinth, whose projection is a fourth part of the diameter, one for the fillet, four for the cima, and one-and-a-half for the cavetto, one for the lesser cima, one-and-a-half for the torus, and one for the cimbia. The projection of the cima and torus is equal to their respective heights. This column is sometimes erected on a high pedestal, which is about a third part of the height of the pillar.\n\nThe height of the capital, which is called *pushpabandha*, is equal to the upper diameter of the column: its projection on the sides is equal to its\nheight, and the middlemost square is ornamented with the petals of a lotus. \"The altitude of the capital,\" says Cāryapa, \"may be equal to the higher, lower, or the middle diameter of the column. Its breadth may be equal to its height, or four or five diameters.\" \"A capital the height of which is from one to two diameters, and the breadth twice its height, is of the superior sort; and that which in height is half the diameter, and in breadth from one to three diameters, is of the inferior sort.\"\n\nIn colonnades of porticoes, the intercolumniations are found to be from one diameter and a half to two diameters.\n\nThe sixth sort of pillar is eleven diameters high. The design made to illustrate this is selected from among the pillars found at Canjeveram; it represents a square pillar of the same height, exclusive of the base, which is composed of a plinth, a cimarecta, and torus, with their fillets, and is one diameter high. The same pillar, including the base, may be taken as an example also of the seventh sort, which ought to be twelve diameters in height.* \"When the pillar,\" says Cāryapa, \"is measured in height from the upper fillet of the base it is called nigata-stamb'ha, but when it is measured from the plinth below it, is termed nichata-stamb'ha.\"\n\nAt the foot of the shaft, a space equal in height to the hypothenuse of the lower diameter is made quadrangular, around which are sculptured images of the deities, and the like, in bas-relief. In about half a diameter above this, is made the ornament called nāgaband'ha.† The remainder of the shaft, about three diameters and a half, is made to consist of eight sides, including the strings of pearls, which occupy three-quarters of a diameter, and appear to be suspended from the fillet of the upper ornament called padmaband'ha,‡ which takes up half a diameter. Next above this is the calasa or water-pot, about three-quarters of a diameter; and above this\n\n* See Plate VI.\n† A sort of moulding made in the form of a serpent.\n‡ A moulding made in the form of a lotus.\nare made, with the same height given to them, three other mouldings, called in the language of architecture, herica, asya, and tatica, which last projects a fourth part of the diameter. Above these again is the lower collarino, in height about a quarter of a diameter, then the ornament called cumb'ha, which is half a diameter high and projects as much; next the upper collarino, a little less than the lower one; next the moulding called p'halaca, which is one diameter high, and projects equal to its height; next the third collarino, about three-fourths of a diameter; and last of all, the capital of the kind called pushaband'ha, which has already been described.*\n\nThis pillar may, according to the definition of its form, be called vishnu-cánta, and appears in most of its ornaments, though not in their proportions, to agree with the description given by Mánasára of that which he called pślicástambha. He says, \"the height of the collarino (viracant'ha) should be one diameter of the column; that of the p'halaca, one, three-quarters, or two or three diameters, and its projection one-fourth of its height. The height of the cumb'ha below the collarino may be half, one-and-a-half, or two diameters, and its breadth equal to the upper or lower collarino. The height of the táticasya† is half, or three-quarters of the diameter. Let the lower cima be equal to its height, and let its breadth be one-and-a-quarter diameter. Below that comes the herica† of half that height. The height and breadth of the tática are equally one diameter. Below that let a calasa (water-pot) be made about two diameters in breadth, and let the upper part of it be shaped in the form of a durdhura flower, and in such a manner as may appear graceful. Below this, about three-quarters of the diameter should be decorated with strings of pearls.\n\nBesides the model referred to in the above description, Plate XVI. contains three more designs of pillars, which may also serve as specimens of those of the seventh sort, so far at least as their dimensions are concerned. The pillars which they represent are to be seen in a portico at Tiruvana-\n\n* See page 30, and Plate VI. † See Plate VI.\nmalei, but I cannot find anything in the description of pillars contained in the books under examination, like the works sculptured on the shafts of these models. They are probably modern improvements, and their workmanship, like that which adorns the pillars at Madura, may be attributed to the skill of the artists of the day. The same may be said of the double pillars which support a beautiful portico at Canjeveram, and on which are sculptured, in alto relief, lions and horses standing upright the full length of the columns; the former treading on elephants, and the latter mounted by armed knights. See Plates XVII. and XVIII.\n\nThe pillars at Tiruvanamalei are estimated to be about thirty feet high, with proportionate thickness, diminished at the top by a twelfth part of the lower diameter. There are three kinds of them. The first is placed on a high pedestal and base: the whole shaft is divided into ten compartments, each being equal in height to the hypotenuse of the diameter of the pillar; and on all the four sides of these compartments are sculptured, in relief, four small pillars or pilasters supporting an entablature. The second pillar differs from the first in having two, instead of four, small ornamental pilasters in relief, on each side of the ten compartments into which the shaft is divided, with an ornamented niche in the middle, which in the third specimen is flanked by two small pancharas or ornamented cages on both sides of it. The second sort of pillar is placed on a base without a pedestal, and the third on a pedestal without a base. See Plate XVI.\n\nHaving taken the preceding general survey of the several members connected with the orders of Indian architecture, it was my intention to submit a few remarks on such of the orders now in use in modern Europe, as have any correspondence with those of India; but being destitute of European books which treat directly on this subject, I confine myself to the Egyptian, Grecian, and Roman, and to them only with regard to a few leading particulars.\n\nThe difference in the Indian orders, consists chiefly in the proportion between the thickness and height of pillars; while that of the Grecian and\nRoman orders depends, not only on the dimensions of columns, but also on the form of the other parts belonging to them.\n\nConcerning the proportions of columns, the second sort of column in the Hindú architecture may be compared with the Tuscan, the third with the Doric, the fourth with the Ionic, and the fifth with the Corinthian or Composite pillar. This affinity between the columns of India and of Rome and Greece is so striking, that one would be apt to ascribe it to something more than mere chance, but there are other columns in the Indian architecture, not only one diameter lower than the Tuscan, but from one to two diameters higher than the Composite.\n\nThe Egyptian columns appear to have no fixed proportion in regard to thickness and height. In some of the specimens of the ruins of Upper Egypt, the height of the columns consists of from four to six times the lower diameter, which last proportion coincides with that of the first sort of the Indian pillar.\n\nThe orders of India, and of Greece and Rome, are remarkable for the beautiful effect of their proportions, a circumstance to which little regard has been paid by the Egyptians.\n\nBoth the Indian and Grecian columns are diminished gradually in their diameter from the base to the summit of the shaft, a practice which has never been observed in the Egyptian; on the contrary, a diametrically opposite rule has been observed in their shafts, which are made narrower at the bottom than at the top, and placed upon a square or round plinth.\n\nThe proportion in which the diminution at the top of the columns of the two former is made, seems to have been regulated by the same principle, though not by the same rule. The general rule adopted by the Hindú architects in this respect, is, that the thickness at the bottom, being divided into as many parts as there are diameters in the whole height of the column, one of these parts is invariably diminished at the top; but in the Grecian and Roman architecture, the diameter of the upper part of the shaft, in a column of fifteen feet in height, is made one-sixth less than its\nthickness at the base; and in a column of fifty feet, the diminution is one-eighth. The higher the columns are, the less they diminish, because the apparent diminution of the diameter in columns of the same proportion, is always greater according to their height, and this principle is supposed to have been discovered with great scientific skill, and is adduced as one of the proofs of the highly refined taste of the Greeks; but we observe, that precepts derived from the same principle have been taught and practised in India from time immemorial.\n\nThe plan of the Grecian and Roman columns is always round; but the plan of the Hindú columns admits of every shape, and is frequently found in the quadrangular and octangular form, and richly adorned with sculptured ornaments. The form of the Egyptian pillars too, is circular, and their shafts are often fluted like the Corinthian, but the fluting of the Indian columns resembles neither the one nor the other. The decorations of the Egyptian columns often consist in representations \"of a bundle of reeds\" tied up with a cord on the top, having a square stone placed over it; in some specimens are also found bindings or fillets in various parts of the shaft, and in the interval between them, reeds and hieroglyphics are represented. But there is nothing like these ornaments in the Indian orders, except in the columns found in the excavated temple of Elephanta, and some other places, and which differ materially from those employed in other situations in Hindústan.\n\nThere are no fixed intercolumniations in the Hindú architecture, as are found in the Grecian, but the spaces allowed between pillar and pillar in different Hindú buildings, are found nearly to coincide with the Grecian mode of intercolumniations, though in too many instances they differ widely from it, and the same may perhaps be said of the Egyptian colonnades.\n\nThe Indian pedestals and bases are made more systematically, and afford by far a greater variety of proportions and ornaments, than the Grecian and Roman. In the European architecture, the forms and dimensions of the pedestals and bases are fixed by invariable rules, with respect to the orders\nin which they are employed; but in the Indian, the choice is left to the option of the artists.\n\nThe capitals of the Grecian columns invariably mark the distinction of the several orders: those of the Indian are varied at pleasure, though not without regard to the diameter and length of the shaft; and the forms of the plainest of them, though they have in reality nothing in common with the Grecian order, are found at a distant view to bear some resemblance to the Doric and Ionic capitals; but those of a more elaborate kind are sometimes so overloaded with a sort of filligree ornaments, as to destroy the effect of the beautiful proportions of the whole. The Egyptian capitals, on the other hand, are formed into elegant vase shapes, decorated with the stalks, leaves, and blossoms of the lotus, and occasionally with palm leaves, which latter ornaments are supposed to have given the first idea of the Corinthian capitals. And in some specimens, the Egyptian capital is composed of the representation of the head of the goddess Isis.\n\nThe entablature of the Indian order admits of little variety, as well in its composition, as in its relative proportions, whereas the same member in the Grecian and Roman architecture, is varied for each order both in form and magnitude. The massiveness of the Indian entablature offers a striking contrast to the lightness of the Grecian; but the richness of the former may be said to be unrivalled.\n\nIn the existing treatises on Hindú architecture, no mention is made of any thing like a substitution of human figures for columns to support the entablature, but the shaft is directed to be adorned with the figures of demons and animals; yet various examples are to be met with in which human figures, as well as representations of animals, are employed in bold relief in the sides of pillars in temples and porticoes, but by no means like those found in Egyptian architecture. The antiquity of this invention in India is not determined, but the Grecian architects refer the origin of their caryatides to the commemoration of their captivity of the Caryan women, while others assert that it was derived from an Egyptian source.\nON THE ARCHITECTURE OF THE HINDUS.\n\nWe now return to the ninth chapter of the Mānasāra, which treats of villages and towns, and this being made to appear as belonging to architecture, inasmuch as it regards the formation of streets and the allotment of suitable sites for the building of temples, piazzas, &c., I beg leave to subjoin a few extracts from it, trusting that the rules which they contain will serve to trace out the principles upon which a Hindú village or town is built, and that they will not be altogether uninteresting to those who delight in Indian antiquities.\n\n\"The extent of villages or towns is declared to admit of forty varieties, consisting of from five hundred to twenty thousand dandás square, each sort exceeding the one immediately below it by five hundred dandás. The whole area of a village, with the lands thereunto belonging, being divided into twenty equal parts, one is assigned for the occupation of Brahmans, six or more for that of the three other classes, and the remainder for agriculture.\"\n\n\"A street that goes round the village or town is called mangalavūhi, which should be from one to five dandás in width. That which runs from east to west is called rājapātha; that which has gates on both sides rājavūhi; that which has sandhis or angles, sandhivūhi; and that which is in a southerly direction, mahācala or vāmana.\"\n\n\"Previously to building villages, towns, &c., let the sthapati trace upon the ground selected for the purpose, any of the mystical figures described in the seventh chapter, and particularly that which is called paramasāyica,\"\n\n* The seventh chapter of the Mānasāra describes certain mystical figures which are traced on the ground plan of villages, &c. for the purpose, not only of offering oblations and sacrifices to the divinities who are supposed to preside over their various parts, but also of dividing the area into several compartments, to be applied, according to their supposed fitness, to the building of temples, and the formation of high roads, streets, &c.; to each of which purposes the part over which a certain deity presides is considered more adapted than any other. An enumeration of the several figures, and of the deities presiding over their various parts, would however be little interesting or instructive to the European reader.\nand after offering the prescribed sacrifices to the deities presiding over its various parts, let him proceed to arrange the streets, and mark out sites for building temples, &c., according to the rules laid down in the Sūstras.\"\n\n\"There are eight sorts of villages or towns, namely, 1. dandāca (that which resembles a staff); 2. sarvatbhadra (in every respect happy); 3. nandyāvarita (the abode of happiness); 4. padmaça (that which has the form of a lotus flower); 5. sivastica (that which resembles the mystical figure so named); 6. prastara (that which has the shape of a conch); 7. cārmaça (that which resembles a bow); and 8. chaturmuc'ha (that which has four faces).\n\n\"The village called dandāca is quadrangular, and surrounded by a square wall. It consists of from one to five parallel streets, running in one direction, generally from east to west, and of two more streets forming right angles at both the extremities of the five parallel streets, and also of a third crossing the middle of them. The breadth of the streets is from one to five dandās, and the middlemost may be made broader than the rest. The streets at the extremities or near the walls have a single row of houses; the centre streets a double row, or one on each side. The space occupied by each house should be from three to five dandās broad, and from two to four dandās long. There should be four large gates, one on each side of the enclosing wall of the village, and as many smaller ones at the several angles. In the part presided over by Varuna or Maytra, should be erected a temple for Vishnu; and in that presided over by Adita, at the north-east angle, one dedicated to Siva; a shrine, for Chamunda,* should be built near the north gate without the wall. There should be two tanks† or reservoirs, one towards the south-west and the other towards the north-east. This village\n\n* The goddess of destruction, a form of Bhavani.\n\n† The south of India is famous for the beautiful workmanship of its reservoirs, which are generally very spacious, and completely lined with stone, furnished with steps, and ornamented with pavilions, &c.\nON THE ARCHITECTURE OF THE HINDUS.\n\nis particularly intended for the residence of Brahmans. It may contain twelve, twenty-four, fifty, one hundred and eight, three hundred or more houses. The smallest, or that which contains twelve houses, is called āśrama, hermitage, and ought to be situated near mountains and forests, for the habitation of hermits. The village containing twenty-four houses is to be situated on the banks of a river, and inhabited by yatis or holy mendicants: it is called puram. That which contains fifty houses should be occupied by those who have performed holy sacrifices, or by householders in general: in the former case, it is called puram, and in the latter mangalam. The village containing a hundred and eight houses is commonly called Cosṭham.\"\n\n\"The village called Sarvatōbhādra is also of a quadrangular form, containing in the middle a temple dedicated to any one of the triad, Brahma,* Vishnu, or Mahēswara. It has four streets of equal length on the four sides within the wall, meeting one another at right angles, and two more crossing each other in the middle. Between these may be formed three, four, five, or as many more streets as the extent of the village will admit on each side parallel to the middlemost street.\"\n\nHere several verses in the original bear allusion to the projections of some of the streets described above, but they are not sufficiently clear to be translated.\n\n\"Without the walls,\" continues our text, \"should be placed the shrines of the deities who preside over and defend the several quarters of the village; at the angular points should be erected halls, porticos, colleges, and other public edifices; and towards the quarter of agni (south-east), a water-shed for the accommodation of travellers and passengers. The whole village should be secured by a quadrangular wall, and a ditch around it, with four large and as many small gates, in the middle of the sides and at the angular points. Without the northern gate should be erected a temple\n\n* The worship of the representation of Brahma is very rare.\nfor the worship of Mahá Cáli, and the huts of the chandálas or outcasts should be a crosa* distant from the village. A tank or reservoir should be constructed either on the south or north side, or near either of these two points, for ablutionary and culinary purposes.\"\n\n\"The village called Nandyávartta, is either square or oblong. It is divisible into as many parts as are contained in the (mystic) figure called Chandita or Paramasáyica. The Chandita contains sixty-four equal parts, being the square of eight, of which the middle four parts are called Bráhmya, or those which belong to Brahma, and they should be entirely appropriated to sacred purposes. Around these are twelve parts called Divya, or those belonging to the Dévas; around these twenty parts called Mánushya, or those belonging to mortals; and around these again twenty-eight called Paysácha, or those belonging to demons. These several rounds should be occupied by different classes in the order of their superiority, that is Brahmanis † should have the Brahmya, and so with the rest. The figure called Paramasáyica contains eighty-one equal parts, being the square of nine, of which the middle nine are Brahmya; sixteen around these are Divya; twenty-four around these Mánushya, and the outermost thirty-two Paysácha. This village has four large streets along the inside of the wall by which it is surrounded, running in each direction at right angles; namely, one near the north-west quarter, passing towards the north-east, projects at a small distance beyond the cross street which intersects it; another opening from a little way within the projection runs forward in a south-east direction, and projects in the same manner beyond the intersecting street on that side, and the same may be said of the streets at the two other angular points. The number of streets in the outer compartment should be determined according to its extent, and in the\n\n* A crosa is equal to four thousand yards.\n\n† This is a contradiction of the preceding passage, which directs the middle parts called Brahmya to be appropriated to religious structures.\ncompartments called *Divya* and *Manushya* three or four more parallel streets may be made from east to west, with as many cross ones from north to south, forming as it were so many courts or enclosures. Two broad streets run through the middle of the village, from east to west and from north to south, cutting one another in the middle, where there should be erected either \"a temple for Brahma, or a *mantapa* for general meetings.\" At each of the angles of the outermost streets there should be a gateway ornamented with arches and the like. This village is of two sorts, which are also called the one *Mangalam* and the other *Puram*. The former is inhabited only by Brahmins, and the latter by all classes indiscriminately.\"\n\nIn this manner the author goes on describing the forms and arrangements of the remaining sorts of villages; but as the accompanying designs (Plates XLIII to XLVI) will, it is hoped, render the subject more intelligible, I shall close this article with one or two more extracts only, respecting the sites and aspects of temples, and regarding some other matters treated of in this chapter.\n\n\"The temples of *Vishnu*, in whatever form that deity may be worshipped, should be erected within the village facing towards the east, except in the incarnation of *Narasingha* (the Man-lion), whose temple should be built without the wall with its face turned from the village or town. That part of the figure which belongs to *Mitra,* *Bhallata,* *Arya,* or *Sauraya,* should be invariably assigned to the temple of *Vishnu*, but the shrine of *Siva* should be built in the compartments presided over by *Indra,* *Indraja,* *Rudra,* *Rudraga,* &c. If the emblem of *Siva* (Linga) is to be consecrated according to the *Siddhanta Agama,*† it may be placed\n\n---\n\n* Denoting certain compartments in the mystic figure before mentioned.\n\n† The title of a religious book held in high reverence by the followers of *Siva*, and which treats, 1st. of several species of charities, such as the building of a caravanserai, and digging of tanks and wells for the accommodation of travellers; 2dly. of religious duties diurnal and periodical, of the various kinds of sacraments, and of ceremonies propitious or expiatory, in which\nwithin the village; if otherwise, it should remain without. In the case of Vishnu too, if the idol is to be consecrated according to the system of Vayghánasa* it may be admitted within, but if according to the doctrines of Páncharátra† it should be placed without the village. The shrines of Durgá, Shanmucha,‡ and the objects worshipped by Jainas and Baud'dhas, should be erected without the village.”\n\n“Private houses or mansions may consist of from one to nine stories, but this is to be determined according to the rank of the persons for whom they are built. The lower classes of people must on no account construct their houses of more than a single story or ground floor; and the height of the buildings should correspond in every street, as far as practicable, and in all structures of the same number of stories.”\n\n“The front, middle, and back-door of a private dwelling-house should be so contrived as to be on the same level, and in the same straight line one with another. Let the outer door be placed, not exactly in the middle of the façade, but a little more to one side than to the other. The general practice is this: if the front of the house be ten paces in length, the entrance should be between five on the right and four on the left. The same rule is to be observed with regard to the gates of temples. In the front of the houses should be erected a vélica, or raised seat or pedestal on each side of the door.”\n\n“The gates and doorways of temples and houses of all classes of people should be from one hasta‡ and a half to seven hastas in height; the smaller doors, from one to five hastas; and the windows, from twelve angulas to one\n\n---\n\nwhich are included, the holy incantations wherewith temples are sanctified, and images of deities deified and adorned; and lastly, of the nature of the godhead and his attributes, of souls, elements, and other principles, and of contemplation, &c.\n\n* Two rival systems of religious rites and prayers observed among the followers of Vishnu.\n\n† The wife of Siva, an avenging goddess, and her son Karticáya.\n\n‡ This perhaps alludes to the height of a window, which follows.\nhasta and a half. The breadth of large gates should be equal to, or a little less than half of their height; or, the height of the door being divided into nine parts, five may be given to its breadth. The height of the door-frame being divided into seven, eight, nine, or ten equal parts, that of the void space should be equal to that of the door-frame, minus one part; a strict conformity to these rules will insure prosperity and happiness.\"\n\nA whole page after this is employed in enumerating the various sorts of gifts and donations to be made to the artists on the completion of an edifice, and finally in denouncing dire misfortunes to those who withhold such presents from them.\n\nThe next chapter professes to describe nāgaras or cities; but as it contains nothing farther than an enumeration of several sorts of cities and the various titles of particular princes who are qualified to reside in them, I shall omit it altogether. In order, however, that some idea may be formed of an ancient Hindū city, I subjoin the following extract from the first book of the Rāmāyana.\n\n\"On the banks of the Sarayu is a vast, fertile, and delightful country called Cīś'ala, abounding in corn and wealth.\" \"In that country is a city called Ayodhya, greatly famed in this world, and built by Manu himself, the lord of men. This great and prosperous city was twelve yojanas* in length and three in breadth, and stored with all conveniences. The streets and lanes were admirably disposed, and the high-roads were well sprinkled with water. In this city lived Dasarat'ha, the most potent of monarchs, even as Indra lived in Amaravati.† It is adorned with arched gateways and beautiful ranges of shops; it is fortified with numerous defences and warlike machines, and inhabited by all sorts of skilful artists. It was crowded with bards and musicians, filled with riches, and shone forth with unrivalled glory; it had\n\n* A yojana is equal to nine miles. † The capital of Indra, the regent of heaven.\nlofty towers stored with fire-arms and adorned with banners. It was constantly filled with female stage players; it was beautiful with gardens and groves of mango-trees, and enclosed with high walls. It was surrounded by impassable ditches, and secured by fortifications difficult of assault by foreign kings; it was full of horses, elephants, cattle, camels, and mules. It was ornamented with palaces of exquisite workmanship, lofty as mountains, and enriched with jewels, abounding with beautiful houses consisting of several stories, and it shone like Indra's heaven. It was crowded with tributary princes, purified with sacrificial rites, and filled with merchants of foreign countries. Its aspect had an enchanting effect; and the whole city was diversified with various colours, and decorated with regular avenues of sweet-scented trees. It was full of precious stones, and resplendent with stately edifices and beautiful apartments. It was filled with buildings erected close to one another, and without intermediate voids, and situated on a smooth level ground. It abounded in delicious rice, and water sweet as the juice of sugar-cane. It incessantly echoed with the sounds of kettle-drums, tabors, cymbals, and lutes; this city truly surpassed any that was ever beheld on earth. The houses which it contained resembled the celestial mansions which the Siddhás obtain through the virtue of their austerity.\"\n\nOf the remaining portion of the Mánásara, twelve successive chapters, from the eighteenth to the twenty-ninth, are entirely taken up with rules respecting the measurements, &c. of as many sorts of vimánas or pyramidal temples. The same subject is also treated of in several sections of the Cásyapa.\n\n\"A vimána consists, according to the former, 'of from one to twelve stories;' and according to the latter, 'of from one to sixteen stories;' and 'is made round, quadrangular, or of six or eight sides.' The form of the edifice may be uniformly the same from the basement up to the spire, whether it be square, oblong, circular, oval, or the like; or it may be of a mixed nature, composed partly of one and partly of another form.\"\nquadrangular temple is called nágara, an octangular drávid'ha, and a circular vásara.\"\n\n\"Vimánas are of three sorts, distinguished one from another by the principal materials of which they are formed, as sud'ha, pure; misra, mixed; and sanctirna, anomalous. An edifice is called sud'ha which is composed of but one kind of material, as stone, brick, &c., and this is considered the best of all. Misra is that which is composed of two kinds of materials, as brick and stone, or stone and metals; and sanctirna is that which is composed of three or more kinds of materials, as timber, stone, brick, metal, &c.\"\n\n\"Vimánas are further distinguished into three kinds, namely, st'hánaca, ásana, and sáyana; the first having reference to the height, the second to the breadth, the third to the length. Moreover, the idol to be placed in the vimána, called st'hánaca, should be in an erect posture; that to be placed in the ásana, in a sitting; and that to be placed in the sáyana, in a recumbent posture.\"\n\n\"Vimánas are again divided into five sorts, with respect to their magnitude. They are called sántica,* panística,† jayada,‡ atbhuta,§ and sarvacáma.¶ The breadths of these five kinds of temples being divided into seven, six, five, four, and three parts in due order; ten, nine, eight, and seven of those parts are given to their respective heights.\"\n\n\"Temples consist of the garb'hagriha (the womb of the house), the antarídla (the anti-temple), and the ard'ha mantapa (the front portico). The diameter of the whole length of the building, including the walls, is to be divided into four and a-half or six parts; and the garb'hagriha to take up two, two and a half, or three; the antarídla, one and a-half or two; and the ard'ha mantapa, one or one and a-half.‖\n\n* The moderate. † The bulky.\n‡ The victorious. § The admirable.\n¶ The universally beloved.\n\n‖ Sometimes a portico is made round the garb'hagriha and antarídla together, the whole being closed\n\"Temples on a large scale have three or four successive porticoes attached to them in the front, which are called ard'ha-mantapa, mahámantapa, st'hapana mantapa, urittya mantapa, &c. Ard'hamantapas are sometimes made broader than the garb'hagriha, in which case the width of the former is either once and a-half or twice that of the latter. In the event of the three compartments being of the same breadth, the length of the whole should be two and a-half the breadth.\"\n\n\"The breadth of the garb'hagriha being divided into three, four, five, seven, nine, eleven, thirteen, or fifteen parts, let two, three, four, five, six, seven, or eight be allowed to the interior space, and the remainder take up the thickness of the walls on all sides.\"\n\n\"The thickness of the wall being divided into twelve equal parts, let five or six be given to the door-frames or posts without, and seven or eight to the inside of the door. The door-frames or posts may be placed either in the middle or at the extremity of the point of the division before mentioned.\"\n\n\"The height of the pillars of the vimána is to be divided into ten or eight equal parts; and nine, eight, or seven of them are given to that of the doorway, the breadth of which is to be half its height.\"\n\n\"In temples, and houses of Brahmans and others, two-leafed doors may be used. The doors are turned either by means of a perpendicular cylinder, one end of which rests on the ground, or by hinges. The outside of the door-frames are ornamented with foliages, &c., and on the architrave of the door, and on both sides of it, are carved the images of the gods and goddesses presiding over gates and door-ways.\"\n\nclosed by walls on all the sides but the front, in which are the doors for entrance, approached by the front portico, which is generally a peristyle, and it serves as the innermost court around which people perform their circumambulations; I say the innermost court, because there are other courts around the whole temple.\n\"Let a water-spout be made over the base on the back wall of the garb'hagriha, on the left side of the idol, either towards the east or the north, according as the temple may face towards the south or the east. The thickness of the spout should be either eight, ten, twelve, fourteen, or sixteen angulas. Its length should be equal to the ad'hist'háma, which length being divided into three equal parts, one is given to the projection below (lam-bana). The breadth of the bottom of the spout is to be divided into five parts, and three to be given to the breadth of the sloping extremity below. The whole spout being divided into five parts, three to be given to the cugmala,* one to the padma,† and one to the vajina or fillet. On the surface of the spout a cavity is to be made for discharging the water, from one to five angulas broad. The breadth of the cavity at the end should be three-fifths of that at the bottom. The spout may be made to spring from the head of a lion, &c., and the whole so devised as to project like a plantain flower.\"\n\nTo these observations succeeds a detailed enumeration of the proportions of the different sorts of vimánas, consisting of from one to twelve stories; but as it would be extremely tiresome to specify the whole, even in the most abridged form, I shall insert the measurements of a few sorts only, which, with the assistance of the designs that accompany this essay, will, it is hoped, serve as a standard by which to determine the proportions of the rest of this class of buildings.\n\nA VIMÁNA CONSISTING OF A SINGLE STORY.\n\n(See Plate XXI.)\n\nThe breadth of this vimána, which is measured between the two angular pillars, is divided into six parts: two are given to the muc'h'b'hadra (or the\n\n* An ornament made in the form of a bud.\n† Lotus, or cima recta.\nmiddle niche), and two to the space on each side of it. The height of *vimānas* is measured from the base to the apex, exclusive of the pedestal below, and is equal to one and a-half of its breadth. Let the whole height be divided into eight equal parts; give one to the *adhisthāna* (base), two to the *pāda* (pillar), one to the *prastara* (entablature), one to the *grīva* (the neck of the dome), two to the *sic'hara* (cupola), and one to the *st'hāpi* (pinnacle). The *adhisthāna* (base) is divisible into twenty-six parts. The height of the *grīva* being divided into three parts, one is given to the *vēd'hica* or basement, one to the *grīva,* and one to the *utīra* (entablature). The *sic'hara* (cupola) being divided into thirty-two parts, three to be given to the *lupa mula,* two to the *ad'hōpadma* (the lower cima recta), one to the *mālabaddha* (the fillet ornamented with a wreath), two to the *ūrdhvapadma* (the upper cima), sixteen to the *sic'hara* (dome), one to the *mālabaddha*, two to the *chandrānila,* five to the *mahāpadma* (the great lotus). The breadth of the pavement being divided into six parts, one of which is diminished for the breadth of the *vēd'hica* (or base) on the first story, which being divided into four parts, three of them are given to the breadth of the *grīva*. The projection of the pendants is equal to the breadth of the *vēd'hica* below.\n\n\"The breadth of the *sic'hara* being divided into five parts, three are to be given to that of the *pattica,* which being divided into five parts, three and a-half are given to the breadth of the *padma* above, one-third of it to the\n\n---\n\n* Grīva is here used to signify that hollow space which supports an entablature under the cupola, though the term is generally applied to denote the whole ornament, consisting of the base, the hollow space, and the entablature before-mentioned.\n\n† A sloping and projecting member of the entablature, representing a continued pent roof. It is made below the cupola, and its ends are placed as it were suspended from the architrave, and reaching the stalk of the lotus below.\n\n‡ A horizontal moulding over the *sic'hara* and below the base of the pinnacle.\n\n§ A round ornament at the bottom of the pinnacle.\nON THE ARCHITECTURE OF THE HINDUS.\n\ncumb'ha, and one-third of the latter to the cudmala (the bud). Or divide the crown of the cupola into five equal parts; give three to the breadth of the p'haláca, which divide into five equal parts, make the breadth of the padma take up four parts; which divide again into three equal parts, give one to the breadth of the cant'ha, and three to the breadth of the cumb'ha. Divide the breadth of the latter into nine equal parts, and give one to that of the dandá or pinnacle, or three times the breadth of the pinnacle may be taken for the breadth of the p'haláca, and one-third of the breadth of the latter for that of the cudmala (bud).”\n\n“The great padma or lotus under the pinnacle should be made to consist of eight petals, and the rest of the ornaments made in such a manner as to give a graceful appearance to the whole.”\n\nA VIMÁNA CONSISTING OF TWO STORIES.\n\n(See Plate XXII.)\n\n“The height is twice the breadth, which latter is divided into six parts; one to be given to the carnaclú't'ha,* one to the hárántara,† two to the muc'hub'hadra,‡ and two to the carnaclú't'ha and hárántara on the other side of the façade. The height of the edifice is divided into twenty-eight parts, of which three are given to the adhist'hána (base), six to the pillars, three to the entablature, five to the pillars above; two to the entablature, one to the base, two to the neck or cant'ha, four to the cupola, and two to the pinnacle.”\n\n“The pedestal at the bottom is not included in the height of the temple, but it is equal in height to the base over it.”\n\nUnder this head may be noticed the designs in Plates XXIII. and XXIV.\n\n* The side niches. † The flank ornaments. ‡ The front tabernacle.\nwhich represent the plan and the front and side elevations of the *vimāna* at Sri Rangam, one of the earliest specimens of sacred architecture which the ancients have left us in the South of India. The cupola or dome is crowned with four pinnacles over the front portico, and four more across the former over the principal cell; and in the tabernacle immediately below the cupola, stands the statue of Paravāsudēva, a form of Vishnu.\n\nThe plan of the cell or sanctuary, where the idol of Ranganāṭ'ha is seen in a recumbent posture, is oval, but that of the front portico square, and the outside of the vault is adorned with a sort of tracery-work. The front portico, which extends to a considerable distance from the main cell, is supported by rows of lofty columns; and the whole temple is enclosed by seven square courts, each of them having four pyramidal gateways, one in the middle of each side of the wall. Several of these courts contain private dwelling-houses of Brahmans and other classes. The designs have been taken by an artist on the spot, and the proportions of the different parts of which the temple is composed are, according to his account, as follows:\n\n\"The whole height of the *vimāna* is divided into thirty-two parts, four are given to the base, three to the pillars, four to the entablature, five to the upper pillars, two to the upper entablature, one to the upper base, two to the *can'tha*, four to the cupola, and two to the pinnacle.\"\n\n**A VIMĀNA CONSISTING OF THREE STORIES.**\n\n(See Plates XXVI. and XXX.)\n\n\"The height is twice the breadth, and being divided into forty-eight parts, four are given to the base, eight to the pillar, four to the entablature, seven and a-half to the pillar above, three and a-half to the entablature, seven to the pillars, three to the entablature, one to the upper base, two to the *cant'ha*, six to the cupola, and two to the pinnacle.\"\n\nThe first design is made from the foregoing measurement given by Mānasāra, and the second is taken from the *vimāna* of Vaicunt'ha.\nON THE ARCHITECTURE OF THE HINDUS.\n\nNāṭ'ha* at Cánchipuram (Canjeveram). In the lower story is placed the statue of the god whose name the temple bears; in the upper that of Rangandit'ha* recumbently, and in the third that of Paravásudēva,* sitting under the canopy of a cobra de capello. This temple has been selected for a specimen on account of the singularity of the plan, and of the three different deities being worshipped one above another, in as many stories, of which it is composed.\n\n\"The height of this temple is divided into twelve parts, one to the base, two to the pillar, one to the entablature, three-quarters to the pedestal, three-quarters to the base, one and a-half to the pillar, three-quarters to the entablature, a half to the base, one to the pillar, a half to the entablature, a quarter to the upper base, a half to the cant'ha, one to the cupola, and a half to the pinnacle.\"\n\nA VIMĀNA CONSISTING OF FOUR STORIES.\n\n(See Plate XXXI.)\n\n\"The height of the vimāna being divided into nineteen parts, one and a-half is given to the base, three to the pillar, one and a-half to the entablature of the first story, two and a-half to the pillar, one to the entablature of the second story, two to the pillar, three-quarters to the entablature of the third story, one and a-half to the pillar, three-quarters to the entablature of the fourth story, a half to the upper base, one to the cant'ha, two to the cupola, and one to the pinnacle.\"\n\n\"The pedestal at the bottom is independent of the rest of the parts, and is equal in height to the base,\"\n\n\"The inner pillar of the carnacūt'ha (the side niches) of the lower story, should be placed directly under the outer pillar of the same ornament, in the story immediately above.\"\n\n* Vishnu under different forms.\nA VIMĀNA CONSISTING OF FIVE STORIES.\n\n(See Plate XXXII.)\n\n\"The height is to be divided into twenty-four parts: one and a-half to be given to the base, three to the pillar, one and a-half to the entablature of the first story; two and a-half to the pillar, one and a-quarter to the entablature of the second; two and a-quarter to the pillar, one to the entablature of the third; two to the pillar, one to the entablature of the fourth; one and three-quarters to the pillar, one to the entablature of the fifth; a half to the upper base, one to the cant'ha, two and a-half to the cupola, and one and a-half to the pinnacle. The pedestal below is equal in height to the base.\"\n\nTemples of five stories are found in various parts of southern India; and the design which accompanies, represents one at Rājarāyēswaram, in the province of Tanjore.\n\nA VIMĀNA CONSISTING OF SEVEN STORIES.\n\n(See Plate XXXIII.)\n\n\"The height is divided into thirty-six parts; two to be given to the base, four to the pillar, two to the entablature of the first story; three and a-half to the pillar, one and three-quarters to the entablature of the second; three to the pillar, one and a-half to the entablature of the third; two and a-half to the pillar, one and a-half to the entablature of the fourth; two to the pillar, one to the entablature of the fifth; one and a-half to the pillar, three-quarters to the entablature of the sixth; one and a-quarter to the pillar, five-eighths to the entablature of the seventh; one to the base, one and a-half to the cant'ha, two and a-half to the cupola, and five-eighths to the pinnacle.\"\nON THE ARCHITECTURE OF THE HINDUS.\n\nA VIMÁNA CONSISTING OF TWELVE STORIES.\n\n(See Plate XXXIV.)\n\n\"The whole height is to be divided into eighty-seven parts, four to be given to the base, eight to the pillar, four to the entablature of the first story; seven to the pillar, three and a-half to the entablature of the second; six to the pillar, three to the entablature of the third; five to the pillar, two and a-half to the entablature of the fourth; four and a-half to the pillar, two and a-half to the entablature of the fifth; four to the pillar, two to the entablature of the sixth; three and a-half to the pillar, two to the entablature of the seventh; three to the pillar, one and a-half to the entablature of the eighth; two and a-half to the pillar, one and a-quarter to the entablature of the ninth; two and a-half to the pillar, one to the entablature of the tenth; two to the pillar, one to the entablature of the eleventh; one to the upper base, two to the cant'ha, three to the cupola, one and a-half to the pinnacle.\"\n\nA VIMÁNA CONSISTING OF FIFTEEN STORIES.\n\n(See Plate XXXV.)\n\n\"The height being divided into one hundred and ninety-four parts, seven to be given to the base; thirteen to the pillar, six and a-half to the entablature of the first story; twelve to the pillar, six to the entablature of the second; eleven to the pillar, five and a-half to the entablature of the third; ten to the pillar, and five to the entablature of the fourth; nine to the pillar, four and a-half to the entablature of the fifth; eight to the pillar, four to the entablature of the sixth, and so on up to the fifteenth story; the pillars being diminished by half a part regularly, and the entablatures half the height of the pillars over which they are placed; after which one part is given to the upper base, two to the cant'ha, four and a-half to the cupola, and one and a-quarter to the pinnacle.\"\nThe thirty-first chapter of the Mānasāra, as well as the twenty-fourth of the Māyāmata, treat of gopuras, or towers on the gateways of temples; from both which works a few extracts will be given below.\n\n\"There are five sorts of gateways, namely, dwārasbhb'ha (the gate of splendour), dwārasāla (the gate of the mansion), dwāraprasāda (the propitious gate), dwāraharmya (the gate of the palace), and dwāragopura (the turreted gate). The breadth of the principal temple being divided into seven, eight, nine, ten, or eleven parts, six, seven, eight, nine, or ten are to be given to that of the five sorts of gopuras respectively. 'These five sorts are to be employed in as many courts, by which the temple is to be surrounded.'\n\n\"A dwārasbhb'ha consists of one or two stories; a dwārasāla of from two to four; a dwāraprasāda, of from three to five; a dwāraharmya, of from five to seven; and a dwāragopura, of from seven to sixteen stories.\"\n\n\"And the breadth of gopuras, of the superior sort, may be made twice that of the principal temple, or one and three-quarters, one and a-half, or one and a-quarter of it: or in gopuras of the inferior sort, the breadth of the principal temple being divided into four, five, six, or seven parts, one of these parts should be taken away, and the remainder given to the breadth of the former.\"\n\n\"The breadth of the gopura at the bottom being divided into three parts; let one of them be given to the void space of the gate in the middle. 'The height of the door-frame being divided into four parts, let one be given to the pedestal, one to the base, and two to the pillars, around the first story. Or, the same height being divided into seventeen parts, let five be given to the pedestal, four to the base, and eight to the pillars.' The height of the door-frame should be twice its breadth.\"\n\n\"The diameter of the gopura of a single story being divided into six parts, three to be given to the interior space, and three to the thickness of the walls.\"\nON THE ARCHITECTURE OF THE HINDUS.\n\n\"The diameter of the gopura of two stories being divided into seven parts, four to be given to the interior space, and three to the thickness of the walls.\"\n\n\"The diameter of the gopura of three stories being divided into nine parts, four to be given to the interior space, three to the thickness of the walls, and the remainder to the terrace around (alindra).\"\n\n\"The diameter of the gopura of four stories being divided into ten parts, five to be given to the space inside, four to the thickness of the walls, and one to the terrace around.\"\n\n\"The diameter of the gopura consisting of seven stories being divided into thirteen parts, eight to be given to the space inside, three to the thickness of the walls, and two to the terrace around,\" and so with the rest.\n\nVarious denominations are next given to gopuras, such as sricara, ravicanta, savmya, vijaya, visilaca, &c., and their characteristic ornaments described with too much minuteness to be here detailed; and to these succeeds a no less minute enumeration of the various parts which compose gopuras of the several heights before-mentioned, of which I shall subjoin the divisions and proportions of those only which consist of one, two, five, six, and twelve stories, the designs of which accompany this essay.\n\nA DWARASOBHA CONSISTING OF ONE STORY.\n\n(See Plate XXXVI.)\n\n\"The height of the principal pillars of the gate should be three-quarters of the breadth of the pyramid at the bottom, and being divided into four parts, one to be given to the pedestal, one to the base, and two to the pillars, and the whole height of the ornaments over this, is equal to the breadth of the ground-plan; and the same height being divided into four parts, one is to be given to the entablature, one to the cant'ha, two to the cupola, and one to the pinnacles.\"\nON THE ARCHITECTURE OF THE HINDUS.\n\nA DWÁRASÁLA CONSISTING OF TWO STORIES.\n\n(See Plate XXXVII.)\n\n\"The height of the principal pillars of the gate, which should be three-quarters of the breadth of the ground-plan, being divided into three and three-quarters parts, three-quarters to be given to the pedestal, one to the base, two to the pillars, and one to the entablature. The height of the pillars in the second story is one-eighth less than that of the pillars in the first or lower story, half of which is given to the entablature, half of that to the upper base, twice that to the cavetto above, twice that to the cupola, which should be surmounted by five pinnacles equal in height to half of the cupola.\"\n\nA GÓPURA CONSISTING OF FIVE STORIES.\n\n(See Plates XXXVIII. and XXXIX.)\n\n\"The height of the gate-pillars being divided into twenty-one parts, nine to be given to the pedestal, four to the base, and eight to the pillar, and the remainder of the pyramid, from the entablature up to the pinnacle, is in height equal to one and a-quarter part of the breadth of the ground-plan: and being divided into twenty-three parts, two to be given to the entablature of the first story; three and a-half to the pillar, one and three-quarters to the entablature of the second; three to the pillar, one and a-half to the entablature of the third; two and a-half to the pillar, one and a-quarter to the entablature of the fourth: two to the pillar, one to the entablature of the fifth; one to the cavetto, two and a-half to the dome, and one to the pinnacle.\"\n\nA GÓPURA CONSISTING OF SIX STORIES.\n\n(See Plate XL.)\n\n\"The height of the gate-pillars, which is three-quarters of the breadth of the ground-plan, being divided into four and a-half parts, one and a-half\nON THE ARCHITECTURE OF THE HINDUS.\n\nto be given to the pedestal, one to the base, and two to the pillars; and\nthe upper part of the pyramid, which is equal in height to the breadth of\nthe ground-plan, being divided into twenty-nine parts, two are to be given to\nthe entablature of the first story; four to the pillar, one and three-quarters\nto the entablature of the second; three and a-half to the pillar, one and\nthree-quarters to the entablature of the third; three to the pillar, one and\na-half to the entablature of the fourth; two and a-half to the pillar, one and\na-half to the entablature of the fifth; two to the pillar, one to the enta-\nblature of the sixth; one to the cavetto, two and a-half to the dome, and\none and a-half to the pinnacle.\"\n\nA GÓPURA CONSISTING OF TWELVE STORIES.\n\n(See Plates XLI. and XLII.)\n\n\"The height of the gate-pillars is three-quarters of the breadth of the\nplan, and it being divided into five parts, two to be given to the pedestal,\none to the base, and two to the pillar. The upper part is equal in height\nto twice the breadth of the ground-plan; and the same being divided into\neighty-five parts, three and a-half to be given to the entablature of the\nfirst story; seven to the pillar, three and a-half to the entablature of the\nsecond; six and a-half to the pillar, three and a-half to the entablature of\nthe third; six to the pillar, three to the entablature of the fourth; five and\na-half to the pillar, two and three-quarters to the entablature of the fifth;\nfive to the pillar, two and a-half to the entablature of the sixth; four and\na-half to the pillar, two and a-half to the entablature of the seventh; four\nto the pillar, two to the entablature of the eighth; three and a-half to the\npillar, one and three-quarters to the entablature of the ninth; three to the\npillar, one and a-half to the entablature of the tenth; two and a-half to the\npillar, one and a-quarter to the entablature of the eleventh; two to the\npillar, one to the entablature of the twelfth; one to the upper pedestal, one\nand three quarters to the cavetto, three and a-half to the dome, and one\nand a-half to the pinnacles.\"\nHaving given the proportions of the different parts of pyramidal temples and gateways, we may be permitted to indulge in a few words relative to their general appearance, and to the ideas which this is calculated to impress on the mind.\n\nAn eminent author makes the architectural sublime to consist \"in magnitude, height of the buildings, and solidity of the materials;\" another author, \"in splendour, magnificence, and an imposing appearance.\" These characteristics of the sublime, most of the Indian temples possess in an eminent degree, independently of that sort of light betwixt gloom and glare which increases the sublimity in architecture; and in beholding these majestic and stupendous works, we are struck with admiration and respect, and animated with emotions of piety, virtue, and religion.\n\nIf we enter into the minutiae of the art, which solely depend on scientific proportion, and on the skilful application of mechanic powers, we are led to wonder at the success of the artist in his attempts at the sublime, and to express our astonishment at the physical powers employed in the superstructure.\n\nOf all the modes of building invented by man, the pyramid seems to be best calculated to produce these impressions. It must be acknowledged, however, that the pyramidal buildings of India are of much less dimensions than those of Egypt, and that the former have too great a profusion of ornaments. If we examine the exterior of these temples, we should discover with what skill the bulk of the edifice is shewn to advantage, and how admirably the parts are formed for the eye to embrace the whole, at the same time that the sight is bewildered with the infinite variety of decorations. The interior, also, is so constructed as to cast over it a visible oblivion, that indispensable requisite of the sublime.\n\nI shall now close this essay, with the following short account of the mode of preparing chunam, or cement, as practised by the artists in India.\n\nChunam is prepared in the interior of India from a gravelly sort of limestone dug out of quarries, and along the coast from shells washed out of\nsalt-water marshes. Of the two, the shell chunam is generally considered the strongest and most durable. The following is the mode of preparing stone chunam: The pebbles or gravel stones are first beat with wooden pestles, to separate the alluminous clay which adheres to them; after they are thus cleaned, they are sorted, as of a white or brown quality. In some places the stone is burnt by simply laying alternate layers of stone and charcoal on the ground, in the proportion of two parts of charcoal to one of stone, and thus allowed to burn out. The stone, after being burnt, is slacked by laying small quantities in heaps and throwing water on them; and as soon as the heat begins, the whole is mixed up together and stirred about till it is reduced to a dry powder. The lime is now considered fit for the use of the builder. Shell chunam is manufactured much in the same way, excepting that it is again cleansed by the manufacturer in a dry state, by strewing it down against the wind, after the manner that corn is winnowed to separate the chaff. The burning, also, is differently performed: the charcoal is mixed up with the shells, and burnt in large open kilns, with a grated bottom and longitudinal flue, communicating with four or more lateral openings. The stone chunam forms a coarse sandy powder, and the shell a very fine impalpable one. From these two substances all the mortar for building throughout India is prepared; they are mixed with clean sharp river sand in various proportions, according to the use for which they are intended. For brick work, from one part and a-half to three of sand is mixed, with one or two of the fine slacked lime; for the coarse undercoat plastering, from one to two of sand with two of lime; and for the last and fine upper coating, two to three of sand with one of lime. When the mortar is prepared for the brick work in rough plastering, it is simply beat up with pure water in long stone troughs, with wooden pestles about a yard and a-half long and shod with iron hoops. Chunam intended for fine plastering and ornamental works is ground by women, on an oblong granite stone and a cylindrical upper stone about four inches in diameter; the mixture is sometimes ground two, three, and four times, to bring it to the required fineness and purity.\nON THE ARCHITECTURE OF THE HINDUS.\n\nIn all the operations of chunam work, jaggery water, i.e. a solution of molasses or coarse sugar, is invariably added by the builders, and its use appears to have prevailed from the remotest ages. There are various opinions among the modern practitioners regarding its usefulness, but those who have had the most extensive practice in building, hold it as an indispensable ingredient in the formation of a durable and hard cement; and it is stated that the operator evidently perceives the dissolvent property of the jaggery water, on its being tempered with the prepared mortar. It is supposed that it tends very much to the intimate union of the coarse particles of the lime with the sharp sand, on account of the saccharine acid in the molasses, and the gaseous principle of its earthy parts, causing a quicker chemical induration of the mortar than would be effected by mere application of pure water conjoined with the absorption of the hardening substance of the atmospheric air.\n\nFINIS.\nERRATA.\n\nPage 30, line 4, for pratibandha read pratibhadra\n\n— 34, — 2, — praibhadra — pratibandha\n\nFor Vasyhānasa read vaikhanasa\n\n— Pancharatram — panchārātram\n\n— Adhistāna — adhihānā\n\n— Mantapas — mandapas\n\n— Yecchas — Yacchas\n\n— Sicharas — sic'haras\n\n— Pāndu — Pāndu\n\n— Chriehna — Crishna\n\n— Dwapara — Dwāpara\n\n— hastha — hasta\n\n— dhanurmasti — dhanurmushti\n\n— ryju — rajju\n\n— carta — cartā\n\n— Twasta — Twaṣṭri\n\n— Manushya — mānushya\n\n— Chadira — C'hadira\n\n— memosa — mimosa\n\n— micheles — michelia\n\n— saptapharna — saṣṭaparna\n\nFor athi read adhi\n\n— stha — st'hā\n\n— pat'tica — patticā\n\n— pat'ta — pat'tā\n\n— vedhi — vēḍī\n\n— prati bandha — pratibandha\n\n— pushpapushacala — pushpapushacala\n\n— cumbhanda — cumbhabandha\n\n— pancharas — panjaras\n\n— sivastica — svastica\n\n— sud'ha — suddha\n\n— atbhuta — adbhuta\n\n— cudmala — cudmala\n\n— muc'hbadra — muc'hbabhadra\n\n— dwārāhanya — dwārāharmya\n\n— Paravasudiva — Paravasudēva\n\n— Karnakūtha — Carnacūta\n\n— muc'hubhadra — muc'hbabhadra\n\n— Cariciyā — Cārīcikēya\n\n— Vēdibhadra — vēdibhadra\nA Vémana consisting of a single Story.\nA Vimāna consisting of Two Stories.\nThe Vimana at Sri Rangam.\na Side Elevation.\nAnother Vimāna of two Stories.\nAnother Vimana consisting of three Stories.\nA Vimāna of two Stories.\nOrnaments at the Top of the Vimāna.\n\nLithographed for the Royal Asiatic Society by Deep & Hughes, lithographers to the King's Gate Street, Lincoln's Inn Fields.\nThe Vimana of Vayuinthanatha at Conjeveram.\n\nLithographed for the Royal Asiatic Society by Day & Son, Lithographers to the King, Gate St. James's Inn Fields.\nA Vimāna consisting of four stories.\nA vimana consisting of five stories.\nA Vimāna consisting of Seven Stories.\nA Gopura consisting of one Story.\n\nLithographed, for the Royal Asiatic Society by Day & Haghe, Lithographers to the King, Gate St. Pancras Inn Fields.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/essayonarchitec00harkgoog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 203, "total-input-tokens": 364948, "total-output-tokens": 42681, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 519, 5], [519, 519, 6], [519, 1747, 7], [1747, 3691, 8], [3691, 5502, 9], [5502, 7177, 10], [7177, 8973, 11], [8973, 10690, 12], [10690, 12375, 13], [12375, 14805, 14], [14805, 17305, 15], [17305, 20202, 16], [20202, 22999, 17], [22999, 23526, 18], [23526, 24828, 19], [24828, 26922, 20], [26922, 29036, 21], [29036, 32236, 22], [32236, 34664, 23], [34664, 37011, 24], [37011, 39163, 25], [39163, 41368, 26], [41368, 43691, 27], [43691, 45925, 28], [45925, 48228, 29], [48228, 50490, 30], [50490, 52772, 31], [52772, 54899, 32], [54899, 57048, 33], [57048, 59237, 34], [59237, 61315, 35], [61315, 63480, 36], [63480, 65635, 37], [65635, 66950, 38], [66950, 69141, 39], [69141, 71358, 40], [71358, 73569, 41], [73569, 75821, 42], [75821, 77770, 43], [77770, 79972, 44], [79972, 81919, 45], [81919, 83949, 46], [83949, 86019, 47], [86019, 88202, 48], [88202, 90432, 49], [90432, 92485, 50], [92485, 94684, 51], [94684, 96832, 52], [96832, 98871, 53], [98871, 101045, 54], [101045, 103232, 55], [103232, 105327, 56], [105327, 107513, 57], [107513, 109685, 58], [109685, 112003, 59], [112003, 114122, 60], [114122, 116194, 61], [116194, 118303, 62], [118303, 120544, 63], [120544, 122679, 64], [122679, 124668, 65], [124668, 126816, 66], [126816, 128771, 67], [128771, 130754, 68], [130754, 132558, 69], [132558, 134796, 70], [134796, 136519, 71], [136519, 138552, 72], [138552, 140328, 73], [140328, 141933, 74], [141933, 143833, 75], [143833, 145822, 76], [145822, 147666, 77], [147666, 149423, 78], [149423, 151568, 79], [151568, 153681, 80], [153681, 155983, 81], [155983, 157013, 82], [157013, 158038, 83], [158038, 158038, 84], [158038, 158038, 85], [158038, 158038, 86], [158038, 158038, 87], [158038, 158038, 88], [158038, 158038, 89], [158038, 158038, 90], [158038, 158038, 91], [158038, 158038, 92], [158038, 158038, 93], [158038, 158038, 94], [158038, 158038, 95], [158038, 158038, 96], [158038, 158038, 97], [158038, 158038, 98], [158038, 158038, 99], [158038, 158038, 100], [158038, 158038, 101], [158038, 158038, 102], [158038, 158038, 103], [158038, 158038, 104], [158038, 158038, 105], [158038, 158038, 106], [158038, 158038, 107], [158038, 158038, 108], [158038, 158038, 109], [158038, 158038, 110], [158038, 158038, 111], [158038, 158038, 112], [158038, 158038, 113], [158038, 158038, 114], [158038, 158038, 115], [158038, 158038, 116], [158038, 158038, 117], [158038, 158038, 118], [158038, 158038, 119], [158038, 158038, 120], [158038, 158038, 121], [158038, 158038, 122], [158038, 158038, 123], [158038, 158038, 124], [158038, 158038, 125], [158038, 158038, 126], [158038, 158077, 127], [158077, 158077, 128], [158077, 158113, 129], [158113, 158113, 130], [158113, 158113, 131], [158113, 158113, 132], [158113, 158157, 133], [158157, 158157, 134], [158157, 158188, 135], [158188, 158188, 136], [158188, 158188, 137], [158188, 158188, 138], [158188, 158232, 139], [158232, 158232, 140], [158232, 158257, 141], [158257, 158257, 142], [158257, 158418, 143], [158418, 158418, 144], [158418, 158576, 145], [158576, 158576, 146], [158576, 158613, 147], [158613, 158613, 148], [158613, 158650, 149], [158650, 158650, 150], [158650, 158688, 151], [158688, 158688, 152], [158688, 158688, 153], [158688, 158688, 154], [158688, 158688, 155], [158688, 158688, 156], [158688, 158688, 157], [158688, 158688, 158], [158688, 158688, 159], [158688, 158688, 160], [158688, 158839, 161], [158839, 158839, 162], [158839, 158839, 163], [158839, 158839, 164], [158839, 158839, 165], [158839, 158839, 166], [158839, 158839, 167], [158839, 158839, 168], [158839, 158839, 169], [158839, 158839, 170], [158839, 158839, 171], [158839, 158839, 172], [158839, 158839, 173], [158839, 158839, 174], [158839, 158839, 175], [158839, 158839, 176], [158839, 158839, 177], [158839, 158839, 178], [158839, 158839, 179], [158839, 158839, 180], [158839, 158839, 181], [158839, 158839, 182], [158839, 158839, 183], [158839, 158839, 184], [158839, 158839, 185], [158839, 158839, 186], [158839, 158839, 187], [158839, 158839, 188], [158839, 158839, 189], [158839, 158839, 190], [158839, 158839, 191], [158839, 158839, 192], [158839, 158839, 193], [158839, 158839, 194], [158839, 158839, 195], [158839, 158839, 196], [158839, 158839, 197], [158839, 158839, 198], [158839, 158839, 199], [158839, 158839, 200], [158839, 158839, 201], [158839, 158839, 202], [158839, 158839, 203]], "primary_language": ["en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "en", "None", "None", "None", "en", "None", "en", "None", "None", "None", "en", "None", "en", "None", "None", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, false, true, true, false, false, true, true, false, true, false, true, false, false, true, true, false, false, true, true, false, false, false, true, false, false, true, true, false, false, false, true, false, true, false, true, false, true, false, true, false, true, true, true, false, true, false, false, false, false, false, false]}}]