[{"id": "6e6b5f550b2ed5a96586d289ce5ef1faa886109f", "text": "TRANSACTIONS\n\nOF THE\n\nKOREA BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY\n\n鮮 朝\n\nVol. IV Part II.\n\nSupplied gratis to all Members of the Society.\n\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\n\nSeoul, Korea: Hon Librarian,\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1913.\nMr. Chairman, ladies and gentlemen:—\n\nSome time ago Dr. Gale kindly suggested to me that I should read a paper before a meeting of this learned society. I was very much flattered, but well knowing that I am but slightly qualified to undertake the task suggested I hesitated to reply in the affirmative and gave him a rather vague reply. My hesitation was all the greater because I knew too well what a bad speaker of English I was. Moreover, I knew that the lecturers who preceded me were all gentlemen possessing profound knowledge of the subjects they dealt with. Mr. Komatsu, Prof. Starr of Chicago University, Dr. Gale and Mr. Gillett—these were the gentlemen who spoke before me and the lectures they gave were all of absorbing interest. After these learned gentlemen, I was sure I should make myself a laughing stock. For these reasons, I hesitated to accept the suggestion thus made to me by Dr. Gale, though an extremely flattering one. On second thought, however, I decided to agree to it, for this reason, that I possess one great advantage which is denied to all the learned lecturers who preceded me. By the advantage I mean, paradoxical though it may sound, the very fact that I am a bad speaker of English. Now as you may have already noticed I speak English in an extremely outlandish way and without endeavouring to be amusing, I can amuse you by simply talking in my quaint Japanized English. All my learned predecessors had to say something interesting in order to delight you.\nYour humble servant, however, has only to speak in English and it is enough to make you smile.\n\nI remember having spoken before a great assembly of students in Tokyo some four years ago. The speakers on the occasion were, besides myself, the late Rev. Dr. Lloyd, of the Imperial University, Mr. Iwaya, who is the best writer in Japan for young people, and Captain Sakurai, hero of Port Arthur and the famous author of \"Human Bullets.\" I may say I am a better speaker in Japanese and I believe I made a pretty good speech. Mr. Iwaya and Captain Sakurai are eloquent speakers and were, as usual, eminently successful. But the laurels of the day were won by Dr. Lloyd, and he was accorded the loudest applause by the audience. It was not because his speech was specially good, but it was because he spoke in Japanese and that in very quaint Japanese. The late Dr. Lloyd was a great scholar of Japanese literature, but I must say he spoke very funny Japanese. Every sentence he uttered was greeted with immense delight by his hearers and for half an hour, during which he spoke, he received round after round of thunderous applause. I do not venture to hope to score such success as was won by him that day, but I do hope that the quaint English in which I speak will prevent you from sleeping for half an hour.\n\nWith this rather long introduction, I now propose to read my little paper, which, I assure you, is not such a long one as my introduction may suggest. The paper I am going to read deals with the intercourse between Japan and Korea immediately after the Japanese invasion of Korea in the 16th century and during the Tokugawa or feudal government of Japan. As you are no doubt well aware, the Japanese invasion of Korea in the 16th century was a dismal failure. Toyotomi Hideyoshi, often called the Napoleon of Japan, undertook it with no higher motive than satisfying his boundless ambition. The expedition was at first quite successful. It was on May 24, in the year 1592, that the advance guard, of the Japanese army under the command of Konishi landed at Fusun. By the way, it is interesting to note that Konishi was a Christian. He and the nineteen thousand\nmen under him were almost entirely Christians. Within less than twenty days after landing at Fusan, Konishi, and Kato, Commander of the Second Contingent of the Japanese Army, occupied Seoul, and the Korean King fled to Pyongyang. The Japanese generals did not stop long in Seoul. Kato marched into the province of North Hamkyong and went as far north as Hoilyong on the Manchurian border, while Konishi pursued the King to Pyongyang, which town he occupied on July 16, that is only fifty-four days after he had set foot in Korea. In the meantime the whole of South Korea was overrun by other Japanese generals and everything looked rosy for them. But the Japanese success stopped there. Konishi could not march northward beyond Pyongyang and was ultimately driven back to Seoul by a vast army sent from China to help the Koreans. The Japanese were also greatly harassed by guerrilla warfare waged by Koreans. They were especially placed in difficulty by the great Korean admiral Yi Sun-sin, who wrested from them the command of the sea and frequently cut off the supply of men and provisions from home. On land, however, they mostly got the better of the Koreans and Chinese. And thus the war dragged on for seven long years until the end of October of the year 1598, with the exception of a short interval when unsuccessful peace negotiations were carried on. In September of that year Hideyoshi died, and the Japanese invaders weary of the war withdrew without accomplishing anything, except the ruin of nearly the whole of Korea, from which the poor country has never recovered. It is true that the Chinese who came to help Koreans against the Japanese contributed not a little to the devastation of the country; but of course the main part of the blame must be borne by the Japanese. Before that disastrous Japanese invasion, Korea was the equal, if not the superior, of Japan in wealth, in culture and in civilization. That war was a death blow to poor Korea and the country has since been growing weaker and weaker. To-day we are endeavouring to revive Korea. It is a case strongly illustrative of the Japanese proverb which says: \"The sin of a father is atoned by his\nchildren.\" We are today doing our best to atone for the sin committed by our ancestors in Korea three centuries ago. In this connection, in the name of Japan I must thank you, ladies and gentlemen, for the great and valuable help you give us in our work to restore life to Korea.\n\nHaving been so cruelly dealt with by Japan, as described above, it is but natural that after the war Korea did not regard Japan as her good friend and was in no mood to resume friendly relations with her. In fact it was Japan who first made overtures to become friends again. Tokugawa Ieyasu, who became the virtual ruler of Japan after the death of Hideyoshi, was bent on restoring peace to the country which was in a perturbed state in consequence of the passing away of the Japanese Napoleon. In order that his attention to domestic affairs might not be distracted by foreign complications, he wished to restore friendly relations with Korea and instructed the Daimyo or feudal lord of Tsushima to put forth efforts for that purpose. This order was a very welcome one to the Daimyo of Tsushima, for that island lying midway between Fusan and Shimonoseki had been suffering a great deal on account of the suspension of its tradal relations with Korea. Being a mountainous country and not having enough land to produce rice crops to support its people, Tsushima had been accustomed to send trading vessels to Fusan, fifty in number annually, and to import Korean rice in exchange for various commodities. The Japanese invasion of Korea interrupted this tradal relation to the great inconvenience of the people of Tsushima. For this reason, the order from Ieyasu to try to restore friendly relations between Japan and Korea was received by the Daimyo of Tsushima with great joy. In the year 1599, that is only two years after the Japanese troops withdrew from Korea, the Daimyo of Tsushima sent a messenger to Korea with the purpose of sounding the feeling of the Korean Court towards Japan. This messenger and two others, who were sent one after another with the same purpose, were all made captives by the Chinese troops then still stationed in Chosen and sent to Peking. A\nfourth messenger, sent in the year 1601, succeeded in reaching Seoul and returning home with a reply from the Korean Court. In that reply Korea demanded of Japan the return of Korean prisoners if Japan really wanted peace. The Daimyo of Tsushima, therefore, collected some Korean prisoners and sent them back to Korea and otherwise endeavoured to win the good will of the Korean Court. On the part of Korea, she also wished to conclude peace with Japan, if for no other reason than that of getting rid of the Chinese braves stationed in the country, who constantly acted outrageously and caused great suffering to the Korean people. In the year 1603 Korea sent to Tsushima an envoy in order to see if Japan was really in earnest in wishing peace and in the following year again sent two messengers for the same purpose. The Daimyo of Tsushima accompanied these Korean messengers to Kyoto, where in the spring of the following year they were received in audience by Tokugawa Ieyasu, the first Shogun. On this occasion, Ieyasu consented to the request made by the Korean messengers to return the Korean captives. In consequence, more than 3,000 Korean captives were allowed to return to their country during the same year.\n\nThis substantial proof of the desire for peace on the part of Japan was sufficient to convince Korea of its reality and the latter now showed herself ready to respond to Japan's friendly overtures. In the year 1606 the Korean Court sent a note to the Daimyo of Tsushima, in which two demands were expressed. The first of these demands was that Ieyasu should first send a formal letter to the Korean Court asking for peace and the second was that some Japanese soldiers who had opened some Royal tombs during the Japanese occupation of Seoul should be arrested and surrendered to the Korean Court. Upon the receipt of these two demands, the Daimyo of Tsushima found himself in a dilemma. It would be easy enough to send to Korea some criminals pretending that they were the men wanted by her, but how could he induce Ieyasu to send a letter to the Korean Court first? It amounted to Japan sueing for peace—a great blow to Japan's pride, which Ieyasu would\nnever consent to receive. The mere mention of such a demand having been preferred by Korea would drive the Shogun Ieyasu into a violent fit of anger and all efforts put forth by him for restoring peace between Japan and Korea would come to no purpose. The poor Daimyo of Tsushima was at his wits' end, when Yanagawa, his prime minister, came to his rescue, by devising a tricky solution to the difficult problem. It is not known whether or not the Daimyo of Tsushima connived at his prime minister's act, but it is known that this crafty and unscrupulous Yanagawa fabricated a state letter in the name of Ieyasu, the virtual ruler of Japan. He sent this forged letter to Korea along with some criminals whom he pretended to be the men who had desecrated the Royal tombs and who were wanted by the Korean Court. Now the funny thing was that these criminals were all young men little more than twenty-five years of age, so that at the time of the desecration of the Royal tombs some fourteen years before they were still children and could scarcely have committed the heinous crime with which they were charged. The Korean Court easily detected the trick but failed to see that the alleged state letter of Ieyasu was a forgery and accepted it in good faith. As for the criminals referred to, Korea no less eager than Japan for peace, was glad to overlook the minor point and received and executed them as the real offenders.\n\nThe two demands preferred by Korea having thus been satisfied, the Korean Court concluded that it was in duty bound to respond to Japan's courtesy. Accordingly early in the year 1608 it despatched a mission to Japan. It consisted of an Ambassador, a Vice-Ambassador and a Councillor, with a suite of about 270 men, and carried with it a state letter and some presents to the Shogun from the King of Korea. This letter of the Korean King was naturally worded in the form of a reply to the letter of Ieyasu, which, as before said, was a fabrication by Yanagawa, Prime Minister of the Daimyo of Tsushima. Hence if the Korean King's letter were presented to the Shogun in the\noriginal form, the little trick played by Yanagawa would at once be discovered. Under the circumstance, the crafty Yanagawa did not hesitate to alter the wording of the letter in a way convenient to himself and likely to be pleasing to the Shogun. Not only that, he also added many costly articles to the presents from the Korean King and said that all came from His Majesty.\n\nHaving thus completed preparations for the presentation of the Korean mission, the Daimyo of Tsushima accompanied the Koreans to Yedo, that is the present Tokyo, the seat of the Government of the Tokugawa Shogunate. They left the island of Tsushima on the 21st day of the 3rd moon of the year 1608 and arrived at Yedo after spending about sixty days on the way. Ieyasu had retired from the office of the Shogun two years before and his son Hidetada had succeeded him. The three superior Korean representatives were received in audience by the Shogun Hidetada, when they presented him with the king’s autograph letter and some presents, including 300 kin of ginseng, 20 tiger skins and other Korean products. The reception of the Koreans by the Shogun was very cordial. They were entertained at dinner and presented with 600 pieces of silver and 15 swords. They were also entrusted with a reply by the Shogun Hidetada to the Korean King. The Korean mission, on its way home, stopped at Sunpu, which is the present city of Shizuoka, at the foot of Mt. Fuji, where Ieyasu had retired. Here the Korean messengers were received in audience by the ex-Shogun and besides being dined and wined were given some presents. One good result of this Korean mission was that several hundred Korean prisoners, who still remained in Japan, were allowed to return home and many Japanese retained in Korea were allowed to come back.\n\nIn this way friendly relations between Japan and Korea were at length restored. In recognition of the service rendered in this connection, the Daimyo of Tsushima was rewarded with an increase in his revenue and promotion in Court rank. Besides this, the Daimyo of Tsushima had the satisfaction of being\nallowed by Korea to send 20 trading vessels every year to the port of Fusan to sell Japanese products to Koreans and buy Korean rice. All this was the good result of the little trick played by Yanagawa, his ingenious and unscrupulous prime minister. I may add that Yanagawa again tampered with state letters exchanged between Japan and Korea in the year 1624. Some years later, this and former crimes were discovered, with the result that Yanagawa and some subordinate officials, who were concerned in the business, were tried and found guilty. Yanagawa was stripped of his position and exiled, while some of his subordinate officials were beheaded.\n\nAs I have already said, peace was formally restored between Japan and Korea in the year 1608, the latter having sent a mission to the former. It was quite natural, however, that the relations between the two countries were not all that could be desired. Korea still harboured suspicion against Japan and for some time continued to respond rather indifferently to courtesies shown by Japan. In the year 1615 a great civil war in Japan resulted in the downfall of the House founded by Toyotomi Hideyoshi, who undertook the invasion of Korea. This event was utilized by the Tokugawa, who was now supreme ruler of Japan in reality as well as in name, to win the goodwill of the Korean Court. A special messenger was despatched to Korea with a message that the enemy of the Korean Court was destroyed by the Tokugawa, and Korea should congratulate the House for this. The Korean Court was pleased and in the year 1617 sent another mission to Japan. From this time down to the year 1763 Korea sent ambassadors to Japan on the occasion of the appointment of a new Shogun. Altogether such missions arrived in Japan eleven times. On the part of Japan, she also sent envoys on the occasion of the death of a Korean King and the accession to the throne of a new King. These Japanese envoys were usually sent from the Island of Tsushima and men appointed as envoys were chief retainers of the Daimyo of Tsushima.\n\nLet me now give you a brief account of the Korean mis-\nsions in Japan. The mission was invariably composed of three superior dignitaries, that is Ambassador, Vice-Ambassador and Councillor, beside a very large suite, which exceeded 300 and sometimes totalled nearly 500. The mission came to Japan via Fusan and Tsushima. From Tsushima to Yedo the Koreans were accompanied by the Daimyo of the island. They took the sea-route as far as Osaka through the Inland Sea. Landing at Osaka, the party proceeded to Kyoto and thence passing through the province of Omi, which is my native place, and the neighbouring province of Mino, went to Nagoya and then travelled along the Tokaido highway until it arrived at Yedo. After an audience with the Shogun, the Korean party visited Nikko and then went home by the same route they took in coming. The journey took seven or eight months to complete. From the time the Koreans set foot on the Island of Tsushima, they were treated as guests. All the Daimyo or feudal lords along the route on which they travelled appointed special commissioners to welcome and entertain them. On their arrival at Yedo, they were very cordially received, some big and fine temples being assigned as their hotels, and the entertainment given them in the castle of the Shogun was of the most cordial nature. The fact was that the visit of the Korean mission came to be regarded as the chief event attendant upon the appointment of the new Shogun and was made very much of. The expenses incurred by the feudal lords and the Shogun in connection with the visit of the Korean mission were great. For this reason, about the end of the XVIII century, when the finances of the Tokugawa Government were in a crippled state, the Government could not afford to receive the ceremonial visit of the Korean mission at Yedo and made arrangements to receive it in the Island of Tsushima. From this time the visit of the Korean mission to Yedo was discontinued.\n\nOn the occasion of the audience with the Shogun at Yedo, the Korean Ambassador presented him with the King's autograph letter, besides a large number of presents. The wording of the letter was almost identical every time and expressed\ncordial congratulations on the appointment of the Shogun. On the part of the Shogun, he also gave in trust to the Ambassador a reply to the King, acknowledging and returning his courtesy. The Shogun also sent many presents to the Korean King by the same Ambassador. He also gave the Ambassador and all the members of his suite valuable presents. I have brought here with me some pictures showing the procession of the Korean Ambassador on the occasion of his formal call on the Shogun. These pictures are reproductions from an old painting in the possession of Viscount Akimoto of Tokyo, whose ancestors probably took part in the reception of the Korean mission. I hope those pictures will give you some idea of the gorgeous procession.\n\nI am now about to conclude my little paper. In doing so, let me tell you a little story. I was born in the province of Omi, near Kyoto, through which the Korean mission passed in going to and returning from Yedo. My native place is a little feudal town called Minakuchi, a post station on the Tokaido highway. Travellers going to Yedo from Osaka and Kyoto along the Tokaido highway usually passed through my native town. Oddly enough, however, the Korean mission did not pass my native town, but swinging to the left from the town of Kusatsu, some ten miles away from my native place, they followed a highway known as Chosenjin Kaido or highway for Koreans. The reason that the Korean mission did not honour my native town with a visit was probably that the feudal lord of the place was too poor to entertain them. At any rate while passing through the province of Omi and the neighbouring province of Mino, the Korean mission did not travel on the regular Tokaido highway, but followed the Chosen-jin Kaido or highway for Koreans. This highway is a fine road with rows of pine-trees growing along both sides. I remember having travelled on foot along this road in my boyhood with my father. I was tired and foot sore and the road seemed to be unreasonably long and winding. I asked my father why the road was so winding and the reply given me was: \"Don't you see,\nmy boy, that this is a road specially made for Koreans to travel along? It is made long and winding in order to impress them with the extensiveness of our country.\" I don't know whether the road was really made with such a purpose, but, I tell you, I thought on the occasion that if it was, it was really a very foolish policy.\n\nLadies and gentlemen, I beg to thank you all heartily for the patient attention with which you have followed my paper.\nTHE VILLAGE GILDS* OF OLD KOREA.†\n\nThere are many economic, social and mutual benefit societies in Korea. It is fair to say that the Korean people have a genius for organization. In a list of societies whose constitutions and records are in hand the following varieties are noted; family and clan societies, neighborhood and brotherhood gilds, societies for providing aid at weddings, funerals, in sickness and in controversies. Others have for their object the conduct of periodic feasts or picnics. There are many lottery organizations whose functions are limited to the membership, craft gilds, merchant's companies and monopolistic gilds, labor organizations, village and district governmental societies, co-operative farmer's gilds, organizations of villagers to guard the forests, to establish and conduct community schools and to help poor boys prepare for the government examinations.\n\nThis paper is limited, primarily, to the organizations to be found in the average Korean village and further to that type of village society which attempts to enforce membership on all in the community and exercises authority over the community. Another paper should be written dealing with the purely \"Voluntary Societies in the Villages of Old Korea.\"\n\nThe data in hand consists of the constitutions, rules and records of twelve village gilds which attempt to govern the respective villages from which they were secured. Some\n\n* The spelling gild rather than the more common one of guild is adopted by nearly all writers upon this theme: e.g., H. Spenser, C. Gross Ph.D., Prof. W. J. Ashley, Prof. F. W. Williams, Mr. Troumlin Smith, Dr. L. Brentano and others.\n\n† This Paper consists of extracts from a more exhaustive study of the data in hand than the requirements of the Society allow.\nadditional light has been thrown upon them and their practises by the records of a score or more of voluntary village societies and by conversations with informed villagers.\n\nAs samples of such records two are here quoted in full:\n\nREGULATIONS OF THE TAI TONG KEI\n\n(LARGE VILLAGE GILD) IN KWANG CHOO.\n\n(Kwang Choo is a place of fifty houses about 20 miles from Seoul.)\n\nThe foundation of a gild is harmony of mind on the part of the people. How, it may be asked, can they remain in harmonious mind without obeying the doctrine of faithfulness? Because of this consideration faithfulness may be called a constant accompaniment of harmony. Whenever people aid each other at marriages, funerals or sacrifices they show love and helpfulness and this certainly is the foundation for the establishment of a gild and making the doctrine of faithfulness to prevail.\n\nIt is a common custom of villages to furnish mutual protection against fire and flood.\n\nIn this village there was a gild in bye-gone days but one or two of the members did not attend to their duties properly and so it was discontinued long ago. But some of those, who regretted that the gild was abolished, have agreed with some others to collect money for the establishment of the gild and they plan to prepare some exact regulations for the gild. It is expected that all the members will love and help one another according to the dictates of these regulations. As the object of this gild is to secure love for parents, respect for elder brothers, loyalty to the king and confidence among friends it is earnestly hoped that the members will bear this in mind and never depart from the original purpose for which the gild was established. Will it not be a thing to cause admiration if all the members perpetually carry out these articles and never fail to give diligent heed to their duties in the gild?\nARTICLES.\n\nThe object of this gild is to forward the doctrines of love for parents, respect for elder brothers, loyalty to the king and confidence between friends.\n\nAll members must trust and love one another and live in harmony.\n\nNew members must obey the regulations and keep them always.\n\nEach new member must pay a gild fee of 50 nyang.\n\nGild funds, collected from members, shall be put out at monthly account.\n\nIt has been decided to choose only three so im (officers).\n\nWhen there is work to be done in the gild the low members must do it.\n\nIf any one join the gild for marriage and funeral benefits he must pay a fee of 100 nyang.\n\nAny one entering the gild for funeral benefits only shall pay 50 nyang on account of funeral benefits.\n\nA so im who attends diligently to his duties in the gild shall not be dismissed or changed.\n\nShould a member have a marriage or a funeral in his house within one year after the organization of this gild no gild money shall be given him but subscriptions shall be made for him by the members.\n\nWhen an announcement of a funeral or a marriage comes to the gild after the expiration of the first year it must be reported first to the three so im and then a benefit of 90 nyang shall be remitted.\n\nAny problem of any kind that comes up in the gild shall be decided after it has been reported to the three so im.\n\nIf any member absents himself without cause from an assembly of the gild when some matter is being discussed he shall have a low punishment imposed upon him.\n\nOn all meeting days of the gild the three so im must come first to the gild and record the members coming early or late.\nIf a member is late on three meeting days he must pay a fine of five nyang.\n\nWhen funds are put at interest the borrower must provide the names of three non-members as guarantors.\n\nIt has been decided to purchase a wedding outfit with gild money that it may be used when there is a marriage in the village.\n\nIt has been decided that mourning outfits shall be bought at the time when funerals are held.\n\nWhen a member living in another place has a death in his household the gild shall grant him 10 nyang instead of the mourning outfit.\n\nWhen a member does a wrong thing in the gild he shall be examined and punished.\n\nThe so im must not privately forgive wrong doers among the members when they are supposed to be punishing them.\n\nWhen one of the parents of a member dies all the members must go and condole with him in his mourning and each member must present him with some part of a mourners outfit.\n\nWhen an extra tax is collected from the members by the magistrate it shall be paid by the funds of the gild.\n\nDisobedience to a rule of the gild will bring a high punishment upon the member.\n\nWhen a member begins to talk before the three so im at a meeting of the gild for consultation regarding something that has happened in the gild a middle punishment shall be imposed upon him.\n\nNo members shall be allowed to sit in the places reserved for the three so im and certain other elders.\n\nIf business prevents a member from attending a meeting on gild day he should send a petition to the gild before the day of meeting and ask the so im for leave of absence. In such a case no punishment shall be dealt out to him.\n\nIf a person creates a disturbance when a meeting is in progress a low punishment shall be imposed.\n\nWhen there is some work to be done at the gild and a low\nmember is sent to do it his food expenses shall be paid from gild funds.\n\nIf trouble arises in the village from fire, floods or thieves all the members of the gild must assemble and render aid to the village.\n\nWhen the gild members all assemble to help the village in time of trouble any one who is absent shall be expelled from the village after he has been severely punished.\n\nAmounts of Fines.\n\nHigh fine ... ... ... ... ... ... ... 25 nyang.\nMiddle fine ... ... ... ... ... ... 12 \",\nLow fine ... ... ... ... ... ... ... 7 \"\n\nOfficers.\n\nI Chon Ui.\nI Kong Oan.\nI Yu Sa.\n\nREGULATIONS USED IN THE YE CHOONG KEI.\n\nReport of the Consultation of the Ye Choong Kei in...........\n\nWe live together in this neighborhood enjoying ourselves in a peaceful and prosperous manner, each following his own profession or calling. For us the most important thing is kindness and harmony for we cannot live without them for even a single day. We believe that kindness and harmony are the product of love and righteousness.\n\nWhen we are conducting some undertaking, such as a marriage or a funeral or indeed any other affair, and whether it be hurried or deliberate some of us fail to proceed in the proper way. There are two reasons for this; some because they have no power or money and some because they ignore the ceremonial methods.\n\nIn our village are many different persons; old and young, superior and inferior, wise and stupid, strong and weak. These\nmeet together at various times in interviews and discussions. In most meetings where there are important matters relating to the village to be discussed the persons who have power suppress the humble, the rich mock the poor and the young jeer at the aged. Because of such things the problems cannot be settled.\n\nIn consideration of the above matters and in order to preserve kindness and harmony we have consulted regarding the interests of the old and young and established this society which is called the Ye Choong Kei.\n\nThe objects of the gild are as follows:\n\nAny person who has to meet the expenses of a funeral or a marriage will be aided by subscriptions and collections of money and rice from each of the village houses.\n\nFurther matters relating to the repairing of the road an sacrifice to the spirit of the mountain will be arrange for in the same manner.\n\nBesides these things, any person who commits an offence against the moral law will be made an example for the rest by the punishment of severe blows with a whip, by requiring a monetary fine or by being expelled from the village.\n\nAlso we have organized a society for preserving pine and other trees that are growing in the forest so that we may have them for future use. We have decided that anyone who cuts them shall be punished.\n\nWe sincerely hope that all of us will make up our minds to observe these regulations and not commit a single offence. Thus love, righteousness and politeness will become the sources of all virtues and our descendents will follow us into the regions of truth and goodness.\n\nDate...........\n\nPlace..........\n\nYe Choong Kei.\nBYE LAWS FOR FUNERAL RITES.\n\nAn intimation of a funeral that is to occur must be sent to the gild house stating whether the deceased is father or mother of the member.\n\nNo intimation shall be received except in the case of the death of the member himself or his father or mother.\n\nAnyone who makes a mistake in writing the intimation shall be fined 10 nyang.\n\nIf anyone gives false intimation he shall be expelled from the gild after being punished with thirty blows.\n\nMembers of the gild shall make subscriptions after the matter has been investigated.\n\nThe headman of the village shall be the collector of subscriptions.\n\nEach house shall give one toi of rice and ten nyang in money.\n\nOne of the members shall be chosen to go to the house where the funeral is to occur to condolé with the mourners.\n\nTen persons from the membership shall be chosen to protect the funeral bier.\n\nEach of the protectors shall be given five nyang for food.\n\nAnyone of the protectors who fails to come on the appointed day of the funeral shall be given twenty blows.\n\nThe headman of the village shall be the leader of the protectors.\n\nThe Ho Sang Cha Chi shall be given ten nyang for food.\n\nAny of the members who refuse to make a subscription when the collection is taken shall be punished with thirty blows of a whip and fined 50 nyang.\n\nFive persons shall be chosen to welcome the funeral when it returns.\n\nEach of the five welcomers shall be given five nyang for food.\n\nAny of the welcomers who fail to come on the day appointed shall be given ten blows with a whip.\nInformation shall be delivered to each member when a notice of death arrives.\n\nAnyone who delays in delivering the information shall be fined 10 nyang.\n\nThe information concerning the death shall be sent to the headman of the village first.\n\nIf the headman delays in delivering the information he shall be given thirty blows.\n\nIf the headman spends what has been collected he shall be given thirty blows.\n\nAny of the protectors of the bier who do not attend to their duties shall be given thirty blows.\n\nAny of the welcomers who do not attend to their duties shall be given twenty blows.\n\nIf the headman spends what had been collected he must pay it back in full after he has been punished.\n\nBYE LAWS RELATING TO WEDDINGS.\n\nAn intimation of an intended wedding must be sent to the gild stating therein whether it be the member's son or daughter.\n\nIntimations shall be accepted only in the instances of son, daughter, grandson or grand daughter or of the member himself.\n\nAn intimation should be sent ten days before the date of the wedding.\n\nAny person who makes a mistake in writing an intimation shall be fined ten nyang.\n\nIf anyone makes a false intimation he shall be expelled from the gild after being punished with fifty blows.\n\nThe members of the gild shall make subscriptions after an investigation has been completed.\n\nEach house shall subscribe one toi of rice and five nyang of money.\n\nThe head man of the village shall be the collector of the subscriptions.\n\nIntimations of weddings should be first sent to the headman.\nIf the headman delays in circulating the notice he shall be punished with thirty blows.\n\nAfter the intimation has been sent to the gild a notice shall be forwarded to each member.\n\nAny one who delays delivering the notice shall be fined ten nyang.\n\nIf the headman spends what has been collected he shall be fined 50 nyang and given thirty blows.\n\nOn the wedding day one of the members shall be sent to the house to congratulate the owner.\n\nOn the wedding day six strong men shall be sent to the house to attend to business.\n\nEach attendant shall be given 2 1/2 nyang for food.\n\nAny one of the attendants who does not come on that day shall be given 10 blows and fined ten nyang.\n\nAny one of the attendants who does not attend to his duty shall be given ten blows.\n\nAny one who does not pay his subscription or who delays paying it shall be fined 50 nyang and given 30 blows.\n\nAny one who spends what has been collected shall pay back the amount besides being punished.\n\nBYE LAWS OF SACRIFICE TO THE MOUNTAIN.\n\nThe date of sacrifice shall be appointed after harvest during the tenth month.\n\nThe object of offering sacrifice is to implore peace for the village and a plentiful year.\n\nA lucky day shall be chosen for the sacrifice.\n\nThe date shall be postponed if any unfortunate incident occurs in the village such as a death or other impure matter. Another date shall be chosen when it is postponed.\n\nThe sacrifice shall take place one month after the date is settled.\n\nNo guest shall be allowed to stay in the village after the date is settled. If he stay one night after settling the date he\nshall be forbidden to leave until the day of sacrifice. Any guest shall be free to leave after the sacrifice has been offered.\n\nAny one who sends a guest away before the day of sacrifice shall be fined 50 nyang and given 30 blows.\n\nThe preparation for the sacrifice shall be made by the villagers in turn annually.\n\nThe house where the preparation is made ought to be pure and neat.\n\nIt is forbidden to take money, grain, hemp or silk in or out of the house of preparation.\n\nIf there is any disrespect or carelessness in the house the date of sacrifice shall be postponed. When the date is postponed the expenses of the next preparation shall be paid by the house of the former preparation.\n\nEach person in the village must come up to the mountain to pray on the day of sacrifice.\n\nThe things prepared for sacrifice are as follows:\n\n| Item                  | Quantity |\n|-----------------------|----------|\n| Ox                    | 1        |\n| Plates of glutinous rice cake | 3        |\n| Kinds of fruit        | 5        |\n| Plate of cabbage pickle | 1        |\n| Herrings              | 50       |\n| Fine mats              | 5        |\n| Plate meat broth      | 1        |\n| Coarse mats            | 10       |\n| Bottles of clear wine | 3        |\n| Incense stove and one incense box | 1        |\n| Jars of thick wine    | 3        |\n| Pairs of large wax candles | 3        |\n| Sacrificial table     | 1        |\n| Pairs of candle sticks | 2        |\n| Awning                | 1        |\n| Torches               | 10       |\n\nThe expenses of preparation shall be met by collecting money from every house or by funds remaining in the treasury of the gild.\n\nAny one making a disturbance or behaving disrespectfully shall be given thirty blows and fined 100 nyang.\n\nAfter sacrifice the food shall be eaten by those offering it. The remaining food shall be divided equally and sent to every house.\n\nThe headman of the village shall collect the money for the expenses of sacrifice.\nAny one who delays in giving the collection shall be given 10 blows.\n\nIf the headman spends what has been collected he shall be given 50 blows and fined 200 nyang, besides paying back what he spends.\n\nBYE LAWS RELATING TO MISCELLANEOUS MATTERS.\n\nOne person from every house must come to work at the time of repairing the road. The expenses shall be met by funds remaining in the treasury of the gild. 2 nyang shall be given to each person for food.\n\nAny one who is absent at the time of repairing shall be given 10 blows.\n\nThe notice of repairing shall be delivered by the headman of the village. If the headman delays in delivering the notice he shall be fined 50 nyang.\n\nIn the season of ploughing and hoeing the fields the work shall be shared by all. Harvesting shall also be shared by all.\n\nThe expenses of this work shall be met by the owner of the fields.\n\nBYE LAWS RELATING TO THE PRESERVATION OF PINE TREES.\n\nWe plan to keep pine-trees growing in the forest in order that they may be used hereafter. Any one who cuts down a large pine tree shall be brought to the Magistrate and punished. If he cuts down from one to ten young trees he shall be given 50 blows and fined 200 nyang. If he cuts down large branches of pine trees he shall be given 30 blows. For cutting small branches he shall be given 15 blows. Any one who cuts down a large tree, not of the pine variety, shall be given 30 blows and fined 100 nyang.\n\nIf any one makes an arrangement with the wood cutter he shall be punished equally with the cutter.\nAny one who shakes the leaves from the pine trees and collects them shall be fined 50 nyang.\n\nWhen there are pine grubs coming out in the forest the villagers must destroy them before they become abundant. One person from every house must take a part in the work of destroying the grubs for three day periods in turn. Any one who is absent at the time of destroying the grubs shall be fined 20 nyang. Any one who comes at that time must bring his food with him.\n\nBYE LAWS RELATING TO THE RECEIPT AND USE OF MONEY RECEIVED FROM FINES.\n\nFine money shall be received in monthly installments during ten months. Interest on fine money shall be charged at the rate of twenty percent increase on the amount borrowed.\n\nAny one who wishes to borrow on monthly installments must provide three guarantors.\n\nAny one who does not pay the installments for more than one month shall be charged more interest. If he does not pay for three months the guarantors shall pay the debt.\n\nThe date of receiving installments will be the 15th of every month.\n\nThe expenses of matters that arise relating to the village will be defrayed from the monthly receipts.\n\nBYE LAWS RELATING TO PUNISHMENTS AND REPRIMANDS.\n\nAny young man who does not respect the elders shall be given 20 blows.\n\nAny one who insults and fights with others after drinking much wine shall be given 30 blows.\n\nAny one who oppresses weak persons and beats them shall be given 10 blows.\n\nAny one who does not come on the date the gild is opened shall be fined 10 nyang.\nAny one who gets drunk and beats others on the date of the gild meeting shall be fined 50 nyang.\n\nAny one who does not obey his parents shall be expelled from the village after receiving 50 blows.\n\nAny one who disagrees with his brothers and quarrels with them shall be fined 100 nyang and given 50 blows.\n\nAny one who does not respect his friends and quarrels with them shall be fined 30 nyang and given 30 blows.\n\nAny one who insults and mocks this organization shall be fined 50 nyang.\n\nAny one who harms the village by wrong doing shall be expelled from the village.\n\nAny one who commits a great offence against the moral law shall be expelled from the village and brought to the magistrate for punishment.\n\nList of those who may claim help in the case of a marriage or a funeral\n\nMr. Yi, his father  \nMr. Kim, his mother  \nMr. Choe, his son  \nMr. Chi, his daughter  \nMr. Kang, himself  \nMr. Tai, his grandson  \nMr. Nam, his granddaughter  \nMr. Mah, himself  \nMr. Moon, his father  \nMr. Pak, his mother  \nMr. An, his son  \nMr. Chyeng, his daughter\n\nList of those to whom subscriptions will be given.\n\nMr. Yi's house  \nMr. Cho Pok Nam  \nMr. Kang's house  \nMr. Chyeng No Mi  \nMr. Han's house  \nMr. Yi Kap Dol\n\nThere is a notable lack of uniformity among Korean villages in the matter of government gilds. Many villages do not have such gilds. Most villages, however do have a village assembly which chooses and is presided over by its headman. And when a village gild is established this assembly is ordinarily swallowed up by the gild; then the gild constitution becomes the code of laws for the village and the gild president may become the village headman. In at least one instance how-\never, there seems to have been a dignified man nominally holding the post of Chon In (village headman) and also a Yung Ui or Gild president who was the acting headman of the village. Various villages have worked out this matter of the relationship of the village assembly to the village gild in various ways. We presume that the gild is the more developed and complicated type of popular village government. The primary idea of the Korean kei or gild is the use of money for mutual benefit purposes and when adopted by the village community as a whole it adds these mutual benefit features to the purely governmental activities of the ordinary village assembly.\n\nAlthough the village government gild is probably lacking in a majority of Korean villages the village customs which a study of these gild records reveals, are universal and the village head-man is an always present feature.\n\nThe writer has talked with a number of villagers who admitted that the functions of the gild as revealed by a study of the records in hand were fully undertaken by the members of their respective communities and they have pointed out his home or introduced me to the village headman and the place of meeting but said there was no such gild in the village.\n\nThe village headmen go under various titles. Some of these are honorific and need not be discussed. The highest ranking headman is a Myen-chang or Myen-chung. He is the headman of a myen or as we should say in English a county. While the Myen-chang was originally elected as spokesman by the leading villagers from all the villages in the Myen, assembled in his presence by order of a government magistrate, this office has not always been at the disposal of the popular assembly in the past and the report of the Government General for 1911 says that the myen-chang is to become a regularly appointed government official.*\n\nAnother kind of headman is called a Ye Chang or head of a ye. The ye being a district or township. There is also the Tong Chang. The head of a tong or village. The term which\n\n* Third Annual Report (English) of the Government of Chosen.\nthe writer has most frequently met in these records is Chong Ui. He is ordinarily the head of a tong. When a headman is called Yung Ui or Yung Choa it is probable that he is president of one of these village gilds and in that capacity is acting as village headman.\n\nThese variously named headmen are indistinguishable to the ordinary observer and are all chosen by the leading men of the community over which they preside.\n\nFor instance Mul-Ami is a considerable village on the river not far from Seoul. It was in close contact with the central government offices and therefore the record showing the independent action of the village assembly is doubly interesting. The following quotations show how their headmen were secured:\n\n\"Decision of the Conference held in the Year—Kap Cha, 1865.\n\nThe following decisions were made at our conference and recorded as follows:\n\nIt is very important that we should select two officers, one to be the common headman (Choong-In) and the other to be a special headman (Pyel-Im). It is the business of both of these men to see that the affairs of the village and the government are properly carried out.\n\nIt is a very difficult thing for us to secure a headman because when one is appointed he does not want to take the position but insists on resigning whether or no. There are so many taxes to be collected and the money is spent so easily. Because of these considerations we consulted over the matter and decided that the appointment of our headman will be reported to the magistrate after one is selected. Then he will be forced to attend to his duty.\"\n\nSigned Chion-Ui.\nChoong-In.\n\nThe expression, \"Choose\" or \"Select\" is used eight times in these records in connection with securing gild officers.\n\nThe selection of gild officers is made by the villagers assembled in their gild. Four instances can be cited.\nMoreover the village gilds undertake to control and correct their own officers in a very different spirit than is shown by Koreans in the submissive attitude generally assumed toward Government officials.\n\nProvision is made for the punishment by the gild of an officer who fails to attend to his duties. Six different places may be cited.\n\nIf a gild official is guilty of a great wrong he is turned over to the Government. In gild number fifty three the so-im who missused gild funds was promised severe treatment. He was to receive thirty blows with a whip for using funds he collected for a wedding or a funeral and fifty blows for appropriating funds collected for a sacrifice. There were also fines imposed for these transgressions.\n\nThe village gild outside the South Gate of Seoul ordained that any officer who failed to come to a meeting of the Tai-Pang when there was business to be considered should be expelled from the society.\n\nThe question as to who constituted the membership of the gild which thus chose and controlled its officers becomes a relatively important one.\n\nAmong the twelve sets of records in hand there are a number of instances in which a portion only of the village community have held consultations and taken the initial steps in organizing or reorganizing a village gild.\n\nIn the Kwang Choo regulations the following sentences appear in the introduction;\n\n\"In this village there was a gild in bye gone days but one or two of the members did not attend to their duties properly and so it was discontinued long ago. But some of those who regretted that the gild was abolished have agreed with some others to collect money for the establishment of the gild.\"\n\nDocument number twenty six* opens with the statement.\n\n\"The object of this circular is to afford the information that\n\n* When Gild constitutions are referred to by number the latter indicates its position in a file of gild records collected by the writer.\ncertain persons in the town have nothing to rely on and have therefore decided to establish a gild in order that they may help each other in trouble.\"\n\nIn number thirty five appears the clause.\n\n\"Certain gentlemen who reside in this town have decided to establish a town gild.\"\n\nOne page of the gild book of the Kak Sin Society has the names of thirty two of the leading men of the place written as the reorganizers of their gild.\n\nThe first thought that comes after reading these quotations is that these four gilds at least were limited to a part of the resident villagers but in the Kwang Choo regulations there are, among other broad stipulations, some regarding the fighting of fire, flood and thieves on behalf of the entire village. Number twenty six requires every house in the village to be registered on its roll and in number thirty-five it appears that the \"Certain gentlemen\" mentioned are organizing the gild on behalf of the poverty-stricken villagers at large. At Kak Sin the terms for gild and village and those for members and villagers are used without discrimination and at certain times each household is required to make subscriptions upon orders coming from the gild. In these four places gild membership or at least the jurisdiction of the gild was not limited to a portion of the local villagers. A further consideration of the material at hand bears out the conclusion that the village government gild was generally co extensive with the population or at least included the heads of all households.\n\nAt An Sung \"some well-known citizens\" established the gild but the regulations provide for, \"All the people of all the villages\" taking part and further state that, \"If any of the people refuse in any particular to obey the regulations their wrong doing shall be reported to the magistrate's office after they have been severely punished.\" One of the sections reads, \"The names of the inhabitants of every village must be recorded on the roll.\"\n\nOne of the uppermost reasons that a gild was desired in\nsome village outside the South Gate of Seoul, whose name we do not know, was that the young did not show proper respect to their elders and the gild was considered a suitable weapon for bringing the body of young men in the village to becoming manners. \"We in the Orient,\" wrote the organizers, \"formerly followed the laws of ceremony and were advanced but these features have been driven away and lately there is no difference between the old men and the young men. How can we help but be very sad?\" This gild also identifies itself with the entire village by announcing that if any one transgresses this law (of respect for elders) the village people will assemble and punish the transgressor with thirty blows of a whip on the back. The gild further legislates certain actions for all the residents.\n\nWhen gild number fifty-three assembled there was sometimes difficulty to decide questions because of the mixed character of the assembly. There were, \"Old and young,\" \"Superior and inferior,\" \"Wise and stupid,\" \"Strong and weak,\" \"Those who had power and the humble,\" \"The rich and the poor.\" A reading of this document makes it quite plain that the entire neighbourhood belonged.\n\nInteresting information as to the number and kinds of meetings held by these gilds; the names of officers and their duties; the methods of punishment and the offences dealt with; the means of securing and handling finances and the interrelation of branches might be compiled but the limits of this paper require its restriction to the functions of these societies.\n\nThe village gild is frequently the agent for carrying on the complete system of village government.\n\nThe introductory circular to number twenty-six contains the words, \"It,\" the gild, \"will also provide regulations governing everything that is done in the village.\"\n\nParagraph eleven from the regulations of the Ye-Choong-Kei at An Sung suggests that the gild took all things that occurred within the village under its jurisdiction. This paragraph reads.\n\n\"The three officers assume their duties monthly in turn\nand make a monthly record and report of matters that occur in the town and in the gild. They shall report all to the Five Kang Soo, who shall decide all questions of lighter import. When a question is of too great importance for the five Kang Soo to decide they shall refer the matter to the Tong Chang. Should the matter be of too great weight for the Tong Chang he shall report it to the Chip Kang. Thus all the people in the village will be subject to the authority of the Chon Ui and be governed by his orders.\"\n\nThe village gild pays two kinds of taxes to the central Government. We note that four of the twelve organizations, whose records we are considering, collect assessments from individual residents or secure them from some other source and pay taxes to the government or government officials on behalf of the community as a whole.\n\nThe constitution of the Kak Sin gild says that when high or low Government officials come to the place each house must subscribe two mal of unshelled rice and three chun in money. It also states that such officials shall be given their morning and evening meals with the cost of tobacco and wine.\n\nIn Mul-Ami the gild paid out funds to Government officials on a long list of pretexts, some were for the personal needs of the officials and some were for purely governmental purposes. We copy a few of the more striking ones;\n\n\"To purchase husks and sediment of grain for feeding the cattle offered every month to the magistrate.\"\n\n\"The cost of meals for the writer (ajum) in the magistrates office during five months of every year.\"\n\n\"The customary offering to the servants of the census bureau.\"\n\n\"For expenses when the magistrate's writer comes with drivers and coolies to examine the people. (Five tone for the drivers, five tone for the coolies and the balance for the writer.)\"\n\n\"In lieu of a uniform for the writer in the magistrates office.\"\n\n\"Expenses for drink for the servants of the office of the royal funeral bearers at the time of roll call.\"\n\"Customary offering to the magistrate once in four years to feed his yellow dog.\"\n\n\"Customary offering for feeding the magistrate's pigs, etc., etc.\"\n\nIt is no surprise to find in the introduction to these regulations from Mul-Ami the statements, \"The village is poverty stricken..............We are unable to support ourselves because of the taxes.\"\n\nIn addition to the above type of taxes paid by the gild we observe that the gild was an agent for collecting and remitting private taxes. The Kwang Choo regulations contain the statement;\n\n\"When an extra tax is collected from the members by the magistrate it shall be paid by the funds of the gild.\"\n\nThe An Sung regulations read,\n\n\"All inhabitants in all villages are accustomed to delay the payment of their land and house taxes to the Government office, therefore it has been decided that new regulations shall be made saying that the chief district justice (the Chon Ui)................shall take charge of collecting the taxes in all the villages................also that house and land taxes shall be collected up to the first of the twelfth month of each year. However as some of the people find it very difficult to finish paying the taxes before that time the so-im of the town shall take charge of the balance of the taxes. It is earnestly hoped that all the people in all the villages will be careful not to cause the magistrate to make trouble and will for this reason pay up their taxes before the people of other districts do so.\" Not only did the gild collect and remit the taxes in this latter village but it even advanced the tax of certain villagers who were in hard circumstances.\n\nIn Yong In the tax list was kept along with other gild records by gild officials. This gild also has an officer known as the tax collector.\n\nAmong a number of local public works undertaken by these societies is the keeping of the local roads in repair.\nThese roads are seldom more than good sized cow paths running upon the dykes or on the ridges between fields in such places as the whim of local circumstances has chosen to locate the bounderies of possessions. The central Government has at times done something to build roads for royal progresses. These however, were too frequently between the palace and the site of a royal ancestral tomb and only incidentally of commercial and practical benefit. Local magistrates occasionally did something in bridge building and sent orders to villages to repair the roads in their locality but in general all activity in this particular line was left to the autonomy of individual villages. The keeping of these local highways or the local section of a through highway in repair was generally considered the concern of the village assembly or gild but in only one of the sets of records before us is this function mentioned. It reads as follows:\n\n\"One person from every house must come to work at the time of repairing the road. The expenses shall be met by funds remaining in the treasury of the gild. Two nyang shall be given to each person for food.\n\n\"Any one who is absent at the time of repairing shall be given ten blows.\n\n\"The notice of repairing shall be delivered by the headman of the village. If the headman delays in delivering the notice he shall be fined fifty nyang.\"\n\nThe maintenance of the live timber near the villages was often undertaken by separate voluntarily organized tree protecting gilds. The writer has the written regulations of three such in hand and while it is probable that this function may have often come under the province of the village gild, as in the case of road repairing, only one speaks of it in its regulations. It has already been quoted in the sample given.\n\nFour of these twelve sets of records speak of helping at fires as a function of the gild, making the following stipulations:\n\n\"All gild members must assemble and render aid when fire\nbreaks out.\" In Kwang Choo a member was liable to expulsion from the village if he did not do so.\n\nGild number fifty four provided a grant from gild funds for a member whose house had burned down, and in the records of gild number twenty six it reads. \"The materials that shall be given from each house when a calamity of fire has occurred to one of the members shall be:\n\nOne wooden pillar.\nCertain additional specified pieces of timber.\nA certain number of bundles of straw.\nA certain number of bundles of straw string.\nA given amount of money for building expenses.\nA certain number of measures of rice.\n\n\"It has been decided that each of the members must come with a workman and help rebuild the house of a man who has met calamity from fire.\"\n\nThree of the documents speak of aid when danger or disaster from floods arise. In Kwang Choo and in the gild outside the South Gate of Seoul all members were required to assemble and help the village at such a time.\n\nThese gilds ordinarily organize the villagers for united resistance to marauding bands of robbers for there has been a great deal of organized robbery in Korea. Especially in Winter and in years of scarcity bands of robbers are numerous.\n\nAll gild members must assemble, when robbers come, and aid in driving them away.\n\nThe conditions under which the alliance, number forty, was organized is an illustration of this condition in a pronounced form. The community seems to have been divided between the robber group and the village group and neither was without blame in its actions.\n\nIt is customary in villages for the gild to concern itself with all cases of a criminal character and settle minor ones without taking them to a Government official. But when the transgression is of sufficient flagrancy for the officers of the gild or\nthe assembled body of villagers to conclude it should be punished more severely than they are ready to undertake the criminal is handed over to a Government magistrate. The general wish of the gild is to facilitate the magistrate in his duty of keeping order and to undertake only such services as are otherwise left undone.\n\nIn the administration of justice and keeping the public peace the gild resorts to the following methods of enforcing its will;\n\nIt assembles the entire community to act on cases of lawlessness among its membership. It imposes monetary fines, whippings and expulsion from the village.\n\nA system of policing and self government by means of dividing the community into five or ten house groups was at one time copied from China and universally employed in Korea. There are still instances of its use in the practises of these village societies and in other gilds. In an ancient Chinese classic, the Chou Li, which describes conditions under the Chou dynasty some centuries before Christ, this scheme is outlined.* It provides for the division of households into groups of five with one of the householders appointed as leader and responsible to the village headman for the acts of the members of the five households under his jurisdiction. Mention is made of this system of administration on the stone drums in the gateway of the temple of Confucious in Peking. These drums are said to be the most ancient monuments in China.† In Japan this system has been embodied in the local governments and was generally enforced during and after the reform of 645 A.D.‡ On the continent of Europe and in Old England also are to be found evidences of\n\n* Journal of the American Oriental Society, vol. xxxi, Pt. ii, 1911, Pg. 192. Article by Prof. K. Asakawa, Ph.D. entitled \"Notes on Village Government in Japan.\"\n\n† Guide Book to Peking containing translation of the writing on the stone drums of the Confucian Temple.\n\n‡ Journal of the American Oriental Society, vol. xxx, Pt. iii, 1910, Pg. 267. Article by Prof. K. Asakawa, PhD. entitled, \"Notes on Village Government in Japan.\"\nthe same method of keeping the peace in local communities.§ It is interesting in the light of these facts to read the following from the regulations of document number seventeen:\n\n\"It has been decided to form an organization uniting houses into groups of five for mutual protection. This is according to the instructions of the mayor (Pu-Yung) and the imperial order.\n\n\"When a person living in a group of five houses commits a wrong he shall be severely punished. If the wrong doer does not take his punishment the tong-soo, leader, of the five houses in which he lives shall be punished in his stead.\n\n\"If rowdies cause trouble without having just cause for doing so all the people in the group shall help to drive them away from the town and report the matter to the government office.\n\n\"It has been decided to forbid drinking and gambling and if any one commits a sin he shall be reported to the government office and the tong-soo of the house where he lives shall be punished, etc.\"\n\nThe officers whose names are attached to this document are all of them dependent on popular choice for their posts. A number of well informed Koreans have told the writer that this system was at one time quite generally enforced in Korea by order of the Central Government. In the village of An Sung a number of hamlets were scattered around a larger central nucleus, in all containing one hundred houses with about five hundred people. In order to properly control the outlying districts a plan similar to this system was adopted. It reads as follows:\n\n\"It has been decided to select a number of the members and place some in every village as private inspectors of the people. Each of these officers shall have oversight of ten houses and if any of them fail to report the wrong doing of those under their inspection the responsibility shall be thrown\n\n§ Pamphlet entitled, \"Two Chapters on Mediaeval Guilds of England,\" Pgs. 13, 14. Prof. R. A Seligman.\nupon the Cha-Chi of the gilds. Wherefore it is hoped that all the inspectors will attend faithfully to their duties.\n\n\"It has been decided to send gild members to the surrounding villages in this district and there establish village gilds. Yu Yer Pak shall be sent to the northern part of the district to take charge of the villages in that direction.\n\n\"It has been decided to send a Cha Chi to Yun Chon village where there are twelve houses and examine the residents to see if they pass their time quietly without creating distributions. If so they shall receive a special reward but if not all the people from all the villages must assemble and consult as to how the people in those houses should be punished.\"\n\nIt will be noted that in both of the latterly quoted places the policing of the towns was a main object in view.\n\nThe functions thus far described are such as are ordinarily considered within the sphere of a municipal or village government. There are some of a mutual benefit character which are also accomplished by these societies.\n\nFor example the rendering of aid at funerals. The Confucian emphasis on the ceremonial in funerals demands the expenditure of so much time and money that it is practically impossible for any but the wealthy Korean to conduct one of these ceremonies in a commendable manner. This fact has given prominence to those organizations which undertake to command the attendance of a body of mourners and promise a grant of funds in aid at such times. Funeral and marriage benefit societies are numerous in Korea and while only six of the twelve whose records we have, speak of affording aid at funerals it is probable that in every small village represented on the list the members of the gild have constantly given aid to each other at these times of \"Gladness and annoyance\" as they are called. In the larger villages such as Mul-Ami the village government assembly was probably supplemented by a number of voluntary yun ban or funeral societies in the accomplishment of this function. These societies would be organized by members of the same trade or artizan's organization or commercial\ngild. Sometimes a group of neighbors form one and most frequently brotherhood or friendly societies of men of kindred mind undertake to aid each other in this way. The author has a number of the records of each of these types of village organizations. Various Christian churches in Seoul are said to have recently established them among their respective groups of members. In the small country villages the entire community organized into its village gild seems to have undertaken the task of thus co-operating in these times of financial stress.\n\nA grant of money or rice is given to the member at whose house a funeral is to be held. This grant is sometimes made from funds that have been gradually accumulated from fees and regular dues as an endowment or it may be made by taking up a subscription, at the time of the funeral, from each gild member. Taking and giving funeral benefits is in some instances optional with a gild member, depending on the nature of his membership. Aid in the matter of articles of mourning outfit is sometimes granted.\n\nThe gild requires that its members shall go to the home where death has come and condole with the household.\n\nMen are provided to aid at the funeral.\n\nMen to go forth and ceremonially meet those returning from a burial are provided.\n\nProper forms of announcements must be followed.\n\nThe gild provides a funeral director.\n\nThe gild may pay the expenses of the men it sends to aid at a funeral.\n\nThe same kind of financial burdens that come with funerals are attendants upon wedding ceremonies, although not quite so heavy, and the presence and aid of many friends is also a desideratum. Three of the twelve societies under consideration definitely speak of rendering aid at weddings.\n\nGrants of money or rice are made from the gild treasury, or subscriptions of rice and money from each fellow member are promised. Some gilds loan a regular wedding outfit which it keeps\non hand for the use of members on such occasions. A gild representative is ordinarily sent to ceremonially offer congratulations on the wedding day. Strong men, probably palanquin bearers, were promised as aids on the wedding days in one society. Proper forms of announcement must be followed and in gild number fifty-three, at least, the wedding benefits are restricted to the marriage of the son, daughter, grandson and graddaughter of a member or to the member himself.\n\nTravelers in the interior of Korea have noted that the farmers work in considerable groups at the busy times of the year. Such groups may be voluntary organizations known as farmers gilds having written constitutions such as the twelve we are considering, or as in the case of number fifty three this work may be done under the direction of a village government organization. The constitution of this society reads.\n\n\"In the season of plowing and hoeing the fields the work shall be shared by all. Harvesting shall also be shared by all. The expenses of this work shall be met by the owners of the fields.\"\n\nIn gild number forty the document reads.\n\n\"It has been decided to render assistance in times of trouble and when public or private controversies arise.\"\n\nAlso in gild constitution number twenty-six the first paragraph reads.\n\n\"Certain persons in the town have nothing to rely on and have therefore decided to establish a gild in order that they may help each other in trouble.\"\n\nThe expression \"In trouble\" in this latter clause may not mean as much as in the first quotation but the frequency of the practise of utilizing organized groups of people to stand by each other in the securing of justice, collection of debts or in resisting collectors of debts, sometimes in securing protection from the oppressions of officials of the Government and in many similar coercive acts, more or less commendable in their intent, lead the student to interpret these clauses as showing that the village gild is sometimes used as a weapon in individual community quarrels.\nThe records of some of the commercial and craft gilds as well as of friendly societies describe in detail the methods pursued by the membership at such times.\n\nIn discussing the religious features, that seem to be rather prominent in village gilds, there are two lines of consideration suggested, one is the use which the gild makes of the sanctions of the Confucian cult and the other is the worship of the tutelary spirit of the village.\n\nFive of the twelve documents speak of conducting community sacrifices to \"The mountain,\" to \"The guardian spirit of the mountain\" or, to \"The spirit of the mountain.\" Number thirty-five speaks of collecting its outstanding loans and holding a feast in the Autumn at the same time that the other four have their general sacrifices and feast. Three speak of holding their sacrifices in the Fall. Two specifying the tenth month. The third of holding theirs in the Spring and Autumn.\n\nPart of the expenses of the sacrifice were met from gild funds and part from subscriptions of members in the village of Yong In. A sorceress was employed. Three hundred nyang from the gild treasury was given and each member of the village had to subscribe three measures of rice.\n\nIn Kak Sin the expenses were met by enforced subscriptions from each household and in gild fifty-three appears the ruling.\n\n\"The Expenses of preparations shall be met by collecting money from every house or by funds remaining in the treasury of the gild.\"\n\nVillagers were required not only to take a part in the subscriptions but in the sacrificial service as well. One specifying a punishment of ten blows on the back for absence. After the sacrificial ceremony was over the food was eaten on the spot by the villagers or taken to their homes. Gild number fifty-three has the fullest description of the system of village sacrifices. Its regulations may be noted in the second of the two sample constitutions given in this paper.\n\nThe gild acts as an aid to the Central Government by pro-\nviding the local administration in villages which the national Government failed to give.\n\nThe inability of the old central Government of Korea to establish and maintain a system that secured the proper administration of affairs in local communities, especially when they were at some distance from provincial capitals or magistracies, constituted one reason for the existence of the system of village self government societies. The perusal of the documents in hand shows that four at least of these societies originated or were re-organized under conditions of pronounced lawlessness. Moreover a purpose of securing peace and harmony is prominent in the records of nearly all the rest of the villages herein represented. The constitution of the gild at Yong In starts out by saying,\n\n\"The cause for these regulations is that towns in various districts lack fixed regulations and the people therein have found it very difficult to decide cases arising among themselves, wherefore the citizens in every town ought to assemble and consult about establishing an organization called a town gild and furthermore they should help each other so as to prevent those evil practices which are happening in every place.\"\n\nThe constitution of the An Sung gild begins.\n\n\"The purpose of this article is to say that the people of the town have no regulations handed down from generation to generation and spend their time in wine drinking and making disturbances in various places. The five or six hundred people living in the one hundred houses of the villages are in trouble and the town is on the verge of being broken up. Because of these things some of the well known citizens have decided to establish a town gild in various parts that those making disturbances may be tranquillized.\"\n\nAt Kak Sin the introduction reads:\n\n\"In its purpose of government the monthly gild has gradually failed and this is a cause for regret. The village of Kak Sin has degenerated more and more. Wherefore the government\nofficials have made frequent visits and much trouble has resulted to the village. Various persons have denounced innocent residents to the officials and both the officials and the false accusers have taken their money. The villagers have not been respected.\n\nWherefore this Constitution has been written and hereafter the people will meet with bad fortune or good fortune according to their acts.\"\n\nFrequent notice has been taken of gild number forty where the people in various villages were bothered by bands of thieves. The introduction reads.\n\n\"By the regulations of this alliance it has been ordered that some virtuous and elegant men shall be chosen from the people of each of the villages as Myen-Chang and Myen-Chung and Ye-Chang and Ye-Chung. After they are chosen these elders must assemble all the people in the towns and consult about organizing an alliance against thieves.\"\n\nThis latter gild record evidently comes from a place far distant from an official center. Each of the other three quoted is also from a more or less isolated village or group of villages but the one at Kak Sin is within reach of some official post. By comparing these with the gild at Mul-Ami, which is a large village in the suburbs of Seoul, the difference in their problems will be noted. Mul-Ami and Kak-Sin are burdened by the demands of officialdom and are organized to act in concert in fulfilling the demands of and resisting officials. Mul-Ami pays twenty-four different kinds of taxes to officials and Kak-Sin is so unmercifully \"squeezed\" that no one will serve as headman. The other villages reap none of the advantages of such police regulations as are maintained near official posts and are therefore struggling to organize protection for themselves.\n\nThere is nothing essentially unpatriotic or of a rebellious nature in any of these records. Some of the communities are greatly oppressed by officialdom but the ideal of loyalty to the Government is always evident. Number forty alone furnishes suspicions of high handed proceeding not in keeping with the commendable spirit prevailing elsewhere. But however true\nthis may be in general, the village gild often resisted individual Government officials. Note the following paragraph from the An Sung gild.\n\n\"When some of the people from the village have a verbal request to make of an official...........All the people from every village must gather and reach a decision after consulting about the matter.\"\n\n\"In Kak Sin a pitiful plight was reached and partly because of official oppression. The organizers of the local gild were of the opinion that it was because of lack of unity on the part of the villagers that this had come about. They said that happy conditions would be, \"the result of the people in the village uniting their minds and helping one another...............then the village,\" they wrote, \"will be without trouble and the business of farming and handling merchandise will proceed peacefully, etc.\" The opening sentences describe the sad conditions into which they had fallen.\n\n\"The village of Kak Sin has degenerated more and more. Wherefore the Government officials have made frequent visits and much trouble has resulted to the village. Various persons have denounced innocent residents to the officials and both officials and the false accusers have taken their money............The village headman refuses to serve for he who assumes the office of headman will see his house and family meet misfortune and will have no place to complain about his difficulties.\" That is to say he cannot get help from the Government for it is the Government officials who oppress him. After describing the effort to reorganize the regulations go on.\n\n\"When the Government officials come to the village we make no promise to provide them with anything but morning and evening meals and with the cost of tobacco or wine and if any official makes trouble by seizing a person's money the latter should come immediately and report to the gild. To officials who move about the place when not on official business none of the above mentioned things will be given.\"\n\nIt required some temerity to put in writing such a decision,\nand affix their names to it but the thirty-two leading men of the village, who composed the meeting for the reorganization of the gild, adopted the device called \"signing in a bowl,\" that is, they wrote their names in a perfect circle. Thus there was no head of the list who could be called to account by a Government official.\n\nThe general government recognized and utilized the village gild system. In general the magistrates in all parts of Korea seem to have accepted \\textit{en toto} the system of the village gild and recognized its chosen headman as the responsible representative. The officials probably did not admit of any curtailment of their authority to depose or refuse to have dealings with any individuals who might be chosen to these posts by their respective communities, yet as a matter of fact, the village choice was in general accepted by the government officials. The books containing the constitutions of these societies were sometimes stamped with the government stamps in the general government offices at Seoul.\nCOINAGE OF OLD KOREA.\n\nBy M. ICHIHARA, Ph.D.\n\nTo find and destroy the venerable old coins of Korea and replace them with new ones, which, whatever merits they may have in other respects, are destitute of those time-honoured oriental charms and of historic interest belonging to the old, has been my duty for many years. To perpetuate their memory, therefore, in some way or other, and so atone for my rather cruel treatment of them in the past is the task which I gladly undertake. To treat them, however, in a way such as an antiquary would is a work for which I am rather ill qualified. I have not much taste for it, nor does my time allow of it. What I am about to undertake is to give a rapid survey of the history of Korean coinage and to pause here and there at appropriate moments to describe the coins themselves.\n\nThe coinage history of Korea is such as one may well doubt its being worth studying at all. It is for the most part the history of cash or *yopchon*, higher coin having been but very rarely in circulation, recklessly issued, abruptly prohibited, re-issued and reprohibited, a repetition of the same thing over many centuries. The introduction of nickel coins in recent years, and the interference of the Japanese Government in the monetary affairs of the country, in still more recent years, gave, indeed, much variety to the monotonous record, but these have already been treated in the \"Report on Currency Adjustment in Korea\" prepared by the Bank of Chosen, and various reports published by the Government. I shall, therefore, no more than touch upon these recent changes. Necessarily my narration will be confined to that monotonous period in which issue and prohibition followed each other in almost endless succession, and I am afraid, with all desire to avoid tediousness, my paper will be far from interesting reading. For conveni-\nence sake, I have divided the whole period into three, that is, The Period prior to the Koryu Dynasty 高麗朝 (Before A.D. 936), The Koryu Period 高麗 (A.D. 936-1391) and The Ri 李 Period (A.D. 1392-1910).\n\nPERIOD PRIOR TO KORYU 高麗 DYNASTY.\n\n(Before A.D. 936).\n\nOf the coins of this period little is known and that little is hardly supported by authentic records. The Moon Heun Pi Ko 文獻備考 says (Vol. 32, Chap. 159): \"The land of Ko Koo Ryu 高勾麗 produces copper but knows not how to cast coins. The coins given by the Middle Kingdom were kept in the Treasury and often taken out and admired from hand to hand.\" The book further states that it was not until after the Ts'ung-ning era 崇寧 (A.D. 1102-1106) that the country learned to cast coins. Evidently there was no minting of coin during the period. There were indeed some Chinese coins, for China, with which Korea had intercourse from time immemorial, had coins of her own as early as the Chow 周 Dynasty (B.C. 1122), but then they were not used in Korea as a circulating medium, but looked upon as we look upon a rare old coin, something to be \"often taken out and admired.\" On the other hand, there seems to have been times in which blank pieces of iron were used as money in certain parts. The Sen Kook Sa 三國史 (See 海東釋史 Vol. 1. pp. 524-535) records: \"Jin Han Kook 辰韓國 (a state which occupied a part of the present Kyung Sang Do 廣尚道 about the beginning of the second century) produces iron, and in towns iron is used as we use coins in the Middle Kingdom.\" Again it is recorded in the Chun Shi 泉志: In the state of Shin-ra 新羅 coins have no inscription. But it is certain that, if such blank pieces of iron were used as money, it was very limited both in place and period, and that the mediums which were most in use throughout the period and throughout the country were rice and\nhemp. In the *Song-sa* 我史 we read: \"In Ko-ryu 高麗 people are engaged in trade; in the middle of the day fairs are held and they trade with rice and cloth.\" It says again: \"Manners and customs of the country resemble those of the Middle Kingdom, but fairs are held at noon in which they do not use money but trade with rice and cloth. Again in the *Ko-rin-yu sa* 羅林類事 we read: \"In Ko-ryu, they keep fairs morning and evening, and women carry with them willow baskets and small measures. They fix the price of things by means of rice and millet.\" These and similar statements abounding in Korean and Chinese books all point to the conclusion that rice and cloth were not only the principal mediums of exchange, but also the standard of value of commodities from earliest times, and we shall see later that this state of affairs continued even after the introduction of coinage into the country and was a constant obstacle to the diffusion of coinage. Nor is there any question that barter was most extensively carried on in these early times. Some opine that barter was the chief means of trading, and rice and hemp simply served to fix the respective values of the commodities to be thus exchanged.\n\nThere is evidence that some early native numismatists attributed the coinage of the Chosen Tong Po 朝鮮通寶, specimens of which now exist, to the age of Ki Si Chosen 箕氏朝鮮 which is about one thousand years before the Christian era. The absurdity of this assertion is self-evident and has already been exposed by later numismatists. It was evidently minted at the beginning of the Ri 李 Dynasty when the country was again called Chosen after the lapse of some one thousand years.\n\nIn summing up, we may say that Korea had no coin of her own during this period and what was in the country was not her own, nor used as money. It may seem strange that Korea whose civilization was so much ahead of that of Japan should have been left so much behind the latter country in the matter of coinage alone, for Japan had a coin of her own as early as A.D. 708, but all evidence points to the fact and there is hardly any room to doubt it.\nRemarks:—The Moon Heun Fi Ko 文獻備考 is a treatise on laws and institutions enacted under successive Korean kings and compiled by the Court Chroniclers. It is a very valuable work, perhaps one of the most valuable of all good things that Korean kings have left us, and undoubtedly the most trustworthy of all Korean books of its kind. It is chiefly from this book that information was obtained for this paper.\n\nTHE KO RYU 高麗 PERIOD.\n(A.D. 936-1392.)\n\nThe Moon Heun Fi Ko 文獻備考 (Chapter 159) says: \"In the 15th year of King Sung Chong 成宗 of Ko-ryu Dynasty (A.D. 996) iron coins were first used and high officials were ordered to put them into circulation on a good day.\" Though no word of minting appears in the statement, that they were minted and not introduced from China is shown by the fact that in the royal instructions issued by the next king, Mok Chong 穆宗, are found the words \"coins minted in the preceding reign.\" But if they were minted, they must have been minted by a method different from that followed in later periods, for the art of casting coins termed Ko Choo 鼓鑄 was, according to the Moon Heun Fi Ko, first introduced into the country some one hundred years later. No further record is found of this first coin of Korea nor is there to be found any specimen of it. Evidently it was very similar to those coined in later periods as is indicated by the term kwean sak 貨索 (string put through) or pang won 方圓 (square and round) appearing in the instructions issued by the next king. The coin was soon out of circulation.\n\nIn 1101, in the 6th year of King Sook Chong 肅宗, a silver coin by the name of Fun Biung 銀瓶 was manufactured, and in the year following the oldest Korean coin of which specimens now exist was minted according to the method then introduced from China. The coin then minted was the Hai-Dong-Tong-Po 海東通寶.\nOf the *Eun Biung*, nothing is known except that it was of silver, that it weighed one *kin*, was shaped after the form of the country and was commonly called *wal koo* 澗口. *Eun* 銀 means silver, *biung* 瓶 jar or vase, *wal koo* 澗口 large mouth. According to the idea conveyed by the name, therefore, it must have been something like a jar having a large mouth. Its description as being shaped after the form of the country suggests to us nothing of its form, as we have no idea as to what they conceived to be the form of the country.\n\nThe Hai Dong Tong Po 海東通寶 is of copper, circular in form with a square hole in the centre. Four characters Hai-Dong-Tong-Po 海東通寶 are inscribed on the face around the square hole and the reverse side is left blank. According to the style of the character inscribed the coin may be classified into four kinds; one in square style 楷書, another in semi-square style 行書, a third in seal style 篆書, a fourth in *happun* style 八分. A further subdivision may be made according to the size of the characters and certain slight peculiarities in their style making altogether 7 different kinds.\n\n**PHOTOGRAVURE I.**\n\n**HAIDONG TONGPO.**\n\n| Square Style. | Seal Style. |\n|---------------|-------------|\n| With Large Characters. | Reverse Side Common to all. |\n| With Small Characters. | |\n| With Short Capped 寶 | |\n| With Long Capped 寳 | |\n\nSemi-Square Style. Happun Style.\n\nWith Large Characters. With Small Characters.\nThere was another coin which, though history is silent concerning its minting, in all probability was minted simultaneously with the other, bearing the same characters but one, i.e. Hai Dong Chung Po 海東重寶, the character chung 重 replacing the character tong 通. Only one kind of this has been found, one in square style.\n\nPHOTOGRAVURE 2.\n\nHAIDONG CHUNGPO.\n\nSquare Style.\n\nThere were thus two different coins belonging to the Hai Dong coin, as the coins having the characters Hai Dong 海東 and minted about A.D. 1102, are termed by numismatists, Hai Dong Tong Po 海東通寶 and Hai Dong Chung Po 海東重寶.\n\nNow Hai Dong 海東 means \"east of the sea\" and is the name used by learned Koreans to designate their country irrespective of reigning dynasties as are also Dong Kook 東國 (eastern country) Dai Dong 大東 (great east) and, rather poetically, Kei Rim 雞林 (cock forest). It was evidently so called because it lies to the east of China across the sea.\n\nSome remarks on the name of Korea would, I believe, not be altogether out of place at this point. The name Korea by which the country is known to the world is not really the name of the country but of a dynasty and was applied to the country only while the dynasty was in power. The name Chosen by which we call the country was indeed the name of the country under certain dynasties but not always. The names mentioned above, though very rarely used by us, were applied at all\ntimes and to any part of the country, and it was these that were mostly used in the state documents to designate the country. It was sometimes called Dong To 東土 (eastern land). China was thought to be the middle of the world—Middle Country 中國, hence these names.\n\nThere is another group of coins in which the term Dong Kook is used to designate the country and which is thought to have been minted about the same time as the Hai Dong coins. The four characters Dong Kook Tong Po 東國通寶 or Dong Kook Chung Po 東國重寶 are inscribed on the face of the coins while the reverse side is left blank. The following are specimens of the Dong Kook Tong Po:\n\nPHOTOGRAVURE 3.\n\nDONGKOOK TONGPO.\n\nSquare Style.\n\nWith Large Characters.\n\nWith Small Characters.\n\nSeal Style.\n\nWith Long Capped 寶\n\nWith Short Capped 寶\n\nSemi-Square Style.\n\nReverse side Common to all.\n\nThe specimens of the Dong Kook Chung Po are as follows:\nThere are thus three kinds of the Dong Kook Tong Po when classified according to the style of inscription or five kinds when slighter differences are taken into consideration and two kinds of the Dong Kook Chung Po according to the order in which the characters are read or three kinds when the size of the characters are taken into account.\n\nThere is still another group in which the term Sam Han 三韓 is used to designate the country. Of this group there are also Tong Po 通寶 and Chung Po 重寶, the former of which may be classified into three kinds according to the style of the characters or four kinds when minor differences are taken into account, while the latter has only one kind, that is, one in square style.\nThe term Sam Han 三韓 means \"Three Han\" and was another name for Korea derived from the three states, the name of which all end in Han, i.e. Ma Han 馬韓, Jin Han 辰韓, Biun Han 辩韓, into which the country was once divided. The coins were minted under the Ko-ryu Dynasty but the exact date of minting is not known.*\n\nThe remarks of the Chun Chi 貨志 (history of coins) on these coins may not be without interest being the comment of Chinese on them many centuries ago. They speak of them in very high terms. \"Excellent workmanship\" 製作頗精 is the comment on the Hai Dong coins while they speak of the Dong Kook coins as having \"Form dignified and characters clear and even\" 輪郭渾重字畫明担. There is indeed some primitive rudeness in them; but in the matter of taste, their superiority over later coins seems to be quite evident,—a sad proof of Korea's degradation in art and taste.\n\nIt is to be regretted that no positive proof as to the date of minting of the last two groups of the Korean coins, i.e. Dong Kook 東國 and Sam Han 三韓 coins, has been found. In all probability, they were minted about the same time as the Hai Dong coin, the date of coinage of which is given in history as about 1100 A.D. because not only have we no authentic record of new minting of coin at any later period under the Ko Ryu Dynasty, but proofs are not wanting to show us that toward the\n\n* For the study of these coins, I am greatly indebted to Mr. C. Miyake who has allowed me free use of his valuable collection.\nclose of that dynasty the very existence of these coins in the earlier part of the period was questioned and as we shall see later, an adviser to the Court, in his memorial presented to the Throne, had to refer to Chinese books to prove their existence.\n\nThe *Fun Biung* 銀瓶 seems to have been used throughout the period, though very limited in circulation, and was often recoined and grew smaller and smaller, for we have an edict prohibiting its use at the beginning of the next period. But the issue of the copper coins was an utter failure, for ten years had hardly passed before the people began to complain of them and Yei Chong 容宗, the next king, was obliged to issue a decree which, in substance, may be translated as follows:\n\n\"Money was the means by which ancient kings and emperors used to enrich their country and accommodate their people, so it was not to serve his own interest that our Father adapted it to this country. A new law is always followed by public slanders, showing the wisdom of the saying of the ancients that the people should not be consulted at the beginning. Our subjects, in their opposition to money, refer to the testament left by our great ancestor, the founder of the dynasty. It is true that he has forbidden us to imitate foreign customs but what he has forbidden is their luxurious customs. As to the laws and institutions, where shall we seek for a model, if not in the Middle Kingdom.\" (M. H.P.K. Chap. 159 P. 3).\n\nThe pathetic tone of the decree fully testifies to the distressed situation to which the monetary condition of the country had then been brought. By these words the king commanded the people to use money but the people did not obey. Thus the attempt ended in utter failure and no new coins seem to have been minted during the period. Rice and cloth remained as ever the medium of exchange and standard of value and no doubt barter was the chief means by which people traded with each other.\n\nWith the system of fairs pretty well organized from the earliest times barter seems to have been by far a more preferable means than an imperfect circulating medium. With the people\nof all trades coming from every part of the country or of the town into an appointed place it was not very difficult for each one to find an equivalent for his products or wares in the articles he needed, their respective value being determined by means of rice and cloth. There was, however, one place, it would seem, in which money was used more conveniently than in any other place and where it was preferred to other forms of exchange medium. Such place was a restaurant. Perhaps this was because all visitors to the fair from distant places had to lunch there and it was not likely that all had something to offer acceptable to the proprietor in payment of their bill. Whatever reason may be given for this, it was the fact that, whenever there was a new issue of coin, it was always with restaurants that they were first placed, and the order was given to proprietors to use the coin even when other people were not so compelled. It is often recorded that the Government went so far as to establish restaurants just for the purpose of teaching the people the use of money. All these means, so often repeated at later times, were tried at this time but were of no avail.\n\nThen came the first foreign interference in monetary matters of the country recorded in history. It is interesting to note that the monetary interference successively attempted by Japan and Russia in recent years was nothing but a copy of the policy pursued by China under the Yuan dynasty some six hundred years before. The Moon Heun Pi Ko 文獻備考 says (Chap. 159, P. 5): \"In the 13th year of King Chung Ryul 忠烈 (A.D. 1287) Yuan 元 sent an envoy and decreed that the Chi won po cho 至元寶鈔 and Jun tong po cho 中統寶鈔 should be used and that one kwon of the former should be exchangeable for 5 kwon of the latter.\" These were Chinese paper money. This was the period in which the power of China took the most aggressive form. It was but seven years before that she made an unsuccessful attempt on Japan when the greatest fleet that has ever visited the coast of Japan was defeated and annihilated. Having so formidable a power to dictate to her, Korea could only submit and obey. Some Chinese coins also\nmust have made their way into the country about this time, for in 1385, it was found necessary by a decree to fix the relative value between Chinese money and Korean cloth by which one kwan of the former was made exchangeable for five pil of the latter. This statement shows at the same time that Korea had then no money of her own to compare with the Chinese, but that cloth formed the principal standard of value. The existence of Chinese coins in no small quantity in these times, is further proved by the fact that they are so often found in old Korean graves dating from those days.\n\nTowards the close of the Ko Ryu Dynasty, all sorts of metallic money had practically disappeared from circulation, and the need of a convenient circulating medium was felt so keenly that one of the advisers had to propose, in a memorial, the issue of a paper money, following Chinese precedents, to relieve the situation and most probably also to replenish the empty treasury of the then declining dynasty. The memorial, though of little value as such, is at once interesting and instructive as it reflects the existing monetary condition and refers to the old coins of the realm of which so much has already been said.\n\nAfter lavish references to the past Golden Ages of China of Yu, Tang, and Chow, as is usual in this kind of writing it goes on to say: \"Our East (Korea) has also had money and such as the Sam Han Chung Po, Dong Kook Chung Po, Dong Kook Tong Po, Hai Dong Chung Po and Hai Dong Tong Po are mentioned in the book of the Middle Kingdom and so can be referred to. Later on we had also Eun Biung and all these were used with cloth. But both copper coins and Eun Biung have long since disappeared and we have nothing but cloth left to us. But now the cloth is becoming coarser and coarser, and is not fit to use: when being transported oxen sweat under it: when it is stored rats gnaw it. Commerce is handicapped and the price of rice goes up by leaps and bounds. Should there be a flood or a drought lasting a year or two or a war costing millions of money where shall we find funds?\"\ncountry produces neither copper nor silver; so it is impossible to revive silver or copper coins.\" Then he comes to the point and proposes that a paper money should be issued (M. H. P. K. Chap. 159, p. 7).\n\nFrom this memorial, we may gather the following important information: first, that, by the close of the Ko Ryu Period, not only had all the above mentioned Korean coins disappeared from circulation but even the fact of their existence had long been forgotten,—a circumstance strongly supporting our assertion that they were minted very early in the period; secondly, that, there was then no money whatever in use, either metallic or paper and cloth formed the sole and only medium of exchange; thirdly that, with all her mineral wealth, she was thought by her statesmen to be destitute of, not to say gold, but even silver or copper.\n\nIn 1392, the Ko Ryu Dynasty came to an end and that of Ri 李 rose into power.\n\nTHE RI 李 PERIOD.\n\n(A.D. 1392-1910),\n\nThe issuance of paper money which had been suggested toward the close of the preceding dynasty was put into practice under the new regime. The Moon Heun Pi Ko 文獻備考 says: \"In the first year of Dai Chong 太宗 (A.D. 1392) the king ordered the premier Ha Rioon 河侖 to print a paper money and have it circulated among the people.\"\n\nIn 1464, the 9th year of King Sei Jo 世祖, a very singular kind of coin was minted. It is no doubt one of the most eccentric coins which human ingenuity has ever conceived. It was so designed that in time of peace it was to be used as money and in time of war as an arrow-head and hence was called jun bei 箭幣 i.e. arrow coin. The royal instructions on this occasion appear in the Moon Heun Pi Ko which may be translated: \"Different moneys were used in different reigns but each one\nsuits its time. The arrow coin, though never used by the ancients, will surely prove useful to a warlike country and we see no reason why it should not be used.\"\n\nUnfortunately the coin failed to answer either as money or as an arrow-head. The fact that it has never been mentioned since will be sufficient proof of the failure of this novel attempt.\n\nSo far no specimen of this interesting coin has been found and one might doubt the fact of its minting, were it not for the description given in the Moon Heun Yi Ko, the most trustworthy of all Korean books. The description is as follows: \"An arrow coin resembles in form a willow leaf, the blade or head having a length of 1 sun 8 bu and the steam or tang a length of 1 sun 7 bu. On the two sides of the tang near the end are inscribed four characters pal-pang-tong-wha 八方通貨. One piece of arrow coin was made exchangeable for 4 pieces of paper money.\"\n\nThe drawing given below is that of an arrow-head called in Japan \"willow leaf\" and it is most likely that the coin had a similar form with the above mentioned four characters inscribed somewhere along A.\n\n\"Copied from the Shakwai Ji\"\n\nOne may well doubt if man could ever have been so eccentric as to conceive such a design for money. None the less it is a fact and our common sense, I think, has largely contributed to the failure to find specimens of it. Collectors of coin may have picked them up by chance but thrown them away never dreaming that they were once coins. Lovers of old coins are advised, therefore, whenever they chance to come across an old arrow-head, not to throw it away but to examine its tang and see if it bears the characters pal-pang-tang-wha 八方通貨 which, by the way, mean \"Currency in eight directions,\" i.e.\ncurrency everywhere. History tells us no more of this coin. Its fate is evident, however. No one would like such a prickly coin which could not be pocketed with any safety nor be handled but with great caution. It must have gone out of circulation as fast as it was issued.\n\nPaper money was also losing its credit and the whole credit system was entirely upset by the invasion of the Japanese Army in 1592.\n\nIn 1603, the thirty-ninth year of King Sun Jo 賞祖, that is, five years after the evacuation of the country by the Japanese army, the king desired to have money minted and so held council with high officials to discuss the matter. Fourteen of the officials summoned were in favor of it saying:—“Our country uses but rice and cloth, so agriculture wanes and the country is impoverished. It is advisable that money should be used and both Government and people be enriched.” Seventeen were of the opinion that it might well be tried. But one man was against it on the ground that the country produced neither copper nor iron and so it was impracticable. He seems to have been the only practical man of the thirty two officials summoned and of course, the king had to agree with him and abandon his coinage plan. Such was the poverty into which the country was then reduced.\n\nIn 1625, the 3rd year of King In Jo 仁祖, a new coin was minted. It is recorded that this time stores were established in the Capital in which wines and food were sold for money; the people imitated this, and knew for the first time the advantages of money. The Chosen Tong Po 朝鮮通寶, specimens of which now exist, is in all probability, the coin minted at this time.\n\nThe name Chosen 朝鮮 is of very remote origin being once used some one thousand years before the Christian era. On the assumption of the sovereign power by the Ri 李 Dynasty, the name was again used to designate the country. As to the origin of the name Chosen, opinions vary among scholars, but the one which seems to us most reasonable is that\nit was so named because the country is situated to the east of China where the sun is seen freshly 鮮 in the morning 朝. Cho means morning and sen fresh.\n\nPHOTOGRAVURE 6.\n\nCHOSÉN TONGPO.\n\nSquare Style.\n\nThere is only one kind of this coin in my collection, made of copper and with the characters on it in square style. There may be more but attempts to find others have failed. The Chinese List of Coins also gives only one kind, that which is here represented.\n\nEight years later, in 1633, a Government Office by the name of Sang Piung Chung 常平廳 was ordered to mint a coin on which were inscribed the four characters Sang Piung Tong Po 常平通寶. This event in itself is of no great consequence, being only another failure to add to the already long list of failures. But the fact that the coin bore the four characters Sang-piung-tong-po gives much significance to this otherwise unimportant event, for, though many changes were afterwards made in the coinage of the realm, these four characters remained unchanged on each and every coin minted up to the very last day on which Korea ceased forever to mint the so-called cash or jopchon. Evidently it was so inscribed as the coin was first minted by the Sang Piung Chung, which was a kind of famine relief office. Sang 常 means \"always\" piung 平 \"even\"; the two put together meaning \"always even\" making a fit name for a famine relief office by which the surplus of a good year is kept to make up the deficit of a bad one.\nIn 1651, the second year of King Hio Chong 孝宗, a decree was issued ordering the people to use coin and at the same time prohibiting them from the use of cloth as money. Up to this time, money when it was in existence was used side by side with cloth, and though there were times in which the use of money was prohibited, that of cloth had never been prohibited. Now it was forbidden for the first time and this, drastic as it seems, was a very important step toward the diffusion of metallic coin. Deprived of the last means upon which the Korean people had always had a tendency to fall back whenever money failed to satisfy them, they had now to accept money willy nilly and realizing its benefits soon became accustomed to its use. Up to this time, there had always been a party opposed to the use of coin that took every opportunity to suppress its use and replace it with rice and cloth. Now this party was fast disappearing and though they once more succeeded, five years later, in causing the rescission of the order to use coin, the people by that time had become so accustomed to its use that they began to coin for themselves, and hardly ten years had passed when the coinage question was again taken up seriously.\n\nIn 1678, the 4th year of King Suk Chong 肖宗, it was decided that coins should be minted and orders to that effect were given not only to the Sang Piung Chung 常平廳 but to various other government offices such as the Hocho 戶曹 (Revenue Office), Jin Hiool Chung 賑恤廳 (Charity Office) Sa Bok Shi 司僕寺 (Bureau of Royal Mews), Urh Yung Chung 御營廳 (a military office) and Hoon Riun Do Kam 訓鍊都監 (a military division) and to some provincial military stations such as those in Piung An 平安 and Chon La 全羅 Provinces.\n\nThis constitutes a turning point in the coinage history of Korea. The economic position of money was at last established and rice and cloth were deprived forever of their monetary function. It took, as it were, a firm root in the soil of this country, and if it did not contribute much to the well-being of the people, it, at least, began to be regarded as indispensable to\nthe economic life of the nation. This new issue of coin was followed by many others. Indeed the two hundred years that followed was the period in which money thrived most in Korea. Coin after coin was issued under different pretexts, at different times and in different places. There were so many, indeed, that it is impossible to describe them separately in this limited space. I shall, therefore, pass them over and proceed at once to describe the coin itself, all the issues of which, though not without certain minor differences, may be brought under one generic term \"Sang Piung Tong Po\" from the principal characters they all bear in common.\n\nAll the cash minted then and afterwards invariably bear, as I have just said, the characters 常平通寶 (Sang Piung Tong Po) on the face but different numerals, character and marks on the reverse side indicating the offices by which they were made, number of issue and number of furnace. The office by which a coin was minted is indicated by the first character (sometimes second) of the name of the office being inscribed at the top of the coin. Thus the coin minted by the Ho cho 戶曹 has the character Ho 戶 inscribed on it, that minted by the Jin Hiool Chung 賑恤應 the character Jin 賑, while that coined by the Urh Yung Chung 御營應 has the character Yung 營, the second character instead of the first Urh 御.\n\nPHOTOGRAVURE 7.\n\n1\n\nObverse\nCommon to all.\n\n2\n\nReverse.\nThe numerals or characters inscribed at the bottom of the coins indicate, according to the information given by Korean scholars, though not substantiated by authentic records, the serial number of a group of furnaces called Il ro kan 一爐間. The characters such as 天 (Chun) or 土 (To) are used as numerals according to the order in which they stand in the Chun ja moon 千字文 or the Oh hang 五行. The Chun ja moon is a Chinese classical writing consisting of one thousand different characters which begins thus: 一天 (Chun) 地 (Chi) 玄 (Hyun) 黃 (Hwang) 宇 (Oo) 霍 (Joo) 洪 (Hong). In using these characters as numerals, chun 天 stands for one, being the first character and chi 地 for two, being the second and hyun 玄 for 3, being the third and so on. The Oh hang 五行 means the five elements of nature in Chinese philosophy, that is, Mok 木 (wood) Hwa 火 (fire) To 土 (earth) Kum 金 (metal) Su 水 (water) and these are used as numerals in the same way as those of the Chun ja moon.\n\nThus of the coins represented in Picture 7 No. 1 shows the obverse side of the Sang Piung Tong Po with the characters common to all the coins minted in 1678 and afterwards. No. 2 shows the coin minted by the Hocho 戶曹 and in the first group of furnaces, while No. 3 shows that minted by the Jin Hiool Chung 賑恤廳 and in the second group of furnaces and No. 4 shows that coined by the Urh Yung Chung 御營廳 and in the third group of furnaces. On the reverse side of the coin and on either or both sides of the square hole in the centre there are sometimes other numerals or various differ-\nent marks of each individual furnace in which the coin was made such as point (•) circle (○) double circle (◎) curve (◦) or the character il (ー) or yee (=) (See the last coin in Photo. 7 and the first coin in Photo. 8) except in the five cash piece or one hundred cash piece in which the characters Tang Oh 當五 or Tang Pak 當百 are inscribed instead (see Photo. 9).\n\nThere are 3137 different specimens of the Sang Piung Tong Po in the collection made by the Bank of Chosen. This number will be greatly reduced, however, when minor differences are disregarded and only principal ones taken into consideration, for instance to 36 when the principal character indicating the minting office only is regarded and to 63 when size is taken into consideration. We are in the habit of naming a cash after the character indicating the place or office of minting, for instance, we call one bearing the character Yung 順 indicating that it was minted by the Urh Yung Chung 御營廳 by the name of Yung Ji Chun, i.e. Yung 順 coin, and as I have just said, there are 36 different specimens according to this classification. It is also to be noted that there are some coins which, though having different principal characters, are nevertheless issued by the same office. They are such as the Sun 宣 and Hei 惠 coins. Both of them were issued by the Sun hei chung 宣惠廳 but have different characters, one having the first character, the other the second.\n\nThe next thing to be considered is their size. Some coins have three sizes, large, middle and small, some two sizes, large\n\nPHOTOGRAVURE 8.\n\nTHREE SIZES OF YUNG COIN.\n\nSmall. Middle. Large.\nand small, and some only one. For instance, the Yung 銀 coin has three sizes, the Keum 禁 coin, only two, large and small, and the Hiang 向 coin only one, large.\n\nIn most cases, they all circulated at the same value, smaller ones being minted later to increase mintage profits. Below is a list of Sang Piung coins arranged according to the principal characters with the names of the offices by which they were minted and sizes into which they are classified.\n\n| KIND OF COIN | OFFICE COINED BY | SIZE |\n|--------------|------------------|------|\n| 1 善 | Urh Yung Chung 御營廳 | ......Large, Middle, Small |\n| 2 開 | Kai Sung Kwan Ri Yung 開城管理營 | Large and Small |\n| 3 禁 | Keum Wi Yung 禁衛營 | ..............Large and Small |\n| 4 訓 | Hoon Riun Do Kam 訓練都監 | Large, Middle, Small |\n| 5 戶 | Ho Cho 戶曹 | .........................Large and Small |\n| 6 尚 | Kyung Sang Kam Yung 慶尚監營 | \" |\n| 7 向 | Ryang Hiang Chung 粮餉廳 | .........Large |\n| 8 宣 | Sun Hei Chung 宣惠廳 | ..............Large and Small |\n| 9 總 | Chong Yiung Chung 總戎廳 | .........\" |\n| 10 統 | Tong Wi Yung 統衛營 | .........Large, Middle, Small |\n| 11 平 | Pyeng Yang Kam Yung 平壤監營 | Large and Small |\n| 12 折 | Kiung Ki Kam Yung 京畿監營 | \" |\n| 13 全 | Chunra Do Kam Yung 全羅道監營 | \" |\n| 14 京 | Probably an office in Seoul 京城 | \" |\n| 15 咸 | Ham Kyung Kam Yung 咸鏡監營 | \" |\n| 16 沁 | Kang Wha Do Sim Yung 江華島泌營 | Small |\n| 17 均 | Kiun Yuk Chung 均役廳 | .......... \" |\n| 18 武 | Moo Bi Sa 武備司 | ......................Large and Small |\n| 19 惠 | Sun Hei Chung 宜惠廳 | ..............Small |\n| 20 昌 | Chang Duk Koong 昌德宮 | .........\" |\n| 21 海 | Hoang Hai Kam Yung 黃海道監營 | Large and Small |\n| 22 同 | Unknown | ......................... |\n| 23 原 | Unknown | ..................................Large |\n| 24 守 | Soo Wi Chung 守禦廳 | ..............\" |\n| 25 賬 | Jin Hiool Chung 賬恤廳 | ............Large and Small |\n| 26 水 | Unknown | ..................................Large |\nKIND OF COIN. OFFICE COINED BY. SIZE.\n\n27 備 Bi Biun Sa 備邊司 ..................... Large and Small\n28 黃 Hoang Hai Do Kam Yung 黃海道監營 ”\n29 兵 Biung Cho 兵曹 ..................... Large, Middle, Small\n30 江 Kang Won Do Kam Yung 江原道監營 Large\n31 工 Kong Cho 工曹 ...................... ”\n32 抄 Jung Cho Chung 精抄廳 ........... Large, Middle, Small\n33 忠 Unknown .................................. Large\n34 經 Kiung Ri Chung 經理廳 ............ Small\n35 松 An office in Kai Sung ............... ”\n36 利 Unknown .................................. ”\n\nI have so far described the ordinary yopchon or cash which, in spite of all their differences in inscription and size, circulated at the same value. There are two larger coins called Tang Oh Chun 當五錢 (five cash piece) and Tang Pak Chun 當百錢 (one hundred cash piece).\n\nPHOTOGRAVURE 9.\nTANG OH CHUN.\n\nTANG PAK CHUN.\nTang Oh 當五 and Tang Pak 當百 mean respectively \"worth five\" and \"worth one hundred\" signifying that they are worth so many times the ordinary cash. Of the Tang Oh Chun 當五錢, the Bank of Chosen has been able to collect the following specimens:\n\n| KIND OF COIN | WHERE MINTED |\n|--------------|-------------|\n| Hocho 戶曹   |             |\n| Tong Wi Yung 統衛營 |         |\n| Pieng Yang Kam Yung 平壤監營 |     |\n| Seoul (?) 京城 |         |\n| Choon Chun 春川 |         |\n| Kang Wha Do Sim Yung 江華島泌營 |     |\n| Kiun Yuk Chung 均役廳 |       |\n| Jun Whan Kook 典園局 |       |\n| Chang Duk Koong 昌德宮 |       |\n| Choon Chun 春川 |         |\n\nOf the Tang Pak Chun only one kind was minted, that is, the Ho 戶 coin minted by the Ho Cho 戶曹.\n\nThe Tang Pak Chun 當百錢 was minted in 1866, when Tai Won Kun was regent, to obtain thereby funds for the building of Kiung Pok Palace 景福宮 and was issued at a value one hundred times that of an ordinary coin, while its size, though considerably larger than the ordinary one, by no means warranted such a value as represented. The people, of course, refused to take it at its face value and in a short time the Government had to stop minting it.\n\nThe Tang Oh Chun 當五錢, the face value of which was fixed at five times the ordinary coin, was minted in 1883 for the first time but, its size being nearly the same as that of the larger ones among ordinary coins, circulated except in Seoul and its vicinity at no greater value than that of an ordinary coin, and was the first to be exported when the price of copper abroad rose according to the law of Gresham.\n\nA year previous to the minting of the Tang Oh Chun 當五錢, silver coins were minted. They were of three\ndenominations, i.e. Dai Dong Sam Chun 大東三錢, Dai Dong Yee Chun 大東二錢 and Dai Dong II Chun 大東一錢.\n\nPHOTOGRAVURE 10.\n\nDAIDONG SAM CHUN.\n\nObverse. Reverse.\n\nDAIDONG YEE CHUN. DAIDONG II CHUN.\n\nObverse. Reverse. Obverse. Reverse.\n\nOn the face of these coins appear the characters Dai Dong 大東 (Great East) which is another name for Korea as I have explained before and on the reverse side the character Ho 戶 inscribed in a circle of blue enamel located in the centre of the coin, indicating that it was coined by the Revenue Office, the Ho Cho 戶曹. They have no hole in the centre and are slightly milled around the edge. On the whole, they are a very clumsy imitation of Western coins, being of very poor workmanship and lacking uniformity. They have never been put into circulation.\n\nA glance at the list of the Sang Piung coins given before will be sufficient to convince one of the disorganized state of the coinage of this country during the period. There was no\ncentral mint, and the privilege of coinage was granted to many different civil and military offices in the Capital as well as in the provinces. It seems that whenever an office found itself in pecuniary embarrassment, it applied to the Government for the privilege of coinage to relieve thereby its pressing need. Naturally they cared only for mintage profits and nothing else,—no wonder that the coin was debased year by year until the original weight of 2 chun 5 fun was finally reduced to about half the weight, i.e. to 1 chun 2 fun and no further reduction in weight being possible lest the people should refuse to receive it, they tried to circulate certain coins at a face value many times that of an ordinary coin, while their real value was not increased in the same proportion. The outcome was the minting of the Tang Oh Chun and Tang Pak Chun which resulted in failure as I have just mentioned.\n\nIn 1883, Korea had for the first time a Government Mint which was named Jun Whan Kook 典園局. The Mint was first engaged in minting Tang Oh Chun 善五錢. Later an adviser was invited from Japan in order to effect a reform in the country's monetary system on a more modern method and new machinery was installed in the Mint for that purpose. In 1891, coins of the modern type were struck for the first time. They are shown in the picture below.\n\nPHOTOGRAVURE II.\n\nSilver One Whan Piece.\n\nObverse\n\nReverse\nThese coins had hardly been put into circulation in any large quantity when the China-Japan War broke out and prevented the Korean Government from pursuing its intended monetary reform.\n\nIn August 1894, new coinage regulations were promulgated at the instigation and under the guidance of the Japanese Government. The following were the coins according to the new regulations:\n\n1 fun, brass, equal in value to 1 old coin.\n5 fun, copper, \" \" \" \" 5 old coins.\n2 chun 5 fun, nickel, equal in value to 25 old coins.\n1 Yang, silver, equal in value to 100 old coins.\n5 Yang, \" \" \" \" 500 \" \"\n\nPHOTOGRAVURE 12.\n\nSilver 5 Yang Piece.\nThese were splendid regulations on a silver basis and a real reform should have been effected in the monetary system of the country if they had been adhered to. But the long corruption pervading every department of the Government was not to be removed by a single set of regulations. The mintage profit was the only thing that they cared for, and as the nickel coin afforded the largest profit, it was coined to an enormous amount, while the 5 yang silver, which was the standard money, was minted only to the insignificant amount of Yen 19,923. Soon the country was flooded with nickel, and though in one\nhalf of the country the old coin was able to hold its own against it, its force was irresistible in the other half, and in a short time it became all powerful in that part of the country. Thus in the course of time, Korea was divided into two different countries from the monetary viewpoint.\n\nIn 1897, came Russia's interference with the internal affairs of Korea. This was just at the time the struggle for supremacy in this country between Russia and Japan was fast approaching its crisis, and at this moment Russia had the upper hand. Her influence was fast increasing while that of Japan was waning, and this state of affairs was soon reflected in the coinage of the realm. On the advice of M. Alexieff, financial adviser to Korea sent from Russia, the circulation of the Japanese currency which had by this time become an indispensable trade medium of the country was abruptly prohibited and new coinage regulations were published.\n\nThese regulations consisted of 11 articles and were to place the coinage system of the country on a gold basis. The following coins were to be issued under the regulations:\n\n| Metal   | Denomination |\n|---------|--------------|\n| Gold    | 20 Whan      |\n| Silver  | 10 Whan      |\n| Nickel  | 5 Chun       |\n| Copper  | 1 Chun       |\n\nThese regulations were compiled after the Japanese coinage regulations and were the best one could conceive for this country. Some coins were minted according to the regulations and they bore Russian eagles on their face. But Russia was not in power long enough in this country to see them circulate. The coins were melted down but their excellent regulations survived. Indeed, every letter of the regulations, with but some insignificant additions, such as the addition of copper ½ chun piece, was carried into practice by her antagonist. The following are coins minted under Japanese guidance according to the regulations enacted under Russian influence.\nCOINAGE OF OLD KOREA.\n\nPHOTOGRAVURE 13.\n\nGold 20 Whan Piece.\n\nObverse. Reverse\n\nGold 10 Whan Piece.\n\nObverse. Reverse\n\nGold 5 Whan Piece.\n\nObverse. Reverse\n\nSilver ½ Whan Piece.\n\nObverse. Reverse\n\nSilver 20 Chun Piece.\n\nObverse. Reverse\n\nSilver 10 Chun Piece.\n\nObverse. Reverse\nWith the restoration of peace between Japan and Russia, the country was made a protectorate of Japan. Both nickel and cash were withdrawn and replaced by the new coins. But I shall go no farther, for Old Korea ends there and New Chosen begins its career with new vigor and strength as a part of the Empire of Japan.\nMINUTES OF IMPORTANT MEETINGS.\n\nSeoul, Korea, Jan. 23, 1911.\n\nA general meeting of the Korea Branch of the Royal Asiatic Society was called to meet at Dr. W. B. Scranton's Sanitarium on the above date at 4 p.m.\n\nThe following members were present: Arthur Hyde Lay, J. S. Badcock, J. S. Gale, F. M. Brockman, P. L. Gillett, D. A. Bunker, R. Brinkmeier, W. B. Scranton and Miss Albertson.\n\nAfter drawing attention to the fact that the society had existed with occasional business meetings since 1902, but with no papers on Korean themes read before it, the following officers were elected:\n\nPresident—Arthur Hyde Lay.\nVice-President—J. S. Badcock.\nCorresponding Secretary—J. S. Gale.\nRecording Secretary—W. B. Scranton.\nTreasurer—B. L. Gillett.\nLibrarian—F. M. Brockman.\n\nThe following three gentlemen were elected as \"Members at large\" of the council.\n\nD. A. Bunker, R. Brinkmeier, J. R. Frampton.\n\nThe minutes of the last general meeting May 8, 1907, were read and approved.\n\nThe report of the outgoing Treasurer W. B. Scranton showed that finances stood as follows:\n\n| Date       | Description          | Amount   |\n|------------|----------------------|----------|\n| Jan. 12, 1911 | Deposit Recpt. No. 16/15 | ¥ 631.16 |\n|            | No. 16/14            | ¥ 315.52 |\n|            | Current Bank Acct.    | ¥ 180.21 |\n\nTotal ... ¥ 1,126.89\n\nA list of the publications now being sent to this Branch was read.\n\nA list of the membership, as nearly as could be ascertained, was read, showing between forty and fifty members.\n\nThe meeting then adjourned.\n\nW. B. SCRANTON,\nRecording Secretary.\nMINUTES OF THE COUNCIL.\n\nBritish Consulate General,\nSeoul, Korea, Feb. 8, 1911.\n\nThe following gentlemen were present. The Chairman A. H. Lay Esq., and Messrs. Badcock, Bunker, Brinkmeier, Brockman, Gale and Gillett.\n\nA letter was received from the recording Secretary, Dr. W. B. Scranton, saying that he expected to be out of the city for a year and found it necessary to tender his resignation.\n\nMr. P. L. Gillett was elected to fill the un-expired term of Dr. Scranton. Adding this duty to that of Treasurer.\n\nThe minutes of the last meeting were read and approved.\n\nThe Chairman reported that Mr. Komatsu was preparing a paper to be read before the Society the subject of which was to be \"The Old People and the New Government.\" He also stated that Mr. I. Yamagata was preparing a paper on a historical subject.\n\nThe motion was made and carried asking the Chairman and Corresponding Secretary to arrange for the sequence and dates of papers to be presented to the Society.\n\nThe invitation of G. H. Scidmore Esq., to hold the next public meeting in the rooms of the U.S. Consulate General was accepted with thanks. The hour of meeting was left for the Chairman to decide.\n\nA suggestion was made that Mr. Scidmore be asked to become a member of this council.\n\nThe following persons were elected to membership:—\n\nMiss M. Albertson, Prof. K. Asakwa New Haven, Conn., Prof. F. W. Williams, New Haven, Conn., J. T. Griffin, Yokohama, A. W. Taylor, Chik San Mines.\n\nOn motion it was decided to hold the next council meeting March 8th in the rooms of the British Consulate.\n\nThe meeting adjourned.\n\nPhilip L. Gillett,\nRecording Secretary.\nMINUTES OF A GENERAL MEETING\n\nAmerican Consulate General, Seoul,\nMarch 4th, 1911.\n\nBy invitation of G. H. Scidmore Esq. the meeting convened in the rooms of the U.S. Consulate at 3 p.m. on the above date.\n\nThe following members were present: Messrs. Badcock, Bolljohn, Bunker, Brinkmeier, Gale, Gillett, Lay, Miller, and Taylor. Many guests were also present including members of the local diplomatic corps and ladies.\n\nThe President A. Hyde Lay occupied the chair.\n\nThe minutes of the last meeting were read and approved.\n\nAfter introduction by the Chairman, M. Komatsu Esquire read his paper on \"The Old People and the New Government.\"\n\nThe Chairman announced a hearty vote of thanks to the speakers of the afternoon.\n\nRemarks were made by Messrs. Bunker, Gale, Yamagata and Gillett.\n\nA vote of thanks was announced to the Hostess and Host of the occasion.\n\nMeeting adjourned.\n\nPHILIP L. GILLETT,\nRecording Secretary.\n\nMINUTES OF THE COUNCIL.\n\nBritish Consulate General,\nWednesday Mar. 8, 1911.\n\nThe following gentlemen were present: The President A. H. Lay Esquire and Messrs. Badcock, Brickmeier, Gale and Gillett. G. H. Scidmore Esq. and Prof. D. A. Bunker came in during the meeting.\n\nThe minutes of the last meeting dated Feb. 8, 1911, were read and approved.\n\nThe Corresponding Secretary reported that he had written Mr. A. W. Taylor regarding a paper on Mineralogy but the response had been that the paper would not be ready until next Fall.\nDr. Gale was asked to prepare and read a paper in April. His silence was interpreted to signify consent.\n\nMr. Gillett consented to give a paper in May 1911.\n\nThe President reported that Mr. Collyer would try and give a paper sometime in the Fall of 1911.\n\nDr. O. R. Avison was reported to have been preparing a paper on Korean medicine and medical practice.\n\nThe names of G. H. Scidmore, Esquire and Mr. G. T. Paton were proposed for membership. Invitations to hold the next meeting at the U.S. Consulate and at the British Consulate were received.\n\nOn motion the meeting adjourned to meet on the 2nd, Wednesday in April.\n\nRespectfully submitted.\n\nP. L. Gillett,\nRecording Secretary.\n\nMINUTES OF THE APRIL MEETING OF THE COUNCIL.\n\nBritish Consulate General,\nSeoul, April 12, 1911.\n\nThe following gentlemen responded to roll call. The President A, Hyde Lay and Messrs. Badcock, Brinkmeier, Brockman, and Gillett.\n\nThe Minutes of the last meeting were read and approved.\n\nThe Recording Secretary was directed to ask Mr. M. Komatsu for a copy of his paper on \"The Old People and the New Government.\"\n\nMessrs. G. H. Scidmore and G. T. Paton were elected to Membership.\n\nDr. J. S. Gale has responded that he will give a paper on \"The Korean Alphabet\" in May 1911.\n\nOn motion the meeting adjourned.\n\nP. L. Gillett,\nSecretary.\nMINUTES OF THE MAY MEETING OF THE COUNCIL.\n\nMay 10, 1911. Rooms of British Consulate General, Seoul, Korea.\n\nThe meeting was called to order at 4 p.m. by the Chairman. The roll call showed the following members present Messrs. Badcock, Brinkmeier, Gale, Gillett and Lay.\n\nThe minutes of the April meeting were read and approved.\n\nDr. Gale reported progress on his paper on \"The Korea Alphabet.\"\n\nAfter a general discussion of the future work of the Society the meeting adjourned.\n\nP. L. GILLETT,\nRecording Secretary.\n\nMINUTES OF A MEETING OF THE COUNCIL.\n\nSeoul Union, Oct. 24, 1911.\n\nThere were present the Vice President Rev. J. S. Badcock who occupied the Chair and Messrs. Brinkmeier, Gale and Gillett.\n\nThe minutes of the last meeting were read and approved.\n\nThe resignation of Mr. A. Hyde Lay as President was accepted with regret and it was understood he would still serve as a member of the Council, Dr. J. S. Gale was unanimously elected President.\n\nDr. Gale consented to give a paper on \"The Korean Alphabet\" at a meeting of the Society Tuesday November 7th, if proper arrangement could be made.\n\nThe Secretary was asked to make arrangements with Mr. Scidmore or the Seoul Union for the next meeting of the Society.\n\nThe President was asked to see Prof. Starr about giving a lecture to the Society on some place of anthropology and also\nto urge the British Consul General Mr. Bonar to prepare and read a paper on his early trip to Korea.\n\nOn motion the meeting adjourned.\n\nRespectfully submitted,\n\nP. L. GILLETT,\nSecretary.\n\nGENERAL MEETING OF THE KOREA BRANCH OF THE R.A.S.\n\nParlors of the U.S. Consulate General,\nSeoul, Korea, Nov. 17, 1911.\n\nThe President James S. Gale D.D. occupied the chair. In addition to some fifty guests the following members were present, Messrs. Avison, Albertson, Badcock, Bolljohn, Brinkmeier, Gale, Gillett, Hirst, Miller, Scidmore, and Wambold.\n\nAfter announcements regarding the resignation of A. Hyde Lay Esq. and the election of Dr. James S. Gale to the office of President the latter made some introductory remarks regarding the origin and history of the society. He then introduced Professor David Starr of Chicago University who delivered an address without notes on \"Dolmens and Their Kin.\" During his remarks the speaker recommended that this society institute an investigation of the location and ideas of the Korean people regarding the Dolmens of which there are many on the Peninsula. He thought that a map showing the sites of such monuments should be prepared.\n\nRemarks and questions were proffered by some of the members and on motion a hearty vote of appreciation was extended to Prof. Starr for his interesting lecture.\n\nA vote of thanks was extended to Mother Scidmore and Mr. Scidmore for their Hospitality.\n\nThe meeting adjourned to enjoy tea, social conversation and the inspection of pictures of Dolmens taken by Prof. Starr in Korea.\n\nPHILIP L. GILLETT,\nRecording Secretary.\nMINUTES OF GENERAL MEETING.\n\nDec. 12, 1911. Rooms of the U.S. Consulate General, Seoul, Korea.\n\nThe vice-President, Rev. J. S. Badcock occupied the Chair and called the meeting to order.\n\nThe following members were present Messrs. Gale, Scidmore, Brinkmeier, Badcock, Min Yung Chan, Gillett, Cram, Cable, Wambold, Trollope, Underwood, Cutler, Frey, Gerdine.\n\nThere were also some sixty guests present.\n\nThe minutes of the last meeting were read and approved.\n\nThe Chairman introduced the President J. S. Gale D.D. as the speaker of the day. Dr. Gale read a portion of his paper on \"The Korean Alphabet\" and explained some charts which he had made to show the origin of the Korean Alphabet.\n\nAt the conclusion Bishop Trollope and others expressed the appreciation of the audience for the notable contribution which the speaker had made to knowledge of this product of Korean literary skill.\n\nBy invitation of Consul General Scidmore the audience remained to partake of tea and discuss the subject of the day.\n\nRespectfully submitted,\n\nP. I. Gillett,\nReed. Sec'y.\n\nMINUTES OF A MEETING OF THE COUNCIL.\n\nSeoul, Korea, Dec. 12, 1911.\n\nThere were present the President J. S. Gale and Messrs. Badcock, Brinkmeier, Gillett and Counsel General Scidmore.\n\nThe minutes of the last meeting were read and approved.\n\nThe proposition of L. H. Snyder for membership was brought up and he was elected.\n\nThe name of G. A. Gregg and S. Rhee Ph.D. were received as proposed members and laid on the table to be acted upon at the next meeting.\nThe recording Secretary was ordered to print letter heads.\n\nThe expenditure of something under Yen 1.50 for postage stamps was authorized.\n\nThe recording secretary was directed to purchase a book case for the use of the society.\n\nIt was reported that R. G. Mills M.D. and Mr. A. W. Taylor were preparing papers to present to the Society in the Spring of 1912.\n\nA. Hyde Lay Esq. expects to have a paper ready on \"Korean Marriage Customs\" some time in February.\n\nMr. P. L. Gillett has prepared a paper on \"Korean Village Government Societies\" which was suggested for the January meeting. Consul General Scidmore offered the use of his home for this occasion. The offer was gratefully accepted.\n\nIt was suggested that Dr. Ichihara be asked to prepare a paper on \"Old Korean Coins\" and Mr. Sharp on \"Korean Stamps.\"\n\nRespectfully submitted,\n\nP. L. Gillett.\n\nMEETING OF THE COUNCIL.\n\nOffice of the U.S. Consulate General, Seoul, Korea.\n\nJan. 17th, 1912.\n\nThere were present Messrs. Badcock, Brickmeier, Gale, Gillett and Scidmore.\n\nThe President Dr. Gale occupied the chair.\n\nThe minutes of the last meeting were read and approved.\n\nA motion was made and carried directing the secretary to correspond with various Asiatic Societies with the idea of securing their publications by exchange if possible and where that is not feasible at the lowest possible rates.\n\nThe Secretary was directed to ask the Japan Branch for the privilege of reprinting certain of their publications relating to Korea.\nOn motion it was decided to begin the upbuilding of a library for the uses of the Society. It was decided that this library should aim primarily at the acquisition of books and literature on Korea and secondarily on Japan and China.\n\nOn motion it was decided to begin the collection of dues from members Jan. 1st, 1912.\n\nIn discussing the possibilities of future contributions to the Society the names of the following were suggested:\n\nBishop Mutel, Mr. Gubbins, Rev. J. S. Badcock, Rev. C. T. Collyer, Consul General Scidmore.\n\nMr. Scidmore agreed to have a paper for January 1913.\n\nRespectfully submitted,\n\nP. L. Gillett,\nSecretary.\n\nMINUTES OF A GENERAL MEETING.\n\nRooms U.S. Consulate General,\nJanuary 23, 1912.\n\nThe President J. S. Gale D.D. occupied the chair. The Members Present were; Gale, Scidmore, Gillett, Cable, Brinkmeier, Beck, Frey, Badcock, Rhee, Hirst, Albertson, and Gregg.\n\nThe minutes of the last meeting were read and approved.\n\nThe Chairman announced the speaker of the day Mr. P. L. Gillett,—who gave a lecture on “The Village Gilds of Old Korea.” After a number of remarks by members of the society a vote of appreciation was extended to the hosts, Consul General Scidmore and his mother.\n\nThe meeting adjourned to partake of refreshments offered by the host and hostess.\n\nP. L. Gillett,\nSecretary.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko42roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 102, "total-input-tokens": 144066, "total-output-tokens": 34119, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 403, 5], [403, 403, 6], [403, 1899, 7], [1899, 4069, 8], [4069, 4069, 9], [4069, 4069, 10], [4069, 6245, 11], [6245, 8402, 12], [8402, 8402, 13], [8402, 8402, 14], [8402, 10579, 15], [10579, 12675, 16], [12675, 12675, 17], [12675, 12675, 18], [12675, 14770, 19], [14770, 16878, 20], [16878, 16878, 21], [16878, 16878, 22], [16878, 19022, 23], [19022, 21125, 24], [21125, 21125, 25], [21125, 21125, 26], [21125, 21573, 27], [21573, 21573, 28], [21573, 23359, 29], [23359, 25223, 30], [25223, 26855, 31], [26855, 28633, 32], [28633, 30077, 33], [30077, 31702, 34], [31702, 33254, 35], [33254, 34786, 36], [34786, 36379, 37], [36379, 38360, 38], [38360, 39884, 39], [39884, 41397, 40], [41397, 43089, 41], [43089, 45196, 42], [45196, 47047, 43], [47047, 48992, 44], [48992, 51020, 45], [51020, 53084, 46], [53084, 55086, 47], [55086, 56992, 48], [56992, 58971, 49], [58971, 60773, 50], [60773, 62867, 51], [62867, 64811, 52], [64811, 66944, 53], [66944, 68868, 54], [68868, 70911, 55], [70911, 72903, 56], [72903, 74895, 57], [74895, 77013, 58], [77013, 79075, 59], [79075, 80114, 60], [80114, 81977, 61], [81977, 83800, 62], [83800, 85920, 63], [85920, 87755, 64], [87755, 89196, 65], [89196, 90606, 66], [90606, 91506, 67], [91506, 92221, 68], [92221, 93699, 69], [93699, 95830, 70], [95830, 98002, 71], [98002, 100091, 72], [100091, 101852, 73], [101852, 103594, 74], [103594, 105581, 75], [105581, 107047, 76], [107047, 109147, 77], [109147, 110551, 78], [110551, 112093, 79], [112093, 113709, 80], [113709, 115594, 81], [115594, 116430, 82], [116430, 118094, 83], [118094, 119053, 84], [119053, 120456, 85], [120456, 121081, 86], [121081, 121687, 87], [121687, 123619, 88], [123619, 123897, 89], [123897, 124213, 90], [124213, 125804, 91], [125804, 127439, 92], [127439, 128890, 93], [128890, 130210, 94], [130210, 131558, 95], [131558, 133152, 96], [133152, 134675, 97], [134675, 136165, 98], [136165, 137488, 99], [137488, 137488, 100], [137488, 137488, 101], [137488, 137488, 102]], "primary_language": ["None", "en", "None", "None", "en", "en", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, true, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false]}}]