[{"id": "622479b0a48a029dc185b818ab688dc4b2fd3f82", "text": "A CATALOGUE\nOF THE\nLIBRARY\nOF THE\nNORTH CHINA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n(INCLUDING THE LIBRARY OF ALEX. WYLIE, ESQ.)\n\nSystematically classed.\n\nBY\nHENRI CORDIER,\nHON. LIBRARIAN.\n\nPRINTED AT THE \"CHIN-POONG\" GENERAL PRINTING OFFICE.\n1873.\nHenri Cordier\nParis\nCONTENTS.\n\nPAGE.\n\nPREFACE ........................................................................... —\nDIVISIONS OF CATALOGUE ........................................ vii-viii\nCATALOGUE ..................................................................... 1-69\nINDEX .............................................................................. 71-79\nAPPENDIX— I MAPS AND CHARTS................................. 81-83\nII CHINESE WORKS....................................................... 84-85\nADDENDA ........................................................................ 86\nERRATA ............................................................................ ibid\nPREFACE.\n\nOWING to the want of a complete Catalogue, the Library of the North-China Branch of the Royal Asiatic Society has been hitherto practically inaccessible to the Public. The few students and savants—who were obliged to have recourse to it for their researches—had only for guides the somewhat meagre list of Books and Charts printed in the Council's Report for the year 1865, the manuscript list of the books forming the collection of Mr. Wylie and the memory of the Librarian.\n\nThis Catalogue will show the poverty of the Library and probably induce public-spirited men to add to its value by presenting works which they may have thought of no interest or already in the collection. Libraries begin to make real progress only when their contents are well known and their object well determined. Mr. Wylie's Library\\(^1\\) served as the nucleus of a good series of works on China; and its 718 volumes or pamphlets, added to those already in the possession of the Asiatic Society, formed a collection of standard works on the East numbering about 1,300 volumes.\\(^2\\)\n\nHowever valuable this collection may be, its deficiency is very great; and many a volume which an Orientalist ought to find is sought in vain through the pages of the Catalogue. Works of reference, which, whatever is the specialty of a Library, should always have some place on its shelves, are also sadly conspicuous by their absence. Now, that the paucity of our resources is known, no doubt people will come forward\n\n---\n\n1. The Books belonging to the Wylie Library are designated in the Catalogue by an asterisk *.\n\n2. These figures do not include the 1,023 Chinese volumes of Mr. Wylie and the Transactions of learned Societies and Periodical Publications which form one of the most important classes of the Library.\nand help us to fill the blanks, unfortunately too numerous. Let every one bear in mind that nothing is to be rejected:—a pamphlet, a newspaper, nay a handbill, which to the ordinary reader is no more than a valueless scrap of paper, may become, in the hands of the searcher, the means of an important discovery.\n\nOne word more. Some notes have been added to the description of the works—whether they will prove useful will be best judged by those who may have to go through the Catalogue. But in Shanghai, where the saying \"Time is Money\" is perhaps truer than in any other place in the world, it has been thought that by reference to them much time could be saved. Biographical Dictionaries and Biographical Treatises, Catalogues of Libraries and Booksellers, and especially the Catalogue of Klaproth's Collection, the classification of which has been adopted by the compiler, at least in its principal divisions, supplied the materials for those notes. The divisions will be found perhaps too numerous, but it must not be forgotten that this is only the skeleton of a Library and that some room must be provided for future acquisitions.\n\nH. C.\nDIVISIONS OF THE CATALOGUE.\n\nRELIGION.\n\n| No. | Description                                      | Page |\n|-----|--------------------------------------------------|------|\n| 1—2 | I Miscellaneous Works                            | 1    |\n| 8—9 | II Brahmanism                                    | ibid |\n| 10—18 | III Buddhism and Religions of China             | 2    |\n| 19—20 | JURISPRUDENCE                                    | 3    |\n\nSCIENCES AND ARTS.\n\n| No. | Description                                      | Page |\n|-----|--------------------------------------------------|------|\n| 21—22 | I General and Miscellaneous Works                | ibid |\n| 23—38 | II Philosophical and Moral Sciences              | ibid |\n| 39—51 | III Political and Economical Sciences            | 5    |\n| 52—91 | IV Natural, Physical and Medical Sciences        | 6    |\n| 92—108 | V Mathematical Sciences and their applications   | 8    |\n| 109—116 | VI Works on Sciences and Arts (Chinese or relating to China) | 10 |\n\nBELLES LETTRES.\n\nI Linguistics:\n\n| No. | Description                                      | Page |\n|-----|--------------------------------------------------|------|\n| 117—119 | A Miscellaneous Works                            | ibid |\n| 120—127 | B European Languages                             | 11   |\n| 128—129 | C Asiatic Languages:                             |      |\n|       | 1 Generalities                                    | ibid |\n|       | 2 Tartar Languages:                              |      |\n|       | a Manchu, Mongol, &c.                            | ibid |\n|       | b Turkish                                        | 12   |\n| 144—146 | 3 Semitic Languages (Syriac-Arab, &c.)           | ibid |\n| 147—149 | 4 Persian Languages                              | ibid |\n| 150—153 | 5 Indian Languages (Pali-Sanskrit)               | 18   |\n| 154—161 | 6 Transgangetic Languages:                       |      |\n|       | a Tibetan Language—Indo-Chinese Languages       | ibid |\n|       | b Chinese Language:                              |      |\n|       | a Lexicography:                                  |      |\n|       | * Dictionaries                                   | 14   |\n|       | ** Handbooks of Conversation,                    | 15   |\n|       | &c.                                              |      |\n| 192—215 | b Grammars, &c.                                  | 16   |\n| 216—223 | c Chrestomathies—Handbooks, &c.                  | 18   |\n| 224—231 | c Japanese Language                              | ibid |\n| 232—238 | D Miscellaneous Languages:                       |      |\n|       | (Africa, Oceania and America)                    | 19   |\n\nII Composition:\n\n| No. | Description                                      | Page |\n|-----|--------------------------------------------------|------|\n| 239—257 | A Fables, Tales and Novels                      | 20   |\n| 258—266 | B Poetry                                        | 21   |\n| 267—272 | C Theatre                                       | 22   |\n\nHISTORY.\n\n| No. | Description                                      | Page |\n|-----|--------------------------------------------------|------|\n| 273—274 | I Geography                                      | 22   |\n| 275—289 | II Travels:                                     |      |\n|       | A Introduction—Collections—Travels around the World | ibid |\n| 290—308 | B Travels to several Parts of the World         | 25   |\n| Page |\n|------|\n| C Travels in Europe .................................................. 27 |\n| D Travels in Asia: |\n| 1 Travels to several Parts of Asia .................................. ibid |\n| 2 Travels in Cisgangetic and Transgangetic India and in Central Asia, &c ........................................... 28 |\n| 3 Travels in China and Japan ........................................... 30 |\n| 4 Travels in Russian Asia ............................................... 35 |\n| E Travels in America, Africa, to the Islands of the Pacific Ocean, &c .................................................. ibid |\n| III Ancient History .......................................................... 36 |\n| IV Ecclesiastical History .................................................. 38 |\n| Appendix—Lives and Works of Missionaries ........................................... 38 |\n| V Archaeology ................................................................. 39 |\n| VI Modern History: |\n| A Europe .............................................................................. 40 |\n| B Asia: |\n| 1 Asia generally .................................................................... 41 |\n| 2 Miscellaneous Works on different Countries of Asia ................. 42 |\n| 3 Cisgangetic and Transgangetic India, &c ............................... 43 |\n| 4 China and Chinese Possessions: |\n| a History, Customs, &c ....................................................... 44 |\n| b Blue Books on China ....................................................... 55 |\n| c Miscellaneous Works published in China .................................. 56 |\n| d Shanghai Local Publications ............................................. ibid |\n| e Hongkong Local Publications .......................................... 57 |\n| 5 Japan .................................................................................. ibid |\n| C Africa—Islands of the Pacific Ocean, &c .................................. 58 |\n| D America ............................................................................... ibid |\n| VII Biography ........................................................................ ibid |\n| VIII Literary History and Bibliography ..................................... 59 |\n\n**TRANSACTIONS OF LEARNED SOCIETIES AND PERIODICAL PUBLICATIONS.**\n\nI Europe:\n| Page |\n|------|\n| A Great Britain ..................................................................... 60 |\n| B France ............................................................................... 62 |\n| C Austria, Germany, Scandinavian States, &c ............................. ibid |\n| II America .............................................................................. 63 |\n| III Asia, &c.: |\n| A Transactions of Learned Societies, &c .................................. 64 |\n| B Periodical Publications relating to Asia .................................. 65 |\n| C Periodical Publications of China ........................................ ibid |\n| Addenda .................................................................................. 66 |\nA CATALOGUE\nOF THE LIBRARY\nOF THE NORTH-CHINA BRANCH\nOF THE ROYAL ASIATIC SOCIETY.\n(Including the Library of Alex. Wylie, Esq.)\nSystematically classed.\n\nRELIGION.\n\nI. MISCELLANEOUS WORKS.\n\n1. The Ceremonies and religious Customs of the idolatrous Nations; together with historical annotations, and several curious discourses equally instructive and entertaining. Written originally in French .... by Mr. Bernard Picart.\n\nVol. IV, Part II, faithfully translated into English, by a Gentleman some time since of St. John's College in Oxford. London, printed by William Jackson, for Claude du Bosc, 1739, folio.\n\nThe complete work was published in 7 vols. folio usually bound in 6—1733-1739. 228 plates, £8. 8/0. Large paper £12. 12/0. This work was published weekly, by subscription (London).\n\nFrench editions: Amst. 1739-43, 8 tom. in 9 folio volumes. Amst. 1739-43—Paris, 1741, 7 vol.—Paris, 1783, 4 folio vol. (text by Poncelin)—Paris, 1810, 13 vol. folio—(from Brunet.)\n\n2. Het Gebet des Heeren in veertien Talen strekkende tot Proeve van Letters van het gewoon euopeesch karakter afwijkende, aanwezig ter Boekdrukker ij van E. J. Brill, Boekhandelaar en Akademiedrukker, te Leiden, 1855, pp. 4°\n\nII. BRAHMANISM.\n\n3. Translation of several principal books, passages, and texts of the Veds, and of some controversial works on Brahminical Theology by Rajah Rammohun Roy. Second edition, London, Parbury Allen & Co.\n\nThis volume contains the following three pamphlets.\n\n4. Translation of an abridgment of the Vedant or Resolution of all the Veds; the most celebrated and revered work of Brahminical Theology; establishing the unity of the Supreme Being; and that He alone is the object of propitiation and worship, by Rammohun Roy. Calcutta, 1816, 14 pag.—Translation of the Ishopanishad, one of the chapters of the Yagur Veda: according to the Commentary of the celebrated Shankar-Acharya; establishing the unity and incomprehensibility of the Supreme Being; and that his worship alone can lead to eternal beatitude—by the same. Calcutta, 1816, xxiv-8 pag.—A defence of Hindoo Theism in reply to the attack of an advocate for idolatry at Madras by the same. Calcutta, 1817, 58 pag., small 4°\n\n5. Exposé de quelques uns des principaux articles de la Théogonie des Brahmes, contenant la Description détaillée du Grand Sacrifice du Cheval, appelé Assna-Meda; de l'origine et des grandeur du Gange; du Temple célèbre de Gaya; des principaux Avatars, ou Incarnations de Vichnou, etc.; extrait et traduit des meilleurs originaux écrites dans les langues du pays, par M. l'abbé J. A. Dubois. Paris, Dondey Dupré, 1825, 8°\n*6 The religious aspects of Hindu Philosophy stated and discussed. A Prize Essay by the Rev. Joseph Mullens. London, Smith, Elder & Co., 1860, 8°\n\nIntroduction.\n\nPart. I. General View of the Systems of Hindu Philosophy.\n\nThe Vedic Age.\nThe three chief systems.\nChap. 1 the Sankhya.\n\" 2 the Nyaya.\n\" 3 the Vedanta.\n\" 4 Comparison of the three systems.\n\nII. The chief religious errors of these systems.\nIII. Discussion of these errors.\nIV. An Outline of scientific and religious truth.\n\n*6a The Sánkhya Kárká, or Memorial Verses on the Sánkhya Philosophy by Iswara Krishna; translated from the Sanscrit by Henry Thomas Colebrooke, Esq., also the Bháshya or Commentary of Gaurapáda; translated and illustrated by an original comment by Henry Hayman Wilson. Oxford, Or. trans. fund, 1887, 4°\n\n7 Essays and Lectures chiefly on the Religion of the Hindus, by the late H. H. Wilson, M.A., F.R.S. Boden Professor in the University of Oxford .... collected and edited by Dr. Reinholt Rost. London, Trübner & Co., 1862, 2 vols., 8°\n\nVol. I. A sketch of the religious Sects of the Hindus.\n\" II. Miscellaneous Essays and Lectures.\n\n8 The Vishnú Purána: a system of Hindu Mythology and tradition translated from the original sanskrit .... by the late H. H. Wilson .... edited by Fitzedward Hall. London, Trübner & Co., 1864, 2 vols., 8°\n\n9 A sketch of the religious Sects of the Hindus, 8°\n\nIII. BUDDHISM AND RELIGIONS OF CHINA.\n\n*10 Introduction à l'histoire du Buddhisme indien par E. Burnouf. Tome premier (the only one published.) Paris, Imp. Royale, 1844, 4°\n\n*11 Le Lotus de la Bonne Loi, traduit du Sanscrit, accompagné d'un commentaire et de vingt et un Mémoires relatifs au Buddhisme, par M. E. Burnouf. Paris, Imp. Nationale, 1852, 4°\n\n*12 Parabole de l'Enfant égaré formant le chapitre IV du Lotus de la Bonne Loi publiée pour la première fois en Sanscrit et en tibétain, lithographiée à la manière des livres du Tibet, et accompagnée d'une traduction française d'après la version tibétaine du Kanjour par Ph. Ed. Foucaux. Paris, B. Duprat, 1854, 8°\n\n13 Three Lectures on Buddhism by Rev. Ernest J. Eitel. Hongkong and London, 1871, ppt. 8°\n\n14 Panthéon chinois, ou Parallèle entre le Culte religieux des Grecs et celui des des Chinois; avec de nouvelles preuves que la Chine a été connue des Grecs et que les Sérés des auteurs classiques ont été des Chinois par Joseph Hager. Paris, Didot l'ainé 1806, 4to.\n\n*15 Specimen du Gya-Toher-Rol-Pa (Lalita Vistara) Partie du chapitre VII, contenant la naissance de Cakya-Muni. Texte tibétain traduit en français et accompagné de notes par Ph. Ed. Foucaux. Paris, B. Duprat, 1841, 8°, 88 pag.\n\n\"Egya Tch'her Rol Pa ou développement des Jeux contenant l'histoire du Bouddha Cakya-Mouni, traduit sur la version tibétaine par Ph. Ed. Foucaux. 1ère partie texte tibétain, 2e partie Traduction français\" a été publié en 2 vols. in 4° à Paris, 1847—8.\n16 Buddhism in Thibet by Emil Schlagintweit, LLD. Atlas of objects of Buddhist worship. xx-plates. Leipzig, Brockhaus, 1863, folio.\n\nThe text published the same year forms one vol., roy. 8°\n\n*17 Historia Cultus Sinensium, seu varia Scripta de Cultibus Sinarum . . . . oblati Innocentio XII pontifici maximo . . . Colonia, 1700, 2 vols., 12°\n\n*18 Die Religion und der Cultus der alten Chinesen von Dr. Joh. Heinrich Plath. München, 1862, 4°\n\nVide a \"List of the Principal Buddhistical Works from the Pali, in Chinese Characters by Mr. Gutzlaff\" in Journal R. As. Society, IX, pag. 207.\n\n---\n\nJURISPRUDENCE.\n\n19 Ta Tsing Lou Lee: being the Fundamental Laws, and a selection from the supplementary statutes, of the Penal Code of China; originally printed and published in Pekin, in various successive editions, under the sanction, and by the authority of the several emperors of the Tu Tsing, or present dynasty. Translated from the Chinese and accompanied with an appendix consisting of authentic documents and a few occasional notes by Sir George Thomas Staunton. London, Cadell, 1810, 4°\n\nIt has been translated into French, with notes, by Mr. Félix Renouard de Sainte-Croix, Paris, Léoncramt, 1812, 2 vols. 8°\n\n20 A Digest of Hindu Law on Contracts and successions: with a commentary by Jagannatha Tercapanchanana translated from the original sanscrit by H. T. Colebrooke, 3rd edition. London, 1801, Madras, 1864-65, 2 vols. 8°\n\nFirst edition, Calcutta, 1797, 4 vols. 4°\n\nSecond do. London, 1801, (not 1800 as stated in Lowndes), 3 vols. 8°\n\n---\n\nSCIENCES AND ARTS.\n\nI. General and Miscellaneous Works\n\n21 The Encyclopedia Britannica or Dictionary of Arts, Sciences and General Literature. Eighth Edition, with extensive improvements and additions; and numerous engravings. Adam and Charles Black, Edinburgh, 1858-1860, 21 vols. 4° and Index.\n\n*22 A Dictionary of Terms in Art, edited and illustrated by F. W. Fairholt, F.S.A. Virtue Hall & Virtue, London, s. a. 8°\n\nII. Philosophical and Moral Sciences.\n\n*23 Les Livres Classiques de l'Empire de la Chine recueillis par le Père Noël; précédés d'observations sur l'origine, la nature et les effets de la philosophie morale et politique dans cet empire. 7 vols., bound in-4, in-18.\n\nTome I. Paris, 1784.—Morale et Politique des Chinois.\n\nTome II. 1783.—Observations—La Grande Science ou Science des Adultes—Le Juste Milieu ou le Milieu immuable.\n\nTome III. 1785.—Avant-propos—Le Livre des Sentences.\n\nTome IV. 1785.—Suite du Livre des Sentences.\n\nTome V. 1786.—Avant-propos—Mengtseu ou le Livre de Memcius.\n\nTome VI. 1788.—Suite de Memcius.\n\nTome VII. 1786.—Avant-propos—Le Livre de la Piété filiale—Le Livre de l'Ecole des Enfants.\n\nLe P. François Noël, savant jésuite allemand et missionnaire à la Chine, naquit vers 1640. Vide Renouard's Nouveaux Mélanges Asiatiques. Tome Second, p. 252 et seq.\n*24 Les Livres sacrés de l'Orient, comprenant le Chouking ou le Livre par excellence; les Sse-chou ou les quatre livres moraux de Confucius et de ses disciples; les Lois de Manou, premier législateur de l'Inde; le Koran de Mahomet; traduits ou revus et publiés par G. Pauthier. Paris, Firmin Didot Frères, et Aug. Desrez, 1841, gr. 8°\n\nJean-Pierre-Guillaume Pauthier was born the 4th October 1801, at Besançon.\n\n25 The Chinese Classics: with a translation, critical and exegetical notes, prolegomena, and copious indexes by James Legge, D.D., in seven volumes, (roy. 8°)\n\nVol. I containing Confucian Analects, the Great Learning, and the Doctrine of the Mean. Hongkong, 1861.\nVol. II containing the works of Mencius. Idem, 1861.\nVol. IV Part I containing the first part of the She-king, or the lessons from the States; and the Prolegomena. Hongkong and London, 1871.\nVol. IV Part II containing the second, third and fourth parts of the She-king, or the Minor Odes of the Kingdom; the Greater Odes of the Kingdom, the Sacrificial Odes and praise songs; and the indexes. Hongkong and London, 1871.\n\n*26 Le Chouking, un des Livres sacrés des Chinois, qui renferme les Fondements de leur ancienne histoire, les Principes de leur Gouvernement et de leur Morale; ouvrage recueilli par Confucius. Traduit et enrichi de notes, par Feu le P. Gaubil, Missionnaire à la Chine, revu et corrigé .... par M. de Guignes .... on y a joint une notice sur l'Y-king .... Paris, N.M. Tilliard, 1770, 4°\n\nLe P. Antoine Gaubil was born at Gaillao, the 14th July 1689, and died on the 24th July 1759. Vide Rémusat's Nouveaux Mélanges Asiatiques, Tome Second, p. 277, et seq.\n\n*27 Confucius Sinarum Philosophus, sive Scientia Sinensis latine exposita; studio et opera Prosp. Intorcetta, Christ. Herdtrich, Franc. Rougemont, Phil. Couplet, adjecta est tabula chronologica Sinicæ monarchiae ab hujus exordio ad hæc usque tempora.\n\nProsper Intorcetta was born at Piazza in Sicily, in 1625 and died on the 3rd October 1696, Rémusat, p. 229, et seq.\n\n\"LXXIX. P. Prosper Intorcetta Siculus, codem anno (1659) venit praedicatum S. Legem in Kiangsi, modò versatur in Metropoli Hangchou Provincia Chekiang. Ab eo edita: Confucii Philosophi sententiae in latinam linguam traductae—Regulas item Societatis nostræ Sinicæ conscriptæ—Item exercitia spiritualia S. P. Ignatii. Ph. Couplet Cat. Pat. Soc. Jesu p. 122.\n\nLXXXIV. P. Christianus Herdtrich Germanus, Kunghy Imperatoris anno 17 (1660) venit propagatum S. Fidem in Provincia Xansi, Kanghy Imperatoris anno 10 (1671) ex regio mandato Mathematicæ causa in Aniam venit ejusdem anno 15 (1676) ex regio consensu protectoris in Provincia Xansi, Oppidum Kiangchou. Ejusdem Cat. Pat. Soc. Jesu p. 124.\n\nLXXVII. P. Philippus Couplet Belgæ, codem anno (1659) venit praedicatum S. Legem in Provincia Kiangsi, Fokien, Huquang, Chekiang, Nanking aliisque locis—Ejusdem Cat. Pat. Soc. Jesu p. 121.\"\n\n*28 Wilhelm Schott: Werke der tschinesischen Weissen Kung-fu-dsu und seiner Schüler. Halle, 1826, and Berlin, 1832, 2 vols. 8°\n\n*29 Li-ki ou Mémorial des Rites traduit pour la première fois du Chinois, et accompagné de notes, de commentaires et du texte original par J. M. Callery. Turin, Imp. Roy., 1858, 4°\n\n30 Mémoire sur l'origine et la propagation de la doctrine du Tao, fondée par Lao-Tseu, traduit du chinois, et accompagné d'un commentaire tiré des Livres Sanscrits et du Tao-te-king de Lao-Tseu, établissant la conformité de certaines opinions philosophiques de la Chine et de l'Inde; orné d'un dessin chinois; suivi de deux oupanishads des Vedas, avec le texte sanscrit et persan, par M. Pauthier. Paris, Donde Dupré, 1881, 8°, 79 pag.\n*81 Le Livre des récompenses et des peines en Chinois et en Français; accompagné de quatre-cents légendes, anecdotes, et histoires, qui font connaître les doctrines, les croyances et les moeurs de la secte des Tao-Tssé. Traduit du Chinois par Stanislas Julien. Paris, printed for the Oriental Transl. Fund, 1835, 8°\n\n*82 Lao Tseu Tao Te-king. Le Livre de la voie et de la vertu composé dans le VIe siècle avant l'ère chrétienne par le philosophe Lao-Tseu traduit en Français, et publié avec le texte chinois et un commentaire perpétuel par Stanislas Julien. Paris, Imp. Roy., 1842, 8°\n\n*83 Y-king antiquissimus sinarum liber quem ex latina interpretatione P. Regis aliorumque ex Soc. Jesu P. P. editit Julius Mohl, 1834-39. Stuttgartiae et Tubingae, 2 vols. 8° bd. in 1.\n\nOn Jean-Baptiste Régis. Vide Rémusat, p. 235, et seq.\n\n*84 Meng Tseu vel Mencium inter Sinenses philosophos, ingenio, doctrina, nominisique claritate Confucio proximum, edidit, latina interpretatione, ad interpretationem tartaricam utramque recensita, instruxit, et perpetuo commentario, e sinicis deprompto, illustravit Stanislaus Julien. Lutetiae Parisiorum, 1 vol. 8°\n\nPars Prior 1824-1826, Partis prioris continuatio.\nPars Posterior 1826-1829, Partis posterioris continuatio.\n\n*85 S. Julien's Mencius in China.\n\n*86 The Sacred Edict, containing Sixteen Maxims of the Emperor Kang-he, amplified by his Son, the Emperor Yoong-ching; together with a paraphrase on the whole, by a Mandarin. Translated from the Chinese original, and illustrated with notes by the Rev. William Milne. London, 1817, 8°\n\n*87 Hien-Wun-Shoo—Chinese Moral Maxims, with a free and verbal translation: affording examples of the Grammatical Structure of the Language, compiled by John Francis Davis, F.R.S. London, 1828, 8°\n\n*88 The Three Fold San-Tze-King or the Triliteral Classic of China, as issued:\nI. by Wang-Po-Keou. II. by Protestant Missionaries in that country; and III. by the rebel chief, Tae-ping Wang put into English, with notes by the Rev. S. C. Malan, M.A. London, David Nutt, 1856, 12°, 78 pag.\n\nIII. POLITICAL AND ECONOMICAL SCIENCES.\n\n*89 Institutes political and military written originally in the Mogul Language, by the Great Timour, improperly called Tamerlane; First translated into Persian by Abu Taalib Alhusseini; and thence into English, with marginal notes by Major Davy .... The original Persian transcribed from a MS. in the possession of Dr. William Hunter, physician extraordinary to the Queen, F.R.S. and A.S., and of the Royal Academy of Sciences of Paris, and the whole work published with a Preface, Indexes, geographical Notes, &c., &c., by Joseph White, B.D. Oxford, Clarendon Press, 1783, 4°\n\nFrench translation: Instituts politiques et militaires de Tamerlan, proprement appelé Tymour, écrits par lui même, en mogol, et traduits en français sur la version persane d'Ahou-Thâleb-al-Hhocény, avec la vie de ce conquérant d'après les meilleurs auteurs orientaux, des notes et des tables historiques et géographiques (par L. M. Langlès.) Paris, Née de la Rochelle, 1787, 8°\n\n*90 Ayeen Akberry; or, the Institutes of the Emperor Akber. Translated from the original Persian by Francis Gladwin, 2 vols. 4° bd. in 1. London, 1800.\n\n\"Calcutta, 1788-6, 3 vols. 4°\n\n41 Das Gesetz des Menschlichen Wachsthumes .... von Franz Liharzlik. Wien, 1858, 8°\n42 The Indian Revenue System as it is—a Letter addressed to the President . . . of the Manchester Chamber of Commerce and Manufactures by Harvey Tuckett, Gent. London, Smith, Elder & Co., 1840, 8°\n\n43 A Dictionary practical, theoretical and historical of Commerce and Commercial Navigation by J. R. M'Culloch, Esq. Vol. II. 8°, Philadelphia, 1856, (2 copies.)\n\n44 Les valeurs de Douane officielles et actuelles en France, en Angleterre et en Belgique par M. Natalis Rondot. Paris, Guillaumin & Cie., ppt. 8°, 1858.\n\n45 Chambre de Commerce de Lyon—Musée d'Art et d'Industrie—Rapport de M. Natalis Rondot . . . Lyon, L. Perrin, 1859, 4°\n\n46 Our Commerce with China by C. A. Skatschkoff (in Russian). St. Petersburg, 1863, ppt. 8°\n\n47 Annual Report of the Secretary of State relative to the Statistics of the Poor of the State of New York transmitted to the Legislature, March 28, 1855. Albany, 1855, 8°, (2 copies.)\n\n48 Report of the Secretary of State on the Criminal Statistics of the State of New York. Albany, 1855, 8°, (2 copies.)\n\n49 Seventh Annual Report of the Governors of the Alms House, New York, for the year 1855. New York, 1856, 8°, (2 copies.)\n\n50 Annual Report of the Commissioners of Emigration, of the State of New York, for the year ending December 31, 1856. New York, Messrs. C. Bryant & Co., 1857, 8°, (2 copies.)\n\n51 Tenth Annual Statement of the Trade and Commerce of Chicago for the year ending March 31, 1868, reported to the Chicago Board of Trade by John F. Beaty, Secretary. Chicago, 1868, 8°, (2 copies.)\n\nIV. NATURAL, PHYSICAL AND MEDICAL SCIENCES.\n\n52 Albohazen Haly filii Abenragel, scriptoris arabici, de judiciis astrorum libri octo, doctorum aliquot virorum opera in latinum sermonem conversi, postremo autem summa cura et diligentia studio a barbarie vindicati et puritati linguae donati per Antonium Stupam Rhetum Prægallensem. Basilea ex officina Henrici Petrina, folio s. a.\n\n*53 Mizaldus redivivus sive Centuria XII Memorabilium, utilium ac jucundorum in Aphorismos Arcanorum omnis generis locuples, per pulchre digestae; partim ab Antonio Mizaldo Monluciano, Medico; partim ex aliis fide dignis probatisque auctoribus excerptae. Editio nov. Norimb. Johannis Zigeri, 1681, 12°\n\n*54 Joannis Franci Veronica Theezans id est Collatio Veronicæ Europææ cum Thee Clinitico, Accedit Mantisse loco conjectura de Alyssio Dioscoridis ad Virum Magnificum, D.D. Jo. Georgium Klosterbaur. Lipsiae, P. G. Pfotenhouverum, 12°\n\n55 Commentary on the Hindu System of Medicine by T. A. Wyse, M.D. Calcutta, 1845, 8°\n\n56 A Geological Report on the Damodah valley by D. H. Williams, Esq.; late geological surveyor in the service of the East-India Company. London, J. & H. Cox, 1850, ppt. 8°, 191 pag., (2 copies.)\n\n57 A Geological Report on the Kymore Mountains, the Ramghur Coal Fields and on the Manufacture of Iron, &c., &c., by the same. Calcutta, F. Carbery, 1852, ppt. 8°, 92 pag., (2 copies.)\n58 The Mastodon Giganteus of North America by John C. Warren. *Boston*, 1852, 4°\n\n59 Observations on the Physical Geography and Geology of the coast of California, from Bodega Bay to San Diego by W. P. Blake, 1855, ppt. 4°\n\n60 First Report of a Geological Reconnoissance of the Northern Counties of Arkansas, made during the years 1857 and 1858, by David Dale Owen .... *Little Rock*, 1858, 8°, (2 copies.)\n\n61 Second Report of a Geological Reconnoissance of the Middle and Southern Counties of Arkansas, made during the years 1859 and 1860, by the same. *Philadelphia*, 1860, 8°, (2 copies)\n\n62 A Manual of Scientific Enquiry, prepared for the use of officers of her Majesty's Navy; and Travellers in general, originally edited by Sir John F. W. Herschel, Bart., 3rd ed., superintended by the Rev. Robert Main. *London*, John Murray, 1859, sm. 8°\n\n63 Om de Geologiske forhold paa kyststrækningen af nordre bergenshus amt. af M. Irgens og Th. Hiortdahl. *Christiana*, 1864, 4°\n\n64 Om Sneebraeens Folgefonden af S. A. Sexe. *Christiana*, 1864, 4°, 36 pag.\n\n65 Bidrag til Kundskab om Christianafjordens Fauna af .... Michael Sars. *Christiana*, Johann Dahl, 1868, 8°\n\n66 Mémoires pour servir à la connaissance des Crinoides vivants par Michael Sars .... Programme de l'Université royale de Norvège. *Christiana*, 1868, 4°\n\n67 Om Vegetations forholdene ved \"Sognefjorden\" af A. Blytt. *Christiana*, Johann Dahl, 1869, 8°\n\n68 Le Glacier de Boium en Juillet 1868 par S. A. Sexe. *Christiana*, 1869, ppt. 4°, 40 pag.\n\n69 En Anatomisk Beskrivelse af de paa over-og underextremiteterne forekomende Bursae Mucosae. *Christiana*, 1869, 4°\n\n70 Adversaria in Stirpes imprimis Asiae Orientalis criticas minusve notas interjectis novarum Plurimorum Diagnosibus scripsit Henr. F. Hance. *Paris*, V. Masson, 1866, ppt. 8°\n\n71 Note sur deux espèces du genre Scolopia Schreb. par M. H. F. Hance. *Extrait des Annales des Sciences Naturelles*, ppt. 8°, 25 pag.\n\n72 Symbola ad floram Sinicam adjectis paucissimarum stirpium Japonicarum Diagnosibus autore Henr. F. Hance. *Ext. des Ann. des Sc. Nat.*, ppt. 8°, 11 pag.\n\n73 Report on the invertebrata of Massachusetts, published agreeably to an order of the Legislature. Second edition, comprising the Mollusca by Augustus A. Gould, M.D. *Boston*, 1870, 8°\n\n74 General Report on the Punjab Oil Lands by Benjamin Smith Lyman with Maps. *Lahore*, 1870, ppt. folio.\n\n75 Questions on Agriculture and Husbandry in general, ppt. 8°, 30 pag., (2 copies.)\n\n76 Flora of Hongkong summarised from the valuable, \"Flora Hongkongensis\" of Mr. George Bentham, President of the Linnean Society, ppt. 9 pag.\n\n77 A Vol. of plates on \"Mollusques,\" s. a. 8°\n\n78 Rules for the course to be followed by the Bystanders in case of Railroad Injury when Surgical help cannot be at once obtained by John H. Packard, M.D. *Philadelphia*, (1 sheet.)\n\n79 Tenth Annual Report of the Columbia Institution for the deaf and dumb, for the year ending June 30, 1867, ppt. 8°\n80 Statistical Report on the Sickness and Mortality in the Army of the United States. Washington, 1840, 8°\n\n81 The United States Sanitary Commission. A Sketch of its purposes and its work. Boston, 1863, pp. 8°\n\n82 The Sanitary Commission of the United States Army; a succinct narrative of its works and purposes. New York, 1864, 8°\n\n83 Memorial of the Great Central Fair for the United States Sanitary Commission held at Philadelphia, June 1864, by Charles J. Stilliè. Philadelphia, 1864, 4°\n\n84 Reports on the extent and nature of the Materials available for the preparation of a Medical and Surgical History of the Rebellion. Philadelphia, 1865, 4°\n\n85 A Record of the Metropolitan Fair in aid of the United States Sanitary Commission held at New York in April 1864. New York, 1867, sm. 4°\n\n86 History of the United States Sanitary Commission being the General Report of its work during the war of the Rebellion by Charles J. Stilliè. New York, 1868, 8°\n\n87 Report of the Commissioner of Agriculture for the year 1866. Washington, Gov. Print. Office, 1867, 8°, (2 copies.)\n\n88 Monthly Report of the Department of Agriculture for the year 1866. J. R. Dodge, Editor. Washington, Gov. Print. Office, 1867, 8°, (2 copies.)\n\n89 The same for the year 1867. Washington, 1868, (2 copies.)\n\n90 Report of the Commissioner of Agriculture for the year 1868. Washington, Gov. Print. Office, 1869, 8°\n\n91 Cosmos: Sketch of a Physical description of the Universe by Alexander von Humboldt, translated under the superintendence of Major-General Edward Sabine. London, Longman & Co. John Murray, 4 vols. 8°\n\nVol. I. New Edition, 1859.\n\nII. 1852.\n\nIV. 1855.\n\nV. MATHEMATICAL SCIENCES AND THEIR APPLICATIONS.\n\n92 One volume 4° containing:\n\n1. Muhammedis Fil. Ketiri Ferganensis, qui vulgo Alfraganus dicitur, elementa astronomica, arabice et latine. cum notis ad res exoticas sive orientales, que in iis occurrunt opera Jacobi Golli. Amstelodami, 1669.\n\n\"This is a very scarce and curious work, beautifully and correctly printed. A few years ago it was in Cuthell's Catalogue for 7/6. (Adam Clarke's Bibliog. Diet.) Vend. 22 fr. de Lalande; 38 fr. Anquetil; 10 fr. Langlès (Brunet.)\n\n2. Id est itinera Mundi, sic dicta nempe Cosmographia, autore Abrahamo Peritsol. Oxonii, 1691.\n\nTractatus Alberti Bobovii Turcarum Imp. Mohammedis IVti olim Interpretis primarii, de Turcarum Liturgia, peregrinatione Meccana, circumcisione, aegrororum visitatione etc. Oxonii, 1690.\n\n3. Astronomia europea sub imperatore Tartaro-sinice Cám Hy appelato ex umbra in lucem revocata a R. P. Ferdinando Verbiest. Dilingae, 1687.\n\nCATALOGUS PATRUM Soc. Jesu qui post obitum S. Francisci Xaverii ab anno 1581 usque ad annum 1681 in imperio Sinarum Jesu Christi fidem propagarunt, ubi singulorum nomina, ingressus, praedicatione, mors, sepultura, libri sineedit editi recensentur.—E sinico latine redditus a P. Philippo Couplet.\n\nEx libris Theoph. Sig. Bayer Regiom.\nLXXX. P. Ferdinandus Verbiest Belgae, codem anno (1659) venit praedicatum S. Legem in Provincia Xensi; anno sequente ex mandato regio ingressus Aulam ad ephemerides componendas; Kanghi Imperatoris anno 8 (1669) iussu administrare Kalendarium astronomicum, insuper ab Imperatore donatus Mandarinate Taichangshu, anctus deinde alia dignitate Tungshin fusâ. Ph. Couplet Cat. Pat. Soc. Jesu, ppt. 122-123.\n\n\"Ferdinand Verbiest was born at Pithcens near Courtray on the 9th of October 1623, joined the Society of Jesus in 1641, came to China in 1659. (Vide the extract from Couplet's Cat. as above) and died at Pekin the 29th January 1668.\"**\n\n*98 The Algebra of Mohammed ben Musa, edited and translated by Frederic Rosen. London, Oriental Translation Fund, 1881, 8°\n\n94 Om Cirklers Berorings af C. M. Guldberg. Christiana, 1861, 4° ppt., 32 pag.\n\n95 Resultate Magnetischer, Astronomischer und Meteorologischer Beobachtungen auf einer reise nach dem östlichen Sibirien in der Jahren 1828-1830 von Professor Christoph Hausteen und Lieutenant Due. Christiana, 1868, 4°\n\n96 A List of the reported Dangers to Navigation in the Pacific Ocean whose positions are doubtful, or not found on the Charts in general use. Washington, Gov. Print. Office, 1866, 8°\n\n97 Report on Interoceanic Canals and Railroads between the Atlantic and Pacific Oceans by Admiral Charles H. Davis. Washington, Gov. Printing Office, 1867, 8°\n\n98 Meteorological register for the years 1826, 1827, 1828, 1829 and 1830; from observations made by the Surgeons of the Army and others at the Military ports of the United States prepared under the direction of Thomas Lawson, M.D., Surgeon-General U. S. Army .... to which is appended the Meteorological register for the years 1822, 1823, 1824 and 1825, compiled under the directions of Joseph Lovell, M.D. Philadelphia, 1840, 8°, (2 copies.)\n\n99 The same for the years 1831-1842. Washington, 1851, 8°, (2 copies.)\n\n100 Results of Meteorological observations made under the direction of the United States Patent Office and the Smithsonian institution, from the year 1854 to 1859 inclusive, being a report of the Commissioner of Patents made at the first session of the Thirty-sixth Congress.\n\nVol. I. Washington, Gov. Print. Office, 1861, 4°\n\nII. Part I do. do. 1864, 4°\n\n101 Message from the President of the United States communicating in compliance with a resolution of the Senate of July 24, 1854, the fourth meteorological Report of Prof. James P. Espy. Washington, 1857, 4°\n\n102 Report upon the Colorado River of the West, explored in 1857 and 1858, by Lieutenant Joseph C. Ives, Corps of Topographical Engineers, under the direction of the office of explorations and surveys, A. A. Humphreys, Captain Topographical engineers in charge. By order of the Sec. of War. Washington, 1861, 4°\n\n103 Army meteorological register for twelve years 1849 to 1854 inclusive .... Washington, 1855, 4°\n\n104 Report of the Superintendent of the United States Coast Surveys, showing the progress of the survey during the year 1856. Washington, 1856, 4°\n\n105 The same for 1857. Washington, 1858, 4°\n\n* \"These dates were kindly given to me by the Rev. P. Pfister, S. J. to whom I am indebted for many of the particulars regarding the Members of his Society contained in this Catalogue.\" The dates given in many Biographical Dictionaries are most inaccurate—1650 is fixed by one of them as the year of the birth of P. Verbiest!—H. C.\n106 Report of the Superintendent of the United States Coast Surveys, showing the progress of the survey during the year 1863. Washington, 1864, 4°\n\n107 The same for 1864. Washington, 1866, 4°\n\n108 The same for 1865. Washington, 1867, 4°\n\nVI. Works on Sciences and Arts (Chinese or relating to China.)\n\n*109 Specimen Medicinae Sinicæ, sive opuscula Medica ad Mentem Sinensium .... edidit Andreas Cleyer .... Francofurti J. P. Zubrodt, 1682, 4°\n\n110 Notes on Chinese Materia Medica by Daniel Hanbury, reprinted, with some corrections, from the Pharmaceutical Journal and Transactions. London, printed by John E. Taylor, 1862, 8°, 48 pag., (2 copies.)\n\n111 First Preliminary Notice of geological explorations in China by F. Baron v. Richthofen, 8°, 12 pag.\n\n112 Papers on Chinese Zoology by R. Swinhoe .... 8°, reprinted from the Proc. Zool. Soc. of London.\n\n*113 Résumé des principaux traités chinois sur la Culture des Muriers et l'éducation des vers à soie—traduit par Stanislas Julien. Paris, Imp. royale, 1837, 8°\n\n\"This is a translation of books 72-76 of the Shōu she t'ung k'aoou. The Baron Léon d'Hervey-Saint-Denys gives a Syllabus of the last named work, as an appendix to his 'Recherches sur l'Agriculture et l'Horticulture des chinois.'\" (pp 221-268.)\n\nTranslations: Italian Torino 1837—German, Stuttgart & Tübingen 1837—2nd ed. 1844—English, Washington 1838—Russian, St. Petersburg 1840. Vide Wylie's Notes on Chinese Literature p xxi.\n\n114 Recherches sur l'Agriculture et l'Horticulture des Chinois .... par le Baron Léon d'Hervey Saint-Denys. Paris, Allouard & Kaepelin, 1850, 8°\n\n115 Chambre de Commerce de Lyon—Notice du Vert de Chine et de la teinture en vertchez les Chinois par M. Natalis Rondot .... suivie d'une étude des propriétés chimiques et tinctoriales du Lo-kao par M. J. Persoz .... et de recherches sur la matière colorante des nerpruns indigènes par M. A. F. Michel. Paris, Ch. Lahure & Cie, 1858, roy. 8°, (2 copies.)\n\n*116 Histoire et Fabrication de la Porcelaine Chinoise, ouvrage traduit du Chinois par M. Stanislas Julien .... accompagné de notes et d'additions par M. Alphonse Salvétat .... et augmenté d'un Mémoire sur la porcelaine du Japon, traduit du Japonais, par M. le Docteur Hoffmann. Paris, Mallet-Bachelier, 1856, 8°\n\nBELLES-LETTRES.\n\nI. Linguistics.\n\nA—Miscellaneous Works.\n\n117 Sinico-Aegyptiaca—Essai sur l'origine et la Formation similaire des écritures figuratives chinoise et égyptienne, composé principalement d'après les écrivains indigènes, traduits pour la première fois dans une langue européenne par G. Pauthier. Paris, Firmin Didot Frères, 1842, 8°\n\n*118 Lectures on the Science of Language delivered at the Royal Institution of Great Britain in April, May, June 1861 by Max. Müller, M.A. London, Longman, 1861, 8°\n\n119 On the Origin of Language by Hensleigh Wedgwood. London, Trübner, 1866, sm. 8°\nB—European Languages.\n\n*120 Le Grand Dictionnaire Français et Flamand, composé sur le Modèle des Dictionnaires de Richelet, Pomey, Tachard et Danet . . . par François Halma, Amsterdam, 2nd ed., 1717, 4°\n\n*121 Dictionnaire Flamand et Français tiré de l'usage et des bons auteurs par François Halma. 2nd ed. Amsterdam et Utrecht, 1769, 4°\n\n*122 Nederduitsche Spraakkunst ten dienste der Scholen, uitgegeven door P. Weiland, te Dordrecht, 1820, 8°\n\n*123 Syntaxis of woordvoeging der Nederduitsche Taal. uitgegeven door de Maatschappy: Tot mit van't algemen. Tweede Druk, te Leiden en Deventer, 1846, 8°\n\n*124 A Gaelic Dictionary, in two parts: I. Gaelic and English, II. English and Gaelic, . . . to which is prefixed a new Gaelic Grammar by R. A. Armstrong, A.M. London, James Duncan, 1825, 4°\n\n*125 A Glossorial Index to the printed English literature of the thirteenth century by Herbert Coleridge. London, Trübner, 1859, 8°, (2 copies.)\n\n126 Suffolk Surnames by N. I. Bowditch, 3rd ed., London, Trübner; Boston, Ticknor & Fields, 1861, 8°\n\nFirst Edition, privately printed, Boston, 1857. Second Edition, Boston, 1858, 8°\n\n127 An Attempt to ascertain the true derivation of the names of towns and villages, and of rivers, and other great natural features of the County of Norfolk, by the Rev. George Munford. London, 1870, 8°\n\nC—Asiatic Languages.\n\n1 Generalities.\n\n*128 Asia Polyglotta von Julius Klaproth. Paris, A. Schubart, 1823, 4°\n\n\"Asia Polyglotta.\" Paris, Schubart, 1829, 4°, 2nd ed. corrigée et augmentée n'est pas une nouvelle édition, c'est un titre nouveau, mais l'ouvrage est augmenté de 60 pages, sous le titre de: additions et améliorations. Vide 1st Part of Klaproth's Catalogue, p. 50.\n\n*129 Asia Polyglotta von Julius Klaproth—Sprachatlas. Paris, 1823, folio.\n\n2 Tartar Languages.\n\na Manchu-Mongol, &c.\n\n*130 Recherches sur les langues tartares ou Mémoires sur differens points de la Grammaire et de la Littérature des Mandchous, des Mongols, des Ouigours et des Tibétains, par M. Abel Rémusat. Vol. I (the only one published.) Paris, Imp. roy.; 1820, 4°\n\n*131 Alphabet Mantchou, rédigé d'après le Syllabaire et le Dictionnaire universel de cette Langue; par L. Langlès, 3e. éd., augmentée d'une notice sur l'origine, l'histoire et les travaux littéraires des Mantchoux actuellement maîtres de la Chine. Paris, Imp. imp., 1807, 8°\n\n*132 Vollständige neubearbeitete aelterste Türkischen, Tartarischen und Mogholischen Völkerstämme nach Raschid-ud-din's vorgange bearbeitet von Franz von Erdmann. Kasan, 1841, 8°\n\n*133 Translation of the Ts'ing Wan-K'omung, a Chinese Grammar of the Manchu Tartar Language; with introductory notes on Manchu Literature. Shanghai—London Mission Press, 1856, 8°\n\n\"Translated by A. Wylie.\"\n\n*134 Linguae Mandshuricae Institutiones quas conscripsit, indicibus ornavit, Chrestomathia et Vocabulario auxit Franciscus Kaulen. Ratibonæ, 1866, 8°\nSir William Jones was born in London, on the 28th Sept. 1746. Being called to the Bar in 1774, he was appointed a Judge in the Supreme Court of Judicature at Fort William in Bengal in the year 1783. His death took place at Calcutta on the 27th April 1794.\n\nThe complete works of Sir W. J. were published in 6 vols. 4° (1799) with a supp. of 2 vols. 4° (1801) containing his contrib. to the Asiatic Researches. His Poetical works were published with his Life in 2 vols. 12°, London, 1807.\n\n\"Memoirs of the Life, Writings and Correspondence of Sir William Jones,\" were written by Lord Teignmouth, Lond. 1804, 4°\n\n149 A Dictionary Persian, Arabic and English; with a dissertation of the Languages, Literature and Manners of Eastern Nations by John Richardson, Esq., F.S.A. .... a new edition .... by Charles Wilkins. London, 1806-1810, 2 vols. 4°\n\n5 Indian Languages (Pali-Sanskrit.)\n\n*150 Essai sur le Pali, ou Langue sacrée de la Presqu'île au delà du Gange, avec six planches lithographiques, et la notice des manuscrits palis de la Bibliothèque du Roi par E. Burnouf et Chr. Lassen. Paris, Dondey Dupré, 1826, 8°\n\n*151 Observations Grammaticales sur quelques passages de l'Essai sur le Pali de M. M. E. Burnouf et Lassen; par E. Burnouf. Paris, Dondey Dupré, 1827, 8°, 80 pag.\n\n*152 Méthode pour déchiffrer et transcrire les noms sanscrits qui se rencontrent dans les livres chinois .... inventée et démontrée par M. Stanislas Julien. Paris, Imp. imp., 1861, 8°\n\n153 A practical Grammar of the Sanskrit language for the use of early students by Theodore Benfrey. Berlin, Asher—London, Trübner, 1863, 8°\n\n6 Transgangetic Languages.\n\na Tibetan Language—Indo-Chinese Languages.\n\n*154 Alphabetum Tibetanum Missionum Apostolicarum commodo editum .... studio et labore Fr. Augustini Antonii Georgii eremitæ augustinianæ. Rome, 1762. Typis Sacrae Congregationis de Propag. Fide, 2 parts bd. in 1 vol. 4°\n\n*155 Alphabetum Tangutanum sive Tibetanum Romæ, 1773. Typis Sacrae Congregationis de Propag. Fide, 8°\n\n*156 Grammatik der Tibetischen Sprache, verfasst von I. J. Schmidt, 1889, St. Petersburg & Leipzig, 4°\n\nAt the end of the vol. p. 291 \"Remarks on the Siamese language by the Rev. Mr. Gutzlaff\" and Specimen of Oriental Alphabets.\n\n*157 Essay towards a Dictionary Tibetan and English—prepared with the assistance of Bandé Sangs-Rgyas Phun-Tshogs, a learned lama of Zangspa'ri, by Alexander Csoma de Körös, Siculo-Hungarian of Transylvania during a residence at Kanam, in the Himalaya Mountains, on the confines of India and Tibet 1827-1830. Calcutta, 1834, gr. 4°\n\nVide in the Journal of the R. As. Soc. vol. I, p. XIII \"A Biographical Sketch of M. Alexander Csoma Koros, the Hungarian Traveller.\n\n*158 Grammaire de la Langue Tibétaine par Ph. Ed. Foucaux. Paris, Imp. imp., 1858, 8°\n\n159 For a Vocabulary of the Cochinchinese Language Vide No. 204: du Ponceau.\n\n160 Dialogues en Langue Cochinchinoise à l'usage des Commencants et des Voyageurs par Abel Des Michels. Paris, Maisonneuve, 1869, 8°, 24 pag.\n\n161 Discours prononcé à l'ouverture du Cours de Cochinchinois à l'école annexe de la Sorbonne (Amphithéâtre Gerson) par Abel Des Michels. Paris, Maisonneuve, 1864, pp. 8°, 44 pag.\n*185 Grammatik der West-Mongolischen das 1st Oirad oder Kalmüksichen Sprache von H. A. Zwick. 4°, 1858.\n\n*186 Grammatik der Mongolischen Sprache; verfasst von I. J. Schmidt. St. Petersburg, 1891, 4°\n\n*187 M. Alexander Castrén's Grundzüge einer Tungusischen Sprachlehre nebst kurzen wörterverzeichniss .... herausgegeben von Anton Schiefner. St. Petersburg, 1856, 8°\n\n*188 M. Alexander Castrén's Versuch einer Koibalischen und Karagassischen Sprachlehre nebst wörterverzeichnissen aus den Tatarischen mundarten des Minussinschen kreises .... herausgegeben von Anton Schiefner. St. Petersburg, 1857, 8°\n\n*189 M. Alexander Castrén's Versuch einer Burjätsichen Sprachlehre nebst kurzem Wörterverzeichniss .... herausgegeben von Anton Schiefner. St. Petersburg, 1857, 8°\n\n*140 M. Alexander Castrén's Versuch einer Ostjakischen Sprachlehre nebst kurzem Wörterverzeichniss .... herausgegeben von Anton Schiefner. St. Petersburg, 1858, 8°\n\nb Turkish.\n\n*141 Grammaire Turke: précédée d'un Discours préliminaire sur la langue et la littérature des nations orientales; avec un Vocabulaire volumineux, des Dialogues, un Recueil d'Extraits en Prose et en Vers .... par Arthur Lumley Davids .... traduite de l'anglais par Madame Sarah Davids, mère de l'auteur. Londres, 1836, 4°\n\n*142 Vocabulaire Français-Turc par George Rhasis. St. Petersburg, 4°\n\n1ère partie 1828. 2e partie 1829.\n\n*143 Primi Principi della Grammatica Turca ad uso dei Missionari apostolici di Constantinopoli composti da Cosimo Comidas de Carbognano, Costantino-politano cavaliere aurato della S. Sede, et interprete del regio ministero di S. M. Cattolica in Constantinopoli. In Roma, 1794, 4°\n\n8 Semitic Languages (Syriac-Arab, &c.)\n\n*144 Chrestomathia Syriaca sive S. Ephraemi Carmina Selecta ediderunt notis criticis philologiciis historicis et glossario locupletissimo illustraverunt Augustus Hahn et Fried. Lud. Sieffert. Lipsiae, 1825, 8°\n\n145 Al-Mufassal, Opus de re grammatica arabicun, auctore Abu'l-Kasim Mahmûd Bin'Omar Zamahs'ario ad fidem codicum manu scriptorum editit J. P. Broch. Christianae, 1859, 8°\n\n146 An Essay on the Age and Antiquity of the Book of Nabathaean Agriculture to which is added an Inaugural Lecture on the Position of the Shemitic Nations in the History of Civilisation by M. Ernest Renan, London, Trübner, 1862, 12°\n\n4 Persian Languages.\n\n*147 A Vocabulary of the Persian Language in two parts—Persian and English and English and Persian by S. Rousseau. London, 1802, 8°\n\n*148 A Grammar of the Persian Language by William Jones, Esq., 6th ed. London, 1804, 4°\n\nEng. Ed. First Lond. 1771, 4°=Lond. 1775, 4°=7th Ed. Lond. 1809, 4°=8th Ed. Lond. 1823, 4°=9th Ed. Lond. 1828.\n\nFrench translation, London, Cadell, 1772.\nSir William Jones was born in London, on the 28th Sept. 1746. Being called to the Bar in 1774, he was appointed a Judge in the Supreme Court of Judicature at Fort William in Bengal in the year 1783. His death took place at Calcutta on the 27th April 1794.\n\nThe complete works of Sir W. J. were published in 6 vols. 4° (1799) with a supp. of 2 vols. 4° (1801) containing his contrib. to the Asiatic Researches. His Poetical works were published with his Life in 2 vols. 12°, London, 1807.\n\n\"Memoirs of the Life, Writings and Correspondence of Sir William Jones,\" were written by Lord Teignmouth, Lond. 1804, 4°\n\n149 A Dictionary Persian, Arabic and English; with a dissertation of the Languages, Literature and Manners of Eastern Nations by John Richardson, Esq., F.S.A. .... a new edition .... by Charles Wilkins. London, 1806-1810, 2 vols. 4°\n\n5 Indian Languages (Pali-Sanskrit.)\n\n*150 Essai sur le Pali, ou Langue sacrée de la Presqu'île au delà du Gange, avec six planches lithographiées, et la notice des manuscrits palis de la Bibliothèque du Roi par E. Burnouf et Chr. Lassen. Paris, Dondey Dupré, 1826, 8°\n\n*151 Observations Grammaticales sur quelques passages de l'Essai sur le Pali de M. M. E. Burnouf et Lassen; par E. Burnouf. Paris, Dondey Dupré, 1827, 8°, 30 pag.\n\n*152 Méthode pour déchiffrer et transcrire les noms sanscrits qui se rencontrent dans les livres chinois .... inventee et demontree par M. Stanislas Julien. Paris, Imp. imp., 1861, 8°\n\n153 A practical Grammar of the Sanskrit language for the use of early students by Theodore Benfrey. Berlin, Asher—London, Trübner, 1863, 8°\n\n6 Transgangetic Languages.\n\na Tibetan Language—Indo-Chinese Languages.\n\n*154 Alphabetum Tibetanum Missionum Apostolicarum commodo editum .... studio et labore Fr. Augustini Antonii Georgii eremitæ augustinianæ. Romæ, 1762. Typis Sacre Congregationis de Propag. Fide, 2 parts bd. in 1 vol. 4°\n\n*155 Alphabetum Tangutanum sive Tibetanum Romæ, 1773. Typis Sacre Congregationis de Propag. Fide, 8°\n\n*156 Grammatik der Tibetischen Sprache, verfasst von I. J. Schmidt, 1889, St. Petersburg & Leipzig, 4°\n\nAt the end of the vol. p. 291 \"Remarks on the Siamese language by the Rev. Mr. Gutzlaff\" and Specimen of Oriental Alphabets.\n\n*157 Essay towards a Dictionary Tibetan and English—prepared with the assistance of Bandi Songs-Rgyas Phun—Tshogs, a learned lama of Zangsha'r, by Alexander Csoma de Koros, Siculo-Hungarian of Transylvania during a residence at Kanam, in the Himalaya Mountains, on the confines of India and Tibet 1827-1830. Calcutta, 1884, gr. 4°\n\nVide in the Journal of the R. As. Soc. vol. I, p. XIII \"A Biographical Sketch of M. Alexander Csoma Koros, the Hungarian Traveller.\n\n*158 Grammaire de la Langue Tibétaine par Ph. Ed. Foucaux. Paris, Imp. imp., 1858, 8°\n\n159 For a Vocabulary of the Cochinchinese Language Vide No. 204 : du Ponceau.\n\n160 Dialogues en Langue Cochinchinoise à l'usage des Commencants et des Voyageurs par Abel Des Michels. Paris, Maisonneuve, 1869, 8°, 24 pag.\n\n161 Discours prononcé à l'ouverture du Cours de Cochinchinois à l'école annexe de la Sorbonne (Amphithéâtre Gerson) par Abel Des Michels. Paris, Maisonneuve, 1864, ppt. 8°, 44 pag.\nChinese Language.\n\nLexicography.\n\n* Dictionaries, &c.\n\nOn Chinese Lexicography Vide in the Chinese Rep. XVII p. 432 an Article \"Chinese Lexicography, or a List of the Dictionaries in the Imperial Library at Peking according to the General Catalogue called the Sz' Fu Ts' iuen Shu.\"—218 Dictionaries are mentioned.\n\n*102 An Explanation of the Elementary Characters of the Chinese with an Analysis of their Ancient Symbols and Hieroglyphics by Joseph Hager, D.D. London, Richard Phillips, 1801, fol.\n\n*163 Dictionnaire Chinois, Francais et Latin publie d'apres l'ordre de sa Majeste l'Empereur et Roi Napoleon le Grand; par M. de Guignes .... à Paris, de l'Imp. imp., 1818 in fol.\n\n*164 Supplement au Dictionnaire Chinois du P. Basile de Glemona (imprime en 1813, par les soins de M. de Guignes), publie d'apres l'ordre de sa Majeste le Roi de Prusse Frederic-Guillaume III par Jules Klaproth. Paris, Imp. roy., 1819, fol.\n\nAu commencement du Dictionnaire il y a un \"Examen critique de l'édition du Dictionnaire chinois publie par M. de Guignes.\"\n\n*165 Sylloge minutiarum lexici latino-sinico characteristici, observatione sedula ex Anctoribus & lexicis Chinesium characteristicis eruta, inque Specimen primi laboris ulterius exantandi erudito et curioso orbi exposita a Christiano Mentzelio .... Norimbergae, 1685, 4°\n\n*166 A Dictionary of the Chinese Language, in three Parts:\n\nPart the First; containing Chinese and English, arranged according to the Radicals.\n\nPart the Second; Chinese and English alphabetically, and\n\nPart the Third; English and Chinese by the Rev. Robert Morrison.\n\nVol. I—Part I Macao, 1815, gr. 4°\nI 1819\nII Lond. & Macao, 1822, gr. 4°\nII Macao, 1820\nIII Lond. & Macao, 1822; bd. in 1 vol.\nIII I 1823.\n\n*167 Urh-Chih-Tszee-Tseen-Se-Yin-Pe-Kedou: being a Parallel drawn between the two intended Chinese Dictionaries; by the Rev. Robert Morrison, and Antonio Montucci, L.L.D. Together with Morrison's Horae Sinicae, a new edition with the text to the Popular Chinese Primer San-Tsi-King. London, 1817, 4°\n\nL'éditeur est Mr. Montucci lui-même. La premiere édition des Horae Sinicae, reimpr. dans le livre ci-dessus a paru à Londres, en 1812, 8° Zenker, Bib. Orientalis II p. 508.\n\n*168 A Dictionary of the Hok-keen Dialect of the Chinese language, according to the Reading and Colloquial Idioms .... accompanied by a short historical and statistical account of Hok-keen .... by W. H. Medhurst, Batavia. Macao, 1832, imp. 4°\n\n*169 Dicionario Portuguez-China no estilo vulgar mandarim e classico geral composto por J. A. Gonçalves. Macao, 1831, sm. 4°\n\nJouchim Alphonse Gonçalves was born in 1780 in the Province of Traz-dos-montes, at Tojal. He embarked for China in 1812. His death took place at Macao in Sept. 1844. Vide in Chinese Rep. XV p. 69 et seq.: \"Notice biographique sur le Père J. A. Gonçalves comprising an account of his life with notices of his various sinological productions by J. M. Callery.\"\n*170 Diccionario China-Portuguez composto por J. A. Gonçalves. Macao, 1838, sm. 4°\n\n*171 Lui Ho, sive Vocabularium Sinense in Kóraianum conversum, Opus Sinicum origine in Peninsula Kórai impressum in lapide exaratum a Sinensi Ko Tsching Dschang et redditum curante Ph. Fr. de Siebold (annexa Appendix Vocabulorum Kóraianorum Japonicorum et Sinensium comparativa) Lug. Bat., 1838, folio.\n\n*172 Lexicon Manuale Latino-Sinicum, & Sinico-Latinum—Lexicon Manuale Latino Sinicum continens omnia vocabula latina .... auctore Joachimo Alphonso Gonsalves, Presbytero, Vol. primum, Macai, 1839, 8°\n\n*173 Lexicon Magnum Latino-Sinicum ostendens Etymologiam, Prosodiam, et Constructionem vocabulorum auctore J. A. Gonsalves, Presbytero, Macai, 1841, imp. 4°\n\n*174 Systema Phoneticum Scripturae Sinicæ auctore J. M. Callery, Missionario Apostolico in Sinis. Macao, 1841, Partes prima et secunda, bd. in 1 vol. 8°\n\nCallery's \"Systema Phoneticum\" has been reviewed by G. T. Lay in the Chinese Rep. XII, p. 253.\n\n*175 Dictionnaire des Noms anciens et modernes des Villes et Arrondissements de premier, deuxième et troisième ordre compris dans l'Empire Chinois .... par Edouard Biot. Paris, Imp. roy., 1842, 8°\n\n\"The Map which is to be found at the end of this work was made by Klaproth.\"\n\n176 An English and Chinese Vocabulary in the Court Dialect by S. Wells Williams. Macao, 1844, 8°\n\n*177 Dictionarium Sinico-Latinum auctore M. de Guignas—Meliori ordine digestum .... labore, curâ, ac diligentia Fris Hieronymi Mangieri a S. Arsenio ord. M. M. S. Francisci Reformatorum, ac Missionarii Apost. in Sinis. Hongkong, 1858, 4°\n\n*178 A Tonic Dictionary of the Chinese Language in the Canton Dialect by S. Wells Williams. Canton, 1856, 8°\n\n179 A Medical Vocabulary in English and Chinese by Benj. Hobson, M.B. Lond. Shanghai Mission Press, 1858, 8°, 74 pag.\n\n*180 An English and Cantonese Pocket Dictionary .... by John Chalmers, M.A. Hongkong, 1859, 18°\n\n181 A Vocabulary of Proper Names, in Chinese and English, of Places, Persons, Tribes, and Sects, in China, Japan, Corea, Annam, Siam, Burmah, the Straits and adjacent Countries compiled by F. Porter Smith. Shanghai, 1870, 8°\n\n** Handbooks of Conversation, &c.\n\n*182 The English and Chinese Student's Assistant, or Colloquial Phrases, Letters, &c., in English and Chinese: the Chinese by Shaou Tih, a native chinese student, in the Anglo-Chinese College, Malacca. Mission Press, 1826, [Malacca], 8°, 102 pag.\n\nThis little Book contains sentences and conversations on a great variety of subjects, designed for the use of the Students at Malacca; its Author was government interpreter for several years at Peking in the intercourse with the Russians. Chinese Rep. XVIII-407.\n\n*183 Chinese Dialogues—Questions and Familiar Sentences, literally rendered into English, with a View to promote commercial intercourse and to assist beginners in the Language by W. H. Medhurst, Sen. Shanghai Mission Press, 1844, 8°\n*184 Manuel pratique de la Langue Chinoise vulgaire .... par Louis Rochet. Paris, Marcellin Legrand, 1846, 8°\n\n*185 A Guide to Conversation in the English and Chinese Languages for the use of Americans and Chinese in California and elsewhere by Stanislas Hernisz, M.D. Boston, 1854, 8°\n\n*186 A Catalogue of Phrases in the Shanghai Dialect systematically arranged by Rev. John Macgowan .... Shanghai Presb. Mission Press, 1862, 8°, 193 p.\n\n*187 Ji-Tch'ang-K'eou-T'eu-Hoa—Dialogues Chinois à l'usage de l'Ecole spéciale des Langues orientales vivantes publiés avec une traduction et un vocabulaire chinois-français de tous les mots par M. Stanislas Julien. Paris, B. Duport, 1863, 8°, 80 pag.\n\n*188 Chinese Dialogues, Questions and Familiar Sentences, literally rendered into English, with a View to promote commercial intercourse, and to assist beginners in the Language by the late Rev. Dr. Medhurst, revised by his Son. Shanghai, London Mission Press, 1863, 8°, 225 pag.\n\n*189 The Tourists' Guide and Merchant's Manual being an English-Chinese Vocabulary of Articles of Commerce and of domestic use; also all the known Names connected with the Sciences or Natural History, Chemistry, Pharmacy, &c., &c., Hongkong, Daily Press, 1864.\n\n*190 Select Phrases and reading lessons in the Canton Dialect, prepared for the press by the Rev. W. Lobscheid. Hongkong, 1864, 8°, 69 pag.\n\n*191 Easy Phrases in the Canton Dialect of the Chinese Language. Printed at the Canton Customs' Press, 1866, 4°, 75 pag.\n\nb Grammars, &c.\n\n*192 An Historical Essay endeavoring a Probability that the Language of the Empire of China is the Primitive Language by John Webb of Burleigh in the County of Somerset, Esquire. London, N. Brook, 1669, sm. 8°\n\n*193 Theophili Sigefridi Bayeri Regionontani Academici Petropolitani....Museum Sinicum in quo Sinicæ Linguae et Litteraturæ ratio explicatur. 2 vols., 8°, Petropoli, 1730.\n\n*194 Linguae Sinarum Mandarincæ Hieroglyphice Grammatica Duplex, Latinè, & cum characteribus Sinensium. Item Sinicorum Regie Bibliothecæ Librorum Catalogus, deniò, cum Notitiis amplioribus et charactere Sinico, Editus jussu Ludovici Decimi-Quinti—Author Stephanus Fourmont. Lutetiae Parisiorum, 1742, folio bound with.\n\n*195 Meditationes Sinicæ complectentes artem legendi linguae Sinicæ characteres author Stephanus Fourmont. Lut. Paris, 1787, folio.\n\nEtienne Fourmont was born in 1683 at Herbelay, near Saint-Denis and died in Paris the 18th December 1745. Vide Rémusat Nouveaux Mélanges Asiatiques, Tome II, p. 291-304.\n\n*196 Lettre de Pékin, sur le Génie de la langue chinoise, et la nature de leur écriture symbolique, comparée avec celle des anciens Egyptiens; en réponse à celle de la Société Royale des Sciences de Londres, sur le même sujet; on y a joint l'extrait de deux ouvrages nouveaux de Mr. de Guignes, de l'Académie des Inscriptions et Belles Lettres de Paris, relatifs aux même nations. Par un Père de la Compagnie de Jésus, missionnaire à Pékin (le P. Cibot) A Bruxelles, J. L. de Bouber, 1778, 4°\n\n*197 Dissertation on the Characters and Sounds of the Chinese Language: including Tables of the Elementary Characters, and of the Chinese Monosyllables. Serampore, November, 1809, 4°, (by Joshua Marshman.)\n*198 Clavis Sinica, or Elements of Chinese Grammar, with a Preliminary Dissertation on the Characters, and the Colloquial Medium of the Chinese and an Appendix containing the Tahyoh of Confucius with a Translation by J. Marshman, D.D. Serampore, 1814, 8°\n\n*199 A Grammar of the Chinese Language by the Rev. Rob. Morrison. Serampore, 1816, 4°\n\nThis Treatise was composed soon after the Author commenced his studies, and is arranged on the principles of English Grammar, which are inapplicable to the Chinese. It is of little practical use. Ch. Rep. XVIII-403.\n\n*200 Elémens de la Grammaire Chinoise, ou Principes généraux du Kou-Wen ou Style antique, et du Kouan-Hoa, c'est-à-dire de la Langue commune généralement usitée dans l'empire Chinois par M. Abel Rémusat. Paris, Imp. royale, 1822, 8°\n\nJean-Pierre-Abel Rémusat was born in Paris in 1788 and died of the cholera in 1832.\n\nThis Work deservedly bears a high reputation, and is a valuable aid in the acquisition of Chinese; much of the materials were taken from Premare's Notitia, which at that time existed only in manuscript. The Preface contains critical Notices of all the preceding works. Ch. Rep. XVIII-403.\n\n201 Lettre à M. Abel Rémusat sur la nature des formes grammaticales en général, et sur le génie de la langue chinoise en particulier par M. G. de Humboldt. Paris, Dondey Dupré, 1827, 8°\n\n*202 Arte China constante de Alphabete e Grammatica compreendendo modelos das diferentes composições, composta por J. A. Gonçalves. Macao, 1829, sm. 4°\n\n*203 Notitia Linguae Sinicæ auctore P. Premare. Malaccæ cura Acad. Anglo-Sinensis, 1831, 4°, (2 copies.)\n\nIt has been translated into English by E. C. Bridgman, Canton, 1847, 8°\n\nJoseph Henry Premare, S. J., left La Rochelle to come to China, 7th March 1698. He died in China in 1784 or 1785.\n\nVide Rémusat's Nouveaux Mélanges Asiatiques, Vol. II, p. 262 et seq.\n\nAn Account of Notitia Lingua Sinicae by Premare extracted from the Report of the Anglo-Chinese College (Malacca) for 1831, is to be found in the Chinese Rep., I. p. 152 et seq.\n\nThere is to be found in the Ch. Rep. \"A Biographical Notice of Père Joseph Premare translated from Rémusat's Nouv. Mel. As. by S. R.\" X-668.\n\n*204 A Dissertation on the Nature and Character of the Chinese system of writing in a letter to John Vaughan, Esq., by Peter S. Du Ponceau, L.L.D., President of the American Philosophical Society .... to which are subjoined a Vocabulary of the Cochinchinese language by Father Joseph Morrone .... with references to plates .... and with notes .... by M. De la Palun late Consul of France at Richmond in Virginia; and a Cochinchinese and Latin Dictionary in use among the R. C. Missions in Cochinchina. Philadelphia, 1888, 8°\n\nOn du Ponceau's System of Chinese Writing, Vide Ch. Rep., VII-337 et seq.\n\n*205 Exercices pratiques d'analyse, de syntaxe et de lexicographie Chinoise .... par Stanislas Julien. Paris, B. Duprat, 1842, 8°, xxiv-270 pag.\n\n*206 Aufangsgründe der Chinesischen Grammatik von Stephan Endlicher, Wien, 1845, 8°\n\n*207 Mémoire sur les principes généraux du Chinois vulgaire par M. Bazin .... Extrait du Journal Asiatique. Paris, Imp. roy., 1845, 8°, 120 pag.\n\n*208 Elementa Grammaticæ Latino-Sinicæ ad usum alumnorum Sinensium in quatuor partes distributa cum Appendice de Epistolis. Victoriae Hongkong, Typis Collegii Romano-Catholici, 1858, sm. 8°\n*209 Chinesische Sprachlehre zum gebranche bei vorlesungen und zur selbstanter weisung von Wilhelm Schott. Berlin, Ferd. Dümler, 1857, 4°\n\n*210 A Grammar of the Chinese Colloquial Language commonly called the Mandarin Dialect by Joseph Edkins—Second edition. Shanghai, Presb. Mission Press, 1868, 8°\n\n(The 1st edition was published in 1857, 8°)\n\n*211 Grammar of the Chinese Language by the Rev. W. Lobscheid in two parts (bd. in 1 vol.) Office of the Daily Press, Hongkong, 1864, 8°\n\n*212 Chinese-English Grammar by the Rev. William Lobscheid. Part I, Hongkong, 1864, 8°, 45 pag.\n\n*213 Chinese-English Grammar by the Rev. William Lobscheid: Part II, Hongkong, 1864, 8°, 80 pag.\n\n214 Grammaire Française copiée presque entièrement sur celle de Noël et Chapsal avec la traduction Chinoise par un Missionnaire Lazariste de Pékin—Première partie: Grammaire. Pékin, Imp. des Lazaristes, 1864, 8°\n\n215 Syntaxe nouvelle de la Langue Chinoise fondée sur la position des mots suivie de deux traités sur les particules et les principaux termes de grammaire, d'une table des idiotismes, de fables, de légendes et d'apologues traduits mot à mot par M. Stanislas Julien. Paris, Maisonneuve, Vol. I, 1869, 8°\n\nc Chrestomathies—Hand-Books, &c.\n\n*216 Han-Wen-Kien-Yao. Essai sur la langue et la littérature chinoises, avec cinq planches contenant des textes chinois, accompagnés de traductions, de remarques, et d'un commentaire littéraire et grammatical, suivi de notes et d'une table alphabétique des mots chinois, par J. P. Abel Rémusat. Paris, Treuttel & Würtz, 1811, 8°\n\n*217 A View of China for Philological Purposes; containing a Sketch of Chinese Chronology, Geography, Government, Religion and Customs designed for the use of persons who study the Chinese Language by the Rev. R. Morrison. Macao, 1817, 4°\n\n*218 Logice Institutiones quae in collegio urbano de propaganda fide traduntur nec non Documenta rationis editum in gratiam alumnorum collegii generalis Missionum gallicarum ad exterar gentes a J. L. Taberd episcope Isauropolitano edita. Hongkong, 1849, 8°, p. 187-iii.\n\n*219 A Manual of Chinese Running-hand Writing especially as it is used in Japan compiled from original sources by R. J. de St. Aulaire and W. P. Groeneveldt. Amsterdam, G. M. van Gelder, 1861, 4°\n\n*220 The Analytical Reader—A short Method for learning to read and write Chinese by the Rev. W. A. P. Martin, D.D. Shanghai, Presb. Mis. Press, 1868, 8°\n\n*221 Graduated Reading comprising a circle of knowledge in 200 lessons. Gradation I, Second Ed. improved. Hongkong, Lond. Miss. Society's Press, 1864, 12°\n\n*222 Tones of the Mandarin Dialect are given in English and Chinese by Sau-Mang-Yian. Canton, 1865, 8°\n\n*223 The Household Companion and Student's first Assistant by Dr. Devan with many additions, corrections, and Dr. Williams' orthography by the Rev. W. Lobscheid. Hongkong, 1867, 8°, 140 pag.\n\nc Japanese Language.\n\n*224 Wörterbuch der Japanischen Sprache von August Pfizmaier. Wien, 1851, 4°\n*225 Introduction à l'étude de la langue Japonaise par L. Léon de Rosny. Paris, Maisonneuve et Cie., 1856, 4°, 96 pag.\n\n*226 Proeve eener Japanische Spraakkunst van Mr. J. H. Donker Curtius .... toegelicht, verbeterd en met uitgebreide bijvoegselen vermeerderd door Dr. J. Hoffmann. Leyden, 1857, 8°\n\n227 Essai de Grammaire Japonaise composé par M. J. H. Donker Curtius, commissaire néerlandais au Japon, enrichi d'éclaircissements et d'additions nombreuses par M. le Dr. Hoffmann, professeur de Japonais et de Chinois, interprète du gouvernement des Indes néerlandaises (publié en 1857, à Leyde) traduit du Hollandais avec de nouvelles notes extraites des Grammaires des P. P. Rodriguez et Collado par Léon Pagès. Paris, Benjamin Duprat, 1861, 8°\n\n*228 Elements of Japanese Grammar, for the use of beginners, by Rutherford Alcock, Esq., H. B. M.'s Envoy Extraordinary and Minister Plenipotentiary in Japan. Shanghai 1861, 8°\n\n*229 Shopping Dialogues in Dutch, English and Japanese published by J. Hoffmann 1861. London and the Hague, obl. 8°, 44 pag., (2 copies.)\n\n*230 A New Familiar Phrases of the English and Japanese Languages general use for the Merchant of both countries, first parts, Nagasaki sixth year of Annoy, December 1859, obl. 8°\n\n231 Familiar Dialogues in Japanese with English and French Translations for the use of students (by Rutherford Alcock.) Paris, B. Duprat—London, Trübner, 1863, 8°, pag. viii-40.\n\nD—Miscellaneous Languages.\n\nAfrica-Oceania-America.\n\n*232 Athanasii Kircheri Fuldensis Buchonii e Soc. Jesu. Prodromus Coptus sive Egyptiacus, in quo, cum lingua coptae sive aegyptiacae quondam Pharaonicæ origo, etas, vicissitudine, inclinatione, tum hieroglyphice literaturæ instauratio .... exhibentur. Roma, Typis S. Cong. Prop. Fide, 1636, 4°\n\n*233 Maleischen Nedertuitsch Woordenboek onder goedkeuringen Begunstiging der hooge regering van Nederlandsch Indie vervaardigd en uitgegeven door P. P. Roorda van Lysinga. Batavia, 1825, 8°\n\nSee in the Journal R. As. Soc. Vol. I. N. S. p. 181, a Paper \"on the Existing Dictionaries of the Malay Language by Dr. H. N. van der Tuuk.\"\n\n*234 A Grammar of the Kafir Language, by W. B. Boyce, wesleyan missionary, Graham's Town, 1834, 4°\n\n235 Collecção de Vocabulos e Frases usados na Provincia de S. Pedro do Rio Grande do Sul no Brazil. Londres, Trübner, 1856, pp. p. 82, 82°\n\n236 A Comparative Grammar of South African Languages by W. H. I. Bleek Ph. D.—Part I, Phenology, London, Trübner, 1862, 8°\n\n237 First Lessons in the Maori Language with a short Vocabulary by W. L. Williams, B.A. London, Trübner, 1862, p. 73, 12°\n\n*238 Éléments de la Grammaire Othomi traduits de l'Espagnol accompagnés d'une notice d'Adelung sur cette Langue traduite de l'Allemand et suivis d'un Vocabulaire comparé Othomi-Chinois. Paris, Maisonneuve, 1863, 8°, p. 39.\n\n\"Les Othomi ou Odomi, dont le nom vient de leur demi-dieu Oton ou Odon sont, comme on le sait, les Indiens Mexicains du nord-ouest de la vallée de l'Anahuac et d'une partie des provinces du Michoacan, au delà de Queretaro. Quelques groupes d'entre eux occupent également les environs de la ville de Mexico. Otompan (aujourd'hui Otumba) était leur capitale.\" Extrait de l'Avancement.\nII. Composition.\n\nA—Fables, Tales, and Novels.\n\n*239 Anglais et Chinois par Méry. Paris, Michel Lévy Frères, 1858, sm. in 12.\n\n*240 Le Fils du Ciel, Roman-Chinois par Pierre Zaccone. Paris, Hte Boisgard, 1857, 12°\n\n*241 The Marvellous Adventures and Rare Conceits of Master Tyll Ovilglass newly collected, chronicled and set-forth in our English Tongue by Kenneth R. H. Mackenzie .... and adorned .... by Alfred Crowquill. 2nd ed. London, Trübner, 1860, 8°\n\n242 Reynard the Fox in South Africa; or Hottentot Fables and Tales chiefly translated from original Manuscripts in the Library of His Excellency Sir George Grey, K.C.B., by W. H. I. Bleek, Ph. D. London, Trübner, 1864, 8°\n\n*243 Contes Chinois précédés d'une histoire pittoresque de la Chine par Charles Richomme. Paris, Vve Louis Jannet, 8°\n\n*244 Hau Kiou Choan or the Pleasing History, a Translation from the Chinese Language to which are added,\n\nI The Argument or Story of a Chinese Play,\nII A Collection of Chinese Proverbs, and\nIII Fragments of Chinese Poetry in 4 vols. 8°\n\nLondon, Dodsley, 1761.\n\n\"The Author of this Translation is not certainly known. The Manuscript was found among the papers of a Gentleman named Wilkinson, who occasionally resided much at Canton, and was a Student of Chinese. The date of the papers, 1719, was the last year he spent in China; and he died in 1736. The three first volumes were in English and the fourth in Portuguese. Dr. Percy, Bishop of Dromore, translated the last volume into English, and edited the work.\" Wyte's Notes on Chinese Literature, p. xxiii.\n\n*245 Fun-Hy-Cheu: a Tale in Chinese and English with Notes and a short Grammar of the Chinese Language by Stephen Weston. London, 1814, 8°\n\n*246 San-Yu-Low: or the Three dedicated Rooms, a Tale translated from the Chinese by J. F. Davis. Canton, 1815, 8°, p. 56. Bound with Translations from the original Chinese with Notes by Mr. Morrison. Canton, 1815, 8°, p. 42.\n\n*247 Chinese Novels, translated from the Original; to which are added Proverbs and Moral Maxims, collected from their classical Books and other sources. The whole prefaced by observations on the Language and Literature of China by Sir John Francis Davis. London, John Murray, 1822, 8°\n\n248 The Fortunate Union, a Romance, translated from the Chinese original with Notes and Illustrations to which is added, a Chinese Tragedy by John Francis Davis, in 2 vols. 8°. London Oriental Trans. Fund, 1829. (1st vol. missing.)\n\n*249 Blanche et Bleue, ou les deux Couleuvres—Fées, Roman Chinois, traduit par Stanislas Julien. Paris, Charles Gosselin, 1894, 8°\n\n*250 The Porcelain Tower, or Nine Stones of China compiled from original sources by \"T. T. T.\" London, Richard Bentley, 1841, 12°\n\n251 The Rambles of the Emperor Ching Tih in Keangman—a Chinese Tale translated by Tkin Shen, Student of the Anglo-Chinese College, Malacca, with a preface by James Legge, D.D., President of the College—2 vols. 12°. London, Longmans, 1848.\n\n*252 Idem. London, 1846, 2 vols. 12°\n*253 San-Koué-Teky-Ilan Kouroun-ipithé. Histoire des Trois Royaumes Roman historique traduit sur les textes chinois et mandchou de la bibliothèque royale par Théodore Pavié. Paris, B. Duprat, 1845-51, 2 vols. 8°\n\n254 Wang-keau Lwan Pié Néen Chang Hen oder die blutige Rache einer jungen Frau. Chinesische Erzählung. Nach der in Canton 1839 erschienenen Ausgabe von Sloth übersetzt von Adolf Böttger. Leipzig, 1846, 8°\n\n255 Sechs Wandschirme Gestalten der vergänglichen Welt, Ein Japanischer Roman im originaltexte samt den Facsimiles von 57 Japanischen Holzschnitten übersetzt und herausgegeben von Dr. August Pfizmaier. Wien, 1847, 8°\n\n*256 Ping-Chan-Lin-Yen. Les deux jeunes filles lettrées, roman chinois traduit par Stanislas Julien. Paris, Didier & Cie., 1860, 2 vols. 12°, bd. in 1 vol.\n\n*257 Les Avadanas, Contes et apologues indiens inconnus jusqu'à ce jour suivis de Fables, de Poésies et de Nouvelles chinoises traduits par M. Stanislas Julien. Paris, B. Duprat, 1859, 3 vols. 16°, bd. in 1.\n\nB—Poetry.\n\n258 Edda Saemundar Hinns Fróda—The Edda of Saemund the Learned from the old Norse or Icelandic with a Mythological Index. Part I. London, Trübner, 1866, 16°\n\n259 The Shah Namu, being a series of heroic poems, on the ancient History of Persia . . . by the celebrated Abool Kausim J. Firdoosee. Vol. I, sm. folio. Calcutta, 1811.\n\n*260 The Sánkhyá Káríka, or Memorial Verses on the Sánkhyá Philosophy by Iswara Krishna; translated from the Sanscrit by Henry Thomas Colebrooke, Esq., also the Báshya or Commentary of Gaurapáda; translated, and illustrated by an original comment by Henry Hayman Wilson. Oxford, Or. Trans. Fund, 1887, 4°\n\nVide in the Journal of the Royal Asiatic Society, Vol. V, p. 1-60—\"Notices of the Life of Henry Thomas Colebrooke, Esq., by his Son\"—H. T. Colebrooke was born in London on the 15th of June 1765. He was the youngest of the seven children of Sir George Colebrooke, Bart., for many years Chairman of the E. I. Company. He arrived in India in April 1783, and died the 10th of March 1837. A List of the Work of H. T. C. is to be found at the end of the notice.\n\n*261 Eloge de la ville de Moukden et de ses environs; poème composé par Kien-Long, Empereur de la Chine et de la Tartarie, actuellement régnant . . . traduit en Français par le P. Amiot, Missionnaire à Péking, et publiée par M. Degnignes. Paris, N. M. Tilhard, 1770, 8°\n\nJoseph de Guignes was born at Pontoise on the 19th of October 1721 and died in Paris on the 19th of March 1800. His History of the Huns has been translated into German by Daenhert.\n\n*262 The Conquest of the Miao-tse—An Imperial poem by Kien-Lung, entitled a Choral-song of Harmony for the First Part of the Spring by Stephen Weston, F.R.S., S.A., from the Chinese. London, C. & R. Baldwin, 1810, 8°\n\n*263 Chinese Courtship, in verse, to which is added an Appendix treating of the Revenue of China, &c., &c., by Peter Perring Thoms. London & Macao, 1824, sm. 4°\n\n*264 Confucii Chi-King sive Liber Carminum ex latina P. Lecharme interpretatione edidit Julius Mohl. Stuttgartiae et Tubinge, 1880, 8°\n\n*265 Poésies de l'époque des Thang (VIIe., VIIIe. et IXe. siècles de notre ère) traduites du Chinois pour la première fois avec une étude sur l'art poétique en Chine et des notes explicatives par le Marquis d'Hervey-Saint-Denys. Paris, Amyot, 1862, 8°\n266 Beitrag zur Kenntniss ältesten japanischen Poesie von Dr. August Pfizmaier. Wien, 1852, ppt.\n\nC—Theatre.\n\n*267 Hoei-lan-ki, ou l'histoire du Cercle de Craie, drame en prose et en vers, traduit du chinois et accompagné de notes, par Stanislas Julien. London, Oriental Trans. Fund, 1882, 8°\n\n*268 Tchao-chi-kou-eul, ou l'Orphelin de la Chine, drame en prose et en vers, accompagné des pièces historiques qui en ont fourni le sujet, de nouvelles et de poésies chinoises, traduit du chinois par Stanislas Julien. Paris, Moutardier, 1884, 8°\n\n269 Select Specimens of the Theatre of the Hindus translated from the original Sanskrit by Horace Hayman Wilson—2 vols. 8°, 2nd ed. London, Parbury Allen & Co., 1885.\n\nFirst edition, Calcutta, Holcroft, 3 vols. 8°. Translated into French by A. Langlois, Paris, Dondey Dupré, 1828, 2 vols. 8°\n\n*270 Théâtre chinois ou Choix de pièces de théâtre composées sous les Empereurs Mongols traduites pour la première fois sur le texte original, précédées d'une introduction et accompagnées de notes par M. Bazin ainé. Paris, Imp. roy., 1888, 8°\n\n*271 Le pi Pa-ki ou l'Histoire du Luth-drame chinois de Kao-Tong-kia représenté à Péking, en 1404, avec les changements de Mao-Tseu traduit sur le texte original par M. Bazin Ainé. Paris, Imp. roy., 1841, 8°\n\n272 Pharaoh's Daughter an \"[anthropological]\" Drama, on the Plan of the Mystery and Parable Play, développé from Herodotus's Narrative of the spoliation of the Treasury of Rhampsinitus, the Monuments of Thothmes III, the Song of Songs,\" &c. London, Williams & Norgate, 1868, sm. 8°\n\nHISTORY.\n\nI. GEOGRAPHY.\n\n*278 Précis de la Géographie universelle, ou description de toutes les parties du monde, sur un plan nouveau, d'après les grandes divisions naturelles du globe .... par Malte Brun. Bruxelles, 8 vols. 8°, 1829.\n\n274 What the Chinese know of Geography by C. A. Skatschkoff. ppt. 8° (in Russian.)\n\nFor the Maps Vide the Appendix.\n\nII. TRAVELS.\n\nVide \"Catalogue of Books of Voyage and Travels\" Pinkerton's Travels, Supp. p. 1-255.\n\nA—Introduction, Collections, Travels round the World.\n\n275 Voyages de Mr. de Thevenot tant en Europe qu'en Asie et en Afrique divisez en trois Parties qui comprennent cinq volumes, 8 vols. 12°\n\nPremière Partie qui comprend le Voiage de Levant....A Paris, chez Charles Angot....1689.\n\nCette partie est composée de deux livres et d'une table des matières qui forment un volume.\nSeconde Partie—Suite du Voyage de Mr. de Thevenot au Levant. Paris, Charles Angot, 1689.\n\nCes deux parties forment deux tomes qui peuvent être reliés en quatre tomes.\n\nTroisième Partie—Les Voyages de Mr. de Thevenot aux Indes orientales. Paris, Charles Angot, 1689.\n\nCette partie, composée de deux livres et d'une table, forme un seul volume.\n\n*276 Recueil de Voyages au Nord contenant divers Mémoires très utiles au Commerce et à la Navigation, Amsterdam, Jean Frédéric Bernard, 8 vols. 12°, var. dates.\n\nTome Premier, Nouvelle ed. 1731. Epître à l'Empereur des deux Russies—Discours préliminaire—Dissertation contenant des instructions pour voyager utilement—Relation de l'Islande et du Groenland par la Peyre, auteur des Pracadamites—Les trois navigations de Martin Proebisher, pour chercher un passage à la Chine et au Japon par la mer Glaciale en 1576, 1577 et 1578, traduites de l'Anglais.\n\nTome Second, Nouv. ed. 1732. Journal d'un Voyage au Spitzbergien et au Groenland contenant une Relation exacte de tout ce qu'on a remarqué dans ce Voyage depuis le 15 Avril jusqu'au 31 Août 1674 par Frederic Martens de Hambourg, trad. de l'Allemand. Addition qui concerne la Pêche de la Baleine. Disc. prél. sur le passage par le Nord-Est de l'Europe où le Capitaine Wood tâchait de prouver la possibilité de ce passage avant que d'en avoir entrepris la découverte. Journal du Capitaine Jean Wood, commandant le Speedwell, allant à la découverte d'un passage pour les Indes orientales par le Nord-Est, en tenant route vers la Nouvelle Zemble et la Tartarie. Journal à bord du Prospero, commandé par le Capitaine Guillaume Flaves, depuis la Nouvelle Zemble jusqu'en Angleterre. Supp. aux voyages du Cap. Wood et de Fred. Martens vers le Nord-Est.\n\nTome Troisième, Nouv. ed. 1732. Préface de Jean Huyghens de Linschotten. Voyage de Jean Huyghens au Nord par le détroit de Nassau et jusqu'à l'embouchure du Fleuve Obi en 1594. Second voyage au détroit de Nassau, ou passage de Waigats. Relation du Détroit et de la Baye de Hudson, à Monsieur ** par Monsieur Jérémie. Relat. de Terre-Neuve (que les Anglais appellent New-Found-Land) par White, qui y a été en 1700, trad. de l'orig. ang. Mémoire touchant Terre-Neuve, et le Golfe de Saint-Laurent, extrait des mémoires de navigateurs de mer par l'Auteur de la Relat. préc. Relat. du voyage de Gaspard Prévost et Gilbert Le Viste en 1608 et 1609, trad. de l'ang. Lettre de M. de Lisle touchant la Californie. Mémoire touchant la Californie. Relat. d'une descente des Espagnols dans la Californie en 1633, trad. du Castillan.\n\nTome Quatrième, Nouv. ed. 1732. Relat. de la Découverte de la Terre de Jesso, ou d'Eso, au Nord du Japon, par le vaisseau Castricum en 1643. Trad. du Holl. Lettre de M. de Lisle sur la question si le Japon est une île. Relat. concernant l'empire et le gouvernement du Japon par François Caron. Add. et Mémoires touchant le Japon. Relat. du voyage d'un navigateur hollandais sur la côte de l'île de Corée. Lettre de M. de Lisle touchant la planète de Ginseng. Relat. de la Tartarie Orientale par le Père Martine. Voy. de l'Empereur de la Chine dans la Tartarie orientale écrit par le Père Verbiest en l'année 1652. Voy. de l'emp. de la Chine dans la Tartarie Occidentale en l'année 1653. Voyagé d'Antoine Jenkinson, pour découvrir le chemin du Cathay par la Tartarie. Relat. du Sieur Ferrand, Médecin du Kan des Tartares, touchant la Krimée, les Tartares Nogais, et ce qui passe au Sérail dudit Kan. Voyagé d'un ambassadeur que le Czar de Moscovie envoya par terre à la Chine l'année 1653. Lettre de M. Delisle à Mr. Cassini sur l'embouchure de la Rivière Mississipi.\n\nTome Cinquième, 3e. ed. 1734. Relat. de la Louisianne ou Mississippi écrite à une dame par un officier de Marine. Relat. de la Louisianne et du Mississipi par le Chevalier de Tonti gouverneur du Fort Saint Louis aux Illinois. Voyage en un pays plus grand que l'Europe entre la Mer Glaciale et le Nouveau Mexique par le P. Hennepin. Journal du voyage de Laurent Lange à la Chine.\n\nTome Sixième, 3e. ed. 1739. Relat. de l'Arménie par le Père Monier. Hist. de la Conquête de l'empire de la Chine par les Tartares.\n\nTome Septième, 1725. Hist. des Deux Conquérans Tartares qui ont subjugué la Chine. Relation des Tartares Peropites et Nogais, des Circassiens, Mingréliens, et Georgiens par Jean de Luca. Additions à la relation précédente de la Tartarie, et principalement des Tartares de Crimée. Relat. de la Colehide ou Mingrelie par le P. Archange Lamberti. Relat. de la Colehide et de la Mingrelie par le Père Dom Joseph Marie Zampi. Extrait concernant la mer Caspienne et les pays voisins de cette mer, tiré des écrits du Sieur Perry, anglais,... Relat. du voyage de Jean du Plan Carpin, Cordelier, qui fut envoyé en Tartarie par le Pape Innocent IV, l'année 1246.\nTome Huitième, 1737. Préface du Traducteur. Voyage de Moscou à la Chine par le Mr. Everard Isbrants Ides, ambassadeur de Moscovie. Journal du Sieur Lange contenant ses négociations à la Cour de la Chine en 1721 & 1722 avec des remarques. Les moeurs et usages des Ostiackes.... et la manière dont ils furent convertis en 1712 à la religion chrétienne du Rit Grec.... par Jean Bernard Muller.\n\nThis Collection was published in 10 vols. 12° (1731-32.)\n\n*277 Nouveau Voyage autour du Monde par Mr. Le Gentil avec une Description de l'Empire de la Chine beaucoup plus ample et plus circonstanciée que celles qui ont paru jusqu'à présent, où il est traité des Moeurs, Religion...... des Peuples de cet Empire. Amsterdam, Pierre Mortier, 1780-1, 8 vols., sm. 8°\n\n278 Navigantium atque Itinerantium Bibliotheca: or a Compleat Collection of Voyages and Travels: consisting of above Four Hundred of the most authentick Writers; beginning with Hackluit, Purchass, &c., in English; Ramusio in Italian; Thevenot, &c., in French; De Bry and Grynaei Novus Orbis in Latin; the Dutch East India Company in Dutch: and continued...... to the present time by John Harris. London, 1705, 2 vols. folio.\n\n\"La Collection de Harris a été réimprimée en 1744-48 avec de grandes additions, mais aussi avec des altérations considérables. Le choix primitif en était fort judicieux.\" Biblioq. univ. III. p. 498.\n\n*279 A Collection of Voyages and Travels some now first printed from Original Manuscripts, others now first published in English—with a General Preface giving an account of the Progress of Navigation from its first Beginning. London, printed by assignment from Messrs. Churchill, 1732, 6 vols. folio.\n\nThe First Edition was published in 1704, 4 vols. folio.\n\n280 A Collection of Voyages and Travels, some now first printed from Original Manuscripts, others now first published in English—to which is prefixed an Introductory Discourse (supposed to be written by the celebrated Mr. Locke) intitled, The whole History of Navigation from its origin to this time. 3rd ed., Lond. print. by assignment from Messrs. Churchill for Henry Lintot & John Osborn, 1744-1746, 6 vols. folio.\n\n281 A Collection of Voyages and Travels, consisting of Authentic Writers in our own tongue, which have not before been collected in English, or have only been abridged in other collections, and continued...... compiled from the curious and valuable library of the late Earl of Oxford. London, Thomas Osborne, 1746, 2 vols. folio.\n\n*282 A New General Collection of Voyages and Travels: consisting of the most esteemed Relations, which have been hitherto published in any Language comprehending everything remarkable in its kind, in Europe, Asia, Africa America...... London, Thomas Astley, 1745-47, 4 vols., 4°\n\n283 Histoire générale des Voyages, ou Nouvelle Collection de toutes les Relations de Voyages par mer et par terre, qui ont été publiées jusqu'à présent dans les différentes langues de toutes les Nations connues. Paris, Didot, 1746-1761 (15 vols., 4° et 1 table)—16 vols. 4°\n\nSuite de l'Hist. générale des Voyages—Tome XVII pour servir de Supplément à l'édition de Paris. Amsterdam, Arktée et Merkus, 1761.\n\nContinuation de l'Hist. générale des Voyages—Tome XVIII formant le 1er. vol. de la continuation. Paris, Rozet, 1768.\n\nTome XIX formant le dernier vol. des Voyages de Mer. Paris, Panckoucke, 1770.\n\nTome XX. Bruxelles et Paris, an. X.\n\nThis publication of the Abbé Antoine Prévost has lost most of its reputation.\n\nIt was published in 80 vols. 12° (1746.)\n\n\"L'Édition de la Haye, 1747-80, 26 vols. 4°, contient des augmentations considérables, et entre autres, l'histoire des possessions hollandaises dans l'Asie, qui forme le 17e. vol. Il faut y ajouter le 26e. vol. de l'Ed. de Paris (Brunet.)\n*284 History of the Voyages and Discoveries made in the North—translated from the German of John Reinhold Forster. London, 1786, 4°\n\nHistoire des Découvertes et des Voyages faits dans le Nord, par J. R. Forster, mise en Français par Broussonet. Paris, Cuchet, 1788, 8°, 2 vol.\n\n285 A General Collection of the best and most interesting Voyages and Travels in all Parts of the World; many of which are now translated into English, digested on a new plan by John Pinkerton. London, Longman, 4°, 17 vols., 1808-1814.\n\nVol. I-VI (1808-9) Europe—VII-X (1811) Asia—XI (1812) Asiatic Islands—XII-XIII (1812) N. America—XIV (1813) S. America—XV-XVI (1814) Africa—XVII (1814) Supplement.\n\n*286 Journal of Researches into the Natural History and Geology of the countries visited during the voyage of H. M. S. \"Beagle\" round the world, under the Command of Capt. Fitzroy, R.N., by Charles Darwin, M.A.-F.R.S., 12° 2 vols., New York, Harper, 1846.\n\n*287 A Woman's Journey round the World, from Vienna to Brazil, Chili, Tahiti, China, Hindostan, Persia, and Asia Minor—an unabridged Translation from the German of Ida Pfeiffer. 6th ed. Ward & Lock, 1856, sm. 8°\n\n*288 Japan, the Amoor, and the Pacific; with Notices of other Places comprised in a Voyage of circumnavigation in the Imperial Russian Corvette \"Rynda,\" in 1858-60, by Henry Arthur Tilley. London, Smith Elder & Co., 1861, 8°\n\n289 Reise des österreichischen Fregatte \"Novara\" um die Erde in den Jahren 1857, 1858, 1859 unter den Befehlen des Commodore B. von Wüllerstorff—Urbair imp. 4°\n\nStatistisch-Commerzieller Theil von Dr Karl von Scherzer Wien 1864-5, 2 vols.\n\nZoologischer Theil.\n\nI Band Wien 1869.\nSäugethiere (Johann Zelebor) Vögel (August von Pelzeln) Reptilien (Dr Franz Steindachner) Amphibien (by the same) Fische (Dr Rudolf Kner)—(another copy cont. Fische, Amphibien, Reptilien.)\n\nII Band I Abtheilung—A\n1 Coleoptera (Dr Ludwig Radtenbacher) 2 Hymenoptera (Henri de Sanssure) 3 Formicidae (Dr Gustav. L. Mayr) 4 Neuroptera (Friedrich Brauer) Wien, 1868.\n\nII Band I Abtheilung—B\n1 Diptera (Dr J. R. Schiner) 2 Hemiptera (Dr Gustav. L. Mayr) Wien, 1868.\n\nII Band III Abtheilung.\n1 Crustaceen (Dr Camil Heller) 2 Anneliden (Prof. Ed. Grube) 3 Mollusken (Georg Ritter v. Frauenfeld) Wien, 1868.\nLinguistischer Theil von Dr. Friedrich Müller. Wien, 1867.\nAnthropologischer Theil II Abtheil. Wien, 1867. III Abtheil. Wien, 1868.\nGeologischer Theil.\n\nI Band I Abtheilung: Geologie von Neu-Seeland Wien, 1864. II Abtheil.\nPaleontologie von Neu-Seeland.\nBotanischer Theil I Band Wien, 1870.\nAlgae (A. Grunow) Fungi, Hepaticae et Musci Frondosi (Dr H. W. Reichardt)\nCryptogamae vasculares (Dr Georg Mettenius) Ophioglosseae und equisetaceae (Dr Julius Milde.)\n(Another copy cont. Algae.)\nNautisch—Physicalischer Theil Wien, 1862-65.\n\nB—Travels to Several Parts of the World.\n\n*290 The Travels of Marco Polo, the Venetian, the Translation of Marsden revised, with a Selection of his Notes. Edited by Thomas Wright. London, Henry G. Bohn, 1854, 8°\n\nOn Marco Polo Vide Charton's Voyageurs p. 252. In the same Work a Bibliography of Marco Polo is to be found p. 488.\nVide on Marco Polo Vol. VII of Pinkerton's Travels.\n\nThe Translation of Marsden was published in London, 4°, 1818.\n\nFirst Eng. translat.—The Most Noble and most Famous Travels of Marcus Paulus of the Nobilitie of the State of Venise into the East Parts of the World, as Armenia, Persia, Arabia, Tartaria, with many other Kingdoms and Provinces, translated (from the Spanish of Roderigo, by John Frampton) into English. London for R. Newberry, 1573, 4°, 16 pag.\n\nLater Eng. ed.—The Book of Ser Marco Polo, the Venetian, concerning the Kingdom and Marvels of the East. Newly translated and edited, with Notes, by Colonel Henry Yule, C.B., late of the Royal Engineers (Bengal.) In two vols., with Maps and other illustrations. London, Murray, 1871.\n\nItalian edition.—Marco Polo, delle maraviglie del mondo da lui vedeute. Venetia, Jo. Bapt. da Sessa, 1496 a di xiti di Junio, in 8.\n\nEdition la plus ancienne que l'on connaisse (en langue vénitienne) de cette relation curieuse d'un voyage exécuté dans le 13e siècle. Elle est excesseiment rare (Brunet.)\n\nFirst German translat.—Hie hebt sich an das Puch des edeln Ritters un Landt-farers Marcho Polo. In dem er schreibt die grossen wunderlichen Ding dieser Welt. Sunderlichen von den grossen Königen und Keysern die da herrschen in den selbigen Landen, und von ihrem Volk und seine Gerwonheit daselbe—Hie endet sich das Puch des edeln Ritters Marcho Polo das so sagt von mangerley Wunder der Landt und Lewt. Und wie er die selbigen gesehen und durch faren hat von dem Aufgang piss zu dem Nydergang der Sunen seliglich : diss hat gedruckt Frix Cressner zu Nürnberg. Nach Cristi geprägt towsent vier hundert unn im sieben und siebencigten jar. In folio de 67f., sans titre, pagination, réclame, ni signature, 1477 (Ternaux-Compan.)\n\nSpanish edition.—Libro del famoso Marco-Polo de las cosas meravellosas que visto en las partes orientales : con otro tratado de Pogio florentino, e trata de las mismas terras e islas (trad. por Rodriguez Canonigo de Sevilla)—folio 1529.\n\nCette Edition de 1529 est fort rare, mais il y en a une plus ancienne de Séville, 1520, in fol. que cite Panzer d'après Vogt (Brunet.)\n\nFrench edition.—Le premier volume du Recueil des Mémoires de la Société des Geographes, Paris, impr. d'Everard, 1824, in 4°, contient une ancienne traduction Francaise de Marco Polo, et la même Relation en latin, l'une et l'autre publiées sur les Mss. de la Bibliothèque du Roi ; de plus un glossaire des mots hors d'usage, et les variantes de différents Mss ou Texts impr. du même voyage (Brunet.)\n\nPortuguese edition.—La plus ancienne édition portugaise, à Lisbonne, Valentyn Fernandez, 1502 fol. (Pagès, Bibl. jap.)\n\n291 The Merits of Marco Polo (in Russian) by C. A. Skatskoff, ppt. 8°\n\n292 De Wonderlyke Reizen van Fernando Mendez Pinto. Amsterdam, 1658, 4°\n\n*293 Peregrinação de Fernão Mendez Pinto. Nova Edição—Conforme á primeira de 1614. Lisboa, Na Typ. Rollandiana, 1829, 8 vols. in 18.\n\nOther Translations.—In Spanish, by Francisco de Herrera Maldonado, Madrid, 1637—Valencia, 1645, fol.—In Dutch, Amsterdam, 1658, 4°—In German, ibid., 1671, 4°—In French, Paris, 1645, 4°—In Portuguese, Lisboa, 1614. Pinkerton's Supp. p. 419.\n\n*294 The Voyages and Travels of the Ambassadors sent by Frederick Duke of Holstein to the Great Duke of Muscovy, and the King of Persia. Begun in the year mdcxxxiii and finish'd in mdccxxxix. Containing a compleat History of Muscovy, Tartary, Persia, and other adjacent countries...... whereto are added the Travels of John Albert de Mandelslo (a gentleman belonging to the Embassy) from Persia into the East-Indies...... written originally by Adam Olearius, Secretary to the Embassy. Faithfully rendered into English by John Davies, of Kidwelly. London, 1662, sm. in folio.\n\n*295 Memoirs and Travels of Mauritius Augustus, Count de Benyowsky; Magnate of the Kingdoms of Hungary and Poland, one of the chiefs of the Confederation of Poland, &c., &c. Consisting of his military operations in Poland, his exile into Kamchatka, his escape and voyage from that Peninsula through the Northern Pacific Ocean, touching at Japan and Formosa, to Canton in China, with an Account of the French Settlement he was appointed to form upon the island of Madagascar—written by himself translated from the original manuscripts. London, 1790, 2 vols. 4°\n*296 The Travels of Ibn Batüta; translated from the abridged Manuscript copies, preserved in the Public Library of Cambridge with Notes...... by the Rev. Samuel Lee. London, Or. Transl. Committee, 1829, 4°\n\n*297 Trade and Travel in the Far East; or Recollections of twenty-one years passed in Java, Singapore, Australia and China, by G. F. Davidson. London, Madden & Malcolm, 1846, in 12.\n\n*298 The East: Sketches of Travel in Egypt and the Holy Land, by the Rev. J. A. Spencer, M.A., 3rd ed. New York, George F. Putnam, 1852, in 12.\n\n*299 China, Australia and the Pacific Islands, in the years 1853-56, by J. d'Ewes, Esq. London, R. Bentley, 1857, in 12.\n\n*300 Voyages to India, China and Australia, with an Account of the Swan River Settlement, by W. S. Bradshaw. London, J. F. Hope, 1857, sm. 8°\n\n*301 A Lady's Visit to Manilla and Japan by Anna d'A. London, Hurst & Blackett, 1863, sm. 8°\n\n*302 Voyageurs anciens et modernes...... par M. Edouard Charton. Tome II. Voyageurs du Moyen Age. Paris, 1863, 4°\n\n*303 Instructionen für die Fachmännischen Begleiter der K. K. Mission nach Ostasien und Südamerika. Wien, 1868, sm. 8°\n\nC—Travels in Europe.\n\n304 Russia—St. Petersburg, Moscow, Kharkoff, Riga, Odessa, the German provinces on the Baltic, the Steppes, the Crimea, and the Interior of the Empire by J. G. Kohl. London, Chapman & Hall, 1844, 8°\n\n305 Review of the Principal Geographical researches in Russia for 1867 and 1868 (in Russian.) St. Petersburg, 1870, sm. 8°\n\nD—Travels in Asia.\n\n1 Travels in Several Parts of Asia.\n\n*306 Divers Voyages et Missions du P. Alexandre de Rhodes en la Chine, et autres Royaumes de l'Orient avec son retour en Europe par la Perse et l'Arménie. Paris, Cramoisy, 1658, 4°\n\n*307 Anciennes Relations des Indes et de la Chine, de deux voyageurs Mahométans qui y allèrent dans le neuvième siècle; traduits d'Arabe...... (par Eusèbe Renaudot.) Paris, J. B. Coignard, 1718, 8°\n\n*308 Ancient Accounts of India and China, by two Mohammedan Travellers, who went to those Parts in the 9th century; translated from the Arabic, by the late learned Eusebius Renaudot. London, Sam. Harding, 1738, 8°\n\n\"Doubts have been expressed of the authenticity of these Travels, but M. de Guignee has discovered the original Arabic Ms. in the Imperial Library. They contain many absurdities, but much of what relates to China was confirmed by Marco-Polo, and by more modern Travellers.\" Pinkerton's Travels—Supp. p. 147.\n\n*309 Travels from St. Petersburg in Russia to diverse parts of Asia by John Bell, of Anternony. Glasgow, 1768, 2 vols., 4°\n\n*310 The Oriental Voyager; or Descriptive Sketches and cursory remarks, on a Voyage to India and China in his Majesty's Ship Caroline, performed in the years 1803-4-5-6...... by J. Johnson, Esq., Surgeon in the Royal Navy. London, John Asperne, 1807, 8°\n\n*311 The Traveller in Asia; or a Visit to the most celebrated parts of the East Indies and China...... for the instruction and entertainment of young persons by Priscilla Wakefield. London, 1817, 12°\n*812 Historical Accounts of Discoveries and Travels in Asia from the earliest ages to the present time by Hugh Murray, F.R.S.E., 3 vols. 8°. Edinburgh, A. Constable & Co., 1820.\n\n*813 Foštouški ou Relation des Royaumes bondhiques: Voyage dans la Tartarie, dans l'Afghanistan et dans l'Inde, exécuté, à la fin du IVe siècle par Chy Fa Hian. Traduit du Chinois et commenté par M. Abel Rémusat. Ouvrage-posthume revu, complété, et augmenté d'éclaircissements nouveaux par M. M. Klaproth et Landresse. Paris, I. R., 1886, imp. 4°\n\n*814 Travels in South Eastern Asia, embracing Hindustan, Malaya, Siam, and China; with notices of numerous Missionary Stations, and a full account of the Burman Empire, by the Rev. Howard Malcolm, of Boston, U. S. London, Charles Tilt, 1889, 2 vols. 12°, bd. in 1 vol.\n\n*815 The Voyage and Travaile of Sir John Maundeville, Kt., which treateth of the way to Hierusalem; and of Marvayles of Inde, with other ilands and countryes. Reprinted from the edition of A.D. 1725, with an introduction, additional notes, and glossary by J. O. Halliwell, Esq., F.S.A.—F.R.A.S. London, published by Edward Lumley, 1889, 8°\n\n*816 The Nestorians; or the Lost Tribes: containing Evidence of their identity, their manners, customs, and ceremonies—with Sketches of Travel in Ancient Assyria, Armenia, Media, and Mesopotamia; and illustrations of Scripture Prophecy by Asahel Grant, M.D. 3rd edition, London, Murray, 1844, sm. 8°\n\n*817 Relation des Voyages faits par les Arabes et les Persans dans l'Inde et à la Chine dans le IXe siècle de l'ère chrétienne—texte arabe imprimé en 1811 par les soins de feu Langlès publié avec des corrections et additions et accompagné d'une traduction française et d'éclaircissements par M. Reinaud, membre de l'Institut. Paris, I. R., 1845, 2 vols. in 24.\n\nVol. I. Discours préliminaire et traduction.\nII. Notes de la traduction et texte arabe.\nSee Charton's Voyageurs du Moyen Age, p. 94 et seq.\n\n*818 A Visit to India, China, and Japan, in the year 1853 by Bayard Taylor. New York, G. P. Putnam & Co., 1855, 12°\n\n*819 A Visit to India, China, and Japan by Bayard Taylor, newly revised and edited by George Frederick Pardon. London, James Blackwood, [1859] sm. 8°\n\nThe New York Edition of 1855 is much more complete but this edition contains an appendix which supplements Taylor's Sketches.\n\n*820 Personal Narrative of a voyage to Japan, Kamtschatka, Siberia, Tartary, and various parts of coast of China; in H. M. S. Barracouta, by J. M. Tronson, R.N., with charts and views. London, Smith Elder & Co., 1859, 8°\n\n2 Travels in Cisgangetic and Transganetic India and in Central Asia, &c.\n\n*821 Voyage remarquable de Guillaume de Rubruquis, envoié en Ambassade, par le roi Louis IX en différentes parties de l'orient: Principalement en Tartarie et à la Chine l'an de notre Seigneur mccciii traduit de l'anglais par le Sr. de Bergeron, 4°\n\n*822 A Voyage to Siam; London printed, 1688, 8°\n\n*823 Nouvelle Relation d'un voyage fait aux Indes Orientales…… par Mr. Dellen…… Amsterdam, François Marrest, 1699, 12°\n\n*824 A Voyage to the East-Indies in 1747 and 1748…… London, 1762, 8°\n*925 Ambassade au Thibet et au Boutan...... par M. Samuel Turner, chargé de cette Ambassade ; traduit de l'Anglais avec des notes par J. Castéra. Paris, F. Buisson, an IX (1800) 2 vols. 8°\n\nPub. in English London, Bulmer, 1800, 4°\n\n*926 A Voyage to Cochin-China in 1792 and 1793, containing a general View of the valuable productions and the political importance of this flourishing Kingdom, etc., to which is annexed an Account of a Journey made in 1801 and 1802 to the Residence of the Chief of the Booshuana Nation, by John Barrow. London, Cadell, 1806, 4°\n\n*927 Journal of a Voyage in 1811 and 1812 to Madras and China; returning by the Cape of Good Hope and St. Helena; in the H. C. S. The Hope, Cap. James Pendergrass, by James Wathen. London, 1814, 4°\n\n*928 Narrative of the Chinese Embassy to the Khan of the Tourgouth Tartars, in the years 1712, 18, 14, & 15; by the Chinese Ambassador, and published by the Emperor's authority, at Pekin—translated from the Chinese, and accompanied by an Appendix of Miscellaneous Translations by Sir George Thomas Staunton, Bart. London, Murray, 1821, 8°\n\nSir George Thomas Staunton was the only son of Sir George Leonard Staunton, whom he accompanied to China. He was born at Salisbury the 26th May 1781, and died the 14th of August 1859. His Library which was sold at auction by Sotheby in June 1860 fetched £566. 5/6.\n\n*929 Travels in the Himalayan Provinces of Hindustan and the Panjab; in Ladakh and Cashmir; in Peshawar, Kabul, Kunduz and Bokhara; by Mr. William Moorcroft and Mr. George Trebeck from 1819 to 1825. Prepared from the Press, from Original Journals and Correspondence by Horace Hayman Wilson, M.A., F.R.S. London, Murray, 1841, 2 vols. 8°\n\nHorace Hayman Wilson was born in London in 1786. Went to India as Assistant-Surgeon to the East-India Company. Was appointed Boden Professor of Sanskrit at Oxford (1831). Became Librarian at East-India House and Director of the R. A. Soc. He died in May 1860.\n\n*930 Travels in Tartary, Thibet, and China during the years 1844-5-6, by M. Huc, translated from the French by W. Hazlitt. 2nd edition, Nat. illust. Library, s. a., 2 vols. 12°\n\n*931 Recollections of a Journey through Tartary, Thibet, and China during the years 1844, 1845 and 1846, by M. Huc; a condensed Translation by Mrs. Percy Sinnet. London, Longman, 1852, sm. 8°\n\n*932 Histoire de la Vie de Hiouen-Thsang et de ses Voyages dans l'Inde, depuis l'an 629, jusqu'en 645, par Hoei-li et Yen-Thsong; suivie de documents et d'éclaircissements géographiques tirés de la relation originale de Hiouen-Thsang; traduite du Chinois par Stanislas Julien. Paris, imp. Imp., 1853, 8°\n\nVide in the Journal of the Roy. As. Soc. XIII, p. 106 \"Summary Review of the Travels of Hiouen-Thsang, from the Translation of the Si-yu-ki, by M. Julien, and the Mémoire analytique of M. Vivien de St. Martin by Professor H. H. Wilson.\"\n\n*933 Mémoires sur les Contrées occidentales, traduits du Sanscrit en Chinois, en l'an 648, par Hiouen-Thsang, et du Chinois en Français par M. Stanislas Julien. Paris, imp. Imp., 2 vols.-8°, 1857-68.\n\n*934 Souvenirs d'un Voyage dans la Tartarie et le Thibet pendant les années 1844, 1845 et 1846 par M. Huc, ancien missionnaire apostolique, 8e ed., 2 vols. 12°. Paris, Gaume Frères, 1857.\n\n*935 Description du Royaume Thai ou Siam par Mgr. Pallegoix. Paris, 1854, 2 vols. 12°, bd. in 1 vol.\n\n*936 Recollections of Tartar Steppes and their Inhabitants by Mrs. Atkinson. London, Murray, 1863, 8°\n*337 Travels on Horseback in Mantchu Tartary: being a summer's ride beyond the Great Wall of China by George Fleming, Esq. London, 1868, 8°\n\n*338 Cochin-China, and my Experience of it: A Seaman's Narrative of his Adventures and Sufferings during a captivity among Chinese Pirates, on the coast of Cochin-China, and afterwards during a Journey on foot across that Country, in the years 1857-8, by Edward Brown, Amoy, China. London, Charles Westerton, 1861, sm. 8°\n\n3 Travels in China and Japan.\n\n*339 L'Ambassade de la Compagnie Orientale des Provinces Unies vers l'Empereur de la Chine ou grand Can de Tartarie, faite par les Srs. Pierre de Goyer & Jacob de Keyser...... le tout recueilli par le Mr. Jean Nieuhoff...... mis en français...... par Jean le Carpentier. Leyde, Jacob de Meurs, 1665, folio.\n\n*340 An Embassy from the East-India Company of the United Provinces, to the Grand Tartar Cham, Emperor of China, delivered by their Excellencies Peter de Goyer, and Jacob de Keyzer, at his Imperial City of Pekin, wherein the Cities...... are ingenuously described by Mr. John Nieuhoff, Steward to the Ambassadors...... Englished...... by John Ogilby. London, 1669, fol.\n\n341 Het Gezantschap der Neelandische Oost-Indische Compagnie, aan den Grooten Tartarischen Cham, den tegenwoordigen Keizer van China: door Joan Nieuhoff. Amsterdam, folio, 1670.\n\nThe Latin Translation of this Work of Nieuhoff under the Title of \"Legatio Batavica ad magnum Tartarie Chamum Sungetium modernum Sinse imperatorem.... was made by George Horne. Amt. Meursius, 1668, folio.\n\nNieuhoff's Voyages and Travels into Brasil, 1640-49, and into the East-Indies, 1653-76, will be found in the second volume of Churchill's Collection of Voyages and Travels, and in the Fourteenth Vol. of Pinkerton's Collection, and his Travels in China are in the Seventh Vol. of the latter Collection (Lowndes.)\n\n*342 Borts Voyagie, Naer de Kuste van China en Formosa By sen gestelt, en Berijmt door Matthijs Cramer. Amt., P. D. Bateman, 1670, in 12.\n\n343 Ambassades mémorables de la Compagnie des Indes Orientales des Provinces Unies vers les Empereurs du Japon. Amsterdam, 1680, folio.\n\n344 Atlas Japanensis: being remarkable Addresses by way of Embassy from the East-India Company of the United Provinces to the Emperor of Japan...... collected by Arnoldus Montanus english'd...... by John Ogilby. London, 1670, folio.\n\n345 Atlas Chinensis: being a Second Part of a Relation of remarkable passages in two Embassies from the East-India Company of the United Provinces, to the Vice-roy Singlamong and General Taising Lipovi, and to Kongchi, Emperor of China and East-Tartary...... collected...... by Arnoldus Montanus...... English'd by John Ogilby. London, folio, 1671.\n\n*346 Ambassades de la Compagnie Hollandaise des Indes d'Orient vers l'Empereur du Japon...... à la Haye, Meindert Uiteverf, 1696, 2 vols. in 24.\n\n*347 Relation du Voyage de Mr. Evert Isbrand, Envoyé de Sa Majesté Czarienne à l'Empereur de la Chine en 1692, 93 et 94, par le Sieur Adam Brand; avec une lettre sur l'état présent de la Moscovie. Amsterdam, J. L. de Lorme, 1699, sm. 8°\n*348 Three Years Travels from Moscow overland to China through Great Ustiga, Siriania, Permia, Sibiria, Daour, Great Tartary, &c., to Peking...... written by his Excellency E. Ysbrants Ides, Ambassador from the Czar of Muscovy to the Emperor of China...... to which is annex'd an accurate Description of China done originally by a Chinese Author...... printed in Dutch by the direction of Burgomaster Witzen, formerly Ambassador in England; and now faithfully done into English. London, 1706, 4°\n\n*349 De droevige Shipbreuk van het Flintschip den Arion, op de reize uit Japan naer Batavia, door A. Bögaert. Amsterdam, 1723, 8°\n\n*350 De Reizende Chinees, op bevel en koften van zynen keizer, bd. in 4 vols. 8°. Amst., Hendrik Bosch, 1727-28.\n\n*351 Herrn Peter Osbeck-Reise nach Ostindien und China—D. Toreens: Reise nach Surratte—C. G. Eckeburg. Nachricht von der Landwirthschaft der Chineser. Aus dem Schwedischen übersetzt von J. G. Georgi. Rostock, Johann Christian Koppe, 1765, 8°\n\nThe Swedish Relation of Osbeck's Travel was pub. at Stockholm in 1757, 1 vol. 8°\n\n*352 A Voyage to China and the East-Indies by Peter Osbeck...... together with a Voyage to Surratte by Olof Toreen...... and an Account of the Chinese Husbandry, by Captain Charles Gustavus Eckeburg—translated from the German by John Reinhold Forster, F.A.S., to which are added a Faunula and Flora Sinensis. London, B. White, 2 vols. 8°, 1771.\n\n*353 Le Voyageur Francais, ou la Connaissance de l'ancien et du nouveau monde, mis au jour par M. l'abbé Delaporte. Tome Cinquième: la Chine. Paris, Vincent, 1767, in 12.\n\n*354 A Narrative of the British Embassy to China in the years 1792, 93 and 94...... by Alneas Anderson...... London, J. Debrett, 1795, 4°\n\nAn Abridgment (in 8°) also appeared in 1795. (Londres.)\n\nA French Travel, was pub. an IV. Paris, Denné, 8°, 2 vols. in 1.\n\n*355 An authentic Account of an Embassy from the King of Great Britain to the Emperor of China...... together with a Relation of the Voyage undertaken on the occasion by his Majesty's ship \"the Lion,\" and the ship \"Hindostan,\" in the East-India Company's service, to the Yellow Sea, and Gulf of Pekin; as well as of their return to Europe...... taken chiefly from the Papers of...... the Earl of Macartney...... Sir Erasmus Gower...... by Sir George Staunton, Bart. London, G. Nicol, 1797, 8 vols. 8°\n\nSir George Leonard Staunton was born in Ireland in the County of Galway the 19th of April 1737.—Was for some time a Physician in the West-Indies—Then practised as a Lawyer. He became acquainted at Granada with Lord Macartney whom he accompanied to Madras as private Secretary when L. M. was appointed Governor of that place. He went to China with L. M. in 1792, and died the 14th January 1801.\n\n*356 An historical Account of the Embassy to the Emperor of China undertaken by order of the King of Great Britain...... and preceded by an Account of the causes of the Embassy and Voyage to China. Abridged principally from the Papers of Earl Macartney, as compiled by Sir George Staunton, Bart. London, John Stockdale, 1797, 8°\n\n*357 Voyages à Péking, Manille et l'île de France faits dans l'intervalle des années 1784 à 1801 par M. de Guignes, à Paris, Imp. Imp., 1808, 3 vols. 8° et atlas folio.\n\nEnglish edition. London, 4°, 1809.\n\nCharles Louis Joseph de Guignes, son of Joseph de Guignes, was born in Paris in 1759 and died in 1845.\n\n[1706 — 1808]\n*858 Voyage à Canton, Capitale de la Province de ce nom, à la Chine, par Gorée, le Cap de Bonne Espérance, et les Isles de France et de la Réunion ; suivi d'observations sur le voyage à la Chine, de Lord Macartney et du citoyen Van-Braam, et d'une esquisse des arts des Indiens et des Chinois, par le C. Charpentier Cossigny, ex Ingénieur. Paris, André, an VII, 8°\n\n*859 Reizen van het gezantschap der Hollandische Oostindische Compagnie, naar den keizer van China, in den Jaare 1794 en 1795 van A. E. van Braam Houckgeest. Haarlem, François Bohn, 1804, 2 vols. 8°, bd. in 1.\n\n\"Voyage de l'ambassade, &c., tiré du journal d'André Everard van Braam Houckgeest, et publié en Français par L. E. Moreau de Saint Méry, A Philadelphie, 1797, 4°\"\n\n*860 Travels in China, containing Descriptions, Observations and Comparisons made and collected in the course of a short Residence at the imperial Palace of Yuen-Min-Yuen, and on a subsequent journey through the Country from Pekin to Canton...... by John Barrow. London, Cadell, 1804, 4° (2 copies.)\n\nIt has been translated into French by J. Castéra. Paris, an XIII, 3 vols. 8° and 4° atlas.\n\n*861 Reizen in China...... door John Barrow uit het engelsch. Te Haarlem—F. Bohn, 1807-1809, 3 vols. 8°\n\n*862 Journal of the Proceedings of the late Embassy to China, comprising a correct Narrative of the public transactions of the Embassy, of the Voyage to and from China, and of the journey from the mouth of the Pei-ho to the return to Canton by Henry Ellis. London, Murray, 1807, 4°\n\nCe journal de l'ambassade de Lord Amherst a été traduit en français par M. J MacCarthy qui a publié sa traduction sous le titre \"Voyage en Chine, ou Journal de la dernière ambassade anglaise à la cour de Péking. Paris, 1818, 2 vols. in 8 fig. 15 fr.\" (Brunet.)\n\n*863 Narrative of a Journey in the Interior of China, and of a Voyage to and from that Country in the years 1816 and 1817; containing an Account of the most interesting transactions of Lord Amherst's Embassy to the Court of Peking, and observations on the Countries which it visited by Clarke Abel. London, 4°, 1818.\n\n*864 Narrative of my Captivity in Japan during the years 1811, 12 and 1813; with observations on the country and people, by Captain Golownin, R.N., to which is added an Account of Voyages to the Coasts of Japan, and of Negotiations with the Japanese, for the release of the Author and his companions by Captain Rikord. London, Henry Colburn, 1818, 2 vols. 8°\n\nA 3rd vol. was pub. in 1819, under the title of \"Recollections of Japan.\" M. Léon Pagès who mentions the 3 vols. of the 2nd ed. 1824, does not speak of the two first vols. of the ed. of 1818.\n\n*865 Le Japon ou Voyage de Paul Ricord, aux îles du Japon, en 1811, 1812 et 1813 sur la corvette russe la Diane, pour la délivrance du Capitaine Golownin, traduit de l'allemand par M. Breton. Paris, Nepveu, 1822, 2 vols. in 24, (bd. in 1.)\n\n*866 Voyage of his Majesty's ship Alceste to China, Corea, and the Island of Lew-chew with an Account of her Shipwreck, by John M'Leod, M.D., Surgeon of the Alceste. 3rd ed., London, Murray, 1819, 8°\n\n1st ed. 1817—2nd ed. 1819—the third ed. is of 1819 as above and not 1826 as stated by M. L. Pagès.\n\n[1799 — 1819]\n*367 Voyage to Corea and the Island of Loochow by Captain Basil Hall—A new ed.  \nLondon, Murray, 1820, sm. 8°\n\n\"The First Ed. [1818, 4°] of this work which gives a full account of the Voyage to Corea and Loochoo, is divided into a Narrative—an Appendix containing Charts and various nautical and scientific Notices and a Vocabulary of the Loochoo Language. The present Edition is confined to the narrative alone to the exclusion of all technical and other details, not calculated to interest the general reader.\" (Preface.)\n\n*368 Voyage à travers la Mongolie en 1820 et 1821 par M. G. Timkovski; traduit du russe par N*********, revu par M. J. B. Eyries; publié avec des corrections et des Notes, par M. J. Kläroth. Paris, Dondey Dupré, 1827, 2 vols. 8°\n\n*369 Travels of the Russian Mission through Mongolia to China and Residence in Peking in the years 1820-1821, by George Timkowski with corrections and Notes by Julius von Klaproth. London, Longman, 1827, 2 vols. 8°, (2 copies.) German transl. by J. A. E. Schmidt, Leipzig, Fleischer, 1825, 8°\n\n*370 Report of Proceedings on a Voyage to the Northern Ports of China in the ship Lord Amherst (by M. Lindsay.) London, B. Fellowes, 1888, 8°\n\n*371 Report of Proceedings on a Voyage to the Northern Ports of China in the ship Lord Amherst extracted from Papers, printed by order of the House of Commons, relating to the trade with China. 2nd ed. London, B. Fellowes, 1884, 8°\n\n\"This Voyage was projected by Mr. Marjoribanks, the late President of the Select Committee of Supra-Cargoes at Canton. The Gentlemen entrusted with the Mission were Mr. Lindsay, one of the Company's supra-cargoes, and the Rev. Charles Gutzlaff, a Prussian Missionary (from the adit.).\"\n\nLindsay's Report pages 1—268.\nGutzlaff's Report pages 269—295.\n\n*372 Journal of three Voyages along the Coast of China in 1891, 1892 and 1893, with notices of Siam, Corea, and the Loo-choo Islands, by Charles Gutzlaff, to which is prefixed an introductory Essay on the Policy, Religion, &c., of China, by the Rev. W. Ellis. London, F. Westley & A. H. Davis, 1894, 8°\n\n*373 Sketches of China; partly during an inland journey of four months, between Peking, Nanking, and Canton; with notices and observations relative to the present war by John Francis Davis, F. R. S., &c. London, Charles Knight & Co., 1841, 2 vols. 12°\n\n*374 A Narrative of an exploratory visit to each of the Consular Cities of China, and to the islands of Hongkong and Chusan, in behalf of the Church Missionary Society, in the years 1844, 1845, 1846 by the Rev. George Smith, M. A. London, 1847, 8°\n\n*375 The Chinese Miscellany—No. 1. A glance at the Interior of China obtained during a journey through the Silk and Green Tea Districts. Shanghai, 1849, 8°\n\n*376 Three years' Wanderings in the Northern Provinces of China, including a visit to the Tea, Silk, and Cotton Countries: with an Account of the Agriculture and Horticulture of the Chinese, new plants, etc., by Robert Fortune, Botanical Collector to the Horticultural Society of London. 2nd ed. London, Murray, 1847, 8°\n\n*377 Aventures de Robert Fortune dans ses Voyages en Chine à la recherche des Fleurs et du Thé, traduit de l'anglais (1848-50.) Paris, Hachette, 1854, in 16.\n\n*378 A Residence among the Chinese: inland, on the coast, and at sea, being a narrative of sciences and adventures during a third visit to China, from 1858 to 1856, by Robert Fortune. London, Murray, 1857, 8°\n\n[1820 — 1857]\n*879 A Voyage to China...... by Dr. Berncastle. London, 1850, 2 vols. 12° (bd. in 1.)\n\n*880 Voyage en Chine par M. C. Lavallée. Paris, Rouvier—Ledoyen, Oct. 1862, 8°\n\n*881 Recollections of a three years' Residence in China; including Peregrinations in Spain, Morocco, Egypt, India, Australia, and New Zealand by W. Tyrone Power. London, R. Bentley, 1858, 12°\n\n*882 Voyage en Chine du Capitaine Montfort avec un Appendice historique sur les derniers événements par Georges Bell. Paris, Victor Lecou, 1854, 12°\n\n*883 L'Empire Chinois faisant suite à l'ouvrage intitulé Souvenirs d'un voyage dans la Tartarie et le Thibet par M. Hue, ancien missionnaire apostolique en Chine. 2e. ed. Paris, Gaume Frères, 1854, 2 vols. 8°\n\n*884 The same. 3e. ed. Paris, Gaume, 1857, 2 vols. 12°\n\n*885 Narrative of the Expedition of an American Squadron to the China Seas and Japan performed in the years 1852, 1858 and 1854, under the command of Commodore M. C. Perry, U.S.N., compiled...... by Francis L. Hawks. New York, Appleton, 1857, 8°\n\n*886 Geographical and Ethnographical Elucidations to the Discoveries of Maerten Gerrits Vries, Commander of the flote Castricum, a.d. 1648 in the East and North of Japan, and to Jezo, Kraffto, and the Kurils, by P. F. von Siebold. Translated from the Dutch by F. M. Cowan. Amsterdam, F. Muller, 1859, 8°\n\n*887 Two Journey to Japan 1856-57 by Kinahan Cornwallis. London, T. C. Newby, 1859, 2 vols. 12°\n\n*888 A Journal of the First French Embassy to China, 1698-1700, translated from an unpublished Manuscript by Saxe Bannister, M. A. with an Essay of the friendly disposition of the Chinese Government and people to foreigners. London, Newby, 1859, 12°\n\n*889 Narrative of the Earl of Elgin's Mission to China and Japan in the years 1857-58-59, by Laurence Oliphant, Private Secretary to Lord Elgin. Edinburgh & London, Blackwood, 1859, 2 vols. 8°\n\n*890 Souvenirs d'une Ambassade en Chine et au Japon en 1857 et 1858 par le Mis de Moges. Paris, Hachette, 1860, 12°\n\n*891 Fanny Loviot—Les Pirates chinois—Ma Captivité dans les mers de la Chine. Nouvelle ed. Paris, lib. Nouv., 1860, in 12.\n\n*892 A Residence at Nagasaki and Hakodate in 1859-60 with an Account of Japan generally by C. Pemberton Hodgson, late H. B. M. Consul at those ports with a Series of Letters on Japan by his Wife. London, R. Bentley, 1861, sm. 8°\n\nAt the End of the Vol. pages 327-350 there is a \"Catalogue of Japan Plants, systematically arranged, communicated by Sir William Hooker.\"\n\n*893 Ten Weeks in Japan by George Smith, D. D., Bishop of Victoria (Hongkong.) London, Longman, 1861, 8°\n\n*894 Five Months on the Yang-tse; with a Narrative of the Exploration of its upper waters, and Notices of the present rebellions in China by Thomas W. Blakiston, late Captain Royal Artillery—illustrated from Sketches by Alfred Barton, M.R.C.S., F.R.G.S., with Maps by Arrowsmith. London, Murray, 1862, 8°\n\n(1 Presentation Copy—1 belonging to the Wylie Coll.)\n\n*895 Un Voyage autour du Japon par Rodolphe Lindau. Paris, Hachette, 1864, 12°\n\n(Presentation Copy to the Society.)\n\n[1850 — 1864]\nDe Macao à Fuchau—Recordações de Viagem por Gregorio José Ribeiro. Lisboa, Typ. universal, 1866, ppt. 8°, 77 pag.\n\nNotes for Tourists in the North of China by N. B. Dennys. Hongkong, Shortrede, 1866, ppt. 8°\n\nA Sketch of the New route to China and Japan by the Pacific Mail S. S. Co. San Francisco, 1867, ppt. 12°\n\n4 Travels in Russian Asia.\n\nVoyages de M. P. S. Pallas, en différentes Provinces de l'empire de Russie, et dans l'Asie septentrionale; traduits de l'allemand par M. Gauthier de la Peyronie. Paris, Lagrange, 1788-93, 5 vols, 4°\n\nAn Atlas folio accompanies generally this Edition. A new ed., revue by Lamarck et Langlès, was published in 8 vols. 8° and folio Atlas. Paris an ii, Maradan—The German ed. was pub. in 3 vols. 4°, St. Petersburg, 1771-1773-1774.\n\nTwo vols. 4° of the translation by Delaboulaye and Tonnellier of the Travels in 1793-94 were pub. Paris, 1805, and form the continuation of 5 vols. 4° printed 1788-98. Pierre Simon Pallas was born at Berlin in 1741 and died in the same City in 1811.\n\nNarrative of a Pedestrian Journey through Russia and Siberian Tartary, from the Frontiers of China to the Frozen Sea and Kamchatka; performed during the years 1820, 1821, 1822 and 1823, by Captain John Dundas Cochrane, R.N. London, Murray, 1824, 8°\n\nTravels in Kamchatka and Siberia; with a Narrative of a Residence in China, by Peter Dobell, Counsellor of the Court of his Imperial Majesty the Emperor of Russia, 2 vols. sm. 8° (bd. in 1 vol.) London, Henry Colburn & Richard Bentley, 1830.\n\nTravels in Siberia: including Excursions Northwards, down the Obi, to the Polar Circle, and Southwards to the Chinese Frontier by Adolph Erman, translated from the German, by William Desborough Cooley. London, Longman, 1848, 2 vols. 8°\n\nTravels in the Regions of the Upper and Lower Amoor and the Russian Acquisitions on the Confines of China...... by Thomas William Atkinson. London, 1860, 8°\n\nTravels along the Frontiers of Russian Asia by M. Vernioukoff (in russian) St. Petersburg, 1868, 8°\n\nE—Travels in America, Africa, to the Islands of the Pacific Ocean, etc.\n\nA Journal of a Voyage to the South Seas, in his Majesty's ship, The Endeavour, faithfully transcribed from the Papers of the late Sydney Parkinson, Draughtsman to Joseph Banks, Esq., on his late Expedition with Dr. Solander, round the World. London, 1778, 4°\n\nIncidents of Travel in Yucatan by John L. Stephens. New-York, Harper, 1848, 2 vols. 8°\n\nThe Chinaman abroad; or a desultory Account of the Malayan Archipelago, particularly of Java by Ong-Tae-Hae, translated from the original. Shanghai, 1849, ppt. 8°\n\nHongkong to Manilla and the Lakes of Luzon, in the Philippine Isles, in the year 1856, by Henry T. Ellis, R.N. London, Smith Elder & Co., 1859, 8°\n\nNarrative of a Journey to Musardu, the Capital of the Western Mandingoes by Benjamin Anderson. New York, Green, 1870, ppt. 12°\nIII. ANCIENT HISTORY.\n\n*410 Fasti Hellenici. The Civil and Literary Chronology of Greece from the earliest accounts to the Death of Augustus by Henry Fynes Clinton. Oxford, 1834, 9 vols. 4°\n\n411 Historical Researches into the Politics, Intercourse, and Trade of the principal Nations of Antiquity by A. H. L. Heeren, Translated from the German.—Vol. I Asiatic Nations, Persians, Phoenicians, Babylonians. Vol. II Asiatic Nations, Scythians, Indians, Appendixes. London, Henry G. Bohn, 1846, 2 vols. 8°\n\n411a A Manual of Ancient History, particularly with regard to the constitutions, the commerce, and the colonies, of the States of Antiquity, by A. H. L. Heeren, Translated from the German. London, Henry G. Bohn, 1847, 8°\n\n412 Historical Researches into the Politics, Intercourse, and Trade of the Carthaginians, Ethiopians, and Egyptians by A. H. L. Heeren, Translated from the German. 2nd ed. London, Henry G. Bohn, 1850, 8°\n\n*418 The Geography of Herodotus developed, explained, and illustrated from modern Researches and Discoveries by J. Talboys Wheeler, F.R.G.S. London, Longman, 1854, imp. 8°\n\nIV. ECCLESIASTICAL HISTORY.\n\n*414 Epistolæ Indicæ et Japanicæ de Multarum Gentium ad Christi fidem, per Societatem Jesu conversione—Item de Tartarorum potentia, moribus et totius penè Asiae religione. Tertia editio, Louaniæ, 1570, sm. 8°\n\n*415 Lettera del P. Alessandro Valignano, Visitatore della Compagnia di Gesù nel Giappone e nella Cina de'10 d'ottobre del 1599. Al Reverendo P. Claudio Aquaviva Generale della medesima Compagnia. Milano, 1608, 102 p. in 16.\n\n*416 L'État présent de l'Eglise de la Chine adressé à Monseigneur l'évêque de***—Relation abrégée de la nouvelle persécution de la Chine. VII partie—Réponse de M. Pastel, Docteur en Théologie, de la Maison et Société de Sorbonne, et Approbateur de la Théologie de M. Habert à la dénonciation de cet ouvrage…… Paris, 1711.\n\nTrois Pièces reliées en un vol. in 12.\n\n*417 A History of the Missions in Japan, p. 8° s. a. n. l.\n\n*418 De Christianis apud Japonios triumphis, sive de gravissima ibidem contra Christi fidem persecutione exorta anno 1612 usque ad annum 1620 Libri V, in annos totidem summâ cum fide ex annuis Soc. Jesu litteris continuâ historiæ serie distributi. auctore P. Nicolao Trigautio, S.J. Cum Raderi auctario et iconibus Sadelerianis. Monachii, 1628 4°\n\nL'Addition de Raderus est l'Histoire de l'Eglise Japonaise en 1617, 1618, 1619 et 1620. Cette Addition est suivie d'une Lettre du P. Spinola, du Catalogue des Martyrs Japonais, de 1612 à 1620, et de la Liste des résidences que les PP. ont dû abandonner. 1624, 4°\n\nIn French: Trans. by P. Pierre Morin, Paris, S. Cramoisy, 1624, 8° pp. 638 and by the abbé de Pure, 1655 4°. Le Père Morin, né à Paris vers 1562, mort à Paris en 1625. (León Pagès, Bib. Jap.)\n\n*419 De Christiana Expeditione apud Sinas suscepta ab Societate Jesu ex P. Matthaei Ricii ejusdem Societatis Commentariis Libri V ad S. D. N. Paulum V…… Auctore P. Nicolao Trigautio Belga ex eadem Societate Augusta Vind., apud Christoph. Mangium, 1615, 4°\nXXI. P. Nicolaus Trigaultius Belgae, eodem anno (1610) venit propagatum S. Legem in Provincia Chekiang, Cungcingi Imperatoris anno 2 (1629) ibidem oblit; sepultus est in Hangcheu in loco Fangein dicto. Ph. Couplet Cat. Pat. S. Jesu, p. 106-7.\n\nN. Trigault was born at Douay 3rd March 1577. He joined the Society of Jesus in 1594. He went to Europe (1615-1618.)\n\n\"Le P. Math. Ricci, célèbre jésuite, et fondateur de la mission de Chine, naquit à Macerata, dans la marche d'Ancone, en 1552... Il entra dans la compagnie de Jesus en 1571.\" Il est mort à Pékin en 1610.\n\nVide Rémyssat's Nouv. Mel. As. Vol. II p. 207 et seq.\n\n*420 Defensa de los nuevos christianos, y missioneros de la China, Japon, y Indias, contra dos libros intitulados, La Practica Moral de los Jesuitas, y el Espiritu de M. Arnaldo. Traducida de Frances en Español...... por Don Gabriel de Parraya. Madrid, 1690, 8°\n\n*421 Delle Missioni di Padri della Compagnia di Gesu nella Provincia del Giappone, e particolarmente di quella di Tunkino Libri Cinque. del P. Gio. Filippo de Marini. Roma, 1663, 4°\n\nLe P. de Marini, Génois, alla d'abord au Tonkin, puis fut Provincial du Japon, il vivait encore en 1677. (León Pagès.)\n\n*422 The History of the Church of Japan written originally in French by Monsieur l'Abbé de T. and now translated into English by N. N. London, 1705, 2 vols. 4° bd. in 1 vol.\n\n*423 Relation de la nouvelle persecution de la Chine jusqu'à la mort du Cardinal de Tournon dressée par le R. P. François Gonzales de S. Pierre—1714, in 12.\n\n*424 Jo, Laurentii Moshemii Historia Tartarorum Ecclesiastica; adjecta est Tartarum asiaticae secundum recent. geographos in mappa Delineatio. Helmstadii, Weygand, 1741, 4°\n\n*425 Mémoires historiques présentés en 1744 au souverain pontife Benoit XIV sur les missions des Pères jésuites aux Indes orientales...... 3e ed. par le R. P. Norbert. Besançon, Jean Pierre-Le Fevre, 1747, 2 vols. 4°\n\nPierre Parisot, alias Père Norbert, a Capucin Monk, was born at Bar-le-Duc in 1697 and died near Commercy 3rd July 1769, after a most eventful life.\n\n*426 A Chinese Fragment containing an Enquiry into the present state of Religion in England, with notes by the Editor. London, 1786, 8°\n\n*427 A Retrospect of the First ten years of the Protestant Missions to China, (now, in connection with the Malay, denominated the ultra-Ganges Missions) accompanied with miscellaneous remarks on the Literature, History, and Mythology of China, &c., by William Milne. Malacca, 1820, 8°\n\n*428 A Narrative of Missionary Enterprise in the South Sea Islands...... by John Williams. London, 1838, 8°\n\n*429 China: its State and Prospects, with especial reference to the spread of the Gospel...... by W. H. Medhurst. London, John Snow, 1838, 8°\n\nReviewed in the Ch. Rep. IX, 74.\n\n*430 Maritime Discovery and Christian Missions, considered in their mutual relations by John Campbell. London, 1840, 8°\n\n*431 Christianity in Ceylon: its Introduction and Progress under the Portuguese, the Dutch, the British, and American Missions: with an historical Sketch of the Brahmanical and Buddhist Superstitions by Sir James Emerson Tennent. London, Murray, 1850, 8°\n\n*432 The Cross and the Dragon or, the Fortunes of Christianity in China: with Notices of the Christian Missions and Missionaries, and some account of the Chinese secret societies by John Kesson, of the British Museum. London, Smith Elder & Co., 1854, 8°\n*493 The Land of Sinim or China and Chinese Missions by the Rev. William Gillespie. *Edinb.*, 1854, sm. 8°\n\n*434 Missions de Chine—Mémoire sur l'État actuel de la Mission du Kiangnan 1842-1855 par le R. P. Brouillon de la Comp. de Jésus suivi de Lettres relatives à l'insurrection 1851-55. *Paris, Julien, Lanier & Cie.*, 1855, 8°\n\n*435 Recherches sur l'Origine et la Constitution des Ordres religieux dans l'Empire Chinois par M. Bazin. *Paris, Imp. Imp.*, 1856, 8°, 70 p.\n\n436 Proclamations du Mandarin Ye et du Vice-Roi Ho; Commissaire impérial et Gouverneur général des Deux-Kiang, ordonnant la liberté du culte catholique en Chine et la libre circulation des missionnaires chrétiens dans tout l'empire—traduits sur les originaux chinois par M. G. Pauthier. *Paris*, 1860, pp. 8°\n\n*437 The Jesuit Martyrs of Japan—a History of the Lives and Martyrdom of Paul Michi, James Chisai, and John Soan de Goto, of the Society of Jesus by Father Boero of the same society. Translated from the Italian by a Catholic Priest. *Dublin*, 1862, 12°\n\n**Appendix to Ecclesiastical History:**\n\nLives and Works of Missionaries.\n\nSee on the First Jesuits who came to China P. Couplet's *Catalogus Patrum Societatis Jesu*, printed at the end of P. Verbiest's *Astronomia Europea* (Vide No. 92.) See in Kircheri *China illustrata* p. 117; *Catalogus librorum a Patribus nostris in Chinesis Ecclesiae incrementum conscripserunt.*\n\n*438 La Vie de St. François Xavier, Apôtre des Indes et du Japon, par le Père Bouhours. *Avignon*, 1819, 2 vols., in 12.\n\nThis Work of Père Dominique Bouhours (born 1628+1702) had numerous French Editions and was translated into English by Dryden (*London*, 1683, 12°, *Lein Pagts.*). (*London*, 1683, 8° *Londres*).\n\nSt. Fr. Xavier was born on the 7th April 1506 and died 2nd December 1552.)\n\n*439 Lectures on the Sayings of Jesus by Robert Morrison, D.D. *Malacca, Mission Press*, 1832, 2 parts in 1 vol. 8°\n\n440 Memoirs of the Life and Labours of Robert Morrison, D.D.…… compiled by his widow; with critical Notices of his Chinese Works by Samuel Kidd. *London, Longman*, 1839, 2 vols. 8°\n\n*Vide in Ch. Rep. Vol. III p. 177 et seq. \"Obituary Notice of the Rev. Robert Morrison, D.D., with a Brief View of his Life and Labours\" by E. Stevens.*\n\nRobert Morrison was of Scottish descent, but born at Morpeth in the North of England on the 6th of January 1782. He died at Canton the 1st August 1834.\n\n*441 The Life and Opinions of the Rev. William Milne, D.D., Missionary to China….. by Robert Philip. *London, John Snow*, 1846, in 16.\n\n*Vide in Ch. Rep. Vol. I p. 316 et seq. \"A Brief Sketch of the Life and Labours of the late Rev. William Milne, D.D.\", by E. Stevens.*\n\nWilliam Milne was born in Aberdeenshire (Scotland) in 1785. He was ordained in July 1812, and arrived at Macao the 4th July 1813. His death took place on the 2nd June 1822.\n\n*442 Memoir of the Rev. Samuel Dyer, sixteen years Missionary to the Chinese by Evan Davies. *London, John Snow*, 1846, in 16.\n\n*443 Memoirs of the Rev. Walter M. Lowrie, Missionary to China edited by his father. *Philadelphia.*\n\nW. M. Lowrie was born in 1819 and died in 1847.\n\n*444 Sermons preached in China by the Rev. Walter M. Lowrie. *New York—R. Carter & Bros.*, 1851, 8°\n\n*445 Memoir of the Life and Brief Ministry of the Rev. David Sandeman, Missionary to China by the Rev. Andrew A. Bonar. *London, Nisbet*, 1861, sm. 8°\nLectures on Theology, Science, and Revelation by the late Rev. George Legge.  \nLondon, 1863, 8°\n\nV. ARCHEOLOGY.\n\nAntiquitates sacrae veterum Hebraeorum delineatae ab Hadriano Relando.  \nTracti Batavorum, 1712, 12°\n\nAdrian Reland was born at Ryp, in North Holland, in 1676. He finished his classical Studies by the time he was eleven years of age, and became Professor of Philosophy at Harderwik, when only twenty-four. He removed to Utrecht afterwards, where he became Professor of the Oriental Tongues, and Ecclesiastical Antiquities, and was snatched away by the small pox, February the 11th, 1719, in the forty-third year of his age. (Dr. Clarke's Bib. Dict. VI p. 13.)\n\nMonument de Yu, ou la plus ancienne inscription de la Chine; suivi de trente deux formes d'anciens caractères Chinois avec quelques remarques sur cette inscription et sur ces caractères, par Joseph Hager. Paris, Treuttel & Wurtz, Imp. de Pierre Didot l'aîné au Louvre, 1802, folio.\n\n\"Les numéros mis aux 32 sortes d'écritures répondent à ceux des volumes de l'édition chinoise, et par conséquent aux explications qu'Amiot a extraites pag. 126 et suiv. de l'éloge de Moukden. J'ai mis les noms chinois et mandchoux dans mon exemplaire\" (Note de M. Klaproth. Vide hie Cat.)\n\nDescription des Médailles Chinoises du Cabinet Impérial de France, précédée d'un Essai de Numismatique chinoise avec des Éclaircissements sur le Commerce des Grecs avec la Chine, et sur les Vases précieux qu'on y trouve encore. par J. Hager. Paris, Imp. Imp. an xiii, 1805, 4°\n\nEssay on the Architecture of the Hindús by Ram Ráz. London, 4°, 1834, (2 copies.)\n\nThe Early History of Egypt from the Old Testament, Herodotus, Manetho, and the Hieroglyphical Inscriptions by Samuel Sharpe. London, Edward Moxon, 1886, 8°\n\nRudiments of a Vocabulary of Egyptian Hieroglyphics by Samuel Sharpe. London, Edward Moxon, 1837, 8°\n\nOperations carried on at the Pyramids of Gizeh in 1837: with an Account of a Voyage into Upper Egypt and an Appendix by Colonel Howard Wyse. London, 1840-1842, 3 vols. 4°\n\nThe Antiquities of Egypt; with a particular Notice of those that illustrate the Sacred Scriptures. London, Religious Tract Society, 1841, 8°\n\nGuide to Northern Archaeology by the Royal Society of Northern Antiquaries of Copenhagen edited for the use of English Readers by the Right Honourable the Earl of Ellesmere. London, James Bain, 1848, 8°\n\nA Dissertation on the Ancient Chinese Vases of the Shang Dynasty from 1743 to 1496, B.C., by P. P. Thoms. London, 1851, 8°, 68 pages.\n\nReviewed by Dr. Williams in the Ch. Rep. XX, p. 489.\n\nThis Work of Thoms has been published in the Journal of the R. As. Society (I. 57 et seq.—213 et seq.; II. 166 et seq.—276 et seq.) under the Title of \"Description of Ancient Vases; with Inscriptions illustrative of the History of the Shang Dynasty of Chinese Sovereigns, who reigned from about 1700 to 1112 B.C.\" Translated from the original Work entitled Po-koo-too, by Peter Perring Thoms, Esq.\"\n\n\"Mr. Thoms, as our readers doubtless know, resided in Macao for several years, engaged by the E. I. Comp. in carrying Dr. Morrison's Dict. of the Chinese Language through the Press.\"—Ch. Rep. XX. 489.\n\nA Popular Account of the Ancient Egyptians, revised and abridged from his larger Work, by Sir J. Gardner Wilkinson...... 2 vols. 8°, John Murray, 1864.\n*458 The Egyptians in the Time of the Pharaohs being a Companion to the Crystal Palace Egyptian Collections by Sir J. Gardner Wilkinson......to which is added an Introduction to the Study of the Egyptians Hieroglyphs by Samuel Birch. London, 1857, 8°\n\n*459 The Monuments of Assyria, Babylonia, and Persia: with a new Key for the Recovery of the lost Ten Tribes by the Rev. Charles Forster...... London, Richard Bentley, 1859, 8°\n\n460 Notice raisonnée d’un traité médical datant du XIVe siècle avant notre ère et contenu dans un Papyrus hiératique du Musée royal (Dép. des Antiq. Egypt.) de Berlin publiée par le Dr. Henri Brugsch. Leipzig, Brockhaus, 1863, 8°\n\n461 Études Egyptologiques—Étude sur un Rouleau magique du Musée de Leide—Traduction analytique et commentée du Pap. 348 par W. Pleyte. Leide, F.J. Brill, 1866, 8°\n\n462 Grundplan des Grabes König Ramses IV in einem turiner papyrus von Richard Lepsius. Berlin, 1867, 4°\n\n463 Älteste Texte des Todtenbuchs nach sarkophagen des Alteaegyptischen Reichs im Berliner Museum herausgegeben von R. Lepsius. Berlin, Wilhelm Hertz, 1867, imp. 4°\n\n464 Deux Papyrus hiératiques du Musée de Turin publiés en Fac-Simile par J. Lieblein, avec la Traduction et l’analyse de l’un de ces papyrus par M. F. Chabas. Christiania, 1868, 8°\n\n465 Tree and Serpent Worship: or illustrations of Mythology and Art in India in the First and Fourth Centuries after Christ from the Sculptures of the Buddhist Topes at Sanchi and Amravati prepared under the authority of the Secretary of State for India in Council with introductory Maps and Descriptions of the Plates by James Fergusson, Esq. London, India Museum, 1868, imp. 4°\n\n466 Illustrations of Ancient Buildings in Kashmir, prepared under the authority of the Secretary of State for India in Council from Photographs, Plans, and Drawings taken by order of the Government of India by Henry Hardy Cole, R. E. London, India Museum, 1869, imp. 4°\n\nVI. Modern History.\n\nA—Europe.\n\n*467 An Historico—geographical Description of the North and Eastern Parts of Europe and Asia; but more particularly of Russia, Siberia, and Great Tartary... together with an entire new Polyglot Table of the Dialects of 82 Tartarian Nations, and a Vocabulary of the Kalmuck-Mungolian Tongue.... written originally in High German by Mr. Philip John von Strahlenberg.... now faithfully translated into English. London, 1738, 4°\n\nPub. in German, Stockholm, 1730, 4°\n\n468 A Manual of the History of the Political System of Europe and its Colonies from its Formation at the close of the fifteenth Century to its re-establishment upon the Fall of Napoleon by A. H. L. Heeren, Translated from the fifth German Edition. London, Henry G. Bohn, 1846, 8°\n\n469 Sixth Report of the Post-master General on the Post-office. London, 1860, 8°\n\n470 Recueil de Lois, Résolutions, Circulaires, etc., concernant le Commerce et la Navigation du Royaume de Norvège, publié à l’usage des Consuls des Royaumes Unis par le Ministre de l’Interieur. Christiania, 1861, 4°\nB—Asia.\n\n1 Asia Generally.\n\n471 Asia, sive Historia universalis Asiaticarum gentium et rerum domi forisque gestarum, a cujusque origine ad hæc tempora mixti passim sacri profanique Ritus—auctore Jo. Baptista Gramaye. Antverpia, 1604, 4°\n\n*472 Anecdotes chinoises, japonaises, siamoises, tonquoises, etc.; dans lesquelles on s'est attaché principalement aux Moeurs, usages, coutumes et religions de ces différents peuples de l'Asie. Paris, Vincent, 1774, 8°\n\n473 Lettres chinoises, indiennes, et tartares à Monsieur Paw, par un Benedictin avec plusieurs pièces intéressantes. Paris, 1776, 8°\n\n*474 Bibliothèque orientale ou Dictionnaire universel contenant tout ce qui fait connaître les Peuples de l'Orient... par Mr. d'Herbelot—à la Haye, 1777-1779, 4 vols. 4°\n\nThe Fourth Vol. contains the \"Continuation par Monsieur Claude Visdelou évêque de Claudiópolis and\" Paroles et Maximes des Orientaux par A. Galland.\"\n\nEditions: Paris 1697 folio—Maastricht 1776 & Supp. (by Visdelou) 1780, 2 parts in one-folio vol.—Abridgement. Paris, 1782, 6 vols. 8°\n\nBarthélemy d'Herbelot was born in Paris in 1625 and died in 1695.\n\nClaude de Visdelou, was born in Brittany the 12th of August 1656. He joined the Society of Jesus in 1670 and came to China in 1687. He was appointed the 12th January 1708 Apostolic Vicar of Kouei-Tcheou and later on Bishop of Claudiópolis. The part he took in the quarrels which divided the various religious bodies in China at that time and the support he gave to Cardinal de Tournon sent by the Pope as a Pacificator compelled him to leave China the 24th June 1709. P. Visdelou then retired to Pontichéry where he died the 14th November 1731.\n\nP. Fontaney was one of the six Missionaries who went to go to China in 1684. They embarked in March 1696, went to Siam, and arrived in China in 1687. His fellow companions were P. P. Jean de Fontaney (b. 17 Feb. 1643—S. J. (1658)—date and place of death unknown.) Jean François Gerbillon (b. at Verdun 21 Jan. 1654—S. J. 1670—d. at Pekin 1707.) Guy Tachard (d. 1694) Lecomte—et Bouvet.\n\n475 Nouveaux Mémoires des Missions de la Compagnie de Jesus dans le Levant. Paris, 1715, 12°\n\n*476 Lettres édifiantes et curieuses écrites des Missions étrangères par quelques Missionnaires de la Compagnie de Jésus. XXV Recueil, Paris, 1741, 12°\n\nParaguay—Etat de la Religion de la Chine en l'année 1738.\n\n*477 Travels of the Jesuits, into various Parts of the World: particularly China and the East-Indies...... translated from the celebrated Lettres édifiantes et curieuses, écrites des Missions étrangères, par les Missionnaires de la Compagnie de Jésus...... to which is now prefixed an Account of the Spanish Settlements in America, with a General Index to the whole Work by Mr. Lockman, 2nd ed. London, 1762, 2 vols. 8°\n\nFirst ed. London, 1743, 2 vols. 8°\n\n*478 Lettres édifiantes et curieuses, écrites des Missions étrangères—Nouvelle édition. Paris, J. G. Mérigot le Jeune, 1780-1811. 26 vols. in 12.\n\nVol. XXII. (Toulouse 1811) belong to the Edition published at Toulouse 1810-11\n,, XXV. do. 26 vols. 12° which is inferior to the Paris edition.\n\nMérigot's Edition was published by the Abbé de Querbenf and comprises also 26 vols. 12°, 1780-1783.\n\nMémoires du Levant Vols. I-V (1780)—Mém. d'Amérique Vols. VI-IX (1781)—Mém. des Indes Vols. X-XV (1781)—Mém. de la Chine Vol. XVI (1781)—Mém. de la Chine, &c. Vols. XVII-XXVI (1781-1811.)\n\n\"La première éd. de ces Lettres (recueillies par les P. P. le Gobien, du Halde et Patouillet) a été impr. à Paris, de 1717 à 1776, en 34 Recueils qui sont ordinairement rel. en 32 vols. in 12. On ne la trouve pas facilement complète; cependant elle n'est pas aussi chère que la nouvelle édition. Il faut y ajouter 9 vol. des Mémoires des missions du Levant. (Brunet.)\nGerman Edition.—Der neue Weltbolit mit allerhand Nachrichten der Missionariorum Soc. Jes. Allerhand so Lehraus Geist-Beiche Brief Schriften und Reis—Beschreibungen, welche von denen Missionarios der Gesellschaft Jesu von beyden Indien, und andern über Meer gelegenen Länden, seit an 1642 biss auf das Jahr 1726 in Europa angelangt Seynd. Jetzt zum erstennal theils aus Handschriftlichen Urkunden, theils aus denen Französischen Lettres édifiantes vertentscht und zusammen getragen, von Joseph Stöcklein gedachter Societät Jesu Priester.\n\nAuderte Edition cum privilegio Cassareo et Superiorum facultate ac indice locupletissimo. Augspurg und Grütz in Verlag Philipp Martin und John Veith seel. Erben 1728, 36 vol. folio.\n\nP. Stöcklein died after the publication of the 24th vol. and his work was continued successively by P. P. Charles Meyer, Pierre Probst, and François Keller. This collection contains 723 letters or articles.\n\n*479 Nouvelles des Missions orientales reçues au Séminaire des Missions étrangères à Paris, en 1782, 1791, 1792. Pouvant servir de suite aux Lettres édifiantes des Missionnaires de la Compagnie de Jésus. Liège, 1794, in 12°.\n\n*480 Nouvelles des Missions orientales reçues à Londres par les Directeurs du Séminaire des Missions étrangères en 1793, 1794, 1795 et 1796 pouvant servir de suite aux Lettres édifiantes des Missionnaires de la Compagnie de Jésus. Londres, 1797, in 12°.\n\n481 Nouvelles Lettres édifiantes des Missions de la Chine et des Indes Orientales. Paris, Adrien Le Clere, 1818-1823, 7 vols. 12°\n\n8 vols. were published.\n\n*482 Vol. V of the above work, Paris, 1820.\n\n*483 Moreeaux choisis des Lettres édifiantes et curieuses, écrites des Missions étrangères…… par Antoine Caillot—4e. ed. Paris, Brunot-Labbe, 1828, 2 vols. 12°\n\n*484 Mémoires relatifs à l'Asie, contenant des Recherches historiques, géographiques et philologiques sur les Peuples de l'Orient; par M. J. Klapproth, Membre du Conseil de la Société asiatique de Paris. Paris, Dondey-Dupré, 1824-26-28, 8 vols. 8°\n\n*485 Mélanges Asiatiques, ou Choix de morceaux critiques et de Mémoires relatifs aux Religions, aux Sciences, aux Coutumes, à l'Histoire et à la Géographie des Nations orientales; par M. Abel-Remusat. Paris, Dondey-Dupré, 1825-26, 2 vols. 8°\n\n*486 Nouveaux Mélanges asiatiques, ou Recueil de morceaux de critique et de mémoires relatifs aux Religions, aux Sciences, aux Coutumes, à l'Histoire et à la Géographie des Nations orientales par M. Abel-Rémusat. Paris, Schubart et Heideloff, 1829, 2 vols. 8°\n\n*487 Mélanges posthumes d'Histoire et de Litterature orientales par M. Abel-Rémusat publiés sous les auspices du Ministère de l'instruction publique. Paris, Imp. Roy., 1848, 8°\n\n*488 Zeitschrift für die Kunde des Morgenlandes herausgegeben von H. Ewald, C. v. d. Gabelentz, J. G. L. Kosegraten, Ch. Lassen, C. F. Neumann, E. Rüdiger u. F. Rückert. Göttingen, 8 vols. 8°, 1837-40.\n\n2 Miscellaneous Works on different Countries of Asia.\n\n*489 Inde, Chine et Japon ou Nouveau Tableau anecdotique de la religion, des moeurs, usages et coutumes de ces Contrées lointaines. Paris, 12°\n\n*490 De Regio Persarum Principatu Libri tres. Ex adversariis Viri clarissimi Barnaba Brissonii Senatus Parisiensis Præsidis. Editio secunda, Parisis, 1599, sm. 8°\n491 History of the Indian Archipelago containing an Account of the Manners, Arts, Languages, Religions, &c., by John Crawfurd, F.R.S. A. Constable & Co., Edinburgh, 1820, 3 vols. 8°\n\n*492 The Dynasty of the Kajars, translated from the Original Persian Manuscript presented by his Majesty Faty Aly Shah to Sir Harford Jones Brydges, Bart...... to which is prefixed a succinct Account of the History of Persia, previous to that Period...... London, John Bohn, 1888, 8°\n\n*493 The Shajrat ul Atrak, or Genealogical Tree of the Turks and Tartars; translated and abridged by Col. Miles. London, Wm. H. Allen & Co., 1888, 8°\n\n494 Chronique de Abou-Djafar-Mohammed-Ben-Djarir—Ben-Yezid Tabari traduite sur la version persane d'Abou-Ali-Mohammed-Bel'ami, d'après les Manuscrits de Paris, de Gotha, de Londres et de Canterbury par M. Hermann Zotenberg. Paris, Imp. Imp. Or. Trans. Fund, 1867-69, 2 vols. 8°\n\n8 Cisgangetic and Transgangetic India, &c.\n\n495 Tunchinensis Historiae libri duo, quorum altero status temporalis hujus regni, altero mirabiles evangelicae prædications progressus referuntur coptice per patres Societatis Jesu ab anno 1627 ad annum 1646 Authore P. Alexandro de Rhodes. Lugduni, 1652, 4°\n\n*496 Histoire générale de l'Empire du Mogol depuis sa fondation jusqu'à présent sur les Mémoires portugais de M. Manouchi, Vénitien, par le R. P. François Catron, de la Compagnie de Jésus. Paris, Jean de Nully, 1715, 4°\n\nP. F. Catron was born in Paris 1659—S. J. 1677—d 1737.\n\nAlso, La Haye, Guillaume de Voys, 1708, 4°\n\n*497 An Account of the Kingdom of Nepal and of the Territories annexed to this Dominion by the House of Gorkha by Francis Hamilton (formerly Buchanan) M.D. Edinburgh, 1819, 4°\n\n498 A View of the History, Literature, and Religion of the Hindoos...... by the Rev. W. Ward—3rd ed. London, 1817-1820, 4 vols. 8°\n\nFirst ed. Serampore 1811, 4°—Sec. ed. 1815, 4° Serampore—New ed. London, Kingsbury, 1822, 3-vols. 8°\n\n499 Affairs of the East India Company, 16 vols. 4°\n\n—Report from the Select Committee of the House of Lords appointed to inquire into the Present State of the Affairs of the East-India Company, and into the Trade between Great-Britain, the East-Indies, and China together with the Minutes of evidence and an Appendix. London, printed by order of the Hon. Court of Directors, 4°, 1830.\n\n—Appendix 4°, 1830.\n\n—Papers relating to the Financial Accounts of the East India Company.—Papers relat. particularly to the China Trade carried on by the Company and other British subjects.—Pap. relat. more especially to the Tea Trade.—Pap. relat. to the Trade carried on by the Americans and other Foreign Nations with India, China, and the Eastern Islands.—Pap. relat. to the cultivation of Coffee, Cotton, and Tobacco in India.—Pap. relat. to the Trade with India and China.—Pap. relat. to the Finances of the East-India Company, abroad and at home.—Glossary of Oriental Terms.\n\n—Report from the Select Committee of the House of Commons. London, 4°, 1830.\n\n—Second Report. London, 4°, 1830.\n\n—Third Report. London, 4°, 1832.\n—Appendices to the Third Report, London, 1832, 4°\n\nAccounts and Papers—China Papers—External and Internal Commerce of Bengal, Madras, and Bombay—Administration of Monopolies: Opium and Salt—The establishment of Legislative Councils.\n\n—Minutes of evidence taken before the Select Committee of the House of Commons on the affairs of the East-India Company I Public—Appendix London, 4° Jan. 1833.\n\n—Minutes II Finance and Accounts—Trade—Appendix Part I. London, 4° Jan. 1833.\n\n—Appendix—Finance and Accounts—Trade. Part II Commercial. London, 1838, 4°\n\n—Minutes….. III Revenue. London, Jan. 1838, 4°\n\n—Appendix and Index. Ibid.\n\n—Minutes….. IV Judicial. Ibid.\n\nAppendix and Index.\n\n—Minutes….. V Military. Ibid.\n\nAppendix and Index.\n\n—Minutes….. VI Political or Foreign. Ibid.\n\nAppendix and Index.\n\n—Report from the Select Committee of the House of Commons. Ibid.\n\nGeneral Appendix and Index.\n\n—Papers respecting the Negotiation with his Majesty's Ministers on the subject of the East India Company's charter and the Government of his Majesty's Indian Territories, for a further term after the 22nd April 1834. Ibid.\n\n500 Oriental Memoirs: a Narrative of Seventeen years Residence in India, by James Forbes 2nd ed. revised by his Daughter the Countess de Montalembert. London, 1834, 2 vols. 8°\n\n501 Illustrations to Oriental Memoirs by James Forbes with explanatory Notices. London, Bentley, 1834, 4°\n\nThis is an Abridgment of the work published in 1813, 4 vols. 4°\n\n*502 Fragments Arabes et Persans inédits relatifs à l'Inde, antérieurement au XIe siècle de l'ère Chrétienne, recueillis par M. Reinaud. Paris, Imp. Roy., 1845, 8°\n\n*503 Indische Skizzen—Vier Bisher in Zeitschriften Zerstreute vorträge und Abhandlungen von Albrecht Weber. Berlin, 1857, 8°\n\n504 Ceylon, Skizzen seiner bewohner, seines thier—und pflanzenlebens und untersuchungen des Meeresgrundes nahe der küste, von Baron Eugen von Ransonnet-Villez. Braunschweig, 1868, folio.\n\nI China and Chinese Possessions.\n\n(History, Customs, &c.)\n\n505 Histoire du grand Royaume de la Chine situé aux Indes Orientales..... Jean Arnaud, 1606, 8°\n\n*506 Imperio de la China. I. Cultura evangelica en el, por los Religios de la Compania de Jesus—Compuesto por el Padre Alvarez Semmedo...... Publicado por Manuel de Faria i Sousa...... Segunda Impression. Juan Sanchez in Madrid, 1642, 8°\nXXV. P. Alvarus Semedus Lusitanus, eodem anno (1613) venit propagatum S. Legem in Hangchou, Metropoli Provinciae Chekiang, deinde in Nanking, tandem redux in Provinciae Quangtung obiit, 1658. Sepultus est Macai. Ph. Couplet C.P.S.J. p. 109.\n\nAlvarez de Semedo was born at Nizza (Portugal) in 1585 and joined the Society of Jesus in 1602.\n\n*507 The History of that Great and Renowned Monarchy of China, lately written in Italian by F. Alvarez Semedo, a Portuguese...... London, E. Tyler, 1655, folio.\n\n*508 Histoire universelle de la Chine, par le P. Alvarez Semedo, Portugais, avec l'Histoire de la guerre des Tartares, contenant les Révolutions arrivées en ce grand Royaume, depuis quarante ans par le P. Martin Martini—traduites nouvellement en français. Lyon, Hierosme Prost, 1667, 4°\n\n*509 Imperio de la China, y Cultura evangelica en el, por los Religiosos de la Compañía de Jesús Sacado de las Noticias del Padre Álvaro Semedo de la propia Compañía por Manuel de Faría y Sousa. Lisboa occidental, 1791, folio.\n\n*510 Rerum morumque in regno Chinensi maxime notabilium Historia per R. P. M. Joannem Gonzalez de Mendosa ex Hispanica lingua in latinam transtulit F. Joachimus Brulius. Antverpiae, 1655, 4°\n\n*511 Martini Martini, e Societate Jesu, Sinice Historiae Decas prima, res à gentis origine ad Christum natum in extrema Asia, sive Magno Sinarum Imperio gestas complexa. Amstelodami, Joannem Blaeu, 1659, 8°\n\nLV. P. Martinus Martini Tridentinus Zunzengi Imperatoris anno 16 (1643) venit predicatum S. Legem in Provincia Chekiang, dein perrexit in Aulam, inde regressus in Provinciae Fokien & Quangtung, denique redit in Chekiang, ubi Xuncheh anno 15 (1661) diem oblit, sepultus est in loco Fangchin dicto (Couplet C. P. S. J.) p. 118.\n\nP. M. Martini was born at Trent in 1614 and joined the Society of Jesus in 1631. He died 6th June 1661.\n\nAlso Monachii, Straubius, 1658, 4°\n\n512 Athanasii Kircheri e Soc. Jesu China Monumentis, qua sacris qua profanis, nec non variis naturae & artis spectaculis, aliarnaque rerum memorabilium argumentis illustrata, auspiciis Leopoldi Primi, roman. imper. semper Augusti, Munificentissimi Mecenatis. Amstelodami, 1667, folio.\n\n\"The plates in the Latin copies are superior to those of the French. Struve asserts the whole to have been produced by Kircher's imagination, and that he was never in China.\" Pinkerton's Travels Supp. p. 150.\n\nAthanasius Kircher, was born in 1602, at Geysen, near Fulda. After teaching philosophy and Oriental languages at Wurzburg he retired, on account of the war (the Thirty Years' war) then raging in Germany, to Avignon and subsequently to Rome (1636.) He died in 1680.\n\n*513 La Chine d'Athanase Kircher de la Compagnie de Jesus, illustrée de plusieurs Monuments tant sacrés que profanes, et de quantité de recherches de la Nature et de l'Art...... avec un Dictionnaire Chinois et Francais, lequel est très rare et qui n'a pas encore paru au jour. Traduit par F. S. Dalquiè. Amsterdam, 1670, folio.\n\n*514 Palafax—La Conqueste de l'Empire de la Chine par les Tartares, trad. de l'Espagnol. Paris, Vitre, 1670, 8°, (no title page.)\n\n*515 Historia Tartaro-Sinica nova authore P. Francisco de Rougemont Societatis Jesu. Lovanii, M. Hullegarde, 1673, 8°\n\nLXXVIII. P. Franciscus de Rougemont Belgae, eodem anno (1659) venit predicatum S. Legem in Provincia Nanking. Imperatoris Kanghi anno 15 (1676) oblit in oppido Tejeng, sepultus extra muros Civitatis Crangao in monte yuxan dicto. Ph. Couplet Cat. Pat. Soc. Jesu, p. 122.\n\nF. de Rougemont was born at Maestricht in 1624 and joined the Soc. of Jesus in 1641. He died 4th November 1676.\n\n[1655 — 1678]\n*516 Tratados historicos, politicos, eticos y religiosos de la Monarchia de China por el P. Maestro Fr. Domingo Fernandez Navarette. 1676, Madrid, Anisson, folio.\n\n\"This is a Work of great scarcity and of considerable value. The Author being sent to Rome to remonstrate for the Chinese Missionaries against their customary mode of conversion, they induced the Inquisition to suppress the second volume, and to prohibit the third from going to the Press. Pinkerton's Travels. Sup. p. 151.\n\nP. Ferdinand Navarette was born in Castille about 1620. He joined the Dominican Monks—and came to China in 1659, where he resided till 1672 when he was appointed Archbishop of Santo Domingo. He died in 1689.\n\n*517 A New History of China containing a Description of the most considerable Particulars of that vast Empire written by Gabriel Magaillans of the Society of Jesus done out of French. London, Thomas Newborough, 1688, 8°\n\nTranslated by John Ogilby.\n\nLIII. P. Gabriel de Magalhaes Lusitanus, venit eodem anno (1640) praedicatum S. Legem in Provincia Suchuen, aliisque locis, ubi gravissimis periculis & latronibus defunctus, & sepe a morte imminente creptus, tandem Xungchy Imperatoris anno 5 (1648) in Aulane venit, ubi regios favores sepsum expertus tandem Kanghy Imperatoris anno 16 (1677) diem oblit, Imperator illum dignatus est funebri eloquio, obtulit insuper 200 aureos & magna serica volumina numero 10. ad exequias. Dum adhuc viveret, jusit Imperator effigiem ejus demum & die autem exequiarum legavit & intimos aula Ministris, qui ad imperium functum ad septimum annum, que extra portam Feuching dictam. P. Couplet. Cat. Pat. Soc. Jesu. p. 117-118.\n\nG. de Magalhaens was born near Coimbro in 1609 and joined the Society of Jesus in 1624. His death took place at Pekin the 6th May 1677.\n\n*518 Nouvelle Relation de la Chine...... composée en l'année 1668 par le R. P. Gabriel de Magaillans, de la Compagnie de Jésus, Missionnaire apostolique, et traduite du Portugais par le Sr. B. Paris, Claude Barbin, 1688, 4°\n\n519 Abdalla Beidavei Historia Sinensis Persicè, è geminò Manuscripto edita, Latine quoque redita ab Andrea Mullero Greiffenaggio. Berolini et Jenæ, 1689, 4°\n\nA Chinese Chronicle by Abdalla of Beyza; translated from the Persian, with Notes and Explanations, by S. Weston. London, Clarke, 1820, 8°, (not mentioned by Louwdes.)\n\n50 Copies printed.\n\n*520 Histoire de deux Conquéranrs Tartares, qui ont subjugué la Chine par le R. P. J. D***. (D'Orléans.) Paris, Louis Lucas, 1690, 8°.\n\nAlso Paris, Lucas, 1689, 8°\n\n*521 One vol. 4° containing:\n\n—Louis le Comte. Beschryvinge van het machtige keyserrik China 'sGravenhage, E. Boucquet, 1698.\n\n—J. Bouvet en C. Gobien. Historische Beschryvinge van het magtige keyserrik China. Utrecht, G. Kribber, 1710.\n\n—E. A. Saken—'t Verwaarloosde Formosa of waerachtig verhael. Amsterdam, 1675.\n\nJoachim Bouvet was born at le Mans 18th July 1656, joined the Society of Jesus, 1673, came to China in 1687 and died at Pekin 29th June 1730.\n\nP. Charles Le Gobien was born at St. Malo 1653, died in Paris 1708.\n\n522 Memoirs and Observations...... made in a late Journey through the Empire of China...... by Louis Le Comte, Jesuit...... Translated from the Paris Edition...... Second edition. London, Benjamin Tooke, 1698, 8°\n\n*523 Nouveaux Mémoires sur l'État présent de la Chine par le P. Louis Le Comte de la Compagnie de Jésus, Mathématicien du Roi. Paris, Anisson, 1701, 2 vols. 12°\n\n[1676 — 1701]\nVol. I—4th ed. Vol. II—3rd ed.\nAlso Paris, Anisson, 1696, 2 vols.\n\nLouis Le Comte was born at Bordeaux 10th October 1655, joined the Soc. of Jesus 1671, came to China in 1697, went back to France in 1692 and died at Bordeaux 1729.\n\n*524 Apologie des Dominicains Missionnaires de la Chine ou Réponse au livre du Père Le Tellier, Jésuite, intitulé Défense des Nouveaux Chrétiens, et à l'éclaircissement du P. Le Gobien de la même Compagnie, sur les honneurs que les Chinois rendent à Confucius et aux Morts, 2e. ed. Cologne, 1700, 12°\n\n*525 Description géographique, historique, chronologique, politique et physique de l'Empire de la Chine et de la Tartarie Chinoise…… par le P. J. J. Lemercier, 1735, 4 vols. folio.\n\nOther ed.: La Haye, Schenleer, 1736, 4 vols. 4°. Translated into German, Rostock, Koppe, 1747, 4 vols. 4°.\n\nJ. B. Duhalde was born in Paris in 1674 and died in 1743.\n\n*526 Nouvel Atlas de la Chine, de la Tartarie Chinoise et du Thibet…… par Mr. d'Anville. La Haye, Schenleer, 1737, folio.\n\nCet Atlas fait pour accompagner la Description de la Chine, de Duhalde, édition de la Haye, 4 vols. in 4, est une copie tronquée de l'édition de Paris 10 à 15 fr. On trouve aussi quelquefois séparément les 50 cartes et les 14 gravures de l'Ouvrage du P. Duhalde, tirées en gr. pap. avec un Frontispice particulier au nom de Desanche, Géographe, chez lequel cet atlas ainsi formé se vend 48 fr. (Brunet.)\n\nThe Geographer Jean Baptiste Bourguignon d'Anville was born in Paris in 1697, and died in 1782.\n\n*527 The General History of China—containing a Geographical, Historical, Chronological, Political and Physical Description of the Empire of China, Chinese Tartary, Corea and Thibet…… done from the French of P. Du Halde. London, John Watts, 1786, 4 vols. 8°\n\n*528 A Description of the Empire of China and Chinese Tartary, together with the Kingdoms of Korea and Tibet…… done from the French of P. J. B. du Halde, Jesuit. London, 1788-41, 2 vols. folio.\n\nOther Eng. Ed. 1744, 4 vols. 8°\n\n*529 Designs of Chinese Buildings, Furniture, Dresses, Machines, and Ustensils engraved by…… Mr. Chambers, Architect. London, 1757, folio.\n\n*530 The History of China upon the Plan of Mr. Rollin's Antient History translated from the French. London, 1763, 8°\n\n*531 Chineesche Geschiedems, behelsende de gevallen van den heer Tieh-Chung-U en de jongvrouw Shuey-Ping-Sin. Te Amsterdam, 1767, 8°\n\n*532 Lettres au R. P. Parennin, Jésuite, Missionnaire à Pékin; contenant diverses questions sur la Chine. Nouvelle édition, par M. Dortous de Mairan. Paris, Imp. Roy., 1770, 8°\n\n\"M. de Mairan….. fut un des premiers de ce siècle, qui manifesta ses doutes sur l'origine des Chinois, dans sa lettre au P. Parennin, Jésuite Missionnaire à Pékin, en 1784. Il avoue que la première idée, que les Chinois pourraient être une colonie des Égyptiens, lui était venue de l'Histoire du Commerce et de la Navigation des Anciens, par le savant M. Huet Evêque d'Avranches, qui jette en passant cette proposition, comme un doute.\" La Réponse du P. Parennin à M. de Mairan, du 18 Septembre 1785, se trouve insérée dans le vingt-quatrième volume du Recueil des Lettres édifiantes.\" Mémoires concernant les Chinois. I—vi-vii.\n\nP. Dominique Parennin was born at Grand-Buttey, near Pontarlier (Diocese of Besançon) 1st Sept. 1664, joined the Soc. of Jesus in 1682, and died at Pékin the 27th Sept., 1741.\n\n[1700—1770]\n*583 Recherches philosophiques sur les Egyptiens et les Chinois par Mr. de P*** (Pauw) Berlin, G. J. Decker, 1778, 2 vols. 8°\n\n*584 Philosophical Dissertations on the Egyptians and Chinese translated from the French of Mr. de Pauw, Private Reader to Frederic II, King of Prussia by Capt. J. Thomson. London, 1795, 2 vols. 8° bd. in 1 vol.\n\nCornelius de Pauw was born in 1739 at Amsterdam and died in 1799. He wrote also some Philosophical Dissertations on the Americans (Berlin, 1768-69, 2 vols. 8°), and on the Greeks (Berlin, 1787, 8°)\n\n*585 Mémoires concernant l'histoire, les sciences, les arts, les moeurs, les usages, &c., des Chinois par les Missionnaires de Pékin. Paris, Nyon, 15 vols. 4°, 1776-91, (ex libris Château de Mouchy—Noailles.)\n\nCes Memoires ont été écrits en grande partie par les P. P. Amiot (ou Amyot) et Cibot.\n\nOn trouve dans le Tome X des \"Mémoires concernant les Chinois\" une \"Table Générale des Matières.\" The list of P. Amiot's Works takes nearly fourteen columns of this Table and the list of the contributions of P. Cibot occupies seven columns.\n\nP. Jean Joseph Marie Amyot was born at Toulon the 18th Feb. 1718, joined the Soc. of Jesus in 1737, came to China in 1761 and died at Pekin 9th October 1793.\n\nP. Jean Martial Cibot was born at Limoges 14th Aug. 1727, joined the Society of Jesus 1743, came to China in 1759 and died at Pekin the 8th Aug. 1780.\n\nVoir dans le VIe., vol. des \"Mémoires concernant les Chinois\" \"Mémoire sur la Musique des Chinois tant anciens que modernes; par M. Amiot, Missionnaire à Pékin\" revu par l'Abbé Roussier.\n\n*586 A General Description of China...... translated from the French of the Abbé Grosier. London, G. G. J. and J. Robinson, 1788, 2 vols. 8°\n\n*587 An Historical, Geographical, and Philosophical View of the Chinese Empire; comprehending a Description of the Fifteen Provinces of China, Chinese Tartary, Tributary States; Natural History of China, Government...... by W. Winterbotham to which is added, a copious Account of Lord Macartney's Embassy compiled from original communications. London, J. Ridgway, 1795, 8°\n\n*588 A Complete View of the Chinese Empire exhibited in a Geographical Description of that Country, a Dissertation on its Antiquity, and a genuine and copious Account of Earl Macartney's Embassy from the king of Great-Britain to the Emperor of China. London, G. Cauthorn, 1798, 8°\n\n*589 Costumes de la Chine, représentés en soixante Gravures avec des explications en anglais et en français par George Henry Mason. Londres, 1800, large 4°\n\n*540 China: its Costume, Arts, Manufactures, &c. edited principally from the Originals in the Cabinet of the late M. Bertin; with Observations...... by M. Breton. 4 vols. (bd. in 1), 2nd ed. London, J. J. Stockdale, 1812-1818.\n\n*541 De la Chine, ou Description générale de cet Empire rédigée d'après les Mémoires de la Mission de Pékin...... 8e édition, par l'Abbé Grosier, Bibliothécaire de son Altesse Royale Monsieur. Paris, Pillet et A. Bertrand, 1818-1820, 7 vols. 8°\n\nFirst edition, Paris, 1785, 4°. Sec. ed., Ibid., 1787, 2 vols. 8°\n\nJ. B. Gabriel Alexandre Grosier was born in 1748 and died in 1823.\n\n*542 Miscellaneous Notices relating to China, and our Commercial intercourse with that Country, including a few Translations from the Chinese Language by Sir George Thomas Staunton, Bart. 2nd ed. London, Murray, 1822, 8°\n\n[1778 — 1822]\nMiscellaneous Notices relating to China and our Commercial intercourse with that Country including a few translations from the Chinese Language by Sir George Thomas Staunton. 2nd ed.; enlarged in 1822, and accompanied in 1850, by introductory observations on the Events which have affected our Chinese Commerce during that interval. London, Murray, 1822-50, 8°\n\n*544 Beautés de l'Histoire de la Chine, du Japon et des Tartares…… par Fr. M. de Beaumont. 2e. ed. Paris, Alexis Eymer, 1825, 2 vols. 12° bd. in 1 vol.\n\n*545 The Mulfuzat Timury, or autobiographical Memoirs of the Moghul Emperor Timur, written in the Jagtay Türky language, turned into Persian by Abu Talib Hussyry, and translated into English by Major Charles Stewart. London, Or. Transl. Fund, 1880, 4°\n\n*546 British Relations with the Chinese Empire in 1832—Comparative Statement of the English and American Trade with India and Canton. London, Parbury Allen & Co., 1832, 8°\n\n547 China. An Outline of its Government, Laws, and Policy; and of the British and Foreign Embassies to, and intercourse with that Empire, by Peter Auber. London, 1884, 8°\n\n*548 A Sketch of Chinese History, ancient and modern: comprising a Retrospect of the Foreign intercourse and trade with China, by the Rev. Charles Gutzlaff. London, Smith Elder & Co., 1884, 2 vols. 8°\n\n*549 Journal of a Residence in China and the neighbouring Countries from 1830 to 1833 by David Abeel—revised and reprinted from the American Edition with an introductory Essay by the Hon. and Rev. Baptist Wriothesley Noel, M.A. London, James Nisbet & Co., 1835, 12°\n\n*550 An Historical Sketch of the Portuguese Settlements in China; and of the Roman Catholic Church and Mission in China, by Sir Andrew Ljungstedt—a Supplementary Chapter, descriptive of the City of Canton, republished from the Chinese Repository, with the Editor's permission. Boston, James Munroe & Co., 1836, 8°\n\n*551 The Chinese: a General Description of the Empire of China and its inhabitants by John Francis Davis, Esq. London, Charles Knight & Co., 1836, 2 vols. 12°, bd. in 1.\n\n*552 An Historical and Descriptive Account of China…… by Hugh Murray—John Crawfurd—Peter Gordon—Capt. Thomas Lynn—William Wallace—and Gilbert Burnett. Edinburgh, Oliver & Boyd, 1836, 8 vols. 16°\n\nVide a Review of this Work in the Chinese Rep. V. 193 & VI. 59.\n\n*553 Relation des Mongols ou Tartares par le Frère Jean du Plan de Carpin, de l'ordre des Frères mineurs, Légat du Saint-Siège apostolique, Nonce en Tartarie pendant les années 1245, 1246, 1247, et Archevêque d'Antivari, première édition complète publiée…… par M. d'Avezac. Paris, 1838, 4°\n\nVide Charton's Voyageurs du Moyen Age p. 223.\n\n*554 China opened: or a Display of the Topography, History, Customs…… of the Chinese Empire, by the Rev. Charles Gutzlaff, revised by the Rev. Andrew Reed, D.D. London, Smith Elder & Co., 1838, 2 vols. 12° (bd. in 1 vol.)\n\nThere is at the end of the second volume a List of Cities and Places of which the Latitude and Longitude have been determined by the Jesuits taking the Meridian of Peking as their basis.\n\nReviewed by Dr. S. W. Williams in the Ch. Rep. VIII. 84.\n\n*555 The Fanqui in China in 1836-87, by C. Toogood Downing, Esq., M.R.C.S. London, Henry Colburn, 8 vols. 12° (in 1 vol.)\n\n[1850—1888]\n556 Description of the City of Canton; with an Appendix, containing an Account of the Population of the Chinese Empire, Chinese Weights and Measures. Canton, 1839, 8°, 2nd ed.\n\n*557 Narrative of the late Proceedings and Events in China by John Slade, Editor of the Canton Register. China, Canton Register Press, 1839, 8°\n\n*558 Description de la Chine et des États tributaires de l'Empereur par M. le Marquis de Fortia d'Urban. Paris, Chez l'Auteur, 1839-1840, 3 vols. 12°\n\nTome premier 1839 contenant la Partie Septentrionale—Tome second 1840 contenant les deux Parties Moyennes ou Centrales—Tome troisième 1840 contenant la Partie Méridionale, l'Empire d'Annam et l'Empire Birman.\n\n*559 Histoire antédiluvienne de la Chine ou Histoire de la Chine jusqu'au déluge d'Yao l'an 2298 avant notre ère par M. le Marquis de Fortia d'Urban. Paris, 1840, 2 vols. 12°\n\n*560 Le Chine et l'Angleterre ou Histoire de la Déclaration de guerre faite par la reine d'Angleterre à l'Empereur de la Chine par M. le Marquis de Fortia d'Urban. Paris, 1840, 12°\n\nAgricole-Joseph-François, marquis de Fortia d'Urban, was born at Avignon in 1756 and died in 1843.\n\n*561 China and its Resources, and Peculiarities, physical, political, social, and commercial; with a View of the Opium question and a Notice of Assam by Robert Mudie. London, Grattan & Gillert, 1840, sm. 8°\n\n*562 Discours sur l'Empereur Kien-Long, suivi des Extraits de six volumes publiés sur l'Empire de la Chine par M. le marquis de Fortia d'Urban. Paris, 1841, 12°\n\n*563 China, or Illustrations of the Symbols, Philosophy, Antiquities, Customs, Superstitions, Laws, Government, Education and Literature of the Chinese derived from original sources and accompanied with drawings from native works by Samuel Kidd. London, Taylor & Walton, 1841, 8°\n\n\"The Author of this Work was a Missionary at Malacca seven years, from whence he returned to England in 1832, and was afterwards appointed Professor of Chinese in University College, London. Ch. Rep. XVIII. 419.\"\n\n*564 The Chinese as they are: their moral, social and literary character; a new Analysis of the Language, with succinct Views of their principal Arts and Sciences by G. Tradescant Lay. London, William Ball & Co., 1841, 8° (2 copies.)\n\n*565 China en de Chinezen, door J. F. Davis, opper commissaris van wijlen zijne gr. Britt. Majestiet in China, naar de laatste uitgave, waarin de geschiedenis van het handelsverkeer met de engelschen tot op dit ogenblik toe behandeld wordt uit het engelsch vertaald door Mr. C. J. Zweerts. Te Amsterdam, Bij G. J. A. Beijerinck, 1841, 3 vols. 8°\n\n*566 Ten Thousand Things relating to China and the Chinese; an Epitome of the Genius, Government, History, Literature, &c., of the people of the Celestial Empire together with a Synopsis of the Chinese Collection by William B. Langdon, Esq. London, 1842, 8°\n\n*567 A Complete View of the Chinese Empire; exhibited in a geographical Description of that Country, a Dissertation on its Antiquity, and a genuine and copious Account of Earl Macartney's Embassy from the King of Great Britain to the Emperor of China. London, J. S. Pratt, 1842, in 32.\n\n*568 Narrative of the Second Campaign in China by Keith Stewart Mackenzie. London, Richard Bentley, 1842, 12°\n\n[1839 — 1842]\n*569 Sketches of China and the Chinese by Auguste Borget. *London, Tilt & Bogue, 1842, folio.*\n\n*570 Narrative of the Expedition to China, from the Commencement of the War to its termination in 1842, by Commander J. Elliot Bingham, R.N. *2nd ed. London, Henry Colburn, 1843, 2 vols. 12° in 1.*\n\n*571 The War in China. Narrative of the Chinese Expedition from its formation in April 1840 to the treaty of peace in August 1842, by D. McPherson, M.D. *3rd ed. London, Saunders & Otley, 1843, 8° (2 copies).* \n\n*572 Doings in China. Being the personal Narrative of an Officer engaged in the China Expedition from the recapture of Chusan in 1841 to the Peace of Nankin in 1842, by Lieut. Alexander Murray. *London, Richard Bentley, 1843, 8°*\n\n*573 The Closing Events of the Campaign in China: the Operations in the Yang-tze-kiang, and the Treaty of Nanking, by Capt. Granville G. Lock, R.N. *London, John Murray, 1843, 12°*\n\n*574 Schetsen en Tafereelen uit China door J. F. Davis. *Groningen, W. van Boeckeren, 1843, 2 vols. 8°*\n\n*575 Mémoire sur la Constitution politique de la Chine au XIIe siècle avant notre ère par M. Ed. Biot—extrait du Tome II de la 1ere Série des Mémoires présentés par divers savants à l'Academie des Inscriptions et Belles-Lettres. *Paris, Imp. Roy., 1844, 4°*\n\n*576 A History of China from the earliest Records to the treaty with Great Britain in 1842 by Thomas Thornton, Esq., (in 2 vols. 8°) Vol. I. *London, Wm. H. Allen & Co., 1844.*\n\n*577 An Aide-de-Camp's Recollections of Service in China, a Residence in Hong-kong and Visits to other Islands in the Chinese seas, by Captain Arthur Cunynghame. *London, 1844, Saunders & Otley, 2 vols. 12° (bd. in 1.)*\n\n*578 The Chinese War: an Account of all the Operations of the British Forces from the commencement to the Treaty of Nanking by Lieutenant John Ouchterlony, F.G.S. *London, Saunders & Otley, 1844, 8°*\n\n*579 Narrative of the Voyages and Services of the Nemesis, from 1840 to 1843; and of the combined naval and military operations in China: comprising a complete Account of the Colony of Hongkong, and remarks on the character and habits of the Chinese from notes of Commander W. H. Hall, R.N., with personal observations, by W. D. Bernard, Esq., A.M., Oxon. *London, Henry Colburn, 1844, 2 vols. 8°*\n\n*580 The Nemesis in China, comprising a History of the late War in that Country; with a complete Account of the Colony of Hongkong from the Notes of Captain W. H. Hall, R.N., and the personal observations of W. D. Bernard, Esq., A.M., Oxon. *Henry Colburn, 1846, 3rd ed. 12°*\n\n*581 The History of China and India, pictorial and descriptive by Miss Corner...... *London, Dean & Co., 1846, 8°*\n\n*582 China; political, commercial, and social; in an official Report to Her Majesty's Government by R. Montgomery Martin. *London, James Madden, 1847, 2 vols. 8°*\n\n*588 Gützlaff's Geschichte des Chinesischen Reiches...... von Karl Friedrich Neumann. *Stuttgart und Tubingen, 1847, 8°*\n584 Essai sur l'histoire de l'instruction publique en Chine et de la Corporation des Lettrés depuis les anciens temps jusqu'à nos jours..... par Edouard Biot. Paris, B. Duprat, 1847, 8°\n\n*585 Desultory Notes on the Government and people of China, and on the Chinese Language, illustrated with a Sketch of the Province of Kwangtung, shewing its Division into Departments and Districts by Thomas Taylor Meadows. London, Wm. H. Allen & Co., 1847, 8°\n\n*586 Five Years in China; from 1842 to 1847, with an Account of the Occupation of the Islands of Labuan and Borneo by Her Majesty's Forces by Lieutenant F. E. Forbes, R.N. London, Richard Bentley, 1848, 8°\n\n*587 China, during the War and since the Peace by Sir John Francis Davis, Bart., F.R.S., late Her Majesty's Plenipotentiary in China; Governor and Commander-in-chief of the Colony of Hongkong. London, Longman, 1852, 2 vols. 12° (bd. in 1 vol.)\n\n*588 The Life of Taou-Kwang, late Emperor of China; with Memoirs of the Court of Peking; including a Sketch of the principal events in the History of the Chinese Empire during the last fifty years by the late Rev. Charles Gutzlaff. London, Smith Elder & Co., 1852, 12°\n\n589 Chine ou Description historique, géographique, et littéraire de ce vaste Empire, d'après des documents chinois: Première Partie, comprenant un Résumé de l'histoire et de la civilisation chinoises depuis les temps les plus anciens jusqu'à nos jours par M. G. Pauthier. Seconde Partie, Arts, Littérature, Moeurs, etc., par M. Bazin. Paris, Didot, 1853, 2 vols. 8°\n\n*590 Lewchew and the Lewchewans; being a Narrative of a Visit to Lewchew, or Loochoo, in October 1850, by George Smith, D.D., Lord Bishop of Victoria. London, T. Hatchard, 1853, 8°.—95 pages bound with\n\n—The Seventh Report of the Loochoo Mission Society for 1851-52. London, 1853, 8°, p. 32.\n\n—Loochoo Mission: Extracts from the Journal of the Society's Missionary, Dr. Bettelheim, 1850-52. London, n. d. 8°, p. 61.\n\n*591 The History of the Great and Mighty Kingdom of China and the Situation thereof compiled by the Padre Juan Gonzales de Mendoza and now reprinted from the early translation of R. Parke edited by Sir George T. Staunton, Bart., with an Introduction by R. H. Major, Esq. London, printed for the Hakluyt Soc., 1853, 8°\n\n*592 L'insurrection en Chine depuis son origine jusqu'à la prise de Nankin par M. M. Callery et Yvan. Paris, Lib. nouvelle, 1858, 12°\n\n*593 History of the Insurrection in China; with Notices of the Christianity, Creed, and Proclamations of the insurgents by M. M. Callery and Yvan. Translated from the French with a supplementary Chapter, narrating the most recent events, by John Oxenford. 2nd ed. London, Smith Elder & Co. 1858, sm. 8°\n\n*594 A History of China to the present Time including an Account of the Rise and Progress of the present religious insurrection in that Empire. London, R. Bentley, 1854, sm. 8°\n\n*595 Les Chinois pendant une période de 4458 années—Histoire, Gouvernement, Sciences...... par H. de Chavannes de la Giraudière. 2e. ed. Tours, Mame, 1854, 8°\n*596 Impressions of China, and the present Revolution: its progress and prospects by Capt. Fishbourne, Commander of the Hermès, on her late visit to Nankin. Seeley, Jackson & Halliday, London, 1855, 12°\n\n*597 Eight months' Journal kept on board one of her Majesty's Sloops of war during visits to Loochoo, Japan, and Pootoo, by Alfred Laurence Halloran, Master, R.N. London, Longman, 1856, 8°\n\n*598 The Chinese and their Rebellions, viewed in connection with their national philosophy, ethics, legislation, and administration to which is added an Essay on civilisation and its present state in the East and West by Thomas Taylor Meadows. London, Smith Elder & Co., 1856, 8°\n\n*599 The Middle Kingdom; a Survey of the Geography, Government, Education, Social Life, Arts, Religion, &c., of the Chinese Empire and its inhabitants, by S. Wells Williams. 4th ed. New York, Wiley & Hulsted, 1857, 2 vols. 12°\n\n*600 Life in China by Rev. William C. Milne, M.A. London, G. Routledge & Co., 1857, 8°\n\n*601 Le Christianisme en Chine en Tartarie et au Thibet par M. Huc, ancien missionnaire apostolique en Chine, 4 vols 8° bound in 8 vols.\n\nTome Premier, Paris, 1857—Depuis l'apostolat de Saint Thomas jusqu'à la découverte du Cap de Bonne Espérance. Tome Second, Paris, 1857—Depuis le passage du Cap de Bonne Espérance jusqu'à l'établissement de la dynastie Tartare-Mantchoue en Chine. Tome Troisième, Paris, 1857—Depuis l'établissement de la dynastie Tartare-Mantchoue jusqu'à la mort de l'empereur Khanghi. Tome Quatrième Paris, 1858—Depuis la mort de l'empereur Khanghi jusqu'au traité de Tien-Tsin en 1858.\n\n*602 La Vie réelle en Chine par le Révérend William C. Milne traduite par André Tasset avec une introduction et des notes de M. G. Pauthier. Paris, Hachette, 1858, 12°\n\n*603 Arbeiten der kaiserlich Russischen Gesandtschaft zu Peking über China, sein Religion,.... aus dem Russischen nach dem in St. Petersburg 1852-57 veröffentlichten original von Dr. Carl Abel und F. A. Meklenburg. Berlin, 1858, 2 vols. 8° bd. in 1 vol.\n\n*604 L'Angleterre, la Chine et l'Inde, par Don Sinibaldo de Mas, Envoyé extraordinaire et Ministre plénipotentiaire de la reine d'Espagne en Chine. Paris, Jules Tardieu, 1858, 8°\n\n*605 Expédition des mers de Chine. Rapports adressés à S. Exc. le Ministre de la Guerre par le Capitaine Labbe, Chef du génie du corps français publiés par les soins du dépôt de la guerre. Paris, Imp. Imp., 1858, 8°\n\n*606 China: being \"The Times\" special Correspondence from China in the years 1857-58, with corrections and additions by the author, George Wingrove Cooke. New ed. London, Routledge, 1859, 8°\n\n*607 Organisation militaire des Chinois ou de la Chine et ses armées suivi d'un aperçu sur l'administration civile de la Chine par P. Dabry. Paris, Henri Plon, 1859, 8°\n\n*608 The Past and Future of British Relations in China by Captain Sherard Osborn, C.B., R.N. William Blackwood, Edinb. & London, 1860, 8°\n\n*609 Société orientale de France—Mémoire adressé à l'empereur Hien-Foung actuellement régnant par un Lettré chinois sur la conduite à suivre avec les puissances européennes traduit du chinois par M. G. Pauthier. Paris, 1860, ppt. 8°\n\n*610 Pictures of the Chinese, drawn by themselves described by Rev. R. H. Cobbold, M.A., Rector of Broseley, Salop, late Archdeacon of Ningpo. London, Murray, 1860, 8°\n*611 The Englishman in China. London, Saunders & Otley, 1860, 12°\n\n*612 Twelve years in China. The People, the Rebels, and the Mandarins by a British Resident (John Searth.) Edinburgh, Thomas Constable & Co., 1860, 8°\n\n*613 Narrative of the North China Campaign of 1860...... by Robert Swinhoe. London, Smith Elder & Co., 1861, 8°\n\n*614 The Taeping Rebellion in China; a Narrative of its rise and progress, based upon original documents and information obtained in China by Commander Lindesay Brine. London, Murray, 1862, 12°\n\n*615 Narrative of the War with China in 1860 to which is added the Account of a short residence with the Taiping Rebels at Nankin and a voyage from thence to Hankow by Lieut.-Colonel G. J. Wolseley. London, Longman, 1862, 8°\n\n*616 Expédition de Chine par Paul Varin. Paris, Michel Lévy, 1862, 8°\n\n*617 How we got to Pekin. A Narrative of the Campaign in China of 1860 by the Rev. R. J. L. M'Ghooe. London, Richard Bentley, 1862, 8°\n\n*618 China from a Medical Point of view in 1860 and 1861, to which is added a Chapter on Nagasaki as a Sanitarium by Charles Alexander Gordon, M.D.C.B. London, John Churchill, 1863, 8°\n\nSeven Chapters out Thirteen composing the work are especially devoted to Tientsin.\n\n*619 Personal Narrative of Three Years' Service in China by Lieut.-Colonel Fisher, C.B., Royal Engineers. London, Richard Bentley, 1863, 8°\n\n*620 The numerical Relations of the Population of China during the 4000 years of its historical existence; or the Rise and Fall of the Chinese Population, by T. Sacharoff, Member of the Imp. Russian Embassy in Peking, translated into English by the Rev. W. Lobcheid also the Chronology of the Chinese, from the Mythological times up to the present Ruler. Hongkong, Shortrede, [1864], ppt. 8°, VII-89 pag.\n\n*621 Peking and the Pekingese during the first year of the British Embassy at Peking by D. F. Rennie, M.D. London, Murray, 1865, 2 vols. 8°\n\n*622 Thian Ti Huwei—The Hung League or Heaven-Earth League. A secret Society with the Chinese in China and India by Gustave Schlegel. Batavia, 1866, 4°\n\n*623 The Origins of the Chinese: an Attempt to trace the connection of the Chinese with western nations in their religion, superstitions, arts, language, and traditions, by John Chalmers, A.M. Hongkong, Souza & Co., 1866, ppt. 8° pag. 78.\n\n624 Suppression of the Taiping Rebellion in the Departments around Shanghai. Shanghai, Kelly, 1871, ppt. 8°\n\n625 Reports on Amoy and the Island of Formosa by C. W. Legendre, U. S. Consul at Amoy. Washington, 1871, ppt. 8°\n\n*626 Traité des Tartares, de leur origine, pays, peuple......; de la suite de leurs Chams et Empereurs...... par Pierre Bergeron. Parisien, 4°\n\n*627 Avril's China, 12° (no title page.)\n\n*628 China, historisch, romantisch, malerisch. Cartersuhe, 4°. s. a.\n\n*629 Picturesque Representations of the Dress and Manners of the Chinese illustrated with fifty coloured Engravings with descriptions, by William Alexander. London, 4°, s. a.\n\n[1860 — 1871]\n*630 Biot—Considerations sur les anciens temps de l'Histoire Chinoise, I. R. 64 p. 8° (no title page.)\n\n*631 The Celestial Empire; or Points and Pickings or information about China and the Chinese by the Author of \"Soldiers and Sailors,\" \"Paul Preston,\" etc. London, Grant & Griffith, fscap, 8°, s. a.\n\n*632 Histoire du grand Genghizean, premier Empereur des anciens Mogols et Tartares divisée en quatre livres; traduite et compilée..... par feu M. Petis de la Croix le père, à Paris, Claude Barbier, 1710, in 12.\n\nPetis was born in 1632 and died in 1695. The above work was published by his son (b. 1658, d. 1718.)\n\n*633 The History of Genghizcan the Great, first Emperor of the Antient Moguls and Tartars; in four Books by the late M. Petis de la Croix Senior, and now faithfully translated into English. London, 1722, 8°\n\n*634 Geschichte der Ost-Mongolen und Ihres Fürstenhauses, verfasst von ssanang ssotseh chungtaidsehi der ordus; von Isaac Jacob Schmidt. St. Petersburg de Leipzig, 1829, 4°\n\n*635 Geschichte des östlichen Asiens von Dr. Joh. Heinr. Plath—Erster Theil—Die Mandschurey. Gottingen, 1830, 8°\n\n*636 Denkwürdigkeiten über die Mongolei, von dem Mönck Hyakinth, aus dem russischen übersest von Karl Friedrich von der Borg. Berlin, 1832, 8°\n\nVide Nos. 626, 545 & 553 which ought to have been placed here,\n\nb Blue Books on China.\n\n637 Papers relative to the Establishment of a Court of Judicature in China. 1838.\n\n638 Correspondence relating to China. 1840.\n\n639 Additional Papers relating to China. 1840.\n\n640 Parliamentary Papers relating to the Opium Trade; viz: Extracts from Reports, etc., of Committees of the Houses of Lords and Commons 1821 to 1832. 1840.\n\n641 Returns of Trade at the Ports of Canton, Amoy, and Shanghai for the year 1844. 1845.\n\n642 Papers respecting the Civil Wars in China. 1853.\n\n643 Correspondence with the Superintendent of British Trade in China upon the subject of Emigration from that country. 1853.\n\n644 Correspondence respecting insults in China. 1857.\n\n645 Further Papers relative to the Proceedings of her Majesty's naval forces at Canton. 1857.\n\n646 Correspondence relative to the Earl of Elgin's special Missions to China and Japan 1857-1859. 1859.\n\n647 Correspondence with Mr. Bruce, her Majesty's Envoy extraordinary and Minister plenipotentiary in China. 1860.\n\n648 Correspondence respecting Affairs in China 1859-1860 presented to both Houses of Parliament by Command of her Majesty. 1861.\n\n649 Correspondence respecting the fitting out, dispatching to China, and ultimate withdrawal, of the Anglo-Chinese fleet under the Command of Captain Sherard Osborn; and the dismissal of Mr. Lay from the Chief inspectorate of Customs. 1864.\n\n650 Commercial Reports from her Majesty's Consuls in China 1862-64, 8°. 1865.\n651 Papers relating to the Affairs of China (in continuation of Papers presented to Parliament in March 1863.) 1864.\n\nc Miscellaneous Works published in China.\n\n652 The Anglo-Chinese Calendar. Canton, 8°, 1848 (2 copies), 1849-1851 (2 copies), 1853, 1855.\n\n653 The China Pilot...... compiled...... by Staff Commander John W. King, R.N. 4th ed. London, 1864, 8°\n\n654 The China Directory for 1864. Hongkong, 1864, 8°\n\n655 The Chronicle and Directory for China, Japan and the Philippines. Hongkong, 8°, 1866 (2 copies), 1867-1868.\n\n656 A Hand-book of Treatises with China and Japan—First Series: Great Britain with China and Japan—United States of America with China and Japan—and France with China. Shanghai, A. H. de Carvalho, 8°\n\n657 A Statement of the needs of the United States Consulates in China, ppt. 8°\n\n658 The legislative Authority of the Minister and Consuls of the United States in China, ppt. 8°\n\nd Shanghai Local Publications.\n\n659 The Great Currency Question or the Rise and Fall of Mexico; by Philo-Carolus. Shanghai, 1856, ppt. 8°, p. 35.\n\n660 Official Papers on the Administration of affairs at the Port of Shanghai, 1854. Shanghai, 1854, ppt. 8°\n\n661 Correspondence on the Better government of Shanghai. Shanghai, 1862, ppt. 8°\n\n662 Rules of the Shanghai Debating Society, p. 4.\n\n663 Shanghai Almanac. Shanghai, 8°, 1857, 1858, 1860 (2 copies), 1861, 1863, 1869.\n\n664 The Fourteenth, Seventeenth and Eighteenth Annual Reports of the Chinese Hospital at Shanghai. 1861, 1864, 1865, 3 ppts. 8°\n\n665 Report of the Shanghai General Hospital 31st December 1868. Shanghai, 1869, ppt. 8°\n\n666 Christian Missions—A Sermon preached in Trinity Church October 11th 1868, by the Rev. William Muirhead. Shanghai, 1868.\n\n667 Catalogue of Austrian and Hungarian Products exhibited in the Shanghai Club published by Victor Schönberger. Shanghai, July 1869, ppt. 8°\n\n668 Land Regulations and Bye Laws for the Foreign Settlements of Shanghai North of the Yang-King-Pang. Shanghai, 1870, ppt. 8°, 1860-1870, 2 ppts. 8°\n\n669 Minutes of a Meeting of Renters of Land on the English and American Settlements. Shanghai, 1868, ppt. 8° id. 1869 id.\n\n670 Municipal Council of Shanghai\n\n—Reports for the years ended 31st March 1866 (2 copies), 1867 (2 copies), 1868-1869 (2 copies), 1870-1871.\n\n—Appendices to Report for the year ended 31st March 1871.\n\n—Estimates for the years commenced 1st April 1868 (2 copies), 1869-1870-1871.\n671 Conseil d'Administration municipale de la Concession française à Shanghai—Compte rendu de la gestion pour l'exercice 1868-69 (échue le 31 Mars 1869)—Budget 1869-70.\n\nVide No. 624 Taiping Rebellion.\n\nHongkong Local Publications.\n\n672 The Hongkong Almanack and Directory for 1846 with an Appendix. Hongkong, 1846, 8°\n\n673 Report of the Morrison Education Society for the year 1864-65. Hongkong, 1865, pp. 8°\n\n674 Memorandum and Articles of Association of the Hongkong Hotel Co. limited. Hongkong, 1866, 8°\n\n5 Japan.\n\n*675 La nouvelle Histoire du Japon divisée en cinq Livres...... composée en espagnol par le R. P. Louys Pigneyra de la Compagnie de Jésus et traduite en Français par I. B. Paris, Jean Fouet, 1618, 8°\n\nNot mentioned by Léon Pagès.\n\n*676 Descriptio Regni Japoniae. Tractatus in quo agitur : De Japoniorum religione...... De Christianae religionis introductione in ea loca—De ejusdem extirpatione...... autore Bernhardo Varenio, Med. D. Amstelodami—Apud Ludovicum Elzevirium, 1649, 16°\n\n*677 Engelbert-Kaempfer—De Beschryving van Japan. Amsterdam, 1788, folio.\n\n\"L'ouvrage fut écrit originellement en hollandais. Le chevalier H. Sloane acheta le manuscrit et le fit traduire en anglais par Schenckher [London 1727-28, 2 vol. folio] Plus tard l'ouvrage parut en Hollande.\"\n\n\"Kaempfer a spécialement suivi les directions du gouverneur général Camphuis, ancien Surintendant du Commerce au Japon.\" (Léon Pagès.)\n\nKaempfer, who was born in 1651 in Westphalia and died in 1716, introduced Acupuncture in Europe.\n\n*678 Ueber die Japanische Nation vorgelesen den 8 Nov. 1784, von Carl Peter Thunberg Prof. der Med. und Botanik, p. 56, 8°\n\n*679 Cérémonies usitées au Japon, pour les mariages, les funérailles, et les principales fêtes de l'année...... ouvrage traduit du Japonais par M. Feu Titsingh, Ambassadeur de Hollande en Chine. Paris, Nepveu, 1822, 8 vols. 12° bd. in 1 vol.\n\n[Also Paris, 1819. Nepveu, 8°]\n\n*680 Herinneringen uit Japan van Hendrik Doeff. Haarlem, 1883, 8°\n\n*681 Manners and Customs of the Japanese, in the nineteenth Century from recent Dutch Visitors of Japan, and the German of Dr. Ph. Fr. von Siebold. London, Murray, 1841, 12°\n\n682 Nippon. Archiv zur Beschreibung von Japan und dessen neben und schutzländern...... von Ph. Fr. von Siebold.\n\nErster Band—Abtheilung I. Mathematische und Physische Geographie vom Reiche Japan. Leyden, 1852.\n\nZweiter Band—Abt. II. Volk und Staat-Bewohner von Japan; von den Waffen und der Kriegskunst. Leyden, 1852.\n\nDritter Band—Abt. III. Land und Seereisen. Leyden, 1852.\n\nVierter Band—Abt. IV. Beiträge zur Geschichte von Japan.\n\nAbt. IV. Kunst und Wissenschaften. Leyden, 1852.\n\nFünfter Band—Abt. V. Pantheon von Nippon.\n\nAbt. VI. Landwirthschaft, Kunstfeissund Handel.\n\nSechste Band—Abt. VII. Die Neben und schutzländer von Japan.\nSeven parts bound in 3 vols. imp. 4°\nSiebold was born at Wurzburg in 1796 and died at Munich in 1866.\n\n*683 The Capital of the Tycoon: A Narrative of a three years' Residence in Japan by Sir Rutherford Alcock, K.C.B., her Majesty's Envoy extraordinary and Minister plenipotentiary in Japan. London, Longman, 1868, 2 vols. 8°\n\n*684 De Rebus japonicis, indicis et pervanis Epistolae recentiores a Joanne Hayo Dalgattiensi Scofo S.J. in librum unum coacervatae. Antverpiae, 1605, 8°\n\nC—Africa.—Islands of the Pacific Ocean, &c.\n\n*685 An Account of the Native Africans in the Neighbourhood of Sierra-Leone; to which is added an Account of the present state of medicine among them by Thomas Winterbottom, M.D. London, 1803, 8°\n\n*686 View of Ancient and modern Egypt; with an Outline of its Natural History by the Rev. Michael Russell. New York, Harper, 1842, 12°\n\n*687 An Account of the Natives of the Tonga Islands, in the South Pacific Ocean, with an original Grammar and Vocabulary of their language—compiled and arranged from the extensive communications of Mr. William Mariner, several years Resident in those islands by John Martin, M.D. 3rd ed. Edinburgh, Constable, 1827, 2 vols. 12°\n\nThese two vols. form Vol. XIII & XIV of Constable's Miscellany.\n\n*688 Gems from the Coral Islands; or, Incidents of contrast between Savage and Christian Life of the South Sea Islanders by the Rev. William Gill, Rarotonga. London, Ward & Co., 1856, 2 vols. 8°\n\nVol. I. Western Polynesia: comprising the New Hebrides Groupe, the Loyalty Groupe, and New Caledonia Groupe.\nVol. II. Eastern Polynesia: comprising the Rarotonga Groupe, Penhryn Islands, and Savage Island.\n\nD—America.\n\n*689 A History of North and South America: including the celebrated Work by Dr. Robertson continued by a complete History of the United States to the present time. London, George Virtue, Imp. 8°, s. a.\n\n690 History of the Brooklyn and Long Island Fair Feb. 22, 1864. Brooklyn, 1864, 8°\n\n691 Report of the Secretary of War with accompanying papers. Washington, Gov. Print. Office, 1865 and 1866, 2 pts. 8°\n\n692 Forty Ninth Annual Report of the Controllers of Public Schools of the First School District of Pennsylvania, comprising the City of Philadelphia for the year ending December 31st 1867, with their Accounts. Philadelphia, 1868, 8°\n\n693 Monthly Report of the Deputy Special Commissioner of the Revenue in charge of the Bureau of Statistics, Treasury department July 31, 1869—Aug. 31, 1869—Sept. 30, 1869, 3 pts. 4°\n\n694 Twenty First Annual Report of the Board of Trustees of the Public Schools of the City of Washington. Washington, D. C., 1866, 8°, p. 86.\n\n695 The Public Ledger Building: Philadelphia: with an Account of the Proceedings connected with its Opening June 20, 1867. Philadelphia, George W. Childs, 1868, 8°\n\nVII. BIOGRAPHY.\n\n*696 The true Nature of Imposture fully display'd in the life of Mahomet...... by Humphry Prideaux, D.D., Dean of Norwich. 7th ed. London, 1718, 8°\n*697 Abrégé historique des principaux traits de la vie de Confucius, Célèbre Philosophe Chinois orné de 24 estampes in 4° gravées par Helman, d'après des dessins originaux de la Chine envoyés à Paris par M. Amiot Missionnaire à Pékin et tirés du Cabinet de M. Bertin Mtre. et ancien Sre. d'Etat. Paris, 4°, s. a.\n\nVoir dans le XII Vol. des Mémoires concernant les Chinois la Vie de Confucius par le P. Amiot.\n\n*698 Mémoire of the Life and Family of the late Sir George Leonard Staunton, Bart.…… 1828, print. for private circul. only, 8°\n\n*699 Sketch of the Life and Character of John Broadhead Beck, M.D., by C. R. Gilman, M.D., reprinted from the New York Journal of Medicine—Ny. John F. Trow, 1851, ppt. 8°, p. 11.\n\n*700 Life of Taiping-Wang, Chief of the Chinese Insurrection by J. Milton Mackie. New York, Dix, Edwards & Co., 1857, 12°\n\nVIII. LITERARY HISTORY AND BIBLIOGRAPHY.\n\n*701 Theophili Spizelii de Re literaria Sinensium Commentarius, in quo scripturae pariter ac philosophiae sinicæ specimina exhibentur, et cum aliarum gentium, praesertim Aegyptiorum, Graecorum, et Indorum Reliquorum literis atque placitis. Lug. Bat., 1660, 12°\n\n*702 Le Siècle des Youïn ou Tableau historique de la littérature chinoise depuis l'avènement des Empereurs Mongols jusqu'à la restauration des Ming, par M. Bazin…… Paris, Imp. Nat., 1860, 8°\n\n*703 Entwurf einer beschreibung der Chinesischen Litteratur von Wilhelm Schott. Berlin, 1854, 4°\n\n*704 Notes on Chinese Literature: with Introductory Remarks on the progressive advancement of the art; and a List of translations from the Chinese, into various European Languages by A. Wylie. Shanghai, 1867, 4°\n\n*705 Siebold—Isagoge in Bibliothecam Japonicam et Studium literarum Japonicum—folio\n\n*706 Catalogus Librorum et Manuscriptorum Japonicorum a Ph. Fr. de Siebold collectorum, annexa enumeratione illorum qui in Museo Regio Hagano servantur autore Ph. Fr. de Siebold—libros descripsit J. Hoffmann accedunt Tabulae lithographicae xvi. Lugduni-Bat., 1845, folio. 125 Copies printed.\n\n*707 Bibliothèque Asiatique et Africaine ou Catalogue des Ouvrages relatifs à l'Asie et à l'Afrique qui ont paru depuis la Découverte de l'imprimerie jusqu'en 1700: par H. Ternaux-Compans. Paris, Arthus Bertrand, 1841, 8°\n\n*708 Bibliotheca Orientalis—Manuel de Bibliographie orientale par J. Th. Zenker. Leipzig, Guillaume Engelmann, 1846-1861, 2 vols. 8°\n\n*709 Bibliotheca Geographica—Verzeichniss der Seit der Mitte des vorigen Jahrhunderts bis zu Ende des Jahres 1856 in Deutschland erschienenen Werke über Geographie und Reisen von Wilhelm Engelmann. Leipzig, 1857-1858, 2 vols. 8°\n\n*710 Bibliographie Japonaise ou Catalogue des Ouvrages relatifs au Japon qui ont été publiés depuis le XVe. siècle jusqu'à nos jours rédigé par M. Léon Pagès. Paris, B. Duprat, 1859, 4° (2 copies.)\n\n*711 Catalogue of Books on China (other than philological) published on China and Japan in the English language compiled by N. B. Dennys—ppt. 8°\n*712 Verzeichniss der Chinesischen und Mandshurischen Bücher und Handschriften der Königlichen Bibliothek zu Berlin verfasst von Julius Klaproth. Paris, 1822, folio.\n\n713 Catalogue of the Chinese Library of the Royal Asiatic Society by the Rev. S. Kidd. London, Parker, 1888, pp. 58.\n\n714 Katalog der Bibliothek des K. K. Hof-Mineralien-Cabinets in Wien zusammengestellt von Paul Partlch Herangegeben K. K. Geol. Reich. Wien, 1851, 4°\n\n*715 Catalogue des Livres imprimés et Manuscrits composant la Bibliothèque de feu M. Louis-Mathieu Langlès. Paris, J. S. Merlin, 1825, 8°\n\n\"Ce Catalogue, rédigé avec beaucoup de soin par M. M. Merlin père et fils, est un vol. in 8 de XVIII et 558 pag., auquel doivent être jointes la Table des Auteurs et des Ouvrages anonymes, en lxxix pag., et la liste imprimée des prix de la vente, se montant à Fr. 117, 625. 90 c. On peut le regarder comme une sorte de bibliographie spéciale pour la littérature et l'histoire orientale. Il en a été tiré des exempl. en pap. vélin.\" (Brunet.)\n\nLanglès was born at Péronne near Mont-Didier, on the 23rd Aug. 1768 and died in Paris on the 28th January 1824.\n\nVide the Biographical Notice at the beginning of the Catalogue and Rémusat's Nouveaux Mélanges Asiatiques Vol. II p. 316 et seq.\n\n*716 Catalogues des Livres imprimés, des Manuscrits et des Ouvrages chinois, tartares, japonais, etc., composant la bibliothèque de feu M. Klaproth. Première partie. Paris, R. Merlin, 1839, 8°\n\nLa Deuxième Partie du Cat. comprenant les livres et mas. chinois, tartares et japonais a été rédigée par M. Landresse.\n\nHenry Jules Klaproth was the son of the celebrated chemist Martin Henry Klaproth. He was born in Berlin in 1783 and died in Paris in 1835.\n\n*717 Catalogue des Livres imprimés et Manuscrits composant la bibliothèque de feu M. Eugène Burnouf. Paris, B. Duprat, 1854, 8°\n\nBurnouf was born in Paris in 1801 and died in 1852.\n\n718 Trübner's American and Oriental Literary Record, 8°, Nos. 48/51 (1869), 56/59, 63/64 (1870), 66/71, 73/74 (1871), 80/82 (1872).\n\n719 Norton's Literary Letter: 4°, No. 1 New Series 1860 comprising the Bibliography of the State of New Hampshire—No. 2 comprising the Bib. of the State of Vermont.\n\n720 A Rough List of books…… to be sold by Bernard Quaritch. No. 5, June 1870.\n\n721 Catalogue de la Bibliothèque Orientale de Veuve Benjamin Duprat, 2e partie, n. d.\n\nSee \"List of Works upon China, principally in the English and French Languages.\"\n\n\"1 Philological Works; 2 Translations; 3 General Accounts, Travels, &c.\" Chin. Rep. XVIII, p. 402 et seq.—Additions p. 657.\n\nTRANSACTIONS OF LEARNED SOCIETIES AND PERIODICAL PUBLICATIONS.\n\nI. TRANSACTIONS AND PROCEEDINGS OF LEARNED SOCIETIES AND PERIODICAL PUBLICATIONS OF EUROPE.\n\nA—Great Britain.\n\n722 Royal Society of Great Britain and Ireland.\n\nTransactions—Vol. II, Part I (1829). Vol. III, Parts I (1831). II (1838, 2 copies). III (1834). Vol. III Appendix (1835) 4°\nProceedings—Vol. XIV (1865) Nos. 76 and 77. Vol. XV (1866-67) Nos. 82/5-87/98. Vol. XVI (1867-68) 94/104. Vol. XVII (1868-69) 105/118. Vol. XVIII (1869-70) 114/118.\n\nSix Discourses delivered before the R. S. at their anniversary meetings on the award of the Royal and Copley Medals, preceded by an Address to the Society on the progress and prospects of science, by Sir Humphry Davy, Bart., Pres. R. S. London, Murray, 1827, 4°\n\nReport on the adjudication of the Copley, Rumford, and Royal Medals; and appointment of the Bakerian, Croonian, and Fairchild Lectures compiled from the original documents in the Archives of the R. S. by James Hudson, Assistant Secretary and Librarian. London, 1884, 4°\n\nCorrespondence between the President of the R. S. and the Board of Trade on the Magnetism of ships, and on the Meteorological Department from the Proc. of the R. S. London, 1865, ppt. 8°\n\n723 Geological Society of London.\n\nThe Quarterly Journal Vol. XXII, Parts 3 and 4 (1866). Vol. XXIII (1867) Nos. 89/92. Vol. XXIV (1868) Nos. 93/96. Vol. XXV (1869) 97/100. Vol. XXVI (1870) 101/104. Vol. XXVII (1871) 105/8.\n\nList: Nov. 1st 1867–1868–1869–1870.\n\n724 Royal Asiatic Society of Great Britain and Ireland.\n\nTransactions—Vol. I (1827, 2 cop.) Vol. II (1830, 2 cop.) Vol. III (1835) 4°\n\nThe Journal—Vol. I–XVII (and Maps to Vol. XI) 17 vols. 8° (1834–1860) London, Parker—Vol. XVIII–XX (1861–68), London, Quaritch, 8 vols. 8° —New Series, London, Trübner, 8° Vol. I, Part I (1864, 8 cop.) II (1865). Vol. II, Parts I and II (1866). Vol. III, Part II (1868). Vol. IV, Part I (1869). Vol. V, Part I (1870) also Vol. XII, Part I (1849). II (1850). Vol. XIII, Part I (1851). II (1852). Vol. XIV, Part I (1851), Vol. XV, Part I (1853). Vol. XIX, Part I (1861). III (1862). Vol. XX. Part II (1868, 2 cop.) III and IV (1869.)\n\n725 Zoological Society of London, 8°\n\nProceedings—1861 (8 parts), 1862 (8 p.), 1863 (8 p.), 1864 (8 p.), 1865 (8 p.), 1866 (8 p.), 1867 (8 p.), 1868 (8 p.), 1869 (8 p.), 1870 (8 p.), 1871 (Part I.)\n\nIndex (1848–1860) 8° London, 1863.\n\nReport of the Council and Auditors of the Z. S. of L. read at the annual meeting Apr. 29, 1868, 8°\n\nJournal—No. I (1824). III (1824). VI (1825). XV (1829). XVI (1829). XVIII (1830.)\n\n726 Statistical Society of London: London, Stanford, 8°\n\nJournal—Vol. XXVIII, Parts 1/4 (1865). Vol. XXIX (1866). Parts 1/4, Vol. XXX (1867). Parts 1/4, Vol. XXXI (1868). Parts 1/4, Vol. XXXII (1869). Parts 1/4, Vol. XXXIII (1870). Parts 1/4, Vol. XXXIV (1871) Parts 1/8.\n\nList of the Fellows, 1865.\n\n727 Royal Geographical Society of London.\n\nProceedings—Vol. X, No. 2/6 (1868). Vol. XI (1867). No. 1/6, Vol. XII (1868). No. 2/5, Vol. XIII (1869). No. 1/5, Vol. XIV (1870). No. 1/5, Vol. XV (1871) No. 1/4.\nJournal—London, Murray, 1891–62, 82 vols. 8° and \"General Index to the Contents of the First ten Volumes,\" by J. R. Jackson, 1844, and to \"the Second ten Volumes,\" by George Smith Brent, 1858—the two indexes bound in one vol. Vol. 35/40 (1865–1870) 6 vols. 8°\n\n728 Royal Society of Edinburgh.\nProceedings—Session 1865-66—1866-67 (2 cop.) 1868-69, 8 ppts. 8°\n\nB—France.\n\n729 Société Impériale Zoologique d'acclimation fondée le 10 Février 1854.\nBulletin mensuel—2e. Série, Tome I (1864) Nos. 2/5—8/12—1867 Sept.—1869 Juin, Dec. 1870 (March wanting) 1871, 7/12—1872 Janvier, Février, Mars, Avril, Juillet, Août.\n\n730 Société de Géographie 8°\nBulletin—1870 (complete). 1871 (complete). 1872 Janvier, Mars, Avril, Mai, Juin, Juillet.\n\nC—Austria—Germany—Scandinavian States, etc.\n\n731 Kaiserlich-Königlichen Geologischen Reichanstalt. (Wien.)\nJahrbuch—1850/56 (6 p. comp.) (1859 wanting) (I-VII). 1857 (VIII No. 2, 3, 4). 1858/59 (IX-X). 1861/62 (XII). 1863 (XIII 1, 3). 1864 (XIV 3, 4). 1865 (XV 3, 4). 1866 (XVI.)\nAbhandlungen der K. K. G. R. in Drei Abtheilungen III parts 1852–55–56.\nDie Fossilien Mollusken des Tertiaer-Beckens von Wien von Dr. Moriz Kornes.\nUebersicht der resultate Mineralogischer Forschungen von Dr. Gustav. Adolph Kenngott 1844/49—1850/51—1852.\nGeneral Register der ersten zehn Bände Nummer 1 von 1850 bis nummer 10 von 1859 des Jahrbruches der K. K. G. R. Wien 1868.\nVide No. 714 for the Cat. of the Library.\n\n732 K. K. Zoologisch-Botanischer Gesellschaft in Wien.\nVerhandlungen 1861 (XI 1/4). 1865 (XV.)\n\n733 Deutschen morgenländischen Gesellschaft—Leipzig-Brockhaus.\nZeitschrift XVI Band (1862 Nos. 1/8.)\n\n734 Vereins für Erdkunde zu Dresden 1865 (I Jahresbericht), 1865 (II), 1870 (VI u VII.)\nNachtrag zum VI u VII Jahresbericht. Die Colonie am Pozuzer von Dr. Robert Abendroth.\n\n735 Dr. W. Koner—Repertorium über die vom Jahre 1800 bis zum Jahre 1850 in Akademischen Abhandlungen Gessellschaftschriften und wissenschaftlichen Journalen auf dem Gebiete der Geschichte und ihre hulfswissenschaften.\nBerlin, 1862 (No. 1/2), 1858 (II. 1), 1854 (II. 2), 1856 (II. 3.)\n\n736 Berichte über die Mittheilungen von Freunden der Naturwissenschaften in Wien; gesammelt und herausgegeben von Wilhelm Haidinger.\nI (1/6–May/Oct. 1846, pub. 1847), II (7/14 Nov./Dec. 1846, Jan./June 1847, pub. 1847), III (1/6 July/Dec. 1847, pub. 1848), IV (1/6 Jan./June 1848, pub. 1848), V (1/6 July/Dec. 1848—1/8 Jan./March 1849, pub. 1849), VI (1/9 April/Dec. 1849, pub. 1850), VII und letzter Band (1/6 Jan./June—8 Aug.—10/11 Oct./Nov. 1850, pub. 1851.)\n737 Naturwissenschaftliche Abhandlungen gesammelt und durch Subscription herausgegeben von Wilhelm Haidinger. No. II. III. IV. Wien, 1848–50–51, 4°\n\n738 Der Actionär-Geschäfts-Kalender für 1871–72. Leipzig, Berlin, 8°\n\n739 Russian Almanack 1782 and 1792.\n\n740 Leitfaden zur Nordischen Alterthumskunde herausgegeben von der Königlichen Gessellschaft für Nordische Alterthumskunde. Kopenhagen, 1887, 8°\n\n741 Memoires de la Société royale des Antiquaires du Nord 1840–44. Copenhague, 8°\n\n742 Die Königliche Gessellschaft für Nordische Alterthumskunde. Copenhagen, 1842–48, 2 pts. 8°\n\n*743 Nova Acta Regiae Societatis Scientiarum Upsaliensis. Vol. V. Upsaliae, 1867, 4°\n\n744 Meteorologische Jagttagelser….. 1863–66. Christiana, 1867, 4°\n\n745 Norsk Meteorologisk Aarbog for 1867, 1868, 1869. Christiania.\n\n746 For Ide og Virkelighed, et Tidsskrift, udgivet af R. Nielsen, Bj. Bjornson og Rud. Schmidt. 1870 (12 parts), 1871 (5 p.)\n\n747 Det Kongelige Norste Frederiks Universitets Aarsberetning for Aaret 1867 med Bilage. Christiania, 1868, 8°\n\n748 Compte rendu de la Soc. Imp. Géographique de Russie pour l'année 1864. St. Petersbourg, 1865, pts. 8°\n\n749 Journal of the Imp. Russian Geographical Society (in russian.)\nVol. VI (1870, No. 5, 6, 7—(1871) 8). Vol. VI (1871, No. 1, 2, 8.)\n\nII. TRANSACTIONS OF LEARNED SOCIETIES AND PERIODICAL PUBLICATIONS OF AMERICA.\n\n750 American Oriental Society.\n\nJournal—Vol. I, No. 2 (1844); 8 (1847); 4 (1849, 2 cop.) Vol. II (1851).\nIII, No. 1 (1852, 2 cop.); 2 (1853). IV, No. 1 (1858, 2 cop.); 2 (1854).\nV, No. 1 (1855); 2 (1856 2 cop.) VI, No. 1 (1859); 2 (1860 2 cop.) VII,\nNo. 1 (1861); 2 (1862). VIII, No. 2 (1871, 2 cop.)\n\n751 Smithsonian Institution.\n\nContributions to knowledge—Vol. IX, XI, XII, XIII, XIV, XV, XVI—\n1857–1870, 7 vols. 4°\n\nMiscellaneous Collections—Vol. I–VIII, 1862–1869.\n\nR. Osten Sacken. Catalogue of the described Diptera of North America\nprepared for the Smithsonian Institution. Washington, Smith. Cont. to know-\nledge, Jan. 1858, 8°\n\nMeteorology in its connection with agriculture by Professor Joseph\nHenry, Secretary of the Smith. Inst. Washington, 1868, 8°\n\nList of Foreign Correspondents to January 1862.\n\nAnnual Report of the Board of Regents: 1855/1868—1859 and 1860\nwanting.\n\n752 Letter of the President of the National Academy of Sciences, Senate. Washing-\nton, 1866 and 1867.\n\n753 American Geographical and Statistical Society.\n\nBulletin—Vol. I, No. 2 (1859); 8 (1854). II for 1856.\nReport of the Joint Special Committees of the Chamber of Commerce and Am. Geog. and Stat. Soc. on the extension of the Decimal System to weights and measures of the United States. 1857.\n\nAccess to an open polar Sea in connection with the Search after Sir John Franklin and his companions by E. K. Kane, M.D. 1858.\n\nOn the Statistics and Geography of the production of coin...... by Abraham S. Hewitt. 1856.\n\nThe Growth of Cities, by Henry Tappan. 1855.\n\n754 Academy of Natural Sciences of Philadelphia.\nVol. III-VIII, 8 vols. 8° (1848-1856)—(1856-61). 1862 (No. 1/9).\n1863 (No. 2/7.)\n\n755 Anniversary Oration delivered before the Medical Society of the District of Columbia. Sept. 26, 1866, by J. M. Toner, M.D. 1869, pp. 8°\n\n756 American Philosophical Society held at Philadelphia for promoting useful knowledge.\nTransactions—Vol. VI, 1839, 4°\nProceedings—Vol. X, 78/74 (1865); 75/76 (1866); 77 (1867). XI; 81/82 (1869). XII, 86 (1871.)\n\n757 Boston Society of Natural History.\nProceedings—1868-1869.\nOccasional Papers—I, 1869.\nMemoirs read before the B. S. of N. H., being a new Series of the Boston Journal of Natural History. Vol. I, 3 (1868); 4 (1869), 4°\nAddress delivered on the Centennial anniversary of the birth of Alexander von Humboldt under the auspices of the Boston Society of Natural History by Louis Agassiz. 1869, 8°\n\n758 Annual Report of the Trustees of the Museum of Comparative Zoology, at Harvard College, in Cambridge, together with the Report of the Director. 1866 and 1868.\n\n759 Annual Report of the American Institute, of the City of New York. Albany, Wendell, 8°. 1864/65 (1865). 1865/66 (1866.)\n\n760 The Transactions of the Academy of Sciences of St. Louis. Vol. I, 1 (1857); 2 (1858); 3 (1859); 4 (1860.)\n\nIII. TRANSACTIONS OF LEARNED SOCIETIES AND PERIODICAL PUBLICATIONS OF ASIA, ETC.\n\nA—Transactions of Learned Societies, etc.\n\n*761 Asiatic Researches: or Transactions of the Society instituted in Bengal for inquiring into the History and antiquities, the arts, sciences, and literature of Asia. 5 vols. 8° printed verbatim in London from the Calcutta edition in quarto. Vol. I-V (1798-1799.)\n\n762 Literary Society of Bombay.\nTransactions: London, Longman, Vol. I-III (1819-28), 8 vols. 4°\n\n763 Agricultural and Horticultural Society of India: Transactions, Calcutta, 7 vols. 8°, 1887-1840.\n\n*764 Verhandelen van het Bataviaasch genootschap van kunsten en Wetenschappen. Batavia, 14 vols. 8°\n765 Royal Asiatic Society (Ceylon Branch.)\nJournal—Part I (1856–58.) Colombo, 1858, 8°\n\n766 Roy. As. Soc. (China Branch.)\nTransactions, 1847. Hongkong, 1848, ppt. 8°\n\n767 Roy. As. Soc. (North China Branch) Shanghai, 8°\nJournal, I, June 1858 (pub. before the affiliation of the S'hai. Literary and Scientific Society with the Asiatic Soc.) II, May 1859; III, Dec. 1859. Vol. II, No. I, Sept. 1860.\nNew Series—I, Dec. 1864; II, Dec. 1865; III, Dec. 1866; IV, Dec. 1867; V, Dec. 1868; VI (1869 and 1870.)\nReports, 1864–65–66–67–68.\nCatalogue of Books relating to China and the East.\nNotes sur les Recherches que l'on pourrait faire en Chine et au Japon au point de vue de la Géologie et de la Paléontologie par G. Eug. Simon, 1869, 8°\nNarrative of the American Embassy to Peking in July 1859, by S. Wells Williams from the Journal, Vol. I, No. III, Art. VI, 1859.\n\n768 Report of the Medical Missionary Society in China, 1854/1865, 8 ppts. 8°\n\n769 Records of the Siberian Branch of the Imperial Geographical Society (in Russian.) Vol. VIII, Irkoutsk 1865, 8°\n\nB—Periodical Publications relating to Asia.\n\n770 The Asiatic Journal and Monthly Register for British India and its dependencies. Vol. I–XXVIII, 1816–1829. London, 27 vols. 8°\nThe Asiatic Journal and Monthly Register for British and Foreign India, China, and Australasia. New Series. London, 11 vols. 8°. Vol. I–XI, 1880–1883.\n\n771 The Phantix—a Monthly Magazine for China, Japan, and Eastern Asia, edited by the Rev. James Summers. London, 4°, 1870 (1, 2, 5, 6), 1871 (7, 8, 9, 11, 12, 18.)\n\nC—Periodical Publications of China.\n\n772 The Canton Miscellany. No. 1, 1831, 8°\n\n*773 The Chinese Repository, Canton, 20 vols. 8°, 1832–1851.\nAnother set: I. II. III. IV. V. VI. VII. VIII. IX. X. XI. XII. XIII. XIV. XVI. @ XIX.\nVol. V (No. 8). X (7, 8, 12). XVIII (8, 9). XIX (8). XX (6.)\n\n774 The Chinese Miscellany designed to illustrate the government, philosophy….. of China, No. I—A Glance at the interior of China obtained during a Journey through the Silk and Green Tea districts in 1845. Shanghai, Mission Press, 1849, 8°\n\n*775 The Chinese and Japanese Repository of Facts and Events in Science, History, and Art relating to Eastern Asia, edited by the Rev. James Summers. Vol. I (1864). II (1864, 18/17). III (1865, 18/29.)\n\n776 Notes and Queries on China and Japan—I (8). III (1, 8, 9, 11, 12). IV (1, 2, 8, 4, 5, 6, 7, 8.)\n\n777 The Chinese Recorder and Missionary Journal—Vol. I (1/12–8, 4). II (1/12–1, 2, 8, 4, 8, 10, 12). III (1/12–4, 6, 7, 12). IV (1/12.)\nADDENDA.\n\n*778 Hadriani Relandi Dissertationum Miscellancarum Pars Prima—Trajecti ad Rhenum 1706-1708, I Dissertatio de situ Paradisi terrestris. II De Mari rubro. III De Monte Garizim. IV De Ophir. V De dis Cabiris. VI De veteri lingua indica. Pars Secunda—VII De Samaritanis. VIII De reliquiis veteris linguae persicæ. IX De Persicis vocabulis Talmudis. Pars Tertia—X De jure militari Mohammedanorum contra christianos bellum gerentium. XI De linguis insularum quarundam orientalium. XII De linguis americanis. XIII De gemmis arabicis—bd. in 1 vol. 12°\n\n*779 Artificia Hominum Miranda Nature in Sina et Europa. Francofurti ad Mænum, 1655, in 24.\n\n*780 Novissima Sinica historiam nostri temporis illustratura…… edente G. G. L. (Leibnitzio) 1697.\n\n*781 An historical and geographical Description of Formosa, an Island subject to the Emperor of Japan by George Psalmanaazaar, a Native of said Island, now in London. 2nd ed. London, 1705, 8°\n\nFirst Edition—London, 1704, 8°\n\nThe author of this literary forgery, George Psalmanaazaar, (an assumed name) was born in the South of France about 1679 and died in 1763. He wrote an article on the island of Formosa for the \"Complete System of Geography\" published in 1747 as a sort of reparation for the fables he had formerly printed—an Essay on Miracles and several other works. After his death were published \"Memoirs of * * * *\", commonly known by the name of George Psalmanazar, a reported native of Formosa, written by himself, London, 1755, 8°\n\nHis work on Formosa was pub. in Dutch in 1705, 8°, and in French n. d. and 1739, 12°\n\nVide in D'Israeli's Curiosities of Literature, the Chapter on \"Literary Forgeries.\"\n\n*782 Hedendaegsche Historie, of Tegenwoordige staet alle volkeren…… eerst in't Engelsch beschreven door Th. Salmon; Nu vertaelt en merkelyk vermeedert door M. van Goch, M.D. 8° Amsterdam, 1729.\n\n*783 Yu le Grand et Confucius, Histoire Chinoise par M. Clerc—à Soissons, Ponce Courtois, 1769, 4 parts in 1 vol. 4°\n\n784 An Atlas of Chinese Views, &c.\n\n*785 Translations from the Chinese and Armenian, with notes and illustrations by Charles Fried. Neumann. London, Or. Trans. Fund, 1831, 8°\n\nContents I. The History of the Pirates who infested the China Sea from 1807 to 1810. II.—The Catechism of the Shamans; or the Laws and Regulations of the Priesthood of Buddha, in China. III.—Varham's Chronicle of the Armenian Kingdom of Cilicia during the Time of the Crusades.\n\n*786 Storia della Fondazione della Congregazione e del Collegio de'Cinesi sotto il titolo della Sagra Famiglia di G. C. scritta dallo stesso fondatore Matteo Ripa e de'viaggi da lui fatti. Napoli, 1832, 3 vols. 8°\n\n*787 The ten Tribes of Israel historically identified with the Aborigines of the Western Hemisphere by Mrs. Simon. London, 1836, 8°\n\n*788 Asiatische Studien von Carl Friedrich Neumann. Leipzig, 1887, 8°\n\n789 The Hawaiian Spectator conducted by an Association of Gentlemen—Vol. I, No. I, January 1888. Honolulu, 1888, 8°\n\n*790 Simple Exposé d'un Fait honorable odieusement dénaturé dans un libelle récent de M. Pauthier…… par Stanislas Julien. Paris, B. Duprat, Dec. 1842, ppt. 8°, p. 216.\n791 Le Tchéou-Là ou Rites des Tcheou, traduit pour la première fois du Chinois par Feu Edouard Biot. Paris, Imp. Nat., 1851, 2 vols. 8° et Table analytique (bd. in 1 vol.)\n\n792 Fac-Similes of the Hebrew Mss., obtained at the Jewish Synagogue in K'ae-Fung-Foo. Shanghai, London Miss. Soc'y Press, 1851, 4°\n\n793 Victoria Regia; or the Great Water Lily of America, with a brief Account of its Discovery and Introduction into cultivation: with illustrations by William Sharp, from Specimens grown at Salem, Mass. U. S. A. by John Fisk Allen. Boston, 1854.\n\n794 Senate—Statistical Report on the Sickness and Mortality in the Army of the United States compiled from the Records of the Surgeon General's Office; embracing a Period of sixteen years, from January 1839 to January 1855. Prepared under the direction of Brevet Brigadier General Thomas Lawson, Surgeon-general, U. S. Army, by Richard H. Coolidge, M.D., Assistant Surgeon, U. S. Army. Washington, 1856, 4°\n\nThe same embracing a Period of five years from January 1855 to January 1860. Washington, 1860, 4°\n\n795 Defence of Dr. Gould by the Scientific Council of the Dudley Observatory. 3rd ed. Albany, 1858, 8°\n\n796 Reply to the \"Statement of the Trustees\" of the Dudley Observatory by Benj. Apthorp Gould, Jr. Albany, 1859, 8°\n\n797 Código de Comercio concordado y anotado. 4ta. ed. Madrid, 1863, 8°\n\n798 Zeitschrift des Vereins zur erforschung der Rheinischen Geschichte und alterthümer in Mainz. Mainz, 1863, 8°\n\n799 Zur Geschichte der unteren Donauländer von Dr. E. Roesler.\n\nDas vorrömische Dacien. Wien, 1864, ppt. 8°\n\nDie Geten und ihre Nachbarn. Ibid.\n\n800 Beretning om Ladegaardsoens hovegaard for 1862 og 1863. Christiana, 1865, 4°\n\n801 Chinese Miscellanies: a Collection of Essays and Notes by Sir John Francis Davis. London, Murray, 1865, 8°\n\n802 Ezechiel's Syner og Chaldæernes Astrolab af C. A. Holmboe. Christiana, 1866, ppt. 4°, p. 18.\n\n803 Bibliothèque internationale universelle. Collection des chefs d'oeuvre anciens et modernes dans les meilleures traductions Françaises—Programme. Paris, 1869, ppt. 4°\n\n804 The Fifth Annual Report of the Hankow Medical Mission Hospital. Hankow, 1869.\n\n805 Our Kompassets Deviation...... af C. F. Wille. Kristiania, 1869, ppt. 8°\n\n806 Il Brahui—Studio di Etnologia linguistica di Felice Finzi. Firenze, 1870, ppt. 8°\n\n807 Den christelige Ethik fremstillet af H. Martensen. Kjobenhavn, 1871, 8°\n\n808 Statistik Handbog for Kongeriget Norge—udarbeidet af A. N. Kiaer. I Hefte. Kristiania, 1871, ppt. 8°\n\n*809 A Collection of Pamphlets bound in 5 vols. 8°\n\nVol. I. The Eccaleobion; a Treatise on artificial incubation by William Bucknell, London, 1839—To the Farmers of England—Foreign Corn—Remarks on the cost Price of producing Wheat in foreign countries and matters therewith connected by a Merchant, London—Remarks on the present State of Agriculture in a Letter addressed to his Constituents by Charles Shaw Lefèvre, Esq., M.P., London, 1898—A short Re-\nview of the causes and effects of the present distress.... by Charles Whitlaw, London—Outlines of a new Plan for Tilling and fertilizing Land by Thomas Vaux, London—Railways in India by an Engineer, London, 1847—Railways as they really are: or Facts for the serious consideration of Railway Proprietors, London, 1847/1848—Metallic Currency, the Cause of the Money Crisis in England and America, London, 1839—The Cause of the present Money Crisis explained, in answer to the Pamphlet of Mr. J. Horsley Palmer; and a Remedy pointed out by W. Bennison, London, 1837—The Currency Question in a Nut-shell, London, 1837.\n\nVol. II. West London Medicated Vapour Bath Institution, London, 1842—Hints on Bathing—A Letter to Archdeacon Singleton on ecclesiastical Commission by the Rev. Sydney Smith, London, 1837—Letter to the Queen on the State of Monarchy by a Friend of the People, London, 1838—Statement of the case of the late Lady Flora Hastings.... by the Marquis of Hastings, London, 1839—Report of the East India Committee of the Colonial Society on the Causes and Consequences of the Afghan war, London, 1842—India and Lord Ellenborough, London, 1844—A Narrative of the recent War in Afghanistan, London, 1845—Extracts of a Dispatch from Hon. the Count de Dampierre, Serampore, 1838—Proceedings of the Ship Propeller Company—Statements by H. Lister Maw, London, 1835—India, Great Britain and Russia, London, 1838—Is the War with China a just one? by H. Hamilton Lindsay, London, 1840—The Opium Question by Samuel Warren, 4th ed., London, 1840—The Chinese vindicated or another View of the Opium Question; being in reply to a Pamphlet by Samuel Warren, Esq., by Capt. T. H. Bullock, London, 1840.\n\nVol. III. Hydrotherapia; or the water cure.... by Thomas Smethurst, London, 1843—Prospectus of the Hydropathic Establishment at Stanstead Bury House near Hertford under the direction of Mr. Weiss, London, 1842—On the hydropathic cure of gout by G. Hume Weatherhead, London, 1842—Observations on the Oriental Plague and on Quarantines by John Bowring, Edinburgh, 1838—Lectures on the Physiology of the Senses by Francis Beagley, London, 1838—An Account of the Benah Saline Spa at Norwood, Surrey.... by G. H. Weatherhead, London, 1833—Hydropathy—the Cold Water Cure of Diseases: its Philosophy and Fact.... translated from the German of M. C. V. Schlimoner, London, 1842—West London Medicated Vapour Bath Institution.... established by Mr. Whitlaw in 1822, London, 1841—Extracts from the Reports of the Asylum for the Cure of Scrofula and Glandular Diseases, established Feb. 1822—Consumption curable.... by Henry Congreve, London, 1837—A practical Treatise on the Anti-asthmatic properties of the Bladder-Padded Lobelia.... by Richard Reece, London.\n\nVol. IV. Copies of original letters from the Army of General Bonaparte in Egypt, intercepted by the Fleet under the command of Admiral Lord Nelson, with an English Translation, 2nd ed., London, 1798—Influence of the Public Debt, over the Prosperity of the Country by M. B. Ridgway, 1834—On the public debt with a Plan for its final extinction, London, 1839—Brief Considerations on the income Tax and Tariff reform, in connection with the present state of the Currency by R. K. Douglass, Birmingham, 1842—Sketch of Mr. Buckingham's Life, Travels, and Political and Literary Labours—Provisional Observations on the Poor Laws.... by Frederick Sherley, London, 1829—The Emigrant's Guide to New South Wales, Van Diemen's Land, Lower Canada, Upper Canada, and New Brunswick, London, 1832—A short Review of the Causes and Effects of the Present distress, and its dreadful consequences on the labouring, manufacturing, and commercial classes by Charles Whitlaw—We can't afford it! being Thoughts upon the Aristocracy of England. Part the Second by Isaac Tomkins, Gent., London, 1835.\n\nVol. V. The Stocks examined and compared; or a Guide to purchasers in the Public Funds by William Fairman, 3rd ed., London, 1798—United Mexican Mining Association Report 27th July 1831, London—A Second Letter from Legion to his Grace the Duke of Richmond, &c., &c., &c., Chairman of the Slavery Committee of the House of Lords, London, 1833—The fourteenth Report of the Directors of the New Zealand Co., London, 1844—A Lecture on South Australia by Henry Watson, 3rd ed., London, 1838—“The Great South Land,” London, 1838—The Journal of the English Agricultural Society, Vol. I., Part I., London, 1839.\n\nTable for transmitting Chinese despatches by telegraph, containing all characters employed in official, commercial, or private correspondence of China, and their translation in numbers, drawn up by S. A. Viguier, Esq., Divisional Inspector, Marine Department, Shanghai, 1871.\n\nChinese and Foreign editions with a Memo. on Chinese Telegraphy.\n\nThe London and China Express..... London, Vol. XIII (1871) 887/889; 891/896; 400/419; 421/438.\n812 The European Mail—A Summary of News for China, Japan...... London, Vol. I, No. 9/12—14 (1870). Vol. II, 1/10—13/16 (1870.)\n\n813 Mookerjee's Magazine (New Series) of Politics, Sociology, Literature, Arts, and Science...... edited by Sambhu Chandra Mukhopadhyaya. Calcutta, Berigny & Co., 1872. Vol. I, Nos. II and III. 8°\n\n814 Catalogue of Chinese Objects in the South Kensington Museum, with an introduction and notes by C. Alabaster. London, 1872, pp. 8°, 80 pages.\n\n815 Heike Monogatari, Récits de l'histoire du Japon au XIIe siècle traduits du Japonais par François Turrettini, I Partie, Août 1871. Genève, H. Georg, pp. 4°, p. 25.\n\n816 The Natural History of Hainan by R. Swinhoe, F.Z.S., F.R.G.S., H. M. Consul in Formosa—Read before the British Association—Republished from the \"Field\" of 1870. London, Horace Cox, pp. 8°, 20 pages.\n\n817 On the Ornithology of Hainan by Robert Swinhoe (from the \"Ibis\" for January 1870.)\n\n818 On the Cervine Animals of the Island of Hainan (China) by Robert Swinhoe (from the Proceedings of the Zoological Society of London, December 9, 1869.)\n\n819 On the Mammals of Hainan by R. Swinhoe (from the Proc. of the Zoolog. Soc. of London, April 28, 1870.)\n\n820 List of Reptiles and Batrachians collected in the Island of Hainan (China), with Notes, by Robert Swinhoe (from the Proc. as above.)\n\nThe above named Papers by Mr. Swinhoe are bound in one vol. 8°\n\n821 The 100 Years Anglo-Chinese Calendar, 1st Jan. 1776 to 25th Jan. 1876, corresponding with the 11th Day of the 11th Moon of the 40th year of the Reign Kienlung, to the end of the 14th year of the Reign Tungchi; together with an Appendix, containing several interesting Tables and Extracts, by P. Loureiro. Shanghai, North China Herald, 1872, 8°\n\n822 Notes on some Plants from Northern China by Henry F. Hance, Ph. D. (Extracted from the Linnean Society's Journal.) pp. 8°\n\n823 A Compendious Supplement to Mr. Bentham's Description of the Plants of the Island of Hongkong by Henry Fletcher Hance, Ph. D. (Extracted from the Linnean Society's Journal.)\n\n824 A Revised Catalogue of the Birds of China and its Islands, with Descriptions of new Species, references to former notes, and occasional remarks, by Robert Swinhoe, F.Z.S, (from the Proc. of the Zoolog. Soc. of London, May 2, 1871), pp. 8°\n\n825 Discorso del Comm. Cristoforo Negri, Presidente della Società Geographica Italiana, letto all'Assemblea Generale tenuta il 30 Aprile 1871 nella Sala degli Arazzi del Ministero della Publica Istruzione. Pp. 8°, lv pages.\n\n826 The Marriage of the Emperor of China at Peking on the 16th October, 1872. From the Chinese by L. M. F. (Miss Lydia Mary Fay). Shanghai, \"Ching-fong\" Printing Office, 1872, pp. sm. 8°, 37 pages.\n## INDEX\n\n| AUTHORS, &c. | NO. IN CATALOGUE |\n|--------------|------------------|\n| A            |                  |\n| A., Anna d'  | 801              |\n| Abdallah Beidavaus | 519          |\n| Abeel, David | 549              |\n| Abel, Dr. Carl | 608             |\n| Abel, Clarke | 368              |\n| Abu'l Kasim Mahmud Bin Omar Zamahs arius | 145         |\n| Abu Talib Hussainy or Abu Taulib Alhusseini | 89, 545     |\n| Academy of Sciences (St. Louis) | 767         |\n| Acclimation (Soc. Zoologique d') | 729         |\n| Adelung      | 288              |\n| Agricultural and Horticultural Soc. of India | 768       |\n| Agriculture  | 75               |\n| Agassiz, Louis | 757           |\n| Akber        | 40               |\n| Alabaster, O. | 814             |\n| Alcock, Rutherford | 228, 281, 688   |\n| Albohazen Haly | 52              |\n| Alexander, William | 629         |\n| Alexandre de Rhodes (P.) | 806, 495    |\n| Alfragamus (Muhammedes filius Ketiri Ferganensis) | 92         |\n| Allen, John Fisk | 798            |\n| Alph. Tangutanum | 155           |\n| Amb. de la Cie Holl | 846         |\n| Amb. Mémorables | 848             |\n| American Institute | 759         |\n| Am. Oriental Society | 760       |\n| Am. Philosophical Soc. | 758       |\n| Amiot (P.)   | 261              |\n| Anatomy      | 69               |\n| Anderson, Alneas | 854          |\n| Anderson, Benj. | 409            |\n| Anecdotes Chinoises | 472        |\n| Antiquities of Egypt | 454        |\n| Anville, J. B. B. d' | 528         |\n| Apologie des Dominicains | 524       |\n| Aquaviva, Claudius | 415          |\n| Armstrong, R. A. | 124            |\n| Artificia Hominum | 779          |\n| Asiatic Journal | 770            |\n| Asiatic Researches | 761         |\n\n| AUTHORS, &c. | NO. IN CATALOGUE |\n|--------------|------------------|\n| Asiatic Society (Royal) | 724         |\n| Asiatic Society (Ceylon) | 765         |\n| Asiatic Soc. (China Br.) | 766         |\n| Asiatic Soc. (N. Ch. Br.) | 767        |\n| Astley's, T. Collection of Travels | 282       |\n| Atkinson, Mrs. | 886            |\n| Atkinson, Th. Will. | 408          |\n| Atlas Chinese Vieux | 784          |\n| Aubert, Peter | 547             |\n| Aulaire, R. J. de St. | 219         |\n| Avezac, M. d' | 568             |\n| Avril        | 627              |\n| B            |                  |\n| B., le Sr.   | 518              |\n| Bannister, Saxe | 888           |\n| Barrow, John | 826, 860, 861    |\n| Basile de Glemona (P.) | 168, 184    |\n| Bayerus, Th. Sigef. | 198        |\n| Bazin aîné  | 207, 270, 271, 485, 587, 702 |\n| Beagley, Francis | 809          |\n| Beaty, John F. | 61            |\n| Beaumont, Fr. M. de | 544        |\n| Beck, John Broadhead | 699        |\n| Bell, Georges | 882             |\n| Bell, John   | 809              |\n| Benfrey, Theod. | 158          |\n| Bennison, W. | 809             |\n| Bentham, George | 76            |\n| Benyowsky, Count of | 295        |\n| Beretning om Ladegaards | 800       |\n| Bergeron, Pierre | 821, 826     |\n| Bernard, J. Fred. | 276         |\n| Bernard, W. D. | 679, 580       |\n| Berncastle, Dr. | 879           |\n| Bettelheim, Dr. | 590           |\n| Biblio. intern. (Program.) | 808     |\n| Bingham, J. Elliot | 570         |\n| Biot, Edouard | 175, 575, 584, 680, 791 |\n| Birch, Samuel | 458             |\n| Bjornson, Bj. | 746             |\n| Blake, W. P. | 59               |\n| Blakiston, Th. W. | 894         |\n| Bleek, W. H. L. | 286, 242      |\n| Authors, &c. | No. in Catalogue |\n|-------------|-----------------|\n| Blue Books  | 637–651         |\n| Blytt, A.   | 67              |\n| Bobovius, Ab.| 92             |\n| Boero       | 437             |\n| Bogaert, A. | 549             |\n| Bombay Literary Society | 782 |\n| Bonaparte   | 809             |\n| Bonar, Rev. And. A. | 445 |\n| Borg, K. F. von der | 636 |\n| Borget, Aug.| 569             |\n| Bort, Balthasar | 342 |\n| Boston Soc. of Nat. Hist. | 757 |\n| Bottger, Adolf | 254 |\n| Bouhours, Père | 433 |\n| Bouvet, J.   | 521             |\n| Bowditch, N. L.| 126 |\n| Bowring, John | 509             |\n| Boyce, W. B. | 234             |\n| Bradshaw, W. S.| 300 |\n| Brand, Adam  | 947             |\n| Brauer, Fried | 289             |\n| Brent, Geo. Smith | 727 |\n| Breton      | 365, 540        |\n| Brill, E. J. | 2               |\n| Brine, Lindessy | 615 |\n| British Relations | 546 |\n| Broch, J. P. | 145             |\n| Brooklyn Fair | 990             |\n| Brouillion, R. P.| 484 |\n| Brown, Edward | 398             |\n| Brugsch, Dr. H.| 460            |\n| Brydges, Sir Harford J.| 492 |\n| Bucknell, Wm.| 809             |\n| Bullock, Capt. T. H.| 509 |\n| Burnett, Gilbert | 552            |\n| Burnouf, E.  | (10, 11, 150, 151) |\n| Caillot, Ant.| 488             |\n| Callery, J. M.| 29, 174         |\n| Callery      | 592, 598        |\n| Campbell, John | 480            |\n| Canton Dialect | 101            |\n| Canton Descr. of the City of | 556 |\n| Canton Miscellany | 772          |\n| Carbognano, Cos. Com. de | 143 |\n| Caron, Fr.    | 276             |\n| Carpentier, Jean le | 899 |\n| Castera, J.   | 325             |\n| Castrén, Alex.| 197, 138, 139, 140 |\n| Catrou, R. P. Fr.| 496           |\n\n| Authors, &c. | No. in Catalogue |\n|-------------|-----------------|\n| Celestial Empire | 631 |\n| Chabas, F.     | 464             |\n| Chalmers, John | 180, 623        |\n| Chambers       | 529             |\n| Chapsal        | 214             |\n| Charton, Edouard | 902           |\n| Chavannes de la Giraudière, H. de | 595 |\n| China, History of | 580, 594       |\n| China, A Complete View | 588, 587 |\n| China, Hist. rom. mal. | 628 |\n| China, Misc. anony. Works | 652–658 |\n| China, Hist. du Grand Roye. | 505 |\n| Chinesche Geschiedens | 581 |\n| Chinese fragment, A | 426 |\n| Chinese & Japanese Repos. | 775 |\n| Chinese Miscellany | 875, 774 |\n| Chinese Recorder | 777 |\n| Chinese Repository | 778 |\n| Churchill (Travels) | 279, 280 |\n| Cibot, le P.   | 196             |\n| Clerc          | 788             |\n| Cleyer, And.   | 109             |\n| Clinton, Henry Fines | 410 |\n| Coast Survey, &c.| (102, 104, 105, 106, 107, 108) |\n| Cobbold, Rev. R. H.| 610 |\n| Cochrane, Capt. J. Dundas | 400 |\n| Código de Comercio | 797 |\n| Cole, Henry Hardy | 466 |\n| Colebrooke, Hy. Thomas | 6a, 20, 260 |\n| Coleridge, Herbert | 125 |\n| Collecção de Vocabulos | 285 |\n| Confucius      | 24, 25, 26, 27, 28, 88, 198, 264, 697, 783 |\n| Congreve, Henry | 809             |\n| Cooke, George Wingrove | 606 |\n| Cooley, Wm. Desborough | 402 |\n| Corner, Miss.  | 581             |\n| Cornwallis, Kinahan | 887 |\n| Cossigny, Charpentier | 387 |\n| Couplet, Phil.  | 27, 92          |\n| Cowan, F. M.    | 386             |\n| Cramer, M.      | 386             |\n| Crawfurd, John  | 491, 552        |\n| Cuninghame, Capt. Ar. | 577 |\n| Curtius, J. H. Donker | 226, 227 |\n| D***, R. P. J.  | 520             |\n| Dabry, (P.)     | 607             |\n| Dalquiè, F. S.  | 513             |\n| Authors, &c. | No. in Catalogue |\n|-------------|------------------|\n| Darwin, Charles | 286 |\n| Davidson, G. F. | 297 |\n| Davids, Arthur Lumley | 141 |\n| Davids, Sarah | 141 |\n| Davies, Evan | 442 |\n| Davies, John | 294 |\n| Davis, John Francis | (87, 246, 247, 248, 878, 551, 565, 574, 587, 801) |\n| Davis, Rear Adm. Ch. H. | 97 |\n| Davy, Sir Humphry | 722 |\n| Davy, Major | 39 |\n| Delaporte, Abbé | 358 |\n| Dellen | 328 |\n| Dennys, N. B. | 997, 711 |\n| De Regio Persarum | 490 |\n| De Reizen de Chinees | 950 |\n| Des Michels, Abel | 160, 161 |\n| Devan, Dr. | 228 |\n| Dissertation, on the Characters and Sounds | 197 |\n| Doeff, Hendrik | 680 |\n| Dodge, J. R. | 88 |\n| Douglas, R. K. | 809 |\n| Downing, C. Toogood | 555 |\n| Dubois, J. A. | 5 |\n| Due, Lieut. | 95 |\n| Du Halde, J. B. | 525, 527, 528 |\n| Du Plan de Carpin, Jean | 276, 558 |\n| Du Ponceau, P. S. | 204 |\n| Duprat, Vve. Benj. | 721 |\n| Dutch Language | 128 |\n| Dyer, Rev. Sam. | 442 |\n\n| Authors, &c. | No. in Catalogue |\n|-------------|------------------|\n| Englishman in China | 611 |\n| Epistola indice et jap. | 414 |\n| Ephraemus, Sanct. | 144 |\n| Erdmann, F. v. | 132 |\n| Erman, Ad. | 402 |\n| Espy, Prof. James P. | 101 |\n| Etat présent de l'Eglise | 416 |\n| European Mail | 812 |\n| Ewald, H. | 488 |\n| Ewes, J. d' | 299 |\n| Eyrès, J. B. | 968 |\n\n| Authors, &c. | No. in Catalogue |\n|-------------|------------------|\n| Familiar phrases Japanese | 230 |\n| Fairholt, F. W. | 22 |\n| Faria y Sousa | 506, 509 |\n| Fairman, W. | 809 |\n| Fay, Miss Lydia Mary | 826 |\n| Fergusson, James | 465 |\n| Ferrand | 276 |\n| Finzi, Felice | 806 |\n| Firdoosee, Abool Kausin J. | 259 |\n| Fishbourne, Capt. | 596 |\n| Fisher, Lieut. Col. | 619 |\n| Flawes, G. | 276 |\n| Fleming, George | 887 |\n| Forbes, James | 500, 501 |\n| Forbes, Lieut. F. E. | 586 |\n| Forster, Rev. Charles | 459 |\n| Forster, John Reinhold | 284, 852 |\n| Fortia d'Urban | (558, 559, 560, 562) |\n| Fortune, Rob. | 876, 877, 978 |\n| Foucaux, Ph. Ed. | 12, 15, 168 |\n| Fourmont, Et | 194, 195 |\n| Frauenfeld, G. R. v. | 289 |\n| Frobisher, Martin | 276 |\n\n| Authors, &c. | No. in Catalogue |\n|-------------|------------------|\n| East India Company | 499 |\n| Easy Phrases in the Canton Dialect | 191 |\n| Eckeberg, C. G. | 351, 852 |\n| Edda | 258 |\n| Edkins, Joseph | 210 |\n| Eitel, Rev. Ernest J. | 18 |\n| Elementa Grammaticae Latino-Sinicae | 208 |\n| Elgin, Earl of | 889 |\n| Ellesmere, Earl of | 455 |\n| Ellis, Henry | 962 |\n| Ellis, Henry T. | 408 |\n| Ellis, Rev. W. | 972 |\n| Encyclopaedia Britannica | 21 |\n| Endlicher, Step. | 206 |\n| Engelmann, W. | 709 |\n| Gabelontz, C. v. d. | 488 |\n| Gaubil, le Père. | 26 |\n| Geographical Soc., Am. | 758 |\n| Geogr. Soc., Royal | 727 |\n| Geographie Soc. de | 730 |\n| Geograph. Researches, Russ. | 905 |\n| Geological Society | 728 |\n| Geologischen Reichsanstalt | 731 |\n| Georgius, Fr. Augt. Ant. | 154 |\n| Gill, Rev. W. | 688 |\n| Gillespie, Rev. Will. | 438 |\n| Gilman, C. R. | 699 |\n| Gladwin, Francis | 40 |\n| Authors, &c. | No. in Catalogue |\n|-------------|------------------|\n| Gobien, C.  | 521              |\n| Goch, M. van| 781              |\n| Golius, Jacob| 92               |\n| Golownin, Capt.| 364, 365       |\n| Gonçalves, J. A.| 169, 170, 172, 173, 202 |\n| Gordon, Ch. Al.| 618             |\n| Gordon, Peter | 552              |\n| Gould, Dr.    | 795              |\n| Gould, Aug. A.| 73               |\n| Gould, Jr., B. A.| 796            |\n| Goyet, Pierre de| 389, 340, 341   |\n| Graduated Reading| 221            |\n| Gramaye, Jo. Bap.| 471            |\n| Grammaire Francaise| 214           |\n| Grant, Assael | 316              |\n| Groeneveldt, W. P.| 219          |\n| Grosier, Abbe | 536, 541         |\n| Grube, Prof. Ed.| 289            |\n| Grunow, A.    | 289              |\n| Guignes, de   | 26, 261          |\n| Guignes Fils de| 168, 164, 177, 1957 |\n| Guldberg, C. M.| 94              |\n| Gutzlaff, Rev. Charles| 18, 156, 371, 372, 548, 554, 558, 588 |\n| Hager, Joseph | 14, 162, 448, 449 |\n| Hahn, Aug.    | 144              |\n| Haidinger, Wm.| 786, 737         |\n| Hall, Capt. Basil| 367            |\n| Hall, Fitzedward| 8               |\n| Hall, W. H.   | 579, 580         |\n| Halliwell, J. O.| 315            |\n| Halloran, Alf. Laur.| 597        |\n| Halma, Francois| 120, 121         |\n| Hamilton, Francis| 497            |\n| Hanbury, Daniel| 110              |\n| Hance, H. F.  | 70, 71, 72, 822, 828 |\n| Hankow Med. Miss. Hosp.| 804      |\n| Harris, John (Travels)| 278     |\n| Harvard Museum| 758              |\n| Hastings, Marquis of| 809         |\n| Haou-Kiou-Choaan| 244            |\n| Hausteen, Prof. Chr.| 95          |\n| Hawaiian Spectator| 789         |\n| Hawks, Francis L.| 885            |\n| Hay, Joannes  | 684              |\n| Hazlitt, W.   | 330              |\n| Hebrew Facsimile| 792            |\n| Heeren, A. H. L.| 411, 411a, 412, 468 |\n| Heller, Dr. Camil| 289            |\n| Helman        | 697              |\n| Hennepin, Pere| 276              |\n| Henry, Prof. Jos.| 751            |\n| Herbelot, B. d'| 474              |\n| Herdtich, Christ| 27               |\n| Hernisz, Stan.| 185              |\n| Herodotus     | 418              |\n| Herschel, Sir John F. W.| 62       |\n| Hervey-St. Denys Mis. d'| 114, 265 |\n| Hewitt, Ab. S.| 753              |\n| Hiortdahl, Th.| 63               |\n| Hiouen-Thsang | 892, 883         |\n| Historia Cultus Sinensium| 17     |\n| Hist. of the Miss. in Japan| 417    |\n| Hobson, Benj.| 179              |\n| Hodgson, C. Pemb.| 892           |\n| Hoffmann, Dr.| 116, 226, 227, 229 |\n| Holmboe, C. A.| 502              |\n| Hongkong Loc. Publications| 672-674 |\n| Hooker, Sir Will.| 892            |\n| Huc, Abbe     | 880, 881, 884, 888, 884, 601 |\n| Hudson, James | 722              |\n| Humboldt, Alex. von| 91, 757     |\n| Humboldt, G. de| 201              |\n| Humphreys, A. A.| 102            |\n| Hunter, Dr. Wm.| 89               |\n| Huyghens, Jean| 276              |\n| Hyakinth      | 686              |\n| I             |                  |\n| I. B.         | 675              |\n| Ibn Batuta    | 296              |\n| Ides, E. Ysbrants| 276, 348     |\n| Inde, Chine et Japon| 489       |\n| Instruct. für die Fachmanischen| 908 |\n| Intorcetta, Prosp.| 27             |\n| Irgens, M.    | 68               |\n| Ives, Joseph C.| 102             |\n| J             |                  |\n| Jakson, J. R.| 727              |\n| Jartoux, Pere | 276              |\n| Jean de Luca  | 276              |\n| Jenkinson, Ant.| 276             |\n| Jérémie      | 276              |\n| Authors, &c.          | No. in Catalogue |\n|----------------------|------------------|\n| Johnson, J.          | 910              |\n| Jones, Will.         | 148              |\n| Julien, Stan.        | 31, 82, 94, 95, 118, 116, 152, 187, 205, 215, 249, 256, 257, 267, 268, 932, 933, 790 |\n| Kaempfer, Engelbert  | 677              |\n| Kane, E. K.          | 753              |\n| Kang-he              | 36               |\n| Kaulen, F.           | 184              |\n| Kenngott, Dr. G. A.   | 731              |\n| Kesson, John         | 432              |\n| Keyser, Jacob de     | 339, 340, 341    |\n| Kaiser, A. N.        | 808              |\n| Kidd, Sam.           | 440, 568, 718    |\n| Kien-Long            | 261, 262         |\n| King, John W.        | 658              |\n| Kircher, Athan       | 232, 512, 518    |\n| Klapproth, Julius     | 128, 129, 164, 175, 818, 868, 969, 484, 712, 716 |\n| Kner, Dr. Rud.       | 289              |\n| Koner, Dr. W.        | 735              |\n| Kornes, Dr. Moriz    | 731              |\n| Köros, Alex. Csoma de.| 157              |\n| Kosegraten, J. G. L. | 488              |\n| Ko Tsching Oschang   | 171              |\n| Krishna, Isvara      | 6a, 260          |\n\n| Authors, &c.          | No. in Catalogue |\n|----------------------|------------------|\n| Le Gentil            | 277              |\n| Legge, Rev. George   | 446              |\n| Legge, James         | 25, 251, 252     |\n| Leibnitz             | 780              |\n| Lepsius, Richard     | 462, 463         |\n| Lettre de Péking     | 196              |\n| Lettres édifiantes    | 476–488          |\n| Lieblein, J.         | 464              |\n| Liharzik, Franz      | 41               |\n| Lindau, Rodolphe     | 395              |\n| Lindsay              | 370, 371         |\n| Lindsay, H. Hamilton | 809              |\n| Lisle, de            | 276              |\n| Ljungstedt, And.     | 550              |\n| Lobscheid, Rev. W.   | 190, 211, 212, 218, 223, 620 |\n| Lock, Capt. Granv. G.| 573              |\n| Locke                | 280              |\n| Lockman              | 477              |\n| London and China Express | 811          |\n| Loureiro, P.         | 821              |\n| Lovell, Joseph       | 98               |\n| Loviot, Fanny        | 891              |\n| Lowrie, Rev. Walter M.| 443, 444         |\n| Lyman, Benj. Smith   | 74               |\n| Lynn, Capt. Thomas   | 552              |\n\n| Authors, &c.          | No. in Catalogue |\n|----------------------|------------------|\n| Macartney, Earl of   | 355, 356, 358    |\n| M'Culloch, J. R.     | 43               |\n| Macgowan, Rev. John   | 186              |\n| Mackenzie, Keith Stewart | 568          |\n| Mackenzie, Kenneth R. H. | 241          |\n| Mackie, J. Milton     | 700              |\n| M'Leod, John         | 366              |\n| Magaillans, Gabriel   | 517, 518         |\n| M'Ghee, Rev. R. J. L.| 617              |\n| Mahomet               | 24, 696          |\n| Main, Rev. Robert     | 62               |\n| Mairan, Dortous de   | 582              |\n| Major, R. H.          | 591              |\n| Malan, Rev. S. C.     | 58               |\n| Malcolm, Rev. Howard  | 914              |\n| MalteBrun             | 278              |\n| Mandelslo, John Albert de | 294          |\n| Mangier, J.           | 177              |\n| Manou                 | 24               |\n| Manouchi              | 496              |\n| M'Pherson, D.         | 571              |\n| Mariner, Will         | 687              |\n| Marini, P. Geo. Fil. de | 421          |\n| Marshman, J.          | 197, 198         |\n| Martens, Fred         | 276              |\n| Authors, &c. | No. in Catalogue |\n|-------------|------------------|\n| Martensen, H. | 807 |\n| Martin, John | 687 |\n| Martin, R. Montgomery | 582 |\n| Martin, W. A. P. | 220 |\n| Martine, Père | 276 |\n| Martinius, Mart. | 508, 511 |\n| Mas, Sinibaldo de | 604 |\n| Mason, George Henry | 539 |\n| Maundeville, Sir John | 815 |\n| Maw, H. Lister | 809 |\n| Mayr, Dr. Gustav L. | 289 |\n| Meadows, Thomas Taylor | 585, 598 |\n| Mecklenburg, F. A. | 603 |\n| Medhurst, W. H. | {168, 188, 188, 429} |\n| Medical Miss. Society | 768 |\n| Mémoirs conc. l'hist. de la Chine | 585 |\n| Mencius | 23, 25, 84, 85 |\n| Mendoza, J. Gonzales de | 591 |\n| Montzelius, Chr. | 165 |\n| Mery | 289 |\n| Meteorological Register | {98, 99, 100, 101, 103} |\n| Mettenius, Dr. G. | 289 |\n| Michel, A. F. | 115 |\n| Milde, Dr. Julius | 289 |\n| Milne, Rev. William | {36, 427, 441, 600, 602} |\n| Miles, Col. | 498 |\n| Mizaldus Ant. | 58 |\n| Moges, Mis. de | 390 |\n| Mohammed ben Musa | 98 |\n| Mohl, Julius | 38, 264 |\n| Mollusques | 77 |\n| Monier, Père | 276 |\n| Montalembert, Ctesse de | 500 |\n| Montanus, Arnoldus | {344, 345} |\n| Montfort, Capt. | 382 |\n| Montucci, Ant. | 167 |\n| Mookerjee's Magazine | 818 |\n| Moorcroft, Will. | 329 |\n| Morrison, Rev. Rob. | {166, 167, 199, 217, 246, 440, 439} |\n| Morrone, Jos. | 204 |\n| Mosheimius, J. L. | 424 |\n| Mudie, Rob | 561 |\n| Muirhead, Rev. Wm. | 666 |\n| Mullens, Joseph | 6 |\n| Muller, Dr. Fried | 289 |\n| Muller, Jean Bernard | 276 |\n| Müller, Max. | 118 |\n| Mullerus Greiffenhausius | 519 |\n| And. | |\n| Munford, Rev. George | 127 |\n| Murray, Lieut. Alex. | 572 |\n| Murray, Hugh | {312, 552} |\n| Nat. Acad. of Sciences, U.S. | {754, 760} |\n| Navarotte, Fr. Dom. Fern. | 516 |\n| Navig. atque Itinerantium | 278 |\n| Navigation | 96 |\n| Negri, Cr. | 825 |\n| Neumann, Karl Fried. | {488, 588, 785, 788} |\n| Nielsen, R. | 746 |\n| Nieuhoff, John | {839, 840, 841} |\n| N. N. | 422 |\n| Noel, le Père | 28 |\n| Noel, Rev. B. Wriothesley | 549 |\n| Noël | 214 |\n| Norbert, R. P. | 425 |\n| Norton | 719 |\n| Norvège | 470 |\n| Notes and Queries on China and Japan | {776} |\n| Nouv. des Miss. Orientales | {479, 480} |\n| \"Novarra,\" Reise | 289 |\n| Ogilby, John | {340, 844, 845, 517} |\n| Olearius, Adam | 294 |\n| Oliphant, Laurence | 889 |\n| Ong-Tae-Hae | 407 |\n| Osbeck, Peter | {351, 852} |\n| Osborn, Capt. Sherard | 608 |\n| Othomi Grammaire | 298 |\n| Oucherlonry, Lieut. John | 578 |\n| Owen, David Dale | {60, 61} |\n| Oxenford, John | 598 |\n| Oxford, Earl of—Coll. of Travels | {281} |\n| Pakard, John H. | 78 |\n| Pagès, Léon | {227, 228, 710} |\n| Palafax | 514 |\n| Pallas, P. S. | 899 |\n| Pallegoix | 885 |\n| Palun, de la | 204 |\n| Pamphlets, Coll. of | 809 |\n| Authors, &c. | No. in Catalogue |\n|-------------|-----------------|\n| Pardon, George Fred | 319 |\n| Parke, R. | 591 |\n| Parkinson, Sydney | 405 |\n| Parraya, Don Gab. de | 420 |\n| Parrenin, R. P. | 582 |\n| Partlch, Paul | 714 |\n| Pastel | 416 |\n| Pauthier, G. | 438, 583, 602, 609, 790 |\n| Pavie, Théodore | 253 |\n| Paw, M. de | 478, 583, 594 |\n| Pelzeln, Aug. | 289 |\n| Periodical Publi., &c. | 722–777a |\n| Peritsol, Ab. | 92 |\n| Perry | 276 |\n| Perry, M. C. | 385 |\n| Persoz, J. | 115 |\n| Petis de la Croix | 632, 633 |\n| Peyronie, Gauthier de la | 399 |\n| Pfeiffer, Ida | 287 |\n| Pfizmaier, Aug. | 224, 255, 266 |\n| Pharaoh's Daughter | 272 |\n| Philip, Rob. | 441 |\n| Philo-Carolus | 659 |\n| Phoenix, The | 771 |\n| Picart, Bernard | 1 |\n| Pierre, R.P.Fr.Gonz.de S. | 423 |\n| Pigneyra, R.P. Louys | 675 |\n| Pinkerton Travels | 285 |\n| Pinto, Fernando Mendez | 292, 293 |\n| Plath, Dr. Joh. Heinrich | 18, 635 |\n| Pleyte, W. | 461 |\n| Polo, Marco | 290, 291 |\n| Power, W. Tyrone | 381 |\n| Premare, (P.) | 203 |\n| Prevost, Abbé | 288 |\n| Prideaux, Humphry | 696 |\n| Psalmanaaazar, George | 781 |\n| Public Ledger | 695 |\n\nQ\n\nQuaritch, Bernard | 720 |\n\nR\n\nBadtenbacher, Dr. Lud. | 289 |\nRammohun Roy | 3, 4 |\nRám Raz | 450 |\nRansonnet-Villez, Baron Eug. von | 504 |\nReece, Richard | 809 |\nReed, Rev. And. | 564 |\n\n| Authors, &c. | No. in Catalogue |\n|-------------|-----------------|\n| Regis, J. B. | 33 |\n| Reichardt, Dr. H. W. | 289 |\n| Reinaud | 817, 502 |\n| Reland, Adrian | 447, 778 |\n| Relation abrégée de la persécution | 416 |\n| Relat. de la nouv. pers. | 423 |\n| Renan, Ernest | 146 |\n| Renaudot, Eufsebe | 907, 908 |\n| Rennie, D. F. | 621 |\n| Rémusat, Abel | 180, 200, 201, 216, 318, 485, 486, 487 |\n| Report Post Master | 469 |\n| Rhasis, George | 142 |\n| Ribeiro, Gregorio Jose | 896 |\n| Ricci, Matthieu | 419 |\n| Richardson, John | 149 |\n| Richomme; Charles | 243 |\n| Richthofen, F. Baron v. | 111 |\n| Ridgway, M. B. | 809 |\n| Rikord, Paul | 864, 865 |\n| Ripa, M. | 786 |\n| Robertson, Dr. | 689 |\n| Rochet, Louis | 184 |\n| Rödiger, E. | 488 |\n| Roessler, Dr. E. | 799 |\n| Rondot, Natalis | 44, 45, 115 |\n| Roorda van Lysinga, P. P. | 239 |\n| Rosen, Frederic | 98 |\n| Rosny, Léon de | 225 |\n| Rost, Dr. Reinhold | 7 |\n| Rougemont, P. Fr. de | 27, 515 |\n| Rousseau, S. | 147 |\n| Royal Society | 722 |\n| Royal Society of Edinburgh | 728 |\n| Rubruquis, G. de | 821 |\n| Rückert, F. | 488 |\n| Russell, Rev. Michael | 686 |\n\nS\n\nSabine, Major Gen. Ed. | 91 |\nSacharoff, T. | 620 |\nSaemund the Learned | 258 |\nSaken, E. A. | 521 |\nSalmon, Th. | 782 |\nSalvétat, Alph. | 116 |\nSandeman, Rev. David | 445 |\nSars, Michael | 65, 66 |\nSau Mang Yian | 222 |\nSaussure, Henri de | 289 |\nScarth, John | 612 |\nScherzer, Dr. K. v. | 289 |\n| Authors, &c. | No. in Catalogue |\n|-------------|-----------------|\n| Schiefner, Anton | (187, 188, 189, 140) |\n| Schiner, Dr. J. R. | 289 |\n| Schlagintweit, Emil | 16 |\n| Schlegel, Gustav | 622 |\n| Schlimoner, C. V. | 809 |\n| Schmidt, I. J. | 136, 156, 634 |\n| Schmidt, Rud. | 746 |\n| Schönberger, Victor | 667 |\n| Schott, Wilhelm | 28, 209, 703, (506, 507, 508, 509) |\n| Semedo, Alvarez | |\n| Sexe, S. A. | 64, 68 |\n| Shanghai, Local Pub. | 659, 671 |\n| Sharp, William | 798 |\n| Sharpe, Sam. | 451–452 |\n| Shaon Tilh | 182 |\n| Sherley, Fred. | 809 |\n| Siberian Branch Imp. Geo. Soc. | 769 |\n| Siebold, Ph. Fr. de | (171, 986, 681, 682, 705, 706) |\n| Sieffert, F. L. | 144 |\n| Simon, G. Eug. | 767 |\n| Simon, Mrs. | 787 |\n| Sinnett, Mrs. Percy | 981 |\n| Skatschkoff, C. A. | 46, 274, 291 |\n| Sketch for the route per P. M. S. S. Co. | 898 |\n| Sketch Religious Sects of the Hindus | 9 |\n| Slade, John | 557 |\n| Smethurst, Thomas | 809 |\n| Smith, Rev. George | 974, 898, 600 |\n| Smith, F. Porter | 181 |\n| Smith, Rev. Sydney | 809 |\n| Smithsonian Institution | 751 |\n| Spencer, Rev. J. A. | 298 |\n| Spizellus, Theophilus | 701 |\n| Statistical Society | 728 |\n| Staunton, Sir G. Leonard | 855, 856, 698, (19, 828, 542, 543, 591) |\n| Steindachner, Dr. Franz | 289 |\n| Stephens, John L. | 406 |\n| Stewart, Maj. Charles | 545 |\n| Stillié, Charles J. | 88, 86 |\n| Strahlenberg, Ph. John v. | 467 |\n| Summers, Rev. James | 771, 775 |\n| Suppression Taiping Reb. | 624 |\n| Swinhoe, Robert | (112, 618, 816, 817, 818, 819, 820, 824) |\n| T., Abbé de | 412 |\n| Tabari | 494 |\n| Taberd, J. L. | 218 |\n| Taiping-Wang | 38, 700 |\n| Tamerlane, vide Timour | |\n| Tasset, André | 602 |\n| Taylor, Bayard | 818, 819 |\n| Tennent, Sir J. Emerson | 481 |\n| Ternaux-Compans | 707 |\n| Thevenot | 275 |\n| Thoms, Peter Perring | 268, 456 |\n| Thomson, Capt. J. | 584 |\n| Thornton, Thomas | 576 |\n| Thunberg, Carl Peter | 678 |\n| Tilley, Henry Arthur | 288 |\n| Timkowski, George | 968, 969 |\n| Timour | 89, 545 |\n| Titsingh | 679 |\n| Tkin Shen | 251, 252 |\n| Tomkins, Gent. Isaac | 809 |\n| Toner, J. M. | 755 |\n| Tonti, Chev. de | 276 |\n| Toreen, D. | 851, 852 |\n| Tourists' Guide | 189 |\n| Travels, New Gen. Coll. of | 282 |\n| Trebeck, George | 829 |\n| Trigaut, Nic. | 418, 419 |\n| Tronson, J. M. | 820 |\n| Trubner | 718 |\n| Travels of Jesuits | 477 |\n| \"T. T. T.\" | 250 |\n| Tuckett, Harvey | 42 |\n| Turner, Samuel | 825 |\n| Turrettini, F. | 815 |\n| Tyll Owlglass | 241 |\n| U.S. Reports | (47, 48, 49, 50, 51) |\n| Vide also Meteorological | 79–90, 96, 97 |\n| Registers and Coast Surveys | (691–695, 794) |\n| Valignano, P. Aless. | 415 |\n| Van-Braam | 858, 859 |\n| Varenius, Bernhardt | 676 |\n| Varham | 785 |\n| Varin, Paul | 616 |\n| Vaux, Thomas | 809 |\n| Verbiest, P. Ferd. | 92, 276 |\n| Verhand. van het Batavia | 764 |\n| Authors, &c.                  | No. in Catalogue |\n|------------------------------|------------------|\n| Vernionkoff, M.              | 404              |\n| Viguier, S. A.               | 810              |\n| Visdelou, Claude             | 474              |\n| Voyage to the East Indies    | 324              |\n| Voyage to Siam               | 922              |\n| Vries, Maerten Gerrits       | 886              |\n| Wakefield, Priscilla         | 911              |\n| Wallace, Will                | 552              |\n| Ward, Rev. W.                | 498              |\n| Warren, J. C.                | 58               |\n| Warren, Sam                  | 809              |\n| Wathen, James                | 327              |\n| Watson, Henry                | 809              |\n| Weatherhead, G. Hume         | 809              |\n| Webb, John                   | 192              |\n| Weber, Albrecht              | 508              |\n| Wedgwood Hensleigh           | 119              |\n| Weiland, P.                  | 122              |\n| Weston, Steph.               | 245, 262         |\n| Wheeler, J. Talboys          | 413              |\n| White                        | 276              |\n| White, Joseph                | 59               |\n| Whitlaw, Charles             | 809              |\n| Wilkins, Charles             | 149              |\n| Wilkinson, J. Gardner        | 457              |\n| Wille, C. F.                 | 805              |\n| Williams, D. H.              | 56, 57           |\n| Williams, John               | 428              |\n| Williams, Dr. S. Wells       | 176, 178, 599, 767|\n| Williams, W. L.              | 287              |\n| Wilson, Henry Hayman         | (6a, 7, 8, 260, 269, 329) |\n| Winterbotham, W.             | 587              |\n| Winterbottom, Thomas         | 685              |\n| Wolseley, G. J.              | 615              |\n| Wood, Jean                   | 276              |\n| Wright, Thomas               | 290              |\n| Wullerstorff-Urbair, B. von  | 289              |\n| Wylie, A.                    | 138, 704         |\n| Wyse, Col. Howard            | 458              |\n| Wyse, T. A.                  | 55               |\n| Xavier, St. Fr.              | 498              |\n| Yoong-Ching                  | 86               |\n| Yvan                         | 592, 593         |\n| Zaccone, Pierre              | 240              |\n| Zampi, J. M.                 | 276              |\n| Zeitschrift des Vereins Rhe- | 798              |\n| inischen Gesch., Mainz       |                  |\n| Zelebor, Johann              | 289              |\n| Zenker, J. Th.               | 708              |\n| Zoological Society           | 725              |\n| Zoologique d'Acclima., Soc.  | 729              |\n| Zoolog.-Botan. Gesellschaft  | 732              |\n| Zotenberg, Herm.             | 494              |\n| Zwick, H. A.                 | 135              |\nAPPENDIX.\n\nI. MAPS, CHARTS, &c.\n\nADMIRALTY CHARTS.*\n\n1 1861 Yang-tsze-kiang—from Hankau to Yoh-chau (China Sheet V.)\n2 1858 Yang-tsze-kiang—from Tung-liu to Hankau (China Sheet IV.)\n3 1868 Yang-tsze-kiang—from Nankin to Tungliu (China Sheet III.)\n4 1841 River Yung—from Mouth to Ningpo.\n5 1842 Yang-tsze-kiang—Sea to Nankin (China Sheet IX.)\n6 1854 Hakodadi Harbour (Japan Islands—Yezo Id.)\n7 1840-1848 Kintang Channel (China.)\n8 1849-1851 Sea of Okhotsk from Russian Charts 1849-1851.\n9 1849-1854 Strait of Tartary and the Entrance of the Amur River.\n11 1859 St. Vladimir Bay—West Coast—Gulf of Tartary.\n12 1856 Port Michael Seymour or Olga Bay (Coast of Tartary.)\n13 1856 Peter the Great Bay—Novik Bay (Coast of Tartary.)\n14 1855 Expedition Bay (Napoleon Road) and Pallada Roadstead (Capricieuse Bay) (Gulf of Tartary.)\n15 {1855-1852} Peter the Great (Victoria)—Posiette—Amur and Usouri Bays (Russian Tartary.)\n{1859-1861}\n17 1856 The Kuril Islands—from Nipon to Kamchatka (Japan.)\n18 1854 Endermo Harbour (Yesso Island—Japan Islands.)\n19 1855 Strait of Tsugar (Japan.)\n20 1861 Gulf of Yedo (Japan Islands—Nipon.)\n21 1854 Simoda Harbor (Japan Islands—Nipon.)\n22 1860-1861 Japan Islands (Korea Strait, between Kiusiu and Tsu-sima—Iki Island.\n23 1855-1861 Harbours of the West Coast of Kiu-siu and adjacent Islands (Japan.)\n24 1861 Simidsu Bay (Japan.)\n25 1861 Simonoseki Strait (Japan—Western Entrance to the Seto Uchi or Inland Sea between Nipon and Kiusiu.)\n26 1861 Nagasaki Harbour (Japan, Kiusiu Island, West Coast.)\n28 1859 Korea—Tsau-liang-hai (Chosan Harbour of Broughton) with the adjacent Coast of Tchao-sian.)\n29 1861 Oosima and Ura Kami Harbours.)\n30 1861 Western Entrance to the Seto Uchi or Inland Sea (Japan.)\n31 1861 Seto Uchi or Inland Sea.\n32 1861 Tsu-sima Sound, Korea Strait (Japan.)\n33 1859-1861 Western Coasts of Kiusiu and Nipon, including Tsu-sima and adjacent Coast of Korea.\n34 1863 Japan (Nipon, Kiusiu and Sikok, and part of Korea.)\n35 1845 Port Hamilton (China-Korean Archipelago.)\n36 1860 Hai-yun Island, including Thornton Haven (China, North Coast.)\n37 1860 Talien-whan Bay (China, North Coast.)\n38 1860 Liau River, East Coast (China.)\n40 1860 Peiho or Peking River—from Tung-chow to Peking (China, Gulf of Pecheli.)\n\n* The Maps being numbered, I have been obliged to follow the arrangement, or I should say the disorder of the List printed in the Council's Report for 1865, merely correcting the spelling of Names and placing the right number against the right name; in the List of 1865 the numbers do not correspond to the Maps from 82a to 69.—H. C.\n41 1860 Peiho or Peking River—from Tientsin to Tung-chow (China, Gulf of Pecheli.)\n42 1858 Peiho or Peking River—from Entrance to Tientsin (China, Gulf of Pecheli.)\n43 1858 Peiho or Peking River—from Entrance to Tientsin (China, Gulf of Pecheli.)\n44 1840 Approach to the River Peiho and the Sha-lui-tien Banks (China.)\n45 1859 Gulf of Pechili—Chikau to Ninghai.\n46 1860 Pechili Strait—showing the various Channels into the Gulf of Pechili.\n47 1860 North Coast of Shantung—Chifu or Yentai Harbour.\n48 1860 Lung-mun Harbour (Province of Shantung.)\n49 1860 Wei-hai-wei Harbour (do.)\n50 1862 City and Environs of Shanghai.\n51 1858 Entrance of Wusung River (China, Wusung River.)\n52 1842 Chapoo Road (China.)\n53 1840 Ting-hae Harbour in Chusan Island (China.)\n54 1849 Nimrod Sound.\n55 1849 San-moon Bay and Sheipoo Harbour.\n56 1849 Eastern Coast from Hieshan Isles to the Yang-tsze-kiang, including the Chusan Islands (China Sheet VIII.)\n57 1849 East Coast—from Pi-ki-shan to the Heishan Islands (China Sheet VII.)\n58 1849 Nam-quan Harbour.\n59 1846 Sam-sah Bay.\n60 1849 From Ragged Point to Pih-ki-san Eastern Coast (China Sheet VI.)\n61 1854 River Min—from Entrance to Fu-chau-fu.\n62 1843 Haitan Strait.\n63 1843 From Port Matheson to Ragged Point (China Sheet V.)\n64 1844 Chinchew Harbour.\n65 1849 Hooetow and Chimmo Bays.\n66 1868 Amoy Harbour and Approaches.\n67 1868 Amoy Inner Harbour.\n68 1844 Tong-sang Harbour and Hutau Bay (China.)\n69 1844 Pescadores Islands (China.)\n70 1844 Eastern Coast—from Chauan Bay to Port Matheson, including the Pescadores Islands (China Sheet IV.)\n71 1842 Plan of Harlem's Bay and part of Coast of China.\n72 1844 Namoa Island (East Coast of China.)\n73 1845 Eastern Coast—from Chelang Point to Chauan Bay (China Sheet III.)\n74 1841 Hongkong (China.)\n75 1845 Mirs Bay (China, East Coast.)\n76 1845 Eastern Coast—from Hongkong to Chelang Point (China Sheet II.)\n77 1888 Toongkoo or Urmstone Bay.\n78 1859 Si-kiang or West River—from Kaukong to Chausun.\n79 1861 Canton River (Chukiang.)\n\nIndischer Ocean, \"Novarra,\" 7 Maps, 1857-58.\nMissionary Map of China, embracing chiefly the eighteen Provinces from the latest and best authorities, by O. B. Bidwell, New York, 1850.\nStanford's Library Map of Asia, constructed by A. Keith Johnston, London, E. Stanford.\nMap of portion of Quang-tung (T. W. Kingsmill fecit.)\nThe North-East Provinces of China.\nPlan of the English Settlement at Shanghai (1 Coloured Copy and 1 Plain do., 2nd ed., 1864-66.)\nPlan of the Hongkew or American Settlement at Shanghai (2 Plain Copies, 1 Mounted Coloured do.) 1864-66.\n— Road Map from Pekin to Kiaolita, by the Great Canal Route, based on an English Map, chiefly taken from a Russian Sketch, made in 1858 (in a Chinese Cover.)\n\n— Military Plan of the Country around Shanghai, from surveys made on 1862—63, 64 and 65, by Lieut. Col. Gordon, C.B.; Major Edwardes; Lieuts. Sanford, Lyster and Maude, Royal Engineers; Lieuts. Danyell and Bateman, H. M. 81st Regt. Assist. Engineers. Topog. Dep., War Office, Southampton, 1865. Sheets 1, 8, 9, 22, 23, 26, 27, 28, 30, 31, 32, 34, 35 and 36.\n\nPLANS.\n\n— Proposed Rooms for the N. C. B. of the R. A. S. and Shanghai Library.\n  Front Elevation.\n  Ground Plan.\n\n— Proposed Library and Museum for the N. C. B. of the R. A. S.\n  Front Elevation.\n  Ground Plan.\n  First Floor Plan.\n  Upper Room.\n\nVide in the Journal of the Royal Geographical Society, XIV, 117 (1844), an Article by Mr. William Huttman \"On Chinese and European Maps of China.\"\nII. CHINESE WORKS.\n\nTOPOGRAPHICAL WORKS.\n\n| No. | Title                                      | Description                  |\n|-----|--------------------------------------------|------------------------------|\n| 1   | 志通西陝 *Shen-se Province                 | 27 Vols.                     |\n| 2   | 志通川四 *Sze-chuen Province               | 110 ,,                        |\n| 3   | 志通東廣 *Kwang-Tung Province             | 120 ,,                        |\n| 4   | 志通南雲 *Yun-nan Province                | 12 ,,                         |\n| 5   | 志總江浙 Che-Keang Province              | 100 ,,                        |\n| 6   | 志府寧江 *Keang-Ning Prefecture           | 12 ,,                         |\n| 7   | 志府州池 *Che-Chow Prefecture             | 16 ,,                         |\n| 8   | 志府興嘉 *Kea-Hing Prefecture             | 40 ,,                         |\n| 9   | 志府封開 *Keae-Fung Prefecture            | 10 ,,                         |\n| 10  | 志府德承 *Ching-Tih Prefecture            | 24 ,,                         |\n| 11  | 志州開 *Keae Department                  | 6 ,,                          |\n| 12  | 志府州蘭 *Lan-Chow Prefecture             | 8 ,,                          |\n| 13  | 志縣陰江 *Keang-Yiu District             | 16 ,,                         |\n| 14  | 志縣海上 *Shanghai District               | 16 ,,                         |\n| 15  | 志縣陽洛 *La-Yang District               | 23 ,,                         |\n| 16  | 志縣湖蕪 *Woo-Hoo District               | 12 ,,                         |\n| 17  | 志縣暨諸 *Choo-ke District               | 10 ,,                         |\n| 18  | 志縣湖平 *Ping-Hoo District              | 8 ,,                          |\n| 19  | 志縣雲縉 *Tsin-Yuen District             | 10 ,,                         |\n| 20  | 志門夏 *Hea-Mun (Amoy)                   | 12 ,,                         |\n| 21  | 志山廬 *Lew-Shan (Kiukiang)              | 8 ,,                          |\n| 22  | 志山夷武 *Woo-Ee (Bohea) Hills           | 10 ,,                         |\n| 23  | 書全利水蘇江 *Water Courses of the Kiang-Soo Province | 12 ,, |\n| 24  | 聞舊下日 *Antiquities of Pekin          | 12 ,,                         |\n| 25  | 册府元龜 *Thesaurus of History           | 200 ,,                        |\n| 26  | 末本事紀史宋 *Historical Records of the Sung Dynasty | 13 ,, |\n| 27  | 末本事紀史元 *Historical Records of the Yuen Dynasty | 2 ,,  |\n| 28  | 末本事紀史明 *Historical Records of the Ming Dynasty | 40 ,, |\n例則部兵 *Regulations of the Board of War .......... 16 Vols.\n例則部工 *Regulations of the Board of Works ...... 12 ,\n典大倫明 *Ritual Services during the Ming Dynasty 10 ,\n禮通清大 *Ritual of the Reigning Dynasty (Ta-Tsing) 16 ,\n孫義官周定欽 (*Commentary and Development of the Chow Ritual) 24 ,\n表草沿理地代歷 { *Chronological Record of Territorial Changes } 24 ,\n志圖國海 *Geography of the World .................. 24 ,\n書全政農 *Cyclopedia of Agriculture ................. 24 ,\n書遺氏鄭 { *Posthumous Works of the Moral Reformer Ching } 86 ,\n經微太 *Work on Divination ....................... 10 ,\n律詞 *Rules for Choral Rhyming ................... 12 ,\n範印古集 *Seal Collector's Guide .................. 10 ,\n錄藝通 *Manual of the Arts ........................ 16 ,\n\nFOREIGN WORKS TRANSLATED INTO CHINESE.\n\n42 Loomis' Analytical Geometry, and Differential and Integral Calculus, translated into Chinese by A. Wylie, Shanghai, July, 1859. 3 vols.\n43 Wheaton's International Law translated into Chinese by W. A. P. Martin, D.D., of the American Presbyterian Mission; assisted by a Commission appointed by Prince Kung—Published at Pekin at the Expense of the Imperial Government, 1864. 4 vols.\n44 Translation of Herschell's Outlines of Astronomy into Chinese, by A. Wylie, Shanghai, December, 1859. 3 vols.\n45 Compendium of Arithmetic—A. Wylie, Shanghai, December, 1853. 1 vol.\n46 Two lists of Selected Characters containing all in the Bible and Twenty Seven other Books with Introductory Remarks by William Gamble, Shanghai, Presb. Mission Press, 1865. 1 vol.\n47 Tientsin British and French Treaties and Conventions. 1 vol., 1860.\n48 The Bible in Chinese.\nADDENDA.\n\nJ. Haas: Chinese Translation of the Programme of the Vienna Exhibition. 1873, 2 vols.\n\nBulletin Mensuel de la Société d'Acclimatation. Mai et Septembre 1872.\n\nERRATA.\n\nNo. 85 Read S. Julien's Mencius in Chinese not in China.\n,, 248 The Work is complete.\n,, 416 Read Trois pièces reliées.\nTHE BORROWER WILL BE CHARGED AN OVERDUE FEE IF THIS BOOK IS NOT RETURNED TO THE LIBRARY ON OR BEFORE THE LAST DATE STAMPED BELOW. NON-RECEIPT OF OVERDUE NOTICES DOES NOT EXEMPT THE BORROWER FROM OVERDUE FEES.\n\nWIDENER BOOK DUE CANCELLED 1988 26053744\n\nNOV 25 1963\n", "source": "olmocr", "added": "2025-09-26", "created": "2025-09-26", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/acataloguelibra04librgoog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 106, "total-input-tokens": 166392, "total-output-tokens": 93945, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 248, 6], [248, 268, 7], [268, 939, 8], [939, 939, 9], [939, 2736, 10], [2736, 3882, 11], [3882, 7358, 12], [7358, 10456, 13], [10456, 13070, 14], [13070, 15957, 15], [15957, 18806, 16], [18806, 22458, 17], [22458, 25784, 18], [25784, 28701, 19], [28701, 31668, 20], [31668, 34593, 21], [34593, 38019, 22], [38019, 40876, 23], [40876, 43763, 24], [43763, 46949, 25], [46949, 49657, 26], [49657, 52841, 27], [52841, 55771, 28], [55771, 58713, 29], [58713, 61936, 30], [61936, 65297, 31], [65297, 68270, 32], [68270, 71472, 33], [71472, 74458, 34], [74458, 77785, 35], [77785, 80185, 36], [80185, 84985, 37], [84985, 88757, 38], [88757, 91874, 39], [91874, 96201, 40], [96201, 99217, 41], [99217, 102337, 42], [102337, 105810, 43], [105810, 108925, 44], [108925, 112323, 45], [112323, 115534, 46], [115534, 118978, 47], [118978, 122055, 48], [122055, 124927, 49], [124927, 127979, 50], [127979, 131382, 51], [131382, 134771, 52], [134771, 138099, 53], [138099, 141104, 54], [141104, 144866, 55], [144866, 148134, 56], [148134, 151183, 57], [151183, 153520, 58], [153520, 157144, 59], [157144, 160593, 60], [160593, 163976, 61], [163976, 167353, 62], [167353, 170624, 63], [170624, 173883, 64], [173883, 176844, 65], [176844, 179893, 66], [179893, 183218, 67], [183218, 186198, 68], [186198, 188967, 69], [188967, 191388, 70], [191388, 194190, 71], [194190, 197153, 72], [197153, 200110, 73], [200110, 203027, 74], [203027, 205771, 75], [205771, 208323, 76], [208323, 210778, 77], [210778, 213202, 78], [213202, 215722, 79], [215722, 218858, 80], [218858, 221818, 81], [221818, 226685, 82], [226685, 229405, 83], [229405, 229405, 84], [229405, 232853, 85], [232853, 236317, 86], [236317, 239284, 87], [239284, 242814, 88], [242814, 246428, 89], [246428, 249089, 90], [249089, 251818, 91], [251818, 254614, 92], [254614, 257537, 93], [257537, 257537, 94], [257537, 260121, 95], [260121, 262690, 96], [262690, 263602, 97], [263602, 265983, 98], [265983, 267590, 99], [267590, 267888, 100], [267888, 267888, 101], [267888, 267888, 102], [267888, 267888, 103], [267888, 267888, 104], [267888, 268152, 105], [268152, 268152, 106]], "primary_language": ["en", "None", "None", "None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "fr", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "fr", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "fr", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, true, true, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]