[{"id": "812e08e83a31672a3da52f602c7f75fde31b2840", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n鮮朝\n\nVol. IV Part III.\n\nSupplied gratis to all Members of the Society.\nPrice to Non-Members, Yen 2.50.\n\nOn Sale at\nSeoul, Korea: ION LIBRARIAN.\nYokohama, Shanghai, Hongkong, Singapore: KELLY & WALSH, Ltd.\nLondon: KEGAN PAUL, TRENCH, TRUBNER & Co., Ltd.\nParis: ERNEST LEROUX.\nLeipsic: OTTO HARRASSOWITZ.\nNew York: GEO. STECHERT.\n\n1913.\nMARRIAGE CUSTOMS OF KOREA.\n\nBy Arthur Hyde Lay.\n\nDr. Gale has invited me to furnish the Society with a paper before I go home and as you were so good as to honour me by making me President last year, I feel that I ought to do something in response to his request. I have accordingly looked up and revised a few notes which I put together some years ago on Marriage Customs in Corea, and though only dealing with the question in a very rough way, they may perhaps be of some interest.\n\nMany curious marriage customs are to be found in Corea. According to the station in life of the parties and the locality, differences of course exist, but the ceremonials observed are all founded upon the same general plan adopted from China. In Volume VI of the China Review there is an interesting article on Chinese Marriages which illustrates this fact.\n\nIt was generally held in ancient times that a boy should marry from fifteen upwards. This is stated in the Si Hang Kalye H'wi Chan (時行簡禮彙纂). In the Sa-rye Pyol-lam (四禮優覽) written by the great scholar Yi Chai early in the 18th Century the age is put as 15 to 20. But nevertheless owing, no doubt, to the longing for male offspring to take their part in ancestral worship the practice of marrying very young came into vogue. Often a son had not long made his appearance in the world before the parents began to cast their eyes around in search of his future wife, and indeed, there were instances where unborn babes were pledged in matrimony. Among the wealthy marriage took place as a rule when the children were ten or eleven years old, and an Aged Father with a young son liked to see him settled in this way as early as might be. With ordinary people, however, it was usual to\nallow the children to attain the age of fifteen or sixteen before they entered upon the married state, though their partners were probably selected a long time before.\n\nThe system of early marriages was productive of much misery. Apart from the young people themselves who were the principal sufferers, the burden of support fell at times upon the eldest brother, the father being dead. A Corean who was thus called upon not only to maintain his younger brother, but further to provide him with a wife with additional attendant expenses, once complained to me bitterly of the hardship involved.\n\nA change for the better was, however, effected when the legal age which persons must attain prior to marriage was fixed by an Imperial Order, issued on August 14, 1907 at full seventeen years and full fifteen years in the case of a man and of a woman respectively, just as in Japan under Article 765 of the Civil Code. The Order ran that it was a famous law of the three ancient dynasties (Ha, Eun, Ju) that men had their wives when they were thirty years old, and women their husbands when twenty years old. Early marriage being an evil which nowadays had resulted in national weakness, an instruction had been given in recent years forbidding them, but owing to the mistake of the Authorities this had not been put into force. At the time of restoration it was an urgent matter that customs be improved, and so the age was fixed as indicated. The prohibition referred to is contained in resolution No. 7 of the Deliberative Assembly of July 30, 1894.\n\nAs to the present system of registration for Corean marriages, they must be reported, in accordance with a Census Registration Law promulgated by the late Corean Government in 1909, by the head of the family to the local Village Headman Myun Jang, (面長) within ten days. The latter then forwards the report for record to the Police Station where the census registers are kept and the business of registration is conducted. Now that Corca is part of Japan the tendency is growing to conform to Japanese ideas in the matter of marriage ceremonials.\nMissionary influence having made itself largely felt in this as in other directions throughout Corea, many marriages are conducted in accordance with the rites of the various Christian Bodies.\n\nAs a general rule marriage does not take place between families of the same surname possessing the same ancestral homes-pon (本). One hears, however, of persons of the same name such as Kim (金), Yi (李), &c. intermarrying, the reason being that their pon differ. On the other hand, there are cases where those of different surnames are not permitted to marry each other, because they are said to trace their origin to a common source.\n\nYoung people are not consulted as to their inclinations: in fact they have seldom even seen one another before becoming husband and wife. The parents exercise supreme authority in the matter. Hence much affinity or romantic affection cannot be looked for. The writer was, however, once given to understand by a Corean of the Yangban class, that second marriages were as a rule love matches, at least on the man's side. His opportunity to please himself in selection had come, but as objections were entertained among parents to allowing their girls to become the wives of widowers, the choice often required to be made from a lower stratum of society. Against a widow a much more marked prejudice used to exist with the result that she was made to feel the extreme impropriety of her forsaking the memory of her late husband by being regarded as occupying the position merely of a secondary wife. Prior to the reign of King Sung Jong who ascended the throne in 1469 widows had been allowed to remarry, but His Majesty gave orders that the practice should be discontinued. On July 30, 1894 it was resolved by the Deliberative Assembly that widows might remarry (resolution No. 8).\n\nLet us suppose that a youth had reached the age at which his parents considered it advisable that he should be wedded. Having first of all ascertained by private enquiry that a certain maiden was likely to prove suitable as regards appearance and\nthe other requirements of eligibility they resorted to the indirect negotiation so favoured in the Far East. That important and useful personage, the gobetween who may be of either sex, CHUNGMAI (仲媒), called also MAIPA (媒婆), in the case of a woman, was deputed to undertake the delicate task of broaching the subject to the young lady's parents. Were it intended to take the proposal into serious consideration, the latter for their part despatched their own delegate to the house of the would-be father-in-law to ascertain the qualifications of the young man. The preliminary investigations having been concluded to mutual satisfaction, formal negotiations were proceeded with at once in a business-like manner. For the sake of illustration, we shall describe what is likely to occur. The details which we give are taken from a case we know of which occurred about 5 or 6 years ago, and of course the interval between each stage in the proceedings may vary according to circumstances.\n\nLet us say that in the 5th. month—at that time the Coreans still adhered to the old Chinese calendar—the work of the intermediary is concluded. On the 13th day of the 6th month the first important step is taken by the parents of the future bridegroom. This consists in sending the SAJU (四柱)—a document wherein are inscribed the four sets of two characters each, specifying the year, month, day and hour of birth of the son—to the Father of the chosen one. Now the Saju represents a marriage note handed over for the purpose of ratifying the agreement. In reply, twelve days later, comes a letter bearing the words Yon-gil (擇吉) on the envelope, which is known as the TAIK II. (擇日) (choosing the day), naming the date of the marriage. Then both families commence earnest preparation for the approaching event. On the last day of the month the fiance makes himself ready for his new honours by going through the ceremony of doing up his hair, KWAL LE (冠禮), the hair being arranged by some one specially selected as being a lucky person. In the days before hair cutting came into fashion, an unmarried youth in Corea was distinguished by\nbare head and hair tied in a plait falling down his back, and to do up the hair and put on a hat, to get married, and to become a man were three things interdependent. With the putting up of the top knot a new name KWAMMYUNG (冠名) is bestowed on the lad. At the same time he puts on the POKGON (幅巾) or silk gauze cap worn by boys at weddings and the CHORIP (草笠) or straw hat, in use by newly wedded youths. Sometimes indeed a man put up his hair without being married but this was done unostentatiously and was considered in the highest degree improper.\n\nThe prospective bridegroom having thus observed all the formalities necessary to entering upon man's estate, the marriage deed or contract is drawn up by his father for presentation to the other contracting party. The document approximately runs thus:\n\n\"With double reverences I, So and So, descendant of such an One, present my respectful wishes on this . . . day of the year . . . for Your Honour's manifold happiness, and hereby humbly agree, with your gracious favour and permission to your daughter's becoming the wife of my son . . . who is of age and a bachelor. It is the custom of our ancestors and wedding presents are bestowed. With respectful wishes I offer this document and beg that you will note its contents.\"\n\nOn the envelope is inscribed the name of the Father of the bride elect.\n\nThis instrument together with the Sajiu (四柱) and the Taik-il (擇日) constituted the record of the marriage; for in Corea there was formerly no system of public registration of weddings, a fact which in my early days in Corea a Corean official of a reforming turn of mind stigmatized to me as regrettable, expressing the hope that, in view of the grave inconvenience entailed, some proper method of recording such events might before long be introduced. The available documents therefore were doubly precious and as such carefully preserved. It was commonly said that they should be kept till the daughter had brought forth at least one son, though the\nadvent of three sons was said to be necessary before they could be disregarded, the idea being that male children consolidated the position of the wife by arousing the regard of the husband on the one hand and on the other by anchoring the woman to the spot where her sons lived. Before such an auspicious event the man might desire to dismiss her arbitrarily or she might be inclined to run away through lack of any retaining influence. Should, however, the wife leave of her own accord or be sent away for any reason, the contract was given back.\n\nAs to the gifts to which reference is made, they are called NAPCHAI (納采) or NAPPEI (納幣), presents of silk. Custom regulates their quantity and quality in accordance with position. In the instance we are considering they consist of two pieces of Chinese silk, one of a blue colour wrapped up in red paper, the other red and folded in blue paper and two skeins of silk thread, one blue, the other red, to correspond with the stuff. A girl who marries a bachelor wears the red garment outside and the blue underneath, but where her consort is a widower the order of the garments is reversed. Along with the marriage deed enveloped in a cloth, these offerings are placed within a black lacquer box enclosed in two coverings of red cloth. In some cases, however, two boxes are used to contain the gifts, one black, the other red. Thus the parcel is conveyed to its destined recipients during the evening of the 12th day of the 7th month, the eve of the wedding day which has itself been selected as propitious by the aid of an expert in the art of choosing lucky days. In the country the gifts are usually sent on the wedding day, not the previous evening. In order to conform to precedent the ceremonial of presentation calls for the services of a box carrier for whom the orthodox dress is a red overcoat with hat of the same colour and black shoes. In some parts of the interior the coat is blue-black with hat to match. He is accompanied by four lantern-carriers in black coats, and six or seven torch-bearers. The procession is met by torchmen from the other house and escorted to its goal where the casket is deposited upon a table placed in readiness.\nThither as early next morning as 7.30 the bridegroom elect sets out to take part in the appointed ceremony. In full court cap, dress and shoes he is seated upon a white horse, gorgeously caparisoned—we are citing as an example the case of a bachelor, for though he has the alternative of making the journey in a chair carried by four men, a widower should never go on horse back. In front, walk two servants carrying paper umbrellas, and the rider is attended by a groom in black coat and hat. The train is further composed of one of his relatives acting as bestman on a steed of some description, it matters not what, two pairs of lantern-carriers—the rich sometimes have ten pairs or so—a goose carrier clad in red, the same individual who has already taken the presents, bearing the live bird, the emblem of conjugal fidelity, wrapped in a red cloth—or a wooden figure in the form of a goose may be employed—six female servants clothed in upper garments of green and lower garments of blue and a YUMO (乳母) or nurse in a two-man chair. It must here be mentioned that most of the costumes and other things required in connection with a marriage are only borrowed for the occasion. In Seoul and other large cities there are establishments which make it their exclusive business to keep such articles for hire. In some country places the outfit is village property and as such is at the disposal of the residents free of charge. Neighbouring villagers wishing to share its use are compelled to pay.\n\nOne of the bride’s male relations, say some ten years older than the bridegroom, welcomes him coming thus with proper pomp and circumstance. The latter bows once in silence and the other merely bends his body slightly in return. Bows are exchanged when the relative positions of the two men are approximately equal. Arrived at the house the party enters the courtyard which is shaded from the sun’s rays. Care must be taken by the future husband and those with him on first admittance to avoid violating the Chui-dang (周堂) or prohibition against being found by evil spirits in such part of the premises as they may happen to be frequenting. Similarly with the wife\nwhen she makes her debut in her new home. Inside the fence or wall a small table is prepared for the reception of the goose. The bridegroom then goes through the prescribed ceremony. The bird is handed to him by its bearer, and having assumed a position at a convenient distance, he holds it in his arms, takes three steps forward and deposits it upon the table, then stepping backward in like manner, with the assistance of the man in charge of the goose, performs two obeisances in its direction in token of his desire that the faithfulness of which it is the embodiment may rest upon his union. The next scene takes place within the house. The bridal table, TOK-JA-SANG (독자상), before which the pair plight their troth, has been spread with specially prepared meats consisting of a male chicken, cooked, with a red date in its mouth and a dish of red dates before it, a female chicken, cooked, having in its mouth a white chestnut with the skin peeled off, and in front of it a dish of raw chestnuts, and also a plate of moon-shaped cakes, twenty-one in number. At two corners of the table are wooden candlesticks with lighted candles of wax and at the other corners are TONGJA (童子) or wooden images representing children. Behind the table is a high screen to conceal the bride till she comes forth to commence her acquaintance with a strange person of the opposite sex. The man having taken up his station, she appears in bridal array, wearing a wedding cap, CHYOKDORI (族頭里), and clad in a WON-SAM (圓衫), a kind of cloak which is also used as a shroud at her burial, having a dragon headed hair pin in her hair, and she stands at the other side of the table. Then they pay their respects to each other in the customary fashion. The woman first of all performs four obeisances, assisted therein by a maid servant at each side. Having already made two reverences before the goose, the man, also helped in the performance, contents himself with bowing twice. A widower marrying for the third time is only supposed to make three obeisances in all, and for the fourth time only two. The lady wears a long garment to conceal her feet as a mark of honour to the bridegroom, who in courtesy has long sleeves covering the hands.\nHer eyes are understood to be fastened up, but this custom, like many others, is often more honoured in the breach than in the observance, and she may simply keep her eyes shut. It is contrary to etiquette for her to utter a word on her wedding day. The bowing finished, the ceremony of drinking wine, three cups of which are presented to each, remains to be performed. Here again, however, the wine is not of necessity actually consumed. The cups are exchanged through female servants, waiting one on each side of the table, and instructed by some of the bride's relatives. Those passing from the bride to her husband make their way along the right side of the table, those from him to her along the left side. The reason given is because in Korea the left side is honoured by men and the right by women. Sometimes the husband drinks a little of the wine but the wife abstains, though all the same each must touch the cup with the lips. After this is over, the newly married couple may sit down together for the first time. The whole function described having lasted for about an hour, the bridegroom is conducted into a specially prepared room where he is regaled with a feast along with the best man, who retires immediately the repast is concluded, and the servants are likewise entertained in the proper place. At noon comes the \"going away,\" the wife departing behind her lord and master, like a dutiful Oriental spouse, carried by eight bearers in a chair the roof of which is decorated with tiger skins. She is followed by two umbrella-carriers and four lantern-bearers in the black coats, called HEUK-EUI (黑衣), used by chair men and official servants, twelve maids with garments, green above and blue below (in olden times the lower garments were red, and even now small girls have them of red), the YUMO (乳母) or nurse, in a two-man chair, and a room attendant PANG-JIK-I (房直) following. The Jinrikisha is often employed as a modern innovation in the procession. Returned home the bridegroom does reverence to his parents. Presents of money are bestowed upon all the attendants. At one o'clock in the afternoon, so that no time may be lost, the union is, as it were, consecrated through a visit paid by\nthe pair to the temple containing the ancestral tablets of the bridegroom's house, where are spread offerings of wine, fruit and dried fish. Each of them reverently inclines the head two times. When the family does not possess any such tablets, the same rites are gone through in the house before screens on which are pasted papers, CHI-BANG (紙榜), inscribed with the titles and degree of relationship of the four preceding deceased ancestors, both male and female. Now the bride is in a position to make the acquaintance of her father and mother-in-law, though some authorities hold that the introduction should take place prior to the visit to the temple. On this occasion she presents to the former a dish of dates, and to the latter a cooked pheasant, and to both three cups of wine, making an obeisance in each case. The other members of the family to which she has been admitted are next made known to her. Immediately afterwards the time comes to do especial honour to the bride and she goes through a ceremony which is called KWAL LE (冠禮), as in the case of the man. Her hair already dressed for the wedding is undone and then braided into two coils and fastened in a knob by her mother-in-law. She is adorned with an artificial head dress, a dragon-headed gilt hair-pin, a wedding cap, and also receives seven upper garments of Chinese silk, a red Chinese silk under garment, as well as jewellery, hair pins, finger rings and clothing of various kinds. Thus fitted out, she is entertained at a banquet.\n\nLater in the afternoon the couple return to the house of the bride, where they spend three nights. The morning following the wedding the son-in-law is introduced to his relatives by marriage and his parents-in-law make him a present of a suit of clothes, a hat with horse hair head-band and shoes.\n\nOn the third day is the final home coming when all the bride's belongings are carried with her to the new home where the parents are awaiting the obeisances usual at this time. Three days afterwards the husband is once more taken to his wife's old domicile, either on a horse or in a chair, supplied by her people. This is known as the second going, CHIAI-HANG (再行).\nIn out of the way places, this may be done in the wedding month, or postponed till the third month. In the same month the wife is sent on a similar visit, provided with presents of wine, cake and vermicelli. Should some obstacle come in the way and prevent her from going, custom demands that the visit be postponed till the third month of wedded life. In the country where the two homes are separated by long distances, she returns to see her parents in the year of her marriage, but should she be unable to do so, the visit must on the same principle be postponed till the next year but one after the event.\n\nWhat we have described is a full ceremonial such as is observed among the better classes, but variations and abridgements occur to suit individual pockets and positions. For example, amongst the lowest classes the marriage is sometimes celebrated at the house of the bridegroom. Let us glance, by way of illustration, at a Corean wedding in humble life which was contracted within the last six years in Seoul. The whole ceremony lasted about two hours. Close on eleven o'clock in the morning the guests began to assemble at the bridegroom's house and soon afterwards the happy man himself appeared on the scene mounted on a led pony, white in colour, with high saddle, decorated as to its mane with coins and ribbons and between the ears, with red pompons. Two men walked in front, one carrying a large oil paper umbrella, the other the goose, while two attendants, also with similar umbrellas, followed in the rear. By and by a messenger came hastening to say that the bride was near at hand, and she arrived in a closely covered Corean chair, smartly curtained and hung with tiger skins. Behind attendants bore her paraphernalia. By her chair walked two women who upon reaching the house lifted her out and almost carried her into the small room. After making her obeisances she was supported till she reached her allotted place on the wooden floor. Her eyes were firmly sealed, her face thickly coated with white flour, her eyebrows fashioned into a narrow line to make them conspicuous, the hair over her forehead brought into the straight conventional shape by the pulling\nout of superfluous hairs, the cheeks and lips painted red. Brightly coloured silk formed her dress. After the wedding the female guests crowded round and submitted her to a minute inspection and the poor girl had to remain thus till sunset motionless. In this case the bride was sixteen, her husband about twenty and to follow their fortunes a little further, they now live with his mother of whom he is the eldest son, the daughter-in-law taking the chief part in the care of seven young brothers and sisters-in-law, leaving the older dame free to attend to a small shop. One heard with no little surprise that they were subsequently reported to be a happy family.\n\nAltogether the position occupied by a married woman is nominally a low one, as can be gathered from the terms by which she is referred to. She has no name of her own, but is known by the name and title of her husband with the word \"house\" placed after them, as Mr. So and So's house. It is unusual for persons other than relatives to make enquiries regarding a man's womenfolk, but when his wife is alluded to by him he speaks of her as \"that person,\" as Ko Siki, which is an word without meaning, or he uses some other disparaging expression.\n\nMarriages in the old way, it can readily be imagined, are a cause of much useless expense which bears heavily upon the poor who can not really meet the outlay and have to borrow money to keep up the appearances supposed to be called for on such occasions. Thus matrimony is begun in debt from which it is not easy to secure freedom in after life.\n\nIt may be worth while noticing what the Coreans themselves have to say about their national observances on the occasion of a marriage, and therefore from the columns of the \"Cheguk Shinmun\" (帝國新聞), a Corean newspaper formerly published in Seoul, I took in 1906 the following particulars of customs observed in various parts of the country.\n\nIn Kyöng Geui (京畿), Ch'ung Ch'öng (忠淸), Kang Wün (江原) and Kyöng Sang (慶尙) Provinces marriage customs are practically identical, differing only in details, but in the North\nand West and everywhere by the seashore they are of a special character. In the two first-named divisions of the country the initial step is taken by the parents of the bride in posse who transmit a CHU DAN (柱單), or letter asking for the SAJU (四柱) to the house where the young man lives. Formal consent to the marriage is regarded as having been obtained when the latter document is forth-coming in response, and the rupture of an engagement is a grave matter involving the return of the SAJU (四柱). When all the arrangements for the union are completed and the day fixed is about to arrive, a marriage note HON SO CHI (婚書紙), with a trifling gift of two under-garments, is sent to the bride’s house in a lacquered box. On the auspicious occasion a goose is presented and the wedding table, HON PAI SANG (婚配床), is placed between the bride and bridegroom and the ceremony takes place, consisting in the exchange of obeisances, four rendered by the woman and two by the man in return.\n\nIn the northern and western districts negotiations are originated by the despatch of a middle-woman, MAIPA (媒婆), to the girl’s house. Should her parents be agreeable, they await the receipt of a formal application before granting their sanction. When the wedding day comes, a contract note may or may not be given, but there is no bestowal of garments or box, nor are there any bowings. In these places a goose is employed at the ceremony only by persons of rank and wealth who do not exceed two or three in a district. In ordinary cases the bridegroom, wearing a student’s overcoat, DO-PO (道袍), or occasionally official clothes, KWAN-BOK (官服), proceeds on horse back to the house of the bride where he is received in a room made ready, and regaled with special food placed upon a large table called the KUN-SANG ( 큰상). At this moment DAN-CHA (單子), notes written in common language and couched in a jocular and personal strain, asking for food, are brought to him from the scholars of the neighbourhood. On these he inscribes short sentences in reply but if his ignorance be so great that he requires to enlist the services of his best\nnian, HU-PAI (後陪), for the purpose, he is made a laughing stock of. At sunset the bridegroom is introduced into the bridal chamber. After three days the CHOK-CHANG-PUB (足掌法) or practice of beating the soles of the feet, is observed so severely that the bridegroom is pained almost beyond endurance. At Wi-ju (義州) when the KUM-SANG ( 큰상) is placed before the bridegroom, young scholars subject him to much teasing and buy the table from him.\n\nIn the provinces of Kyöng Geui (京畿) and Ch’ung Ch’ong (忠清) it is customary among gentle-folk to make the family of the bride, if they have any means at all, responsible for almost the entire providing, while the bridegroom’s people are content with supplying two undergarments of female attire. The former must furnish two pairs of blankets and even the common utensils, combcases and brass dinner vessels for the young couple, and also the bridegroom’s clothes—indeed so far does their duty in these matters extend that they must keep the bridegroom in raiment for years afterwards. Not unnaturally under the circumstances many daughters are said to be the ruin of a house.\n\nIn parts of the Pyung-An (平安) and Whang-Hai (黃海) Provinces there are in force ceremonial regulations which apply to high and low, rich and poor, alike. It is laid down that when the subject of marriage is broached, the market value of the girl shall be referred to as if the transaction concerned the buying and selling of cattle. She is worth at least two or three hundred Yang (兩) and sometimes more than a thousand, and the contract money is paid over before the marriage is fixed. Of late the sum demanded is reported to have varied according to her age, each year of which, from the time she is first marriageable till she reaches what is considered to be the prime of her maidenhood, advances her price by one hundred Yang (兩). Therefore supposing that she would fetch eight hundred Yang (兩) at eight, at ten she is worth a thousand. Scarcely is there a woman in these parts who is not a wife before she is fifteen. In the majority of cases she is married at seven or eight because of the preponderance of poor people. Notwith-\nstanding that her parents thus make a profit by her, they prepare no clothes for the bridegroom. The practice of selling daughters is observed even by the rich, but there are some such who do not dispose of them in this way, though they do not exceed ten in a district. Social position is at a discount, and all that people care for is to get a good offer for the hand of their daughter. Even a servant if he have the sum needful can easily procure a wife, while a gentleman's son in poverty is at his wits' end. Here the love of money would therefore appear to be the root of all matrimony. Those who have many daughters are counted among the wealthy in contradistinction to their fellow-country men in Kyŏng Geui (京畿) and the southern regions. In recent years many inhabitants of the North-west having emigrated to the provinces of Ham Kyeng (咸鏡) and Kang Wŭn (江原), the custom of receiving money for the bride has been carried with them. In spite of their monetary value, daughters are cared for very badly and when they go away as married women they are treated worse than servants and have to take their food outside. If they are unfortunate in their parents-in-law, they lead lives of misery, eating the burned remains of the rice and doing all kinds of farming work, except ploughing, in addition to sewing, weaving and cooking. In the course of time their lot is ameliorated by the transfer of the larger share of the burden to the shoulders of their own daughters-in-law. The most miserable women in the world may accordingly be said to be those of the Western part of Corea.\n\nAmongst the lowest class in Seoul there is a custom of sending to the bride some days before the wedding pieces of silk and cotton, green stuff for the cloak, money, hair-pins, finger-rings, &c., as PONGCHI (봉치), in a lacquer box, but if the offering be a meagre description, it is sometimes slightly rejected.\nSELECTION AND DIVORCE.\n\nBy J. S. GALE.\n\nIn the selection of a wife, the Five Elements, Metal, Wood, Water, Fire, Earth play a leading part; and also the sixty year-names of the Cycle. The Five Elements have their mutual relationships as expressed thus in Korea, Japan, and China:\n\n木 Wood brings forth Fire,\n火 Fire \" Earth,\n土 Earth \" Metal,\n金 Metal \" Water,\n水 Water \" Wood,\n\nThus you have the circle completed, where Wood and Fire are harmonious, Fire and Earth, Earth and Metal, etc.\n\nOn the other hand, mutual animosities may exist and conditions under which they cannot agree:\n\n木 Wood overcomes Earth,\n土 Earth \" Water,\n水 Water \" Fire,\n火 Fire \" Metal,\n金 Metal \" Wood,\n\nThus are they interlocked, no special Element supreme among them, and yet each is opposed to, and superior to some other. These all enter vitally into the fortunes of the East, bearing directly on the question of marriage, as well as on that of house selection, grave selection, etc. As Mr. Lay mentions, in his paper, the Sa-ju is a commanding document that comes into action even before the selection of bride is made, and before the first preliminaries are yet undertaken. This Sa-ju is the official record of the clan for date of birth, as to year, month, day, and hour. It was a matter of first importance in Old Korea that the exact hour of birth be known, as well as day, month, and year. So the sundial, the\nwater-clock, and the cock-crow of the morning, all contributed to the exact recording of that on which so much in the future depends.\n\nLet us illustrate how matters are influenced by the Sa-ju, (四柱) by supposing that the young man seeking marriage is twenty, that he was born in the year 1892, in the 6th Moon on the 20th day, and at the 5th hour. This provides the necessary four points from which to find one's bearings.\n\nThe first question then is to locate the year 1892 in the Cycle and find its relation to the Five Elements. There are books and helps for this that have been used for thousands of years in the East. Let us apply to one that Korea uses and that is called Ch'on-keni Tai yo (天機大要). In it it will be found that the year 1892, which is called Im-jin (壬辰), has attached to it, as its Element mark, Chang-ryun-Su (長流水) \"Far-flowing Water\". The next task is to find the Cycle name for the 6th Moon, and its relation to the Five Elements. The same book will tell that the Cycle name is Chong-mi (丁未), and it will be found by looking up the table that Chong-mi has for its Element designation, Cho'n-ha Su (天河水) \"Water of the Heavenly River\", or \"Divine-river Water\".\n\nNow taking the question of the day, and looking up the calendar we find that the 20th is Mu-sin (戊申), and that Mu-sin has for its Element, Tai-yok T'o (大驛土) \"Great Post station Earth.\" We find further that the 1st hour of all days beginning with the syllable Mu is Im-ja, therefore the 5th hour will be Pyong-jin (丙辰), and this again is worked out in the Table of Elements, as Sa-jung T'o (沙中士) \"Sand-surrounded Earth\". To sum up then, the Year, Month, Day, and Hour would be Im-jin, Chong-mi, Musin, Pyong-jin or eight characters in all (八字). The Koreans constantly talk of their Eight Characters as being unlucky or lucky. These then worked out according to the Table of Elements would read \"Far-flowing Water,\" (長流水) \"Divine-river Water,\" (天河水) \"Great Post-station Earth,\" (沙中士) and \"Sand-surrounded Earth,\" (大驛土).\n\nNow before we go any further in the way of examining the Sa-ju of the bride prospective, we must look well at this\none of the young man to see if it is propitious in itself. It looks very doubtful for here are Earth and Water each appearing twice, and we know that Earth overcomes Water and that they are mutually opposed. This is the general law, but in this particular case they may be mated without disaster. \"Far-flowing Water\" or \"Divine-river Water\" may exist beside \"Post-station Earth\" or \"Sand-surrounded Earth\" without damage; but had one of the forms been No-bang T'o (路傍土) \"Roadside Earth,\" it would have indicated that the person was unlucky in themselves, doomed in fact, and impossible to marry with. This would naturally end the matter without ever coming to an examination of the young woman's Sa-ju (四柱).\n\nIf you will notice the twelve Oriental Hours which are Cha (子), Chook (丑), In (寅), Myo (卯), Chin (辰), Sa (巳), Oh (午), Mi (未), Shin (申), Yu (酉), Sul (戌), Ha (亥) you will find they enter by combination into each one of these Cycle names, and each hour has a corresponding animal deity:\n\nFor Cha 子 we have the Rat 鼠,\n,, Chook 丑 ,, Ox 牛,\n,, In 寅 ,, Tiger 虎,\n,, Myo 卯 ,, Hare 兔,\n,, Chin (jin) 辰 ,, Dragon 龍,\n,, Sa 巳 ,, Snake 蛇,\n,, Oh 午 ,, Horse 馬,\n,, Mi 未 ,, Sheep 羊,\n,, Sin 申 ,, Monkey 猿,\n,, Yu 酉 ,, Cock 鷄,\n,, Sul 戌 ,, Dog 犬,\n,, Hai 亥 ,, Pig 家.\n\nSome of these creatures are naturally opposed to each other and some again live in harmony. In casting the horoscope for the bride and groom, these Twelve Animals of the Horary Circle are very carefully watched. The Rat and the Sheep are enemies, for the Rat dreads the Sheep's horns. The Ox hates the Horse, because he does not help him plough. The Tiger despises the Cock because his bill is so short. The Rabbit\ncomplains against the Monkey because he does not seek peace and pursue it. The Dragon has a grudge against the Pig because his face is black; and the Snake dreads the bark of the Dog. It may seem like mere child's play, but the old world of the East did not at all view it so, when the wise and learned gave their best attention to finding out how the future of the young married couple would stand as regards these animals.\n\nIn the four cycle names of the young man's Sa-ju (四柱), Im-jin, (壬辰) Chong-mi, (丁未) Mu-sin, (戊申) and Pyong-jin, (丙辰), the three hours Chin (辰), Mi (未) and Sin (申) occur. The corresponding animals are Dragon, Sheep, and Monkey. These are not inimical to each other and so the process may go on.\n\nAs conditions thus far are fairly favorable for the young man, let us now take up the case of the young woman's Sa-ju and we will suppose that her year is 1894, the 12th moon, 15th day, and 7th hour.\n\nBy a similar process we find that the four corresponding Cycle names are Kap-o (甲午) Ch'ong-ch'uk (丁丑) Chong-sa (丁己) and Pyong-o (丙午). These again yield from the Tables of the Five Elements the following formula:\n\n\"Sand-surrounded Metal,\" (沙中金) \"Brook-lower Water,\" (澗下水) \"Sand-surrounded Earth,\" (沙中土) and \"Heavenly-river Water,\" (天河水).\n\nArranged so as to give a comparative view, the two resultants stand thus:\n\n**YOUNG MAN.**\n\nYear, \"Far-flowing Water\" 長流水,\nMonth, \"Divine-river Water\" 天河水,\nDay, \"Great Post-station Earth\" 大驛土,\nHour, \"Sand-surrounded Earth\" 沙中土,\n\n**YOUNG WOMAN.**\n\nYear, \"Sand-surrounded Metal\" 沙中金,\nMonth, \"Brook-lower Water\" 澗下水,\nDay, \"Sand-surrounded Earth\" 沙中土,\nHour, \"Divine-river Water\" 天河水,\nAfter a comparative examination of these two in the light of the Tables as worked out in the Ch'on-keui Tai-yo (天機大要) it will be found that while there are some minor antipathies that might be overlooked, the two formula that pertain to the Month and Hour of the young woman are diametrically opposed to the Day formulum of the young man, that is \"Brook-lower Water,\" (澗下水) and \"Divine-river Water,\" (天河水), would prove the ruin of \"Great Post-station Earth,\" (大驛土) and so, if the seekers are sincere and orthodox, the proceedings will cease from this point.\n\nThis will illustrate the tedious process by which marriage elective affinities are arrived at.\n\nDIVORCE.\n\nThe question of divorce has troubled the world through all its history, from the days of Moses down to the present British Commission that now has the matter in hand for consideration. The great teacher of the East, Confucious, wrote out a statement which has been the law for China, Japan, and Korea for two thousand years.\n\nThis is found in the Lesser Learning Vol. II in the section marked \"Husband and Wife.\" Confucious says:\n\n\"The woman's duty is to prostrate herself submissively before her husband, in such a way as to have no will of her own, but to demonstrate a perfect form of obedience. In three ways she must show it: First, when she is young, by obeying her father; second, when she is married, by obeying her husband; and third, when she is a widow, by obeying her son. There is no place for independent action on the part of any woman. Let not her influence or her voice be seen or heard outside the gates. Her work is to prepare necessaries, entertainment and refreshment for her husband and his friends.\n\n\"Her special place is within the inner court where she is to spend her days. Even though her parents die she must never exceed 100 li in the journey that she would make to take part in the funeral ceremonies. She must make no independent\ndecision, and in all her actions there must be no step taken alone; but only after counsel and direction is she to move, and only after definite proof is she to speak. In the day-time she may not step out into the court for pleasure; and at night, only with a light may she cross the threshold. These are things right and proper for women.\n\n\"There are five things that will disqualify a woman for marriage:—\n\nFirst: if she is the daughter of a rebel or outlaw.\nSecond: if she belongs to a family that has broken nature's laws.\nThird: if her ancestry is branded with marks of imprisonment.\nFourth: if her family has been diseased for generations.\nFifth: if she is a fatherless child and untaught.\n\n\"There are seven reasons for which a woman may be put away by her husband:—\n\nFirst: if she is rebellious toward her parents-in-law.\nSecond: if she has no children.\nThird: if she is unfaithful to her husband.\nFourth: if she is jealous-minded.\nFifth: if she has an incurable disease.\nSixth: if she is given to hurtful talk and tale-bearing.\nSeventh: if she is a thief.\n\n\"There are, however, three conditions that modify these, and in view of anyone of them the woman cannot be put away, although she has fallen under one or more of the reasons for divorce.\n\nThe three conditions are:—\n\nFirst: if she has no father or brothers living to whom she can be sent.\nSecond: if she has worn mourning for three years for her parents-in-law.\nThird: if the husband has risen from poverty to riches while she was his wife.\"\nTHE CELESTIAL PLANISPHERE OF\nKING YI TAI-JO.\nBy W. CARL RUFUS.\n\nINTRODUCTION.\n\nThe presumption of the writer in attempting this paper, when he has spent less than five years in Korea, may be partially justified by the kindness of the encouragement and assistance given by our president, Dr. Gale.\n\nKorean astronomy and astrology have received little attention by students of this country, altho material abounds on every side. Voluminous astronomical works, prepared by royal order, have been published and cherished by the Emperors of Korea. The Mun-hun-pi-go 文獻備考, the great Korean Encyclopedia, gives first place to these subjects, in deference to King Chung-jong 正宗, the originator of the monumental work, who believed in the fatherhood of heaven and motherhood of earth. Dynastic histories chronicle solar and lunar eclipses; the Sam-kuk-sa 三國史 records these important events at the beginning of the history of each reign. The ancient kingdom of Silla 新羅 possessed an observatory, the ruins of which may be seen near its capital Kyung-ju 廣州. In the government museum, Chang-duk Palace, Seoul, are displayed specimens of old astronomical apparatus, including an armillary sphere, a clepsydra, an old iron clock frame, a marble guomic plane, an oblique sun dial, a moon dial or month measure, a brass astrolabe and stellar planisphere of the northern hemisphere, a nameless pear-shaped instrument in a small case, and a marble celestial planisphere or astronomical chart, which is the subject of this paper.\n\nA brief introduction suggesting the influence of astronomical and related physical ideas upon Korean thought and life offers a good avenue of approach to our subject.\nKorea seems to have contributed little to cosmogony, but accepts a physical universe peopled with spirits and an earth possessing vegetation and animal life. The genesis of human life was due to a celestial spirit, who wished to establish an earthly kingdom, and a bear that desired to become a human being. The animal first became a woman, upon whom the spirit breathed. This union produced the Tan-gun, by tradition the first king of Korea. (Hulbert, History of Korea, P. 1.)\n\nThe stars in their stately courses have contributed to the making of Korean history. We read that Keui-ja 箕子, the reputed founder of Korean civilization, 1122 B.C., \"guided, or at least influenced, by the reigning constellation, sailed up the Taetong river.\" (Korean Repositor Vol. 2, P. 83.) established his capital at Pyeng Yang and gave his nine laws to the land. Now we are also confronted with a myth which would identify Viscount Keui with the asterism Keui, 箕, seventh of the 28 zodiacal constellations of the ancients! (A Comparative Table of the Ancient Lunar Asterisms, by T. W. Kingsmill, proceedings of China Branch of Royal Asiatic Society, Vol. 26, P. 59.) Add the history and the myth, subtract the astrolatry of the oriental, multiply by the lapse of years and divide by the demands of science, and the unknown quantity proves the effect of astrology upon the Korean mind. Physical phenomena have changed the course of events. Ancient Silla was once saved by a meteor that fell in the camp of the enemy, because it foretold destruction (Korea Review, Vol. 1, P. 135). Pyeng Yang was prevented from becoming the modern capital by an unpropitious hailstorm. (Korea Review, Vol. 2, P. 179). During the seventeenth century the army was ordered out upon the appearance of two comets presaging war. (Griffis, The Hermit Nation, P. 173). Eclipses, earthquakes, fighting clouds, showers of various articles, thunder in winter, two suns in a day, black spots in the sun, and a white bow in the sun, have also contributed to Korean history. In warfare the celestial army has rendered service; also the miraculous Moon Fortress, the ruins\nof which are near Taiku. Swords and armor were emblazoned with constellations and astronomical inscriptions.\n\nIn religion, the thermometer of a people's life, the physical universe has exerted a powerful influence. Temples are erected for the worship of heaven, the earth and the seven stars; spirit houses are dedicated to the color gods of the five divisions of the sky, to the constellations and the stars, e.g., the Old Man Shrine, in honor of the No-in 老人 star. (The Spirit Worship of the Koreans, Jones, Korea Branch of Royal Asiatic Society, Vol. 2, P. 37). There are also forms of moon worship; men pray to the Pleiades, bow to Venus, and the Emperor as late as 1900 sacrificed for rain. The kitchen god may be a vestige of former sun-worship; in 1235 the King, in refuge on Kangwha island, turned sun-worshiper to obtain peace for the land. The Buddhist counts his 33 heavens and the 28 constellations on the beads of his rosary. Religious feasts and festivals and national holidays commemorate astronomical events. Around these occasions cluster the most characteristic customs of the race, many of which cling to the present day, partly thru the influence of the Yuk-kwă-chăk 六掛丹, an Unmoon book, sown by the thousand thruout the land, indicating the guiding star of every year of life from 10 to 64, and the precautionary measures necessary to ward off evil and to secure success on various undertakings. The almanac for this year in daily use, by employing various astrological cycles indicates numerous combinations propitious or unpropitious for marriages, funerals, journeys, business ventures and other affairs of life.\n\nAs the earth supposedly was patterned after the heavens, geography up to recent times registered the vagaries of ancient star-gazers. Earth was pictured as a four-square plane booked at the corners for support in the all-sustaining heavens. Maps of the nations were unknown; their approximate positions, determined by the orientation of the geomancer's cycle, were marked by squares on a grotesque chart. The divisions of the compass have astrological designations Language and literature also bear the same impress. The 28 constel-\nlations had a part in the origin of the Korean alphabet originally of 28 letters. Proverbs and the folk lore of the country are enriched by astronomical allusions. What is more poetic than this conception,—“The stars are made of the purity of everything?” Or this,—“A shooting star is a bridegroom hurrying to his bride?” This may be difficult of appreciation,—“A silk-worm’s eye-brow moon,”—said of a moon a few days old. What do you think of this,—“Scattering flowers of heaven,”—to designate the ravages of the small-pox fiend? The coinage of this country is said to have included the star money, Sung-jun, 星錢 of Silla, which is omitted by some numismatists, so we make the following quotation. (Korea Review, Vol. 2, P. 339-340) “Another Silla coin was the Sung-jun 星錢 or ‘Star Money.’” This the writer has seen. It is a round cash with a round hole and the impress of two stars; on the reverse is the legend (應天通寶) “Heaven sanctioned eastern treasure.”: “We have before us also a large coin called (七星錢) meaning ‘seven star money.’ It is made in imitation of a Silla coin. It bears a picture of the Great Bear constellation on the edge and a cloud in the center, the latter being the national emblem of Silla, as the plum blossom is of this dynasty. On the reverse is the inscription (如星之長而表世之助) a free translation of which would be ‘as faithful as the stars.’” Lockhart, “Coins of the Far East,” presents many coins used as amulets bearing the impress of stars and astronomical inscriptions. The Korean pharmacopoeia includes a pill formed by splitting the seed of an apricot, writing sun on one part and moon on the other, and sticking them together with honey. (Korea Review, Vol. 3, P. 65.) Divination by stars has been widely practiced, probably the knowledge of the stars was chiefly cultivated and a royal board of astronomers maintained for the purpose. Much of Korean prophecy is stigmatized as ex post facto so we omit examples of astromancy.\n\nThese illustrations could be multiplied many fold, suggesting the influence of the physical universe upon Korean thought. We have noted especially the deep impress of the starry heavens\nupon the most ordinary affairs of life. Even the prosaic pig is said to bear seven spots on its hind legs resembling the seven stars, but for reasons patent to anyone aquainted with this dejected animal, cast out from heaven by the Celestial Dragon, the writer has not ventured to verify the asseveration.\n\nTHE STONE MODELS.\n\nIn the government museum, Chang-duk Palace, Seoul, may be seen two stone models of our subject, bearing the date, Hong-mu 洪武 28th year, 12th month (December, 1395). The older stone, a huge slab of slate, shows marks of transportation and water erosion, rendering the inscription partly illegible; both sides are engraved, but symmetry and proportion are lacking. Special interest, however, centers in this monument, which presents our subject in its oldest Korean garb. The newer stone is an excellent piece of white marble, well preserved; the dimensions are $6' 11'' \\times 3' 3'' \\times 1' 0''$ and approximate weight 3975 pounds. A studied symmetry pervades the plan; the mensuration is quite accurate, the proportion good and the workmanship excellent.\n\nWe learn from the Mun-hun-pi go, Book 3, P. 29-30, that the old stone made in 1395 was originally kept at the Kyung-bok Palace. In 1434 (Syun-duk Kap-in 宣德甲寅) near the Kang-yung-chun 康寧殿 was constructed the Heum-kyung-kak 欽敬閣 in which the planisphere was placed. This building was destroyed by fire, was rebuilt on the site of the ruins, and was again destroyed in 1592 at the time of the Japanese invasion. The Heum-kyung-kak was next built inside the Syu-rin-mun 瑞麟門, Chang-duk Palace, in 1614 (Man-yuk Kap-in 萬曆甲寅), but was torn down by King Hyo-jong 孝宗 in 1656 when he built the Man-su-chun 萬壽殿. The old stone, however, had been left at the Kyung-bok Palace. King Suk-jong 肅宗 (1674-1720), revived the interest in Astronomy. In the 13th year of his reign he ordered Yi Min-chul 李敏哲 to repair the turning-sphere of the preceeding dynasty. Finding that the planisphere\nof Yi Tai-jo was old and indistinct, he ordered a new stone engraved, (the marble model now in exhibition), and built a new house to shelter it. Still the old model was neglected. King Yung-jong 英宗 (1724-1776) heard that the old protograph was in Kyung-bok Palace and ordered the Minister of Finance to transport it to the Bureau of Astronomy in the 46th year of his reign. He put the old stone with the new model in the small house which he christened the Heum-kyung-kak, recorded the history of the planisphere on a wooden tablet, which we have not yet been able to find, and revised the Chūng-sung-ki, which revision is preserved in the chapter on meridian stars in Book 2 of the Mun-hun-pi-go. The last Heum-kyung-kak, which stood north-east of the old stone mount for celestial observations in the present museum grounds, has recently been removed, and the stones transferred to their present location.\n\nThe only foreign mention of the planisphere that we have found is in the Bibliographie Coréenne by Courant. (Vol. 3, P. 28-29.) He honors this production with a half-page descriptive article and the insertion of an excellent print 9\", by 16\". Concerning the stone models he says: \"The engraving of the present chart was made by order of the King in 1395 (Hong-mu 28) according to a rubbing of a more ancient stone, that was previously kept in Pyeng Yang, but had been lost; different corrections were made from the ancient chart.\" \"The planisphere of 1395, having become worn little by little, a new model was engraved on stone in the 18th century with no modification whatever.\"\n\nIn the study of the contents an old rubbing of the chart now in our possession has been used, altho frequent reference to the original has been made.\n\nOUTLINE OF SUBJECT MATTER.\n\nThe title is, A Chart of the Regular Divisions of the Celestial Bodies 天象列次分野之圖\n\nIts contents are:—\n1.—The central astral chart,\n2.—A table of the twelve zodiacal divisions,\n3.—A circular chart of the constellations culminating at dark and dawn for the 24 solar periods,\n4.—A short treatise on the sun,\n5.—The moon,\n6.—The heavens,\n7.—A table of the 28 zodiacal constellations or lunar mansions,\n8.—A history of the chart.\n\nTRANSLATION.\n\nTHE SUN.\n\nThe sun is the essence of the great positive element and the head of all the positive creation. It travels 24 degrees on both sides of the equator (red road). When the sun is distant it is cold, when near it is hot, and when midway it is mild. The positive element operates thus; the sun proceeds north, the days are long and nights short, and because the positive prevails it becomes warm and then hot. The negative works in this way: the sun retires to the south, the days are short and nights long, and because the negative prevails it becomes cool and then cold. If the sun travels south or north the degrees change; when it proceeds and remains at a long distance it is cold all the time, when it returns and remains at a short distance it is warm all the time. So it directs the beneficent power of life and growth.\n\nBeing the symbol of sovereignty, when it traverses the countries possessing knowledge, the days are bright and glorious. Then the king flourishes in prosperity and the people dwell in peace.\n\nThe stars are the glory of the positive essence. The positive element produced the sun, the sun divided and formed the stars; so the character sung 星 (star) corresponds with il 太 (sun) with sāng 生 (beget) underneath. In the Suk-myung\nit is said that the stars scattered and spreading out dotted the heavens.\n\nThe Moon.\n\nThe moon is the essence of the great negative element and the head of the whole negative creation. So it is the sun’s mate, the symbol of the queen; and comparing with virtue it has the meaning of punishment. It also typifies all the feudal kings and ministers of the court.\n\nWhen it travels east of the ecliptic (yellow road) it is called the azure road; south of the ecliptic, the red road; west, the white road; north, the black road. The four roads both on the inside and outside of the ecliptic together with the ecliptic make the nine roads.\n\nEcliptic and Equator.—The road in which the sun dwells is called the ecliptic; and the one midway between the north and south poles, where the degrees are equal, is called the equator. The ecliptic is half outside and half inside of the equator. In the east they intersect a little preceding the fifth degree of Horn, (Kak 角) and in the west a little beyond the fourteenth degree of Astride, (Kyu 奎).\n\nDiscussion of the Heavens.\n\nIn the Ch'in Chi 晉志 the scholars of old say that the form of heaven and earth resembles an egg; the heavens on the outside enclosing the earth, like a shell with the yolk inside. The surrounding part revolves without end. Because the form was utterly chaotic it is called chaos-theory heaven, (Hon-chun 渾天).\n\nDuring the Ch'in 晉 dynasty, Kal Hong 葛洪 said that the circumference of the heavens is $365 \\frac{1}{4}$ degrees; half covers the earth overhead and half surrounds the earth underneath, so half of the 28 constellations are visible and half invisible as the heavens revolve like a wheel.\n\nAlso it is said that at the time of the Song 宋 dynasty Ha Sung-Chun 何承天 examined the chaos-theory globe, and investigated the theories of the heavens, thereupon he perceived\nthat the heaven is truly round and half of it is water, also that the middle of the earth is high, the outside is lower, and water surrounds the lower part.\n\nAlso at the time of the Yang 梁 dynasty Cho Whon 祖昭 said that the shape of the chaos-theory heaven inside is round like a ball. In general in the discussions among astronomers there were six theories.\n\n1. The so-called chaos-theory heaven, which Chang Hyung 張衡 recorded.\n2. Canopy heaven (Kai-chun 盖天) whose laws Chu Bi 周髀 expounded.\n3. Night revealing (Syun Ya 宣夜) whose laws were without a teacher.\n4. Stationary heaven (An-chun 安天) advocated by Oo Hi 虞喜.\n5. Dawn heaven (Heun-chun 明天) advanced by Yo Sin 姚信.\n6. Lofty heaven (Kung-chun 高天) advanced by Oo Yong 虞聰.\n\nThe canopy heaven and all the subsequent theories seem unreasonable, surpassing credulity; at least the ancient scholars did not esteem them of much value.\n\n**History of the Chart.**\n\nThe lost model stone of the above astronomical chart was kept in Pyeng Yang, but on account of the disturbance of war it was sunk in the river; many years having passed since it was lost, existing rubbings of the original were also out of stock.\n\nHowever, when His Majesty began to reign, a man having one of the originals tendered it to him. His Majesty prized it very highly and ordered the court astronomers to engrave it anew on a stone model. The astronomers replied that the chart was very old and the degrees of the stars were already antiquated; so it was necessary to revise it by determining the present midpoints of the four seasons and the culminations at dark and dawn and to engrave an entire new chart designed for the future.\nHis Majesty responded, \"Let it be so!\"\n\nThey spent the time until the sixth moon of Eul Hai 乙亥 (1395) preparing the new Chūng-sung ki 中星記 when part I was written out. On the old chart at the beginning of Spring (Ip-chun 立春) Pleiades (Myo 昂) culminated at dark (Hon 昏) but now Stomach (Wi 胃) does. Consequently the 24 solar divisions were changed in succession to correspond with the meridian stars of the old chart. The stone was carved and just now completed.\n\nThereupon His Majesty commanded me, his obedient servant, Keun 近, to make a record to come after the other part. His humble servant, Keun, calling to mind that from ancient times the emperors have not neglected the worship of heaven, and the directors and have made it their first duty to arrange the calendar, the celestial signs and sacrificial seasons, as Emperor Yo 堯 commanded Hi 羲 and Ha 和 to set in order the four seasons, and Emperor Sun 舜 had the turning sphere and transverse tube and put in order the seven directors, faithfully worshiped heaven and diligently served his people, so I respectfully think that these duties are not to be neglected.\n\nHis wise, beneficent, martial, Imperial Majesty ascended the throne upon the abdication of his predecessor and throughout the whole country brought peace and prosperity, comparable to the virtuous achievement of the Emperors Yo and Sun. He gave great official attention to astronomy, revising the mid-seasons and stars, even the directors of Yo and Sun. In this way, I believe, by observing the heavenly bodies and making astronomical instruments he sought to find out the mind of Yo and Sun and to emulate their most worthy example.\n\nHis Majesty exemplified this pattern to the hearts of all; upward by observing the heavens and seasons, downward by diligently serving the people. So thru his spiritual achievements and prosperous zeal, he also, together with the two emperors, stands highly exalted. Moreover he had this chart engraved on pure marble to be an eternal treasure for his descendents for ten-thousand generations.\nAll ye who read, believe!\nThe following is abridged.\n\nKwon Keun 權近 received royal ordinance to make the record; Ryu Pang-taik 柳方澤 to supervise the computations and Sul Kyung-su 傑慶壽 to write the characters.\n\nThe astronomers who helped were, Kwon Chung-wha 權仲和 Choi Yūng 崔融, No Eul-chūn 盧乙俊, Yun In-yong 尹仁龍, Chi Sin-won 池臣源, Kim Toi 金堆, Chun Yūn-kwon 田潤權, Kim Cha-yū 金自綏 and Kim Hū 金候.\n\nHong Mu 28th year, twelfth month. (Dec. 1395).\n\n**TABLE I.—MERIDIAN STARS AT DARK AND DAWN FOR THE 24 SOLAR PERIODS.**\n\n| No | Solar Period          | Culminating at Dark | Culminating at Dawn |\n|----|-----------------------|---------------------|--------------------|\n| 1  | 冬至 Winter solstice  | Dec. 22             | 室 House 6:17       |\n|    | 小寒 Slight cold      | Jan. 6              | 壁 Wall 6:20        |\n| 2  | 大寒 Severe cold      | Jan. 21             | 奎 Astride 6:28     |\n| 3  | 立春 Spring opens     | Feb. 5              | 胃 Stomach 6:40     |\n| 4  | 雨水 Rainy weather    | Feb. 19             | 肩 End 6:56         |\n| 5  | 露點 Insects awake    | Mar. 5              | 参 Mix 7:14         |\n| 6  | 春分 Vernal equinox   | Mar. 20             | 井 Well 7:35        |\n| 7  | 清明 Clear and Bright | April 5             | 井 Well 7:58        |\n| 8  | 禾雨 Crop rains       | April 20            | 星 Star 8:22        |\n| 9  | 立夏 Summer begins    | May 5               | 張 Draw a bow 8:47  |\n| 10 | 小满 Grain fills      | May 20              | 翼 Wing 9:10        |\n| 11 | 这種 Bearded grain    | June 6              | 轄 Crossbar 9:27    |\n| 12 | 夏至 Summer solstice  | June 21             | 兖 Neck 9:34        |\n| 13 | 小暑 Slight heat      | July 7              | 氏 Bottom 9:27      |\n| 14 | 大暑 Great heat       | July 23             | 房 Room 9:10        |\n| 15 | 立秋 Autumn begins    | Aug. 7              | 尾 Tail 8:47        |\n| 16 | 虚暑 End of heat      | Aug. 23             | 尾 Tail 8:22        |\n| 17 | 白露 White dew       | Sept. 8             | 箕 Sieve 7:58       |\n| 18 | 秋分 Autumn equinox   | Sept. 23            | 斗 Measure 7:35     |\n| 19 | 寒露 Cold dew         | Oct. 8              | 斗 Measure 7:14     |\n| 20 | 霜降 Frost descends   | Oct. 23             | 斗 Measure 6:56     |\n| 21 | 立冬 Winter begins    | Nov. 7              | 女 Girl 6:40        |\n| 22 | 小雪 Slight snow      | Nov. 22             | 虚 Emptiness 6:28   |\n| 23 | 大雪 Heavy snow       | Dec. 7              | 危 Danger 6:20      |\n|    |                       |                     | 軫 Crossbar 5:43    |\n|    |                       |                     | 兖 Neck 5:40       |\n|    |                       |                     | 氏 Bottom 5:32     |\n|    |                       |                     | 氏 Bottom 5:20     |\n|    |                       |                     | 心 Heart 5:04       |\n|    |                       |                     | 尾 Tail 4:46       |\n|    |                       |                     | 尾 Tail 4:25       |\n|    |                       |                     | 箕 Sieve 4:02      |\n|    |                       |                     | 斗 Measure 3:38    |\n|    |                       |                     | 斗 Measure 3:13    |\n|    |                       |                     | 牛 Ox 2:50         |\n|    |                       |                     | 女 Girl 2:33       |\n|    |                       |                     | 危 Danger 2:26     |\n|    |                       |                     | 室 House 2:33      |\n|    |                       |                     | 壁 Wall 2:50       |\n|    |                       |                     | 奎 Astride 3:13    |\n|    |                       |                     | 胃 Stomach 3:38    |\n|    |                       |                     | 昴 Pleiades 4:02   |\n|    |                       |                     | 参 Mix 4:25        |\n|    |                       |                     | 井 Well 4:46       |\n|    |                       |                     | 井 Well 5:04       |\n|    |                       |                     | 星 Star 5:20       |\n|    |                       |                     | 張 Draw a bow 5:32 |\n|    |                       |                     | 翼 Wing 5:40       |\n| Number | Limits                  | Extent | Name of Division | Corresponding State | Province | Branches | Direction | Animal   | Zodiacal Sign on Astral chart |\n|--------|-------------------------|--------|------------------|---------------------|----------|----------|-----------|----------|--------------------------------|\n| 1      | Crassbar 12 to Bottom 4°... | 31     | 鄭 Chung          | 兖州 Yun            | 辰辰     | E.S.E.   | Dragon    | 天秤宮   | Celestial Balance (Libra)       |\n| 2      | Bottom 5° to Tail 9°     | 30     | 宋 Song           | 預州 Yea            | 卯卯     | E.       | Rabbit    | 天蝎宮   | Celestial Scorpion (Scorpio)    |\n| 3      | Tail 10° to Measure 11°   | 31     | 燕 Yun            | 幽州 U              | 寅寅     | E.N.E.   | Tiger     | 人馬宮   | Man and Horse (Sagittarius)     |\n| 4      | Measure 12° to Girl 7°    | 30     | 吳越 Oh Wol       | 楊州 Yang           | 丑丑     | N.N.E.   | Ox        | 麒麟宮   | Ma Kal (Capricornus)            |\n| 5      | Girl 8° to Danger 15°     | 30     | 齊 Che            | 青州 Chung          | 子子     | N.       | Rat       | 寶瓶宮   | Precious Water Bottle (Aquarius)|\n| 6      | Danger 16 to Astride 4°   | 31     | 衛 Wi             | 井州 Pyung         | 壬壬     | N.N.W.   | Pig       | 雙魚宮   | Two Fish (Pioces)               |\n| 7      | Astride 5 to Stomach 6°   | 30     | 魏 Ro             | 徐州 Sū             | 戌戌     | W.N.W.   | Dog       | 白羊宮   | White Sheep (Aries)             |\n| 8      | Stomach 7 to End 11°      | 30     | 趙 Cho            | 冀州 Ki             | 西西     | W.       | Fowl      | 金牛宮   | Golden Ox (Taurus)              |\n| 9      | End 12 to Well 15°        | 31     | 晉 Chin           | 益州 Ik             | 申申     | W.S.W.   | Monkey    | 陰陽宮   | The two Primordial Essences (Gemini) |\n| 10     | Well 16 to Willow 8°      | 30     | 秦 Chin           | 雍州 Ong            | 未未     | S.S.W.   | Sheep     | 巨蟹宮   | Great Crab (Cancer)             |\n| 11     | Willow 9 to Draw a bow 16°| 30     | 周 Choo           | 三河 Sam Ha         | 午午     | S.       | Horse     | 師子宮   | Lion (Leo)                      |\n| 12     | Draw a bow 17 to Crossbar 11° | 31 | 楚 Cho            | 莆州 Hyung         | 己己     | S.S.E.   | Snake     | 雙女宮   | Two Women (Virgo)               |\n| Number | Sign. | Number of Stars | Extent in Degrees | Polar Distance | Right Ascension | English Designation | Corresponding Element | Corresponding Animal | Approximate Constellation or Prominent Star | Influence |\n|--------|-------|-----------------|------------------|---------------|----------------|---------------------|----------------------|---------------------|---------------------------------------------|----------|\n| 1      | 角宿   | 2               | 12              | 91            | 188            | Horn                | Wood                 | Hornless Dragon     | Spica                        | Propitious. |\n| 2      | 元宿   | 4               | 9               | 89            | 200            | Neck                | Metal                | Dragon              | Virgo                         | Drought. |\n| 3      | 房宿   | 4               | 15              | 97            | 209            | Bottom              | Earth                | Badger             | Libra                        | Bankruptcy, suicide, divorce disasters. |\n| 4      | 房宿   | 4               | 5               | 108           | 224            | Room                | Sun                  | Hare               | Scorpio                      | Lucky. |\n| 5      | 心宿   | 3               | 5               | 108           | 229            | Heart               | Moon                 | Fox                | Antares                      | Lawsuits, imprisonment. |\n| 6      | 尾宿   | 9               | 18              | 120           | 234            | Tail                | Fire                 | Tiger              | Scorpio                      | Riches, honor. |\n| 7      | 箕宿   | 4               | 11              | 118           | 252            | Sieve               | Water                | Leopard            | Sagittarius                  | Lucky, prosperous. |\n|        |       |                 |                 |               |                | Eastern Direction, Azure Dragon, 32 stars, 75 degrees. | | | | |\n| 8      | 牛宿   | 6               | 26              | 116           | 263            | Measure             | Wood                 | Gryphon            | Sagittarius                  | Propitious. |\n| 9      | 牛宿   | 6               | 8               | 106           | 289            | Ox                 | Metal               | Ox                | \"                           | Unpropitious. |\n| 10     | 漁女宿   | 4               | 12              | 106           | 297            | Trysting Maiden     | Earth               | Bat               | Aquarius                     | Sisters unchaste, brothers brutal diseases. |\n| 11     | 虚宿   | 2               | 10              | 104           | 309            | Emptiness           | Sun                 | Rat               | \"                           | Scarcity. |\n| 12     | 危宿   | 3               | 17              | 99            | 319            | Danger              | Moon                | Swallow            | \"                           | Evil. |\n| 13     | 建室宿   | 2               | 16              | 85            | 336            | House               | Fire                | Boar              | Markab                       | Fortunate. |\n| 14     | 東壁宿   | 2               | 9               | 85            | 352            | Eastern Wall        | Water               | Porcupine         | Alpheratz                    | Fortunate. |\n| Number | Sign | Number of Stars | Extent in Degrees | Polar Distance | Right Ascension | English Designation | Corresponding Element | Corresponding Animal | Approximate Constellation or Prominent Star | Influence |\n|--------|------|----------------|------------------|---------------|-----------------|--------------------|---------------------|---------------------|---------------------------------------------|----------|\n| 15     |      | 16             | 16               | 77            | 361\\(\\frac{1}{4}\\) | Astride,           | Wood,               | Wolf,               | Mirach,                      | Unlucky. |\n| 16     |      | 3              | 12               | 80            | 12              | Mound,             | Metal,              | Dog,                | Aries,                       | Propitious. |\n| 17     |      | 3              | 14               | 72            | 24              | Stomach,           | Earth,              | Pheasant,           | „                           | Propitious. |\n| 18     |      | 7              | 11               | 74            | 38              | Pleiades,          | Sun,                | Cock,               | Pleiades,                    | Unlucky. |\n| 19     |      | 8              | 16               | 78            | 49              | End,               | Moon,               | Raven,              | Hyades,                      | Fortunate. |\n| 20     |      | 3              | 2                | 84            | 65              | Bristle up,        | Fire,               | Monkey,             | Orion,                       | Fortunate. |\n| 21     |      | 10             | 9                | 94            | 67              | Mix,               | Water,              | Ape,                | „                           | Unpropitious. |\n|        |      |                |                  |               |                 | Western Direction, White Tiger, 51 star, 80 degrees. | | | | |\n| 22     |      | 8              | 33               | 69            | 76              | Eastern Well,      | Wood,               | Tapir,              | Gemini,                     | Luck. |\n| 23     |      | 5              | 4                | 68            | 109             | Imp.               | Metal,              | Sheep,              | Cancer,                      | Terror. |\n| 24     |      | 8              | 15               | 80            | 113             | Willow,            | Earth,              | Muntjak,            | Hydra,                       | Similar to 23. |\n| 25     |      | 7              | 7                | 91            | 128             | Star,              | Sun,                | Horse,              | Alphard,                     | Similar to 23. |\n| 26     |      | 6              | 18               | 97            | 135             | Draw a bow,        | Moon,               | Deer,               | Hydra,                       | Peaceful. |\n| 27     |      | 22             | 18               | 99            | 153             | Wing,              | Fire,               | Serpent,            | Crater,                      | Misfortune. |\n| 28     |      | 4              | 17               | 98            | 171             | Cross bars,        | Water,              | Worm,               | Corvus,                      | Prosperity. |\n\nSouthern Direction, Vermilion Sparrow, 64 stars, 112 degrees.\n\nTHE CELESTIAL PLANISPHERE OF KING YI TAI-JO.\nNOTES ON THE CONTENTS.\n\nHISTORY.\n\nThe Mun-hun-pi-go, Book 2, P. 22, introduces the chapter on meridian stars (chung sung 中星) as follows: \"The fixed stars move to the east 51 seconds per year, so the meridian stars are not the same now as they were in former times. At the beginning of the reign of His Majesty, Yi Tai-jo, the founder of this dynasty, a man of Pyeng Yang presented him with an old astronomical chart. The astronomers informed His Majesty that the chart was very old, so the degrees of the stars were antiquated; and requested him to revise it and to determine anew the four midseasons and the meridian stars of dark and dawn. His Majesty assented, and in the sixth month of Eul Hai (1395) he completed the Chung-sung-ki 中星記 containing the meridian stars of dark and dawn for the 24 solar periods, revising them from the old chart. The astrography according to the old chart and the meridian stars according to the new compilation were engraved directly on a stone. Since the founding of this dynasty, 300 years ago, the fixed stars have again changed, therefore the following new list is compiled according to the Imperial Almanac.\" The Chung-sung-ki of Yi Tai-jo is given in Book 3, P. 30-32, and a part of the history of the chart is quoted exalting the memory of His Majesty.\n\nThis authority confirms the main facts recorded in the history of the chart, and contributes one important item, viz., the constellations of the central astral chart were not revised. No trace of the lost stone has been found. The Tai-tong Ya-seung 大東野勝 Vol. 5, P. 219, quoting the Yang-chon-to-sul 楊村圖說 says that the old stone was sunk in the river and lost at the time of the war when Ko-gu-ryu 高勾麗 fell, 672 A.D. Whereas the stars had advanced one division, from Pleiades to Stomach, the old star list was approximately 1000 years old at the time of Yi Tai-jo. (The determining lines of\nthese constellations are 14 degrees apart, therefore we have \\( \\frac{14}{365} \\) of 25800 years.)\n\nThe contents of the chart transport us to the crepuscular period of Chinese history, when the legendary rulers considered their astronomical duties of supreme importance. Emperor Whang Ti 黃帝, 2697 B.C., and his assistants arranged the sexagenary cyclical period, constructed astronomical instruments said to include a celestial globe, and regulated the calendar. Emperors Yo and Sun are lauded for their astronomical labors. Yo (2356 B.C.) commanded his astronomers, \"To calculate and delineate the movements and appearances of the sun, the moon, the stars, and the zodiacal spaces; and so to deliver respectfully the seasons to the people.\" (Legge's Chinese Classics, Vol. 3, P. 18.) Envoys were sent to the four points of the compass: east to welcome the rising sun and to determine the approach of spring; south to arrange the summer season; west to convoy the setting sun and to adjust the labors of autumn; and north to determine the winter. Yo is also credited with a knowledge of the solar year of 365 \\( \\frac{1}{4} \\) days; because he instructed his astronomers, since the year consists in round numbers of 366 days, to intercalate a month. Concerning Sun (2255 B.C.), the Shoo King says, \"He examined the gem-adorned turning sphere, and the gem transverse tube, that he might regulate the seven Directors.\" (Legge's Classics, Vol. 3, P. 33.) Scholars do not agree on this passage and the chart simply passes on the difficulty. Dr. Legge concludes that it refers to a simple kind of armillary sphere with a hollow transverse tube for celestial observations. The astrological aim of Sun's work is clearly indicated. At that early date the Directors may have been the seven stars of the Big Dipper; but later they were understood to be the sun, the moon, Mercury, Mars, Jupiter, Venus and Saturn.\n\nThe compliment extended by Kwon Keun to his sovereign is the highest praise that could be bestowed,—favorable comparison with Yo and Sun, who embody the highest ideal of sovereign wisdom, grace and virtue. Judging from his official\ndesignation his reward was great: Ka-ch'ung-tai-pu-yea-mun-ch'un-ch'u-kwan-hak-sa-to-pyung-wi-sa-sa-sa-po-mun-kak-hak-sakyum-yea-cho-chun-su-sung-kun-tai-sa-sung-sin Kwon Keun.\n\nHe was a man of Pōk-ju 福州 and became a disciple of Ch'ung Mong ju 鄭夢周 of Blood Bridge fame, and like his master was a loyal patriot. He was a precocious student, passing the first literary examination with high honors at 18 years of age. In the Mun-hun rok 文獻錄 Vol. 2, his name is listed among the Hak-ja 學者 or eminent scholars. His literary pseudonym is Yang Chon 楊村, and posthumous title Mūn-chung 文忠. His tablet appears in the Sŭng-Kyūn-Kwan 成均館 inside the small East Gate. During the reign of King Tai jong he was adviser of the cabinet, at one time recommending that the officials' private guards be abolished and made soldiers of the state (Kuk-cho-po-gam 國朝寶鑑 Vol. 2, P. 2). Among his associates in compiling the chart was Ryu Pang-tak 柳方澤, whose ancestry was of Whang-hai Province and later moved to Sŭ-san 瑞山 in South Choong-chung. He became a government official in the Bureau of Astronomy. (Mun-hun-pi-go, Book 88, P. 41). Sul-Kyung-su 傑慶壽 was originally from Kyung-ju and became an official scribe and translator according to the Mun-hun-rok, Vol. 1, Penmanship section.\nTHE CENTRAL ASTRAL CHART.\n\nThe chart is projected on the plane of the celestial equator and contains all the constellations at any time visible in Korea. The left is east; top, north; right, west; and bottom, south. The north pole is the centre and three concentric circumferences mark the circle of perpetual apparition, approximately 38 degrees, the celestial equator, and the boundary of the circle of perpetual occultation about 55 degrees south declination. The ecliptic has an obliquity of approximately 21 degrees. The River of Heaven (Milky Way) is given due prominence. Radial lines corresponding to the 28 zodiacal constellations divide the map into as many parts excluding the inner circle. These divisions grouped by sevens form four unequal quadrants, the east, north, south and west, respectively protected by the Azure Dragon, Sable Warrior, Vermilion Sparrow and White Tiger. The four divisions are often called by the names of these stellar influences.\n\nThe inscription says: \"In each of the four directions the seven constellations make a single shape. In the east they form a dragon, in the west a tiger, both having the head south and the tail north. In the south they form a bird, in the north a tortoise, both having the head west and the tail east.\"\n\nThis division into quadrants is entirely arbitrary and the assignment of the animals purely imaginary. The Azure Dragon, however, suggests a resemblance to that mythical animal rivalling the imagination of the Greeks and Romans, which may be seen from the accompanying illustration by Mrs. Rufus. A native artist experimented on the skeleton of the White Tiger; on first attempt the head and tail had exchanged places, on second trial the animal had feet upwards, the third result was fair.\n\nThe star configurations are very old. An astral chart of the Chow dynasty, about 600 B.C., a copy of which is in the Royal Library of Paris, contains 1460 stars, (Allen, Star Names\nand their Meanings, P. 21). We find a total of 1463 stars under 306 designations on our chart, which shows practical correspondence with the standard astrography of the Chows. Comparing with other ancient authorities we find that the Catalogue of Hipparchus, 2nd. century B.C., contained 1080; Pliny, 1st. century A.D., whose scientific merit is questionable, reckoned 1600; Ptolemy, 2nd. century A.D., a very careful investigator records 1028. Young's \"Manual of Astronomy,\" P. 478, says, \"The total number which could be seen by the ancient astronomers well enough to be observable with their instruments is not quite eleven hundred.\" But here we find 1460 stars \"correctly laid down,\" to use Allen's expression, 400 years before the time of Hipparchus. Many of the asterisms, especially the zodiacal constellations, are much older and their origin is probably Euphratean.\n\nThe celestial mythology is fascinating. Altho differing in quality from the Occidental it is not lacking in lively imagination as some seem to think. The heavens are peopled with gods and goddesses, \"a celestial galaxy for terrestrial adoration.\" The celestial dragon guards the mansions of the gods lest they fall. In the central division are palaces and thrones, where dwell the Great Celestial Emperor (north star 天皇大帝), royal family, ministers, servants and feudal kings, also the royal stables and palace for women. Comets sweep the celestial courts, and shooting stars are the refuse thrown out of heaven. In Ursa Major dwells the god of literature. A myth also teaches the presence of the fates in this constellation presiding over the destiny of mankind. In the south-east are the pillars of heaven (天柱) and celestial portals (天門). During the mythological period Prince Kong (共工) in a rage broke the pillars of heaven by beating his head against a mountain. A violent flood followed, but was stayed by No Kwa (女媧) one of the mythical sovereigns who repaired the heavens. (2738 B.C.). Some men still live in fear of the heavens falling. In the northeast separated by the river of heaven are found the Herdsman (牽牛 전우) and the Weaving Damsel (織女 직녀).\nor Trysting maiden (須女 슈녀). The story of these star lovers is current in Korea and Japan as well as in China. Their meeting was first witnessed by Chang Kun (P. 5 Mayers) (張騫) who sailed to find the sources of the Yellow River popularly believed to be the earthly continuation of the River of Heaven. Their marriage was celebrated by the celestial choir, when all the stars sang together, and by a display of celestial fireworks, to which the meteors owe their origin. They are now permitted to meet annually on the seventh of the seventh moon, when the magpies flock to the heavens and bridge the celestial river, after which the crown of their heads is bare. Rain on the preceding day indicates the washing of the chariots for the journey, on the following day the shedding of farewell tears.\n\nFarther north are the celestial seats of 12 ancient feudal states; to the west of which the gods of Thunder bellow and Prince Lightning flashes forth. In the west rides \"Astride\" (Kyu 車) the star of literature, pictured with a pencil in his hand. Nearby are the gods of the clouds and the rain, distilling the essence of heaven for the thirsty earth. The brilliant south contains the wolf star (狼星), Sirius; also the no-in star (老入), Canopus, which the Koreans believed could be seen only from Quelpart and the sight of which insured a happy old age. Spanning the heavens like a triumphal arch is the beautiful Galaxy, which the poetic West styles the Milky Way, and the prosaic East calls the Silver River of Heaven.\n\nThe directions on the chart have come down from the time of Yo; when according to Chalmers, at midnight of the winter solstice Leo was in the meridian, south, Taurus in the west, Scorpio in the east, and Aquarius, tho invisible, was in the north. (Legge, Chinese Classics, Vol. 3, part i. Proleg. P. 94) An attempt to fix the date of the indicated position of the equinoxes presents a peculiar difficulty. As two equal circles in a plane cannot bisect, we find that the vernal equinox corresponds with the first of Aries, but the autumnal equinox follows the beginning of Libra by more than 10 degrees. The\npoints of intersection, however, are given on the chart in the definition of the ecliptic and the equator: \"In the east a little preceding the 5th degree of Horn and in the west a little beyond the 14th of Astride.\" This corresponds with the position of the autumnal equinox, but not with the vernal equinox, so we take the position of the autumnal equinox as determinative of the time. Using Spica's relative position to the equinox on the chart and at the present time as a basis for computation, we obtained the first century B.C. The distance of Polaris from the north pole on the chart, about $11\\frac{2}{3}$ degrees, practically corresponds with the preceding, as the distance at the time of Hipparchus was about 12 degrees. The correspondence between the vernal equinox and the first of Aries also suggests the time of that great astronomer, whose work was the basis of the Julian Calendar, and we have reason to believe, the foundation also of the New Calendar of the Hans, which took effect at the time of the Grand Beginning (太初) Dec. 24,105 B.C. The $365\\frac{1}{4}$ degree circle and the introduction of the 12 solar divisions also point to that period. These reasons seem sufficient to justify the opinion that the equinoxes as here represented and the adjustment of the constellations on the planisphere were made by the Hans about the time of the reorganization of the calendar.\n\nThe circle of perpetual occultation, 55 degrees south, indicates a place farther south than Seoul, but would harmonize with the capital of the Hans and Chows, Sing-An Fu 新安府. On the other hand the circle of perpetual apparition, 38 degrees, corresponds closely with the latitude of Seoul, and the Chinese astrography includes several constellations in the Hang-sung 挂星 which are outside the central division of the chart, so we are inclined to believe that the revisers at the time of Yi Tai-jo determined the present position of the inner circle.\nTHE SUN, THE MOON AND THE HEAVENS.\n\nThe chart outlines briefly the orthodox teaching concerning the sun, the moon and the starry heavens. The sun is the Astronomical Great Father and the moon is the Astronomical Great Mother; or to carry out the simile of the chart, they are the King and Queen of the Universe. In Confucian cosmogony the sun is the concreted essence of the positive or masculine (yang 阳) principle in nature, and the moon of the negative or feminine (eum 隐) principle. These two Primary Essences were evolved from the Great Absolute (Tai-kuk 太極), the primum ovum of the physical universe and philosophical ultimate of the Confucianist. Back of the Tai-kuk is sometimes posited the Mu-kuk 無極, Absolute Nothingness. The positive category includes the sun, stars, thunder, lightning and the rainbow; the negative includes the moon, rain, dew, frost, snow, fog and mist. The wind and the clouds (some authors also include the stars and certain of the above phenomena) exist by virtue of both principles acting either in harmony or at enmity. (Compare A-hui-wul lam 兒戲原覽 and Sam-chai-to-hoi 三才圖會 on that subject.) The genesis of the sun and its imperial symbolism were embodied in a treatise, \"The History of Great Light,\" by Liu An 劉安 2nd century B.C. commonly known as Hoi-Namja 淮南子. This work was preserved by Liu Hiang 劉向, 1st century B.C., to whom the essence of the First Great Cause is said to have appeared and expounded its teachings. It found a place in the Taoist canon and part is reprinted in the modern edition of the Sam-chai-to-hoi. The attributes of the positive element are heat and light, life-giving properties; of the negative are cold, darkness and dampness. Annual observation of the changes in the sun's position and accompanying changes in the seasons and vegetation led to the common belief of the ancients that the sun possesses life-giving power, agreeing with modern science, that upon it depends the possibility of life on the earth. \"When it turns to the north all\nthings revive, when it turns to the south all things die,\" Quite naturally to these beneficial physical properties moral virtues were added, so the King of Day is not an arbitrary cosmocrat, but the beneficent ruler of the universe, a symbol of kind and benevolent sovereignty upon the earth. For this reason the condition of the sun determines the prosperity of the state. The astrology of the chart suggests the \"Solar Myth\" of the Egyptians, especially Set cutting Osiris to pieces to form the stars. Another striking similarity is Osiris' beneficent rule, traveling over the world spreading the blessing of civilization.\n\nThe daily motion of the sun incited much speculation. It was said to rise upon the branches of the Boo-sang 树扶桑 tree and to descend on the Yak 雅 tree. (These trees are pictured on Buddhist maps of the earth. The Boo-sang is sometimes called Buddha's Leaning Mulberry. Dr. Bretschneider of St. Petersburg identifies it with the Hibiscus Rosa Sinensis of the Mallow order common in China. Dr. Hepburn says that the tree is known to the Japanese as the Chinese Hibiscus. Korean Repository, Vol. 1, P. 288, 318.) The nearness of the sun is illustrated by the ancient belief that a country existed where a sizzling noise can be heard when it drops into the water beneath the horizon. This corresponds with a Hindu myth, and reminds us of Vulcan's boat to ferry the sun to the morning sky. Confucius was unable to settle a dispute between two parties, one holding that the sun is nearer at sunrise, because it appears larger, and the other maintaining that it is nearer at midday, because it sheds more heat. The book of Sul-moon 說文 (Yun-gam-yu-ham Vol. 2, P. 1) states that the sun's diameter is 400 li, circumference 1200, distance from the earth 25000, and explains that it is round because it hangs in the heavens and turns freely in space. The length of the day depended upon the distance of the sun. In the Yuen 元 dynasty, just preceding the date of our chart, it was held to be due to a difference of the sun's altitude. The symbol of the sun is a circle in which is a crow with three legs, probably derived from the writing of Hoi-nam-ja. Because the sun is the master of\nthe positive creation, the animals take off their horns in the spring and summer.\n\nAs the negative element is the complement of the positive, so its concreted essence, the moon, is the Queen of the Eum Creation, and the symbol of the King's consorts and court assemblage. The original idea of complementary relationship for perfect unity in the Tai-kuk, contained the idea of contrast or oppositeness, not necessarily antagonism, e.g., light and darkness, heat and cold, heaven and earth, water and land, husband and wife. Unfortunately for the moon and for woman-kind the contrast was carried into the moral realm, so the moon stands for destructive or punitive qualities, and the idea of woman is associated with all kinds of evil, accounting in a large measure for her low social position.\n\nThe symbol of the moon is a circle in which is a hare pounding rice in a mortar, probably due to a legend traceable to an Indian source (Mayers). Other creatures of the moon are the frog or toad, a cassia tree whose leaves give immortality, and a genius recognized as the matrimonial match maker. Hoi-nam-ja styles the moon the messenger of the gods, probably on account of its swift motion. Its bounds from night to night may also have suggested the leaping animals. Another author in the Wang-chung-ron-hyung 王充論衡 says it \"glides like a duck thru the sky.\" Its diameter is 1000 li, circumference 3000 and distance below the heavens 7000. (Accredited to the Syu-chung-chang-yuk 徐整長曆 by the Yun-gam-yuhain, Vol. 3, P. 1.)\n\nConcerning the \"Nine Paths of the Moon's Orbit\" Mayers quotes Medhurst's Shoo King as follows: \"The nine-fold course of the moon appears to refer to the inclination of the lunar orbit and to the ascending and descending nodes, where they cut the ecliptic.\" He then adds: \"The ecliptic is described as the middle path of the sun, and each of the first four paths of the moon is considered as a double line with reference to its two successive passages of the ecliptic.\" We shall try to explain the explanation.\nThe geometrical figure of the Shoo King (Table 5) illustrating the nine roads may be constructed by describing eight equal circles using the vertices of a regular octagon as centers, and drawing the ninth circle thru the central series of the points of intersection. The table indicates the ordinary correspondence between color, direction, and solar period. Inside the ecliptic, the central circle, the negative influence prevails; outside, the positive. The Shoo King or Syu-chun Vol. 1, p. 8, says: \"In the winter when it enters the negative influence and in the summer when it enters the positive influence, the moon passes thru the azure road. After the winter and summer solstices half of the azure road is bisected at the point of the vernal equinox, where it is located east of the ecliptic; also after the winter and summer begins, half of the azure road is bisected at the point of spring begins, where it is located southeast of the ecliptic. The opposite sides also are just the same.\" Then follows a similar explanation of the white, red and black roads, and the summary: \"The four series separating make eight divisions with regard to the positive and negative; all of these intersect the ecliptic and each other, so altogether the moon's orbit has nine roads. It is said because the sun and moon travel these roads we have winter and summer.\"\n\nThese eights paths in succession can not represent the course of the moon during one year, because the year contains over 13 nodical months; so the solar terms in the explanation must refer to points in the ecliptic rather than to seasons of the year. Then the direction of the moon from the ecliptic at the time of its greatest positive distance determines the color of the road; e.g., East or East-South is the Azure road, in that path the moon will also be in the constellations of the Azure Dragon during the period of greatest positive influence. Each road becomes two according as it is positive or negative, making eight lunar paths; these with the ecliptic are the Nine Roads. The regression of the nodes, completing a revolution in about 19 years, varies the correspondence between the roads and the seasons during successive years.\nTABLE V.\n\nThe Nine Roads of the Moon.\n\nEcliptic.\n\nA. A. The two Azure roads of the east.\nR.; R. ,, Red ,, ,, south.\nWh. Wh. ,, White ,, ,, west.\nB. B. ,, Black ,, ,, north.\nS. S. Summer solstice.\nA.'B. Autumn begins.\nA. E. Autumnal equinox.\nW. B. Winter begins.\nW. S. Winter solstice.\nSp. B. Spring begins.\nV. E. Vernal equinox.\nS. B. Summer begins.\nThe discussion of the heavens shows the faithfulness of the Koreans to the authority of antiquity. The oldest cosmogony is accepted as the truth, or else the cosmogony which they held to be true was accredited to the earliest days.\n\nThe distance from the earth to the heavens was reckoned with a show of great exactness, being $216,781 \\frac{1}{2}$ li. The size of the heavens from north to south is $233,057$ li 25 paces; from east to west it is 21 paces smaller. (Yun-kam-yu-ham 淵鑑類函 Vol. 1. P. 1. quoting Kwang-ali 廣雅). The calculations, however, greatly differ. Another astronomer makes the distance of the heavens $81,394$ li 30 paces 5 feet 3 inches and 6 tenths. (Legge’s classics Vol. 3. Part 1. P. 91.) Another in the Chi-ye-chi 地輿志 says the circumference of the heavens has $365 \\frac{1}{4}$ degrees and each degree contains $2,932$ li 71 paces 2 feet 7 inches and four tenths. The circumference is $1,070,913$ li (The paces were left out in the computation) and the diameter is $356,971$ li (Just one-third the circumference). With this the Yu Kyung 類經 agrees, adding the explanation, “The heavens move 80 li during a breath. Man breathes 13,500 times during the day and night, therefore we know it is 1,080,000 li around the heavens.” This kind of reasoning prevailed until the revival of astronomy under the influence of the Jesuits. The Mun-hun-pi-gò recognizes that the size of the heavens is not obtainable.\n\nThe chart accepts the Hon-chun 渾天 explanation of the universe. The origin of this theory is lost in antiquity, but its teachings were elaborated and recorded by Chang Hyung 張衡 78-139 A.D., Grand Historiographer of the Hans, An Ti 安帝 and Shun Ti 順帝, who constructed a Hon chun-eui 渾天儀, a sort of uranosphere (Mayers) or celestial globe (Giles), and produced several works on astronomy. This school of astronomers taught that the universe is like an egg, the surrounding heaven is large and the earth within is small. Water exists on the surface of the sky, in which the constellations float, while the heavens revolve like a wheel. They also held that the form was confused or chaotic. This suggests at once the Biblical passage.\n\"The earth was without form and void.\" Williams, The Middle Kingdom, Vol. 2. P. 138, quotes as follows from a Chinese source: \"Heaven was formless, an utter chaos; the whole mass was nothing but confusion.\" Chang Hyung explains the formlessness by saying: \"There is no end to heaven because it is round, so we can not see its shape.\" The term Hon-chun is difficult to translate. Giles defines Hon as: \"Confused; chaotic; disordered; turbid; muddy. Whole; complete; the entire mass.\" Hon-chun-eui is given as celestial globe. The Hon-chun then stands for the confused or formless heaven as represented and explained by an armillary sphere, such as is pictured in the Shoo King 書經 Vol. 1, P. 8. The term also contains the precosmic ideas involved in Confucian cosmogony and suggests a theory of creation quite as well as a conception of the present order. Attempting to convey both ideas, the passage of the chart, \"Ki hyung hon hon yun go wal hon chun ya,\" 其形渾渾然故日渾天也 is translated, \"Because the form was utterly chaotic, it is called chaos theory heaven.\" Concerning the Hon-eui 渾儀 mentioned in the chart and examined by Ha Sung Chun, from the conclusions he reached (q.v.) we hesitate to apply the term \"celestial globe\" with its present significance. The turning-sphere of Sun and the much-improved \"uranosphere\" of Chang Hyung must have been rather \"rude\" if they faithfully represented the ideas of their authors. The present meaning of Hon-chun-eui is clearly celestial globe; but we have tried to avoid the modern significance by the translation of the text, chaos-theory globe. It was only a step, however, from the idea of the chaos-theory heaven to the modern idea of the celestial sphere of infinite dimensions, as far as the form is concerned. This step, nevertheless, necessitated the surrender of the idea of a limited heaven and consequently of a diurnal revolving heaven.\n\nKal Hong 葛洪, or Chi Chun 稚川 as he is sometimes called, 4th century A.D., who also taught this theory, was a famous Taoist doctor. The chart says that he taught that the circumference of the heavenly body contains $365 \\frac{1}{4}$ degrees,\nbut earlier use was made of that division by writers of the Han dynasty, at the time of the new calendar, adopted 59 years before the Julian calendar was issued. A Chinese biographical dictionary 洪洋歷史大辭典 pictures Kal Hong as stupid, stammering and dirty, very poor but very studious. He discovered the medicine of immortality, and at the age of 81 went to sleep in a sequestered spot. When his friends sought him they found only his empty clothes; the great teacher was gone. He was among the first to teach the difference between the sidereal year and tropical year, first distinguished in China by Oo Hi, whose work seems to be rejected by the author of this section of our chart. Ha Sung Chun developed the same theory of the heavens and estimated the length of the sidereal year at 365.255 days and the tropical year at 365.245 days.\n\nThe Canopy Heaven system of astromony is accredited to Chu Bi. The Chu-Bi San-kyung 周髀算經 also contains some trigonometry and is thought to be a relic of the Chow dynasty. The Yun-gam-yu-ham expresses some doubt as to the origin of the theory, but classifies it among the three \"Heavens\" of the ancients, the Chaos-theory, Night-revealing, and Canopy Heaven. According to this system the starry firmament was represented as a concave sphere (Wylie, Notes on Chinese Literature, P. 106), or like a huge umbrella according to Korean scholars. The celestial chart given to the Silla emperor, Hyo Syo 孝昭 by the Buddhist monk, To Ching 道證, is said to have represented this system, (Mun-hun-pi-go, Book 3, P. 2.) The Pleasant Parasol constellation, (Wha-gai 華蓋) as pictured on the astral chart, is a good illustration.\n\nConcerning the \"Night Revealing,\" Syun-ya, system Wylie says: \"It has not been handed down, but native scholars suppose that there is a close resemblance between it and the system introduced by the Europeans.\" This agrees with the chart that the system has been without a teacher to expound its laws. The Yun-gam-yu-ham, however, calls it the law of Ha Eun 夏殷. If this refers to those two dynasties it fixes the time too early for European influence. The Koreans say this\nsystem resembles the Canopy Heaven and is like the turning of a drooping curtain on all sides.\n\nPreceding the three remaining theories, the Yun-gam-yu-ham mentions the Square Heaven (Pang-chun 方天) proposed by Wang Choong 王充 of the first century A.D., and designates these four theories as modern rather than ancient. The Stationary or Peaceful Heaven, An-chun, advocated by Oo Hi 虞喜, first half of the fourth century, taught that the heavens are at rest. An illustrative apparatus is said to have represented the heavens as motionless, but had some kind of instrument that could be moved. The Dawn Heaven, Heun-chun, represented the heavens as a cylinder revolving about an axis. The Lofty Heaven, Kung-chun, recognized the absolute loftiness of the celestial vault. These modern systems are branded as nonsense by the Yun-gam-yu-ham, which adds, \"There is no doubt concerning the Chaos-theory Heaven.\"\n\nTHE TABLES.\n\nWe have seen that the list of meridian stars (Table 1) is credited to the labors of Yi Tai-jo, constituting a part of the Shin-pup Chung-sung-ki 新法中星記. The compilation suggests a certain degree of ability on the part of the Korean Board of Astronomers. A glance at the table will show that the variation in the time of dark and dawn during the 24 solar periods was taken into consideration in its compilation, suggesting, however, the method of observational astronomy rather than the more accurate and more expeditious method of theoretical astronomy. The interval of time between the receipt of the old chart, shortly after the beginning of the reign, 7th month of 1392, and the completion of the new list in the summer of 1395 gives opportunity for sufficient observations.\n\nThe 24 solar \"breaths\" here used, together with the sexagenary cycle, the 28 lunar mansions, and the 12 divisions of the zodiac, employed by the Chinese probably came from the Chaldeans. (Williams, The Middle Kingdom, Vol. 2.)\nThe Chinese however, credit the Kap-cha 甲子 to Ta Nao 大撓 at the time of Hwang Ti 黃帝 B.C. 2697.\n\nThe culminations deal with entire zodiacal constellations rather than with individual stars, also with solar periods and the variable expressions dark and dawn 昏曉 instead of a definite time, so computations based upon the data must be given a fair margin of probable error. Ease in computation has suggested a theoretical six o'clock average time for the observations to have taken place, and some use has been made of that hypothesis in discussing Chinese chronology. (Article, \"Astronomy of the Ancient Chinese,\" Chalmers; Legge's Chinese Classics, Vol. 3. Proleg. P. 92). However one-half hour difference in the time of observation makes over 500 years difference in dates determined by this method of attempting to fix or to verify a chronology. \\((1/2 \\text{ hr} = 7 1/2 \\text{ degrees}, \\text{ so we have } \\frac{7}{360} \\text{ of } 25,800 \\text{ years} = 537 1/2, \\text{ where } 258000 \\text{ years is the period of the precession of the equinoxes}).\\) The time of day of observations given in the table is taken from the list of Meridian Stars in the Mun-hun-pigo, Book 2; altho this compilation was made 300 years later it illustrates the custom in vogue at the time of Yi-Tai-jo.\n\nThe Twelve Zodiacal Divisions (Table 2) are given due prominence on the chart; the table begins in the upper right hand corner, and the modern signs occupy the outer ring of the circular astral chart. Each division is given five designations, Name, State, Province, Branch, Sign. In addition to this the unequal solar divisions are defined by using the still more unequal lunar divisions, which are more fundamental in Chinese and Korean thought and have so remained to the present century.\n\nThe origin of the twelve \"names\" is obscure. Longevity Star (壽星) is one of the Three Auspicious Stars of the Numerical Categories, also first of the Five Blessings 五福. Great Fire (Tai-wha 大火) has been identified with Antares and suggests an origin of the term as remote as the time when that ruddy star and Aldebaran marked the equinoctial points, 3000 B.C. (Kingsmill, \"Ancient Lunar Asterisms,\" Royal Asiatic Society,\nVol. 26, P. 79.) The order of the feudal states does not seem indicative of direction and no sufficient reason for their assignment to the various divisions has been offered. Dr. Edkins suggested that Jupiter's position in the constellations may have determined Chung's assignment. The names of the provinces take us back to the time of the Nine Provinces of Yü 禹, 2278 B.C. with which eight provinces of the chart agree, Ryang 楊 only having dropped out. Yu 喻, Pyeng 彭, and Ik 益 of the chart are among the 13 provinces of the Han dynasty, and probably were added at that time, when the Hans made greater use of the solar divisions in the reorganization of the calendar. Allowing for subsequent orientation, an attempted correspondence between the location of the provinces and the directions on the chart can be recognized. Much difficulty seems to have arisen in the introduction of the solar zodiac. Taking the 12 divisions in their usual order and making them correspond with the 12 branches and their associated direction reverses them, so they go backward thru the year. According to Appendix 5, D. in Giles Dictionary that order is accepted; but our chart has changed the cyclical correspondence between the branches and the signs so the year progresses harmoniously. (See Table 4).\n\nThe modern signs in the outer circle of the stellar chart were unquestionably inserted by the revisers. These terms were introduced into China from India in the Buddhist Classics about the 10th century; but met with little use before the beginning of the Ming dynasty, 1368 A.D., when they were adopted by the Board of Astronomers for about 30 years. (Doolittle, \"Vocabulary and Hand book on the Chinese Language,\" Vol. 2, P. 364.). The date of our chart comes within that period and shows the close relationship between Chinese and Korean science. Later works including the Mun-hun-pi-go use the old terms, Su-sung, Tai-wha, etc. Allen in \"Star Names and their Meanings\" credits the Jesuits with the introduction of the modern signs in the 16th century; it is probable that they simply revived their use. The characters for Capricorn, Ma-kal, 麻羯宮 do not correspond with the modern Ma-kal 麻羯宮.\nTABLE IV.\n\nOuter circle Arabic numbers refer to solar zodiacal divisions, Table 2. Inner circle, Table 3. The Roman numerals refer to the Branches and corresponding directions, Table 2.\nThe sounds are the same but the meaning of the terms on the chart is not clear. Another point is worthy of note. Gemini is designated by the expression Fum-Yang which is sanctioned by modern Chinese usage. Japanese dictionaries have adopted Sang-nyu 雙女, which corresponds with Virgo on the chart. The modern designation for Virgo is Sil-nyu 實女. The terms given on the chart seem quite appropriate and give rise to no confusion between Gemini and Virgo.\n\nThe origin of the 28 Zodiacal Constellations (Table 3) is involved in Chinese, Chaldean and Indian mythology. Their use seems to have been quite general throughout the Orient in ancient times; the term mazzaroth of Job 33:23 is now interpreted to mean zodiacal asterisms. Their introduction or use in China preceded the time of Yo and Sun according to Chinese annals, (Legge's Classics, The Canon of Yaou,) and they are still represented as they appeared at that time. The number corresponds roughly with the number of days of the sidereal month (between 27 and 28), so the constellations represent the daily or nightly \"resting places\" of the moon, 27 was sometimes used as the preferable number.\n\nA discrepancy exists between the number of stars in the four quadrants given by the engraved headings and the total obtained from the table on the chart. Comparison with the star groups of the central astral chart shows that the headings agree with the old astrography, when the numbers were as follows: Horn 4, Danger 7, House 8, End 9, Well 9, and Crossbar 7, the others remaining the same. The polar distances as given in the table also differ from the astral chart. These two differences lead to the inference that the table represents a revised uranography and was introduced by the revisers of the chart. The longitude was not included. In Table 3 the right ascension has been determined from the astral chart, beginning with the Vernal Equinox which corresponds with the First of Aries and 4th degree of Astride, also using the radial lines as determinative of the position. In dealing with early approximations derived from observations made with ancient instruments, the terms\nlongitude and right ascension may be used interchangeably with little loss of accuracy. The \"Influence\" of the various constellations is condensed from Du Bose, \"The Dragon, Image and Demon.\n\nCHRONOLOGICAL SUMMARY.\n\nThe chart is not the work of a single period, but embodies the labors of 4000 years. We shall attempt to give a chronological view of the contents.\n\nLegendary period.\nOrigin uncertain, probably preceding Yo and Sun.\nThe 28 lunar resting places,\nThe 24 solar \"breaths,\"\nThe 12 branches,\nThe 12 names, Su-sung, Tai-wha, etc.,\n\nYo and Soon, 2356 to 2205 B.C.\nFour unequal quadrants,\nFixing the four cardinal points and directions on the ecliptic,\nThe turning-sphere, bearing on the chaos-theory heaven;\n\nYu, the Great, 2205 B.C.,\nThe nine provinces;\nHia and Yin, to 1154 B.C.\nThe Syun-ya or night-revealing heaven;\n\nChow, to 225 B.C.\nKai-chun or canopy heaven,\nThe feudal states,\nDevelopment and charting of star-groups as they appear on chart.\n\nFormer Han, to 25 A.D.\nApplication of 12 provinces to zodiacal divisions,\nDelimiting zodiacal divisions,\nAdjustment of equinoxes; and rectification of constellations on the planisphere.\nLater Han, to 220 A.D.\n\nDevelopment and recording of the Hon-chun or chaos-theory heaven. Up to the sixth century,—Introduction of the so-called \"modern\" theories of the heavens, including distinction between the sidereal and tropical year.\n\nAfter this time there seems to have been little development of Astronomy in the East until after the time of the chart, under Jesuit influence.\n\nThe revision of the chart at the time of Yi Tai-jo,—The circular chart of the constellations culminating at dark and dawn, was entirely revised, (Table 1.)\n\nOn the outer ring of the central astral chart the modern signs of the zodiac were introduced, probably changing the order of the cycle; also the circle of perpetual apparition was fixed at approximately 38 degrees.\n\nConcerning Table 3 a uranography later than the astral chart was followed; so the work was probably done by the revisers. The use of the term Trysting Maiden, Su-nyu 須女 in the table instead of Weaving Damsel, Ching-nyu 織女 which is on the astral chart, or the more common form, Girl, Nyu 女, when enumerating the 28 constellations, may also represent a change.\n\nOf course the history engraved at the bottom is entirely Korean; and the time of day of dark and dawn taken from the Mun-hun-pi-go and copied in Table I.\n\nTable II on the chart shows little evidence of revision.\n\nThe treatises on the sun, the moon and the heavens indicate nothing later than the sixth century; so they may have been copied from the lost chart, if it was as late as the beginning of the Tang dynasty, 618 A.D. The Tangs sent a chart to King Hyo Syo of Silla by the monk, To Ching, so it seems quite probable that the lost Pyeng Yang chart was sent by them to one of the kings of Ko-gu-ryu, when the capital was at Pyeng Yang.\n\nDirect historical evidence concerning the lost chart is one of the points left for further search. Another lost relic is the historical tablet of King Yung-jong, which might be discovered by a better student of history.\n天象列次分野之圖\n\n布星者陽精之榮也陽精為日日分為星故其字從日下生也釋名云星散也\n\n若日行南北失道則進而長為常寒退而短為常燠主生養恩德事則進北晝長夜短陽勝故為溫暑陰用事則退南晝短夜長陰勝故為凉寒\n\n月宿\n\n在赤道外半在赤道內東交於角五小弱西交於奎十四小強謂之白道行黃道之北謂之黑道黃道內外各四并黃道為九道也廷諸侯大臣之類行黃道之東謂之青道行黃道之南謂之赤道行黃道之西月為大陰之精衆陰之長以之配日女主之象以之比德刑罰之義列之朝\n\n日宿\n\n若日行南北失道則進而長為常寒退而短為常燠主生養恩德事則進北晝長夜短陽勝故為溫暑陰用事則退南晝短夜長陰勝故為凉寒近暑而中和陽用\n形牛義研求天意乃悟天形正圓而水居其中地中高外界水周其下又梁祖匿云\n\n論天\n\n晋渾地之下故二十八宿半見半隱天轉如車輪之轉也又宋何承天云延觀渾\n\n天包地外猶殼之裏黃也周旋無端其上以定今四仲昏曉之中勒成新圖以示于後\n\n命臣近誌其後臣近竊惟自古帝王奉天之政莫不以歷象授時為先務堯命\n\n為胃二十四氣以次而差於是因舊圖改中星鑠石甫訖廼\n\n上以為然越乙亥夏六月新脩中星記一編以進舊圖立春昂中於昏而今則\n\n殿殿下受命之初有以一本投進者\n\n義和而秩四時舜在機衡而齊七政誠以敬天勒民為不可緩也恭惟\n\n論\n\n晋渾繞地之體狀如島卵天包地外猶殼之裏黃也周旋無端其上以定今四仲昏曉之中勒成新圖以示于後\n\n命臣近誌其後臣近竊惟自古帝王奉天之政莫不以歷象授時為先務堯命\n\n為胃二十四氣以次而差於是因舊圖改中星鑠石甫訖廼\n\n上以為然越乙亥夏六月新脩中星記一編以進舊圖立春昂中於昏而今則\n\n殿殿下受命之初有以一本投進者\n巡衛司後領散員臣金侯洪武二十八年十二月日\n掌漏進勇副尉虎勇巡衛司右領別將臣金自綏權知視日修義副尉虎勇\n仁龍判事通訓大夫臣池臣源承通德郎臣金堆掌漏啓功郎臣田潤權知\n嘉靖大夫檢校中樞院副使臣盧乙俊兼正嘉善大夫檢校戶曹典書臣尹\n臣權仲和兼判事嘉靖大夫商議中樞院事都評議使司使臣崔融兼判事\n領觀事特進輔國崇祿大夫判門下府事都評議使司使臣崔融兼判事\n書雲觀\n\n觀事臣柳方澤奉敎推算中直大夫校書監臣樸慶壽奉敎書\n曹典書成均大司成臣權近奉敎記嘉靖大夫檢校中樞院副使兼判書雲\n寶也信矣哉嘉靖大夫藝文春秋館學士都評議使司使寶文閣學士兼禮\n勤民事神功茂烈亦當與二帝並隆矣況此圖勒貞珉永為子孫萬歲之\n\n則\n\n殿下本以欽存諸心上以奉天時下以\n已惟正中星即堯舜之政也然求堯舜所以觀象制器之心其本只在乎欽而\n聖武仁明以禪讓而有國中外晏然躋于太平即堯舜之德也首察天文\n### TABLE VI.\n\n#### STAR LIST.\n\n##### CENTRAL DIVISION.\n\n| No. | NAMES       | No. | NAMES       |\n|-----|-------------|-----|-------------|\n| 1   | 紫微七      | 7   | 天厨六      |\n| 2   | 北極五      | 5   | 八穀八      |\n| 3   | 四輔四      | 4   | 天棓五      |\n| 4   | 天一太一     | 2   | 天床六      |\n| 5   | 隱德二      | 2   | 內厨二      |\n| 6   | 尚書五      | 5   | 文昌七      |\n| 7   | 柱下史一    | 1   | 三公三      |\n| 8   | 女史一      | 1   | 天理四      |\n| 9   | 女御宮四    | 4   | 北斗七      |\n| 10  | 天柱五      | 5   | 輔星一      |\n| 11  | 大理二      | 2   | 策一        |\n| 12  | 勾陳六      | 6   | 扶筐七      |\n| 13  | 天皇太帝一  | 1   | 紫微八      |\n| 14  | 六甲六      | 6   | 天船九      |\n| 15  | 五帝坐五    | 5   | 積水一      |\n| 16  | 華蓋七      | 7   | 積水一      |\n| 17  | 杠九        | 9   | 天倉三      |\n| 18  | 傅舍九      | 9   | Total       |\n| 19  | 內階六      | 6   |             |\n\nTotal ... ... ... 166\n\n##### EASTERN DIVISION.\n\n| No. | NAMES       | No. | NAMES       |\n|-----|-------------|-----|-------------|\n| 1   | 左角二      | 2   | 天田二      |\n| 2   | 平道二      | 2   | 進賢一      |\n| 3   |             |     |             |\n| 4   |             |     |             |\n| No. | NAMES          | No. | NAMES          |\n|-----|----------------|-----|----------------|\n| 5   | 周鼎三         | 35  | 阵車三         |\n| 6   | 天門二         | 36  | 玄戈一         |\n| 7   | 平二           | 37  | 西威四         |\n| 8   | 庫樓十         | 38  | 日一           |\n| 9   | 柱三           | 39  | 房四           |\n| 10  | 柱三           | 40  | 天市十一       |\n| 11  | 柱三           | 41  | 列肆二         |\n| 12  | 柱三           | 42  | 從官二         |\n| 13  | 柱三           | 43  | 積卒十二       |\n| 14  | 衡四           | 44  | 心三           |\n| 15  | 陽門二         | 45  | 罰三           |\n| 16  | 南門二         | 46  | 鍵閭一         |\n| 17  | 郎將一         | 47  | 東威四         |\n| 18  | 充四           | 48  | 貫索九         |\n| 19  | 大角一         | 49  | 尾九           |\n| 20  | 折威七         | 50  | 神宮一         |\n| 21  | 攝提三         | 51  | 龜五           |\n| 22  | 順頑二         | 52  | 天江四         |\n| 23  | 充池六         | 53  | 傳說一         |\n| 24  | 三公三         | 54  | 魚一           |\n| 25  | 更河三         | 55  | 市樓六         |\n| 26  | 帝席三         | 56  | 宗正二         |\n| 27  | 氏四           | 57  | 候一           |\n| 28  | 天乳一         | 58  | 帝座一         |\n| 29  | 招搖一         | 59  | 七公七         |\n| 30  | 騎官二十七     | 60  | 宦者四         |\n| 31  | 車騎三         | 61  | 斗五           |\n| 32  | 天幅二         | 62  | 鬻四           |\n| 33  | 騎陣將軍一     | 63  | 車肆二         |\n| 34  | 攝提三         | 64  | 箕四           |\n### STAR LIST\n\n| No. | NAMES       | No. | NAMES       | No. | NAMES       |\n|-----|-------------|-----|-------------|-----|-------------|\n| 65  | 外杵三      | 3   | 帛度二      | 2   |             |\n| 66  | 繚一        | 1   | 天紀九      | 9   |             |\n| 67  | 天鑰八      | 8   | 女狀三      | 3   |             |\n| 68  | 農丈人一    | 1   |             |     |             |\n| 69  | 宗人四      | 4   | Total       |     | 272         |\n| 70  | 宗星二      | 2   |             |     |             |\n\n### NORTHERN DIVISION\n\n| No. | NAMES       | No. | NAMES       | No. | NAMES       |\n|-----|-------------|-----|-------------|-----|-------------|\n| 1   | 斗六        | 6   | 羅堰三      | 3   |             |\n| 2   | 龍十四      | 14  | 女四        | 4   |             |\n| 3   | 建六        | 6   | 齊一        | 1   |             |\n| 4   | 天弃九      | 9   | 趙二        | 2   |             |\n| 5   | 天鷄二      | 2   | 鄭一        | 1   |             |\n| 6   | 狗國四      | 4   | 越一        | 1   |             |\n| 7   | 天淵十      | 10  | 周二        | 2   |             |\n| 8   | 天市東垣十一| 11  | 秦二        | 2   |             |\n| 9   | 屠肆二      | 2   | 代二        | 2   |             |\n| 10  | 宗大夫四    | 4   | 晉一        | 1   |             |\n| 11  | 狗二        | 2   | 韓一        | 1   |             |\n| 12  | 牛六        | 6   | 魏一        | 1   |             |\n| 13  | 天田九      | 9   | 楚一        | 1   |             |\n| 14  | 九坎九      | 9   | 燕一        | 1   |             |\n| 15  | 河鼓三      | 3   | 難珠五      | 5   |             |\n| 16  | 右旗九      | 9   | 茂五        | 5   |             |\n| 17  | 左旗九      | 9   | 敗茂五      | 5   |             |\n| 18  | 織女三      | 3   | 天津九      | 9   |             |\n| 19  | 漸臺四      | 4   | 奚仲四      | 4   |             |\n| 20  | 輩道六      | 6   | 難瑜三      | 3   |             |\n| No. | Names          | No. | Names          |\n|-----|----------------|-----|----------------|\n| 41  | 天粹四         | 62  | 北落师门一     |\n| 42  | 虚二           | 63  | 天纲一         |\n| 43  | 司命二         | 64  | 土公二         |\n| 44  | 司禄二         | 65  | 室二           |\n| 45  | 司危二         | 66  | 雾宫六         |\n| 46  | 司非二         | 67  | 雷电六         |\n| 47  | 哭二           | 68  | 羽林四十五     |\n| 48  | 泣二           | 69  | 八魁九         |\n| 49  | 天墨城十三     | 70  | 腾蛇二十二     |\n| 50  | 败白四         | 71  | 墨壁陈十二     |\n| 51  | 盖屋二         | 72  | 造父五         |\n| 52  | 危三           | 73  | 霹雳五         |\n| 53  | 人五           | 74  | 雲雨四         |\n| 54  | 内杵三         | 75  | 東壁二         |\n| 55  | 白四           | 76  | 天庭十         |\n| 56  | 车府七         | 77  | 铁镜五         |\n| 57  | 钧九           | 78  | 土公二         |\n| 58  | 墳墓四         | 79  | 王良五         |\n| 59  | 虚梁四         | Total|               |\n| 60  | 天钱十         |     |               |\n| 61  | 铁钱三         |     |               |\n\nWESTERN DIVISION.\n\n| No. | Names          | No. | Names          |\n|-----|----------------|-----|----------------|\n| 1   | 奎十六         | 7   | 附路一         |\n| 2   | 外屏七         | 8   | 右梗五         |\n| 3   | 天溷七         | 9   | 天倉六         |\n| 4   | 司空一         | 10  | 天庾三         |\n| 5   | 軍南門一       | 11  | 婢三           |\n| 6   | 閣道六         | 12  | 左梗五         |\n### STAR LIST\n\n| No. | Names          | No. | Names          | No. | Names          |\n|-----|----------------|-----|----------------|-----|----------------|\n| 13  | 天將軍十一     | 11  | 柱三           | 3   |                |\n| 14  | 天囷十三       | 13  | 柱三           | 3   |                |\n| 15  | 褐藁六         | 6   | 柱三           | 3   |                |\n| 16  | 積尸一         | 1   | 天演五         | 5   |                |\n| 17  | 鬼三          | 3   | 咸池三         | 3   |                |\n| 18  | 天壇四         | 4   | 天闕一         | 1   |                |\n| 19  | 大陵八         | 8   | 參旗九         | 9   |                |\n| 20  | 天詭一         | 1   | 九府九         | 9   |                |\n| 21  | 卷舌六         | 6   | 玉井四         | 4   |                |\n| 22  | 天苑十六       | 16  | 九州殊九       | 9   |                |\n| 23  | 昂七           | 7   | 諸王六         | 6   |                |\n| 24  | 天阿一         | 1   | 酱三           | 3   |                |\n| 25  | 礦石四         | 4   | 坐旗九         | 9   |                |\n| 26  | 天園十四       | 14  | 司恆四         | 4   |                |\n| 27  | 天陰五         | 5   | 屏二           | 2   |                |\n| 28  | 天街二         | 2   | 參十           | 10  |                |\n| 29  | 月一           | 1   | 軍井四         | 4   |                |\n| 30  | 畢八           | 8   | 廁四           | 4   |                |\n| 31  | 天節八         | 8   | 水府四         | 4   |                |\n| 32  | 天高四         | 4   | Total          | 284 |                |\n| 33  | 五車五         | 5   |                |     |                |\n\n### SOUTHERN DIVISION\n\n| No. | Names          | No. | Names          | No. | Names          |\n|-----|----------------|-----|----------------|-----|----------------|\n| 1   | 井八           | 8   | 水位四         | 4   |                |\n| 2   | 北河三         | 3   | 四濱四         | 4   |                |\n| 3   | 南河三         | 3   | 軍市十三       | 13  |                |\n| 4   | 天樽三         | 3   | 野鶏一         | 1   |                |\n| 5   | 五諸候五       | 5   | 丈人二         | 2   |                |\n| 6   | 積薪一         | 1   | 子二           | 2   |                |\n| No. | NAMES       | No. | NAMES       | No. |\n|-----|-------------|-----|-------------|-----|\n| 13  | 孫二        | 2   | 器府二十九  | 29  |\n| 14  | 闕丘二      | 2   | 明堂三      | 3   |\n| 15  | 猿一        | 1   | 大微五      | 5   |\n| 16  | 弧矢九      | 9   | 屏四        | 4   |\n| 17  | 老人一      | 1   | 五帝五      | 5   |\n| 18  | 天狗七      | 7   | 太子一      | 1   |\n| 19  | 天矢一      | 1   | 幸臣一      | 1   |\n| 20  | 鬼五        | 5   | 從官一      | 1   |\n| 21  | 燈四        | 4   | 太陽守一    | 1   |\n| 22  | 外厨六      | 6   | 常陳七      | 1   |\n| 23  | 天社六      | 6   | 相一        | 1   |\n| 24  | 柳八        | 8   | 勢四        | 4   |\n| 25  | 酒旗三      | 3   | 軫四        | 4   |\n| 26  | 星七        | 7   | 長沙一      | 1   |\n| 27  | 軒轅十七    | 17  | 左軺一      | 1   |\n| 28  | 內平四      | 4   | 右軺一      | 1   |\n| 29  | 天相三      | 3   | 大微五      | 5   |\n| 30  | 稷五        | 5   | 諦者一      | 1   |\n| 31  | 張六        | 6   | 三公內坐三  | 3   |\n| 32  | 天廟十四    | 14  | 九鄉三      | 3   |\n| 33  | 長垣四      | 4   | 五諸候五    | 5   |\n| 34  | 天牢六      | 6   | 郎位十五    | 15  |\n| 35  | 三台六      | 6   | 青丘七      | 7   |\n| 36  | 虎賁一      | 1   | 軍門二      | 2   |\n| 37  | 少微四      | 4   | 土司空四    | 4   |\n| 38  | 靈臺三      | 3   |               |     |\n| 39  | 太尊一      | 1   |               |     |\n| 40  | 翼二十二    | 22  |               |     |\n| 41  | 東區五      | 5   |               |     |\n| 42  | 器府二十九  | 29  |               |     |\n| 43  | 明堂三      | 3   |               |     |\n| 44  | 大微五      | 5   |               |     |\n| 45  | 屏四        | 4   |               |     |\n| 46  | 五帝五      | 5   |               |     |\n| 47  | 太子一      | 1   |               |     |\n| 48  | 幸臣一      | 1   |               |     |\n| 49  | 從官一      | 1   |               |     |\n| 50  | 太陽守一    | 1   |               |     |\n| 51  | 常陳七      | 1   |               |     |\n| 52  | 相一        | 1   |               |     |\n| 53  | 勢四        | 4   |               |     |\n| 54  | 軫四        | 4   |               |     |\n| 55  | 長沙一      | 1   |               |     |\n| 56  | 左軺一      | 1   |               |     |\n| 57  | 右軺一      | 1   |               |     |\n| 58  | 大微五      | 5   |               |     |\n| 59  | 諦者一      | 1   |               |     |\n| 60  | 三公內坐三  | 3   |               |     |\n| 61  | 九鄉三      | 3   |               |     |\n| 62  | 五諸候五    | 5   |               |     |\n| 63  | 郎位十五    | 15  |               |     |\n| 64  | 青丘七      | 7   |               |     |\n| 65  | 軍門二      | 2   |               |     |\n| 66  | 土司空四    | 4   |               |     |\n\nA total of 1463 stars under 306 designations part of which are repeated.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko43roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 86, "total-input-tokens": 119392, "total-output-tokens": 36540, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 397, 7], [397, 397, 8], [397, 2120, 9], [2120, 4216, 10], [4216, 6272, 11], [6272, 8393, 12], [8393, 10397, 13], [10397, 12601, 14], [12601, 14765, 15], [14765, 16987, 16], [16987, 19199, 17], [19199, 21377, 18], [21377, 23566, 19], [23566, 25639, 20], [25639, 27757, 21], [27757, 29909, 22], [29909, 31805, 23], [31805, 31805, 24], [31805, 33191, 25], [33191, 35309, 26], [35309, 36976, 27], [36976, 38614, 28], [38614, 40540, 29], [40540, 42046, 30], [42046, 43725, 31], [43725, 45848, 32], [45848, 48019, 33], [48019, 50164, 34], [50164, 52119, 35], [52119, 53988, 36], [53988, 55585, 37], [55585, 57420, 38], [57420, 59070, 39], [59070, 61120, 40], [61120, 65256, 41], [65256, 67520, 42], [67520, 70934, 43], [70934, 74382, 44], [74382, 76268, 45], [76268, 78405, 46], [78405, 79666, 47], [79666, 79666, 48], [79666, 79666, 49], [79666, 79666, 50], [79666, 79666, 51], [79666, 81613, 52], [81613, 83746, 53], [83746, 85868, 54], [85868, 87811, 55], [87811, 89820, 56], [89820, 92020, 57], [92020, 94047, 58], [94047, 94047, 59], [94047, 96248, 60], [96248, 96598, 61], [96598, 98752, 62], [98752, 100880, 63], [100880, 103004, 64], [103004, 104926, 65], [104926, 107124, 66], [107124, 109308, 67], [109308, 109494, 68], [109494, 111633, 69], [111633, 112778, 70], [112778, 114761, 71], [114761, 115042, 72], [115042, 115434, 73], [115434, 115803, 74], [115803, 116920, 75], [116920, 118290, 76], [118290, 120056, 77], [120056, 121407, 78], [121407, 123495, 79], [123495, 126075, 80], [126075, 126075, 81], [126075, 126075, 82], [126075, 126075, 83], [126075, 126075, 84], [126075, 126075, 85], [126075, 126075, 86]], "primary_language": ["None", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "zh", "zh", "zh", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]