[{"id": "6bcb8d9eceb7040d8bdc7ae0a8a30d4e307c0d87", "text": "TRANSACTIONS\n\nOF THE\n\nKOREA BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY\n\n鮮 朝\n\nVOL. IX.\n\nSupplied gratis to all Members of the Society.\n\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\n\nSeoul, Korea: The Korean Religious Tract Society.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1918.\nTHE VEGETATION OF KOREA.\n\nBy Ernest H. Wilson, M.A.\nArnold Arboretum, Harvard University.\n\nApropos of travel, Charles Darwin, in a retrospective chapter in his classical \"Voyage of the Beagle,\" says \"A traveller should be a botanist, for in all views plants form the chief embellishment. Group masses of naked rock, even in the wildest forms, may for a time afford a sublime spectacle, but they will soon grow monotonous. Paint them with bright and varied colours, and they become fantastic; clothe them with vegetation, and they must form a decent, if not beautiful picture.\"\n\nNow, all of you, and all people in general, love flowers, and botany, which is the intimate study of flowers, ought to be a pleasing recreation. Yet I fear that botany has suffered much at the hands of its professors. There have been invented too many hard terms and difficult names, which wearily tax the memory of would-be students, and cause many to regard botany as a dry and difficult science. This ought not to be, for the study is full of interesting phenomena, and it ought to be a simple matter to attract and hold the attention of any student. As an example: take Grass, which is found the world over and upon which so much animal life depends. Did you ever consider why it is that when the blades (leaves) of Grass are cut they grow again? If the leaf of an ordinary plant is cut no regeneration takes place, and it either remains in a mutilated state until Autumn or dies prematurely. Did the same obtain with Grass we could have no lawns nor meadows, and what would herbivorous animals do for food? The explanation is in the simple fact that in the Grasses the growth cells are situated at the extreme base of the leaf, whereas in ordinary plants the growth cells are situated at the apex of the leaf.\nAgain, take the Aspen or Trembling Poplar whose leaves are scarcely ever still. Did you ever examine these leaves to find out the cause of their extreme sensibility to the faintest breath of moving air? If so, you must have noted that the leaf-stalk, unlike that of an ordinary plant which is rounded on three sides and only slightly flattened and grooved on the upper, thus holding the leaf-blade in a rigid position, is flattened laterally, and the leaf-blade in consequence is poised at a most delicate angle. I could cite many other instances, were it necessary, to prove the interest there is in the study of the common plants around us; but my object this afternoon is to tell a little about the vegetation of Korea, and more especially of the trees which grow there.\n\nA question frequently asked is: What books are there dealing with the botany of Korea—books which tell of the common forms—books which would enable a novice to identify the plants met with in Korea? The answer is, and I make it regretfully, there are no such books and I fear it will be a long time before any such will be written. Nevertheless, there are books such as: Forbes and Hensley's \"Index Florae Sinensis,\" Palibin's \"Conspectus Florae Koreanae,\" Komarov's \"Flora Manchurica\"; also the \"Flora Sylvatica Koreana\" and several others by Dr. T. Nakai; but all these are highly technical in character and of little or no use to the beginner. Nevertheless, it is satisfactory to know that the Government of Korea, following the example of that of Great Britain, is carrying out a systematic investigation of the flora of Korea. The work is in the capable hands of Dr. T. Nakai, of the Imperial University, Tokyo, who is the foremost living authority on the subject. As the result of the work already done we know that the known flora of Korea comprises about three thousand species and varieties, belonging to seven hundred and eighty genera and one hundred and fifty families; of this number about six hundred are woody plants—that is trees, shrubs and climbers. It is these woody plants that are my particular study and, more\nespecially, the trees. Now, the flora of Korea is essentially northern or boreal in character, and its most marked feature is the almost complete absence of broad-leaf evergreen woody plants. A few do occur in the extreme south, but none is widely distributed over the country. Quite the opposite obtains in Japan, where from Tokyo southward broad-leaf evergreen trees and shrubs abound. Again, in Korea there is a marked absence of Bamboos which are such a characteristic feature of the flora of Japan. In the New England States of Eastern North America, the general aspect of the flora is similar to that of Korea, because of the same marked absence of broad-leaf evergreen woody plants, whereas that of Old England, containing as it does many broad-leaf evergreens, more resembles that of Japan. These striking differences are largely due to climate. Japan and England both enjoy an equable, insular climate, and rains are generally distributed over the whole year—a condition favorable to the growth of evergreen plants. Whereas the climate of Korea and of Eastern North America is continental in character; that is to say, one of extremes of heat and cold, and one in which the rainfall is limited to definite periods of the year. Such a climate is favorable to the growth of deciduous plants, but is inimical to those of an evergreen nature. In the extreme south and southeast of Korea, near the sea, the climate is materially modified through the influence of the Japan current, and the flora is different in aspect to that of the other parts of the peninsula.\n\nAgain, the flora of any country is markedly influenced by the nature of its soil. For example: many plants, such as Rhododendrons, detest limestone. Now, geologically, Korea is mainly composed of granite, basalt, and highly metamorphosed rocks of Pre-Cambrian age. In the northeast (the region of Paik-Tu-san), in the east-central portion (round Fukkei), and on Quelpaert in extreme south, the basalt has been forced to the surface by volcanic action. West of Gensan, and extending almost to the China Sea, mud-shales, slates and a little limestone, all of Paleozoic age, obtain; a similar formation is found to the\nnortheast of Taiden. The southeast corner of the peninsula is of Mesozoic rocks, largely limestones. Each of these formations support a certain number of plants which are peculiar to them, so, in order to get a comprehensive idea of the flora, it is necessary to visit as many parts of the country as possible.\n\nUntil Tertiary times—that period of vast upheavals and submersions, due to the folding of the earth's crust—Japan was joined to the mainland; also, the climate of the northern latitudes was very much warmer than it is at the present time. In Tertiary times volcanic activity was very great and apparently the volcanoes of Korea, except the peak of Paik-Tu-san itself and two islands of the Quelpaert group, ceased activity about the close of this period.\n\nIn Tertiary times the flora of the northern Hemisphere—that of America, Europe and Asia—was similar, as is proved by the fossil remains found in these regions. The diversity which now obtains was brought about through the destructive influence of the period of great cold (Glacial Epoch) which the close of the Tertiary period ushered in. In Europe and in North America the ice cap descended far to the south, forcing the plants to migrate, and destroying all that remained in its path. In northeastern Asia, whilst the ice cap did not reach Korea nor Japan, the temperature was greatly lowered and there was a general receding of the vegetation toward the south. This migration of trees, and other forms of vegetation, was brought about then as it is now by means of their seeds being carried by birds, animals, winds, sea currents, etc. In Europe so great was the destruction during the period of great cold that to-day only thirty-six genera of trees grow there. In North America, where the continuity of land is much greater, the destruction was correspondingly less. That previous to the period of great cold, the flora of the northern Hemisphere was everywhere similar is proved very conclusively by fossil evidence. For example: Magnolias now grow only on the Himalayas, in China, Korea, Japan and in North America east of the Mississippi Valley, but fossil remains are abundant in the shallow\nsea off the coast of Holland, in the estuary of the Thames and other English rivers. There too are found fossil remains of the Tulip Tree and of the Sassafras, of which today only two species of each are known—one of each in Eastern North America, and another of each in Central China. In connection with this one of the most interesting trees living today is the Ginkgo, or the Maidenhair Tree (*Ginkgo biloba*). During Mesozoic times, when Cycads and Giant Lycopods formed the dominant features of the vegetation in the northern latitudes, the Ginkgo flourished. Today it is unknown in a wild state, but fossil remains, apparently identical with the living tree, have been found in England, in Greenland, in North America and in Siberia. The Ginkgo is a favourite with Buddhists, and in China, Japan and Korea is found associated with their temples and other buildings, and undoubtedly it has been preserved through the influence of the Buddhists and other religious sects.\n\nAnother example of the beneficient guardianship of the trees by religious communities is afforded by the Common Pear of Europe, many of the best varieties of which were originated by Catholic priests in Belgium, and found their way into general cultivation after the close of the Napoleonic wars.\n\nEvery country has a few (or many) plants peculiar to it—these are spoken of as endemic species—but the bulk of the species are usually common to contiguous areas; their distribution being limited by adverse influences of climate and soil only. The genera to which species belong have usually a much more extended distribution. For example: the genera represented in Korea are also found in Europe, in northern Asia and in North America. In the case of herbs and low growing alpine shrubs, it sometimes happens that the species are the same in all four lands, but usually, and particularly in the case of trees, whilst the genera to which the species belong may be common to the whole northern Hemisphere, the species are usually peculiar to definite geographical areas. This is true for Korea where, however, endemic species are relatively few in number, the majority of them being found also in Manchuria, in the Amur\nregion, and in northern Japan. I mentioned earlier that the general aspect of the flora of Korea was similar to that of the New England States of Eastern North America, but it must be remembered that this resemblance is only superficial in character, for in every instance the species—that is the component elements—of woody plants are different in the two regions.\n\nNow, since the known flora of Korea consists of about three thousand species and varieties, it is obviously impossible in the time at my disposal to give a detailed account of the whole flora. My special study is woody plants, so I propose to confine my remarks mainly to them, and since trees are the most important of woody plants it will be just as well to concentrate our attention on them and, better still, on certain groups of trees. In Korea, there are about seventy-five genera of trees, none of them peculiar to the country; the number of species and varieties of trees is about one hundred and sixty, and quite a number of these are found only in Korea. The commonest trees are species of Birch, Oak, Maple, Willow, Poplar, Hornbeam, Ash, Dogwood, Pine, Fir, Spruce and other Conifers.\n\nThe Conifers, of which the Pine and Fir (Balsam) are the two commonest representatives in Korea, form a highly important class of trees; most of them have small, persistent, evergreen leaves, and nearly all furnish useful timber. The Pine, so abundant as a low scrubby tree around Seoul, is a Red Pine, the name of which is *Pinus densiflora*. This Pine is found all over Korea and crosses the Yalu River into Manchuria; it is also abundant in Japan from the extreme south to the limits of northern Hondo. Under favourable circumstances it is a handsome tree, growing one hundred feet or more tall, with a trunk from eight to ten feet in girth, and has papery, reddish bark, and a flattened or oval crown. The wood is of a fair quality, and is used in all sorts of general construction work. In Korea this Pine may be at once recognised by its having only two (rarely three) leaves in a sheath, and by its small cone, the scales of which open and shed the winged seeds. The other common Pine is known as *Pinus koraiensis*—the\nEdible Nut or Blue Pine of Korea. This species is characterized by its having five leaves in a sheath, and by its large cone, which falls off when it is ripe but does not open to shed its large, nut-like seeds, which have no wing. This species is distributed from the mountains of Chiri-san, near the southern end of the peninsula, northward to the valleys of the Tumen and Yalu rivers and beyond. It also grows wild in Japan in the provinces of Hida, Echigo, and western Shinshu, and is one of the trees which prove that in former times Japan and Korea were connected by land. The wood of this Korean Pine is of excellent quality, and is largely used for general construction work. Questions concerning timber concessions of this Pine, and of Spruce and Larch, in the upper regions of the Yalu and Tumen rivers, had much to do in precipitating the Russo-Japanese war.\n\nOn the higher peaks of Kongo-san a Creeping Pine forms a dense jungle. This Pine, known as *Pinus pumila*, is a northern plant, abundant in northeastern Asia, from Lake Baikal eastward to Saghalien; also in Hokkaido, and in Hondo as far south as the Japanese Alps in Shinshu. It grows on all the higher peaks, both volcanic and granitic, in northern Korea, except on that of Paik-Tu-san itself. Its absence from that mountain proves that volcanic activity took place there at a much later date than on the other mountains of the same range.\n\nAnother tree common around Seoul is the Korean Fir or Balsam (*Abies holophylla*). This has dark green, prickly leaves radiating from the branch like the teeth of a comb; branches in tiers one above another, and a large, erect, green, cylindrical cone which falls to pieces when ripe. This tree is very ornamental, but the wood, which is white and soft, is of little value. Two other species of Fir occur in Korea, one in the south, and one from Kongo-san northward. The northern species is *Abies nephrolepis*, and in the valley of the Yalu River it forms extensive forests. The cone of this species is violet purple in color, and the wood, which is white, makes useful planking and also good match-splints.\nTwo species of Spruce (*Picca jezoensis* and *P. Koyamai*) grow in Korea, and are especially abundant in the extreme north. The wood of these two species is superior even to that of the Korean Nut Pine, and is in fact the most valuable of all the softwood trees that grow in Korea. In general appearance Spruces resemble the Firs, but they have a pendulous cone which, when ripe, opens and sheds its seeds, but does not disintegrate, and remains attached to the tree for a year or more.\n\nIn the region of Paik-Tu-san, grow extensive forests of Larch. This Larch is a large-coned variety of the species (*Larix dahurica*) common to the whole of northeastern Asia as far west as Lake Baikal, and the proper name for this Korean Larch is *Larix dahurica*, var. *Principis-Rupprechtii*. In Korea, Larch is found only on soils of volcanic origin, but so extensive are the forests of this tree that it is possible for one to ride on horseback for several consecutive days and see scarcely another tree but Larch. These Larch trees grow from one hundred twenty to one hundred and forty feet tall, and have mast-like trunks from eight to eleven feet in girth. The timber is valuable and is used for ship's masts, telegraph poles, in bridge-building, and in general construction work. Larch-logs, with those of Spruce, Fir, and Nut Pine, are rafted down the Yalu and Tumen rivers in great quantities and are the principal timbers of northern Korea.\n\nThe Larch forests in their typical form are pure, often parklike in aspect, and the trees, though varying in size, are more or less of an age. In such forests young seedlings are never seen, except on the edges of paths and in areas that had been swept by fire. In the volcanic region of northern Korea after an ordinary forest fire Larch, Birch and Trembling Poplar are the first trees to appear. This interesting fact is highly suggestive, and points out a way of economically effecting reforestation. Now, it is very generally thought that a forest, if left undisturbed, will continue to perpetuate itself indefinitely, but this is by no means a fact, for in the course of centuries one type of tree after another will predominate, and the character of the forest\nbecomes changed. In other words there is a rotation of forests, even as a good farmer maintains a rotation of crops. In northern Korea, in the Paik-Tu-san region especially, Nature's method of forest rotation is clearly demonstrated. The cycle is roughly as follows: In the course of time after volcanic activity in that region, as after forest fires at the present time, seedlings of Birch, Trembling Poplar and Larch sprang up. The seeds of these plants being light are easily transported long distances by wind, and all three kinds of trees are abundant in the region to the north of Korea. Larch though a light-demanding tree needs, when young, a certain amount of shade, and Birch and Trembling Poplar with their slender twiggy branches afford just the requisite amount. These three kinds of trees grow together in harmony for a few years, the Birch and Poplar growing the faster at the commencement, but after twenty or thirty years the Larch overtakes the Birch and Poplar and finally kills them, and pure forests of Larch remain. As the Larch trees increase in size so the forest floor beneath them becomes more and more shady and invites the presence of shade-loving trees such as Fir, Spruce and Nut Pine. What happens is this: When the pure Larch forests are sixty to a hundred years old, seedlings of Fir, Spruce and Nut Pine creep in, and in course of time grow into trees and finally kill out the Larch. Larch with its deciduous leaves, and trunks clean of branches for a considerable distance, is in less danger from fire than Spruce or Fir, which keep their branches from near the ground upward and, moreover, have a very resinous bark and evergreen, resinous leaves: The result is that sooner or later, either from electric storms or from human agency, fire overtakes these forests of Spruce and Fir. If the fire is only moderately severe, Larch, Birch and Poplar quickly spring up where the forests of Spruce and Fir grow and the cycle is repeated. If, on the other hand, the fire is very severe (or the deforestation by man be completed) grasses and coarse herbs succeed and the region becomes virtually a wilderness. In the course of time bushes and trees of a deciduous character spring up among the grass and finally\na forest of deciduous trees is developed. As these in turn are attacked by fire or man, the Red Pine (*Pinus densiflora*), which is constantly advancing from the south, enters and ultimately forms pure forests beneath whose shade scarcely an herb or blade of grass can flourish. These types of forests, either in their complete form, or in their different stages of development, may be seen by anyone travelling up and down Korea.\n\nThe Korean has done his best in the course of ages to utterly destroy the forests of his country, but in the northeastern regions he was ably abetted by one of Hideyoshi's armies which landed there during the time of that famous Japanese warrior's invasion of Korea. But we digress—Of the other Conifers of Korea, which include three Junipers and an Arbor-vitae, little need be said since they are quite unimportant, though one Juniper (*Juniperus rigida*), with spiny leaves, is common around Seoul and elsewhere in Korea.\n\nThe Yew family is represented in Korea by *Taxus cuspidata* and two other allied plants of lesser importance. The Taxus is a common tree on some of the lower peaks of the Diamond Mountains, where handsome specimens fifty feet tall, with trunks from eight to ten feet in girth, and broad spreading crowns are common. In fact, nowhere in eastern Asia have I seen such magnificent Yew trees as on the Diamond Mountains.\n\nDeciduous-leaf trees, commonly spoken of as hard-wood trees, are well represented in Korea and in many parts, notably on the east coast north of Gensan, and in the northwest (Unsan district), form extensive forests. Large trees are not common, and scarcely one yields timber of good quality. The Oak, which is perhaps the most important of these trees, is represented by six species. The most common of these is the *Quercus mongolica*, which is closely related to the English Oak and is found all over the country and in the north is the only representative of the genus. Handsome trees of this Oak are very rare and the wood is of second rate quality only. This same species grows also in Hokkaido, where its timber is superior and of great value; this fact illustrates the importance of soil and\nclimate in the development of timber. Another common Oak is *Quercus dentata*, usually met with on the hillsides as dwarf scrub. It has large leaves, hairy on the underside, and large, shaggy acorn-cups; when allowed to grow into a tree it has a deeply fissured bark, rich in tannin, and is employed in tanning hides. The same species also grows in China, and in Japan where it is very abundant in Hokkaido. The other deciduous-leaved Oaks are comparatively unimportant in Korea; on Quelpaert grow five species of Oak with evergreen leaves all of which grow also in Japan.\n\nOf the eight species of Birch the most noteworthy is *Betula Schmidtii*, called by the Koreans \"Pak-Tal,\" which has a firm, close-grained wood, heavier than water; this wood is largely exported to China, where it is used in making carts. The tree grows on steep, cliff-like ground only, and is never found on volcanic soils; it is abundant on the Diamond Mountains, and its clear yellow autumnal tints contribute very largely to the Autumn glory of that region. A Silver Birch (*Betula japonica*), and a Red Birch (*Betula dahurica*), are widely distributed through Korea, especially on volcanic soils, and it is these species and one other which grow so commonly in association with young Larch trees in northern Korea.\n\nMaples are very common throughout the peninsula, and of the eight species, five are peculiar to the country. Perhaps the most common and certainly the most noteworthy is *Acer pseudo-sieboldianum* whose leaves in Autumn change to brilliant shades of orange, scarlet and crimson. Another common species, especially at low elevations, is *Acer ginnala*; the leaves of this species are shipped to China and from them a blue, indigo-like dye is extracted. Two species having pinnately divided leaves (*Acer triflorum*, *A. minchuricum*) grow to a large size and are among the handsomest of Korean trees.\n\nThe Keyaki (*Zelkova serrata*), whose wood is used for making Korean chests, and in Japan in making jinrikishas, is fairly common from the neighbourhood of Seoul southward; a Walnut (*Juglans mandshurica*) is common, especially in rich\nwoods, in central and northern Korea. Of Tree Willows there are several species. The one so common around Seoul and which has hanging or spreading branches is *Salix korcensis*. There are four species of Poplar in Korea—*Populus tremula*, *P. Simonii*, *P. suaveolens* and *P. Maximowiczii*. The first named is always a small tree; the others grow to a large size, indeed *P. Maximowiczii* attains a greater size than any other tree in Korea. This species is especially abundant in northeastern Korea, where trees one hundred feet high, with trunks from eighteen to twenty feet in girth are not uncommon. The same species also grows in Hokkaido. Of Elms six species grow in Korea *Ulmus japonica* is the most common and most widely distributed. In the arid valleys of northern and northwestern Korea; *Ulmus pumila* is fairly common. Although this tree grows to a large size, when young it can be very successfully employed for hedges as has been done at the railway stations many throughout Manchuria from Antung northward. There are other interesting trees in Korea, but time does not admit of my mentioning them here.\n\nOf deciduous shrubs there is great variety in Korea, many of them bearing bright-colored, handsome flowers. For example: around Seoul grow at least three kinds of Azaleas (*Rhododendron mucronulatum*, *R. poukhanense*, *R. Schlippenbachii*). The last named grows to a large size, and has beautiful, clear pink flowers. *R. poukhanense* is a low shrub with mauve-colored, fragrant flowers. The Golden-bells (*Forsythia viridissima*), two Weigellias (*Diervilla florida*, *D. floribunda*), the Lilac, the Yellow Rose, and the pink-flowered Indigofera are all beautiful plants worthy of a place in every garden. Only two kinds of Barberry grow in Korea. One of them (*Berberis korcana*) is abundant in this neighbourhood; the other is rare but occurs scattered on the mountains throughout the length and breadth of the peninsula. Curiously enough the Bramble, so prolific in species in the northern Hemisphere generally is represented in Korea (except in the extreme south) by four species only. The most common is *Rubus crataegifolius*,\nwhose reddish stems are conspicuous in Winter. From Seoul southward the white-stemmed *R. coreanus* is fairly common, and in the extreme north a species with delicious Raspberry-like fruits is abundant.\n\nOf climbing plants the variety is not so great, but individually they are abundant, none more so than the lovely *Ampelopsis Veitchii* so common on rocks and cliffs, and whose leaves in Autumn assume such fiery tints. A Bittersweet (*Celastrus articulatus*) is also abundant, and in the Autumn and early Winter, when laden with masses of yellow fruits which open and display the scarlet seeds within, is most conspicuous. Another common climber has many of its leaves wholly or in part white and is often called \"Snow on the Mountains.\" Its name is *Actinidia kolomikta*. Another species of this genus, *A. arguta*, has greenish brown fruit which is edible and is much esteemed by the Koreans. In central and northern Korea a true Grape Vine (*Vitis amurensis*) is abundant. It bears shining black fruits which are edible but are rather harsh in flavour; in Autumn its leaves change to fine shades of crimson. Then, too, there are several species of Clematis with white, yellow and purple flowers; two kinds of Rambler Roses, each with clusters of white, fragrant flowers; the Kudo Vine (*Pueraria Thunbergiana*) with erect spikes of reddish, pea-like flowers which are followed by hairy fruit pods; others with less conspicuous flowers, and, lastly, but not the least beautiful, a Climbing Honeysuckle (*Lonicera japonica*) with sweet-smelling, white flowers which change to yellow as they age.\n\nOf Broad-leaf Evergreens, whose scarcity is a marked feature of the Korean flora, only four species grow in this neighbourhood and northward, and none is really common. Hereabouts, a low growing species of Box is fairly plentiful, but its distribution is limited. On the mountains in the north two species of Rhododendron (*R. brachycarpum* and *R. chrysanthum*) grow, but are rather rare. A low growing Bamboo (*Sasa spiculosa*) is found here and there, but possesses neither beauty nor economic value. Except in the extreme south no Holly\n(Ilex) grows in Korea, but Mistletoe, both with a greenish white and reddish fruit, is a common pest everywhere.\n\nThe mountains of Korea are not particularly rich in woody Alpine plants, although on them grow a number of such plants which are widely distributed round the northern Hemisphere and are commonly called circumpolar plants. Of these the Crowberry (Empetrum nigrum), Cowberry (Vaccinium Vitis-idaea), Blueberry (Vaccinium uliginosum), Greenland Tea (Ledum palustre), various species of low growing Willows, and the red-fruited variety of Arctous alpina are the most common.\n\nKorea is rich in herbs, many of which have conspicuous and beautiful flowers, and none more so than the different Gentians, Monkshoods, Lilies, Astilbes, Chrysanthemums, Irises and Asters. In the Autumn, blue is the dominant colour among the herbs in blossom. This is in marked contrast to the herbaceous flora of Europe and North America, where yellow prevails. One Korean herb is particularly noteworthy on account of the enormous size of its leaves, which are round, and as large as a small table. Its name is Rodgersia tabularis, and it was first discovered by Dr. John Ross, one of the earliest Protestant Missionaries in Manchuria. In the extreme north and northwest of Korea this plant is very common in shady places. It grows five to six feet tall, and has terminal clusters of small, pure white flowers.\n\nSo far in this cursory story of the Vegetation of Korea I have dealt with the typical flora only. Let us now consider some exceptions. On the volcanic island of Quelpaert, situated in the extreme south of the Korean archipelago, we find a totally different flora to that of the mainland proper. This flora is largely composed of evergreen woody plants nearly all of which are also found in Japan. In fact, the flora of Quelpaert is not Korean but Japanese though geologically the island belongs to the Korean system of volcanoes and not to the Japanese. The presence of so many evergreen trees and shrubs on Quelpaert is due to the warm and equable climate largely induced by the Japan current which washes its shores. To-day, the island\nis well-nigh denuded of large trees, but at one time it was densely forested, and history tells us that Kublai-Khan built a hundred ships there for his attack on Japan. On the middle slopes of Hallai-san, the main peak of the island, are pure woods of Hornbeam (*Carpinus laxiflora* and *C. Tschonoskii*). These woods are unique in eastern Asia as far as my knowledge goes, but alas they are rapidly being destroyed for the cultivation of a Mushroom (Shiitake). For this purpose the trees are felled and cut into logs which are allowed to partially rot; they are then stacked angle-wise and on these rotting logs the Mushroom develops. Apart from its close relationship with that of Japan the flora of Quelpaert has many anomalies. For example: no Spiraea, Deutzia nor Philadelphus grows there, whereas, these are the commonest of plants on the mainland of Korea and Japan. Again, the Fir which grows on Quelpaert is peculiar to the Island and to Mt. Chiri.\n\nThe small island of Ooryöngtō (Utsuruyotō, Takeshima or Warrior Island), situated in the Japan Sea, off the east coast of Korea, is another interesting outpost of the Japanese flora. This island is of volcanic origin and is largely made up of trachyte lavas, and belongs to the Korean system. On this island topsyturvydom obtains, for many Alpine plants grow at sea-level and plants which in Japan are found only near the coast grow high up on the mountain-side. Here, too, are found forests of Beech, a tree common in Japan but unknown on the mainland of eastern Asia, except in the heart of China. The Japanese Hemlock (*Tsuga Sieboldii*) is common on Ooryöngtō but does not reach the mainland of Korea, and the five-leaved Pine on the Island is not the Korean Nut Pine, but the Japanese Goyo-matsu (*Pinus parviflora*). The Paulownia, so much cultivated in Japan where its wood is made into chests and sandals, is possibly indigenous in Ooryöngtō, and so too is the Keyaki (*Zelkova serrata*). Formerly this interesting little Island was heavily forested, and the pillars and beams used in construction of many temples in Japan, notably those of the Higashi-Hongwanji in Kyoto, came from there. But today, what forest remains is only in the\ncentral and least accessible part of the Island. Round the coast the Chinese Juniper (*Juniperus chinensis*) is common and is indigenous.\n\nLastly, a word or two may be said about some of the common fruit trees of Korea. These, like those of Japan, have been mainly introduced from China; this is true of the Peach, Plum, Sand Pear, Persimmon, Common Walnut, and one of the two Chestnuts cultivated; the other Chestnut is indigenous and so too very probably is the Apricot. A Pear (*Pyrus ussuriensis*) is a common wild tree in northern Korea and forms of it are cultivated in Korea and Manchuria, and yield a small, flattened-round fruit of good quality.\n\nIn the northwest a Bush Cherry (*Prunus tomentosa*) with red, edible fruit is a common wild plant; and in the extreme north, Currants, both Red and Black, are indigenous.\n\nIn the course of one short lecture it is obviously impossible to do more than skim the surface of such a subject as the Vegetation of Korea, but I earnestly hope that the little I have said is enough to show that the subject it not without interest, and that it is worthy of the study during leisure moments of those who live or sojourn in Korea.\nAspen or Trembling Poplar (*Populus tremula* L.)\nTree 40 ft. tall, girth of trunk 3 ft. Pukchin, Heian-hokudo.\nMAIDENHAIR TREE (Ginkgo biloba L.)\n\nTree 80 ft. tall, girth of trunk 14 ft. Choanji Temple, Kongo-san, Kogendo.\nRED PINE (Pinus densiflora S. & Z.)\nTree 75 ft. tall, girth of trunk 12 ft. Near Kojyo, Kogendo.\nKorean Nut Pine (Pinus koraiensis S. & Z.)\nTree 80 ft. tall, girth of trunk 7 ft., Shoyudo, Heian-hokudo.\nCREEPING PINE (*Pinus pumila* Regel)\nSummit of Laolin-san, alt. 2002 m. Kankyo-nando.\nKOREAN FIR (Abies holophylla Maxim.)\nTree 90 ft. tall, girth of trunk 10 ft. Kongo-san, Koge-do.\nFlat-leaf Spruce (Picea jezoensis Carr.)\nTrees 90 ft. tall, average girth of trunks 8 ft. Setsurei, near Engan, Kankyo-hokudo.\nKorean White-bark Fir (Abies nephrolepis Maxim.)\nTrees 75 ft. tall, average girth of trunks 5 ft. Tokuritsudo, Kankyo-hokudo.\nKOREAN LARCH\n\n(*Larix dahurica*, var., *Principis-Rupprechtii* Rehd. & Wils.).\n\nForming pure forests: trees from 120 to 150 ft. tall, girth of trunks from 6 to 9 ft. Near Yuhyo, Kankyō-hokkaido.\nKOREAN LARCH\nAbout 50 years old, overtopping and killing Birch.\nNear Enshamen, Kankyo-hokudo.\nKorean Larch forest being displaced by mixed forest of Flat-leaf Spruce, Korean White-bark Fir and Korean Nut Pine.\n\nNear Saikarei, Kankyo-nando.\nMixed forest of Flat-leaf Spruce, Korean White-bark Fir and Korean Nut Pine at their zenith: trees from 80 to 120 ft. tall, girth of trunks from 8 to 12 ft. Near Saikarei, Kankyo-nando.\nMixed forest of Korean Nut Pine, Korean White-bark Fir and Flat-leaf Spruce being displaced by mixed forest of Hard-wood trees. Nansha-hanbakduo, Heian-nando.\nPure forest of Hard-wood trees; in foreground Mongolian Oak\n\n(Quercus mongolica Fisch.)\n\nTree 60 ft. tall, girth of trunk 7 ft. Takkol, Heian-hokudo.\nPure forest of Red Pine (Pinus densiflora S. & Z.)\nTrees from 80 to 90 ft. tall, girth of trunks from 5 to 8 ft.\nNear Heido, Chusei-hokudo.\nKorean Yew (*Taxus cuspidata* S. & Z.)\nTree 55 ft. tall, girth of trunk 8 ft. Kongo-san, Kogendo.\nKorean Tan-bark Oak. (*Quercus dentata* Thunb.)\nTree 50 ft. tall, girth of trunk 7 ft. Near Fukendo, Kogendo.\nPAK-TAL-NAM (Betula Schmidtii Regel)\nTree 55 ft. tall, girth of trunk 7 ft. Takkol, Heian-hokudo.\nManchurian Box-elder (Acer mandshuricum Maxim.)\nTree 80 ft. tall, girth of trunk 7 ft. Takkol, Heian-hokudo.\nManchurian Walnut (Juglans mandshurica Maxim.)\nTrees from 70 to 80 ft. tall, girth of trunks from 6 to 7 ft.\nTakkol, Heian-hokudo.\nMaximowicz's Poplar (Populus Maximowiczii Henry)\nTree 90 ft. tall, girth of trunk 14 ft. Ensuido, Kankyo-hokudo.\nSMALL-LEAF ELM (*Ulmus pumila* L.)\nTree 75 ft. tall, girth of trunk 11 ft. near Mozan, Kankyo-hokudo.\nJapanese Strawberry-tree (*Myrica rubra* S. & Z.)\n\nAn evergreen tree 25 ft. tall, girth of trunk 9 ft. Quelpaert Island.\nHornbeam (Carpinus Tschonoskii Maxim. & C. laxiflora Bl.)\n\nForming pure forest: trees from 50 to 60 ft. tall, girth of trunks from 6 to 8 ft. Quelpaert Island.\nJapanese Hemlock (Tsuga Sieboldii Carr.)\nTrees from 60 to 70 ft. tall, girth of trunks from 6 to 8 ft.\nOoryongto Island.\nKorean Mountain Pear (Pyrus ussuriensis Maxim.)\nTree 35 ft. tall, girth of trunk 7 ft. Near Ketsubutsuri, Kankyo-mando.\nARBORETUM COREENSE.\n\nBEING A PRELIMINARY CATALOGUE OF THE VERNACULAR NAMES OF FIFTY OF THE COMMONEST TREES AND SHRUBS\n\nfound in Chosen.\n\nAs I listened to Professor Wilson's lecture, it seemed to me that some such step as is here taken was necessary to bring home to us who live in Chosen the interesting facts which he had to teach us. As he himself said, the difficulty is that, as a rule, the people who know the language have little or no knowledge of botany, while those who have the botanical knowledge are (as he confessed that he was) ignorant of the language. Even the makers of our great Corean Dictionaries have suffered from this limitation and I have Dr. Gale's permission to say that the English and Latin names in his \"Korean-English Dictionary\" have no claim to scientific accuracy and are in some cases demonstrably incorrect. The same is also true of the Dictionnaire Coréen Francais, that magnificent pioneer work of the French Fathers. For myself I must disclaim any right to dictate to anybody on such a subject, as my own bent lies in other directions than those of natural science. I am a learner among learners and was grateful for the opportunity of sitting at the feet of such an acknowledged master of his subject as Professor Wilson. The course I took was the simple one of collecting twigs and branches of all the common trees and shrubs I came across, affixing to them labels with the vernacular names given to them by Coreans\nand then asking Professor Wilson to identify them and supply their proper botanical equivalents. I am only sorry that I began to do this so late in the season, when most of the trees had lost their leaves and flowers and fruit, and when the little time at his disposal and mine made it only possible to make the merest beginning of the work. I have been however encouraged to print this first list here as it stands, with all its inevitable incompleteness, in the hope that it may pave the way for a more extended study of the subject by others. Under each heading I have given first, the vernacular name, secondly, the ordinary English name (where it exists) and thirdly, the correct botanical designation (where ascertained). In cases where the identification was supplied by Dr. Wilson, I have added the initial W to these designations. In other cases the letter M signifies that the identification was made by Dr. Mills of the Severance Hospital, who has for some years been making a study of Corean botany, from the point of view of materia medica, and from whom (as from Dr. Gale with his unrivalled knowledge of the language) I have received the greatest help. In addition to the above mentioned names given, where possible, in the case of each tree or shrub, I have also supplied the Chinese character, when there is no doubt about it, and I have added the descriptions (even when inaccurate) given of the plant in question in Dr. Gale's Dictionary and that of the French Fathers, with a few other memoranda. The list, which only claims to be a first list and which will, we hope, be followed by others, is printed with generous 'spacing,' so as to enable students to fill up the many gaps, as their knowledge grows. It deals moreover only with \"woody\" plants. And it is greatly to be wished that some one else would make a beginning with a list of Corean flowers and other \"herbaceous\" specimens. Lastly it should be noted that it does not profess to make even a beginning of enumerating all the species of flora in Corea. It\nstarts from the philological, not the botanical, end, simply taking the commonest names of trees and shrubs in use by Koreans and endeavouring to identify these and to determine as nearly as possible their European or American equivalents.\n\nA real difficulty arises from the fact that the same Chinese character (and we are still dreadfully dependent on Chinese characters in the Far East) is often used to describe different plants in different places. This is one of the few cases in which the \"ideograph\" fails in its task of conveying the same meaning to the eyes of those who cannot converse by word of mouth. Owing largely to Nature's wilfulness in confining certain plants to certain areas and supplying their place with others in other areas, we are left face to face with the fact that a single Chinese character does duty for one tree in Chosen, for another in Japan, and for yet others in different districts of China. The character 柏 or 柏, for instance, which is used in Chosen to describe the *Pinus koraiensis* or *Nut-pine*, appears from Giles' Dictionary to be used in one part of China for *arbor vitae*, in another for *cypress*, and in yet another for the *juniper*, while in Japan (according to Inouye's Dictionary) it stands for a species of *oak*. In the subjoined list of course the characters, where given, have their Corean value.\n\nMark Napier Trollope,\nBishop in Corea,\nPresident, Korea Branch of the R.A.S.\n\nN.B.—To save space I have used the following abbreviations:—\n\nD.C.F. = Dictionnaire Coréen Francais (1880).\n\nGale = Dr. Gale's Korean English Dictionary\n\npt. i. (1911).\n\npt. ii. Chinese characters (1914).\n1. **The Pine.** *Pinus densiflora* S. & Z. (W).\n\nD.C.F. 松木 \"Arbre de sapin : bois de pin.\"\n\nGale pt. i. 松木 \"The pine tree,\" pt. ii, under the character 松木 \"The genus *pinus*.\"\n\nThis is the staple timber tree of Chosen and clothes most of the hill sides. It is sometimes known as \"the red pine.\" When allowed to do so, it grows to a considerable size, in this case usually assuming the weirdly crooked and fantastic shapes, so dear to the Oriental artist. More often, thanks to the wood cutter's chopper, its proportions are very much dwarfed.\n\nN.B.—Pine or fir-cones are called 솔방울.\n\n2. **The Fir.** *Abies holophylla* Maxim. (W).\n\nD.C.F. (No character given) \"Esp : de cèdre ou de sapin.\"\n\nGale. pt. i (word omitted by accident). pt. ii, under the character 檜木 \"The Chinese Juniper, *Juniperus chinensis*. A species of pine (*Thuya obtusa*).\"\n\n[These identifications appear to be incorrect].\n\nThis tree may easily be recognized by its straight stem with branches sprouting upwards at a somewhat acute angle to the trunk, as suggested by the three strokes on the right hand of the second of the two Chinese characters, used to designate it.\n\n3. **The Corean Nut-pine.** *Pinus koraiensis* S. & Z. (W.)\n\nD.C.F. 柏木 \"Pin (qui produit une grosse pomme de pin), qui donne des amandes comestibles appelées 잣 Tjat. Esp : de cèdre.\"\nGale pt. i. 柏木 \"The great hooked or Coulter's pine.\" 柏木 [This identification appears to be inaccurate, as that particular pine is said to exist nowhere outside a limited district of North America]. pt. ii. Under the character 柏木 \"In North China the arbor vitae, Thuya orientalis. An oak.\"\n\nThis tree, sometimes known as \"the blue pine,\" is famous in Chosen for the delicious little nuts which it produces. In Japan it appears to be known under the characters 海松木 i.e. Sea pine tree. Vide Bretschneider Botanicon Sinicum. p. 336.\n\n4. THE JUNIPER. Juniperus rigida S. & Z. (W.)\n\nD.C.F. (No character given). \"Genièvre, genévrier commun (arbre): arbuste dont les feuilles sont comme des épines.\"\n\nGale. pt. i. 桂 \"The Juniper, Juniperus Chinensis.\" But in pt. ii. 桂 is given as the character for 頓나무 and described as \"a kind of pine.\"\n\nCommonly found on hill sides, in shape of a shrub, with needle like leaves.\n\n5. THE CHINESE JUNIPER. Juniperus chinensis L. (W.)\n\nD.C.F. 香木 \"Arbre odoriférant, cyprès.\"\n\nGale. pt. i. 香木 \"The Putchuk—used for medicine and incense.\"\n\nThe name both in Chinese and Corean signifies the \"fragrant tree.\" The wood, in the shape of shavings or sawdust, is used as incense in religious sacrifices.\nThe tree is commonly found planted by the side of wells in Chosen.\n\nThe Chinese Arbor Vitae (Thuya Orientalis L.) is used for incense in China, and appears to have been imported by the Buddhists into Chosen, where it is possibly sometimes confused with Juniperus chinensis.\n\n6. The Yew. Two varieties:\n   (a) The Faetid Yew. Cephalotaxus drupacea S. & Z. (W.)\n   (b) The Korean Yew. Taxus cuspidata S.; & Z. (W.)\n\nD.C.F. 비즈榧子 \"Nom d'une espèce de noisette qui-vient dans de grands arbres resineux (elle a la propriété de tuer le ver solitaire.)\"\n\nGale: pt. i. 비즈榧子 \"The nuts of a kind of yew-tree, Torreya Nucifera.\" pt. ii. under the character 樟 \"The Torreya Nucifera, a species of yew.\"\n\nN.B.—The Torreya Nucifera does not exist outside Quelpaert in Chosen.\n\n7. The Box. Buxus microphylla, var. riparia Mak. (W.)\n\nD.C.F. 檜陽木 \"Buis (arbre).\"\n\nGale, pt. i. 黄楊木 \"Box wood.\"\n\nThe wood of the Corean box tree is very hard and much used for making seals and stamps.\n8 The Larch\n\nLarix dahurica, var.\n\nD.C.F. (not given)\n\nPrincipis-Rupprechtii\n\nRehd. & Wils. (W.)\n\nGale. 落葉松 \"Larch tree, larixleptolepio.\"\n\nThe name signifies \"Falling-leaf-pine,\" a fair description, as it loses its leaves in the winter, unlike the more usual specimens of the pine and fir tribe.\n\n9 The Common Oak\n\nQuercus mongolica Fisch. (W.)\n\nD.C.F. 真木 \"Chêne (arbre)\"\n\nGale. 橡木 \"The oak.\"\n\nThe oak shares with the pine the greater part of the duty of clothing the hill-sides of Chosen. When allowed to do so, it attains to considerable proportions and becomes a handsome tree. More often it shares the fate of the pine, being kept in a dwarfed state by the wood cutter's chopper. Acorns are called 상수리 or 도토리, either of which is used as the Corean rendering of the character 橡木. Hence the tree, commonly known as 촘나무 or \"the true tree,\" is sometimes also known as 상수리나무 or 도토리 나무, i.e. the acorn tree.\n\nN.B.—Besides the Common Oak (Mongolica) and the Tan-bark or Bread-leaf oak (Dentata), at least four other species are known to the Coreans, apparently by the same name, Quercus aliena Bl. and Quercus glandulifera Bl., Quercus serrata Thunb. (chestnut oak) and Quercus variabilis, Thunb. (the Cork-oak of Corea). Q. aliena and Q. glandulifera are sometimes apparently distinguished as 지라리총나무.\n10. **The Broad-leaf Oak** *Quercus dentata* Thunb. (W.)\n\nD.C.F. 檜木 “Arbre de chêne, chêne à feuilles très-grandes et très larges.”\n\nGale. pt. i. 檜木 “The burr-or overcup oak. *Quercus macrocarpa.*”\n\nThe foliage of this tree, which is seldom allowed to grow to any size, is largely cut down in the spring and scattered as a fertilizer over the paddy fields. The bark is used for tanning.\n\nIn Gale pt. ii. the character 檜 is said to be the same as 楸 both pronounced 가, and the meaning is given as “a small shrub” or “Catalpa Bungei,” which does not tally with the description given in pt. i.\n\n---\n\n11. **The Keyaki Tree** *Zelkova serrata* Mak. (W.)\n\nD.C.F. 槐 “Esp: de grand arbre. *Sophora du Japon Orme.* Syn: 피목 Koimok.”\n\nor Gale pt. i. 槐 “The *Sophora Japonica*. See 피목”\n\nUnder 피목 the D.C.F. gives the same character and the same rendering as under 늦희나무: so also does Dr. Gale. There seems however to be no doubt that both dictionaries are wrong, the character 槐 and the title “*Sophora Japonica*” really belonging to the next-tree (12) on our list. In Japan the *Zelkova* (Keyaki) is written with the character 槐. Both in Japan and Chosen the tree is highly prized for cabinet making and other ornamental purposes, on account of its beautiful grain.\n12. **The Sophora Tree.** *Sophora japonica* L. (W.) (1) (2)\n\nD.C.F. for (1) gives 槐花木 “Nom d’une esp. d’arbre dont les fleurs sont blanches”: And for (2) 槐花 “Arbre semblable à l’acacia, avec la fleur du quel on fait une teinture jaune (peut-être le gaiac).”\n\nGale pt. i. for (1) gives 槐 “A variety of the *Sophora japonica.*” And for (2) 槐花 “The blossoms of the *Sophora japonica* from which a yellow dye is made.”\n\nIn pt. ii. he gives both 槐和槐花 as a variety of the *Sophora japonica*, but makes the Korean equivalent 능희 which is the Zelkova.\n\nThe *Sophora* 회화나무 and Zelkova 능희나무 are two of the largest and best known timber trees in central Chosen. It is strange that they should be so confused with one another, as they have hardly anything in common.\n\n13. **The Elm.** *Ulmus japonica* Sarg. (M.)\n\nD.C.F. 榆 “Nom d’un arbre dont l’écorce est employée à faire des cordes, et la séve sert d’enduit, de vernis, pour les murs.”\n\nGale pt. i. 榆 “The elm. *Ulmus campestris*” pt. ii. 榆\n\nThe same.\n\n14. **The Alder** Two species (a) *Alnus japonica* S. & Z. (W.)\n\n(b) *Alnus siberica* Turcz. (W.)\n\nD.C.F. 棟瓜木 “Esp : d’arbre dont le bois est rouge, qui vient le long des ruisseaux; c’est peut-être l’aune ou verne.”\nGale pt. i. 棘瓜木 “A tree with red wood—found along streams.”\n\nThe Alder is commonly used for making Korean 나목 신 or Sabots.\n\n15. THE MAIDENHAIR TREE Ginkgo biloba L. (W.)\n\nD.C.F. 銀杏 “(Argent, abricot). Esp. de grand arbre qui a des fruits dont la graine est blanche. Le Ginko biloba V. Syn. 빅파.”\n\nGale pt. i. 銀杏 “The Salisburia adiantifolia. See 은응” 銀杏樹 “The Maidenhair fern tree. Also 은응나무.”\n\nUnder 빅파 the D.C.F. gives 白果 “Arbre aux quarante écus: Ginko biloba: Salisburia adiantifolia; arbre du ciel”. And Gale pt. i. gives 百葉 “The Gingko biloba.”\n\nThe maidenhair tree is one of the largest and handsomest timber trees in Chosen. There is a good specimen in Dr. Gale’s compound in Seoul.\n\n16. THE PAULOWNIA Paulownia tomentosa Baill. (M.)\n\nD.C.F. 梧桐 “Nom d’une esp. d’arbre dont les feuilles sont très larges. Jatropha curcas. Medicinier curcas. Alisier des bois (?) Platane. V. Syn 머귀나무 Me-kouinamou.”\n\nGale pt. i. 梧桐 “The Sterculia platanifolia”, pt. ii. under 梧 and 桐; “The name of a tree”. A name applied to various trees. (The Paulownia imperialis).\nUnder the D.C.F. gives 檜樹 \"Esp. d'arbre, peut-être le platane: alisier des bois (?) Syn; 오동나무\": while Gale under the same word gives 檜樹 \"The Sterculia platanifolia—on which the phoenix is said to alight on the birth of a sage\".\n\nThe Paulownia is one of the most beautiful shade-trees of Chosen, with very broad leaves and a large mauve-coloured flower. The wood is much prized by Japanese for making their \"geta\" or wooden clogs.\n\nThe Chinese appear to use the characters 檜樹 for the Sterculia platanifolia, which is not the same as the Paulownia.\n\n17. THE PAK TAL TREE Betula Schmidtii Regel. (W)\n\nD.C.F. 檜木 \"Espèce de bois très dur avec lequel on fait des maillets. Espèce d'arbre.\"\n\nGale pt. i. 檜木 \"The Dalbergia hupeana tree; a variety of the Sandalwood\". And so also in pt. ii. under 檜 단.\n\nThe Pak tal tree is famous in the early legends and myths of Korean history.\n\nThe wood of the Pak tal tree is exceedingly hard and heavy—so heavy that it will not float in water. It is much used by Koreans for making the rollers and mallets used in the process of \"ironing\" clothes.\n\nNear Seoul the name Pak Tal appears to be applied to the Cornell Tree, Cornus Kousa. In China the character 檜 is applied to the Dalbergia Hupeana, which is not the same as the Pak Tal.\n18. **The Linden or Lime Tree**\n\n*Tilia mandshurica Rupr. & Maxim* (W)\n\nThis tree, which is not mentioned either in D.C.F. or Gale, is the sacred tree of Corean Buddhists and is found chiefly in Temple grounds. Curiously enough it is not known to the monks ordinarily by the name 보리수 (Porisyou) which is the Corean equivalent of the Bodhi Tree—that name being given to the oleaster (see No. 31),—but by the name 덤주나무 or Rosary Tree, prayer-beads being made out of the fruit. Another species of Lime, *Tilia amurensis*, is known to the Coreans at 피나무.\n\n19. **The Big Ash Tree** *Fraxinus mandshurica Rupr.* (W.)\n\nD.C.F. 楸木 “Nom d’une espèce d’arbre ; esp : de cèdre propre à faire des poutres, des bascules,”\n\nGale pt. i. 楸 “The machilus nanmu—called also the cedar. The Ash.” And in pt. ii under 楸납 “The ‘cedar,’ Machilus nanmu. A camphor tree.”\n\n20. **The Evodia Tree** *Evodia Daniellii Benn.* (W.)\n\nD.C.F. 茶英木 “Nom d’une sorte d’arbre dont la graine sert à faire de l’huile excellente à brûler. Syn. 소동 So-tong.”\n\nGale pt. i. 茶英木 “A species of Zanthoxylum. The *Evodia rutoocarpa*, the seeds of which are used as medicine.” pt. ii the same.\n21. The \"Tree of Heaven.\"\n\n*Ailanthus glandulosa* Desf. (W.)\n\nD.C.F. 檵木 \"Nom d'un arbre. V. Syn. 가죽나무\n\n\"Ailanthe glandulux qui sert à nourrir le 숭나무 lequel produit la soie appelée 충경소.\"\n\nGale: pt. i. 檵 \"The *Ailanthus glandulosa.*\" The same in pt. ii under the character 檵 with the sound 저: but the same character with the sound 화 is given as the equivalent of 벗나무 \"The birch.\"\n\nAn alternative name for this tree appears to be 숭 which is described in D.C.F. as 檵 \"Ailanthe. Syn. 가죽나무\", and in Gale pt. i. as \"The *Ailanthus.*\" Both Dictionaries refer to the 숭나무 as the \"Papillon du 숭\" and \"The *Ailanthus* silkworm\" respectively.\n\nThere appears to be a great deal of confusion between this and the next tree on the list (apparently regarded as 'true' 충 and 'false' 가 varieties of the same tree).\n\n22. The \"Onion Tree.\" (M.)\n\n*Cedrela sinensis* A. Juss. (M.)\n\nD.C.F. (Not given).\n\nGale pt. i. (without character) \"A kind of red oak.\"\n\nBut in pt. ii. three different characters are given under 춘 for the 충축나무, which is described as \"A wood from which guitars are made.\" The three characters are 桐, 檫, 檫.\n\nThe Corean dictionary 字典釋要 under the character 檫 gives two sounds and two explanations (a) 화 meaning 가죽나무, which it describes as the same as 桐 and (b) 저 meaning 못슬나무 (the useless tree) described as \"an evil tree of no use.\"\n\nSee Bretschneider's Botanicon Sinicum pp. 352-3 for a\ndiscussion of these trees as known in China, their original habitat. He gives yet another character 桑, which is described in the above mentioned Corean dictionary as being a fragrant form of the 桑 or ailanthus, and the equivalent of 춤죽나무.\n\n23. The Common Ash.\n\nFraxinus rhyncophylla Hance (W.)\n\nD.C.F. 青鞭木 “Frêne. Arbre dont le bois est dur et dont l’écorce sert à faire la teinture noire.”\n\nGale. 水青木. “The Ash, Fraxinus Chinensis.”\n\n24. The Spiney Elm.\n\nHemiptelea Davidii Benth. & Hook. fil. (W.)\n\nD.C.F. (Not given).\n\nGale pt. i. 樹 “The name of a thorn tree.”\n\n25. The Red Birch\n\nBetula dahurica Fall. (W.)\n\nThis tree which does not appear to be noticed either in D.C.F. or Gale is fairly common on the hill-sides. Its thin outer bark is constantly peeling off, as with birches elsewhere.\n26. **The Kalopanax**\n\n*Kalopanax ricinofolius* Miguel. (W.)\n\nD.C.F. Spelling it 엉나무 \"Esp. d'arbe épineux.\"\n\nGale. pt. i. 漆桐 \"The thorny ash.\"\n\nIn its young state, the stem of this tree is covered with thorns; and the sticks, gathered into bundles are laid along wall-tops, as a protection against trespassers.\n\n27. **The Bamboo.** *Sasa spiculosa* Mak. & Shib. (W.)\n\nD.C.F. 竹 \"Bambou : pipe : tige creuse : tuyau.\"\n\nGale. pt. i. 竹 \"A bamboo. The numerative of stalks, long objects. See 촘대.\" Pt. ii. under 竹죽 \"The bamboo of which there are some sixty varieties.\"\n\nThe only native bamboos in Chosen are a low scrubby species of *Sasa*.\n\n28. **The Willow.** *Salix korcensis* Anders (W.)\n\nD.C.F. 柳木 \"Saule, arbre.\"\n\nGale pt. i. 柳 \"The Willow.\" pt. ii. Under 柳류 \"The Willow tree, *Salix babylonica*.\" Under 楊양 \"The poplar, the willow, the aspen.\"\n\n29. **The Aspen.** *Populus tremula* L. (M.)\n\nD.C.F. 白楊 \"Nom d'une espèce d'arbre (peut-être le tremble).\"\n\nGale. 白楊 \"The white willow.\"\nThe Koreans have the same metaphor as the English \"tremble like an aspen.\" 사시떨닌듯하다.\n\n30. **The Matrimony Vine** *Lycium chinense* Mill. (W.)\n\nD.C.F. 枸杞子 \"Nom d'un arbre; esp. d'épine-vinette; esp. de petit fruit en grappe comme le raisin (remède).\"\n\nGale pt. i. 枸杞子. \"The seeds of a kind of aspen—the *Lycium Chinense*.\" pt. ii. under 枸子 and 枸杞 'A kind of water willow. A medlar tree.'\n\n31. **The Oleaster** *Elaeagnus umbellata* Thunb. (W.)\n\nD.C.F. (No character) \"Petit arbuste à fleurs blanches, baies rouges.\"\n\nGale pt. i. 扶老樹 \"A kind of tree from which walking sticks are made.\"\n\nA shrub with a fragrant white flower and red berries and silvery backs to the leaves. 보리수 is the name given by Korean Buddhists to the Bodhi tree of Buddha, without however apparently any reference to the Oleaster. The sacred tree of the Korean Buddhists is the Linden (see 18).\n\n32. **The Hawthorn.** *Crataegus pinnatifida* Bunge (W.)\n\nD.C.F. 榆 \"Aubépine.\" \"Nom d'un petit fruit dont la forme est semblable à celle d'une poire, mais d'un goût amer. Esp.: de petite poire sauvage.\"\nGale. pt. i. 榆 \"Various species of *pyrus*; the hawthorn.\" Also in pt. ii. under 榆 \"Various species of *pyrus* wild and cultivated.\"\n\n33. **The Nut-gall Tree.** *Rhus javanica* L. (M.)\n\nD.C.F. 五倍子木 \"Espèce d'arbre qui produit le 오비즈 peut-être la noix de galle.\"\n\nGale. (No character) \"The *Rhus semi-alata*.\"\n\nUnder 오비즈 五倍子 D.C.F. gives \"Esp. de noix de galle (qui, dit-on vient sur le mûrier). Esp. de graine d'arbre remplie d'insectes qui servent à faire l'encre noire. Sert en teinture et en médecine.\"\n\nGale gives \"Chinese galls—the nut galls of the tariff, formed on the *Rhus semialata*.\"\n\n34. **The Korean Paper Mulberry.**\n\n*Broussonetia kazinoki* Sieb. (W.)\n\nD.C.F. 楤木 \"Arbrisseau dont les branches, en forme d'osier, sont coupées chaque année pour en avoir l'écorce, qui sert à faire un papier solide. Mûrier à papier.\"\n\nGale. pt. i. 楤木 \"A species of mulberry from which paper is made—*Broussonetia papyrifera*.\"\n\nProf. Wilson says that the *B. kazinoki* is common in Japan and Chosen, and differs from the *B. papyrifera* which is not found in Chosen, except in Quelpaert.\n35. The Varnish or Lacquer Tree.\n\n*Rhus verniciflua* D.C. (W.)\n\nD.C.F. 漆木 \"Esp. d'arbre, d'on se tire le vernis. Sumac (?) Il a une sève très active; son attouche-ment suffit pour faire naître sur la peau des pustules qui causent une grande démangeaison et deviennent une plaie.\"\n\nGale. pt. i. 漆木 \"The varnish tree.\" pt. ii. \"The varnish tree, *Rhus verniciflua*.\"\n\n36. The Evergreen Euonymus.\n\n*Euonymus radicans* Thunb. (W.)\n\nD.C.F. (No character) \"Nom d'une espèce d'arbre.\"\n\nGale. pt. i. (No character) \"Boxwood\"\n\nAn evergreen shrub, as its Chinese name (winter-green-tree) implies.\n\n37. The Corean Benzoin.\n\n*Benzoin obtusilobum* O. Kuntze (W.)\n\nD.C.F. 冬柏 \"Stramonie, *datura stramonium*, herbe du diable, herbe des magiciens. Syn. 桐柏 Tang-kkai.\"\n\nGale. pt. i. 桐柏 \"The Camelia, the *datura stramonium*.\"\n\nAn oil produced from this tree is used for dressing the hair of women and children being sometimes mixed with oil from the seeds of the Evodia (see 20).\n\nN.B.—The identification with *datura stramonium* appears to be wholly inaccurate.\n38. **The Wild Citron.** *Poncirus trifoliata* Swingle (W.)\n\nD.C.F. 枳子 “Sorte d’arbre à grandes épines et qui produit des espèces d’oranges sauvages : petite orange sauvage.”\n\nGale. 枳子 “The sweet orange tree. *Citrus aurantium.*”\n\nA shrub with a smooth light green bark and very sharp thorns, producing small wild oranges, used in Korean medicine.\n\n39. **The Common Privet.** *Ligustrum Ibota* Sieb. (W.)\n\nD.C.F. 鼠尿木 “Arbre de crottes de rat (ainsi appelé à cause de ses graines qui ont la même forme. Il fournit la matière dont en fait la cire blanche : les Coréens ne la tirent pas de la graine même d’un arbre). Troène, vulg : duvet.”\n\nGale. (Same characters) “The privet.”\n\n40. **The Korean Honey-locust Tree.**\n\n*Gleditsia horrida* Mak. (W.)\n\nD.C.F. 朱髯木 “Nom d’un arbre dont les fruits sont comme des cosses de pois, mais plus grands.”\n\nGale. (Same characters) “The Acacia. See 조각목.”\n\nUnder 조각 the D.C.F. gives “Graine d’acacia (en médecine, remède).”\n\nGale gives 豆角 “Black horns—the pods of the *Gleditschia sienensis*.”\n41. The Mulberry.\n\nTwo varieties: (a) Morus alba L. (M.)\n(b) Morus bombycis Koidz. (M.)\n\nD.C.F. 桑木 \"Murier.\"\nGale. pt. i. and pt. ii. 桑木 \"The Mulberry tree.\nmorus alba. See 상목.\"\n\n\"The fruit of the mulberry\" is also known as 오디\nand is so given both in D.C.F. and Gale pt. i. and pt. ii.\nunder 薔 柿.\n\n42. The Pear. Two varieties:\n\n(a) Pyrus serotina, var : cuita Rehd. (W.)\n(b) Pyrus ussuriensis Maxim. (M.)\n\nD.C.F. 梨木 \"Poirier.\"\nGale. pt. i. 梨木 \"A pear tree.\" pt. ii. \"The Chinese\npear: pyrus sinensis.\"\n\nThe P. serotina is the common cultivated pear of\nChosen: but the ussuriensis is also found, both wild and\ncultivated. Another and less common species of pear in\nCorea is the Pyrus Faurei, Schneid (or calleryana). P. us-\nsuriensis is known to Coreans as 동비나무, P. Faurei as\n동비나무.\n\n43. The Peach. Prunus Persica Stokes (W.)\n\nD.C.F. 極 \"Peche (fruit à noyau).\"\nGale. pt. i. 桃 \"A peach.\" pt. ii. \"The peach:\nPrunus persica.\"\n44. **The Apricot.** *Prunus Armeniaca* L. (W.)\n\nD.C.F. 杏木 \"Abricotier.\" \"Esp. de fruit semblable à la peche, peut-être abricot ou prune.\"\n\nGale. pt. i. 杏 \"The apricot : the almond.\" pt. ii. ditto.\n\nThe wild apricot, *Prunus mandshurica* is known as 외살구.\n\n---\n\n45. **The Chinese Date or Jujube.**\n\n*Zizyphus sativa* Schneider (W.)\n\nD.C.F. 大棗 \"Jujube (fruit).\"\n\nGale. pt. i. 大棗 \"Dates.\" pt. ii. \"Several varieties of the common jujube. *Zizyphus vulgaris.*\"\n\n---\n\n46. **The Persimmon.** *Diospyros kaki* L. (W.)\n\nD.C.F. 柿木 \"Sapotillier. Arbre qui produit le kam. (*Lotus Diospyros).*\"\n\nGale. pt. i. 柿 \"A persimmon.\"\n\n---\n\n47. **The Lotus Persimmon Tree.** *Diospyros Lotus* L. (W.)\n\nD.C.F. 假柿木 \"Esp d'arbre qui ressemble au kaki. kaki sauvage.\"\n\nGale. pt. i. 柿 \"Small natural growth persimmons\". Used as a stock on which to graft *Diospyros kaki*, which is the edible persimmon.\n48. The Chestnut. *Castanea crenata* Bl. (W.)\n\nD.C.F. 栗木 \"Chataignier.\"\n\nGale. pt. i. 栗木 \"The Chestnut.\"\n\nIn Pyengyang and neighbourhood it is the Chinese chestnut (*Castanea mollissima* Bl.) which is commonly cultivated.\n\n49. The Common Walnut. *Juglans regia* L. (M.)\n\nD.C.F. 胡桃木 \"Noyer (arbre).\"\n\nGale. pt. i. 胡桃木 \"Walnuts.\"\n\n50. The Hazelnut or Filbert. *Corylus heterophylla* Fisch. (W.)\n\nD.C.F. 榛 \"Noisettier, Avelinier.\"\n\nGale. pt. i. and pt. ii. 榛 \"The hazelnut or filbert tree (*Corylus heterophylla).*\"\n\n[To be Continued].\nAN ACCOUNT OF THE SHIPWRECK OF A DUTCH VESSEL ON THE COAST OF THE ISLE OF QUELPAERT, TOGETHER WITH THE DESCRIPTION OF THE KINGDOM OF COREA.\n\nTranslated out of French.\nFOREWORD.\n\nIt has seemed worth while to the Council of the Korea Branch of the Royal Asiatic Society to reprint verbatim in its Proceedings the old English translation of Hendrik Hamel's Account of the Shipwreck of the Dutch Ship Sparrowhawk on the coast of Corea in the year 1655. And I have been asked to supply a few words of Preface. That Hendrik Hainel and his ship-mates were the first Europeans to \"discover\" Corea is one of the earliest facts that most of us learn, when we begin to take any interest in the country at all. But probably only a few of us have had the opportunity of reading the Dutchman's story right through as he wrote it. Indeed to do this, we should of course have to be able to read Dutch, in which language his narrative was naturally first published. But his book seems to have been popular in Europe in the 17th and 18th centuries, having been translated into French, German and English, and published in its English dress in at least two of the famous old English collections of travels viz, that of Churchill and that of Astley and Pinkerton*. The copy from which the subjoined reprint is taken is obviously extracted from one of these, but, as the title-page is missing, it is impossible to say which. The narrative is here given exactly as it stands in the original text, with all its old-fashioned spelling of the English words and the Dutchman's rather quaint attempts to phoneticize the Corean names—Sior for Seoul, Numma Sansiang for Nam Han San Song. Sehesure for Tjei-ju &c.\n\nThe book, which contains, besides the narrative of the shipwreck and of the thirteen year's subsequent captivity of Hamel and his companions in Corea, a racy description of the country\n\n*It should be noted that \"Hendrik Hamel's Narrative of Captivity and Travels in Corea\", was printed, with modernized spelling and annotations of somewhat uneven value, in a book entitled \"Corea, without and within\" by Willian Elliot Griffis, which was published at Philadelphia by the Presbyterian Board of Education. (1st. Edition. 1884. 2nd Edition 1885.)\nand people, deserves careful study. It throws some interesting sidelights on the history of the \"Coresians\" two and a half centuries ago, then as always between the upper and nether mill-stones of the \"Japoneses\" and the \"Chineses\" to north and south of them. Ignorant as they are of much of the history of their own country, Coreans never forget, and are never likely to forget, two dates which stand out with an awful and bloody prominence in their Annals, the 壬辰倭亂 임진왜란 Im-Jin-Wai-ran or Japanese invasion of 1592 (and following years) and the 丙子胡亂 병조호란 Pyeng-Ja-Ho-Ran, or Tartar invasion of 1636. King 仁祖大王 선조대왕 Syen-jo, in his long reign of over forty years (1568-1609) had had to bear the onslaught of the Japanese under Hideyoshi's generals; and then, after fourteen years (1609-1623) of shameful misrule by Prince 光海君 광희군 Kwang-hai (to whom Coreans have never allowed the posthumous title of King), King 仁祖大王 인조대왕 In-jo (1623-1650), who ascended the throne just as the Ming dynasty in China was tottering to its fall, had to feel the force of the rising power of the Tartars or Manchus. And it was during the reigns of the two next kings, 孝宗火王 효종대왕 Hyo-jong (1650-1659) and 順宗火王 현종대왕 Hyen-jong (1659-1675), when Chosen was trying to adapt itself as gracefully as possible to the new Tartar suzerainty established in Peking, that our Dutchmen were wrecked on Quelpaert and spent their thirteen years of captivity in Corea.\n\nHendrik Hamel was plainly a shrewd observer, and much of his description of the country and the people and their customs tallies well with our own experience of the last thirty years, though one would not care to subscribe to every one of his statements. And there are points, like his circumstantial account of the man-eating \"crocodils,\" to be found in Chosen, which sound rather like a \"traveller's tale,\" though it is possible that such animals may have existed two hundred and fifty years ago and yet be extinct now.\n\nTo those who hail from Great Britain it is of special interest to know that one of the unfortunate mariners who did not\nsucceed in making his escape was \"Alexander Bosquet, a Scotchman.\" One wonders if his tomb or those of any of his mates will ever come to light, as that of Will Adams did in Japan.\n\nHendrik Hamel and his companions were then in all probability the first Europeans to set foot in Chosen, except so far as they were forestalled by their compatriot Jan Wettevree, whom, as their narrative shews, they found in captivity on their arrival in the country. It would be interesting to know who, on the other hand, was the first Corean to visit the West. It is, I think, usually assumed that none did so until the country was \"opened\" in the latter part of the nineteenth century, when not a few Coreans found their way to the United States of America and elsewhere. And it seems worth while to put on record here the fact that a certain Italian named Francesco Carletti, who travelled in the Far East between 1597 and 1606, had probably the honour of introducing the first Corean to Europe. Of him we learn, from an article by Signor Nocentini in the Journal of the China branch of the R.A.S. for 1885, the following facts:\n\n\"When in Macao, Carletti had an opportunity of hearing something of Corea, and he is able to give the names of the provinces. Moreover, when he left the Far East he brought with him to Goa a young Corean whom he there converted to Christianity. This young man was afterwards brought to Rome, where he lived under the name of Antonio Corea.\"\n\nHow one wishes that Antonio Corea had taken the world into his confidence, as Hendrik Hamel did! Anyhow it should be remembered that Catholic Italy shares with Protestant Holland the credit of having taken the first steps in the gradual process of introducing Corea to the \"Sisterhood of nations\"—that \"Sisterhood\" which is, we all hope, going to find so much clearer expression, because resting on so much surer foundations, after the war than before.\n\nMark Napier Trollope\nBishop in Corea\nPresident of the Korea Branch of the R.A.S.\n\n19 February 1918.\nPREFACE.\n\nThis short Relation was first Printed in Holland by the Secretary, as he calls himself, of the Ship that Perish'd, and was one of those that escap'd, and after a long Captivity had the good Fortune to return Home. There is nothing in it that carries the face of a fable, invented by a Traveller to Impose upon the believing World. Yet there are some Men, who will scarce believe anything but what they see, and at the same Time will not stir an Inch from Home to be inform'd. These sort of Creatures, are not to be satisfy'd as to the Credibility of anything beyond their own Capacities. But for those who only seek a reasonable Testimony and Probability to believe things, which in themselves are no way Irrational, it will suffice that when this Account was Printed, the eight Men mention'd at the end of this Journal, were all in Holland and Examin'd by several Persons of Reputation, concerning the particulars here deliver'd, and they all agree in them, which seems to render the Relations sufficiently Authentick. Besides as the FRENCH Translator observes in his Preface, there is nothing here asserted in the Description of COREA, but what agrees with what Palafox, and others that write of the Invasion of the Tartars, have said before. The Account tho' small, is curious; and it may be suppos'd this Secretary, the Author, was a Man of some Learning to be capable of Writing it, and not a meer Seaman, tho', to say the Truth, it is plain, and of matters so obvious, and in so indifferent a Stile that it requir'd no great matter of literature to compose it, but only as much as would raise a Man above downright Ignorance. Thirteen years residence in Corea, was time enough to have given a much more perfect Description,\nand many Men in that time would have made it more ample and satisfactory; but the Author gave what he had, and I suppose his Memoirs were small, and ill digested, having leisure enough, but perhaps little Inclination, to write in that miserable Life, as not knowing whether ever he should obtain his Liberty, to present the World with what he writ.\nAN ACCOUNT OF THE SHIPWRECK OF A DUTCH VESSEL, &c.\n\nWe Sail'd out of the Texel on the 10th of January 1653, in the Evening, with a very fair Gale, and after many Storms, and much foul Weather came to an Anchor on the first of June, in the Road of Batavia. As soon as we had refresh'd ourselves there for a few Days, the Governor General of the India Company, Commanded us away to Tapowan, and accordingly we set Sail on the 14th of the same Month, in our Ship call'd the Sparrowhawk. We carry'd Aboard us Min Heer Cornelius Lesser, to take Possession of the Government of Tapowan, and Formosa, with their dependences in the Place of Min Heer Nicholas Verburgh, who had resided there three Years according to Custom. We had the good fortune to come to an Anchor at Tapowan, on the 16th of July. Min Heer Lessen Immediately landed, and caus'd our Ship to be unloaded. Then having advis'd with the Council, he order'd us to Japan; in pursuance whereof having our Loading and Discharge, we put to Sea again on the 30th of the same Month. The next Day held fair till towards the Evening, when, as we were getting out of the Channel of Formosa, there arose a Storm, which increas'd all Night.\n\nOn the first of August in the Morning early, we perceiv'd a small Island very near us; we us'd our utmost Endeavours to get under shelter of it, and find some Place to cast Anchor, for in most Parts of that Sea there is no Bottom to be found. However we compass'd our design tho' with much difficulty because we were afraid to come near a floating Timber that burnt close by us. Our Pilot fortunately looking out had discover'd that Island, otherwise we had been lost, for we were not above a Musket shot from it. The Fog clearing up, and the Day growing bright, we found ourselves so near the Coast of China,\nthat we could easily discern Arm'd Men scatter'd along the Shore, expecting to make their advantage of our Wreck. But God be prais'd they miss'd of their aim; tho' the Storm increas'd rather than diminish'd. There we continu'd all that Day at an Anchor in sight of them, as also the Night following.\n\nThe next day the Wind falling we observ'd, that the number of the Chineses was much increas'd which made us stand upon our Guard, resolving to remove further from them as soon as possible, but were hindered by a Calm, which lasted all day and the next night. The third day we perceiv'd the Storm had drove us 20 Leagues from our Course, so that we were again in sight of the Island Formosa. We ply'd betwixt that Island and the Continent, the Weather somewhat cold; and what troubled us most, was, that the uncertain Winds and Calms kept us in that Channel till the 11th of that Month, when a South-west Wind grew up into a Storm, with a heavy Rain, and forc'd us to run North-east, and North-east and by East. The three following days the Weather continu'd still more tempestuous, and the Wind shifted so often, that we were continually hoisting and lowering our Sails. By this time the frequent beating of the Sea had much weakened our Vessel, and the continual Rain obstructed our making any Observation; for which reason, we were forced to take in all our Sails, strike the Yards, and commit ourselves to the Mercy of the Waves.\n\nOn the 15th, the Wind blew so boisterously, that we could not hear one another speak, nor durst we let fly an inch of Sail: And to add to our Misfortunes, the Ship took in so much Water, that there was no mastering of it. Besides, the Waves every moment broke in upon us in such manner, that we expected to perish every minute. That night our Boat and the greatest part of our Gallery were carried away, which shook our Boltsprit, and made us fear we should lose our Prow. All possible means were us'd to repair the Damage sustained, and prevent the ill consequences it might produce; but in vain, for the gusts of Wind were too violent, and came too close one upon another, besides the breaking of the Waves which were ready to sink us\nevery moment. At length finding there was no way to save ourselves, but by abandoning the Vessel and the Companies Goods, we resolved to loose a Fore-topsail, the better to avoid the greater Surges. Whilst we were thus employ'd, a Wave coming over our Stern, had like to have wash'd away all the Sea-men that were upon the Deck, and fill'd the ship so full of Water, that the Master cry'd out, My Mates, cut down the Mast by the Board immediately, and recommend your selves to the Mercy of God; for if one or two such Waves return, we are all lost, and all our skill and Labour will not save us. This was our Condition, when the second Glass of the second Watch being just running out, he that look'd out a Head, cry'd, Land, Land; adding, we were not above a Musket-shot from it; the Darkness of the Night and the Rain having obstructed our discovering it sooner. We endeavour'd to Anchor, but in vain, because we found no bottom, and the roughness of the Sea and force of the Wind obstructed. Thus the Anchors having no hold, three successive Waves sprung such a Leak in the Vessel, that those who were in the Hold were drown'd before they could get out. Some of those that were on the Deck leap'd Over-board, and the rest were carried away by the Sea. Fifteen of us got ashore in the same place, for the most part naked, and much hurt, and thought at first none had escap'd but our selves; but climbing the Rocks, we heard the Voices of some Men complaining, yet could see nothing, nor help any body, because of the darkness of the Night.\n\nOn the 16th, all of us that were in a condition to walk, went calling and seeking about the Strand, to see if we could find any more that had got to Land. Some were found scatter'd about, so that we made up 36, most of us dangerously hurt.\n\nThen searching the Wreck, we discover'd a Man betwixt two Planks, which had so press'd his Body, that he liv'd but three hours. It is needless to relate how sensibly we were touch'd at the loss of our Ship, and to see that of 64 Men only 36 were left in a quarter of an Hour. However, we went along the Shore to pay the last Duty to those Bodies the Sea had cast\nup. We found none but our Captain Egbertz of Amsterdam, stretch'd out on the sand, ten or twelve Fathom from the Water, with his Arm under his Head, whom we bury'd. Having scarce taken any Sustenance for two or three days past, because there had been no possibility of dressing any thing we search'd along the Sands, to see whether the Sea had not cast any of our Provisions ashore, but could get only one Sack of Meal, a Cask with some Salt-meat, a little Bacon, and what was best for the Wounded Men, a Hogshead of Claret. Our greatest trouble was, to contrive how to make a Fire; for having neither heard nor seen any living Creature, we concluded we were on a Desert Island. Towards Evening the Wind and Rain somewhat abating, we gather'd enough of the Wreck to contrive some Shelter for us, making use to that purpose, of the remainder of our Sails.\n\nOn the 17th, as we were lamenting our deplorable Condition sometimes complaining that we saw no body, and sometimes flattering ourselves with the hopes of being near Japan, where we might find somebody that would put us in the way to get to the Dutch Factory, our Ship being in no condition to be refitted; we spy'd a Man about a Cannonshot from us. We called and made Signs to him; but as soon as ever he saw us, he fled. Soon after Noon we spy'd three more, one of them with a Musket, and his Companions with Bows and Arrows. Being come within Gun-shot of us, they halted; and perceiving we made towards them, ran away, tho' we endeavour'd by Signs to show them we desir'd nothing but Fire of them. At last one of us resolv'd to attack them; but they deliver'd up their Arms without making any opposition, wherewith we lighted the Fire we wanted. These Men were clad after the Chinese Fashion, excepting only their Hats, which were made of Horse-hair, and we were much afraid lest they should be wild Chineses or Pirates. Towards Evening there came an hundred Arm'd Men, clad like the others, who after counting of us, kept us inclos'd all the Night.\n\nOn the 18th, we spent all the Morning in enlarging our Tent; and about noon, there came down about 2000 Men,\nHorse and Foot, who drew up in order of Battel before our Hut. Our Secretary, the chief Pilot and his Mate, with a Body, went out to meet them. When they came before the Commander, he order’d a great Iron Chain to be put about the Neck of each of them, with a little Bell, such as the Belweather wears in Holland. In that condition they forc’d them to fall down, and prostrate themselves before that Commander; all his Men at the same time raising such a shout, that we who were in our Hut, cry’d out, We are lost, and must prepare to be us’d after the same manner, which was immediately put in execution.\n\nWhen we had lain sometime flat on our faces, they made signs to us to kneel. Being in this posture, they put some Questions to us which we did not understand, and we on our side did all we could to let them know; that we intended to have gone to Nagasaki in Japan. They were as far from understanding us as if they had never known Japan; for they call that Country Jeenare, or Jirpon. The Commander perceiving, he could make nothing of all we said, caus’d a Cup of Arac to be fill’d to every one of us, and sent us back to our Tent. They that conducted us, to see what Provisions we had, found only a little Bacon and Salt-Meat, which they shew’d to their Chief. An hour after, they brought us Rice boil’d in Water, and believing we were almost starv’d, would not give us much, for fear it should hurt us. After Dinner they came with Ropes in their hands, which very much surpriz’d us, imagining they intended to strangle us; but our Fear vanish’d when we saw them run altogether towards the Wreck, to draw ashore what might be of use to them. At night they gave us more Rice to eat; and our Master having made an Observation, found we were in the Island of Quelpaert, which is in 33 degrees 32 Minutes of Latitude.\n\nThese People were employ’d all the 19th in getting ashore the sad Remains of our Wreck, drying the Cloths, and burning the Wood to get the Iron, being very fond of that Metal. Beginning now to grow somewhat familiar, we went up to the Commander of the Forces, and the Admiral of the Island, who was\nalso come down, and presented each of them with a Prospective Glas, and a Pot of Red Wine, with our Captain. Silver Cup, which we found among the Rocks. They lik'd the Liquor so well, that they drank till they were very merry. They returned us the Silver Cup, with many Tokens of Friendship, and we retir'd to our Tent.\n\nOn the 20th, they made an end of burning all the Wood of the Ship, and saving the Iron; during which time, a pleasant Accident happened. The Fire they made coming to two pieces of Canon which were loaded with Ball, they gave so great a Report, that they all fled, and durst not return a long while, or go near the Vessel, till we had assur'd them by Signs, they needed not to fear the like would happen any more. This day they brought us twice to eat.\n\nOn the 21st in the Morning, the Commander gave us to understand by Signs, that we must bring before him all that we had saved in our Tent, that it might be seal'd; which was done in our Presence. Whilst this was doing, some persons were brought before him, who had converted to their own use some Iron, Hides, and other things sav'd out of our Wreck, which they had still in their Possession. They were immediately punish'd before our faces, to show us their design was not to wrong us of any of our Goods. Each of those Thieves had thirty or forty Strokes given him on the Soles of his Feet, with a Cudgel as thick as a Man's Arm, and as tall as a Man. This Punishment is so severe, that some of their Toes dropt off. About Noon they made Signs to give us to understand, we must depart. Those that were well had Horses provided for them, and the Sick were carry'd in Hamacks. Thus we set forward, attended by a numerous Guard of Horse and Foot; and travelling four Leagues, came at night to a little Town call'd Tadiane; where after a slender repast, they carry'd us into a Warehouse much like a Stable.\n\nThe 22nd in the Morning, at break of day, we set out in the same order, and travell'd to a little Fort, near which there were two Galiots. Here we halted to dine, and at night came\nto the Town of Morgan, or Mocxo, where the Governor of the Island resides. We were all conducted to the Square before the Town-house, where about 3000 Men were at their Arms, some of whom coming forwards, gave us Water to drink in Dishes; but they being arm'd after a dreadful manner, we thought they design'd to rid themselves of us. Their very Habit increas'd our Fear, for it had somewhat frightful, which is not seen in China, or Japan. Our Secretary, attended by the same Persons with whom he appear'd the first time before the Commander of the Troops, was carry'd to the Governor. When they had lain a while prostrate on the ground, a Sign was made to us to do the same, after we had been brought near a sort of Balcony which was before the House, where he sate like a King. The first thing he caus'd to be ask'd of us by Signs, was, whence we came, and whither we were bound. We answered as before. That we were Hollanders, and were bound for Nangasaky in Japan; whereupon he gave us to understand, by bowing his Head a little, that he understood something of what we said. Then he order'd us to pass before him by four and four at a time; and having put the same question to us all, and receiv'd the same Answer; he order'd us to be carry'd to the same House where the King's Unkle, who had attempted to usurp the Throne, had been confin'd, and dy'd. As soon as we were in, the House was beset with Arm'd Men, and we had a daily Allowance of 12 Ounces of Rice a Man, and the same quantity of wheaten Meal; but very little besides, and so ill dress'd that we could not eat it. Thus our common Meals, were for the most part only Rice, Meal, and Salt, and we had nothing to drink but Water. The Governor seem'd to us to be a very understanding Man; and we often found afterwards, that we had not been deceiv'd in our Opinion. He was then three-score and ten years of Age, had been born in the Capital City of the Kingdom, and was in good Esteem at Court. When he dismiss'd us, he made Signs, that he would write to the King to know what he was to do with us. It would be a considerable time before his Answer could come, because the distance was\nfourscore Leagues, whereof all but ten Leagues by Land, and therefore we begg’d of him to order we should have Flesh sometimes, and something else to eat. We also obtain’d leave of him for six of us to go abroad every day by turns, to take the Air, and wash our Linnen. Which was granted, to our great satisfaction; for it was very heavy to be shut up and live on Bread and Water. He also did us the Honour to send for us often, and to make us write something before him, both in his Tongue and in our own. There we first began to understand some words of that language; and discoursing with us sometimes, and being pleas’d to divert us with some little Amusements, we began to conceive some hopes of getting over one day to Japan. He also took such care of our Sick, that we may affirm we were better treated by that Idolater, than we should have been among Christians.\n\nOn the 29th of October, our Secretary, the Master, and Surgeon’s Mate, were carry’d before the Governour, where they found a Man sitting, who had a great red Beard. The Governour ask’d us, Who we took that Man to be? And having told him, We suppos’d him to be a Dutch-man; he fell a laughing and said, We were mistaken, for he was a Corsesian. After some Discourse had pass’d between us, that Man, who till then had been silent, ask’d us in Dutch, Who we were, and of what Country? To which we answer’d, That we were Dutch-men, come from Amsterdam in the Service of the Company, and being bound by their Command for Japan, a Storm had thrown us upon that Island. That our Vessel being stav’d, we begg’d earnestly of God, that we might be sent on our way. Then we took the boldness to ask his Name, and what Countryman he was: To which he reply’d, That his Name was John Wettevree, born at Riip in Holland, whence he came as a Voluntier in the Year 1626, aboard the Ship call’d the Hollandia, and that going to Japan in the Year 1627, aboard the Frigat call’d the Ouderkerees, the Wind drove them on the Coast of Corea. That wanting Water, and being one of those that were commanded ashore to get Provisions, he and two more had been\ntaken by the Inhabitants. That his Companions had been kill'd 17 or 18 Years since in the Wars, when the Tartars invaded Corea. That one of them born in the same Town with him, was Theodoric Gerards, the other John Pieters of Amsterdam. Asking him further, Where he liv'd then, and what Accident had brought him into that Island? He told us, That his Abode was in the Capital City of the Kingdom of Corea, whence the King had sent him, to know what we were, and what brought us into his Dominions. He added, that during his long Residence in Corea, he had often ask'd leave of the King to go over to Japan, without ever obtaining any other Answer, than that he must never expect it, unless he had Wings, and could fly thither. That the Custom of the country was to detain all Strangers that came thither, but that they wanted for nothing, being provided with Diet and Cloaths as long as they liv'd. Thus all the comfort he could give us, was, that we should be treated as he had been, if we were carry'd to the King. The joy of finding so good an Interpreter dispell'd our Melancholy, and made us forget all our Misfortunes. It was very surprising, and even wonderful, that a Man of 58 Years of Age, as he then was, should so forget his Mother-tongue, that we had much to do at first to understand him; but it must be observ'd he recover'd it again in a month. The Governour having caus'd all our Depositions to be taken in Form, sent them to Court, and bid us be of good cheer, for we should have an Answer in a short time. In the mean while, he daily bestow'd new Favours on us, insomuch that he gave leave to Wicttevree and the Officers that came with him to see us at all times, and acquaint him with our Wants.\n\nAbout the beginning of December, a new Governor came, our Benefactor's three Years being expir'd. We were much concern'd at it, as not doubting but that change might be Prejudicial to us. It would be a hard task to express how much Kindness and Affection he show'd us at his departure, insomuch, that seeing us ill proviced against Winter, he caus'd two pair of Shoes, a Coat well lin'd, and a pair of stockings of\nSkins, to be made for every one of us. Besides he treated us nobly, and assur'd us he was sorry it had not been in his Power to send us over to Japan, or to carry us over with him to the Continent. He further added, that we ought not to be troubled at his going away, because being at Court, he would use all his endeavours to obtain our Liberty, or to have us carry'd thither. He restor'd us the Books we had saved, with some other parcels of Goods, giving us at the same time a Bottle of precious oyl, which might be of use to us, for the time to come. The first thing the new Governor did, was to reduce our allowance to Rice, Salt, and Water. We complain'd to the old Governor, who was detain'd in the Island by contrary Winds, but he sent us this Answer, That his Time being expir'd, it was not lawful for him any longer to hear our Complaints; but that he would write to his Successor, and as long as he was in the Island, tho' sparingly, we were allow'd as much as might stop our Complaints.\n\nAfter that good Lord's Departure, which was in the beginning of January 1654, we were much worse us'd than we had been before, for they gave us Barley instead of Rice, and Barley Meal instead of Wheat. Thus if we had a mind to eat other Food, we must sell our Barley, and live upon the 12 Ounces of Meal. This hard usage forc'd us to think of making better use of our Liberty of going abroad by six and six at a time, than we had done before. We were invited by the approaching Spring to make our escape, and the more, because the King's Orders did not come; and we were in danger of ending our Days in that Island in Captivity. Therefore, after long consulting together, how we might seize upon a Boat in a dark night; at length six of us resolv'd to execute this Design about the end of April: But one of the Gang being got stop of the Wall, to discover the Vessel we were to seize, he was unfortunately discover'd by some dogs, whose importune Barking made the Guards more watchful, and us lose an excellent opportunity of making our escape.\n\nAbout the beginning of May, our Master going abroad with five others, three of whom are still living, as he was walk-\ning, observ'd that at a little Hamlet near the City, there was a Barque well appointed without any Body to guard it. He presently sent one of his Company to get a little Boat and some short Planks. Then making every one of his Men drink a Draught of Water, he went aboard without taking care for any more. Whilst they were labouring to draw the Barque over a little Shoal that was by it, some of the Inhabitants discover'd their Design, and one of them running out with a Musket, went into the Water to oblige them to return; yet that did not hinder their getting out, except one, who not being able to get up to the others, was forc'd to go back to Land. The other five going to hoist Sail, both the Mast and Sail fell into the Water. They soon got them up, and setting every Thing right with much Labour, as they endeavour'd a second time to hoist Sail, the end of the Mast broke off short, and could not possibly be mended. All these delays gave the Natives time to get into another Barque, and soon overtook them, our Men, having nothing to help them away. As soon as they came together, our Men nimbly boarded them, hoping to make themselves Master of the Vessel notwithstanding their Enemies Weapons, but finding this Barque was full of Water and unfit for Service, they all submitted. Being brought a Shore they were carry'd before the Governour, who caus'd their Hands to be made fast to a great Log, with a strong Chain, and having laid them flat on the Ground, and brought all us before them well bound and manacled; they were ask'd whether they had done that Action without our knowledge, or whether we had been made privy to it; and they all positively asserting we know nothing of it, Wettevree before-mention'd, was set to examine what their Design was, and they answering it was no other but go to Japan. How durst you, said the Governor, attempt that Passage without Bread and Water? They answer'd, they had chose rather to expose themselves once for all to the Danger of Death than to dye every moment. We were immediately unbound, but the six unfortunate Wretches had every one 25 Strokes on the bare Buttocks with a Cudgel a Fathom long,\nfour Fingers broad, and an inch thick, being flat on the side that strikes, and round on the other. These Strokes were so unmercifully laid on, that they who receiv'd them were forc'd to keep their Beds a Month, and we were all of us depriv'd of our Liberty, and strictly Guarded Day and Night.\n\nAbout the latter end of May orders came to carry us to Court, at which we knew not whether we ought to Rejoyce, or be Troubled. Six or Seven Days after they put us into four Boats with Fetters on our Feet, and one Hand made fast to a Block, to prevent our leaping into the Water, which otherwise might easily have done, all the Souldiers being Seasick. After two Days struggling with contrary Winds, we were put back, and our Irons taken off; we return'd to our former Prison in the Island of Quelpaert. This Island which the Natives call Seheshure, lies 12 or 13 Leagues South of the Coast of Corea, and is about 14 or 15 Leagues in Compass. On the North side of it is a Bay, where several Barques lyce, and whence they sail for the Continent, which is of very dangerous Access to those that are unacquainted with it, because of several hidden Rocks, and that there is but one place where Ships can Anchor and Ride under shelter, for in all other places they are often drove over to the Coast of Japan. The Island is all encompass'd with Rocks, but abounds in Horses and Cattle, which pay great Duties to the King; so that notwithstanding their Breeds of Horses and Herds of Cattle, the Islanders are very Poor, and despis'd by the Inhabitants of the Continent. In this Island there is a Mountain of a vast Height, all cover'd with Woods and several small Hills which are naked, and enclose many Vales abounding in Rice.\n\nFour or five Days after, the Wind came about, and we were Ship'd again betimes in the Morning with the same Precaution as before. Towards Night we drew very near the Continent, and having lain all Night in the Road landed the next Morning, where our Chains were taken off, but our Guards doubled.\nIn the Morning we had Horses brought to carry us to the City Heynam, and having been separated at Sea and landed in several places we were very glad to meet altogether again at that Town. The next Morning having taken a very slender repast, we came to the Town of Jeham, where Paul John Cools of Piernercude, our Gunner dy'd, having never enjoy'd his health since our Shipwreck. Next Day the Governor of the Town caus'd him to be bury'd and we mounting a Horseback came at Night to the City Nadiao. The Day following we lay at San-Sian, thence to Tongap, after crossing a high Mountain, on the top whereof is the Fort Ilpam-Sansiang, which is very spacious. Thence we went to the City Teyn, and the next Day we baited at the little Town of Knivige, and at Night came to the great Town of Chintio, where the King formerly kept his Court, and where now the Governor of the Province of Thilado resides. It is a city of great Trade and very famous in that Country, tho' a Day's journey from the Sea. Going thence we lay at Jensan, the last Town of the Province of Thilado; then at the little Town of Gunun, next at Jensan, and lastly at Consio, the Residence of the Governor of the Province of Tiongsiando. Next Day we cross'd a great River and entered upon the Province of Sengado, in which Sior the Capital of the Kingdom is seated. After lying many Days in several Places, we cross'd a River as wide as the Maese is at Dordrecht, league from whence is the City of Sior, where the King keeps his Court. We reckoned 75 Leagues we had travell'd from our Landing to this City, all the way Northward, only a little inclining to the West. Being come to this Town they put us altogether into a House, where they left us two or three Days, after which time they put us into little Huts, three and three, or four and four, with Chinese that are settled there. Then they carry'd us all in a Body before the King, who examin'd us to all Points by the help of Wettevree. Having answer'd him the best we could, we humbly beseech'd his Majesty, that since we had lost our Ship in the Storm, he would be pleas'd to send us over to Japan, that with the assistance of the Dutch there, we might one Day\nreturn to our Country, to enjoy the Company of our Wives, Children and Friends. The King told us it was not the Custom of Corea to suffer Strangers to depart the Kingdom; that we must resolve to end our Days in his Dominions, and he would provide us with all Necessaries. Then he order'd us to do such things before him as were best skill'd in, as Singing, Dancing and Leaping after our Manner. Next he caus'd us to have Meat given us, which was well enough after their manner, and gave each of us two Pieces of Cloth to cloath us after their Fashion. The next day we were all sent before the General of the Forces, who order'd Wettevree to tell us, that the King had put us into his Life-Guards, and that as such they would allow us 70 Cattys of Rice a Month. Every one of us had a Paper given him, in which was set down him, his Age, his Country, what Profession he had follow'd before, and what he now was, all in their Character; Seal'd with the King's great Seal, and the General's which is nothing but the Print of a hot Iron. Together with this Commission they deliver'd to each a Musket, Powder and Ball, with Orders to give a Volley before the General every first and fourth Day of the Month; to be always ready to march into the Field with him, whither the King went, or upon any other Account. In Spring and Autumn that General reviews his Troops three times a Month, and besides the Souldiers Exercise as often in private. A Chinese and Wettevree were appointed to Command us, the former as Sergeant, and the other to have an Eye over us, and to teach us the Customs and Manner of Behaviour of the Coresians. Most of the great Men being fond of Novelty, invited us to Dine at their Houses, to see us Exercise after our Manner, and to make us Shoot and Dance. But above all, their Wives and Children were eager to see us, because the meaner sort of the Island of Quelpaert had spread abroad a Report that we were Monstrous, and that when we Drank we were forc'd for to tuck up our Nose behind our Ear. These absurd Tales were the cause that the better sort of People at Sior were amaz'd to see us better shap'd than the People of their own\nCountry. Above all they admir'd the Fairness of our Complexion, and did so throng to see us, that at first we had much ado to break through the Crowd in the Streets, and we could not be quiet at home, their Curiosity was so great. At length the General put a stop to this, forbidding all Persons whatsoever to come near us without his Leave, and the more because the very Slaves of great Men took the Boldness to come and fetch us out of our Chambers, to make a Jest at, and divert themselves with us.\n\nIn August the Tartar came to demand the usual Tribute, whereupon the King was forc'd to send us to a great Fort, to be kept there as long as the Enassador was in the Country. This Fort is about six or seven Leagues from Siow, on a Mountain they call Numma Sansiang. It is three Hours work to get up to it, and is so strong, that the King retires to it in time of War, and most of the Great Men of the Kingdom live there. It is always provided for three Years, and for a great Number of People. There we continu'd till the beginning of September, when the Tartar went away. About the end of November, the Cold was so vehement, that the River, which is a League from the Capital City, as was said before, was Froze, and 300 Horses loaded pass'd over it. The General taking Compassion to see the Cold we endured gave the King an Account of it, who order'd some Hides we had sav'd from our Shipwreck to be distributed among us, which were most of them rotten, allowing us to sell them and buy something to cloath us warm. Two or Three resolv'd with the money they got by these Hides, to purchase to themselves a little Hut, choosing rather to endure Cold, than to be eternally tormented by their Landlords, who were continually sending of us to the Mountains, two or three Leagues distant, to fetch Wood. This Labour was intollerable, both by reason of the Cold, and because the Ways are bad and uneasy. The little Hovel they bought, cost them nine or ten Crown, and the rest having cloath'd themselves the best they could, were forc'd to pass the remainder of the Winter as they had done before.\nThe Tartar returning in March 1655 we were forbid, as before, under severe Penalties, going out of our Houses. The Day he set forward to return Home, Henry Jans of Amsterdam, our Master; and Henry John Bos, of Haarlem a Gunner, resolved to go meet this Embassador on the way, upon pretence of going for Wood. When they saw him appear at the Head of several Bodies of Horse and Foot, that attended him, they laid hold of his Horses Reins with one Hand, and with the other turning aside their Corsian Habit, show'd him they were clad after the Dutch manner underneath. This at first caus'd a great Confusion among the Multitude, and the Tartar ask'd them earnestly who they were, but they could never make him understand them. However the Embassador order'd them to follow, and be where he was to lye that Night. Being come thither he made much inquiry whether there was no Body that could understand what they said to him, and having been told of Wettervce, he sent for him to come to him with all speed. That Interpreter having advertised the King, a Council was held, where it was resolv'd to make the Embassador a Present, to the end he should so stifle the matter, that it might not come to the Chams Ear. Our two poor Wretches were brought back to Sior, and put into a Prison, where they soon after Dy'd, but we could never know whether a violent, or a natural Death, none of us having been ever allow'd to see them. As soon as this Business was noised abroad, we were carry'd before the Council of War, where it was ask'd Whether we had any Intimation of our Companions Design? And tho' we could truly assert we had not, yet that would not save us from being adjudg'd to have every one.50 Strokes on the Buttocks, for not having given notice of our Companions going out. We had certainly receiv'd that Correction, had not the King remitted it, saying we were poor Wretches, cast into his Country by Storms, rather than any Design of Plundering. All the Penalty he laid on us, was sending us Home again, with an Injunction not to stir Abroad without his Orders.\n\nIn June, when it was thought the Tartar was to come, the\nGeneral sent our Interpreter to acquaint us, that a Vessel was run ground on the Island of Quelpaert, and that Wettevree being too old to perform that Journey, those three among us, who best understood the Corelian Language, must prepare to set out. In pursuance of this Order, the Assistant, the Pilot's Mate, and a Gunner were chosen, who set out two Days after to bring an Account of that Shipwreck.\n\nThe Tartar coming in August, we were commanded under Pain of severe Punishment not to stir out of our Quarters, till three Days after he was gone. The Day before he came we receiv'd Letters from our Companions by an Express, in which they gave us an Account, that they were confin'd on the Southernmost Borders of the Kingdom, where they were strictly guarded, to the end that if the Great Cham had received any Intelligence concerning the two unhappy Fellows that were Dead, and should demand the rest, they might tell him they were all three cast away going over to the Island Quelpaert. The Tartar came again about the latter end of the Year, and we were by the King's Order strictly confin'd to our Houses, as we had been before.\n\nTho' the Tartar had sent twice into Corea, since the attempt unfortunately made by our two Companions, without making any mention of it; yet most of the great men us'd all their Endeavours with the King to destroy us. The Council sat three Days upon this Affair; but the King, his Brother, the General, and some others were not altogether of that Opinion. The General was for making each of us Fight two Corelians, all with the same Weapons, pretending that so the King would be rid of us, and none would have it to say that the King had Murdered poor Strangers. Some more charitable Persons, who knew we were kept shut up, and ignorant of what was doing, gave us this Intelligence privately. Hereupon Wettevree told us that if we liv'd three Days, we should in all likelyhood live long enough after. Now the King's Brother, who was President of the Council, passing by our Quarters, as he was going to it, and very near to us, we had the Opportunity to cast\nour selves at his Feet, and implore his Favour, lying with our Faces prostrate on the Ground. This Sight mov’d so much Compassion in him, that for the future he Solicited our Affair so earnestly, that we owe our Lives only to the King and him. This giving Offence to many Persons, who might attempt other Methods to destroy us, for the preventing their wicked Designs, and to avoid our appearing before the Tartars, it was thought fit to banish us into the Province of Thillaado, where we were to be allow’d 50 pounds of Rice a month, at the King’s cost. Accordingly, we departed from Sior in March, on Horses provided for us, our Acquaintance bearing us company as far as the River, which is a League from the City. There we took our last leave of Wettevree; for from that day to this, we have never seen nor heard talk of him. We pass’d through all the same Towns we had seen in our way to the Court, and coming to lye at Jeam, we set out the next morning, and about noon arriv’d at a great Town called Diusiong, or Thilla-Pening, commanded by a large Cittadel opposite to it. The Penigse, who is chief in the absence of the Governor, resides there, and has the Title of Colonel of the Province. To him the Sergeant that had the charge of us, deliver’d us with the King’s Letters. He was immediately sent away to go fetch our three Companions that had been sent away the Year before, who were 12 Leagues off, where the Vice-Admiral commanded. We were all lodg’d together in a Public house, and three days after, those that were absent being brought to us, we were again together 33 of us, the miserable Remains of our Shipwreck.\n\nIn April they brought us some Hides that had been left behind at Quelpaerl, from which place we were but 18 Leagues, they not being worth sending to Sior. We fitted our selves the best we could, and laid up some small Provisions in our new Habitation. The only business we were charg’d with, was to pull up the Grass that grew in the Square before the Castle twice a Month, and to keep it clean.\n\nThis Year 1657, our Governor being accus’d of some Mis-demeanours, was forc’d to go to Court to clear himself, where\nit is reported he was in danger of his Life. But being well belov'd by the People, and favour'd by the great Ones on account of his Family, which was one of the noblest in the Kingdom, he came off so well, that his Honours were increas'd. He was very good to us, as well as to the Natives. In February came a Governor very unlike the other; for besides that, he found us more work, he would oblige us to go three Leagues off to the Mountain to fetch Wood, which his Predecessor had caus'd to be brought home to us gratis. But God be prais'd, an Apoplexy deliver'd us from him in September following, which no body was sorry for, so little was he lik'd.\n\nIn November came a new Governor, who took so litt'le care of us, that when we ask'd him for Cloaths, or any things else, he answered, the King had given him no Orders as to that point, that he was only oblig'd to furnish our Allowance of Rice, and for other Wants it was our business to provide as we thought fit. Our Cloaths being now worn out with carrying of Wood, and the Cold beginning to pinch us, we resolv'd to cast off Shame among those People and to beg, making our Advantage of their Curiosity, which led them to ask us a thousand Questions. Accordingly, that we might get something to cloath us, and not be forc'd to run half a League for a handful of Salt, we presented a Petition to the Governor for his leave to beg, representing that we could not possibly get our Living any longer by carrying Wood, because we were naked, and our Labour would yield us nothing but a little Salt and Rice; Therefore we humbly pray'd he would permit us to go abroad in our turns. He granted it; and we made such good use of this Favour, that in a short time we were provided against the Cold.\n\nAt the beginning of the Year 1858, the Governor was call'd away, and his Successor afflicted us with new Crosses. He forbid us going abroad, and told us, that if we would work for him, he would give each of us three pieces of Cotton-cloth. After having long consider'd upon his Offers, which would not set us above other Wants, especially in a scarce Year as that was, and knowing we should wear out more Cloaths in his\nService than he would give us, we with all imaginable respect represented to him, that he ought not to require that of us; after which an Accident hapned, which oblig’d him to consent to our Demands. Those People are so much afraid of a Fever, that the only thoughts of it terrifies them, and some of us being then under that Disease, he consented that we were not absent above a Fortnight or three weeks, and that we neither went towards the Court, nor Japan. The other half of us that remain’d at home, he order’d should look to the Sick, and take care to pull up the Grass in the Square.\n\nIn April this Year, the King dy’d, and his son succeeded him with the consent of the Great Cham. However, we went on in our Trade, and particularly among their Religious Men, who are very charitable and grateful, for the pleasure we did them in giving an account of our Adventures, and shewing them the Customs of other Countries. They were so much pleas’d to hear us, that they could have spent Days and Nights in our Company.\n\nThe next Governour that came, in the Year 1660, was so kind to us, that he often declar’d if it were in his Power, he would send us back into our Country, or at least to some place where there were Country-men of ours. He granted us a confirmation of the liberty of going Abroad without any restraint. This Year happen’d such a Drought, that all sorts of Provisions were very scarce. The following Year 1661, was yet more miserable, abundance of People were famish’d to Death, and the Roads were full of Robbers. The King vigorously pursu’d them, and by that means prevented many Robberies and Murthers. He also order’d the dead Bodies found in the Fields, to be buryed. Acorns, Pine-Apple, and other Wild Fruit, were all the support of the People, and the Famine was so great, that Villages were plunder’d, and some of the King’s Stores broke open, and none punish’d for it, because those Disorders were committed by the Slaves of great men, and this Calamity lasted all the Year 1662. The next Year 1663, felt some share of it; for either the Poor had not sow’d, or else they had no Crop;\nhowever, that was remedy'd by the plentiful Harvest in other places that were water'd by Rivers, or lay near Bogs, otherwise the Country had been utterly destroyed. The place where we were being no longer able to furnish us, the Governour writ about it to the Intendant of the Province, who answer'd, That the King having appointed our Subsistence to be furnish'd there, he could not remove us to another place without an Order from his Majesty. About the end of February, the Governour pursuant to the Orders he had received from Court, dispers'd us into three Towns, 12 he sent to Sayssiano, 5 to Siunschien, and as many to Nanuman, for we were but 22 at this time. This parting was very grievous to us, it being a great satisfaction to be altogether in a place, where we were at our ease, and had good Provisions, whereas it was to be fear'd they might send us to some place that still labour'd under the hardships of Famine. This our Sorrow was turn'd into Joy, for this Alteration was the occasion of our getting away, as will appear in the sequel. About the beginning of March, after taking leave of our Governour, and returning him abundance of thanks for his Favours, we set out from thence afoot, carrying the Sick and what Baggage we had, on the Horses allow'd us. Those that were going to Sayssiano, and to Siunschien, went the same Road with us, and we lay all in the same Town the first and second night. The third day, we came to Siunschien, where we left five of our Companions. The next night we lay in a Country-house, and setting out very early in the morning, came about nine to Sayssiano, where those that conducted us deliver'd us to the Governour, or Admiral of the Province of Thallado, who resides there. He presently order'd us Lodging, and such Furniture as was necessary, and the same allowance we had enjoy'd till then. This seem'd to us to be a very good worthy Lord. Two days after our coming, he went away to Court, and three days after his departure, came another to succeed him, who prov'd our Scourge; for he would not suffer us to be far from him, and left us expos'd to all hardships of the Summer and Winter. The greatest Favour he\ngranted us, was leave to go cut Wood fit to make Arrows for his Men, whose only Employment is continually shooting with the Bow. The great Men striving who shall keep the ablest Archers. He put many more hardships upon us, but God gave us our Revenge. Winter drawing on, and the Town we were in not having furnish'd us with necessaries against the Cold, we represented to the Governour in what a good condition our Companions were in the other Towns, and humbly pray'd he would vouchsafe to permit us to go seek out for something to defend us against the Cold. He gave us leave to be absent three days, upon condition the one half of us should remain with him, whilst the other half was abroad. This Liberty was very beneficial to us, because the Great Men, who had compassion on us, favour'd our Sallies, and we were sometimes allow'd to be a month abroad. Whatsoever we got, was brought and put in common with those that remain'd in the City. This continu'd till the Governour's Departure, who was sent for by the King to come to Court. At his Arrival there, he declar'd him General of his Army, an Employment always possess'd by the second Man in the Kingdom. His successor eas'd us all the burdens that had been impos'd on us, and order'd we should be as well treated as our Companions were in the other Towns. Thus we were only oblig'd to pass muster twice a month, to keep our House in our turns, and to ask leave when we would go abroad, or at least to give the Secretary notice, that if occasion were, they might know where to find us. We gave God thanks for Having deliver'd us from such a wicked Man, and sending such a good one. This Man, besides the Favours already mention'd, often treated us, and civilly condoling our misfortune, ask'd Why, being so near the Sea as we were, we did not attempt to pass over that small Sea which parted us from Japan? We answer'd We durst not venture upon such a thing contrary to the King's Will; and besides, we know not the way, and had no Vessel. To this he reply'd, There were Barques enough along the Sea-coast. We rejoin'd, That did not belong to us, and that if we miss'd our aim, we should be\npunish'd as Thieves and Deserters. The Governour laugh'd at our Scruple, not imagining we talk'd after that manner only to prevent their being jealous of us, and that all our Thoughts day and night, were employ'd in contriving how to seize a Barque, and that our Enemies had obstructed our buying one till that time. Now we receiv'd the News that our late Governour had not enjoy'd his new Honour above six months, before he was summon'd to answer before the King for his Misdemeanours. He was accus'd of having put to Death several Persons, as well Nobles as Commoners, on very slight occasions. He was condemn'd to receive fourscore and ten Strokes of a Cudgel on his Shinbones, and to be banish'd for ever.\n\nAbout the latter end of the Year a Blazing-star appear'd and after that two at once; the first was seen in the South-East for about two months, the other in the South-West, but their Tails were opposite against one another. The Court was so much alarm'd at it, that the King caus'd all the Guards to be doubl'd in all his Ports, and aboard his Ships. He also caus'd Provisions to be carry'd into his strong Holds, and Store of Ammunition. He made all his Forces, both Horse and Foot, exercise every day, and expected nothing less than an Invasion from some of his Neighbours, insomuch that he forbid making any Fire at night in those Houses that might be seen from the Sea. The Common fort spent all they had, keeping only as much as would serve them poorly to subsist with Rice, because they had seen the same Signs in the Heavens when the Tartars came to over-run their Country. They also remembered, that some such thing had appear'd, before the Japaneses declar'd War against them. Wherever we were ask'ed us, What we judg'd were the consequences of Comets in our Country. We told them, It denoted some signal judgment of God to follow, and generally the Plague, War, or Famine, and sometimes all three. Having had Experience of it, they agreed with our Opinion. We liv'd this and the ensuing Year 1665, enough at our ease, using all our Endeavours to make our selves Master of a Barque, but without success. Sometimes we row'd in a\nlittle Boat, which served us to get our living along the Shore, and sometimes to round some small Islands, to see whether nothing would fall out to our purpose, and which might forward our escape. Our Companions that were in the two other Towns, came every now and then to see us, and we repay'd their Visits oftener, or seldom, according as it pleas'd our Governour, for some were more favourable than others. Yet we were patient under the greatest Severities, thinking it a great Mercy that God granted us our health, and a Subsistence during that long Captivity. The following Year 1666, we lost our Protector and good Friend; for his time expiring, the King honour'd him with a better Employment. It is incredible how much good he did to all sorts of People indifferently during his Two Years Government; and accordingly he was entirely belov'd both in the City and Country, and the King and Nobility had a great esteem for his Wisdom and good Behaviour. Whilst he was in his Post, he repair'd public Structures, clear'd the Coasts, and maintain'd and increas'd the Marine Forces. The King was so well pleas'd at these Actions of his, that he preferr'd him to the prime Dignities at Court. We were without a Governour for three days after his Departure, for it is enough, if he that quite has his place supply'd the third day by his Successor; these three Days being allow'd the new Governour, that by Advice of some Diviner, he may choose a happy Minute to enter upon his Government. As soon as install'd, he thought it not enough to use us with all the Severity the banish'd Governour had done, but would oblige us continually to mould Clay, which we refused to do, alledging that his Predecessor had not impos'd any such Labour upon us; that our Allowance being scarce enough to keep us alive, it was but reasonable to allow us what time we had to spare from our own Affairs to get something to Cloath us, and supply our other Wants; that the King had not sent us to work, or if we must be so us'd, it were better for us to quit his Allowance, and desire to be sent to Japan, or some other place, where there were any of our Nation. All the Answer was, ordering us to be gone,\nthreatening he would find a way to make us comply. But he was luckily prevented; for but a few days after, he being in a very pretty Vessel, some Fire accidentally fell into the Powder, and blew up the Prow, killing five Men. Here it must be observ'd, that those people keep their Powder in a powder-room before the Mast. The Governour believing he could conceal that Accident, gave no account of it to the Intendant of the Province; but he was mistaken, for the Fire was seen by one of the Spies the King keeps on the Coasts, and even in the Heart of the Country, to be inform'd of all that happens. This Spy having acquainted the Intendant with it, he sent an account of it up to Court, whither the Governour was immediately summon'd and by Sentence of the Judges receiv'd fourscore and ten Strokes on his Shin-bones, and was banish'd for ever. Thus in July, we had another Governour, who behaving himself towards us in all respects as the last had done, requir'd of us every day an hundred Fadom of Mat. We gave him to understand that was impossible to be done, and made the same remonstrances to him as we had done to his Predecessors. This mov'd him no more than it had done them; for he told us That if we were not fit for that sort of work he would find other Employment for us, which he had done, but that he fell Sick. His rigidness made us conclude, that our Misfortunes were beyond redress, because new Officers rather add new Burdens, than take off those that are already laid on. Thus, besides our own Affairs, we were oblig'd to pull up the Grass in the Square of Penigle, and then to go out, and bring home Wood fit for Arrows. These considerations made us resolve to take the advantage of our Tyrant's Indisposition, and to get a Barque at any rate whatsoever, choosing rather to hazard all than to groan any longer in Captivity among Idolaters, and bear with all sorts of Wrongs they would offer us. For compassing of our Design we decreed, to make us of a Corsian our Neighbour, who was very familiar with us, and whom we had often reliev'd in his Distress. We propos'd to him to buy, or cause a Barque to be bought for us, pretending we wanted it to go beg Cotten in the\nneighbouring Islands, promising him a good share when he came again. He perform'd what he was instructed with, bargaining very boldly for a Fisher-man's Barque, and we presently gave him the Money to pay for it. The Seller perceiving it was for us, would have gone from his Bargain, at the instigation of some that told him, it was to make our escape, and if we did so he would be put to death. This was really true; but we offering to pay double the Value, he consented, making more account of the present Profit than of the Mischief of that might ensue. As soon as the two Coresians were gone, we immediately furnish'd the Barque with Sails, an Anchor, Rigging, Oars, and all things we thought necessary, in order to get out at the first Quarter of the Moon, that being the fittest season. We kept two of our Companions, whom their good Fortune had brought to visit us, and who wanted not much courting; and understanding that John Peter of Vries, an able Sailer, was at Siunschien, we went to desire him to come to us, telling him all things were in a readiness. The Messenger missing of him at Siunschien, went to look for him at Namman, which is 16 Leagues farther, and brought him away, having travell'd about 50 long Leagues in four days. The day and hour being appointed to depart, which was the fourth of September; as the Moon was setting, tho' our Neighbours had conceiv'd some Jealousie, yet we forbore not at night after eating a bit of what we had, to creep along under the City Walls to carry the rest of our provisions, being Rice, Pots of Water, and a Frying-pan. The Moon being down, no body saw us. The first thing we did, we went over into a little Island, which was within-Cannon-shot, where we fill'd a Cask we found in the Barque, with fresh Water. Thence, without making any noise, we made our way before the Vessels belonging to the City and just opposite to the King's Frigats, making out as far as we could into the Channel. The Calm which had continu'd till then, ceasing, there started up a fair Gale, which invited us to hoist Sail, as we did, heartily calling upon God to assist us, and resigning our selves up to him. On the fifth of September in the Morning, when we were\nalmost out of the Channel of the Island, a Fisherman hail'd us, but we would not answer, fearing it might be some advanc'd Guard to the Men of War that lye thereabouts. At Sunrising the Wind fell, which oblig'd us to lower our Sails and Row, to get further off, and prevent being discover'd. About Noon the Weather began to freshen, and at Night we spread our Sail, directing our Course by guess South-East. The Wind growing fresh at Night, we clear'd the Point of Corea, and were no longer apprehensive of being pursu'd, and the Wind holding all night we made much way.\n\nThe Sixth Day in the Morning, we found ourselves very near the first of the Islands of Japan; and the same Gale still favouring us; we came, without knowing it, before the Island of Firando, where we durst not put in, because none of us had ever been at Japan, and we were unacquainted with the Road. Besides, the Coresians had often told us, that there were no Isles to coast along in the way to Nangasaki. We therefore pass'd on to come up with an Island that lay farther off, which appear'd to us very small and near to us, and accordingly we left it astern that night.\n\nThe Seventh Day we held on our Course with a cold Wind, and uncertain Weather, running along abundance of Islands, which seem'd to us to be numberless; and being possess'd there were no Islands to be left behind, we endeavour'd to get above them. At night, we thought to have touch'd at a small island, and would have rid it out at Anchor there, but the Sky seem'd to look Stormy; but we perceiv'd such abundance of Fires all about, that we resolv'd to continue under Sail, going before the Wind, which was very cold.\n\nThe eighth in the Morning we found our selves in the same place, whence we set forward at Night, which we attributed to the force of some current. Hereupon we resolv'd to stand out to Sea, but we had scarce Sail'd two Leagues before there started up a contrary Wind, and blew so hard that it forc'd us in all hast to seek the shelter of the Land; and the Weather still growing more boisterous every moment, after crossing a Bay, we came to an Anchor about Noon, without knowing\nwhat Country we were in. Whilst we were dressing some small matter to eat, the Natives pass'd backwards and forwards close by us, without saying any thing, or making any stay. About Evening, the Wind being somewhat fallen, we saw a Barque come with Six Men in it, who had each of them two knives at their Girdle. They row'd close by us, and landed a Man opposite to the place where we were. This made us weigh and set Sail as fast as we could, making use of our Oars at the same time, to get out of the Bay as soon as possible, and again the open Sea. But that Barque prevented us, for setting out in pursuit of ours, it soon overtook us. True it is, if we would have made use of our long Bamboos, we could easily have prevented their coming aboard us; but seeing several other Barques set out from the Shore full of Men, who by the description we had heard of them, must be Japoneses, we troubled ourselves no farther. They hailing us, and asking us by Signs, whither we would go? We let fly the Colours with the Arms of Orange, which we had provided for that purpose, crying, Holland, Nangasaki. Hereupon they made Signs to us to strike our Sail, and go Ashore, which we presently did. Then they carry'd one of our Men into their Barque, and plac'd the rest in order before one of their Pagods.\n\nBeing come to an Anchor, and having plac'd Barques about ours to guard it, they took another of our Men, and carry'd him to the first they had drawn out, asking them several Questions, but neither understood the other. Our arrival alarm'd all the Coast, and there was not a Man to be seen, but was arm'd with two Swords, but what satisfy'd us was that they endeavour'd to shew us Nangasaki, and seem'd to tell us there were some of our Nation there. At Night a Great Barque that brought the third Man in Dignity of the Isle of Gotto, came aboard us. That Gentleman perceiving we were Hollanders, gave us to understand by Signs, that we had six Ships at Nangasaki, where he hop'd to be with us in four or five Days, if we desir'd it. He signify'd to us that we were in the Island of Gotto subject to the Emperor and to satisfy his Curiosity desiring to know\nwhence we came, we had a great deal of Trouble to give him to understand that we came from Corea, and that it was thirteen Years since we had been Shipwreck'd on an Island belonging to that Kingdom; that we desir'd nothing so earnestly at present, as to get to Nangasaki, to some of our Countrymen, and that to gratifie this our Inclination we had expos'd our selves in a poor Barque, in a Sea unknown to us, where we had sail'd 40 Leagues without a Compass, to reach Japan, not regarding all the Coreans had said to persuade us that the Japonese put all the Strangers that came into their Country to cruel Deaths.\n\nWe continu'd the three following days well guarded in the same place aboard our Barque, whither they brought us Water, Wood, Flesh, and gave us a Mat to cover us from the Rain, which fell in great abundance all that time.\n\nOn the 12th, they furnish'd us with Provisions to go to Nangasaki, and that same Night we Anchor'd on the other side of the Island, where we spent the Night.\n\nOn the 13th that Gentleman we mention'd before weigh'd Anchor being attended by two large Barques, and two little ones, he carry'd some Letters for the Emperor, and some Goods. Our two Companions were in one of those great Barques, and did not come to us again till we were at Nangasaki. About Evening we saw the Bay of that City, and at Midnight anchor'd before it, where we found five Ships of ours. Several Inhabitants of Gotto, and even some of the chief Men, presented, and did us many kindnesses, without taking any thing of us.\n\nOn the 14th we were all carry'd Ashore, where he Companies Interpreters receiv'd us. When they had writ down all the answer we made to their several questions, they carry'd us to the Governour's House, and about Noon we were brought before him. When we had satisfy'd his Curiosity, he much commended our Action, in overcoming so many Dangers and Difficulties to recover our Liberty. Then he order'd the Interpreters to conduct us to our Commandant, Min Heer William Volguers, who receiv'd us very kindly. Min Heer Nicholas le Roy, his Deputy was also very Friendly, and so\nwas all the Nation in general, When we went thence they caus’d us to be Habited after our own Fashion.\n\nOn the first of October, Min Heer Volguers left the Island, and on the 23rd sail’d out of the Bay with 7 Ships. The Governour of Nangasaki, who would have kept us a year, caus’d us to be brought before him on the 25th of the month, and after examining us over again, restor’d us to the Companies Director, who lodg’d us in his own House, whence we sail’d some days after for Batavia. Where we arriv’d on the 20th of November, and at our Journal to the General, who after a very favourable reception, promis’d to put us Aboard the Ships that were to sail from thence on the 28th of December. These Ships, after some Storms, arriv’d at Amsterdam on the 20th of July, 1668 where we return’d Thanks to God for having deliver’d us from a Captivity of 13 years, and 28 days, beseeching him to have Mercy on our poor Companions, who were left behind. Here follow the Names of those that return’d Home, and of those that were left in Corea.\n\nThe Names of those that return’d from Corea.\n\nHenry Hamel of Gorcum, Secretary to the Ships, and Author of this Account.\n\nGodfrey Denis, of Rotterdam.\n\nJohn Pilers, of Vries in Frizeland.\n\nGerard Jans of Rotterdam.\n\nMatthew Cbroyken of Enchuyzen.\n\nCornelius Theodgrick of Amsterdam Benet Clerc of Rotterdam.\n\nDenis Godfrey of Rotterdam.\n\nThe Names of those that remain’d in Corea.\n\nJohn Lampe of Amsterdam, Assistant.\n\nHenry Cornelius of Vreelandt.\n\nJohn Nicholas of Dort.\n\nJacob Jans of Norway.\n\nAnthony Ulders of Limbden.\n\nNicholas Arents of Ost-Voren.\n\nAlexander Bosquet a Scotch-man.\n\nJohn of Utrecht.\nTHE DESCRIPTION OF THE KINGDOM OF COREA.\n\nThe Kingdom known to us by the Name of Corea, and by the Natives call'd Tiozencouk, and sometimes Caoli, reaches from 34 to 44 Degrees of North Latitude, being about 150 Leagues in length from North to South, and about 75 in Breadth from East to West. Therefore the Coresians represent it in the shape of long square, like a playing Card. Nevertheless it has several Points of Land which run far out into the Sea.\n\nIt is divided into 8 provinces, containing 360 Cities and Towns, without reckoning the Forts and Castles, which are all on the Mountains.\n\nThis Kingdom is very dangerous and difficult for Strangers, who are unacquainted with its Coast to Land, because it is much inclos'd with Rocks and Lands. Towards the South-East it is very near Japan; there being but 25 or 26 Leagues distance betwixt the Town of Pousan in Corea, and that of Osacco in Japan. Betwixt them is the Island Suissima, which the Coresians call Taymutto. It formerly belong'd to them, but they exchang'd it for that of Quelpaert, in a Treaty of Peace concluded with the Japoneses.\n\nOn the West, this Kingdom is divided from China by the Bay of Nanking; but is join'd to it on the North by a long and high Mountain, which is all that hinders Corea's being an Island. On the North-East, it is bounded by the vast Ocean, where there is every year a great number of whales taken, some of them found with the French and Dutch harping-irons, those people using to follow that fishing. There are abundance of Herrings also catch'd there in December, January, February and March. Those taken the two first of these months are as large as ours in Holland, but what they catch afterwards are smaller, and are like those in Holland, call'd frying Herrings, which are\neaten in March and April. Hence we infer that there is a passage above Corea, Japan and Tartary, which answers to the streights of Weigats. For this reason we often ask'd of the Coreisan Seamen, who use the North East Sea, what Lands were beyond them, and they all told us they believ'd there was nothing that way but a boundless ocean.\n\nThose that go from Corea to China, Imbark in the narrowest Part of the Bay; for the way by Land is too troublesome, by reason of the difficulty there is in passing the Mountain, especially in Winter because of the excessive Cold, and in Summer because of the many wild Beasts. It is easie to pass over on the North side in Winter, the Bay being generally Froze over hard enough to bear. The Cold is so intense in Corea, that in the Year 1662, we being in the Monasteries on the Mountains, there fell such a wonderful quantity of Snow, that they made ways under it to go from House to House, and to go upon it they wear small boards like little battledoors under their feet, which hinders their Sinking, and yet is no Obstruction to going up or down. This we forgot to insert in the Journal. By reason of this excessive Cold those who live on the Northern Coast feed only upon Barley, and that none of the best; for no Rice or Cotton can grow there Those that are best to pass there have their Meal brought from the South. The poorer sort there have no Cloaths but what are made of Hemp and pitiful Skins. But to make amends the Root Nisy grows there, which they give to the Tartar for their Tribute, and drive a great Trade with it to China and Japan. The rest of the Country is fruitful, and produces all things necessary to support Life especially Rice, and other sorts of Grain. They have Hemp, Cotton and Silkworms; but they know not how to work the Silk. There is also Silver, Lead, Tyger's Skins, and the Nisy root, not to speak of Beasts and Fowl, and several other things. They have store of Horses and Cows, and make use of Oxen to till the Land, and Horses to travel, and carry goods from place to place. There are also Bears, Deer, Wild Bores, Swine, Dogs, Cats, and several other Creatures. We never saw any\nElephant's there, but Alligators or Crocodils of several Sizes, which keep in the Rivers. Their Back is Musket proof, but the skin of their Belly is very soft. Some of them are 18 or 20 Ells long, their Head large, the Snout like a Hog, the Mouth and Throat from Ear to Ear, the Eye sharp but very small, the teeth white and strong, plac'd like the teeth of a Comb. When they eat they only move the Upper Jaw. Their Backbone has 60 Joints, on their Feet are long Claws or Talons, their Tail is as long as the Body; they eat either Fish or Flesh, and are great lovers of Man's Flesh. The Corsians often told us, that three Children were once found in the Belly of one of these Crocodils. Besides these, there are abundance of Serpents and venomous Creatures. As for Fowl, they have Swans, Geese, Ducks, Herons, Storkes, Eagles, Kaulcons, Kites, Pigeons, Woodcocks, Magpies, Daws, Larks, Lapwings, Pheasants, Hens, and plenty of them all as well as other sorts, not known in Europe.\n\nCorea is subject to a King whose Power is absolute, (tho' he pays an Acknowledgement to the Tartar,) and he disposes of all things as he pleases, without asking any bodies Advice. There are no Lords of peculiar places, that is, who are Proprietors of Towns, Islands, or Villages, and all the Great Mens Revenues arise out of those Estates they hold during pleasure, and from the great number of their Slaves, for we have known those that had two or three hundred. So that the Lands and Employments the King bestows on any man, revert to him after his death.\n\nFor Martial Affairs, the King keeps abundance of Soldiers in his Capital City, who have no other Employment than to keep guard about his Person, and to attend him when he goes abroad. All the Provinces are oblg'd once in seven Years, to send all their Free-men to keep Guard about the King for two Months; so that during that Year, it is constantly under Arms, to send all the Men in their turns to Court. Each Province has its general, who has four or five Colonels under him, and each of these as many Captains depending on them, and each of these is Governour of some Town or strong hold; insomuch that there is not a Village, but where at least a Corporal commands, who has Tithingmen,\nor Officers over ten Men under him. These corporals are oblig'd once a Year to deliver to their Captains a List of what People are under their Jurisdiction; and by this means, the King knows how many men he may reckon upon when he has need. Their Horse wear Currasses, Head-pieces, and Swords, as also Bows and Arrows, and Whips like ours, only that theirs have small iron-points. The Foot as well as they wear a Corselet, a Headpiece, a Sword and Musket, or Half-pike. The Officers carry nothing but Bows and Arrows. The Soldiers are oblig'd to provide fifty Charges of Power and Ball, at their own cost. Every Town in its turn, furnishes also a number of Religious Men, drawn out within its own Liberties, to guard and maintain the Forts and Castles at their own Expense; these being in narrow Passes, or on the sides of Mountains. They are counted the best Soldiers, and obey Officers chosen out of their own Corps, who observe the same Discipline as the other. Thus the King Knows to a Man how many there are fit to serve him. Those that are 60 Years of Age, are discharg'd from Duty, and their Children supply their places. The number of Free-man who are not in the King's Service, nor have not been, together with the Slaves, makes about half the People in the Country. If a Free-man lyes with a Woman—slave, or a Man-slave with a Free-Woman, the Children born of them are slaves; and those whose Father and Mother are both Slaves, belong to the Mother's Master. Corea being almost encompass'd on all sides by the Sea, Every Town is to maintain a Ship ready rigg'd, and provided with all Necessaries. Their ships have generally two Masts, and 30 or 32 Oars, to each of which there are five or six Men, so that each of this sort of Galleys carries about 300 Men for Rowing and Fight. They carry some small pieces of Cannon, and abundance of artificial Fireworks. For this reason, every Province has its Admiral, who views these Vessels once a year, and gives an account of what he finds to the High Admiral, who sometimes is present at these Reviews. If any of the Admirals, or the Officers under them, commits a Fault, he is punish'd with Banishment, or Death, as in the Year 1666 we saw our Governour punish'd, who had the\nCommand of 17 vessels, for not acquainting the King that the Powder had taken fire, and blown up Five men.\n\nThe chief Officers by Sea and Land, who make up the King's Council, meet every day at Court, and serve him in all things that occur, without having power to oblige him to anything. They must wait till their Advice is asked, before they give it, and till they are appointed to manage any business before they must meddle with it. These People have the first Places about the King, and live and die in those Employments, or till four score years of age, provided they commit no Crime that renders them unworthy to continue. The same is practis'd in other inferior employments at Court, which no Man quits, unless it be to rise. The Governors of Places, and subaltern Officers, are remov'd every three Years, and very few of them serve out their time, because they are for the most part accus'd of some Misdemeanours during their Administration. The King keeps Spies in all places, to inform him of every man's Behaviour, which is the reason why many are often punish'd with Death or perpetual Banishment.\n\nThe King's Revenue for Maintenance of his House and Forces arises out of the Duties paid for all things the Country produces, or that are brought by Sea. To this purpose, in all Towns and villages there are Store-houses to keep the Tythe. For the Farmers, who are generally of the common sort, take the Tythe of all things upon the spot in Harvest-time, before any thing is carry'd away. The great men live upon their Revenues, as has been said before; and those that have Employments live upon the Allowance the King gives them, to be receiv'd out of the Revenues of the Places where they reside, assigning what is rais'd in the Country for the Sea and Land Forces. Besides this Tythe, those men who are not listed, are to work three Days in a Year, at whatsoever business the Country will put them upon. Every Soldier and Trooper has every Year three pieces of Cloth given him to cloath him, which in all are worth a Pistole, which is part of the Pay of the Troops that are in the Capital of\nthe Kingdom. This is what is rais'd on the people, who know no other Duties or Taxes.\n\nJustice is severely executed among the Coresians, and particularly upon criminals. He that rebels against the King, is destroy'd with all his Race, his Houses are thrown down, and no Man does ever rebuild them, and all his Goods forfeited, and sometimes given to some private person. When the King has once made a Decree, if any Man is so presumptuous as to make any Objection to it, nothing can protect him from severe Punishment, as we have often seen it executed. Among other particulars I remember, that the King being inform'd that his Brother's Wife made great Curiosities at Needlework; he desir'd of her, that she would Embroider him a Vest; but that Princess bearing him a mortal Hatred in her Heart, she stich'd in betwixt the Lining and the Out-side some Charms and Characters of such nature, that the King could enjoy no pleasure, nor take any rest whilst he had that Garment on. After he had long study'd to find what might be the cause of it, at last he guess'd at it. He had the Vest rip'd, and found out the cause of his trouble and uneasiness. There was not much time spent in trying that wretched Woman. The King condemn'd her to be shut up in a Room, the Floor whereof was of Brass, and order'd a great Fire to be lighted under it, the Heat whereof tormented her till she dy'd. The News of this Sentence being spread abroad through all the Provinces, a near Kinsman of this unhappy Woman, who was Governour of a Town, and in good Esteem at Court for his Birth and good Qualities, ventur'd to write to the King, representing, That a Woman, who had been so highly honour'd as to marry his Majesty's Brother, ought not to die so cruel a Death, and that more Favour should be shown to that Sex. The King incens'd at this Courtier's Boldness, sent for him immediately, and after causing 20 Strokes to be given him on his Shin-bones, order'd his Head to be cut off. This Crime, and those I shall speak of next, are only Personal, and do not involve the whole Family in the Punishment. If a Woman kills her Husband, she is bury'd alive up to her shoulders, in a High-way that is much\nfrequented, and by her is laid an Axe, with which all that pass by, and are not noble, are oblig'd to give her a Stroke on the Head till she is dead. The Judges of the Town where this happens, are suspended for a while, the Governour is taken away, and it is made subordinate to another Government, or at best only a private Gentleman is left to command in it. The same Penalty is inflicted on such Towns as mutiny against their Governors, or send false Complaints against them to Court. The man that kills his Wife, and proves he had cause so to do, as for catching of her in Adultery, or any other hairous Fault, is in no danger for so doing. If the Woman so killed was a Slave, the penalty is to pay three times her value to the Owner. Slaves that kill their Masters, are cruelly tormented to death; but they look upon it as nothing for a Master to kill his Slave, tho' it be upon a slight account. Thus they punish Murder. After they have long trampled on the Criminal, they pour Vinegar on the putrify'd Carcase, which they then pour down the Offender's Throat through a Funnel; and when he is full, they beat him on the Belly with Cudgels till he bursts. Thieves are trampled to Death; and though this be a dreadful punishment, yet the Coreans are much addicted to stealing. If a single Man is found abed with a marry'd Woman, he is stripped naked to a little pair of Drawers; then daubing his Face with lime, they run an Arrow through each Ear, and fasten a little Drum on his Back, which they beat at all the Cross-streets to expose him to Shame. This Punishment ends in 40 or 50 strokes of a Cudgel on the Man's bare Buttocks, but the woman receives them with Drawers on. The Men are natually very amorous, and so Jealous, that they seldom, and with much difficulty allow their best Friends to see their Wives. If a marry'd Man be taken lying with another Man's Wife, he is to suffer Death, and chiefly among persons in high place; and the Criminal's Father if living, or else his nearest Kinsman must be the Executioner. The Offender is to choose what Death he will die; but generally the Men desire to be run through the Back, and the Women to have their Throat cut. Those who by a time appointed do not pay what they owe to\nthe King, or private Persons, are Beaten twice or thrice a month on the Shin-bones, which is done till they can find means to discharge the Debt. If they die before they have satisfy'd the Creditor, their nearest Relations are bound to pay for them, or suffer the same Punishment, so that neither the King nor Private Persons ever lose what is due to them. The slightest Punishment in that country, is to be Bastonado'd on the bare Buttocks, or on the Calfs of the Legs, and they look upon it as no disgrace, because it is very common, and they are often liable to it for only speaking one word amiss. Inferior Governours and subordinate Judges, may not condemn any Man to Death without acquainting the Governour of the Province. No Man can try prisoners of State without the King be first inform'd. As concerning their Punishments, this is the manner how they Bastonado on the Shin-bones: They tye the criminal's feet together on a little Bench four Fingers broad, and laying such another under his Hams, to which they are fast bound; they strike betwixt these two Bindings with a Stick as long as a Man's Arm, somewhat round on the one side, and flat on the other, two inches broad, and about the thickness of a Crown-piece. This sort of Laths are generally of Oak or Alder, wherewith they must not give above 30 Strokes at one time, and then two or three hours after, they repeat them till the whole number be given according to the Sentence. When the Offender is to be beaten on the Soles of the Feet, he is made to sit down on the ground; then having bound his feet together by the great Toes, they rest them on a piece of Wood they have betwixt their Legs, and beat them with a Cudgel as thick as a Man's Arm, and three or four Foot long, giving as many Strokes as the Judge has order'd. The Bastonading on the buttocks is thus: The men being stripp'd, they make them lye on the ground with their Faces down, and bind them to a little Bench. The women have a pair of wet Drawers left on; and in this posture they beat them with a larger and longer Lath than those before mentioned. An hundred Strokes are equivalent to Death, and many die of them, and some even before they have receiv'd fifty. When any are adjudg'd to be beaten on the\nCalves of the Legs, it is done with Rods or Wands, as thick as a Man's Thumb. This punishment is common to Women and young Apprentices. Whilst all these sorts of Punishment are inflicting, the Criminals cry so lamentably, that the Spectators seem to suffer no less than the Offenders.\n\nAs for Religion, the Corsesians have scarce any. The common sort makes some odd Grimaces before the Idols, but pay them little respect, and the Great Ones honour them much less, because they think themselves to be something more than an Idol. To prove this, when any of their Kindred or Friends dies, they all appear to honour the Dead-man at the offering a Priest makes before his Image, and frequently travelling 30 or 40 Leagues to be present at this Ceremony, whether to express their Gratitude to some great Man, or to shew the Esteem they have for some Learned Religious Man, and that they preserve the memory of him. On Festivals the People repair to the Temple, and every one lights a bit of sweetwood; then putting it into a Vessel for that purpose, they go offer it to the Idol, and placing it before him, make a low Bow, and depart. This is their Worship. For their Belief, they are of opinion, that he who lives well shall be rewarded, and he who lives ill shall be punish'd. Beyond this, they know nothing of Preaching or of Mysteries, and therefore they have no Disputes of Religion, all believing and practising the same thing throughout the Kingdom. The Religious Men offer Perfumes before an Idol twice a Day, and on Festivals; all the Religious of a House make a Noise with Drums, Basons, and Kettles. The Monasteries and Temples, which the Kingdom swarms with, are for the most part on the Mountains, each under the liberty of some Town. There are Monasteries of 5 or 600 Religious Men, and at least 4,000 of them within the Liberties of some Towns. They are divided into Companies of 10, 20, and sometimes 30, and the eldest Governs, and if any one does not do his Duty, he may cause the others to punish him with 20 or 30 Strokes on the Buttocks. But if the Offence be heinous, they deliver him up to the Governour of the Town they belong to. It being lawful for any\nMan to become a Religious, all the Country of Corea is full of them, and the more, because they can quit this Profession when they please. However, generally speaking, these Religious Men are not much more respected than the Slaves, because of the great Taxes they are oblig'd to pay, and the Work they are forc'd to do. Their superiors are in great Esteem, especially when they are Learned; for then they are equal with the Great Men of the Country, and are call'd the King's Religious Men wearing their Order over their Cloaths. They have the power of Judging as subaltern Officers, and make their Visits on Horseback, being very well receiv'd and entertain'd in all places. They must eat nothing that has had Life; they shave their Heads and Beards, and are forbid conversing with Women. If any of them breaks these Rules, they give him 70 or 80 Strokes on the Buttocks, and Banish him the Monastery. When they are first shav'd, or soon after, they give them a mark on the Arm, which never wears off, and by that those are known who have once been Religious Men. They work for their Living, or use some Trade; some go a begging, and all of them have some small Allowance from the Governour. They always keep little Children in their Houses, whom they very carefully teach to read and write. If these Children will be shav'd, they keep them in their Service, and have all that they can earn, till the Master dies, which makes them Free, and Heirs to all their Goods. For this reason, they are oblig'd to wear Mourning for them as for their Father, in return for all the Pains they have taken to instruct and bring them up. The Monasteries and Temples are built at the publick Charge, every one contributing proportionably to what he is worth. There is still another sort of People like these Religious Men, as well in regard of their Abstinence, as their serving the Idols, but they are not shorn, and may marry. They believe by Tradition, that once all Mankind had but one Language, but that the design of building a Tower to go to Heaven caus'd the confusion of Tongues. The Nobles frequent the Monasteries very much, to divert themselves there with common Women, or others they carry with them, because\nthey are generally deliciously seated, and very pleasant for Prospect and fine Gardens, so that they might better be call'd Pleasure-houses than Temples, which is to be understood of the Common Monasteries, where the Religious Men love to drink hard. In our time there were two Monasteries of Religious Women in the City of Sior, in one of them there were none but Women of Quality, in the other Maids of the common sort. They were all shorn, and observ'd the same Rules and Duties as the Men. The King and Great Men maintain'd them; but three or four Years since the King now reigning, gave them leave to marry.\n\nHaving spoke of the Government and Ecclesiastical Affairs, I will now descend to private Matters. The Houses of the Corestans of Quality are stately, but those of the common sort very mean; nor are they allowed to build as they please. No Man can cover his House with Tiles, unless he have leave, so to do; for which reason, most of them are thatch'd with Straw or Reeds. They are parted from one another by a Wall, or else by a row of Stakes, or Pallisades. They are built with Wooden Posts or Pillars, with the Interval betwixt them fill'd up with Stone up to the first Story, the rest of the Structure is all Wood daub'd without, and cover'd on the inside with White Paper glew'd on. The Floors are all vaulted, and in Winter they make a Fire underneath, so that they are always as warm as a Stove. The Floor is cover'd with Oll'd Paper. Their Houses are small, but one Story high, and a Garret over it, Where they lay up their Provisions. The Nobility have always an Apartment forwards, where they receive their Friends, and lodge their Acquaintance, and there they divert themselves, there being generally before their Houses a large Square, or Bass Court, with a Fountain, or Fish-pond, and a Garden with cover'd Walks. The Womens Apartment is in the most retir'd part of the House, that no body may see them. Tradesmen, and the chief Townsmen, generally have a Store-house adjoining to their Mansion-house, where they keep their Goods, and treat their Friends with Tobacco and Arrac. There are virtuous Women\namong them, who are allow'd the liberty of seeing People, and going into Company, and to Feasts, but they sit by themselves, and opposite to their Husbands. They have scarce any more Household Goods than are absolutely necessary. There are in the Country abundance of Taverns and pleasure-houses, to which the Corsesians resort to see common Women dance, sing, and play on Musical Intruments. In Summer they take this Recreation in cool Groves, under close shady Trees. They have no particular Houses to entertain Passengers and Travellers, but he who travels, goes and sits down, where Night overtakes him, near the Pales of the first House he comes at, where tho' it be not a great Man's House, they bring him boil'd Rice, and dress'd Meat enough for his Supper. When he goes from thence, he may stop at another House, and at several. Yet on the great Road to Sior, there are Houses, where those that travel on Publick Affairs, have Lodging and Diet on the Publick Account.\n\nKindred are not allow'd to marry within the fourth Degree. They make no love, because they are marry'd at 8 or 10 Years of Age, and the Young Maids from that time live in their Father-in laws House, unless they be only Daughters. They live in the Husband's Father's House till they have learnt to get their living; or to govern their Family. The day a Man Marries, he mounts on Horseback attended by his Friends, and having rode about the Town, he stops at his Bride's Door, where he is very well receiv'd by the Kindred, who take the Bride and carry her to his House, where the Marriage is consummated without any other Ceremony. Tho' a Woman have bore her Husband many Children it is in his power to put her away when he pleases, and to take another; but the Woman has not the same privilege, unless she can get it by Law. A Man may keep as many Women as he can maintain, and repair to them at all times without scandal. But at home he keeps only his Wife, the others are about the Town, or in Houses apart from his. Yet the Noblemen have two or three Women besides their Wife in the House, however\nthere is but one that rules, and has management of all things. The others have each a distinct Apartment, whither the Master of the House goes when he pleases. To say the truth, they make no great account of their Wives, and use them little better than Slaves, turning them away for the least Faults, and sometimes on bare pretences, and then they force them to take their Children, who those poor Wretches are bound to maintain. This liberty of putting away the Mother and Children, is a means to make the Country very populous.\n\nThe Nobility, and all Free-men in general, take great care of the Education of their Children, and put them very young to learn to read and write, to which that Nation is much addicted. They use no manner of rigour on their method of teaching, but manage all by fair means, giving their Scholars an Idea of Learning, and of the Worth of their Ancestors, and telling them how honourable those are who by this means have rais'd themselves to great Fortunes, which breeds Emulation, and makes them students. It is wonderful to see how they improve by these means, and how they expound the Writings they give them to read, wherein all their Learning consists. Besides this private Study, there is in every Town a House, where the Nobility, according to antient Custom, of which they are very tenacious, take care to assemble the Youth, to make them read the History of the Country, and the Condemnations of Great Men, who have been put to Death for their Crimes. To perfect them in their Learning there are Assemblies kept yearly in two or three Towns of each Province, where the Scholars appear to get Employments, either by the pen or by the Sword. The Governors of Towns send able Deputies thither to examine them, and choose the best qualified; and according to the report made to them, they write to the King. The greatest Men in the Kingdom are there, whether they are in Post or not. Their Employments are bestow'd on those that are thought worthy, and the King orders their Commissions to be issu'd out. The old Officers, who till then have only had Civil or Military Commissions, at this time use all their endeavours to be employ'd in both\nProfessions, to increase their Revenue. The aspiring to these Honours is often the ruin of the Candidates, because of the Presents they make, and Treats they give, to gain Reputation, and obtain Votes. Some there are also that die by the way, and most of them are satisfy'd with getting the Title of the Employ they aim at, thinking it honour enough to have been design'd for a Post:\n\nParents are very indulgent to their Children, and in return are much respected by them. They depend upon one another's good Behaviour; and if one of them withdraws after an ill Action, the other does the like. It is otherwise with the Slaves, who have little care of their Children, because they know they will be taken from them as soon as they are able to work, or do any business. When a Free-man dies, his Children mourn three Years, and during all that time, they live as austerely as the Religious Men, are not capable of any Employment, and if any of them is on a Post he must quit it. It is not lawful for them during that time to lye with their Wives, and if they should have any Children born during the Mourning, they would not be accounted Legitimate. It is not permitted them to be in a passion, or to fight, muchless to be drunk. The Mourning they wear is a long Hempen Robe, without any thing under it but a sort of Sack-cloth wove with a twisted Thread almost as thick as the Twine of Cable. On their Hats, which are made of green Reeds wove together; instead of a Hatband they wear a Hempen Rope. They never go without a great Cane or Cudgel in their hands, which serves to distinguish who they are in Mourning for, the Cane denoting the Father, and a Stick the Mother. During all this time, they never wash, and consequently look like Mulattoes.\n\nAs soon as one dies, his Kindred run about the Streets shrieking, and tearing their Hair. Then they take special care to bury him honourably in some part of a Mountain, shown them by a Fortune-teller. They use Coffins for every dead Body, being two or three Fingers thick, shut close, and put one within the other to keep out the Water, painting and adorning them as\nevery one is able. They generally bury their Dead in Spring and Autumn. As for those that die in Summer, they put them into a thatch'd Hut rais'd upon four Stakes, where they leave them till the Rice-harvest is over. When they intend to bury them, they bring them back into the House, and shut up in their Coffins with them their Cloths and some Jewels. In the Morning at break of day, they set out with the Body, after a good Repast, and making merry all the Night. The Bearers sing, and keep time as they go, whilst the Kindred make the Air ring with their Cries. Three days after, the Kindred and Friends of the Party deceas'd, return to the Grave, where they make some Offerings, and then they eat together, and are very merry. The meaner sort, only make a Grave five or six foot deep, but the Great Men are put into Stone Tombs, rais'd on a Statute of the same substance, at the bottom whereof is the name carv'd, with the Qualifications of the Party there bury'd, mentioning what Employments he enjoy'd. Every Full Moon they cut down the Grass that grows on the Grave, and offer new Rice there. That is their greatest Festival next to the new Year. They reckon by Moons, and every three Years they add one, so that the third Year has 13, whereas the other two have but twelve Moons each. They have Conjurers, Diviners, or Sooth-sayers, who assure them whether the Dead are at rest or not, and whether the place where they are bury'd is proper for them, in which Point they are so superstitions, that it often happens they will remove them two or three times. When the Children have fully perform'd the Duty they owe to Father and Mother by means of this tedious Ceremony, if they have left any Estate, the eldest Son takes possession of the House that belongs to him, with all the Lands depending on it. The rest is divided among the other Sons, and we never heard that the Daughters had any share, because the Women carry nothing to their Husbands but their Cloaths. When a Father is fourscore Years of Age, he declares himself incapable of managing his Estate, and resigns it up to his Children, who maintain their Father, and always pay him a great deal of respect. When the eldest has taken posses-\nsion of the Estate, he builds a House at the Publick Expense for his Father and Mother, where he lodges and maintains them.\n\nThe Corsesians are very much addicted to stealing, and so apt to cheat and lye, that there is no trusting of them. They think they have done a good Action when they have overreach'd a Man, and therefore Fraud is not Infamous among them; yet if a Man can prove that he has been cheated in a Bargain of Horses, Cows, or any other thing whatsoever, he may be righted tho' it be three or four Months after. Nevertheless they are silly and credulous, and we might have made them believe any thing we would, because they are great lovers of Strangers, but chiefly the Religious Men. They are an effeminate People, and shew very little Courage and Resolution when they are put to it. At least we were told so by several credible Persons, who were witnesses to the havock the Emperor of Japan made in their Country when he slew their King; not to mention what Wettervece so often told us about the irruption of the Tartar, who coming over upon the Ice, possess'd himself of the Kingdom. He assur'd us, as one that had been an eye-witness to the whole, that more Corsesians dy'd in the Woods, whither they fled, than were kill'd by the Enemy. They are not ashame'd of Cowardize, and lament the misfortune of those that must fight. They have often been repuls'd with loss when they have attempted to plunder some European Vessel that has been cast on their coast, being bound for Japan They abhor Blood, and fly when they meet with any. They are much afraid of the Sick, and particularly those that have contagious Distempers, and therefore they presently remove them, whether they are in the Town or Country, and put them into little Straw-hovels in the middle of the Fields. There no body talks to them, but only those that are to look after them, who give notice to Passengers to keep off, and when the sick Man has no Friends to take care of him, the others rather let him die than they will come near him. When there is a Plague in one Town, or Village, the Avenues to it are shut up with a Hedge of Briars and Brambles, and they lay some on the tops of the Houses, where there are\nany Sick, that all People may know it. They might when they are sick, make use of the Simples that grow in their Country, but the People are not acquainted with them, and almost all the Physicians are employ'd by the Great Ones, so that the Poor who cannot be at that charge, make use of Blind Men and Conjurers, in whom they once repos'd such great confidence, that they follow'd them every where, cross Rivers and Rocks, and particularly into the Temples of the Idols, where they call'd upon the Devils. But this Customs was abolish'd by the King's Order in the Year 1662.\n\nBefore the Tartar subdu'd this Kingdom, it was full of Luxury and Debauchery, the Coreans whole business being eating and drinking, and giving themselves up to all Leudness. But now the Tartars and Japaneses tyrannize over them, they have enough to do to live when a Year proves bad, because of the heavy Tribute they pay, and particularly to the Tartar who comes three times a Year to receive it. They believe there are but twelve Kingdoms or Countries in the whole World, which once were all subject, and pay'd Tribute to the Emperor of China; but that they have all made themselves free since the Tartar conquer'd China, he not being able to subdue them. They call the Tartar, Tiekse, and Orankav; and our Country Nampankouk, which is the name the Japaneses give to Portugal, and therefore not knowing us they give us the same Name, having learnt it within these 50 or 60 Years, since when the Japaneses taught them to plant Tobacco, to dress and make use of it, for till then it was unknown to them, and they telling them the Seed of it came from Nampankouk, they often call the Tobacco Nampankoy. They take so much at present, that the very Children practise it at four or five Years of Age, and there are very few Men or Women among them that do not smoke. When first brought them, they bought it for its weight in Silver, and for that reason they look'd upon Nampankouk as one of the best Countries in the World. Their Writings give an account, that there are fourscore and four thousand several Countries; but most of them do not believe it, and they say, if that were so\nevery little Island and Sand must pass for a Country; it being impossible, say they, for the Sun to light so many in a day. When we nam'd some Countries to them, they laugh'd at us, affirming, we only talk'd of some Town or Village; their Geographical Knowledge of the Coasts reaching no farther than Siam, by reason of the little Traffick they have with Strangers farther from them. They have scarce any Trade, but only with the Japoneses, and with the People of the Island of Ceuxima, who have a Store-house in the South-West Part of the Town of Pousan. They supply Corea with Pepper, Sweet-wood, Alum, Bufflers-horns, Goats and Buck-skins, and other Commodities, which we and the Chineses sell in Japan. In exchange, they take the product and Manufactures of the Country. The Core-sians have also some Trade at Peking, and in the Northern Parts of China, but it is very chargeable, because they only go thither by Land, and on Horse-back. None but the rich Merchants of Sur trade to Peking, and are always three months at least on the way. This whole Trade is in Linnen, or Cotton-cloth, The Great Ones, and chief Merchants buy and pay for all with Money, but the meaner sort deals only with Rice and other Commodities by way of Barter.\n\nThere is but one sort of Weight and Measure throughout the Kingdom, but the Traders abuse it very much, notwithstanding all Precautions and Orders of the Governours. They know no Money but their Casis, and those pass only on the Frontiers of China. They pay Silver by weight in little Ingots, like those we bring from Japan.\n\nTheir Language, their way of Writing, and their Arithmetick, are very hard, to learn. They have many words to express the same thing, and they sometimes talk fast, and sometimes slow, especially their Learned Men, and great Lords. They use three several sorts of Writing, the first and chiefly like that of China and Japan, which they use for printing their Books, and for all Publick Affairs. The Second is like the common Writing among us. The great Men and Governours use it, to answer Petitions, and make Notes on Letters of Advice, or the\nlike, the Commonalty cannot read this Writing. The third is more unpolish'd, and serves Women and the common sort. It is easier to write in this Character than the others, Names and Things never before heard of, being noted down with very curious fine Pencils. They have abundance of old Books, both Printed and Manuscript, so choicely kept that none but the King's Brother is trusted with them. Copies of them with Cuts, are kept in several Towns, that in case of Fire they may not be quite lost. Their Almanacks are made in China, they themselves wanting skill to make them. They print with Boards or Wooden Cuts, and lay one Cut to each side of the Paper, and so strike off a Leaf. They cast Accounts with little long Sticks, as we do with Counters. They know not how to keep Books of Accounts or Shopbooks, but when they buy any thing, they set down the Price under it, and write on it what they made of it, and so find what profit or Loss.\n\nWhen the King goes abroad, he is attended by all the Nobility of the Court, wearing the Badge of his Order, or some piece of Embroidery before and behind, on a Garment of Black Silk, with a very broad Scarf, a great Body of Soldiers following in good order. Before him go Men on Horseback and others on Foot, some of them carrying Colours and Banners, and the others playing on several Warlike Instruments. They are follow'd by the Life-Guards, which are made up of the chief Burgers of the Town. The King is in the Middle carried under a very rich Gold Canopy, and proceeds with such silence, that the least Noise is not heard. Just before him goes a Secretary of State, or some other great Officer, with a little Box, into which he puts all the Petitions and Memorials private Persons present upon the end of along Cane, or which they hang along the Walls or Pails, so that they cannot see who prefers them. Those that are appointed to gather them, bring them to the Secretary, who puts them into the little Box, and when the King returns to his Palace, they are all laid before him to decide what is to be done, which he performs, and his Orders are executed out of hand, no body presuming to contradict them.\nAll the Doors and Windows of the Houses in the Streets through which the King passes, are shut, and no body does presume to open the least cranny of them, much less look over the Wall, or over the Pails. When the King passes by the great Men or Soldiers, they must turn their Backs to him without daring to look, or so much as cough. Therefore upon these occasions, most of the Soldiers put little Sticks into their Mouths, that they may not be accus'd of making a noise. When the Tartar's Embassador comes, the King goes in Person with all his Court out of Town to receive him, waits upon him to his Lodging, and in all places every body does him as much or more honour than to the King. All sorts of Musicians, Dancers, and Vaulters, go before him, striving who shall divert him most. During the whole time the Tartar is at Court, all the Streets from his Lodging to the Palace are lin'd with Soldiers, who stand within 10 or 12 Foot one of the other. There are two or three Men who have no other Employment but to pick up Notes thrown out of the Tartar's Window to be carry'd to the King, who desires to know what the Embassador is doing at all times. To conclude, that Prince studies all ways to please him, endeavouring by all manner of courtesie to make him sensible of the respect he bears the Great Cham, that he may make a favourable report concerning him to his Master.\nOFFICERS FOR 1917.\n\nPresident.\nBISHOP TROLLOPE.\n\nVice President.\nDr. R. G. Mills.\n\nCorresponding Secretary.\nDr. J. S. Gale.\n\nRecording Secretary.\nE. W. Koons.\n\nLibrarian.\nS. A. Beck.\n\nTreasurer.\nF. H. Smith.\n\nCouncillors.\n\nArthur Hyde Lay, C.M.G., (British Consul General.)\nR. S. Miller, (American Consul General.)\nDr. S. Hishida (Imperial Government service.)\nLIST OF MEMBERS,\nKOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHONORARY MEMBERS.\n\nAllen, Hon. H. N., M.D., LL.D. ... Toledo, Ohio, U.S.A.\nBrown, MacLeavy J., C.M.G. ... London.\nGubbins, J. H., C.M.G. ... c/o Foreign Office, London.\nHulbert, H. B., F.R.G.S. ... Springfield, Mass., U.S.A.\nJones, G. H., D.D. ... 150 Fifth Ave., New York City.\nJordan, Sir John, K.C.M.G. ... Peking, China.\n\nORDINARY MEMBERS.\n\nAlbertson, Miss M. H. ... Seoul.\nAsakawa, Prof. K. ... New Haven, Conn., U.S.A.\nAsami, R. ... Judge of Supreme Court, Seoul.\nAvison, O. R., M.D. ... Seoul.\nBaird, Rev. W. M., Ph.D. ... Pyeng Yang.\nBeck, Rev. S. A. ... Seoul.\nBell, Rev. Eugene ... Kwangju.\nBennett, W. G. ... Chemulpo.\nBolljahn, J. ... Seoul.\nBonwick, Gerald ... Seoul.\nBowman, N. H., M.D. ... Beeville, Texas.\nBrockman, F. M. ... Seoul.\nBridle, Rev. G. A. ... Suwon.\nErinckmeier, R. ... Chemulpo.\nBunker, Rev. D. A. ... Seoul.\nBunker, Mrs. D. A. ... Seoul.\nBurdick, Rev. C. M. ... Seoul.\nCable, Rev. E. M. ... Seoul.\nCameron, Miss Christine ... Seoul.\nClark, Rev. C. A., D.D. ... Seoul.\nCollyer, Rev. C. T. ... Wonsan.\nCram, Rev. W. G. ... Songdo.\nCrispin, J. F. ... London, England.\nCunningham, Rev. W. B. ... Chinju.\nCurtice, R. S. ... Seoul.\nCutler, Miss M. M., M.D. ... Pyengyang.\nCynn, Prof. Hugh H. ... Seoul.\nDeming, Rev. C. S. ... Seoul.\nElliot, Sir Charles ... University of Hongkong.\nErdman, Rev. Walter C. ... Taiku.\nFollwell, E. D., M.D. ... Pyeng Yang.\nLIST OF MEMBERS.\n\nFrampton, G. R. ... ... ... ... Seoul.\nFrench, Colonel ... ... ... ... Seoul.\nFrey, Miss ... ... ... ... Seoul.\nGale, Rev. J. S., D.D. ... ... ... Seoul.\nGenso, J. F. ... ... ... ... Seoul.\nGillett, P. L. ... ... ... ... Nanking, China.\nGordon, Hon. Mrs. E. A. ... ... London, England.\nGray, Mrs. William ... ... ... London, England.\nGregg, G. A. ... ... ... ... Seoul.\nGrove, Rev. P. L. ... ... ... Hajiu.\nHall, Mrs. R. S., M.D. ... ... Seoul.\nHall, Rev. E. F. ... ... Berkeley, Cal., U.S.A.\nHarris, Bishop M. C., LL.D. ... Tokyo.\nHaven, Rev. W. I., D.D. ... Bible House, Astor Place, New York\nHillman, Miss M. R. ... ... Chemuipo.\nHirst, J. W., M.D. ... ... Seoul.\nHishida, S., Ph. D. ... ... Seoul.\nHofinan, Rev. C. S. ... Kangkai.\nHoldcroft, Rev. J. G. ... Pyengyang.\nHooker, J. T. ... ... Spartanburg, South Carolina, U.S.A.\nIrvin, C. H., M.D. ... ... Fusan.\nJoly, Mrs. ... ... ... ... Seoul.\nJoly, Percy B. ... ... Shanghai.\nKanazawa, Dr. S. ... Imperial University, Tokyo, Japan.\nKavanaugh, J. ... ... Shanghai.\nKoons, Rev. E. W. ... ... Seoul.\nKruger, F. D., Ph.D. ... Berlin.\nLay, Arthur Hyde, C.M.G. ... British Consul General, Seoul.\nLeadingham, R. S., M.D. ... Mopko.\nLucas, A. E. ... ... Seoul.\nLudlow, A. I., M.D. ... ... Seoul.\nLyall, Rev. D. M. ... Chinju.\nMacrae, Rev. F. J. L. ... Masanpo.\nMcEachern, Rev. John ... Kunsan.\nMcGary, E. ... ... Seoul.\nMiller, Hugh ... ... Seoul.\nMiller, Hon. R. S. ... ... Seoul.\nMills, E. W. ... ... Peking.\nMills, R. G., M.D. ... ... Seoul.\nMin Yung-chan ... ... Seoul.\nMoffett, Rev. S. A., D.D. ... Pyengyang.\nMoore, Rev. J. Z. ... ... Pyengyang.\nMoose, Rev. J. R. ... ... Seoul.\nMorgan, Hon. E. V. ... ... c/o Department of State, Washington.\nLIST OF MEMBERS.\n\nMorris, Rev. C. D. ... ... ... Pyengyang.\nMorris, J. H. ... ... ... Seoul.\nMorrison, G. H. ... ... ... Peking.\nNiwa, S. ... ... ... Y.M.C.A., Seoul.\nNoble, Rev. W. A., D.D. ... ... Seoul.\nPieters, Rev. A. A. ... ... Chairyung.\nPonsonby-Fane, R. A. B. ... ... Hongkong.\nPye, Miss Olive F. ... ... Seoul.\nReiner, Prof. R. O. ... ... Pyengyang.\nKhee, S. M., Ph.D. ... ... Ilonolulu.\nRhodes, Rev. H. S. ... ... Syenchyun.\nRichard, Rev. Timothy, D.D. ... Shanghai.\nRobbins, Miss H. P. ... ... Pyengyang.\nRufus, Rev. W. Carl, Ph.D. ... Ann Arbor, Mich.\nScheifley, W. J., D.D.S. ... Seoul. [Japan.\nScidmore, Hon. G. H. ... American Consul-General, Yokohama,\nScranton, W.B., M.D. ... Kobe, Japan.\nSekiya, Hon. F. ... ... Seoul.\nSharp, Rev. C. E. ... ... Pyengyang. [School, Hiroshima, Japan.\nShidehara, Dr. ... ... President Hiroshima Higher Normal\nShiraton, Dr. K. ... Imperial University, Tokyo.\nSmith, Rev. F. H. ... ... Seoul.\nSmith, R. K., M.D. ... Andong.\nSmith, Rev. W. E. ... ... Pyengyang.\nSnyder, L. II. ... ... Baltimore, Md.\nStarr, Prof. Frederich, Ph.D. ... University of Chicago.\nStillman, E. G., M.D. ... ... 830 Park Place, New York City.\nTate, Rev. L. B. ... ... Chunju.\nTaylor, A. W. ... ... Seoul.\nTaylor, W. W. ... ... Seoul.\nToms, Rev. J. U. S. ... ... Seoul.\nTrollope, Rt. Rev. Bishop M. N. ... Seoul.\nUnderwood, H. II. ... ... Seoul.\nUnderwood, Mrs. H. II. ... ... Seoul.\nUsami, Hon. K. ... ... Seoul.\nVan Buskirk, J.D., M.D. ... ... Seoul.\nWambold, Miss K. C. ... ... Seoul.\nWelbon, Rev. A. G. ... ... Andong.\nWeller, O. A. ... ... Seoul.\nWhittemore, Rev. N. C. ... ... Sensen.\nWhittemore Thomas... ... Cambridge, Mass.\nWilliams, Prof. F. N. ... ... New Haven, Conn., U.S.A.\nYamagata, Mr. Isoh ... ... Editor \"Seoul Press.\"\nYun, Mr. T. II. ... ... Central Y.M.C.A., Seoul.\nCATALOGUE.\n\n\"TRANSACTIONS OF THE KOREA BRANCH OF THE ROYAL ASIATIC SOCIETY.\"\n\nVOLUME I. PART I only. 1900.\nPrice Yen 3.00.\n\nContents:\n- Influence of China upon Korea.\n- Korean Survivals.\n- Colossal Buddha at Eun-jin.\n- Minutes of General Meeting.\n\nAppendix:\n- Office Bearers.\n- List of Members.\n- Constitution and By-Laws.\n\nVOLUME II. PART I. 1901.\nPrice Yen 2.50.\n\nContents:\n- Kang-Wha.\n- The Spirit Worship of the Koreans.\n\nVOLUME II. PART II. 1902.\nPrice Yen 3.00.\n\nContents:\n- Han-Yang (Seoul).\n- Korean Folk-Tales.\n- Minutes of General Meetings.\n- Report of the Council.\n\nAppendix:\n- Officers.\n- List of Members.\n\nVOLUME III. PART I only. 1903.\nPrice Yen 2.50.\n\nContents:\n- Ch'oe Ch'e Wun: His Life and Times.\n- The Culture and Preparation of Ginseng in Korea.\n- Minutes of Annual Meetings.\n- Report of the Council.\nAppendix: —\nOfficers.\nList of Members.\nCatalogue of the Landes Library.\n\nVOLUME IV. PART I. 1912.\nPrice Yen 1.50.\n\nContents: —\nThe Old People and the New Government.\nThe Korean Alphabet.\n\nVOLUME IV. PART II. 1913.\nPrice Yen 2.50.\n\nContents: —\nJapanese-Korean Relations after the Japanese Invasion of Korea in the 16th Century.\nThe Village Gilds of Old Korea.\nCoinage of Old Korea.\nMinutes of Important Meetings.\n\nVOLUME IV. PART III. 1913.\nPrice Yen 2.50.\n\nContents: —\nMarriage Customs of Korea.\nSelection and Divorce.\nThe Celestial Planisphere of King Yi Tai-Jo.\n\nVOLUME V. PART I only. 1914.\nPrice Yen 2.50.\n\nContents: —\nSome Recent Discoveries in Korean Temples and their Relationship to Early Eastern Christianity.\nA Plea for the Investigation of Korean Myths and Folklore.\nCatalogue.\n\nVOLUME VI. PART I. 1915.\nPrice Yen 2.50.\n\nContents: —\nThe History of Korean Medicine.\nAfforestation in Korea.\nMinutes of Annual Meeting.\nReport of the Council.\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VI. PART II. 1915.\nPrice Yen 2.50.\n\nContents:—\nThe Pagoda of Seoul.\nHunting and Hunter's Lore in Korea.\n\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VII. PART I. 1916.\nPrice Yen 2.50.\n\nContents:—\nGold Mining in Korea.\n\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VIII.\nPrice Yen 2.50.\n\nContents:—\nIntroduction to the Study of Buddhism in Corea.\n\nAppendix:—\nOfficers.\nList of Members.\nCatalogue of Publications.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko09roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 170, "total-input-tokens": 251012, "total-output-tokens": 51817, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 416, 5], [416, 416, 6], [416, 2209, 7], [2209, 4316, 8], [4316, 6501, 9], [6501, 8670, 10], [8670, 10864, 11], [10864, 13056, 12], [13056, 15177, 13], [15177, 17385, 14], [17385, 19624, 15], [19624, 21798, 16], [21798, 23931, 17], [23931, 26089, 18], [26089, 28231, 19], [28231, 30369, 20], [30369, 32572, 21], [32572, 33747, 22], [33747, 33858, 23], [33858, 33858, 24], [33858, 33970, 25], [33970, 33970, 26], [33970, 34067, 27], [34067, 34067, 28], [34067, 34173, 29], [34173, 34173, 30], [34173, 34259, 31], [34259, 34259, 32], [34259, 34356, 33], [34356, 34356, 34], [34356, 34483, 35], [34483, 34483, 36], [34483, 34609, 37], [34609, 34609, 38], [34609, 34804, 39], [34804, 34804, 40], [34804, 34898, 41], [34898, 34898, 42], [34898, 35044, 43], [35044, 35044, 44], [35044, 35230, 45], [35230, 35230, 46], [35230, 35389, 47], [35389, 35389, 48], [35389, 35539, 49], [35539, 35539, 50], [35539, 35679, 51], [35679, 35679, 52], [35679, 35777, 53], [35777, 35777, 54], [35777, 35887, 55], [35887, 35887, 56], [35887, 35985, 57], [35985, 35985, 58], [35985, 36094, 59], [36094, 36094, 60], [36094, 36225, 61], [36225, 36225, 62], [36225, 36338, 63], [36338, 36338, 64], [36338, 36440, 65], [36440, 36440, 66], [36440, 36561, 67], [36561, 36561, 68], [36561, 36721, 69], [36721, 36721, 70], [36721, 36842, 71], [36842, 36842, 72], [36842, 36962, 73], [36962, 36962, 74], [36962, 38418, 75], [38418, 40453, 76], [40453, 42093, 77], [42093, 43419, 78], [43419, 44641, 79], [44641, 45603, 80], [45603, 46903, 81], [46903, 48156, 82], [48156, 49366, 83], [49366, 50421, 84], [50421, 51684, 85], [51684, 52828, 86], [52828, 54210, 87], [54210, 55003, 88], [55003, 55985, 89], [55985, 57053, 90], [57053, 58137, 91], [58137, 59183, 92], [59183, 60210, 93], [60210, 61132, 94], [61132, 62010, 95], [62010, 62543, 96], [62543, 62710, 97], [62710, 62710, 98], [62710, 64772, 99], [64772, 66847, 100], [66847, 68860, 101], [68860, 68860, 102], [68860, 70600, 103], [70600, 70949, 104], [70949, 72747, 105], [72747, 74919, 106], [74919, 77066, 107], [77066, 79185, 108], [79185, 81308, 109], [81308, 83369, 110], [83369, 85520, 111], [85520, 87625, 112], [87625, 89757, 113], [89757, 91921, 114], [91921, 94078, 115], [94078, 96094, 116], [96094, 98278, 117], [98278, 100429, 118], [100429, 102525, 119], [102525, 104649, 120], [104649, 106747, 121], [106747, 108893, 122], [108893, 111059, 123], [111059, 113171, 124], [113171, 115340, 125], [115340, 117489, 126], [117489, 119637, 127], [119637, 121821, 128], [121821, 124011, 129], [124011, 126216, 130], [126216, 128359, 131], [128359, 130514, 132], [130514, 132621, 133], [132621, 134265, 134], [134265, 136043, 135], [136043, 138201, 136], [138201, 140432, 137], [140432, 142662, 138], [142662, 144768, 139], [144768, 146951, 140], [146951, 149187, 141], [149187, 151430, 142], [151430, 153604, 143], [153604, 155812, 144], [155812, 157942, 145], [157942, 160020, 146], [160020, 162197, 147], [162197, 164314, 148], [164314, 166523, 149], [166523, 168725, 150], [168725, 170881, 151], [170881, 172992, 152], [172992, 175151, 153], [175151, 176531, 154], [176531, 176892, 155], [176892, 178325, 156], [178325, 180039, 157], [180039, 181846, 158], [181846, 182667, 159], [182667, 183617, 160], [183617, 184159, 161], [184159, 184159, 162], [184159, 184159, 163], [184159, 184159, 164], [184159, 184159, 165], [184159, 184159, 166], [184159, 184159, 167], [184159, 184159, 168], [184159, 184159, 169], [184159, 184159, 170]], "primary_language": ["None", "en", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "ja", "None", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, true, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, true, false, true, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]