[{"id": "4af32f5d4513ef30c9b4f0e47ff0f3251434a748", "text": "Campbell 2.d.3\nROYAL ASIATIC SOCIETY\n\nOF\n\nGREAT BRITAIN AND IRELAND.\n\nFROM THE AUTHOR. JUNE 9, 1878\n\nON THE\n\nNON-ARYAN LANGUAGES OF INDIA.\n\nBY\n\nE. L. BRANDRETH, Esq.\n\nJAN., 1878.\nMESSRS. TRÜBNER & Co. respectfully solicit orders for all classes of Publications connected with the History, Antiquities, Geography, and Languages of the East, published abroad. Messrs. Trübner & Co. have established agencies in all parts of the East, of Europe, and America, and are thus enabled to furnish such publications with as little delay as possible, and at moderate prices.\n\nAuthors desirous of printing their own books may be furnished with Specimens, and Estimates for Paper, Printing, and Binding, and every facility will be afforded them, if works are intended for publication, or bringing the same advantageously before the public.\n\n**AHLWARDT.**—The Diváns of the Six Ancient Arabic Poets, Ennábiga, 'Antara, Tarafa, Zuhair, 'Algama, and Imru'lqais; chiefly according to the MSS. of Paris, Gotha, and Leyden, and the collection of their Fragments; with a complete list of various readings of the Text. Edited by W. Ahlwardt, Prof. of Oriental Languages at the University of Gießwald. 8vo. pp. xxx. and 340. sd. 12s.\n\n**ALABASTER.**—The Wheel of the Law: Buddhism illustrated from Siamese Sources by the Modern Buddhist, a Life of Buddha, and an account of the Phra Brat. By Henry Alabaster, Esq. Demy 8vo. pp. lviii. and 324. 14s.\n\n**BALLANTYNE.**—Elements of Hindi and Braj Bháká Grammar. By the late James R. Ballantyne, LL.D. 2nd Edition, revised and corrected. Cr. 8vo. cl., pp. 44. 5s.\n\nFirst Lessons in Sanskrit Grammar; together with an Introduction to the Hitopadésa. 2nd Edition, 2nd Impression. By James R. Ballantyne, LL.D. 8vo. cl. pp. viii. and xxi. 3s. 6d.\n\n**BEAL.**—Travels of Fah Hian and Sung-Yun, Buddhist Pilgrims from China to India (400 A.D. and 518 A.D.). Translated from the Chinese by S. Beal, B.A. Trinity College, Cambridge. Cr. 8vo. cl. pp. lxxiii. and 210, with Map. 10s. 6d.\n\nA Catena of Buddhist Scriptures from the Chinese. By S. Beal, B.A., etc. 8vo. cl. pp. xiv. and 436. 15s.\n\nThe Romantic Legend of Sákhya Buddha. From the Chinese-Sanscrit by the Rev. Samuel Beal. Cr. 8vo. cl. pp. 400. 12s.\n\n**BEAMES.**—A Comparative Grammar of the Modern Aryan Languages of India (to wit), Hindi, Panjabi, Sindhi, Gujarati, Marathi, Oriya, and Bengali. By John Beames, Bengal C.S., M.R.A.S., etc.\n\nVol. I. On Sounds. 8vo. cl. pp. xvi. and 360. 16s.—Vol. II. The Noun and the Pronoun. 8vo. cl. pp. xii. and 348. 16s.\nON THE\n\nNON-ARYAN LANGUAGES OF INDIA.\n\nBY\n\nE. L. BRANDRETH, Esq.\n\nIn the Address delivered by him at the Second International Congress of Orientalists, in 1874, Prof. Max Müller remarks, \"No real advance has been made in the classification of the Non-Aryan Indian dialects since the time when I endeavoured, some twenty years ago, to sum up what was then known on that subject in my letter to Bunsen, 'On the Turanian Languages.'\" A table of the Indian languages is given by Max Müller in that most popular work of his, eight editions of which have already been published, the Lectures on the Science of Language. A very few lines are devoted to these languages in the Lectures: for further particulars we are referred to the above-mentioned letter on the Turanian languages. Some important materials, however, for the study of the Indian languages, have been collected since that letter was published; and it is evident that, if Max Müller had had those materials before him, he would have written about the languages of India in some respects very differently. He would not, for instance, have remarked, regarding that enormous number of languages on our northern and eastern frontiers which he calls Sub-Himalayan and Lohitic, that, \"with the exception of the Naga dialects, none distinguishes the persons of the verb by either affixes or prefixes;\" because many other languages besides the Naga do thus distinguish the persons of the verb, and in some of them the structure of the verb is of the most com-\nplex description; and, further, though we have not, as yet, the materials for making anything but a provisional classification of these languages, yet one or two of what appear to me to be errors in Max Müller's classification may be corrected. Sarpa, for instance, is a mere dialect of Tibetan, and Changlo is very closely related; and yet Tibetan, Sarpa, and Changlo are all three placed in separate subdivisions. Burmese again, which is not classed with Tibetan, is certainly more like Tibetan than it is to some of the languages, such as Dhimal and Kachari, with which it is classed. Further, I think a more detailed classification than Max Müller's may with advantage be adopted, by dividing these languages into subclasses based upon differences of verbal structure or other characteristics.\n\nMy object in this paper is to give a brief sketch of the different groups into which the non-Aryan languages of India may be formed, derived from more recent materials than those which were available to Max Müller. These materials are described by Mr. Cust in certain communications made by him to the Philological Society, and published in the two last Annual Reports of that Society. Some of the books referred to he procured from India, as they were not to be had in this country. Another object I have in view is, to call attention to the very little that, after all, is known of most of these Indian languages, in the hope that, if the necessity for further investigation is prominently noticed by such a Society as the Asiatic, scholars in India may be moved to do something to that end. It is not to our credit that so little on the whole should be known of the languages spoken by our non-Aryan fellow-subjects in India, or by those non-Aryans on the immediate frontiers of British India with whom our officers are frequently brought in contact. The Dravidian group, as was to be expected from its importance, has received the most attention; yet, even here, much remains to be done. It is supposed that this group extends almost continuously from Cape Comorin to the Ganges. The most northerly member of the group is supposed to be the Rajmahali; but we have only a very meagre vocabulary of the language, and\nthough it is spoken within a few hours' rail of Calcutta, we know nothing whatever of its grammar. Much less attention has been paid to the other South-Indian group, the Kolarian. Of the Savara, for instance,—the Sabarae of Ptolemy, a language which was considered of sufficient importance to be marked by a separate colour on the language map which accompanies the Madras Census Report,—we have only a very imperfect vocabulary. From this vocabulary it appears probable, but by no means certain, that the Savara belongs to the Kolarian group; but no sketch has been vouchsafed of its grammar. Of most of the other languages also of this group it is very little that we know. Of the numerous languages, again, on our northern and eastern frontiers, there is not one in twenty of the grammar of which we know anything at all.\n\nThe language map which accompanies this paper has been prepared from the best information I could get up to the present time, though doubtless the boundaries and positions of the languages are not in all cases exactly described. At the end of the paper I have given a table of all the languages and dialects of which (so far as I know) vocabularies have been published.\n\nI will commence with the Dravidian group. The Dravidian are the principal languages of the South of India, and are spoken by about 46 millions of people. Twelve languages are distinguished by Caldwell, viz. Tamil, Malayalam, Telugu, Canarese, Tulu, Kudagu, Tuda, Kota, Gond, Khond, Oraon, Rajmahal. In the Dravidian group there is a rational and an irrational gender of the nouns, which is distinguished, in the plural of the nouns, and sometimes in the singular also, by affixes which appear to be fragmentary pronouns; by corresponding pronouns, and by the agreement of the verb with the noun, the gender of the verb being expressed by the pronominal suffixes. To give an instance of verbal gender, we have in Tamil from root sey 'to do,' seyd-an 'he (rational) did'; seyd-al 'she (rational) did'; seyd-adu 'it (irrational) did'; seyd-ar 'they (the rationals) did'; seyd-a 'they (the irrationals) did'; the full pronouns being avan 'he,' aval 'she,' adu 'it,' avar 'they,' avei 'they.'\nThis distinction of gender, though it exists in most of the languages, is not always carried out to the extent that it is in Tamil. In Telugu, Gond, and Khond it is preserved in the plural, but in the singular the feminine rational is merged in the irrational gender. In Gond the gender is further marked by the noun in the genitive relation taking a different suffix, according to the number and gender of the noun on which it depends. In Oraon the feminine rational is entirely merged in the irrational gender, with the exception of the pronoun, which preserves the distinction between rationals and irrationals in the plural; as, *as* ‘he,’ referring to a god or a man; *ad* ‘she,’ or ‘it,’ referring to a woman or an irrational object; but *ar* ‘they,’ applies to both men and women; *abrá* ‘they,’ to irrationals only. The rational gender, besides human beings, includes the celestial and infernal deities; and it is further subdivided, in some of the languages, but in the singular only, into masculine and feminine. An instance of this subdivision in the Tamil verb was given above.\n\nThe grammatical relations in the Dravidian, as in most, but by no means in all, the non-Aryan languages, are generally expressed by suffixes. Many nouns have an oblique form, which is a remarkable characteristic of the Dravidian group; still, with the majority of nouns the postpositions are added directly to the nominative form. Other features of this group are the frequent use of formatives to specialize the meaning of the root; the absence of relative pronouns and the use instead of a relative participle, which is usually formed from the ordinary participle by the same suffix as that which Dr. Caldwell considers as the oldest sign of the genitive relation; the adjective preceding the substantive; of two substantives the determining preceding the determined; and the verb being the last member of the sentence. There is no true dual in the Dravidian languages, and the instance quoted by Caldwell of *nám* in Oraon as meaning ‘we two,’ does not seem correct, as, according to Flex’s grammar, it is the inclusive plural of the pronoun. In the Dravidian languages there are two forms\nof the plural of the pronoun of the first person, one including, the other excluding, the person addressed. As regards the verbs, there is a negative voice, but no passive voice, and there is a causal form. Grammatical categories and relations are sometimes expressed by a modification of the root, instead of by affixes; for instance, in Tamil, as pointed out by Caldwell, the final sonant is changed into a surd, and doubled, to convert an intransitive into a transitive verb, to form the preterite tense, to form derivative nouns from verbal themes, and to change a substantive into an adjective. Similar changes also take place in the other languages, though not quite to the same extent. Then there are changes of the initial consonant of the second of two nouns in juxtaposition, showing their relations, some of which resemble the mutation of consonants in Keltic grammar. Thus, in Canarese and Telugu, as in Welsh, an initial surd is changed into a sonant to show that the preceding noun is in the genitive relation; as in Telugu poetry, *puli doka* ‘a tiger’s tail,’ which translated literally into Welsh would be *teigr-gynffon*; the radical forms being *toka* and *cynffon*, both signifying ‘a tail.’ Nor are root-vowels unchangeable. There are instances of the lengthening of the root-vowel to convert a verb into a noun, without any extraneous addition; of the shortening of the root-vowels of the pronouns of the first and second person in the oblique form; and there is the Tamil and Canarese shortening of the root-vowel in the preterite tense.\n\nNext to the Dravidian, and also south of the Vindhya, we have the Kolarian, a much smaller group, which probably does not include more than two millions of people, though ethnologically the group is very much larger. The principal members of this group appear to be the Santáli, Mundári, Ho, Bhumij, Korwa, Kharria, Juang, Kurku, and probably Savara; some of these are not distinguished from each other by more than dialectal differences. The Juangs are isolated amidst an Uriya-speaking Aryan population; they disclaim all connexion with the Hos or other Kolarians; and yet they have preserved a remarkable number of common words. The Kurkus of the Central Provinces are separated by a distance\nof 300 or 400 miles from the main body of the Kolarians; and yet the Kurku is hardly more than a dialect of the Santáli, showing, as will also be seen to be the case as regards several dialects in other groups, that there is, by no means of necessity, a rapid divergence of Turanian dialects, as has been generally supposed, in consequence of their isolation. The Kolarian group has both the cerebral and dental row, and also aspirated forms, which last, according to Caldwell, did not belong to early Dravidian. There is also a set of four sounds, which are perhaps peculiar to Santáli, called by Skrefsrud semi-consonants, and which, when followed by a vowel, are changed respectively into \\( g, j, d \\) and \\( b \\). Gender of nouns is animate and inanimate, and is distinguished by difference of pronouns, by difference of suffix of a qualifying noun in the genitive relation, and by the gender being denoted by the verb. As instances of the genitive suffix, we have in Santáli *in-ren hopon* ‘my son,’ but *in-ak orak* ‘my house.’ With this may be compared the signs of the genitive relation in Gond, as before alluded to, in the Modern Aryan languages of India, and in the Zulu of South Africa, in all of which a noun in the genitive relation has a different sign according to the gender of the noun on which it depends.\n\nThere is no distinction of sex in the pronouns, but of the animate and inanimate gender. Of the demonstrative pronouns in Santáli, seven end in *i* for the animate, and seven in *a* for the inanimate gender. The dialects generally agree in using a short form of the third personal pronoun suffixed to denote the number, dual and plural, of the noun, and short forms of all the personal pronouns are added to the verb in certain positions to express both number and person, both as regards the subject and object, if of the animate gender; the inanimate gender being indicated by the omission of these suffixes. No other group of languages, apparently, has such a logical classification of its nouns, as that shown by the genders of both the South Indian groups. The genitive in the Kolarian group of the full personal pronouns is used for the possessive pronoun, which again takes all the post-positions, the genitive relation being thus indicated by the\ngenitive suffix twice repeated. The Kolarian languages generally express grammatical relations by suffixes, and add the postpositions directly to the root, without the intervention of an oblique form or genitive or other suffix. They agree with the Dravidian in having inclusive and exclusive forms for the plural of the first personal pronoun, in using a relative participle instead of a relative pronoun, in the position of the governing word, and in the possession of a true causal form of the verb. They have a dual which the Dravidians have not, but they have no negative voice. Counting is by twenties, instead of by tens, as in the Dravidian.\n\nThe Santáli verb, according to Skrefsrud, has 23 tenses, and for every tense two forms of the participle and a gerund. The root is the future, and the various tense signs are suffixed thereto. The verb, by incorporating the short forms of the pronouns, expresses number and person of both an animate subject and object: thus *Thākur kakai-ko e-dandom-ko-a* 'God sinners will punish.' The pronominal form denoting the subject may be either prefixed or made the last suffixed syllable; that denoting the object is inserted between the tense sign and the following *a*, which is a sort of verbal base, by means of which any part of speech may be used as a verb. In the above instance *dandom* is the root, which signifies 'will punish'; *e* is the pronominal denoting that the subject is animate and singular; *ko* that the object is animate and plural. For the dual the pronominal form is *kin*. If the subject and object in the above example had been inanimate, then both the *e* and *ko* would have been omitted. In Ho and Mundari, the pronominal form which points to the animate subject of the verb often comes both before and after the verb; thus, if a pronoun is the subject, it may be repeated three times: at the beginning of the sentence and before and after the verb. It is very good Mundari to say *Ain ka-in jomtana-in*—'I not—I am-eating—I,' that is, 'I am not eating.'\n\nA peculiar characteristic of the Kolarian group is that there are two forms for each tense. In Santáli these two forms represent the different relations of the objects to the verb—thus we have *ti e-tiar-ad-in-a* 'he stretched the hand\ntowards me'; *tanga e-rech-ked-in-a* 'he took the axe from me.' In these instances *ad* and *ked* are two different forms of the recent past tense, and the pronoun *in* 'me' of the remoter object is incorporated with the verb. In Ho and Mundari, however, the two sets of tense forms are explained in a different way, namely, as serving to distinguish a transitive from an intransitive verb, which is a distinction not made in Santáli. Kolarian grammar apparently recognizes none of the root-changes of the Dravidian, but derivative forms are not always indicated by affixed particles only, but occasionally by infixes—thus in Santáli a noun may be formed by infixing *t*, *p*, or *n* with the same vowel as that of the root, for instance, *ra-pa-j* 'a collection of kings,' from *raj* 'a king'; *u-mu-m* 'immersion,' from *um* 'to bathe.' The reciprocal active voice is formed in a similar manner by the insertion of *p*; thus, *da-pa-l* 'strike together,' from *dal* 'to strike.' Besides its numerous tenses and participles, the Santáli verb has four voices and several moods, and every voice has four forms. The other dialects have not apparently nearly so many verbal forms as the Santáli, but most of them are alike in regard to the most characteristic features of their grammars. Kharria would seem, from Col. Dalton's specimen, to have lost its dual and plural forms; and perhaps the same is the case with Juang, which most resembles Kharria, and of which we have only a bare vocabulary of a few words.\n\nThe two groups of which I have spoken, the Dravidian and Kolarian, are the principal, and probably the only groups of languages south of or included within the limits of the Vindhya mountains. There are, however, many other aboriginal tribes, such as Bhils, Baigás, Boyars, Kaurs, Rautias, and others, that have lost their language, but are generally ethnologically said to belong either to the Dravidian or Kolarian group.\n\nThe non-Aryan languages south of the Vindhya are separated by a very broad belt of Aryan tongues from the non-Aryan languages of our northern and eastern frontiers. The chief group we then come to is what has been called the Tibeto-Burman, from the two principal languages included in\nit—an immense group—the boundaries of which in the present state of our knowledge are very doubtful. It is impossible to give even an approximate number of the speakers included in this group, as many of the languages are either across the frontier or only project a short distance into our own territory. The languages included in this group have not, with perhaps one or two exceptions, both a cerebral and dental row, like the South-Indian languages; some of them have aspirated forms of the surds, but not of the sonants; others have aspirated forms of both. In the languages on the Burmese side there are also sounds like the Persian *khe* and *ghain*, and Burmese has our English *th*. Both the Tibetan and Burmese have characters of considerable antiquity derived from the Sanskrit. The pronunciation of both these languages has greatly changed since these characters were first introduced. In Tibetan, as spoken in Lhasa and Tibet proper, the first member of a compound of consonants is generally not pronounced at all, while many compounds take altogether different sounds; sonants are for the most part pronounced as surds, final *s* is not pronounced, and some other final consonants are hardly heard. In Western Tibet, however, most of the consonants are pronounced as written. In Burmese, on the other hand, the surds are frequently pronounced as sonants; an *r* is pronounced as if it were *y*; some final consonants are mute, or they are often changed into different sounds; the vowel *a* is also pronounced as if it were *ɛ* or *i* before certain final consonants. In Arakan, however, the original pronunciation is more frequently preserved.\n\nThe languages of this group, even those which most diverge from each other, have several words in common, and especially numerals and pronouns, and also some resemblances of grammar. In comparing the resembling words, the differences between them consist often less in any modification of the root-syllable, than in the various additions to the root; thus in Burmese we have *nā* ‘ear,’ Tibetan *rna-ba*, Magar *na-kep*, Newar *nai-pong*, Dhimal *nā-hathong*, Kiranti dialects *nā-pro*, *nā-rēk*, *nā-phāk*, Naga languages *te-na-ro*, *te-na-rang*, Manipuri *na-kong*, Kupui *ka-nā*, Sak *aka-nā*, Karen *na-khu*,\nand so on. It can hardly be doubted that such additions as these to monosyllabic roots are principally determinative syllables for the purpose of distinguishing between what would otherwise have been monosyllabic words having the same sound. These determinatives are generally affixed in the languages of Nepal and in the Dhimal language; prefixed in the Lepcha language, and in the languages of Asam, of Manipur, and of the Chittagong and Arakan hills. Words are also distinguished by difference of tone. The tones are generally of two kinds, described as the abrupt or short, and the pausing or heavy; and it has been remarked that those languages which are most given to adding other syllables to the root make the least use of the tones; and vice versa, where the tones most prevail, the least recourse is had to determinative syllables.\n\nIt is not, however, in words only, but to some extent in grammar also, so far as we have any materials to judge from, that even the most remotely apart languages of the group resemble each other. One of the most prominent points in which such resemblance is found is the use of the formatives \\(pa\\) and \\(ma\\), or modifications of them, as \\(po mo\\), etc., to distinguish sex, and also to form nouns of agency and gentile and other nouns, with distinction of sex; \\(na\\), \\(nu\\) or \\(ne\\), is, however, a common substitute for the feminine \\(ma\\). Thus we have in Tibetan \\(mi-bo\\) ‘man,’ \\(mi-mo\\) ‘woman’; \\(rta-pho\\) ‘horse,’ \\(rta-mo\\) ‘mare’; \\(Bod-pa\\) ‘a man of Tibet,’ \\(Bod-mo\\) ‘a woman of Tibet’; \\(tshong-pa\\) ‘a trader (male),’ \\(tshong-ma\\) ‘a trader (female),’ from \\(tshong\\) ‘trade’; \\(smraba-pa\\) ‘speaker (male),’ \\(smraba-mo\\) ‘speaker (female)’; \\(bazang-po\\) ‘a good man,’ \\(bazang-mo\\) ‘a good woman,’ from \\(bazang\\) ‘good.’ In Bahing \\(ta-wa\\) ‘a son,’ \\(ta-mi\\) ‘a daughter’; \\(apo khlica\\) ‘dog,’ \\(amo-khlica\\) ‘bitch’; \\(ryamni-po\\) ‘adulterer,’ \\(ryamni-mo\\) ‘adultress’; \\(gna-ica\\) ‘old man,’ \\(gna-mi\\) ‘old woman.’ In Burmese \\(krak-pha\\) ‘cock,’ \\(krak-ma\\) ‘hen’; \\(nwā-la\\) ‘bull,’ \\(nwā-ma\\) ‘cow’; \\(mutsho-pho\\) ‘widower,’ \\(mutsho-ma\\) ‘widow’; \\(ashing\\) ‘master,’ \\(ashing-ma\\) ‘mistress’; \\(Mramma\\) ‘a Burmese man,’ \\(Mramma-ma\\) ‘a Burmese woman.’ In Lepcha, \\(hik-bu\\) ‘cock,’ \\(hik-mot\\) ‘hen.’ Again, in Garo \\(áchák-bipha\\) ‘a dog,’ \\(áchák-bima\\) ‘a bitch.\nIn Khyeng khlaung-pa-hto ‘man’; khlaung-na-hto ‘woman.’ In Mru kornga ‘a horse,’ kornga-ma ‘a mare.’ These formations are found more or less in almost all the languages, and even where sex is not distinguished, or we are not told of such distinction, in the short grammatical sketches we possess, pa appears to be often extensively used as a formative, as, for instance, in Lepcha mat-bo ‘a doer,’ from mat ‘to do’; in Mikir kichihang-po ‘a beggar,’ from kichihang ‘to beg’; in the Thado dialect of Kuki kelchingpa ‘a herdsman.’ In Karen some nouns are formed by prefixing pa, as pgha ‘old,’ papgha ‘an elder’; gentile and such-like, by affixing pho, as kaseupho ‘mountaineers,’ from kaseu ‘a mountain.’ In Dhimal ka, in Magar chü, and in the Abor class dak or do, correspond to the adjectival pa or ba of Tibetan and other languages; thus Dhimal minka ‘ripe,’ Magar minchü, Abor mindo, Tibetan sminpa. In some languages a prefixed a is much used as a formative, as in Burmese atsa ‘food,’ from tsa ‘to eat’; in Lepcha achor ‘sour’ from chor ‘to be sour’; in Khyeng amlak ‘love,’ from mlak ‘to love’; in Manipuri asiba ‘hot,’ from saba ‘heat.’\n\nThere is a good deal of resemblance between the postpositions in several languages, and in some of them the same form for the third personal pronoun is used to denote the genitive relation; thus in Baling wainsa á ming ‘the man his wife’; in Lushai tien á ui ‘the friend his dog’; in Karen pghaknyau a htwie ‘the man his dog.’ The postpositions in this group are of two kinds, simple and compound, the first member of the compound being generally the sign of the genitive or dative relation, as in Kachari ni ‘of,’ ni phra ‘from.’ The two South-Indian groups have only generally simple postpositions. In the present group, as the rule, adjectives follow their substantives, and then the postpositions are affixed to the adjectives, and not to the substantives; but, in nearly all the languages, the demonstrative pronouns precede the substantives. In the two South-Indian groups, and also in all the Aryan languages of India, both the adjective and the demonstrative invariably precede the substantive. In the\npresent group the verb comes at the end of the sentence. In general the relative clause is denoted by a relative participle, and the construction of the sentence is, according to our notions, of an inverted character. In these respects the Tibeto-Burman agrees with the two preceding groups. Some of the languages have a negative voice, but in most of them the same separate particle of negation, má, is used. Interrogative sentences are also denoted by what is probably in its origin the same particle, but appears under a greater variety of forms, such as na, ma, am, mo, mon, man. But though the different members of the group resemble each other in some respects, in their grammar as well as in their vocabularies, yet the differences in other respects are very astonishing, and not easily to be accounted for on the supposition of the languages having all had a common origin. While, in many of the languages, the verb has no form to indicate any recognition of the number or person of the noun, in others, again, numerous complicated forms are employed to express the agreement of the verb with both subject and object, and these viewed in every variety of aspect, as singular, dual and plural, and in the case of dual and plural of the first person as including or excluding the persons addressed. Some of these points of difference will be referred to presently.\n\nAn interesting part of the inquiry into the non-Aryan languages always is the extent to which change of root is had recourse to for grammatical expression. Such a change will always be an exception to the general rule of fixed roots; but, in the present group, in regard to many of the languages of which we have only very meagre, if any, specimens of grammar, we must not conclude that they are wanting in exceptions to the general rule, because such exceptions are not mentioned. In many of the languages of the group of which we have anything like adequate details, we meet with such exceptions. Tibetan in particular abounds with them. The formation of the tenses in Tibetan depends, to a great extent, on certain prefixed letters; but, besides these, we have commonly, in transitive verbs, both vowel and consonant\nchanges of the root. For instance, in the past tense, we have generally, with the exception of the labial consonants, for the first consonant a surd; in the present, the corresponding aspirate or sonant; and, in the imperative, the corresponding aspirate. If, further, the past tense has the vowel \\(a\\), then we have frequently \\(e\\) for the vowel of the present, and \\(o\\) for that of the imperative; thus perf. \\(b\\)-kas, pres. \\(h\\)-ges, imperat. \\(khos\\) v.t. ‘to split.’ If, however, the root-vowel is \\(i\\) or \\(u\\), then it remains unchanged in all the tenses, as, for instance, past \\(b\\)-kum, pres. \\(h\\)-gum, imperat. \\(khum\\) v.t. ‘to kill.’ Again, intransitive verbs are usually distinguished from transitive by the aspiration or weakening of the surd of the perf. tense of the transitive verb, as the above-mentioned perf. \\(b\\)-kas v.t. ‘to split’; but perf. gas, pres. \\(h\\)-gas v.i. ‘to split’; there being no change of the initial consonant or vowel change in the intransitive form. If, however, a verb commences with a labial consonant, we have an aspirated surd for the transitive, and an unaspirated sonant for the intransitive form, as perf. phral v.t. ‘to separate’; perf. bral, pres. \\(h\\)-bral v.i. ‘to separate.’ Burmese, on the other hand, not only in regard to labials, but throughout, forms transitives from intransitives by aspirating the initial consonant, as kya ‘to fall down,’ khya ‘to throw down,’ and so on with many others. In Bahing, again, the intransitive form has a sonant for the initial consonant, the transitive a surd, as gikko ‘be born,’ kikko ‘beget’; bokko ‘get up,’ pokko ‘raise up.’\n\nIn some languages a modification of the pronominal suffix of the verb takes place in order to change it from the subject into the object. Thus, in Bahing, khi-ka-mi ‘we quarrel with them,’ khi-ki-mi ‘they quarrel with us.’ In Khyeng, to form the negative voice, besides the insertion of a letter, an initial surd is changed into a sonant, sit-phā-u ‘may go,’ zit-pha-mbu ‘may not go.’ But, as I have said, the few sketches of grammar we have are in general so short that we cannot expect to find in them any account of root-changes when they are merely exceptions to the ordinary rules.\n\nBut though the group itself is a very vague one, many of the languages may easily be subdivided into classes on\naccount of a clear resemblance in most respects; while other languages it will be convenient to consider under classes, on account of special points of resemblance. As Class I. I will distinguish the Kachari, Garo, Pani-Koch, Deori-Chutia and Tipura. It is more decidedly Indian—being well within our frontier—than most of the other classes, which are rather on and over the frontier. The languages composing this class are hardly separated from each other by more than dialectal differences. They are spread over a considerable tract of country from the Kachari in the north of Assam to the Tipura in the south part of the Chittagong district; and yet the Tipura in the south, though so far away from the Kachari, and completely isolated from it, bears the closest resemblance to it. The Kacharis form the principal part of the aboriginal population of Assam. The Garos are also an important tribe. The Pani-Koch are few in number; but if, as has been supposed, this was the original language of the great Koch tribe, then we have here the remnant of the language formerly spoken by a great part of the population of Northern Bengal. The Deori-Chutia is also spoken by a very small number; but it appears highly probable that this is the original language of the Chutias, a very important tribe in Assam. This class is of the simple type as regards the verb, which has no number or person; thus, in Kachari, áng thango ‘I go,’ nang thango ‘thou goest,’ bi thango ‘he goes,’ jang thango ‘we go,’ etc. The principal postpositions are identical in all the languages. There is a peculiarity about the comparison of adjectives which is hardly found in the other languages, either Aryan or non-Aryan, of India, namely, that a particle of comparison follows the adjective, as in Kachari bi-ni gedet chin ‘greater than him,’ where the particle chin comes after the adjective gedet ‘great.’ What are called generic particles are extensively used in these languages, that is to say, nothing is numbered without some particle being added to classify the thing numbered, and such classes are very numerous, as in Kachari máanse sá bá ‘man genus five,’ phitái thai bá ‘fruit genus five.’ The first personal pronoun has a different form for the plural, as in Kachari áng ‘I,’ jang\n'we'; in Garo angá 'I,' chingá 'we.' The plural of the other pronouns is formed by plural affixes.\n\nAs Class II. I take the Tibetan, including such dialects as Sarpa, Lhopa and Changlo. Some account of the Tibetan verb has already been given. In Tibetan, not only the adjective, but the demonstrative pronoun also, follows the substantive; a distinction may be made between 'he' and 'she,' namely, kho-pa 'he,' kho-ma 'she,' and, with a transitive verb, the agent is required to be in the instrumental case, so to call it. Class III., Gurung, Murmi, Thaksha, Newar, Pahri, Magar, in fact, all those languages of Nepal, which, like the Tibetan, are said to be of the simple type, the verb having no suffixes of number or person. Murmi, however, is but a dialect of Gurung, and Newar and Pahri are also very closely related to each other. The languages of Nepal generally have all a considerable proportion of Tibetan words, but they differ from the Tibetan, and agree with the Arakan hill languages, and, in fact, with most of the other languages of the group, in regard to other words, showing a special connexion with those distant languages, independently of the Tibetan. To give an instance or two, li, or with prefixes pli, meli, etc., is the numeral 'four' in most of the other languages, but it is b-zhi in Tibetan; or, again, lung 'a stone' in the other languages, but z-do in Tibetan. In Magar, the adjective precedes the substantive, which is an exception to the general rule; but this perhaps is owing to the influence of the Hindi, this language being full of Hindi words. Class IV. the Lepeha only. This agrees with the preceding class in having the simple structure of the verb, and differs in its use of determinative prefixes instead of affixes. In Lepeha, also, not only the adjective, but the demonstrative pronoun, as in Tibetan, follows the substantive. It has also for its nouns a dual affix nyum, and two plural affixes, sang used chiefly for human beings, pang for irrational objects only. It has a definite article re which comes after the noun, and takes m as the sign of the accusative relation; thus pano re 'the king,' acc. pano rem. The same suffix marks the accusative relation of the personal pronouns. There is some agreement as regards the\nm suffix, as will be seen, with the next class. As Class V. may be placed the Dophla, Miri, and Abor, three languages which closely resemble each other. They are of the simple type. A characteristic of this class is that the accusative and genitive relation of a noun are expressed by suffixing a single consonant without a vowel; as, in Dophla, no ‘thou,’ nom ‘thee,’ nog ‘of thee’; ou ‘a house,’ gen. oug, acc. oum. The plural of the pronouns has the same base as the singular; and is formed by an affixed plural sign. The plural of no is no-lu. These languages have often a prefixed vowel, which is not found in the corresponding words of the other languages; for instance, Tibetan khyi ‘dog,’ Burmese khwe, but Dophla eki, Miri ekye, Abor eki, and in many other words. Class VI., the Aka, is an independent member of the group. The vocabulary of this language, given by the Rev. N. Brown, the well-known missionary, in 1837, makes the Aka have 47 per cent. of Abor words; but this is not the case; he has evidently mistaken Aka for Dophla. The Aka proper, as shown by more recent lists of words, has but the faintest, if any, resemblance to that class, notwithstanding that the Akas are such near neighbours of the Dophlas. The connexion of the Aka is rather with the languages south of the Brahmaputra, though it cannot be classed with any of them. In the Aka, mi is the usual affix denoting the female sex, as nyu ‘brother,’ nümi ‘sister’; sau ‘son,’ sami ‘daughter’; kissiglo ‘he-goat,’ kissimi ‘she-goat.’ Class VII., the Mishmi. There are three principal tribes, the Chulikota, the Taying, and the Mijhu; and the languages, though clearly enough belonging to the same class, are much further apart than mere dialects. These languages are especially remarkable for the compound consonants at the beginning of words, many of them being the same compounds that are no longer pronounceable by the majority of the Tibetans, such as in Taying mitho ‘body,’ mgrung ‘foot,’ mgah ‘near,’ proi ‘copper,’ khro ‘cry,’ or in Mijhu klau ‘flower,’ krep ‘laugh,’ gro ‘raise,’ glok ‘back,’ bli ‘house.’ None of these words, however, appear to be Tibetan.\n\nThe classes hitherto mentioned have all the simple structure of the verb, nothing being added for number or person.\nClass VIII. I will call the Dhimal alone. Here we meet with apparently the first step towards the complex structure. We have the pronoun coming after the verb; *lekhi ká* 'come I'; *lekhi ná* 'comest thou'; *lekhi wá* 'comes he,' *lekhi kyel* 'come we,' etc. Here *khi* is the sign of the present tense. The first and second personal pronouns, generally, but not always, come before as well as after the verb, as *ká lekhi ká*, *ná lekhi ná*, etc. Here, therefore, the last is a sort of person ending of the verb. The pronoun of the third person may come either before or after, but not both. Dhimal is further characterized by a sort of inflexion in the declension of the pronouns; thus *ká* 'I' has for dat. and acc. *kéng*, gen. *káng*, nom. plur. *kyel*. Another characteristic of Dhimal is that the demonstrative pronouns have different forms according as they refer to an animate or inanimate object; *idong* 'this' and *udong* 'that,' referring to animate, *iti* and *uti* to inanimate objects.\n\nClass IX, Kanáwari and Bunan. Here we have the person endings with little resemblance to any existing form of the pronoun; thus, in the Milchan dialect of Kanáwari, the present tense of *bi* 'go' is sing. 1. *bitu-k*, 2. *bito-n*, 3. *bit-o*; plur. 1. *bit-e*, 2. *bit-en*, 3. *bit-e*, pronominal endings which bear little resemblance to the pronouns *gos* 'I,' *kás* 'thou,' *nos* 'he,' *kishang* 'we,' *kina* 'ye,' *nogonda* 'they.'\n\nBunan is spoken in part of Lahaul, and is the same language as the Tibarskad, one of the Kanáwari dialects. The same language thus exists in two provinces separated from each other by a considerable extent of country, in part of which pure Tibetan, and in the other part Hindi, is spoken. This is another of several instances we have in India of languages which do not alter, or alter very slightly, though spoken in different and distant parts of the country. This class has a very large per-cent-age of Tibetan words, and yet, as we have seen, an entirely different structure of the verb. The original pronunciation of many Tibetan words, which has been lost in Tibet proper, is often preserved more completely in Kanáwari; thus Milchan *skara*, Tibetan *skarma* pronounced *karma*, 'a star.' Milchan *kra*, Tibetan *skra* pronounced *sha*, 'hair.' Milchan *pya*, Tibetan *bya* pronounced *cha*, 'a bird.' Or in\nTibarskad *brao*, Tibetan *brabo* pronounced *tavo*, ‘buckwheat.’\nTibarskad *brul*, Tibetan *sbrul* pronounced *dul*, ‘a snake.’\n\nWe now come to several languages which I will place together as Class X., not because it is warranted by any close resemblance of their vocabularies, but because they are all said to have a similarly complex structure of the verb. These are Kiranti, Limbu, Sunwar, Brámu, Chepang, Vayu, Kusunda. Limbu, however, is but a dialect of Kiranti, and Vayu and Chepang have several words in common. We have outline grammars of only two of the languages. To give some idea of the complex structure of a verb of this class, expressing agreement with both subject and object, I take the following specimen of the conjugation of part of the present tense of a verb in the Baling dialect of the Kiranti:\n\nAfter No. I. in the subjoined table there should come nine more forms for the second personal pronoun as subject, and nine others for the pronoun of the third person as subject. Then reversing this arrangement, we have a corresponding set of forms, the first portion of which is shown in No. II. of the table, for the pronoun of the third person as subject, and all the pronouns as objects. Then, again, there are eighteen forms for the relation of the first and second personal pronouns as subjects and objects, making in all what ought to be eighty-four forms for the number and person endings of each tense,\n\n| I find them two | we two find them two |\n|-----------------|----------------------|\n| *ta-gpa-si*     | *ta-gpa-si*          |\n| incl.           | excl.                |\n\n| I find (him)    | we two find (him)    |\n|-----------------|----------------------|\n| *ta-gpa-si*     | *ta-gpa-si*          |\n| incl.           | excl.                |\n\n| (he) finds me   | they two find me     |\n|-----------------|----------------------|\n| *ta-yi-si*      | *ta-yi-si*           |\n| incl.           | excl.                |\n\n| (he) finds us   | they two find us     |\n|-----------------|----------------------|\n| *ta-yi-si*      | *ta-yi-si*           |\n| incl.           | excl.                |\n\n| I find them two | we two find them two |\n|-----------------|----------------------|\n| *ta-gpa-mi*     | *ta-gpa-mi*          |\n| incl.           | excl.                |\n\n| I find (him)    | we two find (him)    |\n|-----------------|----------------------|\n| *ta-gpa-mi*     | *ta-gpa-mi*          |\n| incl.           | excl.                |\n\n| (he) finds me   | they two find me     |\n|-----------------|----------------------|\n| *ta-yi-mi*      | *ta-yi-mi*           |\n| incl.           | excl.                |\n\n| (he) finds us   | they two find us     |\n|-----------------|----------------------|\n| *ta-yi-mi*      | *ta-yi-mi*           |\n| incl.           | excl.                |\n\n| I find them two | we two find them two |\n|-----------------|----------------------|\n| *ta-gpa-so*     | *ta-gpa-so*          |\n| incl.           | excl.                |\n\n| I find (him)    | we two find (him)    |\n|-----------------|----------------------|\n| *ta-gpa-so*     | *ta-gpa-so*          |\n| incl.           | excl.                |\n\n| (he) finds me   | they two find me     |\n|-----------------|----------------------|\n| *ta-yi-so*      | *ta-yi-so*           |\n| incl.           | excl.                |\n\n| (he) finds us   | they two find us     |\n|-----------------|----------------------|\n| *ta-yi-so*      | *ta-yi-so*           |\n| incl.           | excl.                |\n\n| I find them two | we two find them two |\n|-----------------|----------------------|\n| *ta-gpa-khi*    | *ta-gpa-khi*         |\n| incl.           | excl.                |\n\n| I find (him)    | we two find (him)    |\n|-----------------|----------------------|\n| *ta-gpa-khi*    | *ta-gpa-khi*         |\n| incl.           | excl.                |\n\n| (he) finds me   | they two find me     |\n|-----------------|----------------------|\n| *ta-yi-khi*     | *ta-yi-khi*          |\n| incl.           | excl.                |\n\n| (he) finds us   | they two find us     |\n|-----------------|----------------------|\n| *ta-yi-khi*     | *ta-yi-khi*          |\n| incl.           | excl.                |\nbut they are not all complete, and they occasionally run into each other, as when the same pronoun is both subject and object. It will be observed from the examples above given that the pronominal of the third person, when expressed, is always the last member of the compound, whether it represents the subject or object of the verb, and that it is unchanged in form; and whether it is to be regarded as expressing the subject or object, depends upon the form of the preceding suffix. These pronominal suffixes are in most cases evidently abridgments of the full forms of the pronouns.\n\nThere are eleven conjugations, but all the changes are limited to the singular of the indicative. The participles incorporate the pronominals, just like the other parts of the verb, and are for the most part constituted by adding a formative to the tense forms; thus the present verbal participle is tāgnana 'I finding him,' the relative tāgnane 'the one that I find.' The dual and plural suffixes of the first and second pronouns are different from those of the third pronoun and of the noun; thus, ga 'thou,' gasi 'you two,' gani 'you'; wainsa 'man,' wainsadasi 'two men,' wainsada 'men.' In the Vayu language the structure of the verb differs from that of the Bahing in this respect, that it can express the dual and plural of either the subject or the object, but not of both. If it is the case that all the languages referred to in this group have a common origin, including both those which have the elaborate conjunctive arrangement of the class just mentioned, and those which have the simple structure, the mere juxtaposition of pronoun or noun and verb, we can hardly suppose that the complex system was once common to all, and that while some languages have retained it, others have so completely thrown it off as to leave not a trace behind. It seems more probable that the wild tribes who speak the languages of Class X. should have developed this system in the seclusion of the valleys or hills to which they betook themselves when they separated from the common stock. There are several other non-Aryan tribes in Nepal who speak, for the most part, dialects of Hindi which I shall not mention, with one exception, the Kuswar, which has preserved\ntraces of a grammar unlike that of any of the languages before mentioned in that it suffixes a possessive pronominal to the noun. In this respect, therefore, the Kuswar resembles the Altaic languages; for instance, *baba-im* 'my father,' *baba-ir* 'thy father,' *baba-ik* 'his father.' The same pronominal forms are also incorporated with the verb to express both subject and object, as *thatha-im-ik-an* 'I strike him or it.' The detached forms of the pronouns, on the other hand, are almost pure Hindi. This language, however, can hardly be classed as non-Aryan without further particulars.\n\nThe languages so far mentioned, with the exception of Class I., have been all along our northern frontier. South of the valley of Asam we meet with a number of tribes called Naga; but as this is a foreign name, it does not necessarily mean that they are allied either in race or languages; indeed, it is impossible to include them all in the same class. The Angámi, for instance, is very far removed from most of the other Naga languages. I propose to divide them into three classes. Class XI., the Namsang, etc. The Namsang is remarkable for having person endings of the verb, but no number endings, person endings being the same both for the sing. and the plural. The sign for the past tense *t* is affixed for the future *i* prefixed; for instance, for the past tense of the verb *thien* 'to put,' 1. *thien-t-ak* 'I or we did put,' 2. *thien-t-o*, 3. *thien-t-á*; for the future, 1. *i-thien-ang*, 2. *i-thien-o*, 3. *i-thien-á*. The Namsang, again, has possessive pronouns which differ both from the full personal pronouns and the verbal suffixes. In this class may also be included the Banpará and the Tablung; at least, they all three resemble each other in their vocabularies more than they do any of the other Nagas, but we have no grammars by which to judge them any further. All three, however, distinguish the sex of animals by modifications of the same affixes, the names for male and female being *pong* and *nyong*, *pang* and *hunu*, *apang* and *anyuk*, for the three languages respectively. Again, *sikau* and *sikah* are the words for 'woman' in Banpará and Tablung, and are further applied to distinguish sex, as Banpará *sikau hosa* 'daughter,' Tablung *sikah nahah* 'daughter.' Again, in Namsang and Banpará,\npa and ma are frequently affixed to nouns as determinatives. All three languages have modified forms, namely ma, m, and man respectively, of the same plural termination for the pronouns.\n\nClass XII., the Khari, Nougong, Tengsa, and Lhota Nagas. Nougong and Tengsa are related as dialects, Khari further away, and Lhota still further. The verb in these languages is apparently of the simple type. The Nagas of this and the preceding class are all to the east of the Doyang River. Class XIII., the Angámi, etc. There is a wide difference between the Angámi and the before-mentioned Nagas. Very few words correspond. To the same class also may perhaps be referred the Arung and the Rengma. These languages are more like the Angámi than they are to the other Nagas, though the likeness is not strong, nor are they very like each other. The Angámi and the Arung have the simple structure of the verb. Of the Rengma verb I have not found any specimen. The Kutcha Naga is nearly the same as the Arung. The Nagas of this class are west of the Doyang. Most of the Naga languages have as many names given them as there are lists of words; thus the Banpará is called also Seebsaugor, Abhay Purya, and Joboka, in different lists. The Namsang is called also Jaipuria and Luckimpore, and so on with others. To this same class must also be referred at least two of what are called the hill tribes of Manipur, namely, Líyang and Marám, which are more nearly allied to the Arung Naga than to the Manipuri language. Class XIV., the Míkir, is a neighbour of the Nagas, and has many words in common with some of them, especially with the Namsang, and, like the Namsang, it has no sign for the genitive relation, which is signified solely by position, the noun in that relation coming first. The Míkir verb, however, differs entirely from the Namsang; it has no person ending, but the simple structure, as ne cho ‘I eat,’ ali cho ‘we eat.’\n\nTo the east of the Nagas we have Class XV., the Singpho, who are comparatively recent settlers in Asam. Other settlements of them are on the hills to the east of Bhamo, and in\nthe western part of Yunan, where they are called Kakhyens, the Kakhyen and Singpho languages being nearly the same thing. The Singpho verb is of the simple type. The negative verb is formed by prefixing \\( n \\) to the initial consonant; \\( n \\) is also prefixed to some words as a determinative; for instance, \\( nlung \\) ‘a stone,’ \\( lung \\) and \\( long \\) in other languages; \\( ntsin \\) ‘water,’ Manipuri \\( ishing \\). Singpho has many words in common with both Burmese and Manipuri.\n\nThe principal language of our eastern frontier is Class XVI., Burmese, as Tibetan is of our northern. It can hardly be doubted that they both belong to the same group. Many of the combinations of initial consonants are the same in both languages; but the pronunciation has not altered so much in Burmese as in Tibetan. An initial \\( s \\) in Tibetan followed by another consonant often corresponds to the aspirated form of the consonant in Burmese, as Tibetan \\( stong \\) ‘a thousand,’ Burmese \\( htaung \\); Tibetan \\( sna \\) ‘nose,’ Burmese \\( hna \\). Tones are much used in Burmese, whereas they are but little heard in Tibetan, and only, I believe, in part of Tibet; but then Burmese has not the determinative syllables or letters of the Tibetan, for which the tones are the substitutes. The Burmese verb has no person endings, but it has a plural suffix \\( kra \\), thus \\( gna thwa-thi \\) ‘I go,’ \\( gnado thwa-kra-thi \\) ‘we go.’ With the numerals in Burmese a great many generic particles are used.\n\nThe principal languages of Class XVII. are the Manipuri, Kuki, and Khyeng. Manipuri has many words in common, both with Burmese and Singpho, and with some of the Nagas; but, both in grammar and vocabulary, it seems to belong more decidedly to the present class. No language of this class has the sound of the Burmese \\( th \\). Manipuri with some words, and Kuki always, show the genitive relation by the use of the abridged form of the pronoun. In Manipuri this makes a sort of double genitive, as a genitive suffix is also used. Thus Manipuri \\( ai-gi i-pá \\) ‘of me my father,’ \\( mi-gi ma-kok \\) ‘of the man his head’; Lushai Kuki \\( koyma ka pá \\) ‘I my father,’ \\( mi a lu \\) ‘the man his head.’ In Kuki and Khyeng the verb has the signs of number and person\nprefixed; thus, in Lushai, perfect of pé ‘give,’ sing. 1. ka-pé-tá ‘I gave,’ 2. i-pé-tá, 3. a-pé-tá; plural 1. kan-pé-tá, 2. in-pé-tá, 3. an-pé-tá; the full forms of the pronouns being koyma ‘I,’ nungma ‘thou,’ ama ‘he,’ koymani ‘we,’ etc. In Thado Kuki there is no difference between the singular and plural forms; these are: 1. ka-pe-ta ‘I (or we) gave,’ 2. na-pe-ta, 3. a-pe-ta. In Khyeng, again, sing. 1. ka-pek-niu ‘I gave,’ 2. na-pek-niu, 3. na-pek-niu; plural 1. ma-pek-niu, etc., the full forms of the pronouns being kie ‘I,’ naun ‘thou,’ ayat ‘he,’ kie-me ‘we,’ etc. The Khyeng has a different suffix for the dual and plural of the noun and pronoun, but the tense forms are the same for the dual as for the plural. All three languages have a negative voice formed by inserting da or d in Manipuri, hi in Kuki, and n, m, or mb in Khyeng. They all use a prefixed a extensively as a formative of adjectives or substantives. Manipuri is said to change the adjectival formative affix ba into bi for the feminine, but I do not find this to be the case in all the examples, nor is it clear that it ever takes place except for the purpose of harmonizing the adjectival termination with the ending of a noun in i. Several other languages in the neighbourhood of Manipur may also be included in this class, of which we have no grammars, from the close connexion of their vocabularies with Manipuri, such as Maring, Kupui, Tangkhul, Luhupa, Khungui, Phadang, Champhung, Kupome, and some others.\n\nAs Class XVIII. I take the Kumi, Mru, Banjogi, Shendu, Sak, and Kyau languages of the Arakan hills. They are, no doubt, very like the languages of the preceding class and the Burmese; but, on the whole, they are more like each other. They agree to a considerable extent in the non-Burmese words of their vocabularies, and in regard to words which they have in common with the Burmese; they differ principally in this respect from the Burmese, that they prefix a determinative syllable to the root, whereas the Burmese has generally the bare root only; as Burmese le ‘air,’ Kumi a-li, Mru ra-li, Banjogi h’-li, Shendu t-li, etc. Kumi and Mru are the only languages of which we have any\nspecimens which show the conjugation of the verb, and they have the simple type of verb, and differ, therefore, in this respect from the Kuki and Khyeng. Kumi has the typical sex-affix, as in *tchi-po* 'a son,' distinguished from *tchi-nu* 'a daughter.' In Mru we have *ungcha* 'a son,' and *ungcha-ma* 'a daughter.'\n\nThe last class to be mentioned is the Karen, Class XIX. There are eight dialects, namely, Sgau, Bghai, Red Karen, Pwo, Taru, Mopgha, Kay or Gaikho, and Toungthu. The Karen differs in some important respects from all the other classes; in fact, it is one of the most doubtful members of the group. The structure of the sentence is different, the accusative comes after the verb instead of preceding it, as in the other classes. The most remarkable distinctions of the Karen, however, are its numerous tones, five in number, which are constantly employed, and turn speaking into chanting. Yet Karen is certainly Tibeto-Burman in its vocabulary, and also in the position it assigns to the qualifying noun before the qualified. Besides its use of tones, Karen distinguishes the meaning of words by adding significant determinative words instead of unmeaning determinative syllables; thus in the Sgau dialect, it says *htwie hto* 'dog-hog' for 'dog,' *hto hoan* 'hog-fowl' for 'hog.'\n\nThe verb is of the simple type, but while the pronoun of the first and second persons precedes the verb, that of the third person follows; thus *ya au* 'I eat,' *na au* 'thou eatest,' *au we* 'eats he,' *pa au* 'we eat,' *thu au,* 'ye eat,' *au we* 'eat they.' In the passive voice, besides a special suffix *tha*, the first and second pronouns are repeated after the verb, as *ya au ya tha* 'I am eaten'; *ma* prefixed makes an intransitive verb transitive. In the perfect tense *li* is affixed, for the future *ka* prefixed. Other relations of the verb are expressed by a great number of prefixed and affixed particles, and these describe with excessive minuteness all the circumstances of the action: *a*, a form of the third personal pronoun, as before stated, expresses the genitive relation: *au* 'with' or 'from,' and *leu* 'with' or 'by,' are prepositions. Other relations are expressed by *leu* preceding and another\nparticle following; as leu—aphu 'in,' leu—apho la 'below.'\nGeneric particles are very numerous.\n\nThere are some other languages which do not properly come within the subject of this paper, being neither Indian nor border-languages, but which certainly belong to the present group. This is the case as regards five of the trans-Himalayan languages, specimens of which were collected by Hodgson, namely Takpa, Gyarung, Manyak, Horpa, and Thochu, which have many words in common with the Tibetan. Another distant language is the Lisaw, spoken in parts of Yunan, which appears to be most like the Burmese; most of the numerals are almost identical with the Burmese.\n\nThe next group to be mentioned is the Khasi, which belongs to the hills between the valley of Asam and Sylhet. The Khasis, according to the last census, number only 92,070. Five dialects are given in Sir George Campbell's specimens, one of them being distinguished as the 'Khasi' proper. The dialects of the Jynteah hills are almost unintelligible to the residents of the Khasi; still all the members of the group are so much alike in construction that they must be spoken of as dialects rather than as languages with reference to each other. Tones similar to those of the last group play a very important part in distinguishing between words. The group has several important characteristics, which serve to distinguish it from all the languages hitherto mentioned. All grammatical relations are denoted by prefixes, which are often significant, and can be used as separate words. Nong 'an inhabitant,' 'a fellow,' forms most nouns of agency; jing 'a thing,' abstract nouns; as, u-nongbam 'an eater,' ka-jingbam 'food'; from bam 'to eat.' Again la, an adverb signifying 'since,' is the prefix for the past tense. The genitive relation of a noun is frequently signified by position only, when the noun in that relation comes after the noun on which it depends; as: ka-sem massi, the order being 'house cow,' but the meaning 'cow house'; but the sign of the genitive relation is frequently omitted where it cannot be omitted in English and other Aryan languages: as ka-reng u-blang 'horn goat,' but meaning 'goat's horn.' In this respect the Khasi group\ndiffers not only from the non-Aryan languages before mentioned, but also from the Aryan and from the Chinese. Not only animate but inanimate and abstract nouns are distinguished as masculine or feminine, and both the adjective expresses agreement with its substantive and the verb with its subject in this respect. In the plural, gender is not distinguished. The personal pronouns in the Khasi dialect are: nga 'I,' ngi 'we'; me (m.), pha (f.) 'thou,' phi 'you'; u (m.) 'he,' ka (f.) 'she,' ki 'they.' The third personal pronoun plays an important part in denoting when prefixed both the gender of the substantive and the agreement of the adjective and verb therewith. It will be remembered that, in the two Southern Indian groups, the gender of the verb was signified by suffixed pronominals.\n\nIn animate objects the distinction of sex is made by the prefixed pronoun, as u-briw 'a man,' ka-briw 'a woman'; u-hán 'a drake,' ka-hán 'a duck.' Of inanimate objects the great majority no doubt are feminine; still several of the great objects of nature are masculine, as the names for 'tree,' 'mountain,' 'rock,' 'star,' and also u-byntai 'the moon' is masculine, while ka-sngi 'the sun' is feminine; also many words for smaller objects, such as for rice, sulphur, chain, bread, fruit, etc., are masculine. Abstract nouns, however, are all feminine. The following is an example of the way in which the agreement of the verb and the adjective with the substantive is expressed: u-kynna u-babha u-la-wan 'the good boy came.' La is the prefix denoting the past tense, and babha is the adjective 'good.' Most adjectives are formed from some other part of speech by the prefix ba, as in the above instance; babha 'good,' from the adverb bha 'well'; or again, as bahok 'just,' from hok 'justice.' The plural prefix ki is common to both genders, as ki-sim ki-her 'birds fly.' The usual order of words in a sentence is subject, verb, object; as u-briw u-punih ia ka-ing 'the man shows the house,' where ia is the preposition denoting the accusative relation. Another characteristic of the Khasi is that vowels are sometimes dropped to avoid a hiatus; as nga'n shim 'I will take,' for nga yn shim; nga'm shim 'I do\nnot take,' for *nga ym shim*. The Khasi again differs from the groups before mentioned, in having a relative pronoun which expresses the relative clause as completely as any Aryan language. This relative is *ba*, which takes the usual gender prefixes; thus: *ka-kynthei ka-ba shong ha ka-ta ka-ing* 'the woman who lives in that house,' where *ka-ba* is the relative agreeing in number and gender with *ka-kynthei* 'the woman,' and the order of the words is exactly as in the English. Thus the construction of the sentence is direct, quite different from the inverted order, as it seems to us, found in all the preceding groups. No other language, I believe, outside the Aryan and Semitic families, personifies every object as masculine or feminine. The Hottentot, indeed, is said to be something like the Khasi in this respect, but it does not make the same exhaustive division of all objects into masculine and feminine. There are other genders or classes besides the masculine and feminine.\n\nAnother group is the Tai, which includes the Ahom, Khamti, Shan, Lao, Siamese, and Tai Mow. Most of these languages are not separated by more than dialectal differences, though the group extends from the Gulf of Siam to Western Assam, over more than fifteen degrees of latitude. The Tai Mow or Chinese Shan language, however, differs a good deal from the others. This group agrees with the Khasi in regard to the position of the noun in the genitive relation; but it has no such resemblances of vocables or otherwise as will justify our placing it in the same group with the Khasi; nor has the Tai any grammatical gender like the Khasi. In Tai, also, the demonstrative pronoun follows, whereas in Khasi it precedes the noun. All the members of the Tai group are literary dialects, and their alphabets are derived from the Burmese, with the exception of the Siamese alphabet, which is more remotely connected, though doubtless, also, of Indian origin. The pronunciation, in some at least of the dialects, seems to have changed a good deal since the introduction of writing; the sound of a preceding vowel in Shan is often changed with reference to the final consonant, while in Siamese several final consonants\nare pronounced in the same manner. There are some letter-\nchanges between the different dialects; for instance, a Khamti\nand Shan \\( m \\) frequently corresponds to a \\( b \\) in the other dialects,\na Khamti and Shan \\( h \\) to \\( r \\) in the others, and a Khamti \\( n \\) to a\nShan \\( l \\) and to \\( d \\) in the others. Again, in some dialects we\nfind the same word with the aspirated, in others with the\nunaspirated form of the consonant. There are five tones\nwhich play an important part in all the dialects, but, except in\nthe Siamese, they are not expressed in writing. The relations\nof nouns are expressed by prepositions, with the exception of\nthe genitive relation, for which, however, there is a preposi-\ntion in Siamese; but in the other dialects it is expressed solely\nby the position of the noun in that relation after the noun on\nwhich it depends. The nominative and accusative also are\nordinarily distinguished by collocation only, the one before,\nthe other after the verb. There are several compounds con-\nsisting of two nouns, the latter of course being the qualifying\nnoun, which, when literally translated into English, have a\nsort of poetry about them; as in Siamese \\( luk-mai \\) ‘son of the\ntree’ = fruit; \\( me-nám \\) ‘mother of waters’ = river; \\( nám-nám \\)\n‘water of udders’ = milk. Generic particles are extensively\nused in all the dialects; adjectives follow their substantives,\nand there are relative pronouns. The structure of the verb\nis of the simple type; the signs of some tenses are prefixed,\nof others affixed; and the dialects do not all agree in this\nrespect.\n\nI now come to the last group, the Mon, etc., of which,\nhowever, Mon is the only representative among the Indian\nlanguages. Mon is also called Taleing and Peguan. Pegu\nwas the original habitation of the Mons, but they were driven\nout of a great part of it by the Burmese about 100 years\nago, and many of them have settled in Siam. Some affinity\nhas been supposed to exist between the Mon and the Kolarian\ngroup, on account of the evident likeness between the first\nnumerals and some few other words; but it is not upon such\nslight evidence that the groups hitherto mentioned have been\nformed. These have been established, not only upon the\nresemblances of a much greater number of words, but of\ngrammar also, while nothing can well be more different than Mon and Kolarian grammar. It is apparently with Kambojan and Anamese that the Mon has the nearest affinities, and considering the distance at which Mon is separated from these two languages by the intervening Tai, the resemblance between them is very remarkable, and with the Kambojan the resemblance is not confined to root-words only, but extends also to the prefixes.\n\nAnother language, apparently, on the whole, from its vocables, though we have no grammar, belonging to this group, is the Paloung. The pronunciation of words ending with \\( h \\) in Mon is said to be very fatiguing, at least to foreigners, and the Kambojan also has many words with final \\( h \\). Not only is there a considerable resemblance of vocables, but the grammatical structure of Mon, Kambojan and Anamese is much the same. The most common relations of nouns are expressed by position only, the nominative before, the accusative after the verb, the genitive by following the noun on which it depends. Other relations are expressed by prepositions. Again, sex is distinguished by affixes, which are different for human beings and for animals. Kon in all three languages means a child or the young of any animal; thus Mon kon tru ‘son,’ kon prau ‘daughter’; Kambojan kon pros ‘son,’ kon srey ‘daughter’; Anamese kon trai ‘son,’ kon gai ‘daughter.’ In Mon, again, cheh kmok ‘horse,’ cheh buh ‘mare’; Kambojan seh chhmul ‘horse,’ seh nhi ‘mare.’ Adjectives follow their substantives, and they are compared by a particle of comparison placed after the adjective. The verb in all three languages has the simple structure. Some particles may occasionally be used to characterize the tenses; but more “frequently there is nothing but the connexion to show the tense or mood.” There is this remarkable difference, however, between the Mon and Kambojan on the one hand, and the Anamese on the other hand, that whereas the two former apparently have but little if any recourse to tones, the Anamese has six tones, which are very extensively used. The two former, however, make up for the want or little use of tones in the same way as that spoken\nof with regard to several members of the Tibeto-Burman group, namely, by the use of a greater number of determinative prefixes, and especially is this the case with regard to the Mon; for instance, Mon and Kambojan *th-ngay* 'the sun or the day,' compared with Anamese *ngay*; Mon *k-day* 'the head,' Anamese *dau*; Mon *k-to* 'the ear,' Anamese *tai*. In Kambojan, also, there are very great varieties of vowel-sounds, which serve to distinguish between many monosyllabic words, the meanings of which might otherwise have been confounded. Again, there are few derivative words in Anamese; but in Mon, at least, they are often formed by prefixes. In Mon, also, substantives are sometimes formed from verbal roots by some infix or modification of the root; as *tmlu* 'darkness,' from *klu* 'to be dark'; *kmlaut* 'a thief,' from *klaut* 'to steal.' As regards the characters in which these languages are written, those of the Mon are nearly the same as the Burmese. Anamese employs the Chinese characters, adapted to a phonetic syllabary; and the Kambojan has also a syllabary, but with characters of its own, which primarily represent consonants followed by *a* and consonants followed by *o*; signs being added to denote the numerous modifications of these two vowel-sounds.\n\n**Table of the Non-Aryan Languages of India.**\n\n*Note.*—Brackets refer to dialects that are very closely related; * refers to languages not distinguished on the map; † to languages beyond the circle of the Indian languages.\n\n| Dravidian | Mahadeo |\n|-----------|---------|\n| Tamil¹    | Raj     |\n| Malayalam | Maria²  |\n| Telugu    | Khond or Ku |\n| Canarese  | Oraon or Dhangar |\n| *Badaga   | Rajmahal or Maler |\n| Tulu      | Miscellaneous Dialects. |\n| Kudagu or Coorg | *Naikuḍe |\n| Tuda      | *Kolami |\n| Kota      | *Rekudi |\n| Gond dialects | *Yerukula |\n|           | *Gadaba |\n\n¹ Also ancient Tamil, a very important study; and two dialects, Irula and Kuruba.\n\n² Other dialects in Hunter's Dictionary, Gayeti, Rutluk, Madi. Others, again, called after the Districts in the Central Province in Sir George Campbell's specimens.\n### KOLARIAN.\n\n- Santali\n  - Mundári\n  - Ho or Larka Kol\n  - Bhumij\n  - Korwa\n  - Kharria\n  - Juang\n  - Kuri\n  - Kurku\n  - *Mehto\n  - Savara\n\n### TIBETO-BURMAN.\n\n#### I.\n- Kachari or Bodo\n- *Mech\n- *Hojai\n- Garo\n- Pani-Koch\n- Deori-Chutia\n- Tipura\n\n#### II.\n- Tibetan or Bhotia\n- Sarpa\n- Lhopa or Bhutáni\n- Changlo\n- *Twang\n\n#### III.\n- Gurung\n- Murmi\n- *Tháksya\n- Newar\n- Pahri\n- Magar\n\n#### IV.\n- Lepeha\n\n#### V.\n- Dophla\n- Miri\n- Abor\n- *Bhotia of Lo\n\n#### VI.\n- Aka\n\n#### VII.\n- Mishmi dialects\n  - Chulikota\n  - Taying or Digaru\n  - Míjhu\n\n#### VIII.\n- Dhimal\n\n#### IX.\n- Kanáwari dialects\n  - *Milehán\n  - Tibarskád\n  - Sumechu\n\n#### X.\n- Kiranti\n  - Limbu\n  - Sunwár\n  - Brámu\n  - Chepang\n  - Váyu\n  - Kúsunda\n\n#### XI.\n- Naga dialects\n  - Namsang or Jaipuria\n  - Banpará or Joboka\n  - *Mithan\n  - Tablung\n  - *Mulung\n\n#### XII.\n- Naga dialects\n  - Khari\n  - Nougong\n  - Tengsa\n  - Lhota\n\n#### XIII.\n- Naga dialects\n  - Angámi\n  - Rengma\n  - Arung\n  - Kuteha\n  - Liyang or Koreng\n  - Marám\n\n#### XIV.\n- Mikir\n\n#### XV.\n- Singpho\n  - Jili\n\n#### XVI.\n- Burmese\n\n#### XVII.\n- Kuki dialects\n  - Thado\n  - Lushai\n  - *Hallami\n  - Khyeng\n  - Manipuri\n  - Maring\n  - *Khoibu\n\n---\n\n1 Called Mrung in Chittagong.\n2 A different language from the Lhopa of the preceding class.\n3 Called Bunun in Lahoul.\n4 Seventeen dialects: Rodong, Rúngchenbung, Chhingtángya, Náchereng, Wálíng, Yákha, Chourásya, Kulúngya, Thulungya, Bahingya, Lohorong, Lambichhong, Báli, Sáng-páng, Dumi, Khálíng, Dungmáli.\n5 Apparently the Seesbaugor and Abhay Purya of Sir George Campbell's specimens.\n6 In another list Muthun.\n7 Probably Campbell's Hatigarya.\n8 Probably Campbell's Deku Himong.\n9 Probably Campbell's Dop-darya.\n10 Probably Campbell's Miklai.\n11 Called Kakhyén in Yunan.\n12 Called Mugh in Chittagong, Rukheng in Arakan.\nKupui¹\nTangkhul ²\nLuhupa\n*Khungui\n*Phadang\n*Champhung\n*Kupome\n*Takaimi\n*Andro and Sengmai\n*Chairel\n*Anal and Namfau\n\nXVIII.\n{ Kumi\n{ Kami\nMru\n{ Banjogi or Lungkhe\n{ Pankho\nShendu or Poi\nSak\nKyau\n\nXIX.\nKaren dialects\nSgau\nBghai\nRed Karen\nPuco\nTaru\n\nMopgha\nKay or Gaikho\nTounghthu\n00† Lisaw ³\n† Gyarung\n† Takpa\n† Manyak\n† Thochu\n† Horpa\n\nKhasi ⁴\nTai.\n\nSiamese or Thai\nLao\nShan\n* Ahom\nKhamti\n* Aiton\n† Tai Mow or Chinese Shan\n\nMon-Anam.\nMon\n† Kambojan\n† Anamese\n† Paloung\n\n¹ Two dialects, Songbu and Puiron.\n² Three dialects, Northern, Central, and Southern.\n³ Not classed. See page 25.\n⁴ Four other dialects in Campbell's specimens, Synteng, Battoa, Amwee, Lakadong.\n\nNote.—Since this paper was printed, I have coloured the extra-Indian portion of the map. In this portion, besides the languages given in the table, we have, east of the Salwen River and north of the Karens, the Kui, Kho and Mu-tse languages (but not marked on the map); in Yunnan, the Kato, Lolo, Ho-nhi, and Y-kia languages (not marked); and in Sechuan, the Man-tsé; all which languages apparently belong to the Tibeto-Barmen group. Again, beyond the Mekhong are the Lemei and Khmu languages, which apparently belong to the Mon-Anam group. In order, also, to make the map a complete language map of India, I have given the boundaries of the principal Aryan languages. I should add that Mr. Cust, who has helped me with the preparation of the map, is publishing it also with remarks, which will, doubtless, add to its interest, in the Geographical Mag. of Jan. 1878.\nBROWN.—The Dervishes; or, Oriental Spiritualism. By John P. Brown. With 24 illustrations. 8vo. cl. pp. viii. and 415. 14s.\n\nCALDWELL.—A Comparative Grammar of the Dravidian, or South-Indian Family of Languages. By the Rev. R. Caldwell, L.L.D. A second, corrected, and enlarged Edition. In 1 vol. 8vo. cl. pp. 804. 28s.\n\nCHILDER.—A Pali-English Dictionary, with Sanskrit Equivalents, and with numerous Quotations, Extracts, and References. Compiled by R. C. Childers, late of the Ceylon C.S. Imp. 8vo. cl., pp. xxii.-622. 63s.\n\nCOLEBROOKE.—The Life and Miscellaneous Essays of Henry Thomas Colebrooke. The Biography by his Son, Sir T. E. Colebrooke, Bart., M.P. The Essays edited by Professor Cowell. In 3 vols. 8vo. cl. Vol. I. The Life. With Portrait and Map. pp. xii. and 492. 14s.—II. And III. The Essays. A New Edition, with Notes by Professor E. B. Cowell. pp. xvi. and 544, and x. and 526. 28s.\n\nCOWELL.—An Introduction to Prakrit Grammar. With a List of Common Irregular Prakrit Words. By Prof. E. B. Cowell. 8vo. limp cl., pp. 40. 3s. 6d.\n\nCUNNINGHAM.—The Ancient Geography of India. I. The Buddhist Period, including the Campaigns of Alexander, and the Travels of Hwen-Thsang. By Major-Gen. Alex. Cunningham. With 13 Maps. 8vo. cl. pp. xx. and 590. 28s.\n\nDOWSON.—A Grammar of the Urdu or Hindustani Language. By John Dowson, M.R.A.S. 12mo. cl., pp. xvi. 264. 10s. 6d.\n\n— A Hindustani Exercise Book. Containing a Series of Passages and Extracts adapted for Translation into Hindustani. By John Dowson, M.R.A.S. Cr. 8vo. pp. 100. Limp cloth, 2s. 6d.\n\nEDKINS.—China's Place in Philology. An attempt to show that the Languages of Europe and Asia have a common origin. By the Rev. Joseph Edkins. Cr. 8vo. cl. pp. xxiii. and 403. 10s. 6d.\n\nEITEL.—Handbook for the Student of Chinese Buddhism. By the Rev. E. J. Eitel. Cr. 8vo. cl. pp. viii. and 224. 18s.\n\n— Buddhism: its Historical, Theoretical, and Popular Aspects. In 3 Lectures. By Rev. E. J. Eitel, M.A., Ph.D. Second Edition. Demy 8vo. sd., pp. 130. 5s.\n\nELLIO.—The History of India, as told by its own Historians. The Muhammadan Period. Edited from the Posthumous Papers of the late Sir H. M. Elliot, K.C.B., by Prof. Dowson, M.R.A.S. 6 vols. 8vo. cl. Vols. I. and II. With a Portrait of Sir H. M. Elliot, pp. xxxii. ar. 1542, x. and 580, 10s. each.—III. pp. xii. and 27. 24s.—IV. pp. x. and 563. 21s.—V. pp. xii. and 570. 21s.—VI. pp. vii. and 574. 21s.\n\n— Memoirs of the History, Folklore, and Distribution of the Races of the North Western Provinces of India; being an amplified Edition of the original Supplementary Glossary of Indian Terms. By the late Sir H. M. Elliot, K.C.B. Edited, revised, and re-arranged, by John Beames, M.R.A.S., Bengal C.S. In 2 vols. demi 8vo., pp. xx., 370, and 366. cloth, 2 Lithographic Plates, 1 coloured Map, and 3 coloured folding Maps. 36s.\n\nGRIFFITH.—Scenes from the Ramayana, Meghaduta, etc. Translated by Ralph T. H. Griffith, M.A., Principal of the Benares College. Second Edition. Cr. 8vo. cl., pp. xviii. and 244. 6s.\n\n— The Rámáyán of Válmíki. Translated into English verse. By Ralph T. H. Griffith, M.A.\n\nVol. I., containing Books I. and II. Demy 8vo. cl. pp. xxxii. and 440. 18s.—II., containing Book II., with additional Notes and Index of Names. pp. 504. 18s.—III. pp. v. and 371. 15s.—IV. pp. viii. and 432. 18s.—V. pp. 368. 15s.\n\nGUBERNATIS.—Zoological Mythology; or, the Legends of Animals. By Angelo de Gubernatis. In 2 vols. 8vo. pp. xxvi. and 432. vii. and 442. 28s.\n\nHODGSON.—Essays on the Languages, Literature, and Religion of Nepal and Tibet; together with further Papers on the Geography, Ethnology, and Commerce of those Countries. By B. H. Hodgson, late British Minister at Nepál. Reprinted, with Corrections and Additions, from \"Illustrations of the Literature and Religion of the Buddhists,\" Serampore 1841; and \"Selections from the Records of the Government of Bengal,\" No. XXVII, Calcutta, 1857. Roy. 8vo. cl., pp. 288. 14s.\n\nIKHWANU-S SAFA.—Ikhwánu-s Safá; or, Brothers of Purity. Describing the Contention between Men and Beasts as to the Superiority of the Human Race. Translated from the Hindustání by Prof. J. Dowson. Cr. 8vo. cl. pp. viii. and 156. 7s.\n\nJATAKA (THE), together with its Commentary. Now first published in Pali, by V. Fausböll, with a Translation by R. C. Childers, late of the Ceylon C.S. To be completed in five volumes. Text. Vol. I. Part I. Roy. 8vo. sd., pp. 224. 7s. 6d.\n\nKHIRAD-AFROZ (The Illuminator of the Understanding). By Maulavi Hafiz'ud-din. A new edition of the Hindustání Text, carefully revised, with Notes, Critical, and Explanatory. By Edward B. Eastwick, M.P. F.R.S. 8vo. cl. pp. xiv. and 321. 18s.\n\nLEGGE.—The Chinese Classics. With a Translation, Critical and Exegetical Notes, Prolegomena, and Copious Indexes. By Jas. Legge, D.D. In seven vols. Roy. 8vo. cl. Vol. I., Confucian Analects, the Great Learning, and the Doctrine of the Mean. pp. 526. 42s.—II., The Works of Mencius. pp. 614. 42s.—III., Part I., The First Part of the Shoo-King, or the Books of Tang, the Books of Yu, the Books of Hea, the Books of Shang, and the Prolegomena. pp. viii. and 280. 42s.—III., Part II., The Fifth Part of the Shoo-King, or the Books of Chow, and the Indexes. pp. 281. 736. 42s.—IV., Part I., The First Part of the She-King, or the Lessons from the States; and the Prolegomena. pp. 182. 42s.—IV., Part II., The First Part of the She-King, or the Minor Odes of the Kingdom, the Greater Odes of the Kingdom, the Sacrificial Odes and Praise-Songs, and the Indexes. pp. 510. 42s.—V., Pt. I., Dukes Yin, Hwan, Chwang, Min, He, Wan, Seuen, and Ching; and the Prolegomena. pp. xii., 148 and 410. 42s.—V., Part II., Contents:—Dukes Seang, Cha'on, Ting, and Gal, with Tso's Appendix, and the Indexes. pp. 526. 42s.\n\n— The Chinese Classics. Translated into English. With Preliminary Essays and Explanatory Notes. By James Legge, D.D. 3 vols. 8vo. cl.\n\nVol. I. The Life and Teachings of Confucius\nMAHA-VIRA-CHARITA; or, the Adventures of the Great Hero Rama. An Indian Drama in Seven Acts. Translated into English Prose from the Sanskrit of Bhava-bhūti. By J. Pickford, M.A. Cr. 8vo. cl. 5s.\n\nMARSDEN'S NUMISMATA ORIENTALIA. New Edition. Part I. Ancient Indian Weights. By Edward Thomas, F.R.S., &c. With a Plate and Map of the India of Manu. Roy. 4to. sd., pp. 84. 9s. 6d.\n\nPart II. Coins of the Urtuki Turkmans. By Stanley Lane Poole, Corpus Christi College, Oxford. Roy. 4to. sd., pp. xii.-44, with six plates. 9s.\n\nMUIR.—Original Sanskrit Texts, on the Origin and History of the People of India, their Religion and Institutions. Collected, Translated, and Illustrated by John Muir, Esq., D.C.L., LL.D., Ph.D. 5 vols. 8vo. cl.\n\nVol. I. Mythical and Legendary Accounts of the Origin of Caste, with an Inquiry into its existence in the Vedic age, 2nd Edition, revised and enlarged. pp. xx. and 312. 21s.\n\nII. The Trans-Himalayan Origin of the Hindus, and their Affinity with the Western Branches of the Aryan Race. 2nd Edition, revised, with Additions. pp. xxxii. and 512. 21s.\n\nIII. The Vedas: Opinions of their Authors, and of later Indian Writers on their Origin, Inspiration, and Authority. 2nd Edition, revised and enlarged. pp. xxxii. and 312. 16s.\n\nIV. Comparison of the Vedic with the later representations of the principal Indian Deities. 2nd Edition, revised. pp. xvi. and 324. 21s.\n\nV. Contributions to a Knowledge of the Cosmogony, Mythology, Religious Ideas, Life and Manners of the Indians in the Vedic age. pp. xvi. and 402. 21s.\n\nORIENTAL CONGRESS.—Report of the Proceedings of the Second International Congress of Orientalists held in London, 1874. Roy. 8vo. pap. pp. 76. 5s.\n\nPRAKRIT-A-PRAKASA; or, The Prakrit Grammar of Vararuchi, with the Commentary (Manorama) of Bhamaha. The first complete edition of the Original Text, with Various Readings, copious Notes, an English Translation, and Index of Prakrit words, to which is prefixed an easy Introduction to Prakrit Grammar. By Prof. E. B. Cowell. Second issue, with new Preface, and corrections. 8vo. pp. xxxii. and 204. 14s.\n\nRIG-VEDA.—The Hymns of the Rig-Veda in the Samhita and Pada Text, without the Commentary of Sāyana. Edited by Prof. Max Müller. 2 vols. 8vo. pap. pp. 1704. 63s.\n\nRIG-VEDA SANHITA. The Sacred Hymns of the Brahmans. Translated and explained by F. Max Müller, M.A., LL.D., etc. Vol. I. Hymns to the Maruts, or the Storm-Gods. 8vo. cl. pp. cliii. and 264. 12s. 6d.\n\n— A Collection of Ancient Hindu Hymns. Constituting the First Ashtaka, or Book of the Rig-Veda; the oldest authority for the religious and social institutions of the Hindus. Translated from the Original Sanskrit. By the late H. H. Wilson, M.A., F.R.S., etc. 2nd Edition, with a Postscript by Dr. Fitzedward Hall, Vol. I. 8vo. cl. pp. lii. and 348. 21s.\n\nRIG-VEDA SANHITA. A Collection of Ancient Hindu Hymns, constituting the 5th to 8th Ashtakas, etc. Translated by H. H. Wilson M.A., etc. Edited by E. B. Cowell, M.A. Vol. IV. 8vo. cl. pp. 214. 14s.\n\nA few copies of Vols. II. and III. still left.\n\n[Vols. V. and VI. in the Press.]\n\nSAMA-VIDHANA-BRAHMANA. With the Commentary of Sāyana, Edited, with Notes, Translation, and Index, by A. C. Burnell, M.R.A.S. Vol. I. Text and Commentary. With Introduction. 8vo. cl. pp. xxxviii. and 104. 12s. 6d.\n\nSCHLEICHER.—Compendium of the Comparative Grammar of the Indo-European, Sanskrit, Greek, and Latin Languages. By August Schleicher. Translated from the Third German Edition by Herbert Bendall, B.A., Chr. Coll. Camb. Part I. 8vo. cl. pp. 184. 7s. 6d.\n\nSHERRING.—The Sacred City of the Hindus. An Account of Benares in Ancient and Modern Times. By the Rev. A. M. Sherring, M.A., LL.D.; and Prefaced with an Introduction by F. Hall, Esq. 8vo. cl. pp. xxxvi. and 388, with illustrations. 21s.\n\nSWAMY.—The Dathavansa; or, the History of the Tooth-Relic of Gotama Buddha. The Pali Text and its Translation into English, with Notes. By M. Coomāra Swamy, Mudelār. Demy 8vo. cl. pp. 174. 10s. 6d.\n\n— Sutta Nipāta; or, the Dialogues and Discourses of Gotama Buddha. Translated from the Pali, with Introduction and Notes. By Sir M. Coomāra Swamy. Cr. 8vo. cl. pp. xxxvi. and 160. 6s.\n\nWHEELER.—The History of India from the Earliest Ages. By J. Talboys Wheeler, Assistant Secretary to the Government of India in the Foreign Department, Secretary to the Indian Record Commission, author of \"The Geography of Herodotus,\" etc., etc. 4 vols. 8vo. cl.\n\nVol. I. The Vedic Period and the Maha Bharata, pp. lxxv. and 570. 18s.—II. The Ramayana and the Brahmanic Period, pp. lxxxviii. and 680, with 2 Maps. 21s.—III. Hindu, Buddhist, Brahmanical Revival, pp. 384, with 2 Maps. 18s.—IV. Part I., pp. xxxii. and 320. 14s.\n\nWILSON.—Works of the late Horace Hayman Wilson, M.A., F.R.S., Member of the Royal Asiatic Societies of Calcutta and Paris, and of the Oriental Soc. of Germany, etc., and Boden Professor of Sanskrit in the University of Oxford. 12 vols. 8vo. cl.\n\nVols. I. and II. Essays and Lectures chiefly on the Religion of the Hindus, by the late H. H. Wilson, M.A., F.R.S., etc. Collected and edited by Dr. R. Rost, 2 vols. pp. xiii. and 399, vi. and 416. 21s.—III. IV. and V. Essays Analytical, Critical, and Philological, on Subjects connected with Sanskrit Literature. Collected and edited by Dr. R. Rost, 3 vols. pp. 408, 406, and 390. 36s.—VI., VII., VIII., IX. and X. Vishnu Purāna, a System of Hindu Mythology and Tradition. Translated from the Original Sanskrit, and Illustrated by Notes derived chiefly from other Purānas. By the late H. H. Wilson. Edited by F. Hall, M.A. Vols. i to 5. pp. cxl. and 200; 344; 346; 528. 6d.—XI. and XII. Select Specimens of the Theatre of the Hindus. Translated from the Original Sanskrit. By the late H. H. Wilson, M.A., F.R.S., 3rd corrected edition. 2 vols. pp. lxi. and 384; iv. and 418. 21s.\n\nLONDON: TRÜBNER & Co., 57 and 59, LUDGATE HILL\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/onnonaryanlangua00bran.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 58128, "total-output-tokens": 24561, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 15, 2], [15, 179, 3], [179, 2534, 4], [2534, 2534, 5], [2534, 2534, 6], [2534, 4044, 7], [4044, 6262, 8], [6262, 8447, 9], [8447, 10631, 10], [10631, 12889, 11], [12889, 15171, 12], [15171, 17439, 13], [17439, 19659, 14], [19659, 21932, 15], [21932, 24284, 16], [24284, 26439, 17], [26439, 28631, 18], [28631, 30965, 19], [30965, 33233, 20], [33233, 35505, 21], [35505, 37769, 22], [37769, 40122, 23], [40122, 44324, 24], [44324, 46572, 25], [46572, 48897, 26], [48897, 50993, 27], [50993, 53251, 28], [53251, 55430, 29], [55430, 57654, 30], [57654, 59869, 31], [59869, 62072, 32], [62072, 64276, 33], [64276, 66565, 34], [66565, 68740, 35], [68740, 70855, 36], [70855, 72660, 37], [72660, 74193, 38], [74193, 80142, 39], [80142, 86030, 40], [86030, 86030, 41], [86030, 86030, 42]], "primary_language": ["en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false], "is_diagram": [false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]