[{"id": "b0bb26489e68667feb10d7cee1d671fabd34b513", "text": "Back Numbers of the Society's Journal.\n\nThe stock of back numbers of the Journal has been considerably reduced and complete sets can no longer be supplied.\n\nA limited number, however, of about 90 per cent are still available and can be supplied to Members at $3 a copy, to Non-Members at $3 a copy.\nSpecial Number.\n\nA Special Number (637 pages) has been published in September 1921 devoted to one paper by Dr. E. D. Merrill, Director of the Bureau of Science, Manila, on the Flora of Borneo.\n\nIt contains a list of all species of plants recorded from Borneo and will be invaluable to all students of the Flora of that country.\n\nA copy will be sent to any Member of the Society on application to the Hon. Secretary.\nMalayan Fishes\n\nby\n\nC. N. MAXWELL\n\nDirector of Supplies, S. S. and F. M. S.\n\nSingapore\nPrinted at the Methodist Publishing House\n1921.\nContents.\n\n1. Preface ........................................... 179\n2. Introduction ....................................... 181\n3. Part I. Descriptions of Species .................. 191\n4. Part II. Malay Vocabulary of Fishes ............. 234\n5. Part III. Systematic Classification of the Fishes described ........................................... 262\n6. Authors consulted .................................. 278\n7. Index to English names ............................ 279\n8. List of Plates ...................................... 281\n9. Plates.\nPreface.\n\nLiterature dealing with our local Fish and Fisheries is wanting.\n\nThe members of the Profiteering Commission (1920) who were \"impressed and much handicapped by the absence of any recorded information relating to fish and fisheries,\" made certain recommendations for the future control and organisation of the fishing industry and these recommendations have received the approval of the Government.\n\nWith the best will in the world, the task of Legislators and Fishery Officers who have no data or records to guide them, and are therefore unable to discuss our local fish and fisheries except in vague terms, would be as fruitless in the future as it has been in the past.\n\nAllowing, therefore, that recorded information in the form of a hand-book on Malayan Fishes is wanted and wanted at once, the difficulty arises that there is no one qualified or likely to be qualified for some years to write such a book.\n\nThe ichthyologists are not linguists and the linguists are not ichthyologists.\n\nThis being the position, the writer has the temerity to offer this small work, which he hopes will be of some temporary service until, in due course, the importance of the Malayan Fisheries has been established and Fishery bulletins written by specialists are produced.\n\nThe inclusion in this volume of several hundred Malay names of fishes, many published for the first time, should lighten the labours of scientists and help the Fishery Officers.\n\nNo fishes have been included which have not been definitely recorded as inhabiting the seas, estuaries and fresh water of the Malay Peninsula.\n\nThe size of the work would have been trebled if fishes of Borneo, Java, Sumatra and the Malay Archipelago generally, together with Siam and Burma, had been admitted. It is safe to prophesy that most of the fishes of those countries inhabit our waters and will be recorded later on.\n\nThis work may be taken, therefore, as dealing, very inadequately, with one-fourth of our fishes only and probably not one-half of the local Malay names have been mentioned. The writer knows very little about fresh water fishes.\nThe material in this book has been put together hastily during a period of five months in the intervals of considerable pressure of other work.\n\nThe plates have been beautifully prepared by Mr. Black of the Survey Department, Kuala Lumpur, but it is to be regretted that many of the fishes have been badly displayed and badly photographed.\n\nThe writer was unable to find time to be present at the Clyde Terrace Market, Singapore, where most of the photographs were taken, the fish being borrowed for a minute or two from the stall-holders, and in consequence, the specific identification of every fish from a poor photograph has been impossible, though the writer feels confident that the families and genera have been correctly given.\n\nThe writer's thanks are due to Messrs. Stead and Roughley. But for their works on Australian Fishes, from which quotations have been freely made, this work could not have been written.\n\nTo the Directors and Staff of the F. M. S. Museums and the Raffles Museum, Singapore, who have granted me facilities for consulting the reference libraries and permission to examine and photograph specimens in the Museum collections, I desire to express my indebtedness.\n\nC. N. Maxwell,\n\nDirector of Supplies.\n\nSingapore, 16th June, 1921.\nMalayan Fishes\n\nBY\n\nC. N. MAXWELL\n\nINTRODUCTION.\n\n\"Fish is not a luxury, but an absolute necessary of life, with a rice-eating population.\"\n\n\"It is obvious that in order to secure an adequate and plentiful supply of fish, especially to large cities like Calcutta...........we must go further out—into the deep sea—which, after all, is the largest repository of piscine wealth...........facts and figures relating to the sea-fisheries of Great Britain, the United States and Canada...........ought to open our eyes to the great possibilities which lie before us.\"\n\n\"In Bengal, Government will have to do a great deal more; it will have to create and build up the sea-fishing industry, with the object of handing it, let us hope at no distant date, to private enterprise.\n\n\"It will also be necessary to show the best way of working the estuarine fisheries by improved methods of capture and of bringing the catches expeditiously to market in a sound state.\"\n\nSir K. Gupta, K. C. S. I. Report on Fisheries of Bengal and into Fishery matters in Europe and America, 1908.\n\n\"I appeal to the whole population of these Islands, a maritime people who owe everything to the sea. I urge them to become better informed in regard to our national sea-fisheries and take a more enlightened interest in the basal principles that underlie a rational regulation and exploitation of these important industries. National efficiency depends to a very great extent upon the degree in which scientific results and methods are appreciated by the people and scientific investigation is promoted by the Government and other administrative authorities. The principles and discoveries of science apply to aquiculture no less than to agriculture. To increase the harvest of the sea the fisheries must be continuously investigated.........................\"\n\nW. A. Herdman, C.B.E., D. Sc., F.R.S., etc. Annual address of the President of the British Association 1920.\n\n\"In no other section of our food supply...........could the application of capital to a comparatively small amount mean so considerable a development...........Both as regards railway and cold storage facilities the fish trade is in its infancy........................Transportation—cheap and rapid, must be provided by the State—fish trains should have precedence—and rates should be very low, even to the extent of entailing considerable loss.\"\n\nThe Earl of Dunraven. Paper read before the Royal Statistical Society, March 20, 1917.\nFish are curious creatures and we have still a great deal to learn about their habits. Some like the Salmon and the Shad (Ikan terubok) live in the sea and spawn in the rivers. Such fish are termed anadromous and the term is also applied to fish which make a migration from the deep sea coastwards for the purpose of spawning.\n\nOthers, like some Eels, live in the rivers and spawn in the sea. The common Eel of Europe (Anguilla vulgaris) spawns far out in the ocean, after which both males and females die, never returning to fresh-water a second time. Fishes which live in the rivers and spawn in the sea are termed catadromous.\n\nSome fishes do not lay eggs but bring forth their young alive. Examples of viviparous fishes occur in the Shark and Ray families and also in the Blennidae, Cyprinodontidae and Scorpaenidae. Instances of functional hermaphroditism occur, and some of the Serranidae (Sea-Perches) are invariably hermaphrodite and self-fertilising.\n\nA Sea-Bream, Chrysophrys auratus, is an example of successive hermaphroditism, the male and female sex-cells ripening alternately. As an occasional variation hermaphroditism has been recorded in such well known fishes as the Cod, the Mackerel and the Herring.¹\n\nThe eggs of fishes may be divided into two kinds; the large (demersal ova) which are heavy and sink; and the small (pelagic ova) which are buoyant and float at or below the surface according to their density. The buoyancy of the pelagic egg depends, however, on the density of the sea and the pelagic egg becomes demersal, in position, in brackish water and in fresh water.\n\nDemersal eggs may be either viscid and adhesive or smooth and non-adhesive.\n\nPelagic eggs are distinguished by their lightness, buoyancy, small size and remarkable transparency. They are always non-adhesive and free and they invariably belong to Marine Fishes. As a general rule it may be said that fresh water fish produce demersal ova and marine fish pelagic ova.\n\nWhen we realise that the eggs of most Marine fishes float, it is obviously futile to speak of guarding the \"spawning grounds\" on our coasts. It is necessary to mention this because at one time it was thought that spawning took place on shallow banks or even close in shore but this is now known to be incorrect, except in the case of the true Herring which lays demersal eggs in comparatively shallow water, and a few less important species.\n\nAmongst our important Marine food fishes which are known to produce pelagic eggs are members of the Herring, Mackerel, Horse-Mackerel, Sea-Perch, Mullet and Flatfish families, in fact, all our best fish.\n\n¹ Camb: Nat: Hist: 1904'.\nFishes known to produce demersal eggs on our coasts are the Gar-Pike (Todak) and the Flying-fish (Belalang) and their eggs have viscid threads by which they become attached or entangled with foreign objects or eggs of the same species. The eggs of the Todak may be seen entangled in fishing stakes (kelong) in masses, which look rather like cobwebs.\n\nWhen the breeding season arrives fishes migrate to the localities most suitable for the deposition of their eggs. At this time our principal food fish which produce pelagic eggs proceed far out to sea against the prevailing monsoonal current. This is known as the contranatant spawning migration. After spawning, the eggs are brought back by the current towards the coast. This is the denatant drift.\n\nThough the eggs of many species of fish hatch out fry which are miniature representations of the adult fish, the eggs of others hatch out larval forms, known as Leptocephali, which bear no resemblance to their parents. These Leptocephali are transparent, attenuated creatures, often ribbon-like in shape, with very small heads. They appear to be incapable of much effort and to be specially adapted for passive drift; in fact, the Leptocephalus stage appear to be a marvellous provision of Nature to enable the young of certain fish which spawn far out at sea to reach the shallows near the coasts in a state of suspended animation. We know that the Tarpin (Megalops cyprinoides) Malay Bulanbulan and the Giant Herring (Elops hawaiiensis) Malay Bandang, pass through a Leptocephalus stage, and as no Malay fisherman whom I have questioned, has ever seen the Parang-parang (Chirocentrus dorab) until it was a few inches long, it may be because this fish passes through a larval metamorphosis also. It is only within recent years, that certain Leptocephali, long known to naturalists, have been identified as larval Eels.\\(^1\\)\n\nFor example, *Leptocephalus brevirostris* is now known to be the larva of the common Eel of Europe (*Anguilla vulgaris*) and *Leptocephalus morrisii* has been watched through its metamorphosis into the Conger Eel (*Conger vulgaris*).\n\nIf the contranatant spawning migration is against the S. W. monsoonal current, the ova and larvae will drift in a N. E. direction and those that enter the Straits of Malacca, for instance, would gradually approach the West coast of the Peninsula. Similarly, a spawning migration in the South China Sea during the N. E. monsoon would result in the larvae being carried along and dispersed along the East coast of the Peninsula.\n\nAs the larvae approach the coast they come within the influence of the tides and while continuing their progress with the monsoon current they are carried backwards and forwards by the daily ebb and flow of the tides.\n\n---\n\n\\(^1\\) Meek, Migrations of Fish.\nTheir density causes them to sink lower in brackish water until they eventually find bottom in the shallow bays and estuaries and in this way are gradually dispersed all along the coast. Then a metamorphosis takes place and the feeble Leptocephalus is transformed into the active little fish which swims vigorously against the current and feeds incessantly and voraciously all the time.\n\nIn a recent report on the Fisheries of the Straits Settlements and Federated Malay States the writer drew attention to the Chinese fish-traps called pompang and other licensed fixed engines known as ambai, langgai, etc., of which there are several thousand between Penang and Port Swettenham. Though there are many kinds of these traps they all work on the same principle. In every case there is a wide V-shaped entrance terminating in a long funnel-shaped bag made of sacking or plaited split bamboos. The position of these traps is arranged with respect to the currents and tides so as to intercept the larvae and immature fish during their denatant drift to the shallows. Most of these traps float, and swing round with each tide so as to take toll both with the ebb and the flow.\n\nAn examination of the contents of these traps shews that in addition to immature fish, which any Malay fisherman will tell you are the fry of valuable food fish, the bulk of the catches are made up of feeble, attenuated, small-headed larval-like fishes which the Malays call Bunga ayer and to which they attach no value.\n\nThere can be little doubt that scientific investigation will prove that the Bunga ayer are valuable food-fish in the Leptocephalus stage.\n\nThis subject has been treated at some length because of its great economic importance and because the questions raised cannot be answered except by a specialist in marine biology.\n\nThough myriads of larval and immature fish are caught daily for duck food, pig food and manure, and thousands of pikuls are exported as dried fish refuse, it has been argued, while admitting ambai catches are used mainly as pig food, that it appears a debatable point whether the flesh value thus produced is not as great as the extra fish value which might be caught if the fry killed by ambai were left undisturbed!\n\nWe cannot afford to allow such points to remain debatable.\n\nLet us go on with the life history of the tiny fish which we left in the first stage of an active existence in the shallow waters near the coast. These shallows are the nurseries or recruiting grounds where the fry keep together in schools or shoals.\n\n\"After a period in relatively shallow water, the shoal migrates to deeper water. At first the migration is not to a great distance, but with growth the annual pulsation becomes greater and greater.\"\n\"The migration is not merely inshore and offshore, but is at the same time in a definite direction with respect to the coast.\n\nThus the life of the fish is spent until in from three to six years at the most, the call of maturity comes. In response thereto a migration takes place which appears to be usually beyond the limits of the seasonal migrations of the school.\"\n\nA few moments' consideration will enable one to realise that the life habits of every species of fish are subject to certain fixed laws. It is only a matter of systematic organised research to discover those laws and to apply the knowledge to the development of Malayan Fisheries.\n\nWe can learn what has been done in Canada, Great Britain and the United States, but this general learning must be supplemented by detailed local research. We must work out our own local tables.\n\nThere are, probably, no less than 2000 species of fish in Malayan waters. There are certainly not less than 500 species of economic importance, and if we take 250 species as being valuable Marine food fishes, some idea may be formed of the amount of research required before we shall be in a position to state definitely where a certain species may be found in full roe, where its spawning grounds are, where the recruiting grounds of its young are and when and where it travels during its seasonal migrations.\n\nInformation of this kind will enable our fishermen to catch fish in the best condition and in the greatest quantities and this is the information which the Fishery Departments of Canada and America give the fishermen, even to the extent of using aeroplanes, fitted with wireless, to locate shoals and disseminate information.\n\nThere is a great deal of knowledge, of which no use is being made, in the possession of many illiterate Malay fishermen, spread over wide areas, all along the coasts of Malaya. This knowledge should be collected and tabulated.\n\nThe Departments of Fisheries in Ceylon, Australia, India, the Netherlands Indies and the Philippines have published records dealing with the fishes which also inhabit our seas and, in consequence, the Fishery Officers and scientists have the benefit of a vast amount of scientific research work on which to build up local data.\n\nThough the question of damage to our marine fisheries has evoked some attention during the past two years, it is doubtful whether serious thought has been given to the terrible damage done to the fresh water fisheries by mining silt. Engineers have fought for their roads and railways against the invading silt, but, to judge from official reports, no one has fought for the fisheries and the need for protection of the riverine rights of the people would appear to have passed unnoticed.\n\n1 Meek, Migrations of Fish.\nWithin the writer's memory the main rivers of the West coast were fine clear streams. The waters provided irrigation for the rice fields and contained quantities of fine edible fish. These rivers are now thick turbid streams carrying a heavy burden of slime and silt.\n\nWe have probably one hundred different species of Carp alone, besides dozens of species of Catfish and many fine fish belonging to the families Osphromenidae, Notopteridae, etc., etc. Catfish can exist in slime and silt though it is questionable whether they can thrive, but Carp certainly require clear water to breed in.\n\nOne of our Carp the Kēlah (Barbus sp.) has been described by Swettenham as the finest fresh water fish he ever ate in the East, and the Kalui (Osphromenus olfax) is so highly esteemed that several attempts have been made to introduce it into France, and it has been acclimatised in Mauritius, Australia and parts of India.\n\nTin mining is necessary and some pollution of the rivers is unavoidable, but there have been many cases where carelessly constructed dams have broken and a turbid flood of slime has been allowed to pour direct into the rivers for months while leisurely repairs are being made. Though much of the damage done in the past is irremediable, let us hope that a more general recognition of the value of the fresh water fisheries will result in a fair measure of protection in the future. There are still rivers which can be saved.\n\nBy saving our fresh water fisheries we shall save, incidentally, our rice-fields, for Rice and Fish in addition to being the two staple foods of the country are inseparable. When you destroy one you destroy the other.\n\nWhere you can grow rice you can catch fish and where you can no longer catch fish you cannot grow rice.\n\nTo explain: the mining silt which pours into the rivers gradually raises the bed of the stream and so causes a rise in the water table. A rise in the water table limits the area of drainable land, and drainage is as necessary to a rice field as irrigation. So the area which can be planted with rice becomes smaller and smaller until eventually the water table is so high that the river channel can no longer carry off storm water. The resultant floods deposit a layer of slime and silt on the rice fields and complete the work of destruction.\n\nFish cannot breed in the rivers polluted with slime and silt, so the Fisheries and rice fields perish simultaneously. In our policy of construction and development these facts should not be lost sight of.\n\nThere is yet another point which has received no attention and that concerns anadromous Marine fishes which enter rivers to spawn. Among these fishes the principal one is the Shad (Tēru-\nbok), which ascends the rivers to a considerable distance during the breeding season. It arrives on the coast in enormous shoals, and twenty-eight years ago, as Skeat has recorded, they were invariably taken in full roe, when they are in the best condition.\n\nRecent reports show that Tērubok have fallen off both in quantity and, as the writer knows from his own experience, in quality, those now taken being mostly spent fish in which state they are positively unwholesome.\n\nThese fish used to be taken in such numbers that the nets contained more than the boats could load. Within the past few years the writer has, on several occasions, picked up these fish by hand in a dying condition apparently choked by silt in their attempt to ascend the rivers. Failing to ascend the rivers the Shad must either spawn in the sea or in the polluted lower reaches and in either case the eggs perish.\n\nUnfortunately, the migrations of the Tērubok do not, as far as the writer's experience goes, take it to the East coast of the Peninsula, so that, the Tērubok fishery of Malaya appears to be in danger of extinction.\n\nThis introduction would not be complete without some mention of the conditions under which the transport of fish from the source to the consumer takes place.\n\nThere is a general agreement that transport is bad. Many schemes have been evolved for ensuring rapid transport and reduced prices, but none of them have been put into practice and probably none are commercially practicable. A permanent scheme is required that can be built up by degrees; the writer has advocated in two reports the use of cold storage. While allowing that the expenditure will be great we should not lose sight of the fact that it will be a permanent and sound investment.\n\nLet us consider the existing conditions first.\n\nIn a temperate climate fish will keep fresh for days. Here, near the Equator, fish caught in the morning are in an advanced state of decomposition before the evening. Decay is arrested by the use of ice. For instance, ice manufactured in Kuala Lumpur is taken by train to Port Swettenham and sold to small middlemen who go to sea and purchase from the fishermen. These middlemen are bound as a rule to sell the fish to the ice dealers, who again sell to other middlemen, who sell to the retailers in the markets. The result is that fish costing $15 a pikul at sea cost $80 a pikul in Kuala Lumpur, 30 miles away.\n\nIce melts rapidly in the trains, in the boats, and in the markets. A box of fish must therefore contain an enormous proportion of ice to allow for wastage, and the fish instead of being fresh, cold, and wholesome are in a swollen and sodden condition.\nWhile these are the conditions under which fish are transported a few miles in this country, we are indebted to a single Cold Storage Company for the privilege of being able to purchase, if we can afford it, fish, meat, game, butter and fruit, imported in refrigerated chambers from Great Britain, the United States, Australia and China.\n\nBriefly, it amounts to this. We can eat foreign fish and foreign fowl but not the fresh produce of Malaya. Hundreds of tons of prime fish are caught every year on the East coast, where the inexhaustible supplies of the China sea are available, but all this fish is dried for export for lack of cold storage transport, though much of it is caught within 24 hours steam of Singapore.\n\nThere can be little doubt that the whole future of the perishable food business in this country depends on cold storage, but there is no decided opinion as to the part that the State should take in the development of the trade.\n\nIt was realised many years ago, that for sanitary reasons the ordinary shop house was not a suitable place in which fresh meat, fish, etc., could be exposed for sale, and, in the Malay States, the sale of such perishable produce is confined entirely to the markets built by the State.\n\nIt would seem, therefore, to be but reasonable and logical for the State to go a step further, and instal cold storage in the markets, and to rent space to the retail dealers in the same way that stalls are rented.\n\nThe State owns the railways which run from the coast to the market towns and the installation of refrigerated vans on the railways would appear to be a natural development of a State enterprise, as it is in other countries with State Railways.\n\nThis disposes of the problem as far as the Colony and the West Coast States are concerned but the problem on the East coast is quite different.\n\nThe development of the States on the East coast has been retarded because they possess no natural ports and harbours which can be entered during the North East monsoon.\n\nThough the deep sea can be fished all through the N. E. Monsoon and steamers run regularly up the East coast to Bangkok and Saigon, no fishing is done because the fishermen live on the mainland. A heavy sea breaks on the shallows and sandbanks which extend from the coast, and dangerous rollers break on the bars which guard the entrance to the rivers.\n\nFurther out, in twenty fathoms or so, the seas are regular, and conditions for fishing far better in every way than they are in a strong wind in the English Channel or in the North Sea.\nWe know that the sea off the coast of Pahang, Trengganu and Kelantan swarms with fish all the year round, and all that is necessary is a scheme for supplying the Western States and the Colony, where fish is now very scarce.\n\nThe writer advocates State enterprise in the establishment of cold storage depots on the islands, where there is always safe anchorage and shelter in smooth water.\n\nThere is a chain of these islands all the way up the East coast. An island with a cold storage depot will become a permanent fishing settlement. Rent would be paid by the fishermen for space in cold storage, to be collected when the fish is sold. So far State enterprise is advocated.\n\nIt would pay steamers, running from Bangkok, Saigon and China to Singapore, Port Swettenham and Penang, to call at these islands for fish, and those steamers not now fitted with refrigerating plant would install it.\n\nSchemes for ameliorating the lot of the fishermen by granting loans, etc., have not succeeded because no scheme protected the fishermen from the middlemen, but the depots which will be the Penny-banks of the fishermen, always ready to receive deposits, however small, until required, will render the fishermen independent of the middlemen.\n\nFor example, there would be nothing to prevent a group of Malay fishermen from consigning regular shipments of fish direct to a Malay retailer in the market.\n\nShipments would be so frequent that loans should be unnecessary, but allowing that loans were asked for, to start Malays working on a co-operative basis, as indicated above, there would be no risk in advancing money on the security of the stock of fish.\n\nWith State organised depots and State transport there would be a fair field for steam trawlers and steam drifters owned by Companies or individuals. The depots would receive the fish and save the trawlers a journey to port with every catch, and here again the middleman would be eliminated.\n\nThis work deals, very inadequately, with fishes only. Much could be written and will, no doubt, be written later about our Crabs, Prawns, Crayfish, Pearl oysters, Edible oysters, Scallops, Cockles, Corals and Sponges, but considerations of space prevent more than the briefest mention.\n\nThe writer has seen Pearl shell taken close to Singapore and has handled a pearl valued at £800 taken off the Kelantan coast.\n\nRock oysters grow well here, but as they take about three years to mature, and no native can resist taking them while still small, they are practically unknown in the markets.\n\nLeases could be granted and oysters cultivated. Sponges too, can be cultivated. Commercial sponges can be grown from cut-\ntings, like flowers, and are so grown in the Philippines, and there are yet other marine growths which can be cultivated in the gardens of the sea.\n\nFew countries have the potential fishery advantages that we possess and have neglected hitherto.\n\nOur position between the Indian Ocean and the China Sea is unique and not only gives us access to an unlimited area for deep sea fishing, but also accounts for the large number of species of fish.\n\nFrom Kuala Perlis on the West to Kuala Tabar on the East we have a thousand miles of coast line; more than some nations possess.\n\nAs to the vital importance of fish in the diet of all dwellers in this tropical country there is no question: as to the existence of an enormous area of potential fishing grounds there can be no dispute, and as to the large variety and good edible quality of our fish there is ample proof. Can we doubt therefore, with the experience of other countries to guide us, and while remembering that the economic stability of every country depends on the price of the peoples' food, that our fisheries are capable of enormous expansion and can we doubt that an enlightened policy of exploitation and regulation combined with constant scientific investigation will render the Fisheries one of the great economic assets of Malaya?\nMalayan Fishes.\n\nPART I.\n\nGIANT HERRINGS.\n\n(ELOPSIDAE.)\n\nThis family contains but few species; the individuals however, abound in the tropical seas and are of great importance both as food and game fishes.\n\nThe Bandang or Menangin (Elops hawaiiensis) is known to Americans in the Philippines & Hawaii as the Ten-pounder. It reaches a length of about 4 feet and is an edible fish of considerable value.\n\nThe Bulan-bulan (Megelops cyprinoides) is the Indo-Pacific Tarpon and is very closely related to the well known sporting fish of America. It is known in Australia as the Ox-Eye or Big Eyed Herring.\n\nIt has a very wide range extending from India to Australia and from East Africa to the Sandwich Islands. It is known to penetrate the rivers right up into fresh water and has been successfully cultivated in brackish or even fresh water.\n\nFrom an edible standpoint it ranks very high. Its flesh is firm, well flavoured and possessed of good keeping qualities. It attains a length of 5 feet and when our fisheries are better known it may, as Stead has remarked, \"turn out to be as great a sporting fish as the Tarpon.\"\n\nTHE FEATHER BACKS.\n\n(NOTOPTERIDAE.)\n\nThe Belida (Notopterus notopterus) is a fairly common fresh water fish which attains a length of well over three feet. The belly is said to be extremely rich and well flavoured but the back contains numerous small bones.\n\nTHE MILK FISH.\n\n(CHANIDAE.)\n\nThe Bandang or Jangas (Chanos chanos) is the well known Milk-fish or White Mullet and is known as the Salmon-Herring in Australia. It is a sea and estuary fish and feeds on \"sea moss,\" an alga (Oedogonium).\nIts cultivation is a considerable industry in the Philippines, the Sandwich Islands and Java, and Day records that, in South Canara, Hyder Ali introduced it from the sea into tanks of fresh and brackish water where it still thrives.\n\nSeale\\(^1\\) gives a most interesting and valuable account of the cultivation of this fish, which is known by the Filipinos as the Bangos; I quote the following extracts:\n\n\"The Milk-fish is one of the most important commercial fishes in the Islands. It is raised chiefly in the fish ponds at Malabon and at other places near Manila and therefore can be secured at any time regardless of the weather.\n\n\"This fish is particularly adapted to pond culture being a vegetable feeder of rapid growth.\n\n\"The eggs are deposited in the sea. The young appear during the months of April, May, June and July. They are to be found in great numbers along the beaches and are captured by the natives and placed in large earthen jars full of water called palyok. They are then conveyed to the fish ponds, frequently a hundred miles distant.\n\n\"One of the jars contains about 2,500 young Bangos. About 60,000 are used to stock one pond of 1 hectare. As the fish grow they are thinned out by transfer to other ponds. Thirty-three per cent should reach marketable size and a yearling should measure half a metre.\"\n\nFOOD OF THE MILK FISH.\n\n\"If it is desired to cultivate the food alga, the water of the pond is allowed to drain off and the clay is exposed to the full power of the sun. The alga rapidly makes its appearance and a little water is then permitted to cover the bottom. This is gradually increased as the Oedogonium develops.\n\n\"The average value of the ponds about Manila Bay is probably 40 centavos per square metre, giving a total of more than 6,000,000 pesos for the pond value alone, which I am convinced is a conservative estimate.\"\n\nThere should be no great difficulty in establishing a similar industry in Malaya and there are many mangrove areas on the West Coast of the Peninsula where series of ponds could be constructed.\n\nThere are many places where these fish are feeding on beds of sea moss and I saw millions of fry not far from Butterworth recently (March 21st) which a Javanese told me were Anak jangas. The Milk Fish attains a length of 5 feet. It is not often captured as it will not take a bait and will jump over a seine or drift net.\n\n\\(^1\\) \"Fishery resources of the Philippines.\"\nHERRINGS.\n\n(CLUPEIDAE.)\n\nThis is a very large and important family. The members range in size from the Parang-parang (Chirocentrus dorab) which is said to exceed a length of 12 feet to the Bilis (Stolephorus tri) which measures not more than 3 or 4 inches.\n\nAlthough this family is of great commercial importance in Malaya, and the Herrings, Shad, Sprat, Sardines, White-bait and Anchovies belonging to it are highly esteemed for their flavour and food value by the Malays and all Eastern races, they are unknown to the great majority of European residents in this part of the world, with the exception of the Bilis, which is occasionally seen served as \"White bait\" or as a sambal with curries or in bottled form as Macassar Red fish.\n\nFrom an economic point of view this family is second to none in importance and the fact that some of the most valuable kinds associate at certain periods in immense shoals accounts for the usefulness of the family as a food supply.\n\nThe following are the most important members of the herring family in our waters:\n\nThe Parang-parang (Chirocentrus dorab), the Terubok (Clupea (Alosa) macrura), the Selangat (Dorosoma spp.), the Tamban (Clupea (Harenula) spp.), (Dussumieria spp.) and (Spratelloides spp.), the Bilis (Stolephorus spp.) and the Bulu ayam (Engraulis spp.).\n\nThe Parang-parang is a very bony fish of excellent flavour and its capture by hand line provides a livelihood for several hundred Malays in Singapore alone.\n\nPassengers by steamers proceeding through the Eastern entrance to Singapore roads will see a large number of small canoes in the deep water channel and will hear the noise of the rattles, which each Malay fisherman wields unceasingly. These rattles do not attract the fish, but keep the hand occupied and the fisherman on the \"qui vive.\" The Parang-parang is not a greedy biter and does not stay in one place. He is a rapid swimming predacious fish who has no time for more than a snap as he darts through the water. Bites are usually few and far between and an inexpert or somnolent fisherman would catch nothing. With an ever moving hand engaged with a rattle the fish is struck and hooked almost at the instant he bites.\n\nThe Terubok is a Shad and is considerably larger than the ordinary herring. It is known to Europeans in India as the \"Hilsa\" or \"Sable fish.\" Day says:\n\n\"They are excellent as food until they have deposited their ova, when they become thin and positively unwholesome. Their flavour has been compared to a combination of that of the salmon and herring; they are rather heavy of digestion.\"\nThe roe of the Tērubok (Tēlor tērubok) is a highly valued delicacy and the fish are still caught in large quantities near Bēngkalis (Siak) and the roes dried and salted for export. Cantor writing in 1850, states that 40 years ago the Raja of Siak is said to have obtained an annual revenue of 72,000 guilders from the Tērubok roe industry alone.\n\nThe Sēlangat of the southern part of the Peninsula is known as Nandong in Penang and Kedah, and as Kēbasi on the East coast. It is also known to the Filipinos as Kabasi. The English or American name for it is the Basling Shad and in Australia a member of the same sub-family is known as the Bony Bream or \"Hair-back.\"\n\nIt is a bony little fish but very plentiful and cheap; it is dried and salted in enormous quantities both for local consumption and export.\n\nThe Tamban is one of our commonest fish and will eventually be one of our most important and valuable food fishes.\n\nDr. Cantor who wrote a catalogue of Malayan Fishes in 1850, says of the Tamban bulat: \"It is highly valued for its delicate flavour and passes commonly as a 'sardine';\" and of the Tamban nipis he writes, \"They pass in the Settlements of the Straits under the denomination of 'Sardines' in imitation of which they are sometimes preserved in oil.\"\n\nThe Moros in the Philippines have the same name Tamban for this fish and Scale writes \"Any of these sardines would compare favourably with the species put up in oil on the Pacific Coast.\"\n\nWe continue to import thousands of cases of sardines annually into the Straits and F. M. S., while our seas swarm with sardines.\n\nIt is popularly supposed that sardines are preserved in olive oil but I have more than a suspicion that refined coconut oil, sesame or gingelly oil, and other vegetable oils, which are largely exported from the East, return to us with the imported tinned herrings and sardines.\n\nThe Bulu ayam and Bilis (Moro: Dilis) are anchovies and sprats.\n\nStead writing of the Engraulis antipodum of Australia, says, \"For all practical and economic purposes there is no difference between our Anchovies and the famous fishes of that name in the Mediterranean Sea.\"\n\nA glance at the systematic list of members of the herring family will show that we have at least 8 species of Engraulis and 3 species of Stolephorus.\nQUEENSLAND-SMELT, ETC.\n\n(SCOPELIDAE.)\n\nOne of the best known members of this family is the Lumi or Luli (Harpodon nehereus) which, when newly taken, is brilliantly phosphorescent all over the body: in a salted and dry condition it is the \"Bombay-duck\" so highly esteemed by Anglo-Indians.\n\nIt is quite common in our waters. I have seen many immature specimens in purse-nets, but full grown specimens are often taken in sunken basket-traps off Singapore in the neighbourhood of the Karimon Islands.\n\nDay says \"this fish is highly esteemed as food whether fresh or salted.\" It is curious that this fish which is a delicacy in India should be disregarded in Malaya. Malays do not care much for it, as the flesh is soft and flabby and they prefer firm and flaky meat.\n\nThe Belungkor (Saurida tumbil) is known to Australians as the Queensland Smelt and is a fair edible fish, though somewhat dry.\n\nThe Mudin (Saurus myops) is a useful food fish.\n\n\"MILLIONS.\"\n\n(CYPRINODONTIDAE.)\n\nI have called these fishes \"Millions\" in the absence of any English name, because they belong to the same family as the fish known as \"Millions\" in Barbados. To this latter fish, which eats mosquito larvae, as our fish does, the immunity from fever, which the inhabitants of Barbados enjoy, is attributed. It is a tiny fish, very common in swamps and drains in Singapore and elsewhere.\n\nCAT FISHES.\n\n(SILURIDAE.)\n\nThis family which contains one fourth of the known fresh water fishes of the world is not represented in the British Isles, but in this region they are to be found wherever there is water and a muddy bottom, whether it be fresh, brackish or salt water.\n\nMembers of the family may be found in swamps, pools and roadside drains and many of the fresh water varieties will make considerable journeys overland to find new pools or streams. They are found in all our rivers and some species may be caught miles out in the sea. Some of the largest exceed 6 feet in length.\n\nWith the exception of the Lele and Lembat (Clariidae spp.) which have no spines, all the members of this family are armed with spines.\nThe Tapah has a pair of pectoral spines only, but the Sembilang, Patin, Lawang, Pedukang and Baung have both pectoral spines and a dorsal spine.\n\nA wound from these spines is extremely painful and the angler who captures one of these fish for the first time is advised to take a lesson from a Malay in the proper method of grasping them, which is very simple but worth knowing.\n\nThey are valuable food fishes and are in great demand among all Malays, Chinese and natives of India. Some species are considered to possess exceptionally nourishing qualities and are prescribed for patients recovering from illness.\n\nThey will live for hours out of water and can be transported for long distances.\n\nThe popularity of the Krian district of Perak among natives of India is due primarily to the rice fields and secondly to the fact that cat-fishes, as well as other fish, swarm in the rice fields and irrigation ditches.\n\nA volume might be written on the Cat-fishes alone. One interesting characteristic is the great care they take of their eggs and young. The Pedukang, for instance, lays very few but very large eggs which look like gelatine capsules and these they carry about in their mouths. As the Pedukang are among the commonest estuarine fishes, any observer can obtain them during the breeding season and see for himself the egg in every stage of development, and in the final stage, immediately before hatching, the tiny fish is distinctly visible through the translucent envelope of the egg.\n\nLOACHES AND CARP.\n\n(COBITIDAE & CYPRINIDAE.)\n\nOnly two Loaches, the Ikan pasir and the Lali, are mentioned in this work, but judging from records of species in Java, Sumatra and Borneo, there should be at least 20 species.\n\nThe Ikan pasir (Acanthopsis choirorhynchus) is quite common in the Pahang river and is good eating.\n\nThe Carp family of fresh water fishes to which our Roach, Tench and Gudgeon belong is represented in our Malayan rivers by certainly not less than 100 species.\n\nThe very incomplete list in this book gives some 28 Malay synonyms only. There is an interesting hobby and good sport with a fly and spinner awaiting any planter or prospector who lives near the upper reaches of any of the rivers in the Peninsula. An oil drum can easily be converted into a specimen tank in which rare fish may be preserved in spirit. The Directors of the F. M. S. and S. S. Museums would be only too glad, I feel sure, to mount and display specimens, and as the field is practically untouched the collector has more than a sporting chance of discovering and perhaps giving his name to a new species.\nDuring the breeding season, the males of many species assume a more brilliant livery, or develop excrescences and tubercles on various parts of the head, especially on the snout, or also on the body and fins.\n\nThe common Carp of Europe is said to have been introduced from China early in the seventeenth century. The Chinese continue to import Carp into Malaya and to grow them in stock-ponds. The imported Carp are the Tiam (Chinese) (*Labeo molitorella*), the Ling (Chinese) (*Cyprinus carpio*), and the Hwan (Chinese) (*Ctenopharyngodon idellus*).\n\nThe ova are shipped from China in large jars full of fresh water and the contents of the jars are regularly and vigorously stirred with a stick or paddle during the voyage, to oxygenize the eggs, and by the time the jars arrive in this country they contain thousands of fry.\n\nThese fish are very popular among the Chinese and fetch high prices in the markets. They attain a length of three feet or more and a weight of perhaps 20 to 25 pounds. The utilitarian owners feed them on food of such a disgusting nature, principally excreta, that I can say nothing as to their edible qualities, as I have never felt any wish to taste them.\n\nI imported some many years ago and intended to stock a pond in Kuala Pilah but unfortunately the ship was placed in quarantine and as their period of confinement in jars is limited, all the fry perished. These imported Carp have not, so far as I know, been bred in this country and it is more than likely that they require fresh running streams for the natural development of their ova.\n\nThe question of stocking some of our streams may be worth consideration, but I doubt it, as we have so many indigenous Carp. In this connection it is well to remember that these Carp which have been artificially bred for centuries, have yielded numerous examples of hybridism. I have read in an American magazine of a sportsman who for lack of other bait used aquarium gold fish (Carp) very successfully as live bait. He kept a stock of them in a fountain where they interbred with small species of American Carp with the most extraordinary results.\n\nProfessors Max Weber and de Beaufort write of the *Cyprinus*, \"Distribution: Fresh water of temperate parts of Asia and Europe, from where introduced in many parts of the world and changed into many varieties.\"\n\nWe have many species of *Barbus* including the famous sporting fish the Mahseer of India, our Temoleh (*Barbus mosul*). The Kerai (*Barbus neilli*) is said by Day to attain a weight of 50 or 60 pounds.\nThe Catla (*Catla buchanani*) of India, Burma and Siam has not yet been identified in our rivers and as it attains a length of at least 6 feet and a corresponding weight, I suggest the quest of the Catla, as a sound sporting proposition, to the anglers of Kuala Lipis, and other up country stations, with a good chance of success.\n\n**EELS.**\n\n*ANGUILLIDAE, MURAENIDAE, CONGRIDAE, ETC.*\n\nThe Eels are placed on the Order *Apoidea* which has several families and not less than 30 species, represented in Malayan waters. Eels are more popular perhaps with the Chinese than with any other race in Malaya. The Congers (*Malong*) are quite common and find a ready sale in the markets.\n\nOne eel (*Thyrsoidea macrura*) known as the *Pampan* or *Pompa* by the Javanese is probably the largest eel in the world and exceeds 10 feet in length. It has been found in the shallow seas and estuaries, and even rivers, of Sumatra, New Guinea, Natal, India, Ceylon and Queensland, but has not yet been recorded by local scientists.\n\n**SWAMP-EELS.**\n\n*SYMBRANCHIDAE.*\n\nThe *Belut* (*Monopterus albus*) is confined to the fresh or brackish waters of Burma, the Malay Archipelago and China.\n\n\"This eel is numerous at Chusan, in streamlets, canals, and estuaries. As it is a favourite article of food it is kept by the inhabitants of Chusan in large jars, with fresh water. But it is capable of living a considerable time out of water. It is of voracious habits, feeding on smaller fishes, and it takes hooks baited with earthworms.\" (Cantor).\n\n**SEA-HORSES AND SKELETON-FISHES.**\n\n(*SYNGNATHIDAE & AMPHISILIDAE.*)\n\nThe little Sea-Horse, *Kuda-kuda laut* (*Hippocampus* spp.), which is so like the conventional knight of the chess-board, is a familiar object in most Museums. It has, of course, no economic value.\n\nA peculiarity of this curious family is that \"the males are provided with a pouch (in some species there is only a broad groove) in which the eggs are hatched after being deposited by the female.\n\n\"The males take full charge of them, and the young remain in the pouch usually for a short time, after being hatched.\" (Stead).\n\nThe Skeleton-Fish, as I have called it, *Amphisile scutata*, is known to Malays as *Ikan kering*. It is only a few inches long and, as it has practically no flesh on its bony carcase, it has no edible value.\nGAR-FISH, GAR-PIKE AND FLYING-FISH.\n\n(SCOMBRESOCIDAE.)\n\nMost of the members of this family, of which about 200 species are known, are marine: some are carnivorous, and others mainly herbivorous, feeding on green algae. Nearly all are in the habit of making great leaps out of the water, this tendency culminating in the Flying-fish (Exocoetus), and there is every passage between the small pectoral fin of a Gar-fish and the swallow-like \"wings\" of the most developed Flying-fish.\n\nThey are excellent edible fish and the Todak (Belone spp.) which have green bones are nevertheless very palatable and useful food fish. There is a more or less prevalent idea that fishes with green bones are poisonous; this is one of the popular fallacies which no facts or arguments will ever overcome.\n\nThe Puput or Jenjulong (Hemirhamphus spp.) or Half-beak can be easily identified by the fact that the lower jaw only is prolonged. Both jaws of the Todak are prolonged into a long slender beak.\n\nThe Todak though common is a very shy and wily fish. It gives a boat a wide berth and though a rapid swimming and predatory fish it disdains ordinary lures and baits. The Malay fishermen, however, circumvent them by fishing with a kite from which dangles a length of fine line terminating in a noose. The bait is attached to the noose. Given a breeze sufficient to keep the kite flying, quite good sport is obtained, perhaps a dozen fish or more in an hour. The Todak makes a fierce dash at the bait, the noose tightens round the upper jaw, and the recurved teeth prevent the noose from slipping.\n\nThe Puput is also a shy biter when it sees its would-be captor at the other end of a rod or line, and the Malays consequently use short baited lines attached to floats (Pelontang puput) which they send adrift and pick up when the movements of the float show that a fish is firmly hooked.\n\nFlying-fishes are very good eating but not often obtained. I have picked them up on the deck after a squally night at sea.\n\nSAND-SMELTS.\n\n(ATHERINIDAE.)\n\nThese pretty little fishes, called Rennyau or Paku in Malay, are common all along our coasts and also frequent estuaries and tidal rivers. Seale¹ writes:\n\n\"It is almost impossible to land at any wharf or to go ashore on any beach without seeing these little fish in countless numbers. They usually grow to a length of from 10 to 12 centimeters. They have a greenish tint on the back and a bright silvery band on the sides.\"\n\n¹ Fishery resources of the Philippines.\n\"There are five or six different species.\n\n\"The most common species is possibly *Atherina temmincki* (Bleeker).\n\n\"They are known as 'pescados del rey' or fishes of the king, among the Spaniards.\n\n\"They are greatly valued as food. The young are termed white bait. The method of catching is usually by seine or corral. A profitable industry could be built up by preparing these fish in a good sauce, by pickling them with spices, or by drying. They abound at all seasons.\"\n\n**GREY MULLETS.**\n\n*(MUGILIDAE.)*\n\nThe Grey Mullet are a widely distributed and very important family. They inhabit shallow water in the seas, estuaries and rivers; and none are known to occur in very deep water.\n\nTheir habit of keeping to the shallows, in large shoals, renders their capture, in enclosures, which dry out at low tide, and in mullet nets, an easy matter. As there are no restrictions as to size and no close season, mullet are getting scarcer every year in Malayan waters.\n\nGrey Mullet feed, more or less, on the organic matter found in mud and they are peculiar among fish in that they have a true gizzard, lined with a thick horny epithelium.\n\nMullet are very common and highly appreciated in Australia. Stead¹ writes:\n\n\"During a recent year in New South Wales alone 45,000 baskets of Mullet—principally Sea Mullet—were received for disposal at the various fish markets. The average basket of Mullet contains about 75 pounds weight; and, if we calculate the fish at an average of one pound weight each, we find that we have the imposing total of 3,375,000 individuals.\"\n\nIn New South Wales Mullet may only be netted at certain times and at certain places, and there is a legal limit as to size as with all valuable edible fish in that Colony.\n\nThe breeding season with most of our Mullet appears to be between November and February during the N. E. monsoon.\n\nAt this time I have seen the *Anding* in myriads in the surf near the mouth of the Trengganu river and other rivers on the East coast. A quantity of yellowish foam and scum is brought down by the rivers which are usually in full spate in November and December, and this foam either contains food or provides a suitable shade and shelter for the ova of the Mullet which are, I believe, pelagic or floating eggs. A day of steady incessant tropical rain during the N. E. monsoon is the day above all others to which all\n\n¹ Fishes of Australia.\nTrengganu Malays, male and female, look forward. When the rivers are in full flood, the sun obscured, the N. E. monsoon blowing half a gale, the surf thundering on the beach and full of yellow yeasty foam, then you will see all the Malay ladies trooping out in their best silk coats and sarongs, and all the old blades and young bloods are in attendance.\n\nThey are all out for the day to enjoy themselves and to catch mullet and the more it rains and blows the better they like it, the ladies, perhaps, because their vivid silken raiment looks best when it is wet, or may be it fits their figures better so, and the men, perhaps, because they will catch more mullet!\n\nThese ladies have designed and made their own costumes. Raw Chinese silk has been teased, wound and spun; fast dies of vivid colours—orange, pink, vermilion, green; every colour and every shade have been prepared from roots, bark and leaves, and the garments have been woven in intricate designs, tartans, checks, watered silks and shot silks; a creative art which has been lost on the West, and will soon be lost on the East Coast, in these days of cheap imitation silks and aniline dyes. But let us get back to the mullet and the rain.\n\nAnd the more it rains the fresher keep the flowers in the ladies' hair. These ladies wear no hats and there are no collars, draggled skirts or squelchy boots in this picnic party.\n\nLet us again to the mullet. Now this catching of mullet is an affair of casting-nets and he who catches the most mullet is some ace. It is not a simple poaching trick of slinging a net over a sleepy fish in a pool, but quite a different business, I assure you.\n\nThe nets are made of the finest and strongest cotton, waterproofed in white of egg which renders them to the touch, for a season, as though they were made of the finest gut or sinews. The small net or jala unding when thrown covers perhaps 100 square feet of surface and it is weighted with little chains of pure tin. The light cord attached to the thrower's wrist is usually 30 feet long and the net is often thrown so as to drop fully expanded at the full extent of the cord, and that throw is in the teeth of a North-east gale.\n\nEach fisherman has perhaps two or three such nets and, in reserve, a much larger and stronger casting net for the Pelong which is the giant of all our mullet.\n\nKeeping far back on the sandy beach, the men follow the shore line until mullet (Anding) are seen, and, to the novice, it is a difficult matter to see them. But there they are, and when you know what to look for, in the smother and foam, you will notice little black heads, in hundreds, between the breakers. Now these Anding are the shyest fish that swim. A wave of the hand and they have disappeared to pop up again at a distance further seaward, where no man can hope to reach them.\nThis, then, is the manner of their capture. There will come a moment when a great wave, like a wall, hurls itself on the beach. In fact these waves do it all the time! However, there is measure of two or three moments and no more when that wave stands like a wall between you and the fish, and the fish forget your existence. In that brief time your caster of the mullet net sprints down to the very verge of the breaking wave and up to or over his knees in the water; the net truly held and truly swung, with a long pendulum swing, clears the crest of the approaching wave and falls fairly on the group of mullet concealed in the hollow beyond, and in this way perhaps he may be fortunate enough to take one or two hundred fish in one cast. But you will serve a long apprenticeship, and will, when learning, throw half a hundred times and have no mullet.\n\nWhen the sport is in full swing perhaps 10 or 20 men dart simultaneously down the beach and as many nets shoot out and over the wave. Suddenly there comes a wild yell of excitement. Pelong which have been disturbed or enclosed in the Anding nets leap several feet in the air and break their way through the nets. Silvery six-pounders and even larger fish instinctively jump when their brothers jump. There is a rush up the beach and a race back to the breakers with the Pelong nets. The nets are thrown at random (tebar rambang) in every direction. There may be a shoal of Pelong and, if so, some excitement I promise you.\n\nOnce a Pelong sees the net over him, he makes one upward dash to the apex of the net. The fisherman hurls himself at the fish and must grasp him then or not at all, for the next powerful dash for liberty takes the fish down to the bottom and he is under the chains and out of the net before you can wink. Out of your depth in a strong surf with a couple of lusty Pelong in your arms and a smother of net, chain and cord about you, you come to the conclusion that life was never more worth living and that if you are off to kingdom come you will take the Pelong with you.\n\nAs I write, at Tanjong Katong, Singapore, I can see some Boyanese, syces probably, with baby casting nets catching shrimps, sprats and baby fish in a sea like glass; a miserable messy business. The real gladiators of the casting net are to be found only on the East coast.\n\nOur Mullet (Belanak) include the Jempul (Mugil planiceps) which attains at least a foot and a half in length.\n\nThe Tamok (M. waigiensis), according to Day, attains at least 3 feet in length. The Anding and Kedera, which grow to about a foot and a half, are excellent eating.\n\nThe Belanak tamok (M. waigiensis) is known in Australia as the Diamond Scaled Mullet. It attains a weight of several pounds and is of a pretty silvery colour, each scale being prettily margined with black.\nTHREA D FINS.\n\n(POLYNEMIDAE.)\n\nThese fish are all excellent as food and from some rough isinglass or fish sounds are obtained.\n\nOne of our Kurau (Polynemus paradiseus) is the Tupsi fish of India and the Mango fish of Burma. This small fish which attains a length of about 9 inches only, is considered a great luxury both in India and Burma. It has very long filaments, longer than itself, proceeding from each side, just below the pectoral fins.\n\nThe common Kurau (P. indicus) attains a length of 4 feet and about 20 lbs. in weight.\n\nThe Kurau janggut (P. tetradactylus), which is also known on the Queensland coast by the very unsuitable name \"Cooktown Salmon,\" grows to a very large size.\n\nDay quotes Hamilton Buchanan as observing \"I have been assured by a creditable native that he saw one which was a load for six men and which certainly therefore exceeded in weight 320 pounds avoirdupois.\"\n\nBARRACUDAS.\n\n(SPHYRAENIDAE.)\n\nThe Alu-Alu are carnivorous and highly voracious fishes which give good sport with a trolling bait or spinner.\n\nCantor mentions two species only, S. jello and S. obtusata, as inhabiting the seas off Penang and Singapore but I have a snapshot of one taken by me off Pahang which does not agree with Day's plates of either of these fish and is I think S. novae-hollandiae. It is more than probable that other species will be discovered in these waters.\n\nA well known American game fisherman from Honolulu who visited Singapore recently recognised the fish both in the Singapore market and from the photograph as the Alu-alu of Hawaii.\n\nRoughley¹ writes of Sphyraena novae-hollandiae,\n\n\"The Short-finned Pike is an edible fish of very considerable value and is deservedly popular, though it has probably never been tasted by a very great portion of the community.\n\n\"It forms one of a too numerous collection of very valuable table fishes which are scarcely utilised, owing to the unenterprising methods adopted in their capture.\"\n\n¹ Fishes of Australia.\nPOMFRETS.\n\n(STROMATEIDAE.)\n\nThe Bawal is one of our well known and most popular edible fish and takes a high place among our very best food fishes.\n\nOf the three species known, the Bawal chermin (Stromateus atous) is most esteemed, though all are good.\n\nThe Bawal puteh and Bawal itam (S. cinereus) are identical, the fish getting darker as it reaches maturity. A shoal of immature fishes of this species seen on a calm, clear night is a most beautiful sight. In the reflected light of the moon, they look like tiny silvery stars. The Malays call them Bawal bintang. When mature they are a darker gray colour.\n\nThe mature Bawal itam are very much better eating than the immature Bawal puteh.\n\nThe Bawal tambak (S. niger) is the largest of the family. It grows to a length of two feet and is excellent eating.\n\nThese fishes are considered by fishermen the stupidest fish that swim. They have a curious sheep-like habit of huddling together and are also afflicted with a kind of ovine curiosity. They will follow anything that excites their curiosity such as a boat and this habit leads to their capture.\n\nWhen a shoal is observed the fishermen manoeuvre their boat so as to attract the interest of the fish until they are all following in a compact flock. At the same time the boat is taking a circular course and the net is being shot very quietly. At the right moment all the fishermen raise a tremendous din with clappers and at the same time splash the water with their paddles. The shoal does a perfect right-about turn and each fish dashes headlong into the net.\n\nMURREL.\n\n(OPHIOCEPHALIDAE.)\n\nThese fresh-water fishes are provided with a respiratory organ on each side, above and communicating with the gills, which enables them to breath atmospheric air.\n\nThey can live for long periods out of water and travel over the land from one piece of water to another. They are useful food fish and well adapted for pond culture provided that the pond is well stocked with the small fish and frogs on which they feed, but if the food runs short, they will go elsewhere.\n\nDay writes, “Jugglers both in India and China exhibit these fishes walking on the land, and children amuse themselves by making them crawl along.”\n\nThe young as a rule are of a more or less orange or scarlet colour.\nThese fishes appear to be monogamous, some breeding in grassy swamps or the edges of tanks and others in holes in the river banks.\n\nThey construct nests amongst the water-weeds where the ova are deposited. When very young the fry of all species, Aruan, Toman, Bujok, etc., keep with, and are defended by, their parents, but as soon as they are sufficiently strong to capture prey for themselves, they are driven away to seek their own subsistence: those which are too obstinate to leave being eaten by their progenitors.\n\nThe Malays have a saying Bagai toman makan anak, “Like the Toman fish which eats its own young,” which is applied to persons in high places who misuse their powers, oppressing those whom they should protect.\n\nThe Aruan and Toman will readily take a bait, especially a frog, and are said to rise to the salmon fly. The largest run well over 3 feet in length.\n\nThey are caught in great quantities in the Krian irrigation reservoir at Bukit Merah and sent alive in tubs all over the F. M. S.\n\nNANNYGAI.\n\n(BERYCIDAE.)\n\nThe Sëbëkah karang (Myripristis murdjan) is a small fish of no particular economic importance.\n\nThe Berycidae, of which there are about 70 species, live, mostly at great depths, in the seas all over the world.\n\nThe “Nannygai” of Australia, which belongs to this family, is highly esteemed on account of its delicate flavour and firm white flesh. Roughley writes,\n\n“Until recently the supply of ‘Nannygai’ to the market has been an intermittent one, occasional specimens only being found there.\n\n“The trawlers have now quite altered this and large quantities are being received from them daily, with the result that it is one of the commonest fish seen in the market.\n\n“Hundreds of people visiting there in search of trawled fish are now seeing the ‘Nannygai’ for the first time.”\n\nI suggest that the capture of the “Nannygai” and other, hitherto unrecorded, species of good edible deep water fish, by means of a commercial steam trawler, is well within the region of possibility. We have, as a perusal of this book will shew, many fish in our waters which range as far as Australia but no engines or methods of capture are utilized in our waters which take bottom feeding fishes in depths of 50 fathoms.\nRoughley writes, \"The most prolific grounds are found to be between 50 and 60 fathoms in depth,\" and again, \"Many species, which before the advent of trawling were very rarely seen in the markets and which were in fact considered by many to occur only in small numbers on our coast, could now be counted in thousands.\"\n\n**KNIGHT-FISHES.**\n\n*(MONOCENTRIDAE.)*\n\nThe *Sētonggang* (*Monocentris japonicus*) is a curious little fish with enormous bony scales and two long ventral spines. It has no edible value.\n\n**\"BULL'S-EYES.\"**\n\n*(PEMPHERIDAE.)*\n\nI have no personal knowledge of these fishes and, as they are never captured in numbers, they are unimportant from an economic standpoint.\n\n**\"DRUMMERS.\"**\n\n*(KYPHOSIDAE.)*\n\nThe *Tēlan rumput* (*Kyphosus cinerascens*) as its name explains is a herbivorous fish, subsisting chiefly on \"sea-grass\" and \"sea-moss.\" It is a congener of the Drummer of New South Wales (*Kyphosus sydneyanus*) and belongs to the same family as that excellent food and sporting fish known in New South Wales as the Blackfish.\n\n**DUSKY-PERCH.**\n\n*(LOBOTIDAE.)*\n\nThe *Pēchah pēriok* (*Lobotes surinamensis*) is a large perch-like estuary fish which reaches a length of 3 or 4 feet and a weight of 25 to 30 pounds. It is known in Australia as the Dusky Perch.\n\nAccording to Boulenger's classification, the family contains two genera, *Lobotes* and *Datnioides*, each with two species, and though the two species of *Datnioides* are known to occur in the estuaries and rivers of the Malay Peninsula, they have not yet, as far as I am aware, been identified under a Malay name.\n\nThe *Pēchah pēriok* is an excellent food fish and it readily takes a fish bait.\n\nIt has a very wide range, being found in Queensland, the West Indies, on the east coast of the United States of America, as far North as Cape Cod, in the Mediterranean Sea, India and China.\nBLOW-PIPE FISHES.\n\n(Toxotidae.)\n\nThe Ikan sumpit or Sumpit-sumpit (Sumpitan, a blowpipe) is so named from its method, unique among fishes, of shooting water from its mouth at insects which it perceives close to the surface.\n\nThey are very common estuary fishes congregating under piers, fallen trees and branches, where they may be both seen and heard spitting at flies and similar small game, which they knock down with surprising accuracy.\n\nIn the second edition of Day's Fishes, this shooting habit is erroneously attributed to another fish, Chelmo rostratus, which is also known to the Malays as Ikan sumpit, and a note under Toxotes reads, \"It is stated in some works that these wide mouthed fishes shoot insects with a drop of water....... The action is one which the mouths of these fishes appear incapable of effecting.\"\n\nThere is ample evidence, however, to prove that Toxotes do shoot, and though their mouths are large it will be noticed that they have the projecting lower jaw of the true cuspidore artist.\n\nChelmo rostratus, on the other hand, though it has pipe-like projecting jaws, is a fish which is found at sea in the neighbourhood of coral reefs where flies and insects must be rare.\n\nIt owes its name \"Sumpit-sumpit\" to the fact that, after capture, it spurts water through its mouth.\n\nToxotes chatareus grows to a length of about one foot and I have taken several with a rod when fishing with prawn bait for Siakap, between half and three quarters of a pound. They are quite good eating.\n\nFRESH-WATER PERCHES.\n\n(Nandidae.)\n\nI have no information regarding the Kepau or Patong (Cupra fasciata) which is the sole member of this family recorded in our waters under a Malay name.\n\nSEA-PERCHESES.\n\n(Serranidae.)\n\nThe very incomplete list in this book gives some 45 species of Sea-perches. The family is a very large and most important one, containing as it does, not only some of our largest fish but also many of our best edible fish including the Ikan merah. Nearly all the members of this family are carnivorous fishes which take a bait readily.\n\nI propose to mention only a few of the most important ones.\nThe Siakap or Kakap (Lates calcarifer) is also found in the seas and estuaries of India where it is known to Europeans as the \"Cock-up\" and its range extends to Queensland and Western Australia, where it is generally known as the \"Barramundi.\"\n\nIt is a fine sporting fish and runs to a considerable size. The largest that I have heard of was taken in the Bay of Bengal by the Government trawler \"Golden Crown\" and weighed 580 pounds. Before I read of this fish I used to be satisfied with 40 or 50 pounders.\n\nThe Kērapu (Epinephelus spp.) are very well represented in our waters and are fine edible fish. Some species lose their bright colouring soon after they are caught and have a dull mottled appearance when exhibited in the fish market which would not attract a purchaser unacquainted with the fish. From an edible point of view the Kērapu differs little from the Ikan merah, the latter fish owing most of its popularity to its colour.\n\nKērapu from 50 to 70 pounds in weight are occasionally seen in the markets and the Kērētang (E. pantherinus) is commonly seen up to two or three hundred pounds in weight. Any Malay fisherman will tell you of a Kērētang of fabulous size which he hooked and fought for hours, being worsted in the end because his boat and gear were too light to make any impression on the fish.\n\nVery large ones are occasionally taken in fishing stakes (Kelong) and I have heard that the captors, on these occasions, tickle the monster until they get it quiet and then pass a strong rotan through its gills by which it is finally secured and hauled up.\n\nThe largest Kērētang I ever saw was taken by a Malay and myself. We had to sink our boat after we had fought the fish to a finish in order to load it; the weight, for there were no means of weighing it, was estimated at 6 piculs, i.e. round about 800 pounds.\n\nThis fish appears to me to be identical with the Queensland Groper illustrated in Stead's \"Edible Fishes of New South Wales\" under the name Promicrops itaiara.\n\nI have read that this fish derives its name Groper from its habit of groping about the rocks but I suggest that the name originated in Malaya or India. The Tamil name is Kurrapu. The Malay name is Kērapu. The Brunei Malays know it as Kurapa. In the Philippines it is known to the Filipinos as Garropa from which the transition to Groper or Grouper is a slight one.\n\nOne of our Kērapu (E. tauvina) is known in Australia under the names Brown-spotted Hind and Black-spotted Rock-cod, and of this fish Roughley writes, \"It is of fine edible quality and grows to a length of at least four feet.\"\n\nIn America members of this family are known as Sea-Bass.\nThe \"Snappers\" include our Ikan merah which is known as Jēnēhak in Penang (Lutianus spp.). There are perhaps more than 20 species in local waters of which the list in this book gives 13 only.\n\nTwo or three Snappers are of a brownish colour, but the colouring of the rest of this brilliant family ranges between crimson, scarlet and golden, while some have violet, purple and blue bands.\n\nThey are all good edible fish and no swagger dinner in Singapore is supposed to be complete unless Ikan merah appears on the menu. Their popularity makes them expensive.\n\n\"WHITINGS.\"\n\n(SILLAGINIDAE.)\n\nThe Bulus-bulus (Sillago spp.) is one of our common market fish and can be obtained all the year round, though never in large quantities.\n\nThe Sillago sihama is known in Madras as \"Whiting\" and Sillago maculata is called the Trumpeter Whiting in Queensland and New South Wales where it is greatly valued for its excellence as a food fish.\n\nThey frequent shallow water and sandy bottoms where they feed on small crustaceans, worms, sand hoppers, etc. There is probably no cleaner feeding fish than the Whiting, a fact which perhaps accounts in some measure for its delicate flavour and wholesomeness.\n\nBoth our varieties, whether adult or young, are very shy and instantly bury themselves in the sand on the appearance of any danger. Even a passing dark cloud leads to their immediate disappearance into the sand whence they emerge a few moments later.\n\nRoughley writing of another species, which has the same habit says:\n\n\"In the capture of this fish the hauling net is principally used. It displays considerable resource in evading the net, giving at times much trouble to the fisherman. As it is hauled near the shore, many fish, perceiving that they have been trapped, quickly burrow into the sand. Were not the fisherman alert to this cunning method of evasion, a large number of fish would be lost, but when it is known that the haul consists, in the main, of Whiting, they carefully tramp over the sand enclosed by the net and upon feeling any movement beneath their feet, quickly grab the concealed fish.\"\n\nWhiting fishing is perhaps the nearest thing to trout fishing that the sea-angler can obtain. A light rod, fine tackle and small hooks are required and the sand flats should be fished on the flood tide. The bait should be cast as far as possible. The fish will be taken in water only ankle deep and the best bait are prawns, small bivalves, Rēmis, Kēpah, etc., which are found on sandy beaches, and beach worms, Pumpun sarong and Pumpun darat.\nJEW FISHES.\n\n(SCIAENIDAE.)\n\nAbout 150 species of this family are found in various parts of the world. Nearly all are of economic value, some being highly so, and many of them reach a very large size.\n\nThe Tëmbëreh (Sciaena diecanthus) is one of the commonest coast and estuary fishes and perhaps the largest member of this family in our waters. It attains a length of at least 5 feet.\n\nThe Gëlama (Otolithus spp.) are among our commonest fishes. They travel in shoals numbering many thousands and are taken in deep water hauling nets (Pukat pëtaram) by Trengganu and Kelantan fishermen. These fish are dried and salted on the East coast and thousands of pikuls are exported annually.\n\nThe Gëlama will take a bait but are hardly worth fishing for as they give no sport and are insipid table fish even when quite fresh. As \"ikan këring\" with curry they are quite good.\n\n\"SILVER-BREAM.\"\n\n(GERRIDAE.)\n\nThese are small fish inhabiting all tropical seas and entering estuaries.\n\nAccording to Day these fishes are eaten by the indigent classes in India being little esteemed when fresh, but as they salt and dry well, large numbers are prepared in this manner for use.\n\nThe family contains about sixty species of which only six are mentioned in this work. Some 15 species are found in Australia and 23 in Indian waters. They rarely exceed a length of ten inches: nearly all have a plain silvery coloration.\n\nIn America, the fishes of this family are known as \"Mojarras.\"\n\nThe Kapas-kapas (Gerres sp.) will take a bait, preferably prawns or beach worms, and may be caught in the vicinity of fishing stakes (Kelong) as in and also near reefs. When freshly caught it will be found quite a pleasant table fish with comparatively few bones.\n\nSELEMAH.\n\n(LACTARIIDAE.)\n\nThe Sélëmah is the sole member of this family and is not a fish of much economic importance. It grows to a length of about 10 inches, and is eaten by the natives either fresh or salted but is said to be insipid.\n\nIt appears in Malabar in shoals during the months of February and March.\n\nThey enter the Straits during the N. E. monsoon but not in large numbers and I am informed by Malay fishermen that they rarely take more than half a dozen on any one day.\n\nThey do not take a bait but a few find their way into nets and traps.\nGRUNTERS.\n\n(PRISTIPOMATIDAE.)\n\nThis family contains about 130 species belonging to four genera, of which three genera inhabit our waters, viz. Pristipoma (Gērut-gērut), Diagramma (Tēbal bibir) and Pentapus (Sēlinching).\n\nThe Gērut-gērut are good food fishes and take a bait readily. They are fond of back waters and one species (P. guoraca) is said to have been captured in fresh water.\n\nI have taken several in brackish water and found them, when freshly cooked, excellent eating.\n\nOur largest species (P. hasta) attains a length of about 18 inches and is known in Australian waters as the Queensland Trumpeter. Of this fish Stead writes, \"The Australian home of this magnificent food-fish is principally along the coast of Queensland where it is well and favourably known.\"\n\nThe names Gērut-gērut and Trumpeter are descriptive of the grunting noise the fish makes after capture:\n\nThe Tēbal bibir are also good edible fish and attain a length of two feet or more.\n\nI have no personal knowledge of the Sēlinching (Pentapus) and place it here from a description supplied to me, together with a pocket-kodak snapshot which does not display the fish very well.\n\nSEA-BREAMS.\n\n(SPARIDAE.)\n\nThis, again, is an important family which includes many varieties of valuable food fishes. Some are carnivorous.\n\nFollowing Dr. G. A. Boulenger's classification, the principal genera found in Malayan waters are Scolopsis, Synagris, Caesio, Crenidens, Lethrinus and Sparus.\n\nOf the Gērētak lantei (Scolopsis spp.) of Singapore, so called from the parallel bands which distinguish most species, I can say little. The only species of Scolopsis with which I am familiar are the Anjang-anjang and Kērisi bali, which are occasionally taken when fishing for Kērisi.\n\nThe Kērisi (Synagris spp.) are beautiful little fish of a roseate hue with yellow and silvery bands. They are very common all up the east coast where they can be taken with a line, practically anywhere, in fairly deep water on a sandy bottom.\n\nThey average perhaps five or six to the pound but I have taken them up to a pound or more in 30 fathoms near Tioman Island. Kērisi fishing is, or used to be, the favourite out-door sport of the Malay Princesses of Pahang, and during the S. W. Monsoon regular expeditions were made to the Kērisi grounds and\nthe little fish would be hauled in until the boats were deep in the water and the Royal ladies exhausted. At the right season, there are few more delicate flavoured fish than the Kērisi and they remind one of really good Whiting.\n\nBut they must be absolutely fresh and caught on the right ground; if out of season or stale, Kērisi have an unpleasant tang about them.\n\nThe Dēlah (Caesio spp.) are small but good eating, the best being, perhaps, C. pinjalu which is also known as Ikan merah china and is in no way inferior to the Ikan merah as a table delicacy.\n\nOf the genus Sparus, three species are mentioned in this book, one of which, the Bēras-bēras (S. sarba), is the Tarwhine of Queensland and New South Wales, where it is considered a good edible fish.\n\nIt is not to be compared however, either from a sporting or an edible point of view, with its congener the Black Bream (S. australis), which has not been recorded as inhabiting Malayan waters.\n\nThe Asoh-asoh (Lethrinus nebulosus) is another useful fish in this family. The inside of its mouth is orange coloured as is that of its relative the Yellow-mouthed Snapper (L. chrysostomus) of Australia.\n\nRED MULLETS.\n\n(MULLIDAE.)\n\nMembers of this family are known as Red Mullets in Great Britain and as \"Goat-fishes\" or \"Surmullets\" in America.\n\nThe British species are Mullus barbatus and M. surmuletus, remarkable for their beautiful pink or red colour, and much valued on the market, although no longer held in the high estimation for which they were noted by the Romans.\n\nBiji nangka or Lēbai are the Malayan generic names of our local members of this family and are descriptive. The Biji nangka (Jack-fruit seed) is yellow and has a filamentous process similar to the barbel of the Red Mullet; a Lēbai is a Malay of exceptional pious habit, and it will be noticed that he almost invariably sports a beard consisting, as a rule, of about two or three long hairs, and his fellow countrymen have hit off the resemblance to the fish, which has two long barbels dependent from the lower jaw.\n\nThe Ikan lēbai are remarkably beautiful fishes and their brilliant colouring contrasts somewhat with the solemn aspect of the head, which is, perhaps, an additional reason for the Malay nickname.\n\nOne of our local species (Upeneus tragula) is known in Australia as the Bar-tailed Goat-fish.\nAll these fishes are small, rarely exceeding 10 inches in length. Very little is known regarding their habits or distribution and they are not at present of much economic importance.\n\nI have taken a few in a trawl near Penang and there is a possibility that with new methods of fishing they may become useful market fish.\n\nRed Mullet are known to visit the British coasts, in vast shoals, at rare intervals.\n\n**BAT-FISHES.**\n\n*(SCORPIDIDAE.)*\n\nAs far as I know, these fish are represented in our waters by the genus *Psettus* only.\n\nThe Gedabang or Nyior-nyior (*P. argenteus*) is known in Australia as the Silvery Bat-fish. It attains a length of about eight or nine inches only and its breadth is about equal to its length. It is common and of fairly good edible quality but is not, at present, of importance.\n\nThe Nyior-nyior (*P. falciformis*) is also a small fish attaining a length of perhaps 9 or 10 inches.\n\n**CORAL FISHES.**\n\n*(CHAETODONTIDAE.)*\n\nA large group of about 200 species of marine carnivorous fishes, confined to the Tropics, mostly of small size and remarkable for their singular forms and markings and brilliant colours.\n\nThey are particularly abundant about volcanic rocks and coral reefs; but some ascend estuaries and tidal rivers, though not to any great distance.\n\nThe Ketang (*Ephippus argus*) ranges from the Indian Ocean to China and Australia, attaining a foot in length. If taken in the sea or in clean back-waters it is an excellent edible fish, but those captured in the vicinity of polluted rivers should be avoided, as there is evidence that they are foul feeders.\n\nHamilton Buchanan remarks of it, \"When newly caught it is a fish of great beauty, easy digestion, and excellent flavour: but after death it soon becomes soft and strong tasting.\" In Ceylon \"It is generally esteemed, its flesh partaking the flavour of trout\" (Bennett).\n\nThis fish and its congener (*E. multifasciatus*) are favourably known in Australia as Butter-fish and are a common table fish in hotels and restaurants.\n\nIkan inggu or Ikan babi are Malay equivalents for the genus *Holacanthus*. The former term applying to the colouration and the latter to the rather pig-like profile and the presence, in all these fishes, of a pair of pre-opercular spines directed backwards, which are considered to resemble boar's tusks.\nThe Bonang (*Platax teira*) is a deep-bodied fish which attains a length of at least 20 inches. Russell says their flavour is excellent and Cantor makes the same remark.\n\nIt is known in Australia as the Dark Bat-fish.\n\n**MOON-FISH.**\n\n(*DREPANIDAE.*)\n\nThe Daun bēharu (*Drepane punctate*) is a very common fish of fair edible value.\n\nConsiderable quantities of this fish have been taken in trawls both in India and Ceylon. Sir K. Gupta says they are very much sought after and always command a good price in Bengal. They are rather too bony to be popular with Europeans in the East.\n\n\"BLACK TREVALLY.\"\n\n(*TEUTHIDIDAE.*)\n\nAccording to Dr. Boulenger's classification (1902), this family comprises a single recent genus, *Teuthis*, with about 30 species, herbivorous fishes from the Indian and Western Pacific Oceans. According to Bottard (\"Poissons venimeux,\" Paris 1889) the sting from the spines of these fishes is much dreaded, and this I can vouch for, though personally I have suffered very little inconvenience from the pricks of these spines.\n\nIt will be noticed that Duncker gives the generic synonym Ketang to members of this family and this is the name given by Malays to the genus *Ephippus* (*Chaetodontidae*) which also has venomous spines.\n\nIn all species of *Teuthis* there are 13 dorsal spines and 7 anal spines, whereas *Ephippus* has 9 dorsal and 3 anal spines, which shews that the Malay system of classification does not agree with that adopted by scientists.\n\nThe Dengkis (*T. nebulosa*) is known on the East coast of Australia as the \"Black Trevally\" and the Debam (*T. java*) is also found on the Australian coast.\n\nThey are small fish, fairly common in the markets where they find a ready sale.\n\n**GOURAMI, ETC.**\n\n(*OSPHROMENIDAE.*)\n\nThis family of fresh water fishes is remarkable for several reasons:\n\nFrom an edible point of view, because it includes the Kalui (*Osphromenus olfax*), known in India as the Gourami, which has a world wide reputation as one of the finest flavoured fresh water fish known, as well as the Pēpuyu, a favourite food fish in Negri Sembilan.\nFrom an athletic and sporting point of view, because it includes the Pepuyu (Anabas scandens) the famous climbing Perch, mentioned in all natural history books, as well as the Ikan belaga the equally famous fighting fish, on which Pahang rajas have won and lost fabulous sums; and from a scientific point of view, because all members of this family are provided with super-branchial respiratory organs, situated in a cavity above the gills which enables them to live, happily, out of water for long periods.\n\nThe Kalui grows to a length of about two feet and is regarded as one of the best flavoured fishes in the East. It has been acclimatised in India, the Guianas, Mauritius and Australia.\n\nDay writes,\n\n\"Commerson who observed it in the Mauritius in 1770, states tha he never ate any fish more exquisite in flavour, whether from the sea or fresh water: he also added that in Batavia the Dutch reared them in large earthen pots, changing the water daily and feeding them on nothing but fresh water plants, especially the Pistia natans.\"\n\nGeneral Hardwicke gives an account of the breeding of this fish, apparently monogamous; he observes,\n\n\"They commence at six months of age, whilst their fecundity is astonishing. During the breeding season, they frequent the sides of tanks, where shelter is afforded them by the grasses and weeds growing in the water. For several days they are very active, passing in and out of their grassy cover, and in some places thickening it, by entangling all trailing shoots, and forming what is generally considered the spot under which the ova are deposited. They continue to watch this place with the greatest vigilance, driving away any interloping fish, and, at the end of a month numerous fry appear, over which the old gouramies keep watch many days.\"\n\nI kept these fish in a large pond at Kuala Pilah, having first caught them with a casting net in the Muar river. Their natural food consists of aquatic plants and I used to collect the leaves they like and send a leaf at a time down the stream until a Kalui rose to the bait. It was then a simple matter to lure the fish nearer and nearer, with carefully flicked leaves until it was close enough to my place of concealment to enable me to throw the net over the floating leaf under which the fish was rising.\n\nThere are probably many old friends who will remember the little dinners in Kuala Pilah, when the fish, fowl, mutton and vegetables were all locally raised.\n\nThe Kalui in my pond were fed daily on leaves, principally wild caladium and tapioca shoots, not thrown broad-cast but inserted in split bamboo poles which were pushed into the bottom of the pond. They ate a tremendous lot and grew very rapidly:\n\n---\n\n1 Zool. Journ. IV, p. 309.\nthe caladium leaves imparting a very fine flavour to the fish.\n\nThey will rise to a fly or beetle, and some flowers, particularly a large Hibiscus. Anyone intending to keep these fish in stock ponds is advised to keep the pond free from pollution and to feed the fish regularly. It is only in this way that rapid growth and good flavour can be obtained.\n\nThey attain a length of two feet, a weight of at least 20 pounds and in shape resemble the turbot.\n\nThe Pēpuyu or Bētok (Anabas scandens) has a world wide reputation as the Climbing Perch. Gunther\\(^1\\) tells us that in 1797 Daldorf in a memoir communicated to the Linnean Society of London mentions that he had himself taken, in 1791, an Anabas in the act of ascending a palm tree (Palmyra) which grew near a pond. The fish had reached the height of 5 feet and was going still higher. He goes on to say that the fish is named in the Malayan language the \"Tree Climber,\" which is a mistake. He should, I think, have said the Malayalam language. See Day (Fishes of India) Undi colli.\n\nMeek\\(^2\\) writes,\n\n\"Anabas has been frequently obtained on the ground and a specimen now in the collection of Armstrong College, obtained from near Bangkok was found crossing the road 50 yards from the nearest water. It is named the climbing perch from the habit it has of climbing up the rough bark of trees by movements of the spine-clad opercula.\n\n\"The method of progression out of the water and the climbing of palms and palmyra trees, especially after heavy rains, have been repeatedly observed.\"\n\nThe Negri Sembilan Malays have a saying, often quoted, which hits off the high estimation in which this little fish is held by inland dwellers: Jikalau sudah minum ayer gopong bertali ijok. sudah makan pepuyu, payah nok tinggalkan negri ini: which may be roughly translated: When a visitor has drunk the water and eaten the fish of this country, he is loath to leave it.\n\nThe Ikan Pēlaga or Bēlaga (Betta spp.) probably derives its name from Siam where it is known as Pla Kat (Pla, fish; Kat, a fighter).\n\nIt is common throughout the Peninsula and may be caught in most of the ponds and ditches in Singapore.\n\nCantor relates that the Siamese are infatuated with the combats of these fish, staking on the issue considerable sums, and sometimes their own persons and families.\n\nThe licence to fight these fish used to be farmed in Siam and brought in a considerable revenue to the King.\n\n---\n\n\\(^1\\) Study of Fishes, p. 516.\n\\(^2\\) Migrations of Fish, 1916.\nThe male fish are kept in bottles separately, and when in a state of quiet they are dull looking little fish, but if two bottles be brought together, the little creatures become greatly excited and the raised fins and whole body shine with bright metallic colours of dazzling beauty.\n\nIf two male fish are then placed together they fight like terriers. When fighting they utter a curious ringing note which sounds like \"Kring Kring\" and probably this accounts for another name by which they are known viz. Ikan karing.\n\nThe Képar (Polyacanthus hasseltii) is another beautiful little fish and quite common in brackish swamps and ponds.\n\nThis fish has been bred in confinement by Chinese, probably for centuries, and is known as the Paradise fish to aquarium owners in Europe. In its native element, in dark or muddy water, it is of rather a drab brown colour but if kept in a bowl in clear water, it has a beautiful golden colour with red transverse bands.\n\nCORAL FISHES.\n\n(POMACENTRIDAE.)\n\nThis family resembles the Chaetodontidae (Coral Fishes) in form and mode of life, likewise in the brilliant colouration. For this reason I have applied the same English name in the absence of any other for this particular family.\n\nOver 150 species are known. Some 30 species are described in Day's Fishes of India and probably the family is better represented in Malayan than in Indian waters.\n\nAs the names Ingggu and Gombing shew, the Malays include Chaetodontidae and Pomacentridae in one family and curiously enough, the scaly-finned fishes (Chaetodontidae) resemble the Pomacentridae so closely that in some instances actually the same colouration and markings are common to members of the two families. This, as remarked by Dr. Günther, is one of many instances shewing that the colouration of animals depends to a great extent on their mode of life and natural surroundings.\n\nFrom an edible point of view they are not of much economic importance but all specimens brought to the markets seem to find ready purchasers.\n\n\"WRASSES\" OR PARROT FISHES.\n\n(LABRIDAЕ.)\n\nThe \"Wrasses\" form a large family of most brilliantly coloured marine fishes, inhabiting all the tropical and temperate coasts.\n\nTheir regime is partially herbivorous, partially carnivorous. About 400 species are known.\n\nSome of the members of this family have been observed to build nests for the protection of their eggs and young.\nThese nests in the European *Labrus* are made of sea-weeds, zoophytes, corals, broken shells, etc., and are the work of both the male and female. It is also in this family that sleep was first observed in fishes, and this has been fully verified by Mobius, on *Labrus ruprestis* in an aquarium, the fish seeking a sleeping place at night and laying itself down to rest on one side.\n\nTokak is the generic name applied by Malays to those members of this family which are provided with strong canine-like teeth. (See Wilkinson's Dictionary, p. 201. Tokak. Biting, used of dogs, sharks, tigers, and other animals which use their teeth as a weapon of offence.)\n\nThe teeth of these fishes are used however for crushing shells, coral, etc.\n\nA Tokak (*Chaerops omnopterus*) is known in New South Wales and Queensland as the Blue-spotted Groper.\n\nLittle use is made of this large family of fine edible fishes from a commercial point of view.\n\nTheir capture is confined to the hand line and to basket traps. Their habitat, deep water in the vicinity of coral reefs, renders the use of ordinary nets impossible but the trammel net which is unknown in this region should prove effective.\n\nMany members of this family attain a weight of 50 pounds.\n\n**PARROT-WRASSES.**\n\n(*SCARIDAE.*)\n\nThis family is closely allied to the preceding, with which they have been usually united, but differing in the more or less coalescent teeth, forming, often, a parrot-like beak.\n\nI have placed the Béchok in this family and also among the *Labridae* as there are several species.\n\nMr. A. W. H. Hamilton, who is an authority on Malayan sea-fishes, tells me that the Malays of the Western part of Singapore confine the synonym Béchok to a fish with green teeth, which seems to identify his fish as *Pseudodax moluccanus* (Day, 2nd edition Vol. II, p. 421).\n\n**HORSE MACKERELS.**\n\n(*CARANGIDAE.*)\n\nA large and important family of carnivorous fishes, all of which are edible and many of large size.\n\nMembers of this family compose the bulk of the fish taken in nets on the East coast, which are dried and salted for export.\n\nSome of our principal local varieties are the Chéncharu (*Caranx rotteri*), the Sélar (*Caranx*, not less than 12 species), the Chermin (*C. gallus*), the Nyior nyior (*Trachynotus* spp.) and the Talang (*Chorinemus* spp.).\n\n---\n\n1 The Cambridge Natural History, 1904.\nWhen freshly caught and cooked they are all excellent eating, but they do not keep well.\n\nThe Chencharu is quite common and is found in large shoals. When in season, large numbers will be found in the markets and if quite fresh they are good edible fish. They are said to attain a length of 5 feet.\n\nAll the Sëlar are good eating, but the fresher they are the better. They give good sport with a light rod and small hook, to which a few small white feathers have been \"whipped.\"\n\nThey like shade and will be found in the neighbourhood of piers and under vessels. When cruising, I have often noticed Sëlar taking shelter under my yacht, when we were becalmed, and if the period coincided with a meal time, we used to catch as many as we wanted in a few minutes.\n\nThere are, at times, large numbers of Sëlar in shallow water off Singapore as, probably, many sea-side residents know.\n\nThe Chermin (C. gallus) is a deep-bodied fish somewhat resembling the Dory in shape and is one of the best, if not the best, food fish in this family. It is found generally on reefs; takes a prawn or fish bait, and gives splendid sport as it fights very hard and takes a bit of playing.\n\nSpecimens 2 feet in length are not uncommon and it is said to grow to five feet in length. It is known in Australia as the Silvery Moon-fish.\n\nThe Nyior nyior (Trachynotus ovatus and T. bailloni) are known in Australia as the Dart. These fish must be fresh to be appreciated.\n\nThe Talang (Chorinemus spp.) is a common fish in the markets and fairly popular with most Asiatics, but some Malays have a prejudice against it and will tell you that it gives them an irritating and disfiguring affection of the skin.\n\nIt may be that the general appearance of these fish, all of which have a row of dark blotches along the side, may suggest the unsightly blotches seen on the faces, bodies and limbs of natives who are afflicted with certain kinds of skin disease, kédal, sopak, etc. or that the consumption of this fish when not perfectly fresh causes urticaria, but the subject should be worth investigation.\n\nOne local species of Talang (S. sancti-petri) is known also in Australia as the Queen-fish, and another (S. tooloo-parah) is known also in Philippine waters as the Talang-talang.\n\nThere are many other excellent food fish in this family including the Lëmbudok or Dëmudok, Gërëpoh and Berkas, not specifically identified.\n\nThe generic term by which the Caranx branch of this family is known to the Moros, in the Philippines, is Daing puti. The name Daing bélang occurs locally and is applied to Caranx speciosus and C. compressus.\nMACKERELS, TUNNIES, ETC.\n\n(SCOMBRIDAE.)\n\nThe fishes of the \"Mackerel\" family are pelagic forms, abundant in all the seas of the tropical and temperate zones. They travel about in shoals, spawn in the open sea, but periodically approach the shore in pursuit of other fishes on which they feed.\n\nOur most important local members of this family are the Pělata (Siamese pla thu) (Scomber microlepidotus), the Tongkol (Thynnus thunnina) and the Těnggiri (Cybium spp.).\n\nThe Pělata is a fish of great commercial importance in Siam and on the East Coast, where it is extensively salted and dried for export.\n\nThe Tongkol is the Malay generic term for the Tunny and, I believe, for the Bonito also. These fish gives excellent sport when they are on the feed but often one sees a school of these fish jumping and disporting themselves, and on such occasions they seem to disdain the bait which is \"trolled\" past them.\n\nThe Těnggiri is, in my opinion, the best fish in our waters. The best both from a sporting and from an edible point of view, but I may be prejudiced in its favour because I have had more sport with this fish than with any other. Seale¹ gives corroborative evidence as to its edible qualities as follows, \"In this family is the tanguingue, which is a true Spanish Mackerel. By many people this is regarded as the finest food fish in the Philippine waters.\"\n\nA recent visitor to Singapore from Queensland told me that he had had great sport with these fish on the Barrier Reef and that they attained a weight of 100 pounds.\n\nThe big fish stay out in deep water and the best time to take them is during the N. E. monsoon. The best bait is a whole fish about 8 or 9 inches long, and at least 100 or 150 yards of line should be run off the reel, so as to keep the bait a long way astern as you sail along in a good breeze.\n\nWhen making a passage in a heavy sea with no time for rod fishing we used to boom out as many as five brass wire lines and perhaps have two or three fish on at once averaging 20 pounds or so.\n\nWhen our fisheries are better understood and depots with refrigerating plant are established on the islands off the East coast, more attention will certainly be paid to our oceanic fishes. Sea going fishing smacks should do a good trade with catches of Bonito, Tunny and Spanish mackerel.\n\nOne of the Spanish mackerels in America is one of the most highly esteemed of all American fishes and always commands a high price. Stead mentions that the catch in 1897 amounted to 1,183,456 pounds, worth nearly £14,000.\n\n¹ Fishery resources of the Philippines.\nHAIRTAILS.\n\n(TRICHIURIDAE.)\n\nThe Timah-timah (Trichiurus spp.) are some of our commonest fishes and are generally on sale in the markets.\n\nI have never eaten them but the Chinese and Indians purchase them readily.\n\nThese fish have no caudal fin, the body being ribbon like and tapering to a fine point.\n\nMiniature specimens an inch or two in length form a considerable proportion of the catches of illegal purse nets. The ordinary size of marketable specimens is about three to four feet.\n\nDay quotes Russell as observing that in his time they were esteemed by the European soldiers in India, and Jerdon states that they afford very delicate eating.\n\nSAIL-FISHES.\n\n(HISTIOPHORIDAE.)\n\nA family of large oceanic fishes, occurring in tropical or subtropical seas. On account of their formidable sword, large specimens are held in dread by fishermen and are rarely taken and still more rarely preserved.\n\nThe Japanese in Hawaii have a regular fishery for Sail-Fish and Tuna. The Japanese fishermen in Singapore, who are the only deep water fishermen in our waters and whose methods are much more enterprising and thorough than those of the Malays and Chinese, are taking these fish occasionally.\n\nI am informed that a Sail-Fish, three fathoms long was sold in the Clyde Terrace market within the past two weeks, but the information arrived too late to enable me to get a photograph.\n\nThis fish is known to Malays as Selayor or Layeran (Layer, a sail), and is by no means rare.\n\nFLAT-FISHES.\n\n(PLEURONECTIDAE.)\n\nFlat fishes are a large group of some 500 species, mostly marine.\n\nThe very young are transparent and symmetrical with an eye on each side, and swim in a vertical position like other fishes.\n\nAs they grow, the eye of one side moves by degrees to the other side, where it becomes the upper eye.\n\nIf, at that age, the dorsal fin does not extend to the frontal region, the migrating eye simply moves over the line of the profile; in other genera, the dorsal fin has already extended to the snout before the migration takes place, and the eye, passing between the\nfrontal bone and the tissues supporting the fin, appears to pass from side to side through the head, as was believed by some of the earlier observers.\\(^1\\)\n\nAs a food supply the flat-fishes are of great importance, the flesh of the majority being of excellent quality and flavour, and they are deservedly popular with Europeans in Malaya.\n\nThe family is represented in our waters by, certainly, not less than 19 species, of which 12 are included in the systematic list in this work.\n\nThe Malay generic terms are *Ikan sabēlah* and *Ikan lidah* for all members of this family, but in some districts the name *Sabēlah* is applied to those genera which have a distinct caudal fin (*Psettodes*, *Pseudorhombus*) and the name *Lidah* to the tongue-shaped genera (*Synaptura*, *Plagusia*, *Cynoglossus*).\n\nIn the Straits of Malacca these fish are very common in shallow water on sand and mud where they keep close to the bottom. This habit of keeping close to the bottom renders them particularly liable to capture by the beam or \"Otter\" trawl. I have taken these fish in a beam trawl in fair numbers both off Singapore and off the Krian coast.\n\nOn the great Kra flats off Krian which are formed of very soft mud I found it necessary to fit \"ski\" or wooden skates to the irons of the trawl to enable the trawl to slide on the surface of the mud, and took considerable numbers of these fish as well as some large Rays.\n\nI should expect a trawler to be successful on the long banks and in the deep water gullies which, as a glance at the chart will shew, run in the direction of the prevailing currents, in many parts of the steamer route between Penang and Singapore.\n\nAn enormous amount of destruction of immature flat fish takes place daily in shallow water, specimens an inch or two in length being taken in seine nets and purse-nets from one end of the Straits to the other. A special effort should be made to stop this murder of miniature fish which has diminished our food supply to a very considerable extent.\n\nTwo species of our *Ikan sabēlah* are found on the Queensland coast. One, *Psettodes crumei*, is known as the Queensland Halibut, and the other, *Pseudorhombus rusellii*, is generally called the \"Flounder.\"\n\n**GOBIES.**\n\n*(GOBIIDAE.)*\n\nA large family of some 600 species, the great majority marine, mostly carnivorous and of small size.\n\nThe largest form (*Eleotris marmorata*) from the rivers of Siam, Borneo, Sumatra and the Malay Peninsula grows to nearly three feet, whilst the smallest (*Mystichthys luzonensis*) from the Philip-\n\n---\n\n\\(^1\\) Cambridge Nat. History.\npines, attains a length of about half an inch and is believed to be the smallest known fish.\n\nThe family is not of much economic importance at present and I have no personal knowledge of their edible qualities.\n\nOur most noteworthy species are the Bélontok (Eleotris marmorata) the Bélodok (Gobius spp.), the Témbakul and Bélachak (Periophthalmus spp.).\n\nThe Bélontok has already been alluded to as attaining a large size and not less than seven species are known to inhabit our waters.\n\nOne of our Bélodok (G. butis) is said by Day to be much esteemed by the natives of India, as being very light and wholesome, but unless elaborately cooked is not relished by Europeans, because of its deficiency in, or earthy, taste.\n\nIt attains a length of a foot and a half, takes a bait freely and is largely bred in tanks in India.\n\nThe Témbakul and Bélachak will be familiar to most residents in Malaya as the Mud-Skippers which may be seen disporting themselves on the mud and among the mangroves, along all our coasts and estuaries.\n\nMalays have told me that these fish are good eating and possess great medicinal virtues.\n\nThey have very conspicuous prominent eyes, which are capable of protrusion and retraction, and extraordinary muscular pectoral fins which they use like arms for progression on mud and for climbing.\n\nDay writes, \"They climb on to trees, holding on by their pectoral fins exactly as if they were arms. Now and then they plant these firmly as organs of support, the same as one places one's elbows on a table, then they raise their heads and take a deliberate survey of surrounding objects.\"\n\nSaville-Kent is quoted by Stead as follows:\n\n\"A remarkable circumstance associated with the life economy of Periophthalmus is the fact that it cannot sustain life if continually water-submerged like ordinary fish. The exposure of its tissues to the action of atmospheric air with every fall of the tide appears to be essential to its well-being, and examples experimentally kept under water for prolonged intervals were literally drowned.\n\n\"As a provision for its abnormal life-habits, it has been ascertained that Periophthalmus possesses a supplementary respiratory organ which, singular to relate, is represented, in this instance, in the creature's tail.\n\n\"The fish while reposing on the surface of the mud commonly leaves its tail more or less immersed in the water. The blood circulates with abnormal energy through this thin membranous appendage, which accordingly fulfils the function of a supplementary gill.\"\nSUCKING FISHES.\n\n(ECHINEIDIDAE.)\n\nThese fishes, generally known as Remora, attach themselves by means of a remarkable adhesive disc on the upper surface of the head to boats and ships, or to whales, sharks and turtles and in this way manage to do a good deal of travelling with the minimum amount of effort. As they are not strong swimmers they obtain a much larger supply of food by riding about in this way than otherwise would be possible.\n\nThe natives of Cuba, Zanzibar and the Torres Straits use these fish for catching turtles; the fish being held by a metal ring round the base of the tail to which a line is attached. \"When one of these fish, a foot in length, has its wet sucker applied to a table, and is allowed time to lay hold, it adheres so tightly that it is impossible to pull it off by a fair vertical strain\" (Lydekker).\n\nThe Gemi (Echeneis naucrates) is very common in these seas. It takes a bait readily, is edible, and may, occasionally, be seen in the markets.\n\nGOBLIN-FISHES.\n\n(SCORPAENIDAE.)\n\nSome members of this family are Perch-shaped and edible, growing to a large size (Sebastes, Scorpaena, etc.).\n\nNearly all are distinguished by a powerful armature, either of the head, or fin spines, or both, and in some the spines are provided with poison glands (Scorpaena, Pterois, Pelor and Synanceia) and a sting from these spines is extremely painful.\n\nLepu is the Malay synonym for all members of this family.\n\nFLAT-HEADS.\n\n(PLATYCEPHALIDAE.)\n\nThis family with a single genus, Platycephalus, and some 40 species, inhabits the coasts of the Indian Ocean and the Western Pacific.\n\nThe Malay generic term is Baji-baji, so called from the wedge-shaped head, and so far some four species have been identified in Malayan seas.\n\nThey live on the bottom, hidden in the sand as a rule, and as they depend on their protective colouring and spines to save them from possible enemies, they do not swim to any distance when disturbed but dart away for an instant and then lie motionless half buried in the sand.\n\nThis peculiarity renders them particularly liable to be taken by trawls and a large proportion of the catches made by the New South Wales trawlers is composed of these fish.\n\nThey are good edible fish and common in the markets.\n\n1 Royal Nat. History.\n\"STAR-GAZERS.\"\n\n(LEPTOSCOPIdae.)\n\nInformation is wanting, but, I think the Pukul gendang (Percis pulchella) is rare and economically unimportant.\n\nSPINY-EELS.\n\n(MASTACEMBELIDAE.)\n\nThese are eel-shaped carnivorous fishes, very common throughout Malaya where they are known by the generic term Tilan. The largest species reach a length of three feet and the flesh of all species is of excellent quality. They are found far inland and often at considerable elevations.\n\nDay states, \"Excellent as food, although owing to their resemblance to eels (in fact they are eels with spines) or snakes, some people object to them.\" Buchanan observes, \"sought after by the natives, the highest of whom in Bengal make no scruple of eating them; and by Europeans they are esteemed the best of the eel-kind.\"\n\nFROG-FISHES.\n\n(BATRACHIDAE.)\n\nThese carnivorous fishes apparently delight in mud and dirty water; they frequent the shores, ascending tidal rivers and estuaries. At Penang \"the natives attribute poisonous qualities to these fishes, and reject them even as manure\" (Cantor).\n\nANGLER-FISHES AND \"CROAKERS.\"\n\n(ANTENNARIIDAE & MALTHIDAE.)\n\nThese fishes have no economic value.\n\nLEATHER-JACKETS.\n\n(TRIACANTHIDAE AND BALISTIDAE.)\n\nThese two families may be conveniently taken together in this small work as there is a strong affinity between them.\n\nThough containing many species of no economic value one species, the Jebong (Balistes stellatus), is preferred to all other fish by many Malays, including fishermen, whom I have questioned. I think that the main reason for this preference is that the flesh of this fish more nearly resembles that of a chicken than any other fish, and consequently the change to what approximates to a meat diet is welcomed.\n\nThe Jebong has a tough leathery skin which has to be removed before it is cooked. The cook should not be allowed to remove the head which is the best part of this fish, and of many others, especially perhaps the Tenggiri.\n\nLeather-jackets are held in considerable esteem in Australia as food fish and are commonly served in hotels and restaurants.\nBOX-FISHES.\n\n(OSTRACIONTIDAE.)\n\nThis family is of no edible importance.\n\nGLOBE-FISHES AND PORCUPINE FISHES.\n\n(TETRODONTIDAE & DIODONTIDAE.)\n\nThese fish possess poisonous properties and instances have been recorded of persons dying shortly after eating them. Malay fishermen, however, commonly eat the Buntal pisang (Tetrodon lunaris) and some other species, being careful to remove all the poisonous organs.\n\nSHARKS AND DOG-FISHES.\n\n(CARCHARIIDAE, SCYLLIDAE, SPHYRNIIDAE.)\n\nSharks are active predacious fishes living at different depths in the sea from the surface to nearly a thousand fathoms and ranging from mid-ocean to the shallower waters round the coasts in every part of the world. They are most abundant in the Tropics where they attain their greatest size, and some of the Sharks are the largest of living fishes.\n\nAmong the Scyllidae (Dog-fishes) we have in these waters the Tiger or Zebra Shark (Yu chechak or Yu to'kek) with dark bands on a tawny ground which attains a length of at least 10 feet.\n\nAmong our species of the true Sharks (Carchariidae) we have Yu tenggiri (Galeocerdo rayneri) which attains a length of over 12 feet and is very ferocious, but fortunately rather rare, and the Yu jerong or Yu sambaran (Carcharias sp.) which has also a bad reputation.\n\nThe Hammer-head Sharks (Sphyrniidæ) Yu bengkong, Yu sanggul or Yu palang are voracious, usually live in deep water and grow to a length of 15 feet.\n\nThere is no scientific record of the appearance of Rhinodontidae in these waters. Sharks of this family are probably the largest known and are said to exceed 50 feet in length (some writers mention 70 feet), but to be quite harmless. Specimens have been seen or captured in the neighbourhood of Ceylon, and on one occasion I watched a very large shark, in clear water, near Nipah Bay, Tioman Island, for more than half an hour, which appeared to equal the length of my yacht (35 feet).\n\nThe economic value of sharks has not yet been fully realised. Fishermen regard them as a nuisance as they tear nets and take fish off their hooks, and they are avoided as much as possible. Incidentally sharks are a nuisance to trawl-fishermen in Australia, and if there is any delay in getting the \"cod-end\" containing the fish on board, the sharks will bite pieces out of it. There is however every indication that shark-leather will soon be an ordinary trade commodity. The skin of sharks is composed of two layers:\nthe outermost integument, \"shagreen,\" is covered with denticles, and hitherto, owing to the difficulty of treatment, has had a very limited use, but within the last few years a method has been discovered of separating the outer and inner skins and the latter can be tanned and used in every way like ordinary leather. It is therefore likely that the high price and scarcity of ordinary leather will eventually lead to the universal exploitation of the shark, ray and porpoise fisheries with special nets and appliances. I see in the Australian Magazine \"Sea, Land and Air\" (September 1920) that a Marine-Leather Company is operating successfully off the coast of Florida and North Carolina.\n\nOther commercial products are the blood, fins, liver and meat. The blood is said to furnish one of the finest waterproof glues yet known for aeroplane propellers, etc.; the fins are a well known Chinese delicacy, and the American Bureau of Fisheries has published some thirty recipes for cooking shark-meat.\n\nSmall sharks are esteemed as food by the Malays, Indians and Chinese and are excellent eating.\n\nThe liver of the shark is rich in oil and is said to equal that of the Cod in its medicinal properties. It is also used in the preparation of soap, paint, etc., including the treatment of leather.\n\nSAW FISHES.\n\n(PRISTIDAE.)\n\nThe family contains one genus (Pristis) with about four or five species.\n\nThese fish are termed Beroi by Malays in some districts but the descriptive names Yu gergaji, Yu parang and Yu todak are more commonly heard, Malays placing these and the Rhinobatidae among the Sharks (Selachioidei) and not among the Rays (Batoidei), with good reason.\n\nBoulenger states that an arbitrary distinction has been made which has little to recommend it except custom and some measure of convenience.\n\nThese fish are readily eaten by Malays, Chinese and Tamils and are very common. They enter rivers right up into fresh water and small specimens two or three feet long are often taken accidentally in casting nets.\n\nThey have always appeared to me to be very lethargic and sluggish and as the small ones in a net give less trouble than any other fish of the same size, I have always considered them to be more formidable in appearance than in reality. However, Day writes \"Great injuries are inflicted by these fishes, which strike sideways with their formidable snouts; and although not personally a witness to the fact, I have been informed on native authority, that large ones have been known to cut a bather entirely in two.\"\n\nIt would be interesting to know whether there is any record of patients having been admitted to hospital in India or Malaya, suffering from injuries inflicted by these fish.\nA saw-fish measuring 23 feet 6 inches exclusive of the saw was taken in the Bay of Bengal by the Government trawler \"Golden Crown\" and I believe that this is the largest recorded fish. No mention is made of the length of the saw of this specimen but it is not likely to have been less than 7 feet. The largest saw in the Raffles Museum, Singapore, measures 5 ft. 10¾ in.\n\n**BEAKED-RAYS.**\n\n*(RHINOBATIDAE.)*\n\nThese are harmless, sedentary, bottom-feeding fishes which subsist chiefly on shell-fish, crabs, etc. They are considered good eating and are sold regularly in the markets.\n\nThey are known to Malays as Yu keméjan.\n\n**ELECTRIC-RAYS.**\n\n*(TORPEDINIDAE.)*\n\nThese Rays to which the Malays have given the descriptive names Pari kēbas or Pari sēbar have the power of inflicting electric shocks. \"The fish\" writes Dr. Günther, \"gives the electric shock voluntarily, when it is excited to do so in self defence, or intends to stun or kill its prey. The electric currents created in these fishes exercise all the other known properties of electricity; they render the needle magnetic, decompose chemical compounds, and emit the spark.\"\n\nOur Malayan species are very small. I have a specimen of the Pari kēbas (*Astrape dipterygia*) about six inches long and there is no record yet of specimens over 18 inches.\n\nWhen trawling on the Australian coast we took many specimens which appeared to be between two and three feet in length and one or two new deck hands experienced shocks which appeared to cause only momentary inconvenience.\n\nCantor says that out of the water they may be handled with impunity.\n\n**STING RAYS.**\n\n*(TRYGONIDAE.)*\n\nNearly all the members of this family are provided with long whip-like tails, which are generally armed with spines. In the larger kinds these formidable spines may be as much as 8 or 9 inches in length; and, as they wear out they are, from time to time, shed and replaced by new ones growing from behind.\n\nThese spines inflict very severe wounds, the pain of which is greatly increased by the apparently poisonous cutaneous mucus introduced into the wound.\n\nThe Pari bēting (*Trygon uarnak*) attains a large size, 5 feet or more across the disk, and a weight of well over 200 pounds. In one haul of the trawl in the Bay of Bengal the \"Golden Crown\" took four of these fish which weighed respectively 180, 170, 160 and 122 pounds.\nThe Pari dēdap (*Urogymnus asperrimus*) is the sole representative of a genus and remarkable from the fact that its back is covered with osseous tubercles, among which are studded, at intervals, a number of conical denticles or spines rather like limpets in appearance.\n\nThis fish ranges between the Red Sea, East Coast of Africa, seas of India and the Malay Archipelago.\n\nI recently overheard a Malay in the Raffles Museum apply the name Dērēdap to this fish and perhaps a note on the word Dēdap and its derivatives may be of interest.\n\nDēdap—a tree (*Erythrinus* sp.) with scarlet flowers, the bark of which is studded with spines of the same limpet-like shape as those of the Pari dēdap.\n\nDēdap—a shield or buckler.\n\nRēdap—a small drum, (probably so called from the kind of skin used).\n\nMērēdap—(Riau, Johor) springing up plentifully, of prickly heat and other skin eruptions, the feature of which is a large number of pustules.\n\nThe word dēdap as meaning a shield is obsolete both in colloquial Malay and in literature and it is interesting to note that its place has been taken by the Indian word Perisai.\n\n**EAGLE-RAYS.**\n\n(*MYLIOBATIDAE.*)\n\nThis family contains five genera and about 27 species. All five genera are represented in Malayan seas.\n\nThese fish feed principally on Molluses, the shells of which they grind with their large grinding-teeth. Some of them attain an enormous size, over 20 feet in width, a thickness of 3 to 4 feet and a weight, probably, of over a ton.\n\nThey are variously known as Devil-fishes, Sea-devils, Batfishes, Eagle-rays, etc., and it is interesting to note that the terms Bat and Eagle are taken from the Malay, viz. Pari kēlawar and Pari lang.\n\nThe largest of this family are the Pari paus (*Dicerobatis* spp. and *Ceratoptera* spp.).\n\nI have seen these fish leap out of the sea to a height of perhaps 7 or 8 feet, time after time, coming down each time with a tremendous splash, and Malays have told me that the fish does this to shake off the remora which hang on to them in large numbers.\n\nIn conclusion I may add, that all the Rays and Skates are eaten by natives of the East, while the \"wings\" or fins are highly esteemed by the Chinese. Fishes of this order would form a considerable proportion of the catches of a trawler and would provide a cheap and valuable food, for which there is a constant demand, either fresh or salted.\nMalayan Fishes.\n\nPART II.\n\nALPHABETICAL LIST OF MALAYAN FISHES.\n\nNOTE:—The letters and abbreviations inserted in brackets after the Malay name of each fish, refer to authorities for both the Malay and scientific synonyms.\n\nWhere no authority is given the writer accepts responsibility for the identity of those species.\n\nLIST OF ABBREVIATIONS.\n\nC. = Cantor. D. = Dennys. R. = Rowell. R. M. = Raffles Museum. Dun. = Duncker. Blkr. = Bleeker. M. W. and de B. = Max Weber and de Beaufort. S. = Sauvage. Wilk. = Wilkinson. C. and S. = Clifford and Swettenham. S. M. = Selangor Museum. Blgr. = Boulenger.\n\nAlu-alu. *Sphyraena novae-hollandiae.*\n\" obtusata.\n\" jello.\n\nBarracudas. Fam. *Sphyraenidae.*\n\nMembers of the genus *Sphyraena* are called \"Barra-\ncudas\" in America and elsewhere, and Pikes in Australia.\nSee also Kachang-kachang and Tēnok.\n\nAmbu-ambu (Wilk.). \"The name of a large deep-sea fish.\nWhen preserved this fish is known as Ikan kem-\nbal mas.\"\n\nProbably Tongkol or Ikan ayer.\n\n*Thynnus thunnina* or the Bonito *Thynnus pelamys.*\n\nMackerel. Fam. *Scombridae.*\n\nSee Kembal mas.\n\nAmpas tēbu (R. M.). *Pristipoma operculare.*\n\"Grunters.\" Fam. *Pristipomatidae.*\n\nAmpit. Anak ampit (Wilk.): (Kedah) a fish; better known as Ikan pēlaga. This is probably the well known fighting fish Ikan bēlaga: *Betta pugnax.*\n\n,, bellica.\nFam. Oosphromenidae.\nSee also Pala and Bēlaga.\n\nAnding. See Bēlanak. Grey Mullets. Fam. Mugilidae.\n\nAnjang-anjang (Blkr. Andjong-andjong).\nPentapodus caninus.\n(R. M.) Scolopsis ghanam.\nGrunters. Fam. Pristipomatidae.\n\nAruan (Dun.). Ophiocephalus aquila\n\"D\" lucius.\n(Dun. C. D.) \" striatus.\nThe Murrel of Northern India.\nThe \"Murrel.\" Fam. Ophiocephalidae.\n\nAruan tasek (Dun. D. R.). Elacate nigra.\nMackerel. Fam. Scombridae.\n\nAsoh-asoh (R.). Lethrinus nebulosus.\nSea-Bream. Fam. Sparidae.\n\nAyam (Blkr. Hajam). Monacanthus choerocephalus.\n\"D\" hajam.\nBalistes stellatus.\nLeather-jackets. Fam. Balistidae.\n\nAyer. Ayer-ayer (Cliff.). \"The name of a sea-fish\" Thynnus thunnina C. V. The Tunny or Tuna.\nThe name \"Ayer\" is used on the East coast of the Malay Peninsula, and Tongkol elsewhere.\nMackerel. Fam. Scombridae.\n\nBabi. Holacanthus spp.\nSo called from the shape of the head and the presence of a spine considered to resemble a pig's tusk.\nCoral-Fishes. Fam. Chaetodontidae.\n\nBagat. Caranx sp.\nHorse-Mackerel. Fam. Carangidae.\n\nBagok. Arius sp. Cat-fish. Fam. Siluridae.\n\nBaji-baji (D. R.). Platycephalus tuberculatus.\n\"D\" macracanthus.\n(R. M.) \" punctatus.\nFlat-heads. Fam. Platycephalidae.\n\nBakap (Unid.). Cat-fish family. Siluridae.\n\nBakok or Bangkok. q.v.\nBalut (M. W. & de B. III 515). *Macrotrema caligans.*\nAn eel belonging to the order Synbranchoidea.\n\nBambangan. Also Bambang and Mambang. *Lutianus* sp.\nSnapper. Sub-fam. LUTIANINAE.\n\nBanang. Large of its kind: viz. Puput banang. Jolong-jolong banang.\n\nBandan (D. R.). *Sparus hasta.*\nSea-Bream. Fam. SPARIDAE.\n\nBandang (M. W. & de B. II 15). *Chanos-chanos.*\nThe Salmon-Herring of Australia.\nThe Milk-fish of India.\nThe Milk-fish. Fam. CHANIDAE.\n(M. W. & B. II 3). *Elops hawaiensis.*\nThe Bony-fish: A small relative of the Tarpon.\nGiant-herring. Fam. ELOPSIDAE.\n\nBangkok. Also Bakok or East Coast.\n\"(M. W. & de B. II 40). *Engraulis setirostris.*\nHerring. Fam. CLUPEIDAE.\n\nBarat-barat (Blkr.). *Triacanthus strigilifer.*\n\" blochii.\n\" nieuhoji.\n*Monacanthus chinensis.*\n\" penicilligerus.\nLeather-jackets. Fam. TRIACANTHIDAE.\n\nBarau-barau. Also Bēbarau and Sēbarau.\n*Hampala macrolepidota.*\n(Dun. *Barbus hampal*).\nCarp. Fam. CYPRINIDAE.\nThis fish gives good sport with live bait or spinner.\n\nBarau-barau laut (R. M.). *Priacanthus hamrur.*\nSea Perch. Sub-fam. PRIACANTHINAE.\n\nBatu (R. M.) (D.R.). *Proteracanthus sarissophorus.*\nSea-Bream. Fam. SPARIDAE.\n\nBaung. The following varieties are recognised: Baung akar, B. kunyet, B. gantang, B. pisang, B. puntong.\n\"(Dun.). *Macrones nigriceps.*\n\"(M. W. & de B. II 341). \" nemurus.\n\"kuning (M. W. & de B. II 343). \" planiceps.\nCat fish. Fam. SILURIDAE.\nBawal (Tamil Voval). The following varieties are distinguished.\n\nB. chermin (C.). *Stromateus atous.*\nB. itam (D.). \" cinereus.\nB. puteh. \"\nB. tambak (C.). \" niger.\nB. këdewas. \" cinereus.\n\nPomfret. Fam. *Stromateidae.*\n\nBayan. Bayan-bayan.\n\n(Boyan R. M.).\n\n*Chilinus fasciatus.*\n\" chlorurus.\n\nParrot-fish. Fam. *Labridae.*\n\nBěběras (M. W. & de B. III 1g6). *Cyclocheilichthys apogon.*\nCarp. Fam. *Cyprinidae.*\n\nBěchok (Wilk. 93). *Julis lunaris.*\n\nParrot-fish. Fam. *Labridae.*\n\n*Pseudoscarus* spp.\n*Pseudodax moluccanus.*\n\n\"Parrot-wrasses.\" Fam. *Scaridae.*\n\nBěgahak (J. S. A. S. VIII 120). *Belodontichthys dinema.*\nCat-fish. Fam. *Siluridae.*\n\nBěkil. Also Berkil, q.v.\n\nBělachak. *Periophthalmus koelreuteri.*\nGoby. Fam. *Gobiidae.*\n\nBělaga. Or Berlaga. *Ikan berlaga* (literally) fighting fish.\n\n*Betta pugnax.*\n\" bellica.\n\nThree varieties of fighting fish are recognised, viz., *Anak karing,* *A. sempila,* *Karing gajah* and they fight only with members of the same species.\n\nSee also Bleeker's Atlas Vol. IX, *Betta picta.*\n*Oosphromenus striatus.*\nFam. *Oosphromenidae.*\n\nBělalang. *Exocoetus oligolepis.*\n\" neglectus.\n\" nigripinnis.\n\" speculiger.\n\nFlying-fish. Fam. *Scombrresocidae.*\nBēlanak (Dun. D. R.). *Mugil cunnesius.*\n(Dun.). „ planiceps.\n„ „ speigleri.\n„ „ waigiensis.\n\nB. jēmpul (C.). „ planiceps.\nB. rapang (R. M.). „ bleekeri.\nB. anding. „ borneensis.\nB. tamok. „ waigiensis.\n\nOther Malay varieties are Bēlanak angin, B. nakau, B kēdēra, B. puteh, Puntong damar or Puting damar, and Pēlong.\n\nGrey Mullet. Fam. MUGILIDAE.\n\nBēlau. See Sēlangat bēlau.\n\nBēlibas. See Gēlibas.\n\nBēlida (R. M.). *Notopterus notopterus.*\n(Dun.). „ chitala.\n\nFeather-backs. Fam. NOTOPTERIDAE.\n\nBēlidang or Bēledang. (C. & S. Dict. 259) a salt water fish shaped like an eel (unid).\n\nBēlin (R. M.). *Muraena (Gymnothorax) undulata.*\n*Pisoodonophis cancrivorus.*\n\nEels. Fam. OPHICHTHYIDAE.\n\nBēliak mata (M. W. & de B. II 68 Mata belo).\n*Clupea (Alosa) kanagurta.*\n\nBēliak mata jantan. *Clupea (Harengula) moluccensis.*\n\nBēliak mata kapak. *Pellona dussumieri.*\n\nHerring. Fam. CLUPEIDAE.\n\nBēlodok (Dun.). *Apocryptes lanceolatus.*\n„ *Periophthalmus schlosseri.*\n„ *Gobius giuris.*\n„ *Boleophthalmus boddaerti.*\n\nBēlodok kērapu (Dun.). *Gobius sadanundio.*\n„ lobang „ *Gobius sp. aff. caninus.*\n\nGoby. Fam. GOBIIDAE.\n\nBēlodok karang (D. R.). *Platyglossus dussumieri.*\n\nParrot-fish. Fam. LABRIDAE.\nBělontok (Dun.). *Electris butis*.\n(Wilk.). *Gobius viridipunctatus*.\nGoby. Fam. Gobiidae.\n\nBělungkor. *Saurida tumbil*.\nCf. M. W. & de B. II 142 Belanka (Bintang).\nThe Queensland Smelt.\nFam. Scopelidae.\n\nBělukang. *Arius leiotetocephalus*.\n(Dun. *Arius liocephalus*).\nCat-fish. Fam. Siluridae.\nSee Pědukang.\n\nBělut. *Monopterus albus*.\n(M. W. & de B. III 414). An eel belonging to the order Synbranchoidea.\n\nBěngkalis. Also Měngkalis.\nIkan běngkalis is another name for the Ikan těru-bok.\n\nBěngkongkong. Also Běkukong, Běkuku and Kuku.\n(Blkr. Běkukung VIII 108). *Sparus hasta*.\nSea-Bream. Fam. Sparidae.\n\nBěntulu (M. W. & de B. III 209). *Barbichthys laevis*.\nCarp. Fam. Cyprinidae.\n\nBěras-běras. *Kyphosus* spp.\nDrummers. Fam. Kyphosidae.\n\nBěrchat (S. bertchat). *Ophiocephalus gachua*.\n\"Murrel.\" Fam. Ophiocephalidae.\nSee Aruan.\n\nBěrkas. *Caranx* sp.\nHorse-mackerel. Fam. Carangidae.\n\nBěrkil. A dark red fish of the Ikan merah family, which frequents timber rather than reefs, i.e. near piles, piers, sunken barges, etc.\n*Lutianus* sp.\nSnapper. Sub-fam. Lutianinae.\n\nBěroi. Also Yu gergaji.\n*Pristis* spp.\nSaw-fish. Fam. Pristidae.\nBěsikor. Also Měsikor. *Diagramma* spp.\nGrunters. Fam. PRISTIPOMATIDAE.\n\nBětok (Dun.). *Anabas scandens.*\nThe well known climbing perch of natural history books.\nFam. OSPHROMENIDAE.\n\nBětulu. See Běntulu.\n\nBiang-biang also Měmbiang (M. W. & de B. II 29). *Setipinna breviceps.*\nHerring. Fam. CLUPEIDAE.\n\nBiji durian (Dun.). *Osphromenus malayanus.*\nFam. OSPHROMENIDAE.\n\nBiji nangka (D. R.). *Upeneus tragula.*\nRed Mullet. Fam. MULLIDAE.\n\nBilis (M. W. & de B. II 16). *Stolephorus commersonii.*\n„ tri.\n(“White-bait”) Herring. Fam. CLUPEIDAE.\n\nBonang. *Platax teira.*\nCoral-fish. Fam. CHAETODONTIDAE.\n\nBongkar karang. Literally the reef lifter. A name applied to large members of the Ray family.\n\nBoyan. See Bayan.\n\nBujok. *Ophioccephalus* sp.\n„ Murrel.” Fam. OPHIOCEPHALIDAE.\n\nBulan or Bulan bulan (M. W. & de B. II 6). *Megalops cyprioides.*\nGiant-Herring. Fam. ELOPSIDAE.\n\nBulu ayam. *Coilia dussumieri.*\n„ quadrifilis.\n(Anchovy) Herring. Fam. CLUPEIDAE.\n\nBulus bulus or Běbulus (D. R. Bolas-bolas). *Sillago sihama maculata.*\nThe Whiting of Australia. Fam. SILLAGINIDAE.\n\nBunga ayer (C.). *Stolephorus indicus.*\n*Engraulis Russellii.*\nSee Bilis.\n(“White-bait”) Herring. Fam. CLUPEIDAE.\n\nNote: Bunga ayer, are probably the larvae or young of valuable food-fishes in the Leptocephalus stage.\nBuntal. A name applied to a large number of fishes belonging to the families Ostraciontidae (Box-fishes); Tetrodontidae (Globe-fishes); and Diodontidae (Sea-porcupines).\n\nBuntal batu (R. M.). *Ostracion cubicus.*\n   \" kotak or pěti. \" nasus.\n   \" \" \" cornutus.\n\nBuntal pisang. *Tetrodon lunaris.*\n   \" duri (Dun.). \" reticularis.\n   \" landak. *Diodon novemmaculatus.*\n   \" \" (R.M.). \" hystrix.\n\nChabok. See Parang-parang.\n\nChandong. *Opisthopterus tartoor.*\n   *Raconda russelliana.*\n   Herring. Fam. Clupeidae.\n\nChëlek mata (D. R. Chileh mata). *Pristipoma maculatum.*\n   \" Grunters.\" Fam. Pristipomatidae.\n\nChëmpëras also Tëmpëras (R. M. Temporas).\n   *Cyclocheilichthys apogon.*\n   Carp. Fam. Cyprinidae.\n\nChëncharu also Jaru-jaru (Dun.). *Caranx rottleri.*\n   Horse-mackerel. Fam. Carangidae.\n\nChënchodak. See Todak.\n\nChërechek (Cliff. 351). A fresh water fish with bright scales and red fins.\n   (Cf. M. W. & de B. III 62 Tjetjereh).\n   *Rasbora argyrotaenia.*\n   Carp. Fam. Cyprinidae.\n\nChërmin. *Caranx gallus.*\n   The Silvery Moon fish of Australia.\n   Horse Mackerel. Fam. Carangidae.\n\nChërmin. See Bawal chërmin.\n\nDaing bëläng. *Caranx compressus.*\n   \" speciosus.\n   Horse Mackerel. Fam. Carangidae.\n\nDarok-darok. (See C. & S. dict. 395).\n   Carp. Fam. Cyprinidae.\nDaun (S. M.). *Barbus oatesii*.\nCarp. Fam. CYPRINIDAE.\n\nDaun (Dun.). *Platax teira*.\nCoral-fish. Fam. CHAETODONTIDAE.\n\nDaun baharu (D. R.). *Drepane punctata*.\nThe Moon-fish of Queensland.\n\n\" \" Ephippus orbis.\nCoral-fish. Fam. CHAETODONTIDAE.\n\nDebam. *Teuthis java*.\n\" Black Trevally.\" Fam. TEUTHIDIDAE.\n\nDělah. *Caesio lunaris*.\n\" (R. M.). \" kuning.\n\n\" \" pinjalu.\n\nDělah karang (D.). *Caesio chrysozona*.\nSea-Bream. Fam. SPARIDAE.\n\nDěmbudok. *Caranx* sp.\nHorse Mackerel. Fam. CARANGIDAE.\n\nDengkis. *Teuthis nebulosa*.\n\" (R. Dukas). *Teuthis virgata*.\n\" Black Trevally.\" Fam. TEUTHIDIDAE.\n\nDuri (Dun.). *Macrones nemurus*.\n\" (D. R.). *Arius sagor*.\nCat-fish. Fam. SILURIDAE.\n\nEngor-engor. *Macrones nemurus*.\nCat-fish. Fam. SILURIDAE.\n\nGabus (Wilk. 557). *Ophioccephalus* sp.\n\" Murrel.\" Fam. OPHIOCEPHALIDAE.\n\nGaring (M. W. & de B. III 152). *Labeobarbus tambra*.\nCarp. Fam. CYPRINIDAE.\n\nGědabang (D. R.). *Psettus argenteus*.\nThe Silvery Bat-fish of Australia.\nBat-fish. Fam. SCORPIDIDAE.\n\nGělam (D.). *Psammoperca vaigiensis*.\nSea-Perch. Fam. SERRANIDAE.\nGélama (C.). *Umbrina russellii*.\n\n\" panjang (D.). *Otolithus argenteus*.\n\n*Sciaena* spp.\n\nThe following varieties are distinguished: viz.:\n\n- G. panjang.\n- papan.\n- China.\n- sēkang.\n- rapang.\n- batu.\n- itam.\n- perak.\n- batu kēling.\n- lanjut.\n- kuning dada.\n- dahi tinggi.\n- chērua.\n- pisang.\n\nJew-fish. Fam. *SCIAENIDAE*.\n\nGēlibas also Bēlibas & Libas (R. M. Bēlibas). *Teuthis oramin*.\n\n\"Black Trevally.\" Fam. *TEUTHIDIDAE*.\n\nGemang. The synonym for large *Ikan sēmbilang*.\n\n*Plotosus* spp.\n\nCat-fish. Fam. *SILURIDAE*.\n\nGēmang darat (Dun.). *Silurichthys phaiosoma*.\n\nCat-fish. Fam. *SILURIDAE*.\n\nGēmi also Gēdemi and Kēmi (C.). *Echineis naucrates*.\n\nSucking-fish. Fam. *ECHINEIDIDAE*.\n\nGērēpoh. Like the Sagai but with thicker lips.\n\n*Caranx* sp.\n\nHorse Mackerel. Fam. *CARANGIDAE*.\n\nGērētak lantei (R. M. Kertah lantei). *Synagris japonicus*.\n\n\" \" Scolopsis personatus.\n\n\" \" (D. R.). *Lethrinus nebulosus*.\n\n\" \" Sea-Bream. Fam. *SPARIDAE*.\n\nGergaji. Yu gērgaji.\n\n(Dun. C.). *Pristis cuspidatus*.\n\nSaw-fish. Fam. *PRISTIDAE*.\nGērut-gērut (Dun.). *Mesoprion* sp.\nSnapper. Fam. *Lutianidae*.\n\n„ „ (D. Blkr.). *Pristipoma hasta*.\n\n„ „ (Blkr. Krot-krot) „ *maculatum*.\n\n„ „ „ Krot) „ *guoraca*.\n\n\"Grunters.\" Fam. *Pristipomatidae*.\n\nGombing (Cf. R. Rombin karang). *Heniochus macrolepidotus*.\nCoral-fish. Fam. *Chaetodontidae*.\n\n„ *Glyphidodon coelestinus*.\nCoral-fish. Fam. *Pomacentridae*.\n\nHaruan. See Aruan.\n\nHayam. See Ayam.\n\nInggū. *Dascyllus* sp.\n\n„ (R. M.). *Pomacentrus albofasciatus*.\n\n„ (D. R. Ingu). *Amphiprion ephippium*.\n\n„ (R. M.). *Amphiprion frenatus*.\nCoral-fish. Fam. *Pomacentridae*.\n\n„ (D. R. Ingu rombin). *Holacanthus sexstriatus*.\n\n„ (D. R. Ingu rombin). *Holacanthus mesoleucus*.\nCoral-fish. Fam. *Chaetodontidae*.\n\nJahan. *Arius thalassinus*.\nCat-fish. Fam. *Siluridae*.\n\nJalu jalu (R. M.). *Caranx boops*.\nHorse-mackerel. Fam. *Carangidae*.\n\n„ „ *Caesio pinjalu*.\nAlso known as Ikan merah china.\nSea-Bream. Fam. *Sparidae*.\n\nJampong (R. M.). *Chilinus chlorurus*.\nParrot-fish. Fam. *Labridae*.\n\nJangas = Bandang.\nFam. *Chanidae*.\n\nJarang gigi (C.). *Otolithus maculatus*.\n\n„ „ *argenteus*.\n\n„ „ *ruber*.\n\n„ *Collichthys biaurita*.\nJew-fish. Fam. *Sciaenidae*.\n\nJaru-jaru. See Chencharu.\nJěboh. See Tamban jěboh.\n\nJěbong (D. R.). *Balistes stellatus.*\n\"Leather jackets.\" Fam. BALISTIDAE.\n\nJěmbědi. *Engraulis* sp.\nHerring. Fam. CLUPEIDAE.\n\nJěmpul. See Bělanak.\n\nJěněhak. *Lutianus roseus.*\n(Blkr.) \" johnii.\n\" \" sebae.\n\" \" fulviflamma.\n\" \" lioglosus.\n\" \" argentimaculatus.\n\nNote:—The generic names Ikan merah and Ikan jěněhak are synonymous. The latter name being used in the north, (Penang and Kedah) and the former in the south, Singapore, etc.\n\nSnapper. Sub-fam. LUTIANINAE.\n\nJěngkua (unid.).\nCarp. Fam. CYPRINIDAE.\n\nJěnjalu see Jalu jalu.\n\nJěrong. See Yu jěrong. Shark. Fam. CARCHARIIDAE.\n\nJolong jolong or Julong; also Jěnjulong (Dun.). *Hemirhamphus canteris.*\n(Dun.). *Hemirhamphus buffonis.*\n\" \" limbatus.\n\" \" pogonognathus.\n\" \" fluviatilis.\n\" \" (Blkr.). \" far.\n\nJolong-jolong banang. *Hemirhamphus far.*\nGar-fish. Fam. SCOMBRESOCIDAE.\n\nJuara (Wilk. 235). An edible fresh-water fish.\n(Cf. M. W. & de B. II 258 juaro). *Pangasius polyuranodon.*\nCat-fish. Fam. SILURIDAE.\n\nKachang-kachang. A fish similar to, but smaller than, the Alu-alu, q.v.\n\"Barracudas.\" Fam. SPHYRAENIDAE.\nKachi. *Diagramma* spp.\n\n\"Grunters.\" Fam. *Pristipomatidae*.\n\n*Novacula* spp.\n\nParrot-fishes. Fam. *Labridae*.\n\nKakap also Siakap. The \"Cock-up\" of Europeans in India, whence the name by which this fish is known in Queensland was probably derived.\n\n(Blkr.). *Lates calcarifer*.\n\nSea-Perch. Fam. *Serranidae*.\n\nKalat (R. M.). *Pseudoscarus rivulatus*.\n\n\"Parrot-Wrasses.\" Fam. *Scaridae*.\n\nKalui (Dun, D. R.). *Osphromenus olfax*.\n\nHabitat—China and the fresh waters of the Malay Archipelago.\n\nNaturalised in Mauritius, Cayenne, Australia and introduced into some parts of India, viz., near Calcutta, Madras and the Neilgherries. Attains 20 lbs. or more in weight and is excellent eating when kept in clean water. Known as Gurami in India.\n\nNote:—Kalui probably derived from Kallawah. (Tamil) a perch.\n\nFam. *Osphromenidae*.\n\nKapas, Kapas-kapas, (Blkr.). *Sparus hasta*.\n\nSea Bream. Fam. *Sparidae*.\n\n,, (Blkr.). *Gerres abbreviatus*.\n\n,, *filamentosus*.\n\n\"Silver-Bream.\" Fam. *Gerridae*.\n\nKarang. Reef or coral.\n\nIkan karang. Fish frequenting rocks and coral reefs.\n\nKasi-kasi. *Engraulis baelama*.\n\n(\"Whitebait\") Herring. Fam. *Clupeidae*.\n\nKawan-kawan (R. M.). *Dangila burmanica*.\n\n,, *cuvieri*.\n\nCarp. Fam. *Cyprinidae*.\n\nKēbasi (Pahang) = Sēlangat q.v.\n\nKēdēmut. *Caranx* sp.\n\nHorse-Mackerel. Fam. *Carangidae*.\n\nKēdēra. See Bēlanak.\n\nGrey Mullet. Fam. *Mugilidae*.\nKēdewas. See Bawal.\nPomfret. Fam. STROMATEIDAE.\n\nKēdondong. A large bulus-bulus.\nSee Bulus-bulus.\nWhiting. Fam. SILLAGINIDAE.\n\nKekek gēdabang (R. M.). Equula edentula.\n\"Silver-Bream.\" Fam. GERRIDAE.\n\nKēkek labu. Gazza minuta.\n\"Silver-Bream.\" Fam. GERRIDAE.\n\nKēkek jawa. Mene maculata.\n\nKēkek gēdabang. Mene maculata.\nHorse-Mackerel. Fam. CARANGIDAE.\n\nKēlabau (Wilk. 524). A fresh water fish (Unid.).\n(Cf. M. W. & de B. III 129). Osteochilus kelabau.\nCarp. Fam. CYPRINIDAE.\n\nKēlah (R. M.). Barbus kolis.\n\" \" stracheyi.\nCarp. Fam. CYPRINIDAE.\n\nKēlalawer (Blkr.). Antennarius hispidus.\nAngler-fish. Fam. ANTENNARIIDAE.\n\nKēlara (See Wilk. 524). The young of the sēmbilang.\nCat-fish. Fam. SILURIDAE.\n\nKēli (Dun. D. R.). Clarias magur.\n\" (S.). teysmanni.\nCat-fish. Fam. SILURIDAE.\n\nKēmbal mas. Thynnus thunnina.\nSee Tongkol.\nMackerel. Fam. SCOMBRIDAE.\n\nNote.—Kembal mas and Tombol mas derived from Tamil Kombola mach.\n\nKēmbong (Dun.). Caranx calla.\nHorse-Mackerel. Fam. CARANGIDAE.\n\n\" (R M.). Scomber microlepidotus.\nMackerel. Fam. SCOMBRIDAE.\n\nKēmējan. Also Kēmēnnyan.\nRhynchobatus djeddensis.\nBeaked-Rays. Fam. RHINOBATIDAE.\nKěmi. See Gěmi.\n\nKěnděrap. Bagarius sp. ?\nCat-fish. Fam. Siluridae.\n\nKěpar. An edible fresh water fish, common in ponds and swamps.\nSee Bleeker Vol. IX Polyacanthus hasseltii.\n(Plate only: no description).\nFam. Osphromenidae.\n\nKěpau (Dun.). Catopra fasciata.\nFresh-water Perch. Fam. Nandidae.\n\nKěpau laut (R. M.). Glyphidodon notatus.\nCoral-fish. Fam. Pomacentridae.\n\nKěpayat. (See Wilk. 522). A large fish (unid.).\nCf. M. W. & de B. III 109 Kapyah.\nMystacoleucus marginatus.\nCarp. Fam. Cyprinidae.\n\nKeping (R. M. Kepang). Glyphidodon notatus.\nCoral-fish. Fam. Pomacentridae.\n\nKěpiyat (M. W. & de B. III 179 Kepiat).\nPuntius schwanefeldi.\nCarp. Fam. Cyprinidae.\n\nKěrai (Dun. Krai). Barbus goniosoma.\n(R. M. Kereh). ,, neilli.\n,, kunyet. ,, sp.\n,, jělawat. ,, \"\nCarp. Fam. Cyprinidae.\n\nKěrapu (Dun.). Epinephelus tauvina.\n,, Cromileptis altivelis.\n,, Plectropoma maculatum.\n,, (Day I 450, Dun. D. R.). Epinephelus lanceolatus.\n,, (Blkr. R.). ,, fasciatus.\n,, (Blkr.). ,, boelang.\n,, karang (Blkr.). ,, minatus.\n,, lumpur (Blkr.). ,, pantherinus.\n,, bloso (Blkr.). ,, corallicola.\n,, tutul (Blkr.). ,, merra.\n,, bebeh (Blkr.). ,, fuscoguttatus.\n,, ,, ,, ,, sexfasciatus.\n,, lilin (R. M.). ,, hoevenii.\n,, sonoh. ,, salmoides.\nCromileptis altivelis.\nSea-Perch. Fam. Serranidae.\nKērētang. *Epinephelus pantherinus.*\nSea-Perch. Fam. SERRANIDAE.\n\nKēring, Ikan kēring. Lit. dried fish.\n*Amphisile scutata.*\nSea-snipe. Fam. AMPHISILIDAE.\n\nKērisi (Blkr. Gurisi mejrah). *Synagris taeniopterus.*\n\" \" \" \" \" \" \" japonicus.\n\" \" \" \" \" \" \" tolu.\nSea-Bream. Fam. SPARIDAE.\n\nKērisi aji-aji. *Synagris nematopus.*\n\" bali (R. M.). *Scolopsis bilineatus.*\nSea-Bream. Fam. SPARIDAE.\n\nKerong-kerong also Mēngkerong.\n\" \" (D. R.). *Therapon puta.*\n\" \" \" \" \" quadrilineatus.\n\" \" \" \" \" theraps.\n\" \" (Blkr.). \" \" jarbua.\nSnapper. Sub-fam. LUTIANINAE.\n\" \" (D. R.). *Centrogenys vaigiensis.*\nSea-perch. Fam. SERRANIDAE.\n\nKērosok (R. M.). *Monacanthus cheirocephalus.*\n\" padi (R. M. Kerusu padi). *Monacanthus monoceros.*\n\" Leather Jackets.\" Fam. BALISTIDAE.\n\nKērtakok (D. R.). *Batrachus grunniens.*\nFrog-fishes. Fam. BATRACHIDAE.\n\nKetang also Kitang (Dun. D. R.). *Ephippus argus.*\n(D. R.). *Holacanthus annularis.*\nCoral fish. Fam. CHAETODONTIDAE.\n\nKetang (Dun.). *Teuthis virgata.*\n\" \" \" stellata.\n\" (C.). \" \" java.\n\" \" \" \" concatena.\n\" \" \" \" dorsalis.\n\" Black Trevally.\" Fam. TEUTHIDIDAE.\n\nKētarap (R. M.). *Pseudoscarus ghobban.*\n\" Parrot-wrasse.\" Fam. SCARIDAE.\nKetewas. See Bawal.\n\nKia-kia. See Yu kia-kia.\n\nKubal. *Polynemus* spp.\nA name applied to large fish of this family.\nThreadfins. Fam. POLYNEMIDAE.\n\nKuda laut (Dun.). *Hippocampus hystrix*.\nSea-Horses. Fam. SYNGNATHIDAE.\n\nKuku. See Bengkongkong.\n\nKuning-kuning. *Lutianus erythropterus*.\nSnappers. Sub-fam. LUTIANINAE.\n\nKurau. *Polynemus paradiseus*.\n(C.). \" indicus.\n(R.). \" sextarius.\n\nKurau pipit \" sextarius.\n\nKurau janggut (Dun.). \" tetradactylus.\nThreadfins. Fam. POLYNEMIDAE.\n\nLais (M. W. & de B. II 204). *Belodontichthys dinema*.\n\"Dun.\" \" Cryptopterus cryptopterus.\n\" (Dun.) \" micropus.\nCat-fish. Fam. SILURIDAE.\n\nLalang (Dun.). *Crossochilus oblongus*.\n\" \" *Rasbora daniconius*.\n\" \" *Chela* spp.\nCarp. Fam. CYPRINIDAE.\n\nLali (M. W. & de B. III 24 Langli). *Botia hymenophysa*.\nLoach. Fam. COBITIDAE.\n\nLambai. *Teuthis* sp.\n\" Black-Trevally.\" Fam. TEUTHIDIDAE.\n\nLampam (M. W. & de B. III 178). *Puntius schwanefeldi*.\n(R. M.). *Barbus jerdoni*.\nCarp. Fam. CYPRINIDAE.\n\nLampila (S.) (Lampile). *Betta bellica*.\nFam. OSPHROMENIDAE.\nSee Belaga.\nLandok (Pahang). *Sparus datnia.*\nSea-Bream. Fam. Sparidae.\n\nLanggai. *Trichiurus savala.*\n\"Barracouta.\" Fam. Trichiuridae.\n\nLangi. A term applied to Tenggiri of the largest size.\n\nLau (East coast). *Polynemus sextarius.*\nJew-fish. Fam. Polynemidae.\n\nLawang (C. & S. dict. 171).\nCf. M. W. & de B. II 259. *Pangasius* sp.\n\" \" 271. *Bagarius* sp.\nCat-fish. Fam. Siluridae.\n\nLawi ayam. See Bulu ayam.\n\nLayer, Layeran or Selayar (Dun. D. laiar). *Histiophorus gladius.*\nSail-fish. Fam. Histiophoridae.\n\nLayur (D. R.) also Selayur. *Trichiurus savala.*\n\"Barracouta.\" Fam. Trichiuridae.\n\nLebai (R. Lebis). *Mulloides flavolineatus.*\n*Upeneus luteus.*\ntragula.\nRed-Mullet. Fam. Mullidae.\n\nLebam. See Debam.\n\nLele (Wilk. 629) Jav. *Clarias punctatus.*\n(M. W. & de B. II 189). \"melanoderma.\"\n\" \" 191). \"batrachus.\nCat-fish. Fam. Siluridae.\n\nLembat (M. W. & de B. II 190). *Clarias nieuhofi.*\nCat-fish. Fam. Siluridae.\n\nLembu (Dun.). *Ostracion cornutus.*\nBox-fishes. Fam. Ostraciontidae.\n*Triaconthus* sp.\n\"Leather-jackets.\" Fam. Balistidae.\n\nLepu (Dun.). *Antennarius hispidus.*\nAngler-fish. Fam. Antennariidae.\n\n\"Dun. D. R.). *Synancidium horridum.*\n\"(R.). *Scorpaena polyprion.*\n\"Pterois antennata.*\n\"panjang (R. M.). *Pelor didactylum.*\nGoblin-fishes. Fam. Scorpaenidae.\nMalay varieties are Lepu semaram.\n\"beranyut.\n\"landak.\nMata lalat (Hanitsch Jour. S. B. R. A. S. Dec., 1912).\nHaplochilus panchax.\n\"Millions.\" Fam. Cyprinodontidae.\n\nLidah also Lidah-lidah (Dun.). Cynoglossus lida.\n\" grandisquamis.\n\" lingua.\n(Dun. C.). Plagusia bilineata.\n\" Cynoglossus elongatus.\n\" Psettodes erumei.\n\n,, baji (D. R.). Synaptura orientalis.\n,, lumpur (D. R.). Synaptura commersoniana.\n,, (C.). Cynoglossus cantoris.\nFlat-fish. Fam. Pleuronectidae.\nSee also Sa-belah.\n\nLisah (C.). Periophthalmus schlosseri.\n(Mud-Skipper). Goby. Fam. Gobiidae.\n\nLogu (D. R.). Choerops oligacanthus.\n\" Parrot-fishes.\" Fam. Labridae.\n,, (R. M.). Myripristis murdjan.\n\" Silver-Bream.\" Fam. Berycidae.\n\nLoma (R. M.). Thynnichthys sandkhol.\nCarp. Fam. Cyprinidae.\n\nLuding. A term applied to small Tenggiri.\n\nLuli (C.). Harpodon nehereus.\nSee Lumi. Fam. Scopelidae.\n\nLumban (R.). Teuthis java.\nThe \"Black Trevally\" of Australia.\n\" Black Trevally.\" Fam. Teuthididae.\n\nLumi. Harpodon nehereus.\nThe \"Bombay-duck.\" Fam. Scopelidae.\n\nLundu (M. W. & de B. II 345). Macrones gulio.\nCat-fish. Fam. Siluridae.\n\nMalong (Dun. D. R.). Muraenesox talabon.\n\" talabonoides.\n\" cinereus.\nConger eels. Fam. Muraenidae.\n\nMamong. Caranx sp.\nHorse-Mackerel. Fam. Carangidae.\nMandi abu. *Diagramma* spp.\n“Grunters.” Fam. *Pristipomatidae*.\n\n„ *Novacula* spp.\n“Parrot-fishes.” Fam. *Labridae*.\n\n*Mata bēliak* (M. W. & de B. II 68 Mata belo).\n*Clupea* (*Alosa*) *kanagurla*.\nSee *Bēliak mata*.\nHerring. Fam. *Clupeidae*.\n\nMayong. *Arius* sp.\nCat-fish. Fam. *Siluridae*.\n\n*Mēmpinis*. *Engraulis* spp.\n(“White-bait.”) Herring. Fam. *Clupeidae*.\n\n*Mēmpurong*. Also *Porong* or *Purong*.\n*Lycothrissa crocodilus*.\n(Sprat or Anchovy.) Herring. Fam. *Clupeidae*.\n\n*Mēnangin*. *Elops hawaiiensis*.\nGiant Herring. Fam. *Elopidae*.\n\n*Mēngkai* or *Mingkai* (Wilk. 651). A species of Ray.\n\n*Mēngkerong*. See *Kerong-kerong*.\n\nMerah (R. M.). *Lutianus roseus*.\nSnapper. Sub-fam. *Lutianinae*.\n\nMerah China. *Caesio pinjalu*.\nSea-Bream. Fam. *Sparidae*.\n\n*Mērawan*. *Lutianus* sp.\nSnapper. Sub-fam. *Lutianinae*.\n\n*Mudin* or *Mudim*. *Saurus myops*.\n\n*Mēsikor*. *Diagramma* spp.\n“Grunters.” Fam. *Pristipomatidae*.\n\n„ *Novacula* sp.\nParrot-fishes. Fam. *Labridae*.\n\n*Mersuji*. *Histiophorus* sp.\nSaid to be smaller than *Sēlayer*.\nSail-fish. Fam. *Histiophoridae*.\nFam. *Scopelidae*.\n\n*Nandong* (Kedah) = *Sēlangat*.\nHerring. Fam. *Clupeidae*.\nNyior-nyior (D. R. Nior-nior). *Trachynotus ovatus.*\nThe Dart of Australia.\nHorse-Mackerel. Fam. CARANGIDAE.\n\nNyua-nyua (Dun.). *Barilius guttatus.*\n*Luciosoma setigerum.*\nCarp. Fam. CYPRINIDAE.\n\nOtek (Blkr.). *Arius utik.*\nCat-fish. Fam. SILURIDAE.\n\nPachal. See Parang-parang.\n\nPaku. See Rěnnyau.\n\nPala (Dun.). *Betta pugnax.*\nFam. OSPHROMENIDAE.\nSee Bēlaga.\n\nParang-parang (M. W. & de B. II 18). *Chirocentrus dorab.*\nThe terms used to describe different sizes of this fish are:\nPachal, largest.\nTēgap, large.\nChabok, medium.\nSudip, small.\n\nChabok sētu or sētul is the term applied to this fish when caught, (usually in seine nets) in shallow water: amongst the marine plant (sētul).\n\nThe Dorab. Fam. CLUPEIDAE.\n\nPari kēbas (C.). *Narcine timlei.*\n” ” ” *Astrape dipterygia.*\n” linchin ” *Temera hardwickii.*\n” bunga (C. banga). *Astrape dipterygia.*\nElectric-Rays. Fam. TORPEDINIDAE.\n\nPari dēdap (Dun.). *Urogymnus asperrimus.*\n” bēting ” *Trygon uarnak.*\n” bēndera ” ” sephen.\n” daun ” ” ”\n” lalat. *Trygon walga.*\n” rěnnyau ” *kuhlīi.*\n\nSting-Rays. Fam. TRYGONIDAE.\nPari kēlawar (C.). *Myliobatis vespertilio.*\n„ „ „ „ „ nieuhoft.\n„ lang (C., D.). *Aetobatis narinari.*\n„ daun (C.). *Rhinoptera adspersa.*\n„ paus (D.). *Dicerobatis egregoodoo.*\n„ „ (Dun.). *Ceratoptera ehrenbergii.*\n„ kola „ „ Eagle-Rays. Fam. *Myliobatidae.*\n\nPasir (Dun.). *Acanthopsis choerorhynchos.*\nLoaches. Fam. *Cobitidae.*\n„ (R. M.). *Labeo boggut.*\nCarp. Fam. *Cyprinidae.*\n\nPasir-pasir also Mēmpasir (Blkr.). *Scolopsis personatus.*\n„ „ „ cancellatus.\n„ „ „ ciliatus.\n„ „ „ bilineatus.\n„ „ „ vosmaeri.\n„ „ „ bimaculatus.\n„ „ „ monogramma.\nSea-Bream. Fam. *Sparidae.*\n\nPatin (M. W. & de B. II 257). *Pangasius pangasius.*\nCat-fish. Fam. *Siluridae.*\n\nPatong (S. petong). *Catopra fasciata.*\nFresh-water Perch. Fam. *Nandidae.*\n\nPēchah pēriok (C.). *Lobotes surinamensis.*\nThe Dusky Perch. Fam. *Lobotidae.*\n\nPēdukang (M. W. & de B. II 327). Anak dukang.\n*Hemipimelodus borneensis.*\nCat-fish. Fam. *Siluridae.*\nSee Bēlukang.\n\nPēlaga. Also Ampit-ampit, Pala and Bēlaga.\n*Betta pugnax.*\n„ *bellica.*\nFam. *Osphromenidae.*\n\nPēlaling. Siamese, pla = fish.\nHorse mackerel. Fam. *Carangidae.*\n\nPēlata (Meck. Siamese Pla-thu). *Scomber microlepidotus.*\nMackerel. Fam. *Scombridae.*\nVarieties are Pēlata Bali and Pēlata minyak.\nPetek-petek (Dun.). *Ambassis ranga*.\n\n\" \" \" \" commersonii.\n\nSea-Perch. Fam. Serranidae. Sub-fam. Ambassinae.\n\nPëti, Ikan pëti. A name applied to the Box fishes.\n\nSee Buntal. Fam. Ostraciontidae.\n\nPetong (S.). *Catopra fasciata*.\n\nFresh-water Perch. Fam. Nandidae.\n\nPias. *Dorosoma chacunda*.\n\nHerring. Fam. Clupeidae.\n\nPijat-pijat. *Scolopsis torquatus*.\n\nSea-Bream. Fam. Sparidae.\n\nPinang-pinang (D. R.). *Chaetodon octofasciatus*.\n\n(R. M.). \" vagabundus.\n\nCoral fish. Fam. Chaetodontidae.\n\n*Sparus datnia*.\n\nSea-Bream. Fam. Sparidae.\n\nPipit (D. R.). *Chelmo rostratus*.\n\nCoral fish. Fam. Chaetodontidae.\n\nPonggok. A fish inhabiting reefs. Unidentified.\n\nPorong. See mëmpurong.\n\nPuchuk (C.). *Trichiurus savala*.\n\n\" haumela.\n\n\"Barracouta.\" Fam. Trichiuridae.\n\nPuchok pisang (Unid.). Carp. Fam. Cyprinidae.\n\nPukul gendang (R. M.). *Percis pulchella*.\n\nStar-gazer. Fam. Leptoscopidae.\n\nPantong damar. See Bëlanak.\n\nPuput. Also Puput Malacca.\n\n(M. W. & de B. II 90). *Pellona amblyuropterus*.\n\n\" elongata.\n\n(M. W. & de B. II 93) \" dussumieri.\n\n*Raconda russelliana*.\n\nHerring. Fam. Clupeidae.\n\nPuput (R.). *Hemirhamphus limbatus*.\n\nPuput banang \" far.\n\nGar-fish. Fam. Scombrresocidae.\nPuteh (Dun. as Barbus maculatus). *Puntius binotatus.*\n\" (,, ,, apogon). *Cyclocheilichthys apogon.*\n\" (,, ). *Rasbora vulgaris.*\n\" (,, as Barbus obtusirostris). *Mystacoleucus marginatus.*\nCarp. Fam. CYPRINIDAE.\n\nPuyu. Also Puyu-puyu and Pēpuyu.\n\" (S. Dun). *Anabas scandens.*\nThe Climbing Perch. Fam. OSPHROMENIDAE.\n\nRapang. Also Rēpang.\nSee Bēlanak rapang and Gēlama rapang.\n\nRēnnyau. *Atherina forskali.*\n\" temmincki.\nSand-Smelts. Fam. AHERINIDAE.\n\nRiu-riu. (Dun.). *Lais hexanema.*\nCat-fish. Fam. SILURIDAE.\n\nRong (Dun.). *Dangila cuvieri.*\n\" bēras (C. & S. dict. 271). Idem ?\n\" (R. M.). *Labeo caeruleus.*\nCarp. Fam. CYPRINIDAE.\n\nRumbong-rumbong (R. M.). *Lutianus madras.*\nSnapper. Sub-fam. LUTIANINAE.\n\nRumi-rumi (D. R.). *Echineis naucrates.*\nSucking-fish. Fam. ECHINEIDIDAE.\n\nSa-bēlah (Dun.). *Synaptura achira.*\n(C.). *Psettodes erumei.*\n\" *Pseudorhombus russellii.*\nFlat-fish. Fam. PLEURONECTIDAE.\nSee Lidah.\n\nSagai (R.), *Caranx gallus.*\n\" (D. R.). ,, armatus.\nHorse-Mackerel. Fam. CARANGIDAE.\n\nSai (Wilk. 367). A kind of Ray.\n\nSēbarau also Barau-barau (Dun.). *Hampala macrolepidota*\n(Barbus hampal.)\n(R. M.). ,, *hexastichus.*\nCarp. Fam. CYPRINIDAE.\n\nSēbēkah. *Apogon* spp.\nSea-Perch. Sub-fam. CHILODIPTERINAE.\nSēbēkah karang. *Myripristis murdjan.*\nNannygai. Fam. Berycidae.\n\nSēdakang (R. M.). *Gerres altispinnis.*\n\"Silver-Bream. Fam. Gerridae.\n\nSēkiki. See Kekek.\n\nSēlampai (C.). *Collichthys biaurita.*\nJew-fish. Fam. Sciaenidae.\n\nSēlangat (M. W. & de B. II 26 selangkat).\n*Dorosoma chacunda.*\n„ bēlau „ nasus.\n„ tuli „ sp.\nHerring. Fam. Clupeidae.\n\nSēlangin (C.). *Polynemus tetradactylus.*\n„ „ „ sextarius.\nThread-fins. Fam. Polynemidae.\n\nSēlar (Dun). *Caranx kurra.*\n„ „ *Trachynotus bailloni.*\n„ batang (R.). *Caranx djeddaba.*\n„ abu-abu (R. M.). „ ire.\n„ kuning „ „ *gymnostethoides.*\n„ letup-letup. „ *oblongus.*\n„ „ „ „ *compressus.*\n\nThe Malays of Singapore differentiate between three sizes of Sēlar batang, viz.,\nSmall, Sēlar renchih.\nMedium, „ kēledek.\nLarge, „ batang.\n\nOther varieties, Sēlar bulat and Sēlar lepir.\nHorse Mackerel. Fam. Carangidae.\n\nSēlayer. *Histiophorus gladius.*\nSail-fish. Fam. Histiocephoridae.\n\nSēlayur. *Trichiurus savala.*\n\"Barracouta.\" Fam. Trichiuridae.\n\nSēlemah. *Lactarius delicatulus.*\nFam. Lactariidae.\n\nSēliap (D. R. Saliup). *Chorinemus lysan.*\n„ „ *sancti-petri.*\nHorse-mackerel. Fam. Carangidae.\nSēlichin. *Anampses caeruleopunctatus.*\nParrot-fish. Fam. LABRIDAE.\n\nSēligi (R.). *Anacanthus barbatus.*\nLeather-jackets. Fam. BALISTIDAE.\n\nSēlikor. The synonym in Singapore for a large Chēncharu.\n*Caranx rottleri.*\n\nSēlimang (M. W. & de B. III 230). *Epalzeorhynchus kallopterus.*\nCarp. Fam. CYPRINIDAE.\n\nSēlinching. *Pentapus* spp.\n“Grunters.” Fam. PRISTIPOMATIDAE.\n\nSēluang (S.). *Rasbora argyrotaenia.*\n(Dun.). “trilineata.”\n(R.). *Barilius guttatus.*\nSmall varieties are known as Sēluwang bēras C. & S.\ndict. 271.\nCarp. Fam. CYPRINIDAE.\n\nSēludu (Blkr. as *Arius maculatus*). *Pseudarius arius.*\n(C. Surdudu). *Arius macronotacanthus.*\nCat-fish. Fam. SILURIDAE.\n\nSēmangka (D.). *Apogon frenatus.*\nSea-Perch. Sub-fam. CHILODIPTERINAE.\nSee Sēbēkah.\n\nSēmaram. *Centrogenys waigiensis.*\nSea-Perch. Fam. SERRANIDAE.\n(R. M.). *Centropogon indicus.*\nkarang (R. M.). *Synancia verrucosa.*\n“Goblin-fish.” Fam. SCORPAENIDAE.\n\nSēmbak. See Tongkol.\n\nSēmbilang (I. R.). *Plotosus canius.*\n(C. Blkr.). *Paraplotosus albilabris.*\nkarang (M. W. & de B. II 230). *Plotosus anguillaris.*\nCat-fish. Fam. SILURIDAE.\n\nSēmpila. Also Sēmpilai (Wilk.) and Lampile (S.).\nSee Bēlaga.\nFighting-fish. Fam. OSPHROMENIDAE.\n\nSēnangin (C.). *Polynemus tetradactylus.*\nThread-fins. Fam. POLYNEMIDAE.\nSëndarat. *Lutianus argentimaculatus.*\nSnapper. Sub-fam. LUTIANINAE.\n\nSënderong (D. senderang sendok). *Plectropoma maculatum.*\n*Epinephelus sexfasciatus.*\nSea-Perch. Fam. SERRANIDAE.\n\nSëngaring. See Wilk. 384. Also Karing.\nCf. M. W. & de B. III 152. Sëngkaring.\n*Labeobarbus tambra.*\nCarp. Fam. CYPRINIDAE.\n\nSënohong. A large Sënangin.\n\nSënyor. *Psettus falciformes.*\nBat-fish. Fam. SCORPIDIDAE.\n\nSëpat. (Dun). *Osphromenus trichopterus.*\nFam. OSPHIROMENIDAE.\n\nSëpat karang (R. M.). *Lobotes surinamensis.*\nThe Dusky Perch. Fam. LOBOTIDAE.\n\nSëpat karang. *Pempheris spp.*\n\"Bull's Eyes.\" Fam. PEMPERIDAE.\n\nSërandong (See Wilk. 381). A fresh water fish. (Unidentified).\n\"It is something like the Sëlangat.\"\n\nSërasah. Literally rubbish, manure.\nIkan sërasah. Small and immature fish used as manure.\n\nSëriding (Dun.). *Equula edentula.*\n\"Silver-Bream.\" Fam. GERRIDAE.\n\nSëtoka. A small Ray.\n\nSëtonggang. *Monocentris japonicus.*\nKnight-fishes. Fam. MONOCENTRIDAE.\n\nSëtu or Sëtul. A marine plant with edible fruit. *Enhalus acoroides.*\nSee Parang-parang sëtu and Tamban sëtu.\n\nSia-sia (R. M.). *Diploprion bifasciatum.*\n*Ambassis gynocephalus.*\nSea-Perch. Fam. SERRANIDAE.\n\nSiakap (C.). *Lates calcarifer.*\nSea-Perch. Fam. SERRANIDAE.\n\nSirat-sirat. A marine eel (unid.).\nSongsong arus. *Caranx* sp.\nHorse-mackerel. Fam. CARANGIDAE.\n\nSudip. Anak sudip. The young of the Ikan parang.\n\nSumpit. Sumpit-sumpit.\n(Dun, C. D. R.). *Toxotes chatareus.*\n(Blkr.). \" *jaculator.*\nBlow-pipe fish. Fam. TOXOTIDAE.\n\n\" *Chelmo rostratus.*\n*Chaetodon vagabundus.*\nCoral-fish. Fam. CHAETODONTIDAE.\n\nSusur batang (Dun., Sulir batang, as Rasbora daniconius.)\n*Rasbora einthoveni.*\nCarp. Fam. CYPRINIDAE.\n\nTalang (Dun.). *Chorinemus lysan.*\n\" *sancti-petri.*\n\" *moadetta.*\nLarge specimens of *Chorinemus* are usually called Talang and small ones Sëliap.\nHorse-mackerel. Fam. CARANGIDAE.\n\nTali (S.) ? *Acanthopsis choerorhynchus.*\nLoach. Fam. COBITIDAE.\n\nTambak. See Bawal tambak.\n\nTamban (M. W. & de B. II 58 tembang). *Clupeoides lile.*\n\" (M. W. & de B. II 76). *Clupea (Harengula) fimbriata.*\n\" bëtul (C. batal). *Clupea perforata.*\n\" bulat (C.). *Dussumieria acuta.*\n\" nipis (C.). *Clupea perforata.*\n\" siantan. *Clupea (Harengula) fimbriata.*\n\" \" (Amblygaster) leiogaster.\n\" chinchang rëbong. *Clupeoides lile.*\n\" jëboh. *Dussumieria acuta.*\n\" \" hasseltii.\n\nTamban. Anak tamban jëboh. *Spratelloides delicatulus.*\n\" \" gracilis.\n\nAlso Tamban sëtu (unid.) & Tamban bëluru (unid.)\n(\"Sardines\") Herring. Fam. CLUPEDAE.\n\nTambëra. Also Tëmbëra or Tëbëra.\n(M. W. & de B. III 152). *Labeobarbus tambra.*\nCarp. Fam. CYPRINIDAE.\nTampok-tampok (Wilk. 187). *Gerres oblongus.*\n\"Silver-Bream.\" Fam. GERRIDAE.\n\nTanda-tanda (Wilk. 193). *Lutianus sillao.*\n\"bohar.\"\nSnapper. Sub-fam. LUTIANINAE.\n\nTapa also Tapah (Dun.). *Callichthys pabda.*\nCf. M. W. & de B. II 202. *Wallago* spp.\nCat-fish. Fam. SILURIDAE.\n\nTēbal bibir (R. M.). *Diagramma cinctum.*\n\"punctatum.\"\n\"(D. R.).\" \"crassipinum.\"\n\"(R.).\" \"pictum.\"\n\"Grunters.\" Fam. PRISTIPOMATIDAE.\n\nTēbal pipi = Gérut-gérut q.v.\n\nTēkok (onom.). *Halieutaea stellata.*\nCroakers. Fam. MALTHIDAE.\n\nTelan. See Tilan.\n\nTēlan rumput (R. M.). *Kyphosus (Pimelepterus) cinerascens.*\n\"Drummer.\" Fam. KYPHOSIDAE.\n\nTēmbakul. *Periophthalmus schlosseri.*\n(Mud-skipper) Goby. Fam. GOBIIDAE.\n\nTēmbēlian. *Barbus* sp.\nCarp. Fam. CYPRINIDAE.\n\nTēmbēreh (C. Tembari). *Sciaena diacanthus.*\n(Wilk. 181). *Otolithus punctatus.*\nJew-fish. Fam. SCIAENIDAE.\n\nTēmēngalan (R. M.). *Barbus burmanicus.*\n(Blkr. Teban-galang). *Amblyrhynchichthys truncatus.*\nCarp. Fam. CYPRINIDAE.\n\nTēmēnggong (Blkr.). *Priacanthus tayenus.*\nSea-perch. Fam. SERRANIDAE.\n\nTēmēnong = Kēmbong. q.v.\n\nTēmoleh (R. Tamaleh, as *Barbus apogon.* ) *Cyclocheilichthys apogon.*\nCarp. Fam. CYPRINIDAE.\n\nTēmpēras (R. M. as *Barbus apogon.* ) *Cyclocheilichthys apogon.*\nTempuwa (Wilk. 188 as Barbus apogon.) Cyclocheilichthys apogon.\nCarp. Fam. Cyprinidae.\n\nTenggiri (Dun.). Cybium kuhlii.\n(C.). \" commersonii.\n\" \" linolatum.\n\" batang (D.). \" commersonii.\n\" musang \" \"\n\" papan (C.). \" guttatum.\n\nThe descriptive terms Tenggiri luding, T. tohok, T. padi, T. tundan and Langi are used with reference to the size of these fish.\n\nMackerel. Fam. Scombridae.\n\nThe Tenggiri is the well-known sporting fish, the Spanish Mackerel of the Philippines and Australia.\n\nTengkerong. See Kerong-kerong.\n\nTenok. Sphyraena novae-hollandiae.\n\" \" obtusata.\n\" \" jello.\n\nSmall Kachang-kachang, larger Alu-alu, largest size Tenok.\n\n\"Barracudas.\" Fam. Sphyraenidae.\n\nTerbul. Osteochilus hasselti.\nCf. S. \"Teboye\" Duncker p. 205.\nCarp. Fam. Cyprinidae.\n\nTeri (M. W. & de B. II 46). Stolephorus commersonii.\n\" \" indicus.\n\" \" tri.\n(\"Whitebait\") Herring. Fam. Clupeidae.\n\nTeripang (R. M.). Saurus indicus.\nFam. Scopelidae.\n\nTerubok (M. W. & de B. II 66). Clupea (Alosa) macrura.\n\" padi \" \" toli.\n\" korin \" \" sp.\nHerring. Fam. Clupeidae.\n\nTilan. Also telan (Dun.). Mastacembelus unicolor.\n\" \" maculatus.\n(Dun. D.) \" armatus.\nSpiny-Eels. Fam. Mastacembelidae.\nTilan pasir (D. R.). *Trypauchen vagina.*\nGoby. Fam. GOBIIDAE.\n\nTimah-timah. See also Selayur and Langgai.\n(Dun.). *Trichiurus savala.*\n\" haumela.\n\"Barracouta.\" Fam. TRICHIURIDAE.\n\nTimun-timun also Mentimun (R. M.). *Lutianus lineolatus.*\n\" decussatus.\n\" vitta.\nSnapper. Sub-fam. LUTIANINAE.\n\nTiram. *Engraulis* sp.\nHerring. Fam. CLupeidae.\n\nTodak, also Chenchodak (Dun.). *Belone cancila.*\n\"Dun. C. R.). \" strongylurus.\n\"Dun. D.). \" choram.\n\"C.). \" annulata.\n\" pendek (Penang) (Blkr.). *Hemirhamphus georgii.*\n\" (Malacca) \" far.\nGar-fish. Fam. SCOMBRESOCIDAE.\n\nToka-toka also Setoka. A small Ray.\n\nTokak (Blkr. Toka). *Cossyphus diana.*\n\" Chaerops omnopterus.\nParrot-fish. Fam. LABRIDAE.\n\nToman (R.). *Ophiocephalus striatus.*\n\"Murrel.\" Fam. OPHIOCEPHALIDAE.\n\nTombol mas (R. M.). *Thynnus thunnina.*\nThe Tunny. See Kembal mas.\nMackerel. Fam. SCOMBRIDAE.\n\nTombong damar (Wilk. 181). A fish (unid.)\nSee Puntong damar.\n\nTongkol. *Thynnus thunnina.*\nSmall sized fish are called Choreng, medium sized specimens Sembak, large ones Tongkol and exceptionally large ones Kembal mas or Tombol mas.\nThe Tunny or Tuna.\nMackerel. Fam. SCOMBRIDAE.\n\nTudong periok also Tudong tempayan.\n(Blkr. Tudjong-prio). *Platax batavianus.*\n\" vespertilio.\nCoral-fish. Fam. CHAETODONTIDAE.\nTuli. Literally deaf. See Sēlangat tuli.\n\nTumbok banir. *Histiophorus* sp.\nSail-fish. Fam. HISTIOPHORIDAE.\n\nTumbok tēbing (Dun. Tumbok ka tubing). Neg. Semb.\n*Luciocephalus pulcher.*\nFam. OSPHIROMENIDAE.\n\nTunjang langit. *Triacanthus oxycephalus.*\n\"Leather-jackets.\" Fam. BALISTIDAE.\n\nUbi (C.). *Sillago sihama.*\n\"Whiting.\" Fam. SILLAGINIDAE.\n\nUdip. Petit ikan parang (Favre). See Sudip.\n\nUmbut-umbut (S. Mombu). *Dangila lineata.*\n\"(M. W. & de B. III 116 Umbu-umbu). D. cuvieri.\"\n*Barynotus microlepis.*\nCarp. Fam. CYPRINIDAE.\n\nUndok-undok. *Hippocampus* sp.\nThe Sea-Horse.\nFam. SYNGNATHIDAE.\n\nUngar (Wilk. 57). *Lutianus argentimaculatus.*\n\"johnii.\"\nSnapper. Sub-fam. LUTIANINAE.\n\nUnsat or usat. *Plotosus* sp.\nCat-fish. Fam. SILURIDAE.\n\nYu (R. M.). *Carcharias dussumieri.*\n\"tenggiri. *Galeocerdo rayneri.*\nSharks. Fam. CARCHARIIDAE.\n\nYu bēngkong (D.). *Sphyrna (Zygaena) malleus.*\n\"(D.). \" \" blochii.\"\nHammer-head Sharks. Fam. SPHYRNIDAE.\n\nYu pendek (D.). *Scyllium marmoratum.*\n\"chechak (D. Chikak). *Stegostoma tigrinum.*\n\"tokek (C. Tokay). \" \"\n\"tokek (C. Tokay). *Chiloscyllium indicum.*\n\"bēlangkas (D.). \" \"\nDog-fishes. Fam. SCYLLIDAE.\n\n\"parang (Dun.). *Pristis cuspidatus.*\n\"gergaji \" \" \"\n\"todak (D.). \" \"\nSaw-fishes. Fam. PRISTIDAE.\n\n\"kia-kia (D.). *Rhynchobatus djeddensis.*\n\"(D.). *Rhinobatus thonini.*\nBeaked-Rays. Fam. RHINOBATIDAE.\nFamilies of Malayan Fishes.\n\nPART III.\n\nELOPSIDAE (GIANT-HERRINGS).\n\nElops hawaiensis Regan. Bundang, Menangin.\nMegalops cyprinoides Brouss. Bulan-bulan.\n\nNOTOPTERIDAE (FEATHER-BACKS).\n\nNotopterus notopterus Pall. Belida.\n,, chitala H. B. \"\n\nCHANIDAE (THE MILK-FISH).\n\nChanos chanos Forsk. Bandang, Jangas.\n\nCLUPEIDAE (HERRINGS, SHADS, ETC.).\n\nChirocentrus dorab Forsk. Porang-parang.\nSpratelloides delicatulus Benn. Anak tamban jeboh.\n,, gracilis Schleg. \"\nDussumieria acuta C. V. Tamban bulat, T. jeboh.\n,, hasseltii Blkr. Tamban jeboh.\nDorosoma nasus Bl. Selungat belau, Nandong, Kebasi.\n,, chacunda H. B. Selungat, Kebasi, Nandong, Pias.\nSetipinna breviceps Cant. Biang-biang.\n,, taty C. V. \"\nLycothrissa crocodilus Blkr. Mempurong.\nEngraulis baelama Forsk. Kasi-kasi.\n,, grayi Blkr. Bangkok.\n,, mystax Bl. Schn. Bulu ayam.\n,, setirostris Brouss. Bangkok.\n,, spp. Tiram, Mempinis, Jembedi.\nStolephorus commersonii Lac. Bilis, Teri.\n,, indicus v. H. Bunga ayer, Teri.\n,, tri Blkr. Teri, Bilis.\nCoilia dussumieri C. V. Bulu ayam.\n,, quadrifilis Gunth. \"\nClupeoides lile C. V. Tamban, T. chinchang re bong.\nClupea (Amblygaster) clupeoides Blkr.\n\n,, (Amblygaster) leiogaster C. V.\n\nClupea (Alosa) toli C. V.\n\n,, macrura Blkr.\n\n,, kanagurta Blkr.\n\n,, spp.\n\n,, (Harengula) fimbriata C. V.\n\n,, moluccensis Blkr.\n\n,, perforata Cant.\n\nPellona amblyuropterus Blkr.\n\n,, elongata Benn.\n\n,, dussumieri C. V.\n\nOpisthopterus tartoor C. V.\n\nRaconda russelliana Gray.\n\nSCOPELIDAE (QUEENSLAND-SMELT, ETC.).\n\nSaurida tumbil Bl.\n\nSaurus myops Bl. Schm.\n\n,, indicus Day.\n\nHarpodon nehereus H. B.\n\nCYPRINODONTIDAE (\"MILLIONS\").\n\nHaplochilus panchax.\n\nMata lalat.\n\nSILURIDAE (CAT-FISH).\n\nClarias melanoderma Blkr.\n\n,, nieuhoi C. V.\n\n,, batrachus L.\n\n,, teysmanni Blkr.\n\nSilurichthys phaiosoma Blkr.\n\nWallago sp.\n\nBelodontichthys dinema Blkr.\n\nCallichrous pabda H. B.\n\nCryopterus cryptopterus Blkr.\n\n,, micropus Blkr.\n\nParaplotosus albilabris C. V.\n\nPlotosus sp.\n\n,, canius II. B.\n\n,, anguillaris Bl.\n\n1. Duncker and Rowell give C. magur H. B. for Kéli, which is now regarded by Max Weber and de Beaufort as a synonym of C. batrachus.\nLais hexanema Blkr.\n\nPangasius spp.\n\" pangasius H. B.\n\" polyuranodon Blkr.\n\nArius thalassinus Rüpp.\n\" sagor H. B.\n\" leiotetocephalus Blkr.\n\" macronotacanthus Blkr.\n\" utik Blkr.\n\" maculatus Thunb.\n\" spp.\n\nHemipimelodus borneensis Blkr.\n\nMacrones nigriceps C. V.\n\" nemurus C. V.\n\" planiceps C. V.\n\" gulio H. B.\n\" bleekeri.\n\nBagarius sp. ?\n\nCOBITIDAE AND CYPRINIDAE (LOACHES AND CARPS).\n\nCOBITIDAE (LOACHES).\n\nAcanthopsis choirorhynchos Blkr. Pasir.\nBotia hymenophysa. Lali.\n\nCYPRINIDAE (CARPS).\n\nChela oxygaster C. V.\n\" sp.\n\nRasbora argyrotaenia Blkr.\n\" trilineata Steind.\n\" lateristriata var. sumatrana Blkr.\n\" einthoveni Blkr.\n\" vulgaris Duncker.\n\nLuciosoma setigerum C. V.\n\nAmblyrhynchichthys truncatus Blkr.\n\nMystacoleucus marginatus C. V.\n\nDangila cuvieri C. V.\n\" burmanica Day.\n\" lincata Sauv.\n\nBarynotus microlepis Blkr.\n\nThynnichthys sandkhol Sykes.\nOsteochilus kelabau Popta.  \nKēlabau.\n\n„ hasselti C. V.  \nTērbul.\n\nHampala macrolepidota C. V.  \nSēbarau.\n\nLabeobarbus tambra C. V.  \nTambēra also Tēmbēra, Garing, Sēngaring.\n\nCyclocheilichthys apogon C. V.  \nRēbēras, Tēmpēras, Chēmpēras, Puteh, Tēmpua, Tēmoleh.\n\nPuntius schwanefeldi Blkr.  \nLampam, Kēpiat.\n\n„ binotatus C. V.  \nPuteh, Kērai.\n\nBarbichthys laevis C. V.  \nRēntulu.\n\nLabeo caeruleus Day.  \nRong.\n\n„ boggut Sykes.  \nPasir.\n\nEpalzeorhynchus kallopterus Blkr.  \nSēlimang.\n\nCrossochilus oblongus C. V.  \nLalang.\n\nBarbus burmanicus Day.  \nTēmēngalan.\n\n„ jerdoni.  \nLampam.\n\n„ hexastichus McLell.  \nSēbarau.\n\n„ neilli Day.  \nKērai.\n\n„ kolus Blkr.  \nKēlah.\n\n„ stracheyi Day.  \nDaun.\n\n„ oatesii Blgr.  \nSēluang, Nyua-nyua.\n\nBarilius guttatus Day.  \nDarok-darok, Puchok pisang.\n\n(Unidentified).  \nKērai jēlawat, K. kunyet.\n\nANGUILLIDAE, CONGRIDAE, OPHICHTHYIDAE, ETC.  \n(EELS, CONGER-EELS, ETC.).\n\nMuraenesox cinereus Forsk.  \nMalong.\n\n„ talabon Cant.  \n”\n\n„ talabonoides Blkr.  \n”\n\nPisoodonophis cancrivorus Rich.  \nBēlin.\n\nMuraena (gymnothorax) undula Lac.  \nLaki sēmbilang, Sirat-sirat.\n\n(Unidentified).  \nBēlidang.\n\nSYMBRANCHIDAE (SWAMP-EELS).\n\nMonopterus albus Zuiew.  \nBēlut.\n\nMacrotema caligans Cant.  \nBalut.\nSYNGNATHIDAE, AMPHISILIDAE (SEA-HORSES AND SKELETON-FISHES).\n\nHippocampus guttulatus Cuv. Kuda-kuda.\n„ hystrix K. P. Kuda laut.\nAmphisile scutata L. Kereng.\n\nSCOMBRESOCIDAE (GAR-PIKES, GAR-FISHES AND FLYING-FISHES).\n\nBelone cancila H. B. Todak.\n„ strongylurus v. H. „\n„ choram Forsk. „\n„ annulata C. V. „\n\nHemirhamphus limbatus C. V. Puput.\n„ far Forsk. Todak pendek. Puput banga.\n„ cantoris Blkr. Jolong-jolong, Jenjolong.\n„ buffonis C. V. „\n„ pogonognathus Blkr. „\n„ fluviatilis Blkr. „\n„ georgii C. V. Todak pendek.\n\nExocoetus oligolepis Blkr. Belalang.\n„ neglectus Blkr. „\n„ nigripinnis C. V. „\n„ speculiger Val. „\n\nATHERINIDAE (SAND-SMELTS).\n\nAtherina forskali. Rennyau, Paku.\n„ temminckii. „\n\nMUGILIDAE (GREY MULLETS).\n\nMugil planiceps C. V. Belanak, Jempul.\n„ speigleri Blkr. „\n„ vaigiensis Q. G. „ B. tamok.\n„ cunnesius C. V. „\n„ bleekeri ? Belanak rapang.\n„ oeuf Forsk. „ tamok.\n„ borneensis Blkr. „ anding.\n„ spp. „ angin, B. puteh, B. keladera, Puting damar, Puntong damar, Tompong damar, B. bakau, Pelong.\nPOLYNEMIDAE (THREADFINS).\nPolynemus indicus Shaw. Kurau, K. janggut, Kubal.\n\" sextarius Bl. Schn. Kurau, K. pipit, Lau.\n\" tetradactylus Shaw. Kurau janggut, Sénangin, Sénohong, Kubal.\n\" paradiseus Bl. Kurau.\n\nSPHYRAENIDAE (BARRACUDAS).\nSphyraena novae-hollandiae Té nok, Alu-alu, Kachang-kachang.\n\" obtusata C. V. \"\n\" jello C. V. \"\n\" commersonii C. V. \"\n\nSTROMATEIDAE (POMFRETS).\nStromateus atous C. V. Bawal chérmin.\n\" cinereus Bl. Rawal puteh, Bawal itam, Bawal kédewas.\n\" niger Bl. Bawal tambak.\n\nOPHIOCEPHALIDAE (MURREL).\nOphiocephalus gachua H. B. Aruan, Bérchat.\n\" lucius C. V. \"\n\" striatus Blkr. \", Toman.\n\" spp. Gabus, Bujok.\n\nBERYCIDAE (NANNYGAI).\nMyripristis murdjan Forsk. Sébékah karang, Logu.\n\nMONOCENTRIDAE (KNIGHT-FISHES).\nMonocentris japonicus Bl. Schn. Sé tonggang.\n\nPEMPHERIDAE (BULL'S-EYES).\nPempheris mangula C. V. Sépat karang.\n\" spp. \"\n\nKYPHOSIDAE (DRUMMERS).\nKyphosus cinerascens Forsk. Tilan rumput.\n\" sp. Béras-béras.\n\nLOBOTIDAE (DUSKY-PERCH).\nLobotes surinamensis Bl. Pchah périok, Sé pat karang.\n\nTOXOTIDAE (BLOW-PIPE FISHES).\nToxotes jaculator Pall. Sumpit-sumpit.\n\" chatareus H. B. \"\nNANDIDAE (FRESH-WATER PERCHES).\nCatopra fasciata Blkr. Kēpau, Petong, Patong.\n\nSERRANIDAE (SEA PERCHES).\nSerraninae.\nCentrogenys vaigiensis Q. G. Kerong-kerong, also Meng-kerong, Sēmaram.\nCromileptes altivelis C. V. Kērapu, Kērapu sonoh.\nPlectropoma maculatum C. V. Kērapu, Sēnderong.\nEpinephelus tauvina Forsk. Kērapu, K. lilin, K. kayu.\n\" lanceolatus Bl. Kērapu.\n\" fasciatus Forsk. Sēnderong.\n\" boelang C. V. \"\n\" miniatus Forsk. kārang.\n\" pantherinus Blkr. Kērētang, Kērapu lumpur.\n\" corallicola Blkr. Kērapu.\n\" merra Bl. \"\n\" fuscoguttatus Forsk. \"\n\" hoevenii Blkr. \"\n\" salmoides Lac. lilin.\n\nPriacanthinae.\nPriacanthus tayenus Rich. Tēmēnggong.\n\" hamrur C. V. Barau-barau laut.\n\nCentropominae.\nLates calcarifer Bl. Siakap, also Kakap.\nPsammoperca vaigiensis C. V. Gēlam.\n\nAmbassinae.\nAmbassis commersonii C. V. Petek-petek.\n\" ranga H. B. Sia-sia.\n\" gymnocephalus Lac.\n\nChilodipterinae.\nApogon frenatus Blkr. Sēmangka.\n\" spp. Sēbēkah.\n\nLutianinae (Snappers).\nLutianus roseus Day. Ikan merah, Jēnēhak.\n\" argentimaculatus Forsk. Ungar, Sēndarat.\n\" lineolatus Rüpp. Timun-timun, also Mēntimun.\n\" johnii Bl. Ungar, Jēnēhak.\n\" sebae C. V. Jēnēhak.\n\" fulvilamma Forsk. \"\n\" lioglossus Blkr. \"\nLutianus erythropterus Bl.\n\" madras C. V.\n\" sillao Russell.\n\" bohar Forsk.\n\" decussatus C. V.\n\" vitta Q. G.\n\" spp.\n\nKuning-kuning.\nRumbong-rumbong.\nTanda-tanda.\nTimun-timun, Mentimun.\nBambangan, Mambang or Bambang, Merawan, Berkil, Senggarat.\nKerong-kerong, also Mengkerong and Tengkerong.\nKerong-kerong.\n\nTherapon theraps C. V.\n\" jarbua Forsk.\n\" puta C. V.\n\" quadrilineatus Bl.\n\nDiploprion bifasciatum K. V. H.\nMesopriion sp.\n\nSia-sia.\nGerut-gerut.\n\nSILLAGINIDAE (\"WHITINGS\").\n\nSillago sihama Forsk.\n\" maculatus Q. G.\n\nUbi, Bulus-bulus, Bebulus, Kedondong.\nUbi, Bulus-bulus, Bebulus, Kedondong.\n\nSCIAENIDAE (JEW-FISHES).\n\nSciaena diacanthus Lac.\nUcbrina russellii C. V.\nOtolithus maculatus C. V.\n\" argenteus C. V.\n\" ruber Bl. Schn.\n\" spp.\n\nTembereh.\nGelama.\nJarang gigi.\nGelama panjang, Jarang gigi.\nJarang gigi.\nGelama panjang, G. papan, G. China, G. sekang or senqkang, G. rapang, G. batu, G. itam, G. perak, G. batu Keling, G. lanjut, G. kuning dada, G. dahit tinggi, G. cherua, G. pisang.\n\nCollichthys biaurita Cant.\n\nSelampai, Jarang gigi.\n\nGERRIDAE (\"SILVER-BREAM\").\n\nGerres filamentosus C. V.\n\" abbrevlatus Blkr.\n\" altispinnis ?\n\" oblongus C. V.\n\nKapas-kapas.\nSedakang.\nTampok-tampok.\nEquula edentula Bl.  \nGazza minuta Bl.\n\nLACTARIIDAE (SELEMAH).\nLactarius delicatulus C. V.\n\nPRISTIPOMATIDAE (GRUNTERS).\nPristipoma maculatum Bl.  \nhasta Bl.  \noperculare Playfair.  \nguoraca C. V.\n\nDiagramma crassipinum Rüpp.  \npictum Thunb.  \ncinctum Tem. Schleg.  \npunctatum Blkr.  \nspp.\n\nPentapus caninus Blkr.  \nsp.\n\nSPARIDAE (SEA-BREAMS).\nScolopsis ghanam Forsk.  \ncancellatus C. V.  \nciliatus Lac.  \nvosmeri Bl.  \nbimaculatus C. V.  \nmonogramma K. V. H.  \npersonatus C. V.  \nbilineatus Bl.  \ntorquatus C. V.(1)\n\nSynagris notatus Day.  \njaponicus Günth.  \ntaeniopterus C. V.  \ntolu C. V.  \nnematopus Blkr.\n\nCaesio kuning Bl.  \nlunaris Ehr.  \npinjalu Blkr.  \nchrysozona K. V. H.\n\nKekek gēdabang, Sēriding.  \nlabu.\n\nSēlēmah.\n\nGērut-gērut, Chēlek mata.  \nAmpas tēbu.  \nGērut-gērut.  \nTēbal bibir.  \nBēsikor, Mēsikor, Mandi abu, Kachi.  \nAnjang-anjang.  \nSēlinching.\n\nAnjang-anjang.  \nPasir-pasir.\n\nGērētak lantai.  \nKērisi Bali.  \nPijat-pijat.\n\nKērisi.  \nGērētak lanta.  \naji-aji.\n\nDēlah.\n\nJalu-jalu, Jēnjalu, Ikan merah China, Dēlah.  \nDēlah karang.\n\n1. Day gives S. torquatus = S. vosmeri the former being the young and the latter the adult, but Bleeker regards them as separate species, as do the Malays.\nProteracanthus sarissophorus Cant.\n\nLethrinus nebulosus Forsk.\n\nSparus hasta Bl. Schn.(1)\n\n\" datnia H. B.\n\nMULLIDAE (RED MULLETS).\n\nUpeneus tragula Richardson.\n\n\" luteus Blkr.\n\nMulloidess flavolineatus Lac.\n\nSCORPIDIDAE (BAT-FISHES).\n\nPsettus argenteus L.\n\n\" falciformis Lac.\n\nCHAETODONTIDAE (CORAL-FISHES AND BUTTER FISHES).\n\nEphippus orbis Bl.\n\n\" argus L.\n\nChelmo rostratus L.\n\nHeniochus macrolepidotus L.\n\nHolacanthus sexstriatus C. V.\n\n\" mesoleucus Bl.\n\n\" annularis Bl.\n\n\" spp.\n\nPlatax teira Forsk.\n\n\" batavianus C. V.\n\n\" vespertilio Bl.\n\nChaetodon octofasciatus L.\n\n\" vagabundus L.\n\nDREPANIDAE (MOON-FISH).\n\nDrepane punctata L.\n\nBatu.\n\nAsoh-asoh, Gërëtak lantai.\n\nKapas-kapas, Bëngkong-kong, Bëkukong, Kuku, Bandan.\n\nPinang-pinang, Lardok.\n\nBiji nangka.\n\nLëbäi.\n\nGëdabang.\n\nSënyor.\n\nDaun bäharu.\n\nKetang.\n\nPipit, Sumpit-sumpit.\n\nGombing.\n\nInggu.\n\nKetang.\n\nBabi.\n\nDaun, Bonanq.\n\nTudong përiok.\n\nPinang-pinang.\n\nSumpit-sumpit, Pinang-pinang.\n\nDaun bäharu.\n\n1. According to Day, S. hasta = S. berda.\nTEUTHIDIDAE (\"BLACK TREVALLY\").\n\nTeuthis nebulosa.  \n\"Dengkis.  \n\" virgata C. V.  \n\" Ketang, Dengkis.  \n\" stellata Forsk.  \n\"  \n\" java L.  \n\" Lumban, Ketang, Debam, Lebam.  \n\" concatena C. V.  \n\" Gelibas, Ketang.  \n\" dorsalis C. V.  \n\" Ketang.  \n\" oramin Günth.(1)  \n\" Gelibas, Belibas.  \n\" sp.  \n\" Lambai.\n\nOSPHROMENIDAE (GOURAMI. FIGHTING FISHES, ETC.).\n\nOsphromenus olfax L.  \n\" Kalui.  \n\" malayanus Duncker.  \n\" Biji durian.  \n\" trichopterus Pall.  \n\" Sēpat.\n\nAnabas scandens Dald.  \n\" Puyu-puyu, Pēpuyu, Bēiok.  \nLuciocephalus pulcher Gray.  \n\" Tumbok tēbing.  \nBetta pugnax Cant.  \n\" Ikan bēlaga, Sēmpila, Pēlaga, Pāla.  \n\" bellica Sauv.  \n\" Ikan bēlaga, Sēmpila, Pēlaga, Lampila.  \n\" sup.  \n\" Anak ampit, A. karing, Karing gajah.\n\nPolyacanthus hasselti C. V.  \n\" Kēpar.\n\nPOMACENTRIDAE (CORAL-FISHES).\n\nAmphiprion ephippium Bl.  \n\" Inggu.  \n\" frenatus Brev.  \n\"  \nDascyllus sp.  \n\"  \nPomacentrus albofasciatus Schleg.  \n\"  \nGlyphidodon coelestinus C. V.  \n\" Gombing.  \n\" notatus Day.  \n\" Kēpau laut, Keping.\n\nLABRIDAE (\"WRASSES\" OR PARROT-FISHES).\n\nChaerops omnopterus Rich.  \n\" Tokak.  \n\" oligacanthus Blkr.  \n\" Logu.  \nCossyphus diana Lac.  \n\" Tokak.  \nChilinus fasciatus Bl.  \n\" Bayan, Boyan.  \n\" chlorurus Bl.  \n\" Jampong, Bayan, Boyan.  \nAnampses coeruleopunctatus Rüpp.  \n\" Sēlichin.\n\n---\n\n1. Day suggests that oramin may prove to be synonymous with dorsalis\nPlatyglossus dussumieri C. V.: Bélodok karang.\nNovacula spp. Mandi abu, Mésikor, Kachi.\nJulis lunaris. Réchok.\n\nSCARIDAE (\"PARROT-WRASSES\").\n\nPseudoscarus ghobbam Forsk. Kétarap.\n\" rivulatus C. V. Kalat.\nPseudodax moluccanus C. V. Béchok.\n\nCARANGIDAE (\"HORSE-MACKERELS\").\n\nCaranx rottleri Bl. Chéncharu, Sélikor, Jaru-jaru.\n\" kalla C. V. Sélar, Kémpong.\n\" gallus L. Sagai, Chérmin.\n\" armatus Forsk. Sagai.\n\" kurra C. V. Sélar, Kémpong.\n\" gymnostethoides Blkr. Sélar kuning.\n\" djeddaba Forsk. Sélar batang.\n\" compressus Day. Sélar létup-létup, Daing bélang,\n\" ire C. V. Sélar abu-abu.\n\" boops C. V. Jalu-jalu (?).\n\" oblongus C. V. Sélar létup-létup.\n\" speciosus Forsk. Daing bélang.\n\" spp. Bérkas, Songsong arus, Sélar bulut, S. lepir, Bagat, Mamong, Pélaling, Kédémut, Gérépoh, Démbudok.\n\nMene maculata Bl. Schn. Kekek gédabang, K. Jawa.\n\nTrachynotus ovatus L. Nyior-nyior.\n\" bailloni Lac. Sélar.\n\nChorinemus moadetta C. V. Talang, Séliap.\n\" lysan Forsk. \"\n\" Sti Petri C. V. \"\n\nSCOMBRIDAE (MACKERELS, TUNNIES, ETC.).\n\nScomber microlepidotus Rüpp. Pélata, Kémpong.\nThynnus thunnina C. V. Ikan ayer, Tongkol, Sembak, Choreng, Kembal mas, Tombol mas.\nCybium kuhlii C. V.\n\nCybium commersonii Lac.\n\nCybium lineolatum Cuv.\n\nCybium guttatum Bl. Schn.\n\nTenggiri, Luding, Tohok, Langi.\n\nTRICHIURIDAE (HAIR-TAILS).\n\nTrichiurus savala Cuv.\n\nTrichiurus haumela Forsk.\n\nTimah-timah, Selayur, Langgai, Puchuk.\n\nHISTIOPHORIDAE (SAIL-FISHES).\n\nHistiophorus gladius Brouss.\n\nHistiophorus spp.\n\nSelayer, Layar, Layaran, Tumbok banir, Mersuji.\n\nPLEURONECTIDAE (FLAT FISHES).\n\nPsettodes erumei Bl.\n\nPseudorhombus russelli Gray.\n\nSynaptura achira Duncker.\n\nSynaptura orientalis Bl. Schn.\n\nSynaptura commersoniana Lac.\n\nCynoglossus lida Blkr.\n\nCynoglossus lingua H. B.\n\nCynoglossus elongatus Günth.\n\nCynoglossus hamiltonii Günth.\n\nCynoglossus cantoris Blkr.\n\nPlagusia bilineata Bl.\n\nLidah, Sabelah.\n\nGOBIIDAE (\"GOBIES\").\n\nEleotris butis H. B.\n\nGobius giuris H. B.\n\nGobius sadanundio H. B.\n\nGobius sp. aff. caninus C. V. (?).\n\nGobius viridipunctatus ?\n\nPeriophthalmus schlosseri Pall.\n\nPeriophthalmus koelreuteri Pall.\n\nTrypauchen vagina Bl.\n\nApocryptes lanceolatus Bl. Schn.\n\nBoleophthalmus boddaerti Pall.\n\nBelontok.\n\nBelodok.\n\nKerapu.\n\nLobang.\n\nBelontok.\n\nTembakul, Lisah, Belodok.\n\nBelachak.\n\nTilan pasir.\n\nBelodok.\n\nECHENEIDIDAE (SUCKING-FISHES).\n\nEcheneis naucrates.\n\nGemi, Gedemi, Rumi-rumi.\nSCORPAENIDAE (GOBLIN-FISHES).\nScorpaena polyprion Blkr. Lēpu, Dēpu, Gēdēmpu.\nPterois antennata Blkr. ” ” ”\nPelop didactyllum Pall. ” ” ”\nCentropogon indicus Day. ” sēmaram.\nSynancia verrucosa Bl. Sehn. Sēmaram karang.\nSynancidium horridum L. Lēpu.\n(Unidentified), L. bēranyut, L. landak.\n\nPLATYCEPHALIDAE (FLAT-HEADS).\nPlatycephalus punctatus C. V. Baji-baji.\n” tuberculatus C. V. ”\n” macracanthus Blkr. ”\n\nLEPTOSCOPIDAE (STAR-GAZERS).\nPercis pulchella Tem. Schleg. Pukul gēndang.\n\nBATRACHIDAE (FROG-FISHES).\nBatrachus grunniens L. Kērtakok.\n\nMASTACEMBELIDAE (SPINY-EELS).\nMastacembelus unicolor C. V. Tilan or Telan.\n” maculatus C. V. ” ”\n” armatus Lac. ” ”\n\nANTENNARIIDAE (ANGLER-FISHES).\nAntennarius cantori Blkr. Lēpu, Dēpu, Gēdēmpu.\n” caudimaculatus Günth. ” ” ”\n” coccineus Günth. ” ” ”\n” hispidus Bl. Sehn. ” , Kēlalawar.\n\nMALTHIDAE (CROAKERS).\nHalieutaea stellata Wahl. Tēkōk.\n\nTRIACANTHIDAE (LEATHER-JACKETS).\nTriacanthus strigilifer Cant. Barat-barat.\n” blochii Blkr. ”\n” brevirostris Schleg. ”\n” oxycephalus Blkr. ” , Tunjang langit.\n” nieuhoefi Blkr. ”\n” spp. ” Lēmbu.\nBALISTIDAE (LEATHER-JACKETS).\n\nBalistes stellatus Lac. Jëbong, Ayam.\n\nMonacanthus hajam Blkr. Ayam.\n\n„ sinensis L. Barat-barat.\n\n„ choerocephalus Blkr. Kërosok, Ayam.\n\n„ penicilligerus Cuv. Barat-barat.\n\n„ monoceros L. Kërosok padi.\n\nAnacanthus barbatus Gray. Sëligi.\n\nOSTRACIONTIDAE (BOX-FISHES).\n\nOstracion nasus Bl. Buntal kotak, B. batu.\n\n„ cubicus L. „ „ „\n\n„ cornutus L. „ „ „\n\nTETRODONTIDAE (GLOBE-FISHES).\n\nTetrodon lunaris Bl. Schn. Buntal pisang.\n\n„ reticularis Bl. Schn. „ duri.\n\nDIODONTIDAE (PORCUPINE-FISHES).\n\nDiodon novemmaculatus Blkr. Buntal landak.\n\n„ hystrix L. „ „\n\nSCYLLIIDAE (DOG FISHES).\n\nScyllium marmoratum Benn. Yu pendek.\n\nStegostoma tigrinum L. Yu chëchak, Yu tokek.\n\nChiloscyllium indicum L. Yu tokek, Yu bëlangkas.\n\nCARCHARIIDAE (SHARKS).\n\nCarcharias dussumieri Val. Yu.\n\nGaleocerdo rayneri Mel. B. Yu tënggiri.\n\n(Unidentified). Yu jërong, Yu sambaran, Yu punai, Yu laras, Yu chëmangi, Yu bodoh.\n\nSPHYRNIDAE (HAMMER-HEAD SHARKS).\n\nSphyrna (Zygaena) malleus Risso. Yu bëngkong, Y. palang, Y. sanggul.\n\n„ (Zygaena) blochii Cuv. Yu bëngkong, Y. palang, Y. sanggul.\nPRISTIDAE (TRUE SAW-FISHES).\nPristis cuspidatus Lath. Bëroi. Yu parang, Yu gërgaji. Yu todak.\n\nRHINOBATIDAE (BEAKED RAYS).\nRhinobatus thonini Lac. Yu kic-kic. Këmëjan.\nRhynchobatus djeddensis Forsk. ,, ,, ,\n\nTORPEDINIDAE (ELECTRIC RAYS).\nNarcine timlei Bl. Schn. Pari k'bas.\nAstrape dipterygia Bl. Schn. ,, ,, , P. bunga.\nTemera hardwickii Gray. ,, linchin.\n\nTRYGONIDAE (STING-RAYS).\nTrygon uarnak Forsk. Pari këlawar.\n,, sephen Forsk. ,, bindera, P. daun.\n,, walga M. H. ,, lalat.\n,, kuhlii M. H. ,, rimau.\nUrogymnus asperrimus Bl. Schn. ,, d dap.\n\nMYLIOBATIDAE (EAGLE-RAYS).\nMyliobatis vespertilio Blkr. Pari këlanai\n,, nieuhofi Bl. Schn. ,, \"\nAetobatis narinari Euphr. ,, lang.\nRhinoptera adspersa M. H. ,, daun.\nDicerobatis eregoodoo Cant. ,, paus.\nCeratoptera ehrenbergii M. H. ,, paus, P. kola.\n\nUNIDENTIFIED (RAYS).\nSai, Mengkai, Sëtoka.\nAuthors Consulted.\n\nBleeker, Dr. P. Atlas Ichthyologique des Indes Orientales Néerlandaises. 9 Vols: 1862—1878.\n\nBoulenger, Dr. G. A. Fishes (Teleostei).\nBridge, Dr. T. W. Fishes.\nCambridge Nat: Hist: Vol. VII. 1904.\n\nCantor, Dr. T. Catalogue of Malayan Fishes. Jour: A. S. Bengal. 1849.\n\nClifford, H. and Swettenham, F. A. Dictionary of the Malay language. Parts I-V. 1894—1902.\n\nDay, Dr. Francis. Fauna of British India. Fishes. 2 Vols: 1889.\n\nDuncker, Georg. Die Fische der Malayischen Halbinsel. 1904.\n\nGunther, Dr. Albert. Study of Fishes. 1880.\n\nMeek, Dr. The Migrations of Fish. 1916.\n\nRoughley, T. C. Fishes of Australia and their Technology. 1916.\n\nSeale, Alvin. Fishery resources of the Phillipines. (Philippine Jour: Science. 1908).\n\nStead, David A. Fishes of Australia. 1906.\n\nStead, David A. Edible Fishes of New South Wales. 1908.\n\nStead, David A. A brief review of the Fisheries of New South Wales. 1910.\n\nTenison-Woods, Revd. J. E. Fish and Fisheries of New South Wales. 1882.\n\nWeber and de Beaufort, Drs. The Fishes of the Indo-Australian Archipelago. 3 Vols: 1911—1913.\n\nWilkinson, R. J. Malay-English Dictionary. 2 Vols: 1901.\n## Index to English Names\n\n### A.\n\n- **Anchovy** ... 194, 236.\n- **Angler-Fishes** ... 225, 275.\n\n### B.\n\n- **Barracouta** ... 247, 252, 260.\n- **Barracuda** ... 203, 267.\n- **Barramundi** ... 208.\n- **Bar-tailed Goat-Fish** ... 212.\n- **Batfish, Dark** ... 214.\n- **Batfish, Silvery** ... 213, 238.\n- **Bat-Fishes** ... 213, 271.\n- **Beaked-Ray** ... 228, 277.\n- **Big-eyed Herring** ... 191.\n- **Black-spotted Rock-Cod** ... 208.\n- **Black Trevally** ... 214, 272.\n- **Blow-pipe Fishes** ... 207, 269.\n- **Blue-spotted Groper** ... 218.\n- **Bombay Duck** ... 195, 218.\n- **Bony Bream** ... 194.\n- **Box-Fishes** ... 226, 276.\n- **Bream, Sea** ... 211, 270.\n- **Bream, Silver** ... 210, 269.\n- **Brown-spotted Hind** ... 208.\n- **Bull’s-Eyes** ... 206, 267.\n- **Butter-Fish** ... 213, 271.\n\n### C.\n\n- **Carp** ... 186, 196, 264.\n- **Catla** ... 198.\n- **Cat-fish** ... 195, 263.\n- **Climbing Perch** ... 216, 236, 253.\n- **Conger-Eels** ... 198, 265.\n- **Coral-Fishes** ... 213, 217, 271, 272.\n- **Croakers** ... 225, 275.\n\n### D.\n\n- **Dart** ... 219, 250.\n- **Devil-fishes** ... 229.\n- **Diamond-scaled Mullet** ... 202.\n- **Dog-Fishes** ... 226, 276.\n- **Dorab** ... 250.\n- **Drummers** ... 206, 267.\n- **Dusky Perch** ... 206, 267.\n\n### E.\n\n- **Eagle-Rays** ... 229, 277.\n- **Eels** ... 183, 198.\n- **Eels, Conger** ... 198, 265.\n- **Eels, Spiny** ... 215, 275.\n- **Eels, Swamp** ... 198, 265.\n- **Electric Rays** ... 228, 277.\n\n### F.\n\n- **Feather-Backs** ... 191, 262.\n- **Fighting-Fishes** ... 216, 272.\n- **Flat-Fishes** ... 221, 274.\n- **Flat-heads** ... 224, 275.\n- **Flounder** ... 222.\n- **Flying-Fishes** ... 199, 266.\n- **Fresh-water Perches** ... 207, 268.\n- **Frog-Fishes** ... 245, 275.\n\n### G.\n\n- **Garfishes** ... 199, 266.\n- **Gar-Pike** ... 199, 266.\n- **Giant-Herrings** ... 191, 262.\n- **Globe-Fishes** ... 226, 276.\n- **Goat-Fish, Bar-tailed** ... 212.\n- **Gobies** ... 222, 274.\n- **Goblin-Fishes** ... 224, 275.\n- **Gourami** ... 214, 272.\n- **Grey-Mullets** ... 200, 266.\n- **Groper, Queensland** ... 208.\n- **Grunters** ... 211, 270.\n\n### H.\n\n- **Hair-back** ... 194.\n- **Hair-tails** ... 221, 274.\n- **Half-beak** ... 199.\n- **Halibut, Queensland** ... 222.\n- **Hammer-head Sharks** ... 226, 276.\n- **Herrings** ... 193, 262.\n- **Hilsa** ... 193.\n- **Horse-Mackerels** ... 218, 273.\n\n### J.\n\n- **Jew-Fishes** ... 210, 269.\n\n### K.\n\n- **Knight-Fish** ... 206, 267.\n\n### L.\n\n- **Leather-jackets** ... 225, 275, 276.\n- **Loaches** ... 196, 264.\n\n### M.\n\n- **Maenassar Redfish** ... 193.\n- **Mackerel** ... 220, 273.\n- **Mackerel, Horse** ... 218, 273.\n- **Mackerel, Spanish** ... 220.\n- **Mahseer** ... 197.\n- **Milk-Fish** ... 191, 262.\n- **Millions** ... 195, 263.\nADDENDA ET CORRIGENDA.\n\nP. 183: for Tarpin read Tarpon.\n\nP. 235: add Bēras-bēras. *Sparus sarba.*\n\nThe Tarwhine of Australia.\n\nSea-Bream. Fam. SPARIDAE.\n\nP. 271: add *Sparus sarba* Forsk. Bēras-bēras.\n| Plate | Fish Name                  |\n|-------|----------------------------|\n| I.    | BULAN                      |\n| II.   | BĚLIDA                     |\n| III.  | PARANG-PARANG              |\n| IV.   | SĚLANGAT                   |\n| V.    | TĚRUBOK KORIN              |\n| VI.   | TAMBAH PANJANG             |\n| VII.  | TAPAH                      |\n| VIII. | BĚGAHAHAK or LAIS          |\n| IX.   | JAHAN                      |\n| X.    | KĚLAH                      |\n| XI.   | TĚMBĚLIAN                  |\n| XII.  | UMBUT-UMBUT                |\n| XIII. | HWAN or CHOW               |\n| XIV.  | LIAN or LIN                |\n| XV.   | MALONG                     |\n| XVI.  | TODAK                      |\n| XVII. | PUPUT or JOLONG-JOLONG     |\n| XVIII.| BĚLANAK ANDING            |\n| XIX.  | BĚLANAK TAMOK              |\n| XX.   | KURAU                      |\n| XXI.  | ALU-ALU                    |\n| XXII. | BAWAL PUTEH                |\n| XXIII.| ARUAN                      |\n| XXIV. | SĚBĚKAH KARANG            |\n| XXV.  | SUMPIT-SUMPIT              |\n| XXVI. | KERONG-KERONG              |\n| XXVII.| KĚRAPU                     |\n| XXVIII.| SIĄKAP                    |\n| XXIX. | IKAN MERAH                 |\n| XXX.  | BULUS-BULUS                |\n| XXXI. | TĚMBĚREH                   |\n| XXXII.| GĚLAMA TIKUS               |\n| XXXIII.| KAPAS-KAPAS              |\n| XXXIV.| GĚRUT-GĚRUT                |\n| XXXV. | PASIR-PASIR                |\n\n| Fish Name                  |\n|----------------------------|\n| Ox-Eye, or Big-eyed Herring. |\n| Feather-back.               |\n| The Dorab.                  |\n| Hairback, or Gizzard Shad.  |\n| The Hilsa.                  |\n| \"Sardine.\"                  |\n| River Cat-fish.             |\n| River Cat-fish.             |\n| Sea Cat-fish.               |\n| Carp.                       |\n| Carp.                       |\n| Carp.                       |\n| Chinese Carp.               |\n| Chinese Carp.               |\n| Conger-eel.                 |\n| Gar-Pike.                   |\n| Gar-fish.                   |\n| Grey-Mullet.                |\n| Diamond-scaled Mullet.      |\n| Mango fish.                 |\n| Barracuda.                  |\n| Pomfret.                    |\n| Murrel.                     |\n| \"Nannygai.\"                 |\n| Blow-pipe fish.             |\n| Sea-Perch.                  |\n| Sea-Perch.                  |\n| Sea-Perch.                  |\n| Snapper.                    |\n| \"Whiting.\"                  |\n| Jew-fish.                   |\n| Jew-fish.                   |\n| \"Silver-Bream.\"             |\n| Grunter.                    |\n| Sea-Bream.                  |\nLIST OF PLATES.\n\nXXXVI. DÈLÀH Sea-Bream.\nXXXVII. ASOH-ASOH Sea-Bream.\nXXXVIII. PINANG-PINANG Sea-Bream.\nXXXIX. BIJI NANGKA Red mullet.\nXL. GÈDABANG Silver Bat-fish.\nXLI. KETANG Spotted Butter-fish.\nXLII. BABI Coral-fish.\nXLIII. TUDONG PÈRIOK Coral-fish.\nXLIV. DAUN BAHARU Moon-fish.\nXLV. DÈNGKIS \"Black Trevally.\"\nXLVI. DEBAM \"Black Trevally.\"\nXLVII. KALUI Gurami.\nXLVIII. GOMBING Coral-fish.\nXLIX. TOKAK Wrasse.\nL. BÈCHOK Parrot-Wrasse.\nLI. CHÈNCHARU Horse-Mackerel (Hard tail)\nLII. DAING BÈLANG Banded Horse-Mackerel.\nLIII. CHERMIN Silvery Moon-fish.\nLIV. SAGAI Trevally.\nLV. NYIOR-NYIOR Dart.\nLVI. TALANG Queen-Fish.\nLVII. TONGKOL Tunny.\nLVIII. TONGKOL CHOENG Tunny.\nLIX. TÈNGGIRI PAPAN Spotted Spanish Mackerel.\nLX. TÈNGGIRI BATANG Barred Spanish Mackerel.\nLXI. SÈLAYUR Hair tail.\nLXII. SA-BÈLAH \"Halibut.\"\nLXIII. LIDAH \"Sole.\"\nLXIV. BAJI-BAJI Flat-head.\nLXV. BARAT-BARAT Leather-jacket.\nLXVI. JÈBONG Leather-jacket.\nLXVII. YU TOKEK Dog-fish.\nLXVIII. YU PALANG Hammer-head Shark.\nLXIX. YU KÈMÈJAN Beaked-Ray.\nLXX. PARI BÈTING Sting-Ray.\nLXXI. KÈRAPU, KURAU, MERAH, TÈNGGIRI,\nTULANG, PARANG\nLXXII. YU, PARI, MALONG, DURI.\nBULAN\n\nOx-Eye or Big eyed Herring.\n\n(Megalops cyprinoides).\nHairback or Gizzard Shad\n\n(Dorosoma musus)\n\nSēlangat\nPLATE VIII\n\nBEGAHAK or LAIS\n\nRiver Cat-fish.\n\n(Belodonichthys dinema)\nBÉLANAK TAMOK\n\nDiamond-Scaled Mullet.\n\n(Mugil waigensis).\nBlow-pipe fish.\n\n(Toxotes jaculator).\nPLATE XXXVII\n\nASOH-ASOH\n\nSea Bream.\n\n(Lethrinus nebulosus).\nPLATE XL\n\n(Gedabang)\n\nSilver Bat-fish.\n\n(Psetta argentea).\nSpotted Butter-fish.\n\n(Ketang)\n\n(Ephippus argus).\nSilvery Moon-fish.\n\n(Caranx gatrus).\nTENGGIRI PAPAN\n\nSpotted Spanish Mackerel.\n\n(Cybiurn gutatum).\nJébong\n\nLeather-jacket.\n\n(Balistes stellatus).\nPLATE LXVIII\n\nHammer-head Shark.\n\n(Sphyrna (zygaena) sp.).\n\nYU PALANG\nKērapu, Kurau, Merah, Tenggiri,\nTalang, Parang.\n\nPhoto taken at Clyde Terrace Market Singapore\nYU, PARI, MALONG, DURI.\n\nPhoto taken at Clyde Terrace Market Singapore\nList of Malay Works sold by the Straits Branch\nRoyal Asiatic Society.\n\nPrice $2.50 each.\n\nHt. Sri Rama (Cherita Penglipor Lara) (Jawi) Journal 17, 1887.\n\nHt. Raja Donan (Jawi) 18, 1887.\n\nHt. Raja Ambong (Jawi) 19, 1887.\n\nShaer Raja Haji (Rumi) 22, 1890.\n\nHt. Shamsi'l-Bahrain (Jawi) 47, 1906.\n\nHt. Awang Sulong serta Ht. Musang Berjanggut (Rumi) 52, 1909.\n\nHt. Saif al-Yasan (Saif dzul-Yasan) (Rumi) 53, 1911.\n\nHt. Raja-Raja Pasai (Rumi) 68, 1914.\n\nShaer Burong Punggok serta perumpaman Melayu (Rumi) 67, 1914.\n\nHt. Marong Mahawangsa (Sejarah Kedah) serta Sejarah Trengganu dan Kelantan (Rumi) 72, 1916.\n\nHt. Sri Rama, tirsalin daripada naskhab tulisan lebih 300 tahun lama-nya (Jawi) 71, 1915.\n\nHt. Raja Budiman (Jawi) separate publication.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/mobot31753002848262.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 184, "total-input-tokens": 256818, "total-output-tokens": 60867, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 299, 2], [299, 715, 3], [715, 715, 4], [715, 715, 5], [715, 850, 6], [850, 1397, 7], [1397, 3504, 8], [3504, 4766, 9], [4766, 7239, 10], [7239, 9878, 11], [9878, 12678, 12], [12678, 15423, 13], [15423, 18184, 14], [18184, 20889, 15], [20889, 23562, 16], [23562, 26115, 17], [26115, 28768, 18], [28768, 30065, 19], [30065, 31680, 20], [31680, 34107, 21], [34107, 36688, 22], [36688, 38981, 23], [38981, 41072, 24], [41072, 43674, 25], [43674, 46213, 26], [46213, 48540, 27], [48540, 51028, 28], [51028, 53419, 29], [53419, 56247, 30], [56247, 59056, 31], [59056, 61035, 32], [61035, 63320, 33], [63320, 65561, 34], [65561, 67428, 35], [67428, 69555, 36], [69555, 72204, 37], [72204, 74751, 38], [74751, 77036, 39], [77036, 79332, 40], [79332, 81672, 41], [81672, 84003, 42], [84003, 86097, 43], [86097, 88837, 44], [88837, 91336, 45], [91336, 93728, 46], [93728, 96089, 47], [96089, 98693, 48], [98693, 101268, 49], [101268, 103335, 50], [103335, 105919, 51], [105919, 108446, 52], [108446, 110720, 53], [110720, 112813, 54], [112813, 115247, 55], [115247, 117958, 56], [117958, 120327, 57], [120327, 122706, 58], [122706, 124035, 59], [124035, 125294, 60], [125294, 126694, 61], [126694, 127889, 62], [127889, 129084, 63], [129084, 130220, 64], [130220, 131511, 65], [131511, 132787, 66], [132787, 133844, 67], [133844, 134875, 68], [134875, 136060, 69], [136060, 137156, 70], [137156, 138526, 71], [138526, 139647, 72], [139647, 140922, 73], [140922, 142086, 74], [142086, 143135, 75], [143135, 144455, 76], [144455, 145647, 77], [145647, 146800, 78], [146800, 147871, 79], [147871, 149102, 80], [149102, 150286, 81], [150286, 151512, 82], [151512, 152648, 83], [152648, 153919, 84], [153919, 155185, 85], [155185, 156516, 86], [156516, 157740, 87], [157740, 158900, 88], [158900, 160163, 89], [160163, 161510, 90], [161510, 162618, 91], [162618, 163625, 92], [163625, 164481, 93], [164481, 165704, 94], [165704, 166722, 95], [166722, 167835, 96], [167835, 169023, 97], [169023, 170216, 98], [170216, 171425, 99], [171425, 172427, 100], [172427, 173798, 101], [173798, 174946, 102], [174946, 176174, 103], [176174, 177255, 104], [177255, 178347, 105], [178347, 179192, 106], [179192, 180338, 107], [180338, 183031, 108], [183031, 183232, 109], [183232, 185856, 110], [185856, 186981, 111], [186981, 187041, 112], [187041, 187041, 113], [187041, 187041, 114], [187041, 187094, 115], [187094, 187094, 116], [187094, 187094, 117], [187094, 187094, 118], [187094, 187164, 119], [187164, 187164, 120], [187164, 187164, 121], [187164, 187164, 122], [187164, 187164, 123], [187164, 187164, 124], [187164, 187164, 125], [187164, 187164, 126], [187164, 187164, 127], [187164, 187164, 128], [187164, 187164, 129], [187164, 187222, 130], [187222, 187222, 131], [187222, 187222, 132], [187222, 187222, 133], [187222, 187222, 134], [187222, 187222, 135], [187222, 187260, 136], [187260, 187260, 137], [187260, 187260, 138], [187260, 187260, 139], [187260, 187260, 140], [187260, 187260, 141], [187260, 187260, 142], [187260, 187260, 143], [187260, 187260, 144], [187260, 187260, 145], [187260, 187260, 146], [187260, 187260, 147], [187260, 187320, 148], [187320, 187320, 149], [187320, 187320, 150], [187320, 187379, 151], [187379, 187429, 152], [187429, 187429, 153], [187429, 187429, 154], [187429, 187429, 155], [187429, 187429, 156], [187429, 187429, 157], [187429, 187429, 158], [187429, 187429, 159], [187429, 187429, 160], [187429, 187429, 161], [187429, 187429, 162], [187429, 187429, 163], [187429, 187466, 164], [187466, 187466, 165], [187466, 187466, 166], [187466, 187466, 167], [187466, 187466, 168], [187466, 187466, 169], [187466, 187528, 170], [187528, 187528, 171], [187528, 187528, 172], [187528, 187528, 173], [187528, 187528, 174], [187528, 187528, 175], [187528, 187528, 176], [187528, 187575, 177], [187575, 187575, 178], [187575, 187645, 179], [187645, 187645, 180], [187645, 187645, 181], [187645, 187740, 182], [187740, 187811, 183], [187811, 188552, 184]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "None", "None", "en", "en", "en", "None", "None", "en", "None", "None", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false]}}]