[{"id": "7a4db16f8a1f0b1e7c95d4689699e36ac95427ab", "text": "JOURNAL\n\nOF THE\n\nCEYLON BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY,\n\n1879.\n\n\"The design of the Society is to institute and promote enquiries into the History, Religion, Literature, Arts and Social condition of the present and former inhabitants of this Island, with its Geology, Mineralogy, its Climate and Meteorology, its Botany and Zoology.\" — Rules.\n\nPrice to Members, per Number 1 rupee, to Non-Members, 2 rupees. Copies are supplied to Booksellers at Home, at 5s.\n\n* * Communications intended for publication in the Journal must be forwarded to the Secretary at least a fortnight before the assembly of the General Meeting at which they are to be submitted.\n\nAGENTS:\n\nMESSRS. TRUBNER & Co., 57 & 59, LUDGATE HILL, LONDON.\nMESSRS. THACKER, SPINCK & Co., ST. ANDREW'S LIBRARY, CALCUTTA.\n\nW. HENRY HERBERT, GOVERNMENT PRINTER, CEYLON.\n1879.\nCONTENTS.\n\nNotes on ancient Sinhalese Inscriptions ... ... 1\nOn the preparation and mounting of insects for the Binocular Microscope ... ... 46\nNotes on Neophron Puenopterus (Savigny) from Nuwara Eliya 51\nOn the Climate of Dimbula ... ... 54\nNote on the supposed cause of the existence of patanas or grass lands of the mountain zone of Ceylon ... 59\nROYAL ASIATIC SOCIETY,\nCEYLON BRANCH.\n\nPatron.\nHis Excellency Sir Jas. R. Longden, K.C.M.G., Governor.\n\nPresident.\nCol. the Hon. A. B. Fyers, R.E.\n\nVice-President.\nGeo. Wall, Esq., F.R.A.S.\n\nTreasurer.\nAlex. Murray, Esq.\n\nSecretaries.\nRev. T. F. Falkner, M.A., (In Europe).\nH. Drew, Esq.\n\nCommittee.\nE. C. Britton, Esq.\nW. Ferguson, Esq., F.L.S.\nJ. Ferguson, Esq.\nJ.J. Grinlinton, Esq., F.R.G.S.\nJ. Capper, Esq.\nL. De Zoysa, Mudaliyar.\nDr. Kynsey, P.C.M.O.\nAllanson Bailey, Esq. C.C.S.\nH. J. Macvicar, Esq.\nI propose, in the following pages, to give an analysis of all the forms of words contained in the inscriptions (or extracts from such) translated and rendered into English in my last report to the Ceylon Government (September, 1876.) I have not, as a rule, attempted here to deal at any length with phonetical or grammatical laws which occasion required to touch upon, as I hope, ere long, to be able to publish some general results of an historical survey of the Sinhalese language.\n\nI have also omitted the six published lines of the long inscription of Parâkramabâhu I. at Polonnaruwa (Report p. 11, 12), as the whole or at least a considerable portion of it will be printed the next time, for which work I am now specially prepared by the discovery of an interesting manuscript containing a katikârvata or religious ordinance of Parâkramabâhu identical with the first part of our inscription, which has been communicated to me through the courtesy of the learned Mudaliyar L. de Zoysa.\nParumaka Palikadasa bariya parumaka Tirakita jita upaçika Citaya lena çagaça catudiça.\n\n1) Parumaka “a Brahman.” From this and other passages where either a female is called at the same time the daughter of one and the wife of another “parumaka,” or one “parumaka” appears as the son of another “parumaka,” it is evident that this word must be the designation of a caste.\n\nAgain there is another form, though not so frequently employed, barumaka. This latter is easily derived from Samskrṭ brahman “a Brahman,” which would become* baruma in Simhalese, and with the addition of the suffix ka (which in Simhalese is even of more extensive use than in the other vernaculars sprung from Samskrṭ) barumaka. There are not a few instances in Simhalese in which a sonans has been changed into a surd, particularly in the beginning of a word, where, as is well known, this is the rule in the Dravidian languages of the South of India. Simhalese instances are: kurullā “bird,” crude form kurulu (comp. kureli “female bird” in an inscription of the tenth century, see VI. A. 11); derived from garuda†) which probably in some dialects had retained its original signification of a bird in general, garuḍa being an early Prākṛticizing form of garutmat “winged” through* garutta, *garuṭa (cerebralized by the influence of r). Kumbura “field, paddy field” (ancient form kubari, 1–4th century A.D.) from gabbhira, gambhira “deep” in the sense of a low lying, “low land.” Poda “drop” Samskrṭ bindu. i migrating into o by a sort of epenthesis through the influence of u in the following\n\n†) The mythical Garuḍa appears in Elu poetry in the form Gurula.\nsyllable (comp. Hindi bûnda, bumda, Mar. Panj. Giy. id., Sindhi bumdo, bûnda, Beames Comp. Gr. I 135). In the middle of a word we find the same process to have taken place in api “we,” Pâli and Prâkrt : amhe, Oriya ambhe (Beames Compar. Gr. I 262), Gipsy âme (Miklosich II. 24) —topi “ye” for tumhe Oriya tumbhe (Beames ibid), Mâgadhî tuphe (Kern, Over de Faartelling, etc., p. 102, 103), Gipsy tûme (Miklosich ibid)† and sporadic instances in ancient inscriptions, as Mahanaka (= Mahânâga), Alunaka (Mahâvamso : Ilanâgo);‡ Sari Naka (= Siri Nâgo), Nakasena (= Nâgasena), Mekavâna (= Meghavarna), yâku (for Pâli yâgu = Samskrît yavagu), baka (= bhâga, see below IV. 27); again p for Samskrît rv appears in hapanawâ “to bite, chew” Samskrît Vearv, Marâthî cavanem (Beames Comparative Gr. I. 352). In the end of a word, of course, as in other languages this change is frequent.\n\nThis word parumaka, strangely enough, in later times has been assumed as a title by kings. Thus we find : Sarima parumaka maharaji (see III.), (but purumuka said of a therō in the inscription at Tissamahârâmo (see IV.)—Siri\n\n†) In explaining the surds in (api and topi) I have followed Professor Kern. But perhaps it is more correct to ascribe the hardening to the influence of s, sh (thus *tusme —*tuspe—tuphe), comparative in Mahârâshtrî bhappa for bhasman Hemacandra II. 51, bhippa for bhishma ib. 54, sepha for çleshman, ib. 55.\n\n‡) Ilanâgo, though in the Mahâvamso he is called the son of a sister of Amandagâmanî and consequently the grandson of Mahânâgo, was, according to an inscription of his on the top of the Dâgaba of the Nâgamahâvihâro (which I lately copied), the son of Mahânâgo (Mahanaka rajaha pute Alunaka raja). There is internal evidence for the correctness of my identification.\n\nThis is the first instance indeed where I can with certainty convict Mahânâmo of inaccuracy. But there are so many genealogical allusions in inscriptions which cannot be identified that I have sadly lost my faith in the old chronicler.\nSāṅgboy ma purumukā (Inscription VI. and often)—rad purumuvanat,) Dative of the Plural maiestatis, Mayilagastota inscription and elsewhere.)\n\n2.) Palikadasa, Gen. in sa = Samskr̥t sya, Pāli-Prākṛt ssa.\n\n3.) bariya = Samskr̥t bhāryā.\n\n4.) Tirakita = Trirakshita.\n\n5.) Jita “daughter” = Samskr̥t duhitr̥, Pāli dhitā, Bangāli jhi, Oriya jhia (Beams’ Compar. Gr. I. 192), Comp. Pāli gijjho, Sindhī gijha (Beams II., 21) for Samskr̥t gṛdhra.\n\n6.) Citaya Gen. si. fem. = Skt. Citrāyāḥ, Pāli cittāya or citrāya, Prākṛt cittā, cittāi.\n\n7.) Lene “cave,” Pāli lenam (Comp. Childers Dict. II. Add. p. 622). The word is in the magadhic Nominative. A common formula in these cave inscriptions is; ———— lene sagasa dine (i.e., Pāli lenam saṅghassa dinnam) “the cave is given to the priesthood.”\n\n8.) çaagaça = saṅghasya. Genitive for Dative, as in Pāli. (On the formation of the later Sinhalese Dative some remarks will be made later on.)\n\nII.—Inscription near Nettukanda.\n\nParumaka Welu† putana lena agata anagata catudiça çaagaça.\n\n1) Welu.—This name is still very common, though not among the Sinhalese,†† but among the Tamils. The word is a vernacular form of Vishṇu (Comp. Bang. Or. Vishtam,\n\n†) I have written w in Sinhalese words to guide the pronunciation, as ṭ is decidedly more like English w than like v.\n\n††) Velusumano (both parts of the name are common in cave inscriptions); is also the name of a warrior of king Kākavaṇṇa Tissa, who performed the astonishing feat of riding in one day from Auurādha-pura to Mágama (Mahav., Turnour’s Ed., p. 134.)\netc. Beames I. 80, Pāli Vetṭhadipo). We should expect Wēlu (with cerebral l ē), as the name is written indeed in later cave inscriptions; but it is doubtful whether there was a separate letter for the cerebral l ē in the most ancient Sinhalese.\n\n2) Putana Gen. plur. = Skt. putrāṇāṁ. Cerebral n, though, as a rule, retained in Sinhalese, was given up in the Genitive plur. (later used for the Accusative), and mostly in the Verbal nouns in na (thus we find karana[wâ] at least regularly in the tenth century, but see rakaṇa later on III.)\n\n3) Agata anagata = āgata anāgata, I think “those who have come (for the solemnity of the giving over of the cave) and those who have not come” (Comp. Mr. T. W. Rhys Davids’ remarks in the Indian Antiquary, 1872, p. 140.)\n\nInscription on a rock at Habaranē.\n\nSiddham/ Mujita gamana keriyahi ameta Casayaha puta Abayaha ati Walamani wawiya katiwawiyā dakihi galana kana ataḷa wawiya keta awitakita eta eta gama saro atali koṭu me Agicalamana wawiya Mula sara ca Pacacalīwa sara ca do karihi sahasa ca caka catalisa karine (?karihiṇa?) ca Sarima parumaka maharaji me Agimalamana wawiya bojiya pati Sene puta Abalayaha ca mahalaka balataka rakaṇa kanakayaha mānumaraka ca samanaya Hamāra tara ...... kata ka(?) riya dakapatiya kala amanā da ... rakata saga salahī liyawaya bojiya pataya karakulawayai Cetagiri viharahi Abatalahi silacetahi tumaha akāla koṭu kari witara Gapacetehi telo huta mala koṭu ca jina palisatari-kama karaṇā karōṭu Copawaliya Giniya Megaha c[e] tihi Jaganaka hamānanataya parawaṭahī ... ca ... kakoṭu ca bojiya petiya Karakaḷa wawiya dini [hi?] me cetihi wi[hara?] bojiya patiya ri ... karihi sahasi ca wisiti karihi do pata ca ametaha ca Wahabayaha putanāna (or ṭa?) ya duti[ya] ...\npucayasa awanaka wasahi majimodini cada puṇa masi sata paka diwasa [hi].\n\n1) Mujita = Skt. majjita \"inundated.\"\n\n2) Gamara = grāmāṇāṃ, Gen. plural or perhaps more correctly already general Formative of the plural.\n\n3) Keriyahi Loc-si. representing an imaginary form * kāryasmin, i.e., kārya in the pronominal Locative. I have met with no Locative prior to the time of Dushta-grāmanī when this case already terminated in hi; in the time of Devānāṃ priya Tishya the termination probably was still si, corresponding to the Genitive sa (later ha) and the identical terminations in the Māgadhī inscriptions.\n\n4) Ameta = amātya. I have found ametiya†) in other inscriptions of the same period.\n\n5) Casayaha Gen., probably an error for Wasabayaha or Wahabayaha (see below). This inscription is interesting as\n\n†) For instance, in an inscription on the Ruwanwaeli Dāgaba, Anurādhapura:\n\nAmetiya Dolakamatayaha p[uta ma]hasena ma[haraja] ametiya Abayaha, i.e., of Abhaya, son of the minister Dolakamataya (i.e. Dr̥ḍha-māta), minister to king Mahāsena.\" This Abhaya, as I have already pointed out in a former report (Sept. 1875), must be Meghavarna Abhaya, mentioned Mahāv.p. 235 H. This important inscription which might throw some light on the religious quarrels under the reign of Mahāsena is unfortunately very imperfectly preserved. It appears from the end that it was written under the reign of King Meghavarna (Mekawana Aba [ma] harajaha), the son and successor of Mahāsena, according to the Mahāvamsa (320–330 A.D.) To puzzle us however, this King is not called son of Mahāsena, but son of a Maharaja,\" whose name cannot be deciphered with safety, but may be Siri Naka; now in an inscription close to the one in question and written in the same characters we actually find: Sari Naka maharajaha puta [ma]haraja Mekawana ...... It seems we are driven to the conclusion that Mahāsena was also called Cri Nāga.\nshowing the gradual transition of the suffix *ka* into *ya*, there being both forms found here.\n\n6) *Ati lege ati* = Skt.-asti, Pāli and Prākṛt atthi, modern Sinhalese; *aeti* and in composition *yi*.\n\n7) *Walamani*. If the second part of this name is = Skt. manī, it should be written with ṇ (Cer.) also in Sinhalese; but perhaps the whole word is to be explained by Vardhamāna. A tank, called *Vaddhamāna* was constructed by Dhatusena (Mahāv. p. 257), which is possibly ours, but then, I presume, the inscription was purposely written in an antiquated style (comp. Abhivaddhamānavāpi, constructed by King Vasabho, Mahāv. p. 222. I have also met with the name Wadamanaka in an ancient cave inscription.)\n\n8) *Waniya* Skt. and Pāli vāpi, modern Sinhalese wēwa.\n\n9) *Kati* = kshatriya.\n\n10) *Dakihi* “he saw,” an aorist from dak (dakinawā), Prākṛt dekh, modern vernaculars dekh, but Ācoka and Māgadhī dakhāmi (Kern. p. 101) mahārāṣṭri, causative dakhava (Hemac. IV. 32) from Skt Vdr̥ṇ.\n\nThe formation of the Aorist in ancient Sinhalese is very interesting. It was originally a participle combined with *kahī* (= akārohit) “he made,” but in some instances the first part seems to be formed by the simple root (comp. on the formation of the Aorist in the Gipsy dialects Miklosich, Ueber die mundarten etc. der Zigeuner Europa’s II 16.) I must defer the investigation of these grammatical forms until the publication of an article on Sinhalese conjugation; I here only quote a few aorists from ancient inscriptions: *kārikahī* (= kāryam akārohit, the long vowel probably owing to the influence of the learned, as there are also other tatsamas in the same inscription, inscription of\n\n† This form I have found in a cave inscription certainly not subsequent to the first century, B.C.\nGajabâhu, 2nd century A.D., Mihintala, karihi “he made,” dinahi “he gave,” likihi “he wrote,” wijitekahi “he conquered,” bajikahi †) “he gave over, made occupied,” tubahi “he established, put up” (sthâpay.)\n\n11) Galana “flowing down (of the water) should be galana (with dental n) from V gal.\n\n12) Kana “embankment,” the modern Sinhalese kanda “hill embankment,” derived from Skt. skhanna “raised, elevated” V skhand. The form kana is still found in an inscription of the 10th century.\n\n13) Atala = antare. The correct form is atali (a little later on), as this accounts best for the later changes of the word: aetalu and finally aetulu.\n\n14) Keta = kshetra, 15) avitakita = avitarkita.\n\n16) Eta eta (from Skt. etat), modern Sinhalese ê ê.\n\n17) Saro perhaps plural., I have not met elsewhere with nouns terminating in o. The word is derived from Skt. saras. In later inscriptions we find the tank divided into two parts: wawisara—wâsara and wæwæ kana—wâkanda, literally “the lake of the tank” and “the bund of the tank.”\n\n18) Koṭu = Skt. kṛtvā, comp. dramatic Māg. kaḍua (Hemac. IV. 301.)\n\n19) Me, as still mê, Skt. stem ima —\n\n20) Do. This is the suffix of the Ablative (Skt. tas, Prākṛt do), separated from the noun and used like a postposition. Similarly we find later the two syllables lesa of elesa (idrça, Prākṛt erisa) and kelesa kidrça, Prākṛt kērisa) mistaken for a separate word used in connexion with other words with the signification “like”†, even in the instrumental (ablative) form lesin. An analogy even more\n\n†) The late Professor Childers in his Notes on the Sinhalese language II., p. 8, derives this word “se” from chāyā and lesa from Pāli lēsa “stratagem” (ibid. 9).\nstriking is afforded by the use the Simhalese make of the affix se (Skt. çaś — note the true Magadhic e). We have ekse (\"into one, together,\" etym. = ekaças); then it appears in adverbs, as sunase \"happily\" (as it were * sukhaças), dukse (* duhkhaças) (Comp. in Pāli: odhiso, yoniso, hetuso), in wahanse (see later on) etc., but it was also severed from the substantive and used in the sense of \"like, as\" and again an Instrumental (Ablative) seyin was formed.* For the Ablative comp. Padanagalida in next inscription.\n\n21) Karihi \"he made\" see No. 10.\n\n22) Sahasa, etc. † I subjoin here all the numbers found in inscriptions of this period.\n\nA. Cardinals: 2 duna (read duni? doubtful) 3 taraka, tini 4 Catari; catiri, catara, 5 paca, 6 caka, 7 sata, 8 aia, 9 nava, 10 dasa, 12 dolusa, 18 atadasa, 20 wisiti, 40 catalisa, (sic! with l ©) 46 caka catalisa, 50 pañasa, 1000 sahasa, sahasaka, sahasi. B. Ordinals; 2 dutiya, 3 tatiya.\n\n23) The word following the numbers is not very clear on the rock; there seems to be a blank after the first two syllables, but there is some stroke which is probably the sign of e, but might also be taken for i, if we are to suppose a letter to be missing. Perhaps karina simply was meant by the inscriber, and the small line in the blank was a letter that had failed. Karina or karina would be formative of the plural from kari (Pāli karisa, next inscription kiri, modern kiriya), a measure containing four amuna's of land.\n\n* The late Professor Childers in his Notes on the Simhalese language II., p., 8, derives this word \"se\" from chāyā and lēsa from Pāli lēsa \"stratagem\" (ibid. 9.)\n\n† By an inadvertence I have unfortunately given the figures wrongly in the translation subjoined in my report; it ought to be 1046 kari's (equal to about 10,460 acres.)\n\nNote.—The asterisk before the word denotes a figurative word.—E. M.\n(24) Sarima = Śrîmat (comp. Sarinaka = Crînâga I. 1) and III. 4 *)\n\n25) Parumaka, see I. 1.\n\n26) Maharaji. The original Nominative in e was succeeded by i, as puti, maharaji, but the commonest termination soon became a.\n\n27) Bojiya is either Gerund or past Participle of the causative of V bhuj, i.e., either bhojayitvâ or bhojita. The Gerunds in ya are very generally employed in ancient Sinhalese and their descendants in the modern language are still so (for instance kariya — karaya karay — karâ “having done,” comp. on the formation of the Gerund in Śaurasenî and Māgadhî Vararuci and Hemac. IV.—Māg. kalia Hemac. IV. 301.)\n\n28) Pati. This word must mean “after,” but I do not know its etymology. We find later on in this inscription bojiya pataya, bojiya petiya and dakapatiya. The last form I have met with elsewhere also, and think it must mean “after having seen.”\n\n29) Sene puta Abalayahā Genitive. This, properly speaking, is a compound “Sena son Abalaya,” a construction very common in ancient inscriptions.\n\n30) Mahalaka = Skt. mahalla.\n\n31) Balataka = Pāli balattho “peon, overseer.”\n\n32) Rakāna = rakshaṇa.\n\n33) Mānumaraka “grandson” = munuburâ. The first a should be short. The derivation of this word I have given in my Report, p. 4.\n\n34) Samanaya should be samanaya (Pāli sāmaṇo.)\n\n35) Kariya, see No. 27.\n\n* If this inscription is to be attributed to Dhātusena (see above No. 7), this Sena may be identical with the prince of this name mentioned in the Mahāvamsa in the history of Dhātusena.\n36) *Kala* \"at the time when,\" from Skt. kāla.\n\n37) *Amaṇa* \"measure,\" now amuna, Pāli ammanam.\n\n38) *Saga* = saṅgha.\n\n39) *Salahi* Loc. from sala = Skt. cilā \"stone\" (comp. sila No. 44.) In the next inscription we have salihi (and so always the locative terminating in—ihi.)\n\n40.) *Liyanaya* \"having caused to be written,\" from liyawanawā = likhāpay. On the formation of the Gerund see No. 27.\n\n41) *Cetagiri* = Caityagiri (Mihintala.) The transformations of the word caitya in Sinhalese are the following (taken from inscriptions of different periods): ceta, ceya, sey, sā, sāya—add the present colloquial form sāya.\n\n42.) *Wiharahi* Loc. Other forms of the word vihāra are wihera, wahira, wihira, and the more modern wehera.\n\n43) *Abatalahi* \"at Ambasthala.\"\n\n44) *Silacetahi* Loc., cilā and caitya.\n\n45) *Tumaha* Gen. of tuma (= ātman.)\n\n46) *Akala* = akṛta. (For the genitive with participles see Childers' Notes on the Sinhalese language II., 6.)\n\n47) *Witara* = Skt. vistāra. This word is frequently employed in Sinhalese compounds as koccara (contracted from *kovitara—c by influence of i— = kiṁ vistāra) \"how much,\" ewitara, etc.\n\n48) *Cetehi*. The old form is cetahi (see 44); again we find cetihi. Which was the proper form at that time, cannot be ascertained; probably all three were correct.\n\nThis is a language of transition, in which we find the phonetic changes floating, not yet settled. It will be observed in the next inscription that ihi is the common termination of the locative. This may be taken as a proof that the latter is of a more recent date, but not necessarily so, as the writer may have been more pedantic, besides allowance is to be made for the difference of dialect. The\nThe tendency of the Sinhalese language to assimilate one syllable to the other was labouring at that time, not yet ruling, still the nerves of the Sinhalese were strong enough to bear different vowels in syllables following or preceding each other, it was to later periods that those jingling words, as munuburu \"grandson,\" minibiri \"granddaughter,\" were reserved.\n\n49) Tela huta mala kotu ca. It is meant of course, \"and having made offerings of oil and flowers.\" I do not know what would be more appropriate to suppose the inscriber to say, tela mala huta or tela huta mala huta; at any rate, as it is in the inscription it is wrong.\n\n50) Jina palisatarikama karana karotu. This is a knotty passage, jina is = jirna \"dilapidated,\" but what is palisatarikama, etc.? In King Gajabahu's inscription at Anuradhapura we read: jina palisatara koṭu which I was at first inclined to translate \"having made obeisance to jina (Buddha)\" = Pali: Jina patisamtharam katva; but we cannot then account for the cerebral n in jina. Besides, the same or a similar formula occurs in other inscriptions, for instance at Kumbukwaewa pansala near Wewelkaetiya (North-Central Province) jina palisatariya. In all these instances the invocation of jina would seem to come in so uncalled for, in the midst of other acts of the kings referred to, that it could not be meant. Again if we are to read jina palisakara koṭu and jina palisakariya respectively, all would be right; for this would answer to Pali \"jinna patisamkharam katva, and jinnam patisamkhariya \"having repaired the dilapidated (buildings)\" comp. Mahav. p. 221 avase jinne ca patisamkhari and Childer's Dictionary. I think, we must stick to jina and translate, as if we had palisakara and palisakariya respectively, though the t of palisatara cannot be explained.\n\nPalisatarikama is a verbal noun \"repairing\" (kama == karman), the original form of the later nouns in \"ima and\numa” (as baelîma, baeluma “looking;” in inscriptions of the 10th century; senim, sitim, see below vi.), karaṇā karotu is corrupted for karaṇa koṭu; perhaps this is to be taken already in the sense of “on account of” as karaṇa koṭa or karana-koṭa-gena in later times.\n\n51) Jaganaka for *jaganataka = jagannātha, “Lord of the world,” i.e. Buddha. From this word jaganaka evidently the first part of the modern word Ganinnāse (jagana unnāse),* a Buddhist priest, is derived though curiously enough, it is used rather slightingly at present.\n\n52) Hamāṇanataya, lege hamananataya (Dative plur.) i.e. çramanānām arthāya. The Sinhalese Dative has coalesced from the Genitive combined with ataya (= Skt. arthāya) “for the use of—”; thus we have in Gajabahu’s inscription at Anurādhapura; sagaha ataya dine be given to the priesthood (Pāli sanghassatthāya dinnam, with\n\n---\n\n* Unnāsē, as is well-known, is a contraction from unwahansē. The first part of wahansē, “wahan” means still, when separately used “slippers” (Pāli upāhana), though it is rather a high word. In ancient inscriptions I have seldom met with wahansē, not at all before the 10th century, and there it is only applied as a title of honour to kings. It is well known that “the slippers” always formed part of the insignia of royalty (comp. Rāmāyaṇa II.) In later times this word was applied also to priests and other individuals of respectability; it was shortened to denote the different degrees of respect to which a person was entitled, tamanwahansē, tamunnānsē, tamuṇṇaeḥē, down to the rather humble tamusē. One would at first say for instance: “I approach the slippers of the king” or something to that effect, afterwards the word would be used for royalty, majesty (comp. in Pāli therapādo.) The second part sē still remains unexplained, but this is certainly nothing else but the affix sē (Skt. çaś, see above No. 20), though I cannot determine in what sense exactly it is to be taken here, probably in that of a local accusative. A recollection of the original application of the word, I believe, is to be found in the appellation of Buddha: Budu rajājan wahansē.\ndentals, but athāye in the Māgadhi inscriptions of Aṣoka), next we find sagahaṭaya, sagahaṭaye, later sagahaṭa; the next step would be sag haṭ and in modern times saṅghaṭa. In plural the changes run as follows:—Samaṇanaaṭaya, hamaṇanaṭaya, mahaṇanata, mahaṇunta.\n\n53) Paranaṭahi aorist, “he gave over,” should be pariwaṭahi from parivṛt caus., Pāli with dentals: parivatteti.\n\n54) Pucayasa, I do not understand.\n\n55) Awaṇaka = avarṇaka? I have met with awaṇaka wasa also in an inscription at Anurādhapura.\n\n56) Wasahi Loc. si, from wasa (= varsha.)\n\n57) Majimodini, later maedindina, now maendina, a month (March–April.)\n\n58) Cada puṇa masa sata paka diwasahi = candra pūrṇa māsa saptama paksha diwase. Diwasa was later changed to dawasa.\n\nIV.—Inscription at Tissamaharamo.\n\n(Date about the beginning of the 4th century, A.D.)\n\nSiddham || budadasa mahida mahasena tawaka bāya Abhaya maharaja mi apa cudi purumuka Budadasa tari pali mahanamika Jeṭa Tisa maharaja apayaha pali Toda gamika kiri kiṇiyihi ugu awāmidi nawa sahasaka kiri abatarihi Mahagama raja mahawalirahi tara pali mahanami Padana galida dinika paca sahasaka kiri ca mi Padana galida me warahata (?) pawatara (ri?) na uyuta koṭu sapadinaka catara sahasaka ki (ka?)ri ce me di acanani nawa sahasaka kiriyaha ugu wama (?) . . . carita niyamina rajakolihi bha(?nana mini mewa baka kari (?) di-i ca (?) tara amana be (?) da)? ga?) . . . . baka ca sesika……… tawa na……Padana galihī buka sago hamiyana ca[ta]ra pacayada uwayutu karawani koṭu apa cudi purumukaha dina niyamani me ca salihi liyawaya dinamaha.\n\n1) Tawaka “three” from trayah, comp. Pāli tāvatiṁsa\n33; the form for 3 usually found in this period is *tini* = trini, moderu tuna, tun.\n\n2) *Bāya* \"brother.\" This is a genuine instance of a long vowel in ancient Sinhalese; but this only arose from contraction, the older form being batiya. The word was contracted into *bae*.\n\n3) *Mi.* This particle is simply corroborative, \"the king himself\" or something to that effect. Perhaps the oldest form was *nimi*, if we are to read this in the Kirindē inscriptions (see later on); then we have *ma, mae* and again *ma*.\n\n4) *Apa,* crude form \"our.\"\n\n5) *Cudi.* I have translated \"uncle\" but hesitatingly; it seems best to derive this word from kshudra, whence it may mean \"little father\" (at present kuḍappā), comp. Bangāli khudā \"uncle.\"\n\n6) *Purumuka,* see I 1.\n\n7) *Tari* for *teri* \"a therō.\"\n\n8) *Pali* must mean \"reverend\" or something to that effect. It is possibly derived from pāda \"foot,\" as *therapādo* in Pāli, from the custom of prostration before a respected person has come to mean \"venerable therō\" (see Childer's Dict. and comp. note to III. 51. But it is more likely to be either palita \"grey\" for \"aged\" or pandita \"learned.\"*\n\n*It strikes me that these two words must be originally identical and both connected with pāṇḍu, white, &c. I am aware that the corresponding words in the other Indo-Germanic languages, as Latin palleo, etc., seem to claim an independent origin for palita. But pāṇḍu, as it stands, cannot be the original form. To account for the cerebral, we have to go back to a form *paru,* this would become nasalized *pamru,* pāmru, and naturally be changed into *pāmdru,* pāṇḍu. There is indeed a word pandā \"science,\" but this looks very much as if invented for the explanation of pandita. Again the Pāli form phalita points to an original r, as otherwise the aspirate could not be accounted for.*\nI have met with this interesting word only in this inscription. If pali was a common epithet of a therō, perhaps the expression palibasa originally meant the \"language of the therō's\" and Pāli bhāśā may be only a mistaken retranslation into Pāli. This of course is a mere hypothesis, but I cannot rest satisfied with the usual explanation of the word pāli.*\n\n9) Mahanamika \"reverend\"—mahā and nāman.\n\n10) Jeta, Skt. jyeshta, Pāli jettho.\n\n11) Apayaha, genitive \"of us.\" The terminations of the singular came soon to be employed also in the plural.\n\n12) Kiniyihī \"he bought,\" Aorist from V. krī (see above III 10). This form answers, as it were, to an original * krīṇitam akārshit.\n\n13) Ugu most probably means \"taxes\" here, according to the whole context, though I do not know how to derive the word. I formerly tried to identify it with Pāli āgu = Skt. āgas and translated \"having renounced sin\"; but this would be very curious here and still more so later on where the word occurs again.\n\n14) Anamidi. This form, as it stands in the inscription is either incorrect or a secondary abbreviation. We would expect either awamidihi \"he removed\" or awamidiya \"having removed.\" The verb must be Skt. V. muc (now muda-nawā) with ava, though the whole word both on account of the assimilation and for the change of c to d, certainly has a very modern appearance.\n\n15) Abatariki might be taken for an aorist, but I think, it is a Locative = abhyantare. Nava sahasaka kiri abatariki,\n\n* I am however aware that the use of the word Pāli Mahāv. p. 207: \"Piṭakattaya pālim ca tassa atṭhakatham ca tam mukhāpāthena ānesum pubbe bhikkhū mahāmati\" speaks against the explanation above attempted.\nliterally \"within 9,000 kiriya's,\" i.e., \"as many as 9,000 kiriya's.\"\n\n16) Tara pali mahanami, comp. mahanamika No. 9. There is no case termination, but it evidently was intended for the genitive or dative.\n\n17) Padana galida*. This is a genuine ablative, comp. III. 20. giriya—gariya—gali—gala I have found as the substitutes for Skt. giri in Sinhalese inscriptions. The two former however which appear only in names probably represent a tatsama. Gali, it seems, was the form which the Sinhalese brought over from India, and this may be older than Skt. giri (comp. Zend gairi.)\n\n18) Warahaṭa (?) panatarana (or tarina) I do not understand.\n\n19) Uyuta read uwayuta = upayukta (comp. uwayutu later on.)\n\n20) Sapadinaka, Skt. sampradatta Pàli sampadinna, \"given over,\" used as past tense. The suffix ka seems strange in a form of the verb; it is nevertheless found with participles more than once, for instance, the last words in an inscription at Alutgalvihâra (N.-C. P.) are: Tisa teraha kalahi likitaka \"(this is) written in the time of the therō Tissa\" —a very unsatisfactory way of dating inscriptions indeed!\n\n21) Acanani-niyamini—... mini karawani are verbal nouns (like karana, etc.), but I am not sure whether they are to be construed with koṭu (kṛtvā) or in this form have assumed the functions of a tense or mood independently. Acanani, from a verb acana, I do not understand. Niyamino should be niyamani, for niyamana from Vyam + ni; karawani, as it were, karāpaṇam.\n\n* At present this rock is called Patanangala, about thirty-eight miles from Hambantota. There are also fragments of an ancient inscription.\n22) *Kiriyaha* Genitive, comp. apayaha No. 11.\n\n23) *Carita* Skt. caritra, Pāli caritam, Prākṛt cariam, modern Sinh. sirit.\n\n24) *Raja kolihi*, Loc. kola = Skt. kula.\n\n25) *Bhanana* \"preaching.\" The syllable bha is not clear on the stone; if the word is correctly read, it is a Pāli tatsama.\n\n26) *Mewa*, perhaps me + ewa which I have not found in Sinhalese) or already the modern Plural mēwā.\n\n27) *Baka* probably = bhāga [see I. 1], perhaps a dialectic form for deka \"two.\"\n\n28) *Buka*, also biku, buki, Sinhalese transformations of Pāli bhikkhu.\n\n29) *Hamiyana*, Gen. plur. of hami (later himi–himiyan) = Skt. svāmin.\n\n30) *Catara pacayada unayutu*, etymologically put into Sanskrit* catvāri pratyayata upayukta. The ablative is here used for the instrumental.\n\n31) *Salihi*, comp. III.39. The terminations of the masculine are used for all genders (except in the oldest inscriptions.)\n\n32) *Dinamaha*, \"we have given,\" preterite derived from the participle dina.\n\n---\n\nV.—Inscription on a Rock at Kirinde.\n\nI subjoin a corrected copy of this passage which I have taken subsequently to the publication of my report.\n\n1) Siddham-Aparimita lokehi Budha same nati athāne par[i]maṇḍale be\n\n2) savanyutopete anuṭare sathe¹* maha† saraṇe laki‡ cake Budha nāma§.\n\n3) sayambhu.\n\n* Perhaps sathe. † sic! ‡ perhaps laka. § perhaps nimi.\nI have given an analysis of this passage in my report. It remains here only to add a few words regarding its bearing upon the disputed question of the antiquity of the Pāli language.\n\nI feel bound first of all to state my disagreement with the views expressed by the late Prof. Childers (Dictionary II. Pref. p. IX.), on the importance of the inscription found on one of the Bharhut sculptures discovered by General Cunningham. The inscription is,\n\n*Jetavana Anâdhapediko kotisanthatena ketâ.*\n\nIf we compare this with the dialect in Açoka’s inscription at Girnar on the one side and with the Caurasenî and Mahârâshṭri Prâkṛts on the other hand, I do not see why either the descendant of the first-named dialect or the parents of the two latter could not claim ownership just as well as Pāli. On the contrary, if we supply an often omitted Anusvâra, *Anâdhape[m]diko* would be excellent Prâkṛt, *penda* being the Prâkṛt form of Skt. *pinḍa* and *dh* the regular softening down of *dh* in these dialects. Of course no value need be attached to this, should otherwise the language be apparent, as similar palæographical irregularities are of only too frequent occurrence in ancient inscriptions (comp. Burnell, S. Y. Pal. p. 4). But the two points Mr. Childers insists upon as conclusive are the coincidence with a passage of the Vinayapitaka and the use of a hapax legomenon. If *kotisanthârena* appears to us now a hapax legomenon, it need not have been or certainly was not so originally; besides the inscription has not the same word, but *kotisanthatena*. The similarity of the remaining words is no matter of surprise. *Vkri* is the common verb for “buying,” and if the inscription has *ketâ*, the Vinaya text *kinitvâ*, this seems quite as natural as if two different persons telling such a story in English would both use the\nverb, \"to buy.\" We can only derive from the inscription the very interesting fact that the legend of Anāthapiṇḍika was known in the second century B.C., but no proofs for the antiquity of the Pāli language or the present Buddhist canon.\n\nProf. E. Kuhn in an admirable introduction to his contributions to Pāli Grammar has conclusively shewn that Pāli (in its present form) is not Māgadhī, at the same he has pointed out traces of another dialect still discernible in the most ancient poetical writings of the sacred Pāli literature. Prof. Weber, on the other hand, in his review of Childers' Pāli Dictionary (Journal of the German Oriental Society, 1876, p. 170—183) very justly refers to the obvious influence which Samskr̥t in a secondary way has had on Pāli.*)\n\nAlthough the proofs brought forward by Prof. Kern (\"Over de Jaartelling der Zuidelijke Budhisten, etc.,\" Amsterdam 1873) for the artificiality of Pāli have been thought insufficient, I believe, by the great majority of European Orientalists, nobody can doubt any longer that Pāli, in common with all the dialects we meet with in Indian literature, had lost its vernacular purity, when employed in writings.\n\n* Prof. Weber's remarks are also borne out by a reference to the many poetical words found in Pāli which were certainly not invented independently in Samskr̥t and a vernacular, but introduced from the former into the latter (e.g. ābhākaro, osadhīso, sasanko, and many others.) Another instance is sutti = Skt. çukti, while the vernacular form (also in Prākṛt and Sinhalese) is sippi, derived from Tamil çippi Skt. çukti probably was fabricated, through an artificial etymology, out of a vernacular form sukki which may have occurred in some Drāviḍian dialect. Besides in later Pāli writings (for instance the 2nd part of the Mahāwamsa) the influence of Samskrit style and language is observable on every page.—I may here remark (with regard to Childers' Dict. and Weber's review) that sammiñjeti seems to me derived from Vrj, vrñj.\nI am inclined to look upon the questionable passage in the Kirindē inscription as being pure Māgadhī, the language in which the sacred scriptures were known in Ceylon from the time of Mahindo to Buddhaghosha, who would have introduced from India what now is called Pāli, and corrected the texts he found in Ceylon. In point of fact, the ancient Indian vernaculars resemble each other so closely that he probably had little more to do than to alter the spelling of the words and some grammatical terminations. With regard to the latter, forms like bhikkhave bhante leave no doubt about the original connexion of the Pāli language with a dialect which changed original as, ah into e instead of the common o. How long Buddhaghosha’s sacred language was known in India, we cannot now determine. We are as little able to prove how far it bore itself the character of an independent dialect uninfluenced by foreign sources. I will here only give some additional instances, besides those pointed out by Kern and Kuhn, of words which appear as strangers in the Pāli language as known at present.\n\nKern’s examples as far as I adopt them, are assa (p. 15), atrajo (ibid), gāravo (p. 34), māluto, haliddā, daliddo (p. 14), My forms are pali for pari in palibodho, palipanno, etc., kappeti with the signification “to cut” does not seem indigenous in Pāli, while in Māgadhī (çākārī) we have kappedha “cut ye” (Mṛcchakaṭikā), in Simhalese kapanawā suṇāti, etc., for sunoti also seems to be adopted from Māgadhī (dram. Māg. suṇāmi etc., Mṛcch.) We find in Pāli some obsolete bye-forms framed on different principles from those in common use. Now a language may very well possess different forms developed from one and the same word and used indiscriminately, particularly if this language has been arrested in a transitional stage. But if these forms are rare and just in agreement with the type of another set of languages, suspicion will appear justified. Such forms\nare ātumā (a rare form of attā Childers’ Dict.) Simh. tuma aggini and gini “fire”—Simh. gini (but Açoka’s Mâgadhī agi.)\n\nKato. Açoka’s Mâgadhī kate, dram. M. kaḍe, Simh. kaḷa.\n\nAs Simhalese can be proved with tolerable certainty to have been originally a dialect of Magadha,* these instances may be taken either as additional testimonies for a Magadhic or for a Simhalese influence.\n\nVI.—Inscription of King Siri-sang-boy (Kassapo V.)\n\nAt Mahakalattaēwa (Kulatthavāpi), 10th Century, A.D.\n\nA.\n\nSiri-saṅg-boy ma purmukā pasaloswan ne nawayae pura dasa wak dawas Pāṇḍī rad Dāpulu warae me kāp par ha kureli senim isā nawa turā saengim isā mahale Dāpulā arak samaṇan warae kuḍa salā dal siwim isā kolpatrī saṅga āṭalu wae æp me tuwāk denamo ek sewae wadāleyin Sen mahā.\n\nB.\n\nlāṇan tuman māniyan næmin nam di koṭ karana lad Nāl-aram meheni-warhi tuman tubu wat sirit / hi se dawas-patā mahaweherae mahaboyae diy waḍā wędzi meheṇi wat hæmbu wat satdenak / hat satar pasa wayutu karanu koṭ wadāḷa kæraṇa bimhi ā wū Gitelgamu gamat attāṇi pær-æhær de rawanae ge wadnā koṭ isā de kamtaen no wara.\n\n* I presume the old opinion of a Dravidian origin of the Simhalese will find no longer a supporter after the publication of the second part of the late Mr. Childers’ notes on the Simhalese language—a most admirable paper considering the scantiness of the materials on which the Professor had to base his investigations.\nC.\n\nna koṭ isā maṅg-giya piya-giya no wadnā koṭ isā dunu-\nmandul melat cri rad kol kæmiyan no wadnā koṭ isā wæri-\nyan gam gen geri no gannā koṭ isā gael miwun no wadnā\nkoṭ wadāleyin ā me kāp par ha kureli senim isā me kāp par\nnawa turā saṅgim isā kuḍa salā dal siwim isā kolpattra\nsaṅga ætalu wae æp me tuwāk dena\n\nD.\n\nmo ek sewa awud me Gitelgamu gamat attānī pæræhær\ndenu ladi.\n\n1) Ma see IV. 3.\n\n2) purmukā, see I. 1.\n\n3) Pasaloswan “the 15th,” wan (later wanu, modern\nweni), I believe, is simply the participle wana “becoming\nbeing” (= bhavana) from wenawā Skt. bhū “being 15,\nmaking 15, i.e. “the 15th.”*) The oldest ordinals I have\nmet with are dutiya, tatiya (1st to 4th century A.D.) the\nnext do not occur before the 9th or 10th century, when wan,\nwana had come to be employed.\n\n4) Ne. This word is always used with ordinals to indi-\ncate the king’s reign; in more modern literature it is, by\na mistake evidently, changed to nehi. I cannot make out\nthe real meaning of it, but it must be a separate word.\n\n5) Nanaya Genitive of nanaya. At present this month\n(February, March) is called nawam masa (nava + karman\n+māsa) “new month.” It seems strange that February\nshould be called “the new month,” the Sinhalese year\nbeginning with bak masa (April, May.) But originally the\nHindu year began with January (comp. Wilson’s Works ed.\nDr. Rost, Vol. II., “on the Religious Festivals, etc.”) Now\nin Ceylon the ancient Hindu months, for what reason or at\n\n* A different explanation is given by Childers, Notes II., 4.\nwhat time I do not know, have all gone down one step; thus *wesak masa* is May-June, while the Hindu *Vaiçâkha* is April-May, *aesala masa* is July-August, while *Ashâdha* is June-July, (the other names do not correspond in the two Calendars.) *Nawaya* (February) therefore must have opened the year originally, when the appellation seems quite appropriate.\n\n6) *pura* “the light fortnight of the lunar month” from Skt. *pûrva* is an adjective, “former” *pûrva* was changed to *pera* (comp. *puluve* in Açoka’s *Mâgadhî*, *purava* Šauras, also Sinhalese *sâra*(ma) = sarva.)\n\n*Wak*, older *pak* (comp. *paka* above III.\n\n*Danas*, an uninflected Locative (comp. later on.)\n\n*Pura dasa wak danas* “on the 10th day in the light half”—this is the usual form in which dates are given.\n\n7) *rad* = *râjan*.\n\n8) *Pâṇḍi rad Dâpuḷa waræ* “in the monastery called Dapulu king of Pâṇḍi.” *Wara* is used for “monastery,” particularly in connexion with *meheni* (çramanî)—meheni-wara = Pâli *samaṇi upassayo* “nunnery” In Prâkṛt the same word is commonly employed for “house” (see Weber, Hâla.) It is possibly derived from Vvṛ (see however Bollensen, Vikramorvaçi, who derives it from dvāra.) *Waræ* is locative = warhi.\n\n9) *Kâp* = kalpa.\n\n10) *ha* “and” = ca, *me kâp par ha* in this kalpa and in subsequent ones “uninflected locatives denoting time; comp. *dawas* above No. 6.\n\n11) *kureli*, farther on written *kurelî*, feminine of *kurulu* “bird” (comp. I. 1.)\n\n12) *Senim* is a verbal noun, contracted from *senikama* (see note on *Palisatarikama*, III.), which in modern Sinhalese would become *senîma* or *senuma*. It must be from verb* senanawâ*, but this is not known to me, as little as\nthe meaning of our form. Verbal nouns like senim are the following; saengim, modern haengima \"hiding\" from haengena, and simim. The last is not explained, but I would, though with some hesitation, propose to emendate sitim (ti would be very nearly the same on the stone as ni), which is the verbal noun of sitinawà \"to stand, to be\" (comp. Saurasenî : citthadi, dram. Mâg. ciṭṭadi or ciṣṭadi — ancient Sinhalese, ciṭati = tisṭati.)\n\n13) Isâ used as Preposition or Conjunction, \"for, until,\" The most probable derivation seems to me from an ancient Subjunctive of Vas \"to be.\" There is an old form asati in several inscriptions belonging to the earlier centuries of our era which, if I understand them correctly, is used in exactly the same sense, and from which isâ might easily be derived, saengim isâ then would mean originally; \"there be hiding\" etc. I have found this word isâ frequently enough in inscriptions of this period as far down as the 11th century. Later it met with a sad fate. The Pandits intent upon enucleating the Sanskrit and Pâli originals for Sinhalese words, and at a loss to identify this one, forced it to be derived from Pâli nissâyâ \"on account of,\" wherewith of course it had nothing to do whatever. This point being settled, nisâ, it was thought, would be more correct; accordingly between the 11th and 12th centuries the word isâ altogether had to make its disappearance from the language, and nisâ already rules supreme in the inscriptions of Parâkramabâhu I. and Niçcañka Malla.\n\n14) Nava ture \"of the nine stars or planets,\" Genitive. The plural of inanimates formerly was not distinguished by a particular suffix, when the meaning was clear from the context. Where however greater accuracy was required a word war (the modern wal) began to be used in this period, which is possibly derived from a form *waḍa, *waḍa = waḍi (Skt. vrddhi) \"increase, plurality,\" comp. waḍa,\nmore,”); the a being dropped ḍ of necessity would become either r or l), *tura* = Skt. tārā.\n\n15) *Mahale*. This e can hardly be the ancient magadhic e of the Nominative: it might be for aya, as ê in all modern words (comp. mahalaka III., which would become mahalaya, mahale.) The usual form in this period would be mahalu. The word itself is frequently attached to names of kings to distinguish the prior from a subsequent one of the same name; thus Niççaṅka Malla, in his inscription at Anurādhapura speaks of Parākramabāhu the Great as “Mahalu Parākramabāhu,” himself having assumed the same name.\n\n16) *Arak* = ārakshā.\n\n17) *Samanan* = çramanānām, Formative of the plural; genuine Sinhalese is mahaṇa (old hamaṇa, see III. 52), comp. meheni below.\n\n18) *Kuḍa* = kshudra 19) *salā* “whirlpool, eddy” = çulā?\n\n20) *Daḷ* = dr̥dha.\n\n21) *Kolpatrī* (comp. kolpattra below), *kola* in Sinhalese means “leaf, as pattra in Saṁskṛt. The Sinhalese are fond of such double words; thus “order, command” in modern Sinhalese is anājñāwa* i.e., Sinhalese ana (aṇa, or Pāli āṇa) combined with the original Saṁskṛt form ājñā.\n\n22) *Aetaḷu* = antare, old atali (see III. 13), modern aetulu.\n\n23) *Wae* Gerund of wenawā = bhūtvā.\n\n24) *Aep* “we” = api. This curtailed form has disappeared again from the modern conversational language.\n\n25) *Me tuvāk* “so long” from me “this” and tuvāk which I cannot explain.\n\n26) *Denamo* “we give” or “we are giving.” This form must be derived from the verbal noun in—na (dena “giving.”)\n\n* Pronounced anāgnyāwa.\nHere we have the origin of the modern future in ññi etc. This was originally a present: karanem (for karanami)* \"I am doing,\" karanamo \"we are doing\"—n was doubled probably by force of the accent, hence karannem (or karanemi)—m being dropped in the first person sing., e affected the preceding nasal and itself migrated into ā; or perhaps more correctly e not being strong enough to hold against the two preceding consonants, was changed into yā; hence we have in modern Sinhalese karaññā (pron. karannyā) which is used as a future \"I shall do\" and karaññemu \"we shall do.\"\n\n27) Ek sewae. I am doubtful about the explanation of this, but I suspect it to be the original form of the modern séka \"he condescended, was pleased to—\" which is used with preceding participle (e.g. nadāla séka, he was pleased to declare.\") In the 12th century we have seyekae which is possibly an inversion of ek sewae; however, this must still remain uncertain.\n\n28) Wadāleyin from nadāla \"having ordered\" (past participle of wadāranawâ, tatsama = Pâli avadhâreti) and heyin) Skt. hetunâ \"because.\"\n\n29) Mahâ should be maha in genuine Sinhalese.\n\nB.\n\n1) Laēnan \"writer, secretary.\" This is a compound form of lē + nan. Lē is contracted from leya, ley (= lekhaka \"writer\"), as Saēgiri from Seygiri = Caityagiri. Mēniyan \"mother\" in the same way is to be divided into mē + niyan, mē being contracted from *maya, *may = mâtâ, as bē (bēnan) from batiya, bâya (see IV, 2). Nan, nuwan, niyan are used—the first as a suffix of respect, the two latter indicating endearment; thus we have rajānan \"king,\"\n\n* Comp. karanem in the opening verses of the Sidatsaṅgarâwa.\npiyānan “father,” bānan “elder brother”* malaṇuwan “younger brother,” putanuwan “son” (maṇiyan “mother” dōniyan “daughter.” The cerebral is constant in inscriptions. The derivation of these suffixes presents great difficulties. They are all three in the plural (n originally termination of the Genitive, then for the Accusative, is also often used for the Nominative), and as regards nan, I formerly thought, it might be taken as a double plural, the cerebral n perhaps arising from the frequent application with some words in which, from phonetic reasons, n of the Genitive plural, had to become n, but that is not satisfactory. Nuwan and niyan evidently are intended to express the masculine and the feminine gender respectively by the terminations u and i; but what then is nu?\n\n2) Tuman = ātman “own, his, etc.”\n\n3) Naemin† is an instrumental from nama, nam “name”, = Skt. nāmnā, Pāli Prākṛt nāmena.\n\n4) Di lege di “having given,” Skt. dattvā, Pāli detvā—the Sinhalese is curtailed from an old form in ya (see above.)\n\n5) Koṭ from kṛtvā—koṭu, koṭ, koṭae, koṭa “having made”—is here, as often, used as a sort of conjunction: “after” (Comp. III. 18.)\n\n6) Karana lad, past participle of the passive, from karanaṇwā, etym. Karanaṇam labdha “which has been made.”\n\n7) Nāl is a woman’s name I have also met with in the second part of the Mahāvamsa, (ch. 50.)\n\n8) Aram = ārāma.\n\n9) Mehenivarihi, see A 8.\n\n10) Tubuwaat, tubu = sthāpita, Pāli thāpita, wat (Skt. vastu?) “An affix implying possession” (Clough Dict.),\n\n* Baenan should not be confounded with baena “nephew = bhāgineya.\n\n† Naemin in the Report is an error of the press.\n\"having.\" Later on we find it as a particle: wat—wat \"either—or.\"\n\n11) Sirithi Locative of sirit (see IV. 23.)\n\n12) Se \"as, according to\" (see the derivation III. 20.)\n\n13) Danaspatā \"daily.\" In an inscription of the 9th century I found *hanurudu hanurudu patā, whence I am inclined to conclude that patā is contracted from pawatā \"having continued\" (Gerund of pawatinawâ, v. neu. Vvrt) and translate: \"year year continued\" i.e. \"yearly.\" Later the Substantive denoting the time was put only once, as still commonly danaspatā \"daily,\" anurudupatā \"yearly.\"\n\n14) Mahaneherae is Locative or Genitive, the terminations of which two cases in neuters early began to coincide, curtailed either from hu (Gen.) or hi (Loc.)—the locative, in this period as will be observed, has still retained the older termination besides, but the genitive only with animates.—Mahanehera here is the mahāvihāra at Anurādhapura.\n\n15) Mahaboyae, the same form of mahaboya, i.e. mahābodhi \"the great Bodhi-tree\" at Anurādhapura, now called \"(Jaya) Śrī mahābōdhin wahansē.\"\n\n16) Diy, \"water,\" from udaka, daka. This is the ancient word for \"water\" which in modern times had to yield its place to natura (but diya is still used in literature and in some compounds.) I take the opportunity here of giving the interesting history of natura. This is derived from Skt. wātula (or an older form vātura) \"windy, inflated.\" This first was used as a substantive for \"rain cloud,\" as proved by its Hindi equivalent bādala (see Beames, Compar. Gr. II. 145); then it came to mean \"a shower of rain\" or any violent flood, which is its signification in ancient and still in literary Sinhalese (see Nāmavaliya 82, where it is given as a synonyme for ogha); at last, in very modern times, it acquired the signification of \"water\" in general, instead of diya.\n17) *Wada waedi*. Both these words are derived from Vvṛdh; *waḍā* is Gerund of waḍanawā “to increase” v. neu., used adverbially in the sense of “more;” *waedi* is = Skt. vṛddhi.\n\n18) *Haembu* according to the whole context seems to mean “novice,” but I have not met with this word elsewhere, nor do I know its derivation.\n\n19) *Sat denak/haṭ* “to seven persons” (saptan + jana.) This is what is called in modern Simhalese Grammar the indefinite declension, but it does not, properly speaking, deserve this appellation.\n\nAncient Simhalese, as will have been noticed in the earliest inscriptions published, was very fond of the suffix *ka*. In later times this was gradually supplanted by *ya*, but before this process was accomplished, when still in a transitional state, the want was felt of a suffix for dvigu compounds. Accordingly *ka* was pressed into the service, and the final *a* being dropped, the suffix appeared as *ak*. Sat+dena combined becomes *satdenak* seven persons, a simple dvigu compound. So we find *ran sat kalandak* “seven kalandas of gold” etc. In modern times this was changed (but not always) to *kalandahatak* “seven kalandas, but the old form remained the sole in use for compounds with *dena*. In the same manner we find *ak* used in other compounds, as *me-āleyak* “the drawer of this,” or more correctly “whosoever makes this drawing, engraving” etc. There was however a word *kenek* “any, anybody,” plural *kenekun*, used with animates to express indefiniteness, which left to the noun combined with it its last portion *ek*. *Ek* and\n\n---\n\n* Mr. Childers (Notes II. 12) explained *kenek* through *ekdenek*, which was perfectly justifiable from an exclusive Simhalese point of view, but it is an interesting fact that we find the same word in the Asiatic Gipsies in the form *kanek*, *kanēk* “a noun” (see Paspati, Les Tchingianes) from which the Simhalese form cannot be separated.\nak soon were confounded and finally, the origin of both being forgotten, ek came to be used for animates, ak exclusively for inanimates. In the inscriptions of the 12th century and even in present literature (which imitates older models) we find often enough ek applied to inanimates and ak to animates, so that it is clear there was a confusion for some time. Ek as well as ak in the present language have functions, definition and composition. Thus we have balu dennek (for \"dedenek) two dogs,\" minihek \"a man\"—amuna dolohak or dolos amunak \"twelve amunas\" and galak \"a stone.\"\n\n20) Satarpasanayutu may be divided either | satarpasa + wayutu or satarpasawa + yutu; in the former case we have to translate catuhpratyayopayukta, in the latter catuhpratyayukta. I have preferred the former way, as I have never found pasawa in inscriptions, but only pasa and pasaya; wayutu then is = uwayutu (IV. 19.)\n\n21) Koṭ is here used as a preposition \"on account of\" (Comp. B. 5.)\n\n22) Wadāḷa kaerana \"which is allotted.\" Wadāḷa past participle or gerund of wadāranawā (see A. 28.) Kaerana is passive \"which is being made\" from kriyate or better *karyati (the modern Passive is kerenawā.)\n\n23) Bimhi, Loc. of bim, bima = bhumi.\n\n24) ā seems a sort of preposition, but I am doubtful about it.\n\n25) Wū participle = bhūta, from wenawā,\n\n26) Gitlegamu = ghṛtatailagrāma \"butterham.\"\n\n27) Attāṇi is difficult. The first part is perhaps ada (= adya) \"to-day,\" and the whole may mean \"from this day forth,\" but this is merely conjectural.\n\n28) Paeraehaer = parihāra. It is difficult to determine the exact meaning of this word in Pāli and in ancient Sinhalese. Mr. Childers translates \"attention, honor.\" (Cetiyam\ntattha kāresi parihāram adāsi ca “he built a tomb there and ordained that it should receive honours.”) From a number of passages collected in the 2nd part of the Mahāvamsa as well as from the testimony of the Sinhalese inscriptions I have come to the conclusion, that parihāra (paeraehaer) in this connexion rather means “a privilege” or “a privileged piece of land.” I find also in Sanskrit the word parihāra is used with the signification of “a piece of land free from taxation” (see M. Williams’ Skt. Dictionary.)\n\n29) The words derananaege I do not understand.\n\n30) Wadnā kot isā—waranā kot isā, etc., isā see above A. 13, wadnā waranā etc., are derived from the verbal nouns in na, I do not know exactly how, and mean: “in order that they may enter” etc., or “in order to enter” etc., kot is here only corroborative and might be omitted without altering the sense, as it is indeed in other inscriptions where we find the same formula. Wadnā from wadinawā “to enter” Skt. Vvraj.\n\n31) De kamtaen “two karmasthānas.”\n\n32) No waranā must mean “that they shall not obstruct,” but I do not understand the purport of the whole clause.\n\nC.\n\n1.) Mang giya — márga + gata — “traveller.”\n\n2) piya giya seems pātra + gata “he who goes carrying the alms bowl,” but it would be strange if priests were forbidden to enter.\n\n3) Dunumanḍul is a very common word in these inscriptions, and always seems to mean “priests.” I think, the modern word tunmadulla, the robe of a priest which covers, ornaments three parts of the body” is corrupted from it; but I am doubtful. Manḍul is mandala; dunu commonly = dhanus “bow.”\n\n4) Melāt dative, I believe, from melā “assembly,” a tatsama.\n5) *Rad kol kaemiyan*, Pāli raṭjakulakammikānam, \"the workmen or officers of the royal family.\" *Kol* see IV. 24.\n\n6) *Waeriyān*, plural of waeriyā \"enemy\" = vairin.\n\n7) *Gamgen*, literally \"having taken the village\" (gen = gena Gerund of gannawā), *i.e.*, \"from the village.\" At present this way of forming the ablative is confined to animates, inanimates having adopted the old instrumental instead.\n\n8) *Geri*, plural of geriyā \"bullock,\" comp. Hindi *guru*, Gipsy guruv, guri (Paspati Les Tchingianès.) It is distinguished from gonā \"bullock\" in an inscription of the 10th or 11th century; but I am unacquainted with the difference.\n\n9) *Gannā* from gannawā \"to take\" (for gananawā, Pāli ganha, Skt. grhṇa.)\n\n10) *Gael*, gaela \"cart\" from Skt. gantri, comp. Hindi gāḍī, Mar. gāḍī, Sindhi gāḍī, Pashto gāḍai.\n\n11) *Miwun*, plural of miwā = mahisha \"buffalo\" (comp. IV. 8†.) At present \"buffalo\" is miharakā, *i.e.*, miwa + harakā \"ox,\" older sarakā, derived, by inversion of syllables, either from Skt. çakvara, çakkara, çākvara, çākkara \"a bull, an ox\" or from çākaṭa \"a draught-ox.\"\n\n12) *Wadāleyin* see above A. 28. 13) see above B. 24.\n\n13) *Me kāp* etc., see above A. 9–10 and ff.\n\n---\n\n**D.**\n\n1) *Avud*, at present *aewit* \"having come,\" past participle of enawā \"to come,\" seems derived from Vvṛt.\n\n2) *Denuladi* \"has been given\" = Pāli dānam aladdhi \"received giving.\"\nVII.—Extracts from Inscriptions of King Abha Salamewan Dapulu (Dappulo V.) 10th Century.\n\nA.—At Elanaewa Pansala.\n\nŚrī Siribara kaet kula kot Okāwas rad parapuren baṭ Lak diw poloyon parapuren himi wû Abhâ Sirisaṅgbo maharad/hu tumâ sat laeṅgū nawawan hawuruduyehi Pāṇḍi raṭ paehaerae jaya kirtti lad rupundan wû mal masulutae mahat ekānna siri bhoga kaḷa maharad/hu daru Abhâ Salamewan Dāpulu maharad/hu tumâ sat laeṅgū dasawan hawuruduyehi\n\nB.—At Aetaviragollaero.\n\nOkāwas rad pa]rapure[n baṭ La]k diw p[oloyo]n parapu[ren hi]mi wû Abhâ [Śrī saṅg]bo mahā[rad/h]u tumâ sat l[aṅgū] nawawan hawu[ru]duyehi Pāṇḍi raṭ [p]aehere deye lad ma[ha]rad/hu daru Abhâ Salamewan mahā[ra]d/hu tumâ sat lae[ṅgū] dasawan hawuruduyehi.\n\n1) Siribara = śrī + bhāra “fraught with glory.”\n2) Kaet = kshatriya. 3) kot “pinnacle,” comp. perhaps kunta.\n4) Okāwas i.e., Pāli Okkākavamsa, Skt. Ikshvākuvamsa.\n5) Parapuren instrumental—Ablative from parapura = Skt. paramparā.\n6) Bat “descended” = bhrashta old Participle from basinawā, bahinawā “to descend,” Skt. Vbhramç.\n7) Lak diw poloyon = Laṅkādvipapṛthivyām. I know no analogy to the form poloyon, if it is not instrumental for poloyen — however it is always used in a locative sense.\n8) Himi = svāmin, old hamī, see IV. 29. 9) wû = bhūta, see above.\n10) Maharad/hu, Genitive in hu form sya-ssa-sa-ha.\n\n11) Tumâ Nom. sing. of tuman = âtman. Maharad/hu tumâ is honorific. Later literature mistook such forms and derived tumâ from uttama; as the Genitive sing. is here preceding, it is clear that it is not to be taken so.\n\n12) Sat laṅgû = Pâli chattam laṅghetvâ “after having raised the umbrella.” In Simhalese the l of Vlaṅgh is changed to n: nagingawâ “to mount, to ascend,” naegenawâ (older naēṅgenawâ) “to rise” (for instance: naegena ira “the rising sun, the east,” opp. basnâ ira “the west from Vbhramç + sûrya.) As I have found the old l only in this phrase which corresponds to the one used in Pâli and once in the same inscription the verb with n in another connexion, I believe laṅgû to be a corrupted tatsama.\n\n13) Hanuruduyehi, Loc. of hawurudu “year” modern Nom. sing. awurudda, pron. aurudda); hanurudu is derived from Skt. saṁvatsara through *sawacara, *sawajara, *sawadura, *sawudura, *sawuruda (c not uncommonly migrates into d in Simhalese.)\n\n14) Rat “kingdom, country” = râshṭra. 15) Paehae-rae Gerund of a verb paharanawâ, tatsama = prahr. The second inscription erroneously yields paehere.\n\n16) Jaya, in the second inscription transformed to deye.\n\n17) Lad, Participle “who obtained” = labdha, Comp. VI. B. 6\n\n18) Rupun, plural of rupu = Skt. rpu, probably tatsama (the Simhalese pronounce r like ru.)\n\n19) Dan = dâna. 20) Mal “flowers.” Mala “flower” from Skt. mālā.\n\n21) Masulutae mahaṭ ekānna I cannot explain.\n\n22) Kala, Participle: “who made” = kṛta.\n\n23) Daru, “son” = dâraka.\n\n24) Dasavan “10th,” Comp. VI. A. 3.\nVIII.—Extract from Inscription of the Aepa Mihinda at Mayilagastota (end of the 10th century.)\n\n×) P———Okâwas parapuren baṭ rad purumunwanat ag me[he]su[n] wû Lak diw poloyon parapuren himi siti (?) Gon biso raedna kus/hî upan Abhâ Salamewan maharad/hu urehi dâ kaeta k[u]la kot wiyat daham niyae gat (?) aêpâ Mihindâhu wasin ——\n\n1) Purumunwanat, Dative of the plural, see I. 1.\n\n2) Ag Mehesun, plural honorific, agra + māhishî (Pâli mahesi.)\n\n3) Sitî, Past Participle of sitinawâ “to stand, to be,” Šaurasenî cittha, Mâg. ciṣṭa or ciṣṭa, Skt. sthâ, tishta.\n\n4) Biso raedna “anointed Queen,” abhisheka + rājñî, later biso or bisava alone is used in this sense. The oldest form for raedna I have met with is rajini (second century A.D.)\n\n5) Kus/hî, Locative. Kusa = kukshi. 6) Upan = utpanna.\n\n7) Urehi dâ = urasi jâta, corresponding to aurasa.\n\n8) Wiyat = vyakta. 9) Daham for dharma.\n\n19) Niyae gat “he who has comprehended” (?.) niyae Locative. Niyae “wisdom, judgment, understanding, intellect (Clough) (= naya?). Gat, Past Participle of gannawâ (= gr̥hita.)\n\n11) Aêpâ evidently contracted from adhipati, but translated mechanically into Pâli by the barbaric form âdipâdo (Simhalese aê = âdi, pâ = pâda.\n\n12) Mihindâhu wasin “by Mihindâ” = Mahendrasya vaçena. The modern form is wisin, which most probably is here also to be emended.\nIX.—Extract from Inscription of the same as King Siri Sang boy Abahay (Mahindo III,) at Ambasthala, Mihintala (beginning of the 11th century.)\n\nSiribar kaeta kula kot Okâwas raj parapuren baṭ kaeta usab Abahay Salamewan maharaj/hat eme kulen samajaēy dew Gon bisew raejna kusae ipaedae aēpā mahayā siri windae pilīwelae sey raj wae tumā sirin Lak diw pahaya-min siṭae Siri saṅg boy Abahay maharaj/hu tumā sat laēngū sołoswana hawuruduyehi wap sand pun mas/hi dasa pak dawas Seygirī weher/hi isā Abahay girī weher/hi isā wasana maha bik saṅg himiyan mahasenwā karay tumā baē wat himiyan Seygirī weher/hi pere tubū sirit nija Abahay girī weher/hi sirit nija ruswā genae me weheraṭ me sirit tubu wawaṭi nisiyan hā sasaendae me weherae wasana maha bik saṅg himiyanat isā kaemiyanat isā dasnat isā kaṭae yutu isā labanu diyae yutu se isā wiwarunen ekse kot me sirit tabana ladi.\n\n1) Usab = vṛshabha. 2) Maharaj/hat. In the preceding inscriptions we have rad for rājan. I have already remarked in my report that King Mahindo was fond of old forms.\n\n3) Eme, seems e (etat) + ma corroborative particle.\n\n4) Samajaēy, barbaric transformation of samjāta.\n\n5) Dew = devī. 6 Bisew raejna = biso raedna VIII. 4.\n\n7) Kusae Locative = kus/hi (see VIII. 5.)\n\n8) Ipaedae “having been born,” Gerund of upadinawā, (utpad.)\n\n9) Mahayā possibly = mahattā “greatness.”\n\n10) Windae Gerund of windinawā, tatsama.\n\n11) Pilīwelae Loc. or. Gen. of pilīwela = Pāli paṭipāti (see Childers’ Notes II. 15.)\n\n12) Sey. This seems a mistaken form for se (see III.\n20. and also in this inscription) formed on the false analogy of seyin. If the old word really had been sey, we would probably have *saē in later times.\n\n13) Wae Gerund of wenawā, = bhûtvā or rather *bha-via.\n\n14) Sirin, instrumental sing. of siri.\n\n15) Pahayamin “irradiating,” Part. Present for prabâ-hyamâna.\n\n16) Siṭae Gerund siṭinawā (see above.)\n\n17) Soloswana 16th. Solos = shoḍaṣa. Wana see above VI. A. 3.\n\n18) Wap sand pun masa hi etc., wap masa is September—October, “the sowing month.” Sand pun = candra + pûrṇa. Dasa pak dawas, see VI. A. 6.\n\n19) Sey girī = Caityagiri, i.e. Mihintala; the younger form is Saēgiri.\n\n20) Isā see VI. A. 13. 21) Abahay girī = Abhayagiri at Anurâdhapura.\n\n22) Wasana “dwelling”—wasanawā.\n\n23) Maha bik sang himiyan = mahâ + bhikshu + svâmi (comp. IV. 29.)\n\n24) Mahasennā (mahâ + senâ + Simh. wâ) “as a great host,” comp. ekwâ “together.”\n\n25) Karay Gerund, for kariya, karaya (comp. III. 27.) This is an antiquated form; at the time when this inscription was written, these Gerunds already terminated in ā (karâ, etc.)\n\n26) Baē “elder brother” see VI. 31.\n\n27) Wat in this connexion I do not understand.\n\n28) Pere, adv. “formerly,” originally a Locative of pera = pûrva.\n\n29) Tubū Past Participle of tabanawā = sthâpay “established, which he established” (see on the clauses which in Sinhalese replace relative sentences. Childers’ Notes II. 6.)\n30) *Nija*, I cannot explain.\n\n31) *Ruswâ genae* \"being pleased,\" *ruswâ* is Gerund of *ruswanawâ* caus. *rusanawâ* \"to please\" (Vrui) and *genae* Gerund of *gannawâ*. *Gannawâ* is used as an auxiliary to form a sort of reflexivum, thus we have *balâ* \"having seen,\" (*balanawâ* = Prâkṛt pulva, pulaa, Skt. pralok), *balâ genae* \"having seen for one's self, having examined.\" There is often no real difference from the simple verb; but at least in the present language the Sinhalese prefer to employ the auxiliary wherever a direct reference to the subject may be implied.\n\n32) *Tubuwa waṭi* \"in order to establish\" (?)—*tubuwa* Supine (= sthāpitum) + *waṭi* which must remain unexplained.\n\n33) *Nisiyan há sasaenda* is gerund of a tatsama verb = Pāli samsandati (Vsyand) \"to run together, to associate\" (In my report I erroneously took it to be the causative samsandeti), *Nisi* (Pāli nissito = niçrita) here simply means, \"connected with, concerned in,\" in modern times \"fit, suitable\" and I would translate now the whole clause: \"in concurrence with those concerned in the matter.\"\n\n34) *Kaemiyanaṭ*, dative, see VI. C. 5.\n\n35) *Dasnaṭ*, dative plural of dasa \"slave\" = dāsa, (the modern form would be dasunta.)\n\n36) *Kaṭae yutu* \"it is proper to do\"—*diyae yutu* \"it is proper to give. *Kaṭae* and *diyae* (as also tubuwa No. 32) are supines derived from the Skt. infinitive in tum—kārtum, dattum, (Pāli detum.) They are used in connexion with yutu (yukta), haeki (çākya) and similar words.\n\n37) *Se* \"concerning.\"\n\n38) *Winarunen*, instrumental of wiwaruṇa \"comment\" = Pāli vivarana.\n\n39) *Ekse koṭ* \"having made like one,\" \"having put together\" (ekse see III. 20.)\n\n40) *Tabana ladi*, comp. denu ladi (VI. D. 2.)\nX.—(Galpota I. Report p. 2.)\n\nUdâgal mundun pat hiruhu sê saturanduru durulâ bahujanayâ — muwa — piyum dubudu koṭae anat raja sirin Cakra devendrayâ sê semiguṇen pun sandahu sê dhiratâyên Meruwa sê gaemburubaewin sâgaraya sê kshân-tiguṇen maha połowa sê lowaessan pinin upan kaprukah sê waedae siṭae.\n\n1) Udâgal mundun pat hiruhu = Udayagirimûrdhânam prâptasûryasya. 2) Sê see above.\n\n3) Saturanduru çatru + andhakâra.\n\n4) Durulâ Gerund of durulanawâ, denominative from duru (dûra) “far.”\n\n5) Muwa* piyum = mukha padma (piyum through paduma)\n\n6) Pubudu = prabuddha. 7) Anat = ananta. 8 Somi = saumya.\n\n9) Gaemburu baewin = gambhirabhâvena. The modern\n\n* The modern form for muwa (mukha) is mûna. There was an obvious reason for altering the simple word muwa “mouth,” as there is another word muwâ in Sinhalese signifying a “deer,” Skt. mrga. Mûna is possibly contracted from muwan, plural of muwa. In literature, it is true, we find the word muhuna which looks as if derived from muha, the Prâkṛt form of Skt. mukha. But this is certainly a later invention of the panḍits who delight in the use of old words and from the frequent occurrence of modern long vowels contracted from two short ones which had an h between them (e.g. lûnu “onion” from luhunu = laçuna) concluded that mûna had undergone the same process.\n\nThe following may serve as an analogy for the change of muwa to mûna. Walahâ “a bear” has been very well explained by Mr. Childers (Notes II. 14) as wal “wield” (= vana) + asa (= Pâli accho.) Yet it seems strange that “a bear” should be called expressly “a wild bear.” Now the Sinhalese formerly had an other word asa “horse” (= aqva); thus to distinguish “a bear” from “a horse” they were compelled to call the former a wal-asâ.\nform for gaemburu is jaemburu, a solitary instance of the change of \\( g \\) to \\( j \\) in Sinhalese.\n\n10) *Połowa* = prthiwi, comp. poloyon VII., 7.\n\n11) *Lo waessan*, loka + vāsin. On the doubling of consonants in plural—See Childers’ Notes, I.\n\n12) *Pinin* = punyena.\n\n13) *Kaprukak sé* “like a kalpa tree,” kalpa + vṛksha. The common word for “tree” in Sinhalese is *gaha* (= gaccha.)\n\n14) *Waedae sitae* “being pleased to be” (in a certain condition), waedae gerund of waḍanawā “to increase” which is joined to a verb when a king or other person of great importance is the subject. Sitae see IX., 16.\n\n---\n\n**XI.—From Niccanka Malla’s Inscription at Rankot Dagaba (Report p. 13.)**\n\nRan Tisaê Minihoru Gaṅgatalâ Paḍi aetulu wû tun raja-yehi no ek maha waê taenae acesha prāninta abhaya dî.\n\n1) Ran Tisaê, etc. —— waê taenae. Waê is contracted from waew used in composition for waewa “tank,” (comp. waêkanda “the embankment of a tank.”) The names for the different tanks are thus to be joined: Ran waewa (not identified)—Tisaêwa (contracted from Tissawaewa, a tank at Anurādhapura, constructed by Devānam piya Tisso)—Minihoruwaewa. We should expect Miniheru°, but all four pillars agree in thus writing the word and on the fifth copy (on the stone seat at Kiriwehera) the reading is not clear—Gaṅgatalâwa, Pāli Gaṅgataṭavāpi, constructed, according to the Mahāvamsa, chap. 42, by Agrabodhi II. (623–633), at present usually called by its Tamil name Kandalei—Paḍiwaena, at present Paḍiwila in the North-Central Province.\n\n2) Aetulu, see III., 13 and VI., A 22\n3) Tun, \"three,\" old Sinhalese tini = trîni (Comp. IV. 1)\n4) Rajayehi Loc. As regards the singular see above; rajaya is the common form for râjya in Niççanka Malla's inscriptions.\n5) No ek \"not one,\" \"many,\" corresponding to Skt. aneka.\n6) Taenae Loc. of tana = sthâna. 7) Di see VI., B 4.\n\nXII.—From Galpota III. (Report p. 13.)\n\nKâliṅga vamçayaṭa himi Lak diwae Buddha çâsanayayaṭa pratipaksha abauddha Coḍa Pândyâdi rajun no pihitîwiyae yuttêyae.\n\n1) Pihitîwiyae Supine of pihituwanawâ \"to fix, to establish\" (comp. IX., 36.)\n2) Yuttêyae—yuttê for yutayi (= yuktam asti) + yi (= iti.)\n\nXIII.—Inscription of Lagvijasingu Kit.\n(Beginning of the 13th century.)\n\nA.\n\nŚrimat Okâwas raja parapuren â Abhâ Salamewan Lilâvatî svâmîngê agrâmâtya wû Lag-wijayasiṅgu Kit senewiyan tunwan nê Anurâdhapurehi paṭan bhûmiye taman kaerae wû ruwanpâyehi waedae hun saṅgu.\n\nB.\n\nRuwanta siwupasayen wana pâsu pinisae tamanṭa bat ginuwa yaewin yâlakhâ mehi mae caityayayaṭa yâlak hâ pilimageṭa yâlak hâ bhûmidâna koṭae hirasanda pamaṇa wae pidû pâsayen pirinaemû me lâbhaya antarâya kalawun.\nC.\n\nWindinâ narakâdi duk daen hâ matu matu wanâ nuwanaetiyân lobhadvesha mâna duru koṭae lâbha antarâya no koṭae nuwanaettan (?) kaḷa anumowanu maenaewi.\n\nA.\n\n1) á “having come” (= âyâta), participle of enawâ.\n2) Svâmingê. The modern Genitive for animates with the honorific plural, svâmîn.\n3) Senewijan, plural honorific of senewi = senâpatî.\n4) Tunwannê, see VI., A 3 and 4.\n5) Anurâdhapurehi patan bhûmiye, Anurâdhapure + prasthâna + bhûmyâm “on ground (beginning) from Anurâdhapura,” bhûmiye is the modern Locative.\n6) Taman, older tuman (see VI., B 2.)\n7) Kaeraenû, Past Participle of karawanawâ “to cause to make.”\n8) Ruwanpâyehî, Locative, ruwan (= ratna) + pâya (= prâsâda.)\n9) Waedae hun, waedae (see X., 14.) hun = sanna or better sinna from Vsad, sida, Simhalese hinnawâ, innawâ.\n10) Sangurunanta, Dative plural of saṅga “a (single) priest.” The Nominative would be saṅguruwô, as rajjuruwô “kings.”\n\nB.\n\n1) Sinu pasayen wana, “being i.e., that it may be, serve for the four pratyaya’s.” Instr. for Dative, sinu or sin (pron. siu) “four” in compounds. This is only a corruption of Pâli catu, found in inscriptions since the 12th century; in genuine Simhalese also in compounds the r is retained, is catari paceni “of the four pratyayas” (Inscription 2nd century A.D.), satar pasa VI, B 20. The only exception is with some numbers, as sunisi 24, supancas 54, (now\nwisihatara, panas/hatara). Pasaya = Pāli paccayo (Comp. VI., B 20.)\n\n2) Pāsu, also written pahasu, = Pāli phāsu.\n\n3) Pinisae \"for, on account of.\" The origin of this word is not known to me.\n\n4) Bat \"boiled rice\" = bhakta.\n\n5) Ginuna yaewin. I do not understand. Yaewin is however perhaps derived from yava \"barley.\"\n\n6) Yāla, a measure. 7) mehi \"here,\" originally Locative of me \"this.\"\n\n8) Mae see IV., 3. 9) Hā either from saha or from ca, \"and.\"\n\n10) Pidū pujita, Past Participle of pudanawā.\n\n11) Pāsayen, ablative pāsa. The meaning I cannot make out.\n\n12) Pirinaemū = parināmita, Past Participle.\n\n13) Lābhaya antarāya kaḷawun. Antarāya kaḷawun is to be taken as one verb on which an accusative depends. If the first two words were to form a compound, we would have lābha-antarāya, as below C. Kaḷawun plural of kaḷa \"having done\" = kṛta.\n\nC.\n\n1) Windinā \"finding,\" \"which they find.\" We should expect windinā (Comp. IX., 10.)\n\n2) Narākadi \"hell.\" The simple word naraka has come to be used as an adjective in the sense of \"bad\" in Sinhalese. The use of Substantives for Adjectives is a very interesting chapter in Sinhalese Grammar, which however I cannot here detail.\n\n3) Duk = duṅkha.\n\n4) Daen = idānim (Pāli dāni) or adhunā.\n\n5) Matu Matu \"in future, in future;\" \"for all future.\" Matu, I believe, is mastake, as it were \"a head.\" In Pāli this word has acquired an opposite meaning, as ito\nsatasahassakappamatthake \"from this time a hundred thousand kalpas ago\" (see Childers' Dictionary.)\n\n6) *Nuwanaetiyan*, plural of nuwanaeti \"wise\" from nuwana + aeti (asti), a method of forming adjectives frequently employed in modern Sinhalese. *Nuwana* is a corrupted tatsama either from Skt. jñāna (pron. gnyāna) or Pāli ñāṇam (pron. nyānam.)\n\n7) *Nuwanaettan* is not clear on the stone and probably wrong.\n\n8) *Anumowanu*, verbal noun corrupted tatsama from Pāli anumodati—\"approving\" or \"benediction.\" (My translation in the Report \"share (the merit)\" is incorrect.\n\n9) *Maenaewi*, etymologically mana āpam asti \"it is right,\" \"they may be pleased.\"\n\nP. GOLDSCHMIDT.\n\nPotana, January, 1877.\nON THE PREPARATION AND MOUNTING OF INSECTS FOR THE BINOCULAR MICROSCOPE.\n\nBY S. GREEN, Esq.\n\n(Read at General Meeting, November 2, 1874.)\n\nWhen objects possessing a certain amount of thickness are examined under the binocular microscope, it is observed that they stand out in much bolder relief than when viewed under the monocular microscope. This stereoscopic effect is produced by a prism placed immediately over the object-glass \"by which the two eyes applied to the two eye-pieces respectively, receive through the two halves of the objective two magnified images of the object under examination, differing from each other in perspective projection, as if the object actually enlarged to the dimensions of its image had been viewed by both eyes at once at a moderate distance.\"*\n\nThe received method of mounting insects for microscopical examination, and that was in vogue long before the introduction of the binocular, is first to immerse them in Liquor Potassa, in which they should remain for two or three days according to the amount of muscle and intestine that has to be dissolved within the skin of the insect, the cuticle itself being insoluble in potash. The insect is then removed from the Potassa and carefully washed in distilled water with a camel's hair pencil, to remove any dirt that may adhere to it. This being done, it is floated on to a slip of glass three inches by one (the standard size for glass slips for mounting objects for the microscope), and wings, legs, &c., arranged with the brush, according to the skill of the operator. Another slip of glass of the same dimensions is then laid over the insect,\n\n* Carpenter's Microscope and its Revelations.\neven with the under glass, and both pressed gently together until the dissolved tissues of the insect are squeezed out, leaving nothing but an empty and wrinkled skin. The two glasses should then be separated under water, and the skin of the insect washed, to free it from any potash that may still be clinging to it. After this has been done, it is floated on to one of the glass slips and re-adjusted if necessary. It is then covered with the other slip, and the two are secured from falling apart by a piece of thread wound round them, when the whole is lowered gently into a wide mouth bottle, about four inches long, and nearly full of spirits of turpentine, which soon reaches the skin between the glass slips, by capillary attraction. After remaining in turpentine for a few days, the object is ready for mounting in Canada balsam.\n\nThe objection to the method just described is, that the insect is squeezed out of its natural shape, and that nothing remains of it but its empty skin full of folds, the result of the pressure it has undergone. As a specimen of natural history, it is worse than useless, for no idea of its original shape and beauty can be formed. On becoming the possessor of a binocular microscope some six years ago, I at once saw that some change in the old method of mounting was needed, for under the new instrument these flattened objects appeared in no bolder relief than when viewed with the minocular microscope; but the difficulty that then presented itself to me, was, how insects could be mounted in their natural form, and yet be rendered sufficiently transparent for microscopical examination. I experienced numerous failures and disappointments, until at last tolerable success rewarded my patience. I can now mount insects in their natural form, from the size of a grain of sand to that of a small bluebottle, my mode of preparation being as follows:\n\nCapture your insects alive, and then drop them from the net into strong spirits of wine. They will quickly die, very\noften with outspread wings and legs. Allow them to remain in the spirits for a fortnight or so, according to their size, until you think all watery matter has been extracted from their bodies by the action of the spirit. Then transfer them to spirits of turpentine, there to remain until they become tolerably transparent. Minute insects will turn so in a few days after immersion, but large ones take a much longer time. As soon as this transparency shews itself the insect is fit for mounting in Canada balsam. If it is of the size of the common house fly, a cell should be used, which can be a ring of glass* cut from a glass tube and cemented on to the glass slip described at the commencement of this paper. Put your fly into this cell, and drop upon it sufficient balsam to fill the cell to overflowing; then take a circle of thin glass of the diameter of the cell, and shut in the fly. The superfluous balsam will be pressed out at the sides of the cell, and can be removed after it has been allowed to harden a little. It is advisable to have an excess of balsam in the cell before closing it, as it prevents the possibility of air vacancies, which produce unsightly bubbles. Still with all precaution taken, a few small bubbles may be present on the closing of the cell, but these will disappear in course of time. Small insects are more easily dealt with, for they may be laid upon a plain slip of glass, a small globule of Canada balsam placed over them, and then covered with a thin glass, square or round, which must be let very gently down, as any undue pressure might crush the object. I sometimes use a very shallow cell of home manufacture, punched out of thin sheet lead, which answers very well. After the balsam has been put to the object, the slides should be kept in a flat position for some months until the balsam becomes tough,\n\n* Such cells are procurable at all London opticians who sell materials for mounting.\nbut this need not prevent their being used for so long a time. They are fit for microscopical investigation a few days after they have been mounted, and only ordinary care is necessary for the prevention of accidents, such as the displacement of the thin glass cover over the object, or injury to the object itself by pressure. My method of mounting objects has found favour with the Quekett Microscopical Club of London, which ranks next in importance to the Royal Microscopical Society. 146 of my slides, mounted in 1869 and the following year, were lately presented to the Club (in January last) by my friend Mr. Curties, and they formed the subject of a paper by Mr. Curties and Mr. Inghen, and read by the latter gentleman on the 23rd January at a meeting of the Club. This paper was entitled \"On Insect mounting in hot climates,\" and an abstract of it was given in the April number of the Club's Journal, which is now before me. It commences thus:\n\n\"The object of this paper was to bring under the notice of the Club a collection of 146 slides of insects and parts of insects mounted by Mr. Staniforth Green, of Colombo, Ceylon, and presented to the Club by Mr. Curties, with especial reference to the methods employed in mounting them, by which the objects were preserved in a natural and very beautiful manner. Reference was made to the usual methods of mounting insects, in which much was often sacrificed to the production of showy and attractive preparations, while there was sometimes great distortion of parts and alteration of structure. The methods employed by Mr. Green were then described. It appeared that he had for the most part given up soaking the preparation in potash, and those that had been so treated were the least successful in the collection. Most of the specimens were admirably suited for examination under the binocular, and shewed to great advantage with baraboloid illumination. Many of the\npreparations polarized well, owing to the fact that the muscles were left entire and not injured by soaking in potash. The absence both of air-bubbles and milkiness—even under the searching illumination of the paraboloid—shewed how successful were the methods employed, and the preservation of soft parts, as in spiders and aphides, was remarkable.\"\n\nIn the conversation that ensued after the reading of the paper, \"Mr. Loy stated that having looked over the collection he could speak favourably of the results attained. He had paid more attention to the smaller insects than to the larger ones, and many of them appeared to have been simply dropped into the balsam without preparation. Instead of finding them at all cloudy they were quite clear, and there were very few air-bubbles. The muscles of the thorax and legs were shewn beautifully, and in some of them the small intestines and hepatic vessels could be clearly traced. He thought that if they could succeed in doing in England what had been done in the tropics, it would be worth much trouble. A few of the parasites had been soaked in potash, but the results were not so satisfactory. Mr. McIntire said that some time ago Mr. Curties shewed him a number of these slides, and he was very much struck by many of them. They seemed to throw much light upon some subjects of interest to him. As to mounting insects in balsam at once, it was a plan that he was very much in favour of; they should be killed in spirits and then transferred at once to soft balsam. A little dirt would sometimes get in, but this was less detrimental than some of the effects of mounting in the usual way.\"\n\nI have given the foregoing rather lengthy extracts from the Journal of the Quekett Microscopical Club, merely to shew that competent judges of insect mounting approve of my method; which may induce others to follow it.\n\nColpetty, 12th September, 1874.\nNOTES ON NEOPHRON PUENOPTERUS (SAVIGNY) FROM NUWARA ELIYA.\n\nBY ALEXANDER WHYTE, Esq.\n\n(Read at General Meeting, November, 2, 1874.)\n\nN. Puenopterus (Sav.) &. White Scavenger Vulture—\n\nGeneral colour dirty pale brown. Plumage, apparently in transition stage, from that of young to adult—much jaded, and commencing moult. The outer edge of the secondaries tawny, giving a mottled appearance to the upper parts.\n\nLength, 23 inches; extent, 4 feet 7 inches; wing 17½ inches; third quill longest; tail 8½ inches, wedge-shaped, with webs of feathers much worn.\n\nUpper and anterior part of the head naked, as also one part of the neck and throat—these regions, however, being sparingly covered with acuminate or hair-like feathers. Naked part of the head extending well back, and with only blotches of yellow, on a ground colour of pale greyish, with a faint tint of flesh colour.\n\nBill.—Two and-a-half inches from gape, slender, straight and slightly elevated in front of the cere. Upper mandible with a prominent, strongly hooked, horny tip.\n\nCere.—Pale grey with yellow markings or blotches, extending half the length of the bill. Nostrils longitudinal.\n\nLegs and feet.—Pale cenerious yellow; tarsus, three inches; middle toe, three; toes much united at base by membrane; claws, strong, but slightly hooked and blunt.\n\nTrides.—Pale brown, approaching to yellow.\n\nThis interesting specimen—the first of this species, if not the only one of the vulture family recorded from Ceylon—was shot near to the Rest-house on the Nuwara Eliya Plains on the 13th of March last, by Mr. F. H. Grinlinton, and the\nabove description and measurements were noted down while the bird was yet in flesh. It was mounted by A. Whyte and Co., Kandy, and I believe it will be exhibited at the Society's next Meeting.\n\nThough common throughout many parts of India, it is difficult to account for the appearance of this stray Neophron at our mountain sanitarium. The weather at the time was rough and stormy, and it is just possible that it found the N. E. monsoon too much for it, and was thus driven south. It is not probable that a bird of such keen instinct and vision should have missed his way, or have mistaken our mountain ranges for some of its favorite haunts in Southern India; and yet, it is a matter of surprise, that a bird of prey, possessing such powers of flight, should not more frequently visit our shores.\n\nThis specimen differs considerably in plumage and measurements from the description of the species given by Terdon; but the most striking difference is to be found in the naked portion of the head extending further back than is apparently noted by him, or figured in any of the works to which I have access. It would be exceedingly interesting if the subject of these notes was to turn out a new species, or even variety, seeing there have hitherto been described only two species of this aberrant or sub-family of vultures, the other being Cathartes monachus, Tem., from Africa. We think, however, it can only be looked on as a small form of Puenopterus, with the bald space on the head extending further back than is usually the case.\n\nThis type of vulture is considered by some naturalists to connect the Raptore, and Natatores, by the similar form and shape of the bill, to that of the Frigate Pelicans, as also in the long and pointed wings. Swainson hints at the probability of Neophron being the grollatorial genus of the vultures.\nThis bird has a wide geographical range, and is common throughout the north of Africa, the west of Asia, and even the south of Europe. It is an exceedingly foul feeder, and is preserved in Egypt as a valuable scavenger, and where it is known as \"Pharaoh's Chicken.\" Terdon says it walks and runs with facility, and breeds on rocky cliffs, large buildings, mosques, &c. It forms a nest of sticks and rubbish, often lined with rags. It lays generally two eggs—sometimes white, with a few rusty brown spots—at other times so thickly covered with these as to appear quite red, with a few liver brown blotches.\n\nKandy, 26th September, 1874.\nON THE CLIMATE OF DIMBULA.\n\nSituated as Dimbula is, almost immediately under the main mountain chain of Ceylon, it will be well to briefly consider the meteorology of the Island before proceeding to discuss the observations taken at Langdale and Carlabeck during the past eight years. As these two estates adjoin, are at the same elevation, and trial has proved that there was no difference of importance between similar observations taken on the two places, these are now carried on solely at Carlabeck, as the more convenient station.\n\nCeylon, from its insular position is more exposed to the full effects of both monsoons than the adjoining Indian coasts. Yet even here the effect of position on the rainfall is very noticeable. Those stations more directly facing the north-east monsoon which blows from the dry high lands of Asia across the comparatively small Bay of Bengal cannot compare in rainfall with those exposed to the south-west monsoon after its passage over the broad Indian Ocean. On the other hand their mean temperature is higher, and there is more variation between the highest and lowest readings.\n\nThe influence of the mountain range is very marked. It is a common thing for a visitor to Nuwara Eliya during the wet season (the south-west monsoon) to find that in the short distance between that place and Hakgalla, he escapes from the almost incessant rain, and from Hakgalla can see before him the plains of Uva parched up for want of it. In Dimbula also the same thing constantly occurs in the north-east monsoon when we see the tops of the range dividing us from Uva covered with heavy clouds driven up thence by the north-east wind, yet not a drop of rain will\nfall on the Dimbula side while it is falling heavily in Haputale and the Wilson's Bungalow district.\n\nAs in all mountainous countries the heaviest rain falls at the foot of the loftier or more isolated hills. Padu-polla, the exact locality of which I am ignorant of, is credited with the greatest fall of any station in the Island, it having an average of 250 inches. Ratnapura with 146 inches can only equal places such as Sitawaka at the foot, Sea Fell, the highest hill in England, and cannot compare with the Khasia Hills in Assam, where some 600 inches of rain fall during the year, 500 of which fell during the seven months of the south-west monsoon. In this neighbourhood Dr. Hooker measured 90 inches in three days.\n\nIn a tropical country like this there is no budding or fall of the leaf to mark the seasons, but there are some few signs in the arrival and departure of birds and the blossoming of certain plants. Of the first the arrival of snipe, fly catchers, and wag tails are well known signs that the north-east has set in, and many others can be found in the Notes on Ceylon birds contributed by Capt. Legge in our Journal for 1874. Of the latter coffee is, to those resident in the hills, the most noteworthy; in Dimbulla it blossoms at intervals from January to May. Other instances are peaches, nillu, rhododendrons. In Colombo you are probably familiar with others, with which I, with my slight knowledge of the low country, am not acquainted. Health too varies much with the season. Contrary to what might be expected, the rainy season in the hills is far more healthy, both for natives and Europeans than the dry. New arrivals suffer much at first from exposure to the rain and wind, but old coolies do not experience this, and the new comers soon recover, excepting such as were utterly unfit to leave their home, and for the rest of the rainy season all as a rule enjoy good health. But in the north-east monsoon, the great variation\nof temperature, when as not unfrequently happens there is a difference of $90^\\circ$ between the temperature in the open at 6 A.M., and noon (once this year it was $98^\\circ$), tells on both Europeans and Natives, and serious disease of all kinds is rife. I am assured that the barometrical observations taken by the Surveyor-General's staff and others have been found of great practical use at times in enabling timely warning of cyclones to be sent to Madras and Calcutta, but as such observations require not only an expensive instrument, but more accuracy in observation than they would be likely to receive when I am away, I have never taken these. The observations on which the subjined table is based, have however all been taken with standard instruments, and as readings of thermometers and rain-gauges are simple compared with those of the barometer, I have been able to train others to take them with accuracy.\n\nThe meteorological year in Dimbula may be considered to commence with the burst of the south-west monsoon, which, in my experience, I have, with one exception, always noted to take place between 27th May and 2nd June. The one exception was I believe in 1874, when it broke about the middle of May, but I cannot be certain of either the day or year, as the detailed observations have been sent to England. After the burst steady, but not very heavy, rain generally continues for two months with occasional intermission. In 1872 the rains began on 2nd June, and never ceased for a quarter-of-an-hour together during the daytime, nor, I believe, during the night, till the 17th July. Seasons, however, sometimes occur during which the intervals of fine weather are so prolonged that the lately planted clearings suffer much. During August and the first half of September, though rain falls on about three days out of four, the showers are not so heavy, and a considerable portion of the day is usually fine. Towards the end of September\nheavy and continuous rain again falls from the north-east, and continues till the middle of November, after which showery weather may be expected till the end of December. January is a very uncertain month, but as a rule heavy showers fall about the middle of the month. After these have ceased little rain can be expected till the burst of the \"little south-west\" towards the end of April, and after this a month of, on the whole, fine weather brings us back to our starting point.\n\nThe amount of cloud and humidity of the air may be expected to vary directly as the rainfall, and the close correspondence between the three comes out very markedly in the subjoined diagrams, which I have added to the observations as making them more easily understood. As will be seen at a glance, all three correspond almost exactly in their rise and fall, corresponding with the increase or decrease of the readings.\n\nThere seems no regularity in the connection between the season and the temperature. If we take the mean between the highest and lowest temperatures as our mean temperature we find that it increases with the northward progress of the sun from January till April, May being stationary at the same point as April. Thence to the end of the year it seems to be independent of the sun, and to vary inversely as the rainfall, in direct opposition to the earlier portion of the year in which it varied directly at it.\n\nAs a rule, the higher the temperature during the day the lower it is at night, owing to radiation. March, April, and May are however exceptions to this, probably from the nearly verticle position of the sun in the case of March and April, and in April again and May from increase of cloud affecting the minimum, while there is little difference in the maximum temperature.\n\nThe readings of the exposed thermometer give a very\nsimilar diagram to the corresponding readings in the shade, but of course at a considerable distance above for maximum, and below for minimum readings. This distance, as will be seen, varies inversely as the rainfall. In understanding the diagrams the rise or fall of the line is more to be considered than its length, as in the case of the thermometer the exposed ones naturally vary more from their mean than those in shade. In the rainfall diagram the verticle distances from the base line A. B. to the various points, multiplied by $12\\frac{1}{2}$ give in inches the actual quantity that fell in any month.\n\nE. HEELIS.\n### Abstract of Observations taken at Langdale and Carlabeck Estates, Lindula, to end of the year, 1877.\n\nElevation 4,600 feet.\n\n|                | Rainfall                  | Shade-Temperature          | Exposed Thermometer       | Humidity of air | Cloud |\n|----------------|---------------------------|----------------------------|---------------------------|-----------------|-------|\n|                | Years observed | Days' rain | Total fall in inches | Most in 24 hours in inches | Years observed | Mean Maximum | Mean Minimum | Mean Temperature | Highest temperature | Lowest Temperature | Years observed | Mean Maximum | Mean Minimum | Highest Temperature | Lowest Temperature | Years observed | Mean humidity | Years observed | Mean cloud (0—10) |\n| January        | 8                     | 9             | 3·21                   | 2·48                      | 7              | 74·2         | 56·0         | 65·10            | 81               | 45·0           | 4              | 107·9         | 3             | 47·7         | 128            | 33              | 4             | 60             | 4·5·2         |\n| February       | 8                     | 8             | 2·25                   | 1·47                      | 7              | 76·5         | 55·2         | 65·85            | 83               | 45·0           | 4              | 112·2         | 3             | 49·5         | 128            | 40              | 4             | 56             | 4·4·9         |\n| March          | 8                     | 9             | 2·38                   | 1·50                      | 7              | 78·9         | 55·6         | 67·25            | 86               | 46·5           | 4              | 112·3         | 3             | 48·9         | 126            | 38              | 4             | 54             | 4·3·5         |\n| April          | 8                     | 15            | 6·50                   | 2·96                      | 7              | 78·7         | 58·0         | 68·35            | 89               | 49             | 4              | 114·6         | 3             | 51·7         | 136            | 42              | 4             | 69             | 4·6·0         |\n| May            | 9                     | 19            | 7·92                   | 9·27                      | 7              | 76·3         | 60·1         | 68·20            | 84               | 50·0           | 5              | 106·9         | 3             | 54·9         | 133            | 42              | 5             | 70             | 4·6·4         |\n| June           | 9                     | 25            | 17·88                  | 5·10                      | 7              | 70·1         | 60·9         | 65·50            | 81               | 53·5           | 5              | 92·6         | 3             | 57·6         | 120            | 43              | 5             | 80             | 5·8·6         |\n| July           | 9                     | 25            | 15·18                  | 3·77                      | 7              | 69·8         | 59·9         | 64·85            | 79               | 54             | 5              | 90·3         | 3             | 57·1         | 124            | 48              | 5             | 77             | 5·7·8         |\n| August         | 9                     | 24            | 9·16                   | 2·11                      | 8              | 71·0         | 60·0         | 65·50            | 83               | 52             | 5              | 100·6        | 3             | 56·1         | 134            | 48              | 5             | 79             | 5·8·2         |\n| September      | 9                     | 24            | 13·91                  | 5·85                      | 8              | 70·9         | 59·4         | 65·15            | 80               | 50·0           | 5              | 99·0         | 3             | 55·5         | 132            | 45              | 5             | 79             | 5·7·4         |\n| October        | 9                     | 24            | 12·95                  | 3·14                      | 8              | 71·6         | 58·7         | 65·15            | 80               | 51·0           | 5              | 102·9        | 3             | 56·1         | 133            | 46              | 5             | 79             | 5·7·0         |\n| November       | 9                     | 21            | 9·02                   | 2·36                      | 8              | 73·6         | 58·1         | 65·85            | 79               | 48·0           | 5              | 110·3        | 3             | 53·9         | 132            | 46              | 5             | 75             | 5·7·0         |\n| December       | 9                     | 15            | 5·21                   | 3·94                      | 8              | 73·6         | 57·6         | 65·60            | 81               | 44·5           | 5              | 109·3        | 3             | 51·5         | 133            | 35              | 5             | 69             | 5·5·9         |\n\n**Totals, means & extremes...**\n\n|                | 218 | 105·57 | 9·27 | 73·8 | 58·3 | 66·05 | 89 | 44·5 | 104·9 | 53·3 | 136 | 33 | 71 | 6·6 |\nNOTE ON THE SUPPOSED CAUSE OF THE EXISTENCE OF MOUNTAIN PATANAS OR GRASS LANDS OF THE MOUNTAIN ZONE OF CEYLON.\n\nThe existence of patanas in the midst of forests in Ceylon has never been satisfactorily explained, and the writer does not attempt to explain the occurrence of the numberless small patches of grass-land that are so frequently met with, apparently without any sufficient cause, among the forests of the Kandyan Province. He wishes merely to direct attention to a fact which does not appear to have been noticed, and which in this particular instance is a sufficient cause for the existence of at least one considerable tract of patana. In travelling from Pundalu-oya to Ramboda there may be seen on the Tavalamtenna side of the valley a long blackish band of rock broken up into very prominent buttresses near Wavendon, but still distinctly traceable as one formation. This band, which the writer estimated at 700 to 1,000 feet in thickness—though it may be much more—slopes down from the upper portion of Helboda estate towards Ramboda where it forms the lower half of the second fall, and where also it disappears under the gneiss in the immediate neighbourhood of the church. It may also be noticed that there is a remarkable absence of forest growth of any kind from the topmost part of this band down almost to the river—whilst immediately above most luxuriant forest has until recently prevailed. The connection between the two facts is evident. The rock is so poor in fertilizing matter that its debris cannot support a forest vegetation, and the debris of other rock has not to any extent been spread over its surface. On examining the rock in question, it is found to be a semi-crystallized\nquartzite destitute of felspar or mica or any of the other constituents of gneiss. When it is understood that this quartzite forms only one stratum in a distinct series of metamorphosed rocks—of which crystalline limestone is another; the former having been sandstone and the latter ordinary limestone and before metamorphic action took place, and that this series extends in all probability over nearly the whole Island, i.e., whenever the gneiss is found, it will appear extremely likely, especially when the disturbed state of this gneiss formation is taken into account, that the same band of rock will reappear—as indeed the writer has been informed that it does in Ouvah—and thus be the cause of other patanas. If the above fact with regard to Ouvah be correct, for the writer has never been able to verify it himself, it would appear not unlikely that this great Mountain Plain may be shewn to be chiefly composed of the debris of this quartzite—which owing to the deficiency of rainfall caused by the protection of the Saffragam mountains has never been washed way. The writer however does not wish to do more in this case than hazard a conjecture.\n\nJanuary, 1876.\n\nR. ABBAY.\nJOURNAL\n\nOF THE\n\nCEYLON BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY,\n\n1880.\n\nPART II.\n\n\"The design of the Society is to institute and promote enquiries into the History, Religion, Literature, Arts, and Social Condition of the present and former inhabitants of the Island, with its Geology, Mineralogy, its Climate and Meteorology, its Botany and Zoology.\"\n\nPrice to Members, 1 rupee; to Non-Members, 2 rupees; Copies are supplied to Booksellers at home at 5s.\n\n*** Communications intended for publication in the Journal must be forwarded to the Secretary at least a fortnight before the assembly of the General Meeting at which they are to be submitted.\n\nAGENTS:\n\nMESSRS. TRÜBNER & Co., 57 & 59, LUDGATE HILL, LONDON.\nMESSRS. THACKER, SPINCK & Co., ST. ANDREW'S LIBRARY, CALCUTTA.\n\nWILLIAM HENRY HERBERT, GOVERNMENT PRINTER, COLOMBO, CEYLON.\n\n1881.\nCONTENTS.\n\nGramineæ, or Grasses indigenous to or growing in Ceylon (continued from Journal for 1880, p. 90) . . . 1\n\nTranslation of two Jatakas . . . . . . 29\n\nOn the Supposed Origin of Tamana Nuwara, Tambapanni, and Taprobane . . . . . . 35\n\nThe Rocks and Minerals of Ceylon . . . . . . 39\nROYAL ASIATIC SOCIETY.\n\nCEYLON BRANCH.\n\nGRAMINEÆ OR GRASSES\n\nINDIGENOUS TO, OR GROWING IN CEYLON,\n\nAs given in the Enumeratio Plantarum Zeylaniæ, pp. 356 to 376\nand Addenda, with notes on them, especially those\nuseful as fodder plants or otherwise,\n\nBY W. FERGUSON, F.L.S.\n\nRead at the General Meeting, Asiatic Society, September 11th, 1879.\n\n[Continued from Journal, Ceylon Branch, Royal Asiatic Society\nfor 1880, p. 90.]\n\n138. IMPERATA ARUNDINACEA, Cyrill. I. cylindrica, Beauv.\nLagurus cylindricus, Linn. is the large European form of\nthis plant; Sir W. Munro, Lin. Jl. 6, p. 48. This has a\nlarge number of Botanical names and has been described by\nseveral authors. It is the famous Ilook of the Sinhalese,\nthe Lalang of Java, Weri of Amboina, Alang-alang of the\nMalays, and is well known as a great pest in some places.\nIt is common in Ceylon from the sea-coast up to several\nthousand feet elevation, and in consequence of the great depth\nto which its underground stems extend, is most difficult to\neradicate once it gets into a coffee estate or other cultivated\nground. On some of the cocoanut estates beyond Negombo,\nit was got rid of by penning cattle over it. It is used for thatch in Ceylon. \"It is a native of moist stiff ground, and particularly common in Bengal, where the fields are white with its tall silvery spikes when in flower after the first rains in April and May. Cattle are not fond of it, particularly when old. It is used in the marriage ceremonies of the Telingas. In Bengal it is much used as thatch.\"—Rox. Fl. Ind. I., pp. 234—235. It is a native of Southern Europe, Northern Africa, Senegal, all India, and Chili.\n\n139. Saccharum spontaneum, Linn. S. Aegyptiacum, Willd. S. semidecumbens, and S. canaliculatum, Rox. Fl. Ind. I., pp. 236 and 246. This is a very common grass in gardens and in fences in Colombo and elsewhere in Ceylon, and remarkable for its tall culms, and long silvery white panicles of flowers. I have never seen it truly wild in the Island. \"The leaves of this grass make good mats for various purposes, and are also used for thatching houses. The immense quantity of long, bright, silver-coloured wool which surrounds the base of the flowers gives this species a most conspicuous and gaudy appearance. On the banks of the Irrawaddy, this tall grass is very abundant, and forms a striking object in the landscape. Buffaloes are fed on it.\"—Rox. It is said to be the principal fodder for elephants in British Burmah, Slym's Elephant, p. 14. This is the grass well-known as the Kans of North-Western India. In his Notes on the Flora of Banda, Mr. Edgeworth says, it is found everywhere, and is \"the curse of the country.\"—Lin. Jl. 9, p. 320. From an article on the Department of Agriculture and Commerce in the Pioneer of 23rd September, 1880, I make the following extract respecting this grass:\n\n\"Kans grass is a coarse grass with very deep interwoven roots which infest south Jumna districts, in which, like reh in the north of the Jumna districts, it has from time to time laid waste hundreds\nof square miles. In that quarter of the province agricultural labour is, owing to the absence of irrigation and the precarious outturn of produce, far below the normal level in the south Jumna districts, and is unable in consequence to compete with the ravages of the hans weed, which requires nothing so much as hard manual labour to remove it.\"\n\n140. Saccharum arundinaceum, Retz. S. daemonum Konig. This is the Rambuk of the Sinhalese, and is quite common, and I feel confident indigenous to Ceylon, on the banks of streams and rivers from the coast up to the Kandyan country, and much cultivated as a fence-plant in Colombo. From this grass, I feel confident, that Rambukkana and Rambukenny have been derived. It is the Pey-Karambu, or Devil's sugar-cane of the Tamils, and hence Konig's S. daemonum. I have measured a culm of this grass in flower in Colombo some years ago, which was $20\\frac{1}{2}$ feet in height. Some of the juice of this plant, and bits of the bark of Halgaha, are put into the toddy intended for jaggery. \"With this very lofty grass the natives make roofs for their houses, rafts for crossing rivers, railings for their enclosures, and biers to carry dead bodies.\" Ainslie.\n\n141. Saccharum officinarum, Linn. Of the sugar-cane several varieties are cultivated in Ceylon, and large quantities are grown in the clayey fields near Colombo, and brought into town to be cut up into small bits which are chewed and sucked by the natives. Experiments made in several parts of the Island to cultivate this cane for sugar manufacture have proved failures, except the one at Baddegama near Galle where the Messrs. Winter and Bowman manufacture sugar which supplies the shipping at Galle to a certain extent.\n\n142. Saccharum, Sp. Elephant Sugar Cane. I give this on the authority of a list sent to me by Mr. Morris of foreign grasses introduced to Ceylon. [I learn from Dr. Trimen that this should have been included in 141.]\n143. **Perotis latifolia**, Aiton. Anthoxanthum indicum, Linn. Saccharum spicatum, Linn. Agrostis spicaeformis, Linn. This grass was collected in Ceylon by Paul Hermann in 1660 to 1667, and was described by Linneus in Fl. Zeylanica, No. 25, and I examined his specimen in the British Museum in 1857. It is in p. 29 of volume I. (by an error marked 5). It is a common grass at Colombo in sandy soil, and is remarkable for its long bottle-brush-like panicle of metallic coloured flowers. Cattle scarcely touch it. Hermann gave the Sinhalese name kawulu to it, whilst Moon, in his Cat. Ceylon Plants, gives heen-pini-baru, and ela-balal-tana for it, but I never heard it called by any of them. It is a native of India, Japan, Teneriffe, and the Cape of Good Hope.\n\n144. **Zoysia pungens**, Willd. Agrostis matrella, Linn. Matrella juncea, Pers. This is a very common seaside plant, and grows in the sand along the coast, and with Remirea pedunculata, Cyperus arenarius, and other plants helps much to bind the sand along the coast. It is a tiny plant with pungent leaves, and needle-like spikes of flowers, but it creeps underground to a great extent.\n\n145. **Sporobolus indicus**, R. Br. Agrostis indica, Linn. This is a common grass in the Kandyan country, whilst on the coast the next one is very common.\n\n146. **Sporobolus diander**, Beauv. Agrostis diandra, Retz. Rox. Fl. Ind. I, p. 317. This is a very common grass about Colombo and elsewhere in the Western Province. Both species are remarkable for their delicate feathery panicles. Cattle do not seem to like either of them.\n\n147. **Agrostis Royleana**, Trin. Calamagrostis Hookeriana, and C. Roylei, Steud. This is a delicate grass found by me at Nuwara Eliya and at the Agras—a good deal like small plants of Arundinella nervosa.\n\n148. **Polypogon monspeliensis**, Desf. P. zeylanicus, N.\nab Es. Said to be rare in the Uva district and possibly introduced, En. p. 370.\n\n149. *Aristida adscensionis*, Linn. A. gigantea, L. fil. A. caeruleascens, Desf. A. canariensis, Willd. A setaceus, Moon, Cat. Ceylon plants, p. 9, not of others? Æt-tuttiri, Sinhalese. Chaetaria species, Beauv., and others. I follow Mr. Ball in his Spicilegium Floræ Maroccanæ in Linn. Jl. vol. 16 p. 712, in his nomenclature of this grass. This is a very common and very abundant tall grass in Ceylon, with very large panicles of flowers with long awns, and as already stated is most troublesome to those who have to walk through it. Brooms are made of its long wiry culms. Cattle never touch it. It is a most troublesome weed on roadsides in Colombo. It is found in Morocco, Northern Africa, in the Canary and Cape de Verde Islands, Arabia Petraea, Brazil, in Southern Spain, Sicily; and Linneus remarks that this is one of the four plants which constitute the flora of the island of Ascension, the others being Sherardia fruticosa, Euphorbia origanoides, and Portulaca.\n\n150. *Aristida depressa*, Retz. A. vulgaris, Trin. This grass was found at Trincomalee by the late Rev. Mr. Glenie. Rox. Fl. Ind. 1, p 351, says that, like A. Hystrix, it is perfectly useless.\n\n151. *Phragmitis roxburghii*, Kth. P. nepalensis, N. ab Es. Arundo Karka, Rox. Fl. Ind. 1, p. 347. Panicum arborescens, Moon’s Catalogue, p 8. not of Lin. Nala-gas, Sinhalese, literally trumpet or reed plant. This a very common and remarkable grass, with culms from 10 to 12 feet in height crowned with large open panicles of brown inflorescence. It affects the mouths of rivers and is generally mixed with the mangroves, but is equally common on the banks of canals, streams and fields, and can be easily recognised at the mouth of the Kelani river, on the Island and elsewhere, close to\nKalutara, and along the railway line as far as Polgahawela. I measured a creeping stem of this grass growing in the Bolgoda lake, which was 73 feet in length. The large panicles when dry form an ornament in vases for the drawing-room, &c.\n\n\"Pipes are made of the culms, particularly those used by the people who carry about the dancing snakes. The common Durma mats of Bengal are made of the stalks split open. Vessels from the port of Calcutta are generally dunnaged with them.—\"Rox. Is this distinct from the P. communis of Europe which has a very wide range?\n\n\"From the hollow reeds he fashioned\nFlutes so musical and mellow,\nThat the brook, the Sebowisha,\nCeased to murmur in the woodland,\nThat the wood-birds ceased from singing,\nAnd the squirrel, Adjidaumo,\nCeased his clatter in the oak-tree,\nAnd the rabbit, the Wabasso,\nSat upright to look and listen.\"—Longfellow's Hiawatha.\n\n152. Arundo donax, Linn. or European reed, a native of the south of Europe and Northern Africa. Has been introduced to Ceylon and is used for basket making, but it does not seem to flower here. I have seen plants of this growing at Coruna in Spain, with culms more than an inch in diameter. A small variegated grass, now commonly cultivated in Ceylon (the gardener's garter?) supposed to be a variety of this species, is doubtless the variegated form of Phalaris arundinacea.\n\n153. Amphidonax Heynei, N. ab Es. This grass is given as found in the Central and Southern Provinces up to an elevation of 4,000 feet.\n\n154. Amphidonax obtusiflora, Thw. En. p. 370. C. P. 3,470. Found by Dr. Thwaites at Ratnapura. I have seen no specimen of this grass.\n155. **Cynodon Dactylon**, Pers. This is the famous *Hur-yalee* of the Deccan, and the *Arugam-pillu* of the Tamils in Southern India and Ceylon. It is the grass supposed to be the best fodder of the indigenous ones, and is invariably selected by the grass women who may be seen all over Colombo scraping the whole plant from the roadsides and swards, to the very great injury of both, as it is one of the best grasses for binding the roadsides, and for forming swards. It is quite common everywhere in Ceylon, from the sea-coast up to the plains of Nuwara Eliya. It is the *Panicum Dactylon*, Linn., *Agrostis linearis*, Retz. and has been described under about a dozen other names. It seems to be common over a great part of the world. It is found in England, and other parts of Europe, India, China, Thibet, Australia, South and Central America, and the Cape of Good Hope; and said to have been introduced into Farz and Khuzistan, by the British Expedition of 1856-7, according to Birdwood p. 126. Col. Otley has written fully on the cultivation of this grass as a fodder for cavalry, in the Madras Literary Journal, but some trials made by me near Colombo did not bear out the Colonel's recommendation. It is the *Durva*, Sans. *Doorba*, Doobla, Beng. *Doob*, Ganer, Hind, and Gherika. Tel. \"It is the Agrostis of the Greeks according to Fraas. Its flowers in their perfect state are among the loveliest objects in the vegetable world, and appear, through a lens, like minute rubies and emeralds in constant motion from the least breath of air. It is the sweetest and most nutritious pasture for cattle; and its usefulness added to its beauty, induced the *Hindus*, in their earliest ages, to believe that it was the mansion of a benevolent nymph. Even the veda celebrates it, as in the following text of the *Atharvana*: \"May Durva, which rose from the water of life, which has a hundred roots and a hundred stems, efface a hundred of my sins, and prolong my existence on earth for a hundred years!\"\nIt is sacred also to Ganesha. Durva and Doorba must not be confounded with Darbha, a synonym of the celebrated Cusha grass. Sir W. Jones, and others ex. Birdwood, Bombay Products, p. 128.\n\n156. Cynodon Neesii, Thw. En. p. 371. C. virgatus, N. ab Es. This grass was found at Trincomalee by the late Rev. S. O. Glenie. It has long panicles and quite unlike the above.\n\n157. Cynodon gracilis, N. ab Es. Leptochloa uniflora, Hochst. Said to be common in the hotter parts of the Island.\n\n158. Leptochloa chinensis, N. ab Es. L. tenerrima, R. and S. Poa chinensis, Burm. Rox. Fl. Ind. 1, p. 332. Found by me on the shore of the Colombo lake evidently from introduced seed. Roxburgh says it is a large beautiful species, growing on the borders of water-courses, and places where there is much moisture.\n\n159. Leptochloa filiformis, R. and S. The habitat of this grass is given as Colombo on my authority. It is a slender grass with a long delicate panicle; found by me in abundance in the garden behind the Government offices, but it has disappeared from this place for some years past.\n\n160. Leptochloa arabica, Kth., En. 1 p. 271. Dinebra aegyptiaca, Jacq. I found this in great abundance in the Guinea grass close to the Colombo Kachcheri, several years ago, but evidently from seed thrown out in the debris from the bazaars. Dalzell in Bombay Flora. p. 297, says it is common in Sindh, where it is called Drub, and it is a favourite food of buffaloes. It is a native of Ægypt, Senegambia, Arabia, and India.\n\n161. Eleusine indica, Gaert. Cynosurus indicus, Linn. Wal-mal-kurakkan, Sinhalese. Burm. Thea. Zeyl. t. 47. fig. 1.\nThis is one of the most common roadside grasses in Ceylon, and can be easily recognized by its 3 to 6 digitate terminal spikes, with a single one always some distance below the others. It is so coarse that cattle scarcely ever touch it. It is a most troublesome weed on roadsides, and will spring up from its roots after being cut down several times.\n\n162. Eleusine coracana, Gaert. Rox. Fl. Ind. 1. p. 342. E. stricta, Rox. l. c. p. 343? Cynosurus coracanus, Linn. Kurakkan, Sinhalese. Hermann, Mus. Zeyl. p. 58. Linn. Fl. Zeyl. No. 458, p. 208. Knox’s Ceylon, p. 22; Kayvaru and Kelwaragu, Tamil. Natchne, Ragee, Hind. Raggi, of Madras.\n\nI can find no explanation of the meaning of the specific name adopted by Linneus and Gaertner, but can scarcely doubt that it is derived from the Sinhalese Kurakkan, under which it has been known to and cultivated by the natives time out of mind. There is no record of its having been found in a wild state. This is cultivated extensively by the Sinhalese from the coast up to several thousand feet in the Kandyan country, especially in the chenas, a word having the same meaning as the Kumari in the Madras Presidency. “This is the most prolific of cultivated grasses, forming the chief diet of the poorer classes in some parts of India, as Mysore, North Circars, slopes of the Ghauts, &c. It is considered by the natives to be the most nourishing and invigorating of cheap food. On analysis, Raggi has been found to contain, on an average 6·53 per cent. of nitrogenous matter, whereas rice contains 7·40, and wheat 13·42. In this respect Raggi stands last among the cereals of India. But Dr. Forbes Watson thinks that the want of nitrogen is more than compensated by the mineral constituents of Raggi. It is rich in iron required for the blood corpuscles, and in potassa, lime, and phosphoric acid, essential to various tissues of the body. On the whole, Raggi thus stands high in food value.”\n\nSee a very full account of this grain in the supplement to the\nCeylon Observer of 19th July, 1879, extracted from the Madras Athenæum. For one variety of E. stricta, Rox. gives the increase equal to 120-fold, and for another 500-fold, whilst on two tufts, the produce of one seed, 50 culms grew, and no less than 8,100-fold was carefully calculated to be the produce of this plant. Five varieties of kurakkan are cultivated by the Sinhalese.\n\n163. Dactyloctenium ægyptiacum, Willd. Cynosurus ægyptius, Linn. Chloris mucronata, Mich. Eleusine ægyptiaca, Pers, &c. Putu-tana, Sinhalese. This is a common grass and easily recognised by its peculiar three-to-five-spiked stiff inflorescence. The culms creep and root at their joints, flowering parts erect. Cattle eat the young plants.\n\n164. Chloris barbata, Sw. Andropogon barbatum, Linn. Mayura-tana, Sinhalese. This is a very common grass about Colombo, and is remarkable from its long awned spikes, which come out in dense tufts of 12 to 20 on the tops of the culms, and are seen moving about with the least wind. Cattle eat it till it flowers, and then it is seldom touched.\n\n165. Chloris decora, N. ab Es. C. meccana, Hochst. Said to be found in the hot drier parts of the Island. I have not seen a specimen of this grass.\n\n166. Chloris digitata, Steud. Melica digitata, Rox. Fl. Ind. 1. p. 326, Gymnopogon digitatus, N. ab. Es. MSS. I only know this grass from a dried specimen of it. Roxburgh describes it with culms four to five feet high, spikes terminal, expanding, very long, mostly five-fold. A large beautiful species.\n\n167. Dichætaria Wightii, N. ab Es., Steud. Syn. Gram. p. 145. Gymnopogon rigidus, Thw. En. Pl. p. 372, C. P. 914. This is a coarse erect grass, from two to three feet in height, found in abundance in the Government Experimental Gardens at Henaratgoda. I do not think cattle touch it when in flower at least.\n\n168. Avena aspera, Munro, Described by Thwaites\nEn. p. 372. C. P. 916. I found this fine tall oat-like grass near Baker's Farm in Nuwara Eliya in April, 1879.\n\n169. *Eriachne triseta*, N. ab Es., Steud. Syn. Gram. p. 237. *Megalachne zeylanica*, Thw. En. p. 372. C. P. 3,247. *Airopsis triseta*, Nees. *Aristida biflora*, Moon, Cat. p. 9? Pinittuttiri, Sinhalese. This grass is very abundant in the Cinnamon Gardens, Colombo, and is always in flower. It is a miserable, wiry, withered-looking grass and grows in dense tufts. No animal will touch it; it is a wretched, worthless weed.\n\n170. *Uralepis fusca*, Steud. Tridens indicus, N. ab Es. MSS. This rare grass was found by the late Dr. Gardner at Elephant Pass in the Northern Province. Specimens of it were sent by me to the Peradeniya Herbarium in December, 1863, collected near Colombo, I think.\n\n171. *Pommereulla cornucopiae*, Linn. fil. Rox. Cor. Plants, 2. No. 131. Fl. Ind. 1. p. 331. Moon Cat. p. 7. Referring to this No., Dr. Trimen has kindly added the following note:—\"I suspect an error on Moon's part. There is a small grass from 'Jaffna? Moon' in the herbarium here (C. P. 3,250), which may be the plant meant, but it is not Pommereulla.\" This accounts for the fact that C. P. 3,250 is not given for any plant in Enumeratio.\n\n172. *Poa annua*, Linn. This is one of the most common of English grasses. Dr. Thwaites gives it as common on roadsides at Nuwara Eliya, but thinks it is possibly an introduced plant. It is so very plentiful in various parts of Dimbula, and especially on the banks of streams not near cultivation, that it looks very like a native plant, but its immense power of spreading in England is well known, and it may after all be an escape from packets of English seeds.\n\n173. *Eragrostis bifaria*, W. and A. E. secunda, N. ab Es. *Poa bifaria*, Vahl. Rox. Fl. Ind. 1. p. 331. A tall grass with long narrow terminal spikes having sessile, alternate,\nbifarious spikelets, and very distinct from all the other species of this large genus.\n\n174. *Eragrostis unioloides*, R. and S. E. amabilis, W. and A. Poa unioloides, Retz. Uniola indica, Spreng. This is a very abundant plant and is found from two or three inches to upwards of one foot in height, with two kinds of panicles, one form having narrow compact ones, and the other large open spreading ones, with beautiful Briza-like flowers of a whitish purple tinge, but sometimes are white. When growing on the banks of streams or close to water, it is a very handsome grass. Graham, Cat. Bombay plants, p. 236, calls it \"the most elegant of all the grasses.\" For the utter confusion in respect to the Poa amabilis, and P. tenella of Linneus, see Sir W. Munro's notes.\n\n175. *Eragrostis poeoides*, Beauv. C. P. 3,944. Poa eragrostis, Linn.? Kth. Enum. 1. p. 332. I know this grass only from the single specimen I have seen of the above C. P. No., found by the Rev. S. O. Glenie at Trincomalee.\n\n176. *Eragrostis Brownei*, N. ab Es. Poa polymorpha, R. Br. P. Brownei, Kth. P. glaucoides, Moon Cat. p. 9. Ela kooru-tana, Sinhalese. This is a very common grass from the sea coast up to Nuwara Eliya, and affects the dry sand of the cinnamon gardens as well as the sides of water and streams, and is often found growing in sheets of water. It can easily be recognised from all the other species of the genus by its glaucous metallic hue. It is a tall, stiff, wiry grass, and I do not believe cattle ever touch it. I feel confident that it is Moon's Poa glaucoides, with the native name, both applicable to this grass.\n\n177. *Eragrostis zeylanica*, N. ab Es. Poa reclinata, Moon Cat. p. 9. Mal-aetora-tana, Sinhalese. Dr. Thwaites suggests that this is only a variety of the last one, but the habits of the two are so different that I do not think they are forms of one species. This is always found spreading close to the ground,\nwith long straggling branches, and thin interrupted panicles with often large spikelets. It is common in Colombo, and I have found it in the patanas at Kattaboola in Kotmale, but it is rare compared with E. Brownei, and has none of its peculiar glaucous hue. Dr. Trimen states that Moon's name for this is Poa cynosuroides, Moon Cat.\n\n178. **Eragrostis orientalis**, *Trin.* Dr. Thwaites gives Central Province, not uncommon, for this plant, and asks if it is not a variety of E. Brownei, but I have not found it except in Colombo where it is most common in the Cinnamon Gardens, but generally in very dry sandy soil, and often with E. Brownei. This one has a compact panicle and has not the glaucous hue of the other, and there is a small delicate variety of it. It is a good deal like E. Brownei in some respects.\n\n179. **Eragrostis pilosa**, *Beauv.* Poa pilosa, Linn. P. verticillata, Cav. P. ægyptiaca, Willd. P. elegantula, Kth. P. elegans, Rox.? This is a very abundant plant from the sea coast up to Dimbula, where it and Paspalum filiculme are the most common weeds on some of the coffee estates. It is a thin delicate grass, and is generally found in great patches.\n\n180. **Eragrostis megastachya**, *Link.* Poa megastachya, Koel. Briza eragrostis, Linn. This is a fine plant with large open panicles of white spikelets and the most like one of the Brizas. Found from the coast up to the Kandyan country.\n\n181. **Eragrostis paniculata**, *Steud.* E. nigra, N. ab Es. Poa paniculata, Rox. Fl. Ind l. p. 340. Found by Dr. Thwaites in Dumbara and Maturata districts I do not recollect where my specimens were collected. It is a tall handsome grass with a much divided ample panicle.\n\n182. **Eragrostis nutans**, *Steud.* Poa nutans, Retz. Rox.l. c. 335. Poa Koenigii, Kth. P. interrupta, Koen. Rox. l. c. This is a tall grass from 3 to 5 feet high, with beautiful feathery-drooping panicles of purple-coloured flowers, and grows in large\nquantities in rich clayey soil on the banks of streams and rivers. It is a very conspicuous grass on the island in the Kalu-ganga, where the railway crosses it at Kalutara, in company with Phragmites Roxburghii.\n\n183. *Eragrostis plumosa*, Link. Poa plumosa, Retz. Kth. Enum. 1 p. 338, cum syn. P. viscosa, Kth. l. c. p. 336. An P. ciliaris, Linn.? C. P. 70, 926, 927, (928). Hab. Very common in the warmer parts of the island, and an extremely variable plant. The above is copied verbatim from the En. Pl. Zeyl. p. 373. Several forms of this delicate grass are well known to me, and they are abundant all over the maritime parts of the island, but I feel that I cannot do better than refer to Sir W. Munro’s remarks on the identification of the grasses of Linneus’ Herbarium in Lin. Soc. Jl. 6 p. 43 or Poa amabilis, Linn. and P. tenella. The specimen collected by Hermann in Ceylon in 1660-7, and described by Linneus in the Flora Zeylanica No. 46, was examined by me in the British Museum in 1857.\n\n184. *Cœlachne pulchella*, R. Br. Isachne simpliciuscula, W. and A. This is a small grass very common in marshy places, and especially in paddy fields in the Western and Central Provinces.\n\n185. *Cœlachne perpusilla*, Thw. Isachne perpusilla, Arn. Central Province in bogs, at an elevation of 5,000 to 7,000 feet. Very common in similar places with the former. They are both too small to be of much use as fodder.\n\n186. *Æeluropus lagopodioides*, Trin. Dactylis lagopodioides, Linn. Burm. Fl. Ind. t. 12. fig. 2. Given as common on sandy ground near the sea. Specimens sent by E. Wytealingam from Mullaitivu.\n\nDactylis glomerata, Linn. is said to occur at Nuwara Eliya, but has no doubt been introduced. I found Anthoxanthum odoratum, L. also in the Nuwara Eliya plain in 1879.\n\n187. *Lophatherum gracile*, Brongn. L. Lehmanni, N. ab\nEs. This is a tall broad-leaved grass, with panicles from one to two feet long, having long narrow divisions and spicules. It is quite common in the edges of jungle near Colombo, and elsewhere in the Western Province.\n\n188. *Elytrophorus articulatus*, Beauv. *Dactylis spicata*, Willd. This is a very common plant in rice fields and looks a good deal like one of the Setarias at a distance.\n\n189. *Tripogon zeylanicus*, N. ab Es. Found in the more elevated parts of the Central Province. I have seen only a dried specimen of this plant.\n\n190. *Centotheca lappacea*, Desv. *Cenchrus lappaceus*, Linn. *Melica diandra*, Rox. Fl. Ind. 1, p. 327. *Poa malabarica*, Burm. Fl. Ind. t. 11. fig. 2. but not of Linneus, which is *Panicum nodosum*. There are several other synonyms given for this plant in Kunth, Eu. 1, p. 366. This is a very abundant grass in the same places as *Lophatherum gracile*. It is a native of a great part of Asia, of some of the South Sea Islands, and of Australia. Plants of it growing near Colombo have their flower-spikes often metamorphosed into leaves.\n\n191. *Brachypodium sylvaticum*, R. and S. B. Nepalense, N. ab Es. Found in the more elevated parts of the Island. \"In woods, hedges, and thickets throughout Europe and Central and Russian Asia, except the extreme north; common in England and Ireland; more scarce in the Scotch Highlands.\" Bentham's Handbook of the British Flora, p. 987.\n\n192. *Streptogyne crinita*, Beauv. Found in the Matale district by the late Dr. Gardner. I have seen only a dried specimen of it. Dr. Trimen states that it is found in the forest at the Henaratgoda gardens.\n\nFor a more complete list of the following bamboos, indigenous and introduced, than I possessed, I am indebted to Mr. Morris.\n193. **Arundinaria debilis**, Thw. En. p. 375. C. P. 1. Munro in Trans. Linn. Soc. vol. 16. p. 24. Beddome's Forrester's Manual of Botany, p. 230. This is a well known plant at Nuwara Eliya where its foliage is used as a fodder for horses. \"The length of the glumes at once distinguishes this from *A. distans*, which in some respects it approaches.\" Munro, l. c. The culms of this species are much elongated.\n\n194. **Arundinaria floribunda**, Thw. l. c. C. P. 2,624. Munro, l. c. p. 20. Beddome, l. c. An erect shrubby reed, with culms from two to five feet high. It is given as found at Maturata, but specimens found by me on the Wattakelle hill many years ago are very much like this one, and I think they are the same.\n\n\"This approaches very closely indeed to *A. Wightiana*, and has the same habit of growth. It is most easily distinguished by the generally adpressed branches of the panicle, and the much longer, almost silky pubescent spiculae, containing generally six to eight flowers.\" Munro, l. c.\n\n195. **Arundinaria Walkeriana**, Munro, l. c. p. 21. Beddome, l. c. Ceylon, Mrs. Walker No. 96, 1,304, J. Watson, 215, Adam's Peak, Pedrotalagalla, C. P. 3,860. *A. Wightiana*, Thwaites, En. p. 444. not N. ab Es.\n\n\"The thickened cartilaginous margins of the leaves distinguish this from all the species previously described.\"—Munro.\n\n196. **Arundinaria densifolia**, Munro, l. c. 32, C. P. 3,956. Horton Plains and Pedrotalagalla, Thwaites. Watson No. 25. I found this small stiff plant growing in a swamp close to the residence of the Assistant Government Agent in Nuwara Eliya in April, 1879, but not in flower.\n\n197. **Bambusa vulgaris**, Wendl. Collect. Pl. ii. 26, t. xlvii had (1810). B. Thouarsii, Kth. Thw. Enum. p. 375, C. P. 3,252. B. surinamensis, Rupr. B. Sieberi, Griseb. B. arundinacea, Moon's Cat. Ceylon Pl. p. 26, and of others, but\nnot of Retz. B. auriculata, Kurz. Nastus Thouarsii, and N. viviparus, Rasp. Arundo. Linn. in Hort. Cliff. 25, and Flora Zeylanica No. 47. General Munro's Monograph, Lin. Soc.'s Tr. vol. 26, pp. 106-108. Una-lee, or Una-gas of the Sinhalese. The Kaha-una-lee is the yellow-stemmed variety, and the Nil-una-lee is the green-stemmed variety. Both varieties are very common in most parts of Ceylon, and especially on the banks of the principal rivers up to 2,000 feet. It is greatly cultivated as a useful and ornamental plant, and is well known to the natives and Europeans as our most common bamboo.\n\n\"The geographical distribution of the bamboo is very interesting. One species only, under the several names of Bambusa vulgaris, B. Thouarsii, B. surinamensis, and B. Sieberi, is found in both Hemispheres; and I am in considerable doubt as to which it is a native of. I have seen it collected by Wallich in Silhet, by Hooker in Chittagong, but marked by both as cultivated; from Ceylon, apparently wild; from Mauritius, I think, cultivated; abundantly from the West Indies, naturalized; and, cultivated, from several parts of South America. This is the only thoroughly cosmopolitan species, and is to be seen in great perfection near the centre staircase in the Palm-house at Kew.\"—General Munro's Monograph, p. 7. \"The numerous specimens which I have seen of this plant have enabled me to ascertain that the large number of synonyms quoted above all belong to one species, which, indeed, considering its wide range, appears to vary less than many other species. The most remarkable varieties occur in plants cultivated in the gardens of Europe, two of which (one from the garden at Paris, and one from that at Gottingen) are figured under the name B. Thouarsii by Kunth. in plates 73 and 74 of his magnificent work on the Gramineae. The native country of this species is still doubtful: it is certainly naturalized in many places; but there is no reliable information as to\nits being actually indigenous anywhere, either in the east or in the west. It is, when in flower, readily distinguished from all other species, it being the only one with oblong compressed spiculae, the lower paleae of which are not considerably enlarged at the base, combined with a long slender style divided into stigmas at the extreme end, and stamens free at their base.” —Munro l. c. p. 108. This bamboo in Ceylon takes the place of the large B. arundinacea in India, and is universally used for scaffoldings, fences, and constructing temporary huts. Large quantities of its stems are brought down the Ceylon rivers as rafts, on which to float firewood and timber. This bamboo is so constantly thinned out that it very seldom flowers in Ceylon.\n\n198. Bambusa spinosa, Pox. Hort. Beng. 25. (1814) Fl. Ind. ii., p. 198. Munro. l. c. pp. 104–5. Arundo indica arborea, Burman, Theas. Zeyl. 35. B. arundinacea, Thw. En. Pl. Zeyl. 373. C. P. 3,320. Moon’s Cat. 26., not of Retz. This is the Katu-una-lee, or thorny bamboo of the Sinhalese. I have seen it several times in flower near Gampola, at Lady Horton’s Walk, Kandy, and other parts of Ceylon. It does not seem to be such a common one as B. vulgaris.\n\n“Culms not so hollow as in B. arundinacea, Retz, densely cespitose 30 to 50 feet high or even more; spines at the joints and very generally present throughout the whole plant, triple, the middle one the largest and often compound, all more or less re-curved very strong and sharp, sometimes one or two absent.”\n\n“This species is found on the mountains on the northeastern side of our Presidency and also in Ceylon, but I have not seen it in our western forests; it is best distinguished from B. arundinacea in having a paler coloured, more striated panicle, smaller and more coriaceous spiculae, and fewer flowers, generally smaller leaves which are often hairy on the outside, and with the petioles sometimes much swoollen at the base.” —Beddome Flora Syl. Anal. Gen., 131–2.\n\"Thwaites mentions that the seed of this species is eaten in Ceylon; and it was probably this species which is referred to in page 4 as having flowered so providentially in India in 1866. The magistrate states: \"It was the wild thorny kind only which had flowered.\"—Munro l. c. 105. It was more likely to have been the B. arundinacea which was referred to, as it is also spiny. \"This beautiful, middling-sized, very elegant species I have only found in the vicinity of Calcutta, where now and then some of the oldest are found to blossom about the beginning of the rains in June. Like the other species, this is employed for various useful purposes; and as it grows to a pretty large size, and with a smaller cavity than any of the others, it is strong and well adapted for a variety of uses.\"—Roxburgh l. c.\n\n199. *Bambusa nana*, Roxb. Hort. Beng. 25. (1814) Fl. Ind. ii., 199. Munro., l. c. 89. Moon Cat. 29. C. P. 4,022. B. glauca, Loddige, &c., B. floribunda Zoll. B. caesia, Sieb. et Zucc. B. glaucescens, Sieb. B. sterilis, Kurz. Arundinaria glaucescens, Pal. de Bearvu, and several other synonyms. See Panicum ovalifolium, for note on Panicum arborescens, &c. This is the dwarf or Chinese bamboo now naturalized in Ceylon. It grows in dense entangled tufts, and is a very handsome plant. It is supposed that the Chinese umbrella handles are made from the culms of this bamboo.\n\n\"While these pages were passing through the press, I received some flowering specimens of this plant from Mr. Thwaites, which have enabled me to ascertain that the opinions which I have long entertained, as stated above at p. 22 regarding the identity of *B. nana* and *Arundinaria glaucescens*, are correct.\" ** \"Thwaites says in a note attached to the specimen: 'Flowers usually imperfect; I can see no ripe seeds forming.' 'It is very closely allied to *B. tulda*.'—Munro l. c. 90-1. 'It is the Keu-fa of the Chinese. It makes most beautiful close\nfences. The popular belief, that bamboos often take fire by the violence of their friction during these hot, dry months, when what is called the land wind prevails, is supported by the Sanscrit stanza, quoted by Sir William Jones (see As. Res. vol. 4, p. 254), of which the following is a copy:—Delight of the world, beloved Chandana, stay no longer in this forest which is overspread with rigid pernicious Vansas, whose hearts are unsound; who, being themselves confounded in the scorching stream of flames, kindled by their mutual attrition, will consume not their own families merely, but this whole world.” — Roxb.\n\n200. **Teinostachyum attenuatum**, Munro. l. c. 143. Beddome Fl. Syl. Anal. Gen. 234. Bambusa attenuata, Thwaites En. Pl. 375, C. P. 8,255. This is a very abundant bamboo in the Central Province, from 4,000 to 6,000 feet elevation. It is from 15 to 25 feet high, and from half to one inch in diameter, unarmed. It is extensively used for making baskets and other purposes on the higher estates in Dimbula. Found in flower and fruit in the jungle near Upper Abbotsford in May 1879, and in January and February, 1880.\n\n201. **Oxytenanthera thwaitesii**, Munro. l. c. 129. Beddome Fl. Syl. t. 322. Anal. Gen. 232. Dendrocalamus monadelphus, Thw. En. 376. C. P. 3,359. Bambusa stricta, Roxb. Cor. Pl. t. 80, as far as the plate is concerned, but not the description.\n\n“This is a very straggling, unarmed, subscandent, weak reed with culms from 10 to 20 feet long, hollow, and 1 to 1¼ inch in diameter, ‘very common on the Anamallays, 3,500 to 6,000 feet elevation, called Watte; the hill-men use the leaves for thatching; it is also found in many other localities in and on the outskirts of moist woods along the Western Ghauts, and is very common in the central parts of Ceylon at the same elevations.” — Beddome l. c.\n\"Roxburgh's drawing in the 'Plants of the Coast of Coromandel' was undoubtedly taken from a plant of this species; but the description, with which the drawing does not agree, was probably written at a later date, and is very nearly in the same words as those used in the 'Flora Indica,' ii. 193, for the real *Dendrocalamus strictus*. I have been unwilling to change Thwaites's specific name for this plant; but as the whole genus have monadelphous stamens, it was no longer a distinctive one, and I have therefore named it after the excellent Botanist who first described the plant correctly.\"—Munro. l. c. 130. I found this bamboo in abundant flower many years ago in the jungle above Maussakelle, in the Kelebokka district. This and the Male Bamboo have a great resemblance to each other when in flower.\n\n202. **Beesha stridula**, Munro, l. c. 145. Ochlandra stridula, Thwaites l. c. 376, C. P. 241. Bambusa stridula, Moon, Cat. 26 (1824.)\n\nThis is one of the most abundant and most useful plants in very large tracts of the Western and Southern Provinces of Ceylon, from the coast up to a considerable elevation. It is the well-known *Bata-lee* of the Sinhalese, and any one having occasion to walk through jungles of it will soon understand the meaning of Moon's specific name; the prostrate culms on which travellers or elephants tread, split with a peculiar \"crackling\" sound, and it is most difficult to get through it without thus warning game of the hunter's approach. Its culms are from 6 to 18 feet high, and are used very extensively for making fences, &c., split up for tats, and for the roofs of temporary huts, the leaves being used extensively for thatching the same. Vast jungles of this small bamboo extend from Colombo in the direction of Hanwella, Avisawella, and Ratoapura, and inland from Kalutara. It is now in flower,—March, 1880.\n203. **Uniola mucronata**, Linn. Sp. Plant. 104. *Triticum repens*, Thwaites En. p. 376, C. P. 924, but not of Linneus. In a letter from the late Gen. Sir William Munro, he told me that the above C. P. No. was not *Triticum repens* L. The specimens of this grass were found by the late Dr. Gardner in the north of the Island.\n\nThe following introduced Bamboos, and other grasses, are given from a list sent to me by Mr. D. Morris and from his Catalogue of Plants growing in the Royal Botanical Gardens, Peradeniya, pp. 38-9.\n\n204. **Bambusa blumeana**, R. and S. Dawson’s prickly bamboo. Native of Java, Munro, Mon. 101.\n\n205. **Bambusa arundinacea**, Retz. This is called the Calcutta bamboo in Mr. Morris’s list. “The largest and most important of our bamboos is found throughout the Madras Presidency, and grows to 80 feet high, with its culms up to six or even eight inches in diameter. It is a most valuable product, and yields a very considerable revenue to the Forest Department, being in universal use for building purposes, timber rafts, scaffoldings, fencing, trellis-work, furniture, fishing-rods, ladders, mats, baskets, window-blinds, and many other purposes; and when it seeds the bamboo-rice (as the natives call the seed) feeds thousands of poor people; the leaves are good fodder, and the young shoots are made into preserves and pickles, and are the most favourite food of elephants. This species is absent from Ceylon, where its place is taken by B. vulgaris.”—Beddome’s Foresters’ Manual, p. 229. Flora Sylvatica, t. 321.\n\n“The hard, polished, yellowish, smooth, spinous branches of the panicle, best distinguished this from B. orientalis. I\npresume that this is the species referred to at p. 4, as having in 1864 furnished, during one of its periodical flowerings, food to upwards of 50,000 persons in Canara.”—Munro, Mon. p. 104. This bamboo is well known to die down when it flowers. Its seeds are in size and appearance very like grains of oats. I have several plants of this bamboo growing in the Circular Walk, Colombo, from seed introduced by Mr. A. M. Ferguson from Southern India. He also freely distributed seed to various parts of the interior, where it seems to grow well.\n\n206. Bambusa orientalis, Nees. Sub-solid bamboo. Found at Quilon and on the Nilgiris.\n\n207. Bambusa Rumphiaana, Kurz. Large-leaved bamboo. Java. I have seen no description of this bamboo.\n\n208. Dendrocalamus strictus, Nees. Bambusa stricta, Rox. Fl. Ind. 2, 193. “This is the male bamboo, with nearly solid stems, and much in use for spear-shafts, building purposes, and many other uses; it is very general throughout the Madras Presidency on the dry slopes of the mountains up to 3,000 feet elevation, and is common in Bombay, Bengal, and Burmah, but absent from Ceylon (except in a cultivated state), and it extends to Singapore and Java. It flowers frequently, I believe every year, and does not die down after flowering.”—Bedd. l. c. p. 235, Fl. Syl. t. 325. The plants in the Circular Walk, raised from seed received from Mr. Robert Dawson, as those of the “male bamboo” grow in very dense entangled masses, with spreading, somewhat drooping, graceful branches, which are decidedly thorny, and otherwise do not agree with the description given by Beddome—viz., “Culms unarmed, arboreous up to 40–50 feet high.”\n\n209. Dendrocalamus giganteus, Munro, Mon. p. 150. Giant bamboo. Native of Pulo Penang and Tenasserim. A few plants of this bamboo grow in Colombo and elsewhere in\nCeylon, but those in the Royal Botanic Gardens at Peradeniya on the banks of the river are truly gigantic. The culms are said to grow to 12 inches in diameter, and are used for buckets, flower-pots, &c.\n\n210. *Gigantochloa aspera*, Kurz. Java building bamboo. I have seen no description of this bamboo. The following note by Sir W. Munro on G. atter, Kurz., Mon. p. 125, may refer to this one:—\"Kurz. in his notes, identified this species with B. aspera and B. Bitung, Roem. and Sch., but the latter is described as having much longer, and the former much more glabrous leaves.\"\n\n211. *Beesha Rheedii*, Kunth. Rheede Hort. Mal. V. 119, t. 60:—Rata-bata gaha, Sinhalese. Cochin thatching bamboo. Native of Malabar and Cochin. I have only seen the plants of this small bamboo which are growing in the Peradeniya Gardens.\n\n212. *Beesha travancorica*, Bedd. Mon. p. 234. \"This magnificent species is most abundant on the South Travancore and South Tinnivelly mountains, 3,000—5,500 feet elevation, where it covers many miles of the mountains, often to the entire exclusion of all other vegetation; in open mountain tracts it generally only grows to 6–8 feet in height, but most close and impenetrable, elephants even not attempting to get through it; inside sholas and their outskirts it grows to 15 feet high, and is much more straggling. It is called Irul by all the natives, and by Europeans the Elephant grass, Bedd. l, c. Fl. Syl. t. 324. This evidently takes the same place in Travancore and Tinnivelly that our bata-lee does in Ceylon.\n\n213. *Panicum acariferum*, Trin. l. c. t. 87. Thysanolaena acarifera, Arn. and Nees. Melica latifolia, Rox. Fl. Ind. 1, 328. Agrostis maxima, Rox. l. c. 317. Rata-go-tana, Sinhalese, Moon Cat. 8. Introduced from Bengal before 1824. I have never seen this elegant and gigantic grass grown anywhere in Ceylon except in the Peradeniya Gardens.\n214. *Androscebia gigantea*, Brong. Anthistiria gigantea, Cav. Said to be a native of Luzon, Amboina, and Java. It was grown some years ago at the Model Farm, Colombo, and grew to a height of 7 to 8 feet, but it has disappeared from this place, and though cultivated in a few places in Ceylon as a fodder grass, it does not seem to answer well compared to the Guinea and Mauritius grasses.\n\n215. *Euchlæna (Reana) luxurians*, called Téosinte. This is a newly introduced fodder grass and grows readily and to a great height, but dies down as soon as it seeds, and I fear is not an economical fodder grass for Ceylon.\n\n216. *Gynerium argenteum*, Nees. Pampas grass. This grass was introduced some years ago to Ceylon, but I fear it has not succeeded as a fodder for cattle.\n\n217. *Sorghum vulgare*, Pers. Holcus Sorghum, Linn. Andropogon Sorghum. Brot. Indian millet, Karal-iringu, Sinhalese. Sorghum saccharatum, Per. Idal-iringu, Sinhalese, and several other varieties of Sorghum have been cultivated in Ceylon for many years, and grow to a height of 10 to 20 feet. In various parts of India it is considered one of the best fodder plants, but in Ceylon I am not aware that the culms are used as such. It has the following Indian names:—Cholom, Tamil; Jowar, Hind.; Janoo, Tel.; and the Durra of Africa. From the Supplement to *Ceylon Observer* of 19th July, 1879, I take the following extract:\n\n\"Cholam or big millet, *Holcus Surgham*, is the principal food grain in Nellore, Bellary and Kurnool. The proportion of dry cultivation devoted to it is one-half in these districts, and one-third in Cuddapah, Coimbatore and Madura; but it is very little used in Chingleput, North Arcot, and Salem.\n\n\"It is also largely cultivated in other parts of Asia as well as in Europe, Africa, and America. There are several varieties of cholam differing in size and in colour. Like raggi it is said to produce about...\"\none-hundred-fold; and the straw is considered to increase the yield of milch cows. Cholam contains 9-38 per cent. of nitrogenous matter; that is about the average in the series including this grain with wheat, rice, raggi, and cumbu. It is prepared like raggi into kul kalli or bread; and it is also cooked like rice, but the grains are not detached. The whole mass forms a cake, which is eaten with curries or other spiced preparations.\"\n\nThe following is from the Dictionary of Hygiene and Public Health, by A. Wynter Blyth and Professor Tardieu, p. 178.\n\n\"Dhurra, Dhoora, or Sorgho Grass (sorghum). Although commonly called Indian millet, it belongs to a different tribe of grasses from the true millets. Like rice, it is largely cultivated in India, Algeria, the interior of Africa, and Egypt. The seeds here are mostly used for feeding birds, but in India they are ground small and made into cakes. This bread is said to have been issued to the English troops in the last Chinese Expedition. It is described by Johnston as being equal in nutritive value to the average of our English wheats, but Letheby says that dhura is little more nutritious than rice, for it contains on an average about 9 per cent. of nitrogenous matter, with 74 of starch, sugar, 2·6 fat, and 2·5 of mineral matter.\n\n218. Zea Mays, Linn. Muwa-iringu, Sin. Mukka-Cholam, Tam. Indian Corn. Native of South America, and now cultivated as extensively as the Sorghum over various parts of the globe.\n\nIndian Corn from Dictionary of Hygiene, and Public Health, by A. Wynter Blyth and Professor Tardieu, pp. 310-11.\n\n\"Indian corn is largely eaten all over the world, but more especially in tropical countries.\n\n\"The ration for a Kafir servant is 3 pints of Indian-corn meal per day, and on this scanty allowance—for he gets little else—he manages to keep in good health. Indian corn has since 1846—the potato-famine year—been largely used in Ireland. It is stirred into\nboiling water or boiling milk, and formed into a sort of hasty pudding or thick porridge, and thus eaten.\n\n\"Throughout Mexico it forms the staple food, and is cooked by baking into cakes.\n\n\"Indian-corn, being deficient in gluten, does not make good bread. Its flavour is harsh and peculiar. A weak solution of caustic potash removes this unpleasantness; but it also deprives it of much of its nitrogenous matter, and so renders it less nutritious than before. This is the foundation of the process for preparing the articles extensively sold under the names of Oswego, Maizena, and Corn-flour.\n\n\"As a mere adjuvant, or auxiliary, prepared Indian-corn may be of value, but mothers and nurses should be earnestly cautioned against injudiciously giving it to infants.\n\nThe following poetical account of the origin of Indian-corn, from Longfellow's Hiawatha, reminds me of the origin of the Palmyrah Palm, as recorded in a Tamil poem called the Tala Vilasam, where it is stated that after Bramah created man Vishnu asked why he did not provide food for him. On this Bramah trembled like a drop of water on the top of a lotus leaf, put his finger on his chin, and created the \"Calpa tree,\" which supplied all the wants of man; and hence the origin of the Palmyra Palm!\n\n*From Hiawatha, pp. 373-6.*\n\n\"Till at length a small green feather\nFrom the earth shot slowly upward,\nThen another and another,\nAnd before the summer ended\nStood the maize in all its beauty,\nWith its shining robes about it,\nAnd its long, soft, yellow tresses!\nAnd in rapture Hiawatha\nCried aloud, \"It is Mondamin!\nYes; the friend of man, Mondamin!\"\nThen he called to old Nokonis\nAnd Iagoo, the great boaster,\nShowed them where the maize was growing,\nTold them of his wondrous vision,\nOf his wrestling and his triumph,\nOf this new gift to the nations,\nWhich should be their food for ever.\"\nTRANSLATION OF TWO JATAKAS.\n\nBy Louis de Zoysa, Maha Mudaliyar.\n\nI have the pleasure to lay before the Society translations of two Játakas, or anterior births of Buddha.\n\nThe first of these is entitled \"Nakkhatta Játakam\" (star-birth), and exposes the folly of believing in astrology. The second is entitled \"Nama-siddhi Játakam\" (name-luck-birth), and has reference to a belief in the luck or ill-luck of a name. This superstition is still prevalent to some extent amongst the Sinhalese, who not unfrequently consult the astrologer in bestowing names on their children. This story is a curious commentary on Burn's well-known lines, \"What's in a name,\" etc.; and it will be seen that some of the expressions in the Játaka, are almost identical with those of the Poet.\n\nThe stories require no explanatory comments, and will speak for themselves. I may however state here that every Játaka consists of two parts, first the Vattamána (or the present story); and secondly, the Atita (or the past story). The former details the circumstances under which the latter was related by Buddha. I have not thought it necessary to give a full translation of \"the present story,\" as it is in these instances almost identical with the \"past story\" or the Játaka.\n\nL. DE Z.\n\nNAKKHATTA JÁTAKAM.\n\nWhen Buddha resided at Jetavana monastery, he spoke the following verse respecting an Ajivako who prevented a\nmarriage taking place on the plea that the aspect of the stars, on the day fixed for the wedding, was unpropitious:\n\n\"Nakkhattam patimáentam\nAttho bálam upaccagá,\nAttho athassa nakkhattam,\nKim karissanti tārakā.\"\n\n\"The business of the fool who observed the (astrological position of the) stars, has failed; business (i.e., doing the business well), is the star for business; what can the stars (in the sky) do?\"\n\nThe story related by Buddha in illustration of the above verse, is as follows:\n\n\"In times past, when (King) Brahmadatta reigned at Báráunasí, the inhabitants of the city betrothed a daughter of the inhabitants of the country, and having fixed a day for the celebration of the nuptials, consulted an A'jívako,* a friend of the family, (saying,) \"Sir, we have to celebrate an auspicious ceremony this day: is the (astrological) position of the stars propitious?\"\n\nThe A'jívako thought (within himself), \"These people having, of their own will, first fixed a day, now consult me!\" Being provoked (at this), and thinking (within himself), \"I will prevent their marriage,\" said, that the position of the stars on that day was bad, and that if they celebrated the nuptials on that day a great calamity would happen to them! The inhabitants of the city, believing him, did not go (to conduct the bride).\n\nThe people of the country not seeing them come, and (saying amongst themselves)—\"These people, having fixed to-day for the nuptials, have not come! Of what use are they to us?\"—gave their daughter in marriage to another. The citizens returning next day, demanded the bride. The country—\n\n* A Hindu ascetic or mendicant.\npeople replied, \"You householders of the city are shameless people. Having appointed a day (for the nuptials) you have failed to conduct the bride! On account of your not coming, we have bestowed our daughter on another.\" The citizens said, \"We did not come, as the A'jivako, whom we consulted, pronounced the position of the stars to be inauspicious,\" and with clamour said, \"Give us the bride!\" \"In consequence of your not coming,\" said the country people, \"we have given our daughter to others. How can we bring her now who has already been given to others!\" Thus, when the two parties were quarrelling amongst themselves, an inhabitant of the city, a wise man, happened to come there on account of business, and having heard the citizens say, \"We consulted the astrologer, and having found the Nakkhatta to be unlucky, we did not come,\" remarked, \"Of what use are the stars (in the conduct of human affairs)? Is not your failing to obtain the bride the result (in this instance) of your observing the stars?\" and repeated the following verse:\n\n\"The business of the fool who observed the stars has failed; the business itself is its best star. What can the stars in the sky do!\"\n\n**NÁMA-SIDDHI-JÁTAKAM.**\n\nWhen Buddha resided at the Jetavana monastery, he spoke the following verse respecting a monk who believed in the luck or ill-luck of a name:\n\n\"Jívakam ca matam disvá,\nDhanapálím ca duggatam,\nPanthakam ca vane mûlham,\nPápako punar ágamá.\"\n\n\"Having seen the Jívako (the living one) die, Dhanapálí (wealth-preserved) in poverty, Panthako (traveller) lose his way, Pápako returned back.\"\nThe following is the story related by Buddha in illustration of the above gáthá:—\"In times past, the Bodhi-satto,* being born as Disápámokkhácariyo,† at the city of Takkasilá,‡ taught the vedas to five hundred pupils, one of whom bore the name of Pápako, (sinner, unfortunate one.) Being addressed, “Come Pápaka!” “Go Pápaka!”; he thought, “My name is an unlucky one: I must obtain another name.” Having approached the master, the pupil said, “Master! My name is an unlucky one; confer on me another name!” The master replied: “Son! Go, and having roamed about the country, come back with a name that pleases thee, and on thy return I will confer on thee another name, rejecting thy present one.” The youth replying “Sádhu!” (be it so!), departed, taking with him the necessaries of a traveller. Going from village to village, he arrived at a city. There, a certain man, whose name was Jívako (lit., the living one) had died. The youth seeing the corpse being carried for cremation by his relatives, enquired of them what the name of the deceased was. Being told that it was Jívako, he remarked, “Does Jívako die?” They replied: “Thou art a fool; the Jívako (living one) dies, and so does the A-jívako (the unliving one.) A name is nothing but a mere sign. Having heard their remarks, he became (somewhat) indifferent to a name, and entered the city. A mistress was flogging her slave woman with a cord, making her sit before the door, who was unable to pay her dues, and whose name was Dhanapálí, (lit., wealth-presenter). Entering the inner, street, the youth\n\n* A being destined to attain Buddhahood. This term is applied to Buddha in his various states of existence previous to attaining Buddhahood.\n\n† The principal of a college or university.\n\n‡ The city of Takksilá in Panjab. It was a renowned university town.\nenquired, \"Why is this?\" (The people) replied, \"Because she is unable to pay her dues.\"\n\nHe enquired what her name was, and being told her name was *Dhanapāli* (wealth-presenter), he further enquired, \"Do persons who bear such names as *Dhanapāliyo* ever become so poor as to be unable to pay their dues?\" The people remarked that \"*Dhanapāliyo* (wealth-preservers) and *A-dhanapāliyo* (who do not preserve wealth) become poor, and that a name was nothing but an arbitrary (meaningless) designation.\"\n\nHe then became still more indifferent to a name, and departing from the city entered the road, and, meeting a man who had lost his way, enquired of him, why he was running about? He replied he had lost his way. The youth again enquiring what his name was, he said it was *Panthako* (traveller). \"Do Panthaká lose their way?\" asked he. \"The Panthaká lose their way as well as the *A-panthaká* (those who do not travel.) A name is nothing but an arbitrary designation. Thou seemest to be a fool\" was the reply.\n\nThe youth, then, becoming quite indifferent to a name, went back to the Bodhisatto. On his enquiring, \"Son! Have you returned having pleased yourself with a name?\" the pupil replied: \"Master, the *Jīvaká* (the living ones) die, and so do the *Ajīvaká* (lit., those who do not live); *Dhanapāliyo* become poor, and so do the *Adhanapāliyo*; the Panthaká lose their way, as well as the *Apanthaká*. A name is nothing but an arbitrary designation. There is no virtue (or efficacy) in a name (*Nāmena-siddhi n'atthi*). There is virtue (or efficacy) in Kamma only!\"\n\nThe Bodhisatto, combining what was seen and done by the youth, spoke the following verse:—[This verse is identical with that spoken by Buddha at the beginning of this Játaka.]\nON THE SUPPOSED ORIGIN OF\nTAMANA NUWARA, WHERE WIJAYO LANDED\nIN CEYLON, B.C. 543, AND HENCE\nTAPROBANE, AS THE CLASSICAL NAME\nFOR CEYLON.\n\nBY WM. FERGUSON, F.L.S.\n\nThe late accomplished Major-General Forbes, in his \"Eleven Years in Ceylon,\" 1840, 1, pp. 10–11, and note, was no doubt the first authority who correctly indicated that the district of Tamana, or Tamana Nuwara, was properly derived from the now well-known Tamana tree, bearing that name both in Sinhalese and Tamil, and that Tambapanni, Tambana, and ultimately Taprobane, originated from the name of the place where Wijayo and his followers landed in Ceylon 2,423 years ago.\n\nSir Emerson Tennent (I., p. 18, note), referring to this derivation by Forbes, states that the tree was not then (1859) known, but it had been described and figured by Dr. Thwaites in Hooker's Kew Journal of Botany for 1854, p. 299, t. 10 B., as *Mischodon Zeylanicus*, Thw., a new genus of Euphorbiaceae; and is well represented by Col. Beddome in his Flora Sylvatica, tab. 290; and in my \"List of Ceylon Timber Trees,\" published in Ferguson's Directory for 1863, p. 248, I allude to this tree as follows: \"A very handsome tree, having excellent timber, and widely spread in the Island, found at Hantane near Kandy, Uma-oya, Lower Badulla road, within ten miles of Colombo, and abundant from Puttalam to Anuradhapura, northwards and eastwards.\"\nNot doubting but this is the Tamana tree referred to by Forbes, it will be found to be a historical tree only second in importance to the famous Bo-tree of Anuradhapura, whose continuous history Sir Emerson Tennent has traced for upwards of 2,000 years.\n\nThe Tamana tree when in young foliage is more remarkable for its brilliant red color than even the Ironwood (Mesua), Cinnamon, and other red-leaved plants of Ceylon, and is a very beautiful object with its long young leaves drooping from the ends of the branches.\n\nI append a list of authorities on the subject of the origin and derivation of Tamana Nuwara, Tambapanni, Taprobane; and references to the Tamana tree.\n\nList of references to Authors who have written on the derivation of the different names supposed to be the origin of Taprobane as the classical name for Ceylon.\n\nTurner in Mahawanso, appendix p. lx., lxi., Index and Glossary, p. 25, Text pp. 47, 50, and 53.\nEmerson Tennent’s History of Ceylon, I., p. 8, 17, 18 and note, 330, 368, 525, and notes, &c.\nUpham’s Mahawanso, 1, p. 70.\nThwaites’ En. Pl. Zeyl., 428 and 275.\nPridham’s Ceylon, 1. p. 2.\nSkeen’s Adam’s Peak, p. 82.\nLassen De Taprobane, &c., p. 8.\nForbes’ Eleven Years in Ceylon, 1, pp. 10—11.\nCassie Chetty’s Gazetteer, pp. 30, 60, 195, 208.\nBeddome’s Flora Sylvatica, Pl. 290.\nBrodie in Journal R. A. S. (Ceylon Branch) for 1853-8.\nDitto on the District of Nuwarakalawiya, l. c. 1856-8, p. 171 l. c. 155.\nCassie Chetty's Journal R. A. S. for 1841, vol. VI., p. 242.\nAs. Re. London Edition, vol. 7, pp. 49 and note, 51.\nBalfour's 2nd Supplement to Cyclopædia of India, p. 215.\nJournal R. A. S. of Gt. Britain and Ireland, vol. 18, p. 350.\nCassie Chetty, 6. p. 242.\nBurnouf on Ceylon, pp. 19 to 50.\nPriaulx O. D. B., Journal R. A. S., Gt. Britain and Ireland,\nvol. 18, pp. 345 and 352, l. c. v. 19. p. 274; vol. 20, p. 269.\nTHE ROCKS AND MINERALS OF CEYLON.\n\nBy A. C. DIXON, B.Sc. (Honors) London.\n\nThe science of Geology divides itself naturally into three departments:\n\n(a) — The study of rocks, or Petrology.\n(b) — The study of the minerals of which rocks are composed, or Mineralogy.\n(c) — The study of the remains of animal and vegetable life contained in the rocks, or Palaeontology.\n\nTo the one who makes this last division his object of research there is but a poor field before him in Ceylon, save in the north of the Island; but for the one interested in rocks and their component minerals, there is plenty of scope for research. Geological time is divisible into three great periods separated by great breaks in time, but this cannot really be the case, for, as nations have sprung up and passed away gradually, so also have formations. These have always been and will be continuous. Although in England we have great gaps separating one formation from another, yet we have beds of passage in several parts of the world, which bridge over these gaps and so form a connecting link.\n\nThe three great epochs of geological time are the Palaeozoic or old life period, the Mesozoic or middle life, and the Cainozoic or recent life.\n\nEach of these has numerous divisions. The bulk of this Island consists of ancient sedimentary beds; whether deposited\nin sea or lake, we are unable to say, for the metamorphism which these beds have undergone (due to internal heat, pressure, time and various other causes) has obliterated all traces of fossil remains. Over this gneiss around Colombo and in many other parts of the island, we have the well-known laterite or cabook, so largely used for building purposes. This formation has given rise to much discussion. It is essentially a derivative from the gneiss; and, beyond doubt, in many cases in situ, as is evident in several cuttings which have been made, a notable one, which I visited some time ago, occurring in a cutting made while searching for plumbago between Polgahawela and Ambepussa.\n\nIn many ravines in the hill districts of the Island, especially in Dimbula and Dikoya, we have an iron conglomerate at present in course of formation, composed of the debris of surrounding rocks, firmly held together by ferruginous matter, which rock, when subjected to decay, would furnish a formation exactly akin to our laterite. I have dealt with this subject (Laterite) at greater length in a paper to the Royal Academy of Sciences, Sweden.\n\nIn the north of the Island we have a formation of the Mesozoic, or secondary period, viz., the Cretaceous. These beds are no doubt cotemporaneous with the Pondicherry beds, which have yielded numerous fossils, by which their age has been determined. I have no doubt that many fossils might be gathered in our Northern Province by those interested in Palaeontology. Once, it is recorded, this Society possessed in its Museum a fossil phalange from this district, but it has been lost.\n\nOf recent formations, we have on the sea coast between Negombo and Mount Lavinia, and for some distance beyond these places, a recent breccia formed of particles of disintegrated rock, more or less compact. At Talpitiya it occurs at a considerable distance from shore (300 yards), and at a depth of\ntwenty-five feet. Numerous minute shells and fragments of shells occur in this. At Pamunugama, on the way to Negombo, the sandstone varies much. In some cases it is black-banded, with particles of magnetic iron; in others the particles of iron are evenly distributed throughout the mass. The nature of the cement which binds these particles together is carbonate of lime.\n\nCalcareous Tufa, still in the course of formation, is a deposit from the hot-water springs of Bintenna, the water of which is highly charged with carbonate of lime, which is deposited as the water cools. It is known as Pennagal by the Sinhalese, and is burnt and used by them along with their betel.\n\nThe foregoing formations are indicated on the accompanying rough geological sketch map.\n\nI will now consider more particularly the gneiss, which is our most extensive formation. It varies much in texture, color, composition, hardness, &c.\n\nIts composition is the same as granite, only the degree of metamorphism has not been so great as to entitle it fully to that name.\n\nIt is composed of quartz—felspar (both orthoclase and oligoclase)—muscovite and biotite (micas), hornblende, chlorite, and numerous accidental minerals in varying proportions.\n\nIn some localities we find a rock composed of only one of these, as in the case of hornblende rock; at other times only felspar, but generally the foregoing components are mingled together in varying proportions, giving a large number of different kinds of rock.\n\nOrthoclase forms the main mass. The two felspars are easily distinguished on a weathered surface. The orthoclase is glossy and somewhat pearly in lustre, and has a translucent aspect, while the oligoclase is dull and opaque.\n\nIn the gneiss we meet with various beds as limestone,\ndolomite, magnetite, quartz, hornblende, tremolite, mica, epidote. Some of these occur, also, as veins in the gneiss.\n\nIn the veins we have the minerals, actinolite, tremolite, jade, talc, muscovite, biotite, epidote, schorl, and many others of minor importance.\n\nActinolite is found in the Kotagala district. Good specimens of crystalline talc are obtainable from Mahara quarry and neighbourhood.\n\nThe gneiss in some cases almost passes into syenite. Where the felspar is flesh colored, this rock much resembles Peterhead granite. Porphyritic gneiss occurs on the hill ranges not far from Henaratgoda.\n\nAt Balangoda we meet with a crude jasper, and not far from the same locality a large mass of graphic granite in which the quartz is distributed in bands, and when viewed endwise much resembles an inscription.\n\nWhen subject to action of water the felspar of the gneiss soon decomposes, and so a large number of decomposed forms are very abundant. As the Island is gradually uprising it is evident that the less elevated portions have been under the influence of water for a longer period, and, consequently, the cuttings through such are less difficult than similar ones in the more elevated portions. Another peculiarity of the gneiss is the occurrence of garnets in large quantity.\n\nDolomite beds. As far as I have been able to trace during the time at my disposal, I find that these beds run through the gneiss in a somewhat parallel direction, striking generally N.W. by N. to N., and having various angles of dip. from $10^\\circ$ to $40^\\circ$.\n\nI have indicated their position on the map. The first is one which outcrops a few miles this side of Balangoda, and runs N.N.W., occurring again at Hunuwala.\n\nThe second runs through Dolosbage and Maskeliya: probably the bed occurring at Bilhul-oya is continuous with this,\nThe third outcrops under the Great Western on the Great Western estate, and is continuous to the N.N.W. with the Wattegoda and Medakumbura dolomites, and probably also with the beds at Gampola and Kurunegala. A subsidiary bed—or it may be an outlier of this—occurs near the Pussellawa rest-house.\n\nThe fourth bed outcrops largely at Wilson’s Bungalow, Glen Devon, Dumbara, and Matale.\n\nThe fifth occurs in the Badulla district. As in the gneiss we have a great many varieties, so also in the dolomites. They all contain carbonate of magnesia, which varies from 1 to over 40 per cent.\n\nThese limestones are very valuable for estate purposes as well as for building stone and building lime.\n\nIn colour they vary much, dependent on the numerous accidental minerals that occur along with them. Thus the specimens from Wilson’s Bungalow are very dark: they contain pyrites, phlogopite, chlorite, epidote, &c.\n\nA dolomite occurring at Wariapola on the Matale railway contains a large amount of blue spinel. Some of the crystals of these dolomites have large facets, others small and of a granular texture. Many contain white translucent siliceous grains not easily distinguished.\n\nA beautiful example of limestone of a somewhat peculiar tinge, due to the metal chromium, occurs beyond Balangoda, and often contains fine specimens of crystalline biotite—a magnesian imica. This limestone shews a very peculiar and characteristic weathered surface.\n\n*Plumbago* is found in several localities, as at Kurunegala, Kegalla and Nambapana. In the Balangoda district we have the metal Molybdenium, so useful in chemical researches; and black oxide of Manganese from Ratnapura and neighbourhood.\n\nVarious forms of iron occur in the gneiss, thus iron pyrites.\nMagnetite, a very highly magnetic iron ore, is found in the Pussellawa district with a peculiar cleavage and fracture. Botryoidal limonite, an oxide of iron found under the cinnamon sand near Negombo. Haematite occurs in other parts of the island.\n\nTraces of gold and platinum I have met with in the Ramboda and Kurunegala districts. Extensive beds of quartz occur in the Pussellawa district, which is not much unlike the reef-bearing quartz of the Wynaad.\n\nIn some localities the felspar of the gneiss is much decomposed and forms large masses of kaolin (kirimetí of the Sinhalese), occurring largely in the Nuwara Eliya and Maturata districts. This is capable of being made into a very fair porcelain.\n\nLarge masses of Alluvium occur on the Nuwara Eliya plain, and shew us the remains of the surrounding hills, deposited no doubt in a former lake.\n\nIn the alluvium of many of our river basins, notably at Ratnapura, we have numerous minerals—the gems for which this town is so noted. I will briefly notice some which I have gathered there.\n\nFirst, I will deal with the Corundum or Sapphire family, which crystallizes in the hexagonal system. If a stone of this family lacks transparency and is dull, we call it corundum: it is useful as a powder (emery) for cutting other stones. If of a rich blue color it is called sapphire; of white, white sapphire; red, ruby; purple, the oriental amethyst; of yellow, the oriental topaz; of green, the oriental emerald.\n\nSome of the sapphires are partly blue and partly white. The Sinhalese can, by heating these in a certain manner, distribute the color evenly, or by greater heat can discharge the color and so pass them off as white sapphires. The specific gravity of such, however, is diminished. Many other stones, as the\nzircon, are treated in a similar manner. A good test for a sapphire is, that in a dark room or closet, with the light of a match or candle, it should appear equally rich in color as in ordinary light. Sapphires are lamellar in structure, and so, on being cut of a convex form, we have the appearance of a six-rayed star.\n\nSpinel. Another mineral abundant in Ceylon crystallizes in the cubic system generally in octohedrons or rhombic dodecahedrons. In color this mineral varies much; red, however, is very common, and it is sometimes sold as ruby. The specific gravity of spinel is about $3.5$, while ruby is $4$ and garnet $3.8$.\n\nGreen spinel is occasionally met with at Ratnapura and in the Kandy district.\n\nGarnet, of various kinds, is found in Ceylon both in the metamorphic rock as well as in the alluvium. This is usually of a red color, and crystallizes in the cubic system.\n\nCinnamon stone (essonite) is a kind of garnet found largely at Matara.\n\nZircon crystallizes in the tetragonal system, and is found of many colours. Several varieties are disregarded by the Sinhalese; others are used, notably the white zircon, otherwise known as the Matara diamond. Quartz is often cut and sold as Matara diamond.\n\nChrysoberyl belongs to the rhombic system of crystals, and when cut encabochon furnishes the true cat’s-eye.\n\nTourmaline (S Toramalli) crystallizes in the hexagonal system, generally in prisms with dissimilar ends. In color it varies much; thus, we have black, green, brown, yellow, &c.\n\nThe Peridot of Ceylon is yellow tourmaline. The natural crystals shew a fine striation on their long sides.\n\nMoonstone or adularia is a felspar with a pearly appearance. Quartz and selenite are often sold under the same name.\n\nRock Crystal crystallizing in the same system as the\nsapphire, and is very abundant at Ratnapura, Balangoda and many other localities.\n\nSPECIMENS EXHIBITED, ILLUSTRATING THE PAPER READ.\n\n1 Gneiss—with large flesh-colored crystal of felspar. Balangoda.\n2 Gneiss—with molybedenium from Petiagalla.\n3 Gneiss—with iron garnets. Kotagalla.\n4 Gneiss—with ordinary garnet. Madola, Sabaragamuwa.\n5 Gneiss—with quartz crystal, epidote, &c. Mahara.\n6 Epidote and black mica. Ythanside, Dimbula.\n7 Gneiss from under gem-pits. Ratnapura.\n8 Gneiss with epidote. Ramboda.\n9 Hornblende pebble. Madola.\n10 Graphic granite. Balangoda.\n11 Crude jasper. Balangoda.\n12 Gneiss—decomposed. Abbotsford, Dimbula.\n13 Gneiss—decomposed, with epidote, chlorite, &c. Balangoda.\n14 Quartz—with plumbago. Diatura, Kurunegala.\n15 Hornblende (crystalline.) Matale Railway.\n16 Mica—pebble. Dimbula.\n17 Mica—from cabook. Welikada, Colombo.\n18 Mica—much decomposed. Ratnapura.\n19 Iron conglomerate. From ravines, Dimbula.\n20 Iron ore. Dimbula.\n21 Decomposed gneiss from a slip on Matale railway, shewing the nature of \"slickensides.\"\n22 Magnetite. Harmony estate, Pussellawa.\n23 Cabook. Colombo.\n24 Limonite (botryoidal). Negombo.\n25 Dolomite, with large crystal of mica. Nonpareil, Bilhuloya.\n26 Dolomite, with epidote, &c. Aluwihara, Matale.\n27 Dolomite, with pyrites and other crystals. Kurunegala.\n28 Dolomite, with garnets, epidote, mica. Wilson’s Bungalow.\n29 Dolomite, with blue spinel, iron, mica. Wariapola, Matale.\n30 Dolomite, very compact. Wilson’s Bungalow.\n31 Dolomite, with black weathered surface. Wattegoda, Dimbula.\n32 Dolomite, large yellow free crystals. Kurunegala.\n33 Dolomite with curious weathered surface and containing mica, iron, plumbago, quartz, &c. Balangoda.\n34 Dolomite, very impure, abounding in quartz and shewing a peculiar weathering. Great Western, Dimbula.\n35 Kaolin, red, impure. Maturata.\n36 Kaolin, white, very pure. Nuwara Eliya.\n37 Manganese (black oxide). Ratnapura.\n38 Iron, pyrites. Mahara.\n39 Felspar, decomposing. Nuwara Eliya.\n40 Labradorite. Mahara Quarry.\n41 Rock crystal, smoky. Nuwara Eliya.\n42 Rock crystal, white pebble. Ratnapura.\n43 Sandstone with numerous shells. Talpitiya.\n44 Sandstone with magnetic iron in bands. Pamunugama.\n45 Sandstone with iron evenly distributed. Pamunagama.\n46 Sandstone, very dark. Pamunugama.\n47 Limestone from Jaffna (Cretaceous.)\n48 Quartz (vein). Balangoda.\n49 Gneiss with silvery mica, green, blue, and red sapphire. Badulla.\n50 Tale, crystalline. Mahara quarry.\n51 Gneiss with garnets. Top of Adam’s Peak.\n52 Calcareous Tufa. Bintenna.\n53 Clay from gem-pits.\n54 Calcite. Matale.\n55 Felspar, crystal. Ythanside.\n56 Sapphire crystals. Ratnapura.\n57 Sapphire (star).\n58 Sapphire, white.\n59 Sapphire, yellow.\n60 Sapphire, parti-coloured.\n61 Corundum.\n62 Ruby.\n63 Amethyst, crystal.\n64 Amethyst, cut.\n65 Spinel. Ratnapura.\n66 Spinel. Wattegama.\n67 Zircon.\n68 Zircon (cut). Matara diamond.\n69 Chrysoberyl.\n70 Chrysoberyl (cat's-eye.)\n71 Alexandrite.\n72 Garnets.\n73 Cinnamon stone.\n74 Cinnamon stone (cut.)\n75 Tourmaline, crystal.\n76 Peridot of Ceylon.\n77 Moonstone.\n78 Moonstone, cut.\n79 Quartz crystals.\n80 Actinolite.\n81 Iron pyrites. Gem-pits.\n82 Steatite. Nuwara Eliya.\n83 Zircon (white). Ythanside, Dimbula.\n84 Gems. Pelawatta.\n85 Gem sand.\n86 Black crystal. Deduru-oya, Kurunegala.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/journalofceylonb06roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 132, "total-input-tokens": 176570, "total-output-tokens": 56939, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 839, 5], [839, 839, 6], [839, 839, 7], [839, 1189, 8], [1189, 1696, 9], [1696, 1696, 10], [1696, 2686, 11], [2686, 4320, 12], [4320, 6334, 13], [6334, 7883, 14], [7883, 9627, 15], [9627, 11533, 16], [11533, 13312, 17], [13312, 15000, 18], [15000, 16859, 19], [16859, 18370, 20], [18370, 20076, 21], [20076, 21992, 22], [21992, 24122, 23], [24122, 25740, 24], [25740, 27568, 25], [27568, 29249, 26], [29249, 30867, 27], [30867, 32197, 28], [32197, 34029, 29], [34029, 36034, 30], [36034, 37988, 31], [37988, 39398, 32], [39398, 40916, 33], [40916, 42601, 34], [42601, 44506, 35], [44506, 46042, 36], [46042, 47678, 37], [47678, 49308, 38], [49308, 51123, 39], [51123, 53037, 40], [53037, 54733, 41], [54733, 56401, 42], [56401, 57782, 43], [57782, 59064, 44], [59064, 60653, 45], [60653, 61990, 46], [61990, 63520, 47], [63520, 64909, 48], [64909, 66628, 49], [66628, 68374, 50], [68374, 69936, 51], [69936, 71011, 52], [71011, 72384, 53], [72384, 73784, 54], [73784, 74480, 55], [74480, 76162, 56], [76162, 78171, 57], [78171, 80110, 58], [80110, 82036, 59], [82036, 83932, 60], [83932, 85526, 61], [85526, 87366, 62], [87366, 88002, 63], [88002, 89691, 64], [89691, 91649, 65], [91649, 93606, 66], [93606, 95448, 67], [95448, 96071, 68], [96071, 101313, 69], [101313, 101313, 70], [101313, 101313, 71], [101313, 101313, 72], [101313, 103025, 73], [103025, 104209, 74], [104209, 105052, 75], [105052, 105052, 76], [105052, 105052, 77], [105052, 105052, 78], [105052, 105343, 79], [105343, 105343, 80], [105343, 106466, 81], [106466, 108386, 82], [108386, 110328, 83], [110328, 112175, 84], [112175, 114014, 85], [114014, 115647, 86], [115647, 117652, 87], [117652, 119274, 88], [119274, 121274, 89], [121274, 123148, 90], [123148, 125037, 91], [125037, 126962, 92], [126962, 128907, 93], [128907, 130743, 94], [130743, 132493, 95], [132493, 134353, 96], [134353, 136327, 97], [136327, 138312, 98], [138312, 140248, 99], [140248, 142084, 100], [142084, 143940, 101], [143940, 145602, 102], [145602, 147426, 103], [147426, 149307, 104], [149307, 151213, 105], [151213, 153155, 106], [153155, 154769, 107], [154769, 155009, 108], [155009, 156399, 109], [156399, 158030, 110], [158030, 159624, 111], [159624, 161443, 112], [161443, 163193, 113], [163193, 163193, 114], [163193, 164578, 115], [164578, 166015, 116], [166015, 166432, 117], [166432, 166432, 118], [166432, 167764, 119], [167764, 169684, 120], [169684, 171451, 121], [171451, 173279, 122], [173279, 175022, 123], [175022, 176789, 124], [176789, 178572, 125], [178572, 179828, 126], [179828, 181239, 127], [181239, 181857, 128], [181857, 181857, 129], [181857, 181857, 130], [181857, 181857, 131], [181857, 181857, 132]], "primary_language": ["None", "None", "None", "None", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]