[{"id": "3823b3ccc940cbd5a8845356d0943d3f678b696f", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n韓大\n\nVOL. II.—Part I.\n\nSupplied gratis to Members of the Society.\nPrice to Non-Members, Yen 2.50\n\nON SALE AT\nSeoul, Korea: Hon. Librarian.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co., Ltd.\nParis: Ernest Leroux.\nLeipzig: Otto Harrassowitz.\nNew York: Geo. Stechert & Co.\n\n1901.\nKANG-WHA (江華).\n\nBy Rev. M. N. TROLLOPE, M.A.\n\nIf you examine the western coast-line of Korea on the map, following it upwards from its south-western extremity, you will find that for about two hundred and fifty miles it runs in a generally northerly direction between the meridians 126° and 127° E. of Greenwich. It then takes a sharp right-angle turn to the west, protruding far into the Yellow Sea, before it takes another northerly turn which carries it with a curve to the mouth of the Ya-lu River. It is in the north-east angle of the gulf formed by this sudden turn in the general direction of the coast-line that the island of Kang-wha lies, barring the mouth of the Kyung Kang (京江) or Han Kang (漢江), Seoul River or Han River, the higher reaches of which are so familiar to residents in Seoul and the neighbourhood. On the south and west Kang-wha is really exposed to the open sea, but for many miles in both directions the surface of the sea and the line of the horizon are so broken with numerous rocks and islands of varying size, as to create the impression rather of a land-locked gulf and actually to render approach by ship from the open sea a matter of considerable difficulty. On the north, Kang-wha is separated from the mainland by an estuary a mile or more in width, across which, in a due northerly direction, at a distance of some twenty odd miles, stand up in striking array the peaks of Song-ak San (松岳山), the guardian range of the ancient capital, Song-do (松都). On the east, a narrow strait, hardly more than a couple of hundred yards wide in its narrowest places, severs the island of Kang-wha from the mainland. It is through this strait, infested with rocks and rapids and with a tide rushing like a mill-race, that boats travelling from Chemulpo to Seoul must first find their way before reaching the mouth of the Han Kang proper, which debouches off the north-east angle of Kang-wha; and it is across this strait that the ferries ply,\nconnecting the island with the high roads leading to Seoul, which lies at a distance of some thirty-five miles (reckoned, however, by the Koreans as one hundred and twenty li) in a south-easterly direction.\n\nTo those of us who (for our sins) had to travel much in pre-railway days between Seoul and Chemulpo, the water-route through these picturesque narrows became very familiar—the roaring whirlpool of Son-dol Mok (孫復項), the halt at the ferry-towns of Kap-kot-chi (甲串) or Wol-kot (月串) to pick up Kang-wha passengers; and on the west the lofty hills and fertile plains of Kang-wha itself, hemmed in by a water-side girdle of quaint old forts and ramparts. The narrowness of these straits, coupled with the fact that for most of us Chemulpo was almost invariably the terminus of our journeys, misled many into believing that the straits themselves were but a continuation of the Han river and that the mouth of the river itself was to be looked for at Chemulpo. The Koreans, however, always refer to the water of these straits as \"sea;\" and indeed a glance at the map will show that it is nearly as unreasonable to speak of Chemulpo being at the mouth of the Han as it would be to speak of Dover being at the mouth of the Thames.\n\nOn the western, i.e., the Kang-wha, side of this strait, the coast is defended by a line of old battlemented ramparts, some forty or fifty li in length, stretching from the south-east to the north-east corner of the island, and punctuated every mile or so with small round forts or towers.*\n\nThese forts, indeed, to the number of some sixty or seventy, are dotted all round the coast of the island, and not confined, like the continuous rampart, to the eastern shore, which dominates the strait. They appear to have been erected at different dates, but the greater number of them are not more ancient than the early part of the reign of King Suk-jong (肅宗大王), that is, the close of the seventeenth century. The old rampart, however, on the eastern shore can boast a much greater antiquity, at least in its original in-\n\n*Those which possessed a resident garrison and commanding officer are called chin (鎮), and of these there are twelve. The remaining fifty odd are known as ton-dae (壇臺) and were only garrisoned as need required.\nception, than these detached forts. The earliest notice I have found of it is the record of its erection in the year 1253, when King Ko-jong (高宗王) of the Ko-ryū dynasty, flying from the face of O-go-dai Khan's invading Mongols, removed his court and capital from Song-do to Kang-wha. It has suffered much in the course of its history, partly from the violence of invaders and partly from the ravages of time, and as it has been often patched and repaired during the last six and a half centuries, it is probable that little if any of the original structure remains. The rampart itself is constructed of heavy, uncemented stones and averages some fifteen or twenty feet in height, or rather less, while the battlements, which were added in 1742 under King Yung-jong (英宗大王), the \"Grand Monarque\" of the present dynasty, are built of brick-work, in professed imitation of the walls of Peking! The bricks are very large and very hard and well cemented together; and, seeing what the Koreans can do in this way, one is inclined to wonder that brick-work does not play a larger part in their architecture. Here and there in the long line of fortifications an old rusty cannon still remains to remind the inhabitants of Kang-wha's past military importance, but nearly all the artillery has been removed, and forts, ramparts, guard-houses and barracks are all now deserted and rapidly falling into decay.\n\nTwo points in this narrow strait on the east of Kang-wha call for special remark before we leave this part of our subject: viz., Kwang-song and Kap-kot-chi, being the points at which the two chief ferries carry passengers across the water en route from Kang-wha to Seoul. At Kwang-song (廣城) where the water-course makes a sudden zig-zag turn between abrupt but not very lofty cliffs, near the southern entrance of the strait, are to be found, close to the ferry, the forts rendered famous by the American expedition of 1871; there also are the rapids and whirlpools known to the Koreans by the name of Son-dol Mok (孫巨項) or the Strait of Son-dol. A not very correct version of the story which has given rise to this name appeared in one of the earlier volumes of the Korean Repository, over the signature of Alexandis Poleax, but I believe the correct version to run as follows:—On the occasion of one of the Mongol invasions which harassed Korea some\nsix hundred years or more ago, the then king (history has not preserved his name), flying from his foes took boat on the eastern shore of Kang-wha, hoping to escape down these straits to the open sea and there take refuge in some more remote island. The boatman's name was Son-dol. Misled by the land-locked appearance of the water, caused by the sudden zig-zag turn at this point in the narrows, and finding his boat whirling round and round in the grip of the eddy, the king jumped to the conclusion that the treachery of his boatman had led him into a cul de sac and hastily ordered Son-dol to be executed then and there. A few minutes more and the rushing ebb-tide had carried the boat through the \"mok\" or throat of the narrows into the open water near the southern end of the strait, and the king saw too late that he had judged his boatman over hastily. Sorry for his fault, the king is said to have ordered the body to be honourably buried in a grave on the head-land overhanging the strait, and instituted yearly sacrifices to be paid there to the manes of Son-dol. The grave is still pointed out and until recently there stood by it one of those shrine-shanties which are such common objects in Korea, with a picture of the deceased hero pasted on the wall as an object of worship. The shrine appears to have tumbled down in recent years, but rumour has it that year by year, on the twentieth day of the tenth moon, which is the anniversary of Son-dol's death, a boisterous whirlwind blows through the \"mok\" which bears his name, and the passing boatman is fain to pour a libation and breathe a prayer to the restless spirit of the dead.\n\nKap-kot-chi, the other point of interest, is some six or eight miles further up, near the northern outlet of the strait, and two or three miles south of the actual mouth of the Seoul river proper. Here, at the point where the ferry crosses, a lofty hill, named Muni-su Sin (文殊山), rises to a height of some 1,200 feet from the water's edge on the mainland, and comes so close to the answering cliffs of Kang-wha as to seem to threaten to block the strait altogether. This hill on the mainland, fortified in 1693 as an outwork to the defences of Kang-wha, with a rampart fifteen li in circumference, used to be reckoned for military purposes as belonging to the government of the island, and was doubtless chiefly intended to be a\ndefence to the Kap-kot-chi ferry, which lies at its foot and which has been the scene of many a stirring event in Korean history from the days of the Mongol invasions of the thirteenth century down to the year 1866, when Kap-kot-chi became the head-quarters of the French expeditionary force, during the few days of its sojourn in Korean waters.\n\nSituated thus at the mouth of the river leading to the present capital, and guarding that part of the sea-coast which lies nearest to the old capital of Song-do, it is not surprising that the island of Kang-wha should bulk largely in the estimation of Koreans, or that it should have played a prominent part in the history of the country during the past thousand years—that is, since the establishment of the old Ko-ryū (高麗國) dynasty at Song-do in A.D. 936. Before that date the country's centre of political gravity lay either further north, in the neighbourhood of P'yŏng-yang or further south in the province of Chūl-la (全羅道) Kyŏng-sang (慶尚道), or Chung-jung (忠清道). But for the last thousand years both its geographical position and its natural features have made Kang-wha at once the most suitable place of refuge for the royal family and the government in days of trouble, the most suitable place of exile for dethroned monarchs, inconvenient scions of royalty, and disgraced ministers, as well as the first outpost to be attacked and the most important to be defended, in case of invasion by sea. Twice in the thirteenth century was the capital shifted, under stress of foreign invasion, to our island fortress, and, with the notable exceptions of the terrible Japanese invasion under Hideyoshi in 1592, and the China-Japan trouble of 1894-5, which barely touched it, Kang-wha has felt the full force of nearly every foreign expedition which has troubled the peace of the country during the past seven or eight centuries, notably those of the Mongols in the thirteenth, and of the Manchus in the seventeenth, centuries, of the French in 1866, and of the Americans in 1871. Moreover, more than one monarch of the present dynasty has visited Kang-wha for a longer or shorter period, and King Chūl-jong (哲宗大王), the predecessor of his present majesty on the throne, was born in Kang-wha city in 1831, in a house which is still pointed out, and was (I believe) living in retirement there when called to the throne in 1849. Last, but not least, Kang-\nwha island was the scene of the brush between the Koreans and the Japanese which led to the conclusion of the first treaty between Korea and Japan in 1876. The actual signature of that treaty, the first of the series which has thrown open Korea to the world, as well as the negotiations which preceded it, took place in Kang-wha city itself.*\n\nThe island thus famous in Korean history has been known in the course of ages by a variety of different names, the earliest being the strange one of Kap-pi-ko-ch'a (甲比古次), the first syllable of which is said by local antiquarians to be still preserved in the village name of Kap-kot-chi (甲串), some going as far as even to aver that this name would be more properly spelt Kap-ko-chi (甲古), an opinion in which I do not concur.†\n\nHowever that may be, I think it is quite plain that such an unmeaning medley of characters as Kap-pi-ko-ch'a cannot have a really Chinese origin, but must represent an attempt to spell in Chinese characters some purely aboriginal name, such as we are familiar with in the Chinese rendering of Tartar names.\n\nAt some time under the Ko-gu-ryū (高句麗國) dynasty, which may roughly be said to have lasted over the first seven hundred years of the Christian era, the island was first raised to the dignity of a prefecture (郡) and its name was changed to Hyul-ku (穴口) or Cave-mouth, a name which is still preserved in the lofty hill to the south-west of the present city. Under the Sil-la (新羅國) dynasty it passed for a short time under the name of Hā-gu (海口) or Sea-mouth; but on being raised to the rank of a chin (鎮) or fortress, at the close of the eighth century A.D., recurred to its old title of Hyul-ku, which it retained apparently until the removal of the Ko-ryū capital hither in 1232. At this date it seems to have first received its modern name of Kang-wha (江華), Glory of the River, with the variations of Kang-do (江都), the River Capital, and\n\n*Kang-wha is pronounced Ko-kwa by the Japanese.\n\n†At least seven other of the forts which are dotted round the coast of Kang-wha have this word kor as the final syllable of their name. It is a pure Korean word used to describe things strung together, like e.g., dried persimmons on a stick, and may be intended to denote the idea of series. It is represented in Chinese by the character (串), which is not, however, given its true sound. These names are therefore hybrids—half Chinese, half Korean.\nSim-ju (泗州), or Sim-do (泗都), the Waterside Prefecture or Capital, all of which are occasionally still in use. Oddly enough, the natives at the present day always mispronounce the name, as though it was written Kwang-hä, or Sea of Light, a name which I cannot find it ever bore, though a notorious king (光海主) of this name in the present dynasty, who was dethroned in 1623, spent the closing years of his life in banishment here.\n\nThe old native maps of Korea, like the productions of the European map-makers of some three or four centuries ago, are remarkable for their picturesqueness rather than for their accuracy in detail. Prominent features, like the bigger hills, rivers and cities, and even the more important buildings, are painted in with a generous brush, without much sense of proportion and with little or no reference to mere questions of longitude and latitude. The resultant effect is a sort of a cross between a ground plan and a landscape in perspective. Smaller geographic details disappear altogether, and convenient blank spaces are scrawled over with a miscellany of legendary, historical and topographical information, which a mere Keith Johnston would regard as sadly out of place. Such a map of Kang-wha and environs, apparently about a hundred years old, now in my possession, amidst a variety of miscellaneous notes, gives the length of the island as seventy li from north to south and forty li from east to west and in the Text-book of Korean Geography (大韓地誌), published in recent years by the Education Department, I see it is reckoned as measuring about one hundred li by fifty. That the Korean li is a very elastic quantity, and, judging from the naval charts published by the British Admiralty in 1884-5 as the result of the latest French and English surveys—though the southern and western shores of Kang-wha are not charted in these—I should say that its greatest length from north to south is not much more than twenty miles, its greatest width not more than ten or twelve. This would give the island of Kang-wha an area very much the same as that of the Isle of Wight in the South of England.\n\nImmediately to the north-west lies the considerable island of Kyo-dong (喬洞島), which forms the seat of a separate magistracy and as such falls outside the limits of my subject;\nbut of the other islands to the south and west, several of which are fairly populous, twelve are reckoned as forming part of the territory of Kang-wha. The most important of these are Mo-eum To (煤音島), Por-eum To (雲音島), Shin-yum (信島), Sal-sum (矢島), Chang-bong (長峯), Chu-mun To (注文島), and Tong-gum To (東檢島).\n\nIn its main geographical features, the island of Kang-wha may be not inaptly compared to a gridiron, being crossed from west to east by four striking and clearly defined parallel ranges of mountains, the highest peaks being in each case on the western side of the island and the ranges gradually sinking in height and ramifying into a number of lower ridges as they approach the eastern shore. The southernmost range, which is also the most considerable—the highest peaks running up, I suppose, to a height of two thousand feet or so—consists of the twin hills of Ma-ri San (摩尼山), and Kil-sang San (吉祥山); and it is on an outlying spur of this range, known as Chung-jok San (鼎足山), or Cauldron-foot Hill, from its supposed resemblance to a Korean sot or cauldron, lying with its feet in the air, that the famous fortified monastery of Chun-dung Sa is built. Next to this, in a northerly direction, is the range of Chin-gang San (鎮江山), one of whose eastern feet, thrust into the straits described above, causes the rapids of Son-dol Mok.* Further north again the twin peaks of the Hyul-ku San (穴口山) and Ko-ryu San (高麗山) form but a single range,† the eastern arms of which embrace the present city of Kang-wha, and run down to the straits at Kap-kot-chi, to meet the answering range of Mun-su San (文殊山), on the mainland. And northernmost of all comes the range containing the peaks of Pyul-ip San (別立山), from which was quarried the original altar-stone for the late queen's tomb, and Pong-du San (鳳頭山), which is surmounted by a famous landmark in the shape of one of Tan-gun's altars to heaven. Each of these ranges is divided from its neighbour by a broad and fertile valley running right across the island from east to west, and the bulk of the agriculture which forms the staple\n\n*Just at the back of Son-dol Mok is a not very lofty but curiously conical peak known as Tae-mo San, which plays an important part in local geomancy.\n\n†A considerable protrusion is formed in the western coast-line of the island by a branch running westward out of this range, of which the highest peak is known as Mang San.\nindustry of the greater part of the inhabitants is carried on in\nthe broad floor of these valleys and of the \"combes\" that branch\nout of them. The villages and farmsteads in which the farm-\ning population dwell are for the most part grouped and dotted\nabout in the little hollows at the foot of the hills along either\nside of the valleys; for, trying as the people find the heat in\nsummer, the really serious business of life with a Korean is, I\ntake it, to protect himself from the cold of winter. You will\nordinarily find, therefore, both here and elsewhere, the dwell-\nings of the country folk snugly tucked away in the little\ngullies or \"combes\" at the foot of the hills, where they stand\nthe best chance of securing shelter from the dreaded Hanui\nFaram or north-west wind. And I venture to suggest that\nthis arrangement (which, by the way, gives the country\ndistricts a very deserted aspect when viewed from any dis-\ntance) explains the common use of the word tong (洞)* for a\nresidential district in Korea, and supplies the true etymology\nof the common Korean word for a village or hamlet—viz., the\ntong-na (洞內), that which lies in the tong or gulley. No\nKorean would ever think of building his house on an un-\nprotected ridge-top, if he could avoid it.\n\nA good deal of the land at the mouths of these valleys,\nwhich is now devoted to agriculture, has been, during the last\ntwo hundred and fifty years, reclaimed from the sea, which\nused to wash in and out with every tide, by the building of\nheavy dykes (隄堰) and earthworks, a work of no little labour\nand of much more service to the state than the erection of the\nuseless ramparts and fortifications which abound on every side.\nMa-ri San is said to have been an island previous to the erec-\ntion of the dykes which abut upon it. North, south, east and\nwest of Kang-wha, there are nearly a dozen of these sea-dykes,\nsome of which are of considerable length. In one case, on\nthe east shore at Hoa Do (花島水門), the outlet left for the\nescape of the land-water is crossed by a lofty and massive\nbridge, built (in 1766) of huge blocks of squared granite, which\nis now, however, unhappily in a very ruinous state. The land\nthus reclaimed and saved for agriculture must amount in all\n\n*According to Williams, this character was so used in China under the Ming\ndynasty; and in the French Corean Dictionary the two characters above mentioned\nare given as the equivalent of 동내\nto hundreds of acres, which, but for the erection of these dykes, would consist wholly of mud-flats, washed over by the salt water at every spring-tide.\n\nConsiderably north of the centre of the island and nearer the east than the west coast, stands the present walled city (pu 廃 or eup 邑) of Kang-wha, a not very numerous or imposing collection of houses chiefly straw-thatched. Hugged by the eastern arms of Hyul-gu San and Ko-ryū San, the town is, however, in its small way a miniature edition of Seoul, with a beautifully wooded Nam San (known also as Hoa San, 花山, and Puk Ak, called also Song-ak San, 松岳山, in imitation of the Song-do hills) of its own, with a battlemented city-wall some fifteen li in circumference, four pavilioned city gates, a bell and bell-kiosk, and a number of other public buildings, chief among which stands the yamen (more commonly called here the yūng-mun, 營門, of the magistrate, who holds the high rank of Pu-yun (府尹). The city also boasts a small garrison, consisting of the Sim Tā (泌隊), or Kang-wha regiment, a force of 300 men, chiefly recruited from Kang-wha itself; while the market held here on the 2nd, 7th, 12th, 17th, 22nd and 27th of every moon draws country folk by the thousand from every corner of Kang-wha itself, as well as from the neighbouring islands and mainland.\n\nBut the catastrophic year 1894 (Kap-o-nyūn 甲午年), which was fatal to so many of the old institutions of Korea, did much to diminish the ancient glory of Kang-wha.\n\nFor two hundred and sixty years previous to that date, Kang-wha had been reckoned, with Song-do, Kwang-ju (i.e. Nam Han), Su-won, and Ch‘un-ch‘un, as one of the O To (五都) or Five Citadels, on which the safety of Seoul depended. As such it was like them governed by a Yu-su (留守), who ranked as one of the highest officials in the kingdom, assisted by a lieutenant civil governor, known as the Kyūng-yok (經歴) or P‘an-gwan (判官), and a lieutenant military governor, known as the Chung-gun (中軍), with a staff of civil and military officials, which must have amounted to nearly a thousand persons in all, with a garrison of something like ten thousand troops, though it is not to be supposed that any-\nthing like all this number remained constantly under arms.* A good deal of this power and authority was owing to the fact that the Yu-su for the time being, for many years during the period named, held *ex officio* also the offices of Chin-mu Sa (鎮撫使) or Military Commandant and Sam-to T'ong-o Sa (三道統領使) or Lord High Admiral of the three Provinces, which saddled him with a heavy military and naval command, including the coast defense of the three provinces of Ch'ung-ch'üng (忠清道), Kyŏng-geui (京畿道), and Whang-ha (黃海道). To assist him in the fulfilment of these various duties, tribute grain to the amount of some 13,000 bags yearly was stored in the capacious government granaries in the city and elsewhere.\n\nBut the changes in modern warfare have largely robbed Kang-wha of its military importance. Enemies who want to strike at the heart of the country find an easier road to Seoul overland from Chemulpo, and it is realized that even Kang-wha, with all its natural advantages, would never, under existing circumstances, afford much safety as a place of refuge for the king and his government in times of danger. And so, since the general reconstitution of affairs in 1894-95, Kang-wha, deprived of these adventitious aids to its importance, has had to be content to take a lower place among the towns and cities of Korea. For a few months indeed, in 1895, it was governed like any common *kot* by a mere Kun-su (郡守), but since 1896 the governor of Kang-wha has shared with the governors of the other more important places in the country the honourable title of Pu-yun (府尹), which indeed his predecessors had enjoyed in days of yore, until King In-cho (仁祖大王), raised them to the rank of Yu-su in 1628.\n\nOne office of importance the Pu-yun of Kang-hwa still retains—to wit, that of guardian to the records of the present dynasty. These records are preserved in quintuplicate, the other four copies being stored in other places of security elsewhere in Korea. The Sa-ko (史庫), or Record House of Kang-wha, however, is not in Kang-wha city but in the grounds of\n\n*Presumably the presence of so many officials and soldiers accounts for the disproportion between males and females in the census figures given on the old map referred to above. At that date (about eighty to a hundred years ago) the population was reckoned as slightly over 34,000, of whom nearly 19,000 were males and not much more than 15,000 females.*\nthe monastery of Chun-deung Sa on Chun-ch'ok San, at the southern end of the island, whither the governor has to make periodical visits to see that the records are properly aired and otherwise cared for.*\n\nStill, although the Pu-yun of Kang-wha still ranks high among the prefects of Korea, the yamen is sadly shorn of its former glory, the staff of secretaries, etc., being numbered by tens where it used to be numbered by hundreds, and the garrison troops by hundreds instead of thousands, while the empty and ruinous public buildings, for which there is no further use, present a sad picture of decay, which is apt to give a rather false impression. For Kang-wha, though deprived of these extrinsic and factitious aids to its importance, still remains the centre of government and commerce for an extensive and fertile district supporting a population of certainly not less than 30,000 souls.\n\nOne might have supposed that a town of the antiquity and historical importance of Kang-wha would have preserved many interesting monuments of the past. But monuments, in a land where the most usual material for architecture is timber rather than brick or stone, have a way of not lasting. Moreover, Kang-wha city has within the last two hundred and seventy years suffered from two terrible catastrophes, which made a pretty clean sweep of what there was in the place. Each of these will claim our attention later on. Here let it suffice to say that in the terrible Ho-ran (胡亂) or Manchu invasion of 1636-37, the city was practically razed to the ground by the invaders; and again in 1866, the French expedition, under Admiral Roze, burnt the greater part of the town to the ground, including the old palace, which has never been rebuilt, and most of the other public buildings, while anything of interest that was sufficiently portable naturally disappeared in the way of loot.†\n\nThe city bell itself had a narrow escape, its captors only\n\n* I have found frequent mention in the records of repairs to the Sa-ko ori Record House but none of its original erection. In 1638 an edict was issued ordering the restoration of forty-seven volumes of records which had been lost (during the Ho-ran ?).\n\n† One would like to know what happened to the contents of the splendid library of Kang-wha, which Pere Dallet describes from the notes of Mgr. Ridel on page 579 of his history. Were the books (e.g. the ancient history of Korea in sixty volumes) removed to the National Library of Paris? The Kyu-chang Oi-gak, a branch of the royal library in Seoul, was apparently established there in 1731.\nfinally abandoning it in the middle of the road, after carrying it half way to Kap-kot-chi, where their boats awaited them.\n\nThe city does not seem to have always occupied its present site. Indeed at one period, under the Ko-ryū dynasty, there appears to have been two *eup* (下陰縣 and 鎮江縣) or centres of government on the island, one at Ha-erum, about ten *li* to the north-west,* and one on the southern slope of Chin-gang San, some thirty or forty *li* to the south of the present city. But when King Ko-jong, of the Ko-ryū dynasty, established his capital here in A.D. 1232, the city would seem to have occupied a site, which, at any rate, included that of the present town, though its extent was probably much greater and the walls did not run on the same lines as the present ones. North, south, east and west of the existing city are numerous mounds and embankments, surrounded by sherds of broken tile and other tokens of the existence of houses; and these are doubtless relics of these earlier fortifications, the memory of which is also kept alive in village names, such as West Gate Village (四門洞), Great Gate Village (大門洞), Stone Rainpart Village (石城洞) and the like, at distances of some ten or fifteen *li* from the present town. But I have not myself been able to trace any consistent plan from these remains, nor does there seem to be any uniform and reliable tradition on the point among the inhabitants. The present city walls were only built in 1676 and 1710, to replace those destroyed by the Manchus in 1637, and they certainly do not follow the same line as those which preceded them. For instance, it is known that the old South Gate, at the time of the invasion, stood close by the present bell-kiosk, and to this day a ridge in the middle of the city just above this point is known as the Sūng-maro (城嶺) or Rampart Ridge.\n\nOf the public buildings which adorn, or adorned, the town, of course the most important were the royal palaces. That inhabited by the Ko-ryū kings covered a large space of ground on and around the small hill which lies between the present East and South Gates and which is known by the name of Chong-ja San (亭子山) or Kyūn-ja San (見子山). There\n\n*These were first set up by King Heu-jong of Ko-ryū in 1018 A.D.*\nis a record of a great fire here in A.D. 1246, which destroyed eight hundred houses, besides the palace buildings and a Buddhist temple known as Pǔp-wang Sa (法王寺). Whether this palace was rebuilt I do not know. That which, from time to time, in later years formed the residence of kings of the present dynasty was known as the Háng-gung (行宮) and occupied a site on the slopes of the North Hill behind the present yamen. This was burnt down by the French troops in 1866,* and there is nothing left to shew its site but the remains of terraces and foundations on the hill-side, with two stone tablets, set up in enclosures, to mark the position of two of the chief pavilions or halls, known respectively as the Man-yŭng Chŭn (萬寧殿) and the Chang-yŭng Chŭn (長寧殿). Besides the Pu-yun's yamen with the handsome Kāk Sa (客舍), or Royal Tablet House, attached, and the numerous smaller yamens, many of which are being pulled down or falling into decay, there are now no public buildings of any importance in the town, except a large public granary of no great antiquity and now deserted, and an equally large and modern barrack, now occupied by the soldiers of the Kangwha regiment, the bell-kiosk, the Confucian temple and one or two smaller temples and tablet houses. Among the temples, is the usual Sa-jik Tang (社稷堂) or Temple to the Spirits of the Earth and Grain and there are also three small temples to the God of War (關廟), the erection of which probably dates from the temporary revival of his cult twenty years ago. The tablet houses (碑閣) chiefly contain tablets (mostly of stone, but some of metal) commemorating the virtues of past governors. But the only one of real importance is that erected to the memory of the patriot known as the Sŭn-won Sŭn-săng (仙源先生), one of the victims of the Ho-ran of 1637, which stands immediately opposite the bell, and to which I shall have to refer again. But of the other buildings none need delay us except the bell-kiosk (鐘閣) and the Confucian temple. The bell which hangs in the former has an inscription in Chinese, much defaced, running round its waist, the most\n\n*This was probably the first acquaintance made by Koreans with petroleum. After the French had gone, those of the inhabitants (they were not many) who had not fled, recounted with awe how the Yang-in had thrown water on the buildings and then set fire to them.\nlegible part, which is twice repeated, stating that it was re-\ncast in the fiftieth year of the Emperor Kang-heui (康熙)\n(i.e. A.D. 1712) on Ch’ung-ch’ok San at the southern end of\nKang-wha, and that the old bell, a much smaller one, was then\nbroken up and thrown into the melting pot, with a large\nquantity of new metal, making the total weight of the present\nbell 6,520 keun (斤), which I suppose we may reckon at some-\nthing like 9,000 lbs. or nearly four tons avoirdupois. This\nwas the bell which the French attempted to carry away. The\nMun-myo (文廟) or Hyang-gyo (鄉校), Confucian Temple,\nwhich occupies a very retired position at the end of the valley\ninside the walls between the North and West Gates, consists\nof the usual Ta-sung Chun (大成殿), or shrines containing\nthe tablets of Confucius and his chief disciples, with subsidiary\nshrines for canonized Korean scholars, to the right and left of\nthe courtyard in front of the main temple, and the equally\nusual Myung-yun Tang (明倫堂) or Hall for Expounding the\nSocial Relations, which is now in a very decrepit and neglect-\ned state. The Confucian temple, which, probably owing to\nits retired position, almost alone of the public buildings\nescaped destruction by the French in 1866, has occupied three\nor four different sites in the city at different times; and under\nstress of the Mongol invasion it is said that the tablets were\nonce all removed for safety to a neighbouring island, a tradi-\ntion which is supported by the fact that much of the glebe\nowned by the temple is situated in the island in question.\n\nFor purposes of administration, the island of Kang-wha\nis divided into seventeen myun (面) or parishes, of which the\ncity counts as one, and these are subdivided into one hundred\nand sixteen hamlets or tong-na, of which twelve are either\ninside or close outside the city walls and are included in the\nPu-na Myun (府內面) or city parish. The number of houses\nin the whole island is reckoned for taxation purposes roughly at\n8,000, which, if we allow the moderate estimate of four souls to\na house, will give a total population of over 30,000. And this\nfigure I have other grounds also for believing to be substan-\ntially correct. With regard to the occupation and character of\nthe people, an old verse, in some respects too severe and in\nothers now obsolete, sums them up as follows:—Ploughing\nand weaving for work; shooting with the bow and riding for\nsport; the people are boorish and unpolished, the petty officials quarrelsome and overbearing; fond of staying at home and keen on a good bargain, they are great believers in spirits and devoted to wizards.* Of the greater part of the population, as I have already said, agriculture forms the staple industry. Of course, inside the city there is a considerable number of small merchants and shop-keepers, besides a small semi-literate class, chiefly confined to a few families, which have for generations supplied candidates for the clerkships and inferior offices at the yamen, while in the waterside villages not a few depend for their livelihood on their salt-pans and on their boats, which seem, however, to be much more used for purposes of carriage than for fishing. And throughout the country districts, there is a fair sprinkling of literati, country gentlemen and retired officials, of whom one at least has built himself a magnificent house, though he has never yet occupied it. But the bulk of the country folk are farmers and I suppose it is still true that the farmer's wives do a good deal in the way of weaving mu-myung (무명) or the coarse linen of the country. If, however, one leaves out of count one or two small pottery works for the production of the roughest kind of earthenware crocks, and one or two small smelting furnaces for the founding of common iron articles, like cauldrons, hoes, plough-shares and the like, Kang-wha can really be said to boast no special industries, outside its stone quarries and its mat-making. A great portion of the granite work used in the erection of public buildings, the adornment of graves, etc., in the neighbourhood of Seoul and elsewhere, comes from Kang-wha, and the inhabitants of one large village, Kon-teul (乾坪), on the west coast, are almost exclusively occupied in stonemason's work, though the finer kinds of stone are not to be looked for in Kang-wha itself, but on the neighbouring island of Ma-eum To (煤音島), across a narrow strait on the west. The making of the ordinary reed mats, which are such common objects in Korean\n\n信 安 吏 民 弓 耕 *\n鬼 士 校 物 馬 織\n好 重 豪 蛻 是 要\n巫 利 競 貿 尚 務\nhouses, is not of course confined to Kang-wha, and is largely an ordinary winter occupation with the farming class. But the manufacture of the finer kind of reed mats, and the insertion of the coloured pattern, which is a distinguishing feature of the Kang-wha article, is a distinct industry. Some of you may have seen very fine and large specimens of these in the palace buildings in Seoul. But these large mats are specially made on looms constructed for the purpose to be sent up as gifts or tribute to His Majesty, and are not easily met with as objects of common purchase. A much finer and more durable and, to my mind, prettier though smaller, style of mat is made in the neighbouring island of Kyo-dong.\n\nOne industry, that of horse-breeding, for which Kang-wha was famous in the past, has entirely died out within the last two centuries, though it was kept up until within the last few years on the neighbouring islands of Chang-bong and Ma-eum To, under the superintendence of one of the petty military officials of Kang-wha. Now there is hardly a horse in the place, but the memory of the horse-corrals (馬塲) which formerly existed there is still preserved in the names of some of the villages in the neighbourhood of Chin-gang San, e.g., Ma-jang Tong (馬塲洞), Chang-du Tong (塲頭洞) and Chang-ha Tong (塲下洞). And there is more than one story in the old records told in illustration of the excellence of the Kang-wha breed, the fame of which spread over to China.\n\nThe eight fine steeds which graced the stables of T'a-jo Ta-wang (太祖大王), the founder of the present dynasty, are said to have come from here; and we are told that when King Hyo-jong (孝宗大王), who had been carried captive to Manchuria after the Ho-ran of 1637, was released on the death of his father and allowed to return to Korea to take up the reins of government, the Emperor Sun-ch'i (順治) gave him from his own stables a horse bred in the Chin-gang corrals to carry him back home. But at the crossing of the Yalu, doubtless excited by the scent of his native air, the horse at one bound freed himself from his royal rider and attendants and was never seen again, \"whereby you may learn,\" says the historian with a gravity worthy of Herodotus, \"that\nthe horse was surely of supernatural breed.\" The same king had another favourite and more famous horse, named Pūl-tā-ch'ong (伐大驥), in his royal stables, so famous, indeed, that his birthplace is marked in the old native maps. The story goes that this horse, when periodically turned out to grass in Kang-wha, was able to tell when he would be wanted for a royal procession, and used to trot off to Seoul on his own account! So fond was the king of his steed, that he is said to have threatened to slay the first man who brought him the news of Pūl-tā-ch'ong's death. The story goes that, on one of his return journeys to Kang-wha, the horse fell ill and died at Yang-ch'ŭn (陽川) on the road. The magistrate of the district repaired to the palace and sought an interview with the king. \"I regret, Sir,\" said he, \"to have to report that Pūl-tā-ch'ong has been taken ill in Yang ch'ŭn and has eaten nothing for the last three days!\" \"Pūl-tā-ch'ong is dead! Out with the truth,\" thundered the monarch. \"Quite true, Your Majesty,\" replied the wily courtier; \"but it was Your Majesty and not I who uttered the fatal words first.\" All which of course is foolishness, but serves to emphasize the fact that Kang-wha did once possess a horse-breeding industry and a famous breed of horses.\n\nTo return to our geography. Outside the city of Kang-wha the most famous place in the island is the fortified Buddhist monastery of Chun-deung Sa (傳燈寺), distant some thirty li south. The grounds of the monastery are beautifully situated in a thickly-wooded, crater-like hollow, which occupies the crest of a hill known, as already stated, as Chung-jok San (鼎足山) or Cauldron-foot Hill, from its supposed resemblance to a Korean sot lying with its feet in the air. The grounds are surrounded by a battlemented stone rampart, similar to the city wall, with a circumference of five li, and within this is enclosed, besides the monastery and one or two smaller buildings, the Sa Ko or Record-house already mentioned. The tradition is that the rampart was built in pre-historic times by the three sons of Tan-gun (檀君), their sister aiding them by collecting the stones in her apron! Hence it is sometimes known by the alternative title of the Sam Nang San-sŭng (三郎山城) or the Fortress of the Three Youths. The monastery itself is known by the name\nof Chan-deung Sa, The Temple of Transmission of the Lamp, not apparently with any reference to the mystic handing down of the lamp of truth, but with a more prosaic reference to a certain jade lamp of great value (now lost) presented to the temple by Queen Chong-wha (貞和), the consort of King Ch'ung-yol (忠烈王), who reigned over Ko-ryū at the close of the thirteenth century A.D. The date of the first foundation of a Buddhist temple here is unknown; but there are said to have been no less than three temples, which had perished one after another on the present site, before the present monastery was built in 1266. A few years later we are told that the same Queen Chong-wha sent the monk In-geui (印奇) to China for Buddhist books and that he brought back with him a copy of the Tā-jang Kyŭng (大藏經) or Tripitaka, which was preserved here. The monks of this monastery, as well as of two smaller ones in Kang-wha, were until recent years in receipt of government pay, and enjoyed, like the monks of Puk-han and elsewhere, a semi-military rank as Seung-gun (僧軍), being charged with the defence of the fortress. In recent years the monastery has become most famous as the scene of the reverse suffered by the French troops in 1866, which has been so graphically described by Pere Dallet in the pages of his admirable Histoire de l'Eglise de Corée.*\n\nBesides Chun-deung Sa there are in Kang-wha nine other small Buddhist monasteries, or, to speak more correctly, seven in Kang-wha itself and two others which are reckoned as belonging to Kang-wha, though they stand just outside its limits—one, called Mun-su Sa (文殊寺) or the Hill Fortress, on the mainland opposite Kap-kot-chi, and the other, known as Po-mun Sa (普門寺), on the neighbouring island of Mā-eum To. This last is celebrated for its wild rock scenery and for a naturally formed rock-temple or grotto in the side of the hill on which it stands. Of the others the only ones which are of any note are the three known respectively as the Temples of the White (白蓮寺), the Red (赤蓮寺), and the Blue Lotus (青蓮寺) which stand on Ko-ryū San to the west of the city. These are said to owe their foundation to the fact that \"once upon a time\" a famous monk in far Thibet cast into the air five lotus blooms of five different colours,\n\n*Vol. ii. pp. 576-586.\nwith the prayer or the prophecy that where each fell should rise a temple to Buddha. Three at least are said to have been wafted as far as Kang-wha and to have fallen on Ko-ryū San and so led to the erection of these three temples. On the crest of the hills, too, are the marks of five old wells, of which it is said that each in days of yore was wont to produce a lotus of different colour. Moreover, the water of those wells was good and whosoever drank thereof became endowed with supernatural strength, which thing, when the Ho-in perceived, during the Ho-ran of 1637, they marched to the top of the hill and pouring in molten metal thereby effectually stopped both the flow of the water and the growth of the lotuses. Of these three monasteries, the Red Lotus Temple (commonly known as Chūk-sok Sa 紅石寺), which is the least accessible, is noted as having formed the retreat during the Ho-ran of King In-jo’s aunt, the Princess Chong-myung (貞明公主), whose portrait was long preserved there. This temple escaped destruction at that time but about a hundred years later was burnt to the ground and subsequently rebuilt.\n\nThere is a fine view of the western sea from the crest of the hill near the monastery and the sunsets seen from here rank among the ten “sights” of Kang-wha (江州十景).\n\nAs Kang-wha played such a prominent part during the last hundred and fifty years of the priest-ridden dynasty of Ko-ryū, it is not surprising that Buddhism has left its mark here. Besides the monasteries and temples already mentioned, the memory of many others which have long since perished is still preserved in ancient records and of yet others in the names of villages and districts of the island. One of the seventeen myun, into which the island is divided, is known by the name Pul-eun or (佛恩) “Mercies of Buddha;” while yet other two are known by the names Sū-sa (西寺) and Puk-sa (北寺), the Western and Northern Temples, though there are, I believe, no temples there now. Again another small village, between Kap-kot-chi and the city, is locally known by the curious name of Mūk-chul (墨寺洞, now known as 萬壽洞) or Ink Temple. And at the foot of Pong-du Sa, some five miles north-west of the city, is an old weather-beaten granite pagoda, standing some twenty feet high, and in the adjoining valley, a bas-relief of Buddha, some ten feet high.\ncarved on a rock protruding from the hill side and this in a spot where there is no record or tradition even of a monastery having ever existed. Lastly, in Kang-wha, as is so frequently the case elsewhere in Korea, the names of the hills shew a Buddhist influence. Mun-su (文殊), which gives its name to the hill and temple opposite Kap-kot-chi, is the Chinese name of the famous Bodhisatva Mandjusri, and Ma-ri (摩尼) or Ma-ni, the name of the great hill in the south of the island, is none other than the Tibetan word for jewel, so familiar in the invocation, Om Ma-ni Pad-me hum!\n\nOf the present influence of Buddhism in Kang-wha, there is nothing more to be said than of its influence elsewhere in Korea, and that influence may, I think, be fairly described as amounting to nil. One only wonders how and why in its decrepit state it continues to exist.\n\nBefore passing on to speak of a few of the chief historic events, which help to make our island famous, a word must be said as to one or two pre-historic monuments which Kang-wha boasts. Most ancient of all, I suppose, is the dolmen or cromlech, known to Koreans as the Ko-in Tol or Propped Stone. This stands in the open country about an hour's walk to the north-west of the city, and is strangely similar to the cromlechs and dolmens which are such common objects in the Celtic parts of France and England, e.g., Brittany and Cornwall.\n\nThe top or roof stone here is a single block of irregular shape, measuring some three or four feet thick, twenty-one feet long and eighteen feet broad, supported at a height of about six feet from the ground by two long slabs of stone some fifteen feet in length, which form, as it were, the side walls of the house. The chamber thus formed is open at the ends and measures about three feet long and six feet high, and, roughly speaking, points W.S.W. and E.N.E. Scattered about in the neighbourhood are a few other apparently megalithic remains, and a smaller but perfect cromlech is also to be found not far from the roadside, about half way between the city and the Ko-in Tol, which is, however, far larger and more remarkable than any of the others. As the origin and use of these and similar \"Druidical\" remains in the West, and the means by which they were erected, have been for\ncenturies moot points among European antiquaries, and as I have no views on the subject, I do not propose to detain you with any disquisition on these points. The natives, of course, have some childish and not very interesting fairy story to tell about the origin of the Ko-in Tch,* but it is not of a character calculated to throw much light on these questions. It would, however, be interesting to collect facts as to the number, location, size, shape, orientation, etc., of the various dolmens in Korea, and then compare them with what is known of similar curiosities in other lands.\n\nThe two other pre-historic monuments are the two great Altars to Heaven, erected one on the top of Ma-ri San in the south, and the other on the top of Pong-tu San (not far from the cromlech) in the north of Kang-wha. If I mistake not, the two altars, which must be about sixteen miles apart, are just visible the one from the other through a narrow gap in the intervening ranges of hills. The northern altar is slightly pyramidal in outline with a flat top, the whole built of uncemented stones and measuring (at a guess) some twenty feet high and twenty feet square at the base. Perched right on the top of a steep hill, it is a sufficiently remarkable object in the landscape.\n\nThe other and more famous of the two altars is similarly perched on the top of Ma-ri San and is known as the Ch'ansung Tan (祭星壇) or Star-reaching Altar. The construction of both, and the use of them as altars for sacrificing to heaven, are ascribed to Tan-gun (檀君), the mythical hero with whom Korean history is said to begin, and who is supposed to have lived about 2331 B.C.\n\nAnd now we come to history. You would not thank me, I am sure, nor does it seem worth while, merely to recount in the order of their occurrence all the various events, many of them trivial, which find a place in the records of Kang-wha—how in this year, the king held an examination in Kang-wha for the scholars of the island, and in the next year such and such a prince or minister was banished to Kang-wha, and in\n\n*The story is to the effect that the devil's grandmother (!) was walking across Kang-wha carrying the roof stone on her head and the side stones one under each arm. Finding the weight too much, she dropped the two from under her arms, and then stooping down, rested the roof stone on the top and left them there.\nanother year the governor added five feet to the rampart or put a new roof on the yamen, etc. When history is so told, one is apt to feel that one cannot see the wood for the trees. I propose, therefore, rather to select the two or three most salient events or groups of events and to treat them with such fullness as I may, leaving the rest to take care of themselves—only premising in a general way that, when you read in Korean history of the banishment of any prominent person, you may take for granted, if you think the fact of any interest or importance, that the place of exile is rather more likely to have been Kang-wha than not.\n\nThe prominent events which I propose thus to treat, as illustrating the history of Kang-wha, are (a) the Mongol invasion of the thirteenth century and (b) the Manchu invasion of the seventeenth century, with a closing reference to the French and American expeditions of our own day.\n\nThe Mongol invasion of Korea in the thirteenth century was but an incident in the frightful Tartar eruption which at that period shook the whole of the then known world to its base. A single remark will illustrate this. The very same movement which in 1233 sent the King of Ko-ryu cowering behind the ramparts of Kang-wha, in 1238 upset the domestic economy of the housewives of peaceful England, six thousand miles away, by dislocating the fisheries of the North Sea and sending up the price of herrings to two shillings a hundred.*\n\nWe in the West think a good deal of our Alexanders, our Caesars, our Napoleons, but, as Voltaire (quoted by Gibbon)† has remarked, \"our European battles are petty skirmishes, if compared to the numbers that have fought and fallen on the fields of Asia,\" and compared also, I would add, with the distances covered and the area affected by the conquerors. Temuchin, the father of these Mongols (蒙古), only felt himself powerful enough to assume the imperial title of Genghis Khan (成吉思), after subduing the seething mass of Tartar tribes in North-east Asia in 1206; yet before his death in 1227 he had established his power right across the centre\n\n*Matthew Paris, quoted by Gibbon, \"Decline and Fall of the Roman Empire,\" chap. lxiv. (footnote).\n†Decline and Fall, as above.\nof Asia from the Yalu and the Yellow Rivers to the Caspian Sea. Ogodai Khan (窝闍台), the son of Genghis, a few years later subdued Korea, extinguished the Keum or Chin (金國) dynasty, which till that date had ruled Northern China, added Siberia to his father's Asiatic conquests, and was only turned back when he had reached the confines of Austria and Germany, in the very heart of Europe, by a league of the sovereigns of Christendom under the Emperor Frederick II.\n\nKubla Khan (忽必烈), the grandson of Genghis, upset the Sung dynasty (宋國) (Song Nara, as we call it in Korea) in South China, and so became sovereign of all the Chinese empire, establishing himself as the first emperor of the Yuan (元國) (or as we call it, Wün dynasty), reduced the neighbouring countries of Tonkin, Cochin-China, Pegu, Bengal and Thibet to tribute and obedience and sent his fleets scurrying in all directions over the China Seas. And within less than a hundred years of Kubla's death, Tamerlane or Timur, another scion of the same Mongol family, had conquered the teeming empire of Hindustan and set up at Delhi that dynasty of Great Moguls (or Mongols) which only expired within our own memory. The island empire of Japan, alone of the countries of the East, succeeded in keeping the Mongol hordes at bay, and the Mamelukes, meeting them on the confines of Egypt and Syria, headed them off the continent of Africa. Constantinople, the still Christian capital of Eastern Europe, escaped as it were by a miracle, and the united strength of the monarchs of Christendom checked their advance in the centre of Europe. But with these exceptions, the whole of the then known world, from the shores of the Sea of Japan to the banks of the River Danube, and from the Arctic Ocean to Cape Comorin, was made to feel the weight of the Mongol's hand, even in places where the conquering hordes did not succeed in permanently establishing their dominion.*\n\nTurn we now to Korea, whose inhabitants had long been familiar with the phenomenon of a constant ferment among the Tartar tribes to the north of the Yalu River and the Long White Mountain. When the ferment became more than\n\n*See Gibbon, \"Decline and Fall of the Roman Empire,\" chap. lxv., from which and the preceding chapters most of the facts in this paragraph are taken.\nusually active, detached portions of these Orangk'ā* not infrequently overflowed the borders into Korea itself. One of these tribes had succeeded in establishing itself since 1115 as the imperial power in North China, under the name of the Keum or Chin dynasty. And the kings of Ko-ryū had therefore to tender a divided allegiance to the ruling powers in China—a sentimental allegiance to the Song Nara or Sung dynasty, whose capital was at Hang-chow and whose authority did not stretch north of the Yellow River, and an allegiance of more practical import to their nearer neighbours, the Keum Nara, whose capital was at Kai Fung. With these latter they were on terms of friendship and intimacy, envoys frequently passing between the two countries, while with the Kitan (契丹), another Tartar tribe which had already been forced to yield the supremacy to the Keum Kingdom and which was ere long to share in its fall before the rising Mongol power, the relations of the Koreans were almost uniformly inimical. The unhappy kingdom of Ko-ryū itself was not in a position to offer much resistance to pressure from without. The Wang (王) dynasty had been on the throne at Song-do since 936 A.D., but the central control over the more distant parts of the kingdom seems to have been very loose; and even at the centre the power of government was frittered away in constant faction-fights between the civil, military and ecclesiastical (Buddhist) officials, whose relations to one another present a sort of caricature of that union of church, lords and commons, as the \"Three Estates of the Realm\" under the crown, which is such a familiar feature in the English constitution.\n\nThe only person who seemed to count for nothing or next to nothing was the king. Probably Korea owes it to the founder of the present dynasty, as France owed it to Louis Onze, and England to the Wars of the Roses, that the power of the feudal nobles has been largely broken and the unity of the country made proportionately more practicable. Certainly in the thirteenth century the power of the nobles in Korea seems to have been immense. Like the daimios in Japan,\n\n*The Korean vernacular word for a savage or barbarian. Is it in any way related to the strangely similar name of a tribe (Ulianghai) marked in most old maps on the borders of Mongolia, Turkestan and Siberia? If so, does it throw any light on the origin of the Korean people?\nthey lived in their own fortified castles, maintained their own troops and generally did pretty much as they pleased. As a rule one among their number succeeded for a time in monopolizing the greater part of the political power and ruling as \"Major of the Palace\" or \"Tycoon,\" until his assassination placed the reins in someone else's hands. During the period of which we are treating now, for more than sixty years (1196-1258), the power thus remained for four generations in the house of Ch'oé. Ch'oé Chung-heui (崔忠獻), the first of the family to usurp authority, practically ruled the kingdom from 1196 to his death in 1218, and was directly responsible for the deposition and banishment of two, and the succession of four, out of the five monarchs who \"flourished\" in his lifetime.\n\nThe first ripple which heralded the coming Mongol storm appeared in the reign of King Heui-jong (熙宗), 1204-1211. In the last year of his reign, a Korean envoy on his way to the court of Keum was captured and slain in what is now Manchuria by Mongol soldiers. The same year witnessed a conspiracy in Song-do, in which the king took a hand and which had for its object the removal of the all powerful Ch'oé Chung-heui. He was, however, quite equal to the occasion, and seizing all the conspirators, including the king, banished them to various places of exile, where they would be likely to do less mischief than in the capital. The wretched king was first sent to Kang-wha and then shifted about from one island to another, at the whim of Ch'oé Chung-heui and his son Ch'oé U (崔瑫), until after twenty-six years of exile he ended his miserable existence in 1237 and was buried in Kang-wha, where the site of his tomb is still shown some 20 li south of the city.\n\nIn the place of the exiled king, Ch'oé Chung-heui set upon the throne an old man of sixty, the son of a previous King Myung-jong (明宗), who had also been deposed by Ch'oé some fourteen years earlier.\n\nThe new king, Kang-jong (康宗), who had spent these fourteen years in exile in Kang-wha and who thus found himself unexpectedly restored to the throne of his fathers, only reigned two years, and the crown then devolved upon his young son, King Ko-jong (高宗), 1214-1260, whose reign was\nto be the longest and perhaps the most troublous in the annals of Ko-ryū, as it was certainly the reign the most intimately connected with the island of Kang-wha.\n\nKo-jong had hardly ascended the throne when his country was overrun by hordes of Kitans,* who had been pushed over the border by the growing restlessness of the Mongols, and who between the years 1216 and 1218 ravaged the country far and wide as far south as Chün-ch'ŭn (春川), Won-ju (原州), and Ch'ung-ju (忠州). In 1218 these Kitans withdrew to the north of Korea and shut themselves up in the citadel of Kang-dong (江東), some thirty miles east of P'yŏng-yang. A large force of Mongols and other Tartars had now entered Korea under a general named Hap-jin (哈真), in pursuit of the Kitans, who were promptly beleaguered in Kang-dong. The Mongol general made friendly advances to the Korean government which were warily accepted, and ultimately a body of Korean troops joined the Mongols in the siege of Kang-dong. When the Kitans finally surrendered, their chief leaders were executed, but the remainder of the prisoners were scattered as colonists over the surface of Korea. The Mongols then retired with every expression of friendship and esteem for their Korean allies—expressions which may or may not have been sincere at the time, but which, in the light of after events, the Koreans may be pardoned for regarding as somewhat hollow. Some three years later (1221) Mongol envoys arrived in Korea for the purpose of inspecting the resources of the country.† Their manner was rough and overbearing and gave great offence to the Koreans, but it seems to have been really an accident that these Mongol envoys fell among thieves and were murdered on their way back to Mongolia in 1225. This, however, was the beginning of woes for the Koreans. Genghis Khan had died in 1225 and was succeeded by Ogodai Khan, his son, in 1229. One of the first acts of his reign was in 1231 to despatch a body of troops into Korea under a general named Sal-yé-t'ap (撒禮塔), to exact\n\n* I cannot but distrust the numbers. Some 50,000 odd are said to have surrendered at Kang-dong in 1218, and this after two or three years of roving warfare up and down Korea.\n\n† We know from other sources that Genghis Khan was away from China at this time, engaged in the subjugation of Bokhara, Samarcan, etc., in Western Asia. It is an interesting proof of the reliability of the Korean annals that these envoys are described as coming from the brother and wife of the khan.\nsatisfaction for the murder of the envoys six years before. The feature of this war was the obstinate and successful defence by the Koreans of a fortress named Ku-ju (龜州), now (龜城), not far from Eui-ju; but in spite of all, before long the Mongols arrived before the walls of Song-do, and in the hasty preparations made to put the place in a state of defence, it was observed that all the serviceable troops were engaged in guarding Ch’oé’s castle, while the protection of the city walls was left to the old and feeble and even to the women. The unhappy king now opened negotiations with the Mongol general, who agreed to retire on the payment of a heavy indemnity; and accordingly in the spring of 1232 they withdrew from Korea, though the withdrawal was followed by the despatch of seventy Mongol officials, to act as “political residents” in the capital and elsewhere. No sooner, however, had the Mongol troops disappeared than Ch’oé U, son of Ch’oé Chung-heui and now “Mayor of the Palace,” bullied the king into removing his court and capital to Kang-wha, on the ground of its greater security in the event of a fresh Mongol invasion. There was great opposition to the proposal, and while the king wavered, Cho’oé U cut the matter short by starting thither himself. As he probably took with him all the treasure and most of the troops, and as for years past the very government offices had been quartered under his roof, there was nothing for it but for the king and court to follow. The move from Song-do to Kang-wha took place during the rainy season, and the native historian has drawn a graphic picture, almost worthy of Carlyle, of the miseries endured by the royal cortège, slipping about on the miry and flooded roads under the incessant downpour of the summer rains. Even the bones of the king’s ancestors were taken up and re-interred in Kang-wha, and though they were removed again some forty years later, what is probably the place of their temporary sojourn (蓋骨洞) is still pointed out about ten li south of the present city.\n\nBetween the years 1233 and 1237 the Kang-wha ramparts were built and in 1234 the palace was taken in hand.\n\nThis removal of the court and capital to the “islands of the sea” supplied the Mongols with a fresh grievance, and Sal-yé-t‘ap was again despatched with a Mongol force to bring the king to his senses. This expedition is said to have been with-\ndrawn in 1233 in consequence of the death of the commander (who had been acting with great brutality) by a chance shot from the bow of a monk in the town of Yong-in (龍仁). But the Kang-wha annals declare that the withdrawal was largely due to the successful representations on the subject made to the Mongol khan by Yi Kyu-bo (李奎報), a scholar and official of Kang-wha, whose memory is still revered and the site of whose house and grave are still pointed out. But though they may have retired for the time, the persistent refusal of the king to leave Kang-wha and return to Song-do during the remainder of his long reign of forty-five years was a constant source of annoyance to the Mongol court. Message after message was sent to the old king—and received by him with a show of obedience—ordering his instant return to the mainland. And Mongol troops were constantly on Korean soil, sometimes on the plea of hunting otters, and sometimes to back up the imperial demands for the king's return to Song-do. They seem, however, never to have landed on Kang-wha itself, though we read of the king on one occasion crossing the water to hold a conference with the Mongol envoys at what is now P'ung-dok (豐德), and on another of the Mongol troops climbing Mun-su San, opposite Kap-kot-chi, and looking down thence across the straits into the city. At last, in 1259, the old king died, full of years if not of honour, having two years previously been set free from the tyranny of the Ch'oé family by the murder of the great-grandson of the original Ch'oé Chung-heui. The king was buried about five li outside the west gate of the city, where the site of his tomb is still shown, near the Blue Lotus Temple, in the district of Kuk-jong (國淨).\n\nAt the time of Ko-jong's death his eldest son, the crown prince, was in residence at the Mongol court and the government of Korea temporarily devolved on Ko-jong's grandson, under whom steps were immediately taken for the return of the court to Song-do. This removal, however, did not take place for full another ten years (in 1270). And during this period Kang-wha remained the capital of Korea, a position it thus held for nearly forty years.\n\nKubla Khan, known to the Koreans as Hol-p'il-yüli (忽必烈), was just on the point of succeeding his brother Man-gu\non the Mongol throne, when the news arrived of Ko-jong's death. The crown prince, who was now to succeed to the throne of Ko-ryū and who is known to us as Wūn-jong (元宗), had a very flattering and gratifying interview with Kubla and was honourably despatched to his native land, and from henceforth the relations of the two countries seem to have been friendly. The Mongol \"political residents\" were recalled and only re-established ten years later at the king's request.\n\nIn 1263 Kubla assisted in putting down a rebellion headed by a noble named Im, who had confined the king to the palace and invested himself and his friends with sovereign power. In 1270 King Won-jong went to the Mongol court to ask for the reappointment of \"political residents\" and to beg for a daughter of Kubla's as a wife for his son. Both favours were granted, and a Mongol princess, who boasted of the extraordinary name of Hol-do-ro-kyūl-mi-sil (忽都魯揭米實), became the wife of the crown prince, who ultimately succeeded to the throne of Korea as King Chong-gū (貞忠烈) in 1275. In her favour apparently the prince's original wife (none other than the Queen Chong-wha (貞和) who helped to found the temple of Chun-teung Sa) was degraded to the second rank, and the presence of these two ladies at court was the source of more than one palace intrigue. In 1270, the capital was at length removed to Song-do from Kang-wha, and in 1274, the year in which the Koreans joined in Kubla's disastrous expedition to Japan, King Wun-jong died,* and was succeeded by his son Chi'ung-yūl, who was, however, at the time resident at the Mongol court and did not return to Korea with his Mongol consort till some months later.\n\nWith the accession of Chi'ung-yūl, and the removal of the capital to Song-do, the main stream of Korean history flows away from Kang-wha again, though for a short period (1290-92) Kang-wha became the capital for a second time, shortly before the death of Kubla Khan. This was in consequence of the invasion of the Hap-tan (哈丹) Tartars, who were fugitive rebels from the rule of Kubla, and who were shortly suppressed by the aid of Mongol troops. The court then\n\n*King Wun-jong was not buried at Kang-wha like his two predecessors; but besides their tomb Kang-wha also boasts the tombs of two queens, the consorts respectively of Ko-jong and Wun-jong, the 博陵 and 嘉陵.\nreturned to Song-do, which remained the capital for another century, until the foundation of the present dynasty in 1391-92.\n\nAnd now let us take a jump of three hundred and fifty years, from the close of the thirteenth to the middle of the seventeenth century—from the invasion of the Mongols to that of the Manchus, whose descendants have occupied the throne of China for now nearly three hundred years.\n\nEver since the rise of Nurhachu (1559-1626) \"the real founder\" of the Manchu power and of the present dynasty (called by the Koreans Ch'üng Nara) in China, the Manchu power had gradually extended itself from its first home in the neighbourhood of Moukden, and the power of the Mings (called by the Koreans Myüng Nara) had proportionately failed, until in 1635 Nurhachu's son Ch'üng-jung (天聰) thought himself justified in assuming the title of Emperor of China. The Koreans clung to the cause of the falling Mings with a tenacity like that of the Jacobites in England in the seventeenth and eighteenth centuries.*\n\nThis not unnaturally brought on them the anger and vengeance of the rising power, and in 1636-7 they were made to feel it. In the fifth year of King In-jo (仁祖大王), (1628), there had already been a preliminary invasion of the Manchus, during which the king had taken refuge in Kang-wha. But at a conference held in the Chin-hä Ru (鎮海樓), or Gate Tower (still standing) at Kap-kot-chi, between the Manchu envoys and the ministers of the king, the Manchus were prevailed on to withdraw their forces by promises of submission on the part of the Koreans. It was their disregard of the undertakings then given which brought on them the terrible humiliation and sufferings of the Pyüng-ja Ho-ran (丙子胡亂) (1636-7), which with the Im-jin Oai-ran (壬辰倭亂) (1592), remains one of the two great landmarks in the history of the present dynasty. I take up the story at the point at which it begins to affect Kang-wha—my chief authority being the great tablet to the Sün-won Sün-säng, which stands opposite the bell tower in Kang-wha city.\n\n*To the present day a Chinese, as representing the Manchu power is usually a Ho-in (胡人) to a Korean; and for many years, indeed almost until recently, when they thought they could do so with impunity, the Koreans by a polite fiction dated documents, etc., by the regnal year of Sung-jong, the last of the Mings.\nAlarmed by the Manchu advance the king had already sent the ancestral tablets of the royal family to Kang-wha, together with the crown princess and her son* and two other of his own sons, of whom one was afterwards to succeed him as King Hyo-jong (孝宗). He himself (and presumably the crown prince) was on the point of following them—indeed the royal cortége had left the palace and gone as far as the South Gate of Seoul—when the appearance of the Manchu advance guard in the neighbourhood of the Peking Pass necessitated a sudden change of plans, and the king directed his course to Nam-han San-sung (南漢山城) where he remained shut up until the conclusion of peace and the withdrawal of the invaders. The Manchus, masters of Seoul, promptly invested Nam Han and detached a large portion of their forces to Kang-wha. The defence of Kang-wha, which now contained, besides the royal party, hundreds of other and less distinguished refugees, had been entrusted by the king to two high officials, named respectively Kim Kyŭng-jeung (金慶徵) and Yi Min-gu (李敏求), in conjunction with the then Yn-su, whose surname was Chang (張紳). And what followed affords a signal instance of the poltroonery and selfishness sometimes found in high official circles, in Korea as well as elsewhere, and of the latent patriotism and courage sometimes called out in quarters where it is least looked for. The high officials above mentioned, confident in the strength of Kang-wha's natural defences and in the fact that the approach by ferry was made more difficult, as it is to this day, by the vast masses of floating ice—for it was now mid-winter—took practically no measures to secure the safety of their charge. They wasted their time in dissipation and pleasure-seeking, and met with contumely and abuse any suggestions made to them as to the desirability of doing something to resist possible invaders. The result was as might have been expected. In a few days the Manchu forces appeared at the Kap-kot-chi ferry, and meeting with but feeble resistance at this point—which might and should have been strongly defended—they marched almost without opposition straight into the city, where they secured the person of the crown princess and, having subsequently\n\n*I suppose that this is the meaning of the expression 元孫.\ncaptured the young princes, marched back with their captives to Nam Han, after having practically destroyed Kang-wha city and put hundreds of the refugees and residents to the sword. The young princes are said to have escaped through the North Gate and only to have been captured at Pu-gun Tari (扶君橋), between five and ten li to the north-west. The memory of this event is kept alive by two things—first, the name of the tong-na and bridge, which signifies \"Seize Prince;\" and, secondly, by a curious mark, known as the P'i-pal, or Bloody Footmark, on the stone which forms the bridge. This mark is of course really a perfectly natural mark in the stone, but it certainly has a most singular resemblance to a blood-red footmark on the white stone and is believed by Koreans to mark the spot on which one of the princes stood when he felt his Manchu captor's hand on his shoulder.\n\nMeanwhile, Kim, Yi and Chang, the three officials who were responsible for the defence of Kang-wha, had slipped away by boat at the first approach of danger and left the place and its occupants to shift for themselves—a piece of disgraceful cowardice for which, as they richly deserved, they were rewarded with the death penalty after cessation of hostilities. But the black picture of their cowardice is relieved by numberless stories of real heroism, the memory of which is kept alive by three remarkable monuments in Kang-wha and by the periodical offering of state sacrifices to the loyal men and women who then perished. The greatest and most important of these is offered on the spot inside the present West Gate (麥壇祭壇), where most of the victims suffered, every sixty years, when the cycle brings round the year Chung-ch'uk (丁丑), being that in which the disaster took place.\n\nThe three monuments are (a) the handsome tablet to the Sun-won Sun-sang, opposite the bell, which luckily escaped the conflagration of 1866; (b) the weather-beaten tablets, erected to the memory of the \"Three Faithful Soldiers\" (三忠壇), on the hill behind Kap-kot-chi, where these heroes, with a mere handful of men, offered what resistance they could to the advancing Manchus; and (c) the handsome temple, known as the Chung-yul Sa (忠烈祠), erected on the site of the Sun-won Sun-sang's house by the grateful King In-jo, in 1642, i.e., some six years after the event. Here are preserved the\ntablets of twelve of those whose conduct in this disaster was most worthy of remembrance—that of the Sün-won Sün-säng in the middle, with those of his eleven fellows, including the \"three faithful soldiers,\" ranged on his right and left; and here sacrifices are offered in their memory by a grateful government in the spring and autumn of every year.\n\nThe Sün-won Sün-säng, to whom we have thus referred so often by his posthumous title of honour, was a nyang-ban of the name of Kim Sang-yong (金尚容), who, as far back as 1590, had risen to high rank in the government and distinguished himself by the uprightness of his conduct and the faithful discharge of his duties under more than one monarch. In early youth he had lived in Kang-wha in a house outside the city, the site of which is now occupied by the Ch'ung-yül Sa. At the period of the Ho-ran or Manchu invasion, being now an old man and having long retired from office, he had settled again in Kang-wha, apparently occupying a house close to the present bell-kiosk. He had been foremost among those who urged the officials—Kim, Yi and Chang—to put Kang-wha in a proper state of defence; and when the news of the king being besieged in Nam Han reached Kang-wha, he had urged the despatch of a \"forlorn hope\" to attempt a rescue. He met, however, with nothing but insolence and abuse. But though his family urged him now to save his life by taking boat and escaping to some remote island, he steadily refused to \"steal his life,\" (偷生) by deserting his country in the hour of danger. On the fatal day when Kim, Yi and Chang fled, leaving the road to the city open and unprotected, and the Ho-in were seen approaching the city wall, Kim Sang-yong, bidding farewell to his family, mounted the pavilion over the South Gate, where a great quantity of gunpowder had been stored, and making signals to the bystanders to move out of harm's way, placed a match to the powder and perished in the frightful explosion which followed. His little thirteen-year-old grandson had followed him up to the pavilion, and when the old man bade a servant take him to a place of safety the little fellow clung to the old man's side and begged to be allowed to die with him, a request echoed by the slave in his own behalf and gratified in both cases, for both were killed in the explosion, as were two or\nthree other brave men, who voluntarily faced death rather than dishonour. The \"three faithful soldiers,\" who, with Kim Sang-yong and others, are honoured in the Ch'ung-yul Sa and to whose special honour the tablets before mentioned were erected on the hill behind Kap-kot-ehi, where they died, bore the surnames of Whang, Ku and Kang (黃善身, 具元一, 姜興業) respectively. Of these the former held the high rank of Chung-gun, or Military Lieutenant-governor of Kang-wha, while the other two were men of much lower rank, being no more than Ch'un-ch'ong (千擇) or captains of companies. Whang had done his best to persuade his chief, the Yu-su, to take effective steps to stop the enemy's advance. He was, however, laughed at for his pains, and was finally given a handful of feeble troops and told to go and face the enemy with them. Seeing the day was lost, he called Kang to his side, and they two sallying forth beneath the Chin-ha Ru, still standing on the water's edge at Kap-kot-ehi, fought till their arms refused to draw the bow any more, by which time they had sent several scores of Ho-in to their account. Worn out at last, they were taken captive, fighting to the bitter end, and slain. Meanwhile Ku-wun-il, who had been striving to get the Yu-su Chang to take some active steps, now that Kim and Yi had fled, finding his urgent entreaties unheeded, passed from entreaty to bitter rebuke, and finally, bursting into tears, turned and prostrated himself four times towards the distant Nam Han where his sovereign lay besieged, and then jumped into the river, sword in hand, and was drowned.\n\nSuch are some of the tales of patriotism and courage which help to relieve the black impression left by the action or inaction of those whose duty it was to have spared no exertion and to refuse no risk. And the Kang-wha annals record the actions of scores of others, men and women, bond and free, who deserved well of the republic on that black day.\n\nDid time and space allow I should like to ask you to take one more leap with me, this time from the middle of the seventeenth century to the middle of the nineteenth and to listen to the story of the French and American expeditions against Korea, which made Kang-wha again the scene of bloodshed in 1866 and 1871. But the first of these stories is\nso admirably told in the pages of Pere Dallet's book,* whence it is transferred almost bodily, with some curious mistranslations, to the pages of Griffis' Corca, the Hermit Nation,† that there seems the less need to recount it here. And the other is so fully treated by Mr. Griffis himself in the book above mentioned, which is easily accessible to all, that I propose to refer you to his pages for that also.‡\n\nTo the information which he there gives, I will only add that two tablets now stand on the headland above Son-dol Mok, erected (as it is stated on the inscription) by the people, great and small, of Kang-wha, in grateful memory of those who fell fighting, as they deem it, for their country, under the guns of the American squadron in 1871. A small chapel for offering sacrifice to the manes of the deceased soldiers, which was erected apparently at the same time, seems now wholly neglected and is rapidly falling into ruin.\n\nThe tablet gives a list of all those slain on the Korean side, amounting in all to four officers of varying rank and forty-nine of the rank and file. The discrepancy between this and the two hundred and forty-three mentioned by Griffis is so great that one feels it requires some explanation.\n\nI believe that the grounds of the monastery at Chundeung Sa contains a similar tablet in memory of the French expedition of 1866. In 1876, five years after the American expedition, the Japanese treaty with Korea, which led the way to the opening of the country to foreign intercourse, was signed, as I have already told you, in Kang-wha, which from that date to this has not been disturbed by war's horrid alarms. Let us hope that the island, whose name is thus intertwined with some of the most stirring events in past Korean history, will not fail to secure its full share in the enjoyment of this era of peace, prosperity and good government to which we all are looking forward as we stand on the threshold of the twentieth century after Christ.\n\n* Histoire de l'Eglise de Coree, Vol. II, pp. 572-586.\n† Corca, the Hermit Nation, pp. 377-387. I would suggest that the French \"une arche—surmontee d'une toiture en pagode\" can hardly be rendered \"surmounted by a tortoise! and a pagoda!\"\n‡ Griffis' Corca, the Hermit Nation, pp. 403-419.\nTHE SPIRIT WORSHIP OF THE KOREANS.\n\nBY REV. GEO. HEBER JONES, M.A.\n\nIntroductory to our subject an interesting question presents itself which we may profitably pause to consider and attempt to answer. The question is, Do the Koreans possess a religion? While students in Korea seem now to have reached a basis of agreement, in former years it was much debated—a strong difference of opinion prevailing, some holding to the negative and some to the affirmative. Those who held to the negative side of the question meant, however, to declare, not that the Korean people were devoid of all idea of religion, but that the old systems had fallen into decay and lost their hold on the people, so that to all practical purposes they were nonexistent. This question is an interesting one even today to students of Korean conditions, but it seems to me that the definition of terms must play a large part in the final solution.\n\nWhat is meant by the expression \"possess a religion,\" as a phase of national life? Some would reduce the answer to the smallest possible content and claim that to \"possess a religion\" implies nothing more than that the religion has become a phase of national life and that a large number of the people accept its tenets and observe its rites. If this be a sufficient definition, then Korea \"possesses\" three religions, viz., Confucianism, Buddhism and Shamanism. This was the position of those who took the affirmative—that Korea has a religion. Others, however, held that this was far too low a concept of \"possessing a religion,\" and would be satisfied with nothing less than the definition of Principal Caird: \"Religion is the surrender of the finite will to the infinite, the abnegation of all desire, inclination and ambition that pertains to me as this private individual, the giving up of every aim or activity that points only to my exclusive pleasure and interest, and the absolute identification of my will with the will\nof God.\" Thus speaks the Christian scholar; and in the peculiarly Christian sense of this view none of the above mentioned religions can be said to have a religious hold on the Korean people. And this is the contention of those who held that Korea was without a religion.\n\nThe question we are therefore seeking an answer to resolves itself into one concerning the development of the religious sense of the Korean people, and on this there is small ground for controversy. Any one acquainted with the Korean people will know that they have a religious sense, though it may be on a low plane of exercise.\n\n1. They possess a sense of dependence on that which is above and superior to themselves. They look out of themselves in time of need. It may be only into the great blue firmament above, but it is a look of expectation and hope.\n\n2. They firmly believe that the human and the divine find a plane of intercommunication and relation.\n\n3. We find everywhere among them an earnest striving of the soul after freedom from annoyance and pain.\n\nAnd over against these three subjective conditions stand the various religious systems held by the Korean people, with their solutions of the problems and questions of human destiny. The missionary, blinded somewhat by strong personal views of the superiority of the faith he propagates, and the anthropologist with a keen desire to sink to the lowest depths the level from which the man of to-day was evolved, may affirm of a people that they are without a religion, but the facts always prove the contrary. \"A religious system is a normal and essential factor in every evolving society,\" and as such it is not wanting in Korea.\n\nWe have mentioned three forms of religious belief as prevailing in Korea to-day. What is their relative status? They may be said to exist as a community of religious belief, and no one of them is the religion of the Korean people to the exclusion of the others. The worship of the dead, as formulated by the Confucian school, is the religion of the imperial house and as such is the state religion, for in Korea the reigning house is always the State. As such, Confucianism is recognised and protected by law, and the expenses in connec-\ntion with the state and provincial worship of the Confucian sages is a charge on the public revenue. Then every prefect is also compelled to maintain worship at the shrines of the local spirits and the *pom-neum*, or tithes of rice for the Confucian worship, also include rice for the official worship of these Shamanite gods. The Buddhist hierarchy has also a semi-official status. A Buddhist monastery on Kang-wha is utilized by the government as the depository for the duplicate archives of the dynasty and the monks constitute an official guard of them. Subsidies are also granted other Buddhist monasteries from imperial funds and in all Buddhist temples there will be found on the altars tablets to the reigning emperor, empress and prince imperial.\n\nOf these three systems Spirit Worship is the most ancient, its introduction among the Korean people being lost in the gloom of prehistoric times. The next in order of time was the cult of the dead to which Confucius afterwards gave his name, and which was probably brought to Korea by Keui-ja B.C. 1122. Buddhism did not come till fourteen hundred years later (A.D. 372). These three systems have existed side by side, or rather have overlapped and interpenetrated each other, until to-day they are held in the mind of the average Korean as a confused jumble. Confucianism has been able to maintain itself freer from adulteration than the other two, but Buddhism has not hesitated to appropriate Confucian ethics on the one hand and on the other to ally itself with Shamanism. Shamanism has absorbed from the other two cults nearly everything of a supernaturalistic character they possess, following no law of consistency or selection. Thus, while theoretically the Korean recognizes the separate character of the three cults of Confucianism, Buddhism and Shamanism, practically they lie in his mind as a confused, undigested mass of teaching and belief, hopelessly intermixed and chaotic. He believes in all three. He personally takes his own education from Confucius; he sends his wife to Buddha to pray for offspring, and in the ills of life he willingly pays toll to Shamanite Mu-dang and Pansu. The average Korean is thus a follower of all three systems, in the hope that by their united help he may reach a happy destiny.\nThe subject which I have selected for discussion is the Shamanite or Spirit Worship of the Koreans. By this is meant a belief in the existence of innumerable spiritual intelligences ranging in character from the mischievous and prankish Tok-gabi or goblin to the high and mighty Tā Chang-gun, Lord of the Spirit World; in the immanence of these beings and in their control of the forces of the natural world and of the destinies of man; in the obligation and subjection of man to these spirits and in the necessity of ceremonies and offerings in propitiation of them; a belief that these beings have the power to take possession of a man either for the purpose of afflicting him or of using him for their own purposes; that they perform many supernatural things among men, and that they possess a knowledge of the future and can be induced to reveal it and to aid or hinder man in his enterprises; that they hallow to themselves certain material objects, such as sheets of paper, calabashes, whisks of straw, earthen pots, garments, heaps of stones, trees, rocks and springs, and that many of the objects thus sanctified become genuine fetiches, endowed with the supernatural attributes of the being they represent, this being specially true in the case of portraits sacred to demons.\n\nWhile this definition is not complete in all details it fairly outlines the creed of the Korean Shaman. Concerning the character of these spirits, it is claimed that many of them are good and can be induced to exercise a beneficent influence over the life of man, but many are malevolent and no one of them but possesses the power to afflict man on the merest caprice, and does so. In this respect they correspond to the old Greek idea of a \"daimōn,\" and the word demonolatry is possibly a good name for the system.\n\nThis belief in demons, ghosts and goblins is not confined to Korea but is universal, and in Asia it is a large feature in the religious belief of the masses. It constitutes a vast undergrowth in the religious world through which the student must force his way with axe and torch. It differs from the ethnic cults of religion in that it is prehistoric, documentless and without system, and it lacks all articulation which would permit the religious anatomist to dissect and classify it. In development it is as rank as a tropical forest,\ndark as the burrow of a rat, as boneless as a fog, and as formless as chaos. If we attempt to trace its origin historically we get lost. In China, the ideographs for spirit, ghost and goblin are as ancient as those for heaven and God. In Korea, Tan-gun, the first character in the native histories—if he ever existed—was probably a shaman. And in Japan we are told that history takes its rise in the spiritualistic legends of Kami-no-michi.\n\nThe Shaman Pantheon.\n\nThe Korean name for this great systemless spirit worship is Sin-do (神道) or Spirit Way. It is sometimes confused by the Koreans with Sün-do (仙道) or Taoism, but this is a mistake on their part, and while the name of Lao-tse is known among them they do not appear to have adopted his cult.\n\nThe first article in the creed of the Shaman spirit worshipper is a belief in the existence of innumerable spiritual intelligences which control the fortunes of men. Most of these spiritual beings are represented to the eye by some material object or fetich, thus making fetichism an important feature of Korean Shamanism. The fetich, whatever it may be, is regarded as clothed with a certain sanctity and to it the Korean pays his worship. Spirit and fetich become so identified in the mind of the devotee that it is hard to determine which has the greater ascendancy, but it is certain that the fetiches, however decayed and filthy they may become from age, are still very sacred and the Korean dreads to show them violence. This shows itself in the prohibition to visit them sometimes imposed on converts to Christianity by non-believing relatives, because the convert’s presence before the fetiches so annoyed and angered them that they would bring disaster on the household.\n\nIt is a large task to undertake to catalogue the spirits in the Korean pantheon. When we remember that in Japan Sintoism claims eight million gods and in India Hinduism thirty-three millions, we can easily believe that the number is beyond native computation. It is difficult to describe them, because they are unhistorical; we can learn little that is coherent and consistant. They also elude classification,\nfor they know neither species nor genus. We can but take up a few of the more commonly known ones for consideration. These are selected at hap-hazard, but they are representative of the entire class and will indicate the facts of the whole.\n\n1. The O-bang Chang-gun (五方將軍). If you should visit the home of one of the blind soothsayer priests of this system in Korea you would find there a shrine or altar hung with red silk, and containing a banner or tablet inscribed with the collective names of the spirits of the O-bang Chang-gun or the God-Generals of the Five Quarters of the Sky. According to the blind shamans these spirits rule the visible firmament and are the chief deities of the Korean pantheon. To them the shaman pays his best devotions with prayers, bell-ringing and incense, and upon them he depends for aid in all his work. Their names and jurisdiction as given to me by a shaman are as follows:\n\n(a) The Ch'ung-che Chang-gun (青帝將軍), or Green God-General, ruling the eastern sky.\n\n(b) Ch'uk-che Chang-gun (赤帝將軍), or Red God-General, ruling the southern sky.\n\n(c) The Pak-che Chang-gun (白帝將軍), or White God-General, ruling the western sky.\n\n(d) The Heuk-che Chang-gun (黑帝將軍), or Black God-General, ruling the northern sky.\n\n(e) The Whang-che Chang-gun (黃帝將軍), or Yellow God-General, ruling the middle sky.\n\nThese five gods are in many places regarded as the tutelary gods of small villages and you will often find a group of posts, rudely carved to represent human beings, at the entrance and exit of a village, which stand for these Chang-gun. With the group will also be found a pole surmounted by a wooden duck, which seems to be the sign of the generals. These Chang-gun are supposed to protect those who are their favourites, and their fetich is a very common one in Korea. Thus they stand on a road leading in and out of a village or at the entrance to a valley in which a hamlet may be located, to warn away any evil-minded spiritual wanderers from entering and molesting the inhabitants. And each year a sacrifice of rice dough and fruits is offered to them as a propitiation.\n2. The Sin-jang (神將). Below the five great generals are their lieutenants who obey their behests and wait in a special manner upon the shamans. These spirits are known as the Sin-jang or Spirit-Generals. They number eighty thousand, and each is at the head of a spiritual host. This will enable us to understand how easy it would be for Sintoism to have eight million gods and Hinduism thirty-three millions. By the use of his magic formulas any blind shaman can call to his aid one or more of these spirit-generals, with their hosts of followers, and secure their aid in exorcism or divination. To them the Koreans also privately erect shrines which will contain a daub of a painting representing the spirit-general, divinity being indicated, as is the case with most pagan art, by monstrosity.\n\n3. The San Sin-yŭng (山神霊), or San Sin (山神). Korea is a mountainous land and the Koreans are mountaineers. To understand either the one or the other this fact must be given due weight. Brought up amidst these huge piled-up masses of rock and earth, taught from earliest childhood to scale their heights, spending his days in their ever-changing lights and shadows, which seem to give new forms to the mountains themselves, the Korean, in his poetry and prose alike, betrays the influence the mountains have had upon him. There is always an air of mystery about mountains, and this mystery has penetrated the Korean's innermost soul. He loves them; he does not understand them; he fears them. Through their mighty bowels flows a pulsing flood of vital life that breeds men of desperate valour, so he says the ancients erected their ponderous dolmens and cromlechs to cut off the flow of the life-pulse and allow men instead of warriors to be born. But of all the mysteries of his mountains, that which pleases and at the same time terrifies him most, is the San Sin or Mountain Spirit. The mountain spirit dwells somewhere up on the slope towards the summit and is the real proprietor of the soil. And when the simple country folk go to gather wood on the rugged sides of the mountain they half feel like intruders and a fear and a dread comes over them lest he punish them for theft. Then when the wood gatherers assemble at mid-day for their meal, the first spoonful of rice is cast out on the mountain side to the San Sin. They dread to\noffend him; and when the sickle slips and the foot or hand is cut, or a sudden fall and a broken limb results, they wonder what offence they have committed against the San Sin.\n\nIn passing through Korea the shrines to these San Sin will often meet the eye. They are only miserable shanties at the best, built beside some gushing stream or beneath some umbrageous tree or over some moss-covered rock. In the latter case, the rock serves as an altar and the shrine is regarded as especially fortunate. Here the spirit is represented by a picture, usually showing him to be an old man clad in official robes of high rank and sitting on a tiger. Most of the San Sin are represented as males, and in this case the temple will contain portraits of the members of his harem and altars to them. But sometimes the San Sin is a goddess, and then the picture will be of a woman with men attendants. At one shrine in South Korea I found that a Japanese kakemono, with the picture of a beautiful Japanese type, had been hung in the shrine and was worshipped as the goddess by the mountaineers.\n\nThe San Sin is the special deity of the hunters of deer and wild ginseng, and is held in high honour by them. To him they present their vows and offerings and trust him for success in their expeditions.\n\nThe tiger is held to be the special servant and messenger of the San Sin and this adds to the terror in which he is held. Sometimes, when a man-eater begins his depredations in a neighbourhood, the people will conclude that the San-sin is angry with them and has sent the tiger to afflict them. Then they hasten to the nearest shrine to appease the spirit’s wrath with offerings. This demon is generally the special god of hermits, who pass their lives in his service. And very frequently a Korean will retire into some mountain fastness and spend one hundred days in prayer, fasting and bathing, trusting to secure an interview with a San Sin and his advice or aid in some personal enterprise. People who do this are ever afterwards held in peculiar sanctity by their neighbours.\n\nThis spirit is very often seen in visions by Koreans during a dream. He always appears as he is pictured in the portrait at the shrine or as a tiger. Both these visions are omens of good luck and the Korean is delighted to have one. Many\nare the curious stories they tell of their encounters with these San Sin and of what followed. The Koreans are great dreamers. I might say dreaming is a national pastime with them. But among their dreams some of the most curious are concerning these San Sin.\n\nOne of the best examples of a San Sin shrine is to be found in the mountain fortress at the back of the city of Yon-an. Here I found a well-built building with the portraits of many worthies who had perished at various times in behalf of the city, especially in its historic defence against the Japanese invaders of 1572. In front of the principal shrine was a group of spears and tridents and in the floor a stone with a round hole. When it was desired to know whether an offering was accepted or not a spear was inserted in the hole in the stone, point up, and if the spear stood upright it was regarded as propitious. It is needless to say that a little dexterous twist of the spear would always ensure it remaining erect if the shaman so wished.\n\nMuch more might be said about these Mountain Spirits. They are the mountain gods of a mountaineer people, and a whole paper might be taken up with the cult, the traditions and stories which pass current among the people, the methods of invocation and exorcism, but enough has been given to indicate the large place these San Sin fill in the Shaman pantheon.\n\n4. The Sun-ang Dang (城隍堂). This is the name of those heaps of stones, or cairns, which attract the attention of all visitors to Korea. The name is spelt in several ways. As pronounced by the people it is Sun-an Dang, but it should be written as it is given by Mr. Gale in his dictionary, viz. Sŭng-whang Dang. An analysis of this name gives us a hint of the meaning of the altar. It is Sŭng (城), \"wall, fortress, or city;\" whang (隍), \"site or locality;\" dang (堂), \"temple, shrine or altar.\" This would then give us as a translation of the name Shrine or Temple of the Site of the Fortress or City.\n\nThe altar or shrine consists of a heap of stones piled up beneath some tree or clump of bushes. The stones are all of small size and are put in place by votaries and passers-by. On the branches of the trees will be found scraps of paper,\nrags, cast-off garments, coins, locks of hair, sometimes the effigies of human beings, or utensils used for the offerings. These dangs are always found beside the road, sometimes down in the plain or at the entrance to a village, but more often in the top of a defile where the road takes its plunge over the crest of a ridge from one valley into another. Very often a small shanty is built alongside the cairn which will contain a daub of a picture, ordinarily of some animal, but often of the San Sin of the mountain. And sometimes these shrines become quite pretentious, being built of good timber with tiled roof and a keeper dwelling in a house beside it, while about it will stretch a grove of old trees. Here in the hot summer days the Koreans will come with wine and song and dance, to enjoy the grateful shade, drink of the cool springs close by, and bow at the shrine. This cult of the Sun-ang is specially strong in the Whang-hai province, though as already indicated it is much in evidence everywhere throughout Korea.\n\nThe dang is not sacred to any one spirit but seems to belong to all the local gods, and is a place where the people may meet and propitiate them. They are the most important factors in the work of the Korean shamans, but as this part of Korean life is peculiarly superstitious no rational, coherent explanation of them can be obtained from the Koreans. Here in the trees or among the stones the local gods are supposed to reside. The tree at the shrine becomes sacred to them and is called the \"Demon Tree.\" Here the protecting or tutelary spirit of the valley or defile holds court assisted by the mountain spirits, a few hob-goblins, with some \"unclean devils\" or sa-geui and such \"tramp imps\" or \"deun-sin\" as have been permitted to rest there. Here their reign terrorizes or delights the simple farmers about, sending weal or woe as they see fit.\n\nThe worship at the dang generally consists of an offering of food by the person seeking a favour, with prostrations and prayers. The common sight is a woman placing a few small bowls of rice on the stones and then rubbing her hands together and lifting them to her face, and while she bows or prostrates herself she whispers her petition. You listen. She murmurs \"Oh! Shrine of the Fortress! Listen I beg.\"\nOur house child is sick, and he will die. Hear us. Give life.\" And so on until she musters courage to gather up the offerings and take them back to the house. This is a very common sight and thousands of Koreans are sent every year to perform this at these shrines. The first fifteen days of each new year are fortunate for petitions for a year of prosperity and freedom from sickness and the dangs are specially popular at that time.\n\nTravellers also address their petitions to the Sun-ang as they pass. Many a time I have seen a Korean add a stone to the heap under a tree and at the same time spit in front of the altar. This expectoration-feature is a peculiar one in connection with the observances at the dang, and the only explanation I have heard is that it is an observance in connection with the superstitions about snakes. The Koreans stand in dread of offending a snake. They will rarely kill one, for they believe that if they do so the spirit in the snake will follow them through life and work their final and irretrievable ruin. So travellers, when they reach a dang, expectorate at it in order to give any snake-spirit that may be there something to occupy him until they are able to pass on out of view. This dread of a supposed spirit in a snake and the fear of its wrath is curious. May it not be a faint adumbration of the story which tells us that in the infancy of the human race the arch-foe of man, finding the serpent more subtle than the other beasts of the field, entered his body and in that disguise deceived our first parents—this fear of the visible agent being rather a tribute of terror to the one who once used the snake for his purposes?\n\nOf the rags, strips of paper and various objects which catch the eye at the dang there is generally a large variety. These are part of the symbolism of Shamanism and belong to the same category as the fetiches which play so important a part in the system. They are symbolic of the desires of the petitioners at the shrine. The following will give you an idea of their significance. A man goes to a mu-dang or female shaman to have his fortune told and learns that he will surely die that year. He naturally feels frightened and demands how he can ward off this calamity. He is told to make an offering in sacrifice at the Sun-ang Dang and to\nhang upon the tree beside it the collar of his coat. This becomes a symbol of himself and possibly there is a dim idea of substitution in it. The thread and the longer strips of rags are generally placed there in behalf of children and indicate a petition for long life. The coins are a sign of a prayer for money. The coloured rags I am told usually indicate the prayers of a bride, for the Koreans have a notion that when a bride leaves her father's house to go to her future home the household gods all try to go with her. This would mean the speedy destruction of her father's household; so at the first dang on the way she pauses, petitions them to come no further, and ties a strip of silk or cloth from her wedding outfit on the tree, to which they may fasten themselves and hold it in her place. Sometimes there will be other offerings such as salt, cotton, silk and kindred objects. These may have been offered by merchants dealing in these commodities.\n\n5. The To-ji-ji-sin (土地之神). These are the Earth Spirits and form an order by themselves. They differ from the Mountain Spirits or San Sin in that while the latter represent and brood over the mountains as such and are enshrouded in the awe which a Korean feels for the mountains, the Earth Spirits are simply the dwellers in that particular spot on the mountain which the Korean wishes to use. These occupy a prominent part in the funeral rites of the Koreans. They are supposed to be the occupants of the grave site and must be propitiated before the corpse can be laid to rest. This is done by a sacrificial offering resembling that to the dead and is presided over by two persons, a Ché-gwan (祭官) or \"Sacrificer\" and a Ch'uk-gwan (祝官) or \"Intoner,\" who intones the ritual. It will thus be seen that these \"Spirits of the Soil\" have really been adopted into the Confucian worship of the dead from Shamanism.\n\n6. The Chön-sin (尊神). In most hamlets and inhabited valleys will be found a shrine called the Chön-dang or Honourable Temple. This is the home of the Chön-sin or Tutelary Spirit of the village or group of hamlets in the valley. In the vicinity of Seoul his shrine will contain a portrait representing him in human form, always enshrined with great reverence and ceremony. I have seen shrines to the\nChŏn-sin in the country, however, where he was represented by a fetich consisting of a straw booth erected over a pair of sandals, the whole standing under a \"demon tree.\" He is in a special sense the community's god as a community, and the entire community is taxed by the local elders for the support of the sacrifices and worship. It is at this point Christians come into collision with their pagan neighbours. The latter are firm believers in the power of the Chŏn-sin over their welfare as a community and make a contribution to the worship at the shrine obligatory on all. To this the conscience of the Christians will not permit them to consent, hence they are treated as foes alike of gods and men. It is the old story of the conflicts in the Roman Empire. I would say, however, that in recent years non-Christian Koreans have become very concssive in this matter to their believing neighbours and that time will remove all friction. The periodical sacrifice at this temple is a very elaborate affair.\n\n7. The Tok-gabi (魍魎). These are the goblins and 'bogies of Korea. They are among the most universally known, feared and detested inhabitants of the spirit-world. The superstitions about them make them out to be a composite of the western ghost, Jack-o'-lantern, elf, brownie and gnome, but probably the best rendering of the Korean name and idea is that of goblin. They may be either spiritual in their origin or they may have sprung from a human original. In the latter case they are supposed to be the souls of men who have met a violent death. I investigated the case of a girl in Che-mulpo whom the Koreans said was demoniacally possessed and who claimed in her more lucid moments to be afflicted with goblins. The mu-dang shamans undertook to exorcise her and to their incantations she confessed that three goblins had her, one being the soul of a woman who had been burned to death, the second that of a woman who had been drowned and the third that of a man who had died by execution. This of course explains only a part of Korean goblindom, but to the Korean there is nothing inconsistent in the fancy that a man thus ending his life becomes a goblin. Thus it is that execution grounds, battle-fields, the scenes of murder and fatal disaster, are thought to be haunted by them. In this particular they are a counterpart of the western ghost. They\nalways go in troops, however, and are impish in appearance and behaviour. They are always represented as dwarfs and, like the fairies of old, can assume different shapes in which to deceive men. They frequent secluded glades and the banks of streams, and may be met under bridges and in caves. Empty houses will always be occupied by them and once they get in it is hard to get them out. The buildings that formerly stood in the old Mulberry Palace enclosure here in Seoul were reputed to be thus haunted, and frightful stories are still current among the people as to the scenes that occurred there every night. They sometimes take a fancy to a house or a village, and then life becomes unbearable for the unfortunate inhabitants. I often pass a nook in the hills of Kang-wha where once stood a small hamlet embowered in persimmon trees, but the goblins got after the people and so terrorized them every night that they finally arose, tore down their houses and moved to another place. A Christian once described an experience he claimed to have had with the goblins and, as it is typical of the goblin pranks Koreans describe, I give it. One night he was asleep with his family, when suddenly they were all awakened in terror by the sound of a terrible crash and roar as if a mighty wind had struck the house. Every window and door seemed to be straining and tearing out of its place; bowls and dishes were dashing about, and bedlam seemed let loose. They thought a storm had come upon them, and they fled outside only to find it beautiful and starry, not a breath of air stirring or a sound to be heard. Then they knew what it meant, and committing themselves to God they returned in fear and anxiety to the house again. All seemed quiet and they thought the goblins were gone, when, just as they were about to fall asleep again, the terrible crash was heard once more and riot reigned. This time the Christian stood his ground and instead of fleeing he and his family knelt and prayed to God, when the riot ceased as suddenly as it began and they had peace from then on.\n\nI doubt not but that this Christian had some sort of experience that night, though whether purely subjective or not I do not know, and the exact facts are impossible to obtain. No Korean story ever loses in the telling, and this is especially so of the Tok-gabi stories. But the account above given\nis thoroughly typical, and I venture to affirm that half of the Koreans living in the country today would claim to have had some sort of an experience like that. The goblin is up to all sorts of mischievous pranks. The good house-wife goes to bed at night with the rice-kettle cleaned and the lid on properly. The next morning she finds the lid in the bottom of the kettle, and how it got there only the goblins can explain, for no human ingenuity could jam an eight-inch iron lid through a six-inch opening into an iron pot.\n\nOnce when destroying the fetiches belonging to a convert I found one of a goblin. I do not think it is common for the Koreans to keep a goblin fetich, but this family had one. It consisted of a small straw booth mounted on poles and contained a horse-hair hat, like that worn by chair coolies, and a surplice such as is worn by yamen runners. These fetiches were rotten with age, yet the insane fancy of Shamanism had led this family to worship them and make offerings and prostrations to them for years.\n\nAbout the Tok-gabi centres much of the folk-lore of the people. It may be said to divide with the rabbit and the frog the honours in the folk-lore world. As a feature of Korean Shamanism it is of prime importance and has its own superstitions and ritual of exorcism. A very common belief in connection with the Tok-gabi is that the phosphorescent lights seen about the marshes are the Tok-gabi on the move and the people are invincible in this faith.\n\n8. The Sa-geui (邪鬼) or Deun-sin (淫鬼). Among the many classes of demons which hound the Koreans through life the Deun-sin or Tramp Spirit is about the worst. They are also known as Sa-geui or Unclean Demons, and the notion concerning them is that they are the criminals of the Shamanic spirit-world and, having been cast out from their original estate, are doomed to wander up and down through the earth with no resting place. The Koreans picture them as the beggars of the spirit-world, hopelessly ruined and lost and actuated in all they do by a diabolical hatred of gods and men. Our translators of the Bible have chosen a very fit word in this \"sa-geui\" as a rendition for the Scriptural term \"unclean spirit.\" An incident will show the prevailing superstition about them. Years ago during a visit to the distant city of\nWeui-ju at the mouth of the Yalu, I was summoned one night to the house of a woman who had met with an accident. It had been raining and the night was very dark. I had not gone very far along the main street of the city when I noticed a light in the distance in the middle of the road. On arriving at it I saw a strange sight—one I shall never forget. A woman had spread some straw and a mat over the mud in the middle of the road, set up a screen and placed a table loaded with food, fruit and nuts upon it, and by it two lighted candles. She stood at the end of the mat, engaged in bowing and prostrating herself, while out on the night air through the darkness, rang the wail of her voice in prayer. I asked my Korean companion the meaning of it, and he told me that the Koreans believe that the Deun-sin frequent the air over the middle of the road and that they are compelled by the other inhabitants of the spirit-world to wander up and down until some faulty action on the part of a human being gives them a foothold in his house. This opportunity they eagerly seize, and, taking possession of the man, all sorts of afflictions and trouble befall him. \"In that woman's house,\" continued he, \"there is sickness. She has been told by the mu-dang (female shaman) to propitiate the Deun-sin, so she is there in the middle of the road, under that part of the sky where they are, making her offering and gifts to them.\"\n\nThe Deun-sin is popularly regarded as the spirit or god of indigestion and persons suffering from a bad attack of this disease will often seek relief by propitiating it.\n\nIn their treatment of these unclean spiritual tramps the mu-dang, or female shamans, always propitiate and bribe them to depart; while the pansu, or blind male shamans, exorcise and capture them with the aid of the Chang-gun and Sin-jang or Spirit-Generals, and either set them adrift over the middle of the road or bottle them up and bury them in disgrace under the middle of the road.\n\n9. The Yong (龍) or Yong-sin. The dragon is very well known among the Koreans and is called a Yong. It is a water monster and has its dwelling-place in deep pools and in wells, ponds and lakes and along the river banks. This superstition concerning the dragon is probably as old as the present dominant race in Korea, and was brought by them from\ntheir ancestral home, which may have been somewhere in south-west Asia. It is one of the most ancient of man's childhood myths, and the fact that it is the common property of the various races on earth is testimony to the unity of mankind. We who come from the west with our superior civilization are almost as familiar with this monster as the people of the east, and though we no longer credit it, yet there was a time when it held a place in the popular beliefs of the white man. With the Aryan it has stood forth as a foe or enemy, or, possibly more accurately, as the symbol of disorder and destruction. The legends of Greece give it a place. Among the seven mighty labours of Hercules the slaying of the dragon was one. Other heroes, as Apollos and Perseus, were also dragon-slayers. The Teutons also made out their god Thor to be a slayer of dragons, and even in the legends of medieval Christianity the dragon has been adopted as a symbol and we have St. George and St. Silvester as dragon-slayers. In this latter case, Christian art has used its license of symbolism and the dragon is used simply as a symbol of paganism or sin, and under the picture of the saint slaying the dragon is set forth the conflict and triumph of Christianity over paganism and sin.\n\nBefore the days of Christianity the dragon was a matter of belief among our ancestors and the Saxons and Angles who invaded Britain bore it as a device on their shields and banners. Among the Celts it was the symbol of sovereignty, and Tennyson has shown a true historic sense in giving it a prominent place in the \"Coming of Arthur.\" In this connection I cannot resist the temptation to quote that scene which describes how the two magicians, Bleys and Merlin, went to get the babe and the vision which accompanied him. The poet tells us how they\n\n\"Descending thro' the dismal night—a night\nIn which the bounds of heaven and earth were lost—\nBeheld, so high upon the dreary deeps\nIt seem'd in heaven, a ship, the shape thereof\nA dragon wing'd, and all from stem to stern\nBright with a shining people on the decks,\nAnd gone as soon as seen. And then the two\nDropt to the cove, and watch'd the great sea fall,\"\nWave after wave, each mightier than the last,\nTill last, a ninth one, gathering half the deep\nAnd full of voices, slowly rose and plunged\nRoaring, and all the wave was in a flame:\nAnd down the wave and in the flame was borne\nA naked babe, and rode to Merlin's feet,\nWho stooped and caught the babe, and cried \"The King!\"\n\nHere we have in this picture the sea, the storm, the dragon-shaped boat, the flame and roaring, all attendant upon a royal babe destined to become a warrior, king and sage. It is but a poet's fancy, and yet it is a curious coincidence that in a land like Korea which holds to the dragon cult a native writer would have dealt with a like event in an almost identical manner. This fancy Tennyson maintains, making the dragons \"the golden dragon of Britain,\" the emblem of Arthur's kingship. And among the Koreans he is the emblem of royalty. He is the imperial beast and in the legendary origin of some of the dynasties he appears as a progenitor of the royal line.\n\nIn the present-day mythological lore of the Korean shamans the dragons are regarded as actual living beasts and earth, air, and sea as inhabited by them. A practical illustration of this superstition may be found in many of the cities and sections of the country. Here in Seoul, if you go out by the North-East Gate, you will find a place where the road goes over a ridge of land and is paved with flat stones, the reason being that this ridge is really a dragon's backbone and that the scuffling of the people's feet over the monster's back pained and angered him so that he had to be encased in stone. Like the tok-gabi (goblin), the dragon is the favourite theme of the story-tellers, and he is one of the stock features in most Korean novels. He generally appears as the herald of the birth of some marvellous child and all Koreans today regard a dream or a vision of a dragon as an omen of the very best import. I think that most Koreans believe in his actual existence and one in every ten Koreans you meet anywhere in the land would probably declare that at some time in his life he had seen a dragon.\n\nThe bulwarks of this fancy are the shamans. They foster the belief in the dragon and make him an important part of their teachings. They have a special ceremonial for propitia-\ntion known as the Yong-sin Kut (龍神), Dragon Service, and this is often performed in times of drought. For the dragon when angry shuts up the sky and withholds the rain. Sometimes death by drowning is attributed to the anger of the Yong and then a private kut will be held by the relatives of the dead to appease the monster. Thus this monster, part fish, part reptile, part bird and part beast, inspires the Korean with fear and reverence. His is a favourite name for Korean children and to him they are often sold. In selling children to the Yong the parents will take the child to the well, or a river's bank and there, with offering and worship, dedicate him to the dragon. From that time on the child, whether boy or girl, will be known as some kind of a dragon. The large number of \"dragon\" children among the Koreans indicates how popular is his worship.\n\nThis finishes our review of the spirits who may be found at the various shrines throughout Korea. We have selected only a few of the more common ones and besides those we have mentioned there are multitudes of others believed in and worshipped throughout the country. The task of describing them would be an endless one.\n\nBut Shamanism comes much closer to the Korean than these shrines about his towns and hamlets and along his roads. It enters his home and surrounds him there with its fancies so that day and night he is ever in the presence of the emblems of this spirit dominion. It is true we find no \"god-shelves\" in the house, but the gods are there just the same, and if you enter the house you will find that for a small mud hut the average Korean house has an over-supply of supernatural occupants. These household gods are a part of every Korean house, as much of the aristocratic gentleman's abode as of the low-born coolie's hut. While there may be no \"god-shelf\" in a Korean house yet no Korean (unless he were a Christian) would think of purchasing a house without first enquiring of the owner the names and character of the \"gods\" of the house. For when a Korean moves from one house to another he does not take his gods with him but passes from the dominion of the gods of the house he has left to that of the gods of the house to which he removes. This of course affects the price of Christian houses in the rural districts, for they are not as\ndesirable for pagan purchasers as those in which the house gods have not been disturbed. A pagan having found out the gods or demons of the house he has purchased will be careful to make offerings to them all, but if for some unknown cause one of his family falls sick he will seek the former owner and find out again the gods of the place and compare it with his list so as to be sure he has not omitted one in his offerings. Among these household lares of the Koreans the chief one is\n\n10. The Söng-ju (成造). The Söng-ju is the ruler of the Korean’s house, the spiritual major-domo of the entire establishment. His fetich is enshrined on the frame of the house as soon as the beams are set up and from that day he is lord of all who dwell within and their weal or woe is subject to his whim. His fetich consists of blank sheets of paper and a small bag of rice, which are hung from the ridge-beam of the principal room—generally the living-room of the house. This fetich is charged with protecting the family from all misfortune and especially from affliction at the hands of the demons.\n\nThe Söng-ju is set up at the time of the erection of the house after the following manner. After the site is graded and the framework of the house erected, a pause is made in the construction until a lucky day can be found for enshrining the spirit. Sheets of ordinary paper and a bag of rice containing as many spoonfuls of rice as the owner is years old are fastened to the ridge and prayer and worship offered. The construction of the house then continues until completed, when another lucky day is selected and a mu-dang shaman is called to preside. A Kut (賽神) or Grand Ceremony is held by her. A large sacrifice of food is prepared and an elaborate ritual gone through with until the mudang has worked herself up to the proper pitch of frenzy. She then seizes a wand, called the Söng-ju wand, which enables her to seek the Söng-ju, he having arrived by this time. When found he perches on the wand and drags her back to the fetich, into which she introduces him by violently shaking the stick and beating round about the fetich. He is supposed now to feed on the feast for a time, after which the food is passed out to the assembled guests who dispose of the material substance of the feast, the Söng-ju contenting himself with the spiritual essence of it. The Söng-ju thus becomes the chief protector\nof the house and every inmate lives in constant anxiety of offending him. The children are carefully taught not to tread on the threshold, for that is treading on his neck; and when a meal is eaten in the inner room all parties are careful so to place their tables that they will not be eating facing the fetich. This would anger him and cause him to afflict some member of the household.\n\nThe Söng-ju is worshipped each spring and autumn in common with other household gods, the spring sacrifice being a petition for a year of prosperity, and the autumn one being in the nature of a Thanksgiving or Harvest Home Festival.\n\n11. The T'ö-ju (土主). Ranking next to the Sung-ju in importance is the T'ö-ju or Lord of the Site. This demon represents a phase in that great system of Earth Spirits of which the San Sin, and T'ö-ji-ji-sin are parts. The Koreans themselves can give no coherent explanation of the spirit or his fetich, any more than that it is the custom to have one. The fetich consists of a bundle of straw set up like a booth on three sticks. It varies in height from one to three or four feet. Ordinarily this is all, but sometimes they combine with it the Öp-ju or God of Luck, who is represented by a rice pot with some grain in it, so that the two spirits conjoined make one fetich and are worshipped together. The fetich of the T'ö-ju is not set up immediately after the erection of the house, but on the occasion of celebrating the first great spirit fête afterward. It is then set up in a clean spot back of the house.\n\n12. Öp-ju (業主). This is the symbol of one of the cardinal features of Shamanism, namely luck. As far as my study has gone I cannot avoid the conclusion that the idea of blessing or grace, that is, the kindly favour of the deity bestowed out of pure love and kindness on his children, is not known. Shamanism does not rise to this high level, but remains down on the lower level of luck and ill-luck as the chief good or evil flowing from their deities. It is true that the Koreans have an expression called the O Pok—Five Blessings, viz. longevity, children, rank, wealth, and a peaceful death, but that is a purely Confucian idea. Shamanism concerns itself with luck and ill-luck. When all things go well, then the spirits are bestowing luck on the family; when things go badly, luck has been withdrawn and ill-luck takes its place.\nThe Öp-ju stands for this luck, fate or fortune of the family. Sometimes there will be a house or shanty built for him, known as the öp-jip, or sometimes he will be confined to the fetich of the T'ö-ju as above indicated. Ordinarily he has a fetich of his own consisting of a straw booth like that of the T'ö-ju, but containing an earthen jar or pot with rice, grain or beans in it, and sometimes a small stone. This fetich is worshipped regularly, spring and autumn, and at other times as luck may seem to demand.\n\nOne very interesting feature of this Öp-ju is the idea of the mascot, which is clearly held by the Koreans. The mascot in Korea is a person or animal attached to the Öp-ju, and through him to the family, and is thought to bring good luck. There are a number of these mascots, as the Öp-ku-rüngi or luck serpent; the öp-dä-a-ji or luck pig; the öp-jok-jä-bi or luck weasel; the in-öp or luck-child. As a general thing this luck mascot is not an actual tangible thing of flesh and bones, but an immaterial fancy or form that haunts the householder's dreams, visiting him in his sleep with its promises of better things. Sometimes, however, in the case of a snake or a weasel, it may become the actual beast itself, and the presence of a snake at a Korean house is not at all an occasion for alarm but rather of rejoicing and gladness. This question of sacred animals, however, comes up properly under the animistic worship of Shamanism.\n\n13. The Kül-ip (乞粒). If you look sharply about the entrance of a Korean house you will generally find hanging in a dark corner, a bundle consisting of an old cast-off sandal or two, some money on a string, a coolie's hat, an old head of a fish, etc. This is the fetich of the Kül-ip or Messenger of the Gods of the House. He has charge of the outside fortunes of the family and runs errands for the spirits. The hat is part of his costume; the shoes are for his journey, and the money and the money-string is for his travelling funds.\n\n14. The Mun-hö-ji-sin (門戶之神). This spirit guards the entrance to the house and is a sort of a spiritual gateman. His fetich consists of the hat and surplice of a yamen runner and hangs in the gate or entrance.\n\n15. The Yók-sin (疫神). This is the dreaded Ma-ma or Small-pox God. It is the belief of the Koreans that small-\npox is a species of demoniacal possession. In fact, a close study of their medical theories will reveal the fact that they regard all disease as either demoniacal possession or else due to demoniacal influence. And in this lies the great power of the shamans. They are the real doctors of the land as far as practical purposes go, and, though they do not deal in medicine, they are popularly regarded as far more powerful agents in effecting a cure than the druggist or doctor. A well-informed native literatus said to me that it is safe to estimate that of all the money spent on sick folk in Korea seventy or eighty per cent. goes to the shamans.\n\nThe Ma-ma spirit is generally represented in the room of a sick person by a clean mat upon which stands a small table carrying a bowl of fresh, pure water. This remains during the period of the sickness and is not removed until the disease leaves the patient. If at any time the disease becomes dangerous the parents or relatives of the sick person will appear before this table and take several mouthfuls of water, uttering a prayer between each mouthful for the recovery of the patient. The same ceremony may be observed at a well or a spring. The person afflicted with a yŏk-sin is supposed to be peculiarly susceptible to the pains and hardships of persons who come near him. Thus it is said that if chair-coolies come inside the compound of a house where a person has the small-pox, the patient will immediately complain of a pain over the shoulders, although he may not know that there are any chair-coolies near him.\n\n16. The Che-ong (除俑), Human Effigy. Each New Year the Koreans manufacture out of straw effigies which they use to carry away the bad luck of the house. You will find them all over the country thrown out in the fields or along the roads. Often you will find a piece of money tied to them. This is the bribe given to the effigy to carry away the ill-fortune. The effigy is also used at other times in connection with sickness, being clad in the garment of the sick person and bribed to carry away the disease.\n\n17. The Sam Sin (三神), God of Nativity. This is a popular spirit in most Korean households and is represented by a fetich consisting of a gourd and a small bag of rice. It is supposed to preside over conception and birth and to\ndetermine the posterity of each household. It is also supposed to determine sex, and mitigate or increase the pains of childbirth. When a child is born into a Korean home the house is immediately shut up to all visitors for a period varying from three to twenty-one days. This is in honour of the Sam Sin and to exclude from his sight all defiled persons such as mourners. Generally a straw rope is stretched across the door to bar entrance. If this rope is decorated with red peppers it indicates that the new-born child is a boy; if decorated with pine-tree sprigs, that it is a girl.\n\nThese few notes will give some idea of the character of the spirit-gods of Korean shamanism. They are a motley crew, a dismal company. What must be the condition of mind and heart which continues under their dominion and in their service? But this is the religion of the Korean home and these gods are found in every house, not Christian, in Korea. The Korean is born under their influence or even may think himself to be their offspring or incarnation. He is consecrated to them in childhood, grows up amid them and they remain in unbroken touch with him from the moment he sees life until the clods cover him in his last long sleep in the grave. They occupy every quarter of heaven and every foot of earth. They lie in wait for him along the wayside, in the trees, on the rocks, in the mountains, valleys and streams. They keep him under a constant espionage day and night. Once I was compelled to travel through the night. It was cold and dark and my coolies pushed on awed and silent. About two o'clock in the morning a distant cock's crow rang out clear and distinct, when the men all drew a sigh of relief and murmured their gratitude. On inquiry for the reason of this they told me that evil demons cannot travel after cock-crow, so they felt safe then. It certainly must be a most uncomfortable condition of mind in which he passes his days, for they are all about him, they dance in front of him, follow behind him, fly over his head and cry out against him from the earth. He has no refuge from them even in his own house, for there they are plastered into or pinned on the walls or tied to the beams. Their fetiches confront him in the entrance, and there is a whole row of them back of the house. Their ubiquity is an ugly travesty of the omnipresence of God.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko21roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 72, "total-input-tokens": 99924, "total-output-tokens": 34600, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 397, 7], [397, 397, 8], [397, 2361, 9], [2361, 4623, 10], [4623, 6972, 11], [6972, 9350, 12], [9350, 11747, 13], [11747, 14163, 14], [14163, 16468, 15], [16468, 18878, 16], [18878, 21300, 17], [21300, 23475, 18], [23475, 25893, 19], [25893, 28475, 20], [28475, 30727, 21], [30727, 33093, 22], [33093, 35503, 23], [35503, 37646, 24], [37646, 39866, 25], [39866, 42187, 26], [42187, 44484, 27], [44484, 46815, 28], [46815, 49094, 29], [49094, 51470, 30], [51470, 53701, 31], [53701, 55998, 32], [55998, 58408, 33], [58408, 60639, 34], [60639, 63137, 35], [63137, 65532, 36], [65532, 67822, 37], [67822, 70171, 38], [70171, 72525, 39], [72525, 74818, 40], [74818, 77170, 41], [77170, 79508, 42], [79508, 81799, 43], [81799, 84071, 44], [84071, 86022, 45], [86022, 88232, 46], [88232, 90517, 47], [90517, 92857, 48], [92857, 95000, 49], [95000, 97102, 50], [97102, 99437, 51], [99437, 101743, 52], [101743, 103950, 53], [103950, 106241, 54], [106241, 108558, 55], [108558, 110832, 56], [110832, 113198, 57], [113198, 115573, 58], [115573, 117882, 59], [117882, 120209, 60], [120209, 122389, 61], [122389, 124663, 62], [124663, 126989, 63], [126989, 129386, 64], [129386, 131757, 65], [131757, 134066, 66], [134066, 136377, 67], [136377, 138737, 68], [138737, 138737, 69], [138737, 138737, 70], [138737, 138737, 71], [138737, 138737, 72]], "primary_language": ["None", "en", "None", "None", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]