[{"id": "2202604800d58d13a3efbb46446af75165b77792", "text": "PREFATORY NOTICE.\n\nSo long an interval as has elapsed since the publication of the First Part of the Society's Transactions, is not likely again to occur. Materials for a Third Part are already in the hands of the Council, and it is believed that a new impetus will be given to the operations of the Society under the new President, who has both the means and the desire to forward the objects for which it was established.\n\nThe present Part is almost entirely occupied with A brief Notice of \"A new Arrangement of the Chronicles of Tsien,\" and a Key to its 329 Woodcuts of the Coins of China and neighbouring Nations, by C. B. Hillier, Esq., Chief Magistrate of Hongkong,—a work in great repute among the Chinese, and which must prove interesting to antiquaries and numismatists of other countries. It has been brought out under the superintendence of Dr Harland, the Secretary at the time the work was presented to the Society, but for whose zeal it might have been much longer delayed. As the virtual editor, he desires not to be held responsible for the orthography of the Chinese names as given by the Translator. Those accustomed to the ordinary mode of representing Chinese sounds by means of the Roman Alphabet, will perceive that the letter r inserted throughout the work should in all cases be omitted. For the very beautiful and accurate Woodcuts, the Society is altogether indebted to the kindness of Dr Hobson of Canton, under whose care the blocks were engraved by a Chinese artist.\n\nThe only other paper contained in the present Transactions is a notice of the Manufacture of Magnetic Needles and Vermilion, (extracts from the Tung-teen-shaou,)—by Dr W. A. Harland.\n\nA. S.\n\nHongkong, June 1, 1852.\nOFFICE-BEARERS FOR 1852.\n\nPresident.\nHis Excellency John Bowering, LL.D.\n\nVice-Presidents.\nHonourable A. R. Johnson, and A. H. Balfour, Surgeon.\n\nCouncillors.\nHonourable W. T. Mercer, Dr Dempster, and J. C. Bowering.\n\nTreasurer.\nAdam Scott.\n\nSecretary.\nAndrew Shorende.\n\nCurator.\nH. G. Harrington.\nTRANSACTIONS\nOF THE\nCHINA BRANCH\nOF\nTHE ROYAL ASIATIC SOCIETY.\n\nARTICLE I.\nCHINESE COINAGE.\n\nA BRIEF NOTICE OF THE CHINESE WORK 錢志新編 (Chronicles of Tsien; a new arrangement,) and a Key to its Wood-cuts of the Coins of China and neighbouring nations.—By C. B. HILLIER, Esq.\n\nThe work appears to have been published by Wun Seang-shih about A.D. 1830, but to have been compiled by Charng Le-ying. It consists of a preface by Tarng-loh, written four years previously, of fifteen rules comprising the mode of compilation; of an enumeration and brief description of ten other Chinese works on Coins; of a general idea, of twenty books, forming the body of the work; and of a short account how the work came to be published. The wood-cuts and descriptions of Coins are arranged in order under headings of the Sovereigns of each dynasty or independent state, from the time of Yaou, B.C. 2356, to the close of the Ming dynasty in A.D. 1644—a period of 4000 years; those of each reign being preceded by a summary of the leading events of the time. The wood-cuts are said to be fac-similes of the Coins they represent, carefully collated for the most part with the originals. It is interesting to trace in them the gradual improvement of the Chinese character from its rude pictorial to its present symmetrical, and as some think\nvery elegant form. The descriptions are principally made up of quotations from other books. In some the dimensions of the Coins are given, in some the weights, in some the amounts they were intended to pass current for, and in some all these and other particulars.\n\nThe inscriptions of the Coins are simple. In many cases they are made up of the name of the period or epoch of the reign (concerning which some explanation will be given,) and words signifying \"current money,\" or some such plain device: they are seldom abbreviated. The almost entire absence of legends perpetuating the features of celebrated persons, the likenesses of cities, places, or things, and of allegorical representations—all so serviceable to literature in the case of other ancient Coins—detracts much from the interest of the Coins of China. The importance of medals as collateral proof of the authenticity of history seems not to have occurred to the mind of our compiler; though this, if it have contracted his researches, may give additional weight to the testimony that he unconsciously records. The Coins, so far as one can judge from their representations, exhibit a low state of art; all seem to have been cast, none struck; and we see nothing like the refinement as well in art as in sentiment, which would have secured to other nations the unanimous admiration of posterity had their medals been the only relic of their greatness. The rough representation of a tortoise, a snake, a dragon, a bird, or a horse, and in three doubtful cases of men (in two of which the men might be mistaken for monkeys) seems to have exhausted the talent of the Chinese mints. The devices of the tortoise, the horse, and the indented mark, correspond curiously with those on the ancient Greek Coins. The horse was the symbol of Thessaly, the tortoise of the Peloponnesus; and the most ancient Greek Coins have an indented mark on one face and the figure of a tortoise on the other. Du Halde says, \"La Torture * * marque cela qui rampent à terre; le Cheval désigne cela qui y trennent moins, et qui s'élèvent de temps en temps: et le Dragon volant est une image de cela qui sont tout à fait détachée de toutes les choses terrestres * * le Dragon est le symbol de la nation Chinoise de même que l'Aigle etoit le symbol des Romains.\" He also gives an amusing reason why the Chinese have not as other nations placed the heads of Emperors on their Coins. \"Ce seroit, selon le genie de cette nation, une chose indecente et peu respectueuse pour la majesté impériale, que le portrait du Prince passât continuellement par les mains des marchands et de la plus vile populace.\"\nBut however inferior in other respects, Chinese Coins yield to none in antiquity, if we are to believe that those of Yaou and Shun, (B.C. 2356) now exist. How they have been handed down to the present time is rather unaccountable, as it does not appear that the custom of burying money with the dead was ever prevalent in China. The Emperor Kang-he (A.D. 1662) is said to have made a collection of Chinese Coins, and to have made the series complete from Yaou to his own time. The most ancient medal of other countries now extant is supposed to be one of Alexander the First of Macedonia (501 B.C., about the time of Confucius); this is comparatively modern; and our earliest English Coins—of the time of the Heptarchy—sink into insignificance in point of antiquity. The existence of the alleged representations at least of such early Coins strengthens the opinion held by some that coined money had its origin in the remotest antiquity, in opposition to others who assign to it a much later date.\n\nThe epoch alluded to above is called 國號 (the national mark) or 年號 (the year mark.) Previous to the Ming dynasty, it was not unfrequently changed several times during a reign. Thus in the reign of Kaou-koong of the Targ dynasty we find 14 different periods, each consisting of several successive years. The first period of this reign was named Yoong-hway, and consisted of six years; the second, called Heen-shing, lasted five years; so that the first year of the reign would be the first of Yoong-hway, the seventh the first of Heen-shing, and so forth. From the establishment of the Ming dynasty to the present time, one epoch only for each reign has been used; such is that of the present reigu Tau-kwarng. The names of these epochs seem to attach to the Emperors themselves, who have also their private and their posthumous names: an arrangement tending not a little to confuse Chinese history.\n\nWhen the metal of which the Coins are made is not mentioned, it seems to be generally taken for granted that it is copper, or some compound of which copper is the basis: the word \"copper\" is used throughout the work as the generic term for all such mixtures, \"red copper\" for the pure or nearly pure metal, \"yellow copper\" for a compound assimilating to our common brass, and \"white copper\" for tutenaugue. Iron Coins seem to have been first used in the reign of Woo-te of the Leang dynasty, A.D. 502. Lycurgus coined iron money about 884 B.C.\nThe Coins were issued from the mints bearing a nominal value fixed by the Emperor in reference to some given standard nowhere mentioned in the work under consideration. It seems that this standard accorded with the name of the Coin, (as formerly in the cases of the English pound and Roman as.) It was most likely a tsien weight of copper of ordinary purity, considered equivalent to a le weight of silver; that is, the proportional value of silver to copper was as 100 to 1. The denomination of the Coin generally far exceeded its actual value; in some reigns so much so as to render the Coins little better than tokens of value.\n\nThe rulers of China seem to have resorted to much the same unworthy expedients to raise money as the rulers of Western nations; altering the denomination or weight of the Coin, degrading the standard, or confiscating property dedicated to religious uses; nor does the true nature of money, as a valuable commodity and not the mere representative of value, appear to have been better understood. In the reign of She-tsoo of the Yuen dynasty, (Cobloï-khan A.D. 1280,) the device of Government paper was hit upon, and produced much confusion and ruin. Towards the close of the dynasty the currency became utterly valueless, and barter was the only mode of exchange practised.\n\nOn the whole, the book furnishes very little information; all worth recording, and I fear much more, has been extracted. The bulk of it is occupied with the historical events to be found in other works, and the remainder is little more than a dry description of the Coins now extant.\nWEIGHTS.\n\nAncient.\n\nAs mentioned in the work.\n\n\\[\n\\begin{align*}\n10 \\text{ Shoo (grains of millet)} & = \\text{one Luy}. \\\\\n10 \\text{ Luy} & = \\text{one Choo}. \\\\\n8 \\text{ Choo} & = \\text{one Taze}. \\\\\n24 \\text{ Choo} & = \\text{one Leang}.\n\\end{align*}\n\\]\n\nModern.\n\nAs mentioned elsewhere.\n\n\\[\n\\begin{align*}\n10 \\text{ Le} & = \\text{one Fun}. \\\\\n10 \\text{ Fun} & = \\text{one Tsien}. \\\\\n10 \\text{ Tsien} & = \\text{one Leang}.\n\\end{align*}\n\\]\n\nA leang (tael) \\(= 1\\frac{1}{2}\\) oz. avoirdupois.\n\nMEASURES.\n\nThe Tsun \\(= 1.4625\\) inches\n\nor \\(1.3125\\) inches\n\nor \\(1.27\\) inches\n\nor \\(1.333\\) inches\n\nor \\(1.265\\) inches\n\naccording to the standard used.\n\nThe Fun (part) \\(= 1/10\\)th Tsun.\n\nCAPACITY.\n\nThe Hwuh containing 10 Tow, the Tow containing about 12 catties (the catty equalling \\(1\\frac{1}{2}\\) lb avoirdupois) of grain.\n\nThe dates taken from Medhurst's \"China, its state and prospects,\" and not calculated from the Cyclic years mentioned in the work.\n\nNOTE.—In the descriptions of the Coins, the name of the Coin is printed in Small Capitals; the Dynasty within parentheses (); and the name of the Monarch in whose reign coined in Italics.\nNo. 1.\n\n1. Yaou-poo, (甲骨文) Yaou,—2 tsien 3 fun weight; 1 tsun 7 fun long; 9 fun broad at the shoulders; 1 tsun broad at foot; 4 fun long 6 fun broad at the head; the forks at foot 4½ fun long, and breadth of space between, 3 fun.—B. c. 2356.\n\nNo. 2.\n\n2. T'ang-kin-hor, (商金器) Shun,—The different sorts of the Coin enumerated, 2 tsun long; 1 tsun 2 fun broad at its upper part, 1 tsun 3 fun broad at its lower part; the breadth and length of the head each 6 fun; the space between the feet 5 fun. The head, feet, and shoulders rounded. A rim on both sides. (Here follow remarks on the inscription. These will suffice as examples of the descriptive detail found throughout the work.)—B. c. 2254.\n3. TARG-KIN-HOR, ( ) Shun,—Another kind not rounded; otherwise differing but slightly from the last. The inscription consists of 8 words; the 3 lower in the centre are, — and 王. These Targ-kin were probably coined by Shun's descendants of the 3d generation, and not more than 4000 years ago, as they would be if referred to the time of Shun.\n\nNo. 4.\n\n4. TARG-KIN-HOR, ( ) Shun,—Another kind, [somewhat smaller than the previous two. The inscription indistinct and half effaced. A small eye at the top, supposed to have been bored in later times.]\nNo. 5.\n\n5. Sarn-yarng-kin, ( ) Supplemental,—Probably referable to Kaou-yarng-she.\n\nNo. 6.\n6. Ngarn-yarng-kin, ( ) Copper,—Probably coined by Kaou-yarng-she. Of a green colour. Thin.\n\nNo. 7.\n7. Ping-yarng-kin, ( )—Perhaps also referable to the same period.\n\nNo. 8.\n\n8. Ngarn-yarng-urh-kin, ( )—Rim small. Considered to be one of the 5 kin (coined by Kaou-yarng-she.)\n\nNo. 9.\n\n9. Yin-yarng-kin, ( )—Upper word of inscription unintelligible. Time of coinage unknown; supposed to be one of the 5 kin.\n10. **YARNG**, ( )—Word of inscription above \"yarng\" unintelligible. Somewhat thick.\n\nNo. 11.\n\n11. **PIH-KEUH-KIN**, ( )—Similar to the preceding. Has a pretty green appearance.\n12. Tun-leoo-kin, (图) — One of Ching's 29 (that is, of 29 pots in that person's possession, the names of which are enumerated. The inscriptions contain names of cities.)\n\nNo. 13.\n\n13. Charng-tsz-yih-kin, (图) — One of the 29 of Ching.\n14. Searng-hwarn-kin, ( )—One of the 29 of Ching.\n\nNo. 15.\n\n15. Shwuy ———, ( ) Second word of inscription unintelligible. Somewhat smaller than the last named,\n16. Kor-yih-kin, ( )—Inscription on reverse unintelligible.\n\nNo. 17.\n\n17. ————, ( )—Two words of the inscription unintelligible. Similar to the Tarng-urh-kin.\n18. Ngarn-yih-hor-urh-kin, (Hea,) Yu,—1 leang 4 choo weight. Not certainly referable to this dynasty. Anciently the monarch always inscribed on \"lucky\" coins the name of the capital city.\n\nNo. 19.\n19. Ngarn-yih-nor-urh-kin, (Hea,) Yu,—1 leang 4 choo weight. Inscription upside down.\n\nNo. 20.\n\n20. Ngarn-yih-urh-kin.\n\nNo. 21.\n\n21. Ngarn-yih-yih-kin-hor, ( )—Has an eye in the upper part of the handle. Inscription indistinct.\n22. TARNG-URH-KIN, (Sharng,)—Inscription in deep relief. Has a green appearance.—B. c. 1765.\n\n23. SHARNG-POO-SHIH-HOR, (Sharng,)—12 choo weight. The largest of the ancient poo.\n24. KOONG-TSZ-KIN, (Sharng.)\n\nNo. 25.\n\n26. FOO-PE-URH-TSZ, (Sharng.)\n\nNo. 26.\n\n28. WOO-TSZ-TSIEN,* (Chow,)—Of two kinds; the most ancient with a raised obverse, a flat reverse and a very large square hole in the centre (indicated in all these wood-cuts by lines); the other with a rim. During the wars, all the princes coined uninscribed round tsien, so that due distinction is impossible.—B. c. 1121.\n\n* Uninscribed Tsien.\n27. PAOU-HOR, (Chow,) King-warng,—12 choo weight.—B. C. 617.\n\nNo. 28.\n\n28. CHOONG-YIH-LEANG-SHIH-URH-CHOO-TSIEN,* (Chow,) — pure red copper,—12 choo weight. Obverse raised; Reverse flat; a round eye in the centre. It weighed 12 choo only, though the inscription was 1 leang 12 choo.\n\n* Tsien weighing 1 leang (or tael) 12 choo.\n29. Tse-hor-taon, (Tse,*)—1 leang 3 tsien weight. Inscription, \"Tse-tar-koong-hor.\" The rim of the ring raised on the obverse, flat on the reverse—B.C. 245.\n\n* State.\n30. TSE-HOR-TAOU, (Tse,*)—Copper. The copper of a green appearance; the reverse bearing the word 大 or 大.\n\n* State.\nNo. 31.\n\nThe reverse bears the word Tse. The word Tse is peculiar.\n\n* Shā.\n32. Tse-hor-taou, (Tse.*) Large, and bearing the word 貨 only on the reverse.\n\n* Blaap.\nNo. 38.\n\nIt is said that, Hwam-koong being in want of troops, allowed misdemeanants to ransom themselves by these taou (swords). There are also taou—not here recorded—bearing other inscriptions on the reverse.\n\n* State.\n35. Keu-taou or Keu-seaou-taou, (Keu.*) The smallest of all the taou—of many sorts not here recorded.—B. C. 245.\n\n* State.\n36. Woo-tsz-taou,* (Keu.) It is said that the ancient princes made first-class money of pearls and gems, and middle-class money of gold; and that the lowest-class was the Taou-poo. The origin of these taou is doubtful; perhaps the uninscribed ones only may be referred to the Keu state.\n\n* i.e., Uninscribed Taou. † State.\n37. HING-TSZ-DAOU, (Keu.*) There is also another sort uninscribed.\n\n* State.\nNo. 38.\n\n38. Pwarn-leang,* (Tsin,) Che-hwarng,—Copper,—½ leang weight—some say 8 choo only.—B. c. 220.\n\n* Half leang.\n\nNo. 39.\n\n39. Pwarn-leang,* (Harn,) Kaou-how,†—8 choo weight.—B. c. 186.\n\n* Half leang.  \n† Queen.\n40. **Pwarn-leang,** (Harn,) *Wun-te,*—4 choo weight. Some of the inscriptions reversed. (Read from left to right.) In some, each side bore the inscription.—B. c. 178.\n\n* Half leang.\n\nNo. 41.\n\n41. **Pwarn-leang** and **Sarn-choo,** (Harn,) *Woo-te,*—3 choo weight. The Sarn-choo were first coined: they were abolished, and the Pwarn-leang coined: the last said to weigh also only 3 choo, and to be marked with three perpendicular strokes under the hole to indicate this.—B. c. 139.\nNo. 42.\n\n42. Woo-choo-tsien, (Harn,) Woo-te,—5 choo weight. Coined after the abolition of the Pwarn-leang. The edges so made that they could not be filed.\n\nNo. 43.\nNo. 43.\n\n43. TAR-TSEUEN-WOO-SHIH, ( ) Sin-warng,—12 choo weight. 28 million tsien coined. The small an aliquot part of the large. On the reverse of one kind were figures of a tortoise, a snake, the stars, and a sword.—A.D. 9.\n\nNo. 44.\n\n44. SEAOU-TSEUEN-CHIH-YIH, ( ) Sin-warng,—2 choo weight.\n\nNo. 45.\nNo. 45.\n\n45. Kēē-taou and Tsoh-taou, (金刀), Sin-warng. The words 一刀 of the inscription of the Tsoh-taou are gilt.\n\nNo. 46.\n\n46. Hor-poo and Tar-poo-warng-tsien, (大布), Sin-warng.—1 leang 1 choo weight. To exchange for 25 Hor-tseuen. Ten other kinds of poo were also coined, of denominations varying from 100 to 1000, weighing from 15 to 24 choo, and measuring in diameter from 1 tsun 5 fun, to 2 tsun 4 fun.\n\nNo. 47.\n47. Hor-tseuen, ( ) Sin-warng,—5 choo weight. Denomination, 1 tsien.\n\nNo. 48.\n\n48. Poo-tseuen, ( ) Sin-warng. Called the \"male tsien.\" It is said that those who carry it about them will have sons born to them.\n\nNo. 49.\n\n49. Woo-choo, (Toong Harn,) Kwarng-woo,—Copper.—A.D. 25.\nNo. 50.\n\n50. Sz-chuh or Keo-tsten, (Toong Harn,) Ling-te,—4 choo weight. On the reverse a type of four roads, said to signify that the coin would be dispersed in all directions; as in truth they were at the rebellion.—A. D. 168.\n\nNo. 51.\n\n51. Tar-tseuen-woo-shih and ———, (Three States,) Choh,— Copper. Coined from the copper men and horses of Ish-yang and Charng-ngarn. Thin like paper. Those uninscribed weighed 5 fun, and were unpolished.\n\nNo. 52.\nNo. 52.\n\n52. Chih-pih-woo-choo-tsiên, (Chuh-harn,) Chaou-leih,—respective weights, 8 choo, 5 choo, 4 choo, and 3 choo 8 luy.—A.D. 221.\n\n* State.\n\nNo. 53.\n\n53. Tar-tseuen-woo-pih, (Woo,) Tar-te,—4 choo 6 luy weight. Denomination 500 tsien. Others said to weigh 12 choo.\n\n* State.\n54. TAR-TSEUEN-TARNG-TSIEN, (Woo,*) Tar-te, — respective weights, 12 choo, and 7 choo 2 luy. Denomination 1000 tsien. The people melted them down.\n\n* State.\n\nNo. 55.\n\n55. TAR-YUEN-HOR-TSEUEN, (Tsin.) Perhaps coined by Woo-te, or, it may be, counterfeit.—A.D. 265.\n56. Sz-choo-tsien, (Soong,) Wu-h-te,—respective weights, 2 choo, and 2 choo 4 luy.—A. D. 424.\n\nNo. 57.\n\n57. Woo-choo-tarng-leang-tsien, (Soong,) Wun-te,—8 choo weight. Denomination, 2 tsien. Suppressed the year after they were coined.\n\nNo. 58.\n\n58. Haou-keen-sz-choo, (Soong,) Haou-woo-te,—respective weights, 4 choo, and 2 choo.—A. D. 454.\n\nNo. 59.\n\n59. Urh-choo and King-hor, (Soong,) Choong-fei,—2 choo weight. The Urh-choo coined one month, suppressed the next.—A. D. 465.\n\nNo. 60.\n60. Woo-choo-tsiên, (Tse,) Woo-te,—5 choo weight. Want of means stopped the coinage.—A. D. 483.\n\nNo. 61.\n\n61. Tiah-woo-choo, Tar-toong-woo-choo, Tar-tsih-woo-choo, (Leang,) Woo-te,—Iron. The first of the iron tsien.—A. D. 502.\n\nNo. 62.\n\n62. Woo-choo-neu-tsiên, (Leang,) Woo-te,—5 choo weight. Of two sorts. Those without good rims were called simply “neu (women’s) tsien,” and were said to be counterfeit.\n\nNo. 63.\n\n63. Sz-choo-woo-choo, (Leang,) King-te,—weight 20 choo, afterwards 10 choo. Two other sorts.—A. D. 555.\n64. SHWARNG-WOO-WOO-CHOO, (Leang,) King-te,—2 choo 4 luy weight.\n\nNo. 65.\n\n65. NGOR-NGARN-*WOO-CHOO, (Leang,) King-te,—5 fun weight. The inscription in relief. Did not sink in water. Broke in the grasp. 10,000 were equivalent to a tow of rice or a piece of cloth.\n\n* Goose eye.\n\nNo. 66.\n\n66. WOO-CHOO-TSIEN, (Leang,) King-te,—3 choo weight.\n\nNo. 67.\n\n67. TAI-PING-PIH-KIN and TAI-PING-PIH-TSIEN, (Leang,) King-te,—respective weights 4 choo, and 2½ choo. Counterfeit. Of 4 kinds.\nNo. 68.\n\n68. Ting-ping-yih-phi, (Loang,) King-te,—1½ choo weight.\n\nNo. 69.\n\n69. Poo-tseuen, (Chin,) Wun-te. Denomination, 100 tsien. Afterwards changed for the Woo-choo; ordered to pass for 10 Ngor-ngarn.—A, D. 560.\n\nNo. 70.\n\n70. Tai-hor-looh-choo, (Chin,) Seuen-te,—6 choo weight. Made equivalent to 10 Woo-choo. Found inconvenient. There was an idle saying (referring to the word looh of the inscription,) that it represented a person with arms a-kimbo weeping for the emperor. The emperor died shortly afterwards.—A, D. 569.\n\nNo. 71.\n71. TAR-HOR-WOO-CHOO, (Pih-wei,*) Haou-wun-te,—Copper, —5 choo weight.\n\n* State.\n\nNo. 72.\n\n72. WOO-CHOO, (Pih-wei,*) Seuen-woo-te.\n\n* State.\n\nNo. 73.\n\n73. YOONG-NGARN-WOO-CHOO, (Pih-wei,*) Haou-chwarng-te,—5 choo weight. Of three kinds.\n\n* State.\n\nNo. 74.\nNo. 74.\n\n74. SHANG-PING-WOO-CHOO, (Pih-tee,*) Wun-seuen-te,—5 choo weight. One kind bore on the reverse figures of the sun, moon, and seven stars.\n\n* State.\n\nNo. 75.\n\n75. Poo-tseuen, (Pih-chow,*) Woo-te. Denomination, 5 tsien.\n\n* State.\n\nNo. 76.\n\n76. Woo-hing-tar-poo, (Pih-chow,*) Woo-te. Denomination, 10 tsien. One kind bore on the reverse the figures of a tortoise, a snake, the stars, and a sword.\n\n* State.\nNo. 77.\n\n77. Yoong-toong-warn-kwoh, (Pih-chow,*) Seuen-te,—Copper,—respective weights 12 choo, and 8 choo. Denomination, 10 tsien. One kind said to have weighed 18 choo.\n\n* State.\n\nNo. 78.\n\n78. Harn-hing-tsien, (Ching,*) Le Heoong,—1½ choo weight.\n\n* State.\nNo. 79.\n\n79. Foong-hor, (How-chaou,*) Shih-lih,—respective weights 4 choo, and 3 choo. Called the tsien of happiness, because it was said that its receipt caused abundance.\n\n* State.\n\nNo. 80.\n\n80. Tar-hing-tsien, (Pih-yen,*) Foong-heoong,—4 choo weight.\n\n* State.\n\nNo. 81.\n\n81. Pih-lih-woo-choo, (Suy,) Wun-te,—respective weights 5 choo, and 1 choo 6 shoo. At first 1000 weighed 4 kin (catties) 2 leang. There was much counterfeit coinage, even from sheet iron, leather, or pastebord; at last 1000 weighed 1 kin. Tin was used in their composition, hence they had a white appearance.—A.D. 589.\n\nNo. 82.\n82. Ke-muh-*woo-choo, (Suy,) Wun-ta. 80 or 90 thousand would fill a hwoh measure (= 10 tow.)\n\n* Fowl's eye.\n\nNo. 83.\n\n83. Kae-yuen-toong-paou, (Tarng,) Kaou-tsoo,—3 choo 4 luy weight. Or 10 weighed a leang. Queen Wun-tih left the impression of her nail in the waxen mould, therefore the indentation on the reverse. Some have the reverse plain.—A.D. 620.\n\nNo. 84.\n\n84. Keen-poong-tsien, (Tarng,) Kaou-tsoong,—6 fun 2 choo weight. Denomination, 10 tsien.—A.D. 650.\n\nNo. 85.\nNo. 85.\n\n85. KEEN-YUEN-TSIEN, (Tarng.) Suh-tsoong,—one sort 5 choo weight. Respective Denominations, 10 tsien, 50 tsien, 30 tsien, and 1 tsien.—A.D. 757.\n\nNo.-86.\n86. TAR-LEIH-TSIEN, (Tarng,) Tae-tsoong,—Copper,—2 choo 6 luy weight. The copper a dull muddy colour.—A. D. 763.\n\nNo. 87.\n\n87. KEEN-CHOONG-TSIEN, (Tarng,) Tih-tsoong,—Copper. The copper a pure red colour.—A. D. 780.\n\nNo. 88.\n\n88. KAE-YUEN-TAR-TSIEN, (Tarng,) Tih-tsoong,—Hai-nan white copper,—12 choo weight. Denomination, 1000 tsien.\n\nNo. 89.\n\n89. CHARNG-HING-TSIEN, (Tarng,) Muh-tsoong.—A. D. 821.\n\nNo. 90.\n90. PAGU-LEIH-TSIEN, (Tarng,) King-tsoong.—A.D. 825.\n\nNo. 91.\n\n91. KAE-YUEN-TSIEN, (Tarng,) Woo-tsoong,—Copper. Coined from the bells and images of the suppressed Buddhist temples. On the reverse was the name of the department where coined.—A.D. 841.\n\nNo. 92.\n\n92. HARN-TOONG-TSIEN, (Tarng,) Ee-tsoong. Soon suppressed.—A.D. 860.\n\nNo. 93.\n93. Tih-yih-yuen-paou and Shun-teen-yuen-paou, ( ) She-sz-ming,—respective weights 13 choo and 15 choo. Denomination of the first 100 tsien.\n\nNo. 94.\n\n94. Kae-ping-tsien, (How-leang,) Tae-tsoo.—A. D. 907.\n\nNo. 95.\n\n95. Hoong-leih-tsien, (How-leang,) Of doubtful origin. Supposed to have been coined by Yew-kwei.\n\nNo. 96.\n\n96. Tein-ching-tsien, (How-tarng,) Ming-tsoong,—3 choo 6 luy weight.—A. D. 927.\n\nNo. 97.\n97. Teën-pooh-yuen-paou, and Teën-chin-yuen-paou, (Howtsin,) Kaou-tsoo,—Copper,—first, 2 choo 4 luy weight; second, 4 choo 6 luy weight. Coined indiscriminately, after a set pattern, by the people or the Government.—A.D. 937.\n\nNo. 98.\n\n98. Harn-yuen-tsien, (How-harn,) Kaou-tsoo,—Copper,—3 choo 6 luy weight,—A.D. 947.\n\nNo. 99.\n\n99. Chow-yuen-tsien, (How-chow,) She-tsoong. Coined under the emperor's personal supervision from the copper images taken from Buddhist temples (more than 3300 in number) that were suppressed. The reverse bore the resemblance of the mark of a finger nail, or of a star, or of a dragon and a foong-bird: these last could stop the caves of the watersprings. Some had the reverse plain.—A.D. 954.\nNo. 100.\n\n100. TAR-CHOW-YUEN-TSIEN, (How-chow,) She-tsoong,—1 leang weight.\n\nNo. 101.\n\n101. PAOU-TAR-TSIEN, (Narn-tarng,) Yuen-tsoong.\n\nNo. 102.\nNo. 102.\n\n102. TARNG-KWOH-TSIEN, (Narn-tarng,) Yuen-tsoong,—respective weights, 3 choo, 2 choo and 2 luy, 8 choo, 2 choo and 6 luy. One with a round dot on the reverse.\n\nNo. 103.\n\n103. TAR-TARNG-TSIEN, (Narn-tarng,) Yuen-tsoong,—2 choo, 4 luy weight.\n\nNo. 104.\n\n104. YOONG-TOONG-TSIEN, (Narn-tarng,) Yuen-tsoong,—Copper,—respective weights, 18 choo, 8 choo and 7 luy, 5 choo and 7 luy; Denomination of the first, 10 tsien. Of three kinds, the last bearing on the reverse the figures of a dragon and a foong-bird.\n\nNo. 105.\n105. KAE-YUEN-TSIEN, (Narn-tarng,) Hous-choo,—iron. The iron and copper Kae-yuen were used together in the proportion of 6 iron to 4 copper tsien.\n\nNo. 106.\n\n106. YOONG-PING-TSIEN, (Tseën-chuh,*) Kaou-tsoo,—3 choo weight.\n\n* State.\n\nNo. 107.\n\n107. TOONG-CHING-TSIEN, (Tseën-chuh,*) Kaou-tsoo,—3 choo weight.\n\n* State.\n\nNo. 108.\n\n108. TEËN-HARN-TSIEN, (Tseën-chuh,*) Kaou-tsoo,—3 choo weight.\n\n* State.\n\nNo. 109.\n109. **Kwanrng-teen-tsiên**, (Tseën-chuh,*) *Kaou-tsoo*,—3 choo weight.\n\n* State.\n\nNo. 110.\n\n110. **Keen-tih-tsiên**, (Tseën-chuh,*) *How-choo*,—3 choo weight.\n\n* State.\n\nNo. 111.\n\n111. **Harn-karng-tsiên**, (Tseën-chuh,*) *How-choo*,—3 choo, 3 luy weight.\n\n* State.\n\nNo. 112.\n\n112. **Kwarng-ching-tsiên**, (How-tub,*) *How-choo*,—Copper,—3 choo weight.\n\n* State.\nNo. 113.\n\n113. Kae-yuen-tsien, (Min,*) Tae-tsoo,—iron.\n\n* State.\n\nNo. 114.\n\n114. Yoong-hor-tsien, (Min,*) Tae-tsoong.\n\n* State.\n\nNo. 115.\n\n115. Yoong-loong-tsien, (Min,*) King-tsoong,—Iron or Copper,—copper, 10 choo, 2 luy weight; denomination of the iron, 10 tsien. One iron, equal to 100 leaden tsien.\n\n* State.\nNo. 116.\n\n116. TEEN-TIH-TSIEN, (Min,*) Min-choo,—Iron or Copper. Denomination of the iron, 100 tsien.\n\n* State.\n\nNo. 117.\n\n117. KEIN-HEANG-TSIEN, and TAR-YEW-YUEN-PAOU, (Narn-harn,*) Kaou-tsoo,—first, 6 choo weight.\n\n* State.\n118. KIEN-FOONG-TSIEN, (Tsoo,*) Woo-muh.—Iron or Copper,—copper, 17 choo weight; denomination of the iron, 10 tsien.\n\n* State.\n\nNo. 119.\n\n119. TEEN-TSIH-FOO-PAOU-TSIEN, or MAR-SHE-TSIEN, (Tsoo,*) Woo-muh,—Copper,—1 leang 6 choo 2 luy weight. Coined when Mar-she built the Teen-tsih-foo.\n\n* State.\n\nNo. 120.\n\n120. YING-TEEN-TSIEN, (Yen,*) Lew-show-kwarng.\n\n* State.\nNo. 121.\n\n121. Soong-Yuen-Tsien, (Soong,) Tae-tsoo.—A.D. 960.\n\nNo. 122.\n\n122. Tae-Ping-Tsien, (Soong,) Tae-tsoong.—A.D. 977.\n\nNo. 123.\n\n123. Shun-Far-Tsien, (Soong,) Tae-tsoong. The inscription in three styles, in the emperor's own handwriting.\n124. **Che-taou-tsien**, (Soong,) *Tae-tsoong*. In one year 800,000 strings (of 1000 each) were coined.\n\nNo. 125.\n\n125. **Harn-ping-tsien**, (Soong,) *Chin-tsoong*—A.D. 998.\n\nNo. 126.\n\n126. **King-tih-tsien**, (Soong,) *Chin-tsoong*. 1,830,000 strings coined in one year.\nNo. 127.\n\n127. Tseang-foo-tsien, (Soong,) Chin-tsoong. In one year 210,000 strings coined.\n\nNo. 128.\n\n128. Teen-he-tsien, (Soong,) Chin-tsoong. In the last year of the reign 1,500,000 strings coined.\n\nNo. 129.\n\n129. Teen-shing-tsien, (Soong,) Yin-tsoong.—A.D. 1023.\nNo. 130.\n\n130. Ming-taou-tsien, (Soong,) Yin-tsoong.\n\nNo. 131.\n\n131. King-yu-tsien, (Soong,) Yin-tsoong.\n\nNo. 132.\n132. PAOU-YUEN-TSIEN, (Soong,) Yin-tsoong,—from 7 fuun to 1 tsien 9 fuun weight. Denomination, 5 tsien. The inscription specially ordered by the emperor. Of 3 kinds, denomination supposed from the number on the reverse.\n\nNo. 133.\n\n133. KANG-TING-TSIEN, (Soong,) Yin-tsoong. Denomination, 10 tsien.\n\nNo. 134.\n\n134. HING-LEIH-TSIEN, (Soong,) Yin-tsoong. Denomination, 10 tsien.\n\nNo. 135.\n135. Hwarng-yu-tsien, (Soong,) Yin-tsoong. 14,600,000 strings coined.\n\nNo. 136.\n\n136. Che-hor-tsien, (Soong,) Yin-tsoong. Tsiens of denomination 10 were made of denomination 2.\n\nNo. 137.\n137. KEAR-YU-TSIEN, (Soong,) Yin-tsoong. After Kae-paou, on each change of the national mark, tsien were coined; so that there were several kinds in each reign. In Yin-tsoong's reign, tsien were most numerous.\n\nNo. 138.\n138. Che-ping-tsiên, (Soong,) Ying-tsoong. In one year 1,700,000 strings were coined.—A.D. 1064.\n\nNo. 139.\nNo. 139.\n\n139. He-ning-tsiên, (Soong,) Shin-tsoong. Denomination, 2 tien.—A.D. 1068.\n\nNo. 140.\n140. **Yuen-foong-tsien**, (Soong,) *Shin-tsoong*. Denomination, 2 tsien. In one year 200,000 strings coined.\n\nNo. 141.\nNo. 141.\n\n141. Yuen-yu-tsien, (Soong,) Che-toong.—A.D. 1086.\n\nNo. 142.\nNo. 142.\n\n142. Chaou-shing-tsien, (Soong,) Che-tsoong,—some of iron.\n\nNo. 143.\n\n143. Yuen-foo-tsien, (Soong,) Che-tsoong. 1000 copper exchanged for 2500 iron tsien.\n\nNo. 144.\nNo. 144.\n\n144. Shing-tsoong-tsien, (Soong,) Hwuy-tsoong.—A.D. 1101.\n\nNo. 145.\nNo. 145.\n\n145. Tsoong-ning-tsiên, (Soong,) Huwy-tsoong. Denomination, 10 tsien. The inscription a royal autograph.\n\nNo. 146.\nNo. 146.\n\n146. TAR-KWARN-TSIEN, (Soong,) Huuy-tsoong. Denomination, 10 tsien. Inscription by the hand of the emperor.\n\nNo. 147.\n147. Ching-hor-tsien, (Soong,) Hwuy-tsoong. Made with an admixture of leaden metal.\n\nNo. 148.\nNo. 148.\n\n148. Choong-hor-tsien, (Soong,) Hwuy-tsoong.\n\nNo. 149.\n149. SEUEN-HOR-TSIEH, (Soong,) Hwuy-tsoong. On account of the exhausted state of the exchequer, \"Seaou-ping\"*-tsien were coined. In each string were used 3 leang of iron in lieu of a proportionate quantity of copper and lead. These were altered to tsien of denomination 2.\n\n* The term \"Seaou-ping\" seems to mean \"Standard,\" that is, tsien of the weight of one tsien, and ordinarily passing for one tsien each, and so it is translated throughout these notes.\n\nNo. 150.\nNo. 150.\n\n150. Tsing-karng-tsien, (Soong,) Kin-tsoong.—A.D. 1126.\n\nNo. 151.\nNo. 151.\n\n151. KEEN-YEN-TSIEN, (Soong,) Kaou-tsoong.—A.D. 1127.\n\nNo. 152.\nNo. 152.\n\n152. Chaou-hing-tsien, (Soong,) Kaou-tsoong,—some of iron. 100,000 strings coined.\n\nNo. 153.\n\n153. Loong-hing-tsien, (Soong,) Haou-tsoong. Denomination, 2 tsien.—A.D. 1163.\n154. Keēn-taou-tsien, (Soong,) Hauu-tsoong,—iron. From the time of the Southern passage until this, iron tsien were abundant.\n\nNo. 155.\n155. **Shun-he-tsiên**, (淳熙通宝) — Copper or Iron. In the first year, Shun-he iron tsien were disused and copper coined, but at some of the mints iron tsien were again coined. From the 7th year \"Shun-he\" the number of the year was impressed on the reverse of most of the coins, some however having the word \"tswarn,\" or the figures of the moon and star, instead. On the reverse of the iron tsien was added the name of the mint at which they were coined.\n\n156. **Chaoou-he-tsiên**, (紹熙通宝) At each of two mints 100,000 strings were coined in a year. On the reverse were numbers from one to five.—A.D. 1190.\nNo. 157.\n\n157. HING-YUEN-TSIEN, (Soong,) Ming-tsoong,—Copper. Denomination, 3 tsien. Coined from copper utensils by the Le and Koong boards; numbered on the reverse from 1 to 6.—A.D. 1195.\n\nNo. 158.\n\n158. HING-YUEN-TAR-TSIEN, (Soong,) Ming-tsoong. Denomination unknown. Larger and thicker than the preceding.\nNo. 159.\n\n159. HING-YUEN-SEAOU-PING-TIEH-TSIEN, (Soong,) Ming-tsoong, —Iron.\n\nNo. 160.\n\n160. KEAR-TAE-TSIEN, (Soong,) Ming-tsoong. Some numbered on the reverse from 1 to 4. The reverse of those of denomination 3 was plain.\nNo. 161.\n\n161. KEAR-TAE-TAR-TSIEN, (Soong,) Ming-tsoong. Same as the King-yuen.\n\nNo. 162.\n\n162. KAE-HE-TSIEN, (Soong,) Ming-tsoong.\n\nNo. 163.\n\n163. KAE-HE-TIEH-TSIEN, (Soong,) Ming-tsoong,—Iron. On the reverse the words \"Harn-urh\" or \"Harn-sarn\" only.\n164. KEAR-TING-TSIEN, ( ). The reverse of those of denomination 5 was plain. Material the same as that of denomination 3. Reverses generally, numbered from 1 to 17.\n\nNo. 165.\n165. Kear-ting-tieh-tsien, (Soong,) Ming-tsoong.—Iron. Some with the inscription read round (in lieu of across.) The reverses inscribed \"Harn-urh,\" \"Chun-urh,\" \"Chun-pah.\"\n\nNo. 166.\n\n166. Kear-ting-chê-shih-tsien, (Soong,) Ming-tsoong. Denomination, 10 tsien. Very scarce.\n\nNo. 167.\n\n167. Tar-soong-tsien, (Soong,) Le-tsoong. Numbered on the reverse from 1 to 3. Some of iron, bearing \"Harn-yuen,\" \"Chun-urh,\" or \"Chun-sarn,\" on the reverse.—A.D. 1225.\nNo. 168.\n\n168. Chaou-ting-tsien, (Soong,) Le-tsoong. Numbered on the reverse from 1 to 6.\n\nNo. 169.\n169. TWARN-PING-TSIEN, (端平元寶),—Copper or Iron. Those of copper, being made of \"tarn\" copper, (the composition of which mirrors are made,) did not last long. The best of the old tsien were exported, notwithstanding severe prohibitions. Those of denomination 5 had the reverse plain. Those of iron, bore \"le\" and \"chë-shih\" on the reverse; their denomination was 10.\n\nNo. 170.\n170. KEAR-HE-TSIEN, (Soong,) Le-tsoong. Standard tsien of denomination 2, numbered on reverse from 1 to 4; tsien of denomination 5, with reverse plain.\n\nNo. 171.\n171. Shun-yu-tsien, (Soong,) Le-toong. The standard tsien of denomination 2, numbered on reverse from 1 to 12. Tsien of denomination 100, so marked on the reverse. Some of denomination 3.\n\nNo. 172.\n\n172. Hwang-soong-tsien, (Soong,) Le-toong. Numbered on reverse from 1 to 6.\nNo. 173.\n\n173. KAE-HING-TSIEN, (Soong,) Le-tsoong.\n\nNo. 174.\n\n174. KING-TING-TSIEN, (Soong,) Le-tsoong. Numbered on the reverse from 1 to 5.\n\nNo. 175.\nNo. 175.\n\n175, HARN-SHUN-TSIEN, (Soong,) Too-tsoong. Numbered on the reverse from 1 to 10.—A.D. 1265.\n\nNo. 176.\n\n176. TOONG-KWAR-PAE, (Soong,) Koong-te, Twarn-tsoong,—Copper. Tokens, passing for the value expressed on them.—A.D. 1275 to 1277.\n\nNo. 177.\nNo. 177.\n\n177. Fow-charng, ( ) Low-yu.\n\nNo. 178.\n\n178. Teen-tsarn-tsien, (Leaou,*) Tae-tsoo,—3 choo 6 luy weight.\n\n* State.\n\nNo. 179.\n\n179. Ying-leih, (Leaou,*) Muh-toong.\n\n* State.\n\nNo. 180.\n180. Keēn-heang-tsien, (Leaou,*) King-tsoong.\n\n* State.\n\nNo. 181.\n\n181. Choong-hor-yuen-paou and Tae-ping-yuen-paou-tsien, (Leaou,*) Shing-tsoong.\n\n* State.\n\nNo. 182.\n\n182. Choong-He-toong-paou-tsien, (Leaou,*) Hing-tsoong,—3 choo weight.\n\n* State.\n\nNo. 183.\nNo. 183.\n\n183. Tsing-ning-toong-paou, Harn-yoong-toong-paou, Tar-karng-tsien, Tar-garn-tsien, Show-charng-tsien, (Leaou,*) Taou-tsoong,—respective weights 3 choo, 2 choo 4 luy, 2 choo 8 luy, 2 choo 4 luy.\n\n* State.\n\nNo. 184.\n\n184. Keen-choong-yuen-paou, and Teen-hing-yuen-paou, (Leaou,*) Teen-tsoo,—respective weights 3 choo 2 luy, 2 choo 4 luy.\n\n* State.\n\nNo. 185.\n\n185. Teen-harn-tsien, (Leaou,*) Teen-tsoo. Said to have been coined by queen Seaou-she.\n\n* State.\nNo. 186.\n\n186. Chihg-loong-yuen-paou, (Kin,*) Fei-te.\n\n* State.\n\nNo. 187.\n187. TAR-TING-TOONG-PAOU, (Kin,*) She-tsoong.\n\n* State.\n\nNo. 188.\n188. Garn-paou-hor, and Tar-hor-choong-paou, (Kin,* Charng-tsoong,—of second sort respective weights 4 tsien 1 fun to 5 tsien 5 fun; of second sort, denomination 10 tsien. Weight of Garn-paou-hor similar to that of the tsien of Tsoong of denomination 5;\n\nThe Tar-hor-choong-paou surpassed all other tsien in fineness and beauty of workmanship. Some had corresponding inscriptions on both sides; others again had corresponding inscriptions, but one of them upside down; whilst some had double rims; and on the reverse of some were figures of a casket and plum blossoms.\n\n* State.\n\nNo. 189.\n\n189. Teen-show-toong-paou-tsien, (Hear,*) King-tsoong\n\n* State.\n\nNo. 190.\n\n190. Tar-tih-yuen-paou, and Yuen-tih-tsien, (Hear,*) Soong-tsoong.\n\n* State.\n\nNo. 191.\n191. TEEN-SHING, and KEEEN-YU, (Hear,*) Yin-tsoong. Of the KEEEN-YU, those of iron were most plentiful.\n\n* State.\n\nNo. 192.\n\n192. TEEN-HING-TSIEN, (Hear,*) Hwarn-tsoong.\n\n* State.\n\nNo. 193.\n\n193. HWARNG-KEEN-YUEN-PAOU-TSIEN, (Hear,*) Seang-tsoong.\n\n* State.\n\nNo. 194.\n\n194. HWARNG-TING-YUEN-PAOU-TSIEN, (Hear,*) Shin-tsoong.\n\n* State.\nNo. 195.\n\n195. CHE-YUEN-TSIEN, (Yuen,) She-tsoo. Perhaps coined in Shun-te's time.—A.D. 1280.\n\nNo. 196.\n\n196. TAR-TIH-TSIEN, (Yuen,) Ching-tsoong.—A.D. 1295.\n\nNo. 197.\n197. Che-tar-tsien, (Yuen,) Woo-tsoong. Of two kinds: the Che-tar, worth one le of government paper (introduced at this time as a circulating medium,) the Tar-yuen, worth 10 Che-tar. Those of denomination 5, were inscribed with Mongolian characters.—A. D. 1308.\n\nNo. 198.\n\n198. Hwaeng-hing-tsien, (Yuen,) Yin-tsoong.—A. D. 1312.\n\nNo. 199.\n\n199. Che-che-tsien, (Yuen,) Ying-tsoong,—1 tsien weight. A very beautiful and scarce coin.—A. D. 1321.\nNo. 200.\n\n200. Che-shun-tsiên, (Yuen,) Wun-tsoong.—A.D. 1330.\n\nNo. 201.\n\n201. Che-ching, (Yuen,) Shun-te. Standard. Mongolian characters on the reverse.\n\nNo. 202.\nNo. 202.\n\n202. Che-ching-cheh-urh-tsien, (Yuen,) Shun-te. Denomination, 2 tsien. Mongolian characters on the reverse.\n\nNo. 203.\nNo. 203.\n\n203. CHE-CHING-TARNG-SARN-TSIEN, (Yuen,) Shun-te. Denomination, 3 tsien.\n\nNo. 204.\n204. CHE-CHING-TARNG-SHIH, (Yuen,) Shun-te,—white copper,—1 leang weight, (by inscription first sort.)\n205. Che-ching-keuen-chaou, (Yuen,) Shun-te. Tokens, to represent aliquot parts of the Government paper then in circulation.\n\nNo. 206.\nNo. 206.\n\n206. CHE-CHING-KEUEN-CHAOU, (Yuen,) Shun-te,—4 leang weight.\n\nNo. 207.\n\n207. CHE-CHING-TOONG-PAOU, or CHE-YUEN-TOONG-PAOU, (Yuen,) Shun-te. Standard. Foreign (Mongolian) inscription.\n\nNo. 208.\nNo. 208.\n\n208. LOONG-FOONG-TSIEN, (Soong,*) Seaou-ming-waung,—Copper.—The copper like gold.\n\n* State.\n\nNo. 209.\n209. Tëen-yu-tsiên, (Woo,*) Ching-warng,—white copper,—respective denominations, 1 tsien, 3 tsien, and 5 tsien. One kind standard. On the reverse the numbers 1, 3, or 5.\n\n* State.\n\nNo. 210.\n\n210. Tëen-ke-tsiên, (Tëen-yuen,*) Tseu-show-hwuy.\n\n* State.\n\nNo. 211.\n\n211. Tëen-ting-tsiên, (Tëen-yuen,*) Tseu-show-hwuy,—red copper.\n\n* State.\nNo. 212.\n\n212. TAR-YE-TOONG-PAOU, (Harn,*) Chin-yu-leang.\n\n* State.\n\nNo. 213.\n\n213. T'EE-N-TOONG-TSIEN, (Hear,*) Ming-yuh-chin. Of two kinds: the other had the words of the inscription differently arranged.\n\n* State.\n214. TAR-CHOONG-TARNG-SHIH-TSIEN, (Ming,) Tae-tsoo. Denomination, (by inscription,) 10 tsien. On the reverse the word \"shih,\" or the words \"goh-shih,\" \"tsz-shih,\" \"shih-yu,\" or \"pih-ping-shih.\"—A.D. 1368.\n215. TAR-CHOONG-TARNG-WOO-TSIEN, (Ming,) Tae-tsoo. Denomination, 5 tsien. The reverse either plain, or bearing the words \"chë,\" \"yu,\" or \"tse.\"\n\nNo. 216.\n\n216. TAR-CHOONG-TARNG-SARN, (Ming,) Tae-tsoo. Denomination, 3 tsion. The reverse plain, or bearing the words \"chë,\" \"yu,\" \"kwarng,\" \"fooh,\" or \"king.\"\nNo. 217.\n\n217. TAR-CHOONG-TARNG-URH, (Ming,) Tae-tsoo. Denomination, 2 tsien. Reverse plain.\n\nNo. 218.\n\n218. TAR-CHOONG-SEAOU-PING, (Ming,) Tae-tsoo. Standard. Reverse plain, or bearing the words \"pil-ping,\" or \"tse.\"\n\nNo. 219.\n219. Hoong-woo-tarng-shih-tsien, (Ming,) Tae-tsoo,—Copper. Denomination, 10 tsien. The Ming tsiens were of two kinds \"golden-backed\" and \"varnished\"; the first were made of superior brass; the second were made of inferior copper, and being smeared with some pigment were black as iron. The reverse was either plain or bore the words \"Shih-yih-leang,\" \"King-shih,\" \"Kwei-shih,\" \"Shih-fooh,\" \"Shih-yu,\" \"Shih-che,\" or the word \"shih\" alone. Hoong-woo-tsiens were also coined by the Japanese, who could not however inscribe them with the national epoch.\n220. Hoong-woo-tarng-woo-tsien, (Ming,) Tae-tsoo. Denomination, 5 tsien. Reverse plain, or bearing the words \"woo-tsien,\" or \"woo-fooh.\"\n\nNo. 221.\n\n221. Hoong-woo-tarng-sarn, (Ming,) Tae-tsoo. Denomination, 3 tsien. Of two kinds, the broad and the narrow rimmed. The reverse plain (the most numerous kind) or inscribed with the words \"sarn-tsien,\" or the words \"chë,\" \"yu,\" \"fooh,\" or \"kwei,\" (the smallest kind.)\n\nNo. 222.\n222. Hoong-woo-tarng-urh-tsien, (Ming,) Tae-tsoo. Denomination, 2 tsien. Those with the reverse plain, the most numerous.\n\nNo. 223.\n\n223. Hoong-woo-seaou-ping, (Ming,) Tae-tsoo. Standard. The reverse plain (the most numerous class,) or bearing the words \"yih,\" \"tsien,\" \"pih-ping,\" or the words \"kwei,\" \"fooh,\" \"che,\" \"yu,\" or \"chë.\"\n\nNo. 224.\n\n224. Keën-wun-tsien, (Ming,) Huuy-tsoong.—A.D. 1399.\n\nNo. 225.\n\n225. Yoong-loh-tsien, (Ming,) Shing-tsoo. Coined by the poo-ching-sz' of Che-keang, Fuh-kien, Keang-soo, Kwarng-toong.—A.D. 1403.\nNo. 226.\n\n226. Hoong-he-tsiên, (Ming,) Yin-tsoong. 1,000,000 ting of these were coined in the time of Kear-tsing. A \"ting\" is 5,000. (Kear-tsing was the national mark of She-tsoong's reign.)—A.D. 1425.\n\nNo. 227.\n\n227. Seuen-tih-tsiên, (Ming,) Seuen-tsoong. 1,000,000 ting more were coined in the time Kear-tsing.—A.D. 1426.\n\nNo. 228.\n\n228. Ching-toong-tsiên, and Têen-shun-tsiên, (Ming,) Ying-tsoong. 1,000,000 ting were coined in Kear-tsing time.—A.D. 1436.\n\nNo. 229.\n229. **King-tae-tsien**, (Ming,) *Tae-tsoong.*—A.D. 1450.\n\nNo. 230.\n\n---\n\n230. **Ching-hwar-tsien**, (Ming,) *Heen-tsoong.* In the time Kearn-tsang were coined altogether 1,000,000 ting.—A.D. 1465.\n\nNo. 231.\n\n---\n\n231. **Heoong-che-tsien**, (Ming,) *Haou-tsoong,*—1 tsien 2 fun weight.—A.D. 1488.\n\nNo. 232.\n\n---\n\n232. **Ching-tih-tsien**, (Ming,) *Woo-tsoong.* Standard. Of two kinds: the reverse of one bearing the figure of a dragon playing with a pearl.—A.D. 1506.\n\nNo. 233.\n233. TAR-MING-TSIEN, (Ming,) She-tsoong,—1 tsien 3 fun weight.—A.D. 1522.\n\nNo. 234.\n\n234. KEAR-TSING-TARNG-SHIH, (Ming,) She-tsoong. Denomination, 10 tsien.\n\nNo. 235.\n\n235. KEAR-TSING-TARNG-WOO-TSIEN, (Ming,) She-tsoong,—Copper. Denomination, 5 tsien. The copper like gold.\n\nNo. 236.\n236. Khar-Tsing-Tarng-Sarn-Tsien, (Ming,) She-tsoong. Denomination, 3 tsien.\n\nNo. 237.\n\n237. Khar-Tsing-Ché-Urh-Tsien, (Ming,) She-tsoong. Denomination, 2 tsien.\n\nNo. 238.\n\n238. Khar-Tsing-Seaou-Ping, (Ming,) She-tsoong. Standard.\n\nNo. 239.\n\n239. Loong-Hing-Tsien, (Ming,) Muh-tsoong. These and the Warn-leih were heavier by half a choo than the Khar-tsing.—A.D. 1567.\n\nNo. 240.\nNo. 240.\n\n240. Warn-leih-tsien, (Ming,) Shin-tsoong. Either \"golden-backed,\" made of brass four times smelted, and of which 8 were estimated as equivalent to a fun of silver; or \"varnished,\" made of brass twice smelted, or with marked edges,—of which 12 were estimated as equivalent to a fun of silver; or similar in size to those of denomination 2; or of denomination 1, with reverse plain, or bearing the words \"te'en,\" or \"koong,\" or a circle.—A.D. 1573.\n\nNo. 241.\n\n241. Tae-charng-tsien, (Ming,) Kwarng-tsoong. Coined in the following reign.—A.D. 1620.\n\nNo. 242.\n242. TEEN-KE-TAR-TSIEN, (Ming,) He-tsoong. Tsien were coined of denominations 10, 100, and 1000, but were found inconveniently large. Some had similar inscriptions on both sides: the reverses of some were plain.—A.D. 1621.\n\nNo. 243.\n243. TEEN-KE-SEAOU-PING-TSIEN, (Ming,) He-tsoong. Respective denominations, 1 tsien, and 2 tsien. Standard. The reverse of some also bore the words \"koong,\" \"yuen,\" \"che,\" or \"wun.\" On those of denomination 2 was simply the figure of a star.\n\nNo. 244.\n\n244. TSOONG-CHIN-TARNG-SHIH-TSIEN, (Ming,) Wae-tsoong. Denomination, 10 tsien. Reverses of all plain. Money of the old coinages called in and treated as old copper.—A.D. 1628.\n\nNo. 245.\nNo. 245.\n\n245. Tsoong-chin-tarng-woo, (Ming,) Wae-tsoong.—Green Copper. Respective denominations, 5 tsion, and 2 tsien. Those of denomination 2 bore on the reverse the number 2, or the figure of a star.\n\nNo. 246.\n246. Tsoong-chin-seaou-ping-tsiên, (Ming,) Wae-tsoong. Standard. The reverse plain, or bearing one of some tens of different inscriptions consisting of one or two words each.\n\nNo. 247.\n\n247. Tsoong-chin-mar-tsiên, (Ming,) Wae-tsoong. The horse (mar) was perhaps ominous of the rebel Chwarng (of whose name the word \"mar,\" formed a part.) It was vulgarly asserted that the Mar-tsoong (tsien) cured difficult parturition by stimulating birth.\n\nTHE PRINCES AT THE CLOSE OF THE MING DYNASTY.\n\nNo. 248.\n\n248. Koong-kwarngh-chê-urh-tsiên, (In Ying-tseen,) Fooh-warng. Denomination, 2 tsien.\n249. Koong-kwarng-seaou-ping-tsiên, (In Ying-tœn,) Fook-warng. Standard. Reverse plain, or bearing the words \"gun,\" \"hoo,\" or \"koong,\" or the figure of a star, or the word \"foong\": the last kind coined by Mar-sze-ying, when viceroy of Foong-yarng.\n\nNo. 250.\n\n250. Loong-woo-tsiên, (In Fooh-kœn,) Tarng-warng. The reverse of the smaller kind bearing the words \"hoo,\" \"koong,\" or the figure of a star.\nNo. 251.\n\n251. Chaou-woo-toong-paou, (In Fooh-keen,) Seaou-tarng-warng. Standard.\n\nNo. 252.\n\n252. Tar-ming-tsien, (In Chë-keang,) Loo-warng. Reverse bearing the words \"hoo,\" \"koong,\" or \"shwuy.\"\n\nNo. 253.\n253. Yoong-leih-tar-tsien, (In Kwarng-toong,) Yoong-ming-warng.\n\nNo. 254.\n\n254. Yoong-leih-tarng-woo-tsien, (In Kwarng-toong,) Yoong-ming-warng. Denomination, 5 tsien.\n\nNo. 255.\n255. Yoong-leih-seaou-ping-tsien, (in Kwarng-toong,) Yoong-ming-warng. Standard. The reverse of others was plain, or bore the words \"hoo,\" \"koong,\" or \"ming.\"\n\nNo. 256.\n\n256. Yoong-leih-chê-urh-tsien, (in Kwarng-toong,) Yoong-ming-warng. Denomination, 2 tsien.\n\nNo. 257.\nNo. 257.\n\n257. Yoong-leih-toong-paou-tsien, (in Kwarng-toong,) Yoong-ming-warn. Similar to those of denomination 2. Perhaps coined by the rebel Warng-chin in the time Kear-tsing.\n\nADDITIONAL.\n\nNo. 258.\n258. Yoong-charng-tar-tsien, Le-tsz-ching. Denomination of largest, one leang of silver; of second in size, 100 tsien; the third was standard.\n\nNo. 259.\n259. TAR-SHUN-TSIEN, and HING-CHAOU-TSIEN, Charng-heen-choong. The Hing-chaou coined by his adopted son.\n\nCOCHIN-CHINA.\n\nNo. 260.\n260. Shun-teên-yuen-paou, Le-le.\n\nNo. 261.\n\n261. Chaou-ping-toong-paou, and Tar-paou-toong-paou, Le-lin.\n\nNo. 262.\n\n262. Tar-hor-toong-paou, and Yen-ning-toong-paou, Le-seuen.\n\nNo. 263.\n\n263. Teên-hing-toong-paou, Le-tsoong.\n\nNo. 264.\n264. Kwarng-shun-toong-paou, and Hoong-tih-toong-paou, Le-haou.\n\nNo. 265.\n\n265. King-toong-toong-paou, Le-houy.\n\nNo. 266.\n\n266. Twarn-hing-toong-paou, Le-ye.\n\nNo. 267.\n\n267. Hoong-shun-toong-paou, Le-chow.\n\nNo. 268.\nARTICLE I.—CHINESE COINAGE.\n\n268. KEAOU-CHE-TOONG-PAOU, Le-hwuy.\n\nNo. 269.\n\n269. YUEN-HOR-TOONG-PAOU, Le-ning.\n\nADDITIONAL.\n\nNo. 270.\n\n270. MING-TIH-TOONG-PAOU, and TAR-CHING-TOONG-PAOU, Moh-tung-yoong, and Tarng-ying.\n\nKOREA.\n\nNo. 271.\n\n271. HAE-TOONG-TSIEN,—3 choo 6 luy weight.\nNo. 272.\n\n272. Toong-kwoh-tsien,—3 choo 4 luy.\n\nNo. 273.\n\n273. Chaou-séen-tsien. Coined probably in the time of Taesoo (Hoong-woo,) or subsequently: he changed the name of Korea to Chaou-séen.\n\nNo. 274.\n\n274. Hor-toong-tsien, (Japan,)—Copper,—5 choo weight.\nNo. 275.\n\n275. SHIN-KOONG-TSIEN,—Copper.\n\nNo. 276.\n\n276. HING-CHARNG-TSIEN, and HWARN-YOONG-TSIEN, Hing-charng, and Hwarng-yoong. Reverses plain, or bearing the words \"wun,\" \"tsar,\" \"kin,\" \"sien,\" \"charng,\" \"tsuh,\" \"seaou,\" \"yuen,\" or \"kin.\"—A.D. 1605, 1623.\n\nKAOU-CHARNG.\n\nNo. 277.\nNo. 277.\n\n277. YEN-HE-TSIEN, CHARNG-TIH-TSIEN, KIU-GARN-TSIEN, and CHING-YUEN-TSIEN.\n\nNo. 278.\n\n278. KAOU-CHARNG-TSIEN. Very thick and heavy; time of coinage unknown.\n\nANCIENT TSIEN, NOT CLEARLY REFERABLE TO ANY PERIOD.\n\nNo. 279.\n279. **SHIN-NOONG-TSIEN**, or [Sor-tsz*-TSIEN,—Copper,—7 choo weight. Like a half leang in appearance.\n\n* A lock.\n\nNo. 280.\n\n280. **TAR-TSEUEN-WOO-CHOO.** Perhaps referable to the Woo-ke, (between the Targ and Soong dynasties.) Reverse bore the figure of the moon and a star.\n\nNo. 281.\n\n281. **PING-TARG-WOO-CHOO,**—3 choo weight.\nNo. 282.\n\n282. Suh-choo. Somewhat like the \"Woo-choo.\"\n\nNo. 283.\n\n283. Ming-yuet-tsien,—4 choo 2 luy weight.\n\nNo. 284.\n\n284. Ee-wun-tsien,—10 choo weight. Inscription unintelligible, perhaps 天贊 in the Leaou (toong) character.\nNo. 285.\n\n285. TAR-CHE-TSIEN.\n\nNo. 286.\n\n286. HWARNG-YUEN-TSIEN, and KING-YUEN-TSIEN.\n\nNo. 287.\n\n287. KAE-HOR, and KAE-TING-TSIEN.\n\nNo. 288.\n\n288. PAOU-TAE-TSIEN, and TAE-TIH-TSIEN. The reverse bore the figure of a star.\nNo. 289.\n\n289. Kin-yuen-she-paou-tsien,—Copper. Supposed to be of foreign coinage.\n\nNo. 290.\n\n290. Yoong-shing-tsien.\n\nNo. 291.\n\n291. Loong-ke-tsien.\n\nNo. 292.\n\n292. Ming-ting-tsien. The inscription (as in other cases not here noticed) in different styles of writing.\nNo. 293.\n\n293. Chaou-toong-tsiên. The reverse plain, or bearing the word \"choong,\" or \"ching.\"\n\nNo. 294.\n\n294. Yuen-ping-tsiên, and Ching-ping-tsiên,—Copper.\n\nNo. 295.\n\n295. Ning-min-tsiên, and Keen-kwoh-tsiên.\n\nNo. 296.\n\n296. Ping-garn-tsiên.\nNo. 297.\n\n297. TAR-SHE-TSIEN, and SHE-KAOU-TSIEN.\n\nNo. 298.\n\n298. YOONG-SHOW-TSIEN.\n\nNo. 299.\n\n299. YUEN-TSOONG-TSIEN.\n\nNo. 300.\n\n300. FOOH-FING, and CHAOU-FOO,—Red Copper.\nARTICLE I.—CHINESE COINAGE.\n\nNo. 301.\n\n301. PAOU-YOONG-TSIEN,—Copper.\n\nNo. 302.\n\n302. SEËN-TAE-TSIEN,—Iron.\n\nNo. 303.\n\n303. SHING-TIH-TSIEN.\n\nNo. 304.\n\n304. SEUEN-KWARN-TSIEN.\nNo. 305.\n\n305. KWARNG-HOR-TSIEN.—Red Copper.\n\nNo. 306.\n\n306. KEÖ-TZS-TSIEN. The figure on the left is perhaps some private signature or mark.\n\nNo. 307.\n\n307. SOONG-MING-TSIEN.\n\nNo. 308.\n308. King-hing-tsien. Of these we have some with inscriptions in the Le and Seuen styles of writing, all designated \"toong-paou.\" In the Chin and Hing styles are Keu-paou, Yoong-paou, Choong-paou, Tseuen-paou, Shun-paou, Nuy-paou, Che-paou, and Tar-paou. The reverses bear the words \"sharn-narn,\" \"sharn-se,\" \"choong,\" \"koong,\" or \"king;\" and some have two foreign characters. A few kinds only here inserted.\n\nNo. 309.\n309. Gow-sin-tsien,—respective weights, 1 leang 3 tsien, 1 leang 2 tsien, 1 leang and 2½ tsien. Of 4 kinds, the very large kind scarce, the smaller abundant. All introduced by the Russians or the Mahomedan tribes.\n\nNo. 310.\n\n310. Ee-pe*-tsien,—12 choo weight. The obverse flat, the reverse convex. Time of coinage unknown.\n\n* Ant's nose.\n\nMAR+—TSIEN.\n\n† Horse.\n\nNo. 311.\n\n311. Loong-mei-tsien,—2 tsien weight. Loong-mei was the name of a good horse.\n\nNo. 312.\n312. Keuen-maou-tsien. The horse Keuen-maou (curly haired) was presented by Tae-tsoong (of the Tarng dynasty) to Keötsz-e.\n\nNo. 313.\n\n313. Warng-yun-tsien. The horse could go 1000 le a day; \"Warng-yun\" refers to its fleetness (emulating the clouds.)\n\nNo. 314.\n\n314. Charng-foo-tsien.\n\nNo. 315.\n\n315. Harn-heueh-tsien,—2 tsien weight. Harn-heueh was the name of a good horse of the Tar-warn in the time of Harn.\nNo. 316.\n\n316. Yu-muh-tsien.\n\nNo. 317.\n\n317. Fe-hwarng-tsien. Fe-hwarng is Shing-hwarng (a horse's name) of the She-king.\n318. Oo-tseu-tsien,—8 fun weight. The smallest of the Mar-tsien.\n\nTHE YAH-SHING-TSIEN.\n\nNo. 319.\n\n319. Yin-yarng-shin-ling-tsien,—2 tsien weight. Of two kinds, coined by Ying-tsoong for presentation to the officers who declined to serve him.\n\nNo. 320.\n\n320. Woo-leang-tar-poo-tsien. The reverse bore the figures of a tortoise, a snake, the stars, and a sword, or of a double sword, a man, and so forth.\nNo. 321.\n\n321. SHWARNG-FOONG*-TSIEN,—6 choo weight.\n* Pair of foong birds.\n\nNo. 322.\n\n322. LOONG-FOONG*-TSIEN,—3 choo 9 luy weight. On the obverse the figures of a foong bird and a dragon; on the reverse those of four men, each holding a knife and a club.\n* Dragon and foong bird.\n\nNo. 323.\n\n323. SHWARNG-YU*-TSIEN,—4 choo 5 luy weight.\n* Pair of fishes.\n\nNo. 324.\n324. YIH-YU-WARN-PEI-TSIEN. On the reverse the figure of a balance. On the weight of the balance the word \"E,\" (according with one's,) \"wish.\"\n\nNo. 325.\n\n325. KEEN-YUEN-TSIEN,—5 choo weight. On the obverse a representation of the Pih-tow and Keen-yuen constellations. On the reverse that of a dragon, a foong bird, and a spear.\n\nNo. 326.\n\n326. TEEN-TSARN-WARN-PEI-TSIEN,—9 fun, 1 choo weight. On the reverse the figure of a stag (luh);—a pun upon the word \"luh,\" meaning the salary of an officer of Government.\n\nNo. 327.\n\n327. YOONG-GARN-WOO-NARN-TSIEN. On the reverse, four figures of brutes.\nNo. 328.\n\n328. TEEN-HEAR-TAE-PING-TSIEN,—respective weights 6 choo, and 5 choo. The reverse bore the figures of four men holding military weapons, or a representation of the waves of the sea, or the figures of nine boys.\n\nNo. 329.\n\n329. On the obverse, a representation of two men, a dog, the sun and a cloud. On the reverse, two indistinct figures resembling men, a flower, and a figure resembling a censer.\nARTICLE II.\n\nMANUFACTURE OF MAGNETIC NEEDLES AND VERMILION.\n\nEXTRACTS FROM THE TUNG-THEEN-SHAOU 通天曉:\n\nBy Dr W. A. Harland.—Read to the Society, September 3d, 1850.\n\nThe work from which the following extracts are taken, is a small cyclopædia of useful and curious recipes, in four volumes. The first edition was published in Canton in 1816, and the latest in 1837. It contains a most miscellaneous variety of information, from the rearing of various domestic animals, fish included, to the preparation and grinding of pigments, preservation and beautifying of the hair and teeth; after which come various metallurgic and chemical processes.\n\n(1.)—To make Needles point towards the South.\n\nTake of Vermilion, Orpiment, and Iron filings, of each, several Fun, (one Fun=6.4 grs. avoirdupois), reduce them to an impalpable powder, and mix together with blood from the comb of a white cock. Twenty or thirty needles are to be mixed up with this composition, well folded in paper, and placed in a furnace where they are to be exposed to the highest heat of a charcoal fire for seven days and seven nights. They are then to be taken out and folded up in a piece of flesh for three days, after which they may be removed and placed on the surface of water to ascertain whether they turn towards the South, and are fit for use.—(Vol. 2, chap. 10, p. 3.)\n\nOf this method of making Magnetic Needles it may be observed, that, supposing the process to have the effect represented, it is probable that the continued heat alone is the active agent, and that the strange composition of vermilion, orpiment, iron filings, and blood, perhaps serves to protect the needles in some measure from the destructive action of a long-continued fire. The folding up in a piece of flesh certainly cannot have any effect.\n\n(2.)—To make Vermilion.\n\nTake of Mercury 16 taels, and of Sulphur, (previously reduced to fine powder) 4 taels, put them into an earthenware jar, and cover them with a layer of moist salt 3 inches thick:—when the materials are dry, the jar is to be placed in an iron pot. Take an iron lamp-cup and put it over the mouth of the jar, and at the place where it joins, bore a small hole with an iron wire, that the salt may not be too long in drying.* Now place the whole in a furnace, and having ready about 120 catties of Charcoal, at about 8 o'clock in the morning, light the fire, and extinguish it early on the following morning: at about noon, when the furnace is cool, take out the iron pot, and after breaking the earthenware jar, remove the melted mass. The mass must be ground exceedingly fine with about 30 pints of water, and then put into a basin, where it may be ground again; after it has completely subsided the water must be removed. The upper-\n\n* Or, in other words, to allow the escape of vapours given off when the mixture is heated.\nmost layer is called Pan-hung 板紅; the second Te-urh-hung 第二紅, and the lowest, Sin-hung 心紅. These layers may be separated by a knife and then dried in the sun. The Vermilion is now ready for packing away.—(Vol. 3, chap. 12.)\n\nNotwithstanding the refinements of modern chemistry, no satisfactory reason has been given for the superior colour of Chinese and Dutch Vermilion, though various explanations have been suggested. In my opinion the beauty of this, as of many other Chinese pigments, is chiefly, if not entirely, owing to the excessive care and labour bestowed by them on the long-continued grinding and frequent elutriation with water.\nJOURNAL OF PROCEEDINGS.\n\nFEBRUARY 1st, 1848.\n\nThe Honourable A. R. Johnston, Esq., V. P., in the chair.\nThe Secretary read the Report of the Council for the past year, and it was then ordered to be printed in the 1st vol. of the Transactions of the Society.\nMr John Dent was elected an Ordinary Member of the Society.\nM. Natalis Rondet, and M. Isidore Hedde, Commercial delegates from France to China, were elected Corresponding Members.\nMr Cairns read the first portion of a paper by Dr Bettelheim, on \"The Origin of the Inhabitants of the Loo-choo Islands.\"\nA vote of thanks was passed to Dr Bettelheim for the paper.\nThe Meeting then adjourned.\n\nMARCH 7th, 1848.\n\nJ. C. BOWRING, Esq., V. P., in the chair.\nThe Rev. J. Johnson, Baptist Missionary, and the Rev. Theodore Hamberg, Missionary, were elected Corresponding Members of the Society.\nThe following donations were presented:—\nBy Dr Dill,—Several Snakes and Insects captured in Hongkong.\nBy Dr Kennedy,—Several Hongkong Snakes.—A Human foetus.—A large tumour obstructing the Intestinal Canal.—Several Intestinal worms.—A specimen of Horse-shoe Kidney from the human subject.\nThe Secretary read a long extract from a letter addressed by professor Julien of Paris to Mr Wade, the Chinese and Foreign Secretary. The principal subject mentioned in the letter was a proposed improvement in the arrangement of Chinese characters in a Dictionary, offering greater facilities than by any previous method, for finding words.*\n\nMr Cairns then read the remaining portion of Dr Bettelheim's paper on the Origin of the Inhabitants of the Loo-choo Islands, and the Secretary was directed to write to Dr Bettelheim, to thank him for the paper, and to request him to forward more information on the subject; but at the same time begging him to confine his remarks to such matters as might come under his own immediate observation, e.g. dwellings, food, clothing, productions, geography, &c.\nDr Harland read his translation of a pamphlet which had been sent by professor Julien to Mr Macy, containing extracts from Chinese Authors on various subjects, viz:—On the Magical Mirrors of the Chinese—On the Art of Printing by Wooden Blocks, by Engraved Plates of Stone, and by moveable Types, employed in China long before they were made use of in Europe—On the process employed by the Chinese for Cracking the Glaze of Porcelain Vessels—On the Alloys of Copper, white Copper, Gongs and Tam-tams—Notes upon the ancient Military use of Paper-kites, and upon Boats and Ships of Iron and Copper. Dr Harland illustrated the section on printing by a series of baked earthenware types and iron frames, such as appears to have been the very earliest kind of moveable types ever employed, having been invented by a blacksmith named Pe-ching, between A.D. 1049 and 1041. The specimens now exhibited were presented to the Society, as also an illustration of the mode of making moveable metal types,\n\n* The letter is omitted here, as its subject matter has been already published in Europe.\nas practised at the royal printing establishment at Peking during the reign of K'ien Lung, A.D. 1776, viz., by means of wooden punches, and earthenware matrices.\n\nThe Meeting then adjourned.\n\nAPRIL 4TH, 1848.\n\nThe Honourable W. T. Mercer, Esq., V. P., in the chair.\n\nE. E. Sullivan, Esq., H. B. M. Consul at Ningpo, and Mr W. Tarrant of Hongkong, were elected Ordinary Members of the Society.\n\nDonation by Major H. P. Burn,—Harris' Portraits of the Game and Wild Animals of Southern Africa, 2 vols. folio plates.\n\nThe Secretary read a letter from Major Burn tendering his resignation as Treasurer of the Society, on account of his leaving the Colony. The thanks of the Society were voted to Major Burn for his services, and it was then proposed by Dr Harland, seconded by Mr Cairns, and carried unanimously,—“That the Treasurership remain vacant until the return of Mr Charles Stuart to Hongkong,” Mr A. Dunlop, the acting manager of the Oriental Bank, having kindly undertaken the duties in the meantime.\n\nA letter, containing Queries on Buddhism, from the Secretary of the “Ceylon Branch of the Royal Asiatic Society,” was then read, and on the motion of Mr Philips was referred to the Council for investigation.\n\nThe Secretary informed the Meeting that the Rev. Mr Stanton and himself, being the only Members of a deputation (appointed by the Council) who were able to attend, had had an interview with Sir John Davis on the occasion of his leaving the Colony, and consequent resignation as President of the Society. Sir John Davis expressed the most cordial wishes for the welfare and success of the Society, and promised to do all in his power to farther its object on his return to England.\n\nThe first portion of a paper by the Rev. C. Gutzlaff,—On the Influence of China on Asia, was then read by the Secretary;\n\nAfter which the Meeting adjourned.\n\nMAY 2D, 1848.\n\nA. Shortrede, Esq., Councillor, in the chair.\n\nDr Cree of H. M. Steamer Fury, was elected an Ordinary Member.\n\nDonations, by Dr Cree,—A specimen of a species of Tringa, shot on Hongkong.—Larva of some insect extracted by a Chinese woman from the Gums of a Member of the Society.\n\nBy Mr Cleverly,—A Snake from Hongkong.\n\nBy Dr Harland,—A Sea-snake from the coast of Coromandel.\n\nBy Mr Markwick,—A collection of Shells.\n\nThe Secretary informed the Meeting that the Council had elected H. E. Samuel George Bonham, Esq., to the office of President, vacant by the resignation of Sir John Davis, and that H. E. had kindly consented to accept the office. The Council had also filled up the vacancy amongst the Vice-Presidents, consequent upon the departure of Mr J. C. Bowring for England, by the election of Mr John Stewart.\n\nThe second portion of the Rev. C. Gutzlaff's essay, On the Influence of China on Asia, was read; and after a vote of thanks to the author,\n\nThe Meeting adjourned.\n\nJUNE 6TH, 1848.\n\nJohn Stewart, Esq., V. P., in the chair.\n\nProfessor Neumann of Munich, and Professor Brockhaus of Leipzig, were elected Honorary Members of the Society.\nDonation, by Dr Young,—A Snake killed on the island.\n\nThe Secretary read the Rev. C. Gutzlaff's answers to the set of queries, On Buddhism as it exists in China, received in April last, from the \"Ceylon Branch of the Royal Asiatic Society.\" The thanks of the Society were voted to Mr Gutzlaff for the information afforded, and the Secretary was directed to forward a copy to the \"Ceylon Branch Society\" by the next mail.\n\nThe Meeting then adjourned.\n\nJULY 4TH, 1848.\n\nThe Honourable W. T. Mercer, Esq., V. P., in the chair.\n\nMr E. A. Drummond of H. M. Steamer Daedalus, was elected an Ordinary Member of the Society.\n\nA lengthened conversation took place as to the great advantages likely to result from the establishment of a Botanical Garden under the care of the Society, and Mr Gutzlaff undertook to write a letter to the Secretary, to be read at the next General Meeting, that steps might be taken to have an interview with H. E. the Governor on the subject.\n\nThe Meeting then adjourned.\n\nAUGUST 8TH, 1848.\n\nThe Rev. S. W. Steedman, Corresponding Secretary, in the chair.\n\nThe Baron von Carlowitz, and Dr Thornton, were elected Ordinary Members of the Society.\n\nDonation, by Dr Young,—A Snake killed on the island.\n\nThe Secretary then read Mr Gutzlaff's suggestions relative to the formation of a Botanical Garden in connection with the Society.\n\nThe thanks of the Society were voted to Mr Gutzlaff for his valuable suggestions, and after some discussion as to the best means of carrying them into effect, the following resolution was proposed by Mr Mackean, seconded by Dr Harland, and carried unanimously,—“That a Committee be appointed to make enquiries as to the best site, the probable expenses, &c., &c., and to report generally on the subject.” The following gentlemen were named as the Committee,—the Rev. S. W. Steedman, Dr Harland, Dr Dill, Mr Shortrede, and Mr Cairns.\n\nA letter from M. Isidore Hedde, enclosing a copy of the Rapport sur le Concours du prix d'Orleans pour l'importation la plus utile à l'Agriculture, à l'Industrie ou à l'humanité, was also read;\n\nAfter which the Meeting adjourned.\n\nOCTOBER 3D, 1848.\n\nThe Honourable W. T. Mercer, Esq., V. P., in the chair.\n\nA donation consisting of three Funeral Tablets was presented by Mr Gutzlaff, to whom the thanks of the Society were voted. These tablets having been long exposed to the weather, exhibited the protective power of the ordinary China ink, the written characters remaining in relief, whilst the surrounding wood has been gradually worn away by the weather. Mr Gutzlaff also presented to the Society a copy of his pamphlet on the Triad Society.\n\nThe Secretary read the first part of an essay by Mr Gutzlaff, On Mohammedianism in China, to be concluded at the next Meeting.\n\nThe Meeting then adjourned.\nNOVEMBER 7th, 1848.\n\nT. W. L. Mackean, Esq., in the chair.\n\nThe following donations were presented, by Crofton Morrison, Esq.—A copy of the Chinese work in 99 vols. entitled, General Topography of Fu-h-keen province.\n\nBy C. B. Hillier, Esq.—A manuscript copy of his translation of the 錢志新編 (Chronicles of Tsuen, a new arrangement) a Chinese work on Coins. (Vide Transactions.)\n\nBy the Royal Asiatic Society.—A complete set of the Society's Journals and Transactions.\n\nAfter much discussion relative to the establishment of the Botanical Garden, it was proposed by Mr Mackean, seconded by Dr Harland, and carried unanimously,—“That the Garden Committee be authorized to draw up a memorial to the Colonial Government and to the Royal Asiatic Society for assistance, either by funds or otherwise, towards establishing a Botanical Garden in Hongkong; and also to correspond with such of the Botanical or Horticultural Societies in England as may be likely to assist in furthering the object in view.”\n\nAnother proposition by the Chairman, seconded by Mr Scott, was also carried,—“That a communication be sent to the Interpreters at each of the four Northern Ports, requesting them to obtain and forward to the Society every possible information respecting the cultivation, &c., of Tea, in the neighbouring districts.”\n\nThe Secretary then read the remaining portion of Mr Gutzlaff’s paper on Mohammedanism in China, for which the thanks of the Society were voted.\n\nThe Meeting then adjourned.\n\nJANUARY 9th, 1849.\n\nThe Honourable A. R. Johnston, Esq., V. P., in the chair.\n\nMr Summers was elected a Corresponding Member of the Society.\n\nMr Wade read an abstract of his paper on Japan, the original essay, which is chiefly a translation of the 12th chapter of Commissioner Lin’s work on general Geography, being considered too long.\n\nThe thanks of the Society were voted to Mr Wade;\n\nAfter which the Meeting adjourned.\n\nFEBRUARY 9th, 1849.\n\nA. H. Balfour, Esq., Councillor, in the chair.\n\nA letter from Dr Harland was read in which he regretted that owing to private matters of an unpleasant nature, he could not retain the office of General Secretary any longer; whereupon, Dr Dill requested Mr Shortrede to act as interim Secretary, and the request having been duly seconded by Mr Meadows, Mr Shortrede agreed to act until next Meeting.\n\nDr Dill stated, that he was about returning to England, and requested to be furnished with a certificate of membership, but after some conversation it was agreed that as this was the first application of the kind, it should be referred to another Meeting.\n\nThe Meeting then adjourned.\n\nMARCH 6th, 1849.\n\nThe Honourable W. T. Mercer, Esq., in the chair.\n\nMr Shortrede explained the nature of the application for a certificate made by Dr Dill at a previous Meeting, and, after some conversation, the General Secretary was requested to draw up a form.\nThe election of Office-bearers for the ensuing year having been postponed at last Meeting, the following list was proposed and approved of,— \n\nPresident. \nH. E. Samuel George Bonham, C.B., Governor of Hongkong.\n\nVice-Presidents. \nRev. V. Stanton. \nA. Campbell, Esq. \nF. T. Bush, Esq. \nA. H. Balfour, Esq.\n\nCouncillors. \nRev. S. W. Steedman. \nJohn Cairns, Esq. \nThomas Taylor Meadows, Esq. \nT. W. L. Mackean, Esq. \nCharles St George Cleverly, Esq. \n(One vacant.)\n\nSecretaries. \nGeneral.—A. Shortrede, Esq. \nCorresponding.—J. C. Bowling, Esq. \nChinese and Foreign.—T. Wade, Esq.\n\nTreasurer. \nC. J. F. Stuart, Esq.\n\nMr Stuart reported that Mr Shortrede and he had, of their own accord, waited upon H. E. the Governor to request that accommodation might be granted for the Society on the ground-floor of the Court-house, now occupied as a church; and had great pleasure in stating that after consulting the Chief Justice, a large room, at present used as a vestry, had been set apart for the Society.\n\nThe Secretary was instructed to express to H. E. the cordial thanks of the Society, and it was resolved to remove into the new premises as soon as they should be vacated by the Church, which might probably be before next General Meeting.\n\nThe Meeting then adjourned.\n\nAPRIL 17TH, 1849.\n\nT. W. L. Mackean, Esq., in the chair. \nMessrs D. Jardine, and A. Campbell, were elected Ordinary Members of the Society.\n\nAfter the necessary arrangements were made for taking care of the new rooms, lighting, &c., \nThe Meeting adjourned.\n\nMARCH 5TH, 1850.\n\nA. H. Balfour, Esq., V. P., in the chair. \nThe Secretary stated that a valuable contribution had been received from the United States, being the first production of the Smithsonian Society, On the Antiquities of the Mississippi. The Secretary further reported that there had been received from Dr Bettelheim at Loo-choo (through Dr Williams of Canton) A Japanese Grammar, and it was suggested that the work should be submitted to Dr Williams with a view to its future publication.\nThe present being the first Meeting held this year, and the proper time for electing Office-bearers for the ensuing year, it was deemed advisable to postpone the election till the next Monthly Meeting, on account of the very few Members present. It was agreed however to make such re-elections as were consistent with the rules, and on the motion of Mr Pereira, seconded by Mr A. Scott, the President, Secretaries, and Treasurer, were declared re-elected. Upon this motion being carried, Mr Shortrede begged that some one should be substituted for him as General Secretary, because, however desirous he was to promote the interests of the Society, he had been unable to attend any Meeting during the past summer, and though he had requested that some one of the other office-bearers should notify and attend the meetings, and keep the minutes, he was sorry to find that this had not been done: Moreover, as he should probably reside in Macao during the approaching summer, he begged that, if re-elected, he might have an associate to carry on the ordinary business, and was glad to say that a very efficient one could be found in Mr Crakanthorp. This proposal was at once agreed to.\n\nThe Meeting then adjourned.\n\nAPRIL 9TH, 1850.\n\nA. H. Balfour, Esq., V. P., in the chair.\n\nThe election of some of the Office-bearers for the ensuing year having been postponed at the last Meeting, the following list was proposed and approved of,\n\nPresident.\n\nH. E. Samuel George Bonham, C.B., Governor of Hongkong.\n\nVice-Presidents.\n\nThe Honourable W. T. Mercer, Esq. F. T. Bush, Esq.\nA. Campbell, Esq. E. Pereira, Esq.\n\nCouncillors.\n\nT. T. Meadows, Esq. A. H. Balfour, Esq.\nT. W. L. Mackean, Esq. S. J. Hallam, Esq.\nCharles St George Cleverly, Esq. A. Scott, Esq.\n\nMr C. W. Bradley, U. S. Consul at Amoy, was elected an Ordinary Member, and M. Vogel a Corresponding Member, of the Society.\n\nThe Meeting then adjourned.\n\nMAY 7TH, 1850.\n\nA. H. Balfour, Esq., Councillor, in the chair.\n\nDr J. Rowe was elected an Ordinary Member.\n\nDonations, from M. Libois,—A large cake of Chinese Vegetable Tallow.—A specimen of Rock Crystal.—Specimens of Heu-taou-tung-chung,—a caterpillar infested with a parasitical plant.\n\nThe Secretary suggested that some steps should be taken by the Society for furthering the objects of the \"Exposition of the Industry of all Nations, to be held in London in the year 1851,\" and mentioned that M. de Montigny, the French Consul at Shanghai, had kindly consented to forward any articles collected in the interior of China by the Roman Catholic Missionaries. A long discussion ensued as to the best means of carrying out Mr Shortrede's suggestions;\n\nAfter which the Meeting adjourned.\nJUNE 4TH, 1850.\n\nA. H. BALFOUR, Esq., Councillor, in the chair.\nThe Rev. E. T. R. Moncrieff, and Messrs Holderness and Odell, were elected Corresponding Members.\nDonation by Mr W. Tarrant.—A copy of his Digest and Index of the Hongkong Ordinances, for which the thanks of the Society were voted.\nThe discussion respecting the \"Exposition of Industry\" was renewed, but without any satisfactory result; after which one of the Members enquired how it was that so long a time had been allowed to elapse during the past year (1849) without any Meeting having been called, and, after hearing the Secretary's explanations, suggested that vigorous measures should at once be adopted to improve the present languishing state of the Society.\nThe Meeting then adjourned.\n\nJULY 9TH, 1850.\n\nA. H. BALFOUR, Esq., Councillor, in the chair.\nDonations, by Mr John Smith of Macao.—Two Serpents (one of them a species of Naja)—a specimen of Scolependra Morsitans.\nBy Mr Smith.—A Caterpillar of the Death's-head Moth, found in the garden in front of the Society's Rooms.\nA lengthened discussion again ensued relative to the inefficiency of the Society and especially as to the impropriety of electing non-resident Members as office-bearers, and after some time it was agreed that three-fifths at least of the combined Councillors and Vice-Presidents be residents in Hongkong.\nMr T. T. Meadows was elected a Vice-President in the place of the Hon'ble W. T. Mercer, who had just departed for England.\nMr Phillips was elected Councillor in the room of Mr Meadows.\nThe Meeting then adjourned.\n\nAUGUST 6TH, 1850.\n\nADAM SCOTT, Esq., Councillor, in the chair.\nThe Lord Bishop of Victoria was elected a Resident Member.\nMr J. C. Bowring exhibited specimens and read a paper On an Insect Parasitic on Fulgora Candelaria,* for which the thanks of the Society were voted.\nThe Meeting then adjourned.\n\n* The paper has already been published in the transactions of the Entomological Society of London.\n\nSEPTEMBER 3D, 1850.\n\nJ. PHILLIPS, Esq., Councillor, in the chair.\nDonations: From the Royal Asiatic Society,—3 vols. of the Society's Transactions for 1848 and 1849.\nFrom Mr John Smith,—A Ball of Soap, lately manufactured by him in Macao.\nDr Harland then read a translation of two extracts from a small Chinese encyclopedia entitled 通天晓 (Tung-Teen-shaou,) one of which is a method of making Magnetic Needles, and the other a process for making Vermillion. (Vide Transactions.)\nAfter some conversation on these subjects,\nThe Meeting adjourned.\nOCTOBER 8th, 1850.\n\nCHARLES ST GEORGE CLEVERLY, Esq., Councillor, in the chair.\nDonations: By C. B. Hillier, Esq.—Part of a Brick from \"The Great Wall\" of China.\nBy Mr T. Wade—A pamphlet on Japan, being a translation by him of a Chapter from the Hae-kwoh-tu-che, or Illustrated notice of Countries beyond the Sea, by Commissioner Lin.\nMr Wade read his paper on the subject mentioned in his pamphlet, and for which the thanks of the Society were voted.\nMr Phillips then brought forward for discussion the propriety of the Society establishing a Botanical Garden on the island, and after some conversation it was moved by Mr Wade and seconded by Mr W. H. Mitchell, that the General Secretary be requested to communicate with Drs Rowe, Balfour, and Hance, with a view to obtain their opinion as to the most eligible site for the proposed garden, and any other information they might be able to afford on the subject.\nThe Meeting then adjourned.\n\nDECEMBER 3d, 1850.\n\nJ. PHILLIPS, Esq., Councillor, in the chair.\nDr French of H. M. S. Serpent, and Dr Pottinger of H. M. Str. Reynard, were elected Corresponding Members.\nThe Chairman requested that the Secretary would call a Meeting of the Council at the earliest possible opportunity, to take into consideration the state of the Society, and to devise some means to ensure a better attendance of Members at the General Meetings.\nThe Secretary then read a paper by Dr H. F. Hance, Upon the Formation of a Botanical Garden in Hongkong.\nThe thanks of the Society were voted to Dr Hance, and the Meeting then adjourned.\n", "source": "olmocr", "added": "2025-09-26", "created": "2025-09-26", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/chinesecoinagea00brangoog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 191, "total-input-tokens": 290932, "total-output-tokens": 31278, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 0, 9], [0, 0, 10], [0, 0, 11], [0, 1713, 12], [1713, 2011, 13], [2011, 3330, 14], [3330, 5967, 15], [5967, 8409, 16], [8409, 9999, 17], [9999, 11144, 18], [11144, 11837, 19], [11837, 12384, 20], [12384, 12475, 21], [12475, 12575, 22], [12575, 12882, 23], [12882, 13060, 24], [13060, 13294, 25], [13294, 13454, 26], [13454, 13613, 27], [13613, 13810, 28], [13810, 14038, 29], [14038, 14215, 30], [14215, 14639, 31], [14639, 14967, 32], [14967, 14967, 33], [14967, 15134, 34], [15134, 15134, 35], [15134, 15249, 36], [15249, 15324, 37], [15324, 15411, 38], [15411, 15631, 39], [15631, 15631, 40], [15631, 15631, 41], [15631, 15754, 42], [15754, 16077, 43], [16077, 16154, 44], [16154, 16371, 45], [16371, 16853, 46], [16853, 17017, 47], [17017, 17319, 48], [17319, 17734, 49], [17734, 18011, 50], [18011, 18462, 51], [18462, 18741, 52], [18741, 19005, 53], [19005, 19491, 54], [19491, 20011, 55], [20011, 20490, 56], [20490, 21027, 57], [21027, 21283, 58], [21283, 21696, 59], [21696, 21954, 60], [21954, 22556, 61], [22556, 23028, 62], [23028, 23191, 63], [23191, 23600, 64], [23600, 23939, 65], [23939, 24350, 66], [24350, 25073, 67], [25073, 25218, 68], [25218, 25741, 69], [25741, 26153, 70], [26153, 26517, 71], [26517, 26831, 72], [26831, 27057, 73], [27057, 27422, 74], [27422, 27667, 75], [27667, 27939, 76], [27939, 28205, 77], [28205, 28320, 78], [28320, 28706, 79], [28706, 28893, 80], [28893, 29113, 81], [29113, 29220, 82], [29220, 29315, 83], [29315, 29435, 84], [29435, 29506, 85], [29506, 29681, 86], [29681, 29759, 87], [29759, 29884, 88], [29884, 30012, 89], [30012, 30106, 90], [30106, 30171, 91], [30171, 30639, 92], [30639, 30715, 93], [30715, 30789, 94], [30789, 30972, 95], [30972, 31108, 96], [31108, 31108, 97], [31108, 31711, 98], [31711, 32020, 99], [32020, 32243, 100], [32243, 32495, 101], [32495, 32670, 102], [32670, 33123, 103], [33123, 33223, 104], [33223, 33598, 105], [33598, 33760, 106], [33760, 34035, 107], [34035, 34186, 108], [34186, 34439, 109], [34439, 34631, 110], [34631, 34890, 111], [34890, 35356, 112], [35356, 35430, 113], [35430, 35496, 114], [35496, 35496, 115], [35496, 36248, 116], [36248, 36583, 117], [36583, 36751, 118], [36751, 37194, 119], [37194, 37357, 120], [37357, 37485, 121], [37485, 37578, 122], [37578, 37681, 123], [37681, 37681, 124], [37681, 37816, 125], [37816, 38019, 126], [38019, 38131, 127], [38131, 38467, 128], [38467, 38684, 129], [38684, 38889, 130], [38889, 39195, 131], [39195, 39423, 132], [39423, 39423, 133], [39423, 39974, 134], [39974, 40398, 135], [40398, 40937, 136], [40937, 41406, 137], [41406, 41884, 138], [41884, 42168, 139], [42168, 42547, 140], [42547, 43114, 141], [43114, 43114, 142], [43114, 43347, 143], [43347, 43786, 144], [43786, 43999, 145], [43999, 44584, 146], [44584, 44984, 147], [44984, 45189, 148], [45189, 45367, 149], [45367, 45638, 150], [45638, 45840, 151], [45840, 45993, 152], [45993, 46123, 153], [46123, 46358, 154], [46358, 46574, 155], [46574, 46855, 156], [46855, 47113, 157], [47113, 47396, 158], [47396, 47626, 159], [47626, 47957, 160], [47957, 48183, 161], [48183, 48404, 162], [48404, 48672, 163], [48672, 48916, 164], [48916, 49089, 165], [49089, 49265, 166], [49265, 49451, 167], [49451, 49870, 168], [49870, 50330, 169], [50330, 50741, 170], [50741, 50863, 171], [50863, 51266, 172], [51266, 51631, 173], [51631, 52225, 174], [52225, 52634, 175], [52634, 55476, 176], [55476, 56119, 177], [56119, 59135, 178], [59135, 62160, 179], [62160, 64950, 180], [64950, 67832, 181], [67832, 69855, 182], [69855, 72546, 183], [72546, 75059, 184], [75059, 76621, 185], [76621, 76621, 186], [76621, 76621, 187], [76621, 76621, 188], [76621, 76621, 189], [76621, 76621, 190], [76621, 76621, 191]], "primary_language": ["en", "None", "None", "None", "None", "None", "None", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, true, false, false, true, true, true, false, false, true, false, true, false, false, true, true, false, false, true, true, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, true, true, true, true, true, true, true, true, true, true, true, true, true, false, true, true, true, false, true, true, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, true, false, true, true, true, true, true, false, true, false, true, true, true, true, true, true, true, true, true, true, true, true, true, false, true, true, true, true, true, true, true, true, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]