[{"id": "0a0e594712c4a295000fa9a68bd227e08d0bb91b", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n鮮 朝\n\nVol. V. Part I.\n\nSupplied gratis to all Members of the Society.\n\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\nSeoul, Korea: The Korean Religious Tract Society.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\nor The Hon. Librarian, Seoul, Korea.\n\n1914.\nSOME RECENT DISCOVERIES IN KOREAN TEMPLES AND THEIR RELATIONSHIP TO EARLY EASTERN CHRISTIANITY.\n\nBY\n\nE. A. Gordon.\n\nTokyo.\n\nLadies and Gentlemen:—\n\nIt is with very great pleasure that I endeavour to comply with the request of your Recording Secretary to send you a paper embodying my findings in Buddhism during my recent visit to Korea.\n\nThese, I regret to say, are very few—but only because of the limited time at my disposal, and of the immense distances which had to be covered, involving great fatigue to one no longer young.\n\nBut, fortunately, these drawbacks will not apply to yourselves who are on the spot—in the midst of what Dr. Scranton thus happily describes in his letter to me: \"I can assure you it is a virgin field!\"\n\nAnd this is what makes research in Korea so delightful, so full of promise; for when this \"virgin field\" is explored by people with open hearts and minds, whose opinions are not warped and biased by pre-conceived theories which they have picked up elsewhere from books, or hearsay, then we may confidently look for and expect magnificent results in every direction and, especially (I am more and more convinced of this), with regard to the remarkable Evidence of Early Christianity in Korea prior to, as well as synchronous with, the Patriarch Nestorius of Constantinople, whom the Council of Ephesus condemned for heresy A.D. 431.\n\nThese evidences are strongly confirmatory of the Ancient\nFaith held by the Syriac \"Churches of the Messiah\" throughout Asia, as well as by the Greek and Latin speaking Churches, West of Antioch, perhaps more particularly in the Fourth, Fifth and Sixth centuries of our Era, universally known as \"Anno Domini.\"\n\nShould you desire, Ladies and Gentlemen, to examine the proofs by which I have reached these conclusions step by step, blazing (as it were) a track through the jungle, you will find them in my three books, viz: \"Temples of the Orient and their Message\" (Kegan Paul, London); \"Messiah, The Ancestral Hope of all Nations;\" and the one just out: \"World-healers, or the Lotus Gospel and its Bodhisattvas.\"*\n\nTherefore I shall not waste valuable time by attempting to prove my points as we proceed, but simply request you, my hearers, to be so good as to take for our present purposes the following statements as facts already proven elsewhere, and not \"theories\" in any sense of the word.\n\nMembers of the Royal Asiatic Society are aware that in the year A.D. 399,† Fa-hien, (Pöp-hien 法顯) a Buddhist pilgrim, travelled from Sianfu (西安府) to India \"in search of the Good Law,\" and that in 630, he was followed by the yet more renowned monk Hüen-tsang, (玄奘), whose name (so beloved to this day in Japan as Genzō Sanzō, the teacher of many of the great Japanese monks) Dr. Aurel Stein has found still powerful to conjure with among Chinese Officials in the heart of Central Asia.\n\nBoth these Chinese Pilgrims described a very wonderful image of Maitreya which they saw on the borders of N.W. India, in the valley of Ta-li-lo the site of the old capital of Udyana. Fa-hien (法顯) (\"Buddhist Records of the Western World,\" P. XXX. ‡), says:\n\n\"When I asked the men of that land when the Eastward\n\n* Maruzen, Tokio; Christian Literature Society, Shanghai; and Eugene L. Morice, London.\n† Travels of Fa Hien pp. 25. n. 3.\n‡ Dr. Legge; S. Péal.\npassage of the Religion of Buddha began? they all said there was an Old Tradition that from the time of the setting up of the image of Maitreya Bodhisattva and afterwards there were monks (Sramanas) from India who dispatched the Dharma-Vinaya beyond this (Tsung-Ling) river (葱嶺.)\n\n\"The setting up the image took place rather more than 300 years after the Nirvana of Buddha.*\n\n\"According to this we may say that the Extension of the Great Doctrine, i.e. Mahayana, (Japanese, Daijo 大乘, Korean, Tai Seung) began from this image.\n\n\"If then, Maitreya Mahasattva be not the Successor of Sakya, who is there who could cause the Three Treasures (Jewels) to spread everywhere, and frontier men to understand the Law?\n\n\"As we certainly know that the origin of the mysterious revolution is not men's work, so the dream of (明帝) Ming-Ti (at Lo-yang 洛陽 A.D. 61) was from this also.\"\n\nThe dream of Ming-Ti was that Fo, the Buddha of the West, had been born.\n\nThis majestic image of Maitreya was carved in sandal wood, to express the Fragrance of His Doctrine, by a disciple of the Buddha's favourite apostle Ananda (阿難)—viz: Madhi-antika (who is said to have converted Kashmir) soon after the Great Council held at Gandara near the Indus at which the canon of the Mahayana scriptures was fixed; at which also, the great split took place between the Old and New Buddhism—i.e. the Hina and Mahayana schools, or \"Methods of Salvation.\"\n\nThis Council was held about the middle of our First Century under the auspices of the Indo-Scythic King Kanishka (迦膩色迦), the Venerable Par'sva (婆栗濕縛), and his convert (馬鳴) As'vaghosa, who wrote the \"Tai-Seung Kishinron (大乘記信論), or Awakening of Faith in the Mahayana,\" which Dr. T. Richard pronounced seventeen\n\n* Gantama Buddha died in A.D. 477 according to the latest scholarship.\nyears ago to be \"Asiatic Christianity under Buddhist nomenclature.\"*\n\nAs'vaghosa died A.D. 100, the same year as St. John at Ephesus.\n\nFor many reasons the Mahayana has been called, and I venture to think correctly, \"Scythic Buddhism\"† as opposed to that born on the Ganges under Gautama (釋迦), or Prince Siddartha (悉達多), nearly 500 years before.\n\nHüen-tsang,‡ (the other Chinese monk referred to above) further describes the image of Maitreya, whom he calls \"Tséchi-pusa\" (Jap. Seishi Bōsatsu, 勢知菩薩, Korean, Sei-chipo-sal), and says that:\n\n\"From the completion of the image one branch of the stream of the Law was directed towards the East.\"\n\nIt is of importance to observe that whilst Kwannon (Kwan Um 觀音) always occupies the same place in the Buddhist Trinity, usually on the right hand of Amitabha (阿彌陀佛), the Heavenly Father, that on His left is occupied interchangeably by Tai Sei-chi (大勢至) \"the Lord of Life over Death (who put an end to transmigration and receives the Soul at death to present it without spot || to Amida), and by Maitreya, (Jap. \"Miroku,\" Korean, Miryök,) who (according to Eitel's Handbook of Chinese Buddhism,\" p. 92) is the \"Expected Messiah of Buddhists.\"\n\nIn the Faith of this coming Miryök, tens of thousands of Japanese—from Emperors to peasants—have been laid to rest in the magnificent Forest-cemetery of Koyasan (高野山), on the\n\n* It is surely significant that Yuima, a devout lay man who wrote the Yuima kyo, a commentary on the Daijo (Tai Seung) Kishinron (which is the authoritative scripture for the Zen Buddhists), is said by the Japanese to have been \"the dear and intimate friend of Sakya Muni.\"\n\nThe discrepancy of dates is instructive.\n\n† From the tradition that in King Kaniska's time S'akya reappeared on earth, this period is known as \"the Sākya Era.\"\n\n‡ See Beal's \"Life of H.T.\" p. 66.\n\n|| Cf. Jude. V.24.\nassurance of their great saint Kobo Daishi (弘法大師, Hong-Pop Tai Sa) that when he returns with Miryŏk to earth, their bodies shall return to life and be re-born in the Pure Land—the same Message of comfort with which St. Paul consoled the bereaved Christians at Thessalonica! †\n\n* Kobo Daishi gathered his disciples together, and in soothing tones earnestly said: \"At first I thought I should live till I was a century old and convert all the people; but now that you have all grown up there is no need for my life to be prolonged, so I shall enter Kongo-jyō—(the Diamond World)—and leave my physical self here to protect the Faith from injury. But you must not therefore grieve, for though my body will die, my spirit will survive and watch your conduct.\n\n\"Therefore, never suffer yourselves to be idle because of my apparent absence. After my death, I shall go to Tushita and serve Maitreya. But I shall re-visit this world in company with Maitreya Bodhisattva and bear witness to those who have believed the Faith; and in the interval my soul will daily come and watch over my disciples.\"\n\nThree months later Ō Daishi, having purified himself, awaited his decease. His disciples gathered round him and praying earnestly repeated with one voice the Name of Maitreya Bodhisattva.\n\nThe description of the last hours of the great Chinese Pilgrim Huen Tsang—some 150 years before, is very similar.\n\n† Since writing this paper Brightman's \"Liturgies Eastern and Western\" vol 1, has been more closely studied by me, and in it I find the following noteworthy passages in \"the Persian Rite, or Liturgy of the Nestorians,\" which Kobo Daishi must have heard when at Sianfu.\n\n\"The Eternal Son, the Word of the Father, put on Manhood and was revealed in the world for the renewal of all and the salvation of man;\n\n\"He perfected the Mystery of the Salvation of our lives by an hallowed death; vanquished Satan and Death, and rose again not suffering. His Resurrection made true the resurrection of the bodies of mankind.\n\n\"The Mount of Olives was their appointed place on the Thursday whereon The Way of the Highest was opened for the Ascension. He gave a blessing with His spotless hands to The Twelve (Jap. Jūni), and to all the multitude on the Day of His Ascension.\n\n\"An impalpable vehicle of Fire held Him, and the King rode therein in the stead of a chariot of horses.\n\n\"The spiritual Ones came down to comfort the troubled heart of The Twelve with voices of joy and reassurance: 'The Message to you of this Jesus, who is now gone up; thus shall He come at the end, and evening of the world.'\"\n\n\"He hath opened a Way for our race, and made Peace in the height and in the Depth, and made them rejoice in the Day of His Ascension. He had entered into the divine Holy of Holies to exercise His priesthood for our salvation, and\nTai Seishi, and Maitreya are practically two Aspects of the Same Being, in whose respective work or mission lies the chief and essential difference between the Mahayana of the First Century A.D. and the Hinayana taught by Gautama which plunged the Asiatic World into a state of hopeless despair and atheism through its negative teachings as to God, the Soul, and the future Life.\n\nGautama, however, gave utterance to a very remarkable prophecy, and we must bear in mind that he lived at the same time as several of the great Hebrew prophets who were exiles in Babylonia, with which there was then constant Caravan-communication from India.\n\nOwing to its being found in the \"Kum Kang Kieng 金剛經\" (ch : vi.) one of the most popular all the Buddhist Sutras, the prediction is called \"the Diamond Prophecy.\"\n\nThe \"Diamond Sutra\" is widely used in China, and also, the Hoke-kyo, or Lotus Gospel, (Saddharma Pundarika) 妙法蓮華經 translated by Kumārajiva 鳩摩羅什 at Sianfu, about A.D. 400.\n\nThe Prophecy runs as follows:\n\n\"Gautama said: 'Five hundred years after my death there will come Another Buddha who will found His teaching, not on that of one, two, three, or even of ten thousand Buddhas, but on the Fountain of all the Buddhas.\n\n'When that One comes, listen to Him and you shall receive inestimable blessings!\n\n'How shall we know Him when He comes?' questioned a disciple.\n\n\"Gautama replied: 'His name shall be Maitreya, which being interpreted is Love.'\"*\n\nhath sat down on the Seat of His kingdom at the right hand of the Father who sent Him.\n\n\"Lo, all the departed lay down in Thine hope that in the glorious Resurrection Thou mightest raise them up in Glory. * * * * After Thy command (O our Lord and God) these glorious, holy, Life-giving, and Divine Mysteries are placed on the Propitiatory Altar until the Coming of our Lord the second time from heaven.\"\n\n* Cf 1 Ep. John 3. 16; 4. 8: American R.V.\nNow, Ladies and Gentlemen, will you reflect for a moment upon the extreme significance of this title?\n\n\"Maitreya\" is a Sanskrit word. The Chinese translate it as \"Mile Fo,\" and the Japanese by \"Miroku\"; in Korean Miryök.\n\nBut it has the same significance as the Hebrew word \"Messiah,\" of which \"Christos,\" the \"Anointed One,\" is the Greek equivalent, and familiar to us in English as \"Christ.\"\n\nTake, for example, the words of the Samaritan woman (John 4. 25.) \"I know that Messiah cometh which is called Christ\"—\"that great Prophet that should come into the world\" (VI. 14); of St. Peter, \"Thou art the Christ, the Saviour of the world;\" and of St. John Baptist, \"Art thou He that should come, or must we look for Another?\"\n\nYou will at once perceive what a strong Common Bond of Union this fact, once grasped, gives to the Western foreigner in dealing with any of these great Far Eastern Nations.\n\nWe do not, perhaps, sufficiently realize that just as Greek was the language universally spoken throughout the Roman Empire, in Europe and North Africa, until supplanted by the Latin—so Syriac was not only the language of Commerce used all over Asia, wherever the Syriac traders went, but also the Ecclesiastical language of the Christian Church east of Antioch,—the Third great Capital of the Roman Empire.\n\nIf our Greek Testament tells us that \"Christians\" were first so called in Antioch, (Acts XI. 26) the Syriac version (as Monsignor Duchesne has pointed out) speaks of the \"People of the Messiah\"; and everywhere in the Syriac Testament \"Meskikha\" is used where the Greek gives \"Christos.\"\n\nNear Kioto in Japan there is the village of Uzumasa where there are distinct traces of the Syriac Silk trade* in the 6th and 7th centuries—(if not as early as the second, in the\n\n---\n\n* \"The ubiquitous Syrians had reached Treves in Roman times; the position of the city in the 4th Century ensured their continued presence; the first bishop of Treves was Agritius of Antioch, A.D. 328.\" (Dalton's \"Byzantine Art and Archeology—P. 91, pub. Oxford, 1911.)\nreign of Empress Jingō (神功皇后) and her Prime Minister, Nakatomi of Izumo; and in the third, connected with Prince Achi and immigrants from Korea.\n\nThe Chinese characters for Uzumasa (大秦, Tai ts'in, i.e. \"Great China,\" which was the Chinese nickname for the Roman Orient) are the same characters as those used on the Nestorian Stone for Messiah's birthplace.\n\nThe venerable temple Kōriuji* was built in A.D. 603 by Hada Kahakatsu, the Provincial Governor, in his park at Uzumasa in order to receive an image—(2 feet 8 inches high)—of Miryök, which the King of Pak' che (百濟) had sent from Han-yang to the Japanese Crown Prince, Shotoku Taishi, (聖徳太子), by the hands of a Pak' che monk.\n\nThat image is preserved at Nara as a National Treasure.\n\nThe Hada Clan are thought to have been Syriac merchants. They founded the great silk weaving and brocade industry for which Kioto is still renowned.\n\nIn the village of Uzumasa there is a deep Well like that of Sychar.† On its ancient parapet the mystic word \"Y'sarai\" can still be traced in Chinese characters, (非浚) (Chun Choon).\n\nCakes called Katono'Mochi—\"Victory over the River\"—are made at Uzumasa, marked (大) (Tai), the first character in Uzumasa (Ta-ts'in); and the stamp for them is the property of the Temple. They are eaten at midnight. ‡\n\nThe strange name is derived from the Hada ancestor who, when a babe, was washed up near Sakoshi in an earthen ware jar. There is a temple at Sakoshi called \"David's Shrine.\" All Japanese historians agree that it is over 1200 years old. Sakoshi is on the Inland Sea some miles south of Himeji. (Those who desire more information on this subject may refer to Prof. P. Y. Saeki, the lay delegate to the last Pan Anglican Conference from the Nippon Sei Kokwai).\n\n* Note that Koryuji, near Kioto, is not the same as Horyuji near Nara. Although built about the same time.\n\n† Cf. Gen. XXIV. with John IV.\n\n‡ Prof. P. Y. Saeki.\nTo you, Ladies and Gentlemen, who dwell in Korea, it must be a cause for rejoicing that the Japanese propose to open up the famous \"Diamond Mountain\" in such a way as to make it more accessible to students of the antique.\n\nI have long felt that the name \"Diamond Mountain\" (Jap. Kongōzan, Korean, Kum Kang San) must be derived from the above cited \"Diamond Prophecy\" concerning Maitreya, the Coming Messiah of Buddhists.\n\nA point worthy your investigation, is the reason why an immense Cave on that Mountain is named \"Kum kang-mun,\" (金剛門) i.e. \"the Diamond Gate\"?\n\nIt was on the Diamond Throne below the Bodhi (Wisdom) Tree that Buddha was enthroned after He had conquered Mara, the evil one.\n\nThe Temples on the Diamond Mountain must be very old for, as early as A.D. 515, some of them are said to have been restored by two monks in the reign of King Po-pheung, (法興王) Pop-Heung Wung, under whose auspices Buddhism became the State Religion of Shilla, the southern kingdom.\n\nFrom photographs shewn me, I note that in the frescoes of the Diamond Mountain temple's, the teachings of the Hoke kyo (法華経) or Lotus Gospel, are illustrated; for that classic—so dear to the hearts of the Far Eastern peoples!—has the same Key-notes as those of the Fourth Gospel, namely: Infinite Light, Immortal Life, and Immeasurable Love; and the frescoes depict that Tower which so strikingly resembles the one described in \"The Shepherd,\" (an allegory written by Hermas at Rome about A.D. 100) as \"The Church, or New Jerusalem\"; and, also, that Liturgical Tower which was a prominent feature in the rites of the Western Church—notably in the Gallican Liturgy which is said to have been derived from St. John of Ephesus—the contemporary of As'vaghosa, \"the man of Gandara\"); and Constantine the Great presented to the Lateran Basilica at Rome a golden paten on which was a Tower of purest gold surmounted by a richly jewelled Dove—all together weighing thirty pounds.\nThe name \"Diamond Temple\" was carried to Japan. In A.D. 606 Kum-kang-sa was built by the Empress Suiko's (推古天皇) wish by Tori, the grandson of Sumatah (司馬達等) (Sama Taldeung) a Chinese missionary who had introduced Buddhism into Japan from Korea half a century before.\n\nThen we find Kobo Daishi (弘法大師) giving that title to the monastery \"Kongō-bujin\" which he founded on Mount Koya (高野山) in 816, after his return from Sianfu, and at his death looking forward to entering the Kongō-jyo. i.e. Diamond World! (p. 5. n. *).\n\nBut, on the whole, Maitreya holds a more prominent position in Korea than in Japan at the present time; although I must confess that I was much struck by the remark of a very average Japanese shopman in Seoul who, when showing me a picture of the Buddhist Trinity, in which Maitreya occupied the central place (usually taken by Amida), volunteered the information:\n\n\"Shâka in India; Miryök in Chosen; Dai Butsu in Japan!\"\n\nOf course, this is perfectly true, although ordinary lay folks do not put it so clearly or concisely, but the Japanese monks make no secret that all the images, however varied their names, are but different aspects of the One Supreme Being; or, as the East Syriac Office says, \"The Godhead is Three Persons but one Essence,\" and, in the Armenian Liturgy, \"the Threefold Personality of God undivided.\"\n\nThere is a fine image of Maitreya in the Residency Garden at Seoul, and an immense one in the Museum which (Dr. Sekino told me) was brought from Kyöng-ju, the capital of Shilla.\n\nI was fortunate enough to obtain two tiny bronze images of Maitreya, excavated in Shilla, which (although so minute) shew very clearly the remarkably long right arm which you will notice in those large images.\n\nI sometimes wonder if this long outstretched Arm be not \"the Right Hand and the Holy Arm with which the Saviour-God of Israel got to Himself the Victory?\"\n\nIn a nunnery close to the late Korean Queen's tomb near Seoul you may see some interesting frescoes depicting the Ferry-\nBoat, and contrasting the torments of the lost with the joys of the saved amid the music and dancing of the Celestial Land, in a manner worthy of Dante Alighieri himself.\n\nAbove these scenes are five pictures of Maitreya with the Svastika of the Rising Sun on His breast, like Amida’s image at Temaji (達摩寺) (one of the oldest temples in Japan); and it is well to remember that the Svastika is the only cross represented in the Roman Catacomb-frescoes and found alike on the mantle of the Good Shepherd and on the robe of Diogenes the fossor!\n\nLike the Cross, it is the symbol of Immortal Life and of harmony, i.e. At-one-ment.\n\nIn Mongolia it is laid upon the breast of the dead and dying.\n\nSeveral crosses, however, are visible in this nunnery, as well as the Svastika.\n\nIn the chief Buddhist temple at Mukden there are some lovely frescoes by a celebrated modern Chinese artist. One represents the radiantly happy Maitreya seated on the waves of the sea and holding a Rosary—(His special emblem), which is peculiar to the Mahayana and not found in Hinayana.\n\nBeside this fresco is one depicting the Descent of the Tower (Saddharma Pundarika sutra c., XI.) through the Clouds to earth, with the Gifts suitable for Divine Worship, in a manner so beautiful that it would worthily represent the Vision of St. John in the 21st. chapter of the Revelation of the New Jerusalem, coming down out of Heaven from God, by Whom all tears are wiped away.\n\nDo not forget that Maitreya’s heaven is called in Sanskrit “Tushita”—i.e. Mirth, which is the old significance of the Saxon word for Gospel—“a right merry and joyful sound.” “Serve Him with mirth,” as the Psalmist said, and mirthfulness is a characteristic note in Bunyan’s “Pilgrim’s Progress,” as well as in the Roman Catacomb-frescoes. (The Japanese word for Heaven—Gōku-raku—Korean, Kuk-nak) means, “Infinite Joy”!)\nSpeaking of Mukden brings one to the interesting point of\n\nTHE ROUTE\n\nby which the Mahayana Doctrines of \"the Great Way of Salvation\" reached Korea—certainly in the Fourth Century, if not earlier—from Gandara. Dr. Aurel Stein has proved conclusively that \"all the Buddhist Art which reached China, Korea and Japan found its way from Gandara and Graeco-Baktria through Khotan\"—the most inaccessible part of Central Asia with which, however, the traffic in Jade (the speciality of that \"Jade Kingdom\") was carried on by Indian merchants from Gandara and Kashmir and, through Tung-huang, the \"Jade Gate\" of Western China, to the Imperial Court at Sianfu.*\n\nIn the Fourth Century A.D. a so called \"Buddhist\" monk went from Gandara to Yeh (the modern Chang-te-fu in North China, where he made himself invaluable as a Councillor to the King of Jao (趣王), \"Stone Tiger\" (石虎), of whose troubled reign Dr. J. Ross has told in his book \"Corea.\" This Buddho-simha, like his contemporaries \"the Monks of the West\" (see Count Montalembert's splendid History) and, in especial, St. Martin of Tours, was considered a great miracle worker. By his gentle teachings and character Buddho-simha certainly exercised a miraculous influence over the wild Hun soldiers of his time and deserved the title of \"Wonder-worker.\"\n\nPresently a young Chinese monk from Che-Kiang in S. China arrived at Yeh, whose enthusiastic nature so won the heart of the Gandara monk that he taught him the precious doctrines of the Mahayana literature, and Do-an thenceforth became an ardent translator.\n\nFilled with admiration for Buddho-simha, the youthful Do-an became ambitious of imitating him in his useful career as \"Sleeve-Adviser\" to a Monarch, and an upholder of Righteous Government, Law, and Order in those terribly lawless times. After the appalling siege of Yeh—when the citizens were forced by famine to kill and eat each other—Do-an sent two of his\n\n* (See Stein's \"Sunken-buried Khotan\"; \"Ruins of Desert Cathay\").\ndisciples into the distant West of China (Szechuan) and going himself south reached Sianfu on the Yellow River, the ancient capital of China, which, founded before B.C. 1100, was the goal of all the great Caravan routes in Asia from time immemorial.\n\nHere, Do-an (or \"Tao-an of Wei,\" as he is sometimes called) won the regard of the Emperor Fu-Kien (that very remarkable Tibetan chieftain who had succeeded in unifying and uniting the 62 contending tribes of China under his own rule)—and became a great influence for good at the Court of Sianfu. Whilst living at Yêh, Do-an had long endeavoured by means of correspondence with the renowned scholar Kumarajiva of Kuché (龜茲), one of the \"Four Garrisons\" in Tokharia, to make a worthy translation of the Saddharma Pundarika (Jap. Hokékyo) into Chinese, and on reaching Sianfu he persuaded the Emperor Fu-Kien to send for Kumarajiva to accomplish this important work. Unfortunately, such were the difficulties of the road, hostile armies, etc., etc., that Kumarajiva did not reach Sianfu till long years after both Do-an and Fu-Kien had died—but when he came he produced the finest translation that has ever been made of this wonderful Sanskrit Scripture—from which we have now an English translation pronounced by Dr. Iyan Takakusu of Tokyo, to be \"not only an accurate translation, but to have preserved the very essence of Kumarajiva's original.\" This translation (published in \"The New Testament of Higher Buddhism,\" by Dr. T. Richard), is well worth your study, as the \"Hokékyo\" (Saddharma Pundarika Sutra), and As'vaghosa's \"Tai Seung Kishinron\" (The Awakening of Faith in the Mahayana) are among the Five Sacred books to be found on the lecterns in most Korean temples, and are standard works among the Mahayana Buddhists.\n\nIn two other directions Do-an's efforts were more immediately successful. In South China one of his disciples, named E-on, founded the \"White Lotus Guild\" in A.D. 370—whose teachings of the Immortal Life and of Kwan-un (the counterpart in Her Offices of our Holy Spirit), are so remarkably \"Christian,\" and which developed into \"the Mount Tien-Tai\nSchool\" in China, and later (through Dengyo Daishi) spread into Japan, where it is called \"Tendai-shu,\" (Chun-tai-chong, 天台宗) whose headquarters are on Mount Hiyé, near Kioto.\n\nDo-an was also able to persuade the Emperor Fu-Kien—whose authority had just been acknowledged by the three distant Han Kingdoms, (viz. Shillagi, Koku-ryu, and Pak'ché) despatching \"Gifts,\" i.e. tribute, to the Court at Sianfu—to send a celebrated monk named (順道) (Jun-Do)—sig. \"to follow the Way\"—with images and sutras to Pingyang (Heijō). This was in the year A.D. 372.\n\nNow this monk must have travelled by what is called \"the Peking Road,\" leaving China by Shan-hai-kwan (山海關—\"The Gate of North China)—where the Great Wall runs into the Gulf of Pechili—round by Mukden and Liao, through the I'ung Hwang Shan Pass, across the frozen Yalu river to Wiju, and thence to the capital of Koku-ryu, at whose Gate all such important personages who came in the train of the Envoys were received by the High Dignitaries of State.\n\nJun-do, we are told, was welcomed on his arrival at Pingyang by the King, who placed the Crown Prince under his tutelage; and within three years schools were founded and two monasteries built, one of which was called I-bul-lan (伊普蘭) Ephraim.\n\nStrange as this may sound, Dr. Anesaki of Tokyo says that the Chinese characters cannot be read otherwise!\n\nThenceforward Ping-yang became the head-centre of the Mahayana Propaganda.\n\nThe Crown Prince, who succeeded his father on the throne, became an enthusiastic Mahayanist.\n\nJun-do died in 379 and six years later, A.D. 385, the King of Pak'ché sent a request to the Chinese Emperor for Teachers of \"the Good Law,\" and in response Marananda (摩羅難陀) came to Han-yang (Seoul—Keijo), and was reverently received by the King in his palace. Temples were built and convents established in which women as well as men became scholastics.\nAt this very time, viz.: the last quarter of the Fourth Century, the position held by Milan in Christendom was (according to Monsignor Duchesne, the greatest of modern Church Historians), far more important and influential than that of Rome itself, and its great bishop, St. Ambrose, was consulted by Churches so far distant from Milan as Mesopotamia and Egypt.\n\nNow St. Ambrose stated authoritatively that Muséus, the bishop of Adule (a port on the Red Sea), having evangelized in Southern India went on to China, which he traversed everywhere, and then returned by the Central Asian route to the Indus valley, and at Patala re-embarked for his Abyssinian diocese.\n\nThe results of this Black Bishop's travels and observations is apparent shortly afterwards in the consecration of a Metropolitan for China, in A.D. 411, which implies that there were at least six bishops under him—a striking proof of the flourishing condition of Christianity at that time in the Chinese Empire, that is to say, quite 200 years before Alopen and his 70 Nestorian monks were sent by the Patriarch of Ephraim to the great T'ang emperor Tai Tsung (太宗) at Sianfu, A.D. 636.\n\nAdule was a great centre of government, of faith, and of merchandise. To it came the Incense trade and spices in large quantities from Equatorial East Africa and Arabia Felix.\n\nNow about the year A.D. 422, (King Nul-ji's reign was 417-458) both the Mahayana and Incense reached Shilla, the third Han Kingdom, in S. Korea, but independently of each other and in a very interesting way.\n\nIn the reign of King Nulki (No-ki) 諏祇 a black monk named (墨胡子) Muk-ho cha (black seed, or Negro, Kokuhoshi Maihutzu, his Japanese name) came to Shilla from Pin-yang, Northern Korea—and hired himself as a plowman to a farmer in order that he might teach \"the Great Way doctrines,\" for he was said to be a messenger of Julai, Tathagata, or Nyorai 如來.\n\nThis, to my mind, proves him to be akin at least in\nspirit to the Syrian or \"Nestorian monks\" (as they were called after the Council of Ephesus A.D. 431), of whom we read that even bishops took service as camel drivers etc. or travelled about in ox wagons with the wandering Tartar tribes with the same inspiring object.*\n\nMuk-ho-cha's singular colour, from which he derived his name, was doubtless against him and his life being endangered his Korean master, Mo-rei (毛禮) hid him in a cave in Il-sun-kun (一善郡).\n\nI need hardly remind you, Ladies and Gentlemen, of the words which instinctively rose to my own lips when I beheld this very Cave:\n\n\"By faith they went about in sheepskins and goatskins, wandering in deserts, in mountains, and in caves and the holes of the earth—of whom the world was not worthy!\"\n\nAs one of my chief objects in visiting Korea this spring was to find this Cave, you can picture my delight one day when, having vainly tried at Fusan to get any light from Koreans,\n\n* And, as the stone-tablet preserved in the monastery describes Kokuhoshi when in contemplation—in his leisure hours between minding the cows and the plough—as wearing a scarlet cap 紅冠, a kesa 袈裟, and holding a \"Pultsa\" 拂子 i.e., a rod with long white hair, used to sweep away all evils, (literally a flabellum) in his hand, this makes it doubly clear that he was indeed one of that holy band.\n\nMoreover Light-rays were emitted from his body and illuminated his room and the garden outside. Heaven and Earth became bright and brilliant; ergo, Kokuhoshi belonged to \"the Luminous Religion\" described on the Nestorian Stone, A.D. 781.\n\nAlthough mid-winter, irises, tuberoses, wistaria, and a Peach tree which bore five different coloured flowers blossomed, despite the deep snow.\n\nMy readers will recall the Glastonbury Thorn which flowers at Christmas, and which is said to have been the staff planted by St. Joseph Arimathea on arriving at Avalon in Britain.\n\nNow in the great Chinese Epic, or Religious Allegory, by Ch'in Ch'ang Ch'an, viz. \"Travels to the Western Heaven in search of the Good Law\" (recently translated by Dr. T. Richard,) which exhibits strong Nestorian influences, the Peach is the beautiful fruit which makes man immortal.\n\nThe five colours are the Temple-colours, i.e. those of the Rainbow-covenant, and compose the plumage of the mysterious Phoenix-bird, in Early Christianity the indubitable emblem of the Resurrection unto Immortal Life.\nJapanese, or foreigners upon the whereabouts of \"Il-sun-kun in Shilla,\" I was once more telling the story of Muk-ho-cha and the Incense and repeating my inquiry about the Cave in Il-sun-kun to my guide, the kindly and scholarly Dr. Y. Ishimaru of Kyöng-ju—and he exclaimed \"You are now on your way to it!\" It seemed too good to be true that the Butsu Monastery to which we were going with its Cave temple (recommended to me by Prof. Starr of Chicago and Dr. Sekino of\nTokio on account of its statuary, should actually be the same as the old homestead of the farmer Mo-rei, near which was the hiding place of the Black Monk from whence he was summoned to the palace at Kyöng-ju, 10 miles away, when an Envoy from China arrived at the Court of Shilla with a gift of a strange new substance of which no one knew its name save this Muk-ho-cha, who was discovered through one of the Heralds sent through the length and breath of the land to discover its use. Being questioned, Muk-ho-cha replied that it was \"indeed a very mysterious substance which, when set alight, yielded such fragrance as was meet to offer to the holy Gods, and that no prayer offered with it remained unanswered.\"\n\nAs the King's daughter was then suffering from a disease which baffled the physicians, the monk was bidden to experiment with this opportune Gift, called Mok-il 目日. Muk-ho-cha therefore prostrated himself for seven days in prayer, offered incense, and the Princess recovered. (Note that \"Life-restoring Incense\" is mentioned on the Nestorian Stone).\n\nHe then preached \"the Three Treasures\" to the Court, namely, Buddha, His Law, and the Church, and by his advice King Nōki (Nul-ji) sent to China for artists to illustrate the Doctrines; and for 40 years these artists were engaged in making the circular crypt-chapel in the mountain-cave which looks across a sea of mountains towards Izumo Taisha beyond the Japan Sea, and in carving the superb images therein which are so distinctly of the well known \"Gandara\" i.e. Hellenistic-Indian type of the First Century of our Era.\n\nIn the centre of the Cave is the indescribably beautiful image of Shâka Nyorai gazing eastwards towards the Sunrise, like the Great Sphinx in Egypt. It is carved in two kinds of stone, has the triple ring round the neck which distinguishes the early images of Buddha, and its rosy lips give an almost startling appearance of life as, creeping through the brushwood, one suddenly and unexpectedly bursts upon it—a wondrous Vision of unearthly Peace and Beauty!\n\nAccording to Dr. F. Starr, although this image is only 11\nfeet high it is the model which suggested the colossal Dai Butsu at Nara and Kamakura. Behind the Buddha is an image of Eleven-faced Kwannon carved in relief, but it is invisible from the front.\n\nThe Cave was formerly entered from above and the Crypt reached by a staircase which, although so recently described by Dr. Starr, has now disappeared.*\n\nIts cryptic character puts it into relationship with the Underground churches and basilicas found everywhere in southern and western Europe, and even at Enriakuji on Hiyezan, chief temple of the Tendai-sect in Japan; but as this feature is specially treated in my book \"World-Healers,\" I will not enlarge upon it.\n\nThe chapel is circular, and its vaulted roof measures 20 feet across. It is lined with blocks of stone, on which are carved 15 large figures in relief, and above these is a tier of niches which hold smaller images—one specially beautiful is a sleeping figure.\n\nThe Heavenly Kings outside the Cave are magnificent examples of transcendent Spiritual Power, which tramples even demons under foot. They are, I think, best described in the words of an anthem in \"The East Syrian Daily Offices.\"\n\n\"Blessed is Messiah (Maitreya? Miryok?) who clothed His Twelve with strong armour, and they went forth to the Four Quarters and preached in the world His Doctrine.\n\n\"And they destroyed the power of the Enemy by the sword of the Spirit—the Power which descended to the contest and gave the Martyr the Victory.\"\n\nInside the crypt, to the left and right of the door-way as one enters, stand two noble figures of dignified women, the first of whom has a baptismal flagon, and the second, holding a\n\n* On reaching Seoul, I had the privilege of laying these facts and the ruined condition of this Wonderful Cave, before His Excellency the Governor General and other high officials, and of urging upon them the importance of conserving this unique World-round Treasure, and I have since had the pleasure of hearing that this glorious Cave is now being repaired, and its characteristic Art preserved at the National Expense. (August 1913.)\nflabellum, stands just behind a majestic, queenly Woman who, wearing a Crown, is presenting a Cup* to a reverent worshipper. Her circular nimbus typifies the illuminant power of the Light.\n\nA male figure offers incense.\n\nNow Incense, the Chalice, and Flabellum are all sacramental in character, and used in the Catholic Church from the earliest centuries, whilst amongst the Hebrews incense was of atoning efficacy. (Cf. Numbers 16—46=48.) The flabellum—(specially explained in some of the Eastern rites as \"used to preserve the Oblations from the little flying creatures,\" and to cool and refresh the celebrant, had its origin in the Eastern Church. It is still used at St. Peter's in the great Easter Ceremonies at Rome; and it is also a distinguishing emblem in the hands of the Red-robed Dharma, (called \"Tamo\" in China), who is represented in Szechuan with a Latin cross on his breast, and a sandal in his hand, as he emerges in a shroud from his tomb.†\n\nIn the Liturgy of the Syrian Jacobites—(who claim descent from St. James)—the Deacon and the Clerk say:\n\n\"My brethren, receive the Body of the Son,\" cries the Church; \"drink His Blood with faith and sing praise. This is the Cup which our Lord mixed on the wood of the Cross. Draw nigh, ye mortals, drink of it for pardon of offences. Hallelujah! And to Him be praise, of whom His flock drinks and wins purity;\" whilst in the Persian, i.e. Nestorian rite, the Liturgy composed by Mar Adai and Mar Mari, \"the blessed Apostles who made disciples of the East,\" the people say:—\n\n\"My brethren receive the Body of the Son,\" saith the Church; \"and drink His Cup in faith in the * * * * precious\n\n---\n\n* But this Cup (according to leading Buddhist Scholars—Japanese—to whom I showed the photograph) is unknown in Buddhism.\n\nIts connection with the Kingdom of Messiah is evident from Mark 14.23 25; 1 Corinthians. 11: 25, 25.\n\n† There is no Resurrection in Hinayana.\nBlood for the pardon of offences, the spiritual feast for Everlasting Life.\"\n\nThe figure symbolizing the Christian Church wears the Crown, and holds in one hand the Chalice the pledge of communion with her Lord.\"*\n\nAnd in the second century epitaph composed by the Phrygian bishop, Avercius, he speaks of the people he had met at Rome \"with the gleaming Seal\" (i.e. Baptism). \"I saw also the plains of Syria and all cities, Nisibis beyond the Euphrates. Everywhere I found fellow believers. Everywhere was Faith my guide, and gave me everywhere the Ichthus (Fish) from the Spring, the Great, the Pure, which the spotless Virgin caught and ever puts before the friends to eat. She has also delicious wine, and She offers wine mixed with water together with Bread.\"\n\nBoth the feminine figures at the entrance to the Cave have Boat-shaped halos, and it is as well to remind ourselves that as the Early Christian symbol was \"a Ship—Heaven bound—flying before the wind,\" and that the \"Apostolic Constitutions\" advised that the Churches be built as a Temple-ship, the Ship of Souls, so the Mahayana is \"the great Chariot of Salvation\"—\"the school of the Great Boat.\" Each of these figures has also a distinct Cross † on the fore-front of her helmet, (a Mitre?)\n\nLadies and Gentlemen: permit me to say that I believe—in common with others to whom I have submitted the photographs—that the most remarkable evidence of all, concerning the existence and influence of Early Christianity in Korea, is afforded by the discovery of these Sacramental Objects which are undeniably Christian.\n\n* \"The Church is represented as a woman, 'the Spouse of Christ,' even in the earliest ages. Behind her is often a figure of the Jewish Church. Hulme's \"Symbolism in Xtn Art,\" p. 123.\n\nIn the Shepherd of Hermas,\" an allegory written at Rome cir. A.D. 100, the figure of an Aged Woman symbolizes alternately \"the Church, or New Jerusalem\" and \"the Holy Spirit.\"\n\n† Of the same form as that found on the cover of the Book of the Gospels in the Eastern Church.\nFor example, the glorious Figure of the Woman with the Cup may be allied with the tradition of the Holy Grail—Buddha's Bowl—with which the Yuetchi king, Kanishka of Mahayana celebrity, is connected,—as well as with St. Joseph of Arimathea at Glastonbury.\n\nNo such figures are found—so far—in Japanese Art; the flabellum is, however, a speciality of the Zen sect and was imported from China.*\n\nFar be it from me to dogmatize on a subject which as yet has been so little explored, but I would beg you to examine for yourselves such a simple handbook of Monuments of the Early Church as Mr. Walter Lowrie's *Christian Art and Archeology* (pub. Macmillan, 1906) which explains so clearly about the Byzantine Churches, from the Fourth Century onwards to the time of the Crusades, and their influence upon the West, and I think you will then allow that the following facts gleaned from his pages are well worth a thoughtful consideration and comparison with the Cave at Il-sun-kun in Shilla.\n\n\"The same symbolism was current throughout the Church. The great Basilicas which Constantine and other later Emperors built, were in thorough keeping with the Early Traditions, and they were repeated everywhere throughout the Christian world.\n\n\"The Churches of the Holy Sepulchre ('Resurrection' Anastasis) at Jerusalem and of the 'Ascension' on the Mount of Olives, were round structures, with the roof partly, or wholly, open to the sky, of the central room.\"\n\n(Please look at the picture of the Shilla cave, (p. 17) and also call to mind that the holiest part in the Anastasis at Jerusalem was the Cave, and the opened roof was one of the most significant characteristics in both churches).\n\nAgain, \"the Basilica attached to the Anastasis had its entrance towards the East, as also the Lateran at Rome and the basilica at Antioch built by Constantine, and the great basilica\n\n*See my World Healers, vol. 1, pp. 85, 86 etc.; also Dr. Legge's Travels of Fa-Hien p. 34 and note 2.\nat Tyre which had its entrance door specially constructed to admit the rays of the Rising Sun.\"\n\nSt. Athanasius, the Primate of Egypt, who was the correspondent of St. Ambrose at Milan and St. Basil the Great of Cesarea) regarded it as \"an Apostolic ordinance that the Churches must face the East.\"\n\nMarvellous is the Archway supported by two pillars at the entrance to the Cave of Il-sun-kun, and he who is favoured to watch the Sun rising above the far off mountains of Japan from that spot is indeed to be envied!\n\nDr. Starr in his enthusiasm slept two nights in that Cave, but this would be impossible for most people, and it is worth enquiring whether accommodation could be had at the old monastery (Pul-kuk-sa*) (佛國寺) 3,000 feet below, which was first built in A.D. 528 by the Shiragi king Hō Kōō, 1358 years ago, as the 10 mile kuruma ride to and fro the excellent Japanese inn at Kyōng-ju leaves far too little time on the mountain top, and the long two miles' climb up and down in one day (in addition) is pretty fatiguing even in a palanquin, which the bearers are inclined to drop half way leaving one to walk the rest!\n\nEre leaving the Cave of Il-sun-kun one must note the arrangement of images in tiers, the upper one being cut in niches, as it is the self same as that that in the Lama temple at Mukden, and in the apse of the basilica of Sta. Sofia \"the Holy Wisdom,\" at Constantinople (founded by Constantine and re-built by Justinian, but now a Muslim Mosque); and we must not forget that Abbé Huc and other Catholic Fathers found that the Lamaism of Tibet contained \"all the germs of the Catholic Faith—only needing development.\"\n\nAs an instance proving this, I may be pardoned for mentioning an immensely interesting discovery which I made in the Lama temple at Mukden, because I am convinced that it is the missing link between Mahayana Buddhism and Syriac Christianity.\n\n* Bukkokuji (佛國寺) in Japanese, see p. 26 n.*\nOver each of the Three Figures of the Buddhist Trinity—described by the monks in charge to me as \"Fo, Kwan-um and Miryök\"—are the outstretched Wings of the Divine Presence, and on a table below them is the Tower, and a baptismal flagon, viz. a tea-pot containing the holy water, \"Amrita,\" and a Peacock's feather wherewith to sprinkle the worshippers.*\n\nThe wings of the Divine Sun are, as you are aware, a well known emblem in the old heathen temples of Assyria. They were adopted by the Syrian Christians of St. Thomas, who adapted them to the Higher Development of the old-world Faith, as may be seen to-day on the façades of their \"Churches of the Messiah\" in Southern India. (Cf. Malachi IV.).\n\nI think that we cannot over-estimate the importance of this discovery, and that further enquiries should be made by those of us who have friends in North China and Mongolia as to the Lama temples in their neighborhood.\n\nIn researches like these no symbol is too insignificant to note, even though it stands alone, and, for the moment, we ourselves may not quite grasp its import.\n\nBut there is now such a vast mass of Evidence that it is quite easy to relegate each discovery to its right place. Naturally dates and localities are most important to procure, wherever possible.\n\nReturning once more to Pul-kuk-sa (佛國寺) in Shilla, it seems to have been one of the nine monastic-universities founded in A.D. 528 after the conversion of King Pop-heung, (法興王 Hō-kō-ō) and all his subjects three years earlier.\n\nThere are some very interesting Pagodas here; and in the Worship Hall there is a large white image of Him whom the Japanese Shingon monks worship as \"Kongō Dainichi,\" i.e. the Great Sun Buddha of the Diamond World of Reality. Diamond being indestructible in quality, invulnerable, and its colour purest white, it is the symbol of Light, and in Christian art white is the colour used for the Robes of our Lord both at\n\n* For details see \"World-Healers,\" Vol. I., pp. 27, 147, 163.\nHis Transfiguration (according to the Gospels) and after His Resurrection. (Cf. also Rev. 7. 13-15.)\n\nKongō Dainichi is recognisable by the sign \"Fudo's sword\" which He makes with His fore-finger, very much like that of the Cross, and with the same object, viz. to dispel evil influences by the Sign of Life.\n\nOn the High Altar stands the Buddhist Trinity and on each side a white figure which represents respectively Kasyapa (who is said to have been originally a disciple of Gautama Buddha cir. B.C. 500, but re-born as a Brahman in Central India, in the First Century A.D.) and Anan, the cousin and youngest disciple of Shaka, who wrote the Sutras with his own blood from memory.\n\nHaving been so close a companion of the Buddha \"he heard much and loved much,\" and so was specially qualified for this labour of love.\n\nBoth these monks played an important part in the first Mahayanist Council. Kasyapa is styled \"the President of the Assembly.\" In response to the invitation sent by the Envoys from the Court of Lo-yang, in consequence of the Emperor Ming-ti's dream A.D. 61., they took the Mahayana doctrines and Images to China.\n\nThese two figures of Ananda and Kasyapa were found frequently by Dr. Edkins in Chinese temples beside the Buddha. In Japan they are mostly found in the Zen Temples, which sect is one of those most in harmony with Early Christianity.\n\nFew things impressed me more than the attitude of Anan as he stands near his Master with reverently folded hands and a look of inexpressible love and adoration on his face.* His immensely long sleeves resemble those of the earliest Christian chasubles.\n\nIn a side-chapel the Holy Trinity and the Sixteen Rakan (Apostles), grouped 8 on either side, are impressively white,\n\n* At the Zen temple of Nansenji, Kioto, I observed this same figure whose robe is adorned with Phoenixes, White Herons, and a border of the Greek Key pattern.\n(like the so-called \"White Buddha\" off the Peking Pass near Seoul, but which, according to the Chinese inscription above, is really Kwannon-sama.)\n\nOver the entrance door inside the main hall I noted White Herons, the emblem of the Immortal Life which is so familiar in the early Yamato temples in Japan—i.e. A.D. 600—and which (found also in the Roman Catacombs and in the Christian Cemetery at Antinoe in Egypt)—was the name given to the first Christian monastery in Scotland, by St. Ninian, the Apostle to the Picts, about A.D. 397.\n\nSome 20 years after Mukhoja (墨胡子) Kokuhoshi's arrival, the Korean farmer Mo-rei (毛禮) welcomed another monk named A-do (阿道) (Jap. Ō tao). Note the recurrence of the word \"Way\" in so many of these monks' names), with three disciples into his house.\n\nIn A.D. 525 Shilla accepted Buddhism. The King's name, Fo-sêng, (法興王 r) Popheung) is said to mean \"the Kingdom of Fo-rouser,\" owing to his great interest in the Mahayana.\n\nNow Gandara was known to the later Mongols as \"the Kingdom of Fo\"—the Chinese name for Buddha which signifies \"NOT MAN,\" (Pūl (佛) in Korean, and \"Butsu\" in Japanese.)\n\nBut there is still another link with Gandara which merits your earnest researches in the old Korean histories.\n\nDr. Beazley (Dawn of Modern Geography, Vol. I. pp. 494, 499) mentions a curious tradition of five devoted Buddhist monks who in A.D. 459, came from \"Ki-pin\" (罽賓) (i.e., Kapisa, Kabul, Gandara—the modern \"Afghanistan\") down the river Indus and by sea to \"The Land of the Fusang\" (扶桑) or Paper-mulberry tree, and dispersed the Holy Images and taught the Faith throughout the land.\n\n* A.D. 528 Bukkokuji, and other monasteries were founded, and Buddhism of the Mahayana type became the state religion of Shiragi—most probably due to the strong missionary influence of the Emperor Wu-ti (Liang dynasty), who was then ruling at Nanking.\nFrom Fusan, I visited what a Japanese who is deeply interested in old Temples had long since told me was \"the ancient, largest and most worth visiting in all Korea,\"—Tsu-do-ji or Tong-do-sa. If I remember correctly, this monastery once contained 21 smaller temples, and had nine towers and four gates. It is the annual goal of tens of thousands of Pilgrims to this day.\n\nFor situation it is remarkably beautiful—nestling in a forest, at the foot of a lofty mountain, beside a river whose loveliness reminds one of the \"River of 50 Bells coming down from the Sky in the quiet secluded pleasant land of Ise,\" whence that \"Divine Wind\" blew which destroyed alike the Tartar Armada of Kublā Khan and the mighty Russian fleet off Tsushima in recent years.\n\nThrough a beautiful avenue of trees—running for some two miles beside this River—one reaches the Tai Mun, which impresses one by the richness and bizarre character of its Korean colouring (if one may so say) of barbaric splendour compared with that of Japan.\n\nThe first thing to note was the number of Cross-forms on this great Gateway which like the Rood-Screen in Christendom symbolizes the Gate of Death through which the Heavenly Life is reached—\"Mors janua vitae.\"\n\nPassing through the Tai Mun one is amazed by an immense fresco of the Ship of Souls which covers the outside wall of the first building on the right.\n\nYou will doubtless remember, Ladies and Gentlemen, that on the Nestorian Stone erected A.D. 781 by the Syriac Missionaries at Sianfu—which gives a synopsis of the Old and New Testament teachings,—the Great God Aloha is said to have \"divided His body\" (fên-shen, 分身) is a Buddhist term) and sent Meshikha (Maitreya, Miroku, Miryōk), to be born of a Pure Virgin in Ta-tsin (大秦); who, when He had finished His work upon earth and destroyed the dwellings of Darkness (\"Naraka,\" also a Buddhist expression for Hades, or \"the Prison house\"), launched the Ship of Great Mercy by which all\nmen might ascend to the Bright Palace of many mansions. This idea of a Temple-Ship, or \"Ship of Souls, was carried out in the Early Church buildings by instructions clearly set out in the \"Apostolic Constitutions\"; and in the Syriac Offices we find—\"Mine eyes have seen nought like the Ship—which bare prophets and guided Apostles, which bare martyrs and confessors and went to Eden.\"\n\nNow in the Mahayana, this Ship—bound for the Sinless Land (極楽) (Jap. \"Gōkuraku) is shewn in Chinese, Japanese and doubtless, also, in Korean pictures with Amida as its Captain, and Kwanon as the Pilot—a feminine figure, as the Syriac Gospel according to St. John describes the Holy Spirit—in Our Lord's own words; \"When she, the Spirit of Truth is come She will guide you into all Truth.\" (As you know, in the Greek version the masculine gender is used.)\n\nIn the Worship Hall of Tsudoji, or Tong-to-san, is a unique object (at least, not known in Japanese temples and therefore may prove a fruitful object for research in Korea) namely, an Empty Chair on the top of the High Altar, on which (so the Abbot told us) when Buddha descends at service-time He sits.\n\nThere is no difficulty in associating this idea with the belief of the Catholic Church; and in the temple grounds outside there is a large White Buddha about which nothing is known save that one morning, long long ago, it rose out of the ground where it now stands.\n\n(Similar traditions should be hunted up elsewhere in Korea and collected together for comparison with the WHITE CHRIST, worshipped by the Huns who over-ran Europe.)\n\nBeing the Festival of Buddha's Death we were fortunate to see a most interesting and worshipful ceremony in this remote temple. About seven or eight monks, after tying white paper bandages over their mouths, (as in old Israel the Lepers were made to cover their lips and cry \"Unclean! Unclean*!\" and as in Japan the servants of Mikado do when waiting upon His Majesty, and the Shinto\n\n* Cf. Lev. XIII 45 and Isaiah VI 5.\nPriests also when making the Daily Offerings) pass the innumerable dishes of every kind of offering—fruit, cakes, vegetables—with the deepest reverence from hand to hand the length of the Great Worship Hall until they finally reach the Abbot himself who most humbly and devoutly offers them, one by one, to the Invisible Being enthroned on the Chair,* whilst Incense is also burnt.\n\nI never was at a more reverential service—the Hall was crowded with Monks and Pilgrim Nuns who all seemed a very kindly friendly people.\n\nAfter the Mass, mats were spread in a large court-yard, and the low tables brought at which the congregation sat down and feasted on the offerings—in the old Levitical style—in solemn silence.\n\nThere is a seminary at Tong-do-sa, and the young monks were a pleasing bright looking set of boys. A Japanese teacher as well as a Christian Korean is employed, both intelligent men.\n\nThe Abbot was exceedingly kind and hospitable—in striking contrast to the conduct of the kuruma runners, who made the long journey a penitence by their constant wrangling, and refusal to stir—every few miles—unless the fare agreed on was increased more and more, and finally one absconded with the baggage pony, so but for the Abbot, who came to the rescue and lent his own horse, we should have been in poor plight indeed for the return—a long day's journey—for the Korean inns en route were impossible to enter.\n\nUnder the late Dynasty Buddhism was all but crushed out of existence in Korea, and the monks degraded below the butcher class in rank. It is, therefore, not fair to judge by the present debased condition of the remnant—some 10,000 monks—of the original Mahayana Faith which, when at the zenith of its enthusiasm and purity, raised \"the Three Han\" Kingdoms to such a marvellous height of Education, Art, and Civilisation that\n\n* See picture of \"the Chair of Moses\" in the synagogue at Kaifengfu on the Yellow River, p. 9. \"Chinese Jews,\" by Marcus N. Adler. 1900.\ntheir influence extended into Manchuria, and, crossing \"the Eastern Sea,\" reached Japan.\n\nAs the Emerald Isle in the Far West was regarded by all Christendom as the chief centre of Knowledge and Piety—from the fifth to the eighth century, so Count Montalembert's description of Ireland, under the beneficent rule of the great Monastic Orders may be applied to the conditions dominant in Chosen, the Land of Morning Calm, during an even earlier period:\n\n\"From the moment that this Green Erin, situated at the extremity of the known world, saw the Sun of Faith rise upon her, she vowed herself to it with an ardent and tender devotion which became the very life of this Missionary Nation;\"—for we find the Korean Kings imbued with the like enthusiasm and recommending the Doctrines of \"the Wonderful Law\" (i.e. Mahayana) to the Sovereigns of the neighbouring countries in the Extreme East.*\n\nIt is far from impossible that the zeal with which the natives have embraced Christianity since Korea was opened to the world in modern days is not a proof of some latent spiritual life in which the germs of the Ancient Faith survive (although for centuries dormant), and are therefore responsive to a quickening touch.\n\nFor example: three hundred and fifty years or more ago, when St. Francis Xavier visited Yamaguchi, (near Shimonoseki) in Japan, he announced that he had come \"to give a fresh Interpretation to the Law of Buddha, and to develop it.\" The Daimyo of Nagato gave him a large disused Buddhist Monastery whose Pagoda in the title-deed (still extant) bears the significant name of Dai-do-ji, i.e. \"Great Way Temple.\"\n\nIn a few months 500 Japanese were converted, whose numbers increased ere long to 6000, and these were soon after dispersed (through the great fire which wiped out Yamaguchi) to other parts of Japan.\n\n* In A.D. 552. The King of Pak'chë sent the images of the Holy Three to the Japanese Mikado in a Mikoshi, which resembles the Hebrew Ark of the Covenant. It is preserved at Zenkōji, in the Temple of Nyorai.\nYou will surely have noted, Ladies and Gentlemen, how this word \"Way\" pervades the Mahayana history, just as in the Acts of the Apostles we read of the first Christians—\"Messiah's people\"—as \"the men and women of The Way.\"\n\nIn primitive \"Hina\" Buddhism there were no temples, but the new expansive life in the Mahayana found its expression amongst the Indo-Scythians in magnificent pagodas, temples, images, and frescoes like those existing today, albeit in ruined condition, in Korea and Japan. Similarly in Europe the spiritual life and love of the converts to Christianity found their expression in glorious Abbeys and matchless Cathedrals.\n\nIn Korea some 2,000 Buddhist monasteries survive, of which about 30 are officially recognized as head temples; e.g., Myo-yang on Diamond Mountain and Chon-teung (傳燈) on an island near Chenulpo.\n\nIt is much to be hoped that under the protection of the present enlightened rule, the religious life in these monasteries will be developed, and the efforts of H.E. the Governor General to preserve the original types of the ancient Sutras and commentaries lying in the temples of Korea, (many of which are non-existent in Japan) be crowned with success, ably seconded, as those efforts are, by Dr. Watanabe, the Buddhist expert in the Home Department at Seoul.\n\nScholars say that the conclusive Link between Early Christianity and the Mahayana, will eventually be found in Nepaul whence so many of the Sutras have recently gone for translation to Oxford, (which will soon possess the richest collection of Sanskrit literature in the world), and in Siam.\n\nEre closing, may I briefly describe to you, Ladies and Gentlemen, two Mandaras (pictorial allegories) whose gorgeous colouring proclaims them at once to be akin to the Korean?\n\nThe first was brought to my notice by a foreigner who (whilst confessing his total ignorance of Buddhism) drew my attention to this picture because of \"the strongly marked Hebrew cast of countenance of the principal figure, whom a Korean had insisted was 'a Mountain God.'\"\nTo those acquainted with Dharma's pictures in Japan this resembles Dharma—or (as he is called in China) Tamō, who, I venture to think, is no other than Saint Thomas, \"the Apostle of the Hindus and Chinese,\" according to the Malabar Breviary.\n\nDharma clad in a crimson Kēsa, (袈裟) on which are Dragons, a blue bordered vestment embroidered with the Lotus,* and an emerald green robe embroidered with White Herons (green being the ritual colour denoting the Spring-time or Resurrection, and crimson that of suffering i.e. Martyrdom), is seated on a Lion—not the curious mythical creature known as \"Chinese or Korean lion\" (which is actually a Tiger), but the veritable Lion of the tribe of Judah.†\n\nBeside Dharma is a Vine, richly loaded with purple grapes,—the indisputable Christian symbol of Christ and His Church, called in the East Syriac Offices \"the Vineyard of the Gospel\"; and in the Liturgy of the Coptic Jacobites: \"This Vine which Thou hast planted.\"\n\nOn his other side is a Rose which is repeated at the foot of the picture together with a Plum, the Far Eastern type of indomitable Courage which defies the storms and snows of Adversity. Both Rose and Vine are also the respective symbols of the tribe of Judah, and of the Hebrew Nation—as the Psalmist says: \"Thou hast brought a Vine out of Egypt,\" and the Prophet:—\"I looked for grapes and it brought forth wild grapes.\"\n\nAbove the Sage's head is a Matsue Pine, a Japanese symbol of the Eternal Life, and on its branches clusters of\n\n---\n\n* The Ritual colours of Mahāyāna are the same as those used in the Christian Church which were derived from the Ritual of Israel in Tabernacle and Temple.\n\nAs is well known, St. John wore the High Priestly mitre with the plate inscribed \"Holiness unto the Lord\" when officiating at Ephesus.\n\nSt. Thomas, like St. John, is said to have ruled over Seven Churches which he founded in \"India.\"\n\nTaking all these facts into consideration, I venture to think we have strong grounds for thus identifying St. Thomas in his priestly robes. Cf. Ex. 28:31; 39:1,21.\n\n† Concerning Shiloh and this Lion, cf. Jacob's prophecy, Gen. 49:9-10, Rev. 5:5.\nmistletoe, (a common feature in Japan on the Pine tree, but I never saw elsewhere such masses of mistletoe as at the Ming Tombs at Mukden).\n\nLike the Hermits of old, Dharma’s nails are “like the claws of birds,” i.e. typical Chinese nails, shewing that he must have adapted himself to the customs of the Nations through which he passed when, as the Malabar Liturgy says: “By St. Thomas the Kingdom of Heaven took wings and extended itself to China.”\n\nBut the most notable point in this picture is the Priceless Pearl—(Jap. tama) which Dharma holds in his hands whilst evidently explaining its mysteries; for the beautiful “Hymn of the Pearl” (which lay hid in the tail of a Dragon who must be “Charnied by the sound of the Triple Name”) is a Second Century hymn, said to be “sung by Judas Thomas when he was in prison in the country of the Indies” i.e. when imprisoned by Gondoforus, the brother and predecessor of King Kanishka, whom he converted later.\n\n(For details of the Legend of St. Thomas which comes from Edessa, the head centre of the Syriac Church, 200 miles East of Antioch, I must refer you, my hearers, to my book “World-Healers” in which Prof. F. C. Burkitt has kindly allowed this Hymn, sometimes called the “Hymn of the Soul,” or the “Hymn of the Robe of Glory,” to appear.)\n\nBelow Dharma is a much smaller figure of the same Hebraic type, who is evidently a Disciple interpreting his Master’s discourse. On his forehead is the curious Jewish frontlet thread, and on his robe two large Dragons are embroidered, and two forms of Cross, one Latin, and the other that illustrated in the Greek Church on the Book of the Gospels, whilst he is making the hand-sign called “Fudo’s Sword” which resembles that of the Cross with which Christians, so early as A.D. 110, were bidden to sign their persons at all times.*\n\nNow in the “Early Syrian Daily Offices” a layman when\n\n* See “World Healers” p. 396, note 1. These hand signs are also peculiar to the Mahāyāna Buddhism, and attributed to As’vaghosa.\nhe kisses the Cross is directed to say this prayer: \"May the Power which is hidden in the Cross make me to gain power and courage for the war with the Demon, the Enemy, by the mercies of our good God.\"\n\nFudo's sword, also, drives away demons. This is an especially interesting question to be solved, because \"Fudo's sword\" is one of the secret signs used in the Shingon sect, brought by its founder, Kobo Daishi, to Japan from Sianfu A.D. 806, where (from many evidences) he must have been in contact with the Nestorian—i.e. Syriac—Missionaries who were then in high favour at the Chinese Court.\n\nBut as Kobo Daishi was never in Korea, (nor so far as we know his Shingon-shu) this sign found (as I pointed out to you elsewhere, p. 24), at Pūl-kuk (佛國寺) monastery near Kyōng-ju, is probably another indirect proof of Early Christian teachings in Korea.\n\nOn the top of the Nestorian Stone at Sianfu there are two Dragons carved on either side of a Tama-Pearl, and below them is the equal-armed floriated Cross found on St. Thomas's tomb at Meliapor in Southern India. Now here is an important fact which you may verify for yourselves in the Seoul Museum, where the Director was so good as to shew me a copy of a fresco found in one of the dolmans between Ping-yang and Chinnampo, which lack of time alone had prevented my visiting, as urged to do by Dr. Sekino of Tokio and His Excellency the Governor of Ping-yang.\n\nDr. Sekino told me that, this fresco is 1,400 years old, but the device is identical with that which crowns the Nestorian Stone, in A.D. 781 (see Rev. 12. 9), viz: the two Dragons (Sanskrit, Kombhira) and the Pearl; and it may also be seen by yourselves at Kyōngju on the Tomb of King Muryol.\n\nIn the East Syrian Offices, again, one reads such passages as the following:\n\n\"O illustrious martyr, Mar Sergis! A Pearl without flaw, a light hath shone in thy soul. Thou hast bought it with\nthy blood, and become rich thereby. And thou hast gained wealth which is not destroyed.\n\n\"The blessed company of Athletes, the famous Martyrs—how they despised and scorned this world and its desires in the glorious Brightness of the Pearl which is at the head of the Cross!\n\n\"With piercing eye they looked and saw it, and desired to seize it.\n\n\"The Athletes saw a Pearl without flaw on the top of Golgotha, and desiring earnestly to attain to it, bought it with their own blood and they endured sufferings and dire tortures for it. And lo, the reward of their labours is laid up for them. Joy without end!\n\n\"O Martyrs ye were merchants, and lo, your storehouse is in heaven. Ye have bought the Pearl with the blood that your necks poured forth.\n\n\"On Friday the Jews crucified Our Lord on the top of Golgotha—and on Friday the Slayer slew Death, and raised up our Nature.\"\n\nDo you not now see clearly, Ladies and Gentlemen, the reason why all those beautiful symbols of Immortality are depicted on that Korean Mandara to illustrate the wonderful Teachings of the Priceless Pearl which Dharma is explaining?\n\n\"What shall it profit a man though he gain the whole world and lose his own soul?\"\n\n* Since these lines were written, the Kambojan picture has been carefully examined by Chinese and Japanese experts in consequence of another picture (evidently by the same artist, or by one of his school) that has come from a temple near Hankow.\n\nIt represents the same HEBREW-faced One in the midst of His disciples blessing young children, in especial Yuima 維摩羅鶏 (who is said to have visited China, and who, in later life, wrote Yuima-kyō (Sanskrit, Vimala Kirrti Sutra), which tells of the Kingdom of God being within a man's own Soul. Kumarajiva translated this sutra, also, in A.D. 400 at Sianfu).\n\nNow as this One is known to be Shāka, these experts pronounce him whom I took to be Dharma (and who is actually pictured in the mural paintings at Mukden p. 11, red-robed, and in a Cave), to be actually no other than SHAKA NYORAI Himself!\n\nThis opens up such amazing possibilities—always on the same lines—that I am constrained to call attention to it!\nMy second Korean Mandara is inexplicable on any other lines than those of our new School of Ryobu Yaso.\n\nThe wealth of colouring is unlike any found in Japan. Its age is said to be 250 years, but to my mind must be a copy of frescoes infinitely older. Ten years ago it was found in a temple at Fusan where it had been for 100 years, before coming into the possession of a Japanese gentleman by whom it was sent to a friend in Tokio. The Temple records say that it had been received from Nanking in China. A votive inscription at its foot in curious script is in the Kambojan characters.\n\nIt represents a Fish-temple, for its four roofs are most curiously tiled in imitation of fishes' scales, and their corners turned up with Dolphins like those at Hōryuji in Japan built by \"the Japanese Constantine,\" the Crown Prince Umayada, in A.D. 604,—and at the \"Fish-temple\" (also built by him) on the road to Arima, which is one of the thirty three Holy Places dedicated to Kwannon sama. (It is very near Takaratsuku, the spring of the famous \"Tansan Water,\" and well worth visiting.)\n\nIt is hardly necessary to remind you of the Early Christian cryptic symbols of the Heavenly Ichthus and \"the little fishes born in baptismal waters.\"\n\nTowering high above the roof is a lofty Tee-spire of distinctly Siamese type, and it is well to recall that for centuries the Mahayana flourished in Siam until eclipsed by the old Hina doctrine, and many of the symbols used in the Lama temples in Tibet still survive there.\n\nIn Buddhism these tees represent the Soul's ascent to God through countless heavens, or spheres. This idea, found in the Pyramid texts of Egypt, occurs in Jacob's Dream of the Ladder, and was familiar to St. Paul and to Origen of Alexandria. In the East Syrian Offices these words occur: \"He fixed a Ladder of Life in His Church,\" and \"the Watchers\" i.e. the Angels, are often mentioned.\n\nNow in this Kambōjan-Fusan Mandara—or pictorial Allegory—one sees several Angels flying in the blue sky\nabove the Fish-temple, all hold White Lotus buds—the special emblem of Kwan-um, and of the New Birth of the Soul)—and one is eagerly pulling his fellow angel towards the roof of the building to see some unwonted sight. One is irresistibly reminded of such words as:—\"Which things the Angels * desire to look into\" (1 Peter 1-12); or \"the Mystery, which from the beginning of the world hath been hid in God, who created all things by Jesus Christ: to the intent that now unto the Principalities and Powers in the heavenly places might be made known through the Church the manifold Wisdom of God, according to His Eternal purpose.\"†\n\nSeveral of these Angelic Beings have succeeded in passing though the roof and are seen hovering like flamelets over the Congregation in the Sanctuary below. It was an early Christian belief based, doubtless, on the vision of Isaiah that at service time God enters the Temple accompanied by a train of Angels; see for example, the prayer in the Armenian Rite:—“Cause that along with our entrance there be an entrance of Holy Angels ministering with us.”\n\nThis White Temple is unmistakably a Basilica built, like those of Constantine the Great, with a central Nave between two side aisles, and the roof supported by colonnades of pillars—in this case white and in number eight, the Symbol of Regeneration, or the New Birth.\n\nAt the threshold is a distinctly Triangular border with a design of ch × crosses and circles.\n\nOutside one observes a wall in which are white porticos of a distinctly Greek or Syriac type of architecture. On their pointed gables are clearly marked Triangles—the Emblem of the Trinity, (in the Shingon teaching, of Victory over Death according to the “Dainichi-kyo” which dates from the Second Century A.D.) and Circles, the Emblem of Eternity. (Cf. the counterpart in Hulme’s Xin Symbolism. fig. 83).\n\n* This angelic curiosity is often seen in Western Medioeval Art, such as the pictures of the Annunciation of the Miraculous Birth.\n\n† Ephesians III. 9—11. R, V.\nThe doors in these porticos stand wide open, and one notes two men conferring as to whether or no they may, or shall, enter by them? \"By the striking elegance of the Door-way, the pious builder hoped to attract the adherents of the Old Religions, and induce them to enter the church.\"\n\nWithin, the Basilica is brilliantly illuminated with resplendent chandeliers (such as Emperor Constantine presented to the Lateran Basilica at Rome,) and numerous wall-lamps. In the side aisles, hidden by the pillars, on which the Dolphin, symbol of Protection, again appears) are the two men who were hesitating outside, now listening reverently on their knees, to Him who is explaining \"The Way.\"*\n\nIn the central Nave in the midst of the Congregation the White Buddha (who seems to me to be no other than the Buddha of the Western Heaven of whom the Chinese Emperor Ming-ti dreamed) sits—enthroned on a White Lotus, whose circle denotes Heaven, and the brown square on which it is posed, Earth—like the Altar of Heaven at Peking; and like the Good Physician, Yakushi Nyorai, at Nara, (carved in A.D. 718 by Gyogi Bosatsu, probably under Nestorian influence), whose Throne is unique in having a border scroll of Grape vine, supposed by Buddhist connoisseurs to have been derived from Baktria.\n\nIt was a Shingon Abbot, renowned for his scholarship, who first pointed out to me this symbolism on the Iona crosses—viz: the square base Earth, the circle at the top Heaven, the intermediate Shaft uniting both, the Incarnation.\n\nThis White Buddha has the curled hair which characterizes both the Good Shepherd and His Lamb in the earliest statue of Christ found in the Roman Catacombs, and in a Gandara sculpture representing Buddha's birth, now in the Lahore Museum.\n\n* This is quite in accordance with the Early Christian use. See Lowrie, \"Xtn Art and Archeology,\" who says: \"The unbaptized were not admitted into the Central Room of the Basilica, which was divided by columns into aisles. 'Penitents and Waiters' sat without. * * * Almost without exception the Syrian and Palestinian Churches have but one story.\"\nHis ears are longlobed, and on His head is a flaming tama—the well known Catacomb-symbol of a heart on fire with devotion to God. Like Him all the Congregation wear the Késa, off the right shoulder. One only, looks contemptuous—the rest listen reverently, some even with rapt devotion.\n\nThe strange thing is that whilst 14 of these men are white, the rest are chocolate brown, blue (possibly meant for black) and yellow-skinned. The two in the side aisles are of the yellow type. It is noteworthy that (according to Professor Starr) there are 4 distinct Race types represented in the Cave of Kokuhoshi also.\n\nI can imagine no better illustration of the Day of Pentecost; and, very curiously, at the Duomo of San Marco at Venice the mosaics over the Font do depict the Outpouring of the Holy Ghost upon the Church at the Feast of In-gathering at Jerusalem, and represent a group of various nationalities listening wonderingly outside a closed door—one of whom is a Chinaman!\n\nADDITIONAL NOTE.—It is of special interest to Korean students that Buddhosimha of Gandara and Doan of Wei must have come into contact with the Kokuryu queen c. A. D. 341, who spent several years in captivity at Yêh, and at whose release was replaced by Korean hostages who, c. A. D. 369, helped other captives to open the North Gate of Yêh to Fu-Kien's besieging army.\n\nAll these facts must have paved the way for Jun-do's welcome by the Royal Family at Ping-yang, A. D. 372; (pp. 12-14, supra)!\nA PLEA FOR THE INVESTIGATION OF KOREAN MYTHS AND FOLKLORE\n\nBY\n\nCECIL H. N. HODGBS.\n\nIt would seem that no serious attempt has been made as yet to collect and put in order what may be comprehended under the heading of Korean myths and folklore: yet the change passing over the life of this people makes it imperative to set about such work without delay.\n\nThe present paper aims to be no more than a plea that this Society should undertake this task, for the writer is a stranger in the fields of comparative mythology and folk-lore, and the material to hand has been of the scantiest. This material consists of\n\n(a) Some notes on early Korean history, translated from a Kukmun (국문) Serial magazine, now suppressed:\n\n(b) Personal observations of things Korean and enquiries made about the same, all limited by those barriers to conversation and real understanding which confront one but recently come to live among a folk of unknown tongue and unfamiliar customs:\n\n(c) Notes in letters from a friend in England, who has studied anthropology and comparative mythology, though merely as an amateur.\n\nOne feels that if investigation on the above lines is much longer deferred, the day for making it, and for correlating its results with what is known of the myths and folk-lore of other races, will be passed. Young Korea of to-day, conscious of national failure, and bewildered by Japanese and Western thought and\ncivilization, is only too ready to despise and forget as soon as may be its own customs and tales of bygone days, holding them, quite unjustly, to be all foolish and profitless and responsible in great part for the present position of the nation.\n\nIt may be well to make further two prelatory remarks:\n\n(1) Speaking as a missionary, one cannot be blind to the way in which opportunities are let slip, both through lack of interest in the people's history and customs, and still more through an almost contempt of what appears valueless in face of the problems to be met here and now. Such an attitude, even though assumed unconsciously, cannot but close the doors to the Korean telling anything of his national traditions and practices, all which have gone to the moulding of his character and the shaping of his thought and mode of self-expression. For without some sympathetic familiarity with what has gone to the making of a people, by means of their age-long customs, and their tales of heroes of old, true sympathy with them becomes the more difficult, and thinking their thoughts and speaking their speech a more formidable task than it must in any case prove. Further, any study of comparative history, myth and custom will not fail to widen one's outlook on life, by showing the underlying unity of the human race, and how yellow, white and black man has on the whole moved along the same main lines of development and is so still moving.\n\n(2) Secondly, one shrinks from any apparently irreverent use of Holy Scripture or Christian tradition. Yet the Old Testament is the record of the Hebrew's national development or feeling after Truth; and the Hebrew records need correlation with those of other races. Also it is obvious that much of Christian teaching and practice and much found in things secular amongst modern Christian civilizations, is of far older date than the Christian era. True lines of development persist: so that much of pre-Christian thought and practice is found continuing its movement towards the ultimate Truth, now under the ægis of the Church.\nIn any race its development, its movement towards Truth, will be marked:\n\n(a) by Traditional stories; which, when the art of writing is in use, will in part be set down in permanent form:\n\n(b) By Customs; many of which will persist long after any meaning is attached to them.\n\nIn which connection one would note the Value of Children's games. Prof. Starr, of Chicago, learned by enquiries made at On Son Dong, Kang Wha Island, of a rare form of tattooing once practiced by Koreans and still surviving through Children's play.\n\nSuch Korean tales as will be used in this paper, though in no case of early date, are sufficient to show the growth of the race along the lines which other races have followed; with the influence of nature-worship interwoven from the first, an influence that one can see has persisted till to-day.\n\nThough professing no real knowledge of the Subject in Hand this paper must have a scheme of classification; and accordingly, while subject always to correction, certain main ideas have been grouped together.\n\nIn the development of a race certain main ideas will present themselves in succession. They can be traced in old tales, customs, phases of thought—superstitious if you will: and their influence will be recognized on the folk of to-day. For present purposes these main ideas are grouped as follows:\n\n(1) Attempts to deal with the Mystery of Fertility and Reproduction both in man and in nature generally: which will find expression in Imitative Magic in\n\nUse of Stones,\nEggs,\nFire (or Gold, or Sun)\n\nThis is the earliest stratum.\nPresumably all connected with the propitiation of Spirits, though\ndue largely to dread of the Unknown or Unexperienced, also springs from man's facing this Mystery of Fecundity.\n\n(2) Then a later stratum Will be marked by prominence given to\n\nthe Influence of Water\nby tales of Human Wit and Prowess,\nby Riddles and the Magic of Numbers\nand so one would pass to the age of History proper.\n\nVery early, Burial Rites, and regard for the spirits of the departed, would become the object of thought and care.\n\nViewed thus broadly Man's development, very simple in essence, would appear to follow his realization of the three-fold Mystery of Birth, Death, and the life lived between these two. He will first deal with Birth and Death, because these are simple, whereas the third of this trinity being complex, his philosophizing on it cannot but come much later.\n\nOf the tales now to be read none is dated earlier than 60 B.C., following Dr. Gale's chronology, though this is unsatisfactory in that it gives us nothing really early, but forces us close up to the historical period, it is enough to show the superimposing of the second stratum, according to the rough grouping of main ideas set down above, upon the first, before all passes into the less fascinating realms of history proper.\n\n\"In the days of the Sam Han (삼한), Chin Han (진한) was not ruled by a king, but its folk lived among the hills in six separate Village Communities (部落). One day So-pel-Kong (소별공) headman of one Community, was wandering in the forest, when on a sudden he saw before him a horse, on its knees and whinnying. He went quickly toward it, when behold! it was nowhere to be seen, only in its place was a round gourd, like to an egg. Marvelling much he rubbed it, and from within came forth a baby boy. In awe he gathered the babe to him, and took it home and nurtured it with care. Ten years passed and the boy\nhad grown in wit and beauty and goodness far beyond his peers, and stood the heaven-born sage (聖人) revealed. When he was come to thirteen years the men of Chin Han (진한) foregathered and chose him King. Thus began the Kingdom of 新羅 under 朴赫世. For that he sprang from a Gourd he received the name of Pak (朴); from him are descended all those who bear this name.\"\n\nHere we see the Egg idea prominent. Where no ancestry of the hero is recorded, the earliest type of myth often makes him spring from this emblem or fertility. A very primitive idea closely allied with nature-worship.\n\nIn Kayan Borneo, if the harvest fails, Eggs are used in the sacrifices to recover fertility.\n\nIn many places in Europe Eggs or Egg-shells are strung on trees in spring, a remnant of the propitiation of the spirit of fruitfulness.\n\nThe Christian custom of the Easter Egg is presumably a result of this primitive idea, the Egg being the symbol of new life.\n\nStories connected with the Founding of 고구려 Ko-ku-Ryo by 고 Ko 쥬 Chu 몽 Mong B.C. 37\n\n\"Now Hai-pu-ru (희부루) King of north Pu-yö (부여), was well stricken in years, nor had he a son. Much time he spent in prayer and sacrifice upon the mountains. And it happened on a day that he saw before him a great stone shedding tears. Much wondering he moved it aside and beheld, and lo! a little child, in fashion like a frog, and in colour like to gold. In great joy of heart he cried \"This is an heaven-sent child,\" and he named him Kim-oa (금와) (金蛙) and made him his heir.\"\n\n\"Now it fell on a day that King 금와 met a woman on the South side of the Great White Mountain on the banks of Oo Pul water. The King asked her of herself and she made answer \"I am the daughter of Ha Paik, King of Under the waters (cf. Poseidon), and my name is Ryu-wha (류화) (? Willow). Prince Hai-mu-sa (희무사), son of Heaven, beguiled me and lay\nwith me; and after that we had parted, my parents in sore anger at my lewdness sent me to banishment in this place.\" So spake she and 금화 moved with pity took her and placed her safely in a secluded chamber. Yet ever the sunlight followed and lit upon her; whereby she conceived and bear an Egg. And Keum Wa deemed it of ill-omen and cast the egg forth, but nor ox nor horse would trample it, and the crow and magpie gave it the shelter of their wings, till that Ryou Hwa again gathered it and stored it in a place of warmth. And in time a man child brake the shell and came forth, a child of wondrous beauty. When grown near seven years old he fashioned bow and arrows with his own hands, and in a hundred shots would score a hundred hits. So was he called Chu-mong (주몽), for that the men of Pu-yö were wont thus to name one who was skilled with the bow.\"\n\nIn these tales we see Gold (or Sun light), the Egg, the Stone, and perhaps Water all playing their part in accounting for the mystery of Birth.\n\nThe wonder-child, of unknown parentage, is begotten of the Sun, sprung from the Egg, or is found under the Stone. The allusion to the Stone weeping is, it seems, very strange, it may show the influence of the Water idea of a later period.\n\nIn passing, it might be well to mark the constant interest shown in the derivation of names.\n\n(a) Stone superstitions are widespread in the world and are almost entirely connected with Fertility. The tying of stones to trees to make them productive is very common: and the throwing of stones as a fertility charm is well known. Corca of course abounds with Stone superstitions. There is the familiar stone heap on a pass, or indeed at almost any turn of a path, heaped round a bush or tree hung with propitiation offerings of rags, paper and straw; often with a devil post standing among the stones; and often the common empty spirit-hut stands hard by. There are the upright isolated stones standing singly in a field or in couples or more in\nnumber, apparently set up in some planned order. There are too\nthe stone heaps supporting a small upright stone or stones: and\ntoo one meets the single stone housed in a hut. Besides all which\nwe have too the instances of the man of prehistoric date\nwho for some purpose erected cromlechs or dolmens. The\nPeruvian Indians had special shaped stones to produce maize;\nothers for cattle; others for other purposes which had fertility in\nview.\n\nNew Caledonians bury stones of certain shapes in the fields\nfor each sort of crop; and for a tree, bury stones round the\nroots. Such stones are kept in graveyards till wanted, so that\nthe ancestral spirits shall lend their influence. Melanesians use\nstones in a like manner. Australian aboriginees will build a\nheap of stones and perform rites round it to bring rain. Using\nstones in \"making rain\" with imitative magic is apparently\nworld wide; stone magic is also used to produce warmth\nand sunshine. In one place in Asia minor a certain cure for\ndrought is to gather 77,000 stones, lick each one and place it\nin the sea; and most surely rain would fall before the process\nwas completed! Phallic stones are of course common every-\nwhere; one of the finest being the huge monolith in the vast\nHindu Temple at Madura in S. India. There is never need to\nseek far for the phallic stone against which the woman rubs who\nwishes to bear a son.\n\nOutside the North Gate of Seoul is a big boulder standing\nalmost on the common pathway with a number of small holes\nrubbed in it, which recalls the Man-an-tol of Cornwall. Pre-\nsumably the holes are rubbed by women with smaller stones,\nwhich they afterward carry and drop. This suggestion needs\nsubstantiating by observance which the writer has not had\nopportunity to give. In several places women carry small\nstones with them for a while and then let them fall. All such\npractices being imitative magic designed to bring children.\nThere is an African notion that every married woman has an\nancestral spirit husband, on whom depends her chance of bear-\ning children; he lives in a tree. Where ancestral spirits live in\nstones the same idea might obtain, and the stone would have to be touched by the woman to gain the benefit.\n\n(b) In the tales first read of the origin of 금 and 쥬 몽 we see the world wide ideas about the influence of Gold or Fire or Sun upon Fertility. The birth of 쥬 몽 s just the Korean form of the Greek myth of the hero Perseus born of Danae, who conceived by Zeus coming upon her as a shower of Gold. In that 류화 conceived by the sunlight and bear an Egg, from the which 쥬 몽 sprung, it would seem that the idea contained in the Greek myth of Leda is here blended into one with the Danae legend.\n\nIn one Indian tribe the actual ceremony of marrying a woman to the sun is (or was) annually carried out; though chiefly in order to gain wisdom from the sun when oracles were wanted.\n\nThe gift of Heaven would be gold: gold (or the Sun) is supremely worthy of devotion. Gold is the divine metal never to be esteemed lightly and yet which utterly destroys such votaries as unduly value it in the material sense. A truth sufficiently prominent in Greek mythology through the legend of Midas.\n\nIn the Cuzco temple of the sun even the clods in the garden were of Gold, and the Sacred Fire, lit from the Sun, burned as it did in the Vestal’s Temple at Rome, never going out from generation to generation. Christian legend offers instances of the same idea of cherishing a sacred flame.\n\nParsees in their setting out their dead that the body may be consumed by birds of prey show, may be, the influence of that idea which causes in places violent antipathy to cremation, which is rooted of course in dread of defiling the sacred element of Fire.\n\nThat Fire (or Gold) should be held responsible for Birth and Death is accordingly only to be expected. King Arthur of unknown ancestry, comes to Lyonesse in a ship that shone like fire, and a fiery wave carries him to Merlin’s feet—'the heaven-sent child.' The Hebrew hero, Elijah, leaves this world by\nbeing carried to Heaven by a Chariot and Horses of fire. In the Hebrew records angelic appearances are often connected with fire, as in the case of the birth of the hero Samson, where we read \"And the angel did wonderously; and Manoah and his wife looked on. For it came to pass, when the flame went up toward heaven from off the altar, that the angel of the Lord ascended in the flame of the altar.\"\n\nAccording to the proposed arrangement of main ideas we now pass from the first stratum to the second, which we find represented by customs or stories showing importance assigned to Water, to Human Wit and Prowess, to Riddles and Numbers. Here we find further tales connected with the hero 쥬몽: his popularity with the king earned him the hatred of the royal princes, which was increased by the failure of their attempt to ruin him by slander. A trick of 쥬몽's whereby he won himself a fine horse and on a certain hunting slew more than all the rest, brought him into jeopardy of his life, and at his mother, 류화's advice he fled the country with his horse and three friends and founded the Kingdom of 高句麗 (고구려).\n\n\"Now ere 쥬몽 fled from Pu-yo (부여), his wife was with child; and afterward she bear Ryu-ri (류리). A man among men was 류리 and a lover of the short-bow. It fell on a day that 류리 went a-hunting; and in sport he fired at the bowl of a woman who fetched water, and pierced it through. Then cried the woman in anger, \"A fatherless brat is a mannerless brute.\" So was he shamed, and firing again with mud he stopped the bowl's leak, and returned home. And seeking his mother he asked, \"Who is my father?\" Then Ryei-si (례씨) laughed and replied. \"He who begat thee in lawful wedlock is not.\" And 류리 answered with tears, \"A man and fatherless! what right have I to live?\" and would have slain himself. But 레씨 with speed restrained him, saying, \"'Twas but a moment's jest. Be not over hasty, but heed my words well. Thy father is a hero of renown\nand rules in 고구려, having to flee this land for that it was not worthy of him. What time he fled, he gave me this charge:—\n\n\"Seven Passes Valleys Seven\nStone Below and Pine Above\nSeek the Trove\nIf a child be born to us, bid him bring me the hidden thing, so shall I know him to be my very son.\"\n\nTherefore go now, my son, and find this hidden thing.\" So she spake, and 류리 said, \"So then a King's son am I: how can I continue in this low estate?\" And much he wandered o'er hill and dale seeking that which his father had hidden. And on a day when in his own house, he heard a sound from between the pillar and its stone (Kitong (기동) and Chyu-tchyo (쥬초)), and gazing intently he marked the stone how it was shaped with seven corners rising distinct and seven hollows lying between, all plain to see. Then did he understand and cried, \"Seven passes, Valleys Seven,\" that is the foundation stone: \"Stone below and Pine above,\" that is between the pillar and the stone,\" and searching there he found the portion of a broken sword. With this and three comrades he journeyed to 고구려 and offered that which he had found to the king. And the king joining it to the broken blade in his own keeping, lo! it fitted without flaw. Then with great joy declared he 류리 his son and heir.\"\n\nIn such tales we see the later stage of thought when the wonderful child of unknown parentage is still in the forefront, but he always finds his father in some hero. Human skill and Cunning and Bravery come into prominence. Skill with the bow is a marked feature of these tales, recalling the part it plays in the Greek cycle of Odysseus stories, that hero famed above all else for his cunning. Here too Riddles play their part on the stage; man puzzles over Numbers and the magic number '7' appears. So we slip into pretty well historical times and tales. Such movement of Korean growth as we are tracing it, is well paralleled in the Old Testament record. There too we see\nthe days of the dim Eponymous heroes, when there were giants on the earth in those days and Nimrod won fame as a mighty hunter, slip into the days of the Judges when the heroes are historical rather than mere shadowy men of renown, and men's skill and cunning and strength, the asking of riddles (as in Samson's history), constant ambushments and trouble over fenced cities, such a source of trouble too in early Corea, occupy the stage. We find too the Corean tale akin to the finding of Moses, and the temptation of Joseph.\n\n\"One day certain men on the sea-coast of Kim Kwan saw a large box floating in the water. It came to land, but they feared to draw it on to the beach, and in time the waves lifted it and bore it to shore at A Chin Po. And an old woman dragged it up, and looking in she saw a man child lying. Him she took home and cherished till he grew to man's estate. In stature he was exceeding great, and withal of a beautiful countenance, nor could any approach him in wit and skill. Now when first she drew the box from the water a magpie circled round and followed her with cries. And for that removing 鳥 from 鶴, 昔 remains, therefore his surname was Syek (석), and because he was taken out of the box his second name was 脱解 (drawn out). So is 昔脫解 father of the clan 석.\"\n\nAs King Arthur, the hero of unknown parentage, comes by Water, so does 석탈희. There is less of magic in the coming by water than by Stone or Egg or Sun, for it leaves open many possible sources of origin. The coming by water seems to be reflected in much Christian tradition. S. Bartholomew and the four martyred with him in India float across the ocean to their last resting places in boxes of lead. S. James the Great, who is the S. James of Compostella, floats in a shell over the sea. The tradition being maintained in the cockle shell worn by the Palmers, and by the grottoes still built by children in the East End of London in the beginning of August, at the feast of S. James of Compostella, which grottoes should contain the\nshells. Another instance of children quite unconsciously continuing old traditions in their games.\n\nA.D. 32.\n\n\"Now Hotong was son of Moo Sin, the King, but born of a concubine. And he was goodly to behold, and his father loved him much. But the Queen was moved with jealousy, and slandered Hotong to the King, saying, 'Hotongi came in to mock me.' But the King believed her not, yet when she daily affirmed the same with tears he began to heed her. Then said Hotong 'If I allay my father's doubts and clear myself of this crime, I must disclose a mother's sin which would be unfilial conduct,' so cutting his throat he died.\"\n\nThis is the only too familiar story, well known in the Hebrew form of Joseph and Potiphar's wife, and in the Greek form of Phaedra and Hippolytus. Here it has the added touch of illustrating a meaning of Filial Piety.\n\nA.D. 65\n\nThe Finding of Silla lay resting by night in the forest of Kim Si-rim (시림) on the west side of Kim Syeng and heard a hen clucking among the trees. When the dawn broke, the King called his ministers, and they found hanging in a tree a box of the colour of Gold, and beneath it a white hen clucked. And fetching the box they opened it, and the king looked in and beheld a little child of wondrous beauty. Then the King was glad and cried \"This is the gift of heaven\"; and he took the babe home and nurtured it. And the child grew beyond his peers in strength and wit, so that the King loved him exceedingly. And he named him 알지, while his first name was called Kim (金) because he came forth of a box of gold. Further the name of the forest was changed to Kyei-rim (계림), that is, the forest of the clucking hen; therefore the Kingdom was called 계림 (鷄林).\"\n\nWith this strange throw back to the primitive stratum of Gold this paper must close. There are customs and stories intimately connected with this people's existence, which of necessity have not been alluded to. Yet any investigation\nmade along such lines as have been suggested will have to reckon with them. It is surely by such investigation that one must seek the material for tracing the development of the Korean race from its prehistoric days to what it is today.\nCATALOGUE\n\n\"TRANSACTIONS OF THE KOREA BRANCH OF THE ROYAL ASIATIC SOCIETY.\"\n\nVOLUME I. PART I only. 1900.\nPrice Yen 3.00.\n\nContents:\n- Influence of China upon Korea.\n- Korean Survivals.\n- Colossal Buddha at Eun-jin.\n- Minutes of General Meeting.\n\nAppendix:\n- Office Bearers.\n- List of Members.\n- Constitution and By-Laws.\n\nVOLUME II. PART I. 1901.\nPrice Yen 2.50.\n\nContents:\n- Kang-Wha.\n- The Spirit Worship of the Koreans.\n\nVOLUME II. PART II. 1902.\nPrice Yen 3.00.\n\nContents:\n- Han-Yang (Seoul).\n- Korean Folks-Tales.\n- Minutes of General Meetings.\n- Report of the Council.\n\nAppendix:\n- Officers.\n- List of Members.\nCATALOGUE.\n\nVOLUME III. PART I only. 1903.\nPrice Yen 2.50.\n\nContents:—\n\nCh'oe Ch'e-Wun: His Life and Times.\nThe Culture and Preparation of Ginseng in Korea.\nMinutes of Annual Meetings.\nReport of the Council.\n\nAppendix:—\n\nOfficers.\nList of Members.\nCatalogue of the Landes Library.\n\nVOLUME IV. PART I. 1912.\nPrice Yen 1.50.\n\nContents:—\n\nThe Old People and the New Government.\nThe Korean Alphabet.\n\nVOLUME IV. PART II. 1913.\nPrice Yen 2.50.\n\nContents:—\n\nJapanese-Korean Relations after the Japanese Invasion of Korea in the 16th Century.\nThe Village Gilds of Old Korea.\nCoinage of Old Korea.\nMinutes of Important Meetings.\n\nVOLUME IV. PART III. 1913.\nPrice Yen 2.50.\n\nContents:—\n\nMarriage Customs of Korea.\nSelection and Divorce.\nThe Celestial Planisphere of King Yi Tai-Jo.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko51roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 68, "total-input-tokens": 97240, "total-output-tokens": 26612, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 455, 7], [455, 455, 8], [455, 1880, 9], [1880, 3762, 10], [3762, 5563, 11], [5563, 7416, 12], [7416, 10234, 13], [10234, 12134, 14], [12134, 14184, 15], [14184, 16093, 16], [16093, 18040, 17], [18040, 20051, 18], [20051, 21915, 19], [21915, 23901, 20], [23901, 26027, 21], [26027, 27904, 22], [27904, 29846, 23], [29846, 32249, 24], [32249, 32717, 25], [32717, 34826, 26], [34826, 36913, 27], [36913, 38831, 28], [38831, 40865, 29], [40865, 42833, 30], [42833, 44771, 31], [44771, 46757, 32], [46757, 48656, 33], [48656, 50525, 34], [50525, 52481, 35], [52481, 54482, 36], [54482, 56459, 37], [56459, 58487, 38], [58487, 60533, 39], [60533, 62671, 40], [62671, 64682, 41], [64682, 66583, 42], [66583, 68731, 43], [68731, 70729, 44], [70729, 72747, 45], [72747, 74847, 46], [74847, 76318, 47], [76318, 76318, 48], [76318, 77729, 49], [77729, 79808, 50], [79808, 81438, 51], [81438, 83261, 52], [83261, 85101, 53], [85101, 87087, 54], [87087, 89186, 55], [89186, 91126, 56], [91126, 93071, 57], [93071, 95016, 58], [95016, 97035, 59], [97035, 98976, 60], [98976, 99213, 61], [99213, 99213, 62], [99213, 99831, 63], [99831, 100604, 64], [100604, 100604, 65], [100604, 100604, 66], [100604, 100604, 67], [100604, 100604, 68]], "primary_language": ["None", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]