[{"id": "1a836eb8e71a8cb0eeea750c65ca29eb2ab96a79", "text": "TRANSFERRED\nto University Library\n\nSTRAITS BRANCH OF THE\nROYAL ASIATIC SOCIETY.\n\nNOTES AND QUERIES\n\nEDITED BY\nTHE HONORARY SECRETARY.\n\nNo. i Issued with No. 14 of the Journal of the Society.\n\nSINGAPORE:\nPrinted at the Government Printing Office.\n\n1885.\nSTRAITS BRANCH OF THE\n\nROYAL ASIATIC SOCIETY of Great Britain and Ireland, Malaya Branch, Singapore\n\nNOTES AND QUERIES\n\nEDITED BY\n\nTHE HONORARY SECRETARY.\n\nNo. 1, Issued with No. 14 of the Journal of the Society.\n\nSINGAPORE:\n\nPrinted at the Government Printing Office.\n\n1885.\nPREFACE.\n\nPossessing, as this Society does, subscribers resident in many eastern countries, the races and tribes whose manners, customs, beliefs, literature, &c., &c., may furnish subjects for short contributions under the above heading are by no means few in number: valuable scraps of information about them are, it may be hoped, to be obtained from members who will not object to communicate short notes on matters of interest, though they may be disinclined to extend their memoranda to the dimensions of an essay.\n\nSiam, Sumatra, Borneo, the Malay Peninsula, and the British Settlements in the Straits of Malacca include in their populations a great many races of mankind. Even those which are best known to us and which have been most often described, have hundreds of peculiarities of religion, custom and language which have not been recorded, and others are as yet almost a scaled book to the anthropologist.\n\n\"Travellers and residents in uncivilised lands,\" in which description most of the members of the Society will recognise themselves, are the class for whose use a manual (\"Notes and Queries on Anthropology\")* was drawn up by a Committee appointed by the British Association for the Advancement of Science in 1874. The object of the publication was to indicate to travellers generally to what subjects to direct their enquiries, and there are no less than one hundred sections devoted to anthropology alone. A glance at this little\n\n* Published by ED. STANFORD, Charing Cross, 1874.\nwork will always suggest to the resident in the East a host of subjects as to which interesting information may be procurable from the native population surrounding him. And quite apart from anthropology, there are endless notes to be made in other departments of science, natural history, botany, conchology, entomology, &c.\n\nMembers of the Straits Branch of the Royal Asiatic Society, and all residents and travellers in the Eastern Archipelago, are, therefore, invited to communicate \"notes\" and \"queries\" to the Honorary Secretary for insertion in this Journal. Should the supply exceed the space allowed for one paper in the half-yearly journal of the Society, it may be possible by and by to organise a separate periodical publication on the principle of the \"Punjab Notes and Queries,\" published monthly at Allahabad under the editorship of Captain R. C. Temple.\n\nHere are some of the headings under which notes will probably suggest themselves:\n\nNative History, Religion, Superstitions, Magic and Witchcraft, Mythology, Medicine, Social Customs, Mode of Cooking, Mode of Eating, Clothing, Slavery, Marriage Customs, Ceremonies at Births and Funerals, Games and Amusements, Laws, Language, Habitations, Industries, Traditions, Folk-lore, Proverbs, Extracts from Native Authors, Antiquities, Habits of Animals and Birds, &c., &c.\n\nW. E. M.\n\nSingapore, January, 1885.\nNOTES AND QUERIES.\n\nBOTANY.\n\n1. Daun Sengugu.—I sent to Kew some flowers, leaves and seed of the plant known here and in Java as \"Daun Sengugu\" (supposed to be a specific for Beri-Beri), and the Assistant Director was good enough to get a report on the specimens from the Herbarium Department.\n\nIt is pronounced to be *Clerodendron serratum*, which is mentioned in the Pharmacopoeia of India, p. 164. The roots are said to be largely exported from Vizagapatam for medicinal purposes.\n\nC. C. S.\n\n[In Filet's Catalogue of Plants in the Botanical Garden at Weltevreden, there is a description of this plant, of which the following is a translation:—\n\n*Clerodendron serratum*. Sprg. Native name *Singgoegoe* (Sundanese), *Sirie Goengoe* (Malay and Javanese). Habitat, East India, Nepaul, Assam, Java. Uses. The roots macerated in water are eaten in Java to promote clearness of the voice. The leaves, either alone or mixed with *mangkoe-doe, sereh*, &c., are administered as a vegetable or as a decoction to women in labour to assist delivery; the decoction is also employed as a remedy against fever and against stomach-ache and worms in children.—Ed.]\n\n*\n\n2. Gutta Juices.—The following lamentable occurrence took place only a few months ago in Borneo. A gentleman well known for his fondness for exploration found himself close to certain trees which apparently exuded a clear and not unpleasant tasting liquid. Being very thirsty, he drank somewhat copiously of the supposed water. A few hours afterwards he died in considerable agony. The juice he had rashly swallowed was that of a gutta which coagulated in his stomach and entirely closed it to the exit of food.\n\nN. B. D.\nHISTORY.\n\n3. Ancient Settlement in Penang before British Occupation.—The most ancient kampung in Penang is Datoh Kramat, which would appear from the following extract from an old Register of Surveys effected in 1795, preserved in the Penang Land Office, to have been occupied early in the 18th century:\n\n\"No. 571. Datoh Kramat Burying Ground.\nGarden Ground.\nMeasuring on the East and West sides, three orlongs;\nOn the North and South sides, four orlongs and-a-half;\nContaining in all thirteen orlongs and-a-half;\nThis ground was cleared by the Datoh Kramat about ninety years ago, and Maharajistia* possesses himself of this ground as being a relation of the Datoh Kramat by descent. The ground is planted with cocoa-nut trees and fruit trees and many people are buried in it.\"\n\nC. J. S.\n\n*\n\n4. Titles and Offices of the Officers of the State of Perak.\nUnder native rule, there were four chiefs of the first rank, eight of the second rank, and sixteen of the third.\nThe four principal had the title of Tunku:\n1. Raja Bandahara, Wazir al-Kabir, the \"Grand Vizier\" of Perak.\n2. Orang Kaya Besar, one of the four, Penghulu Raja Perampuan, or Penghulu Dalam, Custodian of the Royal Ladies, or Guardian of the Inner Apartments.\n3. Mantri, one of the four, Hakim, or Judge of the country.\n\n[* Maharaja Setia.—Ed.]\nNOTES AND QUERIES.\n\n1. Tumonggong, one of the four, Kris Pandak' Raja, the \"Short Kris\" of the Raja.\n\n2. Maharaja Lela, Head of the eight, Orang Besar Balei, or chief officer of the Raja's audience hall panchong ta' bertanya—\"who lops off (or executes) unquestioned.\"\n\n3. Laksamana, one of the eight, Raja di Laut, Juru-batu of the country of Perak. Juru-batu—\"Mate, whose station is forward.\"—(Marsden.)\n\n4. Shahbandar, one of the eight, Anak kunchi raja, \"The key of the Raja,\" an allusion probably to the duties of the Shahbandar as Collector of Customs and Treasurer.\n\n5. Sri Adika Raja, one of the eight, Jurumudi or helmsman, whose station is at the kamudi or helm. Raja ujong karang—\"Ruler of the point of rocks,\" an allusion probably to the rocky nature of the country in Ulu Perak.\n\n6. Panglima Bukit Guntang, one of the eight, Dayong peminggang kanan—\"He who wields the chief starboard paddle,\" i.e., sitting nearest to the part of the boat occupied by the Raja.\n\n7. Panglima Kinta, one of the eight, \"Dayong peminggang kiri\"—\"The same on the port side.\"\n\n8. Toh Nara, one of the eight, Bantara, or Chamberlain.\n\n9. Datoh Sagor, one of the eight, Perqalah, the poler of the boat.\n\n10. Sri Maharaja Lela, Head of the sixteen. In charge of the ryots. One of his duties was to build the Raja's balei or audience hall.\n\n11. Datoh Sadia Raja of Bandar, an officer whose duty it is to prepare everything required by the Raja, to provide wood, water, etc., to build huts on occasions of festivals, to furnish hangings, ornaments, etc.\n15. *Toh Rana Pahlawan, Timba-ruang* of the country. \"The person who bales the boat if she leaks,\" i.e., who removes any danger threatening the country.\n\n* * *\n\n5. **Ophir**.—The statement often quoted by writers and compilers, that the natives of Malacca call their gold mines \"Ophirs\" has always astonished me, for I know of no Malay name for a mine in any way resembling the word given. The author of \"Sarong and Kris\" quotes Dr. Kirto's Encyclopædia and Dr. P. Poivre, a French author, who wrote in 1797, in support if it. I think that I have found in a paper in the first volume of \"Asiatic Researches\" (1784) the foundation of the often-repeated argument \"in favour of the mount in the Malay Peninsula being that of Scripture\" (to quote Major McNair). A Mr. Macdonald, writing about the gold of Limong in Sumatra, says: \"It is more than probable that Sumatra must have been the Ophir of Solomon's time. This conjecture derives no small force from the word ophir being really a Malay substantive of a compound sense, signifying a mountain containing gold.\" (1) Can anyone explain how this derivation is arrived at?\n\n* * *\n\n**LANGUAGE.**\n\n6. **Pantang Gaharu**.—The Mentra, i.e., the aborigines in Malacca and the surrounding States, when in search of gaharu (lignum aloes) are obliged to use a special language, as was found to be the case in the south of the Peninsula among the aborigines seeking for camphor.*\n\n[* See Journal, Straits Branch, R. A. S., No. 7, p. 101.—Ed.]\nGaharu can then only be spoken of as tdbak, the ordinary language is pantang or forbidden.\n\nThe following is a list of similar words which shews, as in the case of the pantang kdpur in Johor, that periphrasis is often made use of to avoid the ordinary word:\n\n| Malay       | Pantang                  |\n|-------------|--------------------------|\n| snake       | ālar bindtang panjang    | (long animal) |\n| buffalo     | kērbau sia               |                |\n| elephant    | gajah bindtang gedang    | (great animal) |\n| to go home  | pūlang mēlīpat bālik    | (turned backfold) |\n| goat        | kambing bébek           |                |\n| duck        | ūtek pépet              |                |\n| fowl        | āyam méndong             |                |\n| fish        | ikan sakilap pasir      |                |\n\nThe searcher for gaharu must neither sing nor pray when out on the search. Nor may he eat bēldchan (dried prawns) the trābok fish, nor any kind of umbut, i.e., ground shoots of any plant, nor can any other kind of produce be collected at the same time, for fear of injuring the quality of the gaharu.\n\nIf a man has found a promising gaharu tree, having cleared round it, he goes home, and dreams of the guardian spirit (hantu gaharu), who appearing states as a condition of a favourable result, that he must have a man handed over to him. The next day, if the dreamer can catch some one asleep, he smears his forehead with lime as a sign to the hantu, who accordingly carries off his victim, the latter dying of a fever, or some other ailment, and the dreamer gets a good supply of gaharu. But should he fail to comply with the hantu's wishes, he either cannot find his tree, or it turns out a bad one.\n\nThe same pantang applies to the search for gold.\n\nD. F. A. H.\n7. Modes of sitting in driving an elephant.\n\nThe gambala gajah, or mahouts, in Perak, have the following expressions for three modes of sitting on the elephant's neck:\n\nBelah timianq.—To sit with one leg tucked under and the other hanging down on one side. (This phrase might be applied to the mode of riding on a side-saddle.)\n\nTempok katak.—To sit with the right leg bent back on the right side and the left leg hanging down on the left.\n\nChabang halban.—To sit with both legs hanging straight down.\n\nEd.\n\n* * *\n\n8. Johor.—I see that there has been some discussion in the newspapers as to whether the name of this State is properly spelt Johor or Johore. Raffles, whose references to Johor are very numerous in his Essay on the Malayu nation, published (in 1815) in the 12th volume of Asiatic Researches, spells the word without the final e. In Du Bois' Vies des Gouverneurs Généraux (The Hague 1763) also, Johor is the orthography employed. To go back further still, the early factors in the service of the East India Company (1607-1616) spelt the word Jor and Jhor. See Calendar of State Papers, Colonial Series.\n\nEd.\n\nNATURAL HISTORY.\n\n9. Sumatran Mawas.—The orang-utan (simia satyrus) * which is found in Sumatra as well as in Borneo, is known by tradition to the Malays of the Peninsula by the name of mawas. The Mawas is said to inhabit the jungle, and to have\n\n* Called Mias in Borneo.—WALLACE'S Malay Archipelago, I, 62.\na right arm of steel, which can be used like a knife.*\n\nHe lives in the trees, and his body is covered with hair; he does not use fire, for fear of accidents, but lives on fruit.\n\nNatives are sometimes found to tell of some one who has met one of these beings.\n\nThe following account is given of one said to have been met with within the memory of man at Përlak in Sumatra!\n\nA man went into the jungle one day, and was caught by a female Mawas, who took him in the place of her husband whom she had lost. In due course, she bore him a child. His thoughts were always directed to the means of escape, which he devised by getting the Mawas to fetch him cocoa-nuts, from the husk of which he constructed a rope. When she asked him what the rope was for, he said it was to swing a cradle for their child. Her speech is described as resembling that of a tiong or mina bird. When the rope was long enough to enable him to descend the tree, he asked the Mawas to get some krang (shell-fish) and umbut nibong (the young shoot of the nibong palm). When she had gone in search of them, he let himself down from the tree, and hastened home to his kampong. He had only just reached it when the Mawas came after him, bringing the krang, the umbut nibong, and their child, and called on him to return to her, but his neighbours came out with lights and guns to his help, so that the Mawas did not venture near; then finding she could not get him back, she threw down the krang and umbut nibong, and tore the child in half, throwing one-half at her husband, and the other half away, and then disappeared.†\n\nD. F. A. H.\n\n* The malignant Mawa that mocks the laugh of a human being with its iron arm and body covered with shaggy hair.\" NEWBOLD, Straits of Malacca, vol. II, p. 416.—Ed.]\n\n† One of the \"idle tales current among Malays\" about the existence of men-monkeys. See NEWBOLD, Straits of Malacca, vol. II, p. 416.—Ed.]\n10. Turtles.—The following paragraph, translated from the Batavia Handelsblad for the Straits Times, is worth permanent preservation. Some two years ago, the Colonial Government was applied to for information on the subject of the turtle trade. Very meagre, however, was all that could be collected on the subject, and the details given below will be new to many:\n\n\"Any one journeying along the sea-shore from Padang to Bencoolen, or visiting the desolate southern sea coast of the Residency of the Preanger Regencies, may see towards the hills where the coast rises up with a very gentle acclivity, and the sand is dry and loose, many places bearing marks of rooting up, the sand being thrown up in heaps. On these places being examined, there will be found at a slight depth under the sand many eggs, round as bullets, each of the size of an apple, pale-white in colour, and with a soft parchment like shell. These are turtles' eggs, which are found on the south sea-coast of the Preanger, as many as one hundred being sometimes laid in one nest. As these eggs are tasty and nutritious, and as the animals themselves yield delicious meat, the idea of bringing these articles into more general use than heretofore as food supplies among the people, deserves encouragement. Great difficulties, however, stand in the way of carrying it out. The places where these eggs are found are in desolate, almost inaccessible, and very thinly inhabited districts. People may wander there for hours and even days without discovering any trace of human handiwork. This has been experienced by those few persons who have visited the south coast of Java, and by the telegraph officials who laid the line from Padang to Bencoolen. The working of the proposed farm will be hampered by the numerous beasts of prey, tigers, crocodiles, and wild dogs which hunt the turtles at night, when the latter leave the sea to lay eggs on the beach. Notwithstanding the unusual size (3 to 5 feet long) and the strength of their shells, they fall easy victims to these beasts of prey, because sea turtles are unable to withdraw either head or feet under their shells. So fierce and bloody is the attack on these animals, that the southern sea-coast of Java sometimes resembles a battle\nfield, the beach being strewn with bones and shells of turtles,\nsurrounded by torn and foul-smelling pieces of flesh, which\nthe beasts of prey have left lying about at the disposal of\nbirds of prey, which may be seen on such occasions flying high\nin the air above these places. The eggs themselves are the\nfavourite fare of small four-footed beasts of prey, and even\nof monkeys, which dig them up out of the sand and carry them\naway. These eggs are not hatched in cloudy or rainy weather,\nfrom turtles leaving it to the sun's rays to hatch them.\"\n\nN. B. D.\n\n*\n\nII. Breeding Pearls and Bacteria in Rice.—The first volume of these Transactions contained an article from my pen on the subject of breeding pearls, which excited, I am afraid, some derision, though if quotation be any sign of interest, the notice it received from the press was satisfactory. The late Frank Buckland inserted the article bodily in Land and Water, and Mr. Darwin did me the honour to write to me about it. I have just come across a paragraph translated from the Batavia Dagblad of 17th April last, which seems to point to a possible solution of the mystery. It states that a Dr. Lacerda, a Brazilian gentleman who has received 75,000 francs from his Government for discoveries regarding snake bites, and is now engaged in researches upon beri-beri, deems that beri-beri arises from bad rice, and believes that in such rice he has found the same bacteria which he had detected in the blood of beri-beri patients. It all depends however, on this belief becoming a certainty. It strikes the Dagblad that one fact tallies with his hypothesis, namely that beri-beri so often appears on premises where large stocks of rice have been kept for a long time, and where little supervision has been sometimes exercised over boiling that grain. \"The animaculæ die at a temperature of 60° centigrade, according to Dr. Lacerda. Among the pupils at the native veterinary school in Samarang, beri-beri\nseveral times broke out, until the house was rebuilt, upon which the disease disappeared. Unless we are misinformed, adds the writer, these young men took their meals together, but now they board with natives. If this be the case, Dr. Lacerda would certainly find it remarkable.\"\n\nNow, if animal life really exists in dry rice, the nibbled look of the end of each grain when kept with pearls would be accounted for. It still leaves the alleged formation of the pearls a mystery. There is sufficient evidence of their being actually formed, here, in Singapore, to hang a man, were the same evidence produced in a case of murder; and that, after all, is, conventionally, the nearest approach we can make to absolute proof. I hope that the subject will not be quite forgotten by local scientists.\n\nN. B. D.\n\n*\n\n*\n\n12. Are Cockatoos Carnivorous?—Though not a local bird, so large a number of cockatoos are imported from New Guinea and Australia that I may perhaps be pardoned for introducing this querry. A short time ago I put a wood-dove into the same aviary as a favourite sulphur-crested cockatoo. A day or two afterwards, the latter was found holding the body of the dove in its claw (having bitten off the head) and sucking the blood of its victim. I knew that cockatoos would thrive on a little chopped meat, but did not know that they ever acted as birds of prey. Have any of our readers observed a similar circumstance?\n\nN. B. D.\n\n*\n\n*\n\n13. The Octopus.—The Malay residents in the vicinity of Tanjong Pagar assert that a large octopus inhabits a deep cave close to the western end of the wharf in the direction of the Borneo Company's premises. Divers declare that they\nhave seen the animal. The following description of a similar creature appeared in the *Straits Times* of 28th November last:\n\n\"On June 15, when in S. lat. 21deg. 37sec. and E. long. 118 deg. 40 sec., about five miles off the Exmouth Gulf on the western coast of Australia, Captain Hopkins of the schooner *Mary Ogilvie*, saw an immense creature which he took to be a species of octopus. His attention was drawn to it by a perfect cloud of sea-birds, and at first he naturally thought it must be a dead carcass. On approaching it, however, he found it was alive and sluggishly disporting itself. In shape it was like a violin but of immense size, with some six feelers about the greater diameters of the violin. It lay almost flat upon the water, was of a dark-grey above, and was continually elevating one of its feelers, apparently twice the thickness of a man's arm, to a height of from six to eight feet. It appeared to be vomiting, and as the birds were evidently feeding, that accounted for their presence in such numbers. Its size was so great that, had it grasped the vessel, it could easily have capsized it. The Captain, therefore, got out of the way as quickly as possible, and without making definite measurements; but a large whale in the vicinity looked quite diminutive. It is a pity that something more exact as to size is not available, but I think the description is sufficient to convey an idea of the nature of the monster.\"\n\nN. B. D.\n\n*\n\n14. Tiger Traps.—Most residents in Singapore are acquainted with the ordinary form of tiger traps. A hole is dug in the ground, some 5 or 6 feet, and 12 feet square in depth, and at the bottom strong sharpened bamboo stakes are firmly planted. The hole is covered over with brushwood, grass, &c., and if the tiger sets foot on this he generally becomes lamed if not killed by the fall into the pit. G. F. M. describes another sort of trap as follows:\n\n\"I started my trap on the 4th instant, and was lucky enough to catch the brute the evening of the 12th. I made mine close\nto the stable and goat shed, and took a trap made in Serdang some two years ago by a friend of mine as a model.\n\nIts dimensions are as follows: length 12 feet, breadth 5 feet, and height 6 feet. It is made of wooden bars or tiangs, placed close together, and driven three feet into the ground. These bars have a diameter of from 3 to 4 inches. The top is made of 2-inch planks placed broadways and nailed to the top of the tiangs with 6-inch nails. Lengthways, over the 2-inch planks, 1-inch planks are again nailed down, so as to give additional strength to the roofing of the trap. The door is about 2½ feet wide and drops two feet into the ground, falling between 2-inch planks which are driven six feet deep into the ground. Inside the trap there is a partition by which means the bait is shut off from the tiger, and escapes unhurt. The interior arrangements as to the falling of the door is very primitive, and is simply a contrivance effected by the use of a nail, some string, a small piece of nibong and a plank two feet long. The string is tied to the level by which the door is suspended, and running through a small aperture made in the roof is attached to the piece of nibong. This again is slipped under the nail (which is driven into one of the tiangs) and kept into position by the plank which projects into the middle of the trap. This is, of course, arranged so as to make everything exactly balance. The tiger treading on the plank, or even brushing against it, at once loosens everything, and the door comes down with a rush.”\n\nN. B. D.\n\n*\n\n*\n\n15. Man-eaters.—The following will be new to many. After describing the capture of a tiger, G. F. M. writes:\n\n“The beast proved to be a female, and measured as it lay stretched out, exactly 7 feet 3 in. from the muzzle to the end of the tail. According to the Malays and Siamese, it was a man-eater. They made this assertion after having examined the ears, which were slightly slit in two or three places. They have it that a tiger after having devoured a human being, gets its\nblood so heated, that it lies in some river or swamp for three days in order to cool itself, and that during that period its ears itching irritate the beast so, that it tears at them with its claws, permanent marks being the result of its scratchings.\"\n\nN. B. D.\n\n*\n\n*\n\n16. Tigers eating Frogs.—Few would have credited the following:\n\n\"I had often heard that tigers, when they could get nothing else better to eat, lived on frogs, but I always thought this was hearsay, until I examined the contents of this one's stomach, which consisted almost entirely of them.\"\n\nN. B. D.\n\n*\n\n*\n\n17. Charms.—After describing the care exercised to keep off intruders by piling empty cases, &c. around the mat whereon the dead tiger lay, G. F. M. says:\n\n\"This latter precaution proved very necessary as it was the means of keeping off the hands of depredators, who were only too eager to procure some charm or amulet.\n\nCareful as I was, however, within a quarter of an hour after the tiger was shot, it had not a single hair of its mustaches left, these being considered great charms. Subsequently, as the skin was hanging out in the sun to dry, I even had two of the claws stolen.\n\nThe flesh of the tiger was eaten by the Chinese, Siamese and Klings with considerable relish. It was interesting to note what implicit faith all natives put in the charms or tokongs that are to be obtained from the vanquished foe. Chief among them are the gall stone, the claws, and a small bone found at the back of the neck. The bones were in great request,\nand medicine which has very valuable medicinal properties is prepared from them.\"\n\nThe last sentence is not quite accurate. It should read medicine which, *it is believed by the natives*, has very valuable, &c.\n\nN. B. D.\n\n* * *\n\nMALAY FOLK-LORE.\n\n18. Signs and Omens.—When on the war-path, it is good to start on a Friday before the flies are astir (*sa-bélum terbang lalat*).\n\nOn a Saturday, it is good to start after the sun is up.\n\nWhen about to start on a journey, or to leave home on business, it is unlucky to hear the chirp of the squirrel (*tipei*), which portends robbery as the traveller's probable misfortune; likewise the cry of the \"ungka\" (gibbon) portends loss.\n\nThe sound of the *tétábau* (kind of \"whip-poor-will\") signifies death by accident or wound.\n\nSo he who, setting out on a journey, hears the sound of the *člang* or *lang* (kite), expects that he, or those he leaves behind, will suffer loss by fire, should it be disregarded.\n\nHearing the *čnggang* (hornbill) by night means injury to the country, such as burning of houses.\n\nThe *búrony chintony* heard at any time betokens that an act of adultery or seduction is being committed somewhere.\n\nIf a person stumbles on leaving the steps of a house on particular business, it is unlucky, and the business is abandoned for the time.*\n\nTo hear the call of the *séjéreh* bird is a bad omen for the sportsman for the whole of the day on which it is heard, but to hear that of the *sémújur* bird is lucky for him.\n\n[* See Journal, Straits Branch, R. A. S., No. 7, p. 19.—Ed.]\nThe water from *akar* (monkey ropes or creepers) which produce it must only be drunk standing, not sitting or squatting or *sakit pinggang* (lumbago or kidney disease?) will result.\n\nD. F. A. H.\n\n---\n\n19. Legend of Changkat Rambian.—Many of the legends of the Perak Malays refer to a remote period when what is now dry land was covered by water and when the lofty mountain peaks were islands divided one from another by the sea.\n\nMiles up country, at Changkat Rambian in the Batang Padang district, a rock is pointed out which is declared to be the petrified hull of an Indian ship which came trading to those parts in the ancient days, and in explanation of her fate the following story is told.\n\nIn the day when Changkat Rambian was a sea-port, Indian traders came across the Bay of Bengal to barter their gay chintzes and cottons for the tin of the Malays. The Datoh or Chief of Changkat Rambian would receive the dark strangers hospitably and send them away with full cargoes when the changing monsoon brought favourable winds for the return voyage.\n\nHe was fair in his dealings, and enjoyed a good reputation among the sea-faring adventurers whom commerce brought to his island-port.\n\nNow it happened once that when an Indian trader cast anchor off Changkat Rambian, the Datoh had nought in his stores but a *gantung* of tin-ore not yet smelted. Nevertheless, firmly believing that he would have a cargo by the time the ship was ready for sea, he boldly purchased the whole stock of the Malabar merchant and promised to deliver to him one hundred *bharas* of tin. Time went on and the Datoh's expectations were not fulfilled. Either the ryots working in his mines were idle, or the mines unproductive, and the Datoh still found himself with but one *gantung* of ore with which to furnish one hundred *bharas* of the pure metal to a rapacious creditor.\nDay by day came the Indian merchant demanding his due with the pertinacity of an eastern creditor, until the Datoh declared that the white cockle shells which formed a pavement in front of his house were being worn out by the trader's feet. In despair, he appealed to heaven for supernatural aid, and in his prayers he implored that his petition might be answered in a dream or vision. That night, as he lay stretched on his mat, an old man appeared to him in a dream, and said: \"Seek for a young kompas tree growing on an ant-hill. When found make a poker of it,* use it when smelting the gantang of ore, and all will be well.\" Having said this, the old man vanished, and the Datoh slept peacefully till morning.\n\nWith dawn the Indian came as usual, pressing his claims with more than ordinary vehemence and declaring that the time for his return was near and he would be ready to sail in two days. The Datoh asked for time and said that he must first visit Pulau Tunggal, but on his return would perform his contract as agreed. The unwilling creditor had to agree and the Datoh stepping into his canoe paddled away rapidly to the other island, for in those days Bukit Tunggal, which now stands far inland on the left bank of the Perak river, was an island and men called it Pulau not Bukit Tunggal. A short search in the wooded heights of the island resulted in the discovery of the stick which was to have such magic properties. Returning to his house with the kompas sapling, he was visited by the merchant, who thought that, after this journey, some gold or other valuable articles might be forthcoming in satisfaction of his demands. Loud were his complaints on finding absolutely nothing. \"Fear not,\" said the Datoh, \"to-night I shall smelt, and to-morrow you may come for the tin, for I have vowed that this gantang of ore shall fill your craft.\"\n\nAll that night the Datoh smelted. The Indian seamen lying on board their ship at anchor off the shore could hear the regular clack of the valve of the bellows and wondered that so\n\n* For superstitious reasons, Malay tin-miners will not use iron instruments. For stirring up the charcoal embers at the orifice of the furnace they use long thin saplings of some green tough wood. These are usually called penjuluk or penyuluk. See No. 9 of this Journal, p.p. 10 and 57.\nmuch work could be wanted when there was but a handful of ore. Their captain looked to his weapons and prepared for a fight, for he would not tamely suffer himself to be cheated. Small belief had he in the promised cargo, and accordingly next morning he did not go himself to fetch the tin which the Datoh had asked him to take, but he sent a messenger on shore to see what there was. The sailor found piles of white, shining ingots lying ready at the smelting house, the furnace still in full blast, and the Datoh blowing the bellows. \"Why are you alone?\" said the latter, \"Why are not ye all on shore taking the cargo?\" Then the Indian and all his men landed and the Datoh bade them take all the tin without weighing it, for he had promised them all that he should smelt. Radiant was now the merchant's face, and he could not be sufficiently polite and deferential to the man whom he had so lately disbelieved. Backwards and forwards tramped his followers carrying down the ingots of tin to the ship, but the pile was augmented every moment and seemed inexhaustible. At last the Datoh suggested that, instead of lifting the solid metal, they should make a spout from the mouth of the furnace to the ship and run the molten metal into the hold. To this, the Indian, who was covetous, agreed; the pipe was made and the molten tin ran down like water. When the craft was getting low in the water the merchant called to the Datoh to stop as he now had enough. Then said the Datoh: \"Did you not disbelieve me in your heart when I said I would give you a cargo? Did you not say 'how will a gantang of ore become one hundred bharas of tin,' and did you not despise my protestations and promises? Now, therefore, I have determined to fulfil my word. I promised you a shipload and you shall have it.\" So the tin went on pouring down, and presently the vessel sunk with her cargo and crew. But, as ages rolled by, the sea gradually receded, and Changkat Rambian, where the Datoh had ruled and where the Indians had suffered for their covetousness, became part of the mainland, and the hull of the Indian ship, turned to stone, became visible and may still be seen among other rocks on the hill-side. And still men search for the kompas sapling growing on an ant-hill, for every Malay miner knows that, once secured, this treasure\nwill ensure such a miraculous quantity of metal as has not been known since the days of Datoh Changkat Rambian.*\n\nEd.\n\n**\n\n20. Nakhoda Ragam.—A personage of this name figures in many Malay legends, especially those connected with the sea. I have heard of him at Bandar in Lower Perak, and I believe he is also known to Bornean folk-lore. See also Journ. Ind. Arch., XI, 168. Notes on this subject are invited.\n\nEd.\n\nSOCIAL CUSTOMS.\n\n21. Ganju.—This is the Malay word applied to a species of ordeal resorted to in order to find out the perpetrator of a crime, when no one in particular is suspected.\n\nOne kind of ganju is the following:—Supposing that a theft has taken place in a house, all the inmates are assembled and their names are written on the edge of a white cup, on which\n\n* In this legend, the words which I have translated ant-hill are busut jantau \"male ant-hill.\" The legendary kompas sapling is suggestive of the divining-rod which is believed by some writers on comparative mythology to be scientifically identical with the phallus or lingum. The \"male ant-hill\" rather supports this view. The conclusion of the legend is not unlike a well-known northern story of \"how the sea became salt.\" I am indebted to M. Paul Sébillot, who has so energetically devoted himself to the study of \"folk-lore\" in France, especially as regards legends connected with the sea, for a paper (\"L'Eau de Mer dans les superstitions et les croyances populaires\" published in the anthropological journal L'Homme, No. 13, 1884, from which I take the following version of the Norwegian legend:\n\nUn conte norvégien du recueil d'Abjornsen et Moë, intitulé le Moulin magique, attribue la salure de la mer à ce moulin, qui a le privilège, moyennant certaines paroles, de moudre tout ce qu'on lui demande. Il finit par tomber entre les mains d'un marin qui l'emporta bien vite à son bord, sans demander les paroles nécessaires pour l'arrêter. Quand le navire fut en pleine mer, le marin lui dit: \"Mouds du sel, vite et bien.\" Et le moulin de romir du sel. Lorsqu'il y eut la charge du vaisseau, le marin lui cria de s'arrêter; mais le moulin marchait toujours parce qu'il n'hésitait qu'à une formule magique. Le tas de sel devint de plus en plus haut, et le navire finit par couler bas. Le moulin est encore actuellement au fond de la mer à moudre du sel, ce qui fait que l'eau est salée.—Ed.\nsome sentences of the Koran are also inscribed. A ring is then suspended by a maiden's hair and held right over the middle of the cup. It is swung round gently and the name which it first strikes is the name of the thief.\n\nIn another method, a sieve (nyiru) is used. Some mystic sentences are written on this utensil with turmeric (kunnyit). All the household being assembled, a man grasps the nyiru by the edge and holds it out flat. In a short time it is seen to wave up and down and presently pulls away from the man holding it, who follows its lead until it reaches and touches the thief.\n\nThere are many others.*\n\n* * *\n\nMEDICINE.\n\n22. A Malay in my employment thus described to me the mode by which he was cured of an illness. The native doctor (bomo) placed a buyong (jar) of water on the floor. The other apparatus were some bertih (parched rice), bras kunnyit (rice made yellow with turmeric), and a few blossoms of the bunga melor. He put a hard-boiled egg into the buyong. The bertih and rice he sprinkled round the buyong, letting some of the grains fall into it. As he did so, he repeated some words in a low voice. He then put the flowers into the buyong and they floated on the top of the water. He then lighted a candle and watched the flame to see if a cure was possible or not. The flame flickered in his direction, so he decided in the affirmative. If the flame had gone the other way, he could not have undertaken the cure. He then placed a gold ring belonging to the patient into the jar. He then made the patient lie down, and placing his hands firmly on the top of his head, he repeated a formula in a low voice, and at the\n\n† See the account of the ordeal by rice in India, As. Res., vol. I; also Journ. As. Soc'y. Bengal, vol. xxxv.\nend of it blew in the rice as if he was blowing away something. This he did three times.\n\nBefore his performances on the patient's head, he went through an operation to ascertain the reason why the patient's semangat * had abandoned him. He took the ring and attempted with it to hook up the floating flowers and grains of bertih. They evaded the contact, and it was not until a further incantation and muttering of charms that one flower and one grain of bertih were hooked up. This betokened that the patient's affections had recently been estranged from someone. (This was true, he had recently quarrelled with his wife.) He made the patient bathe in the water in the buyong and then eat the egg.\n\nHe then pronounced a charm over 20 leaves of sirih and directed that the patient should eat these and no others.\n\nHe then tied the ring round the patient's right wrist with a string made of thread of seven different colours twisted together and prescribed perfect rest for three days. No one was to be angry with the patient, and the latter was not to lose his temper with anyone, but was to remain at home and amuse himself with flowers or any other mild and innocent diversion.\n\nEd.\n\nGAMES AND AMUSEMENTS.\n\n23. Daun tiga'lei.—A Malay game of cards. The following is a description of this game as I have seen it played in Perak:\n\n| Hearts, | Lëkoh. | King, | Raja. |\n|---------|--------|-------|------|\n| Diamonds, | Retin. | Queen, | Bandahara. |\n| Clubs, | Kulalawar. | Knave, | Pékah |\n| Spades, | Sakopong. | Ace, | Sát. |\n\n*Semangat—Vital principle; it would seem to correspond in some degree with the la of the Karens of Burmah and to resemble the leipya (butterfly) of the Burmese. See Mason's Burmah.*\nTo shuffle, *Kiyat*, mengiyat.\nTo deal, *Membawca*.\nTo cut, *Kérat*.\nTo sweep the board, make every one pay,\n*Mengélong*.\n\nThree cards are dealt out to each player. The highest hand counting by pips is that which contains the greatest number of pips after the tens are deducted. Thus a knavo, ten and nine is a good hand.\n\nThe best hand is 3 aces, *Sát tiga*.\nThe next best is 3 court-cards, *Kuda; naik kuda*.\nThe next is nine.\nThe next is eight.\nAll these four hands are known as *térus*.\n\nA hand of three threes is really a good hand, being nine, but it is considered a propitiation of good luck to throw it down (without exposing it) and announce that one is *buta*, in the hopes of getting good luck afterwards.\n\nEach player makes two stakes—*kapala* and *ekor*. They may be of equal value, or the *ekor* may be of greater value than the *kapala*.\n\nThe *kapala* must not be of greater value than the *ekor*; that is called *tual ka-ujona* (*tual=bérat*).\n\nOr there may be a single stake only which is called *podul*.\n\nBetting between players is called *sorong*, or *tuwi*, or *sorong tuwi*.\n\nA pool, *tuwi tengah*.\n\nThe *ekor* stake is only paid to the dealer if he holds one of the hands called *térus* and if a smaller hand is held by a player. Then the dealer takes both *kapala* and *ekor* (*mengélong*). court-cards, *kuda*) is said to be out (*buta*).\n\nAny one except the player on the right of the dealer may cut. The player who cuts looks at the bottom card of those that he lifts and if he thinks it is a lucky cut he accepts it and puts down the cards he has lifted (*pengérat*).\n\nThe dealer then puts the rest of the pack on top of the cut and in his turn lifts a portion of the pack (*pengangkat*) and looks at the bottom card.\nThere are all sorts of names for different cards and combination of cards of various degrees of luck and these are quoted by the cutter and dealer, each declaring his confidence in the luck coming to him by reason of the cutting or lifting of a particular card.\n\nFive of clubs, \\{ Tiang ampat penghulu chelong. \\\\\nChukup dengun gambula-nia. \\}\n\nNine of diamonds, \\{ Burja kachang raja budiman. \\}\n\nTen of clubs, \\{ Gagak sa-kawcan raja di-hilir. \\\\\nSinggah makun pedindang masak. \\\\\nMasak pun lalu muda pun lalu. \\}\n\nAce of diamonds if cut, \\{ Buntui kris Raja Bandahara. \\}\n\nDo. if in the hands of the dealer, \\{ Anak yatim jalan sa'orang. \\\\\nSatu pun tidak marabahaya. \\}\n\nTwo of diamonds, \\{ Semut ginting Che Amat pelak. \\}\n\nTwo of hearts, \\{ Batang jamban. \\}\n\nSix is an unlucky card,—Daun anam jahanam.\n\nNine of hearts,—Hari panas kubang ber-ayer.\n\nA player does not hastily look at his three cards and learn his fate at once, but he prolongs the excitement by holding his cards tight together and looking alternately at the outside ones and last of all at the middle one, sliding out the latter between the two others little, by little. Thus it is left uncertain for some time whether a card is an eight or a seven, a nine or a ten.\n\nA man to whom a court-card, an eight and an ace is dealt (if the eight is in the middle), on finding that he has eleven by the two outside ones, says, for instance, Handak kaki tiga, and then commences to slide out out the middle card hoping that it is going to be an eight or at all events a seven (three pips on each side). This particular hand is called lang siput, because it is certain to carry off something.\n\nA man who has just held a winning hand will say, in expressing a hope of continued good luck, “Teman handak pisang surabu, sudah sa-batang sa-batang pula.” (The\nplantain called sarabu is one which puts out fruit from every stem of the perdu about the same time, or one immediately after another.)\n\nI have seen this game or one like it played by Singapore Chinese under, I think, the name of \"Manila.\"\n\nEd.\n\nMISCELLANEOUS.\n\n24.—Page 141 of Maxwell's \"Manual of the Malay Language\"\n\n\"The orlong is equal to 6,400 square feet.\"\n\nOught it not to be—the orlong is equal to 6,400 square yards or 57,600 square feet?—[Yes.—Ed.]\n\nA. B. S.\nSTRAITS BRANCH OF THE\nROYAL ASIATIC SOCIETY.\n\nNOTES AND QUERIES\n\nEDITED BY\n\nTHE HONORARY SECRETARY.\n\nNo. 2. Issued with No. 15 of the Journal of the Society.\n\nSINGAPORE:\n\nPrinted at the Government Printing Office.\n\n1885.\nNOTES AND QUERIES.\n\nHISTORY.\n\n25. Perak and Penang in 1829.—The following letter, the original draft of which was given to me in 1879, shews what a good understanding existed between Perak and the Penang Government fifty-six years ago:\n\nFrom Sultan Abdullah Ma'adam Shah.\nTo the Hon’ble John Anderson, Resident Councillor, Penang.\n\n(After compliments.)\n\nBe it known unto my friend, I declare that situated as I am here in Perak I acknowledge first of all the Lord God and next the Raja of Pulau Pinang and my friend; certain it is that it is by the assistance of my friend on all points that I am able to live in Perak as I now do, and my trust in, and affection for, my friend are thus redoubled, without the smallest remains of distrust or suspicion, inasmuch as the source of my happiness is in my friend’s government and in the mercy, compassion and justice which have been bestowed on me, who am weak and poor, and by which my authority has been firmly established for ever. Now I have heard that my friend is about to return to Europe and to quit Pulau Pinang, and when the news was made known to me I was seized with grief and regret at this dispensation of God and the operation of His will upon His servants, for it had never entered my mind that my friend would leave Pulau Pinang. I had thought that as long as I and my friend should live in this world there would be no one else on whom I should depend in this land of Perak. But now my friend is about to depart and the hope that I should continue to hold fast to my friend and surrender myself to his guidance is gone. What adds to my uneasiness is that now I shall have no one to cling to; true there are numbers of\npeople in Pulau Pinang, but they can never be like my friend on account of my want of acquaintance with them. For my friend, on the other hand, I have a pure and sincere friendship to my lasting contentment, and since my friend has protected me, I have had no trouble or difficulties whatever. But now, by the will of God, the affection between us is to be severed. When my friend returns to Europe, I shall be like a man who wakes in the middle of a dark night and finds that his light has gone out; or again, like plants in a garden which, however hot the weather may be, are watered by the dew which falls at early dawn and which are thus saved by the dew from withering away; or, once more, like the wind named sauwar-el-maknun [“the unseen visitor”]* which comes forth from heaven and descends upon this earth at dawn, whereupon all the flowers in the gardens of the world burst forth in blossom. When the wind sauwar-el-maknun returns again to heaven, the scent of all the flowers follows it and it is sweetened with their odour. So is it with myself and my friend: when my friend is no longer here, I shall have lost the power of walking, and there will be no dew to fall upon the garden. But since it is the will of God, what more need I say, for my friend knows that I keep his injunctions, and that at no time, day or night, can I be called forgetful of his kindness. God knows my heart and knows the distress I am in, having no other place to carry my complaints to when I am in trouble. This is what I make known to my friend. I send no present with this letter.\n\nWritten on the 2nd Zu'l-hajjah A.H. 1244, on Thursday afternoon (June, 1829).\n\nEd.\n\n* * *\n\n* Zauwar (adj. from زوار) visitor.\n* Maknun (part. pass. of كن) concealed, secret, hidden.\n26. Visit of Lord William Bentinck to Penang in 1828.—Among the drafts of correspondence of Sultan Abdullah Ma'adam Shah (father of the present Regent of Perak, Raja Muda Yusuf) from which the foregoing letter has been translated, there is a curious one in which the writer excuses himself for not having been to Penang to see the \"Raja of Bengal.\" He states that he had intended to come, but only heard too late, from one Nakhoda Ahmad, that the Raja Benggala had come to Penang with a steamer and had gone away again after a stay of three or four days. This letter is dated the 11th Shawal, 1242.\n\nEd.\n\n* * *\n\n27. The Dutch in Perak.—In a paper with this title, published in 1883,* no mention was made of a treaty of 1747, the fact of such a treaty having been made having only come to my notice later.† I have not hitherto called attention to the testimony borne by the Malacca records to the fidelity of the Perak historian whose native chronicle was so often cited in the paper mentioned. In \"Arifin Albarak\" (ارفین الباراق) the Dutch Commissary, who visited Sultan Iskandar twice (between 1756 and 1765?), it is easy to recognise Mr. Ary Verbrugge, who appears from the Malacca records to have been sent to Perak in the years 1746 and 1747 (during the reign of Sultan Modapar Shah).\n\nEd.\n\n* * *\n\n28. Ancient Chinese Colony in North Borneo.—No. 14 of the Journal of the Straits Branch of the Royal Asiatic Society contains Mr. E. P. Gueritz's sketch of British\n\n* No. 10 Journ., Str. Br., R.A.S., p. 215.\n† See No. 11, p. 170.\nNorth Borneo. Describing the population, he states \"that\n\"the natives use a plough and harrow and in this respect are\n\"superior to the other natives of Borneo,\" although the use of\n\"these implements is said to have been introduced by the Chinese\n\"who, report tells us, at some remote period thickly populated\n\"North Borneo.\" This reminds me of the very interesting\nwork of Mr. W. P. Groeneweldt, formerly a Chinese Inter-\npreter in the service of the Netherlands Indian Government,\nentitled \"Notes on the Malay Archipelago and Malacca com-\npiled from Chinese Sources,\" which was published at Batavia\nin 1877, and appears in vol. 34, part 1, of the Transactions of\nthe Society of Arts and Sciences at Batavia.\n\nAt pp. 101-103 are to be found a description of \"Brunei\"\ntranslated from the Chinese, with the remarks of the able trans-\nlator. Perhaps residents in British North Borneo may think\nit worth while to ascertain if it is a fact that in former times\n(in the fifteenth century) a Chinaman reigned there as King; if\nnear the King's palace the stone, with a Chinese inscription,\nmentioned in the narrative, is still to be found; and also, which\nis the particular Dayak tribe in the interior that claims to this\nday to be descended from the Chinese who emigrated in great\nnumbers to that country so many hundred years ago.\n\nM. S.\n\nLANGUAGE.\n\n29. Management of Elephants.—The Malays of the Peninsula\nhave probably acquired their knowledge of the art of elephant-\ntaming from the Siamese. In the Sajarah Malaya, the use of\na particular word of command is ascribed to a Siamese deri-\nvation.* The use of the elephant has, however, diminished in\nthe Peninsula, and is likely further to diminish as the country\nis opened up, unless the Indian system of stabling the tamed\nanimals and feeding them in captivity is adopted, instead of\nthe Malay practice of turning them out, when not wanted for\nwork, to shift for themselves in the jungle, simply hobbled by\n\n* See Leyden's Malay Annals, p. 138.\nthe forelegs like donkeys on an English common. This, of course, means destruction to crops of sugar-cane and Indian corn if there be any within reach, and becomes an intolerable nuisance in cultivated districts. Under Malay rule, elephants were in use in Malacca and d'Albuquerque describes the King of Malacca in 1511 as fighting on an elephant in defence of his town. In Province Wellesley, too, when it was part of Kedah, and even after the cession, before roads were made, these useful animals were formerly employed. But in both these provinces elephants have long ceased to be seen.\n\nIn Kedah, Patani, and in parts of Perak elephants are still valuable and indeed indispensable means of transport, and the natives of these States possess a good deal of information, some of it reduced to writing in small treatises, on the subject of the trapping and taming of elephants and their treatment in health and disease. Travelling at different times in the first and last of the three States above-named, I have noted down the words of command used by elephant-drivers, and now subjoin them. The majority of them are not Malay, but may be corrupted Siamese. The words used in Kedah and Perak are not the same.\n\nEd.\n\nWords of Command used in driving Elephants in Perak and Kedah.\n\nPerak.\n\nTee-tee ... Stand still! Keep quiet!\nTu-hu-tu-hu ... Go back! Move backwards!\nDee-dee ... Come close! (Used in calling the elephant.)\nHee-hee ... Go on!\nUmbú ... Go to the right!\nKlong ... Go to the left!\nKohoi-kohoi ... Go slowly! (p. 32, n.)\nChén ... Go carefully! (Used where the road is slippery, or going down a steep bank, or through a deep swamp.)\n\nRabah ... Feel!\n\nKwét ... Pull down! (Used in directing the elephant to remove any stick or branch obstructing the path.)\n\nOnh ... Push! (Used in ordering the elephant to push down a perpendicular obstacle, as a post, or tree, or stump).\n\nHoh-hoh ... Stop!\n\nRiap ... Approach! (Used in ordering an elephant to go alongside of a Malay house or pelantar. He will bring his head close if riap is said. For the hind-quarters the order is Riap buntut.)\n\nTērum ... Kneel down!\n\nTērum puan ... Kneel down lower!\n\nTah ... Get up!\n\nPaha'mbd ... Keep clear of timber on the right!\n\nPaha klong ... Keep clear of timber on the left!\n\nChelit ... Let the howdah slip off! (The gambala is on the ground.) At this word of command the animal lowers his hind quarters and lets the rengka slip over his tail.\n\nTā-i ... (Employed to make the elephant stop switching his tail and striking the occupant's pants of the rengka with it.)\n\nCheng ... Put the right foot into the hobbles (sengkāla).\n\nCherot ... Same for the left foot.\n\nChang ... Lift the foot! (To have the sengkāla taken off.)\n\nTee-tee ... Don't! (Used when the elephant takes up\nwater or saliva in his trunk and sprinkles his sides with it.)\n\nSan ... Let go! (Used when the animal squeezes the gambala's legs with its ears behind which he sits.)\n\nGuling ... Roll! (in the water). An elephant being bathed will roll when told to do so and will get up when bangket or tah is said.\n\nKot, kot, kot,... (Used in driving an elephant home if, when the gambala has found him, he is too dirty and muddy to be ridden. He will go straight home in front of his gambala at this word of command.)\n\nRiang-riang. ... Let go! (Used when an elephant objecting to have the tali rūt (rattan rope passing under the belly) fastened, puts up one of his forelegs and presses it against his body to prevent the rope from being pulled tight.)\n\nKedah.\n\nGo on! ... Hee.\nCome! ... Chee, Cham.\nStop! ... Hoh.\nTurn! ... Dao (same for right or left.)\nKneel down! ... Tērum.\nGet up! ... Puan.\nMove aside! (to avoid a tree), Pei.\nCome close! ... Chit.\nPull down! (a branch), Ao-būn.\nPush down! ... Kwēt.\nTake care! (e.g., in crossing a bridge.) Koy.\nFeel! (with the trunk) Klam.\nClimb! ... Kot.\nStoop down! (head only, to let a man get up.) Lūt.\nLift up one leg! (to let a man get up.) Song.\nDon't! ... Dei.\nDon't whisk the tail! Tū-i.\nTrumpet! ... Riak.\nSalaam! (by lifting the trunk.) Wei.\nPick up! ... Jün.\nSwim! ... Chú.\n\nLAW.\n\n30. The Menangkabau Code.—A collection of regulations, said to be the undang-undang, or laws, of Menangkabau, which embody the hukum 'adat, or local and customary law, as opposed to the moral and religious law of the Koran, came into my possession in Perak some years ago. Newbold,* speaking of the Menangkabau Code, says that he failed to procure a copy of it, and was inclined to believe that it has been orally handed down and preserved in the family of the Mantri or the Raja 'Adat, to whom the administration of the laws is usually confided.\n\nIt is not likely that the version found in Perak is the complete Menangkabau Code. Malay copyists are so unscrupulous and dishonest in the matter of transcription, that it is seldom possible to vouch for the authenticity of a manuscript. If not complete, however, it is certainly a selection of regulations from the laws of Menangkabau, for the peculiar constitution of that kingdom is often alluded to. The collection consists of ninety-three sections, and embraces a variety of matters. Its compiler must have been a zealous Muhammadan, for it abounds in quotations from the Koran and in instances of that dogmatic use of numbers in analysing subjects and propositions, virtues, vices, qualities and offences, which conveys an idea of wisdom to the Oriental mind, and has done so since the days of Solomon.†\n\nThus, Siti 'Ayeshá, wife of the Prophet, is quoted as an authority for fixing the qualifications of a wise man at ten. In another place seven are enumerated, and a like number for\n\n* British Settlements in the Straits of Malacca, II, 219.\n† Proverbs, c, xxx v. 15—31.\nthose of a fool. The virtues to be cultivated by warriors (hulubalang) are five, and so are the tokens of rank and breeding in youths, and so on.\n\nThe 13th section states that in the year of the Hegira 1180, on Monday, the 8th Shawal, at the time of afternoon prayer, the Yang di per Tuan of Gunong Hijau, Raja of Pagaruyong, was pleased to bestow these laws, both for land and sea, on the four Sukus, namely the Imam of Sungei Trap, the Kazi of Padang Genting, the Endomo of Surawasi, and the Makhdum of Nambak (Chiefs and districts of Menangkabau).* Thence they were distributed through all the districts and villages of Menangkabau, and throughout the length and breadth of Pulau Percha,† as a safeguard against all evils in this world and the next. \"Their origin is from the Datoh of the four Sukus, Perpatih Sabatang by name, that is to say, the portion which comprises the customs which are followed and imitated as precedents. The law of God, on the other hand, came down to the Tumunggong, who is famous in Menangkabau for having established the law of God, just as Datoh Perpatih Sabatang established the customary law.\n\nThese undang-undang are full of wise saws which are quoted commonly in Perak, and, I have no doubt, in other Malay kingdoms also, as proverbs. In fact, the language used is often so excessively metaphorical that it becomes almost impossible to translate. Here is a favourable specimen:—\n\n\"In accordance with what has been said, if there be a Magistrate who upholds the laws in a country or village or seaport, so that the place is preserved everlastingly from disturbance, in the name of God suspect and distrust him not. If he keep faith, if he hold property, if his conversation be in accordance with the customs, if he weighs evenly, if his orders be just and proper, if the chupak will some day fill a gantang, if he be consistent as the morai which says kicha-kichau, or the fowl which says ku-ku, the note being always the same though the meaning may vary, that is what is meant by just. In the name of God who knoweth.\"\n\n* For a sketch of the state of Menangkabau and the titles and position of the various chiefs, see Moor's Notices, p. 113.\n† Sumatra.\nThere is a great want of arrangement, penal provisions being scattered here and there among moral disquisitions on conduct and duties. This, among other circumstances, makes it probable that the compiler has only selected such passages as suited him from a larger work. The Perak Malays, for some reasons which I have been unable to discover, call this collection \"Undang-undang dua-belas\" or \"the twelve laws.\" Its provisions are undoubtedly ancient, and the comparatively modern date quoted above must be taken to be the date of the distribution of copies to Chiefs by a particular Raja of Menangkabau, not the date of the compilation itself.\n\nEd.\n\nFOLK-LORE.\n\n31. Legends of Petrified Ships.—In connection with the legend of Changkat Rambian told by the Editor in the 1st number of Notes and Queries (p. 19), attached to Number 14 of the Journal, I may mention a few similar legends I have come across from time to time.\n\nIn 1879, when travelling in Johor, I was informed that Gûnong Panti had once been a ship (its long ridge with abrupt fall at the western end readily suggests the idea of a vessel keel upwards), that an anchor and rope were to be seen on the summit, and that it was in some way connected with Na-khôda Râgam, how, I could not learn from my informant. There was also some tradition that when hâlu (the source of the river) became hilir (the lower portion) and vice versa, the ship would re-appear.\n\nIn respect of Gûnong Jânîng, a Johor mountain near the Pahang frontier, tradition relates that in times of flood an anchor attached to the mountain by a rope makes its appearance to prevent the mountain being carried away.\n\nSome way up the Moar river, above Kuâla Gêmêncheh, is a rock called Bâtu Jong, resembling a vessel, and said to have once been one, but I am not acquainted with the details of the legend.\nI may also, in this connection, draw attention to the way in which, in the legend about Nakhôda Râgam (p. 39), various parts of his vessel are said to have been converted into the islands lying off the coast of Malacca.\n\nD. F. A. H.\n\n* * *\n\n32. The Berik-Berik or Baberik.—Lately in Malacca, I have observed large flocks of the bird called bérik-bérik passing over the flag-staff every evening.\n\nThe superstition of the Malays about them is referred to in No. 7 of this Journal (page 14) in Mr. Maxwell’s paper on Folk-lore.\n\nThe Malays here call them “the dogs of the Spectre Huntsman” (anjing hantu pemburu).\n\nThey are supposed to cause sickness, especially when met with at night. The sickness is of two kinds—one in which the sufferer vomits leaves, (!) and which is rapid and fatal in its action; the other in which blood is vomited, but in this case the patient often lingers some time, though death is sure to ensue sooner or later!\n\nI was told seriously of a man who was struck by their influence when travelling from Ayer Panas to Kësang in a bullock-cart about the middle of the night. He vomited leaves and died in less than an hour!\n\nBoth by night and day they are a sign of storm.\n\nThey cannot be addressed or hailed by night without danger.\n\nI am informed that they are always to be seen in large numbers at the Screw Pile Light-house, which is 12 miles off the coast. They fly about both by night and day, and are easily distinguished by their note, which is peculiar.\n\nI believe that this bird is one of the bee-eaters (Mesopidae) and shall be glad to send a specimen to anyone who will identify the species.\n\nH. T. H.\n33. Malacca Legends of Nakhoda Ragam.—This person-\nage, according to native tradition in Borneo (see Jour-\nnal No. 5, S.B., R.A.S., p. 3 et seq.) was the fifth\nMahomedan ruler of that country under the title of Sultan\nBulkeiah. He gained the name of Nakhôda Râgam,* it is\nalleged, on account of his numerous caprices, but what form\nthey took beyond that of a fondness for travel and con-\nquest, is not stated. He is said to have visited Java,\nMalacca, and Johor, and to have conquered, besides the East\nCoast of Borneo, both Sûlu and Luzon. “His tomb,” says\nSir Hugh Low, in the paper above quoted, “of very ex-\nquisite workmanship in very hard basaltic stone, still\nremains on the hill above the site of the ancient town\n(Brunei); it was probably imported from Achin or Java.”\nThe following legend professes to give an account of the\nmanner of Nakhôda Râgam’s death.\n\nOne day the prahu (vessel) of Nakhôda Râgam was an-\nchored at sea off Panchor (13 miles along the Coast N.W.\nof Malacca), and he was in the cabin, his wife (Putri\nGûnong Lédang, the fairy princess of Mount Ophir) sitting\nby sewing. He teased her, she said: “Don’t bother me with\nyour tricks, I want to sew now, and if I should become\nlata,”† and you were pricked by my needle, you might die.”\n\nNakhôda Râgam, however, did not take warning, and his\nwife became lata, because he touched her in the ribs, and he\nreceived a stab in the breast from her needle, which caused\nhis death.\n\nThe princess then took a precious cloth and wrapped up the\nbody in it for a night and two days, after which the crew of\nthe vessel and the steersman became uneasy, having noticed\nthat the Nakhôda had not left his cabin for some time.\n\n* Râgam (Sansk : raga) means—first, colour, hue; and second,\nthe various emotions—love, joy, sorrow, anger: and so perhaps the\nidea of a capricious or uncertain temper arises.\n\n† For an account of this peculiar nervous condition, which seems,\nwith few exceptions, to be confined to the races of Malaya, see\nMr. O’Brien’s interesting paper in No. 11 of this Society’s Jour-\nnal, for June, 1883.\nAnd one day at noon, when some of the crew went to the ship's well to bale it out, they saw that the water in it was red like blood. Then they stopped baling and went to the cabin, and said to the princess: \"What blood is that in the ship's well?\" She replied: \"That is not blood, I was cooking some spinach yesterday, and spilt the water, which found its way into the well, that is what you saw looking like blood.\" Then the crew went away. About three days later they became aware of an offensive smell, on which they went again to the cabin and asked the princess what it was; she said: \"I killed a rat last night, that is what has caused the smell.\"\n\nThe crew then left her, but began to talk amongst themselves saying: \"The carcase of a rat does not cause this smell, but perhaps Nakhôda Râgam is dead, for he has not left his cabin for several days.\"\n\nWhen the princess found they all knew that Nakhôda Râgam was dead, she began to be uneasy, wondering what would become of her all alone in the ship, and her uneasiness increased when she heard their talk, each man wanting to take her for his wife.\n\nSo, one night she put up her fairy garments, intending to fly away somewhere, and when it was day, she called the crew, and told them to get ready a boat and oars, as she intended to go ashore and bathe; she got into the boat, and the crew rowed her to Têlok Gong * where she landed and where there is a stream called, after her, the princess's stream. When she had done bathing, she called out to the crew to go down and get the boat ready, as she was ready to return to the ship, and while they were doing so she put on her fairy cloak, and flew away to Gûnong Lêdang † (Mount Ophir).\n\n* Têlok Gong is a bay at the foot of a hill some miles further along the coast than Panchor, beyond Pangkâlan Bâlak, which is twenty-two miles from Malacca by road. Some one is said, I believe, to have lost a gong in this bay, but whether it was Nakkôda Râgam's which went down at the time of the wreck, I do not know.\n\n† On making the ascent of Mount Ophir in October, 1881, with Governor Sir F. Weld, we had pointed out to us as Pintu Putri Gûnong Lêdang (the door of the princess of Mount Ophir) a dark\nWhen the crew saw what had happened, they were all plunged into grief; some stood gazing after her, others bewailed their loss; but not till she was lost to sight did they take to their oars and return to the vessel. Then they took the furniture out of her, put it into the boat, and abandoned her.\n\nOne night a storm came up, and the vessel of Nakhôda Râgam was broken to pieces, and all that was in it was scattered about in all directions and was turned to stone. The utensils were turned to stone at Têlok Gong, the ship's well became Pûlau Ûpeh,* the cabin became Pûlau Bësar, † the cleft in the rock a little below a peak to the right of the highest point.\n\nGûnong, mountain. Of the word lêdang, various renderings have been suggested. In connection with its meaning here, a very good native scholar has declared it to mean \"ancient,\" but I have been unable to find any corroboration of this view. Favre's Dictionary gives the meaning, generally, as \"vast, extended,\" and this would very well apply to the wide-spreading spurs which radiate from the central peak of this vast isolated agglomeration of hills; an objection may be thought to lie in the fact that, amongst the Malays, the \"Gûnong Lêdang\" applies only to the topmost peak, but it may very well have been first named from a distance, though every peak has its own name amongst those who live near it. It remains, however, the fact, that I have been unable to obtain any confirmation for this, or indeed for any meaning of the word, and where Malays are entirely ignorant of the origin of local names, it is often found that the aborigines first bestowed them, but I have so far been able to gather no information on the point. As regards the name \"Ophir,\" it will suffice to refer to the note of the Editor on p. 8 of the first number of N. and Q.\n\n* Upih, the sheath of the betel-nut palm, used to make buckets of, and to wrap parcels or letters in. The island of this name now lies about 2½ miles from the port of Malacca, and was probably once connected with the Northern end of the town, i.e., about the time of Albuquerque's conquest of the place, though, within a century after, the features of the coast seem to have materially altered.\n\n† The \"Big Island,\" the largest of the \"Water Islands,\" lying 8 or 9 miles south of Malacca town.\ncooking-place became Pûlau Hânyut,* the cake-tray became Pûlau Nangka,† the water-jar became Pûlau Undan,‡ the incense-burner became Pûlau Sërimbun,§ and the hen-coop became Pûlau Bûrong.||\n\nAs regards the vessel of Nakhôda Râgam, subsequent to his death, there is another account, as follows:—“When Mâlan ¶ Dêwa (an alias of Nakhôda Râgam) was pricked by his wife, the Princess of Gûnong Lédang, with her needle and died, there was a passenger on board endowed with supernatural power, and he refused to assist in the navigation of the vessel.\n\nThen the Juru-mûdi (helmsman) and the Juru-bâtu (who looked after the sounding) reproached this passenger, saying:—\n\n“Dûduk di pîsang goyangang\n“Dûduk di têbû bërlengkar\n“Prût këmbong isi kâtak dëngun ûlar.”\n\ni.e.—“Sit where the plantain can be had by a shake and “the sugar-cane lies in coils, you fill your stomach, but only with frogs and snakes.” (Meaning “your idle behaviour won’t do you any good.”)\n\nThe passenger caused the wind to rise and they sailed but the wind was so strong that both the Juru-mûdi and the Juru-bâtu became sea-sick, and the passenger looked after the sails, and\n\n* Floating or drifting island, about 9 miles south-west of Malacca.\n† Jack-fruit (*artocarpus integrifolia*) Island, lying between Pûlau Bësar and Pûlau Undan.\n‡ Undan or Ondan is a sea-bird. On the island of this name is situated the light-house ten miles S.S.W. of Malacca.\n§ An island about seven miles from Malacca on the way to Pûlau Bësar. It used to be the site of a Leper Hospital, but the inmates have been transferred to Penang. Sërimbun is probably from rëmbun, luxuriant, in respect of plants.\n|| i.e., “Bird Island.” This is a small island lying off the coast near Tëlok Masa, a place about seven miles south of Malacca.\n¶ Probably an error for “Mâlim.”\nin sailing along the shore, he grazed the tree-tops so that the jib-boom cut them to one level as far as Gunong Pulai, and they have never been able to grow otherwise but in a stunted way since.\n\nThere is another version of the same event, which tells how the prahu of Nakhoda Ragam was turned finally into stone, but does not give the locality. It runs as follows:\n\nNakhoda Ragam made his crew promise not to take any notice of or exclaim at anything that might happen. One night, through a violent wind, the vessel went ashore and razed off the tree-tops with her sail, on which the cook came out of the galley and when she saw what had happened, she lost her head and exclaimed: \"Oh, the vessel has got on shore!\" No sooner had she spoken the words, than the vessel was turned into stone.\n\nD. F. A. H.\n\n* * *\n\n34.—Penang Legends of Nakhoda Ragam.—The passage to which the Editor of N. and Q. draws attention in Logan's Journal of the Indian Archipelago as bearing upon Nakhoda Ragam is to be found at p. 168, vol. ii, New Series. As there are not many readers of this Journal probably who have that publication, and as it will likewise serve to make these few notes more complete, it will be as well to insert the passage in question here. It runs as follows:\n\n\"The ancient name of Pulo Pinang was Pulo ka Satu* and thus do they account for its derivation. A famous sea rover in days of yore named Ragam used to trade between Linga (Lingga?) and Kidda (Kiddah) and the adjacent rivers. Falling in with no higher or larger isolated island on the way than Pinang, he named it Pulo ka Satu or single island. The latter name was retained\n\n* I do not remember to have seen this form of the numeral before; tunggal would have been the usual word for the significance indicated in the text.\n\"till the betel-nut was cultivated on the island after the arrival of the British, when the name was changed to Pulo Pinang.* After Râgam's days, and some time before the island became famous as Pulo Pinang, the natives of the opposite coast knew it at Tanjong Panagar from trees of that name,† which grew on the spot where Fort Cornwallis is built. The inhabitants of Province Wellesley speak of Pulo Pinang to this day at Tanjong Panagar or its abbreviation Tanjong. The name may be seen in all the grants of land issued by Government as late as 1800.\n\n\"To Râgam is imputed the names of all the bays, rivers, and points of Pulo Pinang.\n\n\"On one occasion, when off the south-western end of island his kindi (këndi) or water-pot fell into the sea, and it was immediately transformed by the genii of the place into an island which still bears the name of Pulo Kindi.\n\n\"On leaving Pulo Kindi he pulled into a bay, which lies opposite the island, and at the mouth of the river which flows into the bay he released a tame bird called Bayan,‡ and thenceforth the river has been called Bayan Lepas (or the free Bayan).\n\n\"At another time, when off the point forming one side of the above bay, he approached the shore for the purpose of landing. The sea was, however, too rough, and in pulling from the shore his boat was nearly swamped; she rolled and pitched heavily, and as Râgam was steering her off, his exertions loosened the pins from his hair, the knot became undone, and the pins fell into the sea. He therefore named the place \"Gerattah Sangkol.\" §\n\n* It was known by this name at least two centuries before British occupation. See Journ., Str. Br. R.A.S. No. 10, p. 253 n.—Ed.\n\n† Correctly Pinâga; it gives a useful and hard wood, used among other things for carrying-sticks; the leaf is used medicinally.\n\n‡ A sort of parroquet (psittacus Osbeckii).\n\n§ Sanggul, the hair twisted up behind, as by women. Görtak, in this connection shaking, used commonly for \"to threaten.\"\n\"On passing Pulo Bittong,* he encountered a heavy gale, and on passing a point of land a short distance beyond the island, he perceived his wife sitting pale with fear, so he called the point 'Puchat Muka,' or pale-faced.\"\n\nIt is probable that these legends, or some of them, are ancient, and that, the name of the hero originally connected with them having been lost, that of Nakhôda Râgam as a noted traveller and conqueror has been substituted.\n\nThe legend of \"Gërtak Sanggul\" (unless there is a slip here in the legend, and we should read \"his wife\" instead Nakhôda Râgam himself), sufficiently points to the hero having been an Indian, as no Malay fastens his hair up behind with or without pins, or keeps any to be fastened up, with the exception of the Dato' of Johol, that I ever heard of.\n\nD. F. A. H.\n\n* * *\n\n35. Mantra Sandaran.—Devout Malays sometimes, on going to bed, commit themselves to the keeping of the angels during the dark hours of the night, repeating an invocation which reminds one of the homely verse, familiar enough in England (in which the four Evangelists are introduced to aid the rhyme, but to the utter destruction of the original sense) beginning,—\n\n\"Mathew, Mark, Luke and John,\nGuard the bed which I lie on.\"\n\nThe version in use among the Malays runs as follows:—\n\nEs-salâmu 'aleykum, Hei! Jibrail, Mikail, Israfîl, Azrail, kara mukatibin jahilin sefilin jaga-lah angkau sakalian jangan di-béri binchana sakalian jin dan manusia numpir kapada jasad-ku; ghair-lah aku didalam kandongan kalimah. La' ilaha illallah Muhammad errasul Allah.†\n\n\"Peace be on ye, O! Gabriel, Michael, Israfîl and Azrael, ye who free us from ignorance and wretchedness.\n\n* Bêtong, a large variety of bamboo.\n† This is called a mantra sandar-an,—a spell to obtain protection.\nGuard me, all of ye, and let no evil influences of devil or man approach my body! I take shelter within the enclosure of the attestation. There is no God but God and Muhammad is the Prophet of God.\"\n\nEd.\n\n* * *\n\n36. Legend of Toh Kuala Bidor:*—Once upon a time, a poor fisherman (a native of Pasei in Sumatra), who had emigrated to the Malay Peninsula, lived with his wife on the bank of the Perak river. He used to trap fish in the river with all kinds of contrivances (bélát, gerogok, bubu, etc.), but this hardly enabled him to earn a livelihood, and he and his wife were so poor that they only had one garment between them, and when one went out, the other was obliged to stay at home inside the mosquito-curtains. The tide in those days used to reach Bundar Tuah, and it was near this place that the husband used to go fishing. He noticed repeatedly that his fish-traps had been interfered with; more than once he found a bubu (basket-trap) that he had set, taken up and thrown on the bank, or his bélát (stake-net) opened and empty. So he determined to watch. He accordingly squatted down in the water and hid his head under a kēladi (calladium) leaf. After some time, a Jin clothed in a green robe like that of a Háji and wearing a green turban came down to the water. The fisherman immediately dived, caught the Jin by the feet under water and then rising secured\n\n* See the legend of BADANG, the strong man; Malay Annals, p. 53; Journ. Ind. Arch., V, 248. Légendes et traditions historiques de l'Archipel Indien (Devic), p. 75.\n† See the legend of CHE PUTEH JAMBAI—No. 9 Journal, Straits Branch, R. A. S., p. 23.\n\nKain itam muri panjang ampat,\nTarik ka-atas di-bawah ter-buka\nTarik ka-bawah di-atas ter-buka.\n\n\"A black muri cloth four cubits in length, so scanty that whichever way you pulled it, there was a deficiency to be covered in the opposite direction.\"\nhim. \"At last,\" said he, \"I have caught the thief who steals my fish: it is you have taken up my basket-traps and opened my weirs.\"\n\n\"Don't hold me,\" said the Jin.\n\n\"Why not?\" retorted the fisherman stoutly, \"I am a very poor man and yet you treat me like this.\"\n\n\"Let me go,\" said the Jin, \"and I will give you whatever may be the desire of your heart.\" When the fisherman had wished for some relief in his poverty, the Jin said \"Swallow this\" and spat into the fisherman's mouth.* Then he said \"You will be the greatest chief in Perak and your descendants for seven generations will be prosperous.\"\n\nAfter this the fisherman prospered and grew rich and was eventually promoted to be Laksamana of the country. He was called by the people Toh Kuala Bidor, from his residence at the mouth of the Bidor River. The children of the present Laksamana, Datoh Muhammad Amin, who is a state-prisoner at the Seychelles, claim to belong to the seventh generation in direct descent from Toh Kuala Bidor.\n\nEd.\n\n* * *\n\n37. Gelegak nasi.—This is the name of a kind of shining worm supposed by Malays to frequent tin-fields and to make a bubbling noise like a pot of boiling rice.\n\nEd.\n\n* * *\n\n38. Serawa langut.—\"The bread of disappointment.\" (Serawa, a sweet dish made of plantains, sweet potatoes or breadfruit: langut, to watch expectantly). A Malay who has been to a house where he expected to be entertained, and has had\n\n* See the legend of Nenek Kemang, Journal, Straits Branch, R. A. S., No. 14, p. 309.\nto come away hungry will say that he has eaten \"serawa langut.\"\n\nEd.\n\n* * *\n\n39. Magic Circle.—The efficacy of a line or circle under some circumstances in keeping off evil influences, is believed in by the Malays. In Perak a spell known as 'ilmu baris Laksamana' (said to be borrowed from the Hakayat Sri Rama, the Malay Ramayana*) consists in tracing a line on the ground, a prescribed formula being at the same time repeated. No enemy, wild beast, or spirit can cross this line.\n\nEd.\n\n* * *\n\n40. Legend of Kubang Aji.—Kubang Aji is a deep pool in the Perak River near Belanja; it is famous for its fish. In the days when the sea covered a great portion of the tract through which the River Perak now runs, there lived a Sakai named Si Aji who adopted the manners and customs of the Malays. He went on a trading voyage in a ship of his own, and when he returned he anchored off Sadang (now a village many miles up the river, but then a sea-port). As he lay asleep in the cabin, he was wakened by some of his men, who said that his father and mother (Sakais) were asking to see Nakhoda Aji. The old people were already on board, bringing with them various dishes of such food as aboriginal tribes delight in—roast monkey and so on. The Nakhoda, seeing that he was put to shame before his Malay seamen, denied his parents, and ordered them on shore, saying: \"Do you think that my mother is a Sakai?\" As they went on shore, the\n\n* See the passage (quoted in Marsden's Grammar, pp. 176, 179), where Laksamana describes a circle round the house in which he leaves Sita Dewi, in order to protect her from Mahanja Rawana.\noman called out to him: \"Yes, you are my son,\" and her husband cursed him, saying: \"If you are my son, may your ship be wrecked.\" As this curse was pronounced, the woman turned away, and there came a waterspout, and the ship foundered. Two trees (pokok pauh) used to be pointed out at adang, one facing the place where the ship had been moored and the other turning away from it, which were supposed to be the metamorphosed Sakais.\n\nEd.\n\n* * *\n\n41. Legend of Pulau Tunggal.—When the sea covered Perak, leaving only the tops of hills and mountains dotted about over the expanse of ocean, like ant-heaps in a plain, there lived on one of these island-summits a chief called Datoh Pulau Tunggal, his island being the top of the mountain now known as Bukit Tunggal. He is celebrated to this day in Perak for having discovered the secret of perpetual youth. Coming home hungry one day, he called for his dinner, and his wife set before him a dish of rice. When the cover was removed, behold, the rice was as black as the crow's plumage! The slave-girl who had cooked it was summoned angrily by the hungry chief, but she vowed that she had put no poison in the pot, and produced, as a possible explanation of the phenomenon, a wooden spoon* fashioned out of a stick of the black lagundi (vitex trifoliata),† which she had used in stirring the rice. The Datoh, who knew that the lagundi has valuable properties, was satisfied, and ate up the\n\n* Kuay, a wooden stick sometimes used instead of a spoon to take rice out of pot or bowl.\n\n† There are many Malay stories in which the lagundi, endowed with mystic properties, plays a part. Forbes found one of these as far east as the island Buru. There, the natives in the vicinity of Lake Waikolo say that, at certain periods, a lagundi tree suddenly grows up in the centre of the lake, its appearance being accompanied by fearful storms of wind and waves and the terrified cries of the birds that crowd its margins. On the subsiding of the storm, the gundi is found to have disappeared.—Forbes, Eastern Archipelago, 405.\nrice, black as it was. After this, he lived to an unprecedented age, and it is said of him that, periodically, when the symptoms of old age would begin to appear, and to ordinary observers he would seem to be about seventy years of age, his teeth would drop out and his white hair would fall off, to be replaced immediately by new teeth and black hair, and his youth would be renewed again. When and why he at last died, no one can say, but believers in the virtues of the *lagundi itam* declare that his death happened *not so very long ago*.\n\nEd.\n\n* * *\n\n42. **Sang Kelembai.**—A legendary personage of this name is connected with various myths in the Malay Peninsula, *e.g.*, the story of the mountain *Gunoung Bubu* in Perak (see Malay Proverbs, Journ. Str. Br., R.A.S., No. 2, p. 145) and the legend of the river *Pelang-putus* in Johor, Id., No. 3, p. 98.\n\nFurther contributions to the folk-lore on this subject are invited.\n\nEd.\n\n* * *\n\n43. **Origin of Orchids.**—Malays say that trees, shrubs, corn, grass, &c., were planted by Nabi Noah. He filled the world with them, and Nabi Tuakal, who came after him and planted ferns and orchids, could find no room for them except on the trunks and branches of trees and on the uneven surfaces of rocks, where they still grow.\n\nEd.\nSOCIAL CUSTOMS.\n\n44. The Malay Howdah.—The contrivance placed on the back of an elephant to accommodate the persons to be conveyed is a pair of rattan panniers slung across the animal's back by stout cords. They rest on a pad composed of hides or other material. When women or persons of rank are carried, a dome-shaped hood, or cover, is placed over the panniers. The following are some of the terms used in Perak in connection with elephant riding:\n\n* Rengka (Perak) or Rengga (Kedah) the panniers.\n* Chërëmat, the rattan rope which fastens the two baskets together in front.\n* Sënam, the hide which serves as a pad.*\n* Këdûn, a mat or gunny which goes under the hide.\n* Sëmpëna, a rope which is passed under the tail, and serves as a crupper.\n* Tali rût,† a rope girth or belly-band.\n* Sûsû rengka, the portion of the framework to which the rope girths are fastened.\n* Tongkat, the frame.\n* Dâgû, the rim.\n* Rëntët (Kedah), the rattan cord slung round the elephant's neck which the gambala holds between his toes.\n* Kop or kap, the hood or cover.\n* Sabkap (Kedah), a particular kind of covered rengga.\n* Sëngkâla, hobbles.\n* Riang, loose or uneven; said when from an injudicious distribution of weights one pannier is higher or lower than the other.\n* Kërëtok, a wooden bell slung round an elephant's neck.\n* Kuasa, a goad.\n\n* In Kedah, bark (beaten till it is soft) is generally preferred to hides; this bark is from a tree called sanai.\n† Rût is evidently the primitive word from which pérût, the belly, is the derivative.\nPéresang, padding composed of leaves and branches, placed in the panniers to make a soft seat.\n\n* * *\n\n45. Fighting Dress of the Malays.—The fighting jacket of the Malays usually has no sleeves. One kind is properly embroidered with pious words or sentences and is called kalambu rasul Allah, \"the Prophet's bed-curtain.\" It is supposed to protect the wearer from danger. Another kind is known as leher baju, because it is made of forty-four remnants left in cutting out the necks of forty-four ordinary jackets. These patches must be sewn together by seven maidens on seven consecutive Fridays, and the jacket thus made will be pelijas, or invulnerable.\n\n* * *\n\n46. Malay Superstitions.—If a person visits a burying place without wishing the buried person happiness,* he will come to some harm ere long. A case is cited of a white man who visited a kramat without wishing the buried person happiness; that night he suffered from fearful dreams, and in three days he died.\n\nWhen a person is sick, it is the custom in some places to offer incense, and sometimes food, at the grave of a celebrated person; should the sick man recover, he hangs a flag like a small pennant near the grave stone.†\n\nOn the banks of the Johor river, a white flag is placed\n\n* The usual formula is \"Salam 'aleykum Datoh Kramat.\"—Ed.\n† See No. 2 of the Journal, Straits Branch, R.A.S., pp. 237, 238. Among the Malays, holy places are hung with rag (panji-panji) left by votaries. Rag trees are similarly known in India, Persia, Ethiopia, America, and Western Europe, Prim. Cult, II, 150. As to Persia, see Gill's River of Golden Sand, II, §6.—Ed.\nat the end of a kelong to keep away the spirits that would otherwise frighten the fish away.\n\nIn the time of a great sickness in a lampong, it is believed that a spirit—Sheitan or Iblis—has possessed the place. To free the place from the demon, a small ship is made, fully rigged and fit for sea; in it several kinds of food are placed. It is then exhibited in some public place, and the women and children sing a kind of incantation. The same night it is taken out to sea by the chief men of the kampong, a light is placed in it, and, the rudder being fixed properly, it is sent drifting away, bearing in it the evil-spirit that had caused the sickness. No persons but those in charge of the vessel are supposed to leave the kampong that night. The expenses attendant on preparing the vessel are met by a general levy on the inhabitants of the place infested.*\n\nG. C.\n\nGAMES AND AMUSEMENTS.\n\n47. \"Chai Mui,\" (Hok-kien \"Hoah-koon\").—The following description of this game has been furnished by a Chinese inhabitant of Singapore:—This game is called Ch'ai Mui (猜枚 pledge in cups by guessing at fingers held up) in Cantonese. The numbers shouted, 11 in number, are 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, and 10. The 0 is called Tin Shau, and the 5 is sometimes omitted by the Cantonese. The game can only be played by two persons. It is the number of fingers that is guessed. For instance:—\n\nI.—A and B are playing this game. A holds up 5 fingers and shouts the number 7, and B 2 fingers and shouts another of\n\n* Such a boat, or raft, is called lanchang in Perak. One was secured on the Perak river soon after the arrival of British troops at Kuala Kangsa in December, 1875, and caused much amusement in the camp. I have seen a similar ceremony carried out on a large scale by the Chinese community in Malacca.—See also No. 12, Journ., Str. Br., R.A.S., p. 231.\n\nED.\nthe 11 numbers; $2+5=7$ fingers, the number $A$ shouts, therefore he wins the game.\n\nII.—$A$ holds up his fist (no fingers) and shouts the number 2. $B$ also holds up his fist but shouts Tin Sháu (nought). Hence $0+0=0$ finger, the number $B$ shouts, therefore $B$ wins the game.\n\nIII.—$A$ holds up his fist and shouts the number 4, and $B$ holds up 4 fingers and shouts the number 5 or 6 or any of the 11 numbers except 4, then $A$ will win the game for $0+4=4$ fingers, the number $A$ shouts, or really guesses. But if $B$ also shout the number 4, the game is won by neither of them; it must be continued. The loser has to drink a cup of wine.\n\nGiles, in his \"Glossary of Reference on Subjects in the Far East,\" describes \"Chai Mui\" as follows:—A game played by two persons at a Chinese dinner-party, or on any other festive occasion. The players look each other steadily in the face, and simultaneously extend one hand showing all, some, or none of the five fingers stretched out, at the same time crying out what each thinks will be the sum total of the two sets of fingers thus exhibited. When either succeeds in guessing aright, his opponent has to swallow a cup of wine as a forfeit. Many fanciful formulas, varying in different parts of the Empire, have been substituted for the mere numerals which would sound harsh to a Chinese ear. The following is an example of one of these:\n\n| 心 | ... | one heart. |\n| 好 | ... | two friends. |\n| 元 | ... | three firsts.$^a$ |\n| 四季 | ... | four seasons. |\n| 五子 | ... | five sons.$^b$ |\n| 六合 | ... | six cardinals.$^c$ |\n\n$a.$—First on the list at the three great public examinations.\n$b.$—Alluding to the five sons of Ton Yen-Shan, who all took high degrees.\n$c.$—The six cardinal points—north, south, east, west, above, and below.\n七巧 ... seven changeables.\\(^d\\)\n八仙 ... eight genii.\\(^e\\)\n九長 ... nine long.\\(^f\\)\n十全 ... ten complete.\n\nand\n\n對手 ... hands opposite.\n\nthe latter being used when one player holds out his closed fist and expects his adversary to do the same.\"\n\nIt has been necessary to regulate this game in Hongkong:—\n\"Every person shall be liable to a penalty not exceeding ten dollars who shall utter shouts or cries or make other noises while playing the game known as Chai Mui, between the hours of 11 p.m. and 6 a.m., within any district or place not permitted by some Regulation of the Governor in Council.\"—Hongkong Ordinance, No. 2 of 1872.\n\nW. A. P.\n\n[This is the morra of the Italians, known to the Romans as micare digitis. \"Morra is the pastime of the drinking shop in China as in Italy, and may perhaps be reckoned among the items of culture which the Chinese have borrowed from the western barbarians.\"—E. B. Tylor in Contemporary Review, May, 1879.—Ed.]\n\n\\(^d\\).—The seven pieces of the Chinese puzzle.\n\\(^e\\).—The eight Immortals of the Taoist religion.\n\\(^f\\).—九, nine, here stands for 八, long, in the sense of a long life\n48.—Daun tiga 'lei.—In Note 23, in the first number of Notes and Queries, I find that of the names of the four suits of cards, three are Dutch words corrupted.\n\nRetin for Diamonds is surely the Dutch word Ruiten. The diphthong ui is difficult to pronounce for one who is not a Dutchman and the sound would naturally be rendered something like a in bad or e in bed.\n\nClubs; Kulalawar is the Dutch Klaver or Klaveren. The only change is the conversion of the v into w.\n\nSpades; Sakopong is the Dutch Schoppen. Pronounce sch as sk and the similarity is at once apparent.\n\nThese particulars, not mentioned in the note, may be worthy of being brought to notice.\n\nM. S.\n\n[The Dutch had a small military post in Perak for many years and their commercial intercourse with that State was frequent though not continuous, as long as they held Malacca. No doubt the use of European playing-cards reached the Malays of Perak through the Dutch. See Journ., Str. Br., R.A.S., No. 10, p. 245.\n\nEd.]\n\nMISCELLANEOUS.\n\n49. Armenian Inscription.—The following is a translation of an Armenian inscription upon a tombstone in the old Church at Malacca.—\n\nHail thou, who readest the inscription on my tomb,\nGive me the news; what about the freedom of my people?\nFor which I am very anxious.\nHas there arisen among them a good deliverer and ruler?\nFor above all in this world, I wish this most.\nI, Jacob, the first to come to this place,\nAm of an ancient Armenian family.\nAm son of Shamier Shamirian, whose name I bear.\nI was born in a foreign land, in Julfa* in Persia,\nI am now going to my proper place on earth,\nIn Malacca, in the 29th year of my age,\nOn the 7th July, 1774, A.D.\nI am dying on the ground of which I am owner.\n\n50. Land Tenure in North Borneo.—Rice lands are firmly held and highly priced, descending regularly from father to sons. On a Dusun farmer dying without leaving direct issue, his nearest of kin, immediately on his decease, erects a stone or wooden land-mark, indicating his claim to the land. These are to be met with all over the country, in some cases being elaborately carved, in others representing a human effigy, &c.—The British North Borneo Herald, Oct. 1, 1885.\n\n51. Rate of Speed of Elephant.—Table shewing the distance which a full-grown healthy elephant travels in a given time at its natural pace. The following figures are the mean results of several carefully made observations on a measured level road:\n\n* Most of the Calcutta Armenians come from Julfa, the Armenian suburb of Isfahan.—Ed.\n| Minutes | Feet & Decimals | Equals | Miles | Feet | Decimals |\n|---------|-----------------|--------|-------|------|----------|\n| 1       | 264.90          |        |       |      |          |\n| 2       | 529.80          |        |       |      |          |\n| 3       | 794.70          |        |       |      |          |\n| 4       | 1059.60         |        |       |      |          |\n| 5       | 1324.43         |        |       |      |          |\n| 6       | 1589.33         |        |       |      |          |\n| 7       | 1854.23         |        |       |      |          |\n| 8       | 2119.13         |        |       |      |          |\n| 9       | 2384.03         |        |       |      |          |\n| 10      | 2648.93         |        |       |      |          |\n| 15      | 3973.36         |        |       |      |          |\n| 20      | 5297.79         |        |       |      |          |\n| 25      | 6622.22         |        |       |      |          |\n| 30      | 7946.65         |        |       |      |          |\n| 35      | 9271.08         |        |       |      |          |\n| 40      | 10595.51        |        |       |      |          |\n| 45      | 11919.94        |        |       |      |          |\n| 50      | 13244.37        |        |       |      |          |\n| 55      | 14568.80        |        |       |      |          |\n| 60      | 15893.30        |        |       |      |          |\n\nNote.—To obtain the above results, an elephant should not travel longer than six hours per day, and should be fed before starting.\n\nA. J. L.\nNOTES AND QUERIES.\n\nBOTANY.\n\n52. The Lagundi.—In Notes and Queries No. 2, Straits Branch of the Royal Asiatic Society, page 50, the lagundi is botanically styled *Vitex trifoliata*: the Editor must have meant *Vitex trifolia* as no *Vitex trifoliata* exists. My impression is that the Malayan lagundi, rather than to *Vitex trifolia*, is referable to *Vitex negunda*, and both are reported to possess medicinal properties.\n\nB. S.\n\n* * *\n\n53. The Ipoh Tree.—There is a note under this heading in No. 8 of the Journal of the Straits Branch of the Royal Asiatic Society by Sir Hugh Low.\n\nSince then I have had the good fortune to find a tree in fruit at Muar on the Plus River and collected botanical specimens, which I forwarded to Kew and which were identified as *Anitaris toxicaria* by Professor R. Thiselton Dyer.\n\nThe specimens that were sent by Sir Hugh Low to Kew and which Professor Oliver says were less glabrous than the typical Kew specimens, were young rank shoots from a tree which had been cut down and had sprouted out again. Shoots so produced often differ very much in character from those put forth in a normal manner. The leaves which I sent were only slightly hirsute. There is, therefore, no reason to suppose that the Perak Upas tree differs in any way from the Javan species.\n\nThe juice which was sent by Sir Hugh Low with the leaves was pronounced by Professor Ringer to be \"absolutely destitute of poisonous properties of any kind.\" On recently\nmaking inquiries of the Sakeis of Dipang, Kinta, I was told that the poison soon loses its power, but that if it is heated over a fire, it then becomes as virulent as when first prepared and that it may be revived in this way several times. This explanation removes the apparent contradiction in the statements of many who have seen the poison used, and Professor Ringer's report.\n\nL. W. Jr.\n\nHISTORY.\n\n54. The Stone Age in Perak.—Though neither Malays nor Sakeis seem to possess any traditions about the stone age, yet it is probable that the wild tribes of the Peninsula have not used iron for more than five or six hundred years, that is, since the Malays have been on the mainland; it would be interesting to know if there is any mention of people using stone for weapons in any old Malay manuscripts. Stone implements, principally axes and adzes, are frequently preserved carefully in Malay houses, when they have in a great many instances become much prized heirlooms. I have at present collected twenty-two of these specimens and have deposited them in the Perak Museum at Thaipeng.\n\nA. H.\n\n[There are two drawings of stone implements found in the Malay Peninsula, in No. 16 of L'Homme for August, 1885. (L'age de pierre polie dans la presqu'île Malaise par J. de Morgan).—Ed.]\n55. Letter of the King of Achin to King James I.—A translation of this letter, written in the year 1614, is, according to Marsden, to be found in Purchas. Of this letter, Dulaquier says:—\"Cette lettre se trouve dans un recueil manuscrit de pièces relatives à l'Orient, appartenant à la Bibliothèque royale, et ayant pour titre: Ambassade de Turquie, MS. français, fonds Saint-Germain, No. 778.\"\n\nIs it the original or a translation which is alluded to?\n\nEd.\n\n[Since this was in type I have heard from London that the paper referred to is merely a French translation, probably from Purchas.]\n\n* * *\n\n56. Rembau.—Those interested in this State, an account, of which by Mr. Hervey appeared in No. 13 of the Journal, Straits Branch R.A.S., will find the original Malay version of the Tromba Pusaka Menangkabau, the credentials brought over from Sumatra by Rajah Labu (the last Rembau ruler deputed from Menangkabau), in Dulaquier's Lettres et pièces diplomatiques, Paris, 1845. It is taken from a copy presented by Captain Newbold to the Asiatic Society of Paris. An English translation will be found in Newbold's Straits of Malacca, II, 81.\n\nEd.\n\n* * *\n\n57. Sang Kalembai.—A Kramat said to be that of Sang Kalembai is on Gunong Bujang, Malacca, near the north end of the mountain it is said that there are steps leading up to it.\n\nA. H.\n\nLettres et pièces diplomatiques écrites en Malay, p. 13.\n58. The Title \"Sang.\"—Is the title \"Sang\" of Sakei derivation? Lately there was a Sakei Chief in Ulu Kinta bearing this title, and the Chief of the Dipang Sakeis is called by the Malays 'Toh Sang. Ba' is a common Ulu Kinta Sakei title.\n\nBa' Sa'limpal, a Sakei Chief, is said to have been a great friend of the Kinta Chief, 'Toh Saraja, and to have several times assisted him in his wars.\n\nA. H.\n\n[Sang, I venture to think, is a word of Indian origin. The title is given by Malay historians to heroes and gods, e.g., Sang Sapurba, the first Malay King who, I have endeavoured to show, is identical with Siva.—Journ. R.A.S., XIII, N.S., 403.\n\n\"Sáin,\" in Sind is the \"Sáhib\" of India; philologists derive it from the Sanskrit Srámi, a lord or master.—BURTON, Sind Re-visited. I, 181.—Ed.]\n\nLANGUAGE.\n\n59. Malay Words of Portuguese Origin.—Writing in 1881,* M. ARISTIDE MARRE drew attention to the number of Portuguese words which have been incorporated in the Malay language, and quoted CRAWFORD's authority for the statement that Malay words of European origin are mostly Portuguese, the Dutch contribution being trifling, and the English portion insignificant. He printed in alphabetical order a list of 155 words said to be used in Malay and to be derived from Portuguese, most of them being extracted from l'AVRE's Dictionary (Malais-Français). A selection of these are given below, classified under appropriate headings. It will be seen that the derivation claimed for them by M. Marre is not always beyond doubt.\n\nNautical Terms.\n\n| MALAY | ENGLISH | PORTUGUESE |\n|-------|---------|------------|\n| *Abit | Bitts   | Abitas     |\n| Armada| Fleet   | Armada     |\n| *Ares | Heave up| Avessas    |\n\n*La langue Portugaise dans l'Inde Francaise et en Malaisie; Bulletin de la Société Académique Indo Chinoise, 2me série, tome 1er, p. 45.\n### Nautical Terms — Continued.\n\n| Malay       | English      | Portuguese   |\n|-------------|--------------|--------------|\n| Baluk       | Felucca      | Falua. Spanish *falucca* |\n| *Bomba      | Pump         | Bomba        |\n| Bordo       | Gunwale      | Bordo        |\n| Bornal      | Scupper      | Bornal or embornal |\n| Bossetta    | Box          | Boceta       |\n| *Boya       | Buoy         | Boia         |\n| *Bras, brassan | Brace     | Braço        |\n| *Bulin      | Bowline      | Bolina       |\n| *Falka      | Hatches      | Falaca       |\n| *Falto brassan | Lee braces | Falto bracear |\n| Fusta       | Lighter      | Fusta        |\n| Galei       | Galley       | Galé         |\n| Galioung    | Galleon      | Galeão       |\n| *Lanchang   | Launch       | Lanchão, lancha |\n| Markah      | Mark (on sounding line) | Marca |\n| Pragata     | Large ship   | Fragata      |\n| Ris, ris deri layar | Reef     | Rizes        |\n| Sektan      | Sextant      | Sextante     |\n| Sumaka      | Boat, smack  | Sumaka       |\n| *Trinket    | Foresail     | Trinquete    |\n\nOf these words, those marked with an asterisk (*) may be considered to be regularly incorporated into the vocabulary of Malay seamen. Words like *armada*, *sumaka*, *pragata*, etc., are to all intents and purposes foreign words to a Malay,\nthough *pragata* occurs in Abdullah's autobiography. *Baluk*, having regard to the final consonant, probably came to the Malays from the Arabic *fulk*, and not from the Spanish *faluca* or Portuguese *salua*. Similarly, *sektan* is probably a corruption of the English *sextant* and not of the Portuguese *sextante*.\n\n**Name of the Months.**\n\n| Malay       | English    | Portuguese |\n|-------------|------------|------------|\n| Agostu      | August     | Agosto     |\n| April       | April      | Abril      |\n| Desamber    | December   | Dezembro   |\n| Julu, Djulu | July       | Julho      |\n| Jun, Djun   | June       | Junho      |\n| Marso       | March      | Março      |\n| Mey         | May        | Maio       |\n| Oktuber     | October    | Outubro    |\n| Nubember    | November   | Novembro   |\n| Setember    | September  | Setembro   |\n\nHere the alleged derivation from Portuguese is more than doubtful; January and February do not appear in M. Marre's list. In the majority of the names of the ten months given above, the Malay follows the English closely. The forms *Julu* and *Marso* are not in use among the Malays in the Straits Settlements; Favre gives *March* and *Julay*, and though he gives the word *Agostu* for August, he says it is derived from the English.\n\n**Instruments, Utensils, etc.**\n\n| Malay       | English            | Portuguese |\n|-------------|--------------------|------------|\n| *Alabangka* | Lever              | Alavanca   |\n| *As*        | Axle               | Axe        |\n| *Bandala*   | Cartridge-pouch    | Bandola    |\n| Bandera     | Flag               | Bandeira   |\n| MALAY   | ENGLISH         | PORTUGUESE |\n|---------|-----------------|------------|\n| Bangko  | Bench           | Banco      |\n| Berus   | Brush           | Brocha     |\n| Biola   | Fiddle          | Viola      |\n| Bolah   | Ball            | Bola       |\n| Boneka  | Doll            | Boneca     |\n| Botol   | Bottle          | Botelha    |\n| Dadu    | Dice            | Dado       |\n| Dedal   | Thimble         | Didal      |\n| Furun   | Oven            | Forno      |\n| Garfu   | Fork            | Garfo      |\n| Gas     | Gas             | Gaz        |\n| Horloji | Clock           | Relogio    |\n| Jandela | Window          | Janella    |\n| Koreta  | Carriage        | Carrêta    |\n| Kasrol  | Saucepan        | Casserola  |\n| Lantera | Lamp            | Lanterna   |\n| Marmor  | Marble          | Marmore    |\n| Martil  | Hammer          | Martello   |\n| Meja    | Table           | Meza       |\n| Miskal  | Jeweller's weight | Metical  |\n| Piano   | Piano           | Piano      |\n| Pipa    | Cask            | Pipa       |\n| Piring  | Plate           | Pires      |\n| Roda    | Wheel           | Roda       |\n| Sako    | Bag             | Sacco      |\n| Tinta   | Ink             | Tinta      |\nOf these words, three—bērus, botol and gas—may be regarded as being of English origin and borrowed respectively from brush, bottle and gas, and not from their Portuguese equivalents. The introduction of such words as piano and gas into Malay (if they can be said to be domiciled in that language) cannot of course be ascribed to the period of Portuguese domination in the Eastern Archipelago.\n\n**FOOD, CLOTHING, IMPORTED ARTICLES, &c.**\n\n| MALAY   | ENGLISH    | PORTUGUESE |\n|---------|------------|------------|\n| Beludu  | Velvet     | Velludu    |\n| Berindjal | Egg-plant | Bringela   |\n| Fita    | Ribbon     | Fita       |\n| Kameja  | Shirt      | Camisa     |\n| Kapan   | Coat       | Capa       |\n| Karpus  | Cap        | Carapuça   |\n| Kejo    | Cheese     | Queijo     |\n| Kowelo  | Rabbit     | Coelho     |\n| Kubis   | Cabbage    | Couve      |\n| Lingsu  | Cotton stuff | Lenço     |\n| Mantega | Butter     | Manteiga   |\n| Paong   | Bread      | Pão        |\n| Peniti  | Pin        | Alfinete   |\n| Prada   | Tinsel     | Prata      |\n| Renda   | Lace       | Renda      |\n| Sapatu  | Shoes      | Sapato     |\n| Sariding | Sardines | Sardinha   |\n| Supa    | Soup       | Sôpa       |\nFOOD, CLOTHING, IMPORTED ARTICLES, &c.—Continued.\n\n| MALAY   | ENGLISH | PORTUGUESE |\n|---------|---------|------------|\n| Chapiu  | Hat     | Chapéo     |\n| Tembako | Tobacco | Tabaco     |\n| Terigu  | Wheat   | Trigo      |\n| Tingkal | Borax   | Tincal     |\n| Tuala   | Towel   | Toalha     |\n| Chinela | Slippers| Chinéla    |\n\nOn these words, it may be remarked that berindjal is not a Malay word, though it is to be found in Favre's Dictionary. The Malay word is trong and the word brindjal has been imported into the Straits Settlements from Bengal by Europeans. Sariding is probably the French word sardine, imported into the Straits of Malacca by the agency of English commerce, like biskit for biscuit; it is not to the Portuguese that the Malays are indebted for the former any more than for the manufactures of Messrs. Huntley & Palmer.\n\nIt is unnecessary to extend this list further, but few persons with any knowledge of European history in the Straits of Malacca will agree that polis and pos, obvious corruptions of the English words police and post, are from the Portuguese policia and posta! Englishmen perhaps, will be inclined to believe that mil and menit are more likely to be corruptions of mile and minute than of milha and minuto! So fiskal is probably the Dutch fiscaal (the Dutch establishment in Malacca in former days comprised an officer with this title) and must be subtracted from M. Marre's list of Portuguese words. And kamur, a chamber, is clearly the Dutch kamer, though kamra, the form of the word generally used in British India, is the Portuguese camara.\n\nIt is not likely that polan or pulan, such-a-one, is derived from the Portuguese fulano. It is perhaps preferable to derive it from the Hindustani fulana, both having very likely the same Arabic derivation. And while on the subject of\nHindustani, it may be as well to add that M. Marre would have been more correct if, instead of heading his list \"Malay Words of Portuguese Origin,\" he had described it as \"Portuguese words adopted in eastern languages.\" For, tembako (tobacco), fita, (ribbon), bomba, (a pump), &c., &c., will be found in Hindustani dictionaries, and sapatu, a shoe, is certainly as much Tamil as it is Malay.\n\n* * *\n\n60. Malay Titles in Ulu Perak.—The Malay Saiyids in the north of Perak claim to be descended from the Guru of the first Sultan, Sheikii Hussein bin Jamaludin, who came from Hadramaut. The daughter of a Saiyid in Ulu Perak has the title of Siti, and her son, by a man not a Saiyid, is addressed as Mir, evidently a corruption of the Arabic Amir.* Magat is a title given to a man who is of royal descent on his mother's side, his father being a commoner. I have elsewhere suggested the possible derivation of this word from māgadha, (Sansk.) the son of a Vaigya by a Kshatriya woman. The sons of a Magat bear the same title; his daughters are called Putri. The son of a Putri by a man below her in rank is addressed as Prā Tān. The children of the four Chiefs of the first rank, and their descendants, have the title of Wan.\n\n* * *\n\n61. Malay in Cornell University.—A class in Malay has lately been organised in the University, and commenced by Professor Roehrig, on Monday, September 21st. Malay is the easiest, the most easily pronounced, and the most well-\n\n* Our word Admiral is, probably, derived from the Arabic Amiru-l-bahr, Lord of the Sea.\nsounding of the Oriental tongues, and one of the most widespread and practically useful languages in the world. Its importance for trade and business, and in maritime, consular and commercial relations with the richest and most favoured regions of the East can hardly be over-rated. It is to the East Indian Archipelago what Italian is to the Mediterranean. Professor Roehrig is said to be now busily at work preparing on a large scale a comprehensive Malayan Grammar, Exercise-book and Reader, based on a new plan, and calculated to satisfy the wants of the mercantile agent and commercial correspondent, the scientific traveller, the naturalist, the missionary, the diplomatic or government official, as well as the demands of the literary man, the scholar and philologist. There is now at Cornell University, Ithaca, N.Y., the most extensive and complete Oriental department on the American continent, and that is owing to the steady and continuous efforts and the vigorous exertion of one man, Professor Roehrig, who, after having established here, many years ago, the study of Sanskrit and Arabic, added, by degrees, the modern Arabic dialects, then the Persian, afterwards Turkish, and now the present course in the Malayan language. The attendance at these Oriental classes, though comparatively small, as from the nature of things cannot be expected otherwise, is constantly increasing from year to year; and this in many respects unique department of the University, it seems, will gradually find successful imitations in other institutions of learning throughout America, and promises, in the end, to have yet a very great and brilliant future.—Trübner's Record.\n\nBIOGRAPHY.\n\n62. T. J. Newbold.—Can any one give a complete biographical account of the author of the best work yet pro-\nduced on the Straits Settlements?* He belonged to the 23rd Madras Light Infantry and was Aide-de-Camp to Brigadier-General Wilson, C.B., in the Straits, where he seems to have served for three years (1832-1835). He appears to have been political agent at Kurnool in the Madras Presidency in 1845.\n\nEd.\n\nNATURAL HISTORY.\n\n63. Death from Snake Bites.—Doubts have been expressed whether fatal results have attended snake bites in the Straits. The following notes may help to set this matter at rest.\n\nA boy of about five years old, the child of Haji Mamah and his wife Mentusur, was bitten in the back of the head by a hamadryad, of about six feet long, while going to get water from a stream at Bukit Gantang in Larut. He died in less than an hour after being bitten. The snake was caught and killed.\n\nAt Kampong Krau, a village at the back of Gunong Pondok near Gapis, a woman, the wife of Kanda Rasib, was bitten by a snake, which was not caught or recognised, and died shortly afterwards.\n\nAn elephant, was bitten in the fore foot by an unknown snake. The foot and leg swelled to an immense size, and after repeated suppurations, mortification set in and the animal died. The time between the bite and death was four or five months.\n\nKulop Jeleh of Bukit Gantang was present when his father was bitten in the leg by a small snake about eighteen\n\n*A Political and Statistical Account of the British Settlements in the Straits of Malacca, Murray, 1839.\ninches long known by the native name of *Ular kapak sampah* (a species of the genus *Trimeresurus*).* The leg was much swollen and very painful, but the swelling and pain soon subsided, and he was quite well again in a day or two.\n\nSome months ago a Kling was bitten in the leg by a *Bungarus fasciatus*. He was taken to the General Hospital, Thapeng, and put under medical treatment, and recovered. A feature in this case was that a quantity of blisters formed on the leg near the bitten part.\n\nL. W. Jr.\n\n* * *\n\n64. **The Bite of the Python.**—A large Python which was measured, with the help of some Sepoys to stretch it, and found to be twenty feet long, was brought to the Museum at Thapeng for sale; but as no arrangement could be come to, as to price, with the Chinese owners, it was taken away again into the town to sell, having been nearly five hours in my possession coiled up in an open basket, with only a thin piece of rattan tied round its neck.\n\nAbout half an hour after it was taken away, a man was dragging it along by the piece of rattan, when it seized him by the calf of the leg from behind and held on till it was beaten off with sticks by the by-standers. Its formidable teeth made a large lacerated wound, and the man had to be removed to the General Hospital, and it was three months before he was considered well enough to be discharged.\n\nL. W. Jr.\n\n* [In Cantor's Catalogue the *ular kapak* appears as *Trigonocephalus Sumatranus*. Raffles.—Ed.]\nSOCIAL CUSTOMS.\n\n65. Birth Ceremonies in Perak.—The following account of the ceremonies performed in the household of a Raja in Perak, on the occasion of a birth, was taken down verbatim from the lips of a member of the royal family in 1878:\n\nOn the occasion of the birth of a child in the royal family (Sultan, Raja Muda, or Raja Bandahara) the following ceremonies are customary:\n\nThree or five sages femmes (bidan) are employed. A large curtain or cloth is hung from the roof. It is square and is taken up in the middle and fastened by a chain (gold or silver) from the roof, so that the corners and ends hang down round the bed of the woman in labour. (This is called pondong.)\n\nThe bidan and a number of high-born dames in attendance on the sufferer go inside. If the delivery is protracted (for which a technical word srat is used) it is customary for chiefs to come and ask leave to make vows for her recovery. They say: \"If she recovers I will slay a goat.\" In token of the vow, one of the female attendants ties a ring round the wrist of the patient. If delivery is still delayed, the husband or mother of the princess puts dollars under her back, which are to be given in charity if she recovers. There must be priests and orang ber-hantu present. The former repeat prayers and pious sentences (maghratib). The orang ber-hantu (devil-dancers) perform incantations to keep off devils.\n\nWhile labour is going on, draughts of various kinds are given to the woman to drink, prepared by all sorts of wise people. These beverages are called salusoh. If the child is born quiet and does not cry, the women say it is lemas. Then the master of the house (the Raja or other) orders guns to be fired, gongs to be beaten, and a tremendous noise to be made. As soon as the infant cries, the women commence to sing (ber-dabul). The child is then placed on a small mattress (kasau), on which embroidered cloths folded up are first placed. Its arms are placed behind its back in a peculiar fashion so that the elbows are dislocated. The body is swathed up with a white cloth from the feet to the neck. (This is\ncalled bedong.) A little brush is then dipped in a kind of black ink made of burnt shell cocoa-nut (punggong nior) and the eyebrows, outlines of the nose, chin, &c., of the child are marked in black. A star is put on the forehead, and a spot on the nose. This tracing of lines (which is sometimes done on the stomach of a sick person to relieve pain there) is called rajak by the Malays. The tracing on the infant's face is called tolak Suleiman (Solomon's charm). Up to this time the infant has been tended by the family nurses, who have tended previous infants, or by the women of the household. A suite of attendants is however now procured for it by sending off parties of men (juwak-juwak) to impress nurses in certain kampongs and families which have always supplied them. The women are brought by force sometimes. They are called nanda (short for inangda?) and their husbands manda.\n\nOn the morning after the birth of the child, a salute is fired—nine guns for the child of the Sultan, seven in the case of the Raja Muda, or five for the Raja Bandahara. Well-to-do people then flock to the palace bringing presents of cloths to place on the baby's bed and little pillows, richly ornamented, for his use. No mosquito curtain may be used, but a cloth is strung upon a rattan cane and waved backwards and forwards by a female attendant. One relieves another and it never stops waving (ber-kirap-kirap).\n\nThe next ceremony is bersembah ayer susu. Women of good family who have young children of their own take the royal infant, one after another, and give him suck. Each of her children thus becomes foster brother or sister of the royal infant and they can never intermarry. To have this effect, properly speaking, the royal mother should in her turn give suck to the infant of the foster mother (this is called sempornia-kan sa-susu or ber-balas susu-nia).\n\nThe attendants take it by turns to watch. They sing and wave the fan day and night. When they bathe the child they sing the same strain (ber-dabul).\n\nWhen the child wakes and cries in the early morning about 4 a.m. (dinuhari), the women change the tune, and the air they now sing is called tetak kranji. The pantun is:—\nTetak kranji buat-kan tiang  \nBurong nuri terbang sa'kawan  \nNaubat ber-bunyi hari handak siang  \nBangun ungku mas tempawan.\n\nThis is only the first verse of about ten.  \n*Lagu pengolik* is used when putting the baby to sleep (*perlen-a-kan tidor*).  \n*Ketik anak udang seni* is the name of another tune which is used when feeding the child with pap (made of rice and sugar). One girl carries the child about and another follows with a *sembril* (brass dish) containing the pap with which she feeds the child from time to time. He is fed in this way when about fifteen days old. The rice is pressed with a cocoa-nut shell.\n\nThe following are specimens of the songs:\n\n1\n\nManggusta nama-nia kayu  \nDaun-nia luroh menelentang  \nMahkota Raja Malayu  \nTurun deri Bukit Saguntang  \nDaun-nia luroh menelentang  \nDaun puau di-raut-raut  \nTurun deri Bukit Saguntang  \nKaluar deri dalam laut.\n\n2\n\nDi-ketik anak udang seni  \nDi-tangguh di Tanjong Kling  \nAlang-kah chantik anak orang ini  \nJanggut iya meniéling.\n\n3\n\nIlir deri Sêlan  \nSarat ber-muat padi  \nPuteh saperti bulan  \nKening buntoh taji.  \n\nA great many verses describing all the charms of each feature.\nLandak di terubong\nKijang kena jērat\nPandak kita ubong\nPanjang kita kērat.\n\nThis is the last verse.\n\nAs soon as the swaddling clothes cease to be worn, the child is carried about naked but for a cloth over the abdomen which is called barut.\n\nThe child is named before the umbilical cord is cut. It is cut with a sharpened bamboo (bila or sembilu), or bitten through by the bdan. Sometimes the name of the child is changed (kalih). This is done especially if the child falls ill, an unlucky name having perhaps occasioned the illness. The infant's head is shaved when it is about seven days old. Notice is given that at about 8 A.M., the Raja will cause the prince's head to be shaved (raja handak meniukur putra-nia).\n\nA pretty woman of rank is selected and is placed on the child's kasau with the baby on her lap. A box is behind her and she is surrounded by women. On the petarana (settee) in front of her a silver bowl is placed. The chief women in the palace then commence to shave the child's head taking it in turns according to their rank. Each shaves a little bit. Then the handmaidens strike up a song (tarik nyanyi) called anak gajah jantan and this is the signal for all the men to come forward and put money into the bowl. Hundreds of dollars are thus piled up sometimes. All the women of rank then have to make similar offerings. The inang and penyaroh (nurses) are then appointed and named, and receive dresses suitable.\n\nAfter two or three months another ceremony, placing the infant in the swing (naik buayan), is performed. A transverse pole wrapped round with yellow cloth is fastened corner-wise to two posts of the house and a cloth forming a swinging cot is hung from this.\n\nA taléi (hall) is then built at the river side, it is in two stages, the first level with the shore and the second just under water so that the women sitting on it have the water running over their knees. The child is carried down to the lower platform and the upper one is crowded with spectators. When\nthe child is thus bathed in the river for the first time, all the women sing (ber-dabul) again. A man casts a net below the balei and if he catches fish it is a good omen. There is also a pawang (medicine-man) in attendance who performs certain incantations before the child is put into the water. He throws an egg into the water and recites charms. When the women return to the palace carrying the infant under umbrellas, all the men follow. Offerings are again requisite. The Imam, Khatib, and Bilal, officers of religion, swing the cot and sing a hymn called Dondang Fatimah, after Fatimah, the daughter of the Prophet. Then the women sing the lagu pengolik. The men march in by turns and place some money in the swing beside the child. The proceedings end with a feast.\n\nThere are other ceremonies, duduk jambul (leaving a tuft of hair) and kochah tanah (touching the earth for the first time), but before the latter ceremony there is one called letik kanda or the appointment of youths (kanda), whose office it is to bury the placenta, and who thereby acquire a relationship to the infant ruja.\n\nThe number of kanda is usually twelve or nine in the Sultan's family, nine or seven for the Raja Muda, and seven or five for the Raja Bandahara. They are boys of five or seven years old, of good family. Men of good birth are only too glad to send their sons for this office. The Raja selects the proper number and appoints one to be kapala, or chief, and a second who is called penengkol. The inang and pengasoh wear kain gunchok and carry the end of their sarongs over their shoulders (meniampei or meniandang kain dukong). All the boys are presented with a suit of clothes (persalin turun tiga) consisting of three garments (tungkolok, baju, kain), the istana is gaily decorated (hias) on the occasion. The kapala kanda carries the placenta in a new earthen pot, the mouth of which is closed with a white cloth tied over it (ber-getung ka n patch), others carry sirih, water, sugar-cane, perasap (lighted embers for burning incense on), etc., every one has something. If a child is too small to carry his share, his father carries it for him. The boys are all assembled in the balei. Several elephants are prepared for the procession and their heads and sterns are painted and ornamented with various designs and colours. The head of the\nforemost boy (kapala kanda) is then enveloped in a black cloth. All are placed on the elephants and the procession starts. The foremost boy carries the earthen pot (priuk) on his head if he is big enough, if not his father who accompanies him on the elephant carries it before him. The kapala kanda has the right pannier, the penengkoh the left. A suitable place has been selected for burying the temuni and there it is buried and a cocoa-nut is planted. This cocoa-nut (nior gujah) is the one which was taken to the river on the occasion of the infant’s first bath, which has already been described. On it the infant’s foot first rested when placed in a standing position in the bath. These solitary cocoa-nut trees are pointed out here and there in Perak as the nior gujah of such and such a raja. The procession then returns to the palace. The kapala kanda, whose head and face are still covered with the black cloth, is led up to the infant’s bed and then saying “Om pechak che ungku adek patek” he lifts his black veil and kisses the child. All the kunda are thenceforward regarded as the brothers or relations of the raja. (Many of these details are of Hindu origin. The bones of a deceased Hindu, after cremation are buried in a new earthen vessel, and among the modes of covering the spot where a funeral pile has stood is the practice of planting a tree. The mantra repeated by the chief boy in the procession is probably a corruption of a Sanskrit formula. Many Malay mantras commence with the syllable om, the mystic name of the deity among the Hindus, a word which a Malay pawang once explained to me to mean yang jadi di-dalam sendiri, “that which originated within itself”).—Ed.\n\n* * *\n\n66. Sacred Fire.—In the Netherlands India news published in the Straits Times of February 8, 1886, there is a statement which appears worthy of record among curious popular customs. Speaking of the continued eruptions from the Bromo volcano it is stated:\n\n“Whenever an outburst takes place, the natives around, as soon as fire comes down the volcano, kindle therefrom the\nwood they use as fuel in cookery. The fire which the natives so far have used in their cooking-places was obtained from a previous outburst in 1832. Whenever this fire in the heaths went out from any neglect, it was never kindled anew by lucifers or other means. In such cases fire is obtained from the nearest neighbours.\"\n\nA. K.\n\n* * *\n\n67. Pelas Negri.—In Perak (West Coast, Malay Peninsula) it was the custom in ancient times to perform periodically (once in seven years or once in every Raja's reign?) a ceremony intended to insure the prosperity of the country by the propitiation of friendly spirits and the expulsion of evil influences. This was spoken of as pelas negri, the cleansing of the country from evil (meniuhi-kan negri deri sagala bahaya). The ceremony has been described to me as follows:—\n\nThe Raja, chiefs and a great following of people assembled at a selected spot, as far up the river as possible, short of the rapids which impede navigation. Jeram Kerengga was the usual place of meeting. There, a number of bamboo rafts, some of them of elaborate construction with houses on them (balei gambang) were made. The four principal rafts were devoted to the propitiation of the four great classes of spirits in Perak, namely the Hantu Blian, or tiger-spirits, the Hantu Sungket, the Hantu Malayu and the Jin Raja. In each a number of pawangs, medicine-men, took up their station according to the particular class of demons which they affected. The first raft was the one prepared for the Hantu Blian and on it a prah tree, felled for the purpose, was placed erect with all its branches complete. It was kept in position by stays (tam-birang).\n\nWhen all were ready, the procession of rafts started down the river, those of the Hantus leading the way. Behind them came a raft containing persons engaged in religious exercises (mengaji). Then came a raft with the naubat (royal band) and then the Raja, chiefs and people in rafts of various sorts. As they floated down the river with the stream, the chief\npaicangs in the leading rafts waved (me-lam'ei) white cloths and shouted invocations to the spirits and demons inhabiting the country through which they were passing, inviting them to come on board the rafts and eat what was provided for them. While thus engaged, the chief paicang in each of the four spirit-rafts stood upon a slab of tin, which was his perquisite.\n\nA halt was made at every kampong on the river banks of sufficient importance to have a mosque, and at each a buffalo, subscribed for by the people (me-ripai), was slaughtered and the head placed on one of the spirit-rafts. The rest was eaten by the people. The ceremony ended at Bras Basah, a kampong on the left bank of the Perak river not far from its mouth, where the rafts were abandoned and allowed to drift out to sea.\n\nEd.\n\n* * *\n\n68. Legend of \"Toh Panglima Ghapar of Kinta (called Hilang dalam jalan).—\"Toh GHAPAR when he was about fifty years old and whilst he governed Kinta from his Kampung called Kapayang, was suddenly seized with an unaccountable desire to be always in the jungle by himself and refused food. Twenty or thirty people watched him day and night and very often brought him home against his will from his peregrinations. But one night, after the doors of the house had been securely barred, his guards slept, and the next morning he was gone although the doors had not been unbarred: after a long search he was found above the rice-fields of Pengkalan Pergu, but he would not return with the searchers. They followed him through the jungle and up to several of the limestone bluffs and ultimately he was found sitting on a block of limestone at the entrance of the cave in the bluff which has ever since been called Gunong Dato. From thence he called to them that nobody was to go near him nor to speak with him with the exception of one \"Tias who had been his tandil and was a great favourite. Thereupon Tandil \"Tias went up into the cave and saw and spoke with the Dato and saw moreover that\nthe cave was furnished like a house, and that a great many people were in the cave with the Dato, he also found out that the Dato was married to a very beautiful woman who was called by the people \"Putri Bendang Ayer Angat.\" But Tandil 'Tias soon understood that these were not really men and women, but that they were the \"Orang bunyi\" (spirits or fairies) of the mountains and that they were only visible to him because he was called by the Dato. Then the Dato told him that he was to tell the 'Toh Puan and his children and the people generally that he intended to stay and live with these \"Orang bunyi,\" and did not mean to return again to Kampong Kapayang, but that if there was anything that his people required, a sangka was to be offered at the mouth of the cave, and he would help them in any sickness or any other matter. So Tandil 'Tias returned to Kampong Kapayang, but after some time the 'Toh Puan sent him back to the cave with some presents of sweets and siri for the Dato; then Tandil 'Tias found that the Dato had moved up into the upper chamber of the cave, but he called Tandil 'Tias up the ladder to him, and as it seemed so very comfortable Tandil 'Tias asked for and received permission to stay, and took a woman of the \"Orang bunyi\" for his wife, and he lived very happily, but what seemed very curious to Tandil 'Tias was that in three weeks' time his wife presented him with a son. Soon after this event, the Dato ordered him to go down to Kampong Kapayang and take some presents to the 'Toh Puan and his children; he went, but before he started his wife made him promise to return in eight days; unfortunately he forgot his reckoning, and it was nine days before he returned to the cave; he then found the cave closed up and he could not enter, he hailed his wife, but she replied that he could not now return as he had broken his promise. He was very melancholy at this, but asked to see his child, and he suddenly appeared besides him. He took the child down to Kampong Kapayang and gave it to his sister-in-law to nurse with her own baby. But when the child was applied to the breast, blood was given forth instead of milk; this made the foster mother ill and weak and a fresh foster mother had to be found. Several nurses were successively tried, but\nalways with the same result; as the child could not be brought up at Kampong Kapayang, he took it back to its real mother, who received it into the cave again. Until he died about fifty years ago Tandil 'Tias could always speak with his wife and child and with the Dato although he never saw them again. 'Toh Abu Kasim, the grandson of 'Toh Ghapar, is said to have stayed two nights in the cave and to have seen and spoken with the Dato; this was about thirty years ago before Abu Kasim went to Mecca, where he died.\n\nThe son of Tandil 'Tias and the \"Orang bunyi\" was called Dualim; he became the elephant driver of the Dato, he used to drive a very large elephant whose footprints measured a cubit and a span across; if this elephant passed through a garden he did no harm, but that garden was sure to be very fruitful. Kulub Lembong, when he first went to Rotan Seger, one night heard this elephant passing and the gambali singing as he went, the next morning he saw the footprints close to his hut; the rice-fields of Rotan Seger have since been noted as the most fertile in Kinta.\n\nDualim died when the first Europeans came to Kinta, but to this day fresh elephant droppings are always to be found in the cave.\n\nA. H.\n\nMISCELLANEOUS.\n\n69. Index of Asiatic Journals.—Mr. J. T. Carletti is compiling an Index of Asiatic Journals, and hopes to have finished his work some time next year. The following are the Journals he is indexing:—Journal of the Royal Asiatic Society of Great Britain and Ireland, from old series, 1835, and new series, 1844; Journal of the Bombay Branch of the Royal Asiatic Society, from 1841; Journal of the North China Branch of the Royal\nAsiatic Society, from 1858; Journal of the Indian Archipelago and Eastern Asia, from 1847 to 1859 (all issued); Journal of the Straits Branch of the Royal Asiatic Society, from 1878; Journal of the Ceylon Branch of the Royal Asiatic Society, from 1845; Transactions of the Asiatic Society of Japan, from 1872; Madras Journal of Literature and Science, from 1834; Journal of the American Oriental Society, from 1849; and Journal of the Asiatic Society of Bengal), from 1832.\"—Athenæum, 24th October, 1885.\n\nEXTRACTS.\n\n70. The Borneo Coal-Fields.—Having recently visited some of the coal-fields in the Island of Borneo, it may be interesting to your readers to know the result. The subject was one of special interest to me, and its investigation was one of the principal subjects I proposed to myself in my travels in the East. Just before leaving Australia, I had published in the Proceedings of the Linnean Society of New South Wales a complete history of the known coal flora of Australia, and a review of its geological position. The relation of the Australian to the Indian coal flora is well known. It seemed hardly possible but that in Borneo, where such extensive coal-formations exist, some connecting link would be found between Australia and India.\n\nThe subject is very little known. The late Mr. Motley had the management of the Labuan mines. His are the only writings on the age of the Borneo coal which are known to me. What he wrote is quoted by Mr. Wallace in his work on \"Australasia.\" He regarded the beds as Tertiary, and the fossils as of species of plants and marine mollusca now living on the coast. He speaks of cocoa-nuts and the peculiar winged seeds of Dipterocarpus (so common in Borneo) being common also in the coal at Labuan. He thought that the beds evidently originated in the most recent times from masses of drift-wood brought down by the rivers and stranded on the coast, in the way the traveller sees so often repeated on the\nBorneo coast at the present day. He also stated that the Labuan coal was not, properly speaking, coal, but more like drift-wood partially bitumenised.\n\nMr. Motley subsequently was killed by the natives at Banjermassin. It is now six or seven years since the mines at Labuan have been worked. I am not sure that he had the same impressions about the South Borneo coal as of the Labuan beds, but I think I am not far out in thinking that he regarded all Borneo coal-beds as belonging to one immense Tertiary formation.\n\nThere are few countries of the world, except, perhaps, Eastern Australia, where coal is so extensively developed as in Borneo. Thick seams crop out in innumerable places on the coast and on the banks of the rivers. In some of the streams of North Borneo I have seen water-worn and rounded fragments of coal forming the entire shingle bed of the channel. In some places, again, there are outcrops with seams of good coal 26 feet thick. The coal-formation is the one prevailing rock of the coast. It forms the principal outcrop about Sarawak. At Labuan, also, no other rock can be seen. Lining the banks of the Brunei River, I only saw picturesque hills of very old Carboniferous shale. All the grand scenery of the entrance to the port of Gaya is made up of escarpment of coal-rocks. At Kudat it is the same, and so I might go on with a long list of coal-bearing localities.\n\nNow, in such a large island as Borneo, with such a wondrous mountain system, it would be absurd to suppose that all this coal belonged to one age. We might as well suppose the same of the comparatively small islands of Great Britain, and yet what an error that would be. In Eastern Australia and in Tasmania, beds of coal of very different age lie close together. I have found the same in Borneo. Whether there is Tertiary coal or not in the island, I cannot say; but there is Mesozoic coal, and probably Palaeozoic coal, and coals like those of Newcastle in Australia, whose position hovers between the true Palaeozoic and the Trias. To begin with Labuan: the works there have been long since abandoned; the adits are partly filled with water, and the shafts have fallen in, so that it is next to impossible to explore the mine now. But there is\nplenty of coal and shale on the surface, and there are excellent sections on the sea-cliffs close by. The formation is a drifted sandstone with much false bedding. It contains not a trace of lime or any marine organism. Under the microscope the siliceous grains are seen to be rounded. I think it is an Eolian formation with lines of rounded pebbles of small size. The whole deposit is very similar to the Hawkesbury sandstone of Australia, which is of Oolitic age. In both formations there are roots and carbonised fragments of coniferous wood, in which the tissue is still to be traced. The coal on the surface is a truly bitumenised coal, very brittle, and like what we get in the same rocks in Australia. The few plant-remains I saw were not referable to any known genus; they were like Zygo-phyllites, and perhaps these are the plants which have been identified as wings of *Dipterocarpus*, which they remotely resemble.\n\nI saw no marine fossil, and the absence of any lime in the beds makes one think that those which were discovered did not come from any of the strata which are exposed in section. Sir Hugh Low, who resided many years at Labuan, gave me some casts of marine fossils taken from the locality. They were casts not easily identified, and certainly not like any now existing on the coast. The molluscan fauna of the locality is that of the usual Indian Oceanic type, with a slight admixture of Chinese and Philippine forms. In all recent beach-remains in these parts of the world there is a large admixture of urchins, corals, &c. The aspect of the matrix was not of this character. It was much more like a blue-clay such as we have in Australia above the Mesozoic coal.\n\nOn the whole, I am inclined to regard the Labuan beds as of Oolitic age, and not Tertiary. Of the value of the coal-seams, I had no means of judging. The amount on the surface showed that there was plenty to be had. Labuan is a naval coaling station. Stores of coal are brought out from England at a great expense for the use of Her Majesty’s navy, and if the same thing could be got in the island the enormous advantages are obvious. I think it should be further tested.\n\nAbout fifty miles away to the south-east is the mouth of the Brunei river. Here the rocks are quite of a different character\nand much older. They are sandstones, shales, and grits, with ferruginous joints. The beds are inclined at angles of 25 to 45 degrees. They are often altered into a kind of chert. At Moarra there is an outcrop of coal-seams 20, 25, and 26 feet thick. The coal is of excellent quality, quite bitumenised and not brittle. The beds are being worked by private enterprise. I saw no fossils, but the beds and the coal reminded me much of the older Australian coals along the Hunter River. The mines are of great value. They are rented for a few thousand dollars (by two enterprising Scotchmen) from the Sultan of Brunei. The same sovereign would part with the place altogether for little or nothing. Why not have our coaling station there? Or what if Germany, France, or Russia should purchase the same from the independent Sultan of Brunei?\n\nThe Sarawak coal beds I did not visit, but a collection of fossils was kindly sent to me by the Hon'ble Francis Maxwell, the Resident. I recognised at once well-known Australian and Indian forms, such as *Phyllotheca australis* and *vertebraria*. These are entirely characteristic of the Newcastle deposits in New South Wales. The connection thus established between the Carboniferous deposits of India, Borneo, and Australia is exceedingly interesting.\n\nI intend to publish in another form all the observations I have made on the coal formations of Borneo and their included fossils. The main result of all I have seen may be embodied in the following conclusions:\n\n1. There are in Borneo immense coal deposits of very different ages.\n2. These formations extend from the Palaeozoic to the Middle Mesozoic periods.\n3. The fossils from some of the beds are specifically identical with those of certain well-known forms common to India and Australia.\n4. The Labuan coals are probably of Oolitic age, and not connected with any marine formation, but apparently of Eolian origin.\n\nJ. E. TENISON-WOODS.\n\n[Nature, 23rd April, 1885.]\n71. Malayan Antiquities.—Alterthümer aus dem Ostindischen Archipel und Angrenzenden Gebieten. Herausgegeben von Dr. A. B. Meyer. (Leipzig, 1884.)—The present sumptuous volume forms the fourth of the series being issued under the enlightened management of the Curator of the Dresden Zoological and Anthropological Museum. These costly publications, which could scarcely be undertaken without the active cooperation of the general administration of the royal artistic and scientific collections in the Saxon capital, will, when completed, prove a great boon, especially to students of eastern antiquities, and of the progress of human culture amongst the peoples of Southern Asia.\n\nThis fourth part, so far complete in itself, will be found of great value in elucidating the civilising influences both of Brahmanism and Buddhism on the races of Further India and the Malay Archipelago. It comprises nineteen photographic plates in folio, four of which are exquisitely coloured, with explanatory text and a map devoted almost exclusively to this important subject. Thus we have here embodied at once a descriptive and illustrated record of the archaeological treasures in the Dresden Collection, which serve to mark the progress of the arts in the Eastern Archipelago and neighbouring regions from the earliest historic period, that is, from the first contact of those lands with the Indian religious and artistic world.\n\nThe arrangement is thoroughly systematic and most convenient for purposes of reference and comparative study, objects in stone, metal, wood, porcelain, and allied materials being grouped separately, and dealt with in the order indicated. The four stone figures from Java, reproduced on the first two plates, show at once the advantage of this arrangement. Here we have on Plate I a genuine Brahmanical Trimurti placed side by side with a full-breasted female figure of undoubted Buddhistic type; on Plate II an unmistakable Brahmanical Siva, again contrasted with the representation in high relief of two men, who, from their devout attitude and other indications, are evidently of Buddhist origin. Taken collectively, these two groups thus present a striking illustration of both streams of Hindu culture, by which the island of Java was\nsuccessively flooded. On this point the Curator's remarks in the accompanying text are highly instructive:\n\n\"The Hindu antiquities found in Java are either Brahmanistic, Buddhistic, or mixed. Brahmanism repeatedly occurs in its Sivaistic phase. Buddhism, pure only in Borobudur and Tyandi Mendut ('Veth,' Java, ii, 172), is found mixed with Sivaism, Sivaistic divinities sometimes surrounding images of Buddha (Leemans, 'Borobudur,' 444), Buddhistic figures at others encircling Sivaistic idols ('Veth,' ii, 103, 173), or else assuming monstrous forms, such as often characterise Brahmanical deities ('Veth,' ii, 96, and Max Uhle, 'Descriptive Catalogue in MS. of the Royal Ethnological Museum,' No. 1464).\"\n\nThe greatest monuments of Buddhism appear to be concentrated mainly in the central parts of Java, while those of the Brahmanical cult are scattered round them in all directions. Extensive Brahmanical settlements had already been formed in the island long before the first arrival of the Buddhist missionaries, who, according to Dr. Meyer, made their appearance probably about the fifth century of the new era. The stupendous Buddhist temple of Borobudur, rivalling that of Angkor-Vaht in Camboja, is assigned to the eighth or ninth century. But no attempt has been made to determine the date of the earliest Brahmanical remains in Java or the other islands of the Archipelago. They cannot, however, be much more recent than the first century of the Christian era, and may possibly be some two or three centuries earlier. It is to be regretted that this point cannot be determined with some approach to accuracy, for it has obviously a most important bearing on the question of the migrations of the Indonesian races, and especially of the diffusion of the Malayo-Polynesian languages throughout the Indian and Pacific Oceans. Those writers, who are disposed to regard these as comparatively recent events, should at least bear in mind that there are practically no traces of Sanskrit or Prakrit elements either in Malagasy, or in any of the Eastern Polynesian dialects. Hence, if Malaysia be taken as the point of dispersion west to Madagascar, east to the South Sea Islands, the migrations must necessarily have taken place at some time before the\nspread of Hindu influences throughout the Eastern Archipelago.\n\nHowever, the collection is not confined to Hindu subjects, and on Plate VII are figured a large number of iron spearheads, some of which are undoubtedly subsequent to the introduction of Islám in the thirteenth century. Many of these objects, which were found in Jokjokarta (Java), are of simple type, much corroded by rust, and no doubt of considerable antiquity. But others show distinct traces of damaskeening, an art unknown before the arrival of the Arabs, although now universally diffused throughout the Archipelago. The process, locally known by the name of pamor, consists in manipulating steel and iron by means of acids, the designs being inlaid by the priests (Pfyffer, \"Sketches from Java,\" p. 32).\n\nConspicuous among the bronze objects is a magnificent lion's head of absolutely unique type and great size (compass round neck 34 cm., diameter 30 cm., weight 100 kilograms), apparently from Camboja, although first discovered in Java. This superb bronze, whose analysis yielded copper 92·49, tin 5·53, lead 1·40, cobalt and nickel 0·07, iron 0·12, total 99·61, is referred by Dr. Meyer to the flourishing period of Cambojan art as embodied in the monuments of Angkor Vaht, and would accordingly be some 600 or 800 years old. Front and side views are here given in half the natural size on two separate plates. From these it is evident that the lion is playing the part of a rakshasa or guardian to some Buddhist shrine, such as are found sculptured at Borobudur. Another rakshasa of a very different character is a wooden figure of Garudha from the island of Bali, reproduced by the new phototype process, which has already rendered such valuable services to the arts, and especially to archaeology in Germany. Here Garudha is represented as a winged human figure bearing on his shoulders probably a Vishnu, of whom the legs alone, suspended in front, have been preserved. It is described as perhaps a Sivaitic representation from some Brahmanical temple in Bali, where Vishnuism and Sivaism are said to be intimately associated. The introduction of the Hindu cult into Bali, where it still holds its ground in the midst of Islám, is referred to the beginning of the fifteenth century. But the\nfair state of preservation of this wooden image bespeaks a much more recent date.\n\nOn the concluding plates are figured numerous designs of bronze drums or gongs from every part of the Archipelago and Further India. These instruments, which play so large a part in the social economy of the Indonesian and Indo-Chinese peoples, are here brought together for the purpose of elucidating the obscure and hitherto little studied history of their origin and diffusion throughout South-Eastern Asia. Those interested in the subject will find much instructive matter embodied in the accompanying text.\n\nA word of thanks is also due to Dr. Max Uhle, the Curator's able assistant, not only for his general co-operation, but more especially for the great care he has bestowed on the map of the regions in question. On it are accurately indicated all the places in Malaysia where Hindu antiquities have at any time been discovered, or where monuments dating from pre-Muhammadan times are found.\n\nA. H. KEANE.\n\n[Nature, 26th March, 1885.]\n\n* * *\n\n72. Rock-Pictures in New Guinea.—A few years ago I mentioned in a paper in *Globus* (lxiii, 94) that Mr. Th. B. Leon had reported the existence of pictures on rocks he had seen in the Ogar and Arguni groups of islands (south part of McClure inlet), and that the officer in command of H.N.M.S. *Batavia* who had been charged to make further inquiries, had not been able to find them. At that time Mr. Leon's account had not been published in the regular issue of the *Batav. Genootschap*. Since then, however, explorations by Mr. van Braam Morris, whilst on his voyage in New Guinea in 1883, and by some of the officers of H.N.M.S. *Samarang*, have resulted in the discovery of rock-pictures similar to those spoken of by Mr. Leon. The papers giving an account of\nthese explorations (including Mr. Leon's) have been published in a recent number of the *Tijdschrift voor Indische Land-, Taal-, en Volkenkunde* (xxix, pp. 582-591), and an abstract of their contents may be interesting.\n\nOne day Mr. Leon set out from the kampong (village) of Arguni, situated on the island of that name, for the purpose of fishing. In the beginning, on account of the surf, he kept at a great distance, but the third island of the group he was able to approach. He perceived the distinct representation of a human hand, painted in white, and surrounded with red spots, and other drawings in white, which appeared to be meant for letters, though traced in characters unknown to him. Afterwards, on penetrating between two other islands of the group, he saw several hands, all similar to the first and accompanied by similar drawings. He was not able to land; he estimated the height of the place at which they were drawn on the rock to be from 75 to 150 feet above sea-level, the hands being about three-quarters of the way up, and the other figures about 10 feet higher still. The hands were of all sizes, representing those of children, of full-grown men, of giants, and were in great numbers. He fancied the characters bore some resemblance to the written signs in use amongst the Orang Kling, the Orang Bugis, and the Orang Mangkasser; they were certainly not Javan or Malayan. He was greatly puzzled as to how they could have come there, since the face of the rock was perfectly perpendicular, and without any projections or caverns, so far as he could perceive. The only explanation he can suggest is that they must have been done at a time when that part of the rock-surface was nearer to the level of the sea, or the outward form of the rock must have been changed on that side by losing ledges or projections by which the native draughtsmen may have approached the place. It will be readily understood that the natives attribute these drawings to Kasuak, the prince of evil spirits, who, in their opinion, has his dwelling in one of the small islands, and of whom they are naturally greatly afraid. On another island Mr. Leon discovered a huge stone, which would probably require half a dozen men to lift it, rudely shaped like a bullock, and surrounded with several other stones, evidently arranged\nMr. van Braam Morris says:—On September 16, 1883, I came to McClure inlet, and was told by the native chiefs that the figures I was in search of were to be found on Arguni, or the islands to the west of it. I discovered them on a small island a few hundred yards from the mainland. The shores of both the island and the mainland rose perpendicularly from the water, and in the rocky face of the former, about 5 feet above high-water mark, the surf had eaten out an excavation from 3 to 5 feet wide, thus leaving a narrow platform, on which several small prahuas were deposited, some of them being 3 feet long. Various figures were drawn on the rock above, especially hands, both of full-grown people and of children. A hand had evidently been sketched in outline from a living model placed against the wall, and coloured to a depth of 6 inches all around it. The native chiefs who accompanied the Resident said that the remains of the Hill-Papuans had formerly been deposited here, but were now interred with Mahommedanites; there were indications, however, that some prahuas had been recently lodged on the platform.\n\nThough the most astonishing part of Mr. Leon's report, viz., the difficulty of drawing the figures on the rock at a considerable height above the sea, is not encountered by Mr. van Braam Morris's experience, it is not proved that the latter explored exactly the same place as Mr. Leon. But just this point (the considerable rising of the islands) is most plainly stated with regard to the Ke Islands by Messrs. Alliol, Mol, van Slooten, Melboom, and Deijl, of H.N.M.S. Samarang, which at the time of their visit lay off Tual (5° 37' 30\" S. lat. 132° 44' E. long.), island of Little Ke. These gentlemen were invited by Mr. Langen, the head of the English settlement there, to visit with him the north-western part of the island; after having steamed for three-quarters of an hour they dropped anchor vis-à-vis Kalumit, a village at the base of a hill, about 200 metres high. They went to the top to see there some idols situated in a small settlement. I pass over this part of the narrative, and take it up after they had descended from the edge of the rock, where they had found a burial-place belonging to the kampong, which is on the top.\nA tolerably well-made flight of ironwood steps allowed the visitors to descend easily; after about half an hour's walk they came to the \"necropolis.\"\n\nOn the rock near it they discovered representations in red of various figures—human hands, with the fingers spread out; imitations of human heads; a fight between men armed with klevanys (= cutlass), and other figures which they took to be representations of the evil spirits, outlines of ships, &c. Though the heads were rudely drawn, the hands, which were fewer in number, were remarkably well done. The place where the drawings are seems to be quite inaccessible to human beings. In the rock are also caverns which are rather difficult to approach. In one of them two gongs and some pieces of bamboo were found; at the entry fragments of broken glass had been spread, probably to prevent visitors from entering. It must be mentioned that the rock, from the base to the top, was covered with sea-shells. Attention is repeatedly drawn in the report to the circumstance that it seems incomprehensible how the pictures could have been drawn on the rock, which overhangs.\n\nThe natives connect the rock-pictures with the burial-place on the top of the cliff. Near the edge of the steep descent stand two houses, which serve as mortuaries, one being close to the dwellings of the natives, which are surrounded with a stone wall. These two houses are built of ironwood; on the roofs there are two pieces of wood, the one in the shape of a prow, the other in the shape of a keel. On the latter are two figures, a dog and a bird; a stick bearing a piece of white cloth is stuck into the bird's body. The walls are 4 and 3 metres, and in the shorter, which faces the sea, there are two doors, through which the coffin is carried; inside this hut they saw two coffins with fruits and a bottle of oil which had been left for the spirits.\n\nThe natives who called themselves Hindoos, or heathens, a name which of course has no ethnographical significance, but is merely used to distinguish them from their Mahommedan neighbours, said that when a dead body was placed in the hut the spirit was conducted by the bird or the dog on the roof to the caverns where it is to abide. In token of its arrival the\nanimal draws a figure on the rock. The natives who accompanied the explorers durst not set foot within the caves.\n\nIt was also said that the bird and the dog were merely symbols. The soul of the deceased, on leaving the body, flies as a bird through the air or runs as a dog over the earth, till it reaches the abodes of the spirits—the caverns—unseen by living men. Every soul that reaches this haven draws a figure on the face of the cliff. In explanation of the contest between human beings and evil spirits in the pictures, they said that the latter try to prevent the souls from reaching the eternal dwellings; but they cannot hinder those who have led good and honest lives, though those who have done wickedly are carried off by the evil spirits.\n\nThe officers, judging from the many articles in gold and silver which were found in the caverns, concluded that they must formerly have been used by pirates as places of refuge and for hiding their stores, and that they were then nearer to the level of the water. On this view the drawings on the rocks would answer a double purpose: they would keep the superstitious from approaching the caves, and would also act as a landmark for the pirates themselves when returning from sea, and indicate to them the places where their treasure was hidden.\n\nWithout hazarding any opinion upon such incomplete accounts, I wish to state, merely by way of summary—\n\n1) That Mr. Leon's evidence, combined with that of the officers of the Samarang, would seem to indicate that the surfaces of certain islands in McClure inlet and of the Ke group have been considerably elevated.\n\n(2) That the rise has probably taken place at no distant date, but how long since cannot be determined until (perhaps) after close scientific examination.\n\n(3) That Mr. Morris's explanations, taken in conjunction with the foregoing, suggest that the elevation is not a general one, but, though observed at distant points, is limited to certain islands of different groups, or even to particular sides of them.\n\nEMIL METZGER.\n\n[Nature, 9th April, 1885.]\n73. Astronomy.—With regard to the new star in Andromeda, Dr. Sophus Tromholt relates the following curious story in a Norwegian Journal:—\"In the Hungarian periodical, Losonczei Phönix for 1851 is a story by Maurus Jokai, the celebrated author, in which he refers to this star. Jokai makes an old Malay relate that the evil spirit, Asrafil, revealed to King Saul and his sons the star in the nebula; and predicted that those who could not see it should die in the impending battle. The Malay also reveals the star to his listeners, and describes its position so accurately that there cannot be any doubt of the Andromeda nebula being the one referred to, although it is not named.\" The story according to Jokai rests on a biblical or Jewish legend. On the writer of these lines asking one of the greatest living authorities on biblical research whether the Bible contains any reference to the point, he was informed that there is absolutely no such reference in that book and that it is hardly possible the nebula is mentioned in any Jewish legend.........I intended to enquire of Jokai whether his story is founded on any tradition or only an outcome of the author's imagination, but even should the latter be the case the story is a very curious one.\"\n\n[Nature, 15th Oct. 1885.]\nSTRAITS BRANCH OF THE\n\nROYAL ASIATIC SOCIETY.\n\nNOTES AND QUERIES\n\nEDITED BY\n\nTHE HONORARY SECRETARY.\n\nNo. 4, Issued with No. 17 of the Journal of the Society.\n\nSINGAPORE:\n\nPrinted at the Government Printing Office.\n\n1887\nNOTES AND QUERIES.\n\nBOTANY.\n\n74. The Brinjal.—In Notes and Queries No. 3, p. 69, there is an allusion to the brinjal, which has been said to be known to the Malays by its Portuguese name. This is a mistake, for the Malays have their own word, térong, to describe this vegetable. Burton has the following note on this plant:\n\n\"Arab 'Badinján'; Hind. 'Bengan'; Pers. 'Bádingán' or 'Badilján'; the Mala insana (Solanum pomiferum or S. melongena) of the Romans, well known in Southern Europe. It is of two kinds, the red (Solanum lycopersicum), and the black (S. melongena). The Spaniards know it as 'berengeria' and when Sancho Panza (Part II, chap. 2) says, 'The Moors are fond of egg-plants' he means more than appears. The vegetable is held to be exceedingly heating, and thereby to breed melancholia and madness; hence one says to a man that has done something eccentric, 'Thou hast been eating brinjalls'.\"—The Book of the Thousand Nights and a Night, Burton, V. 4.\n\n[For a much fuller note about the brinjal, see Yule's Glossary, sub-voce Brinjal.—Ed.]\n\nG. H.\n\n* * *\n\n75. Ketiar.—A fruit of which the Pérah Malays make oil. It is one of the three royal perquisites, the other two being elephants and river-turtle (tuntong). It used to be a capital offence to give false information to the Raja about any of\nthese. The këtìar tree is said to affect certain localities, and is found in groves not mixed with other trees. In former days, when the fruit was ripe, the whole of the Raja's household used to turn out to gather it. It is said to yield a very large percentage of oil. What is the botanical name of the tree, and has the oil any commercial value?\n\nED.\n\nLANGUAGE.\n\n76. Malays.—By former generations of officials and residents in the Straits, the Malay language was always spoken of as \"Malays.\" This idiom was common in Penang twenty years ago, but has now probably nearly died out. Colonel Yule, in his recently-published Glossary of Anglo-Indian Words, notices a similar use in the last century of \"Moors\" for Hindustani, \"Malabars\" for Tamil, etc.\n\nED.\n\n* * *\n\n77. Pagar.—Colonel Yule has the following in his \"Glossary\":\n\nPagar, s. This word, the Malay for a \"fence, enclosure,\" occurs in the sense of \"factory\" in the following passage:\n\n1702. \"Some other out-pagars, or factories, depending upon the factory of Bencoolen.\"—Charters of East India Co., p. 324.\n\nThe word pagar here seems to be meant for pajak, a place where revenue is collected.\n\nED.\n\n* * *\n\n78. Temikei; Mendikei; Kamendikei.—These are synonymous Malay names for the water-melon (Cucurbita citrullus, L.). Temikei seems to be formed from mendikei, by metathesis, which is a common trick of speech in Malay; and kamendikei\nis the same word with the addition of a particle. Is mendikei derived from pateca the word used by the Portuguese in India for a water-melon (Ar. al-battikh or al-bittikh)? Cf. Span. albadea and French pastèque. See Colonel Yule's Glossary, sub voce Pateca.\n\nEd.\n\n* * *\n\n79 Jalibut.—Jolly-boat, a word borrowed perhaps by the Malays from the English. The word was known in 1878 on the Perak river, where the Malays remembered a boat with this name being used by a former Raja. The following pantun was repeated to me apropos of this:\n\nDeri jalibut ka balei gambang\nLalu meng-angkat kalamdan surat\nHari handak ribut bulan pun mengambang\nHati di-dalam sangat-lah dlurat.\n\nColonel Yule (Glossary, sub voce Gallevat) shews that \"jolly-boat\" is a corruption of an Indian word, \"gallevat,\" applied, down to the latter half of the 18th century, to a kind of galley in use on the west coast of India. In 1613 an English navigator records having sent off two men in his \"gellywatte\" to take soundings. (Captain N. Downton in Purchas, I, 501, cited by Colonel Yule).\n\nI know of no instance of the use of a word jali by the Malays in any sense approaching to the English jolly, and authority is wanting for the following, which I extract from Favre's Dictionary (Malais-Français): \"جلي jéli (Angl. jolly), joli, agréable. بوي jali bot, un joli bot, un joli bateau (Kl.).\"\n\nThe learned Abbé, who seems to have assumed that \"jolly-boat\" is a compound of \"jolly\" and \"boat,\" was no doubt unaware of the mysterious workings of what Colonel Yule\ncalls \"Hobson-Jobson,\" the assimilation, \"perhaps by vulgar lips,\" of Oriental words to the English Vernacular.\n\n* * *\n\n80. Cockup.—Colonel Yule has the following (Glossary, p. 175):\n\n\"Cockup, s. An excellent table-fish, found in the mouths of tidal rivers in most parts of India. In Calcutta it is generally known by the Beng. name of begti or bhikti, and it forms the daily breakfast dish of half the European gentlemen in that city. The name may be a corruption, we know not of what; or may be given from the erect sharp spines of the dorsal fin. It is Lates calcarifer (Gunther) of the group Percina, family Percidae, and grows to an immense size, sometimes to eight feet in length.\"\n\nCockup seems to be a corruption of the Malay name, kakap, of this fish. Favre (Dictionnaire Malais-Français) has ایکی کاکف ikan kakap, nom d'une sorte de perche de mer, barbonne (Lates nobilis).\"\n\n* * *\n\n81. Galgal.—In Shakespeare's Dictionary, this appears as a Hindustani word:—\"Galgal, a mixture of lime and linseed oil, forming a kind of mortar impenetrable to water\" (See Yule's Glossary, sub voce Galgal). Is this the Malay word gala-gala which has been carried westward, or have the Malays borrowed from India? Duplication is very characteristic of Malay. Favre explains gala-gala to mean certain mélange de résine et de chaux qui sert à goudronner les navires.\" The same word is used in Makassar and in the Philippines, where gala-gala (in Bisaya) is said to mean \"espèce de mastic qui se fait avec de la chaux et de l'huile.\" Colonel Yule quotes a passage in Cocks' Diary (1621) where the writer speaks of making \"galle-galle\" in Japan with lime.\n\n* * *\n82. Jam.—This is the word commonly used in Malay to express the English \"hour,\" a division of time which they have learnt in recent times. It also signifies a clock or watch. Favre derives it from a Persian word meaning a glass or mirror, but it seems more likely to be the Arabic Zam (plural azwam). \"The Zam in practical parlance is said to be the 8th part of day and night; it is in fact a nautical watch or Hindu Pahar.\" Prinsep, quoted by Colonel Yule, Glossary, p. 809.\n\nEd.\n\n* * *\n\n83. Manuk.—In the last number of the Society's Journal, I noticed that the word 'mánuk,' is stated to mean 'a bird' in the Sûlu Dialect, and moreover that the same word is found in Javanese, Sundanese, Batak, Tagala, and Bisaya signifying the domestic fowl. It may be interesting to know that the same word (bearing the latter meaning) is also met with in the dialects of two Sâkai tribes inhabiting respectively the Plus and Lëngkûas districts of Pétrak.\n\nAnother word, 'puk,' is also in use among the Lëngkûas Sâkai, though it is not employed by the Plus and Kësôb tribe.\n\nThe final 'k' in both these words is pronounced, and it is curious to note that in every case where a Malay word is introduced into Sâkai, it is invariably pronounced as it is spelt, although Sâkai have no knowledge of any form of writing, example—in the word 'tiba' to arrive (which is used in many cases instead of the Sâkai word 'bwal') the final 'a' is pronounced like the 'a' in soprano, although the Pétrak Malays in the centre of whom these Sâkai live, pronounce the same final vowel almost like the 'er' in the English word 'father.'\n\nThis would seem to show, that the words in question were adopted at a date when the final 'k' and the final 'a' were pronounced by the Malays in the manner which I believe is followed to this day by the natives of Borneo.\n\nIt is noticeable that a Sâkai, when talking Malay, drops\nthese peculiarities, but resumes them immediately when he has to use a Malay word in the middle of a Sâkai sentence.\n\nH. C. C.\n\n[See p. 134 of No. 5 of this Journal, where the occurrence of the word manuk, either to signify \"bird\" or \"fowl\" or both, in the dialects of numerous tribes, is noted. See also Wallace's Malay Archipelago, Vol. II, p.p. 479 and 485, where thirty-three languages of the Malay Archipelago are compared. In the majority of them the word which expresses \"bird\" and \"fowl\" is manu, manok, or some form of that word.—Ed.]\n\n* * *\n\n84. The Sakai Language.—Has it ever been stated that these are tones in any of the dialects spoken by the Hill Tribes of the Malay Peninsula? I believe this to be the case in the two dialects of Sâkai, spoken in Pérák, with which I have any acquaintance. In both these dialects the syllables are pronounced separately, and Malay words, adopted by the Sâkai, are split up into monosyllables.\n\nThe tones I believe to be three in number, and to resemble those found in Burmese. They appear to me to be as follows. The first tone is long and the voice descends, the second tone is short and checked, the sound produced being much like that expressed by the hamzah (ُ) in the Malay word 'Dato' (داتو). The third tone is the ordinary sound of the voice, but in the case of a final vowel a very slight 'h' sound is distinguishable.\n\nThese in the Sâkai dialect spoken by the Plus tribe—\n\n1st tone né means one.\n2nd ,, ne ,, three.\n3rd ,, neh ,, to see.\nalso\n1st tone té means the ground, earth.\n3rd ,, teh ,, down river.\nIn the Lengkūas dialect—\n\n1st tone eu means I\n3rd ,, eu ,, to carry.\n1st ,, te ,, the ground, earth.\n3rd ,, teh ,, these.\n1st ,, gas ,, to throw away.\n3rd ,, gas ,, skin disease.\n\nIn this latter dialect, though the second tone is found in such words as 'cho' (a dog), and 'ni-che' (short), I have not succeeded in finding words having three significations distinguished by the respective tones.\n\nH. C. C.\n\nHISTORY.\n\n85. English Trade with Perak.—The Dato Panglima Besar (who died in 1880) furnished the following particulars of European intercourse with Perak in his recollection:—\n\n\"I remember when there was trouble between Sultan Abdul-Lah (father of Raja Muda Yusuf) and Raja Bandahara Jaffar, who afterwards became Sultan. The former was going to attack the farm at Kota Setia. A man-of-war was despatched from Penang for its protection. I don't know her name, but she had eleven guns on each side and was commanded by Captain Otter (?). Captain Hardy and Captain Cuthbert (?) took me on board of her. Messrs. Nairne and Stuart Heriot of Penang farmed the dues at Kuala Perak. My father Toh Sri Dewa Raja weighed the tin when it was exported.\n\nThe person who cleared the hill at Sungei Limau was a Mr. Howison. He owned a warehouse in Beach Street, Penang. His partner was a Mr. Lamb. He lived at Sungei Limau for three years. He started the manufacture of saltpetre out of the bat's guano in the caves in Gunong Pondok, and built a large shed with 40 or 50 pans. The saltpetre which he produced was very white. He lost money in this enterprise. Then he discovered a kind of stone in Ulu Perak (batu abrak, talc, mica?), a quantity of which he exported to Singapore, but that, too, did not pay.\"\n\nEd.\n86. The Founding of Singapore.—The following letters are of historical interest. They are to be found in a file of native correspondence among the Dutch records in Malacca. It is amusing to find Raffles' friend, the Tumonggong of Johor, writing to Malacca to assure the Dutch Governor of his undying devotion at the very moment that the island of Singapore was being made over to the British. The other letters, too, are characteristic of Malay diplomacy, the Bandahara of Pahang, for instance, hastening to declare his friendship for such person as may be the friend of his master the Raja of Johor, without committing himself to any opinion as to the proper person to be recognised in that capacity.\n\nEd.\n\nLetter from Tuan Raja Tumunggong, Singapore,\nTo Tuan Raja Muda Adrian Koek, Malacca.\nNo date. (Dutch translation dated the 16th Feb., 1819.)\nكيراب كف صاحبة كية توان راج مودا ادريغ كوب يبغ ممرنته دادالم\nنكري ملاك يفامست عاريف يبحسان لاغي بحسواو دان درماوان\nمورت اوتاوان درف فيهق ملاكوكي برکاميهنان دان برچينق اكن\nدغى مگل صاحب هندي تولنه مورت دغى تولغ فليهرابه\nكفر مگل داگخ دان ستنتري ملك بوتمبه كيراه كبساران دان\nكملیا لی امین ثم امین\n\nوبعد درف ايت بارع مفهم كيراب صاحبة كيت ادااله\nكية میتاكن خال كيت دودق دمیفافورا ملك تیجام دانغ کفل\nتوجه بواء كورام مانو کیچی مانو جادي مسبیلن ملك کيت سموا\nیهدالدم میفافورا ماغت ترکجوت اخير ملك نایقه اورگبرب\nبرجمفا دغى کية باعة مستتي روپول دان میچیر فرکار ملك میچیر\nفرکارفرگی دریو مستتي روپول تیغل دمیفافورا ملك ای برکا کف\nکيت دی دودق دمیفافورا لالوه ای مانیفکن اورگی دان\nبارغ ملك کيت فون تیدق بوله کا مانو اف دان کية هندق\nمیبریتاو کمالک فون تیدق بوله لاغی ایه کتیک دان کریو فون\nتیدق جوگ بوله ادان ددالم انارا ایه ملك تلفکو لوغ فون دانغ\nکسیفافورا در ریوه کارن دی دغر کفل پایق دمیفافورا جادي\nدی ترکجوت دی دانغ ماو امبل اثئ مردن مسفي کسیفافورا\nملك برجمفا دغى مستتي روپول ملك دفگفکن اوله روپول\nدجادیکنیب راج داغکتب مسلطان دمیفافورا ایتوه ادامه کيت\nAfter Compliments.—Be it known unto our friend that, while we were living at Singapore, nine vessels suddenly arrived, namely, seven ships, one kura-kura, and one ketch. All of us who were at Singapore were very much startled. At last the Chiefs (of the expedition) landed and paid us a visit; they were Mr. RAFFLES and Major FARQUHAR. The latter went on to Riau, but the former remained at Singapore and, informing us that he intended to remain there, he proceeded to land his men and stores. We were powerless to say anything, and could neither send word to Malacca at that moment nor to Riau. Just at this juncture Tunku Long arrived at Singapore from Riau, having heard that a number of ships had arrived at Singapore, and being anxious about his son whom he came to take away. As soon as he came, he had a meeting with Mr. RAFFLES, who forthwith laid hold of him and made him Raja, installing him as Sultan at Singapore. All this we make known to our friend.\n\nAt this present time the English are establishing themselves at Singapore, and are making a logie, and so we inform our friend, assuring him at the same time that we in no way separate ourselves from the Dutch. As it was with us in the beginning so shall it be to the end as long as there are a sun and a moon.\n\nWe have nothing to send except our salutations to our friend.\nایندا سوره تومگونگ کند یغدرتوان مودا فرکارا ریو\n\nFrom the Tumonggong, Singapore,\nTo the Yang di-per Tuan Muda, Riau,\nDated the 16th Rabia-us-sani, 1234. (Feb., 1819.)\n\nسمیه خدمه التعظيم والتكريم بمعاية الله رب الرحيم بايت\nدرد فدوك اقتصادا توتمگونگ یفاد ترهنتی فد ماس ابی ددالم\nمیفافورا بارگدمیفیکن الله مسجده وتعالی افالة کیراب کند فدوك\nایهندآ یغدرتوان مودا یفاد دلفیبرانک الله في الدنيا والاخرة\nامین ثم امین\n\nوبعد درد ابی اداله اقتصادا معلومکن کند فدوك اهندآ\nمسفر حال اغگویس بايت مستی راو فول دان راج ملاک دانغ\nای کسیفافورا راج ملاکی لالو کربو مستی راو فولی تفکل دمیفافورا\nملک دقوایی سماح فدوك اقتصادا مکالی ۲ تیدق مناهو دان تیدق\nسدر فدوك اقتصادا دانغ دکرامی سماح دی هندق دودق ددالم\nمیفافورا جادی تیدقله ترابیلیکن اوله فدوك اقتصادا لاگی لالو ای\nمنایکن اورغی دان بازغی ۳۲ سری ای برپوا لوج مکالی جادی\nتیدقله ترکاسه اوله فدوك اقتصادا لاگی دیاله ابتله اداب ددالم\nانتارا ایه ملک فدوك اقتصادا تفکو لوغ فون دانغ کسیفافورا اداله\nدانغ اقتصادا ایت کارن ای ترکجوت منغر کفل باپق دمیفافور\nملک ای دانغ هندق مغمل فدوك چندآ ایت تفکو بسر مرود\nAfter Compliments.—I have to acquaint you with the proceedings of the English, that is to say, Mr. RAFFLES and the Raja of Malacca,* who came to Singapore, the latter going on to Riau and the former remaining at Singapore. I was simply forced to submit to this proceeding, of which I had no notice or knowledge. When Mr. RAFFLES came, I was simply told that we intended to settle at Singapore, and I had no power to prevent him. Thereupon he landed his men and stores and proceeded to make a block house (logie)†. Of course I could say nothing. While this was going on, Tunku LONG arrived in Singapore, having been alarmed by the news that there were a number of ships there, and having come for the purpose of fetching his son Tunku BESAR. On his arrival in Singapore, Tunku LONG went to see RAFFLES, whereupon the latter laid hold of him and forcibly made him Raja, with the title of Sultan HUSSEIN. He also presented him with a sealed letter of appointment, and used so much insistence that Yang-di-per-tuan Sultan HUSSEIN could offer no opposition to what he did. (Usual complimentary ending.)\n\n* Major FARQUAHAR.\n† Dutch.\nسلام مري فدوک ائندا یغدرتوان سیگافورا بازخدممیکین\nالله مسجده وتعالی افالة کیرابه کف فدوک ائندا یغدرتوان مودیلی\nیغ مسرته ددالم تغری رو اداله فدوک ائندا میتاکن مفرف\nحال ائندا کارن اداله دالع ائندا راج جوهر تنه مالم دی دالع\nکف ائندا دی مغمرکی کفل بایق دمیگافورا مک ای منایفکن\nمردادوبی براف بایق دان بایگان مک ائندا ترکچوس منفر\nخبر یغدمکین ایب درف بمبغ دان خواطیر اکن فدوک چندا ایب\nسرت دغی ترکچو مک ائندا غون هیلیلره تیاد دغی کیرام لاگی\nکف مالم ایب جوگ هیلیع عقل ائندا کف کتبیک ایب تیدقله\nسمفه مسیریاو فدوک ائندا لاگی مسره مسقی ائندا دمیگافورا\nمک برجمفا دغی مستی رو فول مسره برجمفا لاو دفگش\nتیدق دلفسكیب لاگی مسره دخواتی دان دکرامسی دجادیکسب\nراج دگلرب مسلطان جادی تیدقله تراختیارکی اوله ائندا لاگی\nجادی ائندا ایکوتکنله تنافی حال کارن ائندا ددالم تاغن\nکمفنی کتبیک ایب لاوله دبریچ چف مکالی بتول اداله ائندا\nAfter Compliments.—I have to inform you that the Raja of Johor came to me one night in the middle of the night and announced that there were a great many ships at Singapore, and that numerous soldiers and quantities of stores were being landed. I was a good deal surprised at this news, and not a little anxious and uneasy on account of my son who was there. Without taking thought of what I was doing, I set off the very same night. I completely lost my head and never thought of letting you know of my departure. When I reached Singapore, I went to see Mr. RAFFLES, who immediately laid hold of me and would not let me go again, but insisted on making me a Raja with the title of Sultan. There was nothing else for me to do and I had to comply with what he proposed, but I pointed out that I was under the [Dutch] Company.\nThereupon he gave me a sealed document of appointment. These things I make known to you, and I ask for your pardon and forgiveness, for it is in you that I trust, for I regard you as my father in this world and the next, and I have in no wise acted against you or abandoned you.\n\nFurther, RAFFLES has directed me to bring to Singapore the women and children of my family, and I am now ordering Raja SHABAN to take them there together with any property of mine. (The rest unimportant, M.S. illegible in places.)\n\nFrom the Dato' Bandahara of Pahang,\n\nTo Tuan Raja TIMMERMAN THYSSEN, Governor of Malacca.\n\nDated the 8th Jamadewal, 1234.\n\nقوله العق\n\nبهوا اين مورب تولس دان اخلص مرة موجي هاتي يفتيايد بركتومس دان مجبه يفتيايد بركتداهن باييس درف داتو بدهارا يهامفوهم فرنته كساران ددالم نكري فرع بارغ دسمفيكين توهي مسر مكليين عالم اغاله كيراب دائغ كف صاحبة كبيت توان تيمر مان تيسين يغ ممرته ددالم تكري ملاك دغى مكل داييه يغ ماغت معموري دالاغي مشهور ورتاب بارغ بركلين جوا كيراب كساران يغ فيه لمقه دغى\nكلياً نب ملاكي اد فرايدران چکروال متهاري دان بولن دهن\nچهیاب جاحی برکفتوس کامیه برکامیه فد انثارا کیپ کدوا\nفیهق دهن مجهتراب ادان\n\nوبعد درفدت ایت بارغ مفهوم کیراب صحابة کیپ اداه\nکیپ ممباينکن کهد صحابة کیه حال کادانی مورود سره دهن\nمورود درفدت ایت کیپ یافدرتون مودا ریو بخ کهد صحابة کیپ\nایت تله مسفیله کهد کیپ دهن ملاده مجهتراب کهد م هاریبولن\nربع التلفه فد وقتون جم فوکل دلان مک کیپ مسبوئله دهن\nببراف کسوگان دان کریضاً کمدین مک کیپ تنافی الس\nكدوان ورقة ایت درفدت اول مظهر هفگ اخیرب مک فهمله کیه\nبارغیغ ترمذکور دادالن ایت\n\nشهدا مک کیپ میریما کامیه بايق کهد صحابة کیه\nکارن کیپ براوه خبر بخ پایت درفدت صحابة کیه اکی مگل حال\nاحوال بخ دنگری ریو ادان مفرکارا لاغی جادی حیرالله کیپ\nاکی فرلته توهن بخ منجادیکن مکلین عالم این ملاکوکن قدرت\nاردتنی بفیاد لوسر کهد بودی بجا کیپ دهن کودهن کهد\nتوهن مسر مکلین عالم منچیکن انثارا مودرا برسودرا دان باف\nدحن ایت دان صحابة دهن صحابة ایتوله اداب\nشهدااللای اکی حال کیپ انهاالله تعالى دهن برکت نی\nمسکالی ۲ کیه تیاد براوه اقرال کیپ دهن صحابة کیه بخ مان\nجادی صحابة کهد توان کیپ راج جوهر ایتوله صحابة کهد کیه\nجاعله صحابة کیپ شک دان متفک لاغی دمکیله اداب دان\nلاگی اد کیپ میهورهکن اوزگ کیپ متهاري بارغ کمالک جکلو\nAfter Compliments.—Be it known unto our friend that we [hasten to] inform him on the subject of his letter, and of that of our relation the Yang-di-per-tuan Muda of Riau, which was addressed by him to our friend. Both letters reached us safely on the 4th of the second Rabia at eight o'clock. We received them with great pleasure and satisfaction, and read them both from beginning to end and understood their contents.\n\nWe thank our friend heartily for giving us authentic news as regards all that has passed in Riau. We have been struck with amazement at the dispensation of the Lord, the Creator of all the worlds, who has accomplished his divine will and decree in a way which is not comprehensible to us, parting brother from brother, father from son, and friend from friend.\n\nAs for ourselves, by the aid of God most high and the blessing of the Prophet, we shall in no way depart from our engagement with our friend, that whoever is the friend of our master, the Raja of Johor, he alone is our friend. Let not our friend entertain any doubt or anxiety on this head.\n\nWe have sent one of our people to Malacca to buy goods and would beg you to order him back to Pahang as soon as his business is completed, and if not inconvenient to you we should be glad of a large bottle of rose-water, which might be sent by him if there is time. We have nothing [lit. no sign of life] to send with this letter save our salutations to our friend.\n87. Seals of Johor and Pahang in 1819.—From a historical point of view, the inscriptions on the seals used respectively by the Tumunggong of Johor and the Bandahara of Pahang, in the foregoing correspondence, are worthy of notice. In 1819, neither claimed more than to be *al wakil al Sultan Mahmud Shah*, \"the agent of Sultan Mahmud,\" in Johor and Pahang, respectively. Further, there was no claim to royal style or dignity. Each is described as Dato', the ordinary title of a Malay chief not of royal blood. Both seals bear the same date (A. H. 1221) and correspond closely one with the other; it is, therefore, probable that they were simultaneously bestowed—one upon each of the chiefs, at the time of the accession of Sultan Mahmud Shah. As the present inheritors of the offices of Tumunggong and Bandahara respectively have now adopted the title of \"Sultan,\" (in the case of Johor with the authority of Her Majesty's Government), a note to distinguish the new titles from the traditional Sultanships of the Peninsula may be of use to Malay students hereafter. It will be observed that the Dutch (Acting) Governor of Malacca is addressed as \"Tuan Raja Muda\" and that Major Farquhar is spoken of as the \"Raja of Malacca,\" the title \"Raja,\" n both instances, being given to European Governors by Malay Chiefs, who did not claim it for themselves on their seals.\n\nEd.\n\n* * *\n\n88 Date of the Foundation of Singapore.—His Excellency the Governor has forwarded to the Honorary Secretary, for publication, the following letter from Mr. R. Blanchard Raffles:\n\n\"I learn that it is the intention of the Governor of the Straits Settlements to erect a statue on the Esplanade at Singapore to the memory of the late Sir Thomas Stamford Raffles; and I trust that you will pardon me if, as a member of his family, I venture to warn you against the possible\nreproduction on the pedestal of an error as to the date of the foundation of Singapore which has crept into many books, owing to a misprint in Lady Raffles's Memoir of her husband. For instance, Colonel Yule in his Glossary, \"Hobson Jobson,\" gives the date as February 23rd, 1819; but he has accepted without controversy, the correction which I now take the liberty of submitting to you.\n\nOn p. 375 (Ed. 1830) of the Memoir mentioned above, the following passage occurs:—\"Sir Stamford, determined to accomplish the duty entrusted to him, proceeded in person down the Straits of Malacca, and in ten days after quitting Penang hoisted the British flag, on the 29th of February, 1819, at Singapore, as he had anticipated upon leaving Bengal.\"\n\nIn 1819 there could, of course, be no 29th February. The letter on the preceding page is dated \"Penang, January 16th, 1819\"; and the next letter given after the passage quoted above is dated \"Singapore, January 31st, 1819,\" and announces the occupation of the island. It is thus plain that in the sentence I have copied from the Memoir \"29th of January, 1819\" should be read instead of \"29th of February, 1819.\"\n\nIf the correction which I have ventured to send is superfluous, I must apologise for having troubled you unnecessarily by drawing your attention to a point in connection with which I have seen various errors.\"\n\n[Mr. Raffles is no doubt right in his contention, and the Malay letters above printed, the Dutch translations of which are dated February 16th, 1819, show clearly that the occupation of Singapore took place at a date earlier than that quoted by Lady Raffles.—Ed.]\n\nBIOGRAPHY.\n\n89. The Light Family.—Francis Light, the first Superintendent of Prince of Wales' Island, who died in Penang, October 21st, 1794, left two sons, one of whom entered the\nArmy, rose to the rank of Colonel, and died in Australia in 1839. Colonel Light was appointed Surveyor-General, and fixed upon the site where the city of Adelaide now stands. On 28th December, 1836, just half a century after Francis Light had taken possession of Penang, Colonel Light formed one of the party which, under Governor Hindmarsh, landed at Holdfast Bay. There, under a venerable gum tree, not far from the shore, in the presence of the Officers of Government assembled, the Orders in Council creating South Australia a British Colony were read. Light's other son was christened Francis Lanoon, he having been born at a time when Penang was being attacked by Lanoon pirates. After the taking of Java, he went to Minto as Resident, and there married a native who became a Christian. His son Robert Rollo, born in 1818, is now living in Pérak.\n\nK.\n\n[In a letter published in \"The Times\" of November 13th, 1875, a Lieut.-Colonel George Palmer, who described himself as \"one of the original Colonization Commissioners for founding this colony (South Australia) and a personal friend of the late Colonel Light\" gave a sketch of the services of the latter. It is possibly more correct than the old fable (re-suscitated in this letter) of Captain Light's marriage with a Kedah Princess who brought him Penang as a dowry! According to Colonel Palmer, Colonel Light was originally in the Royal Navy, which service he left to join the staff of the Duke of Wellington, with whom he remained as \"a confidential Aide-de Camp\" until after Waterloo. Colonel Light then went back to his old profession, and commanded a line of battleship for the Pasha of Egypt. This position he gave up at the Duke's suggestion to go out to Australia (in May, 1836), as Surveyor-General of South Australia.—Ed.]\n\nMEDICINE.\n\n90. Senna.—As an example of the present state of medical science among the Malays, the following translation of instructions for the use of a well-known drug may be of interest. It will be seen that it cures as many diseases as some of the patent pills of modern advertisements. The men-\ntion of grapes, dates and pomegranates as ingredients may shew that the Malay prescription is itself a translation from Indian or Arabic sources:\n\n\"This is designed to explain the virtues of the Senna of Mecca (daun sana-makki), which is famous among all doctors of great experience.\n\nFirst. Take some senna leaves with their stalks and bark, pound the whole up fine and then weigh out a quantity as heavy as three Java duits. Let this be mixed with honey. If this is swallowed, its properties are to cause all diseases of the chest to disappear.\n\nSecond. Mix the senna leaves with moist sugar. If this is taken internally, the effect is to expel cold from the body and to give strength to the organs.\n\nThird. Mix the senna leaves with sugar candy. This gives strength to the bones.\n\nFourth. Mix the senna leaves with clarified butter and moist sugar. If this is taken for three days, it will get rid of all bad humours in the body and will give health.\n\nFifth. Mix the senna leaves with fresh butter to which no salt has yet been added. The properties of this mixture are to cure headaches and to cleanse the brain and to remove any bad taste in the mouth.\n\nSixth. Mix the senna leaves with curds. This mixture operates as an antidote to poison and prevents evil consequences from it.\n\nSeventh. If senna be taken with goat's milk, it will cause an accession of strength, though complete weakness existed just before.\n\nEighth. If senna be taken with dates, everything offensive is removed from the mouth and the body is made healthy, and a good appetite is established.\n\nNinth. If senna be taken with pomegranates, the body becomes strong, and though the patient may be old, nevertheless there is an addition of strength, and the organs of the chest are cleansed, and the appetites are stimulated.\n\nTenth. If senna be taken with grapes, it gives light to the eyes which were dim. This is proved by experience.\"\nEleventh. If senna be drunk with vinegar, it cures fever accompanied by shivering and trembling of the bones, and expels all mischief from the stomach, and cleanses the organs of the chest.\n\nTwelfth. If senna leaves be taken with orange-juice, all internal heat is removed, and a man who was before quite thin will speedily grow fat.\n\nThirteenth. If senna is drunk with dew, the eyes become bright and clear.\n\nFourteenth. If senna is taken in water in which pomegranate peel has been boiled, it cures dysentery.\n\nFifteenth. If senna is boiled with cocoa-nut water and taken internally, it will cure diabetes and gravel, by the will of God ever to be praised and Most High.”\n\nThus the properties of the Senna of Mecca are concluded, under fifteen headings.\n\nEd.\n\nSOCIAL CUSTOMS.\n\n91. Panjat.—The word panjat in Malay means literally “to climb,” but it is used in Pérak, and perhaps in other Malay States, to signify a forcible entry into a house for the purpose of securing as a wife a woman whom her relations have already refused to the intruder. This high-handed proceeding is recognised by Malay custom, and is regulated by certain well-known rules.\n\nPanjat is of two kinds—paniat angkara and panjat ‘adat, entry by violence and entry by custom. In the first case, the man makes his way into the house armed with his kris or other weapon, and entering the women’s apartment, or posting himself at the door, secures the person of his intended bride, or prevents her escape. He runs the risk of being killed on the spot by the girl’s relations, and his safety depends upon his reputation for courage and strength, and upon the number of his\nfriends and the influence of his family. A wooer who adopts this violent method of compelling the assent of unwilling relations to his marriage to one of their kin must, say the Malays, have three qualifications,\n\nka-rapat-an baniuk,\nwang-nia ber-lebih,\njantan-nia ber-lebih,\n\n\"a strong party to back him, plenty of money, and no lack of bravery.\"\n\nPlenty of money is necessary, because by accepted custom, if the relations yield and give their consent, all the customary payments are doubled; the fine for the trespass, which would ordinarily be twenty-five dollars, becomes fifty dollars; the dower is likewise doubled, and the usual present of clothes (salin) must consist of two of each of the three garments (salendang, baju, kain), instead of one as usual. The fine for panjat angkara may be of any amount, according to the pleasure of the woman's relations, and they fix it high or low according to the man's position. I have heard of one case in Pérak where the fine was five hundred dollars, and another in which the suitor, to obtain his bride, had to pay one thousand seven hundred and fifty dollars, namely, one thousand two hundred and fifty dollars as a fine, and five hundred dollars for the marriage expenses. But in this case the girl was already betrothed to another, and one thousand dollars, out of the fine, went to the disappointed rival.\n\nSometimes the relations hold out, or the man for want of one of the three qualifications mentioned above has to beat an ignominious retreat. In the reign of Sultan Ali, one Mat Taib, a budak raja, or personal attendant on the Sultan, asked for Wan Dena, the daughter of the Bandahara of Kedah (she then being at Kota Lama in Pérak) in marriage. Being refused he forced his way into the house and seizing the girl by her long hair drew his kris and defied everybody. No one dared to interfere by force, for the man if attacked would have driven his kris into the girl's body. This state of things is said to have lasted three days and three nights during which\nthe man neither ate nor slept. Eventually he was drugged by an old woman from whom he accepted some food or water and when he fell asleep the girl was released from his grasp and taken to the Sultan's palace where she was married off straightway to one Mat Arshad. Mat Taib had his revenge, for within a year he amoked at Bandar where Mat Arshad lived, killing the latter and wounding Wan Dena.\n\nPanjat 'adat is a less lawless proceeding. A man who is in love with a girl, the consent of whose parents or relations he cannot obtain, sends his kris to their house with a message to the effect that he is ready with the dower, presents, etc., doubled according to custom and that he is ready to make good any demands they may make.\n\nMata daching mata kati di-tolok-ti\nChupak gantang di-penoh-ti.\n\nThe kris is symbolical of the violent entry, which in this case is dispensed with. If the girl's guardians are still obdurate, they send back the kris, but with it they must send double the amount of the dower offered by the man.\n\nEd.\n\n92. Influence of the Breath in healing.—In Notes and Queries No. 1, p. 24, a Malay bomor, or doctor, is described as blowing upon something to be used as medicine. Breathing upon sick persons and upon food, water, medicines, etc., to be administered to them is a common ceremony among Malay doctors and midwives. The following note would seem to shew that the Malays have learnt it from their Muhammadan teachers:\n\nHealing by the breath [Arab. \"Nafahal\" breathings, benefits, the Heb. Neshamah, opp. to Nephest (soul) and Ruach (spirit)] is a popular idea throughout the East and not unknown to Western magnetists and mesmerists. The miraculous cures of the Messiah were, according to Moslems, mostly performed by aspiration. They hold that in the days of Isa physic had reached its highest development, and that his miracles\nwere mostly miracles of medicine; whereas in Mohammed's time, eloquence had attained its climax, and accordingly his miracles were those of eloquence, as shewn in the Koran and Ahádis.\"—The Book of the Thousand Nights and a Night, Burton, V, 30.\n\nG. H.\n\n* * *\n\n93. Modes of carrying loads.—Notes are invited on the different modes of carrying loads, in baskets on the back, in use among Eastern peoples. The Malays of the Peninsula do not apparently use such baskets, but the Sumatran tribes do, also the aborigines of the Peninsula and the Dayaks of Borneo. Accurate descriptions of the baskets (called ambong, jangki, salei, jaras, etc., by the Malays) and the modes of fastening them would be of ethnographical interest. Gill saw (at Shih-ku, Yunnan) men and women carrying loads in baskets supported on the back and fastened to a wooden collar.—River of Golden Sand, II, 275.\n\nEd.\n\nFOLK-LORE.\n\n94. The Raja of the Bamboo.—Some years ago, I collected a number of legends current among Malayan tribes having as their principal incident the supernatural development of a prince, princess, or demi-god in the stem of a bamboo, or tree, or the interior of some closed receptacle.* I omitte l, how-\n\n* Journal of the Royal Asiatic Society, N. S., XIII, Part IV.\never, to mention that this very characteristic Malay myth occurs in the \"Sri Rama,\" a Malay prose hikayat, which, as its name betokens, professes to describe the adventures of the hero of the Rāmāyana.\n\nRoorda van Eysinga's edition of the Sri Rama opens with an account of how Maharaja Dasaratha sent his Chief Mantri, Puspa Jaya Karma, to search for a suitable place at which to found a settlement. The site having been found and cleared, the narrative proceeds as follows:\n\n\"Now there was a clump of the bétong bamboo (sa'rumpun buluh bétong), the colour of which was like gold of ten touch (amas sapuloh mutu), and its leaves like silver. All the trees which grew near bent in its direction and it looked like a state umbrella (payong manuwangi). The Mantri and people chopped at it, but as fast as they cut down a branch on one side a fresh one shot forth on the other, to the great astonishment of all the Rajas, Mantris and warriors. Puspa Vikrama Jaya hastened back to King Dasaratha and laid the matter before him. The latter was greatly surprised, and declared that he would go himself the next day and see the bamboo cut down. Next day he set out on a white elephant attended by a splendid train of chiefs and followers, and on reaching the spot ordered the bamboo clump to be cut down. Vikrama Puspa Jaya pointed it out shaded by the other forest trees. The king perceived that it was of very elegant appearance, and that an odour like spices and musk proceeded from it. He told Puspa Jaya Vikrama to cut it down, and the latter drew his sword, which was as big as the stem of a cocoa-nut tree, and with one stroke cut down one of the bamboos. But immediately a fresh stem shot forth on the other side and this happened as often as a stroke was given. Then the king grew wrath, and getting down from his elephant he drew his own sword and made a cut with it at the bamboo, which severed a stem. Then, by the divine decree of the Dewatas, the king became aware of a female form in the bamboo clump seated on a highly ornamented platform (gēta), her face shining like the full moon when it is fourteen days old, and the colour of her body being like gold of ten touch. On this, king\nDasaratha quickly unloosed his girdle and saluted the princess. Then he lifted her on to his elephant and took her to his palace escorted by music and singing.\"\n\n[Roorda van Eysinga's text of the \"Sri Rama\" was taken from a Ms. in parts illegible. De Hollander, speaking of this edition, says that there exist divers Malay recensions of the \"Sri Rama,\" all in prose. Extracts from a copy of this work are to be found in Marsden's Malay Grammar. They shew that his copy differed from that of Roorda.\n\nThe main feature of the same legend occurs in a Japanese story called Momotaro or Little Peachling from which I extract the following:—\n\n\"A long long time ago there lived an old man and an old woman. One day the old man went to the mountains to cut grass, and the old woman went to the river to wash clothes. While she was washing a great big thing came tumbling and splashing down the stream. When the old woman saw it she was very glad and pulled it to her with a piece of bamboo that lay near by. When she took it up and looked at it she saw that it was a very large peach. She then quickly finished her washing and returned home intending to give the peach to her old man to eat. When she cut the peach in two out came a child from the large kernel. Seeing this the old couple rejoiced and named the child Momotaro or Little Peachling because he came out of a peach. As both the old people took care of him he grew and became strong and enterprising.\"\n\nEd.]\n\n* * *\n\n95. The Crocodile.—In Perak the following names are given to the teeth of the crocodile.\n\nThe front teeth, ... ... kail seluang.\nThe middle teeth, ... ... apa ddia.\nThe back teeth, ... ... charik kapan.\n\nThe 'kail seluang' is a small fish-hook which is used without a bail for catching the 'seluang' a small fish rather larger than a sardine, a fish it somewhat resembles. Men, seized by these teeth only, have, so say the natives, a fair chance of escape.\n\n'Apa ddia' may be translated what power? i.e. \"How can I\"? A man seized by these teeth, though escape is said to be still possible, has very little chance.\n\n'Charik kapan' may be translated \"tear off (a strip of white cloth for) the shroud.\" All's up.\n\nH. C. C.\n96. Ceremonies when shooting rapids.—In No. 9 of this Journal, p. 26, mention is made of the propitiation of the spirits of the stream with offerings of rice and leaves by a passenger on board a raft, when shooting the rapids on a river in the Malay Peninsula. The same custom has been noticed in China. See Gill's description of the \"pilots of the rapid\" in *The River of Golden Sand*, I, 218; he says, \"Another method of softening the stony hearts of these ferocious deities is to sprinkle rice on the stream all through the rapid. This is a rite that should not be omitted.\"\n\nEd.\n\nDEMONOLOGY.\n\n97. Mantra.—Mention has frequently been made in the Journal of the Straits Branch of the Royal Asiatic Society, of the incantations employed by Malay *pawangs* in summoning, propitiating or threatening evil spirits. The following specimen (from Pérak) is particularly rich in curious nomenclature. Hindu and Muhammadan influences are severally traceable, no want of fitness in the confusion of names and ideas being perceived by the Malay mind. It is an incantation called *arak-arak jin sa'ribu*, or the procession of the thousand spirits. It is the first formula used by a *pawang* when commencing an important series of operations:\n\nBi-smi-lláhi-r-rahmáni-r-rahim  \nHei! Jin Allah akan kata-ku  \nKata hak yang sa-benar-nia  \nHei! Janu, jin janu, jin pari, jin aruah,  \nJin manusia, jin bahdi, jin pêla, jin pédâka  \nJin jémbalang, jin beranang, jin ebni jana,\nAku tahu asal mula-mu jadi\nImam Jamala nama bapa-mu\nSiti Indra Sendari nama mak-mu\nRubiah Jamin nama datoh-mu\nHakim Liar Suri nama moyang-mu\nChichit Malim di hutan\nPiyat Berangga Sakti di belukar\nSiah Badala di rimba\nSiah Rimba di langit\nSri Jambalang Makar Alam (iya yang di-sru sakarang Tungku Malim ka-raja-an) di bumi\nSang Berangga Bumi (iya yang di-sru sakarang Tungku Setia Guna) yang ber-tegak di pintu bumi di Bukit Kaf.\nBantara Alam di awan-awan\nSang Rangga Buana di angin\nBerangga Kala di gunong\nTambar Boga di bukit\nLanggi Tambar Boga di pangsa tanah\nBerangga Kala di barat\nSang Bègor (iya-lah Nasahi) di timor\nSang Dègor (iya-lah Nasahu) di utara\nSang Rangga Gampita (iya-lah Nasahah) di sélatan\nSang Rangga Gambira (iya-lah Nasahud) di tanah datar\nApa-apa Sipar Tapa di tanah lëpan\nAstara Pancha-mahbota di tanah dërut\nJamshid di tanjong\nSangka Kala Dègor di pangkal tanjong\nAnei-anei Siku Tanei di ujung tanjong\nAnin-anin Siku Tanin di busut\nSi-Kuda Bëlang di jerulong\nSi-Bëdut di mata ayer\nSang Kabut Lela di périgi buta\nSang Lela Ma-indra Panchalogam di tras\nShah Gardan di padang\nChanghong di gaung\nSang Rangga Berhala di tanah ruab\nRakshasa Sang Grahab di tanah busong\nSangka Rakshasa di guha\nSang Bêgor Indra di teluk\nPurba Kala di permatang\nSri Permatang di lurah\nDalik Rani di dani\nSri Danglit di batu\nJin Pari di kayu\nJin Bota Sri di umah\nRangga Kala di bendang\nSangka Kala di danau\nDangga Rahab di paya\nSang Lela Chandra di ayer\nMisei di arus di ayer mati\nSangka Pana di laut\nMambang Indra Gampita Simun Bangkana di tasek\nSang Bêgor Indra di arus\nSri Gemuntar di tasek\nSri Jala di pulau\nSri Gantala di kuala sungai\nJiji Azbar Jiji Dang Siti Udara Salam di sungai\nMezat di dusun\nSimun di dalam kampong\nAdas di rumah\nSang Lela di dalam manusia\nAl kanas ruh hewani nama niawa-mu\nGardam-gardin kapada tampat-mu diam\nNabi Kayani nama Penghulu-mu\nAku jangan angkau pechat-i.\n\n* * *\n\n98. Belief in Spirits and Demons.—Abdullah bin Abdul Kadir, Munshi, in his Autobiography, has an interesting passage on the beliefs of the Malays on the subject of spirits and demons, beliefs which are much more deeply-rooted than is generally supposed. He does not, however, differentiate between national customs and beliefs, and those which have\ncome in with the Muhammadan religion. And indeed it is not easy to do so. Here, everything is classed under the generic term *sheitan*, which is Arabic, and we find the *rakshasa* of Hindu romances and the *jin* and *efrit* of the Arabian Nights in the company of a lot of Indo-Chinese spirits and goblins, who have not come from the West like the others:\n\n\"I explained to Mr. M. clearly the names of all the *sheitan* believed in by Chinese and Malays; all ignorance and folly which have come down from their ancestors in former times and exist up to the present day, much more than I could relate and explain. I merely enumerated the varieties, such as *hantu, sheitan, polong, pontianak, penanggalan, jin, pelisit, mambang, hantu pemburu, hantu rimba, jadi-jadi-an, hantu bengkus, bota, gargasi, raksasa, nenek kabayan, himbasan, sawan, hantu mati di-bunoh, bajang, katagoran, sempak-kan, puput-kan, efrit, jemalang, terkena, ubat guna*. Besides all these there are ever so many *ilmu-ilmu* (branches of secret knowledge) all of which I could not remember, such as *gagah, penundok, pengasih, kebal, kasaktian, tuju, alimun, penderas, perahu, chucha, pelabi, perangsang*, and a quantity of others. All these are firmly believed in by the people. Some of these arts have their professors (*guru*) from whom instruction may be got. Others have their doctors who can say this is such and such a disease and this is the remedy for it, and besides these there are all those arts which are able to cause evil to man.\n\nWhen Mr. M. heard all this he was astonished and wondered and said \"Do you know the stories of all these?\" I replied \"If I were to explain all about them it would fill a large book, and the contents of the book would be all ignorance and nonsense without any worth, and sensible persons would not like to listen to it, they would merely laugh at it.\" He said \"Very well then, tell me about the *penanggalan* only, I should like to hear it and to write it down in English so that Europeans may know how foolish those persons are who believe in such things.\"\n\nI then drew a picture representing a woman's head and neck only with the intestines hanging down. Mr. M. caused this to be engraved on wood by a Chinese and inserted it with the story belonging to it in a publication called the \"Anglo-\nChinese Gleaner.” And I said “Sir, listen to the account of the penanggalan. It was originally a woman. She used the magic arts of a devil in whom she believed, and she devoted herself to his service night and day until the period of her agreement with her teacher had expired and she was able to fly. Her head and neck were then loosened from the body, the intestines being attached to them and hanging down in strings. The body remained where it was. Wherever the person whom it was wished to injure happened to live thither flew the head and bowels to suck his blood, and the person whose blood was sucked was sure to die. If the blood and water which dripped from the intestines touched any person, serious illness immediately followed and his body broke out in open sores. The penanggalan likes to suck the blood of women in child-birth. For this reason it is customary at all houses where a birth occurs to hang up jeruju* leaves at the doors and windows or to place thorns wherever there is any blood lest the penanggalan should come and suck it, for the penanggalan has, it seems, a dread of thorns in which her intestines may happen to get caught. It is said that a penanggalan once came to a man’s house in the middle of the night to suck his blood and her intestines were caught in some thorns near the hedge and she had to remain there until day-light when the people saw and killed her.”\n\n“The person who has the power of becoming a penanggalan always keeps at her house a quantity of vinegar in a jar or vessel of some kind. The use of this is to soak the intestines in, for when they issue forth from the body they immediately swell up and cannot be put back, but after being soaked in vinegar they shrink to their former size and enter the body again. There are many people who have seen the penanggalan flying along with its entrails dangling down and shining at night like fire-flies.”\n\n“Such is the story of the penanggalan as I have heard it\n\n* A kind of thistle.\nfrom my fore-fathers but I do not believe it in the least. God forbid that I should.\"*\n\n\"The origin of the polong is this. The blood of a murdered man must be taken and placed in a bottle (buli-buli, a bottle having a spherical or wide body and a long, narrow neck). Then prayers are said over it, and something or other is read, I don't know what but it has to be learnt. After seven days of this worship, according to some people, or after twice seven days according to others, a sound is heard in the bottle like the chirping of young birds. The operator then cuts his finger and inserts it into the bottle and the polong sucks it. The person who thus supports the polong is called his father, or, if it happens to be a woman, she is his mother. Every day the parent feeds it with his (or her) blood. The object of doing this and the advantage to be gained from it are these—if he entertains a feeling of anger against any one, he orders the polong to go and afflict him, that is to say, to cause him pain or sickness; or if a third person is at enmity with another he goes in secret to the person who keeps the polong and gives him a sum of money to send the polong to attack the person against whom he bears ill-will. This is the use of it. The person who is tormented by the polong, whether a virgin or a married woman or a man, cries out and loses consciousness of what he (or she) is doing and tears and throws off his (or her) clothing biting and striking the people near, blind and deaf to everything, and does all sorts of other things. Wise men are called in to prescribe remedies; some come and chant formulas over the head of the patient, others pinch his thumb and apply medicines to it. When a remedy is successful, the sick person cries out \"Let me go, I want to go home.\" The doctor\n\n*The Karens of Burma hold a similar belief.—\"The Na or Kephoo, as it is sometimes called, is, according to one myth, said to be a horrid vampire which sallies forth at night in the repulsive form of a human head and entrails, seeking whom it may devour. A person possessed of a Na, under the strange hallucination that human beings are rats, dogs, pigs, or other animals fit for human food, is supposed incontinently to devour them.\"—McMahon, Karehs, p. 151.\nreplies \"I will not let you go if you do not make known who it is that has sent you here and why you have come and who are your father and mother.\" Sometimes he (the polong in the patient) remains silent and will not confess or give the names of his parents; sometimes he confesses and says \"Let me go, my father is such-a-one and lives at such-and-such a kampong and my mother is so-and-so. The reason that I have come here is that such-a-one came to my parents and asked for their aid and gave them a sum of money because he bore ill-will against this person (or whatever the reason may have been).\" Sometimes he makes a false statement and mentions entirely wrong persons in order to conceal the names of his patients. As soon as the people know the name of the person who has contrived the attack and the reasons, they let him go, and the sick person at once recovers his consciousness, but he is left weak and feeble. When a polong attacks a person and will confess nothing, the person who is attacked shrieks and yells in anger and after a day or two he dies. After death, blood pours forth bubbling (ber-kopak-kopak) from the mouth and the whole body is blue with bruises. [Hikayat Abdullah, p. 143.]\n\nEd.\n\nMISCELLANEOUS.\n\n99. Land Revenue System, China.—\"All the houses, shops, and halls, pay a ground rent to the general Government, depending on their size and value, but no data are available for comparing the tax with that levied in western cities. The Government furnishes the owner of the ground with a hung ki, or red deed, in testimony of his right to occupancy, which puts him in perpetual possession as long as he pays the taxes.\"\n\n\"Houses are rented on short leases, and the rent collected\nquarterly in advance; the annual income from real estate is between nine and twelve per cent. The yearly rent of the best shops in Canton is from $150 to $400; there is no system of insuring buildings, which, with the Municipal taxes and the difficulty of collecting bad rents, enhances their price.\" *The Middle Kingdom—Williams, II, 18.*\n\n\"The Land Tax.—When waste shore lands [沙田] are reclaimed [業], the cultivator is usually allowed to reap the free benefit of his labour for five years before the land is made taxable [升科]. Arrears are seldom claimed for more than one year, as there are always witnesses ready to declare that the year of official discovery is only the fifth or sixth year. The highest land-tax is collected in Kiang-nan, where it runs as high as 3 mace 6 candareens the mow, or say 10 shillings the acre. The lowest taxation seldom falls below 1 mace and a few candareens the mow. Lands are classed as of best, worst, and middling quality, and are taxed accordingly; but no alteration in the quality of the land affects the taxation, which, as we have pointed out elsewhere, has been immutable since the reign of K'ang Hi. When reclaimed land is made taxable there is a lump sum charged for registration [註冊]. The proper and legal charge for land-transfers is 3 per cent., but 6 per cent. is usually charged. This 3 per cent. is due to the Provincial Treasurer, who issues slips [籤尾] to be attached to each newly-registered deed. The fixed official charge for these stamps is about 7 mace, but one dollar is the usual charge in Canton. As a rule, no one registers a land-transfer until the Magistrate is about to leave his post, when he reduces his fees to the lowest amount compatible with profit to himself.\" *China Review, p. 352.*\n100. The Indian Notes and Queries.—This successor of the \"Panjab Notes and Queries\" is to make its appearance in October next, 1886. The plan of the periodical will be practically the same as the \"Panjab Notes and Queries\"; but with the help of various scholars, all India and the Far East will be included in the scope of its operations. It will contain Notes from Aden, Afghanistan, Bombay, Burma, Central Provinces, Ceylon, Chamba, China, Gujarat, Java, Korea, Kumaun, Madras, Manipur, Nepal, North-West Provinces, Oudh, Panjab, Rajputana, Shansi, Sikkim, Sindh and Singapore.—Trubner's Record.\n\n[The publication of this series of Notes and Queries, in connection with the Journal of the Straits Branch of the Royal Asiatic Society, will now cease, but the Honorary Secretary hopes that Members of the Society and others will still continue to send him notes for publication in \"Indian Notes and Queries,\" edited by Captain Temple.\n\nEd.]\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/notesandqueries00brangoog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 156, "total-input-tokens": 251922, "total-output-tokens": 61164, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 253, 4], [253, 253, 5], [253, 529, 6], [529, 529, 7], [529, 2029, 8], [2029, 3402, 9], [3402, 5078, 10], [5078, 6386, 11], [6386, 7924, 12], [7924, 9405, 13], [9405, 11195, 14], [11195, 12626, 15], [12626, 14534, 16], [14534, 16789, 17], [16789, 18751, 18], [18751, 20426, 19], [20426, 22458, 20], [22458, 24500, 21], [24500, 26027, 22], [26027, 27572, 23], [27572, 29429, 24], [29429, 31753, 25], [31753, 34075, 26], [34075, 36453, 27], [36453, 38211, 28], [38211, 39923, 29], [39923, 41668, 30], [41668, 43486, 31], [43486, 43956, 32], [43956, 43956, 33], [43956, 43956, 34], [43956, 43956, 35], [43956, 44177, 36], [44177, 44177, 37], [44177, 44177, 38], [44177, 44177, 39], [44177, 45858, 40], [45858, 47616, 41], [47616, 49148, 42], [49148, 51139, 43], [51139, 52672, 44], [52672, 53905, 45], [53905, 55128, 46], [55128, 56851, 47], [56851, 59042, 48], [59042, 60876, 49], [60876, 62511, 50], [62511, 64590, 51], [64590, 66791, 52], [66791, 69102, 53], [69102, 70909, 54], [70909, 72696, 55], [72696, 74672, 56], [74672, 76458, 57], [76458, 78329, 58], [78329, 79827, 59], [79827, 81444, 60], [81444, 83504, 61], [83504, 84785, 62], [84785, 86313, 63], [86313, 87935, 64], [87935, 89791, 65], [89791, 91569, 66], [91569, 92690, 67], [92690, 93958, 68], [93958, 95201, 69], [95201, 96773, 70], [96773, 96773, 71], [96773, 96773, 72], [96773, 96773, 73], [96773, 96773, 74], [96773, 96773, 75], [96773, 96773, 76], [96773, 96773, 77], [96773, 98241, 78], [98241, 99526, 79], [99526, 100918, 80], [100918, 102755, 81], [102755, 104072, 82], [104072, 105687, 83], [105687, 106891, 84], [106891, 108090, 85], [108090, 109920, 86], [109920, 111467, 87], [111467, 113261, 88], [113261, 114713, 89], [114713, 116186, 90], [116186, 118291, 91], [118291, 120474, 92], [120474, 121628, 93], [121628, 123628, 94], [123628, 125969, 95], [125969, 128042, 96], [128042, 130066, 97], [130066, 132056, 98], [132056, 134338, 99], [134338, 136003, 100], [136003, 137964, 101], [137964, 140204, 102], [140204, 142494, 103], [142494, 144458, 104], [144458, 146716, 105], [146716, 148974, 106], [148974, 151245, 107], [151245, 153043, 108], [153043, 155368, 109], [155368, 157628, 110], [157628, 159870, 111], [159870, 161942, 112], [161942, 163222, 113], [163222, 163222, 114], [163222, 163222, 115], [163222, 163443, 116], [163443, 163443, 117], [163443, 164753, 118], [164753, 166148, 119], [166148, 167678, 120], [167678, 169330, 121], [169330, 171217, 122], [171217, 172782, 123], [172782, 174488, 124], [174488, 175337, 125], [175337, 176375, 126], [176375, 177714, 127], [177714, 178741, 128], [178741, 179868, 129], [179868, 180669, 130], [180669, 181494, 131], [181494, 182487, 132], [182487, 183618, 133], [183618, 185058, 134], [185058, 186905, 135], [186905, 188716, 136], [188716, 190807, 137], [190807, 192718, 138], [192718, 194360, 139], [194360, 196382, 140], [196382, 198239, 141], [198239, 199499, 142], [199499, 201691, 143], [201691, 203881, 144], [203881, 205341, 145], [205341, 206528, 146], [206528, 207590, 147], [207590, 209899, 148], [209899, 211883, 149], [211883, 214144, 150], [214144, 215853, 151], [215853, 217611, 152], [217611, 218552, 153], [218552, 218552, 154], [218552, 218552, 155], [218552, 218552, 156]], "primary_language": ["en", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "ar", "en", "ar", "en", "ar", "en", "en", "ar", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "id", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, true, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]