[{"id": "9a66ecbc1a1c3311df9f05b41b43250d5039b2e6", "text": "Key to Chinese Instruments.\n\n1. Pee-ba, Guitar.\n2. Shuen, Banjo.\n3. La-ba, short shepherd's Pipe.\n4. Kin, only used in sacred music.\n5. La-ba, long shepherd's Pipe.\n6. Dee-tz, Flute.\n7. Hao-toong, Trumpet.\n8. Sung, a tiny Reed-Organ.\n9. Yue-kin, moon-shaped Guitar.\n10. Hoo-kin, two-stringed Fiddle of the Huns.\n11. Goo, flat Drum, with drum-stick.\n12. Dee-tz, a short Flute.\n13. Ban, a pair of Bones, with which they beat time.\n— PAPER —\n\nON\n\nCHINESE MUSIC\n\nBY\n\nMrs. Timothy Richard,\n\nREAD BEFORE THE\n\nChina Branch of the Royal Asiatic Society\n\nShanghai, November, 1898.\n\n(Illustrated, Vocally and Instrumentally, by Natives and Foreigners.)\n\nREPEATED (BY REQUEST) BEFORE THE\n\nShanghai Literary and Debating Society\n\nJanuary 4th, 1899.\n\nSHANGHAI:\n\nAMERICAN PRESBYTERIAN MISSION PRESS.\nSYNOPSIS.\n\nI. General History of Chinese Music.\nII. Chinese Notation.\nIII. Time-marks.\nIV. Mathematical Proportions.\nV. Modulations.\nVI. Modes.\nVII. Harmony.\nVIII. Tune-books.\nIX. Instruments and Orchestras.\nX. Dancing.\nXI. Uses and Effects.\n\nAPPENDIX.\n\nA. Comparative Table of Notations.\nB. Chinese Modulator.\nC. Example of Chinese Tune with Time-marks.\nD. Chinese Tunes in Staff Notation.\nE. Pictures of Instruments.\nF. Examples of Dancing or Posturing.\nCHINESE MUSIC.\n\nThe following facts regarding Chinese music have all been gathered at first hand from Chinese authorities—no books on the subject by any foreigner having been consulted in the compiling of the paper. This was made possible by my husband handing over to me his rough notes in English, jotted down by him several years ago while reading Chinese books on music. The native airs collected, some of which are to be given as illustrations this evening, and many of which are embodied in our native tune-book and Mrs. Couling's Pentatonic Tune-book in Western notation—both of which lie on the table—were translated by me from native tune-books, or taken down as they were sung by priests or by blind singers.\n\nAs the subject opened up it seemed too vast for one to do justice to in an hour's paper; you will therefore excuse the partial treatment of several of the points.\n\nWe shall first give a short general history of Chinese Music; then say something on Chinese notation, time, mathematical proportions, modulations, modes, harmony, tune-books, instruments and orchestras, dancing, and, lastly, on the uses and effects of music according to the Chinese.\n\nI.—General History of Chinese Music.\n\nLike Babylon, Egypt and Greece, China has had its ancient music which was cultivated as one of its special studies, but, in common with the ancient music of those countries, that of China has been hopelessly lost. Though the ancient names remain, the present meanings, in most cases, are very different from what they once were.\nIf we listen to the legendary history of Chinese Music, we are told that about B.C. 2600—that is, in the time of Noah—the Emperor Hwang-ti commanded his minister, Ling-lun, at the Kun-lun mountains in Bactria, to cut bamboo tubes, blowing which would produce an imitation of the notes of the fabulous bird Fung-huang, or Phoenix, the male giving six notes and the female other six. The most common account is that the male bird gave the notes equivalent to our C, D, E, F#, G# and A#, and the female C#, D#, F, G, A, B; or in other words, the male bird, beginning with C, gave six notes ascending a tone apart, and the female also gave six notes a tone apart, but beginning with C#—giving their notes alternately and thus making between them a chromatic scale. (See Appendix, D 28.)\n\nAnother fanciful way of accounting for the twelve lü, or pitch pipes, is this:—That the male and female birds sang alternately the following notes, those of the female bird being a sort of echo or response to the notes of the male bird:—C-C# (upper octave), D-B, D#-Bb, E-A, F-Ab, F#G. That is, the male bird, beginning with C, ascended first a whole tone, then proceeded by semitones; and the female bird, beginning with C# in the higher octave, descended first a whole tone, and then proceeded by semitones, till they met together on G. (See Appendix, D 29.)\n\nThese same couples of notes were the key-notes in the music used in the worship of the different spirits. The first couple were used as the key-notes in worshipping the spirits of the sky.\n\nThe 2nd, in worshipping the spirits of the earth.\nThe 3rd, in worshipping the spirits of the points of the compass.\nThe 4th, in worshipping the spirits of the mountains and rivers.\nThe 5th, in worshipping the spirits of female ancestors.\nThe 6th, in worshipping the spirits of male ancestors.\n\nIn a book called the *Yo Tsz* (Book 7, p. 2.) we are told that in the ancient worship of heaven and earth the instrument played the following notes in all the twelve keys, ascending in succession, viz., 5th, 2nd; 6th, 3rd; 7th, sharpened 4th; sharpened 8th, sharpened 5th; sharpened 2nd above, sharpened 6th; natural 4th (or sharpened 3rd above) and last the 8th or high keynote.\n\nWhile the instruments played these, voices gave other notes alternately with the instrumental notes. The vocal notes were:—Sharpened 4th, 7th; 3rd, 6th; 2nd, 5th; 1st, 4th; flattened 7th, flattened 3rd; flattened 6th and flattened 2nd. These also were given in the twelve keys, but descending. (See Appendix, D 30.)\n\nIt would be amazing if voices could take these alternate notes without an instrument to guide them. The instruments give a progression of fourths, and the voices perfect fifths; instruments ascending and voices descending, as the fabled birds were said to have done. If this be what it professes, it is the most ancient music in the world as it is said to have been in use from B.C. 2,600.\n\nThe next most ancient music is that sung to the ancient odes, (unless we except the original music of the song of Moses, which the Jews say they still possess). It is from a standard work published in 1544, and purports to have come down though Chu Hi, a commentator of the 11th century.\n\nBe these fabulous stories and ancient music what they may, we know for certain that before Confucius there were national music teachers, that in the time of Confucius (B.C. 500) music was one of the six arts to be learned, and that Confucius accompanied his own songs with musical instruments. Ancient books on education state that thirteen was the proper age for boys to begin to learn the art of music and to read poetry.\nThe other particulars regarding music, which we are perfectly certain existed long before the burning of the books (3rd century B.C.) are the following:\n\n1. The twelve semitones composing an octave.\n2. The five notes of the ancient Pentatonic scale.\n3. The eight different kinds of sounds produced by eight kinds of instruments.\n4. The six kinds of dances with which music is accompanied.\n\nThe mania which Confucianists had, of fathering all their theories on some mythical Emperor of the far past, had become such a nuisance that Tsin Sz-hwang determined to put an end to it by destroying most of their books; for he had come to the conclusion that it was far better to have no books at all than to be hampered on all sides by would-be precedents. In this catastrophe, about B.C. 200, perished the ancient music of China, though some writers claim that a few books on music did survive the general conflagration.\n\nAs it has been the firm belief of Chinese scholars for milleniums that ancient music had not only power to change the savage nature of animals, but that music, along with worship, surpassed all other powers in transforming the manners and customs of a people, and that it had power in heaven as well as earth, therefore all the ablest men through all the ages have been in search of that ancient music. The scholars of Han, while reconstructing the ancient books of China, laboured hard with the theory of music, but to this day almost all declare that ancient music had been lost beyond recovery and always speak of music as a lost art, and this loss of ancient music in China, as in the West, was probably for want of a proper musical notation.\n\nIn the 6th and 7th centuries original and foreign music was introduced, Indian music being introduced by the Buddhists. (See Appendix, D 18).\nIn the beginning of the 8th century, the Emperor Ming Hwang established a conservatory, or dramatic college, called Kiao Fang, in the Le Yuen, or Pear Garden, at Si-guan-fu. The actors to this day call themselves \"Students of the Pear Garden.\" Modern music really dates from the T'ang dynasty (A.D. 600).\n\nBefore the time of the conquest of England by the Normans in the 11th century, Chinese scholars again declared that, however much might be the boast of individuals here and there, ancient music was a lost art. Terribly against the prejudices of the Confucianists (as recorded in the books of that date) they had no other alternative but to adopt what to them was foreign music or be without it altogether, for it was then that the music of the Northern Liao dynasty was generally introduced, viz., the 工尺 (kung-cheh) system, equivalent to the sol fa of the West.\n\nBut notwithstanding the adoption of this foreign system, the Chinese throughout the ages have retained the ancient nomenclature and ancient instruments, and try on all great occasions, besides giving modern music, to give what they would fain believe to be ancient music.\n\nBefore closing this part of the paper, in order to give some idea of the many layers of strange views that have accumulated about the original five notes, equivalent to our do, re, mi, so, la, we give the following translation:—The five notes are in heaven the essence of the five planets, on earth the soul of the five elements, in man the sound of his five organs, viz., Do the spleen, Re the lungs, Me the liver, So the heart, and La the stomach. They correspond also to the five virtues. The full translation is as follows:\n\n\"Do is earth, its symbol a Prince, its nature faithfulness, its taste sweet, its colour yellow, its business is with thought, its position is central, its length 81, its sound heavy but easy, like a cow lowing at drinking water; it is founded on union.\"\n\"Re is mineral, its symbol a minister, its nature righteousness, its taste pungent, its colour white, its business is with speech, its position is westerly, its length 72, its sound clear and quick, like a sheep having lost its companion; it is founded on expansion.\n\n\"Me is vegetable, its symbol a subject, its nature love, its taste sour, its colour green, its business is with appearances, its position is eastern, its length is 64, its sound is defensive and careful, like a pheasant lighting on a branch; it is founded on courage.\n\n\"So is fire, its symbol affairs, its nature worship, its taste bitter, its colour vermilion, its business is with seeing, its position is southern, its length is 54, its sound is overflowing and quick, like a pig screaming; it is founded on independence.\n\n\"La is water, its symbol things, its nature knowledge, its taste salt, its colour black, its business is with hearing, its position is northern, its length is 48, its sound is scattered and hollow, like a horse neighing in the desert; it is founded on putting forth.\"\n\nAgain, \"listening to\n\n\"Do one feels comfortable and broad.\n\"Re ,, ,, upright and fond of righteousness.\n\"Me ,, ,, pity and love.\n\"So ,, ,, fond of doing good.\n\"La ,, ,, correct and fond of religion,\"\n\nWhen they got the seven notes they said these corresponded to the three powers—heaven, earth, and man—and the four seasons. The 12 semitones corresponded to the 12 months of the year and the 12 hours of the day.\n\nWhile very much of this is fanciful, all of it is not so. The comparative lengths given are mathematically exact. Some Western musicians also associate certain colours with certain sounds. Curwen, too, gives effects of each note of the scale on the mind to assist the student in recognizing the notes when\nheard, viz., Do strong or firm, Re rousing or hopeful, Me steady or calm, Fa desolate or awe-inspiring, So grand or bright, La the sad or weeping tone, Si the piercing or sensitive tone.\n\nMany years ago, the effects or characters of the various keys as given by Beethoven interested me very much. Some treat this as fanciful on Beethoven's part; but as long as the fifths are not equally tempered there must be a different effect. If the system of equal temperament were better carried out the difference would be less apparent than it is.\n\nBeethoven, at all events, had such a distinct idea of the uses of the various keys that he altered the keys of songs sent to him for criticism. Has this not some resemblance to the ancient notion of the Chinese that only certain keys were suitable to be used in the worship of the spirits of the sky, of the earth and of ancestors?\n\nSo much for the general history; we now come to consider:\n\nII.—Notation.\n\nThe earliest instrumental notes, as we have seen, are 12, equivalent to our chromatic scale of 12 semitones. They are called the 12 lü, or pitch-pipes. Their names are Whang-tsung, Ta-lü, Tai-ts'ü, Kia-tsung, Ku-hsi, Choong-lü, Rui-pin, Lin-tsung, I-tsê, Nan-lü, Wu-i, Ying-tsung. These give the names to the keynotes. These existed, as we have said, before the burning of the books, 3rd century B.C. (See Appendix, A 1.)\n\nIn the days of Mencius the ordinary notes in use for singing were five, called Kung, Hsiang, Kioh, Tsü, Yü, equivalent to the 1st, 2nd, 3rd, 5th and 6th of our modern scale. (See Appendix, A 3.)\n\nThese form really the most natural scale, as it pleases men universally. The tunes of most primitive peoples are founded mostly on these five notes. That limited scale is sometimes called the Pentatonic, sometimes the Doric, and sometimes the Scan-\ndinavian. Though in a volume of modern Scandinavian songs I could not find one song without semitones, we in Scotland have yet songs and Psalm tunes on this scale, such as \"Auld Lang Syne,\" \"Ye Banks and Braes,\" \"Skye Boat-song\" and \"O'er the Moor,\" among our songs; and Kilmarnock, Coleshill, Balerma and Morven among our Psalm tunes. Among the jubilee airs, sung so sweetly by the negroes, there are many without semitones, as, \"Swing Low,\" \"In Bright Mansions Above,\" \"The Gospel Train,\" and \"Steal Away to Jesus.\"\n\nThe fact that most of the Chinese native airs are founded on this scale accounts for the difficulty the grown up Chinese have in singing well our Western tunes that have semitones. While they sing perfectly such tunes as \"Auld Lang Syne\" (which we use as D. C. M.) and \"Ye Banks and Braes\" (which we use as a D. L. M.), \"Happy Land\" and \"Jesus Loves Me,\" which also contain no semitones, they cannot possibly sing correctly Old Hundred, which seems so simple to our ears, because it has a semitone in each line.\n\nThe Pentatonic scale then was certainly known in China B. C. 300—how much earlier we cannot tell.\n\nIn the Han dynasty (B. C. 206-A. D. 190) other two notes were in use, viz., the sharpened 4th, called Pien-tsü, and the 7th, called Pien-kung (i.e., a semitone below the 5th and a semitone below the key note). These seven, however, are not the ordinary diatonic scale from C to C, for the semitones were between the 4th and 5th, and 7th and 8th. Some say this scale must be more natural than our scale of C with F natural as 4th, because beginning from C the F\\# is the 6th perfect 5th, while the F natural is the 11th or very last.\n\nIn the reign of Wu-ti (561-578) the K'iu tsü nation, from Turfan in Central Asia, brought new music to China. Their seven notes, though called by different names, were the same as those the Chinese already had, with semitones between the 4th and 5th, and 7th and 8th.\nThis was about the time that Gregory the Great introduced his chants from Egypt throughout Europe, which were called after him \"Gregorian Chants.\"\n\nIn the Sung dynasty (960-1126) the notation known as 工尺 (pronounced goong cheh), equivalent to our sol-fa notation, had become common. (See Appendix, A 4). It has the seven notes, with semitones between the 3rd and 4th and 7th and 8th. This scale came from the Northern Liao dynasty, a race related to the Mongols and Manchus. This was a little before Guido (who died 1050) invented the stave and introduced the use of the syllables, ut, re, mi, fa, so, la; these being the first syllables of a six-lined hymn to John the Baptist. The ut was afterwards changed to the more open syllable do. Not till 1600 odd was the seventh name added in Europe by a Frenchman, Lemaire, who called it si. We thus find that the Chinese had the complete names for the diatonic scale 600 years before it was completed in Europe, and that China had its sol-fa system over 800 years before Carwen (about 1840) started his sol-fa system.\n\nThis notation, whether Chinese or foreign, when thoroughly learned first and afterwards applied to the stave—then called solfeggio, and the key-note always being do—makes the most expert readers at sight of any musical system. We strongly advise, in teaching the Chinese, that either Carwen's sol-fa or the Chinese 工尺 be first used in teaching them to sing. The 工尺 has the advantage of being written downwards and is already universally known over the empire. The stave could be used afterwards.\n\nAlthough the Chinese have been from eight to nine centuries before us with their sol-fa system, they have not yet in that system a complete scale of twelve semitones. In fact they have only one accidental—the sharpened 4th, called keu—which was added to the new scale to make it correspond more to their previous scale in which the sharpened 4th was a very special feature. So we have had to add the others to make it complete,\nMost of the music of the world is transcribed in three systems of notation—the staff and sol-fa of the West, and the 工尺. This last has no mean following in China and Japan.\n\nIII.—Time.\n\nThis 工尺 notation is sadly defective in time marks.\n\nThe chief time marks in common use are two—a cross, (x, called pan) and a circle, (o, called yen)—the first put at the side of the accented and the second at the side of the unaccented note, equivalent really to the beats in our bars. If they want more than one note to be sung to the one beat, they just crowd in the number of notes to be sung to it at the side of the pan or yen—it may be 2, 3, 4, 5, or even more. The awkwardness of this must be apparent at once. To supplement, therefore, we have used Curwen’s marks for all divisions of time. On the other hand, if they want a note to last two or more beats, they crowd in the x o at the side of that note. This crowding of pan yen we have obviated by using Curwen’s dash—only made vertically.\n\nOther time-marks are used variously in different Chinese books, but there is no uniformity. The fact of the indistinctness of the time-marks, and anciently the want of them altogether, accounts for the fact that a Chinese musician has to hear a tune before he can play it, and also for the fact that we hear the same tune rendered so differently in different parts of China.\n\nIn Europe Franco of Cologne, in the 13th century, was the first to indicate the duration of notes by their form. It is hard to find out when the time marks (x o) were introduced into China, but most probably they came with the 工尺 in the 10th century. Music used in the worship of Confucius has no time marks. It is so slow each note seems a bar in itself. (See Appendix, D 1-10).\n\nThe Chinese have only simple common time, so triple and compound times are novelties to them. For triple we use\none cross and two circles; and for compound a large cross and two circles for the first beat, and small cross and two circles for the other beat or beats.\n\nAs to beating time: When the music of the Shih Liang (near Central Asia) came to China, they beat time and called it \"p'o pan,\" that is, striking the board. A time baton is mentioned in one place as among the musical instruments. It is said that a little drum filled with chaff was used to mark the time in the Chow dynasty, which ended B.C. 265.\n\nNow we come to consider\n\nIV.—Mathematical Proportions.\n\nAs the scientific men of the West, in order to have uniformity in all their calculations, have in modern times agreed to adopt the C.G.S. system of weights and measures, so the Chinese, at least 2,000 years ago, endeavoured to get some common basis from which to calculate their weights and measures.\n\nThey chose twelve bamboo tubes which would give notes neither too high nor too low. The hwang-tsung, or lowest of these pitch-pipes, was made from a bamboo nine inches long and the bore about one inch in diameter. This was filled with millet grains, and from the size of these grains some say they got the fractions of their inch in ninths; 9 inches give 81 parts as the length of this lowest note. From this they calculate all their weights and measures. Hence the relation of their ancient music to their sciences.\n\nTheir table of weights and measures goes thus:—100 millets = 1 chu, 12 chu = 1 yo, 2 yo = 1 oz., 16 oz. = 1 catty, 30 catties = 1 kuin, 4 kuins = 1 tan. But for finer divisions they begin with the thickness of a silk fibre, which they call a hu; 10 hu = 1 miao, 10 miao = 1 hao, 10 hao = 1 li, 10 li = one-tenth of an inch.\n\nThis hu is about one one-hundred-thousandth part of a centimetre, from which the C.G.S. system reckons; the cen-\ntimetre is one one-hundred-millionth part of the quadrant of the earth. The object of both is to start with something in nature as a unit from which to calculate. But, true to the almost universal contrariety, in the West the Frenchman makes the circumference of the earth the unit from which to calculate, and in the East the Chinaman the smallest thing he can think of—a single fibre of silk as emitted by the silk-worm for the finer calculations, and one grain of millet for the commoner.\n\nOn the subject of lengths of strings and tubes producing certain sounds they exhibit a vast amount of mathematical knowledge. Strange to say, though the Chinese at present seem to know little or nothing of vulgar fractions, these minute calculations, as given in Ch'in Yang's Music-book (Yo Shu, 樂書) of date 1195, are worked out not merely in vulgar fractions but the integers are neither duodecimal nor decimal but so many nines.\n\nInstead of going into details, which would be wearisome, we give the gist of the result:\n\nSz-Ma-Ch'ien, the Herodotus of China, who died 85 B.C., gives the lengths of pitch-pipes for producing the 5 notes as follows:—Taken by 5ths they are: Do or C 81, so or G 54, re or D 72, la or A 48, mi or E 64. Or ascending in their order of sound: C 81, D 72, E 64, G 54, A 48. He also gives the simple rule by which he found these figures, viz., starting with 81 and subtracting $\\frac{1}{3}$ and adding $\\frac{1}{3}$ alternately he finds the values by fifths. Scholars of the Han dynasty applied this rule to all the twelve semitones, and this is precisely as we reckon vibrations and on the same principle as our tuning by fifths.\n\nThe date of fixing the measurement of strings is not so easily got at, but they got octaves by halving the lengths and the other notes by subtracting and adding thirds. But as the lengths of octaves by halving are slightly different from the octaves got by progression by fifths (found by subtracting and\nadding $\\frac{1}{3}$ alternately,) they have to distribute the difference as best they can to suit their ears, precisely as we have to do in tuning with what we call the wolf.\n\nThe Chinese seem to have known about allowing a difference in the length of a pipe from that of a string producing the same sound, though perhaps they could not give a scientific reason for it any more than our musical instrument makers in the West; the reason probably being that a little must be added to the length of a pipe to allow for the compression of the air when the tube is blown on.\n\nIn connection with this a recent incident may be interesting as showing that the Chinese are not so far behind in this subject as some are apt to suppose.\n\nAt the Shanghai Arsenal, Professor Tyndall's book on \"Sound\" was translated. In it the professor gave the lengths of tubes and strings as exactly the same to produce the same sound. A Chinaman who read this, finding it different from that given in Chinese books, sent to Nature, through Dr. Fryer, a paragraph questioning the accuracy of Professor Tyndall's statement. Tyndall himself did not reply but someone else replied for him, expressing his astonishment that a Chinaman should ever dare to question the accuracy of any statement coming from such a source; but the explanation he gave showed that he knew nothing of the difference. Had he applied to any organ builder or musical instrument maker he would have found that the Chinese were right.\n\nSo much on mathematical proportions. We now proceed to say a few words on\n\nV.—Modulation.\n\nKing Fang, first century B.C., is said to be the first to explain the transposition or modulation of keys. But a Chinese Dictionary of Music, Yo Tien (樂典), published in 1544, says that in A.D. 471 Tow Kung, a blind musician, presented a book with mathematical tables of twelve semitones and modulator to the\nEmperor Hiao Wen-ti, purporting to have been an ancient book. This book is said to have survived the burning of the books by Ch'in Tze-whang. But as the blind musician is said to be 180 years old we fear the whole story may be a myth. The modulator, given in Yo Tien of 1544, is a sufficiently interesting fact in itself. The scale is the old one of seven notes that has the semi-tone between 4th and 5th. It is precisely on the same principle as Curwen's Modulator, but, with the usual reversal of things, counting from top downwards instead of from below upwards as Curwen's does. (See Appendix, B.)\n\nVI.—A Few Words Now on Modes.\n\nSince the modes with us are distinguished by the position of the semitones we are apt to think that Chinese airs, mostly based on the primitive scale of five notes that has no semitones, cannot possibly belong to any of our Western modes. Yet the effect in some cases is so distinctly major and in others so distinctly minor that the Chinese may be said to have major as well as minor modes. Generally the tunes are such, however, that you cannot tell to which mode they belong.\n\nA good many distinctly minor airs, just like ours, dwell on the 6th or la as the leading note. Others again are nearly equivalent to our old \"re\" mode, so rarely used but so effective. The only specimen of it that has fastened itself on my memory from among our Western tunes is the old Scotch tune \"Martyrs.\" A Buddhist chant in re mode was taken down when heard sung by some hundreds of priests at their annual gathering in Wu Tai Shan in Shansi. It was sung antiphonally; the half not singing prostrating themselves till the other half finished, when they rose and sang while the other half prostrated themselves. (See Appendix, D 19).\n\nThat the minor mode is more prevalent among Chinese airs is accounted for by the fact that the pentatonic scale,\nmostly in use, has two minor thirds in it without the alternative of a note between as with us. Just as though we had only the sounds of the black keys of the piano.\n\nWe now proceed to say a few words on\n\nVII.—Harmony.\n\nThere is no such thing as part singing in China, nor have we met tunes harmonized in any book; only the melody is written. But the rudiments of harmony are to be found in a book published as early as 1525; how much earlier they were in possession of these rudiments we cannot tell. Their various instruments in the various keys are tuned in fifths and made to respond to one another in fifths. The sung is often played in fifths and octaves. The Lama priests in Wu Tai Shan intone their prayers in very deep notes a fifth apart, or an octave apart. When they began to do this we have no means of knowing.\n\nHarmony, even in the West, only began about three centuries ago. Before that, singing was in unison and antiphonal and sometimes fugal. The idea of harmony, strange to say, is said to have come from Northern barbarous hordes. The Dutch were the first nation to sing in parts, the Italians next took it up. The English have the credit of leading the van in glee-singing in the days of Purcell and Arne. Harmony, however, has been brought to its present perfection mainly by the Germans.\n\nOur harmony, however, is utter confusion to the Chinese; doubtless they think it barbarous. The only harmony they think of is the harmony of the different sounds of their eight kinds of instruments, that is, using only the instruments that sound well together and are appropriate to be used on any given occasion.\n\nWe once sang a part of Handel's Hallelujah chorus, soprano and bass, in the hearing of a very efficient amateur Chinese vocalist. He declared that the lower part sung (bass)\nwas supplied by their instruments, so there was not much difference after all between Eastern and Western music!\n\nIt is advisable, I find, when leading the Chinese Christians at worship, only to play the air before beginning, otherwise they have not the least idea what is going to be sung. If it happens to be a tune they can sing well, the harmony can be filled in while they sing. If it be a tune they do not know thoroughly, it is well to play nothing but the air till they know it, otherwise there will be many who never learn it at all and go on spoiling what otherwise might be very good singing; some growling any low sound that occurs to them, and others screeching a falsetto, both thinking they are faithfully imitating the sounds produced by the organ.\n\nVIII.—Tune Books.\n\nThese are very numerous but may be divided into three classes.\n\n1. Those containing music used in the worship of heaven and earth and of ancestors. A book published in 1525 professes to give this music. If so, it is certainly the most ancient music in the world, for it says the music has been in use from B.C. 2600. Another, published in 1544, gives the tunes sung to the ancient odes. These also profess to be as old as several centuries B.C.\n\n2. There are books containing music used in the worship of Confucius which became national 500 years after his death, (he became chief among Chinese sages 1100 years after his death), some under date A.D. 1629, others 1741, and one book so recent as 1882.\n\nAs the tunes given under the last date are composed of thirty-two notes, any of these can be used as a long measure. It would be advisable to transpose them to C or even D minor. Originally they are in A minor and are too low for ordinary purposes. (See Appendix, 1-10).\nMany tunes are called by the same name but are totally different in their notes, e.g., of the \"Mo Li Hwa\" there are many versions, also of \"Pu T'ien Lo\" or \"Universal Happiness.\"\n\nSome tune books give very good voice exercises. One called \"Ba Ban\" is known all over China. Probably this air is known by more people than any other single tune in the world. (See Appendix, D 20)\n\nNow we come to\n\nIX.—Instruments.\n\nThe Chinese divide their instruments into eight kinds—(1) metal, (2) stone, (3) earthen or porcelain, (4) leather, (5) silk or stringed, (6) melon or wind, (7) bamboo, (8) wood. (See Appendix, E.)\n\nThe Pa Yin—eight sounds—which the Chinese often speak about and which so many think refers to the eight notes of the scale, really means the eight sounds produced by their eight different kinds of instruments. Hence the musical box, which to them seems quite an orchestra in itself, gets the name of the \"Pa Yin Ho Tsû,\" or box containing the sound of the eight instruments.\n\nBut of these eight kinds there are varieties—of metal 8 varieties, of stone 5, earthen 2, leather 9, silk or stringed 7, wooden 3, melon-shaped 6, and bamboo 5—in all 45 common varieties.\n\nBesides these there were unusual kinds. In 785, in the reign of the Emperor Teh Tsung I, jade instruments were brought from India by the Buddhists. The Emperor Tu Tsung (1056) had a flute from Szechuen made of something like tortoise shell. About the same time they had some musical instruments of red ivory. Instruments were also made of the bark of beech trees. The Liao dynasty had instruments made of leaves, also of cocoa nut. According to a book of the T'ang dynasty, stringed instruments were not equal to reeds, and reed instruments not equal to the voice. Then follows an incident\nof hushed thousands listening to a song sung by an eunuch without accompaniment.\n\nIn the 5th year of Hung Wu (1372) the Board of Ceremonies was ordered to make musical instruments and distribute them through all the Confucian colleges in the empire.\n\nAmong the stringed instruments the kin is the most ancient and honourable. It derives its name from \"prohibit,\" because its sounds restrain and check evil passions. The pipa, or guitar, is of foreign origin but has been in China considerably over 1,000 years.\n\nAmong the wind instruments is the sweet-toned sung, with its perfect reeds. Few know that this small instrument is the ancestor of our harmonium or American organ. A Russian, in possession of a sung, built an organ with similar reeds. A Frenchman seeing it thought the reed might be used with a key-board without pipes. He succeeded, and this, developed, has given us our harmoniums and parlour organs.\n\nAmongst the curiosities of Chinese musical instruments are the musical stones, made in the shape of a carpenter's square and suspended in two rows of six, each giving one of the twelve semitones. In a Chinese book of the 12th century there is a picture of the Jews' harp, and the question arises, \"Did we get it from the Chinese, or the Chinese from us or the Jews?\" That book has also a picture of Pan's pipes.\n\nA few words on orchestras or choirs. On great occasions at one time we find the number of musicians and dancers fixed at 64 each, divided into eight eights. At another they had 108 musicians, 132 dancers, all over fifteen and under twenty years of age.\n\nIn the Kin and Liao dynasties, when they wanted special music twice a year, instead of having royal musicians always on hand they called in ordinary musicians and had them practise for twenty days. Their choir numbered over 300, consisting of players 100, bird imitators 2, boys 71, girls 137; total 310.\nAfterwards the boys and girls were dispensed with. The same list gives football players 23, doorkeepers 32, banners and drums 40, wrestlers 21. These games were accompanied by music and were played in connection with acts of worship.\n\nNow we come to\n\nX.—Dancing.\n\nThe dance in China is so different from what we have in the West that many do not call it dancing but posturing. (See Appendix, F.)\n\nDancing is divided into two kinds, civil and military, or the sacred and the secular.\n\nBy the military is meant that which we commonly see on the stage of the Chinese theatre when a troupe comes in armed with spears and swords, bows and arrows, and goes through a regular sham fight, but all according to minutely prescribed forms. Acrobatic feats also come under this term.\n\nIn the sacred or civil dance, which is performed in connection with religious ceremonies—worship of heaven, of earth, of ancestors and of Confucius—they have eight, sixteen or more dancers, arranged symmetrically in rows of two sets, dressed in uniform, (as also are the singers), holding in their hands two rods about a yard long, one of them having two or more feathers from one to two feet long attached to the end of it.\n\nAt the sound of the first word of the hymn they take a certain position—it may be all alike, such as the holding of the rod high up straight in front of their faces. At the sound of the second word the two sets on East and West may turn and face one another. At the sound of the third word they may turn their faces from one another. Sometimes they bow half way down, sometimes they go on their knees, sometimes they make complete prostrations. The feather rod in all cases has also its definite position, now this side and now that. There is a book which is full of pictures of the positions. One foot is\nsometimes on heel and sometimes on toe in certain postures. This is carefully performed on high occasions in the worship of Confucius.\n\nIn former dynasties there are instances of women taking part in music and dancing, but in the present dynasty women neither play, sing, nor dance on occasions of worship.\n\nIn public theatres, too, when they have secular music and dancing, the rule is that there shall be no women, but men personify women both in singing and dancing, singing with falsetto voices. This probably is the origin of the falsetto singing so commonly heard in town and country throughout China.\n\nNow we come to our last point, viz:—\n\nXI.—Uses and Effects.\n\nOriginally in China, as elsewhere, music was sacred. It was used at the worship of heaven and earth and at the worship of ancestors and of Confucius.\n\nThe Yo Tien (Dictionary of Music) frequently mentions grants of musical instruments to various peoples, the Coreans being mentioned several times. They were usually grants to new temples.\n\nThe music used at the worship of Confucius is very slow, and the notes within a small compass. The reason given for this is that as Confucius was the great exponent of the \"Doctrine of the Mean\" it was not proper to have notes either too high or too low. The notes range generally from A, second line below the treble stave to A, second space of treble, exactly one octave. Confucian music of the last and present dynasties is still preserved.\n\nMusic at ancestral worship comes down from the very earliest times. At death of Empresses and Imperial concubines, however, all music was stopped for a given time. In the reign of Yung Lo, at the death of the Empress in 1423, all music was stopped for 100 days. Two years afterwards, at the\ndeath of Yung Lo himself, music among all officials, foreign as well as native, was stopped for three months and at all marriages within that time. It was the same at the death of the late Emperor Tung Chi.\n\nIn the 7th year of Tien Swun (1464), at the death of an Imperial concubine, all music was stopped for five days. At the usual hours for music the choir and orchestra got ready as usual and stood, instruments in hand, perfectly silent in their places all the allotted time. This must surely have had a very mournful effect.\n\nOn all great occasions, such as coronations, receptions, receptions of foreign ministers, and the like, music was played, choirs of women sometimes taking part. On one reception of foreign ministers we are told that the foreign ministers gave specimens of the dancing of their native countries.\n\nOn birthdays, and particularly on the coming of age of the eldest son, musicians are called in. This, too, from very ancient times. The eunuchs were sometimes trained as singers. An eunuch in the reign of Yang Ming-hwang, named Kao Lisz, was a very celebrated singer. One day, at a great feast, when thousands of people were talking together, the eunuch began to sing, and it was immediately as quiet as though not a single person was present.\n\nThe Chinese have various kinds of music to suit the five kinds of etiquette: 1, for joyful occasions; 2, to be used under calamities; 3, that for hosts welcoming their guests; 4, martial music; 5, that used for congratulations.\n\nAs in the West the miracle play preceded the theatre, so the drama in China was originally sacred, and the music used was reckoned sacred. To the present day, with the exception of the theatres at the ports, Peking and perhaps large provincial capitals, theatricals are generally given as an expression of thanksgiving, e.g., for rain or good harvest. To meet this expense there is a local rate imposed. But because the theatricals\nare of a religious nature, that is, given in honour of some deity, the Christians have a dispensation from this imposed rate.\n\nUnder Mongol rule very frequently games accompanied the worship of heaven and earth, such as riding and shooting at willows while riding, or hitting a ball with sticks while riding at a great rate (something like the game called Polo in the West). At these games music was played, accompanied by much beating of drums, to encourage the players. The Mongol dynasty, too, had its national music.\n\nMusic was divided into secular and sacred in the Sui dynasty (589-618). The music played at marriages and on birthdays, so familiar to many of our ears, may be regarded as on the borderland between secular and sacred. The music played by bands of troubadours, while one of their number tells a story, is secular. It is a great treat to villagers when a band of these come to their village of an evening. The musicians find some suitable place, and the villagers, finished with their day's work, gather round them and enjoy an hour or two's entertainment of story and song—stories generally of famous men and women, with accompaniment of two, three or more instruments—a kind of guitar, the fiddle (hoo kin, or fiddle of the Huns), the flute (deetz) and the bones and drums. Fancy poor Goldsmith making his tour through Europe singly, maintaining himself on the uncertain pittance got by playing his flute! He could not have looked so cheerful as these Chinese troubadours do.\n\nIn Tai Yuen Fu there was a single musician who went about, but he was a complete band in himself. He sang, played a fiddle, two kinds of gongs, cymbals, bones and bells. When he shook his head the bells rang, the bones were attached to his ankles, the cymbals to his knees, etc.\n\nThese Chinese troubadours, judging by their appearance, seem to be well entertained wherever they go.\nThe music played by the blind is also secular. The Chinese have no schools for the blind except musical ones. That seems the only door open for them to gain a livelihood. It is pleasing to see the general respect paid to blind musicians by the Chinese.\n\nA noble example of using blind musicians for the spread of Christianity was given by Candida, the daughter of Paul Sū—the highest official that ever joined the Christian Church, in the successful days of the Jesuits—whose home was in Siccawei, Shanghai. She trained blind men and boys to sing Christian hymns, and sent them out to sing and explain them in the streets.\n\nMr. Murray in Peking is rendering good service to the Christian Church in China now by teaching music, as well as other things, to his blind pupils. He has provided good organists for several Christian churches already in Peking, Tientsin and in Manchuria.\n\nAbout 25 years ago a protestant convert wrote the whole Bible story—a sort of *Paradise Lost* and *Paradise Regained*—in the usual story-teller style, each chapter given first in prose for recitation and then in verse for singing. It has been so much appreciated that many who could not get a printed copy transcribed the whole book.\n\nAs already said, we have adapted some airs of Chinese songs, Buddhists' chants and Confucian airs for use in Christian worship.\n\nIn Tai-yuen-fu two Sundays in the month, when our evangelists came in for their week's study, we had, to help in the praise, besides the Mason & Hamlin organ used every Sunday, two flutes and a flat drum, which last kept us most mercilessly up to time.\n\nSo we have different kinds of Chinese music variously used—in worship of heaven and earth, worship of ancestors, worship of Confucius, at funerals, at weddings, at receptions,\nbirthdays and other great occasions—and martial music, that given by the blind and strolling musicians, and, lastly, that used in Christian worship.\n\nWe have already touched on some of the effects—taming wild animals, transforming the manners of a people, moving heaven, propitiating the spirits of heaven and earth, mountains and rivers, etc. Their books also dwell on the elevating effect of good music. In a Chinese Book for women, which I read many years ago, mothers are advised to invite good musicians to sing and play to them, so that their minds may be elevated, and that in consequence the minds of their offspring may also be elevated.\n\nIn speaking of effects of music we must refer again to the fanciful explanations of the five notes. The reason for these is that in their classification of eight kinds of musical instruments they think they have embraced all nature, and by the fixing of Hwang Tsung—their lowest pitchpipe—and the mathematical proportions which make the other notes related to it, they think they have found out the vital breath which animates all things. This is why they begin a certain kind of music at the Winter solstice when the sun begins to return to revive all things, and another kind of music at the Summer solstice when the sun begins to recede. This is also why they make their music related to the twelve moons of the year and the twelve hours of the day. By performing all kinds of music they believe that they thereby affect all nature—heaven, earth and man.\nAppendix A.\n\nCOMPARATIVE TABLE.\n\n1. Chinese 12 semitones. 2. Kin notes. 3. Pentatonic Notes.\n4. Chinese Sol fa. 5. Contraction of same. 6. Indian Notes.\n7. Western Sol fa. 8. Corresponding C scale.\n\n| 8 | 7 | 6 | 5 | 4 | 3 | 2 | 1 |\n|---|---|---|---|---|---|---|---|\n| 字律西 | 字俗西 | 字度印 | 字道僧 | 字俗 | 字文 | 字翠 | 字律二十 |\n| fl | ml | r | 上 | 角少 | 等 | 鍾黃半 |\n| B | t | BbA# | ta le | 六 | 宮少 | 鍾應 |\n| A | l | AbG# | la se | 凡 | 宮變 | 射無 |\n| G | s | GbF# | sa fe | 工 | 羽 | 呂南 |\n| F | f | E | m | 微 | 等 | 則夷 |\n| EbD# | mare | D | r | 合 | 宮 | 鍾林 |\n| DbC# | ra de | C | d | 凡 | 翅 | 賓 |\n| | | | | | | | |\nAppendix B.\n\nCHINESE MODULATOR.\n\n| G♭ | D♭ | A♭ | E♭ | B♭ | F | C | G | D | A | E | B | F♯ |\n|-----|----|----|----|----|---|---|---|---|---|---|---|---|\n|     |    |    |    |    |   |   |   |   |   |   |   |   |\n\n[Chinese characters]\n\n[Diagram]\nAppendix D.\n\nMusic used in worship of Confucius—originally in A Minor with no time marks; can be used as Long Metre.\nBuddhist Chant.—Can be used as 7s.\n\nAntiphonal Buddhist Chant. Used as 7s; each line the same.\n\n\"Ba Ban\" Popular Airs.\n\nChinese Song—Can be used as 7s, eight lines.\nFabled Phoenix-notes—Said to be the origin of the 12 semitones.\n\nAs given alternately.\n\nAnother version of Phoenix-notes—Male and female alternating.\n\nAncient Music used in Worship of Heaven and Earth.\n\nNotes as given by Instruments. Notes as given by Voices.\nAppendix E.\n\nPICTURES OF INSTRUMENTS.\n\nErrata.\n\nAppendix D.—No. 21, 3rd. note should be B, not C.\nDo. No. 30, 8th. ,, ,, G#, ,, B#.\n\nAncient Harp.\nFabled Phoenix-notes—Said to be the origin of the 12 semitones.\n\nNotes as given by Instruments. Notes as given by Voices.\nAppendix E.\n\nPICTURES OF INSTRUMENTS.\n\nAncient Harp.\nAncient Drum.\nMusical Stones.\nMusical Bells.\nAppendix F.\n\nEXAMPLES OF DANCING OR POSTURING.\nRETURN TO the circulation desk of any University of California Library or to the NORTHERN REGIONAL LIBRARY FACILITY Bldg. 400, Richmond Field Station University of California Richmond, CA 94804-4698\n\nALL BOOKS MAY BE RECALLED AFTER 7 DAYS. 2-month loans may be renewed by calling (510) 642-6753 1-year loans may be recharged by bringing books to NRLF Renewals and recharges may be made 4 days prior to due date\n\nDUE AS STAMPED BELOW\n\nMAR 25 1996 JUL 06 2001\n\nAPR 29 1996\n\nDEC 20 1999 AUG 07 2004\n\nSENT ON ILL\n\nJUL 14 2000\n\nU.C. BERKELEY\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/paperonchinesemu00richrich_bw.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 72060, "total-output-tokens": 13190, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 429, 2], [429, 786, 3], [786, 1242, 4], [1242, 2778, 5], [2778, 4552, 6], [4552, 6410, 7], [6410, 8215, 8], [8215, 10141, 9], [10141, 11923, 10], [11923, 13739, 11], [13739, 15672, 12], [15672, 17662, 13], [17662, 19519, 14], [19519, 21337, 15], [21337, 23293, 16], [23293, 25173, 17], [25173, 27040, 18], [27040, 28842, 19], [28842, 30601, 20], [30601, 32366, 21], [32366, 34254, 22], [34254, 36059, 23], [36059, 37805, 24], [37805, 39739, 25], [39739, 41620, 26], [41620, 43396, 27], [43396, 44902, 28], [44902, 45491, 29], [45491, 45737, 30], [45737, 45737, 31], [45737, 45854, 32], [45854, 45854, 33], [45854, 45854, 34], [45854, 46019, 35], [46019, 46019, 36], [46019, 46019, 37], [46019, 46279, 38], [46279, 46426, 39], [46426, 46548, 40], [46548, 46601, 41], [46601, 46615, 42], [46615, 46631, 43], [46631, 46646, 44], [46646, 46693, 45], [46693, 46693, 46], [46693, 46693, 47], [46693, 46693, 48], [46693, 46693, 49], [46693, 47230, 50], [47230, 47230, 51], [47230, 47230, 52]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false]}}]