[{"id": "4d5cd281fb4efbf6d376b8883dc4e3a6f991b867", "text": "REPORT\n\nOF THE\n\nSUB-COMMITTEE OF THE MADRAS LITERARY SOCIETY\n\nAND\n\nAuxiliary of the Royal Asiatic Society,\n\nON\n\nWRITING INDIAN WORDS\n\nIN\n\nROMAN CHARACTERS.\n\nMadras:\n\nPRINTED BY H. SMITH, AT THE FORT SAINT GEORGE GAZETTE PRESS.\n\n1859.\nReport of the Sub-Committee of the Madras Literary Society and Auxiliary of the Royal Asiatic Society, on writing Indian Words in Roman Characters.\n\n\"The second system of Asiatic Orthography consists in scrupulously rendering letter for letter, without any particular care to preserve the pronunciation; and, as long this mode proceeds by unvaried rules, it seems clearly entitled to preference.\" Sir W. Jones.\n\nThe Sub-Committee appointed in the early part of last year to consider the best mode of representing Oriental words in Roman characters, beg to submit the following report.\n\nThey must premise by stating, that shortly after their nomination, two of their number were obliged by ill health and the calls of duty, to leave the Presidency, and that they have not, in consequence, been able to discuss so fully as they desired, the various points involved in a subject calculated to elicit considerable differences of opinion. They did not consider that this circumstance absolved them from the duty entrusted to them. Although deprived of the advantage of personal intercourse, they embodied the independent result at which they had arrived, in separate papers, to serve as the basis of more mature deliberation. Before, however, they had arrived at a unanimous conclusion, Mr. Bayley and Mr. Norman were compelled, by illness, to leave India.\nThe scheme now submitted must be considered, therefore, to exhibit the conclusions at which the majority of the Committee had arrived on the most salient points only, and must not be taken as a unanimous expression of matured judgment.\n\nThe want of a recognized scheme for representing oriental words of daily occurrence, has long been felt. Many attempts have been made to remedy the evil. But with how little benefit, the slipslop spelling of proper names and technical terms in official correspondence, and the barbarous names which crowd the face of the best Indian maps, bear witness.*\n\nThe object which the Committee have strictly kept in view has been, to lay down a scheme of orthography which should provide for the exact representation of every word occurring in the languages of India, under conditions at once easy of application and so exact, as to enable persons acquainted with the original tongue, to reproduce words written according to it, in their native characters. In other words, to submit a system of notation, in which \"each original (represented) sound should be rendered invariably by one appropriated symbol, conformably to the natural order of articulation, and with a due regard to the primitive power of the Roman alphabet, which modern Europe has in general adopted.\"† They have further considered it necessary that such a system should not only be acceptable to the\n\n* One of the causes which delayed the preparation of the Mûshhadabâd Survey Registers was \"the character of the Collectory lists. * * * Names are distorted out of all recognition. Thus, the Mahomedan Berahimpoor (Ibrahimpur) will appear as the Hindoo Biharipoor, and many of our adumbrative enquiries have been in search of Villages which had no existence save on the page of the writer.\" Report on Survey operations, Lower Provinces, from 1st October 1856, to 3rd September 1858, page 63.\n\n† Sir W. Jones.\nscholar, but should be adapted to general use, whether by means of typography or manuscript.\n\nFor the accomplishment of these ends, they prescribed to themselves the following fundamental rules:\n\n1. That a distinct Roman character should, as far as practicable, be employed to express each established oriental letter.\n\n2. That the same character should always represent the same letter, and should never be employed without some distinguishing sign to designate a second.\n\n3. That two or more letters should never be employed where a single character could be made to suffice.\n\n4. That diacritical marks should only be resorted to in the last necessity, and should be of the simplest description.\n\n5. That varieties of type, as capitals, italics, black letter, should be considered inadmissible.\n\n6. That the scheme should be founded on the system of Sir W. Jones.\n\nThe propriety of the three first stipulations is manifest and needs no illustration. The two next were dictated by the difficulty of using such modifications in current writing, to say nothing of their unsightly and perplexing appearance. The last was adopted because the accuracy of the principles on which that system is founded, especially with regard to the vowels, has been acknowledged by the most distinguished orientalists of all countries, and still maintains its ground after the experience of three quarters of a century.\n\nThe modifications which have been proposed in Sir W. Jones' orthography since its first promulgation, and which\nrelate chiefly to the mode of representing certain consonants, have also been carefully examined.\n\nAmong these, the most important are the alphabet adopted by the Missionaries of Upper India in numerous works already printed and published, and which has been followed by Professor Monier Williams; that employed by Shakespeare in his Hindustani Dictionary, 3rd Edition, 1834; and that prefixed by Professor Wilson to his Glossary of Indian Terms, 1856;—the last of which exhibits the first attempt to elaborate a scheme embracing all the languages of India.\n\nAt the same time they have not overlooked the modifications observed in the published works of German and French philologists, as far as they have been able to meet with them.\n\nThe Missionary alphabet of Bengal, which has only been applied to Urdu, was at once seen to be inapplicable, because it sacrifices critical accuracy to simplicity.\n\nThe letters \\( \\text{a} \\) and \\( \\text{c} \\) are both represented by \\( \\text{h} \\)—\\( \\text{g} \\) and \\( \\text{i} \\) are all included under \\( \\text{z} \\)—\\( \\text{y} \\) and \\( \\text{s} \\) under \\( \\text{s} \\). The principle of transliteration is thus abandoned.\n\nThe plan proposed by Shakespear is free from this defect, but is also confined to the Urdu dialect in its Arabic and Devanagari forms. It has much merit, but contains several redundancies, providing for distinctions of sound not expressed by corresponding letters, but to be acquired by practice, and therefore unnecessary in a scheme of strict transliteration. There are also some minor blemishes in his mode of dealing with \\( \\text{ch}, \\text{ch}'\\text{h}, \\text{gh}, \\text{kh}, \\text{ksh} \\).\n\nProfessor Wilson's scheme is complete in its requirements, but cumbrous in the mode by which he has carried them out. Thus, five of the six characters for \\( \\text{n} \\), are represented by infra-linear diacritical marks, of which the first is an open dot, and the rest points increasing in number from one to\nfour. The three zeds and three esses are similarly distinguished. Such complications are perplexing in type and unsuited to cursive writing.\n\nOn a comparison of these four schemes, it is seen that the mode of designating the vowels is nearly the same in all: that Sir W. Jones adopts a system of supra-linear marks to distinguish the consonants, and that his followers, admitting the propriety of the principles laid down by him, have confined their modifications to the substitution of infra-linear signs differing only in the greater or less simplicity of their application.\n\nIf a printer is asked, whether with an ordinary fount of types, it is easier to add diacritical marks above or below the line, he will give the preference to the former and to those of the simplest description only. The use of accentual signs above the line, is of ordinary occurrence in every press. Hence the original scheme proposed by Sir W. Jones possesses this advantage, of facility of application, in an eminent degree.\n\nThe chief objection brought against it consists in the similarity to the sign employed to distinguish long vowels and certain consonants, and in the liability of such marks, when used in juxta position, to create confusion. Its minor defects consist in absence of letters required for certain sounds in the Hindi and the Dravidian dialects, (which formed no part of his plan,) in the unnecessary re-duplication of the signs employed to express ξ and ς and in the compound marks over two of the zeds. In other respects, his system presents a marked advantage over all others, whether it be viewed as applicable to the resources of an ordinary printing office, or to employment in manuscript.\n\nIt may be urged, that the objection raised to complicated diacritical signs can be overcome, as in fact it is, by casting types for the purpose. But a fundamental object to be kept in view in any scheme of general application, is facility of\nexecution by means of an ordinary font of Roman type in any press; and this preliminary condition, if maintained, is fatal to the employment of compound diacritical points. The objection applies with still greater force to their use in cursive writing. Single accentual signs and dots are of comparatively easy addition by the pen, but more than these tend to create obscurity and blots.\n\nIt has appeared to the Sub-Committee that a combination of both systems will be found to afford the best means of securing perspicuity of notation with easy application.\n\nThe class of letters in the Nagari alphabet commonly denominated cerebral,* are now generally defined by a single diacritical point below each letter. Let this be taken as the distinguishing sign of this class and its congeners in other tongues, as well as of all letters of a peculiarly harsh or hard sound.\n\nThe expedient adopted by Sir W. Jones to indicate aspirated consonants by the apostrophe used to signify the soft breathing of the Greek alphabet, and to some extent recognized in the Roman, must be allowed to be peculiarly appropriate. It was first devised by Halhed, who placed it at the bottom of the line, in which he was followed by Gilchrist. Sir W. Jones removed it to the top. Klapproth and Bopp applied it to the same purpose, omitting the h and reversing the comma. But this, as will appear in the sequel, has been reserved for another purpose. Although the Jonesian application has not been so generally employed as it seems to deserve, the majority† of the Committee recommend its adoption on the grounds of fitness, perspicuity, and easy application. It sets free the similar characters used to represent ξ and ἐξ with the addition of diacritical marks, and obviates\n\n* This rendering of the Sanscrit grammatical term mūrdākṣaṇya, from mūrdākṣaṇa, \"the head,\" has been objected to, and the word \"lingual\" proposed instead. One writer suggests \"cacuminal,\" as the most appropriate term.\n\n† Mr. Norman dissents.\nthe possibility of mistaking the sound of the aspirates themselves, especially in the familiar English pronunciation of *th*, *ph*, *ch*, &c.\n\nThe strong aspirate at the close of syllables in Sanscrit words, called *visarga*, may be represented by a similar device, or the spiritus asper may be substituted, as *h*. This can never occasion confusion as the *visarga* always follows a vowel.\n\nIn dealing with the Dévanágari alphabet, the only remaining letters to be discriminated are those expressing the sibilants and the nasals.\n\nThe Committee will complete their examination of this alphabet first, because it is the basis of all Hindu alphabetic writing, and has been more or less completely adopted by all the rest, and then proceed to notice such letters as are peculiar to the Arabic and Dravidian phonetic systems.\n\nOf the Nágari sibilants, the only one calling for consideration is the first—or ṃ—which is \"often very inaccurately confounded with the second, or ṅ, and even with the third, or ṉ. It belongs to that class of consonants which, in the notation here proposed, are expressed by acute accents above them, to denote an aversion of the tongue towards the palate, whence this letter is called the *palatine sa*. In the same manner may be noted the *sad* of the Arabs and Hebrews, which last it resembles in shape, and probably resembled, in sound.\"\n\nThe majority of the Committee resolve to recommend this sign.\n\nThe nasals are five in number.\n\n1. The *anusvara*, signified by a * above the line, and therefore most fitly represented by a roman n with a similar mark.\n\n2. For the guttural *n*, or that pertaining to the first class of Nágari letters, a compound or double symbol, might\n\n---\n\n* Sir W. Jones. † Mr. Norman dissent.\nwith much propriety be adopted. Its sound is exactly that of the letters ng in sing, long, &c., and these letters, therefore, seem to present the fittest substitute. But Sir W. Jones objects to the addition of the g, on the ground that it might create confusion, and often suggest the idea of a different syllable. This difficulty might be overcome by tying the two letters with an infra-linear line, but such complicated signs are objectionable in themselves, and are, moreover, proscribed by our 3rd rule. The line below the n alone, may therefore be retained as the characteristic of this sound. Sir W. Jones, viewing it as identical with anusvara, employs the same mark for both, but in doing so, transgresses the fundamental rule which requires exact transliteration.\n\n3 and 4. The palatal and cerebral n should, by analogy, follow the rule already in such cases provided, the former being represented by an accent above, the latter by a point below, the line. But as the sound of the first is exactly identical with that of the Spanish ñ and Portuguese nh,* and provision has to be made for another more purely palatal n in the Tamil ஞ, it seems advisable to adopt the Spanish ñ which presents a familiar representation of the exact power of the Sanscrit letter, and thus to leave the palatal symbol available for the Tamil n (ஞ).\n\n5. The last, or simple n, needs no distinguishing sign.\n\nThe Sanscrit alphabet concludes with a character expressing a sound compounded of k, s, and h, which it has been usual to represent by these three letters in sequence. Others have employed the Roman x for the same purpose, and considering that this letter is also a compound of k and s, and is not otherwise required, the majority of the Sub-Committee recommend that it should be appropriated to that sound.†\n\n* \"Containing a composition of n and y as in the English word onion, and Italian agnello which written phonetically would be onyon, and anyello.\"—Sir W. Jones.\n\n† Mr. Norman dissents.\nThe Nāgari alphabet, thus adjusted, will stand as follows, with its corresponding Indo-Arabic and Roman representatives:\n\n**Vowels.**\n\n```\nअ आ इ ई उ ऊ ए ऐ ओ औ अं अः\n```\n\n```\na ā i ī u ū e ai o au ì 'h or 'h\n```\n\n**Consonants.**\n\n| Gutturals. | Palatals. | Cerebrals. | Dentals. | Labials. |\n|------------|-----------|------------|----------|---------|\n| क क्ष ग घ ङ |\n| k k'h g g'h |\n| च छ ज झ ञ |\n| ch ch'h j j'h |\n| ट ठ ड ढ ण |\n| t t'h d d'h |\n| त थ द ध न |\n| t t'h d d'h |\n| प फ ब भ म |\n| p p'h b b'h |\n| B |\n| n |\nTHE DRAVIDIAN ALPHABETS.\n\nAll the Southern races have adopted the Arian phonetic system except the Tamil people, and they, while retaining their own peculiar system of letters, have formed a second alphabet, founded on the Arian, for Sanscrit literature, which has been extensively cultivated among them. This is called the Grand'ham character.\n\nThe Telugu, Canarese, and Malayalam nations have taken the Nagari letters under altered forms, but with the Sanscrit classification and arrangement. The same Roman characters therefore will, so far, serve for all.\n\nMany of the Tamil and some of the Telugu letters are liable to changes of sound with reference to their position or to their derivation from Sanscrit, and some discussion took place regarding the property of providing distinct Roman equivalents for such sounds.*\n\n* \"Of the Sanscrit letters, all vowels except the four medial and two final are common to Tamil; as are also the first and last letters of the five classes of consonants; the four, following in order, from ω; and that written ṛ; twenty-five in all. The remaining twenty-eight undergo change.\" Nannul, Book iii. Sutr. 19.\nMr. C. P. Brown has represented the Telugu \\( \\text{స} \\) by \\( \\text{c} \\) and the \\( \\text{ం} \\) by \\( \\text{z} \\), restricting the true sound of the Nāgari \\( \\text{छ} \\) or \\( \\text{ck} \\) to words of Sanscrit origin.\n\nIt appears, however, to be unnecessary, in a system of strict transliteration, to provide more symbols for a letter, however variable in sound, than the people possess themselves. In using a romanized character, such anomalies must therefore be learnt by practice, as they are at present mastered by the natives themselves, who employ the vernacular characters under precisely similar circumstances.\n\nThe only exception which appears necessary is in the reduplicated Tamil sounds of \\( \\text{ச} \\), \\( \\text{ச} \\) and \\( \\text{ப} \\) or \\( \\text{த} \\), \\( \\text{த} \\) and \\( \\text{ர} \\) which become \\( \\text{tt} \\), \\( \\text{tt} \\) and \\( \\text{tt} \\) and this has long received the sanction of general usage. These have therefore been admitted. The changes occurring in other letters will be found enumerated in Appendix B. p. 32.\n\nWe have also adopted the rule which gives the normal sound of the Devanagari characters to words adopted into Tamil, and have represented them by their corresponding Roman letters.\n\nMr. Brown's expedient, however, suggests another use for the letter \\( \\text{c} \\), and that is, it's substitution for the \\( \\text{ch} \\) of \\( \\text{छ} \\), which, cumbrous in its simple romanized form, becomes still more awkward and unsightly in its reduplicated and aspirated shapes.* The letter \\( \\text{c} \\), the only character remaining unappropriated, is also available for the same purpose. This however is simply thrown out as a suggestion, which we have\n\n* e. g. In the words \\( \\text{हुंक़दरी} \\) and \\( \\text{हुंक़दरी} \\) \\( \\text{ch'huck'hundar} \\) and \\( \\text{ch'huck'hundari} \\) \"a muskrat\"; \\( \\text{हुंक़दरी} \\) \\( \\text{ch'huck'hundar ch'hor} \\), \"a back biter;\" \\( \\text{चोखुचुन्ना} \\) \\( \\text{chochuchuchuna} \\) \"to rush in.\"\n\nProf. Bopp, appears to have adopted the expedient here recommended; thus he writes the title of the celebrated drama called the Toy cart, \\( \\text{मृदुकारी} \\).\nnot ventured to adopt, but which we consider to be worthy of farther consideration.\n\nBesides these, there are seven other letters peculiar to the Dravidian dialects, which were probably once common to all, but the whole of which are found in Tamil alone at the present day. They are \\( \\text{अर्} \\), \\( \\text{प्र्} \\), \\( \\text{प्} \\), \\( \\text{प्} \\) and \\( \\text{प्} \\) or \\( \\text{प्} \\).* Of these the three first only, have been retained in Telugu and Canarese, and the five first in Malayalam.† The two last are confined to Tamil.\n\nThe two vowels are simply the short sounds of \\( e \\) and \\( o \\), and as the corresponding Sanscrit vowels are always long, and are so designated in the scheme at page 9, no farther provision is required for them.\n\nThe Tamil \\( \\text{अर्} \\) Malayalam \\( \\text{अर्} \\), and Telugu and Canarese \\( \\text{व्} \\), is not unknown to the Nāgari alphabet, and is still found in the older Sanscrit of the Védas, but it has fallen into disuse. It comes under the head of cerebral sounds, and is therefore properly represented by \\( l \\) with the mark assigned to that class.\n\nThe Tamil \\( \\text{प्} \\) or Malayalam \\( \\text{प्} \\), has the force of a prolonged palatal \\( r \\), of which the Hindi \\( \\text{र्} \\) seems to be the Urdu equivalent. In its re-duplicated form it becomes \\( rr \\) and will be rightly typified by these corresponding letters with the palatal sign — or \\( r \\) and \\( t \\).\n\nThe next letter \\( \\text{प्} \\) which is confined to Tamil and Malayalam, may be termed the vexata litera of the Dravidian, as \\( \\text{क्} \\) is of the Semitic tongues.\n\nFor the difficulties which impede the appropriate rendering of this sound, we refer to Appendix A. p. 21. The various\n\n* Note:—In Naanul, it is said that the letters \\( \\text{अर्} \\), \\( \\text{प्र्} \\), \\( \\text{प्} \\), \\( \\text{प्} \\) and \\( \\text{प्} \\) only, are peculiar to Tamil, together with some peculiar sounds of vowels (called \"dependant letters\") with the exception of vowel-consonants and prolonged vowels\". Book iii, Sutra 23.\n\n† Peet's Grammar, p. 7\nexpedients which have been proposed by different writers resolve themselves into a choice between r and l, if a single letter is employed—or zh if a compound character is admissible.\n\nTwo of the highest authorities in Tamil literature, Dr. Caldwell and Mr. Pope, have pronounced the letter, on philological grounds, to be a form of r, but general use and analogy are in favor of considering it a cerebral l. The Committee have therefore resolved to adopt the latter. There being already two els, the proper diacritical mark would be a point above, but this being unsuited to the shape of l they resolve to recommend a line below, or l.\n\nThe Tamil ṣ seems to differ in no wise from the ordinary n fully enunciated as a palatal sound. It should therefore be noted as ṣ.*\n\nThe last letter is the equivalent of the Arabic ḫ and like it should be represented by ḫ.\n\n---\n\n**THE ARABIC ALPHABET.**\n\nThirteen letters peculiar to Semitic alphabets remain to be rendered by Roman equivalents.\n\nThey are:\n\nof which six [or seven including ṣ] viz., ṣ are reckoned by grammarians to pertain exclusively to the Semitic languages.\n\n* \"The sound of this character although no longer represented by a specific sign in the Malayalam alphabet, seems to be not unknown in the spoken language.\" Pect's Grammar, p. 4.\nThe first is pronounced in Arabic exactly like the English *th* in *thing*—but in India it has simply the force of dental *s*, and but for its occurrence in a few words of Arabic origin might be discarded altogether. As an anomalous letter, it may be distinguished by *s* with a point above or *š*.\n\nThe deep guttural breathing represented by *ẓ* is generally rendered by *ḥ*, which, as distinguished from the ordinary *ḥ*, seems in all respects appropriate.\n\nThe stronger guttural sound of *ẓ* common both to Arabs and Persians, is universally rendered by *kh*, with or without a diacritical mark. Provision having been made for the aspirated sound of *k*, it does not appear to us that any such distinction is required.*\n\nThe Arabic and Persian *j* expresses the simplest sound of *z*. The *j*, which is also common to Arabia and Persia, is a very soft dental sound of the same letter. As an anomalous letter it might be indicated by a supra linear point, and the infra linear sign would then be assignable with much propriety to the cerebral form of the same sound in *ẓ*. But it is desirable to retain the same sign for the sister forms of *b* and *v* and the cerebral sign of *t* being already pre-occupied in the Devanagari alphabet, another expedient must be devised.\n\nIt is proposed to indicate *j* by *z* with a line below, or *ẓ* (already adopted by Shakespear), leaving the anomalous sign for *b* and *v* as *i* and *š*.\n\nThis is the less objectionable, because these two letters do not properly fall within any of the established phonetic classes of letters, being enunciated by rolling the inverted\n\n---\n\n* Prof. Max Muller has proposed to represent these two sounds by *h* with the soft and hard aspirates or *h* and *ch*, but however well adapted for a purely phonetic system, they are unsuited to one proceeding on the rule of strict transliteration. The missionaries of upper India likewise discussed the plan of omitting the *h* and expressing *ẓ* by *k* alone, but rejected it as untenable.\ntongue, round one side of the mouth from the hindermost molar towards the front teeth.\n\nTo ي has already been assigned the mark of the palatal š, and on the score of analogy the ن should be distinguished in like manner by ž.\n\nThe next letters, ف and ق present no difficulties. The first is precisely the English f; to the latter has been assigned the letter q, an arbitrary arrangement, but one which has been very generally adopted, and which effectually guards against confounding it with k.\n\nWith regard to غ which has been the subject of so much controversy, we desire to recommend the expedient proposed by Mr. Bayley of substituting a reversed comma above the line, for the reasons so fully stated at page 35 of Appendix B. It is supported by simplicity of application whether in writing or print, being nothing more than the single inverted comma, used to mark a quotation within a quotation, in ordinary printing. By the latest modification of the Indian Missionary alphabet, it has been resolved to write the vowels represented by غ with a comma before or after the letter—but on the top of the line, as 'a'amāl for إملاء. This plan is also deserving of commendation.\n\nFor ج a double character, gh, has long been in use with very general approval. More recently the Missionaries have proposed to drop the h and have added a point in the lower loop of the g—again on the side of simplicity in typography when special provision has been made for the purpose, but impossible of execution in ordinary type, and difficult of notation in cursive manuscript.\n\nThe Persian ج has been rendered in all systems by zh. It is of extremely rare occurrence, and the double sign may be retained. If the same double character be assigned to the\nTamil ψ, the Persian representative might be tied by a line below—as zh.\n\nThe anomalous sound peculiar to certain dialects, and which find no place in the Arian system, will then be represented as follows:\n\nf for ρ\ngh ,, ḍ\nh ,, ṭ\nkh ,, ḍ\nl ,, or ψ Tel. and Can. & B\nl ,, ψ Tamil and Mal.\nn ,, or\nq ,, ḍ\n\nTo resume:\n\nThe scheme here submitted provides for the representation of every oriental letter employed in India by a single Roman letter, and where required, by the addition of a single diacritical sign, except in five instances, in which double consonants are introduced.\n\nThe diacritical signs are:\n\n1. The acute accent over all long vowels.\n2. The soft breathing or apostrophe ' with h for the aspirated consonants.\n3. A point below the letter for the class of letters termed cerebral consonants.\n4. An accent above the letter for those styled palatals. The acute accent having been appropriated to the vowels, the grave accent may be substituted for the palatals to prevent confusion.\n5. A point above the line for anomalous sounds, except in the case of the nasal n, for which we have borrowed the familiar Spanish ñ.\n6. A line below the letter in two instances, when the three descriptions of signs already adopted were exhausted, and in a third where the only one available was inappropriate.*\n\n7. The double letters admitted in five instances, are ch, kh, gh, sh, and zh.*\n\nOf these it is possible that the first, or ch, may yet be dispensed with.*\n\n* We propose to exclude the Deva nagari lri lri because of such rare occurrence as to be well-nigh obsolete. The Persian zh may be reckoned in the same category, which would leave but three double signs, if ch was represented by c or f.\nAPPENDIX A.\n\nAs a foundation for the report which the Sub-Committee was appointed to prepare, I would propose the six following axioms:\n\n1. That the scheme be founded on the system of Sir W. Jones.\n2. That a distinct Roman character should be used for each oriental letter.\n3. That the same Roman letter shall always represent the same vernacular letter, and shall never be employed to designate any other.\n4. That two or more letters shall never be taken to represent an oriental character or sound where a single letter will suffice.\n5. That diacritical marks should only be employed in the last necessity.\n6. Varieties of type, as capital, italics, &c., to be declared inadmissible.\n\nProfessor Wilson has already drawn up a scheme embracing most of these requisites, which is printed in the introduction to his Glossary.\n\nI am not disposed to depart from this, except in a few particulars, where it appears to me to be susceptible of improvement.\n\nI will notice shortly the points in which I differ from that scheme, beginning with the Deva Nagari Alphabet.\n\nDEVA NAGARI.\n\nIn adopting this Alphabet as a basis, we shall have the most perfect phonetic system of classified sounds which, according to Prof. Max Muller, has ever been invented. And this because it was taught by the voice alone, for ages after the Sanscrit language had been brought to a high degree of cultiva-\ntion, and before the invention of written characters. Thus, the word now used for \"learning, instruction,\" is sīkṣā, the normal meaning of which is \"the proper pronunciation of the vocal sounds occurring in the Vedas as explained by Pāṇini\" (Wilson) in other words \"phonetic science\".\n\nThe aspirated consonants are represented by the addition of the letter h. I prefer the practice of Sir William Jones, which has been adopted by several continental orientalists who, as well as some of our own, add an apostrophe with or without the h. I adhere to the Jonesian practice of the comma above, as k'h g'h, &c.\n\nI do so because these letters are necessarily required to express the sounds of ḍ and ḍ̥ and would therefore need a diacritical mark; because th at once suggests to English readers the sound of these letters in the, think, &c, ph the sound of f in physeic, rh the sound of hard r in rhinoceros, rhizome &c.; because such a general mark as the (') at once suggests the idea of a simple aspiration or breathing in in all places where it occurs, and influences the pronunciation accordingly.\n\nProfessor Wilson has changed the romanized symbol of ṣ from s' to ṣ in accordance with his system of distinguishing all letters requiring diacritical marks, by points below the line. I prefer the former, or Sir W. Jones' method, which is generally adopted both by English and German orientalists, because it is already established, and because, in a general system where provision must be made for the three sibilants of the Arabic alphabet also, resort must otherwise be had to more complicated marks.\n\nI object to Wilson's mode of writing anusvara by n, and the others by infra linear points. Thus, besides the normal n he has five so designated, the last with four dots under it.*\n\n* Vide Axiom 5.\nI would place the mark above, because in conformity with native usage, and because, in manuscript, the circle would often become a dot, and thus create confusion.\n\nBut might not both anusvara and visarga be expressed by their original characters • and ; which would comport very well with Roman type and be not at all unseemly?\n\nFurther, I would adopt for the palatal n, which Wilson represents by न्, the Spanish ñ; for the guttural n the double letters ng or न्; for the cerebral n an न्, and for the Tamil palatal n an न्.\n\nWilson has no distinction between the Nagari ण् and the Hindi ण् and Tamil ண्, all of which he expresses by r or ri and r'i.\n\nThe sounds are altogether different. I would write\n\nर् रि ण् णि\n\nThe letter ण् is usually written ksha, and I am free to confess these letters represent the sound perfectly. But many Orientalists, particularly those of France, use an x. This practice is in accordance with axiom 4.\n\nTamil Alphabet.\n\nThe only letters that call for notice in Tamil, are:—\n\nर् ण्\n\nThe first, which is also common to the other southern dialects, is an original Sanscrit sound, and is found in the old alphabets of that language. It is a hard l, which is appropriately marked by a point below, or l'.\n\nThe next letter, if only representing the prolonged sound of r as uttered in perfection by the Todas of the Nilagiris, would easily be distinguished by a diacritical mark. But in\nits re-duplicated use it becomes $tt^*$ and as there are already $\\phi$ and $u$ which are written $tt$ and $tt$, I would recommend, as proposed above, that this character should be expressed by $\\gamma$ and $\\rho\\rho$ by $tt'$.\n\nThis is contrary to the 3rd proposed fundamental rule, but the genius of the Tamil language and its poverty in phonetic signs, require a relaxation of the axiom, to provide for differences of sound of the same letter, under different circumstances, as in the cases of $\\alpha$, $\\beta$, $\\iota$, $\\upsilon$ and $\\rho$, which may be read respectively as $k$ and $g$—$s$ and $ch$—$t$ and $d$—$t$, and $\\dot{\\gamma}$—$p$ and $b$—$r$ and $t$. But as several of these depend on the position of the particular letter in relation to others, which every Tamil scholar soon learns by practice, I would confine the substitution of other Roman characters for the normal one, to the double tees and to such words as have been adopted from Sanscrit.\n\nThe Tamil $\\omega$ it has already been proposed to designate by $\\lambda$.\n\nThe last letter represents a sound peculiar to the Dravidian dialects, and now retained only in Tamil and Malayalam. It is a mixture of $j$, $l$ and $r$, and is only pronounced in its purity by the pure Tamil races, the Veilézhars and Mudaliyars. The Todas also enunciate it with peculiar fullness.\n\nThe difficulty of finding a suitable Roman equivalent is best exemplified by enumerating the attempts hitherto made to represent it in a Roman dress.\n\nZiegenbalg, 1714, employs..................rl and rhl\nBeschi, 1728........................................l—j\n—, pref. of Sen Tamil grammar (Babington's translation).................................zj\nEllis, 1816.............................................zh\n\n* According to Rhenius the true sound of the double $\\rho$ is $tr$ \"though the $r$ is sounded rather softly and quickly; but the common people pronounce it like $tt$.\" Gram. p. 17.\nAnderson, 1819, (when medial).................. r\n_________ (when final)...................... l\nBabington, 1822, Trans. Beschi's Sen Tamil grammar................................. zh\nRhenius, 1834, \"a kind of\" .................. rl\nGraull, 1854, in the Kaivalyanavanita........ l\nWilson, 1855, Glossary........................ l in Tamil\nr in Malam.*\n\nCaldwell, 1856, Comp. grammar............... r\nPope, 1856, First Lessons, \"something like the Welsh ll\" with the force of rr............. r\n—1859, Tamil hand-book do. do. and........ r\nB. H. Hodgson, 1856........................... zy\nThe French Jesuits............................... xh †\n\nBeschi describes it as being \"quoque aliud Z, quod crassiori sono, reflexâ omnino ad interiorem palati partem linguâ, pronunciatur;\" adding in a note, \"in aliquâ istius regionis parte sonat quasi j.\" Tamil Gr. ch. 1. s. 2.\n\nRhenius observes, \"for ρ we have no proper sound in English or any other European language; it is a mixture of r and l imperceptibly coalescing by turning the tongue upward to the roof the mouth.\" Gram. 3rd ed p. 16. Thus he writes σιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιρσιри\n\n* By a typographical error the Malayalam ρ and ρ in Prof. Wilson's alphabetical table at p. xi of the glossary have been made to change places.\n† This χ seems to have been intended for the Greek χ. Thus they write χαντι, \"a heathen.\"\nand is likely to mislead the learner. \\( r \\) is the only Dravidian consonant which is pronounced differently in different districts. In the Southern districts of the Tamil country, it is pronounced by the mass of the people, exactly in the same manner as \\( l \\), which is the letter invariably used instead of \\( r \\) in Canarese. Between Tanjore and Pondicherry, it is softened into \\( zh \\), or \\( zh \\); and in Madras and the neighbourhood, this softening process has been carried to such a length, that in the speech of the vulgar, \\( r \\) has become a silent letter.\n\n\"The Telugu, which commences to be spoken about two days journey north of Madras, has lost this letter altogether. Generally it uses \\( d \\) instead, as the Canarese uses \\( l \\), but sometimes it uses no substitute, after the manner of the vulgar Tamil of Madras. Looking at such Telugu words as \\( kinda \\), 'below,' answering to the Tamil \\( kirinda \\), and \\( vingu \\), 'to swallow,' answering to the Tamil \\( virungu \\), we cannot but suppose, that the Telugu had this letter originally, like the Tamil, and that it lost it gradually through the operation of that softening process which, in the colloquial Tamil of Madras, converts \\( kiré \\), 'below,' to \\( kié. \\)\" Comp. Grom. p. 108.\n\nMr. Pope considers the Tamil \\( r \\), \\( n \\) and \\( t \\), to possess each three sounds, a dental, a palatal, and a cerebral, while to \\( l \\) he allows only two, a palatal and a cerebral. In pursuance of this analogy he assigns to \\( p \\) the cerebral place of \\( r \\), and gives the following rule for its pronunciation, \"apply the tip of the tongue, as far back as you can, to the palate and pronounce a rough \\( r \\) in which a sound of \\( z \\) will mingle. In the South, unable to articulate this letter, they use a strong \\( l \\) (\\( er \\)) instead. In the North, in the same way, they use \\( w \\) (\\( y \\)) for \\( p. \\)\" Tamil Hand-book p. 11.\n\nThe only conclusion to be drawn from these various statements is that the \\( p \\) represents a sound altogether sui generis, or as Professor Wilson expresses it, \"the enunciation is singularly obscure, and cannot be precisely represented by any written characters.\"\nBut this sound* is by no means peculiar to the Dravidian dialects. It is found to prevail equally throughout the aboriginal Indo-Chinese tongues of the Himalayas and Tibet; Hodgson refers to it repeatedly. \"The second z,\" he observes, represented by me by \\( \\text{zy} \\) and equal to the French \\( j \\) in \\( \\text{jeu} \\), is the same with the Tamil \\( zh \\) of Ellis and Elliot. It is a very prevalent sound, and equally prevalent is the French \\( u \\) or \\( eu \\) in \\( \\text{jeu} \\) aforesaid. Neither is ever heard from an Arian mouth,\" &c.†\n\nEven among the aborigines, he adds, the influence of Arian vocables is gradually bringing them into disuse. And this is also the case in the South, where, from the same cause, they have gradually disappeared from the Telugu and Canarese.\n\nIt becomes a matter of interest therefore, to observe the expedient employed in these two dialects, to replace the absence of this characteristic sound, in words of common origin.\n\n---\n\n* Pref. to Gloss. p. xv.\n† Hodgson, Aborigines of the Nilagiris, in Journal As. Soc. Bengal, XXV. p. 503.\nThe following is a list of words taken at random:\n\n| Tamil | Malayalam | Telugu | Canarese |\n|-------|-----------|--------|----------|\n| கோழி | കൊഴി | కొడి | కొడి |\n| எழு | എഴു | ఎలు | ఎలు |\n| சுழி | സുരി | చూడి | చూడి |\n| மழை | മഞ്ഞ | మాని | మాని |\n| தழை | തഴ | తాళి | తాళి |\n| மோழம் | മോഴ | మొల | మొల |\n| பழ | പഴ | పాడు | పాడు |\n| கிர | കീ | కిర | కిర |\n| மழுక | മഴ | మాని | మాని |\n| வழ | വഴ | వాళ్ | వాళ్ |\n| உழ | ഉഴ | ఉడి | ఉడి |\n| பழம் | പഴ | పాడు | పాడు |\n| கோழி | കൊഴി | కొడి | కొడి |\n\n*The use of *vadu* is nearly obsolete. It is only now occasionally applied to a wife going to live in the house of her husband.*\nFrom these examples, it appears that the Canarese substitute a hard \\( l \\), the Telugus generally a hard \\( d \\), and sometimes an \\( l \\), which is occasionally softened away, as in the words for wax, below, fruit, &c.—sometimes eliding it altogether, as in the word \\( \\text{muzha}kdl \\), \"the knee\" which becomes \\( \\text{mokalu} \\).\n\nSo completely has the letter disappeared from Telugu, that the Vadagala Vaishnavas of Telingana, who are obliged to repeat daily, portions of the sacred verses composed by the twelve Azhwárs, which they commit to memory from versions written in Telugu characters, finding no letter to represent \\( \\varphi \\) have adopted the expedient of restoring it bodily in its original Tamil shape.\n\nNotwithstanding the high authorities of Messrs. Caldwell and Pope, I am unable to concur in their view of considering the letter to be an \\( r \\). In this, I am supported by the Native grammarians. The author of the Sabda manjari, the Tamil version of Páñini's phonetic grammar, distinctly affirms the identity of \\( \\varphi \\) and \\( \\sigma \\) which he illustrates by the following examples:\n\n- \\( \\text{uzhunda} \\) becomes \\( \\text{ulundu} \\), a kind of pulse.\n- \\( \\text{kuzhagum} \\).\n- \\( \\text{sózhum} \\).\n- \\( \\text{chélam} \\) and \\( \\text{sólam} \\), a kind of grain.\n\nSo far the balance of authority preponderates in favor of resorting to \\( l \\), which should then be distinguished by some diacritical mark.\n\nThere is, however, sufficient evidence to show that the letter is an original Turanian sound which has gradually\n\n---\n\n* \\( \\varphi, \\sigma \\), \\( \\text{Páñini} \\), \"There is no difference between \\( \\varphi \\) and \\( \\sigma \\).\" It is remarkable that the original dictum of Páñini from which this is adopted runs thus, \\( \\text{between } d, \\text{and } l, \\text{there is no difference.}\" \\) Thus we have \\( d, zh \\) and \\( l \\) replacing each other in the Southern dialects.\nbecome obsolete from its incompatibility with the Arian phonetic system, and that the various changes it has undergone in the examples quoted, are so many make-shifts to get rid of it. If we wish therefore to represent it clearly, we must assign to it a special sign, and for this purpose, I am decidedly of opinion that we should retain Ellis' expedient of writing \\( \\text{zh} \\), an arbitrary sign it is true, but one incapable of being mistaken for anything else, and at least as appropriate as any other that has been suggested. For let any one follow exactly the mode of pronunciation laid down by Native grammarians as explained by Beschi, Caldwell, and Pope, without any preconceived idea in favor of a particular letter, and the sound emitted by simply forcing the voice through the organs, will be neither a liquid \\( l \\) nor a trilling \\( r \\), but a gushing utterance which comes nearer to \\( \\text{qjh} \\) or \\( \\text{azh} \\), than any other combination of sounds that I can conceive.\n\n**Arabic Alphabet.**\n\nThis is the most difficult character to deal with, both on account of the larger number of sounds peculiar to itself, which it contains, and because these are pronounced so differently by different races* which make use of it. The Muhammadans of India altogether fail in enunciating the true sounds of \\( \\text{ث}, \\text{ذ}, \\text{ص}, \\text{ض}, \\text{ط}, \\text{ظ}, \\text{غ}, \\text{ف}, \\text{ق}, \\text{ك}, \\text{ل}, \\text{م}, \\text{ن}, \\text{ه}, \\text{و}, \\text{ي} \\), which are for the most part reduced by them to \\( s \\) and \\( z \\), as among ourselves.\n\nI have already stated my objections to Wilson's representation of \\( \\text{خ} \\).\n\n\\( \\text{خ} \\)\n\n\\( \\text{ر} \\)\n\nI also object to his exchange of \\( h \\) from \\( \\text{ت} \\) to \\( \\text{س} \\) as an unnecessary innovation, and as less fitting in itself: \\( \\text{س} \\) has\n\n---\n\n* The Egyptian Arabs pronounce the \\( \\text{ق} \\) as \\( g \\), e.g., \\( \\text{gab} \\) for \\( \\text{qalb} \\) \"the heart\" and the Bussrah to and many of the Syrian Arabs invariably give the sound of \\( \\text{ch} \\) to \\( \\text{ق} \\) as \\( \\text{chalb} \\) for \\( \\text{kalb} \\) \"a dog.\"\nexactly the sound of the Roman \\( h \\), whereas \\( \\text{ح} \\) has a peculiar guttural sound which I conceive to be more appropriately designated by an additional sign or mark.\n\nI differ also from the Professor in using \\( k \\) for \\( \\text{ق} \\) and in conformity with the principle laid down in rule 2, and with the generally adopted practice, I would employ \\( q \\) for that purpose.\n\nThere remains the vexata litera \\( \\text{غ} \\) which Wilson writes as \\( d \\) with a circumflex over it.\n\nThis does not appear more happy than any of the preceding schemes which have been suggested.\n\nI like the plan adopted by the Missionaries in Bengal, and followed by Dr. Sprenger and some of the Bengal orientalists, of employing a comma above the line, as \\( \\text{نات} \\), adding a vowel where necessary, as in \\( \\text{ملعم} \\)\n\n\\( \\text{لاب} \\)\n\n\\( \\text{ينام} \\)\n\nor it might be represented by the short vowel with a comma over it, as\n\n\\( \\text{مالافين} \\)\n\n\\( \\text{لااب} \\)\n\n\\( \\text{ينام} \\)\n\nThe letter \\( \\text{غ} \\) is represented in Wilson's scheme by \\( s \\) which has this propriety, that the diacritical signs are the same as those of the original. But the true sound of the letter is the English \\( th \\) and I am inclined to think that sign is preferable. A familiar instance occurs in the word \\( \\text{ثمار} \\), fruit, as \\( \\text{ثمار هندى} \\), the Tamarind. But in India, the sound has been very generally corrupted to that of a pure sibilant \\( s \\), so that I would not insist on any change.\n\nWALTER ELLIOT.\nAPPENDIX B.\n\nTELUGU.\n\n|   |   |\n|---|---|\n| a | as the a in \"about\" and \"delta.\" |\n| ā | as the long a in \"father.\" |\n| i | as the i in \"pin;\" or y in \"truly.\" |\n| ī | as the long i in \"pique.\" |\n| u | as the oo in \"good.\" |\n| ū | as the long oo in \"food.\" |\n| ri, ru | as the ri in \"rim,\" and roo in \"rook.\" |\n| rī, ru | as the rea in \"ream,\" and roo in \"rood.\" |\n| e | as the e in \"mendicant,\" (nearly the French é.) |\n| ē | as the ey in \"grey,\" (nearly the French ê.) |\n| ai | as the ai in \"aisle,\" or ei in \"height.\" |\n| o | as the o in \"police.\" |\n| ō | as the long o in \"story,\" and \"prose.\" |\n| au | as the ou in \"foul,\" or the ow in \"drown.\" |\n| k | as the k in \"king.\" |\n| k'h | aspirate of the preceding. As k h in \"pack-horse.\" |\n| g | as the g in \"garden\" and \"legacy.\" |\n| g'h | aspirate of the preceding. As g h in \"gig-horse.\" |\n| n | as the ng in \"angle.\" |\n| ch | with the vowels i ī e ē ai, as the ch in \"church.\" |\n| ts | with the vowels a ā u ū o ō, as the ts in \"jetsam.\" |\n| ch'h | aspirate of the preceding ch; as ch h in \"coach-horse.\" |\n| j | with the vowels i ī e ē ai, as the j in \"jelly.\" |\n| dz | with the vowels a ā u ū o ō, as the dz in \"adze.\" |\n| j'h | aspirate of the preceding j. |\n| n̤ | as the gn in \"mignon,\" or the ni in \"onion.\" |\n| t̤ | a peculiar hard or palatal t, like t in \"trump.\" |\n| th | aspirate of the preceding. |\n\n[Note 1.]\n| Consonant | Pronunciation |\n|-----------|--------------|\n| d         | a peculiar hard or palatal d, stronger than d in \"drum.\" |\n| d'h       | aspirate of the preceding. |\n| n         | a palatal n. |\n| t         | dental or soft t, as the t in \"winter.\" (The Italian t exactly.) |\n| t'h       | aspirate of the preceding; as the th in \"ant-hill.\" |\n| d         | soft d as the d in \"daily.\" |\n| d'h       | aspirate of the preceding; as dh in \"adhere,\" |\n| n         | soft n, as the n in \"fancy.\" |\n| p         | as the p in \"pardon.\" |\n| p'h       | aspirate of the preceding, as ph in \"up-hill.\" |\n| b         | as the b in \"number.\" |\n| b'h       | aspirate of the preceding; as bh in \"abhor,\" |\n| m         | as the m in \"demand.\" |\n| y         | as the y in \"yellow.\" (If without a vowel mark it is the vowel i.) |\n| r         | as the r in \"round\" and \"burial\" |\n| r         | a peculiar vibrating r something like r in \"crack.\" |\n| l         | as the l in \"manly.\" |\n| v         | as the v in \"marvel.\" |\n| s         | an s, or rather sh, something like s in \"surety.\" |\n| sh        | as the full sh in \"shoulder\" and \"lashing.\" |\n| s         | as the s in \"sinful\" and \"wasting.\" |\n| h         | as the h in \"hunger.\" |\n| l         | a peculiar hard l; harder than l in \"glover.\" |\n| ksh       | as the ksh in \"workshop.\" |\n| m         | as the m in \"cumber.\" |\n| n         | as the n in \"wonder.\" |\n| ch        | as the ch in the Scotch \"loch.\" |\n\n(Note 1.) ts is the true Telugu sound of the letter ṭ; but it is used in Sanscrit derivatives for the Sanscrit letter ch. So dz is the true Telugu sound of the letter ḍ; but in Sanscrit derivatives it is pronounced as j.\n\nN. B.—In the list of consonants in the native character, the vowel mark of a short, has been appended to each of the consonants to which it can be appended. This has been done to distinguish them from the 9 consonants which do not carry it, viz.: k'h, gn, j, ṇ, t, n, b, r, l. Hence the English equivalents are ka, k'ha, ga, g'ha, gn, &c.\n### Tamil\n\n| அ | a | as the a in \"about\" and \"delta.\" |\n| ஆ | ā | as the long a in \"father.\" |\n| இ | i | as the i in \"pin,\" or the y in \"truly.\" [See Note 1.] |\n| ஈ | ī | as the long i is in \"pique.\" [See Note 2.] |\n| உ | u | as the oo in \"good.\" |\n| ஊ | ū | as the long oo in \"noon.\" |\n| எ | e | as the e in \"mendicant\" (nearly the French è) [See Note 3.] |\n| ஐ | ē | as the ey in \"grey\" (nearly the French ê.) [See Note 4.] |\n| ஑ | ai | as the ai in \"aisle,\" or ei in height. |\n| ஒ | o | as o in \"police.\" |\n| ஓ | ō | as the long o in \"story,\" or \"prose.\" |\n| ஔ | au | as the ou in \"foul,\" or ow in \"drown.\" |\n| க | k or g | as k in \"king\" or g in \"lagoon.\" [See Note 5.] |\n| ஞ | ng | as the ng in \"angle.\" |\n| ச | s | a peculiar s sounded nearly like ch. [See Note 6.] |\n| ஷ | ṣ | as the ni in \"onion,\" or gn in \"mignon.\" |\n| ட | ḍ | hard or palatal d; stronger than d in \"drum.\" It has a sound of t in it. |\n| ண | n | hard or palatal n. |\n| த | t or d | as the t in \"tinder,\" or d in \"windy.\" [See Note 7.] |\n| ந | n | soft n as the n in \"fancy.\" |\n| ப | p or b | as the p in \"pardon\" or b in \"number.\" [See Note 8.] |\n| ம | m | as the m in \"demand.\" |\n| ய | y | as the y in \"yellow.\" |\n| ர | r | as the r in \"round\" and \"burial.\" |\n| ல | l | as the l in \"manly.\" |\n| வ | v | as the v in \"marvel.\" |\n| ள | ḷ | a peculiar rolling sound: a mixture of r, l, and the French j. |\n| ல | l | a hard l; harder than l in \"glove.\" |\n| ர | r | a vibrating r; something like r in \"crack.\" |\n| ண | n | the same as the soft n above, but used as a \"final.\" |\n| ஷ | ṣ | = Sanscrit sh. |\n| ஸ | ṣ | = Sanscrit sibilant s |\nNOTES.\n\n(I) (i) before d n r l l is sounded like u; as a@ leave, is pronounced vudu, not vidu.\n\n(II) (i) before d n r l l is pronounced like the German üh, as a@ a house, is pronounced rüdu, and not vidu.\n\n(III) (e) when initial, is generally sounded like ye; and (e) like ye. Thus g@ a tank is yeri and not éri, though the latter form should be adopted in a Glossary.\n\n(IV) é before d n r l l is sounded like the German oe in Goethe. As G@ a rising ground, not médu, but moédu, or nearly as if written in English murdoo.\n\n(V) (k) as an initial is k. Thus w@ káde a jungle. As a medial if alone it is g. Thus w@ magan a son, (but in words taken from the Sanscrit, the k is preserved.) As a medial double it is k. Thus L@ paham a side. As a final with a vowel, it is g. Thus L@ padaq a boat.\n\n(VI) (s) Though generally rendered by the English s when it is alone, the sound is more that of ch. Thus @ a field is pronounced more like chey than sey, though the latter form would be adopted in a Glossary. Thus chinna small, for sinna, &c. As a medial, if alone, it is more of the sibilant s, as w@ m@ a mouth. As a medial double the two form ch, as g@ achu, a mould. As a final with a vowel, it is more sibilant as g@ yasi hunger. When s follows p (r) it is pronounced ch. As g@ muvarchi effort. This letter supplies in Tamil the Sanscrit ch and s.\n\n(VII) (t) as an initial, is a soft like the Italian t. Thus g@ tuni a piece of cloth. As a medial, or a final with a vowel it is d; thus g@ kadavu a door, g@ kádu the ear. (N.B. This is to be distinguished from g@ kadu a jungle, with a hard d.) When double, g@ is tt without any sound of th, as g@ katti a knife. As an initial g@ is used for the Sanscrit d'h.\n\n(VIII) (p) as an initial is p. Thus L@ pádu a song; as a medial and alone, it has a sound of b, especially if following w (m), as L@ pambu a snake. When double L@=p, as g@ tappu a fault. As an initial, it is used for the Sanscrit b'h.\n\nL@=teh as w@ g@ matchima, excellence.\n\ng@=nj as g@ arju five.\n\nL@=tt (harder than g@=tt) as g@ attukkal a sheeps foot.\n\ng@=tt (harder than tt) as g@ attukkal a water course.\nHINDÚSTÁNÍ.\n\n1. The romanizing system that I would propose, is based on Sir William Jones' method, and brought into very general use by Shakespear. The arrangement proposed by Professor Wilson, in the introduction to his \"Glossary of Official terms,\" mainly coincides with the above.\n\n2. As Shakespear has been so long a well known authority, I would adhere to the spelling of Hindústání words that we find in his Dictionary with one or two slight modifications. They are as follows. 1st, I would use a different symbol for the ḍ; but of this more will be said presently. 2ndly, I would accentuate the (१) ṛ and the (२) ṛ because they are both long in Hindústání, and when we come to arrange an alphabet to suit Tamil and Telugu as well as Hindústání, it will be necessary to show the difference between the long and short ṛ's and ṛ's. 3rdly, I would introduce the aspirate mark ' before an h following a consonant: as bh instead of bh,—because the aspirate is peculiar to the original language from which Hindústání is framed, and needs to be sounded. 4thly, I would write the accents as in foreign European languages, ā ē ī &c., instead of ā ē ī as Shakespear does.\n\n3. Professor Wilson is no doubt a high authority, especially as he has endeavoured to make his roman alphabet suit various languages besides Hindústání, and it is therefore as well to show where his system differs from Shakespear, and why I adopt the latter, (all except ḍ for ḍ)\n\nWILSON. SHAKESPEAR.\n\n|   |   |   |\n|---|---|---|\n| 1 | ṛ | ṛ |\n| 2 | ṛ | ṛ |\n| 3 | ṛ | ṛ |\n| 4 | ṛ | ṛ |\n| 5 | ṛ | ṛ |\n| 6 | ṛ | ṛ |\n| 7 | ṛ | ṛ |\n| 8 | ṛ | ṛ |\n| 9 | ṛ | ṛ |\n| 10| ṛ | ṛ |\n\nE\n4. With regard to the first, Professor Wilson gives no reasons for this difference from Shakespear, but it is probably owing to his having arranged his roman letters first for Sanscrit, and, when other s's or s's came in Persian and Hindustani, he was obliged to adopt a new form. This is evident from his making s the equivalent for the Sanscrit ṣṭ, and thus Shakespear's s for ṣṭ was changed into s. In Southern India the Sanscrit ṣṭ is sounded like \"Sh\" as in Shiva, and Shrotriyam, and I am inclined to write it ṣṭ, especially as, in Hindustani, it is represented by ṣṭ, and in Telugu by ṣṭ. Sir William Jones writes it ṣṭ, and so do many other Orientalists, and therefore I would adopt ṣṭ. Which ever way it is, the equivalent for ṣṭ had better remain as Shakespear has it viz., ṣṭ.\n\n5. With regard to the letters ṣṭ and ṣṭ; according to Shakespear the former is the common ṣṭ, but the latter has a dot under it, or ṣṭ. Wilson just reverses this, but with hesitation, as he acknowledges. I prefer Shakespear, not only as being established, but because a dot generally denotes a more decided sound, and this is the case with ṣṭ, which is sometimes sounded so strong that Europeans have written it ch, as in Achmet for Ahmad. Sir William Jones distinguished it by an accent thus: ṣṭ.\n\n6. With regard to ṣṭ; Wilson renders it kh, and thus makes no difference between it and ṣṭ, whereas there is a very wide difference, as any one can hear in the pronunciation of ṣṭ a house, and ṣṭ food, or khāna and khānā. Shakespear's distinction of ṣṭ to show it is all one letter, I would preserve, though I admit it is not absolutely necessary if the aspirates are accentuated as recommended in para. 2.\n\n7. With regard to ṣṭ much the same observations as above occur. Wilson says that it is a modification of g, and writes it gh; but this is mere matter of taste, and no inconvenience can result from the well known equivalent used by Shakespear, viz., gh, and so distinguishing it from gh.\n8. With regard to \\( \\xi \\), that letter will be separately considered in an Appendix to this memo.\n\n9. I would not use *italics* at all. They may answer as distinctive marks in printing; but in writing, to underline letter might denote either a diacritical mark, or an italic, and it might be doubtful which.\n\n10. In ordinary writing, the following marks might be omitted: the dots underneath, to distinguish \\( d \\) from \\( d \\)—\\( s \\) from \\( s \\)—\\( z \\) from \\( z \\) and \\( z \\)—\\( t \\) from \\( t \\) and \\( t \\) &c.; but I would retain the aspirate in \\( k'h \\) \\( b'h \\) &c.; unless it were arranged to use \\( kh \\) and \\( gh \\) for \\( \\zeta \\) and \\( \\chi \\). The long vowel accents should be retained, as also the mark over \\( s \\) for the Sanscrit \\( \\Pi \\). The mark representing \\( \\xi \\) might also be omitted in common writing.\n\nThe above concession does not at all diminish the expediency of framing rules, whereby to write in Roman character, with diacritical points, the Eastern languages. In grammars and dictionaries the strict rule should be adhered to, and also in books printed throughout in the Roman character. The Roman rendering should be such, that one conversant with the rules, should be able to convert the words written or printed in that character, into their original character. That is the test of a correct method; and of course, in this case, all the diacritical points are required to be used.\n\nI now proceed to offer in an Appendix, my remarks on the rendering of \\( \\zeta \\).\n\n---\n\n**APPENDIX.**\n\n*Rendering of letter \\( \\xi \\).*  \n\n1. The rendering in roman character of the letter \\( \\xi \\), has as Wilson observes, \"always constituted a difficulty.\"\n2. Shakespear's rule is that, when initial in a syllable, it is represented by \\( \\text{a} \\) (which is its medial form) placed over the vowel which follows it in pronunciation. Thus \\( \\text{عَرْضِي} = \\text{arzi}, \\text{مُعاَفِي} = \\text{mu'aafi}; \\) but when it is not initial in a syllable, (\\( i.e., \\) when it has a jazm over it) the \\( \\text{a} \\) is placed after the vowel which precedes, as \\( \\text{مُعَمِل} = \\text{ma'mil}. \\) It will be observed that when \\( \\text{غ} \\) precedes a vowel, Shakcspear precedes it by an aspirate mark, (as in \\( \\text{mu'aafi} \\) above) to which he does not allude in his explanation.\n\n3. Wilson states that Sir W. Jones, in his Memoir, \"proposed to distinguish it by a circumflex;\" and adopts that plan himself.\n\n4. Richardson in his Persian Dictionary, as also Johnson, use the Arabic letter itself.\n\n5. In the proposed \"Missionary Alphabet\" it is proposed to render it \\( \\text{ح} \\).\n\n6. In the Calcutta papers of 1835-36 re-printed in London 1854, it is proposed to render it by a dot under the vowel to which it is attached.\n\n7. Dr. Lipsius, in his \"Standard Alphabet,\" objects to the circumflex over, or the dot under the vowel, as indicating a change in that vowel, whereas \\( \\text{غ} \\) is a full consonant, and is distinct from a vowel. He indicates it by \\( \\text{؟} \\).\n\n8. All these differences shew that the rendering of this letter requires consideration.\n\n9. In the first place it is to be borne in mind that the letter is purely Arabic, and by Arabic grammarians considered a consonant. Under no circumstances can it be considered a vowel, if only for this reason, that it requires to be surmounted by or subscribed with, one of the three vowel marks, in order to its constituting a syllable.\n10. Sir W. Jones' and Wilson's plan of the circumflex, will first be considered; 1st, where it is initial in a syllable: take the following examples:\n\nWilson and Jones.\n\nٍأَرْزِيّ ārzi\nٍأَمّ āmm\nٍإِضْتِرّ īzzat\nٍإِدّ īd\nٍأَينّ āin\n\n11. It is contrary to all usage to write anything above the place where a letter is to come, before writing the letter itself; and if the circumflex is used to represent ى, the reader is required to suppose in cases like ārzi and īzzat, that the circumflex was written before the subjacent letter.\n\n12. Again, where the ى is not initial.\n\nWilson and Jones.\n\nٍإِتِبَارّ ītibār\nٍدَوّ dāwā\nٍمُمْلُ mamlūl\n\n13. In all these cases, the ى has no vowel mark over or under it, but on the contrary, a jazm, in order to shew that it is quiescent. In these cases what vowel can the circumflex be 'circum' to, seeing that there is no vowel in the original syllable? ītibār, da\"wā, ma\"mūl, would be the only consistent method, if ى = : but then the circumflex would be over nothing! To place it over the preceding vowel, is to put it into a syllable to which it does not belong.\n\n14. Again the circumflex over a vowel is (as stated in para. 7) apt to mislead; for it would be supposed that by it the vowel was made broad, as in the French fête. Thus\nWilson would write māmil, and nālband, leading to the supposition that the mark denoted a long \\( \\alpha \\); whereas the \\( \\alpha \\) in both words is short, though it is true that this \\( \\alpha \\), which precedes the \\( \\xi \\), is with the \\( \\xi \\) sounded as in English \\( aa \\) or with a lengthened sound. So Wilson spells عالي علي and عالي علي the same, namely \\( \\alpha \\); whereas the former means lofty, and the latter the name of Muhammad's son-in-law.\n\n15. Again the circumflex stands in the way of a long vowel accent. Thus in the word عيد a festival, the \\( i \\) is long, but Wilson writes it \"id or did\" (instead of \\( \\iota d \\)) as if he were puzzled how to manage it. So he renders عاديل by \\( \\ddot{a}dil \\), thus as before departing from his own rule, that \\( \\xi \\) is represented by a circumflex; for in this case it is represented by \\( \\ddot{a} \\), or both circumflex and vowel. Other discrepancies are also observed. Thus علا he writes \\( \\iota lā \\); here the \\( \\xi \\) is again both circumflex and vowel. The same \\( \\xi \\) that is used for the long \\( i \\) in \\( \\iota d \\) is used for \\( \\iota zzat \\) where it is short. (See para. 10.) Again, ربيع is written \\( rabiā \\), where \\( \\xi \\) is again represented by \\( \\ddot{a} \\); and this in a word in which there is no sound of terminal \\( a \\) at all. Still he writes \\( jami \\) for جامع which if \\( rabiā \\) is right, should be \\( jamia \\).\n\n16. Shakespear's plan is objectionable on the same ground as Wilson's, so far as the initial is concerned. (See para. 11). The symbol must always have the appearance of having been superscribed after the completion of the vowel, and the initial position of the \\( \\xi \\) is apt to be overlooked. It is also objectionable inasmuch as it is used over a vowel like an accent, whereas it is a consonant, and should have its proper place in the word.\n\n17. Besides this, the symbol \\( \\xi \\) can hardly be called the \\( \\xi \\), for it is only the medial form of it; also it is ill adapted to long vowels, if they are accentuated in the usual fashion,\nThus ā is awkward. Shakespear's ā has these advantages over the circumflex: first, it is not an accentuation mark; and secondly, it is written according to a fixed rule. My own opinion is much in favor of the original Arabic letter inserted in its proper place, especially as a medial. Thus āin, mağmul, khilğat, inğam, zilağ &c. There is no typographical difficulty, and Johnson's Persian Dictionary,—a standard work—has it throughout. A Turkish Grammar printed in London during the Crimean war, also contains it. I have had the letter cast in Madras and used it in type easily and cheaply. This is no doubt the most correct method of rendering ā; but for the sake of expediency, I would not press it. Many would find it awkward to write, and it has an uncouth aspect by the side of roman letters.\n18. I would therefore substitute for it the *head* of the letter, namely ´; (or a reversed comma might do), and elevate it above the other letters.\n\n| SHAKESPEAR | WILSON | PROPOSED |\n|------------|--------|----------|\n| عرزي      | ārẓī   | ārẓī     | ārẓī     |\n| عام        | āmm    | āmm      | āmm      |\n| عيد       | īd     | īd       | īd       |\n| عين       | āin    | āin      | āin      |\n| راعيت     | raʿaiyat | rāiyat | raʿaiyat |\n| تعلي     | taʿalluk | taʿalluk | taʿalluk |\n| خليت     | khilʿat | khilʿat | khilʿat |\n| انعام     | inʿām  | inʿām   | inʿām   |\n| تعينات    | taʿināt | taʿināt | taʿināt |\n| معين      | muʿaiyan | muʿāin | muʿaiyan |\n| معمول     | maʿmul | māmul   | maʿmul   |\n| تابعدار   | tābiʿdār | tābiʿdār | tābiʿdār |\n| جمع       | jamaʿ  | jamāʾ   | jamaʿ   |\n| نصوح     | zilaʾ  | zilāʾ   | zilaʾ   |\n| ربيع      | rabīʿ  | rabiʿa  | rabiʿa  |\n| إطلاع     | ittilāʾ | ittilāʾ | ittilāʾ |\nCONSONANTS.\n\nb as the b in \"number.\"\np as the p in \"pardon.\"\nt dental t, as the t in \"tub.\"\npalatal t; as the t in \"trumpet.\"\ns A peculiar lisping s.\nj as the j in \"jelly.\"\nch as the ch in \"church.\"\nh hard h; like h in \"haul.\"\nkh a guttural kh, like the German final ch.\nd dental d, as the d in \"duty.\"\nd hard or palatal d; as the d in \"drum\" or \"dull.\"\nz as the z in \"razor.\"\nr as the r in \"fairy.\"\nr a hard vibrating r; often used for the hard d above.\nz as the z in \"hazard.\"\ns as the s in \"sinful.\"\nsh as the sh in \"shoulder.\"\ns The same sound as s.\nz The same sound as z.\nt Hard t.\nz Hard z.\ngh A peculiar arabic a.\nf A peculiar arabic guttural.\nk a clicking palatal k,\nas the k in \"king.\"\ng as the g in \"legation.\"\nl as the l in \"relief.\"\nm as the m in \"market.\"\nn as the n in \"denote.\"\nFinal and nasal n; as in the French \"bon.\"\nw or v as the w or v in \"wisdom\" and \"device.\"\nh as the h in \"hand.\" As a final, it has a perceptible sound if preceded by a vowel, and is then written h in Roman character; but otherwise the final h is neither sounded nor written. Thus دَرْجَةٌ is written dargah: دَرْجَةٌ\nVillage, is *dih*; but *nāma* writing, is *nāma*. Thus there is a distinction between *dāna* grain, and *dāna* a sage.\n\nN. B.—The Hindí *aspirate* or *h* has been adopted in the Hindústání language, by adding the ordinary *h* to the several consonants thus:\n\n|   |   |\n|---|---|\n| b'h | t'h |\n| t'h | ph |\n| ch'h | d'h |\n| d'h | k'h |\n| g'h | j'h |\n| r'h |\n\nIt is proposed to separate these letters by an aspirate, to distinguish them from *ch*, *kh* and *gh* which are each one letter, and to prevent the erroneous pronunciation of the th and ph which would occur to English readers. Thus *khāna* a house and *khāna* food, have a very different pronunciation of the first syllable.\n\nThe Arabic *alif-i-makṣūra* which terminates some words, is generally rendered in Hindústání by *i*; thus *fatwā* is *fītwa* or *fatwā*.\nVowel Marks.\n\n1. Zabar or fatḥa: the mark above the consonant to which it belongs, and equivalent to a short. Thus كلام kalam a pen. It is generally omitted in ordinary writing.\n\n2. ḍér or kasra; the mark below, equivalent to short i; as خدمت khidmat, service.\n\n3. Pesh or zamma, the mark above, equivalent to short u as پھول pʰul a flower.\n\n4. Hamza, the mark above. It is a mere compression of the voice, and in Roman character, is designated by an aspirate. It is seldom met with except between long ā and long ī. Thus امراء amrāʾi an orchard, آئین āʾin a statute or law. In some cases the long ī is converted into short ī, as ازمايش azmāʾish instead of azmāʾish trial; قائم qāʾim instead of kāʾim fixed; فائدة fāʾida instead of fāʾida profit. In this case it is called hamza i mulaiyana, or softened hamza.\n\n5. Tashdid, the mark above, shewing that the letter under it is doubled.\n\n6. Jazm, the mark above, shewing that the letter under it is sakin or inert: that is, having no vowel to be sounded after it. Thus کبر kubr a tomb, اسم ism a name. These words, if there were no jazm, would be kabar, and isam. So كلام kalam a pen, if written كلام would be klm. Thus كسر kasr breaking, كسب kasab a trade. The last letter of a word is always inert, and the jazm always understood.\n\nVowels.\n\n7. a short; as the a in 'volatile.' This sound is supposed to commence every syllable, unless the jazm occurs. (para. 6.) The initial alif is the only instance where the written ا is pronounced short. N.B.—When the unwritten\na short is followed by ع, it is generally pronounced long or like a double a, in consequence of the deepening sound of the ع. Thus مَمْلُوك pronounced māmūl custom. So تَالِك pronounced talik, a division of a district; نَالَ pronounced nāl.\n\n8. a long, as the a in 'father.' As an initial it is ا, or alif-i-mandida, or prolonged alif. As a medial or final, it is without the circumflex, as نَالَ a watercourse.\n\n9. i short; as the i in 'single.' This is simply the zér (para. 2.) Thus the word إِجَارَة ijarā a lease خِتَّاط khittāt* a dress of honor.\n\n10. i long; as the i in 'pique.' This is the yá† with the zér under and preceding it, ي. It is called the ya-i-mawrūf or known ya, this sound only being known in Arabic: as مِيرَاث mirās heritage. As an initial it is ي, thus إِرَان Irān Persia.\n\n11. é long; as the ei in 'neighbour.' (There is no short e in Hindustání.) It is called ya-i-majhūl or unknown, as it is a sound not known in Arabic. It is distinguished from the i of para. 10, and the ai of para. 12, by having no vowel mark, either above or below. Thus تِلَ oil. As an initial it is اِيَكَ ek one.\n\n12. ai, as the ai in 'aisle.' It is the ya with a zabar over and preceding it, and thence called ya-i-sākin mà kabl maftūh, or ya quiescent with a preceding fatḥa. Thus مَدِينَة maidān a plain. As an initial it is اِيَ; So اِسْمَا aisā such.\n\n* With reference to the N. B., of para 7, it will be observed that in this word, the ع precedes the a, and the a is not lengthened.\n\n† The letter ي is sometime consonant y, as when united with و, as يَاد yād memory فَرِيَاد faryād complaint. Words ending in ي preceded by long a or long i are pronounced as yat. Thus پَنْچَیَات panchayat a meeting of Arbitrators تَابِلْیَات tabiliyat an agreement.\n13. u short; as the u in 'fulsome.' This is simply the pesh (para. 3.) as ملك mulk a kingdom. As an initial, it is ا; as أستاذ ustād a teacher.\n\n14. ū long; as the oo in 'fool.' It is the wāo* with a pesh over and preceding it, or wāo ma'rif, or known wāo. Thus ضرور zarūr necessary. As an initial it is و but hardly any Hindustani words begin with it.\n\n15. o long; as the o in 'bony.' (There is no short o in Hindustani.) This is called wāo majhul or unknown wāo, as it is not used in Arabic, though common in Persian. It is distinguished from the ū of para. 14 by having no vowel mark attached. It is not used as an initial. N. B. When wāo follows خ it is written but not pronounced; and then it is distinguished in Roman characters, by w. Thus درخواست darkhwast a proposal. This wāo is called wāo-i-madūla or the passed-by wāo.\n\n16. au; as ou in 'bound.' It is the wāo with the zabar over and preceding it. Thus تول kaul permission; نوک naukar a servant. As an initial it is ا as اولاد aulad offspring, ا aur and. It is called wāo-i-sākin mā kabl maftūh, for it is quiescent, and follows fatḥa. (See para. 12.)\n\nW. H. Bayley.\n\n* The letter ū is also used as a consonant.\nTHE FOLLOWING ARE 163 WORDS OF COMMON OCCURRENCE.\n\n| Common Spelling | Correct Spelling | Common Spelling | Correct Spelling |\n|-----------------|------------------|-----------------|------------------|\n| Abbkarry        | Abbkári          | Chavedy         | Sávadi           |\n| Adawlut         | Adálát           | Chellaun        | Chalán           |\n| Amautuny        | Amání            | Chillum         | Chilam           |\n| Ameen           | Amín             | Chittah         | Chipt'ha         |\n| Anna            | Áná              | Chokra          | Ch'hókrá         |\n| Annicut         | Anaikaṭṭ(u)*     | Chop            | Ch'báp           |\n| Ayen            | Ain              | Chowky          | Chaukí           |\n| Bagayet         | Bagḥáyat         | Chuckler        | Sakkiliyan       |\n| Banghy          | Bahangí          | Chuckrum        | Chakkaram        |\n| Bareez          | Bérīj            | Chuttrum        | Sattiram         |\n| Batta           | B'hata           | Circear         | Sarkár           |\n| Beegah          | Big'há           | Clashie         | Khalásí          |\n| Bhutverty       | B'hattvarṭi      | Coil            | Kovil            |\n| Bowry           | Báóri            | Coir            | Kayir(u)         |\n| Bramin          | Brahman          | Conjee          | Kání             |\n| Brinjarry       | Banjára          | Conicopoly      | Kanakkapillai    |\n| Buckreed        | Baḳr'īd          | Coochel         | Kuchchela        |\n| Bund            | Band             | Cooltee         | Kulthi           |\n| Bunjeer         | Banjar           | Cooly           | Kúli             |\n| Byraghee        | Bairágí          | Coonchum        | Kuncham(u)       |\n| Caboolieat      | Kabuliyat        | Cotaur          | Kót'hár          |\n| Calingulah      | Kalingal         | Cowle           | Kaul             |\n| Candy           | Kandi            | Crore           | Karór            |\n| Carecoon        | Kárkun           | Cullum          | Kalam            |\n| Cash            | Kásu             | Chullm          | Kalam            |\n| Catamaran       | Katamaram        | Cumly           | Kambali          |\n| Cavilgar        | Kávalkár(an)     | Cummerbund      | Kamarband        |\n| Cawmie          | Káni             | Curnum          | Karanam(u)       |\n| Cazee           | Kází             | Cusbah          | Kaṣba            |\n|                 |                  | Cuscus          | Khaskhas         |\n\n* The terminations in parentheses, though correct as to letters, are not sounded and might be omitted in writing.\n| Cutbuddy | Katubadi |\n|----------|----------|\n| Cutchya | Kachchá |\n| Cutcherry | Kach'hari |\n| Dacoit | Dakait |\n| Dawk | Dák |\n| Deccan | Dak'han |\n| Deloyet | D'haláyat |\n| Dewan | Díwán |\n| Dholl | Dál |\n| Dhony | Dóni |\n| Doodie | Duddu |\n| Dooly | Dúlí |\n| Dowle | Daul |\n| Duffedar | Dafa'dár |\n| Dufter | Dafter |\n| Durgah | Dargáh |\n| Durkhast | Darkhwást |\n| Durma-curta | D'harma-kartá |\n| Dusserah | Das'hará |\n| Durzee | Darzí |\n| Eedgah | 'Idgáh |\n| Enam | In'ám |\n| Fakeer | Fakír |\n| Foujdary | Faujdári |\n| Fusly | Faşlí |\n| Fussul | Faşl |\n| Fysil | Faisal |\n| Garce | Garisa |\n| Gharry | Gari |\n| Ghaut | G'hát |\n| Ghee | Ghí |\n| Churree | Gar'hí |\n| Ghurry | G'hári |\n| Ghyre | Ghair |\n| Godawk | Gudák(u) |\n| Goolee | Guli |\n| Goomastah | Gumáshta |\n| Goonta | Gunta |\n| Goor | Gur |\n| Guddee | Gaddí |\n| Gunny | Ganní |\n| Harem | Harím |\n| Hejira | Hijra |\n| Hircarra | Harkára |\n| Hookum | Hukm |\n| Hoondee | Hundí |\n| Hoozoor | Huzúr |\n| Howdah | Hauda |\n| Hungamy | Hangámí |\n| Jaghire | Jágír |\n| Jemmadar | Jama'dár |\n| Jeroyety | Ziré'tí |\n| Jummabundy | Jama'bandí |\n| Kayem | Ká'im |\n| Khureetoo | Kharíta |\n| Kincob | Kimkhwáb |\n| Kyput | Kaipat(u) |\n| Lac | Lákh |\n| Lascar | Lashkar |\n| Layek | Lá'ík |\n| Loot | Lút |\n| Lubbay | Labi |\n| Mafee | Muáfi |\n| Mahomet | Muhammad |\n| Maistry | Méstri |\n| Mamlutdar | Mu'amalatdár | Musnud | Masnad |\n|-----------|--------------|--------|--------|\n| Mamool    | Ma'mul       | Mutt   | Math   |\n| Marahmut  | Marammat    | Nacoda | Nakhudá |\n| Masalchee | Mash'alchí   | Naigue | Nayak  |\n| Mauniem   | Mániyam     | Nair   | Nayar  |\n| Meerassy  | Míráj       | Natcheny | Nachini |\n| Merah     | Mérai       | Nautch | Nách   |\n| Mercal    | Marakkál    | Nerrick | Nirkh  |\n| Mocassah  | Mukhása     | Nicka  | Nikáh  |\n| Mofussil  | Mufassál    | Nullah | Nálá   |\n| Mohturfa  | Muhtarafa   | Nunjah | Nansey |\n| Mohunt    | Mahant      | Nuzzer | Nazr   |\n| Mohur     | Muhar       |        |        |\n| Mohurrum  | Muharram    | Olluck | Alák(ku) |\n| Momety    | Momaj*      | Olcoody | Úlkudi |\n| Monigar   | Manjakár(an)| Oolungoo | Olungu |\n| Moochee   | Móchí       | Oomedwar | Úmmédwár |\n| Moochilka | Muchalka    | Ordoo  | Urdú   |\n| Moofty    | Muftí       | Oroos  | 'Urs   |\n| Moolgueny | Múlgaini    | Parcherry | Paraichéri |\n| Moollah   | Mullá       | Pariah | Paraiyan |\n| Moolvy    | Maulaví     | Pergunnah | Pargana |\n| Moonshee  | Munshí      | Perumboke | Purambók(ku) |\n| Moonsiff  | Munsíf      | Peshcush | Péshkash |\n| Moosulman | Musalmán    | Petta  | Péitái |\n| Mootah    | Mu'th'ba    | Pie    | Pái    |\n| Mootasuddy| Mutasa'ddí | Pindarry | Pend'hári |\n| Moplah    | Mápillá     | Poligar | Palaiyakár(an) |\n| Moyen Zabitah | Mu'ayyan Zábí-ta | Pollum | Palam |\n| Muzoondar | Majmú'dár   | Poonjah | Punsey |\n| Motabar   | Mu'tabar    | Pooty  | Putti  |\n| Mouzah    | Mauza\"      | Paracoody | Parakudi |\n| Mushrooty | Mashrútí    | Potalil | Patél  |\n| Musjeed   | Masjid      | Pucka  | Pakka  |\n| Puckally | Pak'háli |\n|----------|----------|\n| Puddy    | Padi     |\n| Puddial  | Padíyál |\n| Puggree  | Pagri    |\n| Punchayet| Pancháyat|\n| Punkah   | Pank'ha  |\n| Purdah   | Parda    |\n| Purwannah| Parwána  |\n| Putcut   | Pattukatt(u) |\n| Puttah   | Pattá   |\n| Pyacarry | Payakári |\n| Pygusht  | Paigast  |\n| Pymash   | Paimá'ish |\n| Raggy    | Rágí     |\n| Razeenamah| Rází-náma |\n| Reyayet  | Ri'áiyat |\n| Rissaldar| Risáladár |\n| Rowannah | Rawána   |\n| Russoom  | Rusúm    |\n| Saderward| Sádirwárid |\n| Sagobuddy| Ságubadi |\n| Salastry | Sálotári |\n| Sayer    | Sá'ir    |\n| Seacunny | Sukkání  |\n| Seer     | Sér      |\n| Sepoy    | Sipáhí   |\n| Serang   | Sarhang  |\n| Sevoy-jumma| Siwá'i-jama |\n| Shaikal  | Seykkál  |\n| Shavy    | Sávi     |\n| Sheristadar| Sarrishtadár |\n| Sheeah   | Shí'ah   |\n| Shroff   | Sarráf   |\n| Shrotrium| Srótriyam |\n\n| Sibbendy | Sihbandí |\n|----------|----------|\n| Sicca    | Sikka    |\n| Silledar | Silahdár |\n| Soobah   | Súba     |\n| Sotuntrum| Swatantram |\n| Soucar   | Sáhúkár  |\n| Sowar    | Sawár    |\n| Sudder   | Şadr     |\n| Sunnud   | Sanad    |\n| Suttee   | Satí     |\n| Takeed   | Tákíd    |\n| Taliary  | Talaiyári |\n| Talook   | Taalluğ  |\n| Tannah   | Thán     |\n| Teerwa   | Tírvai   |\n| Thug     | T'hag    |\n| Thasildar| Tahsildár |\n| Tindal   | Tandel(u) |\n| Toom     | Túm(u)   |\n| Toondoovarum| Tunduváram |\n| Totacal  | Tóttakál |\n| Tuceavy  | Takáví   |\n| Turrufdar| Tarafdar |\n| Turrum   | Taram    |\n| Tusdeek  | Tasdík   |\n| Tynaut   | Ta'inát  |\n| Urzee    | 'Arzí    |\n| Ussul    | Aşal     |\n| Vakeel   | Vakil    |\n| Vaylie   | Véli     |\n| Veesabuddy| Visabağı |\n| Viss     | Vissi    |\n| Wooliem  | Úliam    |\nWudder Ottan* Zabitah Zábita\nWurg Varga Zemindar Zamindár\nWussul Waṣṭil Zillah Żilaʾ\nYadast Yáddášht Zuft Zabt\nYeomiah Yaumia\n\nThe following words though mis-spelt, have almost become European.\n\nArrack Araḳ Hopper Appam\nBandy Bandi Jelly Salli\nBungalow Bánglá Jungle Jangal\nChatty Ṣāṭṭi Maund Manangu\nCheroot Šūruttu Rupee Rúpiya\nChunam Sunnámbu Ryot Raʾaiyat\nCurry Kari Teapoy Ti-npáʾí\nDubash Dó-bḥášhí Toddy Tári\nFanam Paṇam Tope Tóppu\nGodown Gidangu Jaggery arkkari\n\n\"DIVISIONS\" OF THE MADRAS COLLECTORATE.\n\nVeysarpady Veyásarpádi Chintadrapett Sintádiripéttai\nPerumbore Perambúr Chepauk Sépákkam\nVepery Véperi PoodoopankumPuduppákam\nPursewaukum Pursaipákkam Mylapoor Mailápúr\nKilpauk Kílpákkam Royapoorum Ráyapuram\nChetput Sétupattu Tondiarpet Tándaiyárpét-tai\nEllumbore Elambúr\n\n* Pl. Ottar.\nAPPENDIX C.\n\nMemorandum to accompany a proposed scheme for the representation of native names and words in the English character.\n\n1. It is, I think, needless to argue the necessity of some systematic way of representing native names in the English character. All will probably admit the desideratum. The accompanying scheme shews the Alphabet which I would propose to adopt for the representation of the five principal languages of the Madras Presidency, and Sanskrit. The latter is added, as Sanskrit words are so largely adopted into all the Madras languages.\n\n2. I am aware that the proposed Alphabet, as it stands, is not the best or most simple way which could be devised for representing the character of any one of the five languages; but as it is doubtless desirable to have one Roman-Alphabet for all the native languages of the Presidency, sacrifices have been made to attain this end; and my endeavour has been to devise a way of representing six native Alphabets with as much simplicity as is consistent with critical correctness.\n\n3. I earnestly hope for the early attention of Government to the subject with a view to the speedy adoption of this or some plan. The careless and unintelligible way of representing native names is a great and increasing evil. I may instance the Yomiah\nallowance Lists which came up the other day from the Board of Revenue, and are now being printed. Many of the names are utterly unintelligible, and many more only to be distinguished by a series of guesses.\n\n4. I would beg to suggest that all departments under Government be directed rigidly to adhere to the scheme now circulated, (or that which may ultimately be adopted) in representing all native names in their Official Papers, from the commencement of the approaching Revenue year (1st July 1859). This will give writers, &c., ample time to master the details of the scheme. Something like the following short instructions might be issued.\n\nI. In writing native names and words, no letters are to be introduced which do not exist in the original. For example the use of h at the end of proper names as Rámaya, Ránappa, now so common, is wholly inadmissible.\n\nII. The letters which do exist in the original are to be expressed according to the accompanying scheme.\n\nIII. Names of Districts, and other names which have been thoroughly Anglicized, as for example those in the annexed list, are to be written as usual without alteration. When a doubt exists as to whether a word has been thoroughly Anglicized, it is to be given in the correct form.\n\n5. I would solicit attention to the fact that the change will not be nearly so great, as a glance at the tabular statement would lead one to suppose. The more complicated symbols are of comparatively rare occurrence; and the only diacritical points which often occur are the dots underneath the hard letters, and the accents over the long vowels—to introduce these will surely be a most simple matter.\n\n6. It appears advisable to notice an objection made by an officer whose opinion would from his position seem at first sight entitled to weight. I do this in case the same opinion may be held by others; though this is, I hope, scarcely\nprobable, as it is merely the offspring of prejudice and not of conviction. It is said that \"if the orthography of names is altered, the names in their amended form, will not be identifiable with themselves as they stood previous to emendation.\" I reply that there is no definite plan of spelling names in use for which it is proposed to substitute another definite plan. There is no existing fixed method of representing words, a departure from which would endanger their recognition. What is proposed now, is to establish a definite plan, instead of allowing each name to be written according to the fancy of the writer, and his ideas of the force of letters and the pronunciation of what he writes. No objection is made to perpetual contortions and uncouth changes of form which it is impossible to deny take place now in writing names, scarcely any one being presented twice in the same garb; no fears are expressed of non-recognition now, but most unaccountably, if it is proposed to make a change on certain fixed principles once for all, it is objected that the words so changed will not be identified. I would ask if this has been found the case in the N.W.P. where a correct orthography has been attempted, or whether it is consistent with reason and common sense to suppose that it ever will be?\n\n7. I conclude with another expression of an earnest hope that steps may at once be taken in the matter.\n\nM. NORMAN,\n\nDeputy Secretary to Government.\n\nBangalore,\nMarch 12th 1859.\nA.\n\nAnna. Cooly Pie.\nAnicut. Dacoit. Pice.\nBatte. Harem. Poligar.\nCash. Jaggery. Rupee.\nCatamaran. Lascar. Ryot.\nChuckler. Maistry. Sepoy.\nCoiir. Mohur (the coin). Shroff.\n\nAnd perhaps the most common weights and measures may be added as viss, ollock, &c.\n\nB.\n\nCorrect spelling. Spelling in the Proceedings of Govt.\nRabí ul awal........... Rabee oo lawl.\n? unintelligible....... Wrijianul nissa.\nJánakí.................. Jawnaky.\nTirupanantál.......... Trippendal.\nBilmoká................. Bilernetah.\n'Achári.................. Auchary.\nMalsar.................. Muleers.\nPurushóttamapuram.... Prosutpoor!\nVriddháchalam........ Veerootachellam, &c. ad infinitum.\n\nMangalagiri............ Mungulyirry.\nTénálí.................. Jenally.\nRépalli.................. Rasilly.\n\nExtract Minutes Consultation, 30th April 1857, No. 830, Revenue Department.\n\nKhawder, Khader.\nKhawther, Cader.\nCawder.\nKawder.\nKauder, &c., &c.\n\n*Kullan.................. * Quilon.\n* So corrupted I suppose because Kullan is something like Kollam a town in Travancore which is called by Europeans Quilon! ...\n\nMinutes Consultation, Public Works Department, 22nd April 1837, No. 751.\n\nBhawáni..................\nVáganai...............\nVéda vritti............\nGurukkal..............\nMalaiyapuram..........\nMágánam..............\nKánún..................\nHurmat un nisá........\nMahtáb khor...........\nMudu krishnaiyangár.\nTirumalai 'Achári......\nRanjangarh............\nSátgada...............\nPhala naštam..........\nUnintelligible; either\nAbú Turáb; or Ab-\nhûta Radzu...........\n\nBohwanny.\nBowanny.\nBhowaney.\n——ay.\nBawany, &c., &c.\nVaughany, Vaughanay.\nVedah varthe.\nVada vurthee.\nVeda virthee.\nVada verte, &c.\nGoorkul, Goorookul.\nMullapooram.\nMallayapooram.\nMalaprom.\nMulapoorum.\nMullapooram &c.\nMáhanom.\nKaunnoon.\nHoor Muttoo Missal.\nMootah Kanar.\nMootookristin Engar.\nTeroomulah Charry.\nTrimul Auchary.\nThirmalah Charry.\nThiroomul Chary.\nRunjanagoody.\nRunjungada.\nRunjengeddy.\nRunjnegudd.\nRunjungode.\nRungangudda.\nSautghyr.\nFalamuptum.\nAbotoorah.\nAhboothooraz.\nAbootoora.\nKásim\n\n{ Cossim\n  Kohsum,\n  Cassim,\n  Cawsim,\n  Kawsim, &c., &c.\n\nIbráhím\n\nExtract Minutes Consultation, 22nd October 1857, No. 1508, Public Department.\n\nUnintelligible; perhaps Sabdattuppadapporul\n\nSytuttoopudappore.\n\nBrahmadésem\n\n{ Bremadasom.\n  Brumma—\n  Bromma—\nI deem it unnecessary to enter into argument to show how impossible it is to represent the Vowels of the Oriental Alphabets in the Roman character; if the English standard of pronunciation be adopted. I will merely state that the force possessed by the Italian vowels is to be given the \"Roman equivalent\" in Col. 7.\n\n| Remarks and Explanation. |\n|--------------------------|\n| I prefer ai to ei, as, first, less likely to be mispronounced, and 2ndly, because it represents more nearly the nature of the vowel. |\n\n| Proposed Roman Equivalent. |\n|---------------------------|\n| a | a | i | i | u | u | e | e | o |\n| Persian and Hindustani.    |\n| Tamil.                    |\n| Malayalam.                |\n| Kannada.                  |\n| Telugu.                   |\n| Sanskrit. (Devanagari)    |\n\nII\n| Remarks and Explanation |\n|-------------------------|\n| This n is almost always mute, as is likewise in Tamil. It may therefore at option be expressed by n only. But when followed by a vowel the distinctive dots and line must be added, as in innaman, in this manner; nayru, the sun. When followed by a consonant the class of n will be known by the consonant following; thus n only will precede e and e only. |\n\n| Proposed Romanization |\n|-----------------------|\n| o | k | kh |\n| g | gh | ch |\n| elh | j | jh |\n\n| Present and Historical |\n|------------------------|\n| Tamil | Malayalam | Keralite | Telugu | Sanskrit (Devanagari) |\n\n| Sanskrit (Devanagari) |\n|-----------------------|\n| क | ख | ग | घ | च | छ | ज | झ |\nAs kanji, rice water; nayiru, the sun. Mal. kumia, the young of animal.\n\nWhen in Hindustani, Sanskrit words containing this letter require to be expressed, the may be represented by n though there is no distinct symbol for hard n in the language. Ana savarn \"of the same class with.\"\n| Sanskrit (Devanagari) | Tamil | Malayalam | Kannada | Telugu |\n|----------------------|-------|-----------|---------|--------|\n| श्व | ச்வ | ശ്വ | ಶ್ವ | శ్వ |\n| The letter 'श्व' does not exist in the Tamil alphabet proper. It is a Grantham letter. In Hindustani both 'श्व' and 'श' are used to represent the sanskrit 'श्व', as 'श्व' or 'श' siw, or shiw, the god Shiva. Likewise 'श' represents both hard and soft sh; i.e. sh and shh; as 'श' shumart, computation; koshish, endeavour; but karsh agriculture. 'श' is a Grantham letter, not existing in the Tamil Alphabet proper. It is generally used where 'ś' is mute in words, adopted from sanskrit, as 'श्व' Nāṭikān, an infidel. |\nThe character \\( \\text{श} \\) is not found in the Tamil alphabet proper, but the use of it is on the increase, and I believe it is admitted by all that it is highly desirable to introduce it freely to express \\( \\text{ह} \\) in words adopted from the Sanskrit, as \\( \\text{आहंकारम्} \\), egotism not \\( \\text{अहंकारम्} \\).\n\n| h | y | r | l | v | w | ksh |\n|---|---|---|---|---|---|-----|\n| \\( \\text{ह} \\) | \\( \\text{य} \\) | \\( \\text{र} \\) | \\( \\text{ल} \\) | \\( \\text{व} \\) | \\( \\text{व} \\) | \\( \\text{क्ष} \\) |\n\nThe Sanskrit visargah. Simply a soft final \\( \\text{ह} \\).\n\nThe Sanskrit anusvara. Simply a final \\( \\text{m} \\) or \\( \\text{n} \\) in Sanskrit; in Telugu, Karnata, and Malayalam \\( \\text{n} \\) or \\( \\text{m} \\) according to the consonant it precedes.\n\nLike the \\( \\text{n} \\) in the French sans, bon. Hindi: \\( \\text{नूनि-घन्ना} \\).\n\nA harsh \\( \\text{l} \\), something like \\( \\text{rl} \\).\n\nThe sound might be more nearly imitated by \\( \\text{zh} \\) if the Tamil alphabet alone had to be represented. But it is impossible to imitate the sound exactly; and \\( \\text{zh} \\) has been chosen for the Hindustani.\n| Remarks and Explanation | Called \"raitham,\" sounded like ch in German \"nicht,\" of very rare occurrence. |\n|-------------------------|----------------------------------------------------------------------------------|\n|                         | as in masāḥat, measurement.                                                      |\n|                         | as in fark difference.                                                           |\n|                         | as in khair, well!                                                               |\n|                         | as in sābit, firm.                                                              |\n|                         | as in sadr, principal.                                                          |\n|                         | as in khatit, letters.                                                          |\n|                         | as in zindagi, property.                                                        |\n\n| Proposed Bo-Indian Equivalents | f | k | h | kh | z |\n|-------------------------------|---|---|---|----|---|\n| Persian and Hindustani         |   |   |   |    |   |\n| Tamil                         |   |   |   |    |   |\n| Malayalam                     |   |   |   |    |   |\n| Kannada                       |   |   |   |    |   |\n| Telugu                        |   |   |   |    |   |\n| Sanskrit (Devanagari)         |   |   |   |    |   |\n| gh | zh | z | z | z | z | Hamza | Muddyma | Tarwin | Was! |\n|----|----|---|---|---|---|-------|--------|--------|------|\n| as in غَهْرَةٌ mū'tād accustomed. | as in غَهْرَةٌ ghair without. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. | as in جَزَّاز zhizh, abuse. |\n\nThis mark, when placed over the first letter of a word to which the Arabic article || al- is prefixed, changes the 1 of the article to the initial letter of the word following when that initial is t q d r s h s z l or n; as Mihr um-nisā sun of women; azhar min ush sham', clearer than the sun.\n| Sanskrit (Devanagari) | Tamil | Malayalam | Telugu | Kannada | Sounds peculiar to certain single letters |\n|----------------------|-------|-----------|--------|---------|------------------------------------------|\n|                      |       |           |        |         | dz                                       |\n|                      |       |           |        |         | ts                                        |\n|                      |       |           |        |         | Wā o i Maddia                            |\n\n| Proposed Ro. | Present end | Hindustani. |\n|--------------|-------------|-------------|\n|              |             |             |\n\n| Remarks and Explanation |\n|-------------------------|\n| as शेषोर्बृत्तुमत्रम्, the date tree. |\n| as चेत्तुमाक्तलं, chettumakta sons of the soil, slaves; pettu चेत्तुमाक्तलं having brought forth. |\n| as in Fatwa شَرْفِي (Alif-Fatwa) |\n| as राज़वन् a king. |\n| as तुस्तुलु Behold! |\n| As ख़ाइऱ khair khwah. This word is scarcely sounded at all ordinarily, or has the sound of a short u. |\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/reportsubcommit00unkngoog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 72, "total-input-tokens": 93484, "total-output-tokens": 30333, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 234, 5], [234, 234, 6], [234, 1586, 7], [1586, 3492, 8], [3492, 5005, 9], [5005, 6980, 10], [6980, 8921, 11], [8921, 10914, 12], [10914, 12661, 13], [12661, 14650, 14], [14650, 15168, 15], [15168, 16314, 16], [16314, 18463, 17], [18463, 20532, 18], [20532, 21828, 19], [21828, 23838, 20], [23838, 25575, 21], [25575, 26703, 22], [26703, 27275, 23], [27275, 28653, 24], [28653, 30452, 25], [30452, 31865, 26], [31865, 33801, 27], [33801, 37319, 28], [37319, 39507, 29], [39507, 40587, 30], [40587, 41209, 31], [41209, 43130, 32], [43130, 45272, 33], [45272, 46795, 34], [46795, 48171, 35], [48171, 50194, 36], [50194, 51803, 37], [51803, 53920, 38], [53920, 55562, 39], [55562, 57545, 40], [57545, 59237, 41], [59237, 60991, 42], [60991, 62260, 43], [62260, 64327, 44], [64327, 65126, 45], [65126, 66055, 46], [66055, 67165, 47], [67165, 67986, 48], [67986, 69502, 49], [69502, 71261, 50], [71261, 72435, 51], [72435, 75033, 52], [75033, 76366, 53], [76366, 78048, 54], [78048, 79736, 55], [79736, 80533, 56], [80533, 81831, 57], [81831, 83722, 58], [83722, 85207, 59], [85207, 86158, 60], [86158, 87244, 61], [87244, 87510, 62], [87510, 88308, 63], [88308, 89029, 64], [89029, 89313, 65], [89313, 89992, 66], [89992, 91109, 67], [91109, 92544, 68], [92544, 93272, 69], [93272, 94338, 70], [94338, 94338, 71], [94338, 94338, 72]], "primary_language": ["en", "None", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, true, true, false, false, false, false, false, false, false, false, true, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, true, true, false, true, true, true, true, true, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]