[{"id": "6eab9caaeac7470216b2dd5201811e9bbb304ba6", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\nVOL. III.—Part I.\n\nSupplied gratis to all Members of the Society.\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\nSeoul, Korea: Hon. Librarian.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1903.\nCONTENTS.\n\nCh'oe Ch'i-Wun: His Life and Times ........................................... 1\nThe Culture and Preparation of Ginseng in Korea ......................... 18\nMinutes of the Annual Meetings .................................................. 31\nReport of the Council ...................................................................... 34\n\nAppendix:\n\nOfficers ....................................................................................... 37\nList of Members ............................................................................. 38\nCatalogue of the Landis Library .................................................... 41\nCH'OE CH'I-WUN: HIS LIFE AND TIMES.\n\nBY REV. G. H. JONES, PH.D.\n\nThe dominant literary force in Korea for the past five hundred years has been Confucianist in its philosophy and teachings. Such literary activity as has prevailed has been influenced and controlled by the sages of China. This tendency in Korea's literary development has given origin to a school of writers, numerous and industrious, who have enjoyed royal patronage, and have thus been able to exclude all rival or heretical competitors and to mould to their own standards the literature of the Korean people.\n\nThough we have mentioned this school as belonging particularly to the present reigning dynasty, it is only in the sense that its supremacy as a school dates from the founding of the dynasty (A.D. 1392). It long antedates the period indicated, and though it is difficult to say who was the founder of it, still, as far as the present writer has been able to discover, that honour seems to belong to the Silla scholar, Sül-ch'ong (薛聰), who lived in the eighth century of the Christian era. Our reason for suggesting that Sül-ch'ong is the founder of this school in Korea is as follows: It has been the policy of the Confucian school in Korea, following the example set by the great parent school in China, to canonize those of its most famous members who have made some noteworthy contribution to the development of Confucianism in Korea. This canonization consists in the enshrinement by imperial edict of a tablet to the recipient of the honour in the great temple to Confucius, the Söng Kyun Kuan (成均館) at Seoul, the spirit of the disciple thus being permitted to share in the divine honours paid to the Sage. At the same time imperial letters patent are issued conferring a posthumous title on the recipient, usually of a princely or ducal order. Sixteen Koreans have thus far been so honoured, four in the epoch from Sül-ch'ong to Chông Mong-jo (about 600 years), and twelve during the present dynasty, a period of 500 years.\nIn making out this list it is reasonable to believe that the scholastic authorities would place at its head the one man who, in their estimation, was entitled to be considered as the Founder of the Confucian school in Korea. To have ignored him would have been to put a low estimate upon the introduction of the Confucian school of thought and philosophy to Korea. And as in their estimate this unique honour appeared to belong to Sūl-ch'ong his name heads the list of the Illustrious Sixteen. Later scholars on investigation may be led to dispute this, but it appears to be the unbiased judgement of former times.\n\nIf this conclusion is adopted it will be wise to mark certain inferences which are not necessarily to be deduced from our assigning the headship to Sūl-ch'ong. First of all, it does not mean that previous to Sūl-ch'ong Confucianism was unknown as a literary force in Korea. This by no means follows. As has been shown in Mr. Gale's very able paper,* from the time of Kija the writings which form the base of Confucianism were known among the peninsular people. Works were written in the Chinese ideographs by Korean scholars, and customs and institutions were adopted from the great kingdom across the sea. But a distinction may be made historically between Chinese civilization in itself and Confucianism. Chinese civilization even today is a composite in which Buddhist and Taoist elements, and survivals from savage and barbaric life have a part as well as Confucianism. And for the first few centuries after the death of the Sage, Confucianism had a chequered history in its land of origin, occupying a far different place from what it does now. So that, as appears to have been the case in certain periods between Kija and Sūl-ch'ong, Chinese civilization was the vehicle to bring to Korea philosophies and economies vastly different from those for which Confucianism stands. In illustration of this we would instance Buddhism. Therefore in dating the introduction of Confucianism as a school of thought from Sūl-ch'ong we do not touch the question of the introduction of Chinese civilization, neither do we deny the presence of Confucian influence previous to Sūl-ch'ong. Only the latter was an influence ex-\n\n* \"The Influence of China on Korea.\" Vol. I. R. A. S. Transactions (Korea Branch).\nerted from without, a foreign influence, an exotic. It was the aim of Sul-ch'ong, Ch'oé Ch'i-wun, An-yu and their fellow-schoolmen to make the exotic indigenous.\n\nThe list of the sixteen canonized scholars of Korea is of much interest historically, as it puts us in possession of the verdict of a very important section of native litterateurs on the comparative importance of the labours of Korean scholars in the past. We must not fall, however, into the error of thinking that these are Korea's only scholars. Their eminence is due to the fact that they best fulfilled the standard set up by the Confucian school for canonization. This list is as follows:\n\n1. Sul-ch'ong\n2. Ch'oé Ch'i-wun\n3. An-Yu\n4. Chöng Mong-ju\n5. Kim Kong-p'il\n6. Cho Kwang-jo\n7. Yi Whang\n8. Sung Hun\n9. Song Si-yul\n10. Pak Se-ch'ai\n11. Chung Yo-ch'ang\n12. Yi Eun-jük\n13. Kim In-hu\n14. Yi I\n15. Kim Chang-saing\n16. Song Chun-kil\n\nWith this introduction we proceed to consider the life, labours and times of the second savant named in this list—the Silla scholar, Ch'oé Ch'i-wun.\n\nHe was born in troubled times. During the period A.D. 862-876 Kyung-mun (景文王) was King of Silla; but of the events of his reign we know very little, many of the histories simply mentioning his name and the dates of his accession and death. All authorities agree that it was the period of Silla's decline. A long line of forty-seven monarchs had already sat on the throne of Silla. The neighbouring kingdoms of Paik-je (百濟國) and Ko-gu-ryu (高句麗國), which\nhad once divided the peninsula with Silla, had more than two hundred years previously been obliterated from the map by the Silla armies aided by the Tang, and Silla had held sole sway over all clans bearing the Korean name. And now Silla, torn by internecine strife and faction, had become the prey of ambitious mayors of the palace and was slowly verging to her final fall.\n\nIt was about this time that two men were born in Korea who were destined to climb high the steeps of distinction, and yet whose careers present many contrasts. One of these was Ch'oe Ch'i-wun and the other Wang-gun (王建), founder of the Koryu (高麗) dynasty. It is indeed an interesting fact that these men were contemporaries and acquainted with each other. The \"man-child of the Wang family\" was born amid the pine forests of Song-ak, and legend, which ever paints in mysterious colours the birth and childhood of Asiatic dynasty founders, relates many strange stories of the marvellous portents and omens which heralded his entrance upon this world. These stories would have been in all probability transferred to Ch'oe Ch'i-wun had he, instead of Wang-gun, proved the Man of Destiny for Korea and obtained the throne, for which he had received a splendid training.\n\nCh'oe Ch'i-wun was born in the year A.D. 859, the scion of one of the influential families of Kyeng-ju (慶州), the capital of Silla. Of his ancestry we possess very little information. But it seems clear that his family, like that of Sül-ch'ong before him, belonged to the Tang partisans in Korea, who had lost confidence in Buddhism—still the state cult in Korea—and who looked westward across the Yellow Sea for light and salvation. As a mere lad Ch'oe grew up in contact with those educational forces set in operation by Sül-ch'ong a century earlier, which were already beginning to mould and shape the literary life of Korea. We pause for a moment to consider them.\n\nAt this time the tide of the Confucian cult was rising in Korea. The close connection which had existed for centuries between the Tang and Silla courts had undoubtedly prepared the latter to give a favourable hearing to the Chinese Sage, though Silla still held to Buddhism as the state religion.\nAs far as we can gather from the history of the times, Confucianism had not become the dominant cult in Korea. It had influenced the thought and life of the people, it is true; but this influence it exerted from without, from its distant centre in China rather than from the vantage point of a settled location in Korea itself. The forces, however, which later, under An-yu (安裕), were to bring the Confucian cult bodily to Korea and plant it there were already at work. As a sign of the times we are told in the Mun-hun-pi-go (文獻備考) that in 864, five years after the birth of Ch'oé Ch'i-wün, the King of Silla personally attended at the College of Literature and caused the canonical books of China to be read and explained in the royal presence. And with this we may correlate another statement that, sixteen years later, in 880 A.D., the following books were made the basis of education in Silla, viz:\n\n- The Book of History\n- Changes\n- Poetry\n- Rites\n- Spring and Autumn Annals\n- Former Han History\n- Later Han History\n- The History 史記 by Sze Ma-ts'ien (司馬遷)\n\nAre we not justified in regarding the presence of the sovereign at public lectures on the sacred books of China as of some significance? We are inclined to believe that it marked the inauguration of a movement which was to place education in Korea on a Confucian rather than a Buddhistic basis. And in this connection it is interesting to note that the Mun-hun-pi-go says: \"At this time lived Ch'oé Ch'i-wün, who had gone to China and there become an official.\" Thus showing that Ch'oé's influence became a potent factor in the movement to popularize Chinese literature in Korea.\n\nReturning to the chronicle of Ch'oé's life we find that at the time the king was lending the royal presence to public lectures on Confucianism, Ch'oé, a mere lad of five years, was just beginning his studies. For seven years he continued them under such teachers as could be found in the\nSilla capital, but these at the very best must have been unsatisfactory. At the most he could hardly hope to obtain more than a start in Chinese literature. Then it was that his father ordered him to proceed to the land of Tang, and there, at the fountain head of Chinese learning, complete his education. The causes which led him to take this step are not given and yet it is not difficult for us to surmise them. It was not an unknown thing for a Korean to go abroad, even in those early days. Beginning with the custom of sending hostages to reside in foreign Courts, which had been done in Korean relations both with China and Japan, when this became no longer necessary, a few Koreans had voluntarily crossed the seas to these lands in search of adventure or education. Of recent years, however, these had been confined to members of the royal house. It may have been that Ch'oe's father was a leader among the Tang partisans in Korea and took this radical step to mark his devotion to the Chinese. But better still, it seems to me, is the explanation that the lad had already displayed such large promise that high hopes were based on his ability, which hopes could only be realized by an education abroad. Certainly the tradition that the father in parting with the boy gave him a limit of ten years in which to finish his studies and secure the Doctor's degree, failing which the penalty was to be disinheritance,—this tradition certainly seems to agree with the latter view. At any rate, great was the confidence of the father in the son and high the value he set on a Chinese education when he was willing to send him at such a tender age to a foreign land.\n\nLet us glance at the China to which young Ch'oe was introduced. The Tang dynasty still held sway over the land, one of the most powerful, brilliant and wealthy dynasties that ever ruled China. We may not be able to assent to the dictum of a noted writer* that China was at this time probably the most civilized country on earth, but it seems true that under the leadership of the House of Tang she reached one of the highest levels in the development of her culture.\n\nIt was a period of great military activity. The Tang generals had carried the prowess of the Chinese arms far to the westward, almost to the borders of Europe. They had\n\n*S. Wells Williams in *The Middle Kingdom*.\nconquered the savage tribes to the north, had annihilated the warlike Kogurios in the north-east, and spent one campaign on the southern end of the Korean peninsula, helping Silla crush Paik-je.\n\nLiterature was not neglected. The history of the dynasty is marked by a great revival of the Confucian cult, a complete and accurate edition of all the classics being published. We are told that a school system was inaugurated and learning highly developed. Nationalism showed itself in a reviving interest in the past history of the peoples of the empire, and some of the most illustrious historical writers of China belong to this dynasty.\n\nIt was during the Tang dynasty that Christianity first made its appearance within the bounds of the Chinese empire. The Nestorians were permitted to settle in the land and propagate the faith, and during this dynasty they reached the zenith of their development, their converts numbering many thousands. At the same time Arab traders obtained a footing, introducing to the East the commerce and science of Europe and bringing the two continents into closer relations.\n\nThis is but an indication of some of the influences which were at work in the empire, but these few things—the widely extended conquest of foreign lands by the Tang armies, the revival of Confucianism and the resultant renaissance in literature, the spread of Christianity, and the inauguration of commerce with Europe—all united to give currency to new ideas and to force the nation to higher levels of civilization. What a change for a barbarian lad like Ch'oe, thus suddenly transported from his own land—which was no larger than an ordinary prefecture of China, where all was stagnation and gloom with no signs of new life,—to such an immense theatre as the capital of China and to be thrust out into the current of such a forceful life as then prevailed there.\n\nYoung Ch'oe took his departure for China in the year 870. It is probable he took boat from one of the ancient ports on the southern end of the peninsula, either Fusan or Kimha, or he may have crossed the mountains into the territory of Paik je—for that land now belonged to Silla—and found passage in one of the many trading junks that frequented Kun-san. From here he would secure a quick passage across the\nuneasy Yellow Sea to the Land of Tang. He may have gone in the train of some embassy from Silla to Tang, or, which is the more likely, he went as the protégé of some Tang ambassador to Silla, who, at the instance of the father, had assumed charge of the lad. Be this as it may, his subsequent career would indicate that his introduction to Tang must have been under very favourable auspices, for honours came thick and fast upon him.\n\nFrom the accounts of his life it seems clear that young Ch'oe from the very first, spent his life in the Tang capital at Chang-an (長安) or Si-ngan (西安). Situated in Shensi, in the far interior, it is probably the most interesting city historically in China. Located near one of the branches of the Yellow River, Ch'oe's party would probably reach it only after many weary weeks of travel in a junk. The following description of the city in modern times is of considerable interest:\n\nThe city of Si-ngan is the capital of the north-west of China and next to Peking in size, population and importance. It surpasses that city in historical interest and records, and in the long centuries of its existence has upheld its earlier name of Chang-an or \"Continuous Peace.\" The approach to it from the east lies across a bluff whose eastern face is filled with houses cut in the dry earth, and from whose summit the lofty towers and imposing walls are seen across the plain three miles away. These defences were too solid for the Mohammedan rebels, and protected the citizens while even their suburbs were burned. The population occupies the entire entente, and presents a heterogeneous sprinkling of Tibetans, Mongols and Tartars, of whom many thousand Moslems are still spared because they were loyal. Si-ngan has been taken and retaken, rebuilt and destroyed, since its establishment in the twelfth century B.C. by the Martial King but its position has always assured for it the control of the trade between the central and western provinces and Central Asia. The city itself is picturesquely situated and contains some few remains of its ancient importance, while the neighbourhood promises better returns to the sagacious antiquarian and explorer than any portion of China. The principal record of the Nestorian mission work in China, the famous tablet of A.D. 781 still remains in the yard of a temple. Some miles to the north-west lies the temple Ta-fu-sz, containing a notable colossus of Buddha, the largest in China, said to have been cut by one of the emperors of the Tang in the ninth century.\nThis statue is in a cave hewn out of the sandstone rock, being cut out of the same material and left in the construction of the grotto. Its height is 56 ft. The proportions of limbs and body of the sitting figure are, on the whole, good, the Buddha being represented with right hand upraised in blessing and the figure as well as garments richly covered with color and gilt.*\n\nInto this wonderful city the young Korean lad was introduced, and the effect on him could not have been very different from that which would be the case in any boy in modern times. It is certain that he gave himself up to study, and the time limit set by his father, with the heavy penalty attached, proved an effective spur. That he improved his opportunities is clear from the extended and valuable character of the literary remains which have come down to us and which date from the years he spent in China. He developed into a thorough Tangite. Removed from Korea and the Korean environment in the tender years of childhood, his character was formed by the educative forces of China. Such time as he could spare from his studies was spent in taking in the marvellous scenes about him. He became thoroughly saturated with Confucian philosophy. He saw Buddhism in a new light. It may be that some account penned by him to his father in Korea describing the Buddhist cave at Si-ugan and its colossus of Gautama may have been the inspiration from whence came Korea's colossal Buddha at Eun-jin. He must often have stood in the presence of the Nestorian Tablet and read its testimony to monotheistic belief and Christian ethics. How powerful all these forces must have been in his character. To his mind the Chinese Court at Chang-an must have been, when compared with Korea, a veritable fairy land. Thus as years passed the Korean hills and the Korean life faded far away into the dim recesses of memory. But though we call this education, it was at the same time also a foreignizing process which must have changed the Korean into a thoroughgoing Chinese. And in this may possibly be the secret of his failure to inspire his countrymen with confidence when he returned to them a comparatively young man.\n\nCh'oe took his degree of Doctor at the Civil Service Examinations in 875, after six years of faithful study and when\n\n*William's Middle Kingdom. Vol. 1, p. 150.\nbut eighteen years of age. As we look back over his career it is evident that this was a crisis in his life. Had he then returned to Silla, as was the original intention of his father in sending him to Tang, and applied himself to the solution of some of the problems of his native country, he might have rivalled and even eclipsed the fame of that other young Korean with whom we compared him at the beginning of this sketch. It might have fallen to Ch'oe to set up a strong government, to guide the weak monarchs of Silla along the path of successful administration, or, failing in this, it might have been his fortune, rather than Wang-güu's, to create out of the ruins of Silla a new and more glorious kingdom. But the opportunities were too great, and the call to remain in Tang too loud for him to turn back to Silla. He elected to remain in China.\n\nThe Emperor Hi-tsung (僖宗) had ascended the Dragon Throne the year previously [874-888] and with this Emperor Ch'oe became a great favourite. It is possible they had grown up together as students. The Emperor immediately bestowed on the young Korean a Court appointment—that of Si-usa (侍御史) a kind of special commissioner in the palace. This was followed shortly afterward by the appointment as Na-kong-pong (內供奉) or Imperial Court Chamberlain. Surely it was a remarkable achievement for a young Korean to rise in six years to be the Court favourite of the all-powerful Emperor of China. Certainly some unusual influence must have been back of Ch'oe to secure him these high posts in the Tang Court, yet there must have been much bitterness mingled with the cup of his joys, for the Emperor's career was an ill-starred and disastrous one.*\n\nFor some years China had been in a very depressed and unsettled condition. Floods had prevailed in certain sections and brought widespread ruin. Other regions had suffered from terrible drought and the people were in a pitiable condition. As is usually the case in such times, robbers and brigands rose everywhere and inaugurated a reign of terror. Widespread brigandage gradually developed into organized insurrection, the leader in rebellion being one Wang-sien. He died in 878, but was succeeded by a more capable leader named\n\n*Vide Macgowan's History of China, p. 335.\nWhang-ch'an (黃粲). Raising his standard in the south, he besieged and reduced in rapid succession Canton and the principal cities of Hu-kwang and Kiang-si. He broke the imperial power and defeated and scattered the imperial armies everywhere. There was nothing to stay his terrible march north and in a short time Whang-ch'an was in possession of the two imperial cities of Lo-yang and Si-ngan. The Emperor barely escaped from Chang-an with his life. He was accompanied in his flight by his faithful Korean minister Ch'oé, who never deserted him. In securing possession of Chang-an (Si-ngan), the rebel Whang-ch'an proclaimed himself emperor and ascended the dragon throne of the Tangs with the dynastic title of the Great Tsi.\n\nThe usurper was not destined to reign long. The Tang emperor fleeing for his life from his blood-thirsty foe issued an appeal to the loyal people of the country. And while the pseudo-emperor Whang-ch'an in Chang-an was beheading all relatives of the imperial House of Tang, and flooding the streets of the capital with the blood of inoffensive people, the movement which was to overthrow him was slowly getting under way. And in this movement our Korean Ch'oé Ch'i-wun was playing a most honourable part. Among those who responded to the fugitive emperor's appeal was Li Keh-yung, chief of the Sha-to tribe of Turkomans who lived near Lake Balkash. He was very old and very famous, but the snows of many winters had failed to dampen the fire of his warlike heart. Over thirty years previously he had rendered important service against the Tibetans, for which he had been rewarded by the House of Tang with permission to assume the honourable family name of Yi (Li). He now hastened to the succour of the unfortunate Hi-tsung, coming at the head of 40,000 of his tribesmen. They wore a black costume and were very savage in warfare, which won for them the title of \"Black Crows.\"\n\nIn the campaign which the Black Crows undertook against Whang-ch'an, Ch'oé Ch'i-wun served with distinction, acting as adjutant-general to their chief. In fact it is said that from his fertile brain emanated the plans which shattered the rebel power and restored to the Tang emperor the heritage he had almost lost. Legend of course has not lost the oppor-\ntunity to cast a halo around the exploits of the Korean in this connection. It is said that when Chang-an was attacked by the Black Crows, Ch'oe Ch'i-wun addressed a letter to the usurper within its walls, couched in such terrible terms that as he read it he unconsciously crept down from his seat and crouched like a terrified beast on the floor! The power of the rebel was destroyed and he met his fate at the hands of his nephew, who slew him in order to curry favour with the House of Tang. We have thus gone fully into the course of this rebellion because it is reputed to have been the most terrible ever known to Chinese annals. It lasted for five years, 880-884. Popular tradition says that in its course no less than 8,000,000 lives were lost. And though we may reject this number as preposterous, still the terrible loss of life during the Taiping rebellion indicates how enormous may be the destruction wrought by warfare in a populous region like South and Central China.\n\nRestored to his throne the Emperor Hi-tsong took up his residence in Chang-an. The rewards which fell to his faithful Korean vassal must have been of a high and honourable character. Among other things he was made Vice-President of the Board of War. Thus this Korean lad who had come from the hills of Kyeng-sang walked the courts of Tang, a man whose word swayed the destiny of millions. Surely history offers very few careers more strange and marvellous than that of Ch'oe Ch'i-wun. For a short time Ch'oe enjoyed his honours in China. Amid the busy cares of state he found time to write some treatises. Determining to return to Korea in 886, the Court of Tang conferred upon him the rank of ambassador and commissioned him as Imperial Envoy in the peninsula. He was then but twenty-eight years old, according to Korean count.\n\nThe native biographies describe Ch'oe as returning to his native land with high purposes and plans in her behalf. He believed that the prestige of his achievements in China and the imperial authority with which he was clothed would secure for him a paramount influence in Silla and enable him to institute reforms and bring order out of confusion. He was doomed to disappointment, and it proved particularly galling to his imperious nature. But Silla's sad plight was\nbeyond his power to amend. He only met with opposition and unfriendliness.\n\nKing Heun-gang (憲康) was on the throne—a man to whom music and dancing were more congenial than the responsibilities of state. In the Court the king's sister Man (曼) held sway, leading a dissolute life. Ch'oé was given an appointment, but hatred and jealousy were his reward. It is said that King Heun-gang returning from one of his pleasure excursions met a freak of a human being at a sea-port. This freak could sing and dance, so he became a great favourite of the king's. Later four other \"freaks\" suddenly appeared in the road before the royal cart in which the king was proceeding on a pleasure jaunt. They are described as hideous in appearance and repulsive to look upon. They danced, singing a ballad the refrain of which was\n\nChi-ri ta-do\nTo-p'a, To-p'a.\n\nThe king failed to note the prophetic warning contained in these words, which declared the overthrow of his capital To-p'a. While men of this character who could pander to the king's whims were installed in the king's presence, a statesman and a scholar like Ch'oé Ch'i-wun was driven by royal indifference and neglect or even hostility into exile.\n\nSilla had already sunk too low ever to rise again. Insurrection was rife in the provinces. The power of the royal government over the outlying clans, ever light, had really been destroyed, and adventurers were rising throughout the land spreading terror and confusion. Among the factors creating disorder in the land and bringing ruin on Silla, one of the chief was an outcast offspring of the king, named Kung-ye, whose deeds of violence and cruelty were of a most atrocious nature. Many circumstances thus united to render futile the career of Ch'oé on his return to Silla. The death of his imperial patron Hi-tsung in 888, shortly after his return to Silla, must have, in view of the intimate bond between them, sent Ch'oé into retirement for a time. The scandalous immorality of the Court, dominated as it was by the effronteries of the lascivious Princess Man, and the terrible disorder and confusion abroad in the land, made it impossible for a man like Ch'oé to obtain a hearing.\nHardly any notices exist of his public acts. Once it is said he appealed to Tang to aid Silla to put down the internal insurrections from which she was suffering. Then again during the reign of Princess Man he addressed a memorial containing ten suggestions for the conduct of state affairs. These met with the same treatment that Korean royalty had ever accorded him, polite courtesy and indifference, veiled in terms of royal gratitude and inaction, more deadly to a patriotic soul than out-spoken antagonism.\n\nTherefore, in all the accounts which we have of Ch'oé's life after his return to Silla, he comes before us as the scholar and recluse. It is said that \"he buried his surpassing talents amid the mountain cemeteries.\" He retired to his ancestral home at Kaya-san, and there gave himself up to literary pursuits, being confessedly the most learned and finished scholar of his times.\n\nThis was the period of his literary activity. He was an essayist, poet and historian, and his pen being a diligent one he must have produced many works which are lost to us. From the scattered notices contained in Maurice Courant's monumental Bibliographie Coréenne we have collected the following notes.\n\n(1) Poems. The Odes of Remarkable Litterateurs. The Hyun Sip-ch'o si (賢十抄詩) contains a selection of Ch'oé Chi-wün's poems. This work, compiled about 900 years ago, contained odes from those poets who took precedence in the first rank. Ten examples are given from each writer. This would indicate that Ch'oé was a poet of more than ordinary merit. Our knowledge of this work is derived from the Tai-tong-un-ko (大東韻考), no copy having came down to us. Of the poets thus preserved six were litterateurs of Tang and only four were Koreans, viz.: Ch'oé Chi-wün, Pak In-pom (朴仁範) Ch'oé Söng-a (崔承祐) and Ch'oé Kwang-yu (崔匡裕). These men were all educated in China, the last three having probably been influenced to that course by the example of Ch'oé Chi-wün.\n\nCh'oé Chi-wün also presented on his return from China in 886, to King Heun-gang, a copy of his poetical works in three volumes. These have disappeared.\n\n(2) The Chung-san-pu-Koué-jip (中山獲寶集). This was\na work of five volumes written while in China, which we only know about incidentally as part of his writings presented by Ch'oe in 886 to the King of Silla. As it is lost to us we have no means of ascertaining its character.\n\n(3) The *Silla Su i-jun* (新羅殊異傳). Narratives of the wonders of Silla. The character of the work can be gathered from its title. It is cited by the *Tai-tong-un-ko*, but I know of no existing copy. This is to be regretted, as it would be of great value to the student of archaeology.\n\n(4) The *Ch'oe Chi-i-wun Mun-jip* (崔致遠文集). The collected work of Ch'oe Chi-i-wan. This was the collection preserved by his family, but has become scattered and some of the works have been lost. We owe our knowledge of it to the *Tai-tong-un-ko*.\n\n(5) The *Che-wuang-yun Tai-ryak*. (帝王年代畧) The Chronicles of Emperors and Kings. This was a work on General History, and though lost to us, it is mentioned in the *Tai-tong un-ko*, and fragments of it may be recovered from such historical works as the *Yul-yo-geni-sul* (燃藜記述).\n\n(6) The *Kei-wun-p'il-kyung-jip* (桂苑筆耕集). This title may be translated The Furrows of a Chinese Pen in a Garden of Cinnamon Trees. It extends to twenty volumes and makes up the collection of twenty-eight volumes (the other two being his poems and the *Chung-san-pu-che-jip*) which Ch'oe presented to King Heun-gong in 886 on his arrival as Tang ambassador at the court of Silla. This work has survived the ravages of time and has been preserved to us. We are indebted to an old patrician family, named Hong, of Seoul, for a modern edition of it. Hong Suk-ju, who rose to the post of Prime Minister of the Left, caused a copy of the \"Furrows\" to be printed in 1834. From the preface we learn that Hong also tried to secure a copy of the *Chung-san pu*, to publish it at the same time but was unable to find any trace of it. The edition of the Furrows was based on a manuscript copy which had been preserved in the Hong family for centuries. It consists of reports, letters, and various other documents, official and private, of Ch'oe and is of great value as the testimony of a keen eye witness of the events of his times. A copy of the 1834 edition is found in the Bibliothèque de l'École des Langues Orientales Vivantes at Paris.\nThe romantic career of Ch'oé Ch'i-wŭn, rivalling as it does the fancies of fiction, prepares us for his end, for he disappears from our view not into history but into legend. The common belief is that after his retirement into Ka-ya-san he gave himself up to the pleasures of literature and music. His days were spent in literary delights with a few kindred spirits. He was an accomplished player on the Ku-mun-go or Seven-Stringed Lute, and this instrument plays a large part in the legends of his hermit life. Legend, however, takes its wildest flight in asserting that he secured the Magic Jade Flute of Silla. Upon this he played until the powers of death and dissolution were charmed and compelled to halt at the threshold of his mountain retreat and to respect the sacredness of his person. It is thus said that he never died but was transformed into a spirit and disappeared into the blue ether above, taking with him the Magic Flute of Jade.\n\nHe secured a prominence in Korean literary life which can never be taken from him. His predecessor, Sŭl-ch'ong, left so few literary remains that collections of early Korean literature begin with Ch'oé rather than with Sŭl-ch'ong. Thus the great Tong-mun-sun (東文選), Selections from Korean Compositions (54 vols.), compiled by Su-gu-chung (徐居正) in 1478, begins Korean literature really with Ch'oé. This was also the case with an earlier work of similar character by Ch'oé-hai, called the Tong-in-mun (東人文) which begins Korean literature with Ch'oé. The fact that these collections of Korean literature begin with Ch'oé Ch'i-wŭn would seem to confirm the tradition that he was the first Korean writer to produce books in the Chinese characters, a tradition, however, which we are hardly prepared to accept. But an examination of his works certainly introduces us very nearly to the fountain head of Korean literature.\n\nWe must close our sketch with a legend. Kung-ye (弓裔), the one-eyed monster who had been spawned by King Heni-gang, after a career of blood and rapine in which he had alienated all followers by his acts of atrocious cruelty, was approaching his fall. Among his officers the greatest in fame and best beloved because of his courage and generosity was Wang-gŭn, the \"man child of Song-ak.\" Gradually the\nhopes of the people began to centre around Wang-gun and it was felt that he was undoubtedly the Man of Destiny for Korea. The prophetic eye of Ch'oe Ch'i-wun fell upon the rising general and from his retreat in Ka-ya-san he sent to Wang-gun one of those literary enigmas which pass for inspired utterances among Asiatic peoples. It was a stanza of two lines as follows:\n\n곡계 鶏 雞\n령림 鳳 林\n청황 青 黃\n송영 松 葉\n\nTranslated freely this means \"The leaves of the Cock Forest are sear and yellow. But the pines on the Snow Goose Pass are fresh and green.\"\n\nThis is a poetical metaphor which on the face of it by a flight of fancy is easily translated. Ke-riun (Cock Forest) is the ancient poetical name of Silla. That its leaves are sear and yellow means that the time of its decay and death has arrived. Kok-yung (Snow-Goose Pass) was the ancestral home of Wang, and the freshness and vigour of its pines indicate the prosperity of the young general.\n\nAmong Ch'oe's descendants have been many litterateurs, some of them rising to high distinction. It was in the year A.D. 1021 that Hyun-chong, eighth monarch of the Korea dynasty, immortalized the memory of Ch'oe by decreeing him a place in the Confucian Temple with the title Marquis Mun-ch'ang.\nThe Culture and Preparation of Ginseng in Korea.\n\nBy Rev. C. T. Collyer.\n\nGinseng is the generic name applied to the several varieties of the plant known to the Chinese as Jen-sêng (人蔘 or 人參), of which indeed it is a rough and ready reproduction. It is interesting to note that as Westerners call the plant by its Chinese name so they know it to be of value only as it is prized by the Celestials.\n\nIn Korea it is known as Sam (상), which is the native pronunciation of the Chinese 蔘. Not to speak of sub-divisions, the following varieties are generally recognized by Korean growers:\n\n1. 一山蔘 (산삼) Wild Sam, literally Mountain Sam. It is this wild ginseng of which we hear such fabulous stories and which is valued at such an extraordinary figure. It stands to reason that there is practically none of it or else the whole population would be out on the hunt. If a grower finds an unusually large root among his crop he often dries it privately and palms it off as having been found in some deep mountain ravine.\n\n2. 一龍蔘 (령삼), Ryeng Sam, which comes from Kyeng-sang Do (경상도). Its characteristic is that in body it is smaller than that grown in Song-do. It is merely sun-dried and is said to be a very powerful drug. It is but seldom exported, being highly valued by the Koreans, who will pay $12.00, Korean currency, per pound.\n\n3. 一江直蔘 (강직삼) Kang Chik Sam comes from the province of Kang wun (강원) and is graded as second to the above. In appearance it is so like the Song Sam that it cannot be told apart by the uninitiated. Its difference is that it weighs more and is less powerful than No. 2.\n4. 一松参 (송삼) *Song Sam* is that grown in Song-do and only sun-dried. Its distinction is that it is less powerful than either of the above, for which reason it is graded commercially as No. 3.\n\n5. 紅参 (홍삼) *Hong Sam* (Red Sam) is the last above mentioned variety after it has passed through the Government's drying establishment in Song-do. It forms the principal export of this country, and is one of the most valuable assets of the Household Department.\n\nOf these five varieties but two are recognized by the Royal Korean Customs, those known respectively as \"White\" and \"Red\" Ginseng. The \"White Ginseng\" is the root that has been sun-dried or cured by some other simple process—the same as that shipped from America to China. The figures for 1898 published by the Bureau of Statistics of the United States Treasury Department show that the trade in the States is by no means a small one, 174,063 pounds having been exported, valued at $836,446.00 or an average of $4.80 per pound. In the same year 1,866 pounds were shipped from Korea at the average value of Yen 2.21 per pound. The export of this \"White Ginseng\" is decreasing all the time, for all roots that will pass muster bring a much bigger return if converted into \"Red Ginseng.\" The figures for Hong Sam (Red Ginseng) for that same year (1898) show that 60,104 lbs. were shipped to China from Chemulpo, valued by the Customs at an average of Yen 15.87 per pound. From these figures it will be seen that when the root has been put through the process that is hereinafter described it is two and one-seventh times more valuable than the American product.\n\nThat the trade really is an important one will be best gathered from the following figures which have been kindly furnished by the Customs authorities:—\n### Statistics of Export of Ginseng from Korea\n\n| Year | White—Whole & Beard | Red—Whole & Beard |\n|------|---------------------|-------------------|\n|      | Weight in Piculs    | Value in Yen      | Weight in Catties | Value in Yen |\n| 1892 | 210                 | 22,637            | —                | —             |\n| 1893 | 110                 | 9,495             | —                | —             |\n| 1894 | 112                 | 11,371            | —                | —             |\n| 1895 | 53                  | 5,310             | —                | —             |\n| 1896 | 7                   | 5,694             | 16,686           | 268,054       |\n| 1897 | 4                   | 3,066             | 33,937           | 629,375       |\n| 1898 | 14                  | 842               | 45,087           | 954,007       |\n| 1899 | 11                  | 594               | 23,178           | 379,376       |\n| 1900 | 10                  | 726               | 60,310           | 1,547,400     |\n| 1901 | 12                  | 1,188             | 18,431           | 515,955       |\n| Total| 644                 | 60,863            | 196,729          | 4,294,177     |\n\nFor the six years (1896-1901) the average value per catty of \"Red\" was Yen 21.83 and of \"White\" Yen 0.76.\n\nThese figures hardly give one a true idea of the value, for \"Beard\" is of very much lower price than \"Whole.\"\n\nIt might be mentioned that much difficulty has been experienced in getting reliable information about the cultivation of ginseng. While the growers are too polite not to talk readily to one, yet on subsequent investigation I have often found that I had been misinformed.\n\nBefore a garden, locally known as a Sam-po, is ready for its first planting of Sam, extensive preparations are necessary. In the early winter thousands of loads of a variety of disintegrated granite known as Whang-t'o (황토 황토) and also of Yak-to (약토 약토) are carried to the Sam-po and heaped up in separate mounds. This 약토 (medicine earth) is a moderately rich mulch made from the leaves of the chestnut oak (Quercus Sinensis), known to the Koreans as the Sang (橡—도토리상).\nThe leaves are gathered in the spring and summer, dried in the sun, pulverized and sprinkled with water to help decomposition. This mulch is the only fertilizer used. The Koreans say that one of the secrets of successful cultivation lies in its use. Experiments have been made with other fertilizers, but none has been found that will take its place.\n\nBefore the season opens much time is spent in preparing the frames and mats used for the sheds under which the Sam is grown. As soon as the frost is out of the ground the garden is ploughed up and thoroughly worked over with a spade operated by a gang of five or more men. The spade is made of wood, has an iron shoe or tip, and a handle eight to ten feet long, to the butt of which are fastened two straw ropes. The captain, as we might call him, manipulates the handle while each half of the crew gives its undivided attention to a rope. Then with \"a long pull, a strong pull, and a pull altogether\" an amazingly small quantity of dirt is thrown a distance of two feet or so. After the beds have been made high enough to prevent the possibility of water, even in the rainy season, getting to the roots of the plants, they are dug out to the depth of about six inches and carefully edged with slabs of slate.\n\nIn the meantime the artificial soil (mom hnk 몸흙) has been prepared. It consists of 15 bushels mulch (약토) and 22½ bushels disintegrated granite (황토) to the kan*—during the last few years some of the big growers have been using ½ bushel of wood ashes mixed with the above—these are rubbed together by hand, and with it the dug-out is filled up.\n\nSam is propagated from seed. As in other branches of the culture, the Koreans pay much attention to the seed. Four-year-old plants, if forward, will flower in the sixth moon (July); should the plants not be sufficiently forward the leaves are nipped off to prevent them flowering. Seed is also borne by five and six-year-old plants; that of the old plants is considered the best. Each year at the chinng-pok (中伏 중복)† the seed is gathered and placed in grass cloth bags, which are held in running water and violently shaken to remove the red husks. The seed, which is a cream white, is then scattered on a sunk bed of sand dug up from the bottom of a stream; a thick covering of sand is spread over the seed and they are watered\n\n*5½ feet. †The second day of the midsummer festival, 26 July.\nevery day until the yip-tong (立冬 립동).* This seed-bed occupies a conspicuous position in the end of the garden nearest the house; it has a plank frame and is covered with a lath screen. As it is of great importance to shield the seed from the early frosts, straw thatch is piled over the cover of the bed every night. On the 립동 the seed is dug up and sorted. Those seeds which have commenced to germinate are packed with sand in jars and buried in a shady place for the winter.\n\nOne of the busiest times of the year is when the seed is sown, crowds of coolies being employed to make up the beds, &c. When the bed has been properly prepared six or eight boys in charge of a man are set to work sowing the seed; they are preceded by a man who marks off the bed with an ingenious tool three feet long with half inch pegs at one inch intervals, the boys then come along and drop a seed in each hole, which is afterwards covered up by the man in charge who presses the soil down with his hands. It should be noted that 62 or 63 rows are sown to each kan. If at the time of sowing—which by the way is regulated by the calendar and not by the weather—it is at all cold the beds are immediately covered with one or two thicknesses of rice-straw thatch. If the weather is at all suitable the thatch is removed at the time of the Ch'ung-myung (清明 청명)† and the sheds erected. It is quite a relief to see anything done with exactness and precision in Korea. Great care is taken in measuring the beds—which must face N.N.E. ¾ E.—and in erecting the sheds with exact uniformity. The rows of pillars are three feet apart; those in the front row measure just three feet seven from the ground and those in the back but ten inches. The pillars are set five-and-a-half feet apart and are nearly all spruce pine. Bamboo poles are securely lashed to the pillars and they in their turn support the cross pieces on which the roof of the shed rests. The roof is made of reeds woven together with straw rope.\n\nFrom this time on the plants require incessant care, several men being kept busy in each garden. If the plants break through the earth by the Kok-n (穀雨 곡우)‡ they must be watered every three or four days; if the weather at the Ip-ha (立夏 립하)§ is getting gradually warmer they are\n\n*November 8. †April 4. ‡May 6. §April 21.\nwatered twice in twenty-four hours and the top mat is rolled up from off the roof during the middle of the day. The calendar being unable to regulate the amount of water necessary it is a rule:— \"If there is drought, give water plentifully; if there is plenty of rain, give but little water. Let dryness and dampness harmonize!\" At the time of the summer solstice the rainy season may be expected, so a thick covering of thatch is spread over the sheds, while the back and front are enclosed by rush blinds.\n\nA native writer says:—\n\n\"The nature of Sam is different from that of other plants. It does not require much water nor should it be too dry. It likes light. Because it does not want too much dryness, the beds must be made wide and covered with mats to shade off the extreme light. If the soil (呂壽) in which it is planted is dry, give water and draw down the shades; if it is too moist, open the shades and let in the light. Rain and dew must not be allowed to fall upon it, but it must be watered as though it rained. The covering of the beds is not to keep out the wind and the sunshine, but to give the effect of a cloudy day. Following upon cold, if the ground be dry or damp, shade or light must be given, and if watered special care must be taken to avoid chilling the plants. When the atmosphere is warm or cold much shade or sunshine must not be allowed for either extreme is unsuited to the nature of the plant.\"\n\nSeveral references having been made to the watering of the plants, it may not be without its interest to pause and watch the operation. There is a well in or near every garden, from which water is lifted by means of a sweep. As far as we are aware, this is the only appliance in extensive use in Korea for lifting well water, but it is only used locally in the Sam gardens. The bucket itself is a combination of the Occidental and the Oriental. It is made of a strip of kerosene tin nailed on to semi-circular pieces of wood, which in their turn are nailed to a cross piece into which an upright handle is morticed. The rope of the sweep is fastened to this handle by means of a wire loop pulled off an oil can. The water when raised is emptied into an earthenware crock which is securely tied to a frame mounted on four crude wheels; this is drawn round the garden and between the beds and from it the water is dipped out in a gourd fastened to a long handle. This gourd is per-\nforated and in each perforation is inserted a small bamboo spout which gives the \"rainy effect\" that is so much desired.\n\nIt is not until the Ip Tong (립동)* has passed that the grower is able to rest easily. Up to that day he has to be continually on the alert, waging war against insects and weeds. Then with a sigh of relief, he pulls down the sheds and having put a layer of soil some seven or eight inches thick on the beds, the garden is left thus for the winter.\n\nHis next care is to select another site to which he can move his plants in the spring. The new lot need not be as sandy as the first one, but on the other hand a heavy clay is quite unsuitable. Having selected his site, fresh whang-t'o and yak-t'o in sufficient quantities must be carried thither in readiness for the opening of the next season.\n\nAt Ch'un-pun (春分)† of the following year the new beds are made up and the plants removed from last year's garden. This time they are planted ten or twelve rows of ten roots each to the kan. The prepared soil' (토) is not of quite the same proportion and is less than last year's—8 bushels (말) mulch (약토) and nine of disintegrated granite (황토). To this also a very small quantity of wood ashes is sometimes added. The duties of this year are similar to those of last year, but there is an added care. The roots are now worth stealing, consequently the garden has to be watched day and night. A watch tower is erected and the hands take turn about in occupying it sentry-wise. Another man continually patrols the garden during the hours of darkness. With a view to scaring off the spirits and to prevent himself from feeling lonely he makes the night \"hideous\" with his cries. On dark nights a lantern is an indispensible accessory; but while any kind of lantern may be used, preference is given to one made for this special purpose as it throws its light a considerable distance. Made of paper and pasted on bamboo ribs, it is balloon-shaped, with the small end open. The handle which is fastened to the big end if pushed inwards will carry with it through the opening a swinging candlestick. It is only when the light is thrown in one's face that one realizes how brilliant it is.\n\nIn the following year, a few days after Ch'un-pun the\n\n*November 8. †March 21.\nplants are again moved. The circumstances are the same as last year, excepting that they are planted further apart, four roots to the row and eight to the kan. This is intended to be the final planting, but should the root not thrive it is moved to yet another location as soon as possible.\n\nHere should be noted a special point in Ginseng culture, one which is held as a close secret. Each time the roots are transplanted they are placed in the ground almost horizontally, slanting slightly downwards. The reasons for not planting them vertically are: (1) That water may be applied evenly to the whole root; (2) To prevent the roots from dividing and spreading into fine rootlets, sometimes known as \"beard,\" and (3) That they may be readily inspected. Where the roots are so subject to blight it is a matter of great importance to be able to inspect them without disturbance.\n\nLike so many other plants Sam has its special blight, the consideration of which must be left for a future paper.\n\nWhen the plant is five, six or seven years old, according to circumstances and to grade, the root is dug up and handed over to the Government. Work at the Drying Establishment is carried on from the 10th of the Eighth Moon (September 11) to the 20th of the Ninth Moon (October 21) and the roots have to be delivered during that period.\n\nThe law requires every Ginseng garden to be registered. The certificate of registration, for which a fee of 40 cents is charged, states how many kan are under cultivation, so that the authorities always know how many roots should be available at harvest time. It being obligatory to sell the entire crop to the Government, the grower's responsibility ceases when he has delivered his crop to the Government's Drying Establishment (圃所). He there receives a receipt for what has been brought in, but has to possess his soul in patience for several months until the Government is ready to pay—when he gets anything from $6.00 to $9.00 per catty of 20 oz.\n\nAs to the profitableness of Sam growing. As an investment, of course, something large would naturally be expected when one has to wait from five to seven years for a return. From the best—though it can hardly be considered absolutely reliable—information to hand I gather that a profit of about 60 per cent is generally made on the original outlay and ruu-\nning expenses. It is with some hesitancy that this figure is stated and it is given for what it is worth.\n\nUpon visiting the Drying Establishment the first thing that impresses itself upon one's mind is the inaccessibility of the place, both with regard to the streets leading to it and to the guard placed at its gate. As at the emperor's palace so here the guard is no respector of persons. Until two or three years ago this establishment and the entire industry of Ginseng culture was under the supervision of the Song-do governor. There is now a specially appointed official, known as the Sam Sung Kwa Chang (三省課長 삼성과장). That this gentleman is held personally responsible for the stock is proved by the fact that he has recently had to pay a very large sum out of his own pocket for Ginseng that has more or less mysteriously found its way into other hands than those of the government.\n\nPassing the guards, parts of whose uniform are usually conspicuous by their absence but of whom it must be said that whatever else may be forgotten the ominous bavonet is always in evidence, one finds himself in a twelve feet wide road running east and west and, for a considerable distance, with high walls on either side. Opening to the north and south are the gates leading into the twin compounds, each of which is in charge of a Chu Sa (主事 주사) resident on the premises while the curing process is in operation. Each section of the P'o Sa (포사) is about four acres in extent and is so much like the others that it is only necessary to refer to one of them. On three sides of the compound are buildings varying from 100 to 150 feet in length and of a uniform depth of 12 feet. One of these buildings is used as quarters for the workmen, the others are the drying rooms in which the root is stored every night. These drying rooms are divided into sections and called respectively \"First Heaven,\" \"Second Heaven,\" \"Third Heaven,\" \"First Earth,\" \"Second Earth\" and \"Third Earth.\" Every tray is labelled according to the room from which it is taken. On the fourth side are the steaming shed and the various storerooms. Except for the buildings, almost the entire space of the enclosure is covered with three-feet-high bamboo platforms, on which the trays are exposed to the sun. Near the centre of each compound, under the shade of some very ancient yew trees, is the well, at the mouth of which the roots are washed as\nsoon as received. Year after year the same boys and men, to the number of 140, are employed in the drying house. They are well fed and housed; during the forty days that the drying process is in operation not one of them is allowed to go out of the gate without a special permit from the chun sa in charge, and even then he is searched by the guard.\n\nIt is a busy time when the freshly dug up roots are carried to the drying house. They are carefully counted and weighed on a scale-beam suspended from a specially erected structure; receipts for the number of roots and their weight are given to the growers.\n\nIt is interesting to note that during the process through which the root will have to go it loses just two-thirds of its weight. The process commences with a thorough washing by hand at the well mouth. The root is then handed over to men who carefully brush it with human-hair brushes: it is important that no speck of dirt be left between the rootlets. They are then packed in baskets (동우리), two feet in diameter and six inches in depth, with a handle at either side for convenience of lifting. These are placed in pairs in an earthenware steamer. The steamers are four feet in diameter and one and a half deep; they have holes in the bottom to admit the steam from the iron boiler below. When ready to commence the process of steaming three gallons of water are poured into the five-gallon boiler, the steamer placed on top and the joint made tight by a pad of grass-cloth. The steamer in its turn is covered with a lid placed on a paper pad held down by six or eight tiles tied together with straw rope. I am told that the object of the padding is to prevent any steam from escaping, though observation has shown me that a large quantity fortunately does escape. There are two places in which the steaming is done. Each has four fire-places in a row; the boilers are placed in the masonry just as the rice pot in every Korean house, the whole covered in by a straw shed. Pine wood only is burnt. It is a matter of great importance that there should be enough, without too much fire; the same men are employed year after year to do nothing but attend to this part of the business. The duration of steaming is determined by the burning of a torch made of the fibre and bark of the locust tree (R Pseudacacia.) For\nseven-year old roots, $4\\frac{1}{2}$ inches are burnt; for six-year old, $3\\frac{1}{2}$ inches, and for five-years old, $2\\frac{3}{4}$ inches. While the torch is burning it is placed in an earthenware vessel covered with a cloth. One day I suggested it would be easier to time the steaming by a watch and was told that easier it might be but certainly not as reliable. Just as soon as the torch is burnt out the fire has to be drawn; the baskets are lifted out of the steamer and the roots placed thirty each on wicker trays and exposed to the sun. When the roots stop steaming they are turned over and left in the sun a little while longer, then carried to the drying house.\n\nThis drying house has no floor and is so carefully built as to be air-tight; its doors are made of extra thick boards and all cracks are pasted up with stout paper. Shelves, or racks, of bamboo are placed all round the house and on these are the trays containing the roots. Three shallow holes are dug in the ground and huge charcoal fires lighted in them; the doors are then closed and hermetically sealed. During his absence of about half a day from the room a change takes place in the root that the Korean is quite unable to explain: the carbonic oxide liberated from the charcoal acts upon some property of the root producing a chemical change in colour and touch. We thus see that those books on chemistry which state that \"Carbonic oxide is not put to any use in the arts and manufactures\" are mistaken. When the Sam is taken out of the drying house its \"body\" is red, and just so hard that it will not yield to the touch: the rootlets are then cut off diagonally with a pair of scissors. For about ten days the roots are exposed to the sun until they become \"as hard as stone,\" when with a small knife the root-stock is scraped and if on the primary root there are any \"pimples,\" as the natives call them, they are carefully cut off.\n\nWe have now reached the last item in the process and it certainly shows that the Koreans are ingenious about some things. The roots are now so hard and brittle that they will break if let drop on the floor, so it would be almost impossible to pack them without injury. A foreigner would get a lot of excelsior or cotton to protect that which had cost him so much labour, but not so the Korean. He simply puts the roots\nin a hamper, which he places on the earthen floor of a damp store-room. In a short while the roots soften; they are then removed to a room with a heated stone floor and spread out covered with sheets of oil paper, being thus left until they are so soft that they yield to the touch. They can now be easily packed in paper bags and pressed into pine-wood boxes without fear of injury. After being packed they again harden, becoming adjusted to the shape of the box.\n\nEach box is supposed to contain five catties. It is fastened with bamboo nails and wrapped first in common stout paper and then in oil-paper. Eight boxes go to the hamper, which is made of locust-tree withes papered within and without. They are then enclosed in a grass-cloth bag tightly bound with hemp-rope and labelled, and are then ready for the market.\n\nThe virtue of Sam as a drug lies in its aphrodisiacal property. I believe that it does not find a place in Western pharmacy because all legitimate medical ends can be better attained by the use of other drugs. We may look askance at it but it plays a very important part in the life of both the Korean and the Chinese gentleman. To speak in everyday terms of its use in Korea, and quoting a native doctor, the drug made from white Ginseng is used only by men, for it is too intense for women and children. Hong Sam is given in moderate quantities to women and children because it is supposed, being red, to promote the circulation and therefore the health.\n\nWere it not for China there would be no more trade in Ginseng than in several other native drugs of repute; hence we may well ask, \"What gives it such value in that country?\" The answer is short and simple, but whether it is a scientific fact or not I must leave to those who have both the opportunity to make investigation and the necessary technical knowledge: The Chinese say that the effect of smoking opium is to diminish the blood while Red Ginseng gives energy, strength, health and increases the flow of blood, hence it is in very high favour as a counteractive of opium. White Ginseng which does not act on the blood, if taken by an opium smoker, will cause speedy death.\nA discussion having arisen concerning the medicinal qualities of Ginseng, Mr. Gale read the following, taken from an old Chinese history:\n\nAN ANCIENT RECEIPT.\n\nTake ten ounces of ginseng, cut it into small slices, put it to infuse in twenty small porcelain vessels of spring or river water till it is thoroughly soaked and then pour the whole into a stone or silver vessel, boiling it over a gentle fire made of mulberry wood till half the water is wasted, then having strained off the juice pour ten middling porcelain vessels of water upon the gross substance and let them boil till they are reduced to five; take this juice and add five cups of water to the ten vessels which you had before strained off; boil it over a gentle fire till it comes to the consistence of an electuary (medicinal syrup) which you may close up in a proper vessel and when you make use of it dilute it with a liquor suitable to the disease you take it for.\nMINUTES OF THE ANNUAL MEETINGS.\n\nSEOUL, 20th Feb., 1901.\n\nA General Meeting was held this Afternoon at 4 o'clock in the rooms of the Seoul Union. Twenty-one members and eighteen non-members were present. The Vice-President occupied the chair, the President being unfortunately absent through sickness.\n\nIn absence of the Recording Secretary the Librarian was appointed Secretary pro tem.\n\nThe minutes having been read and approved the Corresponding Secretary announced the election of the following new members:\n\nMessrs. D. W. Deshler, Chemulpo,\nW. G. Bennett\nMin Yong Chan, Seoul,\nJ. C. Chalmers, Chemulpo,\nD. G. Owen\nW. Du F. Hutchison, Seoul.\n\nMiss L. Cooke, M.D.,\n\nThe Rev. M. N. Trollope then read a paper on \"Kang-wha.\"\n\nAt its conclusion Mr. Bunker moved \"That a vote of thanks be given to Mr. Trollope for his interesting and valuable paper.\" Dr. Scranton seconded and the motion was carried unanimously.\n\nThe Chairman, after conveying the thanks of the meeting to the essayist, opened the discussion by asking whether sacrifices were still offered upon the shrines to heroes of which Mr. Trollope had made mention. He said that hero-worship belonged to ancestor worship.\n\nMr. Scranton asked whether the altar on Mari San was an altar to heaven or to earth. It was square in form. The natives insisted that it was an altar to heaven, but Mr. Wilkinson stated that the altar to heaven was always round, and the altar to earth square.\n\nMr. Trollope replied that he believed that it was one of the places used for sacrifices for rain, &c. In that case it was an altar to heaven. He found references also to worship of the spirit of the hill.\n\nMr. Gale asked about the dolmen—what is the common story of its origin?\n\nMr. Trollope replied that the only story was a rather foolish one which connected it with the \"devil's grandmother.\"\n\nMr. Gale remarked that in England and in Europe the dolmens are usually referred to burial customs. The Korean says that they are intended to keep off the mountain influences, but never, in his experience, referred to burials. Possibly, however, that idea may not be found in Korea.\nMr. Moose stated that on the road to Wonsan, 90 li from here, there are other stones of this sort. One dolmen he measured roughly. It was six feet high, two feet thick and 21 paces in circuit. The only account he could get of them was that many hundreds of years ago the people were very strong and erected them by mere exercise of strength.\n\nThe Chairman announced that the Society was now in temporary custody of a library of some 500 volumes, the Landis Library having been put under its care, and a loan of some 200 volumes made by Mr. Kenmure.\n\nThe meeting then adjourned.\n\n---\n\nSeoul, 19th June, 1901.\n\nA General Meeting was held at 4.30 p.m. this day, at the rooms of the Seoul Union, with the President in the chair.\n\nThe Minutes of the last meeting were taken as read.\n\nThe Librarian reported for the Publication Committee that the first volume of the Society's publications would be out in about six weeks and that it would contain the papers on Chinese Influence in Korea, Korean Survivals and the Colossal Buddha at Un-jin.\n\nThe Rev. Geo. Heger Jones then read his paper on \"The Spirit Gods of Korea,\" which was listened to with marked interest.\n\nIn the discussion which followed Mr. Gale spoke of Confucianism in connection with Shamanism and pointed out that there were set days for certain observances. Mr. Kenmure spoke of the similarity between Korean and Chinese spirit worship. In answer to a question by Mr. Hulbert, Mr. Jones stated that this spirit worship is the main factor in Korean religious life to-day. Dr. Scranton spoke of the markings on beans. Mr. Gubbins spoke of the fox-worship in Japan.\n\nIn conclusion the Chairman spoke of the wide spread of these superstitious observances, the difficulties attending their investigation, the fact that mutual knowledge and comprehension is necessary to international comity. He proposed a vote of thanks to the reader of the paper.\n\n---\n\nSeoul, 27th November, 1901.\n\nA General Meeting of the Society was held to-day at the Seoul Union Reading Room at 4.15 p.m. In the absence of the President and Vice-President the Recording Secretary occupied the chair.\n\nDr. Avison nominated Prof. G. R. Frampton as Recording Secretary pro tem., the Corresponding Secretary seconded the motion, which was carried. The minutes of the last meeting were then read and approved. No other business arising the Chairman called upon the Corresponding Secretary, the Rev. J. S. Gale, to read his paper on Han-yang (Seoul). The paper was then read, being illustrated by reference to a large plan of the city.\n\nAfter the reading of this most interesting and instructive paper the Chairman threw the question open for discussion. No one seemed to be prepared to add anything to what had been said. The Chairman then\nproposed a vote of thanks to the reader of the paper, which was unani-\nmously carried.\n\nIn rising to move an adjournment Dr. Avison remarked that it was\nplain that all present had greatly enjoyed the reading of the paper.\nHe marveled at the power of observation shown by the Chinese ambas-\nsador, which enabled him even after so short a stay to give such a\ngraphic description of Seoul and he doubted whether Europeans would\nhave been so keenly observant.\n\nJ. N. Jordan, Esq., in seconding the motion for adjournment ex-\npressed the great pleasure he had received on listening to the paper.\nHe mentioned the Millenary of Alfred the Great, recently held in\nEngland and doubted whether on that event anything had been present-\ned which could equal this account of Seoul and its history. His impres-\nsion was that Korea is in much the same condition now as it was cen-\nturies ago. Speaking of the term \"Dong\" he said that it was in use in\nall parts of China not only as applied to villages but to districts, and\nfrom its use here he deduced the powerful influence China has had over\nKorea.\n\nThe meeting then adjourned.\n\n---\n\nSEOUL, Jan 3 1902.\n\nThe Annual Meeting of the Society was held this day in the\nSeoul Union Reading Room, at four o'clock in the afternoon. In the\nabsence of the President, the Vice-President occupied the chair. A quo-\nrum being present, the meeting was called to order.\n\nThe Minutes of the last general meeting were read and approved.\n\nThe Annual Report of the Council was then read by the Correspond-\ning Secretary. It was moved by Rev. J. R. Moose to adopt the report.\nThe motion prevailed.\n\nThe Treasurer read his annual report showing total receipts of Yen\n546.90 and total disbursements of Yen 288.30, leaving a balance of Yen\n258.60.\n\nThe Meeting then proceeded to the election of officers for the year,\nthe result being as follows:\n\nPresident .......... J. N. Jordan, Esq.\nVice-President .... Rev. Geo. H. Jones.\nCorresponding Secretary .... Rev. Jas. S. Gale.\nRecording Secretary .... H. B. Hulbert, Esq.\nTreasurer ............. G. Russell Frampton, Esq.\nLibrarian ............. Rev. H. G. Appenzeller.\nHon. H. N. Allen.\nH. Welpert, Dr. Jur.\nM. Collin de Plancy.\n\nAdditional Members of Council:\n\nThe chairman called for the reading of a paper on Korean Folk-tales\nby H. B. Hulbert, Esq. After the reading of this paper the subject was\nthrown open for discussion. The President, Vice-President, Correspon-\ning Secretary and others made brief remarks. The Librarian suggested a vote of thanks to the reader of the paper, which was carried.\n\nThe meeting then adjourned.\n\n---\n\n**Seoul, Dec. 17th, 1902.**\n\nA General Meeting was convened at the Seoul Union Reading Room at 4.00 p.m., with the President in the Chair. The Minutes of the last general meeting were read and approved.\n\nThe President then called upon Rev. Geo. H. Jones, Ph.D., to read the paper of the day, on Ch'oé Ch'i-wûn. At its close the subject was thrown open to the house for discussion. Brief remarks were made by the Corresponding Secretary, Recording Secretary and others.\n\nAfter an expression of thanks to the reader of the paper the meeting adjourned.\n\n---\n\n**Report of the Council.**\n\nIt is but a short report that the Council has to offer this year. One meeting was held Dec. 17th, when a paper was read by the Rev. G. H. Jones, Ph.D., on \"Ch'oé Ch'i-wûn, His life and Times.\" The meeting to-day, at which we are to have a paper by Rev. C. T. Collyer on (Ginseng) Sam, marks the close of the year.\n\nSome of the papers promised months ago are not yet forthcoming. We trust that we may have them presented before the season closes.\n\nThe Library kindly loaned by the Rev. M. N. Trollope, M.A., has had many valuable exchanges added to it during the year. It is located at the Bible Society's office and will be hereafter under the charge of Mr. Kenmure.\n\nThe list of members has been added to. We trust that the list of contributors will continue to increase likewise.\n\nIn closing this report the Council would record its sense of loss in the death of the Rev. H. G. Appenzeller, Librarian of the Society, who was drowned in the wreck of the Shoshen Kaisha Steamship \"Kumagawa\" on June the Eleventh.\nAPPENDIX.\nOFFICERS FOR 1903.\n\nPRESIDENT.\n\nJ. N. Jordan, Esq., C.M.G.\n\nVICE-PRESIDENT.\n\nRev. Geo. Heber Jones, Ph.D.\n\nHONORARY SECRETARIES.\n\nRev. J. S. Gale, B.A.\nH. B. Hulbert, A.M., F.R.G.S.\n\nHONORARY TREASURER.\n\nG. Russell Frampton, Esq.\n\nHONORARY LIBRARIAN.\n\nAlex Kenmure, Esq.\n\nCOUNCILLORS.\n\nHon. H. N. Allen.\nH. Weipert, Dr. Jur.\nM. Collin de Plancy.\nLIST OF MEMBERS.\n\nMembers are particularly requested to notify the Hon. Secretaries of any change of address or other correction to be made in this list.\n\n† Indicates a member who has contributed to the Society's transactions.\n\nHONORARY MEMBERS.\n\nAston, C.M.G., W. G.\nGriffis, D.D., Rev. Wm. E.\nRoss, D.D., Rev. John\nGubbins, C.M.G., J. H.\n\nThe Bluff, Beer, F. Devon, England,\nIthaca, N.Y., U.S.A.\nMukden, Manchuria.\nKilliemore House, Pennyghael,\nMull, Argyleshire, Scotland.\n\nORDINARY MEMBERS.\n\nAdamson, Rev. A.\nAllen, The Hon. H. N.\nAvison, M.D., O. R.\nBeck, Rev. S. A.\nBennett, Esq., W. G.\nBolljahn, Prof. F. F.\nBrinkmeier, Esq., R.\nBrown, Esq., C.M.G., J. McLeavy\nBrunn, Rev. H. M.\nBull, Rev. W. F.\nBunker, Rev. D. A.\nCable, Rev. E. M.\nCampbell, Mrs. J.\nChalmers, Esq., J. I.\nCharlesworth, F.R.G.S., H. E.\nCollin de Plancy, M.\n† Collyer, Rev. C. T.\nCooke, M.D., Miss L.\nDeshler, Esq., D. W.\nDrew, M.D., A. D.\nEngel, Rev. G.\nFellwell, M.D., Rev. E. D.\nFrampton, Esq., Prof. G. R.\nFrey, Miss L.\n† Gale, B.A., Rev. Jas. S.\nGenthe, Ph.D., S.\nHackmann, Liec., H.\nHamilton, Esq., Angus\nHardie, M.D., R. A.\nHillman, Miss M.\nHocken, M.D., F.I.S., T. M.\nHodge, Esq., J. W.\nHopkins, Esq., L. A.\n† Hulbert, A.M., F.R.G.S., H. B.\nHunt, Rev. W. B.\nIrvin, M.D., Chas.\n† Jones, Ph.D., Rev. Geo. H.\nJordan, C. M. G., J. N.\nKennure, Esq., Alex\n\nAustralian Mission, Pusan.\nU.S. Legation, Seoul\nPresbyterian Mission, Seoul.\nMethodist Mission, Seoul.\nChemulpo.\nImperial German School, Seoul\nGerman Consulate, Seoul.\nImperial Customs, Seoul.\nPresbyterian Mission, Taiku.\nPres. Mission (South) Kunsan.\nMethodist Mission, Seoul.\nMethodist Mission, Chemulpo.\nMethodist Mission (South), Seoul.\nImperial Customs, Seoul.\nEng. Ch. Mission, Newchwang.\nFrench Legation, Seoul.\nMeth. Mission (South), Song-do.\nImp. Household Dept., Seoul.\nChemulpo.\nOakland, Cal., U.S.A.\nAustralian Mission, Pusan.\nMethodist Mission, Pyeng-yang.\nImp. English School, Seoul.\nMethodist Mission, Seoul.\nPresbyterian Mission, Seoul.\nPresbyterian Mission, Seoul.\nCologne, Germany.\nHoheneggelsen, Hanover,\nGermany.\nLondon, England.\nMethodist Mission (South), Wonsan.\nMethodist Mission, Chemulpo.\nNew Zealand.\nSeoul\nImp. Customs, Mokpo.\nImp. Middle School, Seoul.\nPres. Mission, Pyeng-yang.\nPresbyterian Mission, Pusan.\nMethodist Mission, Chemulpo.\nBritish Legation, Seoul.\nBible House, Seoul.\nLIST OF MEMBERS.\n\nKrumm, C.E., Prof. Raymond\nLaporte, Esq., E.\nLuhrs, Esq., Carl\nMin Yung-chan, Gen.\nMoffett, D.D., Rev. S. A.\nMoose, Rev. J. R.\nMorgan, Esq., E.V.\nMorris, Rev. C. D.\nNoble, Ph.D., Rev. W. A.\nOtterwill, Esq., H. A.\nPaddock, Esq., Gordon\nPaine, Miss J. O.\nReid, D.D., Rev. C. F.\nRemedios, Esq., H. A. dos.\nSands, Esq., W. F.\nScranton, M.D., W.B.\nSharp, Rev. C. E.\nSidahara, Prof. S.\nSmith, Esq., J. L.\nSwearer, Rev. W. C.\nSykes, Esq., A. A.\nTakaki, Ph.D., M.\nTanaka, Esq.\nTong, Esq., C. T.\nTownsend, Esq., W. D.\n†Trollope, M.A., Rev. M. N.\nTurner, Rev. D. B.\nUnderwood, D.D., Rev. H. G.\nVinton, M.D., C.C.\nWeipert, Dr. Jur., H.\nWelbon, Rev. A. G.\nWells, M.D., J. II.\nWhittemore, Rev. N. C.\nWunsch, M.D., R.\nYamaguchi, Esq., H.\n\nBureau of Survey, Seoul.\nImp Customs, Chemulpo.\nChemulpo.\nSeoul.\nPresbyterian Mission, Pyeng Yang.\nMethodist Mission (South), Seoul.\nWashington, D.C., U.S.A.\nMethodist Mission, Pyeng-yang.\nMethodist Mission, Pyeng-yang.\nChina.\nU.S. Legation, Seoul.\nMethodist Mission, Seoul.\nNashville, Tenn., U.S.A.\nChemulpo.\nImp. Household Dept., Seoul.\nEast Hartford, Conn., U.S.A.\nPresbyterian Mission, Seoul.\nImp. Middle School, Seoul.\nBritish Legation, Seoul.\nMethodist Mission, Seoul.\nShanghai, China.\nDr. Ichi Ginko, Seoul.\nSeoul.\nChamber of Commerce, Chefoo.\nChemulpo.\nLondon, England.\nEngl. Ch. Mission, Seoul.\nPresbyterian Mission, Seoul.\nPresbyterian Mission, Seoul.\nGerman Consulate, Seoul.\nPresbyterian Mission, Seoul.\nPresbyterian Mission, Pyeng-yang.\nPresbyterian Mission, Sun Chun.\nImp. Household Dept., Seoul.\nKobe, Japan.\nCATALOGUE\n\nOF THE\n\nLANDIS LIBRARY.\n\nALEXANDER, G. G. Confucius the Great Teacher. A Study. London: Trübner. 1890.\n\nALLEN, C. F. R. The Book of Chinese Poetry: being the Collection of Ballads, Sagas, Hymns and other pieces known as the Shih Ching or Classic of Poetry. Metrically translated. London: Kegan Paul. 1891.\n\nALLEN, M.D. H. N. Korean Tales: Being a Collection of Stories translated from the Korean Folk-lore, together with Introductory Chapters descriptive of Korea. New York & London: Putnam. 1889.\n\nASIATIC SOCIETY, ROYAL. Catalogue of the Library. London. 1893.\n\nIndex to the Publications of the R. A. S. during the years 1827-1888.\nFrom the Journal of the R. A. S. of Great Britain and Ireland.\n\nASIATIC SOCIETY, ROYAL. Journal of the R. A. S.\n1895.\n1896—2 vols.\n1897—4 parts.\n1898—2 parts.\n\nList of Pamphlets for Sale.\nReprinted from the Journal. Jan. 1893.\n\nASTON, M.A., W. G. A Short Grammar of the Japanese Spoken Language. Belfast. 1871. Second Edition.\n\nA Grammar of the Japanese Written Language and a Short Chrestomathy. London. 1872.\nARMSTRONG, ALEX. Shantung (China): A General Outline of the Geography and History of the Province; a Sketch of its Missions; and Notes of a Journey to the Tomb of Confucius. With a new map specially compiled. Shanghai. 1891.\n\nIn a Mule Litter to the Tomb of Confucius. London: NISBET. 1896.\n\nARNOLD, SIR EDWIN. The Light of Asia.\n\nBABA, TATUI. An Elementary Grammar of the Japanese Language, with Easy, Progressive Exercises. London. 1873.\n\nThe War between Japan and China. Kobe, Japan.\n\nBALLER, F. W. A Primer of the Mandarin Dialect, containing Lessons and Vocabularies and Notes in Chinese Constructions and Idioms; also a Dialogue on Christianity; Translation of Passports, Leases, Boat Agreements, &c. Interleaved, and with large map of China. Prepared for the Use of Junior Members of the China Inland Mission. Shanghai. 1887.\n\nThe Sacred Edict. With a Translation of the Colloquial Rendering. Notes and Vocabulary. Prepared for the Use, &c. Shanghai. 1892.\n\nA Vocabulary of the Colloquial Rendering of the Sacred Edict. Shanghai. 1892.\n\nBEAL, S. Buddhism in China. Non-Christian Religious Series; London: S. P. C. K. 1884.\n\nBERESFORD, LORD CHARLES. The Break-up of China, with an Account of its present Commerce, Currency, Waterways, Armies, Railways, Politics and Future Prospects. With maps. London and New York. 1899.\n\nBERRY, T. STERLING. Christianity and Buddhism: a Comparison and a Contrast. Being the Donnellan Lectures for the year 1889-90, preached in the Chapel of Trinity College, Dublin. London S. P. C. K.\n\nBIRD, I. L. Unbeaten Tracks in Japan, an Account of Travels in the Interior, including visits to the aborigines of Yezo and the Shrines of Nikkô and Isé. 2 vols. Map and illustrations. London; MURRAY. 1880.\n\nBISHOP, F.R.G.S., MRS. BIRD. Korea and Her Neighbours. A Narrative of Travel, with an Account of the Recent Vicissitudes and Present Position of the Country. With a preface by Sir WALTER C. HILLIER, K.C.M.G. With illustrations from Photographs by\nthe Author, and Maps, Appendices and Index. New York: Revell Co. 1898.\n\nKorea and Her neighbours. A Narrative of Travel, with an Account of the Recent Vicissitudes and Present Position of the Country. Maps and Illustrations, 2 vols. London, 1898.\n\nBLODGET, H. The Use of T'ien Chu for God in Chinese. Shanghai: Pres. Mis. Press. 1893.\n\nBOWDEN, Ernest M. The Imitation of Buddha. Quotations from Buddhistic Literature for Each Day in the Year. With preface by Sir Edwin Arnold, K.C.I.E., C.S.I.\n\nBRAND, M. von. Drei Jahre Ostasiatische Politik 1894-97. Stuttgart. 1897.\n\nOstasiatische Frayen. China—Japan—Corea. Altes und Neues. Berlin. 1897.\n\nBRINCKLEY, R.A., Capt. F. An Unabridged Japanese-English Dictionary, with copious illustrations. Tokyo. 1896.\n\nBROWN, D.D., S.R. Prendergast's Mastery System adapted to the Study of Japanese or English. Yokohama. 1875.\n\nCARLES, F.R.G.S., W.R. Life in Corea. London. 1888.\n\nCAVENDISH, F.R.G.S., Capt. A. E. J. Korea and the Sacred White Mountain. Being a brief account of a Journey in Korea in 1891, together with an Account of an Ascent of the White Mountain by Capt. H. E. Goold-Adams, R.A. Forty original illustrations and two specially prepared Maps. London: G. Philip & Son. 1894.\n\nCHAMBERLAIN, BASIL HALL. Things Japanese Being Notes on Various Subjects connected with Japan. Yokohama: Kelly & Walsh. 1890.\n\nCHINA MEDICAL MISSION JOURNAL. 1893-94-95. 3 vols.\n\nCHINA MISSION HAND-BOOK, THE. First Issue. Shanghai: Mission Press. 1896.\n\nCHINA REVIEW, THE, or Notes and Queries on the Far East. Published every two months. Hong-kong.\n\nVol. XIV. Nos. 1-5\n\nVol. XXIII. Nos. 1-4\n\nVol. undated. No title-page.\n\nCHINESE RECORDER AND MISSIONARY JOURNAL, 1894-95-96-1898.\nCHRONICLE AND DIRECTORY FOR CHINA, COREA, JAPAN, &c. Hongkong. 1896.\n\nCOBBOLD, B. A., GEO. A. Religion: Shintoism—Buddhism—Christianity. With illustrations. London. 1894.\n\nCOLQUHOUN, A. R. Across Chrysê, Being the Narrative of a Journey of Exploration through the South China border-lands from Canton to Mandalay. With three specially prepared maps, 30 fac-similes of native drawings and 300 illustrations. 2 vols. Third edition. London: Sampson Low. 1883.\n\nChina in Transformation. With frontispiece, maps and diagrams. London & New York: Harper. 1898.\n\nCORREA. F. O papers. 1883-95.\n\nCORFE, BISHOP. Terminations of the Verb 하다, with Occasional references to some of the terminations used in Lumen. Seoul. 1896. For private circulation only.\n\nCORNABY, W. A. A String of Chinese Peach-Stones. London: C. H Kelly. 1895.\n\nCULIN, STEWART. Loan Exhibition. Objects used in Religious Ceremonies and Charms and Implements for Divination. Philadelphia. 1892.\n\nKorean Games with Notes on the corresponding games of China and Japan. Philadelphia. 1895.\n\nCUNNINGHAM, A. A History of the Szechuen Riots (May-June, 1895). Shanghai: Mercury Office. 1895.\n\nCURZON, GEO. N. Problems of the Far East. Japan—Korea—China. London: Longmans. 1894.\n\nD. W. S. The Sixty Years Anglo-Chinese Calendar, from 1st January, 1834, to 31st December, 1893, being from the 31st year of the 75th cycle to the 30th year of the 76th cycle. Hongkong. 1899.\n\nDALET, CH. Histoire de l'Église de Corée précédée d'une introduction sur l'histoire, les institutions, la langue, les moeurs et coutumes coréennes avec carte et planches. 2 vols. Paris. 1874.\n\nDAS, NOBIN CHUNDRA. A Note on the Ancient Geography of Asia, compiled from Válmiki-Rámáyana. With Map and Index.\n\nPublished by the Buddhist Text Society of India. 1896.\n\nDAVIDS, T. W. Rhys. Buddhist Suttas translated from Pali. Sacred Books of the East. Vol. x!. Oxford. 1881.\nBuddhism: being a Sketch of the Life and Teachings of Gautama, the Buddha. With Map. Non-Christian Religious Systems. London: S. P. C. K. 1887.\n\nDAVIS, JOHN FRANCIS. The Poetry of the Chinese. New and augmented edition. London. 1870.\n\nDE GROOT, J. J. M. The Religious System of China. Its Ancient Forms, Evolution, History and Present Aspect, Manners, Customs and Social Institutions connected therewith.\n\nVol. I. Book I. Disposal of the dead.\n\nPart I Funeral Rites.\n\nII. The Ideas of Resurrection.\n\nLeyden: E. J. Brill. 1893\n\nDE MAILLA, FATHER. The Early History of Formosa. Translated from the French. Shanghai. 1874.\n\nDENING, WALTER. The Life of Toyotomi Hideyoshi. Tokio. 1890.\n\nDENNY, N. B. The Treaty Ports of China and Japan. A complete guide to the open ports of these countries, together with Peking, Yedo, Hongkong and Macao. Forming a guide-book and vademecum for travellers, merchants and residents in general, with 29 maps and plans. By Wm. Fred. Mayers, F.R.G.S., H.M.'s Consular Service, N.B. Denny, late H.M.'s Con. Service and Chas. King, R.M.A. Compiled and edited by N.R. Denny. London: Trübner. 1867.\n\nDE ROSNY Les Coréens aperçu Ethnographique et Historique. Orné de gravures. Paris. 1886.\n\nDOUGLAS, ROBERT K. Transactions of the Second Session of the International Congress of Orientalists, held in London in September, 1874. London: Trübner. 1876.\n\nChina. With map. Second edition, revised. London: S. P. C. K. 1887.\n\nConfucianism and Taoism. With a map. Non-Christian Religious Systems. London. 1889.\n\nLi Hung-Chang, Public Men of To-day. An International Series. New York: Warne & Co.\n\nDU BOSE, REV. H. C. The Dragon, Image and Demon, or The Three Religions of China, Confucianism, Buddhism and Taoism. Giving an account of the My-\nthology, Idolatry and Demonolatry of the Chinese. London: Partridge 1886.\n\nDU HALDE, P. The General History of China, containing a Geographical, Historical, Chronological, Political and Physical Description of the Empire of China, Chinese-Tartary, Corea and Thibet. Including an Exact and Particular Account of their Customs, Manners, Ceremonies, Religion, Arts and Sciences. The whole adorned with curious maps and variety of copper plates. Done from the French of P. Du Halde. London, 1736.\n\nEDEN, F.R.G.S, CHARLES H. Frozen Asia: A Sketch of Modern Siberia. Together with an account of the native Tribes inhabiting that Region. London.\n\nEDKINS, REV. JOSEPH. The Early Spread of Religious Ideas, especially in the Far East. By-paths of Biblical Knowledge Series. London, 1893.\n\nChinese Buddhism: A Volume of Sketches, Historical, Descriptive and Critical. Second edition revised. Trübner's Oriental Series. London: Trübner, 1893.\n\nEITEL, ERNEST J. Feng-shui: or, The Rudiments of Natural Science in China. London: Trübner, 1873.\n\nHand-book of Chinese Buddhism, being a Sanscrit Chinese Dictionary with vocabularies of Buddhist Terms in Pali, Sinhalese, Siamese, Burmese, Tibetan, Mongolian and Japanese. Second edition, revised and enlarged. Hongkong, 1888.\n\nELLIOT, SIR CHAS. A Brief Summary of Do Ka Zang, the Sutra of the Glorious Age. Published as a Supplementary paper to the Journal of the Buddhist Text Society of India, under the orders of the Government of Bengal. Darjeeling; Bengal Secretariat Press, 1895.\n\nELLIS, HENRY. Journal of the Proceedings of the late Embassy to China; comprising a correct narrative of the Public Transactions of the Embassy, of the Voyage to and from China, and of the Journey from the Mouth of the Pei-ho to the Return to Canton. A new edition. London: Moxon, 1840.\n\nFABER, E. Introduction to the Science of Chinese Civilization. A Critique of Max Müller and other Authors. London: Trübner.\n\nA Systematic Digest of the Doctrines of Con-\nConfucius, according to the Analects, Great Learning and Doctrine of the Mean, with an Introduction on the Authorities upon Confucius and Confucianism. Translated from the German by P. G. von Moellendorff. Hongkong. 1875.\n\nThe Mind of Mencius or Political Economy founded upon Moral Philosophy. A Systematic Digest. Yokohama: KELLY & WALSH, 1897.\n\nFAR EAST, THE. An Exponent of Japanese Thoughts and Affairs. Vol. III. Nos. 24-28 inclusive. 1898, Tokyo.\n\nFAULDS, HENRY. East Asia. A Quarterly Journal of Far Eastern Lore and Literature for the General Reader.\n\nVol. I. No. 1. July 1897.\n\" \" 2. Oct \".\n\" \" 3. Jan. 1898.\n\nLondon: MARSHALL, RUSSELL & CO.\n\nFORBES, F. B., and HEMSLEY, W. B. Index Florae Sinensis. An Enumeration of all the Plants known from China Proper, Formosa, Hainan, Corea, the Luchu Archipelago, and the Island of Hongkong, together with their Distribution and Synonymy. 2 vols. Extracted from the LINNEAN SOCIETY'S JOURNAL—Botany vol. XXIII, London, May, 1886.\n\nFOSTER, MRS. ARNOLD. In the Valley of the Yang-tse. With sixty-four illustrations. London: SNOW. 1899.\n\nFOUR BOOKS, THE, or The Chinese Classics in English and Chinese text: for the use of those who wish to learn to translate English and those Gentlemen who wish to read the words spoken by the Chinese sages. Compiled from the best previous works and arranged precisely, according to the pages of the Chinese text, by a Chinese compiler. 6 vols. (in one). Honan: Printed at a private press, 1871.\n\nFREE MUSEUM OF SCIENCE AND ART, Department of Archaeology and Palaeontology, University of Pennsylvania.\n\nBulletin No. 2. Dec. 1897.\n\" \" 3. April 1898.\n\nFREE MUSEUM OF SCIENCE AND ART, Department of Archaeology and Palaeontology.\n\nBulletin No. 1. May, 1897.\n\" \" No. 4. June, 1898.\n\" \" Vol. II. No. 1. Jan. 1899.\nFRYER, JOHN. The Educational Directory for China. An Account of the various Schools and Colleges connected with Protestant Missions, as well as of Government and Private Schools under Foreign Instruction. First Issue. The Descriptive Catalogue of the Publications of the Association is appended. Shanghai: Mission Press, 1895.\n\nGALE, B.A., REV. JAS S. 南指課辭 남지과수 Korean Grammatical Forms. Seoul, 1894.\n\n——— 韓英字典 한영자연 A Korean English Dictionary. Yokohama, 1897.\n\n——— Korean Sketches. Chicago, 1898.\n\nGARDNER, C. T. The Missionary Question in China. How to lessen the recurrence of Anti-Christian and Anti-foreign riots. Seoul: ENG CH. MISSION, 1894.\n\nGIFFORD, REV. D. L. Every-Day Life in Korea. A Collection of Studies and Stories. New York.\n\nGILES, HERBERT A. The San Tzŭ Ching or the Three Character Classic and the Ch'ien Tsŭ Wên or Thousand Character Essay metrically translated. 1873.\n\n——— The Remains of Lao Tzŭ. Hongkong, 1887.\n\n——— A Chinese-English Dictionary. London: QUARITCH, 1892.\n\nGILMORE, A.M., REV. G. W. Korea from Its Capital with a chapter on Missions. Philadelphia.\n\nGILMOUR, JAS. More About the Mongols. Selected and arranged from the Diaries and papers of Jas. Gilmour by RICHARD LOVETT, M.A. London: R. T. S., 1893.\n\nGONCALVES, J. A. Diccionario China-Portuguez. Two vols. Macao, 1833\n\nGORDON-CUMMING, C. F. Work for the Blind in China. Parts I. and II. London: GILBERT & RIVINGTON.\n\nGOWLAND, W. The Art of Casting Bronze in Japan. From the Smithsonian Report for 1894. Pp.609-651 (with plates lxix-lxx.). Washington: GOVERNMENT PRINTING OFFICE, 1896.\n\nGRAY, JOHN H. China: A History of the Laws, Manners and Customs of the People. 2 vols. London: MACMILLAN, 1878.\nGRENON. Verdant Simple's Views of Japan or The Contents of his Note book.\n\nYokohama: KELLY and WALSH. 1890.\n\nGRIFFIS, W. E. Corea The Hermit nation.\n\nI. Ancient and Medieval History.\nII. Political and Social Corea.\nIII. Modern and Recent History.\n\nNew York: SCRIBNER. 1882.\n\nThe Religions of Japan from the Dawn of History to the Era of Mei-ji. New York: SCRIBNER. 1895.\n\nGUIDE-BOOK OF THE GRAND HOTEL, Yokohama.\n\nGUTZL AFF, CHAS. Journal of Three Voyages along the Coast of China in 1831, '32 and '33, with Notices of Siam, Corea and the Loo-Choo Islands. To which is prefixed an Introductory Essay on the Policy, Religion, &c., of China, by the Rev. W. ELLIS. Third edition. London.\n\nHAAS, JOSEPH. A Classified Index to the Articles printed in the Journals of the (North) China Branch of the Royal Asiatic Society from the Foundation of the Society, 1858, to the end of 1893.\n\nHALL, CAPT. BASIL. Account of a Voyage of Discovery to the West Coast of Korea and the Great Loo-Choo Island; with an Appendix containing Charts and various Hydrographical and Scientific Notes and a Vocabulary of the Loo-Choo language by H. J. CLIFFORD.\n\nLondon: MURRAY. 1818.\n\nHALL, M.D., ROSETTA S. The Life of Rev. William James Hall, M.D., Medical Missionary to the Slums of New York, Pioneer Missionary to Pyong-Yang, Korea. Illustrated.\n\nNew York.\n\nHANSEI ZASSHI, THE. A Monthly Magazine. Vol. XII. in parts.\n\n\"This Magazine is edited solely by Japanese with the object of representing the true state of Japan and the Japanese to the world at large. It contains several original articles on the customs, fine arts, literature and religion of our nation. Summary notes on the political, social and all other topics of\nthe time are also given. It is copiously illustrated, containing a full or double page illustration as frontispiece, besides a large number of photo-engravings.\"\n\nTokyo, Japan.\n\nVol XIII. Parts 1, 2, 3, 6, 9, 10.\n\nHART, V. C. The Temple and the Sage. Toronto: Briggs.\n\nHEDIN, SVEN. Through Asia. With nearly Three hundred Illustrations from Sketches and Photographs by the Author. 2 vols. London: Methuen & Co, 1898.\n\nHESSE-WARTEGG, ERNST VON. Korea: Eine Sommerreise nach dem Lande der Morgenruhe, 1894. Mit zahlreichen Abbildungen und einer Spezialkarte Koreas mit den angrenzenden Ländern. Dresden und Leipsig. Verleg von Carl Reissner, 1895.\n\nHITCHCOCK, ROMYN. The Ainios of Yezo, Japan, Washington: Govt. Printing Office 1892.\n\nSome Ancient Relics in Japan. From the Report of the U. S. National Museum. 1891.\n\nWashington: Govt. Printing Office. 1894.\n\nShinto, or The Mythology of the Japanese. From the Report of the U. S. National Museum. 1891.\n\nWashington: Govt. Printing Office. 1893.\n\nHODGE, J. W. Corean Words and Phrases. A Handbook and Pocket Dictionary for Visitors to Corea and New Arrivals in the Country. Seoul. 1897.\n\nHOSIE, M.A., F.R.G.S. ALEX. Manchuria: Its People, Resources and Recent History. With Map, Diagrams and Illustrations. London: Methuen & Co. 1901.\n\nHOUGH, WALTER. The Bernadou, Allen and Jouy Corean Collections in the United States National Museum. Washington. 1893.\n\nHOWARD, M.A., B. DOUGLAS. Life with Trans-Siberian Savages. London: Longmans. 1893.\n\nHUBBARD, GARDINER G. The Japanese Nation—A Typical Product of Environment. From the Smithsonian Report for 1895, pp. 667-681.\n\nWashington: Govt. Printing Office. 1896.\n\nHUNTER, M.D., REV S. A. A Manual of Therapeutics and Pharmacy in the Chinese Language, being, in the main, a translation of Squire's Companion to the British Pharmacopoeias, and from other sources.\nWith a preface by H. E. Li Hung Chang, Viceroy of Chihli.\n\nShanghai: Mission Press. 1890.\n\nIMBAULT-HUART, M. CAMILLE. Manuel de la Langue Coréene Parlée a l'usage des Francais.\nI. Introduction Grammaticale.\nII. Phrases et Dialogues Faciles.\nIII. Receuil des mots les plus usités.\nParis. 1889.\n\nINSPECTOR-GENERAL OF CHINESE CUSTOMS.\nTreaties, Regulations, &c., between Corea and other Powers. 1876-1899.\nChinese Imperial Maritime Customs. III.—Miscellaneous Series: No. 19. Sold by Kelly & Walsh, Shanghai. 1891.\n\nIS ABORIGINAL FORMOSA A PART OF THE CHINESE EMPIRE? An unbiased statement of fact.\nHongkong. 1874.\n\nJAPAN.—A Catalogue of Plants in the Botanic Garden of the Imperial University. Published by the University, Tokyo, Japan. 1887.\n\nJAPAN-CHINA WAR. The Naval Battle of Haiyang, 17th Sept., 1894. Compiled from official and other sources. With numerous colotype plates.\nYokohama: Kelly & Walsh.\n\nConstitution and By-laws of the Asiatic Society of Japan. 2 copies.\n\nTransactions of the Asiatic Society of Japan, 27th Oct., 1877-28th June, 1878.\n\nDo. Do. Do. 1881.\n\nJENKINS, R. C. The Jesuits in China and the Legation of Cardinal de Tournon. An Examination of Conflicting Evidence and an Attempt at an Impartial Judgement.\nLondon: Nutt. 1894.\n\nJENNINGS, WM. The Shi King—The old \"Poetic Classic\" of the Chinese. A close Metrical Translation, with Annotations.\nLondon: Routledge. 1891.\n\nJOLY, H. BENCRAFT. Hung Lou Meng; or The Dream of the Red Chamber. A Chinese novel. 2 vols.\nHongkong. 1892.\n\nJOURNAL OF THE NORTH-CHINA BRANCH OF THE ROYAL ASIATIC SOCIETY.\nNew Series. No. 4. Dec. 1867.\nCATALOGUE OF THE\n\nNew Series. No. 11\n\n1876\n1884\n1885\n1887\n1888\n\nVol. XXV. part 1. 1890-1\n\" \" 11. 1890-1\nVol. XXVI. \" \" 111. 1891-2\n\" \" XXVIII. \" \" 1. 1892-3\n\" \" XXIX. \" \" 1. 1893-4\n\" \" XXX. \" \" 1. 1894-5\n1895-6\n\nJUKICHI INOUYE. A Concise History of the War between Japan and China. Osaka. 1895.\n\nChushingura or the Loyal Retainers of Akao by Takeda Izumo, Miyoshi Shoraku and Nainki Senryu. Translated by Jukichi Inouye with numerous illustrations by Eisen Tomioka.\n\nTokyo.\n\nJULIEN, STANISLAUS. Meng Tseu vel Mencium inter Sinenses Philosophos, ingenio, doctrina, nominisque claritate Confucio Proximum, edidit Latina interpretatione ad interpretationem Tartaricam, utramque recensita, instruxit et perpetuo commentario e sinicis deprompto, illustravit STANISLAUS JULIEN.\n\nLutetiae Parisiorum. 1924.\n\nMéthode pour déchiffrer et transcrire les noms Sanscrits que se rencontrent dans les livres Chinois, à l'aide de règles, d'exercices et d'un répertoire de onze cents caractères Chinois idéographiques, employés alphabétiquement, inventu et démontrée par M. STANISLAUS JULIEN, Paris. 1861.\n\nKANZŌ UCHIMURA. Japan and the Japanese. Tokio. 1894.\n\n1. The Land and the People.\n2. Saigo Takamori and New Japan.\n3. Nesugi Yōzan—a Feudal Lord.\n4. Ninomiya Sontoh—a Peasant Saint.\n5. Nakae Toju—a Village Teacher.\n6. Nichiren—a Buddhist Priest.\n7. Temperance Island of the Pacific.\n8. Japan. Its Mission.\n\nKERN, H. The Saddharma-Pundarīka or The Lotus of The True Law.\n\nSacred Books of the East. Vol. XXI. Oxford, 1884.\nKINGMAN, H. Index to the Chinese Recorder. Vols I-XX. 1867-1889. Shanghai: Mission Press. 1893.\n\nKOREA—IMPERIAL MARITIME CUSTOMS. Returns of Trade and Trade Reports for the year 1901. Published by Order of the Chief Commissioner of Customs. Seoul: Methodist Publishing House. 1902.\n\nKOREAN GEOGRAPHICAL AND OTHER PROPER NAMES ROMANIZED, A MANUAL OF.\nPart I.—Index to the Map of Korea.\nPart II.—Index of Chinese Characters arranged according to the radicals.\nPrinted for H. B. M. Legation. Yokohama. 1883.\n\nKOREAN REPOSITORY. Vol I., 1892; Vol II., 1895; Vol III., 1896.\n\nKYOTO, THE OFFICIAL GUIDE TO.\n\nLAFFITTE, M. PIERRE. A General View of Chinese Civilization and of the West with China From the French of M. Pierre Laffitte, Directeur of Positivism. Translated by John Carey Hall, M.A.\nLondon: Trübner. 1887.\n\nLAGUÈRIE, VILLETARD DE. La Corée, Indépendente, Russe, ou Japonaise. Paris and London. :898.\n\nLANE-POOLE, STANLEY. The Life of Sir Harry Parkes, K.C.B., G.C.M.G., sometime Her Majesty's Minister to China and Japan. In 2 vols.\nVol. I. Consul in China.\nVol. II. Minister-Plenipotentiary to Japan and China.\nJapan Section by F. V. DICKINS; China Section by S. LANE-POOLE.\nLondon: MacMillan. 1894.\n\nLEGGE, D.D., JAS. The Chinese Classics: with a Translation, Critical and Exegetical Notes, Prolegomena, and Copious Indexes. In seven volumes.\nVol. I. London: Trübner. 1861.\nVols. II.-VII. London: Oxford University Press.\n\nThe Life and Works of Mencius. With Essays and Notes. London: Trübner. 1875. English text only.\n\nThe Chinese Classics. Translated into English, with Preliminary Essays and Explanatory Notes. Revised and reproduced from the author's work containing the original text, &c.,\nVol. III. The She King; or The Book of Poetry.\nLondon: Trübner, 1876.\n\nChristianity in China. Nestorianism—Roman Catholicism—Protestantism. London: Trübner. 1888.\n\nLITTLE, ARCHD. J. Through the Yang-tse Gorges or Trade and Travel in Western China. Third and revised edition, with Map and Illustrations.\nLondon: Sampson Low. 1898.\n\nLLOYD, A. Development of Japanese Buddhism. Transactions of the Asiatic Society of Japan. 1894.\n\nBuddhistische Gnadenmuttel. Tokyo.\n\nLOBSCHEID, REV. W. An English and Chinese Dictionary, as revised and enlarged by Tetsujiro Inouye, Bungakushi. Tokyo. 16th year of Meiji.\n\nLOCH, H. B. Personal Narrative of Occurrences during Lord Elgin's Second Embassy to China in 1860. By the late Henry Brougham Loch (Lord Loch), sometime Private Secretary to the Earl of Elgin. Third Edition, with Illustrations and a Preface by Lady Loch.\nLondon: John Murray. 1900.\n\nLOCKHART, J. H. STEWART. The Currency of the Far East from the Earliest Times up to the Present Day.\nVol. I. A Description of the Glover Collection of Chinese, Annamese, Japanese, Corean Coins: of Coins used as Amulets: and Chinese Government and private notes.\nHongkong. 1895.\n\nThe Currency of the Far East. Vol. II. The Plates of the Chinese, Annamese, Japanese, Corean Coins; of the Coins used as Amulets, and of the Chinese Government and Private Notes. Collected by the late Mr. G. B. Glover of the Chinese Imperial Maritime Customs, and now in the possession of Mrs. Glover. Hongkong. 1895.\n\nLUZAC & CO.'s ORIENTAL LIST. Vols. 1-6. Do. 1896.\n\nBibliographical List of Books on Africa and the East published in England 1889-92. London. 1892-94.\n\nMACGOWAN, REV. J. A. History of China from the Earliest Days down to the Present.\nShanghai: Presby. Mis. Press. 1897.\n\nMACKAY, G. L. From Far Formosa; The Island, its\nPeople and Missions. Edited by the Rev. J. A. Macdonald. With Portraits, Illustrations and Maps. Second Edition. Edinburgh. Oliphant, Anderson & Ferrier. 1896.\n\nMAPS.—朝鮮全圖 Two Copies.\n朝鮮輿地圖\nDo. in stiff cover.\nPhillips. Authentic Map—China.\n\nNeue Special-Karte von Korea, Nordost-China and Süd-Japan. Mit Plänen der Haupt-städte Söul, Peking, Tokio und deren weiteren Umgebungen. Nach den neusten russischen, englischen, französischen and dentschen Quellen bearbeitet von A. Heirich. Massstab 1:450000.\n\nMARTIN, W. A. P. A Short Method for Learning to Read and Write Chinese.\nShanghai: Mission Press. 1863.\n\n——— Hamlin Papers. Second Series. Essays on the History, Philosophy and Religion of the Chinese.\nShanghai; Kelly & Walsh. 1894.\n\n——— Chinese Legends and Other Poems.\nShanghai; Kelly & Walsh. 1894.\n\n——— A Cycle of Cathay, or China, South and North. With personal reminiscences. Illustrations and Maps.\nNew York: Revell Company. 1896.\n\n——— The Lore of Cathay or the Intellect of China. Illustrated. London: Oliphant, Anderson & Ferrier. 1901.\n\nMAYERS, WM. F. The Chinese Reader's Manual. A Handbook of Biographical, Historical, Mythological and General Literary Reference.\nShanghai. 1874.\n\n——— The Chinese Government. A Manual of Chinese Titles, categorically arranged and explained, with an Appendix.\nShanghai; Mission Press. 1878.\n\nM'CATCHIE, REV. CANON. A Translation of the Confucian 易經 or the Classic of Change, with Notes and Appendix.\nShanghai. :876.\n\nM'LEOD, JOHN. Voyage of His Majesty's Ship Alceste,\nalong the Coast of Corea to the Island of Lewchew; with an account of her subsequent shipwreck.\n\nLondon: Murray. 1818.\n\nMEDHURST, W. H. A Dictionary of the Hok-kèèn dialect of the Chinese Language, according to the reading and Colloquial idioms; containing about 12,000 characters, the sounds and tones of which are accurately marked;—and various examples of their use, taken generally from approved Chinese authors. Accompanied by a short historical and statistical account of Hok-kèèn; a treatise on the orthography of the Hok-kèèn dialect; the necessary indexes, &c.\n\nMacao. 1832.\n\nChinese and English Dictionary; containing all the words in the Chinese Imperial Dictionary, arranged according to the Radicals. 2 vols. Batavia. 1842.\n\nMEDICINES. LIST OF CHINESE. Imperial (China) Maritime Customs Publications. III.—Miscellaneous Series: No. 17. Shanghai. 1889.\n\nMETH. EPIS. CHURCH. 75th Annual Report of the Missionary Society of the M. E. Church for 1893.\n\nMICHIÈ, ALEX: China and Christianity. Tientsin. 1892.\n\nThe Chinese Oyster. See Blackwood’s Magazine, Feb. 1897.\n\nMILN, LOUISE JORDAN. Quaint Korea. London. 1895.\n\nMISSIONS ETRANGÈRES. History of the Churches of India, Burma, Siam, the Malay Peninsula, Cambodia, Annam, China, Tibet, Corea and Japan, entrusted to the Society of the “Missions Etrangères. Reprinted from the China Review.” Hongkong. 1896.\n\nMÖLLENDORF, P. G. and O. F. VON. Manual of Chinese Bibliography, being a List of Works and Essays relating to China.\n\nShanghai. 1876.\n\nThe Family Law of the Chinese. Shanghai. 1896.\n\nMOORE, G. F. Journal of the American Oriental Society. Society. 19th vol. Two parts.\n\nNew Haven, Conn. 1897.\n\nDo. do. Vol. XX., part I. 1899.\n\nMOULE, THE VEN. ARCHDEACON A. F. The Story of the Chekiang Mission of the Church Missionary Society. With Illustrations. London. C. M. S. 1891.\n\nNew China\nand Old. Second Edition. London; Seeley. 1892\n\nMORNING CALM, THE. 3 vols. 1891-96.\n\nMÜLLER, F. MAX. The Dhammapada. A Collection of Verses, being one of the Canonical Books of the Buddhists. Translated from Pāli Sacred Books of the East. Vol. XI Oxford, 1881.\n\nIntroduction to the Science of Religion. Four Lectures delivered at the Royal Institution in Feb. and May, 1870. London: Longmans 1893.\n\nMURRAY, Ph.,D., L.L.D., DAVID. Japan. London: Fisher Unwin. 1894.\n\nThe Story of the Nations Series.\n\nNANJIO, M.A., BUNYIU. A Short History of the Twelve Buddhistic Sects. Translated from the original Japanese. Tokyo.\n\nNEVIUS, REV. JOHN L. China and the Chinese: a General Description of the Country and its Inhabitants; its Civilization and Form of Government; its Religious and Social Institutions; its Intercourse with other Nations; and its Present Condition and Prospects. With a Map and Illustrations. New York; Harper. 1869.\n\nDemon Possession and Allied Themes, being an Inductive Study of Phenomena of Our Own Times. With an Introduction by Rev F. F. Ellinwood, D.D. With an Index; Bibliographical, Biblical, Pathological and General. Chicago: Revell Company.\n\nNORMAN, HENRY. The Peoples and Politics of the Far East. Travels and Studies in the British, French, Spanish and Portuguese Colonies, Siberia, China, Japan, Korea, Siam and Malaya. With 60 Illustrations and 4 maps. London: Fisher Unwin 1895.\n\nNORTH CHINA HERALD AND S. C. AND CONSULAR GAZETTE. Two vols.\n\nJuly—Dec. 1894.\nJan.—June. 1895.\n\nOLCOTT, HENRY S. A Buddhist Catechism. Colombo. 1882.\n\nOLIPHANT, LAURENCE. Narrative of the Earl of Elgin's Mission to China and Japan in the years 1857-8-9. Illustrations from Original Drawings and Photographs. 2 vols. London. 1859\nOPPERT, E. Ostasiatische Wanderungen. Skizzen und Erinnerungen aus Indien China Japan and Korea. Stuttgart.\n\nA Forbidden Land: Voyages to the Korea, With an account of Its Geography, History, Productions and Commercial Capabilities, &c., &c. With 2 charts and 21 Illustrations. London. 1880.\n\nPARKER, E. H. China: Her History, Diplomacy and Commerce, from the Earliest Times to the Present Day. With Map. London: Murray, 1901.\n\nPHILADELPHIA ORIENTAL CLUB. Oriental Studies. A Selection of the Papers read before the Oriental Club of Philadelphia, 1888-94. Boston. 1894.\n\nPOGIS, M. C. Korea aus dem Russischen übersetzt von St. Ritter von Ursyn-Pruszynski. Mit Einer Carte von Korea. Vienna. 1895.\n\nPEACE NEGOTIATIONS. Documentary History of the Peace Negotiations between China and Japan March-April, 1895. With Text of the Treaty of Peace. Officially revised. First edition. Tientsin. 1895.\n\nVerbal Discussions during Peace Negotiations between the Chinese Plenipotentiary Viceroy Li Hung-Chang and the Japanese Plenipotentiaries, Count Ito and Viscount Mutsu, at Shimonoseki, Japan. March-April, 1895. Translated from the Original Chinese Records. Officially revised. With portrait of Viceroy Li Hung-Chang. Tientsin, China. 1895.\n\nPHILOSINENSIS. Translation of a Comparative Vocabulary of the Chinese, Corean and Japanese Languages; to which is added The Thousand Character Classic, in Chinese and Corean; the whole accompanied by copious Indexes, of all the Chinese and English words occurring in the work. Batavia. 1835.\n\nPHILPOT, MRS. J. H. The Sacred Tree, or The Tree in Religion and Myth. London: Macmillan. 1897.\n\nPING-TSÊ PIEN, a new Edition of the Peking Syllabary, designed to accompany the Colloquial Series of the Tzŭ Erh Chi; being a revised collection of the characters representing the dialect spoken at the Court of Peking, and in the Metropolitan Prefecture of Shun-t'ien fu, arranged in the order of their syllables and tones; with an appendix.\n\nPOLETTIÈ, P. A Chinese and English Dictionary arranged according to Radicals and Sub-Radicals. New and\nenlarged edition, containing 12650 Chinese characters with the Pronunciation in the Peking dialect, according to Sir Thomas Wade's System, and the pronunciation in the general language of China in Dr. Williams' spelling. Compiled from the Best Authorities. Shanghai: Pres. Miss. Press. 1896.\n\nPRATT, A. E. To the Snows of Thibet through China. With Illustrations and a Map. London: Longmans. 1892.\n\nPRESBYTERIAN CHURCH. 57th Annual Report of the Board of Foreign Missions of the Presbyterian Church for the year 1893.\n\nREVIEW, ASIATIC QUARTERLY. Oct '96-Jan. '98. July and Oct., 1897. 7 vols. Woking.\n\nROCKHILL, W. WOODVILLE. Explorations in Mongolia and Tibet. From the Smithsonian Report for 1892. Washington: Govt. Printing Office. 1893.\n\nDiary of a Journey through Mongolia and Tibet in 1891 and 1892. Washington: Smithsonian Institution. 1894.\n\nNotes on the Ethnology of Tibet, based on the Collections in the U. S. National Museum. From the Report of the U. S. National Museum for 1893. pp. 665-747, with plates 1-12. Washington. 1895.\n\nROMAN CATHOLIC MISSION. Parvum Vocabularium Latino-Coreanum ad usum studiosae Juventutis Coreanae. Hongkong. 1891.\n\nROSS, D.D. REV. JOHN. Corean Primer, being Lessons in Corean on all ordinary subjects, transliterated on the principles of the \"Mandarin Primer\" by the same author. Shanghai. 1877.\n\nRUSSIAN-KOREAN VOCABULARY. St. Petersburg. 1874.\n\nRYOKICHI YATABE, Sc.D. Iconographia Florae Japonicae; or Descriptions with Figures of Plants indigenous to Japan. Tokyo, 1891.\n\nSAVAGE-LANDAR, A. HENRY. Corea or Cho-sen the Land of the Morning Calm. With numerous Text and full-page Illustrations from Drawings made by the Author. London: Heinemann. 1895.\n\nSCHANZ, MORITZ. Ein Zug nach Osten. 2 vols, Reisebilder aus Indien, Birma, Ceylon Straits Settlements, Java, Siam. Hamburg. 1897.\n\nSCHOFIELD, A. T. Memorials of R. Harold A. Schofield,\nM.A., M.B. (Oxon.), Late of the China Inland Mission. First Medical Missionary to Shan-si, China. Chiefly compiled from his letters and diaries by his brother, A. T. Schofield, M.D. with Introduction by Rev. J. Hudson Taylor. New Edition. with portrait. London: Hodder & Stoughton. 1898.\n\nSCOTT, M.A., JAS. English-Corean Dictionary. Being a Vocabulary of Corean Colloquial Words in Common Use. Corea. 1891.\n\nSCOTT, M.A., JAS. A Corean Manual or Phrase-Book: with Introductory Grammar. Second Edition. Seoul. 1893.\n\nSIEBOLD, PH. FR. VON. Nippon. Archiv zur Beschreibung von Japan und dessen neben und Schutzländern Jezo mit den Südlichen Kurilen, Sachalin, Korea und den Liu-kiu-Inseln. Warzburg. 1897. 2 vol.\n\nSIMPSON, J. Y. Monarch or Monk? A Legend of Tomsk. In Blackwood's Magazine Feb. 1897.\n\nSKERTCHLEY, S. B. J. Our Island. A Naturalist's Description of Hongkong. Hongkong: Kelly & Walsh, Ltd. 1893.\n\nSMITH, A. H. Village Life in China. A Study in Sociology. With Illustrations. New York: Revell Co.\n\nChinese Characteristics. Fourth Edition, revised, with illustrations. New York: Revell.\n\nSOWERBY, REV. HERBERT. Fundamental Principles of the Missionary Enterprise. New York: Sherwood & Co. 1893.\n\nS. P. G.—REPORTS 1889, 1891-92-93, 1895-96-97.\n\nST. JOHN R. N., CAPT. H. C. Notes and Sketches from the Wild Coasts of Nipon, with chapters on cruising after Pirates in Chinese waters. Edinburgh. 1880.\n\nSTOCK, EUGENE. Japan and the Japan Mission of the Church Missionary Society. London. 1887. Second Edition.\n\nThe Story of the Fuhkien Mission of the Church Missionary Society. With a map and thirty-three illustrations. Third edition, with a supplementary chapter. London: Seeley. 1890.\n\nTILLEY, HENRY ARTHUR. Japan, the Amoor, and the Pacific: with notices of other places comprised in a voyage of circum-navigation in the Imperial Corvette \"Rynda,\" in 1858-1860. 8 illustrations. London: Smith Elder. 1861.\nUNDERWOOD, A.M., H. G. An Introduction to the Korean Spoken Language. In two parts.\nI.—Grammatical Notes.\nII.—English into Korean.\nYokohama. 1890.\n\nVLADINNI. The China-Japan War. Compiled from Japanese, Chinese and Foreign Sources. Illustrated.\nLondon. 1896.\n\nWATTERS, T. Stories of Every-day Life in Modern China. Told in Chinese and done into English.\nLondon: Nutt. 1896.\n\nWENCHSTEIN, FR. Von. A Bibliography of the Japanese Empire. Leiden. London. 1896.\n\nWILKINSON, W. H. The Corean Government: Constitutional Changes July 1894 to October 1895. With an Appendix on subsequent enactments to 30th June 1896. Shanghai: Kelly & Walsh. 1896.\n\nWILLIAMS, S. WELLS. The Middle Kingdom. A Survey of the Geography, Government, Literature, Social Life, Arts and History of the Chinese Empire and Its Inhabitants. Revised Edition, with Illustrations and a new Map of the Empire. 2 vols.\nNew York: Scribner. 1883.\n\nYEAR-BOOK OF THE SCIENTIFIC AND LEARNED SOCIETIES OF GREAT BRITAIN AND IRELAND: Comprising Lists of the Papers read during 1895 before Societies engaged in fourteen departments of research, with the names of their authors. Compiled from official sources.\nLondon. 1896.\n\nYOUNGHUSBAND, CAPT. F. Among the Celestials. A Narrative of Travels in Manchuria, Across the Gobi Desert, through the Himalayas to India. Abridged from \"The Heart of a Continent.\" With Map and Illustrations.\nLondon: Murray, 1898.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko31roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 74, "total-input-tokens": 109224, "total-output-tokens": 32180, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 394, 7], [394, 394, 8], [394, 1041, 9], [1041, 1041, 10], [1041, 3048, 11], [3048, 5363, 12], [5363, 6868, 13], [6868, 9077, 14], [9077, 11009, 15], [11009, 13360, 16], [13360, 15644, 17], [15644, 18175, 18], [18175, 20519, 19], [20519, 22789, 20], [22789, 25054, 21], [25054, 27337, 22], [27337, 29515, 23], [29515, 31668, 24], [31668, 33934, 25], [33934, 36203, 26], [36203, 37436, 27], [37436, 39031, 28], [39031, 40798, 29], [40798, 42940, 30], [42940, 45338, 31], [45338, 47643, 32], [47643, 50053, 33], [50053, 52329, 34], [52329, 54670, 35], [54670, 57080, 36], [57080, 59405, 37], [59405, 61744, 38], [61744, 63908, 39], [63908, 64845, 40], [64845, 66967, 41], [66967, 69730, 42], [69730, 72165, 43], [72165, 73930, 44], [73930, 73940, 45], [73940, 73940, 46], [73940, 74286, 47], [74286, 76629, 48], [76629, 78196, 49], [78196, 78196, 50], [78196, 79252, 51], [79252, 81234, 52], [81234, 82944, 53], [82944, 84836, 54], [84836, 86593, 55], [86593, 88572, 56], [88572, 90365, 57], [90365, 92053, 58], [92053, 93755, 59], [93755, 95611, 60], [95611, 97208, 61], [97208, 98719, 62], [98719, 100422, 63], [100422, 102225, 64], [102225, 103742, 65], [103742, 105590, 66], [105590, 107328, 67], [107328, 109398, 68], [109398, 111281, 69], [111281, 113196, 70], [113196, 114601, 71], [114601, 114601, 72], [114601, 114601, 73], [114601, 114601, 74]], "primary_language": ["None", "en", "None", "None", "None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]