[{"id": "b0e1486801ed922741a21a3381902618d955b907", "text": "ROYAL ASIATIC SOCIETY\n\nOF\n\nGREAT BRITAIN AND IRELAND.\n\nTRANSLATION AND REMARKS\n\nON AN\n\nANCIENT BUDDHIST INSCRIPTION\n\nAT\n\nKEU-YUNG KWAN,\n\nIN NORTH CHINA.\n\nBY\n\nA. WYLIE.\n\nDecember, 1870.\nMESSRS. TRÜBNER & Co. respectfully solicit orders for all classes of Publications connected with the History, Antiquities, Geography, and Languages of the East, published abroad. Messrs. Trübner & Co. have established agencies in all parts of the East, of Europe, and America, and are thus enabled to furnish such publications with as little delay as possible, and at prices below the hitherto customary charges.\n\nAuthors desirous of printing their own books may be furnished with Specimens, and Estimates for Paper, Printing, and Binding, and every facility will be afforded them, if works are intended for publication, of bringing the same advantageously before the public.\n\nAlcock.—A Practical Grammar of the Japanese Language. By Sir Rutherford Alcock, Resident British Minister at Jeddo. 4to., pp. 61, sewed. 18s.\n\nAlcock.—Familiar Dialogues in Japanese, with English and French Translations, for the Use of Students. By Sir Rutherford Alcock. 8vo., pp. viii. and 40, sewed. Paris and London, 1863.\n\n—A Practical Grammar of the Sanskrit Language, for the Use of Early Students. By Theodore Benfey, Professor Publ. Ord. of Sanskrit in the University of Göttingen, etc., etc. Second Edition, carefully revised and corrected. Royal 8vo., pp. xviii. and 296, cloth. 10s. 6d.\n\nGoldstücker.—A Dictionary, Sanskrit and English, extended and improved from the Second Edition of the Dictionary of Professor H. H. Wilson, with his sanction and concurrence. Together with a Supplement, Grammatical Appendices, and an Index, serving as a Sanskrit-English Vocabulary. By Theodor Goldstücker. Parts I. to VI. 4to. 1856—1861. Each Part 6s.\nON AN\n\nANCIENT BUDDHIST INSCRIPTION\n\nAT KEU-YUNG KWAN, IN NORTH CHINA.\n\nBY A. WYLIE.\n\nTravellers from the city of Peking to the town of Kalgan on the great wall of China, must make the journey by the rugged defile known as the Nankow Pass. Five miles north of the entrance, where the village of Nankow stands, is the smaller village of Keu-yung kwan. Fortifications there run up the steep slopes of the mountains on both sides of the valley; and besides arched gateways at the two ends of the village, the highway passes under a limestone archway of a much more striking appearance. This is covered with mythological and symbolic sculptures of obviously Indian origin. The tradition of the natives in the neighbourhood asserts it to have been the basement story of a pagoda which stood there; and the name by which it is still designated, 過街塔 Kuò keae t'â, \"Pagoda crossing the street,\" bears out the statement. We are told that this pagoda, though erected for the benefit of the locality, proved an object of such terror to the superstitious Mongols, coming south from their native wilds, that they could not be induced to pass under the ominous-looking structure; and thus it was found necessary in the early part of the Ming dynasty, to remove the upper stories of the erection; the policy of the government being to conciliate and attract these wild nomades.\n\nKeu-yung kwan was once a place of much greater pretension and importance than it is at present; and it can boast of historical memories of considerable interest; not the least being the fact that there Genghis khan was successfully resisted in his attempts to force the pass.\n\nSeveral Europeans who have passed that way, have noticed the village and the archway, in recounting their travels. Father Gerbillon, who was there on his way to Mongolia in 1688, says—\"The village might pass for a little town. The\ngate by which it is entered is very like a triumphal arch. It is all marble, and about thirty feet thick, with figures in half relief up to the spring of the arch.\"¹ The same father, returning that way in the suite of the emperor in 1697, remarks:—\"The heir apparent, accompanied by five of his brothers, and some magnates of the empire who had remained at Peking, came to meet the emperor in the middle of the Pass, in a village, named Kiu yüm quan, where they remained some time.\"² Bell of Antemmony, who accompanied the Russian embassy to Peking in 1720, speaks of it as the town of Zulin guang, where he says they passed the night of November 15th.³ Timkowski, who headed a similar embassy in 1820, speaks thus of the place:—\"Here the road begins to be very difficult, especially for carriages, and does not change for a distance of about five verst, as far as the fort of Kiu young (kouan), the principal defence of this passage. The interior of the middle gate is ornamented with figures of heros sculptured on the walls.\"⁴\n\nNone of the preceding writers however, nor others who had been there, seem to have thought it worth while to direct attention to the inscription which is found on this archway; and the first notice of it brought before the European public, so far as I am aware, was in a paper by myself, published in the Journal of the Royal Asiatic Society for 1860.⁵ I had found it registered in a Chinese work on stone inscriptions, published towards the close of last century.⁶\n\nWhile on my return from England to China, via Siberia and Mongolia, in 1863, I first saw this arch.⁷ At that time\n\n¹ Du Halde. \"Description Géographique, Historique, Chronologique, Politique, et Physique de la Chine, etc.\" Hague. Tome iv. p. 108.\n² Ibid. Tome iv. p. 447.\n³ Travels, vol. i. p. 350.\n⁴ Voyage à Péking à travers la Mongolie. Tome i. p. 315.\n⁵ Vol. xvii. p. 346.\n⁶ 潛研堂金石文跋尾續 Tsēen yen t'ang kin shih wän pa wei sūh. \"Supplement to the Tsēen-yen Hall metal and stone inscription appendices,\" by Tsēen Tá-hin.\n⁷ The Rev. J. Edkins, of Peking, in anticipation of my arrival,\nI could only succeed in getting an impression on paper of a portion of the inscription on the west side of the archway; which was exhibited at the first meeting of the North-China Branch of the Royal Asiatic Society at Shanghai, in 1864. A short paper on the same was published in the Society's Journal for that year.\\(^1\\)\n\nhad come to the Mongolian plateau to meet me, but being a fortnight too early, he left a note for me at Kalgan, which, however, I never received. In that note he called my attention to the inscription on the arch, which he had observed in passing.\n\nAn engraving of the arch has recently been published by Professor Pumpey, who saw it in the spring of 1863. In his new work, \"Across America and Asia,\" he thus describes the place:—“The next morning, leaving the plain, we entered the narrow valley, winding for several miles through a desolate gorge, enclosed by lofty walls and yellow cliffs of limestone. The mountain torrent, which at certain seasons dashes wildly through the valley, makes the construction of a durable road almost impossible, and it was only with difficulty, and with faith in the sure feet of our horses, that we managed slowly to pick our way through the long and narrow valley of sharp-edged boulders and masses of fallen rock. After several miles of this work we came to a point where the remains of an ancient road rising some distance above the bed of the valley was preserved along the mountain side. Ascending this by a long flight of steps, of highly polished blocks of limestone, granite, and porphyry, we passed through a gateway in an inner branch of the great wall, and came soon after to a beautiful white marble arch built during the Chin dynasty. This structure is remarkable from the fact that while its blocks are cut for a circular arch, the inner surfaces are hewn to produce a ceiling of semi-hexagonal form. It is interesting also to the student of the Chinese language, from the fact that the interior contains inscriptions in an ancient Chinese character. As Dr. Pogojeff wished to photograph this monument, we remained here till the next day, etc.”\n\nIn the Chinese Recorder and Missionary Journal, vol. ii. p. 190, are the following remarks in the journal of a missionary lady who lately passed Keu-yung kwan on her way to Kalgan:—“The inner line of the great wall is at the entrance to the Nankho, and three or four branches cross it. We passed through ten gateways. These are double, as is customary with cities. The wall is dilapidated in some places, but the gateways are all solidly built, and in good repair. One was very fine, having much carved work, and inscriptions in six different languages. One of these European scholars cannot read.”\n\n\\(^1\\) Journal of the North-China Branch of the Royal Asiatic Society, New series, No. 1, pp. 133–136.\nAs there stated, the inscription is engraved in the characters of six different nations, and covers the greater part of the inner facing of the structure on both sides, from the basement to the spring of the arch. Two of the parts are inscribed in horizontal lines at the top, in antique Devanagari and Tibetan characters respectively, twenty feet long on each wall. Below these are four compartments inscribed respectively in Mongol, Ouigour, Neuchih and Chinese characters, all in vertical lines.\n\nIn the spring of 1867, when on a visit to the north of China, I succeeded in completing my impression of the four last-named parts of the inscription, but could not get the Sanscrit and Tibetan portions, on account of their great height from the ground. At a subsequent period, however, these were procured by Mr. Edkins, and he has kindly sent me a hand tracing by a Chinese, from his impression.\n\nIt will be seen that the great interest of this inscription is the large and correct specimen it offers of the Neuchih character, the national writing of the Kin dynasty Tartars, the knowledge of which is now absolutely lost in China, and very few specimens are known to exist or to be accessible.\n\nThe great age of this piece of art however,—more than five centuries,—taken into consideration, it is not surprising that it has suffered much from various causes; large portions of the stone have dropped out in many places; the surface, especially towards the base, is much chipped and defaced, and in some places the characters have become so filled up with hard matter, as scarcely to give any legible impression on the paper. The numerous lacunæ thus produced form the chief difficulty in the decipherment.\n\nA slight comparison of the different parts was sufficient to show that they were all transcripts of a Sanscrit original. On the eastern wall the correspondence for the greater part is tolerably close throughout. That on the western side is much less regular, no one version being the exact counterpart of any other, gaps and redundancies occurring in many places, especially in the latter part.\n\nThe present paper then will be occupied specially with the\neastern side of the archway, leaving the opposite one as a subject for future investigation; as I find each side is complete in itself.\n\nOutside the original inscription, there is an intimation in smaller Chinese characters, on the right-hand border, towards the top, to the effect that the structure was \"repaired with funds given by the meritorious and believing official Lin P’oo-heen, on the 15th day of the 5th month of the year 1445.\" It is to be noticed, that this is exactly a century after the date of the original inscription, 1345, which by a singular accident is preserved, in a line where little else is legible.\n\nAs the Chinese characters were more easily intelligible to me than any of the others, and consequently promised the readiest key to the mystery, I naturally turned to that part of the inscription first. Unfortunately I found it specially faulty and illegible; and it was necessary to supply large lacunæ by analogy, and with the aid derivable from the transcripts in the other characters. There are twenty-one columns of large characters, which are succeeded by twenty columns of a smaller size; and with the exception of the Sanscrit, which consists entirely of large characters, all the other compartments have, like the Chinese, part in large characters and part in small. Of the large character portion, which it was at once obvious was a mere transcript of Sanscrit sounds, I have lately found another rendering in a Chinese ritual, the 禅門日誦 Shen mun jih sung, \"Daily recitations of the Shen sect;\"¹ in which it is spelt out with a set of characters differing almost entirely from those on the inscription; so that it is only by the phonetic approximation that the identity can be detected. The title of the piece, as given in the ritual,—but omitted in the inscription,—is 佛頂尊勝大陀羅尼 Fuh ting tsun shing ta to lo ne, \"Great dhâranî of the honoured diadem on Buddha’s cranium.\"² It may be remarked that in every instance where a\n\n¹ Mr. Edkins identifies the Shen sect with the Jains of India.\n\n² In another ritual, the 瑜伽焰口 Yu kea yen kow, \"Flaming mouths of the Yoga,\" in the possession of W. Lockhart,\ncompound character is used in the Sanscrit,—and such instances are very numerous,—the same is expressed by two Chinese characters in the column, followed by two smaller ones, 二合 urh hö, “two combined,” placed horizontally. This practice is invariable, both in the inscription and in the ritual. The copy in the ritual is marked off by stops, into words or clauses throughout. By the discovery of this duplicate, I have been enabled to fill up the gaps in the Chinese part of the inscription almost without the chance of error.\n\nHaving ascertained that all the different portions were transcripts or transliterations of a Sanscrit original, the importance of restoring and analyzing this original was apparent; and for this purpose I have turned to account the tracing sent to me by Mr. Edkins. This consists of five horizontal lines of characters, each two inches in depth and twenty feet in length. Besides being in an obsolete form of the Devanagari, the Chinese copyist, as might be expected, has made numerous errors in his endeavours to extricate the complex characters from the half-obliterated legend on the stone. So great was the confusion thus produced, that it would have been hopeless for any but a Sanscrit scholar to have succeeded in restoring the half-obscured forms. At this stage I was under obligation to Dr. E. Haas, of the British Museum, who kindly identified the greater number of the characters for me. Having this clue to start with, by a comparison of the several transcripts, I was able to make an approximate restoration of the whole, and wrote out the same in English letters. Being in Göttingen shortly after, I showed this transcript to Professor Benfey, who readily gave me a partial translation, and pointed out many errors in the proposed restoration; although a failure of eyesight, from which he was at the time suffering, prevented him entering so minutely into the details, as he otherwise would willingly have done. These hints however put me in the way of\n\nEsq., the same is given with the abbreviated title 尊勝咒 Tsun shing chow, “Prayer to the honoured diadem.”\nmaking numerous corrections; and after repeated amendments, in which Dr. Haas has taken much trouble to assist me, I am indebted to that gentleman for a complete and independent translation of the whole; which is subjoined hereafter the phonetic transcript. A few places, and only a few, have persistently refused to submit to the rigour of grammatical laws; and it is not surprising, in the case of a dead language being traditionally preserved for centuries among a people by whom it is not understood, that a few errors should creep in. It is rather to be wondered at, and indicates a remarkable veneration for the sounds of the sacred language, that the text as preserved should be able to give out such a complete and intelligible meaning.\n\nTRANSLITERATION.¹\n\nOm namo bhagavate sarvatrailokyaprativiṣiṣṭāya buddhāya te namaḥ tadyathā om bhūr om bhūr om sodhaya sodhaya viṣodhaya viṣodhayāsama samantāvabhāsāvaraṇa gatigaganasvabhāvaviṣuddhe abhishinchena² tu māṁ sarvatathāgata sugata varavachanāmritābhisekair mahāmudrā³ mantrapadailā āhara āhara mamāyuḥ santāraṇi sodhaya sodhaya viṣodhaya viṣodhaya gaganasvabhāvaviṣuddhe ushnīshavijayapariṣuddhe sahasraraṣmisamchodite sarvatathāgatāvalokini śatpāramitāparipūrṇi sarvatathāgatamatidaśabhūmipratishṭhite sarvatathāgatahrdayādhishṭhānādhishṭhite mudre mudre mahāmudrevajrakāyasamahatanapariṣuddhe sarvakarmāvarapa-visuddhe pratinvartaya mamāyuḥ viṣuddhe sarvatathāgatasamayādhishṭhānuddhishthite om muni muni mahāmuni vimuni vimuni mahāvimuni,⁴ mati mati mahāmati mamati⁵ sumatitathātābhē koṭipariṣuddhe visbutabuddhiṣuddhe⁶ he he jaya jaya jaya jaya samara\n\n¹ The italics represent the restorations, which are illegible in the Sanscrit.\n² Dr. Haas corrects this to abhishinches.\n³ Dr. Haas adds m here.\n⁴ Dr. Haas thinks the inscription is in error here, and that the preceding six words should end in ne instead of ni.\n⁵ Dr. Haas thinks this word should be mahāmati.\n⁶ I understand that sbu is an impossible combination in Sanscrit; and although the Sanscrit character is missing on the stone, yet the several transcripts in the other characters are so distinct that I do not feel at liberty to abandon it. Dr. Haas suggests viṣvataḥ, or more correctly viṣvato.\nsamara sabhara sabharaya sabharaya sarvabuddhadhishthânadhish-\nthite suddhe suddhe buddhe buddhe vajre vajre mahâvajre suvajre\nvajragarbhe jayagarbhe vijayagarbhe vajrajvalagarbhe vajrodbhare\nvajrasambhave vajre vajrini vajram bhavatu mama śarīram sarvasatvā-\nnâmeha kâyapariśuddhir bhavatu me sadâ sarvagatipariśuddhiścha\nsarvatathâgâtâscha mâm samâvasantu budhyâ buddhyâ siddhyâ\nsiddhyâ bodhayâ bodhayâ vibodhayâ vibodhayâ mochaya vimo-\nchaya vimochaya sodhaya sodhaya visôdhaya visôdhaya samantân\nmochaya mochaya samantaraśmipariśuddhe sarvatathâgatahridayâdhi-\nshthânadhishthite mudre mudre mahâmudre mahâmudre1 mantrapadaiḥ\nsvâhâ.\n\nNamo sarvatathâgatosñîshâya trailokyâ2 adhishthite sarvatathâ-\ngatahridayâdhishthite svâhâ namo bhagavate usñîshâya om bha-\ngavate suddhe viṣuddhe svâhâ om amitâyurdade3 svâhâ om bhû-\nsthâ4 svâhâ om lokanâtha lam svâhâ om maitreyamudre svâhâ om\ngaganaganja gam svâhâ om samantabhadra sam svâhâ om vajrapâṇi5\nvam svâhâ om manjuśrî mam svâhâ om sarvanivaranavishkambhin\nsam svâhâ om kshitigarbha kshim svâhâ. Om śrî.\n\nTRANSLATION.\n\nOm!6 adoration to the holy Buddha, who art exalted above all\nthe three worlds,—adoration to thee!—which is equivalent to Om.\nBhûr om, bhûr om, bhûr om :7 Purify, purify, completely purify, com-\n\n---\n\n1 Dr. Haas proposes to correct this to mahâmudre.\n2 The canons of Sanscrit orthography would require these two\nwords to be combined thus—trailokyâdhishthite.\n3 Da here seems to be redundant.\n4 This word is doubtful. Dr. Haas suggests bhûyishtha.\n5 Dr. Haas corrects this to vajrapâṇi.\n6 Om is the mystic name of deity among the Hindus, and gene-\nrally forms the commencement of a prayer.—Klaproth, Fragmens\nBouddhiques, p. 30.\n7 “I originally suggested bhûr bhuvah svar, the so-called three\nvydhritis or mystical syllables pronounced before every daily prayer,\nbut am forced to believe that we have here to read bhûr om, bhûr\nom, bhûr om. True, I have never read bhûr alone as an exclama-\ntion, but always the whole triumvirate together, which is very\nnatural if their allegorical meaning is ‘the three worlds, Earth,\nAtmosphere, and Heaven.’ Still in this place all the different\ntranscripts seem clearly to point towards bhûr om. The Sanscrit\ncharacter for it (in the Yu kea yen kow) is unique, and could never\nbe read for two syllables, although it contains enough of the dif-\npletely purify, oh thou incomparable one, who embracest all space, and whose splendour has appropriated the sphere of knowledge!—thou Sugata\\(^1\\) of all the Tathāgatas,\\(^2\\) whose speech is blessing, and who art immortal, consecrate me by sprinkling me with holy water, and [consecrate] the great Mudrā\\(^3\\) with the words of mystic prayers! Give, give me old age, oh protector! purify, purify, completely purify, completely purify, thou who art purified by appropriating the celestial sphere;—who art completely purified by the all-powerful Ushnisha,\\(^4\\)—illumined by a thousand rays, and looking on all the Tathāgatas,—accomplishing the six perfections, standing upon the ten regions embracing the knowledge of all the Tathāgatas,—placed on the sure ground of the hearts of all the Tathāgatas,—oh Mudrā, Mudrā, great Mudrā, whose body is pure as the body of a thunderbolt,—purified by embracing all good actions!—renew my life, oh thou pure one, who standest on the ordinances of all the Tathāgatas. Om! oh sage, sage, great sage!—exalted sage, exalted sage, thou great exalted sage!—oh Mati,\\(^5\\) Mati, great Mati, thou Mamati, who hast entered the real state of sound knowledge,—purified to the utmost limit,—purified by all-embracing knowledge!—oh victory, victory, universal victory, universal victory!—oh battle, battle! —Sabbara, Sabbaraya, Sabbaraya!\\(^6\\)—[oh Mudrā] standing upon the ground of all the Buddhas together!—oh purification!—oh knowledge!—oh Vajra,\\(^7\\) Vajra, thou great Vajra, Suvajra,\\(^8\\) bearing the thunderbolt in thy womb,—bearing victory in thy womb,—bearing signal victory in\n\n\\(^{1}\\) Lit. “The welcome one,” a title of Buddha.—Burnouf. Introduction à l’histoire du Boudhisme Indien, p. 77.\n\n\\(^{2}\\) Lit. “Come in like manner,” a generic designation of Buddha.—Ibid. p. 76.\n\n\\(^{3}\\) Lit. “Seal,” a personification of certain Buddhist signs made with the fingers.—Vassilief. Le Bouddisme, p. 143.\n\n\\(^{4}\\) The Ushnisha is generally understood to be an excrescence on the skull. The word also means “a turban,” “the curly hair with which Buddha was born,” and “the hair on the head tied in a knot.”—Burnouf. Le Lotus de la bonne loi, p. 558.\n\n\\(^{5}\\) Lit. “Mind,” a personified attribute.\n\n\\(^{6}\\) It is impossible to get any sense out of these ejaculations.\n\n\\(^{7}\\) Lit. “Thunderbolt,” a personification.\n\n\\(^{8}\\) A modified form of Vajra.\nthy womb,—bearing the thunderbolt and lightning in thy womb,—who hast received thy existence from the thunderbolt,—who art originated in the thunderbolt!—oh Vajra,—endowed with the thunderbolt,—may my body be a thunderbolt, and may the purification of the same extend over all its essential qualities!—may there also be purification of all knowledge,—and may all the Tathâgatas take up their abode in me!—With all knowledge and all perfection, ever teach, ever instruct, ever deliver, ever save, ever purify, and ever sanctify me! Deliver, oh deliver, all living creatures, thou who art purified by effulgence of light,—placed on the sure ground of all the Tathâgatas,—oh Mudrâ, Mudrâ, great Mudrâ, great Mudrâ,—with the words of mystic prayers! Svâhâ.¹\n\nAdoration to the Ushnisha of all the Tathâgatas!—[oh Mudrâ] ruling over the three worlds, and founded upon the hearts of all the Tathâgatas! svâhâ. Adoration to the sacred Ushnisha!—adoration to Bhagavat!²—thou purified, supremely purified [Mudrâ]!—oh thou who bestowest unlimited age! svâhâ. Oh thou most eminent, the Lord of the universe (lokanâtha)!—lam* svâhâ. Oh seal of Maitreya!³ svâhâ. Oh Gaganaganja!⁴ gam* svâhâ. Oh Samantabhadra!⁵ sam* svâhâ. Oh Vajrapani!⁶ vam* svâhâ. Oh Manjusri!⁷ mam* svâhâ. Oh Sarvanivaranaavishkambhin!⁸ sam* svâhâ. Oh Kshitigarbha!⁹ kshim* svâhâ. Om śri.\n\nA good deal has been said about dhâranîs, by writers on Buddhism, and it would be out of place here to enter on\n\n¹ Svâhâ is generally left untranslated. Its use is analogous to \"Amen.\"\n² Lit. \"The Fortunate,\" a title of Buddha.—Schlagintweit. Buddhism in Tibet, p. 4.\n³ Name of the future Buddha.\n⁴ Name of a Bodhisattva.\n⁵ Ditto.—Vassilief. Le Bouddisme, p. 267.\n⁶ The subduer of evil spirits.—Schlagintweit. Buddhism in Tibet, p. 114.\n⁷ The god of wisdom.—Ibid, p. 65.\n⁸ Name of a Bodhisattva.\n⁹ Ditto.\n\n* \"These syllables have no sense in themselves, and are merely repetitions of the first syllable of the name invoked in each phrase, with a nasal sound affixed to it. Perhaps it means that a stop is to be made for meditation on the particular merits of each Bodhisattva. But it may also be an abbreviation, indicative of the repetition of the whole formula.\" (Dr. Haas.)\nthe mysteries of that abstruse subject. Suffice it to say that, according to the general definition, they are certain mystical formulæ, supposed to carry with them a magical influence in the recitation, and this influence is not simply dependent on their utterance as a whole, but is supposed to be inherent in the single words, and even in the separate letters of the forms. In a system where all the objects of sense are but so many ideas in a world of unreality, words constitute not merely names, but the actual essence of the things named; and the possession of the name is consequently the possession of the object. This may account for the incoherent and almost meaningless ejaculations observable throughout the inscription; and it is but a refinement of the same notion to attribute a similar virtue to the elements of which the words are made up. From words and letters, the same occult efficacy was transferred to symbols made by a particular placing of the fingers, which is called mudrā, or \"the seal,\" and this appears to be personified here as an object of adoration.\n\nThe above translation seems to be tolerably near the meaning of the text; and although after every effort at reconstruction, a few grammatical solecisms still remain, yet I believe there are very few places now, where the original syllables are not correctly restored. It is indeed interesting to have an exact interpretation of the text; but the main thing for our present purpose, is to identify the vocables without error; and when once assured of the powers of the Sanscrit characters, we can proceed with confidence to the analysis and restoration of the several transliterations.\n\nThe dhārani concludes near the end of the fourth line on the stone, thus:—\"with the words of mystic prayers (mantra). Svāhā.\" The doxology that follows is only found in one of the transliterations. From the remarks of Burnouf on the subject,² I am inclined to think that this concluding piece is the mantra alluded to in the final sentence of the dhārani.\n\n¹ See Vassilief's \"Le Bouddisme,\" translated by La Comme, p. 141, passim.\n² Introduction à l'histoire du Bouddhisme Indien, p. 540.\nIt may be remarked that the invocation *Om bhūr om svāhā*, by which the Chinese and three of the others commence, is omitted in the Sanscrit.\n\nImmediately below the Sanscrit text is the transcript in three horizontal lines of Tibetan characters, below which are four lines of Tibetan in smaller characters. The Tibetan character being a direct derivative from the Devanagari,\\(^1\\) it might be expected that this would prove the most important of the transcripts for identifying the original text. Unfortunately however, the breaks in the face of the stone are so extensive, that not much more than half of the writing is preserved; and the indistinctness of that, probably, has led the copyist into so many errors and omissions, that the tracing serves for little more than mere hints; but it may in great part be corrected by the other transcripts. This contains the introductory invocation *Om bhūr om svāhā*, and the *dhārani* occupies about two lines and a third; the remaining portion being totally different from the Sanscrit, though it is evidently Sanscrit also.\n\nThe first of the vertical portions below the preceding, beginning from the left hand, is in that form of the Mongol known as the Bāshpah\\(^2\\) alphabet. This consists of twenty lines in large characters, the lines succeeding from left to right; which are followed by eight lines of Mongolian in a smaller character. The transcript commences with the invocation *Om bhūr om svāhā*, and contains the whole of the *dhārani*, but nothing additional.\n\nAlthough the history of this alphabet and writing is dis-\n\n\\(^1\\) The Tibetan characters were invented by Thumi Sambhota, the Prime Minister of Srongtsan Gampo, King of Tibet, from the Devanagari alphabet, about the middle of the seventh century.—Schlagintweit. Buddhism in Tibet, p. 65.\n\n\\(^2\\) This is a Sanscrit name बाष्पः: Bāśhpah, which is transferred into Chinese by the characters 八思巴 Pa-sze-pa and 帕克斯巴 Pa-kth-sze-pa. Pallas writes the name Pagba. Remusat gives it Phaspa, Paspa, Bāschpah, and Pa-sse-pa, in different places of his Recherches sur les langues Tartares. Klaproth uses Bhâchbah, as the Tibetan transcript of the original Sanscrit. Pauthier uses Pa-sse-pa.\ntinetly related in the Chinese annals, yet its actual existence seems, up to a very recent period, to have been a matter of doubt with European writers.\n\nChinese history tells us that the emperor Kubla commissioned the Tibetan lama Bashpah to construct an alphabet or syllabary specially adapted to the Mongol language. His task was completed, and the alphabet initiated for public use by an imperial decree in 1269. Schools for the study of this character were also instituted the same year. Several notices on record lead us to believe that the Chinese never took willingly to the use of this alphabet; but there is no doubt it was the official writing during the Yuen dynasty; and it appears to be the one known as the Mongolian character in the Chinese records of that period.\n\nPallas gives the same account of Bashpah's invention,\\(^1\\) derived apparently from a Mongol source; and the last plate in his work contains what he calls a specimen of Bashpah's square character,\\(^2\\) but he does not tell us where he got it. That plate has been repeatedly quoted as the first specimen of Bashpah's alphabet published in Europe; but I am very doubtful if Bashpah had anything to do with the character there given,\\(^3\\) or if Pallas had ever seen the writing invented\n\n\\(^1\\) Sammlungen historischer Nachrichten über die Mongolischen Völkerschaften, vol. ii. p. 358.\n\n\\(^2\\) Ibid. vol. ii. plate 22.\n\n\\(^3\\) When on a visit to the great lamasary Yung-ho-kung, in Peking, I observed in one of the temples a pall inscribed in the common Tibetan character, with a horizontal heading in a character which was unknown to me. I thought it of sufficient interest to take a copy of it, which I give here:\n\n```\nom a á e é i í u ú o ó k kh ng ch ch' gn t th n\npph m y r l b v j s ya g ds d' w sh k' b\nri ri li li kr\n```\n\nSubsequently, when I saw Pallas' work for the first time, I was surprised to find my copy almost identical with his plate, except\nby that celebrated lama; for it will be observed that all the known examples resemble much more closely the common Tibetan character, than does that of Pallas, which is evidently a modification of the Scharr form.\n\nIn the Appendix to Courtin's \"Encyclopédie Moderne,\" Klaproth, in an article on \"Grammaire générale,\" gives an alphabet which he calls \"Square Landsha,\" being nearer in resemblance to Bâshpah's than the preceding; but though some have taken it to be identical with his invention, I do not believe there is any direct connection between the two.\n\nSchmidt seems to ignore the existence of a separate alphabet under the name of Bâshpah, as having been ever used among the Mongols.\n\nRemusat says this alphabet was never used out of Tibet, notwithstanding the reiterated orders of the emperors. He promises to give an exemplar of the alphabet in his second volume, from the Suh hung keen luh, together with some explanatory details; but the second volume never appeared. Never having seen an instance of the employment of this character, he seems to have been unable to divest himself of the idea, that the invention of Bâshpah was nothing more than the application to the Mongolian language, of the common characters used by the Tibetans at the present day. That hypothesis however is totally refuted by the present inscription, where we have the Tibetan portion in the identical character used by that people now, and the Mongol portion in the Bâshpah character.\n\nKlaproth, while arguing for this writing having been used in China, says there are a great many medals of Kubla khan in existence, of which the legend is entirely or in part in the\n\nthat he gives an additional portion at the beginning and end; but he gives no explanation of what are the characters. I conclude, from examination, that they are simply the alphabet, and have identified the greater number with tolerable probability; believing that the additional ones given by Pallas are compounds.\n\n1 Plate 7.\n2 Forschungen im Gebiete der älteren religiösen, politischen, und literarischen Bildungsgeschichte der Völker Mittel Asiens.\n3 Recherches sur les langues Tartares, p. 193.\nsquare characters. These seem to be the only evidence that he was able to adduce of the use of this character in China. While I think it very doubtful however, whether there be any such medals of the reign of Kubla, it is very easy to understand how Klaproth should have been led into such a mistake. I have never seen any, or a description of any in Chinese books on medals; but I have a number of coins in the Bâshpah character, dating at various periods from 1308 to 1354.\n\nI have seen several stone slabs inscribed with this character, and notices of a good many more, the present one dating so late as 1345. In 1307, it is recorded that Polo Timor, a high dignitary, presented to the emperor a copy of the Hcaou king, or \"Book of Filial piety,\" written in the Bâshpah character, which the monarch ordered to be printed and circulated. I am only aware of one little book in that character having survived to the present day, i.e. the Pih kea sing, or \"Book of Surnames,\" which has been preserved by being reprinted in the King chuen pae peen, a work in 120 books, published in 1581, consisting of extracts from other works on every class of subjects. The eighty-first book is occupied exclusively with the reprint of the Pih kea sing; but so unmercifully mutilated are the characters, that without the Chinese key, it would have been an utter impossibility to have deciphered them. These facts then leave little doubt that this character was used to a considerable extent in China, till near the end of the Yuen dynasty.\n\nIn 1838, H. Conon von Gabelentz published the first specimen in Europe, of the actual employment of the character. This was an inscription in the Mongolian language, which he had extracted from a reprint of the Shih mih tseuen hwa, a Chinese work on lapidary inscriptions, first published in 1618.\n\nA silver plate with a gilt inscription in this same character, was found in 1846, in the district of Minusinsk and govern-\n\n---\n\n1 Mémoires relatifs à l'Asie, tome ii.\n2 Zeitschrift für die Kunde des Morgenlandes, vol. ii. p. 1, etc.\nment of Jenissei, in Eastern Siberia. This was deposited in the Asiatic Museum of the Academy of Sciences at Petersburg; and gave rise to a protracted controversy in various periodicals between Messrs. Habakkuk, Grigorief, Hyacinth, Schmidt, Schott, and Banzarof. Mr. Grigorief published a facsimile and an essay on the subject, in the Journal of the Administration of the Interior.\\(^1\\)\n\nAn edict in honour of Confucius published by the emperor Woo-tsung on his accession in 1307, was engraved in the Chinese language, and in the Chinese and Bashpah Mongol characters. An impression of the same is preserved in the Asiatic Museum at Petersburg, and a copy of it was given by Father Hyacinth in his work on the statistics of the Chinese empire.\\(^2\\)\n\nIn 1853, another silver plate, with an inscription similar to the preceding, was discovered at Verchni Udinsk, to the east of Lake Baikal; and is now preserved in the Hermitage Palace in Petersburg. An account of this was given by Mr. Savélief in the fifth volume of the Transactions of the Archaeological Society at Petersburg.\\(^3\\) These plates seem to have been signets given to military envoys, and those holding imperial commissions.\n\nIn an article on Sanscrit and Mongolian characters by Mr. Edkins, published in 1855,\\(^4\\) he has given a facsimile reproduction of the \\(Pth kea sing\\), from the King chuen pae peen.\n\nWithout knowing anything of what had been done by Von Gabelentz and the Russian orientalists, I chanced one day during the occupation of Shanghae city by the Triad rebels in 1854, to notice in the Confucian temple, an inscription in this character,\\(^5\\) which proved to be a transcript\n\n---\n\n\\(^1\\) Journal Asiatique, 5e série, pp. 527-558.\n\n\\(^2\\) Ibid. p. 526.\n\n\\(^3\\) Ibid. pp. 527-558.\n\n\\(^4\\) Transactions of the China Branch of the Royal Asiatic Society, part v. pp. 101-108 and 5 plates.\n\n\\(^5\\) The Confucian temple was afterwards burnt down, and this slab was broken and otherwise injured by the fire. When Shanghae was retaken by the imperialists, the temple was rebuilt in another part of the city, and most of the old tablets found a place in the\nof an edict by Kubla khan, the Chinese original of which was engraved below it. At some risk and trouble I procured a few impressions from this stone, and sent one of them, through Sir John Bowring, to the Royal Asiatic Society in London, where it still remains. A short article on the subject, by myself, appeared in the \"Transactions of the China Branch of the Royal Asiatic Society,\"¹ for 1855, giving a copy of the inscription in the Mongol and Chinese characters, and also cuts of several coins of the Yuen dynasty.² There is also a restoration of the commencement of the Pîh kea sing noticed above.\n\nIn 1860, M. Pauthier gave a French translation of the inscription which I had published in the Hongkong Transactions. This appeared in the Journal Asiatique,³ together with some interesting details on the Bâshpah alphabet.\n\nThe same year a very neat fount of type for this character was cast at the Imprimerie Impériale at Paris, under the instructions of M. Pauthier.\n\nAn article which I had written on the Mongolian inscrip-\n\nnew erection. This place was afterwards used as a lodging for the British officers during the military occupation of that city; and in their little arrangements to make things comfortable, all the inscribed tablets in the walls had been covered with plaster and whitewash. The Mongolian slab I could never find again, and on a visit to the place in company with Dr. Lamprey, he told me he had seen the stone in question used as a block for chopping on.\n\n¹ Part v. pp. 65–81.\n² I may be allowed here to notice some confusion that has taken place in the printing of that article. The cut of the coin to note || on page 55 is erroneously placed as note* on page 58. The note marked || at the foot of page 55 should be referred to the word Pîh, in the third line of page 56. The Mongol letter p, placed on its side, thus ||, on page 64, should be ||. The four Mongol characters at the top of page 65 are upside down. Engravings of some of these coins may be seen in an article by C. B. Hillier, on \"Chinese Coinage,\" in the Transactions of the China Branch of the Royal Asiatic Society, part ii., 1848–50, pp. 105–110; also in the works of De Chaudoir, Endlicher, and others, on Chinese numismatics. A special article by Pauthier, on one of these coins, appeared in the Journal Asiatique, 5me. série, tom. xv. pp. 321–337, 1860.\n³ Vol. xix. pp. 5–47.\ntion, translated and published by Von Gabelentz, in the \"Zeitschrift,\" was translated into French by M. Pauthier, and appeared in the Journal Asiatique for 1862.\\(^1\\)\n\nBoth this inscription and the edict of Kubla were reproduced with the new type, in the Appendix to Pauthier's splendid edition of Marco Polo.\n\nThe vertical portion to the right of the Mongol is in the Ouigour character, consisting of twenty lines in a large type and twelve in a smaller. The large character part corresponds almost literally throughout with the Sanscrit. There is no initial invocation, and the doxology at the end of the dhárani is a transcript of the Sanscrit, with one slight deviation.\n\nThe Ouigour branch of the Turkish race seem to have been in close proximity and intercourse with the Mongols during the Yuen dynasty. They are reported to have been in possession of an alphabet and literature from an unknown antiquity; and scholars are divided in their opinions as to the origin of their written character. The Syriac,\\(^2\\) the Sabæan,\\(^3\\) and the Zend,\\(^4\\) have each been proposed as the most probable source whence derived. The earliest mention of Ouigour literature is to be found in the Chinese records, about the middle of the fifth century, at which time we are informed that they possessed in their language Maou's \"Book of Odes,\" the \"Confucian Analects,\" and the \"Book of Filial Piety,\" besides some Poets and Historians.\\(^5\\)\n\nIn giving an analysis of a catalogue of Buddhist works, published in China in 1306, Professor Julien makes the following interesting remarks, bearing on Ouigour literature:\n\n\"The last preface dated in 1306, gives the names of twenty-nine savans versed in the Tibetan, Ouigour, Sanscrit, and Chinese languages, who were charged, as appears by the\n\n---\n\n\\(^1\\) Vol. xix. pp. 461–471.\n\\(^2\\) Remusat, Recherches sur les langues Tartares, p. 29, passim.\n\\(^3\\) Klaproth, Abhandlung über die Sprache und Schrift der Uiguren, p. 53.\n\\(^4\\) Davids, Grammaire Turke, p. xvi.\n\\(^5\\) Remusat, Recherches, etc., p. 284.\npreface of 1289, to compare the texts with each other, to collate the translations, and to revise and fix them definitively for the general re'impression. Their work, begun in 1285, was finished in 1287. Among these savans, we observe a Buddhist priest from Toufsan, versed in the knowledge of every branch of the sacred literature, who was charged by imperial order to verify the Indian words, and an academician, named To-in-tou-tong, who was commissioned to translate the Ouigour words. An extremely curious fact, unknown hitherto, seems to result from the last-named fact, that is, that the greater part of the Buddhist books must have been translated into Ouigour for the use of the subjects of the Chinese empire who spoke that language. This conjecture is fully justified by the following testimony. I read in the history of celebrated Buddhists, published under the Sung in 988, a passage which shows that anciently the Buddhist books were translated, not only in Tibetan and in Chinese, but also in the languages of people now under submission to the Chinese, and whom the latter treated as barbarians:—'When the Sutras and works on discipline from India were taken to Koutché, on the north of the Tsung-ling mountains, to Lèou-lan, to Kharachar, to Khotan, and to Khashgar, the natives not understanding the language of India, the books were translated for them into the barbarian languages which they spoke.' Now several of the above-named countries, which at present form part of Bucharia, were previously occupied by Ouigour tribes, at the epoch when our catalogue was published. Scarcely more than two or three Ouigour manuscripts are known in the great libraries of Europe; should there exist then at Peking any considerable portion of the Buddhist books in this ancient dialect of oriental Turkish, so precious for philology, and so little known, it would be an object of the highest interest, to purchase them there at any price, and to place them within the reach of scholars.\"\n\nOf the very few specimens of the ancient language and\n\n1 Mélanges de Géographie Asiatique, pp. 223, 224.\nliterature of the Ouigours known in Europe, the oldest of the manuscripts does not date earlier than the 10th century.\\(^1\\)\n\nWhen the Mongols under Genghis khan began to attain their immense power, they were a comparatively unpolished people, and possessed no literature of their own. On the defeat of the Naimans by that nation, Tatatonggo, the secretary of the Naiman prince, a Ouigour by birth, was made prisoner; but was instated by Genghis as Professor of the Ouigour language and literature, for the benefit of his subjects, the princes and nobles of the Mongol nation.\\(^2\\) Being thus initiated into the literature of the Ouigours, as a matter of necessity the Mongols had naturally fallen into the habit of using the same character for the purpose of committing their own language to writing; and this practice continued to prevail during the supremacy of Ogdai, Guyu, and Manggu, the three successors of Genghis khan. Ruysbruk, who went on an embassy to the Mongolian court, from France, in 1253, speaking of the Ouigour characters, says:—“Mangu khan has sent to your Majesty (St. Louis) letters written in the Mongol or Tartar language, but in Ouigour characters.”\\(^3\\)\n\nWhen the dynasty took possession of China, under the succeeding monarch, Kubla, and the exigencies of a fixed government were more urgent, the inadequacy of the Ouigour character fully to express the articulations and vocables of the Mongol language were felt to be a source of embarrassment. As, it would seem, no man among the Mongols was found to possess sufficient philological tact and inventive skill to remedy this inconvenience, the venerable Tibetan lama Saadja Bandida, under special invitation, took up his residence at the court of Kubla, and applied himself to the task of so modifying the Ouigour character as to adapt it to the requirements of the Mongol. In his scheme he had retained the fourteen Ouigour consonants, but he died while engaged on the work, leaving it still incomplete. The result was, the\n\n---\n\n\\(^1\\) Davids, Grammaire Turke, p. xviii.\n\n\\(^2\\) Ibid. p. xviii. Klaproth, Abhandlung über die Sprache und Schrift der Uiguren, pp. 54, 55.\n\n\\(^3\\) Klaproth, Abhandlung, etc., p. 56.\ninvention by his successor, Bâshpah, of the Mongolian alphabet noticed above. Although the latter was promulgated in 1269, as the official character of the dynasty, yet in 1272, we find a memorial to the throne complaining that the officials persist in writing their documents in the Ouigour character. An edict followed thereupon, condemning the practice, and insisting upon the adoption of Bâshpah’s character. In 1278 the use of the Ouigour character on the military signets was forbidden. In 1284, an imperial decree forbade the use of the Ouigour character in all memorials and documents presented by the metropolitan functionaries.\n\nAbout the beginning of the 14th century, Eldjaïtu, the successor of Kubla, commissioned the priest Tsordji Osir to translate the Tibetan sacred books into the Mongolian language, and write them out in the Bâshpah character. The lama, however, failed in the attempt; and in order to supersede the difficulty, he reverted to the unfinished work of Saadja Bandida, made such additions as were needful for his purpose, and wrote out with it a Mongol translation of the Tibetan work Bangcha Ruktcha, but found it necessary to express a great many words in Tibetan characters.\n\nUnder the direction of Kaisun-killik, the succeeding Emperor, who reigned from 1307 to 1311, Tsordji Osir made such further additions as were needful for adapting the Ouigour alphabet to the perfect transcription of the sounds of the Mongol language. These details, drawn mostly from Klapproth’s “Abhandlung über die Sprache und Schrift der Uiguren,” are found in the Chinese history of the Yuen dynasty, and also in a Mongol work, Brulba Saagdja Bandida yin gar-gaksan Mongol Usuk, “The Mongol literature invented by the holy Saagdja Bandida,” published in China in 1730.¹\n\nAhmed Ibn Arabschâh, an Arabian author, who wrote about 1440, gives a short notice of the Ouigour alphabet, in which he says:—“The Djaghatâiens have a writing which they call Ouigour, and which may be recognized as the same\n\n¹ See Remusat’s Recherches, etc. p. 154. Pallas, Sammlungen, etc. vol. ii. p. 356. Klapproth, Abhandlung, etc. p. 57.\nas that of the Mongols; it is composed of fourteen consonants, which have the forms following.\" Here he inserts a copy of the Ouigour alphabet.\n\nThe work above named, Brulba, etc., also gives a table of the fourteen consonants of the Ouigours, combined respectively with the three vowels, \\(a\\), \\(â\\), and \\(i\\), as used by the Mongols, previous to the improvement of the lamas. It is doubtful, however, if this be altogether trustworthy; for we find nothing in it to represent the vowel \\(o\\), a letter which is of constant occurrence in the specimens of Ouigour literature preserved in Europe. Were it not so, I should have been disposed to think that in the present transcription we had a specimen of the writing in a transition stage; but from the close resemblance which it bears to the caligraphy of the two Mongolian letters discovered by Remusat in the archives of France, I have no doubt that it is a pure specimen of the character as used by the Ouigours. These two letters,—addressed to Philip the Fair of France, the first by Argun, the Mongol prince of Persia, in 1289; and the second by Eldjaitu, his successor, in 1305;—were thought by Remusat to be in the original Ouigour character, though the documents are in the Mongol language.\n\nIn 1845, a silver plate similar to the signets bearing the Bâshpah superscriptions noticed above, but having the superscription in the Ouigour character, was found at Grouchovka, on the Dnieper, in the government of Ekatérinoslaf, in Southern Russia. A report on this plate was made to the Academy of Sciences at Petersburg, in 1848, by Mr. Banzarof, which was published in their \"Bulletin historico-philologique,\" with a facsimile engraving; from which we see that the writing is almost identical with that on the in-\n\n---\n\n1 Langlès, in Notices et Extraits des Manuscrits de la Bibliothèque Royale, tom. v. Klaproth, Abhandlung, etc. p. 56. In his Mémoires relatifs à l'Asie, tom. ii. p. 318, he gives a facsimile of this alphabet.\n\n2 Klaproth, Abhandlung, etc. p. 57.\n\n3 See \"Mémoires sur les relations politiques des princes Chrétiens, et particulièrement des rois de France, avec les empereurs Mongols.\"\n\n4 Tome v. article 9. 1848.\nscription now under consideration. As we know that the use of the Ouigour character on these signets was prohibited in 1278, it must have been made previous to that date.\n\nThe portion to the right of the Ouigour is in the Neuchih character, consisting of twenty-seven lines of large size and twenty-one lines of a smaller type. The large character portion is almost a counterpart of the Sanscrit, down to about the middle of the twenty-fifth line, where the dhárani concludes. It commences with the invocation Om bhūr om svāhā, the same as the Chinese and others, and the portion following the dhárani is evidently a doxology, though I have only succeeded in identifying a small portion of it.\n\nAlthough the name of this writing is not unknown to orientalists, yet beyond the name very few facts have been gathered; and this inscription I believe to be unique, not only as giving a correct specimen of the caligraphy, but as being the only piece yet discovered, in which there is any clue to the powers of the characters.\n\nThe Neuchih Tartars succeeded the Tsitans as the dominant power in the north of China, in the early part of the 12th century, under the name of the Kin dynasty. Originally a rude unlettered tribe, they were dependent upon the Chinese and Tsitans for their correspondence and literary negotiations; but they learned to rise with their position, and it was not long ere they began to feel the inconvenience of transacting their diplomacy through interpreters in an alien language. Impressed no doubt with the importance of possessing a national literature, the preliminary necessity of a written character capable of expressing the sounds of their language became apparent. They saw that their predecessors and vanquished rivals, the Tsitans, had been placed at a similar disadvantage at the beginning of their rule, and had invented a character which had been the national writing of the Leaou dynasty for about two hundred years.¹ Following their precedent, Akuta, the founder of the Kin, resolved upon\n\n¹ I only know of the existence of one inscription in this character, and as there is no translation of it in Chinese or any other language,\nhaving special resources for reducing to writing the language of his tribe; and having among his captives many subjects of the Chinese and also of the Leaou, a special study was made of the literature of these two nations. The result was that an imperial commission, consisting of Ouyé, Moulianho, and Kuhshin, was appointed to form a new set of symbols, from the elements of the Chinese pattern-hand characters, on the same principle as those of the Tsitan, but adapted to the sounds of their national language.\\(^1\\) In a few months the characters were formed, and an imperial decree issued in the eighth month of the year 1119, ordered their general adoption.\\(^2\\) In 1138, He-tsung, the third emperor, originated a new set of characters for the Neuchih language, and these were named Small Neuchih characters; while those which Kuhshin and his colleagues had invented were termed the Large Neuchih characters.\\(^3\\) The small characters were brought into use officially, in the fifth month of the year 1145.\\(^4\\)\n\nThe Vandalism attendant on the overthrow of dynasties in China, has been especially destructive to the literary productions of the conquered party, and it is scarcely to be expected that many traces of the literary ingenuity of the Neuchih would survive their subjection to another race. A note to the *Suh wan heen t'ung k'aou* tells us that the Chinese Classics and Histories were translated in this character; and a catalogue of the imperial library during the Ming\\(^5\\) gives it remains at present a dead letter. The following five characters are preserved with their interpretation in the Chinese \"Topography of Ching-tih prefecture.\" \n\n- 支 (as used by the emperor);\n- 支 To run;\n- 马 Horse;\n- 急 Urgent.\n\nThe history of the Leaou dynasty speaks of an edict having been engraved on stone, in the characters of the Tsitans, Turks, and Chinese, but I am not aware if that inscription is still extant.\n\n\\(^1\\) *Suh wan heen t'ung k'aou*, book 184, p. 31. De Mailla, *Histoire générale de la Chine*, tom. viii. p. 390.\n\n\\(^2\\) *Kin she*, book 2, p. 14. *Hung keen luh*, book 214, p. 14.\n\n\\(^3\\) *Suh wan heen t'ung k'aou*, book 184, p. 31. *Hung keen kang muh Suh peen*, book 10, p. 42.\n\n\\(^4\\) *Kin she*, book 3, p. 27. *Hung keen luh*, book 215, p. 13.\n\n\\(^5\\) *Wan yuen ko shoo müh*, book 18, p. 2.\nthe titles of fifteen works in the Neuchih character. Whether any of these are still in existence is I think at least doubtful, but M. Rosny expresses a more hopeful view of the case.¹\n\nThat the language and literature of the Neuchihs did not at once disappear with the extinction of the dynasty we have evidence, for in 1407, when a translatorial institution was established by the Ming, for the purpose of facilitating correspondence with foreign nations, one of the languages to which special attention was directed was the Neuchih. The students were examined periodically, and the most efficient appointed to offices in connection with the embassies. In 1470 seven interpreters were officially designated for the Neuchih language, and the number was afterwards increased to nine. The translatorial office was re-established on the accession of the present dynasty in 1644, with a president and corps of fifty-six professors. Long before this, however, it is probable that the cumbrous Neuchih character had become obsolete, for in the accounts we have of the invention or rather adaptation of the present Manchu character, there is no hint of any kind of writing in existence peculiar to the tribe. The Manchus being the actual descendants of the Kin dynasty Neuchihs, there would scarcely be a distinct language, and we consequently find the Neuchih department of the translators’ office suppressed in 1659, and the ancient Neuchih character entirely superseded by the modern Manchu.\n\nRemusat, in his “Recherches sur les langues Tartares,” has written at greater length on this subject than any other European author, having collected together what few notices he could find in Chinese works; but having never seen a\n\n¹ He says: “When the friends of science shall have undertaken scientific journeys, for the purpose of exploring the great public and private libraries of China, libraries whose number is immense, and the preservation of which has been the object of the greatest care and attention, we shall doubtless find the greater part of the literary monuments for which we are now anxious, and a number of others, which will prove so many revelations in the midst of this old Chinese world, whose destiny on earth may probably have been to preserve to us vestiges of primitive and forgotten ages in the history of the globe.”—Revue Orientale et Américaine, 1ᵉ série, tom. vi. pp. 386, 387.\nspecimen of the Neuchih writing, he was induced by the descriptions to believe that the character now used by the Coreans was identical with that of the Kin dynasty. This hypothesis at least we are now in a position to meet with a direct negative. An inscription in an unknown character, at the Imperial Mausoleum at Keen-chow, in the Province of Shense, has been preserved to us in a Chinese work published in 1618, the 石墨鐫華 Shih mih tseuen hwa.\\(^1\\) From a Chinese translation and note given on the tablet, we learn that this is an inscription in the Neuchih or national character of the Kin dynasty. The date given is 1134, from which we see that it was cut previous to the invention of the Small Neuchih character; so that there is no doubt we have there a specimen of the Large Neuchih character, invented by Kuhshin and his colleagues.\n\nA facsimile of this inscription from the Che püh tsüh chae ts'ung shoo, was published by Professor Neumann in 1837, in regard to which he remarks:—“I am not able to read the Kin writing, much less to translate it; but it is obvious from the frequent repetitions of characters in the text of our memorial that this Kin writing consists of a syllabary composed of abbreviated and modified Chinese characters.”\\(^2\\)\n\nShortly after this the same inscription seems to have attracted the attention of the Archimandrite Habakkuk, while he was residing at Peking, and he communicated it to Father Hyacinth at Petersburg in 1841. The latter gave a facsimile of the same in his work on the statistics of China.\\(^3\\)\n\nI was not aware of this inscription having been noticed or\n\n---\n\n\\(^1\\) This work was reprinted during the present dynasty, in a collection entitled 藝圃搜奇 Epoo sow ke. It was also reprinted in a reduced form in the 知不足齋叢書 Che püh tsüh chae ts'ung shoo, published in the 18th century. The same inscription is reproduced in the 金石萃編 Kin shih tsuy peen, published in 1805. It is noticed in several other works on lapidary inscriptions.\n\n\\(^2\\) Asiatische Studien, p. 41.\n\n\\(^3\\) See Journal Asiatique, 5e série, tom. 17, p. 532.\npublished by any one in Europe, when it occurred to me to collect what information I could regarding the system of writing used by the Neuchih; and the inscription in question, which I found in the Shih mih tseuen hua, being the only specimen of the character that I could discover, I forwarded a facsimile, with some remarks, to the Asiatic Society in 1859. The same appeared in the Society's Journal the following year.¹\n\nIn 1861, Professor de Rosny, of Paris, published an article on \"The Neuchih, their language and literature,\"² by which it appears he has misunderstood my remarks; but he expresses, with considerable confidence, his belief that the writing is ideographic and not alphabetic. Although my opinion was decidedly in favour of the Neuchih being an alphabetic or syllabic writing, I find, on referring to my former article, that I scarcely expressed such a view, preferring to leave the question to be decided when we should acquire more light on the subject. It was something novel to me to find M. de Rosny advocating the ideographic as the most probable, to the exclusion of the alphabetic, and I regret that he has not given us a fuller development of his reasons, for, from his extensive knowledge of the written characters of various nations, probably few are in a more favourable position to form a correct appreciation of the matter.\n\nIf my tendency was formerly towards the alphabetic theory, my views are now so far modified by the analysis of the newly-found inscription, that I incline to the view at first expressed by Professor Neumann, that the Kin was a syllabic writing.³\n\n¹ Journal of the Royal Asiatic Society, vol. 17, pp. 331, passim.\n² \"Revue Orientale et Américaine,\" 1re série, tome 6, pp. 379–387.\n³ The accompanying cut, taken from a Chinese brochure on coins, which has merely the title 外國錢文 Wae kuō tseen uan, \"Superscriptions of foreign money,\" is termed a \"Sanscrit character coin;\" but as the character bears no resemblance to any known form of Sanscrit writing, and as it presents a strong similarity to that on the Keen-chow tablet, I am induced to think it is\nHaving ascertained, then, with tolerable certainty that the preceding inscription is a specimen of the Large Neuchih character; and being assured that the one with which we are now occupied is also Neuchih—observing the radical difference in the formation of the characters; we are shut up to the conclusion that this is a specimen of the Small Neuchih character, invented in 1138. The date is more than two centuries later, being 1345.\n\nThanks to the transcripts in the other characters, and especially the Sanscrit, there are scarcely any of the Neuchih in the larger size part to which I cannot attach the sounds with a high degree of probability, if not absolute certainty. The conclusion at which I have arrived is given in the plate facing this page.\n\nThe last character in the list 龍龜 to which I have not put any sound, is one of very frequent occurrence, being found 39 times; that is, it is distinctly legible 33 times, and in six other places I have supplied it, as I think, on unquestionable authority. It is to be noticed that in every case this is written smaller than the other characters; a peculiarity which belongs only to two or three others in certain places, and appears to me to indicate that the sign so written plays a secondary part in the syllable. Another peculiarity which attaches to 龍龜 is, that while every other Neuchih sign is represented by a corresponding one in Chinese, there is in no case any counterpart to this in Chinese. Of the 39 places where it is found, 30 times it stands against the long vowel á; i.e. in á, 2; bá, 1; dá, 1; ddáhá, 1; há, 7 (3 of which I have supplied); ká, 1; má, 2; ná, 3 (one of which I have\n\na relic of the Kin. The paucity of documents in that character may warrant its insertion here. The explanatory note says:—\"This Sanscrit character coin is eight-tenths of an inch diameter, and weighs 3 choo (銖) 6 ts'au (參). It is copper, of a pure red colour. The superscription is undecipherable, but it bears a general resemblance to the coins of 屋駝 Uh-t'o and Turfan (or Tibet).\"\nsupplied); pā, 1; svā, 1; tā, 2; thā, 7 (one of which I have supplied); yā, 1; and twice it is found against the long vowel ā; i.e. in bhā, 1; pū, 1. Seven times it is found appended where there is no long vowel in the Sanscrit, of which four of the syllables end in a; i.e. na, 1; ra, 1; ta, 1; ya, 1;¹ one ends in e; i.e. ddhe; and two end in i, i.e. ddhi, 1; and ti, 1 (which I have supplied).\n\nFrom the preceding analysis of 39 occurrences of this character, I am disposed to think that it is a sign indicating the lengthening of the vowel in the syllable to which it is attached, and that the seven (or perhaps six) exceptions are irregularities.\n\nSuch is the result of the inscription on the east side of the arch, and the decipherment of the west side would probably add a few more to the number of the identified vocables. From an examination of these 81 characters, I am convinced that the Neuchih writing was pre-eminently syllabic, and not alphabetic, as I inferred on a former occasion. The selection of symbols appears to me to be the most arbitrary, nor can I see any approach to principle or mutual relation in comparing the one with the other. Not only do we find the utmost diversity in the forms of any series of syllables we may select, classified either according to their initials or finals, or any other principle that I can think of; but there are also characters nearly similar in form, which express widely different sounds.\n\nThus the characters .va and .wa, although nearly allied phonetically, are yet totally unlike in every part. If there is any difference in sound between mān and mān, it is merely one of tone, as indicated by the Chinese equivalents; and yet their forms would never lead any one to suspect a phonetic connection. So also the two characters for ga and , although so utterly dissimilar, yet they represent precisely the same syllable. Again, if we have diversity of forms corresponding to similar sounds, there are also similar forms answering to very different sounds; thus ki only differs by one stroke from va.\n\n¹ It is doubtful if this syllable ought not to be yā.\nIt would seem as if a number of Chinese characters had been selected to represent the sounds in the Neuchih language, on the plan adopted by the Japanese, but abbreviated and disfigured after a fashion of their own, to which we have now no key. While the original or Large Neuchih characters, of which the specimen at Keen-chow has been published, show some traces of the form of Chinese, this latter invention of the Small Neuchih characters appears to be a more elegant and abbreviated form, in which the slight traces retained in the earlier invention are altogether obliterated, and the faintly-pictorial forms of which each character was made up are represented by merely conventional collocations of strokes. Thus we have all the cumbrous variety of a pictorial system adapted to the expression of a simple series of vocables. The scheme is, probably, unique in the history of chirography, and is not a little suggestive in reference to the condition of the people among whom it took its rise. It seems strange that a complex syllabary like this should have been adopted by a people living so near the tribes who were using the simple Ouigour alphabet, and would imply a very restricted intercourse with such tribes. Instead of wondering that such a method of writing should be neglected and become obsolete, we may rather be astonished that it was able to maintain its ground for two centuries and more, as is proved by this inscription.\n\nIt is probable that the eighty-one signs here given are but a small portion of the Neuchih syllabary, as it is not at all likely that the simple sounds of the Sanscrit alphabet would anything like exhaust the vocables of the Neuchih language. Accordingly we find in the twenty-one lines of small characters at the end of the large, a great number of new ones which do not occur in the preceding portion. Now as every several character has to be learned by itself, and the knowledge of any one or more gives no clue to what is the sound of another, here is a study of a much more difficult nature.\n\nI have mentioned that each of the parts except the Sanscrit concludes like this, with some lines in a smaller size character. On looking over the Chinese part, I saw at once that\nthat was not a mere transcript of foreign sounds, but a veritable piece of composition in the Chinese language. Although very much defaced and obliterated, I have been able to get an approximate sense out of the several detached fragments, though the omission of so many links necessarily prevents a perfect translation even of what remains.\n\nHaving shown the Tibetan portion to Professor Foucaux, at Paris, I ascertained from him that that was in the Tibetan language, and not a transliteration from another tongue. From a cursory inspection of that hopelessly imperfect portion, he could give me the meaning of such fragments, that I felt assured, if it was not the exact translation of the Chinese, it was at least the same in substance.\n\nA superficial examination of the Mongol portion satisfied me that that was also in the Mongol language; and the Ouigour portion seems to be in the Ouigour language. Under these circumstances, the presumption is almost a certainty that the small-size Neuchih is a specimen of the Neuchih language as well as writing. This imparts an additional interest to it; and while the difficulty of interpretation is thereby increased, its philological value is greatly enhanced.\n\nAppended is an interlinear restoration of the inscription, and the sounds of the syllables given in Latin characters, according to the Sanscrit. The columns coincide in length and number with the original lines of the Neuchih portion, and the corresponding syllables in each of the six lines are placed horizontally opposite, as near as the peculiarities of the respective systems will admit. The portion in black is what is preserved of the original inscription, and the missing parts which have been supplied are represented by the red.¹\n\n¹ A reduced facsimile of the four vertical portions of the inscription, produced by photo-lithography, from the original rubbing, will appear in Col. Yule's forthcoming work on Marco Polo.\nGoldstückner.—Panini: His Place in Sanskrit Literature. An Investigation of some Literary and Chronological Questions which may be settled by a study of his Work. A separate impression of the Preface to the Facsimile of MS. No. 17 in the Library of Her Majesty's Home Government for India, which contains a portion of the Manava-Kalpa-Sutra, with the Commentary of Kumarila-Swamin. By Theodor Goldstückner. Imperial 8vo., pp. 268, cloth.\n\nGoldstückner.—A Compendious Sanskrit-English Dictionary, for the Use of those who intend to read the easier Works of Classical Sanskrit Literature. By Theodor Goldstückner. Small 4to., pp. 900, cloth. [In preparation.]\n\nGrammatography. A Manual of Reference to the Alphabets of Ancient and Modern Languages. Based on the German Compilation of F. Ballhorn. In one volume, royal 8vo., pp. 80, cloth. 7s. 6d.\n\nThe \"Grammatography\" is offered to the public as a compendious introduction to the reading of the most important ancient and modern languages. Simple in its design, it will be consulted with advantage by the philological student, the amateur linguist, the bookseller, the corrector of the press, and the diligent compositor.\n\nHaug.—Outline of a Grammar of the Zend Language. By Martin Haug, Dr. Phil. 8vo., pp. 82, sewed. 14s.\n\nHaug.—Essays on the Sacred Language, Writings, and Religion of the Parsees. By Martin Haug, Dr. Phil., Superintendent of Sanskrit Studies in the Poona College. 8vo., pp. 278, cloth. Out of print.\n\nHaug.—The Aitareya Brahmanam of the Rig Veda: containing the Earliest Speculations of the Brahmans on the meaning of the Sacrificial Prayers, and on the Origin, Performance, and Sense of the Rites of the Vedic Religion. Edited, Translated, and Explained, by Martin Haug, Ph.D., Superintendent of Sanskrit Studies in the Poona College, etc., etc. In 2 Vols., cr. 8vo. Vol I. Contents, Sanskrit Text, with Preface, Introductory Essay, and a Map of the Sacrificial Compound at the Soma Sacrifice. pp. 312. Vol. II., Translation, with Notes. pp. 544. £3 3s.\n\nHernisz.—A Guide to Conversation in the English and Chinese Languages, for the Use of Americans and Chinese in California and elsewhere. By Stanislas Hernisz. Square 8vo., pp. 274, sewed. 10s. 6d.\n\nThe Chinese characters contained in this work are from the collections of Chinese groups, engraved or steel, and cast into moveable types, by Mr. Marechlin Legrand, Engraver of the Imperial Printing Office at Paris. They are used by most of the Missions to China.\n\nHoffman.—Shopping Dialogues, in Japanese, Dutch, and English. By Professor J. Hoffman. Oblong 8vo., sewed. 3s.\n\nJusti.—Handbuch der Zend-Sprache van Ferdinand Justi. Altbactrisches Wacerbuch. Grammar Chrestomathic. Four parts 4to. sewed, pp. xxii. and 424. Leipzig, 1864. 24s.\n\nKidd.—Catalogue of the Chinese Library of the Royal Asiatic Society. By the Rev. S. Kidd. 8vo., pp. 58, sewed. 1s.\n\nLegge.—The Chinese Classics. With a Translation, Critical and Exegetical, Notes, Prolegomena, and Copious Indexes. By James Legge, D.D., of the London Missionary Society. In Seven Vols. Vol. I., containing Confucian Analects, the Great Learning, and the Doctrine of the Mean. 8vo., pp. 526, cloth. 42s.\n\nVol. II., containing the Works of Mencius. 8vo., pp. 634, cloth. 42s.\n\nVol. III., Part 1, containing the first parts of the Shoo-King, or the books of T'ang; the books or Yu; the books of Hea; the books of Shang; and the Prolegomena. 8vo., pp. 291, cloth. 42s.\n\nVol. III., Part 2, containing the fifth part of the Shoo-King, or the books of Chow; and the Indexes. 8vo., pp. 453, cloth. 42s.\n\nManava-Kalpa-Sutra; being a portion of this ancient Work on Vaidik Rites, together with the Commentary of Kumarila-Swamin. A Facsimile of the MS. No. 17 in the Library of Her Majesty's Home Government for India. With a Preface by Theodor Goldstückner. Oblong folio, pp. 268 of letterpress and 121 leaves facsimiles. Cloth. 47. 4s.\n\nMedhurst.—Chinese Dialogues, Questions, and Familiar Sentences, literally rendered into English, with a view to promote commercial intercourse and assist beginners in the Language. By the late W. H. Medhurst, D.D. A new and enlarged edition. pp. 226. 8vo. 18s.\n\nMorley.—A Descriptive Catalogue of the Historical Manuscripts in the Arabic and Persian Languages preserved in the Library of the Royal Asiatic Society of Great Britain and Ireland. By William H. Morley, M.R.A.S., 8vo., pp. viii. and 160, sewed. London, 1854. 2s. 6d.\nMuir.—Original Sanscrit Texts on the Origin and History of the People of India, their Religion and Institutions. Collected, Translated into English, and illustrated by Remarks, by J. Muir, D.C.L., LL.D. Vol V. Contributions to a Knowledge of the Cosmogony, Mythology, Religious Ideas, Life and Manners of the Indian in the Vedic Age. 8vo., pp. xvi. and 492, cloth. 21s.\n\nRam Raz.—Essay on the Architecture of the Hindus. By Ram Raz, Native Judge and Magistrate of Bangalore, Corresponding Member of the R.A.S. of Great Britain and Ireland. With 48 Plates. 4to., pp. xiv. and 64, sewed. London, 1834. Original selling price, 1l. 11s. 6d., reduced (for a short time only) to 12s.\n\nRawlinson.—A Commentary on the Cuneiform Inscriptions of Babylonia and Assyria, including Readings of the Inscription on the Nimrud Obelisk, and a brief Notice of the Ancient Kings of Nineveh and Babylon. Read before the Royal Asiatic Society, by Major H. C. Rawlinson. 8vo., pp. 84, sewed. London, 1850. 2s. 6d.\n\nRawlinson.—Outlines of Assyrian History, from the Inscriptions of Nineveh. By Lieut.-Colonel Rawlinson, C.B., followed by some Remarks by A. H. Layard, Esq., D.C.L. 8vo., pp. xlii., sewed. London, 1852. 1s.\n\nRenan.—An Essay on the Age and Antiquity of the Book of Nabathlean Agriculture. To which is added, an Inaugural Lecture on the Position of the Semitic Nations in the History of Civilization. By M. Ernest Renan, Membre de l'Institut. In 1 Vol., crown 8vo., pp. xvi. and 148, cloth. 3s. 6d.\n\nRig-Veda Sanhita; a Collection of Ancient Hindu Hymns, constituting the Fifth to Eighth Ashtakas or Books of the Rig-Veda, the Oldest Authority for the Religious and Social Institutions of the Hindustans. Translated from the original Sanskrit by the late Horace Hayman Wilson, M.A., F.R.S., etc. Edited by E. B. Cowell, M.A., late Principal of the Calcutta Sanskrit College, and now Professor of Sanskrit at Cambridge. Volume IV., 8vo., pp. 214, cloth. 14s.\n\nA few sets of Volumes I., II., and III., £4 4s. [Fols. V. and VI. in the press.]\n\nSchlagintweit.—Buddhism in Tibet: illustrated by Literary Documents and Objects of Religious Worship. With an account of the Buddhist Systems preceding it in India. By Emil Schlagintweit, LL.D. With a Folio Atlas of 20 Plates, and 20 Tables of Native print in the Text. Royal 8vo., pp. xxiv. and 404. 2l. 2s.\n\nVishnu-Purana. A System of Hindu Mythology and Tradition. Translated from the Original Sanskrit, and Illustrated by Notes derived chiefly from other Puranas by Horace Hayman Wilson. Thoroughly Revised and Edited, with Notes, by Dr. Fitz-Edward Hall. In six vols. 8vo. Vol. I., pp. 340. Vol. II., pp. 340. Vol. III., pp. 348. Vol IV., pp. 346. Vol. V., cloth. 10s. 6d. each. [Vol. VI. in preparation.]\n\nWilson.—Works by the late Horace H. Wilson, M.A., F.R.S., Member of the Royal Asiatic Societies of Calcutta and Paris, and of the Oriental Society of Germany, etc., and Boden Professor of Sanskrit in the University of Oxford. Vols. I. and II.—Also under this title, Essays and Lectures, chiefly on the Religion of the Hindus, by the late H. H. Wilson, M.A., F.R.S., etc., etc. Collected and Edited by Dr. Reinhold Rost. In 2 vols. 8vo., cloth. 21s.\n\nWilson.—Essays, Analytical, Critical, and Philological, on Subjects connected with Sanskrit Literature. By the late H. H. Wilson. Collected and Edited by Dr. Reinhold Rost. In 3 vols., 8vo., cloth. 36s.\n\nWilson.—The Present State of the Cultivation of Oriental Literature. A Lecture delivered at a Meeting of the Royal Asiatic Society, by the Director, Professor H. H. Wilson. 8vo., pp. 26, sewed. London, 1852. 6d.\n\nWilson.—Select Specimens of the Theatre of the Hindus, translated from the Original Sanskrit. By Horace Hayman Wilson, M.A., F.R.S. Second Edition. 2 vols., 8vo. pp. lxx. and 334, 415, cloth. 15s.\n\nWise.—Commentary on the Hindu System of Medicine. By T. A. Wise, M.D., Bengal Medical Service. 8vo., pp. xx., and 432, cloth. 7s. 6d.\n\nLONDON: TRÜBNER & Co., 8 AND 60, PATERNOSTER ROW.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/translationremar00wyli.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 56380, "total-output-tokens": 21207, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 185, 1], [185, 1815, 2], [1815, 1815, 3], [1815, 1815, 4], [1815, 1815, 5], [1815, 1815, 6], [1815, 3687, 7], [3687, 5771, 8], [5771, 8595, 9], [8595, 10760, 10], [10760, 12894, 11], [12894, 14996, 12], [14996, 17217, 13], [17217, 19564, 14], [19564, 21952, 15], [21952, 24175, 16], [24175, 26335, 17], [26335, 28534, 18], [28534, 30475, 19], [30475, 32633, 20], [32633, 34692, 21], [34692, 36831, 22], [36831, 39212, 23], [39212, 41258, 24], [41258, 43360, 25], [43360, 45556, 26], [45556, 47685, 27], [47685, 49873, 28], [49873, 52040, 29], [52040, 54361, 30], [54361, 56763, 31], [56763, 58841, 32], [58841, 60952, 33], [60952, 62993, 34], [62993, 62993, 35], [62993, 62993, 36], [62993, 65109, 37], [65109, 67332, 38], [67332, 69273, 39], [69273, 69273, 40], [69273, 73714, 41], [73714, 77707, 42]], "primary_language": ["en", "en", "zh", "None", "zh", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false]}}]