[{"id": "4134e2540a35ad6e4de02654a663b7f3ee12f551", "text": "TRANSACTIONS\n\nOF THE\n\nKOREA BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY\n\n韓 大\n\nVOL. I.\n\nSupplied gratis to all Members of the Society.\n\nPrice to Non-Members, Yen 3.\n\nON SALE AT\n\nSeoul, Korea: Hon. Librarian.\nYokohama, Shanghai, Hongkong, Singapore: Kelly, & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co. Ltd.\nParis: Ernest Leroux.\nBerlin: Otto Harrassowitz.\nNew York: Geo. Stechert.\nCONTENTS.\n\nThe Influence of China upon Korea..........................1\nKorean Survivals.............................................25\nColossal Buddha at Eun-jin.................................51\nMinutes of General Meetings...............................71\n\nAppendix:\n\nOffice Bearers..............................................78\nList of Members..............................................79\nConstitution and By-laws.................................80\nExtract from a Letter received from the Honorary Secretary of the Royal Asiatic Society.\n\n\"* * * I am desired to inform you that a resolution was passed and is entered in our Minutes accepting your Society as a Branch of the Royal Asiatic Society duly affiliated under our rules.\"\nTHE INFLUENCE OF CHINA UPON KOREA.\n\nBY REV. JAS. S. GALE, B.A.\n\nFor three thousand years the Great Empire (大國 Ta-guk) has forced its history and teachings upon the little Eastern Kingdom (東國 Tong-guk), with evident desire to annex the same, not so much by force of arms as by appropriating the thoughts and minds of men. How well she has succeeded let us endeavour to see.\n\nKorea, in her relations with China, has ever been called the East Kingdom or Eastern State (東國 Tong-guk or 東方 Tong-bang), while China is none other to her than Ta-guk, the Great Empire, or Chung-guk (中國), the Middle Kingdom. This in itself, by its expression of relationship, will give a hint as to the influences that have been at work through the centuries gone by.\n\nIn a brief survey of this influence it will be necessary to note first just at what periods the Empire has touched the Peninsula.\n\nIn 1122 B.C. the Viscount of Keui (箕子), a man great in the history of China, who refused allegiance to the one that let him out of prison because in his mind he was a usurper, and swore unending fealty to the tyrant that put him there, because in his mind he ruled by the divine right of kings—this Chinaman, Keui-ja (箕子), made his way to the East Kingdom, set up his capital in P'yŏng-yang (平壤), and became, first and foremost, the father of Korea. Being a famous scholar, the author, no less, of the Great Plan (洪範 Hong-pum), one of the most important sections of the Book of History, it is not surprising that his name has come down to us over a period of three thousand years.\n\nIn his train came some five thousand followers, men who were equally faithful to the traditions of the fathers, and who refused allegiance to the usurping Chus (周). [This inter-\npretation of loyalty exists so universally in the minds of Koreans, and is so firmly embedded there, that we are inclined to think it was learned of Keui-ja, or at some distant date very long ago.] But most important of all, were the writings and customs introduced at this time; they are said to be poetry (詩 Si), history (書 Sū), ceremony (禮 Ye), music (樂 Ak), medicine (醫 Eui), witchcraft (巫 Mu), the principles of life (陰陽 Eum-yang), divination (卜筮 Pok-sū), and various arts (百工 Pāk-kong). These embrace most of Korea's present civilization, and certainly they include what has had more to do with Korean thought and custom than any other influence, namely, the Eum-yang or the two principles in nature.\n\nKi-ja also gave his adopted people laws for the protection of society. A note is appended here in the old history, which is interesting in the light of the present day. \"He found the character of the people fierce and violent,\" and so, with the express purpose of influencing them by an object lesson, he planted many willows, the willow being by nature a gentle yielding tree. For this reason P'yūng-yang was called the \"Willow Capital,\" and to this day letters addressed to that city are marked Yu-kyung (柳京) the Willow Capital.\n\nIn 193 B.C a Chinese general called Wi-man (衛滿), who had made his escape on the fall of the Chin (秦) dynasty, marched into P'yūng-yang and drove out Keui-jun (箕準), the descendant and successor of Keui-ja, forty-two generations removed. Wi-man, who has no place of honour reserved him in any of Korea's temples of fame, has surely been overlooked, for while he brought nothing of literature to commemorate his invasion, he brought the top-knot, which still stands in the forefront of Korean civilization.\n\nA friend of mine, who loves the ancients, was scandalized one day by his eldest son coming home with top-knot cut. He beat the boy, and then sat for three days in sackcloth and ashes fasting for the son who had been lost to him by the severing of the top-knot. A good Confucianist also who accompanied me to Yokohama, was so pestered by remarks about his head ornamentation that he was obliged to have it cut. The Japanese barber, smiling broadly, asked, \"How can you ever repay the favour I do you?\" The friend replied, in Korean, under his breath, \"To behead you, you wretch,\"\nwould be the only fit pay.\" It is one of the great gifts of China—cherished and prized and blessed is the top-knot.\n\nOn the entrance of Wi-man, Ki-jun went south to Keum-ma (金馬) or modern Ik-san (益山) of Chulla Province (全羅道), where he set up the kingdom of Ma-han (馬韓), of course carrying with him the Chinese civilization and customs of his forefathers. We are told that the people of these regions were uncivilized; that though they built their walls of mud and thatched their huts, yet they made the door through the roof. [Would this account for the fact that there is no native word for door, and that we have only the Chinese word mun (門)?] They valued not gold or silver or silk, but were brave and skilful at handling the bow and the spear.\n\nAt this time also, fugitives from the Chin (秦) kingdom, who had made their way across the Yellow Sea to Mahan, were given land to the east, which they called Chin-han (辰韓). They set up their capital at Kyŏng-ju (慶州) and became a subject state paying tribute to Mahan.\n\nThus at the beginning of the second century B.C., we find a Chinaman ruling at P’yŏng-yang, the descendent of another Chinaman at Ik-san, and fugitives from the Chin kingdom of China in authority at Kyŏng-ju.\n\nFollowing this, in 107 B.C., when U-kŭ (右渠) the grandson of Wi-man, failed to pay tribute, Mu (武帝) of the Han dynasty took forcible possession of all North Korea, and divided it into four provinces, making Nak-nang (樂浪) of P’yŏng-an (平安), Nim-dun (臨屯) of Kang-wŭn (江原), Hyŏm-t’o (玄菟) of Ham-kyŏng (咸鏡), and Chin-bun (真番) of Pāk-tu-san (白頭山).\n\nIn 81 B.C. these were combined by the Chinese Emperor So into two. Thus we see China’s hand, at the opening of the Christian era, stretching all the way from the Ever-white Mountain to the far south.\n\nIn 246 A.D. there was war between Pē (廢帝) of the Wi (魏) dynasty and Ko-gu-ryŭ (高句麗), in which 60,000 Chinese are said to have perished. Ko-gu-ryŭ, by an act of treachery, assassinated the Chinese general, whose forces were then compelled to retire. This was the first time that Korea seems to have held her own though the fact is, that she was entirely under Chinese leadership.\nIn 296 A.D. an attack was made on Ko-gu-ryū by the Yün (燕) emperor of China and victory gained, but on digging up the remains of Sū-ch'ün (西川), the king's father—who had died in 266—many of the Chinese soldiers were killed by repeated shocks of terror, and finally sounds of music emanated from the grave. This so impressed the general with the fact that great spirits were in possession of the place, that he withdrew from the campaign and led his soldiers home.\n\nSpirit sounds disturb the peace of the people of the Peninsula more than any household cares or anxieties for material things. Many of you, no doubt, have heard it said that on damp cloudy days the spirits of those killed in the Japan war of 1592 still collect in South Whang-hä and terrorize the country with their wailings, and that dragon horses are heard neighing night after night. This spirit thought has come from China and is most deeply rooted in the native's being. I once said to a hunter, who was going into the mountains late at night, \"Are you not afraid to venture in the dark?\" His reply was, \"I wait in attendance on the mountain spirit and so have no need to fear.\"\n\nThe superstitious terror that drove back the Yün general still exists. Last December a man of some note in church circles was drowned in the Han river. I am told that his spirit comes out of the water frequently and alarms the people of Häng-ju.\n\nIn 372 A.D., when Ku-bu (巨夫) was king of Ko-gu-ryū, Emperor Kan-mun (簡文) of the Chin (晉) dynasty sent over Buddhist sūtras (佛經), images and priests, and from that date Buddhism existed in the Eastern Kingdom. Buddhism has been one of the secondary influences in Korea, though at the present time it is relegated to an entirely obscure place and is of no reputation. At this time also schools were established for the study of the Classics.\n\nIn 612 A.D., in the reign of Yung-yang (嬰陽), Yang (楊) of the Su (蘇) dynasty, who became enraged at the failure of Ko-gu-ryū to pay tribute, sent an army of 1,133,800 men, in twenty-four divisions, twelve on each side. The history reads \"extending its array like the limitless sea,\" the object of the invasion being to utterly destroy Ko-gu-ryū.\nAfter much fighting, in which Eul-ji-mun-tük (乙支文德) led the soldiers of Korea, the Chinese army, wasted and famished, beat a retreat. They reached the Ch'ung-ch'ung (清清) river, and there before them seven Spirit Buddhas walked backwards and forwards in mid stream, in such a way as to allure them to destruction, making them think that the water was shallow. Half and more of them were drowned and the remainder are said to have fled to the Yalu, 450 li, in a day and a night. Only 2,700 of the vast army returned home. Korea has erected seven temples outside of An-ju, near the river where deliverance was wrought for her, the seven temples corresponding to the seven Spirit Buddhas.\n\nThe Su dynasty of China has but little place in the thought of Korea. The O-ryun-hung-sil (五倫行實) tells only three stories selected from its history, two illustrative of filial piety and one of wifely devotion; but the second emperor of that dynasty, Su-yang, is remembered as the swell emperor of all time, his name to-day being the synonym for overdress and extravagance.\n\nWe come now to the time of greatest influence, the period of the Tangs (唐). In the year 627 A.D., the Chinese Emperor Ko-jo (高祖) united all the known world under his sway, and received from the three kingdoms of Ko-gu-ryü (高句麗), Pák-che (百濟) and Sil-la (新羅), tribute and ambassadors. He gave to the king of Ko-gu-ryü the title Duke of So-tong, to the king of Pák-che Duke of Tä-pang, and to the king of Sil-la Duke of Nak-nang.\n\nIn 632 A.D. the Queen of Sil-la, Tük-man (德曼), received a present from Tä-jong (代宗), the second emperor of the Tangs, consisting of a picture of the peony and several of the flower seeds. She remarked on seeing it that there were no butterflies in the picture and that she concluded the flower must have no perfume—a surmise which proved to be correct. From that date the peony became the king of flowers in Korea, which too tells its story of China's influence.\n\nIn 651 A.D. the king of Sil-la sent his two sons to wait on the emperor of the Tangs. One was a noted Confucian scholar, acquainted likewise with Buddhism and Taoism, and him the emperor made Minister of the Left. It seems as though the\nbond that had for a time been loosened during the minor dynasties of China, was once again tightening.\n\nIn 660 A.D. T'ā-jong of Sil-la sent to China for help against the kingdom of Pāk-che, and Emperor Ko-jong (高宗) sent in response 130,000 soldiers. After a long and hard struggle Pāk-che and Ko-gu-ryū were wiped out. At the close of the war the Tang general, Sū Chung-bang (蘇正方), took as prisoners from Pāk-che, King Eui-ja, the crown prince, many courtiers, eighty-eight generals, and 12,807 of the people. From Ko-ku-ryō he took King Po-jang, his three sons and over 200,000 of the people. A great feast of rejoicing was held in the capital of the Tangs and sacrifice was offered to the spirits of the dead.\n\nFor 246 years Korea's name was Sil-la, though it was in reality only a province of the Tang kingdom.\n\nLike a small voice comes the single word concerning Japan \"In the year 673 A.D. the name of Wā-guk (倭國) was changed to Il-pon (日本).\n\nIn 684 A.D. a noted character appears upon the scene, whose name was Sūl-ch'oung (薛聰). His is the first name mentioned in the Yu-hyul-lok (儒賢錄) or Record of Noted Men. His father was a famous Buddhist and his mother a Chinese woman of rank. His influence was equal to his attainments, which were entirely of a Chinese order. He taught the Classics (經書 Kyūng-sū) and so edited and prepared them that posterity might understand their thought. He invented also the Ni-t'u (夷套), as explained in the Korean Repository of February, 1898, by Mr. Hulbert. They are forms for endings and connectives indicated by Chinese characters and they prove that Sūl-ch'oung was in every way a representative of the influence of Chinese teaching and philosophy.\n\nHis is the first Korean name that appears as one of the spirits attendant on Confucius in the Mun Temple (文廟). His stand is number forty-eight on the east side of the Master. See Cho-tu-rok (祖豆錄).\n\nUnder the gentle hint of a figure he once warned King Sin-mun of Sil-la against the increasing influence of the palace women. Said he, \"In days gone by, when His Highness the Peony came to live among us, he was planted in the park, and in spring time bloomed and grew with beautiful\nstalk and highly coloured flowers. The Peach and Plum came to pay their respects. There came likewise a maiden-flower, the Cinnamon Rose, green-cloaked and red-skirted, tripping nimbly along, to say to the king, 'This humble person has heard in her obscurity of Your Majesty's munificence, and comes to ask if she may share the palace.' Then there entered the Old Man Flower, Pak-tu-on, wearing sack-cloth and bowing on his staff. He said 'Outside the city on the roadway I hear it said that though Your Majesty has viands of every richness, yet you need medicine. Though you dress in Chinese silk, you need a common knife-string as well. Is it not so?' The peony king replied 'The old man's words are true, I understand them; yet it is hard to dispense with the Cinnamon Rose.' 'But remember,' said the gray-bearded flower, 'that if you company with the wise and prudent, your reign will prosper; but if with the foolish, Your Majesty will fall. The woman Ha-heui (夏姬) destroyed the Chin dynasty; the woman Sū-si (西施), the O (吳) dynasty (both of China); Mencius died without meeting a man that could save the day; P'ung-dang (憑唐) held only a low office till he was white with age. If it was so with the ancients, how will it be now in our day?' King Peony replied 'Peccavi; I shall mend my ways.' When Sin-mun (神文) heard this allegory his countenance coloured and he said 'Your words are full of thought.'\"\n\nI mention the story to show you the mind of Sūl-ch'ong, for he is regarded as the first of Korean scholars, yet the persons, the kingdoms, the pictures that occupy his thoughts are all of China.\n\nAt this particular time attention seems to have been drawn suddenly to signs and omens. For example, in 766 A.D., two suns are said to have arisen in one day; three meteors fell into the palace enclosure, and a comet appeared in the west—all boding evil. This is taught by the Confucian classic Spring and Autumn, where earthquakes, comets, eclipses, are spoken of as portents of evil, death to kings, etc.\n\nI find in the book A-heui-wul-lam (兒戲原覽), which is a primer for children and an ideal book from a Korean point of view, a chapter on omens and signs, citing examples of these since the days of Yo and Sun, and there are storms of blood,\nshowers of rice, hail stones of rocks, rain squalls of sticks, frosts of white hair, tiger and snake stories that out-do the wildest West. All of which are referred to particular times in China.\n\nWhen General Kim-nak of Ko-ryū (高麗) died on the battle-field, King Tā-jo made an image in his honour and called all the ministers to a feast. When wine was drunk, he passed some to the image, and lo! it opened its mouth, swallowed the spirit and then danced before them. This also was an omen.\n\nAt this time the matter of filial piety became so firmly fixed in the Korean's mind, and of such distorted importance, that he began from the year 765 A.D., to cut off fingers, etc., to feed parents on the blood. The practice of blood-feeding seems to be of Korean origin. It certainly shows how the native has attempted to out-do Confucius in his fidelity to this particular teaching of the master. A short time ago I saw a man who had lost a finger of the left hand, and on inquiry he showed me a certificate that he had received from the government expressive of their approval of his filial piety.\n\nThe second name mentioned in the Record of Noted Men, is that of Ch'oé Chi-wün (崔致遠), who was also a Kyōng-ju man. His influence ranks next to that of Sūl-ch'ong, and we look for the place that China had in his life. We are told that he made a journey to the Tang kingdom when he was twelve years of age, that he graduated at eighteen and lived in China sixteen years.\n\nHe and Sūl-ch'ong are the two seers of Ancient Korea, and theirs are the only names of Sil-la that appear in the Confucian temple; his being forty-eighth on the west side, corresponding to Sūl-ch'ong's, forty-eighth on the east. These two show in how far the influence of China had extended toward the minds and thoughts of the people of the Peninsula at that date and what prestige an acquaintance with the Tang kings gave to each one in his own country.\n\nFrom the accession of Wang-gūn (王建), King of Ko-ryū, in 918 A.D., we read constantly of dragons and of references to dragons. Wang-gūn was said to be bright in mind, dragon-faced and square-browed. With him came astrology (天時 Ch'un-si) and geography (地理 Chi-ri), handed down from\nMencius; military forms (戰法 Chün-pūp), from Kang T'ā-gong (姜太公), and spiritualism (神明 Sin-myung) from all the seers.\n\nSigns and omens, all viewed from the point of and described in the terms of Chinese philosophy, pointed to the call of Wang-gun and the establishment of the capital in Song-do.\n\nWe read (Tong-guk Tong-gam) that the king chose a day (擇日 Tāk-il) for the opening of the ancient treasure-houses. The term Tāk-il, or Choice of Day, has come down to us from the Sū-jūn or Book of History. The most illiterate native in the country, when he says \"The attainment of health and blessing (生氣福徳 Säng keui pok tŭk) depends on the choice of day (Tāk-il),\" bears witness to the universal influence of the most dignified of Chinese Classics—even the Canon of History.\n\nIn 933 A.D. the Imperial Calendar first made its way to Korea, and with it came the emperor's sanction of the new name, Ko-ryū, for the united kingdom.\n\nIn 958 A.D., in the reign of Kwang-jong, another factor entered, showing the influence of China, and serving to bind Korea still closer to her, and that was the Kwa-gū (Examination). It dealt with the Confucian Classics only, and was an examination in Si (詩), Pu (賦), Eui (義), Eui-sim (疑心), P'yō (表), Ch'āk (策) and Kang-gyūng (講經), as it developed afterwards, though at that time it was called Si, Pu, Song (詩賦) and Ch'āk. Si is the name of a poetic composition of eighteen couplets, with seven characters to the line; Pu consists of twenty couplets of six characters; Eui and Eui-sim deal with the explanation of set passages; P'yō has to do with memorial forms; Ch'āk answers questions, and Kang-gyūng is an oral examination.\n\nThis national ceremony, imported from China, has shaken the country from end to end, and every eye since then has seen the influence of the Kwa-gū.\n\nIn the reign of Sŭng-jong, who came to the throne in 982 A.D., among a set of rules proposed by the scholar Ch'oč Seung-no, the eleventh reads, \"In poetry, history, ceremony, music, and the five cardinal relationships (O-ryun) let us follow China, but in riding and dressing let us be Koreans.\"\n\nAt this time war began with the Kŭ-ran (契丹) Tartars, for Korea steadily resisted any advance on the part of these,\nclaiming that she owed allegiance to great China only—then the Songs—and not to barbarian tribes.\n\nIn 1022 A.D. we read that Han Cho (韓祚) brought from China literature dealing with subjects which till today absorb the minds and fortunes of Koreans. They were the Chi-ga-sū (地家書), or Writings Pertaining to Geomancy; the Yang-t'ak Chip-ch'an (陽宅集撰), the Law of House Selection, and the Sük-chün (釋典), Rules for the Two Yearly Sacrifices offered to Confucius. We also read of the Kuni-u-je (祈雨祭) or Sacrifice for Rain, which His Majesty observed, I believe, in this year of grace 1900.\n\nAt this time General Kang Kam-ch'an, a Korean who had defeated the Tartar tribes, was highly complimented by In-jong, the emperor of the Songs. He sent an ambassador to bow to Kam-ch'an and to say to him that he was the Hun-gok constellation that had fallen upon Korea. This too is in the language of Chinese astrology.\n\nIn the year 1057 A.D., near Whang-ju, a meteor fell that startled the people greatly. The magistrate sent it up to Seoul and the Minister of Ceremony said, \"At such and such a time a meteor fell in the Song kingdom, and other stars fell elsewhere in China. There is nothing strange or unusual about it.\" So they returned the stone to Whang-ju. This constant reference to the Great Empire shows in what measure at that date Korea was under its influence. At this time also a Chinaman called Chang-wan (張琬), made a copy of writings on Tun-gap (遁甲 magic) and Kuni-mun (奇文 legerdemain), brought them to Korea and had them placed in the government library.\n\nThe more we read the more are we forced to the conclusion that Korea was under a mesmeric spell at the hands of the Great Middle Kingdom. The (O-hüng) Five Elements or Primordial Essences, as they appear in the Great Plan of the Book of History, written by the Viscount of Keui, perhaps more than any other teaching, had already taken full possession of Korea. Let me read this to you as a sample from the Tong-guk Tong-gam (東國通鑑): \"In the first month of Bul-hä (1095 A.D.) the sun had on each side of it glaring streamers or arrows, with a white bow shot through the centre. Six days later the same phenomena were repeated,\" and all the\npeople waited to see what the omen meant. \"In the second moon when the king desired to muster out the troops, the chief minister said: 'Soldiers are designated by the symbol metal (金), spring by wood (木). Metal cuts wood, so if you move troops in spring time you will oppose the fixed laws of nature (天地生之理 Ch'ün chi säng säng chi ri).' The king did not regard this counsel and so he died in the fifth moon.\"\n\nIn 1106 A.D. we have another example of divining by the Book of Changes before King Ye-jong went out to fight the Lao-tung Tartars.\n\nLittle remains to be noted in the history of Korea, as the great period of China's influence closes with the Tangs. It is true that the Song dynasty that followed was greatly honoured, and thirty-four stories in the O-ryun-hang-sil are taken from its history. The Mings too have been remembered and revered because they brought to an end the hated barbarian Wün dynasty, which had been set up by the descendants of Gengis in 1280 A.D. To quote from a native author, \"The Barbarian Wün destroyed the Song dynasty, took possession of all the empire and ruled for a hundred years. Such power in the hands of vandals was never seen before. Heaven dislikes the virtue of the barbarian. Then it was that the great Ming empire, from mid-heaven, in communication with sages and spirits of the past, set up its reign of endless ages. But alas! the Doctrine of Duty (三綱 Sam-gang) and the Five Constituents of Worth (五常之道 O-sang-ji-do), along with Heaven and Earth, had seen their first and last. Before the time of the Three Kingdoms (夏 Ha, 殷 Eun, and 周 Chu 1122 B.C.), holy emperors, intelligent kings, honest courtiers and conscientious ministers conferred together; days of peace were many, days of war few; but after the Three Kingdoms, vile rulers, turbulent ministers and traitors together worked ruin; days of war were many, days of peace few. Thus the state rises and falls according as the Great Relationships are emphasized or forgotten. Should we Koreans not be careful?\"\n\n\"The founder of the Mings (明),\" who was a personal friend of Tä-jo, the father of the present dynasty, \"gave our\ncountry a name, even Cho-sun, and placed our 'rice kettle' at Han-yang.\"\n\nYou will notice from this that the Golden Age of Korea existed not in the Peninsula, but in China, and at a date prior to 1122 B.C. or the time of Keui-ja.\n\nLater, in the Japan war, the Mings saved Cho-sun, and so to-day the only tan or altar in the city of Seoul is called Ta Bo-tan (大報壇), the Great Altar of Thankfulness erected in their honour, and six times a year sacrifice is offered to the three Ming emperors who had showed Cho-sun special favour.\n\nThe Ch'ungs (清) of the present day are Manchu Tartars, barbarians of course, and their dynasty has no place of honour whatever in the mind of Korea.\n\nAs mentioned before, the great period of influence closes with the Tangs and with the consolidation of the Peninsula into one kingdom under Ko-ryu. Until to-day Tang stands par excellence for all that is specially noted of China. Tang-yun is a Chinese ink-stone; Tang-in, a Chinaman; Tang-wha-geui, Chinese porcelain; Tang-hong, Chinese red dye; Tang-ko-keum, Chinese ague or intermittent fever; Tang-muk, Chinese ink; Tang-myun, Chinese vermicelli; Tang-mok, Chinese or foreign cotton goods; Tang-na-gwi, Chinese donkeys; Tang-nyu, Chinese women; Tang-p'an, Chinese printed letters; Tang-sa, Chinese thread; Tang-sun, Chinese fans and Chinese junks; Tang-j'a, Chinese medicine; Tang-ji, Chinese paper; Tang-ch'im, Chinese needles; Tang-ch'o, Chinese pepper, etc., etc.\n\nThe histories that are read in native schools are never of Korea, but of China, and they all close with the Tang dynasty, if we except the short outline in the Tong-mong-sun-seup (童蒙先習). The Tong-gam (通鑑), a work written by Chu-ja (朱子) of the Song dynasty, which is the regular history read by all scholars, deals with China from the Chus to the fall of the Tang dynasty. The Sa-ryok (史略) covers the time between Yo and Sun (燕舜) and the fall of the Tangs. The Su-jun (書傳), or Confucian Canon of History, takes us from the days of Yo and Sun to the Three Kingdoms (Ha, Eun, Chu).\n\nThe impress of China has been so deep and lasting that Korean native histories are not only not studied, but are exceedingly hard to obtain. The Tong-guk Tong-gam is not\nsold in any of the book-stores, and yet it is a history of Korea dealing with the period from 2317 B.C. to 1392 A.D.\n\nKorea has no native sages or Sŏng-in (聖人). Her sages, who are revered and worshipped high as the heavens, all come from China. Her first-rate sages or holy men are eight in number. Six of them are kings, Yo (武), Sun (舜), U (禹), T'ang (湯), Mun (文), Mu (武), and two of them scholars, Chu-gong (周公) and Kong-ja (孔子) or Confucius. Her second-rate sages are An-ja (顏子), Cheung-ja (曾子), Cha-sa, (子思) and Măng-ja (孟子) Mencius, whose names appear next to that of Confucius in the Mun (文廟) Temple or Ta Sŭng-jun (大成殿).\n\nOf those marked Ch'ul, (哲) Wise Men, there are ten who have places of honour in the same temple, and they are all Chinamen, six are of No (魯), the native state of Confucius, two of Wi (魏), one of O (吳) and one of Chin (秦).\n\nThose of next rank, marked Hyŏn-in (賢人), Superior Men, are six in number, all of the Song dynasty. Below these are the disciples, one hundred and ten in all; ninety-four are Chinese and sixteen are Korean. The two of Sil-la are Sûl-ch'ong and Ch'oé Chi-wûn who were mentioned before. There are two of Ko-ryû, An-yu (安裕), number forty-nine on the east side, and Ch'ong Mong-ju (鄭夢周), number forty-nine on the west. Why does this man of Ko-ryû, An-yu, hold a place among all these holy Chinamen? For this reason: he went to China in 1275 A.D. and brought home pictures of Confucius and of his seventy disciples, also dishes, for sacrifice; musical instruments; the Six Classics—the Book of Changes, Book of History, Book of Poetry, Ceremonies of Chu-gong, the Canon of Rites and the Annals of Confucius. He gave one hundred slaves to serve in the Confucian temple. Up to this time there had been no Confucian colleges. He made his home the first college, and so put into motion a force that was soon to overwhelm Buddhism and all minor native superstitions. He wrote a verse that is preserved still in the paragraph on his life in the Record of Noted Men \"All the incense lights burn to Buddha. From house to house they pipe to demons, but the little hut of the teacher has its yard o'ergrown with grass, for no one enters there.\"\nThe other honoured one is Chöng Mong-ju. We are told that he established schools in the interests of Chinese study, and last of all, like Pi-gan (比干) of China, he died for his master, King Kong-yang. His blood was sprinkled on the stone bridge outside the east gate of Song-do, and the wondering pilgrims gaze still at the marks that five hundred years have not sufficed to obliterate.\n\nOf the one hundred and ten disciples twelve are men of the present Cho-sun dynasty, all honoured for their faithfulness to the teachings of Confucius.\n\nSuch being the nature of these centuries of Chinese influence Korea has to-day no life, literature or thought that is not of Chinese origin. She has not even had a permanent Manchu occupation to break the hypnotic spell of Confucianism. Even her language, while possessing a basis of form entirely different from that of China, has had the latter language so grafted into it, and the thought of the same so fully made a part of its very essence, that we need the Chinese character to convey it. This will account for the native contempt of the native script. En-mun (論文) has become the slave of Han-mun (漢文), and does all the coolie work of the sentence, namely, the ending, connecting and inflecting parts, while the Han-mun, in its lordly way, provides the nouns and verbs.\n\nOut of a list of 32,789 words, there proved to be 21,417 Chinese and 11,372 Korean, that is twice as many Chinese as native words. At the present time, too, the language is being flooded by many new terms to represent incoming Western thought, and these are all Chinese.\n\nIn the Han-mun dictionary, or Ok-p'yün (玉篇), there are 10,850 characters. In reading these, the native endeavours as far as possible to mark each character by some native word, which will approximately give the meaning, so he says Soi-keum or \"metal\"-keum. In this search for native words that will approximately designate the character he finds himself lacking in the case of more than 3,000 characters. For 7,700 of them native words are found, but for the remainder nothing even approaching the meaning exists in the native speech.\n\nTo sit down and write a story in native language, or\nAnglo-Saxon, so to speak, is, we may say, impossible. Here is a sample of a laboured paragraph in pure Korean:\n\nOl yu-ram-e yu-geui wa-sū chi-nā-nit-ka a-mo-ri tū-un nal-i-ra-do tū-un-jul-do mo-ro-get-ko do i keul chū keul nūl-li po-go keu ka-on-dā deus-sal p'u-rū po-ni ū-ri-sūk-ko u-sū-un mal-do man-ha na-ra il kwa sa-ram-eui ma-am-eul tū-rū al-get-to-ta i-je o-nan sa-ram teung u-e do yet sa-ram sseun mal-i it-nan-dā keu gūt o-sū o-myūn do cha-ja po-ri-ra keu-rū-han-dā i nom-i wei a-ni o-nan-go?\n\n\"This summer, we have come here to pass the time, and howsoever hot the day may be we do not notice it. We have been looking extensively through this writing and that, and have unravelled the thought therein and there are many stupid and ridiculous things, that let us know somewhat of national affairs and of the minds of men. And now on the back of the man that is coming are other writings written by the ancients. If they come at once we shall resume our search. Why does not the rascal come?\"\n\nA glance at a rendering of something the same in pure Chinese, which at the same time is pure Korean colloquial, will show how much more full and rich the language is.\n\n(Kenn-nyūn)-e-nan (chang-chang-ha-il)-enl (Puk-han-san-sūng)-e-sū (sū-gyūn)-ha-ni (chūng-sin)-i (soai-rak)-ha-yū (sin-t'ye)-ka (kang-gūn)-ha-ta (pi-sū)-ha-gī-nan (Puk-han)-i (tye-il)-i-ra (sū-ch'āk)-eul (yūr-ram)-ha-go (i-wang-yūk-tā-sa)-ral (sang-go)-ha-ni (ka-so)-rop-ko (n-mā)-han (sa-jūk)-i (pul-so)-ha-yūn (kuk-sa)-wa (in-sim)-eul (ka-jī)-ro-ta (si-bang) (ha-in) (pyūn)-e (ko-in)-eui (keui-rok)-han (sū-chāk)-eul (pu-song)-ha-yot-ket-nan-dā (ko-dā)-ha-gī-ga (sim)-hi (chi-ri) ha-to-ta.\n\n\"In the present year we passed the long summer days at the mountain fortress of Puk-han, where our minds were freshened and our bodies strengthened. The north fortress is first of all places at which to escape the heat. We have searched widely through books and have examined into the affairs of past generations and there are ridiculous and stupid things not a few by which one can indeed know of the affairs of nations and the minds of men. And now by courier they will have sent other books written by the ancients. We wait with impatience, for their coming seems long indeed.\"\nTurning now to the popular literature of the day we find, with scarcely an exception, that books written in the native script deal with Chinese subjects and Chinese localities. Out of thirteen that I picked up of the most common, sold everywhere throughout the city, eleven were Chinese stories and two Korean. Even the *Sim Ch'ung Chun* (심청전), which is said to make the women of Korea weep, has had to bring its subject down 1500 years from the Song dynasty and over a distance of 5000 li.\n\nThe popular songs also breathe of China. The first sound that strikes the Korean baby's ear, like \"Ak-a ak-a u-ji-ma-ra,\" goes on to speak of the famous ones whom the mother hopes the child may resemble, and they are the two emperors of antiquity, Yo and Sun, who lived 2300 B.C. The song that you hear so frequently when coolies beat the ground for the foundation of a house has in it references to four persons. The first is Kang T'a-gong (姜太公), a Chinaman of the Chin dynasty, who died 1120 B.C.; the second is Mun-wang (文王), the emperor of that time; the third is Yi T'a-bak (李太白), the famous Chinese poet who lived A.D. 699-762; the last is Han-sin (韓信), a Chinese soldier, who lived 196 B.C. All of these are Chinese heroes whom even the coolie has deified and made gods of song.\n\nIn looking over the first two hundred odes of the *Ch'ung Ku Ak Chang*, I find forty-eight names of persons mentioned—all Chinamen, without a single exception. There are forty-four references to Chinese places and literary works, and eight references to Korean localities like the Diamond Mountains or Puk-han. However little the Chinese may seem to have occupied Korean territory, of the language, literature and thought they are in full possession.\n\nChildren who go to school learn first to read the *Thousand Character Classic*, a book written by a Chinaman, Chu Heungs-sa (周興嗣), who lived about 500 A.D. The next book is the *Tong-mong-sun-seup*, by a Korean author. It begins at once with the Five Cardinal Relationships of Mencius. His is the first name mentioned therein, while the whole book is an explanation of the principles illustrated by the *O-ryun-hang-sil*, to which is attached a short outline of Chinese and Korean History.\nThe history begins with a reference to T'a-geuk (太極), Eum-yang and O-ryun, and the names mentioned are those of the Heavenly Emperor (天皇氏 Ch'ün-whang-ssi), the Earthly Emperor (地皇氏 Chi-whang-ssi), the Human Emperor (人皇氏 In-whang-ssi), the Bird's-Nest Emperor (有巢氏 Yu-so-ssi), and the Fire Emperor (燧火氏 Su-in-ssi) of the fabulous ages of China, antedating Yo and Sun and contemporary with pre-historic man. Tucked in at the end is a short outline of Korean history with fulsome reference to the benefits and blessings received from Great China.\n\nAmong works of universal note in Korea, none stand higher than the So-hak (所賀) and O-ryun-hăng-sil, that illustrate the five laws of relationship. In the latter book the laws are emphasized by stories gathered from various times and sources. There are one hundred and forty-four stories in the five volumes. One hundred and twenty-six are taken from China, the Song, Han, and Tang dynasties being most largely represented, and eighteen from Korea.\n\nThere are in Korea what are called Sa-myung-il (四明日), Four Great Holidays. The first is the Chinese New Year; the second is Cold-Food Day (寒食 Han-sik) of the third moon, observed in commemoration of a Chinaman, Kā-chi-ch'oi, who lived in the 7th century B.C., and who perished in a burning forest rather than compromise his political integrity—and so they are supposed to honour him by lighting no fires on that day. The third day is Tan-o (端牛) of the 5th moon, held sacred in honour of Kul-wun (屈原), also a Chinaman, who committed suicide about 314 B.C. The fourth noted day is the 15th of the 8th moon, the Chinese Harvest Home Festival.\n\nLess important holidays are: first, the 15th of the 1st moon, called the People's Day (sa-ram-eui myŭng-il), when bridges are walked. Concerning this day a Chinese poet of the 8th century of our era, who died from overeating, wrote a celebrated verse. The second is Chŭng-myŭng (清明), mentioned by poets of the Yang dynasty; the third is the third day of the third moon, at which time the swallows return to Kang-nam (江南) China. The fourth is Nap-il (臘月), the Day of Winter Sacrifice, which has been handed down under\nvarious names from the Han dynasty. The fifth is the eighth day of the fourth moon, or the birthday of Sū-ka-mo-ne (釋迦牟尼). Formerly this was held on the 15th day of the 1st moon, but being so prominent, it partook too much of the nature of a national holiday, and so it was changed in the Ko-ryū dynasty by Ch'oi-si. Thus the Buddha gave way to Confucius. The sixth is Yu-tu (流頭) of the 6th moon, also a day whose origin is in China. The seventh is the seventh day of the seventh moon, the Crow and Magpie Day (牽牛 Kyūn-u and 織女 chik-nyū), which of course is Chinese also. The eighth is the ninth of the ninth moon, when the swallows leave Kang-nam. The ninth is the winter solstice, called Bean Porridge Day. Kong Kong-ssi (共工氏), a Chinaman, who lived 2852 B.C., and in one of his playful moods broke the pillars of heaven and destroyed the props of earth, had a son that died and became a devil, a malignant and hurtful devil. It was discovered later that there was only one thing that he did fear and that was red bean porridge. For that reason the natives plaster it on the gate walls on this particular day to keep him out—Bean Porridge Day.\n\nIn religion Koreans are ancestor worshippers, according to their interpretation of Confucius. They worship also Kwan-u (關羽), the Chinese God of War. Three large temples are erected to his honour, one within and two without the walls of the capital.\n\nIn magic and divination they follow the teachings of Wun Chung-kang (袁天綱), a Chinese sorcerer; and so implicitly do they trust in the success of his divining, that his name has become an adverb of certainty in the Korean language, just as we might say that such and such is John-Smith sure to happen, where John Smith had proved himself as infallible a prophet as Wun Chung-gang has proved to the people of the Peninsula.\n\nIn domestic relationship, and in rank, office, and territorial division, we can follow the Chinese guide book, and be perfectly at home in Korea. The whole family system remains as handed down from the Flowery Kingdom. The laws at the present day are called (Ta-myung-yul 大明律), the Code of the Mings. The Ceremonies are those of the Three Kingdoms (三代禮 Sam-la-rye). The six public offices are the same as\nthose of China, the ranks, front and rear, with their nine degrees being identical.\n\nAs for proper names, they are not native like many of those of Japan. Original Korean names are lost in antiquity, and we have for persons, and nearly always for places, Chinese names. The name Seoul, which is native and not Chinese, might be considered an exception, but it is not for it is really a common and not a proper noun, meaning simply Capital.\n\nTo sum up the great influences under their most prominent heads, they would probably be the T'a-geuk (太極), the Absolute, which appears on the national flag, as well as on official gates and on the Independence Arch; the P'al-gwa (八卦), Eight Diagrams; the Eum-yang (陰陽), Positive and Negative Principles in Nature; the Yuk-gap (六甲), Cycle Symbols; the O-ryun (五倫) and O-hang (五行), the Five Relationships and the Five Elements.\n\nThese have been drawn from the Chinese Classics, and they rule to-day the thoughts and opinions of the most illiterate of Korea quite as much as they do those of the educated.\n\nTo illustrate and to conclude I translate from the A-heui Wu-lam (兒戲原覽). The preface reads, \"Creation was not arranged in cosmic order from the first and so, off hand, it is not possible to answer for it. If those who night and day grind at study, fail to give a speedy answer to the question when asked them, how can a child be expected to reply? People like to hear but dislike to look and study. And now there come to me those who despise things distant from them and who are diseased with show of flower and lack of fruit.\n\n\"Let us then gather together the deeds and writings of the past and present, and taking the different schools, teachings, inscriptions and current rumours, trim them off, set them in order and make ten chapters out of the different works with their countless heads.\n\n\"Amid great difficulty, you will know that it has been selected most carefully. How well it has been boiled down I leave you to judge.\"\n\nThen the book begins:\n\n\"In the Great Yük (太易 T'a-yük), nothing was seen. In the Great First (太初 T'a-ch'o), life began. In the Great Beginning (太始 T'a-si), forms appeared. In the Great Open-\"\ning Up (太素 T'ā-so), matter took shape. Before this came to pass we call it chaos, but now that it is finished we call it cosmos.\n\n\"The Symbols Kŭn (乾), and Kon (坤), denote the changes of the Absolute (T'ā-geuk). Before those two primary forms were divided life had no semblance, but on the division of the clear and the turbid, heaven appeared in form like an egg. Heaven is the greater, Earth the lesser. Without and within there is water filled up to the brim, and the whole revolves like a wheel.\n\n\"Heaven is the atmosphere of land and water (Su-t'o), which, being light and clear, flies upward and like a cover encircles the earth.\n\n\"Earth is the atmosphere of land and water, which, being turbid, solidifies, rides upon the air, and, with its coolie load of water, floats along.\n\n\"Man is the concentrated essence of heaven and earth, evolved from the five elements, and spiritual beyond all other created things.\n\n\"The Sun is the essence of the male principle in nature (T'ā-yang), is a king in his bearing, and on his breast are three crows' feet.\n\n\"The Moon is the essence of the female principle in nature (T'ā-eum), has a rabbit in her bosom, which has taken shape as her particular spirit.\n\n\"The Stars are the glory of the Yang, they are composed of the essence of mountains, rivers and other created things.\n\n\"Clouds are the atmospheres of mountains and rivers or collections of Eum and Yang.\n\n\"Rain is the concentrated Eum of heaven and earth. When it is warm it rains, that is, it takes place when the Eum and Yang are in harmony.\n\n\"Frost occurs when the atmosphere of the Eum predominates. It is a change in the dew brought about by the cold.\n\n\"Snow is the concentrated Eum of heaven and earth, and is the essence of the five grains.\n\n\"Wind is the servant of heaven and earth. When the universe is angry we have wind, and wind is the atmosphere of matter blown forth.\"\n\"Thunder takes place when the Eum and Yang are at enmity. They give expression to their feelings in thunder, which goes bung bung like the beating of a drum, and passes in its course from left to right.\n\n\"Lightning occurs when the Eum and Yang bow down from weight and the Yang of the springs and fountains flashes up to heaven. When the Eum and Yang quarrel with each other we also have lightning.\n\n\"The Rainbow is seen when the Eum and Yang meet in harmony, the bright variety being the male and the dim the female.\n\n\"Mist. There are waters of five colours in the mountains of Kol-yun, and mist is the atmosphere of the red water that rises.\n\n\"Fog is the result of the hundred noxious vapours when the Eum overcomes the Yang, and so it fills the space between heaven and earth.\n\n\"The Milky Way is the chief of all the star atmospheres. It is the essence of water that rises and floats along.\n\n\"There are nine stories to heaven. The highest storey is where the stars travel, the second is where the sun travels and the lowest is where the moon makes its way. The disc of the sun is larger than that of the moon. In the moon there are visible objects, which are shadows of mountains and streams. In the remaining spaces we have the shadow of the sea, and they say there are shadows also of a striped toad and a cinnamon tree.\"\n\nThe Five Elements of which the Korean talks so much and on which he builds so many theories are, metal, wood, water, fire, earth. These take their origin as follows: \"When the dark atmosphere solidifies we have water; when the red atmosphere shines forth we have fire; when the green atmosphere floats in mid-heaven we have wood; when the white atmosphere glances off into space we have metal; when the yellow atmosphere bounds the sky we have earth.\"\n\nWe have also an explanation of the objects and articles used in every day life, and, faithful to his spiritual and intellectual fathers, the Korean traces them all back to China, and in most cases to China of the fabulous ages.\n\n\"Cooked food. In olden times men ate fruits and the blood\nof animals. The Emperor Su-in-ssi made a hole in a tree and by passing a string through caused fire,—from which date men cooked their food.\n\n\"Clothes were first invented by Ho-jo [a Minister of the Yellow Emperor].\n\n\"Houses. In olden times men lived in holes or slept out on the ground, but the Bird's-Nest Emperor (Yu-so-ssi), taught house framing, and the ancient Emperor Ko-whang-ssi first built houses. The latter had four eyes and could write characters as soon as he was born.\n\n\"Ploughs were first made and used by the Spirit-Farmer Emperor, Sil-long-ssi, who had a man's body and an ox's head.\n\n\"Marriage was first instituted by the Sky-Emperor (Pok-heui-soi), who had a snake's body and a man's head. [He was the great inventor of the Eight Diagrams].\n\n\"Writing was invented by the three brothers of the Ancient Emperor (Ko-whang-ssi). One invented the characters of India, one the characters of heaven, and one the characters of China.\n\n\"Books. Before the time of the Chin Kingdom (255 B.C.) there were no books; writings were preserved on slips of bamboo. In the Han dynasty, (206 B.C. to 23 A.D.) they were kept on silk [and so today Koreans say, \"Il-hom-eul Chuk-pak-e ol-li-ta,\" \"He will have his name inscribed on bamboo and silk\"—meaning recorded in history].\n\n\"The Calendar was constructed by Yung-sung, who lived 2780 B.C.\"\n\nThe Cycle Symbols, which have had so much to do with Korean thought, were invented by a Chinaman, Ta-yo, under direction of the Yellow Emperor. The basis of their thought was taken from the constellation Great Bear. The monthly cyclical characters were arranged by a combination of the Ten Celestral Stems and the Twelve Earthly Branches, making in all sixty years of the cycle.\n\nThus the whole list of Korea's customs, usages, and terms, are traced back to China, to the times of the Yellow Emperor and others who lived before the days of Yo and Sun. The list includes besides these, rank, sacrifice, ancestor worship, schools, sacrificial ceremonies, tablets, medicine, fortune-telling, fishing nets, city walls, parks, porcelain, wells, water\npestles, sieves, brooms, mill-stones, kettles, boilers, food, sacrificial dishes, wine glasses, grain measures, saws, chisels, axes, bows, arrows, shields, spears, armour, boats, carts, chariots, coffins, head-stones, crowns, robes, head-bands, socks, clothes, shoes, combs, mirrors, spectacles, finger-rings, fans, paper, pens, ink, ink-stones, distilled and fermented liquors, songs, dancing, harps, guitars, violins, pipes, draughts, chess, dice, cards, dominoes, dancing girls, swinging, kite-flying, etc., etc.\n\nMedicine we are told was first discovered by the fabulous emperor called the Spirit-Farmer; his Korean name being Sil-long-ssi. To-day, natives, educated and uneducated alike, speak of medicine as Sil-long-yu-ŭb (the calling handed down by the Spirit-Farmer Emperor).\n\nNets we are informed were first made by the Sky-Emperor, and were used to catch birds and fish with. So the Korean boys to-day sing—\n\n\"Che-bi-ral hu-rū-ru nā-gan-ta\nChe-bi-ral hu-rū-ru nā-gan-ta\nPok-heui-ssi-eui mā-jan keu-meul-eul kū-tu-ch'ū tul-lū me-go.\"\nOff we go to catch the swallow,\nOff we go to catch the swallow,\nWrapped and rolled and ready is the net of\nthe Sky-Emperor.\n\nHarps of five strings were first made by the Spirit-Farmer. Mun and Mu of the Chu dynasty, who were men of war, each added a string, making seven in all; and to-day Koreans say \"Mun hyūn Mu hyūn-eun sal-pūl-chi-sung-i-ra. \"The Mun and Mu strings have the sound of death and destruction.\"\n\nA paragraph follows these lists which shows how precious in the eyes of Korea is every character in the classics. It reminds one of the Jew. \"Thy saints take pleasure in her stones, her very dust to them is dear.\"\n\nThe Book of Poetry (Si-chŏn) has 39,124 characters.\nThe Book of History (Sŏ-chŏn) ,, 25,700 ,\nThe Book of Changes (Chu-yŏk) ,, 24,027 ,\nThe Ceremony of Chukeng (Chu-ryè) ,, 45,860 ,\nThe Canon of Rites (Yi-keui) ,, 99,027 ,\nThe Annals of Confucius (Ch'un-ch'u) ,, 196,845 ,\nThe Analects (Non-ó) ,, 12,700 ,,\nMencius (Mäng-ja) ,, 34,685 ,,\nThe Great Learning (Tā-hak) ,, 1,733 ,,\nThe Doctrine of the Mean (Chung-yong),, 3,505 ,,\nThe Book of Filial Piety (Hyo-gyöng) ,, 1,903 ,,\n\nThe numerical categories also lead you at once away from Korea and up and down through China, noting the most unexpected things. Let me take one as a sample. It is the figure eight that we are at, \"The Eight Fast Horses of Mok-wang\" who lived 1000 B.C. These horses went at the rate of 330 miles a day, or as fast as an ordinary steamer. Their names translated freely read, Earth Breaker, Feather Flapper, Heaven Flyer, Landscape Jumper, Light Clearer, Sunbeam Heaper, Fog Conqueror, Wing Hanger. And so on and so on. The noted mountains, the distinguished men—all Chinese, not a Korean name in the whole long weary list of them.\n\nAs for general deportment too the Korean keeps in his mind's eye the nine forms advocated by Confucius which also appear in the numerical category under the figure nine.\n\n1st Stately walk; 2nd Humble hand, 3rd Straight eye, 4th Circumspect mouth, 5th Low voice, 6th Erect head, 7th Dignified manner, 8th Respectful poise, 9th Severe countenance.\n\nI conclude the paper by a quotation from the close of the Tong-mong Sön-seup \"Our ceremonies, our enjoyments, our laws, our usages, our dress, our literature, our goods have all followed after the models of China. The great relationships shine forth from those above and the teachings pass down to those below, making the grace of our customs like to that of the Flowery Land; so that Chinese themselves praise us saying \"Korea is little China.\"\nKOREAN SURVIVALS.\n\nBy H. B. HULBERT, Esq., F.R.G.S.\n\nWe had the pleasure a short time since of listening to an able presentation of the subject of \"China's Influence upon Korea\" by the Rev. Jas. S. Gale. It would be difficult if not impossible to bring together a more complete array of the facts which argue the existence of such influence. But the impression left by the paper was that there is nothing in Korean society that is not dominated by Chinese ideas. If this is true, we have in Korea a condition of affairs that must be acknowledged to be unique; for Korea is a nation of over twelve million people who have preserved a distinct national life for more than two thousand years, and it would be strange indeed if there remained in the Peninsula nothing that is peculiarly and distinctively Korean. If Korea's subjection to Chinese ideals was complete in the days of the Tang dynasty and has continued ever since, there would be no one so hardy as to point to anything in the country and claim for it a native origin and survival after a lapse of fifteen hundred years. And yet, at the suggestion of our President, I have undertaken to present the other side of the picture and to point out what remains that is distinctive of Korea and differentiates her from China. In this sense it is merely supplementary to what we have already heard on the subject.\n\nThe observations that I have to make divide themselves into two portions: first a short historical resumé, and second some natural deductions.\n\nKorean tradition tells us that the first civilizer of Korea was the Tan-gun (檀君), a purely native character, born on the slopes of Ta-bak Mountain (太白山). The wild tribes\nmade him their king. He taught them the relations of king and subject; he instituted the rite of marriage; he instructed them in the art of cooking and the science of house-building; he taught them to bind up the hair by tying a cloth about the head. This tradition is universally accepted among Koreans as true. They believe his reign to have begun a thousand years before the coming of Keui-ja. We place no confidence in the historical value of the legend, but the Koreans do; and it is significant that according to the general belief in Korea the Tan-gun taught two, at least, of the most important of the Confucian doctrines, namely those concerning the government and the home. And from these two all the others may be readily deduced. The legend also intimates that the much respected top-knot, at least in all its essential features, antedated the coming of Keui-ja.\n\nIf the legendary character of this evidence is adduced against it, the very same can be adduced against the story of Keui-ja, at least as regards his coming to Korea. The Chinese histories of the Tang dynasty affirm that Keui-ja's kingdom was in Liao-tung (遼東). The histories of the Kin and Yuan dynasties say that Keui-ja's capital was at Kwang-nyüng (廣寧) in Liao-tung. A Keui-ja well is shown there to this day and a shrine to him. A picture of this great sage hung there for many years, but it was burned in the days of Emperor Sé-jong of the Ming dynasty. Even a Korean work, entitled Sok-mun Heun-tong-no (續文獻通考), states that Keui-ja's capital was at Ham-p'yüng-no (咸平路) in Liao-tung. The Chinese work Il-tong-ji (統志), of the Ming dynasty, states that the scholars of Liao-tung compiled a book on this subject entitled Sung-gyüng-ji (盛京志), in which they said that Cho-sün included Sim-yang (瀋陽, i.e. Mukden), Pong-ch'ün-bu (奉天府), Kwang-nyüng and Eui-ju (義州), which would throw by far the larger portion of Cho-sün beyond the Yalu River and preclude the possibility of Keui-ja's capital being at P'yüng-yang. I believe that P'yüng-yang was his capital, but the evidence cited shows that it is still an open question and if the Tan-gun story is excluded because of its legendary character the Keui-ja story must be treated likewise. We have as many remains of the Tan-gun dynasty as of the Keui-ja. The Tan-gun altar on Kang-wha, the fortress of\nSam-nang (三郎) on Chun-dung Mountain, the Tan-gun shrine at Mun-wha and the grave of the Tan-gun at Kang-dong attest at least the Korean belief in their great progenitor.\n\nWhen Keui-ja came in 1122 B.C. he brought with him a mass of Chinese material, but we must note the way in which it was introduced. From the first he recognised the necessity of adapting himself and his followers to the language of the people among whom they had come. The Chinese language was not imposed upon the people. He determined to govern through magistrates chosen from the native population; and for this purpose he selected men from the various districts and taught them the science of government.\n\nThe Chinese character was not introduced into Korea at this time as a permanency. The square character had not as yet been invented and the ancient seal character was as little known even among the upper classes as the art of writing among the same classes in Europe in the Middle Ages. The total absence of literary remains, even of inscriptions, bears evidence to the fact that the Chinese character played no part in the ancient kingdom of Cho-sun.\n\nThe Keui-ja dynasty was overthrown by Wi-man in 193 B.C., but neither Wi-man nor his followers were Chinese. We are distinctly told that he was a native of Yün (燕), a semi-barbarous tribe in Manchuria. His coming, therefore, could have added nothing to the influence of China upon Korea. Only eighty-six years passed before Wi-man's kingdom fell before the Emperor Mu (武帝) of the powerful Han dynasty, and was divided into four provinces. But we must ask what had become of the Keui-ja civilization. The conquering emperor called the Koreans \"savages.\" Mencius himself speaks of a greater and a lesser Māk (貊), meaning by greater Māk the kingdom of Cho-sun. This is considered an insult to the Keui-ja kingdom, for Māk was the name of a wholly barbarous tribe on the eastern side of the Peninsula and the reference implies that Cho-sun was also savage. The celebrated Chinese work, the Mun-hon Tong-go (文獻通考), almost our only authority on the wild tribes of Korea at the time of which we are speaking, shows that almost the whole of northern Korea was occupied by the tribes of Ye (穢), of Māk (貊), of Nang-nang (樂浪) and Ok-jū (沃沮). The kingdom of Wi-\nman comprised only a portion of the province of P'yŏng-an. The evidence is made still stronger by the fact that the Emperor Mu gave the name of Nang-nang (樂浪), to the whole of north-western Korea, clean to the Yalu River. It seems plain that he considered the trans-Yalu portion of Wi-man's kingdom its most important part.\n\nIt was not to be expected that Chinese could long continue to hold any portion of Korea. It was too far from the Chinese base, and the intractability of the semi-barbarous tribes made the task doubly difficult. So we are not surprised to find that within a century the whole of northern Korea fell into the hands of Chu-mong (朱蒙), a refugee from the far northern kingdom of Pu-yu (夫餘). Tradition gives him a supernatural origin, but his putative father was a descendant of the oldest son of the Tan-gun. So here again we find no indication of Chinese influence. From almost the very first this new kingdom of Ko-gu-ryū was China's natural enemy, and while there were intervals of peace, for the most part a state of war existed between Ko-gu-ryū and the various Chinese dynasties which arose and fell between 37 B.C and 668 A.D. The Mun-hon Tong-go describes the manners and customs of Ko-gu-ryū in detail. It says nothing about Confucianism, but describes the native fetichism and shamanism in terms which make it plain that northern Korea had very largely reverted to its semi-barbarism—if indeed it had ever been civilized. Her long wars with China at last came to an end when the latter, with the aid of Sil-la, brought her to bay in 668 A.D.\n\nWe must now turn to the south where interesting events were transpiring. In 193 B.C Wi-man drove Keui-jun out of P'yŏng-yang. He fled by boat with a handful of followers, landing finally at the site of the present town of Ik-san. At that time the southern part of Korea was occupied by three congeries of little states. The western and most powerful of these groups was called Ma-han (馬韓), the southern group was Pyŏn-han (仁韓) and the eastern group Chin-han (辰韓). These names were already in use in southern Korea long before the coming either of Keui-jun or the Chinese refugees from the Chin empire across the Yellow Sea. Keui-jun undoubtedly brought with him a civilization superior to that of the southern Koreans and so he found little difficulty in set-\nting up a kingdom. This kingdom did not, however, include the whole of Ma-han. At first it probably included only a few of the fifty-four independent communities which composed the Ma-han group. He had with him only a few score of followers and he found in Ma-han a people differing from his own in language, customs, laws and religion. It is inconceivable that during the short period that this kingdom survived it could have exerted any powerful influence upon the general population of the Ma-han group. It was only a few years after Chu-mong founded Ko-gu-ryū that his two sons moved southward and settled well within the borders of Keui-jun's little kingdom and within two decades, by a single short campaign, they overthrew Ma-han and set up the kingdom of Pāk-je (百濟). Thus we see that Pāk-je was founded by people that were in no wise connected with the Chinese or influenced by Chinese traditions.\n\nBut some time before this the kingdom of Sil-la had been founded in the south-eastern portion of the Peninsula. We are credibly informed that at the time of the building of the great wall of China large numbers of Chinese fled from China and found asylum in southern Korea. Landing on the coast of Ma-han they were apparently considered unwelcome visitors, for they were immediately deported to the eastern side of the Peninsula and given a place to live among the people of Chin-han. They did not found Chin-han. The names of all the independent settlements of that group are preserved to us and none of them has a Chinese name. Chin-han had existed long before the coming of these Chinese. There is nothing in the records on which to base the belief that these Chinese immigrants had anything to do with the founding of the kingdom of Sil-la. The chiefs of five of the native communities agreed to unite their people under a single government, but the name they gave the kingdom was not Sil-la but Sū-ya-būl (徐邪伐), a purely native word. The name Sil-la was not applied to the kingdom until some centuries later, that is in 504 A.D., during the reign of King Chi-deung. It was in the same year that the horrible custom was discontinued of burying five boys and five girls alive when the body of a king was interred. The title of the king was Kū-sū-gan (居西干), a purely native word. The word \"wang\" was not introduced\ntill the name Sil-la was. The names of all the government offices and all official titles were pure native words. These are also preserved to us in the Mun-hon Tong-go which I have already mentioned. We have now noticed the origin of the three states which divided the Peninsula between them at about the beginning of our era and we find that in none of them was there any considerable Chinese influence manifest. Indeed it was not until five hundred years later that even the barbarous and revolting custom of burying people alive was discontinued, and even then it was discontinued only because a king on his death-bed gave most stringent orders that no children were to be buried alive with him.\n\nThere was at the same time a certain admixture of Chinese blood in Korea. In human society as in the vegetable kingdom we find that a wise admixture of the different species of a family produces the very best of results. The admixture of Celtic, Teutonic, Scandinavian and Norman blood produced the powerful combination which we call English. So the slight infusion of Chinese blood in Sil-la helped to produce a civilization that was confessedly far in advance of either Pāk-je or Ko-gu-ryū.\n\nBut the kingdom of Sil-la was without a system of writing, and consequently adopted the system that the Chinese had brought with them. There can be no doubt that these Chinese brought many new ideas, which, being entirely foreign to the Koreans, had no corresponding words in their vocabulary. The Koreans therefore adopted the names along with the ideas. But in borrowing from the Chinese vocabulary the Koreans did it in no slavish way. They attached Korean endings to the Chinese words, compounded them with Korean words and in truth assimilated them to the genius of Korean speech as thoroughly as the Old English did the Romance dialects brought over by the Norman conquerors. Korean etymology and syntax differed so widely from the Chinese that Korean scholars despaired of blending the two, and in order to render a Chinese text intelligible they found it necessary to introduce the Korean endings. This was done by means of a system called the Ni-t‘u, which was described some years ago in the Korean Repository.\n\nAs a medium of writing the Koreans adopted the Chinese\ncharacter and they still continue to use it. There has never risen a man in Korea to do for his country what Chaucer, Dante and Cervantes did for theirs, namely, write a classic in the native tongue and begin the good work of weaning the people away from a foreign system which restricts the benefits of erudition to the meagrest minority of the people. And yet Korea has not been wanting in men who recognised the need of a change. The first of these was Sül-ch'ong (薛聰), to whom reference was made in the paper read last month as being one of Korea's great men. It is true; but the foundation of his greatness lies, it seems to me, in his attempt to make popular education possible in his native land. He it was who invented the Ni-t'u (夷套), which was a half-measure and therefore doomed to failure. But such as it was it was entirely anti-Chinese, at least in this respect that, by weaning the Koreans away from the Chinese grammatical system, the first step would be taken towards weaning them away from the whole system. He labored under far greater difficulties in this matter than did those who took the first steps toward freeing the English people from their bondage to the Latin. This difficulty was the entire lack of any phonetic system of writing in Korea. The highly inflected language of Korea is wholly unfit to be expressed in terms of the rigid, unyielding characters of China. The English on the other hand not only had a phonetic system similar to that of the Continent but they had almost identically the same alphabet. Such being the case it is small wonder that Sül-ch'ong failed.\n\nAnother great scholar of Sil-la was Ch'oé Ch'i-wun (崔致遠). At an early age he went to China, where he took high honours in the national examinations. He travelled widely—as far as Persia, it is said—and then came back to Korea to give his countrymen the benefit of his experience. But it soon became evident that the jealousy of his fellow-courtiers would let him do nothing. He was forced to flee from the court and find refuge among the mountains, where he wrote an interesting biographical work. It is natural enough that the Chinese mention him with enthusiasm because of his achievements in China. The Koreans owe him little except the lesson which he taught, that a Korean who denationalizes himself can hope to have little influence upon his fellow-countrymen.\nDown through the history of Sil-la we find a constantly broadening civilization and a constant borrowing of Chinese ideas of dress, laws, religious and social observances. This is freely granted, but what we do not grant is that this borrowing made the Korean any less a Korean or moulded his disposition into any greater likeness to the Chinese than a tiger's fondness for deer moulds him into any likeness to that animal.\n\nIt was during the early days of Sil-la that Confucianism and Buddhism were introduced into Korea. Before the beginning of our era Chinese influence had been stamped out of the whole north and west of Korea and it was only with the impetus that Sil-la gave to the study of Chinese that this religion took firm root in Korean soil. I shall take up the matter of Confucianism and Buddhism later, and only mention them here to emphasize the date of their introduction.\n\nSil-la finally, with the help of the Chinese, gained control of nearly the whole of the Peninsula, but for many years there was a sharp dispute between her and China as to the administration of the northern provinces. It was only when Sil-la assumed control of the whole Peninsula that the people began to be moulded into a homogeneous mass.\n\nIn the tenth century Sil-la fell before the Ko-ryū (高麗) dynasty and the palmy days of Buddhism were in sight. During the next five hundred years Chinese influence in Korea was almost exclusively along Buddhistic lines. It was during this period that the law was promulgated requiring every third son to become a monk, and that the pagoda was erected in this city. But, as I shall attempt to show later, Buddhism cannot be cited as Chinese influence in any proper sense.\n\nWith the beginning of this dynasty in 1392 happier days were in store for Korea. Sweeping reforms were instituted. King Se-jo (世祖) ordered the casting of metal types in 1406, thus anticipating the achievement of Gutenberg by nearly half a century. These were Chinese characters, but the same king ordered the construction of a phonetic alphabet that would make possible the education of the masses. This command resulted in the composition of an alphabet which for simplicity and phonetic power has not a superior in the\nworld. It was a system capable of conveying every idea that the Korean brain could evolve or that China had to lend. It would be as absurd to say that the Korean requires the Chinese written language with its widely divergent grammar as to say that the Englishman needs the Latin written language with all its grammatical system. But the alphabet never became popular among the upper or educated class. The reason is two-fold. In the first place, this upper class had been so long accustomed to a system that appealed to the eye rather than to the ear that the change was too radical. It would be like asking a painter to stop expressing his ideas on canvas and do it on the piano instead. The whole technique of the art must be relearned. The artistic spirit might enable him to do it, but the effort would be too great a strain on the patience to render his acquiescence probable. In the second place, the use of the Chinese character was an effectual barrier between the upper and the lower classes. The caste spirit, which has always been pronounced in Korea, was fed and strengthened by the use of Chinese; for only a leisure class could hope to learn the \"Open Sesame\" to learning. The retention of the Chinese character grew out of no love for Chinese ideas, but from intellectual inertia on the one hand and caste prejudice on the other.\n\nSince the beginning of this dynasty there have been no considerable borrowings from China.\n\nThis closes the historical part of our theme, and now, in commenting upon it, I shall make use of a comparison which, though not exact in all particulars, is sufficiently so for our purposes. I shall attempt to show that the influence of China upon Korea has been almost identical with that of Continental Europe upon the inhabitants of the British Isles. Not that there is any similarity between Korea and England, any more than there is between China and Continental Europe, but that the law of cause and effect has worked in identically the same way in each case.\n\nI. I have granted that there has been admixture of Chinese blood in Korea. This admixture terminated over a thousand years ago, for the Manchu and Mongol invasions left no traces in the Korean stock. But we find precisely the same process occurring in England at approximately the same\ntime. The admixture of Norman blood in England was indeed far greater than the Chinese admixture in Korea.\n\nII. I have granted that the language of Korea has been modified by Chinese admixture, but the modification has been identical both in kind and in degree with that which the Romance languages exerted upon English. The changes which occurred among the Korean tribes between the years 200 B.C. and 100 A.D. may fitly be compared with the changes which took place in England at the same or a little later period, namely from the beginning of the Roman conquest. The influence of Norman-French upon English did not begin till somewhat later than the influence of Chinese upon Korean, but it was of the same nature. It is necessary then to inquire what was the kind of influence which the Chinese exerted over the Korean.\n\n(a) At the time when this influence commenced Korea already possessed a highly inflected language, which differed radically from the Chinese in its phonetics, etymology and syntax, and this difference is as great to-day as ever. If we turn to the British Isles we find that at the time of the Norman conquest there existed in England a highly inflected language which differed widely from that of the conquerors and that the distinction has been maintained in spite of all glossarial innovations.\n\n(b) The influence of the Chinese upon the Korean, as of the Norman upon the English, consisted almost solely in the borrowing of new terms to express new ideas and of synonyms to add elegance and elasticity to the diction. In both cases the legal, ecclesiastical, scientific and literary terms were borrowed, while the common language of ordinary life remained comparatively free from change. The difficulty of writing in pure Korean without the use of Chinese derivatives is precisely the same as that of writing in pure English without the use of Latin derivatives. Of course there are many Chinese terms that have no Korean equivalent, just as there are many Latin derivatives that have no Anglo-Saxon equivalent. But we must remember that there are thousands of common Korean words that have no Chinese equivalent. The whole range of onomatopoetic or mimetic words, in which Korea is particularly rich, has never been reduced to\nChinese nor sought a Chinese synonym. In our English vocabulary there are only 28,000 Anglo-saxon roots. I feel sure that an exhaustive list of Korean words would show a larger proportion of native roots than this.\n\n(c) Ideas come first, words afterwards, and the Korean who has grasped the idea needs only to borrow the phonetic symbol of the idea. No written character is necessary. The fact that the whole New Testament has been intelligibly rendered into Korean and written in the native alphabet is sufficient answer to all who say that the Korean requires the Chinese character to enable him to express even the most recondite ideas.\n\nIII. I have granted that Korea has borrowed largely from the religious systems of China. I have shown that the Confucian cult was introduced into Korea a little after the beginning of our era. It was at this same time that Christianity was first introduced into England. But Christianity effected a far more radical change in England than Confucianism did in Korea. The ancient Druidical rites of prehistoric England correspond very well with the fetichism of the wild tribes of Korea, but though Christianity put an end to the whole Druidical system Confucianism never was able to displace the fetichism of Korea. It exists here to-day and forms the basis of Korean religious belief. It exercises an influence upon the Korean masses incalculably greater than Confucianism. The fetichism of Korea is not a Chinese product. It is described by the writers who tell of the ancient tribes of Korea, and what they say corresponds closely with what we know of Korean superstitions to-day. There were the full moon and the new moon feasts. There was the worship of animals and of spirits of numberless kinds. The owens which the Koreans dreaded long before the coming of the Chinese were the same as those which frightened the ancient Chaldeans, Persians, Romans, namely, eclipses, meteors, wailings, wild animals in the streets, showers of various articles of a most unexpected nature.\n\nMuch stress is naturally laid upon Confucianism, but what is Confucianism? A formulation of those simple laws of conduct which are common to the entire human family. The love of parents is instinctive to the race. It is common\neven among animals. Conjugal faithfulness, loyalty to rulers, the sacredness of friendship—these are things that all men possess without the suggestion of Confucianism and they existed here before Confucianism was heard of. The Koreans accepted the written Confucian code as naturally as the fledgling takes to its wings. They had never formulated it before and so they naturally accepted the Chinese code.\n\nBut I would ask what influence Confucianism has actually exerted upon Korea. It has dictated the form of ceremonial observances and has overspread the surface of Korean social life with a veneer that appeals wholly to the eye, but which finds little sanction in the judgement. Which one of the Confucian precepts have the Koreans observed with even a reasonable degree of faithfulness? Not one. Their Confucianism is a literary shibboleth—a system of casuistry which is as remote from the field of practical ethics as the system of Machiavelli was remote from the field of genuine diplomacy. In Korea Confucianism has moulded merely the form of things and has left the substance untouched. To prove this I would ask to whom or what does the Korean have recourse when in trouble of any kind? Every one conversant with Korean customs will answer that it is to his primitive and inborn fetichism or to that form of shamanism to which Korean Buddhism has degenerated. And this brings us to the subject of Buddhism.\n\nKorea received Buddhism not from China but merely by way of China. In origin and philosophy Buddhism is an Indian product and can no more be cited as Chinese influence than Japanese Buddhism can be cited as Korean influence. We must look farther back to trace the genesis of that influence. China was merely the physical medium through which Indian ideas were transmitted to Korea and thence to Japan.\n\nBuddhism flourished in Korea from about 400 A.D. to 1392 A.D. At that time an opposing current set in which pushed it into the background, but it would be a great mistake to think that the principles and philosophy of Buddhism are extinct. They have been pushed to the background, but they still remain in their modified form the background of the Korean temperament, as I shall show later.\n\nIV. I shall grant that Korea has received her scientific\nideas from China, but in the same way that the English received their fundamental scientific notions from the Continent. The astronomical system of Copernicus, the medical systems of Galen and Hippocrates, the mathematical systems of Euclid and Archimedes and the philosophical systems of Plato, Spinoza, Descartes and Kant—these form the background of English science. In the same way Korea received her astronomy, astrology, geomancy and necromancy from China.\n\nV. I shall grant that Korea received her artistic ideals from China, but in the same sense that the English have always looked upon Phidias and Praxiteles, Correggio and Raphael, Mendelssohn and Bach as unapproachable in their own spheres.\n\nVI. I shall grant that Korea has borrowed her literary ideals from China. But among all the forms of poetry, whether epic, didactic or lyric, whether ode, sonnet, elegy or ballad, which one of them has originated in the British Isles? It is all merely a matter of form, not of substance.\n\nVII. I shall grant that the Koreans have copied the Chinese in the matter of dress. But is it not a notorious fact that the whole of Christendom has been dictated to in this matter for centuries by a coterie of tailors and modistes in Paris? To-day Korea is more independent of China in the matter of dress than is England of the Continent.\n\nVIII. I shall grant that Korea has acknowledged the suzerainty of China for two thousand years or more. In like manner the English people continued for centuries to pay Peter's pence, but the submission was only a superficial one. Korea had been overawed by the prestige of Chinese literature just as England had been overawed by the papacy, but even as the English people were moved to this more by reverence for authority in the abstract than by the personality of the Roman pontiff so the Koreans were kept bound to China more as a grateful source of intellectual enlightenment than as a political dictator. The Roman pontiff never pressed his temporal claims into the domain of English politics without the people of England becoming restive, and even so the Chinese never pressed their claim to suzerainty over Korea to its logical limits without the people of Korea becoming restive.\nThese are some of the points of similarity between China's influence upon Korea and the influence of Continental Europe upon England, and I beg to submit the proposition that if the mere borrowing of foreign ideas brings the borrower into complete conformity to the lender we have a right to say that England is as subservient to Continental ideas as Korea is to Chinese. But no one would dream of saying that England has shown any such subserviency. With all her adaptation of foreign ideas England is a distinct and separate national unit. The same is true of Korea. Her borrowings have not merged her personality nor the characteristics of her people into any likeness to the Chinese.\n\nThe Chinese are utilitarian, phlegmatic, calculating, thrifty, honest through policy, preferring a steady moderate profit to a large but precarious one. The Korean on the other hand, is a man of sanguine temperament, happy-go-lucky, hand-to-mouth, generous when he has the means, unthrifty, honest (when he is honest) not so much from policy as from contempt of dishonesty. This open-handedness of the Korean explains in part the very small amount of mendicancy here as compared with China.\n\nAgain, the Korean is passionately fond of nature, and is never so happy as when climbing his native hills or walking beside his streams. There is in him a real poetic vein which I fail to find in the Chinese either through my very slight personal acquaintance with them or through what I read of them in books.\n\nThe barrenness of Chinese literature has not got into the bones of the Koreans. Their temperament is such as to throw it off as a healthy mind throws off an attack of melancholy. This is possible because the Korean study of the classics is a matter of custom or habit and not a matter of enthusiasm or love. He studies them because he is ashamed not to know them. Testimony may differ as to the status of Korean scholarship, but it is the belief of some among us that the average grade of that scholarship is exceedingly low. Among the so-called educated class in Korea the vast majority know just enough Chinese to read their notes to each other and to spell out the easy Chinese that the daily paper affords, but I am not prepared to admit that more than the meagrest\nfraction even of the upper class could take up any ordinary Chinese book and read it with passable fluency at sight.\n\nThe Korean temperament is a mean between that of the Chinese and that of the Japanese. He is more a child of impulse that the Chinese but less than the Japanese. He combines the rationalism of the Chinese with the idealism of the Japanese. It is the idealism in the Japanese nature that makes the mysticism of the Buddhistic cult such a tremendous power. The Korean is a less enthusiastic Buddhist, but he has in him enough idealism to make it sure that the philosophy of Buddhism will never lose its hold upon him until he comes in contact with the still deeper mysticism of Christianity. In all this he is at the widest remove from the Chinese. I have been informed by one of the most finished students of Chinese, a European who for twenty-seven years held an important position in Peking, that there was not a single monastery within easy distance from that city where there lived a monk who understood even the rudiments of Buddhism. This is quite what we might have expected, and to a certain extent it is true of Korea. The native demonology of Korea has united with Buddhism and formed a composite religion that can hardly be called either the one or the other, but running through it all we can see the underlying Buddhistic fabric, with its four fundamentals—mysticism, fatalism, pessimism and quietism. That these are inherent in the Korean temperament I will show by quoting four of their commonest expressions. \"Moragesso\"—I don't know—is their mysticism. \"Halsu öpsö\"—It can't be helped—is their fatalism. \"Maung hagesso\"—going to the dogs—is their pessimism, and \"Nopsita\"—Let's knock off work—is their quietism.\n\nIf we enter the fruitful field of Korean folk-lore we shall find a mixture of Confucian, Buddhistic and purely native material. We should note that the stories of the origin of Korea's heroes are strikingly non-Chinese. Hyŭk-kŭ-sé, the first king of Sil-la, is said to have originated from a luminous egg that was found in the forest on a mountain side. For this reason the kingdom was for many years called Kyé-rim or \"Hen Forest.\" The second king of Sil-la was Sŭk-tŭl-ha, who is said to have originated from an egg among the people\nof Ta-p'a-ra in northern Japan. The neighbours determined to destroy the egg, but the mother wrapped it in cotton and, placing it in a strong chest, committed it to the waters of the sea. Some months later a fisherman at A-jin harbor in Sil-la saw the chest floating off the shore. He secured it and upon lifting the cover found a handsome boy within. He became the second king of Sil-la and in reality the founder of the line of Sil-la kings. Chu-mong, the founder of Ko-gu-ryū, was also born from an egg in far-off North Pu-yū. His foster-father wished to destroy the egg, but found it impossible to do so even with a sledge-hammer. The mother wrapped it in silks and in time it burst and disclosed the future hero. Origin from an egg is thus found to be a striking trait of Korean folk-lore. The transformation into human shape of animals that have drunk of water that has lain for twenty years in a human skull is another favourite theme with Korean story-tellers. Buddhistic stories are very common and probably outnumber all others two to one. This is because Buddhism gives a wider field for the play of the Korean imagination. The stories of filial love and other Confucian themes comprise what may be called the Sunday-school literature of the Koreans and while numerous they hold the same relation to other fiction, as regards amount, that religious or ethical stories hold to ordinary fiction at home.\n\nIt remains to sum up what I have tried to say.\n\n(1) None of the Korean dynasties, since the beginning of the historical era, has been founded through the intervention of Chinese influence.\n\n(2) The language of Korea, in that particular which all philologists admit to be the most distinctive of any people, namely, in the grammar, has been wholly untouched by the Chinese, and even in the vocabulary the borrowed words have been thoroughly assimilated and form no larger proportion of the whole vocabulary than do borrowed words in English or in many other languages.\n\n(3) In spite of the adoption of so many Chinese customs the temperament and disposition of the Korean remains clearly defined and strikingly distinct from that of the Chinese.\n\n(4) The religion of the vast majority of the Korean\npeople consists of a perfunctory acceptance of Confucian teachings and a vital clinging to their immemorial fetichism, the latter being modified by the Indian Buddhistic philosophy.\n\n(5) The one physical feature that differentiates the Korean from other men in his own eyes and which forms his most cherished heirloom from the past—which in fact is his own badge of Korean citizenship—the top-knot, is, according to his own belief, a purely Korean survival; while the Korean hat, the second most cherished thing, is also confessedly of native origin.\n\n(6) Every story borrowed from China can be matched with two drawn from native sources and the proverbs of Korea are overwhelmingly Korean. Even in borrowing they Koreanized their borrowings, just as the greatest English poet drew the plots for most of his non-historical dramas from European originals. In a country where illiteracy is so profound as here folk-lore exerts a powerful influence upon the people, and the very fact that the Korean resembles the Chinese in nothing except superficial observances shows that Chinese literature has taken no vital hold of him.\n\n(7) When it comes to tabulating those Korean things that are purely native and which have come down through the centuries untouched by Chinese influences the task is impossible because there are so many such things. They abound in Korean architecture, music, painting, medicine, agriculture, fetichism, marriage and burial customs, sacrifices, exorcism, games, dancing, salutations and jugglery.\n\nThe Korean's boats, carts, saddles, yokes, implements, embroidery, cabinets, silver work, paper, ji-gis, po-gros, pipes, fans, candle-sticks, pillows, matting, musical instruments, knives, and in fact the whole range of ordinary objects are sui generis, and the constant mention of these objects all down the course of Korean history shows that they are Korean and not Chinese.\n\nIn closing, I would call attention to the fact that in carefully studying Korean life and customs it is very easy to pick out those things which are of Chinese origin. Mr. Gale, in his valuable paper, pointed out many of them with great distinctness; but this very fact is a refutation of the state-\nment that Korea has been overwhelmed and swallowed up by Chinese ideas. If Korean life were such an exact replica of the Chinese as we have been led to believe, would it not be very difficult thus to pick out the points of resemblance and place them side by side with the points of difference?\n\nI would ask anyone who has travelled both in China and Korea whether, in walking through the streets of Seoul, he is struck with any sort of resemblance between the Koreans and the Chinese. They do not dress like the Chinese, nor look like them, nor talk like them, nor work like them, nor play like them, nor worship like them, nor eat like them, nor bury like them, nor marry like them, nor trade like them. In all the large, the common, the outstanding facts of daily life and conduct the Korean is no more Chinese than he is Japanese. In his literature he courts the Chinese, but the gross illiteracy of Korea as a whole detracts enormously from the importance of this argument.\n\nIt must be confessed then that, all things considered, the points of similarity with the Chinese are the exception and that the survivals of things purely native and indigenous are the rule.\n\nDISCUSSION.\n\nMr. Gale:—The writer of this evening’s paper was to point out “what remains that is distinctive of Korea and that differentiates her from China.” I still ask, What are the survivals? The race is here as little like the Chinese ethnologically as is their language philologically, but in their world of thought what survives? I ask.\n\nWe are told by the reader that they used to call their king Kū-sū-gan or Precious One; also Ch’a-ch’a-ong and Ch’a-ch’ung, diviner, wizard; also I-sa-geum, the Honourable; also Ma-rip-kan. No other than our mutual friend Ch’oê Chi-wûn says that these vulgar uncouth names were disliked, that the officials met and had them wiped out from the vocabulary of the nation. And what have they continued to call the king since 503 A.D.? Wang, in-gun, sang-gam, p’e-la, whang-je—every native name disappeared and nothing but Chinese names left—just as if in Great Britain they should drop the word king and say “rex” or “roi.” This was not forced upon Sil-la, but was of her own accord. Surely this is evidence rather of Chinese influence than of Korean survivals.\nThe writer in drawing a contrast between Tan-gun and Keui-ja would seem to leave the impression that Tan-gun's influence was considerable, and that Keui-ja was largely mythical or doubtful and his whole influence to be questioned.\n\nLet me read a part of the preface of the *Tong-guk Tong-gam*, before quoting from it a reference to Tan-gun and Keui-ja. \"His Gracious Majesty King Kang-hun, in conformity with destiny, opened up the kingdom, collected ancient writings and stored them away in the private library. [This was the founder of the present dynasty, who came to the throne in 1392]. Three kings in succession, increasing in excellent rule, appointed offices, opened up boards and collected histories of Ko-ryu, of which there was one called Chun-sa and one Chul-yo [Complete Chronicle and Important Events], and by degrees the writings of historians were put in order.\n\n\"King Se-jo He-jang, the holy heaven-sent scholar whose spirit dwelt in history, said to his courtiers 'Although our Eastern State has many chronicles or outlines (Sa) it is without an extensive book of history (*Tong-gam*). Let us make one according to the Cha-chi,' and so he ordered his scribe to prepare it but it was never finished (1455-1468 A.D.).\n\n\"His Majesty, our present king, came to the throne, took control (1469), and following the plans of his ancestors commanded Prince Tal-sung and nine others, including the writer, Ye Keuk-ton, to prepare the *Tong-guk Tong-gam*.\"\n\nThey completed their work in the twenty-sixth day of the seventh moon, 1485, seven years before Columbus discovered America, and their work is regarded to-day—yes, I believe I am safe in saying it—as the very highest authority on Korean history. The Educational Department has made it the basis of the *Tong-guk Sa-yen* recently published.\n\nNow that the authority is given let me in two or three paragraphs quote what is said of Tan-gun and Keui-ja. Regarding Tan-gun it reads:\n\n\"The last State was without a king when a spirit-man alighted beneath the Sandalwood tree. The people of the country made him king, King Sandalwood (Tan-gun). The name of the state was Cho-sun. This took place in Mu-jin year of Tang-jo (2333 B.C.). At first Pyung-yang was the site of the capital, but afterwards it was removed to Puk-ak. He continued till the year Eul-mi, the eighth year of the Song monarch Mu-jong (1317 B.C.? ). Then he entered A-sa-tal Mountain and became a spirit.\"\n\nThis is all that is said of Tan-gun. No mention is made of him in Chinese history that I have been able to discover. In fact, he belongs entirely to the mythical age. But with Keui-ja it is different. As long as the \"Great Plan\" stands in the Book of History we have no doubt of Keui-ja's having once lived. Over 100 pages in Vol. VI. of the Korean edition are filled with notes of Chu-ja and other sages of China, explain-\n\n*A famous history written in the Song dynasty by Sa Ma-giung and used as a model by Chu-ji. See Notes on Chinese Literature by Wylie, page 20.*\ning the meaning and purpose of Wisdom as seen in the *Hong-püm*. We must admit that he existed in a very different way from Tan-gun. Now as to his having been in Korea, Ch'ā-jim, a Chinese scholar of the 12th century, who annotated the Book of History, says \"After Keui-ja wrote the Great Plan, King Mu appointed him to Cho-sūn and made it an independent state because Keui-ja did not wish to serve King Mu.\" In the ninth book of the Analects we read that Confucius desired to go east and live among the barbarians, crossing the sea, which certainly proves that Manchuria was out of the question. Some one asked, \"Would that not soil you, master?\" His reply was \"Nothing can defile where the Superior Man is.\" Hu-ja-pang adds the note \"When a man like Keui-ja could take over Cho-sūn and live among barbarians, what is there about it that is mean?\" Mayers, Giles and Legge, all understand that Keui-ja came to Cho-sūn across the Yalu, and Carles says that the sights and associations around P'yŏng-yang make him as evident there as Shakespeare is in Stratford-on-Avon.\n\nThe *T'ong-gam* goes on to say, quoting from the Book of History, Vol. VI., that Keui-ja did not wish to serve a usurper; that King Mu handed him over Cho-sūn; that he gave the people the Eight Laws and the Nine Field Divisions—in fact, that he endeavoured to carry out the principles so wonderfully stated in the Book of History and so highly praised by the sages of China. The result was—no need to lock the doors; the women were chaste and faithful; fields and meadows were opened up; towns and cities were built [apparently before that time they were the wandering peoples called the \"Nine Tribes\" in the Book of History]; people ate from sacrificial dishes and there was development of truth and goodness.\n\nA Chinaman, Pŭm-yŭp, who lived about the 5th century A.D. and wrote the Book of the After Han, says that Keui-ja made his escape came to Cho-sūn, gave the document of the Eight Laws and made the people know what they prohibited, so that there was no unchastity or theft in the cities; they did not lock their doors by night; gentleness became the custom; religion and righteousness abounded; laws for teaching were definitely stated, and faith and virtue were practised so that the source of law as acknowledged by the ancient sages was received.\n\nHam Ho-ja also says \"Keui-ja mustered 5,000 men of the Middle Kingdom, came to Cho-sūn, and brought with him poetry, history, ceremony, music, medicine, witchcraft, the Eum-yang, divination, fortune telling; also the various kinds of workmanship, skilled labor. When he came to Cho-sūn he could not communicate by speech and so understood by interpretation. He taught poetry, history—so that the people might know the forms of ceremony and music of the Middle Kingdom—the religion of father and son, king and courtier, the law of the five relationships, also the eight laws, elevating faith and goodness and making much of culture and causing the customs of the Middle Kingdom to ferment in the land. He taught them to esteem lightly military valour, but to repay violence by virtue. The neighbouring states all looked\nup at his righteousness and made friends. Because his clothing and fashions were all like those of the Middle Kingdom, they called Cho-sun the State of Poetry, History, Ceremony and Music, the King of Charity. Keui-ja began these things and who can fail to think so? As a result of the reign of Keui-ja the Han records speak of Korea as the Development of Goodness; the Tang records, \"The Superior Man's Nation;\" the Song records, as the Country of Ceremony, Music and Literature.\n\nThis ends the account regarding Keui-ja and Tan-gun, and to my mind it excludes the possibility of the correctness of the comparison drawn in today's paper.\n\nI mention Keui-ja particularly because I believe that his is the most powerful influence that has touched this country in the person of one man, for he has continued till today in his writing and laws. Even the formulation of the Five Relationships came from Keui-ja.\n\nWi-man is spoken of as a semi-barbarian half Manchin. He was a Yüan-in, which today means Pekingese; he helped build the Great Wall against barbarian tribes, so I include his influence in that of China. When he first came to Cho-sun Keui-jun made him a Pak-sa or Doctor of Laws. He must have been acquainted with Chinese civilization to merit such a title—unless he purchased his degree—in which case it would show his respect for things Chinese. I connected the top-knot with Wi-man, because the history says \"Wi-man flying for his life with 1000 followers and more wearing the 'Ch'ü' (top-knot) came to Korea.\" I would like to get from the reader of the day the authority that says Tan-gun gave the top-knot and to see the Chinese character that is used to express it.\n\nThe writer maintains that the Three Hans were all named years before the Chinese came and that they, the Chinese, did not in any way figure in the founding of these states. The name Han, however, has evidently come from China and it came to stay for the present name is Han once more. The Tong-guk Tong-gam says: \"Chin Han (using the Chinese hour character Chin) was to the west of Ma-han. The story is that fugitives from the Chin State of China, in order to escape trouble, came to Han. Han apportioned to them territory to the east, where they set up their city. Their speech was the same as that of the people of Chinese Chin. Some call the country Chin-Hau (using the same Chin as the Chinese). They had as king a man from Ma-han, and although they continued from generation to generation it is evident that they did not become independent. They were permanently under the restraint of Ma-han. The land was suitable for the Five Grains. Their custom of agriculture provided sufficient. They skilfully weve silk and cotton; they rode in ox and horse carts. They had marriage laws and the sexes were separated. Those on the road meeting women would stop and ask others to pass before them.\"\n\nKwun-geum, who was a minister of the Ko-ryu dynasty and royal librarian in 1375, says \"The language of the Three Hans was not the same. The Cho-sun king, Keui-jun, who escaped from the war of Wi-\nman and came south by sea, united fifty separate states, opened up a kingdom and called it Ma-han. It lasted till the time of On-jo of Päk-je, who united it into one. Ok-ju of to-day is the ancient site and people still call it Keui-jun's city. The founder of Sil-la, Hyük-kü-se, set up Chin-Han or made it one state.\" All this would seem to contradict what we have heard and to say that the Chinese and descendants of Chinese had much to do with the gathering together of the small separate states under the names of Ma-Han and Chin-Han.\n\nThe reader asks What is Confucianism? Simply a formulation of those simple laws of conduct which are common to the entire human family, the love of parents, etc., etc. I leave a future paper before this Society, whoever it may be written by, to deal with this paragraph. It seems to me it has looked at a detail or two and missed the whole colossal outline of Confucianism.\n\nSüi-chüng invented the Nitu to \"wean\" the natives from Chinese, we are told, but it seems to me to be a system designed rather to aid and encourage the reading of Chinese.\n\nThe simile so well worked out with England as the other quantity is most interesting but I question the correctness of it. If the comparison with England were true and classic and Continental influences were equal to the influence of China upon Korea, I should not expect to find England mother of a republic like the United States or so evident in India, South Africa, Australia and Canada. Since the ancient Britons were, as the reader affirms, much like the ancient Koreans—equal in their manner of life, ignorance and superstition, and if, as the writer also maintains, the influence from the Continent were the same as that of China upon Korea, I should expect to find in England to-day a condition similar to the one here. What would it be? Let us picture it merely in the literary kingdom. I enter a primary school and the boys are singing away at Latin and Greek. There are no girls, I beg you to notice; that is part of the influence. Do they understand what they read? Oh, no! they're studying the sounds now; they'll get the meanings later. No English history is taught; no English literature. English is spoken merely as a means of getting at the classics. \"Sing, oh goddess! the destructive wrath of Achilles.\" In recess time games on the lawn would be between Priam and Agamemnon. They would talk of battering down the walls of Troy, as though it had happened yesterday. The nurse caring for the baby would sing of Diomedes and Hector and the men as they work at the docks would sing of Menelaus, who was a contemporary of Kang-tä-kong that the coolies sing of here; of Agamemnon, who stands for Mu-wang; of the Troubadours of Languedoc, who lived at the time of Yi Ta-päk and of Titus Quintius Flamininus, who was a contemporary of Han-sin. Nine songs out of ten would take you to the Olympian Mountains or the Forum.\n\nI go to a book-store and inquire \"Have you a history of the reign of Elizabeth?\"—Upso (no-have-got). \"Or of George the Third?\"—\"George the Third? why you must be ignorant!\" says the book man. \"There can be no official history of George the Third until after this dynasty goes to\npieces. There is one written of Elizabeth, however. I haven't any; but there is a Jew down in Whitechapel who had one last year, but whether it is sold or not I can't tell.\" \"What histories have you, pray?\"—\"This room is filled with the Taking of Troy, Invasion of the Persians, Battle of Marathon, The Messenian War, Philip of Macedon, Punic Wars, Mithridates, Caesar. Of course you know the Goths came in the 5th century and knocked out everything. We've had no history since. I have here a new edition of a book of prayers to Pluto and Venus. Here is a book also that proves that Ovid was superior to Moses; also the History of the Peloponnesian War by Thucydides. By the way, I have a book or two on the Crusades, but it is too modern to be interesting and the style is poor; I advise you to read Thucydides instead.\" \"But I'm after English history. What about the battle of Waterloo?\"—\"Waterloo? when was that? Oh, yes! I remember now, but it has never been put into Latin; we have not any. Wellington, was that his name? He was great, they say; but yet he was nothing compared with Leonidas. How those Spartans did fight! wonderful, wasn't it?\" The books, too, are all in Latin and Greek.\n\nAt last I find a modest shop that sells English stories. I open one and it reads \"In the Fourth Year of Sextius Pompious\"—and drop it. Another \"John Smith, a soldier serving under Charles Martel.\" This is the latest date that figures in the book store. Another \"When Alaric invaded Italy.\" I ask for newspapers and am told that there are none. \"Why do you wish newspapers? Can they equal the classics?\"—and silence settles over me. People talk in a half conscious way of South Africa but no one knows definitely. Scholars are reading Xenophon in place of Chamberlain. The non-lettered classes are eating, dozing, smoking, sleeping.\n\n\"Who are your noted men and what public days do you have?\" I ask. \"Our noted men, in fact, the only noted men the world has ever seen, are Homerus, Aeschylus, Aristotle, Demosthenes, Themistocles, Epicurus, Hyacinthus, etc., etc.\" \"But what about Chaucer, Spenser, Shakespeare?\"—\"We do not keep them. They are low class literature, and you'll find them in second-hand shops and old clothes stores. Our noted day are 1st. The Roman New Year, 2nd. The Birthday of Romulus, 3rd. In honour of Alexander, 4th. Thanksgiving Day.\"\n\n\"Whom do you worship?\"—\"Worship! why Jupiter, Venus, Mars, of course and the rest of them.\"\n\nIf I should find such a state of affairs in the world of literature and thought in England I should not say that Englishmen were Romans or that the English language was Greek, but I should say: \"These people have been influenced by the Continent in precisely the same way that Korea has been influenced by China.\" But as there is no such condition I believe there has been no similar influence. The voice of Greece and Rome says \"Forward, march!\" the voice of China says \"Retreat.\"\n\nMr. Jones:—In attempting to identify those customs and institutions of the Koreans which are not traceable to China, and which may be said to be original with the Peninsular people, and to have persisted through\nthe centuries of Chinese influence to the present day, we are confronted at the outset by the question of the origin of the Korean people. Without attempting to enter into a discussion of this very interesting phase of the question, I would say that it seems agreed on all sides that the aboriginal Korean did not come from China. That is to say—there was an original stock here upon which Chinese influence came to work, and in relation to that stock Chinese influence was foreign. Mr. Hubert is therefore correct in contending that there are among the Koreans many customs and institutions which are purely Korean and do not belong to the category of Chinese influence. There was a time when this Chinese influence did not exist here. The Koreans were then sinom-pure, as the saying is. They had their own social and political economies, and were developing along the line of forces which were original with themselves. But we must also agree with Mr. Gale that there was a time and a point at which Chinese influence came in, and a period during which it gradually spread itself over the face of Korean society and impressed it with many of its features. We must also agree with Mr. Gale that this period has been a long one and the work very thorough. The Chinese influence had its beginning with the Keui-ja dynasty, but when Keui-ja came to Korea he found here a settled populace existing under the rule of the Tan-gun chiefs. Then when Keui-jun, the last of the Keui-jun kings, fled south, he found numerous communities out of which he organized his principality of Ma-han. As history develops we hear of other peoples as inhabiting the Peninsula, such as the Māk, Yē, Ok-chū and Rum-yu tribes, all possessing customs and peculiarities of their own. These peoples were confessedly not Chinese, and the customs and habits which they originated have either persisted through the centuries, or have been modified or have been utterly obliterated. Many of them have been obliterated. The So-do or \"thieves' city,\" a place of refuge for criminals among the Han peoples, to which they might flee from the vengeance of those they had wronged, and which is a remarkable reminder of the Cities of Refuge of the Old Testament, has not existed for many centuries. The custom of burying people alive in the tombs of royalty was discontinued in Sil-la in the 6th century A.D. The Ok-chū custom of preserving the skeletons of the dead in the trunks of burial-trees has also disappeared. These and many others are the customs of savage tribes, which naturally gave way to the better order Chinese influence introduced.\n\nAmong the customs and institutions of today which have not come from China, but seem to be entitled to the term \"Korean survivals,\" the spirit or Shaman worship of the Koreans is one of the chief. The traces of Shamanism are to be found in the very dawn of Korean history. Tan-gun, the first worthy mentioned, claimed descent from Ché-sük, one of the chief Shaman demons. The early kings of Sil-la took the Shaman title of seers or exorcists for the royal designation. As far as we know this has always been the Korean's religion and while we would not deny that China has its demon worship, yet, at the same time, we would claim that the Koreans did not have to go to China for\ntheir system, but that it existed from pre-Kuui-ja days and has persisted to the present time.\n\nIn this connection I would mention another \"survival\" of some interest, namely, the fetich system which is a part of Korean Shamanism. The old shoes and battered hats and torn costumes and broken pots which are the emblems of its demons, seem to belong to Korea. This is mentioned as being a special feature, distinguishing the aborigines of South Korea from the Chin emigrants who came to the Peninsula in the days of the Great Wall Builder, and mention is also made at that time of the shrine just inside the door, where, to this day, the Korean keeps the emblems of the gods of luck. Along the same line are the Sung-whang-dang, or shrines along the way-side and in mountain defiles, composed of loose stones. These, I am told, are certainly not Chinese.\n\nTurning now to the Korean social system we notice that one of its most prominent features is the caste idea which is firmly held to among the Koreans—a feature which stands them up in direct contrast to the Chinese. The gulf which separates the Korean sans-hom from the yang-ban is a wide one. The low-class man may not enter the aristocrat's presence without permission, and then the favour, if granted, must be recompensed with humiliating observances, which would seem to indicate that the yang-ban regards himself as of separate origin and clay from the coolie. We call this Yangbanism, which is another word for Caste. It certainly does not point us to China. It is not to be deduced from the teachings of the Confucian sages, though these have inspired the Korean with such a high estimation of the worth of learning that he has been willing in order to recognize literary talent, to mitigate some of the severities of the Caste system. The poor, blooded aristocrat, tracing his ancestry back to a superior and conquering family or clan, moves in a circle of society to which the tainted low-class man can never hope to find entrance. No intermarriage is possible among them. Certain of the middle grades of the social scale may furnish the yang-ban with concubines but never with a wife, and there are some grades among the lower classes from which he would not take even a concubine. Men from the lower classes may by sheer merit force themselves high up in official preferment, but under the system which prevailed until 1895, and which was distinctively Korean, there were lines of civil service from which they and their descendants were forever barred by the accident of their low birth. This certainly is not Chinese. While there is a vast difference between the Caste idea of India and that of Korea, yet its manifestation in the latter country points away from and not to China.\n\nUnder this general heading of Caste in Korea we must place the honorifics of the language. These constitute one of the most complicated and knotty problems confronting the student. And yet to the Korean they come as easy as breathing the air. To him they are not simply a habit or frame of mind learned from some outside source, but they constitute an element of personality and the key-note of his entire philosophy of life, which neither Confucius nor Sakyamuni have educated out of him.\nAnother Korean \"survival\" may be found in connection with the architecture of the country. For instance, in China the chief building material is brick. Brick meets the eye wherever it turns there. Now I suppose that as good brick can be made of Korean clay as of Chinese clay, and yet the Koreans have remained loyal to their native mud. The constituent materials of which the Korean houses are built have survived all the rude shocks of Chinese influence and are to-day, as in ancient times, of unbaked mud. We are told that in the times of Tanguin the aborigines lived in pits in the ground in winter time and in the trees in the summer. And to-day it would not be difficult to find a score or more of families in Seoul or Chonulpo who have simply dug a pit or hole in the ground, covered it with a thatch-roof with a hole for an entrance, and are living in it unembarrassed to any appreciable extent by this literal return to their original source. Then take the mud hut which is the universal domicile here and contrast it with the pits alongside, and it does not require a very vivid imagination to see in the hut simply the pit or hole in the ground taken out of the ground, set up above the surface, and braced with sticks and straw so that it will stand. The Korean house, as far as the average type is concerned, is not Chinese.\n\nWhether there are any pure Korean \"survivals\" in the Korean costume I am unable to say, but they themselves claim that the wristlet worn by them is not Chinese. It would be interesting to know whether this claim will stand the test of investigation. While on this point, however, I would say that I am inclined to think that the green cloak worn by the women as a veil over their heads, which has caused some one to liken them to animated Christmas trees, is not Chinese.\n\nFrom earliest times the Koreans have been noted among the Chinese for their fondness for fermented and distilled drinks. We find this weakness mentioned in the native histories of the aboriginal tribes, and it seems to be in a special sense a Korean custom. The Korean has certainly not gone to China for his beverages, else tea would have come into use here. Neither did the Korean go to China to learn how to make alcoholic drinks. He has certainly possessed that knowledge as long as we find any trace of him.\n\nIn this connection the Korean's fondness for hot flavours in his food might be mentioned. Pepper is a favourite condiment with him and in this he stands in direct contrast with the Chinese. Among his foodstuffs investigation would doubtless reveal many interesting and remarkable \"survivals.\" And so with ordinary life. Did we know more about the Korean and his history, and how he regards the customs and institutions which are his, we would find many things of which he alone is the ingenious contriver. In conclusion I would mention the Korean method of ironing, which the Koreans claim is their own or at least did not come from China. How true this is I cannot say, but I mention it as representing the native idea in the matter.\n稽古高麗光宗之十九年己巳沙梯村女採薪于盤藥山西北隅忽聞有童子聲俄而進見則有大石從地中聳出心驚怪之歸言其女婿婿郎告于本縣自官覈奏上達命百官會議啓曰此必作梵相之兆也令尚醫院遣使八路數求掌工人成梵相者僧慧明應舉朝廷擢工匠百餘人始事於庚午訖工於丙午凡三十七年也尊像既具欲安道場遂十餘人并力齊運而先頭至連山地南村二十里因名其村曰牛頭也慧明雖成神像方以未立為慮適到沙梯有雙童子戲造泥土為三同佛像即平地而先立其本積泥土而次立其中又如是而竟立其末慧明熟視大悟欣然還來一如其規乃立厥像盖童子即文殊普賢化為指敎云佛像身長五十一五尺五寸圍三十尺耳長九尺眉間六尺口角三尺五寸火光五尺冠高八尺蓋力廣十一尺小盖六尺五寸小金佛三尺五寸蓮花枝十一尺或塗黃金或飾紫金於是乎四方風聞萬姓雲集敬禮者如市故名具前流日市津也立畢天雨大注洗滌體像瑞氣盤欝至三七日眉間玉毫之光照曜乾坤內中國僧智眼望氣從來而禮之曰嘉州有大像亦東向而立光明同時相應云名觀燭也自是之後祥瑞之氣時從梵相出直透半空。\n外八表緇素之徒一邦貴賤之輩無不敬奉焉者昔在唐亂賊兵至鴨綠江此像化為芦笠僧塞衣渡江衆知其淺駈入水中溺死者過半矣唐將以劔擊之斷其笠子而所戴蓋冠自稱破缺其標完然可知其為國之誠國家泰平則滿身光潤瑞氣盤空凶亂則遍體汗流乎花無色\n\n朝廷遣官祝辭曰敬設消災國泰民安云云自古風俗盡誠奠崇無不陰霽禱其萬物則各隨其願此亦報應之明效也古蹟所記多有破落難以悉解正門法堂初設於洪武十九年丙寅重修於萬曆九年辛巳居士白只康熙十三年甲寅僧智能改修雍正十三年乙卯僧性能改修徐潭村信等所造鐵網云耳佛狀塗灰則僧信摠蔽為化主乾隆庚申改築石樑兼於床卓亦皆一新云稱銘曰長身屹屹方冠峨峨層三而連丈六之加千佛之宗萬像特靈效所著冥應靡滅有禱莫違無願不從潛運化權默輸神工日月明並天地德合四方風聞萬姓雲集傾財破產竭誠殫力燈燭煬煌紙錢堆積惠我邦家恤我愚蒙傑然之姿卓爾之客前古所無後古唯有於休尊像與世同久壬午六月令內司遣人脫網\nTRANSLATION OF THE INSCRIPTION TABLET,\nEUN-JIN BUDDHA, KOREA.\n\nFRONT.\n\nLooking back to ancient times we find that in the year Eul-sa, being the 19th year (A.D. 996) of the reign of King Kwang-jong of the Ko-ryū dynasty, a woman of the Sa-jé hamlet was collecting bracken among the P'an-yak Hills, when from the north-west nook she heard the voice of a boy. Presently she approached the place and saw a big stone protruding from the ground. She was frightened and amazed and returning home told her son-in-law, who reported the matter to the magistrate. The latter having made an official inquiry sent a report to the Throne and the officials were ordered to meet and deliberate. Their decision was that the stone was certainly intended for an image of Buddha. The High Department of Physicians was then ordered to send messengers throughout the eight provinces in search of artists to fashion it into the image of a Buddha and the monk Hyoé-myūng answering the call, the Throne selected over one hundred stone cutters to assist him to begin the work. The work was thus begun in the year 968 and completed in the year 1004, thus covering a period of thirty-six years.\n\nWhen this holy image was completed a place was sought in which to erect it and the united strength of over one thousand men was employed in transporting it. Now because of the head having first reached the place which is near Yon-san and\nsome 20 li from the south hamlet, that village is therefore called \"Bull's Head.\" Although Hyoé-myüng had completed the image he had begun to worry over its not having been set up when one day he saw twin boys who were playing at making with earth the image of Buddha in three sections. On level ground they first put up the base or lower section, and building a mud embankment around it, they stood on this and built up the middle section, and so on to the last. Hyoé-myüng watching them was greatly enlightened, and joyously returning to the image, erected it in accordance with this example. These twin boys were none other than the Buddhas of Knowledge and Wisdom, who had transformed themselves in order to give instruction.\n\nIn height the body of the Buddha is 55 ft. and 5 in. It is 30 ft. in circumference. The ears are 9 ft. long. The distance between the eyebrows is 6 ft. The mouth is 3 ft. 5 in. and the cheeks are 5 ft. The hat is 8 ft. high. The slab of stone on the head is 11 ft., and the smaller slab is 6 ft. 5 in. There is a small gold Buddha 3 ft. 5 in. in height. The stalk of the lotus flower is 11 ft., plated with yellow and dark red gold.\n\nThe fame of these events spread far and wide and worshippers by tens of thousands gathered like the clouds, so vast being their numbers that they made the place to resemble a market and this gave the name of Si-jin (Market Ferry) to the ford in front of the image. When the image was finally erected the heavens poured forth a heavy rain which cleaned the Buddha and a holy light appeared to envelope its body. About three weeks later there was seen a luminous light resembling jade shining forth from between the eyes which illumined heaven and earth. And the Chinese monk, \"Sagacious Eye\" (Chi-an) having seen the light was guided by it to the image. Worshipping he said:—\"In Ka-ju (China) there is a great image which also stands facing the east and from it reflects a light which coincides with the reflection from here.\nIt is called Kwan-ch'ok (Reflecting Candle Image).'' From that time on the holy and propitious light was often seen shining forth from the image straight into and beyond mid-heaven. Among all the black-robed classes (monks and priests) and the rich and poor masses of the entire country there was not one who did not reverently respect it.\n\nOnce there was war with the Tang dynasty and a multitude of the foe's troops arriving at the Yalu river, the image transformed itself into a straw-hatted monk and girding up its garments about it forded across the river. The army of the enemy, thinking the water shallow, attempted to cross, but falling in the water, more than half perished. This so greatly angered the general that he struck the monk with his sword, cleft the hat, and damaged the inner cap. The evidence of this is still visible. This shows how devoted it is to the dynasty. Whenever peace reigns in the country the propitious light shines bright from its entire body and is reflected in mid-heaven. But whenever the people are in a disturbed state perspiration is to be seen flowing from all parts of the body and the colours disappear from the flowers in its hands.\n\nBack.\n\nHere came the officials of the government reverently praying that evils be dispersed, peace prevail in the nation and the people enjoy quietness. And from former times it has been the custom never to refuse secret aid when sincere worship and honour were paid. Of ten thousand things prayed for, it is universally known that not one deserved thing was ever refused, but favours were freely bestowed. But as the accounts of many of its miracles have disappeared it is difficult for us to record them.\n\nThe Mani temple was built in 1386. It was rebuilt by the layman Päk-chi in 1581. In 1674 the monk Chi-neung again rebuilt it. The monk Sung-neung had the hon-\nour of again rebuilding it in 1735. The iron chains were contributed by So-dam and Pak-sin. The lime plaster on the head was done by the monk Sin-jong. There was once a wall of stone and earth about it, but it fell into decay and disappeared and the most glorious platform became a place for heaping up refuse. An old man, grieved at the ruin of the place, became a solicitor of funds to restore it, and in the year 1740 a stone wall was built and the altar and utensils were renewed.\n\nThe colossal body so dignified, and the cap so lofty! The three sections joined together are higher than six heights! The chief of a thousand Buddhas and the most spiritual of ten thousand idols! Its revealed benefits and secret favours have never ceased. Things prayed for were never denied and things wished for never refused. It exercised secretly the perfect power of Wonder and silently piled up divine merit. As brilliant as the sun and moon, and as virtuous as the heaven and earth, its fame is known everywhere and multitudes gathered to it like the clouds, selling their possessions and breaking up their property in the single desire to do reverence perfectly. Lamps and candles gleamed brightly and money was heaped up in front of it like earth. It gave grace to the royal house and pity to the foolish multitudes. The substance of its perfection and its exaltation were like its towering head. Never before was there its fellow with like dignified appearance and holy countenance and it will be difficult for one to appear in the future. Oh beautiful, thou idol! Thou shalt last as long as this earth stands.\n\n(The inscription ends with the names of the persons who composed and cut the inscription on the tablet and the date 1743 (?), followed by the names of sixty-seven persons who contributed the funds for the work).\nKOREA'S COLOSSAL IMAGE OF BUDDHA.\n\nBy REV. G. H. JONES.\n\nIn a deserted nook in the mountains which mark the boundary between the provinces of Chung-chüng and Chülla there stands the colossal stone Buddha of Korea, surrounded by desolation and abandoned to the ravages of time. A long cherished plan to visit and inspect it has been realized by the writer, and the following account has been prepared in response to your kind invitation. Prefatory to the account of the trip, I would call your attention to two things which must impress the observer in connection with monuments in general throughout Korea.\n\nFirst of all, the interest in them is dependent—as is the case with monumental relics generally—upon a knowledge of their history. It is rare that we find a monument which possesses such noteworthy features that, divorced from its historical associations, it attracts the passer-by. Of course there are monuments in the Far East, which for their own intrinsic worth repay the visitor, but in this feature Korea cannot begin to compare with China or Japan, and is necessarily a disappointment to the tourist. But for this condition of affairs we cannot altogether blame Korea, for this disappointment is due not so much to the lack of monuments on the part of Korea as to the lack of historical knowledge on the part of the tourist. For Korea, like every other nation, has its great monuments. There are scattered throughout the land memorial marks which stand for historical tragedies and comedies, for the rise and fall of royal dynasties, for religious, political, commercial and racial conquests, for the great deeds of great men, and sometimes for the foolish deeds of foolish\nmen. It is foreign to the purpose of this paper to give examples of each of these classes, though it might be done. Suffice it to say that today, to the great mass of the Koreans, these monuments stand voiceless and meaningless because their history is unknown or inaccessible and the oral traditions concerning them have wandered so far from the path of truth during their journey through time that they no longer shed light in the darkness which surrounds them. A large field and an interesting awaits scholars at this point. Already the Hon. H. N. Allen has placed us under a debt of gratitude in preserving for us in the earlier volumes of the Korean Repository some account of the interesting places about Seoul. Let us hope that one of these days native scholars will take this matter up and that these memorials will once more become vocal of the events, ideas and institutions for which they stand.\n\nThe second matter of which I would speak is the disappointment which awaits a person visiting Korean monuments, due to the decay and ruin in which they are generally found. They seem to have been abandoned as useless and valueless, left to be the sport of time and of the elements, to crumble into dust and disappear in the wind. This is certainly an anomaly among a nation of ancestor worshippers. Take, for instance, the pagoda monument of Seoul—a beautiful specimen of carved marble of which any city might be proud and which has stood in the heart of the city for seven hundred years. Three centuries ago it became the object of the destructive fortune of war, and the victorious Japanese, attempting to destroy it, succeeded in pulling down the upper part. The debris lay in the square about its base, and it would seem that one of the first things the Koreans would do on regaining possession of the city would be to restore the monument. But the debris was left where it had fallen for three hundred years undisturbed. Houses gradually encroached on the square on which it stood until one builder, becoming more bold than the others, finally erected his house around the monument, leaving it standing in the centre of his inner court, which was not more that twenty feet square. And here it was left until 1895, and to visit it you had to go along filthy alley-ways, squeeze your way through Lilliputian doorways,\nbefore you could reach it. It is certainly a matter for congratulation that this condition of affairs has been remedied in the case of the Seoul pagoda, and the work might well be taken up in connection with other places.\n\nAmong the really great monuments of Korea the colossal stone Buddha of Bun-jin occupies a foremost place. About it centre most interesting tradition and legend; its manner of construction makes it a genuine curiosity, and its size constitutes it a real wonder. It is a memorial of religious conquest, and our interest is increased when we reflect that today it stands for the glory and the fall of Korean Buddhism.\n\nIt will be in order to give first some account of the journey necessary to reach it and the locality in which it is located.\n\n(1) THE JOURNEY.\n\nThis colossal image is erected in the prefecture of Bun-jin, in the southern part of the Chung-chung province. To be exact, the monastery in which the Buddha stands is 400 li south of Seoul (130 English miles) and may be reached either by pony or by chair from Seoul in four days. We left the Capital in November and on bicycles took the great southeastern road down the Peninsula through Su-won to Kong-ju. The road itself is a fine one and we enjoyed this part of the trip very much until near Kong-ju, when some heathen stole our pump and the bicycle was rendered useless. (Moral—take along an extra pump with your bicycle). The road is a very interesting one. At Su-won you find one of the prettiest walled cities in Korea, and the accommodation at the inns is not altogether bad. Near by is the tomb of a former crown prince, who lived about the middle of the eighteenth century, and whose history makes this tomb the monument of a great tragedy. Upon this crown prince, whose name was Chong-hon, has recently been conferred the posthumous title of emperor. The mausoleum is well worthy a visit for its beautiful groves.\n\nBetween Su-won and Kong-ju we strike the A-san battlefield, where was fought the opening land engagement of the Japan-China war and where you can still trace the course of the conflict. On this section of the road the inn accommoda-\ntion is execrable. Arrived at Kong-ju we again can get fair accommodation for Korea. Kong-ju is a very interesting city, but we spend only one night there and keeping still to the direct south along the road to Chun-ju, a day's journey, as Korean ponies travel, brings you to the monastery. It was our good fortune to take another road down the valley of the Keum river to Kang-gyūngi, where we found Rev. F. W. Steadman, who gave us much assistance and as we were thus only twenty-five li away from the Colossus this was most convenient.\n\nAnother possible way of reaching the Colossus is to go by steamer to Kun-sau. From there to Kang-gyūngi is only 90 li and there is a steam launch in which the distance may be made.\n\n(2) HISTORY OF THE LOCALITY.\n\nAt Kang-gyūngi we are in the prefecture of Eun-jin in which the image stands, this prefecture being a small border district between the provinces of Chung-chūng and Chūlla. It lies in the valley of the beautiful Keum-gang, or Embroidery River, and first came to notice historically in the time of the ancient kingdom of Pāk-che (B.C. 17—A.D. 660), during which time the district was known as Tok-geun Kun. We are told that it was a great commercial centre of Pāk-che, so it must have played no small part in the introduction of foreign things into that kingdom. After several changes in its name it was incorporated into Sil-la when that kingdom overthrew Pāk-che, and given the name of Tūk-eun. In 1019 a slight change of the characters, which did not change the sound, was introduced, and this remained its name until 1419, when the present name of Eun-jin was given to it. In this new name we find some interesting hints of a historical character. The first syllable \"Eun\" is of course a relic of the old Silla name of the district. The new syllable \"jin\" is part of the name of an ancient district which was abolished in 1419 and its territories incorporated in the new prefecture of Eun-jin. The name of this old district was Si-jin-hyen. In its name \"Si\" means a market or place for trade; \"jin\" means a ford or ferry-place; \"hyen\" indicates a magistracy of lower grade. This name indicates the character of the\nplace, which was a port of trade, a great commercial emporium famous in those ancient days; and that the region has not lost this character to this day the great markets at Non-mi and Kang-gyŏngi bear witness. It was to the ancient Si-jin that the warlike and quarrelsome merchants of Pāk-che resorted fifteen hundred years ago to carry on their trade. And that it was a port of much importance is indicated by an old inscription which, describing the merchant junks anchored there, said that the ships usually lay so closely packed in that their masts and rudders were one inextricable mass. And to this point, in those days so long gone by, must have come the merchants of China and Japan, sometimes for trade, sometimes accompanying the envoys of their countries, sometimes bringing warlike expeditions which wrought havoc far and wide.\n\nBut the special interest these facts have for us in connection with the great Buddha lies in the fact that it may have been here that Buddhism itself first entered Pāk-che. Buddhism was a foreign importation, being sent to the peninsular kingdoms by the Eastern Tsin dynasty of China (A.D. 317—19) and effecting an entrance almost simultaneously at two points—in the north into Ko-gŭ-ryū and in the south into Pāk-che. Of this latter event the native historians tell us:—\n\n\"In the year A.D. 384, the barbarian monk Maranant'a came from Tsin. King Chip-yu accorded him a most courteous and ceremonious reception and Buddhism was established as the national religion.\" We do not know at what point the monk-missionary landed, but it is not so unlikely that he may have come to this well-known port, and that one day among the ships making up that inextricable mass of \"masts and rudders\" at Si-jin there may have come the imperial junk of Tsin bearing the \"barbarian monk Maranant'a\" with his images, incense, bells, books and vestments to plant in Korea that cult which was to dominate the people for a thousand years, thus landing close to the place where in later years the greatest monument that Buddhism possesses was to stand. And two hundred years later (A.D. 550) there probably embarked from this port that band of Pāk-che priests sent by their king to carry to the mikado of Japan the golden images of Buddha and the triad of precious ones, the sutras and sacred\nbooks, and to give the faith of Buddha to the Sun-rise Empire. And it is said that these relics exist to this day and are preserved in the city of Nagano in Japan.\n\nHow appropriate then that in a region so rich in Buddhistic fancies, legends and lore should stand the most notable existing monument of Korean Buddhism. While we cannot recover from the past the reasons which caused the Buddhist hierarchy to locate the colossus at this point, we certainly agree that the locality has been most fitly selected.\n\n(3) THE MONASTERY.\n\nThe colossal Buddha is at Kwang-ch'ok-sa, the Monastery of the Candle Lights. This name was given to the temple by a Chinese monk who once visited the place and claimed that in China there was a duplicate and that the name of its monastery was Kwan-ch'ok-sa, as we learn from the inscription. As we approached it from the valley below, through which runs the great overland road from Seoul, the sight was a striking one. High up on the hill side, on a plateau possibly 300 feet above the valley, was the monastery, its buildings clustering about the idol, and above their roofs rising the head and shoulders of the image, white and shining in the sun, its wide open eyes staring down at the beholder and well calculated to impress the superstitious with awe. The whole is in a sort of niche or nook in the hillside, the formation of the hill resembling a screen.\n\nWe crossed the valley by narrow and uncertain paths overgrown with weeds, for, as mentioned in the case of the pagoda at Seoul, the Koreans have made no attempt to keep up or save this memorial from ruin. Not even its sanctity as a god has availed to save it from the ravages of time. A crooked path led up to the plateau on which the image stands and we soon found ourselves among the buildings of the monastery and at the foot of the idol. The buildings were once very extensive, having been built on a grand scale in 1386, and restored and rebuilt several times since. Only a few of these buildings are standing to-day and the solitary poverty-stricken monk gives no hint of the days when officials with royal commissions, throngs of black-robed priests, and\nthe *hoi polloi* in innumerable multitudes gathered here like clouds. The busy port of Si-jin brought merchants and pilgrims to the shrine from the Three Kingdoms. Its fame was widespread and the roads that led to it were broad and well trodden. To quote:—“Devotees sold their possessions and inheritances in order to do reverence perfectly. Lamps and candles gleamed all about it and the coin of the realm was heaped up like dirt. It gave grace to the royal house and pity to the foolish multitudes. The substance of its perfection and its exaltation were like its towering head.” Thus it was once; now all is solitude and ruin. The star of India has paled before that of China. Confucius has as effectually supplanted Buddhism in Korea as any purely human teacher can hope to do. This was illustrated by an incident at the monastery. When we first arrived there it looked as though the place was deserted. In one of the rooms, however, we found a village school-master with some young-men pupils. He told me that he needed a quiet place free from interruption, so he had come to the “Candle Light” and installed himself there. In the room where he was holding forth were the paraphernalia of the temple worship, and yet this did not embarrass him in the least. This well illustrates the relation of the two cults in Korea. Confucianism looks down with supreme contempt on Buddhism and ignores its presence. Buddhism looks with condescension on Confucianism and tolerates it in good nature. The Confucian teacher needs a quiet place in which to instruct his pupils, so he appropriates the best room in the nearest monastery. The Buddhist monk receives him with politeness, acknowledges the social and political superiority of Confucianism and gives him the best room in the temple.\n\n(4) DESCRIPTION OF THE IDOL.\n\nOutside the main building of the monastery, on a level earth platform, stands the great image. It is an ingenious utilization of natural rock. It consists of two immense boulders, which stand detached from the bed rock back of them by about twenty feet. The lower one is about eighteen feet high and thirty-eight feet in circumference. The front of it is chiselled to represent the flowing skirts of a standing Buddha, and\nfrom beneath these chiselled robes the toes of its bare feet are seen peeping. It rises out of a basin-like pedestal. On top of this boulder there is another one, possibly twenty feet in height, which has been cut to represent the shoulders, neck and head of the image. This part has been very carefully chiselled and highly polished, so that seen from a distance on a bright sunny day the effect is striking and has given rise to the legend that when the workmen had finally succeeded in erecting it there came a great rain from heaven and the heavy deluge of water from on high so cleansed the image that its body became glistening and white. The face is very flat, giving it the appearance of a monstrosity, but this is not unusual in idols, where superiority over man is generally represented by some monstrous deviation from the normal state. In the eye-sockets there are black discs, probably of slate, for the eyeballs. Between the eyes is the usual disc of brass, the symbol of the Buddha's wisdom. Of this it is said that three weeks after the miraculous washing there was discovered a light shining forth from between its eyes, which filled earth and sky with its radiance, and guided by this light pilgrims from distant lands found their way to the image. Thus was the shining of a gold-plated disc on a sunny day magnified into a supernatural light reaching to distant lands.\n\nThe ears of the image are immense and have perforated lobes which hang down to the shoulders. The arms are separate stones cemented to the body. The right hand is held at the girdle with fingers pointing downward, while the left hand is held upright and carries a metal lotus flower grasped between the thumb and forefinger. From the top of the skull rises a round superstructure of stone to represent the coiffure. It is plastered with white lime, is about six feet high and slightly tapering. On top of this rests a great stone slab fully ten feet long and seven feet wide, which is carved and has brass bells and ornaments pendant from the corners. It resembles a college mortar-board hat. From this rises another cone three feet high, carrying a smaller stone slab, the whole terminating in a spike apex.\n\nThis gives a most striking figure of over fifty feet in height. Our figures are necessarily approximations, but they will be found to be about the size of the piece. In height it is\nshorter than its fellow in Japan, which is sixty-five feet, but we must not forget that the Korean Colossus antedates the Japanese one by 250 years and, it is not altogether unlikely, may have suggested it and its superior height. Its weight is enormous. Its situation is not without some art, for it has the appearance of some colossal figure, a Korean Cyclops, as it were, who has strolled down the hill-slope as far as the temple and has paused in the midst of the buildings for a moment to give some instruction, the position of the arms and hands lending themselves readily to this fancy. It is to be regretted that the terrace in front is so small. No good view of the image can be had and it will be almost impossible to obtain a good photograph.\n\nThere is a dressed-stone altar in front, but it bears no sign of having been used in many years. There is also a huge stone lantern near by, such as is common in the temples of Japan. Also stone tablets, bearing an inscription with an account of the image. These are of a comparatively modern date but probably carry most of the matter contained on any original tablets that may have been put up here. The fate of these original tablets is a mystery. It would be interesting to know what has become of them, as well as of the stone inscriptions of the Ko-ryū dynasty, which perished five hundred years ago. They seem to have disappeared from the earth and we have only left the stone inscriptions of the present dynasty.\n\n(5) HISTORY AND LEGENDS OF THE COLOSSUS.\n\nFor the history of the great idol we are dependent on the tablets at the monastery itself and on the information to be culled from the Yü-ti Seung-nam, an historical geography of the country, written four hundred years ago. First of all is the main tablet, which was probably written in the year 1743. The date it bears is a little uncertain, for it carries the year-name of the last period of the Ming dynasty of China, which perished before the Manchus in 1644. In their devotion to the memory of the Mings, Korean scholars to this day date their literary works in the last year-period of the Mings. This is very confusing, for though the first year of the period was 1628, and, if numerals were used, we could easily calculate\nthe year, yet the Koreans give only the sexagenary name of\nthe year, which recurs once every sixty years, so that we are\nat a loss to know which cycle is meant. The date here given\nis \"Syung-cheng chai kyei-hai.\" This \"Syung-cheng\" is\nthe name of the last year period of the Mings and began in\n1628. \"Chai kyei-hai\" is the second \"kyei-hai\" year after\n1628, which would make it 1743. It will be seen that the in-\nscription is a comparatively modern one, written long centuries\nafter the erection of the image, but we are able to compare its\nstatements with those in the Yu-ti Seung-nam, which dates\nfrom 1478, and as these substantially agree it is evident that\nthe traditions have been preserved on the tablet.\n\nThe tablet gives the date of the erection of the image as\nA.D. 1004, which seems correct. Concerning the origin of\nthe Colossus the following legend is told: It is said that in\nthe year 966 a country woman was gathering bracken on the\nslopes of the Pan-yak hill, where the image stands, when she\nwas startled by hearing the voice of a boy calling to her. For a\nmoment she was too frightened to move, but her terror passing\naway, she went to the place whence came the voice and found\nthat a great stone had sprung high up out of the earth at that\npoint. Hastening to her home she told her son-in-law of the\nmysterious occurrence, and he immediately went to the pre-\nfect and laid the matter before the magistrate. The latter on\ninvestigation found the story correct, or at least found the\ngreat stone broken out from the hill-side, so he sent an ac-\ncount of it in a memorial to the king. The story was a mat-\nter of great wonder to the court and the entire officiary of the\nrealm was ordered to deliberate on the event and furnish his\nmajesty with a solution of the mystery. Their conclusion\nwas that the stone was a Buddha and should be carved into\nBuddha's likeness and reverenced as such. This commission\nto sculpture the stones was committed to the High Depart-\nment of Physicians. No explanation is given for this peculiar\ntask imposed on the doctors of the Korean court. Possibly\nit was assigned to them because of the fact that their occupa-\ntion deals with the marvellous and the supernatural, and they\nwere thus supposed to be better qualified to undertake the task\nthan other men. The High Department of Physicians having\nscoured the land in search of a sculptor with the requisite\ntalent for the great work, finally selected the monk Hyei-myung, of whom we know nothing except in this connection. To him was assigned the work and in it he was assisted by one hundred stone cutters.\n\nIt took thirty-seven years to complete the task, which we can well believe. In the inscription mention is made of moving the head twenty li. From this obscure reference it would appear that the stone for the upper part of the idol was brought from a distance and was not found on the spot. The problem of raising this great mass, weighing many tons, was a most serious one to the monk-sculptor, and for a time he was in doubt as to how it could be accomplished. The following is the story of the way the matter was solved:—\"Now though Hyei-myung had succeeded in fashioning the stone like to the god, yet he was at a loss to find means for erecting the huge mass. One day, however, as he was entering the Sa-chei hamlet his attention was attracted to twin boys who were playing at making a mud Buddha three stories high. He quietly stood and observed them and found that on a level space they first put up the lower part of their work and then, building a mud embankment, from this proceeded with the middle part of their work and having finished this the same process enabled them to put on the head. The lesson was not lost on Hyei-myung, who thus discovered the solution of his problem. Full of joy he returned to the work and following the example of the boys succeeded in raising the image.\" What this account actually stands for it is hard to tell. It seems to indicate that the monk made use of scaffolding in getting the stones up, and apparently that this was the first time such a process had been used in Korea. This, however,—that the idea of using scaffolding was then first discovered in Korea seems incredible. It may have been that the scaffolding itself was reinforced or supplemented by an embankment of earth, for Korean scaffolds of green timber tied with straw ropes are not adapted to support the immense strain which must have been put on them when the upper part of the image was raised.\n\nWe have already indicated the popularity of the shrine in ancient days. The statement in the inscription, however, that it was due to the thronging multitudes at the shrine that\nthe district got its name of Si-jin is clearly an anachronism, for the place was known by that name centuries before the image was chiselled. The great Colossus was the object of an unbroken stream of pilgrims, and many a poem was written concerning it. One of the most famous of these is by Yi-săk, who lived about 1358. This poem says:\n\nA hundred li to the east of Ma town\nIn Si-jin is the Monastery of the Candle Lights.\nThere is the great stone image, the Buddha—\nI came. From out the earth I came.\nOn my high head is the snow colour.\nBefore is the great plain\nWhere the farmers reap the grain they offer on my altar.\nAnd when from my brow the perspiration flows\nThen sovereign and ministers alike quake with fear.\nAnd this is no legend of the lips,\nBut is woven into the nation’s history.\n\nThe poet has thus preserved for us with a few dashes of his brush an animated picture of the scene and the supposed personality and thoughts of the colossus god. The reference to the perspiration of the image points to a very common superstition among the Koreans that in times of impending national or dynastic calamity the body of the idol is found to be covered with sweat and the brilliant colours disappear from the lotus flower it carries in its hand. This latter portent has been visible for several centuries now, without particularly disturbing the people or alarming them. It is the sweat that they dread to see. There are of course many legends clustering about the image. One of the most common of these is in explanation of the cleft in the head-gear, which is quite visible. There are two versions of this legend, the one in the inscription being as follows:\n\n\"Once there was war with the Tang dynasty and our foes came as far as the Yalu river. Here, however, they were detained by being unable to discover a ford. One day the idol transformed itself into a straw-hatted monk and, gathering its skirts about it, came across the river in plain sight of the Chinese army. This made the Tang troops think that they had discovered a ford and, attempting to cross at the point the image was seen at, more than half their number lost their lives...\"\nby drowning. This so angered the Chinese general that he struck the monk with his sword, intending to kill him, but only succeeded in making a cleft in his hat. From this time the head-gear of the idol was seen to be broken. This is an undeniable fact.\"\n\nBut this \"undeniable fact\" will not bear inspection. The Tang dynasty of China came to an end a hundred years before the image was erected, so that the inscription is convicted of another bad case of anachronism. The popular version is more plausible in some of its details and certainly avoids the anachronistic pitfall. The usual form, as related to travellers, is that in the time of the Japanese invasion (1592-97) the invaders arrived on the banks of the Keum-gang, opposite Kang-gyunggi, but were unable to cross, the river being frozen over. Halted for a few days by this they at last discovered a Korean of gigantic stature crossing on the ice at a certain point. The Japanese immediately marshalled their forces and essayed to cross, but the attempt was a fatal one, for the ice broke under them and many lost their lives. The man of gigantic stature proved to be the Colossus, and the Japanese, when they did get across, sought revenge by trying to destroy the image with their cannon. They had succeeded in injuring the head, when the idol sprang up into the sky out of their reach.\n\nOne of the prettiest stories in connection with the Colossus is the fable of the Mole, in which is embodied the homely truth that a man should not seek to marry above his station. The fable is as follows:\n\nOnce upon a time the Mole gave birth to a marvellous daughter. In beauty she surpassed all others, and the proud father determined that he would take for her husband only the greatest being in the universe. He thought long before deciding who was the greatest being in the universe, but finally concluded that it must be the Sky.\n\nSo one day to the Sky he went with the offer of his daughter in marriage. The Sky expressed his high appreciation of the honour proposed for him and said that he had heard of the wonderful beauty of the Mole's daughter, and certainly the only mate for her must be the greatest being in the universe. Now though many thought that the Sky was the greatest being in the universe yet it was not so, for the Sun\nis certainly greater that the Sky. For without the Sun to illumine and lighten, the Sky becomes but invisible blackness. Only the—Sun was a fit mate for the Mole.\n\nSo to the Sun went the Mole. And the Sun after expressing his delight at the honour proposed for him modestly called the attention of the Mole to the Clouds which daily covered his face and wrapped him in darkness. Against them he was powerless; for they were superior to him, and in them alone would the Mole find a worthy mate for his daughter. Then to the Clouds came the Mole, but they promptly pointed out that they were but the plaything of the Wind, which hourly drove them helter-skelter across the sky, making sport of them at its own sweet will—surely none but the Wind might aspire to wed the maid. Seeking the Wind the Mole made offer of his peerless daughter. But the Wind was obliged to decline in favor of a greater, saying: \"It is true that all bow before my power and acknowledge my greatness, all except that stone Colossus of Eun-jin. He alone defies me and though this many a year I have smitten him hip and thigh, still he stands, and to him I must bow as my superior. My marriage with Miss Mole would be the robbery of the Colossus of his heaven-destined bride. Go to the Colossus and make him your son-in-law.\" So to the Colossus came the weary Mole and told him the state of the case and asked him if he would wed his daughter. \"Gladly would I do so and highly honoured would I be in the marriage—were I the worthiest being in the universe—but there is one greater than I for whom the peerless daughter of the Mole is destined. It is true that I am greater than the Wind, who is greater than the Cloud, who is greater than the Sun, who is greater than the Sky itself. But underneath my feet there is a little mole, and day by day he is burrowing away, preparing a pit into which I know I shall one day topple. I stamp and I press with all my might on his head, yet in vain. The mole is my conqueror and one day he will lay me low. Only he of all in the universe is worthy of your daughter. Go make him your son-in-law.\" And the Mole came back to his hole in the ground and declared how all the universe united in testifying that the Moles are the greatest of all.\nPRELIMINARY NOTE.\n\nOn June 11th, 1900, the following call for a Mass Meeting of the foreign residents of Seoul, Korea, was circulated:\n\n\"It has been proposed to found a Korea Branch of the Royal Asiatic Society. The correspondence necessary to that end has been successfully conducted, and you are invited to attend a General Meeting at the Reading-room of the Seoul Union, on Saturday, 16th inst., at half-past four of the afternoon; at which time and place the subject will be discussed and, if it seems desirable, an organization will be effected. The draft of a Constitution has been prepared and will be presented for adoption, subject to revision. Officers will be elected, and such other steps taken as will ensure an early realization of the benefits likely to accrue from the founding of such an organization.\n\n\"Committee on Arrangements.\"\n\nMINUTES OF GENERAL MEETINGS.\n\nA MEETING, as above called, was convened at 4.30 p.m. at the rooms of the Seoul Union to take steps toward the formation of a Korea Branch of the Royal Asiatic Society. Those present were—\n\nMr. Gubbins (H. B. M. Chargé d'Affaires).\nMr. Wakefield (Imperial Korean Customs).\nMr. Appenzeller (Amer. M. E. Mission).\nMr. Beck (Amer. M. E. Mission).\nMr. Swearer (Amer. M. E. Mission).\nMr. Moore (Amer. Pres. Mission).\nMr. Bunker (Amer. M. E. Mission).\nDr. Weipert (H. I. G. M. Consul-General).\nMr. Gale (Amer. Pres. Mission).\nMr. Sands (Adviser, Royal Household Department).\nMr. Badcock (Eng. Ch. Mission).\nMr. Jones (Amer. M. E. Mission).\nDr. Scranton (Amer. M. E. Mission).\nMr. Hulbert (Imperial Normal School).\nMr. Cable (Amer. M. E. Mission).\nMr. Sykes (B. & F. Bible Society).\nDr. Underwood (Amer. Pres. Mission).\n\nOn nomination of Mr. Appenzeller, Mr. Gubbins was elected\nChairman. Taking the Chair, he called for nominations for Secretary of the Meeting. On motion of Mr. Bunker, Mr. Gale was elected to that office.\n\nThe Chairman then briefly stated the object of the Meeting, calling attention to the work of the Asiatic Society of Japan as indicating the probable lines on which the Society would work here. He then asked Mr. Jones to state what steps had been taken up to the present and to read any correspondence pertaining thereto. Thereupon Mr. Jones read a communication, dated Nov. 11th, 1899, from the Secretary of the China Branch of the Royal Asiatic Society, suggesting that we communicate with the Royal Asiatic Society, London, and ask permission to use their name. Another communication, dated June 10th, 1900, from the Acting Secretary of the Royal Asiatic Society, was also read. It stated that our letter of Oct. 18th, 1899, had been laid before the Council on the previous day and that they welcomed the proposal to form an Asiatic Society in Korea, and would gladly admit it when formed as a Branch Society, provided that the rules were such as they could approve of.\n\nMr. Jones then presented the following resolution:\n\n\"WHEREAS the initial steps towards the formation of a Korea Branch of the Royal Asiatic Society have been taken; and\n\n\"WHEREAS it seems desirable that such a Society should be formed at this time—\n\n\"RESOLVED that we organize ourselves into the Korea Branch of the Royal Asiatic Society, with conditions of Membership, Constitution and By-laws to be decided upon in accordance with the letter of June 10th, 1900, received from the Society in London.\"\n\nThis resolution being put as a motion was seconded and was carried unanimously.\n\nThe Chairman then asked Mr. Hulbert to read the draft of a proposed Constitution and By-laws, which had been drawn up for discussion at this Meeting. After it had been read the Chairman asked whether it should be discussed and voted on article by article or should be adopted en bloc. As there seemed to be no desire to suggest changes, and in view of the fact that the various articles of the Constitution and By-laws corresponded very closely with those of the Asiatic Societies of Japan and of China, the Chairman put the question to the house whether this Constitution and By-laws should be adopted as a whole. It was carried unanimously.\n\nThe election of officers was then taken up as provided for in the Constitution adopted, and the following were unanimously elected:\n\nPresident .................. J. H. Gubbins, Esq., C.M.G.\nVice-President ............ Rev. Geo. Heber Jones.\nCorresponding Secretary . Rev. Jas. S. Gale, B.A.\nRecording Secretary ...... H. B. Hulbert, Esq., F.R.G.S.\nTreasurer .................. Rev. A. B. Turner, B.A.\nLibrarian .................. Alex. Kenmure, Esq.\nMembers of Council ....... Hon. H. N. Allen\nDr. Weipert\nJ. McLeavy Brown, Esq., C.M.G.\n\nThe Chairman then declared the Meeting adjourned.\nA General Meeting of the Society convened at the rooms of the Seoul Union at 4 p.m., with the President in the Chair. The Minutes of the previous Meeting were read and adopted.\n\nIn opening the proceedings Mr. Gubbins said:\n\n\"This being the first General Meeting of our Society it has been thought that a few remarks from the Chair with reference to the objects of the Society and its prospects would be appropriate on this occasion. These remarks will be brief, for we have much business to get through and the time at our disposal is short.\n\n\"In the first place I would mention that the interval which has elapsed since our Society was formed has not been one of idleness on the part of the Council. In the organization of every Society there are many preliminary details to be arranged, and the consideration of these has occupied the attention of the Council during several Meetings. Part of this business the Council has dealt with under the authority given by the Constitution and By-laws. Other matters will require the sanction of a General Meeting, and these will be brought to your notice in due course by the Council.\n\n\"With regard to the prospect before us, we are fortunate, I think, in securing for our opening Meeting a paper from our Corresponding Secretary, the Reverend Mr. Gale, who is an acknowledged authority on Korean matters, and I am glad to be able to announce that papers have been promised by our Vice-President, the Rev. Mr. Jones; by our Recording Secretary, Mr. Hulbert, and by the Rev. Mr. Trollope. We hope, therefore, to be able to hold at least three more Meetings before the close of the present year. I would like to add with reference to this point that I trust Members of the Society will not be discouraged if sometimes there should occur a long interval during which, owing to lack of papers, no Meeting takes place. We are a small Society, and the number of working Members—I mean, of course, Members who are in a position to supply papers—is necessarily small. You must not, therefore, be surprised if, when the first flush of enthusiasm which has led to the creation of this Society has passed, a reaction should set in. This is almost inevitable; it happens to all Societies, and we have no right to expect that history will not repeat itself in our case.\n\n\"And this brings me to another and a very important matter—the objects of our Society. We stand here on the threshold of our labours, and it is very necessary that we should make up our minds clearly as to the course we intend to pursue in furthering the objects for which the Society has been called into existence. Like all Societies, we have two audiences to deal with, the audience we address through our Meetings and the more distant and possibly more learned audience we appeal to through the medium of our Transactions. While, therefore, it is necessary for us to win the sympathy of resident Members, on whose support we are primarily dependent, it is also incumbent upon us not to forget that so far as non-resident Members, the outside public, are concerned, we shall be judged by our Transactions—that is to say, by the papers\nwhich we publish. If we were to look merely to the one audience—that on the spot—we might easily fall into the error of treating subjects in too popular a manner and so diminish the scientific value of our published Transactions. We shall do well, therefore, I think, to steer a middle course, and if we incline rather to the one side than to the other, since we profess to be a branch of a learned Society, I trust that the scale will always turn in favour of the solid value of our Transactions and not the mere popularity of our Meetings.\n\n\"A distinguished traveller, who has written about this country, is reported to have said that there was little or nothing in Korea to repay research. Your Council do not agree with this view. We are aware that the literature of the country, owing largely to the Chinese influence of which you will hear more during the reading of Mr. Gale's paper, and also in part to causes which exist in the social conditions of Korea, is not as accessible for purposes of research as the literature of other countries. But that plenty of material exists in the country itself we know by the Korean Bibliography compiled by M. Courant; we know also that we may look to China and Japan to furnish other material for investigation; and I am sure that you will all agree in thinking that there is every reason to hope that the efforts of our Society, though its beginnings be small and its work at first slow, may be successful in exploiting this material for the information of all who take an interest in Korea and the Far East.\"\n\nThe President then introduced the reader of the paper, the Rev. Jas. S. Gale, who presented an able discussion of \"The Influence of China upon Korea.\" It was followed by a few remarks by Dr. Allen, Mr. Jones and Mr. Hulbert. Dr. Allen moved a vote of thanks to the reader of the paper, which was carried with applause.\n\nThe President then declared the Meeting adjourned.\n\n---\n\nSeoul, Nov. 29th, 1900.\n\nA General Meeting was convened at the Seoul Union Reading-room at 4.30 p.m., with the President in the Chair. By motion of the Librarian the reading of the Minutes of the last Meeting was dispensed with. The President asked the Recording Secretary to read the proposed amendments to the Constitution and By-laws to be voted on at the next Meeting. The President announced the election as Honorary Members of—\n\nW. G. Aston, Esq., C.M.G.\nRev. W. E. Griffis, D.D.\nRev. John Ross, D.D.\n\nHe also announced the election as Ordinary Members of the—\n\nRev. C. E. Sharp. Rev. A. G. Welbon.\nDr. E. D. Follwell. Dr. J. H. Wells.\nRev. S. A. Moffett. Dr. Charles Irvin.\nRev. H. M. Bruen. Dr. R. A. Hardie.\nRev. J. R. Moose. Rev. W. A. Noble.\nThe President read the following statement:\n\n\"In connection with the proposal for the amendment of the rule relating to Entrance Fees and Annual Subscriptions, notice of which has been given today, it has been thought desirable to explain that the Council have had under consideration the objections which may not unnaturally be felt by Members to the payment almost simultaneously of Subscriptions for the present and coming year. Owing to the occurrence of the summer vacation so soon after our Society was organized, difficulty was experienced in drawing up a list of Original Members, and until this list was completed it was not possible to begin the work of collecting Entrance Fees and Subscriptions. The roll of Original Members being now complete, the Treasurer will shortly proceed to call upon Members for their Entrance Fees and Subscriptions which should strictly have been collected in June last. At our next Meeting, however, which will be the Annual Meeting of the Society, those present will be asked to vote upon the proposal for increasing the amounts of Entrance Fees and Subscriptions, notice of which has now been given, and if, as the Council have reason to hope, their proposal be carried, not only will Members, under the rule governing the payment of Subscriptions, be called upon to pay the Annual Subscription in the course of a few weeks, since the present year is drawing to a close, but one of these Subscriptions will be on the increased scale which we trust will be voted by the Society.\n\nUnder these circumstances, the Council think that the convenience of Members will be best consulted by deferring the payment of the Subscription for the year 1901, which is due in January next, until the following June, leaving, however, Entrance Fees due from new Members joining the Society after the 1st of January next payable upon their election as prescribed in the rules.\n\nThis course, which is suggested by the exceptional circumstances which exist, the Council do not regard in the light of an amendment to the Constitution, but simply as an alteration for this single occasion of the rule regarding the date of payment of Subscriptions, and as a special measure relating to the organization of the Society. They think, therefore, that the present Meeting is competent to deal with the case by passing a motion in the sense I have explained.\"\n\nThe Vice-President thereupon moved that the payment of the Annual Subscription for 1901, due from Members in January next, be deferred until the following June. The motion was seconded by the Corresponding Secretary and passed.\n\nThe President then called upon Mr. Hulbert to read the paper of the day on \"Korean Survivals.\" After the reading the President threw open the question for discussion. The Corresponding Secretary, Rev. Jas. S. Gale, read some interesting notes on the subject, as did also the Vice-President, Rev. Geo. Heber Jones. Mr. Kenmure asked whether the people of northern Korea were savage or barbarous before the time of Keui-ja. Mr. Hulbert made a few verbal corrections to make his position better understood, and after some pertinent remarks by the President and a vote of thanks to the reader of the paper the Meeting adjourned.\nThe first Annual Meeting of the Society was held in the rooms of the Seoul Union at 4 P.M., the Chair being taken by the President.\n\nIt was decided that the Minutes of the previous General Meeting should be taken as read.\n\nIn view of the short time that had elapsed since the formation of the Society in the previous June, and of the fact that the summer vacation had occurred immediately after its formation, it was decided to dispense with the Annual Report of the Council for the year 1900 and to include it in the Annual Report for the following year.\n\nThe amendments made by the Council in the Constitution and By-laws of the Society were put to the Meeting and passed unanimously.\n\nIt was decided to re-elect for the ensuing year the President, Vice-President and other Officers and Members of the Council, with the exception of the Treasurer, whose continued absence from Korea had prevented him from taking part in the work of the Council. For this post Mr. F. V. Morgan, Secretary of the U.S. Legation, was elected in the place of the Rev. A.B. Turner, the retiring Treasurer.\n\nThe Meeting adjourned at 5.30 P.M.\nAPPENDIX.\nOFFICERS DURING 1906.\n\nPRESIDENT.\n\nJ. H. GUBBINS, Esq., C.M.G.\n\nVICE-PRESIDENT.\n\nRev. GEORGE HEBER JONES.\n\nHONORARY SECRETARIES.\n\nRev. Jas. S. GALE, B.A.\n\nH. B. HULBERT, Esq., A.M., F.R.G.S.\n\nHONORARY TREASURER.\n\nE. V. MORGAN, Esq.\n\nHONORARY LIBRARIAN.\n\nALEX. KENMURE, Esq.\n\nCOUNCILLORS.\n\nThe Hon. H. N. ALLEN.\n\nH. WIEPERT, Ph.D.\n\nJ. McLEAVY BROWN, Esq., C.M.G.\n## LIST OF MEMBERS.\n\nMembers are particularly requested to notify the Hon. Secretaries of any change of address or other correction to be made in this List.\n\n†Indicates a Member who has contributed to the Society's Transactions.\n\n### HONORARY MEMBERS.\n\n| Year of Election | Name | Affiliation |\n|------------------|------|-------------|\n| 1900             | Aston, C.M.G., W. G. | The Bluff, Beer, E. Devon, England. |\n| 1900             | Griffis, D.D., Rev. Wm. E. | Ithaca, New York, U.S.A. |\n| 1900             | Ross, D.D., Rev. John | Moukden, Manchuria. |\n\n### ORDINARY MEMBERS.\n\n| Year of Election | Name | Affiliation |\n|------------------|------|-------------|\n| 1900             | Allen, The Hon. H. N. | U. S. Legation, Seoul. |\n| 1900             | Appenzeller, Rev. H. G. | M. E. Mission, Seoul. |\n| 1900             | Avison, M.D., O. R. | Pres. Mission, Seoul. |\n| 1900             | Balljohn, F. F. | Imp. Ger. School, Seoul. |\n| 1900             | Beck, Rev. S. A. | M. E. Mission, Seoul. |\n| 1900             | Brinckmeier | I. G. Legation, Seoul. |\n| 1900             | Brown, C.M.G., J. McLeavy | Inspectorate General of Customs, Seoul. |\n| 1930             | Bruen, Rev. H. M. | Pres. Mission, Seoul. |\n| 1900             | Bunker, M.A., Rev. D. A. | M. E. Mission, Seoul. |\n| 1900             | Charlesworth, F.R.G.S., H. E. | Eng. Ch. Mis., Newchwang. |\n| 1900             | Follwell, M.D., Rev. E. D. | M. E. Mission, Ping-yang. |\n| 1900             | †Gale, B.A., Rev. Jas. S. | Pres. Mission, Seoul. |\n| 1900             | Gubbins, C.M.G., J. H. | H. B. M.'s Legation, Seoul. |\n| 1900             | Hardie, M.D., R. A. | M. E. Mission, Wonsan. |\n| 1900             | †Hulbert, A.M., F.R.G.S., H. B. | Imp. Gov. Normal School, Seoul. |\n| 1900             | Irvin, M.D., C. H. | Pres. Mission, Pusan. |\n| 1900             | Jones, Rev. George Heber | M. E. Mission, Chemulpo. |\n| 1900             | Kemnure, Alex. | Bible House, Seoul. |\n| 1900             | Krummi, C.E., Raymond | Bureau of Survey, Seoul. |\n| 1900             | Moose, Rev. J. R. | M. E. Mis. (South), Seoul. |\n| 1900             | Morgan, E. V. | U. S. Legation, Seoul. |\n| 1900             | Morris, Rev. C. D. | M. E. Mission, Ping-yang. |\n| 1900             | Noble, Rev. W. A. | M. E. Mission, Ping-yang. |\n| 1900             | Ottewill, H. A. | H. B. M.'s Legation, Seoul. |\n| 1900             | Sands, W. F. | Imperial Household Department, Seoul. |\n| 1900             | Scranton, M.D., Rev. W. B. | M. E. Mission, Seoul. |\n| 1900             | Sharp, Rev. C. E. | Pres. Mission, Seoul. |\n| 1900             | Sweare, Rev. W. C. | M. E. Mission, Seoul. |\n| 1900             | Sykes, A. A. | B. & F. B. Society, Seoul. |\n| 1900             | Trollope, M.A., Rev. M. N. | Eng. Ch. Mission, Seoul. |\n| 1900             | Underwood, D.D., Rev. H. G. | Pres. Mission, Seoul. |\n| 1900             | Weipert, Ph.D., H. | H. I. G. M.'s Consulate-General, Seoul. |\n| 1900             | Welbon, Rev. A. G. | Pres. Mission, Seoul. |\n| 1900             | Wells, M.D., J. H. | Pres. Mission, Ping-yang. |\nCONSTITUTION AND BY-LAWS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY.\n\nCONSTITUTION.\n\nNAME AND OBJECT.\n\nThe Name of the Society shall be The Korea Branch of Art. I.\nthe Royal Asiatic Society.\n\nThe Object of the Society shall be to investigate the Arts, Art. II.\nHistory, Literature and Customs of Korea and the neigh-\nbouring countries.\n\nMEMBERSHIP.\n\nThe Society shall consist of Honorary and Ordinary Members. Art. III.\nHonorary Members shall be admitted on special grounds to Art. IV.\nbe determined in each case by the Council. They shall not\nbe resident in Korea and they shall not be required to pay\neither Entrance Fee or Annual Subscription.\n\nOrdinary Members shall pay on their election an Entrance Art. V.\nFee of Five Yen and the Subscription for the current year.\nThose resident in Korea shall pay an Annual Subscription\nof Five Yen. Those not resident in Korea shall pay an\nAnnual Subscription of Three Yen.\n\nThe Annual Subscription shall be payable in advance on the Art. VI.\nfirst day of January.\n\nThe first Annual Subscription of Members elected in the last\nquarter of any year shall cover the Subscription for the\nfollowing year.\nART. VII. Every Member shall, subject to the provisions of sub-heading (h) of Article XIII. of the By-laws, be entitled to receive the Publications of the Society during the period of his Membership.\n\nOFFICERS.\n\nART. VIII. The Officers of the Society shall be—\n\nA President;\nA Vice-President;\nA Corresponding Secretary;\nA Recording Secretary;\nA Treasurer;\nA Librarian.\n\nCOUNCIL.\n\nART. IX. The affairs of the Society shall be managed by a Council composed of the Officers for the current year, together with three Ordinary Members.\n\nMEETINGS.\n\nART. X. General Meetings of the Society and Meetings of the Council shall be held as the Council shall appoint and announce.\n\nART. XI. The Annual Meeting of the Society shall be held in December. At this Meeting the Council shall present its Annual Report, which shall include the Treasurer's Statement of Account.\n\nART. XII. Nine Members shall form a quorum at an Annual Meeting and four Members at a Council Meeting. The Chairman shall have a casting vote. At all Meetings of the Society or Council, in the absence of the President and Vice-President, a Chairman shall be elected by the Meeting.\n\nART. XIII. The General Meetings of the Society shall be open to the public, but persons who are not Members shall not address the Meeting except by invitation of the Chair.\n\nELECTIONS.\n\nART. XIV. All Members of the Society shall be elected by the Council. They shall be proposed at one Meeting of the Council and ballotted for at the next, one black ball in four to exclude; and their election shall be announced at the General Meeting following.\nThe Officers and other Members of the Council shall be elected by ballot at the Annual Meeting and shall hold office for one year.\n\nThe Council shall fill all vacancies in its Membership that may occur between Annual Meetings.\n\n**PUBLICATION.**\n\nThe Publications of the Society shall contain:—(1) Such papers and notes read before the Society as the Council shall select, and an abstract of the discussion thereon. (2) The Minutes of the General Meetings, with a list of Officers and of Honorary and Ordinary Members. (3) The Reports and Accounts presented at the last Annual Meeting.\n\nThe Council shall have power to accept for publication papers or other contributions of scientific value, the technical or voluminous nature of which does not admit of their being read at a Meeting of the Society.\n\nAuthors of published papers may be supplied with extra copies at the discretion of the Council.\n\nThe Council shall have power to publish in separate form papers or documents which it considers of sufficient interest or importance.\n\nPapers accepted by the Council shall become the property of the Society and shall not be published without the consent of the Council.\n\nAcceptance of a paper by the Council for reading at a General Meeting of the Society does not bind the Society to its publication afterwards, but when the Council decides not to publish any paper accepted for reading, that paper shall be restored to the author without any restriction as to its subsequent use, but a copy of it shall be kept on file.\n\n**MAKING OF BY-LAWS.**\n\nThe Council shall have power to make and amend By-laws for its own use and the Society's guidance, provided that these are not inconsistent with the Constitution; and a General Meeting, by a majority vote, may suspend the operation of any By-law.\nAMENDMENTS.\n\nArt. XXIII. None of the foregoing articles of the Constitution can be amended except at a General Meeting by a vote of two-thirds of the Members present, and then only if due notice of the proposed amendment has been given at a previous General Meeting.\n\nBY-LAWS.\n\nGENERAL MEETINGS.\n\nArt. I. The Session of the Society shall coincide with the Calendar Year, the Annual Meeting taking place in December.\n\nArt. II. Ordinarily the Session of the Society shall consist of nine monthly General Meetings, of which the Annual Meeting shall be considered one, but it may include a greater or less number whenever the Council finds reason for such a change.\n\nArt. III. The place and time of meeting shall be fixed by the Council, preference being given to 4 p.m. of the second Wednesday of each month.\n\nArt. IV. Timely notice of each General Meeting shall be sent to every Member resident in Seoul or Chemulpo.\n\nORDER OF BUSINESS AT GENERAL MEETINGS.\n\nArt. V. The Order of Business at General Meetings shall be:\n\n1. Action on the Minutes of the last Meeting.\n2. Communications from the Council (Reports, etc.).\n3. Miscellaneous Business.\n4. The reading and discussion of Papers.\n\nThe above order shall be observed except when the Chairman shall rule otherwise.\n\nAt Annual Meetings the Order of Business shall include, in addition to the foregoing matters:\n\n5. The reading of the Council’s Annual Report and Treasurer’s Account and submission of these for the action of the Meeting upon them.\n6. The Election of Officers and Council as directed by the Constitution.\nMEETINGS OF COUNCIL.\n\nThe Council shall appoint its own Meetings, preference being given to the first Wednesday of each month at 4 p.m. Timely notice of each Council Meeting shall be sent by post to the address of every Member of the Council, and shall contain a statement of any extraordinary business to be transacted.\n\nORDER OF BUSINESS AT COUNCIL MEETINGS.\n\nThe Order of Business at Council Meetings shall be:\n\n1. Action upon the Minutes of the last Meeting.\n2. Reports (a) of the Corresponding Secretary.\n   (b) of the Publication Committee.\n   (c) of the Treasurer.\n   (d) of the Librarian.\n   (e) of Special Committees.\n3. The Election of new Members.\n4. The Nomination of Candidates for Membership.\n5. Miscellaneous Business.\n6. Acceptance of papers to be read before the Society.\n7. Arrangement of Business for the next General Meeting.\n\nPUBLICATION COMMITTEE.\n\nThere shall be a Standing Committee called the Publication Committee, composed of the Secretaries, the Librarian and any Members appointed by the Council. It shall ordinarily be presided over by the Corresponding Secretary.\n\nIt shall superintend the publication of the Transactions of the Society and the re-issue of parts out of print.\n\nIt shall report periodically to the Council and act under its authority.\n\nIt shall audit the accounts for printing the Transactions.\n\nIt shall not allow authors' manuscripts or printers' proofs to go out of its custody for other than the Society's purposes.\n\nAUDIT.\n\nBefore the Annual Meeting of each year the Treasurer's Statement of Account shall be audited by two Members appointed by the President.\nDUTIES OF CORRESPONDING SECRETARY.\n\nART. XI. The Corresponding Secretary shall—\n\n(a) Conduct the correspondence of the Society\n(b) Arrange for and issue notices of Council Meetings and see that all business is brought duly and in order before each Meeting.\n(c) Attend every Council Meeting or give notice to the Recording Secretary that he will be absent.\n(d) Notify new Officers and Members of Council of their appointment and send them each a copy of the By-laws.\n(e) Notify new Members of their election and to each send them a copy of the Constitution and of the Library Catalogue.\n(f) Unite with the Recording Secretary, Treasurer and Librarian in drafting the Annual Report of the Council and with the other Members of the Publication Committee in preparing for publication all matters as defined in Article XVII. of the Constitution.\n(g) Act as Chairman of the Publication Committee and take first charge of authors’ manuscripts and proofs struck off for use at Meetings.\n\nDUTIES OF RECORDING SECRETARY.\n\nART. XII. The Recording Secretary shall—\n\n(a) Keep Minutes of General Meetings and Meetings of the Council.\n(b) Make arrangements for General Meetings as instructed by the Council and notify Members thereof.\n(c) Inform the Corresponding Secretary and the Treasurer of the election of new Members.\n(d) Attend every General Meeting and every Meeting of the Council, or, in case of absence, depute the Corresponding Secretary or some other Member of the Council to perform his duties and shall forward to him the Minute-Book.\n(e) Act for the Corresponding Secretary in the latter’s absence.\n(f) Assist in drafting the Annual Report of the Council and in preparing for publication the Minutes of the General Meetings and the Constitution and By-laws.\n(g) Act on the Publication Committee.\n\n(h) Furnish to the Press abstracts of Proceedings at General Meetings as directed by the Council.\n\nDUTIES OF TREASURER.\n\nThe Treasurer shall—\n\n(a) Take charge of the Society’s funds in accordance with the instructions of the Council.\n\n(b) Apply to the President to appoint Auditors and present to the Council the Annual Balance Sheet duly audited before the date of the Annual Meeting.\n\n(c) Attend every Council Meeting and report when requested upon the money affairs of the Society, or, in case of absence, depute some Member of the Council to act for him, furnishing him with such information and documents as may be necessary.\n\n(d) Collect Subscriptions and notify Members of their unpaid dues in January and June.\n\n(e) Collect from Agents the money received by them for the sale of the Society’s Publications.\n\n(f) Pay out all moneys for the Society under the direction of the Council, making no single payment in excess of Ten Yen without special vote of the Council.\n\n(g) Inform the Librarian when a new Member has paid his Entrance Fee and his first Subscription.\n\n(h) Submit to the Council at its January Meeting the names of Members who have not paid their Subscription for the past year; and after action has been taken by the Council furnish the Librarian with the names of any Members to whom the sending of the Publications is to be suspended or stopped.\n\nDUTIES OF LIBRARIAN.\n\nThe Librarian shall—\n\n(a) Take charge of the Society’s Library and stock of Publications, keep its books and periodicals in order, catalogue all additions to the Library and supervise the binding and preservation of the books.\n\n(b) Carry out the regulations of the Council for the use and lending of the Society’s books.\n(c) Send copies of the Publications to all Honorary Members, to all Ordinary Members not in arrears for dues, according to the list furnished him by the Treasurer, and to all Societies and Journals, the names of which are on the list of exchanges.\n\n(d) Arrange with booksellers and others for the sale of the Publications as directed by the Council, send the required number of each issue to the appointed Agents and keep a record of all such business.\n\n(e) Arrange for further exchanges as directed by the Council.\n\n(f) Draw up a list of the exchanges and of additions to the Library for insertion in the Council's Annual Report.\n\n(g) Make additions to the Library as instructed by the Council.\n\n(h) Present to the Council at its November Meeting a statement of the stock of Publications possessed by the Society.\n\n(i) Act on the Publication Committee.\n\n(j) Attend every Council Meeting and report on Library matters, or, if absent, send to the Corresponding Secretary a statement of any matter of immediate importance.\n\nLIBRARY AND MEETING ROOM.\n\nART. XV. The Society's Rooms and Library shall be in Seoul, to which may be addressed all letters and parcels not sent to the private address of the Corresponding Secretary, Treasurer or Librarian.\n\nART. XVI. The Library shall be open to Members for consultation during the day, the keys of the book-cases being in the possession of the Librarian or other Members of Council resident in the vicinity, and books may be borrowed on application to the Librarian.\n\nSALE OF PUBLICATIONS.\n\nART. XVII. A Member may obtain at half-price, for his own use, copies of any part of the Publications.\n\nATT. XVIII. The Publications shall be on sale by Agents approved by the Council and shall be supplied to them at a discount price fixed by the Council.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko01roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 102, "total-input-tokens": 148666, "total-output-tokens": 47540, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 384, 7], [384, 384, 8], [384, 842, 9], [842, 1123, 10], [1123, 2857, 11], [2857, 5181, 12], [5181, 7333, 13], [7333, 9516, 14], [9516, 11706, 15], [11706, 13878, 16], [13878, 16127, 17], [16127, 18328, 18], [18328, 20542, 19], [20542, 22739, 20], [22739, 24869, 21], [24869, 27071, 22], [27071, 29253, 23], [29253, 31430, 24], [31430, 33674, 25], [33674, 35895, 26], [35895, 38047, 27], [38047, 40272, 28], [40272, 42440, 29], [42440, 44323, 30], [44323, 46391, 31], [46391, 48479, 32], [48479, 50425, 33], [50425, 52053, 34], [52053, 53733, 35], [53733, 56058, 36], [56058, 58343, 37], [58343, 60676, 38], [60676, 63001, 39], [63001, 65272, 40], [65272, 67644, 41], [67644, 69870, 42], [69870, 72163, 43], [72163, 74419, 44], [74419, 76668, 45], [76668, 78940, 46], [78940, 81166, 47], [81166, 83429, 48], [83429, 85711, 49], [85711, 87923, 50], [87923, 90123, 51], [90123, 92396, 52], [92396, 95399, 53], [95399, 98548, 54], [98548, 101620, 55], [101620, 104821, 56], [104821, 107963, 57], [107963, 111254, 58], [111254, 114494, 59], [114494, 117555, 60], [117555, 117978, 61], [117978, 118363, 62], [118363, 119769, 63], [119769, 121759, 64], [121759, 123606, 65], [123606, 125426, 66], [125426, 127115, 67], [127115, 129444, 68], [129444, 131587, 69], [131587, 133757, 70], [133757, 136069, 71], [136069, 138226, 72], [138226, 140463, 73], [140463, 142844, 74], [142844, 145093, 75], [145093, 147498, 76], [147498, 149791, 77], [149791, 151945, 78], [151945, 154239, 79], [154239, 156491, 80], [156491, 158243, 81], [158243, 161179, 82], [161179, 164318, 83], [164318, 167007, 84], [167007, 170236, 85], [170236, 171358, 86], [171358, 171368, 87], [171368, 171368, 88], [171368, 171730, 89], [171730, 174823, 90], [174823, 175972, 91], [175972, 177561, 92], [177561, 179353, 93], [179353, 180922, 94], [180922, 182534, 95], [182534, 184293, 96], [184293, 186045, 97], [186045, 187834, 98], [187834, 187834, 99], [187834, 187834, 100], [187834, 187834, 101], [187834, 187834, 102]], "primary_language": ["None", "en", "None", "None", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "zh", "zh", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]