[{"id": "549c3a55b9d5ca252ab55ac1f8507424124b3d3c", "text": "ROYAL ASIATIC SOCIETY.\n\nPROCEEDINGS\n\nOF THE\n\nSEVENTEENTH ANNIVERSARY MEETING OF THE SOCIETY,\n\nHELD ON THE 9TH OF MAY, 1840.\n\nTHE RIGHT HON. C. W. WILLIAMS WYNN, M.P.,\n\nPRESIDENT, IN THE CHAIR.\n\nTHE ANNUAL REPORT OF THE COUNCIL\n\nWAS READ AS FOLLOWS:—\n\nIt is with considerable satisfaction that the Council can open their Report on the Proceedings of the past year by stating that the expenditure of the Society has continued to be kept considerably within the receipts; and that, having thus recovered from the state of financial difficulty into which they had fallen, the funds will now allow of the publication in the present year of two Numbers of the Journal. It is right, however, to qualify the satisfaction which at first arises from observing so large a balance in hand at the close of the last year's account as 407l., by remarking that the actual surplus of the receipts above the expenditure is only 111l., which is not equal to the cost of the second Number of the Journal proposed to be published in 1840. The state of the funds, if viewed in reference to their economical management, must be, on the whole, gratifying; but if the operations of the Society are crippled for want of larger means; if its Library is so entirely dependent on the contributions of Societies, and of individual Members, that no branch of Oriental inquiry can be made complete on its shelves for the use of its Members, or of Oriental scholars, or persons engaged in the prosecution of researches into the civil and natural history, geography, antiquities, and products of Asia, or even of India alone; if collections of various kinds which would be given to enrich its Museum are withheld by the possessors, or refused by the Society, because there is not room where to lay them out and exhibit them, and there are not means to procure\nlarger accommodation; if the hopes of public assistance in obtaining more suitable apartments, though long cherished, must now be abandoned, the friends of the Society must lament the limited extent of that prosperity which ought to attend such an Institution in this great country. Much as the Council deplore this inadequate support, it was their duty not to attempt more than their resources would justify; and they can only urge on every Member of the body the great importance of the utmost individual exertion to increase the number of Resident Members, on whose annual subscriptions must chiefly depend the usefulness of the Society.\n\nThe regulation of January, 1838, increasing the amount to be paid by Life Members, appears to have had some, though not a very considerable, effect in diminishing the number of those who compound for their subscriptions. The amount received from that source in the last year has been much below the average of former years; but that average is deduced from sums so very different in amount, that no positive opinion can be formed as to the eventual operation of the altered rule. The amount was something above 115l., which exceeds the receipt of the preceding year. It is more important to notice, that the alteration has not diminished the whole receipts of the Society, which are larger this year than on an average of the last ten years.\n\nThe Council have also the satisfaction to observe, that they continue to experience the good effects of the regulation passed in 1838, the object of which was to recover arrears of subscription, and to prevent, as far as practicable, their future accumulation. They are now enabled to state, that their lists exhibit fewer defaulters than have at any former period been found upon them.\n\nThe number of Elections during the past year has considerably exceeded that of the preceding, being nineteen Resident Members. There were two Elections of Honorary Members, one of His Highness Ikbal-ood-Dowlah, Prince of Oude, an Oriental scholar of considerable attainments, who, while in London, frequently attended the Meetings of the Society, and exhibited a lively interest in their proceedings; and the other, of His Highness the Sultan of Turkey. His Highness's donations of Oriental works not otherwise readily accessible, entitle him to be held in grateful remembrance by this Society, which has, by his death, so soon been deprived of the further advantages promised by his enlightened assistance.\n\nTwo Corresponding Members have been also added to the Society's List: one, the Rev. C. F. Schlienz of Malta; and the other, Professor Gustavus Flügel, the learned Editor of Haji Khalfah's great Bibliographical Dictionary.\n\nThe deaths of Members during the past year have been more than ordinarily numerous. They include two Honorary, two Corresponding, two Foreign, and eighteen Contributing Members, and are as follows:\n\n**Honorary.**\n\nHis Highness Runjít Singh, Rajah of the Punjáb.\nHis Highness Mahmúd, Sultan of Turkey.\nCorresponding.\n\nGeneral Allard.\nCavelly Venkata Lutchmiah.\n\nForeign.\n\nCount Munster Meinhovel.\nProfessor Peter Von-Bohlen\n\nContributing.\n\nJosias du Pré Alexander, Esq.\nThe Right Hon. Lord William H. C. Bentinck, M.P.\nMajor-General Sir William Blackburne.\nDavid Colvin, Esq.\nSir Francis Hastings Doyle, Bart.\nThomas Daniell, Esq., R.A.\nGeneral William Farquhar.\nJames M'Donnell, Esq., M.D.\nThe Right Hon. the Earl of Powis.\nCrosier Raine, Esq.\nThomas Redhead, Esq.\nJames G. Remington, Esq.\nThe Right Hon. John Sullivan.\nLieut.-Col. E. L. Smythe.\nCol. Josiah Stewart.\nBenjamin Torin, Esq.\nMajor-General Sir N. Trant.\nSir W. Williams Wynn, Bart., M.P.\n\nThe political merits of Maharaja Runjit Singh are matters for history to dilate upon, and are already familiar to Europe. It is in his capacity of patron of letters and science that the Society records and regrets his death. His becoming enrolled amongst our Honorary Members is one evidence of this character; but more practical proofs of his liberal encouragement of talent have been repeatedly displayed by him whenever opportunity permitted its exercise within his own dominions. His readiness to avail himself of the skill and knowledge of European officers in the organization of his forces, and the management of his provinces, whilst it evinced his discrimination, may be attributed to policy also; but the facilities which he afforded them to search for the precious remains of antiquity in the Punjab, and to collect and publish geographical illustrations of parts of his principality, before little known, were proofs of liberal and comprehensive feeling, little to have been expected from a sovereign in his situation. It is for even still more decided marks of his liberality, however, that we have reason to be thankful to him, and in an especial manner, for the encouragement of every kind, the personal notice, the freedom and safety of access to his territories, the facilities he commanded or bestowed, and even the pecuniary aid which he was ever prompt to grant to European travellers. Moorcroft, at a season\nwhen Runjit Singh's connexion with the Government of British India was precarious, and involved various contingencies of eventual discord, was treated by him with marked hospitality and distinction, and was allowed to traverse at will the Punjab and Kashmir, and the intervening dependencies; and at a later period Jacquemont acknowledges that he received, not only similar permission and aid, but even liberal supplies—of all of which he stood in need. Conduct of this description, and in an Asiatic prince, fully entitles the Maharaja to the grateful commemoration of an Asiatic Society.\n\nOne of the most distinguished of the European Officers in the service of Maharaja Runjit Singh was General Allard, whose claim to literary notice rests upon his having brought to France, and presented to the Royal Cabinet, an invaluable collection of Bactro-Indian coins and antiquities collected by himself or by his colleague, General Ventura. They have been the theme of minute and learned description by the late M. Jacquet, and by M. Raoul Rochette, in the Journal Asiatique. The death of M. Allard and of his illustrious master might seem to augur unfavourably for the prosecution of research in the Sikh dominions; but General Ventura and M. Court are still there, and they are both known as zealous and able contributors to our knowledge, both of the present and past history of the Punjab.\n\nCavelly Venkata Lutchmiah, a Brahman of Madras, was for many years at the head of the Native Establishment formed by Colonel Mackenzie, for the collection and elucidation of manuscripts, inscriptions, and antiquities illustrating the early or actual condition of the Dekhan. He accompanied Colonel Mackenzie to Calcutta, and after that officer's death, assisted for some time in compiling a Catalogue of the collections, until ill-health obliged him to return to Madras. He was a very respectable English scholar, well versed in the principal languages of the South of India, and deeply imbued with that love of antiquarian lore which animated his master's researches. After his return to Madras, and the recovery of his health, Cavelly Venkata resumed his literary pursuits, and made several communications to this Society. He was also mainly instrumental in founding a Native Literary Society at Madras, and was President of it at his death. Although instances of a command of the English language did occur at Madras amongst the contemporaries of Cavelly Venkata, yet the acquirement was then rare, and was effected under great disadvantages. It was much rarer, however, for it to be applied, as it was by him, to literary research.\n\nOf our deceased Foreign Members Dr. Peter von Bohlen, Professor of Oriental Languages and Literature in the University of Königsburg, is best known to Oriental scholars by his edition of the Satakas or Centos of Bhartrihari, with a Latin translation, and by his work upon the Hindus, Das Alte Indien. The former is a proof that he was a Sanskrit scholar of no ordinary merit; and the latter displays extensive reading and judicious investigation. As a summary view of the history, religious institutes, monuments, literature, and sciences of the Hindus, it is at once a com-\nprehensive and concise authority, to which we have yet nothing in our own language to be compared. Dr. Von Bohlen was in England a few years since, and was then in a precarious state of health, which has terminated in his decease, whilst yet in the prime of life.\n\nThere are several names in the list of deceased Members whose loss will be felt, and is regretted by this Society. To notice each separately would be to swell this report beyond its fair limits; but there is one which the Council cannot pass over in silence,—that of Sir William Blackburne, whose long residence at the court of his Highness the Raja of Tanjore, rendered him familiar with the history and antiquities of the South of India, and the usages and habits of the people. He was for many years a member of the Council, where the unremitting interest he exhibited in the objects for which we are associated, and the kind feelings and courteous manners shown in all his intercourse, will endear his memory to all who enjoyed the pleasure of his acquaintance.\n\nThomas Daniell, Esq., has been much known as a painter of Indian subjects. When between thirty and forty years of age he visited India in company with his nephew, where he remained ten years, chiefly employed in making a splendid collection of paintings, most of which have at various times appeared before the public. Mr. Daniell was a member of the Royal Academy, at whose annual exhibitions many of his productions appeared. He died on the 19th of March last, at the very advanced age of ninety-one.\n\nAlthough in consequence of some delay on our part in electing him as a Corresponding Member, yet every object for which this Society is instituted, every branch of Oriental inquiry, whether of a literary or scientific description, has suffered too severe a loss in Mr. James Prinsep for us not to offer our tribute of regret for his premature death. One of a numerous family remarkable for every attribute that graces humanity, Mr. James Prinsep in early life devoted his energies to the cultivation of experimental science; and was in consequence appointed Assistant Assay Master in the Calcutta Mint in 1819. In the following year he was nominated Assay Master of the Mint of Benares; and was there most usefully and honourably employed for above ten years. In his official capacity he devised many ingenious arrangements for the discharge of his duty with accuracy and despatch; and carried on, with equal industry and talent, various scientific investigations connected with his professional labours. Amongst others, he instituted a number of experiments on the best mode of measuring high degrees of temperature, the result of which was honoured by insertion in the Transactions of the Royal Society; and drew up an interesting report on the discoveries in Electro-magnetism, which was also published in this country, in the Quarterly Review. He also set on foot a Society at Benares for literary and scientific objects; and several valuable communications, especially on subjects of chemistry, meteorology, and astronomy, by him and his associates, were published, partly in the Asiatic\nResearches and partly in the Quarterly Oriental Magazine and Review, in Calcutta.\n\nNor were his duties whilst at Benares restricted to those of his office. His skill as an engineer and an architect were put in requisition by the local authorities; and he designed an edifice erected for a mint, repaired the minarets of the Mosque of Aurengzeb, when in a state that threatened infinite mischief to the adjacent houses; and planned and executed the means of draining the city. He also made a statistical survey of Benares, the particulars of which are published in the Asiatic Researches; and, whilst thus engaged, he availed himself of his talent and taste as an artist to delineate many of the most interesting of the picturesque and characteristic objects with which Benares abounds. His drawings were lithographed in England, and form a volume which for character and truth has never been equalled by any artistic illustrations of Indian scenery. The plates are accompanied by descriptions which are in like manner faithful and instructive, and show that he had made himself thoroughly acquainted with the people, as well as with the place. The same merit distinguished the whole of his career; and the natives of India never had amongst them a warmer, a more active, or a more judicious friend.\n\nUpon the abolition of the Benares Mint in 1830, the services of Mr. Prinsep were transferred to that of Calcutta; and with his removal commenced those remarkable exertions by which he is known as a distinguished Orientalist. He joined the Assay Office as Assistant Assay Master; but on the departure of his predecessor, Mr. Wilson, in January, 1833, he succeeded to the situation of Assay Master. In both capacities he was laboriously occupied by his official duties. He was also actively engaged in collateral scientific researches; in the chemical analysis of mineral or metallic substances, of the nature of which it was the interest of the Government to be accurately apprized; or in experiments or observations of a miscellaneous description.\n\nAmongst the principal fruits of his labours in this department were a series of experimental researches on the depression of the wet bulb hygrometer, a subject included amongst the desiderata of the British Association for the Advancement of Science; and an elaborate compilation entitled Useful Tables, in which the coins, measures, and weights of British India and the East are described from experimental verification; and the computations of time, according to the Hindu and Mohammedan calendars, are fully and clearly explained, and accompanied by chronological dynasties of the ancient and modern sovereigns of Persia, India, Tibet, Ava, Ceylon, and the interlying and adjacent regions: the whole constituting an authority of the highest character and greatest practical utility.\n\nThese duties and pursuits, although demanding far more than common assiduity, were insufficient to satisfy a mind, the activity of which was unwearyed, and the energies of which appeared to be inexhaustible; and the chief source of Mr. J. Prinsep's claims upon the admiration and gratitude of Orientalists, whether their tastes be scientific or literary, is the\nthe Journal of the Asiatic Society, of which he was the sole editor, and to which he was a most industrious and valuable contributor.\n\nIn 1829, Captain Herbert, then attached to the department of the Surveyor-General, set on foot a Periodical, to which he gave the modest denomination of \"Gleanings in Science,\" as it was especially of a scientific character, and was composed of materials in part derived from European publications of the same class. Captain Herbert left Calcutta in 1831, and before his departure, made over to Mr. Prinsep the continuation of his Journal. Mr. Prinsep having become joint secretary of the Asiatic Society, thought it likely that the objects of the Society and those of the periodical he had taken charge of, might be advantageously combined; and, with the concurrence of the Society, he changed the form and title of the work, to that of \"Journal of the Asiatic Society of Bengal,\" in which papers upon topics illustrative of man and nature in the East, whether communicated direct, or through the Society, might be appropriately made public. The project was judicious; its execution most successful; and the Journal of the Asiatic Society of Bengal is at once a monument of Mr. Prinsep's extraordinary talents and application, and a rich mine of information on many of the most interesting objects of Oriental research. The work, up to the time of his leaving India, extends to seven volumes; the two last of which are in two parts each, exceeding a thousand pages of closely printed matter in small type. There are, from Mr. Prinsep's own pen, nearly a hundred articles, besides a variety of editorial matter: there are some hundred plates, a great number of which are of coins and inscriptions; and most of these are drawn, and even engraved, by Mr. Prinsep himself. When to all this is added the entire editorial superintendence and correction of the work, from eighty to a hundred pages a month, it is difficult to conceive how it was possible for one unassisted individual to have accomplished the task; much more is the astonishment increased, when we find that all this labour and inquiry was not his business, of which he had more than enough beside,—but his amusement: the occupation of that time which any other public servant, however diligent and zealous, would usually have dedicated to rest, or to society.\n\nThe varied nature of Mr. Prinsep's contributions to the Journal will be best appreciated by reference to the Index of any one of the volumes. Thus, in the fifth, we find him the author of the following papers:\n\n1. On a new Standard Barometer; 2. On the Roof of the Church of Fort William; 3. On the Damatha Cave Inscriptions; 4. On the Chemical action of Copper on Ink; 5, 6, 7, 8, 9. On Ancient Inscriptions; 10, 11. On the Wet Bulb Hygrometer Depressions; 12. On the Measurement of the Arabic Quadrant; 13. On New Bactrian Coins; 14. On a statue of Silenus; 15. On New Mithraic Coins; 16. On Hindu Coins; 17. On the Vallabhi Dynasty; 18. On the Nautical Instruments of the Arabs; 19. On Sámar Salt; 20. On the Range of the Barometer in various places. The same volume has six full plates of Coins, drawn and engraved by Mr. Prinsep; and fifteen plates of Inscriptions and Antiquities, also drawn by him on stone.\nAmidst the many valuable contributions with which the Journal is furnished by its editor, those which have excited most universal interest, being known throughout continental Europe as well as in India, and better than in Great Britain, belong to the two classes of Coins and Inscriptions, in both of which the discoveries of Mr. Prinsep have been most surprisingly brilliant. Bringing to the task of deciphering ancient, and hitherto illegible characters, the readiness of resource which his practice of philosophical experiment had taught him; the quickness and accuracy of eye which he derived from his accomplishments as an artist; the energy and perseverance which were part of his nature, and the knowledge which he had gathered by observation and study, he combined qualifications rarely united in the same person, although essential to success; and completely made out the purport of the remains of antiquity which had been recently brought to light; or which when longer known, had baffled all previous ingenuity and application.\n\nAvailing himself promptly of a suggestion of Mr. Masson in regard to the inscriptions on the reverses of the Greek Bactrian Coins, he succeeded in forming an alphabet which has received the concurrence of the Continental scholars. He also determined the value of the characters which appear upon the coins found in Kutch; and first detected the curious application of Hindu inscriptions to Mohammedan names on the coins of the first Mohammedan princes of Delhi. In the characters of inscriptions on columns, stones, and rocks, Mr. Prinsep's researches have traced the formation of the alphabet in which Sanskrit has been written in Upper India, for the last thousand years at least, the Devanagari, through a variety of older modifications, up to what appears to be its earliest known form, that in which it is found upon the rocks in Gujarat, and which is certainly anterior to the third century before the Christian era. These modifications he has exhibited in two engraved tables in the seventh volume of the Journal; and they furnish an invaluable key to all future attempts to investigate further the subject of Indian Palaeography. It is not one of the least important of the results that he has obtained, that many of the details of both Brahmanical and Buddhist genealogy and chronology have been verified by the inscriptions he has deciphered; and that the same unquestionable evidences have confirmed the existence of amicable relations between Chandragupta, or Sandrocottus, and his immediate successors, with the Greek princes of Persia and Egypt, who were the successors of Alexander, as intimated by the Greek historians.\n\nThe numismatic and palaeological discoveries of Mr. Prinsep have contributed, in a most essential manner, to furnish a satisfactory outline of the history of India, from the invasion of Alexander, to that of Mohammed Ghori, an interval of fifteen centuries. That materials exist in the inscriptions in the cavern temples of India, for carrying the history still further back, to the sixth century before Christ, or the date assigned to the reformation taught by Sakya, Mr. Prinsep has himself intimated as possible; and it is stated in the Preface to the seventh volume of the Journal, which was completed under the superintendence of his brothers,\nthat it was his anxious purpose to have prosecuted this inquiry. The purpose was worthy of him; and if success were attainable, it would have been his portion. His untimely decease has interrupted all reasonable prospect of the question being immediately determined; but it is to be hoped that the zeal which it was one of his great merits to have had the power of animating in others, will not expire with him. His example may still incite the former associates of his labours to persevere, in the confidence that they cannot better honour his memory than by imitating his example.\n\nTowards the end of 1838, the extreme and incessant application with which Mr. Prinsep had laboured for six years, with little apparent feeling of inconvenience, certainly with no expression of a feeling of fatigue, no sensible diminution of zeal or vigour, produced effects, the more alarming that they were as unexpected as severe. After struggling against them for some time in vain, it became absolutely necessary to relinquish all business whatever, and seek for relief in rest and change of scene. The remedy came too late. The energy that had borne up against such unusual exertion so long, was entirely exhausted. Mr. Prinsep arrived in England in 1839, in a state of extreme prostration of bodily and mental strength; and although from his time of life, which was under forty, his constitutional vigour, his equability of disposition, and his temperate habits, his friends flattered themselves that they might augur favourably of the result, yet he continued to linger, without any permanent indication of amendment throughout the year; and has at last sunk beneath the fatal effects of a too prodigal and prolonged expenditure, and consequent exhaustion of the intellectual powers.\n\nMr. Prinsep was, at the time of his quitting India, Secretary of the Mint Committee, and of the Asiatic Society of Bengal. He was a Fellow of the Royal Society of London, and a Member of the Asiatic Society of Paris, and of various scientific and literary associations at home, on the Continent, and in America. Since his return to Europe, he had been elected Foreign Member of the Royal Academy of Berlin, and of the Institute of France.\n\nAmong the subjects of peculiar interest which have occupied the attention of the Society during the past year, no one possessed a higher value than the report of the progress made by Major Rawlinson in deciphering the arrow-headed inscriptions on the rocks at Bisitún. As historical monuments concurring with, and confirming the genealogy of Darius, the son of Hystaspes, given by Herodotus, and the great events of that monarch's adventurous reign, they are invaluable; while the comparative certainty which now attends the development of the cuneiform clusters of signs, and the concurrence of Major Rawlinson with Professor Lassen, and Monsieur Burnouf, as to the powers of those symbols, hold out the best hope that all the information which the inscriptions in that character, so widely diffused, may be supposed to contain, will ere long, be laid before the world.\n\nWith a highly praiseworthy desire of accuracy and certainty, Major\nRawlinson is anxious that his discoveries should not be printed except in their most complete and perfect form; and he has promised to lose no time in placing his entire translations in the possession of the Society for publication. Meantime the gratification experienced by the Meeting before whom the extracts and notes already received from Major Rawlinson were read, will be long recollected, and has excited a lively desire to receive the promised detail.\n\nThe union of Her Most Gracious Majesty with His Royal Highness Prince Albert of Saxe Coburg, an event which has diffused joy and hope throughout the land, has not been allowed by this Society to pass without paying their tribute of respectful congratulation on the happy occasion.\n\nAn Address was voted to Her Majesty, which was presented by the Right Honourable the President of the Society, accompanied by the Right Honourable Sir Gore Ouseley, Bart., and was by Her Majesty most graciously received.\n\nAn Address was also voted to His Royal Highness Prince Albert, which was transmitted by Sir Gore Ouseley; and acknowledged in the following letter from His Royal Highness's Comptroller of the Household, the Lord Robert Grosvenor.\n\nBuckingham Palace, April 2, 1840.\n\nMy dear Sir,\n\nI have this day, according to your desire, had the honour of submitting to Prince Albert, the Congratulatory Address from the Royal Asiatic Society. His Royal Highness duly appreciates your attention in not presenting it personally, and has commanded me to request that you will accept for yourself and have the goodness to convey to the Members of that Body His Royal Highness's best thanks for the expressions it contained.\n\nI remain, my dear Sir,\nYour's most faithfully,\nR. Grosvenor.\n\nRight Hon. Sir Gore Ouseley;\n&c. &c. &c.\n\nThe eleventh Number of the Society's Journal is now laid on the table; among its articles is one on the Sea-ports of China, written several years ago by one of the present Members of this Council, which will amply repay the attention with which it must be received at the present juncture.\n\nThe Council have received from the Secretary of the Oriental Translation Fund the following Report of the operations of that distinguished branch of the Society, which they have much gratification in laying before the Meeting.\nThe Committee have published since the last anniversary of the Society, the following works:\n\n1. Practical Philosophy of the Muhammadan People; being a translation of the Akhlak-i-Jalaly; by W. F. Thompson, Esq.\n2. The second volume of Professor Flügel's edition and translation of the great Bibliographical Dictionary of Haji Khalfa.\n3. The first volume of Professor Garcin de Tassy's Histoire de la Litterature Hindoui et Hindustani.\n4. The second livraison of M. Quatremère's translation of Makrizi's Histoire des Sultans Mamlouks.\n5. Professor Wilson's translation from the Sanskrit of the Vishnu Purana.\n\nThe importance of the Dictionary of Haji Khalfa is well known by Oriental scholars; and the value of the work of Makrizi, as the record of a dynasty full of interest to the investigator into the History of Egypt, is also justly appreciated. Elaborate and favourable criticisms have appeared of the works of Mr. Thompson and M. Garcin de Tassy, evidencing the attention they have attracted from reviewers, and the increasing desire of the reading public to become intimately acquainted with the literature of the East. The last work enumerated, the Vishnu Purana, must be especially gratifying to the inquirer into the curious and intricate mythology of the Hindus, and into the sectarian divisions of Hinduism. Professor Wilson's translation occupies no fewer than 665 pages in quarto, including numerous notes and elucidations; and is followed by an extensive index of names of divinities, heroes, sages, and places, affording a valuable key to the mythology of the Puranas, as well as to the Hindu myths in general. In the Preface to this work the learned translator has devoted forty pages to a succinct account of the whole eighteen Puranas. His analyses of two of these, the Brahma Purana and the Padma Purana, have already appeared in the fifth volume of the Journal of the Society; and it must be earnestly wished that Professor Wilson's health and leisure may enable him to accomplish the laborious task he has proposed to himself of placing, in the course of time, before Oriental scholars, similar analyses of the whole series of these voluminous writings.\n\nThe Preface to the Vishnu Purana contains also the result of much patient investigation into the cosmogony and doctrines of the Vedas and Puranas, and into the historical traditions derived from these ancient Hindu Scriptures, from which may be deduced many authentic data of the condition and progress of the civilization of mankind in very remote ages.\n\nThe Vishnu Purana must, therefore, be considered a most valuable addition to the treasures of Hindu literature which have been opened to Europeans by means of the Oriental Translation Fund and the exertions of its Committee. Amongst these treasures are to be found several other works of the highest interest relating to the same subjects; namely, the Raghuvansa, the Harivansa, the Rig-Veda, the Kumara Sambhava, and the Sankhya Karika, all translated from the Sanskrit, and affording the most\nauthentic materials for the studies of those few, who, as Professor Wilson observes in the Preface before mentioned, \"in these times of utilitarian selfishness, conflicting opinion, party virulence, and political agitation, can find a resting-place for their thoughts in the tranquil contemplation of the yet living pictures of the ancient world which are exhibited by the literature and mythology of the Hindus.\"\n\nAmong the translations recently offered to the Committee are those of the Nalodaya, from the Sanskrit, by the Rev. W. Yates, of Calcutta; and that of the Atish Kedeh, a biographical Persian work, containing an account of more than eight hundred Persian poets, with specimens of their compositions; proposed to be translated by N. Bland, Esq.\n\nOf the translations in the progress of printing, the History of the Mohammedan Dynasties of Spain, by Señor de Gayangoz, is nearly completed.\n\nThe new translations for the Committee, which are in a state of considerable forwardness, are\n\nThe Nishan-i Haideri, translated by Colonel Miles, from a MS. belonging to the library of Her Majesty.\n\nIbn Khallikan's Bibliographical Dictionary; translated by Baron Mac Guckin de Slane; and\n\nThe Kitáb al Yamini, translated by the Rev. James Reynolds.\n\nThe following Report of the Auditors was read:\n\nAUDITORS' REPORT.\n\nIn laying the Accounts of the Society, for the year ending 1839, before the Meeting, the Auditors regret to state that the financial resources of the Society do not exhibit so satisfactory an aspect, as might, upon a superficial examination, appear.\n\nIt will be gratifying, however, for the Society to know that there are no outstanding debts beyond the ordinary and current expenses of the season; and that the balances in favour of the Society exhibit an annual increase from the year 1837, at which period the balance in hand amounted to 170l. 19s. 2d.: in 1838, it was 296l. 3s. 3d.: in the past year, 1839, (as per Statement, No. I.) it amounts to 407l. 4s. 2d.: and, according to the estimate (as per Statement, No. II.) furnished to us by the Secretary, it is expected to amount, in the present year, to nearly 500l. But it here becomes the duty of the Auditors to point out to the Society that this apparent improvement in their financial affairs, does not arise from any increased prosperity in their resources, but from certain retrenchments introduced into their expenditure:—1st. in the appointment of an Honorary Secretary in lieu of a Stipendiary one; and, 2ndly, in the department of printing. And, with respect to the Library, it is to be regretted that the funds of the\nSociety have at all times been altogether inadequate to admit of hardly any appropriation to the objects of that department. But it is unnecessary for the Auditors to remark, that retrenchment or inadequacy in these departments is destructive of the efficiency of the Society, and the very objects for which it is instituted. It therefore becomes of the first importance for the Society to consider in what way their resources may be augmented, as well as their expenses reduced.\n\nThe Receipts for the past year, (vide Statement, No. I.) were:—\n\n| Description                                      | £  | s  | d  |\n|--------------------------------------------------|----|----|----|\n| For Annual Subscriptions and Arrears of ditto     | 647| 17 | 0  |\n| Admission Fees of New Members                     | 47 | 5  | 0  |\n| Compositions of Subscriptions                      | 115| 10 | 0  |\n| Annual Donation of the Hon. East India Company    | 105| 0  | 0  |\n| Dividends on Stock                                | 87 | 8  | 6  |\n| Sale of Publications                              | 53 | 12 | 9  |\n| **Making a Total of**                             | 1056| 13 | 3  |\n\nThe Disbursements were:—\n\n| Description                                      | £  | s  | d  |\n|--------------------------------------------------|----|----|----|\n| House-rent, one year                             | 220| 5  | 0  |\n| Rates and Taxes                                  | 57 | 19 | 10 |\n| Salaries and Wages                               | 247| 10 | 0  |\n| Printing Journal, and extra Copies of ditto      | 208| 16 | 1  |\n| Miscellanies                                     | 211| 1  | 5  |\n| **Total**                                        | 945| 12 | 4  |\n\nLeaving a Balance between the Receipts and Expenditure for the year, of\n\n| Description                                      | £  | s  | d  |\n|--------------------------------------------------|----|----|----|\n|                                                  | 111| 0  | 11 |\n| Which, added to the Balance of the preceding year, 1838 | 296| 3  | 3  |\n\nLeaves a Balance in favour of the Society at the close of 1839, of\n\n| Description                                      | £  | s  | d  |\n|--------------------------------------------------|----|----|----|\n|                                                  | 407| 4  | 2  |\n\nThe Assets of the Society are estimated as follows:—\n\n| Description                                      | £  | s  | d  |\n|--------------------------------------------------|----|----|----|\n| Value of Stock in 3 per cent Consols             | 1800| 0  | 0  |\n| Library, Museum, Furniture, Stock of Publications, &c. | 3500| 0  | 0  |\n| **Total**                                        | 5300| 0  | 0  |\n\nIt remains only for the Auditors to express their entire satisfaction at the correct manner in which the Accounts have been kept by Mr. Elliot, the Treasurer, and Mr. Clarke, the Honorary Secretary.\n\nSamuel Ball.\nWilliam Newnham.\n\nLondon, 2nd May, 1840.\n## STATEMENT, No. I.\n\n### RECEIPTS and DISBURSEMENTS, from Jan. 1. to Dec. 31, 1839\n\n#### RECEIPTS.\n\n| Description                                                                 | £  | s  | d  |\n|-----------------------------------------------------------------------------|----|----|----|\n| From 121 Subscriptions of Resident Members, at £3 3s. each                  |    |    |    |\n| 83 ditto, ditto, at £2 12s.                                                |    |    |    |\n| 4 ditto, Non-Resident ditto, at                                            |    |    |    |\n| Annual Donation of the Hon. East India Company                              |    |    |    |\n| Three Dividends on Stock in 3 per cents                                     |    |    |    |\n| Admission Fees of Nine New Members, at £5 5s.                               |    |    |    |\n| Four Compositions from Resident Members                                     |    |    |    |\n| Arrears of Subscription Copies of Publications sold                         |    |    |    |\n| Total Receipts in 1839                                                      |    |    |    |\n\nTotal Receipts in 1836: £1056 13 3\n\nBalance in hand at the end of 1836: £1352 16 6\n\n#### DISBURSEMENTS.\n\n| Description                                                                 | £  | s  | d  |\n|-----------------------------------------------------------------------------|----|----|----|\n| By House Rent, one year                                                     |    |    |    |\n| Rates and Taxes                                                             |    |    |    |\n| Salaries and Wages of Assistant Secretary, Clerk, Porter, and Housekeeper   |    |    |    |\n| Printer's Bill for Journal, No. IX.                                         |    |    |    |\n| Extra Copies of Journal, Nos. I., II., III., and IV., purchased to complete sets |    |    |    |\n| Stationery, Circulums, and Periodicals                                      |    |    |    |\n| Balance of Bricklayer's Account for Repairs of House                       |    |    |    |\n| Balance of Subscription List of Worsley Bust                               |    |    |    |\n| Coals                                                                      |    |    |    |\n| Sundry Small Bills                                                          |    |    |    |\n| Collector's Poundage Postages and Petty Disbursements                       |    |    |    |\n| Total Disbursements in 1839                                                 |    |    |    |\n\nTotal Disbursements in 1839: £945 12 4\n\nBalance in hand on the 31st Dec. 1839: £407 4 2\n\nTotal Receipts in 1839: £1352 16 6\n## Estimate of Receipts and Disbursements for 1840.\n\n### Estimated Receipts (Fixed)\n\n| Description                                                                 | £   | s  | d  |\n|------------------------------------------------------------------------------|-----|----|----|\n| From 130 Annual Subscriptions for 1840, at £2 2s. each                      |     |    |    |\n| Annual Donation of the II.on. East India Company                             |     |    |    |\n| One Year's Dividend on Stock in 3 per cents                                 |     |    |    |\n| **Total**                                                                   | 58  | 5  | 8  |\n\n**Total Receipts:** £753 7 8\n\n### Estimated Disbursements (Fixed)\n\n| Description                                                                 | £   | s  | d  |\n|------------------------------------------------------------------------------|-----|----|----|\n| By House Rent, one Year                                                     |     |    |    |\n| Rates and Taxes                                                             |     |    |    |\n| Salaries and Wages of Assistant Secretary, Porter, and Housekeeper          |     |    |    |\n| **Total**                                                                   | 220 | 5  | 0  |\n\n**Total Fixed Disbursements:** £220 5 0\n\n### Estimated Receipts (Contingent)\n\n| Description                                                                 | £   | s  | d  |\n|------------------------------------------------------------------------------|-----|----|----|\n| Admission Fees and Subscriptions of 12 New Members at £6 8s.                |     |    |    |\n| Compositions of Subscriptions                                                |     |    |    |\n| Arrears of ditto                                                             |     |    |    |\n| Sale of Publications                                                         |     |    |    |\n| **Total**                                                                   | 100 | 16 | 0  |\n\n**Total Contingent Receipts:** £100 16 0\n\n### Estimated Disbursements (Contingent)\n\n| Description                                                                 | £   | s  | d  |\n|------------------------------------------------------------------------------|-----|----|----|\n| Printing Journal, No. X.                                                    |     |    |    |\n| Stationery and Sundry Printing                                              |     |    |    |\n| Collector's Poundage                                                        |     |    |    |\n| Bookbinding and Periodicals                                                  |     |    |    |\n| Sundry Small Bills                                                           |     |    |    |\n| Coals                                                                       |     |    |    |\n| Postages and Petty Disbursements                                             |     |    |    |\n| **Total**                                                                   | 207 | 13 | 0  |\n\n**Total Contingent Disbursements:** £207 13 0\n\n### Balance in hand, 31st Dec. 1839\n\n| Description                                                                 | £   | s  | d  |\n|------------------------------------------------------------------------------|-----|----|----|\n| **Balance in hand, 31st Dec. 1839**                                          | 407 | 4  | 2  |\n\n**Total Balance in Hand:** £407 4 2\n\n### Estimated Balance on 31st Dec. 1840\n\n| Description                                                                 | £   | s  | d  |\n|------------------------------------------------------------------------------|-----|----|----|\n| **Estimated Balance on 31st Dec. 1840**                                      |     |    |    |\n\n**Total Estimated Balance:** £1416 5 10\nH. S. Græme, Esq. moved, \"That the thanks of the Society be returned to the Auditors; and that their Report, together with that of the Council, be received, and printed in the Society's Proceedings.\"\n\nThe motion was seconded by Dr. Horsfield, and carried unanimously.\n\nThe Right Hon. Sir Alexander Johnston, as Chairman of the Committee of Correspondence, gave to the Meeting an interesting and comprehensive resumé of the scientific and literary operations prosecuting in every part of Asia; to which, and the inquiries connected with their progress and effects, the attention of the Society should be directed.\n\nSir Edward Colebrooke, after expressing the pleasure which he had received in hearing the luminous sketch which had been given by Sir Alexander Johnston, of the various operations interesting to history, literature, and science, which were in progress in various parts of the East; and adverting to the zeal and anxiety always manifested by the Right Hon. Chairman of the Committee of Correspondence to draw the attention of the Members of the Society to every matter which might increase our knowledge of the East; and improve our means of advancing the welfare of our fellow subjects in India, moved, \"That the thanks of the Society be voted to the Right Hon. Chairman of the Committee of Correspondence; and that he be requested to reduce his observations to writing, for the purpose of being printed in the Society's Proceedings.\"\n\nSir James Alexander seconded the motion, which was carried unanimously.\n\nColonel Sykes having expressed his great regret at the absence of Colonel Barnewall, the Chairman of the Committee of Commerce and Agriculture, to whose zeal and exertions the Committee owed much of the progress they had made, proceeded to read the following summary of their Proceedings:\n\nPROCEEDINGS OF THE COMMITTEE OF AGRICULTURE AND COMMERCE.\n\nSince the last Anniversary Meeting of the Society, this Committee has embraced the investigation of several matters, very important to the trade and agriculture of India, and the commerce and manufactures of England. Various inquiries are still in progress, which it will take time to complete, and which, in the result, are expected to be very beneficial. To enter more fully upon them in this Report, would be but to anticipate the record of the Committee's Transactions. It will be sufficient to notice briefly, the most important of the matters that have engaged the Committee's attention.\n\nThe Committee have received several valuable communications respecting Cotton Wool. Foremost of these is a paper by Major-General\nBRIGGS, marked by much zeal, ability, and research, containing a sketch of the attempts which have been made to improve the Indian cotton, explaining the reasons why they have failed, and the manner in which he considers they should in future be conducted: next in order is a Memorandum by Dr. Lush, stating, from the result of much experience in India and inquiries in this country, the opinion he entertains of the great advantage that hereafter will be derived from a more general introduction of the culture of Pernambuco cotton. At the same time the Committee have to express their acknowledgments to Dr. Lush, they have also to add their acknowledgments to Mr. Williamson, the late able Revenue Commissioner at Bombay, for a Paper containing his views of the best measures which can be acted upon for obtaining an adequate supply of cotton from India for the home market. This paper, and several important suggestions from Mr. Williamson, the Committee consider of much value. They have in continuation of this subject, printed for circulation the instructions of the Honourable the Court of Directors to the Government of India; also, Lord Auckland's Minute of the 14th of August, 1839, which embraces a review of all the information before the local governments of India at that period, which, with the latest proceedings of the Horticultural and Agricultural Society at Calcutta, the Committee believe to comprise information of great value and importance at this moment.\n\nMr. Solly is at present occupied in the examination of an extensive series of cotton soils, from various countries in America, Asia, and Europe; which, it is hoped, will be completed in time to be inserted in the next number of the Proceedings.\n\nMr. J. Capper, of Ceylon, has furnished the Committee with some interesting information respecting the production of sugar in that island. The attempts, which have hitherto been made to cultivate the sugar cane and manufacture sugar in Ceylon, have failed. Mr. Capper, however, states, that it is at last succeeding. The sample of Ceylon sugar forwarded by him, has been favourably reported on here; and a considerable quantity is now on its way to this country. Whilst on the subject of sugar, the labours of Dr. Gibson must not be omitted. It would have been difficult to select a man more admirably calculated to carry out successfully attempts to improve the rude processes of the natives than Dr. Gibson; the result of whose perseverance is not merely that he has himself made superior sugar, but that he has also, by his example and influence, induced the natives to adopt his improvements. Samples of sugar prepared under his superintendence have been reported on by Mr. J. Travers and Mr. Solly.\n\nThe extraordinary progress which has been made in improving Indian wool is now known to almost every one. The Committee has received some valuable information from Mr. Thomas Southey; and they have also to record a highly interesting paper from Lieutenant Conolly, on the Angora goat; which has been printed and distributed.\nA commercial history of the rise and manufacture of cocoa-nut oil, has been received from Mr. Capper, which shows the rapidly increasing demand for that article; and points out how large a supply of it may be obtained from Ceylon alone. Connected with this subject, are several communications on the best means of importing cocoa-nut oil, so as to guard against the great loss from leakage which has been commonly experienced. It appears, that from the fortunate discovery of a wood adapted to the purpose, casks are now made in which the oil is brought over without any loss; and that thus the evil is perfectly remedied. A letter lately received from the Bombay Chamber of Commerce, after returning thanks for Mr. Solly's report on oils, announces that they are in hopes of being enabled to send over to this country, a sufficient quantity of each of the new oils described in that Report, to enable experiments to be made to ascertain satisfactorily their commercial and practical value.\n\nA series of several papers have been read by Mr. Solly on drugs and dye stuffs. One of the principal of these is an account of an extensive collection of samples from the Punjab and Mysore, sent over by the Chamber of Commerce at Bombay, to the London East India and China Association, and by that body forwarded for examination. Although in so extensive a collection of substances, there are of course many well-known articles; yet there are also several new and unknown substances which promise to be of value, and are therefore worthy of further and more complete experiments. Amongst the most important of the new substances described in this Report may be noticed, \"Maen, an astringent substance, suited as a substitute for galls;\" \"Poppli Chickha;\" \"Maddi Chickha;\" and \"Lodar bark,\" dye stuffs; and the Tallow, or solid oil from the Vateria Indica, &c. &c.\n\nPapers on Lichens, and on East Indian Safflower, by Mr. Solly, have been read. In the latter, inquiry is made into the probable cause of the great superiority of the Chinese over East India Safflower.\n\nMr. Solly's observations on Malwa and Kandeish Opium, and on a new Indian resin, adapted to the making of varnish, may also here be mentioned.\n\nSeveral papers on the cultivation of silk have been received. Amongst these, it is sufficient to specify one by Colonel Sykes, in which he recommends the introduction of the Morus Multicaulis into India, as its cultivation is stated by the Americans to be attended by peculiar advantages; and to be better adapted to the growth of good silk than any other species of mulberry.\n\nThe observations of Mr. Browne on the successful cultivation of Tea in Wynaad, have been confirmed by a paper from J. Sullivan, Esq., who, however, states likewise, that the plants are also now flourishing in the Neilgherries.\nThe importation of Caoutchouc from Assam has greatly increased; and some of it is considered to be superior to any other rubber for manufacturing purposes. The introduction of this article into the English market, which originated with our Secretary, Dr. ROYLE, has caused a very considerable reduction in the price of South American Caoutchouc, and prevented its becoming, as it were, a monopoly.\n\nIn consequence of applications from India respecting the fibre of the leaf of the pine-apple, Mr. Solly made inquiries concerning its eligibility as an article of manufacture. The result of his inquiries shows, that although there is evidently a considerable prejudice against its use, yet, that if it could be brought over cheap, it might undoubtedly be used with advantage.\n\nMany other communications, on cattle, linseed, kino, cinnamon, coffee, &c. &c., have been read, which it is unnecessary here further to particularize. A second number of the \"Proceedings\" appeared in the course of last summer; and a third, which will bring down the account of the labours of the Committee to the conclusion of the present year, is being prepared.\n\nThe Committee beg to express their best acknowledgements to Mr. Solly, for the benefit they have derived from the zeal and ability evinced by him during the past year, and for the valuable papers read by him before the Society.\n\nWILLIAM NEWNHAM, Esq., moved, and L. H. PETIT, Esq., seconded the motion, \"That the thanks of the Society be voted to the Chairman of the Committee of Commerce and Agriculture, for his valuable services in that office.\"\n\nThe motion was put and carried unanimously.\n\nDAVID POLLOCK, Esq., moved, \"That the thanks of the Society should be voted to the Council, for their important and valuable labours during the past year.\"\n\nThe motion was seconded by ROBERT HUNTER, Esq., and carried unanimously.\n\nThe Right Hon. the President, in rising to thank the Meeting, in the name of the Council, for the vote just passed, begged leave to apologize for the rarity of his attendance during the past year at the Meetings of the Society, which was occasioned by infirmity and indisposition, in consideration of which he hoped he should be excused. He had heard with pleasure the Report of the Council; it was true that many might regret that the finances of the Society were not in a more prosperous condition, but he augured well for them in future. He thought there was every prospect of the exertions of the Society attracting more favourable notice, and was convinced that they were on the way to superior prosperity. He did not wish to undervalue the exertions of individual Members, who might by private application gain new Subscribers among their friends; but he trusted much more to an increased public sense of the efficiency of the Society, as improving our acquaintance with India, and showing how the interests of India might be benefited.\nThe Right Hon. Chairman of the Committee of Correspondence had shown how many causes were at this moment in operation to produce an advancing movement in the East; but he had omitted one very potent agent of civilization, and that was steam navigation. The time required now for a voyage to India was what would have been required, a few years ago, for a tour to Russia or Constantinople. Instead of looking anxiously once or twice a year for the Indian fleet, we had now a monthly communication with that part of our Empire. We owed to this rapid intercourse the more lively interest now taken in Eastern matters, and the more extensive knowledge which now prevails of Asia generally. He knew that much greater interest was felt for India by this country than at any former period. It was urged, and felt, and acknowledged in our Parliament, that we owed a great debt to India; that India was a source of great profit to this country; that we had drawn largely upon its resources; and that we had not made any adequate return. He thought that the Society was also aiding to raise an interest in the East, by communicating to the public the results of researches into the antiquities of Asia. And he would now allude to the Bisitun Cuneiform Inscriptions, which had been copied with zeal and care, and deciphered with great sagacity by Major Rawlinson, who had thus been instrumental in affording that which promised to contribute more information regarding the East, than had been received for centuries, contained in documents whose authority was undeniable, in inscriptions more ancient than any that had ever been read. These inscriptions were full of historical information, not concerning a small and obscure tribe, but of one of the first and most civilized nations of antiquity, the Empire of Darius Hystaspes. Such a contribution to literature would be a material recommendation, and was calculated to awaken the interest of Europe. It would do more towards promoting the Society than all the exertions of individual Members to procure subscriptions or assistance from Government. He was of opinion that the successful cultivation of tea in India had also done much towards creating an interest in England respecting that country. It had been introduced in a fortunate moment, when the continuance of our trade with China was suspended; and although he hoped that our intercourse with that Empire would ere long be renewed, he was glad that we were preparing to be independent of it, for what had become with us a necessary of life. The discovery of tea in Assam we owed, as we owed so many other advantages, to the talent, the perseverance, and intelligence of the servants of the East India Company, of whom Canning had said, \"They united the abilities of statesmen with the research of scholars.\" He hoped the Journal of the Society would continue to be the vehicle of communicating to the world the results of the enlightened labours of those officers, and it must bring more co-operation than any canvass or individual exertion could do. The Right Hon. President concluded with the expression of his anxious desire for the welfare of the Society.\n\nSir GEORGE STAUNTON rose and said that those who witnessed the infirm state of our excellent President could not but feel a double measure of gratitude to him for his appearance at Councils whenever he was able,\nand especially for his attendance on the present occasion. He felt and lamented with the Council that all hopes of obtaining immediate assistance or patronage from the Government had failed; but he felt also that the failure did not arise from any want of exertion on the part of the President or of the Council. They had repeatedly endeavoured to draw the attention of Government to their case, both in a national and political point of view. They had obtained from Her Majesty the most gratifying expression of the interest she took in their prosperity. He felt it would be invidious to enter particularly into the causes why nothing practical had hitherto resulted from Her Majesty's gracious disposition to the Society. He would confine himself, therefore, to offering his congratulations to the Society, that notwithstanding this disappointment, they had been able, though entirely unassisted, to do so much towards the promotion of the various great and useful objects for which it was instituted. He was confident that they would continue to render important benefits to India, and greatly improve our knowledge of its resources, and extend our communication with it, so that, in the end, the national importance of the Society would be better appreciated.\n\nSir George Staunton begged, before he sat down, to draw the attention of the Meeting to an important Memoir on the subject of our intercourse with China, by Mr. Ball, a Member of the Council, which had been just published by the Society. Mr. Ball had resided above twenty years in China, and had peculiarly devoted his attention, throughout that period, to the cultivation and manufacture of tea, and the best mode of supplying this country with that most important article of our Chinese commerce. About the period of Lord Amherst's embassy Mr. Ball reduced the results of his inquiries upon this interesting subject to the shape of a Memoir for the information and assistance of our Ambassador in his negotiation, especially with respect to the Ports of China at which that trade might be most advantageously carried on for the interests of both countries. This Memoir was privately printed, but only two or three copies of the original impression at present exist; and the Council considered that they would be rendering an important public service by reprinting in their Journal a document, which, though it was unhappily not available for any useful purpose at the time it was written, was become of peculiar importance at the present period, when the whole of our relations with China were evidently undergoing revision, and about to be placed on a new footing through negociations supported by competent force from India and this country.\n\nSir George concluded by proposing that the thanks of the Society should be voted to the Right Hon. the President.\n\nSir Jeremiah Bryant, in seconding the motion, said that he was one of those who had cordially welcomed the President, when, at the first institution of the Society, he took the chair which Sir Jeremiah rejoiced to see him still filling, so much to the advantage of the Institution and its interests.\n\nThe vote was put, and carried unanimously.\nThe Rev. Dr. Mill rose and said that many words were not necessary in introducing the motion he was about to make. No one who had the advantage of knowing the learned Director, or who had read his valuable lectures delivered at the University, of which he is an ornament; no one who had seen his version of the Vishnu Purana, or who had profited by his many other valuable contributions to Oriental learning, but would desire to testify the high sense entertained of his distinguished merits; and he would therefore propose a vote of \"Thanks to the Director and Vice-Presidents of the Society for their valuable services.\"\n\nThe motion was seconded by W. Oliver, Esq., and carried unanimously.\n\nThe Director returned thanks for the honour done him; and expressed his readiness and desire at all times to contribute, by every means in his power, to promote the great objects, and further the interests of this valuable Institution.\n\nSir Edward Hyde East moved, that the thanks of the Society be voted to the Honorary Secretary, Mr. Clarke, for his valuable services in the performance of the important and onerous duties confided to him, on the efficient discharge of which, the usefulness of the Society so much depended. He felt assured that this vote would have been carried by acclamation, if the forms of the Society would have permitted him so to propose it. In reference to the Report of the Council he would remark, that although the Society was cramped by want of funds, yet, on the whole, he saw no reason to despair of its progress and success. But such an institution, like everything else, required time to arrive at maturity; and the public did not at once discover all the sources of advantage or information to be derived from it. The Society had communicated to the world much that was valuable, and so doing must excite the public interest. Conducted as it was, he thought there was no doubt that its affairs would eventually be as prosperous as its best friends could desire.\n\nThe motion was seconded by F. C. Belfour, Esq., and carried unanimously.\n\nMr. Clarke, in returning thanks, assured the Meeting that his humble services, of which the value had been greatly over-rated by the Right Honourable and Learned Mover, had been rendered most easy and agreeable to him by the indulgence with which they were always received by the Council, and by the ever-ready aid and support of their invaluable Director. He should be ungrateful if he did not also acknowledge the great assistance he derived from the zeal and efficiency of the Assistant Secretary, Mr. Norris, whose various and extensive acquirements, and zeal in the pursuit of those subjects of inquiry to which the labours of this Society are directed, entitled him to their best acknowledgments.\n\nMajor Chase moved, and Charles Roberts, Esq., seconded, a vote of thanks to the Treasurer of the Society; which was carried unanimously.\nMr. Elliott returned thanks.\n\nThe Honorary Secretary submitted a recommendation from the Council of the 7th of December last, that Article XXI. of the Regulations should be so modified as to accord with Article VII. The intention of the Rules was to restrict the election of Corresponding Members to persons not resident in Great Britain. A case had lately occurred of a gentleman being proposed who resided at Malta. The present wording of Article XXI. would have prevented his election, because he was residing in the British Possessions in Europe; whereas, according to the known intention of the Society, and to the wording of Article VII. he was clearly eligible, as not residing in Great Britain; and was a most desirable accession to the number of Corresponding Members.\n\nIt was therefore proposed to omit in Article XXI. the words, \"in the British Dominions in Europe,\" and to substitute the words, \"within the British Islands,\" as in Article VII., where the same class of Members are spoken of. The motion was put and carried unanimously.\n\nIn pursuance of Article LIII. of the Regulations of the Society, the names of Members whose subscriptions have been in arrear for at least eighteen months were declared. The defaulters were three only; and their names are now excluded from the list of the Society.\n\nColonel Galloway and Major John Smith having been appointed Scrutineers, the Meeting proceeded to ballot for the new Members of Council, and for the officers of the Society.\n\nAt the close of the ballot the following gentlemen were declared elected into the Council, in the room of the eight Members who go out by rotation:\n\nColonel Sir Jeremiah Bryant, C.B.; Sir Charles Forbes, Bart.; J. Marshall Heath, Esq.; Sir Richard Jenkins, G.C.B., M.P.; Sir James Law Lushington, G.C.B.; The Rev. W. H. Mill, D.D.; William Newnham, Esq.; Henry Wilkinson, Esq.\n\nAll the officers of the Society were declared unanimously re-elected.\n\nThe next Meeting was announced for the 20th of June.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/b22394254.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 29904, "total-output-tokens": 14817, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1826, 1], [1826, 4832, 2], [4832, 6911, 3], [6911, 10114, 4], [10114, 13243, 5], [13243, 16441, 6], [16441, 19714, 7], [19714, 23040, 8], [23040, 26195, 9], [26195, 28490, 10], [28490, 31519, 11], [31519, 34124, 12], [34124, 37147, 13], [37147, 39854, 14], [39854, 43751, 15], [43751, 46348, 16], [46348, 49406, 17], [49406, 52214, 18], [52214, 55124, 19], [55124, 58498, 20], [58498, 61669, 21], [61669, 64578, 22], [64578, 66570, 23], [66570, 66570, 24]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]