[{"id": "365460b3f9642edceddf40ddfee32ca942bb7b2a", "text": "TRANSACTIONS\n\nOF THE\n\nKOREA BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY\n\n鮮 朝\n\nVOL. VII.—Part I.\n\nSupplied gratis to all Members of the Society.\n\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\n\nSeoul, Korea: The Korean Religious Tract Society.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trübner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1916.\nGOLD MINING IN KOREA\n\nEdwin W. Mills.\nGOLD MINING IN KOREA\n\nEDWIN W. MILLS.\n\nPreface.—Although the origin of gold mining in Korea cannot be stated definitely, it can, however, be traced back to a period before the beginning of the Christian era. Gold mining, in all probability, was introduced by followers of Ki-ja (箕子) who migrated from China to Korea in 1122 B.C.\n\nThis paper is presented with the hope that it may be the means of stimulating further interest in one of the great resources of Korea, and that others may be encouraged to add from their store of knowledge to the information and data set forth in the following pages.\n\nMy experience in Korea extends over a period of thirteen years, during which time I have visited all the gold-districts mentioned in this paper. I have also been connected with the companies operating in the three largest gold-producing districts, namely—Unsan (雲山), Suan (遂安), and Chiksan (稷山).\n\nI take this opportunity to acknowledge my indebtedness to Messrs. Alf Welhaven, A. H. Collbran, and J. J. Martin, General Managers of the Unsan, Suan, and Chiksan Mines, respectively, who have kindly given me the data relating to the gold production of their respective mines for 1915. I am indebted also to Messrs. T. Kawanabe and S. Kawasaki, of the Mining Section, Department of Agriculture, Commerce, and Industry, of the Chosen Government-General, for the information given to me regarding the gold production of Korea for the years 1905-1914, inclusive, and for the production of the French concession. Acknowledgment is due also to Mr. A. E. Deardorff, of the Unsan\nMines, for the photographs of the \"rocking\" and \"grinding\" stones. Finally, I am greatly indebted to Mr. Raymond S. Curtice, American Vice-Consul in Seoul, for his kindness in providing me with the data relating to the gold production of Korea for the years 1884-1915, inclusive.\n\nIntroduction.—The peninsula of Korea lies between $33^\\circ 12'$ and $43^\\circ 02'$ north latitude, and between $124^\\circ 13'$ and $130^\\circ 54'$ east longitude,\\(^1\\) and has an area of 84,173 square miles.\\(^2\\) It is bounded on the north-west by the Ya-lu (Am-nok) River (鴨綠江), which separates it from Manchuria and flows into the Yellow Sea. On the north-east it is bounded by the Tu-man River (豆滿江), which separates it from Asiatic Russia and flows into the Pacific Ocean. Its length is about 600 miles, and its width ranges from 150 to 300 miles.\n\nThe total population of Korea, on December 31, 1913, was estimated at 15,458,863.\\(^3\\) Assuming that the ratio of increase for the past two years has been constant, it may be estimated that the total population, on December 31, 1915, was 17,000,000.\n\nKorea, in general outline, is similar to Italy, and has been aptly called the \"Italy of Eastern Asia.\"\\(^4\\) As Italy projects between the Adriatic and Mediterranean Seas, so does Korea extend southward between the Yellow Sea and the Sea of Japan. The outline of Italy is generally compared to that of a boot, while that of Korea may be taken to represent a rabbit in a standing position, and facing China.\\(^5\\)\n\nKorea is essentially a mountainous country; some of the mountains are extinct volcanoes, and one especially noted is Paik-tu-san (白頭山) (White Head Mountain), in the extinct crater of which lies a lake. The eastern coast of Korea is very\n\n---\n\n\\(^1\\) Annual Report on Reforms and Progress in Chosen (Korea), (1913-1914) Seoul, July, 1915, p. 158.\n\n\\(^2\\) ibid.\n\n\\(^3\\) ibid, p. 159.\n\n\\(^4\\) Koto, The Journal of the College of Science, Imperial University of Tokyo, Japan, Vol. XIX, Article 1, 1903, p. 1.\n\n\\(^5\\) ibid, p. 3.\nmountainous, but the western coast is much less so, although dotted with almost countless islands.\n\nThe climate is very much the same as found in the eastern states of America between the same latitudes, with the exception of the \"rainy season,\" which begins generally in June or July, and extends over a period of six weeks. The climate, as a whole, is excellent.\n\nThe geologic formations are composed mainly of Archean and Paleozoic rocks through which recent volcanic rocks have been intruded. The climatic conditions have been extremely favorable for the deposition of auriferous gravels which have been found in every one of the thirteen provinces of Korea.\n\nAppended to this paper is a General Map of Korea upon which the principal gold-districts, including placer deposits, are shown.\n\n**North and South Korea.**—For not only topographic and climatic reasons, but also on account of mining conditions, Korea may be divided approximately into two equal halves by drawing a line obliquely through the peninsula from Yong-heung Bay (永興灣) on the eastern coast, near Won-san (元山), to Kang-wha Bay (江華湾), near Chemulpo (仁川). This dividing line not only forms a natural boundary, as shown by Prof. Koto, but it is convenient for descriptive purposes. North Korea thus comprises the following five provinces:—Whang-hai (黃海道), North Pyeng-an (平安北道), South Pyeng-an (平安南道), North Ham-kyung (咸鏡北道), and South Ham-kyung (咸鏡南道).\n\nSouth Korea includes eight provinces, as follows:—Kyong-ki (京畿道), Kang-won (江原道), North Kyung-sang (慶尚北道), South Kyung-sang (慶尚南道), North Choong-chung (忠清北道), South Choong-chung (忠清南道), North Chul-la (全羅北道), and South Chul-la (全羅南道).\n\n---\n\n1 Koto, *The Journal of the College of Science, Imperial University of Tokyo, Japan*, Vol. XIX, Article I, 1903, p. 7.\n\n2 Ibid, p. 8.\nIt will be shown in this paper that the largest gold mines are in North Korea, and that its gold production has been much greater than that of South Korea.\n\n**Historical References to Gold and Gold Mining.**—Korea has been known for many centuries to be rich in gold. It is not at all certain, however, just how and when the occurrence of gold in Korea was first brought to the attention of any Western nation. Griffis states: \"The first notice of Corea in western books or writings occurs in the works of Khordad-beh, an Arab geographer of the ninth century, in his Book of Roads and Provinces. He is thus quoted by Richthofen in his work on China (p. 575, note): 'What lies on the other side of China is unknown land. But high mountains rise up densely across from Kantu. These lie over in the land of Sila, which is rich in gold.........'\"\n\n\"Richthofen rightly argues that Sila is Shinra and Kantu is the promontory province of Shantung. This Arabic term 'Sila' is a corruption of Shinra—the predominant state in Corea at the time of Khordadbeh.\"\n\nThe above has been generally accepted as a fact, but, according to Hulbert, it is difficult to believe, as \"there is not the slightest intimation in the (Korean) records of that time that Western traders ever visited the coasts of Sil-la (新羅).\"\n\nThe earliest mention of gold in Korean history is noted, according to Hulbert, in connection with the people of the kingdom of Ma-han (馬韓), 193-9 B.C. It is stated that \"another marked difference between these people and those of the north was that the Ma-han people held neither gold nor silver in high repute.\" \"The Ma-han people occupied the southwestern part of the peninsula, comprising the whole of the present province of Ch'ung-ch'ung (忠清道) and the northern part of Chul-la (全羅).\"\n\n---\n\n1 Griffis, Corea, The Hermit Nation, New York, 1897, 6th edition, p. 2.\n2 Hulbert, The History of Korea, Vol. I, Seoul, 1905, p. 118.\n3 ibid, p. 29.\n4 ibid, p. 28.\nTo the northward was the tribe of Nak-nang (樂浪), who later joined the Kingdom of Ko-gu-ryu (高句麗). In connection with the court of this ancient kingdom it is noted by Hulbert, that in about the year 26 B.C., \"there were special court garments of silk embroidered with gold and silver.\" This ancient kingdom probably comprised the present provinces of North Pyeng-an (平安北道), South Pyeng-an (平安南道), Whang-hai (黃海道), and a portion of Kyong-ki (京畿道).\n\nFrom the above it is evident that the Ma-han (馬韓) people were ignorant of the value and use of both gold and silver, while it is certain that the Ko-gu-ryu (高句麗) were familiar with both. In 10 B.C., during the eighth year of the reign of On-jo (溫祚) in the small kingdom of South Pu-yu (扶餘), it is recorded that the king rewarded one of his victorious generals with \"land, horses, and thirty pounds of gold.\" Hulbert states \"it is probable that this new kingdom (South Pu-yu) sprang up in the district called Pak-che (百濟),\" probably in the present district of Chik-san (稷山) in South Choong-chung Province (忠清南道).\n\nRecords show that Ko-gu-ryu (高句麗), in the sixth century, was paying a revenue of gold and jade, as a vassal state, to the Wei Emperor. In 1036, the king of Ko-ryu (高麗) Wang-hyung (王享), forbade the use of gold, and this probably caused a decline in the mining of gold at that time. During the years 1065-1077, in the reign of Wang-whi (王微) of Ko-ryu (高麗), a large Buddhist monastery was built in Song-do (開城), and it is recorded that it contained a pagoda \"upon which 140 pounds of gold and 427 pounds of silver were lavished.\" This would seem to indicate that gold mining, both lode and alluvial, must have been increasing steadily to produce this quantity of the precious metals.\n\n---\n\n1 Hulbert, The History of Korea, Vol. I, Seoul, 1905, p. 40.\n2 ibid, p. 25.\n3 ibid, p. 42.\n4 ibid, p. 42.\n5 ibid, p. 78.\n6 ibid, p. 165.\n7 ibid, p. 167.\nThe first definite mention of gold mining I have been able to find is that about 1079 \"the people of Hong-wun (洪原) dug a hundred ounces of gold and a hundred and fifty ounces of silver which they sent to the king.\" Apparently gold mining continued, as the records show that about the year 1218, during the reign of the king Wang-chul (王曦), several years before the Mongol invasion, the envoy from the Mongol emperor, Genghis Khan (成吉斯汗), was presented with gold in addition to other gifts. In 1232 the king sent seventy pounds of gold, together with other gifts, as a tribute to the Mongol general, Sal Ye-tap (撒禮塔). Again in 1340 the king Wang-jung (王祖) sent gold and silver to China \"to purchase many things of foreign manufacture.\" About 1380 it is recorded that General Yi Ta-jo (李太祖) was presented with 50 ounces of gold upon his return to Song-do, after defeating Japanese pirates in Chul-la Province (全羅道). About this time the Ming emperor ordered the king, Sin-U (辛禑), to send him each year one hundred pounds of gold together with other tribute. It is recorded that the king succeeded in sending only three hundred ounces of gold. However, in 1383, he was able to send one hundred pounds of gold, with other tribute, to the Ming court.\n\nAlthough no further mention of gold is made in Hulbert's work until the reign of the king, Yi-chong (仁祖), 1623-1650, it is quite evident that gold mining was carried on, even though intermittently. There is no doubt that during the first and second invasions of Hideyoshi (秀吉), 1592 and 1597, respectively, a considerable quantity of gold must have been collected by the invading armies and carried back to Japan on their return. During the reign of Yi-chong (仁祖), about the year 1634, the Manchu envoy demanded 10,000 ounces of gold as\n\n---\n\n1 Hulbert, The History of Korea, Vol. I, Seoul, 1905, p. 169.\n2 ibid, p. 189.\n3 ibid, p. 194.\n4 ibid, p. 236.\n5 ibid, p. 275.\n6 ibid, p. 275.\n7 ibid, p. 276.\n8 ibid, p. 276.\n9 ibid, Vol. II, p. 93.\ntribute. In 1636 this was reduced to one hundred ounces of gold yearly. As a matter of fact neither of these demands was fulfilled. In 1660, it is recorded that the king Yi-hun (顯宗) \"remitted the tax on the gold mines at Tan-chun (端川), which had amounted to one thousand ounces per year.\"\n\nMining was again forbidden about the year 1724 by the king, Yi-eum (英宗), who forbade silver and copper mining at An-byun (安邊), but, curiously enough, no mention is made of gold mining. An item of more than passing interest is that recorded regarding the part taken by gold miners in an uprising in 1811.\n\nIn that year, during the reign of King Yi Kwang (純宗), Hong Kyong Na (洪景來), a wealthy resident of Pyeng-an Province (平安道), started an uprising by persuading 5,000 gold miners to accept his proposal to set up a kingdom of his own. They caused the government considerable trouble, and succeeded in taking the towns of Chong-ju (定州), Chul-san (鐵山), Ka-san (嘉山), Soon-chun (順川), Yong-chun (龍川), Pak-chun (博川), and Son-chun (賓川), in quick succession. An-ju (安州), was also taken after a siege of ten days, but the arrival of government troops forced the miners to fall back upon the city of Chong-ju (定州), where eventually they were defeated by troops under General Yo Hyo-wun (堯喜元).\n\nFrom the foregoing historical references it may be seen that some strong foundation existed for the reputation Korea has had regarding its mineral wealth. As has been shown a certain amount of gold was sent annually to China as tribute, and, no doubt, a considerable amount was bartered at the frontier markets. Further color was lent to Korea's richness in gold from the fable that Korean kings were buried in coffins of solid gold. This fable doubtless inspired the predatory expedition of Oppert, a German trader, from Shanghai in 1867.\n\n---\n\n1 Hulbert, The History of Korea, Vol. II, Seoul, 1905, p. 93.\n2 ibid, p. 124.\n3 ibid, p. 146.\n4 ibid, p. 169\n5 ibid, pp. 192-3.\nThis expedition sailed up the Han River (漢江) to a place about 40 miles from the sea, and excavated what was thought to be a royal tomb with the ostensible purpose of securing the gold coffin supposed to be there. Their tools were insufficient for the work in hand, and they were obliged to return to their boat, being attacked by the Koreans on their way back. Thus the raid was abandoned, and the expedition returned to Shanghai.\\(^1\\)\n\nIt has been clearly shown, I believe, that gold mines were worked, particularly in North Korea, by the Koreans for many centuries before the arrival of foreigners. Until the year 1895 it appears, from what I have been able to learn, that the principal mining districts were under the patronage of the Imperial Household, or of certain of the Ministers. The people were forbidden by law to engage in mining unless they did so under the direction of government officials. In many instances the necessary authority was delegated to the provincial officials who were probably more concerned with the amount of gold collected as taxes than in encouraging the proper development of the mining industry in their respective districts. Even though the regulations were not uniform for regulating the mining work in the gold-districts, and though the taxes were not fairly distributed, the records show that from 1884 to 1895 the gold exportation amounted to a total of Yen 10,824,620. These figures do not represent the true total, as, no doubt, a certain portion of the gold produced would stay in the country each year and not be accounted for; it is evident also that a part was carried away each year across the Manchurian frontier, for which no accounting was made in the records.\n\n**Korean Mining Methods.**—Although the apparatus and tools used by the Koreans in mining may appear very primitive to Western engineers, it must be admitted that the Koreans have attained great skill in using them. The tools used today in\n\n---\n\n\\(^1\\) Longford, *The Story of Korea*, London, 1911, p. 233.\nplacer mining differ but slightly from those used during the past few hundred years.\n\n1.—Placer Mining.\n\nUntil recent years the chief source of gold was the auriferous gravels which have been worked from time immemorial. Since the introduction of modern mining methods and machinery by foreigners the amount of gold won from lode mining has far surpassed that obtained from placer mining.\n\nAmong the Koreans the following are ten of the most noted placer districts:\n\nNorth Pyeng-an Province ........ { Un-san (雲山)  \n(平安北道)       Yeng-byen (寧邊)  \n(Syen-chun (宜川)  \nSouth Pyeng-an Province ......... { Soon-an (順安)  \n(平安南道)       Su-an (遂安)  \nWhang-hai Province .............. { Song-wha (松禾)  \n(黃海道)       Ham-heung (咸興)  \nSouth Ham-kyung Province ...... { Tan-chun (端川)  \n(咸鏡南道)       Chik-san (稷山)  \nSouth Choong-chung Province .. { Mun-eui (文義)  \n(忠清南道)\n\nThere is no question in my mind that the gold production from the placers in North and South Pyeng-an Province has amounted to as much as Yen 800,000—1,000,000 per year at their most prosperous period. For the year 1914 the gold production reported from placers in these two provinces was Yen 300,813.¹ As these figures show only what was reported to the Government, it is a certainty that the actual production was higher, because a certain amount of gold was doubtless used or carried away by the miners without being reported.\n\nThe Korean word for placer mining is To-chum (土店 (토점). Placer gold or To-geuni (土金 (토금) means literally, \"earth-gold.\" Before describing the methods usually employed\n\n¹ Communication from Mr. S. Kawasaki.\nin placer mining I wish to call your attention to the following list of tools generally employed; these are shown in Fig. 1.\n\n1.—Ho-mi (锄 (호미)), used as a small pick or hoe in excavating placer ground.\n\n2.—Pyuk-chai (壁採 (벽채)), similar to the ho-mi, but much larger and also used for excavating.\n\n3.—Ka-re (鏟 (가레)), or three-man shovel used for excavating.\n\n4.—Yong-du-re (龍水瓢 (용두레)), or bailing box or bucket used for bailing water in placer workings.\n\n5.—Sam-tag (草簍 (삼희이)), used for carrying dirt that has been excavated.\n\n6.—O-reng-i (어름이), used as a screen for collecting the pebbles and coarse gravel from the sluice or ditch while the gravel is being washed.\n\n7.—So-ko-ri (소고리), a smaller basket, closely woven, used for carrying the gold-bearing gravel to the panning-pool.\n\n8.—Ham-ji (함지), the wooden bowl used for panning.\n\n9.—Mot-chung (短釘 (못정)), an iron moil without and with Ta-rai-chung (타리정) a handle, only used in cutting ditches or bedrock.\n\n10.—Mang-chi (鐵椎 (망치)), a hammer of 3 to 5 pounds in weight used in conjunction with the mot-chung.\n\nThere is another large basket used almost entirely in the country south of Seoul which is used for the same purposes as the sam-tag; it is known as chil-tong (질통), but is of a different shape from the sam-tag, and is generally used with a ji-gei (지게). The sam-tag is peculiar to North Korea, while the chil-tong is characteristic of South Korea. The two baskets are often confused by foreigners, who are not aware that sam-tag literally means a basket to be carried by the hands, while chil-tong means a back-carrying basket.\n\nThe ten tools or implements mentioned above are shown clearly in Fig. 1, and, I believe, require no further explanation.\nFig. 1.—Placer Mining Tools.\n\n(To-chum yen-chang 土店機具 도연장경)\n\n1. Se-ko-ri (소꼬리).\n2. O-reng-i (어령이).\n3. Pyuk-chai (璧採 벽치).\n4. Ho-mi (锄 호미).\n5. Mot-chung (短釘 못정).\n6. Mang-chi (銬釘 망치).\n7. Ka-re 鍤 가레.\n8. Sam-tag-i (草簍 삼락이).\n9. Yong-du-re (龍水瓢 용두레).\n10. Ilam-ji (함지).\nThree methods of placer mining are in general use, and each of these depends upon the local conditions pertaining to the ground to be worked. (a). This method is used when the deposit is a shallow one in a narrow valley. Work is started by digging a trench or ditch at a short distance from and parallel to the stream. This ditch is arranged to be used as a sluice for washing the gold-bearing gravel, and the water can be easily deflected to one side when necessary to clean up the concentrated gold-bearing gravel. The deposit being a shallow one, the pay-streak, or portion rich in gold, is soon reached by excavating the worthless overburden of dirt. This kam-chul (甘土 (장출)) as it is called by the Koreans, means literally, \"sweet earth.\" Often-times it is sufficiently rich in gold to be carried direct to the panning pool. When this is not the case it is piled in a heap at the head of the sluice until a sufficient amount has been collected. It is then thrown at more or less regular intervals into the sluice where it is washed and concentrated by the flowing water. The pebbles and coarse gravel are taken out by means of the o-ren-gi which acts in the dual capacity of a screen and a shovel. The gravel is gradually worked down in this way until the gold-bearing gravel is concentrated. The stream of water is then deflected, and the concentrated gravel collected by means of the so-ko-ri and carried to the panning pool under the watchful eye of the ever-present toktai (德大 (덕대)), or \"mining boss.\" The ham-ji is used in panning to extract the gold, and the gold recovered is turned over to the tok-tai for his disposal. This (a) method is shown in Figs. 2, 3, and 4. Fig. 4 also shows the placer tools.\n\n(b). This method applies to a broad valley with a deposit varying in depth from 8 to 20 feet, where the stream is some distance from the ground to be worked. Work is generally started by digging pits, varying in size according to the number of men employed, until the pay-streak, or kam-chul, is exposed. This is then collected in heaps and conveyed to the stream, and panned there if sufficiently rich. If not, the method as outlined in (a) is employed. This method is generally an\nexpensive and wasteful one, because a great deal of gravel is left behind because of the necessity of using it for dumping ground while the pits are being excavated. Another bad feature is that, as a rule, no provision is made for a system of drains or ditches which will permit of continuous working. Thus a great deal of ground has to be handled two or more times before the pay-streak, or kam-chul, can be entirely recovered. The yong-du-re, or bailing bucket, has to be used a great deal when this method of working is employed, because of the lack of drains. Figs. 5 and 6 illustrate the ground worked by this method, and also show the yong-du-re in operation.\n\n(c). This method is one where small shafts are sunk to reach the kam-chul, or pay-streak. This is not a common method, however, and is restricted in use to a very few places. Some years ago I visited a portion of the Chik-san District where this method was in operation. After the pay-streak is dug out, it is collected and treated in the same way as outlined in (a).\n\nUnless the winter is mild, no work is done in North Korea between December and March. Heavy rains during July or August also interfere with the placer mining operations. A great deal of placer mining has been done in the past by the farmers during their leisure time, and it is true that a considerable amount of gold has been produced in this way that has never been accounted for in the gold production of the country.\n\nIt is of interest to note here that a different method of working placer deposits was at one time in operation in the Chik-san District (稷山郡), when the work was being conducted under Japanese overseers. The place of operation was at Sei-go-ri (三谷里), about 4 miles south-east of the Sei-kwan Station (成歡停車場) on the Seoul-Fusan Railway. The overburden of clay and gravel averaged 20 feet in depth, and the kam-chul, or pay-streak, was from one to three feet in thickness. Work was started by digging a pit about 60 feet square down to the pay-streak. This work was generally let by contract, and it took from 10 to 12 days to complete this\nFig. 5.—SHOWING (b) METHOD OF PLACER MINING (土店 置).\n\nFig. 6.—SHOWING YONG-DU-BE (龍水瓢 용두배) USED IN (b) METHOD FOR PLACER MINING (土店 置).\nFig. 7.—SHOWING SLUICE USED AT SEIGORI (Chiksan District).\n\nFig. 8.—SHOWING DEPTH OF OVERBURDEN AT SEIGORI (Chiksan District).\nFig. 9.—SHOWING REMOVAL OF PAY-STREAK AT SEIGORI (CHIKSAN DISTRICT).\n\nFig. 10.—SHOWING ARCHIMEDEAN SCREW PUMPS AT SEIGORI (CHIKSAN DISTRICT).\n\nFig. 11.—MANG-CHII (망치) AND TA-RAI-CHUNG (타리정).\nFig. 12.—SHOWING KOOL-TOL (轉石 굴돌) USED IN CRUSHING ORE (Unsan District).\n\nFig. 13.—KOOL-TOL (轉石 굴돌) USED IN CRUSHING ORE (Unsan District). Showing sacks of crushed ore in left foreground.\nexcavation. This meant the removal of some 2,400 cubic yards of overburden. Owing to the difficulty of controlling the inflow of water through the gravel it was not possible to use ground sluices, and a flume and a sluice were therefore constructed at ground level, and supported by poles, as shown in Fig. 7. Wooden blocks were used for riffles in the sluice. The depth of overburden is shown in Fig. 8, and the absence of large boulders is to be noted. In Fig. 9 is shown the method of removing the pay-streak (kam-chul), and how it was elevated to the feed-box at the head of the sluice. This feed-box is also shown in Fig. 7, and so are the inclined ladder-ways for the men who carried the gravel. In order to handle the water for short lifts, the Japanese utilized the principle of the Archimedean screw, as shown in Fig. 10. So far as I know this method of handling water has not been employed elsewhere in Korea. The sluice was cleaned up at regular intervals, and the gold extracted from the auriferous sands by washing and panning. The gold collected was sent to Dai Ichi Ginko, Ltd., (First National Bank), Seoul.\n\nFormer Methods of Administration.—Formerly all gold mining, both lode and alluvial, was under the control of the Imperial Household (宮內部). So far as I can learn the Government sent either a representative from Seoul, or else was represented by the Governor of the Province or the Magistrate of the District in which the placer mine or lode mine was worked. These men, in turn, appointed the subordinate officials. The various titles, or names, given to these officials, are as follow:\n\n1.—Kam-ni ...... (監理(감리)), or Superintendent.\n2.—Wi-won ...... (委員(위원)), or Chief Overseer.\\(^1\\)\n3.—Pah-won ... (派員(파원)), or Chief Overseer.\\(^2\\)\n4.—Pyul-chang (別將(별장)), or Special Overseer.\\(^3\\)\n5.—Sei-gam .... (稅監(세감)), or Tax Collector.\n\n\\(^1\\) The literal meaning of Wi-won is \"trusty man.\"\n\\(^2\\) \" \" \" \" Pah-won is \"distributing man.\"\n\\(^3\\) \" \" \" \" Pyul-chang is \"special general.\"\n6.—Chusa …… (主事 (주사)), or Clerk or Book-keeper.\n7.—Soo-bi-byung (守備兵 (수비병)), or Guards or Watchmen.\n8.—Sah-ryung … (使令 (사령)), or Servants.\n\nThe Kam-ni (監理) was appointed by the Imperial Household, but I have been unable to learn the date when this office was created. He was directly responsible to the Imperial Household (宮內部). The Wi-won (委員) was appointed by the Kam-ni, and so was the Pah-won (派員). The Sei-gam (稅監) was appointed by the Pah-won, and the Chusa (主事) received his appointment from the Kam-ni. The Soo-bi-byung (守備兵) were sent either from Seoul or by the Governor of the Province in which the placer or lode mines were operated. The Sah-ryung (使令) were servants under the direction of the Pyul-chang, and apparently were a part of his staff. In the old days, so I am told, there was no Kam-ni (監理) to superintend the mining operations, but the work was under the supervision of the Pyul-chang (別將), who was appointed by either the Governor, or the Magistrate, of the mining district. From what I have learned it would seem that the Kam-ni is an office created within the last twenty-five years.\n\nIn these old days the general method of procedure in beginning mining work was for the tok-tai (徳太), or mining \"boss,\" to apply to the Pyul-chang for permission to work a certain portion of ground. After receiving this application, the Pyul-chang would then send one or more Sei-gam to investigate the ground applied for, not with an object of determining its value, but to decide the number of workers and the amount of taxes which should be collected. In many cases the tok-tai was obliged either to purchase the land, or else to come to some agreement with the owner regarding the use of it for mining work.\n\nThe tok-tai employed a number of miners to dig the ground and to extract the gold. The laborers were known as Yok-bu (役夫 (역부)), and also as Keun-chum-gun (鑛夫 (금검군)). The placer miners were called To-chum-gun (土店軍 (토점\n\n---\n\n1 The literal meaning of Soo-bi-byung is \"ready-watching soldiers.\"\nto distinguish them from the lode miners who were called Sok-chum-gun (石唐軍 (석점군)).\n\nThe miners usually worked in groups of five or ten under the direction of a tok-tai. Sometimes he paid them a daily wage for their labors, but more often the custom was for the tok-tai to furnish food, tobacco, and straw shoes for his men, and to pay the taxes according to the number of men employed by him. The rate of taxes would vary with the richness of the ground worked. The taxes were collected twice each month, and were generally at the rate of 5 pun (分 (오푼)) for each party of five miners. If the production was very favorable this same rate would be applied to each party of two miners; if unfavorable, the rate would be changed to apply to each party of 10 miners. If the tok-tai, in addition to providing board, tobacco, and straw shoes, paid the semi-monthly tax, he was entitled to receive three-quarters of the production. The remaining one-quarter was divided among the miners. On the other hand, if the tok-tai furnished nothing, he generally got from one-third to one-half the production, and the miners paid their own taxes. There were no fixed standards for the different mining districts, therefore the rates as mentioned above would vary according to the district.\n\nCertain regulations were made regarding workings in proximity to rice-fields, certain buildings, and tombs, but these regulations were more often broken than observed. The Imperial Household made no attempt apparently to regulate the mining industry in such a way as to protect the miners, and to secure the best results, but endeavoured only to collect as much in taxes as the miners could be made to pay. Without systematic regulation of the mining areas it was a common matter for one tok-tai to apply for and frequently to secure permission to work profitable ground already held by another tok-tai. Unscrupulous officials were apt to levy unjust taxes, make false reports of taxes collected and of weights of gold taken out, and they were also known to make false returns to the Imperial Household.\n2.—Lode Mining.\n\nLode mining, or Sok-chum (石店 (석점)), has been characterized by primitive methods. Gold from lodes is known as Sok-keum (石金 (석금)), and means \"rock-gold.\" The following tools and apparatus are those in general use:\n\n1.—Mot-chung (短釘 (못정)), an iron moil, used for chip-ping and breaking stone.\n\n2.—Ta-rai-chung (타리정), same as above, but with handle for holding, while striking with hammer.\n\n3.—Mang-chi (鐵椎 (망치)), a hammer of from 3 to 5 pounds in weight used in conjunction with the mot-chung and ta-rai-chung.\n\n4.—Kool-tol (轉石 (굴돌)), or \"rocking-stone\" for crushing ore as it comes from the mine.\n\n5.—Kal-tol (磨石 (갈돌)), or \"grinding-stone\" for grinding the ore after being crushed by the \"rocking-stone.\"\n\n6.—Ham-ji (합지), used for panning the finely crushed ore from the \"grinding-stone.\"\n\n7.—Sui-ryun-ki-gei (水輪機械 (수륜기계)), or water-wheel mill for crushing and amalgamating gold-ore.\n\nThe ta-rai-chung (釘 (타리정)) is simply the mot-chung (短釘 (못정)) with the addition of a handle, and together with the mang-chi (鐵椎 (망치)) are shown in Fig. 11, as well as in Fig. 1. The Kool-tol (轉石 (굴돌)), or \"rocking-stone\" is shown in Figs. 12, 13, and 14. The kal-tol (磨石 (갈돌)), or \"grinding-stone\" is illustrated in Figs. 14 and 15. The ham-ji (합지), is shown to good advantage in Fig. 16. Two examples of sui-ryun-ki-gei (水輪機械 (수륜기계)), one of ten stamps, and the other of forty stamps, are shown in Figs. 17 and 18, respectively.\n\nIn lode mining the general method of working was to sink a series of small shafts or pits on the outcrop of the lode or vein. A good example of this kind of work is shown in Fig. 19. The ore was obtained by breaking the lode-rock with mot-chung or ta-rai-chung and hammer. When the ore became too hard for\nFig. 14.—SHOWING OPERATION OF KOOL-TOL (轉石 갈돌) AND KAL-TOL (磨石 갈돌)\n(Unsan District).\n\nFig. 15.—KAL-TOL (磨石 갈돌) USED IN GRINDING ORE (Unsan District).\nShowing ground ore in front of stones, and edge of panning pool may be seen at the left.\nFig. 16.—SHOWING THE USE OF HAM-JI (함지) IN PANNING.\n\nFig. 17.—SHOWING SUI-RYUN-KI-GEI (水輪機械 수륜기계) USED IN CRUSHING ORE.\nWater-wheel mill of ten stamps.\nFig. 18.—SHOWING TWO SUI-RYUN-KI-GEI (水輪機械 수륜기계).\nTwo water-wheel mills of twenty stamps each.\n\nFig. 19.—SHOWING METHOD OF LODE MINING (石店 석경).\nA number of workings are shown along the outcrop.\nFig. 20.—Ancient Kool-tol (轉石 廚壘) and Kal-tol (磨石 廚壘).\n(Unsan District)\n\nFig. 21.—Showing a Wall of Ancient Kool-tol (轉石 廚壘) and Kal-tol (磨石 廚壘) (Unsan District).\nthis method, a fire was built against the portion desired and the rock was thoroughly heated in this way, and then water was thrown upon the heated rock. This caused the rock to become friable, and a certain portion of it was then easily broken out. By using this laborious method it became possible to extract ore which could not be taken out in any other way. The next step was to crush the ore. This is accomplished in two ways, firstly, by kool-tol (轉石 (굴돌)) and kal-tol (磨石 (갈돌)), (\"rocking and grinding-stones\"), and secondly, by means of the water-wheel mill known as the sui-ryun-ki-gei (水輪機械 (수륜기계)). These two methods are shown in Figs. 12, 13, 14, 15, 17 and 18, respectively. Abandoned kool-tol and kal-tol (from the Unsan District) are shown in Figs. 20 and 21.\n\nThe ore as it comes from the mine is carried to the kool-tol (轉石 (굴돌)) where it is crushed to the size of chestnuts. The kool-tol is generally worked by four men, one pair on each side, who rock back and forth in unison. These stones are of good size, and weigh from 250 to 400 lbs. The crushing is continued until the ore is crushed to about 10 or 20 mesh. A rough screen, made of tin punched irregularly with small holes, is used during the crushing, and the oversize is returned to the stone again for further crushing. When the ore is finally reduced to the desired size or fineness, it is sacked and carried to the kal-tol (磨石 (갈돌)) which is generally located close to the panning pool. The ore is finally ground to the fineness desired for panning, generally 60 to 80 mesh. This finely-ground ore is then panned, as shown in Fig. 16. The Korean is an expert at panning with his wooden pan or bowl (ham-ji). It is generally of one piece of wood, from 18 to 24 inches in diameter, with a depth of about 4 inches, and the sides flare slightly. Although this method is necessarily slow and laborious, a large amount of gold has been won in this way.\n\nThe second method of crushing ore is by the use of the sui-ryun-ki-gei (水輪機械 (수륜기계)), water-wheel mill, comprising generally ten wooden stamps driven by an overshot\nwater-wheel. The water-wheels are made of wood, and are about 12 feet in diameter. Overshot wheels are the rule, the necessary water being conveyed by ditches to the wheel. There is a tradition among the Korean miners in the Un-san District (雲山郡) that the water-wheel mill was introduced from China, but I have been unable to verify this. It is well known that stamp-mills of the same general type are used near Kagoshima in Japan. Whether the wooden stamp mill was introduced from Japan to Korea, I am unable to state definitely, but I consider this is a point worthy of further investigation.\n\nThese water-wheel mills are usually built in two batteries of five stamps each, one battery on each side of the water wheels. But there are some built with two batteries of ten stamps each, or ten stamps on each side of the wheel, as shown in Fig. 18. This type can be used only where there is sufficient water to run them, as they require more power than the ordinary type.\n\nTo secure the best results the size of the ore fed to the mortars should not be larger than a chestnut. The ore is fed at regular intervals, and is crushed in the mortar by the action of the dropping of the iron-shod wooden stamps. Mercury is fed from time to time in small quantities to the mortar, where the gold freed from the ore is amalgamated. The greater the gold-content of the ore, the more often mercury is fed. It is not customary to treat the tailing, the over-flow from the mortar, and it is permitted to run to waste. As may be easily imagined the crushing capacity of these mills is extremely limited. The capacity ranges from 1000 to 2000 pounds in 24 hours, depending greatly upon the hardness of the ore. The amalgam formed by the union of the gold and mercury is collected from the mortars at regular intervals, and the gold is recovered by retorting. Wherever sufficient water is available these water-wheel mills are used in preference to the kool-tol and kal-tol.\n\nDuring the year 1910 there was a tremendous boom in lode mining in the Sak-ju District (朔州郡), and it is estimated that fully one hundred 10-stamp water wheel mills were at work.\nThe procedure in beginning work in any lode gold-district was along the same lines as described under placer mining. The rate of taxes was different in that each miner was taxed, instead of each group as in placer mining. As has been stated there were no uniform regulations enforced for the control of the gold-mining districts; consequently, what was made to apply to one district did not necessarily apply to another.\n\nHowever, in July, 1895, new and important regulations concerning mining were issued by the Government, and, in the same year, a mining concession in the district of Un-san (仁山) was granted to an American. This year marked the beginning of an important era in the development of gold mining in Korea.\n\n**Foreign Concessions and their Development.**\n\nUntil the year 1883, Korea had been closed to foreigners, although a treaty between Korea and Japan had been ratified on February 27th, 1876. The first foreign treaty was with the United States, and was ratified on May 19th, 1883. During the same year treaties were concluded with Germany and Great Britain. In 1885, permission was granted to the English firm of Jardine, Matheson & Co. to operate gold placers, but the results were unsatisfactory. In 1889 ten modern stamps were brought out from California under the direction of the Government; these were taken as far as Puk-chin (北鎭) in the Un-san District (仁山郡), but were not erected for some cause. It is of interest to note, however, that these ten stamps afterwards were incorporated in the mill at Chittabalgic (泥踏(지리발비)), the pioneer of modern mills in Korea. This mill is shown in Fig. 22.\n\nFrom 1895 to 1906 foreigners were able to engage in mining operations only through concessions granted by the Emperor or the Imperial Household, and in some instances, by certain Ministers of State. Consequently these conditions were\n\n---\n\n1 Hulbert, The History of Korea, Vol. II., Seoul, 1905, p. 284.\n2 ibid, p. 233.\n3 The Mining Journal, London, October 23, 1909, p. 121.\n4 ibid, p. 122.\nthe cause of frequent disputes and led to bribery in some cases. More or less rivalry existed among the different nationalities in securing these concessions of mining rights.\n\nAs already stated, the first concession granted under the regulations issued in 1895 was to an American, Mr. James R. Morse, who received from the Imperial Household on April 17th, 1896, the approval of the concession rights for the Un-san District granted in the previous year. This concession was later modified on March 27th, 1899, when the agreed payment of 25 per cent. of the net profits to the Government was compounded for a lump sum paid in cash, and for an annual payment thereafter of Yen 25,000 per year. Within the next few years concessions were granted to British, German, French, Russian, Japanese and Italian representatives.\n\nThus far, the American companies have been the most successful in their undertakings. At this time the three most profitable concessions are being operated by Americans; these are the Un-san (雲山), Su-an (遂安), and Chik-san (稷山) concessions, and for the year 1915 they have produced gold to the value of Yen 5,657,244 or approximately 75 per cent. of the estimated production for that year. Although these three concessions are being operated successfully by Americans it should be noted that only one, Un-san (雲山), is an American Concession.\n\nThe Su-an (遂安) concession was granted on November 4th, 1905, to a British syndicate (The Korean Syndicate, Ltd.) by the Korean government, and comprises the Su-an District (遂安郡) in Whang-hai Province (黃海道). The British syndicate, after doing a certain amount of development work, leased their mining rights to an American company on November 12th, 1907, receiving therefor a certain percentage of the yearly profits.\n\nThe Chik-san (稷山) concession was granted on August 16th, 1900, by the Imperial Household to a Japanese syndicate, the Shibusawa-Asano Mining Partnership, for mining rights in the Chik-san District (稷山郡), South Choong-chung\nProvince (忠清南道). The operations by this syndicate were not wholly successful, and their rights were taken over by an American company in 1911. This concession is being worked successfully.\n\nThe first German concession was granted in 1897, and was located at Tang-kogei (堂岘), in Kang-won Province (江原道), about 100 miles north-east of Seoul (京城). Mining operations were not successful and the concession was abandoned. In 1908, under the new Mining Regulations, promulgated in 1906, a mining area was selected in the Syen-chun District (宜川郡), North Pyeng-an Province (平安北道). A small quantity of profitable ore was developed, sufficient for a five-stamp mill, which was operated in 1910 and 1911. It was then closed down, as there was no more ore. Later on this mill was sold to the French concession, and placed in operation there.\n\nThe French concession was granted on June 7th, 1901, by the Korean government to a French citizen, M. Saltarel, to work a mining area to be located in the Chang-sung District (昌城郡), North Pyeng-an Province (平安北道). A final selection of the mining area was made in 1908, and milling operations began in 1912. It is reported that the results thus far have been satisfactory and the production for the years 1912-1914, inclusive, has been approximately Yen 1,500,000.\n\nThe Italian concession was granted by the Korean government on March 15th, 1905, to work a mining area to be selected in the Hu-chang District (厚昌郡), North Pyeng-an Province. The Italian syndicate in charge of operations made its selection of the mining area in 1909. Thus far the undertaking has not been wholly successful.\n\nThe first British concession granted was in 1899, and comprised mining rights in the Eun-san District (殷山郡), about 50 miles north-east of the city of Pyeng-yang, in South Pyeng-an Province. Milling operations were carried on during the years 1903-4 with very good results, but the ore suddenly failed, and mining operations were abandoned in 1905.\n\nThe above list of concessions constitutes the principal ones\ngranted either by the Korean government, or the Imperial Household, prior to the new mining regulations promulgated in 1906.\n\nA short account will be given of the development of the Un-san, Su-an, and Chik-san concessions to the end of the year 1915.\n\n**Un-san Concession.**—This concession is being worked by the Oriental Consolidated Mining Company, an American company, which has been highly successful in its operations in this district from the beginning. Operations were first started at Chittabalbie (泥踏 (지리발비)), and a twenty-stamp mill was placed in operation in 1897. This mill was the pioneer of the modern stamp-mills in Korea. (See Fig. 22.) Before the mine was abandoned in 1905, it had produced 152,632 tons of ore valued at Yen 3,036,952.\n\nIn 1899 a forty-stamp mill was erected at Tabowie (大巖) and in 1907 was enlarged to eighty stamps. To June 30th, 1915, this mine has produced 1,226,859 tons of ore valued at Yen 15,918,755.\n\nA twenty-stamp mill was erected at Kuk-san-dong (克城洞) in 1900. It was increased to forty stamps in 1905. This mine was closed down on January 15th, 1915, after having produced 551,892 tons of ore valued at Yen 4,788,182.\n\nIn 1902 a forty-stamp mill was placed in operation at Maibong (鷹峰). To June 30th, 1915, 412,071 tons of ore valued at Yen 5,967,274 have been produced.\n\nIn 1903 an eighty-stamp mill was erected at Taracol (橋洞). To June 30th, 1915, this mine has produced 1,173,208 tons of ore valued at Yen 13,749,526.\n\nThis mill is shown in Fig. 23, and Figs. 24 and 25 show the battery and vanner floors, respectively. There are 16 batteries of five stamps each, and 32 vanners of the Frue type. The daily capacity of this mill is about 350 tons in 24 hours.\n\nIn 1908 a ten-stamp mill was placed in operation at Candlestick (燭臺峰). From this mine 43,998 tons of ore valued at Yen 999,591 have been produced up to June 30th, 1915.\nFig. 22.—SHOWING THE 20-STAMP MILL AT CHITTABALBIE.\n(Unsan District)\nThe first modern mill built in Korea.\n\nFig. 23.—SHOWING THE 80-STAMP MILL AT TARACOL.\n(Unsan District)\nFig. 24.—SHOWING THE BATTERY FLOOR OF THE TARACOL 80-STAMP MILL.\n\nThere are sixteen batteries of five stamps each.\n\nFig. 25.—SHOWING THE VANNER FLOOR OF THE TARACOL 80-STAMP MILL.\n\nThere are 32 True Vanners.\nAs may be seen from the foregoing the growth and development of this concession has been exceedingly satisfactory. On July 1st, 1915, a total of 210 stamps were in operation at the following mines:\n\n- Tabowie. 80 stamps.\n- Taracol. 80 „\n- Maibong. 40 „\n- E. Candlestick. 10 „\n\nThe tonnage of ore crushed for the year ended December 31st, 1915, was 295,379 tons valued at Yen 3,758,135. From this ore, gold in bullion and concentrates was recovered to the value of Yen 3,228,941.\n\nThe total tonnage of ore produced from the various mines since 1897 to December 31st, 1915, has been 3,986,772 tons valued at Yen 49,568,632.\n\nThe first dividend of 5 per cent. was paid in 1903. Since that time to July 1st, 1915, the total dividends have amounted to 150 per cent., or a total of Yen 12,871,550.\n\n**Su-an Concession.** - This British concession is held by the Korean Syndicate, Limited, of London, but is being operated by The Seoul Mining Company. This concession is being developed with highly successful results. Although not as old as the Un-san concession, its tonnage and output are increasing yearly. It shows promise of eventually becoming the largest producer in Korea.\n\nThe first stamp-mill of twenty stamps was placed in operation in the latter part of 1909 at the Suan Mine. This mine developed satisfactorily, and the mill was increased to forty stamps in the autumn of 1911.\n\nDuring the past three years a larger mine than the Su-an Mine has been developed at Tul-mi-chung (榆亭), about six miles south of Hol-kol (笏洞). A reduction plant, the pioneer of its kind in Korea, was placed in operation late in September, 1915. This plant has a rated capacity of 350 tons in 24 hours, and is the first one in Korea to use Hardinge Conical Ball- and Pebble-Mills, in place of gravity stamps for crushing and\ngrinding the ore. Both plants also employ the oil-flotation process for the recovery of concentrate. It is expected that the production of gold from the Su-an concession for 1916 will approximate a total of Yen 2,500,000.\n\nThe Su-an Mill is shown in Fig. 26, and a portion of the battery-floor is shown in Fig. 27. The Tul-mi-chung Reduction Plant is shown in Fig. 28, and the Ball- and Pebble-Mills are shown in Fig. 29.\n\nFor the year ended December 31st, 1915, the Su-an concession produced 108,078 tons of ore valued at Yen 1,789,224. The gold production for the same period amounted to Yen 1,435,041.\n\nSince the date of the commencement of milling operations in 1909, to January 1st, 1916, the Su-an concession has produced 433,361 tons of ore valued at Yen 7,945,328, with a total gold production of Yen 6,566,244. The dividends for the same period have amounted to a total of Yen 2,180,087.50, or a total of 275 per cent.\n\nChik-san Concession.—This concession was operated intermittently by the concessionaires, Shibusawa-Asano Mining Partnership, on a small scale until 1906. In this year American partners were admitted, and in 1907 a small stamp-mill was placed in operation. In 1911 a reorganization took place whereby the control of the concession rights was taken over by an American company, the Chiksan Mining Company.\n\nDuring the Japanese regime considerable work was done on the placer deposits, and a small profit was made. Although no exact figures are available it is probable that the alluvial gold production during this time amounted to over Yen 300,000.\n\nFor the year ended December 31st, 1915, the production of gold from this concession was Yen 933,261. It is estimated that the Chik-san concession has produced Yen 3,199,073 in gold; and has treated 192,144 tons of ore during the period from February, 1908, to January 1st, 1916. This concession has now reached the dividend-paying stage, and is being operated successfully.\nFig. 26.—SHOWING THE SUAN MILL OF 40 STAMPS.\n\nThe first mill built on the Suan concession.\nThe first plant built in Korea to use ball—and pebble-mills instead of gravity-stamps for crushing and grinding ore.\nEarlier in this paper was mentioned the placer ground at Sei-go-ri which was worked under the supervision of the Japanese concessionaires. The present company has proved the existence of a large acreage of ground containing sufficient gold to warrant the installation of a gold-dredge. The order has been placed for this dredge, and it is expected that it will be in operation before the end of 1916. Chiksan will therefore have the distinction of starting the first gold-dredge in Korea.\n\nThe operation of this gold-dredge, in conjunction with the present mill of forty-five stamps, should result in showing a considerable increase in the gold-production for 1916, and for several succeeding years.\n\nFrom the above brief description of the Unsan, Suan, and Chiksan Concessions, it may be readily seen how important a part they have had in the development of the gold-mining industry in Korea.\n\n**Japanese Mining Enterprises.**—Encouragement has been given by the Government-General to large companies or corporations in Japan, such as Messrs. Furukawa, Asano, and Kuhara, to undertake gold-mining operations in Korea. This has resulted in the Furukawa Partnership Company being granted a number of gold mining areas in April, 1912, to the extent of some 14,842 acres, or 12,260,000 tsubo in the Koo-sung District (懸城) in North Pyeng-an Province. This location is shown on the General Map of Korea appended to this paper. Mr. S. Asano is engaged in working placer deposits in the Soon-an (順安) and Yeng-byen (寧邊) Districts; these are shown on the map just referred to.\n\nAnother venture worthy of commendation is the smeltery built at Chinnampo by the Kuhara Mining Company, of Osaka, which began operations in October, 1915. This undertaking should prove to be a very successful one, and it will assist the immediate development of the mining industry in many ways. In addition to receiving gold- and copper-ores from many small mines or prospects, it is also treating the gold-copper concentrate\nfrom the Tul-ni-chung Reduction Plant of the Su-an Mines, which amounts to several hundred tons per month.\n\n**Gold Mines Retained by the Government-General.**\n\n—Consequent upon the mineral deposit surveys made during the past few years in eleven of the thirteen provinces, the Government-General has retained for experimental exploitation purposes the gold mines in Sang-ju (尙州) District, North Kyung-sang Province (慶尙北道), in Wi-ju (義州) District North Pyeng-an Province (平安北道), and in Han-heung (咸興) District, South Ham-kyung Province (咸鏡南道).¹ This is a new undertaking for the Government to engage in gold mining, and the results will be noted with interest.\n\n**General Remarks.**—The Koreans have proved themselves to be quite expert at the various methods of mining described in this paper. They have been quick also to learn the Western methods of mining, particularly as practised in American mines. What might be termed the first training school for miners, under foreign supervision, was really at the Chittabalgic Mine, Unsan concession. As new mines were developed more Koreans found employment and gradually a small army of efficient native miners became trained.\n\nThe Korean miner, as a rule, is good-natured, and easy to manage. It has been clearly demonstrated that he can be taught to become capable and efficient, as is shown by the variety of work he has learned to do under foreign supervision. To my mind, he is the best miner in the world for the wage he receives, usually 50 sen per day, unless on contract work when it may rise as high as Yen 1.00 per day. Not only do many of them become expert hand-drillers, but they also learn very readily to operate power-drills. Many of them do work that compares favourably with that of foreign miners. The chief fault is the carelessness shown by the average miner under-ground. This carelessness is the direct cause of practically all mine accidents.\n\n¹ Annual Report on Reforms and Progress in Chosen (Korea), (1913-14) Seoul, July, 1915, p. 113.\nIn addition to the Koreans, a number of Chinese are employed at the mines operated by the foreign companies. They are used as miners, and also make good watchmen and mechanics.\n\nA considerable number of Japanese are also employed as carpenters, mechanics, clerks, etc.\n\nSome idea may be gained of the importance of gold mining in Korea when it is realised that not less than 50,000 Koreans, several thousand Chinese and Japanese, are at this time directly dependent for their livelihood upon the foreign mining companies operating in Korea.\n\nThe Japanese authorities have realised the important part played by the foreign mine concessionaires in developing the mineral resources of the country, and are apparently willing to assist foreign mining companies in every way possible.\n\nAs the mining industry expands so will Korea become richer in proportion, because the money earned by the miners will add considerably to the wealth of the country. In addition to the money paid out for wages, local supplies, etc., the purchases of machinery and other mining supplies from abroad will add appreciably to the imports of the country.\n\nMining Regulations.—In June and July, respectively, of 1906, the Korean Government, acting upon the advice of the Resident-General, Prince Ito, enacted laws concerning lode and placer mining. These laws were promulgated in September of the same year. These laws were undoubtedly a step in the right direction, as, prior to this time, mining was not under the sort of supervision or control that ensured the steady and proper development of the mineral resources of the country.\n\nThe principal features of these mining laws are, as follow:\n\n1. Mines belonging to the State are brought under the control of the Minister of Agriculture, Commerce, and In-\n\n---\n\n1 Annual Report on Reforms and Progress in Korea, (1908-9), Seoul, December, 1909, p. 144.\nindustry, to whom applications for concessions should be made by a Korean or a foreigner in accordance with the Mining Laws of Korea.\n\n2.—Mines already in operation, abandoned mines and mine-ditches of which the ownership cannot be definitely ascertained, become State property.\n\n3.—To avert the evils of monopoly, mining districts are to be of fixed extent, and to protect public interests mining is prohibited in prescribed localities; but, on the other hand, in case of necessity mining enterprises in private lands may be compulsorily expropriated.\n\n4.—Full protection is to be extended to mining concessions hitherto held insecurely, and their cancellation is to be disallowed except in cases where the law provides otherwise. The concession rights may be made the object of transfer by sale, gift, or succession, and of mortgage.\n\n5.—Taxes are to be levied on mining products and mining districts, imports hitherto diverse being made uniform, and fees are to be charged on application for concessions.\n\n6.—In case a concession is competed for, the grant is to be made according to priority of application, in order to put a stop to the evils hitherto connected with arbitrarily granting concessions as the outcome of questionable scheming and agitation.\n\n7.—The boundaries of mines belonging to the Imperial Household are to be re-defined and publicly announced.\n\n8.—Any matter relating to foreigners in executing these laws and regulations, should be referred to the Resident-General for his consent.\n\nThe taxes were fixed at the rate of one per cent. (1%) of the annual gross production, and an annual tax of 50 sen per 1,000 tsubo of land (5 acre) in the mining area.\n\nThe gold mining areas were limited to 1,000,000 tsubo (approximately 826 acres), except where it could be shown clearly that more than this area was necessary.\nIt was found that some of the laws were not satisfactory, and the following amendments were made:\n\n\"The Mining Laws were first amended by Law No. 3, issued on August 6, 1907. By it the mines belonging to the Imperial Household were transferred to the State and are to be treated in the same way as mines belonging to the State. In order to simplify the procedure of applications as far as possible, the law was again amended on March 16th, 1908, so that matters concerning foreigners, which require the consent of the Resident, have been reduced to a few important cases.\n\nFurther the Resident General, with a view to encourage investment of foreign capital in the exploitation of mines in Korea, caused the competent Korean Authorities to modify the laws and regulations, in so far as these provisions were felt to be inconvenient to foreign investors, and to devise expedients for affording facilities to the latter. The Korean Government consequently further revised, on July 7th, 1908, the Mining Law to the effect that the transfer of mining rights and their hypothecation need not receive Government sanction, and that the articles in the laws and regulations providing that mining permits can be cancelled or mining operations suspended by the Government should be limited or struck out as far as possible. Thus the stability of mining rights in Korea has been secured. As already stated under the heading of 'Customs Duties,' Law No. 21, which was issued on August 19th soon after the revision of the Mining Law, exempts from duty machinery, instruments, and other necessary articles imported for mining purposes, and remits the export duty on copper and concentrate of gold, silver and copper (gold and silver bullion or coin being already free of duty).\n\nThe Forestry Law of Korea further affords all possible convenience and facilities for mining operations. In accordance with the Regulations for the Disposal of State Forests and\n\n---\n\n1 Annual Report on Reforms and Progress in Korea, (1908-9), Seoul, December, 1909, p. 144.\ntheir Products, State forests may be rented or sold to mine operators by a free contract, or the products of such forests may be sold to them.\"\n\nThese mining laws, as promulgated in 1906, have been recently revised, and are to be promulgated within a short time. The principal and most important change is that henceforth all mining rights will be denied to foreigners, as set forth in Art. VI. of the Chosen Mining Ordinance which states that \"None can enjoy mining rights other than subjects of the Empire or juridical persons organized in accordance with the laws and ordinances of the Empire.\" The only way in which foreigners will be able to acquire such rights in the future will be to organize themselves as partners of a legal person organized in accordance with the Japanese law. The amount of royalty to be levied remains as before, namely,—one per cent. (1%) of the gross output yearly, but the ground tax has been increased from 50 to 60 sen per 1000 tsubo of mining area.\n\nForeigners who already possess mining rights will not be affected by this revision, as they will be permitted to use and retain their rights for any length of time in the future.\n\nThe laws, as a whole, have been extremely liberal, and compare very favorably with the mining laws of other mining countries. As already noted (p. 33), important revisions of the Mining Laws were made in 1908 with a view of further encouraging foreign capital to invest in mining enterprises in Korea. It is therefore evident that the authorities have realized the extent of the important work done by foreigners in developing the mining industry in this country. Although the new Mining Ordinance, about to be promulgated, may contain some unsatisfactory conditions, it is not at all improbable that further revisions may be made eventually to the satisfaction of all concerned.\n\nThe Government-General, in 1911, commenced a survey of the mineral deposits in Korea with the object of\n\n---\n\n1 Annual Report on Reforms and Progress in Korea, (1908-9), Seoul, December, 1909, p. 145.\n2 The Seoul Press, Seoul, January 9th, 1916, p. 2.\nfurnishing reliable information to those interested in mining. In three years ending December, 1913, the survey of the five following provinces was completed:—North and South Hamkyung, North and South Pyeng-an, and Whang-hai. In addition to these just mentioned, portions of the following six provinces were surveyed:—Kyong-ki, North and South Kyung-sang, North and South Choong-chung, and Kang-won.\\(^1\\) This work has been under the direction of the Mining Section of the Department of Agriculture, Commerce, and Industry, and the reports issued thus far give evidence of careful and earnest work. They are printed in both Japanese and English. The Mining Section is fortunate in having competent and courteous officials who are doing good work in gathering information and collecting data regarding the mineral resources of the country.\n\n**Tables of Gold Production and Export.**—The first table shows the Bullion and Gold Ore exported from Korea, 1884-1915, inclusive. The second table shows the Gold Production of Korea for the years 1908-1914, inclusive, and is made up from the returns made to the Government-General by the various operators engaged in gold mining. The third table shows in detail the gold produced by each province for the year 1914, and is interesting in that it shows returns from all of the thirteen provinces.\n\n\\(^1\\) Annual Report on Reforms and Progress in Chosen (Korea), (1913-14) Seoul, July 1915, p. 113.\n## BULLION AND GOLD ORE EXPORTED FROM KOREA.\n\n### 1884-1915, incl.\n\n| Year | Bullion | Gold Ore | Total |\n|------|---------|----------|-------|\n| 1884 | ¥312,022 | — | ¥312,022 |\n| 1885 | ¥141,594 | — | ¥141,594 |\n| 1886 | ¥1,130,488 | — | ¥1,130,488 |\n| 1887 | ¥1,388,269 | — | ¥1,388,269 |\n| 1888 | ¥1,373,965 | — | ¥1,373,965 |\n| 1889 | ¥982,091 | — | ¥982,091 |\n| 1890 | ¥749,699 | — | ¥749,699 |\n| 1891 | ¥689,078 | — | ¥689,078 |\n| 1892 | ¥851,751 | — | ¥851,751 |\n| 1893 | ¥918,659 | — | ¥918,659 |\n| 1894 | ¥934,975 | — | ¥934,975 |\n| 1895 | ¥1,352,929 | — | ¥1,352,929 |\n| 1896 | ¥1,390,412 | — | ¥1,390,412 |\n| 1897 | ¥2,034,079 | — | ¥2,034,079 |\n| 1898 | ¥2,375,725 | — | ¥2,375,725 |\n| 1899 | ¥2,933,382 | — | ¥2,933,382 |\n| 1900 | ¥3,633,050 | — | ¥3,633,050 |\n| 1901 | ¥4,993,351 | ¥70,584 | ¥5,063,935 |\n| 1902 | ¥5,064,106 | ¥52,988 | ¥5,117,094 |\n| 1903 | ¥5,456,397 | ¥139,671 | ¥5,596,068 |\n| 1904 | ¥5,009,596 | ¥98,340 | ¥5,107,936 |\n| 1905 | ¥5,206,805 | ¥449,303 | ¥5,656,108 |\n| 1906 | ¥4,666,130 | ¥136,587 | ¥4,802,717 |\n| 1907 | ¥4,617,950 | ¥21,006 | ¥4,638,956 |\n| 1908 | ¥4,770,491 | ¥44,674 | ¥4,815,165 |\n| 1909 | ¥6,112,410 | ¥73,123 | ¥6,185,542 |\n| 1910 | ¥8,833,609 | ¥517,431 | ¥9,351,040 |\n| 1911 | ¥9,099,796 | ¥234,891 | ¥9,334,687 |\n| 1912 | ¥9,416,235 | ¥274,938 | ¥9,691,173 |\n| 1913 | ¥9,661,514 | ¥392,400 | ¥10,053,914 |\n| 1914 | ¥9,664,267 | ¥569,713 | ¥10,233,980 |\n| 1915 | ¥11,366,587 | ¥929,619 | ¥12,296,206 |\n| Year | Gold | Gold Ore | Placer Gold | Total Value |\n|------|------|----------|-------------|-------------|\n|      | Momme | Value    | Momme       | Value       | Value       |\n| 1908 | 499,887 | ¥2,499,171 | 1,210,640 | ¥71,010 | 61,715 | ¥243,570 | ¥2,813,751 |\n| 1909 | 636,216 | ¥3,109,773 | 836,779 | ¥166,164 | 132,545 | ¥526,969 | ¥3,802,906 |\n| 1910 | 795,990 | ¥3,744,957 | 2,653,254 | ¥209,920 | 204,922 | ¥821,609 | ¥4,776,486 |\n| 1911 | 959,727 | ¥4,433,838 | 347,500 | ¥12,499 | 146,184 | ¥591,618 | ¥5,037,955 |\n| 1912 | 986,221 | ¥4,644,983 | 1,601,124 | ¥187,233 | 167,158 | ¥670,693 | ¥5,502,907 |\n| 1913 | 1,200,674 | ¥5,692,321 | 1,372,396 | ¥70,223 | 233,176 | ¥970,205 | ¥6,732,749 |\n| 1914 | 1,288,991 | ¥6,064,318 | 1,382,520 | ¥110,016 | 1,42,570 | ¥575,350 | ¥6,749,684 |\n## GOLD PRODUCTION OF KOREA BY PROVINCES FOR THE YEAR 1914.\n\n| Province                  | Gold Momme | Value   | Gold Ore Kwamme | Value   | Placer Gold Momme | Value   | Total Value |\n|---------------------------|------------|---------|-----------------|---------|-------------------|---------|-------------|\n| Kyong-ki                  | 2,981      | ¥10,597 | 12,454          | ¥343    |                   |         | ¥10,940     |\n| North Choong-chung        | 35,391     | ¥120,174| 13,905          | ¥16,998 | 1,160             | ¥6,273  | ¥143,445    |\n| South                     | 107,978    | ¥529,084|                |         | 44,889            | ¥170,580| ¥699,664    |\n| North Chul-la             |            |         | 6,480           | ¥2,595  | 4,930             | ¥19,670 | ¥22,265     |\n| South                     |            |         |                 |         | 2,685             | ¥10,695 | ¥10,695     |\n| North Kyung-sang          | 3,393      | ¥13,756 | 300             | ¥140    | 4,951             | ¥19,754 | ¥33,650     |\n| South                     | 270        | ¥1,020  |                 |         |                   |         | ¥1,020      |\n| Whang-hai                 | 253,218    | ¥1,046,759| 207,601       | ¥32,532 | 850               | ¥3,400  | ¥1,082,691  |\n| South Pyeng-an            | 17,840     | ¥72,289 |                 |         | 72,512            | ¥300,681| ¥372,970    |\n| North                     | 869,688    | ¥4,261,119| 1,126,120     | ¥56,248 | 33                | ¥132    | ¥4,317,499  |\n| Kang-won                  | 1,264      | ¥3,910  |                 |         | 191               | ¥799    | ¥4,709      |\n| South Ham-kyung           | 1,968      | ¥5,610  | 15,660          | ¥1,160  | 9,528             | ¥42,002 | ¥48,772     |\n| North                     |            |         |                 |         | 341               | ¥1,364  | ¥1,364      |\n\nTotal: ¥1,288,991 ¥6,064,318 ¥1,382,520 ¥110,016 ¥142,570 ¥575,350 ¥6,749,684\nThe difference shown in the above tables between annual exportation and annual production is due to the fact that a large part of the gold produced is not reported to the Mining Section of the Government, but is shown in the customs reports.\n\nFrom the foregoing tables, and from the description of the concessions operated by the foreign companies it is quite evident that North Korea produces a much greater amount than South Korea, and it is apparent also that the mines operated by foreigners are producing a large percentage of the entire output of the country. The tables show also that the gold production is steadily increasing year by year.\n\nThe outlook for a continued increase in the production of gold from Korea is promising, and I venture to predict that the greatest increase will be shown from the successful development of large low-grade gold-bearing deposits.\n\nNote.—Throughout this paper all calculations have been made by taking Yen 1.00 as being equivalent to $0.50.\n\n1 Kwamme equals 8.267 lbs. (Avoir.)\n1 ,, ,, 10.047 ,, (Troy.)\n1 Momnie ,, 2.411 dwt. (Troy.) or 3.75 grams.\n1 Tsubo ,, 3.953 square yards.\nMINUTES OF THE ANNUAL MEETING OF THE KOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHeld in the Seoul Union, Feb. 1st, 1916.\n\nDr. Gale presided, while Prof. Starr gave a lecture on \"Korean Coin Charms\" and followed it with some remarks on the similarity between Korean and early American art.\n\nThe Society held its Annual Meeting immediately after.\n\nDr. Gale resigned as President, and with much regret, the Society accepted the resignation. Elections were held as follows:\n\nPresident, Mr. Lay; Vice-President, Dr. Mills; Corresponding Secretary, Dr. Gale; Librarian, Mr. Beck; Recording Secretary, Mr. Koons; Treasurer, Mr. Bunker. Councillors, Dr. Hishida, Mr. R. S. Miller and Bishop Trollope.\n\nThe Treasurer's report showed deposits and cash amounting to ¥950.15.\n\nThe Council met immediately after adjournment, all members being present but Mr. Bunker.\n\nThe following names were proposed for membership: Miss Van Wagoner, Dr. Schieffley, Mr. Lucas.\n\nA motion prevailed that, in future, all writers of papers shall be entitled to reprints, gratis, up to twenty copies.\n\nMr. E. W. Mills was also given permission to make reprints of his own article on Mining, to the number of forty.\n\nDr. Mills presented plans for works on \"Acupuncture and Cautery\" and a \"Native Pharmacopoeia,\" each to be of about 300 pages. It was decided that while the original idea of the Society had not been the publication of such works, a committee be appointed to look into the matter of printing. Secretary and Librarian were appointed as this committee. Adjourned.\n\nE. W. Koons,\nRecording Secretary.\nOFFICERS FOR 1915.\n\nPresident.\nArthur Hyde-Lay, C.M.G.\n\nVice-President.\nRalph G. Mills, M.D.\n\nCorresponding Secretary.\nJ. S. Gale, D.D.\n\nRecording Secretary.\nE. W. Koons.\n\nTreasurer.\nD. A. Bunker.\n\nLibrarian.\nS. A. Beck.\n\nCouncillors.\n\nHon. R. S. Miller (American Consul-General).\nDr. S. Hishida (Imperial Government service).\nRt. Rev. Bishop M. N. Trollope (Church of England).\nLIST OF MEMBERS,\nKOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHONORARY MEMBERS.\n\nAllen, Hon. H. N., M.D., LL.D. ... Toledo, Ohio, U.S.A.\nBrown MacLeavy J., C.M.G. ... ... London.\nGubbins, J. H., C.M.G. ... ... c/o Foreign Office, London.\nHulbert, H. B., F.R.G.S. ... ... Springfield, Mass., U.S.A.\nJones, G. H., D.D. ... ... ... 150 Fifth Ave., New York City.\nJordan, Sir John, K.C.M.G. ... ... Peking, China.\n\nORDINARY MEMBERS.\n\nAlbertson, Miss M. H. ... ... ... Seoul.\nAsakawa, Prof. K. ... ... ... New Haven, Conn., U.S.A.\nAsami, R. ... ... ... Judge of Supreme Court, Seoul.\nAvison, O. R., M.D. ... ... ... Seoul.\nBadcock, Rev. J. S. ... ... ... Seoul.\nBaird, Rev. W. M., Ph.D. ... ... Pyeng Yang.\nBeck, Rev. S. A. ... ... ... Seoul.\nBell, Rev. Eugene ... ... ... Kwangju.\nBennett, W. G. ... ... ... Chemulpo.\nBolljahn, J. ... ... ... Seoul.\nBonwick, Gerald ... ... ... Seoul.\nBowman, N. H., M.D. ... ... ... Beeville, Texas.\nBrockman, F. N. ... ... ... Seoul.\nBridle, Rev. G. A. ... ... ... Suwon.\nBrinckmeier, R. ... ... ... Chemulpo.\nBunker, Rev. D. A. ... ... ... Seoul.\nBunker, Mrs. D. A. ... ... ... Seoul.\nBurdick, Rev. G. M. ... ... ... Seoul.\nCable, E. M. ... ... ... Seoul.\nCameron, Miss Christine ... ... ... Seoul.\nCollyer, Rev. C. T. ... ... ... Wonsan.\nCram, Rev. W. G. ... ... ... Songdo.\nCrispin, J. F. ... ... ... London, England.\nCunningham, Rev. W. B. ... ... Chinju.\nCurtis, R. S. ... ... ... Seoul.\nCutler, Miss M. M., M.D. ... ... ... Seoul.\nCynn, Prof. Hugh H. ... ... ... Seoul.\nElliot, Sir Charles ... ... ... University of Hongkong.\nErdman, Rev. Walter C. ... ... Taiku.\nFrampton, G. R. ... ... ... Seoul.\nFrey, Miss ... ... ... Seoul.\nGale, Rev. J. S., D.D. ... ... Seoul.\nGenso, J. F. ... ... ... Seoul.\nGillett, P. L. ... ... ... Nanking, China.\nGordon, Hon. Mrs. E. A. ... ... Tokyo.\nCray, Mrs. William ... ... ... London, England.\nGreenfield, Rev. W. M. ... ... Taiku.\nGregg, G. A. ... ... ... Seoul.\nGriffin, J. T. ... ... ... Yokohama, Japan.\nGrove, Rev. P. L. ... ... ... Haiju.\nHall, Mrs. R. S., M.D. ... ... Pyeongyang.\nHall, Rev. E. F. ... ... Berkeley, Cal., U.S.A.\nHarris, Bishop M. C., L.L.D. ... ... Seoul. [City.\nHaven, Rev. W. I., D.D. ... ... Bible House, Astor Place, New York\nHirst, J. W., M.D. ... ... Seoul.\nHodges, Rev. C. H. N. ... ... Kang Wha.\nHoffman, Rev. C. S. ... ... Kangkai.\nHoldcroft, Rev. J. G. ... ... Pyeongyang.\nHooker, J. T. ... ... Spartanburg, South Carolina, U.S.A.\nIrvin, C. H., M.D. ... ... Fusan.\nJoly, Mrs. ... ... ... Seoul.\nJoly, Percy B. ... ... Shanghai.\nKanazawa, Dr. S. ... ... Imperial University, Tokyo, Japan.\nKavanaugh, J. ... ... Shanghai.\nKoons, Rev. E. W. ... ... Seoul.\nKruger, F. D., Ph.D. ... ... Berlin.\nLay, Arthur Hyde, C.M.G. ... ... British Consul General, Seoul.\nLeadingham, R. S., M.D. ... ... Mopko.\nLudlow, A. I., M.D. ... ... Seoul.\nLyall, Rev. D. M. ... ... Chinju.\nMacrae, Rev. F. J. L. ... ... Masanpo.\nMcEachern, Rev. John ... ... Kunsan.\nMcGary, E. ... ... ... Seoul.\nMiller, Hugh ... ... ... Seoul.\nMiller, Hon. R. S. ... ... ... Seoul.\nMills, E. W. ... ... ... Tul Mi Chang Mine, Suan.\nMills, R. G., M.D. ... ... ... Seoul.\nMin Yung-chan ... ... ... Seoul.\nMoffett, Rev. S. A., D.D. ... ... Pyeongyang.\nMoore, Rev J. Z. ... ... ... Pyengyang.\nMoose, Rev. J. R. ... ... ... Seoul.\nMorgan, Hon. E. V. ... ... ... c/o Department of State, Washington.\nMorris, Rev. C. D. ... ... ... Pyengyang.\nMorris, J. II. ... ... ... Seoul.\nNiwa, S. ... ... ... Y.M.C.A., Seoul.\nNoble, Rev. W. A., D.D. ... ... Seoul.\nNorton, A. H., M.D. ... ... ... Ilaiju.\nPieters, Rev. A. A. ... ... ... Chairyung.\nPye, Miss Olive F. ... ... ... Seoul.\nReiner, Prof. R. O. ... ... ... Pyengyang.\nRhce, S. M., Ph.D. ... ... ... Honolulu.\nRhodes, Rev. H. S. ... ... ... Kangkai.\nRichard, Rev. Timothy, D.D. ... Shanghai.\nRobbins, Miss H. P. ... ... ... Pyengyang.\nRufus, Rev. W. Carl, Ph.D. ... ... Seoul. [Japan.\nScidmore, Hon. G. II. ... ... ... American Consul-General, Yokohama,\nScranton, W.B., M.D. ... ... ... Dairen.\nSharp, Rev. C. E. ... ... ... Pyengyang. [School, Hiroshima, Japan.\nShidehara, Dr. ... ... ... President Hiroshima Higher Normal\nShiraton, Dr. K. ... ... ... Imperial University, Tokyo.\nSmith, Rev. F. II. ... ... ... Seoul.\nSmith, R. K., M.D. ... ... ... Andong.\nSmith, Rev. W. E. ... ... ... Pyengyang.\nSnyder, L. II. ... ... ... Seoul.\nStarr, Prof. Frederich, Ph.D. ... ... University of Chicago.\nStillman, E. G., M.D. ... ... ... 830 Park Place, New York City.\nSwearer, Rev. W. C. ... ... ... Kongju.\nTate, Rev. L. B. ... ... ... Chunju.\nTaylor, A. W. ... ... ... Seoul.\nTaylor, W. W. ... ... ... Seoul.\nTownsend, W. D. ... ... ... Chemulpo.\nTrollope, Rt. Rev. Bishop M. N. ... Seoul.\nUnderwood, Rev. H. G., D.D., LL D. ... Seoul.\nUnderwood, H. II. ... ... ... Seoul.\nVan Buskirk, J.D., M.D. ... ... ... Seoul. [Chemulpo.\nWada, Dr. ... ... ... Director, Meteorological Observatory,\nWambold, Miss K. C. ... ... ... Seoul.\nWelbon, Rev. A. G. ... ... ... Andong.\nWeller, O. A. ... ... ... Seoul.\nWhittemore, Rev. N. C. ... ... ... Sensen.\nWilliams, Prof. F. N. ... ... ... New Haven, Conn., U.S.A.\nYamagata, Mr. Isoh ... ... ... Editor \"Seoul Press.\"\nYun, Mr. T. II. ... ... ... Central Y.M.C.A., Seoul.\nCATALOGUE.\n\n\"TRANSACTIONS OF THE KOREA BRANCH OF THE ROYAL ASIATIC SOCIETY.\"\n\nVOLUME VI. PART I. 1915.\nPrice Yen 2.50\n\nContents:\nThe History of Korean Medicine.\nAfforestation in Korea.\nMinutes of Annual Meeting.\nReport of the Council.\n\nAppendix:\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VI. PART II. 1915.\nPrice Yen 2.50\n\nContents:\nThe Pagoda of Seoul.\nHunting and Hunter's Lore in Korea.\n\nAppendix:\nOfficers.\nList of Members.\nCatalogue of Publications.\n\nVOLUME VII. PART I. 1916.\nPrice Yen 2.50\n\nContents:\nGold Mining in Korea.\n\nAppendix:\nOfficers.\nList of Members.\nCatalogue of Publications.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko71roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 76, "total-input-tokens": 110198, "total-output-tokens": 24084, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 425, 5], [425, 425, 6], [425, 463, 7], [463, 463, 8], [463, 2032, 9], [2032, 4060, 10], [4060, 5858, 11], [5858, 7814, 12], [7814, 9714, 13], [9714, 11701, 14], [11701, 13648, 15], [13648, 15671, 16], [15671, 17264, 17], [17264, 18971, 18], [18971, 19233, 19], [19233, 19233, 20], [19233, 19233, 21], [19233, 19233, 22], [19233, 21432, 23], [21432, 23528, 24], [23528, 23663, 25], [23663, 23790, 26], [23790, 23981, 27], [23981, 24169, 28], [24169, 26172, 29], [26172, 28188, 30], [28188, 30266, 31], [30266, 32002, 32], [32002, 32241, 33], [32241, 32393, 34], [32393, 32587, 35], [32587, 32750, 36], [32750, 34844, 37], [34844, 36981, 38], [36981, 38996, 39], [38996, 41000, 40], [41000, 43032, 41], [43032, 44913, 42], [44913, 45085, 43], [45085, 45293, 44], [45293, 47102, 45], [47102, 49054, 46], [49054, 49145, 47], [49145, 49145, 48], [49145, 49262, 49], [49262, 49262, 50], [49262, 51258, 51], [51258, 53270, 52], [53270, 55150, 53], [55150, 56988, 54], [56988, 59028, 55], [59028, 61127, 56], [61127, 62567, 57], [62567, 64030, 58], [64030, 64830, 59], [64830, 66844, 60], [66844, 67972, 61], [67972, 69546, 62], [69546, 69925, 63], [69925, 71342, 64], [71342, 73129, 65], [73129, 75121, 66], [75121, 75736, 67], [75736, 75736, 68], [75736, 75736, 69], [75736, 75736, 70], [75736, 75736, 71], [75736, 75736, 72], [75736, 75736, 73], [75736, 75736, 74], [75736, 75736, 75], [75736, 75736, 76]], "primary_language": ["None", "en", "None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "ja", "None", "en", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, true, false, true, false, false, false, false, false, true, true, false, true, false, false, false, false, false, false, false, true, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false]}}]