[{"id": "8560267aeb9fa4a210ddd29f1be925aed3d8cfa6", "text": "TRANSACTIONS\n\nOF THE\n\nKOREA BRANCH\n\nOF THE\n\nROYAL ASIATIC SOCIETY\n\n鮮朝\n\nVOL. VI.—Part II.\n\nSupplied gratis to all Members of the Society.\n\nPrice to Non-Members, Yen 2.50.\n\nON SALE AT\n\nSeoul, Korea: The Korean Religious Tract Society.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trubner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1915.\nCONTENTS.\n\nThe Pagoda of Seoul ... ... ... ... ... ... ... 1\n\nHunting and Hunters' Lore in Korea ... ... ... ... 23\n\nAppendix:\n\nOfficers ... ... ... ... ... ... ... ... ... 45\n\nList of Members ... ... ... ... ... ... ... ... 46\n\nCatalogue of Publications ... ... ... ... ... ... 48\nTHE PAGODA OF SEOUL.\n\nBy J. S. GALE.\n\nIn calling your attention to the Pagoda that stands in the Public Gardens of Seoul, I will quote first from Dr. Sekino, Assistant Professor of Architecture in Tokyo University. He says, \"The pagoda stood originally within the enclosure of Wun-gak Temple. It is precisely the same in shape as the pagoda that stood on Poo-so Mountain in front of Kyung-ch'un Temple, Poo'ng-tuk County, which dates from the close of the Koryu Dynasty. Its design may be said to be the most perfect attainment of the beautiful. Not a defect is there to be found in it. As we examine the details more carefully, we find that the originality displayed is very great, and that the execution of the work has been done with the highest degree of skill. It is a monument of the past well worth the seeing. This pagoda may be said to be by far the most wonderful monument in Korea. Scarcely anything in China itself can be said to compare with it. The date of its erection and its age make no difference to the value and excellence of it.\"\n\nComing as this statement does from an authority, it gives a fair idea of the place the Pagoda holds among the monumental remains of East Asia. It has very often been examined and commented upon in the past by travellers, but its origin and date have remained a question of doubt till the present.\n\nWhile it stands now in the midst of the beautiful gardens that surround it, it has passed through many vicissitudes in the way of site since; the days of the Wun-gak Temple. In the winter of 1883 and 1884 Mr. Percival Lowell, the American astronomer, visited Seoul as the guest of His Majesty the King, and made many notes of things he saw in the Capital. What he says concerning the pagoda is of interest:\nThroughout the Far East wood is the common article employed in building temples. Though occasionally stone or some other more durable substance is used, temples or pagodas so constructed, in whole or in part, are rare.\n\nIt is to one of these rare exceptional occasions—in this instance to the stone of which it is made—that is due the preservation of the only pagoda still extant in Seoul. This structure is not a true pagoda. It is a pagoda only in form; and now it is but a neglected ornament on a certain man's backyard. But it deserves to be mentioned for its beauty as well as for its lonely survivorship. It hardly rises above its present lowly position, for it is not above twenty-five feet high. So little does it overtop the roofs of even the low Korean houses that surround it, that it baffles by a singular delusiveness one who attempts to reach it. It lies almost in the heart of the city, not far from one of the main thoroughfares; and it is while walking down this thoroughfare that one catches a glimpse of it. The distant glimpse never becomes a nearer view. From afar it is a conspicuous object, and on a closer approach it vanishes. It reappears only when it has been once more left a long distance behind; while from any other point of view than this street, it is hardly visible at all. Piqued into curiosity, I determined to ferret it out and see what it was, even at the risk of dispelling the charm.\n\nThe approach, as I expected it would be, led me up several narrow cross streets, and eventually landed me before an ill-kept little garden in the midst of which rose the deserted solitary pagoda. As I could get no good view of it, such as I wanted, from the alley-way where I stood, I was obliged to ask permission to break one of the most sacred Korean rites—no less heinous an offence than the climbing to a neighbouring ridge pole. The act was not reprehensible on the score of trespass,—my asking permission precluded that,—but the climbing to any, even one's own roof, is, in Korean eyes, a grave affair, for it is a question of statute. It is forbidden by law to go upon one's own housetop without giving one's neighbours forma\nnotification of one's intention to do so. The object of the law is to prevent any women's being accidentally seen by one of the other sex. The women's suite of houses are in the rear of the compound, and their occupants might be easily overlooked when in the enjoyment of their gardens from such a vantage ground.\n\n\"The pagoda is well worthy the toil involved in getting a view of it. Although it is eight stories in height, it is composed, the whole of it, of two pieces of stone. Not, properly speaking, a real pagoda, it is an ornamental structure in the form of one. The stories are carved to represent an actual building, while what should have been their sides is exquisitely chiselled in bas-reliefs of celebrated personages. The white granite has become slightly discoloured with age, but enough of its former purity remains to bring it into effective contrast with the sombre gray of the houses.\n\n\"The idea of the pagoda in Indian; and the Chinese, when they adopted, together with the Buddhist religion, this which had come to be one of its expressions, took the idea without directly copying the form. When the Koreans, in their turn, came to borrow, they took both idea and form from the Chinese, their predecessors in the line of possession.\n\n\"What I mean by the idea as distinguished from the form, will appear by looking at the structure itself. The most cursory examination will show the pagoda to be unlike other tall and slender structures in one peculiar and fundamental respect. It is not a unit but a conglomerate. Instead of being a perfect whole it suggests a series of buildings, of the ordinary Chinese type, placed one above another skywards. The suggestion is no accident but the result of design. Each of these stories, whose number varies in different specimens, typifies a Buddhist heaven. They represent the successive stages through which the soul, in its advance toward purification, must inevitably pass. This is the idea embodied in the pagoda. This much then the Chinese adopted; but in the expression of the stories they followed their own models, just as they did in the temples which they erected in honour of the same religion. This intent—that of repeti-\ntion—counts undoubtedly for something, in the quaintness with which the pagoda impresses the Western eye.\"\n\nThis quotation will give an idea of how forgotten and neglected the Pagoda has remained although one of the most interesting monuments of Asia. It is associated with Buddhism and has had to share the contempt and the neglect that Buddhism has fallen heir to.\n\nHowever the questions before us remain none the less interesting: What is its date? Whence came the model? What great motive lay back of it to bring it into being?\n\nBearing somewhat upon its date and place of origin, tradition says that it came from China during the time of the great dynasty of Genghis and Kublai Khan, which lasted from 1260 to 1341 A.D. It is said to be a present that accompanied a Princess of the Mongols who was sent to be the bride of the Korean King. That the Mongols had much to do with Koryu, and that on more than one occasion a Mongol Princess came to share the throne and help rule the land, are unquestioned. The statement that the Pagoda came with one of them seems, however, impossible to substantiate from any historical record. No mention of it is made in the Koryu Sa, 高麗史 a history written by Cheung In-ji 鄭麟趾 who lived from 1396 to 1478 A.D. One could easily imagine that he would have mentioned it.\n\nHowever I am anticipating; let me go back and give you some of the statements of the tradition.\n\nDr. Allen in his book Fact and Fancy says on page 146, \"A marble pagoda representing the life and teachings of the Buddha was sent from Nan-king to the present site of Seoul where it still stands.\" He adds in brackets \"sent by the Chinese father of the Korean Queen.\" Here Dr. Allen correctly records the tradition. His mention of Nan-king, however, may be a slip as the Mongols never made the southern Capital the centre of their rule.\n\nMr Hulbert has written many times about the pagoda. His impression, too, was that it was sent from China by the Mongols. He gives as his chief authority the writings of\nKeum-neung 金陵 or Nam Kong-ch'ul 南公軒 who lived from 1760 to 1840 A.D., a comparatively recent writer. He is removed by many hundreds of years from the date of the Pagoda as he himself understands it, and so his statement needs to be examined with all the greater care. He does not pretend to be at all sure of his ground in what he says, but would rather seem to be giving a guess at its mystery. He says:\n\n\"On entering Seoul by the South Gate and passing toward the north in less than ten li you come to the site of an old Buddhist Temple which had a Bu-do or Pagoda before it. It is now some four hundred years since the temple fell to ruins but the pagoda still stands.\n\n\"In a history of Koryu it says\" (but where I cannot find) \"that in the 11th year of Soon-je, 順帝 of the Mongols (1343 A.D.) the daughter of King Choong-soon of Koryu, who was called Princess Keum-dong, married the Emperor of the Mongols. The Emperor delighted himself so greatly in her, that he raised a large subscription on her behalf to be presented to the Buddha. He called workmen and made two pagodas, which he put on board ship and brought by way of Yo-dong. One was placed in P'oong-tuk by the Kyung-ch'un Temple, and one in Han-yang before the Temple of Wun-gak. The Minister of the Mongols T'al-t'al took charge of the work.\n\n\"The pagoda has 24 shrines in which are pictures of the Budhisat, Kwan-se-eum 觀世音. They are taken from the pictures of O-To-ja, 吳道者, the famous artist of the Tangs. Tradition says that originally by the Pagoda stood a stone on which was written an account of it, but time has worn away all traces of the record.\" (It is this inscription that I have recovered and wish to present to you today.) \"We do not know the names of those who had a part in the writing. People are doubtful of the whole story.\n\n\"Buddhism came originally from India and in the days of Han Myung-je, 漢明帝, it first entered China (58-76 A.D.), and continued till the time of the Mongols when it was specially honoured. Great temples and halls were erected, and this re-\"\nligion increased and grew. Thus its influence was specially felt in Korea in the times of the Mongols, for she then became a vassal state and offered her tribute every year. Because of this she learned the habits and customs of the Mongol Empire. Thus the days of success for Buddhism began with the days of Koryu.\n\n\"I have been amazed to find mention of pagodas in the History of Koryu, and looked to see if I could find any trace of it in the history of the Mongols, but find nothing. I wonder if they overlooked it. Perhaps Koryu made her own pagoda and did not get it from the Mongols at all. It may have been added by those writers who desired to make a wonderful story of it.\n\n\"The Mongols were originally barbarians and so one need not be surprised at their worship of the Buddha, but our country which lies here beyond the sea, has, for 500 years and more, worn the cap and belt of the Confucian scholar, and yet it came to be so ardent a follower of the Buddha, just as the Mongols themselves were. It is indeed a distasteful fact.\n\n\"Now Soon-je of the Mongols was born of barbarian stock, and so one naturally thinks of him as a man with no religion, but T'al-t'al was a renowned Minister of State, whom people of the world liken to Che-kal-yang 諸葛亮. One so greatly honoured as he could not surely have been a promoter of so contemptible a thing as Buddhism. I wonder if it was because Koryu loved Buddhism that this pagoda was erected? This too, is a question and a doubt. Koryu was a very wicked state. Between king and courtier, as between father and sons, such acts were committed as the Book of Poetry calls 'the doings of the lost.'\n\n\"If we look carefully into the origin of this we find it all due to the presence of Buddhism. Since ancient times those who have followed the Buddha have prayed for blessing but have failed to get it. Instead of blessing they have found disaster and destruction; and yet they did not know how to repent. Thus it was.\n\n\"I have noted down herewith what has transpired in the past, in order that future generations may read and understand.\"\n\nMr Hulbert who bases his conclusions largely on what\nNam Kong-ch'ul says, gives his views in *The Passing of Korea* and the *Korea Review* of December 1901.\n\nIt had long seemed to me likely that the inscription on the Wun-gak Temple stone, that stands on the turtle's back, not far from the Pagoda, would answer the question of its origin, but even Nam Kong-ch'ul who was born in 1760 says the inscription was lost to sight in his day. Looking the stone over, many characters are visible, but it is quite impossible to make out the sense. The *Yu-ji Seung-nam*, or Geographical Encyclopaedia, says that it was written by Kim Soo-on, 金守温 one of the noted scholars of Korea, who graduated in 1441 and was in his day Chancellor of the College of Literature. He was also a specialist in Buddhism, but his works are nowhere to be found. After many years search my esteemed friend Mr. Kim Wangeum, 金瓊根 found the copy of an inscription said to have been written by Kim Soo-on, for the memorial stone that stood before the Wun-gak Temple. I took it at once and made a careful comparison with the dim characters remaining and found it to be genuine. I give herewith a translation, as it throws much light on the whole question of the Pagoda. It gives the date of its erection, tells who built it, and also the motive that prompted the building.\n\nThe inscription reads: \"For the ten years during which His Majesty has reigned, he has won great renown for his righteous rule, has demonstrated the principles of justice, and brought the sweet music of peace and quiet to the state, making the people, and all that pertain to them, happy and glad.\" During this time His Majesty has given himself up to religion, and meditated on the deep truths of the Faith, desirous that his subjects might be impregnated with a like spirit, and so win the blessing of eternal life.\n\n\"Among the sayings of Yu-rai in the 12th Section of the *Three Chang Sutra* 三藏經 there is a book called the *Tai-Wan Gak* 大圓覺 which is a special religious classic. In the midst of his many labours the King wrote a commentary on this book and edited it, using both the Chinese and the\nUn-moon 論文 to make it plain. He did it in the hope that the people would come to a knowledge of the Mahayana Doctrine.\n\n\"In the 4th moon of summer and on the day Kyung-sool in this year 1464, Prince Hyo-ryung, 孝寧大君, called Po, 補, set up a stone \"bell\" to the east of the Hoi-am Temple and placed the sari 合利 of Suk-ka Yu-rai within it. He then summoned an assembly to celebrate its erection, at which time he himself expounded the teaching of the Wun-gak Sutra. On that night Buddha appeared in mid-heaven, and angel priests were seen circling about the high altar. A bright halo surrounded them with circles of glory. Fresh water gushed forth from the earth. The sari increased and grew to be over 800 in number.\n\n\"In the 5th moon, Prince Hyo-ryung gathered them together and presented them to the King, with an account of the wonders he had seen. Therewith His Majesty and the Queen repaired to the Ham-wun Palace, and worshipped. Again the sari increased and grew to 400 more, on hearing which the Ministers memorialized the King with congratulations for this good omen.\n\n\"On this a general pardon was issued to all prisoners, and His Majesty sent an edict to the Government which read: 'Among the thousand great, good and righteous ones who have lived Suk-ka Yu-rai is the fourth. His word has gone out in all directions, and his wisdom to the ends of the world. His preaching, which saves the souls of men, has advanced and now occupies the realm of China. There are over 84,000 books that pertain to it and yet the Wun-gak Sutra is the source and end of all. I had already set my heart upon translating it and making it known, so that its teaching might benefit others, when my uncle Hyo-ryung called an assembly, at which time various Buddhas made their appearance before our eyes. It was a wonderful manifestation. We, who live under all the five kinds of darkness that afflict the soul, have seen a sight like this. And now I propose to restore the Hong-bok Temple, 洪福寺 and change its name to Wun-gak, and so build a memorial to the\nhighest of the Buddhist Sutras. How do you regard my intention?\"\n\n\"The officers of state bowed reverently and answered: 'Shall we not faithfully carry out the beneficent commands of His Majesty the King?'\n\n\"The site of the temple was in Kyung-haing Ward of the Capital, and the circumference thereof was over 2000 paces. When King (Kang-hun) 康憲, T'ai-jo 太祖, first set up his capital in Han-yang, this temple was the head of the Cho-ge sect of Buddhists, which sect at that time had disappeared, and their temple had been left deserted. It had become a public meeting place, and had been so used for forty years or more.\n\n\"In the 6th moon of the year in question, His Majesty paid a visit to the place and looked it over. Paik-ak Mountain appeared as a protective influence to the north, and Mok-myuk bowed reverently toward the temple from the south; while the site itself looked toward the sun-lit quarter. The ground was clean and neat, and just such a place as would suit a special temple, so His Majesty commanded the followers of Prince Hyo-ryung (the King's uncle) to appoint a committee to take charge of the work.\n\n\"They put up sheds at Tol-mo-ro (Suk-oo), 石隅, and there began work on the image of the Buddha, when suddenly a cloud of glory came down and settled on the house, and many flowers fell from mid-air, flowers of all the five colours. Prince Hyo-ryung's Committee at once sent word to His Majesty announcing what they had seen, and then he himself came forth to the Keun-jung Palace and received the congratulations of his ministers. There he issued a general pardon, and promoted all the officials one degree each in rank.\n\n\"In the 9th moon, on the day of kap-ja, clouds of light appeared over the main temple, that shot up their streamers into the blue sky and in front of the Ham-wun Palace. Again the officials wrote out their congratulations, and pressed them upon His Majesty. He again announced a general pardon and good will to the people. A great company of skilled workers had\nassembled, and though the King ordered them to take their time, they worked with extra diligence. The four divisions of society, officials, farmers, manufacturers and merchants, all made contributions. Each, fearing that he might be last, worked so hard that on the cul-myo day of the 10th moon the work was finished.\n\n\"Reckoning up the number of pillars supporting the building they were found to exceed 300. The Hall of the Buddha stood up high in the centre, and the inscription board above was written Tai kwang, myung jun, 大光明殿, Great-light Glorious-palace. To the left was the Sun-tang 禅堂 or Study Hall, while to the right was the Oon-chip, or Assembly Hall. The gate was marked Chuk-kwang Moon 寂光門, Hidden Light, and the outer gate was called Pan-ya 般若, or Likeness Gate. Beyond this again was the Hai-tal Moon 解脫門. There was a bell pavilion also which was called the Pup-noi kak 法雷閣, Kiosk of Buddha's Thunder. The kitchen was named Hyang-juk 香寂寮, Kitchen House. There was a pond on the east side where lotus flowers were planted; and on the west was a garden park where flowers and trees grew. Behind the Cheung-jun 正殿 Palace the sacred books were in keeping, and this house was called Haijang Chun 海藏殿 or Sea Covering Hall. Also a Pagoda was built of 13 stories called Sul-to-pa 塔婆 (Buddhist Pagoda). Within it were placed the accumulated sa-ri and the newly translated Wun-gak Sutra. The palaces, halls, studies, guest-rooms, stores, kitchen, outhouses, had each their particular place. The whole was magnificent and well constructed, and the ornaments were lavish, imposing, beautiful, all in keeping and fair to see. Its equal was nowhere to be found. Also the drums, gongs etc., necessary for the service, and other useful implements were abundantly provided for.\n\n\"On the 8th day of the 4th Moon of the year following, 1465, all the noted priests from the national monasteries assembled to celebrate the completion of the printing of the Wun-gak Sutra and the building of the house. At this time His Majesty the King came forth and took part, his Ministers\nbeing present as well as envoys who came with presents and tribute from afar. During the time of the assembly, rainbow clouds appeared above them, and flowers from heaven fell like rain. A white dragon ascended up to the height and a pair of herons danced among the clouds. Thus many favourable and propitious signs accompanied it. The assembled company saw these things with their own eyes, and out of gladness gave presents of cloth and rice to the officiating priests.\n\n\"On the 8th day of the 4th moon of the year following the Pagoda was finished (1466), and a general assembly was again convened. The King himself was present, when flowers again fell from heaven and the glory of the sari once more appeared. White streamers that shot up into the sky, were at first divided as into two or three pillars. Then they circled about till they became a wheel and multiplied into numberless circles. The sun's light became soft in its rays, and yellow in colour. Buddhist priests and nuns, onlookers and laymen, gazed upward and did obeisance. It was an innumerable company that saw and had a part.\n\n\"When His Majesty returned to the palace, students of the classics, old men and musicians, united in a song of congratulation. The people of Seoul, men and women, filled the streets, singing and dancing with joy, and their expression of gladness was like the rolling thunder. The King again issued a general pardon and all officers of state were advanced one degree in rank. The various officials united in saying 'We have seen how Your Majesty has built this great temple, set up this Hall of the Buddha, and convened so great an assembly. We have seen the signs and wonders that have accompanied it, such a thing as was never known before. It is not sufficient that we recognize it as due to the influence of the Buddha and the Bodhisat alone, but also to the virtue of His Majesty the King, whose sincerity in religion has attained to the highest place of union with the gods. We humbly request that this be carved in stone, so as to be an eternal record for the future.' Then the King called me, (Kim Soo-on), and ordered me to\nwrite. Thus I received the command and in fear and trembling did not dare to refuse. I therefore make my humble statement:\n\n\"Your Royal Majesty, born of Heaven, holy and wise beyond a hundred kings, while still but a prince was far-seeing enough to quiet the troubled state and to receive divine authority to rule, and thus You ascended the throne. So diligently did You think out plans for the benefit of Your people, that You scarcely had time to eat. Your exalted virtue and good deeds resulted in harmony and good-will, so that rains came in their appointed season, prosperity abounded and the people were happy with abundant harvests. Thus Your Majesty ascended to the highest seat of honour; Your fame was known throughout the world, and distant states came without ceasing to make obeisance, came across dangerous defiles, and over the stormy sea. Your Majesty's excellence and exalted virtue were such that even the Sam Whang and the O-je could not surpass. You thought also of how the people in their long night of darkness were blind and ignorant of the teachings of true religion, with no chance to ever know the same. By means of the Holy Books, which You Yourself read and studied, and then explained, You provided a way by which the people might easily learn and know, not only for themselves but also for others. And now, in the center of the capital, You have built a great temple whither all mankind may gather, to learn the love and knowledge of the Buddha. Your object is, that all the world, putting away evil and returning to the right way, may finally reach the great sea of Yu-rai's blessedness.\n\n\"Thus have officials, people, and those sharing in the work been made extremely glad. Like children at a father's bidding they came forth and did in a month or two what could not have been done otherwise in years. Great and wonderful it was! The King's high aid and matchless planning was in response to the great Buddha on high, and the wishes of the people from below. All the spirits too yielded approval with joy, and heaven and earth gave their witness. From the time\nof its first plan and beginning, many propitious proofs accompanied its advancement with the odours of fragrant incense. Beautiful and wonderful is the all-ruling Buddha whose salvation extends far and wide. How shall I, a humble servant, who sees but through the narrow opening of the bamboo, make mention of the beauty of Buddha's spiritual influence, or the King's imperial rule? Still, I was present at the Great Assembly, and saw these wonderful things. Shall I not make them known, praise them, and let them be heralded gloriously to the ages to come? Thus, I clasp my hands, bow, and write this poem:\n\n\"Great and beautiful our King,\nBlessed by Heaven with courage wide and wisdom;\nWho saw the future, and made the rough place smooth;\nWho made the stunted grow, and the prone to rise.\nGod gave the throne, the people gathered round;\nGreat was his command and glorious.\nOnce You became the King of Chosen,\nYou gave your heart and mind to kingship,\nFollowing the footmarks of Yo and Soon, Moon and Moo,\n\n堯舜文武\nMaking Your reign the equal of the Ancients,\nWith every fear and reverence added,\nNo hour was passed in idleness.\nWith righteous judgment and a righteous rule,\nTen years have rolled away.\nProsperity and abundance have been ours,\nLike to the days of Heui-ho 熙皞.\nPityingly, you thought of the ignorant people,\nWho, born of the same flesh and blood,\nAre fallen in the darkened way,\nNot knowing how to safely cross.\nThen it was that the Wun-gak Sutra\nWhich is the mother of all religion,\nWas explained by You and written out in full,\nWith characters and clauses, clear and plain,\nSo that all might easily understand,\nJust as though the Buddha's lips had spoken.\nA bell was hung and a great assembly called,\nYour kith and kin came forth to lead the way.\nThe rumor and the sound thereof\nWas like the roaring of the lion.\nSpiritual responses came forth a hundred fold,\nAnd reached the gracious hearing of my Lord the King.\nSaid He, 'It is well,\nCome to me all ministers and people,\nBehold the blessings of the Yu-rai\nAre beyond the mind to know or ken;\nAbundant store has he,\nHow shall we speak the wonders of his working?'\nAn old site of a temple stood,\nWithin the ancient capital.\nWhy should this site not be restored,\nSo that the teaching may be known?\nAll the needed plans were drawn,\nJust as His Majesty desired.\nThen was Prince Po, by Royal command,\nMade head and master of the work.\nThe people helped as children help a father,\nAnd ere the days were passed it finished was.\nPalaces, halls, side chambers and the like,\nGates, courts and rooms with balustrades—\nPeacocks in flight, and birds upon the wing.\nThus was it made and finished.\n\n*A Pagoda also stands within the court,\nLike to an ancient Ta-bo Tower.*\nBells and gongs rang in the air,\nResounding out the law and doctrine.\nTwice the great assembly gathered;\nTwice the king came forth to see.\nMarvels and wonders lent their presence,\nOnce and again in great abundance.\nMen with eyes and ears both saw and heard;\nAll were made glad and happy.\nThe people of our state,\nAnd even those beyond the border,\nSpake with one mouth and happy heart\nCalling aloud and singing praise.\nOur good and gracious king\nCame as the sage appears.\nA soldier he, and scholar too.\nSuch a reign his, as one among a thousand.\nOur King heard with clearest ear,\nReceived into his heart the truth.\nThe influence of the All-wise,\nAnd benefits of his gracious presence,\nWere known to all the people,\nAs one awakens from a dream.\nOur King hath loved us well\nAnd peacefully provided,\nBuilt a pagoda and a shrine,\nSo as to let the people know.\nThe fruits of righteousness were his,\nEnlightened was the state.\nThose who first saw, told others,\nWho, coming after, awakened to the truth.\nThere is no limit to the greatness of this,\nWide its extended virtue.\nHow can one tell of all its sweetness?\nOn this fair stone I write it out.”\n\nWe had been led to understand from tradition that the pagoda was built by Chinese and brought from China but this inscription would seem to make it clear that it was erected here by Korean workers. The kind of stone used is abundant about Seoul.\n\nI quoted in the opening paragraph a sentence from Dr. Sekino in which he says, “It is precisely the same in shape as the pagoda that stood on Poo-so Mountain in front of Kyung-\neh'un Temple P'ung-tuk County\" and that pagoda is mentioned in the Yu-ji Seung-nam 輿地勝覽 as follows: \"Kyung-ch'un Temple stands on Poo-so Mountain, where there is a pagoda of 13 stories with 12 assemblies of the Buddha pictured. The figures are most lifelike and definite in every detail, and the skill and exactness with which they are made have no equals in the world.\n\n\"Tradition says that Minister T'al-t'al of the Mongols erected it to mark the place where he wished prayer to be made for himself. At that time Prince Chil-yung, Kang Yoong, 姜融 had workers selected and sent from Peking and they built the pagoda. Up to the present time, too, the pictures of Kang Yoong and T'al-t'al are in the temple. On a hill to the east this special kind of stone is to be found, called chim-hyang 沈香.\"\n\nThe writer of the Encyclopaedia was Su Ku-jung 徐居正 a contemporary of Kim Soo-on and he says that already in his time tradition had something to say regarding the pagoda in P'ung-tuk. Now tradition does not speak in much less than a hundred years, and so the Pagoda of Kyung-ch'un Temple was already old and weather-beaten before the one in Seoul was erected in 1466. It is evident therefore that the one in Seoul was made an exact copy of the one in P'ung-tuk, which was recently taken to Tokyo and placed there.\n\nThere are three forms of memorial towers known to the East, the pagoda, the dagoba and the tope. The pagoda and the tope commonly take the form of a tumulus, a mound of earth or masonry. The dagoba is a heap that commemorates the relics of some noted Buddhistic saint, without any temple or hall for the Buddha being connected with it. The pagoda on the other hand, quoting from the Century Dictionary \"is a sacred tower usually more or less pyramidal in outline, richly carved, painted or otherwise adorned, and of several stories, connected or not with a temple. Such towers were originally raised over relics of the Buddha, the bones of a saint, etc., but they are now built chiefly as a work of merit on the part of some pious person, or for the purpose of improving the luck of the neighborhood.\"\nThe word pagoda comes from the Hindustani \"but-kadah,\" but meaning image, and kadah temple. Chinese attempting to give the sound rendered it by the characters poh, white; kuh, bone; and t'a tower, poh-kuh-t'a or pagoda.\n\nThis style of architecture, \"pyramidal, richly carved and ornamented\" is Dravidian or Southern Indian. The story of how it found its way across the inaccessible walls of the Himalaya Mountains, through the vast continent of China, to this distant land on the sea, would embrace the whole spiritual romance of the Buddhistic faith. One stands in awe before the Buddha's mighty relics, of which the Pagoda is one, and tries in vain to measure the depth of its influence on the Oriental soul.\n\nThe pagodas of Korea are built, without exception, as far as I have been able to find, to cover the relics or sa-ri of saints. These are said to be not the bones, but gems that come forth from the head or brow of a true master of the Buddhist faith.\n\nThat the results of deep study have to do with the physique is something commonly accepted by the Oriental. A deeply versed Taoist we are told, develops a halo that rises from his head or returns to it again as to a place of abode. So these sari are gems that grow in the brain or soul of the Buddhist and when he is cremated they spring forth from the fires.\n\nThe Pagoda, then, was erected over the sa-ri of Suk-ka Yurai, as I read from the inscription on the stone. Also the Wun-gak Sutra was placed therein. This was the book that awakened in the King a great desire for the Buddhist faith. Se-jo had murdered his nephew Tan-jong, and his heart was in distress so he went to the Buddha for relief, and the Wun-gak Book became his comfort and solace. This Sutra gave the name to the Temple and to the Pagoda, and so it is of special interest in this connection. It is made up of twelve questions and answers, the questions being asked by the assembled Bodisats and the answers given by the Buddha.\n\nLet me give you one of them as a sample.\n\n\"Question First:\n\nThe Moon-soo Sa-ri Bodisat arose among the many dis-\nciples assembled, bowed before the feet of Buddha, turned three times round to the right, knelt, crossed his hands and said: 'Great and merciful, Highest of the High, I pray that in behalf of this assembly and those gathered here You will tell us how Yu-rai, at the first, learned to live the pure and holy life, also how we Bodisats may, by means of the Mahayana Doctrine, win that pureness of heart that will drive away evil, and save the races yet unborn from falling into sin.' When he had said this he fell to the earth, repeating his prayer many times, over and over again.\n\n\"The Buddha made answer:\n\n\"'Good it is, my son, that you have, in behalf of those assembled, asked how Yu-rai lived the holy life; also how the races yet to come may, by means of the Mahayana Doctrine, win the perfect way, and not fall into sin. Listen while I tell you, and while I speak into your ears.'\n\n\"The Moon-soo Bodisat, delighted to receive the teaching, sat with all the assembled guests in deepest silence.\n\n\"'Good child' said he, 'the High Buddha points to the Gate of Tai-ta-ra-ni, which means Wun-gak, or Complete Enlightenment. From this gate there flows forth purity and holiness, true and unchanging; also the law by which one departs from anxiety and death, and the law by which all defilement is put away. With this I would teach the listening Bodisats.\n\n\"'The Law by which the Yu-rai came, finds itself in the perfect Law of purity and enlightenment, the departure from darkness and the entering into faith.\n\n\"'As to what I mean by Darkness, good child, it is this! All living beings have come from nothingness into an existence that experiences many falls. Deceived they go blindly on, foolishly thinking that this natural body is their real self, regarding its affinities and shadows as objects on which to rest the mind. It is like the defective eye that sees flowers in mid-air, or two moons in the sky. My dear child, there are no flowers in mid-air, or two moons in the sky. Flowers in mid-air\nare seen by the diseased in mind only. Not alone are such deceived in the shadow, but their nature is also deceived by the real flowers themselves. Because of this defect the Wheel goes on with life and death bound to it. This we call Darkness.\n\n\"'My dear child, this that we call Lack of Light is not anything that has form or can be seen. It is like things in a dream, which, while the dream lasts, seem real, but when the waking comes, are gone. These are indeed the mid-air flowers that vanish from the sight. We cannot tell where they disappear to, nor how they disappear, but the reason for it is that they are without being. So all mortals who are born into life, know not whence they come, and know not whither they go. Hence comes the Wheel with life and death hanging thereto.\n\n\"'My dear child, the one who enters the Enlightened Way which is the origin of the Yu-rai, knows that mid-air flowers have no being or existence, no body or soul, no death or life, no origin or reason.\n\n\"'Thought is an actuality and yet it is an unseen and imperceptible thing, like Nothingness itself, and Nothingness is the koong-wha-sang, 空花相 Flowers in Mid-air. One cannot say however that there is not a mind that thinks. When once this mind that thinks has rid itself of active thought then it can be said to have attained to Cheung-gak Soo-soon, 淨覺隨順 Pure Enlightenment, Simplicity of Action.\n\n\"'Now, as to how this comes to pass, Nothingness pertains to mind and cannot be influenced by change. Thus the hidden heart of Yu-rai never increases, never decreases. Thinking and seeing have no part in it. It is like the sphere of the world of the Buddha, rounded and complete filling all the Ten Regions. This is called the origin of the Pup-haing or the Buddha. Ye Bodisats, by means of this, and through the Mahayana Faith are able to develop the heart of purity. When mortals act according to the In-ji Pup-haing, they will never fall into sin or evil.'\n\n\"At this time the All-Highest, desirous of making the\nthought clear, repeated what he had said. He added 'Oh Moon-soo Bodisat, all the Yu-rai from the beginning of the way, have by means of knowledge awakened to this Lack of Light; they have awakened to know that through Lack of Light men see flowers in mid-air. Thus have they escaped the Wheel of transmigration, and like the man who awakens from a dream to find it nothing, thus have they seen the world. Once enlightened, they know this that fills all the Ten Regions of the Universe. Once they enter the Faith of the Buddha, attain to the Doctrine, and cease from Transmigration, they find at the end Nothingness of Nothingness. The reason for this is that the original nature of Yu-rai is final and complete. Give your minds, oh Bodisats, to this truth and show that if mortal man purifies himself thus he will never fall into sin.'\n\nThis is only one of the questions and one of the answers, but it will, perhaps, give an idea of the book that moved the King to build the Pagoda.\n\nOn the Pagoda itself are marked twelve Assemblies. These have no relation to the Twelve Assemblies seen in the Wun-gak Sutra or to the questions asked and answered there. The Assemblies carved on the Pagoda are named after famous Sutras or Sacred Books that have to do with the wider explanation of the Faith.\n\n**NAMES OF THE ASSEMBLIES.**\n\nI—Neung-am Assembly 榜嚴會. This name comes from that of a famous Sutra that was translated into Chinese in 1312 A.D. When this original assembly was held 28 bodisats gathered and listened to an explanation of the seven stages passed in the journey of the soul.\n\nII—Iup-hava Assembly 法華會. This likens the law of the Buddha to the lotus that comes forth from the miry earth and blooms a beautiful flower. Of three special stages in the heavenly way, this assembly stands for the highest attainment in the spiritual life.\n\nIII—Ryong-wha Assembly 龍華會. This assembly teaches\nthat the Miruk Buddha will have charge of the final kalpa, or age to come.\n\nIV—Yak-sa Assembly 藥師會. This assembly praises the virtue of the Yak-sa, and tells how he awakened to the Faith and became a Buddha.\n\nV—Ta-bo Assembly 多寶會. In this assembly the Ta-bo Buddha tells by question and answer how he came to a knowledge of the Truth.\n\nVI—Mi-ta Assembly 弥陀會. This tells of Amida Buddha, the eternal one, who had no beginning and no end. He was before Sa-ka-mo-ni.\n\nVII—So-jai Assembly 消災會. In this assembly appears the Ta-ran Buddha. He tells how evils shall be done away with and blessing secured.\n\nVIII—Wha-eum Assembly 華嚴會. This assembly tells how the sunlight touches first the highest peaks of the hills, and later those lower. It suggests the great ones who first know and understand. All the Bodisats and the angels attend this assembly, and eight armies of dragons accompany them as well.\n\nIX—San-se-pool Assembly 三世佛會. At this meeting the Buddhas of the past, present, and the future, all assemble.\n\nX—Chun-tan Su-sang Assembly 梅檀殊像會. Su-ka-yu-rai ascended to heaven from the land of Oo-jun. After his departure a great desire to see him once more possessed his disciples, so the king of Oo-jun had an image made out of Chin-tai wood. From this time on, images of the Buddha appeared. After a long time Su-ka Yu-rai came back to earth at which time the image became a living Buddha, and the two walked side by side. Crowds came to bow, but they could not tell which was the Buddha and which was the image. This is the assembly that took place at the time.\n\nXI—Wun-gak Assembly 圓覺會. This assembly met to ascertain the requirements of Complete Enlightenment. The answer was: First to keep the commandments, and second to keep the heart pure. (This is the assembly told of in the Sutra that was the means of the erection of the Pagoda.)\nXII—Ryong-san Assembly 靈山會. In the Spirit Mountain represented here, Su-ka Yu-rai spent much of his life. He discusses with his disciples the three stages of the Buddha's career.\n\nAbove these Assembly names on the south side of the Pagoda is seen still another small tablet from which the characters have been effaced, but judging from what still remains it seems to have been the name Wun-gak t'ap, the Wun-gak Pagoda or Tower of Perfect Enlightenment.\n\n1—The Pagoda was therefore built in 1464-1466 A.D.\n\n2—The builder was King Se-jo who reigned from 1456 to 1468, and the workmen were all Koreans.\n\n3—The form of it was modelled after the Pagoda in P'ung-tuk County, which had already been standing nearly a hundred years, and had been built by Chinese workmen. There is no evidence that this pagoda had ever been brought from Peking though it finds its final resting place now in Tokyo.\n\n4—It was built to commemorate the excellence of the Wun-gak Sutra from which it takes its name.\n\n5—It is by far the most interesting Buddhist monument in Korea.\nThe Pagoda at Seoul.\n\nThe Sari Pagoda of Moo-hak at Hoi-am Temple.\n\nMemorial Stone at Hoi-am Temple.\nThe Pagoda.\nTHE WUN-GAK TEMPLE STONE.\nHUNTING AND HUNTERS' LORE IN KOREA.\n\nBy H. H. Underwood.\n\nWhen curiosity prompted me a few months ago to attempt to find out what kind of animals I was hunting, I was surprised to discover that it was a field that had hardly been touched. It is to be hoped that some one qualified for this work will take it up and treat it more thoroughly and authoritatively than it is possible for me to do.\n\nI first turned to a fairly complete collection of books on Korea only to meet with statements ranging from the assertion that Korea abounded in alligators and crocodiles to the more truthful though hardly more helpful one that game of all kinds is to be found here.\n\nFinally, in the last chapter of Captain Cavendish's book, \"Korea and the Sacred White Mountain,\" I found a list of the animals which he had seen or heard of in Korea. In the main he has given the scientific names, and has starred those that he personally saw, while some of the others he has carefully marked as doubtful. This list has been of considerable help, though as I went on, I have been presumptuous enough to differ with Captain Cavendish, despite the fact that he was evidently much better equipped to deal with the subject than I. Nevertheless, I feel that the fact that he only spent a couple of months in the country and was ignorant of the language, to a certain extent compensates for his better equipment in knowledge of the subject, and in several cases I am forced to believe that Captain Cavendish was mistaken in what he thought he saw.\n\nTurning from books to native sources, the material available is varied and vari-coloured in the extreme, and you have the advantage or disadvantage, according to the development of\nyour conscience, of taking and leaving what you like. Their animal stories begin with the folk-tales, with which we have no concern here, and these merge into other stories of animals endowed with supernatural powers, which to them are matters of fact. Of such is the story of the snow-white fox, several hundred years old, who to this day haunts the slopes of Kwanak-san.\n\nThese again are followed by a series which have their birth in carelessness in observation, unbounded credulity and wild exaggeration. Naturally the city-bred people around us can tell one little or nothing about the animals, and many of them are ignorant of even the names of all but the commonest species. The average farmer is only a degree better and it is to the hunters and trackers that you must go for the modicum of truth which lies beneath the covering of superstition, exaggeration and ignorance.\n\nA word or two in regard to these hunters and trackers and how they hunt. Even among hardy mountain people, they are remarkably strong and vigorous. On two occasions I have had men of over sixty who raced up and down the hills and through the thick underbrush as though they were boys. They left me far behind, several times offering to carry my gun for me. Once, when stupid farmers, acting as beaters, had bungled things, an old gentleman of over seventy, a famous hunter in his day, offered to guide us and apparently found no great difficulty in climbing the hills and beating through the brush. Most of them are good trackers; one big fellow over six feet, hardly stooped to look at the tracks but strode along as though he was following a path. I saw them track a boar back and forth over the hills for the greater part of three days without being seriously at fault once, and they told me of trackers who could estimate to within an ounce or so the weight of a stag's horns from its tracks.\n\nCaptain Cavendish says that the Koreans are too lazy and cowardly to beat for tigers, and there are undoubtedly many Koreans whom no money would induce to hunt tigers. But as\nI have watched them beat and noted the kind of territory that they had to go over, it never occurred to me to call them lazy; and personally I think that a man might be excused for hesitating about beating for tiger, though the Koreans do it without making any fuss at all. The beaters are, of course, entirely unarmed, while even the hunters were formerly armed with a gun that was effective at only comparatively short ranges. This gun took an unconscionable time to load after it was once fired and had no stock to rest against the shoulder and steady the aim, but was held pistol fashion and its fuse was as likely as not to go out at the wrong moment.\n\nBy beaters I do not mean a crowd of men who merely go through the woods and make a noise, but a few men who by watching the position of the other beaters, the lay of the land and the direction the animal is taking, systematically drive him in. The hills are so precipitous that the game will cross the ridges and valleys by one of a few fairly well marked cuts or drives if the beaters do their work well. The hunter climbs up to one of these places and waits, sometimes half an hour, sometimes three or four hours, and I once sat at the top of a pass from 12:00 till 4:30. In cold weather you can tell the time by the changing feelings in your feet, but after a couple of hours the feeling ceases and their usefulness is at an end till the next time. Two or three good beaters who know the country and the habits of the game will send them in every time, while ten or twelve men who merely make a noise will let the animals slip back again and again.\n\nBut let us turn to the animals themselves, beginning with the deer. Many Koreans will tell you that there are but two kinds of deer in the country, Noro and Sasim. Closer inquiry among the hunters will show that they subdivide the Noro into three species, Po-noro; Hyang-noro, sometimes called Kuk-noro; and Tai-noro, known in some parts as Ko-ra-ni. The Sasim are also divided into two species under the rather indefinite names of Kang-won Province Sasim and Ham-Kyeung Province Sasim, the does of\nboth kinds of Sasim being known by the specific feminine noun, Ner-aingai. The natives, then, divide the deer of the country into five species and it remains for us to determine whether this division is correct and if so what these species are.\n\nThe po-noro are small deer, without horns in either sex, the males of which have the upper canines highly developed into large sabre like tusks, three or four inches in length. Mr. Reppert, while living here, shot two of these deer near Munsanpo or Buzan and it was from him that I first heard of them. Later other foreigners mentioned having seen them and I learned from the Koreans that they never have horns. In looking these up I was rather puzzled by the fact that Lydekker in his book, \"Deer of all Lands,\" states that there are but two species of deer having these characteristics, i.e. the water deer of China and the musk deer. But inquiry and observation soon showed that they are always found on the plains by the river, their very name meaning \"plains-deer.\" Mr. Reppert shot his by the river; Dr. Underwood told me that the first he ever saw were in the reeds by the river; and I found that all the places mentioned by the Koreans as frequented by the po-noro were close by a river or large stream, though in some cases they have been driven to the low hills as much as ten or fifteen li back from the water. Let us see how this compares with what Lydekker says of the Water-deer. \"A small member of the deer tribe, from Northern China, differing from all other Cervidae, except the musk deer, (with which it has no affinity), by the absence of antlers in both sexes. To compensate for this deficiency the bucks are armed with long sabrelike tusks. The species typifies a genus, and is known as Hyrcelaphus inermis. Water-deer frequent the neighborhood of the large Chinese rivers where they crouch among the reeds and grasses.\" It seems therefore as though it is safe to say that the po-noro is the Chinese water-deer.\n\nBy way of introduction to the Korean hyang-noro, I would call your attention to a line in the above quotation from Mr. Lydekker: \"The water-deer differ from all other\nCervidae except the musk-deer by the absence of antlers in both sexes.\" While inquiring about the po-noro, a Korean, who has hunted pretty well all over the country, told me that, in the higher mountains of Kang Won province, deer were hunted for the perfume contained in a small sac in the abdomen of the males. This he stated was a somewhat inferior grade of the same perfume from China. I went immediately to a Korean acquaintance of mine, who is a partner in one of the wholesale hide firms outside the South Gate. There are four of five of these companies in Seoul and most of the skins which come to the city pass through their hands. He confirmed all that the first man had told me and added that the fur was much coarser and more brittle than that of the ordinary deer. Further inquiry among Koreans brought the information that they were if anything smaller and darker in color than the po-noro, and that they were usually found singly, though sometimes in pairs. Compare this with the following description of the Musk-deer: \"An aberrant member of the deer family constituting the sub-family Cervidae Moschinae. Both sexes are devoid of antler appendages but, as in the Hydrelaphus inermis, the upper canines are long and sabre-like, projecting below the chin with the ends turned somewhat backwards. In size the musk-deer is about 20 inches at the shoulder. The hair covering the body is long, coarse and of a peculiarly brittle character; it is generally of a greyish brown color...... The special gland of the muskdeer is found in a sac about the size of a small orange beneath the skin of the abdomen.\"\n\nWhen, in addition to the fact that the testimony of several classes of Koreans tallies almost exactly with the above description, we remember that musk is a well known commercial commodity in Korea I think that in this case we are justified in taking the word of the Koreans and concluding that the Hyang-noro of Korea is the musk-deer.\n\nThe only objections which can be raised lie in the fact that the range of the musk-deer, as usually stated, does not extend to the neighborhood of Korea, nor do the altitudes at which they are\nusually found, from the Himalayas to Tibet, northwestern China, and Siberia in the Altai region at altitudes of usually not less than 8000 ft. in summer, correspond to the altitudes in Korea. The Siberian musk however is a very inferior grade, and while the Altai mountains rise to great heights in certain peaks the mean altitude of the region is said to be between 5000 and 5500 ft. The higher mountains of the range that runs south from the Paik-tu-san along the east coast of Korea would easily average between 3000 and 4000 feet while some rise to 5000 and 6000 feet. With the difference in altitude no more than this and the fact that the musk of the region, from which they are most likely to have come is, like the Korean article, of an inferior grade, it seems to me that we are forced to believe that the musk-deer is here, and like many of our animals is an immigrant from Siberia.\n\nCaptain Cavendish failed to see or hear of either the water-deer or the musk-deer, but reports having seen a Muntjac of the species C. Reevesi. I can not but think that what he saw was a water-deer and that seeing the tusks he mistook it for a Muntjac. The Muntjac is a small deer about the size of the water-deer but which has both horns and tusks. The horns are rather peculiar, having a backward curve at the extremities which almost amounts to a hook and the pedicles on which the horns rest are very prominent, so much so that it is sometimes known as the ribfaced deer. Another very noticeable feature is a black dorsal stripe. A deer with these characteristics would surely attract attention, yet I have been unable to find any trace of such a deer though I have inquired diligently. The hunters, one and all, stick to the assertion that there are deer without horns and with tusks but that they have never seen or heard of deer with horns and tusks.\n\nIt is both difficult and dangerous to state an absolute negative but I can say that I, personally, am convinced that Captain Cavendish was mistaken and that the Muntjac is not to be found in Korea.\n\nThe third species of deer is the Tai-noro, called Korani in\nmany parts of the country. This is a small and very pretty deer, the males of which have small antlers, with, as far as I can ascertain, only two tines. They have no tail at all but a large spot of erectile white hairs on the rump which serves as a guide to other members of the herd when in flight. I have seen as many as seven or eight together but in the main they seem to travel in pairs. In color they vary from a light fawn to a dark greyish brown that is almost black in certain lights.\n\nMy first impression was that these were identical with the Japanese sika deer. But the sika are described as having a short black and white tail with black markings around it, while these deer have no vestige of a tail nor any black markings on them at all. I can hardly believe therefore that these are the Japanese sika and my information is too meagre to enable me to determine what they are.\n\nNext above the tai-noro in size we have the sasim, which, as I have said, the natives rather indefinitely divide under the names Kang Won Province sasim and Ham Kyeung Province sasim. The first of these is apparently a species of sika deer known as Sika Mantchouricus, of which a specimen is to be seen in the Zoo in this city. They are a fairly large deer considerably darker as a rule than the korani, spotted in summer and with large handsome antlers.\n\nThe Ham Kyeung sasim I have not seen though antlers have been brought to the house which I was told were those of Ham Kyeung Province deer. While the evidence which I personally have seen is rather slender I am inclined to agree with Captain Cavendish that this is the Red deer or Cervus Elephas. The antlers are certainly quite different from those of Kang Won Province deer, being not only much larger but different in shape and in the angle which they make with the head.\n\nBefore leaving the subject of deer I want to be bold enough to attempt another negative statement. Captain Cavendish mentions the existence of fallow deer in Korea. Taking just one point, these are deer whose antlers are palmated to a considerable extent. I have been unable to find any\nKoreans who had even heard of such a thing as the palmation of a deer's antlers. Nor have I heard of any foreigner in any part of the country having ever seen such deer. Personally I feel convinced that there are only five species of deer in the country and that the two smallest of these are respectively the Water-deer and the Musk-deer, and that the Kang Won deer is the Sika Mantchouricus. I am inclined to believe the Ham Kyeung deer to be the Red deer and I am free to confess my ignorance as to the identity of the tai-noro. On the other hand I am quite sure that neither the Muntjac nor the Fallow deer exist in this country though I do not feel ready to make a definite statement to that effect.\n\nFrom deer the next step brings us to mountain goats, which are to be found in various parts of this country. Captain Cavendish mentions in his list four or five species of mountain goats, sheep, and goat-antelopes, of which he saw only one, and as far as I have been able to ascertain none of the others are to be found in Korea. The first on his list and the one which he has starred as having seen is the Nemorhedus caudata. This is the Goral or the Himalayan chamois. The more usual scientific name is the Nemorhedus goral and its range extends from the Himalayas northward to Manchuria and Korea, though I have not found mention of its existence in Korea except in Captain Cavendish's book.\n\nWhen I was in Kang Won province last December the hunters told me of a place not far away where mountain goat were to be found. I wished to go and try my luck at the time but they said that at that time of the year the ice and snow made it impossible to get anywhere in the neighborhood of the peaks where the goats were. I therefore made arrangements to visit the place in the spring. This I did, and after a couple of hours of hard climbing up and over about the worst bit of country I have seen, we succeeded in getting four fairly good specimens. I had expected that the horns would be hooked as are the chamois horns. The Koreans had not only told me that they were, but added that the animals made use of these hooks in a\nnovel and ingenious way. It would seem that when they go to sleep on some lofty or precarious ledge they hook their horns over the branch of a convenient tree and thus insure themselves against falling off even if troubled with nightmare. I was told that the horns were worn smooth on the under side from being used in this way and so was keenly disappointed to find that they would not allow of this. The animals were considerably larger than I had expected, and the Koreans claimed that farther back in the hills, where even in April the snow and ice made the cliffs inaccessible, still larger ones were to be found. The height at the shoulder for the four we got was respectively 26, 27, 28, 29 inches; the horns were only 6 or 7 inches long; from the nose to between the horns was 11 inches for the largest and 8 inches for the smallest; while from between the horns to the tip of the tail was respectively 50, 53, 54 and 57 inches. In color they are a beautiful greyish-brown with pure white on the neck and belly, and a black dorsal stripe. The hair is long, thick and remarkably soft; the tail, which was longer than I had expected, shades from the brown grey of the body to white at the tip. As to their weight, I should judge that they must have been well over one hundred and fifty pounds, for the beaters, who would pick up a seventy or eighty pound deer and trot off as though it were a mere feather, had all they could do to carry these at all, and how they ever got them over the steep slippery pass on the way out I cannot tell.\n\nI feel that in recompense for the hard things that I have said about the country I must say a word for it in return. The steep, black cliffs, with the pines in some miraculous way clinging to them here and there, fell almost sheer to the river which twisted by in a succession of rapids a full thousand feet below. In places it has cut for itself a deep canyon through the solid rock and with the snow covered mountains on every side it made a scene well worth the trip, had we gotten no game at all.\n\nThe Koreans call these animals mountain sheep, as a matter of fact they are not sheep but goats. I have not been\nable to hear of mountain sheep in Korea though Captain Cavendish mentions having heard of the Argali. These are the near relatives of the Rocky Mountain Bighorn and are supposed to be the original from which the stock of domestic sheep was derived. I understand that some of these sheep were shot in Manchuria and if so it seems at least possible that they might be found in the mountains of northern Korea, though men who have hunted in both Manchuria and Northern Korea tell me that they have never seen them on this side of the border. Captain Cavendish also mentions two kinds of antelopes, the Saiga tartarica and the Procapra gutturosa and also the ibex, though he marks these as doubtful and I feel that they are more than doubtful.\n\nIf, however, these animals are to be marked as doubtful there is on the other hand no doubt whatsoever about the wild boar, as the farmers will tell you most emphatically. Wild boars are distributed over a large part of the world and have many interesting features zoologically, of which I will mention only one here. They have four complete toes of which the two median ones are used in walking on dry land, the lateral ones being too short to reach the ground, but these prevent the animal from sinking in soft or marshy territory. The Korean boars apparently compare favorably in size with those in other parts of the world. The Indian boar, which measures 30 to 40 inches at the shoulder, is said to be larger than the European member of the family, yet the smallest that we measured stood 28 inches at the shoulder, the largest a full 40 inches, and the Koreans claim that there are considerably larger ones than any I have seen. I was told of one which weighed over 500 lbs. and had nine inch tusks. The color of the animals varies largely, ranging from almost black, through iron-grey, to a greyish brown. Beneath the long stiff bristles (sometimes 8 inches on the back) there is a softer curling undercoat of dirty brown. The animals are very plentiful in the mountain regions and are on the increase. They are a great pest to the farmers, as one large boar is said to be quite\ncapable of ruining the crops in a day's plowing in one night. What they do not eat they root up, and I have seen fields which looked as though some one had been hard at work getting ready to plant trees. One of the Koreans described the appearance of one field by saying that the boars had built themselves a house with women's quarters, guest room, kitchen and stables complete. They quite often travel in herds, the Koreans reporting having seen 14 or 15 in a herd, though myself have never seen more than seven. The larger ones go by themselves and it is these that are supposed to be dangerous. There are undoubted cases of their charging even when unwounded, and only last fall a Japanese was, I believe, almost killed by one not far from this city. Once I thought that one, coming straight toward me, was coming all the way, but, as I straightened up to make sure of him, he saw me and turned to one side, thus giving me all the excitement and none of the inconvenience of his really charging. One of the men went up to a boar that was supposed to be dead and was knocked down the hill as the price of his mistake, but otherwise I have seen no sign of anything but a desire to get away, which they do at an astonishing rate, carrying a surprising amount of lead with them. The old Korean guns often failed to get the bullet through the tough hide and one of the hunters claims to have shot a boar from various parts of whose anatomy he extracted a small bowlful of Korean slugs. The boar I spoke of above had a hole clear through him from side to side and yet was going at such a rate that I supposed I had missed him entirely, and another one took three soft-nosed bullets from a modern high-power rifle before he stopped. The natives tell great stories of the big ones to be found in the more inaccessible mountains. They assured me that there were boars with tusks 12 to 18 inches long, the nearest approach to this, that I know of, being the one I mentioned with nine inch tusks. In weight they vary greatly according to the time of year. In fall and early winter they have a layer of fat two and three inches thick and in the spring practically none. They are fond of wallowing in the mud and\nthe bristles become so caked with it that the Koreans claim that small pine trees grow on the backs of the larger boars. Pak, one of my men, stated that he himself had shot one with seedling pines growing on it and when I laughed at him, he naively remarked, \"If I'd been telling that story to any one else I would have told them the trees were big enough for roof beams, but seeing that it was you I made them only seedlings, and as you don't believe even that I wish I'd told you that they were bigger.\"\n\nThere is one more interesting item which I must mention before I leave the subject of wild boars. As nearly as I can ascertain they make shelters for themselves. The Koreans claim that there are two kinds, one made by the boars and one made by the sows for their young. I have seen only the first, but perhaps before I go further I should explain what I mean by a shelter.\n\nOne day on the hills I saw what appeared to be a low mound and on inquiring what it was they told me that it was a boar's \"house.\" I kicked the snow off the top and disclosed a pile of sticks, straw, grass and small branches, the whole about five or six feet across. Borrowing a stick from one of the beaters, I started to scatter the branches and see what was underneath, but found that, carelessly as they seemed to be laid on, they were so twisted and matted together that it was almost impossible to tear them apart. Finally two of us put our sticks under the whole thing and lifting it up threw it back where it lay still intact. Underneath the ground had been dug out to a depth of about eight or ten inches in a hollow a little smaller than the covering. I couldn't understand how the boar got in, till the Koreans stated that he lifts the covering with his snout and once in, the blanket, as you might call it, falls back snugly over him. Later I saw many of these things on the hills. It is true that I never saw one being made, or saw a boar in one, but I have seen them with plenty of tracks around. They certainly were not made by men and they certainly are made. Personally I am inclined to believe that they are the work of the boars.\nThe second kind are said to be much more substantial, made of larger sticks and raised from the ground. These the Koreans state are made by the sows for their young. Not having seen them I merely state that the Koreans claim that they exist, with the full knowledge that the Koreans state and claim many wonderful things.\n\nLess common than the boars, but still quite numerous, despite the fact that several writers on Korea deny their existence, and even Captain Cavendish makes no mention of them whatsoever, are the wolves. Oppert, for instance, says that while the name, irrui is known in the far north, neither name or beast is known in the interior of the country. Other later writers state that it was unknown up to about fifteen years ago. In this there is what I believe to be a half truth. But to explain my meaning I must pause to speak of the wolves now in the country.\n\nThere are two species, a small wolf known as irrui and a much larger one known as mal-seungyeungi or neuktai. Dr. Underwood tells me that the first winter that he was here, thirty years ago, he met a Korean whose village had been suffering quite badly from the attacks of irrui packs, made bold by the winter. Koreans getting on in years have told me that the irrui have been in Korea ever since they could remember and that their fathers before them had told them of these wolves, which would seem to dispose of the statement that they were formerly unknown.\n\nAbout fifteen years or so ago reports began to come in to the government in Seoul from various parts of the country of what many Koreans claimed was a hitherto unknown wolf. Much larger than the irrui, it was also much bolder and often attacked women and children. So serious was the pest that bounties were placed on the skins and in certain districts troops were detailed to hunt them down. Due to this activity they decreased rapidly for a time, but since the law restricting the use of firearms they have apparently been increasing again. I am unable to tell the technical names of these two kinds of wolves\nnor can I describe them very accurately. Koreans tell me that the two wolves in the Zoo here are both small neuktai. At the time that they first made their appearance in the country or first attracted attention, whichever it was, the theory was advanced that they were large Siberian wolves, driven south by special conditions, climatic or otherwise, in Siberia. Since then I have heard both them and the irrui described as hyenas, jackals, wild-dogs, or any other name that came handy, none of which seemed to fit. In colour they are decidedly tawny, while as to their size the native reports are wild beyond belief, as is shown by the use of the word malseungyeungi or horse-wolf. I know of an authentic case however which shows the size that some of them attain. It seems that some years ago near Syenchun, a boy was bending over, working in the fields when a large wolf stole out of the woods and seized him. Shouts and the approach of men working in another part of the field drove the beast off, and the boy, a good sized twelve year old, was hurried to Dr. Sharrocks who personally treated him and on whose word I have it that teeth marks from the upper jaw reached almost to the spinal column while those left by the lower jaw extended to the breast bone.\n\nThe irrui, as far as I can learn, are much smaller, being about the size of an ordinary Korean dog and often travel in packs. I have never heard of more than one or two neuktai being seen at a time.\n\nThe Koreans claim that on occasions the irrui and neuktai hunt together, the irrui acting as beaters and driving in the game which the neuktai then pulls down and kills. In the division of the spoils the neuktai takes his share first and then apportions the rest by weighing the irrui one by one in his jaws and giving out the meat according to the weight of each wolf. The man who told me this added that, while he had not witnessed this himself, he had heard it from credible sources. I hope you will say as much for me.\n\nWith regard to the bears of which there are also two species we are a little better informed. These are the black bear\nand the oriental brown bear, known respectively as Ursus tibetanus and Ursus arctos and are fairly common in this country. I have, however, seen no sign of polar bears or any valid reason for labelling an ordinary brown bear a polar bear or Ursus maritimus as has been done in the Seoul Zoo. In talking with Koreans about these animals, I learned that in the mountain districts of the north the natives use both snow-shoes and a kind of rude ski. They also told me the story of a bear and one of these Korean mul-pang-ors or water mills. It seems that the bear was attracted by the idea of using the grain in the mill for his breakfast. As he stooped to get it however the beam came down and struck him a heavy blow. He was annoyed and tried to return the blow only to find that the beam was up in the air beyond his reach. He stooped again, and again it came down and hit him. This time he was really angry and grabbing it, beat it soundly. But as the stream continued to flow it failed to learn a lesson and hit him again. This time he got hold of it and held it down. But not only did it take all his strength to hold it down, but when it was down, of course the grain was under it and out of his reach. In the end the faithful mill administered a lucky blow on the head and when he arrived on the scene the miller found not only his grain intact but a dead bear into the bargain.\n\nLast of all we come to the big cats, the leopards and tigers. The average Korean lumps them all under the expressive word \"Peum.\" On flags and screens, or gates and ceilings we are all familiar with the Korean tiger. Around him have gathered tales and superstitions that are well symbolized by the clouds of smoke and fire with which he is usually enveloped on gates and walls. In the good old days, which are so often thrown at us, he was wont to come into the palace grounds here in the city and his appearance always presaged disaster. In Wonsan, I believe, on cold nights you could meet him prowling on the streets. Last year one was seen at the North Gate of this city. Villagers tell of pigs, dogs and sometimes people carried off; and yet where is he? Seen in one village tonight, he kills in a village a hun-\ndred li from there before daylight. It is this quality that particularly fills the average Korean with dread and awe. The tiger apparently has no particular haunts but ranges free from ridge to ridge, scaring the villagers in a dozen valleys with the rolling echo of his roar as he prowls. Great strength, ferocity, cunning, and many other qualities, real and imaginary, are attributed to him. But despite all this the natives have since time immemorial hunted him with their old matchlocks. Mr. Griffis said that the Koreans expressed the difference between the Korean gun and the modern rifle as \"Bang! Wough! Dead hunter!\" and \"Bang! Bang! Bang! Dead Tiger.\" The phraseology Mr. Griffis evidently got from a dime novel but the moral is the same. There was no second bang for the Korean. This tended to produce good shooting and cool nerves. You will remember that it was the tiger hunters who discomfitted the French and again it was the tiger hunters who stood to their guns to the last man and won the enduring admiration of our American blue-jackets who fought them.\n\nAs to the animals themselves, Captain Cavendish mentions the Royal tiger and the Chinese Lauhu and stars them both. Of the leopards, he mentions three species, the Bulu, the Maou, and the snow leopard, starring the Maou. My own knowledge of the subject here, as in most instances, is almost nil and I have not been able to find anything on the matter in any available work. That the Royal Tiger, Felis tigris, is the ordinary large Korean tiger there can be no doubt. But as to what the Chinese Lauhu is and how it differs from the Royal tiger I do not know and have been unable to find out. Of the leopards I have been unable to find any data on either the Maou or the Bulu. Most of the works which I have been able to consult seem to have rather vague ideas on the subject of leopards in general, the size of the animals being put considerably smaller than many specimens that we have in Korea. The snow leopard is the same as the Himalayan ounce and is scientifically known as the Felis unica. It is smaller as a rule than the other leopards and of a greyish color instead of the tawny yellow of the leopard.\nskins with which we are all familiar. For this and other reasons I doubt very much whether the three leopards here in the Zoo are really snow leopards as they are labelled and am inclined to think that this labelling is due to the same carelessness which I instanced in the case of the bears. From what the Koreans tell me however, I am inclined to think that the snow-leopard is really to be found in Korea. The Koreans divide the \"peum\" under the following names: whangkaraymi, chikkaraymi and pyopeum. There are it is true, numerous other names in use but as far as I can ascertain they are merely synonyms for one or other of these three. The word \"horaingi\" is merely a general term and is used interchangeably with \"peum.\" The first two are said to be both tigers, the Koreans thus agreeing with Captain Cavendish that there are two kinds. The whangkaraymi is the largest of the peum and is said to be yellow with black stripes. The chikkaraymi on the other hand is not only smaller but the Koreans claim that instead of yellow being the predominant color the animal is more aptly described as black with yellow stripes. Whether this distinction really exists and is valid or not I do not know, but the Koreans stoutly maintain that it is not only the different appearance of individual members of the same family but that there are two distinct kinds of tigers. The leopards are lumped under the general name of pyo-peum or one of its synonyms, though some of the hunters have told me that there are several kinds of leopards but that they were all called pyo-peum. I myself have not had sufficient opportunity for observation to be able to say whether these divisions are in any way justified or not and can only offer them to you as I have received them from the Koreans.\n\nAs to tiger hunting, the Koreans claim that it is impossible, unless by lucky chance, to shoot a \"fresh tiger\" as they call one that has not recently killed. He apparently haunts no one particular locality but wanders where he pleases in the wilder and more inaccessible mountains. It is said that in the course of these wanderings all good tigers visit at least once Sam-gak-san or Pouk-han. A country man who\nknows and has seen nothing is compared to a tiger who hasn't even seen Pouk-han. When a tiger has killed, the hunters gather and track him to the hills and note toward which peak he has gone. Knowing the habits of the beast and every inch of ground they can tell where he has probably laid up and then the beaters and hunters separate. In beating for tigers the natives claim that once he is started out of his cover he will invariably go up hill to the top of the tai-teung or main ridge and follow along it rather than go down hill and cross the hills diagonally as other game do. The hunter therefore takes his place behind an improvised screen of branches, on the ridge, usually near the top of a slight rise as he can then see the tiger as he comes down the opposite slope and has him below him when he fires. The beaters work much as for other game and apparently think no more of it than of beating for deer. When I asked if they were not afraid they told me that there was no danger as there was no such custom as for an unwounded tiger to attack the beaters. Personally I should think there might be one that refused to be bound by custom. The natives have stories which show an idea somewhat similar to our own of the effect of the steady gaze of the human eye on wild animals. Two of the men who were with me on my last trip were once out tiger hunting and wounded a large tiger. After reloading their guns and thawing the ice and snow on their feet they tracked him over the ridge and suddenly saw him behind a large fallen tree with only his head visible. He was about seventy yards down the hill and as they wanted to get to closer range one of them sat down and bracing his feet on the icy slope got a good rest for his gun over his knee and kept his eyes fixed on the tiger while the other man started slowly down the hill on one side of the ridge. For a minute or so all went well and the tiger, though he saw the man sitting there did nothing but lash his tail. Suddenly however the hunter's foot slipped, he lost his balance and before he could recover himself the tiger was up the hill and had him by the foot. Fortunately the other hunter finished\nthe beast before serious damage was done. They firmly believe to this day that if the one man had been able to keep his eyes on the tiger and hold his gaze the other could have gotten to point blank range with perfect impunity. The story may be rather tall in several points but the idea is the same. It is not a matter that lends itself to investigation or experiment but is none the less interesting. Tales there are without number, the most gruesome of a hunt to kill the tiger that carried off the young wife of one of the hunter's friends and to recover the remains; tales of unexpected encounters when both tiger and man turned tail and ran from each other; of tigers who hypnotize the hunters; tales of men literally scared almost to death and many others.\n\nBefore closing these few words which are merely an introduction to some of the larger animals of the country I should like to mention a few of the uses which the natives make of the blood, bones, fur and various organs of the body. Residents of Korea know that the blood of the deer is largely sought for medicine and men often go to the country and hire hunters so as to drink it warm. What is true of deer's blood is true to a large extent of the blood of boar and goat and to a certain degree of many of the animals though I understand that none are supposed to be as good for this purpose as the deer. Deer's horns in the velvet are in great demand as medicine and bring handsome prices per ounce, the sasim being hunted primarily for their horns. The noro horns are also used though not esteemed as highly as the sasim's. Beside the occasional use of boar's blood, the long tough bristles on the back are used in making Korean hats and several other articles, while certain organs of the body, when dried and powdered, bring high prices. Bears are also more hunted for the medicinal value of certain parts of the body than for the skin, bones or flesh though these all bring fair prices. With the tigers and leopards the bones are almost if not quite as valuable as the skin and are exported to China where they are even more highly regarded in the preparation of drugs than here.\nOf course, to-day there are practically no Korean hunters on account of the laws restricting the possession of fire-arms. That the requiring of a license and the limitation of the hunting season are both good measures, no one would attempt to deny, but as game laws the present regulations leave much to be desired. The hunting season lasts at least a month longer than it should, and, while a man must have a license to own a gun, trap or falcon, no license for hunting is required. The result is that in the spring when the deer are weakened by lack of food during the long winter, parties are made up and the sasim are tracked and run down without guns. The hills at this time are like glass on one side and heavy with mud on the other and when there is a constant pursuit that gives no time to stop and feed, the animals are usually run down in a week or less. Thus instead of increasing during this time of few hunters they are rapidly decreasing and are in danger of becoming extinct. Much the same is true of the musk-deer and certain other animals. The present law is apparently framed simply to restrict the use of firearms and not at all with reference to the preservation of the game. Again in preserving and classifying the animals of the country the Zoological Gardens here have a great opportunity of which they are apparently not taking full advantage. Many common species are not to be found there and the classification has not been done with the care that might have been expected. No labels will transform ordinary bears into polar bears and the mere word cervus over a deer is, even though true, beautifully indefinite. It is to be hoped that when some of the many other improvements which the Government-general has undertaken are completed more attention will be turned to this department and that game preservation both in the Gardens and in the country at large will be properly handled. This time cannot, however, be put off indefinitely as each year thins the furred and feathered population of the land. But even before Governmental attention is turned to this subject a most interesting field is open to someone capable of dealing with it in the way it merits. Either with camera or gun a trip\ninto the country is its own reward. The kindly country folk, the air, the scenery, the long days on the hills, and the people crowding into the little rooms, in the evening, to tell and hear wondrous stories, all have an unmatched charm. Added to this that one can travel with all the luxuries of home and even the most critical could not complain. A glimpse of the people and their lives in the evenings and a glimpse of the animals and splendid scenery through the day, this is worth much.\nOFFICERS FOR 1915\n\nPresident\nRev. J. S. Gale, D. D.\n\nVice President\nRalph G. Mills, M. D.\n\nCorresponding Secretary\nS. A. Beck.\n\nRecording Secretary\nE. W. Koons.\n\nTreasurer\nD. A. Bunker.\n\nLibrarian\nGerald Bonwick.\n\nCouncillors\n\nR. S. Miller, (American Consul General)\nI. Yamagata, (Editor \"Seoul Press\")\nA. H. Lay, (British Consul General)\nLIST OF MEMBERS,\nKOREA BRANCH, ROYAL ASIATIC SOCIETY.\n\nHONORARY MEMBERS.\n\nAllen, Hon. H. N., M. D. LL. D. ... Toledo, Ohio, U. S. A.\nGubbins, J. H., C. M. G. ... ... ... c/o Foreign Office, London.\nHulbert, H. B., Prof. ... ... ... Springfield, Mass, U. S. A.\nJones, Geo. H., D.D. ... ... ... 150 Fifth Avenue, New York.\nJordan, Sir John ... ... ... Peking, China.\n\nORDINARY MEMBERS.\n\nAlbertson, Miss M. M. ... ... ... Seoul.\nAsami, R. ... ... ... Judge of Supreme Court, Seoul.\nAvison, Dr. O. R. ... ... ... Seoul.\nBadcock, Rev. J. S. ... ... ... Seoul.\nBeck, Rev. S. A. ... ... ... Seoul.\nBolljahn, J. ... ... ... Seoul.\nBonwick, Gerald ... ... ... Seoul.\nBowman, Dr. N. H. ... ... ... Beeville, Texas.\nBridle, Rev G. A. ... ... ... Suwon.\nBrineckmeier, R. ... ... ... Chemulpo.\nBunker, Rev. D. A. ... ... ... Scoul.\nBunker, Mrs. D. A. ... ... ... Seoul.\nBurdick, Rev. G. M. ... ... ... Seoul.\nCollyer, Rev. C. T. ... ... ... Wonsan.\nCrispin, J. F. ... ... ... London, England.\nCutler, Dr. M. M. ... ... ... Pyeng Yang.\nElliot, Sir Charles ... ... ... University of Hongkong.\nGale, Rev. J. S., D. D. ... ... ... Seoul.\nGenso, J. F. ... ... ... Seoul.\nGillett, P. L. ... ... ... Nanking, China.\nGreenfield, Rev. M. W. ... ... ... Taiku.\nGriffin, J. T. ... ... ... Yokohama, Japan.\nGrove, Rev. P. L. ... ... ... Pyeng Yang.\nHall, Mrs. R. S., M. D. ... ... ... Pyeng Yang.\nHarris, Bishop, M. C. ... ... ... Scoul.\nHaven, Rev. Dr. W. I. ... Bible House, Astor Place, New York.\n\nHoffman, Rev. C. S. ... Kangkei.\n\nHoldcroft, Rev. J. G., ... Pyeng Yang.\n\nHooker, J. T. ... Spartanburg, S. C., U. S. A.\n\nIrvin, Dr. C. H. ... Fusan.\n\nKanazawa, Dr. S. ... Imperial University, Tokyo, Japan\n\nKavanaugh, J. ... Shanghai, China.\n\nKoons, Rev. E. W. ... Seoul.\n\nKruger, F., Ph. D. ... German Consul General, Seoul.\n\nLay, A. Hyde ... British Consul General, Seoul.\n\nLeadingham, Dr. R. S. ... Mokpo.\n\nLudlow, Dr. A. I. ... Seoul.\n\nMcEachern, Rev. John ... Kunsan.\n\nMcGary, E. ... Seoul.\n\nMacrae, Rev. F. J. L. ... Masanpo.\n\nMiller, Hugh ... Seoul.\n\nMills, Edwin W. ... Tul Mi Chung Mine, Korea.\n\nMills, Dr. R. G. ... Seoul.\n\nMin Yung Chan ... Seoul.\n\nMoffett, Dr. S. A. ... Pyeng Yang.\n\nMoore, Rev. J. Z. ... Pyeng Yang.\n\nMoose, Rev. J. R. ... Seoul.\n\nMorgan, Hon. E. V. ... Dept. of State, Washington, D. C.\n\nMorris, Rev. C. D. ... Pyeng Yang.\n\nMorris, J. H. ... Seoul.\n\nNiwa, S. ... Japanese Y. M. C. A., Seoul.\n\nPye, Miss Olive F. ... Seoul.\n\nReiner, R. O. ... Pyeng Yang.\n\nRhee, Dr. S. M. ... Honolulu, Hawaii.\n\nRhodes, Rev. H. A. ... Kangkei.\n\nRichard, Rev. Dr. Timothy ... Shanghai.\n\nRobbins, Miss H. P. ... Pyeng Yang.\n\nScidmore, Hon. G. H. ... American Consul General, Yokohama, Japan.\n\nScranton, Dr. W. B. ... Chicksan.\n\nShidehara, Dr. ... President Hiroshima Higher Normal School, Japan.\n\nSmith, Rev. F. H. ... Seoul.\n\nSmith, Dr. R. K. ... Andong.\n\nSmith, Rev. W. E. ... Pyeng Yang.\n\nSnyder, L. H. ... Seoul.\n\nStarr, Prof. Frederick ... Chicago University, Chicago, Illinois.\nSwearer, Rev. W. C. ... ... ... Kongju.\nStillman, E. G., M. D. ... ... ... 830 Park Ave., New York.\nTate, Rev. L. B. ... ... ... Chunju.\nTaylor, W. W. ... ... ... Seoul.\nTownsend, W. D. ... ... ... Chemulpo.\nTrollope, Rt. Rev. Bishop M. N. ... Seoul.\nUnderwood, Rev. Dr. H. G. ... Seoul.\nVan Buskirk, Rev. Dr. J. D. ... Seoul.\nWada, Dr. Y. ... ... ... Director, Meteorological Observatory, Chemulpo.\nWelbon, Rev. A. G. ... ... ... Andong.\nWhittemore, Rev. N. C. ... ... ... Syenchun.\nWilliams, Prof. F. W. ... ... ... New Haven, Connecticut, U. S. A.\nYamagata, Mr. Isoh ... ... ... Editor \"Seoul Press,\" Seoul.\nCATALOGUE\n\n\"TRANSACTIONS OF THE KOREA BRANCH OF THE ROYAL ASIATIC SOCIETY.\"\n\nVOLUME I. Part I only. 1900.\nPrice Yen 3.00.\n\nContents:\n- Influence of China upon Korea.\n- Korean Survivals.\n- Colossal Buddha at Eun-jin.\n- Minutes of General Meeting.\n\nAppendix:\n- Office Bearers.\n- List of Members.\n- Constitution and By-Laws.\n\nVOLUME II. Part I. 1901.\nPrice Yen 2.50.\n\nContents:\n- Kang-Wha.\n- The Spirit Worship of the Koreans.\n\nVOLUME II. Part II. 1902.\nPrice Yen 3.00.\n\nContents:\n- Han-Yang (Seoul).\n- Korean Folk-Tales.\n- Minutes of General Meetings.\n- Report of the Council.\n\nAppendix:\n- Officers.\n- List of Members.\n\nVOLUME III. Part I only. 1903.\nPrice Yen 2.50.\n\nContents:\n- Ch'oe Ch'e-Wun: His Life and Times.\n- The Culture and Preparation of Ginseng in Korea.\n- Minutes of Annual Meetings.\n- Report of the Council.\nAppendix:—\n\nOfficers.\nList of Members.\nCatalogue of the Landes Library.\n\nVOLUME IV. PART I. 1912.\nPrice Yen 1.50.\n\nContents:—\n\nThe Old People and the New Government.\nThe Korean Alphabet.\n\nVOLUME IV. PART II. 1913.\nPrice Yen 2.50.\n\nContents:—\n\nJapanese-Korean Relations after the Japanese Invasion of Korea in the 16th Century.\nThe Village Gilds of Old Korea.\nCoinage of Old Korea.\nMinutes of Important Meetings.\n\nVOLUME IV. PART III. 1913.\nPrice Yen 2.50\n\nContents:—\n\nMarriage Customs of Korea.\nSelection and Divorce.\nThe Celestial Planisphere of King Yi Tai-Jo.\n\nVOLUME V. PART I only. 1914.\nPrice Yen 2.50.\n\nContents:—\n\nSome Recent Discoveries in Korean Temples and their Relationship to Early Eastern Christianity.\nA Plea for the Investigation of Korean Myths and Folklore.\nCatalogue.\n\nVOLUME VI. PART I. 1915.\nPrice Yen 2.50.\n\nContents:—\n\nThe History of Korean Medicine.\nAfforestation in Korea.\nMinutes of Annual Meeting.\nReport of the Council.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko62roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 66, "total-input-tokens": 94702, "total-output-tokens": 23534, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 424, 5], [424, 424, 6], [424, 706, 7], [706, 706, 8], [706, 2463, 9], [2463, 4622, 10], [4622, 6818, 11], [6818, 8829, 12], [8829, 10877, 13], [10877, 13019, 14], [13019, 15105, 15], [15105, 17147, 16], [17147, 19153, 17], [19153, 21225, 18], [21225, 23355, 19], [23355, 25448, 20], [25448, 27037, 21], [27037, 28386, 22], [28386, 29737, 23], [29737, 31848, 24], [31848, 33925, 25], [33925, 35927, 26], [35927, 37931, 27], [37931, 39824, 28], [39824, 41667, 29], [41667, 42720, 30], [42720, 42821, 31], [42821, 42821, 32], [42821, 42833, 33], [42833, 42859, 34], [42859, 44561, 35], [44561, 46617, 36], [46617, 48727, 37], [48727, 50874, 38], [50874, 53023, 39], [53023, 55135, 40], [55135, 57246, 41], [57246, 59376, 42], [59376, 61536, 43], [61536, 63663, 44], [63663, 65867, 45], [65867, 67997, 46], [67997, 70052, 47], [70052, 72160, 48], [72160, 74362, 49], [74362, 76548, 50], [76548, 78741, 51], [78741, 80910, 52], [80910, 83061, 53], [83061, 85283, 54], [85283, 85775, 55], [85775, 85775, 56], [85775, 86114, 57], [86114, 87527, 58], [87527, 89085, 59], [89085, 89696, 60], [89696, 90516, 61], [90516, 91465, 62], [91465, 91465, 63], [91465, 91465, 64], [91465, 91465, 65], [91465, 91465, 66]], "primary_language": ["None", "en", "None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]