[{"id": "a4757c2de407745d5eb3bb99f6d4af03b1d32270", "text": "CATALOGUE\n\nOF\n\nTHE CHINESE LIBRARY\n\nOF THE\n\nROYAL ASIATIC SOCIETY.\n\nBY\n\nTHE REV. S. KIDD.\n\nLONDON:\nPRINTED BY JOHN W. PARKER, ST. MARTIN'S LANE.\n\nM.DCCC.XXXXVIII.\nADVERTISEMENT.\n\nThe following explanatory Catalogue of the Chinese Library of the Royal Asiatic Society was drawn up by the Rev. S. Kidd, the Professor of Chinese Literature in the University College, and presented by him to the Society.\n\nThe Council of the Society are of opinion that the information which this valuable communication contains, respecting the actual compass and general character of the Literature of China, will render it highly interesting, not merely to the Chinese student, but also to the general scholar, and they have accordingly directed 500 copies to be printed, for the use of the Members.\n\nThe expense will be defrayed by an individual Member of the Society.\n\nGrafton Street,\nJune 1838.\nCHINESE LIBRARY.\n\nLANGUAGE.\n\nChuen tsze wei\n\nA well-known Dictionary of the ancient Seal character, in six vols. This form of the character was originally written 800 years B.C.\n\nKeang hoo chih tüh fun yun tsö yaou\n\nA Pocket-Dictionary and Letter-Writer for travellers: or, \"An abridged Dictionary, arranged according to the tones,\"—that is, the final sound of the character. In four vols. Two copies.\n\nFun yun\n\nA Dictionary arranged according to the tones, in one vol.\n\nTsze wei\n\nA Dictionary according to the primitives, in fourteen vols.\nYun ya\n\nA Dictionary arranged according to the tones, in five vols.\n\nYun foo shih e\n\nA Dictionary arranged according to the tones, in twenty four vols.\n\nE wăn tung lan\n\nA Dictionary arranged according to the primitives, in thirty-eight vols. Literal title—\"General Observations on Polite Literature.\"\n\nYun tsze luy yin\n\nA Dictionary arranged according to the tones, in eight vols.\n\nLûh shoo\n\nAn ancient Dictionary arranged according to the form and meaning of the character, in five vols. A standard work, to which all later lexicographers have been indebted; originally composed by Paou-she, during the dynasty Chow, about the year B.C. 1100.\nKoo kin yun leö\n\nA Dictionary according to the ancient and modern laws of intonation, in five vols.\n\nYun foo k'eun yüh\n\n\"A Treasury of Rhymes and a Group of Gems.\" A Dictionary arranged according to the tones, in twenty vols.\n\nShwo wän\n\nAn ancient Dictionary arranged according to the form and meaning of the characters, in six vols. It was composed by Heu-shin, an officer of government during the dynasty Han, A.D. 100. The object of the work was both to preserve the original form of the character, and to trace its meaning and derivation.\n\nE wän lan\n\nA Dictionary of the Seal character, in four vols.\n\nGnaou e tsze yun\n\nA Dictionary arranged according to the tones, in three vols.\nE wăn pei lan\n\nAn excellent Dictionary arranged according to the primitives, in forty-two vols. Its author, Sha-mŭh, was thirty years in completing it. It was first published in the reign of Këen-lung.\n\nK’ang he tsze tëen\n\nA Dictionary compiled from the best authorities, by order of the late Emperor Kang-he. It occupied thirty persons five years, is arranged according to the primitives, and entitled “A Standard or Canon of the Character.” Sixteen vols. 8vo., European binding.\n\nTsze lin yŭh pëen\n\n“A Grove of Characters and a Page of Diamonds.” A Dictionary according to the primitives, in one vol.\n\nChing tsze túng\n\nA Dictionary arranged according to the primitives, in twenty-three vols., originally published during the Ming dynasty.\n\nChing tsze tëen\n\nA Dictionary according to the primitives, in twenty vols.; also another copy in fourteen vols.\nKwan hwa tsung lun\n\nGeneral remarks on the Mandarin dialect, in one vol.\n\nTsze e\n\nAn explanation of important words in physical and moral science, in two vols.\n\nTsing wăn ke mung\n\n\"Tartar Literature to enlighten the Dull.\" A sort of vocabulary, with a Chinese interpretation, for the use of boys, in four vols.\n\nTung wăn t'seen tsze wăn\n\n\"The Thousand-character Classic,\" according to the three forms of writing:—the Seal, or ancient character; the Running-hand, or grass character, and the Correct, or ordinary character: in two vols.\n\nT'seen tsze wăn\n\nThe Thousand-character Classic, with a commentary, in one vol. It is composed of a thousand different symbols, so arranged as to make sense without the recurrence of the same word; hence its title.\nTs'een tsze wăn\n\nThe same work as the two preceding, consisting of the text only, in one vol.\n\nTsing wăn hwuy\n\nA Manchow-Tartar-Chinese Lexicon, in European binding, thick 8vo., one vol.\n\nMwan Han hŏ peih seuen yaou\n\nValuable and important selections in the Manchow-Tartar and Chinese languages, in four vols.\n\nTsing wăn kēen\n\nThe Mirror of the Manchow-Tartar language, in twenty-six vols.\n\nSin lŭh tsze fă\n\nA Manual of four different methods of writing the Chinese character, in two vols.\nHISTORY.\n\nShoo king\n\nThis work is the second of the \"Five Classics,\" and the most ancient portion of Chinese History, comprising records of the first sovereigns of antiquity, who lived about the time of the Deluge, with a commentary, in twelve vols.\n\nKoo wăn shang shoo\n\nThe same work under another title, with a commentary, in six vols.\n\nShoo king\n\nThe text only of the above work, in four vols.\n\nKang këen ta tseuen\n\nA complete view of General History, in thirty-four vols.\n\nKang këen ming ke\n\nA general view of History, perspicuously arranged, in four vols.\nFung Chow kang këen\n\nFung Chow’s General History, in forty vols. A work of considerable authority in China.\n\nSe yang ke tung suh\n\nAn authentic Record of the general Customs of the Western Ocean. The phrase Se-yang, usually denotes Europe, but it seems here to refer to Arabia and India: in twenty vols.\n\nShe ke\n\nHistorical Memorials, in twenty-four vols.\n\nShe ke tung këen\n\nA complete and perspicuous survey of History, in thirty-nine vols.\n\nTung këen kang mûh\n\nA general History of China, by Choo-foo-tsze, the distinguished commentator on the “Four Books,” in sixty-seven vols.\nTsing neih ke\n\nAn abridged account of an Insurrection, which took place in the eighteenth year of Kea-king, in two vols.\n\nChun tsew\n\nConfucius's History of his own Times, containing an account of the sixth century before the Christian era: it is the last in order of the \"Five Classics,\" and derives its title—\"Spring and Autumn\"—from the circumstance of its having been commenced at the former, and concluded at the latter of those seasons. It consists, with a commentary, of seventeen vols. Another copy, the text merely, in six vols.\n\nHwang tsing k'ae kwō fang leō\n\nMethods and plans by which the foundation of the Imperial Tartar dynasty was laid in China, in twelve vols.\n\nShwō ling\n\nAn account of embassies from Russia, Cochin-China, Formosa, the Loo Choo Islands, and other states. Two works, the former in twelve, the latter in eight vols.\nTung hwa lüh\n\nA manuscript account of the Tartar dynasty composed by some historiographers of government, during the reign of Këen-lung, in sixteen vols. The printing of this work is a capital offence by the laws of China.\n\nSTATISTICS AND TOPOGRAPHY.\n\nKwang tung t'ung che\n\nA topographical and statistical work on the Province of Canton, in thirty-six vols.\n\nNan Hae hëen che\n\nStatistics of the district Nan Hae, in the province of Canton; in twelve vols.\n\nFan yu hëen che\n\nStatistics of Fan-yu, the district in which European ships anchor; in twelve vols.\n\nYih tung che\n\nA statistical account of the whole Chinese Empire, in thirty-two vols.\nKeung chow foo che\n\nA statistical account of the northern part of the Island, Hae Nan; in sixteen vols.\n\nT'ae p'ing kwang ke\n\n\"Extensive Records of general Peace and Prosperity.\" A sort of abstract of the different provinces of China, statistical, topographical, &c., in forty vols.: originally published in the tenth century.\n\nYuē tung peih ke\n\nRecords relating to the Province of Canton, in four vols.\n\nSan kwō che\n\nStatistics of the three kingdoms wei, shūh, woo, which flourished about the third century of the Christian era. This work, though generally derived from the events of that period, abounds with fiction, and must, therefore, notwithstanding its title, be regarded as a sort of historical novel. It is written with distinguished ability, and considered as a model of elegant composition in that department of literature to which it belongs. Three copies, one octavo and two duodecimo, twenty vols. each.\nMing chin leih tae tsow e\n\nA general collection of Statistics addressed to the Emperor by celebrated ministers of successive ages, in thirty-two vols.\n\nNan Han ch'un t'sew\n\n\"The Spring and Autumn of Nan Han.\" Probably a statistical account of a district in the province of Sze Chuen, in four vols.\n\nNan te tung heaou\n\n\"General illustrations of Nan Te,\" in one vol., two copies.\n\nHan Sung k'e shoo\n\n\"Extraordinary description of the dynasties Han and Sung;\" or statistical and topographical illustrations of the san-kwo and shwuy-hoo united: in twenty vols.\n\nHing shwuy kin keen\n\nA description of the rise, courses, productions, &c. of the celebrated rivers of China, and an account of \"the river for the transportation of grain,\"—the great canal; in forty vols.\nTa Ying kwo tung che\n\nGeneral Statistics of the great English Nation, by the Rev. C. Gutzlaff, in one vol.\n\nShwuy Hoo chuen\n\nAn historical work of the Sung dynasty, founded partly on fact and partly on fiction. Literal title, \"Streams and Lawns narrated;\" in twenty vols., two copies.\n\nBIOGRAPHY.\n\nMing hëen lëe neu she sing poo\n\nA biographical work, containing lives of eminent men and celebrated females, through successive ages; in one hundred and twenty vols.\n\nLëe neu chuen\n\nBiographical sketches of eminent females, in eight vols.\nPOETRY.\n\nShe king\n\nA collection of ancient odes, originally compiled by Confucius, in four vols. Three copies.\n\nShe king\n\nThe same work, with a copious commentary, in seventeen vols.\n\nTs'een sow yen she\n\nA collection of odes, entitled the Banquet Odes of a Thousand Old Gentlemen; in thirty-six vols.\n\nHung seué low keu chung keith\n\nThe nine dramatic pieces, or popular songs of the red and white chamber, in ten vols.\n\nWan show keu ko yō chang\n\nPieces of music and songs sung in the streets on imperial birth-days; in six vols.\nShe yun choo ke\n\n\"The Pearl-Mirror of Poetical Harmony;\" a collection of odes, in four vols.\n\nShih urh chung keŭh\n\nThe twelve popular odes, or dramatic pieces, in twenty-four vols.\n\nLūh yin ting she\n\nThe Odes of the Green-shaded Hall, in two vols.\n\nLeih ung shih chung keuh\n\nLeih-ung's ten dramatic compositions, or popular odes, in eighteen vols.\n\nShe fā jīh mun\n\nAn introduction to the laws of poetry, in one vol.\n\nShih san poo wei ko\n\nSatirical songs, accompanied with thirteen broad caricatures of different persons, in one vol.\nNATURAL HISTORY.\n\nKwang pō wūh che\n\nA sort of universal history of nature,—“Everything that exists between Heaven and Earth;” in twenty vols.\n\nPun t'saou kang mŭh\n\n“A general Outline of Plants and Herbs.” This is considered the best pharmacopoeia as well as botanical work in China; in forty-three vols.\n\nPun tsaou kang mŭh tsih yaou\n\nAn abstract of the most important parts of a general treatise on Botany; in thirteen vols.; the three last comprising notices of herbs suitable for the human species and animals.\n\nT'ang jin shwo wei\n\nThe T'ang Dynasty's, or the Chinese, herbal expositor; in thirty-two vols.\nUrh joo t'ing k'eun fang poo yuen\n\nA treatise on the heavens, the seasons, fruit-trees, grain, vegetables, flowers, medicine, fish, &c., in which the mode of cultivating tea, bamboo, hemp, and the cotton-plant, is discussed. The fifth volume gives an account of the introduction of the cotton-plant into China in the thirteenth century, its different names, and the high value attached to it: in eighteen vols.\n\nUrh meaou\n\nA description of the bamboo, its shoots, plants, &c.; in four vols.\n\nHwa t'oo\n\n\"Drawings of flowers;\" the first of which is Fuh show, \"the Hand of Buddha,\" i.e. the flower of the citron, so called from its supposed resemblance to the hand; in one vol.\nMORAL PHILOSOPHY.\n\n*Sze* *shoo*\n\n\"The Four Books,\" consisting of the *Ta heo*, which contains literature suited to adults, as the title indicates; the *Chung-yung*, the constant (golden) medium; the *Shang-lun* and the *Hea-lun*, which comprise the conversations of Confucius with his disciples, his instructions to the governments of his day, his maxims, &c.; the *Shang Mäng* and *Hea Mäng*,—that portion of the work which was composed by Mencius, whose name it bears, and who flourished about 150 years later than his prototype Confucius, or B.C. 350. The \"Four Books\" are six thin volumes,—the title being derived, not from the size of the work, but from the number of the philosopher's disciples, four, who compiled their master's sayings.\n\n*Sze* *shoo* *kwan* *hwa*\n\n\"The Four Books,\" in Mandarin, in one vol.\n\n*Sze* *shoo* *ho* *keang*\n\nThe preceding Four Books, with the Commentary of *Choo-He*, and a general paraphrase composed of extracts from various commentators; in six vols.\nSze shoo tseih choo\n\nThe same work as the preceding, without the paraphrase, but having the comments of Choo-foo-tsze, the well-known moral philosopher and historian, who lived in the twelfth century: in six vols.\n\nLun yu e soo\n\n\"The Sentiments of the Lun yu expanded.\" A commentary on the first of the \"Four Books;\" in five vols.\n\nChoo foo tsze tseuen shoo\n\nThe whole works of Choo-foo-tsze, the celebrated commentator on the \"Four Books,\" moral philosopher and historian, who flourished in the twelfth century: in twenty-eight vols.\n\nShing yu kwang heun\n\n\"The Sacred Edict.\" \"A book of political moralities, composed by a late emperor, and paraphrased by a vice-governor of a province. On the 1st and 15th of each month, or the new and full moon, the principal officers of the province assemble in a hall, and listen to an officer of government mounted on a table, who rehearses memoriter, a section of this work, first in Chinese, and next in the Tartar language, for the benefit of the soldiers who attend.\" (Morrison.) Translated by Dr. Milne.\nHwang ming che shoo\n\nA work on filial piety, in twelve vols.; the title of which is, \"The Imperial Ming dynasty's Book of National Regulations.\"\n\nWan te tseuen shoo\n\nThe whole works of Wan-te, comprising essays on the regeneration of the people, filial piety, prosperity, rewards and punishments, together with sacred edicts and other matters; in eight vols. Two copies.\n\nJin sang peih tuh\n\nA work on filial piety, in two vols., entitled \"Man's Life must be Read.\"\n\nFan yih sze shoo\n\nThe \"Four Books,\" translated into the Manchow-Tartar language by order of the emperor: in six vols.\n\nSih keae luh\n\nRestraint of the passions recommended: in two vols.\nKing foo sin shoo\n\nA new book to excite the attention of the rich, in six vols.\n\nTaou tih king\n\n\"The Sacred Classic of Reason and Virtue.\" A work of the philosophical sect of China, founded by Laou Keun tsze b.c. 500, which is much esteemed among the disciples of that school: in two vols.\n\nLuh sze pe keuē\n\nThe secret mysteries of official emolument and posterity: in one vol. Compositions partly literary and partly moral in their character. Probably a series of prize essays.\n\nChung yung kwan hwa\n\nThe Golden Medium,—the second of the \"Four Books\" of Confucius, according to the Mandarin dialect; in one vol.; published at the Capital.\n\nK'eun chin choo shuh\n\n\"A Narrative of certain Worthies of the sect of Taou,\" in one vol. The designation especially applies to the eminent of that school, who, being denuded of their corporeal figure, become a kind of spiritual genii.\nShing king kwang yih\n\n\"Sacred Classics.\" A sort of metaphysical treatise on the two original powers in nature—Heaven and Earth—with moral lessons deduced from the subject; in one vol. Two copies.\n\nKwang shen wei han\n\n\"Moral virtues extended.\" A collection of treatises on various subjects in moral philosophy. Published by imperial authority; in two vols.\n\nT'seih sew luy kaou\n\nSeven Essays. The subjects are:—Heaven and Earth; National Affairs; Righteous Principles; Test of Truth; Poetry; Men and things; and Marvellous Satires: in seven vols.\n\nChwang Tsze nan hwa\n\n\"The Southern Flowers of Chwang Tsze,\" a celebrated philosopher, whose works, according to the author of Notitia Linguæ Sinicæ, rank next to the \"Four Books.\" He is much praised for elegance of style by Premare, who often quotes him: in three vols.\nKwăn heŏ ke wăn\n\n“Laborious Learning and Digested Knowledge.” A compendium of metaphysical and moral science, in fourteen vols.\n\nTsze che sin shoo\n\nA work on Political Economy, embracing a variety of topics pertaining to the authority of the legislature, and the supposed well-being of its subjects; the title of which may be rendered, “A new book on things necessary for use, and good government.” Two copies having the same title, the one consisting of ten, the other of seven vols.\n\nKea paou tseuen tseih\n\n“A Collection of Domestic Jewels.” A work containing a hundred negative precepts on personal and relative behaviour, besides instructions of a miscellaneous nature suited to families. It was published in the reign of Kang He, probably by a domestic tutor, who was a disciple of Fŭh: in thirty-two vols.\n\nFŭh hwuy tseuen tseih\n\n“A complete Book of Happiness and Mercy.” A work on political morality, by the emperor Këen-lung; and entitled Këen-lung’s Government Tables: in eight vols.\nKung Tsze kea yu\n\n\"Kung, the philosopher's personal narrative, or domestic instructions.\" A record of Confucius's life and sentiments, taken from his lips by his disciples: In two vols.: two copies.\n\nT'ae shang kan ying pëen\n\nA well-known essay of the sect of Taou on virtue and vice, inducing rewards and punishments, entitled, \"The Influence of Human Conduct on the Great Supreme,\"—an epithet applied to the founder of the sect, to whom this work is attributed, although it was not known in the world until several hundred years after his time. It contains many excellent precepts, and also some medical advice, which is not uncommon in books on moral subjects. It was first published in the thirteenth century, under the patronage of the Emperor Le-tsung, who gave a million pieces of brass coin to pay for the original edition: in two vols.\n\nWan shen t'ung kwei\n\nAll virtues have the same consummation; in two vols.\nMETAPHYSICS AND GENERAL SCIENCE,\nARTS, &c.\n\nYih  king\n\nThe third of the \"Five ancient Classics,\" which contains an account of the science of numbers, consisting of the changes, combinations, and transmutations that take place in nature, by the operation of which all the effects in the visible universe are produced. According to this system, chaos is divided into two parts, light and darkness, perfection and imperfection, male and female, to which powers numbers are made to correspond, in a manner not dissimilar to the Pythagorean theory of the principles of all things: in two vols.\n\nLuy  king\n\nThe origin and laws of the Universe explained, with a commentary; in fifteen vols.\n\nT'ae  heun  pëé  heun\n\nPrinciples relating to the origin of the universe stated and discussed, together with figures explanatory of the system: in five vols.\nLuy king t'oo yih\n\nA similar work to the preceding, together with figures of the \"Three Powers\"—Heaven, Earth, and Man: in six vols.\n\nSan t'sae t'oo hwuy\n\nA collection of plates representing the three great powers in nature, Heaven, Earth, and Man, under which every department of knowledge is included. A celebrated Encyclopedia published during the Ming dynasty.\n\nTsing she\n\nHistory of Nature, in twelve vols.\n\nYuen keen luy han\n\n\"A profound treatise on universal science.\" A work published by imperial authority, on the Heavens, the Earth, the Air, and the Sea, their inhabitants, productions, and other phenomena. It also treats of political and moral duties, contains an historical account of ancient offices and titles of nobility, describes the nature of good government, and the rules whereby it may be carried into effect. The whole work comprises 153 vols.\nTsëen k'ëo luy shoo\n\nTruth profoundly investigated in several departments:—a sort of Encyclopedia Sinensis, in sixty vols.\n\nSing le ta t'seun\n\nA complete system of the principles of nature, published early in the fifteenth century. This work contains a full exposition of Chinese theories on the origin of the Universe, Chaos, the Monad, Dual, and Triad powers in nature, the production of matter, mind, spirit, and organized forms of every description: in twenty vols. Also a smaller edition of the same work, in six vols., 12mo.\n\nLûh hõ nuy wae so yen\n\nA consecutive account of men and things within and beyond the six points—East, West, South, North, the Zenith, and the Nadir: in twelve vols.\n\nChow yih chë chung\n\nOne of the chief commentaries on the Chinese Classics, published by K’ang-he towards the close of his reign: in twelve vols.\nKoo wăn ya ching\n\nElegant and accurate ancient literature, in eight vols.; published in the reign of Këen-lung.\n\nWăn chang yew he\n\nLiterary recreations, prize essays, &c.; in four vols.\n\nSwan fâ tung tsung\n\n“A treatise on the art of numbering,” arithmetic, one of the six polite arts of the Chinese; in five vols. The other five arts are, decorum, music, archery, chariot-driving, and writing.\n\nShan hae king\n\n“The Classic relating to mountains and seas,” within and beyond the limits of the empire,—east, west, south, and north: in twenty vols. It ranks next to the Classics of Confucius with the learned.\n\nTa lûh jin\n\nA book on fortune-telling by means of astrology, entitled the Six Astronomical Signs: in thirteen vols.\nFoo chow kǒ yang\n\nA manuscript account of certain spells or charms to which the Chinese of the sects Fuh and Taou attach power to expel evil spirits and noxious influences. \"The Foo,\" Dr. Morrison says, \"answer to those amulets or charms which consist in certain words or sentences written in a particular order, and which the Arabians called Talisman.\" Some of these the Chinese wear about their persons, or paste on the lintels and posts of their doors, as preventives of disease and other evils. Such charms as are curative they write on paper, which being burnt is put into a cup of tea and drunk by the patient. In one vol.\n\nWan fǎ kwei tsung\n\nTen thousand laws or precepts reverting to one point. An explanation of omens, charms, &c.: in five vols.\n\nSze k’oo t’seu’en shoo\n\nA catalogue of the Imperial library,—a great national collection of books, published in the thirty-ninth year of Këen-Lung (A.D. 1774): in eight vols.\nKeae tsze yuen hwa chuen\n\n\"Paintings of the Mustard-Seed Garden Narrated.\" A treatise on painting and drawing, including natural objects, those of art, &c.: in thirteen vols.\n\nHwa too yuen\n\nA similar work to the preceding, entitled \"drawings and plates connected:\" in four vols.\n\nTëen wän leih le ta tseuen\n\nA general outline of the principles of astronomy: in six vols.\n\nKaou how mung k'ew\n\nA work on Astronomy, explaining the computed distances of the Heavens from the Earth, comparative size of the Sun and this Globe, general nature of the planetary system, and other celestial phenomena: in four vols. The author, who is a Chinese mathematical instrument-maker, acknowledges his obligations to the books of Europeans, published by Imperial authority. He also gives directions for making sun-dials and clocks, with plates. His work was first published about the close of the last century.\nChuē pih k’ew\n\nTwelve works of this title, of four vols. each, containing descriptions of Chinese manners, customs, ceremonies, &c. Published in the forty-sixth year of Kœen-lung. From the title, “the band in white skin garments,” there would appear to be allusion to bands of fencers anciently employed in Chinese courts.\n\nKew wăn chwang kung tseih\n\nA general collection of themes on moral and literary subjects, in five vols.\nANTIQUARIAN RESEARCHES.\n\n*Tseih koo tse chung ting ke*\n\nA description of ancient bells, metal vases, tripods, and vessels of porcelain manufacture: in four vols.\n\n*Tseuen che*\n\nA manuscript account of ancient coins, in two vols.\n\n*Po koo t'oo*\n\nDrawings of ancient vessels and instruments, &c., in eighteen vols.\n\n*Koo yŭh t'oo*\n\nA work containing descriptions of ancient vessels, weapons, insignia, &c., with plates, in six vols.\nOFFICIAL PUBLICATIONS OF THE CHINESE GOVERNMENT.\n\nTa tsing tsin shin tseuen shoo\n\nA work containing a list of all the civil and military officers of the Empire, a new edition of which is published quarterly:—the Red Book of China, which furnishes rules of etiquette to be observed between members of government in their official intercourse: in sixteen vols. Also three copies of other editions, in four vols. each, designated sew chin, \"sleeve pearls,\"—a term appropriated to any small book that is thought to be valuable, from the circumstance of the Chinese carrying it in the sleeve of their garments, instead of the pocket.\n\nShe hëen shoo\n\n\"The Imperial Almanack.\" Three copies: one for the eleventh year of Yung-ching, A.D. 1733; another for the sixtieth year of Këen-lung, A.D. 1795; and two others for the twelfth and sixteenth years of Kea-king, A.D. 1807 and 1811.\nKing chaou\n\nThe Pih-king Gazette in manuscript, containing edicts from the emperor, and communications addressed to him from the governors of the different provinces throughout the Empire.\n\nRITES AND CEREMONIAL USAGES.\n\nLe ke\n\nThe fourth of the \"Five Ancient Classics,\" in thirty-eight vols., which treats principally of the customs prevalent during the three most celebrated dynasties of China,—Hea, Shang, and Chow; but also contains rules for the observance of suitable etiquette, on civil, military, social, and religious occasions, as well as regulations adapted to private intercourse.\n\nSan le t'oo\n\nDrawings for the purpose of illustrating the subjects discussed in the Le-ke: in two vols.\n\nLe shoo kang muh\n\nA general description of rites and ceremonies. Incomplete.\nKëen pun le ke\n\n\"The Revised Original Le-ke,\" in ten vols. The same work as the preceding Le-ke, or \"Record of Ceremonies and Rites\"—the word *Le* signifying decorum, propriety, politeness, reverence—whatever is becoming in individuals, families, or worshippers of the gods.\n\nChih tûh luy seuen\n\nSelect specimens of cards of congratulation, forms of condolence, invitations, addresses, expressions of gratitude, &c., &c.: in twelve vols.\n\nKeang low chih tûh\n\nA work similar to the preceding, in ten vols.\n\nChow she kin wang\n\n\"Intercourse with the World in an Embroidered Purse.\" A work containing models for inscriptions over doors, &c.; eulogies on deceased relations; benedictions; congratulatory odes; family ceremonies; complimentary addresses; forms of bonds and covenants: also notices of the public roads of the Empire, and of the sources of the lakes on the Yangtsze-keang, one of the principal rivers of China; with other miscellaneous information of a polite and literary character: in twelve vols.\nJURISPRUDENCE.\n\nPō gnan sin pēen\n\nA new compilation of cases in law, wherein the decision of an inferior court has been reversed by a superior tribunal; from the first year of Kéen-lung’s reign to the period of publication: in thirty-two vols. Also another edition, in twenty vols.\n\nTa tsing hwuy tēen tsih le\n\nA collection of the laws, statutes, and by-laws, of the Chinese Empire, under the Tartar dynasty, in 121 vols.; entitled “The Collective Canons, Precepts, and Emendatory Clauses of the Great Pure (Manchow-Tartar) Dynasty.\n\nTa tsing hwuy tēen\n\nGeneral statutes of the Chinese Empire, enacted under the present Tartar dynasty;—a work which contains a detailed account of the existing government in every department: in twenty-four vols.\nLuh poo tsih le\n\nThe laws of the six supreme courts, or boards, at Pih-king: these are, the Boards of Appointments, of Revenue, of Ceremonies, of the Army, of Punishments, and of Public Works: in thirty-six vols.\n\nHing poo tsih le\n\nThe laws of the tribunal of punishments, or court of appeals at Pih-king, which takes cognizance of all criminal cases: in two vols.\n\nTa ming hwuy tœen\n\nThe collective canons of the Great Ming dynasty (the general laws of the Empire at that period), which was the reigning family when the Manchow-Tartars subjugated China: in forty-eight vols.\n\nTa tsing leüh le\n\nThe laws of the Imperial Tartar dynasty—the Penal Code of the Chinese Empire: in twenty-four vols.; and a smaller edition in twenty vols. This work has been translated into English by Sir G. T. Staunton, Bart., &c.\nHoo poo tsih le\n\nThe laws of the Board of Population, which is also the Board of Revenue arising from the People: in six vols.\n\nTeaou le yō pēen\n\nA general compilation of precepts and regulations, or Imperial declarations, ordinances, instructions, &c., collected and arranged in seventy-eight vols. The term teaou le signifies those additional or modifying laws which are framed by successive Emperors, in contradistinction from those denominated leūh, and attributed originally to Seaou-ho, who lived B.C. 200. The laws of China altogether are said to be upwards of 2000 in number.\n\nHae shwuy gnan\n\nCases in law pertaining to the district Hae Shwŭy: in six vols.\n\nFă kea king tiēn luy\n\n\"The Legal Profession arousing Heaven's (the Imperial) Thunder.\" A work of similar character to the following: in one vol.\nFa kea t'ow tan han\n\nA treatise on the laws. The legal profession is not allowed to be practised in China, as it is in England; but there are expositors of the law, of whom is the author of this volume, entitled \"The Legal Profession penetrating the coldness of the Liver,\" a title founded on the Chinese notion that the liver is the seat of courage, and intended to convey a strong impression of the authority of the laws: in one vol.\n\nFa yu kin nang\n\nAn exposition of the laws in an embroidered purse—a figurative expression for what contains excellent thoughts in an ornamented style: in six vols.\nMEDICAL SCIENCE.\n\nE tsung kind keen\n\n\"The Medical Profession's Golden Mirror.\" A celebrated treatise on medical science, in forty vols. It was compiled during the reign of Këen-lung, about the middle of the eighteenth century, by a hundred persons, connected with the Imperial College of Physicians at Peking, and is probably the latest national publication on the subject. All existing treatises, procurable in print or manuscript, were collected by order of the Government, in aid of the design, and for the purpose of being consulted by the editors. The work was completed in four years.\n\nT'ae soo mih\n\nA medical work on the pulses of the human frame, with introductory remarks on the powers of nature, their order, subordination, &c.: in one vol.\n\nLing choo king\n\n\"The Spiritual or Intellectual Hinge,\" a medical work, in six volumes, attributed to Ke-pih, an antediluvian statesman—one of three celebrated personages of that period, distinguished for their medical knowledge.\nShang han san shoo hō peih\n\nA treatise on diseases arising from cold; in three parts, consisting of four vols. The title \"Shang-han,\" injured by cold, comprehends all diseases produced by checked perspiration—especially fevers—exposure to marsh miasmata, damp air, or cold. In the former parts of this work, comprising the three first volumes, the author traces the symptoms of disease in the state of the patient's tongue, the sound of his voice, &c.; and in the last part, or fourth volume, he prescribes suitable remedies.\n\nHwang te nuy king soo wăn\n\nA medical work denominated, \"The plain Questions of the Emperor's Domestic Classic.\" This and the preceding treatise, named Ling choo, are considered the most ancient in China, on the causes and treatment of disease. Yen-te or Shin-nung, \"the divine husbandman;\" Ke-pih, the author of Ling-choo; and Hëen-yuen, or Hwang-te; formed a sort of royal society for medical purposes, in the earliest ages of the world. The present treatise is said to embody the results of certain consultations between the two last-mentioned personages on the subject of splanchnology; and, as well as the Ling-choo, to recognise the doctrine of the circulation of the blood—a theory with which modern practitioners in China are not well acquainted: in six vols.\nSëë she e gnan\n\nSëë-she's collection of medical cases: in thirty-two vols.\n\nShang han san choo\n\nThe three commentaries on the injurious effects of cold; or fever produced by checked perspiration: in five vols.\n\nChin kew pă tsuy ta ching\n\nA work on cautery, the origin of which is ascribed to Ke-pih, the author of the \"Intellectual Hinge.\" This treatise appears to refer to actual cautery, from the term employed in the title-page, which denotes that the operation is performed by an iron instrument. Nine different instruments are also represented by figures in the body of the work. The Chinese are, however, acquainted with potential cautery, effected by moxa, which they denominate gnae tsaou. The subjects in this work are arranged according to the three powers—Heaven, Earth, and Man. Its title might be rendered, \"Eminently Conspicuous Instances of Success in Cautery:\" in seven vols.\nChin kew tseu ying\nAnother work on the same subject, in eight vols.; both are written in Japanese as well as Chinese.\n\nKing yo tseun shoo\nThe whole works of King-yo, a medical writer of considerable eminence in China during the fifteenth century: in twenty-four vols.\n\nLing ching che nan e gnan\nA correct medical guide, founded on extensive practice; in twelve vols.\n\nShang han peen ching lah\nRecords of the symptoms of fever occasioned by checked perspiration. A medical work on colds, in fourteen vols.\n\nChung tow kee shoo\nA tract on vaccination, by the late Alexander Pearson, M.D., of Canton, and translated into Chinese, with the assistance of occasional reference to the natives, by Sir G. T. Staunton, Bart., &c., &c.\n\nE lin che yue\nA medical work, in fifteen vols. A publication of the Imperial College of Physicians at Peking.\nMAPS, PLATES, DRAWINGS, &c.\n\nKwang yu ke\nA new edition of large maps, in thirteen vols.; comprising also topographical and statistical details.\n\nKwang yu t'oo\nExtensive maps and drawings; in four vols.\n\nHwang tsing chih kung t'oo\nPlates of tributary offerings rendered to the Imperial Tartar dynasty; in nine vols.\n\nYu che kang chih\nPlates of ploughing and weaving, by Imperial rescript; in one vol., quarto.\n\nTa ho ming so t'oo hwuy\nA general and uniform collection of plates of celebrated places; in six vols.\nBUDDHISM, or THE RELIGION OF FUH.\n\nShen mun jih sung tseuen tseih\n\nA complete collection of daily recitatives for the use of the disciples of Fuh (Buddha); in one vol. These and similar compositions are chanted, or read in a tone peculiar to the Buddhists, for the purpose of propitiating their deities, and procuring the pardon of sin.\n\nSoo fang hwa shen sze\n\n\"Plain, fragrant, elegant teachers of the contemplative doctrine.\" A book on Buddhism, in two vols. The third character (hwa) is frequently used in titles of superior books of this sect; it is also a designation of China.\n\nHwa yen king\n\nA large work of the sect of Buddha, published by Imperial authority early in the fifteenth century; probably a translation of the Boodū Pooranū, mentioned in Ward's Hindoo Mythology (Morrison). The title of the book translated literally would be, \"The elegant, venerable Classic:\" in sixteen vols., large 8vo.\nLăng yen ching mih soo\n\nLăng-yen's correct vein of thought expanded: in six vols. Lăng is a Tartar word; Yen is the same as the second character of the preceding title—a work on Buddhism.\n\nLăng yen king tseih choo\n\nGeneral comments on the Classic Lăng-yen—the same title as the preceding; in five vols.\n\nJin tïen yen mûh\n\n\"The Eyes of Men and Heaven.\" A work on Buddhism, in two vols.\n\nLûh taou tseih\n\n\"The Six Ways or Doctrines;\" in two vols. A work of the sect of Fûh.\n\nK'e sin lun\n\n\"The Origin of Faith Discussed,\" or according to another title, Hwa yen tsung fû, \"The excellent, venerable, authoritative precepts.\" A work on Buddhism, in two vols.\nLeih seang kaou ching\n\"Successive transformations accomplished.\" A work of the Buddhists, published by Imperial authority: in sixteen vols.\n\nFūh mun ting che\nThe standard laws of the religion of Fūh; in four vols.\n\nKeae shă fang săng wăn\n\"Guard against Killing, and spare Life.\" An essay of the Buddhists on the preservation of animal life as a moral duty: in one vol.\n\nFūh ting tsze lūh\nA Buddhistic work with plates, representing the metempsychosis: in twelve vols.\n\nYūh leih chaou chuen king she\nA work on Buddhism.\nTHE THREE SECTS.\n\nSow shin ke\n\nA treatise on the gods of the Three Sects—the learned, the philosophic, and the Buddhist—with an account of the transformations peculiar to the last: in one thick vol., 8vo.\n\nSan keaou sow shin\n\nA work similar in its nature to the preceding, in three vols.; entitled \"The Three Sects—that of Confucius, Buddha, and Taou-sze—investigating their deities.\"\n\nFung shin yen e\n\nA treatise on the gods of China; in ten vols.\nTRANSLATIONS OF THE SACRED SCRIPTURES INTO CHINESE:—ROMAN CATHOLIC, AND PROTESTANT THEOLOGY, TRANSLATIONS, &c.\n\nSin wei chaou shoo\n\nThe New Testament, translated by Dr. Morrison into Chinese; in eight vols., 8vo. Published A.D. 1815. Also the Epistles of James, John, Peter, and Jude, with the Apocalypse.\n\nShing king\n\nA translation of the Old and New Testaments, by Dr. Marshman; in five vols., 8vo. Printed with metal types at Serampore.\n\nShin têen shing shoo\n\nThe Old and New Testaments translated by Dr. Morrison: a new edition, 8vo., published A.D. 1832. Also a copy of the first edition, published A.D. 1823: in twenty-one vols.; printed with wooden blocks, or plates.\n\nLing hwăn pëen\n\nAn Essay on the Nature, Immortality, Value, and Destiny, of the Human Soul, by Dr. Milne, late of Malacca: in two vols., 12mo.\nChin taou tsze ching\n\"The Truth its own Witness.\" A tract on the evidences of Christianity, by a Roman Catholic Missionary: in one vol. Published in the reign of Kang-he, A.D. 1718.\n\nWan wuh chin yuen\n\"The true Origin of all Things.\" Probably a Roman Catholic work: in one vol.\n\nShing shoo tsëé keae\nA Commentary on the Epistle to the Ephesians, by Dr. Milne; in two vols., 8vo.\n\nChin shin ching keu\nPaley's Argument for the Being of God, translated into Chinese by Dr. Morrison; in one vol. Lithographed.\n\nThe Gospel of Matthew in Manchow-Tartar; in one vol.\n\nShing shang mih seang\nSacred Sorrow and Silent Meditation; in one small vol. A Roman Catholic work.\nWORKS OF FICTION.\n\nHung low mung\n\"The Dreams of the Red Chamber.\" A novel of considerable repute in China, the style of which is colloquial in the Pih-king dialect: in twenty vols.; two copies.\n\nT'aou hwa shen\n\"Peach Blossoms Expanded.\" A novel, in four vols.\n\nT'een yu hwa\n\"Heaven's Rain and Flowers.\" A novel published in the reign of Kea-king: in thirty vols.\n\nTe - yih k'e shoo\n\"The Most Wonderful Book.\" A novel, in twenty vols. Composed by a disciple of Fang-chow's, and published in the reign of Kang-he.\n\nFun chwang low\n\"The Painted Chamber.\" A novel, in twelve vols.\nKin hing mei chuen\n\n\"The Golden-potted Plums Narrated,\"—another copy of \"The Most Wonderful Book,\" with a different title; both works containing a description of Chinese manners and customs, especially with reference to courtships and marriage, the design of which, according to the preface, is to promote virtue, and discourage vice.\n\nShih tsing ya tseu\n\n\"The Pleasures of a Tranquil Disposition,\" or the eighteen transformations of the păng—a fabulous bird transformed from a fish of an immense size; several thousand Chinese miles in extent; at every frisk or leap it rises 90,000 miles, and hence it is used to denote rapid promotion (Morrison): in two copies, five vols. each.\n\nShin low che\n\nAn account of a visionary monster seen at sea, said to be like a snake with horns, and like a dragon, in the lower part of the body, having scales; sometimes assumes the form of a watch-tower. (Morrison's Dic.): in six vols.\n\nKin koo ke kwan\n\nAncient and modern wonders; in ten vols.\nHaou k'ew chuen\n\n\"A Narrative of a Happy Courtship.\" This work has been translated into English under the title of \"The Fortunate Union,\" by J. F. Davis, Esq.: in four vols.\n\nYuen jin pih chung\n\nThe celebrated hundred comedies of the Yuen dynasty; in forty vols.\n\nTe pa tsae tsze or Tsing tsing tse\n\n\"Stillness and Purity perfected.\" A novel of the eighth grade of talent. There is a class of Chinese works of fiction designated, irrespective of the style, according to the degree of interest excited by the subject—from the first or highest, through the intermediate gradations, to the tenth or lowest degree of talent.\n\nTe t'seih tsae tsze\n\n\"The Seventh Genius.\" A novel of the seventh grade of talent, adorned with cuts: in six vols.\nPih kwei tseuen chuen\n\n\"The White Sceptre perfectly narrated.\" An ancient badge of authority bestowed by the emperor on the governors of provinces. A novel of the tenth grade: in four vols.\n\nMow tan ting hwan hwän\n\n\"The returning spirit of the dome of Mow-tan,\" the peonia, designated by the Chinese \"the king of flowers.\" A novel founded probably on a belief in apparitions, which prevails extensively among the Chinese: in six vols.\n\nT'ang p'ing kwei tseuen\n\n\"The just spirit of T'ang (name of a celebrated dynasty) perfected.\" A novel of the ninth grade of talent: in two vols.\n\nKin shih yin yuen\n\n\"The marriage union of Metal and Stone.\" A narrative of courtship and marriage between parties whose names are kin, \"metal,\" and shih, \"stone;\" with remarks on the properties of these substances, as applicable to husband and wife: in six vols.\nTe sze tsae tsze\nA novel of the fourth grade of talent; in four vols.\n\nTaou ke këen ping\nCriticisms and satires; in ten vols.\n\nSew seang urh too mei\nA work of fiction written in the colloquial style, and adorned with plates: in six vols.\n\nMwan Han se seang ke\n\"Tartar and Chinese western apartment recorded:\" A comedy, the author of which is one of the six writers pre-eminently distinguished among the Chinese for natural genius and elegance of style: in four vols.\n\nTe san tsae tsze\nA novel of the third grade of talent; in four vols.\n\nLeaou chae che e\nA romance designated \"the fortuitous narration of strange occurrences,\" which, it has been thought, resembles the \"Fairy Queen\" of Spenser. It appears to be the object of the author to depict the transitory nature of earthly things. Two copies, sixteen vols. each, 12mo.\nTRAVELS, &c.\n\nHea kih yew ke\n\nTravels by land and by water recorded: in sixteen vols. The Chinese consider visits to the principal parts of the Empire, as necessary to complete the education of a gentleman, but do not go beyond the boundaries of their own country.\n\nChow king pei lan\n\nA complete tour of the Empire, or observations made in travelling by land and by water: in six vols.\n\nSe yew chin tseuen\n\nThe western traveller's correct instructor; in twenty vols.\n\nBOOKS FOR YOUTH.\n\nYew heo she\n\nRhymes for the instruction of youth; or, studies in poetry suited to the age of ten years: in one vol.\nYew heŏ keu keae\n\nEasy sentences for the instruction of youth, on miscellaneous subjects: in one vol.\n\nTung yuen tsă tsze\n\nMiscellaneous literature of the eastern garden—a book for children: in one vol.; two copies.\n\nYew heŏ tsă tsze\n\nMiscellaneous kinds of youthful instruction—a book for children: in one vol.\n\nShing leŭh ke mung tsŏ yaou\n\nLaws of sound, for the use of boys, in two parts, each containing fifteen different words to practise upon: in one vol.\n\nYew heŏ koo sze keung lin\n\n\"The Coral Forest of Ancient Lore for the Instruction of Youth.\" An abstract of ancient learning, containing also a parallel between ancient and modern titles of office, with some of the complimentary and poetical terms applied to persons holding particular offices, together with a compendium of moral duties, designed for youth: in two vols.\nMISCELLANIES.\n\nTuug se yang kaou mei yuē\n\"Eastern and Western Ocean's monthly investigations, by the Rev. C. Gutzlaff.\" A monthly periodical on miscellaneous subjects; in one vol.\n\nToo săng kung gnan\nAn account of murders, suicides, and executions; in three vols.\n\nTsoo nan she tēē\nRecords of literary examinations in prose and verse, for the district Tsoo-nan; in one vol.\n\nPing lūh\n\"Military records,\"—a work on the art of war; in twenty-four vols.\n\nPing yuen sze pēēn\nThe art of fortification; in five vols.\n\nKin seang yuē\nMonthly cuts; in one vol.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/b30092802.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 72, "total-input-tokens": 93116, "total-output-tokens": 13460, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 163, 5], [163, 163, 6], [163, 879, 7], [879, 879, 8], [879, 1420, 9], [1420, 2064, 10], [2064, 2749, 11], [2749, 3603, 12], [3603, 4355, 13], [4355, 4845, 14], [4845, 5406, 15], [5406, 5986, 16], [5986, 6834, 17], [6834, 7477, 18], [7477, 8396, 19], [8396, 9158, 20], [9158, 9695, 21], [9695, 10224, 22], [10224, 10757, 23], [10757, 11367, 24], [11367, 12042, 25], [12042, 13032, 26], [13032, 14081, 27], [14081, 14732, 28], [14732, 15607, 29], [15607, 16424, 30], [16424, 17417, 31], [17417, 18337, 32], [18337, 19180, 33], [19180, 20047, 34], [20047, 20890, 35], [20890, 21614, 36], [21614, 22545, 37], [22545, 23438, 38], [23438, 23866, 39], [23866, 24297, 40], [24297, 25172, 41], [25172, 25947, 42], [25947, 26956, 43], [26956, 27702, 44], [27702, 28512, 45], [28512, 29323, 46], [29323, 29924, 47], [29924, 30905, 48], [30905, 32199, 49], [32199, 33091, 50], [33091, 33927, 51], [33927, 34439, 52], [34439, 35347, 53], [35347, 35999, 54], [35999, 36518, 55], [36518, 36967, 56], [36967, 37786, 57], [37786, 38447, 58], [38447, 39023, 59], [39023, 40004, 60], [40004, 40741, 61], [40741, 41586, 62], [41586, 42412, 63], [42412, 43014, 64], [43014, 43848, 65], [43848, 44400, 66], [44400, 44400, 67], [44400, 44400, 68], [44400, 44400, 69], [44400, 44400, 70], [44400, 44400, 71], [44400, 44400, 72]], "primary_language": ["None", "None", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]