[{"id": "4f7103531350c086190de19b32f4fe7219b3b82e", "text": "Royal Asiatic Society\nNorth China Branch\n\nExhibition of Chinese Paintings\nFrom the Collection of\nHerr Rudolf Mahnfeldt\n\nJune 7-9, 1912\nIn the Building of the Society\n5 Museum Road\nShanghai\nNotes on the Periods of Chinese Painting\n\nTang Dynasty 600-900\n\nVery few genuine specimens are left and it is very difficult to get a clear impression of what the great masters of the Tang Dynasty achieved. The prominent masters are Wu-tao-tzu, the greatest of Chinese painters; Li-ssu-hsin, the founder of the northern school of landscape painters; and Wang-wei, the painter of romantic landscapes of the southern school.\n\nFive Dynasties 900-960\n\nSung Dynasty 960-1280\n\nThis, the classical period of Chinese painting, is characterized by grandeur of conception, simplicity of style and power of interpreting the soul of nature. The most famous names are Li-ying-ch'iu, landscapes full of soul; Tung-yuan, rainy landscapes; Li-lung-mien, religious subjects; Su-tung-po, bamboo sketches in black and white; Mi-fei, landscapes; Emperor Sung-hui-tsung, birds, especially falcons; Chao-po-kü, human figures and landscapes; Mu-chi, tigers; Ma-yuan and Hsia-kuei, landscapes.\n\nYuan Dynasty 1280-1368\n\nThis period has not the grandeur of conception of the Sung. Its paintings are of a more delicate and idyllic style. The most noted artists are Chao-tzu-ting, horses and landscapes; Chien-hsian, human figures, flowers and birds; Huang-kung-wang, Kao-ko-kung and Waug-meng, landscapes.\n\nMing Dynasty 1368-1644\n\nThis is the romantic period. The composition is in general not centralized. There is growing individuality of style. The objects depicted are full of spirit and life. Amongst more than twelve hundred artists there are T'ang-yin, the most famous of all Ming painters; Ch'i-ting-ying, the distinguished copyist; Shên-chou, landscapes; Wên-cheng-ming, the great colourist, in landscapes; Lü-ki, famous for flowers and birds; Tung-ch'i-ch'ang, foremost in landscapes; Lu-pao-shan, flowers and birds and landscapes; and Ting-yün-p'êng, landscapes, figures and portraits.\nTs'ing Dynasty 1644-1912\n\nThe Kang-hsi paintings superficially looked at somewhat resemble those of the Sung period, but they lack the soul of the sublime paintings of that classic period. In the Chien-lung and the later periods there are many talented masters, but their ability seems to be of a technical nature and their works give the impression of decorative art.\n\nKANG-HSI. 1662-1723 The famous artists are the four Wangs, especially Wang-shih-ku; Yün-nan-t'ien, as a flower painter; Sin-lo-shan-jön, for flowers and birds and Ch'a-shih-piao for landscapes.\n\nYUNG-CHENG. 1723-1736. Kao-chi-p'ei, a famous finger painter.\n\nCHIEN-LUNG. 1736-1796. Tung-pang-ta, landscapes; Pien-shou-min, geese and ducks.\n\nKIA-CHING. 1796-1821. Min-chen, scenes of life, flowers and birds.\n\nTAO-KUANG. 1821-1851 Wang-hsiao-meo, a famous copyist.\n\nPRESENT PERIOD. 1851-1912.\n\nGeneral Note\n\nIn ascribing a painting to a certain artist, as the Collector has done in the following descriptive list, he would observe, as is well known, that Chinese experts consider the inscription upon a painting and even the use of the seal of the artist to whom the painting is ascribed as indicating not so much its authenticity as its fidelity to the style of the artist named.\nThe Paintings\n\nTang Dynasty 600-900\n\n1 Wang-wei 王維 Spring landscape\n\nIn the foreground willow trees, a summer-house, a creek and a fisherman plying his trade; in the background a gigantic range of mountains. The picture is full of \"Stimmung\"; it is a good example of Wang-wei's art. Chinese writers say that Wang-wei's pictures were like poems and his poems like pictures.\n\nThe picture bears at the top lengthy inscriptions by Chao-tzu-ang, Tung-chi-chang, Wên-chêng-ming and Wang-shih-ku, which seem to be genuine. Of the originally vivid green colours of the mountains dark green shades only are left.\n\n2 Wu-tao-tzu 吳道子 Mythological scene\n\nIt must be regarded as an impossible thing to find any genuine pictures by Wu-tao-tzu in China, except perhaps in the imperial collections. This copy seems to be a rather old one, at least early Ming; but it is in a hopeless condition. It consists only of hundreds of pieces, the colours are almost completely lost and no more of Wu-tao-tzu's art can be seen than that the figures were done exceedingly well. The inscriptions at the top are illegible.\n\n3 Wu-tao-tzu 吳道子 A country house in the mountains\n\nAttributed to Wu-tao-tzu, but a Tang or early Sung copy. A country-house leans against a steep mountain slope, pines, a lake, a girl in a boat, a waterfall and rocky peaks in the background. Judging from this specimen of his art one can understand why Wu-tao-tzu is known as the greatest of Chinese painters.\nFive Dynasties 900-960\n\n4 Han-hsi 韓熙\n   A temple in a mountain valley\n   Copy made in the Ts'ing Dynasty. Interesting as showing a transition from Tang to Sung style.\n\nSung Dynasty 960-1280\n\n5 Kuo-hsi 郭熙\n   Spring landscape in Szechuan\n   Kang-hsi copy. The mountains, the water and the trees are very well executed, but the animals are without life and clumsy.\n\n6 Kuo-hsi 郭熙\n   Spring landscape\n   Copy, probably late Ming. Charming scenery. The nervous brushwork points to the late Ming period.\n\n7 Li-i'ang 李唐\n   Cloudy mountain scenery\n   Painted on paper with gold ground, partly touched up, especially in white. The contrast between the green of the gigantic mountain-ranges and the white of the clouds and the water-fall is very effective; indeed the picture might be called a symphony in gold, green and white.\n\n8 Wang-hsien 王詵\n   Lan-tchai-ho, a genius, walking over the waves\n   In black and white on silk. Note the quiet lines in the graceful figure contrasting with the lively lines of the agitated sea.\n\n9 Li-ying-ch'iu 李咸熙\n   Winter landscape\n   This painting shows in a remarkable way the disinterested love of nature which was typical of the Sung painters. It shows also their unsurpassed power of interpreting the soul of nature. A grandeur of conception dominates notwithstanding the delicacy of the details. The entire atmosphere of the painting is full of peace. This is among the best landscapes of the collection.\n\n10 Tung-yüan 董源\n    A rainy landscape\n    Very delicate work, approaching the Yüan style.\n11 Li-kung-lin 李公麟\n\nKang-hsi copy probably. A palace seen within the mist; sun sinking behind steep rocks; the god of longevity coming through the air on a heron. The faces and figures of the immortals are very well done also the palace and the whole background; but the rock in the middle-distance is without character, while the trees in the foreground have no life.\n\n12 Su-tung-po 蘇東坡\n\nA modern copy, the beauty of which lies in the various shades of black ink.\n\n13 Mi-fei 米芾\n\nRainy landscape\n\n14 Sung-hui-tsung 宋徽宗\n\nWhite falcon tied to a rock\n\nGenuine Sung-hui-tsungs are not readily found. This is a recent imitation done with the remarkable skill of the Chinese in forging old pictures.\n\n15 Sung-hui-tsung 宋徽宗\n\nAn eagle looking from a rock in the sea\n\nThe inscription says that this is a copy by Pien-ching-chao, Yüan Dynasty, after an original by Sung-hui-tsung, but it must be a modern copy after Pien-ching-chao's copy. This and the preceding number give a good idea of Sung-hui-tsung's famous art of painting birds.\n\n16 Ching-hao 趙浩\n\nAutumn landscape\n\nAlthough spoiled to a considerable extent it has not lost much of its original effect. The massive mountains are painted with an unusually powerful brush.\n\n17 Yang-wu-ch'iu 楊無咎\n\nPine-tree, bamboo and larch blossoms in the moonshine\n\nIt is apparently only a small part of an originally much larger picture, but it has a charm difficult to describe and it is in the best style of the great Sung masters.\n\n18 Chao-po-ku 趙伯駒\n\nSummer in the high mountains\n\nExcellent composition, fine colouring, especially the blue of the mountains. Full of the spirit of Sung art.\n19 Chao-po-kü 趙伯駒 Emperor Min-wang and the goddess of the moon\n\nThe goddess surrounded by five girl companions drives in a two-wheeled carriage drawn by a phoenix through the clouds. The Emperor and the three other beings standing in the air look up to her. Simple composition and very refined colouring. This painting has the charm of the old legends.\n\n20 Ma-yüan 馬遠 The eighteen Lohans\n\nPossibly a Kang-hsi copy, if not a quite modern falsification. The whole is very well executed.\n\n21 Ma-yüan 馬遠 Rain among the mountains\n\n22 Chao-ta-nin 趙大年 Mountain scenery\n\nAn imposing cone-shaped mountain having in the foreground two very fine firs.\n\n23 T'ung-kuan 童貫 A sage enjoying the beauty of a lake\n\nA copy of the Ming period. This picture is poetry materialized.\n\n24 Hsia-kuei 夏珪 The minister Sih-sü retiring into isolation\n\nBroad style showing a countryhouse among lofty mountains.\n\n25 Yen-tzu-ping 閻次平 The island of happiness\n\nThe mythical land where gold has no value and the people live in everlasting happiness.\n\n26 Pei-loh-tien 白樂天 Ti-kwa-li, one of the eight Genii\n\n27 Li-ti 李迪 The Si-hu or West Lake at Hangchow\n\nProbably a Ts'ing copy.\n\n28 Ku-chung-chiao 顧仲熙 Two herons\n\nA Kang-hsi copy.\n\n29 Wu-huai 吳懷 A dragon\n\nA Ming copy. Wu-huai was a most famous dragon painter. Note the beautiful shades of black and white and the powerful design of the animal.\nYüan Dynasty 1280-1368\n\n30 Chao-tzu-ang 趙子昂\n   A hundred horses\n   Probably a Ming copy. Very fine composition.\n\n31 Chao-tzu-ang 趙子昂\n   A horse whipped by his keeper\n   Probably Ts'ing copy. Observe the ferocity of the head of the horse.\n   The painting shows why Chao-tzu-ang is called the most famous horse\n   painter after Han-kan of the Tang Dynasty.\n\n32 Chao-tzu-ang 趙子昂\n   An emperor hunting a deer\n   Chien-lung copy.\n\n33 Chao-tzu-ang 趙子昂\n   A horse\n   Probably Kang-hsi copy.\n\n34 Chao-tzu-ang 趙子昂\n   Summer landscape\n   Kang-hsi copy.\n\n35 Tang-tzu-hua 唐子華\n   Spring in the mountains\n   Typical of the style of the Yüan period. No longer the intimate feel-\n   ing of the Sung masters, but a tendency to decoration and sentiment. The\n   composition is still coherent. The lines across the picture were caused by\n   its having fallen into water.\n\n36 C'hi'en-hsüan 錢選\n   Maku, the fairy, with a phoenix in the clouds\n   Notice the rhythm of the lines in the drapery of Maku and the\n   refined brush-work with which the bird is executed.\n\n37 Ch'ien-hsüan 錢選\n   Two pheasants on a stream in the mountains\n   Probably a Ming copy.\n\n38 Ch'ien-hsüan 錢選\n   Lameh tree with blossoms, roses, daffodils and birds\n   Probably a Ming copy.\n\n39 Ch'ien-hsüan 錢選\n   Poppies, butterflies and insects\n   A Tao-kuang copy.\n40 Ma-yih 馬逸\n\nWild geese and peonies\n\nPoetical composition; the blossoms are of rare beauty and the geese, caught in typical positions, are full of life and truth to nature.\n\n41 Huang-kung-wang 黃公望\n\nSpring in the mountains\n\nProbably Ts'ing copy. Characteristic of Yuan style.\n\n42 Pien-ching-chao 邊景昭\n\nPheasants and other birds in bamboo\n\nTs'ing copy.\n\n43 Pien-ching-chao 邊景昭\n\nTitmice in a blossoming larch tree\n\n44 Pien-ching-chao 邊景昭\n\nMagnolias and peonies\n\nVery impressive by its simplicity.\n\n45 Pien-ching-chao 邊景昭\n\nPheasants and mynah by a cascade\n\nProbably Ming copy.\n\n46 Pien-ching-chao 邊景昭\n\nA hundred quails\n\nMing copy. The original must have been still larger.\n\n47 Mi-chia-chao 米佳詔\n\nRainy landscape\n\n48 Chang-hsun 張遜\n\nSpring in the mountains\n\nProbably Kang-hsi copy.\n\n49 Sung-juh-chih 宋汝志\n\nAutumn landscape\n\nMing copy.\n\nMing Dynasty 1368-1644\n\n50 T'ang-yin 唐寅\n\nRomantic mountain scenery\n\nThis is an eminent work in the style of T'ang-yin. The dominating conical mountain in the left, the rifted rocks and the countryhouses in the foreground, the perspective of the valley in the background with the flight of ducks in the air create together a unique effect. All the line drawing seems to live. Only a proud and superior artist would have dared delineate a mountain like that on the left. If it were possible to get a genuine T'ang-yin in China, one would be inclined to regard this genuine; but it is a Ming copy.\n51 T'ang-yin 唐寅  \nThe Lu mountains in Kiangsu  \nMing copy. Quite a different side of T'ang-yin's art. Painted with black ink on paper.\n\n52 T'ang-yin 唐寅  \nA pagoda and temple in the mountains  \nTs'ing copy after an early T'ang-yin.\n\n53 T'ang-yin 唐寅  \nMarsh-mallow  \nModern copy.\n\n54 T'ang-yin 唐寅  \nAutumn in the mountains  \nTs'ing copy. Characteristic of the style of T'ang-yin.\n\n55 T'ang-yin 唐寅  \nA garden in summer  \nTs'ing copy. Very refined work. Another instance of T'ang-yin's versatility.\n\n56 T'ang-yin 唐寅  \nA sage enjoying nature  \nModern copy. The bamboo is drawn well, but not the mountains.\n\n57 T'ang-yin 唐寅  \nAutumn in the high mountains  \nKang-hsi copy. Grand composition in black and white on paper.\n\n58 T'ang-yin 唐寅  \nA river in a mountainous country, autumn landscape  \nLate Ming or Kang-hsi copy.\n\n59 T'ang-yin 唐寅  \nWang-hsi-chih returning home after a long absence  \nModern imitation.\n\n60 T'ang-yin 唐寅  \nLotus flower  \nMing copy.\n\n61 Wên-chêng-ming 文徵明  \nA harbour with many junks  \nProbably an imitation.\n\n62 Wên-chêng-ming 文徵明  \nAn autumn landscape  \nMuch injured but still showing Wên-chêng-ming's delicate brush.\n63 Tung-ch'i-ch'ang 董其昌\n   Rainy landscape\n   Probably a copy. The misty atmosphere of a rainy day is wonderfully depicted.\n\n64 Tung-ch'i-ch'ang 董其昌\n   Landscape\n   Probably a copy.\n\n65 Lü-ki 呂記\n   Nine herons\n   Lü-ki was the most distinguished painter of birds during the Ming period.\n\n66 Lü-ki 呂記\n   Two pheasants above a rapid\n\n67 Lü-ki 呂記\n   Two herons under lotus leaves\n   Modern copy.\n\n68 Lü-ki 呂記\n   Ducks falling into water\n   Chien-lung copy.\n\n69 Ts'ai-tze 蔡澤\n   Winter landscape\n   Very vigorous brush-work, and in style more Sung than Ming. There are very few specimens in which a Ming painter has achieved this grandeur of style.\n\n70 Chang-ping-shan 張平山\n   A sage in the rain\n   The atmosphere of a rainy day could not be better represented; the work is of a very refined artist.\n\n71 Chang-ch'un-chen-jen 長春真人\n   Magpies in a tree\n\n72 Chin-t'ao 金濤\n   White peonies and a heron\n\n73 Chü-shan 巨山\n   Lotus flowers\n\n74 Lu-pao-shan 陸包山\n   Phoenix, storks, ducks and other birds\n\n75 Lu-pao-shan 陸包山\n   Camellias and other flowers\n\n76 Lu-pao-shan 陸包山\n   Mandarin ducks, rose-mallows, bindweeds and bamboo\n   Chien-lung copy.\n77 Ch'en-chang 陳璋  \nRose-mallows and butterflies\n\n78 Wang-hsien 王謨  \nThe thunderstorm  \nFinger painting. A picture of elementary power. Highest impressionistic skill.\n\n79 Yu-tun (Prince) 有撥  \nMagnolias and peonies\n\n80 Pa-ta-shan-jen 八大山人  \nEight small sketches\n\n81 Pa-ta-shan-jen 八大山人  \nAn eagle\n\n82 Pa-ta-shan-jen 八大山人  \nA carp\n\n83 Huang-ch'uan 黃荃  \nKia-ching copy.  \nFive sparrows\n\n84 Huang-tao-chou 黃道周  \nModern copy.  \nTwo rabbits\n\n85 Li-shih-chou 李世倬  \nA boat under a rocky wall\n\n86 Unknown painter 無名  \nWen-tze, a Buddhist saint\n\n87 Unknown painter 無名  \nPu-yi, a Buddhist saint\n\n88 Lan-ying 蓮英  \nKia-ching copy.  \nWinter in the mountains\n\n89 Unknown painter 無名  \nPortrait of a man\n\n90 Unknown painter 無名  \nPortrait of a woman\n\nTs'ing Dynasty 1644-1912\n\nI Kang-hsi 1662-1723\n\n91 Wang-yüan-chi 王原祁  \nAutumn scenery\n\n92 Yün-nan-t'ien 溫南田  \nPeonies\n\n93 Yün-nan-t'ien 溫南田  \nA green flower\n94 Yün-nan-t'ien 滇南田 Peonies\n95 Yün-nan-t'ien 滇南田 Magnolias and peonies\n96 Yün-nan-t'ien 滇南田 A peony\n97 Yün-nan-t'ien 滇南田 A cock and a yellow rattle\n98 Shen-ch'uan 沈銓 Deer at daybreak\n99 Lu-wei 陸為 Rain in the mountains\n100 Ch'a-shih-piao 查士標 Winter landscape\n101 Ma-chang-hsiang 馬江香 Flowers in a vase\nCharming still-life.\n102 Tsiang-nan-sha 蔣南沙 A pheasant and peonies\n\nII Yung-cheng 1723-1736\n193 Huang-shên 黃慎 Herd of goats and sheep\n104 Chen-lao-lien 陳老蓮 Two titmice on a branch\n105 Kao-chi-p'ei 高其佩 Chun-kuei\nFinger painting. Chun-kuei is well known in Chinese mythology for his having defeated a group of demons.\n\nIII Chien-lung 1736-1796\n106 Pien-shou-min 邊壽民 Ducks in rushes\n107 Chang-hung-hsueh 張鴻雪 A cock\n108 Tung-pang-ta 董邦達 Twelve small landscapes\n109 Chang-ch'ung 張沖 Chun-kuei (See note to 105)\n110 Shun-ho-lao-jen 驯鹤老人 Four ducks among the rushes\n111 Shun-ho-lao-jen 騰鶴老人 Ducks among the rushes\n112 Wang-t'ao 王濤 Chrysanthemum\n113 Unknown painter 無名 Peonies and other flowers\n114 Unknown painter 無名 Mythological scene\n\nIV Kia-ching 1796-1821\n115 Min-chen 閔貞 Two carp\n116 Min-chen 閔貞 Tung-fang-tze, a celebrity of the Han period\n117 Min-chen 閔貞 Laughing demons\n118 Unknown Painter 無名 The god of longevity\n\nV Tao-kuang 1821-1851\n119 Yao-ch'ieh 姚楷 Chun-kuei (See note to No. 105)\n120 Wang-hsiao-meo 王小某 Sixteen small sketches\n121 Wang-hsiao-meo 王小某 Hound chasing a hare\n122 Wang-hsueh 王雪 Donkeys\n\nVI Present Period 1851-1912\n123 Yi-pei-nien 伊伯年 A fisherman in his boat\nVi-pei-nien lived in the old walled city of Shanghai. He died about 1906.\n124 Fu-shan 浮山 Autumn landscape\n125 Ku-hsi-mei 顧西霖 Mistress and servants\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/exhibitionchine00nort.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 26146, "total-output-tokens": 5615, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 189, 1], [189, 189, 2], [189, 2059, 3], [2059, 3308, 4], [3308, 4763, 5], [4763, 6289, 6], [6289, 7913, 7], [7913, 9272, 8], [9272, 10582, 9], [10582, 12005, 10], [12005, 13139, 11], [13139, 14270, 12], [14270, 15160, 13], [15160, 16019, 14], [16019, 16784, 15], [16784, 16784, 16]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]