[{"id": "874e992bd15581842a7bf10be8cddb429101307c", "text": "OLD CHINESE PORCELAIN AND WORKS OF ART IN CHINA\nOld Chinese Porcelain\nand\nWorks of Art in China\n\nBeing Description and Illustrations of Articles selected from an Exhibition held in Shanghai, November, 1908\n\nBY\nA. W. BAHR\n\nWITH FRONTISPIECE AND 120 PLATES, 12 BEING IN COLOUR\n\nCASSELL AND COMPANY, LIMITED\nLondon, New York, Toronto and Melbourne\n1911\nCONTENTS\n\nINTRODUCTION ............................................. 1\nNOTES ON CHINESE PORCELAIN ......................... 5\nGLOSSARY OF TERMS .................................... 19\nLIST OF ILLUSTRATIONS .................................. 21\nINDEX OF ARTICLES ACCORDING TO PERIODS .......... 29\nINDEX OF ARTICLES ACCORDING TO CLASS .............. 35\nDESCRIPTION OF ARTICLES ............................... 41\nINTRODUCTION\n\nThe present Volume is not a history of, nor work on, Chinese Porcelain, but is really an illustrated Catalogue and brief description of the principal objects shown at an Exhibition held at Shanghai in November, 1908, under the auspices of the North-China branch of the Royal Asiatic Society.\n\nFor the first time an attempt was made to collect, in China itself, representative specimens of Chinese Porcelain and Works of Art of acknowledged excellence and undoubtedly genuine.\n\nA long period of time was taken in preparation by the following committee, whose names are well known in Shanghai as connoisseurs.\n\nSir Pelham Warren, K.C.M.G., President of the North-China branch of the Royal Asiatic Society.\nMr. C. Oswald Liddell, Chairman.\nMr. A. W. Bahr, Hon. Secretary.\nDr. J. C. Ferguson, Hon. Treasurer.\nMrs. Ayscough,\nDr. A. Stanley,\nDr. S. M. Cox,\nMr. F. E. Wilkinson,\nTaotai Hoo erh mai,\nTaotai Shen tun ho,\nMr. T. W. Kingsmill,\nMr. M. Chapeaux,\nMr. G. H. Thomson,\nMr. Zung song ching,\nMr. Wong kai zur.\nChinese Porcelain\n\nCordial assistance was given by various high officials of the Chinese Empire, from places so far apart as Peking, Canton and Nanchang, and was in a great measure due to the personal influence of Dr. J. C. Ferguson, Councillor to the Viceroy of Nanking and Wuchang.\n\nSome of the choicest pieces of the well-known collections of H.E. Tuan Fang, Viceroy of the Liang-kiang, H.E. King siao san, Governor of Nanchang, Mr. Li chi bai of Canton and Taotai Hwang chung huei of Peking, were kindly loaned and selections were carefully made from the numerous collections in Shanghai and neighbourhood.\n\nThe Exhibition was an unqualified success and comprised about 3,000 pieces; a gratifying interest was shown by the large attendance of Chinese high officials and gentry at the opening ceremony, when speeches were made by H.E. Tsai Nai Hwang, Taotai of Shanghai, the late Mr. T. W. Kingsmill, Vice-President of the North-China branch of the Royal Asiatic Society, the Hon. Charles Denby, Consul-General for the United States of America, Mr. David Landale, Chairman of the Shanghai Municipal Council, Mr. C. O. Liddell, Chairman of the Committee; and mention was specially made of the services of Mrs. Ayscough, Dr. Stanley, Taotai Hoo erh mai, Taotai Shen tun ho and Mr. Zung song ching.\n\nIt is hoped that the examples in this volume will be of interest to collectors as showing Porcelain and Works of Art which are admired and valued by native and foreign connoisseurs resident in China. All the pieces owned by foreigners were obtained in China and mostly with the advice and assistance of the best native experts.\n\nThe Chinese characters on the cover, \"Book on Chinese Porcelain and Fine Arts compiled by Bahr,\" have been kindly written for the author by H.E. Lord Li Ching-fong, Chinese Minister to the Court of Saint James's.\n\nThe coloured illustrations are reproductions of careful paintings by the Chinese artist, Wong chun hai.\nIntroduction\n\nThe author has to thank Mr. C. O. Liddell, of Shanghai, for collaboration in descriptions originally written of the various articles illustrated, Mr. F. E. Wilkinson, H.B.M. Consul at Newchang, for the \"Notes on Chinese Porcelain\" written for the Exhibition, and especially Mr. James Orange, formerly of Hongkong, for valuable assistance in undertaking to revise and see this book through the Press.\n\nA. W. B.\n\nShanghai, 1910.\nNOTES ON CHINESE PORCELAIN\n\nThese notes have been prepared for the information and guidance of those visitors to the Exhibition whose knowledge of Chinese porcelain may be limited. It is hoped that they will stimulate their interest in the subject, and lend some additional attraction in their eyes to the many beautiful exhibits on view. If complaint be made that the amount of information given is meagre, it should be remembered that within the limits of a pamphlet it is impossible to go very deeply into the subject. Examples of every variety of porcelain referred to hereafter will be found on view, and, if all of them are not the best specimens of their class, they are sufficiently representative to enable one to form a good idea of the wonderful achievements of the Chinese potter.\n\nDefinition of Porcelain.—Porcelain is defined by Dr. Bushell, our greatest authority on the subject, as a white, hard pottery which has been vitrified and made translucent by firing. The Chinese describe it as a hard, compact, fine-grained pottery which may be distinguished from ordinary pottery or earthenware by the clear musical note which it gives out on percussion and by the test that it cannot be scratched with a knife. The body consists of two essential elements, white clay, or kaolin, and felspathic stone, or petuntse. The two are mixed together with water to form a paste, which is made into the shape required either by lathe or mould. The piece is then exposed to the sun to dry and, when dry, the colour and glaze are applied. This is usually done in one of three ways—the colour is either applied first and the\nChinese Porcelain\n\nglaze after, so that the colours appear under the glaze as in blue and white; or the two are mixed together and applied, as in celadon and single-coloured decoration generally; or the glaze is applied first and the colour after, so that the colours appear over the glaze as in polychrome decoration. The firing is done, as a rule, immediately after the application of the glaze, so that in over-glaze decoration the piece must have passed through the kiln before the colours can be applied, and to fix them a second firing is necessary. In actual practice many other materials are added to the kaolin and petuntse in the preparation of porcelain, but they are the essential elements. In the composition of the glaze, petuntse is also used, but for this purpose it must be of the very best quality. It is mixed with purified lime and water, and put on the raw body with a brush by dipping or insufflation.\n\nDate of Invention.—Chinese literature ascribes the invention of porcelain to a period some twenty-five centuries before Christ. Foreign experts are by no means certain that the art existed before the seventh century after Christ. No trace of any earlier porcelain can be found, and it is doubtful whether, until the time of the Mings (1368-1644 A.D.), any other porcelain than celadons or single-coloured glazes were manufactured.\n\nCHRONOLOGICAL CLASSIFICATION OF CHINESE PORCELAIN.\n\nThe usual chronological classification of Chinese porcelain is as follows:—\n\n1.—Primitive Period, including the Sung Dynasty (960-1279) and the Yüan Dynasty (1280-1367).\n\n2.—Ming Period, comprising the whole of the Ming Dynasty (1368-1644).\n\n3.—Kang-Hsi (Kanghe) Period, extending from the fall\nNotes on Chinese Porcelain\n\nof the Ming Dynasty to the close of the reign of Kang-Hsi (1662-1723).\n\n4.—Yung-Cheng and Ch’ien-Lung (Kienlung) Period (1723-1796), the two reigns being conjoined.\n\n5.—Modern Period, from the beginning of the reign of Chia-Ch’ing to the present day (1796-1908).\n\nPrimitive or Sung Period.\n\nThe productions of this period are, as might be expected, of very primitive aspect. The pieces that survive are covered with glazes of single colours either of uniform or mottled tint and exhibit either plain or crackled surfaces. The colours usually met with are white, pale purple, often splashed over with red, celadon or other greens, pale grey blue or clair-de-lune, and deep purple or aubergine. Genuine pieces are greatly treasured by native collectors, but are not often seen in foreign collections.\n\nMing Period (1368-1644).\n\nDuring the Ming Period great advances were made in Chinese ceramic art. It was then that the manufacture of porcelain became concentrated at Ching Tê Chen in the Kiangsi Province, which thenceforward practically monopolised the production of artistic porcelain. Here all the old glazes of repute were reproduced in succession and newer methods of decoration invented. We now, for the first time, come across porcelain decorated in colours.\n\nThe first form which this decoration took was blue under the glaze, used both alone and in combination with white. A brilliant red colour was then discovered which, as we know from the writings of the time, attracted universal admiration. Enamel colours, that is, colours applied over the glaze and which stand up on the surface, were first employed to relieve and heighten the blue or the red; then\nChinese Porcelain\n\nthey began to be used in combination, until gradually they predominated in the scheme of coloured decoration now known to us as “Ming Five Colours.”\n\nThe blue and white made during the Ming Period is more remarkable for the brilliancy of the blue than for any excellence of quality. The pieces one sees are usually thick and heavy, with pitted and irregular surfaces. There is, however, about many of them a freedom and freshness of design that makes them very pleasing to the eye.\n\nTo the collector the blue and white of this period does not compare in interest with the pieces decorated in colours, although to the uninitiated the attractions of the latter are not always discernible. The decoration is usually in five colours and, as green is the predominating colour, such pieces are classed in the famille verte. The other colours used are blue under the glaze, red, yellow and aubergine over it. As compared with similar pieces belonging to the next period the Ming pieces of this class left us are poor in quality, shape and colouring. It is their rareness and originality that make them so very desirable to collectors.\n\nBlanc-de-Chine.—In addition to Ching Tê Chen there were during the Ming Period two other centres of some note where the manufacture of porcelain was carried on. One of these centres was Tê Hua in Fukien, where the white porcelain known to us as blanc-de-Chine was produced. It differs widely from other Chinese porcelain, the paste being of a creamy white tint resembling ivory, of which, in fact, it is meant to be an imitation, while the thick rich glaze, which has a satiny aspect, blends closely with the paste underneath. The best examples of this ware are the well-modelled images of Buddhist divinities, of which, owing to their careful preservation in temples, many yet survive, but it was the cups and bowls of egg-shell thickness that brought most fame to the factory. A bowl of this egg-shell ware, which is now extremely rare, is on view in the Exhibition.\nNotes on Chinese Porcelain\n\nCeladon.—The other centre was at Lung Ch'uan in Chekiang, where celadon only was produced. The name \"celadon,\" it should be explained, is used to describe both a class and a special colour, namely, the large and varied class of single glaze decoration and a particular sea-green colour which was the commonest form of single glaze decoration during both the Sung and the Ming Periods. All the celadon produced at Lung Ch'uan was of this particular colour. It was an attempt on the part of the old Chinese potter to imitate the much prized green jade. Celadon is believed to have been the first porcelain ever seen in England, a bowl of it having been presented to New College, Oxford, by Archbishop Warham, in the early part of the 15th century. It was exported from China during the T'ang Dynasty (A.D. 618–906), and was well known and much valued in Persia and India long before it was ever heard of in Europe. Owing to the esteem, no doubt, in which it was held by Eastern royalties the marvellous property was attributed to celadon of denoting by changing its colour the presence of poison in the food served in it. At present this ancient ware is less prized in Europe than by Chinese and Japanese connoisseurs, who give high prices for pieces of exactly the correct shape and shade of green. The factory at Lung Ch'uan was closed before the end of the Ming Dynasty, and since then celadon has only been manufactured at Ching Tè Chen.\n\nKang-Hsi Period (1662-1723).\n\nWe have now reached—to quote Dr. Bushell—the culminating epoch of the ceramic art of China by common consent of all connoisseurs. The brilliant renaissance of the art, which distinguishes the reign of Kang-Hsi, is shown in every class—in the single-coloured glazes; in painted decorations; and in the inimitable blue and white. It is impossible within the limits of this paper to classify\nChinese Porcelain\n\nthe various methods of decoration employed during this period. To do so would merely confuse the uninitiated. It will be sufficient to mention the varieties most commonly met with and those most prized by collectors.\n\nMonochromes.—The glaze is really the master quality in porcelain, and many of the single glazes of this period cannot be passed over without notice. From this reign we date the three most famous and costly of all, the rare apple green, the even more celebrated ruby red or sang-de-bœuf, and the much prized peach bloom, the glazes in every case being derived from copper silicates with which were mixed, the Chinese tell us, pulverised rubies and other precious stones. The brilliant sang-de-bœuf of this period is really a revival of the “sacrificial red” glaze of the Ming Dynasty. Peach bloom was discovered later in the reign. It is described by Dr. Bushell as “a pale red becoming pink in some parts, in others mottled with russet spots displayed on a background of light green celadon tint.” Peach bloom has obtained an extraordinary vogue amongst collectors and fetches absurd prices. A small vase 8 inches high was sold not long ago for £3,000. A new bright black shot with purple, the “ravenswing” of collectors, mazarin blue, turquoise blue, powder blue, and coral red were other discoveries, but perhaps the most brilliant monochromes of this time are the plain washes of the enamel colours used in polychrome decoration, such as the green of the famille verte.\n\nPolychrome Decoration.—By polychrome decoration we mean pieces belonging either to the three-coloured (san t’sai) or five-coloured class (wu t’sai).\n\nThree-colours.—Three-coloured pieces are so called because they are supposed to be decorated with yellow, green and aubergine only. The ground is generally covered with a yellow glaze on which the green and aubergine appear in diaper patterns or other designs. In many cases, however, black is also employed along with the\nNotes on Chinese Porcelain\n\nother three colours. To the connoisseur there is a charm and fascination about this class of porcelain which is not always apparent to the average man. Three-coloured pieces of this period are becoming rare and already fetch fancy prices.\n\n**Five-Colours.**—Until almost the very end of the reign of Kang-Hsi, green continued to be the predominating colour employed in the decoration of five-coloured pieces, which are classed therefore during this period in the *famille verte*. There are so many examples of this class of porcelain in the Exhibition that no description is necessary. The colours used were the same as in the Ming Period, but the porcelain and painting are far finer. Good specimens of the *famille verte* are not yet uncommon, but the demand for them in England has made them very costly. Powdered blue vases with white reserves filled with *famille verte* are particularly sought after by collectors.\n\n**Blue and White.**—The reign of Kang-Hsi is more famous perhaps for its blue and white than for any other kind of porcelain produced during the sixty years it lasted. A specimen of blue and white, to be considered of the finest quality, should possess five points: the blue should be of the finest colour, the white the purest white, the drawing perfectly clean and fine in outline and shading, the shape elegant in form, and the glaze brilliant and uninjured. There are very few pieces which possess all these qualifications, and these all date from the Kang-Hsi Period. It is impossible to explain on paper what blue it is that is considered the finest, but the uninitiated may obtain some idea of what the best is like by examining the exhibits on view, several of which possess most, if not all, the five points required. The most beautiful and valuable specimens of this class are the hawthorn ginger jars decorated with rising and falling sprays of prunus blossom reserved in white on a marbled blue ground. One of these vases was recently sold in England for\nChinese Porcelain\n\n£5,900. Many attempts have been made to imitate this class of porcelain, but no genuine connoisseur can ever be deceived in a piece of good quality. There can be no doubt that time has done something for the pieces of the 17th century, and to the expert their counterfeits never look the age ascribed to them. Blue and white has this advantage over other kinds of porcelain, that the eye does not need special training to appreciate its beauties, which are apparent to everyone. Except for pieces of the very best quality, the price of blue and white of the Kang-Hsi period is still comparatively moderate, and there is plenty of it on the market.\n\nYung-Cheng and Ch’ien-Lung Periods (1723-1796).\n\nThe two reigns of Yung-Cheng and Ch’ien-Lung are taken together on account of the similarity of their ceramic productions. The brilliant greens which predominated in the polychrome decoration of the reign of Kang-Hsi and earned for it the name of famille verte are now supplanted by rose reds of crimson and pink shades. This new style of decoration is known as the famille rose (fen t’sai).\n\nFamille Rose.—No class shows a greater variety of decoration than the famille rose. From the boldly drawn designs of the earlier pieces it ranges to the miniature painting to be found on the egg-shell dishes and plates of the latter years of Ch’ien-Lung. In technique the products of this period are superior to anything of the past, the drawing being more correct and the colouring more carefully blended. Yet there can be no doubt that connoisseurs prefer the less finished style of the magnificent famille verte pieces of the Kang-Hsi period. The standard aimed at, however, during the period under review was unquestionably even higher than before, particular attention being paid to the fineness of the porcelain, which was looked upon not as a mere conveyance for the decoration,\nNotes on Chinese Porcelain\n\nbut as a thing to be admired in itself. It is the opinion of many excellent judges that, in time, the famille rose will become the most valued of all descriptions of porcelain. Visitors will be able to judge for themselves which of the two styles of decoration possesses the greater attractions. It will be noticed that the productions of this period show a marked European influence both in their shape and ornament, due partly to the influence of the Jesuit artists at Peking and partly to the copying of designs sent from Europe.\n\nBlue and White.—The blue and white of both reigns is inferior to that of Kang-Hsi, the like of which we shall never see again. Some of the Yung-Cheng pieces are, however, extremely handsome, the drawing being excellent and the blue of a very vivid description.\n\nEgg-shell.—Egg-shell china is so called because it is supposed to be no thicker than the shell of an egg. The Chinese claim to have possessed the art of making it as far back as the 15th century, and we have already referred to the cups and bowls produced during the Ming Dynasty at Tê Hua in Fukien. Egg-shell began to be manufactured again during the period under review and runs parallel with the famille rose class. As it was made only for export to Europe, where, towards the end of the 18th century, egg-shell dessert services were all the fashion, very little of this ware is to be found in China. In Europe, on the other hand, it is fairly common in the form of plates. The fineness of the porcelain and the beautiful painting on them have caused these plates to be much sought after by collectors, who will pay anything up to £100 for a fine specimen. The colouring at the back of them varies in shade from purple to rose, whence the name, ruby-back plates, by which they are generally known.\n\nSoft Paste Porcelain.—Although the best authorities deny that soft paste porcelain, as understood in Europe,\nChinese Porcelain\n\nhas ever been made in China, there is a class of porcelain, also much sought after by collectors, both in China and abroad, which is generally known by that name. In its manufacture, instead of white clay or kaolin, a material called *wha she* is used. Some of this soft paste belongs to the end of the reign of Kang-Hsi, but most of it was made during the reigns of Yung-Cheng and Ch'ien-Lung, and is therefore classed in the period under review. It may be known from ordinary or hard paste porcelain by its light weight, its crackle—though one occasionally comes across uncrackled pieces—its fine grain, and the vellum-like appearance of the painting, particularly of the blue and white, which is its most common form of decoration. If a piece of so-called soft paste is heavy but otherwise answers to the description, it means that the body is not soft paste throughout but is merely coated with the composition. Some of the blue and white pieces are very beautiful, and there are many collectors who confine themselves to this particular form of porcelain. Needless to say it is an expensive hobby.\n\n**Monochromes.**—There is nothing very original about the monochromes or single-coloured glazes of this period, which, with a few exceptions, do not compare well with those of Kang-Hsi. Special attention appears, however, to have been paid to flambé glazes. These are glazes of variegated hues known to us as splashed. The coloured glaze is applied to the paste, and by regulating, during the process of baking, the currents of air admitted, the tints on a vase may be modified almost indefinitely.\n\n**Modern Period, from 1796.**\n\nThis is a period of decadence, and though many beautiful pieces were turned out during the reigns of Chia-Ch'ing and Tao-Kwang, especially for use in the palace at Peking, it hardly demands detailed description.\nNotes on Chinese Porcelain\n\nCHINESE PORCELAIN IN EUROPE.\n\nThe adoption of the word \"china\" into the English language as equivalent to porcelain is the best of evidence that it was from China that porcelain first came to England. Chinese porcelain began to be imported into Europe towards the end of the 15th century. When it first became known it aroused universal admiration and wonder. Compared with it, the pottery of England and of the continent of Europe was at a vast disadvantage. The first pieces to reach Europe were celadons and blue and white. They were either brought by travellers as precious curiosities or were presents acquired by ambassadors, and in almost every case were deemed worthy of a mount in the best art of the jewellers of the period. The prices which Chinese porcelain commanded soon stimulated amongst European potters an ambition to produce something like it, but, as there was no kaolin to be had, it was a long time before success crowned their efforts. As soon, however, as they were able to supply the market, the importations from China fell off and finally ceased altogether. While it lasted the trade was a very busy one, whole fleets of ships arriving in Europe laden with nothing else, a considerable proportion of the ware being made to order in China from European designs.\n\nHOW TO DISTINGUISH OLD CHINA.\n\nWe have now completed our survey of what might be called the rise and fall of the ceramic art in China. A few remarks in conclusion on the methods by which an expert is able to distinguish an old piece from a new one, and to tell exactly the period to which a piece belongs, may perhaps be of interest. In deciding as to the age of a piece, the composition of the paste and the condition\nChinese Porcelain\n\nof the glaze are perhaps the best test. As we have already remarked, a practised eye is able to judge the age of a piece more or less by its appearance. A Ming piece may perhaps look old to anyone, but it is only an expert who can observe the effect of age on a well preserved Kang-Hsi or Ch'ien-Lung vase. His next best guide is the colour, a particular shade denoting as a rule a particular period. In a polychrome piece he will observe carefully whether certain colours are under or over the glaze. He will always look, too, at the foot of a piece, for though there may be no date mark, the finish here is frequently an indication of the period. A celadon piece, for instance, made during the Ming Dynasty has always a red ring at its back, the unglazed surface where the piece has rested on the kiln. The foot of a Yung-Cheng piece, of the monochrome class in particular, is as a rule unglazed, a characteristic rarely seen in Kang-Hsi and Ch'ien Lung pieces, though occasionally in Ming ware. A date mark, especially when in the seal character, is generally, but by no means always, a guide to the age of a piece. One of the most familiar marks seen on old porcelain, particularly on pieces made for the foreign market, is that of the reign of Ch'eng-Hua (1465-1487), one of the Ming emperors, yet it is very rarely indeed that a piece bearing this mark is of an earlier date than the Kang-Hsi Period. The Chinese have always been lovers of antique porcelain, and they assumed, no doubt, that their European customers would value their productions all the more if they antedated them a century or so. Collectors consequently pay little attention to marks, taking a piece on its merits, whether marked or not. Modern imitations of old porcelain naturally abound, but it is only, as a rule, in the very rare and expensive classes that the reproductions are so excellent and so minute as to details that even an expert may occasionally be deceived. Of all the various classes of porcelain probably mono-\nNotes on Chinese Porcelain\n\nchromes are the most difficult to judge. It is in this class that the amateur most frequently comes to grief.\n\nFor any persons anxious to go more deeply into the subject than we have been able to in this pamphlet, there are many books on porcelain which will assist them in increasing their knowledge. For ourselves we must express our particular indebtedness to Dr. Bushell's \"Chinese Art\" and to Mr. Gulland's \"Chinese Porcelain,\" from both of which works we have quoted freely. Other useful books on the subject are the \"History and Description of Chinese Porcelain,\" by Cosmo Monkhouse, and \"How to Identify Old Chinese Porcelain,\" by Mrs. Willoughby Hodgson.\n\nF. E. W.\nGLOSSARY\n\nBlanc-de-Chine.—Ivory-white porcelain, called by Chinese \"Fuchien ware.\"\n\nCeladon.—A pale-green colour resembling jade.\n\nClair-de-Lune.—Varieties of \"heavenly blue\" or \"colour-of-sky-after-rain.\"\n\nEnamel.—Coloured glazes used in painting on the paste which has been baked or dried; clear or opaque white glazes for covering ordinary pottery; the pigments, used for painting over the glaze, which vitrify at a comparatively low temperature; also the materials used on copper or metals.\n\nFamille Jaune.—Yellow ground with decoration.\n\nFamille Noire.—Black ground with decoration.\n\nFamille Rose.—Decoration in over-glaze in which rose or pink colour predominates.\n\nFamille Verte.—Decoration in over-glaze in which green colour predominates. Three-colour variety generally comprises green, yellow, and aubergine; the five-colour, green, yellow, aubergine, blue, and red. All of varying shades.\n\nFlambé.—Colour of glaze appears splashed or streaked in combinations of, principally, reds and blues.\n\nGlaze.—The transparent liquid covering put on pottery or porcelain.\n\nGraviata.—Porcelain which has patterns engraved on the paste.\n\nPeach Bloom.—Sometimes called peach-blow. Supposed to represent colours to be seen on bud from time of formation to blossom, and consists of reds and greens in endless variety of shades; blots and minute dots in greens through reds.\nChinese Porcelain\n\nPorcelain.—A fine hard pottery, translucent and partially vitrified; generally white colour in section, and should have a clear ring when struck.\n\nPottery.—A mixture of clays or clay rocks, generally brown, terra-cotta, or grey colour in section.\n\nSang-de-Bœuf.—Rich red supposed to resemble the thick clotted blood of an ox.\n\nSoft Paste.—Probably same material as for ordinary porcelain or \"hard paste,\" but a glaze is used which requires a lower temperature to fuse than that required to properly bake the ordinary porcelain paste.\n\nUnder-Glaze Blue.—Pigment applied to the unbaked surface of the pottery before it was glazed; firing causes the colour to sink into the ware and to sometimes tint the glaze.\nLIST OF ILLUSTRATIONS\n\nLarge type for article denotes Coloured Illustrations, of which there are twelve.\n\nAll articles, except otherwise described, are of Porcelain.\n\nChinese characters printed in illustrations simply denote Period and Class of Articles.\n\n| PLATE | ARTICLE                  | CLASS       | PERIOD          | OWNER                | PAGE |\n|-------|--------------------------|-------------|-----------------|----------------------|------|\n| 1     | Model of a Temple Pottery| Wei         |                 | H.E. Viceroy Tuan    | 42   |\n|       | Vase                     | Sui         |                 | Fang                 | 42   |\n|       | Vase                     | Han         |                 | \"                    | 42   |\n| 2     | Lamp                     | Five        | Taotai Hwang    | Chung hwei           | 43   |\n|       | Incense Burner           | Sung        |                 | \"                    | 43   |\n|       | Figure of a Camel        | Han         | Siu tze za      |                      | 43   |\n| 3     | Tomb Urn                 | Sui         | Taotai Hwang    | Chung hwei           | 44   |\n|       | Cup                      | Sung        |                 | \"                    | 44   |\n|       | Incense Burner           | Han         |                 | \"                    | 44   |\n|       | Cup                      | Clair-de-lune| Sung            | \"                    | 44   |\n| 4     | Cup, Dish and Goblet Pottery| T'ang     |                 | \"                    | 45   |\n| 5     | Vase                     | Sung        | Lee ven ching   |                      | 46   |\n| 6     | Tomb Urns                |             | John St. Audley |                      | 47   |\n| 7     | Jar                      |             | A. W. Bahr      |                      | 48   |\n| 8     | FLOWER POT               | Clair-de-lune|             | Taotai Hoo erh mai   | 49   |\n| 9     | Dishes                   |             | Bon lan zung    |                      | 50   |\n|       | Jar                      | Apple green | Ming            |                      | 50   |\n| 10    | Vase                     | Blue with Ch'ien-decoration | Lung | Wong kai zur | 51   |\n| PLATE | ARTICLE | CLASS | PERIOD | OWNER | PAGE |\n|-------|---------|-------|--------|-------|------|\n| 10.   | Bottle  | Soft paste, Kang-Hsi | Wong kai zur | Blue and white | 51 |\n|       | Vase    | Famille verte, Yung-Five colour Cheng | | | 51 |\n|       | Boat    | Soft paste, White Sung | | | 51 |\n| 11.   | Rock    | Ironstone | Zee kwan yin | | 52 |\n| 12.   | INCENSE BURNER Pottery | | C. L. Freer | | 53 |\n| 13.   | Vases   | Soft paste, White Ming | Early A. W. Bahr | | 54 |\n| 14.   | Vase    | Blanc-de-chine | | | 55 |\n| 15.   | Figure  | | | | 56 |\n| 16.   | Vases   | | L. Grenard | | 57 |\n| 17.   | Figures | | A. W. Bahr | | 58 |\n| 18.   | Teapots | | | | 59 |\n| 19.   | Kyllins | | | | 60 |\n| 20.   | Figure  | Five colour | | | 61 |\n| 21.   | Incense Burners | Pottery, Three colour | | | 62 |\n| 22.   | Vase    | Famille verte, Three colour | Lord Kitchener | | 63 |\n| 23.   | Vase    | Pottery, Three colour | A. W. Bahr | | 64 |\n| 24.   | Vase    | Famille verte, Ming Three colour | | | 65 |\n| 25.   | Bowls   | Egg-shell, Early White Ming | | | 66 |\n| 26.   | Vase    | Sang-de-bœuf Kang-Hsi L. c. tung | | | 67 |\n| 27.   | Vases   | Ming H.E. King siao san | | | 68 |\n|       | Vase    | Kang-Hsi | | | 68 |\n|       | Vase    | Celadon Ming | | | 68 |\n| 28.   | Gold-fish Bowl | Famille verte, Ming Three colour | Wong kai zur | | 69 |\n| 29.   | Jar     | Famille verte, Yung-Five colour Cheng | Van yu yuen | | 70 |\n|       | Jar     | Five colour Ming | Lee yen ching | | 70 |\n|       | Jar     | | Ma chang kee | | 70 |\n| PLATE | ARTICLE | CLASS | PERIOD | OWNER | PAGE |\n|-------|---------|-------|--------|-------|------|\n| 30.   | Vase    | Blue and white | Ming | L. Grenard | 71 |\n| 31.   | Tea or Wine Pots | Pottery | \" | Bon lan zung | 72 |\n|       | Teapot  | \" | Chien-Lung | \" | 72 |\n| 32.   | Writer's Water Bottle and Bowl | Peachbloom | Kang-Hsi | Kam hen tsung | 73 |\n|       | Incense Burner | Apple green | Ming | \" | 73 |\n|       | Vase     | Soft paste, Kang-Hsi White | \" | \" | 73 |\n| 33.   | Bottle and Bowl | Glass | Ch'ien Lung | H.E. King siao san | 74 |\n|       | Vase     | Onion green | Yung-Cheng | \" | 74 |\n|       | Water Cup | Sang-de-beef | Ming | \" | 74 |\n|       | Water Cup | Famille rose | Kang-Hsi | \" | 74 |\n| 34.   | Bowl     | Blue and white | Ming | Taotai Hwang chung huei | 75 |\n|       | Bowl     | \" | Shun-Chih | \" | 75 |\n|       | Bowl     | Famille verte, Three colour | Kang-Hsi | \" | 75 |\n|       | Plate    | Famille rose | Yung-Cheng | \" | 75 |\n| 35.   | VASE     | Famille noire | Early | A. W. Bahr | 76 |\n| 36.   | VASE     | \" | Kang-Hsi | Ma chang kee | 77 |\n| 37.   | Figures  | Famille verte, Three colour | Early | A. W. Bahr | 78 |\n| 38.   | Figures of Parrots, etc. | \" | Lee ven ching | \" | 79 |\n| 39.   | VASE     | Famille jaune | \" | Ma chang kee | 80 |\n| 40.   | Puzzle Teapot | Famille verte, Three colour | \" | A. W. Bahr | 81 |\n| PLATE | ARTICLE | CLASS | PERIOD | OWNER | PAGE |\n|-------|---------|-------|--------|-------|------|\n| 41    | Pair of Kylin | Famille verte, Three colour | Early Kang-Hsi | Yang tien chang | 82 |\n|       | Pair of Hounds | \" | \" | A. W. Bahr | 82 |\n| 42    | Flower-stand | \" | \" | Lee ven ching | 83 |\n| 43    | Writer's Water Bottles | \" | \" | R. D. Craig | 84 |\n|       | Teapot | \" | \" | \" | 84 |\n| 44    | Vase | Famille noire | \" | M. Chapeaux | 85 |\n| 45    | Brush-pots | Famille verte, Three colour | \" | A. W. Bahr | 86 |\n|       | Figure of Toad | \" | \" | \" | 86 |\n| 46    | Figures | \" | \" | \" | 87 |\n| 47    | Vase | \" | \" | \" | 88 |\n| 48    | Figure | \" | \" | \" | 89 |\n| 49    | Teacups | Egg-shell, White | \" | J. Orange | 90 |\n| 50    | Vase | Peach bloom | Kang-Hsi | A. W. Bahr | 91 |\n| 51    | VASE | Celadon | \" | \" | 92 |\n| 52    | Vase | Peach bloom | \" | Li chi bai | 93 |\n|       | Writer's Water Bottles | \" | \" | \" | 93 |\n| 53    | Vase | White and Peach bloom | \" | Wong kai sur | 94 |\n|       | Bowls | \" | \" | \" | 94 |\n| 54    | Bottles | \" | \" | H.E. King siao san | 95 |\n| 55    | Vase | Clair-de-lune Kang-Hsi | \" | H.E. King siao san | 96 |\n|       | Pilgrim Bottle | \" | \" | Ch'ien-Lung | 96 |\n|       | Writer's Water Bowl | \" | \" | Yung-Cheng | 96 |\n| 56    | Ginger Jars | Blue and white | Kang-Hsi | G. H. Thomson | 97 |\n|       | Stamp Box | Peach bloom | \" | \" | 97 |\n| 57    | VASE | Blue and white | \" | A. W. Bahr | 98 |\n| 58    | Vases | \" | \" | \" | 99 |\n| 59    | Ginger Jars | \" | \" | D. Landale | 100 |\n|       | Vase | \" | \" | \" | 100 |\n| PLATE | ARTICLE | CLASS | PERIOD | OWNER | PAGE |\n|-------|---------|-------|--------|-------|------|\n| 60.   | Vases   | Soft paste, Kang-Hsi | A., W. Bahr | 101 |\n|       |         | Blue and white | | |\n| 61.   | Vase    | Blue and white | La ven yuen | 102 |\n| 62.   | VASE    | Powdered blue | A. W. Bahr | 103 |\n| 63.   | Plates and Bowls | Famille verte, Three colour | | 104 |\n| 64.   | Jars    | Soft paste, Five colour | | 105 |\n| 65.   | VASE    | Famille verte, Five colour | | 106 |\n| 66.   | Vases   | | Ho chun lee | 107 |\n| 67.   | Birthday Plates | | | 108 |\n|       | Vase    | | | 108 |\n| 68.   | Bowls   | | D. Melnikoff | 109 |\n|       | Bowls   | | A. W. Bahr | 109 |\n| 69.   | Vase    | | Ho chun lee | 110 |\n| 70.   | Plate   | | A. W. Bahr | 111 |\n| 71.   | Bowls   | | | 112 |\n| 72.   | Plate   | | | 113 |\n| 73.   | Vase    | | | 114 |\n| 74.   | Dish    | | | 115 |\n| 75.   | Plates  | | Ho chun lee | 116 |\n| 76.   | Dishes  | | D. Melnikoff | 117 |\n| 77.   | VASE    | | Lord Kitchener | 118 |\n| 78.   | Vase    | | A. W. Bahr | 119 |\n| 79.   | Figure of Unicorn | | P. Ralli | 120 |\n| 80.   | Vases and Bottles | Famille rose | Yung-Cheng | Li chi bai | 121 |\n| 81.   | Bowls   | Kang-Hsi | Bon lan sung | 122 |\n|       | Vase    | Ch'ien-Lung | A. W. Bahr | 122 |\n| 82.   | VASE    | Yung-Cheng | J. Stirling | 123 |\n| 83.   | Vase    | | A. W. Bahr | 124 |\n| PLATE | ARTICLE | CLASS | PERIOD | OWNER | PAGE |\n|-------|---------|-------|--------|-------|------|\n| 84.   | Vase    | Famille rose | Yung-Cheng | Ho chun lee | 125 |\n| 85.   | Flower-pots | \" | \" | \" | 126 |\n|       | Vase    | \" | Ch'ien-Lung | \" | 126 |\n| 86.   | Brush-holder and Bowl | \" | Yung-Cheng | H.E. King siao san | 127 |\n|       | Bottle  | Egg-shell, Famille rose | \" | \" | 127 |\n| 87.   | Vase    | Famille rose | \" | La kwei sung | 128 |\n|       | Vase    | \" | \" | R. D. Craig | 128 |\n|       | Vase    | \" | \" | Taotai Hoo erh mai | 128 |\n| 88.   | Vase    | Blue and white | \" | d'Auxion de Ruffé | 129 |\n|       | Vase    | Famille rose | \" | Taotai Hoo erh mai | 129 |\n| 89.   | FIGURES | \" | \" | J. N. Jameson | 129 |\n| 90.   | Bowls   | Famille verte, Cheng | Yung-Cheng | C. O. Liddell | 131 |\n|       | Jars    | \" | \" | A. W. Bahr | 132 |\n| 92.   | Bottle  | Red and blue | \" | Yu tze sor | 133 |\n|       | Vase    | \" | Ch'ien-Lung | G. D. Coutts | 133 |\n|       | Bottle  | \" | \" | A. W. Bahr | 133 |\n| 93.   | Vases   | Famille rose | \" | \" | 134 |\n| 94.   | Vase    | \" | \" | \" | 135 |\n| 95.   | Vase    | \" | \" | B. Rosenbaum | 136 |\n| 96.   | Bowls   | \" | \" | A. W. Bahr | 137 |\n|       | Figure  | \" | \" | \" | 137 |\n| 97.   | Jars    | \" | \" | Yu tze sor | 138 |\n| 98.   | Cups    | \" | \" | C. O. Liddell | 139 |\n|       | Vase    | \" | \" | Wong kai zur | 139 |\n| 99.   | Vases and Jars | Famille rose, Blue and white | \" | Peter Bahr | 140 |\n| 100.  | Snuff-bottles | Famille rose | \" | Liu wen choo | 141 |\n| 101.  | Snuff-bottles | Soft paste, Famille rose | \" | A. W. Bahr | 142 |\n| PLATE | ARTICLE | CLASS | PERIOD | OWNER | PAGE |\n|-------|---------|-------|--------|-------|------|\n| 102. | Snuff-bottles | Glass and Enamel | Ch'ien-Lung | Liu wen choo | 143 |\n| 103. | Plaques | Famille verte, Five colour | Kang-Hsi Taotai Shen tun ho | 144 |\n| | Plaques and Panel | Famille rose, Blue and white | Ch'ien-Lung | ,, | 144 |\n| 104. | Half-Vases for Screens | Famille verte, Famille rose | Kang-Hsi, Sien tze za Yung-Cheng and Ch'ien-Lung | 145 |\n| 105. | Plaque | Famille rose | Ch'ien-Lung | Zee lee yuen | 146 |\n| 106. | Plaque | ,, | ,, | Taotai Shen tun ho | 147 |\n| 107. | Vases | Flambé | ,, | F. E. Wilkinson | 148 |\n| 108. | Figures | Famille rose | ,, | A. W. Bahr | 149 |\n| 109. | Vase | Enamel-ware | ,, | D. Landale | 150 |\n| 110. | Incense Burner | ,, | ,, | Wong kai zur | 151 |\n| 111. | Teapots, Plates and Bowl | ,, | ,, | Dr. A. Stanley | 152 |\n| 112. | Fish-bowl | ,, | ,, | Wong kai zur | 153 |\n| 113. | Various Articles | Jade | ,, | D. Pecorini | 154 |\n| 114. | Figures, &c. | ,, | ,, | ,, | 155 |\n| 115. | Bottles | Jade, Stone and Crystal | ,, | Yu tze sor | 156 |\n| 116. | Bottles | Glass | ,, | Bon lan zung, A. W. Bahr and G. H. Thomson | 157 |\n| 117. | Carriage | Red lacquer | ,, | A. W. Bahr | 158 |\n| 118. | Figures and Screen | Ivory | ,, | Mrs. F. Ayscough and M. Permezel | 159 |\n| 119. | Helmet | Pottery | ,, | A. Rose | 160 |\n| 120. | Vase | Famille rose | Tao-Kwang | Sir C. P. Chater | 161 |\nINDEX OF ARTICLES ACCORDING TO PERIODS\n\nNote.—The periods given to various articles are those generally acknowledged by Chinese experts. Many pieces called Ming in Europe are ascribed to Early Kang-Hsi in China; the manufacture overlapped the two reigns. Also (see Plate 80) articles given as Early Yung-Cheng might be ascribed to Late Kang-Hsi.\n\nHAN PERIOD. B.C. 206 to A.D. 220.\n\n| CLASS | ARTICLE          | PLATE | PAGE |\n|-------|------------------|-------|------|\n| Pottery | Vase             | I     | 42   |\n| ,,     | Camel            | II    | 43   |\n| ,,     | Incense Burner   | III   | 44   |\n\nWEI PERIOD. A.D. 220 to A.D. 264.\n\n| CLASS | ARTICLE          | PLATE | PAGE |\n|-------|------------------|-------|------|\n| Pottery | Temple           | I     | 42   |\n\nSUI PERIOD. A.D. 581 to 618.\n\n| CLASS | ARTICLE          | PLATE | PAGE |\n|-------|------------------|-------|------|\n| Pottery | Vase             | I     | 42   |\n| ,,     | Tomb Urn         | III   | 44   |\n\nT'ANG PERIOD. A.D. 618 to 906.\n\n| CLASS | ARTICLE                      | PLATE | PAGE |\n|-------|------------------------------|-------|------|\n| Pottery | Cup, Dish and Goblet        | IV    | 45   |\n\nFIVE DYNASTIES. A.D. 907 to 960.\n\n| CLASS | ARTICLE          | PLATE | PAGE |\n|-------|------------------|-------|------|\n| Pottery | Lamp             | II    | 43   |\n\nSUNG PERIOD. A.D. 960 to 1279.\n\n| CLASS | ARTICLE                      | PLATE | PAGE |\n|-------|------------------------------|-------|------|\n| Pottery | Incense Burner              | II    | 43   |\n| ,,     | Cup                          | III   | 44   |\n| ,,     | Vase                         | V     | 46   |\n| ,,     | Tomb Urns                    | VI    | 47   |\n| ,,     | Jar                          | VII   | 48   |\n| ,,     | Incense Burner               | XII   | 53   |\n## Chinese Porcelain\n\n| CLASS                  | ARTICLE          | PLATE | PAGE |\n|------------------------|------------------|-------|------|\n| **Monochrome** — Clair-de-lune | Cup              | III   | 4f   |\n|                        | Flower Pot       | VIII  | 4g   |\n|                        | Dishes           | IX    | 5f   |\n| **Soft Paste** — White | Boat             | X     | 5    |\n| **Ironstone**          | Rock             | XI    | 5    |\n\n### MING PERIOD. A.D. 1368 to 1644.\n\n| CLASS                  | ARTICLE          | PLATE | PAGE |\n|------------------------|------------------|-------|------|\n| Pottery                | Incense Burner   | XXI   | 6    |\n|                        | Vase             | XXIII | 6f   |\n|                        | Teapot           | XXXI  | 7    |\n| **Monochrome** — Apple green | Jar            | IX    | 5f   |\n|                        | Incense Burner   | XXXII | 7    |\n| Blanc-de-chine         | Vase             | XIV   | 5    |\n|                        | Figure           | XV    | 5f   |\n|                        | Vases            | XVI   | 5f   |\n|                        | Figures          | XVII  | 5    |\n|                        | Teapots          | XVIII | 5f   |\n|                        | Kyllins          | XIX   | 6a   |\n| Sang-de-bœuf           | Vase             | XXVII | 6    |\n|                        | Water Cup        | XXXIII| 7    |\n|                        | Celadon Vase     | XXVII | 6    |\n| **Famille verte** — Three colour | \"            | XXII  | 6    |\n|                        | \"                | XXIV  | 6    |\n|                        | Gold-fish Bowl   | XXVIII| 6    |\n| Five colour            | Figure           | XX    | 6    |\n|                        | Jars             | XXIX  | 7    |\n| **Soft Paste** — White | Vases            | XIII  | 5    |\n| Egg-shell              | Bowls            | XXV   | 6    |\n| Blue and White         | Vase             | XXX   | 7    |\n\n### SHUN-CHIH PERIOD. A.D. 1644 to 1662.\n\n| CLASS                  | ARTICLE          | PLATE | PAGE |\n|------------------------|------------------|-------|------|\n| Blue and White         | Bowl             | XXXIV | 7    |\n## Index of Articles according to Periods\n\n### KANG-HSI PERIOD. A.D. 1662 to 1723.\n\n| CLASS                  | ARTICLE                        | PLATE | PAGE |\n|------------------------|--------------------------------|-------|------|\n| **Monochrome**         | Clair-de-lune . Vase           | LV    | 96   |\n| \"                      | Sang-de-boeuf                  | XXVI  | 67   |\n| \"                      | Celadon                        | XXVII | 68   |\n| \"                      | Peach bloom . Water Bottle and Bowl | XXXII | 73   |\n| \"                      | Vase                           | L     | 91   |\n| \"                      | Vase and Writer's Water Bottle | LII   | 93   |\n| \"                      | Stamp Box                      | LVI   | 97   |\n| **Famille verte**      | Three colour . Bowl            | XXXIV | 75   |\n| \"                      | Figures                        | XXXVII| 78   |\n| \"                      | Puzzle Teapot                  | XXXVIII| 79  |\n| \"                      | Kyllins and Hounds             | XL    | 81   |\n| \"                      | Flower Stand                   | XLI   | 82   |\n| \"                      | Writer's Water Bottles and Teapot | XLII | 83   |\n| \"                      | Brush Pots and Figure          | XLIII | 84   |\n| \"                      | Figures                        | XLV   | 86   |\n| \"                      | Vase                           | XLVI  | 87   |\n| \"                      | Figure                         | XLVII | 88   |\n| \"                      | Figure                         | XLVIII| 89   |\n| **Famille noire**      | Vase                           | XXXV  | 76   |\n| \"                      | \"                              | XXXVI | 77   |\n| \"                      | \"                              | XLIV  | 85   |\n| **Famille jaune**      | \"                              | XXXIX | 80   |\n| **Famille verte**      | Five colour . Plates and Bowls | LXIII | 104  |\n| \"                      | Vase                           | LXV   | 106  |\n| \"                      | Vases                          | LXVI  | 107  |\n| \"                      | Plates and Vase                | LXVII | 108  |\n| \"                      | Bowls                          | LXVIII| 109  |\n| \"                      | Vase                           | LXIX  | 110  |\n## Chinese Porcelain\n\n| CLASS                  | ARTICLE                        | PLATE | PAGE |\n|------------------------|--------------------------------|-------|------|\n| **Famille verte**      | Five colour                    | LXX   | 111  |\n| \"                      | Plate                          | LXXI  | 112  |\n| \"                      | Bowl                           | LXXII | 113  |\n| \"                      | Vase                           | LXXIII| 114  |\n| \"                      | Dish                           | LXXIV | 115  |\n| \"                      | Plates                         | LXXV  | 116  |\n| \"                      | Dishes                         | LXXVI | 117  |\n| \"                      | Vase                           | LXXVII| 118  |\n| \"                      | Figure of Unicorn              | LXXIX | 120  |\n| \"                      | Plaques and Panel              | CIII  | 144  |\n| \"                      | Half-Vases                     | CIV   | 145  |\n| **Soft Paste**         | White Vase                     | XXXII | 73   |\n| \"                      | Blue and white Bottle          | X     | 51   |\n| \"                      | Vases                          | LX    | 101  |\n| \"                      | Five colour Jars               | LXIV  | 105  |\n| **Blue and White**     | Ginger Jars                    | LVI   | 97   |\n| \"                      | Vase                           | LVII  | 98   |\n| \"                      | Vases                          | LVIII | 99   |\n| \"                      | Ginger Jars and Vase           | LIX   | 100  |\n| \"                      | Beaker                         | LXI   | 102  |\n| **Egg-shell**          | White Teacups                  | XLIX  | 90   |\n| **Peach bloom on white**| Vase and Bowls                 | LIII  | 94   |\n| \"                      | Bottles                        | LIV   | 95   |\n| **Powdered blue**      | Vase                           | LXII  | 103  |\n| **Famille rose**       | Water Cup                      | XXXIII| 74   |\n| \"                      | Bowls                          | LXXXI | 122  |\n\n### YUNG-CHENG PERIOD. A.D. 1723 to 1736.\n\n| CLASS                  | ARTICLE                        | PLATE | PAGE |\n|------------------------|--------------------------------|-------|------|\n| **Monochrome**         | Clair-de-lune Writer's Water Bottle | LV    | 96   |\n| \"                      | Onion green Vase               | XXXIII| 74   |\n| **Famille verte**      | Five colour                    | X     | 51   |\n| CLASS                        | ARTICLE                  | PLATE | PAGE |\n|------------------------------|--------------------------|-------|------|\n| Famille verte — Five colour  | Jar                      | XXIX  | 70   |\n| \"                             | Bowls                    | XC    | 131  |\n| \"                             | Jars                     | XCI   | 132  |\n| Blue and White               | Vase                     | LXXXVIII | 129 |\n| Egg-shell — Famille rose      | Bottle                   | LXXXVI | 127 |\n| Blue with Colours            | Bottles                  | XCII  | 133  |\n| Famille rose                 | Plate                    | XXXIV | 75   |\n| \"                             | Vases and Bottles        | LXXX  | 121  |\n| \"                             | Vase                     | LXXXII | 123 |\n| \"                             | \"                        | LXXXIII | 124 |\n| \"                             | \"                        | LXXXIV | 125 |\n| \"                             | Flower Pots              | LXXXV | 126  |\n| \"                             | Brush-holder, Bowl and Bottle | LXXXVI | 127 |\n| \"                             | Vases                    | LXXXVII | 128 |\n| \"                             | \"                        | LXXXVIII | 129 |\n| \"                             | Figures                  | LXXXIX | 130 |\n| \"                             | Half-vases               | CIV   | 145  |\n\nCH'EN-LUNG PERIOD. A.D. 1736 to 1796.\n\n| Pottery                      | Teapot                   | XXXI  | 72   |\n| \"                            | Helmet                   | CXIX  | 160  |\n| Monochrome — Clair-de-lune   | Pilgrim Bottle           | LV    | 96   |\n| \"                            | Flambé Vases             | CVII  | 148  |\n| Soft Paste — Famille rose    | Snuff-bottles            | CI    | 142  |\n| Blue and White               | Vases and Jars           | XCIX  | 140  |\n| \"                            | Plaques and Panel        | CIII  | 144  |\n| Blue with Colours            | Vase                     | X     | 51   |\n| \"                            | \"                        | XCII  | 133  |\n| Famille rose                 | \"                        | LXXXI | 122  |\n| \"                            | \"                        | LXXXV | 126  |\n| \"                            | Vases                    | XCIII | 134  |\n| \"                            | Vase                     | XCIV  | 135  |\n| \"                            | \"                        | XCV   | 136  |\n| \"                            | Bowls and Figure         | XCVI  | 137  |\n## Chinese Porcelain\n\n| CLASS         | ARTICLE                        | PLATE | PAGE |\n|---------------|--------------------------------|-------|------|\n| Famille rose  | Jars                           | XCVII | 138  |\n|               | Cups and Vase                  | XCVIII| 139  |\n|               | Vases and Jars                 | XCIX  | 140  |\n|               | Snuff-bottles                  | C     | 141  |\n|               | Half-vases                     | CIV   | 145  |\n|               | Plaque                         | CV    | 146  |\n|               | Figures                        | CVI   | 147  |\n| Glass         | Bottle and Bowl                | XXXIII| 74   |\n|               | Snuff-bottles                  | CII   | 143  |\n|               | Bottles                        | CXVI  | 157  |\n| Enamel        | Snuff-bottles                  | CII   | 143  |\n|               | Jar                            | CIX   | 150  |\n|               | Incense Burner                 | CX    | 151  |\n|               | Teapots, Plates, and Bowl      | CXI   | 152  |\n|               | Fish Bowl                      | CXII  | 153  |\n| Jade          | Various Articles               | CXIII | 154  |\n|               | Figures and Brush-holder       | CXIV  | 155  |\n|               | Bottle                         | CXV   | 156  |\n| Crystal       |                                | CXV   | 156  |\n| Pink-stone    |                                | CXV   | 156  |\n| Lacquer       | Carriage                       | CXVII | 158  |\n| Ivory         | Figures and Screen             | CXVIII| 159  |\n\n**TAO-KWANG PERIOD. A.D. 1821 to 1851.**\n\nFamille rose . . . Vase . . . . . CXX 161\n## INDEX OF ARTICLES ACCORDING TO CLASS\n\n### POTTERY.\n\n| ARTICLE            | PERIOD       | PLATE | PAGE |\n|--------------------|--------------|-------|------|\n| Vase               | Han          | I     | 42   |\n| Figure of a Camel  | \"            | II    | 43   |\n| Incense Burner     | \"            | III   | 44   |\n| Model of a Temple  | Wei          | I     | 42   |\n| Vase               | Sui          | I     | 42   |\n| Tomb Urn           | \"            | III   | 44   |\n| Cup, Dish and Goblet | T'ang      | IV    | 45   |\n| Lamp               | Five Dynasties | II   | 43   |\n| Incense Burner     | Sung         | II    | 43   |\n| Cup                | \"            | III   | 44   |\n| Vase               | \"            | V     | 46   |\n| Tomb Urns          | \"            | VI    | 47   |\n| Jar                | \"            | VII   | 48   |\n| Incense Burner     | \"            | XII   | 53   |\n| Incense Burners    | Early Ming   | XXI   | 62   |\n| Vase               | \"            | XXIII | 64   |\n| Teapot             | Ming         | XXXI  | 72   |\n| \"                  | Ch'ien-Lung  | XXXI  | 72   |\n| Helmet             | \"            | CXIX  | 160  |\n\n### MONOCHROMES.\n\n| ARTICLE            | COLOUR       | PERIOD       | PLATE | PAGE |\n|--------------------|--------------|--------------|-------|------|\n| Cup                | Clair-de-lune | Sung        | III   | 44   |\n| Flower Pot         | \"            | \"            | VIII  | 49   |\n| Dishes             | \"            | \"            | IX    | 50   |\n| Vase               | \"            | Kang-Hsi     | LV    | 96   |\n| Writer's Water Bowl| \"            | Yung-Cheng   | LV    | 96   |\n| Pilgrim Bottle     | \"            | Ch'ien-Lung  | LV    | 96   |\n## Chinese Porcelain\n\n| ARTICLE               | COLOUR          | PERIOD       | PLATE | PAGE |\n|-----------------------|-----------------|--------------|-------|------|\n| Vases                 | Flambé          | Ch'ien-Lung  | CVII  | 148  |\n| Jar                   | Apple green     | Ming         | IX    | 50   |\n| Incense Burner        |                 |              | XXXII | 73   |\n| Vase                  | Blanc-de-chine  | Early Ming   | XIV   | 55   |\n| Figure                |                 |              | XV    | 56   |\n| Vases                 |                 |              | XVI   | 57   |\n| Figures               |                 |              | XVII  | 58   |\n| Teapots               |                 |              | XVIII | 59   |\n| Figures of Kyllins    |                 |              | XIX   | 60   |\n| Vase                  | Sang-de-bœuf    | Ming         | XXVII | 68   |\n| Water Cup             |                 |              | XXXIII| 74   |\n| Vase                  |                 | Kang-Hsi     | XXVI  | 67   |\n|                       |                 |              | XXVII | 68   |\n|                       | Celadon         | Ming         | XXVII | 68   |\n|                       |                 | Kang-Hsi     | LI    | 92   |\n| Writer's Water Bottle and Bowl | Peach bloom |              | XXXII | 73   |\n| Vase                  |                 |              | L     | 91   |\n| Vase and Writer's Water Bottle |             |              | LII   | 93   |\n| Stamp Box             |                 |              | LVI   | 97   |\n| Vase                  | Onion green     | Yung-Cheng   | XXXIII| 74   |\n\n### FAMILLE VERTE. THREE COLOUR.\n\n| ARTICLE                      | PERIOD       | PLATE | PAGE |\n|------------------------------|--------------|-------|------|\n| Vase                         | Ming         | XXII  | 63   |\n|                              |              | XXIV  | 65   |\n| Gold-fish Bowl               |              | XXVIII| 69   |\n| Figures                      | Early Kang-Hsi| XXXVII| 78   |\n|                              |              | XXXVIII| 79   |\n| Puzzle Teapot                |              | XL    | 81   |\n| Figures of Kyllins and Hounds|              | XLI   | 82   |\n| Flower-stand                 |              | XLII  | 83   |\n| Writer's Water Bottles and Teapot |            | XLIII | 84   |\n| Brush-pots and Figure        |              | XLV   | 86   |\n| Item                  | Period          | Plate | Page |\n|----------------------|-----------------|-------|------|\n| Figures              | Early Kang-Hsi  | XLVI  | 87   |\n| Vase                 | \"               | XLVII | 88   |\n| Figure               | \"               | XLVIII| 89   |\n| Bowl                 | Kang-Hsi        | XXXIV | 75   |\n| Plates and Bowls     | \"               | LXIII | 104  |\n\n**FAMILLE NOIRE.**\n\n| Vase                 | Early Kang-Hsi  | XXXV  | 76   |\n| \"                    | \"               | XXXVI | 77   |\n| \"                    | \"               | XLIV  | 85   |\n\n**FAMILLE JAUNE.**\n\n| Vase                 | Early Kang-Hsi  | XXXIX | 80   |\n\n**FAMILLE VERTE. FIVE COLOUR.**\n\n*Note.—Pieces attributed to Yung-Cheng may be of a late Kang-Hsi production.*\n\n| Item                  | Period          | Plate | Page |\n|----------------------|-----------------|-------|------|\n| Figure               | Ming            | XX    | 61   |\n| Jars                 | \"               | XXIX  | 70   |\n| Vase                 | Kang-Hsi        | LXV   | 106  |\n| Vases                | \"               | LXVI  | 107  |\n| Birthday Plates and Vase | \"           | LXVII | 108  |\n| Bowls                | \"               | LXVIII| 109  |\n| Vase                 | \"               | LIX   | 110  |\n| Plate                | \"               | LXX   | 111  |\n| Bowls                | \"               | LXXI  | 112  |\n| Plate                | \"               | LXXII | 113  |\n| Vase                 | \"               | LXXIII| 114  |\n| Dish                 | \"               | LXXIV | 115  |\n| Plates               | \"               | LXXV  | 116  |\n| Dishes               | \"               | LXXVI | 117  |\n| Vase                 | \"               | LXXVII| 118  |\n| \"                    | \"               | LXXVIII| 119 |\n| Figure of Unicorn    | \"               | LXXIX | 120  |\n| Plaques              | \"               | CIII  | 144  |\n| Half-vases           | \"               | CIV   | 145  |\n## Chinese Porcelain\n\n| ARTICLE | PERIOD       | PLATE | PAGE |\n|---------|--------------|-------|------|\n| Vase    | Yung-Cheng   | X     | 51   |\n| Jar     | \"            | XXIX  | 70   |\n| Bowls   | \"            | XC    | 131  |\n| Jars    | \"            | XCI   | 132  |\n\n### SOFT PASTE.\n\n| ARTICLE    | COLOUR         | PERIOD       | PLATE | PAGE |\n|------------|----------------|--------------|-------|------|\n| Boat       | White          | Sung         | X     | 51   |\n| Vases      | \"              | Early Ming   | XIII  | 54   |\n| Vase       | \"              | Kang-Hsi     | XXXII | 73   |\n| Bottle     | Blue and white | \"            | X     | 51   |\n| Vase       | \"              | \"            | LX    | 101  |\n| Jars       | Five colour    | \"            | LXIV  | 105  |\n| Snuff-bottles | Famille rose  | Ch'ien-Lung | CI    | 142  |\n\n### EGG-SHELL.\n\n| ARTICLE | COLOUR         | PERIOD       | PLATE | PAGE |\n|---------|----------------|--------------|-------|------|\n| Bowls   | White          | Early Ming   | XXV   | 66   |\n| Teacups | \"              | Kang-Hsi     | XLIX  | 90   |\n| Bottle  | Famille rose   | Yung-Cheng   | LXXXVI| 127  |\n\n### BLUE AND WHITE\n\n| ARTICLE        | PERIOD       | PLATE | PAGE |\n|----------------|--------------|-------|------|\n| Vase           | Ming         | XXX   | 71   |\n| Bowl           | \"            | XXXIV | 75   |\n| \"              | Shun-Chih    | XXXIV | 75   |\n| Ginger Jars    | Kang-Hsi     | LVI   | 97   |\n| Vase           | \"            | LVII  | 98   |\n| Vases          | \"            | LVIII | 99   |\n| Ginger Jars and Vase | \" | LIX   | 100  |\n| Beaker         | \"            | LXI   | 102  |\n| Vase           | Yung-Cheng   | LXXXVIII| 129 |\n| Vases and Jars | Ch'ien-Lung  | XCIX  | 140  |\n| Plaques and Panels | \" | CIII  | 144  |\n## Index of Articles according to Class\n\n### VARIOUS COLOURS.\n\n| ARTICLE          | COLOUR                  | PERIOD     | PLATE | PAGE |\n|------------------|-------------------------|------------|-------|------|\n| Bottles          | Blue with colours       | Yung-Cheng | XCII  | 133  |\n| Vase             |                         | Ch'ien-Lung| X     | 51   |\n|                  |                         |            | XCII  | 133  |\n| Vase and Bowls   | Peach bloom on white    | Kang-Hsi   | LIII  | 94   |\n| Bottles          |                         |            | LIV   | 95   |\n| Vase             | Powdered blue           |            | LXII  | 103  |\n\n### FAMILLE ROSE.\n\n| ARTICLE                      | PERIOD     | PLATE | PAGE |\n|------------------------------|------------|-------|------|\n| Water Cup                    | Kang-Hsi   | XXXIII| 74   |\n| Bowls                        |            | LXXXI | 122  |\n| Plate                        | Yung-Cheng | XXXIV | 75   |\n| Vases and Bottles            |            | LXXX  | 121  |\n| Vase                         |            | LXXXII| 123  |\n| \"                             |            | LXXXIII| 124 |\n| \"                             |            | LXXXIV | 125 |\n| Flower Pots                  |            | LXXXV | 126  |\n| Brush-holder, Bowl and Bottle|            | LXXXVI | 127 |\n| Vases                        |            | LXXXVII| 128 |\n| \"                             |            | LXXXVIII| 129 |\n| Figures                      |            | LXXXIX | 130 |\n| Half-vases                   |            | CIV   | 145  |\n| Vase                         | Ch'ien-Lung| LXXXI | 122  |\n| \"                             |            | LXXXV | 126  |\n| Vases                        |            | XCIII | 134  |\n| Vase                         |            | XCIV  | 135  |\n| \"                             |            | XCV   | 136  |\n| Bowls and Figure             |            | XCVI  | 137  |\n| Jars                         |            | XCVII | 138  |\n| Cups and Vase                |            | XCVIII| 139  |\n| Vases and Jars               |            | XCIX  | 140  |\n## Chinese Porcelain\n\n| ARTICLE       | PERIOD     | PLATE | PAGE |\n|---------------|------------|-------|------|\n| Snuff-bottles | Ch'ien-Lung| C     | 141  |\n| Half-vases    |            | CIV   | 145  |\n| Plaque        |            | CV    | 146  |\n| Figures       |            | CVII  | 147  |\n| Vase          | Tao-Kwang  | CXX   | 161  |\n\n## Works of Art Other Than Porcelain\n\n| ARTICLE                  | CLASS      | PERIOD     | PLATE | PAGE |\n|--------------------------|------------|------------|-------|------|\n| Rock                     | Ironstone  | Sung       | XI    | 52   |\n| Bottle and Bowl          | Glass      | Ch'ien-Lung| XXXIII| 74   |\n| Snuff-bottles            |            |            | CII   | 143  |\n|                          | Enamel     |            | CII   | 143  |\n| Vase                     |            |            | CIX   | 150  |\n| Incense Burner           |            |            | CX    | 151  |\n| Teapots, Plates and Bowl |            |            | CXI   | 152  |\n| Fish-bowl                |            |            | CXII  | 153  |\n| Various Articles         | Jade       |            | CXIII | 154  |\n| Figures and Brush-holder |            |            | CXIV  | 155  |\n| Bottle                   |            |            | CXV   | 156  |\n| Crystal                  |            |            | CXV   | 156  |\n| Pink-stone               |            |            | CXV   | 156  |\n| Glass                    |            |            | CXVI  | 157  |\n| Carriage                 | Lacquer    |            | CXVII | 158  |\n| Figures and Screen       | Ivory      |            | CXVIII| 159  |\nDESCRIPTION OF ARTICLES\nPLATE I\n\nModel of a Temple. Found in a tomb of the Wei Dynasty.\nHard pottery, warm grey in colour, and green glaze.\nHeight to ridge, $1\\frac{3}{4}$ inches.\nPeriod, Wei.\n\nVase. Inverted pear shape, with curved lip. Buff-coloured hard pottery, covered with creamy grey glaze. The design is engraved, and the characters round the upper half are in fish-roe ground.\nHeight, 15 inches.\nPeriod, Sui.\n\nVase. Bulbous body with slender curved neck and spreading rim, from which spring two handles to shoulder. Light buff-coloured pottery, partially covered with transparent fine crackle glaze of an amber tint.\nHeight, $1\\frac{1}{4}$ inches.\nPeriod, Han.\n\nFrom the collection of H.E. Viceroy Tuan Fang.\nPLATE II\n\nLamp, with Cover. Coarse brown pottery, covered sparsely with faint greenish glaze. One of the lamps of pottery used in early times by the Chinese.\n\nHeight, 10 inches.\nPeriod, Five Dynasties.\n\nFrom the collection of Taotai Hwang chung hwei.\n\nFigure of Camel and Stand. Greyish pottery. Carrying a load on back and head uplifted. A very uncommon and interesting specimen of the period.\n\nHeight, 15 inches.\nPeriod, Han.\n\nFrom the collection of Sien tze za.\n\nIncense Burner and Cover. Pottery, with sprinklings of greenish glaze.\n\nHeight, 6½ inches.\nPeriod, Sung.\n\nFrom the collection of Taotai Hwang chung hwei.\nPLATE III\n\nTomb Urn. Hard grey pottery, with greenish grey crackled glaze. Twelve figures round neck, with dragon and pearl above.\n\nHeight, 14½ inches.\nPeriod, Sui.\n\nCup. Hard coarse stoneware, with black, slightly iridescent glaze, called in China \"Rabbit Hair,\" known also as the \"slow-drying cup,\" and is supposed to have the property of keeping water sweet and fresh with very little evaporation. Made in Tu-Chein.\n\nHeight, 3 inches.\nPeriod, Sung.\n\nCup. Porcelain, hard grey paste, with pale blue glaze, known as Clair-de-lune.\n\nHeight, 2 inches.\nDiameter, 5 inches.\nPeriod, Sung.\n\nIncense Burner, with cover and two handles. Pottery.\n\nHeight, 7 inches.\nPeriod, Han.\n\nFrom the collection of Taotai Hwang chung hwei.\nPLATE IV\n\nCup. Pottery, covered with a thick creamy-white dull glaze, known as \"Ta-Hee\" ware, said by the Chinese to be one of the first attempts to produce white vessels of pottery; made in Szechuan; mentioned in Tu-foo's book on T'ang pottery, volume 12. This cup is said to have been in the possession of one family since the Sung Dynasty, say 650 years.\n\nHeight, 2\\(\\frac{1}{4}\\) inches.\nDiameter, 4\\(\\frac{1}{2}\\) inches.\nPeriod, T'ang.\n\nDish. Hard grey pottery, covered with creamy white, rather thick, crackled glaze. Made at Lai-Chu, now Shing-Chow, mentioned in Chinese books of the Sung period.\n\nHeight, 1\\(\\frac{1}{4}\\) inches.\nDiameter, 4\\(\\frac{1}{2}\\) inches.\nPeriod, T'ang.\n\nGoblet. Stand is fluted horizontally. Very hard red pottery covered by dull drab glaze. This pottery has been described by some Chinese authorities as porcelain, but it fails to fulfil all the requirements of true porcelain. Made at Nanping.\n\nHeight, 5 inches.\nDiameter, 5 inches.\nPeriod, T'ang.\n\nFrom the collection of Taotai Hwang chung hwei.\nPLATE V\n\nVase. Pottery, a brown speckled glaze covering body and upper part of vase, lower parts being unglazed with twelve heads in high relief of animals of the Signs of the Zodiac, and inscriptions, under their respective heads, of each month of the year. It is a very interesting vase, and European connoisseurs are now giving their attention to the early pottery class.\n\nHeight, 14½ inches.\nPeriod, Sung.\n\nFrom the collection of Lee yen ching.\nPLATE VI\n\nPair of Tomb Urns. Pottery, covered with a cream-buff crackle glaze inclined to green in parts, surrounded with modelled figures and dragons in high relief, surmounted by covers with birds. These urns were excavated within the last two years, somewhere in Szechuan, Kansu or adjacent provinces, and though indifferent specimens are to be procured, perfect specimens in pairs with original covers, and the subjects of decoration in high relief and good glazes, are very rare. Opinions differ as to age, but all are agreed that they are earlier than the Ming period. The author places the period at the Sung Dynasty.\n\nHeight, 27 inches.\nPeriod, Sung.\n\nNow in the possession of John St. Audley.\nPLATE VII\n\nJar. Pottery, believed to be of an age before the Sung period, covered with a creamy glaze and decorations in sepia of grotesque figures and trees, with characters denoting a poem. This is a very interesting class of pottery, and a fine specimen.\n\nHeight, 12 inches.\nPeriod, Sung.\n\nFrom the collection of A. W. Bahr.\nPLATE VIII\n\nFlower Pot. Hexagonal, curved and indented sections. Porcelain, with blue and purple glazes over. A fine example of this ancient ware, which is much prized by Chinese collectors, considered one of the best of this class in the Exhibition.\n\nHeight, 7½ inches.\nDiameter, 10 inches.\nPeriod, Sung.\n\nFrom the collection of Taotai Hoo erh mai.\nPLATE IX\n\nDish. Oblong hexagonal, with indented edge. Blue-purple glaze over brown. Clair-de-lune class. This is known as the early Sung porcelain, and the deep purple and other colours have a charm of their own: much prized by Chinese and Japanese connoisseurs, who pay high prices for good and perfect specimens.\n\nHeight, 2½ inches.\nLength, 8 inches.\nPeriod, Sung.\n\nJar. Oviform, with curved lip, apple green crackled. The quality of the glaze is exceedingly good, and this is a valuable specimen of the apple green class, so popular with Chinese and American collectors.\n\nHeight, 6 inches.\nPeriod, Ming.\n\nDish. Round in curved sections, indented and concave edge. Blue-purple glaze over brown. Clair-de-lune class.\n\nHeight, 3 inches.\nLength, 9 inches.\nPeriod, Sung.\n\nFrom the collection of Bon ian zung.\nPLATE X\n\n**Vase.** Bottle shape, blue under-glaze decoration, with flowers and other ornamentation in two shades of red.\n\n*Mark,* blue seal.\n\n*Height,* 8½ inches.\n\n*Period,* Ch'ien-Lung.\n\n**Bottle.** With long neck, soft paste, blue and white, fine crackle, creamy white and fine blue decoration of vases, screen, peacock-feathers, etc.\n\n*Mark,* double ring.\n\n*Height,* 5 inches.\n\n*Period,* Kang-Hsi.\n\n**Vase.** Double gourd shape, five colour decoration of dragon, phoenix and peony.\n\n*Height,* 8¾ inches.\n\n*Period,* Yung-Cheng.\n\n**Boat.** With child seated inside, white soft paste, and incised key-pattern border round edge\n\n*Height,* 2 inches.\n\n*Length,* 7 inches.\n\n*Period,* Sung.\n\n*From the collection of Wong kai zur.*\nPLATE XI\n\nRock. Said to be excavated during the Sung Dynasty; shape is called \"The Curling Clouds,\" and is extraordinary and rare, the usual size being about the size of a fist. Much appreciated by Chinese collectors, and high prices are paid for similar articles. This specimen is said to be famous all over the Empire. The weight is heavy, and stone resembles iron-ore.\n\nHeight, 2 feet 8 inches.\nPeriod, Sung.\n\nFrom the collection of Zee kwan yin.\nIncense Burner or Bowl. Pottery covered with a green-tint glaze all over the body and base, and a kind of ripe-peach red bursting out in large patches and various size spots on part of the surface. The inside is only partially glazed to about half an inch from the rim, whilst the unglazed portion shows a brown-red pottery of apparently Sung origin. This specimen closely resembles the high priced and much admired peach bloom of the Kang-Hsi period, and is probably the result of the firing process used for the later product.\n\nHeight, 3\\(\\frac{1}{4}\\) inches.\nPeriod, Sung.\n\nNow in the possession of Charles L. Freer.\nPair of Vases, with high neck spreading to flanged rim, under which are animal-head handles with loose rings of the superfine quality soft paste or \"Fen-Ting,\" and covered with a brilliant glaze of a creamy tint. It is crackled in a most extraordinary way from the rim to the shoulder. The crackles decrease in size from the centre of the neck to the body, but again broaden towards the base; the quality of the crackle, which is even on the loose rings, is a point of great attraction. Under the glaze are deep and striking incised designs of dragon and flying phoenix, with formal patterns on neck and near base. Centre under the base is also glazed and crackled, with unglazed surface around. The Chinese connoisseurs prize the soft paste or \"Fen-Ting\" even above the famous peach bloom, apple green, or heavenly blue. These vases have the same weight as egg-shell porcelain. Chinese authorities are inclined to place the period at Sung, but the author is of opinion that the articles are of early Ming production.\n\nHeight, 7\\(\\frac{3}{4}\\) inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XIV\n\nVase, Blanc-de-chine. Of the very best shade of slightly pink glaze thickly coated over translucent porcelain. Neck has various floral designs and symbols in relief, and the body has similar patterns incised in paste under glaze, the whole producing a very attractive appearance. This class of porcelain, from the purity of paste and charm of various shades of white, pink, and cream, will undoubtedly increase in popularity at no distant date, and one has only to view a well displayed collection of this ware to be fascinated with its subtle charm.\n\nHeight, 14 inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XV\n\nFigure of the Goddess Kuan-Yin, standing on a pedestal, exquisitely modelled and covered with a rich creamy glaze, Blanc-de-chine. These good pieces of Blanc-de-chine are now much sought after by Chinese collectors, and are difficult to procure.\n\nHeight, 14 inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XVI\n\nVase, with wide neck, Blanc-de-chine.\nHeight, 6\\(\\frac{1}{4}\\) inches.\nPeriod, early Ming.\n\nVase, with wide base, lizard coiled round shoulder, Blanc-de-chine, of exquisite colour in subdued cream-pink translucent porcelain; a charming little piece.\nHeight, 4\\(\\frac{1}{2}\\) inches.\nPeriod, early Ming.\n\nVase, bottle shape, Blanc-de-chine, floral pattern modelled in paste.\nHeight, 12\\(\\frac{1}{2}\\) inches.\nPeriod, Kang-Hsi.\n\nPot on three feet, Blanc-de-chine, of exquisite colour and fine condition.\nHeight, 2\\(\\frac{3}{4}\\) inches.\nPeriod, early Ming.\n\nVase, with long neck, around which a lizard is coiled, of the best colour of pink-cream. This specimen is well worthy of attention. At present Chinese and Japanese connoisseurs are keenly competing for this class.\nHeight, 8 inches.\nPeriod, early Ming.\n\nFrom the collection of L Grenard.\nPLATE XVII\n\n**Figure Standing on Waves**; the Priest that walked across the Yangtsze river on a reed, to escape from the pursuit of the enemy. According to legend, he was a deified Priest who had supernatural powers and was sent from heaven to deliver the South from the Northern aggressors. The Figure is of a cream-yellow tint, of Blanc-de-chine, and the expression on the face shows the high standard of the art of that period.\n\n*Height*, 5½ inches.\n\n*Period*, early Ming.\n\n**Figure.** The God of Study or Literature, with head bent down in a thoughtful pose. The fine and deep lines that run through the whole figure make it very attractive and imposing. It is of the creamy white class of Blanc-de-chine.\n\n*Height*, 13 inches.\n\n*Period*, early Ming.\n\n**Statuette of the Goddess Kuan-Yin**, kneeling with a scroll in hand. It is of the pure white tint of Blanc-de-chine, and the perfect state, even to the finger tips, is worthy of attention.\n\n*Height*, 8 inches.\n\n*Period*, early Ming.\n\n*From the collection of A. W. Bahr.*\nPLATE XVIII\n\nPair of Teapots, with dragon handles and dragon spouts. One of the teapots is of a creamy pink tint, and the other of a yellow tint, both of Blanc-de-chine class. The purity of the porcelain is proved by its translucent qualities. The Blanc-de-chine manufactured in the Kang-Hsi period has a cold blue-white tinge and can be easily detected from that of Ming Blanc-de-chine, which has never been successfully imitated.\n\nHeight, 5 inches and $5\\frac{1}{2}$ inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XIX\n\nKylin, Blanc-de-chine. This ware is known as the \"Fuchien White,\" and the translucency, on account of the purity of the material used, is greatly esteemed.\n\nHeight, pair, 8 inches; single, 10 inches.\n\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XX\n\nFigure Representing Longevity. Five colour, a light coral red ground shading over cloak, and designs of flames, waves, bats, etc., in brilliant glazes of yellow, green, aubergine and turquoise blue; a brilliant example of the work of this period.\n\nHeight, 14 inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nIncense Burners. Pottery. Three colour, turquoise and yellow in relief on purple ground. Decoration, one, with handles of two fish rising out of the waters, and other, of two Kylins standing on hind legs; both are with animal-head supports.\n\nHeight, 6 inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XXII\n\nVase. Pear shape, with spreading neck, Famille verte, three colour. Decoration, raised design of flowers in high relief of rich purple, turquoise and cream colours, and two floral handles on neck in similar shades, the whole on a ground of light turquoise glaze thickly coated. Base also glazed.\n\nHeight, 16 inches.\nPeriod, early Ming.\n\nNow in the possession of Lord Kitchener.\nPLATE XXIII\n\nVase. With small neck. Pottery, three colour. Decoration, with purple, turquoise, yellow and other tints of thick enamel. Two panels with flying cranes; upper borders boldly outlined with rosettes, lower border plain bands in blue.\n\nHeight, 8 inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XXIV\n\nVase. Famille verte, three colour. Decoration, leaf pattern in turquoise on top of neck, flying phoenix and clouds in yellow and turquoise on indigo blue shading to purple ground. On lower part of neck, two unicorn-head handles, in purple, aubergine and turquoise. The body of vase with flying dragons, clouds and waves in brilliant colours of yellow, cream and turquoise, all on purple shade ground.\n\nHeight, 13 inches.\nPeriod, Ming.\n\nFrom the collection of A. W. Bahr.\nPLATE XXV\n\nPair of Bowls, white Egg-shell of beautiful translucency; incised in the paste are designs representing various symbolic signs, with the mark in four archaic characters of Yung-Lo. The paste is of the finest, and the workmanship leaves nothing to be desired.\n\nThese pieces are perfect specimens of the early egg-shell porcelain, called by the Chinese \"Bodyless,\" and described by native writers as being produced in the Yung-Lo period of the Ming Dynasty.\n\nDiameter, 8 inches.\nPeriod, early Ming.\n\nFrom the collection of A. W. Bahr\nPLATE XXVI\n\nVase. Bottle-shape. Sang-de-bœuf of rich blood red, not clotted like the Ming specimens, but perfectly clear; deep thick glaze, crackled towards top. Base glazed.\n\nHeight, 15 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of L. c. tung.\nPLATE XXVII\n\n**Vase.** Bottle shape. Sang-de-bœuf, crackled, with rich dark red glaze; a fine specimen of this valuable and rare class. Base is of light green celadon crackled.\n\n*Height,* 4 inches.\n\n*Period,* Kang-Hsi.\n\n**Vase.** Gourd shape. Sang-de-bœuf, crackled, similar to above in all details.\n\n*Height,* 4 inches.\n\n*Period,* Ming.\n\n**Vase.** Bottle shape. Celadon crackled, of the same class as the above Sang-de-bœuf, but instead of the red glaze it has the deep celadon glaze.\n\n*Height,* 4½ inches.\n\n*Period,* Ming.\n\n**Vase.** Bottle shape. Sang-de-bœuf, crackled. This is also similar to the first two pieces and of about the same grade.\n\n*Height,* 4 inches.\n\n*Period,* Ming.\n\n*From the collection of H.E. King siao san.*\nPLATE XXVIII\n\nGold-fish Bowl. Famille verte, three colour. Decoration, rich deep blue five-claw dragon and yellow flames, floral patterns and flowers, on coarse white porcelain. It has the well-known Mohammedan blue, and the yellow is deep and strong, a colour only found in Ming specimens; its very coarseness and grotesqueness lend a certain bold charm which is not found in later periods.\n\nMark on rim, 6 characters of the Wan-Li reign.\n\nHeight, 2 feet 4 inches.\n\nPeriod, Ming.\n\nFrom the collection of Wong kai zur.\nPLATE XXIX\n\nJar with Cover. Famille verte, five colour. Decoration, picture of palace ladies in a garden; colours, on white ground, principally deep red, blue and green. Base is not glazed.\n\nHeight, 15 inches.\nPeriod, Yung-Cheng.\n\nFrom the collection of Van yu yuen.\n\nJar. Five colour. Decoration, red and yellow gold-fish finely executed, and under glaze. Diaper band around the mouth and base.\n\nHeight, 13 inches.\nPeriod, Ming.\n\nFrom the collection of Lee ven ching.\n\nJar with Cover. Five colour. Floral decoration; the green and red are over the glaze, and blue is under the glaze.\n\nHeight, 20 inches.\nPeriod, Ming.\n\nFrom the collection of Ma chang kee.\nPLATE XXX\n\nVase. Double gourd shape. Blue and white. Conventional borders round neck, middle and base. The body decorated with dragon, phoenix and cloud scrolls, all in dark blue. A very fine example of the Mohammedan blue, which is used in the decoration of this specimen.\n\nMark, characters in double ring.\n\nHeight, 19 inches.\n\nPeriod, Ming.\n\nFrom the collection of L. Grenard.\nPLATE XXXI\n\n**Tea or Wine Pots.** Pottery, quaint shapes with smooth and even finish of a dark terra-cotta shade. One is shaped like the shell of a snail, another like a Chinese egg-plant. The old earthenware teapots are much sought after by Chinese connoisseurs.\n\n*Heights,* about 4 to 5 inches.\n\n*Period,* Ming.\n\n**Teapot** (in centre of illustration). Pottery. Decorated with designs of characters and scroll work inlaid with gold.\n\n*Height,* about 3 inches.\n\n*Period,* Ch'ien-Lung.\n\n*From the collection of Bon lan zung.*\nPLATE XXXII\n\nWriter's Water Bottle, with small neck and opening.\nPeach bloom glaze, with beautiful splashes of green and pink, producing an exceedingly attractive effect.\nMark, 6 characters.\nHeight, 3\\(\\frac{1}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nIncense Burner with handles. Apple green glaze, crackled.\nThis specimen is of a high class, as the colour reaches the much sought-after shade of the natural green of unripe apples.\nHeight, 3\\(\\frac{1}{2}\\) inches.\nPeriod, Ming.\n\nVase. Bottle shape, with long cylindrical neck. White glaze on soft paste porcelain.\nHeight, 6 inches.\nPeriod, Kang-Hsi.\n\nWriter's Water Bowl. Peach bloom glaze, with very prominent splashes of green and shading of various pinks; considered a very fine piece.\nMark, 6 characters.\nHeight, 1\\(\\frac{1}{2}\\) inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Kam hen tsung.\nPLATE XXXIII\n\n**Bottle and Writer's Water Bowl.** Glass. Creamy white and opal, decorated in fine Famille rose tints. These are exquisite and genuine specimens by the famous artist, Ku-yu-sien, and are very rare and costly, being much sought after by Chinese connoisseurs.\n\n*Marks,* 4 characters.\n\n*Height,* 3½ inches and 1¾ inches.\n\n*Period,* Ch'ien-Lung.\n\n**Vase.** Onion green, incised pattern under glaze. An uncommon specimen, and a beautiful colour. Chinese consider this vase a unique specimen.\n\n*Height,* 3½ inches.\n\n*Period,* Yung-Cheng.\n\n**Writer's Water Cup** (left of illustration). Sang-de-bœuf, crackled. Under base is the\n\n*Mark,* Ta Ming Ching hwa nien chih.\n\n*Diameter,* 4 inches.\n\n*Period,* Ming.\n\n**Writer's Water Cup** (right of illustration). Ruby coloured ground, with white and various coloured flowers and decoration in Famille rose. The specimen is one which is open to a difference of European expert opinion as to whether it is of Kang-Hsi or Yung-Cheng periods. Chinese experts agree to late Kang-Hsi. This piece is particularly admired by Chinese, and is of a similar class to the pair of bowls, Plate LXXXI.\n\n*Mark,* 4 characters, is that of Kang-Hsi reign.\n\n*Diameter,* 4½ inches.\n\n*Period,* Kang-Hsi.\n\n*From the collection of H.E. King siao san.*\nPLATE XXXIV\n\nBowl. Blue and white. Figure representing \"Longevity\" under a tree with eight immortals round the sides. This specimen presents two distinct shades of blue approaching the Kang-Hsi treatment.\n\nMark, characters in double ring, Wan-Li.\n\nDiameter, 9 inches.\n\nPeriod, Ming.\n\nBowl. Blue-tinted white, with light blue figures and flower on sides. On the base in a double ring are the characters Ta-cheng Shun-Chi. Shun-Chi, in the eleventh year of his reign, re-opened the Imperial Porcelain Factory at Kin-te-Chen. But little porcelain was made during the short reign of this Emperor, and pieces are seldom met with.\n\nDiameter, 5 inches.\n\nPeriod, Shun-Chi.\n\nPlate. Famille rose. Black ground with green and red floral decorations.\n\nMark, characters in double ring.\n\nDiameter, $5\\frac{3}{4}$ inches.\n\nPeriod, Yung-Cheng.\n\nBowl. Semi-eggshell porcelain, fine quality, and is a good specimen of the Famille verte, three colour class.\n\nMark, 6 characters in double ring.\n\nDiameter, 6 inches.\n\nPeriod, Kang-Hsi.\n\nFrom the collection of Taotai Hwang chung huci.\nPLATE XXXV\n\n**Vase.** Square shape, tapering towards the base with cylindrical neck. Famille noire. The four panels of this vase represent landscape effects of night, with the four different phases of the moon. Black ground is appropriate, being night scenes.\n\nThe enamel used in the decoration is very brilliant and thickly coated; the landscapes comprise rocks, mountains, trees, pagodas, boats and flowers; the neck is decorated with asters, rocks, etc.\n\nThe colour is principally shades of green, with yellow, white and aubergine.\n\n*Mark,* 6 characters.\n\n*Height,* 29 inches.\n\n*Period,* early Kang-Hsi.\n\n*From the collection of A. W. Bahr.*\nPLATE XXXVI\n\nVase. Oviform shape with expanding neck. Famille noire. Decoration, prunus blossoms, branches, birds and rocks in various greens, white, aubergine and yellow on a brilliant black enamel ground. This is a specimen known as the ascending prunus pattern, and the black ground is, as usual, covered with an almost invisible green glaze.\n\nMark, 6 characters enclosed in double ring.\n\nHeight, 27 inches.\n\nPeriod, early Kang-Hsi.\n\nFrom the collection of Ma chang kee.\nPLATE XXXVII\n\nFigure of Kuan-Yin. Famille verte, three colour. The cloak of whole body is covered with a vitreous cream glaze, with medallions of flying storks and clouds in aubergine, green and yellow; hood or mantle has a floral pattern also of the conventional three colours.\n\nHeight, 8 inches.\nPeriod, early Kang-Hsi.\n\nFigure of Kuan-Yin. A light celadon, the bodice of yellow ground with aubergine, green and black designs; the hair of the usual brilliant black.\n\nHeight, 10 inches.\nPeriod, early Kang-Hsi.\n\nFigure of a Taoist Divinity. All white vitreous glaze except brilliant black enamel of cap and beard; this is an uncommon figure, and the subject is interesting.\n\nHeight, 5 inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE XXXVIII\n\nPair of Green Parrots, with yellow, aubergine and green plinth stands; the beak and feet are in biscuit.\nHeight, 8½ inches.\nPeriod, early Kang-Hsi.\n\nPair of Three-Legged Green Toads, with children on backs. The children have yellow jackets with biscuit faces. All are Famille verte, three colour class.\nHeight, 6 inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of Lee yen ching.\nPLATE XXXIX\n\nVase. Famille jaune. Pale yellow ground, with rocks, branches of flowering prunus, and birds, in brilliant glazes of cream, aubergine, green and blue.\n\nMark, double ring with small square enclosed.\n\nHeight, $9\\frac{1}{2}$ inches.\n\nPeriod, early Kang-Hsi.\n\nFrom the collection of Ma chang kee.\nPLATE XL\n\nPuzzle Teapot in the form of a peach. Famille verte, three colour. Decoration, ground of brilliant apple green with one side, a carp with weeds, and other, a crab in brilliant enamels, of aubergine, green, and black. Spout and handle have black patches on green ground, and are held to the body by branches of leaves which are in high relief and enamelled in brilliant green. The lower part of the teapot is decorated with a darker shade of green leaves and aubergine flowers.\n\nHeight, $6\\frac{1}{2}$ inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE XLI\n\nPair of Kylin on stands, one with its young, and the other with a ball. Decorated with brilliant green glaze and sprinkling of yellow and aubergine, all lightly painted in the three colours of the Famille verte class.\n\nHeight, 16 inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of Yang tien chang.\n\nPair of Hounds. Black enamel throughout, excepting the collar, which is green; the mouth and teeth in white biscuit glaze. Famille verte, three colour class.\n\nHeight, 10 inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE XLII\n\nFlower Stand. Hexagonal shape. Famille verte, three colour. The top of stand is pierced. Decoration, prunus on a brilliant crackled-ice design of green ground. The painting is executed with the greatest delicacy and detail. A very rare specimen, and of a high standard of quality, which is not often seen in these articles.\n\nHeight, 7 inches.\n\nPeriod, early Kang-Hsi.\n\nFrom the collection of Lee yen ching\nPLATE XLIII\n\nWriter's Water Bottles. Wine God reclining against wine jar. Famille verte, three colour combination, and all have fine glazes.\n\nHeight, 3\\(\\frac{1}{2}\\) inches.\nPeriod, early Kang-Hsi.\n\nTeapot. Shape of a pomegranate. Famille verte, three colour. Decorated in aubergine, yellow and green.\n\nHeight, 3\\(\\frac{1}{2}\\) inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of R. D. Craig.\nPLATE XLIV\n\nVase. Square shape, tapering towards the base, with cylindrical neck. Famille noire. Decoration, eight white panels of various shapes with vases, utensils, etc., in aubergine, green and yellow; four reserves on body and two on neck with similar colours; all on black ground. Decoration is uncommon.\n\nMark, 6 characters.\nHeight, 18\\(\\frac{1}{4}\\) inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of M. Chapeaux.\nPLATE XLV\n\nBrush Pot. Famille verte, three colour; pierced bamboo pattern. Design is a rockery (not seen in illustration), yellow enamel, with bamboo stalks a rich aubergine, and prunus leaves and stems, green, yellow and cream, intertwined about the bamboo stalks.\n\nHeight, 6 inches.\nPeriod, early Kang-Hsi.\n\nThree-Legged Toad. Famille verte, three colour. Brilliant green enamel with breast of white glaze and tips of toes in black enamel; eyes of black, with yellow border.\n\nHeight, 5 inches.\nPeriod, early Kang-Hsi.\n\nBrush Pot. Famille verte, three colour; peacock blue glaze, pierced bamboo pattern, with bamboo foliage binding the same together.\n\nHeight, 6 inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE XLVI\n\nPair of Figures. Famille verte, three colour; white vitreous glaze. The one with yellow cloak and aubergine bowl in hand, shoe in brilliant green enamel; the other has jacket or cloak decorated with a chess-board design of black, aubergine, green and yellow enamels. The jovial expression on faces of figures is admired by Chinese.\n\nHeight, 5 inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE XLVII\n\n**Vase.** Square shape. Famille verte, three colour. Black fish-roe pattern on green ground; eight fan and leaf shape panels, with Kyilins, flowers, butterflies and other subjects, all in brilliant enamels of the class (black, yellow, green and aubergine). The whole vase is covered with vitreous glaze of a cream tint.\n\n*Mark,* at the base, a leaf.\n\n*Height,* 18 inches.\n\n*Period,* early Kang-Hsi.\n\n*From the collection of A. W. Bahr.*\nPLATE XLVIII\n\nFigure of Kuan-Yin in Grotto. Famille verte, three colour. Brown glaze, splashed with blue. Head and neck of principal figure in biscuit, blue and celadon garments. A dove in white, and vase with lotus in celadon on either side of shoulders; at side, smaller figures similarly treated.\n\nHeight, 11½ inches.\nPeriod, early Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPair of Egg-shell Tea-cups with covers, of beautiful chalk white quality and extra-thin texture. When held to the light the rings of the potter's wheel show, and from the paste and glaze they are undoubtedly early Kang-Hsi.\n\nThis special ware is much admired by Chinese connoisseurs.\n\nHeight, $3\\frac{1}{2}$ inches.\n\nPeriod, early Kang-Hsi.\n\nNow in the possession of J. Orange.\nPLATE L\n\nVase. Bottle shape, with long cylindrical neck. Peach bloom glaze, with splashes of green, on a pink-tint ground of various shades. A large specimen of this class of peach bloom variety.\n\nMark, 6 characters.\nHeight, 7 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LI\n\nVase. On neck are two animal-head handles and loose rings in biscuit. Monochrome. The body is decorated in archaic design modelled in paste, covered with dark green celadon glaze of the Kang-Hsi production of this class. A good example of the monochrome family; the shape, colour and mark made this piece of special interest to Chinese.\n\nMark, 6 characters in double ring.\nHeight, 12\\(\\frac{1}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LII\n\nVase and Writer's Water Bottles. Peach bloom. All of good colours, with prominent green spots and splashes. The high esteem of this class held by the Chinese is well known, and it is increasing in favour; no Chinese collector can boast of a porcelain collection if it does not include at least one specimen of this class.\n\nMarks, 6 characters.\nHeight of Vase, 6 inches.\n„ „ Water Bottles, 3½ inches.\nDiameter, 5 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Li chi bai.\nPLATE LIII\n\nVase. Bottle shape. White ground, with dragon in peach bloom colours under the glaze. Much esteemed by Chinese connoisseurs, the coiling dragon on a beautiful white ground gives a charming effect, which is considered characteristic of the good taste of the Chinese artist in early days.\n\nHeight, 7 inches.\nPeriod, Kang-Hsi.\n\nPair of Bowls. White ground. Design of chrysanthemum flowers and foliage in subdued peach bloom colours, all under glaze.\n\nMarks, 6 characters.\nHeight, 3\\(\\frac{1}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Wong kai zur.\nPLATE LIV\n\nPair of Bottles. Pure white porcelain, with decoration of dragons in peach bloom colours under the glaze. The colours appear strong in the illustration, but are really quite soft with the beautiful variety of tints belonging to the proper peach bloom class. This remark also applies to the articles shown in Plate LIII.\n\nMarks, 6 characters.\nHeight, 6½ inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of H.E. King siao san.\nPLATE LV\n\n**Vase.** Amphora shape. Clair-de-lune, sometimes called \"blue as the sky after rain.\"\n\nThis period has the best colour of this celebrated class.\n\n*Mark,* 6 characters.\n*Height,* 4½ inches.\n*Period,* Kang-Hsi.\n\n**Pilgrim Bottle,** with broad neck and handles. Clair-de-lune.\n\n*Mark,* seal.\n*Height,* 6 inches.\n*Period,* Ch'ien-Lung.\n\n**Writer's Water Bowl.** Clair-de-lune.\n\n*Mark,* seal.\n*Height,* 1¾ inches.\n*Period,* Yung-Cheng.\n\n*From the collection of H.E. King siao san.*\nPLATE LVI\n\nPair of Ginger Jars. Blue and white \"Hawthorn\" pattern, white flowers on a ground of brilliant blue. Very good specimens of the famous blue and white Ginger Jars. Decoration imitating prunus flowers of early spring, lying on cracked blue ice.\n\nHeight, 7 inches.\nPeriod, Kang-Hsi.\n\nStamp Box. Peach bloom glaze, with good sprinkling of green spots; a fine specimen of this class.\n\nHeight, 1½ inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of G. H. Thomson.\nPLATE LVII\n\nVase. Blue and white. Decoration of asters and foliage in brilliant and pure blue of varying shades upon a body of white porcelain.\n\nChinese connoisseurs appreciate articles of this form and decoration more than the Ginger Jar so popular in Europe.\n\nMark, double ring.\nHeight, 7 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LVIII\n\nPair of Vases. Blue and white. Decoration, in brilliant blue shades on white, of landscapes, with figures, cliffs, trees, waterfalls, houses, etc., in the conventional style; diaper pattern band on the neck.\n\nHeight, 2 feet 6 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LIX\n\nPair of Ginger Jars with covers. Blue and white. Decoration, blue on white, landscapes, with hills, trees, rivers and boats with figures.\n\nMarks, double ring.\nHeight, 8\\(\\frac{3}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nVase. Beaker shape. Blue and white. Decoration, blue on white, conventional landscape, with mountains, valleys, boats; all in fine varying shades of blue.\n\nMark, double ring.\nHeight, 16 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of D. Landale.\nPLATE LX\n\nVases. Square bodies, with circular necks and bases. Blue and white soft paste crackled. Decoration of asters and foliage in blue on white, with horizontal and vertical bars in relief. A shape much admired by Chinese.\n\nHeights, $6\\frac{3}{4}$ inches, $8\\frac{1}{2}$ inches, $10\\frac{3}{4}$ inches.\n\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXI\n\nVase. Beaker shape, blue and white. Ground work, a minute square-key pattern, and decoration of panels is in brilliant dark blue colours of several shades. In panels are landscapes with fishermen, boatmen and other figures.\n\nMark, 6 characters enclosed in double ring.\n\nHeight, 16\\(\\frac{1}{2}\\) inches.\n\nPeriod, Kang-Hsi.\n\nFrom the collection of La ven yuen.\nPLATE LXII\n\nVase. Powdered blue. Decoration, three sages and storks and child in Famille verte colours upon a brilliant blue ground.\n\nThe liberal use of gilt in various scroll work adds to the attractiveness of this class.\n\nHeight, 17 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXIII\n\nPair of Plates. Famille verte, three colour. Under the glaze inside and outside, five-claw dragons and clouds are engraved in the paste. Decoration, peaches, pomegranates and foliage in blue, yellow, aubergine and green enamels, and around the rim on the outside with roses and foliage in the same colours. The plates are representative of the best period of the early eighteenth century, and the peculiar glaze, when held in a strong light, reflects pleasing rainbow tints.\n\nMarks, 6 characters in double ring.\nDiameter, 9\\(\\frac{3}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nPair of Bowls. Semi-eggshell porcelain of fine quality; the colours, etc., are of the same grade and style as above.\n\nMarks, 6 characters in double ring.\nHeight, 2\\(\\frac{5}{8}\\) inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXIV\n\nSet of Three Jars. Famille verte, five colour. Decoration, pheasants, rocks, chrysanthemum, butterflies, etc., upon a body of soft paste with a beautiful floating glaze. The crackle commences from the base and reaches about half-way up. The paste unquestionably approaches the soft paste quality, and is not the usual hard standard of this class of decorated porcelain; and from the colour and texture of the Famille verte enamels these jars show that five colour decoration on soft paste was probably commenced about the middle of the Kang-Hsi period.\n\nHeight, of Jars, 8 inches and 16 inches.\n\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXV\n\n**Vase.** Square shaped and tapering. Famille verte, five colour. Decoration, interiors with figures very finely drawn, and with enamels of various shades of the five colours. This piece was particularly admired by the Chinese on account of the purity of the enamels, the many shades of colours, and the brilliant glaze; also for the square spreading neck, which is unusual.\n\n*Height, 19\\(\\frac{3}{4}\\) inches.*\n\n*Period,* Kang-Hsi.\n\n*From the collection of A. W. Bahr.*\nPLATE LXVI\n\nVase. Famille verte, five colour. Decoration, a rich coral red figure, representing a Demon with attendants, in various colours, diaper red ground, with four reserves of butterflies, etc., and bamboo foliage on the neck.\n\nHeight, 17½ inches.\nPeriod, Kang-Hsi.\n\nVase. Double gourd shape. Famille verte, five colour. Decoration, a figure of one of the eight Immortals on the crest of waves, and storks painted in rich enamels and finely executed.\n\nHeight, 14 inches.\nPeriod, Kang-Hsi.\n\nVase. Oviform. Famille verte, five colour. Decoration, figure of God of Heaven and other Immortals; a green ground diaper pattern on the shoulder, with four panels of butterflies, etc., all in brilliant enamels.\n\nHeight, 17½ inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Ho chun lee.\nPLATE LXVII\n\nPair of Birthday Plates. Famille verte, five colour. Decoration, coral red fancy border in which are four medallions with characters representing \"Longevity.\" The centre decoration is of a lady with maid, a chariot, and deer, in fine and brilliant green and coral red colours.\n\nMarks, 6 characters in double blue rings.\nDiameter, 10 inches.\nPeriod, Kang-Hsi.\n\nVase. Famille verte, five colour. Decoration, student reading under an old tree in autumn; brilliantly enamelled and of fine porcelain. The style of the painting is of the classic order, and this is a specimen of the best of Kang-Hsi productions.\n\nHeight, 10\\(\\frac{3}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Ho chun lee.\nPLATE LXVIII\n\nFour Bowls, Famille verte, five colour. Decoration represents palace ladies, with long graceful robes, walking; chariot preceding attached to a Kylin; deer and rocks at back. The robes of the ladies are all of different coloured enamels, and the brilliancy of these enamels must be seen to be appreciated. These are very fine and rare bowls, as the exquisite miniature painting on them is not usually found in Famille verte pieces; it is more in accord with the quality of the Yung-Cheng artists than with the stronger and more brilliant enamels of the Kang-Hsi Famille verte. The painting is exceedingly minute.\n\nMarks, 6 characters, Ming mark, in double ring.\n\nHeight, $2\\frac{1}{2}$ inches.\n\nDiameter, $5\\frac{1}{2}$ inches.\n\nPeriod, Kang-Hsi.\n\nFrom the collections of D. Melnikoff and A. W. Bahr.\nPLATE LXIX\n\nVase. Famille verte, five colour. Decoration, large figures of ladies examining scrolls, playing chess, musical instruments, etc.; on shoulder are four medallions enclosing floral designs; on neck, rocks and bamboos are the principal decorations, with small key-pattern ground on side of rim. The enamel used in decoration of this piece is of the highest quality, and the black is particularly brilliant. This is probably a late production of this period.\n\nHeight, 17 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Ho chun lee.\nPLATE LXX\n\nPlate. Famille verte, five colour. Decoration, three figures at a table of rock, two are playing chess, with surroundings of rocks, fir trees, etc., in brilliant colours of green, red, aubergine, yellow and blue; the green enamel predominates and shows to fine effect.\n\nMark, leaf and fillet in double ring.\nDiameter, $15\\frac{1}{2}$ inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXI\n\nBowls. Famille verte, five colour. Decoration, agricultural and domestic scenes. The brilliant enamels used and the technique in the drawing are of high quality. The rich and beautiful enamels used during the middle part of the period of Kang-Hsi are all represented in their various tints to the best effect and advantage. It is said that the Emperor Kang-Hsi had a special liking for agricultural subjects, and accordingly ordered the best artists in the Imperial Pottery works to give particular attention to this class of decoration. The porcelain is hard and pure white, and there are no marks at the base. Inscription, explaining the subject in poetical terms, is written in gold characters on each bowl, with the seal of the artist and writer.\n\nHeight, 3½ inches.\nDiameter, 7¼ inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXII\n\nPlate. Famille verte, five colour. Decoration, house in valley, with figures on the balcony, surrounded with mountains and with trees in blossom. It is enamelled in brilliant colours of green and blue especially, with a trace, hardly perceptible, of red, giving almost the appearance of a three colour plate. This plate is very attractive as a fine piece of landscape drawing, besides being an uncommon subject in Famille verte dishes.\n\nMark, diamond with fillet in double ring.\nDiameter, $15\\frac{1}{4}$ inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXIII\n\nVase, with cylindrical neck and upright flanges. Famille verte, five colour. Decoration, various floral designs, with conventional asters in coral red evenly distributed on green ground. Two large panels have pictures of, on one side, a romantic scene, and on other an audience of military officials; also four fan-shaped panels of flowers, trees, etc., all in brilliant enamels of the highest quality. On shoulder are also four small reserves of asters; neck is decorated with a bamboo in sepia tones.\n\nHeight, 18 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXIV\n\nDish, with deep sides and sloping flange. Famille verte five colour. Decoration, in centre, two female figures seated in garden under a willow tree, from which a bird in a cage is suspended. The sides are white, except a narrow battlemented border round the bottom. The flange has a ground of frog-spawn diaper, with chrysanthemum and berries; six white reserves contain various symbols.\n\nHeight, 6 inches.\nDiameter, 16 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXV\n\nPair of Plates. Famille verte, five colour. Celebrated as the Birthday plates, said to have been made to commemorate the sixtieth birthday of the Emperor Kang-Hsi. The decoration of pheasants, storks, peacocks and other birds, trees and flowers is all in the most perfect Chinese taste. The colouring, which is of a subdued tone, nevertheless excels in purity of enamels, and undoubtedly shows the excellence of the production of this period.\n\nBorder of these plates is decorated in fancy diaper designs, with four medallions containing the character \"Longevity.\"\n\nMarks, 6 characters in double ring.\nDiameter, 10 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Ho chun lee.\nPLATE LXXVI\n\nDish. Famille verte, five colour. Decoration, a basket of flowers in centre, surrounded by diaper border, with flowers in reserves.\n\n*Diameter,* 13\\(\\frac{3}{4}\\) inches.\n\n*Period,* Kang-Hsi.\n\nDish. Famille verte, five colour. Decoration, mounted figures in landscape.\n\n*Mark,* flowers in double ring.\n\n*Diameter,* 10\\(\\frac{3}{4}\\) inches.\n\n*Period,* Kang-Hsi.\n\nDish. Famille verte, five colour. Decoration, two females with a child on verandah of house, and plum tree with red blossoms. A diaper border with decorated reserves.\n\n*Diameter,* 8\\(\\frac{1}{2}\\) inches.\n\n*Period,* Kang-Hsi.\n\n*From the collection of D. Melnikoff.*\nPLATE LXXVII\n\n**Vase.** Famille verte, five colour. Decoration, coral red and white diaper ground, bearing turquoise blue chrysanthemum. Two panels, one containing \"Mynah\" birds, in black, perched on a branch of red prunus; other, a pair of jays perched on a branch of magnolia. Four circular reserves in white, two on each side, containing landscapes, insects and flowers, all painted in brilliant enamels. This specimen is a very ornate and brilliant piece of Famille verte; the colours of the enamel are of the highest quality, and the execution by the artist leaves nothing to be desired.\n\n*Mark,* double ring in blue.\n\n*Height,* 18\\(\\frac{3}{8}\\) inches.\n\n*Period,* Kang-Hsi.\n\nNow in the possession of Lord Kitchener.\nPLATE LXXVIII\n\nVase. Wide mouth with flange. Famille verte, five colour. Decoration, bold scroll or fringe-like pattern, foliated borders, with diaper and flower pattern in rich enamels. White body, with medallions and characters in colour.\n\nHeight, 16 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXIX\n\nFigure of Unicorn. Famille verte, five colour. The ground of body pencilled in rich brown, chest decorated in a vivid hue of coral red, horns of yellow with black stripes, face of various tints of Famille verte; and stand of a cloud pattern, decorated in brilliant tints of yellow, green, aubergine and red. Considered to be an uncommon specimen.\n\nHeight, 6\\(\\frac{3}{4}\\) inches.\nPeriod, Kang-Hsi.\n\nNow in the possession of P. Ralli.\nPLATE LXXX\n\nFour Pairs of Miniature Vases and Bottles. Famille rose, painted with good taste and delicate colours. They are fine specimens of the early Yung-Cheng colour and drawing, and the porcelain is also of superfine quality. Probably made at the Imperial Works for palace use only.\n\nMarks, 6 characters of the period.\nHeight, $2\\frac{1}{4}$ inches to $3\\frac{1}{2}$ inches.\nPeriod, Yung-Cheng.\n\nFrom the collection of Li chi bai.\nPLATE LXXXI\n\nPair of Bowls. Famille rose. Ruby ground with lilies, peonies and marguerites, all in fine enamels. These are very rare specimens, there being but little Famille rose with Kang-Hsi mark (see remarks on Writer's Water Bottle, Plate xxxiii).\n\nMarks, raised characters in seal border.\n\nHeight, 2½ inches.\nDiameter, 5 inches.\nPeriod, Kang-Hsi.\n\nFrom the collection of Bon lan zung.\n\nVase. Bottle shape, sloping shoulder to neck, with flange top. Famille rose. Pea green graviata ground, with red, blue and pink flowers, rose-coloured scarf around the neck. Children, in various coloured garments, around the shoulder and base. The bright and finely finished little figures make a striking contrast to the even colouring of the graviata ground.\n\nHeight, 15 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXXII\n\nVase. Oviform. Famille rose. Decoration, plum blossoms, branches, leaves and birds, in finest Famille rose tints, and fungus in coral red, all on a pure white ground. This style of form, decoration and colouring is particularly admired by Chinese.\n\nHeight, 16 inches.\nPeriod, Yung-Cheng.\n\nNow in the possession of J. Stirling.\nPLATE LXXXIII\n\nVase. Famille rose. Decoration, utensils, fruits, flower baskets, vases, incense burners, etc., in high relief with paintings of butterflies. Fish-roe ground of light green around the shoulder of vase, with six asters of yellow and light shades, merging at neck into an \"ee\" ground of rich brown with rocks, clouds and foliage in Famille rose tints and in high relief.\n\nHeight, 17½ inches.\n\nPeriod, Yung-Cheng.\n\nFrom the collection of A. W. Bahr.\nPLATE LXXXIV\n\nVase. Oviform, with narrow neck and spreading mouth. Famille rose. Decoration, rocks, birds and flowers in finest tints of Famille rose of this period. The painting is exceedingly good and probably by an artist of repute; the porcelain is of a particularly fine quality.\n\nHeight, 10 inches.\nPeriod, Yung-Cheng.\n\nFrom the collection of Ho chun lee.\nPLATE LXXXV\n\nPair of Square Flower Pots. Famille rose. Decoration on one, cow-boy riding and playing the flute, on other, an old man riding on donkey, with boy following; painted in soft tints of sepia and various colours. The delicacy of painting and contrasts of shades of sepia and colours on the exquisite white, put these pieces in the very first rank of the productions of this period.\n\nHeight, 5½ inches.\nPeriod, Yung-Cheng.\n\nVase. Bottle-shape. Famille rose. Decoration, in blue under the glaze, trees, rocks, etc.; and numerous monkeys in sepia, red and other tints, finely drawn with much detail.\n\nHeight, 10 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Ho chun lee.\nPLATE LXXXVI\n\nBrush Holder. Famille rose. Decoration, old men playing Chinese chess. The special point of this article is the strength and purity of the colour used.\n\nHeight, 11\\(\\frac{1}{2}\\) inches.\nPeriod, Yung-Cheng.\n\nBowl. Famille rose. Decoration, rows of branches bearing peach blossoms of exquisite and pleasing colours, in the Ku-yu-sien style of painting.\n\nHeight, 2 inches.\nPeriod, Yung-Cheng.\n\nBottle. Famille rose. Egg-shell porcelain. Decoration, two figures and rocks in attractive colours and fine finish. A rare and much prized specimen.\n\nHeight, 5\\(\\frac{1}{2}\\) inches.\nPeriod, Yung-Cheng.\n\nFrom the collection of H.E. King siao san.\nPLATE LXXXVII\n\n**Vase.** Famille rose. Decoration, lady in wheel-chair, with a yellow stag, and surrounded by attendants.\n\n*Height,* 17 inches.\n\n*Period,* Yung-Cheng.\n\n*From the collection of La kwei sung.*\n\n**Vase.** Famille rose. Decoration, peonies and prunus blossoms; two birds in black, pale blue, and white; two birds in two shades of brown.\n\n*Height,* 17½ inches.\n\n*Period,* Yung-Cheng.\n\n*From the collection of R. D. Craig.*\n\n**Vase.** Famille rose. Decoration, two ladies seated at a table, with others playing musical instruments.\n\n*Height,* 16 inches.\n\n*Period,* Yung-Cheng.\n\n*From the collection of Taotai Hoo erh mai.*\nPLATE LXXXVIII\n\n**Vase.** Oviform, with neck expanding to a wide rim. Famille rose. Decoration, figures and willow tree; a double border in green around the shoulder.\n\n*Height, 16\\(\\frac{1}{2}\\) inches.*\n\n*Period, Yung-Cheng.*\n\n*From the collection of d'Auxion de Ruffé.*\n\n**Vase.** Cylindrical, with curved neck. Blue and white. Decoration, figures, spotted stag, and palm trees.\n\n*Height, 18 inches.*\n\n*Period, Yung-Cheng.*\n\n*From the collection of Taotai Hoo erh mai.*\n\n**Vase.** Oviform, with neck expanding to a wide rim. Famille rose. Decoration, figures, one mounted on a lion.\n\n*Height, 16\\(\\frac{1}{2}\\) inches.*\n\n*Period, Yung-Cheng.*\n\n*From the collection of J. N. Jameson.*\nPLATE LXXXIX\n\nPair of Figures. Famille rose. Decoration, one figure with a coral red cloak, gold pencilled reserves of flying phoenix with band around the edge of the cloak in green with floral designs; in hands, small urn and vase.\n\nOther figure decorated with a green cloak, and reserves, in black, with dragons, the band or girdle in brown with floral designs; in hands, lotus leaf and flower and coral red vase.\n\nHeight, 8 inches.\nPeriod, Yung-Cheng.\n\nNow in the possession of J. Wormald.\nPLATE XC\n\nPair of Bowls, with covers. Famille verte, five colour, semi-eggshell. Decoration, dragons and clouds, under-glazed blue, and brilliant over-glazed enamels.\n\nMarks, characters.\nHeight, 5 inches.\nDiameter, 8 inches.\nPeriod, Yung-Cheng.\n\nBowl, with cover. Famille verte, five colour, semi-eggshell. Decoration, spray of red prunus blossom, and birds; under-glazed blue, and fine over-glaze enamels.\n\nMark, characters.\nHeight, 5 inches.\nDiameter, 8 inches.\nPeriod, Yung-Cheng.\n\nFrom the collection of C. O. Liddell.\nPLATE XCI\n\nPair of Jars, with covers. Famille verte, five colour. Decoration, ladies and children playing, reading, etc. The enamels are of a light and brilliant class and show no trace of rose, so that, though the design and porcelain denote the period as Yung-Cheng, the colour of the enamels would seem to be Kang-Hsi. Unglazed base.\n\nHeight, 15 inches.\nPeriod, Yung-Cheng.\n\nFrom the collection of A. W. Bahr.\nPLATE XCII\n\n**Bottle.** Red and blue. Decoration, rich red and salmon coloured dragon in blue clouds, all well drawn in bold design. A fine specimen of the under-glaze work of this period; the colours are very striking.\n\n*Mark,* Ming characters.\n\n*Height,* 12½ inches.\n\n*Period,* Yung-Cheng.\n\n*From the collection of Yu tze sor.*\n\n**Vase,** with dragon handles on neck. Red and blue. Decoration, coral red bats flying in blue clouds, blue formal band on rim, neck and near base. The effect of the style of decoration is very pretty and attractive.\n\n*Mark,* blue seal.\n\n*Height,* 21¾ inches.\n\n*Period,* Ch’ien-Lung.\n\n*From the collection of G. D. Coutts.*\n\n**Bottle.** Red and blue. Decoration, on white ground with red and peach bloom tints and green spots, Kyilins playing with a ball, peach bloom colours, and blue ribbons flying loose. Formal diaper band, red and peach bloom tints, on rim of neck and on shoulder, blue diaper pattern near base, all under glaze. A fine specimen of this class.\n\n*Mark,* blue seal.\n\n*Height,* 11½ inches.\n\n*Period,* Ch’ien-Lung.\n\n*From the collection of A. W. Bahr.*\nPLATE XCIII\n\nPair of Vases, double gourd shape (or so-called Pilgrim bottles), with handles. Famille rose. Coral red ground, with gold decorations and two panels in white, containing figures of boys playing at different games. Colours of fine quality and painting good. The coral red ground harmonises very well with the Famille rose tints. These vases are uncommon, and the seal mark is of an Imperial Pottery.\n\nMarks, blue square seal of 6 characters on turquoise ground.\n\nHeight, 7 inches.\n\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE XCIV\n\nVase. Pear shape, with short neck and wide mouth, and dragon handles. Famille rose. The decoration is known as \"Mille Cerf.\" The colouring is chiefly in browns and greens. The stems of pines are sepia and browns, drawing of the hills sepia and coloured in browns and green, some of the peaks are in blue enamel.\n\nMark, square seal in blue.\nHeight, $17\\frac{1}{2}$ inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE XCV\n\nVase. Bottle shape, with cylindrical neck. Famille rose. Decoration, on white ground, a prunus tree with blossoms of pink, red and coral red, and sepia branches with shadings of a dull yellow; four magpies perched on the branches.\n\nMark, square seal in blue.\nHeight, 20 inches.\nPeriod, Ch’ien-Lung.\n\nFrom the collection of B. Rosenbaum.\nPLATE XCVI\n\nPair of Bowls. Famille rose. Decoration, called \"Mille Fleur.\" Conventional flowers on yellow ground. These bowls were only used at the Imperial table.\n\nMarks, raised blue seal, 4 characters with double lined border.\n\nHeight, 2½ inches.\nDiameter, 6 inches.\nPeriod, Ch'ien-Lung.\n\nFigure of Kuan-Yin. Famille rose. Apron has floral design black on green, cloak also has floral design in creamy white; Famille rose decorations on beads, etc.\n\nHeight, 13 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE XCVII\n\nPair of Jars, with covers. Famille rose. Turquoise blue enamel ground, covered with flowers in various coloured enamels, and outlined in gold. This pair of vases is a high-class production of the Ch'ien-Lung period; the execution of the drawing is wonderfully fine and accurate, and shade of the turquoise ground is superb.\n\nMarks, red seal and 6 characters.\n\nHeight, 16 inches\n\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Yu tze sor.\nPLATE XCVIII\n\nPair of Cups. Famille rose. \"Mille Fleur.\" Floral decoration in enamels, covering the exterior; gilt edge. A brilliant class of production of this period; the many colours of all kinds of flowers crowded on the surface give an artistic and pleasing effect.\n\nHeight, 2½ inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of C. O. Liddell.\n\nVase. Famille rose. Decoration, landscape of hill, with temples and fine trees. This vase is of the style known as Ku-yu-sien, and the soft tints and beautiful execution are much admired by Chinese connoisseurs.\n\nHeight, 8 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Wong kai zur.\nPLATE XCIX\n\nMiniature Vases and Jars. Famille rose. Blue and white. This was an interesting exhibit; most of the articles are very delicately drawn, with figures, etc., in fine colours.\n\nHeight, 1 inch to 2 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Peter Bahr.\nPLATE C\n\nPorcelain Snuff Bottles. Famille rose. Delicately painted with flowers, children, etc., in variegated colours; flat in shape, with jade and glass stoppers fitted.\n\nPeriod, Ch’ien-Lung.\n\nFrom the collection of Liu wen choo.\nPLATE CI\n\nSnuff Bottles. Famille rose. Fine crackled soft paste, mostly decorated in Famille rose colours and subjects in high relief; two are delicately pierced.\n\nHeight, from 2 inches to $2\\frac{1}{2}$ inches.\n\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE CII\n\n**Five Snuff Bottles.** Glass, with exquisite drawings of landscapes, flowers, etc., in variegated colours, and with jade stoppers. Two of these are drawn by the famous artist Ku-yu-sien, and are extremely rare and much sought after by Chinese collectors.\n\n*Marks,* characters.\n\n*Period,* Ch’ien-Lung.\n\n**Four Snuff Bottles.** Enamel on copper, finely drawn, with landscapes, flowers, etc., in colours.\n\n*Marks,* characters.\n\n*Period,* Ch’ien-Lung.\n\n*From the collection of Liu wen choo.*\nPair of Framed Sets of Porcelain Plaques. Famille verte, five colour. Frame on left of illustration has centre plaque, $8\\frac{3}{4}$ inches square, decorated with landscape; floral designs on side panels. Frame on right of illustration has centre plaque of same size, decorated with audience chamber and figures; side panels of floral designs.\n\nPeriod, Kang-Hsi.\n\nPanel, $20\\frac{3}{4}$ inches square. Blue and white porcelain characters and figures, inlaid on a groundwork of painted cement.\n\nPeriod, Ch’ien-Lung.\n\nFramed Plaque. Blue and white porcelain, with landscape decoration.\n\nSize, 14 inches by 12 inches.\n\nPeriod, Ch’ien-Lung.\n\nFramed Plaque on stand. Famille rose. Decoration, landscape, with trees and temples, finely painted in five colour enamels.\n\nSize, $16\\frac{1}{2}$ inches by $13\\frac{1}{2}$ inches.\n\nPeriod, Ch’ien-Lung.\n\nFramed Porcelain Picture Plaque. Famille rose. The subject, man in a boat, and man seated on rock above, is in porcelain and inlaid on a groundwork of painted cement.\n\nSize, $25\\frac{1}{2}$ inches by 16 inches.\n\nPeriod, Ch’ien-Lung.\n\nFrom the collection of Taotai Shen tun ho.\nPLATE CIV\n\nPanels, on which are fixed half vases and beakers of porcelain from 8 inches to 12 inches high, mostly Famille rose, all exquisitely decorated and of equal standard of quality with whole vases of same style and period. This form of ornament is much esteemed by Chinese for use in important rooms.\n\nPeriods, Ch'ien-Lung, Yung-Cheng, and Kang-Hsi.\n\nFrom the collection of Sien tse za.\nPLATE CV\n\nPorcelain Plaque. Framed and on stand. Famille rose. Decoration, mountains, lakes and rapids, temples and houses, with trees and high cliffs, finely painted in Famille rose enamels.\n\nThese plaques are generally placed at the side of the main table in reception halls, with a vase on other side, and are articles of decoration much prized by the Chinese gentry.\n\nSize, 24 inches by 18 inches.\n\nPeriod, Ch’ien-Lung.\n\nFrom the collection of Zee lee yuen.\nPLATE CVI\n\nPlaque. Framed. Famille rose. Porcelain figures inlaid on neutral-tint painted cement ground.\n\nThe figures, \"eight Immortals,\" are decorated in various tints of Famille rose enamels and in slight relief, which gives a striking appearance to the picture. The name of the artist is given on the two porcelain seals at the left side. This plaque is used as a picture, and placed on walls.\n\nSize, 43 inches by 24 inches.\n\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Taotai Shen tun ho.\nPLATE CVII\n\nPair of Vases, with handles on neck. Flambé of red tint with splashes of blue and grey.\n\nHeight, 10 inches.\nPeriod, Ch’ien-Lung.\n\nVase. Flambé in reds and greens. The Flambé class is very popular with Chinese collectors, and the extraordinary variety of shades is very remarkable.\n\nHeight, 8 inches.\nPeriod, Ch’ien-Lung.\n\nVase. Double gourd shape. Flambé in red, blue, purple, and yellow.\n\nHeight, 9 inches.\nPeriod, Ch’ien-Lung.\n\nFrom the collection of F. E. Wilkinson.\nPLATE CVIII\n\nFigures. Famille rose. Three Immortals, representing \"Longevity,\" happiness, and rank or fortune. Robes are highly ornamented with variegated colours. The stands are a yellow ground with diaper pattern in blue and other enamels, with a pewter rim to preserve edges.\n\nHeight, 24 inches.\nPeriod, Ch’ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE CIX\n\nVase. Peking enamel on copper. Design of an embroidered kerchief knotted around top of vase, which has a ground of rich red, with various scrolls and floral designs of Famille rose tints. This is a rare specimen of the ware, and drawing is superior and workmanship perfect.\n\nHeight, 12 inches.\nPeriod, Ch’ien-Lung.\n\nFrom the collection of D. Landale.\nIncense Burner. Peking enamel on copper. Decoration of scroll and floral ground, with panels on either side containing landscapes; buildings and figures are European of the eighteenth century. This is a fine specimen of the ware made during this period, and the rich colours of Famille rose enamels used are very attractive.\n\nHeight, 16 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Wong kai zur.\nPLATE CXI\n\nPair of Teapots, Plates and Bowl. Peking enamel on copper. The figures on teapots are in eighteenth century costume, and interesting as made for Europe. All are of exquisite colours in Famille rose.\n\nPeriod, Ch’ien-Lung.\n\nFrom the collection of Dr. A. Stanley.\nPLATE CXII\n\nFish Bowl. Peking enamel on copper. Decoration, scroll and floral design, with two oval panels containing landscapes of buildings, trees and figures, imitating eighteenth century European picture. Fine colours of Famille rose.\n\nHeight, 18 inches.\nDiameter, 24 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Wong kai zur.\nPLATE CXIII\n\nWhite Jade Articles, consisting of spill holders, wine cups, Kyllins, deer, water bottles, etc., all carved in the Ch'ien-Lung period, and of exquisite quality, even shades, and a richness combined with simplicity of carving which has perfect finish.\n\nThis group of small articles was specially selected from a large collection as specimens of the quality most admired by Chinese collectors. Simplicity, even colour, correct proportion and perfect finish are the points valued.\n\nPeriod, Ch'ien-Lung.\n\nFrom the collection of D. Pecorini.\nPLATE CXIV\n\nFigures and Brush Holder. White jade, of even colour and beautiful workmanship. The carving of the figures is extremely fine, each single hair on heads being clearly marked.\n\nHeight, of figures, 3 inches.\n\" holder, 2\\(\\frac{1}{2}\\)\" inches.\n\nPeriod, Ch'ien-Lung.\n\nFrom the collection of D. Pecorini.\nPLATE CXV\n\nGreen Jade Bottle, with cover. Two boys and dragons carved on bottle in high relief. The carving is finely executed, and the size of this specimen is uncommon.\n\nHeight, 7 inches.\nPeriod, Ch’ien-Lung.\n\nBottle, with cover, resting on a mythical bird, made of a pink stone. This work is well finished and the size uncommon.\n\nHeight, 8½ inches.\nPeriod, Ch’ien-Lung.\n\nCarved Crystal Bottle, with cover, well executed in the carving.\n\nHeight, 7 inches.\nPeriod, Ch’ien-Lung.\n\nFrom the collection of Yu tze sor.\nPLATE CXVI\n\n**Bottle.** Clear glass of two tints, top red-colour layer carved in floral pattern in high relief, leaving the yellow ground visible.\n\n*Mark,* seal.\n\n*Height,* 8½ inches.\n\n*Period,* Ch’ien-Lung.\n\n*From the collection of Bon lan zung.*\n\n**Bottle.** Glass, upper red layer carved with storks, trees, flowers, etc., in high relief, leaving the lower layer of speckled white visible.\n\n*Mark,* seal.\n\n*Height,* 8¾ inches.\n\n*Period,* Ch’ien-Lung.\n\n*From the collection of A. W. Bahr.*\n\n**Bottle.** Glass; as above, red layer carved in high relief, with under layer of speckled white.\n\n*Mark,* seal.\n\n*Height,* 7½ inches.\n\n*Period,* Ch’ien-Lung.\n\n*From the collection of G. H. Thomson.*\nPLATE CXVII\n\nCarriage. Carved red lacquer, a model of that used by the Emperor Ch'ien-Lung within the palace precincts. It is rectangular in shape, supporting a tray on which are five boxes, and in the lower part of the carriage are two drawers; wheels have gilt brass tyres; posts supporting the upper portion, as well as the four small corner posts on the top, are of brass gilt. Panels of flowers are carved in the red lacquer in high relief, leaving the black ground. The whole workmanship is of the best, and finish, as well as quality of the lacquer, leaves nothing to be desired. The article is used as a jewel box by palace ladies, and is a rare specimen of the lacquer class.\n\nHeight, 10\\(\\frac{1}{4}\\) inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. W. Bahr.\nPLATE CXVIII\n\nFigure of a Sage, with staff and fan, in ivory tusk, well carved and good finish.\n\nHeight, 14\\(\\frac{1}{2}\\) inches.\nPeriod, Ch'ien-Lung.\n\nScreen on Stand. Ivory. The panel is a picture with house, figures, trees, flowers, etc., enriched in colours on a delicately pierced ground. The stand is also exquisitely carved with pierced work, and shows the wonderful art of the carver in the minute figures, etc., especially in lower part of the stand.\n\nHeight, 10 inches.\nPeriod, Ch'ien-Lung.\n\nNow in the possession of M. Permezel.\n\nFigure. Ivory. An old man kneeling by a stag, a very attractive and well executed work.\n\nHeight, 7\\(\\frac{1}{2}\\) inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of Mrs. F. Ayscough.\nPLATE CXIX\n\nHelmet. Pottery, three colours of yellow, green and aubergine. Supposed to have come from the Imperial palace. The design clearly copies a European helmet of the Middle Ages, and is attributable to the strong foreign influence during this emperor's reign.\n\nHeight, 22 inches.\nPeriod, Ch'ien-Lung.\n\nFrom the collection of A. Rose.\nPLATE CXX\n\nVase. Pear shape, with spreading base, neck expanding to flanged rim, and handles. Famille rose. Glossy black ground, with two small panels on neck containing figures, and two panels on body containing groups of figures, all painted in fine colour enamels. This is an uncommon and interesting production of the period.\n\nMark, double ring on base.\n\nHeight, 15\\(\\frac{1}{4}\\) inches.\n\nPeriod, Tao-Kwang.\n\nFrom the collection of Sir C. P. Chater.\n", "source": "olmocr", "added": "2025-09-26", "created": "2025-09-26", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/cu31924023327012.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 446, "total-input-tokens": 636538, "total-output-tokens": 48293, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 48, 7], [48, 48, 8], [48, 48, 9], [48, 48, 10], [48, 48, 11], [48, 48, 12], [48, 350, 13], [350, 350, 14], [350, 761, 15], [761, 761, 16], [761, 1783, 17], [1783, 3730, 18], [3730, 4171, 19], [4171, 4171, 20], [4171, 5794, 21], [5794, 7498, 22], [7498, 9193, 23], [9193, 11210, 24], [11210, 13098, 25], [13098, 15082, 26], [15082, 17099, 27], [17099, 18995, 28], [18995, 20931, 29], [20931, 22797, 30], [22797, 24533, 31], [24533, 26558, 32], [26558, 27260, 33], [27260, 27260, 34], [27260, 28629, 35], [28629, 29357, 36], [29357, 31589, 37], [31589, 33141, 38], [33141, 34519, 39], [34519, 36108, 40], [36108, 37499, 41], [37499, 39124, 42], [39124, 40576, 43], [40576, 40576, 44], [40576, 42420, 45], [42420, 44615, 46], [44615, 46956, 47], [46956, 49503, 48], [49503, 52117, 49], [52117, 53808, 50], [53808, 55540, 51], [55540, 57996, 52], [57996, 60009, 53], [60009, 61819, 54], [61819, 63972, 55], [63972, 65615, 56], [65615, 65639, 57], [65639, 66333, 58], [66333, 66333, 59], [66333, 66333, 60], [66333, 66333, 61], [66333, 66333, 62], [66333, 66953, 63], [66953, 67673, 64], [67673, 67673, 65], [67673, 67673, 66], [67673, 67673, 67], [67673, 67673, 68], [67673, 68708, 69], [68708, 69157, 70], [69157, 69157, 71], [69157, 69157, 72], [69157, 69157, 73], [69157, 69157, 74], [69157, 69859, 75], [69859, 70187, 76], [70187, 70187, 77], [70187, 70187, 78], [70187, 70187, 79], [70187, 70187, 80], [70187, 70187, 81], [70187, 70187, 82], [70187, 70537, 83], [70537, 71344, 84], [71344, 71344, 85], [71344, 71344, 86], [71344, 71344, 87], [71344, 71344, 88], [71344, 72070, 89], [72070, 72520, 90], [72520, 72520, 91], [72520, 72520, 92], [72520, 72520, 93], [72520, 72520, 94], [72520, 72520, 95], [72520, 72520, 96], [72520, 73141, 97], [73141, 74249, 98], [74249, 74249, 99], [74249, 74249, 100], [74249, 74249, 101], [74249, 74249, 102], [74249, 74887, 103], [74887, 75219, 104], [75219, 75219, 105], [75219, 75219, 106], [75219, 75219, 107], [75219, 75219, 108], [75219, 76073, 109], [76073, 77102, 110], [77102, 77102, 111], [77102, 77102, 112], [77102, 77102, 113], [77102, 77102, 114], [77102, 77635, 115], [77635, 77903, 116], [77903, 77903, 117], [77903, 77903, 118], [77903, 77903, 119], [77903, 77903, 120], [77903, 78236, 121], [78236, 78552, 122], [78552, 78552, 123], [78552, 78552, 124], [78552, 78552, 125], [78552, 78552, 126], [78552, 78942, 127], [78942, 79262, 128], [79262, 79262, 129], [79262, 79262, 130], [79262, 79262, 131], [79262, 79262, 132], [79262, 79745, 133], [79745, 80288, 134], [80288, 80288, 135], [80288, 80288, 136], [80288, 80288, 137], [80288, 80288, 138], [80288, 80537, 139], [80537, 81269, 140], [81269, 81269, 141], [81269, 81269, 142], [81269, 81269, 143], [81269, 81269, 144], [81269, 81788, 145], [81788, 82445, 146], [82445, 82445, 147], [82445, 82445, 148], [82445, 82445, 149], [82445, 82445, 150], [82445, 82824, 151], [82824, 83350, 152], [83350, 83350, 153], [83350, 83350, 154], [83350, 83350, 155], [83350, 83350, 156], [83350, 84192, 157], [84192, 85471, 158], [85471, 85471, 159], [85471, 85471, 160], [85471, 85471, 161], [85471, 85471, 162], [85471, 86535, 163], [86535, 87180, 164], [87180, 87180, 165], [87180, 87180, 166], [87180, 87180, 167], [87180, 87180, 168], [87180, 87180, 169], [87180, 87180, 170], [87180, 87180, 171], [87180, 87180, 172], [87180, 87654, 173], [87654, 88408, 174], [88408, 88408, 175], [88408, 88408, 176], [88408, 88408, 177], [88408, 88408, 178], [88408, 88807, 179], [88807, 89113, 180], [89113, 89113, 181], [89113, 89113, 182], [89113, 89113, 183], [89113, 89113, 184], [89113, 89113, 185], [89113, 89113, 186], [89113, 89692, 187], [89692, 90245, 188], [90245, 90245, 189], [90245, 90245, 190], [90245, 90245, 191], [90245, 90245, 192], [90245, 90663, 193], [90663, 91061, 194], [91061, 91061, 195], [91061, 91061, 196], [91061, 91061, 197], [91061, 91061, 198], [91061, 91488, 199], [91488, 92219, 200], [92219, 92219, 201], [92219, 92219, 202], [92219, 92219, 203], [92219, 92219, 204], [92219, 92642, 205], [92642, 93092, 206], [93092, 93092, 207], [93092, 93092, 208], [93092, 93092, 209], [93092, 93092, 210], [93092, 93473, 211], [93473, 93851, 212], [93851, 93851, 213], [93851, 93851, 214], [93851, 93851, 215], [93851, 93851, 216], [93851, 94140, 217], [94140, 94611, 218], [94611, 94611, 219], [94611, 94611, 220], [94611, 94611, 221], [94611, 94611, 222], [94611, 94611, 223], [94611, 94611, 224], [94611, 95096, 225], [95096, 95666, 226], [95666, 95666, 227], [95666, 95666, 228], [95666, 95666, 229], [95666, 95666, 230], [95666, 96100, 231], [96100, 96588, 232], [96588, 96588, 233], [96588, 96588, 234], [96588, 96588, 235], [96588, 96588, 236], [96588, 97055, 237], [97055, 97408, 238], [97408, 97408, 239], [97408, 97408, 240], [97408, 97408, 241], [97408, 97408, 242], [97408, 97408, 243], [97408, 97408, 244], [97408, 97709, 245], [97709, 98179, 246], [98179, 98179, 247], [98179, 98179, 248], [98179, 98179, 249], [98179, 98179, 250], [98179, 98542, 251], [98542, 98913, 252], [98913, 98913, 253], [98913, 98913, 254], [98913, 98913, 255], [98913, 98913, 256], [98913, 98913, 257], [98913, 98913, 258], [98913, 99210, 259], [99210, 100030, 260], [100030, 100030, 261], [100030, 100030, 262], [100030, 100030, 263], [100030, 100030, 264], [100030, 100692, 265], [100692, 101174, 266], [101174, 101174, 267], [101174, 101174, 268], [101174, 101174, 269], [101174, 101174, 270], [101174, 101174, 271], [101174, 101174, 272], [101174, 101958, 273], [101958, 102668, 274], [102668, 102668, 275], [102668, 102668, 276], [102668, 102668, 277], [102668, 102668, 278], [102668, 103483, 279], [103483, 104026, 280], [104026, 104026, 281], [104026, 104026, 282], [104026, 104026, 283], [104026, 104026, 284], [104026, 104433, 285], [104433, 105291, 286], [105291, 105291, 287], [105291, 105291, 288], [105291, 105291, 289], [105291, 105291, 290], [105291, 105871, 291], [105871, 106462, 292], [106462, 106462, 293], [106462, 106462, 294], [106462, 106462, 295], [106462, 106462, 296], [106462, 106957, 297], [106957, 107646, 298], [107646, 107646, 299], [107646, 107646, 300], [107646, 107646, 301], [107646, 107646, 302], [107646, 108288, 303], [108288, 109011, 304], [109011, 109011, 305], [109011, 109011, 306], [109011, 109011, 307], [109011, 109011, 308], [109011, 109011, 309], [109011, 109011, 310], [109011, 109326, 311], [109326, 109774, 312], [109774, 109774, 313], [109774, 109774, 314], [109774, 109774, 315], [109774, 109774, 316], [109774, 110210, 317], [110210, 111040, 318], [111040, 111040, 319], [111040, 111040, 320], [111040, 111040, 321], [111040, 111040, 322], [111040, 111040, 323], [111040, 111040, 324], [111040, 111381, 325], [111381, 111843, 326], [111843, 111843, 327], [111843, 111843, 328], [111843, 111843, 329], [111843, 111843, 330], [111843, 112205, 331], [112205, 112890, 332], [112890, 112890, 333], [112890, 112890, 334], [112890, 112890, 335], [112890, 112890, 336], [112890, 113543, 337], [113543, 114176, 338], [114176, 114176, 339], [114176, 114176, 340], [114176, 114176, 341], [114176, 114176, 342], [114176, 114862, 343], [114862, 115355, 344], [115355, 115355, 345], [115355, 115355, 346], [115355, 115355, 347], [115355, 115355, 348], [115355, 115355, 349], [115355, 115355, 350], [115355, 115878, 351], [115878, 116291, 352], [116291, 116291, 353], [116291, 116291, 354], [116291, 116291, 355], [116291, 116291, 356], [116291, 117393, 357], [117393, 117944, 358], [117944, 117944, 359], [117944, 117944, 360], [117944, 117944, 361], [117944, 117944, 362], [117944, 118385, 363], [118385, 118733, 364], [118733, 118733, 365], [118733, 118733, 366], [118733, 118733, 367], [118733, 118733, 368], [118733, 119261, 369], [119261, 119710, 370], [119710, 119710, 371], [119710, 119710, 372], [119710, 119710, 373], [119710, 119710, 374], [119710, 120352, 375], [120352, 120624, 376], [120624, 120624, 377], [120624, 120624, 378], [120624, 120624, 379], [120624, 120624, 380], [120624, 120856, 381], [120856, 121126, 382], [121126, 121126, 383], [121126, 121126, 384], [121126, 121126, 385], [121126, 121126, 386], [121126, 121626, 387], [121626, 122746, 388], [122746, 122746, 389], [122746, 122746, 390], [122746, 122746, 391], [122746, 122746, 392], [122746, 123140, 393], [123140, 123602, 394], [123602, 123602, 395], [123602, 123602, 396], [123602, 123602, 397], [123602, 123602, 398], [123602, 124096, 399], [124096, 124578, 400], [124578, 124578, 401], [124578, 124578, 402], [124578, 124578, 403], [124578, 124578, 404], [124578, 124934, 405], [124934, 125296, 406], [125296, 125296, 407], [125296, 125296, 408], [125296, 125296, 409], [125296, 125296, 410], [125296, 125700, 411], [125700, 125972, 412], [125972, 125972, 413], [125972, 125972, 414], [125972, 125972, 415], [125972, 125972, 416], [125972, 126311, 417], [126311, 126861, 418], [126861, 126861, 419], [126861, 126861, 420], [126861, 126861, 421], [126861, 126861, 422], [126861, 127173, 423], [127173, 127688, 424], [127688, 127688, 425], [127688, 127688, 426], [127688, 127688, 427], [127688, 127688, 428], [127688, 128381, 429], [128381, 129158, 430], [129158, 129158, 431], [129158, 129158, 432], [129158, 129158, 433], [129158, 129158, 434], [129158, 129885, 435], [129885, 130227, 436], [130227, 130227, 437], [130227, 130227, 438], [130227, 130227, 439], [130227, 130227, 440], [130227, 130682, 441], [130682, 130682, 442], [130682, 130682, 443], [130682, 130682, 444], [130682, 130682, 445], [130682, 130682, 446]], "primary_language": ["en", "en", "None", "en", "None", "None", "en", "None", "None", "None", "None", "None", "en", "None", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "en", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, false, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, false, false, false]}}]