[{"id": "e24a32c815cf1f442916e5ac9a65a90ad2ebe3a2", "text": "TRANSACTIONS\nOF THE\nKOREA BRANCH\nOF THE\nROYAL ASIATIC SOCIETY\n\n鮮 朝\n\nVOL. IV.—Part I.\n\nSupplied gratis to all Members of the Society.\nPrice to Non-Members, Yen 1.50.\n\nON SALE AT\nSeoul, Korea: Hon. Librarian.\nYokohama, Shanghai, Hongkong, Singapore: Kelly & Walsh, Ltd.\nLondon: Kegan Paul, Trench, Trubner & Co., Ltd.\nParis: Ernest Leroux.\nLeipsic: Otto Harrassowitz.\nNew York: Geo. Stechert.\n\n1912.\nTHE OLD PEOPLE AND THE NEW GOVERNMENT.\n\nBY\n\nMidori Komatsu, L.L.B., MA.,\nDirector of Foreign Affairs of Government General of Chosen.\n\nAs a rule the ancient history of every nation is shrouded in mystery and nothing definite can be known; and the ancient history of Japan, Korea or China is no exception. According to tradition, Korea was founded by Tangun, who descended to earth from heaven and was found by the wild men beneath a paktal tree; hence his name Paktal Prince. He was then made the king of the country, which he called Chosen. The legend is as mythical as legends of other countries, but it seems to show that even in very remote days Chosen formed a united though imperfect state. Some time later Kija, a Prince of the Yin dynasty of China, which fell before King Wu of the Chu dynasty, was appointed by the latter as King of Chosen. This legend undoubtedly had its origin in Chinese history. In a suburb of Pyongyang city, there still exists a temple dedicated to Kija and the legend is authentically recorded in early Korean history. Inasmuch, however, as the temple of Kija was built and a Korean history written during the time when Chinese influence predominated in the peninsula, the story in question cannot be readily accepted. If it is true, the Chosen over which Kija was appointed as ruler must have been only a northern portion of the peninsula lying at that time on both sides of or beyond the Yalu river.\n\nOn the other hand, according to the early history of Japan, Amaterasu Omikami, the Great Goddess of Heavenly Light, appointed her son, called Ameno Oshihomi, ruler of Japan, and sent her younger brother, Susano-O by name, to Chosen to give rule to the peninsula. Some scholars are of the opinion that this Susano-O was no other than Tangun, the traditional founder of\nChosen. But this view appears to me to be too imaginary and to lack substantial evidence. Some time after, a son of Ugaya Fukiayezu, descendant of the Great Goddess went over to Chosen, while another son remained in Japan and became the founder of the Imperial dynasty as Emperor Jimmu.\n\nThere is reason to believe that this story is more trustworthy than the one that says a Chinese King appointed Kija, the son of a conquered dynasty, to be the Ruler of Chosen. For, if Japanese historians had not been perfectly disinterested in their motives, they would have recorded the story after Chinese fashion. They would have mentioned that some one inferior in rank either to the brother of the Great Goddess or to that of the first Imperial ruler of Japan took up the rule of Chosen. In point of fact, however, they left it recorded that the Great Goddess sent her own brother to Chosen, while she caused her son to rule Japan; and that afterward an elder brother of the founder of the Imperial dynasty of Japan crossed over to Chosen to govern the country. It will thus be seen that the Japanese historians had little motive to serve the interests of Japan in recording the legend under discussion. Judging from this point of view, the ancient history of Japan may be said to have treated the question in a fair way.\n\nA theory has been advanced by some scholars of history that Hyokkose, founder of the Kingdom of Sinla, was identical with Ina Hi, the elder brother of Emperor Jimmu, above referred to. The theory may be open to doubt. However his Prime Minister, Ho Kong, is recognized as having been a Japanese in Korean history itself; and moreover Kyongju in South Kyong-sang Province, once the capital of the Kingdom of Sinla, is in close proximity to Japan. There is no doubt under these circumstances that intercourse between Silla and Japan was intimate as well as frequent. Especially would we infer this from the records given in Japanese history which state that Ame no Hiboko, a prince of Silla, emigrated to Japan and his descendants were given high official positions and proved themselves loyal subjects of Japanese Emperors, and that a princess\nof Silla also crossed over to Japan to become the consort of a Japanese prince, proving the intimacy of the relations which existed between the two countries in those remote days.\n\nIt is a well-known fact that Empress Jingo, the fifteenth Imperial ruler of Japan conquered the three Han Kingdoms in the Korean peninsula in the third Christian Century. In fact the three Han Kingdoms after being conquered by Empress Jingo were made Japanese territory, and for a long time after continued to pay annual tributes to the Imperial Court of Japan. About two centuries prior to Empress Jingo's conquest of the three Kingdoms, in the reign of Emperor Suinin, there existed a country called Tai Kala in the peninsula. It was hard pressed by its neighbouring states and asked Japan for reinforcements. Emperor Suinin complied with its appeal and changing the name of the country to Mimana, established there a Japanese Residency General. From this fact it is evident that even before the conquest of the three Hans by the Empress Jingo, that is about eighteen centuries ago, the influence of Japan extended to the Korean peninsula.\n\nIn Korean history the establishment of the Japanese Residency General in Mimana, and the Empress Jingo's conquest of the three Hans are omitted for obvious reasons; and the authenticity of these events might reasonably be doubted, if these records were confined to Japanese history only. A study of Chinese history, written when China entertained no good feeling towards Japan but rather looked askance at her, will help us in arriving at a fair and correct conclusion about the point in question.\n\nIt is stated in two famous Chinese histories, the Wei Chih (魏志 History of Wei) and the Hou Han Shu (後漢書 Book of Later Han) that Korea is bounded on the east and west by sea and borders Japan on the south. If Japanese territory had not extended to the Korean peninsula over the sea in those days, such record would never have been written; but the sea would have been represented as circumscribing Korea not only on the east and west but also on the south. It is\nthus reasonable to infer that Japanese dominion extended to the Korean peninsula beyond the sea. In the reign of Emperor Ojin, son of Empress Jingo, as well as in the reign of Emperor Yuryaku, who ascended the throne about two hundred years later, envoys were sent by the Japanese Court to China then under the Wu dynasty. These facts are recorded in a contemporary Chinese book, in which it is mentioned that one of the credentials presented by the Japanese envoys bore the signature of \"King of Wa (Japan) and Great General giving peace to the seven countries of Wa (Japan), Packche, Silla, Mimana, Kala, Chin-Han and Ma-Han.\" The latter six are the names of the states in Korea at that time. Further it is mentioned in the same book that Japan subjugated northern countries beyond the sea to the number of ninety-five. The number given is evidently an exaggeration, but the reference seems to confirm the belief that prior to and after the Korean expedition of Empress Jingo, the southern part at least of the peninsula was in Japanese hands.\n\nJudging from the facts so far pointed out in general outline, it is not unreasonable to conclude that the Japanese and Korean peoples formed for a long time one and the same nation. The recent annexation of Korea by Japan is therefore not the incorporation of two different countries inhabited by different races, but, it may rather be said to be the reunion of two sections of the one and same nation after a long period of separation. Indeed it is nothing more nor less than the old state of things restored.\n\nIn addition to their racial connection and political relations, Japan and Korea helped each other to a considerable extent in advancing their mutual civilization. In fact Japan benefitted in greater proportion by the introduction of learning and arts from Korea. Thanks to her insular position, Japan has been almost entirely free from foreign invasion, and fortunately has been disturbed little by internal strife. Thus favoured, she has been able to assimilate all that was good in Chinese and Korean civilization; and also early opened intercourse with Portugal, Holland and other foreign countries. The nation was united\nand with but one object in view strove hard to attain a position as a world Power.\n\nOn the other hand, Korea was constantly pressed and frequently attacked by her powerful neighbour, China. While the constant fear of foreign aggression made her retiring and timid; political corruption and popular degeneration caused the nation to decline and lag behind the progress of the times, until she became an object of pity and sympathy to the world at large. Looking backward, not to say several centuries, but even as recently as fifty or sixty years ago, we find in the Government of Korea endless intrigues and feuds engaged in by rival factions. There was the party of Easterners and opposed to it was that of the Westerners. There were also the parties of elder and young yangban against each other. Not only did these men constantly plot to oust one another from positions of power, but also those in office bartered official positions for gold; and far from minding the well-being of the masses, did their utmost to enrich themselves at their expense. There were maintained neither regular troops for the preservation of public peace and order, nor efficient police for the protection of the people's life and property. Bands of ruffians known as fire brigands freely roamed at large, committing atrocities and robberies. In this way the bulk of a peaceful people, finding themselves between the devil in the form of corrupt officials and the deep sea in that of relentless brigands, were reduced to a state of abject poverty and indolence.\n\nThe effect of this long standing evil state of things was discernible even in recent times. All industries perished, and commerce in its true sense did not exist in Chosen. The only branch of human activity remaining in the country was agriculture. But even agriculture itself was of a very primitive sort, as compared with that of civilized countries. Moreover, forests were despoiled of trees to obtain building material and fuel, and no care was taken to replant. In consequence trees became more and more scarce year after year, until it was difficult to obtain sufficient material for the construction of even small\nhouses, and the people were obliged to go to dry grass for fuel. As the result of the deforestation of Korean mountains, floods were frequently experienced and extensive arable lands laid waste. The forest lands of Chosen occupied more than 70 per cent. of the whole area of the country and were more than double in percentage as compared with the countries in Europe and America, where forest land is about 30 per cent. on the average of the entire area. How extensive has been the work of deforestation in Chosen will be inferred from the fact that despite such richness in forest lands, 83 per cent of them were denuded and are devoid of trees.\n\nIt was such a country and such a people that the Japanese Empire undertook to relieve by reforming administration and developing natural resources. For five years Japan did her best to bring the task she had undertaken to a successful issue. All admit that she achieved some success in her efforts and the country assumed more or less a new aspect. Japan has now made the country an integral part of her dominion and has set upon herself the work not of improvement but rather rejuvenescence of the territory. It will not be difficult to imagine the stupendousness of her responsibility as well as the immensity of her work.\n\nIt will sound strange to most people to hear in these days references made as to the security of life and property. But in point of fact, in Chosen this was one of the most urgent necessities which demanded immediate attention. This is the reason why on assuming the protectorate of the former Korean Empire, Japan stationed troops at important places and distributed police and gendarmerie forces throughout the peninsula, just as at home. By doing this, Japan has succeeded in weeding out all lawless elements of the Korean populace as well as in giving peaceful and law-abiding people security of life and property.\n\nWith regard to administrative reform, Japan found it inexpedient to adopt all at once a civilized regime of government without modification. But where general principles were\nconcerned she was obliged to effect radical reform, such as, for instance, the judicial system by which district magistrates, ignorant of legal principles, were allowed to pronounce judgment in an arbitrary way, swayed either by personal feeling or under the influence of bribery. It was the necessity of doing away with this evil practice that induced Japan to separate the executive from the judiciary soon after the inauguration of the protectorate; and by instituting a modern judicial system, deprive executive officials of their judicial power. This reform would be no new thing for most countries in these days of advanced political ideals, but in Chosen it was one of the most important tasks accomplished for administrative reform. On the other hand, in order to remove the evil practice of the arbitrary imposition of taxes by provincial governors, district magistrates and other officials, it was decreed that none of them could take even a single sen from the people unless in compliance with the law. In this way, the old standing evil of official squeezing was eradicated. This measure was really one most urgently needed in Chosen, and people began to realize its inestimable benefit.\n\nThe security of life and property assured by the presence of troops and police as well as by the separation of the judiciary from the executive, and the sense that private property would not be taken away by the officials in an arbitrary and lawless way, have caused the Korean people to engage in their work more diligently than ever and to save their income as much as possible. They appear to be awaking, so to speak, from a horrible nightmare of long endurance and to take new interest in life with hope for the future. The day dawn of industrial development is breaking in Chosen, and the time is in sight when the Korean people will devote themselves earnestly to the work of improving their conditions. This is really a matter for sincere congratulation for the sake of humanity.\n\nIn developing the industry of an infantile nation, it is advisable to begin the work by undertaking the improvement of its agricultural industry, and this has been diligently carried\non since Japan assumed the protectorate of the former Korean Empire. This may be a task easy to accomplish in other countries. In Chosen, however, the improvement of agriculture must be accompanied by afforestation as a preventive against floods as well for facilitating irrigation. But afforestation is not a work which can be accomplished within a short time. Moreover, in order that it may be successfully carried out, it is not enough for a government to undertake it of itself, but the general public must be trained to appreciate its benefits and importance. The Governor General issued for that purpose an instruction to fix the anniversary of Emperor Jimmu, April 3, as Arbor-day for Chosen. On that day, all students of schools are to plant young trees. The district magistrates were also enjoined to induce members of public organizations as well as individuals to cooperate in the plantation. Seedling nurseries will be established for the cultivation of young trees; but for the time being young trees or seedlings are to be distributed by the Provincial administration.\n\nFortunately there are reasons for entertaining the hope that Korea is quite rich in natural resources. Her climate is temperate, her soil fertile in many places and her seas rich in marine products, while her mountains contain considerable quantities of valuable minerals. In order to exploit these natural resources, means of transportation and communication must first be opened. This is the reason which induced the Governor General to map out, with the inauguration of the new regime, plans for constructing highways and railways as well as for improving harbours in Chosen. It is an axiom established by facts in Oriental and Occidental histories that organs of traffic and communication not only contribute greatly to industrial development but also exercise a powerful influence upon the progress of civilization.\n\nThe wonderful new machinery, the command of new powers of steam and electricity, have produced a new era in Japan, bringing about a remarkable change not only in political and material conditions but also in the moral and intellectual spheres. In a territory like Chosen, of great distances, of great\nnatural difficulties, high mountain chains, wide spreading forests and waste lands, and therefore of great obstacles to personal travel and the transportation of commodities; an industrial development of the same kind would be followed by the same results. Now, in Chosen, farmers living in distant places are obliged to resort either to pack horses or human carriers for sending their surplus products to distant markets. This entails much time and expense, and the proceeds raised often do not cover the expense so incurred. Under these circumstances farmers cannot be blamed for their reluctance to raise abundant crops by adopting imposed agricultural methods. Such a state of things however is not confined to agricultural products alone. The same or rather more difficulty would be experienced in the trade of not a few manufactured articles as well as of heavy minerals such as coal, copper, iron and graphite. This accounts for the inactivity of not only agriculture but also of industry and commerce, except in places along the existing railways and the sea coast.\n\nAll this has been keenly appreciated by the Governor General and has induced His Excellency to undertake, with the inauguration of the new regime, the improvement of the existing Pusan and New Wiju Railway, the Seoul-Chemulpo line, and the constructing the Pyongyang-Chinnampo Railway. His Excellency has further projected the speedy construction of the Seoul-Wonsan and Taiden and Mokpo lines, shortening the period allotted for their construction from ten years to five. It is not railways alone that His Excellency pays attention to, but the improvement of harbours, repairs and construction of high-roads, and other factors contributing to industrial development of the territory and at the same time affording work to the idle people as a side benefit, all claim due share of his attention. The fact that the Governor General introduced to the present session of the Imperial Diet a bill for raising a public loan amounting to fifty-six million yen to be applied to public enterprises in Chosen, and that the Legislature passed it without a dissenting voice, goes a long way to show how sincere and\nearnest is the desire of both the Government and people of Japan to develop and civilize Chosen.\n\nOn the other hand, a study of the present state of things makes one hopeful of the future of the territory. It was but natural that immediately following the annexation there existed some misgivings among certain quarters of the people. It would not have been a cause of surprise if in consequence of such a momentous change, some disturbances should have been incited by men swayed by conservative ideas or personal interests, for history abounds in similar examples. But in point of fact, this great change was effected in the midst of profound peace without seeing any restlessness. This was of course primarily due to the wisdom and virtue of H. M. the Emperor of Japan as well as to the intelligent course of action taken by the former sovereign of Korea. It is, however, recognized alike at home and abroad that it was also owing to no small extent to the wise and considerate measures taken by the Governor General in carrying out the great task entrusted to him by his Imperial Master. At the time of the annexation, the Governor General issued a Proclamation, announcing to the people at large the outlines of the policy he was going to adopt in Chosen. A section of the people appeared at that time to have taken the Proclamation as nothing more than a mere device for reconciling them to the new government. But within less than half a year since the annexation, all that has been promised in the Proclamation,—the cordial treatment of the former Imperial House of Korea, special favours to aged yangban and literati, rewards to filial children and virtuous wives, general amnesty, reduction and exemption of taxes, grant of seventeen million yen as industrial, educational and relief funds, establishment of charity hospitals, spread of education and so forth—all has been carried out strictly even to the letter. In view of this, even those who doubted the sincerity of the Proclamation before, now appreciate the high aim of the new regime, while the peaceful and law-abiding people in general rejoice as if they had seen a new light. All are now at ease in mind and engaged in their work dili-\ngently, presenting a most peaceful condition such as has never been seen before in this peninsula. This may be inferred from the increase so far realized in the taxes paid as well as in the volume of the export and import trade.\n\nIn Chosen from early times, the amount of taxes collected was a good basis of judging whether the country was in peace or not. When the country was disturbed and bandits roamed freely plundering peaceful people right and left, and those able to work lost their employment, taxes were not paid in full. On the contrary, in peaceful times, farmers could reap the fruits of their labour and other classes of people could also pursue their business in peace, so that they had sufficient means to pay their dues without delay.\n\nNow the amount of taxes paid within four months from October last to January exceeded that of the corresponding period of the preceding year, by nearly one million yen; while the amount of export and import during the same period also showed an increase of more than 50 per cent as compared with that of the same period of the preceding year. This may be taken as ample proof of the peaceful condition prevailing in Chosen after annexation.\n\nThe difficulty encountered however in the administration of Chosen is such as no Occidental power has experienced in giving rule to its colonies. In the case of Great Britain in India, America in the Philippines, France in Madagascar or Tunis, or Germany in her African colonies, each power deals with a people entirely different in race, as well as in religious belief and greatly inferior in civilization, as compared with the people at home. In consequence they have found scarcely any serious obstacles to the adoption therein of a simple and uniform system. But the case of Japan in Chosen is quite different. The Koreans are not very different from the people at home in race and civilization and the Government has decided to treat them on the same footing as the original subjects of the Emperor. For this reason, no distinction in principle is to be observed in the treatment of the two peoples. On the other hand in view of\ncertain differences existing in the manners and customs of both peoples, it would be inexpedient to transplant to Chosen en bloc the legislative and administrative institution in vogue in Japan proper. For, despite the undoubted superiority of such institutions, they would not exactly meet the actual requirements of the people, on the contrary they might produce in some cases unexpected and undesirable effects.\n\nUnder the circumstances, it need scarcely be said that serious consideration must be given to the harmonization of the principle of equal treatment of both peoples to the circumstances necessitating special exceptions to such principle. Especially is there this peculiarity that in contrast to the practical non-existence of white men mixing up with natives in their colonies, there are in Chosen many Japanese living in the interior and engaging in business among Koreans. It is both unjust and impossible to apply different laws to the Koreans and to those Japanese living amidst such Koreans. Nevertheless with regard to the capability to bear national burdens, such as taxes, military services, etc., there exist circumstances which do not allow the authorities to extend indiscriminate treatment to Koreans and Japanese. In short the Government General of Chosen has the task before them of advancing the intellectual and moral character of the new subjects of the Empire, by reforming all their antiquated and evil customs and manners, in order to assimilate them completely to the original people of the Empire. It goes without saying that this task is as great as it is onerous. The success or failure of the Government General of Chosen in its work will not only mark a new epoch in the history of Japan, but will also exercise no small influence over the colonial history of the world at large.\nTHE KOREAN ALPHABET.\n\nBY\n\nRev. J. S. Gale, D.D.\n\nThe importance of an alphabet or some form of writing may be measured by the difference between a civilized and a barbarian people. Europe is in possession of the past through the blessing of an alphabet. This alphabet comes down to her by way of Greece, to Russia direct, to the other nations through Rome. Greece in turn received it from Phoenicia. From Herodotus and others we gather that present day alphabets were not invented by the users, but were borrowed from a far distant past. So misty and uncertain is this first origin, and so universal and important the use of the alphabet itself, that a common saying among the Greeks used to be: \"It is the creation of the gods.\"\n\nThe search for the origin of Europe's alphabet has been a subject of profound archaeological investigation but thus far it has eluded all seekers. In 1859 Professor de Rougè expressed, in a paper read before the French Académie of Belles Lettres, the opinion that the alphabet had come to us through Rome, Greece, Phoenicia, originating in the hieratic characters of Egypt. But the discovery of the Tel el Amarna tablets in 1887 set the tide of inquiry towards Babylon. More recently still the question is: Did we receive it from the Hittites?\n\nThe origin is hidden in mystery, and scholars have yet to unearth evidence that will prove to us where the very familiar signs, A. B. and C. did come from. Older they seem than the pyramids and wider travelled in their use and influence than any other of the beneficent gifts of Asia.\n\nI mention this to bring to your attention the importance of so wonderful an invention. Without it, and its help, we should\nhave been left like the tribes of central Africa, or the natives of the north American continent.\n\nTo invent an alphabet that meets the literary needs of a people and that appropriates in its sphere of influence a whole race is an achievement worthy of note, and we think of recognition by this Society. Evans, a missionary in the Canadian North West, in the early fifties of last century prepared for his Red-Indian parish, that extended all the way from the forty ninth parallel of latitude to the Arctic Circle, a system of writing, which has become universally adopted and used. Lord Dufferin, the Governor-General, in commenting on this achievement said, \"Many a man who has done less, has been honored with a resting place and a tablet in Westminster Abbey.\" However, if an alphabet can be shown to be not only a serviceable vehicle for literary use, but a delightfully simple product of a most complicated system of philosophy, the interest cannot but be heightened.\n\nAlphabets are of value according to the ease by which they can be learned, the exactness by which they can record the sounds of the language, and the rapidity with which they can be written. The Chinese character is a wonderfully interesting medium of literary expression but it is cumbersome, and indefinite, and complicated beyond expression. It can never serve as a ready and forceful form of written language in a rapidly moving age. It must call in other aids.\n\nA comparison of the number of letters in some of the alphabets in use today will give Korea's place in this respect. The English and German alphabets have 26 letters, the French 25, the Russian 36, the Greek 24, the Tibetan 35, the Arabic 28 and the Korean 25. In simplicity, the Korean has perhaps no equal, easy to learn and comprehensive in its power of expression.\nCHART I.\n\nGeneral Chart of Material used in this Article.\nThe questions naturally arise:\n\n1. When was the Alphabet formed?\n2. What prompted its creation?\n3. Who made it?\n4. What records have we concerning it?\n5. What are the laws that govern the letters, as to:\n   a. Their number, b. Their order, c. Their sound,\n   d. Their shape, e. Their names.\n\nI.—When was it formed?\n\nThe date of the alphabet is a matter on which all native authorities agree, namely 1446 A.D., a great and expectant era in the history of the world. Mr. Scott makes it 1447 or the year 丁卯, one year too late. The authorities agree likewise in saying that it was begun in the year 癸亥 1443, and published in the year 丙寅 1446. The Mings were at the height of their power. It was the dawn of modern Europe. Columbus had just been born. Six years later a little child was baptized by name Leonardo di Vinci. Twenty-seven years later Copernicus opened his wondering eyes on this planet. Twenty-nine years later there visited the earth no less than Michael Angelo. Thirty-seven years latter came two distinguished guests, one of the Old Church, and one of the New, Raphael and Luther. About this time too, Gutenberg is reported to have issued his first book from the press of Johannes Fust. Number one it is of all the printed volumes of Europe. A wonderful time indeed, fruitful of great men as the megalithic age was fruitful of menhir, dolmens and cromlechs. 1446, one of the years of the Tiger, is then the date of the alphabet.\n\nII.—What prompted its formation?\n\nAs I read through the records referred to, you will be left in no doubt as to the answer. The king was evidently solicitous for the welfare of his people. He wished that the illiterate\namong his subjects might have some of the joy and satisfaction that comes with literature. He himself was a great scholar and needed no simplification of the Classics, but the people, they were a distress to him, they were ignorant, and he desired that they might be enlightened. He wished also to put on record their songs and to aid and assist in music.\n\nHis thought was not one to win him popularity with his ministers. King Se-jong completed his work three years before it was promulgated. But so great was the opposition of high officers of state and the literati against any such apparent humiliating of the noble office of the character, that they banded themselves together, in great consternation, to oppose it. Sö Kö-jöng, who wrote the Tong-Guk T’ong-Kam (東國通鑑), a famous history of Korea, says, “His Majesty the King, when he wrote the Emmun, found himself opposed by the great mass of the literati who determined, by all the forces at their disposal to prevent it. But the King, not granting this demand, commanded Choi Hang and his company, and they wrote the Hun-min Cheung-Eum (訓民正音), and the Tong guk Cheung-Un (東國正韻), (which is simply a copy of the Hong-Mu Cheung-Un (洪武正韻) (see Chart II.) with the Emmun added). Cheung In-ji also throws light on this when he says, “In the winter of 1443 the King wrote out the 28 letters. They were formed in this year but not promulgated till 1446. In these three years Söng Sam-mun and his company went thirteen times in all to Laotung to see Whang-Chan and to inquire about Rhyme (韻). His Majesty had the persistence and patience of a Sage, and a clear decision in his own soul, and so made an independent written language. There are no words with which to praise his exalted virtue.” In the Yel-Yö Keui-Sul (燃黎記述) Vol. 3, page 21, I read that the literati wrote out a petition and begged the King not to launch this alphabet out into the world, as manifold evils would undoubtedly follow its promulgation. Mr. Scott, in speaking of the reason for the formation of the Alphabet says, “The King of Corea, eager to mark the individuality and independence that he claimed for his state was desirous of\n## Chart II.\n\nHong-mu's Alphabet of Initials (1369-1398 A.D.)\n\n| Mixed | Clear | Partially Mixed Sounds | Mixed Sounds | Partially Clear Sounds | Clear Sounds | The Five or Seven Vocal Divisions | The Five Natural Elements | The Five or Seven Notes of Music |\n|-------|-------|------------------------|--------------|-----------------------|-------------|----------------------------------|--------------------------|-------------------------------|\n| 全     | 全     | 不不             | 濁清         | 濁清                 | 清           | 七音                             | 五行                     | 五音                         |\n| 濁     | 清     | 濁清             | 清           | 清                   | 清           | 牙音                             | 木                       | 角                           |\n| 疑     | 의     | 群군             | 溪키         | k'                    | k            | Palatal                          | Wood                     | Kak                         |\n| 泥     | 定     | 透투             | t            | t                    | t            | Lingual                          | Fire                     | Chi                         |\n| 明     | 口微   | 明明             | pp           | pp                   | p            | Labial                          | Water                    | U                           |\n| 邪     | 心人審 | 心人審           | ss           | ss                   | s            | Dental                          | Metal                    | Sang                        |\n| 喻     | 유     | 喻유             | hh           | hh                   | h            | Guttural                         | Earth                    | Kung                        |\n\n洪武韻字母之圖\nA Sample of Early Enmun Writing, (Taken from The Flying Dragons in Heaven).\nabandoning Chinese as the official script of his government.\"\n\nWe would question this. There seems no evidence that the literati thought him in any way desirous of elevating the state as such, or they would hardly have opposed him so. Nor is there any word of his trying to break with Chinese. The Emnun was rather to serve as a means of opening up to the common classes the treasure house of the Classics.\n\n\"When the people cannot now master one script why attempt to make two?\" was the question. \"So degraded and contemptible a substitute too!\" The king was wise, however, and fixed in his purpose. He knew too, how to bide his time. \"I shall prove its capacity to be equal to that of the character itself\" said he. He then commanded Cheung In-ji to write a poem in this new script, a poem that would exalt his royal ancestors in high and noble measure, so that the Emnun could ride out on the wave of its popularity. It was so done and the book was called \"The Flying Dragons in Heaven.\" Such a book could not but be popular. At once it was placed in the national archives and the People's Alphabet went on its way rejoicing. \"The Flying Dragons in Heaven,\" (龍飛御天歌), is one of the books published this year by the Society of Ancient Korean Literature. (See Chart III).\n\nIII.—Who made it?\n\nThere were five distinguished persons associated with the formation of the alphabet namely: King Se-jong 世宗大王, Cheung In-ji 鄭麟趾, Sŏng Sam-mun 成三問, Shin Suk-ju 申叔舟, and Choi Hang 崔恒.\n\n(1) Se-jong was forty-seven years of age when the work was finished. He had been from his earliest school days a diligent student of the Classics, had read and re-read his books a hundred times, till, once, when he fell ill, his father took them all away from him except one volume. This he read through a\nthousands times we are told, till he became a giant in the literary world of his day. His father before him was a great scholar, and his son after him.\n\nHe invented the water-clock, and sun-dial, and music flourished in his reign. They called him Yo-Sun of the East Peninsula, and Yo-Sun have always been names to conjure with.\n\n(2) The second name we associate with the Alphabet is that of Cheung In-ji, who was chairman of the committee chosen to prepare it. He is said to have played as a little boy within the precincts of the Confucian Temple (成均館) located inside of the Little East-Gate of Seoul. He was born in 1396, a year before the King, and so was forty-eight years of age when the Alphabet was formed. He wrote many books one being a history of Koryo. The king appreciated him so highly that he commanded him to marry into the royal family. This he did, becoming first Minister of State, and the strong administrator of the law.\n\n(3) Shin Suk-ju was, like Cheung, a child of ancient Silla, his family seat being Ko-Ryong (高靈), Kyong-sang (慶尚) Province. He was sent early in life to Japan as a special envoy. He went also as secretary in the train of the ambassador to the Mings. He and Song Sam-mun met Whang Chan (黃賢) and consulted with him concerning Rhyme and Music. He too became Prime Minister and saw six kings come and go. His master likened him to the greatest and most illustrious of China's sages.\n\n(4) Choi Hang was a gifted scholar and a native of Seoul. He was associated with Cheung in the History of Koryo as well as in the creation of the Alphabet. But the state that moved on so gloriously on the high wave of scholarship fell into an awful tragedy, for the young king, like the English Princes of the Tower, was strangled by his uncle Se-jo. Choi, as did Shin and Cheung, cast in his lot with the usurper and comes down through the ages with a spot upon his fair name.\n\n(5) Song Sam-mun. Of all the characters Song is most picturesque. His family name means Completeness and his given\nname was Sam-mun or Three Calls. It is said that when he was born some spirit voice came three times as a wireless message to him through the sky, and so he was always known as Sam-mun, Three Calls.\n\nIn outward appearance he is said to have had a rakish look, while in heart he was true as the gods.\n\nSo often was he called upon by the Crown Prince at all hours, and late at night, to help him in his studies, that he frequently watched the hours through without sleep or change of dress. He was gifted in plaisanterie and a master at story-telling.\n\nHe was caught in the whirlwind of the tragedy in the palace, and when his tender pupil Tan-jong, was foully murdered, Sŏng refused to pay allegiance to the murderer king. As a result he was called upon to die. He did not write as Tennyson, \"Sunset and evening-star and one clear call for me,\" but he wrote something like it, \"I go forth into the Yellow Shades; to-night at what inn I shall lodge no man knoweth.\"\n\nWhen under torture he showed no fear, but said to those about him \"Be faithful to your king, I go to meet mine in the regions beyond.\"\n\nThese are the five men to whom goes the honor of the creation of this simple and beautiful alphabet. They were all masters in the science of Confucian interpretation, and representatives of an extreme school of Chinese philosophy, as any one can find who runs through their writings.\n\nIV.—WHAT RECORDS HAVE WE CONCERNING THE ALPHABET?\n\nI shall mention nine, that I have seen and have had direct access to. Doubtless others would be of little importance as these nine give all the variety of explanations that are to be found. Among these we find passages quoted and requoted, referred to and cross referred to.\n\nThe first in order of importance is the Mun-Hŏn Pi-Go (文獻備考) the greatest of Korean literary compilations, an encyclopædia that I was given access to by the kindness of\nH. E. the Governor-General. It was begun by King Yong-jong (英宗) in 1770. Volume XXII, Section 108, is given up entirely to the People's Alphabet. I shall quote later on, the preface by the chief of the committee that prepared it, Cheung In-ji (鄭麟趾). This book also gives the views concerning the Alphabet held in 1770, three hundred years and more after its creation. Hong Yang-ho, the greatest scholar of that time, adds a full and interesting statement. This I take as the most important evidence possible bearing on the creation of the Alphabet, since we have the word of the composers themselves, and then the witness of an acknowledged great authority at the time of the compilation of the Encyclopaedia. The heading runs, \"Mun-Hon Pi-Go Volume XXII, Section 108, Music (樂考).\"\n\nI would call your attention, before I read, to the heading of this section that deals with the Alphabet. It is marked Music. We naturally ask what has music to do with the Alphabet? The answer is, The Alphabet in sound is based on the 5 Chinese Notes of Music, Kung, Sang, Kak, Chi, U, 宮商角徵羽, hence this heading. It is significant as it sets a definite origin for the sound, which is one of the points in question.\n\nBut now I shall give a translation of the section (See Chart IV) \"King Se-Jong of Chosen, in the 28th year of his reign made the People's Alphabet. Said he, 'Each country has its own script by which to record its speech but we have none' and so he made the 28 letters calling it the Common Script, 論文.\n\n\"He opened an office in the palace and selected Cheung In-ji (鄭麟趾), Shin Suk-ju (申叔舟), Söng Sam-mun (成三問), and Choi Hang (崔恒), to undertake the work. They used the ancient \"seal,\" 篆字, character as a model for the forms, and divided the letters into Initials, Medials and Finals. Though these letters are few in number and easily formed, their possible use is unlimited, so that all sounds and literary expressions can be recorded by them without exception.\n\n\"At this time a noted scholar of the Hallim, Whang Chan (黃瓚), a man of the Mings, was in exile in Laotung. By\ncommand of the King this Committee visited him and inquired concerning Music and Rhyme. They visited him in all thirteen times.\"\n\nThis is the introductory statement and we come now to the preface written by Cheung In-ji, Minister of Ceremonies (禮曹判書).\n\n\"There are various sounds that pertain to earth and naturally there are various forms of script to indicate them. The ancients constructed their forms of writing to suit the sounds to be recorded, and made them a means of conveying all varieties of thought. It became thus the medium for recording the Doctrine of the Three Parties (三才), Heaven, Earth and Man, so that matters of statement might remain fixed for future generations.\n\n\"But as customs in the four quarters of the earth differ from one another, so the characteristic sounds differ likewise. Various outside nations, other than China, have sounds of speech but no letters by which to record them, and so they have made use of the character. But it has been like trying to fit a wrong wedge into a chiselled hole. How could one expect to find such an expedient satisfactory? The important matter is to find some convenience suitable to each place, and not to try to force each into the method of the other.\n\n\"Our Korean ceremonial forms, music, literature and art are very closely allied to those of China, but our speech and dialects are altogether different. Students of the character are at a loss to get at the exact thought and oftentimes the justice of the peace is at his wits' end as to how to record definitely the judgment arrived at.\n\n\"Because of this, in ancient days Sölchong (薛聰) invented the Itu (吏讀), which the officials use till the present day. It is a recording of sound by means of the character, a contrivance both tasteless and cumbersome, arranged in a way that is lacking in good form. As for ordinary speech, the Itu is wholly unsuitable to express one sound out of a thousand. Because of this in the winter of 1443 His Majesty began work\nThe Preface to the People's Alphabet\n\nby Chueung In-ji.\n\nCHART IV.\non the 28 letters and in accordance with the use to be made of them called them the Hun-Min Cheung-Eum (訓民正音), the People's Alphabet. In their form and shape they were modelled after the ancient \"seal\" character of China; in sound after the 7 Primary Notes (七調) of Music. The principle of the 3 Primary Forces (三極) of nature was adhered to, as well as that of the two Primary Essences (二氣) and all were included in the 28 letters.\n\n\"Their possibility of interchange is unlimited, simple and yet efficient, neat of form and yet comprehensive enough for any combination. A person of intelligence can learn them in a morning, and the stupidest person in a few days. By means of these, the character can be mastered, and the thought understood in cases at law. In rhyme, too the difference can be expressed between 'clear' and 'mixed' sounds, and songs can be written to suit the notes of music. There is no limit to their variety of use, the sound of the wind, the call of birds, cackling of fowls and barking of dogs, all can be expressed.\n\n\"His Majesty commanded us to explain it most definitely to the people, so that, even without a teacher, the reader might understand it.\n\n\"The first origin and mystery of their construction did not lie with us, but with our monarch, who, being a Sage, raised up of God, made laws and regulations that showed him superior to a hundred kings. So too, in the making of the Alphabet, he took little pattern from things seen, but rather evolved it from his own inner consciousness. It was not done by the law of men but by an infinite grasp on eternal principles.\"\n\nIn the Journal of the Royal Asiatic Society for 1895, page 510, there will be found a part of this preface translated by Mr. Aston. Mr. Aston did not see the original work but found it quoted in the Kuk-cho Po-gam (國朝實錄) and made his translation from that. He translated the i-keni (二氣) by the phrase \"two breathings,\" while Mayers in his Chinese Readers' Manual (page 293) explains it as \"The Two Primary Essences, the Yang...\"\nand the Yin (陽陰).” According to Korean interpretation Mayers is right.\n\nMr. Aston also says “The statement that the Enmun was framed after the model of the ancient “seal” characters of the Chinese is quite unintelligible.” We shall see as to this later.\n\nThe paragraph closes with “Our Eastern Kingdom, though old, has waited till to-day to see a wisdom that would investigate all things and accomplish the impossible.”\n\nThis is Cheung’s preface. The King then wrote (see Chart V) “Our speech in sound differs from that of China, and so we cannot communicate it by means of the character. Men unlearned cannot write down their thoughts.\n\n“Because of this I was moved with compassion for the people, and made the 28 letters of the Alphabet so that all men could easily learn them and have something simple for every day use.\n\n“ㄱ is a palatal the initial sound of Kun also the initial sound of Kwa.\n\nㄱ is a palatal the initial sound of K’wai.\n\nö ö ö ö ö Öp.\n\nㄷ ,, lingual ,, ,, ,, ,, Tu, also of Tan.\n\nㅌ ,, ,, ,, ,, ,, T’au.\n\nㄴ ,, ,, ,, ,, ,, Na.\n\nㅂ ,, ,, ,, ,, ,, Fyöl, also of Pu.\n\nㅍ ,, ,, ,, ,, ,, P’yö.\n\nㅁ ,, ,, ,, ,, ,, Mi.\n\nㅈ ,, dental ,, ,, ,, ,, Chak, also of Cha.\n\nㅊ ,, ,, ,, ,, ,, Ch’un.\n\nㅅ ,, ,, ,, ,, ,, Sul, also of Sa.\n\nㅎ ,, ,, ,, ,, ,, Hub.\n\nㄲ ,, ,, ,, ,, ,, Hö, also of Ho.\n\nㅇ ,, ,, ,, ,, ,, Yok.\n\n己 is a half lingual the initial sound of Ryo.\n\n△ ,, dental ,, ,, ,, ,, Yang.\n\nㆍ is the medial seen in Tan.\n\nㅡ ,, ,, ,, ,, ,, Cheuk.\nCHART V.\n\nKing Se-jong's Alphabet as found in the Mun-hön Pi-go.\n\n* The four letters ᅠ, ᅡ, ᅢ and ᅣ are silent when used as initials, ᅠ which now takes the place of all four is equal to ng when used as a final.\nThe four letters ω, ο, ρ, and Δ are silent when used as initials, ω which now takes the place of all four is equal to ng when used as a final.\nis the medial seen in *Chim*.\n\n| | | |\n|---|---|---|\n| | | |\n| | | |\n| | | |\n| | | |\n| | | |\n\n\"I have examined the Alphabet of king Se-Jong,\" says an authority, here inserted, \"and he has fulfilled all the requirements of Labial, Dental, Guttural, Lingual and Palatal sounds, completing the circle of the Five Notes of Music, *Kung*, *Sang*, *Kak*, *Chi* and *U*, with all the distinctions expressed between Clear and Mixed and High and Low sounds.\"\n\nKing Suk-jong, who reigned from 1675 to 1721, wrote a later appendix to the People's Alphabet saying \"My honored ancestor King Se-jong, being a sage, gifted of Heaven, great even as Yo (尧) and Sun (舜), a master of ceremony, music and literature, was disturbed by the fact that the language of his kingdom differed from that of China, and that the unlettered people among his subjects had no way of recording their thoughts. In intervals of leisure from Government affairs, he formed 28 letters, explaining them clearly so that posterity might understand, easy to learn and convenient for daily use. He prepared their form, differentiated their tones, made them simple in shape but all-sufficient for every use. To learn them is not a question of knowledge, and as for their use it is not a question of much or little. Characters that could not be explained formerly can now be recorded in the Enmun. The depth of all mystery is exemplified in the Alphabet and all things are fathomed by it. This was indeed the work of a great Sage, not a thing decided upon but evolved according to eternal principles, great and wonderful, ha! ha!!\"\n\nSŏng Hyŏn (成 健) a contemporary of Cheung In-ji says\nthe Enmun was made according to the division of the Five Notes of Music: Palatals, Linguals, Labials, Dentals, and Gutturals (牙舌唇齒喉).\n\nYi Su-Kwang who lived (李晧光) in 1585 A.D. or a hundred and fifty years later says \"Our vulgar script was modelled in form entirely after the Sanscrit. King Se-jong set up an office in the palace and the letters were formed from His Majesty's inner consciousness. After its formation there was no language that it could not record and no one but a Sage could have made it.\"\n\nIn the year 1753 there graduated a famous scholar Hong Yang-ho (洪良浩) who has left many literary records. Among these we find the following: \"In the wide range of heaven and earth all manner of sounds congregate, but man's voice alone has been tamed for speech. There are sounds that belong to heaven above as the thunder, and sounds that belong to the earth beneath as the wind. Unless these can be set in order according to the Five Musical Notes they cannot be used in singing. The sound of the human voice has but five variations namely, palatals, linguals, labials, dentals and gutturals, and within these limits all possible sounds can be expressed. But what we call sound has no appearance, and so we make use of letters to express it, and letters have appearance. In the Index of the Six Classics, sounds are arranged so as to agree with the sharps and flats of music. But characters from China cannot be used to record sounds of foreign countries. They are impossible to use in the matter of recording speech, much less for the recording of music.\n\n\"By the good blessing of God upon us, His Majesty King Se-jong through wisdom given him from above, invented the 28 letters and wrote the People's Alphabet. He made it to agree with the number of the Constellations in the heaven. In shape they are like gems and bangles, round and cornered, written with dots and strokes like the 'lesser seal character' (小篆) and 'later official script' (分隸).\"\n\n\"A noted writer of 1650 A.D. Choi Sök-jöng (崔錫鼎)\"\nwrote a book explaining their sounds dividing them into Initials, Medials and Finals. As to their tones, he divided them into Even, Upper, Departing, Entering etc. This writer's explanation of the alphabet is as marvellous as Choi-si's notes on Confucious. If we examine his picture of the tones, their branches, divisions, and final changes, it would seem to be second only to the creation of the letters themselves. The reason that they did not write out a fuller explanation of them when they were first invented, was the fact that it was a matter too weighty to be understood easily, and one not acceptable for the scholar class in general. And now I dare to take my part in this explanation showing the sound to conform to the five voice divisions, palatals, linguals, labials, dentals, and gutturals, and that in shape they follow the law that governs the classics, being built from square, circular, angular and straight lines. Thus I, daring to add my note to His Majesty's work, would prove that the law that governs tones and sounds (聲 音) is born of God and not of man.\"\n\nHong Yang-Ho adds this note concerning the seventeen consonants (see Chart VI) and thus closes the record of Section 108, Vol. XXII, of the Mun-Hon Pi-Go.\n\n\"ㄱ is the initial sound of Kun a palatal, in form, a picture of the open jaw.\n\nㅋ is the initial sound of K'vai an asperated k'.\n\nㆁ is the initial sound of Öp, a half guttural and half palatal, in form, a picture of the throat and palate.\n\nㄴ is the initial sound of Na, a lingual, in form a picture of the tongue.\n\nㄷ is the initial sound of Tu, a lingual, in form a picture of the tongue in motion.\n\nㅌ is the initial sound of Tan, an asperated lingual.\n\nㅂ is the initial sound of Pjöl, a labial and a picture of the half open mouth.\n\nㅍ is the initial sound of Pjyo, a labial, in form a picture of the wide open mouth.\"\nCHART VI.\n\nHong Yang-ho's Order of Letters.\nis the initial sound of Mi, a labial, a picture of the mouth.\n\nis the initial sound of Sul, a dental, in form, a picture of the teeth.\n\nis the initial sound of Cheuk, a half dental and half lingual and a picture of the gums and teeth.\n\nis the initial sound of C'lin, a half guttural and a half dental.\n\nis the initial sound of Yōk, a light guttural, a picture of the throat.\n\nis the initial sound of Eup, a half dental and half guttural, a picture of the gums and throat.\n\nis the initial sound of Ho, a deep guttural.\n\nis the initial sound of Ryo, a half lingual a picture of the rolling tongue.\n\nis the initial sound of Yang, a half dental a picture of the partially opened teeth.\"\n\n(These are fanciful similarities, more or less related to the Vocal Distinguisher (牙舌唇齒喉) in each case).\n\n2nd. The second authority I mention is the Kuk-cho, Pogam begun by King Se-jong and carried on down to the reign of Ik-jong, 1835 A.D.\n\nIt tells us in Vol. III, page 31, that the alphabet was composed of 28 letters, (This is translated by Mr. Aston and published in the Journal of the Royal Asiatic Society 1895) their shape being modelled after the \"seal\" characters of China, that they were divided into three groups, of Initials, Medials and Finals; that they agree in sound with the Seven Primary Notes of Music, the Three Powers of Nature and the two Original Elements. Rhyme, too, was expressed, and also Clear and Mixed Sounds.\n\n3rd. The third authority that I mention is the Hai-dong Yōk-sa, 海東歴史 a history of Korea written about 1770. It is one of the books republished last year by the Society of Ancient Korean Literature. In Vol. II, page 35, we read, \"King Se-jong prepared the People's Alphabet of 28 letters and modelled their form after the \"seal\" characters of China.\"\n4th. The fourth authority is the Tai-dong Ya-seung (大東野乘), a collection of Korean writings published last year by the Society of Ancient Korean Literature. In Vol. X, page 385, I find a statement written by one Yi Chöng-hyöng (李廷馨), who lived about 1600. The record reads that King Se-jong formed the Enmun of 28 letters and that they were divided according to the Five Notes of Music: Palatals, Linguals, Labials, Dentals and Gutturals, expressing both the Clear and Mixed sounds. There is no mention as to what constituted the basis of form.\n\n5th and 6th. The fifth and sixth authorities are the Kuk-cho Pyön-ryön (國朝編年) and the Yön-ryö Keui-sul (燃藜記述). They give exactly the same record, word for word. They say, \"The king had a special office set up in the palace enclosure where Shin Suk-ju, Söng Sam-mun and others engaged in the work of preparing the letters. It was called the Hun-min Cheung-eum, The People's Alphabet, and was composed of 28 letters in all, eight were used as initials or finals, eight as initials, and eleven as medials. The forms of the letters were modelled after the ancient \"seal\" characters of China and the Buddhist Sanscrit, (梵書). He divided these letters according to the divisions of the Five Notes of Music. He also made a distinction between heavy and light sounds. He marked some as Clear, some as less Clear, some Mixed, some less Mixed etc. (清濁全次).\n\n\"Even the women could learn to read it, so easy was it made.\"\n\nI may state here that the original division of the letters as made by King Se-jong, and as still seen in books printed at that time, included 17 letters to be used both as initials and finals, and 11 medials.\n\nThe record however of these two authorities state that there were 8 used as initials and finals, 8 used as initials only, and 11 as medials, making in all 27, showing that by the time this record was made, one letter was lost altogether, and that a sharp division had come about between certain initials and certain finals. This\nalone would show that the statement made in these two books was written at a considerable period after the formation of the alphabet and therefore is not as valuable in the way of witness as is the Introduction by king Se-jong and Cheung In-ji.\n\n7th. The seventh authority is a book called \"The Sound of the Rhymes\" (三韻聲彙), written by Hong Ke-heui (洪啓禎) who graduated in 1737 A.D. He says the initials were divided under the different heads of the 5 Notes, 5 Elements and 7 Sounds, Clear and Mixed, less Clear and less Mixed.\n\n8th. The eighth authority \"An explanation of the Four Tones\" (四聲通解) was written by Choi Se-jin (崔世珍) who, he informs us, took Shin Suk-ju as his authority. He too divides the letters according to the 5 Notes, 5 Elements, 7 Sounds, Clear and Mixed etc.\n\n9th. The ninth authority is that of a society that was formed in 1907, composed of such scholars as Chu Si-kyöng 周時經, Chi Sok-yöng 池錫永 and others who have undertaken to investigate the historical records pertaining to the Eonnun and to note the changes that have come about in its forms and use. It is called the Society for the Investigation of the National Script (國文研究會). One of their findings is as follows:\n\n\"In the days of Chung-suk of Koryö (1314-1331) a princess of the Mongols, his queen, used the original Turkish form of writing, but there is no definite explanation of it in the literary records so that it never became known to, or of any service to the people of Korea.\n\n\"Shin Kyöng-jun (申景濬) in his book, Charts Explanatory of the People's Alphabet, (訓民正音圖解), says the original writing used by the Mongol queen of Chung-suk of Koryö was not understood by us. This was evidently the native script of the Mongols. The queen's people were Mongols; and belonged to the Woigol (畏吾兒) tribe, as one finds recorded in the Kang-yok-go (疆域考) of China.\n\n\"She desired to pass on her form of writing to the people generally, but did not succeed, and so we have no record of the sounds or shapes of the letters.\"\nThus have we traditions of forms of writing different from the Chinese and prior to the Enmun, but there are no definite literary records concerning them.\n\nAgain Shin Kyŏng-jun who wrote *Charts Explanatory of the People's Alphabet* says, 'In the East Kingdom, in ancient days, there seem to have been methods of writing the vernacular, but we do not know definitely the number of the letters employed nor do we know anything of their shape. They evidently pertain to some small separate sections of the country.' As to what is meant by \"ancient days\" we do not know. We conclude however that these alphabets were never formed completely and were never given out to the people.\n\nThe Buddhist Classic *Chin-ŏn*, (眞言集), in its preface, states that in ancient times Ryo-eui of India (西域高僧了義) prepared an alphabet of 36 letters which the dictionary and lexicon makers of China took as their model, and explained by means of the Pan-jŏl, marking the 4 Tones and the Clear and Mixed forms explicitly. In the time of Hong-mu of the Mings they reconstructed the Rhyme tables and made, instead, 31 letters. Then again our government took these letters as a model and made the Enmun, translating the various Classics by it, marking a difference between high and low sounds and between the Four Tones by means of dots. The perfect and imperfect of the Clear and Mixed were marked in the Eummun letters themselves by single and double forms.\"\n\nI would like to note here some of the outstanding points on which the authorities agree.\n\n1st, The 28 letters.\n2nd, The 3 divisions; initial, medial and final.\n3rd, The 5 notes of the gamut.\n4th, The 7 notes of music.\n5th, The 5 vocal divisions.\n6th, Mixed and clear sounds, less mixed (we might say aspirate and non aspirate) and less clear.\n7th, The 3 forces of nature.\n8th, The 5 Elements.\nCHART VII.\n\nThe Absolute.\n(The Source of the Yang and the Yin).\n\n1\n2\n3\n4\n\nThe Four Secondary Figures.\n9th, The 2 Original Essences,\n10th, The \"seal\" Characters of China.\n11th, Single and double strokes. Also a reference to Sanscrit.\n\n**CHART XVI.**\n\nIllustrating the formation of the Vowels.\n\n**CHART XV.**\n\nIllustrating the formation of the Consonants.\n\nLet us now examine the Enmun Alphabet, compare it with the Sanscrit and Chinese equivalents (the first Cha-mo of 36 letters and the later Hong-mu of 31, see Chart. IX) and see what indications there are that throw light upon its origin. Let us explain first, two of the charts accompanying this paper. Chart. VII is a picture of the Ultimate Principle of Being. (Mayers). This is the circle so familiar to all acquainted with the East. Giles calls it \"The Absolute of Confucian Cosmogony.\"\n\nA saying of the East is that the Absolute begat the Two Primary Forms (the Yang and the Yin), and the Two Primary Forms begat the Four Secondary Figures, (Four pairs of divided and undivided lines) and that the Secondary Figures (See Chart. VII.) begat the Eight Diagrams. (See Chart. VIII.) This circle then, represents the first origin of all things. I suppose that an alphabet begotten within the realm of Chinese Philosophy would have to demonstrate its pedigree back to the Absolute if it hoped to win a place or name. Connect it with the Absolute and its genuine character would be established. Included in the compass of this circle, if we speak of principles, are the Positive and the Negative, the White and the Black; if we speak of sex, the\nCHART VIII.\n\n卦 八\n\nEldest Daughter.\n\nSecond Daughter.\nSouth.\n\nMother.\n\nEldest Son.\nEast.\n\nThird Son.\n\nNorth.\nSecond Son.\n\nFather.\n\nThe Eight Diagrams.\nWhite is the male and the Black the female; if of place, the White represents Heaven and the Black the Earth or Hell.\n\nBorn of these two, the Yang and the Yin as they are called in China, are the Eight Diagrams (see Chart. VIII.) which constitute the basis of the great classic the Canon of Changes (周易) \"which contains\" says Giles \"a fanciful system of Philosophy deduced from the combinations of the Eight Diagrams.\"\n\nThe Diagrams are arranged in accordance with the Dual Principle, with the Negatives on the upper and west sides, and the Positives on the east and lower sides. They each have a name and a settled place which cannot be changed. They are likened to a family of father and mother and six children. Kön (乾) is the father, Kon (坤) the mother, Chin (震) the eldest son, Son (巽) the eldest daughter, Kam (坎) the second son, Yi (離) the second daughter, Kan (艮) the youngest son and T'ai (兌) the youngest daughter. In true Chinese form the father and three sons are on one side, and the mother and three daughters on the other.\n\nLet us now turn to Chart. IX that has on it the three Alphabets, one, the oldest of the three, the Sanscrit, composed of 35 consonants with an extra nasal and an aspirate, and 14 vowels, two rows of them, the upper row being the vowels when used as initials, and the lower the same vowels when used as medials.\n\nThe Second is the Chinese Alphabet of initials, 36 in number, marked with a circle over each one (see page 43) to indicate the character of the sound expressed as Mixed or Clear, less Mixed and less Clear, or we might say aspirated and non aspirated. Some are all clear having the white circle ○; some partially clear, with the dot in the centre ●; some are mixed, being altogether black ●; and some partially mixed, marked with a blackened half moon ♦. These four circles are equal to the Four Secondary Figures (see Chart. VII). This Chinese Alphabet was modelled after the Sanscrit and published about 543 A.D. (Parker). I have taken the alphabet from the Preface to the Kang-heui Dictionary. It comes from an entirely independent source and any discovered relation to the Korean Alphabet is a surprise and\nCHART IX.\n\nThe Sanscrit Alphabet.\n\nThe Sanscrit Alphabet from which the Chinese Alphabet of 36 letters was Modelled.\n\nThe Ancient Chinese Alphabet (36 letters) of Consonants (A.D. 543).\n\nThe Korean Equivalents.\n\nThe order of Consonants in the King's List.\n\n(See Chart V).\nThe Hong-mu Alphabet (31 letters) of Consonants\n(A.D. 1375).\n\n精微奉非明並滂幫泥定透端疑郡溪見\n△ 2 0 0 0 0 0 0 0 0 0 0 0\n\n日來喩匣曉影禪審牀穿照邪心從清\n△ 2 0 0 0 0 0 0 0 0 0 0 0\n\nThe Chinese Alphabet (36 letters) with marks for Clear and Mixed Sounds.\n\n敷非明並滂幫娘澄徹知泥定透端疑郡溪見\n△ 2 0 0 0 0 0 0 0 0 0 0 0\n\n日來喩匣曉影禪審牀穿照邪心從清精微奉\n△ 2 0 0 0 0 0 0 0 0 0 0 0\n\nCHART X.\n\nGutturals  Dentals  Labials  Linguals  Palatals\n\n喉  齒  唇  舌  牙\n\n日來 喻影匣曉 邪心從清精 禪審牀穿照 微奉敷非 娘澄徹知\nThe King's Alphabet has in all 28 letters, 17 Consonants and 11 Vowels. In common use today there are only 25, three having been discarded ो, o, Δ. Their sounds approximating so closely to that of ό, the latter has been substituted and now is used for the other three as well as in its own place.\n\n(Mr. Aston, Journal R. A. S. 1895 page 510, gives ό, ο and Ι as the three missing letters. This is a mistake, Mr. Scott gives them correctly (Corean Manual Page II)).\nneedless to say a satisfaction as it helps to throw light on a thus far, unsolved question.\n\nThere are in the Korean Alphabet 28 letters including Initials, Medials and Finals, or, we had better say, consonants and vowels, seventeen of the one, and eleven of the other.\n\nLet us endeavour to see if indications would point to any seeming relationship between the Korean and either of the other two.\n\nTo begin with, let me state once more that in the Introduction to the Buddhist work Chin-ŏn we are told that the Enmun was modelled after the Alphabet of Hong-mu which has but 31 letters. This Alphabet of Hong-mu, (see Charts II & IX), is the same as the Ancient Alphabet of China with the 9th, 10th, 11th, 12th, and 18th, letters dropped.\n\nI.—The Number of the Letters.\n\nWe shall take up first the number of the letters, 28 in all. This is the number given by King Se-jong in the record of the Mun-hŏn Pi-go (See Charts V. and X.) seventeen of these being consonants. We shall leave the vowels for the present and examine the consonants only. There are, as we said, 17 of them. Let us run over the Sanscrit consonants, eliminating the double letters, and see if we can find any relation as to number. The effort is quite a hopeless one. By whatever law we may approach the list there is no direct relationship as to number and they remain 35 and 17, impossible to reduce to direct relationship or harmony.\n\nTurn now to the Chinese Alphabet of 36 letters. It would seem as though that were equally hopeless, for 36 is not a multiple of 17, nor is there any numerical common divisor. Still we shall examine the list and count from 一 (見) ‘one, two, three.’ This 3rd letter however is a double in Korean, two K’s (ㄲ), so we discard it and count the 4th Chinese letter (疑) number three of the Korean (''). The 5th Chinese letter becomes number four, the 6th number five, till we arrive at the 8th letter which will be number six. At this point we meet a repetition of the t (ㄷ) a lighter sound of the 4th letter. So with the three following, all are\nlight forms of the four just passed. As they are one and the same set of letters we can drop them all from our reckoning and mark the 13th Chinese (聲) letter number seven 口. Then we pass on to the eight and dropping the 15th Chinese as a double in Korean we call the 16th, nine. Dropping the next four as secondary forms of the four 口, 立, 明, 口 just passed, the 21st letter of the Chinese becomes the tenth of the Korean, the 22nd, the eleventh, the 23rd, is a double so the 24th (人) is the Korean twelfth 人. The 25th, is also a double form and the 26th to the 30th are all secondary readings of 天 天 天 天 天 天, so they can be dropped bringing us to the 31st Chinese letter (影) which is number thirteen of the Korean (影); the 32nd is fourteen; the 33rd, being a double form is dropped, the 34th becomes fifteen, the 35th, sixteen, and the 36th, seventeen. There are therefore in this list of 36 sounds what are equivalent to just 17 separate letters in Korean, and these agree exactly with the number of consonants in the King's Alphabet, or rather, the number of consonants in the Enmun agrees exactly with the single letter sounds in the Chinese Cha-Mo (字 母). With 17 Korean letters all these sounds can be expressed. This is surely significant and points no little to the Chinese Alphabet's having been the model in the first instance.\n\nII.—The Order of the Letters.\n\nWhere did King Se-jong get his order of the letters? It is not the order in common use to-day. We say ㄱ Ka, ㄴ Na, ㄷ Ta, ㄹ Ra, ㅁ Ma, ㅂ Pa, ㅅ Sa, ㅇ A. It is not the exact order as given by Hong Yang-ho (1770) as seen in the Mun-hôn Pi-go. (see Chart VI).\n\nWhence came this order as we find it in the Mun-hôn Pi-go? (see Charts V and X). Before taking up the individual letters, let us see how King Se-jong has grouped them? They are in groups of three, each marked specially. We shall call the first group Palatals (牙), as the distinguishing mark is the character for back teeth. The Second group is Linguals being marked by the character for tongue (舌); the third\nCHART XI.\n\nThe Circle of Consonants (by Shin Kyöng-jun).\ngroup Labials, marked by the character for lips (唇), the fourth Dentals, being marked by the character for front teeth (齒), and the fifth Gutturals, being marked by the character for throat (喉). Of the last two letters one is a half Lingual and one a half Dental. I turn now to the list that I find in the preface of the Kang-heui Dictionary, look up the grouping of the Chinese Consonants, and find there a similar division into five groups with two half tone letters at the end. The groups are precisely the same in order: Palatals, Linguals, Labials, Dentals and Gutturals. Also there are four each in all of the groups but the Dentals. There there are five This too finds an exact counterpart in the Korean, for while but one double form is possible in the groups of Palatals, Linguals, Labials, and Gutturals we have two in the Dentals, making five possible in that group whereas there are but four in each of the others. This would show that the grouping is just the same in the Korean as in the Chinese list. More convincing still is it if we follow the individual letters and read them one after the other dropping the double forms. We have them ᄃ K, ᄂ K’, ᄀ; ᄁ T, ᄂ T’, ᄃ N; ᄄ P, ᄅ P’, ᄆ M; ᄇ Ch, ᄈ Ch’, ᄉ S; ᄊ H, ᄋ H, ᄌ; ᄍ L, Δ, agreeing exactly with the Chinese.\n\nThe question arises as to why ᄏ should appear so far down on the King’s list when ᄏ to-day is the fourth letter in the ordinary alphabetic list? It is No. 16 in one case and No. 4 in the other. How can it be accounted for? Very easily. The King places it next to the last because the Chinese L was the next letter to the last. Its general use as No. 4 is also to be understood from the fact that it is a half Lingual and so is grouped with T and N the other Linguals. This order of the letters is a very important factor in solving the origin of the Alphabet and it points straight to the Chinese Alphabet as the model of its construction.\n\nL appears far down in the Sanscrit list, but we have Dentals following it and H. Besides there is a difference in the grouping and five letters instead of four appear in each group of the Sanscrit.\nChina while using Sanscrit as her model has made changes and adjustments and these the Korean has followed to the very letter.\n\nIII.—The Sound of the Letters.\n\nAll authorities agree in saying that the letters, in sound, were made to agree with the Five or Seven Notes of Chinese Music Kung, Sang, Kak, Chi, U. In consideration of these statements let us examine Charts XIV (The Powers and Functions of Nature arranged according to Chinese Philosophy) and XI (Shin Kyŏng-chun's Wheel of Initials). The note Kung (宮) being associated with Earth, according to Chart XIV, takes its place in the Centre, having beside it, its Vocal Distinguisher, Throat (喉) (Guttural). As Earth is the Chief of all the other natural elements: Water, Wood, Fire, Metal, (金木水火), so Kung is the chief note of all the five, as the throat is the chief seat of all organs of utterance. Its associate color is yellow (Chart XIV). This is where Imperial yellow comes from; where the name \"Middle Kingdom\" (中國) for China comes from. According to Chinese Philosophy the writer was obliged to place Kung in the centre. Let us see if these letters can find each his place according as the other Notes of Music circle about Kung.\n\nTo the East is Kak (角) with four letters under it; to the South Chi (徵) with four under it, and four secondary ones distinguished by longer vertical strokes—not used ordinarily in Korea, but used to express, for the Korean, Chinese sounds of the character. Under Sang (商) to the West we have five letters, because of the two double forms, as mentioned before. This group too, has secondary forms, expressed by one leg of the letters being longer than the other. U (無) is to the North with four letters. Its secondary readings are distinguished by having the circle written under each letter. If you turn to Cheung In-ji's book, The Flying Dragons in Heaven, as re-published this year you will see many of these secondary forms used there.\n\nIf we count all the letters in this Wheel with the double\nand secondary forms, and the two half tone letters ㄹ and Δ, we have just 36 as has the Chinese Alphabet. The marks here of the circle, over each letter, agree too with the list in the Kang-heui Dictionary. According to this chart ㅇ—ㄴ N, ㅅ S, ㅁ M, are made the Divisional Letters. As to how this comes about we shall see under the next heading The Forms of the Letters. We are told too, by the author, that the one stroke and the two, have had to do with the development of the letters under each divisional head. This we shall deal with also later.\n\nOne cannot but be surprised to see how the letters can march into their places, and make so perfect and symmetrical a whole answering to the exacting requirements of Chinese philosophy. Sound, and shape, and compass points, have all to be accounted for. The Centre Kung is said to possess the four midway sections: NE, SE, NW, SW, and according to this, Kung’s developed letters ㅇ, ㅎ, ㅗ, ㅏ, appear in these regions. The author attempts to show, too, that the letters agree with the Natural Elements: Metal, Wood, Water, etc, in each case, also with the Vocal Indicator. But this we may pass by, granting that the readiness with which they find their places, would seem to prove their relation to Chinese philosophy from the first inception. By no possible means could the Sanscrit alphabet be fitted symmetrically into any such frame-work.\n\nIV.—The Shape of the Letters.\n\nLet me give, first of all, some of the conclusions of Western scholars as regards the form and shape of the letters.\n\nMr. Hulbert (The Passing of Korea, Page 92) says “The consonants are all simplifications of the Thibetan consonants, which are of course Sanscrit in character, and the vowels are all taken from the simplest strokes of the ancient “seal” character of China.” The Preface to Giles, Chinese-English Dictionary written by E. H. Parker says “It seems quite certain that the Korean letters are Sanscrit letters modified in form so as to suit the Chinese brush.”\nMr. Scott in his *Korean Manual* page xiv says \"While drawing on the Hong-mu phonetics, Koreans went direct to the Sanscrit for the form of their letters.\"\n\nMr. Aston (Journal of the Royal Asiatic Society 1895, Page 510) says \"A comparison with the Devanagari disclose several points of resemblance which cannot be accidental.\"\n\nAll of these authorities lean toward Sanscrit, and yet the Hong-mu Alphabet is the only definite land-mark that they are able to cite, and the Hong-mu was taken not from the Sanscrit but from the original Chinese Alphabet that had been invented a thousand years previously.\n\nWhat then is the Key to the form of the consonants? We have various statements. All authorities agree as to their having been modelled after the \"seal\" character of China. Later authorities speak of the Sanscrit as well. Anyone who will take the trouble to consult the Kang-heui Dictionary will find seventeen or more forms just like the Eumun (see Chart XII). To a surprising degree the forms are one and the same. It takes a very long stretch of the imagination to see any similarity between the Sanscrit letters, (if we except the two medial vowels \\(a\\)—and \\(a\\) \\(T\\)), and the Eumun. The list given by Parker in the Preface to Giles' Dictionary would confirm this statement rather than show any similarity. However much sinologues and language experts may see of a law of evolution at work between one and the other, the Korean, I know, sees none and knew of no such law when these were made. Still the truth of the statement holds that in general form they are like Sanscrit rather than like the character.\n\nThe law however on which the consonants were formed is not evident in this statement. We must look elsewhere for it. In the preface of the Buddhist Classic *Chin-ön* referred to by Mr. Scott, and already quoted here, this statement occurs 清濁全次以諺字單複邊辨 \"The perfect and the imperfect of the Clear and Mixed sounds are marked in the Eumun letters by single and double forms.\" The perfect of the Clear and the perfect of the Mixed would be expressed as \\(T\\) and \\(T\\), \\(T\\)\nCHART XII.\n\nThe Ancient \"Seal\" Character.\n\n— is the first Radical of the character and the same as the Enmun en.\n\n— is the \"seal\" character for 上 the same as the Korean o, written as a \"grass\" character お。\n\n— is the \"seal\" character for 下 the same as the Korean u, written as a \"grass\" character う。\n\n— is the character for book-case the same as the Korean ゆ。\n\n| is the Second Radical of the character, and the same as the Korean i.\n\n\\ is the ancient \"seal\" form for 主 and the same as the Korean a.\n\n\\ is the \"grass\" character for 下。\n\n己 is the \"seal\" character for 乙 eul, the same as the Korean l.\n\n— is the \"seal\" character for 隠 eun the same as the Korean n.\n\n人 is the same in form us 人 and is equal to s or t in Korean.\n\n丈 is the letter cha of China and equal to ch in Korean.\n\n父 is the \"seal\" character for 従 the same as the Korean ss.\n\n日 is the \"seal\" character for 口 the same as the Korean p.\n\n— is the \"seal\" character 亀 with a stroke over it the same as the Korean t.\n\n卜 is the \"seal\" character for 卜 the same as the Korean a.\n\n口 is the character for 口 the same as the Korean m.\n\n○ is the \"seal\" character for 圆 meaning round, spherical, etc.\nand 々, 日 and 月 while the imperfect of the Clear and Mixed sounds are differentiated by — and 二, as we see in 々 and 々, in 々 and 々, in 々 and 々. Among the writings of Shin Kyŏng-jun, in his book called Charts Explanatory of the People's Alphabet, he gives the law that governs their formation (see 五音變成) as the circle 〇, and the one — and two lines 二. The opening paragraph under Radical 1 of Kang-heui gives a note on these, saying that one line — refers to Heaven and two lines 二 refers to Earth, the Divine Unit (天一) so called, and the Terrestrial Pair (地二). The circle and the one and two lines have a special part in Chinese Philosophy, the circle standing in the \"seal\" character for 圆. It also represents the Absolute including the Yang and the Yin, the one line representing the Yang and the two lines the Yin. It would seem most natural then that the circle and these two lines should play a part if possible in any letter making at a time like that of King Sejong. (see Chart XV, page 39, for parts of consonants). We find there the circle and just below it the method of letter development, first one line over the circle 〇, and then two lines over the circle 〇. These two are Nos. 13 and 14 of King Se-jong's Alphabet, and will serve as an illustration of how one order of consonants is made. We have first, however, to develop four companion letters to the circle. The circle representing Kung requires four other Department Heads we might call them, to represent Sang, Kak, Chi and U. The development of these according to Shin Kyŏng-jun takes us into the realm of Chinese Philosophy and the Book of Changes, a very difficult field in which to get one's bearings. However as he develops them we shall try to follow. He quotes a sentence from the Yi-King the Book of Changes, this: \"When an object strikes the earth a sprout shoots forth\" (物觸地而生戴芒角), and we have the circle with the sprout 〇. Next as the sprout shoots forth the original seed circle divides, and we have the two halves, the lower 〇 and the upper 〇. If they be fitted together again we have them placed thus 〇. By a simple change he then develops N 々 from the lower half (々 from 〇) and S 々 from the upper\nhalf, (Λ from Ω) and M ☐ from the two parts fitted together (☐ from Ω). He explains at some length why ☐ M, made in this way, conforms to the requirements of Chinese Philosophy. ☐ M belongs to the winter season (see Chart XIV) where the two ends of the year meet; to the compass point North also, which character (北) has two distinct halves in its composition as compared with the characters for East, West or South. He gives other reasons also that do not appeal to Westerners but that are magnified and made much of in the East. These then are the department heads namely the circle o, the \"sprout\" δ, the N υ, the S Λ, the M ☐.\n\nTwo of the developed letters require the whole circle: the \"sprout\" and the Λ; and two, the half only, N and S. This style of division has the flavor also of Confucian methods. Let us examine these and see how far they yield to the one and two strokes in the development of the other individual letters:\n\no o o, δ n n, υ t t, Λ s s, ☐ p p.\n\n— — h, — k k', n t t', s ch ch', m p p'.\n\nOut of ten seven yield at once. The first exception is the k, where the circle is dropped off. The dropping off seems reasonable. If we continue the figure of the seed it would be so. But otherwise, it is reasonable also for it would be a combination letter and out of proportion with its associates in simplicity of shape and size. The p. υ is another exception, it being made up of two half lines at the corners instead of a whole line written above. If you turn to Kang-heui and find the Radical ☐, you will see that υ is the old form for the same character, which might explain its exceptional use here. The p' υ is formed by adding two half lines to the other corners and then upsetting the letter. The law of the one and two lines, however, is so remarkably evident in the make up of these letters, in spite of the exceptions, that with the other evidence pointing to China it provides a very interesting and important addition. The L 己, is modelled after the \"seal\" character cul 已 as found in the\nKang-heui Dictionary Vol. I leaf 3. Δ is made up of the line written below the S ∧ instead of above.\n\nThese letters, in their shapes, show as little resemblance to the Chinese consonants as they do to the Sanscrit. Certainly by no stretch of the imagination could they be said to resemble either the one or the other.\n\nAny statement that they do, made by sinologues like Scott, Hulbert, Aston and others who have had much experience in matters Oriental, would seem to be due to the fact that they have not closely studied Korean in the light of such Chinese contributions to the subject as the preface to Kang-heui's Dictionary, Sam-un Sŏng-eui, etc.\n\nThe Vowels.\n\nIn dealing with the shapes of the letters we shall take up the vowels at this point and examine them as arranged on Shin Kyŏng-jun's Philosophic Wheel. From the circle which is in the centre is developed the dot. This is placed at the North to agree with the middle line of the Kam (火) Diagram ☐ as seen in Chart VIII, page 40. The dot is the ancient \"seal\" character for 丰 king (see Kang-heui, 3rd Radical). From the dot come the two dots which, according to the law of the Yang and Yin, is placed at the South. These two dots agree likewise with the middle or broken line of the Yi (易) Diagram ☐ found at the South (see Chart VIII). The dot again develops into a horizontal line which is placed in its natural order to the East, and the two dots into a vertical line which is seen at the West. In the Kang-heui Dictionary page 1 the character 丰 has for \"seal\" form, 丰; this again has for \"grass\" or running hand 丰. These three dots show that one dot equals the horizontal, and two dots the vertical line. The reverse is true in the case of 上, 下, 一. The dot and the horizontal are used as equivalents in characters like 亡亡; 京京; 户户. In the further development of the vowels we make use of the two lines, the horizontal and the vertical only. We shall so develop them and they will follow the natural order: above, below, left,\nCHART XIII.\n\nThe Vowels as Illustrated by the Philosophic Circle.\nright; each single having its negative or double form placed opposite. The order too will be left-handwards on the circle. We write the horizontal and place a vertical above it \\( o \\). Its place is outside at the starting point North, it being a new order, or second division. This will have its double to the South \\( yo \\). We write the horizontal and place the vertical below \\( u \\), and it finds its place next in order to the East. Its double follows to the West, \\( yu \\). Next, we write a horizontal and put a vertical to the left, the left always preceding the right in the East. This letter, being a one-sided \\( a \\) in its shape, stands midway between the points of the compass, to the left hand of the letter \\( L \\), as that is the only other letter with which it combines. We cannot combine \\( a \\) with \\( u \\), but only with \\( o \\) thus \\( na \\), so its place is fixed by the conditions of the circle. Opposite to it is its double form \\( ya \\). In like manner the horizontal with the vertical to the right becomes \\( ö \\), which is placed to the left of \\( u \\), with which also it combines \\( zö \\). Its double \\( yö \\), finds its place on the opposite side. In this way we have the twelve points occupied. If we count them, beginning with the inside of the circle and passing to the outside, they would run as follows \\( 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 \\). The double dot however \\( .. \\), has never been used as a letter and it does not appear in King Se-jong’s list. Omitting the double dot we have eleven vowels as the list requires, and, what is most remarkable, exactly in the same order as King Se-jong’s Alphabet (See Charts V and X). The vowels could hardly be forced into a Chinese Philosophical Circle of this sort unless they had been constructed in reference to it in the first instance. This points strongly to a Chinese origin.\n\nBesides this, the three factors that contribute to their make up \\( — \\), \\( l \\), \\( v \\), are Radicals Nos. 1, 2 and 3 of every Chinese dictionary. Out of the first two Radicals, the horizontal and vertical lines, come the vowels of the Korean. There is no possible resemblance between the Korean vowels and the Sanscrit initial vowel forms. The Sanscrit medials have two\nCHART XIV.\n\nThe Powers and Functions of Nature arranged according to Chinese Philosophy.\n\n| The Four Diagram Symbols | The Four Secondary Figures | The Five Stellar Influences | The Five Notes of Music | The Five Viscera | The Five Colors | The Five Planets | The Five Compass Points | The Four Seasons | The Five Flavors | The Five Natural Elements | The Five Vocal Divisions |\n|--------------------------|---------------------------|----------------------------|-------------------------|-----------------|----------------|------------------|------------------------|----------------|----------------|--------------------------|------------------------|\n| 坎陰玄武               | 坎陰玄武               | 坎陰玄武               | 坎陰玄武               | 坎陰玄武       | 坎陰玄武       | 坎陰玄武       | 坎陰玄武               | 坎陰玄武       | 坎陰玄武       | 坎陰玄武               | 坎陰玄武               |\n| Kam Eum Sable Warrior   | Kam Eum Sable Warrior   | Kam Eum Sable Warrior   | Kam Eum Sable Warrior   | Kam Eum Sable Warrior | Kam Eum Sable Warrior | Kam Eum Sable Warrior | Kam Eum Sable Warrior | Kam Eum Sable Warrior | Kam Eum Sable Warrior | Kam Eum Sable Warrior | Kam Eum Sable Warrior |\n| 離陽朱雀               | 離陽朱雀               | 離陽朱雀               | 離陽朱雀               | 離陽朱雀       | 離陽朱雀       | 離陽朱雀       | 離陽朱雀               | 離陽朱雀       | 離陽朱雀       | 離陽朱雀               | 離陽朱雀               |\n| Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird | Yi Yang Vermilion Bird |\n| 震少陽青龍               | 震少陽青龍               | 震少陽青龍               | 震少陽青龍               | 震少陽青龍       | 震少陽青龍       | 震少陽青龍       | 震少陽青龍               | 震少陽青龍       | 震少陽青龍       | 震少陽青龍               | 震少陽青龍               |\n| Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon | Chin Lesser Yang Blue Dragon |\n| 白陰白虎               | 白陰白虎               | 白陰白虎               | 白陰白虎               | 白陰白虎       | 白陰白虎       | 白陰白虎       | 白陰白虎               | 白陰白虎       | 白陰白虎       | 白陰白虎               | 白陰白虎               |\n| T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger | T'ai Lesser Eum White Tiger |\n| 宮脾黃土星               | 宮脾黃土星               | 宮脾黃土星               | 宮脾黃土星               | 宮脾黃土星       | 宮脾黃土星       | 宮脾黃土星       | 宮脾黃土星               | 宮脾黃土星       | 宮脾黃土星       | 宮脾黃土星               | 宮脾黃土星               |\n| Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn | Kung Stomach Yellow Saturn |\n\n-坎陰玄武: Kam Eum Sable Warrior\n-離陽朱雀: Yi Yang Vermilion Bird\n-震少陽青龍: Chin Lesser Yang Blue Dragon\n-白陰白虎: T'ai Lesser Eum White Tiger\n-宮脾黃土星: Kung Stomach Yellow Saturn\nletters only that are formed in the same way \\(a\\) — and \\(a\\) \\(\\text{T}\\).\n\nAmong the \"seal\" characters of China, however, I find eight forms —, \\(\\text{I}\\), \\(\\text{T}\\), \\(\\text{I}\\), \\(\\text{I}\\), \\(\\text{T}\\), \\(\\text{T}\\), \\(\\text{T}\\), \\(\\text{T}\\), that agree exactly with the shapes of the Vowels (see Kang-heui Dictionary).\n\nAnother matter of interest concerning the Vowels is the order in which we repeat them today \\(\\text{T}\\) \\(\\text{T}\\), \\(\\text{T}\\) \\(\\text{T}\\), \\(\\text{T}\\) \\(\\text{T}\\), — \\(\\text{I}\\) \\(\\text{I}\\). They are run off in pairs beginning at the outer rim of the circle and with the last put first \\(\\text{T}\\) \\(\\text{T}\\), next \\(\\text{T}\\) \\(\\text{T}\\), next — \\(\\text{I}\\), and finally \\(\\text{I}\\). This is significant only as it agrees again with the order as we see it displayed on Shin Kyöng-jun's Philosophic Circle.\n\nAnother fulfilled condition of Chinese Philosophy evident in the Circle is the fact that the \"doubles\" or Negative forms are all found at the top and on the West Side, \\(\\text{T}\\) \\(\\text{T}\\) \\(\\text{T}\\) \\(\\text{T}\\) in the region corresponding to the negative diagrams or places of the mother and daughters as seen in Chart VIII.\n\nWe close this section by saying that it looks reasonable to conclude that the Consonants were formed of the circle and the one stroke — and the two \\(\\text{I}\\), and the Vowels of the two strokes, the horizontal and the vertical.\n\nIV.—The Names of the Letters.\n\nOnly eight of the Korean consonants have special names. While originally any of the Initials might be used as Finals (See (*F. D. 121) (*F. D. 160) (*F. D. 178) († No Köl-tai 21) only eight are so used now, or we might say seven as \\(\\text{A}\\) takes the place of \\(\\text{C}\\), where \\(\\text{C}\\) would naturally be used as a final. These eight alone have names. They are as follows: Ki-cuk, ni-cum, chi-gcut, li-cul, mi-cum, pi-cup, si-cut, i-cung. In each case the first syllable expresses the letter's sound when used as an initial, and the second syllable its sound when used as a final. Its sound as an initial and its sound as a final coupled together constitute the name.\n\n* 龍飛御天歌\n† 老乞大\n\nWhere is there anything that corresponds to this method of\nname making? At once we are reminded of the Pan-jöl (反切) as given in the preface to Kang-heui's Dictionary, where two characters are used to express a given sound, the sound of the first character contributing to the initial portion and the sound of the second to the final. In expressing the sound *il* for example, two characters are written *Ik* and *Sil*. We take the initial sound of *Ik* which is *I* and the final sound of *Sil* which is *L*, and putting them together get *Il*. This is called the law of the Pan-jöl and we are reminded of this in the names *ki-cuk*, etc.\n\nEvidently these names were suggested not by the law of Sanscrit or Mongolian name-making but by the same Chinese principles that are evident in other parts of the work.\n\nVII.—The Writing of the Enmun.\n\nIn the writing of Sanscrit, the strokes and their order differ markedly from that of Chinese. The eight strokes of Chinese, all present in the character for eternal 永, are adhered to in the writing of the Enmun, the circle alone differing. Sanscrit reads from left to right, and not from right to left, the alignment stroke, too, is a horizontal not a vertical as in the Enmun. The method of writing the Enmun letters points altogether to China.\n\nThe method of use of the vowels is markedly different from that of Sanscrit where certain vowels are placed before the consonant after which they are sounded, certain ones over the consonant, and again certain ones underneath. Korean vowels regularly follow the consonant after which they are sounded.\n\nIn conclusion it would seem fair to say that:\n\nI Since the number of letters, 28, agrees, the consonants with the Chinese alphabet of Initials as found in Kang-huei, and the vowels with the law of the Yang and Yin about the circle;\n\nII and since the order of the consonants agrees exactly with the order in Chinese and not with the Sanscrit;\nIII and since the sounds of the letters agree with the seven notes of the Chinese gamut, even to the five full notes and the two semitones;\n\nIV and since they conform to the peculiar law of Mixed and Clear so exactly;\n\nV and since the shape of the consonants can be explained by the law of the circle and the one and two strokes, and the vowels by the first three Radicals of the character;\n\nVI and since the peculiar names of the eight letters that have names agree with the Chinese Pan-jöl;\n\nVII and since the order of strokes and manner of writing agree likewise with the Chinese, we conclude that the Alphabet came direct from China and that the laws and principles explained in the preface to the Kang-heui Dictionary are the key to its formation.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/transactionsofko41roya.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 70, "total-input-tokens": 97570, "total-output-tokens": 25177, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 398, 5], [398, 398, 6], [398, 2202, 7], [2202, 4361, 8], [4361, 6446, 9], [6446, 8630, 10], [8630, 10794, 11], [10794, 12864, 12], [12864, 15036, 13], [15036, 17243, 14], [17243, 19422, 15], [19422, 21629, 16], [21629, 23758, 17], [23758, 25579, 18], [25579, 27264, 19], [27264, 29075, 20], [29075, 29133, 21], [29133, 30794, 22], [30794, 32949, 23], [32949, 34645, 24], [34645, 34721, 25], [34721, 36502, 26], [36502, 38517, 27], [38517, 40399, 28], [40399, 42469, 29], [42469, 44448, 30], [44448, 44515, 31], [44515, 46543, 32], [46543, 47987, 33], [47987, 48197, 34], [48197, 48340, 35], [48340, 49978, 36], [49978, 51988, 37], [51988, 53844, 38], [53844, 53888, 39], [53888, 55664, 40], [55664, 57657, 41], [57657, 59651, 42], [59651, 61476, 43], [61476, 61578, 44], [61578, 63074, 45], [63074, 63224, 46], [63224, 65385, 47], [65385, 65657, 48], [65657, 66076, 49], [66076, 66541, 50], [66541, 68586, 51], [68586, 70616, 52], [70616, 70673, 53], [70673, 72787, 54], [72787, 74782, 55], [74782, 76778, 56], [76778, 78870, 57], [78870, 80020, 58], [80020, 82201, 59], [82201, 84221, 60], [84221, 86213, 61], [86213, 86279, 62], [86279, 88524, 63], [88524, 92127, 64], [92127, 94341, 65], [94341, 96216, 66], [96216, 96969, 67], [96969, 96969, 68], [96969, 96969, 69], [96969, 96969, 70]], "primary_language": ["None", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, true, true, false, false, false, false, false, false, false, false, true, false, false, false, false, true, false, false, false, false, true, false, true, false, false, true, true, false, false, true, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false]}}]