[{"id": "77113f5d0d214d2bac8aa296c353394d13f924de", "text": "Tenison-Woods\n\nMalaysian land and freshwater Mollusca\nMALAYSIAN LAND AND FRESHWATER MOLLUSCA\n\nBy the Rev. J. E. Tenison-Woods, F.G.S., F.L.S., Hon. Mem.\nRoy. As. Soc. (Straits Branch).\n\n(Plates XXVII.-XXX.)\n\nDefinition of the Region.—The species included in the following list are those indigenous to the Malay Peninsula in the states south of Keddah and the Indian Archipelago, exclusive of New Guinea. With the exception of the arbitrary line dividing the Malay Peninsula, the limits of this region form a province in natural history in the molluscan sub-kingdom. The reason for excluding New Guinea is that its fauna seems to belong more to the Pacific and Australian regions. The Philippine Islands are not included, because they form of themselves a peculiar province with very marked features, entitling them to separate consideration.\n\nThe physical geography of the Malaysian region is another reason for considering its pulmonate mollusca separately. The region consists of an immense number of islands of varying sizes, from mere barren granite rocks to continental islands like Sumatra and Borneo. All those that are of any size are densely clothed with vegetation. The climate is very hot, moist, and varies but little. Granite is the prevailing rock, with overlying palaeozoic strata and a few outliers of Devonian limestone. There are also in Borneo and Sumatra rather extensive developments of carbonaceous sandstone and a few patches of tertiary limestone. The south-east portion of the region is made up exclusively of modern volcanic rocks.\n\nIt is known that climate, vegetation, and soil have all powerful influences in the development of the land mollusca, which live on decayed leaves and vegetation, flourishing best amid moisture and\nheat. All these conditions are found pre-eminently in the region I have specified, and perhaps in no country of the world are they more favourably united for the development of terrestrial mollusca.\n\nSoil also has a remarkable influence. Some species prefer granite formations; but the predilection of land mollusca for limestone rocks is very striking. In the Malay Peninsula there is quite a number of small isolated limestone outliers in the form of hills and table-lands, mostly of a precipitous character. These are all distinguished by an abundance of genera and species of land-shells. The restricted habitat of some is most remarkable, and each patch of limestone seems to have its own species. It has been remarked by various naturalists how few means of dispersal the land-shells have, and thus it is that we find each island with its own fauna, no matter how small it is. Some of these species are peculiar and exceptional types. It must be admitted, however, that some types are very wide-spread, such for instance, as the forms of which *Helix citrina* L., and *Bulimus perversus* L., are the types.\n\nIt is highly probable that we have in the Malay Peninsula and its islands the remains of a very ancient continent. None of the younger formations have any place except in Sumatra and Borneo. At any rate there are no rocks which would justify the supposition that the region has been completely submerged within modern geological times. For these reasons, therefore, we have in the molluscan sub-kingdom a fauna of great antiquity. The circumstances also favour the restriction of species, because the land is so broken up into islands. Thus specific peculiarities become propagated and restricted. It may be said, in keeping with this, that though the species or varieties of the region are very numerous, yet the types are comparatively few. I take here the opportunity of noting that though I give a list of all the species enumerated by various authors known to me, I am very far from endorsing their views as to the value of the specific distinctions in any case. Probably the number of species, and even the genera, will admit of extensive reduction hereafter. In\nlooking through a large collection with every gradation of shape and colour between one species and another, one cannot help being struck with the slender evidence on which some species rest. One is inclined to say that the species are comparatively few, but the variations are great in extent and endless in number.\n\nNevertheless, there are certain peculiar genera which stamp a character on the region, besides certain abnormal species. The facies of the region is Indian. All traces of African influences have disappeared. There is no Achatina, few Pupas, whilst Cyclostoma is beginning to take a subordinate place. Amongst the Cyclophoridae we find peculiar though wide-spread types; and amongst the Helicidae unmistakable uniformity. The individuals have all marked characters, so that a small amount of experience suffices to enable us to tell at a glance whether any individual shell is a member of the Malayan fauna.\n\nThere are in the region we are dealing with about 380 known species or varieties of land-shells divisible into the following genera:—Streptaxis, Ennea, Vitrina, Helicarion, Nanina, Trochonanina, Hyalinia, Trochomorpha, Patula, Helix, Cochlostyla, Bulimus, Bulimina, Stenogyra, Rhodina, Glessula, Pupa, Hypselostoma, Clausilia, Cyclotus, Opisthoporus, Pterocyclos, Spiraculum, Cyclophorus, Leptopoma, Alycaeus, Diplommatina, Opisthostoma, Pupina, Megalomastoma, Hybocystis, Georissa. Of these the dominant genera are Nanina, Helix, Cyclophorus, Bulimus, and Clausilia. And this is the case in the Indian fauna. There is in fact the strongest resemblance between the relative proportion of certain genera in the two provinces; the difference being the complete disappearance from the Malayan Peninsula of Achatina and some other African genera. The large predominance of forms of Helix resembles India almost to the very number of species. The peculiar form of Vitrina distinguished as Nanina, but with slender claims to a generic position, is a feature shared by Ceylon, and to some extent by the Philippine Islands. Nanina is a thin, depressed, umbilicated shell, with a keel at the periphery, highly polished and with a tendency to bi-partite colouring.\nSome of the peculiar genera of this region have extraordinary organs which are not seen elsewhere. Thus *Opisthoporus* is a depressed shell furnished with a little open tube behind the mouth. *Pterocyclos* has an almost similar tube formed by a notch in the peristome at its junction with the superior whorl, an arrangement which is slightly modified in an allied genus named *Spiraculum*. *Alyceus* has the last whorl swollen, constricted and strongly twisted near the mouth. All these species have peculiar opercula composed of a calcareous spiral series of concentric plates. In the family Pupininae there are the strongest modifications of the last whorl which becomes twisted and constricted in the most erratic manner. In *Opisthostoma* it is elevated vertically in the air like an elephant's trunk. In *Hybocystis* we have a very peculiar form of land-shell, of which a full description is given at the end of the list. It is an approach to *Megalomastoma*, and may be said to be confined to Burmah and the Malay Peninsula.\n\nAs the limits of the region here dealt with are so little explored, no such things as sub-provinces can be made, unless it be in the way of considering each island a sub-province in itself. It is obvious to any one who considers the size and extent of any of the islands, that only a very small portion of them can have been well explored for their molluscan fauna. The total number of known species or varieties, amounting as it does to scarcely 400, can only be considered as an instalment of the actual census. The large island of Borneo alone might be expected to furnish such a number, when we remember how the climate, soil, and vegetation of this region favour the development of the molluscan fauna. Yet the species of Borneo can scarcely be said to be known at all.\n\nIn dealing with the genera and species of the various authors, it has already been stated that the specific or generic value in any individual case is a matter for which the authors themselves are alone responsible. Yet it must be borne in mind that the difficulty of dealing with some of the larger genera renders sub-division of some kind absolutely necessary. Thus in the immense genus\nHelix it is no use to catalogue species without adopting sectional divisions, which has been done in the present list. It must be admitted that they are not easy to identify, as the features are so feeble, and there is so little to go upon. Still the sections may be of some assistance, and they are meant to have no higher value in classification.\n\nWith the genera it is different, and except in such a case as Nanina the divisions are well marked, and can hardly be mistaken one for another. In the smaller genera the features are very pronounced, that is genera small in point of numbers, not of size. I believe it may further be said that all the species of the genera Trochomorpha, Bulimus, Cyclotus, Cyclophorus and Alycaeus, though perhaps not well distinguished from one another, are referable to a type which has certain well-defined geographical limits. With a little experience a species of Cyclophorus, for instance from the Malayan Peninsula, could be easily recognized as belonging to the region; but it would require a prolonged familiarity to distinguish between the characteristic types of the various islands, as for instance Java and Sumatra. The Bornean shells are easily recognized, though there are strong resemblances to the types of the Philippine Islands.\n\nAmongst the shells enumerated there is no foreign element. No molluscan animals, as far as it is known, have been introduced from foreign regions, and become naturalized in the region now described; but the large introduction of European and Chinese plants will alter this state of things before long, if it has not done so already.\n\nThe following list has been taken from various sources. No special study has ever been made of the land mollusca of the Malayan Archipelago. But owing to the labours of Pfeiffer and Albers, the task of compiling this list has been very much facilitated. The whole references in the case of every species have not been given. As far as possible the references are made to three or four of the most easily accessible works, where more than one author has given a description. The work of Pfeiffer\n(\"Monographia Heliceorum Viventium,\" 8 vols.), is taken as the standard, but corrected according to his most recent determinations of species before his decease as contained in \"Nomenclator Heliceorum Viventium.\" These works with his \"Monographia Pneumonopomorum Viventium,\" may be said to contain nearly all that has been done in this department of natural science. All that one requires in addition are the essays of Nevill, Benson, De Morgan, von Möllendorff and Hungerford, and these are principally contained in the Journal of the Royal Asiatic Society, Calcutta branch.\n\nTo facilitate reference, a catalogue of works, mentioning species quoted in the list, is given. It is not by any means intended as an exhaustive bibliography of the subject, but it is hoped that no author is omitted who has described any Malayan land shell. It may be necessary to add that I have not been able to verify the references of every species, which of course would impose a vast amount of labour, and enormously increase the time required for the preparation of the catalogue. But in a great many instances, perhaps the majority, I have consulted the original authors especially in the case of the older conchologists.\n\nIt should be mentioned that Pfeiffer's nomenclature of the families has been adopted, following also his orthography.\n\nLAND MOLLUSCA.\n\nFamily STREPTAXIDÆ.\n\n1. Streptaxis, Gray, 1837, Loudon's Magazine, n.s. I. p. 484.\n\nShell oval or oblong, in the young state sub-hemispherical, deeply umbilicate, irregular and oblique from the lower whorls which rapidly increase in size, receding from the axis of the upper. Near the close of the penultimate whorl the umbilicus is compressed by a return to the original axis.\nAnimal heliciform and like the genus *Anostoma*.\n\nMr. Gray established this genus for species manifesting a twist in the axis, or an irregular deviation in the disposition of the whorls, causing an unsymmetrical spiral. He divides them into many groups amongst which he includes a species of *Pupa*.\n\n**STREPTAXIS CONOIDEUS**, Pfr. Mon. Hel. IV. p. 329.\n\nKeddah State, Malay Peninsula.\n\n*S. plussensis*, De Morgan, Le Naturaliste, VII. 1885, No. 9, p. 68; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 299.\n\nMt. Chekel, River Plus, Perak, Malay Peninsula.\n\n*S. michaui (Ennea)*, Crosse and Fischer, Jour. Conch. 1863, pl. 10, fig. 4, p. 357.\n\nPulo Condor, Gulf of Siam, between east side of Malay Peninsula and Cambodia.\n\n*S. bulbulus (Ennea)*, Morelet, Jour. Conch. 1863, pl. 10, fig. 3.\n\nPulo Condor.\n\n2. **Ennea**, H. and A. Adams, Gen. Rec. Moll. II. p. 171.\n\nShell slightly rimate, sub-cylindrical; apex obtuse, smooth, shining, hyaline; whorls flattened, the last narrow, sulcated externally in the middle, lamellate within, with a strong plait parallel to the columella; aperture sub-circular; parietal lamella extending inwards and situated close to the right margin; peristome expanded, the right margin flexuous, thickened in the middle.\n\n**Ennea perakensis**, Godwin-Austen and Nevill, Proc. Zool. Soc. 1879, p. 735, pl. 59, fig. 2; von Möll. Jour. As. Soc. Beng. l.c. p. 300.\n\nBukit Pondok, Gapis Pass, Perak.\n\n(N.B.—This is one of the places referred to where Bukit Pondok is spelled Buket Pondong).\nE. HUNGERFORDIANA, von Möll. Jour. As. Soc. Bengal, l.c. p. 301.\n\nBukit Pondok, Perak.\n\nFamily VITRINEA.\n\n3. VITRINA, Draparnaud, 1801. Tabl. pp. 33, 98.\n\nShell dextral, depressed or sub-globose, very thin, pellucid, with a very large last whorl; no umbilicus, columella spiral; aperture large, oblique semi-lunar, without teeth; peristome thin, acute, not continuous.\n\nAnimal long, like a slug, and too large for the shell, tail very short; mantle reflected over the shell-margin with posterior right lobe; radula 100 rows of 75; marginal teeth with a single long curved apex.\n\nVITRINA NUCLEOLA, Stol. Jour. As. Soc. Beng. XL. pl. 4, fig. 12; Pfr. Nomencl. Hel. Viv. p. 28, No. 45.\n\nPenang; Prince of Wales Island; Straits of Malacca.\n\n4. HELICARION, Féussac, (1821), Tabl. Syst. des Animaux Mollusques, p. XXXI. and Voy. de Freycinet.\n\nShell heliciform, round oval, thin, fragile, covered with a very thin periostraca, spire short, whorls few, the last much enlarged, oblong triangular; peristome simple, acute.\n\nAnimal like Vitrina, but the foot is truncate at its posterior extremity, with a caudal gland like Arion.\n\nHELICARION PERMOLLIS, Stol. (as Vitrina) Jour. As. Soc. Beng. XLII. pl. 1, fig. 11. = Vitrina permollis, Pfr. Mon. Hel. VII. p. 10.\n\nPenang.\n\nH. BORNEENSIS (VITRINA), Pfr. Mon. Hel. IV. p. 793; Nov. Conch. I. pl. 28, figs. 10-12.\n\nBorneo.\nA specimen of this shell was seen by me in the collection at Government House, Labuan, but no locality noted.\n\nH. idæ (Vitrina), Pfr. Mon. Hel. IV. p. 793; Nov. Conch. I. pl. 28, figs. 13-15.\n\nCelebes.\n\n\"One of Pfeiffer's figures shows a narrow orange-brown band, which is not mentioned in the description.\" Tryon, Man. Conch. I. p. 178. Collected in Celebes by Ida Pfeiffer, the celebrated female traveller. Proc. Zool. Soc. 1856, p. 325.\n\nH. celebensis (Vitrina), Pfr. Proc. Zool. Soc. 1856, p. 325; Nov. Conch. I. p. 101, No. 172, pl. 28, figs. 16-18.\n\nAlso collected in Celebes by Madame Ida Pfeiffer; Pfr. Mon. Hel. IV. p. 793, where the author doubts whether the species should not be referred to the genus *Helix*.\n\nH. suturalis, von Martens (Helicarion), Ostas. Zool. II. 1867, p. 183, pl. 12, fig. 2; pl. 5, fig. 9, a, b, c: Pfr. Mon. Hel. V. p. 17 (Vitrina).\n\nIsland of Buru, Moluccas.\n\nSub-globose, very plainly striate at the suture; yellowish-green, with an opaque white zone.\n\nH. lineolatus, von Mart. op. cit. p. 184, pl. 12, fig. 4; Pfr. Mon. Hel. V. p. 17, No. 56.\n\nJava; Sumatra.\n\nH. sericeus, von Mart. op. cit. p. 185, pl. 12, fig. 1; (Vitrina), Pfr. Mon. Hel. V. p. 18.\n\nIsland of Timor.\n\nH. albellus, von Mart. op. cit. p. 186. = *Helix wonosariensis*, Mousson, in coll. = Vitrina albella, Pfr. Mon. Hel. V. p. 18.\n\nEastern Java, Wonosari. I collected a specimen on the lower slopes of Mount Tengger.\nFamily VITRINOIDEA.\n\n5. Nanina, Gray, 1834; Pfr. Sym. I. p. 5, No. 3.\n\nShell heliciform, perforated, dextral or sinistral, somewhat depressed, thin, polished, particularly below; periphery round or keeled, inner lip short, reflected, often covering the umbilicus; outer lip simple or scarcely reflected.\n\nAnimal with two mantle-lobes covering part of front of shell; foot long, narrow, truncate behind, with a pore like a slit, sometimes with a projection like a horn; mantle-lobes with power to expand and retract laterally. Over 500 species; tropical and sub-tropical Africa, Asia, and Oceanica.\n\nN. viridis, Quoy and Gaimard, (as Vitrina), Voy. Astrol. II. p. 138, pl. 11, figs. 16-18; Lamarck, Deshayes edit. VII. p. 730, No. 7; H. Beck, Index II. p. 4; = Helix viridis, Pfr. Mon. Hel. I. p. 82.\n\nIsland of Celebes in the mountains near Menado, is the reference given by Q. and G. This part of Celebes, it will be remembered, is the only active volcanic portion.\n\nN. lowi, Issel, = Hyalina (?) lowi, Issel, Moll. Born. p. 38, pl. 5, figs. 16-18; = Helix lowi (Hyalina?), Pfr. Mon. Hel. VII. p. 523.\n\nSarawak, Borneo.\n\nN. tersa, Issel, (Macrochlamys), Moll. Born. p. 36, pl. 5, figs. 1-4 = Helix (Nanina) tersa, Pfr. Mon. Hel. VII. p. 525 = Nanina tensa, Pfr. Nomencl. Hel. p. 37, No. 222a.\n\nBorneo.\n\nN. perlucida, Issel, (Hyalina?), Moll. Born. p. 39, pl. 5, figs. 20-23 = Helix perlucida, Pfr. Mon. Hel. VII. p. 526.\n\nBintulu, Sarawak, Borneo.\n\nN. macdougalli, Issel, Moll. Born. p. 37, pl. 5, figs. 9-12 = Helix macdougalli, Pfr. Mon. Hel. VII. p. 526.\n\nSarawak, Borneo.\nN. palmicola, Stol. = Microcystis palmicola, Stol. Jour. As. Soc. Beng. XLII. 1873, p. 18, pl. 1, fig. 10 = Helix palmicola, Pfr. Mon. Hel. VII. p. 100.\n\nPenang; in cocoa-nut trees.\n\nN. castanea, Müller, = Helix castanea, Müll. Hist. Verm. II. p. 67, No. 262; Chemnitz, IX. pt. II. p. 135, pl. 131, figs. 1177-78, = Nanina castanea, Beck, Index p. 4 = Helix castanea, Pfr. Mon. Hel. I. p. 44.\n\nSumatra.\n\nN. vitellus, Shuttleworth, in Cuming's list = Chemnitz, 2nd edit. Helix, No. 957, pl. 145, fig. 14 = H. vitellus, Pfr. Mon. Hel. III. p. 44, where it is thought possibly to be a variety of H. citrina, L. so commonly distributed throughout the Archipelago.\n\nThis specimen was found in Amboyna by Cuming. Celebes.\n\nN. nemorensis, Müll. Hist. Verm. II. in Index and quoted under the same name by Chemnitz, 2nd edit. Helix, No. 183, pl. 35, figs. 9-11 = Féruccac, Hist. Nat. Moll. pr. 232, as Helicella = Helix nemoralis, Müll. op. cit. II. p. 62, No. 257 = H. cretacea, Born, Mus. p. 376, pl. 16, figs. 1-2; Chemnitz, IX. pt. II. p. 119, pl. 129, figs. 1146-47; neuvardii, De Haan in Menke's Synopsis = Nanina nemorensis, Gray, Proc. Zool. Soc. 1834, p. 59; also Beck, Index, p. 4. = Helix nemorensis, Pfr. Mon. Hel. I. p. 46.\n\nMoluccas and New Ireland.\n\nThis shell was once to be found in all the old Museums in Europe.\n\nN. brotii, Bonnet, = Helix brotii, Bonnet, Rev. et Mag. Zool. XVI. 1864, p. 67, pl. 5, fig. 1; Pfr. Mon. Hel. V. p. 466. Pfr. doubts whether this specimen is really distinct from H. nemorensis, and whether it is really indigenous to Borneo.\n\nN. bimaensis, Mousson, Moll. Java, p. 111, pl. 21, fig. 1 = Hemiplecta bimaënsis, Albers, Heliceen, p. 60 = Helix bimaënsis, Pfr. Mon. Hel. III. p. 45 = Nanina limaënsis, Adams, Genera, Moll. II. p. 223.\n\nIn jungles, Bimah; Sumbawa.\nN. ovivitellus, Reeve, = Helix ovivitellus, Reeve, Conch. Icon. No. 1425, pl. 202; Pfr. Mon. Hel. IV. p. 22.\n\nAmboyna.\n\nN. halata, Mouss. Moll. Java, p. 112, pl. 21, fig. 2 = Hemiplecta halata, Albers, Heliceen, p. 60 = Helix halata, Pfr. in Chemn. 2nd edit. Helix, No. 929, pl. 142, figs. 9-10; (Nanina), Pfr. Mon. Hel. III. p. 45.\n\nDompo, Java.\n\nN. rareguttata, Mouss. Moll. Java p. 112, pl. 21, fig. 3 = Helix rareguttata, Pfr. Mon. Hel. III. p. 46.\n\nBimah; Sumbawa.\n\nN. sparsa, Mouss. Jour. Conch. VI. 1857, p. 155, pl. 6, fig. 4 = Helix sparsa (Nanina), Pfr. Mon. Hel. IV. p. 343.\n\nIsland of Bali.\n\nN. coffeea, Pfr. = Helix coffeea, Pfr. Proc. Zool. Soc. 1855, p. 111 = Nanina (Xesta) coffeea, Pfr. Versuch. p. 119 = Helix coffeea, Pfr. Mon. Hel. IV. p. 23.\n\nMoluccas and Island of Lombok.\n\nN. crespignyi, Higgins, = N. decrespignii (Xesta), Higgins, Proc. Zool. Soc. 1868, p. 179, pl. 14, fig. 4 = N. decrepignyi (Xesta), Paetel, Catal. p. 84 = Helix crespignyi, Pfr. Mon. Hel. VII. p. 80.\n\nIsland of Labuan.\n\nN. trochus, Müll. = Helix trochus, Müll. Verm. II. p. 79, No. 275; Chemn. 2nd edit. Helix, No. 127, pl. 21, figs. 13-14 = Trochus hortensis, Chemn. IX. pt. II. p. 52, pl. 122, figs. 1055-56 = Nanina trochus, Beck, Index p. 4 = N. circumdata, von Martens = var. Helix sulphurea, Reeve = H. circumpieta, Mousson = H. colorata, Mousson = Nanina (Hemiplecta) circumpieta, Paetel, Catal. p. 84 = Helix trochus, Pfr. Mon. Hel. I. p. 46; III. p. 46; VII. p. 80. Also, Zeitschrift für Malak. 1851, and Chemn. Ed. Nov. Helix I. p. 160, pl. 146, figs. 3-5.\nAn imperforate trochiform conical shell with an obtuse vertex; white with a broad red band, which is wanting inside, about an inch high and 10 lines in diameter. This shell is said in one place to come from Macassar, and in another from the East Indies; but it is evidently a common widespread species, well-known to many earlier conchologists.\n\nN. cidaris, Lamarck, = Helix cidaris, Lamarck, Hist.d. animaux, 43, p. 77; Deshayes' edit. p. 45 = H. cidaris, Delessert, Rec. de Coq. pl. 26, fig. 11; = Nanina rapa, Beck, Index, p. 3; = Helix cidaris, Pfr. Mon. Hel. I. p. 45.\n\nTimor.\n\nN. glutinosa, Metcalfe, = Helix glutinosa, Metcalfe, Proc. Zool. Soc. 1851; Pfr. Mon. Hel. III. p. 54.\n\nBorneo.\n\nN. citrina, L. - Helix citrina, L. Syst. Nat. 10th edit p. 771; 12th edit. No. 679, p. 1245.\n\nThis widely distributed and well-known shell has been described by all the ancient conchologists as far back as Lister, and, strange to say, for a species which varies a good deal, has not many synonyms. It is an umbilicate shell, orbicularly convex, with an obtuse spire; yellowish with a brown band, or with a white band or two, or a purple band joined to a white one; with varieties in which the band is red, yellow, white, blackish, and even yellowish-green. This band of colour seems to divide the shell into an upper and lower portion. There are excellent figures of the animal in the \"Voyage de l'Astrolabe,\" pl. 11, figs. 1-4.\n\nIt is very common through the islands of the whole Archipelago and the Malay Peninsula.\n\nN. coagulata, Pfr. = Helix coagulata, Pfr. Proc. Zool. Soc. 1856, p. 32; Mon. Hel. IV. p. 41.\n\nAmboyna.\n\nN. luctuosa, Beck, Index, p. 3 = Helix citrina, var. of Müller, Chemn. and Pfr. Mon. Hel. I. p. 53.\nThis is a common shell like the last, and is subject to similar variations in colouring, which divide into three principal forms. Var. A: chestnut above, white below, divided at the periphery by a broad white band; umbilicus, chestnut brown. This variety is figured by Chemn. (Helix, fig. 1174). Var. B: greyish above with a brownish median (Chemn. fig. 1175). Var. C: white with a blackish-brown band. Regarded by some as quite distinct from *N. citrina*.\n\nMoluccas, Malay Peninsula, &c.\n\n*N. fulvizona*, Mousson, in coll.; von Martens, Ostas. Zool. II. p. 201 = *Helix fulvizona*, Pfr. Mon. Hel. V. p. 96.\n\nThis is a most variable shell with regard to its colouring. Ten different varieties are enumerated by Pfr., the type approaching somewhat to *Helix citrina*, L.\n\nCelebes.\n\n*N. parcipila*, von Martens, in Monat. Akademie Berlin, 18th April, 1864, p. 264; (*Xesta*) Ostas. Zool. II. p. 192, pl. 9, fig. 1 = *Helix parcipila*, Pfr. Mon. Hel. V. p. 119.\n\nAdenare Islands, Moluccas.\n\n*N. ignescens*, Pfr. = *Helix ignescens*, Pfr. Proc. Zool. Soc. 1861, p. 20, pl. 2, fig. 1 = *Nanina ignescens*, Wallace, Proc. Zool. Soc. 1865, p. 406; (*Xesta*) von Martens, Ostas. Zool. II. p. 192, pl. 9, fig. 2 = *Helix ignescens*, Pfr. Mon. Hel. V. p. 98.\n\nBatchian Island, Moluccas.\n\n*N. monozonalis*, Lamarck, = *N. monozalis*, Pfr. Nomen. Hel. p. 40, No. 582 = *Helix monozonalis*, Lamarck, Hist. Nat. 1st edit. IV. p. 66, Desh. edit. p. 29 = *Helix unizonalis*, Desh. Encycl. Meth. pl. 462, fig. 6 = *Helicella unizonalis*, Fér. pr. 241, Hist. pl. 91, fig. 4 = *Nanina monozonalis*, Gray, Proc. Zool. Soc. 1834, p. 59 = *Zonites unizonalis*, Swainson, Malac. p. 331 = *Helix monozonalis*, Pfr. Mon. Hel. I. p. 72.\n\nSwainson regards this shell as a mere variety of *N. citrina*.\n\nAmboyna.\nN. obliquata, Reeve, = Helix obliquata, Reeve, Conch. Icon. pl. 74, sp. 384 = H. citrina, var. Chemn. 2nd edit. pl. 24, figs. 1-2; = Nanina teysmanni, Mousson, in coll. = N. obliquata, von Mart. Ostas. Zool. II. p. 235 = Helix obliquata, Pfr. Mon. Hel. V. p. 115.\n\nSumatra; Borneo?\n\nN. naninoides, Benson, = Helix naninoides, Benson, Ann. and Mag. Nat. Hist. IX. 1842, p. 486; Phil. Icon. II. 9, p. 2, pl. 6, fig. 3; Chemn. 2nd edit. Helix, No. 158, pl. 25, figs. 7-8; Pfr. Mon. Hel. I. p. 70.\n\nThis species varies in having distinct concentric striæ or being without them. Colour brownish or nearly white; periphery more or less distinctly keeled.\n\nSingapore; Chusan.\n\nN. umbilicaria, Leguillou, = Helix umbilicaria, Leguillou, Rev. Zool. 1842, p. 137; Chemn. 2nd edit. Helix, No. 63, pl. 11, figs. 14-15; Pfr. Mon. Hel. I. p. 64, V. p. 123.\n\nDiffers from the following in being a more solid shell, opaque, and smoother.\n\nSumatra; Banka; Java.\n\nN. desgrazii, Homb. et Jacq. = Helix desgrazii, Homb. et Jacq. Voy. Pole Sud, Zool. V. p. 12, pl. 5, figs. 4-6; Pfr. Mon. Hel. IV. p. 42.\n\nSumatra.\n\nN. javanica, Lamarck, = Helix javanica, Lamarck, 1st edit. p. 76; 2nd edit. p. 45; Chemn. 2nd edit. Helix, No. 62, pl. 11, figs. 12-13 = Helicella javanensis, Fér. pr. 234; Hist. pl. 92, fig. 2 = Nanina javanensis, Gray, Proc. Zool. Soc. 1834, p. 59 = N. javana, Beck, Index, p. 4 = Helix javanica, Pfr. Mon. Hel. I. p. 64.\n\nVery close to Nanina naninoides.\n\nJava.\nN. INDUTA, Pfr. = Helix induta, Pfr. Proc. Zool. Soc. 1845, p. 128; Mon. Hel. I. p. 79 = Nanina induta, Gray = N. bataviana [junior (?)], von Martens.\n\nJava.\n\nN. CONVOLUTA, Deshayes, = Helix convoluta, Deshayes, Fé. Hist. I. p. 401, No. 255 bis, pl. 87, fig. 2; Pfr. Mon. Hel. III. p. 48 = Nanina convoluta, Gray.\n\nSumatra.\n\nN. CUTTERI, H. Adams, = Macrochlamys cutteri, H. Adams, Proc. Zool. Soc. 1870, p. 794, pl. 48, fig. 21 = Helix cutteri, (Macrochlamys), Pfr. Mon. Hel. VII. p. 80.\n\nBusan, near Sarawak, Borneo.\n\nN. AUREA, von Martens, = N. (Orobia) aurea, v. Mart. Monatsber. Berl. Ak. Ap. 18th, 1864, p. 266; Ostas. Zool. II. p. 243, pl. 12, fig. 12; Pfr. Mon. Hel. V. p. 67.\n\nKepahiang, Sumatra.\n\nN. CONSUL, Pfr. = Helix consul, Pfr. Proc. Zool. Soc. 1854, p. 289; Reeve, Conch. Icon. Helix, No. 1395, pl. 198 = Nanina (Xesta) consul, Pfr. Vers. p. 120 = Helix consul, Pfr. Mon. Hel. IV. p. 44.\n\nSarawak, Borneo.\n\nN. CINNAMOMEA, Valenc. = Helix cinnamomea, Valenc. Museum, Paris; Reeve, Conch. Icon. No. 442, pl. 83 (?) = Nanina cinnamomea, Albers, Heliceen; Gray, Catal. Pulmon. p. 93; H. and A. Adams, Gen. II. p. 22 = Xesta cinnamomea, Pfr. Vers. p. 120 = Helix cinnamomea, Pfr. Mon. Hel. I. p. 54, III. p. 62, IV. p. 42.\n\nPenang.\n\nN. JUCUNDA, Pfr. = Helix jucunda, Pfr. Proc. Zool. Soc. 1863, p. 524; Novit. Conch. p. 307, No. 419, pl. 74, figs. 13-14 = Nanina jucunda (Macrochlamys), von Martens, Ostas. Zool. II. p. 240, pl. 12, fig. 7 = Helix jucunda, Pfr. Mon. Hel. V. p. 101.\n\nCollected in the island of Labuan by Sir Hugh Low.\nN. fulvo-carnea, von Martens, in Monatsber. Ak. Berlin, 18th April, 1864, p. 266 (Orobia) = Macrochlamys fulvo-carnea, v. Mart. Ostas. Zool. II. p. 242, pl. 12, fig. 8 = Helix fulvo-carnea, Pfr. Mon. Hel. V. p. 101.\n\nMenado, Celebes.\n\nN. malaccana, Pfr. = Helix malaccana, Pfr. Proc. Zool. Soc. 1854, p. 147; Reeve, Conch. Icon. Helix No. 1373, pl. 195 = Nanina malaccana (Xesta), Pfr. Vers. p. 120 = Helix malaccana, Pfr. Mon. Hel. IV. p. 45.\n\nKedah, Malay Peninsula.\n\nN. aglaja, Pfr. = Helix aglaja, Pfr. Proc. Zool. Soc. 1854, p. 289; Reeve, Conch. Icon. Helix No. 1396, pl. 199 = Nanina aglaja (Xesta), Pfr. Vers. p. 120 = Helix aglaja, Pfr. Mon. Hel. IV. p. 46.\n\nSarawak, Borneo.\n\nN. stephoides, Stol. = Macrochlamys stephoides, Stol. Jour. As. Soc. Beng. XLII. 1873, p. 17, pl. 1, fig. 9 = Helix stephoides (Macrochlamys), Pfr. Mon. Hel. VII. p. 109.\n\nPenang Hill.\n\nN. infans, Pfr. = Helix infans, Pfr. Proc. Zool. Soc. 1854, p. 290; Reeve, Conch. Icon. Helix No. 1417, pl. 201; (Microcystis) Pfr. Vers. p. 123; Mon. Hel. IV. p. 51.\n\nLabuan and Sarawak, Borneo. It also occurs in Java, where it was named Helix adnata by Mousson.\n\nN. clairvillea, Fér. = Helix clairevillea (Helicella), Fér. pr. 243, Hist. pl. 91, fig. 1 = Nanina clairevillea, Gray, Proc. Zool. Soc. 1834, p. 59; Beck, Index, p. 3 = Helix clairevillea, Pfr. Mon. Hel. I. p. 43.\n\nAmboyna.\n\nN. waandersiana, Zollinger; Mousson, Jour. Conch. VI. 1857, p. 154, pl. 6, fig. 1 = Helix waandersiana (Nanina), Pfr. Mon. Hel. IV. p. 345.\n\nIsland of Bali.\nN. BALIENSIS, Mousson, Jour. Conch. VI. 1857, p. 155. pl. 6, fig. 6 = Helix baliensis (Nanina), Pfr. Mon. Hel. IV. p. 345.\n\nDiambrana, Bali.\n\nN. INQUINATA, v.d. Busch, = Helix inquinata, v.d. Busch, in Phil. Icon. I. 1, p. 10, pl. 1, fig. 4; Chemn. 2nd edit. Helix No. 169, pl. 31, figs. 5-6; Pfr. Mon. Hel. I. p. 46.\n\nJava.\n\nN. SEMISULPTA, von Martens, Malak. Bl. XX. 1872, p. 167; Pfr. Novit. Conch. IV. p. 123, No. 826, pl. 128, fig. 6 = Helix semisculpta (Nanina), Pfr. Mon. Hel. VII. p. 87.\n\nCelebes.\n\nN. CINCTA, Lea, = Helix cincta, Lea, Obs. I. p. 168, pl. 19, fig. 68; Pfr. Mon. Hel. I. p. 54.\n\nIn the figure the columellar margin of the peristome appears thickened and dilated; = Nanina steursii, Shuttlew. = N. contristata, Mousson.\n\nJava.\n\nN. HUMPHREYSIANA, Lea, = Helix humphreysiana, Lea, Trans. Amer. Phil. Soc. VII, p. 463, pl. 12, fig. 16; Chemn. 2nd edit. Helix No. 168, pl. 31, figs. 3-4; Fév. Hist. XXXIV. pl. 2, fig. 7; von Martens, Ostas. pl. 10, fig. 4.\n\nThis shell seems somewhat widely distributed, since it is recorded from Pondicherry, Singapore, and Sumatra. It is an orbiculately conical shell, convex below, rugulosely granular, yellowish brown with a chestnut band at the periphery; spire somewhat elevated and acute, whorls six to seven, aperture oblique, simple acute, diam. maj. 53, min. 47, alt. 33 mill. Pfr. Mon. Hel. I. p. 43.\n\nN. CORROSA, Mousson, Jour. Conch. VI. 1857, p. 156 = Helix corrosa (Nanina), Pfr. Mon. Hel. IV. p. 348.\n\nJava.\nN. nobilis, Pfr. = Helix nobilis, Pfr. Proc. Zool. Soc. 1849, p. 127; Chemn. 2nd edit. Helix No. 771, pl. 125, figs. 1-2; Pfr. Mon. Hel. III. p. 69.\n\nBorneo; var. in Philippines.\n\nN. arguta, Pfr. = Helix arguta, Pfr. Proc. Zool. Soc. 1856, p. 327; Pfr. Mon. Hel. IV. p. 61.\n\nTengger Hills, Java (written Teuga Hills in Pfr.).\n\nN. herklotsiana, Dohrn, Malak. Bl. VI. 1859, p. 206 = Helix herklotsiana, Pfr. Mon. Hel. V. p. 121.\n\nJava.\n\nN. bataviana, v. d. Busch, = Helix bataviana, v. d. B. in Phil. Icon. I. 1, p. 9, pl. 1, fig. 3; Chemn. 2nd edit. Helix No. 58, pl. 11, figs. 1-3; Pfr. Mon. Hel. I. p. 77.\n\nJava.\n\nN. souleyetiana, Pfr. = Helix souleyetiana, Pfr. in Proc. Zool. Soc. 1851; Chemn. 2nd edit. Helix No. 950, pl. 144, figs. 16-17; Pfr. Mon. Hel. III. p. 74. (N.B.—The reference is erroneously given as 73 in Pfr. Nomen. Hel. Viv.).\n\nBorneo.\n\nN. donovani, Pfr. = Helix donovani, Pfr. in Zeitschr. f. Malak. 1851, p. 26; Chemn. 2nd edit. Helix No. 967, pl. 147, figs. 8-9; Pfr. Mon. Hel. III. p. 75.\n\nBorneo.\n\nN. centralis, Mouss. Moll. Java, p. 17, pl. 2, fig. 1 = N. (Hemiplecta) centralis, Albers, Heliceen, p. 60 = Helix centralis (Nanina), Pfr. Mon. Hel. III. p. 78.\n\nJava.\n\nN. menadensis, Mousson, Jour. Conch. VI. 1857, p. 157 = Helix menadensis, Pfr. Mon. Hel. IV. p. 345.\n\nMenado, Celebes.\nN. RIEDELI, von Martens, Monatsber. Ak. Berlin, 18th April, 1864, p. 264; Ostas. Zool. II. p. 213, pl. 8, fig. 5 = Helix riedelii, Pfr. Mon. Hel. V. p. 131 = H. securiformis, Mousson, not Deshayes = Cochlostyla riedelii, Paetel.\n\nMenado, Celebes.\n\nN. CYMATIUM, Benson, = Helix cymatium, Benson, MS; Pfr. Novit. Conch. I. p. 58, No. 95, pl. 17, figs. 1-2 = Nanina cymatium (Hemiplecta), Pfr. Vers. p. 121 = Helix cymatium, Pfr. Mon. Hel. IV. p. 109.\n\nLancavi Island, Straits of Malacca; Penang and Perak, Malay Peninsula.\n\nN. CHEVALIERII, Souleyet, = Helix chevalierii, Soul. in Revue Zool. 1842, p. 101; Voy. Bonite II. p. 504, Atlas, pl. 28, figs. 24-26; Pfr. Mon. Hel. I. p. 120 = Nanina chevalierii, Albers, Heliceen.\n\nThe only locality given in the \"Voyage de la Bonite\" is Peninsula of Malacca.\n\nN. SCHUMACHERIANA (Helix), Pfr. = Helix densa, Adams and Reeve, Voy. of Samarang, Moll. p. 62, pl. 16, fig. 8; Chemn. 2nd edit. Helix No. 954, pl. 145, figs. 5-7 = H. schumacheriana, Pfr. Zeitschr. fr. Malak. 1850, p. 70 = H. densa, Pfr. Mon. Hel. III. p. 111.\n\nPhilippines; Borneo.\n\nN. CELEBENSIS, Pfr. = Helix celebensis, Pfr. Jour. Conch. X. 1862, p. 229, pl. 10, fig. 8; Sowerby, Jour. Conch. XV. 1867, p. 111 (Char. emend.); Pfr. Mon. Hel. V. p. 71.\n\nRhwo (Rhio?) Island, Celebes.\n\nN. VIRENS, von Martens, Ostas. Zool. II. p. 237 = ? Helix tumens, Pfr. Mon. Hel. III. p. 43; Reeve, Conch. Icon. fig. 477 (also cited for H. cidaride) = Nanina virens, von Martens, Ostas. Zool. II. p. 237 = Helix virens, Pfr. Mon. Hel. V. p. 73.\n\nSumatra.\nN. WALLACEI, Pfr. = Helix wallacei, Pfr. Proc. Zool. Soc. 1858, p. 20, pl. 40, fig. 5; Chemn. pl. 164, figs. 13-15; Pfr. Mon. Hel. V. p. 96 = Nanina wallacei, Wallace, Proc. Zool. Soc. 1865, p. 406 = N. (Xesta) wallacei, von Martens, Ostas. Zool. II. p. 202, var. Pfr. Novit. Conch. IV. pl. 128, fig. 5.\n\nMacassar; Celebes.\n\nN. RAPA, (Helix), Müller, Verm. II. p. 67, No. 261; Chemn. IX. pt. II. p. 134, pl. 131, fig. 1176; Pfr. Zeitschr. Malak. 1844, p. 178; Mon. Hel. I. p. 62 = Helix cidaris, Lamarck.\n\nAmboyna.\n\nN. BORNEENSIS, Pfr. = Helix borneensis, Pfr. Proc. Zool. Soc. 1849, p. 127; Reeve, Conch. Icon. pl. 196, fig. 1379; Pfr. Mon. Hel. III. p. 70.\n\nBorneo.\n\nN. RUGATA, von Martens, Monatsber. Ak. Berlin, 18th July, 1864, p. 528; Ostas. Zool. II. p. 229, pl. 10, fig. 3 = Helix cidaris, Pfr. Mon. Hel. III. p. 43 (not Lamarck); Reeve, Conch. Icon. pl. 86, sp. 464 = Hemiplecta cidaris, Wallace, Proc. Zool. Soc. 1865, p. 406 = Helix clairvillea, Reeve, Conch. Icon. Helix pl. 206, sp. 1454 (not Fé). = Nanina cidaris, Gray, Catal. Pulmonif. p. 114.\n\nCelebes and Timor.\n\nN. SUMATRENSIS, Mouss. MSS.; von Martens, Ostas. Zool. II. p. 237 = Helix sumatrensis, Pfr. Mon. Hel. V. p. 77.\n\nSumatra.\n\nN. PEASEANA, Pfr. = Helix peaseana, Pfr. Proc. Zool. Soc. 1864, p. 603; Mon. Hel. V. p. 77 = Hemiplecta peaseana, Wallace, Proc. Zool. Soc. 1865, p. 406 = Nanina rareyuttata, var.? von Martens, Ostas. Zool. II. p. 206.\n\nTimor and Buru.\n\nN. MARTINI, Pfr. = Helix martini, Pfr. Proc. Zool. Soc. 1854, p. 149; Reeve, Conch. Icon. Helix No. 1356, pl. 193; Pfr. (Caracolus), Vers. p. 141 = Nanina ampidroma, von Martens,\nOstas. Zool. pl. 11, figs. 2-5 (Normal and sinistral shells) = Nanina producta, Mousson = Ariophanta martini, Semper = Helix martini, Pfr. Mon. Hel. IV. p. 300.\n\nPadang, Sumatra.\n\nN. brookei, Adams and Reeve, = Helix brookei, Adams and Reeve, Voy. Samarang, Moll. p. 60, pl. 15, fig. 4; Chemn. 2nd edit. Helix No. 870, pl. 135, figs. 1-2; Pfr. Mon. Hel. III. p. 52 = H. gigas, Pfr. Zeitschr. f. Malak. 1850, p. 81.\n\nIn the mountains of Borneo.\n\nN. hugonis, Pfr. = Helix hugonis, Pfr. Proc. Zool. Soc. 1863, p. 523; Novit. Conch. p. 304, No. 415, pl. 74, figs. 1-3; Mon. Hel. V. p. 81 = H. sinistra, Bonnet, Rev. Zool. 1864, p. 67, pl. 5, fig. 2 = Nanina hugonis, von Martens, Ostas. Zool. II. p. 225.\n\nCollected in the island of Labuan by Sir Hugh Low.\n\nN. regalis, Benson, = Helix regalis, Annals Mag. Nat. Hist. 1850, p. 215; Chemn. 2nd edit. Helix No. 915, pl. 141, figs. 5-6, var. 7-8 = H. vittata, Adams and Reeve, Voy. Samarang, Moll. p. 60, pl. 15, fig. 7.\n\nSarawak and Balambangan.\n\nN. lindstedti, Pfr. = Helix lindstedti, Pfr. Proc. Zool. Soc. 1856, p. 387; Mon. Hel. IV. p. 31.\n\nMalacca.\n\nN. janus, Chemn. = Helix janus, Chemn. XI. p. 307, pl. 213, figs. 3016-17; 2nd edit. Helix No. 59, pl. 11, figs. 4-6; Pfr Proc. Zool. Soc. 1842, p. 87; Mon. Hel. I. p. 77 = Helicella bifrons, Fér. p. 233 = Helix mackenziana, Soul. Rev. Zool. 1841, p. 347 = H. balesteriana, Lea, Trans. Amer. Phil. Soc. VII. p. 460, pl. 12, fig. 10 = Ariophanta janus, Beck, Index, p. 5.\n\nMount Ophir, near Malacca.\n\nN. rumphi, v.d. Busch, = Helix rumphi, v. d. Busch, Phil. Icon. I. 1, p. 9, pl. 1, fig. 2; Chemn. 2nd edit. Helix No. 60,\npl. 11, figs. 7-9; Pfr. Mon. Hel. I. p. 76; (Nanina ?) Symb. II. p. 20.\n\nIsland of Java.\n\nN. Clypeus, Mouss. Jour. Conch. VI. 1857, p. 156 = Helix clypeus, Pfr. Mon. Hel. IV. p. 344.\n\nMount Semeru, Java.\n\nN. nasuta, Metcalfe, = Helix nasuta, Metcalfe, Proc. Zool. Soc. 1851; Pfr. Mon. Hel. III. p. 203.\n\nBorneo.\n\nN. (Ariophanta) interrupta, G. Nevill, Hand-list Moll. Ind. Mus. 1878, p. 20 (n.sp.?).\n\nKuala Kangsa, Perak, Malay Peninsula.\n\nN. (Rhysota) sp.? von Mollendorff, Jour. As. Soc. Bengal, LV. 1886, p. 301.\n\nA large greenish-brown shell, with dark brown band at periphery, and broader band at umbilicus; periphery obtusely angular; spire of six whorls, coarsely sculptured. Near N. pluto, Pfr. from Cambodia.\n\nPerak, Malay Peninsula.\n\nN. (Euplecta) bijuga, Stol. Jour. As. Soc. Bengal, XLII. 1873, p. 14, pl. 1, figs. 4-7, pl. 2, figs. 16-18 (Rotula) = Helix bijuga, Pfr. Mon. Hel. VII. 1876, p. 105 = Nanina bijuga, G. Nevill, Handl. Moll. Ind. Mus. 1878, p. 31; (Rotula), Crosse, Jour. Conch. XXVII. 1879, p. 336.\n\nBukit Pondok; Penang; Malay Peninsula.\n\nN. (Macrochlamys) sp. 2 and a species of Microcystis were found at Bukit Pondok by Dr. Hungerford.\n\nN. (Microcystina) townsendiana, Godwin-Austen and G. Nevill, Proc. Zool. Soc. 1879, p. 736, pl. 49, fig. 1.\n\nBukit Pondok.\n\nN. (Kaliella) perakensis, G. Nevill and Godwin-Austen, Land and Freshw. Moll. Ind. I. 1882, p. 8, pl. 2, fig. 7.\n\nBukit Pondok, Perak.\nN. (SITALA) CARINIFERA, Stol. Jour. As. Soc. Bengal, XLII. 1873, p. 16, pl. 1, fig. 8; Godwin-Austen, Land and Freshw. Moll. Ind. II. 1882, p. 35.\n\nPenang.\n\n6. TROCHONANINA, Mousson, 1869. Jour. Conch, 1869, p. 330.\n\nThe author states that certain Helices should be separated from the genus Trochomorpha, Albers (Heliceen, p. 60), under the name of Trochonanina, distinguished by an upper surface more or less sculptured, base polished with a callosity at the insertion of the columella.\n\nTROCHONANINA LYCHNIA, Benson, = Helix lychnia, Benson, Ann. and Magaz. Nat. Hist. 2nd series, X. 1852; Pfr. Mon. Hel. III. p. 626 = T. lycheria, Pfr. Nomen. Hel. Viv. p. 57, No. 113.\n\nIsland of Singapore.\n\nT. TROPIDOPHORA, Adams and Reeve, = Helix tais, Hombron et Jacquinot, Voy. Pole Sud, Atl. Livr. 22, pl. 7, figs. 42-45; Chemn. 2nd edit. Helix No. 782, pl. 125, figs. 32-33 = H. thais, Pfr. Zeitschr. f. Malak. 1849, p. 68 = H. tropidophora, Adams and Reeve, Voy. Samarang, Moll. p. 59, pl. 14, fig. 14 = H. tais, Pfr. Mon. Hel. III. p. 37.\n\nIslands of Marquesas; Borneo.\n\nT. CONICOIDES, Metc. = Helix conicoides, Metc. Proc. Zool. Soc. 1851; Chemn. 2nd edit. Helix No. 1020, pl. 153, figs. 20-21; Pfr. Mon. Hel. III. p. 37.\n\nBorneo.\n\nT. JENYNSI, Pfr. = Helix jenyntsi, Pfr. Proc. Zool. Soc. 1845, p. 131; Phil. Icon. II. 11, p. 86, pl. 7, fig. 8; Pfr. Mon. Hel. I. p. 81.\n\nJava; New Hebrides.\n7. **Hyalinia**, Fér. 1819, Prodromus, p. 40 = *Aplostoma*, Moquin-Tandon, 1855.\n\n*Shell* depressed or conical, more or less longitudinally, but not spirally striate; semi-transparent smooth and shining; umbilicus large, rarely small or none; epiphragm none, rudimentary or vitreous. Flagellum none or short, thick and steadied by a terminal muscle; mucous vesicles represented by a glandular layer. 50 sp.\n\nMostly Europe and North America.\n\n**Hyalinia amboinensis**, von Martens, Monatsber. Berl. Ak. 18th Ap. 1864, p. 266; Ostas. Zool. II. p. 244, pl. 12, fig. 11; Pfr. Mon. Hel. V. p. 141.\n\nBuru; Amboyna; Banda-Nera.\n\n8. **Trochomorpha**, Albers, 1850, Heliceen, p. 116. Section of\n\n*Helix* = *Geotrochus*, van Hasselt.\n\n*Shell* sub-perforate, spire depressed conical; last whorl carinated at the periphery; columella very short, vertical; lip simple. 19 sp.\n\nMauritius; India; East Indies.\n\n**Trochomorpha conus**, Phillippi, = *Helix conus*, Philippi, coll. Pfr. Symb. I. p. 39; Phil. Icon. I. 1, p. 11, pl. 1, fig. 6; Chemn. 2nd edit. Helix No. 216, pl. 28, figs. 6-7; Pfr. Mon. Hel. I. p. 35.\n\nJava.\n\nT. (?) **angulata**, Issel, Moll. Born. 1874, p. 42, pl. 5, fig. 5-8 = *Helix angulata*, Pfr. Mon. Hel. VII. p. 528.\n\nSarawak, Borneo.\n\nT. **ceroconus**, Pfr. = *Helix ceroconus*, Pfr. Proc. Zool. Soc. 1863, p. 523; von Martens, Ostas. Zool. II. p. 257; Pfr. Mon. Hel. V. p. 84.\n\nLabuan.\nT. leucophloea, von Martens, = Helix leucophloea (Fruticola) von Martens, Ostas. Zool. II. p. 269, pl. 12, fig. 14; Pfr. Mon. Hel. V. p. 85.\n\nNorth Celebes.\n\nT. conulus, von Martens, = Helix conulus, von Martens, Monatsber. Berl. Ak. 18th July, 1864, p. 523 (not H. conula, Pease, 1861); (Fruticola), Ostas. Zool. II. p. 269, pl. 13, fig. 15; Pfr. Mon. Hel. V. p. 333.\n\nKepahiang, Sumatra.\n\nT. gysseriana, Pfr. = Helix gysseriana, Pfr. Malak. Bl. XII. 1865, p. 122; Novit. Conch. Fasc. XXIII. p. 270, No. 381, pl. 67, figs. 3-5; Mon. Hel. V. p. 333.\n\nMoluccas.\n\nT. ternatana, Le Guillou, = Helix ternatana, Le Guill. Revue Zool. 1842, p. 138 = H. batchianensis, Pfr. Malak. Bl. 1860, p. 235 = Trochomorpha batchianensis, Wallace, Proc. Zool. Soc. 1865, p. 407 = T. ternatana (Nigritella) v. Martens, Ostas. Zool. II. p. 246, pl. 13, fig. 1 = Helix ternatana, Pfr. Mon. Hel. V. p. 254.\n\nMoluccas.\n\nT. carinifera, Stol. = Sitala carinifera, Stol. Jour. As. Soc. Bengal, XLII. 1873, p. 16, pl. 1, fig. 8 = Helix carinifera, Pfr. Mon. Hel. VII. p. 103.\n\nPenang Hill.\n\nT. micula (Zonites), Mouss. = Zonites micula, Mouss. Jour. Conch. VI. 1857, p. 158 = Helix micula (Zonites), Pfr. Mon. Hel. IV. p. 343.\n\nBali Island, Java.\n\nT. tricolor, von Martens, Malak. Bl. X. 1863, p. 134: (Videna), Ostas. Zool. II. p. 252, pl. 13, fig. 3 = Helix tricolor, Pfr. Mon. Hel. V. p. 181.\n\nIsland of Buru, Moluccas.\nT. bicolor, von Martens, Monatsber. Berl. Ak. 18th Ap. 1864, p. 267; (Videna), Ostas. Zool. II. p. 252, pl. 13, fig. 2 = Helix bicolor, Pfr. Mon. Hel. V. p. 182.\n\nSumatra; Borneo.\n\nT. zollingeri, Pfr. = Helix zollingeri, Pfr. Proc. Zool. Soc. 1851; Chemn. 2nd edit. Helix No. 939, pl. 143, figs. 21-22; Pfr. Mon. Hel. III. p. 113.\n\nJava.\n\nT. cantoriana, Benson, = Helix cantoriana, Benson, in Ann. and Magaz. Nat. Hist. 3rd series, VII. 1861, p. 85; Pfr. Mon. Hel. V. p. 186.\n\nSang-sang, near Penang.\n\nT. planorbis, Less. = Helix planorbis, Less. Voy. de la Coq. p. 312, pl. 13, fig. 4 = H. marginata, Müll. (teste Beck) = H. planorbis, Pfr. Mon. Hel. I. p. 122.\n\nNew Guinea; Java; Borneo.\n\nT. gorontalensis, von Martens, = T. sp. von Martens, Malak. Bl. XX. 1873, p. 168 = T. gorontalensis, v. Martens in Pfr. Novit. Conch. IV. p. 124, No. 827, pl. 128, fig. 7 = Helix gorontalensis, Pfr. Mon. Hel. VII. p. 208.\n\nGorontalo, Celebes.\n\nT. timorensis (Videna), von Mart. Ostas. Zool. II. p. 248. pl. 13, fig. 6 = Helix timorensis, Pfr. Mon. Hel. V. p. 187.\n\nIsland of Timor.\n\nT. lardea, von Mart. = Helix zollingeri, Mouss. Coll. (not Pfr.) = Trochomorpha lardea, von Mart. Monatsber. Berl. Ak. 18th April, 1864, p. 267; (Videna), Ostas. Zool. II. p. 251, pl. 13, figs. 5-6 = Helix lardea, Pfr. Mon. Hel. V. p. 255.\n\nCeram, Moluccas.\nFamily HELICIDA.\n\n9. PATULA, Held, 1837.\n\nIsis, p. 916; Albers, Heliceen, p. 64 = *Eryromphala*, Beck, 1837 = *Delomphalus*, Agassiz, 1837 = *Euryomphala*, Herrmanssen, 1846 = *Discus*, H. and A. Adams (Genera II. p. 116) = *Pitys*, Harper Pease, 1871.\n\nShell perspectively umbilicate, discoid or turbinate, depressed, rugose or striate; whorls gradually enlarging; aperture round, toothless; lip acute; jaws smooth or slightly striate, with a more or less marked median protuberance. About 327 species, with a world-wide distribution.\n\n*Patula quadrispira*, von Mart. = *Helix quadrispira*, von Mart. Monatsber. Berl. Ak. 18th April, 1864, p. 267 = *Patula quadrispira* (*Rhytida*), von Mart. Ostas. Zool. II. p. 259, pl. 13, fig. 9 = *Helix quadrispira*, Pfr. Mon. Hel. V. p. 157.\n\nCeram, Moluccas.\n\n*P. obscurata*, Adams and Reeve, = *Helix obscurata*, Ad. and Reeve, Voy. Samarang, Moll. p. 59, pl. 14, fig. 18, (not Porro) = *H. arthurii*, Pfr. Zeitschr. f. Malak. 1851, p. 16; Chemn. 2nd edit. Helix No. 940, pl. 143, figs. 23-25; Pfr. Mon. Hel. III. p. 102.\n\nBorneo.\n\n*P. lutea*, von Mart. = *Helix lutea*, von Mart. Monatsber. Berl. Ak. 18th April, 1864, p. 268 = *Patula lutea* (*Macrocyclodes*), von Mart. Ostas. Zool. II. p. 260, pl. 12, fig. 16 = *Helix lutea*, Pfr. Mon. Hel. V. p. 167.\n\nBuru, Moluccas.\n\n10. HELIX, Linnæus.\n\nShell of variable form, smooth, rugose, striate, ribbed or tuberculate, sometimes pilose; orbicular-convex, planorboid, trochiform, sub-turricated, or short bulimiform (monstrosities sinistral, or with the whorls more or less uncoiled); aperture oblique, oval,\nor semilunar, with or without interior teeth on the margin or parietal wall; lip simple or thickened internally or reflected; umbilicus covered to widely open.\n\nAnimal capable of complete retraction within the shell; the jaw finely striate, or ribbed, sulcate, or plicate.\n\nRadula:—central teeth tricuspid, laterals bicuspid or tricuspid, with an obsolete internal cusp; marginals usually wider than high, short, with two or three small cusps.\n\nDistribution:—world-wide; about 3,400 species known. Pfeiffer, Albers, Beck, Swainson, Féussac, Tryon, H. and A. Adams, and others have proposed a great number of groups in which it is generally found that similar ones have a similar geographical distribution. Unfortunately there has been a lamentable want of consent amongst these and other authors as to the grouping, and there is no accepted system which is followed by the generality of conchologists; it would seem in fact as if each one had his own. In this list the system of Pfeiffer is followed, who makes 86 sections and 67 sub-sections.\n\nSection 22, Hygromia. Sub-section 1, Fruticola.\n\nHelix miliacea, von Mart. = H. milium, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 524 (not Morse, 1859) = H. milicea, (Fruticola), von Mart. Ostas. Zool. II. p. 268, pl. 12, fig. 15; Pfr. Mon. Hel. V. p. 68.\n\nAmboyna.\n\nH. cryptopila, Mouss. = H. cryptopila, Pfr. Novit. Conch. IV. p. 40, No. 711, pl. 117, figs. 10-12 = H. helicinoides, var. von Mart. Ostas. Zool. II. p. 270; Mouss. Jav. Moll. p. 23, pl. 2, fig. 6; Pfr. Mon. Hel. III. p. 162, V. p. 259 (not Hom. et Jacq.) = H. cryptopila, Pfr. Mon. Hel. VII. p. 391.\n\nIsland of Rakata; Java.\n\nH. everetti (Fruticola), H. Adams, Proc. Zool. Soc. 1873, p. 207, pl. 23, fig. 11; Pfr. Mon. Hel. VII. p. 401.\n\nSarawak, Borneo.\nH. mendax, von Martens, Monatsber. Berl. Ak. 18th July, 1864, p. 524; (Fruticola), Ostas. Zool. II. p. 272, pl. 13, fig. 14; Pfr. Mon. Hel. V. p. 350.\n\nAtapupu, Timor.\n\nH. crassula, Philippi, Icon. 1, 7. p. 152, pl. 5, fig. 3; Pfr. Mon. Hel. I. p. 198.\n\nJava.\n\nSub-section 2, Monacha.\n\nH. pulvisculum (Fructicola?), Issel, Moll. Born. 1874, p. 43, pl. 5, figs. 24-27; Pfr. Mon. Hel. VII. p. 524.\n\nBorneo.\n\nSection 29, Plectotropis.\n\nH. winteriana, Pfr. Symb. II. p. 41; Philippi, Icon. 2, p. 23, pl. 2, fig. 7; Chemn. 2nd edit. Helix No. 605, pl. 95, figs. 1-2; Pfr. Mon, Hel. I. p. 202.\n\nJava.\n\nH. huttoni, Pfr. Symb. II. p. 82. = H. orbicula, Hutton, Jour. As. Soc. VII. p. 217 = H. huttoni, Pfr. Mon. Hel. I. p. 202.\n\nHimalayas; Java (?).\n\nH. sumatrana, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 523; (Plectotropis), Ostas. Zool. II. p. 266, pl. 13, fig. 13; Pfr. Mon. Hel. V. p. 409.\n\nWonosari, Java.\n\nH. squamulosa, Mouss. MSS; (Plectotropis), von Mart. Ostas. Zool. II. p. 266; Pfr. Mon. Hel. V. p. 409.\n\nIsland of Madura, near Java.\n\nSection 45, Hemicycla. Sub-section 3, Coelatura.\n\nH. simplex, Lamarck, 42, p. 77, Desh. edit. p. 45; (Helicogena), Fér. pr. add. 48 bis Hist. pl. 25 B. fig. 6; Pfr. Mon. Hel. I. p. 20.\n\nAmboyna.\nSection 62, Cepolis.\n\nH. porcellana, Grateloup, Actes Soc. Linn. Bordeaux, XI. p. 410, pl. 1, figs. 5-6; Pfr. Mon. Hel. I. p. 346.\nLombok, near Java.\n\nSection 65, Phania.\n\nH. pyrostoma (Helicigona), Fér. pr. 139, Hist. pl. 15, fig. 3-4; Pfr. Symb. III. p. 73; Chemn. 2nd edit. Helix No. 401, pl. 67, figs. 4-5 = Carocolla pyrostoma, Gray, Ann of Phil. n.s. IX. p. 412 = Helix pyrostoma, Pfr. Mon. Hel. I. p. 295.\nIsland of Gilolo.\n\nSection 68, Obba. Sub-section Genuinae.\n\nH. mammilla (Helicella), Fér. pr. add. p. 67, Hist. pl. 25, figs. 1-2; Quoy and Gaim. Astrol. II. p. 93, pl. 7, figs. 3-5 (c. anim.)); Lamarck, Desh. edit. 163, p. 105 = Obba mammilla, Beck, Index, p. 30 = Helix mammilla, Pfr. Mon. Hel. I. p. 318.\nCelebes.\n\nH. papilla, Müll. Verm. II. p. 100, No. 298; (Helicogena), Fér. pr. 43, Hist. pl. 25 B. fig. 5; Lamarck, 79, p. 87, Desh. edit. p. 65; Chemn. 2nd edit. Helix No. 124, pl. 21, figs. 8-9 = Trochus papilla, Chemn. IX. p. 51, pl. 122, figs. 1053-54 = Obba papilla, Beck, Index, p. 30 = Helix papilla, Pfr. Mon. Hel. I. p. 318.\nCelebes.\n\nSub-section 2, Janira.\n\nH. campanula, Pfr. Proc. Zool. Soc. 1845, p. 65; var. Chemn. 2nd edit. Helix No. 694, pl. 111, figs. 13-14; Pfr. Mon. Hel. I. p. 321.\nIndian Archipelago.\n\nSub-section 3, Philina.\n\nH. loxotropis, Pfr. Zeitschr. f. Malak. 1850, p. 82; Chemn 2nd edit. Helix No. 871, pl. 135, figs. 3-4; Pfr. Mon. Hel. III. p. 226.\nIsland of Gilolo.\nH. lorquini, Pfr. Malak. Bl. XII. 1865, p. 122; Novit. Conch. Fasc. 23, p. 273, No. 385, pl. 67, figs. 14-15; Mon. Hel. V. p. 345.\n\nMoluccas.\n\nH. quoyi, Deshayes, = H. undulata, Quoy and Gaim. Astrol. II. p. 91, pl. 7, figs. 1-2 = H. quoyi, Desh. Lamarck, Desh. ed. 162, p. 105; Fér. Hist. pl. 73 B. fig. 4; Pfr. Mon. Hel. I. p. 373, III. p. 238; IV. p. 286; Chemn. new edit. III. p. 358; (Ampelita) Pfr. Vers. p. 137 = Vallonia undulata, Gray, Fig. Moll. An. pl. 72, fig. 3.\n\nCelebes.\n\nH. atacta, Pfr. Proc. Zool. Soc. 1861, p. 386, pl. 37, fig. 5; von Mart. Ostas. Zool. II. p. 306, pl. 16, fig. 1 = Planispira atacta, Wallace, Proc. Zool. Soc. 1865, p. 409 = Helix atacta, Pfr. Mon. Hel. V. p. 376.\n\nTernate; Gilolo.\n\nH. heroica, Pfr. Proc. Zool. Soc. 1855, p. 114; (Obba), Vers. p. 137; Mon. Hel. IV. p. 291.\n\nCelebes.\n\nH. atrofusca, Pfr. Proc. Zool. Soc. 1861, p. 22, pl. 3, fig. 3; Novit. Conch. p. 164, No. 261, pl. 45, figs. 1-3; (Planispira), von Mart. Ostas. Zool. II. p. 299 = Planispira atro-fusca, Wallace, Proc. Zool. Soc. 1865, p. 409 = Helix atro-fusca, Pfr. Mon. Hel. V. p. 382.\n\nIsland of Batchian.\n\nH. latizona, Pfr. Proc. Zool. Soc. 1863, p. 524 = Planispira latizona, Wallace, Proc. Zool. Soc. 1865, p. 409 = Helix latizona, Pfr. Mon. Hel. V. p. 394.\n\nCeram Island, Moluccas.\n\nH. biconvexa, von Martens, Monatsber. Berl. Ak. 18th July, 1864, p. 526; Ostas. Zool. II. p. 317, pl. 16, fig. 13; Pfr. Mon. Hel. V. p. 404.\n\nIsland of Tavalli, Moluccas.\nH. sororcula (Obba), von Martens, Ostas. Zool. II. p. 294, pl. 17, fig. 4; Pfr. Mon. Hel. V. p. 405.\nCelebes.\n\nH. kobeltiana, Pfr. Malak. Bl. XVIII. 1871, p. 124; Novit. Conch. IV. p. 73, No. 760, pl. 121, figs. 12-13; Pfr. Mon. Hel. VII. p. 456.\nCeram.\n\nSection 69, Trachia.\n\nH. malayana, O. von Mollendorff, Jour. As. Soc. Beng. 1886, LV. p. 303.\nPerak, Malay Peninsula.\n\nH. penangensis, Stol. Jour. As. Soc. Beng. XLII. 1873, p. 24, pl. 3, fig. 1; Pfr. Mon. Hel. VII. p. 399.\nPenang.\n\nSection 72, Planispira.\n\nH. exceptiuncula, Fér. pr. 176, Hist. pl. 70, fig. 1, pl. 73A, fig. 1; Pfr. Symb. III. p. 75; Mon. Hel. I. p. 311; Chemn. 2nd edit. Helix No. 453, pl. 76, figs. 1-3 = Planispira exceptiuncula, Beck, Index, p. 29.\nMoluccas.\n\nH. pheyne, Pfr. Nomen. Hel. p. 182, No. 2530 = H. exceptiuncula var. Fér. Hist. pl. 73A. fig. 1 = H. phryne, Pfr. Proc. Zool. Soc. 1861, p. 386, pl. 37, fig. 7 = Planispira phryne, Wallace, Proc. Zool. Soc. 1865, p. 409 = Helix phryne, Pfr. Mon. Hel. V. p. 311.\nTernate; Gilolo.\n\nH. flavidula, von Mart. = H. flavoela, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 525 (not Kryn, 1837) = H. flavidula, von Mart. Günth. Zool. Jahresber. 1864; (Planispira) Ostas. Zool. II. p. 302, pl. 14, fig. 4; Pfr. Mon. Hel. V. p. 378.\nMaros, Celebes.\n\nH. quadrifasciata, Le Guill. Revue Zoologique, 1842, p. 141; Pfr. Mon. Hel. I. p. 381.\nTernate; Halmahera.\nH. endoptycha, von Mart. Monatsber. Berl. Ak. 18th Ap. 1864, p. 268; (Planispira), Ostas. Zool. II. p. 301, pl. 14, fig. 2; Pfr. Mon. Hel. V. p. 383.\n\nTernate; Batjan (? Batchian).\n\nH. zonalis (Helicella), Fé. pr. 175, Hist. pl. 70, fig. 3; Pfr. Symb. II. p. 42; Mon. Hel. I. p. 380; Chemn. 2nd edit. Helix No. 24, p. 50, pl. 6, figs. 14-15 = H. zonaria, Chemn. IX. Pt. 2, p. 140, pl. 132, fig. 1188 = Planispira zonalis, Beck, Index, p. 30.\n\nGilolo.\n\nH. (Dorcasia) compta, H. Adams, Proc. Zool. Soc. 1865, p. 414, pl. 21, fig. 8; Pfr. Mon. Hel. V. p. 380.\n\nBatchian,\n\nH. kurri, Pfr. Proc. Zool. Soc. 1847; Mon. Hel. I. p. 386.\n\nCeram.\n\nH. zonaria, L. Syst. Nat. 12th edit. p. 1245, No. 681; (Helicella), Fé. pr. 177, Hist. pl. 71, figs. 6-10, pl. 73, figs. 3-10; Lamarck, 37, p. 75, Desh. edit. p. 44; Fé. Voy. de Freycin. Zool. p. 469, pl. 67, figs. 14-15; Quoy and Gaim. Astrol. II. p. 104, pl. 8, fig. 14; Chemn. 2nd edit. Helix No. 569, pl. 14, figs. 11-12, pl. 90, figs. 13-18 = Planispira zonaria, Beck, Index, p. 30 = Pusodon zonaria, Swains. Malac. p. 330: Knorr, Vergnüg. V. p. 33, pl. 21, fig. 41; Pfr. Mon. Hel. I. p. 386.\n\nAmboyna; Ceram; Buru.\n\nH. fasciolata, Lesson (?), Voy. Coq. Zool. II. 1, p. 311 (?); (Planispira), von Mart. Ostas. Zool. II. p. 314; Pfr. Mon. Hel V. p. 505.\n\nMoluccas.\n\nH. collis, Mouss. in coll. Pfr. Novit. Conch. IV. Fasc. 39, p. 36, No. 708, pl. 117, figs. 1-3 = H. zonaria, var. von Mart. Ostas. Zool. Moll. p. 312 = H. collis, Pfr. Mon. Hel. VII. p. 444\n\nAmboyna.\nH. coluber, Beck, = Planispira coluber, Beck, Index, p. 30 = Helix coluber, Chemn. 2nd edit. Helix No. 23, p. 49, pl. 6, figs. 8-9 = H. zonaria, Chemn. IX. Pt. 2, p. 140, pl. 132, fig. 1189; var. Fér. Hist. pl. 73, figs. 1-2; Knorr, Vergnüg. V. p. 33, pl. 21, fig. 3 = H. coluber, Pfr. Mon. Hel. I. p. 386.\n\nGilolo.\n\nH. mersispira, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 525; (Planispira), Ostas. Zool. II. p. 303, pl. 14, fig. 8; Pfr. Mon. Hel. V. p. 388.\n\nIsland of Moti, Moluccas.\n\nH. aurita, von Mart. Monatsber. Berl. Ak. 18th April, 1864, p. 269; (Chloritis), Ostas. Zool. II. p. 316, pl. 16, fig. 12; Pfr. Mon. Hel. V. p. 389.\n\nMoti Island, Moluccas.\n\nH. guttata, Le Guill. Revue Zool. 1842, p. 141; Pfr. Mon. Hel. I. p. 388.\n\nCeram.\n\nH. zebra, Pfr. Zeitschr. f. Makak. 1850, p. 83; Chemn. 2nd edit. Helix No. 875, pl. 135, figs. 16-18; Reeve, Conch. Icon. No. 499, pl. 92 = H. zonaria, var. Fér. Hist. pl. 73, fig. 5? = H. zebra, Pfr. Mon. Hel. III. p. 246.\n\nCeram; Goram.\n\nH. expansa, Pfr. Proc. Zool. Soc. 1861, p. 22; Novit. Conch. p. 165, No. 262, pl. 45, figs. 4-6; (Chloritis), von Mart. Ostas. Zool. II. p. 286, pl. 14, fig. 3 = H. anozena, von Mart. Monatsber. Berl. Ak. 18th Ap. 1864, p. 269 = Planispira expansa, Wallace, Proc. Zool. Soc. 1865, p. 409 = Helix expansa, Pfr. Mon. Hel. V. p. 391.\n\nBatchian.\n\nH. margaritus, Pfr. Zeitschr. f. Malak. 1850, p. 83; Chemn. 2nd edit. Helix No. 876, pl. 135, figs. 19-21; Pfr. Mon. Hel III. p. 246.\n\nMoluccas.\nH. embrechti ana, Mouss. in coll.; Pfr. Novit. Conch. IV. p. 39, No. 710, pl. 117, figs. 7-9; Mon. Hel. VII. p. 446 (erroneously marked p. 746 in Nomen. Hel.)\n\nMoluccas.\n\nSection 73, Chloritis.\n\nH. zodiaca, Fér. (Helicella) pr. 184, Hist. pl. 75, fig. 2; Pfr. Sym. III. p. 78 = H. zodiacus, Wood, Suppl. pl. 7, fig. 52 = Ampelita zodiaca, Beck, Index, p. 30 = Helix zodiaca, Pfr. Mon. Hel. I. p. 373.\n\nCelebes.\n\nH. tuba, Albers, Malak. Bl. 1854, p. 214; Pfr. Novit. Conch. I. p. 25, No. 41, pl. 7, figs. 1-3; (Ampelita), Pfr. Vers. p. 137; Mon. Hel. IV. p. 288.\n\nCelebes.\n\nH. bulbulus, Mouss. = H. bulbos, Mouss. Jav. Moll. p. 113, pl. 21, fig. 5 = H. bulbulus, Mouss. MSS.; Pfr. Mon. Hel. III. p. 271.\n\nMaros, Celebes.\n\nH. ungulina, L. Syst. ed. 10, p. 772, ed. 12, p. 1245; Pfr. Mon. Hel. I. p. 383.\n\nCeram.\n\nH. unguiculastr a, von Martens, Monatsber. Berl. Ak. 18th July, 1864, p. 524; (Chloritis), Ostas. Zool. II. p. 281, pl. 14, fig. 1; var. pilosa, von Mart. Ostas. Zool. II. p. 282; Pfr. Mon. Hel. V. p. 386.\n\nAmboyna and Buru.\n\nH. ceramensis, Pfr. Proc. Zool. Soc. 1861, p. 192; (Chloritis), von Mart. Ostas. Zool. II. p. 283 = Semicornu ceramense, Wallace, Proc. Zool. Soc. 1865, p. 410 = Helix ceramensis, Pfr. Mon. Hel. V. p. 386.\n\nCeram.\nH. UNGUICULA, (Helicella), Féér. pr. 191, Hist. pl. 76, figs. 3-4; Lamarek, Desh. edit. 151, p. 99; Desh. in Féér. Hist. p. 12; Chemn. 2nd edit. Helix No. 38, pl. 8, figs. 10-11 = H. unguulina, Chemn. IX. P. 2, p. 81, pl. 125, figs. 1098-99 = Chloritis unguicula, Beck, Index, p. 29 = Helix unguicula, Pfr. Mon. Hel. I. p. 384.\n\nAmboyna.\n\nH. FLEXUOSA, Pfr. Proc. Zool. Soc. 1855, p. 112; (Planispira), Pfr. Vers. p. 136; Mon. Hel. IV. p. 292.\n\nBorneo.\n\nH. MARTENSI, Pfr. Proc. Zool. Soc. 1861, p. 193; (Chloritis), von Mart. Ostas. Zool. II. p. 279; = Planispira martensi, Wallace, Proc. Zool. Soc. 1865, p. 409; = Helix martensi, Pfr. Mon. Hel. V. p. 389.\n\nCeram.\n\nH. UNGUICULINA, von Mart. Malak. Bl. X. 1863, p. 135; (Chloritis) Ostas. Zool. II. p. 278, pl. 14, fig. 5; Pfr. Mon. Hel. V. p. 390.\n\nBuru.\n\nH. BIOMPHALA, Pfr. Proc. Zool. Soc. 1862, p. 272; (Chloritis) von Martens, Ostas. Zool. II. p. 279 = Semicornu biomphalum, Wallace, Proc. Zool. Soc. 1865, p. 410 = Helix biomphala, Pfr. Mon. Hel. V. p. 391.\n\nCeram.\n\nH. QUADRIVOLVUS, von Mart. Monatsber. Berl. Ak. 16th Jan. 1865, p. 53; (Chloritis), Ostas. Zool. II. p. 288, pl. 14, fig. 6; Pfr. Mon. Hel. V. p. 392.\n\nBorneo.\n\nSection 77, Dorcasia.\n\nH. ARGILLACEA, (Helicogena), Féér. pr. 38, Hist. pl. 26, figs. 1-2; Lamarek, 53, p. 80, Dh. edit. p 50; Féér. Voy. Freycin. Zool. p. 468, pl. 67, figs. 6-7; Chemn. 2nd edit. Helix No. 326, pl. 58,\nfigs. 4-5 = *Galaxias argillacea*, Beck, Index, p. 42 = *Helix argillacea*, var. Fér. pl. 26, fig. 3; Pfr. Mon. Hel. I. p. 320.\n\nTimor; Rawak; Flores.\n\n*H. transversalis*, Mouss. Jour. Conch. VI. 1857, p. 158, pl. 6, fig. 5; Pfr. Mon. Hel IV. p. 350.\n\nBali.\n\n**Section 78, Camaeana.**\n\n*H. trailli*, Pfr. Proc. Zool. Soc. 1855, p. 107, pl. 32, fig. 4; (*Camaena*), Vers. p. 138; Mon. Hel. IV. p. 256.\n\nPalawan Passage, near Borneo.\n\n*H. germanus*, Reeve, = *H. orientalis*, Ad. and Reeve, Voy. Samarang, Moll. p. 61, pl. 16, fig. 4 (not Gray) = *H. germanus*, Reeve, Conch. Icon. No. 385, pl. 74; Chemn. 2nd edit. Helix No. 925, pl. 142, figs. 1-2; Pfr. Mon. Hel. III. p. 222.\n\nBorneo (?) Japan.\n\n*H. palawanica*, Pfr. Proc. Zool. Soc. 1855, p. 107, pl. 32, fig. 7; (*Camaena*), Pfr. Vers. p. 138; Mon. Hel. IV. p. 261.\n\nPalawan Passage, near Borneo.\n\n*H. condoriana*, Crosse and Fisch. Jour. Conch. XI. 1863, p. 351, pl. 14, fig. 1; Pfr. Mon. Hel. V. p. 377.\n\nPulo Condor, Cochin-China.\n\n**Section 80, Geotrochus. Sub-section 1, Geotrochi genuini.**\n\n*H. perakensis*, Crosse, Jour. de Conch. XXVII. 1879, p. 199, pl. 8, fig. 4 (*Geotrochus*).\n\nThis is a small regularly conical shell, 10 millimetres in diameter and 11 high. Dr. Hungerford has some doubts about its being a *Geotrochus*, a group which has not yet been observed in the Indian region. The figure gives the idea rather of *Satsuma* (or *Fruticotrechus*, Kol.), which group is widely spread\nin China, and might very well range into the Malay Peninsula, hitherto so little explored. Von Moll. Jour. As. Soc. Beng. LV. 1886, p. 303.\n\nPerak.\n\nH. SWETTENHAMI, De Morgan, Le Naturaliste, VII. 1885, p. 68; O. von Möllendorff, Jour. As. Soc. Beng. LV. 1886, p. 304, who says the species may be a Trochomorpha or a Plectotropis. He makes the same observation with regard to the three following species:\n\nH. THIEROTI, De Morgan, l.c.\n\nGunong-Chura, north of Ipoli, Kinta Valley.\n\nH. HARDOUINI, De Morgan, l.c.\n\nValley of the Kinta, between Lahat and Ipoli.\n\nH. LAHATENSIS, De Morgan, l.c.\n\nSame locality.\n\nH. ANTIQUA, Ad. and Reeve, Voy. Samarang, Moll. p. 61, pl. 16, fig. 1; Reeve, Conch. Icon. No. 402, pl. 77; Chemn. 2nd edit. Helix No. 949, pl. 144, figs. 14-15; Pfr. Mon. Hel. III. p. 172.\n\nUnsang, Borneo.\n\nSub-section 2, Perforati.\n\nH. EUCHROES, Pfr. Malak. Bl. 1854, p. 57; Reeve, Conch. Icon. No. 1346, pl. 192; Pfr. Novit. Conch. I. p. 2, No. 3, pl. 1, figs. 7-8; (Geotrochus), Pfr. Vers. p. 145 = Acavus euchroës (Geotrochus), H. and A. Adams, Gen. II. p. 196 = Helix euchroës, Pfr. Mon. Hel. IV. p. 256.\n\nIndian Archipelago.\n\nH. LENTA, Pfr. = H. pileus, Pfr. Mon. Hel. I. p. 324; var. Chemn. new edit. Helix I. p. 157, pl. 40, fig. 5 = H. lenta, Pfr. Malak. Bl. 1854, p. 57; (Geotrochus), Pfr. Vers. p. 145; Mon. Hel. IV. p. 257 = Acavus lentus (Geotrochus), H. and A. Adams, Gen. II. p. 196.\n\nMoluccas.\nH. STURSIANA, Shuttlew. Bern, Mittheil. 1852, Aug. p. 200; Pfr. Mon. Hel. III. p. 179.\n\nAmboyna.\n\nH. PILEOLUS, Fér. Hist. pl. 63 A. figs. 1-2 (not Pfr. Mon. H. I. p. 324); Pfr. Malak. Bl. VII. 1860, p. 64; von Mart. Ostas. Zool. II. p. 321, pl. 17, figs. 8-9; Pfr. Mon. Hel. V. p. 326.\n\nBatchian.\n\nH. ZOAE, Pfr. Malak. Bl. XII. 1865, p. 121; Novit. Conch. Fasc. 23, p. 274, No. 386, pl. 67, figs. 16-17 = H. pileolus, Pfr. Mon. Hel. I. p. 324.\n\nMoluccas.\n\nH. SUBVITREA, Pfr. Proc. Zool. Soc. 1854, p. 148; Reeve, Conch. Icon. No. 1361, pl. 194; Pfr. Novit. Conch. I. p. 8, No. 13, pl. 3, figs. 8-9; (Geotrochus) Pfr. Vers. p. 145.\n\nMoluccas.\n\nH. RHYNCHOSTOMA, Pfr. Proc. Zool. Soc. 1861, p. 21, pl. 2, fig. 6; Novit. Conch. p. 166, No. 264, pl. 45, figs. 9-11; Mon. Hel. V. p. 328.\n\nBatchian.\n\nH. LANCEOLATA, Pfr. Proc. Zool. Soc. 1861, p. 386, pl. 37, fig. 6; von Mart. Ostas. Zool. II. p. 320, pl. 17, fig. 7; Pfr. Mon. Hel. V. p. 328 = Papuina lanceolata, Wallace, Proc. Zool. Soc. 1865, p. 411.\n\nGilolo; Moti.\n\nH. NODIFERA, Pfr. Proc. Zool. Soc. 1861, p. 21, pl. 2, fig. 4; Novit. Conch. p. 166, No. 263, pl. 45, figs. 7-8 = Papuina nodifera, Wallace, Proc. Zool. Soc. 1865, p. 411 = Helix nodifera, Pfr. Mon. Hel. V. p. 328.\n\nBatchian.\n\nH. VITREA, Fér. (Helicigona), pr. 145, Hist. pl. 64, fig. 4; Chemn. 2nd edit. Helix No. 459, pl. 76, figs. 18-19; Pfr. Mon. Hel. I. p. 326.\n\nTernate; Moti; Batchian.\nH. albula, Le Guill. Revue Zool. 1842, p. 139; Pfr. Mon. Hel. I. p. 328.\n\nTernate.\n\nSub-section 3, Pseudopartula.\n\nH. (Bulimus) galericulum, Mouss. (Pfr. Nomenclator Hel. p. 197, No. 83) = Bulimus galericulum, Mouss. Jav. Moll. p. 34, pl. 3, fig. 5; Pfr. Mon. Hel. III. p. 302.\n\nPardana, Java.\n\nSection 85, Corasia.\n\nH. extensa, Müll. Verm. II. p. 60, No. 254 (not Fév.); Gmel. Syst. p. 3631, No. 59; Lamarck, Hist. VI. p. 70, No. 18, Desh. edit. VIII. p. 37; Desh. in Fév. Hist. I. p. 246, No. 313, pl. 96, figs. 5-7; Chemn. 2nd edit. Helix No. 1090, pl. 160, figs. 6-7; Pfr. Mon. Hel. III. p. 192 = Eurycratera extensa, Beck, Ind. p. 46, No. 9.\n\nAmboyna; Goram.\n\nH. leucophthalma, Pfr. Malak. Bl. XVII. 1870, p. 93; Novit. Conch. IV. p. 10, No. 681, pl. 111, figs. 8-9 = Cochlostyla (Corasia) leucophthalma, Paetel, Catal. 1873, p. 97; = Helix leucophthalma, Pfr. Mon. Hel. VII. p. 355.\n\nCelebes.\n\nH. lais, Pfr. Proc. Zool. Soc. 1853; Mon. Hel. III. p. 647.\n\nIsland of Tukan Bessi.\n\nII. Cochlostyla, Fév. Prodromus, p. 47, Sub-genus of Helix.\n\nShell not umbilicated, oval, conical, ventricose, somewhat like a Bulimus with rather obtuse apex. Aperture large, ovate; columella straight or slightly curved; peristome reflected. About 214 species, generally characteristic of the Philippines and Indian Archipelago, some in India, others in Cochin China, while a few extend into the Pacific as far as Fiji and New Caledonia. (?)\nCochlostyla thomsoni, Pfr. Nomen. Hel. p. 205, No. 2116 = Helix thomsoni, Pfr. Malak. Bl. XVIII. 1871, p. 120; Novit. Conch. IV. p. 70, No. 756, pl. 121, figs. 1-2 = Cochlostyla thomsoni (Corasia), Paetel, Catal. 1873, p. 97 = Helix thomsoni, Pfr. Mon. Hel. VII. p. 308.\n\nIsland of Tukan Bessi.\n\nC. indusiata, Pfr. Nomencl. Hel. p. 205, No. 2489 = Helix indusiata, Pfr. Malak. Bl. XVIII. 1871, p. 121; Novit. Conch. IV. p. 71, No. 757, p. 121, figs. 3-4; Mon. Hel. VII. p. 355.\n\nTukan Bessi.\n\nC. rustica, Mouss. = Bulimus rusticus, Mouss. Jav. Moll. 115, pl. 22, fig. 1; Reeve, Conch. Icon. No. 574, pl. 78; Pfr. Mon. Hel. III. p. 296 = Cochlostyla rustica, Pfr. Nomen. Hel. p. 208, No. 17.\n\nJava.\n\nC. trailli, Pfr. = Bulimus trailli, Pfr. Proc. Zool. Soc. 1856, p. 106, pl. 32, fig. 6; (Amphidromus), Pfr. Vers. p. 146; Mon. Hel. IV. p. 362.\n\nBorneo.\n\nC. palawanensis, Pfr. = Bulimus palawanensis, Pfr. Mon. Hel. IV. p. 372.\n\nPalawan.\n\nC. librosa, Pfr. = Bulimus librosus, Pfr. Proc. Zool. Soc. 1856, p. 388; Mon. Hel. IV. p. 375.\n\nPalawan.\n\n12. Bulimus, Scopoli, Deliciae Flora et Faunae Insubricae.\n\n(Lombardy) Vol. I. p. 67.\n\nShell oval, oblong, or turriculate, solid, sub-perforate or imperforate; whorls few; ultimate ventricose wide; aperture longitudinal; columella broad, rarely plicate; peristome thickened, reflected; margins usually joined by a callus.\nAnimal similar to the animal of Helix, with a simple jaw.*\n\nRadula similar also to Helix. Between 300 and 400 species, mostly South American.†\n\n* It cannot be questioned that Scopoli rather than Adanson should be given as the authority for this genus, although the author of the work referred to in the text says distinctly, \"Proprium itaque ex his constituo, et duce celeberrimo Adansonio Bulimos voco, ut eo facilius adnoscantur. Solam testam nec animal inhabitans vidi, quod diversum esse à Limace affirmat Adansonius.\" p. 67.\n\nCf. Histoire Naturelle du Sénégal (Paris, 1757), where M. Adanson writes the name Bulin. The Latin (?) name on pl. 1 looks very much like Bulimus in consequence of the strokes of the \"n\" and \"u\" being confused. A brief account of this curious work may be useful. It is divided into two parts; the first of 190 pages is devoted to the \"Voyage au Sénégal;\" the second part is a \"Histoire des Coquillages,\" consisting of:\n\n1. Préface, 28 pp.; 2. Définitions des parties des coquillages, 32 pp. (a most useful series of observations well deserving of study); 3. Table des rapports ou des combinaisons autrement appelées systèmes ou arrangements méthodiques, 26 pp.; 4. Table chronologique des auteurs, 4 pp.; 5. Division générale, 4 pp.; 6. Coquillages (including index), 275 pp.; 7. Plates, 19 pp. At p. 5 of the Coquillages is a full description which extends to three pages of Le Bulin or Bulinus, from which only the first sentence need be cited, as it shows the author is dealing with a fresh-water shell. \"Je donne le nom de Bulin à un petit coquillage d'eau douce, qui vit communément sur la lentille de marais et sur le lemma, dans les marais et les étangs de Podor.\" Therefore Scopoli's genus, spelled differently, is justly regarded as new.\n\n† It is a curious feature in the Philippine and some of the Malay species that the varieties of pattern, which constitute their chief ornament, reside only in the epidermis. The colours of the shell rarely describe any sort of configuration; they are mostly blended into a uniform tint, over which a fanciful pattern is produced by the epidermis forming a double porous membrane in some places, and a single one only in others, developed, moreover, with the same continuous regularity as the textile marking of a Volute or Cone. This phenomenon is easily detected by immersing the shell in water, when the light portion or upper porous layer of epidermis becomes saturated, and the ground color of the shell is seen through it; as the moisture evaporates, the epidermis resumes its light appearance. Sir David Brewster, in reply to a letter from Mr. Broderip on this subject, says: \"It appears to me, from very careful observations, that the epidermis consists of two layers, and that it is only the upper layer which is porous wherever the pattern is white. These white or porous portions of the\nSection Amphidromus.\n\nBulimus loricatus, Pfr. Proc. Zool. Soc. 1854, p. 293; (Amphidromus) Pfr. Vers. p. 147; Mon. Hel. IV. p. 372.\n\nJava.\n\nB. perversus, L. = Helix perversa, L. Syst. Nat. 12th edit. Species, No. 136. Sub-umbilicate, ovate, oblong, often sinistral, colour various, but generally uniformly light green, lemon yellow, or white; or marked variously with spots or bands, such as a deep brown oblique streak, white with red spot, red lip, white lip, variously spotted with a bluish throat. This well-known and widely-spread shell which is found all through the Archipelago (Borneo?), Malay Peninsula, Moluccas and Burmah, was known to the early conchologists, twelve authorities being quoted by Linnaeus for this species and B. dextra, which is evidently a variety. It is unnecessary to reproduce the authorities which occupy nearly two pages of Pfeiffer's Mon. Hel. (Vol. III. p. 308). It is very common about Malacca, and on wet days especially may be gathered off the leaves of the trees where it is with difficulty distinguished on account of the similarity of its colour. Without quoting authorities, it may be mentioned that it has been known by the following names:—Bulimus, Helix, Limax, Orthostylus, perversa, dextra, sinistra, atricalllosa, interrupta, aurea, citrina, sultana, javanica, macassariensis.\n\nB. leucoxarthus, von Mart. = B. leucoxanthus, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 526 (Reeve, Bul. f. 187 b: dextra.); Ostas. Zool. II. p. 348, pl. 20, figs. 11-12 (sinistr.); Pfr. Mon. Hel. VI. p. 18.\n\nJava.\n\nepidermis differ from the other parts of the upper layer only in having been deprived of, or in never having possessed, the element which gives transparency to the membrane; in the same manner as hydrophanous opal has become white, from the expulsion of its water of crystallization.” Reeve, Conch. Icon. Bulimus.\nB. polymorphus (Cochlostyla), Tapp. Canefri = Cochlostyla polymorpha, Tapp. Canefri, Malac. del viaggio della fregata Magenta, 1874, p. 82, pl. 2, figs. 1 a-b. = Bulimus polymorphus, Pfr. Mon. Hel. VIII. p. 23. M. H. Crosse (Jour. Conch. 1874, p. 320) regards this species as only a variety of B. (Amphidromus) comes, Pfr. of Cambodia.\n\nSingapore.\n\nB. melanomma, Pfr. = Helix flammea, Chemn. IX. p. 94, fig. 927 = Bulimus inversus, Küst. pl. 6, fig. 3 (ex Chemn.) = B. citrinus, var. Reeve, Conch. Icon. pl. 31, fig. 187a = B. elongatus, Hombr. et Jacq. Voy. Pole Sud, Moll. pl. 8, figs. 3-4 (!) = B. melanomma. Pfr. Zeitsch. f. Malak. 1852, p. 95; Chemn. 2nd edit. Bul. No. 179, pl. 39, figs. 28-29; Pfr. Mon. Hel. III. p. 310.\n\nSingapore; Borneo.\n\nB. linstedti, Pfr. Proc. Zool. Soc. 1856, p. 388; Mon. Hel. IV. p. 374.\n\nMalacca.\n\nB. mundus, Pfr. Zeitschr. f. Malak. 1853, p. 57; Mon. Hel. III. p. 651; Chemn. 2nd edit. Bul. p. 373, pl. 70, figs. 21-22.\n\nSingapore.\n\nB. batavie (Partula), Grateloup, = Partula bataviae, Grat. Act. Bord. XI. p. 425, pl. 2, fig. 12 = Bulimus bataviae, Pfr. Mon. Hel. II. p. 40.\n\nJava.\n\nB. inversus, Müll. = B. inversus, Mouss. Jav. Moll. p. 107; Pfr. Zeitschr. f. Malak. 1849, p. 132; (Amphidromus) Albers, Helic. p. 138; (Helix) Pfr. Mon. Hel. III. p. 318.\n\nThis has been as long known as Bulimus perversus, and has had the same synonyms applied to it.\n\nMalacca; Singapore; Siam.\nB. winteri, Pfr. Zeitschr. f. Malak. 1849, p. 135; Chemn. 2nd edit. Bul. No. 177, pl. 40, figs. 3-4; Pfr. Mon. Hel. III. p. 319.\n\nJava.\n\nB. teysmanni, Mouss. MSS.; Pfr. Novit. Conch. IV. p. 32, No. 704, pl. 116, figs. 2-3; Mon. Hel. VIII. p. 40 = B. winteri, von Mart. Ostas. II. p. 353.\n\nMoluccas.\n\nB. heerianus, Mouss. MSS.; Pfr. Novit. Conch. IV. p. 31, No. 703, pl. 116, fig. 4 = B. winteri var. von Mart. Ostas. Moll. pl. 20, fig. 10 (!) = B. heerianus, Pfr. Mon. Hel. VIII. p. 40.\n\nMoluccas.\n\nB. palaceus, v. d. Busch, in litt.; Mouss. Jav. Moll. p. 28, pl. 3, fig. 1; Pfr. Zeitschr. f. Malak. 1849, p. 136; Mon. Hel. III. p. 320; Chemn. 2nd edit. Bul. No. 178, pl. 40, fig. 6; (Amphidromus), Alb. Helic. p. 138 = B. perversus, Pfr. Mon. Hel. II. p. 37.\n\nJava.\n\nB. purus, Mouss. Jav. Moll. p. 29, pl. 3, fig. 2; Pfr. Novit. Conch. IV. p. 33, No. 705, pl. 116, fig. 6 = B. palaceus, Pfr. Mon. Hel. III. p. 320 = B. winteri, von Mart. Ostas. Moll. p. 354, ex parte = B. purus, Pfr. Mon. Hel. VIII. p. 41.\n\nJava.\n\nB. emaciatus (Amphidromus), von Mart. Ostas. Zool. II. p. 347, pl. 20, fig. 7; Pfr. Mon. Hel. VI. p. 25.\n\nJava; Bali.\n\nB. appressus, Mouss. in coll.; Pfr. Mon. Hel. VI. p. 26, No. 213b. (ex v. Mart.); (Amphidromus) von Mart. Ostas. Moll. p. 353; Pfr. Novit. Conch. IV. p. 34, No. 706, pl. 116, figs. 4-5; Mon. Hel. VIII. p. 42.\n\nJava.\n\nB. levus, Müll. = Helix lava, Müll. Verm. II. p. 95, No. 293; Chemn. IX. P. I., p. 103, pl. 111, figs. 940-49; Gmel. p. 3644,\nNo. 100; Dillw. Descr. Cat. II. p. 935, No. 112; (Cochlogena) Férv. pr. 416 = H. perversa, Gmel. p. 3643 (e fig. Kämmer.) = Bulimus laevus, Brug. Enc. Méth. I. p. 317, No. 31; Quoy et Gaim. Astrol. II. p. 120, pl. 10, fig. 4; Lamarck, Desh. edit. 80, p. 260; Küster, p. 15, pl. 9, figs. 7-16 = Orthostylus laevus, Beck, Ind. p. 50, No. 15; Kämmerer, p. 125, pl. 10, fig. 3 = B. laevus, Pfr. Mon. Hel. II. p. 39.\n\nTimor.\n\nB. suspectus, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 526; Ostas. Zool. II. p. 362, pl. 21, fig. 8; Pfr. Mon. Hel. VI. p. 27.\n\nKupang, Timor.\n\nB. sumatranus, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 526; Ostas. Zool. II. p. 366, pl. 21, fig. 6; Pfr. Mon. Hel. VI. p. 27.\n\nSumatra.\n\nB. sinistralis, Reeve, Conch. Icon. No. 603, pl. 81; Chemn. 2nd edit. Bul. No. 181, pl. 41, figs. 11-13 = B. laevus, var. Desh. in Férv. Hist. pl. 161, figs. 11, 14-18 = B. sinistralis, Pfr. Mon. Hel. III. p. 321.\n\nCelebes; Timor.\n\nB. contrarius, Müller, = Helix contrarius, Müll. Verm. II. p. 95, No. 292 (Swamm. pl. 7, No. 11); Gmel. Syst. p. 3644, No. 99; Férv. Voy. Freyc. p. 474, pl. 67, figs. 8-9 = H. interrupta sinistrorsa, Chemn. IX. p. 101, figs. 938-939 = Bulimus contrarius, Pfr. Mon. Hel. III. p. 327.\n\nMacassar; Timor; Java.\n\nB. porcellanus, Mouss. Jav. Moll. p. 33, pl. 3, fig. 4; (Amphidromus), Alb. Helic, p. 139; Chemn. 2nd edit. Bul. No. 182, pl. 41, figs. 14-15; Pfr. Mon. Hel. III. p. 328.\n\nJava.\n\nB. adamsii, Reeve, Conch. Icon. No. 73, pl. 13; Adams and Reeve, Voy. Samarang, Moll. p. 58, pl. 15, fig. 1; Chemn. 2nd\nedit. Bul. No. 105, pl. 31, figs. 11-12; Pfr. Nonnen. Hel. p. 214, No. 300.\n\nBorneo.\n\nFamily BULIMINIDA.\n\n13. Bulimina, Ehren. Symb. Phys. Oken Isis, 1833, p. 734, sub-genus, Chilodontis.\n\nShell solid, rimate, oblong conical, or fusiformly cylindrical; apex obtuse, horny, last whorl shorter than spire; aperture small, oblique, oval; peristome straight, labiate within, simple or dentate; lip rather expanded, columella reflexed and spread.\n\nAnimal similar to Bulimus, jaw arcuate and finely striate lengthwise; radula like Helix. About 350 species, which are divided into about a dozen sub-genera, of which four only belong to America or about an eighth of the species; the rest are in Europe and western Asia, with a few extending into the Indian Archipelago, belonging as far as known to the sub-genus Ena.\n\nBulimina lorraini, Pfr. = Bulimus lorraini, Pfr. Proc. Zool. Soc. 1856, p. 332; Mon Hel. IV. p. 468.\n\nPenang.\n\nB. spilozona, von Mart. = Bulimus (Rhachis) spilozonus, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 527; Ostas. Zool. II. p. 368, pl. 21, fig. 13; Pfr. Mon. Hel. VI. p. 112.\n\nCelebes; Timor.\n\nB. gregaria, Ad. and Reeve, = Bulimus gregarius, Ad. and Reeve, Voy. Samarang, Moll. p. 58, pl. 14, fig. 4; Reeve, Conch. Icon. No. 612, pl. 83 (aliquantulum auct.); Pfr. Mon. Hel. III. p. 351.\n\nBorneo; Japan.\n\nB. glandula, Mouss. = Bulimus glandulus, Mouss. Jav. Moll. p. 34, pl. 4, fig. 3; Pfr. Mon. Hel. III. p. 353.\n\nJava.\nB. APERTA, von Mart. = Pupa aperta, von Mart. Malak. Bl. X. 1863, p. 180 = Buliminus apertus (Napaeus), von Mart. Ostas. Zool. II. 370, pl. 22, fig. 6 = Bulimus apertus, Pfr. Mon. Hel. VI. p. 61.\n\nTimor.\n\n14. STENOZYRA, Shuttleworth, Diagnosis Nov. Moll. No. 6, p. 137.\n\nShell elongate, turriculate; whorls numerous; apex obtuse or truncate; aperture oval, small; columella thin, straight; peristome simple, sharp.\n\nAnimal like Achatina. Jaw finely plicate or ribbed; radula with median tooth, very small; laterals tricuspid with a rather long central cusp; marginals short, tricuspid. About 250 species, of world-wide distribution. The species of the Malayan region belong to the section Opeas, in which the shell is small, thin, subulate, covered with small ribs.\n\nSTENOZYRA GRACILIS, Hutton, Jour. As. Soc. Beng. III. p. 84 = Bulimus gracilis, Hutton, l.c. = B. indicus, Pfr. Mon. Hel. II. p. 157; Chemn. pl. 21, figs. 18-19 = B. apex, Mouss. = Spiraxis gracilis, Blanford, Contrib. Ind. Malac. = Bulimus cereus, Reeve, Conch. Icon. Achatina, pl. 17, fig. 81.\n\nJava; Bukit Pondok, Perak.\n\nS. (Subulina) TCHEHELENSIS, De Morgan, Le Naturaliste, 1885, p. 69 = S. (Opeas) terebralis (?), Theobald (? n.sp.), G. Nevill, Handl. Moll. Ind. Mus. 1878, p. 166; O. F. von Möllendorff, Jour. As. Soc. Beng. LV. p. 304.\n\nThis is a fine subulate shell, more than an inch long with 10 or 12 whorls.\n\nMount Chehel, near the River Plus and Bukit Pondok, Perak.\n\nS. ARCTISPIRA (OPEAS), von Mart. Ostas. Zool. II. p. 374, pl. 22, fig. 10 = Bulimus arctispirus, Pfr. Mon. Hel. VI. p. 102.\n\nJava.\nS. densespirata, Mouss. = Bulimus densespiratus, Mouss. Jour. Conch. VI. 1857, p. 159; Pfr. Mon. Hel. IV. p. 497.\n\nBuitenzorg, Java.\n\nS. acutissima, Mouss. = Bulimus acutissimus, Mouss. Jour. Conch. VI. 1857, p. 159; Pfr. Mon. Hel. IV. p. 453.\n\nBuitenzorg, Java.\n\nS. laxispira, von Mart. Ostas. Zool. II. p. 373, pl. 22, fig. 14 = Bulimus laxispirus, Pfr. Mon. Hel. VI. p. 92.\n\nSumatra.\n\nS. hochstetteri, Zelebor, = Bulimus hochstetteri, Zeleb. Reise der Freg. \"Novara;\" Pfr. Mon. Hel. VI. p. 107.\n\nJava.\n\nS. achatinacea, Pfr. = Bulimus achatinaceus, Pfr. Symb. III. p. 82; Mon. Hel. II. p. 156.\n\nJava; Borneo.\n\n15. Rhodina, De Morgan, Le Naturaliste, 1885, p. 68.\n\nShell cylindraceous, striate; whorls numerous, last much larger; aperture triangular; columella reflected, very prominent; peristome continuous.\n\nM. de. Morgan has founded this new genus for a curious shell like Stenogyra. He thinks it is related to Rhodea by the absence of keel and the cornet-like aperture.\n\nRhodina perakensis, De Morgan, l.c.\n\nShell cylindrical, fragile, horny, yellow, with 10 regularly increasing whorls very regularly and distinctly striate, the suture linear and well marked; the aperture triangular, oblique; peristome thin, not reflected.\n\nLong. 25, diam. of last whorl $4\\frac{1}{2}$, long. of aperture 5, lat. 3 mill.\n\nLimestone rocks of Gunong Tcheura, near Ipoli, Kinta Valley, under dead leaves.\nFamily CIONELLIDA.\n\n16. GLESSULA, Albers, Helic. p. 194.\n\nShell ovate, oblong; thin translucent; spire pyramidal; apex obtuse; whorls numerous, last inflated; columella short, arcuate, abruptly truncate.\n\nFifty-nine species in India, Malayan region, and West Africa.\n\nGLESSULA WALLACEI, Pfr. = Achatina wallacei (Electra), Pfr. Malak. Bl. 1855, p. 168; Novit. Conch. I. p. 82, No. 140, pl. 22, figs. 9-10; Mon. Hel. IV. p. 606.\n\nSarawak, Borneo.\n\nG. SUMATRANA, von Mart. = Achatina sumatrana, von Mart. Ostas. Zool. II. pl. 22, fig. 5 = Cionella sumatrana, von Mart. Monats. Berl. Ak. 18th July, 1864, p. 527 = Achatina sumatrana, Pfr. Mon. Hel. VI. p. 225.\n\nSumatra.\n\nG. JAVANICA, Reeve; = Achatina javanica, Reeve, Conch. Icon. No. 79, pl. 17; Pfr. Mon. Hel. III. p. 493.\n\nJava.\n\nFamily PUPIDA.\n\n17. PUPA, Lamarck, Syst. Anim. s. Vert. 1st edit. p. 88.\n\nShell usually very small, cylindrical or oval oblong; umbilicus slight or a mere slit, striate, plicate or ribbed, brown or horn-colour; columella plaited or sub-dentate; lip reflected, dentate or plaited within; peristome joined usually by a callosity.\n\nAnimal with a short foot, pointed behind, lower tentacles short; jaw smooth or finely striated, often with a superior appendage like Succinea.\n\nRadula resembling Helix; the central and lateral teeth similar, tricuspid; marginals very short and denticulated.\nPupa ascendens, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 528; (Anostomella), Ostas. Zool. II. p. 386, pl. 22, fig. 23; Pfr. Mon. Hel. VI. p. 297.\n\nAmboyna.\n\nP. orcella (Pupisoma), Stol. Jour. As. Soc. Beng. XLII. 1873, p. 33, pl. 3, fig. 2; Pfr. Mon. Hel. VIII. p. 358.\n\nPenang.\n\nP. moreleti, A. D. Brown, Jour. Conch. XVIII. 1870, p. 393 = Vertigo moreleti, Issel, Moll. Born. p. 52 = Pupa moreleti, Pfr. Mon. Hel. VIII. p. 391.\n\nLabuan.\n\nP. malayana, Issel, = Vertigo malayanus, Issel, Moll. Born. 1874, p. 53, pl. 5, figs. 30-32 = Pupa malayana (Vertigo), Pfr. Mon. Hel. VIII. p. 404.\n\nBorneo.\n\nP. palmira (Scopelophila), Stol. Jour. As. Soc. Beng. XLII. 1873, p. 32; Pfr. Mon. Hel. VIII. p. 409.\n\nPenang.\n\n18. Hypselostoma, Benson.\n\nAnn. and Magaz. Nat. Hist. 1856, Feb. p. 130, also, Ap. p. 342; H. and A. Adams, Gen. II. p. 640. = Tanystoma, Benson, l.c.\n\nShell convolute, conical, perforate, last whorl free, opening upwards, protracted; aperture trumpet-like and dentate; peristome horizontal, expanded.\n\nThree species collected in Burmah.\n\nHypselostoma bensonianum, W. Blanford, Contr. Ind. Mal. IV. 1863, p. 8; Pfr. Mon. Hel. V. 1868, p. 437; Conch. Indica, pl. 8, fig. 2; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 306.\n\nPerak.\n19. *Clausilia*, Draparnaud, Hist. Nat. d. Moll. terrest. et fluv. pp. 24, 29, 68.\n\n*Shell* fusiform, usually sinistral: aperture elliptical or pyriform with a posterior sinus contracted by lamellæ closed when adult by a moveable shelly plate (*Clausilium*); peristome continuous, reflected.\n\n*Animal* with a short obtuse foot; upper tentacles short, lower small; lung and reproductive orifices on the left side; jaw finely grooved.\n\n*Radula* like *Helix*, but both rows very numerous, sometimes as many as $120 \\times 50$. About 700 species, of world-wide distribution. The peculiarity of the genus is the *Clausilium*, which is developed in the adult state. The animal secretes an elastic calcareous filament attached to the columella, round which it makes a half turn. At the free end is a spoon-shaped lamina, smaller than the aperture, but fitting it. Its elasticity enables the animal to push it on one side when walking, and to use it as a door when within the shell, securing it against intrusion.\n\n*Clausilia moluccensis*, von Mart. Monatsber. Berl. Ak. Apr. 1864, p. 270; (*Phaedusa*), Ostas. Zool. II. p. 381, pl. 22, fig. 19; Pfr. Mon. Hel. VI. p. 412.\n\nHalmahera; Ternate.\n\n*Cl. penangensis* (*Phaedusa*), Stol. Jour. As. Soc. Beng. XLII. 1873, p. 27, pl. 3, figs. 4-6; Pfr. Mon. Hel. VIII. p. 465.\n\nPenang Hill.\n\n*Cl. sumatrana*, von Mart. Monatsber. Berl. Ak. April, 1864, p. 270; (*Phaedusa*), Ostas. Zool. II. p. 379, pl. 22, fig. 17; Pfr. Mon. Hel. VI. p. 410.\n\nSumatra.\n\n*Cl. heldii*, Küst. p. 27, pl. 2, figs. 29-31 = *Cl. javana*, Pfr. Mon. Hel. II. p. 405.\n\nJava.\nCl. javana, Pfr. Symb. I. p. 49; Küst. p. 26, pl. 1, figs. 26-28 = Cl. heldii, Küst. p. 27, pl. 2, figs. 29-31 = Cl. javana, Pfr. Mon. Hel. II. p. 405.\n\nJava.\n\nCl. corticina, v. d. Busch, MSS.; Pfr. Symb. II. p. 60; Küst. p. 26, pl. 2, figs. 24-25; Pfr. Mon. Hel. II. p. 404.\n\nJava.\n\nCl. borneensis, Pfr. Proc. Zool. Soc. 1854, p. 296; (Phaedusa), Pfr. Vers. p. 181; Mon. Hel. IV. p. 736.\n\nBorneo.\n\nCl. junghuhni, Phil. in Küst. Mon. p. 23, pl. 2, figs. 5-7; Pfr. Mon. Hel. II. p. 405.\n\nJava.\n\nCl. cornea, Phil. in Küst. Mon. p. 22, pl. 2, figs. 1-4; Pfr. Mon. Hel. II. p. 405.\n\nJava.\n\nCl. excurrens, von Mart. Monatsber. Berl. Ak. 18th July, 1864, p. 527; Ostas. Zool. II. p. 384, pl. 22, fig. 16; Pfr. Mon. Hel. VI. p. 480.\n\nKepahiang, Sumatra.\n\nCl. filicostata (Phaedusa), Stol. Jour. As. Soc. Beng. XLII. 1873, p. 28, pl. 3, figs. 7-8; Pfr. Mon. Hel. VIII. p. 471.\n\nPenang Hill.\n\nCl. obesa (Phaedusa), von Mart. Ostas. Zool. II. p. 380 (not Pfr.) = Cl. obesa, Pfr. Mon. Hel. VI. p. 411.\n\nIndian Archipelago.\n\nCl. orientalis, v.d. Busch, MSS.; Pfr. Symb. II. p. 60; Küst. p. 25, pl. 2, figs. 17-19; Pfr. Mon. Hel. II. p. 414.\n\nJava.\n\nCl. schwaneri, Herklots, Mus. Lugd. Bat.; (Phaedusa), von Mart. Ostas. Zool. II. p. 382; Pfr. Mon. Hel. VI. p. 468.\n\nBorneo.\nCL. (Pseudonenia) filicostata, Stol. Jour. As. Soc. Beng. XLII. 1873, p. 28, pl. 3, figs. 7-8; var. tenuicosta, G. Nevill, Handl. Moll. Ind. Mus. 1878, p. 183; H. Crosse, Jour. Conch. XXVIII. 1879, p. 337; O. F. von Möll. Jour. As. Soc. Beng. LV. 1886, p. 306.\n\nBukit Pondok, Perak.\n\n\"The few badly preserved specimens which Dr. Hungerford found seem to justify Nevill's classification of the Perak form as a variety of the Penang Cl. filicostata.\" O. F. von Möll. l.c.\n\nFamily SUCCINEIDEA.\n\nThe shells of this family are thin, horny, oval, oblong; spire only slightly developed, mouth very wide, oval; columella simple not truncate, peristome with a thin edge.\n\n20. Succinea, Draparnaud, Tableau Moll. pp. 32, 55.\n\nShell imperforate, thin, ovate or oblong; spire small; aperture large, obliquely oval; columella and peristome simple, acute.\n\nAnimal large, tentacles short and thick, foot broad; lingual teeth like Helix. Inhabits damp places, but rarely enters the water.\n\nSuccinea borneensis, Pfr. Proc. Zool. Soc. 1851; Mon. Hel. III. p. 11.\n\nBorneo.\n\nS. taylori, Pfr. Proc. Zool. Soc. 1851; Mon. Hel. III. p. 10.\n\nSingapore.\n\nS. subrugata, Pfr. Proc. Zool. Soc. 1851; Mon. Hel. III. p. 10.\n\nBorneo.\n\nS. obesa, von Mart. Ostas. Zool. II. p. 387, pl. 22, fig. 21; Pfr. Mon. Hel. V. p. 463.\n\nEast Java.\nS. GRACILIS, Lea, Proc. Amer. Phil. Soc. 1841, II. p. 31; Pfr. Mon. Hel. II. p. 518.\n\nJava (?).\n\nS. MINUTA, Mouss. Zolling. in Peterm. Geog. Mittheil. 1864, H. VIII. p. 303 (Nomen); Mart. Ostas. Zool. II. p. 388; Pfr. Mon. Hel. V. p. 464.\n\nBali.\n\nFamily CYCLOPHORIDÆ.\n\nThe Cyclophoridae have heliciform shells with a circular opening, and covered with a thick periostraca; operculum calcareous or horny, spiral with numerous whorls.\n\nAnimal with long, slender, pointed tentacles, foot broadly expanded, not grooved.\n\n21. CYCLOTUS, Guilding.\n\nConchological Papers, by L. Guilding. See Swainson, \"Shells and Shell-fish,\" pp. 182 and 336.\n\nShell nearly discoid; pillar none; spire scarcely raised; lip thickened; widely umbilicate; operculum shelly; whorls numerous with raised margins. 44 species, mostly tropical.\n\nCYCLOTUS HUNGERFORDIANUS, O. von Möll. Jour. As. Soc. Beng. LV. 1886, p. 306.\n\nBukit Pondok, Perak.\n\nC. (?) DISCOIDEUS, Sowerby = Cyclostoma discoideum, Sow. Thes. N. 60, p. 111, pl. 25, figs. 87-88; Chemn. 2nd edit. Cycl. No. 153, p. 144, pl. 20, figs. 1-3; Mouss. Jav. Moll. p. 50, pl. 20, fig. 10 = Aperostoma discoideum, Pfr. in Zeitschr. f. Malak. 1847, p. 104 = Cyclotus discoideus, Gray, Catal. Cycloph. p. 8, No. 11; Pfr. Consp. No. 36; Mon. Pneumon. Viv. p. 36.\n\nMalang, Java.\n\nC. OPALINUS, Mouss. = Cyclostoma opalinum, Mouss. Jav. Moll. p. 51, pl. 5, fig. 12 = Cyclotus opalinus, Pfr. Consp. No. 37; Mon. Pneumon. p. 36.\n\nMalang, Java.\nC. corniculum, Mouss. = Cyclostoma corniculum, Mouss. Jav. Moll. p. 51, pl. 5, fig. 11 = Cyclotus corniculum, Pfr. Consp. No. 40; Mon. Pneumon. p. 38.\n\nPardana, Java.\n\nC. taylorianus, Pfr. = Cyclostoma taylorianum, Pfr. Zeitschr. f. Malak. 1851, p. 7; Chemn. 2nd edit. Cycl. No. 285, pl. 38, figs. 27-29, pl. 43, figs. 1-3 = Cyclotus taylorianum, Pfr. Mon. Pneumon. p. 40.\n\nSarawak, Borneo.\n\nC. rostellatus, Pfr. = Cyclostoma rostellatum, Pfr. Zeitschr. f. Malak. 1851, p. 8; Chemn. 2nd edit. Cycl. No. 286, pl. 38, figs. 30-34 = Cyclotus rostellatus, Pfr. Mon. Pneumon. p. 40.\n\nSingapore.\n\nC. lindstedti, Pfr. = Cyclostoma lindstedti (Cyclotus), Pfr. Proc. Zool. Soc. 1856, p. 391 = Cyclotus lindstedti, Pfr. Mon. Pneumon. Suppl. I. p. 24.\n\nMount Ophir, Malacca.\n\nC. ptychoraphe, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 15.\n\nBorneo.\n\nC. (?) parvulus, von Mart. Malak. Bl. X. 1863, p. 85; Pfr. Mon. Pneumon. Suppl. II. p. 17.\n\nTernate; Tidore.\n\nC. reticulatus, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 17.\n\nTimor; Flores; Adenare and Solor.\n\nC. succinctus, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 17.\n\nTimor.\n\nC. liratulus, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 27.\n\nMoluccas.\nC. BICARINATUS, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 27.\n\nCeram.\n\nC. CARINULATUS, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 28.\n\nBuru.\n\nC. PRUINOSUS, von Mart. Malak. Bl. X. 1863, p. 83; Pfr. Mon. Pneumon. Suppl. II. p. 34.\n\nAnimal black. Common in the islands of Molucca, Ternate, Tidore, and Moti.\n\nC. BATCHIANENSIS, Pfr. Proc. Zool. Soc. 1861, p. 28, pl. 3, fig. 1; Mon. Pneumon. Suppl. II. p. 35; Reeve, Conch. Icon. sp. 46, pl. 8.\n\nBatchian.\n\nC. LATISTRIGUS, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 35.\n\nBorneo.\n\nC. FASCIATUS, von Mart., Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 35.\n\nCelebes.\n\nC. FULMINULATUS, von Mart. Monatsber. Berl. Ak. 16 Jan. 1865, p. 21; Pfr. Mon. Pneumon. Suppl. III. p. 27 = Cyclopus politus, von Mart. Malak. Bl. XI. 1864, p. 141 (not Sowerby).\n\nCelebes.\n\nC. LONGIPILOTUS, von Mart. Monatsber. Berl. Ak. 16 Jan. 1865, p. 51; Pfr. Mon. Pneumon. Suppl. III. p. 28.\n\nMaros, Celebes.\n\nC. AMBOINENSIS (Cyclostoma), Pfr. Mon. Pneumon. Suppl. III. p. 32; von Mart. Ostas. Zool. II. p. 121, pl. 2, figs. 4-5 = Cyclostoma amboinense, Pfr. 1852, = (?) Cyclophorus amboinensis, Pfr. Mon. Pneumon. p. 82, No. 49 = Cyclophorus marmoratus, Fé. Pfr. Mon. Pneumon. p. 68 (Martens).\n\nAmboyna; Ceram; Buru.\n22. Opisthoporos, Benson.\n\nZeitschr. f. Malak. 1851, p. 8; Pfr. Mon. Pneumon. Viv. Suppl. III. p. 41; Zeitschr. f. Malak. 1851, p. 8; Pfr. Mon. Pneumon. Viv. Suppl. I. p. 25, II. p. 36.\n\nShell depressed, orbicular, largely umbilicate; aperture double, with the external parts spread out; suture behind the opening and furnished with a little open tube; operculum calcareous, circular, rather thick, concave at both sides, multispiral, double; the internal side covered with a horny periostraca, the external calcareous and rough; columella margin concave.\n\nOpisthoporos solutus, Stol. Jour. As. Soc. Beng. XLI. 1872, p. 266, pl. 10, figs. 8-10; Pfr. Mon. Pneumon. Suppl. III. 1876, p. 44; G. Nevill, Handl. Moll. Ind. Mus. 1878, p. 263; H. Crosse, Jour. Conch. XXVII. 1879, p. 337.\n\nBukit Pondok; Penang.\n\nO. penangensis, Stol. l.c. 1872, p. 265, pl. 10, fig. 7; Pfr. Mon. Pneumon. Suppl. III. 1876, p. 43; G. Nevill, Handl. 1878, p. 263; H. Crosse, Jour. Conch. XXVII. 1879, p. 338.\n\nBukit Pondok; Penang.\n\nO. javanus, Pfr. Malak. Bl. VII. 1860, p. 215, pl. 3, figs. 8-10; Mon. Pneumon. Suppl. II. 1865, p. 37.\n\nNungnang, Java.\n\nO. sumatranus, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. 1865, p. 37.\n\nSumatra.\n\n(? ) O. spiniferus (Cyclostoma), Morelet, = Cyclostoma spiniferum, Morelet, Jour. Conch. IX. 1861, p. 177 = Opisthoporos spiniferus, von Mart. Ostas. Zool. II. p. 113; Pfr. Mon. Pneumon. Suppl. III. p. 41.\n\nBorneo.\n\nO. pertusus (Cyclostoma), Morelet; Issel, Moll. Born. p. 75; Pfr. Mon. Pneumon. Suppl. III. p. 43 = Cyclostoma pertusum, Morelet, Jour. Conch. IX. 1861, p. 177.\n\nBorneo.\n23. Pterocyclos, Benson.\n\nJour. Roy. As. Soc. I. 1832 and V. 1836; Zoological Journ. V. No. 20, p. 462.\n\nShell sub-discoid, largely umbilicate; aperture circular, the external layer overlapping the inner and dilated posteriorly with a distinct groove at the suture; operculum thick, composed of several spiral calcareous layers externally concave and horny within.\n\nA small genus characteristic of the Indian region.\n\nPterocyclos albersi, Pfr. Zeitschr. f. Malak. 1847, p. 151; Chemn. 2nd edit. Cyclostoma, p. 197, pl. 28, figs. 1-5; Pfr. Mon. Pneumon. p. 45.\n\nPerak; Kinta Valley (!), Selama (!).\n\nPt. brevis (Lituus), Martyn, = Lituus brevis, Martyn, Fig. of non-described shells, pl. 28c; Ed. Chenu (Bibl. Conch. II.) p. 21, pl. 8, fig. 2 = Turbo petiverianus, Wood, Suppl. pl. 6, fig. 2 = Cyclostoma petiverianum, Gray in Wood's Suppl. p. 36 = Cyclostoma breve, Pfr. in Chemn. 2nd edit. No. 180, p. 166, pl. 24, figs. 1-2 = Myxostoma petiverianum, Trosch. in Zeitschr. f. Malak. 1847, p. 44 = Pterocyclos brevis, Pfr. Zeitschr. f. Malak. 1851, p. 9; Consp. No. 46; Mon. Pneumon. p. 42.\n\nIndia; Pulo Condor.\n\nPt. planorbulus, Lamarck, = Corom renatorium, Chemn. Cab. IX. p. 104, pl. 127, figs. 1132-33 (?) = Cyclostoma planorbula, Lamarck, Encycl. Méth. pl. 461, fig. 3 = Cyclotus planorbulus, Swains. Malacol. p. 336 = Pterocyclos planorbulus, Pfr. Consp. No. 47; Mon. Pneumon. p. 43.\n\nJava (?); Borneo (?).\n\nPt. tenuilabiatus, Metc.; Pfr. Mon. Pneumon. p. 45 = Cyclostoma tenuilabiatum, Metc. Proc. Zool. Soc. 1851.\n\nBorneo.\n\nPt. blandi, Benson, Ann. and Magaz. VIII. 1851, Aug. pl. 5, fig. 1; Pfr. Mon. Pneumon. p. 49.\n\nPulo Susson.\nPt. (?) *Spiracellum*, A. Ad. and Reeve; Pfr. Mon. Pneumon. p. 50 = *Cyclostoma spiracellum*, A. Ad. and Reeve, Voy. Samar. Moll. p. 56, pl. 14, fig. 1; Pfr. Mon. Pneumon. p. 50.\n\nBorneo.\n\nPt. *Labuanensis*, Pfr. Proc. Zool. Soc. 1863; Mon. Pneumon. Suppl. II. p. 41.\n\nLabuan.\n\nPt. *Lowianus*, Pfr. Proc. Zool. Soc. 1863; Mon. Pneumon. Suppl. II. p. 41.\n\nLabuan.\n\nPt. *Sumatranus*, von Mart. Monatsber. Berl. Ak. 25 Feb. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 42.\n\nSumatra.\n\nPt. *Batchianensis*, Reeve, Conch. Icon. sp. 6, pl. 2; Pfr. Mon. Pneumon. Suppl. II. p. 43.\n\nBatchian.\n\nPt. (?) *Eudaedaleus*, Crosse, Jour. Conch. XVII. 1869, p. 187; Pfr. Mon. Pneumon. Suppl. III. p. 51.\n\nBorneo.\n\n24. *Spiraculum*, Pearson, 1833, Jour. R. As. Soc. II. p. 391; H. and A. Adams, Genera, p. 278.\n\nShell depressed, sub-discoid, with a thick periostraca, which is sometimes covered with small hairs; aperture circular; at the last whorl a sutural tube formed by the union of the outer layer of the shell over the channel on the penultimate whorl. By most authors this is regarded as a sub-genus of *Pterocyclos*.\n\n*Spiraculum (?) Regelspergeri*, de Morgan, Le Naturaliste, VII. 1885, No. 9, p. 69 (*Cyclophorus*); O. von Möllendorff, Jour. As. Soc. Beng. LV. 1886, p. 308.\n\nThe last-named author says (l.c.) that the species is decidedly not a *Cyclophorus* but a *Pterocyclos*, which might be related to\nPl. albersi, Pfr., on account of the curious canaliculated suture. He adds: \"De Morgan's mention of a tube, and of the fine membranaceous lamellae of the operculum to render its fitting more hermetic, suggest a Spiraculum or Rhiostoma;* but against the inclusion in the latter genus, it may be mentioned that the last whorl is not free.\"\n\nEnviron of Lahat and Pappan; Kinta Valley; Larut.\n\nI collected three specimens, one on the road between Lahat and Goping, one at the mouth of the Diepang River, and one at Pappan, all in Perak.\n\nS. kintanum, De Morgan, l.c. 1885, p. 69 = Cyclophorus kintanum, De Morgan, l.c. = Spiraculum kintanum, O. v. Möll. Jour. As. Soc. Beng. LV. p. 308.\n\nKinta Valley.\n\n25. Cyclophorus, Montfort, Conch. Syst. II. p. 290.\n\nShell globose, turbinate or depressed and discoid, well umbilicated; peristome entire, thick, double, and reflected; periostreae thick; operculum horny, orbicular, thin, multispiral.\n\nA large genus, which formerly included nearly 200 species, but has now been sub-divided into several genera. Even after this Pfeiffer enumerated about 250 species. They are principally tropical and Indian, but some of the species are particularly characteristic of the Malayan region.\n\nCyclophorus confluens, Pfr. Proc. Zool. Soc. 1860, p. 140; Reeve, Conch. Icon. sp. 69, pl. 15; Pfr. Mon. Pneumon. Suppl. II. p. 60.\n\nBorneo.\n\n*It should be noted that in Chenu's \"Manuel de Conchyliologie\" the genus is always written Registoma, possibly Van Hasselt's genus, the etymology of which is ῥηγνύ and στόμα, but the derivation of Rhiostoma is from ἐπίον, a promontory.\nC. bankanus, von Mart. Ostas. Zool. II. p. 135; Pfr. Mon. Pneumon. Suppl. III. p. 101.\n\nBanka Island.\n\nC. malayanus, Benson, = Cyclostoma malayanum, Bens. Ann. and Mag. Nat. Hist. 2nd series, X. p. 269 = Cyclostoma volvulus (trochiforme, Lamarck), Souley. Voy. Bonite, Moll. pl. 30, figs. 18-21 = Cyclotus (?) trochiformis, M. E. Gray, Fig. Moll. Anim. pl. 303, fig. 11 (ex Souley.) = Cyclophorus malayanus, Pfr. Malak. Bl. 1854, p. 82; Mon. Pneumon. Suppl. I. p. 42.\n\nMalayan Peninsula.\n\nC. debeauxi, Crosse, Jour. Conch. XII, 1864, p. 42; Pfr. Mon. Pneumon. Suppl. II. p. 62.\n\nSingapore.\n\nC. tuba, Sow. = Cyclostoma tuba, Sow. Proc. Zool. Soc. 1843, p. 83; Chemn. 2nd edit. Cyc. No. 183, p. 169, pl. 23, tigs. 10-11; Souley. Voy. Bonite, Moll. pl. 30, figs. 25-27 = Cyclophorus tuba, Pfr. Zeitschr. f. Malak. 1847, p. 107; Consp. No. 68; Mon. Pneumon. p. 57; Gray, Catal. Cycloph. p. 16, No. 3.\n\nMount Ophir, Malacca.\n\nC. pfeifferi, Reeve, Conch. Icon. sp. 11, pl. 3; Pfr. Mon. Pneumon. Suppl. II. p. 64.\n\nPulo-Penang.\n\nC. borneensis, Metc. = Cyclostoma borneense, Metc. Proc. Zool. Soc. 1851; Chemn. 2nd edit. Cycloph. No. 384, pl. 47, figs. 1-3 = Cyclophorus borneensis, Pfr. Mon. Pneumon. p. 63.\n\nBorneo.\n\nC. perdix, Brod. and Sow. = Cyclostoma perdix, Brod. and Sow. Zool. Jour. V. p. 50 = Cyclostoma variegatum, Val. Mus. Paris = Cyclostoma aglae, Sow. test. Mouss. Jav. Moll. p. 54 = Cyclophorus perdix, Pfr. Zeitschr. f. Malak. 1847, p. 107; Mon. Pneumon. p. 63.\n\nJava.\n\nC. zollingeri, Mouss. = Cyclostoma zollingeri, Mouss. Jav. Moll. p. 55, pl. 7, fig. 2 = Cyclophorus zollingeri, Pfr. Mon. Pneumon. p. 64.\n\nJava.\nC. cantori, Bens. = Cyclostoma cantori, Bens. Ann. and Mag. Nat. Hist. 2nd ser. VIII. p. 168; Chemn. new edit. p. 383, pl. 50, figs. 4-8 = Cyclophorus cantori, Pfr. Mon. Pneumon. p. 65; Mon. Pneumon. Suppl. I. p. 49; Gray, Cat. Phan. p. 44; H. and A. Adams, Genera II. p. 279.\n\nPenang.\n\nC. eximius, Mouss. = Cyclostoma eximium, Mouss. Jav. Moll. p. 53, pl. 7, fig. 1; Chemn. 2nd edit. No. 227, pl. 33, figs. 1-2 = Cyclophorus eximius, Pfr. Mon. Pneumon. p. 69.\n\nJava.\n\nC. belulus, von Mart. Monatsber. Berl. Ak. 16 Jan. 1865, p. 52; Issel, Moll. Born. p. 69; Pfr. Mon. Pneumon. Suppl. III. p. 106.\n\nWest Borneo.\n\nC. oculus capri, Wood, = Helix oculus capri, Wood, Ind. pl. 32, fig. 7 = Cyclostoma oculus capri, Gray, Mus. Brit.; Reeve, Conch. Syst. pl. 184, fig. 11; Sow. Thes. No. 73, p. 115, pl. 25, fig. 96; Chemn. 2nd edit. No. 18, p. 26, pl. 3, figs. 5-6; Mouss. Jav. Moll. p. 52, pl. 6, fig. 2 = Cyclostoma rafflesii, Brod. and Sow. Zool. Journ. V. p. 50 = Cyclostoma indicum, Phil. Abbild. I. 5, p. 103, pl. 1, fig. 2 = Cyclophorus oculus capri, Gray, Catal. Cycloph. p. 20, No. 23; Pfr. Mon. Pneumon. p. 87.\n\nJava; Sumatra.\n\nC. semisulcatus, Sow. = Cyclostoma semisulcatum, Sow. Proc. Zool. Soc. 1843, p. 62; Chemn. 2nd edit. No. 81, p. 86, pl. 11, figs. 1-2 = Cyclophorus semisulcatus, Gray, Catal. Cycloph. p. 20, No. 24; Pfr. Mon. Pneumon. p. 88.\n\nMalacca.\n\nC. charpentieri, Mouss. = Cyclostoma charpentieri, Mouss. Jav. Moll. p. 56, pl. 6, fig. 3; Mörch, Catal. Conch. p. 8 (charpentieri), pl. 1, fig. 6 = Cyclostoma involvulus, var.? Chemn. 2nd edit. p. 30, pl. 8, figs. 10-12 = Cyclophorus charpentieri, Pfr. Mon. Pneumon. p. 89.\n\nJava.\nC. taeniatus, Pfr. = Cyclostoma taeniatum (Cyclophorus), Pfr. Proc. Zool. Soc. 1854, p. 301 = Cyclophorus taeniatus, Pfr. Mon. Pneumon. Suppl. I. p. 59.\n\nSumatra.\n\nC. tenebricosus, Adams and Reeve, = Cyclostoma tenebricosum, Ad. and Reeve, Voy. Samarang, Moll. p. 57, pl. 14, fig. 6 = Leptopoma tenebricosum, Pfr. Consp. No. 171; Mon. Pneumon. p. 117 = Cyclophorus tenebricosus, Ad. Genera, p. 280; Pfr. Mon. Pneumon. Suppl. I. p. 76, II. p. 69.\n\nBorneo.\n\nC. bellus, von Mart. Malak. Bl. XX. 1872, p. 159; Pfr. Novit. Conch. IV. p. 126, No. 830, pl. 128, fig. 10; Mon. Pneumon. Suppl. III. p. 113.\n\nCelebes.\n\nC. metcalfei, Issel, Moll. Born. 1874, p. 69, pl. 6, figs. 4-6; Pfr. Mon. Pneumon. Suppl. III. p. 113.\n\nSarawak, Borneo.\n\nC. trochoides (Lagocheilus), Stol. = Lagocheilus trochoides Stol. Journ. As. Soc. XLI. 1872, p. 273, pl. 10, fig. 15 := Cyclophorus trochoides, Pfr. Mon. Pneumon. Suppl. III. p. 123.\n\nPenang.\n\nC. striolatus (Lagocheilus) Stol. = Lagocheilus striolatus, Stol. Jour. As. Soc. Beng. XLI. 1872, p. 271, pl. 10, fig. 16 = Cyclophorus striolatus, Pfr. Mon. Pneumon. Suppl. III. p. 123.\n\nPenang.\n\nC. regelspergeri, De Morgan, Le Nat. VII. 1885, No. 9, p. 69 = Spiraculum regelspergeri, von Möllendorff, Jour. As. Soc. Beng. LV. 1886, p. 308.\n\nEnvirons of Lahat and Pappan, the Valley of the Kinta River, Perak.\n\nC. kintanum, De Morgan, l.c. 1885, p. 69 = Spiraculum kintanum, von Möllendorff, l.c.\n\nKinta Valley, Perak.\nC. expansus, Pfr. (?) var. von Möllendorff, l.c. p. 309; G. Nevill, Handl. 1878, p. 269.\n\nBukit Pondok.\n\nC. lowi, de Morgan, l.c. 1885, p. 69; von Möllendorff, l.c. p. 309.\n\nKinta Valley; Patani.\n\nC. (Lagochilus ?) townsendi, Crosse, Jour. Conch. XXVII. 1879, pp. 200, 339, pl. 8, f. 3 = Lagocheilus, n.sp. G. Nevill, Handl. 1878, p. 282 = Cyclophorus baylei, De Morgan, l.c. 1885, p. 69 = Lagochilus townsendi, von Möllendorff, l.c. p. 309.\n\n26. Leptopoma, Pfeiffer, Zeitschr. f. Malak. 1847, p. 47.\n\nA Cyclophorus with a thin operculum.\n\nLeptopoma aspirans, Benson, von Möllendorff, l.c. p. 309.\n\nBukit Pondok.\n\n27. Alyceus, Gray, Proc. Zool. Soc. 1850.\n\nShell conical or depressed, very deep sutures, last whorl much swollen, constricted and twisted near the opening, which is round; peristome double, the outer plate reflected; operculum thin, circular, calcareous, with numerous whorls.\n\nAlyceus gibbosulus, Stol. Jour. As. Soc. Beng. XLI. 1872, p. 268, pl. 10, fig. 14; Pfr. Mon. Pneumon. Suppl. III. p. 58.\n\nPenang.\n\nA. perakensis, Crosse, Jour. Conch. XXVII. 1879, pp. 206, 339, pl. 12, fig. 7; von Möllendorff, Jour. As. Soc. Beng. LV. 1886.\n\nBukit Pondok.\n\nCrosse compares this with A. jagori, Mart., from Java. It is, however, well distinguished from this latter by its large size, bright yellow colour, the smaller number of its whorls, and its spiral sculpture (von Möllendorff).\n\nA. diplochilus, von Möllendorff, l.c. p. 310.\n\nBukit Pondok.\nA. Oligopleuris, von Möll. l.c. p. 310.\nBukit Pondok.\n\nA. Microdiscus, von Möll. l.c. p. 311.\nThe peculiar distortion of the last whorl, which first descends after the constriction, and is again deflected towards the aperture, separates this minute species from all forms known (von Möllendorff).\nBukit Pondok.\n\nA. Parvulus, von Möll. l.c.\nAnother minute form, still smaller than the last to which it appears somewhat related. It differs, however, in the constriction being nearer the aperture, almost regular last whorl, the broad outer and very prominent inner peristome (von Möll.).\n\nBukit Pondok.\n\nA. Microconus, von Möll. l.c.\nBy the conical shape, the regular last whorl and the reticulate sculpture this small species is very well distinguished from all Indian Alycae.\nBukit Pondok.\n\nA. Jousseaumei, De Morgan, Le Nat. VII. 1885, No. 9, p. 70; von Möll. l.c. p. 312.\nLimestone hills of the valley of the Kinta, summit of Mt. Lano.\n\nA. Chaperi, De Morgan, l.c. p. 70, probably = A. gibbosulus, Stol. Ila von Möll.\nPenang; Bukit Pondok.\n\nFamily DIPLOMATINACEÆ, Benson.\n(Including the genera Paxillus, Palaina, Arinia and Diplomatina).\n\n28. Diplomatina, Benson, Ann. and Mag. Nat. Hist. 1849, Sept. p. 193.\nShell sub-oval, with the slightest trace of an umbilical slit; peristome interrupted expanded; operculum thin, between testaceous and horny, with a projecting thin claw.\nShells belonging to the Indian region amounting to about 30 species, but some of uncertain position, which extend to New Zealand, Lord Howe's Island and Australia. The family may be said to be represented partly in southern Asia and its islands.\n\nAnimal with long and filiform tentacles, with sessile eyes on the posterior base; foot short. The name of the genus refers to two lobes on each tentacle at the base behind, on each of which there is an eye. The species abound in masses of decayed vegetable matter, or under stones in damp situations, and beneath trees on the shady sides of mountains. I found a good many on a dead tree which had been felled in the clearing of a coffee plantation. At daybreak in the morning I generally found one or two walking about. This was probably *D. mirabilis*. The genus *Paxillus* is founded on a smooth reversed species from Borneo.\n\n**Diplommatina concinna**, H. Adams, Proc. Zool. Soc. 1872, p. 13, pl. 3, fig. 22; Issel, Moll. Born. p. 77; Pfr. Mon. Pneumon. Suppl. III. p. 74.\n\nBorneo.\n\n*D. canaliculata*, von Möll. Jour. As. Soc. Beng. LV. 1886, p. 312.\n\nBukit Pondok.\n\n*D. nevilli*, Crosse, Jour. Conch. XXVII. 1879, pp. 203, 339, pl. 8, fig. 2 (*Palaina*); von Möll. l.c. p. 313.\n\nBukit Pondok.\n\n*D. crosseana*, Godwin-Aust. and G. Nev. Proc. Zool. Soc. 1879, p. 738, pl. 60, figs. 3, 3a.\n\nBukit Pondok.\n\n*D. mirabilis*, Godwin-Aust. and G. Nev. l.c. p. 739, pl. 60, figs. 4a, 4b; von Möll. l.c. p. 313.\n\nBukit Pondok.\n\n*D. superba*, Godwin-Aust. and G. Nev. l.c. p. 739, pl. 60, figs. 5, 5a (*Palaina*).\n\nBukit Pondok.\n29. **Opisthostoma**, Crosse and Nevill, Jour. de Conch. XXVII. 1879, pp. 197, 205, 339.\n\n*Shell* with the upper whorls obliquely deflected; last whorl constricted, thin, inflated, finally sinistrally ascending close to the upper whorls; aperture reversed, almost vertical, rounded; peristome continuous and duplicated; operculum normal. Habitat the same as the last genus. Scarcely a dozen species.\n\n**Opisthostoma pauluccle**, Crosse and Nevill, Jour. de Conch. XXVII, 1879, pp. 197, 205, 339, pl. 8, fig. 1; Godwin-Aust. and G. Nev. Proc. Zool. Soc. 1879, p. 738, pl. 9, figs. 2, 2a, 2b; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 313.\n\nBukit Pondok.\n\n**O. perakense**, Godwin-Aust. and G. Nev. l.c. p. 738, pl. 60, figs. 1, 1a, 1b; von Möll. l.c. p. 313.\n\nBukit Pondok.\n\n**O. crespignyi (Plectostoma)**, H. Adams (Coll. I.) = *Plectostoma De Crespignii*, H. Adams, Ann. and Mag. Nat. Hist. 3rd ser. XV. p. 177 (Pfr. Mon Hel. V. p. 437) = *Opisthostoma decrepignyi*, Paetel, Catal. p. 119 = **O. crespignyi**, Pfr, Mon. Pneumon. Suppl. III. p. 68.\n\nLabuan, Borneo.\n\n**Family PUPININÆ**, Pfr.\n\n30. **Pupina**, Vignard, Ann. Sc. Nat. Vol. XVIII. 1829, p. 440.\n\n*Shell* sub-cylindric like *Pupa*, thin, transparent, smooth, very shining; mouth not quite round; the columella margin with a deep notch anteriorly and a tooth posteriorly; peristome simple; operculum in all the family orbicular, thin, horny, with numerous gradually increasing whorls from a central nucleus.\n\n**Pupina artata**, Bens.; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 314.\n\nPerak.\nP. arula, Bens.; von Möll. l.c.\n\nBukit Pondok.\n\nP. aureola, Stol. Jour. As. Soc. Beng. XLI. 1872, p. 267, pl. 10, figs. 11-12; Pfr. Mon. Pneumon. Suppl. III. p. 148.\n\nPenang.\n\nP. pfeifferi, H. Adams, Proc. Zool. Soc. 1865, p. 416, pl. 21, figs. 11-12 = P. pfeifferiana, H. Adams, Proc. Zool. Soc. 1869, p. 275 = P. pfeifferi, Pfr. Mon. Pneumon. Suppl. III. p. 149.\n\nIsland of Batchian.\n\nP. junghuhni (Rhegistoma), Herklots — Rhegistoma junghuhni, Herk. Mus. Lugdun = Pupina junghuhni, Pfr. Mon. Pneumon. Suppl. III. p. 151.\n\nJava.\n\nP. amboinensis (Callia), von Mart. = Callia amboinensis, von Mart. Monatsber. Berl. Ak. 16 Jan. 1865, p. 53 = Pupina amboinensis, Pfr. Mon. Pneumon. Suppl. III. p. 154.\n\nAmboyna.\n\nP. vescoi, Morelet, Rev. et Mag. Zool. 1862, p. 479; Crosse and Fisch. Jour. Conch. XI. p. 372; Pfr. Mon. Pneumon. Suppl. II. p. 94.\n\nPulo Condor.\n\nP. superba, Pfr. Proc. Zool. Soc. 1855, p. 118; Mon. Pneumon. Suppl. I. p. 94.\n\nSumatra.\n\n31. Megalomastoma, Guilding; Swainson, Malacology, pp. 186 and 336.\n\nShell cylindrical resembling Pupa, but has a horny operculum; spire not thickened; teeth or fold on the pillar none.\n\nMegalomastoma anostoma, Bens. Pfr. Malak. Bl. 1854, p. 89 = M. sectilabrum, Pfr. Mon. Pneumon. p. 133; Chemn. new edit.\np. 377, pl. 47, figs. 11-12; Gray, Cat. Phan. p. 93 = *M. anostoma*, Pfr. Mon. Pneumon. Suppl. I. p. 85.\n\nLabuan, Borneo.\n\n*M. leferi*, Morelet = *Cyclostoma leferi*, Morelet, Jour. Conch. IX. 1861, p. 176 = *Megalomastoma leferi*, von Mart. Ostas. Zool. II. p. 154; Pfr. Mon. Pneumon. Suppl. III. p. 138.\n\nBorneo.\n\n*M. doriae*, Issel, Moll. Born. 1874, pl. 67, pl. 6, figs. 18-19; Pfr. Mon. Pneumon. Suppl. III. p. 138.\n\nSarawak, Borneo.\n\n*M. (Coptochilus) sectilabrum*, Gould; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 314.\n\nPerak; Larut; Penang.\n\n32. *Hybocystis*, Benson, 1859, Annals and Mag. Nat. Hist. 3rd ser. IV. p. 90.\n\nThis remarkable and exceedingly interesting genus, which forms one of the peculiar features of the terrestrial molluscan fauna of the Malay Peninsula, deserves the fullest details in this list. Fortunately its history as a species has been well marked out by M. P. Fischer in the \"Journal de Conchyliologie\" (XXV. 3rd series, 1885, p. 180), an epitome of whose researches will now be given.\n\nThe genus was proposed by Benson in 1859 for a Burmese shell which had been hitherto described as a species of *Megalomastoma*, and in its young stages as a species of *Otopoma*. Some years before Dr. Gould, the American naturalist, had described the same shell, for which he had proposed the generic name of *Pollicaria*; but as the genus was insufficiently defined, and included species of different genera, Benson's genus has been preferred as complying with every condition of necessary exactness.\n\nThe shell is ovoid and pupiform, but deviating from its axis in the last whorls in the manner of certain species of *Streptaxis*. The ante-penultimate whorl is much developed and flattened in\nfront above the mouth, which is sub-circular and angular anteriorly in young specimens, which also present a little canalicate prolongation, which is obliterated little by little as the animal is developed, leaving when completely closed only the appearance of a triangular area traversed longitudinally by a linear scar, and leaving in that state a rounded double peristome. Internal lip relatively less thick, deeper coloured, and more shining; external reflected, but not always perfectly united with the inner. Operculum testaceous, somewhat thick, with a central nucleus, and composed of two plates; external face multispiral, slightly concave in the middle; internal face few whorls, also slightly concave in the middle; margin with a feeble keel.\n\nThe foot is not divided as in the Cyclostomidae, where there are two longitudinal parts independent of each other for crawling. The animal is long, with a very thin mantle, whose anterior border is simple and not papillose; head and muzzle short, thick, the latter grooved transversely on its upper face; buccal orifice, when open, oval, and showing the extremity of the radula, but when the mouth is closed it is a simple slit; tentacles short, thick, transversely striate, slightly constricted at the base, of a uniform reddish color; eyes at the external base well pigmented and placed on short, obtuse, and slightly convex peduncles; foot thick, fleshy, wide, short, oval, obtuse, truncate in front, round behind. There is a large pedal sinus in front, but no trace of that longitudinal division which is common in the family of Cyclostomidae, but the foot is rather that of the family of Cyclophoridae. The upper part of the foot carries the operculum, the adherence of which is circular, with an umbilicated non-central projection, which corresponds to the nucleus of the internal face, so that half the organ is free, like the genus Cyclophorus. The sexes are distinct, the females being a little larger in size. The mouth has two mandibular plates, brown, chitinous, and solid, visible to the naked eye, but when magnified displaying a faceted structure roughly hexagonal or rounded. This may possibly be some arrangement connected with the eyes of the animal, or a faceted eye-structure like that which exists\nin the head of insects. All the Cyclophoridae have similar organs. The radula has the following formula \\((2, 1, 1, 2) \\times 66\\). It is long, a little curved at the end, but relatively shorter than amongst the most of the Cyclophoridae. The teeth are in oblique rows from the median line to the outer margin. The central teeth are a little oblong, slightly constricted in the centre like an hour-glass, and widely and roundly notched at the base. There is a central wide, short, obtuse cusp, with the rudiment of a lateral one. The first lateral teeth are larger, oblique, elongate, with a narrow base, curving over outwardly on the summit in a direction opposite to the other teeth. The free edge is bicuspid, the outer short, wide, obtuse, the inner small and short. The two marginal teeth are bicuspid, the internal cusp more feeble than the external, which is triangular.\n\nM. Fischer, in the \"Manuel de Conchyliologie,\" p. 71, gives his reasons for classing *Hyboecystis* between *Pupina* and *Cataulus*, but he admits that it differs from the majority of Cyclophoridae by its bicuspid marginal and lateral teeth, and the obtuse cusps of the median tooth. These characters united to those of the shell and of the operculum determine the genus. In the position of *Hyboecystis* Dr. Pfeiffer takes a different view, and places it in the great family of Cyclostomaceae, in the sub-family Cyclotea. Stoliczka (Jour. As. Soc. Beng. 1871, p. 150) agrees with M. Fischer.\n\nThe following is the explanation of the figures given in the plate:\n\nFig. 1. Animal of *Hyboecystis elephas*, De Morgan, from a female specimen preserved in alcohol. The head and foot are shown in front—M, edge of mantle; T, tentacles; E, eye; F, sole of foot.\n\nFig. 2. Male specimen of the same; head and foot shown in front—M, mantle; T, tentacles; E, eye; F, foot; V, verge.\n\nFig. 3. Same male specimen shown in profile from the right side—T, tentacle; B, buccal orifice; F, foot; V, verge.\nFig. 4. Radula of do.—A, central tooth; B, lateral tooth; C, first marginal tooth; D, second marginal tooth.\n\nFig. 5A. Portion of one of the mandibular plates (very much enlarged).\n\nFig. 5B. Details of do., on a much larger scale.\n\nFigures 1, 2, 3 are magnified two diameters.\n\nHybocystis elephas, De Morgan, Le Nat. VII. 1885, No. 9, p. 70; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 314.\n\nPerak.\n\nH. joussaumei, De Morgan, l.c. p. 70; von Möll. l.c. p. 315.\n\nValley of the Plus river.\n\nFamily HYDROCENIDÆ.\n\n33. Georissa, Blanford, 1864.\n\nAnn. and Mag. Nat. Hist. 3rd series, XIII. 1864, p. 463; ibid. 4th series, III. 1869, p. 173.\n\nType Hydrocena pyxis, Benson.\n\nShell resembling that of Hydrocena, imperforated, small, conical, amber or reddish-coloured, spirally sulcated or striated.\n\nAnimal furnished with hemispherical lobes in the place of tentacles; eyes normal; foot short, rotund. Operculum semi-oval, no spiral structure as in Helicina; eccentrically striated, testaceous, transparent.\n\nGeorissa Monterosatiana, Godwin-Austen and G. Nevill, Proc. Zool. Soc. 1879, p. 739, pl. 59, fig. 6; von Möll. Jour. As. Soc. Beng. LV. 1886, p. 316.\n\nBukit Pondok.\n\nG. semisculpta, Godwin-Austen and G. Nevill, l.c. p. 740, pl. 59, fig. 3, 3a; von Möll. l.c. p. 316.\n\nBukit Pondok.\nFRESHWATER MOLLUSCA.\n\nSub-order OPISOPHTHALMA.\n\nFamily TRUNCATELLIDÆ.\n\nThese animals have a distinct bi-lobed muzzle with flat sub-triangular tentacles, and a sub-spiral horny operculum.\n\n1. TRUNCATELLA, Risso, Hist. Nat. de l'Europe, IV. p. 121.\n\nShell solid, cylindrical in its young state, truncated in the adult; whorls rounded; mouth oval; peristome complete, reflected; operculum horny, thin, with a lateral nucleus.\n\nAnimal furnished with a retractile bifid muzzle proboscis-shaped. There are about 15 species, tropical or sub-tropical, found in salt and fresh water.\n\nTRUNCATELLA VALIDA, Pfr. Mon. Auric. p. 184; Zeitschr. f. Malak. 1846, p 182, No. 1; Küst. Mon. p. 11, No. 7, pl. 2, figs. 7, 8, 19, 21, 23.\n\nPhilippines, Baclayon, Capul, New Caledonia, and Malay Peninsula.\n\nTR. marginata, Küst. Mon. p. 12, No. 8, pl. 2, figs. 24-26; Pfr. Mon. Auric. p. 186.\n\nLabuan, Borneo; Malacca.\n\nTR. aurantia, Gould, Exp. Sh. 1846, p. 39, Ed. 1851, pl. 8, fig. 125; Pfr. Mon. Pneumon. Suppl. I. p. 6.\n\nMangsi Island, Borneo.\n\nTR. SCALAROIDES, von Mart. Monatsber. Berl. Ak. 25 Febr. 1864; Pfr. Mon. Pneumon. Suppl. II. p. 7.\n\nAmboyna.\nFamily MELANACEÆ.\n\n2. Melania, Lamarck, Hist. Nat. Animaux s. Vertèbres.\n\nShell more or less turreted, generally wrinkled or nodulous, mostly covered with a black or olive epidermis; spire elongated, generally more or less eroded towards the apex; columella smooth, arched; aperture ovate, entire, sometimes attenuately channelled at the base; lip simple.\n\nAnimal: disk short and slight; head proboscis-shaped, sub-conical, truncated, with the tentacles distant and subulate, having the eyes on the outer side and sometimes at the base, sometimes more advanced; mantle fringed; operculum horny.\n\nUnivalve shells chiefly inhabiting the tropical rivers of India, the Indian Archipelago and tropical North America. About 160 species have been described, but these are capable of great reduction.\n\nMelania foeda, Lea, Proc. Zool. Soc. Lond. 1850; Brot, Mater. III. p. 33, pl. 3, fig. 4; Brot, Melanidae, Conchylien Cabinet I. p. 51.\n\nJava.\n\nM. angulifera, Brot, Mater. III. p. 32, pl. 2, fig. 9; Melanidæ, Conch. Cab. I. p. 51.\n\nJava.\n\nM. parva, Lea, = Pachychilus parvum, Lea, Proc. Ac. Nat. Sc. Philad. 1856 = Melania crassilabrum, Reeve, Conch. Icon. f. 221 = Paludomus cyanostomus, Morelet, Jour. Conch. 1864, p. 288 = Melania pareva, Brot, Melan. (Conch. Cab. I.) p. 55.\n\nSarawak, Borneo; Siam; New Caledonia, (?)\n\nM. sulcospira, Mouss. Jav. Moll, pl. 9, fig. 3; Brot, Melan. p. 56 = Sulcospira typica, Trösch. Gebiss der Schnecken.\n\nJava.\nM. perfecta, Mouss. Jav. Moll. pl. 22, fig. 5; Reeve, Conch. Icon. fig. 84 = Melanoides perfecta, H. and A. Ad. Gen. = Melania perfecta, Brot, Melan. p. 79.\n\nAmboyna; Maros, Celebes.\n\nM. wallacei, Reeve, Conch. Icon. fig. 66; Brot, Melan. p. 80 = M. constricta, Mouss. MSS.\n\nCelebes; Macassar.\n\nM. variabilis, Benson, Jour. As. Soc. Calcutta, 1835; Hanley and Theobald, Conch. Ind. pl. 109, tigs. 2-6 = Melanatria variabilis, Gray, Guide Syst. distrib. = Melania hercula, Reeve, Conch. Icon. fig. 4 a. b. = Melanoides hercula, H. and A. Ad. Gen. = Melania variabilis, Brot, Melan. p. 85.\n\nJava; Burmah.\n\nM. sumatrensis, Brot, Melan. p. 87.\n\nSumatra, Java.\n\nM. episcopalis, Lea, Proc. Zool. Soc. 1850; (?) Reeve, Conch. Icon. fig. 12; Brot, Melan. p. 97.\n\nMalacca.\n\nM. infracostata, Mouss. Jav. Moll. p. 65, pl. 10, fig. 3 (not Reeve); Brot, Melan. p. 98 = M. episcopalis, Lea, var. Brot, Catal. of Rec. Mel. p. 280, No. 80.\n\nJava.\n\nM. brookei, Reeve, Conch. Icon. fig. 207 = M. episcopalis, Lea, Catal. Rec. Melan. = M. pontificalis, v. d. Busch, Zeitschrift f. Malak. 1853, p. 178 = M. brookei, Brot, Melan. p. 99.\n\nBorneo.\n\nM. agrestis, Reeve, Conch. Icon. f. 140 = M. coarctata, Lam. var. Brot, Mater. I. p. 42 = M. agrestis, Brot, Melan. p. 101.\n\nBorneo.\n\nM. circumstriata, Metc. Proc. Zool. Soc. 1851, p. 73; Reeve, Conch. Icon. fig. 205 = Melanoides circumstriata, H. and A. Ad. Gen. = Melania circumstriata, Brot, Melan. p. 101.\n\nBorneo.\nM. clavaeformis, Brot, Melan. p. 103.\nBorneo.\n\nM. torquata, v. d. Busch, Phil. Abbildg. pl. 1, fig. 18; Mouss. Jav. Moll. pl. 12, fig. 2; Brot, Melan. p. 110 = M. terebra, Reeve, Conch. Icon. fig. 59; Hanley and Theobald, Conch. Ind. pl. 71, figs. 8-9.\nJava; Bengal.\n\nM. soolooensis, Reeve, Conch. Icon. fig. 31; Brot, Melan. p. 105.\nSulu.\n\nM. zollingeri, Brot, Mater. II. pl. 2, fig. 4, p. 42; Melan. p. 111.\nJava.\n\nM. crenulata, (Desh.) var. tirouri (Fér.); Desh. in Lam. An. s. V. No. 18; Chenu, Man. Conch. fig. 1986; H. and A. Adams, Gen.; Brot, Melan. p. 114.\nCelebes.\n\nM. crenulata (Desh.) var. porcata, Jonas, Zeitschr. f. Malak. 1844, p. 50; Phil. Abbildg. pl. 4, fig. 19; Mousson, Moll. Jav. pl. 11, fig. 4; Brot, Melan. p. 114.\nJava.\n\nM. semicancellata, v. d. Busch, Phil. Abbildg. pl. 3, fig. 2; Reeve, Conch. Icon. fig. 37b; Brot, Melan. p. 118 = M. lavis, (Gray) Reeve, Conch. Icon. fig. 40 (not Gray) = M. phlebotomum, Reeve, Conch. Icon. fig. 105.\nJava.\n\nM. obesula, Brot, Melan. p. 121.\nJava.\n\nM. aculeus, Lea, Trans. Amer. Phil. Soc. Philad. V. pl. 19, fig. 72; Hanley, Conch. Misc. fig. 33 = M. latronum, Tarnier, MSS. = M. subulata, Sow. Man. Conch. 313 = M. aculeus, Brot, Melan. p. 122.\nJava.\nM. uniformis, Q. and G. Voy. Astrol. pl. 56, figs. 30-35; Desh. in Lam. An. s. V. No. 26; H. and A. Ad. Gen.; Brot, Melan. p. 124 = M. fulgida, Reeve, Conch. Icon. fig. 24 = M. baculus, Reeve, Conch. Icon. fig. 130.\n\nMenado, Celebes; Philippines.\n\nM. anthracina, v. d. Busch, Phil. Abbildg. pl. 3, fig. 3; Brot, Melan. p. 127.\n\nJava (?).\n\nM. terebriformis, Brot, Mater. I. p. 51; Melan. p. 144 = M. terebra, v. d. Busch, Phil. Abbildg. pl. 1, fig. 17; Reeve, Conch., Icon. fig. 46.\n\nJava.\n\nM. turris, Brot, Mater. III. p. 38, pl. 2, fig. 11; Melan. p. 146.\n\nBorneo.\n\nM. acicula, Brot, Mater. III. p. 39, pl. 3, figs. 8-9; Melan. p. 154.\n\nLabuan, Borneo.\n\nM. semiornata, Brot, Rev. Zool. 1860, pl. 16, fig. 5; Melan. p. 159.\n\nJava.\n\nM. arcte-cava, Mouss. Jour. Conch. 1857, p. 161; Brot, Melan. p. 165 = M. arcticava, Mouss. in Reeve, Conch. Icon. fig. 71.\n\nBajumati, Java.\n\nM. moluccensis, Q. and G. Voy. Astrol. pl. 56, figs. 22-25; Desh. in Lam. An. s. V. No. 24; Brot, Mater. III. p. 44, pl. 3, fig. 3 (not Reeve, Conch. Icon.); Melan. p. 166 = Juga moluccensis, (Q. and G.) H. and A. Ad. Gen.\n\nAmboyna; Halmahera.\n\nM. monile, Mouss. Jour. Conch. 1857, p. 162; Brot, Melan. p. 173.\n\nJava (?); Moluccas.\nM. ornata, v. d. Busch, Phil. Abbildg. pl. 1, figs. 15-16; Brot. Melan. p. 173.\n\nJava.\n\nM. tristis, Reeve, Conch. Icon. fig. 121; Brot, Melan. p. 175.\n\nJava.\n\nM. fulgurans, Hinds, Ann. Mag. N. H. XIV. p. 9; Reeve, Conch. Icon. fig. 55; Chenu, Man. Conch. fig. 1993; H. and A. Ad. Gen.; Brot, Melan. p. 183.\n\nMoluccas; New Ireland; Formosa.\n\nM. labuanensis, Brot, Mater. III. p. 41; Melan. p. 184.\n\nLabuan, Borneo.\n\nM. papuensis, Q. and G. Voy. Astrol. pl. 56, figs. 45-47; Desh. in Lam. An. s. V. No. 27; Brot, Mater. III. p. 45; Melan. p. 186.\n\nMoluccas (?).\n\nM. distinguenda, Brot, Melan. p. 190 = M. pyramus (Bens.) Reeve, Conch. Icon. fig. 51 (not Bens. nor. v. d. Busch).\n\nBorneo.\n\nM. amabilis, v. d. Busch, in Reeve, Conch Icon. fig. 223 = M. pulchra, v.d. Busch, Malak. Blät. 1858, p. 35 = M. amabilis, Brot, Melan. p. 192.\n\nCelebes.\n\nM. subsuturalis, Metc. Proc. Zool. Soc. 1851, p. 73; Brot, Melan. p. 197 = M. metcalfei, Reeve, Conch. Icon. fig. 212.\n\nBorneo.\n\nM. disjuncta, Brot, Melan. p. 198.\n\nBorneo.\n\nM. inhonesta, v. d. Busch, Phil. Abbildg. pl. 4, fig. 5; (?) Reeve, Conch. Icon. fig. 226; (?) Mousson, Jav. Moll. p. 71; Brot, Melan, p. 206 = M. ovalana, Mouss. Jour. Conch. 1870, p. 208.\n\nJava; Ovalau.\n\nM. crepidinata, Reeve, Conch. Icon. fig. 120; Brot, Melan. p. 238.\n\nJava; Borneo.\nM. javanica, v. d. Busch, MSS. (Philippi states that this is a MS. name of van den Busch); Brot, Catal. Rec. Mel. No. 200; Melan. p. 246 = M. coaretata (Lam.) Phil. Abbildg. pl. 4, fig. 20; Reeve, Conch. Icon. fig. 22.\n\nJava.\n\nM. tuberculata, Müll. Verm. Ter. No. 378; Chemn. IX. p. 189; Phil. Abbildg. pl. 1, fig. 19; Reeve, Conch. Icon. fig. 87 := Melanoides tuberculata (Müll.), H. and A. Ad. Gen. = Melania fasciolata, Lam. An. s. V. No. 16 = M. suturalis, Phil. Abbildg. p. 4, fig. 17 = M. tuberculata, Brot, Melan. p. 247.\n\nSiam; Java; Malta; Madagascar; India; Ceylon, &c.\n\nM. cylindracea, Mouss, Jav. Moll. pl. 11, fig. 9; Brot, Melan. p. 252 = Melanoides cylindracea (Mouss.), H. & A. Ad. Gen.\n\nJava.\n\nM. fontinalis, Phil. Abbildg. pl. 5, fig. 7; Brot, Melan. p. 253.\n\nPulo-Pinang.\n\nM. malayana, Issel, Moll. Born. p. 100; Brot, Melan. p. 253 = M. tuberculata, Müll. var. malayana, Issel, l.c.\n\nSarawak, Tangiou-Datou, Borneo.\n\nM. parreyssii, Brot, Melan. p. 254.\n\nJava (?).\n\nM. unifasciata, Mouss. Jav. Moll. pl. 11, fig. 8; Brot, Melan. p. 262 = Melanoides unifasciata (Mouss.), H. and A. Ad. Gen.\n\nMalang, Java.\n\nM. scabra, Müll. in Hanl. Theob. Conch. Ind. pl. 73, figs. 1-4; Brot, Melan. p. 266 = Buccinum scabrum, Müll. Verm. p. 136, No. 329 = Helix scabra, Chemn. Conch. pl. 136, figs. 1259-60\n\nMelania spinulosa, Lam. An. s. V. No. 12; Q. and G. Voy. Astrol. pl. 56, figs. 12-14; Mouss. Jav. Moll. pl. 11, figs. 11, 12 = Plotia scabra (Lam.), H. and A. Ad. Gen.; Chenu, Man. Conch. fig. 1943.\n\nJava; India; Ceylon; New Guinea, &c.\nM. GRANUM, v. d. Busch, Phil. Abbildg. pl. 1, fig. 7; Mouss. Jav. Moll. pl. 12, fig. 3; Reeve, Conch. Icon. fig. 219; Brot, Melan. p. 270 = M. scrabella (Phil.), Mouss. Jav. Moll. pl. 12, fig. 2 = Plotia granum (v. d. B.), H. and A. Ad. Gen.\n\nJava.\n\nM. MYURUS, Brot, Rev. Zool. 1860, pl. 16, fig. 3; Melan. p. 271.\n\nJava; Borneo (?).\n\nM. ACANTHICA, Lea, Proc. Zool. Soc. 1850; Hanley, Conch. Misc. fig. 8; Brot, Melan. p. 278 = M. spinulosa (Lam.) Reeve, Conch. Icon. fig. 156 a-b (not Lam.) = Tiara acanthica (Lea), H. and A. Ad. Gen.\n\nManila; Negros; Moluccas.\n\nM. RUDICOSTIS, Mouss. Brot, Melan. p. 280.\n\nAmboyna.\n\nM. DIADEMA, Lea, Proc. Zool. Soc. 1850; Reeve, Conch. Icon. fig. 174; Brot, Melan. p. 293 = Tiara diadema, H. and A. Ad. Gen.\n\nPhilippines; Amboyna.\n\nM. CYBELE, Gould, Proc. Bost. S.N.H. 1847: Mouss. Jour. Conch. 1865, p. 199, 1870, p. 214 = Tiara cybele (Gould), H. and A. Adams, Gen. = T. crenularis (Desh.) H. and A. Ad. op. c. = Melania cybele, Brot, Melan. p. 294.\n\nSumatra; Fijis; Philippines.\n\nM. SETOSA, Swainson, Quart. Jour. Sci. 1824; Gray, Zool. Jour. I. pl. 8, figs. 6-8; Reeve, Conch. Icon. fig. 186; Brot, Melan. p. 297 = Buccinum aculeatum, Lister, Hist. s. syn, meth. Conch. pl. 1055, fig. 8 = Helix amarula, var. Chemn. IX. pl. 134, figs. 1220-21.\n\nAmboyna.\n\nM. ORIENTALIS, A. Adams (Plotea), Proc. Zool. Soc. 1853, p. 99; Reeve, Conch. Icon. fig. 181; Brot, Melan. p. 300 = Tiara orientalis (Ad.) H. and A. Ad. Gen. = Melania hippocastanum, Brot, Rev. Zool. 1860, pl. 16, fig. 1.\n\nNew Caledonia; Eastern Archipelago.\nM. winteri, v. d. Busch, Phil. Abbildg. pl. 1, figs. 1-2; Mouss. Jav. Moll. pl. 12, fig. 1; Reeve, Conch. Icon. fig. 157; Brot, Melan. p. 301 = Plotea winteri (v. d. B.) H. and A. Ad. Gen.; Chenu, Man. Conch. fig. 1945.\n\nJava.\n\nM. herklotzi, Petit, Jour. Conch. 1853, pl. 7, fig. 10; Brot, Melan. p. 303 = M. dura, Reeve, Conch. Icon. fig. 187 = M. strobilus, Reeve, op. c. fig. 214 = Plotea herklotzi (Petit), H. and A. Ad. Gen.\n\nJava.\n\nM. rudis, Lea, Proc. Zool. Soc. 1850; Reeve, Conch. Icon. fig. 172; Brot, Melan. p. 305; Mater. II. pl. 1, fig. 7 = M. microstoma, Lea, Proc. Zool. Soc. 1850; Hanl. Conch. Misc. fig. 58 = Tarebia microstoma (Lea), H. and A. Ad. Gen.\n\nBatchian, Moluccas.\n\nM. semicostata, Phil. Abbildg. pl. 4, fig. 12; Brot, Melan. p. 308 = Sermyla semicostata (Phil.), H. and A. Ad. Gen. = Melania riquetti (Gratel.) Mouss. Jav. Moll. p. 76.\n\nSamarang, Java.\n\nM. armillata, Lea, Proc. Zool. Soc. 1850; Brot, Mater. II. pl. 1, fig. 12; Melan. p. 309 = Tarebia armillata (Lea), H. and A. Ad. Gen.\n\nJava (?); India.\n\nM. celebensis, Q. and G. Voy. Astrol. pl. 56, figs. 26-29; Desh. in Lam. An. s. V. No. 25; Brot, Mater. II. pl. 1, fig 13; = Tarebia celebensis (Q. and G.) H. and A. Ad. Gen.; Chenu, Man. Conch. fig. 2014 = Vibex celebensis (Q. and G.) Gray, Guide Syst. Dist. = Melania celebensis, Brot, Melan. p. 317.\n\nMenado, Celebes; Arrow Island.\n\nM. crenifera, Lea, Proc. Zool. Soc. 1850; Reeve, Conch. Icon. fig. 169; Brot, Melan. p. 323 = Tarebia crenifera (Lea), H. and A. Ad. Gen.\n\nJava.\nM. granospira, Mouss. Jour. Conch. 1857, p. 161; Brot, Mater. II. pl. 1, fig. 10; Melan. p. 324.\n\nBali.\n\nM. coffea, Phil. Abbildg. pl. 2, fig. 4; Brot, Melan. p. 326\n\n= Tarebia coffeea, (Phil.) H. and A. Ad. Gen.\n\nJava (?).\n\nM. asperula, Brot, Mater. II. pl. 1, fig. 11; Melan. p. 327 = M. semigranosa (v. d. B.) Mouss. Jav. Moll. p. 74.\n\nJava.\n\nM. lirata, Benson, Glean. of Sc. 1830, II.; Jour. As. Soc. Beng. 1836, V. 782; Reeve, Conch. Icon. fig. 170 = M. lineata (Gray), Hanl. Theob. Conch. Ind. pl. 71, fig. 7; Phil. Abbildg. pl. 3, fig. 7; Mouss. Jav. Moll. pl. 10, fig. 6 = M. semigranosa, v. d. Basch, Phil. Abbildg. pl. 1, fig. 13; Reeve, Conch. Icon. fig. 1, 67 = M. flavida, Mouss. Jav. Moll. pl. 10, fig. 5. Tarebia lineata, H. and A. Ad. Gen. = T. flavida (Dunker), H. and A. Ad. Gen. = Melania lirata, Brot, Melan. p. 329.\n\nJava; Bengal, &c.\n\nM. riquettii, Gratel. Mém. plus. esp. Moll. pl. 3, fig 28; (?) Hanl. and Theob. Conch. Ind. pl. 71, fig. 10; Brot, Melan. p. 333 = M. harpula, Dunker, Phil. Abbildg. pl. 3, fig. 6 = Tarebia riquettii (Gratel.), H. and A. Ad. Gen. Rec. Moll. = Serymyla harpula (Dkr.), H. and A. Ad. op. cit.\n\nPhilippines; Java (?).\n\n3. Claviger, Haldemann, Silliman's Journal, 1842.\n\nShell turreted, solid, with a series of longitudinal keels or nodules; aperture attenuated at the base, sub-canaliculate; right margin sinuous towards the base, produced in an arcuate manner, furnished with three short and deep parallel plates; operculum few-whorled, sinistral, with a sub-marginal basal nucleus.\n\nClaviger hippocastanum, Reeve, Conch. Icon. fig. 188; Brot, Melan. p. 360.\n\nBorneo.\n4. Faunus, Montfort, Conch. Syst. II. p. 427.\n\nShell subulate, with an attenuated spire, whorls numerous, smooth, covered with a blackish periostraca; mouth notched in front, columella lip rather thick, with posterior callosity; outer lip spreading with a posterior sinus. (Chenu, who figures the common species here described, only admits it as a sub-genus of Pirena). A tropical form with half a dozen species at most, belonging to tropical Asia, the Philippines, and Western Polynesia.\n\nFaunus cantori, Reeve, Conch. Icon. fig. 2; Brot, Melan. p. 414 = Pirena cantori, Reeve, Conch. Icon. fig 2, China.\n\nPenang.\n\nF. ater, L. = Strombus ater, L. Syst. Nat. XII. p. 1213; Chemn. pl. 135, fig. 1227 = Nerita atra, Müll. Verm. No. 375 = Cerithium fluviatile, Férruss. Syst. Conch. p. 69 = Pirena atra (L.) Mouss. Jav. Moll. pl. 10, fig. 1; Reeve, Conch. Icon. fig. 5 = Faunus ater (L.) H. and A. Ad. Gen.; Gray, Guide Syst. Dist.; Chenu, Man. Conch. fig. 2080; Brot, Melan. p. 410 = Pirena terebralis, Lam. An. s. V. No. 1; Q. and G. Voy. Astrol. pl. 56 = Pirena pietà, Reeve, Conch. Icon. fig. 3 (stat. juv.)\n\nMoluccas; New Guinea; New Ireland; Java; Ceylon; Ambryna, &c.\n\n5. Philopotamis, Layard, Ann. and Magaz. Nat. Hist. 1855, p. 138.\n\nOperculum with the apex superior, paucispiral; nucleus sub-basal, dextral.\n\nPhilopotamis olivaceus, Reeve, Conch. Icon. fig. 5; Brot, Gatt. Palud. p. 16.\n\n6. Paludomus, Swainson, Treatise on Malacology, p. 340.\n\nShell thick, sub-globose or conical, solid, imperforate, smooth or tubercular, covered with an olivaceous epidermis; spire shorter than the aperture, often eroded; aperture ovate; inner lip convex, thickened; outer lip acute, the margin slightly reflexed; operculum annular, nucleus sub-central.\nAnimal with the mantle margin fringed. Most of the species from India and Ceylon.\n\n**Paludomus isseli**, Brot, Gatt. Palud. p. 31 = *P. crassus*, (v. d. B.), Issel, Moll. Born. p. 95.\nSarawak, Borneo.\n\n*P. broti*, Issel, Moll. Born. p. 92; Brot, Gatt. Palud. p. 32.\nSarawak, Borneo.\n\n*P. luteus*, H. Adams, Proc. Zool. Soc. 1874, p. 585; Brot, Gatt. Palud. p. 46 = *P. moreleti*, Issel, Moll. Born. p. 93.\nSarawak, Borneo.\n\n---\n\n**Note.**—The Bivalves are reserved for another paper.\n\n---\n\n**EXPLANATION OF PLATES.**\n\n**Plates xxvii-xxx.**\n\nFig. 1.—*Hybocystis elephas*. Animal (♀). See p. 1073.\n\nFig. 2.—,, ,, ,, (♂). See p. 1074.\n\nFig. 3.—,, ,, ,, Profile view.\n\nFig. 4.—,, ,, Radula. See p. 1075.\n\nFig. 5a.—,, ,, Portion of one of the mandibular plates, very much enlarged.\n\nFig. 5b.—,, ,, The same, much more highly magnified.\n\n(The above drawings are those of M. Fischer from the \"Journal de Conchyliologie, xxv., 1885, p. 179.)\n\nFigs. 6-7.—Shell of *Bulimus perversus*, L.\n\nFigs. 8-9.—Shell of *Hybocystis elephas*, De Morgan.\n\nFigs. 10-11.—Operculum of ,, ,, ,, \"\n\nFig. 12.—*Bulimus* sp. (?) (Borneo)\n\nFig. 13.—*Cyclophorus* sp. Thaiping, Perak.\n\nFig. 14.—*Helix algira*, L.\n\nFig. 15.—*Alycaeus gibbus*, Féussac.\n\nFig. 16.—*Pirena terebralis*, Lamarck.\n\nFig. 17.—*Helix citrina*, L.\n\nFig. 18.—*Cyclophorus* sp. Pulo-Pankore, Perak.\n\nFig. 19.—*Melania episcopalis*, Lea.\n\nFig. 20.—*Nanina brookei*, Adams & Reeve.\n\nFig. 21.—,, *sumatrensis*, Mousson.\n\nFig. 22.—,, *mendaiensis*, Semper.\n\nFig. 23.—,, *hugonis*, Pfeiffer.\nBIBLIOGRAPHY OF MALAYAN LAND AND FRESHWATER SHELLS.\n\nAdams, H. and A. The Genera of Recent Mollusca arranged according to their Organization. 2 vols. and 1 vol. plates. London, 1858.\n\nAdanson, M. Histoire Naturelle du Sénégal. Paris, 1757.\n\nAlbers, J. Chr. Die Heliceen nach natürlicher Verwandtschaft systematisch geordnet. Leipsic, 1860.\n\nAnnals and Magazine of Natural History. London, 3 series. 2 vols. annually.\n\nAusten, H. H. Godwin. Land and Freshwater Mollusca of India, 1882.\n\n——— and G. Nevill. Shells from Perak and the Nicobar Islands. Proc. Zool. Soc. Lond. 1879, pp. 734-740 (9 sp.)\n\nBeck, H. Index Molluscorum praesentis aevi Musei Principis Christiani Frederici. Hanover, 1837 (two parts only were published).\n\nBenson, W. H. Gleanings of Science.\n\n——— In Ann. and Magaz. Natural History. IX. 1842.\n\n——— In Jour. Asiatic Society of Bengal, V. 1836, and VII. 1838.\n\nBlainville, D. de. Dictionnaire des Sciences Naturelles, XXXII. 1824. Art. Mollusques.\n\nBlanford, W. T. and H. F. Contributions to Indian Malacology, 12 parts. Calcutta, 1860 to 1870 (10 plates).\n\nBorn, I. von. Testacea Musei Caes. Vindobon. dispos. et descr. Vindob. 1780. (Vienna).\n\nBrot, A. Catalogue of Recent Species of the Family Melanidae. New York, 1868.\n\n——— Die Gattung Paludomus. Nürnberg, 1861.\n\n——— Die Melaniaceen (Melanidae) in Abbildungen nach der Natur mit Beschreibungen. Nürnberg, 1874. Conchylien Cabinet von Martini und Chemnitz.\nBruguière, J. G. Encyclopédie Méthodique. Vers. 2 vols. Paris, 1789-92.\n\nCanefri, C. Tapparone. Zoologia del viaggio intorno al globo della regia fregata Magenta durante gli anni, 1865-1868. Malacologia, 1874 (Jour. Conch. 1874, p. 319).\n\nChenmitz. Systemat. Conchylien-Cabinet. (Begun at Nuremberg in 1784, extending over some years. A second edition also published).\n\nChenu, J. C. Manuel de Conchyliologie et de Paléontologie Conchyliologique. 2 vols. Paris, 1859.\n\nConchyliologie, Journal de. Paris, I. 1851, and thenceforth a volume in every succeeding year.\n\nCrosse, H. Mollusques nouveaux de Perak. Jour. de Conch. XXVII. 1879, pp. 198-208 (5 sp.).\n\n—— Faune malacologique de Perak. Ibid. pp. 336-340 (18 sp.).\n\nDelessert, B. Recueil de Coquilles décrites par Lamarek et non encore figurées. Paris, 1841.\n\nDillwyn, L. W. A descriptive Catalogue of Recent Shells. 4 vols. London, 1817.\n\nDohrn, H. In Malakozoologische Blätter. Cassel, 1854-1877.\n\nDraparnaud, J. P. F. Tableau des Mollusques terrestres et fluviaitiles de la France. Paris, 1801.\n\n—— Histoire Naturelle des Mollusques terrestres et fluviaitiles de la France. Paris, 1805.\n\nEhrenberg, C. G. Symboke Physice. Moll. 1831.\n\nFérussac, D'A. Histoire Naturelle Générale et Particulière des Mollusques Terrestres et Fluviaitiles, 1819-21. Paris, 2 vols. with atlas of plates.\n\nFreycinet, L. de. Voyage autour du monde, 1824.\n\nGainard (Quoy et). Voyage de l'Astrolabe, Zoologie, 1832.\n\nGmelin, J. F. Systema Naturae Linnaeani (13th ed.), I. 1790.\n\nGodwin-Austen H. H. Land and Freshwater Mollusca of India. Calcutta, 1882.\n\n—— (and G. Nevill). Shells from Perak and the Nicobar Islands. Proc. Zool. Soc. 1879, pp. 734-740 (9 sp.).\nGould, A. A. Boston Society of Natural History.\n\n—— United States Exploring Expedition during the years 1838-42, under the command of Ch. Wilkes. XII. Mollusca and Shells. Boston, 1852.\n\nGrateloup. Actes de la Société Linnéene de Bordeaux, 1841.\n\n—— Mémoires sur plusieurs espèces de coquilles nouvelles ou peu connues de Mollusques (Lin. Soc.). Bordeaux, 1841.\n\nGray, M. E. Figures of molluscous animals selected from various authors. London, 1850.\n\n—— J. E. Nomenclature of Molluscous Animals and Shells in the collection of the British Museum. Pt. 1, Cyclophoridae, 1850.\n\n—— Catalogue of Pulmonata or air-breathing Mollusca in the collection of the British Museum. Pt. 1, Phanero-pneumona, 1852.\n\n—— Guide to the Systematic Distribution of Mollusca in the British Museum, London, 1857.\n\n—— In Annals of Philosophy. (New series). IX. 1825.\n\n—— Spicilegia Zoologica, 1830.\n\n—— New edition of Turton's Manual, 1840.\n\n—— Synopsis of the Contents of the British Museum, 1840.\n\n—— Ed. 44a., 1842.\n\n—— In Annals of Natural History, VI. 1840.\n\n—— In Loudon's Magazine, I. (New series).\n\nGuérin-Méneville, F. E. Revue et Magasin de Zoologie pure et appliquée. 2nd series, IX. 1857; XIX. 1867.\n\nGuilding, S. L. Conchological Papers. See Swainson, \"Shells and Shell-fish,\" pp. 182-336.\n\nGünther, A. Zoologischer Jahresbericht. Leipsic, 1864.\n\nHanley. Conchological Miscellany. London, 1858.\n\n—— and Theobald. Conchologia Indica. London, 1876.\n\nHasselt, Van. Allgemeine Konst-en Letterbode.\n\nHerklots, J. A. Fauna Molluscorum et Vermium Hollandiae. Haarlem, 1862.\n\nHinds, R. B. Zoology of the Voyage of H.M.S. \"Sulphur.\" Mollusca. Pt. III. 1845.\nHochstetter, F. von. Reise der Oesterreichischen Fregatte \"Novara.\" 2 vols. 4to. Vienna, 1864.\n\nHombron, (et Jacquinot). Voyage au Pôle Sud. Zoologie V. Livr. 24, pl. 11-12.\n\nHumphrey. Museum Calonianum Catalogue. London, 1797.\n\nHutton, T. In Jour. As Soc. Bengal, III. 1834, VIII. 1838.\n\nIssel, A. Molluschi Borneense. Genova, 1874.\n\nJacquinot (Hombron et). Voyage au Pôle Sud.\n\nKämmerer, C. L. Die Conchylien im Cabinette des H. Erbprinzen von Schwarzburg. Rudolstadt, 1786.\n\nKnorr, G. W. Vergnügen der Augen und des Gemüths. I. 1757, II. 1764, VI. 1773.\n\nKüster, H. C. In Chemnitz Couchylien-Cabinet. Neue Ausg.\n\nLamarck. Histoire Naturelle des Animaux sans Vertèbres. Two editions, the second by Deshayes. 8 vols. Paris, 1838.\n\nLea, J. Observations on the genus Unio, &c. I. 1832, III. 1842.\n\n—— Transactions of the American Philosophical Society of Philadelphia, VII. New series, 1841.\n\n—— Proceedings of the Academy of Natural Science. Philadelphia.\n\n—— New Unionidæ, Melanidæ, &c., chiefly of the United States. (3 parts). Philadelphia, 1866-69.\n\nLe Guillou. Revue Zoologique par la Société Cuvierienne, 1838-1847.\n\nLesson, R. P. Voyage de la Coquille. Paris, 1830.\n\nLinnaeus. Systema Naturæ. 13 editions. Turton's English Translation from Gmelin's posthumous edition in seven volumes. London, 1806.\n\nLister, M. Historia s. synopsis meth. Conchyliorum ad viv. delin. 4 parts. London, 1685.\n\nMalakozoologische Blätter (Menke und Pfeiffer). Cassel, 1854-78.\n\nMartens, E. von. Monatsber. Berlin. Akademie.\n\n—— Die preussische Expedition nach Ost-Asien. Zoologischer Theil.\n\nMartyn, T. Figures of non-described shells, 1789.\nMenke, C. Th. Synopsis Methodica Molluscorum. 1st edit., 1828, 2nd edit., 1830.\n\n——— (und Pfeiffer). Malakazoologische Blätter. Cassel, 1854-1878.\n\nMetcalf, W. Proceedings of the Zoological Society, 1851.\n\nMöllendorff, O. F. von. Journal of the Asiatic Society of Bengal, LV. 1886. \"On the Land Shells of Perak.\"\n\nMontfort. Histoire naturelle, générale et particulière des Mollusques. Faisante suite au Buffon de Sonnini, 1799-1805.\n\nMörch, O. A. L. Catalogus conchyliorum, quæ reliquit C. P. Kierulf, 1852.\n\nMorelet, A. Testacea novissima insulae Cubanae et Americæ Centralis, 1849. Pt. 2, 1851.\n\nMorgan, J. de. Note sur quelques espèces nouvelles de Mollusques terrestres, recueillis dans la Péninsule Malaise. Le Naturaliste VII. 1885, pp. 68-70.\n\nMousson, A. Die Land- und Süßw. Moll. von Java. Zurich, 1849.\n\nMüller, O. F. Vermium terrestrium et fluviatilum Historia. Hanover, I. 1773, II. 1774.\n\nNatural History, Annals and Magazine of. London, 3 series. 2 vols. annually.\n\nNevill, G. Hand-list of the Mollusca in the Indian Museum. Calcutta, 1878.\n\n——— (Godwin-Austen and). Shells from Perak and the Nicobar Islands. Proc. Zool. Soc. 1879, pp. 734-740.\n\nPaetel, Fr. Molluscorum systema et catalogus. Malak. Blätt. 1869, p. 204.\n\n——— Catalog der Conchylien-Sammlung; nebst Uebersicht des angewandten Systems, 1873.\n\nPfeiffer, L. Monographia Heliceorum Viventium. Leipsic, 1868. 8 vols.\n\n——— Nomenclator Heliceorum Viventium. Opus Postumum. Cassellis, 1881.\n\n——— Novitates conchologicae. II. 1860-66, III. 1866-67.\n\n——— Symbolae ad Historiam Heliceorum. Cassel, 1841.\nPfeiffer, L. Versuch einer Anordnung der Heliceen nach natürlichen Gruppen, in Malakoz. Bl. II. 1855.\n\n——— Monographia Pneumonoporum Viventium. Cassel, 1852.\n\n——— Conspectus Cyclostomaceorum emendatus et auctus. 1852.\n\nPhilippi, R. A. Abbildungen und Beschreibungen neuer oder wenig gekannter Conchylien. Bd. I. 1842-45, II. 1845-47, III H. 1, 1847.\n\nQuarterly Journal of Science. London.\n\nQuoy et Gaimard. Voyage de l'Astrolabe, 1832.\n\nReeve, L. Conchologia Iconica. 20 vols. London (the publication extending over a long series of years).\n\nRevue et Magasin de Zoologie pure et appliquee. Paris, 1857-67.\n\nRisso, A. Histoire Naturelle des principales productions de l'Europe méridionale, et particulièrement de celles des environs de Nice et des Alpes maritimes. IV. 1826.\n\nRossmässler, E. A. Iconographie der Land- und Süßwasser-Mollusken. 12 vols. published between 1835 and 1844.\n\nScopoli. Introductio ad historiam naturalem. Prague, 1777.\n\n——— Deliciae Florae et Faunae Insubricae, 1786. [Prague (?)].\n\nSemper, C. Reisen im Archipel de Philippinen. Wiesbaden, 1877.\n\nShuttleworth, R. J. Diagnosen neuer Mollusken. Nos. 1-3, 1852. Also papers in the Mittheilungen der Naturforsch. Gesellschaft in Bern, 1852 and 1843.\n\nSouleyet, Voyage autour du monde (1836-37) sur la corvette La Bonite, par MM. Eydoux et Souleyet. 2 vols., and atlas. Paris, 1841.\n\nSowerby, G. Thesaurus Conchyliorum. London, 1855.\n\n——— Conchological Manual. London, 1839.\n\nStoliczka, F. Journal of the Asiatic Society of Bengal, XLII. 1873, p. 16.\n\nSwainson, W. M. Zoological Illustrations, London, 1820-21, II. 2nd series, 1831-32.\n\n——— In Brand's Journal, Apr. 1828.\nSwainson, W. M. A Treatise on Malacology or Shells and Shell-fish. London, 1840.\n\nTapparone-Canefri, C. Zoologia del viaggio intorno al globo della regia fregata Magenta durante gli anni, 1865-1868. Malacologia, 1874 (Jour. Conch. 1874, p. 319).\n\nTheobald (and Hanley). Conchologia Indica. London, 1876.\n\nTroschel, F. H. Das Gebiss der Schnecken, zur Begründung einer natürl. Classification untersucht. Lief. I. 1856, II. 1857.\n\nTryon, Geo. W. Structural and Systematic Conchology. Philadelphia. Vol. I. of the Pulmonata, 1885. Work not yet completed.\n\nValenciennes. Archives du Muséum. Paris.\n\nVan Hasselt. Allgemeine Konst-en Letterbode.\n\nVignard. Ann. Sc. Nat. XVIII. 1829.\n\nWood, W. Index tetaceologicus. (London, 1825, 2nd edit., with supp.) Edit. Sylv. Hanley, 1856.\n\nZeitschrift für Malakozoologie und Malakozoologische Blätter. Menke und Pfeiffer. Vollständig v. Beginn an. 1844-76. 34 Bde. Hann. und Cassel. 8 m. Kpfrt.\n\nZelebor, J. Systemat. Verzeichniss der im Erzherzogthum Oesterreich bisher entdeckten und Land-Süsswasser-Mollusken, Wien, 1851.\n\nZollinger in Peterm. geog. Mittheil. (V. p. 464).\n\nZoological Society (of London), Proceedings of.\nMr. Ogilby exhibited a specimen of a deep-sea fish (*Chlorophthalmus nigripinnis*), originally described by Dr. Günther in the Ann. of Nat. Hist., 1878, and figured in Vol. XXII. of the \"Challenger Reports.\" The original specimens were taken by the \"Challenger\" naturalists off Twofold Bay, in 120 fathoms; the specimen exhibited to-night, was captured, a few days ago, off Port Jackson in 70 fathoms, the only other occasion on which the species has been met with since its discovery.\n\nMr. Ogilby also exhibited a photograph of *Acanthias Blainvilli*, not hitherto recorded from New South Wales, and one of a variety of *Acanthoclinus littoreus*, originally described by Forster in Cook's Voyage, the former having been taken in deep water off Port Jackson, the latter under stones between tide marks at Lord Howe Island.\n\nMr. Brazier exhibited a spherical stone about $\\frac{1}{2}$ inch in diameter, found in the crop of a Goura pigeon (*G. Albertisi*, Salvad.), from Hall Sound, New Guinea. Also a tube of fresh-water shells (*Segmentina australiensis*, E. A. Smith) from Waterloo Swamps.\n\nMr. MacDonnell showed under the microscope an interesting exhibit of Rotifers (*Megalotrocha* sp.), living in clusters on pond weed.\n\nMr. Burnell exhibited two living Slow-worms (*Typhlops nigrescens*) from Wentworthville near Parramatta.\n\nMr. Deane exhibited a remarkable excrescence on a root of *Monotoca elliptica*, found by Mr. J. F. Fitzhardinge in the neighbourhood of Sydney; a specimen of an apodal lizard (*Delma impar*) found by Mr. C. F. Price of Arable, near Cooma, where the species is said to be abundant in basaltic country; and examples of nodular masses enclosing fossils, occurring abundantly in a slaty rock in a cutting near Bredbo on the Goulburn to Cooma Railway.\nWEDNESDAY, 29TH AUGUST, 1888.\n\nThe President, Professor Stephens, M.A., F.G.S., in the Chair.\n\nThe following gentlemen were introduced as visitors—Mr. J. Dennant, F.G.S., Mr. G. Sweet, and Mr. F. G. A. Barnard of Victoria; Mr. J. C. Ross, B.Sc., F.G.S. of Bathurst, and Mr. C. A. Smith, F.C.S. of Sydney; Mr. R. L. Jack, F.G.S., Queensland.\n\nMEMBERS ELECTED.\n\nMessrs. H. S. Rohu, Sydney, and Mr. Bourne, Anatomical Museum, Sydney University, were elected Members of the Society.\n\nThe President announced:\n\n(1) That the Council had elected Mr. W. M. Bale, F.R.M.S., of Melbourne, a Corresponding Member of the Society.\n\n(2) That two Excursions had been arranged for the ensuing month:\n\n(a) September 15th—To Waterfall. Members to meet at Redfern Railway Station to proceed by the 8.22 a.m. train.\n\n(b) September 29th—To the Nepean River. Members to meet at Penrith Railway Station on the arrival of the 9 a.m. train from Sydney.\n\nDONATIONS.\n\n\"Illustrated Catalogue of the Museum of Comparative Zoology at Harvard College. No. VII.—Revision of the Echini.\" By Alexander Agassiz. Five Pamphlets on Entomological Subjects, by Herr J. Faust. From the Hon. W. Macleay, F.L.S., &c.\nCatalogue synonymique et systématique des Coléoptères de la Tribu des Carabides.” Par J. B. Géhin; “Catalogus Coleopterorum Lucanoidum.” Auctore, Major F. J. Sidney Parry, F.L.S., 3rd Edition. From T. G. Sloane, Esq.\n\n“Journal of the Royal Microscopical Society, London, 1888.” Part 3. From the Society.\n\n“The Journal of the Bombay Natural History Society.” Vol. III., No. 2 (1888). From the Society.\n\n“Mémoires de la Société de Physique et d’Histoire Naturelle de Genève.” Tome XXIX.—Seconde Partie (1886-87). From the Society.\n\n“Mémoires de la Société Zoologique de France, pour l’Année 1888.” Vol. 1, Nos. 1-3; “Bulletin.” Tome XIII., Nos. 4 and 5 (1888). From the Society.\n\n“Proceedings of the Zoological Society of London, for the year 1888.” Part I.; “Abstract of Proceedings, 19th June, 1888.” From the Society.\n\n“Feuille des Jeunes Naturalistes.” No. 213 (July, 1888). From the Editor.\n\n“Bulletin de la Société Belge de Microscopie.” XIV. Année No. 7 (1888). From the Society.\n\n“Records of the Geological Survey of India.” Vol. XXI. Part 2 (1888). From the Director.\n\n“L’Académie Royale de Copenhague—Bulletin pour 1887.” No. 3; “Bulletin pour 1888.” No. 1. From the Academy.\n\n“Zoologischer Anzeiger.” XI. Jahrg. Nos. 282 and 283 (1888). From the Editor.\n\"Proceedings of the Asiatic Society of Bengal.\" Nos. II. and III. (1888); \"Journal,\" n.s. Vol. LVI., Part ii., No. 4 (1887); Vol. LVII., Part ii., No. 1 (1888). From the Society.\n\nMonatliche Mittheilungen des Naturwissenschaftl. Vereins des Reg.-Bez. Frankfurt.\" Jahrg. V., Nos. 9-12 (Dec., 1887—March, 1888); \"Societaturn Litterae, 1887.\" No. 12 (Dec.); \"1888.\" Nos. 1-4 (Jan.—April). From the Society.\n\n\"Iconography of Australian Species of Acacia and Cognate Genera.\" Decades IX.-XI. By Baron Ferd. von Mueller, K.C.M.G., M. and Ph.D., F.R.S. From the Premier of Victoria through the Librarian, Public Library, Melbourne.\n\n\"Catalogue of Books added to the Radcliffe Library, Oxford University Museum, during the year 1887:\" \"List of Donations (1887.)\" From the Library.\n\n\"The Victorian Naturalist.\" Vol. V., No. 4 (August, 1888). From the Field Naturalists' Club of Victoria.\n\n\"Report of the Committee of Management of the Technological, Industrial, and Sanitary Museum of New South Wales for 1887.\" From the Curator.\n\nTransactions and Proceedings and Report of the Royal Society of South Australia.\" Vol. X. (1886-87). From the Society.\n\n\"Mémoires et Publications de la Société des Sciences, des Arts et des Lettres du Hainaut.\" IVe. Série. Tomes IX. et X. (1887-1888). From the Society.\n\n\"Catalogue of the Minerals and Rocks in the Collection of the Australian Museum;\" \"Catalogue of Mammalia in the Collection of the Australian Museum.\" By G. Krefft, F.L.S., &c. (1873). From Edward R. Deas Thomson, Esq.\n\"Bulletin of the American Geographical Society.\" Vol. XX., No. 2 (1888). From the Society.\n\n\"The Journal of Comparative Medicine and Surgery.\" Vol. IX., No. 3 (1888). From the Editor.\n\n\"Bulletin of the Museum of Comparative Zoology at Harvard College, Cambridge, U.S.A.\" Vol. XIII., No. 9 (1888). From the Curator.\n\n\"The Australasian Journal of Pharmacy.\" Vol. III., No. 32 (August, 1888). From the Editor.\n\n\"The American Naturalist.\" Vol. XXII. No. 257 (May 1888). From the Editors.\n\n\"Société Royale Malacologique de Belgique—Procès-Verbal.\" (July-Dec., 1887). From the Society.\n\n\"Australian Museum, Sydney—Report of the Trustees for 1887;\" \"Catalogue of Fishes—Part I. Recent Palæichthyan Fishes.\" By J. D. Ogilby, F.L.S. From the Trustees.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/malaysianlandfre00wood.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 110, "total-input-tokens": 150170, "total-output-tokens": 65064, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 54, 1], [54, 54, 2], [54, 1756, 3], [1756, 3939, 4], [3939, 6120, 5], [6120, 8317, 6], [8317, 10428, 7], [10428, 12149, 8], [12149, 13660, 9], [13660, 15021, 10], [15021, 16444, 11], [16444, 18021, 12], [18021, 19819, 13], [19819, 21382, 14], [21382, 23102, 15], [23102, 24887, 16], [24887, 26347, 17], [26347, 27893, 18], [27893, 29412, 19], [29412, 30888, 20], [30888, 32198, 21], [32198, 33742, 22], [33742, 35362, 23], [35362, 36983, 24], [36983, 38408, 25], [38408, 39796, 26], [39796, 41193, 27], [41193, 42589, 28], [42589, 43921, 29], [43921, 45521, 30], [45521, 47298, 31], [47298, 48543, 32], [48543, 49961, 33], [49961, 51430, 34], [51430, 52818, 35], [52818, 54325, 36], [54325, 55807, 37], [55807, 57058, 38], [57058, 58462, 39], [58462, 59917, 40], [59917, 61335, 41], [61335, 62743, 42], [62743, 64171, 43], [64171, 65536, 44], [65536, 68412, 45], [68412, 70278, 46], [70278, 71693, 47], [71693, 73172, 48], [73172, 74735, 49], [74735, 76184, 50], [76184, 77765, 51], [77765, 79159, 52], [79159, 80528, 53], [80528, 81778, 54], [81778, 83364, 55], [83364, 84626, 56], [84626, 85930, 57], [85930, 87391, 58], [87391, 88721, 59], [88721, 90085, 60], [90085, 91715, 61], [91715, 93354, 62], [93354, 94748, 63], [94748, 96348, 64], [96348, 97973, 65], [97973, 99624, 66], [99624, 101068, 67], [101068, 102523, 68], [102523, 103904, 69], [103904, 105473, 70], [105473, 107030, 71], [107030, 108287, 72], [108287, 110006, 73], [110006, 112280, 74], [112280, 114246, 75], [114246, 115529, 76], [115529, 116665, 77], [116665, 118106, 78], [118106, 119551, 79], [119551, 120766, 80], [120766, 121972, 81], [121972, 123276, 82], [123276, 124824, 83], [124824, 126378, 84], [126378, 127895, 85], [127895, 129518, 86], [129518, 131266, 87], [131266, 132793, 88], [132793, 134224, 89], [134224, 135916, 90], [135916, 137554, 91], [137554, 139182, 92], [139182, 140755, 93], [140755, 142398, 94], [142398, 143557, 95], [143557, 145337, 96], [145337, 146512, 97], [146512, 147775, 98], [147775, 149286, 99], [149286, 150029, 100], [150029, 150029, 101], [150029, 150029, 102], [150029, 150029, 103], [150029, 150029, 104], [150029, 150029, 105], [150029, 150029, 106], [150029, 150029, 107], [150029, 150029, 108], [150029, 150029, 109], [150029, 150029, 110]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, true, false, false, false]}}]