[{"id": "467ed04b2fa323018763f3217a4dd5eddc90b96d", "text": "LAWĀ'ĪḤ\nA TREATISE ON ṢŪFISM\n\nBY\nNŪR-UD-DĪN 'ABD-UR-RAḤMĀN JĀMĪ\n\nFACSIMILE OF AN OLD MS.\n\nWITH A TRANSLATION BY\nE. H. WHINFIELD, M.A., AND MĪRZĀ MUḤAMMAD KAZVĪNĪ\n\nAnd Preface on the Influence of Greek Philosophy upon Ṣūfism\n\nLONDON\nROYAL ASIATIC SOCIETY\n22, ALBEMARLE STREET\n1906\nSee but One, say but One, know but One.\n\nGulshan i Rāz : l. 833.\n\nThe *Alif* of the Loved One's form is graven on my heart,\nNo other letter did my Shaikh ever to me impart.\n\nḤāfiẓ : Ode 416 (ed. Brockhaus).\n\nMy heart inquired, 'What is the heaven-sent lore?\nIf thou'st attained it, teach me, I implore.'\n'*Alif,*' I said, 'if there be one within,\nOne letter serves to name him—say no more.'\n\nOmar Khayyām : Quatrain 109.\nCONTENTS\n\nPREFACE - vii\n\nTRANSLATION OF THE LAWĀ'ĪḤ - 17\n\nAPPENDICES:\n\nI.—GHAZZĀLĪ ON TAUḤĪḌ - 59\n\nII.—PLOTINUS - 64\n\nIII.—GHAZZĀLĪ ON MYSTICAL UNION - 70\n\nFACSIMILE OF MANUSCRIPT OF THE LAWĀ'ĪḤ (56 pages)\nPREFACE\n\nThe *Lawāʾiḥ* is a treatise on Ṣūfī theology or theosophy, as distinguished from the religious emotions experienced by all Ṣūfīs, learned and unlearned alike. Catholic authorities have drawn this distinction between ‘experimental’ and ‘doctrinal’ mysticism,¹ and it is a great help towards clear thinking on this subject. The religious emotion common to all mankind is, so to speak, raised to its nth power in the mystics. They are overwhelmed by the sense of the Divine omnipresence, and of their own dependence on God. They are dominated and intoxicated by their vivid sense of the close relation subsisting between the soul and God. They conceive themselves as being in touch with God, feeling His motions in their souls, and at times rising to direct vision of Him by the ‘inner light’ vouchsafed to them. These religious experiences were the rough material out of which the doctrinal reasoned system, set out in treatises like the *Lawāʾiḥ*, was built up. Psychologists have advanced various theories as to the genesis of these experiences.² With these we are not at present concerned. But as to the origin of the philosophical ideas and terms employed in the *Lawāʾiḥ* and similar works to formulate the Ṣūfī theology, there can be little doubt. The source of Ṣūfī theology was Neoplatonism.\n\nThe title of the book, *Lawāʾiḥ*, or ‘Flashes of Light,’\n\n¹ See the article on ‘Mystical Theology’ in Addis and Arnold’s ‘Catholic Dictionary.’\n\n² See Dr. William James’s ‘Varieties of Religious Experience’ (Longmans, 1902). It may be doubted whether the ‘subliminal self’ affords a satisfactory solution of the problem.\nsuggests the philosophy employed to systematize and give a reasoned basis for the unreasoned 'experiences' of unlearned Šūfīs. It of course refers to the 'inner light.' The Platonists were called Ishrāqīn or Illuminati, because they regarded intellectual intuition or intuitive reason as the main source of knowledge, whereas the Peripatetics (Mashshā'īn) recognised no sources of knowledge except the senses and the discursive reason (Dianoia). The word Ishrāq, or 'Lights,' is often met with in this connection. Thus Shams-ud-dīn Muḥammad ash-Shahrazūrī is called by Haji Khalfa 'a metaphysician learned in the inner lights' (Ishrāq).¹ Shihāb-ud-dīn as Suhrawardī, who was put to death at Aleppo in 537 A.H. by order of that valiant defender of the Faith, Sulṭān Ṣalāḥ-ud-dīn, wrote a book entitled Ḥikmat-ul-Ishrāq, or 'Philosophy of Inner Light.'² The author of the Dabistān says that the belief of the pure Šūfīs is the same as that of the Ishrāqīn or Platonists,³ and also that Šūfīs were classed as orthodox (Mutasharriʿī) and Platonists.⁴ Haji Khalfa, in his article on Šūfīsm (Tasawwuf), says that anyone who reads Šūfī books cannot fail to remark that their terminology is borrowed from the Platonists (Ishrāqīn), and more especially from the later ones—i.e., the Neoplatonists.⁵\n\nIt was probably at about the end of the fifth century A.H. that Neoplatonic gnōsis began to influence and modify Šūfī doctrine. Up to that date the doctrine had been expounded in short precepts, parables (mithāl), and similes like those in the Koran. But educated Moslems had outgrown these primitive methods of instruction. They wanted something more systematic. Jalāl-ud-dīn Rūmī tells us how his critics assailed him for dealing in trivial examples and parables instead of giving a systematic account of the stages of the soul's ascent to God.⁶ Ibn Khaldūn mentions Muḥāsibī and\n\n¹ Haji Khalfa, iii. 479.\n² Ibn Khallikan, iv. 158. This Shihāb-ud-dīn must not be confounded with his more famous namesake who died at Baghdad in the odour of sanctity in 632 A.H. Ibn Khallikan, ii. 382.\n³ Shea and Troyer's translation, iii. 281.\n⁴ Ibid., ii. 374; see also iii. 139.\n⁵ Haji Khalfa, ii. 308.\n⁶ See 'Masnavi,' p. 168.\nthe great Imām Ghazzālī as among the first who wrote systematic treatises on the doctrines of the Šūfīs. We have Ghazzālī’s own account of the way in which he was attracted to Šūfīsm, and other passages in his writings prove that he used the forms of Greek thought to explain Šūfī principles. If it be asked how Greek philosophy reached Ghazzālī, who was a native of Khurāsān, the answer is easy. When Justinian closed the schools at Athens, Damascius and his Neoplatonist brethren fled to the court of Nushirvān. They only remained there about a year, and left in 538 A.D.; but Nushirvān had some translations of Neoplatonist books made at the time, and these were followed by many others, made two centuries and a half later, under the Abbasides at Baghdad.\n\nGreek philosophy was expounded by the so-called Arabian, but really Persian, philosophers, Al Farābī and Avicena, and afterwards in the Ikhwān-us-Safā. Shahrastānī, a contemporary of Ghazzālī, gave accounts of all the chief Greek philosophers, including the ‘Shaikh of the Greeks’ or Plotinus, his editor Porphyry and Proklus. The so-called ‘Theology of Aristotle,’ which is a summary of the ‘Enneads’ of Plotinus, appeared probably soon afterwards. The result was that Neoplatonism, mainly in the form expounded by Plotinus, was used by all the more learned Šūfīs to explain and justify the simple emotional sayings of the early Šūfīs. Henceforward, Neoplatonism pervades all systematic treatises on Šūfīsm, such as the Faṣūṣ-ul-Hikam, the Maqṣad-ul-Aqṣā, the Gulshan i Rāz, and the Lawāʾiḥ. Even the poets use the\n\n---\n\n1 'Notices et Extraits des Manuscrits,' xii., pp. 301, 302.\n2 See Schmölders, 'Écoles Philosophiques chez les Arabes,' p. 55.\n3 See the passage on 'Tawhid' given in Appendix I.\n4 Khurāsān was the 'focus of culture,' as Hamner says, and most of the philosophers came from that Eastern province.\n5 Whittaker's 'Neoplatonists,' p. 133; and Schmölders, 'Documenta Philosophiae Arabum' (Bonn, 1836), Introduction.\n6 See Dieterici's 'Die Weltseele' (Leipzig, 1872).\n7 See Haarbrücker's German translation of Shahrastānī's 'Book of Sects,' ii. 192 (Halle, 1850).\n8 See Dr. Brönnle's note, Journal of the Royal Asiatic Society, April, 1901. The book was published with a Latin translation by Petrus Nicolaus in 1518.\n9 The late Professor Palmer published a summary of this book under the title of 'Oriental Mysticism' (Cambridge, 1867).\n10 Edited and translated by me (Trübner, 1880).\nGreek terminology. Thus Hakīm Sanā’i, who lived at the same time as Ghazzālī, introduces ‘Universal Reason’ and ‘Universal Soul,’ the second and third hypostases of the Trinity of Plotinus, and the principal later poets follow suit.\\(^1\\)\n\nThe first Šūfīs differed from ordinary Moslems only in their quietism (taslīm) and their puritan ideal of life. They held the orthodox doctrines, with perhaps a few reservations. But when Greek influences came into play all these doctrines underwent more or less modification. Take the following samples:\n\n1. The cardinal doctrine of Islām was altered from Monotheism to Monism. ‘There is no God but Allah’ became ‘There is no real Being or real Agent but “The One,” “The Truth”’ (\\textit{Al Haqq}).\n\n2. God is no longer a supramundane Deity, enthroned above the empyrean heaven, creating the world by one fiat, ruling His subjects, like some mighty monarch, by commands and prohibitions, and paying them wages according to their deserts. He has become a Being immanent and ‘deeply interfused’ in the universe,\\(^2\\) and giving it all the real existence it has. The Koran speaks of Allah as omniscient, but omniscience was now expanded into ‘omni-essence,’ if one may use such a word.\\(^3\\) And the Plotinian emanation doctrine was borrowed to support this.\n\n3. Like all great religious teachers, Muhammad laid chief stress on right conduct, and this consisted in implicit obedience to every one of Allah’s commands, as disobedience to any one was sin. The distinction between moral laws and com-\n\n---\n\n\\(^1\\) Mr. Nicholson has brought this out in his ‘Diwāni Shamsi Tabrīz’ (Cambridge, 1898). For a sketch of the system of Plotinus see Appendix II.\n\n\\(^2\\) \\textit{Cp.} Wordsworth, ‘Lines on Tintern Abbey’:\n\n‘A sense sublime\nOf something far more deeply interfused,\nWhose dwelling is the light of setting suns,\nAnd the round ocean and the living air,\nAnd the blue sky, and in the heart of man;\nA motion and a spirit that impels\nAll thinking things, all objects of all thought,\nAnd rolls through all things.’\n\n\\(^3\\) ‘Or omneity,’ as Sir Thomas Browne calls it in the ‘Religio Medici,’ § 35.\nmands merely relating to ritual observances was not clearly laid down. It has been said that Islām means 'striving after righteousness.'¹ That is so, but righteousness was interpreted as including the scrupulous observance of trivial rules as to ablutions, prayers, fasting, etc.² It may well be doubted if Muḥammad is responsible for some of the directions about ritual which are ascribed to him,³ but, be this as it may, more and more importance came to be assigned to the scrupulous observance of these ritual forms. The early Šūfīs disliked this externalism, and came to regard all rites as of small account. They thought that the mechanical routine of rites (taqlīd) only served to induce the spiritual torpor, which Dante called 'Accidia.'⁴ St. Bernard remarked this result in his monks, but he set it down to the fault of the men, not to that of the system. The Šūfī theologians adopted the Neoplatonist view that the ritual law is not binding upon spiritual men. St. Paul held a similar view. Shabistārī contrasts the mere outward Islām of ritual observances with the true piety of some heathens, much to the advantage of the latter, and Jalāl-ud-dīn Rūmī declares that 'Fools exalt the Mosque while they ignore the true temple in the heart.'⁵\n\n4. The Koranic doctrine of future rewards and punishments was ultimately refined away. The early Šūfīs held very strongly that love to God should be quite disinterested and untainted by hope of reward. They thought 'otherworldliness' no better than worldliness. According to the Šūfī theologians there is no material heaven or hell.\n\n---\n\n¹ Surah, lxxii. 14; Hirschfeld, p. 14; and Suhrawardy's 'Sayings of Muḥammad.' Jorjānī defines Islām as unquestioning obedience and submission to Allah's commands ('Notices et Extraits des Manuscrits,' x., p. 53).\n² See the rules about ablution, etc., in the 'Mishcāt ul Masābīh,' translated by Matthews (Calcutta, 1809). Cp. Omar Khayyām's 'whimsical complaint,' Quatrain 180.\n³ They seem opposed to the spirit of the text: 'Righteousness does not consist in turning to the east or to the west,' etc. (Surah, ii. 172).\n⁴ Purgatory (Canto XVII.).\n⁵ 'Gulshan i Rāz,' l. 877; and 'Masnavī,' p. 100, and Introduction, p. xxxiv (second edition). But elsewhere (at p. 76) Jalāl-ud-dīn says forms and symbols are generally needed. In default of some outward and visible sign which they can perceive, men find it hard to conceive the inward spirit.\nunion is attained, asked Shabistari, 'of what account then will be Paradise and the Houris?' On the other hand, those who lead evil lives would lose by degrees the portion of real being within them, dropping to the level of animals, or even plants, and finally relapsing into non-existence. This result is nowhere clearly stated, but seems implied in the language used, which is, of course, very guarded.\n\n5. Muḥammad had no taste for speculation. He said: 'Think on the mercies of God, not on the essence of God.' And again: 'Sit not with those who discuss predestination.' His language on predestination is merely popular. In one passage it is that of determinism, in another that of freewill. In one place Allah constrains all, guiding some aright and causing others to err. Elsewhere man acts freely without constraint. But the theologians fastened on these obscure problems, and did their best to shift the religious centre of gravity from right conduct to right opinion on these problems. The traditionists fathered on Muḥammad various sayings to prove that he regarded orthodoxy on these 'afterthoughts of theology' as all important for salvation. Thus the saying, 'My people shall be split into seventy-three sects, all of whom but one shall perish in hell fire,' is one which betrays theological authorship. In Muḥammad's lifetime the contest was not with sects within Islām, but with those who denied Islām altogether. For these he had no mercy, but he would scarcely have been so hard on his own people for venial errors of opinion. Again, he could hardly have said, 'Qadarians are Magian (dualists),' at a time when (as is almost certain) no sect of that name had yet arisen. The early Šūfīs did not concern themselves with the disputes of the sects. But the Šūfī theologians could not altogether ignore them. They took sides against the sects which leaned to anthropomorphism, and, on the other hand, fully agreed with the doctrine of the Compulsionists or extreme Predestinarians. That sect held that God, as the One real Agent,\n\n1 'Gulshan i Rāz,' l. 701.\n2 See Omar Khayyām (second edition), Appendix, p. 358.\n3 Koran, xvi. 38, 39.\n4 The Qadarians would be classed as semi-Pelagians by Western theologians.\n5 See 'Gulshan i Rāz,' l. 105 and 538.\nnot only permitted evil, but of set purpose allotted evils, present or future, to the majority of mankind. This strange doctrine (which has its parallel in Europe) forced the Ṣūfī theologians to attempt some reconciliation of Divine power, as thus interpreted, with Divine goodness, and here, like Augustine, they availed themselves of the 'not-being' ('adm) of Plotinus.\\(^1\\)\n\nPerhaps, however, the true Ṣūfī spirit was best interpreted by Jalāl-ud-dīn Rūmī, when he declared that he agreed with all seventy-three sects as being all honest attempts to grasp the obscure truth. Errors in 'naming the names of God' are of small account. According to the Ḥadīth, 'He who does the works will know the doctrine.' And true love to God atones for all mistakes of doctrine.\\(^2\\)\n\nJāmī is a typical Ṣūfī theologian. He works hard to construct a reasoned basis for Ṣūfism, but finally realizes that his logical definitions and syllogisms cannot express the truth as it really is, and add nothing to the grounds on which the convictions of Ṣūfis must always rest. It is only by means of the spiritual clairvoyance generated by love that Divine knowledge (maʿrifat) can be attained.\\(^3\\) Those who have these spiritual intuitions do not need demonstrations, and to those who have them not all demonstrations are useless.\n\n6. Muḥammad, like Luther, rejected asceticism. Suhrawardy quotes several of his anti-ascetic sayings, including the familiar one, 'There is no monasticism in Islām.' He approved of poverty, it is true, and prescribed a month of fasting, but set his face firmly against the cloistered life and celibacy.\\(^4\\) The early Ṣūfis were, perhaps, attracted to\n\n---\n\n\\(^1\\) See 'Masnavī' (second edition), Introduction, p. xxx, etc., and Flash XXVII. in this treatise.\n\n\\(^2\\) See the parable of Moses and the shepherd who was faulty in theology, but fervent in spirit ('Masnavī,' p. 82, and also p. 139).\n\n\\(^3\\) See 'Masnavī,' p. 260. Newman ('Apologia,' p. 19) quotes Keble as saying, 'The firmness of assent which we give to religious doctrine is due, not to the probabilities which introduced it, but to the living power of faith and love which accepted it.' This is worked out in Newman's 'Grammar of Assent.'\n\n\\(^4\\) See the 'Sayings of Muḥammad,' by Suhrawardy (Constable, 1905), Nos. 125, 304, 186, etc.\nasceticism by the example of the Christians in Syria, where\nthe first Ṣūfī convent was built; and Neoplatonist doctrine\nfurnished the rationale of ascetic practice. Matter was evil,\nand therefore all material and sensuous taint, including the\nnatural instincts (*phronēma sarkos*), must be purged away and\nextirpated by all who claimed to be spiritual men.\\(^1\\) Thus\na double system of religious conduct was set up—the external\nlaw for ordinary men and ‘the counsels of perfection,’ the\nmore perfect way of asceticism and contemplation for spiritual\nmen. The external law of ritual observances had no longer\nany dominion over spiritual men.\\(^2\\) This abrogation of the\nceremonial law naturally tempted some undisciplined Ṣūfīs,\nas it has tempted some professing followers of St. Paul,\nto laxity in the observance of the moral law. It is needless\nto say that these antinomian developments were never\ncountenanced by any reputable theologians or teachers, but,\non the contrary, were always condemned by them. Still, it\ncannot be denied that wild enthusiasts and false brethren did\noccasionally misinterpret Ṣūfī doctrines in this way, and thus\ngave some ground for the prejudices of orthodox Moslems\nagainst the whole body of Ṣūfīs.\n\nHarnack, in his ‘History of Dogma,’ has shown how pro-\nfoundly Christian theology has been affected by Neoplatonist\nideas. The disputes about *Ousia*, *Hypostasis*, and *Physis*\nwhich rent Christendom asunder\\(^3\\) mainly grew from ‘after-\nthoughts of theology’ suggested by these ideas, and their\ninfluence has extended to our own days.\\(^4\\) It is hardly too\nmuch to say that their influence on the course of events has\nbeen as considerable as that of the Roman law. In Islām\ntheir influence has been much more restricted than in\nChristendom, but, such as it was, it is instructive to trace it.\\(^5\\)\n\n\\(^1\\) Jalāl-ud-dīn Rūmī, however, takes occasion to warn his disciples that\nthis counsel of perfection is not to be taken too literally. See the parable\nof the peacock who tore off his plumage to avoid the pursuit of the\nfowlers (‘Masnavī,’ p. 228).\n\n\\(^2\\) See ‘Masnavī,’ p. 224.\n\n\\(^3\\) Gibbon’s ‘Decline and Fall,’ chapter xxi.\n\n\\(^4\\) ‘Paulus genuit Augustinum et Augustinus genuit Calvinum.’ With\nPaul should be coupled Plotinus. See Bigg’s ‘Introduction to Augustine’s\nConfessions’ (Methuen, 1903).\n\n\\(^5\\) For a sketch of the system of Plotinus, who is the best exponent of\nNeoplatonism, see Appendix II.\nThe manuscript of the Lawā’iḥ now reproduced is undated, but was probably written within a century of Jāmī’s death in 898 A.H. It once belonged to the royal library at Delhi, and the outside pages contain notes by the librarians, one of which, dated the twenty-fourth year of Aurangzib, states that it was worm-eaten even then. W. H. Morley, who also owned it, has noted on the fly-leaf his opinion that it is not Jāmī’s work, but written by one Sayyid ‘Abd-ul Kāfi. This, however, is certainly a mistake. Haji Khalfa, in his notice of Jāmī’s Lawā’iḥ, quotes the beginning, which agrees with the beginning of this manuscript,¹ and one of the quatrains gives Jāmī’s name. The British Museum possesses three copies—viz., Add. 16,820 (Rieu, p. 44a); Add. 16,819, iv (Rieu, p. 826b); and Add. 7,689, iv, folio 150 onwards (Rieu, p. 810b). Copies are to be found in other libraries. In addition to that now reproduced, I possess one, written in an Indian hand, probably in the eighteenth century.²\n\nThe facsimile of the manuscript has been made by Messrs. Nops, of Ludgate Hill. They have been very successful in removing nearly all traces of the stains and worm-holes in the original, and I think the writer of the manuscript himself, could he see it, would find little fault with their reproduction of his handiwork.\n\nI began the translation some years ago, but, owing to failing eyesight, had to stop after getting to the end of Flash VII. I have now been fortunate enough to secure the assistance of a very competent scholar, Mirzā Muḥammad Kazvīnī, who has furnished me with a literal French version of the whole, together with some valuable notes. In his translation the Mirzā has chiefly followed the British Museum Manuscript, Add. No. 16,819, which contains several passages not found in this manuscript. Most, if not all, of these seem to me to be glosses which have crept into the text, but I have given them in this translation, marking them with square brackets. Up to the end of Flash VII. the accompanying translation is that made by me some years ago, with some corrections sug-\n\n¹ Haji Khalfa, v. 344.\n² The Munich ‘Catalogue,’ p. 21, mentions a manuscript of the ‘Lawā’iḥ’ (sic) with a different beginning.\ngested by the Mirzā’s version. From the beginning of Flash VIII. to the end of the book the translation is the Mirza’s French version turned into English by me. In this part of the work I have followed the Mirzā closely, only referring to the original to verify a word here and there. I am solely responsible for the preface and notes. If they contain errors of fact or doctrine, these must not be imputed to the Mirzā.\n\nThe references to the Gulshan i Rāz are to my edition of that work (Trübner, 1880); those to the Masnavī of Jalāl-ud-dīn Rūmī to my translation of that poem (second edition, published in Trübner’s Oriental Series, 1898); those to Omar Khayyām to my text and translation, published in the same series, second edition, 1901.\n\nAs regards transliteration, I follow the rule laid down long since by the Indian Government, that when foreign words have become naturalized in English they should be spelled according to English usage. Thus I write Calcutta, Delhi, Koran, Abbasides, etc. Again, when a Persian writer has chosen to transliterate his own name in a particular way, I do not presume to interfere with his discretion. I give titles of books as they are spelled on the title-pages, and, like Rieu, I represent Hamza by the ‘spiritus lenis’ ('). With these exceptions I have in the main observed the transliteration rules of the Royal Asiatic Society.\n\nE. H. W.\nTRANSLATION OF THE LAWA’IH.\n\n‘I do not render praises unto Thee.’¹ How is this, seeing that ‘all praise returns to Thee’?² The threshold of Thy sanctity is too high for my praises. Thou art what Thine own praises declare Thee. O Lord, we are not able to tell Thy praises or set forth Thy glories. Whatsoever is manifested on the pages of the universe is praise reflected back to the threshold of Thy most glorious Majesty. What can faculty or tongue of mine declare worthy of Thy glory and honour? Thou art such as Thou hast Thyself declared, and the pearls of Thy praise are what Thyself hast strung.\n\nIn the vast largesse of Thy Majesty\nThis whole world’s but a drop from out the sea;\nWhat power have we to celebrate Thy praise?\nNo praises save Thine own are meet for Thee!\n\nWhere the speaker of the words, ‘I am the most eloquent [of the Arabs]’,³ lowered the flag of his eloquence, and found himself impotent to render Thee fitting praises, how shall a mere stammerer venture to open his mouth or a dullard deliver an apt discourse? Nevertheless, in this case to excuse one’s self on the ground of one’s incapacity and deficiencies is itself the gravest of defects, and to put one’s self on a level with that prince of the world and of the faith would be a serious breach of propriety.\n\n¹ A saying of Muhammad.\n² Fluegel (Haji Khalfa, v. 344) translates, ‘Quomodo possim?’ Cp. Surah, xvii. 46, ‘Neither is there aught which doth not celebrate Thy praise,’ and Ps. cxlv. 10.\n³ Referring to the saying, ‘I am the most eloquent of those who pronounce the letter Zād (Dzād),’ the Arab shibboleth.\nWhat am I? Can I count myself the peer\nOf the poor dog that's suffered to draw near?\nI may not join the caravan—enough\nIf from afar the camel bells I hear.\n\nO Lord, send down Thy blessing upon Muhammad, the standard-bearer of praise and possessor of 'the glorious station,'¹ and upon his family, and upon his companions who through earnest endeavour have succeeded in attaining the goal of their desire, and pour upon them all Thy perfect peace!\n\nSUPPLICATIONS.²\n\nO God, deliver us from preoccupation with worldly vanities, and show us the nature of things 'as they really are.'³ Remove from our eyes the veil of ignorance, and show us things as they really are. Show not to us non-existence as existent, nor cast the veil of non-existence over the beauty of existence. Make this phenomenal world the mirror⁴ to reflect the manifestations of Thy beauty, and not a veil to separate and repel us from Thee. Cause these unreal phenomena of the universe to be for us the sources of knowledge and insight, and not the cause of ignorance and blindness. Our alienation and severance from Thy beauty all proceed from ourselves. Deliver us from ourselves, and accord to us intimate knowledge of Thee.\n\nMake my heart pure, my soul from error free,\nMake tears and sighs my daily lot to be,\nAnd lead me on Thy road away from self,\nThat lost to self I may approach to Thee!\n\nSet enmity between the world and me,\nMake me averse from worldly company:\nFrom other objects turn away my heart,\nSo that it be engrossed with love to Thee.\n\n¹ 'It may be, O Muhammad, that thy Lord will raise thee to a glorious station' (Koran, xvii. 81), interpreted to mean, his power of intercession.\n² The headings are all omitted in this manuscript, but spaces are left, which were probably intended to be filled in with gold lettering.\n³ A prayer ascribed to Muhammad. See 'Gulshan i Rāz,' p. 21, note 1.\n⁴ The divine Real Being is reflected in 'Notbeing' ('adm) as in a mirror, and gives it all the reality it possesses. See 'Gulshan i Rāz,' p. 14, l. 134. This idea comes from Plotinus, 'the Shaikh of the Greeks.'\nHow were it, Lord, if Thou should’st set me free\nFrom error’s grasp and cause me truth to see?\nGuebres by scores Thou makest Musulmans,\nWhy, then, not make a Musulman of me?\n\nMy lust for this world and the next efface,\nGrant me the crown of poverty and grace\nTo be partaker in Thy mysteries,\nFrom paths that lead not towards Thee turn my face.\n\nPREFACE.\n\nThis is a treatise entitled *Lawa’ih*¹ (‘Flashes of Light’), explanatory of the intuitions and verities displayed on the pages of the hearts and minds of men of insight and divine knowledge, and of those who enjoy spiritual raptures and ecstasies. It is written in suitable language adorned with pleasing explanations. I trust that readers will hold of no account the personality of the author of this commentary, and will refrain from taking their seats upon the carpet of cavilling and animadversion. For the author plays only the part of interpreter in the following discussions; his sole function is that of mouthpiece, and nothing else.\n\nBelieve me, I am naught—yea, less than naught.\nBy naught and less than naught what can be taught?\nI tell the mysteries of truth, but know\nNaught save the telling to this task I brought.\n\nFor poverty to make no sign is best,\nOn love divine to hold one’s peace is best;\nFor him who never felt ecstatic joys\nTo play a mere reporter’s part is best.\n\nWith men of light I sought these pearls to string,\nThe drift of mystics’ sayings forth to bring;\nNow let his trusty slaves this tribute bear\nFrom foolish me to Hamadān’s wise king.²\n\n¹ Haji Khalfa (v., p. 344) says Sayyid Kāseh Karrānī wrote a Persian commentary upon it.\n² The person referred to is probably Shāh Manuchahr, Governor of Hamadān, who paid much attention to Jāmī when he visited the town in 877 A.H. See Lee’s preface to the ‘Nafahāt,’ p. 11. Note the pun on ‘Hama Dān’ (‘All-knowing’). Amir Sayyid ‘Alī of Hamadan, a Sūfī saint, is mentioned in the ‘Nafahāt,’ p. 515, but as he died in 786 A.H., it is not likely that Jāmī is speaking of him.\nFlash I.\n\nGod has not made man with two hearts within him. The Incomparable Majesty who has conferred the boon of existence upon thee has placed within thee but one heart, to the end that with single heart thou mayest love Him alone, and mayest turn thy back on all besides and devote thyself to Him alone, and refrain from dividing thy heart into a hundred portions, each portion devoted to a different object.\n\nO votary of earthly idols' fane,\nWhy let these veils of flesh enwrap thy brain?\n'Tis folly to pursue a host of loves;\nA single heart can but one love contain!\n\nFlash II.\n\nDistraction or disunion (Tafriqah) consists in dividing the heart by attaching it to divers objects. Union or collectedness (jam‘iyyat) consists in forsaking all else and being wholly engrossed in the contemplation of the One Unique Being. Those who fancy that collectedness results from the collecting of worldly goods remain in perpetual distraction, whilst those who are convinced that amassing wealth is the cause of distraction renounce all worldly goods.\n\nO thou whose heart is torn by lust for all,\nYet vainly strives to burst these bonds of all,\nThis ‘all’ begets distraction of the heart:\nGive up thy heart to ONE and break with all.\n\nWhile thou’rt distraught by hell-born vanity,\nThou’rt seen by men of union base to be;\nBy God, thou art a demon, and no man,\nToo ignorant thy devilry to see.\n\nO pilgrim on the ‘path’ vain talk reject;\nAll roads save that to Unity neglect;\nNaught but distractedness proceeds from wealth:\nCollect thine heart, not store of wealth collect.\n\n1 ‘Lā‘ihah.’ These headings, which are found in other manuscripts, are omitted in this, as before remarked.\n2 Koran, xxxiii. 4.\n3 Also ‘tranquillity,’ ‘congregation,’ ‘totality.’\n4 Nasnās; literally, a fabulous monster, a satyr.\n5 Sālik.\nO heart, thy high-prized learning of the schools,\nGeometry and metaphysic rules—\nYea, all but lore of God is devils' lore:\nFear God and leave this evil lore to fools.\n\nFlash III.\n\nThe 'Truth,' most glorious and most exalted, is omnipresent. He knows the outer and inner state of all men in every condition. Oh, what a loss will be thine if thou turnest thine eyes from His face to fix them on other objects, and forsakest the way that is pleasing to Him to follow other roads!\n\nMy Love stood by me at the dawn of day,\nAnd said, 'To grief you make my heart a prey;\nWhilst I am casting looks of love at you,\nHave you no shame to turn your eyes away?'\n\nAll my life long I tread love's path of pain,\nIf peradventure 'union' I may gain.\nBetter to catch one moment's glimpse of Thee\nThan earthly beauties' love through life retain.\n\nFlash IV.\n\nEverything other than the 'Truth' (may He be glorified and exalted) is subject to decay and annihilation. Its substance is a mental figment with no objective existence, and its form is a merely imaginary entity.\n\nYesterday this universe neither existed nor appeared to exist, while to-day it appears to exist, but has no real existence: it is a mere semblance, and to-morrow nothing thereof will be seen. What does it profit thee to allow thyself to be guided by vain passions and desires? Why dost thou place reliance on these transitory objects that glitter with false lustre? Turn thy heart away from all of them, and firmly attach it to God. Break loose from all these, and cleave closely to Him. It is only He who always has been and always will continue to be. The countenance of His eternity is never scarred by the thorn of contingency.\nThe fleeting phantoms you admire to-day\nWill soon at Heaven's behest be swept away.\nO give your heart to Him who never fails,\nWho's ever with you and will ever stay.\n\nWhen to fair idols' shrines I did repair,\nI vexed my heart with griefs encountered there;\nNow earthly beauty has lost all its charm,\nEternal beauty is my only care.\n\nThings that abide not to eternity\nExpose thee to misfortune's battery;\nIn this life, then, sever thyself from all\nFrom which thy death is bound to sever thee.\n\nPerchance with wealth and sons endowed thou art.\nYet with all these erelong thou'lt have to part.\nThrice happy he who gives his heart to One,\nAnd sets affection on the men of heart.\n\nFlash V.\n\nThe Absolute Beauty is the Divine Majesty endued with [the attributes of] power and bounty. Every beauty and perfection manifested in the theatre of the various grades of beings is a ray of His perfect beauty reflected therein. It is from these rays that exalted souls have received their impress of beauty and their quality of perfection.\\(^1\\) Whosoever is wise derives his wisdom from the Divine wisdom. Wherever intelligence is found it is the fruit of the Divine intelligence. In a word, all are attributes of Deity which have descended from the zenith of the Universal and Absolute to the nadir of the particular and relative. [They have descended] to the end that thou mayest direct thy course from the part towards the Whole, and from the relative deduce the Absolute, and not imagine the part to be distinct from the Whole, nor be so engrossed with what is merely relative as to cut thyself off from the Absolute.\n\nThe Loved One's rose-parterre I went to see,\nThat beauty's Torch\\(^2\\) espied me, and, quoth He,\n'I am the tree; these flowers My offshoots are.\nLet not these offshoots hide from thee the tree.'\n\n\\(^1\\) Spenser in the 'Hymn of Heavenly Love' expresses the same idea, which comes from Plato.\n\\(^2\\) Literally, 'Torch of Tirāz,' a town in Turkistān famed for its beautiful women.\nWhat profit rosy cheeks, forms full of grace,\nAnd ringlets clustering round a lovely face?\nWhen Beauty Absolute beams all around,\nWhy linger finite beauties to embrace?\n\nFlash VI.\n\nMan, in regard to his corporeal nature, stands at the lowest point of degradation; nevertheless, in regard to his spiritual nature, he is at the summit of nobility. He takes the impress of every thing to which he directs his attention, and assumes the colour of every thing to which he approaches. Wherefore philosophers say that when the reasonable soul adorns itself with exact and faithful impressions of realities, and appropriates to itself the true character of such realities, it becomes such as if it were itself altogether essential Being. In like manner the vulgar, by the force of their conjunction with these material forms and extreme preoccupation with these corporeal liens, come to be such that they cannot distinguish themselves from these forms or perceive any difference between the two. Well says the Maulavi of Rüm (may God sanctify his secret) in the *Masnavī*:\n\nO brother, thou art wholly thought,\nFor the rest of thee is only bone and muscle:\nIf thy thought be a rose, thou art a rose-bouquet;\nIf it be a thorn, thou art fuel for the fire.\n\nWherefore it behoves thee to strive and hide thyself from thy sight,¹ and occupy thyself with Very Being, and concern thyself with the ‘Truth.’ For the various grades of created things are theatres of His revealed beauty, and all things that exist are mirrors of his perfections.\n\nAnd in this course thou must persevere until He mingles Himself with thy soul, and thine own individual existence passes out of thy sight. Then, if thou regardest thyself, it is He whom thou art regarding; if thou speakest of thyself, it is He of whom thou art speaking. The relative has become the Absolute, and ‘I am the Truth’ is equivalent to ‘He is the Truth.’\n\n¹ Variant, ‘hide thyself from the sight of the world.’\n² The saying of Manṣūr i Ḥallāj (or Ibn Ḥallāj), the Sufi martyr.\nIf love of rose or bulbul fill thine heart,\nThyself a rose or eager bulbul art.\nThou art a part; the 'Truth' is all in all.\nDwell on the 'Truth,' and cease to be a part.\n\nOf my soul's union with this fleshly frame,\nOf life and death Thou art the end and aim.\nI pass away; Thou only dost endure.\nWhen I say 'me,' 'tis Thee I mean to name.\\(^1\\)\n\nWhen will this mortal dress be torn away,\nAnd Beauty Absolute His face display,\nMerging my soul in His resplendent light,\nBlinding my heart with His o'erpowering ray?\n\nFlash VII.\n\nIt is necessary for thee to habituate thyself to this intimate relation in such wise that at no time and in no circumstance thou mayest be without the sense of it, whether in coming or in going, in eating or sleeping, in speaking or listening. In short, thou must ever be on the alert both when resting and when working, not to waste thy time in insensibility [to this relation]—nay, more, thou must watch every breath, and take heed that it goeth not forth in negligence.\n\nThe years roll on; Thou showest not Thy face,\nYet nothing from my breast Thy love can chase;\nThine image ever dwells before mine eyes,\nAnd in my heart Thy love aye holds its place.\n\nFlash VIII.\n\nIn like manner, as it behoves thee to maintain the said relation continually, so it is of the first importance to develop the quality thereof by detaching thyself from mundane relations and by emancipating thyself from attention to contingent forms; and this is possible only through hard striving and earnest endeavour to expel vain thoughts and imaginations from thy mind. The more these thoughts are cast out and\n\n\\(^1\\) Compare the story of the Šūfi aspirant who was refused admittance by his Pir till he ceased to speak of 'me' and called himself 'thee' ('Masnavī,' p. 47).\nthese suggestions checked, the stronger and closer this relation becomes. It is, then, necessary to use every endeavour to force these thoughts to encamp outside the enclosure of thy breast, and that the 'Truth' most glorious may cast His beams into thy heart, and deliver thee from thyself, and save thee from the trouble of entertaining His rivals in thy heart. Then there will abide with thee neither consciousness of thyself, nor even consciousness of such absence of consciousness—nay, there will abide nothing save the One God alone.\n\nFrom my brute nature, Lord, deliver me,\nAnd from this life of evil set me free;\nPurge me of my own sense and ignorance,\nAnd make me lose my very self in Thee.\n\nWhen poor indeed and dead to self thou'lt need\nNo visions, knowledge, certitude, or creed;\nWhen self has perished naught but God remains,\nFor 'Perfect poverty is God indeed.'\n\nFlash IX.\n\nSelf-annihilation consists in this, that through the overpowering influence of the Very Being upon the inner man, there remains no consciousness of aught beside Him. Annihilation of annihilation consists in this, that there remains no consciousness even of that unconsciousness. It is evident that annihilation of annihilation is involved in [the very notion of] annihilation. For if he who has attained annihilation should retain the least consciousness of his annihilation, he would not be in the state of annihilation, because the quality of annihilation and the person possessing such quality are both things distinct from the Very Being, the 'Truth' most glorious. Therefore, to be conscious of annihilation is incompatible with annihilation.\n\n1 See the passage from Ghazzālī in Appendix III.\n2 Dadī, brutishness. Some manuscripts read duwi, disease, but this does not suit the rhyme, which in verses with a burden (radīf) always precedes it. Scan dādīyi, dissolving long ī and lengthening the iẓāfat.\n3 Seemingly a Ḥadīth. Poverty, utter annihilation of self ('Gulshan i Rāz,' l. 128, and note).\n4 So Ghazzālī, quoted in Appendix III.\nWhile fondness for your 'self' you still retain,\nYou'll not reduce its bulk a single grain—\nYea, while you feel one hair's-breadth of yourself\nClaims to annihilation are but vain.\n\nFlash X.\n\nUnification\\(^1\\) consists in unifying the heart—that is to say, in purifying it and expelling from it attachment to all things other than the 'Truth' most glorious, including not only desire and will, but also knowledge and intelligence. In fact, one must quench desire of all things hitherto desired, and cease to will what one has hitherto willed, and also remove from the intellectual vision all concepts and all cognitions, and turn away the mind from all things whatsoever, so that there remains no consciousness or cognition of aught save the 'Truth' most glorious. [Khwāja 'Abdullāh Anṣārī said: 'Unification is not merely believing Him to be One, but in thyself being one with Him.'\\(^2\\)\n\n'Oneness' in pilgrims' phraseology\nIs from concern with 'other' to be free;\nLearn, then, the highest 'station' of the birds,\\(^3\\)\nIf language of the birds be known to thee.'\n\nFlash XI.\n\nSo long as a man remains imprisoned in the snare of passions and lusts, it is hard for him to maintain this close communion [with the 'Truth']. But from the moment that sweet influence takes effect on him, expelling from his mind the firebrand of vain imaginations and suggestions, the pleasure he experiences therefrom predominates over bodily pleasures and intellectual enjoyments. Then the painful sense of effort passes away, and the joys of contemplation\n\n---\n\n\\(^1\\) Tauḥīd is the Henōsis of Plotinus, the becoming one with the 'One.'\n\n\\(^2\\) This sentence occurs only in the British Museum copy, Add. 16,819. Khwāja 'Abdullāh Anṣārī of Herāt, who died 481 A.H., was named the Shaikh of Islām, and is often quoted by Jāmī in the 'Nafahāt.' See Haji Khalfa, i., 235.\n\n\\(^3\\) Alluding to the 'Discourse of the Birds and their Pilgrimage to the Sīmurgh,' by Farīd-ud-dīn 'Attār. 'Other' the Heterotēs of Plotinus.\ntake possession of his mind; he banishes from his heart all alien distractions, and with the tongue of ecstasy murmurs this canticle:\n\nLike bulbul I'm inebriate with Thee,\\(^1\\)\nMy sorrows grow from memories of Thee,\nYet all earth's joys are dust beneath the feet\nOf those entrancing memories of Thee.\n\nFlash XII.\n\nWhen the true aspirant perceives in himself the beginnings of this Divine attraction, which consists in experiencing pleasure whenever he thinks of the 'Truth' most glorious, he ought to exert all his endeavours to develop and strengthen this experience, and simultaneously to banish whatever is incompatible therewith. He ought to know, for instance, that even though he should employ an eternity in cultivating this communion, that would count as nothing, and he would not have discharged his duty as he ought.\n\nOn my soul's lute a chord was struck by Love,\nTransmuting all my being into love;\nAges would not discharge my bounden debt\nOf gratitude for one short hour of love.\n\nFlash XIII.\n\nThe essence of the 'Truth' most glorious and most exalted is nothing but Being. His\\(^2\\) Being is not subject to defect or diminution. He is untouched by change or variation, and is exempt from plurality and multiplicity; He transcends all manifestations, and is unknowable and invisible. Every 'how' and 'why' have made their appearance through Him; but in Himself He transcends every 'how' and 'why.' Everything is perceived by Him, while he is beyond perception. The out-\n\n\\(^1\\) So in the *Stabat Mater*:\n\n'Fac me cruce inebriari.'\n\n\\(^2\\) I prefer to emphasize the religious rather than the philosophic and abstract aspect of the 'Truth,' and therefore use the personal pronoun. Thus, the 'Ideal Good' of Plato's 'Republic,' Book VI., is spoken of as 'God' in the 'Timaeus.' Just so 'To Kurion' has changed into 'Dominus' in the Western version of the Nicene Creed.\nward eye is too dull to behold His beauty, and the eye of the heart is dimmed by the contemplation of His perfection.\n\nThou, for whose love I've sacrificed existence,\nArt, yet art not, the sum of earth's existence;\nEarth lacks true Being, yet depends thereon—\nThou art true Being: Thou art pure existence.\n\nThe Loved One is quite colourless,\\(^1\\) O heart;\nBe not engrossed with colours, then, O heart:\nAll colours come from what is colourless,\nAnd 'who can dye so well as God,'\\(^2\\) O heart?\n\nFlash XIV.\n\nBy the word 'existence'\\(^3\\) is sometimes meant simply the state of being or existing, which is a generic concept or an abstract idea. Taken in this sense, 'existence' is an 'idea of the second intention,'\\(^4\\) which has no external object corresponding with it. It is one of the accidents of the 'quidity'\\(^5\\) [or real nature of the thing] which exists only in thought, as has been proved by the reasonings of scholastic theologians and philosophers. But sometimes 'existence' signifies the Real Being, who is Self-existent, and on whom the existence of all other beings depends; and in truth there is no real external existence beside Him—all other beings are merely accidents accessory to Him, as is attested by the intuitive apprehension of the most famous Gnostics and 'Men of Certitude.' The word ['existence'] is applicable to the 'Truth' most glorious in the latter sense only.\n\nThings that exist to men of narrow view\nAppear the accidents to substance due;\nTo men of light substance is accident,\nWhich the 'True Being' ever doth renew.\\(^6\\)\n\n---\n\n1 Bīrangī. Absence of visible or knowable qualities.\n2 Koran, ii. 132.\n3 Wajūd, usually 'necessary being' as opposed to 'contingent.' Jāmī wrote a treatise on it, quoted in the 'Dabistan,' chapter xii.\n4 Ma'qūlāt i thānīyah. In scholastic terminology terms of the second intention are those which express abstractions from concrete individual objects—e.g., genus, species, etc. Rabelais made fun of this term: 'Utrum chimera bombinans in vacuo comedere possit secundas intentiones?'\n5 Quidity, what a thing is, a word derived by the Schoolmen from māhiyāt. See Schmölders, 'Documenta Philosophiae Arabum,' p. 133.\n6 'In Him we live and move and have our being' (Acts xvii. 28).\nFlash XV.\n\nThe attributes are distinct from the Real Being in thought, but are identical with Him in fact and reality. For instance, the Real Being is omniscient in respect of His quality of knowledge; omnipotent in respect of His power; absolute in respect of His will. Doubtless, just as these attributes are distinct from each other in idea, according to their respective meanings, so they are distinct from the Real Being; but in fact and reality they are identical with Him. In other words, there are not in Him many existences, but only one sole existence, and His various names and attributes are merely His modes and aspects.\n\nPure is Thy essence from deficiency,\nExpressed its 'how' and 'where' can never be;\nThy attributes appear distinct, but are\nOne with Thy essence in reality.\n\nFlash XVI.\n\nThe Real Being, qud Being, is above all names and attributes, and exempt from all conditions and relations. The attribution to Him of these names only holds good in respect of His aspect towards the world of phenomena. In the first manifestation, wherein He revealed Himself, of Himself, to Himself, were realized the attributes of Knowledge, Light, Existence and Presence. Knowledge involved the power of knowing and that of being known; Light implied those of manifesting and of being manifest; Existence and Presence entailed those of causing to exist and of being existent, and those of beholding and of being beheld. And thus the manifestation which is a characteristic of Light is preceded by concealment; and concealment, by its very nature, has the priority over, and is antecedent to, manifestation; hence the concealed and the manifested are counted as first and second.\n\nAnd in like manner in the case of the second and third manifestations, etc., as long as it pleases God to continue them, these conditions and relations always go on redoubling\nthemselves. The more these are multiplied, the more complete is His manifestation, or rather His concealment. Glory be to Him who hides Himself by the manifestations of His light, and manifests Himself by drawing a veil over His face. His concealment has regard to His pure and absolute Being, while His manifestation has regard to the exhibition of the world of phenomena.\n\n'O fairest rose,\\(^1\\) with rosebud mouth,' I sighed,\n'Why, like coquettes, thy face for ever hide?'\nHe smiled, 'Unlike the beauties of the earth,\nEven when veiled I still may be descried.'\n\nThy face uncovered would be all too bright,\nWithout a veil none could endure the sight;\nWhat eye is strong enough to gaze upon\nThe dazzling splendour of the fount of light?\n\nWhen the sun's banner blazes in the sky,\nIts light gives pain by its intensity,\nBut when 'tis tempered by a veil of cloud\nThat light is soft and pleasant to the eye.\n\nFlash XVII.\n\nThe first Epiphany\\(^2\\) is a pure unity and a simple potentiality, which contains all potentialities, including not only that of being unconditioned by modes and qualities, but also that of being conditioned thereby. Viewed as unconditioned by modes and qualities, including even the potentiality of being thus unconditioned, it is the stage termed 'Unity'; and so possesses Concealment, Priority, and Existence from eternity. On the other hand, when viewed as conditioned by modes and qualities, it is the stage termed 'Singleness,' and in this aspect it is marked by Manifestation, Posteriority, and Duration to all eternity. Among these modes of the stage 'Singleness,' some are such that the qualification of the One\n\n\\(^1\\) Cp. 'Rosa mystica' in the Litany of the Virgin. Jalāl-ud-dīn Rūmī apologizes for applying such terms to God ('Masnavi,' p. 34).\n\n\\(^2\\) Ta'ayyun. The first Emmanation is 'Unity' with the 'Truth' as being His image and mind (Logos endiathetos), but when evolved to view (Logos prophorikos), and as the channel of Being downwards, it is 'Unity' with a difference, which is sought to be expressed by the term 'Singleness' (Wāḥidiyat instead of Aḥadiyat).\nBeing by them has regard to the stage called the 'Whole,'\\(^1\\) whether they imply the realization in the universe of things corresponding to the names 'Creator' and 'Sustainer,' etc., or merely attributes, such as Life, Knowledge, and Will. This is the class of attributes which pertain to the Divinity and the Sovereignty. The forms under which the One Real Being is conceived, when clothed with these names and attributes, are the 'divine substances.'\\(^2\\) The clothing of the outward aspect of Being\\(^3\\) with these forms does not necessitate multiplicity of beings. Other modes are such that the qualification of the One Real Being by them has relation to the various grades of 'mundane existences,'\\(^4\\) as, for instance, Difference, Property,\\(^5\\) and the phenomena which distinguish external objects from one another. The forms under which the One Real Being is conceived, when clothed with these modes, are 'the mundane substances,'\\(^6\\) and the clothing of the outward aspect of Being with these forms \\textit{does} necessitate a multiplicity of beings. Among these mundane substances, some are such that when Being, considered in the stage of the 'Unity of the Whole,'\\(^7\\) is interfused in them, and His effects and properties manifest themselves therein, these substances have the potentiality of being theatres exhibiting all the Divine names—save those peculiar to the Divine Essence—according to the varying strength of the manifestations, which may be powerful or feeble, irresistible or defeasible. These are the perfect individuals of the human race—to wit, prophets and saints. Others, again, are such that they have the potentiality of being theatres exhibiting only some of the\n\n---\n\n\\(^1\\) \\textit{Martaba i Jam'}. The second emanation, Universal Soul, which comprehends in itself all particular souls, rational, animal, and vegetive. This Aristotelian doctrine of the soul became a commonplace of the schools, and is referred to by Milton, Dryden, etc.\n\n\\(^2\\) Substance is \\textit{quod substat}—\\textit{i.e.}, the reality underlying sensible phenomena. \\textit{Haqiq i ilahiya}.\n\n\\(^3\\) \\textit{I.e.}, the first stage of His revelation.\n\n\\(^4\\) \\textit{Maratib i kauniya}.\n\n\\(^5\\) Difference, property, accident, genus, and species, are the five heads under which Aristotle classed the general terms capable of being used as predicates.\n\n\\(^6\\) \\textit{Haqiq i kauniya}.\n\n\\(^7\\) \\textit{Akadiyat i Jam'}. This is the second emanation (see Flash XXIV.). It is usually called \\textit{nafs i kull}, or Universal Soul.\nDivine names, and not all of them, according to the aforesaid varying strength of the manifestation. These are the rest of the human race.\n\nThe Majesty of the One Real Being, viewed under the aspect of the 'Unity of the Whole,' which comprehends all His modes, both Divine and mundane,\\(^1\\) is for ever immanent in all these substances, and manifesting Himself in them. These substances are the parts of the whole Unity, whether they exist in the world of spirits or in that of 'ideas,'\\(^2\\) in the sensible and visible world, in the world that now is, or in that which is to come. The final Cause\\(^3\\) of all this process is the realization or manifestation of the perfection of the Divine names, which is termed \\textit{jalā} and \\textit{istijlā}. \\textit{Jalā} signifies their outward manifestation according to their various modes; and \\textit{istijlā} their display to the Deity Himself, according to these same modes. \\textit{Jalā} is a visible and intelligible manifestation or representation, just as the whole is represented by its parts. Contrariwise, the perfection of the Divine Essence, is the manifestation of the One Real Being to Himself, for Himself, without relation to anything beside Himself. This is a secret and intelligible manifestation.\n\nAbsolute self-sufficiency is a quality involved in Divine Perfection. It signifies this, that in a general and universal manner all the modes, states, and aspects of the One Real Being with all their adherent properties and qualities, in all their presentations, past, present or future, manifested in all grades of substances, Divine and mundane, are present and realized in the secret thought of that Divine Being, in such wise that the sum of them all is contained in His Unity. From this point of view He is independent of all other existences, as it is said, 'God most glorious can do without the world':\\(^4\\)\n\n\\(^1\\) I.e., plurality summed up in Unity.\n\n\\(^2\\) The world of 'ideas' is the Platonic 'intelligible' world of ideas or archetypes, apprehended only by Reason (\\textit{nous}), as opposed to the 'sensible' world of phenomena apprehended by the senses—'\\textit{ālam i 'ilmī}' as opposed to '\\textit{ālam i 'ainī}'.\n\n\\(^3\\) In Aristotle's language the end (telos) of a thing is its 'final cause'—i.e., the reason of its existence.\n\n\\(^4\\) Koran, xxix. 5.\nThe robe of Love is independent, free\nFrom need to soil with dust its purity;\nWhen Actor and Spectator are the same\nWhat means this 'we' and 'thou'? There is\nno 'we.'\n\nAll modes and attributes of Very Being\nAre realized and present in that Being;\nTo see them He needs not contingent beings:\n'Tis the contingent needs the Very Being.\n\nHe needs not to see good and ill set out,\nThe One needs not to count its numbers out;\nThe Truth can view all things within Himself;\nWhat need, then, to review them all without?\n\nFlash XVIII.\n\nWhen you abstract the appearances and characteristics of\nthe individuals which constitute the various species included\nin the genus 'animal,' the individuals are gathered up into\ntheir respective species. When, again, you abstract the\ncharacteristics of each species, i.e., their 'differences' and\n'properties,' all such species are gathered up into the reality\nof the genus 'animal.' Again, when you abstract the\ncharacteristics of the genus 'animal,' and those of all other\ngenera included in the higher genus 'growing body,' all such\ngenera coalesce under that genus, 'growing body.' So when\nyou abstract the characteristics of 'growing body,' and all\nother genera included along with it under the higher genus\n'body,' all such genera are united in the reality of the genus\n'body.' Furthermore, when you abstract the characteristics\nof 'body' and those of all other genera included therewith in\n\n1 Cp. Omar Khayyām, Quatrain 475, and 'Gulshan i Rāz,' p. 15,\nl. 143. 'He [God] is at once seer and thing seen.'\n2 Contingent being is opposed to necessary being. It is, so to speak,\nunreal matter permeated with Real Being. 'It thus is, and is not, and\npartakes both of existence and of non-existence,' as Jowett says.\n3 So Mansūr-i-Hallāj: 'The numbers of Unity are only the counting of\nUnity.'\n4 The controversy of realism and nominalism raged among Moslems as\nwell as among European Schoolmen (see Schnölders, 'Documenta,' etc.,\np. 3). Jāmī was evidently a realist. He holds genus and similar general\nterms to be actual realities (ma'ni), and not mere names. The whole\nargument in this section rests on the assumption that these genera are real\nentities.\nthe higher genus 'substance,' to wit, the 'intelligences' and 'souls,' all such genera will be united in the reality of the higher genus 'substance'; so when you abstract the characteristics distinctive of 'substance' and 'accident,' these two genera are united into the [reality of the genus] 'contingent.' Finally, when you abstract the characteristic distinctions of 'contingent' and 'necessary,' these two are united in the 'Absolute Existence,' which is the veritable Being, existing of Himself, and not through another being beyond Himself. Necessity is His external quality, and 'Contingency' His internal quality—i.e., they are the 'archetypal ideas'\\(^1\\) generated by His self-revelation to Himself when assuming His 'modes.'\n\nAll these distinctions, whether called 'difference' and 'property' or 'appearances' and 'characteristics,' are 'Divine Modes,' contained and involved in the 'Unity of the One Real Being.' First, these modes are represented under the form of the 'archetypal ideas' in the stage called the 'Divine Thought' (or knowledge);\\(^2\\) in the next place, in the stage of the 'sensible world,' when clothed with the properties and attributes of external existence—which is the theatre of manifestation, a mirror reflecting the inner Divine Being—these modes assume the forms of external objects.\n\nIt follows, therefore, that in the external world there is only One Real Being, who, by clothing Himself with different modes and attributes, appears to be endued with multiplicity and plurality to those who are confined in the narrow prison of the 'stages,' and whose view is limited to visible properties and results.\n\nCreation's book I studied from my youth,\nAnd every page examined, but in sooth\nI never found therein aught save the 'Truth,'\nAnd attributes that appertain to 'Truth.'\n\n\\(^1\\) A'yān i thābitah, the 'Ideas' of Plato's 'Intelligible World,' the archetypes or patterns of all things in the external and 'sensible world.' In the system of Plotinus these ideas are all contained in the first emanation, reason (nous). Jāmī expresses 'intelligible world' by 'ālam i 'ilm, and 'sensible world' by 'ālam i 'ain.\n\n\\(^2\\) Martaba i 'ilm, i.e., 'aql i kull, nous, or Logos, the first epiphany or emanation.\nWhat mean Dimension, Body, Species,\nIn Mineral, Plant, Animal degrees?\nThe 'Truth' is single, but His modes beget\nAll these imaginary entities.\n\nFlash XIX.\n\nWhen one says that the multiplicity of things is comprehended in the Unity of the One Real Being, this does not mean that they are the parts contained in an aggregate, or as objects contained in a receptacle; but that they are as the qualities inherent in the object qualified or as consequences flowing from their cause. Take, for instance, the half, the third, the fourth, and other fractions up to infinity, which are potentially\\(^1\\) contained in the integer, one, though not actually manifested until they are exposed to view by repeating the various numbers and fractions.\n\nIt follows from this that when one says that the 'Truth' most glorious comprehends all beings, the meaning is that He comprehends them as a cause comprehends its consequences, not that He is a whole containing them as His parts, or as a vase containing things within it. God is too exalted above everything which is unworthy to touch the threshold of His holiness.\\(^2\\)\n\nThese modes\\(^3\\) are in the essence of the 'Truth,'\nLike qualities which qualify the 'Truth';\nBut part and whole, container and contained,\nExist not where God is, Who is the 'Truth.'\n\nFlash XX.\n\nThe manifestation or concealment of the modes and facets—in other words, the circumstance that the outward aspect of Being does or does not clothe Himself with them—causes no change in the 'substance' of such Being or in His essential\n\n---\n\n1 Potentiality and actuality are two of Aristotle's forms of thought, *dunamis* and *energeia* (*qīwat* and *fiʿl*).\n2 God pervades everything, but everything is not God. Thus the strict Monism of some previous statements is considerably toned down.\n3 *Shāʾn.* The 'Modalists' used the term 'modes' to indicate differences of form appearing in the One Substance (Harnack 'On Dogma,' iii. 53), and thus to avoid ditheism.\nattributes, but only a change in His connections and relations, which, in fact, necessitates no change in His essence. For instance, if 'Amr gets up from the right of Zaid and goes and sits down on his left, the relation of Zaid to 'Amr in respect to position will be changed, but his essence and his inherent qualities will remain unchanged.\n\nThus, the One Real Being underlying all outward existence does not become more perfect by clothing Himself with noble forms, nor does He degrade Himself by manifestation in inferior theatres. Although the light of the sun illuminates at once the clean and the unclean, yet it undergoes no modifications in the purity of its light; it acquires neither the scent of musk nor the colour of the rose, the reproach of the thorn nor the disgrace of the rugged rock.\n\nWhen the sun sheds his light for all to share,\nIt shines on foul things equally with fair;\nFair things do not augment its radiance,\nNor can foul things its purity impair.\n\nFlash XXI.\n\nThe Absolute does not exist without the relative, and the relative is not formulated without the Absolute; but the relative stands in need of the Absolute, while the Absolute has no need of the relative. Consequently, the necessary connection of the two is mutual, but the need is on one side only, as in the case of the motion of a hand holding a key, and that of the key thus held.\n\nO Thou whose sacred precincts none may see,\nUnseen Thou makest all things seen to be;\nThou and we are not separate, yet still\nThou hast no need of us, but we of Thee.\n\nMoreover, the Absolute requires a relative of some sort, not one particular relative, but any one that may be substituted for it. Now, seeing that there is no substitute for the Absolute, it is the Absolute alone who is the 'Qibla' of the needs of all relatives.\nNone by endeavour can behold Thy face,\nOr access gain without prevalent grace;¹\nFor every man some substitute is found,\nThou hast no peer, and none can take Thy place.\n\nOf accident or substance Thou hast naught,\nWithout constraint of cause Thy grace is wrought;\nThou canst replace what's lost, but if Thou'rt lost,\nIn vain a substitute for Thee is sought.\n\nIt is in regard to His essence that the Absolute has no need\nof the relative. In other respects the manifestation of the\nnames of His Divinity and the realization of the relations of\nHis Sovereignty are clearly impossible otherwise than by\nmeans of the relative.\n\nIn me Thy beauty love and longing wrought:\nDid I not seek Thee how could'st Thou be sought?\nMy love is as a mirror in the which\nThy beauty into evidence is brought.\n\nNay, what is more, it is the 'Truth' who is Himself at\nonce the lover and the beloved, the seeker and the sought.\nHe is loved and sought in His character of the 'One who is\nall';² and He is lover and seeker when viewed as the sum of\nall particulars and plurality.³\n\nO Lord, none but Thyself can fathom Thee,\nYet every mosque and church doth harbour Thee;\nI know the seekers and what 'tis they seek—\nSeekers and sought are all comprised in Thee.\n\nFlash XXII.\n\nThe substance of each individual thing may be described\neither as the epiphany of Very Being⁴ in the 'intelligible\nworld,' according to the particular facet whereof such thing\nis the monstrance, or as Very Being Himself made manifest\nimmediately,⁵ in the same intelligible world and according to\nthe same facets. Consequently, each existing thing is either\n\n¹ Faiz i azal.\n² Maq'im i Jam' i Ahadīyat. Note the change of phrase.\n³ Martaba i tafṣīl wa kithrat.\n⁴ Ta'ayyun i wajūd.\n⁵ Wajūd i muta'ayyin.\nan epiphany of Very Being with the colour imparted to its exterior by the particular properties of its substance, or the Very Being Himself immediately made manifest with the same colouring.\n\nThe real substance of everything always abides, though concealed in the inner depth of the Very Being, while its sensible properties are manifest to outward sense. For it is impossible that the Divine 'Ideas' \\(^1\\) in the intelligible world should be susceptible of evanescence, so that would involve atheism. [God is too exalted for such evanescence to be ascribed to His 'Ideas.'] \\(^2\\)\n\nWe are the facets and the modes of Being,\nEvolved from Mind \\(^3\\)—yea, accidents of Being;\nWe're hidden in the cloak of non-existence,\nBut yet reflected in the glass of Being.\\(^4\\)\n\n\\(^5\\) Consequently, everything is in reality and in fact either Being made manifest or an accident of Being thus manifested. The manifested accident is a quality of the manifested Being, and though in idea the quality is different from the thing qualified, yet in fact it is identical with it. Notwithstanding the difference in idea, the identity in fact justifies the attribution.\\(^6\\)\n\nIn neighbour, friend, companion, Him we see,\nIn beggar's rags or robes of royalty;\nIn Union's cell or in Distraction's haunts,\\(^7\\)\nThere's none but He—by God, there's none but He.\\(^8\\]\n\nFlash XXIII.\n\nAlthough the Very Being underlying all existence communicates Himself to all beings, both those in the intelligible and those in the sensible world, yet He does so in different\n\n\\(^1\\) Suwar i 'ilmīya.\n\\(^2\\) Blank left as usual for the Arabic sentence.\n\\(^3\\) I.e., the 'Ālam i 'ilm, the intelligible world of the Divine 'Ideas.'\n\\(^4\\) Plotinus and the 'Gulshan i Rāz' make not-being the mirror of Very Being. Jāmī here inverts the metaphor.\n\\(^5\\) The following passage omitted in this text. It is probably a gloss which has crept into some manuscripts.\n\\(^6\\) Haml, affirming a predicate of a subject.\n\\(^7\\) See Flash II.\n\\(^8\\) So 'Gulshan i Rāz,' l. 883: 'See but One, say but One, know but One.'\ndegrees [some superior to others]. And in each of these degrees He has certain names, attributes, and modes, applicable to that particular degree and not to the others; e.g., the names Divinity and Sovereignty [are not applicable] to the degrees called Subordination and the Creature-state. Consequently, to apply the names 'Allah' and 'the Merciful,' etc., to created beings is sheer infidelity and heresy. And, similarly, to apply the names suitable to grades of created things to the Deity is the height of misconception and delusion.\n\nO you who deem yourself infallible,\nIn certitude a very oracle,\\(^1\\)\nEach grade of beings has its proper name:\nMark this, or you'll become an infidel.\\(^2\\)\n\nFlash XXIV.\n\nThe Real Being is One alone, at once the true Existence and the Absolute. But He\\(^3\\) possesses different degrees:\n\nIn the first degree He is unmanifested and unconditioned, and exempt from all limitation or relation. In this aspect He cannot be described by epithets or attributes, and is too holy to be designated by spoken or written words; neither does tradition furnish an expression for His Majesty, nor has reason the power to demonstrate the depth of His perfection. The greatest philosophers are baffled by the impossibility of attaining to knowledge of Him; His first characteristic is the lack of all characteristics, and the last result of the attempt to know Him is stupefaction.\\(^4\\)\n\nTo you convictions and presumptions wrought\nBy evidence intuitive are naught;\nHow can one prove your own reality\nTo such as you who count all proofs as naught?\n\nHowever great our heavenly knowledge be,\nIt cannot penetrate Thy sanctuary;\nSaints blest with visions and with light divine\nReach no conceptions adequate to Thee.\n\n\\(^1\\) Siddiq, veracious, like Abu Bakr 'aṣ-Ṣiddiq.'\n\\(^2\\) Zindiq.\n\\(^3\\) See note 2, p. 27.\n\\(^4\\) Hairānī. In the 'Mantiq ut-Tair,' Hairat is the last valley in the Sufi pilgrim's progress. To know God he must rise to ecstasy.\nOur love,\\(^1\\) the special grace of souls devout,\nTo reason seems a thing past finding out;\nOh, may it bring the dawn of certitude,\nAnd put to flight the darksome hours of doubt!\n\nThe second degree is the self-display of Very Being in an epiphany containing in itself all the active, necessary and divine manifestations, as well as all the passive, contingent and mundane manifestations. This degree is named the 'First Emanation,'\\(^2\\) because it is the first of all the manifestations of the Very Being; and above it there is no other degree than that of the 'Unmanifested.'\n\nThe third degree is named the 'Unity of the Whole Aggregate,'\\(^3\\) which contains in itself all the active and efficient manifestations. It is named the degree of 'Divinity.'\\(^4\\)\n\nThe fourth degree is the manifestation in detail of the degree named Divinity; it is the degree of the names and the theatres wherein they are manifested. These two last-named degrees refer to the outward aspect of Being wherein 'necessity'\\(^5\\) is a universal condition.\n\nThe fifth degree is the 'Unity of the Whole Aggregate,' which includes all the passive manifestations whose characteristic is the potentiality of receiving impressions, i.e., passivity. It is the degree of mundane existence and contingency.\\(^6\\)\n\nThe sixth degree is the manifestation in detail of the preceding degree; it is the degree of the sensible world.\\(^7\\) These two last degrees refer to the exterior of the intelligible world,\\(^8\\) wherein contingency is one of the invariable qualities.\n\n---\n\n\\(^1\\) Rūmī describes love as spiritual clairvoyance. See 'Masnavī, Introduction, p. xxviii.\n\n\\(^2\\) Ta'ayyun i awwal, usually called 'agl i kull, universal reason—i.e., nous or Logos, as by Jāmī himself in 'Salāman wa Absal' 'The first thing created was reason' (Hadith).\n\n\\(^3\\) Ahādiyat i Jam', usually called nafs i kull, universal soul, pneuma.\n\n\\(^4\\) Ilāhiyat. See De Sacy's note in 'Notices et Extraits des Manuscrits,' x. 77.\n\n\\(^5\\) Wajūb. It belongs to the sphere of 'Necessary Being.'\n\n\\(^6\\) Martaba i kaunīya i imkānīya.\n\n\\(^7\\) 'Ālam.\n\n\\(^8\\) The object of this distinction is to keep God from contact with matter. Contingency is not found in the immediate reflections of Being, but only in the reflections from the intelligible world of Divine Ideas.\nIt consists of the revelation of the Divine Mind to Himself under the forms of the substances of the contingent.\n\nConsequently, in reality there is but One Sole Being, who is interfused in all these degrees and hierarchies which are only the details of the Unity ('Singleness').¹ 'Very Being' in these degrees is identical with them, just as these degrees when they were in the Very Being were identical therewith. ['God was, and there was not anything with Him.']²\n\n¹ The 'Truth' appears in all; would'st thou divine\nHow with Himself He doth all things combine?\nSee the wine-froth: the wine in froth is froth,\nYet the froth on the wine is very wine.\n\n'Tis the bright radiance of Eternity\nThat lights Not-being, as we men may see;\nDeem not the world is severed from the 'Truth':\nIn the world He's the world, in Him 'tis He.\n\nFlash XXV.\n\nThe 'Truth of truths' which is the essential, most exalted Divine Being is the Reality in all things. He is One in Himself, and 'unique' in such wise that plurality cannot enter into Him; but by His multiple revelations and numerous phenomenal displays He is sometimes presented under the form of substantial independent entities,³ and at other times under the form of accidental and dependent entities.⁴ Consequently, the One Essential Being appears as multiple by reason of the numerous qualities of these substances and accidents, although in point of fact He is 'One,' and is in no wise susceptible of numbers or plurality.\n\nRase the words 'this' and 'that'; duality\nDenotes estrangement and repugnancy;\nIn all this fair and faultless universe\nNaught but one Substance and one Essence see.⁵\n\n¹ Wahidiyat. See note 2, p. 30.\n² A saying attributed to Muḥammad. A blank is left for it in this manuscript.\n³ Haqāiq i Jauhariya i maṭbu'a.\n⁴ Haqāiq i 'araziya i ṭabi'a.\n⁵ See note 8, p. 38.\nThis unique Substance, viewed as absolute and void of all phenomena, all limitations and all multiplicity, is the 'Truth.' On the other hand, viewed in His aspect of multiplicity and plurality, under which He displays Himself when clothed with phenomena, He is the whole created universe. Therefore the universe is the outward visible expression of the 'Truth,' and the 'Truth' is the inner unseen reality of the universe. The universe before it was evolved to outward view was identical with the 'Truth'; and the 'Truth' after this evolution is identical with the universe. Nay, more, in reality there is but One Real Being; His concealment [in the Divine Mind] and His manifestation [in the sensible world], His priority and His posteriority [in point of time], are all merely His relations and His aspects. 'It is He who is the first and the last, the exterior and the interior.'\n\nIn the fair idols, goal of ardent youth,\nAnd in all cynosures lies hid the 'Truth';\nWhat, seen as relative, appears the world,\nViewed in its essence is the very 'Truth.'\n\nWhen in His partial modes Truth shone out plain,\nStraightway appeared this world of loss and gain;\nWere it and all who dwell there gathered back\nInto the Whole, the 'Truth' would still remain.\n\nFlash XXVI.\n\nThe Shaikh (may God be well pleased with him) says in the Faṣṣ i Shuʿaibī, that the universe consists of accidents all pertaining to a single substance, which is the Reality underlying all existences. This universe is changed and renewed unceasingly at every moment and at every breath. Every instant one universe is annihilated and another resembling it takes its place, though the majority of men do not perceive this, as God most glorious has said: ['But they are in doubt regarding the new creation.']\n\n1 Koran, lvii. 3. Cp. Rev. i. 8, 'I am Alpha and Omega.'\n2 Literally, 'horizons'—i.e., objects of aspiration.\n3 I.e., the grade of plurality in Unity, or Universal Soul.\n4 Muhiyi-ud-din Muhammad Andalūsī, commonly called Ibn ʿArabī, died 638 A.H. Wrote the Faṣūs-ul Ḥikam (Ḥāji Khalfa, iv. 424). Each section is named after some patriarch—e.g., Shuʿaib (Jethro).\n5 Koran, l. 14. See 'Gulshan i Rāz,' l. 670. Text omitted in this manuscript.\nAmong Rationalists,\\(^1\\) no one has perceived this truth with the exception of the Asharians,\\(^2\\) who recognise it in certain departments of the universe, to wit, 'accidents,' as when they say that accidents exist not for two moments together; and also with the exception of the Idealists,\\(^3\\) called also Sophists, who recognise it in all parts of the universe, whether substances or accidents. But both these sects are in error in one part of their theory. The Asharians are wrong in asserting the existence of numerous substances—other than the One Real Being underlying all existence—on which substances, they say, depend the accidents which continually change and are renewed. They have not grasped the fact that the universe, together with all its parts, is nothing but a number of accidents, ever changing and being renewed at every breath, and linked together in a single substance, and at each instant disappearing and being replaced by a similar set. In consequence of this rapid succession, the spectator is deceived into the belief that the universe is a permanent existence. The Asharians themselves declare this when expounding the succession of accidents in their substances as involving continuous substitution of accidents, in such wise that the substances are never left wholly void of accidents similar to those which have preceded them. In consequence of this the spectator is misled into thinking that the universe is something constant and unique.\\(^4\\)\n\nThe ocean does not shrink or vaster grow,\nThough the waves ever ebb and ever flow;\nThe being of the world's a wave, it lasts\nOne moment, and the next it has to go.\n\nIn the world, men of insight may discern\nA stream whose currents swirl and surge and churn,\nAnd from the force that works within the stream\nThe hidden working of the 'Truth' may learn.\n\n\\(^1\\) Ahl-i naẓr, as opposed to ahli shahūd, men of spiritual intuition.\n\n\\(^2\\) The followers of Abū-l Ḥasan al Ashārī, died about 330 A.H. (Ibn Khallikan. ii. 227).\n\n\\(^3\\) The Hasbāniya.\n\n\\(^4\\) This is the Heraclitean doctrine that all phenomena are in constant flux, issuing from the 'Fiery Breath' (Pneuma) and remerged in it every moment. Jalāl-ud-din quotes the saying of 'Arqlitus' that 'Contraries are congruous,' the first suggestion of the Hegelian doctrine that contraries always involve a higher unity which embraces both. See Lumsden, 'Persian Grammar,' ii: 323.\nAs regards the Sophists, though they are right in asserting the ideality of the whole universe, they are wrong in failing to recognise the Real Being underlying it, who clothes Himself with the forms and accidents of the sensible universe, and appears to us under the guise of phenomena and multiplicity; likewise in denying any manifestation of Real Being in the grades of visible things under the guise of these forms and accidents, whereas in truth these accidents and forms are only manifested to outward view by the operation of that underlying Real Being.\n\nPhilosophers devoid of reason find\nThis world a mere idea of the mind;\n'Tis an idea—but they fail to see\nThe great Idealist who looms behind.\n\nBut the men gifted with spiritual intuition see that the Majesty of the 'Truth,' most glorious and most exalted, reveals Himself at every breath in a fresh revelation,\\(^1\\) and that He never repeats the same revelation; that is to say, He never reveals Himself during two consecutive moments under the guise of the same phenomena and modes, but every moment presents fresh phenomena and modes.\n\nThe forms which clothe existence only stay\nOne moment, in the next they pass away;\nThis subtle point is proven by the text,\n'Its fashion altereth from day to day.'\\(^2\\)\n\nThe root of this mystery lies in the fact that the Majesty of the 'Truth' most glorious possesses 'names' opposed\\(^3\\) to one another, some being beautiful and some terrible; and these names are all in continuous operation,\\(^4\\) and no cessation of such operation is possible for any of them. Thus, when one of the contingent substances, through the concurrence of\n\n---\n\n\\(^1\\) See 'Masnavi,' p. 24.\n\\(^2\\) Koran lv. 29.\n\\(^3\\) Luṭf and Qahr, or Jamāl and Jalāl, the opposite Divine attributes of mercy and vengeance, beauty and terror. The Divine economy is sometimes represented as effected by the eternal struggle between these two opposite phases of Deity, as manifested in Adam and Iblis, Abraham and Nimrod, Moses and Pharaoh, etc. (see 'Masnavi,' p. 301), a daring Monist hypothesis, which, needless to say, is not pursued into its consequences.\n\\(^4\\) These 'names,' like the Stoic logoi, are sometimes spoken of as ideas, sometimes as forces or energies.\nthe requisite conditions, and the absence of opposing condi-\ntions, becomes capable of receiving the Very Being, the mercy\nof the Merciful takes possession of it, and the Very Being is\ninfused\\(^1\\) into it; and the Very Being thus externalized,\\(^2\\)\nthrough being clothed with the effects and properties of such\nsubstances, presents Himself under the form of a particular\nphenomenon, and reveals Himself under the guise of this\nphenomenon. Afterwards, by the operation of the terrible\nOmnipotence which requires the annihilation of all pheno-\nmena and all semblance of multiplicity, this same substance\nis stripped of these phenomena. At the very moment that it\nis thus stripped this same substance is reclothed with another\nparticular phenomenon, resembling the preceding one, through\nthe operation of the mercy of the Merciful One. The next\nmoment this latter phenomenon is annihilated by operation\nof the terrible Omnipotence, and another phenomenon is\nformed by the mercy of the Merciful One; and so on for as\nlong as God wills. Thus, it never happens that the Very\nBeing is revealed for two successive moments under the guise\nof the same phenomenon. At every moment one universe is\nannihilated and another similar to it takes its place. But he\nwho is blinded by these veils, to wit, the constant succession\nof similar phenomena and like conditions, believes that the\nuniverse constantly endures in one and the same state, and\nnever varies from time to time.\n\nThe glorious God, whose bounty, mercy, grace,\nAnd loving-kindness all the world embrace,\nAt every moment brings a world to naught,\nAnd fashions such another in its place.\n\nAll gifts soever unto God are due,\nYet special gifts from special 'names' ensue;\nAt every breath one 'name' annihilates,\nAnd one creates all outward things anew.\n\nThe proof that the universe is nothing more than a combi-\nnation of accidents united in a single essence, i.e., the\n\n\\(^1\\) *Ifāẓat*, production by emanation. See 'Notices et Extraits des\nManuscrits,' x., p. 66.\n\\(^2\\) *Sein* evolved into *dasein*.\n'Truth' or Very Being, lies in the fact that when one comes to define the nature of existing things these definitions include nothing beyond 'accidents.' For example, when one defines man as a 'rational animal'; and animal as a 'growing and sentient body, possessed of the faculty of voluntary movement'; and body as a 'substance possessing three dimensions'; and substance as an 'entity which exists per se and is not inherent in any other subject'; and entity as 'an essence possessed of reality and necessary being'—all the terms used in these definitions come under the category of 'accidents,' except this vague essence which is discerned behind these terms. For 'rational' signifies an essence endued with reason; 'that which is growing' signifies an essence endued with the faculty of growth; and so on. This vague essence is, in fact, the 'Truth,' the Very Being, who is self-existent, and who causes all these accidents to exist. And when the philosophers allege that these terms do not express the differences themselves, but only the invariable marks of these differences whereby we express them, because it is impossible to express the true differences otherwise than by these invariable marks or others more recondite still, this assumption is inadmissible and undeserving of serious attention. And even if we admit it as a hypothesis, we affirm that whatever is essential in relation to special substances is accidental in relation to the Very Truth; for though this alleged essential quality is part of the essence of a particular substance, it is extraneous to the Very Truth upon whom it is dependent. And to say that there is any substantial entity other than the One Essential Being is the height of error, especially when the spiritual intuition of the men of truth, which is borrowed from the lamp of prophecy, attests the contrary,¹ and when their opponents cannot cite any proofs in favour of their own view. ['God saith what is true, and directeth man in the right path.']²\n\n¹ Cp. 1 Cor. ii. 15, 'He that is spiritual judgeth all things, yet he himself is judged of no man.' Or, as Hegelians would put it, the deliverances of intuitive reason are not to be tried by the canons of the discursive reason (verstand).\n\n² Koran, xxxiii. 4. A blank is again left for the text in this manuscript.\nTruth is not proved by terms and demonstrations,\nNor seen when hidden by concrete relations;¹\nThe 'Canou' is no 'Cure' for ignorance,\nNor can 'Deliv'rance' come from 'Indications.'²\n\nIf at each 'Stage' thy course diverted be\nTo different 'Goals,' true goal thou'lt never see;\nAnd till the veil is lifted from thine eyes\nThe sun of Truth will never 'Rise' for thee.³\n\nStrive to cast off the veil, not to augment\nBook-lore: no books will further thy intent.\nThe germ of love to God grows not in books;\nShut up thy books, turn to God and repent.\n\nThe completest mask and the densest veils of the beauty of\nthe One Real Being are produced by the manifold limitations\nwhich are found in the outward aspect of Being and which result\nfrom His being clothed with the properties and effects of the\narchetypes indwelling in the Divine Knowledge,⁴ which is the\ninner side of Being. To those blinded by these veils it seems\nthat the archetypes exist in these outward sensible objects,\nwhereas in point of fact these outward objects never attain a\nparticle⁵ of those real archetypes, but are and will always\ncontinue in their original not-being. What exists and is\nmanifested is the 'Truth,' but this is only in regard to His\nbeing clothed with the properties and effects of the archetypes,\nand not in regard to His condition when bare of all these\nproperties; for in this latter case inwardness and conceal-\nment are amongst His inherent qualities. Consequently, in\nreality the Very Being never ceases to abide in His Essential\nUnity, wherein He was from all eternity and wherein He will\n\n¹ Quyūd.\n² Alluding to four famous works of Ibn Sīnā (Avicenna), 'Shīfā,' 'Qānūn,\n'Nījāt,' and 'Ishārāt.'\n³ Alluding to 'Mawāqif,' a theological work by Al Ijī; 'Maqāsid,' by\nAl Taftazānī; and 'Matālī,' a work on logic by Al Ormawi. See\nOtto Loth, 'Catalogue of India Office Arabic Manuscripts,' pp. 114,\n460, and 143.\n⁴ A'yān i thābitah dar hāzrat i 'ilm, the Ideas or archetypes in Plato's\n'Intelligible World' (see 'Notices et Extraits des Manuscrits,' vol. x.,\np. 65. 'Ain has the double meaning of 'eye' and 'essence,' and its\nderivatives A'yān and Ta'ayyun are used to denote the reflections of the\nOne Being; in other words, His emanations which constitute the existences\nor substances in the world of visible and sensible phenomena ('Ālam i 'Ain).\n⁵ Literally, 'smell.'\nendure to all eternity. But to the vulgar, who are blinded by these veils, the Very Being seems to be relative and phenomenal, and wearing the form of the multiplicity of these properties and effects, and He seems manifold to such persons.\n\nBeing's a sea in constant billows rolled,\\(^1\\)\n'Tis but these billows that we men behold;\nSped from within, they rest upon the sea,\nAnd like a veil its actual form enfold.\n\nBeing's the essence of the Lord of all,\nAll things exist in Him and He in all;\nThis is the meaning of the Gnostic phrase,\n'All things are comprehended in the All.'\n\n\\(^2\\)When one thing is manifested in another, the thing manifested is different from the thing which is the theatre of the manifestation—i.e., the thing manifested is one thing and its theatre another. Moreover, that which is manifested in the theatre is the image or form of the thing manifested, not its reality or essence. But the case of the Very Being, the Absolute, is an exception, all whose manifestations are identical with the theatres wherein they are manifested, and in all such theatres He is manifested in His own essence.\n\nThey say, How strange! This peerless beauty's face\nWithin the mirror's heart now holds a place;\\(^3\\)\nThe marvel's not the face, the marvel is\nThat it should be at once mirror and face.\n\nAll mirrors in the universe I ween\nDisplay Thy image with its radiant sheen—\nNay, in them all, so vast Thy effluent grace,\n'Tis Thyself, not Thine image, that is seen.\n\nThe 'Truth,' the Very Being, along with all His modes, His attributes, connections, and relations, which constitute the real existence of all beings, is immament in the real existence\n\n\\(^1\\) See Masnavi, p. 42.\n\\(^2\\) The following passage in brackets is omitted in this manuscript.\n\\(^3\\) In the 'Gulshan i Rāz,' l. 134, Very Being is said to be reflected in the mirror of not-being.\nof each being. Hence it has been said, 'The All exists in all things.' The author of the *Gulshan i Rāz* says:\n\n'If you cleave the heart of one drop of water\nThere will issue from it a hundred pure oceans.'\n\nEvery power and every act manifested as proceeding from the theatres of manifestation proceed in reality from the 'Truth' manifested in these theatres, and not from the theatres themselves. The Shaikh (may God be well pleased with him) says in the *Ḥikmat i ‘Aliyya*:2 'Outward existence ('ain) can perform no act of itself; its acts are those of its Lord immanent in it; hence this outward existence is passive, and action cannot be attributed to it.' Consequently, power and action are ascribed to the creature ('abd) because of the manifestation of the 'Truth' under the form of the creature, and not because such action is really effected by the creature himself. [Read the text: 'God hath created thee, both thee and the works of thy hands']3, and recognise the fact that thy existence, thy power, and thine actions come from the Majesty of Him who has no equal.4\n\nBoth power and being are denied to us,\nThe lack of both is what's ordained for us;\nBut since 'tis He who lives within our forms,\nBoth power and action are ascribed to us.\n\nYour 'self' is non-existent, knowing one!\nDeem not your actions by yourself are done;\nMake no wry faces at this wholesome truth—\n'Build the wall ere the fresco is begun.'\n\nWhy vaunt thy 'self' before those jealous eyes?5\nWhy seek to deal in this false merchandise?\nWhy feign to be existent of thyself?\nDown with these vain conceits and foolish lies!\n\n1 Verse 146.\n2 The Shaikh Muhiyi-ud-dīn Ibn al’Arabī. The 'Ḥilikmat i 'Aliyya' is the first section of his 'Fasūṣ-ul Ḥikam.\n3 Koran, xxxvii. 94. A blank left for the text.\n4 The Sūfīs call God, the 'One Real Agent'—Fa'il-i Ḥaqiqi. Determinism is a necessary corollary of Monism.\n5 Cp. the Ḥadith, 'God is more jealous than Sa’d' ('Masnavi,' p. 29, note). Self-assertion is presumption towards God.\nFlash XXVII.\n\nSince the qualities, states, and actions manifested in the theatres are in reality to be ascribed to the Very Being manifested in those theatres, it follows that if a certain evil or imperfection is found in any of them, it may possibly be caused by the non-existence of something else; for Being, quâ Being, is pure good; and whenever it seems to us that something existent contains evil, that is owing to the lack of something else which ought to exist, and not to the really existing Being, quâ Being.\\(^1\\)\n\nAll good and all perfection that you see\nAre of the 'Truth,' which from all stain is free;\nEvil and pain result from some defect,\nSome lack of normal receptivity.\n\nPhilosophers have alleged that the proposition 'Very Being is pure good' is a necessary (self-evident) one.\\(^2\\) By way of illustration, they have given some examples. Thus, they say cold, which spoils the fruit and is an evil in relation to the fruit, is not an evil [absolutely], because it is one of the qualities [of Being], and in this respect one of His perfections; but [it is evil] because it prevents the fruit attaining the perfection proper to it. Thus too killing, which is an evil, is not an evil by reason of the murderer's power of killing, nor by reason of the power of the instrument to cut, nor of the liability of the body of the person killed to be cut; but [it is an evil] because it deprives a person of life, which is the mere negation [of something positive];\\(^3\\) and so on.\n\n\\(^1\\) 'Being is good in whatever it be. If a thing contains evil, that proceeds from \"other\"' ('Gulshan i Rāz,' l. 871). This represents evil as something positive. So Dante says matter is intractable ('Paradiso,' Canto I.). Augustine, like Jāmī, makes evil merely a deficiency of good. See 'Confessions,' Book VII., chapter xii.\n\n\\(^2\\) Zarūrat. Necessary truths are those of which the contrary is inconceivable. Of course, in Jāmī's time necessity of thought was supposed to involve necessity of the object of thought.\n\n\\(^3\\) The ideas that God is all and determines all, and that evil is unreal, may seem true to men like Augustine, glowing with religious emotion, but are untenable in practice, and if translated into hard theological formulas become a stumbling-block. Jalāl-ud-dīn quietly drops them when it comes to a question of practice.\nWherever Being's ambit doth extend,\nGood and nought else but good is found, O friend;\nAll evil comes from 'not-being,' to wit,\nFrom 'other,' and on 'other' must depend.¹\n\nFlash XXVIII.\n\nShaikh Ṣadr-ud-dīn Qūniavī² (may God sanctify his secret) says in the book Nuṣūṣ: 'Knowledge is one of the qualities pertaining to Being; that is to say, that every existing substance is endued with knowledge; and the difference in the degrees of knowledge results from the differences of these substances in their reception, whether perfect or imperfect, of Being. Thus a substance capable of receiving Being in a most complete and perfect way is capable of receiving knowledge in the same way; and that which is only capable of receiving Being imperfectly is endued with knowledge in the same degree. This difference originates in the stronger or weaker influence of 'necessity'³ or 'contingency' over each substance. In every substance in which the influence of 'necessity' is the stronger, Being and knowledge are most perfect; in the remainder, in which the influence of 'contingency' is more prevalent, Being and knowledge are more imperfect.'\n\nIt would seem that what the Shaikh states as to knowledge specially being a quality appertaining to Being is meant to convey one example only, because all the other perfections which are likewise qualities pertaining to Being, such as life, power, will, etc., are in the same position as knowledge.\n\nCertain other [Ṣūfīs] have said: 'No single existent thing is without the quality of knowledge'; but knowledge is of two kinds, one ordinarily called knowledge and the other not so called. Both kinds, according to the men of truth, belong to the category of knowledge, because they recognise the\n\n¹ 'Gulshan i Rāz,' l. 871.\n² 'An-Nuṣūṣ fī tāḥqīq i ṭaur il makhsūs,' by the celebrated Ṣūfī Shaikh Sadr-ud-dīn Muḥammad bin Ishāq al Qūniavī, died 672 A.H. See Haji Khalfa, vi. 349.\n³ The more 'necessary being' a thing has, the less it has of 'contingent being'—i.e., less intermixture with not-being. See note 2, p. 33.\nimmanence of the essential knowledge of the 'Truth' most glorious and most exalted in all things whatsoever. It is in the second class that we must place \"water,\" for example, which is not ordinarily considered as possessed of knowledge. But we see that it distinguishes between up and down hill; it avoids the rise and runs downwards; again, it sinks into porous bodies, whilst it only wets the surface of dense bodies and passes over them, etc. Therefore, it is by virtue of the quality of knowledge that it runs, according to the capacity of one object to admit it, and the absence of opposing properties in such objects. But, in this degree, knowledge is manifested only under the form of nature.\\(^1\\) In this manner knowledge is immanent in all other existing things; or, rather, all perfections pertaining to Being are immanent in all things without exception.\n\nBeing, with all its latent qualities,\nDoth permeate all mundane entities,\nWhich, when they can receive them, show them forth\nIn the degrees of their capacities.\n\nFlash XXIX.\n\nJust as the 'Truth,' the Very Being, in virtue of His absolute purity, is immanent in the substances of all beings in such wise as to be essentially identical with these substances, as these substances are, when in Him, identical with Him; in like manner His perfect qualities are entirely and absolutely immanent in all qualities of the substances in such wise as to be identical with their qualities, even as their qualities when in those perfect qualities were identical therewith. For example, the quality of knowledge, in the knowledge of the knower of particulars,\\(^2\\) is identical with this knowledge of particulars, and in the knowledge of him who knows universals\\(^2\\) is identical with this knowledge of universals; in active and passive\\(^3\\) knowledge it is identical\n\n\\(^1\\) I.e., in unconscious objects. Thus Aristotle says plants seek their own perfection unconsciously, while man does it consciously.\n\n\\(^2\\) Juzviyāt and kulliyāt.\n\n\\(^3\\) Fi'ilī and infi'ālī—i.e., knowledge gained by inference and reasoning, and that conveyed by immediate consciousness and sensation.\nwith such knowledge; in ecstatic and mystic\\(^1\\) knowledge it is identical with that kind of knowledge—similarly down to the knowledge of those beings not ordinarily classed as having knowledge, wherein it is identical with such knowledge in a manner suitable to the character of such beings, and so on for the other divine attributes and qualities.\\(^2\\)\n\nThy essence permeates all entities,\nAs do Thy attributes all qualities;\nIn Thee they’re absolute, but when displayed,\nThey’re only seen in relative degrees.\\(^3\\)\n\n[The reality of existence is the essence\\(^5\\) of the ‘Truth’ most glorious and most exalted; the modes, relations, and aspects of existence are His attributes;\\(^6\\) His manner of manifesting Himself in the vesture of these relations and aspects is His action and His impress;\\(^7\\) the phenomena manifested and proceeding from this self-revelation are the products of His impress.\\(^8\\)\n\nTh’ essential modes in earth and heavens present\\(^9\\)\nFacets of Him who’s veiled and immanent;\nHence, O inquirer, learn what essence is,\nWhat attribute, what cause, what consequent.]\n\nFlash XXX\n\nIn some passages of the Faṣūṣ the Shaikh\\(^{10}\\) (may God show mercy upon him) seems to point to the view that the existence of all contingent substances and of all perfections dependent on that existence \\([^{11}\\) is to be ascribed to the Majesty of the ‘Truth’ most glorious and most exalted;\n\n---\n\n\\(^1\\) Wijdānī and dhauqī.\n\n\\(^2\\) Here the last quatrain in Flash XXVIII. is repeated.\n\n\\(^3\\) Tagayyud, limitation.\n\n\\(^4\\) The following passage in brackets is omitted in this manuscript.\n\n\\(^5\\) Dhāt.\n\n\\(^6\\) Sifāt.\n\n\\(^7\\) Fʿil and taʿthir.\n\n\\(^8\\) Athār.\n\n\\(^9\\) Dungā wa dīn, earth and the celestial spheres, the ‘theatres’ or monstrances of the Divine perfections, rather than the world and the Moslem Church (the ordinary meaning).\n\n\\(^{10}\\) See note 4, p. 42.\n\n\\(^{11}\\) This passage in square brackets is found in one British Museum manuscript. It certainly makes the sense clearer.\nwhilst in other passages he seems to say that what is ascribed to the Majesty of the 'Truth' is merely an emanation\\(^1\\) of Being; and as regards the qualities dependent on existence, they are effects produced by the substances themselves. These two statements may be thus reconciled: The Majesty of the 'Truth' most glorious is revealed in two manners—the first the inward, subjective\\(^2\\) revelation, which the Šūfīs name 'Most Holy Emanation';\\(^3\\) it consists in the self-manifestation of the 'Truth' to His own consciousness from all eternity under the forms of substances,\\(^4\\) their characteristics and capacities. The second revelation is the outward objective manifestation, which is called 'Holy Emanation';\\(^5\\) it consists in the manifestation of the 'Truth,' with the impress of the properties and marks of the same substances.\\(^6\\) This second revelation ranks after the first; it is the theatre wherein are manifested to sight the perfections which in the first revelation were contained potentially in the characteristics and capacities of the substances.\n\nOne grace a host of suppliant forms designed,\nA second to each one his lot assigned;\nThe first had no beginning—of the last,\nWhich springs from it, no end can be divined.\\(^7\\)\n\nWherefore, the ascription of existence and the perfections dependent thereon] to the 'Truth' most glorious and most exalted has regard to the two revelations taken together; and the ascription to the 'Truth' of existence alone, and of its dependents to the substances, has reference to the second revelation; for the only result of the second revelation is the emanation of Being into the substances, and so making\n\n---\n\n\\(^1\\) *Ifāẓat*, production by emanation. See De Sacy's article on 'Jorjānī's Definitions' (Notices et Extraits des Manuscrits,' x., p. 66).\n\n\\(^2\\) *ʿIlmī*.\n\n\\(^3\\) *Faiz i Agdas* (see 'Notices et Extraits,' x., p. 66), the first emanation, or *agl i kull*.\n\n\\(^4\\) *I.e.*, the 'archetypal ideas' of the intelligible world, *ʿālam i ʿilmī*.\n\n\\(^5\\) *Faiz i Muqaddas*, the second emanation, or *nafs i kull* (Anima mundi).\n\n\\(^6\\) *I.e.*, *ʿālam i ʿainī*, the sensible world, the copy of the intelligible world.\n\n\\(^7\\) The sensible world issues from the intelligible world, and will continue 'as long as God wills.'\nvisible what had already been included in them by the first revelation.\n\nMark well this subtle point—each quality,\nEach action that in substances we see,\nOn one side is attributed to us,\nOn one to 'Truth,' the sole Reality.\n\nAppendix.¹\n\nWhereas my aim and object in giving these explanations and hints has been to call attention to the essential omnipresence of the Majesty of the 'Truth' most glorious, and to the immanence of His light in all the grades [of sensible existence], to the end that the pilgrims and aspirants endued with knowledge and reflection may not neglect the contemplation of His Being while preoccupied with any other being, and that they may not forget the consideration of the perfection of His attributes while paying regard solely to the qualities manifested [in the sensible universe], and whereas what has been said above is sufficient for this purpose, and satisfactorily accomplishes this end, I therefore conclude the book at this point, merely adding the following quatrains:\n\nJāmī! leave polishing of phrases, cease\nWriting and chanting fables, hold thy peace;\nDream not that 'Truth' can be revealed by words:\nFrom this fond dream, O dreamer, find release!²\n\nBeggars in tattered clothes their rents should hide,\nAnd lovers take discretion for their guide,\nAnd, since words do but veil the Loved One's face,\n'Tis well for us in silence to abide.\n\nHow long wilt thou keep clanging like a bell?\nBe still, and learn this flood of words to quell;\nThou'l never come to hold the pearl of 'Truth'\nTill thou art made all ear, as is the shell.³\n\n¹ Tadhyīl in one manuscript; another has 'Flash.'\n² The 'Masnavī' finishes in the same strain. See the parable of the Moslem who, by childlike faith, prevailed over his learned fellow-travellers (p. 304).\n³ I.e., the oyster-shell (see 'Gulshan i Rāz,' l. 572). Here in one manuscript there follow two quatrains which are mere variations of the same theme.\nThou who for grief hast soiled thy weeds with dust,\\footnote{Read Khākat ba kafan. V. L., Chākat—i.e., in token of mourning.}\nSoil not thy lips with speech (for soil it must);\nWhile thou can't commune silently with Him,\nRather than speak stop up thy mouth with dust!\n\nThis treatise was completed by the help of God and the favour of His grace. May He bless Muḥammad and his family and his companions!\nAPPENDICES\nAPPENDIX I\n\nGHAZZĀLĪ ON 'TAUHĪD'\n\nPRAISE be to God, the Creator and Restorer of all things; who does whatsoever He pleases, who is Master of the glorious throne and mighty force, and directs His sincere servants into the right way and the straight path; who favoureth them who have once borne testimony to the Unity by preserving their confessions from the darkness of doubt and hesitation; who directs them to follow His chosen apostle, upon whom be the blessing and peace of God; and to go after his most honourable companions, to whom He hath vouchsafed His assistance and direction, which is revealed to them in His essence and operation by the excellencies of His attributes, to the knowledge whereof no man attains but he that hath been taught by hearing. To these, as touching His essence, He maketh known that He is One, and hath no partner; singular, without anything like Him; uniform, having no contrary; separate, having no equal. He is ancient, having no first; eternal, having no beginning; remaining forever, having no end; continuing to eternity without any termination. He persists, never ceasing to be; remains without falling; and never did cease, nor ever shall cease, to be described by glorious attributes; nor is subject to any decree so as to be determined by any precise limits or set times, but is the First and the Last, and is within and without.\n\n1 This passage is given in Pococke's 'Specimen Historiae Arabum' (Oxoniae, 1650), p. 284, and this translation of it by Ockley is copied from Hughes's 'Notes on Muhammadanism.'\n2 'Faith cometh by hearing' (Rom. x. 17).\n3 This is directed against the Christian Trinity, which all Moslems suppose to be the equivalent of Tritheism.\nWhat God is not.—He, glorified be His name, is not a body endued with form,\\(^1\\) nor a substance circumscribed with limits or determined by measure; neither does He resemble bodies, as they are capable of being measured and divided. Neither is He a substance, nor do substances exist in Him; nor is He an accident, nor do accidents exist in Him. Neither is He like to anything that exists, nor is anything like to Him; nor is He determinate in quantity, nor comprehended by bounds, nor circumscribed by differences of situation, nor contained in the heavens. He sits upon the throne, after that manner which He Himself hath described, and in that sense which He Himself means, which is a sitting far removed from any notion of contact, or resting upon, or local situation; but both the throne itself, and whatsoever is upon it, are sustained by the goodness of His power, and are subject to the grasp of His hand.\\(^2\\) But He is above the throne and above all things, even to the utmost ends of the earth; but so above as at the same time not to be a whit nearer the throne and the heaven; since He is exalted by (infinite) degrees above the throne, no less than He is exalted above the earth, and at the same time He is near to everything that hath being—nay, ‘nearer to men than their jugular veins, and is witness to everything’\\(^3\\)—though His nearness is not like the nearness of bodies, as neither is His essence like the essence of bodies. Neither doth He exist in anything,\\(^4\\) neither doth anything exist in Him; but He is too high to be contained in any place, and too holy to be determined by time; for He was before time and place were created, and is now after the same manner as He always was. He is also distinct from the creatures in His attributes, neither is there anything besides Himself in His essence, nor is His essence in any other be-\n\n---\n\n\\(^1\\) This is directed against the Anthropomorphists, the Kerāmians, and the Moshabbehites. See Sale, ‘Preliminary Discourse to Koran,’ Section viii.\n\n\\(^2\\) Just like Philo, Ghazzālī struggles with the anthropomorphic language of the Koran, in order to remove God from contact with matter, which his reading of Greek philosophy had taught him was evil.\n\n\\(^3\\) ‘Surah,’ l. 15.\n\n\\(^4\\) Directed against those who held the doctrine of Incarnation, the Ḥalūlians.\nsides Him. He is too holy to be subject to change or any local motion; neither do any accidents dwell in Him, nor any contingencies before Him; but He abides through all generations with His glorious attributes, free from all danger of dissolution. As to the attribute of perfection, He wants no addition. As to being, He is known to exist by the apprehension of the understanding; and He is seen as He is by immediate intuition, which will be vouchsafed out of His mercy and grace to the holy in the eternal mansion, completing their joy by the vision of His glorious presence.\\(^1\\)\n\n**His Power.**—... His is the dominion and the excellency and the creation and the command.\\(^2\\) ... His excellency consists in His creating and producing, and His unity in communicating existence and the beginning of being.\\(^3\\) ...\n\n**His Knowledge.**—He knows what is secret and conceals it, and views the conceptions of minds and the motions of thoughts, and the inmost recesses of secrets, by a knowledge ancient and eternal, that never ceased to be His attribute from eternal eternity, and not by any new knowledge superadded to His essence. ...\n\n**His Will.**—He doth will those things to be that are, and disposes of all accidents. Nothing passes in the empire or the kingdom, neither small nor great, nor good nor evil, nor profitable nor hurtful, nor faith nor infidelity, nor knowledge nor ignorance, nor prosperity nor adversity, nor increase nor decrease, nor obedience nor rebellion, but by His determinate counsel and decree and His definite sentence and will. ... He it is who gave all things their beginning; He is the Creator and Restorer, the sole Operator of what He pleases; there is no reversing His decree nor delaying what He hath determined; nor is there any refuge to man from his rebellion against Him, but only His help and mercy; nor hath any man any power to perform any duty towards Him but through His love and will.\\(^4\\) ...\n\n---\n\n1 The beatific vision of Dante's Paradise. The idea came in the last resort from the Platonists, from whom Ghazzālī also probably got it.\n\n2 'Surah,' vii. 52, 'Are not creation and command of Him?'\n\n3 All created existence is one, and proceeds from the One.\n\n4 This language shows how easily the conception of Monotheism passed into Monism—i.e., the religious view into the philosophic.\nHis Word.—Furthermore, He doth command, forbid, promise and threaten, by an eternal ancient Word subsisting in His essence.\\(^1\\) Neither is it like to the word of the creatures, nor doth it consist in a voice arising from the commotion of the air or the collision of bodies, nor letters which are separated by the joining together of the lips or the motion of the tongue. The Koran, the Law, the Gospel, and the Psalter, are books sent down by Him to His apostles, and the Koran, indeed, is read with tongues, written in books, and kept in hearts; yet as subsisting in the essence of God it doth not become liable to separation and division when it is transferred to hearts and to papers.\\(^2\\) Thus, Moses also heard the word of God without voice or letter, even as the saints behold the essence of God without substance or accident. . . .\n\nHis Works.—He exists after such a manner that nothing besides Him hath any being but what is produced by His operation, and floweth from His justice after the best, most excellent, most perfect, and most just models.\\(^3\\) . . .\n\nAll things were created by Him—genii, men, the devil, angels, heaven, earth, animals, plants, substance, accident, intelligible, sensible. He created them by His power out of mere privation, and brought them into light when as yet they were nothing at all,\\(^4\\) but He Himself alone existed from all eternity, neither was there any other with Him. Now, He created all things in the beginning for the manifestation of His power and His will and the confirmation of His word, which was true from all eternity. Not that He stood in need of them nor wanted them, but He manifestly declared His glory in creating and producing and commanding, without being under any obligation nor out of necessity. . . .\n\nHe rewards those that worship Him for their obedience on account of His promise and beneficence, not of their merit, nor of necessity, since there is nothing which He can be tied\n\n\\(^1\\) See Hirschfeld ‘On the Qorān,’ p. 14. The Logos.\n\n\\(^2\\) This is the opinion that the Koran was uncreated condemned by Al Mamūn in the second century A.H. See Hirschfeld ‘on the ‘I‘jaz (miracle) of the Qorān,’ p. 8.\n\n\\(^3\\) Here we have Plato’s ideas or archetypes in the intelligible world, after the pattern of which sensible objects are formed.\n\n\\(^4\\) Privation, the Greek ‘not-being.’ Note also ‘substance’ and ‘accident.’\nto perform; nor can any injustice be supposed in Him; nor can He be under any obligation to any person whatsoever. That His creatures, however, should be bound to serve Him ariseth from His having declared by the tongues of the prophets that it was due to Him from them. The worship of Him is not simply the dictate of the understanding, but He sent messengers to carry to men His commands and promises and threats, whose veracity He proved by manifest miracles,\\(^1\\) whereby men are obliged to give credit to them in those things that they relate.\\(^2\\)\n\n\\(^1\\) Muḥammad’s miracles were the Āyāt, signs (texts of the Koran). See Hirschfeld ‘On the Qorān,’ pp. 1, 8.\n\n\\(^2\\) Ghazzālī speaks as an orthodox Moslem, but Greek influences are manifest in this passage, and his statements on the thorny subject of grace and works recall those of the great Christian Platonist Augustine.\nAPPENDIX II\n\nPLOTINUS\n\nFrom Anaxagoras onwards the main principle of Greek philosophy was dualism, the opposition of the One and the many, God and the world. In an often-quoted passage Plato says the Ideal Good is beyond existence (epekeina tēs ousias).\n\nNext in the descending scale he placed the 'Intelligible World' of Ideas or archetypes, conceived by reason (Nous). Then came the 'Sensible World' of phenomena, which were only copies of the divine archetypes reproduced in matter.\\(^1\\) This matter was of itself non-existent (mē on); in fact, a mere potentiality of taking the imprints of the archetypes.\n\nWith the Stoics monism made its appearance, and took the place of the previous dualism. For Plato's 'Ideas' they substituted Logoi, thoughts, forms, or forces immanent in the universe. And these Logoi were often spoken of as all summed up in the one Logos. Most Stoics, like Epictetus and Marcus Aurelius, regarded the universe as natura naturans, manifested Logos or Anima Mundi; others regarded the Logoi as only functions of matter (natura naturata).\n\nPhilo, the Alexandrian Jew, who lived at the same time as St. Paul, managed to combine this Logos doctrine with the Hebrew Scriptures.\\(^2\\) By allegorical interpretation he identified the Stoic Logoi with the angels mentioned in the Scriptures, and at the same time he reduced the personal Yahveh of the Scriptures to the abstract Being of Greek philosophy.\n\n\\(^1\\) See 'Masnavi,' p. 226.\n\n\\(^2\\) The Book of Wisdom, probably the work of a Hellenizing Jew, prepared the way for Philo, but the cautious writer speaks not of Greek 'Logos,' but of Hebrew 'Wisdom,' as the first effluent, the mirror and express image of the Deity (Wisd. vii. 26).\nThe Hebrew prophets had almost personified the 'Word of the Lord' and 'Wisdom'; and Logos, with its double meaning of thought and word (ratio and oratio), was easily identified with 'Word' and 'Wisdom.' As Dr. Hirschfeld has pointed out, Amr and Kalima underwent a similar process in the Koran.\\(^1\\) The Logos, having been thus personified, plays a very important part in Philo's system. It becomes the Demiurge or Architect of the world. The metaphor of generation is employed to picture the mode of its operation. Sometimes it is figured as masculine, sometimes as a female agent, but in either case it is one of the parents of the world of phenomena.\\(^2\\) On the whole it may be said that Philo's leading principles were, first, to remove the Deity far away from any contact with matter, and, secondly, to explain the existence of the world by the hypothesis of intermediate and subordinate agencies through whom the Deity worked, so as not to touch matter Himself.\n\nHence Philo's system was dualism. And this dualistic tendency was fostered by the growing influence of Manicheism. Manes, who formulated this old Persian dualism, did not live till the third century A.D., but many of the Gnostic sects of the second century A.D. held what were in fact Manichean opinions. And this led some, like Basileides, to emphasize the separation of the Deity from the evil material world. Basileides, for instance, though he firmly believed in God, declared in hyperbolical language that He was ouk ōn, 'without existence' in the sense of the phenomenal existence known to man.\\(^3\\) Others, like Valentinus, imagined a series of Æons or intermediate Intelligences, so as to remove the transcendental God as far as possible from contact with matter. These Æons were possibly the prototypes of the Šūfi Ten Intelli-\n\n\\(^1\\) 'New Researches in the Qorān,' 1902, p. 15. Some Šūfi theologians identified Muḥammad with 'Universal Reason,' or Logos. See Palmer's 'Oriental Mysticism,' p. 43, and 'Masnavī,' p. 179.\n\n\\(^2\\) Yonge's translation of Philo, i. 359 and ii. 205 (quoted in Appendix to 'Masnavī'). Tholuck, when he encounters this idea in 'Masnavī,' p. 77, and 'Gulshan i Rāzī,' l. 622, finds it shocking; but few like to face the historical antecedents or parallels of cherished tenets.\n\n\\(^3\\) See Mansel's 'Gnostic Heresies,' p. 147.\ngences and of the Celestial Hierarchies of Dionysius, which supplied the frame of Dante's Paradise.\n\nPlotinus, who lived in the third century A.D., was a mystic who busied himself with philosophy only to seek corroboration of his mystical beliefs. He started with the conviction that the One was all in all, and that all phenomena had no existence apart from it. He tried to reach a conception of the transcendental One by abstracting or stripping off all limitations and conditions incident to phenomenal existence, and by assuming that the residuum was the One. But as this residuum was void of all positive contents, it could not be conceived by common reason, and could be described only in negative terms, as 'Unconditioned,' 'Infinite,' 'Incomprehensible,' and the like. Reason could not say what it was, but only what it was not. His position thus seems to be precisely that of agnosticism, as expounded in H. Spencer's 'First Principles.' But here the resemblance ceases. Plotinus held that the impotence of reason to conceive the Absolute proved that ordinary reason must be entirely discarded in these matters, so as to give free play to the superior faculty of spiritual intuition or intuitive reason (Nous), which alone is competent to deal with them.\\(^1\\) This faculty discerns the One to be no mere negation, but a supreme energy of self-manifestation.\\(^2\\) Without any diminution or decrease of itself the One ever pours forth or rays out effluences. Hence arises an image or reflection of the One in Nous or Reason, the First Emanation, comprehending all being and all thought. From this proceeded in like manner the Second Emanation, called the 'World-soul,'\\(^3\\) Psychē, which acted as the mediator between the supra-sensible and the sensible worlds. This, again, generated the particular souls, human, animal, and vegetive, and, lastly, all inorganic substances. The substratum of all\n\n---\n\n\\(^1\\) Just so the Nominalists and their modern followers deny to reason a voice, not only on questions of pure ontology, but on all points settled by traditional dogma (Harnack, vi. 163); but thus to discard reason altogether is to make every superstition impregnable.\n\n\\(^2\\) The scholastic term was 'Actus purus,' pure actuality or energizing.\n\n\\(^3\\) The later history of the 'World-soul' is given in Renan's 'Averroes.' Dante censured it, and the Lateran Council of 1518 anathematized it. Pope, following Spinoza, revived it.\nthese manifestations of the One in the sensible world was matter, which was non-existent of itself (mé on), and yet the basis of each sensible object (bathos ekastou);¹ in other words, it was a mere potentiality of receiving the imprint of the Divine effluences.\n\nThe One, the Reason, and the World-soul, constitute the so-called Plotinian Trinity, which is one, not of equality, but of subordination. Plotinus says Reason (Nous) is the Logos of the One, and Soul (Psychē) the Logos of the Reason.²\n\nSo much for the theory. As regards practice Plotinus held that man’s duty was to return to the One.³ The motive for this return was the love of the divine spark in his soul for its source, and its consequent craving to be reunited therewith. The One was itself unmoved, but attracted its effluents through being the object of their love and desire. The return was to be effected by retracing the downward course into the realm of matter. By what Dionysius later called the ‘negative way,’ the mystic aspirant must abstract and strip off all the material and sensuous accretions which had overlaid his real essence. This was to be effected,⁴ first, by practising civic virtues, next the purifying virtues of asceticism and self-mortification, and finally the deifying virtue of contemplation.⁵ At last he would transcend all the barriers separating him from the One, and would be absorbed and reunited with the One. Of this blessed state he could only hope to gain transient glimpses during life, but when the body perished he would abide for ever one with the One. Plotinus sums up by saying this is ‘the flight of the Alone to the Alone.’\n\nAs Dr. Bigg points out, this mystical ascent of the soul is\n\n¹ ‘Not-being’ is an equivocal term—nothing in relation to God, but a very pernicious something in relation to man.\n² Ennead, V., 1 and 6, quoted in Whittaker’s ‘The Neoplatonists,’ p. 37, note 1.\n³ Plotinus followed Plato, who had said man’s object should be to attain likeness to God as far as possible (Homoiōsis tō theō).\n⁴ This threefold division of the virtues agrees with the Ṣūfī division of the Law, the Path, and the Truth.\n⁵ Contemplation, Theōria was Theou orāsis, the ‘beholding God’ according to the Schoolmen’s derivation of the word. Plotinus says the One is seen ‘in presence which is better than science’ (kata parousian epistēmēs kreittona).\ndescribed by Augustine almost in the words of Plotinus:\\footnote{See Bigg's 'Confessions of St. Augustine,' p. 321 and note. All these Plotinian ideas were worked into Christian theology by Clement and Origen, himself a pupil of Ammonius Saccas, under whom Plotinus had studied. See Bigg's 'Christian Platonists of Alexandria.'} 'Thus as we talked and yearned after the eternal life, we touched it for an instant with the whole force of our hearts. We said then, if the tumult of the flesh were hushed; hushed these shadows of earth, sea, and sky; hushed the heavens and the soul itself, so that it should pass beyond itself and not think of itself: if all dreams were hushed and all sensuous revelations, and every tongue and every symbol; if all that comes and goes were hushed—they all proclaim to him that hath an ear: \"We made not ourselves; He made us who abideth for ever.\"—But suppose that, having delivered their message, they held their peace, turning their ear to Him who made them, and that He alone spoke, not by them, but for Himself, and that we heard His word, not by any fleshly tongue, nor by an angel's voice, nor in the thunder, nor in any similitude, but His voice, whom we love in these His creatures—suppose we heard Him without any intermediary at all—just now we reached out, and with one flash of thought touched the Eternal Wisdom that abides above all. Suppose this endured, and all other inferior modes of vision were taken away, and this alone were to ravish the beholder, and absorb him and plunge him in mystic joy, might not eternal life be like this moment of comprehension?'\n\nThis is an admirable statement of the Plotinian 'return' to the One.\\footnote{See Ghazzālī's account in Appendix III. Also 'Hayy Ibn Yokdhan' or 'Philosophus autodidactus,' published by Pococke in 1671, and now translated by Dr. Brönnle under the title 'The Awakening of the Soul' (Murray, 1905). See his Introduction, pp. 17-19. A passage of this is quoted by the Quaker Barclay in his 'Apology,' edition of 1678, p. 126. Plotinus's own account may be read in Thomas Taylor's translation (Bell and Son's reprint, 1895, pp. 301-324).} It also well illustrates the main characteristic of the system—viz., its ultimate dependence on emotion rather than on intellect. Philosophy is only the handmaid of theology, only used to support and justify pre-existing beliefs. When his reason lands him in contradictions, as it must do when it tries to transcend its limits and outsoar the very\natmosphere that bears it up, Plotinus straightway falls back on feeling and the inner light. Love and faith are a mighty spell, as Jalāl-ud-dīn Rūmī says,\\(^1\\) and with Plotinus love and faith are always at hand to supplement the deficiencies of pure intellect.\n\nThe best accounts of Plotinus are those of Harnack in his 'History of Dogma,' English translation, i. 347; of Caird in his 'Evolution of Theology in the Greek Philosophers,' ii. 210; and of Whittaker in his 'Neoplatonists.' Opinions differ as to whether he is to be classed as a Monist or as a Dualist. This would depend on whether his 'not-being' is to be regarded as nothing or as something. Be this as it may, no one can read his impassioned outpourings without seeing that his theological reasoned statements by no means give the full measure of his beliefs. What he did believe in with a very passion of conviction was a Deity endued in some sense with the principal attributes of a personal God.\n\n\\(^1\\) 'Masnavī,' p. 262.\nAPPENDIX III\n\nGHAZZĀLĪ ON MYSTICAL UNION\n\n'Prayers' have three veils, whereof the first is prayers uttered only by the tongue; the second is when the mind, by hard endeavour and by firmest resolve, reaches a point at which, being untroubled by evil suggestions, it is able to concentrate itself on divine matters; the third veil is when the mind can with difficulty be diverted from dwelling on divine matters. But the marrow of prayer is seen when He who is invoked by prayer takes possession of the mind of him who prays, and the mind of the latter is absorbed in God whom he addresses, his prayers ceasing and no self-consciousness abiding in him, even to this extent that a mere thought about his prayers appears to him a veil and a hindrance. This state is called 'absorption' by the doctors of mystical lore, when a man is so utterly absorbed that he perceives nothing of his bodily members, nothing of what is passing without, nothing of what occurs to his mind—yea, when he is, as it were, absent from all these things whatsoever, journeying first to his Lord, then in his Lord. But if the thought occurs to him that he is totally absorbed, that is a blot; for only that absorption is worthy of the name which is unconscious of absorption.\n\n'I know these words of mine will be called an insipid discourse by narrow theologians, but they are by no means devoid of sense. Why? The condition of which I speak is similar to the condition of the man who loves any other things—e.g., wealth, honour, pleasures; and just as we see some\n\n1 The Arabic text and a Latin translation of this passage are given by Tholuck in his 'Ssufismus,' pp. 3 and 105.\n2 Dhikr is the term used to denote the orisons of the Dervishes.\nengrossed by love, we see others overpowered by anger so that they do not hear one who speaks, or see one who passes, and are so absorbed by their overwhelming passion, that they are not even conscious of being thus absorbed. For so far as you attend to the absorption of your mind, you must necessarily be diverted from Him who is the cause of your absorption. . . .\n\n'And now, being well instructed as to the nature of \"absorption,\" and casting aside doubts, do not brand as false what you are unable to comprehend. God most high saith in the Koran: \"They brand as false what they do not comprehend.\" The meaning of \"absorption\" having been made clear, you must know that the beginning of the path is the journey to God, and that the journey in God is its goal, for in this latter, absorption in God takes place. At the outset this glides by like a flash of light, barely striking the eye; but thereafter becoming habitual, it lifts the mind into a higher world, wherein the most pure, essential Reality is manifested, and the human mind is imbued with the form of the spiritual world whilst the majesty of the Deity evolves and discloses itself. Now, what first appears is the substance of angels, spirits, prophets, and saints, for a while under the veil of I know not what beautiful forms, wherefrom certain particular verities are disclosed; but by degrees, as the way is opened out, the Divine Verity begins to uncover His face. Can anyone, I ask, who attains a glimpse of such visions, wherefrom he returns to the lower world disgusted with the vileness of all earthly things, fail to marvel at those who, resting content with the deceits of the world, never strive to ascend to sublimer heights?'\nای ساده‌ترانی خالی\nدرکه عشتنی شیرینی\nآکفت و شیند، تیمی\nکیدم نوازین سر زیری\nادام کرد جویان کردی\nآدو کن می‌بایست بگن\nسبکی ای نظرخوری\n\nماهی تون نگاهانی\nآدم خیلی نگاهانی\nدروده نفریب پشتی\nچون برخی منقوشی\nناکی پردازی کرد افتابی\nکپنه و رنگی قطاقی\nای کردن آتا، خانه‌ی\nتون لاله‌ای به دود و درب\n\nمتاسارما آبون اسم\nدرسن به فیض و صاحب\nیعل محمد علی\nسر صحا\n۱۳۰۴\nنامه‌های زیگرک مترتب نشود، برخی از آن‌ها در دو بند\nایمان و آدم را که از مرادیان افتاده به درستی نمی‌تواند\nبشنودی شکل سپرده، مردم صفت کردند، اما\nاز کتاب جنگان جمله‌هایی\nچون ستیز و این عبارت و سطوب از این\nاشارت پربراهامی ذات تی سیان و تعلیمی برای\nوزار و حجیم ماست و جو، اما کسان آکا، و طالب نیما\nامید به‌شود، بسیج ذات از مشاهده جمال ذات غافل\nلوئن و نظره‌های صفت از طالب که لات صفات\nغافل کردن و این که درد در این این نشود که نی\nبو و پایان نی طلوع و این لاجم می‌توان قدر اقتضاً\nآنها و بر حسب می‌باشی اختصار کرد و شد\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nلا بُرْتَ لِلَوْجِ وَنِي المُوجَدِ اسْتَابَرَةٌ\n\nمَبَتِي بِصَفَاتِي كَرَدِ رَوَادِي\n\nمَرَضَتِي زَيَّنَتِي بِتَوَاجَدِي\n\nمَنْ كَأَحْيَى حَيَاتَهُ مِنْ أَرْجَعَ صَرَافَتَهُ إِطَالَفَ\n\nوَمَا شَرَحَ رَبْتَ دَرْوَاتَ جَمَعَ مُجَوَّدَ وَاسْتَخْتَارَتَهُ وَان\n\nدَرْوَاتَ عَينَ آنَ ذَوَاتَتَ جَمَعَ آنَ ذَوَاتَ دَرْوَاتَ\n\nعَينَ آنَ ذَوَاتَ صَفَاتَ كَا لَدَآ وَكَلَّتَهُ وَإِطَالَفَ\n\nوَجَمَعَ صَفَاتَ دَرْوَاتَ بَارَزَ إِنْبَثَابَ كَرَدِ رَوَادِي\n\nصَفَاتَ اِثْنَانَ عَينَ صَفَاتَ اِثْنَانَ تَرْجَمَانَ صَفَاتَ\n\nاِثْنَانَ وَعَينَ آنَ صَفَاتَ كَا لَدَآ عَينَ آنَ صَفَاتَ كَا لَدَآ\n\nوَمَا ذَوَاتَ صَفَاتَ عَلَمَ وَرَوَادِي عَلَمَ عَلَمَ بَرْزَ وَرَوَادِي عَلَمَ\n\nعَلَمَ بَرْزَ وَرَوَادِي وَرَوَادِي عَلَمَ عَلَمَ بَرْزَ وَرَوَادِي عَلَمَ\nالعالم و دو جنبه که از آن به هر از علم سید نمی‌کند،\nآن که جنبه‌های از علم نگویند و مرد و تمرین را با\nحققت از تقویت علم پشت زبان کرده‌اند شاهد کنند\nسرایت علم از آن که راجبان در بیشتر مواد و دان\nپرچم‌های این ابتدای شناخت علم و از اینجا می‌آید\nامامی پرم و راکتی مکمل صابر بنیان دستی از اینجا می‌آید\nکه به نسبتی جباری می‌گذرد و پیمان، و از این مل\nنود مکمل و خواهریم متفاوت از طبیعی که می‌گویند\nآن عیزی که بر از ناحیه علم پشت جریانی\nمتقاضایی و می‌بیند قاب عهد منا افتاده از این امید\nمرتبه علم و صورت طبیعت نظر شده است و علیه این\nسرایت علمی سایر امروزات بلندترین حکایات\nوقالوا تعبت تناوت ها قت بریول وبرد کلا رنفان پاس کو باخت مردو را علی اود الام لاکن نبست معلم اعلی به اود واجب بات مردو راه اود الاقص تصمیمی علی بن الود ومشی تناوت علی لبین و معلومیت احکام و جو واسکانیت و بیعت که احکام و وجوب علی اجا ور بعلم کا متر و درمیخت که احکام امکان علی بردو ور علم نبست و فاکه ضریب حکمت بیست علم ور اکر دکلام شیخ اقتت بردن شل ست و الاسم کا لات تابع مر به ور ور نجیب و قدرت واراد وفیرا میز پشت ومالیت مهر پر آستالی پرمیشی وارد مودات اصفت علیا\nاز دیگر که می‌کنند از که‌ها نیز برای او ارزش\nچیست که می‌کنند از که‌ها نیز برای او ارزش\nشده است معدوم و صورت نا رابطه‌ای است لایف\nو پیمان قلم مشکل شریعت شریعت اون از جمله قدرت\nتا ترتیب برقان تعلیمات آتی یا لیست بخوبید\nمرقط ابکا زحمت زوال حاکمیت و آن امر به\nعمی سی آفرین که بن الاحمد\n\nسرخاد و جوگرد و درست اول\nمیزان تغییر خصوصی اول\nپس شریعت تفسیری غیر اول\n\nشجاع صدر الدین نقوی که پس از اینالیا\nدر کتاب نصوص می‌باشد یک علم ابیضت مردوک را\nآن خانه محققیت از همان راکد و جوگرد پیت می‌نماید\nپن صیفاست و از آن افکار و دمای مردم\n\nنامه‌های خانوادگی و مدارس و نظرات پیر کاراجیان\n\nدر بعضی زمان‌ها شریعتی و نظمی و اخلاقی بخشیدن به مردم\n\nامروز که در تو انبوه و زیبایی و جو و جویش سود و دلیل\n\nمی‌نماید و از این امری که جو و جویش که شریعتی می‌نماید\n\nبا استفاده می‌نماید امری که جو و جویش که شریعتی می‌نماید\n\nامروز در این جو و جویش می‌نماید\n\n| سرزمین | پناهگاه کمال |\n|---------|---------------|\n| بخش زیرزمین | داشت کمال |\n| دارد تصویر قابلیت | تال |\n\nچهار رنگی که می‌نماید و خوش‌نمایی که می‌نماید\n\nکه در این امری که جو و جویش که شریعتی می‌نماید\n\nزیبایی و جو و جویش که شریعتی می‌نماید\n\nزیبایی و جو و جویش که شریعتی می‌نماید\nفإلى خدمة من قلباً مرمزاً، إن نظرة مرضا، مرست في إنسان\nشَرِّفْتُهُ النبَّأً من رجحَتْ عليه معرفة، وبدلاً من الفصل\nالعمل، رتابة في ضيف فاطماً نبتَ العينان في ضيافتها\nبين نسبته، نحن نجد، واحتفاء بعشقه، بصبرت اؤمن\nذا زوجتي، نحن أو\nيا نواز ودوحة\nوقدرتْ ونحوتْ دراً أزخرتْ بعين ميران\n\n| اين نمسيتْ بزمان مطرب |\n|--------------------------|\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n\n| اين نمسيتْ بزمان مطرب |\n|--------------------------|\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n\n| اين نمسيتْ بزمان مطرب |\n|--------------------------|\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n\n| اين نمسيتْ بزمان مطرب |\n|--------------------------|\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n\n| اين نمسيتْ بزمان مطرب |\n|--------------------------|\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\n| اين نمسيتْ بزمان مطرب |\nاین مورد و مشروطت حکمت و دربیت امیدوار\nلبست احکام و آرا این نا ایشیت تبر داران نارزگاران\nچشیت بطن و فناز لازم او پشت پسی احکمت\nدرجو و میان بخویت و دربیت بر صدست حقیقت\nکارآزادلو و وابد او و به واردان نظر غبار بی احکمت\nبصورت کرده احکام و آرا تقسیم و ترتیب\nاینی آید و متغییر و متکثیر نماید\n\n| ربان | بخویت و دربیت و دراج |\n|------|---------------------|\n| زنان | از ابطان که درمی‌بینی علیه |\n| برنا | سرگی برداشت خانگی |\n| استیا | اینست پان آنگارانگی |\n| باش | سرگردت و نفرگی نواز منا مرتبه درنگ |\n\nسرگردت و نفرگی نواز منا مرتبه درنگ\nلا يرتفع قلب ولا اعتق رأسك\nتافون نجابت از شارات\nشیوه تفاصل نمی‌نماید\nان از خیانت از طالب\nکه که نیست در دنیا\nکه که می‌آید و می‌آید\n\nلا تیپ سماوی از جمله راستگی\nخواهی باز راهت جنینها\nکه به فریاد انفجار\nسرزمین‌ها که نمی‌نماید\nدر نمای جنوب که در جنوب\nدر کتاب‌های دشت‌های\n\nلا تیپ سماوی از جمله راستگی\nخواهی باز راهت جنینها\nکه به فریاد انفجار\nسرزمین‌ها که نمی‌نماید\nدر نمای جنوب که در جنوب\nدر کتاب‌های دشت‌های\n\nلا تیپ سماوی از جمله راستگی\nخواهی باز راهت جنینها\nکه به فریاد انفجار\nسرزمین‌ها که نمی‌نماید\nدر نمای جنوب که در جنوب\nدر کتاب‌های دشت‌های\n\nلا تیپ سماوی از جمله راستگی\nخواهی باز راهت جنینها\nکه به فریاد انفجار\nسرزمین‌ها که نمی‌نماید\nدر نمای جنوب که در جنوب\nدر کتاب‌های دشت‌های\n\nلا تیپ سماوی از جمله راستگی\nخواهی باز راهت جنینها\nکه به فریاد انفجار\nسرزمین‌ها که نمی‌نماید\nدر نمای جنوب که در جنوب\nدر کتاب‌های دشت‌های\nمی‌دانم این را و اگر از این بطور کنید استاب\nاین غواصان ضرورت نیست بلکه از این ضرورت با ان\nضرورت تجربه کنید و با استفاده از قدرت بر فرض تجربه\nاز انجام ضرورت به دو جهت مثال نمایند مثالی خود ببینید\nرازم، او از پی کار زیبا انجام نمی‌دهد اما این مسئله\nکلاسیست، پیش رو و بر تجربه سیدیم مرد نظر بچه مردانی\nباشد که این راه و اصولی ها را بود و در حال آن که چند پی\nدرخت خارجی از این عین و اصول واقعیت باور\nآنها پیش از این و در این عین و اصول واقعیت باور\nپیش بروید تجربه کنید از این بطور که این\nاز این نظر به نظر بگذارید این که این واقعیت\nما از این نظر به نظر بگذارید دلیل\nلا أَنْقُتِلُ عَالَمَ رَا\nكَيْفَ اسْتَفَادَتْ تَبَانَشَةٌ\n\nيَلْبِسُ بَابَانَ مُجَوَّعَ إِذَا أَضَرَّ مُجَوَّعَةٌ سَبَتْ وَدَعْنَى وَأَصْرَمَةٌ\nوَمَجَدَّبَتْ أَكْثَرَ مَرَحَدَتْ قَارَقَ مَوْجَدَاتْ أَكْثَرَ رَاجِبَتْ كَيْنَةٌ\nوَمَدَدَ وَدَائِشَانَ نَبَرَ أَزَارَ أَضَرَّ حَزَنَى نَطَشَ مُوْبَشَكَةٌ\n\nأَكْرَمَتْ نَدَانَانَ جَوَانَ نَطَشَتْ وَجَوَانَ جَمَامَ نَحَبَتْ سَ\nنَتَرَكَتْ بَالَارَادَ وَجَبَمَ وَتَرَقَبَتْ رَابَابَةَ ثَلَاثَةَ وَجَبَمَتْ\nلَايَنَ مَرَضَوَعَ وَمَمَوَدَّ ذَاتَ أَتَتْ كَرَمَ وَرَأَتْ جَمَّ وَحَصَلَ\nإِشَادَتْ نَدَانَانَ صَدَرَ حَرَبَةَ مَدَرَ وَرَشَدَ وَأَرَقَبَتْ إِضَاضَتْ\nالَاَآنَ ذَاتَ بَمَكَرَ دَيَنَ مَغْنَمَاتْ نَطَشَتْ زَيَارَ\nسَمَنَى طَلَتْ ذَاتَ نَالَ النَطَشَتْ رَبَتْ وَمَنَمَى ذَاتَ\nرَالَمَوَهَ هَكَدَانَ نَالَ الْبَرَانَ ذَاتَ بَمَكَرَ دَيَنَ\nحَتَّى دَمَتْ خَمْرَ أَسَتْ كَرَتَبَتْ ذَاتَ خَدَ وَتَنَوَتْتَ\nمن فی امکان دال تفیبات و انار کرده صورت است\nاز آن تفیب منبع کرده و درمان آنان پلخ برخیان\nرست رجایی نمی‌دیر خاص که مانند تفیب توانش\nمی‌گردد و در آن نیز برای این پشت مضیک کرده و قوی\nدرکرده و جست رجایی حاصل و کهنا از شا، اسب\nسرج و دوآن کپه تجلی و اقی نشود و در سرای نمی\nبهم و دو دیکری شدن آن بوجود آید اما نمی‌کرده\nتا قاب اشال تناسب احوالی بنادر و دودوم\nبرک طالبی و در ازمنه متوالی برکی منوال\n\n| ستیزگرم | پلخ برخیان |\n|-----------|-------------|\n| واردگری | ازآن تفیب |\n| سرا عطیه | جدایی |\n\nبه جان آفرینی نمی‌آورند\nدر مرز نمی‌برد جانیم\nاوزاع عطیه کرد صادق\nدر سرزمین مخلصت نجات دهید و در بخشی از اسلام کار انجام دهید\nدر دو آن که تیم و کیشان نجات نگیرد و کلید سرزمین\nتنها و کرکس سرزمین و در دو آن ثبت نگری کنید\n\nمن که عیان پد و دو آن شان\nوشان در کتاب کنند سال\nکرایت از کلام حضرت\nاین که کوچک کنید همی\n\nو سرداران ان پد کریست حق را اما پادت مقابل\nبیشتر لطیف و بیشتر قدرت و مهربانی برکا را توطئه کرد\nکه جان‌پس جهان‌پسی از خاطرات امکان‌پذیر است\nشرایط و ارتفاع موانع پیش‌آمد و جود کرد درخت رجای\nاورا دریابد و برودی ان ضعف و جوگرد و نظام و جوگرد\nلبس و آثار و احکام آن خشتیت تنگی کرد و تنگی خاص\nنجات شود که این نمین سبزیان سبب قرار صبری شود\nبرایت نکاندند از آن\nما ام عجیب را از این امر\nهالی بردارند زیرت علی\nزندگی طوری که جای\nسرت تخته‌های ساری\nدر این خانه‌ای آن‌ها که\nابره متنی نشده اند این که\nبه صورت واعادی عالم و دیگر\nو نظر فرست اورا در انتظار که\nرا اضافه خانه به دنبال راهی بودند او\nسرنخی که از این که\nکه این امر از این که\nاز این که از این که\nو از این که از این که\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nو از نیازهای ادبی و اقتصادی امروزی، آن‌ها را می‌توان به دو دسته تقسیم کرد:\n\n1. **در سطح عمومی:**\n   - شرکت‌های تجاری و صنعتی\n   - اداره‌های دولتی و شهرداری‌ها\n   - مؤسسات آموزشی و پژوهشی\n\n2. **در سطح خصوصی:**\n   - شرکت‌های خصوصی و بخش خصوصی دولت\n   - اداره‌های محلی و محلی\n   - مؤسسات غیرانتفاعی\n\n**شرح اصلی این دسته‌بندی‌ها:**\n\n- **شرکت‌های تجاری و صنعتی:** این نوع شرکت‌ها به‌طور کلی برای تولید و فروش محصولات و خدمات به‌منظور درآمد و سود هستند.\n\n- **اداره‌های دولتی و شهرداری‌ها:** این اداره‌ها به‌طور مستقیم برای اجرای برنامه‌های دولتی و شهرداری‌ها به‌منظور بهبود زندگی مردم هستند.\n\n- ** مؤسسات آموزشی و پژوهشی:** این مؤسسات به‌طور مستقیم برای تأمین آموزش و پژوهش به‌منظور توسعه و بهبود اقتصاد و اجتماع هستند.\n\n- **شرکت‌های خصوصی و بخش خصوصی دولت:** این نوع شرکت‌ها به‌طور مستقیم برای تولید و فروش محصولات و خدمات به‌منظور درآمد و سود هستند.\n\n- **اداره‌های محلی و محلی:** این اداره‌ها به‌طور مستقیم برای اجرای برنامه‌های محلی و محلی به‌منظور بهبود زندگی مردم هستند.\n\n- ** مؤسسات غیرانتفاعی:** این مؤسسات به‌طور مستقیم برای تأمین خدمات غیرانتفاعی به‌منظور بهبود زندگی مردم هستند.\n\n**پیشنهاد:** برای بهبود وضعیت اقتصادی و اجتماعی، نیازمندی‌های اقتصادی و اجتماعی را به‌طور منظم بررسی و برنامه‌ریزی کردند.\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nعليه وضعت برزور بصور حاصل و إياها من كتاب تبي\nفي الكتبة و يوجد في شرائط كبرى جميع من راتب و حق\nمترتب و إن ساربست و دوي درين راتب و حقان\nيعميان راتب و قاضيت خانگیز این راتب\nو حقان دو عین و دو بودنیت\n\n| متنی نمودی کند رهیش |\n|----------------------|\n| در رسی جاب پایان |\n| برح عدم لواح فرض |\n\nچون ادیم پیت\n\n| حق رام شهر جداره ام زنگ |\n|----------------------------|\n| عالم در تحقیقت و حق عالم |\n\nجزمال انفت\n\nچندان کجا رکزات الهی پیت تالی ناخبت\nمرتبة في تفسير وردت تفسير حاصل من جميع تفاسير نقله جمهورهم\nالآية، وأمتحن تفسيرات انفعالات أحكامه كونها رادين من مبسطها\nتمتين ودل نزكادو لقياً تختت وجدوا وقته ووق\nأو مرتبة لا تفسيرت لا مبرهنة إلا اصبت جميع تفاسير\nنيله مشرها است ديان مرتبة الوضييت مرتبة رابع\nمرتبة الوضييت مرتبة اسماء وضييت اثنا زفت اثنا\nإثنان ومرتبة إضييت نظار بروه ودقت كر وبوب و\nخاص او بيت مرتبة خارجاً مرابيتي جميع تفاسير\nانفعالات كارشان اثنتان اثنا انفعالات\nمرتبة كوكبنا امكانيات مرتبة دو تفضل مرتبة كوكبنا\nاسكاناً اضييت كمرتبة اسماء ووضييتان ومرتبة\nاعباً تزا علست كاركان ازلوازم اوسيت وآن\nوصفات ومقاصد است از علاالت القاطر ونحوه\nومنزرا ورفت جلالا وزبان عبارتی ونوعی که\nکمال وسکان شاریت ممارات بکشید از این\nچیستی در جواب ونم اصیل علم از مشاعر محسوب\nوراضیاب نایب نشان از دو نشانه و\nنمازت ۶ نان وی جیراسین\n\n| از تربیا ساونیا سامانه |\n|-------------------------|\n| روزات تو مطلقان ثانیان |\n| سرچشمه جان عارف آگاه |\n| سرست تمثال کهن راپود |\n| این شکل پشت خروان آگاه |\n| نوشته کن زنورا و صبر حسن |\n\n| بندر تینا و کامانه مرغ |\n|-------------------------|\n| کانجکار تونی بوئنی نام |\n| از دوم تا سی تا شریاب |\n| از دامن دراک ترکیب |\n| حاشیه کشو و بعلی بدرک |\n| از بر منا ناز از طلاق کش |\nومنبی وابی رات نخور صدایت کرد سرای راب\nیزد جون مرتبه از دید و درب پشت و در تیپ عود\nوخلیتی پر اطلان قاسمی مرتبه آستی شلادونی\nدر جن و نفره بر مرتبه کونی می‌کند و حسن نموده با\nوچشی اطلان قاسمی خضومه مرتبه کونی بر تربه\nآنست غایت ضلال و نبايت خدالان لاش\n\n| ای برده کارک ماجرگان | ون صوت صداقه وصیفی |\n|------------------------|----------------------|\n| سرمب از دوم جدی از ار | کر خلف مرتبه کنی |\n\nموجه دیتی کی شینت و دان گن وجو حق\nوتمی مطلب پشت اما اورا مرتب بیار ارتاول\nمرتبه لا اتفاق و عدم اخبار پشت و اطلان از مرقبی\nواعبار از نجیبی شنزا اسپتا اضافات نمود\nتَمَّ بِبَابِ شَان، وَحَدَّثَ حَضْرَتُ دَاشَارَ مَجْدُوُد، عَبَارَتُ اِنْذَارِ تَنَيَاتِ وَجَوَدِ، عَبَارَ اِنْصَبَعَ نَطَابَرَ وَجَوَدِ، بَابَ رَاجِمَ خَلَاقَ شَانِ، يَخُدُّ وَجَوَدِ، تَمَّ بِبَابِ عَبَارَتِ بَرَدَجَيِ كَهَتَّانِ، تَمَّ بِبَابِ وَجَوَدِ، بَابَانِ بَابِ شَانِ، وَبَابَ جَكَامَ وَآثَارَ، اِنْظَرُ بَرَدَجَيِ، زَرَّاً، وَالصَّوَرَ عَلَيْهِ اِزَبَابِ وَجَوَدِ، بَابَتِ وَآلاً\n\nجَلَّ بَابَ آمَدَ\n\n| بَرَدَجَيِ | عَبَارَتِ |\n|---|---|\n| وَجَوَدِ | وَجَوَدِ |\n\nجَمَّتَتِ وَجَوَدِ، اِكَرَرَ بَرَدَجَيِ مَجَوَدِ، دَاتِ نَزَنِ، وَنَخَارِجِ مَنْوَلِ، وَنَخَارِجِ مَنْوَلِ، وَ161، وَرَادَارَ اِتَّبَعَ تَنَافَرَ تَرَبَشَ، وَدَرَمَ مَرَنَبَ، أَوَرَالاَبَايِ، وَضَنَاتِ\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nمطلبی که مقدی باشد و مقتدر بله\nصورت نبند از مقدی که جست طلسم و مطلق\nپشتیان زمین‌پس استادام از فنیت و انجام از\nاین طرف چیکمان حکمت و درک منفی کرده\nای دهم قدس و تابع اجتناب\nعالم تربیت و تربیت\nارابی و جست فرزندان\nو اضافه مطلبی که مقدی باشد از مقدیات علی‌الله\nالبهائی می‌باشد مقدی خوش و جون طلسم ابراهیم\nفیلا انجام می‌باشد اورست لاغر\nتراب تراباب علی‌الله\nبرگردید و توان کردن به\nای ذات رفته‌اند جویش\nظهور و خفاش شیون و اعتبارات بسباب\nبنا مرد جود و عدم آن وجب تحقیقت و جو و ضما\nحیات او پشت بکل متین بر تبل نسب و اضافه ناتوان\nمختصر تغییر دارند نی اگر و ازین زید رفیز و دور\nپیشرس نشیند نتیجه زید و انجمن شدو و داشت\nصفات جمعه و دیگران بردار و پچنچ قنیت و جود\nبا استناد به مورد شریف زیدی که کالا کرد و کشت\nطور منظور حیب نصیان نپر و نوار اناب پر\nبرای و لبی به ج تغییر می‌آید و در پت اورامیاب\nاز شب به کرد و نازکان که زنگ را عاره و از کارگیران\nج نفر زن و نوع و جوان\nنفر و از امریکا تجربه\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nلا تهدر لقينات وتحفظات مماثلون إلى إنك منبرج\nومنبع يوبوند هو صوت ذات أولاد منبسط عصور\nإيان نابته بآمند ونابيا در تربیت عین وباشتن\nاحکام وآثار ایث نظر سره و کمال آنیست\nمرابط وجو در صورت ایان خاچیگر فندرنست\nدر خارج الاحتفال واجدک با پیمانی شون صمات\nشکر و متقد ویما نسبت آنان ک رضی مراتب\nچوکیس اندو با حکم و آثاران سید\n\n| جو عدنان رانفاونت |\n|-------------------|\n| خاکفر نمیدم و خواهد دمو |\n| احکام می‌شود و اجاوره |\n| کی ذات نقطه و کهن |\n\nکر تصفیه ورگان ورگان\nجز ذات حق و میزانی\nآن که من معدن و جیوانی\nآن کشت و می‌شود و ضا\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nو از هر امر مربوط و از هر عشیت از دو جهت بین\nموح و از متغییر که ناگالی بیان ان اسمی علیه\nزندگی نیاز به شناخت\nکرده و تو در میان نباشیم\nدرخواست می‌کنیم\nاز دیدن ان غمی می‌شود\nواجده مراتب عده‌ای\nاندیشان را درون زمین\nپس ترتیبات و تغییرات افزود و انواع\nمند بگذاریم که از این نوع اندازه‌ها\nجمع شوند و پیچیده‌ترین ان انواع را که نصیب خواهند\nریشه کنند و حیات جوانان جمع شوند و پیچیده‌ترین\nوشا دت پر دی ود را ازت و مقصوداً لازم\nچنین ذکر که اما بست که لب جلاد است و اسکال\nجلادی نظر او بکار از اعتبارات و کمالی پیچیده\nشود اومد که بیش از اعتبارات و این نظر در\nیا نیز نظر و شمو بخوند خلاف که از آن که\nزا تپت منفی خور از ازدواج نیست خوبی اعتبار\nو خیرت و این نظر رست علمی و بنام مفسر که\nوقای طلسم لازم که از اعتبارات و نیز علم طلسم از\nشون و از اول اعتبارات ذات بحاکمه و از اما\nعلى به کی چگونه و جلد و ترب قانون آن که کون\nیا نایب مر ذات برای طلسم و از ازدواج کمالی و جلادی\nشاهد و باستانی صورت و احکام که از این شوت\nلا يمكن قراءة النص العربي من الصورة المقدمة بشكل طبيعي.\nبطن واعليت وازليت وباقيا اتصالات ارجح\nصفات دايجرا است مرتبة واعليت وارادت\nخور واحترمت واعليت واعليت واعليت مرتبة واحترم\nبمني زان تلیک ک اتصال ذات بانابا قبا رزی\nچهارت خواهر در طاباشندختی ودوم ومحرم خانق\nگریم پناهیت وراثت وراثت ونفرما ونفرما ناکشند\nچون جایت وعلم وراد ونفرما وانبا اما صفاتی\nبربودن ان وصورت معلومیت ذات تلیک\nبند الابعاد وصفات توانی آبیاری پشت وملزیا\nروح وانبا موجب تقد ووجودی نفت وبمنی زان تلیک\nک اتصال ذات بانابا قبا رادت کریمانت\nپوئن فصول خاص تجربیات کرمیزیت ایمان غیریان\nنگاهی به وظایف پیمانکاران در زمینه‌های اقتصادی و اجتماعی\n\nدر اطلاعات ذیلی، وظایف پیمانکاران در زمینه‌های مختلف آورده شده است:\n\n1. مراقبت‌پذیری و حمایت از نیازمندان\n2. دیدار و دیده‌بینی با شرکت‌های بزرگ\n3. سرچشمه‌افزایی و بهبود وضعیت اقتصادی\n4. تحقیق و بررسی‌های علمی و تخصصی\n5. ارائه راهنمایی و مشاوره در زمینه‌های مختلف\n\nاین وظایف به‌طور کامل و جامع انجام می‌شود و شامل تمامی جنبه‌های اقتصادی و اجتماعی است.\nذات من حيث يزعم اسماء صفات نوا\nوأرجح نسب واضافات مبرزا اقتراح ابواباً لمور\nباعتراً توجهاً وسماه بما لم تظهر وتحكي أولى كونه في رؤية\nنور نسبت علم ووزر وجو وشمس ومتغيرات ونسبت علم\nنسبت علم قديم الميت ومعاودته شد وذر وسلطان\nوظا فرست ومنظورت وروح وشمس مستنجد واصبحت\nوموجوديت وشاهيديت ومشروبيت وجميعيتيت\nلا نرم نور نسبت بمؤقت بطول وطولنا انتم ذالك و\nاوينت نسبت بالطريق اسم أول واخر وظا مطلوب\nمتن شجاعيت من دخلت الى ذات الى باش راسب\nواضافة تتصاعد في ثور ومرحن تضاي نسب\nواهاد او شجرة ظهر او بلكر غدا او شجرة في من اختب\nلا تطاق في اسم بحضرت تقي حباده نجمي في ست نجمي دل\n\nجنازه ضعيف نجاو كود\nپشت نبا عقل اصیاب شود\nایمان نما رشید می‌گردد\nیکم کیا شناست ارباب شود\n\nصفات غیر و اندازه جدید با این اصول\nو عین زا اندازه جدید التحق و احکام شاهاک از پی\nابا صفت علم و فرق را ابتکار قدرت و میراث اقتدار\nاردات و شکنیست که اینجا خانه بعباس منوم\nمتقارن درم ذات را از می‌پردازند اما جلب حقیقی\nعین زا اندازه بان می‌گردد اما وجود ایست متفاوت که\nوجود لیست و صد و سیصد و صفات نسب و اعتبارات او\n\nای ربع شانسات تو بالا رفته\nازدواج قهرم و فریض صفا\nبا دست کمی توانست این\nبا دست تو ورزد و خوش گرم\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nلا يوجد نص يمكن قراءته بشكل طبيعي من الصورة المقدمة.\nدوام این نبست از دوی و شور پشت اماچون آرزویا\nلطفان در وی نمود کرد و مخملی پیش سات و بیت‌های\nاز ابطان دی دور اندادان نگلید کنید بر لذت‌آت جمالی و را\nرو جانی کلمت می‌دهد از میان بر حیرت و ولت شده\nدر حاشیه و زید خاطر از مرآت‌بست ایمیل پر از دوزن\nباشید بین ترانه‌تنم اعشق نو\n\nکانی برای ان سپت پارو\nدی پرم پرت زاد تو\nزدیکرده پرت زاد تو\n\nچون طالب صادقی مدنی نبست جزیره‌ای\nالندازی پشت با گر دریا پس جانه‌ای درخواهی و بازی‌ای\nکتیابی نمی‌ت رابرتریپ و تقویت آن کارد و هانم\nمنانی اینت خوراپاز و اروخانان انگار کاری آن\nاز نظر این که جنگ‌ها و شورای‌ها نیز مانند فعالیت‌های\nزیادی که بنا به آن‌ها، نیاز به یک کتاب\nکه در زمینه‌های مختلفی از این‌ها\nتوصیف کنند، دارد، لذا، به عنوان یک کتاب\nاو را ارائه می‌دهیم که به‌عنوان ارزش طبیعی واردات\nویژه‌ای است که می‌تواند به‌عنوان ارزش طبیعی واردات\nمطلب‌های واردات منطقه‌ای و همچنین مطالب‌های واردات\nو معقولات از نظر بسیاری از مردم شود و از نظر روی\nتوکر و اندوه‌زدگی سبب‌های اکثری و شورش‌های\nوجود بر فرم‌های صورت‌پذیری\nکلیدی در این تحقیقات نیست\nدر مورد نشانه‌های مختلف طبیعی\n64 ام که از بام سواو سوپریور کنار برد\nآن نبست توی ترکش شمی باگر دناخواطر می‌تواند\nساخت سیده‌ها درون زندگی و نژادی و پشتیبانی جان‌بر\nباشند. این امر از نظر استاندارد و از نظر انجام\nنشده که در ماه‌ها و سال‌ها به عنوان شورای اسلامی\nدرآمد.\n\n| از ابتدا به موردی که در اینجا دیدم | یارب موردی که در اینجا دیدم |\n|-------------------------------------|--------------------------------|\n| آن از ابتدا به موردی که در اینجا دیدم | یارب موردی که در اینجا دیدم |\n| از ابتدا به موردی که در اینجا دیدم | یارب موردی که در اینجا دیدم |\n\nفناوری رت از پیش کلوب اسلوی طور\nپشتیبانی با اینجا با سویا و شورا نگاه و پیش‌بینی نباشد که\nفا و فنا ماند رجت زیرا از صاحب فنا از کربلا نه شور\nشیطان حب نما باشد که اکثر صفات نما و ضرفان.\nاین جمله واقعی ناوقات و حالات از نسبت خالی نباید در آدمان ورودی و حیب ورودی و خون و پرورش و کشت و باکتر و رنج و کات و مکات طاهر و وقت می‌باشد و این بجا است که در کنار دیگر\n\nو این نفر باشی اتفاقات برایان\n\nنگره‌هایی نام سالنال\nخوشکوب و مهر ترازویال\nدل زنوار و رو وردهیال\nدارم مهابادی پیر ورمال\n\nپیمانکاران منتاد نسبت مکور که بقول\nجميع اوقات و ازمان و اصبت مکن از دیگر که ان\nبسبب تنوی از مالبند اوان و تبری از مالاظن صبورانکا\nآن مطلبست و آن خیلی به ملی و جدی نام برای پیوند\nدو نما می‌نماید و دیگری در اطراف شنی ترو ساو و مختنی تر\nابوالحسن دوختنی شناسایی کرد، جات می‌برد و ته‌ها\nجال ویند و دراپ کانیت مرادی کال او بی‌رن\nچنان مامورست نیای کر اجان فرآمید و کشتی توار\nتور خزد و کرکوز روی او رودی باورده باشی و چون\nاردو تجربه کرده‌اند که از دورده باشند تسلط شود و باختن تجربه\n\n| درمی‌بیند را سری‌شی |\n|---------------------|\n| ازش کل شی که کنی |\n| و زمردن و زینت نمی‌ختم |\n| زبان از من زیر نمی‌ختم |\n| اما شتی جال و تسلط |\n| جان در راهیت شنوق ازی |\n\nدر زمان نبست شرفی ابیک و بر و جایگی\nإنّه من حال طلوع النّور\nإلى خزائن نور تقدّم\nأدنى كرّة بسبب جمالية ونفاذة كمات\nالإنساب وجمالية ونفاذة الطافشة ببربر ودروي\nأردّهم أن كبرت وبربر تعود كأنّهم أن نغرد ولأنّا\nكما كنا أن نحن نضيع ناطق بجورطا في حانات نتخيل\nربّاً كام صادق أن تفترك دوّ صارت كانا الوجدة\nواضاعهم خسارة وإبطال شتات اتصال بين صورت\nجانب وكالة كشتّال في كبريمولا في جانب شدها إنك تودّ\nإذاً، نحن أنّنا متيّر في توندو للشوي المولود مقتضين\n\n| بابي تواري شوان دري | إيا رابد تومين إيش |\n|------------------------|------------------|\n| درو وخاري تمرد كلي | كلكت اندرن كرش |\n\nبس بايد كوكوست دخوران أز نظر وچشي وبردان\nچیلی علی الاطلاق، دو اجلاس اضافه\nمرجال کالکر، درمیان راتب ظاہر پر تو جا کال\nایست انجام نافته، وارباب راتب برانگشت\nجال صمیت کال اینفته، سرکار اینی دان انزودما\nاورپت ورکجاپنا شنیشتر، میانی اورپت\nداباجلد مصفات اورپت ازاوج کلست، واطلاق ل\nفرموده ورخصض جز ورپت، ویبچلی نود، ناتوان\nجزو کل راه برمی، وارتفع الاطلاق رومی آری نامک\nجزو کل متازدا سین، ومجیدان طبقتن زنانی\n\nروح جاشاری کلنک شمعان\nمن اصل کلماتی نیست\nآنطوف تروصباحت نم\n\nپون دیدمیان کلنک نیاز\nاز اصل پر اینگی نیاز\nویسلد زلف مجید حکیم\nپشت آنل و امانی پدید و رشته اعتاد درین مزخرفا\nکانی حسین دل زمین برکن و درخواه بنده وازمبل\nو باخدا موند ادست کر عیشه به وگریش ابند\nوچهره تباش رنا همچه جاودان خراش\n\nتصورت و لکشتر دردمن\nوودر نکه و مکر و اطلاع\nرنگ آدم تبدیل تاب نمیم\nامکان جال جاو و این از ام\nچری کن دردی رقابت\nانحراف مردی جدای اوایل شد\nای نوای کرمال از زیربست\nخوش کرد لش به لبی دربید\nتی باید نمی‌خواهیم از اینجا پرست و در\nجالی طبیعت و باطن، مناظرت نمی‌خوریم که\nدیده‌ای از لقای او برداشته‌ایم دیگر نمی‌خوریم و\nطريق رضای او بودن شترانه و کسری\n\n| آنچه آن دلخونی کرده‌اند |\n|----------------------------|\n| شمرده‌اند از آن دلخونی کرده‌اند |\n| پرداخته‌اند از آن دلخونی کرده‌اند |\n| پرداخته‌اند از آن دلخونی کرده‌اند |\n\nپس این حق و علا در پرست و دال و دفنا\nچشمان محاکمه می‌شود و صورت شان می‌شود و دیگر می‌شود\nدر روشنی و داشت و نمی‌خوریم و امروز نمی‌خوریم\nوی لو و میدانست که مرد از اوی جواد که سو و زمان\nای رودل تومار که خانم\nچن ثورت دربیت حاضری\nلاو آدم تونر تروپوا\nای سالک رهگیری نمی‌کند\nپون علاقت ثورت این بابان\nای لطلب کمال درست\nسرگرد جز و کرخا و پوسما\nدر عالم می‌بینی نشان دادی\nنابان کردند از او سپرده\nشکمی به پروار شدیان\nباشد من پنج مان تمن\n\nما جعل الله لیچی من قلبیان پصرتیان\nکرایه‌تی پس داده‌ست در درون تو خردی دل\nنماد اسپت تا دوخت او کردی این که دل وان\nغیره مرض در رو قبل آن که گری دل را بصدان\nکنی و سرایه را دری مقصدی اداره می‌کنی\n\nای ان انتقال و فرار وست ترا\nدل پیان دان کنیوست ترا\n\nترمیم رست از آبست کر دل او ابطاق\nاین رساله از مجموعه‌ی ادوار و پایان‌های مختلف\nو معنایی که از ادوار اسرار و ادوار ارباب عرفان و اصالت\nدوست و جوانان لاحق کشته‌بارات لاقط و اشارات آنها\nمی‌گذرد و متصل به این پناه در میان نمید و نبیا\nاین اوضاع و حالات ارضی شنیده به اورادی کنف کرده\nپسیان نیز این تجایلی در این فیروزه‌های خود را نمی‌کنند\n\nمن نمی‌کنم من نمی‌کنم\nاز نمی‌کنم من نمی‌کنم\nاز نمی‌کنم من نمی‌کنم\nاز نمی‌کنم من نمی‌کنم\nآبگیاه و مرچزرا اخلاق پست بانجای نهی را بردارد\nصورت پرچم جلوه مده از پرچم به جالس پستی برده می‌شود\nاین صورت خانایی را پرچم جلیست جالس خودکر دانست\nچاپ و دوری و این نوشتاری را سرایید دانایی می‌پنا\nماکر دان ن آلت جالس کوری و خوردنی و دوری\nسمان پست ها با گزاران از این ای کرامت\nگی و با خود آشنایی ارزان دار\n\n| آتش و کربن کام | یارب دل ان و جانان |\n|------------------|-------------------|\n| آب و دود به خوردن | در داده و دادن نودم |\n\nوزن حمله ایان و مالکی کن\nدر شیطان و دم خسته کردن\n\nیارب من طلوع ابریم نگن\nمدی دلی رفتن کل کن\nمهم‌ترین شایعه‌های کنونی\n\nجایگزین‌های اولیه افخم علم‌پردازان از ناحیه و دوباره در این شایعه‌ها جنگ‌نشانی شده که در این مکان زبان‌هایی و مسائلی را به راه‌یابی آن‌ها برای انجام اظهار عرفان به‌صورت عمیق توصیه و با انصراف در این دیدنی‌ها مشارکت حسن‌اندیشی دارد.\n\nآنچه سکانشان نشود\n\nمن است از این پشت‌نماییم\nو تفاوت‌های این دانشگاه\n\nالبته، علی‌محمد صبای لوایی، احمد و صاحب المقام‌های\nوعلی‌محمد و اسحاق، امام‌زاده‌های بزرگ، الهی‌الله، المتقه و دو پسرشان\nآیین‌الله‌خان، ناعن، الانتفاع، المالات\nو از این‌جا، این‌ها که نمی‌توانند به‌طور اصلی از صبح‌برداری\nلا احصی شان علیکم که نبود که شان بیود الکیب جلعن\nشایی خاب فمکانت کا شینت علی فنگیک خدا\nپاس پس تو بزبانی آریم و پستیش تو بر تونی شادیم\nسرچ در صاحبین کانات از جناب اشی و محا مرس می\nجنب عظمت دگربی توانایی پت از وریت و زبان\nماه آریک سی پاس و تاش راشید و تاجیانی کردو\nکه و کوم شانی تو از پت کردو و پفیسته\n\nاعمال کال بیرای ترور\nعالمی از برجعای ترور\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/publications16orieuoft.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 136, "total-input-tokens": 195078, "total-output-tokens": 50471, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 280, 5], [280, 280, 6], [280, 701, 7], [701, 701, 8], [701, 907, 9], [907, 907, 10], [907, 2536, 11], [2536, 4743, 12], [4743, 7203, 13], [7203, 9336, 14], [9336, 11770, 15], [11770, 14032, 16], [14032, 16351, 17], [16351, 18802, 18], [18802, 21022, 19], [21022, 22407, 20], [22407, 24004, 21], [24004, 26088, 22], [26088, 28091, 23], [28091, 29895, 24], [29895, 31578, 25], [31578, 33566, 26], [33566, 35581, 27], [35581, 37354, 28], [37354, 39383, 29], [39383, 41377, 30], [41377, 43256, 31], [43256, 45502, 32], [45502, 47364, 33], [47364, 49466, 34], [49466, 52012, 35], [52012, 54348, 36], [54348, 56531, 37], [56531, 58771, 38], [58771, 60739, 39], [60739, 62544, 40], [62544, 64291, 41], [64291, 66356, 42], [66356, 68323, 43], [68323, 70634, 44], [70634, 72460, 45], [72460, 74670, 46], [74670, 77082, 47], [77082, 79321, 48], [79321, 81371, 49], [81371, 83685, 50], [83685, 86040, 51], [86040, 87901, 52], [87901, 89900, 53], [89900, 92242, 54], [92242, 94297, 55], [94297, 96431, 56], [96431, 98437, 57], [98437, 100732, 58], [100732, 102658, 59], [102658, 103059, 60], [103059, 103070, 61], [103070, 103070, 62], [103070, 104776, 63], [104776, 107110, 64], [107110, 109450, 65], [109450, 111841, 66], [111841, 112724, 67], [112724, 114436, 68], [114436, 116771, 69], [116771, 119215, 70], [119215, 121577, 71], [121577, 124071, 72], [124071, 125064, 73], [125064, 126781, 74], [126781, 128487, 75], [128487, 128487, 76], [128487, 128487, 77], [128487, 128835, 78], [128835, 129347, 79], [129347, 129400, 80], [129400, 130126, 81], [130126, 130690, 82], [130690, 131155, 83], [131155, 131639, 84], [131639, 132263, 85], [132263, 133472, 86], [133472, 134003, 87], [134003, 134818, 88], [134818, 135380, 89], [135380, 136221, 90], [136221, 136776, 91], [136776, 137351, 92], [137351, 137679, 93], [137679, 137732, 94], [137732, 138938, 95], [138938, 138991, 96], [138991, 139433, 97], [139433, 139993, 98], [139993, 140583, 99], [140583, 141136, 100], [141136, 141810, 101], [141810, 141863, 102], [141863, 142258, 103], [142258, 142739, 104], [142739, 142792, 105], [142792, 143314, 106], [143314, 143367, 107], [143367, 143747, 108], [143747, 144265, 109], [144265, 144321, 110], [144321, 144810, 111], [144810, 145219, 112], [145219, 145731, 113], [145731, 146283, 114], [146283, 146336, 115], [146336, 146389, 116], [146389, 146896, 117], [146896, 147426, 118], [147426, 148093, 119], [148093, 148620, 120], [148620, 149071, 121], [149071, 149651, 122], [149651, 150135, 123], [150135, 150482, 124], [150482, 150995, 125], [150995, 151147, 126], [151147, 151517, 127], [151517, 151906, 128], [151906, 152428, 129], [152428, 152975, 130], [152975, 153318, 131], [153318, 153318, 132], [153318, 153318, 133], [153318, 153318, 134], [153318, 153318, 135], [153318, 153318, 136]], "primary_language": ["None", "None", "None", "None", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "fa", "fa", "ar", "ar", "fa", "ar", "fa", "fa", "ar", "fa", "ar", "fa", "ar", "fa", "fa", "fa", "ar", "fa", "ar", "ar", "ar", "ar", "fa", "fa", "ar", "fa", "fa", "ar", "ar", "ar", "fa", "ar", "ar", "ar", "fa", "ar", "ar", "ar", "ar", "fa", "fa", "fa", "fa", "fa", "ar", "fa", "fa", "fa", "fa", "fa", "fa", "fa", "fa", "fa", "None", "None", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]