[{"id": "f175f6a719aa039f2f6ae33e2210066d9a0a0295", "text": "CHEMICAL CONTRIBUTIONS\nTO THE\nGEOLOGY OF CANADA.\nFROM THE\nLABORATORY OF THE SURVEY.\nBY\nCHRISTIAN HOFFMANN, F. Inst. Chem.\nChemist and Mineralogist to the Survey.\n\nPUBLISHED BY AUTHORITY OF PARLIAMENT.\n\nMontreal:\nDAWSON BROTHERS.\n1880\nCHEMICAL CONTRIBUTIONS\nTO THE\nGEOLOGY OF CANADA.\nFROM THE\nLABORATORY OF THE SURVEY.\nBY\nCHRISTIAN HOFFMANN, F. Inst. Chem.\nChemist and Mineralogist to the Survey.\n\nPUBLISHED BY AUTHORITY OF PARLIAMENT.\n\nMontreal:\nDAWSON BROTHERS.\n1880\n\n135759\nA\n\nof\na\nA\nof\nS\nM\nthe\n\nM\nALFRED R. C. SELWYN, Esq., F.R.S., F.G.S.,\nDirector of the Geological Survey of Canada.\n\nSir,—I herewith beg to lay before you the results of the work carried out in the Laboratory of this Survey during the past year. It embraces all such analyses as were considered likely to prove of general interest. As will be seen, attention has been mainly directed to the examination of such minerals, etc., etc., as promised to prove of economic value. Such analyses or assays as have been made by my zealous Assistant, Mr. Frank D. Adams, have in all instances been duly credited to him; those not otherwise designated having been made by myself.\n\nI have the honour to be,\n\nSir,\n\nYour obedient servant,\n\nCHRISTIAN HOFFMANN.\n\nMONTREAL, May 31st, 1880.\nTABLE OF CONTENTS.\n\nMISCELLANEOUS MINERALS.\n\nCyanite from the North Thompson River, British Columbia, analysis of...........................................1\nLazulite from the Churchill River, District of Keewatin, analysis of..................................................2\nGraphite, disseminated, from Inverness County, Nova Scotia, analysis of...........................................2\nGraphite, disseminated, from the \"Split-Rock Plumbago Mine,\" New Brunswick, analysis of.........................3\n———, adaptability of the graphite prepared from this rock for electrotyping and manufacture of lead-pencils....4\nInfusorial earth from King's County, New Brunswick, analysis of.....................................................4\n———, economic uses of.................................................................6\nKaolin, from County of Two Mountains, Quebec, analysis of..........................................................6\nAlunogen from the \"Scotia Mine,\" Cumberland County, Nova Scotia, analysis of..................................8\n\nNATURAL WATERS.\n\nWater of the Assiniboine, analysis of.........................................................10\n——— of the Red River, analysis of.................................................................10\n\nCOALS.—Bituminous coal and Brown coal or Lignite.\n\nFrom Cumberland County, Nova Scotia, analysis of.........................................................11\n——— near Fort McLeod, North West Territory, analysis of.........................................................12\n——— the Skeena River, British Columbia, analysis of.........................................................12\n——— the Watsonquach River, British Columbia, analysis of.........................................................13\n\nIRON ORES.\n\nMagnetite from Queen Charlotte Islands, British Columbia, partial analysis of......................................14\n——— from Pickerel River, Ontario, partial analysis of.........................................................15\n——— from Magnetite Island, Knee Lake, District of Keewatin, partial analysis of..................................15\n——— from County of Halliburton, Ontario, partial analysis of.........................................................15\nBog iron ore from Thurlow, Ontario, estimation of iron in..........................................................15\nCopper Ores.\n\nSpecimen from Spar Island, Lake Superior, estimation of copper in ........................................... 16\n\nSpecimen from Echo Lake, District of Algoma, estimation of copper in ........................................... 16\n\nManganese Ores.\n\nFrom Boularderie Island, Cape Breton, Nova Scotia, partial analysis of ........................................... 17\n\nGold and Silver Assays—\n\nOf specimens from the—\n\nProvince of Nova Scotia ........................................... 17\n\nof New Brunswick ........................................... 18\n\nof Quebec ........................................... 18\n\nof Ontario ........................................... 19\n\nDistrict of Keewatin ........................................... 20\n\nProvince of British Columbia ........................................... 23\n\nMiscellaneous Examinations ........................................... 25\nCHEMICAL CONTRIBUTIONS\nTO THE\nGEOLOGY OF CANADA,\nFROM THE\nLABORATORY OF THE SURVEY.\nBY\nCHRISTIAN HOFFMANN, F. Inst. Chem.\n\nMISCELLANEOUS MINERALS.\n\nCYANITE.\n\nFrom the North Thompson River, British Columbia.—Collected by Alfred R. C. Selwyn, Esq.\n\nThe mineral was imbedded in a granular quartz which, in addition, contained a few scales of a silvery-white mica. It, for the most part, occurred in the form of radiated columnar aggregates, the colour of which was in parts pure blue, passing into greenish-grey; occasionally, but rarely, almost colourless—the other portions were of a uniform light bluish-grey colour. Lustre vitreous. Subtransparent. Specific gravity, 3.6005.\n\nThe material selected for analysis was found, after drying at 100° C., to have the following composition:\n\n| Component     | Percentage |\n|---------------|------------|\n| Silica        | 36.288     |\n| Alumina       | 62.254     |\n| Ferric oxide  | 0.552      |\n| Lime          | 1.064      |\n| Magnesia      | 0.355      |\n\nPrevious to the finding of this specimen, cyanite was not known to occur in Canada.\nLAZULITE.\n\nFound three-quarters of a mile east of the mouth of the Churchill River,—District of Keewatin. Collected by Dr. R. Bell.\n\nOccurs massive in veins, having a maximum width of seven millimetres, traversing a greyish-white, in parts milk-white, subtranslucent quartz. Colour fine deep azure-blue. Lustre vitreous. Fracture uneven. Brittle. Streak white. Subtranslucent. Hardness very nearly but not quite 5.5. Specific gravity—3.0445. Before the blow-pipe colours the flame pale-bluish-green; swells up, whitens and falls to pieces, but does not fuse.\n\nThe material upon which the analysis was conducted, although selected with great care, and apparently pure, was nevertheless found to contain 3.808 per cent. silica; in calculating the results this has been excluded; the composition of the mineral dried at 100° C., then being as follows:\n\n| Substance          | Percentage |\n|--------------------|------------|\n| Phosphoric acid    | 46.388     |\n| Alumina            | 29.140     |\n| Ferrous oxide      | 2.091      |\n| Magnesia           | 13.838     |\n| Lime               | 2.829      |\n| Water              | 6.468      |\n| **Total**          | **100.754**|\n\nThis is the first time that this interesting mineral has been met with in Canada.\n\nGRAPHITE.\n\nIn continuation of Report on Canadian Graphite (Report of Progress 1876-77, p. 489).\n\n1.—DISSEMINATED GRAPHITE.\n\nGraphitic shale.—From Glendale, River Inhabitants, Inverness County Nova Scotia. Collected by Mr. Hugh Fletcher.\n\nColour bluish-grey. Lustre of fracture across the plane of deposition, dull; that of the fracture coincident with the lamination, sub-metallic glistening. The graphite is very evenly disseminated through the rock; it occurs in the form of minute scales of a steel-grey colour and metallic lustre.\n\nThis shale was found to contain:\n\n| Substance         | Percentage |\n|-------------------|------------|\n| Graphite          | 13.965     |\n| Rock matter       | 85.799     |\n| Hygroscopic water | 0.236      |\n| **Total**         | **100**    |\n\nAnalysis of \"disseminated graphite\" from Nova Scotia.\nThe graphite was separated and weighed as such. On igniting the powdered mineral it leaves a light reddish-white coloured residue.\n\n2.—Disseminated Graphite.\n\nIn their report on the geology of southern New Brunswick (Report of Progress 1870-71, p. 230), Messrs. Bailey and Matthew state that graphite or plumbago, in a finely divided state, is not unfrequently disseminated through the more altered rocks of the southern counties of that province, and at a few points is found in beds available for economic purposes. The largest of these are in connection with the rocks of the Laurentian system, in the vicinity of St. John, appearing at the Narrows of St. John River, Lily Lake, and other points. At the old opening at the Falls, known as the \"Split Rock Plumbago Mine,\" the facilities for mining and shipment are all that could be desired. The mineral is extracted chiefly from one principal bed, with lateral deposits of minor importance. The working of the mine would appear to have been very irregular, having been abandoned from time to time; considerable quantities have, however, been taken out since its first opening, notwithstanding which it is stated that there is no diminution of the supply, and that the quality of the mineral is better now than when operations were first commenced.\n\nA specimen of the disseminated graphite from the aforementioned \"Split-Rock Plumbago Mine\" was collected for me by Mr. Wallace Broad for examination; it had a loose shaly structure and readily parted into, although somewhat irregular, yet, more or less lenticular fragments. It was greyish-black in colour, had a submetallic lustre, and gave a black streak. This sample contained a rather large amount of pyrites, and although the greater part of this was confined to some few of the more earthy, and what might justly have been regarded as extraneous fragments, there was, nevertheless, a by no means inappreciable amount pretty evenly diffused through the graphitic rock proper. Specimens of this latter which had undergone lengthened exposure, were much weathered, had a greenish-grey colour and exhibited but a very feeble lustre. In preparing the material for analysis, the earthy fragments above alluded to, and which amounted to about six per cent. of the sample, were excluded.\n\nIt was found to contain:\n\n| Component          | Percentage |\n|--------------------|------------|\n| Graphitic carbon   | 48.775     |\n| Rock matter        | 50.058     |\n| Hygroscopic water  | 1.167      |\n\nAnalysis of \"disseminated graphite\" from New Brunswick\nThe graphitic carbon was separated and weighed as such; it had a greyish-black colour, was devoid of lustre and apparently amorphous; when pressed in a mould the surface of the resulting form had a bright metallic lustre.\n\nThis compressed graphite gave a fairly black and shining streak. The powdered rock leaves on ignition a light brownish-grey coloured residue. Considering the high percentage of graphite contained in this rock, it appeared to me very desirable to ascertain if the dressed graphite prepared from this latter could be used in electrotyping or for the manufacture of black-lead-pencils. It would doubtless be adapted for some of the other purposes for which graphite is employed; it has however, to be borne in mind that, in this instance, the cost of extraction would in all likelihood preclude its advantageous employment for other purposes than those for which a suitable graphite commands a high price. Having extracted a quantity of the graphite and assured myself of its comparative freedom from foreign matter, samples of the same were forwarded to England for the purpose of having it practically tested. The gentlemen to whom it was sent—and who, from their long experience in the employment of graphite, for the purposes above specified, may justly be considered competent authorities—have favoured me with their opinions upon the same, and these may be briefly stated as follows:\n\nIn the one case—that examination has shown the graphite to be of fair quality and adapted for the manufacture of the commoner kinds of lead pencils; although its \"quality and nature\" does not equal, as far as suitability for pencil making is concerned, the graphite obtainable in Bohemia and some other places.\n\nIn the other—and as regards its employment in electrotyping—the trial did not give a very good result; it was not considered so good as that which they were in the habit of using for this purpose.\n\nThe graphite forwarded was under the most favourable conditions, that is to say, it contained only 0.16 per cent. of a light grey-coloured ash, and therefore, as far as purity was concerned, left nothing to be desired. That it should not have proved better adapted for the purposes for which it was specially tried, may be reasonably ascribed to its state of aggregation, and it is, in all probability, this physical character which was intended to be implied by the use of the above quoted words, \"quality and nature.\"\n\nINFUSORIAL EARTH OR EARTHY TRIPOLITE.\n\nThe occurrence of this material in southern New Brunswick has been alluded to under the heading of \"Economic Minerals,\" by the Messrs.\nBailey, Matthew and Ells, in their report (present Report of Progress) on the geology of that region.\n\nThe sample, the results of the examination of which are here given, came from Pollet River Lake, Mechanic Settlement, King's County, New Brunswick, and was collected by Mr. R. W. Ells. It occurs in considerable quantity, the deposit in this lake being, it is stated, about four feet deep, and can be readily obtained, either by dredging or draining the lake. A couple of slides of this material were prepared and placed in the hands of Mr. J. F. Whiteaves for microscopic examination. This gentleman informs me that the deposit would appear to be of fresh-water origin; that it contains siliceous spicules of *Spongilla* in great abundance, also quantities of frustules of diatomaceae, mostly detached, among which he has recognized the following genera, viz: *Pinnularia*, *Surirella*, *Stauroneis* and *Himantidium*.\n\nIn texture it resembled an earthy chalk; very fine grained but harsh to the feel; adheres to the tongue; colour light greyish-white. Heated in the closed tube, assumes a dark-grey colour, due to the separation of carbon, and gives off an abundance of a somewhat ammonical, light brownish-yellow coloured water—the material evidently containing nitrogenous organic matter. After ignition, with free access of air, its colour is reddish-white; if treated with hydrochloric acid previous to ignition, the colour is white or at most has a just perceptible reddish tinge.\n\nWhen digested, either before or after ignition, with a boiling solution of caustic potash or soda, the silica readily passes into solution, leaving a small amount of insoluble residue, which after ignition has a light reddish-brown colour. The insoluble residue readily subsides from the solution, this latter, if the material has been treated before ignition, has a brownish-yellow colour; if after ignition, and consequently when free from organic matter, the solution is colourless.\n\nThis sample had been kept in the dry atmosphere of the laboratory for a lengthened period, and was regarded as perfectly air-dried. At 100° C., the oxygen of the air exercises a modifying influence upon this material, so that, in order to ascertain the correct loss by water at this temperature, it is necessary that the operation should be conducted in an atmosphere of hydrogen or carbonic acid.\nAn analysis of the air-dried material gave the following results:\n\n| Substance          | Percentage |\n|--------------------|------------|\n| Silica             | 80.487     |\n| Alumina            | 3.146      |\n| Ferric oxide       | 0.951      |\n| Lime               | 0.342      |\n| Magnesia           | 0.283      |\n| Carbonic acid      | 0.011      |\n| Phosphoric acid    | ?          |\n| Potash and soda    | ?          |\n| Water—combined and hygroscopic, and organic matter | 13.321 |\n\nTotal: 98.541\n\n1.—Water and organic matter.\n\na. Loss on drying over sulphuric acid: 6.535\nb. Loss (in addition to that of a) on drying at 100° C., in a current of pure and dry hydrogen: 3.582\nc. Loss (in addition to that of a. and b.) on ignition (and after correction for carbonic acid): 3.204\n\nTotal: 13.321\n\nThe air-dried material left, on treatment with a boiling solution of caustic potash, 7.994 per cent. insoluble residue of a light reddish-brown colour (after ignition).\n\nAs regards the economic value of this infusorial earth, it may be said to constitute an excellent polishing material; and although no experiments have been made to determine its absorbent power, it may reasonably be expected to prove well adapted for the preparation of dynamite. Again, the extreme facility with which it is dissolved by caustic alkali (potash or soda), would suggest its advantageous employment for the manufacture of what is commonly known as \"water-glass\" or \"soluble-glass,\" a preparation which meets with many important applications in the arts, as for instance, as a cement for the manufacture of artificial stone; for the hardening and preserving of building stones; in fixing fresco colours by the process of stereo-chromy; as an addition to soap in the preparation of the so-called \"silicated soaps,\" etc.\n\nKAOLIN.\n\nThe material here alluded to occurs on a property belonging to Mr. Paul Trottier, situated in Grand Fronier, County of Two Mountains, Quebec.\n\nThe locality was visited by Mr. James Richardson in July, 1879, with the object of ascertaining its precise mode of occurrence, the probable extent of the deposit, and also for the purpose of procuring a sample for examination and analysis.\nMr. Richardson informs me that it occurs in a dyke of from one to two feet thick, dipping northward at an angle of about 50°, and cutting through flat massive beds of Potsdam sandstone. That at the time of his visit Mr. Trottier had excavated about twenty feet in depth and the same in length, the produce of which appeared to be about two tons. It was stated that at the depth of twenty feet, the thickness appeared to be increasing, inasmuch, however, as there were several feet of water in the excavation, Mr. Richardson had no opportunity of satisfying himself on this point. The sample received was in the form of compact friable masses, with a greasy feel, and fine earthy texture. Colour light brownish-yellow mottled with white. Adheres to the tongue. Forms with water an exceedingly plastic paste.\n\nAfter drying at 100° C., its composition was found to be as follows:\n\n| Component     | Percentage |\n|---------------|------------|\n| Silica        | 32.009     |\n| Alumina       | 29.907     |\n| Ferric oxide  | 14.023     |\n| Chromic oxide | 0.554      |\n| Titanic acid  | 9.558      |\n| Lime          | 0.411      |\n| Magnesia      | 0.247      |\n| Potash        |            |\n| Soda          |            |\n| Water (direct estimation) | 13.005 |\n\nTotal: 99.714\n\nAll the iron has been calculated as ferric oxide, the amount present as ferrous oxide not having been determined.\n\nOn carefully washing a large quantity of this clay, there ultimately remained, mixed with a little of the coarse material, a very small quantity of a heavy black granular powder which, upon examination, was found to consist, for the greater part, of chromite; a small quantity of titanic acid was also detected in this powder; it was not, however, satisfactorily determined if this was present in the form of Ilmenite or no.\n\nIn order to test its refractory quality, some of the clay was moulded into the form of miniature bricks, the edges of which were left as sharp as possible; these having been carefully dried, first by exposure to the atmosphere and then to a temperature of 100° C., were subsequently inserted in a covered crucible, and this latter placed in an air-furnace, the temperature of which was gradually raised until at the expiration of about an hour, an incipient white heat had been obtained, at which temperature it was maintained for an additional hour. On examining the contents of the crucible after cooling, it was found that the edges of the bricks remained perfectly intact, showing\nno indication even of incipient fusion. The bricks which, at the time of their insertion, were light brownish-yellow, had now assumed, externally a purplish-brown, and internally a blackish-brown colour. They were sonorous and exceedingly hard and tough.\n\nALUNOGEN.\n\nCollected by Mr. Scott Barlow from an old heap of shale at the \"Scotia Mine,\" Springhill coal field, Cumberland County, Nova Scotia.\n\nAnalyzed by Mr. Frank D. Adams.\n\nThis specimen was in the form of a crust of from five to five and a half centimetres thick. Colour white, in some places light yellow. Taste inky-astringent. Melts in its water of crystallization and at a higher temperature gives off sulphuric acid. Soluble in water.\n\nIts analysis gave the following results:\n\n| Substance          | Percentage |\n|--------------------|------------|\n| Sulphuric acid     | 36.935     |\n| Alumina            | 13.479     |\n| Ferric oxide       | 2.888      |\n| Ferrous oxide      | .157       |\n| Lime               | .140       |\n| Magnesia           | .138       |\n| Potash             | .087       |\n| Soda               | .131       |\n| Ammonia (small quantity) | Undet. |\n| Water              | 45.109     |\n| Insoluble matter   | .235       |\n\nNATURAL WATERS.\n\nWATERS OF THE ASSINIBOINE AND RED RIVERS.\n\nGeological character of the areas drained by these rivers.—The following information in connection with this subject has, at my request, been kindly furnished me by Dr. G. M. Dawson.\n\n\"The Red River, flowing from south to north, runs probably for its whole length over deposits of late date. These are, either the fine silty materials laid down in the bed of the southward extension of Lake Winnipeg, which previously occupied the valley; or clays and sandy clays due to the glacial period. Long and important streams, however, join the Red River, both from the east and west, and the character of the river water is doubtless due to the nature of the country occupied by the springs and sources of these, rather than to\nthe composition of the bed of the main stream, with which the waters passing rapidly and in large volume cannot come very often or intimately in contact. Probably more than half of the water of this river is derived from the Rat, Roseau and Red Lake Rivers and other streams flowing from the wooded and marshy country to the east, and this it may be supposed does not differ much from that found in the rivers flowing from woodland country in eastern Canada. This country is also covered with drift deposits of glacial and post-glacial age, and the streams seldom or never flow over solid rock. The tributaries from the west, including the Shayenne, the Pembina and numerous smaller rivers, are from a region which may be regarded as almost altogether open prairie, and is subject to a rainfall considerably less in amount than that in the east. These streams flow in part over glacial and post-glacial deposits, but in part also over the underlying Cretaceous rocks, of which the shales and clays of the Fort Pierre group cover the most extensive area. Springs, the waters of which come in contact with the Cretaceous rocks also, doubtless feed the tributaries. The Cretaceous shales contain a considerable proportion of disseminated pyrites, which latter when exposed to atmospheric influences undergoes decomposition, ultimately giving rise, in the presence of the calcium carbonate contained in the rocks, to the formation of gypsum, with which mineral—generally in the crystalline form of selenite—many of the beds are in consequence charged. There are also on this side of the Red River, several springs impregnated with common salt; these resemble those of the Manitoba Lake district, and are probably like them derived from the underlying Devonian rocks. Springs of this character are known on the Salt River, south of the Pembina, and it was previously attempted to utilize these as a source of supply of salt. Similar springs are said also to occur on the Scratching River.\n\nThe country drained by the Assiniboine resembles in most points that described as giving rise to the other western tributaries of Red River. By some of the eastern branches of the upper part of the Assiniboine, from Riding and Duck Mountains, a certain amount of woodland drainage is derived; but by far the greater part of its tributaries bring to it the drainage of prairie land, with a comparatively small rainfall, and in which the saline matters would therefore be supposed to exist in a more concentrated form. Though a comparatively small portion of the total length of the streams can flow in actual contact with the underlying Cretaceous rocks, there is reason to believe that in the prairie region west of the valley of the Red River, a great part of the drainage of the country passes below the drift deposits along the surface of the undelying rocks, and this being brought very inti-\nmately in contact with these rocks would be likely to be influenced by their composition.\"\n\nThese samples of the waters were collected by Mr. A. S. Cochrane,—at the instance of Dr. R. Bell—on the 26th of October, 1879; that of the Assiniboine was taken from the centre of the river, about a quarter of a mile above its junction with the Red River; whilst the water of latter was taken from the centre of the stream, about a quarter of a mile above where the former flows into it.\n\nThe water of the Assiniboine, after filtration, had a faint yellowish tinge. The suspended matter, which had a brownish-grey colour, left on ignition a light reddish-brown coloured residue, this on examination was found to consist of argillaceous matter.\n\nThe water of the Red River, after filtration, had a pale yellowish tinge. The suspended matter was of a light brownish-yellow colour, on ignition it left a residue, which, as in the previous case, consisted of argillaceous matter.\n\nThe nature and amount of the organic matter contained in these waters was not ascertained,—the quantity of water at disposal being altogether inadequate for the purpose,—apart from which, it is highly probable, that, during the interval of collection and analysis, the organic matter had, to some extent at least, undergone decomposition, the amount of carbonic acid therefore, although estimated, has not been given.\n\nThe analyses of these waters were conducted by Mr. Frank D. Adams, and the following are the results obtained by him, expressed in grains per Imperial gallon:\n\n|                | ASSINIBOINE | RED RIVER |\n|----------------|-------------|-----------|\n| Potassa        | 0.499       | 0.549     |\n| Soda           | 5.324       | 5.028     |\n| Lime           | 6.783       | 6.912     |\n| Magnesia       | 4.588       | 5.142     |\n| Alumina and ferric oxide(1) | 0.084 | 0.092     |\n| Silica         | 1.571       | 2.208     |\n| Sulphuric acid | 4.906       | 7.093     |\n| Carbonic acid  | ?           | ?         |\n| Chlorine       | 1.988       | 3.390     |\n| Organic matter | ?           | ?         |\n\nOxygen equivalent to the chlorine 0.448 0.765\n\nTotal dissolved solid matter, dried at 100° C., 41.09 44.63\nMISCELLANEOUS MINERALS.\n\nSuspended matter—\n\n|                | ASSINIBOINE | RED RIVER |\n|----------------|-------------|-----------|\n| Organic        | 0.692       | 0.342     |\n| Mineral        | 4.508       | 3.509     |\n| Total          | 5.200       | 3.851     |\n\nHardness (2)—\n\n|                | ASSINIBOINE | RED RIVER |\n|----------------|-------------|-----------|\n| Temporary      | 13.90       | 16.03     |\n| Permanent      | 6.70        | 7.87      |\n| Total          | 20.60       | 23.90     |\n\nSpecific gravity | 1000.64     | 1000.52   |\n\nThe foregoing acids and bases are most probably combined in the water as follows:\n\n(Carbonates calculated as mono-carbonates and all the salts estimated as anhydrous.)\n\n|                | ASSINIBOINE | RED RIVER |\n|----------------|-------------|-----------|\n| Chloride of sodium | 3.277       | 5.589     |\n| Sulphate of potassa | 0.923       | 1.915     |\n| \" of soda       | 8.216       | 4.727     |\n| \" of lime       |             | 6.739     |\n| Carbonate of lime | 12.112      | 7.388     |\n| \" of magnesia   | 9.635       | 10.798    |\n\n1.—Although here given as ferric oxide, the iron was doubtless present in the water as a ferrous salt.—2. Direct method, Wauklyn and Chapman.\n\nIn the case of the Assiniboine water there was an excess of soda, above that required for the sulphuric acid, amounting to 0.114 grain (equals 0.084 sodium)—this might be present as carbonate: it would require 0.129 chlorine or 0.147 sulphuric acid in excess of the amounts found of these respective constituents. It has been calculated as, and added to the, sulphate of soda.\n\nCOALS.\n\nBITUMINOUS COAL AND BROWN COAL OR LIGNITE.\n\n1.—Bituminous coal.—Sent for examination by Mr. Jas. S. Hickman, of Amherst, Cumberland County, Nova Scotia. Exact locality not known, but said to have been taken from \"a bank on Black River, following the outcrop of a seam of coal in the bank about twelve feet from the surface.\"\n\nThis coal presented a slickensided appearance; it was traversed by occasional thin bright layers, the prevailing lustre was, however, dull and somewhat resinous; fracture irregular. In parts it\ncontained a good deal of iron pyrites, also occasional thin bright laminae of graphitic-looking matter.\n\nThe weight of the sample received was fifty pounds, the whole of this was reduced to powder and intimately mixed, in order to obtain a fair average sample; a portion of this was taken, and afforded by slow and fast coking the following results:\n\n|                  | Slow coking | Fast coking |\n|------------------|-------------|-------------|\n| Hygroscopic water| 3.73        | 3.73        |\n| Volatile combustible matter | 28.01 | 34.33 |\n| Fixed carbon     | 54.28       | 47.96       |\n| Ash              | 13.98       | 13.98       |\n| Coke             | 68.26       | 61.94       |\n| Ratio of volatile combustible matter to fixed carbon | 1 : 1.94 | 1 : 1.40 |\n\nBy rapid heating a bright and tolerably firm coke was obtained. Colour of the ash purplish-grey. This coal very closely resembles a sample of coal brought by Mr. Scott Barlow from the \"Styles Mine.\"\n\n2.—Lignite.—The locality of its occurrence is stated to be thirty miles west of Fort McLeod,—near the base of the Rocky Mountains, four miles south of Pincher Creek, Old Man's River; within a quarter of a mile of an Indian farmer's house,—North West Territory.\n\nColour pure black; structure somewhat lamellar; lustre shining resinous, with occasional dull patches; powder black, the same communicated a deep brownish-red colour to a boiling solution of caustic potash.\n\nAnalysis by slow and fast coking gave:\n\n|                  | Slow coking | Fast coking |\n|------------------|-------------|-------------|\n| Hygroscopic water| 6.26        | 6.26        |\n| Volatile combustible matter | 29.31 | 31.96 |\n| Fixed carbon     | 55.70       | 53.05       |\n| Ash              | 8.73        | 8.73        |\n| Coke             | 100.        | 100.        |\n\nBoth slow and fast coking gave a pulverulent coke. The ash had a pale reddish-brown colour and agglutinated slightly at a bright red heat.\n\n3.—Received through Dr. G. M. Dawson from Charles Horetzky, Esq.,—the specimen was labelled \"Skeena, Station 37, nine miles above the Forks,\"—British Columbia.\nColour black; lustre for the greater part bright, but contained occasional dull layers, consisting apparently of carbonaceous shale. It was rather brittle. Does not soil the fingers. Takes fire in a lamp flame, burning with a bright somewhat smoky flame and evolving an empyreumatic odor: in the closed tube yields water and tarry matter. Colour of powder black with a faint brownish tinge, the same communicated no colouration to a boiling solution of caustic potash.\n\nBy slow and fast coking the following results were obtained:\n\n|                  | Slow coking | Fast coking |\n|------------------|-------------|-------------|\n| Hygroscopic water| 1.05        | 1.05        |\n| Volatile combustible matter | 15.35 | 19.09 |\n| Fixed carbon     | 42.70       | 38.96       |\n| Ash              | 40.90       |             |\n\nRatio of volatile combustible matter to fixed carbon: 1 : 2.78\n\nBy slow coking the under portion of the powder alone was sintered, the middle and upper portions remaining pulverulent. Fast coking gave a firm coke. Ash pale cream-colour.\n\n4.—Received through Dr. G. M. Dawson from Charles Horetzky, Esq.,—the specimen was labelled \"Skeena, Station 65, twenty miles above the Forks,\"—British Columbia.\n\nMade up of alternate dull layers of what appeared to be carbonaceous shale and a bright black coal, occasionally these latter exhibited a conchoidal fracture, but the greater number showed a very distinct columnar structure at right angles to the plane of bedding. It does not soil the fingers. In the closed tube yields water but scarcely any tarry matter, evolves however a faint empyreumatic odour. Colour of the powder black, the same communicated no colour to a boiling solution of caustic potash.\n\nAnalysis by slow and fast coking gave the following results:\n\n|                  | Slow coking | Fast coking |\n|------------------|-------------|-------------|\n| Hygroscopic water| 1.52        | 1.52        |\n| Volatile combustible matter | 7.63 | 7.20 |\n| Fixed carbon     | 45.61       | 46.04       |\n| Ash              | 45.24       | 45.24       |\n\nRatio of volatile combustible matter to fixed carbon: 1 : 5.97\n\nBoth slow and fast coking gave a pulverulent coke. Colour of the ash almost white.\n5.—This specimen of coal was received through Dr. G. M. Dawson from Mr. Hankin, of Skeena Forks, who stated that the locality of its occurrence was about eighteen miles up the Watsonquah River, British Columbia. The sample was a very small one.\n\nVery compact, homogeneous, hard, brittle. Does not soil the fingers. Colour black, but not pure black, having a just perceptible brownish tinge. Lustre dull resinous. Fracture conchoidal. Takes fire in a lamp flame, burning with a bright flame (which, however, soon dies out on removal from the source of heat), emission of smoke and a slight empyreumatic odour. Heated in a covered crucible it produces a very large amount of flame. In the closed tube yields a considerable quantity of tarry product. Its powder did not impart the slightest colouration to a boiling solution of caustic potassa.\n\nAn analysis, by fast coking, gave the following results:\n\n| Component       | Percentage |\n|-----------------|------------|\n| Volatile matter | 40.52      |\n| Fixed carbon    | 57.51      |\n| Ash             | 1.97       |\n\n100.\n\nA determination of the water gave 0.85 per cent., as however, owing to lack of material, no control was made, the amount of this constituent is included in the number indicating volatile matter. Rapid heating gave a firm coke. The ash, which was somewhat bulky, had a light reddish-brown colour and agglutinated slightly at a bright red heat.\n\nThis is an excellent coal and closely resembles a coal of the true Coal measures. Its geological position, according to Dr. G. M. Dawson, is Mesozoic, most probably Cretaceous.\n\nIRON ORES.\n\nNos. 5 and 6 were analysed by Mr. Frank D. Adams.\n\n1.—A magnetic iron ore, from Harriet Harbour, Skineuttle Inlet, Queen Charlotte Islands, British Columbia.\n\nDr. G. M. Dawson, from whom the specimen was received, informs me that this ore there constitutes a very considerable deposit. There were two samples, here designated as A. and B., both from the same locality: A. may be said to represent a pretty fair average of a large bulk of the ore, B. on the other hand must be regarded as a picked specimen.\nMassive, with a structure varying from coarse crystalline to fine crystalline-granular in A.—to fine crystalline-granular, almost compact, in B. The gangue in these specimens consisted almost entirely of quartz and calcite; sample A. containing in addition here and there a little iron-pyrites.\n\nThese specimens were found to contain—\n\n|       | A.                  | B.                  |\n|-------|---------------------|---------------------|\n| Metallic iron | 58-06 per cent. | 69-88 per cent. |\n| Insoluble matter | 8-40 \"           | 1-81 \"             |\n\n2.—A magnetic iron ore, from about ten miles up Oukaosip or Pickerel River, west of Michipicoten, Ontario.\n\nReceived from Dr. R. Bell.\n\nMassive, structure fine-granular. Colour dark steel-grey. Streak black. Lustre metallic, glistening. Fracture uneven. Readily attracted by the magnet. It contained:\n\n|       |                   |\n|-------|-------------------|\n| Metallic iron | 63-81 per cent. |\n| Insoluble matter | 10-82 \"         |\n\n3.—A magnetic iron ore, from Iron or Magnetite Island, at the Narrows of Knee Lake, District of Keewatin.\n\nThe specimen was received from Dr. R. Bell, who states that the deposit is an extensive one.\n\nMassive, structure very fine-granular, almost compact. Laminated. Colour bluish-grey. Lustre dull. On examination was found to contain:\n\n|       |                   |\n|-------|-------------------|\n| Metallic iron | 45-86 per cent. |\n\nThis specimen was perfectly free from titanic acid.\n\n4.—A specimen of bog-iron ore, from lot sixteen or seventeen of the ninth range of Thurlow, Hastings County, Ontario,—sent by Mr. J. Stewart for examination, contained:\n\n|       |                   |\n|-------|-------------------|\n| Metallic iron | 48-52 per cent. |\n\nNo other constituents were determined.\n\n5.—A fine crystalline-granular magnetite, from the fifth lot of the sixth range of the township of Lutterworth, County of Halliburton, Ontario. It contained:\n\n|       |                   |\n|-------|-------------------|\n| Metallic iron | 49-26 per cent. |\n| Insoluble matter | 26-55 \"         |\nThis specimen was examined for titanic acid, and found not to contain any.\n\n6.—From the sixteenth lot of the seventh range of the township of Lutterworth, County of Halliburton, Ontario.\n\nA somewhat fine crystalline-granular magnetite.\n\nThe gangue in this specimen consisted mainly of calcite and a yellowish-brown mica. It was found to contain:\n\nMetallic iron ........................................... 46·50 per cent.\nInsoluble matter ....................................... 20·16 \" \n\nNo titanic could be detected in this specimen.\n\nCOPPER ORES.\n\n1.—From Spar Island, Lake Superior.\n\nThis specimen will be found fully described under Gold and Silver Assays, No. 9. It contained:\n\nCopper .................................................. 38·24 per cent.\n\n2.—From lot A, north side of Echo Lake, District of Algoma.\n\nThe specimen was received from G. F. Austin, Esq., and was taken from a vein twenty-six feet wide. It consisted of copper-pyrites in a gangue of white subtranslucent quartz, and was for the greater part coated with a thin film of hydrated peroxide of iron, which latter mineral also filled the small cavities and numerous delicate fissures occurring in the specimen. In this instance the associated quartz amounted to forty-four per cent. of the sample. It was found to contain:\n\nCopper .................................................. 18·74 per cent.\n\n3.—From Poole's Shaft, Skineuttle Inlet, Queen Charlotte Islands, British Columbia.\n\nCollected by Dr. G. M. Dawson. A very fine granular, almost compact, bluish-black magnetite, carrying a little copper-pyrites; with here and there a slight incrustation of green carbonate of copper and an occasional stain of hydrated peroxide of iron. The sample examined was found to contain 21·82 per cent. of insoluble siliceous matter, and:\n\nCopper .................................................. 1·89 per cent\n\nThis ore was assayed for gold and silver by Mr. Frank D. Adams, but without detecting a trace of either.\nMANGANESE ORES.\n\n1.—From Boularderie Island, Cape Breton, Nova Scotia.\n\nThe sample weighed twenty-five pounds, and was in the form of porous, friable lumps, varying in colour from dark brown to brownish and bluish-black, with occasional patches of reddish-brown.\n\nIn order to prepare a fair average sample for analysis, the whole was reduced to fine powder and then most thoroughly mixed. After drying at 100° C., it was found to contain:\n\n- Peroxide of manganese .................. 11.04 per cent.\n- Sesquioxide of iron ...................... 12.49 \" \n- Insoluble matter ......................... 57.76 \"\n\nIt was also found to contain a very small amount of copper—possibly scarcely amounting to more than a trace—a small amount of nickel, and also some cobalt, the whole amounting to (according to a rough quantitative analysis) about 0.2 to 0.3 per cent., and of which the cobalt is the chief constituent.\n\nGOLD AND SILVER ASSAYS.\n\nPROVINCE OF NOVA SCOTIA.\n\nAssays Nos. 1 and 2 were conducted by Mr. Frank D. Adams.\n\n1.—From the so-called copper mine, Coxheath Hills, Cape Breton.\n\nReceived through Mr. Hugh Fletcher from Mr. J. E. Burchell.\n\nA fine crystalline mispickel, of a light steel-grey colour. The specimen weighed not quite one and three-quarter ounce. It was found to contain:\n\n- Gold ................ Distinct traces.\n- Silver ............... 1.252 ounces to the ton of 2,000 lbs.\n\n2.—From * * * (Exact locality not stated.)\n\nExamined for Mr. W. H. Weeks of Dartmouth.\n\nIt consisted of a somewhat coarse crystalline galena (in parts coated with carbonate of lead), associated with calcite. It was found to contain:\n\n- Lead .................. 61.54 per cent.\n- Silver ............... 1.458 ounces to the ton of 2,000 lbs.\n- Gold ................ Mere traces.\nPROVINCE OF NEW BRUNSWICK.\n\nAssays Nos. 4 and 5 were conducted by Mr. Frank D. Adams.\n\n3.—From Wanamakei, Hammond River, King's County.\n\nA somewhat coarse crystalline galenite, associated with a small quantity of copper-pyrites, in a gangue of white translucent quartz; the latter, in this instance, amounted to seventy-nine per cent. by weight of the specimen. It was found to contain:\n\nSilver ................. 3.099 ounces to the ton of 2,000 lbs.\n\n4.—From Middle Landing Falls, Nepisiguit River.\n\nThis specimen, which was collected by Mr. R. W. Ells, consisted of a white translucent quartz, holding a large proportion of pyrite. Weight of specimen not quite one and a half ounce. It contained:\n\nNo gold or silver.\n\n5.—From the northern part of York County, on the eastern side of the St. John River.\n\nReceived through Mr. Wallace Broad, from Mr. Edward Jack of Fredericton.\n\nGalena, associated with calcite and a little quartz. It was found to contain:\n\nSilver ................. 1.893 ounces to the ton of 2,000 lbs.\n\nPROVINCE OF QUEBEC.\n\nAssays Nos. 7 and 8 were conducted by Mr. Frank D. Adams.\n\n6.—From Gilbert River, County of Beauce.\n\nThis specimen was sent for examination by Mr. Louis Gendreau. It consisted of a white subtranslucent quartz, more or less stained with oxide of iron and contained a small quantity of pyrite.\n\nIt contained neither gold nor silver.\n\n7.—From the seventy-fifth lot of the first range, N. E. Chaudière, County of Beauce, District of St. Francis.\n\nA white subtranslucent quartz, associated with some greyish-black chloritic matter and containing here and there a few specks of iron pyrites. The sample weighed close upon four and a half pounds; the whole was reduced to fine powder and most thoroughly mixed, in order to ensure a fair average sample for assay. It was found to contain:\n\nNeither gold nor silver.\n8.—From the township of Wakefield, Ottawa County.\n\nReceived through Mr. H. G. Venner, from Mr. A. Cates, of Pêche village.\n\nA white—with occasionally a bluish or greyish tinge—transparent quartz, traversed by small veins of a light green-coloured apatite, and in parts coated with hydrated peroxide of iron. Native gold was readily discernible, it occurred sometimes in the quartz, and at other times in the oxide of iron or else at the junction of the two. The sample weighed very little more than an ounce. It was found to contain:\n\nGold.................. 11.725 ounces to the ton of 2,000 lbs.\nSilver................ 52.323 \" \" \" \"\n\nPROVINCE OF ONTARIO.\n\nAssay No. 13 was conducted by Mr. Frank D. Adams.\n\n9.—From Spar Island, Lake Superior.\n\nThe specimen, a single fragment, weighed twelve ounces. It consisted of copper-glance in a gangue of quartz and calcite; the surface was to some extent coated with a thin incrustation of green carbonate of copper, also in parts with a slight deposit, oftentimes scarcely amounting to more than a film, of peach-blossom-red arseniate of cobalt. This specimen contained a little native silver. It contained:\n\nGold.................. None.\nSilver................ 41.329 ounces to the ton of 2,000 lbs.\n\nThe amount of copper in this specimen was also estimated; the results of the determination will be found given under Copper Ores, No. 1.\n\n10.—From Spar Island, Lake Superior.\n\nThe specimen, a single fragment, weighed about nine and a quarter ounces. It consisted of a coarsely crystalline calcite, associated with a little quartz, and contained a small quantity of copper-glance and some native silver. It was found to contain:\n\nGold.................. None.\nSilver................ 136.967 ounces to the ton of 2,000 lbs.\n\n11.—From Spar Island, Lake Superior.\n\nThis specimen, a single fragment, weighed about one and a half ounce. It consisted of copper-glance in a gangue of coarsely\ncrystalline calcite, the latter preponderating; it contained some native silver. Assay gave:\n\nGold .................. None.\nSilver ............... 108.733 ounces to the ton of 2,000 lbs.\n\n12.—From Spar Island, Lake Superior.\n\nThe specimen, a single fragment, weighed about three and three-quarter ounces. It consisted of coarsely crystalline calcite, associated with quartz and holding a very small quantity of copper-glanche and a little native silver. It contained:\n\nGold .................. None.\nSilver ............... 6.358 ounces to the ton of 2,000 lbs.\n\n13.—From lot eleven, township of McIntyre, between the Duncan Mine and Current River, Thunder Bay, Lake Superior.\n\nReceived through Dr. R. Bell from J. Dewé, Esq.\n\nA coarsely crystalline, white, transparent calcite, with a considerable quantity of blende, a little galena and copper pyrites, some dark greenish-black chloritic matter and some quartz. It contained only:\n\nSilver .................. Traces.\n\nDISTRICT OF KEEWATIN.\n\nAll the specimens from this district were received from Dr. R. Bell.\n\nAssays Nos. 14 to 33 inclusive were conducted by Mr. Frank D. Adams.\n\n14.—From one of a number of veins found about three miles from the south-west extremity of Long Island, east coast of Hudson's Bay.\n\nWhite translucent vitreous quartz, with light brownish-pink tourmaline and a dark-green massive chloritic mineral; in parts slightly stained with oxide of iron. Weight of specimen, five and three-quarter ounces.\n\nIt contained neither gold nor silver.\n\n15.—From Lake of the Woods, twenty-five miles south-west of Rat Portage.\n\nPresented to Dr. Bell by Inspecting Chief Factor McTavish.\n\nMassive, fine crystalline iron-pyrites, with a little hydrated oxide of iron. Weight of specimen, eleven and a quarter ounces.\n\nIt contained neither gold nor silver.\n\n16.—Found six miles north of Richmond Gulf.\n\nWhitish translucent quartz and pyrite, the latter much\nweathered; the pyrite constituted over half the bulk of the specimen. The latter weighed nearly one pound.\n\nIt contained neither gold nor silver.\n\n17.—From an island in Black Whale Harbour, locally better known as Teska Harbour. Taken from one of a group of veins.\n\nBluish-grey indurated limestone holding iron-pyrites. The specimen weighed ten and a quarter ounces.\n\nIt contained neither gold nor silver.\n\n18.—From the location of Mr. W. Harris, Falcon Lake, near Lake of the Woods.\n\nA somewhat rusty granular quartzite with a little molybdenite. Weight of specimen nearly nine ounces.\n\nIt contained neither gold nor silver.\n\n19.—From Fire-steel Rapid, which is twenty-three miles above the Long Portage on the Mattagami River.\n\nConsisted mainly of a fine crystalline pyrite and quartz; much stained on the surface by oxide of iron. Weight of specimen not quite one and a quarter pound.\n\nIt contained neither gold nor silver.\n\n20.—Taken from a vein found at God's Lake.\n\nSubtranslucent quartz tinged with oxide of iron and holding a little pyrite. Weight of specimen, thirteen and a half ounces.\n\nIt contained neither gold nor silver.\n\n21.—Also from a vein found at God's Lake.\n\nGreenish and light brownish quartz with a few specks of copper-pyrites. Weight of specimen, not quite six ounces.\n\nIt contained neither gold nor silver.\n\n22.—Taken from a vein found at Island Lake.\n\nSubtranslucent greyish quartz, with a greyish-green chloritic mineral. Weight of specimen, four ounces.\n\nIt contained neither gold nor silver.\n\n23.—Churchill, one mile west of New Fort. Taken from a vein about two feet wide.\n\nA whitish and light grey subtranslucent quartz. Weight of specimen, not quite five ounces.\n\nIt contained neither gold nor silver.\n24.—Churchill, half a mile north of the New Fort. From a vein varying in thickness from one to three feet.\n\nFaint greyish-white subtranslucent quartz, with some light green chloritic mineral and a little specular iron. Weight of specimen, seventeen ounces.\n\nIt contained neither gold nor silver.\n\n25.—From a vein three and a half miles east of the mouth of the Churchill River. The vein is about three feet wide and can be traced for several hundred yards east and west.\n\nReddish and light brownish-grey subtranslucent quartz, with a very small quantity of pyrite and specular iron. Weight of specimen, not quite eight ounces.\n\nIt contained neither gold nor silver.\n\n26.—From a vein about five miles due east of the mouth of the Churchill River. The vein was stated to be large and somewhat irregular.\n\nA subtranslucent greyish quartz with a little specular iron. Weight of specimen, not quite six ounces.\n\nIt contained neither silver nor gold.\n\n27.—From what was stated to be, a good-sized vein on Eagle Nest Point, about six miles east of the mouth of the Churchill River.\n\nA light grey vitreous quartz. Weight of specimen, rather more than three and a half ounces.\n\nIt contained neither gold nor silver.\n\n28.—From the same locality as the last; stated to have been taken from a good-sized vein.\n\nSubtranslucent greyish quartz, in parts impregnated with finely divided specular iron. Weight of specimen, not quite seven ounces.\n\nIt contained neither gold nor silver.\n\n29.—From a vein on Battery Point, between one and two miles east of the mouth of the Churchill River.\n\nA greyish and whitish subtranslucent quartz. Weight of specimen, rather more than eight and a half ounces.\n\nIt contained neither gold nor silver.\n\n30.—Specimen taken from another vein, same locality as the last.\n\nA greyish opaque quartzite with a little specular iron. Weight of specimen, rather over nine ounces.\n\nIt contained neither gold nor silver.\n31.—From Inari, not far from Marble Island, west coast of Hudson's Bay. Reported by the Esquimaux to occur in large quantity.\n\nFine crystalline iron pyrites in a gangue of light bluish-grey magnesian limestone. Weight of specimen, close on eleven ounces.\n\nIt contained neither gold nor silver.\n\nThis specimen was also examined for copper, nickel and cobalt; it did not contain a trace of either.\n\n32.—From the northern point of a large island in Lake of the Woods, about twelve miles south-east of Rat Portage. Received through Dr. R. Bell from J. Dewé, Esq.\n\nQuartz, penetrated by delicate needles of hornblende, with some greenish chloritic matter and a little calcite. It contained distinctly visible native gold. Weight of specimen, one and a quarter ounce. It was found to contain:\n\nGold................. 37.318 ounces to the ton of 2,000 lbs.\nSilver................ 1.431 \" \" \" \"\n\n33.—From Lake of the Woods; vicinity of Rat Portage. Received through Dr. R. Bell from J. Dewé, Esq.\n\nA somewhat granular, whitish quartzite, rusty on weathered surfaces, carrying a very small quantity of molybdenite, and a little greenish chloritic matter. Assay showed it to contain:\n\nGold................. Traces.\nSilver................ 0.597 ounces to the ton of 2,000 lbs.\n\nPROVINCE OF BRITISH COLUMBIA.\n\nAssays Nos. 37, 38 and 39 were conducted by Mr. Frank D. Adams.\n\n34.—Sent for examination by W. Pollard, Esq., the Secretary of the \"Enterprise\" Gold and Silver Mining Company, Victoria, British Columbia.\n\nA white subtranslucent quartz coated with hydrated peroxide of iron; some of the fragments were very much honeycombed, others contained numerous angular cavities; these latter, in either case, most probably at one time contained iron-pyrites, and which had been removed by weathering; about one-sixth, by weight of the sample of ore, consisted of pulverulent hydrated peroxide of iron; it further contained a little iron-pyrites and galena, and a few fragments of a dark bluish-grey slaty matter.\n\nIt was found to contain:\n\nGold ............... 20-096 ounces to the ton of 2,000 lbs.\nSilver .............. 4-929 \" \" \" \"\nGold and Silver 35.—From the Douglas Portage, British Columbia.\n\nThe sample was taken from a vein occurring at an elevation of about two thousand feet above the sea level, and about nine miles in a north-easterly direction from the hot springs. The vein, which has a width of five and a half feet, is nearly vertical, runs due north, and is distinctly traceable on the surface for over one mile.\n\nA milky-white quartz, associated with a greyish-green chloritic mineral.\n\nIt contained neither gold nor silver.\n\n36.—From the Douglas Portage, British Columbia.\n\nFrom a vein about five hundred feet to the westward of the one from which the preceding sample was taken. It occurs at an altitude of about seventeen hundred feet above the sea level, has a width of two and a half feet at the surface, and runs due north, with a dip of about thirty degrees to the east. The specimen consisted of a white, subtranslucent quartz, in parts stained with oxide of iron and containing a small quantity of a greyish-green chloritic mineral.\n\nIt contained neither gold nor silver.\n\n37.—This specimen, collected by Dr. G. M. Dawson, was taken from the Champion Ledge, near Fort Creek, Omineca.\n\nA white, subtranslucent quartz, with galena, a little pyrite, and a trifling amount of hydrated peroxide of iron—the quartz constituting rather more than half the bulk of the specimen; the latter weighed ten and a half ounces. It was found to contain:\n\nGold ................................ Trace.\nSilver ................................ 19·723 ounces to the ton of 2,000 lbs.\n\n38.—From Gnarled Islands, near Dundas Island, northern part of British Columbian coast.\n\nCollected by Dr. G. M. Dawson.\n\nA light greyish quartz, associated with a light brownish calcite and some dark green chloritic matter, with a little copper-pyrites and green carbonate of copper. Weight of specimen one pound one ounce. It contained:\n\nSilver ................................ Trace.\n\n39.—From the Arctic Circle Claim, Boulder Creek, Omineca.\n\nCollected by Dr. G. M. Dawson.\n\nGalena, associated with a slightly rust-stained, subtranslucent\nquartz; the former contained numerous cavities, holding hydrated gold and silver peroxide of iron. A portion of the galena, carefully freed from the associated quartz and oxide of iron, was found to contain:\n\nGold ...................... None.\nSilver .................... 128-078 ounces to the ton of 2,000 lbs.\n\nIt was considered desirable to ascertain if the associated hydrated peroxide of iron carried any gold. For this purpose, such portions of the galena as were most thickly coated with this oxide were selected; this material was found to contain, in addition to the silver pertaining to the galena, in the sample thus prepared:\n\nGold ................................ Distinct traces.\n\nAnd which had evidently accompanied the peroxide of iron; the above assay of the pure galena having conclusively proven the same to be entirely free from gold.\n\nMISCELLANEOUS EXAMINATIONS.\n\n1.—Mineral specimen sent by Mr. Gisborne, in order that it might be examined for copper. The locality of its occurrence was stated to be the Big Slide, Fraser River, British Columbia.\n\nIt consisted of a mixture, almost in equal proportions, of pyrite and pyrrhotite. It was examined by Mr. Frank D. Adams for copper, nickel and cobalt, and found to contain:\n\nCopper ........................................... 0.097 per cent.\nCobalt (with a little nickel) .................. 0.060 \"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/albertatest_01215.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 51748, "total-output-tokens": 14546, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 234, 2], [234, 234, 3], [234, 476, 4], [476, 500, 5], [500, 1244, 6], [1244, 1244, 7], [1244, 3616, 8], [3616, 4520, 9], [4520, 5606, 10], [5606, 7699, 11], [7699, 10250, 12], [10250, 12866, 13], [12866, 15242, 14], [15242, 17441, 15], [17441, 19941, 16], [19941, 21938, 17], [21938, 24820, 18], [24820, 27023, 19], [27023, 29174, 20], [29174, 31300, 21], [31300, 33532, 22], [33532, 35646, 23], [35646, 37733, 24], [37733, 39716, 25], [39716, 41489, 26], [41489, 43340, 27], [43340, 45269, 28], [45269, 47185, 29], [47185, 48920, 30], [48920, 50846, 31], [50846, 52969, 32], [52969, 55067, 33], [55067, 56433, 34]], "primary_language": ["None", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]