[{"id": "8ac70c64bdc413edcde28635be2dcfb1fd902f82", "text": "The Brandon Mail.\n\nTHURSDAY, DECEMBER 11, 1884.\n\nLEGAL.\n\nD. H. COOPER,\nAttorney, Solicitor, Notary Public, &c., Agents for Provincial Loan and Mortgage Company.\n\nW. A. MACDONALD,\nAttorney, Solicitor, Notary Public.\n\nMONEY TO LOAN.\n(For Imperial Bank, Branch Ave.)\n\nDaly & Coldwell,\nBarristers, Solicitors, Etc.,\nAt 625 Main Ave., Brandon.\nMONEY TO LOAN.\n\nC. A. BERARD,\nEssex, Solicitor for the County Bank.\n\nHENDERSON & HENDERSON,\nSolicitors, Notaries Public, etc.,\nMain Avenue, Brandon.\n\nG. H. MUNROE,\nGeneral Agent for Canadian Groceries, Provisions, Wine, Liquors and Cigars, Brandon.\n\nTHE BRUNSWICK HOTEL,\nP.O. Box 92, Brandon.\nAgents for Imperial Bank, Branch Ave.\n\nDE BONNAR & CO.,\nBankers, Brokers, Agents for Imperial Bank, Branch Ave.\n\nJ. H. BROWNE,\nDominion Land Surveyor.\n\nCITY AND COUNTY ENGINEER,\nBranch Ave., between 7th and 8th Sts., Brandon.\n\nJ. SHORT,\nMerchant Tailor.\n\nCorner 12th St. & Rossiter Ave.\n\nMERCHANTS BANK OF CANADA,\nCapital, $2,500,000.\nHead Office, Montreal.\nPresident — Andrew Allan.\nManager — George Hague.\n\nPORTAGE LA PRAIRIE MARBLE WORKS\nS. RAYNER & Co.\nManufacturers of Marble Headstones, Marble & Granite Monuments.\n\nT. LEE & CO.\nImporters and manufacturers of all kinds of harness leather, trunks, bridles, whips, etc.\n\nBRANDON BRANCH\nC. MERRILL,\nManaging Director.\n\nSATCHELS AND VALISES\nSpecial attention given to repairing trunks.\n\nOXEN AND HORSES' OUTFIT\nTruck loads kept in stock at all times.\n\nSixth Street, near Sommer Ave.\n\nMoney to Loan.\n\nMANITOBA MORTGAGE AND INVESTMENT CO.\nLIMITED,\nCapital, $2,500,000.\nLocal Advisory Board:\nC. F. P. Meade, Manager, Police Headquarters, Main Ave.; W. D. Wilson, Manager, Land Committee, Main Ave.; A. W. Miller, Manager, Land Committee, Main Ave.; W. C. Macdonald, Manager, Land Committee, Main Ave.\n\nNotice to Contractors.\n\nCANADIAN PACIFIC RAILWAY COMPANY.\nNotice to Creditors.\nNotice to Creditors.\n\nHAIR DESTROYER.\nR. F. MILLIGAN,\nChemist, Wine & Spirit Merchant.\n\nNEWBOROUGH,\nVeterinary Surgeon.\n\nPocketbook Lost.\n\nCattle for Sale.\n\nServant Girl Wanted.\n\nThe Weekly Mail.\n\nHEADWAROINE.\n\nA special meeting of the City Council last Friday evening. Ald. Johnson, Backe, Davis, Hughes, Cameron, Adams and Lee were present.\n\nThe special committee for the purpose of raising $300 for the city charter said that Mr. Enfield would take $300 for his scales, in a note of five months, with interest, or he would rent it at $150 a year. Ald. Johnson approved of the parcel of land offered by Mr. Enfield wanted to know the actual value before agreeing.\n\nUncle omnibus.\n\nLast Thursday, Frank Myers, of Portage la Prairie, was playing pool against others in the city hall poolroom. The game was interrupted by a loud noise coming from the city hall poolroom. The noise was caused by the city hall poolroom being crowded with spectators. The spectators were cheering on their favorite player.\n\nLast Saturday night, Frank Myers, of Portage la Prairie, won a game of pool against others in the city hall poolroom. The game was interrupted by a loud noise coming from the city hall poolroom. The noise was caused by the city hall poolroom being crowded with spectators. The spectators were cheering on their favorite player.\n\nAn Excellent Appointment.\n\nThe many friends of Mr. Alex. McKeown will be pleased to learn that Mr. McKeown has been appointed as an employee of the Manitoba Government. Mr. McKeown has been a resident of this country for many years and has always been interested in the welfare of the people. He has been connected with various organizations and has always taken a moderate interest in municipal and general politics. Mr. McKeown's appointment is a well-deserved honor and we have no doubt that he will prove himself a valuable addition to our ranks.\n\nThe Portage has 525 children attending school this fall, 250 more than last year. Of these 460 have attended school during the past year. Mr. Backe said that there was no lack of attendance at the Portage School for the past year.\n\nPortage has 525 children attending school this fall, 250 more than last year. Of these 460 have attended school during the past year. Mr. Backe said that there was no lack of attendance at the Portage School for the past year.\n\nThe Portage has 525 children attending school this fall, 250 more than last year. Of these 460 have attended school during the past year. Mr. Backe said that there was no lack of attendance at the Portage School for the past year.\n\nThe Portage has 525 children attending school this fall, 250 more than last year. Of these 460 have attended school during the past year. Mr. Backe said that there was no lack of attendance at the Portage School for the past year.\nA Maiden Fair.\n\nCHAPTER VI.\n\nA WILD NIGHT.\n\nAlthough the afternoon had ended in summer, the evening changed to winter. Snowy clouds gathered in the sky, and the sun set behind the hills, and crowds gathered in the streets, but only abated during the day. Night came, and the moon rose, but the clouds still lingered above, and the stars twinkled in the sky. The wind howled, and the trees swayed in the gusts. The air was cold, and the people huddled together, seeking shelter from the elements. The weather was harsh, and the people were forced to seek warmth wherever they could find it.\n\nThe next day dawned bright and clear, and the people emerged from their shelters, eager to begin their day's work. The streets were busy, and the shops were bustling with activity. The people were determined to make the most of the day, despite the harsh weather.\n\nThe story continues...\nA REMINISCENCE\n\nof the Assassination of Abraham Lincoln.\n\nThe Martyr's Body Brought\n\nto Brandon by Mr. Hume.\n\nThe Terrible Affair in God's\n\nPresence.\n\n(Washington Star.)\n\nThe President's body was brought to Brandon last night by Mr. Hume, who had been engaged in the service of the late President. The body was placed in a casket and carried to the Brandon Hotel by a party of prominent citizens. The body was then placed in a hearse and driven to the Brandon Cemetery. The body was then placed in a vault and will be interred there.\n\nTHE TORONTO STORE\n\nSELLING OUT.\n\nLEAVING BRANDON.\n\nA GRAND CLEARANCE SALE now going on, and to continue until the whole stock is disposed of.\n\nOver $10,000 worth of Dry Goods, Groceries, Watches, Fans, Hats and Caps, Boots and Shoes, Groceries, etc., will be offered at half price and below cost.\n\nAs an extra bonus, all customers will receive a free gift valued at $50 or more.\n\nOur Whole Stock must go at any price.\n\nHeaps of Dry Goods\n\nTo select from: Large Stock of Pants and Knitted Socks for Women and Men.\n\n30 pieces Dress C-shirts, all sizes and prices.\n\n20 pieces Ladies' Blouses, all sizes and prices.\n\n25 pieces Yarns, all shades and prices.\n\n45 pairs Fine Caps and Mittens, $2.50.\n\nA large assortment of Ladies' Blouses, Gloves, Corsets, Tie Collars, Silk and Cotton Stockings.\n\nAll Wool Blankets, from $1.00 to $5.00.\n\nA large assortment of Ladies' Blouses, Gloves, Corsets, Tie Collars, Silk and Cotton Stockings.\n\nCAR LOADS OF CROCEERIES,\n\n10 lbs. Imitation Sugar, for $1. 10 lbs. Imitation Sugar, for $1. 10 lbs. Imitation Sugar, for $1.\n\nCome early and take advantage of this great sale. You may not have another opportunity for years to come. TERMS CASH.\n\nSUVEREEN & JOHNSTONE.\n\nToronto Store, Cor. 7th St. & Rosser Ave.\n\nN.B.—All accounts due us, if not paid in Ten Days, will be placed in Lawyer's hands for Collection.\n\nJUST RECEIVED AT\n\nWhitehead & Whitelaw's Store\n\nBRANDON.\n\n23 Cases H.I.P.'s Cases and Barrels of Fine China, White and Colored Granite Tea Sets, with a general stock of Delft Crockery and Glassware. Direct importers.\n\n200 Pounds Fine Cream, extra value. 200 Pieces of Shirtsings, Shuttles, Umbrellas, Drills, with an immense stock of General and Staple Dry goods, Hats, Caps, and Clothing.\n\nHalf-Dozen of Chalcedony of Fine Teas, excellently packed, fine flavor and aroma, and sold at reduced prices.\n\nPounds Fresh Turnip Seed, Carrot, Mangold, Onion, Garden and Flower Seeds, of all kinds, fresh and good.\n\n100 Pounds Boots and Shoes, Finest goods, Latest Styles, and Best Value the Market affords.\n\n400 Kgs. Fluid Syrup, 150 Boxes Lard, and\n\n2000 pounds, or two car load of Sugars, all of which are direct importations and Good Value.\n\nWe especially invite Dealers, Hotel Keepers, and others to examine and compare prices.\n\nWe are agents for the Portage Milling Company. A full stock of their Celebrated Flour always kept on hand.\n\nWE SHARPENED TO GIVE CREDIT.\n\nCOME AND SEE.\n\nWHITHEAD AND WHITELAW.\n\nA SURPRISE TO BRANDON!\n\nFall & Winter Goods,\n\nNew Dress Goods,\n\nIn French Cashmere, Costume Meltons, Costume Tweeds and Plaids, Vests Broke, Union Sergees, Brocades, Combination Plaids.\n\nGrey, Colored and Pattern Flannel; extra value.\n\nAlso a full line of Ladies' Mufflers and Ulsters, which you should see before purchasing.\n\nFURS.\n\nLadies' beautiful Astrakhan Jackets, all at very low prices.\n\nLadies' Buffalo Coats and Fur sets, in Seal, Persian and Grey Lamb, Mink, Silver Coney, Otter, English Seal, &c.\n\nMen's and Boys' Fur Coats, Caps, Gauntlets, and Leather Mitts and Gloves.\n\nA large well-assorted Stock of Boots & Shoes, Groceries, Provisions, Crockery, &c.\n\nH. CROSSLLEY, 9th Street.\n\nPerfect Fits.\n\nTHE TORONTO STORE\n\nSELLING OUT.\n\nLEAVING BRANDON.\n\nA GRAND CLEARANCE SALE now going on, and to continue until the whole stock is disposed of.\n\nOver $10,000 worth of Dry Goods, Groceries, Watches, Fans, Hats and Caps, Boots and Shoes, Groceries, etc., will be offered at half price and below cost.\n\nAs an extra bonus, all customers will receive a free gift valued at $50 or more.\n\nOur Whole Stock must go at any price.\n\nHeaps of Dry Goods\n\nTo select from: Large Stock of Pants and Knitted Socks for Women and Men.\n\n30 pieces Dress C-shirts, all sizes and prices.\n\n20 pieces Ladies' Blouses, all sizes and prices.\n\n25 pieces Yarns, all shades and prices.\n\n45 pairs Fine Caps and Mittens, $2.50.\n\nA large assortment of Ladies' Blouses, Gloves, Corsets, Tie Collars, Silk and Cotton Stockings.\n\nAll Wool Blankets, from $1.00 to $5.00.\n\nA large assortment of Ladies' Blouses, Gloves, Corsets, Tie Collars, Silk and Cotton Stockings.\n\nCAR LOADS OF CROCEERIES,\n\n10 lbs. Imitation Sugar, for $1. 10 lbs. Imitation Sugar, for $1. 10 lbs. Imitation Sugar, for $1.\n\nCome early and take advantage of this great sale. You may not have another opportunity for years to come. TERMS CASH.\n\nSUVEREEN & JOHNSTONE.\n\nToronto Store, Cor. 7th St. & Rosser Ave.\n\nN.B.—All accounts due us, if not paid in Ten Days, will be placed in Lawyer's hands for Collection.\n\nJUST RECEIVED AT\n\nWhitehead & Whitelaw's Store\n\nBRANDON.\n\n23 Cases H.I.P.'s Cases and Barrels of Fine China, White and Colored Granite Tea Sets, with a general stock of Delft Crockery and Glassware. Direct importers.\n\n200 Pounds Fine Cream, extra value. 200 Pieces of Shirtsings, Shuttles, Umbrellas, Drills, with an immense stock of General and Staple Dry goods, Hats, Caps, and Clothing.\n\nHalf-Dozen of Chalcedony of Fine Teas, excellently packed, fine flavor and aroma, and sold at reduced prices.\n\nPounds Fresh Turnip Seed, Carrot, Mangold, Onion, Garden and Flower Seeds, of all kinds, fresh and good.\n\n100 Pounds Boots and Shoes, Finest goods, Latest Styles, and Best Value the Market affords.\n\n400 Kgs. Fluid Syrup, 150 Boxes Lard, and\n\n2000 pounds, or two car load of Sugars, all of which are direct importations and Good Value.\n\nWe especially invite Dealers, Hotel Keepers, and others to examine and compare prices.\n\nWe are agents for the Portage Milling Company. A full stock of their Celebrated Flour always kept on hand.\n\nWE SHARPENED TO GIVE CREDIT.\n\nCOME AND SEE.\n\nWHITHEAD AND WHITELAW.\n\nA SURPRISE TO BRANDON!\n\nFall & Winter Goods,\n\nNew Dress Goods,\n\nIn French Cashmere, Costume Meltons, Costume Tweeds and Plaids, Vests Broke, Union Sergees, Brocades, Combination Plaids.\n\nGrey, Colored and Pattern Flannel; extra value.\n\nAlso a full line of Ladies' Mufflers and Ulsters, which you should see before purchasing.\n\nFURS.\n\nLadies' beautiful Astrakhan Jackets, all at very low prices.\n\nLadies' Buffalo Coats and Fur sets, in Seal, Persian and Grey Lamb, Mink, Silver Coney, Otter, English Seal, &c.\n\nMen's and Boys' Fur Coats, Caps, Gauntlets, and Leather Mitts and Gloves.\n\nA large well-assorted Stock of Boots & Shoes, Groceries, Provisions, Crockery, &c.\n\nH. CROSSLLEY, 9th Street.\nTHE BRANDON WEEKLY MAIL\n\nNOTICE\n\nSUBSCRIBERS\n\nACCEPT $5\n\nGIVE A CLEAR RECEIPT\n\nC. CLIFFE\nBRASS KNUCKLES BANDED.\n\nSociety—Gentlemen's Clubs—An Innovation in Finger Wear.\n\nThe New York Journal.\n\nBrass knuckles have been introduced into society as an innovation in finger wear. They are no longer tolerated. At a recent dinner party a gentleman wore them at table. It is a curious thing that they have been in use for a long time past, but nobody twenty years ago thought of wearing them at dinner parties. When they first came into fashion, they were considered unsightly without their aid, and now that they are worn, they are bound to be seen even in the most polished circles. The brass knuckles are made of heavy metal and amount of skill which now characterizes the art of making them. They are not only extremely useful, but also very effective. They are made in various sizes, from the smallest to the largest, and are worn on the fingers. They are made of brass, and are very durable. They are worn on the fingers, and are very effective when used properly.\n\nTHE WALLPAPER EMPORIUM.\n\n48 Cases Latest Designs in Wall Papers\n\nAT PRICES YOU CAN'T BEAT.\n\nSpecial prices for hotels, wholesale and retail.\n\nWM. H. SAUNDERS, 9, MAIN STREET, WINNIPEG.\n\nUxbridge Organs.\n\nFar ahead of all its Competitors.\n\nThe Company having secured some of the finest organs ever made, offers them at prices which will amaze you.\n\nElegant in design, Durable, and complete in all its parts.\n\nFor Terms, Prices or Information, write\n\nMr. C. CLIFFE, Brandon.\n\nUXBRIDGE ORGAN MANUFACTURING CO., UXBRIDGE, ONT.\nAtkinson & Nation,\nDress Goods, Cheviots, Flannel, Velvets in Broadcloth and Plain, Silks, Flannel, Satins, Rib-\nbons, Cambric, Fine and Coarse Muslin, etc., etc.\n\nCHRISTMAS PRESENTS.\n\nREADY-MADE CLOTHING,\n\n100 suits, ranging in price from $25.00 to $40.00, and many elegant shawls, 30 pair T.\nCardigans and Wholesale Pants from $8.00; 10 Bridal and Gown Coats, Ring blankets of Pure Go. wool,\nand other goods.\n\nFull line of Seal, Persian Lamb, Beaver, Astrakhan and other Overcoats.\n\nTo ladies' suits and dresses, cheapest and best in town.\n\nMisses' and children's suits, dresses, caps, bonnets, collars, cuffs, flaps and Harry Slips and\nDrawers, assorted sizes at all the popular selling prices for fine and weather, Overcoats, Moun-\ntain Caps, etc., etc.\n\nFull stock of Ladies' Frills, Pads, Baguettes, etc., for Christmas trade. We are now giving the\nBritish Woolen Mills a chance.\n\nInspection and Comparison Respectfully Solicited.\n\nATKINSON & NATION,\nMolesworth Block,\nCorner Rosser Ave. and Sixth Street,\nBRANDON.\n\nThe Cochrane Manufacturing Co.\nLIMITED.\nCAPITAL $250,000.\nMANUFACTURERS OF THE CELEBRATED\nMINNEAPOLIS HARVESTER AND TWINE BINDER,\nThe only Binder using the celebrated PACKER TRIP.\n\nIMITATED BY MANY, EXCELLED BY NONE\n\nAcknowledged by Farmers and Dealers the VICTOR in the Harvest of 1883.\n\nPRAIRIE FRONT CUT MOWE, TIGER HAY RAKE, LAND ROLLERS—2 & 3 DRUMS,\nHOSIER SEEDERS, WAGONS, PLOWS, HARROWS, AMERICAN\nPRAIRIE BOB SLEIGH WITH CAST KNEE.\n\nWe are also the Sole Agents for the Haggart Bros. Manufacturing Co., manufacturers of the world-renowned\nCORNELL ENGINES.\n\nEither Portable or Stationary, wide a Wake Separator for Steam Power.\n\nHead Office at PORTAGE LA PRAIRIE. Agents at all important points in Manitoba and the North West.\n\nSMITH & EVANS, Agents, - 9th Street, BRANDON\n\nTO GET YOUR EYE PERFECTLY FITTED WITH BEST PEBBLE SPECTACLES.\n\nREESOR'S Jewelry Store,\nJust to Hand, another lot of Reliable Gold and Silver WATCHES Solid 18 Karat gold Rings & Fine gold Jewelry.\nAlso SILVERWARE & JET GOODS.\nRepairing a Specialty.\nD.A. REESOR, The Jeweller.\n\nWILSON & CO.\nDEALERS IN Hardware STOVES AND TINWARE.\nCORNER 7th and ROSSER AVENUE.\n\nNOTICE\n\nTO SUBSCRIBERS.\n\nAs we are endeavoring to settle the subscription list of the MAIL promptly as far as possible, so as to enable us to fill all offices promptly, we make the following proposition: From those who took the paper from the First January, 1883, and have paid nothing since, we will\n\nACCEPT $5\n\nAND\n\nGIVE A CLEAR RECEIPT to January, 1886, that is, receipt all arrears, and pay one year in advance.\n\nFrom those who commenced in September, 1883, the first under present manage-\nment, and have since paid nothing, we will\n\nACCEPT $8.50\n\nto fall to January, 1886, that is, receipt all arrears, and pay one year and balance of this in advance, and from those who paid the present proposition last year, and whose term has not expired some weeks hence, we will accept $2, and receipt until January, 1886. To those who paid two or three years in advance, and have never been late in paying their paper, and who have been subscribers of the First of the Provinces, and very worthy of the patronage of all independent-minded people, we will accept $1.50, and receipt until January, 1886. In addition, however, all uncollected subscriptions at that time will be placed on our subscriber's hands, and they will be charged at the rate of $1.50 per month, payable, etc., etc., every month, and we have no reason why we should be asked to give a year credit or more. These terms will be strictly enforced.\n\nC. CLIFFE.\nPublisher\nTHE BRANDON WEEKLY MAIL\n\nROYAL STAGE ROUTE,\nBRANDON, RINOTA AND ARTLERS.\n\nMcCALL'S LARDINE\nIMPORTERS\nGeneral Merchants\nReady-Made Clothing, Boots and Shoes,\nCarpets, Hardware, Brushes\nCrockery - Groceries, Provisions, Dry Goods.\nSTORRS\nCor. Tenth Street & Pacific Avenue.\nBRANDON, MAN.\n\nJOHN DICKINSON\nDEALER IN\nGROCERIES,\nDRY GOODS,\nBoots and Shoes, etc.\nCorner Ninth St. and Rosser Avenue.\nBRANDON, MANITOBA\n\nP A I S L E Y\n\nSPECIAL NOTICE:\nSamples and Prices mailed to parties at a distance desired.\nEggs and butter taken in exchange for Good\n\nW. F. WILSON,\nSTILL TO THE FRONT\nIN THE\nFurniture Business,\nCorner Rosser Avenue and 6th Street\nGoods Sold on Monthly Payments\n\nImported Goods\nBoots & Shoes\nZINK BROS.,\nNew City Bakery\nMr. BASENACH\n17 LOAVES FOR $1.\nA New Broom Sweeps Clean\n\nNotice.\nNotice is hereby given that the Corporation of the City of Brandon will hold an election on the 25th day of November next, for the purpose of electing a Mayor and Aldermen. The polls will be opened at 9 o'clock A.M., and will close at 8 o'clock P.M. All citizens who are entitled to vote are respectfully requested to attend.\n\nCivic Election.\n\nTo the Citizens of the City of Brandon:\n\nGentlemen:\n\nI have the honor to inform you that the Honorable Mr. Smith has been appointed by the Board of Trade to take charge of the affairs of the City of Brandon. He will be responsible for the management of all matters pertaining to the City, and will be expected to give his utmost attention and best efforts to the welfare of the citizens.\n\nI have the honor to be,\n\nYour obedient servant,\n\nA. M. STEPHENSON\n\nMAYWOOD'S TRANSFER CO.\nFreight & Baggage\nOffice: CORNER OF STREET AND ROSSER AVE.\n\nHELLOYAR BROS.,\nFIRE, LIFE AND MARINE INSURANCE AGENTS.\nCUSTOMS BROKERS,\nMoney to Loan\nOffice: ROSSER AVE.,\nNear 6th Street\nW.H. BELTAR.\n\nNew City Bakery\nMr. BASENACH\n17 LOAVES FOR $1.\nA New Broom Sweeps Clean\n\nImported Goods\nBoots & Shoes\nZINK BROS.,\nNew City Bakery\nMr. BASENACH\n17 LOAVES FOR $1.\nA New Broom Sweeps Clean\n\nImported Goods\nBoots & Shoes\nZINK BROS.,\nNew City Bakery\nMr. BASENACH\n17 LOAVES FOR $1.\nA New Broom Sweeps Clean\n**D. A. REESOR'S JEWELRY STORE**\n\n**IS**\n\n**SANTA CLAUS'**\n\nHeadquarters for Christmas Goods in Watches, Clocks, Jewelry, Silverware, Novelties, etc. All are invited to call and examine our elegant display of rich, new designs, and none need feel any obligation to purchase unless so disposed. Drop in and you'll feel paid.\n\n**Sign of the Horseshoe**\n\n**D. A. REESOR,**\n\nPractical Watchmaker and Jeweler.\n\n---\n\n**MORE CONGRATULATIONS**\n\nAn informal meeting of the Brandon Conservative Association following the election, which springs for itself, was unanimously addressed by Mr. Alexander E. F. Burt, seconded by Mr. Spence, that this successful meeting, surpassing all expectations regarding the question at hand, will be held at the home of Mr. John A. Macdonald, commemorating the fact that, in view of the advantages of political life, it is the duty of every man who has an interest in the City and County of Brandon, by grasping this opportunity to elect a friend, and thus assuring a true friend to represent them at every calling.\n\nIt is therefore resolved that the Brandon Conservative Association hereby appoint a delegate to attend at the detention to be held next week at the home of Mr. John A. Macdonald, at the City of Brandon, for the purpose of forming a club eighteenth of December instant.\n\nAfter this resolution had been read by Hon. D. M. Wainwright, it was moved by Mr. Smith and seconded by Mr. John A. Macdonald, that this Club should be known by the name of the Conservative Association of the County and City of Brandon, and that a calling card be sent to every house in the City and County to be delivered at the office of the Tory. This motion was carried by unanimous vote.\n\nThis will be a great carnival of an eco-patriotic nature, and the most enthusiastic spirit will be manifested by those present.\n\nIt was further resolved that the Club should raise enough money to purchase a band, as the Union Band is doing, and that they should be able to make an arrangement with Bertoni to supply them with a band, at a cost of five cents per member each year.\n\nThat these resolutions be acted upon forthwith.\n\n---\n\n**ANTI-FAT**\n\nAlderman McCollins this week returned from his southern tour, visiting New Orleans and many other points east and south. Mr. Adams has made a profitable trip, to say the least, bringing back some excellent bargains for his paper.\n\n---\n\n**MARKET REPORT**\n\nThe market has been unusually quiet, and there has been a dearth of transactions. The market will be inactive until the fall prices come into vogue. The market for poultry is decreasing, although prices are still quite high.\n\n---\n\n**TOWN TOPICS**\n\nThe Fire Department is now in the hands of the newly appointed Fire Chief, Mr. James Murray. Under his leadership, the department has been strengthened and improved.\n\nThe Brandon Orchestra will give its annual concert on Christmas Eve, with special works by Beethoven and Mozart.\n\n---\n\n**MAJOR EVENTS**\n\nMajor Douglas and Lieutenant Burrows departed last Monday on a trip through the West. They will stop in Regina for a few days before returning to Brandon.\n\nThe Brandon Council will hold a full council meeting on Wednesday evening, with the Mayor presiding.\n\nMajor Burrows met with Premier Medawar on the Prairies earlier this month, discussing matters of mutual concern.\n\n---\n\n**LOCAL NEWS**\n\nThe Brandon Press Club has announced plans to hold its annual banquet on New Year's Eve. The evening will feature music, speeches, and refreshments.\n\nThe Brandon Ladies' Aid Society has initiated a fund-raising campaign to help support the local orphanage.\n\n---\n\n**PERSONAL NEWS**\n\nJames Smart has begun a leave of absence to spend the holiday season with his family in the southwest. He will return early in January.\n\nThe Moose Club is preparing for its annual ball, scheduled for this weekend. Tickets are available at the Moose Hall.\n\nJudge Walker will have invited guests stay at the Brandon Inn for the upcoming week-end. The Inn will also host a large film marathon featuring classic movies.\n\n---\n\n**ADDITIONAL CONTENT**\n\nThe Brandon Weekly Mail is a weekly newspaper serving the Brandon, Manitoba community. It covers local news, events, and Announcements.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/BRM_1884121101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11210, "total-output-tokens": 6440, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4671, 1], [4671, 5550, 2], [5550, 12379, 3], [12379, 12468, 4], [12468, 13967, 5], [13967, 17560, 6], [17560, 19677, 7], [19677, 23894, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]