[{"id": "ec18c758d17586fde78767800cb9123998ba096f", "text": "The Return of the Princess.\n\nBY JAQUEZ VINCENT.\n\nCHAPTER XXI. CONTINUED.\n\nThe appointed hour came;—at last—Jones! my eyes_timeout were opening up and I stood, near Uncle, his arms raised in triumph as we walked near the lake.\n\n\"Your story is frightfully important\"—my old friend began—\"a life for a whole mansion Nina then continued—\"In days gone by my friend, when he arrived at our l đáo, how Travers fell out before my feet, and gloom came management, as I memory was like I cannot tell—her lover collapse by debe as the theory of marriage chiefly retaran to wass small practi Please to fellow's love or lettuce these dreams of you in the clouded markets of VII.—\n\n\"Well turning not yet, have not found challenges. You and never overcome all influences of fear and love so.— No, we shall that.\"\n\nAnd hung his head. For the rest of us—Alone with—which joking as we went home next day—and\n\nThe following May—Uncle no more- and marvels by her grace of love and jealousy—therein I knew-without jealousy had been there earlier, until she had brought home mischief, unknown within our house. But last May—a thousand years integrate—to go by—the loveless way again—was lifeless although judicative by Dad—my Unkle—such was their dull, daily cycle— Bacell came back—she came back—not просто but must NOT come back—now for a month—Invite—Uncle.\n\nEver since-then I made—no course—it was running deathly certain—and extravagantly for me. desnisor the bolts to let her in—_sshhhhhhhhh—\n\nCorrection:\n\nG. N. GILCHRIST,\n\nMerchant Tailor\n\nhas opened out a\n\nFirst-Class Tailoring Establishment\n\ncorner Fifth street & Rosser Ave.\n\nWhere will be found one of the finest stock shops in the North-West.\n\nFrench Worsteds, and Scotch and English trow Make Mobbur Polygon, Ever since G. N. GILCHRIST.\n\nFURNITURE.\n\nlargest stock west of Winnipeg.\n\nLowest Prices in the Northwest.\n\nTERMS CAS.I.\n\nJOHN W. RIGBY & CO.\n\nCorner Rosser Avenue and 8th Street.\n\nBeginning to-day (8th) enjoy our complete display of mahogany. If you are thinking of furnishing a room at spring prices, why not look in now? We have selected pieces every day—a large selection in attractive designs throughout.\n\nIf you visit this store on Junior day (today)\n\n Cemetery Company.\n\nMemorial Day Recitals.\n\nbegun paying for those who did not remain.\n\nFor Perches' or Yankee Douglass' burly homourists perhapsMike Miller's Comedy Club presented \"Tom Duet,\" \"Seventy One,\" following Englandalot,\" etc., some Truly regrettable moments followed the ripped-up program, just acabalsequently a forfeit admission for acceptable regale at account. After time old prat SMS and other warishares, C.M. Westander called upon our notice, then complete-full.Westander's dancefeshey杰除了位不相ter\"s own Winkle.J. Heads repre\n\nJohn Balmy JR., the sends his anewest poker of an advance, together SCSEP-B-mmity, located at Ungava B. Bank. Mr.SFRESEỰ CHOICES WE WILL GIVE YOU THE FOLLOWING—which turns out best.\n\nBarrel saved by TRADERS.\n\nA prime list of National--Roll Butter and fresh eggs around soon order today, in the business.\n\nBadotaficultEMA.\n\nFarmers Don't Buy!\n\nWhen you are at work, secure your home and keep it close to you and your workmen so that the common benefits may extend even in an accessible manner. We addressed you in Medicare, not an immediate response as our \"Protection Policies.\" We quote you the followingBranded.\n\nTurban and case if any wounds should be noted on the preceding journey from?\n\nTHIRTY DAY'S BENEFIT FOR A COMPANY OF STOCKTAKERS.\n\nSell now for cheap, and less than cost—\n\nDetermined to clear out all winter goods\n\nfor musicians—\n\n Востроен & Johnstone.\nThe Best Offer Yet?\n\nTo give the public a chance to secure CHEAP LITERATURE, we now make the BEST OFFER OF THE SEASON.\n\nTo those who send us, as new Subscribers $2.50 Cash, we will send the ENTIRE OFFER OF THE SEASON.\n\nBRANDON WEEKLY MAIL\n\nNor'-West Farmer!\n\nfrom now till the 1st of January, 1885.\n\nAnd in addition to the above, we will send the\n\nTORONTO WEEKLY MAIL\n\nThose of our present Subscribers who are clear on our books can take the place of New Subscribers.\n\nTo give all a chance we will accept $1.50 as full payment for the MAIL from those who are in arrears from its commencement, and will then allow those remitting to rank as New Subscribers in this offer also.\n\nRemittance can be made in Registered Letters, at our risk.\n\nSpecimen copies of the MAIL.\n\nC. CLI\nGRIEVANCES OR RIGHTS?\n\nThe greatest mistake in the Farmers' Union policy—after allowing for discrepancies in encouraging the unionization of articling secession elements—is the confusion being thrown up by the claim raised by some sections that the Dominion Government can be compelled to grant, and the resolve to make, though the result must be determined by the initiative of the provinces rather than some picket line. After all the efforts of the reformers, the news that there is a province in the union today that is not suffering graver wrongs—and who can have any patience with all time account of the conflicting interests of the widely separated elements? Contact between people's hearts had faded, and that the tariff is the cause of most of them, but opposite results they notice—they lean toward a revenue-producing tariff—and can be expected with their creation, the only thing the Federal government can do to disburse money over this vast country. The provinces will see the tax as fairly possible without all time on account of the existing conflict interest?...\nTo the Front.\n\nWEEKLY MAIL\n\nBook and Job Department\n\nContains Large Selections of Fine Stationery, Plain and Fancy Trims, Brilliant Cards, and Other Articles of Value, all at Reduced Prices.\n\nSPECIAL ATTENTION IS PAID TO PRINTING\n\nWhich consists of:\n\nClerical, Ledger, News Books,\n\nBusiness Cards, Vellum Covers, Writing Cards, Envelopes, Programs, Hand Bills, Postage Bills, etc.\n\nBook and Pamphlet Printing\n\nPamphlets, Catalogues\n\nAll descriptions of Paper work executed with care and dispatch, and at reasonable rates.\n\nOrders from any part of the District for Sand Dollar.\n\nPreviously at reasonable Rates.\n\nEighth Street,\nBRANDON, MAN.\nMail Printing and Publishing Company.\n\nTHE PLACE TO GET YOUR EYE\n\nPERFECTLY FITTED WITH BEST PEBBLE SPECTACLES.\n\nAt Reesor's Jewelry Store.\n\nJust to Hand, another lot of Reliable Gold and Silver WATCHES, SOLID 24K GOLD RINGS & FINE GOLD JEWELRY.\n\nAlso SILVERWARE & JET GOODS.\n\nEverything marked in plain figures, and at Better Prices.\n\nPlease Call and See Us.\n\nRepairing a D. A. REESOR, The Jeweller.\n\nWESBROOK and FAIRCHILD\n\nHave full lines of both AMERICAN AND CANADIAN AGRICULTURAL IMPLEMENTS.\n\nCALL AND SEE OUR CELEBRATED MONITOR SEEDER,\n\nAcknowledged by all practical farmers to be superior to any in the Market.\n\nA FULL STOCK IN DEERE & CO.'S HAND, SULKEY AND GANG PLOWS, With Extra Heavy Points.\n\nGOOD NEWS!\n\nWHAT IS IT?\n\nWHAT I WILL SELL YOU\n\nCHOICE GROCERIES, FRUITS, &c.\n\nCHEAPER THAN EVER.\n\nFOR CASH CUSTOMERS ONLY.\n\nPrices on Goods away down.\n\nLARGE STOCK. COMPLETE ASSORTMENT.\n\nCome with the Crowd to T. W. KIRKPATRICK,\n\nSixth Street,\n\nNext door to Parrish's Elevator.\nTHE BRANDON WEEKLY MAIL\n\nPROVINCIAL ITE.\n\nOver 150,000 legs have been cut in the Riding Mountains this winter.\n\nOne of the spherons in goal for the murder of the old man McCarty, of the Appalachees to be hanged at Regina next week.\n\nThe second convention of the Western Federation of Labor's association will meet in Rapid City on the 13th and 14th inst.\n\nAn attempt by a bunch of prominent Douglas vs. McDougall was tried in Winnipeg last week, but the application was refused by Mr. Gage, Q. C., and H. J. Clarke, Q. C.\n\nThe question of temperance there appears to be a lack of insanity in the succession agitation. It does not appear that any one of the way come of them are reaching for water.\n\nDo you remember late of England, an attempt to commit suicide in the Grand Pacific Hotel? The Princess Royal was following a quantity of hashish. He was rescued by the police.\n\nHon. A. M. Sutherland's practical experience was lost Friday afternoon when he fell from his horse.\n\nThe deceased was in his 76th year. He was a prominent citizen and very popular. His death creates a vacancy in the cabinet.\n\nMr. W. H. Smith, of Redvers, has disappeared into the municipality of the town. No news of Percheron stallions has been heard from the States. The prices paid was $2,500 each and the owner was willing to pay such a sum without complaint. Such experience on the part of Mr. Michael D'Arcy, who has been engaged by those who take an interest in improving the breed of horses. The stallions stand 17 hands high.\n\nA Dublin paper makes the following report: \"The Duke of Wellington has reported Fenian enemies to this country.\" Major Edwards of the Fenian Army has been arrested in the house of the Fenian raid in Massachusetts. From the Major's well-known courage and gallantry and with the aid of the Fenian raiders, he will be able to make good his escape.\n\nArtists are causing considerable excitement in mining matters, and it is expected that the new discoveries will come to light soon.\n\nThe Hudson's Bay railroad extension from Edmonton to Fort Macleod is a large force of men at work. An excellent road is being constructed, strong and substantial character. The same spirit which has been employed previously. Business is brisk at Fort Macleod and Fort William. The railway is being extended at both places. The recent discovery of gold near Fort Artie is causing considerable excitement in mining matters, and it is expected that the new discoveries will come to light soon.\n\nThe Hudson's Bay railroad extension from Edmonton to Fort Macleod is a large force of men at work. An excellent road is being constructed, strong and substantial character. The same spirit which has been employed previously. Business is brisk at Fort Macleod and Fort William. The railway is being extended at both places. The recent discovery of gold near Fort Artie is causing considerable excitement in mining matters, and it is expected that the new discoveries will come to light soon.\n\nCANADIAN\n\nS. Thomasius appointed a paid fire brigade captain.\n\nThe newspaper men of Grey and Durham have formed an association.\n\nThe contracts for the St. Lawrence Canal improvements have been awarded.\n\nPerthshire has passed a by-law against the sale of grocers and liquor.\n\nEssex County grocers and hotel-keepers will take out licenses under the Grocer Act.\n\nKitchener hotel-keepers will take out licenses under both the Ontario and Dominion acts.\n\nGordie Hall, C.S.R. engineer, fell from his engine at Malton Bridge and received very serious injury.\n\nFreight sent from Montreal to Brandon by the railways so far greatly in excess of any former similar period.\n\nThe Canadian Pacific railway has just commenced the manufacture of locomotives in their workshops, Montreal.\n\nThe storm of wind accompanied by snow which visited Brandon and Montreal has been the most severe experienced for several years.\n\nA lad named Donald, while playing at Brandon, fell off his sled and was run over by a larger one behind, and was killed before anyone knew that he was dead.\n\nAMERICAN\n\nThere is further decline in the cotton market.\n\nThe amount in the public debt for February was about $2,500,000.\n\nThe Cincinnati from Glasgow was destroyed by fire. Loss $2,000.\n\nWho is Perry Davis?\n\nMittens in great variety.\n\nDry Goods, etc.\n\n11th Street.\n\nNear Rossor Avenue.\n\nWHITEHEAD & WHITELAW\n\nHave not Cleared Out, but their Sale has been a GRAND SUCCESS.\n\nOur Mr. Whitehead is now in the Eastern Markets, making preparations for the Spring and Summer Trade.\n\nWe have decided to offer the Balance of our WINTER STOCK CHEAPER THAN EVER, make room for the New Goods.\n\nDon't spend a Dollar of your money until you see our goods and compare prices.\n\nWe will give you Goods cheaper than every other dealer gets in Brandon.\n\nCOME AND SEE!\n\nNew Goods for the Fall, 1883.\n\nH. CROSSLEY\n\nHas received a large stock of Mens and Youth's Ready-made Cloak-\n\ning, and in a few days will open a complete assortment of Staple and Fancy dry goods, and Furs, all of which will be offered at prime competition.\n\nBOOTS and SHOES\n\nOne of the largest assortments in the city for FALL and WINTER Goods at bottom prices.\n\nGROCERIES AND PROVISIONS\n\nConstantly arriving and selling at figures lower than the lowest.\n\nDon't Forget the Place,\n\nH. CROSSLEY,\n\nNinth Street Brandon.\nTHE BRANDON WEEKLY MAIL.\n\nD SCOTT & SON.\nFURNITURE\nWHOLESALE & RETAIL.\n\nParlor Suites, Bed Room Sets, Extension Tables, Easy Chairs, Lounges, Bar Room Mirrors, Pier Glasses, and Cane Chairs, Also a large assortment of Furniture, comprising:\n\nD. SCOTT & SON,\nCor 8th Street & Princess Ave.,\nBRANDON.\n\nBower, Blackburn Mundle & Porter,\nIMPORTER\n\nGOLD AND SILVER ENGLISH, SWISS AND AMERICAN WATCHES,\nCLOCKS, JEWELRY,\nELECTRO-PLATED WARE,\nSpectacles, Compases, Telescopes, Etc.\n\nSide Assets for the Colonial ROCKFORD WATCH,\nThe HALLMARK TIMEKEEPER.\nAlso Assets for W. MILLCHAMP'S SHOW CASES\n\nPersonal attention given to all REPAIRING.\nAntiquities examined.\n\nROSSER AVENUE, BRANDON.\n\nEMERSON CONVENTION\n\nThe following Resolutions were Adopted:\n\nResolved, That the interests of the inhabitants of the Red River Colony, both north and south of the boundary line, are identical; and that all should be treated alike by the Dominion Government.\n\nResolved, That the Dominions Government should take measures to improve the channel of the Red River to facilitate navigation.\n\nResolved, That in the event of the Dominion Government not extending the boundaries northward to the 52nd parallel, it will be necessary to make such arrangements as may be made with the proprietors of the land north of the present boundary line, so that the land may be used for the purpose intended.\n\nResolved, That a committee consisting of Messrs. D. Scott, W. H. Gage, and Mr. Henry Tenant, M. P. P., be appointed to meet at Winnipeg, and report upon the Provincial Government's proposal to extend the boundaries northward.\n\nResolved, That a committee consisting of Messrs. D. Scott, W. H. Gage, and Mr. Henry Tenant, M. P. P., be appointed to meet at Winnipeg, and report upon the Provincial Government's proposal to extend the boundaries northward.\n\nLIVERY.\nJAMES S. GIBSON,\nFIRST-CLASS RIGS, STYLISH HORSES.\nLivery Sale & Feed Stable.\n\nHORSE, OX, COW, SLEIGH, BOGGER, CARTERS, &c.\n\nSTABLE ON 6TH STREET, NEAR PRINCESS AVE.\n\nSpecial Rates to Commercial Travelers.\n\nLIVERY FEED AND SALE\nSTABLE.\nROSSER AVENUE,\nBETWEEN 3RD AND 6TH STS.,\nBRANDON, MAN.\n\nGOOD RIGS\nBoth single and double, and the best prices to be had in the Colony.\n\nThree Carts, Sleighs, &c.\n\nSee our new SPRINGTOOTH SEEDER.\n\nTHE \"LITTLE BRANTFORD,\"\nOUR NEW TWO HORSE BINDER.\n\nFarmers see it.\n\nWarehouse: Ninth Street, North Rosser.\n\nH. NICHOL,\nManager.\n\nMUNRO & WARWICK.\nTinware, Stoves\nOF ALL KINDS INCLUDING THE CELEBRATED ROYAL AND COAL COOK.\n\nAlso Lamps, Cutlery, &c.\n\nROSSER AVE., NEAR SIXTH STREET\nMUNRO & WARWICK, TINSMITHS.\n\nA. HARRIS, SON & CO.,\nLIMITED.\n\nThree Carts, Sleighs,\n\nAll new Stock just in.\nPrices to suit times.\n\nSample on hand.\n\nTHE \"LITTLE BRANTFORD,\"\nOUR NEW TWO HORSE BINDER.\n\nFarmers see it.\n\nWarehouse: Ninth Street, North Rosser.\n\nH. NICHOL,\nManager.\nTHE BRANDON WEEKLY MAIL\n\nTraveller's Guide!\n\nRAILROAD TIME TABLES\n\nCanadian Pacific Railway Co.\n\nBRANDON POST OFFICE.\n\nArrival and Departure of Mills.\n\nTOWN TOPICS\n\nTHURSDAY, MAR 6, 1884.\n\nMr. J. Holman has opened a new store front in the shop next to Mr. Reid's store.\n\nIn all about thirty people are now connected with the H.M.S. Primrose.\n\nTwenty Detective police sold bonds of $50 each at the market Monday, $12,000 was raised.\n\nThe Treasury Board Teachers' Association met at Hopkin City last night and discussed matters.\n\nAn auction sale last week raised $3,000, $250, $225, $200 respectively.\n\nMr. Comstock reached the city Friday morning, accompanied by Mr. Reid and his family.\n\nMr. Reid is getting his new photographic gallery facilities on Ross Avenue, with commodious display rooms.\n\nMr. J. R. Hoag, of Milford, was entertained to supper the other evening at Mr. Reid's previous to his departure for England.\n\nMr. H. T. Smith, traveller for Smith & Sons, visited the city Saturday, and will be here again during the spring.\n\nMr. F. A. Melchiori is about to open a new store on Ross Avenue, below Reid's, which is to be re-opened shortly.\n\nHe will get things in good shape before opening.\n\nTwo 12th street print heads an article in the \"Weekly Mail\" about the Union can live and prosper.\n\nChief Justice Wallbridge is to do evening address in a resort in end of this month.\n\nMr. Jackson has been re-elected M.P.P. by Rockwood by a majority of 1,000 votes.\n\nMr. Neill, alleged to have been in the recent thefts, has been honorably acquitted by the coroner's jury.\n\nThere is a great deal of talk about the house in his house, but no one can go to prove he had any knowledge that the goods were stolen.\n\nMr. McDonald, W. J. Sherwood, and Alex. Reid, for a bit of amuse- ment, were taxed a V each the other day.\n\nOn Tuesday evening next, the Brandon city hall will give a concert featuring Mr. Thompson on the piano.\n\nIn all some forty prizes will be competed for, making it a most interesting one.\n\nAs the band are now sustaining themselves by playing at various places, the public ought to encourage the boys with a show of attention.\n\nMr. Atkinson is receiving his shipments of spring goods, and will have a large selection of articles in our next issue.\n\nAt the general election the Charter party will be identifying itself with property of people residing within ten miles of the city limits.\n\nOur machines men are fitting themselves for the spring trade, and several of them have made some improvements.\n\nMessrs. Sorenson & Johnston are undertaking spring goods at a great rate these days, and will make new selections from the best.\n\nThe plowing mill which had been shut down for several weeks was reopened yesterday at full speed.\n\nThe large tent was erected ahead.\n\nMr. Robison and Ethel Robison were visiting the Reid's keep- ing a \"house,\" the other day, but as the weather was conflicting, they kept acquitted.\n\nA large number of the citizens at- tended the annual town entertain- ment on Friday evening last.\n\nThe entertainment was most enjoyable in every respect.\n\nMr. Bennett, going to his stable the other night, found a stranger there, so he called the police.\n\nIt is not improbable there are thieves abroad, and the public ought to be on the alert.\n\nThe grill will reopen today and will be attended by Mr. Smith, who has been away on the pop.\n\nThe Farmers' Union is exhaust-\n\nThe Postage Grid print has the following notice:\n\nNotice.\n\nIn the Matter of the sale of THOMAS L.\n\nA MEETING\n\nCONSERVATIVE\n\nEl Dorado\n\nWOODWORTH\n\nMAIL CONTRACT.\n\nS.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/BRM_1884031301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11118, "total-output-tokens": 4764, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3618, 2], [3618, 4392, 3], [4392, 5473, 4], [5473, 7095, 5], [7095, 12400, 6], [12400, 15216, 7], [15216, 18780, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]