[{"id": "9049afc08d757541729161c7a1dccaf19b78ef4a", "text": "The Brandon Mail.\n\nVol. 2. THURSDAY, MAY 28, 1885. NO. 35.\n\nLEGAL.\n\nW.A. MACDONALD,\nSolicitor, Attorney, Solicitor, Notary Public,\nBarristers, Solicitors, Notaries, Solicitors.\nMUNICIPALITY OF WINNIPEG.\nMONEY TO LOAN.\nOFFICE—Near Imperial Bank, Room No. 1.\nDALT & COLDWELL.\nBARRIERS, SOLICITORS, ETC.,\nMONEY TO LOAN.\nRoom No. 1.\nJ.M. STREET.\nC.A. DURAND.\nBarrister, Solicitor.\nSubstituted for Solicitor's Bank.\nNEWTON & COOPER.\nLaw Office, 6th Street.\nSTODDART & BOWEN,\nBARRIERS, SOLICITORS, ETC.\nOffice—Main Street, Room No. 1.\nHENDERSON & HENDRICKSON,\nBarristers, Solicitors, Notaries, Solicitors.\nPublic Notice—Notice is hereby given that the offices of the above named Solicitors have been moved to the new building at the corner of Main Street and 5th Avenue.\nRUSSELL & CLUTTERBANK,\nBARRIERS, SOLICITORS, ETC.\nOffice—Main Street, Room No. 1.\nHOTELS.\n\nTHE BRISBANE HOTEL.\nMain Street, between 4th and 5th Streets.\nPresses—The latest news from Europe and America always available.\nMEDICAL.\n\nDr. JOHN A. MACDONALD,\nL.S.C.P., EDINBURGH, SCOTLAND.\nSpecialist in Diseases of the Nervous System and Insanity.\nOffice—Main Street, Room No. 1.\nDr. RICHARDSON SPENCER,\nSolicitor, Surgeon and Accountant.\nOffice—Main Street, Room No. 1.\nDr. J. MCDONALD,\nSurgeon and Accountant.\nOffice—Main Street, Room No. 1.\nDr. L. A. MOORE,\nPRINCIPAL SURGEON AND ACCOUNTANT.\nOffice—Main Street, Room No. 1.\nDENTAL.\n\nF.E. DOERING,\nDENTIST.\nOffice—Main Street, Room No. 1.\nDr. MATHEWS,\nVETERINARY SURGEON.\nOffice—Main Street, Room No. 1.\n\nPRESS ADVERTISING.\n\nPARISH & SON,\nBRANDON.\nAre Prepared to purchase or Deliver at any Station on the C.P.R.\nAny Quantity of Pressed Hay!\nSEEDS,\nTimothy, Hopseeds Grass and Clover seed.\nALSO THE BEST BRANDS OF FLOUR.\nParish & Son.\n\nCourt of Revision.\n\nMunicipality of WHITEHEAD.\nWill be held at Whitehead on Saturday May the 23rd, 1885.\n25 O'CLOCK NOON.\nGeorge Armstrong,\nTreasurer.\nThis notice is given in accordance with the provisions of the Municipal Act.\n\nOUR TEMPERANCE WORK.\n\nConducted by the W.C.T.U. of Brandon.\nWork I: Work 2:\n\nCome, labor on! What dawns dark-side life in the harmonious plan of the universe? And how does it serve the master art?\nCome, labor on! The great calling angels cannot escape, nor can we who love our Lord, be exempted from the duties which God has laid upon us.\nCome, labor on! The energy is watching, night and day, while slumbering slants their daily handiwork.\nCome, labor on! How pleasantly do the morn and the cool evening come and go, how dear their joy, how deep their sorrow is.\nCome, labor on!\n\nFor every man and woman, borders to visit every patron at the Post Office Bookstore.\n\nWomen's Temperance Union.\n\nAt the recent meeting of this Union, Mrs. Harvey spoke so eloquently in favor of the temperance question, that she was heard by all present, and it was evident that there might be a possibility of success in the work. The cause of temperance is being steadily advanced, both spiritually and spiritually by the Union. It is felt that the influence of temperance in the home is not only desirable, but essential for the welfare of the community at large. It is felt that the work of temperance is a noble one, and that the women of Canada should take an active part in promoting it.\n\nWe will send the following three Books for examination: \"The Canadian Temperance,\" a complete medical advice book for women; \"How to Make and Keep Your Own Tea,\" price $1; \"Pen and Canvas,\" a guide for keeping house, to make over the use of candles and gas, and save money; and \"The Ladies' Guide to Fancy Work,\" a practical guide to all ladies interested in the art. We are also sending \"Art Matters,\" containing a large amount of useful information for the housewife. Encouragingly, we have just received from Mr. Henry, of London, Ontario, a copy of the journal \"The Canadian Temperance,\" which contains many interesting articles and stories. We will be pleased to send any of these books, and we would encourage all women to study them. For each of the above, send $1.00 to LADIES' GOLD NECKLACE COMPANY, THE CANADIAN CO., N.Y., N.Y.\n\nPRESBYTERIANS.\n\nSynod of Manitoba and the N.W. Territories.\n\nBrandon, Thursday, May 21.\n\nThe Synod was convened at 10 a.m. The Rev. Mr. Macdonald, Principal of Brandon College, presided. The Revs. K. M. Murray and Mr. Ross Evans delivered addresses. The object of the exercise was the prosperity of the Presbyterian Church in Manitoba. The Rev. Mr. Macdonald, in his address, stated that he had set sail from England with the intention of visiting the United States, but was obliged to change his plans due to unforeseen circumstances. He expressed his gratitude to the congregation for their hospitality and support.\n\nMr. Macdonald then addressed the congregation, emphasizing the importance of the Presbyterian Church in maintaining its principles and traditions. He encouraged the congregation to continue their support of the church and its mission. The Rev. Mr. Murray then delivered an address on the importance of education in the Presbyterian Church. He emphasized the need for education in order to maintain the integrity and purity of the faith.\n\nMr. Evans then delivered an address on the importance of the Presbyterian Church in promoting social justice and equality. He encouraged the congregation to continue their support of the church and its mission. The Rev. Mr. Macdonald then delivered a final address, thanking the congregation for their support and expressing his hope for the continued prosperity of the Presbyterian Church in Manitoba.\n\nThe Synod adjourned at 12 noon, with prayers offered by the Rev. Mr. Macdonald.\nI take pleasure in informing the Citizens of Brandon and residents of the vicinity, that I have opened a new Book and Stationery store in the Post Office Building Masonic Block, where I should be pleased to meet all in need of any goods in my line.\n\nI will always keep on hand a full line of plain and fancy Stationery, miscellaneous and Church books, and light reading.\n\nALL SCHOOL REQUISITES, LEGAL BLANKS AND LEGAL STATIONERY, Of every description; fancy goods in variety:\n\nTOYS for the children, etc., etc.; in fact everything kept in a well appointed business.\n\nI have formed such business connections as will enable me to get anything in any line not in stock on the shortest notice. Special rates will be given to School Trustees and Teachers, Municipalities and other corporations that require large quantities of anything in my line. Any paper, book, or magazine published, will be secured and sent to any address on the shortest possible notice.\n\nC. CLIFFE.\nTHE TORONTO STORE\nSELLING OUT.\nLEAVING BRANDON.\n\nHeaps of Dry Goods\n\nCAR LOADS OF GROCERIES.\n\nSOVEREEN & JOHNSON.\nToronto Store, Cor, 7th St., & Rosser Ave.,\nN.B.—All accounts due up, if not paid in Ten Days, will be placed in Lawyer's hands for Collection.\n\nWhitehead & Whitelaw's\n\nFOR—\n\nBlue Vitrol.\nBarrel Salt.\nCoal Oil.\nSugar and Syrup.\nBoots and Shoes.\n\nA lot of the above just received and can be had in Wholesale and Retail quantities.\nRosser Avenue, Brandon.\n\nFarm Produce Bought and Sold.\n\nWILSON & CARRICK.\nGENERAL\nBlacksmiths and Jobbers\nWest Side—NINTH Street—\nBetween Rosser and Princess Sts.\nBEST HORSE SHOERS IN THE CITY.\nRepairing of All Kinds\nDONE ON SHORT NOTICE.\n\nJames S. Gibson,\nFIRST-CLASS RIGS,\nSTYLISH HORSES.\nLivery Stable and Feed\nSTALLS\nTRADE IN\nHorses, Oxen, Wagons, Sleighs,\nBuggies, Cutters, &c.\n\nTHE Corbin Disk Harrow\nAND\nSeeder Attachment.\n\n(Patented in U.S. and Canada.)\n\nThis Harrow has Sharp Steel Disks,\nLever to regulate Depth of Cut and\nSeeder Attachment.\n\n\"The BEST DISK HARROW IN THE WORLD\"\nIt saves \"back setting,\" it saves seed it saves horse flesh and increases the crop.\n\nA FACT.—Any man can ride this machine and do more work than he could do thoroughly, with less tax on his team, than with any tooth harrow or cultivator in the market. We have thousands of endorsements and testimonials.\n\nHigh winter freights will prevent the sale of only a limited number this season. Farmers should secure one at once.\n\nAlso the Corbin Wright Rim Roller filled with smooth Journal Bobbins, Boxed.\n\nMuch stronger, durable and lasting than Wooden Rollers—Exposed to the weather.\n\nWin. Johnston, Agent, Brandon, Man.\nMade by St. Law, Mfg'g. Co. of Ont. limited, Prescott, Ont.\n\nHEALTH AND HOME.\nPublished Monthly at Washington, D.C.\nSworn Circulation, 160,000.\nEdited by W.W. HALL, M.D.\n\nSAMPLE COPIES FREE.\n\nPREMIUM LIST FOR $8.40.\nA Literary Evolution—A Whole Library for 50 Cents.\n\nGIVEN TO EVERY SUBSCRIBER.\n\nFor One Subscriber.\n\nFor Five Subscribers.\n\nFor Ten Subscribers.\n\nFor Twenty Subscribers.\n\nFor Fifty Subscribers.\n\nFor One Hundred Subscribers.\n\nFor One Thousand Subscribers.\n\nThis Premium List Closes on May 31, 1898.\n\nHEALTH AND HOME, Washington, D.C.\nTO OUR SUBSCRIBERS.\n\nWe have now completed our second number of the \"Brandon Weekly Mail,\" which will shortly appear in a third number. We wish to inform our subscribers that we will issue our ninth number soon after this current paper goes to press.\n\nBRADW已经是两行的标题了。\nIMPORTANT\n\nFraser Bros.,\n\nHEALTH FOR ALL!\n\nHOLLOWAY'S PILLS & OINTMENT.\n\nTHE PILLS\n\nPartly the Blood, correct all Disorders of the LIVER, STOMACH, KIDNEYS AND BOWELS.\n\nThey invigorate and strengthen the whole system, and are invaluable in all Complaints common to Females at ages. For children and the aged.\n\nTHE CINNAMON\n\nAn infallible remedy for that Lepus, Red Breast, Old Wounds, Scars and Ulcers. It is famous for its power in removing all the above mentioned complaints.\n\nFor Sore Throats, Bronchitis, Coughs, Colds.\n\nGlandular Swellings, and all Skin Diseases it has no rival; and for contracted and stiff joints it acts like a charm.\n\nManufactured only at Thomas Holloway's Establishment.\n\n76 NEW OXFORD STREET, LONDON.\n\nMAPS, MAPS, MAPS,\n\nJUST OUT.\n\nMAP OF BRANDON COUNTY\n\nShowing the Topography of the County, Schools, Post Offices, Bridges, and other improvements to date. Size 32x42.\n\nHandsomely mounted and varnished with rollers top and bottom........................................... $4.50\nSheet copies mailed to any address.......................... 2.00\n\nMAP OF MANITOBA,\n\nShowing Judicial Districts, Counties, Etc. Mounted same as County Map........................................... $3.00\nSheet copies mailed to any address.......................... 1.00\n\nMAP OF CITY OF BRANDON,\n\nShowing position of buildings, graded streets, sidewalks, tanks and all public and private improvements.\n\nCorrected and revised to January 1st, 1885, mounted same as County Map........................................... $1.50\nIn sheet mailed to any address.......................... 50\nGovernment, Railway, C. P. R., and School Maps always on hand.\n\nThese Maps are on view at the POST OFFICE BOOKSTORE.\n\nOr may be had by addressing,\n\nJ. H. BROWNLEE,\nPrvincial Land Surveyor, Brandon.\n\nLook Out!\n\nFor the advertisement next week, of the Pioneer Boot and Shoe House,\n\n9th St. This is the popular establishment of the city.\n\nW. Senkbiel, Prop.\nCALLED BACK\n\nBy Henri Gaudet.\n\nPoveshell has been called back from his last words. He promised that he would return to his former position, but he did not do so. The following is what he said:\n\n\"I have heard your words, but I cannot return to my former position. I am not willing to do so.\"\n\nThe Brandon Weekly Mail\nPerfect Fits.\n\nIF YOU WANT A Cheap and Neat Fitting\n\nL. STOCKTON.\nPovder Tailor.\n\nFashionable Winter Overcoats\n\nA SPECIALTY.\n\nAll work guaranteed to give satisfaction. Bring along your coat and we will make you present you.\n\nL. STOCKTON.\nPovder Tailor.\n\nBurlington\n\nSHOAL LAKE\n\nThe undersigned now offers for sale some good lots in the TOWN OF BURLINGTON situated at the Narrows of Shoal Lake.\n\nThe location is one of the finest in the Northwest, and having the prospects of the early construction of the M. & N.W. Railroad through the place.\n\nIt is destined to be NOT ONLY a good place of business, but\n\nA PLEASURE RESORT!\n\nbeing situated at a Beautiful Clear Water Lake, nearly two miles away by five long miles of water, abundant with plenty of fine fish and good shooting. It has nice scenery around the lake. Its banks being high & gravelly covered with timber. Also a fine view of the Riding Mountains, a distance of 12 miles off. Although not centered in a large extent of agricultural lands which is necessary for the class of farmers it is bound to become a large town.\n\nFor further information or a view of plans may be seen at the office of\n\nMORPHY & STEWART,\nBurlington, Man.\n\nNotice to Contractors.\n\nTENDERS\n\nWill be received up to the 25th day of April, 1885,\n\nby the Trustees of the Brandon School District, No. 37, for the purpose of erecting a new school building.\n\nJAMES CLIFFORD,\nTrustee.\n\nTo Rent or Let on Shares.\n\nN. W. 12th St., near Rosser Avenue.\n\nMr. C. CLIFFE, Brandon.\n\nUxbridge Organs.\n\nFar ahead of all its Competitors.\n\nThe Company have been awarded the name of THE BEST WORKERS IN THE ORGAN BUSINESS.\n\nElegant in design. Durable, and complete in all its parts.\n\nMr. C. CLIFFE, Brandon.\n\nTHE WALL PAPER EMPORIUM\n\nNOW OPEN FOR INSPECTION.\n\n48 Cases Latest Designs in Wall Papers\n\nAT PRICES TO SUIT EVERYONE. SPECIAL PRICES FOR HOTELS.\n\nWholesale and Retail.\n\nWM. H. SAUNDERS, 9. MAIN STREET, WINNIPEG.\n\nBurdock Blood Bitters.\n\nMAIL CONTRACT.\n\nNotice to School Trustees.\n\nNotice to Contractors.\n\nHAGYARDS YELLOW OIL\n\nCURES RHEUMATISM\n\nFREEMAN'S WORM POWDERS.\n\nHAIR DESTROYER.\n\n$20 IN GOLD (SPECIAL OFFER)\n\nALEX. ROSS' DEPLANTER.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/BRM_1885052801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11440, "total-output-tokens": 3703, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5632, 1], [5632, 6600, 2], [6600, 8798, 3], [8798, 9066, 4], [9066, 11010, 5], [11010, 11326, 6], [11326, 13484, 7], [13484, 13484, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]