[{"id": "6b8aaff859d886a81b55276ee300bcd1b5dbcfb9", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below:\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Relié avec d’autres documents\n- [ ] La reliure serrée peut causer de l’ombre ou de la distortion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d’une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n’ont pas été filmées.\n\nQuality of print varies/\nIncludes supplementary material/\nOnly edition available/\nPages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\nThis item is filmed at the reduction ratio checked below:\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contact specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol ➤ (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole ➤ signifie \"A SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nPRIVATE.\n\nLETTER\n\nTO THE\n\nHON. JOHN QUINCY ADAMS, JR.,\n\nRELATING TO\n\nTHROUGH TRAFFIC CONNECTIONS\n\nFOR SEASON 1878,\n\nBETWEEN\n\nTHE OGDENSBURG & L. C. RY. CO.\n\nAND\n\nTHE NORTHERN RAILWAY OF CANADA.\n\n(COLLINGWOOD LINE.)\nLETTER\nTO THE\nHON. JOHN QUINCY ADAMS, JR.,\nRELATING TO\nTHROUGH TRAFFIC CONNECTIONS\nFOR SEASON 1878,\nBETWEEN THE OGDENSBURG AND LAKE CHAMPLAIN\nRAILROAD AND THE NORTHERN RAILWAY OF\nCANADA (COLLINGWOOD LINE.)\n\nTo the HON. JOHN QUINCY ADAMS, JR., Boston.\nNORTHERN RAILWAY OF CANADA,\nToronto, 31st August, 1878.\n\nSIR,—When I had the honour of waiting upon your Committee at Ogdensburg, on the 14th inst., with a view to consultation upon the relations between our Companies, you were good enough to read to me a statement made by Mr. John C. Pratt, having special reference to those relations, and to a correspondence which had passed between that gentleman and myself, and which I had thought it my duty to print for the private information of the Directors of the O. & L. C. Railway Co.\n\nThe tenour and method of Mr. Pratt's statement made it necessary for me to request an opportunity for answering it in writing, which your Committee courteously granted.\n\nI propose now to submit to you: as briefly as possibly the history of the transactions upon which we are unfortunately at issue with Mr. Pratt, offering my views upon such of the points as may seem, in view of his statement, to demand explanation.\n\nIn doing so, I must express my regret that Mr. Pratt has ventured to adopt language with reference to me and my officers inconsistent alike with the sobriety of business criticism and with the courtesy usual amongst gentlemen; but his unmannerly method obliges me to say that when he charges us with a \"studied effort\" throughout these negotiations \"to pervert the truth,\" he makes their continuance or repetition with himself impossible: for although personally his challenge is offensive, officially I am quite content to submit our veracity and good faith in these transactions to such independent and business-like\nenquiry as your Committee may care to institute in the interests of the O. & L. C. Company.\n\nMr. Pratt opens his statement by reference to \"a pamphlet issued by F. Cumberland, Esq., purporting to be correspondence relating to through traffic connections\" between our Companies, and involving therefore the imputation that \"the correspondence\" so issued is something other than it professes to be. I accordingly feel obliged to say that the correspondence as printed (including the Contract) is verbatim et literatim the only and the complete correspondence which has ever passed, or is ever likely to pass, between Mr. Pratt and myself.\n\nProceeding now to the history of the whole case, I may premise that in August, 1877, the Superintendent of the Ogdensburg and Lake Champlain Railway came personally to Toronto and solicited my Company to establish traffic relations on through grain business with his Line. After considerable discussion, an understanding was arrived at. The divisions of rates were settled, the bill of lading (O. & L. C. Co.) was adopted, the Western agencies appointed, and the Line (including sail vessels on both lakes) was put into immediate operation; the result being that between August and the close of navigation, 603,000 bushels of grain were delivered to your Company's elevator at Ogdensburg, in a manner, at rates, and on settlements which were wholly advantageous and satisfactory to both Companies. There was no hitch difficulty or difference between the two Companies at any time, and the season's business was closed with mutual congratulations. It may be fair, however, to add that up to that time we had not had the honour of doing business with Mr. Pratt.\n\nOn the 29th November we invited your General Superintendent to meet us, with a view to renewed connections for the then ensuing season, to which Mr. Hungerford replied that he, with the President (Mr. Pratt) would come to Toronto at an early date, with that object.\n\nOn the 29th December, 1877, Mr. Hungerford again writes to the effect that he will be in Toronto about the 15th January, and adds, that he is \"arranging to secure some steam power on the Lakes, and as soon as that is consummated, we (the O. & L. C. Co.) will be ready to arrange for both grain and merchandise; will push matters to a close as fast as possible.\"\nAccordingly, on the 31st January, 1878, Mr. Hungerford again came personally to Toronto, and opened negotiations for the re-establishment of the Line on the basis of the arrangements of 1877. He expressed his strong approval and complete appreciation of the business of the previous season, and urged that its success was such as to warrant the formation of a steam line for 1878; and he made \"steam\" a sine qua non.\n\nAfter introductory consultation with myself, Mr. Hungerford and Mr. Kerr (our General Freight Agent) pursued the negotiation in detail, resulting in the preparation (in these offices and in Mr. Hungerford's own handwriting) of a Draft Contract to which I was invited to give, and then gave, my preliminary, and informal assent.\n\nActing upon the suggestions of this Draft Contract, and in order, before final conclusions to make \"assurance doubly sure,\" Mr. Hungerford and Mr. Kerr, on the 7th February, 1878, proceeded together to Detroit, Chicago, and Milwaukee, to inform themselves in relation to dockage, agencies, and the probabilities as to the securing of steam power, and these details having been mastered, it was arranged that the consideration and conclusion of the contract should await the presence and sanction of the President of the O. & L. C. Co., Mr. Pratt.\n\nAccordingly, on the 6th March, 1878, Mr. Hungerford and Mr. Kerr went again to Detroit in further prosecution of their efforts to secure steamers for the Line, and were by appointment, joined there on the 9th March by Mr. Pratt, all three proceeding on to Chicago.\n\nOn the 10th March, 1878, a meeting was held in Mr. Pratt's rooms, at the Palmer House, Chicago, for the purpose of discussing and concluding the contract which had been under negotiation and progress since the 31st January. At that meeting were present Mr. John C. Pratt, President; Mr. Hungerford, Superintendent; Mr. Church, General Freight Agent; and Mr. H. W. Pratt, the President's son and Western Agent; all on behalf of the O. & L. C. Co., and Mr. Kerr, the General Freight Agent of this Company.\n\nThe Draft Contract was then read over, discussed and passed clause by clause, all parties freely joining in the explanation and criticism of its provisions; and the contract having then been approved by Mr. Pratt, it was signed, by his authority, \"as an\nevidence of good faith on the part of both Companies,\" by Mr. Hungerford, on behalf of the O. & L. C. Co., and Mr. Kerr, on behalf of the Northern of Canada, and pending its execution at Toronto by Mr. Pratt and myself, the proposal being that Mr. Pratt should stay at Toronto for that purpose on his way home to Ogdensburg.\n\nA telegram was forwarded to me from Chicago to that effect requesting me to meet Mr. Pratt, on his arrival here, for the purpose of final signature; but being called suddenly to Ottawa, on parliamentary business, which would not admit of delay, I was unable to be present, and Mr. Pratt proceeded eastward without stopping.\n\nOn the 16th March (six days after the conclusion of the contract at Chicago), Mr. Hungerford wrote explaining that \"on receipt of our telegram to the President, stating that Mr. Cumberland was absent,\" (and therefore could not meet Mr. Pratt for the final execution as aforesaid), \"we\" (the president and himself) \"started for home and did not stop at Toronto.\" And he goes on to say, \"I have been expecting a telegram from you giving the result of your negotiations in Chicago for a dock, and also as to what you have done about a contracting agent. I am anxious to know how you have succeeded. Did Austrian agree to place the Norman in the line? I felt quite sure he would when I left. Our President has placed the Western business entirely in my hands since his return from his Western trip. Now that he will let me work we can work this line smoothly, and let us rush matters along and get ready to start the boats by the first of April if the weather holds good. When can you come to Ogdensburg and arrange the ticket issues and passenger business? Please write me and give me all the particulars. Do not fail to hurry up the boats to have them ready by April first. I want the first cargo of grain to come over your line to open the season.\"\n\nOn the 19th March, Mr. Kerr replied to Mr. Hungerford to the effect that he was completing arrangements with steamers to fill the line—had secured the City of Montreal and Lothair and was closing with a third; that he had concluded arrangements with the Empire Warehouse Co. to provide dockage for the Line, and enclosed copy of the agreement with them, which he hoped would meet Mr. Hungerford's approval. He goes on to say, \"After considering the question of Contracting\nAgent (at Chicago), in all its bearings, I finally concluded that Mr. D. B. Linsted was the proper man to take care of our interests. I made careful enquiry of disinterested parties regarding him, and found them unanimous in saying that he was the most popular and one of the smartest contracting men on the floor. All this, coupled with the fact of his splendid connection with the leading shipping houses to New England, decided me to offer the position to him.\" He adds, \"I am working like a beaver to get everything into shape, and will be all ready for you at opening. There is just one thing I wish to impress upon you, that is, that our Boats cannot run unless they have West bound freight.\"\n\nOn the 8th April, 1878, Mr. Kerr again communicates with Mr. Hungerford, saying: \"First cargo having left Chicago, when will you have merchandize moving West, steamers here ready to go on,\" and he writes, \"Our Lake Ontario, steamers are ready to go to work. I expect to have all my three Upper Lake boats under contract by Wednesday or Thursday.\"\n\nTo this Mr. Hungerford replies under date 11th April:\n\n\"President Pratt is now in Boston, and has gone to Portland to-day to confer with the Portland and Ogdensburg R. R. officials, and with the Northern R. R. also about opening the line this month through to Rouse's Point. The General Freight Agent of the Eastern road will then commence at once to scour Boston, Portland, Salem, Lewiston, Portsmouth, and all other Eastern points, for freight for your line. I think we will have plenty of freight by the time the boats get into line to give it despatch.\"\n\nAgain on the 11th April, Mr. Kerr telegraphs the following message to Mr. Hungerford:\n\n\"Line is now complete. Steamers Lothair, Niagara, Robertson, between Chicago and Collingwood, Armenia and Cuba between Toronto and Ogdensburg. Please report prospects regarding up freight, anxious to hear of your arrangements. Lake Ontario steamers will commence running so soon as you can give them West bound freight. Please answer.\"\n\nOn a review of all the circumstances of the case so far, I think your Committee will concur with me in the opinion that we were amply warranted in regarding the contract signed at Chicago on the 11th March as conclusively recognized by, and binding upon, both Companies. It will be observed that framed on the basis of the business of 1877, the contract was under negotiation and detailed preparation from the 31st January to the 9th March; that it was carefully revised and discussed by the Pres-\nident and his officers at Chicago on the 10th March, and with his authority was thereupon signed on behalf of the two Companies; that thereafter continuously for six weeks, (viz., from 10th March to 21st April), energetic measures were taken by the officers of both Companies, acting in full concert, to give practical effect to its provisions. Steamers were contracted with, dockage was secured, agents were appointed, and all preparations made for the opening of the season, and we were promised that \"all Eastern points should be scoured for West-bound freight,\" and that we should \"have plenty of it by the time the boats got into line.\"\n\nI think, too, that your Committee remembering that we had in the interval incurred the most serious responsibilities in regard to the contract formation of the Line by five steamers under different ownerships, by the reconstruction of 70 cars specially fitted for this trade, by liabilities in regard to dockage, agencies, and the like, will not be disposed to rely upon Mr. Pratt's assertion when he says \"it is further true that Mr. Cumberland repudiated the contract of March 11th.\"\n\nThe first cargo arrived at Ogdensburg on the 21st April, with bill of lading and back charges in strict accordance with the provisions of the contract.\n\nPayment of the back charges on that basis was then refused by Mr. R. W. Pratt, Agent at Ogdensburg (one of the President's sons) and the announcement of such refusal was the first intimation to us that the contract was to be repudiated!\n\nThe action of the Ogdensburg Agent, Mr. R. W. Pratt, being sustained by the President, the ship-owners (Messrs. Hagarthy and Grasett) enquired on what ground he repudiated a contract made by the Agent of the Line in Chicago, and Mr. R. W. Pratt replied by telegram in the following words:\n\n\"We have no Agent in Chicago, and I refer you to Mr. Kerr to settle the difference.\n\n\"R. W. PRATT.\"\n\nI shall presently shew that the Chicago Agent, Mr. Linsted, was the joint appointee of both Companies, and had been appointed after full consultation between the officers of both, acting in concert, and it may perhaps appear that his repudiation by Messrs. J. C. and R. W. Pratt was not altogether unconnected with the fact that Mr. H. W. Pratt (another son of the Pres-\nident) had also in the interval been appointed Western Agent of the O. & L. C. Railroad Co., and that he had (much to our surprise) established his office as such in the offices of the Northern Transit Company at Chicago.\n\nThe contract having thus been practically dishonored and set aside, we understood that Mr. Hungerford applied to the President for instructions, whereupon the President wrote the following letter:\n\nOGDENSBURG, N. Y., April 22, 1878.\n\nMr. W. HUNGERFORD,\nSuperintendent.\n\nDear Sir,—In answer to your request for my views as to the terms upon which we should do business with the Collingwood Line, I beg to say that I will make the same agreement with that Line that is now in force with the Northern Transit Company, under an agreement made by them with the Central Vermont Company, dated March 20th, 1876, and also under a supplementary agreement made with our Company dated March 20th, 1873, so far as said agreements refer to freight between New England and Lake Michigan points.\n\nBy such an arrangement no bills will be recognized by us that do not pay us forty (40) per cent. of the published all rail rate, and one half cent. per bushel elevating, and no charges to us for commissions, either directly or indirectly.\n\nYours very truly,\n\nJ. C. PRATT,\nPresident.\n\nYour Committee will observe that from first to last there is not a single word in this letter in any way referring to the contract signed at Chicago, not a word to indicate that any arrangements had been made or that any relations whatever existed between the O. & L. C. Company and the Northern Company. The President simply ignores the whole thing by a scratch of his pen, and writes a letter which if proper to be written at all should have been written in January, when negotiations were initiated, or at any rate should have been insisted upon (if at all) at Chicago on the 10th March.\n\nIn view of these instructions from his President, Mr. Hungerford, invited Mr. Kerr to go to Ogdensburg, which he did, when Mr. Pratt declined to carry out the contract of the 11th March agreed to and signed at Chicago, on the ground that he had not understood its provisions, that he could agree to no other terms than those established with the N. T. Company, that he would not pay any commissions to Western Agents, and\nthat he would not issue any O. & L. C. Company's bill of lading at Chicago. Thus all the chief points in the contract were repudiated, and it was practically valueless in its most vital features.\n\nI thereupon myself proceeded with Mr. Kerr to Ogdensburg, and was favored by an interview with the President, Mr. Pratt, who repeated to me the same objections to the contract as he had previously stated to Mr. Kerr; and as he still declined to execute the contract or to recognize its provisions, I contented myself by informing him that I should appeal to the Board of Directors which had been already summoned for an early meeting at Boston.\n\nMy visit to Ogdensburg clearly exposed the fact that great differences existed between the officers of the Company in relation to the contract. Mr. Pratt repudiated, but Mr. Hungerford recognized it. The President claimed to have misunderstood its provisions, whilst the Superintendent upheld them.\n\nWith the internal dissensions of your Company we had nothing to do, although they sensibly embarrassed us in our relations with it, and although it was clear to us that in the absence of them the business would have run smoothly enough.\n\nMr. Hungerford at one time stated that \"the President had placed the Western business entirely in his hands;\" and I observe that Mr. Pratt claims that it is \"absolutely and unqualifiedly false\" to charge him with \"interference with Western business,\" but as outsiders doing business with your Company we are bound to say that all the difficulties, obstructions and repudiations have, so far as we can judge, arisen out of the action of the President and his sons, and the letter of the President, dated 22nd April, and already quoted, sufficiently proves that with him, and him alone, rests the responsibility (whatever it may be) of having treated the contract of the 11th March as so much waste paper, and of having set aside, without one word of enquiry or suggestion, an agreement which had been the deliberate work of himself and his officers, which had been signed by his own authority, and which, after signature he had held in his possession for nearly six weeks, without offering one word of warning that it was not in accepted operation, or that he intended to repudiate it.\n\nI observe that Mr. Pratt states that \"the contract was a long one, and many of its details were not clear to him;\"—that at\nthe time of its signature he was assured that \"the contract gave them\" (us) \"the same terms and facilities and divisions of rates that we\" (you) \"gave to the Northern Transit Co.,\" and that he \"authorized Mr. Hungerford to sign it, intending afterwards to examine more carefully its provisions!\"\n\nSurely your committee will be of opinion, that on Mr. Pratt's own shewing, his course was at least irregular and unfair towards us. I have shewn how we were urged forward to put the contract into operation, to complete agreement with steamers, to \"push matters along and get ready,\" to \"hurry up,\" so that \"the first cargo of grain should come over our line to open the season,\" and all this time (some six weeks), the President holds the contract in his possession, makes no sign in disapproval of it, and awaits the arrival of the first cargo, to repudiate all its most vital provisions! It is fair to Railway men as a class, to claim for them, that although contracts may be \"long,\" and their details intricate, they generally master them before authorizing their signature, and do not execute documents under a mental reservation, that they \"intend afterwards to examine more carefully their provisions!\" and to claim complete freedom as if no contract had been signed.\n\nI propose however, to consider the objections to the contract of the 11th March, upon which Mr. Pratt justifies its repudiation, and I think they may be stated, as follows:\n\n1. That the contract does not conform to the agreement \"now in force with the Northern Transit Co.\" dated 20th March, 1876, and also \"a supplementary agreement made with our Company, dated 20th March, 1878.\"\n\n2. That the division of rates ought to give the O. & L. C. Co. 40 per cent. of the published all rail rate, and \\( \\frac{1}{2} \\)c. per bushel elevating.\n\n3. That the O. & L. C. Co. should not bear any part of the expense of Western agencies and commissions.\n\n4. That the Bill of Lading should not be the Bill of the O. & L. C. Co.\n\nI will discuss these in their order, first showing that the objections are so clear, simple and decisive, that ordinary people would be disposed to conclude that any railway authority (with the assistance of a superintendent, of a general freight agent and of a western agent), would have been able to discover whether a\ncontract did or did not provide for them, and would have thought it his duty to make that discovery before authorizing its signature.\n\nHowever, Mr. Pratt claims that he did not understand the document, and we, of course, are bound to accept and are quite ready to believe his confession.\n\n1. As to the objection that the contract does not conform to the agreements in force with the N. T. Company.\n\nIf such conformity was necessary why were we never invited to agree to it? I am told that when Mr. Pratt (with the assistance of his three officers) discussed and adopted the contract clause by clause, the agreement with the N. T. Co. was not mentioned nor any suggestion offered that the N. T. division of rates should be adopted. And if the N. T. contract of 1876 precluded the O. & L. Co. from adopting any other rates and divisions in 1878, how came it to be disregarded in 1877, when the business was done on precisely the same system as is embodied in and provided for in the contract of the 11th March? The president will scarcely say that he \"did not understand\" the nature of the arrangements of 1877, and yet the provisions of the contract of 1878 which he says were \"not clear to him\" were purposely and avowedly identical!\n\nWe were not aware that at the same time that Mr. Pratt was concluding the contract with us at Chicago, he was also negotiating a \"supplementary contract\" with the N. T. Co., and throughout the negotiations he never suggested that we should in any way be guided or governed by his relations with the N. T. Co., but rather, by his denunciations of that Company, led us to believe that he was, and wished to be, entirely clear of them.\n\nWe had been warned that Mr. Pratt was using us as a whip and lever to \"bring the N. T. Co. to time,\" but we rejected the suggestion. It is nevertheless peculiar that if it was necessary (as Mr. Pratt now says it was) that we should conform to the terms of a then existing contract with the N. T. Co., and if (as is undeniable) Mr. Pratt was at that moment negotiating with the N. T. Co. as well as with us, we were never advised of it, a contract on different terms was signed with us, a supplementary agreement with the N. T. Co. was concluded eight days afterwards, when Mr. H. W. Pratt became Western Agent of the O. & L. C. Co., and established himself as such in the N. T. Co.'s\noffices; and thereupon and then only the President having, we presume, \"examined more carefully the provisions\" of his contract with us, calmly and for six weeks awaits the arrival of the first cargo, and then, and only then, repudiates the agreement by telling his Superintendent that he will only \"do business with the Collingwood Line\" on the same terms as those \"now in force with the Northern Transit Company.\"\n\nI abstain from criticism of these transactions and leave the committee to unravel the complicated web of them if they can.\n\n2. \"That the divisions of rates ought to give the O. & L. C. Co. 40 per cent of the published all rail rate and \\(\\frac{1}{2}\\) c. per bushel elevating.\"\n\nNothing could have been easier than to have said this at Chicago on the 10th March, and nothing to my mind could well be more irregular and unfair than to reserve so simple a demand until the 22nd April, after we had in good faith made every preparation (under great liabilities) to give effect to a contract embodying different terms.\n\nI repeat that the terms of the Contract of the 11th March were no new terms, but were the terms upon which, in 1877, we had delivered to your Co. no less than 603,000 bushels of grain between August and November of 1877, a business which was declared to have been so satisfactory to your Company as to warrant it in soliciting us to reestablish it in 1878.\n\nIf the terms were fair and profitable to your Co. in 1877 on the basis of \"schooners running wild,\" they could not be less advantageous in 1878 on the basis of \"steam lines under season Contract,\" the whole burden and responsibility of which was cast upon and is now carried by us.\n\n3. That the O. & L. C. Co. should not bear any part of the expense of Western agencies and commissions.\n\nUpon this point Mr. Pratt says that he \"refused to walk into the trap so cunningly set for me, whereby our road was to be made to pay several thousand dollars commissions on freight obtained for Ogdensburg.\"\n\nBut if we are to congratulate Mr. Pratt on his escape from \"the trap so cunningly set for him\" in 1878, he may expect us to commiserate his fate in 1877, when he cheerfully and boldly walked into it. Perhaps the different circumstances of the two seasons may explain the contrast, for whereas in 1877 Mr. H.\nW. Pratt, (the President's agent), was the agent of the O. & L. C. Company at Chicago, receiving a commission of \\( \\frac{1}{2} \\) a cent a bushel, paid by that Company, with (of course) the approval of the President, in 1878 Mr. Linsted was the agent with a commission of only \\( \\frac{1}{4} \\) of a cent a bushel, which the President refuses to pay; but \"the trap\" of 1877 was baited with a son and a double commission, and having succeeded to a charm; \"our road was made to pay several thousand dollars commissions on freight obtained at Chicago;\" whilst in 1878, Mr. Linsted, and not Mr. H. W. Pratt, having been caged, with a commission reduced by 50 per cent., Mr. Pratt rejects the seductions of the trap and regards the whole proceedings with unmingled condemnation.\n\nI will trouble you with a brief history of this matter, observing that Mr. Pratt is himself responsible for dragging in personal discussions, to which I have the strongest repugnance.\n\nWhen the personnel of the Western Agencies came under discussion, it appeared that whilst in 1877 Mr. H. W. Pratt was nominally the agent, it was necessary to the efficient transaction of business that he should associate with himself some one of experience in duties to which he was a stranger, and Mr. Linsted was selected; but as that gentleman declined to work for less than the standard commission, of a \\( \\frac{1}{4} \\) of a cent., the commission was doubled, and \\( \\frac{1}{2} \\) a cent. paid to the agency. In 1878 Mr. Linsted declined to continue his association with Mr. H. W. Pratt, and it became necessary to choose between them. We were advised that if the choice were allowed to rest with the O. & L. C. Co. Mr. H. W. Pratt would undoubtedly be re-appointed: a course to which the steamboat proprietors had already strongly demurred, as prejudicial to the Line; and clause II of the contract, giving the nomination of the Western agencies to us, was thereupon specially introduced to meet the difficulty.\n\nThat clause, with all the others, was approved by Mr. Pratt when he authorized Mr. Hungerford to sign the contract. It is quite possible that Mr. Pratt did not understand it, until we had put it in effect by the appointment of Mr. Linsted, and that the discovery then found expression in the telegram of Mr. R. W. Pratt, announcing that, \"we have no Agent in Chicago,\" and, in the instructions of the President to Mr. Hungerford that he would pay no charges for commissions, either directly or indirectly.\n\nIt will be for your Committee to determine whether, in view\nof the agencies and commissions paid by their Company in 1877, there was much consistency in the objection of Mr. Pratt to their repetition on a more economical and efficient standard in 1878; and your Committee may, perhaps, institute enquiries as to the relative values of the respective agencies in those years,\n\n4. That the Bill of Lading should not be the Bill of the O. and L. C. Co.\n\nTo this I have to say that the language of the contract, which Mr. Pratt claims was \"not clear to him,\" is as follows:\n\n\"II.\" \"The said agents at Chicago and Milwaukee shall have full power to issue Ogdensburg and Lake Champlain Railway through Bills of Lading on behalf of the Line.\"\n\nAnd when I add that this clause of the contract simply provided for the continuance of the system adopted in 1877, when the Bills were Bills of the O. & L. C. Co., your Committee will probably seek a solution of Mr. Pratt's difficulty either in Mr. Pratt's absolute ignorance of the operations of 1877 or that the English language is \"not clear to him,\" or that he simply sought for a reason, any reason, to break down the contract.\n\nI am not aware that there was a single claim against your Company in 1877, upon its liability on these Bills, or that the credit and standing of this Company has not always been ample to secure any bill to which it is a party.\n\nI have thus disposed of the four alleged objections upon which Mr. Pratt repudiated the contract of 11th March; but before leaving this branch of the subject I desire to direct the attention of your Committee to the fact that although on the 11th April the Superintendent of the O. & L. C. R. Co. assured us that all New England points were to be immediately \"scoured\" for West bound freight, and that we should \"have plenty of it by the time the boats got into line;\" up to the date when I had the pleasure of meeting you in Ogdensburg, no Agent had been appointed anywhere in the East, and as the inevitable result not one single ounce of West bound freight has been secured; and I appeal to your sense of justice and to your appreciation of the moral (apart from the legal) obligations of contracts to say whether we have not good cause for the most serious complaint, and whether moreover your Company has not suffered serious loss by the inaction, not to say the opposition, which we have encountered from Mr. Pratt. On the 16th March your\nSuperintendent plaintively says: \"Now that he (the President) will let me work, we can work this line smoothly,\" and we feel that had that officer been allowed as he proposed \"to rush matters along\" the business would have been more satisfactory and more profitable to both interests than even in 1877, when everything was done to mutual approval and advantage.\n\nHaving appealed from the action of President, I had the honor of an interview with the Directors of the O. & L. C. Company at a meeting of the Board held at Boston on the 30th April, and the questions in difference having been discussed, their adjustment was left to Mr. F. Thompson (a member of the Board) at whose suggestion and on whose authority as the representative of his colleagues a memorandum was prepared and signed by Mr. Thompson, Mr. Pratt and myself, to the effect that \"the business be carried on under the provisions of the said contract,\" of 11th March, \"excepting that the question of Western commissions and brokerage be suspended for adjustment and decision at close of season,\" and that \"Bills of Lading for Eastern bound freight made in the name of the O. & L. C. Co. must in form and substance be satisfactory to the President of that Company.\"\n\nThat memorandam was adopted and signed in Boston, at about ten o'clock on the night of the 30th April, and I then parted with Mr. Thompson and Mr. Pratt, under the assumption, mutually expressed, that all differences had been settled.\n\nAccordingly, on the following morning, the 1st of May, Mr. Kerr, by my instructions, joined Mr. Hungerford in a new effort to establish Boston and New England agencies, to secure West-bound freight. I returned to Toronto, and Mr. Kerr prolonged his stay in Boston for the above purpose.\n\nOn reaching Toronto I was amazed to find the following letter from Mr. Pratt, bearing date the 1st of May, 1878:\n\nOgdensburg & Lake Champlain Railway Co., New York.\n\nTreasurer's Office, Boston, Mass., May 1, 1878.\n\nF. W. Cumberland, Esq.,\nGeneral Manager, Northern Railway of Canada.\n\nDear Sir,—\nTo prevent any misunderstanding on your part, I deem it proper to notify you that we recognize no agent in Chicago or Milwaukee as acting for or representing the Ogdensburg and Lake Champlain Railroad Co. excepting Henry W. Pratt, who has been appointed our agent. Any other person who\nmay claim to act in that capacity, acts without authority from this Road, and we shall bear no part, either directly or indirectly, of the expense of his services.\n\nVery respectfully,\n\nJOHN C. PRATT,\nPresident O. & L. C. R. R. Co.\n\nThus the \"settlement of the differences\" made by Mr. Thompson under authority of his Board, was in its turn repudiated by the President, and although the memorandum declared that the business should be carried on under the provisions of the contract, with certain specified and limited exceptions, Mr. Pratt ignored all agency at Chicago, excepting Henry W. Pratt, and absolutely refused to \"bear any part either directly or indirectly of the expense\" of that agency, although under the memorandum of Mr. Thompson, signed by himself, he had within 12 or 14 hours, agreed that such expenses should \"be suspended for adjustment and decision at close of season.\"\n\nI think your Committee will concede, that under such circumstances, no other course was open to me than to recall Mr. Kerr, stay all further proceedings, and stop the traffic. This I did with great reluctance, because I felt Mr. Pratt's action was in direct contravention of the action and policy of the Board as set out in Mr. Thompson's memorandum.\n\nIn the beginning of June the officers of your Company becoming uneasy, owing to the exceedingly small quantity of grain which was being delivered at Ogdensburg by the N. T. Co. (deliveries by Collingwood Line being stopped), Mr. Hungerford telegraphed Mr. Kerr on the 4th June, saying he would be in Toronto on the 5th, and asked for an appointment accordingly.\n\nMr. Hungerford duly arrived, accompanied by Mr. H. W. Pratt, and a meeting was held resulting in Mr. Hungerford making a proposal in writing, that relations be renewed on a basis of divisions—each Company to have 50 per cent. of the current through rate, with one-half cent to the O. & L. C. elevator, division to continue until further notice, or until the through rate advanced to $12\\frac{1}{2}$ cents per bushel, and that the O. & L. C. would immediately put an Agent or Agents into the field in New England, and use their utmost endeavours to secure west bound freight for the Collingwood Line.\n\nTo this proposal I signified my willingness to re-open business, on a basis of 50 per cent. to each Company until such time\nas the rate advanced to $12\\frac{1}{2}$ cents per bushel, and thereafter to revert to the terms of the original contract, providing the O. & L. C. Co. would undertake to provide sufficient west bound freight to make it an object to the propellers to carry Ogdensburg business, and also providing that each Company pay to the other a commission upon the net earnings of the Railways, that is, the portions of the through line between Collingwood and Toronto, and Ogdensburg and House's Point.\n\nTo my proposal Mr. Hungerford replied that he had no authority to bind his Company to the payment of the commission, and I, being anxious that whatever arrangements were then made should be authoritative and final, instructed Mr. Kerr to accompany Mr. Hungerford to Ogdensburg, with a view to that end. On the 6th June, Mr. Kerr had an interview with Mr. Pratt in his office at Ogdensburg, Mr. Hungerford and Mr. Church, the Gen. Frt. Agt., being present, and after discussing my proposal, agreed verbally to a division of rates, 50 per cent. to each Company, and proposed, with regard to the commission, that my Company pay the O. & L. C. 10 per cent. on all west-bound business handed to us, and that they (the O. & L. C.) would pay us 10 per cent. on the same amount of earnings on which we paid them, and agreed to appoint any man, and pay him any salary we might choose to name; but when Mr. Kerr proposed to go to Boston to look up the business, Mr. Pratt objected, and volunteered to bring a man to Ogdensburg, where Mr. Kerr could meet him and make arrangements. On Mr. Kerr reducing this proposal to writing, Mr. Pratt, in pursuance of the policy which evidently has guided his every action throughout these negotiations, again departed from the letter and spirit of the understanding arrived at, merely contented himself with returning a copy of the proposal submitted by Mr. Hungerford at Toronto, claiming that it embodied the full terms of the discussion had at the meeting held in his (Mr. Pratt's) office.\n\nOn Mr. Kerr's return to Toronto, I concluded that it was utterly hopeless to expect to arrive at an equitable solution of the difficulty with Mr. Pratt, and concluded to continue to direct our traffic into other channels until such time as we could arrive at a fair basis with the President of the O. & L. C., and only take such business for Ogdensburg as might be wholly to the interests of my Company and the steamers to carry. After the meeting\nof the Board of your Company; held at Saratoga, on the 17th July at which Mr. Averill was elected President, Mr. Hungerford again invited me to re-open the line to Ogdensburg, and to that end I met him in Boston, on the 25th July, when a provisional arrangement was made, whereby business was resumed, and connections made to give us a share of the west-bound business; since that date we have worked heartily for New England business, with results which I think you will find are highly satisfactory to your Company.\n\nOn investigating the result of the repeated checks put upon the business by Mr. Pratt, your Committee will find that from the opening of the season (say 21st April to 1st June), our aggregate contracts West represented 625,000 bushels of grain, of which 566,200 were sent to other points, and 58,800 bushels only delivered at Ogdensburg; whilst since, under Mr. Averill's administration, our relations having been restored (say since the 17th July), our Western contracts to date have represented 750,000 bushels, of which 450,000 bushels have been delivered to your Company at Ogdensburg, and are now in transit; when all contracts made up to 31st August have been delivered this Company will have carried 1,617,000 bushels, of which only 558,000 have been taken for Ogdensburg.\n\nIn reviewing this volume of traffic and measuring its value representing as it does something approaching to one and three-quarters million bushels of Western grain handled by us between the 21st April and 31st August, I am free to confess that were my Company ever so prosperous I should (were it offered to me by any Westward connections as we have offered it to you), regard it as of sufficient importance to suggest the most anxious and conciliatory consideration, and I should watch with great solicitude for every opportunity for nursing and strengthening such a valuable contribution to my traffic.\n\nMr. Pratt says, \"Mr. Hungerford asserts that the Collingwood route is quite equal to that of the Northern Transit Company for Western-bound freight with rates the same—the assertion is too absurd to require an answer. Every man engaged in business and every freight Agent will say that the two Lines placed side by side with the same rates, the Collingwood Line could obtain little or no business as against the Northern Transit Company.\"\nBy this gratuitous observation, Mr. Pratt shews his hand and exposes his sympathies and policy, for if it means anything it means that your Company should exclusively deal with the N. T. Company to the rejection of all others.\n\nI decline to engage in comparison between the Collingwood Line and the N. T. Company, which like my own is an old established, and I believe a respectable organization, but I protest against the depreciatory language indulged in by Mr. Pratt, and I appeal to you against the policy it exposes and which would ignore the very theory and principle upon which (as I remember when your Line was first opened) your undertaking was originally established, namely, \"free access to the Lakes and to the traffic which such a connection with the great inland waters would imply,\" for Mr. Pratt's idea and action suggests the notion that you should have but one and an exclusive connection on the lakes to the persistent rejection of all others. As well might the New York Central Company, because it has close relations with the Lake Shore Road, reject and belittle the important traffic brought to it by the Great Western, the Canada Southern and other Western Lines, as that you should build a Chinese wall against all other contributions to your business than that afforded by the N. T. Company, be the latter ever so valuable.\n\nI confess that this assault of Mr. Pratt's, taken in connection with his secret negociation (after closing with us) for a supplementary contract with the N. T. Company (for whom previously he had no words sufficiently condemnatory) with the appointment of his son as the Agent of your Company, and his establishment in the N. T. Offices, and with the ultimate and determined repression of all business between us,—seem to point to a settled intention on his part to limit your operations on the northern waters to that Company.\n\nBut it would be an impertinence on my part, even under the provocation of Mr. Pratt's gratuitous hostility, to pursue the discussion which he challenges. The interests of your Corporation are in your hands and not in mine, and you will best know how to pass judgment upon a policy which would limit your operations within so narrow a sphere.\n\nI think I have now covered the whole ground of this miserable controversy. Nothing but respect for your Committee and regard for the standing and interests of my own Company would\nhave induced me to travel over the dreary paths of this disreputable history; but I hope that notwithstanding the obstructions and disappointments by which the relations between our companies have been beset that the future may still be allowed to justify the hope that we may work together to mutual advantage.\n\nI cannot close without making some reference to Mr. Pratt's complaint that \"it is a significant fact that while he (Mr. Pratt) has acted in this whole business under the contract as explained by Mr. Hungerford, that no word of censure has been made or implied by Mr. Cumberland against Mr. Hungerford, it is all against him (Mr. Pratt). Let Mr. Cumberland (he says) \"in addition to the correspondence printed in his pamphlet furnish us with all the correspondence both by telegraph and by letter,\" (the italics are Mr. Pratt's) \"between him, Mr Kerr and Mr. Hungerford, since January last: we may then see the inner working and meaning of this whole business.\"\n\nIn reply to this I beg to say that all the correspondence thus referred to is entirely at the disposal of your Committee, and that I will take care it is forwarded to you for perusal, and I think it will be accepted as shewing that Mr. Hungerford has been energetic in promoting and vigilant in protecting the interests of your Company, that he has been subjected to most vexatious obstruction and tyrannous coercion by his President, and that the only rebuke to which he is perhaps somewhat open, is that he lacks the backbone to resist with the persistence with which it ought to be resisted, the spirit of intrigue and nepotism by which his superior officer seems to be governed. He has, as I believe, been trying to do his duty loyally to his Company without raising an issue with his President, but I venture to think that he would have compassed his duty better had he feared the issue less. At any rate there are no secrets in the correspondence to justify the ungenerous imputation which Mr. Pratt casts upon Mr. Hungerford.\n\nShould your Committee desire to pursue their enquiries of me personally, I shall be happy to attend at Boston at any time on receiving reasonable notice.\n\nI have the honor to be; with much respect,\n\nYour obedient servant,\n\nFRED. CUMBERLAND,\nManaging Director, Northern Railway of Canada.\nThe publication of the opinions of the Supreme Court is intended to facilitate the study of its decisions.\n\nIn the case of Mr. Justice Brandeis' dissenting opinion in the case of United States v. Eichman (1943), he expressed his views on the question of whether the government had the right to compel individuals to bear arms during a war.\n\nJustice Brandeis argued that the government's power to compel individuals to bear arms during a war was not justified by the Constitution. He believed that the government should respect the rights of individuals to bear arms and should not force them to do so.\n\nJustice Brandeis' dissenting opinion has been widely discussed and debated since its publication. Many people have disagreed with his views, while others have supported them.\n\nIn conclusion, Justice Brandeis' dissenting opinion in the case of United States v. Eichman is an important contribution to the study of constitutional law. It provides insight into the debates surrounding the issue of individual rights and the role of the government in protecting those rights.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25143.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 44544, "total-output-tokens": 12413, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2402, 3], [2402, 4840, 4], [4840, 4840, 5], [4840, 5055, 6], [5055, 6878, 7], [6878, 9206, 8], [9206, 11526, 9], [11526, 13899, 10], [13899, 16428, 11], [16428, 18711, 12], [18711, 21014, 13], [21014, 23404, 14], [23404, 25713, 15], [25713, 28066, 16], [28066, 30362, 17], [30362, 32912, 18], [32912, 35296, 19], [35296, 37635, 20], [37635, 39968, 21], [39968, 42431, 22], [42431, 44777, 23], [44777, 47179, 24], [47179, 49476, 25], [49476, 50551, 26], [50551, 50551, 27]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]