[{"id": "7c542312a68ef45228ac562461ba83f969ae4026", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/\nCommentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nNational Library of Canada\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nBibliothèque nationale du Canada\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nA CRY FROM THE SASKATCHEWAN\n\nMy pale-face brothers, I am no longer young\nAnd hot of blood like the young buffalo\nSeeking a foe. The wind, long winters past,\nThat rocked the cedar and pine that made your cradles,\nCooled my breast and drifted snow-flakes in my hair.\n\nMore than a thousand moons I've seen take shape,\nLike to fair slender daughters of your race,\nThat love rounds into perfect symmetry.\nYes! I am old, and soon shall lay me down,\nAnd calmly wait the unseen messengers\nWho will clasp my hands and make me young again,\nAnd bear me to wide plains, and forests deep,\nThat shall for ever bud and blossom untilled.\n\nO brothers, I have ever been your friend,\nI have not sat within the Shabandoan\nIn moody silence, when the barking dogs\nTold me some stranger to my race appeared.\nNay! I have arisen, and come with open hands\nTo meet him, and make him welcome to my fire,\nAnd laid the fairest matting for his rest.\nAnd with these hands that knew not how to serve,\nHave I prepared the best that stream or plain\nCould yield, to satisfy his hungered lips.\nUpon these withered hands is there a stain\nOf the bright life-blood of your favoured race?\nAy, one, and only one. It is a tale\nSo short it scarce can weary.\n\nHe came to us,\nLost, frozen, starving, and I said, \"O Son,\nWhether there be scant or plenty you shall share.\"\nAnd all the native skill I had to cure\nThe ills and accidents that do befall my people,\nI lavished on him; and he lived with us,\nAnd all the arts, that you call rude, he learned.\nHis hand could set the snare, could carve the pipe,\nCould bend the bark to the swan-breasted craft;\nCould dip its cedar wing in the treacherous waves\nOf giddy rapids, and bring it safely curving\nUp the swift-backing eddy, where he could poise\nHis spear a moment, like a fatal shaft\nFrom the Great Spirit's quiver; then strike and lift\nWith one continuous unerring motion,\nFrom the blood-dabbled wave, the river chieftain.\nAll this, and more, these lips and hands of mine\nTaught him, as though he were my flesh and blood.\n\nOne child I had, more than the rest I loved,\nHer mother's latest love and pain and joy,\nMade sacred by the life-blood of that mother,\nSplashed on its little face on wild dark night\nWhen my tribe's deadly foe came down on us.\nShe grew like the red willow swaying in the wind,\nAs lithe, as strong, as supple. Oh! her lips\nWere like the rich frost-darkened berry unplucked;\nHer eyes, such as I've seen when suddenly,\nIn the deep winding of a forest trail,\nIn early spring I have met a startled doe\nWandering alone—I could not wing a shaft—\nThe same sweet eyes in wonder, fear and love.\n\nHe left us to go eastward to his people,\nAnd come again when our long, pointed shoes\nWould make swift knifelike slashes on the bosoms\nOf glistening snow-drifts. But, when he was gone,\nI found her moaning near the river bank,\nAnd gazing in the waters and drawing nigher,\nAnd looking over into a foaming pool\nWhere once I saw whirl for a moment, and crush,\nA bark canoe, and a great chieftain's arms\nThrown upward, and then pass away for ever.\n\nI caught her arm and looked within her eyes,\nAnd they were like her mother's, when first she knew\nA son of hers might some day go to battle;\nExcept that these swam with cloud-shadowed tears,\nAnd those with drops that glistened in the sun.\nI said no word; but to her brothers' care\nI gave her. Then with quiver full, and tomahawk,\nAnd hunting knife keen-edged, alone I went\nMore swiftly than a winged arrow, or flight\nOf southern-flying crane; upon his trail.\nAnd he had travelled with a coward heart\nThat lent swift wings unto his flying feet;\nBut mine were borne by hurricanes of hate.\nAnd on the second day, as I pressed through\nThe last thick willow growth of a great swamp,\nThere stood he, a score of bow lengths from my hand.\nHis ear had caught the sound of breaking stems,\nAnd turning full about, his swart face grew\nLike a last summer's sapless sun-dried leaf;\nWhile round the haft of a knife that once was mine,\nHis fingers made a quick convulsive clasp,\nThat proved him traitor. I was in no mood\nTo even the odds of fight that favoured me.\nI flashed a long, barbed arrow from the sheath,\nAnd running forward, set it in the string,\nAnd drew it, with the strength of Nana, to the head;\nBut all too madly, for like a withered rush,\nThe bow snapt, and the barb drew back and tore\nA furrow in my hand that spurted blood.\nHe gave a mocking laugh, for now the odds\nWere even, and he was young and broad and strong.\nI stopped not; had the arrow sped aright,\nI think my blade would have drink blood as soon.\nHe made a blow or guard, I know not what,\nBut I was blown upon him like a pine\nReft from a mountain, and he fell without a cry.\nI tore the bleeding trophy from his head,\nAnd turned me back unto my desolate camp.\n\nThe sun was going down behind the hills,\nAs I strode to my wigwam. Entering there\nI found her sitting, rocking to and fro\nAnd chanting over a charm of beads and shells.\nShe looked up with lips parted like one athirst.\nI knew not what I did, for still I raged,\nAnd throwing down the tuft of bloody hair\nNigh to her, then paced me to the door,\nAnd turning, said, half fiercely: \"Minnota! Child!\nA lock of lover's hair I bring you back.\"\n\nShe was my race, my blood in very truth!\nShe made no moan, nor cry, nor any sign\nOf her intent; but reaching slowly out,\nPicked up the shrivelling skin and gazed at it\nFor one long moment; then, into my eyes;\nThen let slip back, from her shining shoulders\nThat were red golden with a shaft of flame\nShot from the hills, the blanket that was caught\nAcross her bosom, and with her left hand laid\nThe lock beneath the swelling of her ripening breast,\nAnd swinging her right arm with a swift flash,\nPinned it there with a bright blade, and felt back.\nShall I tell you more? Nay, there is no more.\nThe sun of my life went down behind those hills,\nAnd left me nothing but twilight and dark night.\nOh! I was like a mountainside bereft\nOf its fresh verdure by a summer frost.\nI planned a terrible revenge for this,\nThat would have swollen a river high with blood;\nBut once, a motherless infant of your race\nSmiled in my face and turned me from my purpose.\n\nAnd thus, O my white brothers, I have not\nDone one of all your race a single wrong.\nHow many of your race have injured mine,\nHow many of mine have made a red return,\nI know not, but that wrongs forever cry.\nBut I am old and guided not by passion,\nAnd I have striven to learn and know your ways.\nI have loved many of you, as I loved my own;\nAnd I would my race could at a simple bound,\nLeap the great ocean of change that you have crossed\nAfter a thousand years of buffetings.\n\nI know of your traditions but an echo,\nYet if it be the truth, it tells me this:\nThat you have come through gradual years of change\nTo commune now with strange mysterious powers,\nFrom the high pinnacle where I see you stand.\nLike a long journey from the Eastern plain\nFor ever rising higher to the West,\nUntil the mountains lift their heads into the sky,\nAnd see forever the golden sides of clouds.\nI would that we could stand beside you there;\nBut the way is long and weary to our feet;\nAnd we must rest upon a thousand slopes\nBefore we touch the mountains where you stand.\n\nO, my white brother, you have wronged us much—\nMayhap unwittingly, yet are we wronged.\nDoes not the glancing arrow from a brother's bow\nBury its fang as deep within the breast,\nAs if a vengeful arm had strained the sinew?\n\nBut there are those who hate us—I know not why—\nWhose lives seem nothing but a violent hate\nOf all things time and custom have made revered;\nAnd others, who say they truly pity us,\nBut that we idly stand upon the way\nOf a great something that they call progress,\nThat like the shrieking, fire-breathing demon,\nThat drags your luxury across the earth,\nMangles the child that wondering stands to gaze.\n\nFar back before my earliest memory,\nBefore my father's, came people of your race,\nWith twofold object. Some there came to trade\nAnd give in barter for fur-coated skins,\nClothing and food, and swift death-breathing weapons,\nAnd deftly fashioned snares, whereby we brought\nGreat store of wealth and happiness to them;\nWho gave us value as we counted worth.\n\nAnd there came others garmented in black,\nWho sought no recompense for what they gave.\nThey told us of a new God, and his Son\nWho died that we might live forever anew,\nIn some fair after-life.\n\nAnd those who bought\nOur beaver-skins were also of this faith,\nAnd we believed them and were satisfied.\nAnd there came many who joined their lives with ours,\nWho brought from you some learning of your race,\nWho caught from us the love of boundless freedom,\nAnd these two races side by side, perchance,\nWere walking slowly towards your higher life.\n\nYet, I can see not that the new belief\nIs better or purer than the one we held.\nWe worshipped one great, everlasting Spirit,\nWho, like a chief, ruled lands beyond the grave:\nWe strove to quell within the throbbing breast,\nAll trembling fear, and fit ourselves to join\nIn the heart-lifting dangers that our fathers\nRejoice to combat in the happy hunting grounds.\nWe taught a stern creed, giving blood for blood.\nBlood for a broken word: it was the one,\nThe only final penalty for all wrong.\nThe culprit was not hedged and fenced about\nWith laws so nicely intertwined and balanced,\nThat each might counteract and dull the effect\nOf the other. Nor any new law made we,\nTagged like a new line to a rotten one,\nWhich latter, breaking at the ravelled flaw,\nGives freedom to the captive struggling fish:\nOur laws were simple with full, swift effect.\n\nAnd now I think you weary of and chafe\nAgainst the doctrines that you taught us first,\nThe doctrines of your gentle, peace-loving Christ,\nWho wore upon his brow a crown of thorns.\nAnd you have made yourselves another Christ,\nThis Progress, crowned with iron, and fire and gold;\nAnd all who will not turn and follow him,\nMust go down beneath his iron feet, and die.\n\nThere came a time when many of your race\nBuilded their wigwams along the eastern rim\nOf our great prairie that stretches like a world:\nBuilt on the fertile bank of a broad stream.\nAnd there were many there who joined with us\nAs others had before. And so we lived in peace.\nThen came a day, when we were told that these,\nOur own true brothers bound to us by blood,\nHad risen against you, and broken some new fetter\nThat you had made to bind them to one spot,\nBut you had ever spoken kind words to us,\nAnd so we lifted not a hand to strike.\nAnd you picked up the broken fetter that fell,\nAnd welded it for those who fled not west.\nBut your new Christ followed, and followed, and followed.\n\nAnd then, at last, you came unto our doors,\nGorgeous in dress of crimson and blue and gold,\nAnd held out to us, on sharp points of steel,\nA treaty by which we madly gave to you\nOur fair illimitable hunting ground;\nAnd got a scant meal, that leaves the belly starved,\nAnd a small plot where we may make our graves.\n\nI know but little of your past traditions;\nBut I have heard, that for a thousand years\nYour people have been skilled in making treaties\nAnd keeping them—if thereby you profited.\nO my white brothers, glad am I this arm\nIs weak, and that my blood is slow and cold;\nFor I have smoked with you the pipe of peace,\nAnd I have taken your hand within my own,\nAnd called you my white brother and my friend:\nSo will I die and violate it not.\nBut my eyes are opened, and though very dim,\nSee both together, the future and the past.\n\nWhy did you come not to us at first and say,\n\"My brothers, in our land beyond the waters,\nOur wives and children gasp for the pure air\nIn crowded wigwams; and the chiefs who rule,\nWould bind a starving beggar if he dared\nTo fill his cavernous belly with the food\nThat his own hand had slain upon the hills.\"\nWhy came you not to us, saying openly:\n\"Give us some portion of your boundless plains,\nYour forests, lakes and streams; and we will come\nAnd build a nation by your side, and teach\nYour children what they care to learn of us;\nAnd draw the limit line that shall divide\nOur people from your people, our land from yours—\nOnly to mark the ownership—for our hands\nWill stretch across to yours, and our grateful hearts\nWill ever be with you in your wandering camps.\nWould we have turned you from us? I trow not.\nHave we not given you all, for leave to die.\n\nI know not of myself; but one of my race\nWho learned the signs and symbols of your tongue,\nTold me that in those great leaves of knowledge\nScattered, each sun, abroad among your people,\nThere are many burning and ungrateful words,\nCalling us a useless and a dying race,\nThat soon must pass and leave the land to you.\n\nYes! my brothers, we are a dying race.\nDying of the very poison that you brought\nAnd bartered with us for our native wealth.\nThen turned you homeward to warm luxury,\nLeaving us stretched upon the frozen plain—\nDying of the diseases, O my brothers!\nThat you have brought into our stainless blood.\n\nHark! O my brothers, I hear a cry, a shriek,\nAnd there are crimson stains upon the snow.\nThere will be pools of blood in the spring grass.\nSee, the half-brothers of my blood once more\nHave broken their fetters, and set the arrow straight,\nAnd drawn it to the head—I hear it sing—\nStand back! or many of your race will weep.\n\nI have no part in this, I am too old;\nBut I have many sons, and their sons sons.\nI know not whether they will cast themselves\nUpon the glittering edge of strife, and die,\nLike their forefathers in the golden past;\nOr whether they will fold their hands and sicken,\nAnd drop like rotting branches, one by one.\nI see the cloud that blackens in the East,\nI hear the murmur of the coming storm\nOf blinding hail borne on a pitiless wind.\nBut, O my brothers, the storm winds of these plains,\nBlow not one way alone, but turn and whirl,\nSweeping from you to me, then back again,\nAnd smiting every face with their wild hands.\nAnd this storm shall rage forward and backward,\nAnd jagged lightning strike all sides alike.\nOh! the Ocean will thirst for the cool, fresh rivers,\nFor the streams will be salt with the tears of women.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30312.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33568, "total-output-tokens": 5045, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1541, 3], [1541, 4054, 4], [4054, 4054, 5], [4054, 4054, 6], [4054, 5022, 7], [5022, 6261, 8], [6261, 7346, 9], [7346, 8657, 10], [8657, 9811, 11], [9811, 10994, 12], [10994, 12059, 13], [12059, 13151, 14], [13151, 14272, 15], [14272, 15400, 16], [15400, 16522, 17], [16522, 17631, 18], [17631, 18141, 19], [18141, 18141, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]