[{"id": "0f5ad926a306066cd10189a191012ab9309aad2b", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol \\(\\rightarrow\\) (meaning \"CONTINUED\"), or the symbol \\(\\nabla\\) (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\nMR. DAVIN\n\nON\n\n\"Fanuing in Church.\"\n\nAND\n\nADDISON AND STEELE\n\nON THE\n\nUSE OF THE FAN.\n\nEDITED BY\n\nNICHOLAS FLOOD DAVIN, ESQ.,\n(Of the Middle Temple, Barrister-at-Law,)\nAuthor of \"France and Germany,\" (January, 1871,) &c., in Westminster Review—formerly of The Star, Pall Mall Gazette, &c., &c.\n\nTORONTO:\nGlobe Printing Company, 26 & 28 King Street East.\n1874.\nA newspaper which has attained a high character for truthfulness, and for the dignity and ability with which it is conducted, lately published an article in which the following sentence occurs:—\"More than once of late an editorial writer on the Globe has been shown to have palmed off in the columns of that journal articles on such subjects as 'Fanning in Church,' 'Dancing,' &c., taken almost bodily from the pages of the old British Essayists, and without acknowledgment transferred to those particular columns which are supposed to be devoted to original articles.\" (Mail, Oct. 30th, 1874.) To test the accuracy of this statement, let us take the first article mentioned, \"Fanning in Church,\" which appeared in the Globe, June 13th, 1874. I am the author of that article. A great paper, such as that of which I am one of the editors, cannot stoop to notice things of this sort. But I now throw off the veil of anonymity, which has not been respected—and which I wish, for my own part, I could always discard. Not only do I print my own article on \"Fanning in Church,\" but I print all that ever appeared in the Spectator on the fan and fanning. There is no use in wasting another word on a matter which is only one among thousands of instances which show into what skilful and honorable hands the conduct of our newspapers has in great part fallen. It may however be said that the charge of plagiary—which has been made against almost every eminent writer who has claimed the attention of the public—is a compliment in disguise; for nobody will accuse you of stealing what is of no value. I think I know a newspaper, and an editor, whose articles will never be charged with the taint of plagiary. I may also express my regret that I have to treat an ephemeral production, such as an article in a daily paper, as if it was literature, and to place it side by side with the essays of two writers such as Addison and Steele, whose work was produced under conditions more favorable to intellectual activity than those enjoyed by the literary omnibus horses who \"run\" a newspaper throughout the year.\nII.\n\nDAVIN.\n\nFANNING IN CHURCH.\n\nThe warm weather is now come, and the ladies who ply their fans in church, and whom we shall take leave to call the Fanning Sisterhood, are as busy as ever they can be—when they are not at Church they practice, and when they are there they work away with the energy of people who might think fanning the end of existence, and who remembered only one text in the Bible, to wit, \"Time is short.\" The Fanning Sisterhood is a Catholic society, and embraces all types of \"the adorable half of the human race,\" all ages and nearly all sects. The gaunt spinster, the lady of the dumpling order, she whose soul seems to flame through the attenuated cage of the body, and she whose immortal spark is comfortably housed in circumvallations of massive adipose tissue, belong to this society of artificial and unnecessary wind manufacturers. Within its folds, too, are found the agreeable old lady of seventy, and the more agreeable young lady of seventeen; matrons of thirty are there, and mademoiselles of that most uncertain of all things—a certain age. The High Church lady who would think her soul was lost if she read out of a prayer-book without a cross on the cover, the Low Church terror of curates who shakes her fist at the young colyte who is not sound, the gentle Methodist that wafts a sigh across the Atlantic after Mr. Punshon, the fair Independent who \"sits under\" her favorite minister, the Presbyterian lady whose features recall the \"banks of Doon,\" or \"rocks that steeply lower\" in the \"land of mountain and of flood\"—all these and many other varieties are found in the ranks of the Fanning Sisterhood. And as the classes from which these ranks are recruited are various, so also are the degrees of success attained, just as we fear the objects in view are different, for it may be laid down as an infallible rule that no lady who flirts a fan in church has a single eye; on the contrary, she generally has two active orbs engaged now in ogling, now in taking an inventory of the costume of all around her, now in playing the peeper on some little episode which she does not improve by noticing, and now in gathering to herself an air of rapt levitation while watching out of a sly corner to count her admirers. Considering the strength of the society, and the importance which the fan has assumed as an instrument of religious worship with ladies, it is astonishing to us that they have not insisted, as only ladies, and especially religious ladies, can insist, that clergymen should give a little attention to this matter. But up to the present—no doubt owing to the greater modesty which, as compared with the rest of female creation, characterizes the Fanning Sisterhood—nothing has been done. We have inquired, and we find that at not a single one of the Sunday schools in this city is there a class for teaching girls how to use their fans in church. This must be considered a crying want, since the chief act of devotion of most of our ladies—for the Fanning Sisterhood is a large body—is plying their fans.\n\nHere is an opportunity for reforming energy, and we sincerely hope our clergy will not sleep over the matter. Indeed, not only is it necessary\nto instruct young ladies how to use a fan while engaged in devotion; we hope the youthful mind of both sexes will be accustomed to the exercise, and for at once an obvious and a weighty reason. Everybody knows what a slave of association man is, and when a person has not been duly instructed in the solemn nature of the manipulation of a fan, he is apt to think it frivolous, and to be not a little shocked at the incongruous spectacle of a lady confessing audibly that she is a miserable sinner, or praying aloud to be delivered from appalling calamity, and at the same time indulging in movements which are associated in most minds with gay carnival scenes, with the Spanish balcony, and the stolen interview, and the compliant duenna; with Italian evenings of holiday; with syren smiles and looks sweet and dangerous to trust. A sensible farmer, who has lately come to live in this city and has a family of lovely daughters, leaving St. James' last Sunday morning expressed determination to send the next day for a dancing-master; \"for,\" said he, \"I wish to have my daughters conduct themselves properly in church, and I suppose a dancing-master will know all about this fan business.\" The sooner the wise resolve of this good agriculturist is followed the better. Ever since the hot weather came, a large number of persons leave all the churches in this city quite unrefreshed and peevish because their devotions have been disturbed, and their attention to an excellent sermon—all our sermons are excellent—distracted by one or more of the Fanning Sisterhood. \"What!\" exclaimed an uninstructed person to whom we wished to explain that fanning in church was the choicest development of sincere female piety, \"What, Sir! It is enough to drive an honest man mad to see a gaily dressed woman kneeling and pouring forth responses to the litany, while she plies her fan in a languishing manner and shoots philandering glances over the fantastic scollops of the fashionable abomination.\" Another gentleman complained that his grievance was that the fans were used so unartistically. This gentleman had travelled in Italy, where fan language is daily intercourse—where you may be invited to sup or serenade by a movement of the delicate female appendage, and where it is carried with exquisite nicety and grace.\n\nAll this points clearly to having a class under the direction of the minister of the church for teaching young ladies how to make use of the fan when engaged in devotion. And also instruction for young men, so as to have them avoid misconception. It is clear that the carriage of the fan should be different when entering church from that which is suitable when the service commences, and again how to hold it when a hymn of triumph is sung must be the very antithesis of the suitable manner when making a pathetic confession, or engaged in fervent prayer. We must therefore recommend this question to those who get up movements for the better ordering of our religious services. Let there be a tea meeting presided over by the leading members of the Fanning Sisterhood, and let them at once set on foot rewards for those who can use their fans best, and a means of educating not merely their own sex in the proper way of plying the fan, but also the other sex into an appreciative mood.\n\nPerhaps we are cowardly in our project of reform. There is an old rough proverb that \"What is good for the goose is good for the gander,\" and if the fan really cools and ministers to devotion, why should there not\nbe a Fanning Brotherhood as well as a Fanning Sisterhood? But here we are met on the part of the men with an objection which actually strikes—we tremble as we write the words—at the use of the fan altogether? Medical authorities are against its use, on the ground that a draught artificially created by a fan will give a person cold as soon as any accidentally occurring draught. We sincerely hope this is not the case. But it is impossible to ignore the authorities in favor of the theory. The choice then is between a fashionable adjunct of piety, and health; or, to put it more properly, simplicity and health against fashionable piety and a cold in the head. And here another element comes in—the element of beauty—an element not utterly disdained by the Fanning Sisterhood. A young lady with a cold in her head and a damp pocket-handkerchief in her pocket, is, however good her looks, without lines of the ridiculous. It is true she might have some advantage from the High Churchman's point of view—and of her it might be said, as of the Abbess in the Canterbury Tales, that she could intone the service full sweetly through her nose. Yet anything that directly causes harm to the body we may be sure cannot do good to the soul, and therefore cannot be pleasing to the author of both. It is barely possible, therefore, that it would be well if the Fanning Sisterhood would review the question whether the fan is or is not a Divine institution, and if they should find out that it is not, and that by disusing it in church they will at once cease to imperil their health and disturb the preacher and the congregation, all the elaborate schemes of fan cultivation which we have been revolving may be laid on one side with the disused fan.\n\nIII.\n\nADDISON.\n\n(Spectator, No. 102.)\n\nMR. SPECTATOR,\n\nWomen are armed with fans as men are with swords, and sometimes do more execution with them. To the end, therefore, that ladies may be entire mistresses of the weapon which they bear, I have erected an academy for the training up of young women in the exercise of the fan, according to the most fashionable airs and motions that are now practised at Court. The ladies who carry fans under me are drawn up twice a day in my great hall, where they are instructed in the use of their arms, and exercised by the following words of command:\n\nHandle your fans,\nUnfurl your fans,\nDischarge your fans,\nGround your fans,\nRecover your fans,\nFlutter your fans.\nBy the right observation of these few plain words of command, no exercise for the space of but one half year, shall be able to give her fans all the graces that can possibly enter into that modish machine.\n\nBut to the end that my readers may form to themselves a right notion of this exercise, I beg leave to explain it to them in all its parts. When my female regiment is drawn up in array, with every one her weapon in her hand, upon my giving the word to handle their fans, each of them shakes her fan at me with a smile, then gives her right-hand woman a tap upon the shoulder, then presses her lips with the extremity of her fan, then lets her arms fall in an easy motion, and stands in a readiness to receive the next word of command. All this is done with a close Fan and is generally learned in the first week.\n\nThe next motion is that of unfurling the fan, in which are comprehended several little flirts and vibrations, as also gradual and deliberate openings, with many voluntary fallings asunder in the fan itself, that are seldom learned under a month's practice. This part of the exercise pleases the spectators more than any other, as it discovers on a sudden an infinite number of cupids, garlands, altars, birds, beasts, rainbows, and the like agreeable figures that display themselves to view, whilst every one in the regiment holds a picture in her hand.\n\nUpon my giving the word to discharge their fans, they give one general crack that may be heard a considerable distance when the wind sits fair. This is one of the most difficult parts of the exercise; but I have several ladies with me who at their first entrance could not give a pop loud enough to be heard at the further end of the room, and can now discharge a fan in such a manner that it shall make a report like a pocket pistol. I have likewise taken care (in order to hinder young women from letting off their fans in wrong places or unsuitable occasions) to show upon what subject the crack of a fan may come in properly; I have likewise invented a fan with which a girl of sixteen, by the help of a little wind which is enclosed about one of the largest sticks, can make as loud a crack as a woman of fifty with an ordinary fan.\n\nWhen the fans are thus discharged, the word of command in course is to ground their fans. This teaches a lady to quit her fan gracefully when she throws it aside in order to take up a pack of cards, adjust a curl of hair, replace a falling pin, or apply herself to any other matter of importance. This part of the exercise, as it only consists in tossing a fan with an air upon a long table (which stands by for that purpose), may be learned in two days time as well as in a twelvemonth.\n\nWhen my female regiment is thus disarmed, I generally let them walk about the room for some time; when on a sudden, (like ladies that look upon their watches after a long visit) they, all of them, hasten to their arms, catch them up in a hurry, and place themselves in their proper stations upon my calling out, \"Recover your fans.\" This part of the exercise is not difficult, provided a woman applies her thoughts to it.\n\nThe fluttering of the fan is the last, and indeed the masterpiece of the whole exercise; but if a lady does not mis-spend her time, she may make herself mistress of it in three months. I generally lay aside the dog-days and the hot time of the summer for the teaching this part of\ncommand, he exercise; for as soon as ever I pronounce, \"Flutter your fans,\" the face is filled with so many zephyrs and gentle breezes as are very refresh-\ning in that season of the year, though they might be dangerous to ladies\nof a tender constitution in any other.\n\nThere is an infinite variety of motions to be made use of in the flutter\nof a fan. There is the angry flutter, the modest flutter, the timorous\nflutter, the confused flutter, the merry flutter, and the amorous flutter.\nNot to be tedious, there is scarce any emotion of the mind which does not\nproduce a suitable agitation in the fan, insomuch, that if I only see the\nface of a disciplined lady, I know very well whether she laughs, frowns, or\nrushes. I have seen a fan so very angry, that it would have been\ndangerous for the absent lover who provoked it to have come within the\nwind of it; and at other times so very languishing, that I have been glad\nfor the lady's sake the lover was at a sufficient distance from it. I need\nnot add, that a fan is either a prude or coquette according to the nature of\nthe person who bears it. To conclude my letter, I must acquaint you\nthat I have, from my own observations, compiled a little treatise for the\nuse of my scholars, entitled, \"The Passions of the Fan;\" which I will\ncommunicate to you, if you think it may be of use to the public. I shall\nhave a general review on Thursday next; to which you shall be very\nwelcome if you will honour it with your presence.\n\nI am, &c.\n\nP.S.—I teach young gentlemen the whole Art of Gallanting a Fan.\n\nN.B.—I have several little plain fans made for this use, to avoid ex-\npense.\n\nL.\n\nSTEELE.\n\n(Spectator; No. 134.)\n\nJuly the 5th, 1711.\n\nSir,—In your Spectator of June the 7th, you transcribe a letter sent to\nyou from a new sort of master-master who teaches ladies the whole exercise\nof the fan; I have a daughter just come to town, who, though she has\nalways held a fan in her hand at proper times, yet she knows no more\nhow to use it, according to true discipline, than an awkward school-boy\ndoes to make use of his new sword. I have sent for her on purpose to\nlearn the exercise, she being already very well accomplished in all other arts\nwhich are necessary for a young lady to understand; my request is, that you\nwill speak to your correspondent on my behalf, and in your next paper, let me\nknow what he expects, either by the month, or the quarter, for teaching; and\nwhere he keeps his place of rendezvous. I have a son too, whom I would\nhim have taught to gallant fans, and should be glad to know what the\ngentleman will have for teaching them both, I finding fans for practice at\nmy own expense. This information will in the highest manner oblige,\n\nSir,\nYour most humble Servant,\nWILLIAM WISEACRE.\nAs soon as my son is perfect in the art (which I hope will be in a year's time, for the boy is pretty apt), I design he shall learn to ride the great horse (although he is not yet above twenty years old), if his mother, whose darling he is, will venture him.\n\nTO THE SPECTATOR.\n\nThe Humble Petition of Benjamin Easie, Gent, Sheweth:\n\nThat it was your petitioner's misfortune to walk to Hackney Church last Sunday, where, to his great amazement, he met with a soldier of your own training; she furls a fan, recovers a fan, and goes through the whole exercise of it to admiration. This well-managed officer of yours has, to my knowledge, been the ruin of above five young gentleman besides myself, and still goes on laying waste wheresoever she comes, whereby the whole village is in great danger. Our humble request is, therefore, that this bold amazon be ordered immediately to lay down her arms, or that you would issue forth an order, that we who have been thus injured may meet at the place of general rendezvous, and there be taught to manage our snuff boxes in such a manner as we may be an equal match for her.\n\nAnd your petitioner shall ever pray, &c.\n\nIV.\n\nThe reader can now judge of the good faith of the writer who has led me to trouble him with these republications. In all other cases, as in this, the charge made is totally false. To abuse, written under whatever impulse and with whatever object, I do not reply; if I did, he may be certain it would not be in worn out phrases of musty vituperation.\n\nTHIS BOOK MAY NOT BE TAKEN FROM THE LIBRARY.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25144.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 21534, "total-output-tokens": 5245, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 944, 3], [944, 2138, 4], [2138, 2498, 5], [2498, 4597, 6], [4597, 7798, 7], [7798, 11311, 8], [11311, 13759, 9], [13759, 17166, 10], [17166, 19923, 11], [19923, 21484, 12], [21484, 21484, 13]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, true]}}]