[{"id": "f13909c445b08aa8981a05a1c7d2bd7c3fb50941", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e. other than blue or black)/\n  Encre de couleur (i.e. autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [ ] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nReport of the Synod\nOF THE\nDIOCESE OF RUPERT'S LAND.\n\nAUGUST 5, 1886\n\nWITH AN APPENDIX\nCONTAINING\nTHE ACTS OF INCORPORATION\nAND OTHER IMPORTANT DOCUMENTS.\n\nWINNIPEG:\nMANITOBA FREE PRESS PRINT.\n1886.\nCommittees of the Synod, 1886.\n\nN. B.—The Bishop is ex-officio a member of all Synod committees.\n\nTHE EXECUTIVE COMMITTEE:\n\nCLERGY:\nDean Grisdale,\nArchdeacon Cowley,\nArchdeacon Pinkham,\nCanon Matheson,\nRev. O. Fortin,\nRev. E. S. W. Pentreath,\nRev. T. N. Wilson,\nCanon O'Meara,\nRev. M. Jukes,\nRev. W. A. Burman,\nRev. H. H. Barber.\n\nLAITY:\nMr. C. J. Brydges,\nMr. H. M. Howell,\nHon. Sheriff Inkster,\nMr. H. S. Crotty,\nMr. J. Wrigley,\nHon. Judge Walker,\nMr. W. R. Mullock,\nMr. F. H. Mathewson,\nMr. W. B. Hall,\nHon. J. Norquay,\nMr. J. W. H. Wilson.\n\nDELEGATES TO THE PROVINCIAL SYNOD:\nCanon Matheson,\nDean Grisdale,\nArchdeacon Cowley,\nRev. O. Fortin,\nArchdeacon Pinkham,\nRev. E. S. W. Pentreath\nCanon O'Meara.\n\nCOMMITTEE ON THE METROPOLITICAL SEE:\nDean Grisdale, Convener,\nArchdeacon Cowley,\nArchdeacon Pinkham,\nRev. O. Fortin,\nRev. E. S. W. Pentreath.\n\nSTANDING COMMITTEE ON CREDENTIALS:\nArchdeacon Pinkham, Convener,\nRev. A. E. Cowley.\n\nCOMMITTEE ON CANONS:\nDean Grisdale, Convener,\nArchdeacon Pinkham,\nCanon O'Meara,\nRev. O. Fortin,\nRev. E. S. W. Pentreath.\n\nCOMMITTEE ON SUNDAY SCHOOLS:\nArchdeacon Pinkham, Convener,\nDean Grisdale,\nCanon Matheson,\nRev. E. S. W. Pentreath,\nCanon Coombes,\nCanon O'Meara,\nRev. H. H. Barber.\n\nCOLLEGE COMMITTEE:\nDean Grisdale, Convener,\nCanon O'Meara,\nCanon Matheson.\n\nCOMMITTEE ON CHURCH DEPOSITORY:\nDean Grisdale, Convener,\nArchdeacon Pinkham,\nCanon O'Meara,\nRev. O. Fortin,\nRev. A. E. Cowley,\nRev. E. S. W. Pentreath.\n\nMr. T. Gilroy.\n\nMr. C. J. Brydges,\nMr. H. M. Howell,\nMr. W. R. Mullock,\nMr. J. W. H. Wilson.\n\nJ. W. H. Wilson,\nW. R. Mullock,\nW. G. Fonseca.\n\nMr. H. M. Howell,\nMr. C. J. Brydges,\nMr. J. Wrigley.\n\nMr. F. H. Mathewson,\nMr. W. R. Mullock.\nSynod Officers.\n\nPresident:\nThe Most Rev. Robert Machray, D.D., L.L.D.\nBishop's Court,\nWinnipeg, Manitoba.\n\nFinancial Secretary:\nVen. Archdeacon Pinkham, B.D.,\nRothney Cottage,\nWinnipeg, Manitoba.\n\nHonorary Lay Secretary:\nA. F. Eden, Esq.,\nManitoba & North-Western Railway Company's Land Department,\nWinnipeg, Manitoba.\n\nHonorary Treasurer:\nC. J. Brydges, Esq.,\nHudson Bay Company's Land Department,\nWinnipeg, Manitoba.\nReport of the Synod\n\nOF THE\n\nDIOCESE OF RUPERT'S LAND.\n\nAUGUST 5, 1886.\n\nWITH AN APPENDIX\n\nCONTAINING\n\nTHE ACTS OF INCORPORATION\n\nAND OTHER IMPORTANT DOCUMENTS.\n\nWINNIPEG:\nMANITOBa FREE PRESS PRINT.\n1886.\nDIocese OF Rupert's Land.\n\nCLERGY LIST, AUGUST, 1886.\n\nBISHOP AND METROPOLITAN.\n\nThe Most Rev. Robert Machray, D.D., L.L.D.; Bishop's Court, Winnipeg.\n\nVery Rev. J. Grisdale, B.D., Professor of Pastoral Theology in St. John's College, and Dean of Rupert's Land, one of the Bishop's Chaplains; the Deanery, Winnipeg.\n\nVen. A. Cowley, D.D., Canon of St. John's Cathedral, and Archdeacon of Cumberland, one of the Bishop's Chaplains; Dynevor.\n\nVen. W. C. Pinkham, B.D., Canon of St. John's Cathedral and Archdeacon of Manitoba, one of the Bishop's Chaplains; Rothney Cottage, Winnipeg.\n\nRev. J. Settee, C.M.S., Missionary; Dynevor.\n\nRev. T. Cook, Incumbent of Westbourne, and Rural Dean of Marquette; Westbourne.\n\nRev. R. Phair, C.M.S., Missionary at Fort Frances; Alberton, Ontario.\n\nRev. S. Pritchard, one of the Bishop's Chaplains; Fairbault, Minnesota.\n\nRev. G. Bruce, C.M.S., Missionary at Fairford; Fairford.\n\nRev. B. Spence, C.M.S., Missionary at Islington; Islington.\n\nRev. T. N. Wilson, Incumbent of Morden, and Rural Dean of Dufferin; Morden.\n\nRev. J. D. O'Meara; M.A., Professor of Systematic Theology and Deputy Warden of St. John's College, Canon of St. John's Cathedral and Incumbent of St. George's Church, Winnipeg, one of the Bishop's Chaplains; St. John's College, Winnipeg.\n\nRev. S. P. Matheson, B.D., Professor of Exegetical Theology in St. John's College, Deputy Head Master of St. John's College School, Canon of St. John's Cathedral; St. John's College School, Winnipeg.\nRev. M. Jukes, Missionary at Minnedosa and Rural Dean of Minnedosa; Minnedosa.\n\nRev. O. Fortin, B. A., Rector of Holy Trinity, Winnipeg, and Rural Dean of Selkirk; the Rectory, Winnipeg.\n\nRev. B. Mackenzie, Missionary at St. Peter's, Dynevor; St. Peter's Parsonage, Dynevor.\n\nRev. A. E. Cowley, Rector of St. James, Winnipeg, and curate in charge of Headingly; St. John's Ladies' School, Winnipeg.\n\nRev. W. A. Burman, B. D., Sioux Missionary, and Rural Dean of Brandon; Griswold.\n\nRev. H. T. Leslie, B. A., Chafyn-Grove Missionary; Winnipeg.\n\nRev. J. Irvine, C. M. S. Missionary at Lac Seul; Wabigon Station, C. P. R.\n\nRev. A. Stunden, B. A., Missionary at Rat Portage; Rat Portage, Ontario.\n\nRev. N. C. Martin, B. A., Incumbent of St. Clement's with Selkirk; The Parsonage, Mapleton, Selkirk.\n\nRev. A. L. Fortin, Incumbent of St. Andrew's, and Rural Dean of Lisgar; St. Andrew's Parsonage.\n\nRev. G. Aitkens, B. A., Missionary at Turtle Mountain; Nimitau.\n\nRev. E. S. W. Pentreath, Rector of Christ Church, Winnipeg; Christ Church Rectory, Common Street, Winnipeg.\n\nRev. J. J. Morton, Missionary at Birtle; Birtle.\n\nRev. R. Machray, B. A., Professor of Ecclesiastical History in St. John's College, and Canon of St. John's Cathedral, Registrar of the Diocese; St. John's College School, Winnipeg.\n\nRev. G. F. Coombes, M. A., Lecturer in Classics in St. John's College, Canon and Precentor of St. John's Cathedral; St. John's College, Winnipeg.\n\nRev. G. H. Hooper, Missionary at Springfield; Springfield.\n\nRev. W. L. Cheney, Incumbent of Rounthwaite and Millford, Rounthwaite P. O.\n\nRev. A. W. Goulding, B. D., Incumbent of Victoria and Stonewall, and Protestant Chaplain of the Manitoba Penitentiary, Stony Mountain.\n\nRev. T. C. Coggs, B. D., Incumbent of Souris; Souris, Brandon.\n\nRev. W. H. Lowry, B. A., Missionary at Oak River; Hamiota, P. O.\nRev. I. C. Fortin, B. D., Incumbent of Emerson; the Parsonage, Emerson.\nRev. C. N. Jeffery, B. D., Rector of Portage la Prairie.\nRev. H. H. Barber, Rector of All Saints', Winnipeg; All Saints' Rectory, Winnipeg.\nRev. T. W. Bunn, Incumbent of Shoal Lake, &c; Stonewall P. O.\nRev. F. F. Davis, Incumbent of Virden.\nRev. E. P. Flewelling; Rector of Brandon.\nRev. C. R. Littler, Curate at Gladstone.\n\nLAY DELEGATES, 1886.\nBrandon—Judge Walker, T. M. Daly.\nBrierwood—F. W. Stephenson.\nBeaconsfield—J. B. Ashby.\nBirtle—E. P. Leacock, M. P. P.\nCarlingville—J. Shoebotham.\nClanwilliam—G. B. Hilliard.\nClearwater—G. Gilbert.\nCook's Creek—J. B. Line.\nDominion City—W. Markill.\nElkhorn—G. W. Rowswell.\nEmerson—J. E. Cooper, T. Gilroy.\nGladstone—T. Cory.\nGlendale—C. H. Patterson.\nGriswold—G. Lindsay.\nHeadingley—Hon. W. Tait, W. B. Hall.\nHigh Bluff—W. J. James.\nKola—H. Chrisp.\nLittle Britain—Wm. Fox.\nManitou—Dr. Black.\nMinnedosa—W. Pearson.\nMorden—M. B. Lloyd, Acton Burrows.\nMorris—S. J. Collum.\nMusselborough—J. Bromnell.\nNorquay—D. Corbett.\nOak Lake—H. Hatch.\nParkdale—John Setter.\nPembina Crossing—W. Winram, M. P. P.\nPoplar Point—A. Campbell.\nPortage la Prairie—F. L. Anstruther, H. M. Howell, Q. C.\nRat Portage—H. F. Holmes, R. Reading.\nRounthwaite—S. Rounthwaite.\nRowan—E. Hunter.\nShoal Lake—W. S. Daniell.\nSouris—W. Wenman.\nSpringfield—W. Corbett.\nSt. Andrew’s—Hon. J. Notquay, M.P.P., T. Stewart, G. Ross.\nSt. Clement’s—R. Begg.\nSt. Peter’s—W. Thomas, G. Sanderson, P. Smith.\nSt. Paul’s—H. Pritchard, A. Masters.\nStony Mountain—S. L. Bedson.\nStonewall—T. Lusted.\nSunnyside—R. Palmer.\nSwan Lake—J. G. Tulloch.\nVictoria—T. E. Geddes.\nViola Dale—T. M. Hamilton.\nVirden—Hon. F. P. Bouverie.\nWestbourne—A. E. Smalley.\nWinnipeg—\nAll Saints—C. J. Brydges, J. W. H. Wilson, A. F. Eden.\nChrist Church—H. S. Crotty, W. A. Henderson, J. Carman.\nHoly Trinity—J. Wrigley, W. R. Mulock, F. H. Matheson.\nSt. George’s—T. Taylor, C. James.\nSt. James’—J. Bruce.\nSt. John’s—Hon. Sheriff Inkster, D. McDonald, W. G. Fonseca.\nPROCEEDINGS OF THE SYNOD\n\nOF THE\n\nDIOCESE OF RUPERT'S LAND.\n\nThe Synod of the Diocese of Rupert's Land met on Thursday, August 5th.\n\nThere was a celebration of the Holy Communion in Holy Trinity Church at 10 o'clock. The offertory was for the Home Mission Fund. The Bishop was assisted by the Dean, the Archdeacons and the Rector.\n\nAt the close of the service an adjournment was had to Holy Trinity school room.\n\nFIRST SESSION.\n\nThe Most Reverend the Metropolitan of Rupert's Land took the chair at 11:30.\n\nArchdeacon Pinkham said the usual prayers.\n\nOn motion of Canon Matheson, seconded by Mr. Fonseca, Mr. A. F. Eden was elected Honorary Lay Secretary.\n\nHis Lordship appointed the following members to act as scrutineers to examine and report on the certificates of lay-delegates, viz: Rev. W. A. Burman, Rev. A. E. Cowley, and Messrs. F. H. Mathewson and W. G. Fonseca.\n\nThe roll of the clergy of the Diocese was then read; and the following answered to their names:\n\nRev. G. Atkins, Rev. H. H. Barber,\n\" T. W. Bunn, \" W. A. Burman,\n\" W. L. Cheney, \" T. Cook,\n\" T. C. Coggs, \" Canon Coombes,\nVen. Archdeacon Cowley, \" A. E. Cowley,\nRev. E. P. Frewelling, \" O. Fortin,\n\" A. L. Fortin, \" I. C. Fortin,\nVery Rev. Dean Grisdale, \" A. W. Goulding,\nRev. C. N. F. Jeffery,\n\"C. R. Littler,\n\"B. Mackenzie,\n\"Canon Matheson,\n\"Canon O'Meara,\nVen. Archdeacon Pinkham,\nRev. T. N. Wilson.\n\nRev. G. H. Hooper,\n\"M. Jukes,\n\"W. H. Lowry,\n\"N. C. Martin,\n\"J. J. Morton,\n\"E. S. W. Pentreath,\n\"J. Settee,\n\nThe scrutineers handed in the roll of the lay-delegates, which was then read, the following answering to their names:\n\nBrandon—Judge Walker, T. M. Daly.\nBeaconsfield—J. B. Ashby.\nBirtle—E. P. Leacock.\nCook's Creek—J. B. Line.\nElkhorn—G. W. Rowsell.\nEmerson—T. Gilroy.\nHeadingly—Hon. W. Tait, W. B. Hall.\nHigh Bluff—W. J. James.\nLittle Britain—Wm. Fox.\nManitou—Dr. Black.\nMorden—Acton Burrows, M. B. Lloyd.\nPortage la Prairie—H. M. Howell, Q.C., F. L. Anstruther.\nShoal Lake—W. S. Daniell.\nSouris—W. Wenman.\nSpringfield—W. Corbett.\nSt. Andrew's—G. Ross.\nSt. Peter's—W. Thomas, G. Sanderson.\nSt. Paul's—H. Pritchard, A. Masters.\nSunnyside—R. Palmer.\nVictoria—T. L. Geddes.\nViola Dale—T. M. Hamilton.\nWestbourne—A. E. Smalley.\nWinnipeg—\n\nAll Saints—C. J. Brydges, J. W. H. Wilson, A. F. Eden.\nChrist Church—H. S. Crotty.\nHoly Trinity—J. Wrigley, W. R. Mulock, F. H. Matheson.\nSt. George's—T. Taylor, C. James.\nSt. James.—J. Bruce.\nSt. John's—Sheriff Inkster, W. D. McDonald, W. G. Fonseca.\n\nMoved by Mr. Howell, seconded by Mr. Brydges, and resolved,\nThat all the canons, resolutions, regulations and rules of order of the unincorporated Synod of the Diocese of Rupert's Land be, and the same are the canons, resolutions, regulations and rules of order of this corporation as fully and absolutely as if the same were heretofore generally passed and enacted by this corporation now in session.\n\nMoved by Dean Grisdale, seconded by Rev. O. Fortin, and resolved,\n\nThat the minutes of the last meeting of the Synod, as printed and published, be confirmed, and that the Bishop be authorized to sign them.\n\nMoved by Mr. Howell, seconded by Canon O'Meara, and resolved,\n\nThat Mr. C. J. Brydges be re-elected Honorary-Treasurer of Synod.\n\nMoved by Dean Grisdale, seconded by Rev. H. H. Barber, and resolved,\n\nThat Archdeacon Pinkham be re-elected Secretary.\n\nMoved by Archdeacon Pinkham, seconded by Rev. T. N. Wilson, and resolved,\n\nThat the Secretaries be authorized to complete the ballot papers for the election of the Executive Committee and the delegates to the Provincial Synod, by adding to the roll of laity present the names of such lay delegates as have been sent in on the parochial returns.\n\nSeveral notices of motion were given.\n\nOn motion the meeting then adjourned for luncheon to meet again at 14 o'clock.\n\nSECOND SESSION.\n\nThe Synod re-assembled at 14 o'clock.\n\nMoved by Rev. H. H. Barber, seconded by Mr. Howell, and resolved,\n\nThat the Rev. Isaac Constantine, of the Diocese of Montreal, be asked to take a seat on the floor of the House.\n\nThe roll of the clergy was then read, and in addition to those present in the morning, Rev. H. T. Leslie answered to his name.\nOn the roll of the laity being called, the following were found to be present in addition to those who were present in the morning, viz.: John Setter, Parkdale; S. L. Bedson, Stony Mountain; T. Lusted, Stonewall; J. Carman and W. A. Henderson, Christ Church, Winnipeg.\n\nThe minutes of the first session were read and confirmed.\n\nHis Lordship then gave his address as follows:\n\nReverend Brethren and Brethren of the Laity:\n\nThe necessity for this early meeting of the Synod has arisen from the passage by the Legislature of Manitoba of the Bill for the Incorporation of the Synod, which was adopted by the last Synod. Before the Executive Committee can exercise under the Bill the powers of the Synod, as a corporation, it must be empowered by the Synod to do so.\n\nA resolution passed by the Executive Committee will be placed before the Synod with this view.\n\nI shall then pass over to the corporation, 'The Synod of the Diocese of Rupert's Land,' the properties of the Clergy Endowment Fund and the Indian Mission Fund, and all the Parish and Mission properties, held by me, except what is connected with St. John's Cathedral.\n\nThe property connected with St. John's Cathedral will be conveyed to the Dean and Chapter, but the Dean and Chapter cannot sell any land except with the consent of the Executive Committee. The Finance Committee of the Church Missionary Society executed a Deed of Trust in accordance with the views of the Church Missionary Society, by which certain lands in the Province of Manitoba were conveyed to the Bishop of Rupert's Land for certain purposes. The Church Missionary Society has given its consent to the conveyance by me of this property to the Synod, to be held, of course, by the Synod for the purposes mentioned in the Deed of Trust. I am accordingly to convey this property also to the Synod. It seems proper that on my passing over the properties a Declaration of Trust be made to me by the Synod.\n\nThe property held by me for the Professorships, Scholarships, or prizes, I have conveyed or am in the course of conveying to the St. John's College.\n\nI have also in the past held and managed property for various Mission and other purposes in the Dioceses of Sas-\nkatchewan and McKenzie River. But though I kept all such funds in the separate account called the Trust account of the Bishop of Rupert's Land, as they were not my own private property, yet properly they were held and administered by me, rather as a private individual than as a corporation. I am passing all these Funds over to those who have left them or placed them in my hands.\n\nThe only Funds, or Property, that will remain after next week in charge of the corporation, the Bishop of Rupert's Land will, with the exception of interests in two or three mortgages, that cannot immediately be dealt with, be the Episcopal Endowment, the Machray Exhibitions, and the St. John's Cathedral Prebend Fund.\n\nThough it is convenient and desirable that there should be a sole corporation, 'The Bishop of Rupert's Land,' it was never my wish that the property of the Diocese or of the College should be in its Trust, when other arrangements could safely be made. Provision was made by me in each of the Deeds of Endowment of the Professorships for passing the property to the care of the College. Resolutions sanctioning the transfer of the property to the College and the Dean and Chapter were passed by the Synod in 1877. An effort was also made about the same time for the incorporation of the Synod, which fell through. Practical difficulties seemed to stand in the way, which have been removed by the Act passed last session. I am glad that I can at length be relieved of what has been a heavy burden, and in the past few years a cause of much anxiety.\n\nI would again thank the members of the Advisory Board for all the trouble they have so willingly undertaken for the sake of the Church during the past two or three years.\n\nI have also to thank my Solicitors for the generous way in which they have administered the affairs of the Trust, so that it has been put to as little expense as possible.\n\nI brought very fully before the last Synod the position of the Diocese from the large extent of settlement, and pointed out the need of ten new missions.\n\nI am sorry to say that, from various causes, the condition of things is not more satisfactory, though regular or occasional services have been given in most of the districts.\nWe require, or will shortly require, Missionaries in the Districts of Manitou, Clearwater, Killarney, Deloraine, Oak Lake, Russell, Neepawa, Norquay, and Poplar Point. We have, however, made this advance on our position of last year that the Executive Committee is prepared to venture on giving grants in aid to clergymen for the places named, if suitable men can be found and the people undertake satisfactorily to do their part.\n\nThere are two or three clergymen in view, but we need about six more.\n\nArchdeacon Pinkham and Canon O'Meara were lately in Canada, but they did not hear of clergymen to supply our need. I hope that when I visit England, which I expect to do shortly, I may meet with some who will suit us.\n\nWe have been accidentally aided in the last few years by the enforced stay with us during the winter or a portion of the year of Missionaries of the Church Missionary Society on their way to the Diocese of McKenzie River. They were unable to go further toward their destination with any advantage. In this way Districts in the Diocese received the benefit of the services of the Rev. Messrs. Canham, Garton, and Wallis. These services have been very acceptable, as have been also those of two laymen, who had work in Indian Missions, Messrs. Holmes and Ellington. I take this opportunity of thanking those gentlemen for very essential service in this Diocese, and of congratulating the Church Missionary Society on securing such promising workers. The Rev. Mr. Nicholl, at Pembina Crossing, and the Rev. Mr. Dundas, at Brandon, who are residing in the Diocese, have also given us very kind and substantial aid.\n\nOur Mission Fund is for the present in a better position than it was last year.\n\nA very full and clear statement of our case was drawn up after last Synod by a committee, and being approved of by the Executive Committee, was placed before the English Church Societies and the Canadian Board of Missions. The Society for the Propagation of the Gospel acted with great kindness and consideration. It replaced by a special grant the £200 withdrawn from its grant this year, and it renewed the full grant for next year. Then a very sympathetic resolution was passed by the Canadian Board of Missions welcoming a request for assistance.\ning a representative from this Diocese to plead for our case in the Ecclesiastical Province of Canada, and authorizing their chairman, the Bishop of Ontario, to give him a letter of strong recommendation. This the Bishop most kindly did. The result has been that Archdeacon Pinkham has raised a considerable sum in Eastern Canada. Canon O'Meara also secured some assistance in the Diocese of Nova Scotia. Our Mission Fund is again happily out of debt, and we have a small balance, giving us confidence to fill up the missions named, if we can find the men.\n\nImmediately after the meeting of Synod I received £120 from an English clergyman, the Rev. F. H. Baring, in aid of the Clergy Endowment Fund. This, with the help of some $90 contributed by members of the Church in Winnipeg, made up the sum enabling us to claim £500 each from the S. P. G. and S. P. C. K. The S. P. G. has further shown its appreciation of our position and difficulties by agreeing to give its grant in future in sums of £500, to meet £1,000 from any other sources instead of £1,500 as formerly.\n\nHowever, as I have always wished to impress on the Synod, the most important question is what we are doing and can do ourselves. I cannot say that there has been much advance in our own contributions last year to the Mission Fund, except that there have been numerous missionary meetings throughout the Diocese, at which several of our leading lay Churchmen kindly united with the clergy in giving addresses. The collections at these meetings have been some help. But the pecuniary difficulties under which we labor in the Diocese have not yet been removed. Fertile, most fertile as the land generally is, our Province is subject to the usual vicissitudes of weather of an agricultural country. An unusually early frost last autumn, that visited a great part of North America, injured the crops more or less severely in many districts, though some districts escaped it altogether.\n\nThen the immigration has still continued to go west of Manitoba, though it seems extraordinary that, as is often the case, people with capital should be tempted by a free homestead to go hundreds of miles west of Winnipeg, when the best of land can be purchased, almost anywhere throughout the Province, for very low prices.\n\nThe consequence is that our settlements are not to any ap-\npreciable extent stronger, and our people are in little better circumstances than last year.\n\nNotwithstanding these facts, there has been somehow or other a decided improvement this season in Winnipeg, Portage la Prairie and Brandon, and I hope more or less over the country. I feel sure that in a very few years our lands will be occupied, our settlements filled up, and our people prosperous. But for some time we must expect a hard struggle.\n\nStill the Executive Committee is persuaded that our people must be called upon to make self-denial in securing for themselves the means of grace, as they have to do in other things. It has, therefore, voted $400 instead of $500 as the grant in aid in the case of all the missions now vacant. This involves a greater call on the liberality of our people. I trust they will rise to the necessity. Nothing will more encourage others to help us than the conviction that we are struggling manfully and honestly to do our best.\n\nOur immediate difficulty, then, is in getting effective men. It is a serious matter to leave a Mission without a settled clergyman. However excellent may be the services of visiting clergymen, they soon cease to satisfy. But it is a still more serious matter to have in a Mission an ineffective and unacceptable clergyman.\n\nThere are important spiritual and religious reasons that might appeal to young men to throw themselves into our work. A new country is being built up. Its tone and character will largely depend on the first workers. There seems, then, a special call to do battle here for Christ and the Church. But putting aside such reasons, I think many a young man of promise might do much worse for himself temporally than undertake one of our young Missions. The people of this country are generous, and in most Missions they will do their best to help a faithful and earnest pastor. Though the expense of living is still considerably greater than in Ontario, it is much less than it was. And the future is ours. Men do not hesitate in the pursuit of worldly business to come here prepared to make some sacrifice and exercise some self-denial at first. So we might expect clergymen to come to us, though they may not have at first the income they wish and need. But, on the other hand, every effort is made to keep effective clergymen in the Dioceses in which they are. It is perfectly\nclear, then, that separated as we are by such a distance from Eastern Canada, as well as England, we must depend mainly on those we can educate in our own college.\n\nThus apart altogether from the natural desire to have a college, where our young men may be educated for the learned professions amid associations in sympathy with our Church and under careful guardianship, the strengthening and efficiency of St. John's College becomes, even as regards the Mission field, the first and most pressing care of the Diocese.\n\nIt seems unnecessary to repeat the story of the embarrassments that have unexpectedly followed from the building of the new College. I am happy to say that by arrangements, that reduced the interest very materially, no addition has been made to the debt since 1884, while the increase of the General Endowment Fund last year by over $10,000, which has been lent for the present to the College, has so far removed the pressure of interest. This large addition to the Endowment for general purposes was mainly owing to the very generous donation of $3,000 from Sir Donald Smith, by which the £4,000 was completed, that enables us to claim the balance of the £1,000 granted by the S.P.G. The donation was received from Sir Donald Smith a day or two after the close of last Synod.\n\nThe majority of the students are this year to be in the new College, under the charge of Canon O'Meara. This necessitates some expenditure in improving the heating, which it is expected will be met by collecting some of the subscriptions formerly promised but not yet received.\n\nBut, though there has been an improvement in the financial condition of the college, the expenses, including the interest, can only be met with difficulty, and while there is such a burden of debt, the condition of the College must continue insecure. Nor is that the only difficulty. The Fund for General Purposes has to meet the interest on the debt, while it is urgently needed to pay the salary of a master, who can teach Mathematics and Natural Science. We find great difficulty in securing this combination of subjects, but we must endeavor to obtain it, as we cannot expect that, for some years, there will be a sufficient number of students reading in these subjects to give proper employment to separate teachers, even if we could afford them.\nAnd this leads me to remark that while we occupy in this country an exceptionally promising position for the future as regards University Education, yet there are, for the present, inconveniences and difficulties arising out of our system. In supporting very cordially the University arrangements sanctioned by Parliament, I looked forward to substantial assistance from the State—not for the College, but for the University. I expected that the State would in due course furnish University buildings with provision for our meetings and examinations—with Library, Museums, Laboratory, and workshops. I also hoped for the appointment of Teachers in the University in Science, Modern Languages, and other subjects, whose lectures would be open to all students of the University. But things have travelled faster than I even anticipated. While the State is not in a position to give effectual help, the University has allowed the widest extent of reading for its Degrees. Students are encouraged to follow their special predilections, and can proceed to the B. A. Degree not only by an elementary knowledge of various subjects, but by higher reading in a special branch of study as Classics, Mathematics, Natural Science, Moral and Mental Philosophy, and Modern Languages; and students in St. John's College were actually last year studying for their Degree by each of these special courses. This has thrown a heavy responsibility on the Colleges, and I have to say that St. John's College is not equal to it, unless it either gets a considerable addition to its funds or larger assistance from Government. And I expect it is very much the same with the other Colleges. Last year St. John's College received from the Marriage License Fund $1,568.25, but this statement conveys an erroneous impression. That sum did not properly represent a year's payment, though it fell in during the course of a year. In fact, the whole sum received since the first payment, Jan. 13, 1879, covering seven and a half years, has only been $3,514.93. No payment has been received yet this year.\n\nI do not think that the State is at present able to give the necessary direct assistance to the University, and I cannot say that I think it is desirable that it should, until it can do it adequately. The permanent buildings of the University must be costly, and it is better to leave them alone, till they can be taken in hand properly. But it is only due to the Colleges and to the students of the University that, till this is practi-\ncable, the State should give the aid absolutely required by the Colleges to secure efficient instruction. St. John's College requires at least $2,000.\n\nThe state of the College continues so critical that, very much against my will, I am to visit England to see if I can obtain such help as will make the College at least safe and fairly effective, till we can do more for ourselves and the State is able to aid the University effectively. I cannot but think that, if we can but weather successfully the next five or six years, we shall be able to get on satisfactorily. My effort will be to raise £4,000 for the General Endowment Fund, so as to raise it to £9,000, when we shall be entitled to £1,000 from the S.P.C.K. It is a simple necessity that this effort be made. And while such an effort is made in England, should not something be done among ourselves? And this not merely in the way of soliciting donations from individuals, but in bringing the College annually before the congregations of the Diocese. In the Diocese of Toronto there is an annual collection for Trinity College, and throughout the Presbyterian congregations of this country there is an annual sermon, with a collection for their College. One advantage of this would be that, by the College being brought more distinctly before the people, there might be an accession of pupils. In the College School there is an opportunity given for an excellent classical education. I have often wondered that so few Day Pupils come from Winnipeg. The fees are small—only $30 in the year—and the walk from most parts of the city would be anything but hurtful. Young boys of 14 from the College School have won Scholarships in the last two years at the preliminary examination of the University—being not only first in Classics, but well prepared in the common school subjects. The remarks I have made apply equally to the Ladies' College. It has few Day Pupils except from the immediate vicinity, though the education given is very excellent. The late examination was most satisfactory.\n\nBefore concluding I desire to express my regret that there is so great irregularity in taking up the collections directed by the Synod. I believe myself in the regular accumulation of small sums. If all the congregations gave to each object the prescribed collection, the result would prove very gratifying. But I especially regret the omission in the case of the Clergy, Widow and Orphan's Fund. Somehow only a small\nproportion of the clergy now think it worth their while to be contributors to the Fund, and a large number systematically ignore the collection. Had there been a vigorous pushing of the Fund, it might now have been in a very satisfactory position.\n\nBut, Dear Brethren of the Clergy, let us never forget, when thinking of the prosperity of the mission work of the Diocese or its institutions, how much depends on our own consecration to the Lord's service. It is my experience that, where our Clergy are devoted to their work, sensible, and genial, the services of our Church are welcomed not only by our own Church people, but by the settlers in general. There is very little active prejudice. Only let us try to approach the ideal sketched out lately by the Venerable Bishop of Norwich in these words: \"Let it be clear to our conscience before God and evident in our life before men that the work, which the Lord has given us to do for Him, by our life, word, and work, so to testify of Christ to men as to win men to Christ, is the loved object of our hearts, the absorbing aim of our life, the one thing we do, to which all else is subservient.\"\n\nSince the last meeting of Synod my predecessor, Bishop Anderson, has been called to his rest. In all his life, what I have been setting forth was beautifully exemplified. He adorned the doctrine of God our Saviour in all things. Gentle and affectionate, he seemed to live for others. All he had was at the Master's service. He was beloved, as Bishop, by all the community here, and he was beloved in the Parishes in England, which had the privilege of having him as their pastor. He ever continued to have a warm place in his heart for this country. Not the least of the many losses I have to regret on my return to England is the want of his hearty welcome and cheering words. Great, doubtless, now is his joy in the presence of his Lord. Let it then be in like manner, Brethren, our aim to present ourselves a living sacrifice, holy, acceptable unto God, which is our reasonable service.\n\nMoved by Mr. Brydges, seconded by Archdeacon Pinkham, and resolved,\n\nThat the Hon. Thomas White be asked to take a seat on the floor of the House.\n\nIt was moved by Mr. Howell, seconded by Rev. C. N. F Jeffery, and resolved,\nThat scrutineers be appointed by the Bishop for the election of Delegates to the Provincial Synod, and also for the election of the Executive Committee.\n\nHis Lordship appointed the following scrutineers for the election of Delegates to the Provincial Synod:\n\nCanon Matheson, Mr. W. J. James,\nRev. C. N. F. Jeffery. Mr. W. R. Mulock.\n\nScrutineers for the election of the Executive Committee:\n\nCanon Coombes, Hon. Sheriff Inkster,\nRev. T. N. Wilson. Mr. H. S. Crotty.\n\nSubsequently Canon Coombes having to leave the Synod, Canon O'Meara was appointed in his stead.\n\nThe roll was then called and the printed ballot papers were distributed.\n\nOn motion, the rules of order were suspended to allow time for counting the ballots.\n\nMoved by Mr. Howell, seconded by Mr. Fonseca, and resolved,\n\nThat His Lordship appoint a committee to prepare a design for a seal to be the seal of this corporation.\n\nThe Bishop appointed the following committee: Dean Grisdale, Mr. Brydges, Mr. Howell.\n\nMoved by Mr. Brydges, seconded by Dean Grisdale, and resolved,\n\nThat the report of the College Committee be received.\n\nMoved by Rev. O. Fortin, seconded by Canon Matheson, and resolved,\n\nThat the report on St. John's College be discussed to-morrow morning as the first order of business.\n\nOn motion of Mr. Brydges, seconded by Mr. Howell, it was resolved,\n\nThat the corporation, \"the Synod of the Diocese of Rupert's Land,\" being empowered by clause 10 of its Act of Incorporation to exercise all its powers by and through the Executive Committee as established by the constitution, or such other boards or committees as the said corporation may from time to time appoint by resolution, for the management of all or any of the affairs or property of the said corporation, hereby appoints the said Executive Committee for the purposes aforesaid; and also to administer the trusts, properties and funds\nnow about to be transferred to the Synod, and all other property now held or hereafter to be acquired.\n\nMr. J. E. Cooper, of Emerson, handed in his certificate as lay delegate and took his seat.\n\nMr Howell read a declaration of trust prepared in connection with the transfer to the now incorporated Synod, of the property, money, etc., hitherto vested in the corporation of the Bishop of Rupert's Land. Mr. Howell gave explanations of the circumstances, and stated that the deeds were being prepared and would be executed before His Lordship leaves for England.\n\nThe rules of order having been suspended, it was resolved, on motion of Mr. Howell, seconded by Mr. Brydges,\n\nThat having heard read the draft declaration of trust from this corporation to the corporation of the Bishop of Rupert's Land, it is resolved that the same is satisfactory, and that, as soon as the lands, moneys and securities for moneys are transferred to this corporation, the proposed deed of trust be executed by this corporation, and for this purpose, that the corporation seal be affixed and verified as provided by clause 12 of this act.\n\nDean Grisdale, on behalf of the committee to prepare a design for a seal, reported, recommending the adoption of a circular disc with the words, \"The Synod of the Diocese of Rupert's Land,\" as the seal of the Synod, for the present.\n\nThe report was adopted.\n\nA number of notices of motion were given.\n\nAfter explanations by Mr. Brydges, it was moved by Mr. Brydges, seconded by Rev. O. Fortin, and resolved,\n\nThat the Committee on Revision of Canons not having had time to complete its work, the Bishop be requested to name a committee of nine to complete the revision of the existing Canons, and suggest such other additional Canons as it may think advisable to recommend for adoption, and to report at the next meeting of Synod.\n\nSubsequently the Bishop named the following committee:\n\nDean Grisdale, Convener,\nArchdeacon Pinkham,\nCanon O'Meara,\nRev. O. Fortin,\nMr. Brydges,\nMr. Howell,\nMr. Mulock,\nMr. Wilson,\nRev. E. S. W. Pentreath.\nOn motion of Mr. Brydges, seconded by Archdeacon Cowley, the following motions for changes in the constitution were adopted:\n\n1. That in clause 10 the following words be omitted, viz.: \"First sent to the Executive Committee for consideration.\"\n\n2. That in the possible absence of the Bishop of the Diocese or any Commissary he may appoint, the chair at any meeting of the Synod shall be taken by the highest dignitary in the Church of this Diocese who may be present.\n\nArchdeacon Pinkham brought up the matter of a Superannuation Fund for the Diocese, showed its necessity from the fact that no commutation fund exists, as in Eastern Canada, and that there is no provision for the support of clergymen incapacitated for duty by reason of age or infirmity, and suggested the following resolutions, which were unanimously adopted.\n\n1. That a fund be started to be called \"The Clergy Superannuation Fund of the Diocese of Rupert's Land.\"\n\n2. That subscriptions, donations and bequests be solicited for this fund, and in such special manner as the Synod may from time to time determine.\n\n3. That until the yearly interest of this fund reaches the sum of two hundred dollars, it shall be added to the principal.\n\n4. As soon as the fund produces at least two hundred dollars per annum, the Synod shall, by Canon, determine the manner in which the said fund shall be administered, and the persons who shall be from time to time eligible to become pensioners of it.\n\nRev. Mr. Jukes moved, seconded by Rev. G. Aitkens, the following resolution:\n\nThat members of the Executive Committee residing outside the city be allowed their regular travelling expenses when attending the meetings of the said committee.\n\nThe following members spoke on the motion, viz.: The Mover, Archdeacon Cowley, Rev. E. S. W. Pentreath, and Messrs. Brydges, Howell, Wilson and Daly.\n\nThe motion was withdrawn.\n\nThe scrutineers reported the following elected as delegates to the Provincial Synod, viz.:\nCanon Matheson,\nDean Grisdale,\nArchdeacon Cowley,\nRev. O. Fortin,\nArchdeacon Pinkham,\nRev. E. S. W. Pentreath,\nCanon O'Meara,\n\nH. M. Howell,\nC. J. Brydges,\nSheriff Inkster,\nHon. J. Norquay,\nJ. Wrigley,\nW. R. Mulock,\nJudge Walker.\n\nRev. T. N. Wilson,\nRev. H. H. Barber,\nRev. M. Jukes,\nRev. A. E. Cowley,\nRev. W. A. Burman,\nRev. E. P. Flewelling,\nRev. C. N. F. Jeffery,\n\nH. S. Crotty,\nF. H. Mathewson,\nS. Bedson,\nJ. W. H. Wilson,\nW. J. James,\nActon Burrows,\nT. Gilroy.\n\nHis Lordship then pronounced the benediction, and the Synod adjourned till 10 o'clock to-morrow.\n\nTHIRD SESSION.\n\nThe Synod met again on Friday, August 6, at 10 o'clock, the Most Reverend the Metropolitan in the chair.\n\nThe Secretary said the opening prayers.\n\nThe roll of members was called.\n\nThe minutes of the last session were read and confirmed.\n\nThe scrutineers reported the following elections to the Executive Committee:\n\nCanon Matheson,\nRev. O. Fortin,\nRev. E. S. W. Pentreath,\nRev. T. N. Wilson,\nCanon O'Meara,\nRev. M. Jukes,\nRev. W. A. Burman,\nRev. H. H. Barber,\n\nMr. H. M. Howell,\nHon. Sheriff Inkster,\nMr. H. S. Crotty,\nMr. J. Wrigley,\nHon. Judge Walker,\nMr. W. R. Mulock,\nMr. F. H. Mathewson,\nMr. W. B. Hall,\nHon. J. Norquay,\nMr. J. W. H. Wilson.\n\nThe report of the Committee on St. John's College was discussed, and on motion of Rev. O. Fortin, seconded by Canon Matheson, adopted.\nThe following took part in the discussion, as well as the mover and seconder, viz.: Rev. H. H. Barber, Rev. E. S. W. Pentreath, Archdeacon Pinkham, Canon O'Meara, Mr. Brydges, Mr. Howell, Rev. W. A. Burman, Mr. Leacock, Mr. J. W. H. Wilson, Mr. Wrigley, Rev. W. H. Lowry, Dean Grisdale and Archdeacon Cowley.\n\nRev. W. A. Burman obtained leave to withdraw the following resolution, of which he gave notice yesterday, viz.:\n\nThat whereas the Statutes of St. John's College, as adopted by the Synod of 1876, provide for the election by the alumni of certain members of the college council not to exceed sixteen in number as soon as the Synod shall deem that body to be sufficiently numerous, it is hereby resolved that as there is now a considerable body of alumni, that statute shall be put in operation at next commemoration, in such manner as the executive committee of the Synod shall provide.\n\nDean Grisdale read the report of the committee of the S. P. C. K. Depository, and moved, seconded by Rev. E. S. W. Pentreath, that it be received and adopted.\n\nRev. W. H. Lowry obtained leave to withdraw the following notice of motion:\n\nThat it is desirable that the committee of the S. P. C. K. Depository do give more facilities for the procuring of books from the Depository.\n\nMr. W. A. Henderson made an inquiry regarding the transmission to the secretary of the annual Parochial returns required by the Synod.\n\nThe secretary replied that a number had not yet been received, and that full information was not always given.\n\nMr. Wrigley moved, seconded by Mr. Howell,\n\nThat on the occasion of his handing over the management of the Diocesan trust funds to this Synod, the cordial thanks of the Synod be tendered to His Lordship the Bishop for his very efficient management of them during a great number of years.\n\nThe motion was carried by acclamation.\n\nOn motion, the rules of order were suspended to allow a number of notices of motion to be given.\n\nThe Synod adjourned for luncheon.\nFOURTH SESSION.\n\nThe Synod met again at 14:30 o'clock.\n\nThe roll of members was called, and the minutes of the last meeting were read and confirmed.\n\nDean Grisdale, as convener of a committee, consisting of himself, Archdeacons Cowley and Pinkham, Revs. O. Fortin and E. S. W. Pentreath, Hon. J. Norquay, Sheriff Inkster, and Messrs. C. J. Brydges and A. H. Whitcher, appointed at the last meeting to consider the best means of retaining permanently by the Diocese of Rupert's Land as the Metropolitical See of the Province of Rupert's Land, reported progress, and moved, seconded by Mr. Brydges, that leave be given to sit again. The motion was carried with an additional clause that His Lordship be asked to substitute a name for that of Mr. A. H. Whitcher, who is not now a member of the Synod.\n\nSubsequently the Bishop appointed Mr. W. R. Mulock to take the place of Mr. Whitcher.\n\nMoved by Mr. Brydges, seconded by Rev. T. N. Wilson, and resolved,\n\nThat the report of the Executive Committee, including the treasurer's report and the report made by Archdeacon Pinkham of his visit to Eastern Canada, be received and adopted.\n\nMoved by Dean Grisdale, seconded by Rev. O. Fortin, and resolved,\n\nThat the cordial thanks of this Synod be hereby tendered to Mr. C. J. Brydges for his courteous and efficient services as honorary treasurer of the Synod.\n\nMoved by Canon O'Meara, seconded by Canon Matheson, and resolved,\n\nThat the Bishop be asked to appoint a College committee to report to the Synod at its next session.\n\nSubsequently His Lordship named the following as such committee:\n\nDean Grisdale, Bursar, Convener, Mr. Howell,\nCanon O'Meara, Deputy Warden, Mr. Brydges,\nCanon Matheson, Deputy Head Master, Mr. Wrigley.\n\nMoved by Archdeacon Pinkham, seconded by Canon O'Meara, and resolved,\nThat the Synod of the Diocese of Rupert's Land hereby expresses its gratitude to the bishops, clergy and laity of the Ecclesiastical Province of Canada, for the kind response that has been given to its appeals for help, and prays that a more intimate knowledge of our circumstances and wants may lead to larger measures of assistance, to enable us fully to do our Master's work in this portion of His vineyard.\n\nMoved by Canon Matheson, seconded by Mr. Hugh Fritchard, and resolved,\n\nThat the cordial thanks of this Synod be tendered to Ven. Archdeacon Pinkham and Rev. Canon O'Meara for the efficient work which they have accomplished for the Diocese in collecting funds in Eastern Canada.\n\nMoved by Archdeacon Pinkham, seconded by Dean Grisdale, and resolved,\n\nThat a standing committee on credentials be appointed to examine the certificates of lay delegates and prepare a report of the same, including a list of all such delegates, with the names of the parishes they represent, for the next meeting of Synod, and generally to deal with and report to the Synod upon questions relating to lay representation under the constitution, and that the clergy be respectfully requested to make a return of the lay delegates elected year by year in their respective parishes and congregations to the secretary of the Synod, as soon after their election as possible, for the information of the committee.\n\nSubsequently the Bishop named the following committee:\nArchdeacon Pinkham, Convener, Rev. A. E. Cowley and Mr. Gilroy.\n\nMoved by Mr. Brydges, seconded by Dean Grisdale, and resolved,\n\nThat the warm thanks of the Synod be offered to the Venerable Society for the Propagation of the Gospel for their special grant of £200 for the present year, and for their promise to continue the grant for next year without any diminution, by which generous action the difficulties by which the Synod was surrounded have been so largely overcome.\n\nMoved by Mr. Wrigley, seconded by Mr. Brydges, and resolved,\nThat the earnest attention of the clergy in every parish and mission throughout the Diocese be called to the importance of placing the Widow and Orphans' Fund in a more satisfactory condition; that each clergyman be urged to become a subscriber to the fund, and that the congregations and laity be strongly advised to do their utmost to promote the fund.\n\nRevs. A. L. Fortin, E. P. Flewelling, G. H. Hooper and others spoke to the motion.\n\nThe Bishop read a letter from Mr. Boyle, inclosing a letter from the Rev. William Sykes, chaplain to the forces, in which Mr. Sykes instructed him to hand over to the Bishop nine land warrants (for 1,440 acres) of the Manitoba & Northwestern Railway Company, to be applied by the Bishop as he shall see fit for church purposes.\n\nOn motion, the rules of order were suspended and the following resolution was unanimously adopted:\n\nMoved by Dean Grisdale, seconded by Mr. Wrigley,\n\nThat this Synod having just learned from Mr. W. L. Boyle of the generous gift by the Rev. W. Sykes, chaplain of the forces, of nine land warrants of the M. & N. W. Railway Company to the Bishop of the Diocese, hereby tenders its warmest thanks to Mr. Sykes for his thoughtful and acceptable gift.\n\nMoved by Dean Grisdale, seconded by Rev. Mr. Jukes, and resolved,\n\nThat the Bishop be requested to name a committee on Sunday Schools, to encourage the establishment and effective working of Sunday Schools throughout the Diocese.\n\nSubsequently the Bishop named the following committee:\n\nArchdeacon Pinkham, Convener, Mr. Wilson,\nDean Grisdale, Mr. Mulock,\nCanon Matheson, Mr. Fonseca,\nRev. E. S. W. Pentreath,\nCanon Coombes,\nCanon O'Meara,\nRev. H. H. Barber.\n\nMoved by Mr. Howell, seconded by Mr. Brydges, and resolved,\n\nThat the Secretary of the Synod procure a die to be struck, in accordance with the design of a seal already approved of,\nand such die so struck shall be the seal of this corporation; and further, that the Bishop of Rupert's Land, and in his absence his Commissary, shall be the custodian of the seal.\n\nMr. Daly, with the consent of his seconder, Mr. Bedson, obtained leave to withdraw his notice of motion to tax the outside parishes $2 each and those in Winnipeg $4 each, to defray the ordinary expenses of the Synod.\n\nMoved by Rev. M. Jukes, seconded by Rev. G. Atkins, and resolved,\n\nThat the Executive Committee be requested to adopt some more efficient means by which the amounts promised for clergymen's stipends by the various missions of the Diocese be regularly collected.\n\nThe discussion on this motion elicited brief speeches from Revs. H. H. Barber, T. N. Wilson, E. P. Flewelling, J. J. Morton, A. L. Fortin and Canon O'Meara, and Messrs. Daly, Crotty, Howell and others.\n\nOn motion, the rules of order were suspended and the following motion was introduced:\n\nMoved by Archdeacon Cowley, seconded by Mr. Gilroy, and carried by a standing vote,\n\nThat in view of the approaching visit of His Lordship the Bishop of Rupert's Land to England, the Synod desires to express its good wishes to him for a happy visit, a successful appeal on behalf of the funds of the Diocese, and a safe return to our midst.\n\nArchdeacon Pinkham, with the consent of his seconder, Mr. Brydges, obtained leave to withdraw his notice of motion on this subject.\n\nMoved by Mr. Henderson (for Rev. Mr. Pentreath), seconded by Mr. Carman, and resolved,\n\nThat the Synod regards with gratification the increasing interest in the work of the Church, as shown by an attendance of the laity larger than at any previous Synod, and impresses on both clergy and laity the obligation of attending Synod meetings except when hindered by necessity.\n\nResolved, on motion of Canon Matheson, seconded by Mr. Brydges, That this Synod, while recording its gratification at the result of the missionary meetings held in the different\nparishes during the past year, expresses the hope that they may be continued during the coming year, and, if possible, the work be extended.\n\nResolved, on motion of Rev. O. Fortin, seconded by Mr. Mulock, That the Rural Deans of the Diocese be requested to present at the annual meeting of the Synod reports of the work of the Church in their several Deaneries.\n\nResolved, on motion of Mr. Bedson, seconded by Mr. Gilroy, That Messrs. W. A. Henderson and W. J. Aikins, members of the Chartered Accountants' Association, be appointed auditors for the ensuing year.\n\nResolved, on motion of Mr. Brydges, seconded by Mr. F. H. Matheson, That the warm thanks of this Synod be offered the speakers at the missionary meeting last evening.\n\nResolved, on motion of Rev. Mr. Jeffery, seconded by Mr. Howell, That the Synod requests the Executive Committee to urge the C. M. S. and the participants in the lands of the society to convey their lands at Portage la Prairie to the parish there, and if this consent is procured, that the executive officers of this Synod do execute such conveyances as may be necessary, this course not to be taken unless the Executive Committee is satisfied that this action will place the parish in a good position.\n\nResolved, on motion of Mr. Daly, seconded by Rev. E. P. Flewelling, That the sincere thanks of the delegates to the Synod from places outside of the city are hereby tendered to the ladies and gentlemen of Winnipeg who have so kindly and generously extended their hospitality to such delegates during their attendance at Synod.\n\nResolved, on motion of Rev. H. H. Barber, seconded by Mr. J. W. H. Wilson, That the thanks of the Synod be given to the Rector and Churchwardens of Holy Trinity Church for their courtesy and kindness in extending the use of Trinity Hall and school house to the Synod.\n\nResolved, on motion of Rev. O. Fortin, seconded by Rev. M. Jukes, That the cordial thanks of the Synod are due and hereby tendered to the daily press of the city for their accurate reports of the proceedings and kindly furnished papers to the members.\n\nResolved, on motion of Mr. Gilroy, seconded by Mr. Daly, That the very best thanks of this Synod are tendered to the\nladies of the various city parishes for their great kindness in furnishing lunches for both days of the Synod.\n\nResolved, on motion of Rev. M. Jukes, seconded by Canon O'Meara, That the cordial thanks of this Synod be tendered the Canadian Pacific and Manitoba and Northwestern Railway Companies for their kind help in allowing members of the Synod to travel over their roads at reduced fare.\n\nResolved, on motion of Dean Grisdale, seconded by Mr. Brydges, That the warm thanks of the Synod be given to the lay secretary, Mr. Eden.\n\nThe minutes of the afternoon session were then read and confirmed, and the Synod was dismissed by the Bishop with the benediction.\nAPPENDICES.\nAn\n\nWith the sanction of the Secretary of State, the said Bishopric ceased to exist in 1896, and in 1897 the Diocese of Rupert was incorporated by Royal Charter. The petitioners respectfully pray for the following:\n\n1. That the said Bishopric be dissolved, and the said Diocese of Rupert be incorporated into the Diocese of Rupert.\n\n2. That the said Bishopric be dissolved, and the said Diocese of Rupert be appointed as a separate Diocese of Rupert. Provided, however, that such Diocese shall be subject to the provisions of the said Act, and that the said Diocese shall be constituted as a separate Diocese of Rupert, provided that the said Diocese shall be subject to the provisions of the said Act.\n\n3. That the said Bishopric be dissolved, and the said Diocese of Rupert be constituted as a separate Diocese of Rupert, provided that the said Diocese shall be subject to the provisions of the said Act, and that the said Diocese shall be constituted as a separate Diocese of Rupert, provided that the said Diocese shall be subject to the provisions of the said Act.\nAn Act to Incorporate the Synod of the Diocese of Rupert's Land.\n\n[Assented to 19th April, 1886.]\n\nWhereas a petition has been presented from the Bishop and the Synod of the Diocese of Rupert's Land, one of the Dioceses of the Ecclesiastical Province of the Church of England in Rupert's Land, praying that the Synod should be incorporated, and it is expedient to grant the prayer of the said petition. Therefore Her Majesty, by and with the advice and consent of the Legislative Assembly of Manitoba, enacts as follows:\n\n1. The Synod of the Diocese of Rupert's Land shall be and the same is hereby made and constituted a body politic and corporate under the name of the Synod of the Diocese of Rupert's Land, hereinafter called the corporation.\n\n2. The said corporation shall consist of the Bishop of the said diocese and his successors to be from time to time appointed in such manner as is or shall be provided by the Provincial Synod of the said Ecclesiastical Province, and of such other persons as are or may become members thereof, according to the constitution of the said Diocesan Synod as the same exists at the time of the passing of this Act (which constitution is set forth in schedule \"A\" of this Act) or as the said constitution may from time to time be altered by the said Provincial Synod, or by the Diocesan Synod, acting with the powers vested in it by the Provincial Synod aforesaid.\n\n3. Such corporation shall have perpetual succession, and a common seal, with power to change, alter, break and renew the same when and so often as they shall think proper, and the said corporation may, under the same name, contract and be contracted with, sue and be sued, implead and be impleaded with, answer and defend in all courts and places whatsoever; and the said corporation shall be able and capable, in law, respectively, to purchase, take, hold, give, receive, enjoy, possess, and retain without license in mortmain all messuages, lands, tenements, and immovable property, money, goods, chattels, and moveable property, which have been or hereafter\nshall be paid, given, granted, appropriated, devised or bequeathed to it or purchased by it in any manner or way whatsoever, to, for, or in favor of the eleemosynary, ecclesiastical and educational uses and purposes within the Province of Manitoba, of the Church of England, or Church of England in Rupert's Land, including thereby the uses and purposes of any parish mission, institution, college, school or hospital connected with or intended to be, or which may hereafter be connected with the Church of England in Rupert's Land.\n\n4. The corporation shall, in addition to the powers conferred upon it by the next preceding section of this Act, and subject to the provisions thereof, have power to sell, convey, exchange, alienate, mortgage, lease or demise any lands, tenements and hereditaments held by the said corporation, whether simply by way of investment for the uses and purposes set forth in the next preceding section of this Act or not, and the corporation may also, from time to time invest all or any of its funds and moneys, and all or any funds and personal property which may be vested in, or acquired by the corporation for eleemosynary, ecclesiastical or educational purposes aforesaid, in and upon any mortgage security of lands, tenements and hereditaments, and in other securities in any part or parts of Manitoba, and for the purposes of such investment may take, receive, and accept a mortgage or mortgages, or any assignment or assignments thereof, whether such mortgage or assignment be made and executed directly to it in its own corporate name, or to some other corporation or body politic and corporate, or to some company or person or persons in trust for it, and shall have and enjoy the same and as large, full and ample powers and rights of sale and foreclosure, action and suit upon and for the purposes of enforcing the covenants, stipulations, conditions and agreements, and all matters and things contained in such mortgages or any of them, and in as ample a manner as if it were a private person able and capable in law; and furthermore may sell, grant, assign and transfer such mortgages or any of them to any person, company or body capable of receiving any assignment thereof, and may release and discharge such mortgages or any of them, either wholly or partly.\n\n5. The said corporation shall, in the case of land held by it, be able to set apart a portion of such land for the purpose of making a road, or to make a free grant of a portion not\nexceeding one acre in extent for the purpose of a school, hospital or other necessary public object.\n\n6. It shall be lawful for the corporation of the Bishop of Rupert's Land, or any other corporation, or any person or persons, to transfer any property, real or personal, held in trust by him or them for the aforesaid eleemosynary, ecclesiastical or educational uses of the Church of England or the Church of England in Rupert's Land to the said corporation to be held in trust for the same purposes.\n\n7. It shall be lawful for the corporation of the Bishop of Rupert's Land to transfer to the corporation of St. John's College property, real or personal, held in trust for the college or for any professorship, lectureship, fellowship, scholarship, prize or other object connected with the college.\n\n8. It shall be lawful for the corporation of the Bishop of Rupert's Land to transfer to the corporation of the Dean and Chapter of St. John's Cathedral or to any of the corporations established under the Act known as \"Church of England Temporalities Act\" property, real or personal, held in trust for them or for their church or parish for any purposes whatever, either directly or indirectly.\n\n9. It shall be lawful for the several corporations, \"The Bishop of Rupert's Land,\" \"St. John's College\" and the \"Synod of the Diocese of Rupert's Land\" each to place in one fund for investment under its control all the various trust funds held by them respectively, and to divide the income from this one fund amongst the various trusts in proportion to the capital of each several trust.\n\nIn case it becomes necessary to withdraw the capital of any of the said trusts, the amount applicable to the trust shall be arrived at by division on the basis above set forth for the division of income.\n\n10. The said corporation may exercise all its powers by and through the executive committee as established by the constitution aforesaid, or such other boards or committees as the said corporation may from time to time appoint by resolution for the management of all or any of the affairs or property of the said corporation, but in accordance only with the trusts relating to any property to which any special trust is attached; the said Synod may also appoint a treasurer or\ntreasurers, and make such regulations for the management and administration of its property as it shall see fit. The corporation shall also have the right of appointing any officer or other needful agent or agents for the management of its affairs, and shall have all other rights necessarily incident to a body corporate.\n\n11. The terms, \"The Church of England,\" or the \"Church of England in Rupert's Land\" in all deeds, instruments and documents that have been heretofore or that may hereafter be executed, dealing with real or personal property within the Province of Manitoba, shall mean, unless a different construction is gathered from the deeds, instruments or documents, that portion of the Church of England in Rupert's Land within the Province of Manitoba.\n\n12. Any conveyance of real estate or any interest therein vested in the corporation shall be deemed to be duly executed for that purpose if the same has affixed thereto the seal of the corporation, verified by the signatures of the Bishop for the time being of the Diocese of Rupert's Land or his commissary duly appointed, and the secretary of the aforesaid executive committee, and a discharge of a mortgage if executed in the same way, shall be deemed to be properly and effectively executed.\n\n13. In all Acts of the Legislature of this province heretofore passed relating in any way to the Church of England, or to any of the ecclesiastical or educational institutions in any way connected therewith, and in all deeds, documents and other writings, heretofore executed where reference is made to the Diocesan Synod of Rupert's Land, either in direct terms or by implication, or to any officers or committees thereof, the same shall hereafter be construed as if the corporation hereby incorporated, and the committees and officers thereof were the body, and the committee and officers referred to in such Act, deed, document or writings instead of such synod committees and officers.\n\n14. Any conveyance of real estate, or any interest therein, vested in the corporation of the Bishop of Rupert's Land, shall hereafter be deemed to be duly executed for that purpose, if the same has affixed thereto the seal of the corporation of the Bishop of Rupert's Land, verified by the signature of the Bishop for the time being of the Diocese of Rupert's Land,\nor his commissary duly appointed, and discharge of a mortgage if executed in the same way, shall be deemed to be properly and effectually executed.\n\n15. All Acts and parts of Acts inconsistent with this Act are hereby repealed.\n\n16. This Act shall come into force on the day on which it shall receive the assent of the Lieutenant-Governor.\n\n17. This Act shall be deemed a public Act.\n\n---\n\nAn Act relating to Conveyances by the Corporation of the Bishop of Rupert's Land.\n\n[Assented to 28th May, 1886.]\n\nHer Majesty, by and with the advice and consent of the Legislative Assembly of Manitoba, enacts as follows:\n\n1. Hereafter, upon the conveyance of real estate or any interest therein, by the Corporation of the Bishop of Rupert's Land, it shall not be necessary to obtain the consent of the Executive Committee or the signature of the Chairman and Secretary, as required by section five of chapter forty-six of the Act of the Legislature of Manitoba, passed in the forty-fifth year of Her Majesty's reign, nor any other consent whatever, except such (if any) as is stipulated in any deed or other document conveying such land to the Corporation or under which the corporation has a right to convey the same.\n\nProvided, that the signature of the corporation of the Bishop of Rupert's Land shall be affixed in the presence of the Dean and one Canon or three Canons of the Cathedral Church of St. John's, who shall sign the same as witnesses of the signature of the said Bishop or Commissary appointed to act for the corporation, and as proof of the approval and concurrence.\n\n2. This Act shall come into force on being assented to.\nSCHEDULE A.\n\nThe Constitution of the Synod of the Diocese of Rupert's Land.\n\n1. The Synod shall consist of the Bishop of the Diocese; of the Clergy of the same licensed to the Cure of souls, or holding office in any College or school under the jurisdiction of the Bishop, and not under Ecclesiastical censure; and of Lay-Delegates as hereinafter provided. Clergymen who have been members of the Synod, and who continue to hold the Bishop's License, though they may cease to have the Cure of souls or to hold any other office, may continue to attend the meetings of the Synod and to vote thereat.\n\n2. The Lay-Delegates shall be Male Communicants of at least one year's standing; and one Delegate must always be a member of the congregation represented. They must be of the full age of twenty-one years. They shall be elected during Easter week, or if necessary afterwards, at a public meeting specially called for that purpose during Divine Service on the preceding Sunday. The voters shall consist of Male Communicants of the Parish of at least six months' standing, and a majority of those present shall determine the choice, but no person shall vote for the Delegate or Delegates of more than one congregation. The Incumbent or his Assistant shall preside at the meeting, and in their absence the meeting shall elect a Chairman from their own number.\n\nThe word \"Communicant\" shall mean \"one who has communicated at least three times a year where he has had opportunity of so doing.\"\n\n3. The Incumbent or Chairman shall furnish each Delegate with a Certificate as follows:\n\nParish or Mission of.......................\nCongregation of.......................Church\nNo. of Registered Communicants...........\n\nI hereby certify that at a meeting of the Communicants of this Congregation, held this......day of.......18........Mr.............was duly elected as a Delegate to the Synod for the current year.\n\n(Signed)..................Chairman.\nOne Clergyman and one Layman shall be appointed by the Synod to examine the certificates and report on them.\n\n4. Each Congregation recognized by the Bishop, duly organized by the election of Church Wardens and Vestrymen, and having at least six Registered Communicants, shall be entitled to send one Delegate; but two Delegates shall be sent if the number of registered Communicants is over forty; and three if it is over one hundred; but no Congregation shall send more than three Delegates.\n\n5. In case of the death or resignation of a Lay-Delegate, or his ceasing to be a member of the Congregation by removal from the neighborhood, or from any other cause, the Incumbent shall within one month after such vacancy proceed to a new Election, at a meeting of which notice shall have been given the previous Sunday during Divine Service.\n\n6. The Synod shall meet annually unless otherwise ordered by the Bishop, and the time and place of meeting shall be fixed by the Bishop, who shall also adjourn the Synod as he shall see fit.\n\n7. A Quorum of the Synod shall consist of at least one-fourth of the Clergy of the Diocese and one-fourth of the Lay-Delegates.\n\n8. No resolution of the Synod shall pass into a law without the concurrence of the Bishop and a majority of the Clergy and Laity present; the vote of the Clergy and Laity to be taken collectively unless a vote by Orders is demanded by any member of the Synod before the question is put from the Chair, when a majority of each Order will be necessary to affirm the resolution.\n\n9. That a committee be appointed to be called the Executive Committee, to consist of the Bishop or his Commissary as President, the Dean and Archdeacons as Vice Presidents, the Secretary and Treasurer of the Synod, and eight Clergymen and ten Lay-Delegates; and that seven be a quorum; That the Executive Committee shall take the management of the various Diocesan Funds under the direction of the Synod, carry out the decisions of that body, prepare business for the annual meeting of the Synod, and at such annual meeting give in a report of its proceedings.\n10. No alteration in the Constitution shall take place unless the proposition has been first sent to the Executive Committee for consideration, approved at the meeting of the Synod by the Bishop and a majority of two thirds of each Order present voting separately, and afterwards confirmed by the Bishop and a like majority of each Order at the following meeting of Synod.\nA Synopsis\n\nOf business transacted by the Executive Committee of the Synod of the Diocese of Rupert's Land, since the last meeting of Synod.\n\nMEETINGS.\n\nMeetings were held November 10th, December 16th, January 8th, March 3rd, April 7th, July 14th, and August 4th.\n\nOn 7th April, the Committee decided \"that the regular quarterly meeting shall take place on the second Wednesday in April (after this year), July, October and January, instead of the present dates of meeting.\"\n\nCOMMITTEES APPOINTED.\n\nThe Very Rev. the Dean and the Venerable the Archdeacon, to prepare a minute in reference to Bishop Anderson's death.\n\nOn the Revision of the Canons: C. J. Brydges, convenor, Archdeacon Pinkham and the Rev. O. Fortin.\n\nOn the Act for Incorporating the Synod: The Bishop (ex officio), the Secretary, the Treasurer, Dean Grisdale, Hon. J. Norquay, M.P.P., H. M. Howell, Q. C., and W. Winram, M.P.P.\n\nOn Hospitality: The Very Rev. the Dean of Rupert's Land or his representative, and the Rectors and Incumbents of the city churches—Rev. O. Fortin convener.\n\nRESIGNATIONS ACCEPTED BY THE BISHOP.\n\nRev. W. M. Ross, Russell.\nRev. S. Mills, Emerson.\nRev. W. L. Cheney, Boyne.\nRev. A. G. Pinkham, Norquay.\nRev. W. J. Garton, Gladstone.\nRev. A. W. Goulding, Poplar Point.\nRev. C. N. F. Jeffery, Clearwater.\nRev. H. E. Jephson, Manitou.\nAPPOINTMENTS.\n\nRev. I. C. Fortin, to Emerson.\nRev. W. L. Cheney, to Rourthwaite and Millford.\nRev. A. W. Goulding, to Stonewall and Victoria.\nRev. C. R. Littler, to Gladstone.\n\nSTIPENDS, GRANTS, &c.\n\nJanuary 8th. The grants from the Home Mission Fund were apportioned as follows:\n\nFor the year ending December 31, 1886:\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| Rev. T. Cook, Westburne     | $500.00|\n| Rev. T. N. Wilson, Nelson   | 500.00 |\n| Rev. A. Stunden, Rat Portage| 400.00 |\n| Rev. J. J. Morton, Birtle    | 500.00 |\n| Rev. J. Aikens, Nimitaw      | 500.00 |\n| Rev. G. H. Hooper, Springfield| 500.00 |\n| Rev. I. C. Fortin, Emerson   | 480.00 |\n| Rev. W. H. Lowry, Hamiota    | 500.00 |\n| Rev. T. C. Coggs, Souris     | 500.00 |\n| Rev. H. E. Jephson, Manitou   | 500.00 |\n| Rev. M. Jukes, Minnedosa     | 500.00 |\n| Rev. W. L. Cheney            | 480.00 |\n| Rev. A. W. Goulding, Poplar Point | 500.00 |\n| Rev. B. Mackenzie, Dynevior  | 500.00 |\n| Rev. W. A. Burman, Griswold  | 750.00 |\n| Rev. A. L. Fortin, St. Andrews| 500.00 |\n| Rev. N. C. Martin, Mapleton  | 500.00 |\n| Rev. C. N. F. Jeffrey, Clearwater| 650.00 |\n| Rev. F. F. Davis, Virden     | 400.00 |\n| Rev. A. G. Pinkham, Norquay  | 500.00 |\n| Mr. Tuson, Lay Reader        | 150.00 |\n\nSalary of Financial Secretary for the year ending September 30th: $1400.00\n\nRev. T. C. Weatherly, $5 per Sunday.\n\nAp. 7th. J. B. Ashby, $5 per Sunday to defray expenses while taking services during vacancy.\n\nJuly 14. The Committee voted $100 as a special grant to Rev. G. Turnbull.\n\nThe following resolutions were adopted January 8th and copies ordered to be sent out:\n\n\"That in view of the reductions being made in the grants from the English Societies, and from the urgent necessity of...\"\nopening new missions in places at present unprovided, it is necessary to commence a reduction in the grants to the older missions.\n\n\"That this can be done, now that the country is improving, and trade progressing.\n\n\"That each clergyman be informed that it will be necessary to revise the stipends to be granted from the Home Mission Fund in those missions which have been in operation two years, and that they bring this matter prominently before their congregations, so that their contributions may be increased to an extent at least equal to the reductions to be made in the stipends paid from the Home Mission Fund.\n\n\"That the first revision will be made on January 1st, 1887.\n\n\"That immediate steps be taken to organize a thorough system of collections throughout the Diocese in aid of the Home Mission Fund, so as to enable the Bishop, if possible, to supply the wants of the districts unprovided with the means of grace.\"\n\nS. P. C. K.\n\nAt the meeting held on Nov. 10, the Bishop announced a new block grant of £1,000 stg., given on the same conditions as the preceding one.\n\nA resolution of thanks was adopted and ordered to be sent to the secretary.\n\nThe following sums have been voted:\n\nNov. 10th. For Church at Beaconsfield . . . £21 0 0\nDec. 16th. For Church at Virden . . . . 32 0 0\nApril 7th. For Church at Musselborough . . 32 0 0\n\nResolution re Church at Poplar Point. An application having been made by the Incumbent for a grant in aid of the restoration of this Church, it was\n\nResolved—That the Committee does not feel that it is at liberty to give a grant from the block grant for this purpose, but that the Society be informed of the circumstances and asked either to give £21 stg. from the block grant, or from its general funds.\n\nIn reply to this resolution the Secretary announced that the Society did not feel itself at liberty to make such a grant.\nDONATIONS.\n\nNov. 10th.—The Bishop announced the following: £120 stg. from Rev. Mr. Baring, England; $3,000 for St. John's College, from Hon. (now) Sir Donald A. Smith.\n\nCONSENT REGARDING LAND.\n\n(a) Conveyance—\n\n1. By the Corporation, the Bishop of Rupert's Land, to the Parish of St. Luke's, Emerson, of the land and property on which the Church and Parsonage are built.\n\n2. By the same Corporation, to the Parish of the Church of the Ascension, Stonewall, of the land on which the Church is built.\n\n3. The assignment by the same Corporation, to the Council of St. John's College of mortgages belonging to the Professorships or General Endowment Fund of St. John's College.\n\n4. Conveyance by the Bishop of Rupert's Land of certain lands vested in him by foreclosure to Mr. Howell, Mr. Howell having paid the debt and interest.\n\n(b) Mortgage.\n\n1. All Saints', Winnipeg, to mortgage the land and property of the Parish for $12,000.00 and interest.\n\n2. The Incumbent and Church Wardens at Manitou to mortgage the church property at Manitou for the sum of $200.00.\n\n3. Ap.7, The same corporation to mortgage the Parsonage for the sum of $400.00 on formal application being made.\n\nMISCELLANEOUS RESOLUTIONS.\n\n1. Resolved: That in accordance with the action of the Board of Domestic and Foreign Missions of Canada, his Lordship be requested to appoint a Representative to visit Eastern Canada, and that his expenses be paid from the Home Mission Fund.\n\n2. Resolved: That in view of the large extent of settled country included within the boundaries of the various Deaneries, as at present constituted and pending an increase in the number of clergymen laboring among the new settlers, the Ruridecanal Chapters be hereby earnestly requested to make\nfrom time to time such arrangements as will result in an occasional visit to every Church family not included in a regular Parish or Mission in their respective Deaneries.\n\n3. Resolved: That a return be made as soon as possible of all churches, school houses, parsonages and other buildings in each Parish or Mission in the Diocese, giving the following particulars:\n\n1. Name of Parish or Mission.\n2. Description of building, with cost of same, amount of debt, if any, and in whose name vested.\n3. Exact locality where building is situated, and the tenure under which the land is held.\n\nThat the Secretary keep a record of these returns and add to it in future as new buildings are erected.\nSt. John's College Committee Report.\n\nWINNIPEG, 31st July, 1886.\n\nThe following resolution was passed at the last Synod:\n\n\"That the Most Rev. the Metropolitan be asked to name a committee of the Synod to be called the College Committee, to report upon everything relating to St. John's College and kindred institutions, financially and otherwise, with the view of strengthening the position of St. John's College in the Diocese.\n\nThe Bishop subsequently appointed the Committee as follows:\n\nThe Dean, Revd. Canon O'Meara, Revd. Canon Matheson, Hon. J. Norquay, H. M. Howell and C. J. Brydges.\n\nThe Committee will endeavor to place fully before the Synod all the facts relating to St. John's College and St. John's Cathedral, so that there may be a clear understanding as to the sources from which the funds have been derived and the uses to which they are applied.\n\nThe first question to be considered is St. John's Parish.\n\nST. JOHN'S CHURCH OR CATHEDRAL.\n\nThe Hudson's Bay Company, many years ago, set aside lot 43 in St. John's, otherwise known as lot 222 in the Company's official survey of Red River Settlement. The lot was conveyed to the present Bishop of Rupert's Land as a glebe for the Incumbent of St. John's Church. Ultimately, on the transfer of the country, the Dominion Government, as in all cases of quiet occupation at the time, gave a patent for the lot to the Bishop of Rupert's Land. This lot has a frontage of 20 chains on the Red River, and contains 331 acres, not including the outer two miles. Of the latter a patent was obtained for 155.12 acres, and with the scrip for the remainder, 360 acres of farm lands were obtained in N. ½ and S. W. ¼ of 27, 1, 10 w. The total acreage belonging to St. John's is thus 846 acres.\n\nLot 44, except a small piece which was conveyed by the Hudson's Bay Co. to the Leith trustees of the Bishopric, was the property of the late Bishop Anderson, and given by him to the present Bishop, to be disposed of at his discretion, but...\nespecially to supply the want of an Episcopal glebe. The Bishop has set apart a certain portion of this for St. John's College, including the site of St. John's College School, the residence formerly occupied by Dean Grisdale, Canon Matheson's house, and the two semi-detached masters' houses.\n\nThe church and churchyard of St. John's are partly upon lot 43 and partly on lot 44. The new college on the west side of Main street stands on a piece of land containing 4 acres, 3 of which are on lot 43 and one on lot 44. The residences of the Cathedral staff are partly on lot 43 and some on lot 44. West of Main street the land was all laid out in town lots or blocks.\n\nA considerable number of these lots and blocks were sold in the last three or four years. A portion of the purchase money was in every case paid in cash and the usual course is now in progress of dealing with sales which are in default.\n\nThe probability is that all the outer two miles, and a great part of the inner two miles, will by deed or foreclosure, revert to the Dean and Chapter to whom these properties will be transferred in trust by the Bishop.\n\nThe interest received last year on account of the Dean and Chapter was $4676.60. There was on 31st December, 1885, a cash balance on hand in favor of the Dean and Chapter of $11,030.38, waiting to be invested.\n\nThe sum of $4,676.60, received last year for interest, represents at 7 per cent. per annum, a capital sum of $66,800.\n\nThe further income of the Dean and Chapter will depend upon the amount realized from the mortgages now in arrear, and from future sales of land. It will doubtless be an increasing sum, as the land which they hold becomes valuable and is sold.\n\nThe total amount divided amongst the five professors who carry on the work of St. John's Parish and the scholastic work in the college and school was for the year 1885 as follows:\n\n| Description                                      | Amount   |\n|--------------------------------------------------|----------|\n| Interest on funds belonging to 5 chairs           | $4,045.16|\n| Interest received by Dean and Chapter of St. John's | 4,676.60 |\n|                                                  | $8,721.76|\n| Deduct paid to Archdeacon Pinkham, who takes no part in scholastic work | 705.43   |\n|                                                  | $8,016.33|\nPaid by College to Professor of Music........................................... $622 07\n\nTotal ................................................................. $8,638 30\n\nWhich, divided amongst the five professors, gives an average of $1,727 for the year 1885. In addition, several of the professors have a house free of rent.\n\nIn addition to the Parish work of St. John's, and the scholastic work of the college and school, the Cathedral staff takes charge of the Parishes of St. George's, in Winnipeg, and St. Paul's and Morris. They have also seen to the supply of the mission; in the country which are vacant. On the whole, the Cathedral staff, in addition to the three regular Parishes above referred to, have supplied during the last year, ministerial work to Portage la Prairie, Manitoba Penitentiary, Stonewall, Victoria, Poplar Point, High Bluff, and various other parishes or missions which have been vacant from time to time. In this work they have received valuable assistance from the senior students of Theology.\n\nIt should be stated that the Parish of St. John's, as such, yields no income to any of the Clergy attached to it.\n\nThe following statement will show exactly the receipts and expenditure of the Parish Church for the year ending Easter, 1886:\n\nReceipts—\n\nPew rents ......................................................... $242 50\nOrdinary offertories ............................................. 524 34\nSpecial ............................................................... 235 86\n\nTotal ................................................................. $1,002 70\n\nExpenditure—\n\nSexton's salary .................................................. $162 50\nOrganist's \" .................................................... 300\nSpecial offertories paid ........................................ 235 86\nFuel, oil, sundries, etc .......................................... 109 29\nInsurance .......................................................... 30\nRepairs .............................................................. 29 03\n\nBalance carried forward ........................................ $136 02\n\nST. JOHN'S COLLEGE.\n\nIn connection with the College there are five professorships, viz.:\n\n1. Systematic Theology.\n2. Exegetical \"\n3. Ecclesiastical History.\n4. Pastoral Theology.\n5. Music.\n\nIt will be desirable to give a brief history in regard to each of these chairs.\n\n1ST, SYSTEMATIC THEOLOGY.\n\nThe funds for these chairs have been provided by donations from individuals, and collections obtained in Canada by the Bishop, and by the Bishop of Saskatchewan, then Archdeacon McLean, and by the Bishop in England, mainly through his old friends. The S. P. C. K. added a grant of £500 sterling. The greater part was given specially, and distinctly designated as to be available for the maintenance of this chair in St. John's College and no other purpose whatever, and the remainder was as similarly designated by the Bishop, from funds placed at his discretion by friends.\n\nThese amounts have been from time to time invested in various securities, and the same result has followed these investments, as has been the case with all investments in this country during the last few years. Interest in several cases has been in default, values of properties have declined, mortgages have had to be, and must further be, foreclosed, and until this process has come to an end, the actual sum available for earning interest to be paid to the holder of this chair, cannot be positively ascertained or stated. The amount of interest received on account of the investment of this fund, during the year 1885, was $1,082.36, which at 7 per cent. represents a capital of $15,457.00. The final settlement of the mortgages will bring the fund, it is expected, to a larger amount than the sum just named.\n\n2ND, EXEGETICAL THEOLOGY.\n\nThe funds for this chair have been provided by a sum of £1,000 sterling given by some one in England and held in trust by the C.M.S. for the purpose of this chair, and which yields 3 per cent. per annum; also by another sum of £1,000, given by a Cambridge friend of the Bishop; also a grant of £500 from the S.P.C.K., and by £1,000 donated to this chair by the Bishop from gifts received by him from friends of the C.M.S. The previous remarks in regard to investments apply here, except as regards the sum of £1,000, held in trust by\nthe C. M. S. The interest received last year amounted to $1,094.58, which, allowing 3 per cent. for the C. M. S. money and the balance at 7 per cent. represents a total capital of $18,285.\n\n3RD, ECCLESIASTICAL HISTORY.\n\nThe funds for this chair are derived from various gifts from the Bishop of Rupert's Land, between July, 1874, and Dec., 1886, amounting to a total sum of $10,000; from a grant of £500 in favor of this chair by the S.P.C.K., and a sum of £500 sterling which was raised by the Bishop of Rupert's Land amongst his friends, and was augmented out of the surplus income when the Bishop of Rupert's Land held the chair.\n\nThe amount of interest received last year on investments for this chair was $1,142.90, which, at 7 per cent., represents a capital of $16,314.\n\n4TH, PASTORAL THEOLOGY.\n\nThe funds for this chair were mainly derived from a sale by the college of sites for the residences of Dean and Canons, who are also Professors of the college. This sum was $6,000. The interest received last year was $302.82. The capital of this fund may be stated at $6,500.\n\n5TH, MUSIC.\n\nThe Bishop gave towards this chair the sum of $2,000 from funds given him by friends, and a further sum of $6,000 has been donated from the Cathedral for land for the residences of the Professors. The interest received on account of this fund last year was $422.50. The capital of this fund may be considered as $8,500.\n\nThe total interest received last year for all the funds belonging to the five chairs was $4,045.16, which represents a total capital as follows:\n\n| Systematic Theology | $15,457 |\n| Exegetical Theology | 18,285 |\n| Ecclesiastical History | 16,314 |\n| Pastoral Theology | 6,500 |\n| Music | 8,500 |\n\nTotal | $65,056\n\nThe above is the interest-producing capital. As the mortgages in arrear are dealt with, these amounts will doubtless\nbe increased, just as will be the case, by the same process, in regard to the funds of the Dean and Chapter.\n\nThe Dean and Chapter and the chairs of the five professors have at present an active capital of, in all, $131,856. It would appear to be very desirable that all the old mortgages, not now yielding full interest, should be finally brought to an issue and the funds carefully invested, so as to produce a steady income.\n\nGENERAL ENDOWMENT FUND.\n\nThe interest of this fund is available for any of the purposes of the College. The Bishop commenced it several years ago with the hope of raising at least $50,000. The S.P.G. and S.P.C.K. each encouraged the effort by a vote of £1,000 on certain conditions. Since the last meeting of Synod, Sir Donald A. Smith gave $3,000 to this fund. This large gift raised the fund to the amount required for securing the grant from the S.P.G. That grant has been paid. The further gifts obtained by the Bishop, with the addition of sums raised in England by the Dean, and Archdeacon Pinkham, make up nearly $22,000. There is, besides, a mortgage for $3,000 on land, which is at present in default. This sum of $22,000 is at present lent to the College, forming part of its debt. When £9,000 or about $43,000 dollars is raised, the vote of £1,000 from the S.P.C.K. can be claimed. This must be raised soon, as the grant lapses if not claimed within five years.\n\nThis sum of $22,000, added to the total of $131,856 already stated, brings the total capital to the sum of $153,856.\n\nSCHOLARSHIPS.\n\nThere are the following scholarships in connection with the College against each of which is given the capital belonging to it.\n\n| Scholarship       | Capital |\n|-------------------|---------|\n| Cochrane          | $2,350  |\n| McCallum          | 1,200   |\n| Bunn              | 350     |\n| Prince of Wales   | 50      |\n| Toronto           | 102.50  |\n| McMurray          | 250     |\n| Charles           | 154.50  |\n| Macray            | 237.87  |\n| Isbister          | 1,300   |\n\n$6,695.87\nThe funds for these scholarships have been obtained by gifts from persons in this country or formerly connected with it. Amongst these contributors the Bishop of Rupert's Land gave an aggregate sum, divided amongst several of the scholarships, of $500.\n\nBUILDINGS.\n\nThe following is a list of buildings which have been erected and which have cost an aggregate sum of nearly $120,000, viz.:\n\n- Cathedral and Parish Church.\n- Old College School.\n- Divinity Hall.\n- Gymnasium.\n- Kingston Hall.\n- Professors' residence (Refuge).\n- Canon Matheson's house.\n- Canon Coombes' house.\n- Two semi-detached masters' houses.\n- The New College on Main Street, including the Warden's house.\n- The Dean's residence.\n\nIn 1881 it was decided to build the new college, and subscriptions and donations for that purpose have been collected from various sources, amounting to a total of about $25,000.\n\nThere is at present a debt upon the college of $60,900, upon about $22,000 of which, however, being part of the general endowment fund of the college, no interest is paid.\n\nOf the debt of $60,900, about $53,000 has arisen from the construction of the various college buildings, and the balance from the heavy payments of interest, from the cost of furnishing the new college and the double and excessive cost of carrying on two establishments in the year 1884. The college has seldom done more than about meet its current expenses, including repairs.\n\nThe charges for scholars are less than they are at Lennoxville, Port Hope and other first-class schools, whilst it is well known that the cost of living, and of all charges, especially fuel, have heretofore been very much higher here than in the east.\nNUMBER OF STUDENTS.\n\nThe following is a list of the number of students who have attended the college and school during the years 1866 to 1885, both inclusive. It is only since 1882 that a separation has been made between the boys attending the school and the students attending the college.\n\n| Year | Boys Students |\n|------|--------------|\n| 1866 | 29           |\n| 1867 | 36           |\n| 1868 | 42           |\n| 1869 | 36           |\n| 1870 | 28           |\n| 1871 | 28           |\n| 1872 | 29           |\n| 1873 | 47           |\n| 1874 | 69           |\n| 1875 | 74           |\n| 1876 | 75           |\n| 1877 | 68           |\n| 1878 | 69           |\n| 1879 | 80           |\n| 1880 | 78           |\n| 1881 | 87           |\n| 1882 | 81           |\n| 1883 | 71           |\n| 1884 | 76           |\n| 1885 | 70           |\n| 1886 | 69           |\n\nWORK OF THE COLLEGE AND SCHOOL.\n\nIn an appendix is given a synopsis of the work done during the past year.\n\nFINANCIAL WORKING OF THE COLLEGE AND SCHOOL.\n\nIn addition to the five professors, there are three masters employed in teaching, making a total staff of eight in all.\n\nThe accounts for the year 1885 have been audited by two members of this committee (Mr. H. M. Howell and Mr. C. J. Brydges), and the following is the result:\n\nReceipts for the year 1885 were—\n\n- Bishop of Rupert's Land ........................................... $187.50\n- Church Missionary Society ........................................... 771.18\n- Observatory grant and expenses .................................. 823.50\n- St. John's Cathedral organist's salary ............................ 300\n- Marriage license fees .................................................. 1,568.25\n- S.P.G. grant .............................................................. 614.57\n- University Scholarships ............................................... 405\n- Fees received from students and boys ......................... 14,101.69\n\nTotal ........................................................................... $18,771.69\n\nExpenditures for the year—\n\n- Salaries ................................................................. $3,900\n- Servants' wages ....................................................... 1,455\n- Interest paid ............................................................. 1,919.10\nInsurance .......................................................... $219.85\nFuel, oil and sundries ........................................... $1,060.97\nBread ...................................................................... $546.48\nMeat, fish, etc. ......................................................... $1,785.64\nGroceries .................................................................. $1,567.83\nClothing, medical attendance, etc. ............................ $1,301.67\nLaundry ..................................................................... $610.27\nBooks, printing, etc. .................................................. $735.76\nEnglish invoices ....................................................... $908.28\nRepairs to old buildings ............................................. $476.12\nRepairs to new college ............................................... $646.02\nUniversity scholarships ............................................. $355\nSteward's account .................................................... $1,010\nSundries .................................................................... $211.70\n\nTotal ........................................................................ $18,709.69\n\nCr............................................................................. $62.00\n\nFrom this it will be seen that the working of the college and school for the year 1885, about paid its way, with an aggregate of 90 students and scholars.\n\nST. JOHN'S LADIES' SCHOOL.\n\nThis school has a building which cost about $20,000 and stands on three acres of land. The furniture is worth $2,300. It has a consolidated debt amounting to $12,000, the interest on which is met by the Board of Governors by means of voluntary subscriptions. The interest is at 4 per cent. The school is under the management of Mrs. A. E. Cowley, who has thus kindly relieved the Board of Governors, for the time, from a very great responsibility.\n\nAt the recent examination, 58 pupils presented themselves. The Bishop of Rupert's Land is the President of the Board of Governors and Canon Matheson is Secretary-Treasurer.\n\nCONCLUSION.\n\nIt is hoped that this statement of facts will place the real and true position of the Cathedral and college before the members of the church throughout the Diocese, and dispel many illusions which have been in existence.\n\nIt is obvious that the machinery for the work in St. John's College, whilst barely sufficient to provide all the instruction which ought to be given in such an educational establishment, is beyond the present demands made upon it if judged solely by the number of students. But this is a\nmost fallacious test. The number of students and scholars could be very largely increased without requiring any additional teaching staff, except possibly upon special subjects. The present number of teachers are necessary to deal with all the subjects which have to be taught.\n\nIn other colleges the number of students is no larger, and in some cases less, than at St. John's.\n\nIn King's College, Windsor, the last term closed with 23 students, of whom four were graduates.\n\nAt Trinity College, Toronto, four degrees of B.A. were conferred.\n\nAt Morin College, Quebec, there are six professors representing the subjects of the course in arts. It had 22 students and sent up six successful candidates for the degree of B.A.\n\nAt Lennoxville there were 21 students and 62 boys. In connection with that college there are four professors and five masters.\n\nAt St. Francis College, Richmond, there are five professors and lecturers and twelve students.\n\nAt St. John's there were 21 students.\n\nIt is of vital importance that every effort should be made to increase the numbers of those who attach themselves to St. John's. As the country progresses in numbers and wealth there should be no difficulty in accomplishing this.\n\nNot only is the education afforded equal to anything which can be obtained in any part of the Dominion of Canada, but St. John's offers almost the only possible means of supplying the wants of the Diocese in regard to missionary clergymen.\n\nIt would not be proper to close this report without directing special attention to the manner in which the Bishop of Rupert's Land has personally aided the work which he has undertaken and directed.\n\nThe Bishop has lent considerable sums of money from time to time, to aid the college, out of the Episcopal Endowment fund, charging only 4 per cent. on the sums thus lent; thus so far as those loans were concerned diminishing his income from them by considerably more than one-half.\n\nIn addition, the Bishop has given absolutely very large\nsums of money to the building fund of the college, to the chair of Ecclesiastical History, to scholarships, to the Ladies College, to the general endowment fund, and to various other objects in connection with the college. The aggregate of these figures would reach a very large sum indeed. But large as is the total, it forms but a portion only of the earnest, self-sacrificing spirit in which the Bishop has devoted his untiring energy and zeal in the promotion of the objects which have been so dear to his heart.\n\nJOHN GRISDALE. H. M. HOWELL.\nJ. D. O'MEARA. C. J. BRYDGES.\nSAM. P. MATHESON.\n\nAPPENDIX.\n\nThe number receiving instruction in the various classes of the college during the year ending midsummer, 1886, has been 90, of whom 21 were in the Theological and Arts Department and 69 were in the College School or taking courses preparatory to the study of Law or Medicine.\n\nSeven students attended theological lectures, their standing being as follows:\n\nFinal Year—M. Scott.\n\nFirst and Second Years—C. R. Littler, H. M. Drummond, W. D. Barber, A. Cook, B.A., J. G. Anderson and J. W. B. Page.\n\nThe list of students in the Arts Department is as follows:\n\nSenior B. A.—J. H. Black, J. G. Anderson and H. W. Herchmer.\n\nJunior B. A.—H. M. Drummond, J. L. Doupe, W. D. Barber, Alex. Cram, W. R. Ross, H. Cook.\n\nPrevious Year—E. E. Phair, J. W. B. Page, C. Girdlestone, H. Wrigley, G. H. Bird, H. G. Fisher, F. Mercer.\n\nMedical Matriculation—H. F. Forrest.\n\nPreliminary Year—R. McLean (as a student of the College), G. Camsell, T. H. Pritchard, E. Camsell, F. Camsell, H. Norquay, S. Adams, W. Traill, H. Abell, (Boys of the College School).\nConnected with College School there were 69 pupils. During the year there were 61 boarders resident in the College and College School.\n\nIn the Theological Department lectures were given by the Bishop of Rupert's Land in Liturgiology. In Pastoral Theology and Homiletics by the Very Rev. Dean Grisdale.\n\nIn Systematic Theology and Apologetics lectures were given by Canon O'Meara. This included lectures on the Creeds and Articles and Evidences of Christianity, special attention being given to the modern aspects of unbelief.\n\nIn Exegetical Theology, Canon Matheson read critically with the students St. John's Gospel, the Acts of the Apostles, and the Pastoral Epistles in Greek, and Gen. chaps. 1-7, Psalms 1-7 in Hebrew and Septuagint. The students also read with him Hebrew Grammar, Westcott's Bible in the Church and Maclear's Old and New Testament History.\n\nCanon Machray, Professor of Ecclesiastical History, gives lectures on the history of Church during the first three centuries and also in the history of the Church of England.\n\nARTS DEPARTMENT.\n\nThe Bishop of Rupert's Land took the Mathematics of the Honor Course, the Pass, Previous and Preliminary Mathematics. He also lectured in Physics and Latin Prose.\n\nDean Grisdale took the English of the Previous Year and also lectured in the English work of the Modern Language Honor Course, covering portions of the works of Chaucer, Spencer, Shakespeare, Bacon, Cowper, Pope, Addison and Steele.\n\nCanon O'Meara lectured in Mental and Moral Sciences, taking also the Pass work in Ethics and Logic, and the Classics and Botany of the Previous Year.\n\nCanon Matheson took the Fourth and Fifth forms in the College School. This includes the Classical and English subjects of the Preliminary Examination and most of the Preparatory work for select courses.\n\nCanon Coombes lectured in Honor Classics, including Latin and Greek Prose. He also took the German of the Honor Modern Language course.\n\nMr. J. Fawcett, M.A., was engaged to give, during the year, lectures in Natural Science and Pass Chemistry.\nST. JOHN'S COLLEGE SCHOOL.\n\nThe School is divided into five Forms and Under School. As mentioned above, Canon Matheson takes the 4th and 5th Forms. The 3rd Form and 1st Mathematics are taken by T. Warburton, Esq., M.A. Mr. Warburton is also writing master.\n\nThe 2nd Form is taken by Canon Macray, and the 1st Form, Senior Arithmetic and Bookkeeping by E. Hamber, Esq.\n\nThe Under School and Junior Arithmetic classes are taken by senior students.\n\nDuring the first part of the past academical year all the French classes were taken by Rev. I. C. Fortin, B.A., resident tutor. He was succeeded at Christmas by Mr. A. W. Kincaid who also took the Senior Mathematics and some of the select courses.\n\nMr. E. Hamber gives instructions in Vocal and Instrumental Music in both the College and School.\n\nTwenty students presented themselves at the University Examinations in May, 1886, of whom three were admitted to the Degree of B.A. in Classical Honors.\n\n| Subjects                  | Number |\n|--------------------------|--------|\n| Junior B.A. in Classical Honors | 2      |\n| in Mathematical Honors    | 1      |\n| in Mental and Moral Science | 1     |\n| in Modern Language Honors | 1      |\n| in Natural Science Honors | 1      |\n| Previous Examination      | 8      |\n| Preliminary Examination   | 3      |\n\nOf these 9 gained scholarships, one took a medal in Honor Classics and one the Governor General's Bronze Medal.\n\nOut of the 8 Isbister Prizes offered by the University for Classics, 7 were won by pupils of the College School. One Mathematical prize was also gained by a pupil of the College School.\n\nScholarships to assist young men preparing for the University are given by the S.P.C. and S.P.C.K.; and by the C.M.S. to those preparing for work among the Indians in its missions.\n\nCanon O'Meara acts as Deputy Warden of the College; Canon Combes as Dean and Librarian.\n\nCanon Matheson continues to act as Steward and Accountant of the College, and also Deputy Head Master of the Col-\nlege School. Dean Grisdale has fulfilled the duties of Bursar of the College since the beginning of 1885.\n\nSt. John's College Church Society and St. John's College Literary Society are still in active operation, affording great advantages to their members. The College School has also a Literary Society, Reading Room and Library.\n\nDuring the past academical year a College Magazine has been established, which promises to be of great service and interest to the alumni and friends of the college.\nTreasurer's Report.\n\nTo the Executive of the Diocese of Rupert's Land:\n\nAs the Synod is to meet this year on the 5th of August, it will be impossible to give a statement of the accounts for the whole year, which ends on the 30th of September.\n\nI, however, give a summary of the accounts for nine months ending 30th June, 1886.\n\nHOME MISSION FUND.\n\nThere is a credit in these funds of $1,281.37.\n\nSince the last Synod the S.P.G. have made a special grant of £200, thus leaving their annual grant for the present year the same as before, and have promised to continue it without deduction also for next year.\n\nI have repaid the Bishop the sum of $750 borrowed last year.\n\nConsiderable sums have been collected in Eastern Canada by Archdeacon Pinkham and Canon O'Meara, in response to the appeals which have been made. The collections throughout the Diocese have been considerably in excess of last year. There will be an amount of about $1,200 to receive from the Endowment Fund for interest before the close of our fiscal year.\n\nWIDOWS' AND ORPHANS' FUND.\n\nThere is a balance on hand, to be paid over to the Bishop, of $187.13.\n\nINDIAN MISSION FUND.\n\nThere is a debit against this account of $202.15, but since the account was made up a sum of $121.65 has been received from the C.M.S., leaving the debit $80.59.\n\nI purpose making up the accounts in the usual way, and in full detail, to the 30th Sept., 1886, which closes our fiscal year, and when they have been audited, they can be printed and distributed.\n\nC. J. BRYDGES,\nTreasurer.\n\nWinnipeg, 15th July, 1886.\n### HOME MISSION FUND\n\n**IN ACCOUNT WITH C. J. BRIDGES, TREASURER.**\n\n| DR.                                                                 | Amount   |\n|--------------------------------------------------------------------|----------|\n| To Stipends                                                        |          |\n| Paid Clergyment Expense                                            | $7,373.72|\n| Sundry Disbursements                                               | $884.05  |\n| Secretary's Salary                                                 | $1,306   |\n| S. P. G.                                                           |          |\n| Bishop of Rupert's Land                                            |          |\n| For Scholarships and Cathedral Mission Staff, etc.                 | $973.03  |\n| Petty Cash                                                         |          |\n| Endowment Fund                                                     |          |\n| Amount advanced to Secy                                            | $113.15  |\n| Bishop of Rupert's Land, return of Loan                            | $750     |\n| Travelling Expenses                                                | $403     |\n| Balance                                                            | $1,281.37|\n\n**By Balance, 1st Oct., 1885**  \nAssessments  \nSundry Parishes  \nCollections and Subscriptions  \nSundry Collections and Donations  \nS. P. G.  \nC. M. S.  \nC. & C. C. S.  \nEndowment Fund  \nInterest  \nInterest on Deposit  \nMerchants' Bank  \nCollections in Eastern Canada  \nBy Ven. Arch. Pinkham  \nRev. Canon O'Meara\n\n$13,084.32\n\nWinnipeg, 17th July, 1886.\n### INDIAN MISSION FUND\n\n**IN ACCOUNT WITH C. J. BRYDGES, TREASURER.**\n\n| Description                                                                 | Amount   |\n|-----------------------------------------------------------------------------|----------|\n| To balance 1st October, 1885, overdrawn                                    | $136.70  |\n| Stipends—                                                                  |          |\n| Paid clergymen                                                              | $562.50  |\n| **Total**                                                                   | $699.20  |\n| By C. M. S. grants                                                          | $364.97  |\n| By Collections                                                              | $132.08  |\n| By balance overdraft                                                        | $202.15  |\n| **Total**                                                                   | $699.20  |\n\nWINNIPEG, 14th July, 1886.\n\n---\n\n### WIDOW AND ORPHANS’ FUND\n\n**IN ACCOUNT WITH C. J. BRYDGES, TREASURER.**\n\n| Description                                                                 | Amount   |\n|-----------------------------------------------------------------------------|----------|\n| To Bishop of Rupert’s Land—                                                 |          |\n| On account of amount collected                                              | $237.82  |\n| To balance                                                                  | $187.13  |\n| **Total**                                                                   | $424.95  |\n| By balance, 1st October, 1885                                               | $237.82  |\n| By Collections—                                                              |          |\n| Sundry collections, subscriptions & donations                               | $187.13  |\n| **Total**                                                                   | $424.95  |\n\nWINNIPEG, 14th July, 1886.\nArchdeacon Pinkham's Report.\n\nTo the Most Reverend, the Metropolitan of Rupert's Land.\n\nMy Lord,—I beg to submit my report of the two visits I have made to Eastern Canada, to represent to our brethren there the needs of the Church in this Diocese.\n\nMy mission grew out of certain action taken by the Domestic and Foreign Missionary Society of the Church of England in Canada, as shown in the following resolutions adopted by its Board of Missions last autumn:\n\n1. \"Moved by the Bishop of Niagara, seconded by Mr. R. T. Walkem,—That in the event of the Bishop of Rupert's Land sending a Representative to set before the congregations in this ecclesiastical Province, the pressing needs of the newly settled regions of Manitoba, the Board will extend to him a hearty welcome, and, so far as their influence can reach, will promote his efforts.\n\n2. Moved and seconded by the same,—That this Board, consisting of the Bishops and clerical and lay representatives of each Diocese, do authorize their chairman acting on their behalf, to furnish the representative of the Metropolitan of Rupert's Land with a letter of strong recommendation to the Bishops and clergy of all the congregations in all the Dioceses, urging them to extend to him all the aid in their power in presenting to their congregations the pressing needs of the Church of England in Manitoba, and inducing them to contribute liberally towards them.\n\n3. Moved by Mr. R. T. Walkem, seconded by Mr. A. H. Campbell,—That a return of the monies received by the Representative of the Bishop of Rupert's Land be sent to the Treasurer of the particular Diocese in which they are collected, as well as to the Treasurer of the Board of Missions.\n\nJ. T. ONTARIO, Chairman.\nC. H. MOCKRIDGE, General Secretary.\n\nUpon the receipt of these resolutions, your Lordship was pleased to issue the following commission:—\n\"Understanding that I am authorized by the 'Board of Management of the Domestic and Foreign Missionary Society of the Ecclesiastical Province of Canada,' consisting of Bishops and clerical and lay representatives of each Diocese, to send a Representative to urge upon the congregations in the Ecclesiastical Province of Canada the pressing needs in the newly settled regions of Manitoba, covering in fact now almost the whole of the Province of Manitoba, and that this Representative will, at the request of the Board, be furnished with a letter of strong recommendation from the Chairman of the Board to the Clergy of all the congregations in all the Dioceses, urging them to extend to him all aid in their power in presenting to their congregations the needs of the Church in this Diocese, and in inducing them to contribute liberally towards them I hereby nominate as such Representative the Venerable W. C. Pinkham, B. D., Archdeacon of Manitoba, and Secretary of the Synod.\"\n\nR. RUPERT'S LAND,\n\nBISHOP'S COURT, WINNIPEG,\nNovember 18th, 1885.\n\nImmediately after receiving this authorization I set out for Ottawa to obtain from the Bishop of Ontario as Chairman of the Board, the letter referred to in the resolutions, and his Lordship was good enough to honor my application by giving me the following:\n\n\"To the Bishops and Clergy of all the congregations in all the Dioceses of the Ecclesiastical Province of Canada:\n\nDEAR BRETHREN,—\n\nIn compliance with the foregoing resolutions of the 'Board of Management of the Domestic and Foreign Missionary Society of the Church of England in Canada,' I hereby commend to your Christian sympathy and liberality the appeal to be made by the Ven. Archdeacon Pinkham, the accredited Representative of the Metropolitan of Rupert's Land. The needs of Manitoba are great and urgent, and now is the time to lay the foundations of the Church there deeply and strongly, in the confident hope that we are doing the Master's work in a land that will become, before many years have elapsed, the home of multitudes of our Church and nation.\n\nI am, yours faithfully,\n\nJ. T. ONTARIO,\nChairman of D. & F. Missionary Society.\nOTTAWA, 24th Nov., 1885.\"\nDuring this visit I preached twice in Ottawa, twice in Peterborough, twice in Hamilton and several times in Toronto; addressed meetings of Clergy in Ottawa and Toronto, the Bishops of Ontario and Toronto being respectively present, and at Arnprior; and meetings of Churchwomen at Ottawa, Toronto and Peterborough, the Bible class at the Church of the Ascension, Toronto, and the Sunday schools at St. Thomas Church, Hamilton. At the meetings of Clergy in Ottawa, and after the Bishop had spoken of his visit to the Northwest and of the number of friends and acquaintances who greeted him wherever he went, the following resolution was unanimously adopted on motion of Rev. H. Pollard, seconded by Rev. P. Owen Jones:\n\n\"That we, the Ottawa Clerical Guild thank the Venerable Archdeacon Pinkham for the valuable information he has given us in relation to the Missionary Diocese of Rupert's Land: we cordially sympathize with the work of the Diocese, and will undertake to support it to the best of our power.\"\n\nNo offertories were given or asked for, but promises were made that when collections were taken in behalf of Domestic Missions the claims of the Diocese of Rupert's Land would receive a larger measure of assistance than has been hitherto accorded them. Aid was promised from several Sunday schools, and the active co-operation of Church women in the different places visited, several of whom expressed enthusiastic sympathy with our work and an earnest desire to help us to carry it on, may be confidently expected. The Ottawa Women's Auxiliary unanimously voted its collection taken at its quarterly meeting, which I addressed, to the Diocese of Rupert's Land.\n\nThe sum received for the Diocese during this visit, amounted to $1190.75, of which $504.00 or $42.00 per month comes from St. George's Church, Ottawa. A detailed statement was rendered to the Executive Committee on April 7th.\n\nMy return to Manitoba at Christmas was rendered necessary by the understanding come to with the Board of Missions, that your Lordship's Representative should not press the claims of this Diocese during the season of Epiphany, when appeals are made for Foreign Missions.\n\nOn April 13, I again set out for Eastern Canada, my duties in the Diocese having engrossed my attention till that date. On\nthat occasion I visited Montreal, Quebec, St. John, N.B., Kingston, Port Hope, Hamilton, Guelph, St. Catharines, Niagara, Brantford, London, Galt and Hespeler. The Metropolitan of Canada, whom I met in St. John, most kindly invited me to preach in his cathedral, at Fredericton; and Revs. Dr. Partridge and F. Murray urged me to visit Halifax, and promised to aid me to the utmost of their power, but my previous arrangements rendered it impossible for me to accept either of these invitations; and, later on, I was obliged to decline invitations to Clinton, Woodstock, Petrolia and other places.\n\nI was present at the meeting of the Board of Missions, held at Quebec, May 5th, and was one of the speakers at the Missionary Meeting held under its auspices, but the Board could not find time to hear the statement I desired to make, and the members present contented themselves with brief answers to one or two questions.\n\nOn the invitation of the Bishop of Niagara, whose kindness I shall never forget, I was a speaker at the Missionary Meeting held in connection with the annual session of his Synod, and I was accorded a place in the Synod services and a seat on the floor of the House. Similar privileges were accorded me in London, in the Synod of the Diocese of Huron, whose missionary meeting I also addressed.\n\nThe Bishop of Niagara gave another illustration of the sympathy he had for us—a sympathy that his elevation to the high office of Bishop is certain to deepen and intensify—by devoting the offertory on the first day of Synod to the Diocese of Rupert's Land.\n\nBesides preaching in the cities and towns I have named, I addressed St. Paul's Sunday School at Kingston, and the Sunday School at Guelph, on our Indian work, which they are most kindly aiding. I also addressed the Sunday School at Port Hope, the Bible Class in connection with St. George's Church, Guelph, the Girls' Friendly Society, Kingston, and the Kingston branch of the Women's Auxiliary; and conducted Divine Service at the Brantford Institution for the Blind.\n\nFinding, while in Montreal, that the idea of supporting one particular mission in this Diocese was a popular one with prominent and influential members of the St. George's and Christ Church Cathedral Congregations, I wrote to the Rectors of these churches (The Very Rev. the Dean of Montreal, and Rev. J. G. Murray) for New York, and the clergy of the Rectories, thus kindled the mission spirit.\n\nOf course, I represented.\n\nFrom the moment that he heard of my growing sympathy, count me among those who remain convinced that he knows best what is necessary to promote the welfare of Canada, and that the raising of funds for the mission to the Indians will be done in dearth, and that the measure will be approved by her Majesty.\n\nIn the midst of all this felt the assurance that in my time, and in my own, God will be glorified, and of course, I am more convinced than ever that I am called to a special work of the Holy Spirit, and that this is the same work that is all about me to characterize my life. How can I fail in their cause? How can I fail with them? How can I fail to dedicate myself to them? We must do what we have to do, and serve the Lord.\nJ. G. Norton), asking them to give us the required grant for Neepawa and Oak Lake respectively, and promising that the clergyman, when appointed, should report quarterly to the Rector of the congregation contributing the grant, and thus keep up a direct supply of information. To this proposition I have had no reply.\n\nOf course the sums actually received do not by any means represent the interest that we may hope has been stirred up.\n\nFrom the kindness everywhere shown me and the interest that has been awakened, I think we may feel that there is a growing sentiment in our favor in Eastern Canada, and may count upon increased assistance for our Church work. But it remains to be seen whether the presence of a living agent who knows whereof he speaks, will not be from time to time necessary to keep up the interest and make the supply of means that are so urgently needed flow steadily in. No doubt the Canadian Church will embrace the opportunity that the meeting of her General Synod next September will afford, to turn to the best account the three years' experience she has gained in dealing with Mission work, and will then devise such measures as will give that work a foremost place in the hearts of her people.\n\nIn telling our brethren in the east the story of our needs I felt that to speak only of funds would by no means exhaust my theme. I have spoken of our need, never so great as it is now, of men, living men, men of good report full of the spirit and of wisdom; but I am much mistaken if our need is not more or less felt in every Diocese in the Dominion. I believe I am not alone in thinking that throughout Canada to-day the special want of the Church is such a baptism of the Holy Spirit as to make men remember that the work of the ministry is the noblest of all works, and that if there were to-day the same faith, the same zeal, the same forgetfulness of self in the all absorbing duty of striving to lead men to God, that characterized the times of the Apostles, similar results would follow. How many of our leading people think of the pastoral office for their sons? How many mothers in the land whose sympathy with every form of good work shews that they love the Lord, dedicate their sons in infancy to the highest of all employments? We must put this work on the very highest plane; we must have the very best of Canada's sons bearing the Ark of the Lord.\nEngland is to-day sending out some of her best and most gifted sons for Mission work in all parts of the heathen world; will Canada refuse her best to lay the foundations of Christ's kingdom in this new part of the Dominion on whose future so many high hopes are built?\n\nIf then this be our great want, let us resolutely set ourselves to the task of supplying it, and we know that we can confidently look to the Lord of the Harvest to bless all means that are used to call and send forth laborers into His Harvest.\"\n\nI am,\n\nMy Lord,\n\nEver dutifully yours,\n\nW. CYPRIAN PINKHAM.\n\nWINNIPEG, June 26, 1886.\n## SUMS OBTAINED DURING AUTUMN VISIT.\n\n### Diocese of Toronto.\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| A. H. Campbell              | $25.00 |\n| Perkins, Ince & Co.         | 10.00  |\n| Mrs. R. G. Dalton           | 10.00  |\n| Fred K. Perkins             | 10.00  |\n| Henry Cawtha                | 25.00  |\n| J. W. C. Whitney            | 25.00  |\n| G. B. Osler                 | 25.00  |\n| R. H. Bethune               | 20.00  |\n| E. F. Hebden                | 15.00  |\n| R. Gooderham                | 25.00  |\n| B. H. Dixon                 | 25.00  |\n| Joseph Cawthra              | 20.00  |\n| Mrs. J. Cawthra             | 10.00  |\n| Sheriff Jarvis              | 10.00  |\n| A Friend                    | 10.00  |\n| Mr. Brough                  | 5.00   |\n| Mr. McDonald                | 2.00   |\n| A Friend                    | 2.00   |\n| A Friend                    | 1.00   |\n| John Catto                  | 2.00   |\n| Rowsell & Hutchinson        | 4.00   |\n| A Lady                      | 2.00   |\n| Miss Dalton                 | 2.00   |\n| Mrs. Wilson                 | 5.00   |\n| John Hague                  | 5.00   |\n| T. Tilt                     | 5.00   |\n| S. G. Wood                  | 5.00   |\n| J. A. Worrell               | 2.00   |\n| Mrs. Riordan                | 3.00   |\n| J. Gillespie                | 5.00   |\n| A Lady                      | 5.00   |\n| Thomas Hodgins              | 5.00   |\n| G. Hohnstead                | 2.00   |\n| C. H. Tout                  | 2.00   |\n| J. Sloan and F. W. Mason    | 2.00   |\n| Mrs. Miller                 | 1.00   |\n| Allan MacDougall            | 5.00   |\n| H. & C. Blachford           | 5.00   |\n| Mrs. Edmund Baldwin         | 5.00   |\n| Chief Justice Haggarty      | 5.00   |\n| Mrs W. A. Baldwin           | 5.00   |\n| Col. Gzowski (sent to Bishop)| 50.00  |\n| S. H. Blake                 | 25.00  |\n| C. J. Campbell              | *25.00 |\n| N. W. Hoyles                | 10.00  |\n\nTotal: $467.00\n\n### Peterborough.\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| Rev. V. Clementi            | $5.00  |\n| H. A. Hammond               | 5.00   |\n| Robert Morrow               | 10.00  |\n\n*Not paid.*\n\n### Diocese of Ontario.\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| A Lady                      | $10.00 |\n| H. J. Noel                  | 10.00  |\n| G. W. Wickstead             | 5.00   |\n| W. R. Wright                | 5.00   |\n| T. H. Perley                | 5.00   |\n| W. H. Rowley                | 5.00   |\n| T. A. Motherwell            | 5.00   |\n| Mr. Wickstead               | 5.00   |\n| Hon. J. Carling             | 5.00   |\n| Dr. H. P. Wright            | 5.00   |\n| Dr. Hill                    | 4.00   |\n| Mrs. Lewis                  | 3.00   |\n| Messrs. F. & J. Grant       | 2.00   |\n| Mrs. Macdougall             | 5.00   |\n| Miss Chesley                | 2.00   |\n| Mrs. Rowan Legg             | 2.00   |\n| J. E. Parker                | 1.00   |\n| Gipsey                     | 1.00   |\n| Mrs. O'Meara                | 2.00   |\n| A Lady                      | 1.00   |\n| C. H. Pinhey                | 1.00   |\n| A Friend                    | 5.00   |\n| Ottawa Women's Auxiliary collection at the quarterly meeting | *18.00 |\n| St. George's                | +504.00 |\n\nTotal: $611.00\n\n### Diocese of Niagara.\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| Mrs. Fuller                 | $15.00 |\n| V. S. Fuller                | 10.00  |\n| C. Bartlett                 | 5.00   |\n| W. E. Sanford               | 5.00   |\n| F. W. Gates                 | 10.00  |\n| Mrs. O'Reilly               | 2.00   |\n| A Friend                    | 25     |\n| E. Brown (cheque)           | 12.00  |\n| Mrs. Hamilton               | 5.00   |\n\nTotal: $64.25\n\n*To be sent by treasurer of Board of Missions.*\n†Sent in monthly payments of $42.\n## Recapitulation\n\n| Location       | Amount   |\n|----------------|----------|\n| Toronto        | $467.00  |\n| Peterborough   | 48.50    |\n| Ottawa         | 611.00   |\n| Hamilton       | 64.25    |\n| Total          | $1,190.75|\n\n## Sums Obtained During Spring Visit\n\n### Diocese of Montreal\n\n#### Montreal\n\n- Sir George Stephen: $50.00\n- Hon. J. Hamilton: 50.00\n- A. F. Gault: 25.00\n- George Drummond: 25.00\n- H. Shorey & Co.: 25.00\n- James A. Graham: 20.00\n- R. W. Shepherd: 10.00\n- George Hague: 10.00\n- J. W. Mills: 10.00\n- Edward Radford: 10.00\n- W. J. Buchanan: 10.00\n- John S. Shearer: 10.00\n- George Lightbound: 10.00\n- Dr. R. P. Howard: 10.00\n- F. W. Thomas: 10.00\n- Hugh Lumsden: 10.00\n- R. A. Smith: 10.00\n- R. R. Grindley: 10.00\n- Hector Mackenzie: 10.00\n- Mrs. Abbott: 5.00\n- H. W. Shepherd: 5.00\n- S. Carley: 5.00\n- J. Crathern: 5.00\n- W. W. L. Chipman: 5.00\n- W. D. M. Maier: 5.00\n- E. S. Clouston: 5.00\n- John Kenny: 5.00\n- J. W. Marling: 5.00\n- John Crombie: 5.00\n- R. Evans: 5.00\n- Miles Williams: 5.00\n- W. M. Tait: 5.00\n- Edward Rielle: 5.00\n- R. Hampton: 5.00\n- C. N. Read: 5.00\n- Miss Orkney: 5.00\n- Thomas Musson: 5.00\n- A Friend: 5.00\n- W. Donahue: 4.00\n- A Lady: 2.00\n- A Lady: 25\n- R. W. Shepherd, Jr.: 2.00\n- C. C. Foster: 2.00\n- A Friend: 2.00\n- Robert Hall: 2.00\n\n#### Quebec\n\n- Robert Hamilton: $200.00\n- Mrs. Lawrie: 10.00\n- R. R. Dobell: 10.00\n- T. Beckett: 10.00\n- W. Ray: 10.00\n- F. Porteous: 10.00\n- James G. Chapham: 10.00\n- R. W. Smith: 5.00\n- W. Stephenson: 5.00\n- J. Burstall: 5.00\n- E. Page: 5.00\n- J. Webb: 3.00\n- A Friend: 2.00\n- H. M. Price: 2.00\n- Miss C. Price: 1.00\n- Miss Price: 1.00\n- W. Clint: 1.00\n- A Friend: 1.00\n- G. T. D. Chambers: 1.00\n- Masters Percy & J. Chambers: 25\n\nTotal: $202.25\n\n### Diocese of Fredericton\n\n#### St. John, N.B.\n\n- Canon De Veber: 8.00\n- W. M. Jarvis: 5.00\n- G. W. Whitney: 5.00\n- J. F. Robertson: 5.00\n- Mrs. J. F. Robertson: 5.00\n- John Cowan: 5.00\n- W. W. Turnbull: 5.00\n- T. McAvity & Son: 5.00\n- G. M. A.: 5.00\n- G. F. Matthews: 5.00\n- Rev. O. G. & Mrs. Dobbs: 5.00\n- S. Jones: 5.00\n- Miss Barlow: 5.00\n- J. & F. Taylor: 5.00\n- Canon Brigstocke: 5.00\n- A Clergyman's Widow: 5.00\n- D. Breeze: 5.00\n- W. Breeze: 5.00\n- W. C. Drury: 5.00\n- T. W. Daniell: 5.00\n- T. B. Robinson: 10.00\n- Cash: 5.00\n\nTotal: $434.25\n\nSubscription: $1,190.75\n| Name                        | Amount |\n|-----------------------------|--------|\n| Alfred C. Blair             | $5.00  |\n| Rev. H. W. Dobbs            | $5.00  |\n| Mrs. Milledge               | $5.00  |\n| T. C. Wilson                | $5.00  |\n| Mrs. G. F. Smith            | $5.00  |\n| James Shannon               | $2.00  |\n| J. R. Ruell                 | $4.00  |\n| J. P. Gildersleeve          | $2.00  |\n| J. Wilson                   | $1.00  |\n| E. H. Smythe                | $2.00  |\n| S. Z. Dickson               | $1.00  |\n| T. E. Greet                 | $2.00  |\n| Miss M. L. Thorne           | $4.00  |\n| L. W. Breck                 | $2.00  |\n| A Friend                    | $1.00  |\n| E. J. B. Pense              | $2.00  |\n| Mrs. G. H. Lister           | $1.00  |\n| W. L. Creighton             | $2.00  |\n| Mrs. Piper                  | $1.00  |\n| Mrs. Cartwright             | $2.00  |\n| James N. Rogers             | $1.00  |\n| Rybert Kent                 | $2.00  |\n| Mr. & Mrs Carter            | $2.00  |\n| Mrs. Gallinger              | $2.00  |\n| A Friend                    | $0.50  |\n| Cash                        | $0.60  |\n| T. E. Dyer                  | $2.00  |\n| Mrs. Ferris                 | $1.00  |\n| John Rubins                 | $1.00  |\n| Captain Taylor              | $1.00  |\n| Joseph Findley              | $3.00  |\n| Mr. Allan Jones             | $1.00  |\n| *D. Scribner                | $1.00  |\n| Mrs. Agnew                  | $1.00  |\n| J. Short                    | $1.00  |\n| Thomas Briggs               | $2.00  |\n| A Friend                    | $1.00  |\n| Wm. Moore                   | $1.00  |\n| Jonas Howe                  | $1.00  |\n| Joseph A B Smith            | $0.50  |\n| W. H. Merritt               | $4.00  |\n| A. V. Skinner               | $2.00  |\n| F. W. Daniell               | $1.00  |\n| Thomas Dalton               | $2.00  |\n| R. P. McGinn                | $2.00  |\n| H. W. T.                    | $1.00  |\n| C. A. McDonald              | $1.00  |\n| Mrs. McDonald               | $1.00  |\n| A Friend                    | $1.00  |\n\n**Total:** $177.50\n\n**Diocese of Toronto**\n\n**Port Hope**\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| H. Covert                   | $100.00|\n| R. H. Meredith              | $15.00 |\n| J. Smart                    | $5.00  |\n| Archibald Galletty          | $5.00  |\n| Mrs. Sculliar               | $5.00  |\n| A Friend, thro' Dr O'Meara  | $5.00  |\n| Judge Benson                | $5.00  |\n| John Mulligan               | $5.00  |\n| John Patteison              | $5.00  |\n| Cash                        | $1.00  |\n| George Furby                | $1.00  |\n| Mrs. Robins                 | $2.00  |\n| D. Smart                    | $2.00  |\n| J. G. Williams              | $2.00  |\n| A young Lady                | $5.00  |\n\n**Total:** $158.50\n\n**Diocese of Niagara**\n\n**Hamilton**\n\n| Name                        | Amount |\n|-----------------------------|--------|\n| *Synod offertory            | $28.33 |\n| +Mrs. McLaren               | $10.00 |\n| Miss McLaren                | $10.00 |\n| John Stuart                 | $10.00 |\n| S. Slater                   | $5.00  |\n| Edward Martin               | $5.00  |\n\n**Total:** $68.33\n\n*To be sent by treasurer of Board of Missions*\n\n*Subscription.*\n### Guelph\n\nSun. Sch. offertory, May 30. $4.00  \nSurplus offertory $20.00  \nGeorge Elliott $10.00  \nWalter Sorby $10.00  \nJ. A. Wood $5.00  \nJ. C. Chadwick $5.00  \nStephen Lett $5.00  \nMiss Kernghan $5.00  \nF. W. Stone $5.00  \nJ. M. Bond $5.00  \nMrs. Billing $1.00  \nJ. A. Nelles $1.00  \nJ. F. Kidner $1.00  \nMiss Robins $0.50  \nR. Harvey $1.00  \nJames Clarke $1.00  \nB. McConkey $2.00  \nA Friend $1.00  \nRobert Gansby $2.00  \nMiss Ridgway $1.00  \nMiss F. Ridgway $1.00  \nMrs. Thurtall $2.00  \nGeorge Thurtall $2.00  \nE. Morris $2.00  \nG. A. Ormond $2.00  \nE. Allison Harland $1.00  \nMorris Stanley $1.00  \nAfterwards sent by Archdeacon Dixon $17.00\n\nTotal $113.50\n\n### St. Catharines\n\nOffertories Ascension Day—  \nSt. George's $111.15  \nSpecial portion of Ascension-tide offertory for Rupert's Land.† (exclusive of our portion of unappropriated offertory, which amounted to more than $80) $21.75  \nSt. Barnabas $5.00  \nT. R. Merritt $10.00\n\nTotal $47.90\n\n### Drummondville\n\nA Lady $2.00\n\n### Niagara\n\nOffertory not known yet.\n\n† To be sent by the treasurer of the Board of Missions.\n\n### Diocese of Huron\n\n#### Brantford\n\n† Offertory Grace Ch., June 6 $19.00  \n† Offertory St. Jude's $3.00  \n† Grace Church Sunday School offertory, say $15.00  \nJ. H. Stafford $5.00  \nJames Smith, Sr. $1.00  \nD. Glass $2.00  \nJohn Spence $1.00  \nA Lady $6.00\n\nTotal $52.00\n\n#### London\n\n† Offertory St. Paul's, June 13 $225.03  \n† \" Memorial Ch. \" $30.00  \nBenjamin Cronyn $10.00  \nA. Cleghorn $5.00  \nJohn Macbeth $5.00  \nH. A. Smith $5.00  \nRev. R. Hicks $10.00  \nE. A. Taylor $1.00  \nJ. F. Warner $1.00  \nGeorge Laing $1.00  \nDr. W. H. Moorehouse $1.00  \nV. Cronyn $8.00  \nCanon Innes $15.00  \nJudge Davis $20.00\n\nTotal $337.03\n\n#### Galt\n\n† Surplus offertory, June 20 $17.77\n\n#### Hespeler\n\nOffertory, June 20 $3.11\n\n### Recapitulation\n\nMontreal $434.25  \nQuebec $202.25  \nSt. John $177.50  \nKingston $133.10  \nPort Hope $158.50  \nHamilton $68.33  \nGuelph $113.50  \nSt. Catharines $47.90  \nDrummondville $2.00  \nBrantford $52.00  \nLondon $337.03  \nGalt $17.77  \nHespeler $3.11\n\nTotal $1837.24\nFirst visit .................................................. $1,190.75\nSecond visit .............................................. 1,837.24\n\nTotal .......................................................... $3,027.99\n\nTravelling expenses—\nFirst visit .................................................. $159.75\nSecond visit ................................................ 243.25\n\nTotal expenses ............................................. $403.00\n\nSince my return I have been notified of—\nOffertery at New Edinburgh for us ....................... $47.00\nAnd I have received from Xt. Ch. Cathedral, Montreal 20.00\n\nThere are a few persons whose names are not mentioned who have promised donations.\n\nThe Rev. Dr. Alnatt, Rector of St. Matthew's, Quebec, promises a continuance of the annual offertory for Indian work given by his predecessor, the Bishop of Niagara.\n\nOn April 7, Rev. Canon O'Meara gave a verbal report of his visit to the Diocese of Nova Scotia, during which he obtained $366.00 for the Home Mission Fund, most of the sums given being subscriptions for three years.\nReport Adopted by the Executive Committee Last Year.\n\n\"At the Meeting of the Synod of this Diocese, held at Winnipeg, on the 28th and 29th October, 1885, the following resolution was unanimously adopted:\n\n\"That a Committee be appointed to prepare an address to the English Societies, and the Ecclesiastical Province of Canada, setting forth the present financial condition of this Diocese—the urgent necessity for establishing sound foundations for carrying on the work of our church in this country, with its yearly increasing population—and the impossibility of doing what is necessary in such a young community without further assistance from the older branches of the church.\"\n\nThe Committee now beg to lay the following statement before the English Societies, and the Province of Canada.\n\nThe Diocese covers the whole of Manitoba, and extends eastward through a portion of Ontario.\n\nThere are at present about fifty clergymen in the Diocese of whom nineteen are either in charge of self-supporting parishes, or are C. M. S. Indian Missionaries, or are a portion of the College and Cathedral staff. Twenty-five are missionaries in the country districts paid partly out of Diocesan funds, and partly by the people amongst whom they labor.\n\nThe amount contributed by the Diocese at present averages about $500 to each clergyman, and involves an annual aggregate payment of about $12,500.\n\nThere are six churches in Winnipeg, and two others, self-supporting. An endowment fund amounting at present to about $25,000, the interest of which is available for missionary purposes, exists in the Diocese. The different missions supplement the grants from the Diocese by direct contributions to their clergymen. Subscriptions and collections are also made in every parish and mission in aid of the general Mission Fund. A considerable sum is being raised and expended every year for the erection of churches and parsonages in the several missions. These various sums, including the expendi-\nture of self-supporting parishes, represent a total sum raised and expended by our church people throughout the Diocese, during the last financial year, of about $45,000. The following are, in round figures, the sums received from England and Canada.\n\nFrom the S. P. G. . . . $6,500\n\" \" C. M. S. . . . 876 [exclusive of Indian grants.]\n\" \" C. and C. C. S. 1,900\n\" Canada . . . . 455\n\nTotal, . . . . $9,731\n\nThe total amount therefore expended for our church work in the Diocese was last year about $55,000.\n\nThe great depression of business which has existed for the last two or three years in Manitoba, has seriously crippled the ability of our church people to subscribe, and has rendered it impossible at present to increase contributions for church purposes. Many of our people are just starting in a new country and have not been long enough at work to do more than make a livelihood for themselves and families.\n\nThe Mission Fund starts this financial year with a debit balance of about $750. Its outlay for the current year with its present missionary staff, including all expenses of management, travelling of clergymen to visit vacant or unopened missions, to supply outfits, etc., etc., will probably reach fully $15,000. With even increased collections throughout the Diocese it is difficult to see how a revenue of $12,000 can be secured if the S. P. G. are compelled to carry out their intention of reducing their grant for next year by £200 or $1,000.\n\nThis Diocese is now passing through a severe and trying crisis. Three years ago engagements began to be entered into, in part encouraged by promises of aid from Canada, which unfortunately have not been fulfilled. The Board of Domestic Missions formed by the Provincial Synod of Canada proposed to raise $6,000 yearly, (besides $1,000 for St. John's College), for establishing our church in this Diocese on broad and solid foundations. We have received in full payment, as we understand, for the current year from Canada, the sum of $455 only.\n\nTo show the appreciation of the spiritual necessities and wants of this new country, by others, it may be well to point\nout what one body is now doing in the North-west. For the year ended 31st March, 1885, it sent from Eastern Canada to Manitoba, in aid of its college in Winnipeg—for home missions in Manitoba—for church and manse fund—and for Indians—a total sum of about $29,000, in addition to a sum of $13,750 for its church work in the territory beyond Manitoba, or in all about $42,750.\n\nOur church in this Diocese is straining every effort to supply its ministrations in every part of the country where settlers are going in.\n\nThere are now, within the Diocese, forty-three church edifices and twenty parsonages. They have mainly been erected during the last five or six years, and have cost an aggregate sum of at least $200,000. This is exclusive of organs and all interior furnishing. Special grants have been made in favour of individual buildings by the S. P. C. K., and they have also given a block grant of £2,000 or $10,000, which has been used in aiding the building of some of the forty-three churches, and has now all been spent. That Society has at its last meeting generously given another block grant of £1,000 or $5,000 to be expended in the same way.\n\nExcept the aid thus afforded by the S. P. C. K., the rest of the outlay has been found by our own church people within the Diocese, including some help from friends outside.\n\nIn the Bishop's address to the Synod held last month, he pointed out in the following words, three districts within his Diocese which at present are unsupplied or very insufficiently supplied with church ministrations:\n\n\"Let me draw your attention more especially to three large tracts of settled country.\n\nThere is a tract commencing at the frontier near Wakopa, running north 30 miles and west 70 miles, in which there is one clergyman. This tract is situated in eight municipalities, has 70 townships, 32 Protestant schools and 29 post offices.\n\nThere is a second tract consisting of the settled country north of the Manitoba and Northwestern Railway from Westbourne to Shoal Lake. This tract is situated in seven municipalities, has 40 townships, 32 Protestant schools and 14 post offices. There is no resident clergyman. Some of the townships adjacent to the railway are visited by missionaries stationed on the line.\"\nThere is a third tract occupying the very centre of Manitoba, lying between lines through the Portage and Brandon on the east and west, and between the Manitoba and Northwestern Railway and the Pembina Mountain branch of the C. P. R. on the north and south. This tract in which there is one resident missionary is situated in twelve municipalities, has 150 townships, 76 Protestant school districts and 36 post offices. I exclude the townships on the line of railway which receive the visits of missionaries stationed at places on the lines.\n\nTo properly supply that very large area of country, and to fill up gaps existing in other parts of the Diocese, will require ten additional missionaries, making, with those at work at present, a total of 35, and will bring up the total expenditure in the Diocese to the sum of $20,000 a year, or about $7,500 beyond our present income.\n\nThe salaries paid to our clergymen are moderate in the extreme. They each have to serve two, and in some cases three or more districts, and have to travel many miles every Sunday to hold services, no matter what the weather or the state of the roads may be. Nearly every one consequently has to be at the expense of keeping a horse.\n\nThe clergy attached to the College and Cathedral, in addition to their heavy educational work, act as visiting missionaries to places which are unsupplied with resident clergymen.\n\nThe area covered by each mission is so large as to require two or even three churches in various parts of the districts. Each clergyman should have a parsonage.\n\nTo meet the wants of the Church throughout the Diocese at least twenty more parsonages are required and from thirty to forty additional church edifices. To erect these will involve an outlay during the next two or three years of certainly not less than $100,000. The people in the various places will do their utmost, but it is obvious that without aid from abroad their efforts must fall far short of the urgent necessities of the case, and experience shows that those efforts are mainly dependent on the presence of missionaries.\n\nThree hundred miles of branch railways will have been constructed in Manitoba this year. Nearly as much more is expected to be built next year. These railways will pass through the three districts described in the Bishop's charge already\nquoted, and they will be the means of pouring a constantly increasing population into the country.\n\nWithout aid the church in this Diocese cannot attempt to supply the calls that are being now made upon it, and which will so rapidly increase.\n\nTo do its duty properly, to the growing number of church people who desire earnestly to remain within its fold, the church in this Diocese needs an addition to its present yearly income of about $7,500, and if this want is supplied it will then have to expend in the building of churches and parsonages at least $100,000 within the next two or three years.\n\nIts grants to missions are made from year to year, so that when the present depression passes away as each locality advances in prosperity, and in its ability therefore to increase its contributions for the support of its own mission, the grant from the general fund will be gradually withdrawn, pointing steadily to a condition of self-support at the earliest possible day. By this plan new missions where required can be established and aided, until the whole country becomes sufficiently populated to render it less imperative to obtain aid from the centre.\n\nThe church in Rupert's Land has a great mission before it. A moderate amount of aid now will enable it to lay broad and solid foundations for future usefulness and strength.\n\nWill it, under its present grave conditions of difficulty, appeal in vain for that aid which this statement explains and justifies, and without which it cannot possibly achieve those results, which every lover of our church both in England and in Canada, must so ardently desire to see secured in this new land, into which such large numbers of church people may be expected to enter, both from England and from Canada.\n\nWinnipeg, 10th Nov., 1885.\n\nW. CYPRIAN PINKHAM,\nSecretary of Synod.\n\nC. J. BRYDGES,\nDiocesan Treasurer.\nThe Minute of the Committee on the Death of Right Rev. David Anderson, first Bishop of Rupert's Land.\n\n\"The Executive Committee of the Synod of the Diocese of Rupert's Land has heard with deep concern the news of the decease of the Right Reverend David Anderson, first Bishop of Rupert's Land.\n\nBishop Anderson's Episcopate of fifteen years was strongly marked by loving devotion to his Master's service and by deep, fatherly interest in the various members of his flock.\n\nHis heart yearned over the sad condition of the heathen tribes scattered over his immense Diocese; he longed to see them surrounded by humane and civilizing influences and brought to the true light.\n\nHis memory is affectionately cherished by all the older residents of this country, who recall many acts of personal kindness and thoughtful sympathy.\n\nFrom the time he left the Diocese till the commencement of his sad and lingering affliction, Bishop Anderson manifested the liveliest interest in the work of his successor, and did everything in his power to help forward the various plans for the advancement of the Church in Rupert's Land, which the present Bishop from time to time set on foot.\n\nThe Committee desires to offer to the sorrowing members of Bishop Anderson's family the expression of its heartfelt sympathy with them in their bereavement, and to express the earnest hope that they may fully realize that their sorrow is his joy and their loss his gain.\"\n\nSigned,\n\nJohn Grisdale, B.D.,\nDean of Rupert's Land.\n\nAbraham Cowley, D.D.,\nArchdeacon.\n\nW. Cyprian Pinkham, B.D.\nArchdeacon.\nReport of the S. P. C. K. Depository,\n\nThe Committee of the S. P. C. K. Depository append here-\nwith the Treasurer's report. The sales during the past nine\nmonths have been only small. The stock at present is very\nsmall. New arrangements will soon have to be made in con-\nnection with the Depository. The sum of £28 is due to the\nParent Society. The Treasurer hopes soon to have sufficient\nfunds in hand to send a remittance to cover this indebtedness.\nAs soon as satisfactory arrangements are made concerning the\nDepository the Committee intend to add considerably to the\nstock kept on hand.\n\nJOHN GRISDALE,\nChairman.\n\nEDWYN S. W. PENTREATH,\nHon. Secretary.\n\nSYNOD DEPOSITORY.\n\nSTATEMENT OF ACCOUNT.\n\n1st Oct. '85. Stock on hand ........................................... $459 08\nDebts due ......................................................... 64 11\nCash on hand ..................................................... 28 31\n\n$551 50\n\n3d Aug. '86. Stock on hand ........................................... $221 71\nDebts due to the Depository .................. 55 71\nExpenses .......................................................... 34 67\nDiscounts on sales .............................................. 10 43\nPaid S.P.C.K. in Eng. on ac't books 122 78\nCash on hand ..................................................... 106 20\n\n$551 50\n\nW. REDFORD MULOCK,\nTreasurer.\nRULES FOR THE ADMINISTRATION OF THE\nClergy Widow and Orphans' Fund\nOF THE PROVINCE OF RUPERT'S LAND.\n\n1. The fund shall be held in trust for the Church of England in Rupert's Land by the Corporation—the Bishop of Rupert's Land.\n\n2. There shall be a Provincial Treasurer appointed by the Provincial Synod and there shall also be a Treasurer appointed in every Diocese, whose duty it shall be to collect all sums accruing to the Fund in that Diocese, to transmit the same to the Provincial Treasurer, and to communicate with the Provincial Treasurer on the part of the Diocese. Such Diocesan Treasurer shall be appointed by the Synod of the Diocese, or failing any appointment by the Synod, by the Bishop of the Diocese.\n\n3. The Bishops and Clergymen in the Province licensed in any Diocese to the cure of souls or holding office in any college or school under the jurisdiction of any of the Bishops shall be entitled to have the benefit of the Fund on complying with the rules laid down by the Provincial Synod.\n\n4. Any clergyman becoming for the first time a subscriber to the Fund, must if over the age of 25, pay an entrance fee for the first year in addition to the annual subscription, according to his age, namely:—Two dollars for every year over 25 up to 35 inclusive; three dollars for every year over 35 up to 40 inclusive; four dollars for every year over 40, and up to 45 inclusive; and five dollars for every year over 45; provided, however, that no clergyman over 45 years of age shall be admitted as a subscriber if he shall have been licensed as a clergyman within the Ecclesiastical Province of Rupert's Land for more than five years.\n\n5. To entitle a subscriber to the benefit of the Fund he must pay a yearly subscription to the Fund of five dollars, on or before July 1st, in every year. In the case of the subscription not being paid till after July 1st, interest shall then have to be paid at the rate of ten per cent. per annum for such period as the subscription shall be overdue, and if the subscription shall be two years in arrears, then such defaulter shall cease to be entitled to any benefit from the Fund, but any such defaulter if not excluded by the limitation as to age, may again be admitted as a subscriber on payment of such entrance fee in accordance with his age as he would have had to pay if subscribing for the first time.\n\n6. If a clergyman, after being 15 years a contributing member of the Fund, remove from the Province to England, or some other field of work where there is no Widow and Orphans' Fund of which he can have the benefit, he shall have the option of remaining on the Fund, by paying twelve and a half dollars yearly instead of five, provided, however, that if he leave in bad health and it is certified by a duly qualified medical practitioner that he is unable to undertake duty, he may remain a member of\nthe Fund, while thus disqualified, by continuing to pay the regular annual subscription of five dollars.\n\n7. Every clergyman in charge of a parish or mission must, to secure for his widow and orphans the benefit of the Fund, make at least one collection yearly on its behalf, unless the Bishop certifies to the Provincial Treasurer, through the Diocesan Treasurer, that the mission is not yet in such a state as to allow of any collection.\n\n8. All monies arising from the yearly payment of clergymen, and collections and donations made for the Fund, or accruing in any other way for its benefit, shall be paid by the Provincial Treasurer to the Bishop of Rupert's Land in trust and invested by him as capital and the interest on the proceeds of the invested capital shall alone be available for carrying out the objects of the Fund, and as long as there are no claimants on the Fund, or when the income shall exceed the claim to which it is liable, the income or surplus income shall be added to the capital stock.\n\n9. The Treasurer of the Synod will pay to the widow of every clergyman who is entitled to the benefit of the Fund, such annuity, not exceeding two hundred dollars, as the income of the Fund will admit, in two equal half-yearly payments, on the 1st day of January and July each year—the first of such half-yearly payments, or such portion thereof as may have accrued from the death of her husband to be made on the day above mentioned next following the death of her husband, such payments to be continued during her natural life, so long as she shall remain a widow. And in case such widow shall at her death or marriage have four children by her late husband under the age of eighteen years, such annuity shall be paid to the guardians of such children; and should there be fewer than four children, a sum not exceeding sixty dollars as the income of the Fund will permit, shall be paid as aforesaid for each, provided that all annuities shall cease from the half-year next preceding the marriage of any person, whether male or female, entitled by these rules to any such annuity, and that all annuities paid for children shall cease on the day at which they attain the age of eighteen years. And in case of any clergyman deceased leaving no widow but having children, then such children shall enjoy the annuity as above provided on the death or marriage of a widow.\n\n10. Every widow and guardian of any of the orphans of a clergyman desiring annuities from the Widow and Orphans' Fund shall apply by Memorial to the Provincial Treasurer, through the Treasurer of the Diocese to which the clergyman belonged, for such annuities stating the time of the decease of such clergyman, the name of the widow and the names and ages of each of the children, as the case may be.\n\n11. Every annuitant on the Widow and Orphans' Fund shall whenever he or she may be paid his or her half-yearly annuity, make the following declaration, which shall be attested by the clergyman before whom it is made.\n\n**DECLARATION BY A WIDOW.**\n\nI hereby declare that I am the widow of the late Rev. ................., and that I am entitled to an annuity from the Clergy Widow and Orphans' Fund of the Province of Rupert's Land, and that I am still a widow.\n\nName.\n\nResidence.\n\nSigned before me...........................................\nDECLARATION BY THE GUARDIANS OF CHILDREN.\n\nI do hereby declare that I am the duly appointed guardian of the children of the late Rev.………………………………whose names and ages are respectively written below, and that they are entitled to an annuity from the Clergy Widow and Orphans' Fund of the Province of Rupert's Land.\n\n………………………………Name.\n………………………………Residence.\n\nNames and ages of the children……………………………\nSigned before me……………………………………………\n\n12. Clergy or Clergymen in these rules includes Bishops.\n\n13. No alteration shall take place in these Rules until such alteration has been approved at two successive meetings of the Provincial Synod.\n\nS. P. C. K. Block Grant,\n\nIN AID OF THE BUILDING OF CHURCHES.\n\nAppropriations from this grant are made by the Executive Committee of the Synod of the Diocese, on the following conditions, viz.:\n\n1. That the site is legally secured for the Church of England and the Parish canonically defined under clause 3 of the Canon on Parochial Organization.\n\n2. That any building, for which a portion of the grant is allotted is for the sole use of the Church of England.\n\n3. That the plans and specifications are submitted for the approval of the Bishop.\n\n4. The following questions have to be answered, for the information of the S.P.C.K.:\n   (a) Place?\n   (b) Material of which the church is built?\n   (c) Accommodation?\n   (d) Estimated cost?\n   (e) Amount actually collected?\n   (f) Balance how provided for?\n\n5. The church has to be insured.\n\nThe maximum of assistance allowed by the Society is one-fifth for churches costing $2,500 or less, and for more expensive buildings one-sixth; but no church can receive more than $1,500.\n\nThe Society pays the money by sending a form of Bill of Exchange to the Bishop, on the Secretary of the Society receiving a certificate from the Bishop that the conditions they require have been fulfilled.\n\nApplications for assistance from this Grant, with all necessary information, should be sent to the Ven. Archdeacon Pinkham, Secretary of Synod, Winnipeg.\nSt. John's College, Winnipeg.\n\nCHANCELLOR AND WARDEN.\n\nTHE MOST REVEREND R. MACMILLAN, D.D., LL.D., Bishop of Rupert's Land and Metropolitan, Chancellor of the University of Manitoba; Fellow of Sidney College, Cambridge.\n\nDEPUTY WARDEN.\n\nTHE REV. CANON O'MEARA, M.A.\n\nTHE COUNCIL.\n\nThe Right Rev. J. McLean, D.D., D.C.L., Bishop of Saskatchewan.\nThe Right Rev. J. Horden, D.D., Bishop of Moosonee.\nThe Right Reverend W. C. Bomber, D.D., Bishop of Mackenzie River.\nThe Right Reverend The Honorable A. Anson, M.A., Bishop of Qu'Appelle.\nThe Right Reverend R. Young, D.D., Bishop of Athabasca.\nThe Ven. A. Cowley, D.D., Archdeacon of Cumberland.\nThe Hon. J. Norquay, M.P.P., Provincial Treasurer and Premier of Manitoba.\nThe Hon. C. Inkster, High Sheriff of Manitoba.\nThe Very Reverend the Dean of Rupert's Land, B.D.\nThe Rev. Canon O'Meara, M.A.\nThe Ven. W. C. Pinkham, B.D., Archdeacon of Manitoba.\nThe Reverend O. Fortin, B.A.\nThe Rev. Canon Matheson, B.D.\nH. Archibald, Esq., B.A.\nW. R. Mulock, Esq., B.A.\n\nSecretary—The Very Rev. the Dean of Rupert's Land.\nBursar—The Very Rev. the Dean.\nDean—The Rev. Canon Coombes.\nStewart—The Rev. Canon Matheson.\nSuperintendent of the Meteorological Observatory—The Bishop of Rupert's Land.\nChief Assistant—T. Warburton, Esq., B.A.\nLibrarian—Rev. Canon Coombes.\n\nTHE THEOLOGICAL FACULTY FOR THE DEGREES OF B.D. AND D.D.\n\nThe Professors of Theology, and\nThe Ven. Archdeacon Cowley, D.D., Examiner in Homiletics and Pastoral Theology.\nThe Ven. W. C. Pinkham, B.D., Examiner in Ecclesiastical History and Liturgiology.\nThe Bishop of Athabasca, D.D., Examiner in Systematic Theology and Evidences.\nThe Rev. O. Fortin, B.A., Examiner in Exegetical Theology and Greek.\n\nTHE COLLEGE BOARD.\n\nThe Warden,\nProfessor Grisdale.\n\nProfessor O'Meara.\nProfessor Matheson.\n\nTHE COLLEGE.\n\nProfessor of Pastoral Theology—The Dean of Rupert's Land, B.D.\nProfessor of Systematic Theology—The Rev. Canon O'Meara, M.A.\nProfessor of Ecclesiastical History—The Rev. Canon Macray, B.A.\nProfessor of Exegetical Theology—The Rev. Canon Matheson, B.D.\nProfessor of Music—The Rev. Canon Coombes, M.A.\nProfessor of Liturgiology—The Bishop of Rupert's Land, D.D.\nLecturer in Hebrew—The Rev. Canon Matheson, B.D.\nLecturer in Mental and Moral Philosophy—The Rev. Canon O'Meara, M.A.\nLecturer in Honor Classics with Greek and Latin Prose and Verse Composition—The Rev. Canon Coombes, M.A.\nLecturer in Honor and Senior Mathematics—The Bishop of Rupert's Land, D.D.\nLecturer in Natural Science—\nLecturer in French and German—The Rev. J. J. Roy.\nLecturer in English and History—The Dean of Rupert's Land, B.D.\nLecturer in Previous Classics—Canon O'Meara.\n\nPROCEEDINGS FOR THE B.A. DEGREE.\n\nA candidate may take the University Preliminary Examination, and on passing it take in the following year the Previous Examination; or he may take the Previous Examination without the Preliminary, if he lodges with the Registrar of the University, before the examination, a certificate from the Head of one of the Colleges that he has completed in that College the required course of study.\n\nThe following are the subjects for the Previous Examination, May, 1884:\n\n1. Virgil—Æn, Book II.\n   Sallust, Catalina\n   Cicero, Pro Lege Manilia.\n2. Homer, Iliad, Book I.\n   Xenophon, Anabasis, Book II.\n   Demosthenes, Philippic I.\n3. Chantrell's History of France, or Green's History of England up to the Death of Queen Elizabeth.\n   Shakespeare, Hamlet, with Bossuet's Oraison Funèbre de la Henriette de France, and French Prose; or\n   Racine's Athalie, with Milton, Paradise Lost, Book I.\nComposition, including one or more subjects for an essay in English or French, with History of English Literature or Principes de Litterature.\n4. Arithmetic; Algebra to the end of Quadratic Equations, not including Indeterminate Equations; Euclid, Definitions and Books I, II, III, IV.\n\n5. The Rudiments of Botany.\n\nAfter passing this examination, the candidate has to pass the Final Examination. The subjects of this examination are Latin, Greek, Mathematics, Natural Sciences and Logic, Metaphysics and Ethics.\n\nThis Examination may be taken two years after the Previous Examination, or in two parts, one at the end of one year after the previous and the other after two years.\n\nBut instead of this Final Examination, which gives what is called the Ordinary B.A. Degree, the candidate may proceed to the Degree in Honors in a special branch of study. There are Honor Examinations in Classics, Mathematics, Natural Science, Moral and Mental Science and Modern Languages. These examinations may also be taken either wholly after two years from the Previous, or in two parts, one of which must be taken one year after the Previous. All candidates for an Honor B.A. Degree have, however, to pass in the Ordinary B.A. Examination in Plane Trigonometry, Elementary Statics and Hydrostatics, Inorganic Chemistry, Logic and Ethics.\n\nThe hours and subjects of lectures may be obtained from the Rev. the Deputy Warden.\n\nPROCEEDINGS FOR THE B.D. DEGREE.\n\nThere are two examinations for the ordinary B.D. Degree. The first of these is open to all Matriculated Theological Students of St. John's College, who have passed the Previous Examination of the University of Manitoba in Latin, Greek and Mathematics, and have been matriculated as Theological Students for at least one year of the College course, or four terms. The Second Examination is open to all such students who have passed the First Examination, after an interval of one year from passing such examination.\n\nThe subjects for the First Examination for May, 1886, are:\n\n(a) Greek New Testament, one of the Gospels with Alford's Notes and Prolegomena, the Acts of the Apostles;\n(b) Hebrew, Grammar and Genesis, Chap. 1;\n(c) Old Testament;\n(d) Ecclesiastical History, first two centuries;\n(e) Liturgy of the Church of England;\n(f) The first eighteen Articles;\n(g) Wescott's Bible in the Church; Paley's Evidences; Fordyce's Modern Aspect of Scepticism; Wordsworth's Theophilus Anglicanus.\n\nThe following books are recommended: Tragelles' Heads of English Grammar; Maclear's History of the Old Testament; Robertson's History of the Christian Church; Proctor on the Book of Common Prayer; Boultbee on the Articles.\nThe subjects of the Second Examination for May, 1886, are:\n\n(a) Greek Testament, the Pastoral Epistles with Bishop Ellicott's Notes;\n(b) Hebrew Grammar, Genesis, Chapters 1 to 5 inclusive, Psalms, 1 to 6 inclusive; Septuagint to be read with the Hebrew;\n(c) New Testament.\n(d) Ecclesiastical History, up to the Council of Nice inclusive; History of the Church of England;\n(e) Liturgy of the Church of England, Creeds and Articles;\n(f) Homiletics, with writing a sermon;\n(g) Pastoral Theology;\n(h) Select works on Theology; Butler's Analogy, Hooker's Ecclesiastical Polity, Book V.\n\nThe following books are recommended: McLear's History of the New Testament; Robertson's History of the Christian Church; Short's History of the Church of England; Proctor on the Book of Common Prayer; Pearson on the Creed; Boultnbee on the Articles, and Blunt's Parish Priest.\n\nThe additional subjects for the Honor B.D. Degree are:\n\n(a) Greek New Testament, the Four Gospels, the Acts of the Apostles, the Epistles to the Romans, Galatians and Hebrews;\n(b) Hebrew Bible and the Septuagint; Genesis, Chapters 6 to 12 inclusive; Psalms, 7 to 12 inclusive; Isaiah, Chapters 1 to 6 inclusive;\n(c) Ecclesiastical History, the History of the First Six Centuries;\n(d) Liturgiology, including the Early Liturgies;\n(e) Select Works of the Apostolic and Early Fathers;\n   Clement of Rome, 1st Epistle;\n   St. Ignatius, Epistle to Polycarp;\n   St. Chrysostom, Flavian;\n   Tertullian, Apology, sections 1 to 14 inclusive;\n   St. Augustine, 8th Book of Confessions;\n(f) Select Works on Theology;\n   Burgon on the Pastoral Office;\n   Westcott's Introduction to the Study of the Gospels;\n   Waterland on the Eucharist;\n   Trench, Synonyms of the New Testament;\n   Lee, on Inspiration;\n   Christlieb, Modern Doubt and Christian Belief.\n\nTHE COLLEGE TERMS AND CHARGES.\n\nThere are four terms in the year:\n\nMichaelmas Term, beginning first Wednesday in September.\nChristmas Term, beginning 2nd November.\nLent Term, beginning 2nd Wednesday in January.\nEaster Term, beginning 2nd Wednesday in March.\nThe College Charges per Term are:\n\nTuition Fee ........................................ $7.50\nBoard, etc ............................................. 50.00\n\nExtra, if taken:\n\nInstrumental Music .................................. 2.50\nUse of Instrument .................................... 1.00\nDinner for Non-resident Students ............... 16.00\n\nResident Students have, before commencing residence, to lodge $50 with the Bursar, as Caution Money, to be repaid in the last bill. There is also an entrance fee of $5.\n\nThe College Supplies an Iron bedstead, but the Student has to furnish his room in every other respect.\n\nThe College will arrange for Laundry, but if the Student employs the Laundress he has to take all responsibility.\n\nAny sums due to the College should be paid to the Stewart, the Rev. Canon Matheson, at St. John's College School.\n\nThe bills are sent out at the close of each Term, when prompt payment is expected.\n\nThere will be a charge of 10 per cent. interest on all accounts not paid before the close of the following Term.\n\nApplication for admission has to be made to the Most Rev. the Warden.\n\nFurther information may be obtained from the Most Rev. the Warden (the Bishop of Rupert's Land), or the Rev. the Deputy Warden (Canon O'Meara).\nSt. John's College School, Winnipeg.\n\nTHE GOVERNING BODY.\n\nThe Council and College Board of St. John's College.\n\nHead Master—The Bishop of Rupert's Land, D.D.\nDeputy Head Master—The Rev. Canon Matheson, B.D.\n\nMasters:\nThe Rev. Canon Coombes, M.A. / T. Warburton, Esq., B.A.\nThe Rev. Canon Machray, B.A. / E. Hamber, Esq.\nThe Rev. J. J. Roy. / J. G. Anderson, Esq., B.A.\n\nAssistant Master:\nH. M. Drummond, Esq.\n\nThere are four Terms of about ten weeks each:\n\nAutumn Term, beginning on first Wednesday of September.\nWinter Term, \" on second \" November.\nSpring Term, \" on first \" February.\nSummer Term, \" on second \" April.\n\nScholarships on the Cochran, Macallum, McMurray and other foundations are assigned by competition as there may be vacancies and deserving candidates after the Christmas and Midsummer examinations.\n\nThere are exhibitions for the sons of clergymen of the Church of England, the lowest of which covers the ordinary tuition fee.\n\nThe Medals and Prizes are given after the Midsummer term.\n\nThe College School Charges per Term of Weeks Are:\n\nFee for tuition .................................................. $7.50\nExtra fee for instrumental music ........................................... 2.50\nUse of instrument .................................................. 1.00\nSchool library .................................................. 25\nBoard for boys under sixteen .................................................. 40.00\nBoard for boys over sixteen .................................................. 45.00\nDinner for day scholars, if practicable ........................................... 16.00\nCathedral .................................................. 25\n\nThe College provides bedstead; but every border has to bring bed or mattress, bedding, six towels, clothes bag, and india-rubber overshoes.\nEvery article of clothing should be marked in full with the owner's name.\n\nLaundry and seamstress work is afforded, when required, at cost price.\n\nNotice of the withdrawal of a boarder should be given at least one month before the end of the term.\n\nBefore the admission of a boarder, $50, as caution money, has to be lodged with the Bursar. This remains in the hands of the College till the pupil is withdrawn, when it goes against the last account. In consequence of this, College bills are not sent out till the close of the term, when payment should immediately be made. If payment be not made before the end of the next term, 10 per cent. interest will be charged.\n\nAny sums due to the College should be paid to the Steward, the Rev. Canon Matheson, St. John's College, from whom, also, any further information may be sought.\n\nApplication for admission has to be made to the Head Master, the Bishop of Rupert's Land.\n\nThere is an Under School Department for boys found not sufficiently advanced for the school, but for the Under School a boy should be able to pass an examination in the Second Reader.\n\nNo boy can be admitted as a boarder in the College School under the age of eight years, or over the age of fifteen, except in special circumstances to be approved of by the Head Master.\n\nThere is at Christmas a vacation of two weeks, and at Midsummer of two and a half months.\nSt. John's College Ladies' School, Winnipeg.\n\nPROSPECTUS.\n\nPATRON—The Most Rev. the Bishop of Rupert's Land.\n\nThere are four terms in the year, each consisting of about ten weeks:\n\nAutumn Term beginning on first Wednesday of September.\nWinter Term \" second \" November.\nSpring Term \" first \" February.\nSummer Term \" second \" April.\n\nThere is at Christmas a vacation of about two weeks, and at Midsummer of about two and a half months.\n\nCHARGES PER TERM.\n\nBoard ........................................... $40.00\nDinner for Day Boarders per week 1.25\nUse of Piano .................................... 2.00\n\nTUITION.\n\nEnglish and Mathematics .................. 6.00\nMusic (Piano or Organ) ..................... 8.00\nSinging ......................................... 10.00\nDrawing ........................................ 7.00\nPainting ......................................... 10.00\nFrench .......................................... 5.00\nGerman .......................................... 5.00\nLatin .............................................. 5.00\n\nIf desired by the parents, instruction in any of the above subjects will be given by a Master at his own charges.\n\nNo extra charge for Plain Sewing, Fancy Work and Class Singing.\n\nDaughters of Clergymen of the Church of England will be charged half the above rates.\n\nA reduction of 10 per cent. is made in case there is more than one pupil from a family.\n\nPayments for Board and Tuition to be made at the beginning of each Term.\n\nPupils admitted at any time, Board charges dating from entrance.\nNo deduction made for removal or partial absence in the course of a Term except from illness.\n\nLaundry and Seamstress work, when required, at cost price.\n\nEach boarder to be provided with the following:\n\n- A mattress and sufficient bedding;\n- Six towels;\n- Four Dinner napkins and rings;\n- One clothes bag.\n\nEvery article of clothing to be marked in full with the owner's name.\n\nIt is earnestly requested that the dress of the pupils be simple and inexpensive, and that no large sums of pocket money be given at a time.\n\nAll books, parcels and letters, other than to or from parents, will be subject to inspection by the lady principal.\n\nOn Saturday afternoons, till five o'clock, friends will be permitted to visit Boarders, subject to the approval of parents and Lady Principal.\n\nOn the first Wednesday of each month Boarders will be allowed to visit friends if proper attendance be provided them to and from the school.\n\nThe School is pleasantly situated in its own grounds between the Red River and the Main street of Winnipeg, in the North Ward of the city, with the business part of which it is connected by street car and telephone.\n\nThe school is under the management of Mrs. A. E. Cowley, assisted by a competent staff of resident teachers, and the domestic arrangements are under the management of Mrs. Moore.\n\nAll pupils will be requested to be present at Morning Prayers, to receive Bible instruction and to attend Church on Sundays. But if parents so desire it, they may arrange for the escort of their daughters to and from any particular place of worship.\n\nAny sums due to the School should be paid to the Treasurer, the Rev. A. E. Cowley, St. John's Ladies' School, from whom any further information may be obtained.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30661.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 106, "total-input-tokens": 169290, "total-output-tokens": 47442, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1532, 3], [1532, 4057, 4], [4057, 4057, 5], [4057, 4256, 6], [4256, 4256, 7], [4256, 5943, 8], [5943, 6363, 9], [6363, 6363, 10], [6363, 6568, 11], [6568, 8059, 12], [8059, 9906, 13], [9906, 11168, 14], [11168, 11911, 15], [11911, 13158, 16], [13158, 14446, 17], [14446, 16074, 18], [16074, 18275, 19], [18275, 20502, 20], [20502, 22768, 21], [22768, 25106, 22], [25106, 27474, 23], [27474, 29804, 24], [29804, 32317, 25], [32317, 34785, 26], [34785, 37050, 27], [37050, 38929, 28], [38929, 40986, 29], [40986, 42955, 30], [42955, 44320, 31], [44320, 46305, 32], [46305, 48101, 33], [48101, 50093, 34], [50093, 51952, 35], [51952, 53930, 36], [53930, 56134, 37], [56134, 56798, 38], [56798, 56798, 39], [56798, 56810, 40], [56810, 57880, 41], [57880, 59946, 42], [59946, 62435, 43], [62435, 64704, 44], [64704, 67026, 45], [67026, 68658, 46], [68658, 70598, 47], [70598, 72696, 48], [72696, 73069, 49], [73069, 74395, 50], [74395, 76182, 51], [76182, 78055, 52], [78055, 79797, 53], [79797, 80488, 54], [80488, 82476, 55], [82476, 84832, 56], [84832, 87089, 57], [87089, 89209, 58], [89209, 91055, 59], [91055, 93083, 60], [93083, 94768, 61], [94768, 97083, 62], [97083, 99723, 63], [99723, 101722, 64], [101722, 103368, 65], [103368, 105424, 66], [105424, 107415, 67], [107415, 107913, 68], [107913, 109477, 69], [109477, 111132, 70], [111132, 113161, 71], [113161, 115023, 72], [115023, 117203, 73], [117203, 119496, 74], [119496, 122700, 75], [122700, 125092, 76], [125092, 125695, 77], [125695, 129657, 78], [129657, 131975, 79], [131975, 135294, 80], [135294, 137376, 81], [137376, 138460, 82], [138460, 140445, 83], [140445, 142577, 84], [142577, 144833, 85], [144833, 147161, 86], [147161, 149025, 87], [149025, 150596, 88], [150596, 151970, 89], [151970, 154835, 90], [154835, 158162, 91], [158162, 160183, 92], [160183, 160183, 93], [160183, 161738, 94], [161738, 163901, 95], [163901, 166421, 96], [166421, 166421, 97], [166421, 166421, 98], [166421, 166421, 99], [166421, 168483, 100], [168483, 169751, 101], [169751, 171573, 102], [171573, 172957, 103], [172957, 174501, 104], [174501, 176234, 105], [176234, 176234, 106]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, true]}}]