[{"id": "ab2151eb801fef45bead6eae9c9d179307066a08", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [✓] Coloured covers/ Couverture de couleur\n- [ ] Covers damaged/ Couverture endommagée\n- [ ] Covers restored and/or laminated/ Couverture restaurée et/ou pelliculée\n- [ ] Cover title missing/ Le titre de couverture manque\n- [ ] Coloured maps/ Cartes géographiques en couleur\n- [ ] Coloured ink (i.e. other than blue or black)/ Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Coloured plates and/or illustrations/ Planches et/ou illustrations en couleur\n- [ ] Bound with other material/ Relié avec d'autres documents\n- [ ] Tight binding may cause shadows or distortion along interior margin/ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/ Pages de couleur\n- [ ] Pages damaged/ Pages endommagées\n- [ ] Pages restored and/or laminated/ Pages restaurées et/ou pelliculées\n- [✓] Pages discoloured, stained or foxed/ Pages décolorées, tachetées ou piquées\n- [ ] Pages detached/ Pages détachées\n- [✓] Showthrough/ Transparence\n- [ ] Quality of print varies/ Qualité inégale de l'impression\n- [ ] Includes supplementary material/ Comprend du matériel supplémentaire\n- [ ] Only edition available/ Seule édition disponible\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/ Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X | 24X | 28X | 32X |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHROWING-STICKS IN THE NATIONAL MUSEUM.\n\nBY\n\nOTIS T. MASON,\n\nCurator of the Department of Ethnology.\n\nIn the Report of the Smithsonian Institution, 1893-'94, Part II, pages 275-289, and plates I-XIV.\n\nWASHINGTON:\nGOVERNMENT PRINTING OFFICE.\n1896.\nI.—THROWING-STICKS IN THE NATIONAL MUSEUM.\n\nBy Otis T. Mason.\n\nCol. Lane Fox tells us there are three areas of the throwing-stick: Australia, where it is simply an elongated spindle with a hook at the end; the country of the Couibos and the Purus, on the Upper Amazon, where the implement resembles that of the Australians, and the hyperborean regions of North America.\n\nIt is of this last group that we shall now speak, since the National Museum possesses only two specimens from the first-named area and none whatever from the second.\n\nThe researches and collections of Bessels, Turner, Boas, Hall, Mintzner, Kennicott, Ray, Murdoch, Nelson, Herendeen, and Dall, to all of whom I acknowledge my obligations, enable me to compare widely separated regions of the hyperborean area, and to distinguish these regions by the details in the structure of the throwing-stick.\n\nThe method of holding the throwing-stick is indicated in Fig. 1 by a drawing of H. W. Elliott. The Eskimo is just in the act of launching the light seal harpoon. The barbed point will fasten itself into the animal, detach itself from the ivory foreshaft, and unwind the rawhide or sinew line, which is securely tied to both ends of the light wooden shaft by a martingale device. The heavy ivory foreshaft will cause the shaft to assume an upright position in the water, and the whole will act as a drag to impede the progress of the game. The same idea of impeding progress and of retrieving is carried out by a multitude of devices not necessary to mention here.\n\nThe Eskimo spend much time in their skin kyaks, from which it would be difficult to launch an arrow from a bow, or a harpoon from the unsteady, cold, and greasy hand. This device of the throwing-stick, therefore, is the substitute for the bow or the sling, to be used in the kyak, by a people who cannot procure the proper materials for a heavier lance-shaft, or at least whose environment is prejudicial to the use of such a weapon. Just as soon as we pass Mount St. Elias going southward, the throwing-stick, plus the spear or dart of the Eskimo and the Aleut, gives place to the harpoon with a long, heavy, cedar shaft, weighing 15 or 20 pounds, whose momentum from both hands of the Indian, without the throw-stick, exceeds that of the Eskimo and Aleut darts.\nand harpoons, with the additional velocity imparted by the throwing-stick. It must not be forgotten, also, that the kyak is a very frail, unsteady thing, and therefore not much of the momentum of the body can be utilized, as it is by the Northwest Indians in making a lunge with a heavy shaft. The throwing-stick is also said by some arctic voyagers to be useful in giving directness of aim. Perhaps no other savage device comes so near in this respect to a gun barrel or the groove of a bow-gun. Its greatest advantages, however, are the firm grip which it gives in handling a harpoon or dart, and the longer time which it permits the hunter to apply the force of his arm to the propulsion of his weapon. Having practiced with a throwing-stick somewhat, I have imagined also that there was a certain amount of leverage acquired by the particular method of holding the stick and straightening the arm, as in a toggle joint. That implement, which seems so simple, and which is usually mentioned and dismissed in a word, possesses several marks or organs, which help to distinguish the locality in which each form occurs, as well as to define the associations of the implement as regards the weapon thrown from it and the game pursued. These marks are:\n\n1. Shape, or general outline in face and side view, and size.\n2. Handle, the part grasped in the hand.\n3. Thumb-groove or thumb-lock, provision for the firm and comfortable insertion of the phalanx and ball of the thumb.\n4. Finger-grooves, provision for each finger according to its use in the manipulation of the implement.\n5. Finger-pegs, little plugs of wood or ivory to give more certain grip for the fingers and to prevent their slipping. The devices for the fingers are the more necessary where the hands are cold and everything is covered with grease.\n6. Finger-tip cavities, excavations on the front face of the implement, into which the tips of the three last fingers descend to assist in grasping and to afford a rest on the back of these fingers for the weapon shaft.\n7. Index-finger cavity or hole, provision for the insertion of the index finger, which plays a very important part in the use of the throwing-stick.\n8. Spear shaft groove, in which the shaft of the weapon lies, as an arrow or bolt in the groove of a bow-gun.\n9. Hook or spur, provision for seizing the butt end of the weapon while it is being launched. These may be ridges left in the wood by excavation, or pieces of wood, bone, ivory, &c., inserted. The size and shape of this part, and the manner of insertion, are also worthy of notice.\n10. Edges: this feature is allied to the form and not to the function of the implement.\n11. Faces: upper, on which the weapon rests; lower, into which the index finger is inserted.\nThe figures illustrating this article are drawn to a scale indicated by inch marks in the margin, every dot on the line standing for an inch.\n\nBy the presence or absence, by the number or the shape of some of these marks or structural characteristics, the type and locality can be easily detected. The Eskimo have everywhere bows and arrows for land hunting, the former made of several pieces of bone lashed together, or of a piece of driftwood lashed and re-enforced with sinew. The arrows are of endless variety.\n\nIt should also be noticed that the kind of game and the season of the year, the shape and size of the spear accompanying the stick, and the bare or gloved hand, are all indicated by language expressed in various parts of this wonderful throwing-stick.\n\nGREENLAND TYPE.\n\nThe Greenland throwing-stick is a long, flat trapezoid, slightly ridged along the back (Fig. 2). It has no distinct handle at the wide end, although it will be readily seen that the expanding of this part secures a firm grip. A chamfered groove on one side for the thumb, and a smaller groove on the other side for the index finger, insure the implement against slipping from the hunter's grasp. Marks 5, 6, 7 of the series on page 280 are wanting in the Greenland type. The shaft-groove, in which lies the shaft of the great harpoon, is wide, deep, and rounded at the bottom. There is no hook, as in all the other types, to fit the end of the harpoon shaft, but in its stead are two holes, one in the front end of the shaft-groove, between the thumb-groove and the finger-groove, with an ivory eyelet or grommet for a lining, the other at the distal end of the shaft-groove, in the ivory piece which is ingeniously inserted there to form that extremity. This last-mentioned hole is not cylindrical like the one in front, but is so constructed as to allow the shaft-peg to slide off easily. These holes exactly fit two ivory pegs projecting from the harpoon shaft. When the hunter has taken his throwing-stick in his hand he lays his harpoon shaft upon it so that the pegs will fall in the two little holes of the stick. By a sudden jerk of his hand the harpoon is thrown forward and released, the pegs drawing out of the holes in the stick. At the front end of the throwing-stick a narrow piece of ivory is pegged to prevent splitting. As before intimated, this type of throwing-stick is radically different from all others in its adjustment to the pegs on the heavy harpoon. In all other examples in the world the hook or spur is on the stick and not on the weapon.\n\nUNGAVA TYPE.\n\nOne specimen from Fort Chimo in this region, southeast of Hudson Bay, kindly lent by Mr. Lucien Turner, is very interesting, having little relation with that from Greenland (which is so near geographically), and connecting itself with all the other types as far as Kadiak, in\nAlaska (Fig. 3). The outline of the implement is quite elaborate and symmetrical, resembling at the hook end a fiddle-head, and widening continuously by lateral and facial curves to the front, where it is thin and flat. A slight rounded notch for the thumb, and a longer chamfer for three fingers, form the handle. Marks 5 and 6 are wanting. The cavity for the index finger extends quite through the implement, as it does in all cases where it is on the side of the harpoon-shaft groove, and not directly under it. The shaft groove is shallow, and the hook at the lower extremity is formed by a piece of ivory inserted in a parallel groove in the fiddle-head and fastened with pegs. It is as though a saw-cut one-eighth inch wide had been made longitudinally through the fiddle-head and one-half inch beyond, and the space had been filled with a plate of ivory pared down flush with the wood all round, excepting at the projection left to form the hook or spur for the harpoon shaft. This peg or spur fits in a small hole in the butt of the harpoon or spear shaft and serves to keep the weapon in its place until it is launched from the hand. The Ungava spear is heavier than that of the western Eskimo, hence the stick and its spur are proportionately larger. It is well to observe carefully the purport of the spur. A javelin, assegai, or other weapon hurled from the hand is seized in the center of gravity. The Greenland spears have the pegs for the throwing-stick sometimes at the center of gravity, sometimes at the butt end. In all other uses of the throwing-stick the point of support is behind the center of gravity, and if the weapon is not fastened in its groove in cannot be hurled. This fastening is accomplished by the backward leaning of the peg in the Greenland example, and by the spur on the distal end of the throwing-stick in all other cases.\n\nCUMBERLAND GULF TYPE.\n\nThe Cumberland Gulf type is the clumsiest throwing-stick in the Museum, and Dr. Franz Boas recognizes it as a faithful sample of those in use throughout Baffin Land (Fig. 4).\n\nIn general style it resembles Mr. Turner's specimens from Ungava; but every part is coarser and heavier. It is made of oak, probably obtained from a whaling vessel. Instead of the fiddle-head at the distal end we have a declined and thickened prolongation of the stick without ornament. There is no distinct handle, but provision is made for the thumb by a deep, sloping groove; for the index-finger by a perforation, and for the other three fingers by separate grooves. These give a splendid grip for the hunter, but the extraordinary width of the handle is certainly a disadvantage. There are two longitudinal grooves on the upper face; the principal one is squared to receive the rectangular shaft of the bird spear; the other is chipped out for the tips of the fingers, which do not reach across to the harpoon shaft, owing to the clumsy width of the throwing-stick. In this example, the hook for the\nend of the bird-spear shaft is the canine tooth of some animal driven into the wood at the distal end of the long-shaft groove.\n\nFURY AND HECLA STRAITS TYPE.\n\nIn Parry's Second Voyage (p. 508) is described a throwing-stick of Igloolik, 18 inches long, grooved for the shaft of the bird-spear, and having a spike for the hole of the shaft, and a groove for the thumb and for the fingers. The index-finger hole is not mentioned, but more than probably it existed, since it is nowhere else wanting between Ungava and Cape Romanzoff in Alaska. This form, if properly described by Parry, is between the Ungava and the Cumberland Gulf specimen, having no kinship with the throwing-stick of Greenland. The National Museum should possess an example of throwing-stick from the Fury and Hecla Straits.\n\nANDERSON RIVER TYPE.\n\nThe Anderson River throwing-stick (and we should include the Mackenzie River district) is a very primitive affair in the National Museum, being only a tapering flat stick of hard wood (Fig. 5). Marks 2, 3, 4, 5, and 6 are wanting. The index-finger cavity is large and eccentric and furnishes a firm hold. The shaft-groove is a rambling shallow slit, not over half an inch wide. There is no hook or spur of foreign material inserted for the spear end; but simply an excavation of the hard wood which furnishes an edge to catch a notch in the end of the dart. Only one specimen has been collected from this area for the National Museum; therefore it is unsafe to make it typical, but the form is so unique that it is well to notice that the throwing-stick in Eskimoland has its simplest form in the center and not in the extremities of its whole area. It is as yet unsafe to speculate concerning the origin of this implement. A rude form is as likely to be a degenerate son as to be the relic of a barbaric ancestry. Among the theories of origin respecting the Eskimo, that which claims for them a more southern habitat long ago is of great force. If, following retreating ice, they first struck the frozen ocean at the mouth of Mackenzie's River and then invented the kayak and the throwing-stick, thence we may follow both of these in two directions as they depart from a single source.\n\nPOINT BARROW TYPE.\n\nThrough the kindness of Mr. John Murdoch, I have examined a number from this locality, all alike, collected in the expedition of Lieutenant Ray, U. S. A. (Fig. 6). They are all of soft wood, and in general outline they resemble a tall amphora, bisected, or with a slice cut out of the middle longitudinally. There is a distinct \"razor-strop\" handle, while in those previously described the handle is scarcely distinct from the body. Marks 3, 4, 5, and 6 are wanting. The index-finger hole is very large and eccentric, forming the handle of the \"amphora.\" The\ngroove for the harpoon or spear-shaft commences opposite the index-finger cavity as a shallow depression, and deepens gradually to its other extremity, where the hook for the spear-shaft is formed by an ivory peg. This form is structurally almost the same as the Anderson River type, only it is much better finished.\n\nKOTZEBUE SOUND TYPE.\n\nThe Kotzebue Sound type is an elongated truncated pyramid, or obelisk, fluted on all sides (Fig. 7). The handle is in the spiral shape so frequent in Eskimo skin-scrappers from Norton Sound and vicinity, and exactly fits the thumb and the last three fingers. Marks 5 and 6 are wanting. The index cavity is a cul de sac, into which the forefinger is to be hooked when the implement is in use. Especial attention is called to this characteristic because it occurs here for the first time and will not be seen again after we pass Cape Vancouver. From Ungava to Point Barrow the index-finger hole is eccentric and the finger passes quite through the implement and to the right of the harpoon or spear-shaft. In the Kotzebue type the index-finger cavity is subjacent to the spear-shaft groove, consequently the forefinger would be wounded or at least in the way by passing through the stick. The spear or harpoon-shaft groove is wide and shallow and passes immediately over the index cavity. The hook is of ivory and stands up above the wood. It needs only to be mentioned that this type, as well as those with eccentric forefinger perforations are used with the naked hand.\n\nIn the quarto volume of Beechey's Voyage, page 324, is mentioned a throwing-stick from Eschscholtz Bay, with a hole for the forefinger and a notch for the thumb, the spear being placed in the groove and embraced by the middle finger and the thumb. This last assertion is very important. When I first began to examine a large number of the implements, I could not explain the cavities for the finger tips until this note suggested that the shaft rides outside of and not under the fingers. To test the matter I had a throwing-stick made to fit my hand, and found that the spear could get no start if clamped close to the throwing-stick by all the fingers; but if allowed to rest on the back of the fingers or a part of them, and it is held fast by the thumb and middle finger, it had just that small rise which gave it a start from the propelling instrument.\n\nIn the national collection is a specimen marked Russian America, collected by Commodore John Rodgers, resembling in many respects the Kotzebue Sound type. The handle is of the same razor-strop shape, but on the upper side are three deep depressions for the finger-tips. In several of the objects already described provision is made for the tips of the last three fingers by means of a gutter or slight indentations. But in no other examples is there such pronounced separation of the fingers. In very many of the Norton Sound skin-dressers, composed of a stone blade and ivory handle, the fingers are separated in exactly\nopposite the index-finger gradually to its other side, formed by an ivory handle on the Anderson River.\n\nThe same manner. These skin-dressers are from the area just south of Kotzebue Sound. The back of the Rodgers specimen is ornamented in its lower half by means of grooves. In its upper half are represented the legs and feet of some animal carved out in a graceful manner. The index-finger cavity is central and is seen on the upper side by a very slight rectangular perforation, which, however, does not admit the extrusion of any part of the index-finger. The upper surface is formed by two inclined planes meeting in the center. Along this central ridge is excavated the groove for the spear-shaft, deep at its lower end and quite running out at its upper extremity. The hook for the end of the harpoon-shaft in this specimen resembles that seen on the throwing-sticks of the region south of Cape Vancouver. The whole execution of this specimen is so much superior to that of any other in the Museum and the material so different as to create the suspicion that it was made by a white man, with steel tools (Fig 8).\n\nEASTERN SIBERIAN TYPE.\n\nThe National Museum has no throwing-stick from this region, but Nordenskjöld figures one in the Voyage of Vega (p. 477, Fig. 5), which is as simple as the one from Anderson River, excepting that the former has a hook of ivory, while the latter has a mere excavation to receive the cavity on the end of the weapon. Nordenskjöld's bird-spear accompanying the stick has a bulb or enlargement of the shaft at the point opposite the handle of the throwing-stick, which is new to the collection of the National Museum. Indeed, a systematic study should now be made of the Siberian throwing-sticks to decide concerning the commercial relationships if not the consanguinities of the people of that region.\n\nPORT CLARENCE AND CAPE NOME TYPE.\n\nThe specimens from this area are more or less spatulate in form, but very irregular, with the handle varying from that of the razor-strop to the spiral, twisted form of the Eskimo skin-scraper (Fig. 9). On the whole, these implements are quite similar to the next group. A section across the middle of the implement would be trapezoidal with incurved sides. In two of the specimens not figured these curved sides are brought upward until they join the upper surface, making a graceful ornament. The handles are not symmetrical, the sides for the thumb being shaved out so as to fit the muscles conveniently. Places for the fingers are provided thus: There is an index-finger cavity quite through the stick indeed, but the index-finger catches in the interior of the wood and does not pass through as in the eastern Arctic types. The middle finger rests against an ivory or wooden peg. This is the first appearance of this feature. It will be noted after this on all the throwing-sticks as the most prominent feature until we come to Kadiak, but the Unalashkans do not use it on their throwing-sticks. Cavities for the three last finger-tips are not always present, and the hooks at the\ndistal ends for the extremities of the weapons are very large plugs of wood or ivory and have beveled edges rather than points for the reception of the butt end of the weapon to be thrown.\n\nNORTON SOUND TYPES.\n\nThese types extend from Cape Darby around to Cape Dyer, including part of Kaviagmut, the Mahlemut, the Unalignmut, and the Ekogmut area of Dall, and extending up the Yukon River as far as the Eskimo, who use this weapon. The characteristics are the same as those of the last named area, excepting that in many specimens there are two finger-peg instead of one, the first peg inclosing the middle finger, the second the ring-finger and the little finger (Figs. 10-13). A single specimen collected by Lucien Turner at Saint Michael's has no index cavity, the forefinger resting on the first peg and the other three fingers passing between this and the outer peg (Fig. 14). Another specimen of Nelson's, marked Sabotinsky, has the index-finger cavity and one finger-peg. The finger-tip cavity on the upper surface of the handle forms the figure of a water-bird, in which the heart is connected with the mouth by a curved line, just as in the pictography of the more southern Indians.\n\nThe Yukon River Eskimo use a throwing-stick quite similar to the Norton Sound type. The characteristics are very pronounced. Thumb-groove deep, index-finger cavity so long as to include the first joint. The hook for the spear-end formed by the edge of a plug of hard wood. The middle finger is separated by a deep groove and peg. The ring and little finger are inclosed by the peg and a sharp projection at the upper end of the handle.\n\nNUNIVAK ISLAND AND CAPE VANCOUVER TYPE.\n\nIn this region a great change comes over the throwing-stick, just as though it had been stopped by Cape Romanzoff, or new game had called for modification, or a mixing of new peoples had modified their tools (Figs. 15-17). The index-finger cavity and the hole for the index finger are here dropped entirely, after extending from Greenland uninterruptedly to Cape Romanzoff. The handle is conspicuously wide, while the body of the implement is very slender and light. The thumb-groove is usually chamfered out very thoroughly so as to fit the flexor muscle conveniently. There are frequently finger-grooves and finger-tip cavities in addition to the pegs. The cavity for the index finger having disappeared, provision is made for that important part of the hand by a separate peg and groove. The middle finger is also pegged off, and the last two fingers have to shift for themselves. The hook for the shaft of the weapon has a fine point like a little bead, the whole implement being adapted to the light seal-harpoon darts. Mr. Dall collected a large number of two-pegged sticks from Nunivak Island and four three-pegged sticks labeled the same. Mr. Nelson also collected four three-pegged sticks, but labels them Kushnuk, Cape Vancouver, on\nthe mainland opposite Nunivak (Fig. 17). In these three-pegged sticks the ring-finger and the little finger are inclosed together. This should be compared with Mr. Turner's Saint Michael specimen, in which the last three fingers are inclosed together (Fig. 14). It remains to be seen and is worthy of investigation whether crossing a narrow channel would add a peg to the throwing-stick. One of these Nunivak specimens is left-handed.\n\n**BRISTOL BAY TYPE.**\n\nThe throwing-stick from Bristol Bay resembles in general characteristics those from Nunivak Island and Cape Vancouver. In outline it has the shape of the broadsword. Its cross-section is bayonet-shaped. It has no distinct handle beyond a slight projection from the end. The thumb-groove is shallow and chamfered on the lower side to fit exactly. There is a long, continuous notch for the four fingers, in which the index finger and the middle finger are set off by pegs. There is a depression, more or less profound, to receive the tips of the fingers. The groove for the harpoon or spear-shaft is at the lower extremity and runs out entirely near the index finger. The ivory plug at its lower extremity is beveled to receive a notch in the end of the spear or harpoon shaft (Figs. 18-19).\n\nA freshly-made implement, looking as if cut out by machinery, resembling closely those just described, is labeled Kadiak. The constant traffic between Bristol Bay and Kadiak, across the Alaskan peninsula, may account for the great similarity of these implements. Furthermore, since the natives in this region and southward have been engaged for more than a century in fur-sealing for the whites, there is not the slightest doubt that implements made by whites have been introduced and slightly modified by the wearer to fit his hand.\n\n**KADIAK OR UNALASHKA TYPE.**\n\nIn the National Museum are four throwing-sticks, one of them left-handed, exactly alike—two of them marked Kadiak and two Unalashka (Figs. 20-22). They return to the more primitive type of the area from Kotzebue Sound to Greenland, indicating that the implement culminated in Norton Sound. In outline this southern form is thin and straight-sided, and those in possession are all of hard wood. The back is carved in ridges to fit the palm of the hand and muscles of the thumb. There is no thumb-groove, the eccentric index-finger hole of the Northern and Eastern Eskimo is present in place of the central cavity of the area from Kotzebue Sound to Cape Vancouver, and there is a slight groove for the middle finger. Marks 5 and 6 are wanting. The shaft-groove is very slight, even at its lower extremity, and runs out in a few inches toward the handle. The hook for the end of the weapon resembles that of Nunivak, but is more rounded at the point. Of the Eskimo of Prince William Sound, the extreme southern area of the Eskimo on the Pacific, Captain Cook says, in the narrative of his last voyage:\n\"Their longer darts are thrown by means of a piece of wood about a foot long, with a small groove in the middle which receives the dart. At the bottom is a hole for the reception of one finger, which enables them to grasp the piece of wood much firmer and to throw with greater force.\" Captain Cook's implement corresponds exactly to the specimens just described and renders it probable that this thin, parallel-sided, shallow-grooved throwing-stick, with index-finger hole placed at one side of the spear-shaft groove, extended all along the southern border of Eskimoland as far as the Aleuts of Unalashka and Attoo. In addition to the information furnished by the specimens in hand, Dr. Stejneger describes a similar stick in use in the island of Attoo. On the contrary, Mr. Elliott assures me that Aleutian fur-sealers of Pribylov Island use throwing-sticks precisely similar to those of Norton Sound and Nunivak.\n\nThis list might be extended further by reference to authorities, but that is from the purpose of this article and the series of ethnological papers commenced in this volume. The most perfect throwing-stick of all is that of the Mahlemut, in Norton Sound, in which are present the handle, thumb-groove, finger-grooves, and pegs, cavities for the fingertips, index finger cavity, shaft-groove, and hook for the harpoon. In short, all the characteristics present on the rest are combined here.\n\nClassifications of these implements may be varied according to the organ selected. As to the hook for the attachment of the weapon, in Greenland this is on the shaft, in all other parts of the world it is on the throwing-stick. As to the index finger, there is for its reception, from Point Barrow to Greenland, an eccentric hole quite through which the finger passes. From Kotzebue Sound to Norton Sound there is a central pocket on the back of the weapon, directly under the groove, for the shaft of the weapon to receive the index finger. From Cape Vancouver to Bristol Bay an ivory or wooden peg serves this purpose. At Kodiak and Unalashka the eccentric index-finger hole returns.\n\nIt is more than probable that further investigation will destroy some of the types herein enumerated or merge two more of them into one; but it will not destroy the fact that in changing from one environment to another the hyperboreans were driven to modify their throwing-stick.\n\nA still more interesting inquiry is that concerning the origin of the implement. It is hardly to be supposed that the simplest type, that of Anderson River, was invented at once in its present form, for the Australian form is ruder still, having neither hole for the index finger nor groove for the weapon shaft. When we recall that the chief benefit conferred by the throwing-stick is the ability to grasp firmly and launch truly a greasy weapon from a cold hand, we naturally ask, have the Eskimo any other device for the same purpose? They have. On the shaft of the light-seal harpoon, thrown without the stick, and on the heavy, ivory-weighted walrus-harpoon-shaft an ivory hand-rest is lashed just behind the center of gravity. This little object is often beautifully\ncarved and prevents effectually the hand from slipping on the shaft, even with the greatest lunge of the hunter. From this object to the throwing-stick the way may be long and crooked, or there may be no way at all. So far as the National Museum is concerned there is nothing to guide us over this waste of ignorance.\n\n### THROWING-STICKS IN THE U. S. NATIONAL MUSEUM\n\n| No.   | Locality                      | Collector                  |\n|-------|------------------------------|----------------------------|\n| 32995 | Norton's Sound, Alaska       | E. W. Nelson               |\n| 30043 | Cumberland Gulf              | W. A. Mintzner, U. S. N.   |\n| 33942 | Norton's Sound, Alaska       | E. W. Nelson               |\n| 33897 | do                            | Do                         |\n| 33961 | Saint Michael's Sound, Alaska| Lucien M. Turner           |\n| 24376 | do                            | Do                         |\n| 24337 | do                            | Do                         |\n| 24338 | do                            | Do                         |\n| 46652 | Port Clarence, Alaska        | W. H. Dall                 |\n| 46053 | do                            | Do                         |\n| 49001 | Kaskakishky, L. Yukon        | E. W. Nelson               |\n| 38849 | Yukon River                  | Do                         |\n| 38605 | do                            | Do                         |\n| 36014 | Kusshumuk, Sabotnisky, Alaska| Do                         |\n| 36018 | Kuskakuk, Alaska             | Do                         |\n| 49002 | Sabotnisky, Alaska           | Do                         |\n| 73227 | Unalashka                    | Catlin                     |\n| 2207 | Anderson River               | R. Kennicott               |\n| 90467 | Ugashik                      | William J. Fisher          |\n| 44295 | Cook Inlet                   | E. W. Nelson               |\n| 72519 | Cook's Inlet                 | William J. Fisher          |\n| 16242 | Nunivak Island, Alaska       | W. H. Dall                 |\n| 16238 | do                            | Do                         |\n| 74126 | Holsteinberg, Greenland      | George Marchant, Jr.       |\n| 13924 | Unalashka                    | W. H. Dall                 |\n| 89901 | Point Barrow, Alaska         | Lieut. P. H. Ray           |\n| 38669 | Chalitmut                    | E. W. Nelson               |\n| 24335 | Saint Michael's, Norton's Sound, Alaska | Lucien M. Turner |\n| 33914 | do                            | E. W. Nelson               |\n| 72928 | Kallak Island, Alaska        | David Minor, U. S. R. M    |\n| 36013 | Sabotnisky, Alaska           | E. W. Nelson               |\n| 72398 | Bristol Bay, Alaska          | Charles L. McKay           |\n| 16244 | Nunivak Island, Alaska       | W. H. Dall                 |\n| 11346 | Bristol Bay, Alaska          | Vincent Colyer             |\n| 10238 | Kuskakuk Island, Alaska      | E. F. Steenden             |\n| 15641 | Nunivak, Alaska              | W. H. Dall                 |\n| 16237 | do                            | Do                         |\n| 16239 | do                            | Do                         |\n| 15076 | Unalashka, Aleutian Islands  | Sylvanus Bailey            |\n| 15637 | Nunivak, Alaska              | W. H. Dall                 |\n| 15645 | do                            | Do                         |\n| 10236 | do                            | Do                         |\n| 15042 | do                            | Do                         |\n| 15046 | do                            | Do                         |\n\nS. Mis. 33, pt. 2—19\nPLATE I.\n\n(Mason. Throwing sticks.)\n\nFig. 1. Eskimo launching a seal harpoon by means of the throwing-stick. Mr. John Murdoch states that the hand is held much lower by the Point Barrow Eskimo, the harpoon resting as low as the shoulder, and that the movement of throwing the harpoon is quick, as in casting a fly in fishing.\nPLATE I.\n\nFig. 1. Eskimo using the throwing-stick.\nPLATE II.\n\n(Mason. Throwing-sticks.)\n\nFig. 2. Greenland type of throwing-stick. The specific characteristics are the broad form; the scanty grooves for thumb and fingers; the absence of pegs, separate finger grooves, or index perforation; but the most noteworthy are the two grommets or eyelets to fit ivory pegs on the harpoon-shaft. The peculiar method of strengthening the ends with ivory pieces should also be noted. From Holsteinburg, Greenland, 1884. Catalogue number, 74126.\nFig. 2. Greenland throwing-stick, back and front.\nPLATE III.\n\n(Mason. Throwing sticks.)\n\nFig. 3. Ungava type of throwing-stick. The specific marks are the general outline, especially the fiddle-head ornament at the bottom; the bend upward at the lower extremity, the eccentric perforation for the index finger, and the groove for three fingers. Collected at Ungava, by Lucien M. Turner, 1884. Museum number, 76700.\nFig. 3. Ungava throwing-stick, front and back.\nPLATE IV.\n\n(Mission. Throwing-sticks.)\n\nFIG. 4. Cumberland Gulf type of throwing-stick. The specific marks are the broad clumsy form, the separate provision for the thumb and each finger, the bent lower extremity, and the broad furrow for the bird-spear. Accidental marks are the mending of the handle, the material of the stick, and the canine tooth for the spur at the bottom of the square groove. Collected in Cumberland Gulf, by W. A. Mintzer, in 1876. Museum number, 30013.\nFig. 4. Cumberland Gulf throwing-stick, back and front.\nPLATE V.\n\n(Mason. Throwing-sticks.)\n\nFig. 5 Anderson River type. The specific marks are the extreme plainness of form, the lack of accommodations for the thumb and fingers, excepting the eccentric index-finger hole, the poor groove for the harpoon-shaft, and the absence of a hook or spur at the bottom of this groove. The accidental marks are cuts running diagonally across the back. In another specimen seen from the same locality the shaft groove is squared after the manner of the Cumberland Gulf type. Collected at the mouth of Anderson River, by R. Kenicott, in 1866. Museum number, 2267.\n\nFig. 6. Point Barrow type. The specific marks are the distinct handle without finger grooves, the very eccentric index-finger hole, the method of inserting the spur for the shaft, and the harpoon-shaft groove very shallow above and deep below. In the specimens shown by Mr. Murdoch there is great uniformity of shape. Collected at Point Barrow, by Lieut. P. H. Ray, in 1883. Museum number, 89902.\nFig. 5. Anderson River throwing-stick, front and back.\nFig. 6. Point Barrow throwing-stick, front and back.\nPLATE VI.\n\n(Mason. Throwing-sticks.)\n\nFig. 7. Kotzebue Sound type. The specific marks are the twisted handle, the broad shallow shaft groove, and, notably, the pocket for the index-finger tip visible on the lower side, but nearly absent from the upper side, and lying directly under the shaft groove. In the examples before noted all the holes for the index finger are to one side of this shaft groove. Collected in Kotzebue Sound, by E. P. Herendeen, in 1874. Museum number, 10235.\n\nFig. 8. The Rodgers type, so called because the locality is doubtful. In specific characters it resembles Fig. 7. The differences are the three cavities for finger tips in the handle, the shaft groove very shallow and running out before reaching the index-finger cavity, and the delicate hook for the spear shaft resembling those farther south. Since writing this paper two throwing-sticks from Sitka have been seen in many respects resembling this form, but covered all over their surfaces with characteristic Thlinkit mythological figures, and having iron hooks at the lower end of the shaft groove. Collected by Commodore John Rodgers, in 1867. Museum number, 2533.\nFig. 7. Kotzebue Sound throwing-stick, from and back.\n\nFig. 8. The Commodore Rodgers throwing-stick, front and back.\nPLATE VII.\n\n(Mason. Throwing-sticks.)\n\nFig. 9. The Port Clarence and Cape Nome type. The notable characteristics are the occurrence of an ivory peg in the handle for the middle finger, the very small size of the handle, and the central index-finger pocket central in position but quite piercing the stick. Collected by E. W. Nelson, at Cape Nome, in 1830. Museum number, 44392.\nFig. 9. Port Clarence and Cape Nome throwing-stick, front and back.\nPLATE VIII.\n\n(Mason. Throwing-sticks.)\n\nFIG. 10. Norton Sound type, single-pegged variety. Except in the better finish, this type resembles the one last described. Collected by L. M. Turner, at Saint Michael's Island, in 1876. Museum number, 24338\nFig. 10. Norton Sound throwing-stick, front and back.\nPLATE IX.\n\n(Mason. Throwing-sticks.)\n\nFig. 11. Norton Sound type, two-pegged variety. In all respects, excepting the number of pegs, this resembles Figs. 9 and 10. In all of them the peg at the bottom of the groove is very clumsy. Collected in Norton Sound, by E. W. Nelson, in 1878. Museum number, 32995.\n\nFig. 12. Throwing-stick from Sabotnisky, on the Lower Yukon. It belongs to the Norton Sound type. The cavity on the upper side of the handle for the finger-tips is remarkable for the carving of a bird resembling figures seen on objects made by the Western Indians of the United States. Collected by E. W. Nelson, at Sabotnisky, in 1879. Museum number, 36013.\nFig. 11. Norton Sound throwing-stick, front and back.\n\nFig. 12. Sabotnisky throwing-stick, front and back.\nPLATE X.\n\n(Mason. Throwing-sticks.)\n\nFig. 13. Specimen from Yukon River, belonging to the Northern Sound one-pegged variety. Collected by E. W. Nelson, in 1879. Museum number, 38549.\nFig. 13. Yukon River throwing-stick, front and back.\nPLATE XI.\n\n(Mason. Throwing-sticks.)\n\nFIG. 14. Throwing-stick from Saint Michael's. This specimen is very noteworthy on account of the absence of the index-finger pocket, a mark characteristic of the Vancouver type, Fig. 17. If the middle peg of the Vancouver example were removed the resemblance would be close, but the clumsy spur at the bottom of the shaft groove is Norton Sound rather than Nunivak. Collected by Lucien M. Turner, at Saint Michael's, in 1876. Museum number, 24335.\nFig. 14. Saint Michael's throwing-stick, front and back.\nPLATE XII.\n\n(Mason. Throwing-sticks.)\n\nFig. 15. Nunivak type. The characteristic marks are the absence of any cavity for the index finger, the nicely-fitting handle, the disposition of the finger-peg, and the delicate point on the ivory spur at the bottom of the shaft groove. Collected by W. H. Dall, at Nunivak Island, in 1874. Museum number, 16239. (This specimen is left-handed.)\nFig. 15. Nunivak Island throwing-stick, front and back, left-handed.\nPLATE XIII.\n\n(Mason. Throwing-sticks.)\n\nFig. 16. Specimen from Nunivak, right-handed. The cuts on the front and back are noteworthy. Collected by W. H. Dall, at Nunivak Island, in 1874. Museum number, 16238.\nFig. 16. Nunivak Island throwing-stick, front and back.\nPLATE XIV.\n\n(Mason. Throwing-sticks.)\n\nFig. 17. Specimen from Cape Vancouver. In all respects it is like those of Nunivak, excepting a peg-rest for the little finger. Collected by E. W. Nelson, at Cape Vancouver, in 1879. Museum number, 38669.\nFig. 17. Cape Vancouver throwing-stick, front and back.\nPLATE XV.\n\n(Mason. Throwing-sticks.)\n\nFigs. 18, 19. Bristol Bay type. In no essential characters do these sticks differ from those of Nunivak. The handle is smaller, and they appear to have been made with steel tools. Fig. 18 collected by C. L. McKay, at Bristol Bay, Alaska, in 1883. Museum number, 72398. Fig. 19 collected by William J. Fisher, at Kadiak, in 1884. Museum number, 90467.\nFig. 18. Bristol Bay throwing-stick, front and back.\nFig. 19. Bristol Bay throwing-stick, front and back.\nPLATE XVI.\n\n(Mason. Throwing sticks.)\n\nFig. 20. Unalashkan throwing-stick. It would be better to call this form the Southern type. The noticeable features in all our specimens are the parallel sides, the hard material, thinness, the carving for the fingers, but above all the reappearance of the eccentric cavity for the index finger. This cavity is not a great perforation, as in the Point Barrow type, but an eccentric pocket, a compromise between the Northern cavity and that of the East. Collected by Sylvanus Bailey, at Unalashka, in 1874. Museum number, 16076.\nFig. 20. Unalashkan throwing-stick, front and back.\nPLATE XVII.\n\n(Mason. Throwing-sticks.)\n\nFigs. 21, 22. Throwing-sticks of the Southern type. Fig. 21 is left-handed, collected by Dr. T. T. Minor, at Kadiak, in 1869. Museum number, 7933. Fig. 22 collected by W. H. Dall, at Unalashka, in 1873. Museum number, 12981. At Sitka two specimens were collected, unfortunately not figured, with the following characters laid down in the beginning of this paper: 1. Short, very narrow and deep, and carved all over with devices. 2. No handle distinct from the body. 3, 4, 5, 6. All wanting. 7. The index-finger cavity is near the center of the back, very like a thimble. Indeed this is a very striking feature. 8. The shaft groove occupies only the lower half of the upper surface. 9. The spur for the end of the weapon shaft is a long piece of iron like a knife-blade driven into the wood, with the edge toward the weapon shaft.\nFig. 21. Kadiak throwing-stick, front and back, left handed.\nFig. 22. Unalashkan throwing-stick, front and back.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_26668.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 84902, "total-output-tokens": 13255, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3017, 3], [3017, 5456, 4], [5456, 5703, 5], [5703, 5703, 6], [5703, 8002, 7], [8002, 10755, 8], [10755, 13600, 9], [13600, 16568, 10], [16568, 19350, 11], [19350, 22342, 12], [22342, 25409, 13], [25409, 28323, 14], [28323, 31238, 15], [31238, 34389, 16], [34389, 38015, 17], [38015, 38015, 18], [38015, 38015, 19], [38015, 38341, 20], [38341, 38392, 21], [38392, 38874, 22], [38874, 38924, 23], [38924, 39289, 24], [39289, 39336, 25], [39336, 39815, 26], [39815, 39871, 27], [39871, 40864, 28], [40864, 40972, 29], [40972, 42125, 30], [42125, 42242, 31], [42242, 42620, 32], [42620, 42688, 33], [42688, 42936, 34], [42936, 42990, 35], [42990, 43656, 36], [43656, 43763, 37], [43763, 43946, 38], [43946, 43999, 39], [43999, 44485, 40], [44485, 44542, 41], [44542, 44926, 42], [44926, 44995, 43], [44995, 45203, 44], [45203, 45259, 45], [45259, 45503, 46], [45503, 45559, 47], [45559, 45948, 48], [45948, 46054, 49], [46054, 46621, 50], [46621, 46673, 51], [46673, 47543, 52], [47543, 47656, 53], [47656, 47656, 54]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, true]}}]