[{"id": "785e3abb2cc2c1642c49a4e5a623e2338a342d72", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☑ Additional comments:/ Commentaires supplémentaires:\n\nThis copy is a photoreproduction.\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nGlenbow-Alberta Institute\nCalgary\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol (meaning \"CONTINUED\"), or the symbol (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole signifie \"A SUIVRE\", le symbole signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nFREE HOMES\nAND\nCHEAP RAILWAY LANDS!\nONE HUNDRED MILLION ACRES!\nOPEN FOR SETTLEMENT ALONG THE LINES OF\nTHE CANADIAN PACIFIC RAILWAY\nIN MANITOBA,\nASSINIBOIA,\nALBERTA,\nSASKATCHEWAN,\nTHE FOUR GREAT PROVINCES OF\nTHE CANADIAN NORTH-WEST,\nWITH MAPS, AND ILLUSTRATIONS MADE FROM PHOTOGRAPHS.\n\nFor further information apply to\nC. DRINKWATER, Secretary, MONTREAL.\nL. A. HAMILTON, Land Commissioner, WINNIPEG.\nTHREE YEARS' WORK!\n\nA STRIKING ILLUSTRATION OF ONE MAN'S SUCCESS\n\nIN FERTILE MANITOBA.\n\nMANITOBA.\n\nGENERAL FEATURES.\n\nManitoba has not a continuous stretch of level prairie, but on the contrary, is broken into a varied and diversified character, and presents a variety of topography. In the South it is broken by the Red River Valley, in the East by the Rocky Mountains, and in the North by the Riding Mountain Range. The central portion has large areas of forest broken by numerous lakes and river valleys, and are almost entirely covered with timber.\n\nRICHEST SOIL IN THE WORLD.\n\nThe soil is a rich, deep, black, argillaceous mould, or loam, resting on a firm and very tenacious clay subsoil. It is among the richest, if not the finest, soils in the world, and especially adapted to the growth of grain. Many of the farms in Scotland and Germany have been abandoned. This vast extent of the prairie soil has arisen from the decayed remains of trees, birds and animals and ashes of prairie fires, together with decayed vegetable matter, which has been mixed with a red clay subsoil. It is therefore a soil stored in wealth in the soil that the agriculturist need for any further investment.\n\nEXPERIMENT SURPLUS.\n\nThe wheat grown in Manitoba is eagerly sought after by the millers of Europe, owing to its superior quality and hardiness, considered the finest type of any wheat grown in the World.\nCLIMATE.\n\nThe climate in summer and cold in winter. The temperature in very nearly the same as that of the United States. In winter the thermometer sinks to zero. The atmosphere, however, is not so dry as that of the United States. Warm clothing, therefore, is not required. The climate is generally healthy, and there are no diseases peculiar to the province or the climate.\n\nAN ARMY OF SELF-BINDERS.\n\nHARVESTING BY WHOLESALE.\n\nCANADIAN NORTH-WEST CROPS MAKE SUCCESS SURE.\nTHE CYPRESS HILLS COUNTRY.\n\nThe Cypress Hills are the only range of hills in the South from the Railway, and are well adapted for stock raising and as their elevation is sufficient to prevent them from being an uncertainty, the grass land that will be found there will not likely be disturbed by the snows of winter or the storms of spring, never failing to provide good pasture ground for his stock. The snow climate is tempered by the Chinook winds, and water\n\nTHE RESULT OF SIX YEARS' EARNEST WORK.\n\nThere are hundreds more as good got without capital to start with.\nALBERTA:\nTHE NORTHERN PART.\n\nCATTLE RAISING.\n\nROLLING LANDS,\nHILLS, WOODLANDS,\nLAKES and RIVERS.\n\nNOT ALL LEVEL PRAIRIE!\nPLENTY OF VARIETY!!\nTHE FAT HERDS\nUPON\nA THOUSAND ACRES,\n\nTHRIVE UPON THE RICH NATURAL GRASSES,\nAs does their owner, on the profits they afford.\n\nRANGE CATTLE.\n\nAlberta.\n\nGENERAL FEATURES.\n\nCAPABILITIES.\nROOM TO GROW!\n\nALWAYS MORE FAT ACRES\n\nFOR\n\nTHE SUCCESSFUL SETTLER\n\nTO ADD TO HIS FIRST CLAIM\n\nIN THE\n\nCANADIAN NORTH-WEST.\n\n13\nWHAT CAN BE DONE!\n\nThe First Year in Manitoba.\n\nA practical farmer of some years residence in Manitoba makes the following statement:\n\nLand can be purchased cheaply here, or it can be had for nothing by homesteading. This enables farmers with small capital to commence farming. It is all plain sailing; no stamps or stones to take out; all level prairie land ready for the plough. A farmer can begin on a small capital. A single man can start on an outlay of $350, made up as follows—a yoke of oxen and harness, $175; plow, harrow, etc., $10; stove and furniture, $40; bedding, etc., $20; lumber, tools, windows, etc., or log shanty, $50; provisions, $60; seed, $50. A farmer with a family of five, would have to lay out $140 more, bringing his outlay up to $925.\n\nA farmer can come about the middle of May, select his land and build his shanty; he can commence to plough about the 5th of April; he can break 10 acres and put it under crop on the sod; then continue breaking for two months after he puts the 10 acres under crop, and can easily break thirty acres, and harvest the 10 acres in the fall, ready for crop in the spring. He can raise enough on the ten acres to give him a start; he can cut hay enough for his oxen and a cow in July, and it will cost him about $50 additional to seed the forty acres in the spring.\n\nSuppose he puts in 40 acres of wheat, and raises 25 bushels to the acre, at 80 cents per bushel, it will be worth $800; say 5 acres of oats at 40 bushels per acre, at 35 cents per bushel, $70; say 1 acre of potatoes, 200 bushels, at 40 cents, $80; 3 acres of barley, 10 bushels per acre, worth 40 cents, $120; and 1 acre of garden stuff at $1.20; total, $918. After deducting expenses of harvesting and the whole original outlay, the farmer will still have something to the good to start with next year. Young farmers should take a note of this, and secure land in this country before it is all taken up.\n\nWHAT CAN BE DONE!\n\nButter Making in Alberta.\n\nA practical man in Alberta, makes the following statement about Butter making in Alberta—\n\nA settler arrives here having means to put up a small house on his future homestead, and has also means to get a span of horses, a plough and harrow, with enough of seed to plant a few acres. Then, if he has a wife, and $100 left, let him buy two cows; if more money still, more cows—say five cows the first year. From these he will be able to make five pounds of butter daily during five months, worth in our market 25 cents a pound (1s.). This will support himself and wife. The milk will also feed three calves and a couple of pigs. Now, it must be remembered that the care of the cows not prevent him from cultivating a good garden and attending to several hundred of acres of grass and grain. And it must be also remembered, in connection with all this, that no matter how favorable the season may be, the garden and the cultivated acres may prove a failure, but neither hail-storm nor frost affect the returns from properly attended milch cows.\n\nOf course, the above applies to individual beginnings of an industry that will unavoidably merge into a co-operative dairy farming, when the creamery will be established in the centre of the township, where the individual or company will gather the cream from the surrounding farmers, and employ a practical and trained butter-maker, who will produce from the uniform and unequalled cream of Alberta, the gilt-edged creamery butter of commerce, unsurpassed, if equalled, by any in the world.\nCOST OF RAILWAY TICKETS REFUNDED.\n\nThe Company has been informed that the Company's tickets will be refunded if the holder purchases land from the Company. In this way, land hunters are enabled to purchase land at a lower price than they would have paid otherwise.\n\nSOUTHERN MANITOBA LANDS.\n\nSouthern Manitoba is called to the notice of the Manitoba Southern Railway Company, administered by the same department as that which administers the lands of the Canadian Pacific.\n\nThere are several difficulties which have now passed away. The lands of Southern Manitoba were for a long time looked upon as being of no value. In the meantime, all the available government lands in Southern Manitoba have been sold, so that at the time the railway line was opened, there was not enough land available for sale.\n\nThe section of country is well wooded.\n\nThere are many trees of various kinds and ages, some of them being very old, while others are still young. The soil is very fertile, and the trees grow rapidly.\n\nWILD FRUITS AROUND.\n\nThere are many wild fruits growing around, such as blackberries, raspberries, wild plums, gooseberries, and currants, also red and black cherries.\n\nGAME.\n\nThere are many animals living around, including deer, moose, and other game birds. There are also many species of wild animals, such as bears, foxes, and raccoons.\n\nFISH.\n\nThere are many fish living in the streams and ponds, including trout, salmon, and other species of fish.\nADVICE TO SETTLERS.\n\nThe newcomer need not fear that when he reaches Winnipeg he will fall into the hands of thieves, impostors, or unfriendly people. If he follows the directions of this pamphlet, he will put himself in the hands of true friends, who will look after him. The train is met upon its arrival by the agents of the Government and of the Canadian Pacific Railway Company, who take charge of Immigrants and give them all the assistance and advice they need in a strange land.\n\nCHOOSING A LOCATION.\n\nIn cases where they have already fixed upon some locality for settlement, where friends are awaiting them, they are shown how to proceed directly to that point. If they have not decided upon such a locality, but intend to seek a home somewhere further West, they should immediately call upon the Land Commissioner of the Canadian Pacific Railway Company.\n\nTHE PRICE OF RAILWAY LANDS,\n\nTheir proximity to a railway station or marker, the amount of settlement, the past history of people in the neighborhood, and the exact character of the soil can be learned at his office. Every quarter section of land has been surveyed by the Railway Company and a plan of each section is shown on the map. It is also reported upon in detail.\n\nAll this information is open to the intending settler. If the land of a given section is sandy, or rocky, or marshy, or otherwise unsuitable for farming, he is told so; if it is good land for growing, but poor for farming, he learns that; if it is thoroughly fertile and desirable, that will be pointed out. In short, the whole truth, whether it is favorable or unfavorable, can be learned from the maps and surveyor's notes shown in this office.\n\nPERSONAL INSPECTION.\n\nMost men, nevertheless, naturally wish to examine for themselves the section which seems to them from these reports most suitable, and this is strongly recommended in every case. They are then told what is the nearest and cheapest way to reach it, (special facilities being provided for this purpose), and, when necessary, are furnished by the Dominion Government Intelligence Officer with a guide, who either accompanies them all the way from Winnipeg, or meets them at the nearest railway station, and assists them in every way during their stay. If they are pleased (which is usually the case), all the arrangements for their stay, or for its purchase, are made at once, and the immigrant, therefore, need delay between the arrival of an immigrant at Winnipeg and his settlement upon the land of his choice.\n\nWHERE SHOULD I GO?\n\nIf you want to confine your farming purely to grain growing, select your land in\n\nMANITOBA OR EASTERN ASSINIBOIA,\n\ngetting as close to a railway station as possible. If for cattle, horse or sheep raising,\n\nWESTERN ASSINIBOIA OR ALBERTA.\n\nMixed farming can be carried on to advantage in any of these Provinces.\nTHE FAT FRUITS OF A CANADIAN NORTH-WEST FARM.\n\nSTACKS OF \"No. 1 HARD.\"\n\nTHE BEST WHEAT IN THE WORLD.\nTHE Canadian Pacific Railway\n\nIS\n\nTHE ONLY RAIL ROUTE TO THE FERTILE FARM LANDS\nAND THE BROAD PASTURES OF\nManitoba,\nThe North-West Territories,\nAND THE\nMINING, LUMBERING, AND FARMING REGIONS OF\nBritish Columbia,\n\n—AND IS ALSO—\n\nThe Best Route to WASHINGTON TERRITORY!\nAnd Points on Puget Sound and the Pacific Coast.\n\nNO CUSTOMS TROUBLES! NO TRANSFERS!\n\nPassengers from Europe, Homemakers, Tourists and Sportsmen, leave the Trans-Atlantic Steamer at Quebec, in summer, and at Halifax, Nova Scotia, during the winter months. At either of these points they will be met by an agent of the Company, who will take charge of them, see after baggage, and furnish all needful information concerning the journey.\n\nNo Railway in America offers so many accommodations to SECOND CLASS or COLONIST Passengers at so little expense as does the CANADIAN PACIFIC. Colonists are able to travel to NEW HOMES in MANITOBA, the NORTH-WEST, or BRITISH COLUMBIA, with nearly as great comfort as First Class Passengers.\n\nCOLONIST SLEEPING CARS.\n\nThe Cars devoted to the use of Colonists are taken upon the same fast trains with the first class cars, and every one is a sleeping car, going through WITHOUT CHANGE to the PACIFIC COAST. These cars are similar in size, windows, and ventilation to the first class cars, but are not upholstered. The seats are arranged in pairs facing each other on each side of the car, are of comfortable shape, and are made so that they can be joined into a berth, ready for the reception of a man,太太 and a child. Every passenger has a single berth and a bedlet is furnished for it; EXACTLY the SAME as in FIRST CLASS SLEEPER. Over each pair of seats a broad upper berth, hinged against the wall of the car, can be let down and form an additional sleeping place. No Extra Charge is made for these Sleeping Accommodations; they are a part of the Regular Car. Second Class Passengers, however, must provide their own bedding. If they do not bring it with them, a complete outfit of mattress, pillow, blanket and curtains may be bought of the Agent of the Company at the point of starting at a cost of $2.50. (These articles become the property of the purchaser.) The curtains may be hung around the berth, turning it into a little private room. SMOKING IS NOT PERMITTED in any part of this car.\n\nFor further information apply to\n\nARCHER BAKER,\nEuropean Traffic Agent.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_34481.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 84846, "total-output-tokens": 5174, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1575, 3], [1575, 3155, 4], [3155, 3155, 5], [3155, 3554, 6], [3554, 3554, 7], [3554, 4951, 8], [4951, 4951, 9], [4951, 5425, 10], [5425, 5425, 11], [5425, 5995, 12], [5995, 5995, 13], [5995, 6136, 14], [6136, 6136, 15], [6136, 6320, 16], [6320, 6320, 17], [6320, 6447, 18], [6447, 6447, 19], [6447, 9960, 20], [9960, 9960, 21], [9960, 11419, 22], [11419, 11419, 23], [11419, 14270, 24], [14270, 14270, 25], [14270, 14371, 26], [14371, 14371, 27], [14371, 16743, 28], [16743, 16743, 29], [16743, 16743, 30], [16743, 16743, 31], [16743, 16743, 32], [16743, 16743, 33], [16743, 16743, 34], [16743, 16743, 35], [16743, 16743, 36], [16743, 16743, 37], [16743, 16743, 38], [16743, 16743, 39], [16743, 16743, 40]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "None", "None", "None", "en", "None", "None", "None", "None", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, true, true, true, true, true, true]}}]