[{"id": "16871dbdd641d661d0630eabe82a4238068f39b1", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- Coloured covers/Couverture de couleur\n- Covers damaged/Couverture endommagée\n- Covers restored and/or laminated/Couverture restaurée et/ou pelliculée\n- Cover title missing/Le titre de couverture manque\n- Coloured maps/Cartes géographiques en couleur\n- Coloured ink (i.e. other than blue or black)/Encre de couleur (i.e. autre que bleue ou noire)\n- Coloured plates and/or illustrations/Planches et/ou illustrations en couleur\n- Bound with other material/Rellé avec d'autres documents\n- Tight binding may cause shadows or distortion along interior margin/La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- Coloured pages/Pages de couleur\n- Pages damaged/Pages endommagées\n- Pages restored and/or laminated/Pages restaurées et/ou pelliculées\n- Pages discoloured, stained or foxed/Pages décolorées, tachetées ou piquées\n- Pages detached/Pages détachées\n- Showthrough/Transparence\n- Quality of print varies/Qualité inégale de l'impression\n- Includes supplementary material/Comprend du matériel supplémentaire\n- Only edition available/Seule édition disponible\n- Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nA LECTURE\n\nDELIVERED BEFORE THE\n\nBROCKVILLE LIBRARY ASSOCIATION\n\nAND\n\nMECHANICS' INSTITUTE.\n\nINTRODUCTORY\n\nTO THE COURSE OF LECTURES FOR 1855,\n\nBY THE\n\nREV. J. TRAVERS LEWIS, L.L.D.\n\nPRINTED BY REQUEST OF THE ASSOCIATION.\n\nBROCKVILLE:\nDAVID WYLIE, PRINTER, RECORDER OFFICE.\n\n1855.\nBROCKVILLE, January 9, 1855.\n\nREVEREND AND DEAR SIR,\n\nFeeling highly gratified with the LECTURE delivered by you before our INSTITUTE at the opening of the Course, we most respectfully request that you will favor us with a Copy for Publication, and in doing so we are only complying with the wishes of all who had the satisfaction of hearing you upon that occasion.\n\nWith much esteem, your obedient servants,\n\nT. REYNOLDS, M.D., President.\nW. B. SIMPSON, Vice President.\nD. WYLIE, Secretary.\nF. M. HOLMES, Treasurer.\n\nG. SHERWOOD,\nJOHN CRAWFORD,\nW. FITZSIMMONS,\nJ. D. BUELL,\nW. B. SHERWOOD,\nW. B. McCLEAN,\nADIEL SHERWOOD,\n\nDirectors.\n\nTo the Rev. J. T. Lewis, L. L. D., Brockville.\n\nPARSONAGE, January 11, 1855.\n\nGENTLEMEN,\n\nI cannot refuse to comply with a request so kindly made.\n\nThe fact of the Lecture having been prepared without any view to its Publication, will, I trust, secure it from criticism.\n\nI am, your obedient servant,\n\nJ. TRAVERS LEWIS.\n\nTo Thos. Reynolds, Esq., M.D., W. B. Simpson, Esq., &c., &c.\nMr. President,\n\nI conclude that the design of the Course of Lectures, which I have the honor to introduce, is not so much the diffusion of information, as to stimulate those who hear them to the pursuit of knowledge, and to the attainment of that mental culture which are the source of such delight and happiness to those who are fortunate enough to possess them.\n\nThe popularity of Lectures is certainly a peculiarity of the age in which we live; and so far as it arises from a thirst for information, it is a pleasing symptom of natural and individual improvement, but so far as it springs from a mental indolence which contents itself with what is superficial and amusing, because it cannot endure patient and regular study, so, proportionally, must the Lecture system be suspected. Even in the most elaborate Essay on any subject of interest, it is impossible by the reading of it to an audience, to impart to them the same amount of information which they would have derived from a careful perusal of the same production when committed to print; it is impossible in a single Lecture, which is necessarily limited in time, to do justice to the subject in hand, for this reason, that the topic usually selected is one of vast interest or importance, chosen, perhaps, for the express purpose of attracting a crowd. But while this is generally impossible, yet, still there is a wide and useful field open to the lecturer; he may so treat the subject as to make it apparent to his hearers, how desirable a theme it is for future investigation; he may introduce them, as it were, to some point of history or philosophy; the introduction so commenced may lead to friendship, friendship to love, and love to enthusiasm in the pursuit of learning. It is possible to give the outlines, and sometimes even to partially complete\nthe picture we would present to the imagination, but on most occasions, if we succeed in creating a desire to realize perfectly, by after investigation, the effect of the masterpiece, if we can induce but a few to endeavor, by research and diligence, to make themselves acquainted with all the beauty and utility of any literary or scientific subject, the lecturer will have gained his object, though he himself admitted his audience but to a mere glimpse of its excellency. Allow me, therefore, to draw the attention of those who love to follow after knowledge, while I offer them a few words of encouragement to persist in their noble aspiration.\n\nThere is no truth more trite, no observation more common, than, \"onward is the progress of the human mind,\" but too many are content to receive this axiom in all the faith of blind confidence in our destiny, without realizing the necessity of taking any part in this march of the human intellect; they rest satisfied with their position as units in the mixed multitude that are marching to the promised land of perfect knowledge and universal happiness, ignorant alike of the means which facilitate, or the impediments which check the mighty movement. They see that sufficient advance is now and then made to create a strong probability of the ultimate possession of the land, therefore, whatever the dangers, whatever the delays, the exulting declaration is still the same, \"onward is the progress of the age,\" the spirit of improvement is irresistibly diffused. Now, just in proportion as these assertions are true, so precisely is the disgrace attaching to each individual who does not aid the progress of the human family, who does not imbibe the spirit of improvement so universally recognized; a just reproach adheres to every man who is conscious that vast strides are being taken by his fellow-men, and yet will make no effort to direct their steps aright, or to keep pace himself with the enlightenment of the times, but who loiters along, satisfied with occasionally asserting his belief in the final triumph of knowledge, and listlessly suffering himself to be distanced in the glorious struggle, an idle spectator, when he might be an aspiring competitor. Multitudes in society answer to this description, who make it their constant boast that they live in an era of extraordinary improvement, the boast implying that they have a knowledge of the past, because a certain amount of information is indispensable when we would trace the increasing knowledge and skill of mankind. To appreciate the wonders of our day, we must be able to contrast or compare\nthem with the achievements of the past; and what a field of exploration is here opened to the inquiring mind! What an inducement to the student of history! No man is tempted to depreciate the age in which he lives; occasionally, men will indeed be found who are bold to affirm that happiness has not kept pace with improvement, and that with all the comforts and luxuries of modern times, true enjoyment of life has been equally shared by all ages; but there is little dread lest any be induced to disparage the present in point of knowledge and power. On the contrary, the danger is that in our pride of relative position, in our boasted pre-eminency, we be tempted to withhold from the giants of erudition who adorned the annals of the past, the honor due unto their names. Who can occupy the true station of arbitrator between the ancient and the modern, save the man who is acquainted with the merits of each, who has read the page of history, and carefully pondered over the gradual enlightenment which it tells him, at one time shone with a dimmed radiance, at another time barely dawned, until we come to our own time when the brilliancy is such that we are bold enough to think it the perfect day. The history of Science and Literature is almost as interesting and instructive a pursuit as the study of the science itself—interesting, as proving to us how Providence prepares the way for every new revelation of himself through the medium of his works, and instructive, as teaching us that we cannot precipitate our destiny—that the arts and the sciences by which human life is sustained and blessed, and by which society is civilized, are not of sudden growth; that they partake of the nature of the oak, not of the mushroom, and that in their development generations pass away, though from the infirmity of our nature we are ready to suppose that the discoveries of our day throw all others into the shade. But let me not be understood to depreciate the astonishing inventions of our age; I would only invite to an attentive perusal of historical records as a preliminary to a sober comparison of the works of the men of old time with those of our day; no, it is unlikely that any will be found to hazard the assertion that this has been an unprogressive age; the very dreams of the last generation, (I had almost said of our own childhood,) have been realized in this. It is hardly exceeding sober statement to affirm that the fables of a generation or two ago have become verified facts; man's dominion over earth seems to be well nigh perfected: the very elements fulfill his will and are\nmade subservient to his convenience; water in his hands becomes irresistible in strength, and in the form of vapour surpasses the might of giants or the labors of Heracles, stimulating commerce by draining, as nothing else can, the depths of the mine, and transporting man and his works with the speed of an Eagle, from one climate to another. The very lightning is mimicked by man, and becomes his interpreter. The fairy tales with which our fathers amused their children were not more difficult to believe, than the prediction (had any been bold enough to hazard it) which is now fulfilled, that man could speak with man, nay, transact with him the ordinary business of life, though separated by seas and continents. The Magnetic Telegraph is the verification of what was once thought fit work for a Magician. But why dwell on such marvels? We print and paint with rays of light; we converse, and gild, and decorate with flashes of lightning. The minutest particles of poison detected by unerring tests, reveal the skill of our Chemists, while worlds within worlds are laid open to our eyes by the miracle-working Microscope. The Telescope, with ever increasing power, enables us to pierce into systems before unimagined, to explore the hosts of heaven, so that the wonder is that a Planet remains undiscovered. The Moon is mapped and surveyed by our Astronomers, more as though she were a province of earth than a Satellite in the heavens. Our Geologists read in the strata of the earth beneath our feet, the history of Creation, and give us, as it were, an insight into that vast and indefinite period when \"The earth was without form and void, and darkness was upon the face of the deep.\" They enable us to understand the seven days of the inspired historian, by showing with the certainty of demonstration the several ages of development in preparing the Globe for the use of man; nature thus corroborating and explaining revelation.\n\nBut let me forbear from the tempting theme of enumerating the victories of intellect achieved in our time. If knowledge is power (and who can doubt it) how powerful is man! The vast machinery with which we are furnished for extending the happiness of our species, and promoting civilization, seem now so far transcending that of any other age, that the thought is too often prompted, how superior to the men of by-gone days are our contemporaries, how immeasurably exalted in capacity is the human mind above the prejudices and the littleness of the past. But let us pause ere we commit ourselves to such a boast, and; perhaps, consideration may\nsuppress our vaunting, and bid us reflect lest we miss the lesson inculcated by the history of science. It was in those ages, which, in our relative superiority, we designate as dark, that the Mariner's Compass, Gunpowder, and Printing were discovered in Europe; discoveries that may well claim comparison with any three that have taken place since, in their importance as agents in the civilization of the world. It is undeniable, that the votary of fine Art who aims at perfection in Architecture, Statuary or Painting, has now to wander to the classic grounds of Italy or Greece, for his model in every species of excellence. Why should we forget that centuries before the Christian Era, Science was so successfully cultivated in lands now given over to desolation, that even the prostrate columns of their Temples are deemed worthy of transportation to England and America, the Sculptor's art having never since reached similar perfection. Layard has disinterred from a grave of 2,000 years, specimens of art and proofs of luxurious refinement, which seem even now extraordinary. Let us not forget, too, that the orators and reasoners of all modern times, acknowledge, as their masters and models, the Grecian and Roman, who spoke and wrote for immortality. Even in the New World, in Central America, have been discovered incontestible remnants of Nations, strong and civilized, barbarians only in their heathenism, but in the luxuries and refinement of life vastly superior to many countries of the present day, and these none of the most contemptible; nay, when we would give utterance to our expression of the magnificence or grandeur, or illustrate the power of man, do not the Temple of Solomon and the Pyramids of Egypt instinctively recur to imagination, and not to lengthen the catalogue of ancient glories, is not the oldest volume in the world the most noble specimen of sublimity of style? And yet where are now those mighty works performed in the infancy of the world? What remains of ancient civilization? Little except the fragments, all but miraculously preserved; luxury and wealth induced immorality, immorality produced decay, until actual barbarism rioted where once Philosophy and the Arts flourished so eminently.\n\nFrom a settled conviction that possesses the human mind, that the destiny of man is ever progressive, that a relapse into an inferior position is almost impossible, we do not concede to the nations of antiquity their due meed of praise; we glance hastily at their biography, and our eye rests on the page which records their\ndegradation and mental slavery, and we hastily assume that the antecedent civilization is overrated, and but for the monuments of their knowledge and power which the ravages of time have spared, but for the treasures which our libraries and museums present to our astonished gaze, we would unhesitatingly conclude, that the wave of human progress has ever been uniformly advancing with a flowing tide, that the current of civilization had never ebbed, that storms and tempests have never dashed the wave back or broken it on the quicksand or the rock. Let me not, therefore, be thought partial, when I say that, notwithstanding our great and absolute superiority, we are relatively inferior to the men of old time. Only let us take into account the advantages possessed by the present age, and any of those epochs of the past which is famous for its learning and civilization, contrast the facilities possessed by each for the propagation and perfection of knowledge, and we shall be at no loss in ascertaining to whom the palm is to be ascribed. Compare the productions of Greece or Rome in the field of art and science with those of our time, and before adjudicating the prize to either, bear in view the difficulties to be encountered in the infancy of any art, and the facilities possessed by us who have the experience of ages for our guide, and then say whether we progress in so surpassing a ratio. We are contrasting, be it remembered, the works of an age when a manuscript was the toil of a lifetime, with those of a period when a useful idea is scarcely suggested, before it is diffused so rapidly and extensively by the press as to excite our admiration and surprise; who can deny that the Alexandrian Library, with its four hundred thousand manuscript volumes, in the days of Caesar, was not a more wonderful monument of human industry and skill, than any library of the present day? More than two thousand years ago, the Fine Arts, Physical and Ethical Philosophy, seem to have been more earnestly sought after for their own sake than now. Calculations of utility and remuneration were unknown, or if known, despised, when the interest of science or the perfection of beauty were at stake. It is now-a-days no small stimulant to knowledge that money may be made by its possession. Men now trade on the products of each other's intellect as they do on the fruits of the earth. Former ages had no such artificial spur to urge them to learning. If, therefore, we compare the ability of the ancients with our own to cherish and foster literary and scientific pursuits, if the power to\neducate and inform the mind which our vast wealth bestows be taken into account, we shall find but little cause of congratulation. Facts speak convincingly. The English people spend on the single item of ardent spirits more money than on all their religious and educational establishments combined; while the American people spend on their gratification in the single item of cigars, a larger sum than is expended on all the Common Schools of the Union.\n\nThe inference, then, is inevitable, that literature and art were prized more highly and cultivated more ardently for their own sakes by the nations of antiquity than by us, when we honestly estimate their difficulties and our facilities; their poverty and our resources. And yet notwithstanding their eager quest after knowledge, in spite of their ardent aspirations after science, they could not preserve or perpetuate in their own countries the same noble feeling. Where is now in the scale of nations that land to which we owe our Geometry, and Algebra, and Arithmetic? Hindoos and Arabs bequeathed these triumphs of genius to us. Yet they are fallen as a people, they are even degraded as nations. What is now the social and political position of Greece and Rome, those nations which once dictated to the world, and which are so associated in the student's mind with the arts of war and peace, that it is difficult to believe in their present poverty of mind and imagination. But why mention other examples of civilization corrupted, of knowledge perverted, of glories departed? The splendor of the Italian Republics is gone. Nothing remains in memory of the departed glory of the empires of the past, save their venerable ruins, and their incomparable public works, which even now bewilder with their vastness. And does the analogy (it is the point which concerns us more immediately) justify us in dreading a like decay in Anglo-Saxon knowledge and power? No! there are certain safeguards, if we but employ them, which render the destruction of our civilization improbable, nay, impossible. The bulwarks against that worst of barbarisms, corrupted civilization, are the diffusion of useful knowledge and our Christianity. Among the ancients knowledge was the possession of a few, with us the multitude seek after learning. With them the student in Philosophy had no security that the efforts of his genius, however successful, would be perpetuated to his descendants, or even imparted to his contemporaries. Indeed it is almost certain that there\nis scarcely an invention in art or science of modern times, which was not known in theory to some of the philosophic ancients; but with the man perished the invention. The manuscript which contained the treasure was neither understood nor valued, and thus the acquisition to human knowledge was lost. Now, the diffusion of every scientific and literary achievement through the aid of printing renders such an event almost impossible, and thus the perpetuity of our discoveries is guaranteed. Hence it is that we should hail with joy the advent of every means by which learning is distributed abroad, and the masses enlightened. Hence it is that we should rejoice in the attainment of every new motive to literary and scientific distinction. Therefore it is that the true philanthropist hears with satisfaction of every new school of science, of every additional University, of every well established Mechanics' Institute. He knows full well, that knowledge imparted does not diminish the store of the teacher, and he sees in every new improvement in the education of a people, the surest means of retaining to the human family the blessings of past experience. He feels that though revolution may upturn the foundations of society, though pestilence may thin its members, though war may make havoc of the feelings and lives of a nation, yet that the possessors of knowledge are now too numerous to be wholly cut off. That should one library be consumed, another exists.—Should one or even a thousand professors of literature perish, yet that owing to the wide spread diffusion of information, there will ever be a remnant to re-construct the frame work, and elaborate to completion the Temple of Science, the products of the mind becoming like the mind itself—imperishable, immortal.\n\nI have spoken of one of the securities possessed by the present age against the sudden decay of our knowledge, and which forbids a belief in any great liability of our inventions to the danger of passing away and being forgotten. Let me now allude to another, to one which can save our literature from corruption and consequent decay, which can foster and promote science, while it preserves it from perversion, which can direct our knowledge to good, and divert it from evil—a bulwark against the abuse of learning and the aversion to it which is sure to follow, I mean the Christian Religion. As a defender of that fortress by conviction and profession, let me invite the attention of the candidate for knowledge to the beneficent influence exercised by Christianity\nover the intellectual pursuits of man. The friend of his fellow-\ncreature who deems the welfare of his kind his own personal\nconcern, will ever dread lest by possibility there should arise a\nprejudice against knowledge and mental culture, lest a time should\never be, when power abused should lead to a re-action against\nintellectual progress; this is no imaginary danger. The prodigious\nstrides in knowledge taken by the French nation previous to her\ngreat Revolution did not save her from convulsion, while the prover-\nbial brilliancy of her genius and scientific research, being associated\nwith her impiety, became an argument against itself. In the\npresent age, we have no reason to dread that our arts and sciences\nwill ever degenerate into superstition or senseless theory. Astro-\nnomy, in our hands, will never again become Astrology. We may\nsafely affirm that Chemistry will never more resolve itself into\nAlchemy and Magic; but we have other more substantial dangers\nwe may dread, without incurring the imputation of groundless\ntimidity, lest the knowledge of morality may not keep pace with\nthe knowledge of the arts; lest our philosophy outstrip our virtue,\nand the principles of religion cease to be considered a necessary\nitem in education. We have reason to guard against the prevalence\nin a belief in all knowledge being good, and a disbelief in any\nknowledge being evil, we should scorn the fallacy that there is no\ndifference between denouncing the evil of knowledge and the\nknowledge of evil, it is the latter only that the Christian philosopher\nmay depurate; he knows that it is not unusual to transform bles-\nsings into curses, or to use the instruments of our civilization as\nweapons against ourselves. The same railway, which, by facilitat-\ning the intercommunion of nations, promotes knowledge and obliter-\nates prejudice, may, and often does, become the engine of wide-\nspread disaster. The stimulus of gain afforded by steam has led to a\nrecklessness of human life, to commercial profligacy, to public and\nprivate embarrassment. The same Press which can delight the\nreader with details of what he otherwise might never have heard,\nand can carry him in imagination into the universal world, which\ncan instruct while it pleases, and stands as a friend to the solitary and\na guide to all; that same engine for incalculable good, may poison\nthe mind with pestilential productions, it may, and often does, cater\nto the diseased appetite of a corrupt and sensual nature, it may\ndisseminate falsehood instead of truth, it may print the Bible to-day,\nit may pollute the innocent mind to-morrow. Alcohol so necessary\nto many sciences, who can recount the horrors of its abuse? Unless then the corrective influence of Christianity accompany the prodigious force of modern invention, unless the spirit of benevolence (and who can possess it so disinterestedly as the Christian?) keeps pace with our mechanical progress, unmixed evil may be the result; and the reason is obvious, it is not necessary to be a scientific man in order to profit by the results of science; the incendiary need not know experimentally the process by which the lucifer match is manufactured, nor need the poisoner, in order to accomplish his end, be able to detail the beautiful process by which the Chemist extracted the poison. We can, unfortunately, point attention to an illustration of the evil of knowledge when undirected by benevolence. The illustration is on a scale alarmingly grand—the semi-barbarous nation which is now encountering the two most scientific nations of the world, and convulsing Europe with alarm, is employing the arts of engineering and gunnery against the very people who brought these arts to perfection. British and French inventions are used by the Russian, himself too savage for invention, though too cunning, not to appropriate to his defence the discoveries and skill of others; who will say that the power which is the result of knowledge can be safely entrusted to half civilized myriads, whose inexhaustible numbers when furnished with the scientific material of war render them dangerous to the civilization of the world? Who will deny that it would have been better that the mathematical precision of artillery practice and scientific fortification had never been attained, than that through their instrumentality, a flood of northern barbarians should pour down on Constantinople, repeat the tragedy enacted by the Huns and Vandals, and quench the light of civilized Europe. May this illustration never be realized; but what is true of a nation is true though in a less degree of an individual, let it not then be deemed professional bias, when I assert, that knowledge to prove beneficent must progress beneath the sheltering wings of Christianity, and then need we not dread that abuse of the gifts of Providence which has ever led to woeful reaction; there is strong evidence for supposing that civilization had its origin in a direct revelation to mankind, and who can say how much it will be indebted to the Christian revelation for its progress and consummation?\n\nWhat an inducement then to education, science, and literary\neffort, is the certainty (produced by the diffusion of knowledge and by the Christian religion,) of being able to transmit to remote ages our thoughts and works; only realize in imagination, the ancient Philosopher dedicating his life to his loved pursuit, and toiling amid the disheartening prospect of his discoveries being misunderstood or lost in the convulsions of nations or the tyranny of prejudice, working in his laboratory or library with the melancholy pleasure of an enthusiast without sympathy, and then contrast with his position our (I had almost said) temptations to knowledge, when scarce a valuable idea can be suggested without its being seized on as a friend and perpetuated by the Printer. What an incitement again to the eager student is the immensity of the field still open for exploration in natural and moral science. The Philosopher alone can understand the littleness of his own attainments; it is the magnitude of every fresh discovery which fills his heart with wonder and humility, from a consciousness that he is but treading the threshold of the temple of science, while his intellect is overpowered by the bare conjecture of the majesty of what may remain in reserve for future discovery within the penetralia. This was the feeling which filled the mind of the great Newton, who could compare the extent of his noble investigations of natural laws, to the work of a child gathering pebbles on the shore. Strange as it may sound, the simplest facts in nature are still bewildering mysteries. Phenomena, which, from familiarity, we deem intelligible, when regarded philosophically fill us with astonishment. The cohesion of matter, what seems simpler, what, on examination, proves more wondrous! What are the invisible bonds that keep together the minute particles of any familiar substance? What is it that retains in its solidity the mass of our earth and prevents its pulverization and destruction? Again, we will it—and our arm is raised—a simple fact, but an inscrutable mystery; how a wish can operate instantaneously on the limbs of our bodies, how or where the soul tenants the body, how one body can communicate its motion to another, what is the process by which the minute drug destroys vital organization, how an infant grows, or a flower blossoms; of such facts, and we could multiply them indefinitely, our knowledge is summed up when we say that they occur, and the constancy of the occurrence makes us believe that we understand them; nay, the subjects with which we are most intimately connected are often the least known to us, what\nis the summum bonum of life, what are the laws which regulate\nthe ravages of disease; the theories of the winds and waves are\nmore intelligible to the man of science than the blight which\nbrings famine, or the contagion which spreads pestilence. It would\nseem as if Providence had permitted the human mind to triumph\nmost in those subjects which lie most distant from itself, lest man,\nbecoming as well known to himself as the other works of creation\nare, should say in his heart, there is no God; how else does it\nhappen that while subjects relating to life and happiness are com-\nparatively unknown, men, whose names we reverence, are\npermitted to pierce through the vault of heaven and make such\ndiscoveries of other worlds and systems as keep the mind in\nsuspense, whether it is more delighted with the unerring precision\nof man's demonstrations or overwhelmed with the majestic vastness\nof the universe. We naturally wonder and admire when we hear\nthat Leverier, by the result of pure mathematical reasoning, could\nwith certainty affirm, that a Planet, as yet unseen, would be dis-\ncovered in an assigned region of the heavens. The Telescope is\neagerly directed to the prescribed spot and the Planet is detected.\nWhat a perfection of science does it reveal, that Murchison was\nable to announce that in the Southern Hemisphere, in Australia,\nveins of gold must exist, though as yet not a particle had been\nfound. We can predict with the certainty of personal knowledge,\nthat when ages on ages have rolled by, the glorious southern cross\nwill again be visible in these northern latitudes. But why dwell on\nsuch intellectual grandeur? Man turns from such contemplations\nto himself and shrinks again into conscious nothingness; his success\nin the investigation of nature might intoxicate, but his failure in\nthe knowledge of self recalls him to sobriety. Yes, the field in\nwhich the mind can work is as infinite as the mind itself; any\nmoment may introduce us to some new discovery which may\nthrow all former triumphs into the shade; on every side is the\nmaterial open to experiment and observation, inviting every lover\nof nature and art to explore and wonder. It may, perhaps, appear\nparadoxical to urge the student of nature to perseverance, by\nreminding him that many of the most brilliant discoveries have, in\nevery age, been the result of accident, yet such is the case, and\neven here we can see the disposing hand of Providence, allowing\nman to achieve miracles in the acquisition of knowledge, yet under\nsuch circumstances, as must humble him. Were man permitted by\nthe innate force of his intellectual power, to reach by regular process of abstract reasoning, to those sublime discoveries which have so powerfully affected our welfare, he would be tempted to worship himself, not his Creator, his own mind rather than him who formed it. But a different arrangement has been providentially devised, both the time and manner of many inventions indicating that man is but the instrument through which the Deity reveals himself, and not an independent controller of nature. The discovery of the power of the Telescope to pierce the firmament, was like that of the glass of which it was composed, altogether casual. Galvani introduced us to the science of electricity, by an accidental application of zinc and silver to the muscles of a frog. We owe the wonders of the Magnetic Telegraph to the unexpected discovery of Oersted, that a galvanic current deflected a magnetic needle. Bradley established the prodigious velocity of light, while he was investigating a totally different phenomenon. Hargraves was indebted for his remarkable improvement in the spinning jenny, which so greatly influenced the commerce of England, to his child who upset the wheel at which he worked; the wheel continued to work the spindle in a vertical position, he seized on the idea, and prodigiously multiplied the power of the instrument. Had not Watt been employed as a workman to repair an atmospheric engine, we might still have been ignorant of the power of the steam engine. Had not an apple fallen at the precise time it did, at the feet of Newton, we might still be unacquainted with the law of gravitation. Of these and many other discoveries the origin was in a great measure accidental, not accidental in the sense of a blind chance, but in their being introduced into the world under circumstances which loudly proclaim the hand of a disposing power, man appropriating to his use phenomena, thrust, as it were, on his observation. The time again when these grand masterpieces of discovery were wrought, prove the same conclusion.\n\nWho is there who does not see something more than a happy coincidence in the fact that the facilities of working the coal mines of England were acquired at the precise time that the steam engine required them, when it would have been comparatively useless without them. The Mariner's Compass and Astrolabe were inventions so plainly preparatory to the discovery of America, that we cannot fail to see the providential design. Again, we can scarcely resist the inference, that the gold deposits of California\nand Australia were permitted to be discovered at the precise time when an overcrowded population in Britain and Eastern America required a field for their labor and industry; while the tide of emigration to the shores of the Pacific may be a stride of civilization, on its way to avail itself of the opening of Japan and the revolution of China.\n\nBut though the investigation is tempting, I must refrain from further illustration. The fact illustrated is, however, patent, that no ardent lover of science need be deterred from the pursuit of his favorite study, by the idea that it is the innate force of intellect which makes the most useful or wonderful discoveries. \"The works of God are great, sought out of all them that have pleasure therein.\" None should therefore so distrust their own powers as to abstain from philosophic inquiry, on the ground that to penetrate the recesses of nature requires the intellect of a Newton, or the erudition of a Bacon. Let only the love of the science add a zest to the examination of it, and we will be content to forego the claim of originality, when we begin to taste the pleasure of being able to sympathize with the knowledge, the happiness, and the ability of others. And here, perhaps, after all, is the true stimulant to knowledge, the pleasurable emotions ever derivable from its possession. There is in the very acquisition of new ideas, a feeling of delight to every well regulated mind; and as the ways and works of the Most High are investigated and acknowledged, we obtain a glimpse of what the mind is capable of knowing and enjoying, and we rejoice in the foretaste. Every page of history reveals its lesson and its pleasure to the honest student. The biography of individuals, too, as well as nations, ministers to our delight, when in perusing them we transfer ourselves in imagination to ages past, and become, in imagination and thought, the admiring disciples of the great and good. Yes, there is a refinement of happiness in mental cultivation which ennobles the soul, as much as ignorance and sensuality debase it; and there is hardly a reflection more fraught with seriousness than that of the multitudes, of young men especially, whom dissipation and folly are keeping in ignorance of the real nobility of their nature, and whom a taste for literature would have preserved from worldly misery, or even untimely death. Who can estimate the magnitude of the loss society sustains in the many intellects, which, had they been developed, would have increased the glorious company of philosophers and\nphilanthropists. How many an aspiring heart has been, through the want of encouragement and direction, condemned to an unhappy ignorance, when it might have throbbed happily in the investigation of truth, instead of being despised for its unavoidable debasement. How would the men whose wealth and station load them with responsibility, labor to elevate and cherish genius, could they only realize what is often strictly true, that there are multitudes whose capacity only requires to be called forth by education, in order to dazzle and delight the world. Nor am I now speaking of those cases in which, as the poet beautifully expresses it,\n\n\"Chill penury repressed their nobler rage,\nAnd froze the genial current of the soul?\"\n\nI am not now alluding to the children of poverty, many of whom had justice been done them by their fellow-men, would have embellished the world with their works; and who, had they been taught to read, would have themselves been read for profit and delight; but I refer to the number of young men whose situation is raised above that of want, and who are yet deterred from the paths of science and pleasure, literature and peace, by the chilling apathy with which such pursuits are regarded by the affluent and the influential. Mammon is so much of a deity, that whatever does not fall down and worship it, is unfashionable, and consequently shunned. What a reflection on the civilization of our day is it, that literary worth is so often associated with beggary! But let not the young candidate for knowledge be fainthearted, even though encouragement be withheld by the world of fashion; there is still some recompense in the elevation of mind, and dignity of feeling consequent on a dedication of our faculties to the knowledge of whatever is excellent and noble in the range of science. The inherent beauty of every work of nature, the brilliancy of every sunbeam, the tint of every cloud streak, the majesty of every mountain, the glory of every setting sun, the beneficence of all creation, the realization of almighty power and goodness in everything, will constrain the enthusiastic worshipper of God, seen through the medium of his works, to feel that in the estimation of reason there is no happiness comparable with the ability rightly to appreciate the wonders of the universe.\n\nLet me add, in conclusion, that besides the positive enjoyment of useful knowledge, there is a negative advantage derivable from it scarcely less important. The surprising activity of the human\nmind warns us that a wise selection of matter to employ that activity is indispensable, because employment it will have. Many a premature victim of dissipation would have been snatched from destruction, had he been imbued with virtuous resolution by a timely acquaintance with the writings of the good and the wise. Had the beauties of nature and art been duly presented to the reason and imagination in the vacant hour or the idle holiday, many a well disposed mind would have been preserved from ruin, and would have spent on happy reading or thoughtful study the hours which were squandered on idleness and sin. Men whom disaster and misfortune have reduced to phrenzy, would have been blessed with fortitude, had a knowledge of the facts of the Bible taught them the dignity of their nature. The human mind abhors a vacuum. How great, then, the responsibility to preoccupy with wisdom what must otherwise inevitably be possessed by folly; the soul will not remain a blank; it must be brightened with the knowledge of good, or darkened with the knowledge of evil.\n\nMake, then, the trial, ye candidates for knowledge, and see whether you do not possess in the capacity of your mind to grasp the beauty and excellence of knowledge, a source of pleasure at once exquisite and inexhaustible. Of all the satisfactions (apart from religious feeling) we are capable of enjoying, few can compare with the acquisition of knowledge in a favorite pursuit; nor, believe it, is there any antidote for the restlessness, ennui, or dissipation of life, like the devotion of those hours which duty can spare, to the obtaining of a glimpse, however feeble, of the majesty of glory which is spread before the eye in every work of nature in this world of ours.\nto employ that\nwill have. Many\nsnatched from\nresolution by a\nand the wise.\nto the reason\nholiday, many a\nruin, and would\nthe hours which\nfrom disaster and\nwe have been blessed\nthe Bible taught\nmind abhors a\npreoccupy with\nby folly; the\nattained with the\nage of evil.\n\nknowledge, and see\nyour mind to\nsource of pleasure\nsatisfactions (apart\nfew can com-\nfavorite pursuit, nor,\nennui, or dis-\nwhich duty can\nof the majesty\nwork of nature in\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_47059.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 38782, "total-output-tokens": 10604, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2701, 3], [2701, 5192, 4], [5192, 5473, 5], [5473, 6490, 6], [6490, 8312, 7], [8312, 10928, 8], [10928, 13530, 9], [13530, 16117, 10], [16117, 18682, 11], [18682, 21276, 12], [21276, 23784, 13], [23784, 26338, 14], [26338, 28970, 15], [28970, 31500, 16], [31500, 34083, 17], [34083, 36658, 18], [36658, 39220, 19], [39220, 41783, 20], [41783, 44297, 21], [44297, 46041, 22], [46041, 46480, 23], [46480, 46480, 24]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]