[{"id": "6cd0e2e41cbfad0cbcd577eb5154c0cddef37b29", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| 10X | 14X | 18X | 22X | 26X | 30X |\n|-----|-----|-----|-----|-----|-----|\n|     |     |     |     |     |     |\n\nThe following features affect the image reproduced here:\nThe pages are discoloured, stained or foxed/\nPages décolorées, tachetées ou piquées\n\nThe pages detached/\nPages détachées\n\nShowthrough/\nTransparence\n\nQuality of print varies/\nQualité inégale de l'impression\n\nIncludes supplementary material/\nComprend du matériel supplémentaire\n\nOnly edition available/\nSeule édition disponible\n\nPages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nLibrary of the Public Archives of Canada\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nTHE BATTLE RIVER VALLEY.\n\nA PAMPHLET\n\nDescribing the advantages of the country drained by the Battle and Saskatchewan Rivers as a field for settlement.\n\nBY\n\nWILLIAM LAURIE.\n\nBefore coming here I was told that Battleford was in the midst of a sterile, dreary waste of sand, but I wish we had a few hundred square miles of just such dreary wastes of sand in Ontario and Quebec.—Correspondence Toronto Globe.\n\n1863.\n\nBATTLEFORD:\nPRINTED BY P. G. LAURIE.\nINFORMATION BUREAU\n\nCARNEY, LAURIE & LAURIE\n\nBATTLEFORD,\n(SASKATCHEWAN TERRITORY).\n\nTIMBER AND COAL LIMITS LOCATED\n\nExploring will be a special feature of the business. Lands and locations examined and reported upon. Questions of all kinds answered by return mail.\n\nMONEY INVESTED.\n\nJOHN CARNEY, late of Sault Ste. Marie, Algoma;\nRICHARD C. LAURIE, Civil Engineer and Surveyor;\nWILLIAM LAURIE, Conveyancer and Notary Public.\nTHE BATTLE RIVER VALLEY,\n\nA PAMPHLET\n\nDescribing the advantages of the country drained by the Battle and Saskatchewan Rivers as a field for settlement,\n\nBY\n\nWILLIAM LAURIE.\n\nBefore coming here I was told that Battleford was in the midst of a sterile, dreary waste of sand, but I wish we had a few hundred square miles of just such dreary wastes of sand in Ontario and Quebec.—Correspondence Toronto Globe.\n\n1883.\n\nBATTLEFORD:\nPRINTED BY P. G. LAURIE.\nCONTENTS.\n\nIntroductory ........................................... 1\nThe North-West Generally ......................... 4\nOur Own Valley ..................................... 8\nGeographically .................................... 11\nHistorically ....................................... 14\nPhysically ......................................... 17\nWho should come .................................. 19\nWhat they should bring ........................... 21\nWhen to come ...................................... 26\nHow to come ....................................... 28\nWhat to do when here .............................. 35\nSoil .................................................. 38\nClimate ............................................... 43\nMiscellaneous ....................................... 47\nEagle Hills .......................................... 51\nTo the South-West .................................. 58\nThe North Side ...................................... 61\nTurtle River ......................................... 63\nUp the Battle River ................................. 64\nBattle River Barley ................................. 67\nProfessor Macoun's Views ......................... 69\nThe Globe's Special Correspondent ............. 73\nShorter opinions .................................... 76\nLocal opinions ..................................... 79\nSome of our records ............................... 81\nTables of Distances .................................. 85\nThe contents of the following pages first appeared in the form of a series of articles written specially for the SASKATCHEWAN HERALD, but their publication ran through so many issues, and extended over such a length of time—nearly five months—that the thought suggested itself that their effect and influence would be much increased by being reproduced in pamphlet form; and the idea has been acted upon. Since the inception of the undertaking, one purpose has been continually before the mind of the writer—to tell nothing but the truth of his own settlement, and nothing whatever to the disparagement of its rivals, thus abstaining from returning evil for evil. Should this the first edition be put into successful circulation, it will be speedily followed by another, in which there will appear much additional information which has been received too late to be available for this one, together with such further im-\nprovements as may suggest themselves in the meantime. The writer begs to tender his sincere thanks to Mr. George H. Harpur, of the Eagle Hills, Mr. John Carney, of Battleford, and the editor of THE HERALD for much valuable assistance rendered by them.\n\nBattleford, May, 1883.\nTHE BATTLE RIVER VALLEY.\n\nPURELY INTRODUCTORY.\n\nFifteen years ago a trip from Eastern Canada to Winnipeg was an undertaking to be thought of by few and to be attempted by an even smaller number, while venturesome indeed must he be who would even dream of penetrating farther into the wilds of the unsettled West. These trips, too, must be made only during the summer months, and it is but little more than ten years since a winter journey from Winnipeg to St. Paul was a perilous and foolhardy one. Time has changed all this, however. Since the spring of 1871, an ever-increasing influx of settlers from the older provinces and from the mother country, together with not a few from the neighboring republic, has pushed on civilization until the tread of the pioneer is now heard at the very base of the Rocky Mountains, while this year one small party of venturesome spirits have penetrated even to the valley of the Peace River. Of course, where a country was so little known, information from whatever source was eagerly sought after, and this demand has deluged the country with im-\nmigrants' guides and handbooks of every description, written, in many instances, by professional but uninformed book-makers, and in more by amateurs who essayed to be ranked as authors, and whose ideas of their own abilities far exceeded their actual mental calibre; while in ninety-nine cases out of every hundred the motive was not so much the dissemination of useful knowledge or the benefitting of their fellow-men, as the pockets of these self-styled philanthropists. In addition to this class, the increase in travelling facilities and the newness of the country as a field for the explorer, the sight-seer, and the invalid in search of health, has induced troops of tourists to visit the North-West, travelling through it as fast as the locomotive and the steamer, where available, and horseflesh could take them, and upon their return to \"civilization,\" their views have been reduced to writing and placed in book form upon the market. Men who would scarcely be able to tell a harrow from a horse-rake undertook to advise intending settlers \"where to go, how to go, and when to go.\" They told what they had seen and heard and a great deal that they had imagined, and added much more compiled from the writings of those who had gone before, concluding the whole with a string of advice to people desiring to settle, and every other variety of counsel likely to be required by a man who was thinking of penetrating the wilds of the New North-West. It must not be inferred\nthat all that has been written is set down as worthless, but mixed with the good grain there has been so much chaff and foreign matter of even less value than that intrinsically worthless stuff, that the public mind has become nauseated, and books of this kind are taken up but to be thrown aside without even a cursory perusal. Manitoba has become pretty well settled, even in the addition to its limits, which took so large a piece out of the Territories. Already many who went in there three or four years ago, almost literally in advance of settlement, are selling out and seeking for some place where they can have more elbow room. In the majority of cases, the great problem to be solved is \"Where shall we go?\" Upon one point all are agreed, and that is the general direction of the line of march. \"Out West\" is the cry of the thousands who are crowded out, but conflicting accounts of the various centres of settlement cause many to hesitate, and it is to help these to come to a decision that the writer has undertaken the task of ventilating the advantages of the Battle River Valley, not as a financial enterprise but in defence of a section of country which has been the subject of much misrepresentation. It has been said that \"Truth is mighty and will prevail,\" and the saying bids fair to prove true in regard to the Battle River Valley, for after years of libel and falsification, its merits as a grain-growing country are beginning to be understood and appreciated,\nand this section of the North-West is destined at no remote period to take the foremost place in the list of settlements in the Territories. And if these articles result in inducing even a few to come here who would otherwise have gone elsewhere, the writer's mission will have been fulfilled. A resident of the Valley himself, with all his interests centred there, his work cannot be classed with those of professional itinerant bookmakers, and may therefore be taken up and read with more confidence than the general run of pamphlets. Having spent over twelve years in the North-West, during the whole of which time he has fully identified himself with its interests, and having seen many of the rival sections for himself, the writer has been in an excellent position to learn their respective advantages and disadvantages. Being a pioneer himself he is able to advise others who are coming to the Great North-West now how to reduce the discomforts of pioneering to a minimum. It will also be his endeavor, while giving information that may be of use to the intending settler, so to divest it of the usual dryness of detail that it will be perused for its own sake.\n\nOF THE NORTH-WEST GENERALLY.\n\nSo much has been written and spoken of the Great North-West that it is perhaps needless to dwell at any considerable length upon it as a field for the farmer, the artisan, the manufacturer or the investor. Yet, as\nan introduction to the chapters which are to come after, a few general remarks may not be amiss. It is difficult to realize that in the Territories—the garden of our fair Dominion—there is waiting for the plough a section of country many times larger than the united areas of Great Britain and Ireland. Add to this pasture land capable of sustaining tens of thousands of cattle, hundreds of square miles of timber, inexhaustible beds of coal and other minerals, and yet the half is untold. Here we find a country capable of furnishing homes for millions, where at no distant day we are destined to see fields of golden grain awaiting the reaper, where but a few years ago roamed countless herds of buffalo—now, unfortunately, doomed to a speedy extinction through the reckless improvidence of those for whom they were intended to be a support and sustenance—and ere another twelvemonth has been added to our lives the wild shriek of the locomotive's whistle will resound over the boundless prairies, echoing back from the innermost recesses of the Rocky Mountains. There is nothing which the heart of man can desire that is not to be found in the Territories, and in such a liberal manner has Nature provided for the requirements of the future inhabitants of this great country that its resources must be seen to be realized. Each section is adapted for some kind of industry where men of energy and industry can carve out fortunes for themselves in less time than\ncould be thought of in the pent-up centres of the East. Skirting along the Valley of the North Saskatchewan from its source in the mountains throughout almost its entire length the lumberman's eyes are gladdened by the apparent endlessness of the forests of pine and spruce; underlying a section far exceeding in area the coal-fields of the east are beds of this useful article destined to keep the inhabitants of the treeless prairies in fuel for generations yet to come; the agriculturist has far to seek ere he finds richer or more productive soil than abounds here; nutritious pasturage of the most luxuriant growth affords sustenance for the myriad herds of the stock-raiser; iron mines await development; the beds of all our streams are rich in gold; while indisputable evidence is forthcoming of the existence in paying quantities of silver, tin and lead; salt springs innumerable produce a finer quality of this valuable mineral than any of the now well known centres; gypsum beds, tar and petroleum springs, and quarries of useful stone are scattered over the country; while in the Far North, as yet unpenetrated by civilization, the fur trade is still prosperous. These are things which are known to exist, and, when it is considered how long they remained undiscovered, it is but fair to assume that a few years more will reveal other treasures, equally valuable, still hidden from the knowledge of man. Rivers and lakes navigable by boats of the largest size and the comprehensive system\nof railways promised in the near future render every portion accessible. This, together with the assurance of a speedy completion of the interoceanic railway, foretells a future for this grand country which it will require a mind of the largest calibre to grasp to its fullest extent. In fact, when one endeavors to paint to himself the probable future of the North-West, his mind is almost dazed by the magnitude and grandeur of the picture conjured up before him. Where the red man has for generations been accustomed to roam at his own sweet will, eking out a miserable subsistence or gorging himself on the fat of the land, according to the temporary abundance or scarcity of game, towns and cities by the dozen will have sprung up ere the present rising generation will have grown grey. That this no idle surmise is proven by the experience of our neighbors to the south and also by that of the eastern portion of our own country; more especially since we have the advantage of possessing a larger territory with a greater proportion fit for cultivation, and that portion more fertile and productive. The results which have followed the opening up of a country such as is theirs cannot fail to be repeated in our own. But, as has already been stated, it is not the intention to enlarge upon the advantages of the whole of the North-West, but to call the attention of those in the east who are desirous of seeking out new homes and bettering their circumstances to a hitherto little known and\nmuch misrepresented section of North-Western Canada.\n\nOUR OWN VALLEY.\n\nFor many reasons that are hard to explain, and others that are quite apparent, this portion of the Territories has been the target for every variety of misrepresentation and falsification ever since it first set up any claims as an agricultural and stock-raising country, and it is in a great measure due to this fact that the writer has assumed the task of setting before the world the advantages of the Battle River Valley as a field for colonization. Rival settlements, jealous of the ever-growing popularity of this section, and thinking to improve their own prospects by belittling and libelling ours, have not scrupled to distort the truth, and even worse to invent deliberate falsehoods. It is not the intention of the writer to resort to any such method of benefiting the Battle River Valley, but each rival locality, though laboring under disadvantages which render it undesirable as a field for immigration, will be left to take care of itself, while this section, by a truthful, unexaggerated statement, will be placed before the public in its true light. It is a mistaken policy to resort to such manoeuvres as those complained of, and reminds one of the story of the barrister who found endorsed on a brief placed in his hands, \"No case; abuse the plaintiff's counsel\"; the inference being justifiable in the present instance. But\nthis is scarcely of sufficient interest to the intending settler, so the more pleasing task of writing of our own district will be taken up. The extent of the Battle River Valley is sufficiently large to permit of the formation of numerous large and prosperous settlements, affording scope for thousands of immigrants to whatever industry they may belong. All that has been spoken of the North-West generally is equally true of the Battle River Valley particularly. The farmer will find here soil certainly unsurpassed and seldom equalled in fertility and productivity throughout the entire length and breadth of the North-West. Here, too, the stock-raiser will find sheltered ranges for thousands of cattle, luxuriant with the richest pasturage the world affords, while within sufficiently easy distance can be found timber to supply lumber and fuel for generations. Nor are we dependent upon wood alone for our fuel supply, for the mighty Saskatchewan brings the inexhaustible coal supply of its valley to our very doors at trifling cost. The only town at present in existence in the valley of the Battle River is Battleford, situated near its confluence with the North Saskatchewan. Almost every one in the Dominion—at least, those who have ever read the papers, even casually—has heard of Battleford. With many the names Battleford and Battle River have been thought to be identical, and it is by playing upon this misapprehension that our detractors have scored so well in\nthe past, and Battleford sand has become a byword. It is true that the immediate site of the town is light, but that it is sandy is shown to be false by the excellence of the vegetables grown in the numerous gardens. The soil can only be called light when compared with a few other sections of the North-West, but where will the confluence of two streams be found in the entire prairie region where the soil is not, comparatively speaking, light? But because the land on which the town is built is light, it does not follow that the whole country is a sandy desert. Go two miles from the town in whatever direction you like and the soil is found to be heavier, until at a short distance away it will be found to vie in richness with any other part of the Territories. Add to the fertile soil the mildness of the winter and the total absence of summer frosts, and we have three advantages which make our section the most desirable for settlement in the North-West. Why the winters should be milder here than in any other part of the Territories the writer does not pretend to explain, but that such is the case is a fact as can be verified by an examination of the meteorological records. In 1879 Hon. J. W. Taylor, United States Consul at Winnipeg made a careful comparison of the weather records for the winter months at Battleford, Winnipeg and St. Paul, Minnesota, the result being that he found the mean average temperature of Battleford to be seven degrees higher than that of Winnipeg, and\nonly three degrees lower than that of St. Paul. The snowfall, too, is so light as to permit of stock wintering out in safety, and the fact that the effects of the Chinook winds are felt along the Valley even to Battleford, where, under its influence, the thermometer registered sixty-three degrees above zero on the evening of the tenth of January last, also strengthens us in this contention. The absence of summer frosts is, perhaps, one of the most important advantages possessed by the Battle River Valley, as there is no other settlement or section of the Territories that can lay claim to an equal immunity. As far back as meteorological records or the experience of our farmers go, there has never been an instance of the grain being caught by the frost. Experience has also shown that farming operations can be begun a week or two earlier in the spring than in any other section, and they can also be continued nearly a fortnight later in the fall, thus giving a much longer season than that enjoyed by any other district in the Territories. Occasion will be taken in a short time to go more fully into the question of the climat, when we trust to be able to give satisfactory reasons for the marked differences now briefly referred to.\n\nGEOGRAPHICALLY.\n\nPerhaps the first question the intending settler will ask about the Battle River Valley is, \"Where is it?\" and it will therefore\nbe one of the first to be answered at any considerable length. As may be inferred it is the name given to that section of country drained by the Battle River, a tributary of the North Saskatchewan, which takes its rise in the Battle Lakes, near the base of the Rocky Mountains. These lakes lie to the south of Edmonton, and on the height of land between the North Saskatchewan and Red Deer Rivers. The general course of the Battle River is easterly, its confluence with the Saskatchewan being almost due east of its source. The country drained by the Battle River lies almost entirely between the fifty-second and fifty-third parallels of latitude, and extends from a point about midway between the third and fourth principal meridians to a short distance beyond the one hundred and fourteenth or fifth principal meridian. The land on the upper part of the valley of the river is very rich, partaking of the same general features as the rest of the country along the slope of the Rocky Mountains. As the river is followed down its course the soil becomes a trifle lighter, until along the lower portion it assumes a character, the happy medium between a rank vegetable mould and a light soil, which so perfectly adapts it for the raising of cereals with certain immunity from frosts. Away to the south of the river, and extending beyond the forty-ninth parallel, lies a vast tract of country heretofore known as \"The Bad Lands,\" but which are now found to be admirably adapted for grazing pur-\nposes; while skirting the Battle River on both sides, and stretching northward across the Saskatchewan until the southern limit of the true forest is reached, is a section certainly unexcelled for fertility and productivity throughout the entire length and breadth of the North-West. Although these sketches are collected under the heading of the Battle River Valley, it is not intended to be inferred that it is only on the banks of that stream that good lands are to be found. The circumjacent country, of course, possesses the same general features and advantages as the centre of the district, but as yet settlement is concentrated within its limits. However, as immigration progresses, settlement will radiate until the whole section is brought under the hand of the tiller of the soil. As yet the only attempts at settlement have been made in the vicinity of Battleford, a bustling village situate within two miles of the confluence of the Battle and Saskatchewan Rivers. The town itself is a thriving place of several hundred inhabitants, until recently the seat of Territorial Government, and even yet the headquarters of a troop of Mounted Police, and of a number of officials of the Government. A number of stores, besides a telegraph office, a printing office, a blacksmith, a cabinet-maker, several builders, hotels, and the like go to make up the nucleus of a prosperous town. The site was chosen, not on account of the fertility of the soil, but because of its admirable suitability for the\nlocation of a town. The valley, from east to west, is about three hundred and fifty miles in length, and varies in width from twenty to sixty miles. The banks are, throughout almost its entire length, clothed with timber suitable for building, fencing and fuel; while numerous \"spring\" creeks which join the river along its course ensure an ample supply of good water. The river preserves an almost uniform width and depth, and there is no doubt that careful experiment will prove it to be navigable for small steamers of light draft.\n\nHISTORICALLY.\n\nFifteen years ago there was no settlement in the Battle River Valley, and until comparatively recently no attempt was made to settle upon the rich lands which fringe that river. Travel between the east and the west was, almost entirely if not altogether, done on the north side of the Saskatchewan, owing to the warlike attitude of the Indians on the plains to the south of that river in the early days. Indeed, the country south of the Saskatchewan was looked upon as the Indians' battle-ground, and as such was avoided. Pressing indeed must be the requirements of him who took a flying trip across the region of Indian wars. As a natural consequence the beauties and advantages of this section were entirely unknown. In 1874, the engineers of the Canadian Pacific Railway passed through the Saskatchewan Valley, crossing the Battle River about two\nmiles above its mouth, and shortly afterwards the contractor for the construction of the telegraph line sent through large parties of men to carry on the work he had undertaken. Struck with the beauty of the place, the crossing of the Battle River was chosen as the contractor's headquarters, under the true Western appellation of Telegraph Flat. Next came the selection of the crossing as the seat of government for the North-West Territories, on account of its central situation, and the name was changed to the appropriate and more euphonious one of Battleford. In due course the men in the employ of the Department of Public Works appeared upon the scene, and proceeded with the erection of buildings for the accommodation of the officials of the North-West Government. A troop of Mounted Police were stationed here, and barracks erected. These public works, employing as they did large numbers of men, naturally attracted several traders, and speedily the nucleus of a small town was formed. No sooner was Battleford proclaimed the capital of the North-West Territories than a hue and cry was raised by its disappointed rivals, and the whole of the surrounding country was denounced as an unproductive, barren wilderness, one writer wittily affirming that the soil was so light that it became necessary for the farmers to pin their fields to keep them from blowing away. So persistent was this system of detraction that it had the effect of deterring\nmany from coming here. The public works being completed, some of the employees, appreciating the country at its true worth, and with commendable pluck, determined upon making the experiment of cultivating the soil. As they had foreseen, success crowned their efforts, and others were encouraged to follow their example. One by one, settlers continued to drop in, but even at so late a date as 1878 they did not number half-a-dozen. In the summer of that year a newspaper—the Saskatchewan Herald—was established at Battleford by Mr. P. G. Laurie, one of the pioneer newspaper men of Canada, and it is worthy of note that he came here without the inducement of a bonus, and with but one acquaintance in the entire settlement. A residence of many years in the North-West enabled this enterprising printer to thoroughly understand the requirements of the country; and, estimating correctly the future in store, he bent himself assiduously to his task. Keeping always the general interests of the Territories in view, he industriously disseminated information concerning this locality, and refuted the slanders and imputations of rival settlements. At last, after years of unceasing devotion to his self-imposed duty, he is beginning to see the fruits of his exertions, and last season saw the advent of the advance-guard of the tide of immigration, which is now flowing this way. The files of the Saskatchewan Herald would, of themselves, furnish an excellent guide to the\nPHYSICALLY.\n\nThe prairie country, as properly understood, has many distinct phases in its physical aspect, and the several forms that successively present themselves to the traveller are not confined to isolated sections, but occur at intervals more or less regular throughout the entire North-West. The words \"prairie\" and \"plain\" must not be understood as implying an absolutely level stretch of country; for, although its general aspect may be level, it is in reality more or less rolling. Taking our own section as an example, we find to the north a grand expanse of country, representing what would be called a plain, as it extends for many miles unbroken by any eminence that deserves to be called a hill; but it is undulating, its surface broken with numerous bluffs, with heavier bodies of timber on the ravines and watercourses that drain its surface, and on the banks of the Saskatchewan.\n\nExtending westward between the Saskatchewan and Battle Rivers is a similar tract of country; while stretching away to the south is another form of prairie—at first interspersed with bluffs of timber and crossed by living streams, and gradually running into the rolling, treeless plain, watered only by lakes.\n\nThe valley of the Battle River proper presents the same characteristics throughout.\nFor almost its entire length the river has well defined banks. At some places they rise abruptly from the water's edge, while at others they form flats or level bottom lands, gradually rising until the level of the tableland is gained. It rarely happens that a flat is found on opposite sides of the river, plain on side and high banks on the other being the rule. At intervals broad valleys open up from the banks of the river, running far inland, and generally with a living stream at the bottom. These open into others, similar in character though less in extent, but still large enough to afford room for extensive farms on either slope; and these again branch off into other smaller valleys, and so on until the general plain or tableland is reached.\n\nThe land in these valleys varies from sand and light to a heavy loam on a clay subsoil. There is more wood in this valley than may usually be found in prairie countries. It is chiefly poplar, with here and there patches of birch and some spruce. The poplar grows to a great size, and makes good building material. When cut into boards and seasoned it serves many purposes as well as have been the spruce and pine of the country, and for hard floors and finishing is preferred by many.\n\nVegetation is most luxuriant in the smaller valleys, extending to the summit of the other sides, affording the most nutritious pastureage, and bearing evidence to the richness of the soil. Water is everywhere abundant, having springs, ponds or creeks. Wood fine needles\nWHO SHOULD COME.\n\nbuilding, fuel or fencing is easily procurable; and it is well known that there is abundance of coal within easy distance of the river, and will in all probability be opened up at an early day.\n\nWHO SHOULD COME HERE.\n\nThe question embodied in the foregoing heading is perhaps one of the most difficult to answer to the satisfaction of the intending immigrant. There are very few men who will admit that they are not adapted by nature to undergo the trials and privations common to a life of pioneering; and yet how true it is that not one in ten is so fitted. A particular locality suddenly becomes popular as a field for settlement, and the tide of immigration sets in with a rush, and in the crowd are many who push headlong without pausing to think what they may be called upon to endure. Be the descriptions of the country and its advantages never so carefully worded, they have their hastily formed ideas of what they will find it to be, and at the first disappointment the conclusion is as hastily formed that they have been the victims of misrepresentation and fraud, and where formerly everything was viewed through glasses of rosy hue, now nothing but fault is to be found. The other extreme is rushed to, and the papers are flooded with letters of denunciation of the country, of the people, and of all who have a word to say in its defence. It is needless to say that this class of immigrants\nis not sought after for this part of the North-West. What we want is a class of men—and women, too—who are not only willing to submit to the inconveniences of a settler's life without grumbling, but will also contribute their share towards developing its resources—a course which will speedily be followed by all the comforts and advantages found in older settlements. We want men who are not afraid of hard work, for there is plenty of hard work, but it has its reward, which is sure, and speedy in its coming about. The men who have already pitched upon the Battle River Valley as a home for themselves and their families, have been men possessing these characteristics, and to-day witnesses them enjoying the fruits of their labors. As it has been with them, so will it be with all. Should any one make a failure, before he commences to curse the country, let him sit down calmly and see if he has not been to blame in the matter. Whether he be an agriculturist, a stock-raiser or a mechanic, there is room here, and there is money to be made; but at present it is essentially the country of the farmer and the herder, although the artisan's day is certainly and speedily coming. We would like to see the men who come fairly supplied with funds, for a little capital is an excellent lubricator for the wheels of life, especially in the North-West. It is true that men have started and done well with little or none, but those men have possessed in a marked degree the characteristics point-\ned out previously—a willingness to submit to privations and to look on the bright side of everything, and a determination to succeed. Men who have not the means to start out in life on their own account, but who are willing to work to acquire those means, form, however, a class which it is most desirable to have amongst us. There has always been an excellent market here for labor, and men have never been without work against their will; and with the influx of settlement, which is now an assured fact, the demand is certain to increase. As settlement progresses, towns will spring up, the various industries be established, and a field opened for those who prefer the town to the country, but in the meantime let the farmer and the farm-laborer come, and let them come early so as to secure a wider range of country from which to choose out homes for themselves and families.\n\nWHAT THEY SHOULD BRING.\n\n\"What should I bring with me?\" is a question certain to be asked by every intending immigrant, who does not wish to rush blindfold into a new country, whose requirements may be very different from those of his old home. It is a question that may be answered in many different ways, but an article published in the Edmonton Bulletin during the past summer, under the caption of \"Advice,\" fits the case of Battleford so perfectly that we cannot do bet-\nter than to reproduce a portion of it as an-\nswer to the question propounded above.\nThe requirements of the agricultural por-\ntions of the Territories are so similar that\nwhat is written of one section is very nearly\nif not perfectly applicable to another. The\narticle in question says:\n\n\"The intending settler must go according\nto his means and intentions in outfitting\nhimself in Winnipeg, after having procured\nthe necessary travelling outfit and supplies\nfor the journey, but great care must be taken\nthat transport is provided for every pound\nthat is to be taken. Every eight or ten hun-\ndred pounds requires an ox, cart, cover and\nharness, costing on an average $100 a rig.\nIf the settler has the means it is better for\nhim to purchase in Winnipeg all the ma-\nchinery, implements, and household fix-\ntures he requires for immediate use, as well\nas a year's supply of groceries and a little\nchoice seed grain, and bring it through him-\nself.\n\nThey can generally all be pur-\nchased here, but the prices are very high,\nand come hard on a person who has to buy\neverything he needs and has nothing to sell.\nEspecially if the settler is able to bring a\ncooking stove he should bring it with him.\nFurniture is very dear here but at the same\ntime it is not advisable to bring any unless\nit is of extra quality. It costs ten* cents a\npound freight, and the ten cents can be bet-\nter applied in freighting prime necessaries\nsuch as groceries or implements. Furniture\nof the box, bench, stool, and shelf variety\nwill answer very well in this country for a\nfew years yet, especially if a person's means\n\n*This is of course the rate to Edmonton,\nbut the idea is an excellent one. Freight\nfrom Qu'Appelle to Battleford ranges from\nfour to six cents, but when the trail from\nSwift Current Creek is opened, it will be be-\ntween two and four cents.\nare limited. The cooking stove can also be dispensed with, especially by bachelors, as wood is plentiful.\n\n\"The smallest and cheapest complete farming outfit possible is two oxen and carts, or if possible a waggon, harness for the oxen, a breaking plough; set of harrows, iron are the best; a scythe, axe, hoe, rake, shovel and grain cradle. These, with the kit of tools necessary on the trip, a few pounds of nails, and either provisions for a year or money to purchase them with, and money enough to purchase seed in the spring, is a much better start than nine-tenths of the settlers here had. Nearly all of them have been under the necessity of working away from their places about half their time in order to earn money to purchase these few things with, and yet they are succeeding. But to succeed under such circumstances requires a large amount of gumption, grit and energy, and unless a settler has a considerable quantity of these commodities on hand he had better never start for Edmonton. If any considerable number of cattle are brought a mowing machine and sulky rake should be included in the outfit, as they save a great deal of time as well as labor.\n\n\"A small stock of simple medicines should be taken for use on the trip. Persons are very little liable to sickness while travelling, but a little sticking plaster, salve, yellow oil and painkiller should be taken in case of accident. A good supply of coarse, warm clothing and blankets should also be taken, as damp, chilly weather is liable to be encountered even in midsummer, and the nights are almost always cool, while in the fall they are very cold. Damp or cool weather on the bare prairie with perhaps very little wood is very different from what it is in a warm house with a good fire. Horses and cattle are peculiarly liable to some diseases while travelling and too much care cannot be taken of them. Carbolic acid, blue stone, and castile soap should be taken for use in the foot disease,\"\nborax to cleanse the mouth with, linseed oil for use as physic, corn starch to stop scouring, yellow oil for sore shoulders and other swellings, pine tar for cuts or raw places, sulphur for use in cases of mange, and black tobacco to destroy parasitic vermin.\"\n\nThese remarks apply principally to the settler's outfit which he will require after his arrival and location on claim. The intending settler will see at a glance that while a very large capital is not indispensable, still a moderate sum of money would be very advantageous, inasmuch as it would enable the newcomer to begin farming at once on such a scale as to make it pay from the outset. If you have a family as well as capital bring it along. A woman in the house goes a long way towards reconciling one to the loss of the comforts and pleasures of city life. Her presence makes even a log shanty seem like home, and then as an internal economist she is the superior of the average man. You will not need your piano for a year or two at least, and perhaps by that time you may have a place to put it. If you have a fancy buggy, sell it, but if you must have a lighter rig than a waggon, put a part of the proceeds into a buckboard and the balance into your pocket. The buckboard will be found to be more useful and durable than a buggy, and the difference in price will come in handy some time. For the trip up, if you come overland, some articles will have to be provided, but another extract from the Bulletin will cover the\nWHAT TO BRING.\n\nAnother article includes the following paragraphs:\n\n\"A tent is necessary and also a camp stove if there are women and children. A large tent is as easy to pitch as a small one, very little heavier to haul, and much more comfortable. The stove is necessary during wet or stormy weather in summer, and in the cold mornings and evenings of the fall, and in these circumstances makes all the difference between solid comfort and solid misery.\n\n\"The supply of provisions should consist of flour, bacon, ham, hard tack or biscuit, butter, syrup, tea and sugar. A full grown man will require about fifty pounds of flour a month and twenty-five or thirty pounds of bacon or ham. The proper quantities of the other things cannot be properly defined. The biscuit need only be used when it is unhandy to make a fire, and a ham should be kept boiled for use on similar occasions. The butter should be carried in a stone jar if possible, and kept in the shade. Small tin cans should be used in which to keep the syrup, tea and sugar required for immediate use. Other articles of food, such as canned meats and fruit, are too expensive for the ordinary immigrant, and besides travel and pure air will make the staple articles of food taste as good on the trip, if properly cooked, as the most delicate dishes do on ordinary occasions.\"\n\nThe person following these instructions carefully will find the overland journey, although slow, a not unpleasant one. The advice is sound, the writer being an experienced prairie traveller, who knows whereof he speaks. The above extracts cover the ground pretty fully, and when taken in connection with the one given below, little, if indeed anything, remains to be said. The SASKATCHEWAN HERALD of December 30,\n1878, under the heading \"Answers to Different Inquirers,\" contains the following useful points of information:\n\n\"If you have really good stock of any kind, from poultry up to thoroughbred family horses, bring it along. It will be found profitable to have 'the best' of everything, whether it is intended for sale or for home use alone.\n\n\"As to the outfit necessary, that is in great measure a matter of taste—as to provisions, it is so altogether, for what would seem to one to be a scant allowance, would by another be pronounced wasteful extravagance. A consultation with your grocer will set that all right. From pork and pemmican to 'all the delicacies of the season' can be had at Winnipeg.\n\n\"But to those who bring their own caravans some things are indispensable for comfortable travel, and to repair accidents that may happen. The first of these is a good axe, also a spade, hammer, nails (different sizes), both wrought and cut, some large tacks, a draw-knife, some small carriage bolts, etc. To repair cart wheels, a three-quarter inch mortising chisel, a brace, and at least two in the same three bits; a small cask to carry water, an ample tent, a pocket filter or strainer; some copper rivets to mend harness; spare axles and spokes, a supply of axle grease, ropes, etc. The size of the tent and the supply of cooking utensils must be determined by the size and taste of the party.\"\n\nWHEN TO COME.\n\nThis is a question which requires two or three different answers to suit the intentions and particular circumstances of the immigrant. One will do for the person who has already made up his mind that he will remain here, and comes prepared to settle on a homestead at once, while an entirely\nanswers to different answer is called for by the requiring useful plants of the prospector. Again, with the settler, much depends upon the amount of stock of capital he can control, and whether he has a thorough family or not. If he have sufficient capital be found paid to pay running expenses, he cannot do everything but to come in about midsummer, when he will then have abundance of time to select a location, cut hay for winter use, do what would be fall ploughing and build a house before winter sets in. As this work, however, is not immediately productive, it becomes necessary to be in a position to hold over season's crops until the harvest next season. One whose own means are more limited will find it advantageous to come very early in the spring, so that some breaking can be done, and a small sowing put in upon the sod, which will produce large tacks, and returns for his labor from the very outset. The prospector should come as early as possible, so as to give him plenty of time to make a thorough examination of the country and choose a suitable location. By coming after the snow has disappeared he will be in a position to obtain an intelligent idea of the soil, the location of hay-swamps and sloughs, the water supply, and other advantages and disadvantages which cannot be seen during the winter.\n\nHaving the summer before him, his experiences of the particular locality, but the whole district that he will undergo a thorough examination. Then should he be able to find a location which meets his views, he is in a position to pro-\nceed at once to make his improvements; and he prepare for farming in earnest during the next season. Experience teaches that June and July are the best months for breaking while hay-making commences about the middle of July, and these are two of the most important duties of the new settler during his first season. If necessary he can by rail live in a tent while engaged in these tasks, as after having there is ample time to build houses and stables and make them comfortable before the approach of winter. It is scarcely advisable for any person who has had no experience in prairie travelling to attempt to come here during the winter months, unless under the guidance of someone who understands it. Even if all the dangers were avoided and no accident happened, so much discomfort would follow the ignorance of winter travel and the country through which their road lay, that it would be better to defer the journey until spring, unless, as already stated, under the leadership of an experienced person.\n\nHOW TO COME.\n\nThe immigrant, having made up his mind to settle in the Battle River Valley, and fixed the time for going there, will naturally ask next, \"How shall I go?\" As in the case of the former question, there are two or three answers to this one. In this case, however, more depends upon the time chosen for the journey than upon any other contingency. Three routes are open to him,\nments; and he must decide for himself which is best suited to the circumstances of his case.\n\nThese routes are—first, by boat or rail from Winnipeg to Selkirk, thence by boat across Lake Winnipeg and up the North Saskatchewan to Battleford, whence he can strike any direction he may desire; second, by rail to Troy (Qu'Appelle Station) on the Canadian Pacific Railway, thence overland about three hundred miles, via Qu'Appelle, Touchwood Hills, and Clarke's Crossing of the South Branch; and third, by rail to Swift Current, thence overland, two hundred and twenty-five miles. A fourth route is spoken of at the time of writing, which, if carried out, will also be an advantageous one to take under consideration. It is proposed to put a line of steamers on the South Branch to run from Swift Current Creek down the river. In the event of this project being carried out, the journey could be made from Swift Current Creek by boat to Clarke's Crossing, which is distant eighty-five miles from Battleford, from which point it would not be difficult to travel overland. Those who do not intend to farm or who have very little stock would find it most convenient to come themselves and bring their goods by steamer, but those who have stock must necessarily come by road. Should it be decided to come overland, it now remains to choose one of the two routes from the Canadian Pacific Railway. That from Troy to Battleford is the one which was in general use during the past summer,\nbefore the track had reached Swift Current Creek, and strikes into the old established trail from Winnipeg to Battleford at Touchwood Hills, sixty miles from Troy. But Swift Current is the point on the Canadian Pacific Railway which is nearest to Battleford, and is only about twenty miles from the South Branch, at which point a ferry is to be established early this season. Arrangements are already being made with men who know the country thoroughly to open a direct trail between these points, immediately after the disappearance of the snow. The South Branch will be the only stream to cross on the route besides Eagle Creek, while on the other trail there is also the Qu'Appelle to cross, in addition to numerous sloughs through the Touchwood Hills, and the much dreaded alkaline ponds in the Big Salt Plain. On the whole, then, the advantages are decidedly in favor of the road by way of Swift Current. Should, however, the cars be left at Troy, the trail can be followed to the \"fingerboard\" in the Salt Plain, which will point out the road to Clarke's Crossing, or the main trail may be followed to Humboldt, forty miles farther, where another fingerboard indicates the way to Clarke's. The traveller may also come by way of Duck Lake on the same trail, but this will add over fifty miles to the road with no compensating advantage. The SASKATCHEWAN HERALD of Dec. 30, 1878, contains some sound advice, which it may not come amiss to repeat. It says:\n\"Come as early in the season as you can—so as to take the road as soon as the grass has started. The cheapest way for those who come to stay is to buy their horses and carts or cattle, according to their taste, in Winnipeg, and lay in their supplies there. Everything necessary for the outfitting of a party can be obtained in Winnipeg cheaper than it can be brought in from the States or the Eastern Provinces.\n\n\"If you bring a span of horses and a good waggon, the probability is that no repairs will be needed. If you decide to buy carts and drive your own animals, two courses are open, the choice of which must be determined by the strength of the party. These are, either to hire a man who knows the road and understands travelling on the plains, and place the charge of the train entirely in his hands, as far as pitching and moving camp are concerned; or, if the party is numerous enough to manage its own stock, to agree with the leader of some regular train to travel in his company. Strangers who undertake to travel alone will find many difficulties apparently insurmountable, which, under the direction of a competent guide, will disappear as if by magic. You will have to do all your own work, of course, unless you otherwise arrange, and just follow the example of your leader—travel when he travels, and stop when he stops. Never mind if he does sometimes appear to be losing time by making short \"spells,\" as they call the trip between camps; he knows where wood and water are to be had, and what he must do each day to be certain of getting to suitable camping grounds for the night. The chances are that if you go to travel independently you will lose time by making injudicious stoppages.\n\n\"The advantage of coming early is that it will enable you to get in some crop the first year. Potatoes, oats and turnips do very fairly on the sod. It will always pay the expense of breaking, fencing, etc., and provide enough provisions for the ensuing year.\"\nYou can also put up hay for your stock, and build a house before the approach of winter.\n\n\"It is of the utmost importance to see that everything is trim and in good order before starting on the trip. It is suicidal to take the road 'guessing' that all is right, or that you will have time on the road to do work that should be done before you start. Every day will bring its own work, and if by chance you have spare time in camp, rest yourself or take a stroll a few miles off the trail.\n\n\"Above all, don't suppose for a moment that because you come from an old-settled country you know more about prairie travelling than those who have spent a lifetime at it. You will as a rule find the freighters on the plains courteous and accommodating, and willing to divide with you the last of anything they have, or to help you out of any difficulty you may get into.\"\n\nThe articles already quoted from the Edmonton Bulletin also contain some advice on this head which is worthy of the deepest consideration. Read what an experienced prairie traveller has to say to the newcomer concerning the trip:\n\n\"Parties with women and children should arrange to be here by the first of October, as the nights are very cold after that time, and every one should be in by the first of November at latest, as even if there is no snow after that time the feed is dried up so that the cattle do not thrive, there is ice in the creeks in the mornings, and the ground is frozen and rough so that the feet of the cattle become worn quickly.\n\n\"Cattle and horses of all kinds and sheep can be driven through with very little risk. Oxen are preferable to horses for hauling freight. A $75 ox will haul more than a horse of the same price, and will get to his journey's end as soon and in better condition if used rightly. To a poor man just starting on a farm oxen are preferable to horses, and coal...\"\nHORSES, as they will do more work on less\nand coarser feed, and when fat they can al-\nmost always killed at a profit. Native po-\nlies are good on the trip if not overloaded,\nand early in the spring when the feed is\npoor, or late in the fall when the frozen road\nstarts the oxen's feet, are safer than oxen,\nbut are of very little account to the farmer\nwhen he gets through except for light work.\nCanadian horses can be brought through if\ngood care is used, but should only be loaded\nlightly if at all, as the lack of grain, the\nstrange kind of grass, the flies and mosqui-\ntoes, and the mud holes do not agree with\nthem. They start out well and seem able to\ndiscount either oxen or ponies—as they\nwould if supplied with grain—but soon\nweaken and get sick, and frequently never\nrecover. A little grain should be brought\nalong to give them when weak and bran to\ngive them medicine in. They are worth\nnursing, for when they get here they do\nwell and are the most useful animal a farm-\ner can have. They are a luxury, however,\nthat only those who are pretty well fixed\nshould indulge in.\n\n\"If possible two wagons should be\nbrought, so that the teams could assist each\nother in pulling out of bad places, but if\nonly one is brought it should be loaded\nlightly, as the roads are very soft in wet\nseasons. Fourteen to sixteen hundred is a\nfair load for a moderate yoke of cattle in a\nwagon, but if there are two wagons the\nloads may be increased considerably. The\nyoke should not be used unless in doubling.\nIt is not as good as the harness at any time,\nbut is handier then. Oxen will haul more\nin the harness and do it easier than in the\nyoke. They can be broken so as to work in\neither. Carts are better than wagons for\nsimply hauling freight especially in wet\nseasons, as the wheels are larger and the\nload is closer to the animal. One man can\nattend to two wagons or four carts with all\nease. Carts are much more liable to upset\nthan wagons and also more liable to break.\ndown, especially if of the ordinary Red River variety. Spare axles, hoop iron, nails, saw, hammer, gouge, half-inch chisel, brace and bit, half-inch, five-eighths and inch bits, a draw knife and a hatchet should be brought, with which to repair them when damaged. Cattle loads range all the way from seven to eleven hundred pounds; according to the ability of the animal used, but a good average load for oxen on an ordinary road, is from eight to nine hundred.\"\n\nAnd in another article on the same subject he says:\n\n\"If the feet of the oxen taken are not good at the start, or if they are likely to be on the road after the frost comes, some thick shoeing copper, cold chisel, shoeing hammer, pair of shoeing pincers, gimlet bit, punch, and some small horse nails should be taken in order to shoe them should they require it. Generally only the outside halves of the front feet need shoes, as they have to stand the greatest wear. Each shoe requires three nails, and no nail must be driven near the point of the hoof. Ponies seldom require anything done to their feet as they are district very hard. If Canadian horses are worked they must be kept shod if the roads are all dry.\n\n\"If the loads are not very light it is well to have an extra animal or two along. Riders, day or two of rest when an animal is sick or injured will sometimes save its life, and there is a spare animal along it can have the rest without delaying the party.\n\n\"In starting out great care should be taken to have all perishable articles put up strongly and well protected from the weather. Every package should be examined to see that it is all right, and cart covers should be made large of the best 8 oz. duck and kept securely fastened, as it is too late to begin fastening them down when the rain is on. Especially should they be made snugly every night.\"\nWHAT TO DO WHEN HERE.\n\nWe will now suppose our immigrant to have arrived here, and to be ready to seek a location for himself. The first thing to do, if he has brought his family with him, is to choose a suitable camping place and make things comfortable for them, while he is engaged in selecting a farm.\n\nIf he is not good at the country for himself, or better, he may be on the way, after consultation with some of those who have preceded him, engage some one to accompany him and point out those sections best suited to his taste, for there can be no doubt that there are many places in this district to meet the wants of any one, let him be never so fastidious.\n\nHaving selected his claim, the next step to take is to ascertain its limits. This is easy as they are not yet been subdivided, but some base lines have been run, and outlines of roads are even now taking the field; and will be followed very shortly by sub-dividers. Should he pitch upon a piece of land which is already surveyed there is no immediate necessity of anything further being done, as the lines laid down by the surveyors will be a sufficient guide to him to guarantee his improvements falling upon the wet. He should be careful to begin to define the desired quarter-section, unless he should wish to go very extensively into improvements, when it would perhaps be as well to have the remainder of his boundaries accurately defined. But should the sub-dividers not have been over the neighborhood of his\nlocation, it behooves him, before making any valuable improvements, to employ a surveyor to fix his lines, as it would be embarrassing, to say the least, to find his township corner or even a section post in the middle of his grain field. To do this will not cost much, as the surveyor will run the lines, the settler supplying the help actually merely charging for his time. The baselines afford starting points, and the boundaries can be located as definitely as the settlers themselves can do them. Someone quite people prefer to run their own lines with a general pocket compass, but they will find it will pay them better in the end to have an instrumental survey made by a practical and experienced surveyor. His boundaries once located, the immigrant is in a position to proceed with his improvements. The nature of his first work in this direction must be governed by the season of the year, and may other circumstances surrounding the case. If in the spring he can break and sow, if in school June he can break for the next season, or much later he can cut his hay and get out house and timber and fence rails. In short, it will be seen that at whatever season of the year he may settle, there is ample and suitable work possible to keep him employed.\n\nThe land in this district being still unsurveyed, there is no land office established, and no means afforded of entering up homesteads, but claims can be held by actual residence and cultivation, and the settler in advance of surveys is granted three months' options\ngrace after the completion of survey and\nthe placing of the land upon market to com-\nplete his entry. The subdividing surveyor\nis authorized and empowered to take the\ndeclarations of all persons whom he may\nfind in occupation at the time of survey,\nwhich declarations set forth the duration of\nactual residence and the extent of land cul-\ntivated. The land act provides for cases\nwhere the improvements of two or more\nsettlers are found to fall within the limits of\nthem. Some quarter-section, but these instances are\ngenerally if not always attended with more\nill-feeling between the contending\nparties, all of which might have been avoid-\ned by practical advice, as previously recommended, by the out-\nstanding boundaries one day of the small amount required to have\nposition to the lines accurately and properly defined.\nMeasures are also provided for the protec-\ntion of settlers in advance of survey who\nmay be found to be upon odd-numbered\nsections, or Hudson's Bay Company or\nschool lands, but it is indispensable that\nseason, or such lands should have been settled upon\nhouse in good faith and previous to survey. It\nwill be needless to go into the details of the land\nregulations in the limited space at our dis-\nposal, as they have already become so wide-\nly known and thoroughly understood by\ncontinuous advertising and prolonged dis-\nussion in the press. Suffice it to say, how-\never, that the absence of survey need be no\nhindrance to the incoming settler, as the\nprovisions of the land act and the regula-\ntions are such as to guarantee him in the\npossession of his holdings. A good motto for the prospector to keep in view is the homely old saying, \"First come, first served,\" and if any postpone coming until the choicest of the lands are settled upon, they need only blame themselves.\n\nSOIL.\n\nIt is against the soil of the Battle River Valley that its detractors have mainly directed their artillery, and for this reason among others, more than ordinary attention will be paid to it. It has already been mentioned that the town of Battleford is situated on the Battle River a very short distance above its confluence with the North Saskatchewan; and in its immediate locality, as at every junction of two streams in the entire prairie region, the soil is lighter than that of the surrounding country, but, as in nearly every instance, this lightness of soil only extends a short distance above the confluence. To those who delight in speaking of the \"sand hills of Battleford,\" and in crying down its suitability as an agricultural district, we would address the question, \"If the soil is so worthless as you would have the public believe, how is it that there is not a single location within several miles of the town in every direction that is not settled upon, and in almost every instance brought under cultivation?\" Such is the case, however. That section which is admitted to be the poorest of the entire district—the tongue of land between the river...\n— is all taken up for a considerable distance from the town, while radiating from the same centre settlement spreads out to every point of the compass. There are those who contend that a light soil in these northern latitudes is a greater advantage than the rich vegetable mould to be found in this as in other districts, and of which their residents are so proud, while others again prefer the richer soil to sandy loam. Either class can be gratified to the top of their bent in this district. For a few miles up the Battle River the soil is a sandy loam upon a clay subsoil, while farther up the river, south and south-east through the Eagle Hills and north of the Saskatchewan to the forest, stretches a tract of country which for productiveness and richness cannot be beaten anywhere. A writer in an eastern paper in describing the North-West says:\n\n\"West of the Coteau de Missouri to the base of the Rocky Mountains is the Third Prairie Steppe. This coteau or escarpment crosses the boundary in longitude one hundred and three degrees, thirty minutes west, and running north-westerly becomes the Eagle Hills about fifty miles to the East of Battleford. The elevation of the third prairie steppe ranges from 2,000 feet on the east to 4,200 feet at the foot of the Rocky Mountains. Its average altitude is about 3,000 feet. Its breadth on the forty-ninth parallel is 465 miles, and its area about 130,000 miles, of which 114,000 square miles are almost entirely devoid of forest. In the southern part of this great elevated plain, a very small proportion of the land is fit for farming purposes.\"\n\nAs may be seen from the above quotation the Battle River District forms the north-\neastern portion of the Third Prairie Steppe, and includes a large area of magnificent farming land, well timbered and watered, and affording a most desirable field for settlement. As to the light soil, the following opinion of an expert is worthy of consideration. The writer, who is a Dominion Topographical Surveyor of experience, speaks from personal observation, having travelled over the country last season. He says:\n\n\"If I were asked where and what I considered the best land I met in my wanderings I should choose Battleford, situated on the North Saskatchewan, at its junction with the Battle River, possessing in its neighborhood unlimited wood, and above all that class of soil which I consider best adapted to the North-Western climate, viz., a light sandy loam. I am perfectly aware that the craze is for heavy black loams, sometimes largely mixed with clay; this I think is a mistake, as in the spring it is not so readily heated by the sun's rays, and as a consequence it remains unfit for ploughing or seeding long after the lighter soils; then it remains moist so long that the crops continue growing into that season when they should be ripening, and often get caught by the frost. Take the light sandy loam of Battleford and the evidence is that it is quite sufficiently moist for growing purposes—chiefly attributable to the retention of the moisture by the clay subsoil—and can be worked from one to two weeks earlier in the spring than the heavier soils, and at Battleford the crops have not been nipped by the frost since farming operations first began there, some twelve years ago I think.\"\n\nIn Prof. Macoun's report of his explorations for 1879 we find the following passage concerning Battleford and the surrounding country:\n\"The police farm, situated on the point of land between Battle River and the Saskatchewan, is a sandy alluvium and appears to be very dry and barren, but it certainly has produced good crops this year. Three months ago it was barren prairie, now oats, barley, potatoes and turnips are growing luxuriantly. In the garden, also broken up this spring, are cabbages, cauliflowers and other vegetables of the choicest description. Timothy and clover had been sown to form a grass plot, and these were now in flower and gave promise of producing abundance of seed. The Governor's farm, situated on the hills to the east of his residence, was also visited. Here the soil, outside the fence, was covered with the short prairie weed indicative of dryness, and which would have been pronounced as unfit for cultivation by most people, yet within the fence were excellent oats, middling barley, short in the ear, but fine grain, and first-class wheat, the latter standing thick on the ground, nearly five feet high, and with correspondingly long ears, nearly ripe.\"\n\nThese are not the only good opinions expressed of the Battle River District, but will serve as indicators of the suitability of the country for farming. Many similar quotations are available, but the limited space at our disposal prevents their reproduction at the present moment. The following extract from a letter written by a settler in the Eagle Hills is, however, deserving of a place:\n\nOf the attractions which the Battle River district hold out to the agriculturist but little need be added to what has already been written in the SASKATCHEWAN HERALD, and the English, Scotch and Canadian papers. It is now evident that the mythical sands of Battleford have ceased to exist, except in the imagination of a credulous\nfew, who, I fancy, belong to that class from which the mule claims parentage, and to attempt to dispel their illusion would be a labor in comparison with which the ascent from Avernus would be but a trifle, and which ought rather to be permitted to remain, for such persons generally vegetate like parasites on the exertions and intellects of others, and are unwelcome everywhere.\n\n\"Like the reputed sands of other places, these are likely to become the best advertisement that the place could possibly have had, and will possibly hereafter create as much merriment in Battleford as Mr. Proctor Knott's 'Freezing cyclones of the bleak North-West which buried everything beneath the eddying sands of the St. Croix river' produced in Duluth.\n\n\"I must confess that I am most aggressive in my feelings towards a class that deliberately makes use of falsehood from motives of personal aggrandizement to induce immigrants to settle in localities in which the successful culture of land, or its adaptability for purposes of agriculture, assumes when brought face to face with it the proportions of an unsolvable problem. No sadder picture can be contemplated than that of the misery and despair of the new settler who discovers when too late that he has been the dupe of the speculator, and who after years of toil has to hopelessly abandon a task which he can never make remunerative.\n\n\"Happily no such shifts are necessary to induce immigration hither, and happily, too, the interests of incoming settlers are identical with those of the at present far too small population of this section. There is no reason, therefore, why anything should be said or written that would deviate from the direct path of veracity in order to induce settlement in the Battle River Valley. Perhaps almost enough has been done already for the incoming settler to turn towards Battleford, and to do so because he cannot better himself elsewhere, at least in such a manner as I have described, the worst possible than to be thwarted and prevented by the immediate obstacles presented, but there remains yet to be done much to complete the settlement of this place, and to bring into the actual possession of the surveyor...\"\nsuch portions of the Territories over which I have travelled to the south, the east and the west, and which are far larger in extent than the domains of the Kaiser Wilhelm and all his Germanic palatinates. A large immigration may be confidently anticipated, which, I believe, nothing can retard, but to create permanent settlement it ought to be gradual, so as to avoid the unpleasant complications which at present are taking place and daily accumulating elsewhere by the augmentation of settlement on unsurveyed lands.\"\n\nCLIMATE.\n\nThe following interesting notes on the climate of the Battle River Valley have been kindly furnished by Mr. John S. Macdonald, Dominion Meteorological Observer at Battleford:\n\nAmong the many advantages claimed by the people of the North-West for their country is that of a healthy and agreeable climate. This is especially true of the Battle River Valley. It must be admitted that the winters are long, and the temperature, particularly in the early part of the season, very low; but in compensation for this the atmosphere is clear, dry and bracing; a storm of wind is an exceptional event; and the depth of snow seldom exceeds an average of six inches. The first snowfall usually occurs between the 10th and 15th of November and remains during the season, winter thaws being very rare. From the 15th December to the 15th January is generally the coldest period of the year, the thermometer ranging from ten to fifty de-\nBATTLE RIVER VALLEY.\n\ndegrees below zero, although the latter figure is seldom reached, meteorological records showing that it has not been touched in the Battle River Valley for several years. But the number of degrees of cold is no criterion when comparison is instituted between this and the other provinces of Canada. In the North-West the temperature is so dry that when there is no wind—as is generally the case—twenty degrees below zero is not sufficient to cause discomfort. People who have never lived in this country cannot readily comprehend how such a difference can exist; but exist it does, as is vouched for by everyone having a personal knowledge of the North-West. After the middle of January the sun begins to assert itself; each day its rays become more powerful; there is seldom a cloud in the sky; and altogether this is one of the most delightful seasons of the year. As the season advances the influence of the \"chinook\" wind is felt in the interior. This wind blowing from the south-west possesses the peculiar property of melting the snow and at the same time carrying the water off in the form of vapor. By some it is supposed to come from the Pacific through the various passes of the Rocky Mountains, while others contend that it has its origin in the warm waters of the Gulf of Mexico, making a circuit along the eastern side of the mountains. The former view is probably correct, similar winds being common in British Columbia.\nWhile it is particularly claimed that this is a grain-producing country, experience has shown that the climate is also peculiarly adapted for stock purposes. Native horses turned out in the fall among the hills and bluffs are found in the spring fat and in good condition for the summer's work. Canadian horses which have been in the country for one or two years do equally well. For cattle it is necessary to put up a certain quantity of hay, to be fed in the event of heavy snow storms—a contingency which seldom arises. Altogether the winter season, though sometimes extremely cold, is pleasant and decidedly healthy. Lung diseases and rheumatism are almost unknown, and more coughing will be heard in one day in the Eastern Provinces than in a year in the North-West.\n\nThe snow disappears about the 1st of April, and ploughing begins a week or two later. This, however, varies considerably, in some seasons ploughing have been done in March, while in others April has been well advanced before operations could be begun. Immediately the frost leaves the ground vegetation progresses at a marvellously rapid rate. As if by magic the trees that but yesterday were brown and naked burst into life, and hillside, plain and valley are clothed in robes of purest green.\n\nSeeding is generally completed in the Battle River Valley by the twentieth of May. From this date until the middle of June occurs the heaviest rainfall of the year; in\nfact there is but little rain after that time, so this climate, with the exception of an occasional thunder shower.\n\nThe months of July and August are very warm, the thermometer sometimes rising to 100 degrees in the shade. The nights, however, are so cool as to render a pair of blankets a grateful covering.\n\nWild hay matures about the middle of July, and is cut from that date until frost sets in during October. Barley ripens about the third week in August, and oats and wheat about a week later. From the middle of August till the end of October is perpetual Indian Summer. This may be best instanced by the fact that during the harvest of 1882, which lasted over a month, there was but one rainstorm, and this not so heavy as to stop work. As a rule a large amount of fall ploughing is done yearly, thus greatly facilitating the work of the following spring. Up to the present time grain has never been injured by frosts in the Battle River Valley, although settlements to the east and west have suffered at different times. The reason assigned is that Battleford lies in the centre of the prairie region, and is only about fifteen hundred feet above sea level, and consequently, having less rain, is less liable to frosts.\n\nIn conclusion, let no one be deterred from coming to the Battle River Valley because of the climate. In other articles it has been shown that we possess in abundance wood, water, and a vast area of fertile soil.\nMISCELLANEOUS.\n\nSo this is added the attractions of the climate, it is evident that the intending immigrant cannot do better than take up his abode among us. Let him come, see and be convinced.\n\nThe night under a pair of There are several points which merit notice in these pages, but pressure upon our space prohibits other than a brief mention; yet as they are of too great importance to be passed over entirely, a few remarks on each will be introduced here.\n\nWater is a thing which need trouble no one, as the supply everywhere is abundant, while the quality is excellent. The Battle and Saskatchewan Rivers are streams of good water, and settlers along their banks will never have cause to complain of a lack of that useful article, while numerous creeks of various sizes are to be found. Livestock springs are abundant everywhere, and to a remarkable extent among the Eagle Hills. Back from the rivers are numerous small lakes of fresh water, and the sinking of wells is everywhere attended with success.\n\nTimber for building purposes is plentiful, especially along the banks of the river, and through the hills, while fencing is to be found everywhere, and in practically inexhaustible quantities. Messrs. Coleridge & Co. have secured a valuable timber limit on Turtle Lake, north-west of Battleford, and have had men in the woods all winter getting out\nlogs. The machinery for the mill, with all the necessary attachments for the manufacture of lumber, lath and shingles, is already on its way to this place, thus affording greater conveniences in the way of building to the newcomer. The mill will be situated at the mouth of the Turtle River, eighteen miles up the Saskatchewan from Battleford. Pending survey, dues have to be paid upon all timber cut, but actual settlers are entitled to a permit to cut eighteen hundred feet of building timber, four hundred roof poles for thatched roofs, two thousand rails and twenty-five cords of wood for the nominal fee of fifty cents, which is not a very heavy tax.\n\nWood for fuel is also easy to be had and in large quantities, the most common variety being poplar, which burns well. Although the supply is by no means inexhaustible, there is sufficient for a large settlement for many years to come, by which time the coal trade will be fully developed. Even now this useful article can be obtained at Edmonton at very reasonable prices, and can be brought down the Saskatchewan either by flatboat or steamer at a comparatively trifling cost. That coal exists within the limits of our own district is a well established fact, but the lack of transportation facilities prevents its immediate development. Coal crops out in many places along the banks of the Saskatchewan and Battle Rivers and their tributaries, a circumstance\nwhich goes a long way to confirm the following extract from Mr. Sandford Fleming's report for 1874:\n\n\"Mr. Selwyn has formed a theory, which, if confirmed by actual discoveries, will prove of incalculable benefit. His examinations convey the impression that the coal-bearing rocks pass with their associated coal seams and iron ores beneath the clays which are observed in the vicinity of Fort Pitt and the Elbow, and it may be that by boring along the river valley would reveal workable seams of coal at such a limited depth beneath the surface as would render them available, even as low down as Carlisle.\"\n\nFlour can be purchased here for from $7 to $8 for Prince Albert, and from $10 to $11 for Winnipeg patent process, but these prices are practically at an end, as Messrs. Coleridge & Co are bringing in a two-run grist mill, which they contemplate having in running order in time to grind this season's crop. In addition to this mill, which is to be located at the mouth of Turtle River, the citizens of Battlefoed have offered a bonus of $1,500 for the establishment of a mill at or near the town, and negotiations are already in progress.\n\nOf game but little need be said, as this district does not differ materially from the rest of the Territories in this respect. Elk, moose, cariboo, red deer, black-tailed deer, antelope, black and cinnamon bears are all to be obtained, while of the fur-bearing species, beaver are very plentiful. Wolves, foxes, otter, mink, marten and muskrats are all old residents. The list of feathered\ngame is a long one, and includes swans, waggles, geese, ducks (mallard, pintail, grey, teal, canvass-back, spoon-bill) and numerous others), cranes, plover, snipe, curlew, prairie chickens (sharp-tailed grouse), partridges, quails, and grouse of many kinds, pigeons, and many other varieties. Prof. Macoun arranges the birds of the Territories under ten orders, which are divided into forty-one families, one hundred and forty-six genera, and two hundred and thirty-five species.\n\nFish are found in great numbers in our rivers and lakes, principal among which are whitefish, sturgeon, goldeyes and jack fish.\n\nThere are at present only two stores here, those of the Hudson's Bay Company and Messrs. A. McDonald & Co., but prices are very reasonable when compared with those ruling in other settlements.\n\nA stipendiary magistrate resides in the district, and regular sittings of the court are held in Battleford.\n\nThe district is, as yet unrepresented in the North-West Council, but it will be entitled to a member as soon as it has a population of one thousand adults, exclusive of aliens and unenfranchised Indians, a period which is rapidly approaching.\n\nThe Church of England and Roman Catholic Church have already established missions here, and the Presbyterian and Methodist churches have decided to send ministers during the coming summer.\nThe mail service is at present only once in three weeks, the trip from Winnipeg taking from nine to eleven days, but a weekly mail has been promised for some time, and is momentarily looked for.\n\nThe Government maintains and operates under ten telegraph line between Edmonton and Humboldt, passing through Battleford, and forty-one branch from Humboldt to Troy, on the line of the Canadian Pacific Railway, is under contract to be completed by the first of May, which will bring us into connection with the telegraphic system of Canada and the United States.\n\nTHE EAGLE HILLS.\n\nIf the land immediately surrounding Battleford were useless; if there were not a tract of invaluable country lying between the two rivers, and if that great lone land of untold richness did not stretch away northward from the Saskatchewan slope; if the Eagle Hills alone, lying to the southward with an easterly and westerly course, would in a brief period secure to this district a population of large farming population. These hills may be termed the Devon of the North-West. The productiveness of the soil is unrivalled. They are fed by hundreds of rivulets. Their Roman Catholic wooded and lake scenery, varying with every season, is always of unchanged beauty. Bounteous rains and nightly dews stimulate all growth. In the most sultry days refreshing breezes sweep through the openings, and when the fierce winds of winter\nrender life almost unbearable on the plains, there the numberless poplar bluffs protect and shelter alike the settler and the traveller from their rigor. It is impossible to determine the resources of this wonderful soil, for but few settlers have yet found their way thither, and those who have settled there can form but a faint idea of its inexhaustible wealth, as the residence of none extends farther back than three years. The soil is a rich black mould, similar to that seen on the surface of all forest lands. Here, however, it is found to a depth varying from eighteen to twenty-four inches, which is not at all extraordinary when it is remembered that the yearly deposits of decayed foliage and other vegetable matter have been accumulating during unknown years. In making excavations for cellars or wells no sand has yet been discovered. The rich yellow subsoil is found to a depth of seven feet. But few stones are visible, and those that are will generally be found on the surface of the more elevated land. Huge alveolate boulders (a proof of their antiquity) are noticeable at almost regular intervals along the border of the great plain lying to the south, forming a well marked boundary line between it and these hills. Of gravelly land there is none, but marsh lands are plentiful and are the natural hay grounds of the country.\n\nThe ordinary method of tillage adopted in this portion of the North-West by settlers commencing operations, is either to turn...\nTHE EAGLE HILLS.\n\nthe sod over in the spring to a depth of about three inches and harrow well before sowing, or to break the land in June or July and backset in the autumn of the same year or in the following spring. Both possess advantages; for in the former case the crop is one year in advance, and in the latter it is doubled. A plan to obviate the disadvantage of both methods would be to run a light plough, drawn by a single ox or horse, between the furrows after the sod has been turned over, and to throw up a couple of more inches of the soil. By this means the seed will find ample food to stimulate rapid growth, and an increase of twenty-five or thirty per cent. in the yield will amply repay the extra labor.\n\nThe few crops already gathered in have been sown on the sod. Grain thus sowed has given a yield so abnormally great but little doubt can be entertained that extraordinary large crops will be secured from subsequent sowing. On the sod oats have yielded fifteen bushels for one sowed, and wheat about the same. Barley has not yet been fairly tested. It may therefore be safely conjectured that when the land has been properly cultivated, a result of thirty bushels of oats and of twenty of wheat from one acre may be anticipated. The aggregate yield in the States from one bushel of wheat, in round numbers, about ten bushels. These figures would do more towards increasing immigration to the North-West, where they are widely circulated, than nine-\ntents of the unutterably vague and pretentious pamphlets which stream from the offices of government printers by the million.\n\nThe gardener will find the soil in every respect suitable for the successful culture of vegetables. Even the most delicate plants have weathered several seasons, such as tomatoes, celery, melons and cucumbers; the latter two attaining formidable size. The land lying under the shade of the poplar bluffs is particularly adapted for the cultivation of these plants, without any artificial protection from the sun by day, or the cool air that makes the night so pleasant to the weary laborer. The larger vegetables succeeded so well that frequently they have attained almost arborescent growth. Roots of all kinds, potatoes and onions especially, thrive lustily in this generous soil.\n\nThe dendrologist would turn away in disgust from the scanty specimens of timber found in this region. The prolific poplar, the homely cottonwood and the valuable birch, with a few others of scrub growth, complete the catalogue. But if few in variety, such as they are, they will meet all the requirements of the present generation and several succeeding ones, if the millennium do not intervene.\n\nFall frosts are harmless and scarcely perceptible till October. Mosquitoes and flies are plentiful enough, but the constant summer winds drive them for shelter to the\nbush. The mosquito prefers the moisture of the swamps to the breezes of the hills.\n\nThese hills are a paradise to the sportsman. During the season thousands of ponds are covered with every variety of wild duck. Geese, waggons and swans in the larger lakes. Prairie fowl around every bluff. Partridges in all the large timber. Tens of thousands of rabbits feed on the wild vetches. The coyote and red and kit foxes are heard nightly on their prows. The cinnamon and black bear were seen last season eight miles from Battleford, and the smaller furred animals are numberless. Wild berries, too, grow ungathered on every side, and the bright tints of lovely flowers cover like a brilliant carpet the vivid verdure.\n\nThere exists little doubt that various minerals abound, but nothing positive will be known on this subject until thorough researches shall have been made by practical mineralogists. Iron ore is found in abundance, and to the experienced miner there is a good field for a few months' prospecting, as some who tried it a few years ago found fine gold in many places, and rich specimens of quartz are in possession of the Indians whose reserves are in the hills, and who claim that they were found in this locality; but no information can be obtained from them as to the spot the specimens were taken from.\n\nIt may be worth adding that the hygienic character of this locality will attract early notice. There could be a resort no better\ncalculated to impart health. In addition to the bracing atmosphere and mild winters, there are varieties of mineral waters. Those who have drunk of the sulphur springs of Bath, will recognize the nauseous smell and taste of similar waters in these hills. There are also numerous springs and streams so strongly impregnated with iron that anything thrown into them will, in one month, be found encrusted with a thick ferruginous deposit and its weight increased tenfold.\n\nThe attractive features of this portion of the Territories cannot fail to at once arrest the attention of the traveller. Its varied scenery and uniform beauty is never marred by intervals of sterile soil bereft of vegetation. Travel whither you will, a succession of rolling plains—sometimes restricted in extent, sometimes covering a large acreage—and timber-covered acclivities, lightened by the glistening waters of numberless miniature lakes, meet the eye. The rolling nature of these plains is a happy provision for the farmer. It possesses a natural means of drainage that no artificial system could excel. The reservoirs of the superfluous waters of the first spring month are the lowest lying grounds. There the waters accumulate till they attain almost lacustral magnitude. These lakes generally disappear in the month of July and are replaced by fields of high waving green grass. These are the settler's hay grounds. Let him run his mower through the grass and every acre will yield from three to four tons of hay, an\nwhich neither cattle nor horses will turn up their noses.\n\nThe climate differs totally from what is usually regarded as peculiarly belonging to the North-West. The elevation of these hills and their wooded eminences seem to gather round them all the rainclouds hovering over the adjacent plains. The showers are frequent but of short duration. Between the showers the sun bursts forth with wonderful power and leaves no drop of moisture visible. The extreme heat of summer is tempered by refreshing winds, and bounteous dews induce rapid vegetation. The autumn is the most benignant of all the seasons. That mordacious pest, the mosquito, no longer seeks to occupy your attention. The cool pleasant nights give perfect repose. The season becomes an English summer, and the immigrant settler may well imagine himself back again in his Old Country home. The rigor of the winter's cold does not exempt even this favored spot from its severity; but the sheltering woods deprive it of all its terrors—the high winds. When the thermometer registers sixty degrees of frost in calm weather the wood chopper works in his shirtsleeves. With forty degrees of frost and a brisk wind the traveller is glad to add overcoat and muffler to his ordinary attire. The exclusiveness of these hills from the evils of the blizzard is sufficient inducement to an old stager in the country to seek there for what the Yankees call \"a location.\" The newcomer will not be long be-\nfore experience will teach him how advisable it is to settle where similar shelter can be found. Heavy mists often ascend and cover, like a semi-transparent veil, the surrounding country. These, in winter, appear only on very cold and clouded days, while they are, in spring, the harbingers of almost tropical heat. They produce extraordinary and very beautiful phenomena. From the heights, the plain lying between Battleford and the hills appears as a vast shadowy lake, into which the surrounding hills shoot out like ghostly headlands in a phantom sea, growing fainter in outline as the mists thicken. While the sun is struggling through the heavy cumuli the mists open and expand, bringing to view innumerable floating islands. The sun at last forces himself through the murky atmosphere and a sea of azure, in which a thousand tremulous rainbows dance, relieves the eye. This, too, gives place in time to the natural plain clothed in its winter garb of virgin purity and transmitting back a thousand sparkling reflections from the fire of an unclouded sun. The awful quiet of the scene adds to its grandeur, and those who have witnessed these marvels of a North-West winter's day will always recall vividly to memory their wonderful beauty.\n\nTO THE SOUTH-WEST.\n\nThe following extracts from THE HERALD afford a good sketch of the country lying up the Battle River.\n\n\"One of the most interesting points lying west of Battleford is the country westward of the river. In the direction of the hills, the land is broken by gentle ridges covered with timber, edged with prairie grass. It is said that there are several hundred horses in the valley, and that the vanguard of the hundred or so who have broken up the timbered lands has already left the river. The Eagle House is now being thrown up there, and the settlers are gathering the crops and settling down.\"\n\n\"Battleford is now a busy town, and many of the settlers are engaged in commerce. The river is navigable for other vessels than the steamboat, and the shores are dotted with farms and houses. The settlers are doing well, and can be seen working in their fields and watering their cattle.\"\n\n\"The settlers are doing well, and the farms are prospering. The Indians do not seem to be interfering with the first settlers, and the crops are doing well. The grain is being stored away for the winter, and the settlers are looking forward to a good harvest next year.\"\n\n\"The settlers are doing well, and the farms are prospering. The Indians do not seem to be interfering with the first settlers, and the crops are doing well. The grain is being stored away for the winter, and the settlers are looking forward to a good harvest next year.\"\nup the Valley on the south side of Battle River:\n\n\"Our first trip was through the section lying between the river and the Eagle Hills, west of the middle trail. Striking a south-westerly course at the foot of the Big Hill, the first half-day's journey took us over a gently undulating tract of rich land, covered with a luxuriant growth of vegetation that in many places reached up to the horses' sides. The level plateaus between the valleys varied in extent from a few hundred acres to some miles in area, and only broken here and there by bluffs of small timber suitable for fencing; while to the left the vision was bounded by a rich green belt of heavy timber on the slope of the Eagle Hills. While fencing, fuel and building timber are not to be found on every lot, there is enough of every kind scattered over the country to make it easy of access to the settler.\n\n\"Between the undulations of the plains, and nestling at the foot of the hills, are numerous lakes—some tainted with alkali but others of the purest water—along whose shores and on the watercourses flowing to and from them, unlimited quantities of hay can be procured. Spring are numerous, and water has always been found by digging.\n\n\"The sinking sun warned us that it was time to seek a camp, and knowing that the farms of Mr. Prongua and Mr. Gopsill could not be far away we sought them out. The first intimation we had of having found the place was running against a field of grain growing on the plains, without a fence or other protection. . . . Nearly ten years in the country, engaged in various pursuits and familiar with every corner of it, their selection was not hastily made. Chief among the advantages that led them to settle here was the well established fact that taking one year with another they can depend on securing their crops in good condition—even in the most unfavorable sea-\nsons they are sure of a fair return for their labor. They went on to their places in April last and broke and sowed nearly fifty acres of grain. The claims here referred to are similar to scores of others that are to be found in their neighborhood. Situated in a broad valley, through the centre of which runs a sparkling brook of ice-cold water, fed by springs high up in the hills, their fields lie on either side of the creek with a sunny exposure that clears them of the winter snow and permits ploughing to be begun some weeks before the leveller lands of the flats are ready to be touched. This gives the crops such a start that they can always be secured before there is any danger from early frosts.\n\n\"Making an excursion over the plateau bounding the Battle River Valley, we were agreeably surprised to find that the same general characteristics prevailed as on the lower bench—fine bluffs of timber, broad stretches of prairie land, and numerous lakes, with marsh and plenty of hay around their banks and outlets. Travelling along the edge of this plain the valley stretches before the vision for miles, and presents one of the grandest scenes to be met with—park-like openings of every size, brightened by the silvery sheen of the lakes that dot the landscape, and of the numerous brooks that flow from the hillsides and empty into the Battle River. These brooks are all fed by springs that take their rise either among the hills or on the edge of the plateau that forms the great plain; and each one drains a noble valley broad enough to furnish homes for some scores of settlers. Numerous excellent waterpowers exist on each of these creeks, and there is no doubt that ere many years pass, the beaver that now occupy them will have given way before the resistless march of the white man, and the silence that to-day reigns in their colonies be succeeded by the busy hum of manufacturing enterprise.\n\n\"The land along our route was of first-\nTHE NORTH SIDE.\n\nNORTH OF THE SASKATCHEWAN.\n\nAlthough in the strict geographical sense of the term, that portion of the Territories lying to the north of the North Saskatchewan in this neighborhood does not belong to the Battle River Valley, yet, as its physical features are very similar, and as it will commercially form a portion of the same district, it will be included within it for the purposes of description. Skirting along the North Branch of the Saskatchewan, and included between that stream on the south and the forest line on the north, lies an immense area of land of almost incredible fertility only awaiting the plough of the settler. As its physical features are almost identical with those of the Battle River Valley, it will not be necessary to give an elaborate description of them, while the section under consideration is too important to be passed over without being referred to.\n\nAlthough we do not find railways being pushed forward and settlers flocking in as they are at the south, striving to keep abreast of the iron horse in its race for the west, we find a country far richer and better adapted for settlement than we had been led to expect. Throughout the greater portion of the land traversed there is an abun-\ndance of wood and numerous streams of running water.\n\nThe soil appeared to be richer and to comprise a greater depth of black loam than that on the other side of the river, yet the crops so far do not seem to average higher than in the latter districts. Upland and marsh hay both grow in abundance—the Indians, former especially high, strong and extremely heavy, with a large admixture of the wild prosopis pea, of which horses and cattle are so fond, and on which they flourish so well. Of course, some tracts are wholly unfit for tillage, yet capital for grazing. As regards the picturesque scenery, there are large sections of the undulating country with beautiful lakes, from one to fifteen miles in length, dotted one long with islets, from the shores of which, and from the surrounding heights, enchanting views are to be had, where many a pleasure-seeker would fain reside and enjoy the glory of the scenery.\n\nThe first settlers who crossed the North Saskatchewan in this vicinity were Messrs. Robert Wyld and Fred Bourke, who, a few years since, decided to embark in cattle raising, and selected a location a short distance above the mouth of Battle River, where they also engaged in farming. Their undertaking has prospered beyond the most sanguine expectations of themselves and of those who watched their progress, and Messrs. Wyld & Bourke have proved conclusively, although this is not a stock-raising district in the sense that the term is used in\nstreams of the southern portion of the Territories, that small band of cattle can be successfully handled and profitably handled. During the summer of 1882 Messrs. Harry and Richard Wyld, yet they joined their brother; and this season they have over one hundred acres under crop.\n\nIn the same season, a number of French Canadians, Messrs. Léon, Arcand, Prévost, Laflèche, and others, visited the north side on a prospecting expedition, and were so delighted with what they saw that they immediately located and sent for their friends and families. A number of them arrived during the winter, and already do we see sections of the nucleus of a large and prosperous settlement. A large quantity of breaking was done last fall, houses erected, and rail timbers which, and other got out, and this spring farming operations are being vigorously prosecuted.\n\nTURTLE RIVER.\n\nThis is a small stream emptying into the Saskatchewan from the north side at a point about twenty miles above the mouth of the Battle River, and although forming a part of the northern district treated of in the last article, it is thrown into especial prominence by the location at its mouth of the mills of Messrs. Coleridge & Co., who have secured and are operating a timber limit on the shores of Turtle Lake, the headwaters of the stream referred to. On both banks of the Turtle, and for a considerable distance above its mouth, lies a large extent of country, the soil of which is a rich clay\nloam, and admirably adapted for farming. Wood for all purposes—building, fencing and fuel—is abundant, as is also water and hay. A feature, and an excellent one, too, of the country north of the Saskatchewan is its comparative freedom from reserves, a characteristic of which the advantages are so evident that nothing remains to be said. In addition to these favorable features, the establishment of a mill at this point at an early day is certain to attract prospectors, so that we may shortly expect to find a new settlement springing up here, where now there is not a sign of civilization. Turtle Lake has long been celebrated for its white-fish, the people of Battleford and Fort Pitt having for years drawn their supplies from its bosom, while jackfish, sturgeon and carp are to be taken in the stream itself. Numerous lakes and ponds in the surrounding district afford watering and pasturage facilities for large bands of cattle, thus making it attractive for the stock-raiser as well as for the agriculturist. In short, the advantages of this section are such as render it almost desirable field for location.\n\nUP THE BATTLE RIVER.\n\nThe following paragraphs were written a couple of years ago by a farmer in search of a location, and time has proved the correctness of his observations:\n\n\"As a prospector in the vicinity of Battleford I have carefully examined the country for a considerable distance up the valley of\nBattle River, and being somewhat posted in respect of soils best adapted for successful agricultural operations, I have come to the conclusion that the Battle River Valley possesses all the requirements in that direction, and when occupied, and its natural resources more thoroughly developed, it is destined to become one of the most populous and wealthy portions of the North-West. The valley is a mixture of prairie and wood land, some portions heavily timbered, and consequently possessing all the requisites for successful farming, namely, good land, water, fuel, fencing and building timber. The grass in many places is exceedingly luxuriant, especially on the flats in the vicinity of the river, thus affording abundance of hay, and pasturage practically unlimited. This fact, in connection with good and natural cover in the lesser valleys and bluffs, offers exceedingly flattering inducements to stock-raisers. As an illustration on this point I may say that I have had the opportunity of observing the progress of Macfarlane Brothers' excellent band of horses, which they have bred and raised in this valley for the past three years, and can bear witness that these animals have roamed at large during those winters, and have invariably turned up in the spring in good condition, and that as many of the band as are required are then yoked up to assist in the spring work. I was also informed that these horses receive no further attention than to be visited occasionally to see whether any accident has occurred amongst them.\n\n\"The soil is by no means a pure sand, but a mixture of sand, clay, and dark loam—no doubt an alluvial accumulation deposited when the streams were much larger and more rapid than they now are, or when the country was entirely submerged. As the waters receded the mounds were left, and being composed so largely of fertile matter, speedily developed the growth of the timber, shrubbery and nutritious grasses that now cover their surface; and they were at no\nremote day the home of countless herds of cattle, buffalo, moose and elk, as shown by the numerous relics of these animals everywhere to be found.\n\n\"The fact that Indian corn and pumpkins arrive at perfection affords indubitable evidence of the adaptability of the soil and climate of the valley for the growth of vegetables of the most delicate varieties; and taking this section of the North-West all together, it certainly is second to none in the Territories.\"\n\nAn idea of the extent of the Battle River Valley may be obtained by an inspection of the latest map of the North-West Territories, from which it will be observed that between Great Saskatchewan River, going against the current, continues from Battleford westward almost in a north-westerly direction, until it reaches a point a few miles beyond far Victoria, when it abruptly turns south-west towards the Rocky Mountains, where it takes its rise. Tracing up the Battle River from its junction with the Saskatchewan we find that its course is north-westerly about thirty miles, when it inclines sharply to the south-west, and thus perseveres west about one hundred and forty miles, a short distance above the point where the Edmonton and Red Deer trail crosses it, whence again turns north-westerly to its source, about four hundred miles from Battleford.\n\nNow, it will be observed that a very large area of country is embraced between the two magnificent streams, the greater portion of which lies to the south of the divide and consequently forms a portion of the North-West Territories.\nBATTLE RIVER BARLEY.\n\nThis large and important tract of country, with a southern slope, and materially protected by the height of land to the north, certainly constitutes a very desirable agricultural region, including the district to the south, also. The growth of vegetation by the Battle River, embraces a variety of varieties; and the North-West all agree none in this. Nearly every foot of it is available for agricultural purposes, and the country possesses all the resources necessary to build up a rich and prosperous community.\n\nTwenty-five miles above Battleford, and between the rivers, the nucleus of a large settlement was formed in the autumn of 1882, when the Messrs. Taylor, Bremner and others located. These people disposed of their farms in Manitoba during the boom, and sought locations farther west. They turned their attention to this section, with the result that they have all settled here, and are now preparing to operate largely. They express themselves as well satisfied with the change, and say that their settlement will receive large accessions during the coming season.\n\nGOOD WORDS FROM OUTSIDE.\n\nDuring the winter of 1881-2 the Toronto Globe published the following comments on specimens of Battle River barley sent down:\n\nIn speaking of the future grain crops of the North-West it is customary to take\none crop, wheat, as likely to overshadow in importance all the others. This has come to be the practice because experience has proved that the north-western soil and climate produce the best wheat in the world: wheat that weighs heavier to the bushel and yields a greater amount of strongly glutinous flour than can be obtained from the wheat of any other country or state. But excellent as are the prospects for wheat, we have before us evidence in the shape of samples, that with respect to the grain of next importance, barley, the North-West is likely to equal, not surpass every other section of the continent. The samples of barley alluded to have been sent us from Battleford by Mr. John Carney. The crops from which they were taken grew on 'Poundmaker's' reserve, in the Battle River Valley, thirty miles above Battleford; from a section twenty miles up from Battleford; and from another place thirteen miles from Battleford, in the same valley. The grain is very large and plump, and the skin is thin. If it were not a little discolored it would be entitled to rank among the special grades for Canada barley, one grade ahead of No. 1; but the color being a little bit off, it would only grade as No. 2. At present it is graded in the 'brass kettle' of a well known barre dealer, the grain weighs a little over fifty pounds to the bushel—two pounds more than the standard; notwithstanding that seems the barley having been merely rubbed out by hand, the awns were long, and the grain consequently lay more loosely than it would if it had first passed through a threshing machine or an elevator.\n\n\"The most striking thing about the samples gathered is that they were grown on land that was not broken until last spring. They were harvested in August. It is evident that cool nights and rainless ripening seasons in the North-West suit this grain, and that the production of the bright barley for which Canada is famous is capable of expansion to an indefinite extent.\"\nAnd in a later number of the Saskatchewan Herald we find Mr. Carney making the following satisfactory explanation of the discoloration of his samples:\n\n\"At the time the grain was cut and ready for house, a report reached the Indian reserves that the Governor-General was drawing nigh to Battleford, whereupon the Indians left their harvest-fields en masse, leaving their grain exposed to the sun and heavy dews for two weeks.\"\n\nPROF. MACOUN'S VIEWS.\n\nIn his excellent work, \"Manitoba and the Great North-West,\" Prof. Macoun dwells at considerable length upon the Battle River District. From the chapter describing the country between the fifty-second and fifty-third parallels we make the following extract:\n\n\"Lying north of the Saskatchewan is a fine tract that may be seen from the heights above Eagle Creek, and which, when settlement crosses the river, will be very attractive. Eagle Creek, a fine stream of pure water, enters the Saskatchewan at the eastern end of the Eagle Hills. This stream seems to rise in a large coulee that extends many miles into the great plain south of Battleford.\n\n\"The Bear Hills pass gradually into the Eagle Hills, which at first turn to the northeast, but as they approach the North Saskatchewan, they trend to the north-west until they reach Battle River, some distance from Battleford. At Battleford their base is about eight miles south. As they pass eastward they draw nearer to the Saskatchewan. Their northern slope is a continuous forest of very good poplar (Populus tremuloides and balsamifera), which breaks up and becomes interspersed with prairie as it ap-\nproaches that river. Between Battleford and Eagle Creek no less than twenty-two small streams issue from the forest and make their way into the river.\n\n\"The land bordering on the river is generally a sandy loam, but many fine farms will yet be located there. In the hills themselves, and southward from them, the land is very rich, the soil being a black clay loam, changing as it gets drier (southward) into a sandy one, but with very little change in vegetation. Mr. Wilkins, D.L.S., crossed diagonally through the hills, while I passed on both sides of them, and his report of the land at the Mission and at the Government Farm agrees with my own observations. The land in the southern extension of the hills is very much broken and contains multitudes of ponds and fresh-water marshes, where immense quantities of natural hay of the best quality go to waste every year. Although many people think the hills the best for settlement, I believe future settlers will prefer the prairie, as there is less broken land, less marsh and swamp, and less labor required to make a home.\n\n\"As the views of the Globe's correspondent regarding Battleford are very nearly in accord with my own, I give his description:\n\n\"'This place is certainly one of the most beautiful and picturesque in the North-West, and if ever there was a spot which nature intended for the site of a city it is Battleford. The steamboat landing on the Saskatchewan is two or three miles west of where Battle River falls into the larger stream, but for a long way (several miles at least above this) the general direction of the two streams is parallel, though the strip of land between them is seldom above two miles and a half, and in places less than three-quarters of a mile, in width. This strip of land between the two rivers consists of a beautiful plateau of fine, smooth upland prairie. Its highest portion is along its centre, midway between the two streams, and it slopes away gently towards each.\"\nBattleford twenty-two forest and\n\ner is generally fine farms hills them-\n\n, the land black clay (southward)\n\nlittle change\n\nS., crossed\n\nI passed\n\nport of the\n\ngovernment\n\nobservations.\n\nof the\n\nmountains mul-\n\nmarshes,\n\nnatural hay of\n\nyear. Al-\n\nills the best\n\nsettlers will\n\nless broken\n\nand less labor\n\ncorrespon-\n\nvery nearly in\n\ndescription:\n\nof the most\n\nthe North-\n\nspot which\n\nof a city it is\n\nding on the\n\nmiles west of\n\nthe larger\n\nral miles at\n\nction of the\n\nstrip of\n\nabove two\n\nless than\n\nwidth This\n\nvers consists\n\nsmooth upland\n\nlong its cen-\n\nstreams, and\n\neach. The\n\nlowest portion of this plateau is fifteen or\n\ntwenty feet above the narrow strip of bot-\n\ntom land along both rivers, which latter in\n\ntimes of spring floods are sometimes par-\n\ntially submerged. On the other hand the\n\nhighest portion of this plateau (which the\n\nreader will have already identified as the\n\nsite of the future city of Battleford,) is con-\n\nsiderably lower than the level of the prairie\n\nbluffs, which rise beyond the Saskatchewan\n\non the north and Battle River on the south.\n\nHere is a spot which could be easily drained\n\nby sewers falling each way from the central\n\nridge; the whole outer boundary would be\n\nriver frontage, at which the Saskatchewan\n\nsteamers could land at nearly all times,\n\nwhile the smaller craft, which would be re-\n\nquired to navigate Battle River, could per-\n\nform the service from the forks when the\n\nlarger steamers could not ascend on the\n\nsouth side of the peninsula with safety.\n\nWith a city located on this peninsular pla-\n\nteau, which is now only occupied by the\n\nbarracks of the Mounted Police, the south\n\nbank of Battle River and the north bank of\n\nthe Saskatchewan, about four miles apart,\n\nwould afford the most charming situations\n\nfor villa and suburban residences.\n\n\"Regarding the country in the imme-\n\ndiate vicinity of Battleford, I am quite\n\naware that what I have to say flatly contra-\n\ndicts what appears to me to be the general\n\nimpression concerning it. Before coming\n\nhere I was told that Battleford was in the\n\nmidst of a sterile, dreary waste of sand, but\n\nI wish we had a few hundred square miles\n\nof just such dreary wastes of sand in Onta-\n\nrio and Quebec. The soil is not the deep\n\nblack loam which I have seen in other por-\n\ntions of the North-West, but at the same\n\ntime that it is not unproductive I shall pre-\n\nsently produce abundant proofs. It is a rich\n\nand very friable soil, in which there is un-\n\nquestionably some sand, but for all that it\n\nis deep, strong, warm, and extremely pro-\n\nductive. I should have stated before that\n\nthe few houses—beyond the houses of Go-\nvernment officials, which are on the crest of the beautiful high bluff south of Battle River—are located on a narrow strip of bottom land south of the smaller stream, and the plateau to which I have already referred is the site of the future city.\n\n\"The police farm at Battleford was established in 1879. In the spring of that year Inspector Walker broke up the soil, and on my visit about the first of August I found everything well advanced and wrote in my journal: 'The police farm, situated on the point of land between Battle River and the Saskatchewan, is a sandy alluvium, and appears to be very dry and barren, but it certainly has produced good crops this year. Three months ago it was barren prairie, now oats, barley, potatoes and turnips are growing luxuriantly. In the garden, also broken up this spring, are cabbages, cauliflowers and other vegetables of the finest description. Timothy and clover had been sown to form a grass plot, and these were now in flower and gave promise of producing abundance of seed. The Governor's farm, situated on the sand hills to the east of his residence, was also visited. Here the soil, outside the fence, was covered with short prairie sward indicative of dryness, and which would have been pronounced unfit for cultivation by most people, yet within the fence were excellent oats, middling barley, short in the ear but grain fine, and first-class wheat, the latter standing thick on the ground, nearly five feet high, with correspondingly long ears, nearly ripe.\n\n\"Besides the exuberant growth of most grains there is a remarkable vitality imparted to them in this region that astonishes the stranger. I am more and more convinced that it is not soil which is the cause of the astonishing crops produced in the west, but the peculiar climate. When digging up the prairie soil, even in the hardest clays, I could never get below the roots of the grass, and these were so numerous that they seemed to fill the soil. Owing to the\nwere winter's frost, and the light rainfall in spring, the young roots are enabled to penetrate the soil to a depth wholly beyond the belief of an eastern farmer. They seem to follow the pores opened by the frost right down to the subsoil, and hence, instead of drawing their nourishment from four or five inches of soil, they draw it from eighteen or twenty-four inches.\"\n\nTHE GLOBE'S CORRESPONDENT.\n\nWhen His Excellency the Governor-General visited the Territories in the summer of 1881, a number of correspondents of newspapers published in the Old Country accompanied the party, and they were unanimous in their praise of the Battle River Valley. With the party was also Mr. W. H. Williams, special correspondent of the Toronto Globe, or, as he is now universally known, \"the buckboard correspondent.\" Mr. Williams returned to Winnipeg by way of Battleford, and spent some time in examining the country. Although delighted with the place on the occasion of his first visit, his second examination and a careful comparison with other portions of the Territories only served to increase his good opinion. His letters from and about Battleford and the Battle River district were full of praises without exaggeration, and did much to draw public attention to a district which had previously been looked upon as \"a dreary waste of sand.\" In a letter written after the completion of his journey, and especially devoted to the district between Battleford and Carlton, we find the following good words:\nThe trail from Carlton to Battleford follows close along the south bank of the North Saskatchewan. The distance between these two points is calculated to be one hundred and ten miles by the shortest route. Seventy or eighty miles of the road traverses fine upland prairies, the soil being good, and possessed of all the natural advantages incident to that sort of country, affording, as does, almost illimitable stretches for gigantic fields, and requiring little or nothing about the way of artificial drainage. Between thirty and forty miles from Battleford the Eagle Hills are reached, and here, though the land is, of course, more broken, it is exceedingly rich in quality, and some few settlers who have already taken up land in this district are having marvellously good crops and absolutely certain harvests. The Eagle Hills may be said to extend all the way to Battleford.\n\nAs I have already had a good deal to say about the capital of the North-West Territories, it will not be necessary to add much as been here; its location is admirable both from an agricultural and a commercial point of view. Being at the junction of the Battle River with the North Saskatchewan, it has facilities for navigation north-west, south-west and eastward, and besides this a country lying to the south of it through which heavy freight waggons could be run with perfect safety all the way to Calgary and Macleod if necessary. In no part of the North-West did I see better growing crops when I was on my way westward, and in no part, either of the North-West or Manitoba, did I find the farmers better satisfied with the results of their season's work than I did here on my return. The soil is not so heavy as that of Edmonton or Prince Albert proper, but this rich sandy loam that is to be found everywhere about Battleford is, I am convinced, in the long run as profitable soil for the agriculturist, taking one year with another, as can be found anywhere on the continent. This autumn excellent harvests are out of doubt.\nBattleford for the most part of the North-West Territories. Between these taken off fields that had been cropped for one hundred years continuously without manuring for five or seven years. Here I found no disposition on the part even of the most sanguine settlers to apologize for any shortcomings owing to a backward summer or early frosts, though several of the settlers who had been tardy about gathering their potatoes suffered from the early advent of winter weather.\n\nBetween all that I can learn I think that, as a rule, the winters are less severe at Battleford than in any other of the northern settlements in the Territories. From its location some few settlement cannot, in the very nature of things, be subject to the visitation of blizzards or that intense degree of cold that characterizes the Eagle's more low-lying localities, and especially those in the neighborhood of extensive muskegs or marshy flats. For political purposes a great deal of howling has been indulged in about Battleford sand. Battleford has been pronounced the centre of nowhere, and in fact everything that political malice could suggest has been said against it, simply because the late Government of the Dominion made some improvements here with the view that it was to be permanently the Capital of the North-West. All this nonsense that has been talked and written will be run with on this subject, while it has worked mischief to Calgary and Battleford and to many a settler who, in coming to the North-West, has gone farther and fared worse, will still be unavailing as means of permanently checking this settlement's onward and upward progress. I have no hesitation whatever in saying that there is no settlement in the North-West not so heavily possessed, all in all, of natural advantages equal to those of Battleford.\n\nWhether the main line of the Canadian Pacific Railway is destined ever to reach Battleford or not I am unable to say; but that Battleford will, in a comparatively short time, have railway communication with the outer world, I have not the slightest doubt.\"\nBATTLE RIVER VALLEY.\n\nSOME SHORTER OPINIONS.\n\nThe correspondent of the London (England) Times, who accompanied the vice-regal party on their tour through the Territories thus expresses himself:\n\n\"Battleford is close to the junction of the Battle River with the Saskatchewan, and has been given a bad name altogether undeserved. A bad name sticks, and 'Battleford sand' has become proverbial, though really it is but a handful in comparison with the first-class soil adjoining it. The country through which we have passed since leaving the bluffs is above suspicion. Here at our camp-ground the grass is thick and rich, and almost up to our knees.\"\n\nIn his address at the Winnipeg banquet His Excellency the Governor-General spoke as follows of the country surrounding Battleford:\n\n\"For two days' march—that is to say, for about sixty or seventy miles—south of Battleford, we passed over land whose excellence could not be excelled for agricultural purposes; thence to the Red Deer Valley, the soil is lighter, but still, in my opinion, in most places good for grain, and, in any case, most admirable for summer pasturage. It will certainly be good also for stock in winter as soon as it shall pay to have some hay stored in the valleys. The whole of it has been the favorite feeding ground of the buffalo, and their tracks from watering-place to watering-place (never too far apart from each other) were everywhere to be seen. Let us hope that the time will not be long before the disappearance of the buffalo from these scenes is followed by the appearance of domestic herds.\"\n\nWhen interviewed by a reporter of the Winnipeg Times during the spring of 1881,\nMr. R. LaTouche Tupper, in speaking of his district, said:\n\n\"A great many new settlers are settling in the rich lands in the vicinity of Battleford. The Eagle Hills country, lying between the two branches of the Saskatchewan, and not far from Battleford, will be a very attractive part of the North-West for settlement this year, while the land across the river to the north is also a very rich and luxuriant prairie. There is an abundant supply of wood both for fuel and building purposes, both on the hills and along the valleys of the large streams, consisting principally of poplar and spruce. The water is excellent and entirely free from alkali. Settlers in this country are very hopeful of the future, and are looking wistfully for railway communication.\"\n\nCapt. Deville, Chief Inspector of Surveys, in his annual report says:\n\n\"Several surveyors had occasion to cross the valley of the Battle River. They all speak of it as a district of fertility unsurpassed in the whole North-West. There is good water, abundance of wood, and fine prairie openings.\"\n\nFrom the files of the SASKATCHEWAN HERALD we compile the following opinions elicited from tourists and explorers in interviews with the editor.\n\nMr Wilkins, C.E., who was a member of Prof. Macoun's party in 1879, reported \"a much larger area of good land than is generally supposed to exist.\"\n\nProf. Macoun is reported as having stated that—\n\n\"The district lying east of the one hundred and tenth meridian and north of Lake Manitou, all the way to Battleford, will yet be an excellent farming country, as the land...\"\nBATTLE RIVER VALLEY.\n\nis level, and the soil, though light in place very good.\"\n\nOf Battleford and its environs the Professor said:\n\n\"Much has been said about the sandhills in this neighborhood, but a careful examination shows that they only extend at their greatest width to a depth of three miles from the river, and that on some of their slopes and in the intervening valleys are many stretches of excellent land.\"\n\nMr. H. Grant-Dalton and party travelled through the country during the summer of 1881 on a pleasure trip, and in the announcement of their passage through Battleford we find THE HERALD remarking:\n\n\"We have much pleasure in saying that their impression of the capital and the Battle River Valley generally is that its principal characteristics and excellence are such as must very soon place it in the foremost ranks of the settlements now springing into existence.\"\n\nProf. Kenaston, C.E., was sent out the same season by the Canadian Pacific Railway Company to examine the country between Moose Jaw and Edmonton, and he is thus reported to have expressed himself:\n\n\"The Professor has travelled over a large section of the North-West, having an eye to the agricultural capabilities of the country as well as to the selection of a railway route, and from what he has seen he finds that the Battle River Valley possesses in a greater degree than any other district visited the elements necessary to becoming an important settlement. The land increases in richness as one goes up stream, until it becomes equal to any in the Territories, besides being free from some disadvantages under which other districts labor.\"\nLOCAL OPINIONS.\n\nWe have devoted considerable space to the production of complimentary opinions given of our district by people who have visited us, and we may be pardoned if we publish some that have been expressed by others who have been here for some time, and are consequently more intimately acquainted with the country and its resources, but, as these articles have already exceeded the limits originally contemplated, they will, of necessity, be brief. In August, 1882, a correspondent signing himself \"Hastings\" wrote to the Toronto Globe a description of Mr. Adam Boyle's location at the foot of the Eagle Hills from which we make the following extract:\n\n\"The land on which Mr. Boyle's crop is, and which is the same as that found generally throughout the Eagle Hills, is a rich black loam with a clay subsoil. He has a spring creek of good water running past his house, and plenty of timber—birch and poplar—for building, wood and fencing in the ravines running into the hills behind him, while a large swamp in which has been cut one hundred and fifty tons of hay the summer stretches for a mile along the foot of his claim. There are hundreds of places with more or less equal advantages in the neighborhood, though with the number of settlers coming in at present the choice locations near town will soon be taken up, and new arrivals will have to go farther back. Prices for all kinds of produce are good; while Battleford is well known as the cheapest place, considering distances, to buy merchandise in the North-West. There have been damaging reports made from time to\ntime of this district, it having been described as consisting principally of sand hills. The main reason for this is, that the principal trails leading into the place pass through the poorest part of the country. These sand hills, which are only a fraction compared with the quantity of good land adjoining them, are found in all parts of the North-West, and afford excellent shelter for stock in the winter, and native horses turned out there in the fall, feeding on the \"goose grass\" and other grasses which abound in them, are brought in fat in the spring.\n\n\"With its extensive tracts of pine, sixteen miles to the north-west, surrounding Turtle Lake and River, which connects with the Saskatchewan eighteen miles above the town; with the large beds of coal known to exist along the Battle River; with the certainty of a survey this fall and the erection of a saw and grist mill in the vicinity, Battleford is bound to go ahead with a rapidity unequalled by few places in the North-West, and assure the position to which its situation, its fertility, its climate, its scenery, its fish, game and natural resources justly entitle it.\"\n\nDuring the same summer Mr. Robert Wyld received a circular from the traffic department of the Canadian Pacific Railway asking for a statement of the acreage under cultivation last season, and at the conclusion of his report he added the following comments upon our district:\n\n\"I have been in the North-West eight years, and have lived at Shoal Lake, Winnipeg, Fort Macleod, Fort Walsh, Fort Calgary and Fort Qu'Appelle, and have travelled through the Red Deer and Bow River districts, and have settled here in preference to any of the above-mentioned places. We have no summer frosts, and are less liable to early frosts than any other portion of the North-West. My cattle were out until the\nLOCAL OPINIONS.\n\nmiddle of January, and when taken in were found to be in good condition. I am not a land speculator, but an actual settler, perfectly satisfied with the locality. A great deal has been said by politicians to the detriment of Battleford, from purely political motives, they not knowing anything of the advantages or disadvantages of the place. This being the choice of the present Opposition, it is of course condemned by the present Government, but I am certain that it is a far more suitable site for the capital of the North-West than the much-talked-of capital, Regina. I am a Conservative in politics, so I do not give my views for any political purpose.\"\n\nMr. B. Fremont, who has lived a number of years in the Battle River Valley, and who is a thoroughly competent judge, when asked recently by a newspaper correspondent for his opinion gave it in the following words:\n\n\"I have travelled over the greater portion of the Western and North-Western States and the Canadian Territories, and have lived in both sections, but in all my travels I have never traversed as fine a region as the Battle River Valley. I have prospected on both sides of Battle River from its mouth to the Edmonton and Red Deer crossing, one hundred and seventy miles up, and consider it is, without exception, the finest portion of country in the North-West, on either side of the boundary line. It is admirably adapted for farming in all its branches, and possesses good water in abundance, all the timber necessary for years to come, and grass shoulder high for miles. The soil is a rich sandy loam with clay subsoil, and the seasons are more favorable for agricultural pursuits than any other portion of the Territories. The running streams and lakelets are pure and clear, while I particularly remarked the absence of alkaline ponds and\nsloughs; and I am satisfied that in the near future this Valley will become the garden of the North-West.\"\n\nThe SASKATCHEWAN HERALD, in commenting in its issue of October 28, 1879, on the result of Prof. Mocoun's explorations, aptly remarks:\n\n\"Let the land be good or bad according to any particular standard of excellence, it is immaterial so long as it yields the crops it does. As the Professor aptly put it, while discussing the character of the soil in a section recently visited, 'Call it sawdust, if you like; that,' he said, holding up a handful of grain, 'is what it produces.'\"\n\nReviewing the Globe's remarks on our barley, THE HERALD of January 21, 1882, says:\n\n\"We would call the attention of those croakers, who desire to circulate false ideas concerning the agricultural capabilities of this section of country to the above facts, which most decidedly prove that the very best quality of grain can be and is raised in the vicinity of Battleford, notwithstanding the few sandhills in the neighborhood of the junction of the rivers, and that, too, on the fresh-turned virgin sod. Those sandhills, as they are called, have in the past been a convenient bugbear in the mouths of those who delight in misrepresenting the Battle River country, but the proof of the pudding is in the eating of it, and we speak that we do know—which has been recognized and appreciated by competent persons well able to form an opinion—that the Battle River Valley is destined to become one of the most populous and, perhaps, the greatest grain-growing districts in the North-West. The arable land in this valley is extensive and of undoubted fertility, and its natural resources with respect to timber, healthy water and native grasses excellent. Hence, this valley embraces everything desirable to make success certain. Past experience enough is known to show less than nothing and the possibilities are aid of the excellent manner of the philic people concerned in Canada will give possession of the advantages of Battleford Valley.\"\n\nAnd in another issue of the same paper, we find:\n\n\"A great public round. The eyes north will of ad the from the rise Eagle to fi soft hal yell feet mill rior\nmake farming and stockraising combined a successful operation as well as a healthy pastime for those who may be fortunate enough to secure claims therein. It is a well known fact that the Battle River country is less liable to storms and summer frosts than any other portion of the Territories, and that many of the most delicate vegetables are grown in the open air without the aid of artificial heat. Now, with such an excellent country to back it up, besides many other important advantages, geographical and otherwise, we may reasonably conclude—and no blowing—whether the Canadian Pacific Railway Company should give us a branch or not, that this very region possesses sufficient natural resources and advantages, when developed, to make Battleford the Queen City of the Saskatchewan Valley.\"\n\nAnd again, in another article in the same issue, entitled \"Battleford's Future,\" we find the following:\n\n\"A great deal has been published, and a great deal more has been said that was never published, decrying the fitness of the surrounding land for agricultural purposes. The uninfluenced visitor has only to cast his eyes upon the unbounded prospect lying north of the Saskatchewan, and his vision will be delighted with the sight of millions of acres of the richest wheat-raising land in the world, stretching away to the north from the banks of the mighty river, whence the ascent is distinguished by a gradual rise, or to travel south a few miles to the Eagle Hills, with their sixty miles of stretch, to find a virgin soil, enriched by the vegetable soil of bygone centuries, black in color, soft to handle as flour, of from two and one-half to three feet, with a subsoil of thick yellowish clay of an average depth of four feet. In short, all the land for hundreds of miles around Battleford is of the same superior class, excepting the narrow peninsular\nstrip restricted to a small area above the confluence of the two rivers.\"\n\nSOME OF OUR RECORDS.\n\nAnd now, having quoted a large number of opinions expressed concerning our valley and its adaptability as a field for settlement, we will proceed to show what has been done by some of those who have had the nerve to settle down among our \"sandhills,\" and endeavor to make a living by the cultivation of the soil. Actions, they say, speak louder than words, and in the same manner results are stronger proofs than opinions. In conversation with \"Hastings,\" the correspondent of the Toronto Globe from whose letter we have already made one extract, Mr. Adam Boyle gave the following sketch of his two years' experience in this district:\n\n\"Two years ago I was farming in partnership on Fish Creek, in the Bow River country, nine miles from Fort Calgary. On the 22nd of August snow fell a foot in depth, and the grain, which was just turning, was badly frozen, so I sold out my share, for which previously, I would not have taken $500, for $100; and buying twenty-six head of cattle at Fort Macleod for $510, I started for the Saskatchewan country, calculating to sell them there. When I got here I found people just digging their potatoes, and the crops all harvested without injury from frost; nor had there been any snow as yet, so, as there was no ready sale for stock at that time, I decided to winter my cattle here, and took up this place, built a house and corral, and brought them out in good shape in the spring on fifteen tons of hay, which was all I could buy, and it was too late to cut any. They grazed out the greater part of the winter, there being very little snow in the hills...\"\nI have sold $600 worth of butter and $650 worth of beef, besides what I have used myself, and have thirty-four head of cattle, for which I could take $1,200 today, but would not sell. A small stock-raiser has a better chance here than in Bow River, it being hard to compete with the large ranch companies there, while here he gets ready sale for beef and butter at good prices, and this is the healthiest country I ever saw for stock. Last spring I broke nine acres of land, from five of which I harvested two hundred bushels of grain, one acre of wheat producing forty-six bushels. The balance was in potatoes and roots and turned out well. This year I have thirty acres of crop, and expect to have nine hundred or a thousand bushels of oats off twenty-four acres, and some of my grain will be ready to cut in three or four days. Take all the crop on the thirty acres, potatoes, oats and all, I think I would not be over-estimating it at $1,600. There are only about ten acres of this old land, the rest being on first breaking, and with the exception of about $100 paid for labor, myself and a boy fourteen years of age have done the work, besides fencing about forty-five acres. The oats on the old land average about four and a half feet in height. This is the experience of a man who was not brought up to farming. My crops here are as good or better than anything I ever saw in my life, and I have travelled and resided in nearly all the Western States and Territories. I have lived in the famous Walla-Walla district of Oregon, and consider this just as good a place for farming.\"\n\nThe Finlayson Brothers, three in number, whose locations are on the Battle River about six miles above Battleford, also show a good record for the time they have been here. They arrived here from Ontario on the 18th of July, 1879, and after looking around them, pitched upon their present\nholdings. In September of the same year also had they put up a house and stable, and during the ensuing winter they got out a land lock, and number of rails. Early in the following spring they commencing farming operations, the in earnest. In April, 1881, they were visited by a correspondent of the Globe, who made the following report on their progress:\n\n\"They arrived from Winnipeg with one team, and $250 in cash was the balance of stock off hand. Under these circumstances they contracted a debt of $100 forthwith for necessary The series and immediately located. In April and May, 1880, they ploughed and seeded forty acres, and fenced two miles of frontage along the Battle River. Already this season they have completed re-ploughing the forty acres ploughed in 1880, and have since completed breaking forty additional acres, the greater portion of which is seeded, and eat dry they have on hand—dependent of the obset the team, which they disposed of—fifteen head consist of cattle and horses (only one cow, as there is no female about the premises) embracing, three good teams, one waggon, two ploughs, two drags, one reaper and mower, one horse and rake, one roller, besides a very good collection of tools, and, the best of all, are entirely our price's of debt. Now, this was accomplished in one breaking year.\"\n\nAnd now, in the spring of 1888, we find them with over seven hundred acres in. Prifenced, and one hundred and sixty broken, and of which ninety acres were cultivated last season. Their crop last year was four thousand bushels of grain, two hundred of potatoes, and two hundred and fifty of turnips, besides a quantity of Hungarian grass. They now have two good houses and stabling for ten horses and thirty head of cattle. They have\nThe same year also have ten horses, including four Canadian ponies, and during the season, and thirty head of horned cattle, they bought out a landlock, a reaper, mower, rake, five ploughs, two sets of harrows, two seeders, three wagons, two teams of oxen, three bob-sleighs, and a great number of smaller implements, and are still free of debt. They have also on the road a self-propelled reaper and an eight-horse thresher.\n\nBeginning with one twenty-acre field they last season sowed, and the balance of the land off fifty-five bushels of oats to the acre. The season of 1878 was not by any means a good one for crops that has visited this district, yet we find the following crop report made by this season that year:\n\n\"The threshing machine has finished up the work in this neighborhood. The traditional acreage extreme drought of the past season was a great drawback to this part of the country, and the yield, as measured by the machine, averaged fifteen bushels considered satisfactory, taking every cow, as threshing into account. The Governor's crop of oats, taken off a piece of new breaking, averaged over twenty bushels to the acre, and would have gone much higher had it been more carefully harvested. James Price, entirely our price's crop, on Battle River, also off new land, polished in one breaking, yielded upwards of twenty-five bushels to the acre. Messrs. Macfarlane, whose land was cropped for the second time, found fifty-seven bushels of oats to the acre. Mr. Price planted six bushels of potatoes on sixty broken land, and gathered seventy bushels; and cultivated land from one sowing of the 'Little Gem' pea, he got three good crops in the course of the summer.\"\n\nIn 1879 the Mounted Police broke up some land with the following results:\n\n\"Oats—492 bushels of oats were grown on eleven acres of land, sown from the middle...\"\nto the end of May. The seed sown was badly mixed and of inferior varieties or the yield would have been much greater.\n\n\"Barley—109 bushels of barley were grown on four and a half acres, also broken up last spring and sown about the end of May. The seed was four years old and not very sound, and consequently not so good as if fresh seed had been used. Both oats and barley were more or less injured by gophers and birds.\n\n\"Potatoes—602 bushels of potatoes were grown on about two acres. They were planted on the 13th of June but the weather being cold and wet at that time about one-third of the seed rotted in the ground.\n\n\"Turnips—64 bushels of turnips were grown from a quarter of a pound of seed sown broadcast on a piece of new breaking in the first week in June.\n\n\"From four pounds and ten ounces of the 'Beauty of Hebron' potatoes, planted on the 2nd of June, 481 pounds were raised.\"\nTABLE OF DISTANCES\nBETWEEN\nBATTLEFORD AND OTHER POINTS.\n\nThe following tables of distances, most of which are from odometer measurements made by Mr. W. F. King, Inspector of Surveys, will be found very useful to travellers who may see fit to come overland with their own conveyances. As may be seen from a perusal, they cover a number of different routes, thus affording the intending settler a choice, in making which he must be guided by surrounding circumstances.\n\nTROY TO BATTLEFORD.\n\n| Troy to Qu'Appelle | 19.0 |\n|-------------------|------|\n| Qu'Appelle to Touchwood Hills. |\n| Qu'Appelle to water on west side of a valley | 14.1 |\n| Wood and water | 31.5 |\n| Wood and water | 38.5 |\n| Touchwood Hills | 46.0 |\n\nTouchwood Hills to Humboldt.\n\n| Touchwood Hills to Indian Farm | 12.0 |\n|-------------------------------|------|\n| Edge of plain | 23.9 |\n| Lake on plain | 27.0 |\n| Lake between two hills | 50.4 |\n| Western edge of Alkali Plain | 55.4 |\n| Pyramid Hill | 68.7 |\n| Humboldt Telegraph Office | 1.3 |\nHumboldt to Carlton.\n\nVia Gabriel's Crossing.\n\nHumboldt to crossing of telegraph line ........................................... 13.2\nTo the lake in the hills ................................................................. 20.8\nVermilion Lake (salt) ................................................................. 27.7\nGabriel's Crossing, South Branch .................................................. 56.6\nStobart, Duck Lake ................................................................. 68.4\nFort Carlton ................................................................. 82.0\n\nHumboldt to Carlton.\n\nVia Batoche's Crossing.\n\nHumboldt to Keespitanow Mill .................................................. 8.6\nRavine and lake ................................................................. 31.3\nNew trail to Prince Albert turns off, and the Fort à la Corne and Carlton trail comes in .................................................. 41.8\nTrail to Garlepy's crossing turns off .................................................. 50.4\nBatoche's Ferry ................................................................. 63.6\nStobart, Duck Lake ................................................................. 69.6\nFort Carlton ................................................................. 83.4\n\nCarlton to Battleford.\n\nVia the River Trail.\n\nFort Carlton to where trail from Gabriel's Crossing to Battleford joins .................................................. 19.4\nCamping ground at Elbow .................................................. 42.4\nTrail to plains turns off .................................................. 48.4\nSugar Bush Creek ................................................................. 49.4\nA running creek ................................................................. 54.4\nEagle Hill Creek ................................................................. 60.4\nA small creek—plain trail to Battleford turns off .................................................. 60.4\nMiddle trail to Battleford turns off .................................................. 61.4\nAstronomical station, Battleford .................................................. 110.4\nTelegraph office, Battleford .................................................. 110.4\n\nCarlton to Battleford.\n\nVia Plain or Outer Trail.\n\nFort Carlton to where trail leaves main Battleford trail .................................................. 60.4\nA trail from the Elbow of the South Branch comes in .................................................. 70.4\nDISTANCES.\n\nSummit of Eagle Hills ............ 76.9\nLarge lake to the north of trail... 86.3\nCome into the Cypress Hills and Battleford trail .................. 124.8\nTelegraph office, Battleford ....... 127.8\n\nHumboldt to Battleford.\n\nVia Gabriel's Crossing and the River Trail.\nHumboldt to Gabriel's Ferry .......... 56.6\nJoin Carlton and Battleford Trail 88.6\nPlain trail to Battleford turns off 124.7\nBattleford .................................. 175.3\n\nHumboldt to Battleford.\n\nVia Clarke's Crossing.\nHumboldt to Clarke's Crossing of the South Branch ................. 60\nSlough on telegraph line ............. 98\nEagle Hill Creek ....................... 105\nBattleford .................................. 155.8\n\nRecapitulation.\n\nTroy to Battleford, via Gabriel's Crossing and Carlton .................. 339.8\nVia Gabriel's Crossing, and thence direct to Battleford .................. 321.6\nVia Batoche's Crossing and Carlton ........................................ 340.5\nVia Humboldt and Clarke's Crossing ...................................... 302.1\n\nMOOSE JAW TO BATTLEFORD.\n\nVia the Elbow of the South Branch.\nMoose Jaw to Elbow of South Saskatchewan .................................. 75\nEagle Hill Creek ....................... 160\nJoin outer Carlton and Battleford trail ...................................... 172.7\nBattleford .................................. 225\n\nNOTE—There has been no ferry established on the South Branch on this route as yet,\nalthough it was stated that a scow would be put on this season. Till this is done, then, this route would be practically useless, especially to strangers in the country.\n\nSWIFT CURRENT CREEK TO BATTLEFORD.\n\nSwift Current to South Branch........... 30\nTramping Lake.......................... 160\nBattleford .................................. 200\n\nNOTE.—This trail is a new one, having only been laid out this spring by Goodwin Marchand, who went to Swift Current for freight for A. McDonald & Co., and the distances are only approximated. Messrs. A. McDonald & Co. have also placed a large scow on the South Branch, and have called it the City of Battleford.\n\nBATTLEFORD TO EDMONTON.\n\nNorth Side.\n\nBattleford to Fort Pitt.\n\nBattleford to Narrows of Battle and Saskatchewan Rivers............. 4.2\nTrail leaves telegraph line.............. 14.3\nSouth side trail goes off ............... 36.8\nBig Gully Creek.......................... 57.1\nQuaking Bog............................... 67.6\nSmall Creek............................... 78.8\nSouth side Saskatchewan River......... 92.5\nFort Pitt................................. 93.0\n\nFort Pitt to Victoria.\n\nFort Pitt to Two Big Hills.............. 17.3\nLac la Biche trail turns off............ 47.3\nDog Rump Creek.......................... 64.0\nDISTANCES\n\nSaddle Lake Creek ........................................... 94.0\nSandy Creek—Lac la Biche trail turns off .................. 114.4\nMill Creek or Smoking Lake Creek .......................... 126.5\nVictoria .................................................................. 129.8\n\nVictoria to Edmonton\n\nVictoria to a stony creek ...................................... 16.8\nSucker Creek ....................................................... 22.0\nVermilion Creek .................................................. 36.0\nSturgeon River ..................................................... 50.6\nFort Saskatchewan ................................................ 57.6\nFort Edmonton ..................................................... 74.6\n\nRecapitulation.\n\nBattleford to Fort Pitt .......................................... 93.0\nFort Pitt to Victoria .............................................. 129.8\nVictoria to Edmonton ............................................ 74.6\nBattleford to Edmonton ......................................... 297.4\n\nSouth Side.\n\nPolice Barracks, Battleford, to lake in the hills, good water ........ 8.6\nA small lake ......................................................... 13.8\nForks of Pitt and Edmonton trails .................................. 37.4\nEnd of Willow Hills—cross telegraph and enter prairie ............... 73.8\nCross telegraph to north side .................................. 79.8\nFourth principal meridian ........................................ 84.5\nWestern edge of prairie—wood and water ............................. 105.5\nEastern edge of timber in bluffs .................................. 124.9\nCreek in valley ...................................................... 136.3\nVermilion River, three and a half feet deep and thirty feet wide .... 143.1\nCreek ................................................................. 160.3\nXIV. Base Line ..................................................... 160.5\nCreek ................................................................. 161.7\nCreek and marsh between two lakes .................................. 164.7\nCreek ................................................................. 166.9\nBATTLE RIVER VALLEY.\n\nCreek ........................................... 168.8\n\" .................................................. 171.5\nOld hunting lodge on shore of lake ........ 172.5\nCreek ............................................. 175.7\n\" .................................................. 181.7\n\" .................................................. 191.1\nLake .............................................. 196.9\nCross Victoria trail ......................... 198.0\nWestern edge of plain ....................... 201.8\nCreek, four feet deep, thirty feet wide—fish in this ............ 209.0\nCreek ............................................. 209.5\nCreek—same as 209—in marsh ............... 209.9\nCreek, western edge of bush ............... 217.0\nCreek ............................................. 219.8\n\" .................................................. 224.8\nBeaver Creek, twenty feet wide and four feet deep—bridge ....... 228.5\nCreek, three and a half feet deep, fifteen feet wide—bridge ...... 229.9\nXIV. Base Line .................................. 238.5\nCreek ............................................. 240.5\nCreek—bridge .................................. 250.4\nFort Saskatchewan ............................ 251.2\nCreek ............................................. 259.6\nRat Creek ....................................... 266.7\nCreek ............................................. 268.8\nFort Edmonton ................................. 270.6\n\nBATTLEFORD to PRINCE ALBERT\n\nBattleford to Carlton.\n\nBattleford to Carlton ......................... 110.9\n\nCarlton to Prince Albert.\n\nCarlton to southern edge of Pines .......... 16.8\nNorthern edge of Pines ....................... 19.7\nHalf-way house ............................... 26.7\nSt. Laurent trail comes in ................... 27.2\nNorth Branch Beaver Creek .................. 29.6\nMoore's Mills .................................. 49.0\n\nTotal distance Battleford to Prince Albert ......................... 159.8\n### DISTANCES\n\n#### BATTLEFORD TO OTHER POINTS\n\n| Location                        | Distance |\n|---------------------------------|----------|\n| Battleford to Red Deer Forks    | 100      |\n| Maple Creek, C. P. R.           | 257      |\n| Fort Walsh                      | 292      |\n| Sounding Lake                   | 80       |\n| Fort Calgary                    | 300      |\n| Blackfoot crossing              | 275      |\n| Fort Macleod                    | 350      |\n| Carlton, north side trail       | 85       |\n| Saskatoon                       | 115      |\n| Jackfish Lake                   | 30       |\n| Turtle Lake                     | 65       |\n\n#### OTHER USEFUL TABLES.\n\n##### Fort Pitt to Lac la Biche.\n\n| Location                                      | Distance |\n|-----------------------------------------------|----------|\n| Fort Pitt to where Lac la Biche trail leaves Victoria trail | 47.3     |\n| The Two Muskegs                               | 66.7     |\n| East Branch of Dog Rump Creek                 | 72.0     |\n| Pheasant Creek                                | 82.8     |\n| Beaver River                                  | 101.9    |\n| Birch Lake                                    | 115.3    |\n| Trail from Victoria comes in                  | 121.2    |\n| Duck Lake Creek                               | 123.2    |\n| Hay Creek                                     | 131.8    |\n| Little Beaver River—trail ferks to left here to Roman Catholic Mission | 136.0    |\n| H. B. Co.'s post, Lac la Biche                | 140.9    |\n\n##### Victoria to Lac la Biche.\n\n| Location                                      | Distance |\n|-----------------------------------------------|----------|\n| Victoria to Sandy Creek, where trail leaves Victoria and Pitt trail | 15.4     |\n| Stony Creek                                   | 28.3     |\n| Come into Saddle Lake trail                   | 30.8     |\n| Goodfish Lake Settlement                      | 43.2     |\n| Whitefish Lake Creek                          | 47.5     |\n| \"Mission                                      | 51.7     |\n| Beginning of thick bush                       | 55.6     |\n| Beaver River and end of bush                  | 60.4     |\n| Little Beaver River                           | 66.1     |\n| Come to Pitt and Lac la Biche trail           | 67.6     |\n| H. B. Co.'s Post, Lac la Biche                | 87.8     |\n### Fort Pitt to Sounding Lake\n\n| Location                        | Distance |\n|---------------------------------|----------|\n| Fort Pitt to south side of river| 0.5      |\n| Old trail to Edmonton turns off | 1.6      |\n| Big Gully Creek                 | 17.8     |\n| Cross telegraph line            | 33.2     |\n| Battle River                    | 55.2     |\n| Sounding Lake                   | 120.0    |\n\n### Fort a la Corne to Prince Albert\n\n| Location                        | Distance |\n|---------------------------------|----------|\n| Fort a la Corne to Paonan Creek | 3.5      |\n| Forks of Saskatchewan River    | 19.9     |\n| Moore's Mill, Prince Albert     | 51.5     |\n\n### Edmonton to Lac Ste. Anne\n\n| Location                        | Distance |\n|---------------------------------|----------|\n| Fort Edmonton to toll gate at St. Albert | 9.1      |\n| Carrot River                    | 13.4     |\n| Forks of Lac la Nonne trail     | 20.8     |\n| Indian Farm                     | 22.8     |\n| Creek and slough                | 35.3     |\n| Sturgeon River                  | 37.3     |\n| Lac Ste. Anne                   | 47.6     |\n\n### Fort Macleod to Fort Calgary\n\n| Location                        | Distance |\n|---------------------------------|----------|\n| Fort Macleod to Willow Creek    | 2.5      |\n| The Leavings                    | 28.5     |\n| Mosquito Creek                  | 51       |\n| High River                      | 66       |\n| Sheep Creek                     | 76       |\n| Pine Creek                      | 89       |\n| Fish Creek                      | 94       |\n| Fort Calgary                    | 102      |\n\n### Fort Calgary to Edmonton\n\n| Location                        | Distance |\n|---------------------------------|----------|\n| Fort Calgary to the Lone Pine, edge of plain | approximate 62 |\n| Red Deer River                  | 93       |\n| Blind Man's River               | 100.5    |\n| Forks of Rocky Mountain House trail | 115.5   |\n| Wolf Creek                      | 120      |\n| Battle River                    | 125.5    |\n| Big Stone Creek—Indian Farm     | 155      |\n| Pipestone Creek                 | 158      |\n| White Mud River                 | 187.5    |\n| Edmonton                        | 194      |\nFURNITURE\n\nThe Pioneer Furniture House\n\nOF\n\nTHE BATTLE RIVER VALLEY.\n\nC. H. CLOUSTON,\n\nDealer in and manufacturer of all kinds of Furniture Repairing promptly attended to.\n\nPICTURE-FRAMING\n\nA specialty.\n\nWAREROOM—One door west of postoffice.\nBLACKSMITHING.\n\nALEX. MCKENZIE\n\nBATTLEFORD,\n\n(SASKATCHEWAN TERRITORY),\n\nGENERAL BLACKSMITH.\n\nAll kinds of iron work done on short notice. Special attention given to\n\nHORSE-SHOEING\n\nAlso Agent for the\n\nWatson Manufacturing Co., Ayr.\nPROSPECTORS AND TOURISTS\nVISITING THE\nBATTLE RIVER VALLEY\n\nWill find comfortable quarters and good board at the\nRESTAURANT\nKEPT BY\nOtton & McKintosh\nBATTLEFORD.\n\nSPARKLING CIDER\nAND\nCHOICE CIGARS\nAlways on hand.\nRICHARD C. LAURIE,\n(Graduate of the Royal Military College of Canada),\n\nSURVEYOR AND CIVIL ENGINEER,\n\nBATTLEFORD.\n\nBoundary lines run, Town Sites surveyed, and Timber and Coal Limits located.\n\nWILLIAM LAURIE,\n\nConveyancer, Real Estate Agent,\n\nNOTARY PUBLIC,\n\nBATTLEFORD.\n\nCollections and commissions promptly attended to. Correspondence solicited.\nIMPORTANT\nTo Merchants, Traders\nAND OTHERS.\n\nF. Fraser Tims,\nREGINA\nAND\nSwift Current Creek,\nWHOLESALE AND RETAIL\nDEALER,\n\nHas received a large portion of his Spring Stock of\n\nFlour, Provisions, Hardware,\nCanned Goods, Tinware, Ready-made Clothing, Hats and Caps, Boots and Shoes, and general supplies, the whole of which he offers to the Trade and general public at reasonable prices.\n\nHave no more tedious and expensive delays awaiting stocks from Winnipeg, but purchase from the\n\nPioneer Store of Swift Current Creek\nRICHARDSON & MACDONALD,\n\nREAL ESTATE,\n\nCommission & Insurance Agents\n\nBATTLEFORD.\n\nAGENTS FOR THE\n\nMASSEY MANUFACTURING CO.\n\nA complete stock of\n\nAGRICULTURAL IMPLEMENTS\n\nConstantly on hand.\n\nCorrespondence solicited.\nADVERTISEMENTS.\n\nTHE SASKATCHEWAN HERALD\n\nIs published at Battleford, Saskatchewan Territory, Canada, every alternate Saturday, and sent postage paid to any address in Canada, Great Britain or the United States, for Two Dollars a year, payable in advance.\n\nPublic interest is now being strongly directed towards the Saskatchewan and Battle River Valleys, and every issue of THE HERALD contains enough matter of great value to intending settlers and persons identified with the progress of the country to make it an indispensable visitor at their homes and offices, and worth many times its cost.\n\nADVERTISING RATES:\nOne column one year $100; half-column, $50; quarter column, $25\nShorter advertisements inserted at $8.50 an inch (12 lines) a year. Payments quarterly.\n\nPROFESSIONAL CARDS, set solid, $5 a year for six lines; each additional line, per year. Position on first page.\n\nBUSINESS ADVERTISEMENTS, displayed or solid, $8.50 a year for each inch of space (12 lines) occupied; $5 for six months; $3 for three months.\n\nTRANSIENT ADVERTISEMENTS — Ten cents a line for the first, and five cents for each subsequent insertion. Payment to accompany order. No advertisement inserted for less than $1.\n\nSPECIAL NOTICES in reading matter, ten cents a line, and at end of the reading matter, five cents a line each insertion, for half yearly or yearly contracts.\n\nSpecimen copies sent free on application to the publisher.\n\nAddress P. G. LAURIE,\nBATTLEFORD,\nSaskatchewan Territory, Canada.\nSMART & GILLIS,\nBUILDERS AND CONTRACTORS\nBATTLEFORD, W.\n(SASKATCHEWAN TERRITORY)\n\nWe are now prepared to undertake anything in our line including the manufacture of all styles of\n\nSASH, DOORS,\nETC., ETC.\n\nESTIMATES FURNISHED.\n\nPLANS AND SPECIFICATIONS\nPromptly prepared.\nOGEMAH MILLS.\n\nHaving purchased one of the celebrated\n\nATEROUS SAWMILLS,\n\nwith plenty of power and all the latest improvements, we are now manufacturing\n\nLUMBER, LATH AND SHINGLES\n\nOf all sizes and descriptions.\n\nLUMBER PLANED & MATCHED\n\nAnd delivered in quantities at any point on the river below the mills.\n\nWe will also have a\n\nGRIST MILL\n\nAttached, which will also include the latest improvements, when satisfaction will be guaranteed.\n\nThe above mills are situate at the junction of the Saskatchewan and Turtle Rivers, eighteen miles above Battleford, and are surrounded by the best farming country in the North-West.\n\nCOLERIDGE & Co.\n\nP.O. address—BATTLEFORD.\nWHOLESALE and RETAIL\n\nA. McDonald & Co.\n\nCorner Main Street and Saskatchewan Ave.,\n\nBATTLEFORD,\n\nGeneral Merchants\n\nImporters and dealers in\n\nDRY GOODS, GROCERIES,\n\nClothing, Boots and Shoes, Hardware,\nCrockery, etc.\n\nTHE LARGEST, BEST ASSORTED\n\nAnd newest stock in the Territories.\n\nTOWN LOTS\n\nFOR SALE.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30315.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 123, "total-input-tokens": 179892, "total-output-tokens": 39987, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2277, 3], [2277, 3387, 4], [3387, 3387, 5], [3387, 3838, 6], [3838, 4263, 7], [4263, 4714, 8], [4714, 6181, 9], [6181, 7101, 10], [7101, 7377, 11], [7377, 8463, 12], [8463, 9941, 13], [9941, 11424, 14], [11424, 12838, 15], [12838, 14303, 16], [14303, 15803, 17], [15803, 17300, 18], [17300, 18715, 19], [18715, 20193, 20], [20193, 21689, 21], [21689, 23081, 22], [23081, 24575, 23], [24575, 26080, 24], [26080, 27481, 25], [27481, 28937, 26], [28937, 30406, 27], [30406, 31700, 28], [31700, 33213, 29], [33213, 34635, 30], [34635, 36129, 31], [36129, 37486, 32], [37486, 39324, 33], [39324, 41295, 34], [41295, 42788, 35], [42788, 44540, 36], [44540, 46244, 37], [46244, 47804, 38], [47804, 49204, 39], [49204, 50682, 40], [50682, 52142, 41], [52142, 54112, 42], [54112, 55989, 43], [55989, 57958, 44], [57958, 59795, 45], [59795, 61279, 46], [61279, 62808, 47], [62808, 64370, 48], [64370, 65785, 49], [65785, 67469, 50], [67469, 69220, 51], [69220, 71000, 52], [71000, 73198, 53], [73198, 74653, 54], [74653, 76111, 55], [76111, 77548, 56], [77548, 78991, 57], [78991, 80352, 58], [80352, 81770, 59], [81770, 83308, 60], [83308, 84654, 61], [84654, 86060, 62], [86060, 87537, 63], [87537, 89009, 64], [89009, 90384, 65], [90384, 91831, 66], [91831, 93331, 67], [93331, 94785, 68], [94785, 97482, 69], [97482, 99354, 70], [99354, 101307, 71], [101307, 102552, 72], [102552, 104014, 73], [104014, 105481, 74], [105481, 106907, 75], [106907, 108903, 76], [108903, 110458, 77], [110458, 111793, 78], [111793, 113770, 79], [113770, 115375, 80], [115375, 117348, 81], [117348, 119979, 82], [119979, 121958, 83], [121958, 123457, 84], [123457, 125473, 85], [125473, 127548, 86], [127548, 129207, 87], [129207, 130787, 88], [130787, 132419, 89], [132419, 134005, 90], [134005, 135835, 91], [135835, 137670, 92], [137670, 139856, 93], [139856, 141717, 94], [141717, 143409, 95], [143409, 145287, 96], [145287, 145287, 97], [145287, 145287, 98], [145287, 145287, 99], [145287, 145287, 100], [145287, 147045, 101], [147045, 148898, 102], [148898, 149791, 103], [149791, 150807, 104], [150807, 153361, 105], [153361, 154823, 106], [154823, 156111, 107], [156111, 158310, 108], [158310, 160295, 109], [160295, 162697, 110], [162697, 164964, 111], [164964, 165206, 112], [165206, 165438, 113], [165438, 165650, 114], [165650, 165998, 115], [165998, 166518, 116], [166518, 166736, 117], [166736, 168224, 118], [168224, 168495, 119], [168495, 169161, 120], [169161, 169466, 121], [169466, 169466, 122], [169466, 169466, 123]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]