[{"id": "c3ff20f664b67e628076cc54e304967e5c967269", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/\nCommentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nNational Library of Canada\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nBibliothèque nationale du Canada\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"A SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE SASKATCHEWAN COUNTRY OF THE NORTH-WEST OF THE DOMINION OF CANADA, PRESENTED TO THE WORLD AS A NEW AND INVITING FIELD OF ENTERPRISE FOR THE EMIGRANT AND CAPITALIST; ITS COMPARISON AS SUCH WITH THE WESTERN STATES AND TERRITORIES OF AMERICA; ITS CLIMATE, SOIL, AGRICULTURE, &c.; MINERALS AND MANUFACTURING FACILITIES, AND THE ELEMENTS OF ITS FUTURE GREATNESS AND PROSPERITY; POINTS BEST SUITED FOR IMMEDIATE SETTLEMENT; LATEST INFORMATION, OUTFIT, PRICES, &c.\n\nBY THOMAS SPENCE,\nClerk of the Legislative Assembly of Manitoba.\n\nMontreal:\nPRINTED BY LOVELL PRINTING AND PUBLISHING COMPANY\n\n1877\nOPINION AND REPORT\n\nOF A\n\nSELECT COMMITTEE ON AGRICULTURE OF THE LEGISLATIVE ASSEMBLY OF MANITOBA,\n\nPRESENTED 16TH FEBRUARY, 1877.\n\nCOMMITTEE ROOM, 16TH FEBRUARY, 1877.\n\nMR. THOMAS SPENCE, Clerk of the Legislative Assembly, by request, this day appeared before the Committee on Agriculture, and read from the manuscript his new pamphlet, entitled: THE SASKATCHEWAN COUNTRY OF THE NORTH-WEST OF THE DOMINION OF CANADA, AS A NEW FIELD OF ENTERPRISE FOR THE EMIGRANT AND CAPITALIST, AND ITS VAST SUPERIORITY COMPARED WITH THE WESTERN STATES OF AMERICA.\n\nIn the opinion of this Committee the pamphlet is ably written, and evidently with great care, in drawing the comparison with other fields for emigration which have hitherto occupied the attention of the world. It contains a great deal of important and reliable information of a new character, and cannot fail to attract great attention to the Saskatchewan Country as a new and yet almost unknown field of enterprise for the emigrant and for the investment of capital at the present time.\n\nWith this view the Committee beg respectfully to recommend in the interests of the whole Dominion Mr. Spence's pamphlet to the favorable consideration of the Government of Canada at a time when the liberal distribution of such an economic medium is so much required to enlighten the press and those interested in emigration in Europe, as well as to draw public attention to the vast resources of that fertile portion of the North-West through which the Canadian Pacific Railway will pass for a thousand miles fed by a large agricultural and industrious population.\n\nThe Committee consider that Mr. Spence's efforts are deserving of every encouragement, his former pamphlet on the resources of Manitoba having proved highly beneficial to the interests of the Province, having given the utmost satisfaction to those who, through its means, were induced to immigrate, and have since had practical opportunities of proving its correctness.\n\n(Signed,) J. NORQUAY,\nChairman and Minister of Public Works.\n\nAttest.\n(Signed,) J. ROYAL,\nProvincial Secretary.\nPREFACE.\n\nTO THE INTENDING EMIGRANT.\n\nThe time having arrived when the Government of Canada may fairly invite immigration from all parts of the Old World into that vast and magnificent portion of Canada presently known as the Saskatchewan Country of the North-West Territories, presenting a new and vast field for prosperous settlement and commercial enterprise: the richest prairie lands in the world, within twenty days travel of \"home\" and twenty minutes communication by telegraph.\n\nNo longer is the United States without a competitor; no longer will their prairie lands occupy the attention of the whole world. Canada can now cry aloud in every language, to millions: Ho, every one that wants a farm, come and take one, where you will enjoy the best of health, happiness and freedom under the flag \"that's braved a thousand years,\" and where the industrious will soon attain that end to which all men aspire, INDEPENDENCE.\n\nA careful perusal of this work will amply corroborate this assertion. The ancient maxim has been \"Settle up the country, and the people will build railways if they want them;\" Canada's new and better maxim is now \"Build railways, and the country will soon be settled,\" and she is now building a railway from the Atlantic to the Pacific, which will run for a thousand miles through this rich and beautiful country.\n\nNo longer need the ignorant and unwary emigrant be led astray by the influences of glowing advertisements, and floods of pamphlets in every language, and the kind offer of free railway passages, to induce him to invest his little all in almost valueless railway lands in the far Western States and Territories of the United States—this pamphlet is offered to the intending emigrant that he may pause and consider well, before deciding that momentous question in his life, Where shall I emigrate to? for his own and his family's best future interests. The information which it\nembraces will be found generally useful and valuable to the immigrant after his arrival in the new home. If any neighboring intending emigrant friend of the reader wants a copy, or several, let him apply to the address of any of the gentlemen named at the end of this pamphlet—it will be sent to him promptly. In addition to its usefulness, it will be found strictly reliable, correct, and disinterestedly written, beyond that of hoping to benefit the thousands of the writer's fellow-beings of any nationality or creed, who are now toiling for daily bread in the old world, afraid of hard times, sickness, and old age.\n\nEncouraged by the great success which attended his pamphlet on \"Manitoba and the North-West,\" 60,000 of which have been distributed in Europe and the older Provinces of Canada, and which received not only the most flattering notices of the Press, but the grateful thanks of those who have by experience proved its reliability and correctness.\n\n\"When what are wild woods now, be cities then:\nWhen lands, as yet scarce known to human ken,\nShall be the fertile field, the shaven lawn,\nOr garden reeking in the dews of dawn,\nThen shall they bless the hand that guided here\nWho e'er, or what he be, the sturdy Pioneer.\"\n\nAs an illustration, the writer would only state in conclusion that at the time of the issue of his first pamphlet in 1872, what was then almost a wild prairie with a few scattered houses, is now one of the fastest rising young cities of America, and the capital and commercial centre of flourishing Province of Manitoba, as well as the gateway of the Great North-West to the Rocky Mountains.\n\nIn this pamphlet there is, for obvious reasons, no attempt at strictly scientific classification.\n\nIts humble, but perhaps more practical, purpose will have been secured if it shall help to make the North-West of the Dominion of Canada better known both at home and abroad.\n\nST. BONIFACE, Manitoba, 16th February, 1877.\n\nT. S.\nINTRODUCTORY.\n\n\"Though there are softer airs and brighter skies,\nAnd art despoiled, in splendid ruin lies,\nCan glittering gems, or polished marble vie\nWith all this fresh and youthful majesty?\nBroad lakes, bold mountains, prairie, rock and flood,\nThese nature formed, in wild fantastic mood,\nThen careless smiling threw away her mould.\"\n\nThat vast and magnificent portion of the North-West of the Dominion of Canada, known as the Saskatchewan Country, now presents to the intending emigrant and the capitalist, who desire to reap the reward of industry and enterprise, the most inviting field for immigration in the world, one which, in comparison with that of the Western States of America, or the more distant colonies of Australia and New Zealand, now claims the serious consideration of all who are interested in the important question of Emigration.\n\nWith this object in view, and to supply the desired information regarding this vast, but yet scarcely known, garden of the world, this pamphlet is offered for careful perusal.\n\nIts assertions regarding the great agricultural capacity of the country are amply corroborated by the highest known testimony given in another part, and its general correctness and reliability fully attested by the opinion of a Select Committee on Agriculture of the Legislative Assembly of Manitoba, which will be found preceding the Preface.\n\nThe projection and actual commencement of the construction of the Canada Pacific Railway, now being vigorously prosecuted, from the Atlantic to the Pacific, through the very heart of this vast rich valley of the Saskatchewan Country, has caused Canada to make rapid strides within a few years, in claiming her rank as among the first of competitors for the hardy and enterprising emigrants of all nations, offering to millions free and happy homes, health and prosperity. One of the most eminent of American statesmen, the late Hon. William Seward, at the time Prime Minister of the United States, thus writes his impressions of Canada, twelve years ago, since which time she has developed herself under one Federal Government into a country greater in extent than even the United States. He wrote the following words:\n\n\"Hitherto, in common with most of my countrymen, as I suppose, I have thought Canada, or, to speak more accurately, British America, a mere strip lying north of the United States, easily detached from the Parent State, but incapable of sustaining itself, and therefore ultimately, nay right soon, to be taken on by the Federal Union, without materially changing or affecting its own development. I have dropped the opinion as a national conceit. I see in British North America,\nstretching as it does across the continent from the Atlantic to the Pacific, and occupying a belt of the temperate zone—a region grand enough for the seat of a great empire—in its wheat fields in the West, its invaluable fisheries and its mineral wealth. I find its inhabitants vigorous, hardy, energetic and perfected by British constitutional liberty. Southern political stars must set, though many times they rise again with diminished splendor, but those which illuminate the pole remain for ever shining, for ever increasing in splendor.\"\n\nNo one acquainted with British America, and especially with that part now known as the North-West Territories, particularly that portion of which we are now writing, will dispute the justice of the parallel. It is to be a first-class new world power with its Danube of the Saskatchewan and its Baltic and Black Sea of Lake Winnipeg and Lake Superior. The North-West of Canada demands its development independently, not from one nationality or section, it invites men from all parts of the earth, perfectly well aware that they might find nearer resting places. But they do not occupy Eastern lands, they are Westward bound. Its improved communications have made it easily accessible, within twenty days of Liverpool, and the time has come when it may fairly invite the hand of man to dress it and to keep it, not as in Illinois, Nebraska, Kansas, and other Western States, where it is the custom to sell lands on four years' credit, a fourth of the cash down and the balance in three annual payments—but to the North-West of Canada you are invited to become, without purchase, a free holder, and take rank among the lords of the soil.\n\nAn American gentleman in St. Paul, Minnesota, who lately visited this country and who was somewhat surprised to find the amount of British go-aheadism in a country he had previously heard of only as a wilderness, thus writes to his old home in the East to remove the erroneous impression, that St. Paul, in Minnesota, is the extreme corner of habitable creation. He says:\n\n\"No better grain growing country exists than extends from 500 miles North and 600 miles West, while 1500 miles North-West from this city streams are open and pasturage is green a full month earlier than here. Nor is this vast North-West of Canada unapproachable. You can to-day take rail from here to the Northern Pacific crossing of the Red River, and there take your choice of seven steamboats, of from 300 to 600 tons each, to Fort Garry, Manitoba. At Fort Garry take a lake propeller (like those on La'le Erie and other Eastern lakes) through Lake Winnipeg to its Northern end, 275 to 300 miles, then take a river steamer and go up the Saskatchewan and its Northern branch to Fort Edmonton and beyond, 1400 miles, or within 450 or 500 miles of the waters of the Pacific Ocean, and when you get there (Edmonton) you can go ashore and telegraph the same day to your home in the Connecticut valley, or the Berkshire hills in England. These are facts, the wires are up, and the boats are running.\"\n\nGEOGRAPHICAL POSITION AND EXTENT.\n\nThat section of the North-West Territory known as the Saskatchewan being of primary importance for the extension of settlement and commerce, and the highway of the Inter-Oceanic Railway, now building to the Pacific Ocean, may be briefly described as bounded on the South by the line of latitude 49° North, the Northern boundary of the United States; on the West by the crests of the Rocky Mountains, which\ndivide it from the Province of British Columbia; on the North by the parallel of latitude 55° North, and on the East by the Province of Manitoba and Lakes Winnipeg and Manitoba. Its length from its Eastern boundary Westward to the sources of the Saskatchewan is eight hundred miles more or less. Its breadth Northward from latitude 49° to 55° is four hundred and sixty miles. It contains an area of about two hundred and eighty thousand square miles, that is to say, an area equal to that of France and Germany, or about six times that of the State of New York. It is highly important to observe that the greater portion of this section of territory, within the boundaries stated, is as rich in soil as any part of America, and presents the very great advantage of being ready for the plough without the trouble of clearing and taking out stumps and stones, the less favorable portions being well adapted for stock raising, with the exception of a narrow strip running parallel with the United States Northerly boundary line, which is described as a bare and treeless prairie, covered only with short grass and very deficient of water, the soil light and sandy. In so great an extent of country, there is naturally much variety in character and quality of soil. A celebrated traveller, the Rev. Father De-Smet, a Jesuit missionary, many years ago thus summarizes his reflections on the appearance of the Saskatchewan district. He says:\n\n\"The entire region in the vicinity of the Rocky Mountains, serving as their base for fifty or sixty miles, is extremely fertile, abounding in forests, plains, prairies, lakes, streams, and mineral springs. The rivers and streams are innumerable, and on every side offer situations favorable for the construction of mills.\"\n\nReferring to the valley of the great river he further says:\n\n\"Are these vast and innumerable fields of hay to be ever destined to be consumed by fire or perish in the autumnal snows? And these abundant mines of coal and iron, can it be that they are doomed to remain for ever inactive? Not so. The day will come when some laboring hand will give them value; strong, active and enterprising people are destined to fill this spacious void. The wild beasts will ere long give place to our domestic animals; flocks and herds will graze in the beautiful meadows that border the numberless hills, valleys and plains of this extensive region.\"\n\nTo-day Canadian enterprise is actively developing this land of promise. Already the electric wire that connects the civilization of the whole world penetrates to its Western limit, and in a few years the iron horse will follow its trail, carrying the food of man to the East and the West, as well as the wealth of India and China.\n\nTHE SASKATCHEWAN—ITS TRIBUTARIES AND COUNTRY.\n\nIn the present sparsely settled state of the country, the early pioneers of immigration will have great advantages in being able to appropriate the best lands and most eligible situations for wood and water, and from the tendency of population being governed primarily by the direction of the navigable waters, so will the pioneer lay the foundation of thriving towns along their great extent, to the foot of the Rocky Mountains. The North and South branches of the Saskatchewan, or Ki-sis-kah-chewun (the river that runs swift), have their sources in the Rocky Mountains, but a few miles apart. From their nearly common source the\nNorth branch diverges North-Eastward, and the South branch, or Bow River, South-Eastward, till at two hundred and fifty miles due Eastward they attain a distance of three hundred miles from each other; the South branch being then within forty-five miles of the frontier; then gradually approaching, they meet at five hundred and fifty miles Eastward from their source.\n\nThe length of the North branch, by the manuscript field notes of a survey of it, is $772\\frac{1}{2}$ miles, and that of the South or main branch is about 810 miles.\n\nFrom their junction the course of the main Saskatchewan to Lake Winnipeg is 282 miles by field notes, this makes the whole length of the Saskatchewan, from the source of the South branch, (which is the main stream) to Lake Winnipeg 1092 miles. Following the North branch the total length to Lake Winnipeg 1054$\\frac{1}{2}$ miles. The foregoing figures are the result of a careful astronomical survey, made many years ago, by David Thompson, the North-West Company's astronomer, and this gives occasion to remark that the length of rivers and distances generally are much exaggerated in new countries. Much of the extraordinary length and size attributed to rivers in the United States is due to this, and errors respecting them from this source have found their way into standard works, such as Johnson's Physical Atlas. Its magnitude will be more fully understood by the following comparison:\n\n- It is 184 miles longer than the Ganges.\n- \" 1164 \" \" Rhine.\n- \" 1649 \" \" Thames.\n- And only 376 miles shorter than the Nile.\n\nIn considering the character of the Saskatchewan and its country, it will be advisable to limit this pamphlet to a brief description of the best localities in its country suitable for more immediate settlement. Ascending from its mouth, at Lake Winnipeg, there are over two miles of strong current up to the Grand Rapids, which are nearly three miles in length, with a descent of $43\\frac{1}{2}$ feet. The country in the vicinity of the Grand Rapids has a considerable depth of good soil, and the banks of the river high; there is also abundance of timber for fuel and building, and game of all kinds, and between this point and the Lake would be very favorable for the establishment of fisheries. The Pas mission, situated at the mouth of the Pasquia River, is about 85 miles in a direct line from Lake Winnipeg; the banks here are ten or twelve feet high at low water, and the soil a rich dark mould over a drift clay. At this place there is at present a small but prosperous settlement, and a Church of England mission has been established for many years.\n\nThe next most favorable country for agriculture commences at a point about 140 miles above this, the soil being rich and the timber of a fair quality. The soil consists of a rich alluvial deposit, ten feet in thickness above the water on both sides of the river, and well wooded with large poplar, balsam, spruce and birch, some of the poplars measuring $2\\frac{1}{2}$ feet in diameter. This character of country continues till approaching Fort à la Corne, about 150 miles, and is well watered and drained by many fine creeks. A few miles West of this is the new and\nflourishing settlement of Prince Albert, situated on the South side of the North branch of the Saskatchewan, about 45 miles below Carleton. This settlement extends for about 30 miles along the Saskatchewan, the farms fronting on the river and extending back two miles. The settlers, though principally Scotch, are composed of English, Irish, German, Norwegians, Americans and Canadians. This settlement has increased rapidly, especially within the last two years, and now numbers about 500 souls, and the people are beginning to farm extensively. Wheat sells there at $2 per bushel; barley, $1.50; oats, $1.50; potatoes, $1.25; and butter, 37c. per lb. Several of the settlers have commenced stock-raising on a large scale, and the facilities for this branch of industry are of no ordinary kind, inasmuch as there is abundance of hay and pasture. As an evidence of the prosperity of the settlement, it may be mentioned that good horses, waggons, light waggons, and buggies are found everywhere. The settlers have also the most approved agricultural implements, mowers, reapers, threshing machines, &c. There are mills and stores and two schools in the settlement, one in connection with the Presbyterian Church, of which there are two, and the other in connection with the Episcopal Church. The North and South Saskatchewan run in a North-Easternly direction for about 120 miles before they unite. The channels are almost parallel, and with an average distance of 20 to 25 miles apart. The land between the rivers is all good. Along the South side of the South branch the land also is good and fertile.\n\nThe seasons are much the same as in Manitoba, winter begins about the middle of November, and breaks up about the 10th April. The rivers are generally open about the 20th of April. Snow falls to the depth of about two feet, and continues all winter.\n\nThe climate is exceedingly healthy, and, owing to the rolling character of the prairie and the loamy nature of the soil, ploughing can be commenced whenever the snow is off the ground, and especially on land cultivated for any length of time. Summer frost never injures anything. The wheat, barley, oats, roots and vegetables raised at this settlement could scarcely be excelled in any part of the world.\n\nThe country drained by the North branch of the Saskatchewan from Prince Albert up to Edmonton—a distance of over five hundred miles by the river—as well as that by its extensive tributary, the Battle river, (near the mouth of which the town of Battleford, the new capital and seat of the North-West Territorial Government, is located, and afterwards more fully referred to) is of a general uniform character, more or less interspersed with woods sufficient for many years to come, but not sufficient to supply the wants of a large population, but this drawback will be overcome with the gradual development of the country, and opening up of the vast Coal deposits and the Forests Westward on its immediate banks; and by river or rail coal can be carried in all directions for every purpose; and it is highly probable, as will be pointed out hereafter, that we have the most extensive, perhaps the finest, coal fields in the world.\n\nRegarding this, His Grace Archbishop Taché, in his valuable work on the North-West, and writing from his own practical knowledge and great travelled experience throughout the North-West, says:\n\"The coal fields which cross the different branches of the Saskatchewan are a great source of wealth, and form the settlement of the valley in which nature has multiplied picturesque scenery that challenges comparison with the most remarkable of its kind in the world, &c., &c., &c.\"\n\nA further quotation from His Grace's opinion of the capacity and future of the Saskatchewan country will be found in another part of this pamphlet with that of other eminent testimony.\n\nEdmonton and its neighboring country presents, without doubt, a great field for colonization and commercial enterprise, and must become one of the most important stations of the Canadian Pacific Railway. Gold mines or washers range up and down the North Saskatchewan for about one hundred and thirty miles, Edmonton being the central point of this distance. Those men who wash its bars for gold make on an average four dollars per day. About thirty miles North of Edmonton, and 20 miles by the course of the river below Fort Edmonton, is a French Canadian settlement named Fort Jarvis where a detachment of the Mounted Police is quartered. This settlement is beautifully situated, the soil generally very rich, wood and water in abundance. It is pretty well settled along the banks of the Saskatchewan to Fort Edmonton, as also along the banks of a beautiful stream known as Sturgeon Creek, which runs nearly parallel for about forty to fifty miles, where St. Albert near its head is reached, forming a neck of land, with an average width between the two rivers of about eight miles. Crossing this neck from Fort Edmonton, in a North-Westerly direction, is rather an extensive lake which bears the name of Grand Lac, on the shores of which is situated St. Albert, a very prosperous French Canadian and Half-breed settlement. Here is a fine Roman Catholic church, and a convent with several Sisters of Charity. This settlement is presided over by a Mission of French Roman Catholic clergymen of the order of Oblats, and the See of a Bishopric, headed by Bishop Grondin, of the same order and nationality, and a gentleman of culture and high mental excellence. Attached to this mission is a large good school, which is at present attended by about eighty children of the settlement, which was established in 1861 by the celebrated author of several valuable works on the Indian languages of the North-West, the Rev. Father LaCombe, St. Albert, the beautiful site for the mission, having been selected by His Grace Archbishop Taché, and named after the Patron Saint of the former zealous missionary. After ascending the Sturgeon Creek, forty-five miles, is met the beautiful and extensive Lake St. Anne. This lake is one of the most lovely in the North-West, and abounding in white fish of the best and largest quality. There are numerous settlers round the lake, principally French Half-breeds, and in the North end of the lake is situated another Roman Catholic mission, established in 1844 by the Rev. Mr. Thibault. The land is equally good here, but for several miles from the lake heavily timbered.\n\nTHE FORKS OF THE NORTH AND SOUTH BRANCH.\n\nImmediately above the Forks, the South branch of the Saskatchewan is only one hundred and eighty yards in width, but the current is swift.\nand the average depth seven feet and a half; there it is less in volume and not half the width that it is two hundred and twenty miles further up. This important point has every prospect of becoming a large commercial and manufacturing centre, the surrounding country being of unsurpassed fertility, and commanding valuable natural resources, through the immense system of navigation which centres there. Looking Northward the country beyond the North branch of the Saskatchewan is densely covered with an unusually large growth of spruce, tamarack, birch and poplar timber, in sufficient quantities to supply a settlement of almost any extent for many years, after which the extensive forests at the base of the Rocky Mountains, manufactured into lumber and floated down the same river, will be available for its needs in building, and the unrivalled coal beds of the Upper Saskatchewan will furnish abundance of cheap fuel. To the South and West spreads the beautiful “Park Country,” which has given the Saskatchewan farmers natural fields of generally the richest land, dotted with lakes and groves. In 1874, an English gentleman, on a hunting tour, attracted by the advantages offered by this location, established, at great cost, in the settlement of Prince Albert, a steam saw and grist mill, the first in the Saskatchewan country. Such enterprises and such men are the mile-stones of a country’s progress towards settlement and empire. Hereafter many mills will be established on the fertile banks of the Saskatchewan, through the enterprise of other capitalists to follow. About 60 miles by the river, above its junction with the North branch, is another good settlement called St. Laurent, and here the main high road crosses the river for this distance from the mouth. The two branches run nearly parallel, forming a neck of land about 20 miles in width, the land being of the very best quality, prettily wooded and dotted with numerous small and pretty lakes. All this neck will rapidly fill up with settlers, presenting, as it does, unusual inducements. The present population is also principally French Half-breeds, numbering about 400. A Roman Catholic mission is established here, with two resident priests, and a school. About twenty miles West, following the main highway, is Duck Lake, one of the numerous small lakes above referred to. There is the nucleus of a very flourishing-settlement here, which will, no doubt, rapidly increase. The enterprising firm of Kew, Stobart & Co., of London, England, and Winnipeg, in Manitoba, have an extensive store and trading-post established, where settlers will be able to procure everything in the way of necessaries. The character of the country around is very similar to that described at St. Laurent. For about 130 miles up its course, or 100 miles in direct distance, its valley preserves the same character as that of the main river between the Forks and Fort à la Corne, the banks varying from 100 to 40 feet in height, exposing sandstone cliffs where cut by the bends of the river, the country on each side having a rich soil, with abundant woods in clumps and groves for a great part of the way. Above this it becomes gradually less wooded. 70 miles further up, or nearly 100 miles by its course, the “Moose Woods” are reached—a rich alluvial expansion of the low valley of the river, partly wooded with rich glades between. It is 25 miles in length and 6 or 8 miles in breadth, and\nwell adapted for stock-raising. 35 miles above this the South branch approaches the Cypress Hills, which extend one hundred and sixty miles. This section is also well adapted for stock-raising, being covered with fine timber, abounding in excellent grass, and well watered. **Battle River** enters the North branch of the Saskatchewan, about one hundred and seventy miles above the Main Forks. It drains a large part of the country between the North and South branches. It has its source about 10 miles from the North branch, 30 miles above Edmonton, but they are 130 miles apart at the middle of its course, and between them the pasturage is very rich. Coal presents itself there in the banks of the stream, 250 miles from its mouth. The rich prairie country which covers the course of the Battle River and the Northerly part of Red Deer River, and includes the North branch from the Forks up to 30 miles above Edmonton, has a breadth of about 100 miles at the Forks, 70 miles at the mouth of Battle River; 150 miles at its middle course, and about 70 at its source, beyond which the belt of fertile prairie becomes gradually narrower, and, turning to the Southward up the course of the Red Deer River, becomes merged in the fertile region on the skirts of the mountains below Bow Fort on the South branch. It is bounded on the North by the line of the Mick woods, which sweep Northerly parallel to the course of the North branch, at the distance of 40 to 20 miles beyond it, then coursing to the Southward, crosses it about 30 miles above Edmonton, and, continuing in that direction, strikes the mountains near Bow Fort, making a circuit from the Forks of about 700 miles. The climate of this section is decidedly milder than that of Manitoba. Battle River runs, from its junction, nearly parallel with the North branch of the Saskatchewan for about 8 miles, making a tongue of land between, and on this tongue or point is the new town of Battleford, the site of the new capital and seat of Government, and is also headquarters of the Mounted Police. At this point the Canadian Pacific Railway will cross the river, touching the Saskatchewan again near Edmonton, about 200 miles West; and there is direct communication by telegraph to all parts of the world. Public buildings, stores and dwellings are in rapid progress, and it has every prospect of becoming an important commercial centre, yet, wonderful to relate, two years ago Battleford was a place without a name or even a sign of civilization. Canada may indeed now say a great future beckons us, as a people onward. She has accomplished one great jump in the march of civilization. The first message by telegraph from this hitherto unknown region to inform the outer world of its existence was despatched on the 6th day of April, 1877.\n\nThe Red Deer, Bow and Belly Rivers are tributaries of the South Branch of the Saskatchewan, having their source in the Eastern slope of the Rocky Mountains, between parallel 50° and 52° N., and drain a beautiful and most fertile region, eight times greater in extent than the present Province of Manitoba, and already a settlement is flocking into this inviting country.\n\nFort Calgary, a station of the Mounted Police, on the Bow River, situated at the junction of Bow and Elbow Rivers, on a beautiful flat as level as a cricket ground, and of immense extent. Buffalo in gre\nthis the South branch hundred and sixty miles, being covered with well watered. Battle Swan, about one hundred grains a large part of the It has its source above Edmonton, but course, and between them half there in the banks of rich prairie country which Northerly part of Red Forks up to 30 at the Forks, 100 miles at its middle course, the belt of fertile prairies Southward up the course, fertile region on the skirt branch. It is bounded which sweep Northerly the distance of 40 to 25 ward, crosses it about 30 that direction, strikes the Forks of about milder than that of nearly parallel with the 8 miles, making a tongue the new town of Battle government, and is also head joint the Canadian Pacific Saskatchewan again near direct communication buildings, stores and dwellings, stores and dwel prospect of becoming a to relate, two years ago sign of civilization beckons us, as a people in the march of civilization shitherto unknown regi despatched on the 6th day\n\ntributaries of the South source in the Eastern slope ° and 52° N., and drain greater in extent than settlement is flocking in\n\nPolice, on the Bow River, Rivers, on a beautiful extent. Buffalo in gre abundance, and the rivers filled with fine mountain trout of great size, and the climate much milder than in Manitoba or the North Saskatchewan, which, if not quite equal for farming in grain raising, will, from its vast extent of rich nutritious grasses, become the great stock-raising country of the North-West. It takes but little capital to make a commencement by which a man may soon become independent. At Fort McLeod, a few miles further South on the Belly River, where two troops of the Mounted Police are stationed, they have a theatre and billiard table, which proves how civilization is gradually stealing over the \"Great Lone Land.\"\n\nRoot or Carrot River rises in rich lands on the South flank of the Lumpy Hill of the Woods, 60 miles South-West from the Forks of the Saskatchewan and 13 miles from the South branch, and flows chiefly through a wooded country with many lakes, generally from 30 to 45 miles South of the Main Saskatchewan, into which it falls after a course of about 240 miles. Prof. Hind estimates that there are there millions acres of land of the first quality between it and the Saskatchewan. There are several other tributaries of the Saskatchewan, but not of sufficient immediate importance to be enumerated within the limits of this guide book.\n\nOf the rivers not tributary to the Saskatchewan, but running within its country, and which invite settlement to their rich and beautiful valleys, the most important of which is the Assiniboine, by its very winding course, is over 600 miles in length. For 220 miles in direct distance from its mouth, its course is nearly West, and above that its course for upwards of 200 miles in direct distance is North-Westerly, lying nearly parallel to Lake Winnipeg, at a distance of 240 miles West of it. At 220 miles West from its mouth, where it turns Northward, it receives its tributary, the River Qu'Appelle, which continues directly Westward 250 miles further, having its source near the elbow of the South branch of the Saskatchewan, 470 miles directly Westward from the mouth of the Assiniboine, at the City of Winnipeg in Manitoba. Ascending the Assiniboine from its mouth, for upwards of 70 miles, to the Sand Hills, the country through which it flows within the Province of Manitoba is of the same rich alluvial character as the Red River. Beyond that is a sandy tract, 50 miles in length Westward. Then for about 100 miles further West, to where it turns Northward at the mouth of the Qu'Appelle, and for nearly 50 miles North of that, the Assiniboine may be considered the boundary line between the rich prairie region and the inferior and light sandy soil South and West of it.\n\nBetween the Sand Hills and the Qu'Appelle, the Assiniboine receives on the North side five considerable tributaries, from fifty to one hundred and fifty miles in length. Their courses being through a very fertile region, one of them, the Rapid River, or Little Saskatchewan, indicates their general character. This stream is beautiful and rapid, navigable for one hundred miles for canoes and bateaux, flowing through a beautiful valley, large open flats frequently occurring on both sides of the river, where the richness of the grass and the beauty of the various flowers prove the great fertility of the soil.—places marked out by nature to be cultivated and inhabited by man. To its junction with the Assiniboine on the out-\nskirts of the present limits of the Province of Manitoba, there is abundance of good-sized poplar and balsam spruce, sufficiently large for building and farming purposes. The main high road to the Saskatchewan courses this river at a point about twenty miles by its course from its confluence with the Assiniboine, and from thence Westward continues through a beautiful and fertile country, dotted with numerous small lakes, the principal one being Shoal Lake, situated about 35 miles Westward and half way to Fort Ellice. From the Little Saskatchewan, where the road crosses the Assiniboine, this Lake is distant about one hundred and seventy-five miles from the City of Winnipeg. On reaching it the eye of the traveller is suddenly caught with a view of a magnificent sheet of pure crystal-like water stretching away to his right some four miles, surrounded by gravelly and sandy shores, and fringed here and there with thick belts of timber, mostly poplar. This is said to be only one of a succession of beautiful lakes stretching from the Riding Mountains, some twenty-five miles to the North, to the Assiniboine River, about thirty miles to the South. In Spring and Autumn especially, myriads of wild fowl are to be seen popping over the surface of these waters, which also abound with fish. All of this, in connection with deer hunting, (which can be had within easy distance), affords excellent pastime for the sportsman. The advantages for settlement, particularly for stock raising, although the excellence of the soil for agricultural purposes cannot be doubted, are not only numerous, but strongly inviting. The picturesque and undulating country for many miles around, thickly dotted with bluffs of poplar, with occasional large marshes intervening, afford abundance of both fuel and hay for the settler. There is also a post office and mail station established here in connection with the mail line between Winnipeg and Edmonton. It is also a station of the Mounted Police, and will no doubt become very soon a place of some importance.\n\nThe upper affluent of the Assiniboine, known as the Qu'Appelle or Calling River, from its mouth at Fort Ellice runs through a delightful valley, and of which the expansion forms eight lakes, where the best kind of white fish abounds, and, although somewhat sparsely wooded, is well fitted for settlement. The lakes and ponds of this country abound with ducks and geese; the hillsides of the valley are deeply ravined and wooded. The wild hop grows very luxuriously on the belt of woods on the South side of the lakes, till the fourth lake is reached, when the prairie becomes absolutely treeless. The Souris or Mouse River enters the Assiniboine from the South in the midst of a very lovely undulating country, near where the Rapid River enters. It was in following up the Souris River for a part of its course that the early explorers of Red River also discovered the head of the great Missouri River, and thence they pushed their exploration to the Rocky Mountains before any civilized man had seen their western slopes, at least in that latitude. For many miles from its mouth it flows through a beautiful undulating country, and vast prairie of a dark rich green, and well wooded. The valley is narrow, but rich and beautiful; above that, Westward, and South, where it enters the United States, it in a great measure may be considered generally of a valueless character, lying on the edge of the great American desert.\nThe Swan River enters a bay on the North end of Lake Winnipegos, and is about two hundred miles in length by its course. Near its mouth there are some very valuable salt springs, as also in Lake Winnipegos, the brine of which, taken from the surface, is as strong as any of the celebrated brine salt works in the United States. The brine is very pure, yielding upwards of a bushel of salt from 30 to 40 gallons of water from the surface, proved by the practical experience of the writer. These springs will prove a valuable source of wealth, when, with the rapid development of the country, extensive fisheries are established and communications improved. Ascending the river from Swan Lake, which is about six miles from its mouth, for two miles or so the banks are rather low; in the succeeding ten miles they gradually attain a height of nearly one hundred feet, where landslips occur in many places; the banks expose an alluvial soil of great depth, resting on drift clay. About thirty miles above Swan Lake the prairie region fairly commences. There the river winds about in a beautiful valley, the banks of which rise to the height of eighty or one hundred feet. Beyond this an apparently unbroken level extends on one side for a distance of fifteen or twenty miles to the Porcupine Hills, and for an equal distance on the other to the high table land called the Duck Mountain. From this South-Westward to Thunder Mountain, a traveller says: \"The country is the finest I have ever seen in a state of nature; the prospect is bounded by the blue outline of the hills named; in the plain, alternate wood and prairie present an appearance more pleasing than if either entirely prevailed; it seemed as if it wanted but the presence of human habitations to give it the appearance of a highly cultivated country.\" The line of the Pacific Railway crosses the Swan River in this region.\n\nLAKES MANITOBA AND WINNIPEGOOS.\n\nThese lakes are each one hundred and twenty miles in length, the greatest breadth of Manitoba is twenty-four miles, and of Winnipegos twenty-nine; taken together they extend two hundred and twenty miles from North to South. The head of Winnipegos being known as the Mossy Portage, which is only about four and a quarter miles in length, through low wet ground, and connects with Cedar Lake on the Main Saskatchewan. This important connection, which is now occupying the attention of the Government of the Dominion, would form a water line of communication of about one thousand five hundred miles in length from the City of Winnipeg, in Manitoba, to the foot of the Rocky Mountains.\n\nBEAUTY, FERTILITY AND CLIMATE. OFFICIAL AND SCIENTIFIC TESTIMONY.\n\nIn the capacity of this pamphlet as merely a hand book or guide, affording only such general information of a practical nature as will be useful to the intending pioneer, immigrant and capitalist in the present state of the country, it merely aims to point out the best and most suitable localities for more immediate settlement throughout that vast region, and the class best suited for success in those localities.\nIt would be absurd to expect any country of this vast extent to be all equally fit to receive the plough at once. If only one-third is here pointed out as awaiting the industrious hand of man to ensure him independence, the other two-thirds are parts requiring draining or partial clearing. It would also be absurd to suppose it all equally fertile, as there is a considerable difference between the deep beds of black vegetable mould which generally prevail, and of course there are occasional bad spots and poor sandy ground, which must be found in all countries; but prominent among the questions proposed by the emigrant or capitalist seeking a new home in a new country are those concerning the climate, its temperature, adaptation to the culture of the grand staples of food, and its healthfulness. The grand staples of the North-West of Canada will be Bread, Beef, and Wool.\n\nMany readers of this little work who may be intending to emigrate, and have a longing desire to realize the romance and happiness of a life in the Western States of America, drawn to that by the glowing and attractive pictures and representations which have been held out throughout Europe of the riches of those far Western States—Iowa, Kansas and Nebraska to-day contain thousands who would gladly leave for anywhere, if not to return to their native land, if they could; fever and ague, poor and unsaleable land, dearly bought, have brought the inevitable end, ruin. The writer, alas, has seen too many letters telling the pitiful tale, and as a serious warning to intending emigrants and capitalists in Europe, desiring to settle upon or invest in United States Railway lands, we select extracts from an official report by General W. B. Hasen, U. S. A., and recently published in the New York Tribune, especially as, on the other hand, the opinions and testimony of the most experienced travellers and authors of the highest standing are given regarding that portion of the North-West of the Dominion of Canada to which the title of this pamphlet is confined. He says, speaking in the first place of the lands of the Northern Pacific Railway:\n\nFor two years I have been an observer of the efforts upon the part of the Northern Pacific Railroad Company to make the world believe this section to be a valuable agricultural one, and with many others I have kept silent, although knowing the falsity of their representations, while they have pretty fully carried their point in establishing a popular belief favorable to their wishes.\n\nWhen reading such statements of its fertility as appear in the article entitled \"Poetry and Philosophy of Indian Summer,\" in that most estimable periodical, Harper's Monthly of December, 1873—in which are repeated most of the shameless falsehoods so lavishly published in the last two years, as advertisements in the interests of that company, and perhaps written by the same pen—a feeling of shame and indignation arises that any of our countrymen, especially when so highly favored with the popular good-will and benefits, should deliberately indulge in such wicked deceptions. The theoretical isothermals of Captains Maury and Blodget, which have given rise to so much speculation, and are used so extravagantly by those who have a use for them, although true along the Pacific coast, are not found to have been true by actual experience and observations, in this middle region.\nThe past season, as seen by the meteorological report, has been exceptionally rainy and favorable for agriculture here, and the post has with great care, and by utilizing all the available season, made an extensive garden with the following results. The garden is situated immediately on the river bank, about two feet above high water. Potatoes, native corn, cabbage, early sown turnips, early peas, early beans, beets, carrots, parsnips, salsify, cucumbers, lettuce, radishes and asparagus have grown abundantly and have matured; melons, pumpkins and squashes have not matured; tomatoes did not turn red; American corn (early) reached roasting ears; onions, with wheat and oats, matured at Fort Berthold, D. T., one hundred and fifty miles below, in the Missouri River. I am told by those who have been here a long time that this may be taken as a standard for what may be expected the most favorable seasons in the immediate bottoms of the streams. The native corn matures in about ten weeks from planting. It puts out its ears from six to eight inches from the ground, and has a soft white grain without any flinty portion, and weighs about two-thirds as much as other corn.\n\nMy own quarters are situated on the second bench of the banks of the Missouri, at about fifty feet above that stream, and six hundred yards away from it. And to raise a flower garden ten feet by forty, the past two years, has required a daily sprinkling of three barrels of water, for which we were repaid by about three weeks of flowers.\n\nThe site of this garden is supposed to be exceptionally fruitful, but I have before me a letter from Mr. Joseph Anderson of St. Paul, Minn., who was hay contractor at this post in 1872. His letter states that in order to find places to cut the hay required by his contract that season, some nine hundred tons, he was compelled to search over a space of country on the North-side of the river, twenty-five miles in extent in each direction from the post, or some four hundred square miles, and that there was none thick enough to be cut for as great a distance beyond. Respecting the agricultural value of this country, after leaving the excellent wheat-growing valley of the Red River of the North, following Westward one thousand miles to the Sierras, excepting the very limited bottoms of the small streams, as well as those of the Missouri and Yellowstone, from a few yards in breadth to an occasional water-washed valley of one or two miles, and the narrow valleys of the streams of Montana already settled, and a small area of timbered country in North-West Idaho (probably one-fifteenth of the whole,) this country will not produce the fruits and cereals of the last, for want of moisture, and can in no way be artificially irrigated, and will not, in our day and generation, sell for one penny an acre, except through fraud or ignorance; and most of the here excepted will have to be irrigated artificially. I write this, knowing full well it will meet with contradiction, but the contradiction will be a falsehood. The country between the one-hundredth meridian and the Sierras—the Rio Grande to the British possessions—will never develop into populous states because of its want of moisture. Its counterpart is found in the plains of Northern Asia and in Western Europe. We look in vain for those expected agricultural settlements along the Kansas and Union Pacific Railroads, between these two lines,\nand 20 years hence the search will be quite as fruitless. We have in Nevada and New Mexico fair samples of what these populations will be. My statement is made from the practical experience and observation of 18 years of military service as an officer of the army, much of which has been upon the frontier; and having passed the remainder of my life as a farmer. For confirmation of what I have here said, I respectfully refer the reader to General G. K. Warren, of the Engineer Corps of the Army, who made a scientific exploration of this country, extending through several years, and has given us our only accurate map of it; or to Prof. Hayden, for the past several years engaged upon a similar work. The testimony of Gov. Stephens, Gen. Fremont, and Lieut. Mullans, is that of enthusiastic travellers and discoverers, whose descriptions are not fully borne out by more prolonged and intimate knowledge of the country.\n\nHerr Hassa, the agent of the Berlin and Vienna banks, sent out to examine the country, could easily say the country is good so long as he advised his people to invest no money in it; and it is doubtful if that remark was based upon a sufficiently authoritative investigation of the country to merit the credence given it. Certainly it is incorrect; and especially valueless is the testimony of men of distinction of our own country who are not practical agriculturists, but have taken journeys in the fruitful months of the year to the Red River of the North, to the rich valleys of Montana, or to the enchanting scenery of Puget Sound, except upon those particular points.\n\nI am prepared to substantiate all I have here said, so far as such matters are susceptible of proof, but, from their nature, many things herein referred to must, to many people, wait the action of the great solvent—Time.\n\nIn a later report, covering a greater extent of country, he quotes the testimony of persons who have examined the country as \"Confirming my repeated statement that the country lying between 100 West longitude and the Sierra Nevada Mountains, all the way from Mexico to the British possessions in the North, is, in an agricultural sense, practically valueless, except in a few exceptional cases, where water can be used for irrigation; and that, even with this process, not much more than one acre in many thousands upon the average, can be made available on account of the scarcity of water.\"\n\nGeneral Hazen proceeds:\n\n\"The past season has been one of unusual and somewhat remarkable rains in Dakota, as well as in many other parts of the world. This has given fair crops of roots, vegetables and other grains, without irrigation, and has given the far struggling farmers about Bismarck great hopes for the future; but the officers of the land office told me in November that they are selling very little land, and that, even if the crops of the last very exceptionally favorable year could be taken as a criterion, general agriculture could not be made profitable in that region, remembering the suffering of those who have sought homes to the Westward of the limit of sufficient rainfalls. The great need of correct information upon the subject to enable Congress to dispose intelligently of questions involving the capabilities of this country, the building up of new and populous States, such as Wisconsin, Iowa and Missouri, will no longer be seen on our present domain, and all calculations based upon such a thing are false, while all\nextraneous influences brought to bear upon emigration, to carry it West of the\none hundredth meridian, excepting in a very few restricted localities, are wicked\nbeyond expression and fraught with misery and failure.\"\n\nFrom this it is not difficult to see that the entire expansive move-\nment of population on the American Continent will be concentrated\nin the direction of our fertile valleys, of the Saskatchewan and Peace\nRivers; and the Canadian Pacific Railway running through a country\nfertile for more than two-thirds of its whole length, can be fed by an\nindustrious and wealthy population, besides developing its immense\nmineral wealth, East and West.\n\nLet us now draw a comparison between the resources offered to\nthe emigrant by the new Western States or Territories and that of the\nfertile regions of the North West of Canada.\n\nIn 1858 Capt. Palliser was requested by the Under Secretary of\nState for the Colonies to state his opinion on the country he was en-\ngaged in exploring, and he describes the region drained by the Saskat-\nchewan in the following words:\n\n\"The extent of surface drained by the Saskatchewan and other tributaries\nto Lake Winnipeg, which we had an opportunity of examining, amounts in round\nnumbers to one hundred and fifty thousand square miles. This region is bounded\nto the North by what is known as the strong woods, or the Southern limit of the\ngreat circum-arctic zone of forest which occupies these latitudes in the Northern\nHemisphere. This line, which is indicated on the map, sweeps to the North-\nWest from the shore of Lake Winnipeg and reaches its most Northerly limit about\n54° 30' N. and longitude 119° W., from where it again passes to the South-\nWest, meeting the Rocky Mountains in latitude 51° N., longitude 115° W.\nBetween this line of the strong woods and the Northern limit of the true\nprairie country there is a belt of land varying in width, which at one period\nmust have been covered by an extension of the Northern forests, but which has\nbeen gradually cleared by successive fires.\n\n\"It is now a partially wooded country, abounding in lakes and rich natural\npasturage, in some parts rivalling the finest park scenery of our own country.\nThroughout this region of country the climate seems to possess the same\ncharacter, although it passes through very different latitudes, its form being\ndoubtless determined by the curves of the isothermal line. Its superficial extent\nembraces about sixty-five thousand square miles, (whether geographical or statute\nhe does not state; if the former, it would be about eighty-five thousand statute), of\nwhich more than one-third may be considered as at once available for the pur-\nposes of the agriculturist. Its elevation increases from seven hundred to four\nthousand feet as we approach the Rocky Mountains at Edmonton, which has an\naltitude of 3000 feet. Wheat is cultivated with success. The least valuable\nportion of the Prairie Country has an extent of about eighty thousand square\nmiles, and is that lying along the Southern branch of the Saskatchewan, South-\nward from thence to the boundary line, while its Northern limit is known in\nthe Indian languages as the 'edge of the woods,' the original line of the woods\nbeing invaded by fire.\n\n\"It is a physical reality of the highest importance to the interests of British\nNorth America that this continuous belt can be settled and cultivated from a few\nmiles West of Lake of the Woods to the passes of the Rocky Mountains, and any\nline of communication, whether by waggon or railroad, passing through it, will\neventually enjoy the great advantage of being fed by an agricultural population from\none extremity to the other. No other part of the American Continent possesses an\napproach even to this singularly favorable disposition of soil and climate.\n\n\"The natural resources lying within the limits of the Fertile Belt, or on its\nEastern borders, are themselves of great value as local elements of future wealth\nand prosperity; but, in view of a communication across the continent, they acquire\nparamount importance. Timber, available for fuel and building purposes, coal, iron ore are widely distributed, of great purity and in considerable abundance; salt, in quantity sufficient for a dense population. All these crude elements of wealth lie within the limits or on the borders of a region of great fertility.\"\n\nHis Grace Archbishop Taché, of St. Boniface, whose long residence and travelled experience throughout the North-West, speaking of the Saskatchewan Country, says:\n\n\"The coal fields which cross the different branches of the Saskatchewan are a great source of wealth, and favor the settlement of the valley in which nature has multiplied picturesque scenery that challenges comparison with the most remarkable of its kind in the world. I can understand the exclusive attachment of the children of the Saskatchewan for their native place. Having crossed the desert, and having come so short a distance from civilized countries, which are occasionally supposed to have a monopoly of good things, one is surprised to find in the extreme West so extensive and so beautiful a region. The Author of the universe has been pleased to spread out, by the side of the grand and wild beauties of the Rocky Mountains, the captivating pleasure grounds of the plains of the Saskatchewan.\"\n\nConfining his remarks to the capabilities for stock raising, His Grace further adds, referring to the great extent of pasturage:\n\n\"The character and richness of its growth equalling the finest clover. It is known that in cold countries grass acquires a nutritive power which its juices have not time to develop in warmer climates.\"\n\nCaptain W. J. S. Pullen, R.N., also speaking of the Saskatchewan, says, comparing with other countries:\n\n\"I have been in, viz., Australia, America, North and South India, &c., that I have no hesitation in agreeing with Father de Smet, Mons. Borgeau, Blakiston and many others, that there is a most extensive portion of the country so long governed by the Hudson's Bay Company ready and offering a good field for colonization.\"\n\nLord Milton, who spent some time in the Saskatchewan Country, says:\n\n\"As an agricultural country its advantages can hardly be over-rated. The climate is milder than that of the same portion of Canada which lies within the same latitudes, while the soil is at least equal, if not of greater fertility. Coal of good sound quality is abundant in the Saskatchewan, Battle, Pembina and other Rivers. In some places the beds are of enormous thickness, and may be worked without sinking, as it often crops out along the river banks. Cereals of almost every description flourish even under the rude cultivation of the Half-breeds. The same may be said of all the root crops which are ordinarily grown in England, Canada or the Northern States of America.\"\n\nMr. W. B. Cheadle, an English gentleman who accompanied Lord Milton, also says:\n\n\"At Edmonton, eight hundred miles distant from Fort Garry, near the Western extremity, wheat grows with equal luxuriance, and yields thirty to fifty bushels to the acre, in some instances even more. The root crops I have never seen equalled in England; potatoes get to an immense size, and yield enormously. Flax, hemp, tobacco, all grow well; all the cereals appear to flourish equally well; plums, strawberries, raspberries and gooseberries grow wild. The herbage of the prairie is so feeding that corn is rarely given to horses or cattle. They do their hard work, subsist entirely on grass, are most astonishingly fat; the draught oxen resemble prize animals at a cattle show. The horses we took with us were\nturned adrift at the beginning of winter, when snow had already fallen; they had been over-worked and were jaded and thin. In the spring we hunted them up, and found them in the finest condition, or rather too fat. The soil in La Belle Prairie, where we built our hut for the winter, was four feet deep, and free from rocks or gravel—the finest loam. The climate is that of Upper Canada, or perhaps rather milder. The summer is long and warm, the weather uniformly bright and fine; with the exception of occasional showers, a wet day is almost unknown. The winter is severe and unbroken by thaw, but pleasant enough to those able to house and clothe themselves warmly.\"\n\nProf. John Macoun, M.A., Botanist, who thoroughly explored the Saskatchewan and Peace River Country, says:\n\n\"In Crofton's Trans-Continental Tourists' Guide occurs the passage, speaking of the Prairie West of Antelope, on the line of the Union Pacific Railway, 'We now enter on the best grass country in the world,' and further on he says: 'The country is destined at no distant day to become the great pasture land of the continent.' \"Now,\" says Prof. Macoun, \"I have passed over these plains from Laramie to Antelope, which are represented as being the best grazing lands in the world, and which are now supporting thousands of cattle, and they bear no more comparison to our plains (the Saskatchewan) than a stubble field does to a meadow. While they have 1000 miles of sage plains (valueless), for bunch grass soon dies out when pastured, and sage brush takes its place, we have over 1000 miles, from East to West, of land covered at all times of the year with a thick sward of the richest grass, and which is so nutritious as to keep horses in good condition, though travelling, as ours did, at the rate of forty miles per day.\"\n\nFurther on he says of the Saskatchewan:\n\n\"That there is a great uniformity respecting soil, humidity and temperature throughout the whole region, is apparent from the unvarying character of its natural productions. Spring flowers were found on the plains April 11th, and the frogs croaking the same evening. During 20 years in Ontario, he never observed our first spring flower (Hepatica triloba) as early as that except twice.\"\n\nAgain he says:\n\n\"It requires very little prophetical skill to enable any one to foretell, that very few years will elapse before this region will be teeming with flocks and herds.\"\n\nThe Rev. George M. Grant, in \"Ocean to Ocean,\" recently published, says, from his own experience also of the Saskatchewan country:\n\n\"The climatological conditions are favorable for both stock raising and grain producing. The spring is as early as in Ontario, the summer is more humid, and, therefore, the grains, grasses and root crops grow better; the autumn is bright and cloudless; the very weather for harvesting; and the winter has less snow and fewer snowstorms, and, though in many parts colder, it is healthy and pleasant, because of the still dry air, the cloudless sky and bright sun. The soil is almost everywhere a peaty or sandy loam resting in clay. Its only fault is that it is too rich. Crop after crop is raised without fallow or manure.\"\n\nThe concluding and more recent testimony offered is the following extract from the Speech from the Throne of His Excellency the Lieutenant-Governor of Manitoba, at the opening of Parliament, on 30th January last. Speaking of the prosperity of the Province of Manitoba, a part of the North West, he says:\n\n\"A harvest was reaped of such an abundant character, as to prove beyond all question that Manitoba is entitled to take the highest rank as an agricultural country.\"\nThe foregoing corroborating testimony must be sufficient to carry conviction to the mind of the most ordinarily intelligent intending emigrant or investor, of the great superiority, in point of soil, climate and agricultural capacity, of this vast Saskatchewan Country over that of any portion of the United States, which have risen so rapidly from the condition of a fringe of Provinces along the Atlantic to that of a mighty nation, spreading its arms across the continent.\n\nMinnesota, the best agricultural and healthiest state in America, is not equal to the soil of the Saskatchewan. Its richest part is in the valley of the Red River, and there it contracts to a narrow trough only a few miles wide, beyond which the soil is generally thin and poor; but, notwithstanding all difficulties, most of the emigrants to Minnesota are prospering. What a proud position the United States once occupied in the eyes of the whole world! \"Ho! every one that wants a farm, come and take one,\" it cried aloud, and in every language. Poor men, toiling for a small daily wage in the Old Country, afraid of hard times, sickness and old age, heard the cry and loved the land that loved them so well and offered so fair. They came in thousands, and found, too, that it kept its word; and then they came in tens and hundreds of thousands, till now less liberal offers have to be made because most of the public domain that is worth anything has been absorbed, as the testimony of General Hazen amply proves. Poverty and destitution reigns everywhere throughout the larger cities of the Atlantic, and thousands of immigrants glad to return, if they have the means, by the ship that brought them out. Now our vast virgin prairies are thrown open to the world, while there is little good land left in the United States available for settlement under the homestead laws, and Railway land which, in the Saskatchewan Country would be considered inferior, can only be purchased at enormous rates, varying from five to twenty dollars an acre, and even more. Any intending emigrant or each male member of his family over twenty-one years of age is to-day invited by Canada to come and take a farm of one hundred and sixty acres free and ready for the plough and which, in many places, would be envied even by the wealthy. Let the emigrant who may read this read it carefully and be no longer deceived by the influences of a vast army of agents paid in proportion to their success. Every principal railway-station in Europe is papered with their glowing advertisements, floods of pamphlets in every language, arrangements perfected in the minutest details for forwarding the ignorant and helpless stranger from New York and Chicago to any point he desires.\n\nThey make the doubter believe that it is better to pay their company from $5 to $20 an acre for \"the best land in the world,\" \"rich in minerals,\" \"with no long winters,\" accompanied with free passes over the railway and long credits, \"one-tenth down, the rest when it suits you,\" which the chances are, never,—loss of health and discouragement land him and his family, in the great majority of cases, in irretrievable ruin and misery. The brilliant offers and prophecies are held out as better than to take up free grants in the Saskatchewan Country of the North West of the Dominion of Canada.\nHOW TO GET THERE, AND WHO SHOULD GO THERE AT PRESENT.\n\nThe emigrant leaving Europe and arriving in Quebec or Halifax, in Canada, may travel direct through by railway to the Red River, where a splendid steamer will carry him down that river to Winnipeg, the capital and commercial centre of Manitoba, and the gateway to his destination, in whatever part of the North West that may be.\n\nThe route from Quebec by railway being as follows: by Grand Trunk via Sarnia and Port Huron to Detroit, in the State of Michigan; thence by Michigan Central to Chicago; Chicago to St. Paul by either of the lines; and from St. Paul to a point on the Red River, from which first-class steamers run down the river to Winnipeg the fare by this route being about eighty dollars, first class, by immigrant cars thirty-two dollars. The total distance from Quebec being about 2000 miles.\n\nFrom New York or Boston, by rail, to Chicago and St. Paul, as above, at about the same rate.\n\nThe most direct, cheapest, and, for the immigrant, by far the most preferable route, is from Quebec by Grand Trunk Railway to Toronto, 275 miles; thence by Northern Railway to Collingwood, on Lake Huron, 96 miles; at Collingwood a splendid steamer carries him to Duluth, at the head of Lake Superior, 695 miles, or he may take his ticket at Quebec for Lake Huron direct to Sarnia, where an equally good line of steamers runs in connection to Duluth; at Duluth he must go by the Northern Pacific Railway to a point on the Red River, 225 miles; when the Red River line of Steamers carries him to Winnipeg, in the Province of Manitoba. The total distance from Quebec by this favorite route being about 1520 miles; fare, first class, $ fare, second class, $. Later information regarding these routes should be applied for at any of the Dominion Immigration Agencies in Europe, for addresses of which see advertisement at end of this pamphlet.\n\nThose who should come to the Saskatchewan country as farmers are those who can command sufficient capital to make a fair start with, as estimated under the heading of outfit, after landing at Winnipeg. Of course agriculturists with capital are the more eligible, and particularly those who desire to go into stock raising, profiting by their experience, and who desire larger and quicker returns for labor bestowed and capital invested. At the same time, as already mentioned, the works occasioned by the gradual development of this new country and the present construction of the Great Canadian Pacific Railway, running directly for 1000 miles through the heart of the country, will afford employment to large numbers who afterwards intend to become settlers, and this work will be continually increasing for many years to come till its completion. This, therefore, will be a great inducement to those who cannot command sufficient means to commence at once comfortably on a farm.\n\nYoung people of either sex, however poor in cash, if rich in courage, hope and strength, may be encouraged to come, as they may readily obtain employment without going to the far West in the Province of Manitoba, where, even now, servant girls command from $3 to $15, equal to £1 12s to £3 per month.\nAn English writer has said: \"Formerly the richest countries were those in which the products of nature were the most abundant, but now the richest countries are those in which man is the most active.\" We may justly claim to have both essentials in full measure. Our bountiful soil ensures the first, and our bracing atmosphere the second.\n\nThe capitalist and the laboring immigrant are equally invited. The former will find ample inducements for safe and largely remunerative investments. A cordial welcome is extended to all to come and partake of the bounties which are offered to the enterprising and industrious who may aid in developing the vast resources with which nature has endowed the Saskatchewan Country. It is here, also, that may be possessed the perfect health requisite for their highest enjoyment; it is not too much to claim that it presents unequalled inducements to those in search of new homes in a new land. What are bountiful harvests of golden grain, rich and mellow fruits, and all the wealth the earth can yield, if disease must annually visit the settler's dwelling, and death take away, one by one, the loved and the young?\n\nIt is well known that some of the fairest portions of the Western States are so fruitful of the causes of disease as almost to preclude settlement.\n\nCLIMATE AND ADAPTATION TO AGRICULTURE.\n\nFrequent references are made throughout this pamphlet to the superiority and healthiness of the climate of the Saskatchewan Country. It is almost identical with that of the Province of Manitoba, therefore, in reference to that, the writer cannot do better than quote what he has already stated in a previous pamphlet on Manitoba, as follows: \"The dryness of the air, the character of the soil which retains no stagnant pools to send forth poisonous exhalations, and the almost total absence of fog or mist, the brilliancy of its sunlight, the pleasing succession of its seasons, all conspire to make Manitoba and the North-West a climate of unrivalled salubrity, and to make this the home of a joyous, healthy, prosperous people, strong in physical, intellectual, and moral capabilities, and this is sustained by the experience of its inhabitants.\"\n\nIts distinguishing features in relation to husbandry. The melon growing in open air, and arriving at perfect maturity in August and September, may be briefly explained by reference to the amount of sunlight received during our growing seasons, viz.: whilst at New Orleans in July they have fourteen hours of sunlight, we have sixteen, with much longer twilight than they, consequently our vegetation grows more rapidly than theirs, and matures much sooner. This is a beautiful law in compensation, as what we lack in heat is made up in sunlight during our summers. Changes in our temperature, it must be admitted, are sometimes sudden and violent. We are about half way to the North Pole, and subject to either extremes. This instead of being a disadvantage is rather in our favor, it gives variety, a thing times. Then again these changes are, for the reasons\nalready given, seldom pernicious. Plants and animals are armed with the proper implements for resistance. I would not infer that we are subject to hurricanes, or other violent commotions of the atmosphere, any more or as much as other places. But we have a touch at times of both extremes, a vibratory movement of the climates of the torrid and frigid zones.\n\nNotwithstanding, there is no place south of us where crops are surer, or where the quality of vegetables is better, attaining enormous sizes. Early Rose potatoes were sent from here in October, 1876, for exhibition at the International Exhibition in Philadelphia, which weighed $2\\frac{1}{2}$ to $3\\frac{1}{2}$ pounds, each, and received awards, as well as other vegetables and cereals, wheat in particular.\n\nWith the progress of the year the supply of heat and moisture slowly declines until the autumn harvest is closed. The autumnal equinox being passed, and the season of vegetable growth ended, suddenly the fall of rain is arrested, Indian summer is ushered in, and then follows the liveliest month, generally well into November, of all the year; the weather warm, the atmosphere hazy and calm, and every object appearing to wear a tranquil and drowsy aspect. A few days more and the sleeping earth lies quiet and serene, \"when winter fairly reigns, the most healthful and invigorating of the seasons, and is to many the charm of the year.\" As a further convincing proof of the great agricultural capacity of the soil, it is only necessary to state that the returns from Prince Albert and other new settlements on the Saskatchewan show a yield of 40 bushels of spring wheat to the acre, in several instances mostly off newly broken land, the average weight being about 63 pounds to the bushel. The average yield of wheat in the Province of Manitoba deduced from the local estimates is 30 bushels to the acre, while the average production in the State of Minnesota as deduced from its own official returns, and which is considered the best wheat growing State in America, is only set down at 20 bushels to the acre.\n\nIn this comparison there is certainly food for honest pride in our agricultural capacity in addition to the wheat being of a superior quality, as has been proved by large quantities having been purchased during the past season for exportation to the older Provinces, and even to the United States for seed purposes, at a high price, samples of our wheat having attracted considerable attention at the Centennial Exhibition at Philadelphia, 1876. The fact established by climatologists that \"the cultivated plants yield the greatest products near the Northernmost limit at which they will grow\" is fully illustrated in our productions. It is a well known fact that, in Southern latitudes, the warm spring develops the juices of the plant too rapidly. They run into the stalk and leaf to the neglect of the seed. Corn-maize, for example, rises 30 feet high in the West Indies; but it produces only a few grains at the bottom of a spongy cob, too coarse for human food.\n\nThe cool, late springs of Northern climates restrain the undue luxuriance of the stem or leaf, and throw the chief development of the plant into the ripening period. This remark applies equally to all the cereals, esculent roots and vegetables.\nThe following important analysis of a sample of soil of the country was made at the instigation of Messrs. Owens of Galashiels and other gentlemen of capital, practical farmers in Scotland, who recently paid a visit to this country and became so favorably impressed as to invest largely in lands, the analysis being made by Dr. Macadam, the well-known lecturer on Chemistry in the University of Edinburgh.\n\nANALYTICAL LABORATORY, SURGEON'S HALL,\nEDINBURGH, 14th Dec., 1876.\n\nANALYSIS OF SAMPLE OF MANITOBA SOIL.\n\n| Moisture | 21.364 |\n|----------|--------|\n| Organic matter containing nitrogen equal to ammonia, 23° | 11.223 |\n| Saline matter: |\n| Phosphates | 0.472 |\n| Carbonate of lime | 1.763 |\n| Carbonate of magnesia | 0.937 |\n| Alkaline salts | 1.273 |\n| Oxide of iron | 3.115 |\n| Silicious matter: |\n| Sand and silica | 51.721 |\n| Alumina | 8.132 |\n\n\"The above soil is very rich in organic matter, and contains the full amount of the saline fertilizing matters found in all soils of a good bearing quality.\"\n\n(Signed,) STEVENSON MACADAM, M.D.,\nLecturer on Chemistry, &c.\n\nTHE ADVANTAGES OF PRAIRIE LANDS TO SETTLERS.\n\nThe chief peculiar advantage of the Saskatchewan Prairie Country as a field for settlement lies in the combination it offers of prairie and wood lands; the full advantage of which can be appreciated only by those who have had practical experience of the great and continued labor required to clear off and cultivate a new farm in a wooded country, and the obstruction it presents to the making of the roads necessary for the formation of new settlements.\n\nMuch is said of the advantage of the superior supply of wood for fuel and fencing afforded by wooded countries; but these are indefinitely over-estimated by many in comparing the facilities for settlement offered by prairie lands and wooded countries respectively. Such a comparison can be best appreciated by reducing the matter to figures as far as possible.\n\nFor the benefit of those not familiar with the labor of making a farm in the back woods of the older Provinces, it may be mentioned:\n\nThe first and most obvious cause of expense, in money or labor, is the necessity of clearing off the wood, before the land can be even imperfectly cultivated, the average cost of which is three pounds five shillings an acre; but as the stumps still remain, an outlay of twenty-five\nfive shillings an acre may be set down as to be incurred afterwards, in getting rid of them. Where the stumps are of pine or the land stony, the cost will be much greater. In general, pine stumps if removed at all will cost at least five shillings a piece, and some will cost twenty-five shillings. We have here as one item, at least four pounds ten shillings an acre, of expense to be incurred, on account of the wood, before the land can be brought thoroughly under the plough.\n\nThis is the cost of those who can afford to pay for the labor of skilled back-woodsmen, accustomed to the use of the axe, who can do twice as much of that kind of work as the immigrant from Europe even though accustomed to other kind of hard labor.\n\nTo the tenant farmer, or farm laborer from Great Britain, whose time and industry, if applied to the cultivation of our rich prairie land, would be even more valuable than that of the back-woodsman, the cost of clearing wood land in money's worth of his labor will be twice as much. If he be very young he may learn the use of the axe perfectly, if not he will never learn to use it so as to be able to do as much work with it as the native back-woodsman.\n\nAs by far the greater part of the immigrants who settle in the woods have to clear their farms by their own unskilled labor, admitting even that they become gradually more proficient, the cost to them in their own labor, of clearing their farms, and removing the stumps, may, on a low estimate, be set down at five pounds ten shillings an acre.\n\nWe do not speak here of the value which their labor in clearing would command. No one would give them such a price for it. We are speaking of the value of the labor unavoidably lost by them on account of the woods.\n\nHere we have, then, to a family clearing, a farm of a hundred acres in ten or fifteen years, a loss of five hundred and fifty pounds on account of the woods.\n\nThe settler expends all this and ten or fifteen years of the best of his life, in toilsome struggles to convert his farm into such proportions of open and wooded land as the settler on our partly wooded prairie lands finds his when he first goes on it; in other words, he actually receives from the government the free gift of a ready-made farm of the richest kind. He can put as much land under the plough and reap the fruit of it soon after commencing, as the former can do after ten or fifteen years of crushing toil in clearing land, which necessarily consumes much time which he would gladly devote to more extensive cultivation and raising larger crops when the woods are not an obstruction to his doing so.\n\nBesides this relief from heavy toil and time lost in clearing there is another advantage of prairie land that operates strongly in the settler's favor, the full value of which can only be appreciated by a man who has made a beginning in the unbroken forest, an advantage which tells immediately to the personal comfort and benefit of the settler and his family—that is, the infinite abundance of the rich grass for summer and winter food for cattle, with which he is surrounded.\n\nThe new settler on our prairie land can keep as many cows, for the supply of his family with milk and butter and cheese for sale as it may\nsuit his means to purchase from the first day of his settlement; for here pasture and meadows are already in abundance before him, and in fact most places the cattle can find the chief part of their winter food for themselves, and be fat in spring.\n\nIt is not surprising, therefore, that so many European immigrants have hitherto passed through Canada to seek the prairie land of the United States. Even old and successful settlers in Canada have been tempted, and found it to their advantage to do so, although they had nothing like the advantages in point of climate and agricultural capacity which the North-West of Canada can now offer to millions; the wonderfully rapid development which the United States experience within the last quarter of a century has ceased, its vast expanses of fertile prairie land is nearly all absorbed, what little is left in private hands and railway corporations can only be purchased at enormous prices, while we are now able to offer better land free to immigrants than the United States, or any of its railway companies can offer.\n\nThe grooves worn smooth by the millions tramping westwards will hereafter change in the direction of Canada's boundless prairie lands.\n\nSTOCK RAISING AND WOOL GROWING.\n\nWithout doubt the Saskatchewan country must become one of the best grazing countries in the world. Prominent among its advantages are: 1. The richness and luxuriance of the native grasses. 2. The great extent of unoccupied land, affording for many years to come a wide range of free pasturage. 3. The remarkable dryness and healthfulness of the winter. The sleet, slush, mud and the train of diseases, which the damp and variable winters of milder climates inflict upon animals and men, are here nearly unknown. The cold dry air sharpens the appetite, and promotes a rapid secretion of fat, and a vigorous muscular development. Wool grows finer and heavier, and mutton and beef sweeter and more juicy, the effect of climate and rich herbage combined.\n\nAccording to established laws of nature, cold climates require a larger quantity and finer quality of wool or fur than warmer ones, hence the wool and fur-bearing animals are found in perfection only in northern regions. The thick coating of the sheep especially identifies it with a cold country. The excessive heat to which their wool subjects them in a warm climate, as in Australia, generates disease; the rot and other diseases so ruinous in warm and moist climates are unknown here.\n\nAlthough the winters are apparently longer the actual number of days which stock has to be fed here is no more than in Ohio, and Southern Illinois and Kansas. The washing, chilling and debilitating rains of these States are far more injurious to our stock than our severest cold.\n\nAny practical man will see that such advantages, for unlimited cattle feeding, without the labor of clearing land and raising hay crops, combined with extreme richness of soil in the valleys, are weighty effects against the coolness of the winter climate.\nIt may here be well to draw the attention of the capitalist to the fact that this prairie land is the place for steam ploughs, reaping, mowing and threshing machines; with such machinery one family can do the work of a dozen men.\n\nUTILIZING THE BUFFALO.\n\nIn connection with stock raising on the Saskatchewan, the attention of the breeder of horned stock is drawn to the opportunities offered of rearing a clear stock whose qualities may become famous.\n\nIn Nebraska today, and other parts of the West, the buffalo is being utilized for breeding purpose, with an encouraging degree of success.\n\nA western American paper asserts that buffalo cows have been crossed with short-horn bulls, and that the progeny possess superior dairy qualities. Buffalo bulls are also used for crossing with native cows. The male produce of this cross make excellent bulls, and, when crossed with good milkers of any of the milch families, the heifers yield largely of a rich quality of milk from which the finest butter can be made. In certain sections of Nebraska half and quarter bred buffalo stock is quite common.\n\nNotwithstanding the dairy stock in that state crossed originally with the buffalo were of ordinary character the half-bred yield an average of fourteen to fifteen to sixteen quarts per day, the milk being of a rich and fine flavor, making the best butter. These half-bred also take on flesh very rapidly, and make excellent beef. A remarkable feature connected with this cross of the buffalo with domestic cattle is the fact that the color of the bison and the majority of its distinguishing characteristics disappear after successive crossing. Its outward conformation is also, in process of time, in a great degree lost sight of. The hunch or lump of flesh covering the long spinous processes of the dorsal vertebrae becomes diminished with each successive cross, and will, doubtless, also disappear entirely as the original type becomes merged in the domestic animal.\n\nFurther experiments may show that decided advantages will come from these crosses, among which are increased hardiness and improved dairy qualities. Perhaps no animal with which we are acquainted possesses such remarkable properties. His migratory habits and fitness for great extremes of heat and cold are the results of natural selection and the struggle for existence for untold centuries by which he has arrived at vigor of constitution, fleetness and muscular strength rarely, if at all, met with in the ox tribe. These are qualities of great value which cannot be disregarded, and particularly when we consider the direct and indirect advantages that judicious crossings of domestic animals have bestowed upon civilization to an extent not to be calculated. A full-grown buffalo will weigh from 1,200 to 2,000 pounds and even more. In winter his whole body is covered with long shaggy hair mixed with much wool. He roams at large throughout the Saskatchewan country, particularly in the rich valleys at the base of the Rocky Mountains, and annually thousands are slain merely for his robe, which is esteemed everywhere on this continent and in Europe. It is to be hoped that the enactment of judicious laws will in future\nput a stop to the past wanton destruction of this valuable animal. The correspondent of the Turf, Field and Farm gives some interesting facts regarding the domestication of the buffalo in Nebraska.\n\nHe began with two cows and a bull, which he kept with his tame stock. In the Spring the cows calved, and in three years the calves became mothers, yielding an average of 14 quarts of the richest milk daily, for an average of five months. He adds that sufficient experiments have been made in crossing the buffalo with native and grade short-horn cattle, and have been attended with such successful results that the most sceptical people cannot fail to be satisfied, as to the advantages and value of the intermingling of breeds.\n\nThis information and suggestion will no doubt meet with appreciation by those who desire to become successful stock raisers in our Far West.\n\nDAIRY FARMING\n\nMust also become in a few years an important source of wealth in the Saskatchewan Country. It is now conducted on a very large scale in the older Provinces, in connection with cheese and butter factories for European consumption. In the Province of Ontario alone no less than 200 cheese factories being in operation, that Province deriving an income of nearly two millions of dollars a year from this single article of produce, and the quality esteemed almost as highly as the best English cheese.\n\nWith the progress of improved communications what a vast field is presented for the development of that branch of agricultural enterprise in this great grazing country.\n\nTHE BEET ROOT.\n\nBeet root sugar manufacturing will certainly, at no distant day, be a question of much interest in this part of Canada, and occupy the attention of the capitalist, for without doubt the rich deep mould of our soil is immensely superior to anything upon the continent for the production of the sugar beet.\n\nIt is the opinion of the Monetary Times that the production of beet root sugar, if prosecuted on a sufficiently large scale, could be made very profitable. A calculation is given, setting forth the estimated results of the manufacture of a thousand tons of sugar beets in the States of New York and Pennsylvania, as made by an American gentleman who has given long consideration to the subject. It is as follows:\n\n| EXPENSES |\n|-----------|\n| 1000 tons of beets at $4 per ton | $4,000 |\n| Estimated cost of manufacture at $5 per ton | 5,000 |\n| Total | $9,000 |\nRESULT.\n\n200 tons pulp at $2 per ton .................................................. $400\n30 \" syrup at $20 per ton ................................................... 600\n60 \" of sugar at $250 per ton .............................................. 15,000\n\nTotal results ........................................................................ $16,000\nFrom which deduct expenses ................................................. 9,000\n\nLeaves a profit of .................................................................. $7,000\n\nIf the manufacture of beet root sugar can be carried on so profitably in that part of America, with our greater resources, we but await the construction of railways to offer far superior advantages for such an important industry.\n\nImmense sugar beets sent from here to the International Exhibition at Philadelphia were the surprise and admiration of thousands from all parts of the world.\n\nMINERALS.\n\nReferring to the vast and inexhaustible coal beds of the Saskatchewan, Sir William Armstrong, some few years ago, raised the question in the Old Country of the possibility of the coal mines of England becoming after a time exhausted. The question was widely discussed at the time, and all became thoroughly convinced of what paramount importance to a country's prosperity were the coal fields.\n\nFrom Geological reports, and the Engineer's surveys, the Saskatchewan district possesses one of the largest coal fields in the world.\n\nBetween the 59th parallel and the North Sea, it has been calculated that there cannot be much less than 500,000 square miles that are underlaid by true coal. The average breadth of this belt is about 280 miles. In addition to the coal, this country contains rich deposits of iron ore.\n\nOn the North Saskatchewan River, coal prevails with little interruption in beds two and two and a half feet thick on the bank of the river, from a little below Edmonton, upwards for two hundred miles.\n\nOn the Pembina River, 70 miles to the West, there is a seam ten feet thick, of a very superior quality. On the Battle River it is also noted, and in the Red Deer branch of the South Saskatchewan, 170 miles from its mouth, are extensive deposits of coal, and at 100 miles further up it is there in beds so close, that, of 20 feet of strata exposed, 12 feet are coal.\n\nSpecimens of coal from various sections of the Saskatchewan Country were recently forwarded for analysis to Professor Haanel of Victoria College, Ontario, with the following result. He says:\n\n\"The specimens were the out-crop in each case, and taken from points at least 300 miles apart. The accompanying table of assays of coal from some of the principal mines of the United States and Nova Scotia are highly valuable for comparison, and when it is remembered that their samples were taken from the bed of the mine, and my specimens from the out-crop, the superior quality of the Saskatchewan coal is fully established.\"\n### Analysis of Prof. Haanel, Victoria College\n\n| Locality                  | Spec. gr. | Moisture | Vol. Matter | Fixed Carbon | Ash | Ash |\n|---------------------------|-----------|----------|-------------|--------------|-----|----|\n| I                         | 1.375     | 11.88    | 28.66       | 57.25        | 2.21| 100.00 |\n| II                        | 1.375     | 11.41    | 29.07       | 56.94        | 2.58| 100.00 |\n| III                       | 1.340     | 6.69     | 33.70       | 53.25        | 6.36| 100.00 |\n| IV                        | 1.337     | 6.89     | 33.57       | 50.90        | 8.64| 100.00 |\n| Maryland                  |           | 1.25     | 15.80       | 73.01        | 9.74| 99.80 |\n| Pennsylvania              |           | 0.82     | 17.01       | 68.82        | 13.35| 100.00 |\n| Virginia                  |           | 1.64     | 36.63       | 59.99        | 10.74| 100.00 |\n| Joggins                   |           | 2.50     | 36.30       | 56.00        | 5.20| 100.00 |\n| Springhill                |           | 1.80     | 28.40       | 56.60        | 13.20| 100.00 |\n| District of Pictou        |           | 1.750    | 25.875      | 61.950       | 10.425| 100.00 |\n| Same locality to top bench|           | 1.500    | 24.800      | 51.428       | 22.272| 100.00 |\n| District of Richmond      |           | 30       | 25          | 56.40        | 13.35| 100.00 |\n\nThe numbers I to IV are as follows:\n\n- The Pembina coal, 100 miles N.W. from Edmonton—I.\n- That from near Belly River, South Saskatchewan—II.\n- That from Belly River—III.\n- That from Saskatchewan River, near Fort Edmonton, 900 miles N.N.W. of Fort Garry—IV.\n\nI and II are bituminous coals, of a bright lustre, irregular fracture, showing, to judge from the small specimens sent, no distinct lamination, of a high spec. gr. 1.375, comparatively free from sulphur, and giving out little tarry matter upon coking.\n\nIII and IV are also bituminous, of a less spec. gr., 1.340 and 1.337 respectively; lustre, dull; distinct lamination, fracture at right angles to lamination, irregular with bright surfaces. Parallel to the plane of lamination, the slabs separated are dull. Gives out considerable tarry matter upon coking.\n\nMany other seams are found over a wide extent of country, and it is but reasonable to infer that several of these will yield excellent fuel, for even in the richest coal countries there is no such abundant outcrops as here.\n\nSurely with these riches and its vast agricultural resources, there is a great future in store for the Saskatchewan Country. Fortunate, therefore, will be the descendants of those who may now obtain a foothold within its gigantic borders, possessing as it does all the true elements of future greatness and prosperity.\n\nWith the completion of the Pacific Railway, its rapid growth and wealth will be unparalleled in the history of civilization.\n\n### The Culture\n\nAs it is a matter of importance that every immigrant in the North West should endeavor to increase instead of decrease the wood he may have on his farm, as it is a fixed fact in Physical Geography that the more the land is clothed with trees, the greater the rainfall. In Palestine and Northern Africa, what were the most fruitful countries in the\nworld 2000 years ago are now barren wastes. The cause is well known: the trees were cut down, none were planted in their place, the sun evaporated the rain before it had time to permeate the soil, and in course of time the land was given up to perpetual barrenness.\n\nAt the same time it may be well to remark that with us the long rich grass which clothes the prairies must act as a great preventive against the sun's power.\n\nThe agent which has caused the destruction of forests that once occupied many parts of the prairies is undoubtedly fire, occasioned by the carelessness of travellers and Indians camping, and the same swift and effectual destroyer prevents the new growth from acquiring dimensions, which would enable it to check their annual progress.\n\nThis, however, will soon be arrested with the advance of settlement and governmental care. In the State of Minnesota, forests have sprung up with wonderful rapidity on the prairies, as the country became settled so as to resist and subdue the encroachment of annual fires.\n\nIn view of the importance of the subject the following practical hints are offered, and will be found of value to the intending emigrant to the Saskatchewan Country.\n\nHere is the experience of an extensive farmer in the State of Minnesota, his example can be equally well followed in any part of the Saskatchewan:\n\nIn spring he covered seventy-two acres with cuttings of cottonwood, poplar and white willow, which have flourished finely, and, after two years, were from ten to fourteen feet high. At the same time he planted several bushels of seed, including two elder, oak, white and red elm, hard and soft maple and bass wood, and the sprouts from this seed in two years were three to five feet high.\n\nDIRECTIONS FROM EXPERIENCE. PREPARATION OF THE SOIL.\n\nA proper and thorough cultivation of the soil is an indisputable pre-requisite to success; without this thorough preparation, failure and disappointment are inevitable.\n\nTo secure the best results the ground must have been previously broken and the sod thoroughly decomposed, then, with a common stirring plough, the ground to be planted should be given a thorough ploughing to the depth of ten inches, after which it should be thoroughly harrowed until the ground is completely pulverized. It is recommended that the ground for a single row for a fence or for a hedge should be prepared in the above manner, in a strip eight feet wide, in the centre of which the cuttings should be set in, leaving a margin for cultivation four feet wide on each side of the cuttings.\n\nMETHOD OF PLANTING.\n\nStretch a small rope of suitable length over the exact place where it is desirable to plant the cuttings, each end of the rope to be staked firmly to the ground. The ground immediately beneath the rope should be smoothed off with a small iron rake. The planter should then take\nup as many cuttings as he can conveniently carry under one arm and proceed to stick them in the ground close up to the rope. They should be stuck deep, leaving not more in any case than two buds out of the ground. If stuck in the full length it is just as well. It is advised that they should be stuck in standing, say at the angle of from 30 to 45 degrees and invariably butt end first. For a live fence or hedge, they should be stuck as nearly as possible one foot apart, 5280 cuttings will plant a mile of such fence. Two good hands can plant this mile in a day if the ground is partly prepared for them.\n\n**METHOD OF CULTIVATION.**\n\nAs soon after planting as the weeds and grass show themselves, hoeing should be commenced; every cutting should be carefully hoed. All of the four feet margin on each side of the row should be hoed thoroughly, as soon afterwards as the cuttings have started, so that the row may be distinctly seen, the grass and weeds killed, leaving all of the four feet on each side of the row perfectly mellow. This process should be repeated two or three times during the season, as not a weed or a bunch of grass should be allowed to go to seed. Great care should be exercised in hoeing not to disturb the cutting of the young tree. After harvest all the weeds and grass found within the four feet margin should be gathered and burned.\n\nLook out for prairie fires, and, if the plantation is in danger, burn round it.\n\nIt cannot be sufficiently impressed upon the tree planter that thorough cultivation the first season will ensure the success of the plantation. The second year the plants will do with half the cultivation, and the third year no further cultivation will be required. By pursuing this treatment the cuttings will be grown in five years to a size and height which will form an impenetrable barrier to horses and cattle, as well as a valuable windbreak. Ten acres planted in this way in rows eight feet apart will in that period (5 years) not only furnish all the fuel and fencing necessary to support a farm, but will also bring a handsome income from the fence poles which may be spared to less fortunate neighbors.\n\nThe earlier the cuttings are planted after the frost is out of the ground the better, but the planting may be continued to the 1st of June with success. Cuttings set in spring ploughing time should have the earth pressed on each side of them as fast as the planting progresses.\n\nThe cuttings may be procured from the nearest natural groves or belts of woods on the margin of streams or the river sides.\n\n**YOUNG TREES AND SEEDS.**\n\nYoung aspen and poplar, one or two years old, may be gathered in waggon loads on the prairie in the vicinity of groves which fires have not run over. The seeds of the ash-leaved maple, the ash, and the elm (very pretty and suitable for protection round the house and stables) may be found in abundance from these trees along the mar-\ngins of the streams, and may be gathered to most advantage late in the fall. Forest tree seeds are likely to succeed best if planted just before the ground freezes, the seed should be planted in drills in small furrows previously made by the hoe, and should be liberally sown, then covered with a small iron rake to a depth of from one to two inches. Seed necessary to be kept throughout the winter should be kept in moist sand, in boxes or barrels, two parts of sand to one of seed, and where they will be kept cool, and at about their natural moisture.\n\nPOLITICAL INSTITUTIONS.\n\nGOVERNMENT.\n\nThe North West of the Dominion is as yet only under a Territorial form of Government. The Executive consists of the Lieutenant-Governor and a council, appointed by the Governor-General, by and with the advice of the Queen's Privy Council for Canada by warrant under his privy seal, holding office during pleasure.\n\nThe seat of Government is located at a site lately selected on the Battle river, an important tributary of the North Branch of the Saskatchewan, already referred to descriptively. The site of the new capital is named Battleford, and, although only a few months in existence, is already assuming importance as a business centre.\n\nThe judicial power is for the present vested in resident stipendiary magistrates also appointed by the Queen's Privy Council for Canada. The Act for the organization of the North West Territories of which the following is a Synopsis provides that the Lieutenant Governor and Council of the North-West Territories, may make, ordain and establish ordinances as to matters coming within the following classes of subjects:\n\n- Taxation for local and municipal purposes.\n- Property and civil rights in the Territories.\n- The administration of justice in the Territories, including maintenance and organization of courts, both of civil and criminal jurisdiction, and including procedure in civil matters in these courts, but the appointment of any judges of the said courts shall be made by the Governor-General in Council.\n\nPUBLIC HEALTH.\n\nThe licensing of inns and places of refreshment;\nLandmarks and boundaries;\nCemeteries;\nCruelty to animals;\nGame and wild animals, and the care and protection thereof;\nInjury to public morals;\nNuisances;\nPolice;\nRoads, highways, and bridges;\nThe protection of timber;\nJails and lock-up houses;\nAnd generally all matters of a merely local or private nature.\n\nThe imposition of punishment by fine or penalty or imprisonment for enforcing any ordinance of the Territories made in relation to any matter coming within any classes of subjects enumerated, provided that it be not inconsistent with certain statutes specified, or that any penalty does not exceed one hundred dollars.\n\nA copy of every ordinance must be mailed to the Governor-General within ten days after passing, and may be disallowed any time within two years after. All such ordinances are to be laid before both Houses of Parliament as soon after their enactment as may be convenient. The Governor-General in Council may by proclamation from time to time, direct that any Act of the Parliament of Canada or any part or parts thereof or any one or more of the sections if any one or more of any such Acts shall be in force in the North-West Territories generally, or in any part or parts thereof to be mentioned in the proclamation for such purposes.\n\nWhen any electoral district shall be established the Lieutenant-Governor, by and with the consent of the Council or Assembly, as the case may be, will have power to pass ordinances for raising within such district by direct taxation, or by shop, saloon, tavern or any other such licenses, a revenue for local and for municipal purposes of such district, and for the collection and appropriation of the same in the promotion of such purposes respectively.\n\nWhenever any electoral district shall be found to contain not less than one thousand inhabitants, the Lieutenant-Governor by and with the consent of the Council or Assembly, as the case may be, may pass ordinances erecting the same into a municipal corporation or corporations; as they may think fit; and thenceforth the power of the Lieutenant-Governor and Council or Assembly in respect of taxation for municipal purposes shall cease; and every such municipal corporation shall thenceforth have the right to pass by-laws for raising within such municipality, by taxation, a revenue for municipal purposes in such district, and for the collection and appropriation of the same in the promotion thereof; and the Lieutenant-Governor and Council or Assembly, as the case may be, shall pass an ordinance or ordinances prescribing the process and authorities which may be exercised by any such municipal corporation and the mode and extent of such taxation. But it is provided that the power given to the Lieutenant-Governor and Council or Assembly, as the case may be, of taxation for local purposes of such district shall not be prejudiced by the erection of the same into a municipality or municipalities, but such power shall continue vested in them in respect of local purposes not comprised within such municipal purposes, as to which powers may be conferred.\n\nWhen any system of taxation shall be adopted in any district or portion of the North-West Territories, the Lieutenant Governor by and with the consent of the Council or Assembly, as the case may be, shall pass all necessary ordinances in respect to education, but a majority of\nthe ratepayers, of any district or portion of the North-West Territories, or any lesser portion or subdivision thereof, by whatever name the same may be known, may establish such schools therein as they may think fit, and make the necessary assessment and collection of rates therefor; and, further, the minority of the ratepayers therein, whether Protestant or Roman Catholic, may establish separate schools therein, and in such latter case the ratepayers establishing such Protestant or Roman Catholic Schools will be liable only to assessments of such rates as they may impose upon themselves, in respect thereof.\n\nELECTORAL DISTRICTS.\n\nWhen the Lieutenant-Governor is satisfied by such proof as he may require, that any district or portion of the North-West Territories, not exceeding an area of one thousand square miles, contains a population of not less than one thousand inhabitants of adult age, exclusive of aliens or unenfranchised Indians, he is authorized to erect by proclamation such district or portion into an electoral district by a name and with boundaries to be respectively declared in the proclamation; and such electoral district will be thenceforth entitled to elect a member of the Council or of the Legislative Assembly, as the case may be. The persons qualified to vote at any election are the bona fide male residents and householders of adult age not being aliens or unenfranchised Indians, within the electoral district, who may have respectively resided in such electoral district for at least twelve months immediately preceding the issue of the said writ, and any person entitled to vote may be elected. Whenever the Lieutenant-Governor is satisfied as aforesaid, that any electoral district contains a population of two thousand inhabitants of adult age, exclusive of aliens or unenfranchised Indians, he is to issue his writ for the election of a second member for the electoral district. When the number of elected members amounts to twenty-one the Council before appointed will become defunct, and the members so elected will be constituted and designated as the Legislative Assembly of the North-West Territories, and all the powers by the Act vested in the Council will be thenceforth vested in and exercisable by the said Legislative Assembly. The number of members so to be elected is limited to twenty-one, at which number the representation is to remain; the members so elected are to hold their seats for a period not exceeding two years.\n\nLAWS OF DESCENT.\n\nThe Act goes into minute particulars in defining the succession to real estate, in cases where the owner dies intestate. Relatives of the half blood are to inherit equally with those of the whole blood in the same degree, and the descendants of such relatives to inherit in the same manner as the descendants of the whole blood, unless the inheritance came to the intestate by descent, devise or gift of some one of his ancestors; in which case all those who are not of the blood of such ancestors are excluded from such inheritance. On failure of heirs under the pre-\nscribed rules the inheritance descends to the remaining next of kin of the intestate, according to the rules in the English statute of distribution of the personal estate. Children and relatives who are illegitimate are not entitled to inherit under any of the provisions of this Act.\n\nALIENS.\n\nAliens may acquire, inherit, grant, lease, and devise real estate within the North-West Territories. The Act provides that all lands, tenements, and hereditaments, and any share or interest therein, shall, as regards the conveyance of the immediate freehold thereof be deemed to lie in grant as well as in livery. Deeds of grant to be executed and delivered in duplicate, attested by one witness, and the execution and delivery thereof duly proved in oath, for the purpose of registration. No deed of bargain and sale of land in the North-West Territories will require enrolment or registration to supply the place of enrolment for the mere purpose of rendering such bargain and sale a valid and effectual conveyance for passing the land thereby intended to be bargained and sold.\n\nDISPOSITION OF REAL ESTATE.\n\nEvery person may devise, bequeath or dispose of, by will, in manner hereinafter mentioned, all real estate and personal estate which he shall be entitled to, either at law or in equity at the time of his death, and which, if not so devised, bequeathed or disposed of, would devolve upon his heir at law, or upon his executor or administrator.\n\nNo will made by any person under age of twenty-one years will be valid. No will will be valid unless in writing and signed at the foot or end thereof by the testator, or by some other person in his presence, and by his direction; and such signature must be made or acknowledged by the testator in the presence of two or more witnesses present at the same time; such witnesses to attest and subscribe the will in the presence of the testator, but no form of attestation is necessary. Every will executed in the above manner shall be valid without any other publication thereof.\n\nPROTECTION TO MARRIED WOMEN.\n\nDae provisions is made for \"woman's rights.\" It is enacted that the real estate of any married woman, which is owned by her at the time of her marriage or acquired in any manner during her coverture, and the rents, issues and profits thereof respectively shall, without prejudice, and subject to the trusts of any settlement affecting the same, be held and enjoyed by her for her separate use, free from any estate or claim of her husband during her lifetime, or as tenant by the courtesy, and her receipt alone shall be a discharge for any rents, issues or profits; and any married woman shall be liable in any contract made by her respecting her real estate as if she were a femme sole. All the wages or personal earnings of a married woman, and any acquisitions\ntherefrom, and all proceeds or profits from any occupation or trade which she carries on separately from her husband, derives from any literary, artistic or scientific skill, and all investments of such wages, earnings, moneys or property shall hereafter be free from the debts or dispositions of her husband, and shall be held and enjoyed by such married woman and disposed of without her husband's consent as fully as if she were a femme sole; and no order for protection shall hereafter be necessary in respect of such earnings or acquisitions; and the possession, whether actual or constructive, of the husband, of any personal property of any married woman, shall not render the same liable for his debts. A husband by reason of marriage does not become liable for the debts of his wife contracted before marriage, but the wife is subject to be sued therefor. A married woman may maintain an action in her own name for recovery of wages, earnings, etc., her separate property under the Act and in like manner may be sued or proceeded against, separately from her husband, in respect of the same.\n\nREGISTRATION.\n\nThe 54th section provides for the appointment of a Registrar of deeds at an annual salary not exceeding $2000.\n\nADMINISTRATION OF JUSTICE.\n\nDue provision is made for the administration of justice. A sheriff holding office during the pleasure of the Governor is to be appointed at an annual salary of $1200. Section 36 provides that the Lieutenant-Governor shall have the local disposition of the Mounted Police, but subject to any orders in that behalf from time to time by the Governor-General. The Lieutenant-Governor is empowered to appoint justices of the peace, and, with the Council or Assembly, may by ordinance, subject to the provisions of the Act, set apart any portion of the North-West Territories as a judicial district. For every court of civil and criminal jurisdiction a clerk is to be appointed at a salary not exceeding $500. Each stipendiary magistrate has jurisdiction, and may exercise within the North-West Territories the magisterial, judicial and other functions appertaining to any justice of the peace, or any two justices of the peace under any laws or ordinances which may from time to time be in force in the North-West. The Chief Justice or any Judge of the Court of Queen's Bench of the Province of Manitoba, with any one of the stipendiary magistrates as an associate, is empowered to hold a court to hear and determine any charge preferred against any person for any offence alleged to have been committed within the North-West Territories. In the case in which the maximum punishment for such offence does not exceed five years imprisonment, in a summary way and without the intervention of a jury. In any case in which the maximum punishment for such offence exceeds five years imprisonment but is not punishable with death, then either in a summary way and without the intervention of a jury, if the accused assents thereto, or if the accused demands a jury, then with the intervention of a jury not exceeding six\nin number. In any case in which the punishment for such offence is death, then with the intervention of a jury not exceeding eight in number.\n\nA person convicted of any offence punishable by death may appeal to the Court of Queen's Bench of Manitoba, which shall have jurisdiction to confirm the conviction or order a new trial.\n\nThe administration of civil justice summarily and without a jury is limited to cases in which the amount in dispute does not exceed $500 or in a case of a contract $1000. Section 73 provides that:\n\nAny person feeling himself aggrieved by the decision of an stipendiary magistrate or presiding judge or court, in a claim, dispute or demand under the second sub-section of the seventy-first section of this Act, may appeal to the Court of Queen's Bench of Manitoba, which shall have jurisdiction to confirm the decision or to order a new trial.\n\nThe prohibition of all importation or traffic in intoxicating liquors is to be enforced under a penalty not exceeding $100 or less than $50, with costs of prosecution, one half the fine to go to the prosecutor. The penalty for illegal manufacture is limited to $200. The strictness of the Act is exhibited by the following sub-section:\n\nAny person who knowingly has in his possession any article, chattel, commodity or thing purchased, acquired, exchanged, traded or bartered, either wholly or in part, for any intoxicating liquor or intoxicant, shall forfeit and pay for each offence a penalty not exceeding $200 nor less than $50, one half of which shall go to the informer.\n\nAny person wilfully giving false information to the authorities, or neglecting or refusing his aid, is liable to a fine not exceeding $200 or less than $50. The custom of making a mild form of grog out of \"Davis' Painkiller,\" \"Radway's Ready Relief,\" etc., will receive a fatal blow if the following sub-section be acted upon with strictness:\n\nThe expression \"intoxicating liquor\" shall mean and include all spirits, strong waters, spirituous liquors, wines, fermented or compounded liquors, or intoxicating fluids, and the expression \"intoxicant\" shall include opium or any preparation thereof, and any other intoxicating drug or substance, and tobacco or tea mixed, compounded or impregnated with opium or with any other intoxicating drug, spirit or substance, and whether the same or any of them be liquid or solid.\n\nIntoxicating liquors imported or brought into the North-West Territories from any part of Canada by special permit are liable to the general excise law if in excess of one gallon.\n\nOUTFIT AND BEST TIME TO EMIGRATE.\n\nImmigrants on their arrival at the city of Winnipeg, in Manitoba, can obtain agricultural implements, stoves, iron and tin ware, groceries and dry goods of every description, also necessary articles of furniture and building, nearly as cheap as in the Eastern part of Canada, and save all the trouble of extra baggage, etc., but each family should bring with them a good tent necessary for the journey over the plains after leaving Winnipeg, together with (in addition to bedding) a large water-proof or India rubber blanket, which will be found of great value\nin wet weather to lay next the ground, and thereby keep the bedding always dry and comfortable; a small medicine chest and carpenter's tools should be added, together with a good stock of ammunition.\n\nThe pioneer immigrant going into the Saskatchewan Country should at least have sufficient means to carry himself and family over a year in provisions, besides the purchase of\n\n| Item                                      | Price   |\n|-------------------------------------------|---------|\n| One yoke of oxen and yoke of harness      | $120 to $150 |\n| One waggon                                | 85 to 90 |\n| Breaking plough and harrow                | 40 to 45 |\n| Chains, shovel, tools, etc., say           | 20 to 00 |\n| Stove (cooking) with furniture             | 26 to 30 |\n| Seeds, etc                                 | 10      |\n| Besides contingencies for building, etc., say | 25     |\n\nTotal: $326\n\nequal in sterling money about £65.0.0. This is the lowest estimate, and is merely offered as a guide; of course, the outfit and stock depends altogether upon the desire, intentions and means at the emigrant's disposal.\n\nThe following is a more detailed list of present prices at Winnipeg:\n\n| Item                                      | Price   |\n|-------------------------------------------|---------|\n| Waggons, complete                         | $90.00  |\n| \" without box                             | 70.00   |\n| Extra prairie breaking plough             | 27.00   |\n| Sub-soil breaking plough, 12 inches       | 42.00   |\n| Cross-plough, 10 inches                   | 13.00   |\n| Cultivators, 5 teeth                      | 10.00   |\n| Scythes                                   | 1.10    |\n| Chains, 12½ cts. per lb                   |         |\n| Mowers                                    | $85 to $100 |\n| Harrows, 8 bar                            | 16 to 00 |\n| Fanning Mills                             | 35 to 00 |\n| Nails, 5 cts. per lb                      |         |\n| Iron, 7 \"                                |         |\n| In building material                     |         |\n| Window sashes from                        | $1.50 to $3.00 |\n| \" frames                                  | 1.25 to 2.00 |\n| Door frames, inside                       | 1.00    |\n| \" outside                                 | 2.00    |\n| Panel doors                               | $1.80 to $2.50 |\n\nOxen and horses of a superior breed being in great demand in Manitoba by constant arrivals would be purchased cheaper in Canada or the State of Minnesota, more particularly as the rapidly increasing immigration will cause a scarcity and high prices. Parties desiring to become stock raisers would do well to make their selection of breeding stock in Quebec or Ontario, which Provinces took the principal prizes at the Great Centennial Exhibition at Philadelphia.\n\nTo the immigrant who has not means sufficient to proceed at once out to the Saskatchewan, the extensive works on the Canadian Pacific Railway now offer immediate employment to large numbers, and will be continually increasing for many years until completed across the continent. This, therefore, should be a great inducement, even to the less fortunate immigrant, who would at first require no further outfit than his ordinary clothing and bedding.\nThe immigrant who is destined direct for the interior will on his arrival at Winnipeg obtain from a few days experience a thorough knowledge of everything he will require in proportion to his means and intentions. Should he desire to carry more than his own waggons or carts, he can make arrangements with a transportation firm by which freight will be carried to his destination or any other point at the rate of one dollar and twenty-five cents or five shillings sterling per hundred for each hundred miles.\n\nThis transportation with guides, natives of the country, will be furnished by the firm referred to on twelve hours' notice. So that immigrants proceeding on to the Saskatchewan need have no fear of detention at Winnipeg on that account.\n\nIn order to give an idea of the amount of freighting to the interior during the season of 1876, it may be stated that between 4,000 and 5,000 carts were loaded at Winnipeg to cross the plains, and this principally provisions and other supplies, each cart carrying on an average 1,000 pounds and drawn by one animal.\n\nTHE COLONY SYSTEM.\n\nThe system of emigrating in small colonies will be found very advantageous to the pioneers, as well as economical; neighbors in the old land may be neighbors in the new; friends may settle near each other, form communities and the nucleus of new settlements and towns, establish schools and, in short, avoid many of the traditional hardships which have usually attended pioneer life. The colony system is also calculated to supply the needs of all members of the community, and to furnish employment to every industry. Whenever a colony is established there will soon be near its centre the storekeeper, blacksmith, carpenter, etc., post office, school house and church, and, with the progress of the Pacific Railway and Steambot navigation, a market. Until then an ample market, commanding high prices, is created by the influx of following settlers, as has been already instanced at the flourishing settlement of Prince Albert on the Saskatchewan and others.\n\nThe attention of the capitalist intending to emigrate is drawn to the importance and mutual advantage of this system, in which capital, directed by sagacity and enterprise, possess such unquestionable advantages united with industry and a plucky purpose, and, in no place under the sun, could it reap better rewards than under the bright skies and helpful atmosphere of this fair land.\n\nThe best and most advantageous time for emigrants destined for the Saskatchewan, to arrive at Winnipeg is as early after the opening of navigation as possible, say about 1st of May, and should not be later than, say, end of August, in order to have time, after their journey over the plains and arrival at their destination, to make temporary provision for the winter in building, etc. All necessary further information regarding this can be had on their arrival at Winnipeg, when selecting their necessary outfit.\n\nDoors, sashes, flooring, and all kinds of dressed lumber, well seasoned, for fitting up the interior of a temporary log house comfortably, can be had at Winnipeg at the following prices:\nDoor Panels ........................................ $1.80 to $2.00\nSashes .................................................. 1.50 to 3.00\nFrames .................................................. 1.25 to 2.00\nFlooring .................................................. 35.00 per 1000 ft.\n\nDuring the winter months the settler may profitably occupy his whole time, getting out timber for larger buildings, fencing, etc., and generally preparing for an early start on his land in the spring. Before the snow falls, if provided with a mower, he will cut sufficient hay for his cattle during winter to feed when not turned loose.\n\nIN CONCLUSION.\n\nWe would again repeat that \"the Province of Manitoba\" and \"the Saskatchewan Country\" afford the finest and most inviting fields for emigration in the world today, which statement is amply corroborated by testimony of the very highest standing and given from practical knowledge; and the inducements presented to those in search of new homes may fairly claim to be unequalled.\n\nThe writer of this pamphlet, since the issue of his last on Manitoba, two years ago, has been in the receipt of hundreds of letters of enquirers, and he would take the present opportunity to notify readers of this, that he had no real estate to sell, and is in no wise connected with the land business; and, therefore, hopes that none of his readers will correspond with him on that subject, but rather direct their letters to real estate agents. Attention will be paid to all applications for copies of this pamphlet; but letters calling for special detailed information, not containing one dollar or more will be unanswered. A business man's time is money.\n\nMy object is to present the facts relative to this portion of the Dominion of Canada, as I believe them, to those who desire to know them, taking conscientious care to willingly deceive no one. Cruel is the writer who draws immigrants to any country by gross misrepresentations. Changing one's home is to all a serious event. Shiftless discontent transforms many a man into a pioneer, who, finding a new country not a Paradise, send back evil reports of the land. No matter how milk and honey may abound, no matter how large and luscious are the grapes of Eschol, they are nothing but some tall sons of Anak, and becoming, in the face of difficulties, as \"grasshoppers in their own sight,\" soon desire to return into Egypt.\n\nOn the contrary, nearly all of those who count the cost before starting, and who convince themselves they are able to overcome those tall sons of Anak, succeed in subduing the land and enter into possession of the milk and honey. All intending emigrants should remember that a new country like this is not the idler's paradise, that all its mines of wealth are surrounded by bustling difficulties. Its great superiority is that it is a land of opportunities.\n\nHere as in no other portions of this continent are openings today that yield their wealth to brains, energy, pluck, whether with or without capital, more than is actually necessary to start with fairly. A cordial welcome is extended to all those who desire to emigrate to come\nand partake of all the advantages with which lavish nature has endowed us, as well as become freeholders of one hundred and sixty acres of rich arable land to which every man over 21 years of age is entitled, who will be come an actual settler, to take possession of, thanks to the beneficent wisdom of Canada's generous legislation to give life and action to the idle richness slumbering in the black soil of her millions of acres of unoccupied lands in her Great North-West.\nendowed\nof rich\nuntitled,\nto the\nsafe and\nions of\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_33572.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 51, "total-input-tokens": 87604, "total-output-tokens": 30755, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1541, 3], [1541, 3966, 4], [3966, 3966, 5], [3966, 4560, 6], [4560, 6649, 7], [6649, 8569, 8], [8569, 10526, 9], [10526, 13202, 10], [13202, 16696, 11], [16696, 20106, 12], [20106, 23292, 13], [23292, 26678, 14], [26678, 29932, 15], [29932, 33383, 16], [33383, 36755, 17], [36755, 41320, 18], [41320, 44794, 19], [44794, 47880, 20], [47880, 51281, 21], [51281, 54712, 22], [54712, 58174, 23], [58174, 62219, 24], [62219, 65814, 25], [65814, 69458, 26], [69458, 72787, 27], [72787, 75971, 28], [75971, 79024, 29], [79024, 82319, 30], [82319, 84679, 31], [84679, 87922, 32], [87922, 90941, 33], [90941, 94139, 34], [94139, 96578, 35], [96578, 99518, 36], [99518, 102780, 37], [102780, 105644, 38], [105644, 108569, 39], [108569, 110852, 40], [110852, 114052, 41], [114052, 117123, 42], [117123, 119946, 43], [119946, 123013, 44], [123013, 126162, 45], [126162, 129475, 46], [129475, 132613, 47], [132613, 135756, 48], [135756, 136233, 49], [136233, 136283, 50], [136283, 136283, 51]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]