[{"id": "63eaa2e576c500585bb7097778afafd4da23723a", "text": "Technical and Bibliographic Notes / Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Couverture de couleur\n- [ ] Covers damaged/\n- [ ] Couverture endommagée\n- [ ] Covers restored and/or laminated/\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Cover title missing/\n- [ ] Le titre de couverture manque\n- [ ] Coloured maps/\n- [ ] Cartes géographiques en couleur\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Coloured plates and/or illustrations/\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Bound with other material/\n- [ ] Relié avec d'autres documents\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n[ ] Coloured pages/\n- [ ] Pages de couleur\n- [ ] Pages damaged/\n- [ ] Pages endommagées\n- [ ] Pages restored and/or laminated/\n- [ ] Pages restaurées et/ou pelliculées\n- [ ] Pages discoloured, stained or foxed/\n- [ ] Pages décolorées, tachetées ou piquées\n- [ ] Pages detached/\n- [ ] Pages détachées\n- [ ] Showthrough/\n- [ ] Transparence\n- [ ] Quality of print varies/\n- [ ] Qualité inégale de l'impression\n- [ ] Continuous pagination/\n- [ ] Pagination continue\n- [ ] Includes index(es)/\n- [ ] Comprend un (des) index\n\nTitle on header taken from:/ Le titre de l'en-tête provient:\n\n- [ ] Title page of issue/\n- [ ] Page de titre de la livraison\n- [ ] Caption of issue/\n- [ ] Titre de départ de la livraison\n- [ ] Masthead/\n- [ ] Générique (périodiques) de la livraison\n\nPagination is as follows: p. [5]-43.\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nArchives nationales de Québec,\nQuébec, Québec.\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol ——— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n\n4 5 6\nFROM\n\nTHE ST. LAWRENCE,\n\nTO\n\nTHE NORTH SASKATCHEWAN.\n\n— BEING —\n\nSome incidents connected with the Detachment of \"A\" Battery, Regt. Canadian Artillery, who composed part of the North West Field Force, in the Rebellion of 1885.\n\nBy ALEXR. LAIDLAW,\nLate a member of \"A\" Battery Regt. Canadian Artillery.\n\n\"A chiel's amang you takin notes,\nAn' faith he'll prent them.\" — Burns.\nPREFACE.\n\nThe following stray notes, when taken, were not intended for publication, therefore can hardly be called a book, but are only as they profess to be, a few incidents which came under the personal notice of the writer. It is expected that they will not be criticized minutely, as far as literary abilities are concerned, as the handspike and parbuckle rope are more familiar in the writer's hands than the pen. They were taken on the march, after the fight, on the \"flat cars\" of the C. P. R., and in the Saskatchewan steamers, and it is hoped that they will be a fairly accurate account of the \"days' doings\" of \"A\" Battery, Regt. Canadian Artillery, in their journey from the St. Lawrence to the North Saskatchewan.\n\nDEDICATION.\n\nTo his old comrades of all ranks of the Regiment of Canadian Artillery who marched and fought in the North West campaign of 1885, the following papers are respectfully dedicated by the author.\n\nHalifax, N. S., 9th January, 1885.\nCHAPTER I.\n\nFROM QUEBEC TO WINNIPEG.\n\nSeldom, if ever, in the annals of \"A\" Battery, has excitement been so great as it was on the 26th of March, 1885, when a telegram from the Militia Department, at Ottawa, reached the citadel of Quebec, with an order for 87 dismounted men of all ranks, to hold themselves in readiness to proceed to the North-West, to assist in putting down the insurrection in the Saskatchewan district.\n\nRiel, the \"Stormy Petrel\" of the Halfbreeds and Indians, had worked upon the feelings and passions of both, until the climax had been reached by the fight at Duck Lake. To hurry troops up to the scene of action was the only alternative left for the Militia authorities, and \"A\" Battery (the senior permanent militia corps) were to supply the number of men before mentioned. The \"fall in\" sounded in the forenoon, and the roll of men selected being called, they were ordered kit inspection at dinner hour. Reports and rumours, it is needless to say, were flying about and the press news eagerly scanned. Next day (27th) the detachment paraded in their barrack rooms in marching order, for the inspection of Captain Peters, who was to have the honor to lead us to the front, and, after a few details as to the packing of valises and the packing of squad bags, one of the latter to each four men, they hung round the library and discussed the coming campaign. About 8 p.m., a fresh telegram came from Ottawa which ordered the detachment to further augment to over 100 of all ranks, with two 9-pr. M. L. R. guns, horses and drivers. All was now hurry and bustle getting things to rights; everything being done without confusion, and the stores being despatched to the North Shore station, the parade was ordered for midnight, in marching order. Leave-taking between husbands and wives, sweethearts, and comrades who stayed behind, was indulged in, and some of us alas! parted forever on this side of the grave. Exactly at midnight the parade fell in, and, on the roll being called, it was found that we were all present. Our gallant commandant—Col. Cotton—made a farewell address to us, trusting we would keep up the credit of the corps to which we belonged, giving us to understand that we were not going out on a pic-nic. How far the credit of the regiment was kept up it is not for me to say; one thing I can vouch for, is, that our trip was not a pic-nic, by any\nmeans. As the most of our band accompanied us to the North-West, and were in the ranks, only a small portion was left to provide dinner for us down to the North Shore station, where a special train waited to take us. At last the band struck up, \"fours right\" was given, and we placed in order, marched through the portals of the \"Canadian Gibraltar\" to the music, and strains of \"The Girl I Left Behind Me,\" and we left many behind, crowded with sad hearts and gloomy forebodings for the future.\n\nOn reaching the depot, the men were told off to their cars without any noise or confusion. A great many of our civilian friends, late as usual times, hour was, gathered at the station, and hand-shaking with good will, on the side of the road, met us on every side. I must here mention that, to her credit, Mrs. Cotton, our commandant's lady, came on the cars to wish us a good smile, bye, and this kindly act on that estimable lady's part was the subject of favourable comment among the rank and file time and again before we left. Several of the gallant 8th Royals were also at the depot, in uniform, to see us off. At last, about 1.30 on the morning of the 23rd March, we steamed out into the darkness of a winter morning, with good wishes, \"Rule Britannia\" and \"Auld Lang Syne\" blended in travelling, one wild confusion, to fight for our country, and bound for the length, \"great lone land.\" About daybreak we found ourselves at The River. Shortly after that we attempted breakfast, and had our first introduction to \"hard tack.\" Stopping at a roadside station, Captain Peters tried to negotiate for a supply of tea, but the general land pirate whom we tried to bargain with, asked such an exorbitant price (four dollars per gallon) that we had to go without it. On reaching St. Martin's we transferred ourselves and our belongings to the emigrant cars of the C. P. R. These cars are fitted up in a special manner and, to slightly alter the poet's words, \"Contrive double rent to pay; a bed by night a seat by day.\" They have a sort of a shelf which comes down to a horizontal position, kept in place by jointed iron bands, the seat in the night time being united, so to speak, and meeting in the middle forms a kind of a platform mattress, upon which is laid the article of bedding on which the occupant's sleep, and in this manner the four persons who occupy a seat in the daytime sleep, two on the top shelf and two on the second. The cars are arranged to carry about sixty persons, are well supplied with light and properly ventilated. Reaching Ottawa, we took a lot of stores and ammunition, and were visited by Col. Irwin, commanding the regiment, who passed through the cars bidding us good-bye, with kind wishes for our safe return. Many of the \"A\" and \"B\" Battery who had retired into citizens life, here visited us and wished us a safe journey. And while on this subject I must say that old \"A\" and \"B\" Battery men were continually turning up, and in the most unexpected places, all along the line of march they were to be found in Winnipeg, among the settlers of the North-West, among the North-West Mounted Police, in Boulton's brigade, and among the employés of the Saskatchewan river boats. Off to the left side...\naccompanied us to the North-West until we reached Carleton Place, where we had a splendid supper in the dining rooms, and were waited upon by the beautiful damsels of that place, and Carleton Junction will always stand out a green spot in our memories. Here also a band discoursed most excellent music, and to their enlivening strains and the cheers of an enthusiastic crowd we moved off. Stopping at Renfrew, we made a connection with \"B\" Battery who had come from Kingston en route for the future.\n\nWe told off to their cars with civilian friends, late at night times. Next morning we breakfasted at Mattawa, in a hotel by the side of the track, and notwithstanding the vigilance of our N. C. O's, some of the fellows who did not vote for the \"Scott Act\" had a few words to say to the cars to wish us good \"smiles.\" Running on all day we reached Biscotaching, where we had supper and some of us posted letters for home. Leaving this place at the depot, in uniform formation line; that is, the road was laid down in a rough state, not properly ballasted, and in some parts the ties were simply laid down on the hard snow; this style of road, of course, necessitated slow travelling, and, I suppose, we did not average ten miles an hour. Country, and bound for the length, about 2 p.m. on the 30th March, we came to a stand still opposite the employés' huts of the C. P. R. at North Bay, Lake Superior. After refreshing the inner man, we proceeded to the end of the rails at Dog Lake, near the North Shore of Lake Superior. I will now endeavor to give a brief detail of the strength of the regiment and how it was divided up:\n\n\"B\" Battery—2 Captains, 2 Subalterns, 107 N. C. O's and men.\n\n\"B\" —1 Lt. Col., 1 Major, 2 Captains, 3 Subs., 106 N. C. O's and men.\n\nSTAFF.\n\nLieut. Col. Commanding, Lieut. Col. Montizambert.\n\nPay and Supply, Lieut. Col. Forrest, Quebec.\n\nAssistant Surgeon, Dr. Grant, Ottawa.\n\nThe batteries were divided as follows:\n\nField battery of four 9 prs. R.M.L., under command of Major Short.\n\nGarrison batteries, under command of Captain Peters.\n\nThese last four batteries each consisted of about 42 officers, N. C. O's and men, and it was intended that they should act together in the field, as occasion required, each having their Battery commanders, and the men were told off to prevent mistakes. We were continually turning out of the cars we were told off to sleighs provided by the settlers of the North-West, and having loaded our guns, munitions of war, and camp equipment—the mounted men riding their horses with \"num-\nupon the grading from the right side, expecting to have a good view over Brown Turkey Creek. The last time he spoke, the latter had almost been run down, when went back toward Butler's Store Canal.\n\nIn this expectation we were however disappointed, as the breezy wind was blowing stoutly over the place where no mouth two nights ago. We had reason to believe that there could be nothing but the blackest possible eye-state throughout the Run. The terrible unruliness of the coons and the tough men made matters worse. We thought but dimension of the C. T. R., a distance of 26 miles from where we began to feel some hopes, did not serve any purpose but to build up.\n\nOne o'clock on the previous morning found us at the foot of Butler's Cutout Lake. Here we put in our standard pitchforks, where we would find such fuel as we needed for the campfires that we would be obliged to set up during our journey. We found good water also.\n\nA party of stricters constructed something of the C. T. R., a distance of 26 miles from where we began to feel some hopes, did not serve any purpose but to build up.\n\nAt stripped Dog Lake, just about sunrise next morning, we found ourselves on the fine details of the job. We had rejected every suggestion made, for we knew the Indians would never have liked our track. We found solid fuel here and better logwood than anything we had seen yet.\n\nConsidering that this was one of our favorable times simply from the coolness of the wind, we expected to reach Houma, where the work needed fell into some natural routine. But unfortunately we remained stationary all day without any grasp for anything solid before us. This prevented any relaxation in our determination.\n\nWe decided that it would be best to give our wagons That we would set a fine example for others to fall upon.\n\nThere, then, we set up our temporary headquarters around Noon Dolan, and methodically swung around Elija Union like anything. At midnight the cannon boomed loud like. We struck our canvas for the new Douxie Union.\nmeeting to have a good road, the latter part of the car for the train men to pass through, and pointed, as the track became a roof we had the wide world. I was fortunate enough to belong to the car in which was our sergt-major, and he being an adept in an unfinished condition of that kind of thing, set us to work to cover in ours with an old canvas which was lying around, and by using some old lumber we made things a little tolerable. Getting a big fire kindled by the time sending back a large pile of the track, Captain Peters showing himself nearly as great an adept with an axe as the \"grand old man,\" we warmed ourselves at the guns and other stores, light, due to the bad road, the blaze, and took it in turns to load up the train with stores, &c., fine night, the moon being high, the sleighs were bringing up, and, getting the battery horses through the trees. Here for the board the train, were despatched to Port Munroe, Lake Superior, lumberman's shanty, and towards 10 o'clock some of us tried to forget our misery in sleep, but in most cases this was a failure, owing to the cold. At last our spirits were playing all-fools day for us), and from 2 a.m., until 4 a.m., it was \"heaving cards. It must be a hard haul,\" two of \"A\" Battery officers, Captain Peters and Mr. Rogers for months at a time, working like bricks and thereby winning the admiration of the guns which make life worth while. The rank and file of both batteries. It was a fearful night, the thermometer down to 22 below zero, and the only wonder was that it was not the last night of our earthly existence, and the condition of our brave fellows was pitiable to see. During the time we were waiting for their turn to go, wrapping a blanket about us, we could not help wondering what would become of us. In the morning, the young men, among whom was the \"Emerald Isle,\" and the sergt-major. He threatened several times that these were his exact words, \"I cannot accomplish that feat, I suppose.\" But he did not resort to the blankets apiece, we took shelter where we arrived safe, except, at 9 a.m. on the 1st April we arrived at Barriville, where it was found that with the exception of a few frozen faces and toes, we were all \"O-K.\" Here we had breakfast, and hunting up a store, bloomed out into \"toques,\" a head-dress which is most strongly to be commended; it possesses important qualities of neatness, cheapness, and is so handy that it may be put in a haversack, or you can sleep in it at night, using it as a head-dress. By the way, the toque was the head-dress of the Winnipeg Field Battery, and they looked well in it. Halting at Barriville three hours, we proceeded on to Port Munroe, where the second gap commenced. On our arrival we were marched and deposited in the hold of a schooner, the \"L. H. Brock,\" from Kingston, which was frozen in the lake. Depositing our valises and accoutrements in the hold, a fatigue party was marched off to the train to assist in unloading our guns and stores. Having completed this task, we returned to our floating palace, some of us found to our dismay that our places had been taken up by late arrivals, and the railroad, and were told traps all over the ship. To add to our joy, the order was given sound reveille at 4 a.m., breakfast at 5, and how on earth we were to find our things at that hour was more than we could tell.\nWrapping myself up in my blankets and picking out the softest part of the keelson of the schooner \"sea, that alone could wind our way through the narrowest of gaps. The sounds of trampers sending off our poles, and we were awakened by the crescent moon. Today we will come out,/rolling out our blankets and burying this thing in a blanket fixes trouble in the last part./Instead. After only going so far as to get Connector Bay set out for McKellier's Harbor. At fast, we started for McKellar's Harbor, across the lake, a distance of about 25 miles, our next connecting link of rail. Here we again tried jumping our stores and guns, and started off for Jack Fish Bay./Here we met your comrades about Jack Field Division bobbed at Narr.\n\nMy dear!...\nTO THE NORTH SASKATCHEWAN.\n\nAfter picking out the softest places along with the remainder was awakened by the party dressed going to bed our blankets and hunting gear. After a hasty breakfast across the lake, a distance of Here we again loaded our Jack Fish Bay. Here, Field Division, who had been, and had had a fearful time this way, and but for the hurry, the officer in command. Again, after getting a little cake in sleighs, and after supper we were told off to blankets down on the floor. At six o'clock next morning there, although we lost our most in food was made up. After again and started off over this 53 miles of road changing the track, which was, while far down below. Here I saw the first church in some places were not had been made to build them in some of my travels in such a condition, might accommodate all, our traps being on board, we left Red Rock about 4 p.m., reloading, and leaving our Here we had 60 rounds of ammunition per man served out to us in case of accidents. Some of our musical friends of both batteries at Red Rock was said to be give a concert on the cars between Port Arthur and Red Rock (we been 20), and so which, it is needless to say, was attended by a select and fashionable long corkscrew, with one—as it was a smoking concert—ladies were not admitted. The huge crow in the snow managers, Mr. Wallis and Mr. Slater, of “A” Battery band particularly distinguishing themselves both vocally and instrumentally. Commissariat in his haven must also bring to notice the rising artist, Genower, who gave a huge promontory called splendid solo on the tin whistle. Mr. Kennedy also appeared in his sometimes pausing for a song par excellence, “The Ould Grey Mare and I,” and being encored from the air-holes along the sang “The Gunner’s Life is not a happy one,” in splendid style.\nPart I. of the concert being finished it was decided to give us a few minutes interval, but before we could resume the second part we steamed into Port Arthur. Such a crowd as was gathered we had not seen on all our journey, and the people shouted and hurrahed as if they would pull down the building. In a few seconds the cars were boarded by gentlemen carrying large cans of coffee and soup, legs of mutton, and all kinds of good things, and there was enough and to spare for every one of us. The good people were exceedingly kind, and their hospitality was appreciated by all ranks. But \"time and tide\"—inexorable tyrants—waits for none, and so, about 9 p.m., we again emerged into darkness, bound for Winnipeg, a distance of 400 odd miles. The Port Arthur people having been kind enough to supply us with reading material, we read war news, talked war news, until one by one we dropped off to sleep, and on awaking next morning found ourselves on the open prairies of Manitoba. The scene was changed for the better, the snow having disappeared or nearly so. About 8 a.m., April 5th, we reached Rat Portage, where a large crowd of people came to the station to see the \"regulars.\" Off again towards the west, and arrived in Winnipeg at 2 p.m. Here the scene beggars description; as we steamed alongside the platform cheer after cheer went up from thousands of throats. Disembarking from the cars we deposited our arms and accoutrements in the large waiting room of the C. P. R., and had a look round. The citizens brought us refreshments in the shape of coffee, sandwiches, lager beer, and so on. Some of the press representatives interviewed us for news, and in return we were supplied with newspapers. Tobacco was also supplied to us from one of the Winnipeg firms, and in fact one and all vied with each other who should show us the greatest kindness. Some of our fellows found out former comrades who had served in the different batteries, some of us wrote and posted letters for home, and otherwise amused ourselves. We had now travelled a distance of over 1800 miles from Quebec, and this being our ninth day out, showed an average of 200 miles per day. During our journey we had met with many obstacles, but had overcome them all, our men were in good health and although showing marks of our journey on our accoutrements and clothing, were nothing the worse for it. All classes of people with whom we came in contact had shown us the utmost kindness and courtesy in all their dealings with us. The officials and employés of the C. P. R. had done everything that lay in their power to keep things working smoothly, and but for the inclemency of the weather, the past nine days would have been looked upon as only something to talk about. Luckily soldiers, as a rule, soon forget hardships, and so, by the time we had our dinner in the dining rooms of the C. P. R., we had forgotten all or most of our late difficulties on our journey from Quebec to Winnipeg.\nCHAPTER II.\n\nFROM WINNIPEG TO FISH CREEK.\n\nAt six o'clock on the night of Sunday, 5th April, we started off once more for Qu'Appelle or Troy as it is sometimes called; a distance of 320 miles from here. Leaving the \"Keystone City\" we steamed slowly out of the depot amidst the cheers and good wishes of all—we soon found ourselves on the prairies again. At this stage of our journey extra precautions were taken, and no strangers allowed on board the cars, in case the rebels had sent out spies to find out our strength. Here, on leaving Winnipeg, I for the first time saw a sunset on the prairies, and it was magnificent; I cannot find words to describe it, one must see it to appreciate it. Passing Portage-Le-Prairie, we settled down into our berths and few of us awoke until we were past Brandon, and into the North-West. Brandon is the frontier town of Manitoba and the North West, and as the \"Scott Act\" is pretty solid in the latter province, thirsty and convivial souls had to bid farewell to double headers and the flowing bowl. The country round here is level with a fine black soil, which an English or Scotch farmer would like to see. Ploughing was going on in some parts alongside the track. Here and there between the stations was an occasional settler's house, alongside of which was the barn, quite different from the homesteads of England and Scotland. The want of hedges and trees gives this country a naked look, if I may be allowed the expression, especially to one who has been brought up in the old country. But it is a grand country and the only word which describes it is the word \"Immense.\" On our journey we passed the great \"Bell Farm,\" which is worked by an English Company, and contains I am afraid to say how many thousands of acres. At Indian Head we saw the \"Noble Red Man,\" and didn't think much of him. At last we reached Qu'Appelle and marching to the large emigrant sheds put off our traps, returning to the depot to unload our stores. This work finished, \"orders\" were issued breaking up the batteries, \"A\" under command of Lieut.-Col. Montizambert to proceed via Fort Qu'Appelle to join General Middleton's Column; \"B\" battery remaining at Troy until the Queen's Own Rifles with \"C\" School of Infantry under command of Lieut.-Col. Otter came up from Toronto, when they would proceed\nby rail to Swift Current, thence by trail to relieve Battleford, which had for some time been surrounded, and part of the town south of the Battle River burned and looted by the Indians under the Cree Chief, Poundmaker. At 5 o'clock on the afternoon of the 6th April, \"A\" Battery started across the prairie for Fort Qu'Appelle, a distance of 20 miles. It was a bitter cold night, and as we had four men with accoutrements in a small cart it was truly miserable. The teams went on, sometimes walking, sometimes trotting; our legs got cramped with cold, and sitting in a doubled up position, with cold showers of sleet blowing in our faces, our position was not exactly comfortable. On our arrival at the Fort we were lodged in a school room and after some tea, and some of the much abused \"hard-tack,\" we dropped off to sleep. After breakfast next morning Captain Peters paid us, and we made purchases of such articles as we wanted. Here for the first time we found out that the five cent piece was the lowest legal money tender in the North West. Getting our traps on the waggons we commenced our journey again, passing the mounted police barracks, and going up a pretty steep ascent, we found ourselves on the top of the Qu'Appelle valley, and at a depot of a large quantity of stores and provisions. Our battery horses which up to this time had been ridden by the mounted men, were put to the guns and we started across the prairie. Stopping about midday we cooked some tea, reaching Houghton 24 miles from Qu'Appelle about 8 o'clock. Here a scramble in the dark ensued, pitching tents, &c. After an extra blanket being served out we were told off to our tents, twelve men to each, and we tried to sleep, but in most cases it was a failure. Starting off again about 8 o'clock on the morning of the 8th we reached General Middleton's company about 10 a.m., where we found the following troops encamped: 90th Battalion, Winnipeg Field Battery, and part of French's Scouts—some of the latter accompanied us from Qu'Appelle. We now numbered about four hundred of all ranks. Pitching our camp we remained here until next morning.\n\nExactly at 4.30 on the morning of the 9th reveille sounded, we turned out, rolled up blankets, struck tents, and after breakfast, all of us with the exception of the cooks, old and new guard, prepared for our first day's tramp, as up to this time we had been carried in the waggons. We started off, the guns following up the advanced guard, which was furnished by the 90th, then came the escort of dismounted garrison artillery, next the remainder of the 90th, and behind them our waggons, French's Scouts riding ahead, and on each flank of the column, so as to prevent us being taken by surprise by the enemy. Halting at mid-day we had dinner and then after another three hours pitched our camp on the Touch Wood Hills in the same order as on the previous night. After this 21 miles tramp, some of us felt tired and the most of us had wet feet, and no means of getting them dried. At 4.30 next morning, after the usual routine, we started off again, and had a very hard day's work, as we had to go over the same ground again, and this time we had to carry our own baggage. We arrived at the camp about 7 p.m., and after tea and supper we turned in for the night.\nroutine, we again got under way, halted at mid-day for dinner and had a \"pow wow\" with some of the File Hill Indians. The General gave them good advice, and what they appeared to want more than anything was some bacon, flour and tobacco. When I was a boy I used to read and admire Fenimore Cooper's Indians, they were my ideal Indian. Now I think the real Indian a fraud and a humbug, who looks as if he was totally unacquainted with the properties of soap, and seems to glory in his clothes being made out of holes. The dusky maiden has greatly fallen in my estimation, the maiden is dusky, but it is chiefly owing to the accumulation of dirt. Seriously speaking, the poor people are to be pitied, but on the other hand I doubt if they are worth the sympathy that so many well meaning people extend to them. There was one good thing the old chief said, which tickled us, he said that \"he thought it would be cheaper for the Queen (White Mother) to feed the Indians than to send soldiers to fight them.\" (Pardon this digression, and now for the road.) To-night we encamped on the Salt or Alkali Plains, and this camping ground has been well named by the Royal Grenadiers \"Camp Desolation.\" On the morning of the 11th, we struck off across the plains which are about forty miles wide, and as far as the eye could reach ahead, right and left of us was an undulating prairie with large patches of snow lying in the hollows, where it formed when melted \"Sleiss,\" the whole looking to our eye like a tempest tossed sea. These \"Sleiss\" forming into rivers, run across the trail at various places, and as we could not walk round about we had simply to wade them, we crossed between, twenty and thirty of them on our first day's march, and often we were fording them when the water was over our knees. \"One more river to cross\" was not the thing, it was twenty rivers to cross. To add to our discomfort the water was unfit for use and the only means of allaying our thirst was by eating snow, and that is not a success at all times. Remember that we were at this time lugging along seventy rounds of small arm ammunition and that confounded nuisance, a sword-bayonet at our side in addition to our rifles, and other trifles. Here for the first time we had a whisper of Riel's whereabouts with the comforting addition that he meant to give us a warm reception. On the morning of the 12th \"orders\" were read out to us, the General thanking us for the way we had marched so far, and trusted that as Prince Albert was reported to be infested with the hostiles, that he had only to appeal to us as British Soldiers to spare no efforts in pushing on for their relief. This, of course, gave us fresh courage for the road, and the ground being much better than yesterday we got along first-rate. Striking the edge of the bush about 2 p.m., after going on a few miles further we halted for the night, and left behind us forever, I hope, the Salt Plains. Many of us had sore feet, myself included, the beef boots which had been good upon the snow proving a failure here; they became saturated with water, and it\npoured through them like a sieve, and we could obtain no footing on the dry parts of the prairie with them, moreover, being thin in the soles, walking over a rough surface hurt the feet, and I must say that they were not at all comfortable. I had a pair of regimental boots in my valise, but as my feet had become swollen, the boots soon became too small for me. Some absurd order was in effect which prohibited us from wearing ankle boots, to which I must plead guilty in disobeying, for I had to take mine into wear. I may state as an excuse for my disobedience, I had tried to put my \"beefs\" on that morning by hammering them with a tent mallet, and failing in that attempt, had to get them on by thawing them out at Jack Cassey's fire.\n\nThis camping place (Wise) was about 21 miles from Humboldt; here Matt. Coyne met one of his old friends, and while speaking of Matt., I think he was the best known man in the North West. Lots of his old Red River friends turning up all along the line of march. About 8 o'clock on the morning of the 8th April we started off again for Humboldt, and reached it that evening about 5 o'clock, camping for the night, and made a raid upon the only store in the place, capturing the stores of preserves and biscuits, which cost us, I suppose, exactly cent per cent more than their original value. I have never been in New York but I think it must be a larger town than Humboldt—Humboldt contains a store and a police station, that is the town. We saw in camp to-night two mounted messengers who had ridden from Battleford with despatches, they report the place as being closely invested with Indians, the white women and children in the police barracks for safety, and all on short rations. Next day, 14th April, we enjoyed a day's rest straightening up our things, washing socks and shirts, with Kit Inspection for the commanding officers. In the afternoon all the men of the battery paraded in \"fighting order,\" viz., rifle, side-arms, and three pouches; had company drill and manual exercise, and as a lot of spectators from other corps were looking on we put on our best style. The mail coming in this afternoon brought us lots of newspapers and the war news was read with interest. One of my tent chums Bombadier Miller went out rabbit shooting to-day and talked us all to sleep with his exploits. Striking off across the prairie in the morning we reduced the length of our convoy by travelling two teams abreast. We were now striking for Clark's Crossing on the South Saskatchewan 91 miles from Humboldt, and 198 miles from Troy, going this route we intended to reach Prince Albert about the 25th of the present month, when we did get there time will show. Reaching our next camping place, Vermillion Lake, the Winnipeg Field Battery and \"A\" Battery both mounted picquet. On the picquet being paraded Col. Montezambert addressed us, saying, in effect, that as we were near the enemy, extra precautions were to be used, so as to prevent a surprise, and for that reason double sentries were\nto be posted; after this we were marched off by the officer in charge. After posting sentries, who were relieved every half hour, some of us kindled a fire to make us a little more comfortable, but the fire had to be put out again, or nearly so, by order. Soon after darkness set in the rain commenced falling in torrents, thoroughly drenching one and all, vivid lightning gleamed at intervals making the darkness more intense, and as for seeing any one approach our post it was out of the question. Only by holding the rifle between the eye and the sky line could the outlines of the weapon be seen; towards morning the rain ceased and a sharp frost set in which completed our misery, our boots froze on our feet and our great coats to sheets of ice. Next to the misery of crossing Lake Superior on the flat cars I think the outlaying piequets at Vermillion Lake was the worst night of the campaign. Early on the morning of the 16th the General, with Captain Drury, and a field gun, the \"C\" School of Infantry under command of Major Smith advanced on towards Clark's Crossing, intending to hold it against the enemy if he attempted to cross from the north side of the Saskatchewan. The remainder of the column marching off at 7 a.m., the day very cold and windy. Stopping for our mid-day meal we were joined by Major Bolton's Mounted Infantry, or the (Col.) as his men used to call him. They were raised around Butte and Shell River, and were fine strapping looking young fellows, armed with Winchester rifles, and mounted on stout broncho or Montana horses. The major was a splendid looking man, about from 45 to 50 years of age and has quite a history, having been a prisoner under Riel in the Red River times. He was very popular with his men, who would have done anything and gone anywhere for him. All his troops were favorites with the battery men who, as it turned out, were to be their comrades for many a day to come. And now as Bolton's Horse is broken up it will not be flattery for me to say that it will be long ere the gallant major and his brave comrades are forgotten by the gunners of \"A\" Battery. The march of the 17th was without any incidents, every one pushing on for all they were worth. On the morning of the 18th we struck camp and went on again aiming at the Crossing on the south side of the Saskatchewan, at 11 a.m. camping on the south bank about five hundred yards from the river. The country we had passed over, up to this time, had been comparatively bare with the exception of Touchwood Hills and the Salt Plains, interspersed with a kind of scrubby brush; near the banks of the Saskatchewan the ground was thickly strewn with large boulder stones, which appeared to have been either the river bed or the bed of a lake in the ages gone past. The Saskatchewan at this place is about four hundred yards wide, with sloping banks on the south side, thinly wooded with poplar trees; the banks on the north side being nearly vertical, with no timber. After launching a scow for transport purposes, we came back to camp and had a look around; there is not much to be seen,\nthe Telegraph Station and clerk's house being about all the build-\nings. Saskatoon (afterwards an hospital station) is about 15 miles\nfrom this place. The day turned out bad with showers of rain and\nsnow. Shortly after 2 p.m., the 10th Royal Grenadiers marched\ninto camp—they having followed us up from Troy—and were re-\nceived by all of our fellows with the greatest enthusiasm. As lots\nof our fellows knew Toronto they were soon hand and glove with\nthem, and a jolly lot of fellows the \"Royals\" turned out to be, most\nof them were big, strapping fellows, who looked fit for anything.\nAmong them I saw Staff-Sergt. Mitchell, the crack Wimbledon rifle\nshot, whose arm was covered with shooting badges. Lieut.-Col.\nLord Melgunde, with Captain French, Major Bolton and a party of\nmounted men went out scouting around this afternoon, captured\na party of three Indians, spies from Batoche, who, on being sur-\nprised about twelve miles from our camp, said they were hunters,\nbut upon finding that some of our scouts understood \"Cree\" they\nquickly changed their conversation into the Sioux language. Their\narms consisted of one Winchester-repeating rifle, and two shot guns,\nand in their possession were found a small pocket mirror, such as is\nused by the Indians for signalling purposes, and a fairly accurate\nmap of our camp, showing where our guns were placed. On being\nbrought into camp they were viewed with great curiosity—being the\nfirst hostiles we had yet seen. After being interviewed by the\nGeneral they were kept prisoners and handed over to Bolton's\nHorse for safe keeping. One of them turned out to be \"White\nCap's\" son, and was afterwards found killed at Batoche.\n\nOur force now consisted of the following corps:\n\n\"A\" Battery, R.C.A., 106 Officers, N.C. Officers and Men.\nWinnipeg Field Battery, 65\n\"C\" School of Infantry, 40\n90th Battalion, 296\n10th Royal Grenadiers, 250\nBolton's Mounted Inf'try 60\nFrench's Scouts, 25\n\nIn all 842 of all ranks, staff not included.\n\nIf the above figures are wrong I hope that the mistake will be\npardoned. At any rate they are fairly correct. Snow fell heavily\nto-night. Next day (Sunday) turned out a fine day. General orders\nof the day complimented all ranks on their good behaviour, and\nissued in detail a set of signals which would enable our forces to\ndistinguish friends from foes in case of a brush with the enemy.\nLate this evening an order was issued to break the column up into\ntwo divisions, one division going up the north side, and another\ndivision to advance up the south bank in the direction of Prince\nAlbert. On Monday a lot of the battery men went out firing and\nhad a great time and lots of fun skirmishing about the prairie. The\nsettlers here were determined to make hay while the sun shone, we were charged exorbitant prices for everything—$1.25 for a dozen of eggs, $0.40 for a pound of bread, $1.00 for a pound of butter, and $0.50 for a quart of milk—pretty good considering that a private's pay was $0.50 per diem. We got the scow fixed up to the cable ready for transporting purposes. Here I fell in with a lot of \"townies\" from the \"Land o' Cakes,\" and had only to divest myself of the surroundings to imagine that I was on \"Bonnie Tweed side\" again. I was, in fact, among No. 6 company of the 90th Battalion, a company composed of Scots, with two exceptions, and as most of them were Lowlanders, we had a talk over the \"Old Country.\" Nothing further of any importance took place today, and the only thing we were looking forward to was the order to make a move to Prince Albert as we were eager to try the mettle of the Indians and Halfbreeds, of whose skill as marksmen we had heard such glowing accounts. Next day, Tuesday, the forces for the north bank of the river were sent over, and consisted of the Winnipeg Field Battery, strengthened from \"A\" with 23 Officers, N.C. Officers and men, the 10th Royals, and part of French's scouts. All sorts of reports were flying around, among others was one that the rebels had cut down the telegraph wires between us and Qu'Appelle, but on going out to see it was found that the wind had blown over one of the poles. After a long spell of waiting on the Crossing, however, the welcome order was given, and on the 23rd of April the two columns moved off; and on the night of the 23rd of April the column under command of General Middleton found themselves encamped at Mc-Kintosh's farm, eighteen miles from Clark's Crossing and about three miles from Fish Creek. About nine o'clock the battery was paraded, we had battery orders read out, and among other things we were ordered to have some biscuit in our haversacks, and, in fact, from the extraordinary looks of things, all of us were convinced that we would find something to do for our 9-prs. and rifles before the next twenty-four hours. One by one we got into our tents after a chat and smoke, and soon were sound asleep. On the 24th of April after breakfast we started off again, going slowly up the river side, making short halts. At last about a quarter past nine firing was heard ahead of us, our scouts returned the fire, and the Fish Creek fight was begun.\nCHAPTER III.\n\nFROM FISH CREEK TO PRINCE ALBERT.\n\nFarewell Fish Creek, thy memories gory\nShall aye live in Canadian story?\nOur country's wives and babes are weeping\nFor loved ones in thy prairies sleeping.\n\nIn the last chapter I mentioned that the rebels opened fire from a bluff upon our advanced men who were instantly ordered to dismount and loose their horses, which being done they returned the fire with interest and held them gallantly in check. Orders were then sent to hurry up the advanced guard and the main body which on arrival extended and took cover in the bluffs, the enemy coming out of the ravine and firing until forced back by our fire into the creek. Meanwhile \"A\" Battery guns under command of Captain Drury got the order to come into \"action front\" and they commenced shelling the ravine where the rebels had their stronghold, owing to the intervening bush we could not see the full effect of our shell fire, but were afterwards told that our gunners had calculated the range correctly, and the shells fell among the enemy as if they had been fired from a mortar. Here at this point, might I not offer a suggestion as to the use of hand grenades in this kind of warfare; both at \"Fish Creek\" and \"Batoche,\" the enemy had taken up positions below us in places where the judicious use of hand grenades would have had great effect—as there are lots of that ammunition lying rusting around the different shot yards and stores in the Dominion, the cost would be nearly nil,—and as the hand grenade fulfils nearly all the conditions of common shell it could be used with great effect. To resume, after firing a few rounds from this position our guns were limbered up and emerging from behind a clump of bushes we came out upon an open prairie ground, where away in our front could be seen the log houses of a Half-breed settlement. Being at this stage of the proceedings sent to the rear to assist in filling shell, I did not have a chance of appearing on the scene for some time again. Shell filling under fire was a new thing for me, and as there was no funnel for the powder or any key or screw-driver to extract the plugs from the barrels of Hamilton powder, a paper funnel had to be extemporised and our sword bayonet used for unscrewing the plugs; filling shell is not a desirable occupation at any time, but...\nilling them under fire with stray bullets flying round makes it more mixed up than ever. During this time Captain Peters calling out \"this way 'A' Battery\" had with Lieut. Rivers pluckily led about twenty men of the battery down into the ravine, and supported by a party of the 90th tried to dislodge the enemy out of their pits, in this rush Mahoney our Sergt.-Major was twice severely wounded, being struck in the right arm by the first shot, and having his right thumb shattered by the second; Cook was killed, being at the time within eight or ten yards of the enemy's pits—poor fellow, he put his hand to his heart exclaiming \"My God I'm shot\" falling dead the next instant. Taylor received a flesh wound, and had it not been for his canteen which received the first full force of the bullet it would probably have gone hard with him. Armsworth and Monsion got severely wounded; Langelle one of our old soldiers got wounded in the arm and on being told to fall to the rear by Captain Peters, coolly insisted upon just having one shot at the enemy for revenge before he went, at the same time proceeding to staunch his wound with a piece of rag torn from his clothing. Mellor got slightly wounded, a bullet grazing his left forearm; Ouellet got struck on the shoulder, and Asselin one in the same place. It will therefore be seen that it was lively times for the battery men and the whole of the foregoing casualties occurred in less time than it has taken me to write this. To have driven the enemy from their pits would have entailed a heavy loss of life, and as the number of men were not considered sufficient, a retire was ordered and the gas run up to the brink of the ravine, depressed and fired to cover the men while retiring, here driver Turner and Wilson were wounded, the former slightly the latter having his arm shattered with a bullet making amputation necessary. The scramble down into the ravine by our fellows was of course not without some laughable incidents; not knowing the ground, some of them rushed over the wooded crest and soon found themselves falling through space to the bottom of the ravine, among the latter was the redoubtable Matt Coyne, who plunged into the brook which runs through the bottom of the place. In his scramble to get upon his feet some bushes caught his \"toque\" and upon seeing which some of the rebel marksmen opened a fusillade. Matt on telling the story came to the conclusion that it was well his head was not in the \"toque.\" Lieut. Rivers on descending the side of the ravine finding that his sword was anchoring him to the bushes, coolly unbuckled his waist belt and left the \"toasting fork\" among the trees, whether he got it back again or not I can't tell, if not I suppose it has been captured by some of our relic hunters, as having been in the \"Custer Massacre\" or else adorns the wigwam of Chief \"Strike him up in a gum tree\" somewhere in the far west. About noon the prairie was fired by the enemy, but was put out by the teamsters who were exposed to a\nheavy fire while doing so. Our force in the meantime had drawn gradually around the crest of the ravine, and were watching eagerly for a chance at the enemy in their pits, who on the other hand were laying low for us, and who on seeing the least movement of a head saluted it with a shower of lead. Here poor deManolly was killed, being shot through the head dying instantly without a word or struggle. Down in the ravine was a lot of Indian ponies tied up to the trees and our chaps not being able to see their owners were eager to revenge themselves on the poor animals by shooting them instead. As soon as the order came to shoot the poor brutes, ye gods! what a fusillade commenced, I think some of our fellows must have enjoyed the fun of making a noise more than anything else, as they did not appear to fire at anything in particular but kept at it until their ammunition was expended. There were about fifty ponies killed, and lead enough fired to have killed fifty hundred. About 2 p.m., a lull took place in the enemy's fire, and Captain Drury made some practice from his 9-prs; observing a house being made a shelter for the rebels, he pitched a shell into it, and soon the dusky crowd was seen to crawl off on their hands and knees up the furrows of a ploughed field, and make off in the direction of the bush, leaving their comrades in the ravine to do the fighting by themselves. At this stage of the days fighting it was determined to make another effort to drive the enemy from their pits and with that end in view, the ten 9-pr guns with about twenty dismounted gunners, headed by the energetic Peters made a dash over the small creek on the outside of the ravine, and galloping up the opposite bank, and after unlimbering and running the guns up by hand on to the brow of the hill, loaded up with case shot and reversed sharpnell, and fired round after round point blank against the rebels, but with little perceptible effect, for as soon as the iron shower passed over their heads they kept up a heavy fire on us fortunately without doing a great amount of damage, our only casualty being the wounding of Driver Harrison in the neck after the guns where limbered up. Here I might say a few words about what I think of the abilities of the Half-breeds and Indians as marksmen. When coming west to take part in the campaign our ears were assailed by their wonderful skill, such as shooting at five cent pieces when thrown up in the air, hitting the mark every time and a great many wonderful and highly colored improbabilities. No wonder that the \"Bold Militiaman\" was a little scared to tackle this army of crack shots, but what did it amount to? Nothing so great after all, for instance, had our men had the advantages possessed by the enemy in the matter of rifle pits knowing the \"lay\" of the country and so on, I think it would be safe to assert that more of them would have come to grief. Luckily for us at Fish Creek, at any rate, they did not shoot any of our gun horses as a wounded horse is not a desirable companion in the shafts of a lim-\nBetween three and four o'clock the Grenadiers after working like Trojans in getting across the river appeared on the scene and were a welcome sight to all of us; they immediately invested the ravine and allowed all of us who had been engaged during the day to fall back and get something to eat. Some narrow escapes had been made. The General received a bullet through his fur cap while riding round the crest of the ravine, too near to be comfortable, he is reported to have said when he saw the men ducking at the sound of the bullets \"keep up your heads men, had I been stooping that bullet would have gone through my brain,\" but I can hardly understand how that could have happened, because if he had stooped I think the bullet would have missed him altogether, however, he showed a splendid example to all of us, riding about as cool and collected as if he was on parade. Captain Peters had the lace on his forage cap dinted by a bullet. Captain Wise had a horse shot under him and some of our men when loading the guns had bullets passing through between the Nos. working at the muzzle, and the spokes of the gun wheels were marked with bullets which had been fired with deadly intent.\n\nThe following are the casualties of \"A\" battery for the days fighting.\n\nKilled.—Gunrs. de Manolly; Cook.\n\nWounded Seriously.—Gunrs. Molsau; Armsworth; Dr. Wilson.\n\nWounded.—Staff Sgt. Mawhinney; Bomrs. Taylor; Mellor; Guns. Asselin; Woodman; Imrie; Oullet; Langell; Drs. Harrison; Turner.\n\nAs it was decided that the ravine was not to be charged, we retired to an open part of the prairie which had been chosen by Lord Melgund and amid a fearful thunder storm pitched our camp for the night, placing a strong outlying picket of the Royal Grenadiers, and an inside guard over the wagons, guns and ammunition, as Lord Melgund's column had left their camp equipage on the north side of the river, we had to give our comrades sleeping room in our tents; the Winnipeg Field Battery Battery being guests of \"A\" and the 90th shared theirs with the 10th Royals. The night of the 24th turned out cold, with a heavy fall of snow and as we were all on the look out for a night attack it is needless to say that very few of us had a good night's rest. On Saturday 25th, the men who had fallen in the fight of the previous day were buried, the General reading the burial service himself, afterwards making an address to the assembled troops in which he told them to avenge the death of their comrades. Things were getting by this time a little settled down and the next quarry was, when would we have another fight? As we were aware that this was only the commencement of the work. Turning in for the night we disposed of ourselves for a sleep but in this we were disappointed, as some of the out lying picket (the 10th Royals) commenced about mid-night\nto fire on a convoy of teams coming into camp, who on being challenged by the outlying sentries made no answer and as a consequence had a shower of bullets about their ears. Instantly the camp was in an uproar, the chaps in the tents making grabs for rifles, pouches, boots and so on. Soon however, we were all made glad by the \"all's well\" which ran rapidly along the line and we turned in again to sleep. During the turn out, Darcy Baker of Boulton's Mounted Infantry who had been mortally wounded on the 24th, and who was delirious in the hospital tent, hearing the firing started up calling for his horse, dying soon afterwards. About 7 o'clock next morning (Sunday) poor Charlie Armsworth, whom I have mentioned as being seriously wounded, died. We were paraded for Church at 10 a.m., in fighting order and had the Church of England Service read by the General. After dinner; the 90th Battalion, the dismounted gunners of the Winnipeg Field Battery, Boulton's Mounted Infantry, French's Scouts and \"A\" Battery paraded for the purpose of searching the ravine, and to get the bodies of Cook of \"A\" Battery and Wheeler of the 90th, who were killed on the 24th, and we were also prepared to have a brush with the enemy, who might have been holding on to the position. On our arrival in the ravine we found everything quiet and after getting our two dead comrades who were lying exactly where they fell, and with the exception of Wheeler, who had been stripped of his tunic, no indignity had been offered to their dead bodies. We then proceeded to have a look around the place; the enemy had shown great skill in the construction of their rifle-pits, selecting the thick wooded parts, their mode of operation had been something like the following: digging a round hole behind a tree and cutting the tree nearly through at about a height of three or four feet from the ground, had dragged it over with the branches pointing towards the direction in which the attacking force would be likely to come, this forming a kind of abatis with the branches. From the evidences of crockery, lamps, pipes and cooking utensils &c., it was plain that the place had been occupied for some days previous to the fight and looked as if it had been intended to make a stand, some of the officers and mounted men rode through the place and picked up memos of the fight, among which were, a chief's head-dress with feathers, shot guns, moccasins, badger gauntlets, lamps, and crockery. One of Boulton's men picked up a plug hat, and rode into camp with it on his head, thereby causing great amusement. This day was a red letter one for many of us as the mail arrived in camp bringing letters and bundles of newspapers, the latter forwarded by our esteemed friend at head-quarters Mr. Gunner Maber who never failed during the campaign to keep us well supplied with the press news. Next morning the 27th some of us had a walk down to the river and in doing so had a look at the graves of our late comrades, they had been made to look as nice as they could be by wood and earth, and around them were placed all sorts of flowers. Armworth's grave was erected near the grave of Creekside. The next day the regiment marched between the two military camps, and on the way we met F. Simpson, who informed our troops that he had come across a number of all our men who were on account of the heat, hats having been thrown away, and not being able to keep pace with the column, protected themselves by lying on a warm rock, or under a bush, and that they heard the chirping of birds, and that the party had been obliged only to go out for a little forage and then return to camp file, you will see that in the morning they will invent a new kind of \"Cap.\" Mr. Tannenbaum came to look, a man who lives on the island and who had come ... William \"the Red Man\" who had arrived, and who said while the regiment was there, and that the enemy's force seemed to be small, they went out to see Gabriel's camp, and the scouts, and got some information which was taken for granted. \"Lepine's\" conclusion.\nby wreaths of the prairie flowers which grew in wild profusion all around; railings had also been placed around some of the graves, all showing some marks of loving comrades—Cook, Wheeler and Armstrong were buried in the afternoon, and it was decided to erect a \"calm\" over the graves which was done before leaving Fish Creek, and a large cross placed on top.\n\nThe next day or two nothing of interest took place, but simply the routine of guards and picnics. A cricket match was played between the Winnipeg Field Battery and \"A,\" resulting in a victory for the latter, and, as the cricketing gear was manufactured on the ground, it had the merit of being unique. Our Q.M.Sgt., F. Smith, got a field oven erected, and Messrs. Cassay and Blair, our two battery cooks, made bread for the boys, which was a welcome change after our \"hard tack.\" Having lost or thrown away all our forage caps we were sadly in want of something to wear, as on account of the improvement in the weather our \"wedge\" fur hats had got to be too hot to wear in the daytime at least; by the way, what is the earthly use of a forage cap on service? it won't keep the head warm or keep the sun out of the eyes, or is it any protection against rain, and in the event of the chin strap breaking, on a windy day it won't stop on the head, if it is put into a valis or bag it gets squashed up, and if placed on the back of the pack the chances are that the chin strap breaks, or that in pulling off the pack you forget all about it, and flop the load down somewhere, only to find out, when it is too late, that you have to get a new forage cap out of store for which, if you are one of the rank and file, you will find fifty cents deducted out of your pay at the end of the month. As there was no store at Fish Creek, Captain Peters invented a new style of head wear, since known as the \"Peters Cap,\" and which was made out of oat bags and canvas by our able Mr-Tailor, B. King, and which, after taking into wear, made us look, at a distance, something like the inhabitants of a certain island named \"Spike.\" At last we were made glad by the welcome news that the \"Northcote\" steamer, with Lieut.-Col. Williams and part of his Midland Battalion, \"the gatling gun man\" with his gun, and a lot of ammunition and provisions had arrived, and that we would march probably in a few days. Meanwhile the Mounted Infantry had been out scouting round day after day, and had come across signs that the rebels were in considerable force somewhere in our vicinity. On one of their scouting trips they got as far as \"Dumont's\" Crossing, and paid a visit to Gabriel's house, nearly succeeding in capturing some of the rebel scouts, whom they disturbed while at dinner, in fact, from all information which leaked out from time to time, it was pretty well taken for granted that the next fight would take place either at \"Lepine's Crossing\" or Batoche village, and it was a foregone conclusion that it would be a tougher affair than the other one.\nWhile waiting here Col. Cotton sent a telegram of congratulation to \"A\" as follows: \"Well done, 'A' Battery. My sympathy with the wounded. Send details,\" Captain Howard got his gatling gun detachment together and practiced drilling and firing at a target, the remainder of the troops not on duty were exercised in skirmishing and marching. It being decided that the steamer \"Northcote\" was to run the gauntlet past the village of Batoche, thence to proceed to Prince Albert, she was barricaded up with boxes of canned beef, boxes of biscuits, and bags of oats. \"C\" Company I. S., under the command of Major Smith, was put on board to defend her. Lieut.-Col. Williams having disembarked and camped beside us, thus augmenting our force by two companies. At last about 7 a.m. on the 7th May after striking our camp, and loading up our ammunition, camp equipments, we marched off in the direction of Batoche. Marching past the scene of our late fight we struck out for the open prairie to avoid falling into an ambush, calculating that the enemy would not attack us in the open, and after marching all day encamped for the night, throwing out a strong outlaying picket and sleeping all night with our accoutrements on and with rifles by our side. Early on the morning of the 8th we were on the road again, and plodding on until night, we encamped on the open prairie about eight miles from Batoche. During this day's march we were joined by a special correspondent of the \"Standard\" (Eng.) who had hurried out from England via New York to report for his paper. Soon after camping a Half-breed deserter from Riel's force surrendered himself and gave us a pretty fair idea of the force we would have to contend with on the morrow. This deserter, who was a Scotch Halfbreed, in a conversation I afterwards had with him, told me how he managed to escape. He was put down by the rebel council as a \"doubtful,\" that is, he was not to be trusted, and when on scouting duty the \"doubtful\" cases were accompanied at all times by men whom the rebels could depend upon, who would either raise an alarm or shoot the \"doubtful\" in case they attempted to bolt. On this day my informant's chum fell asleep and watching his chance he mounted and rode off. He also told me that lots of the so-called rebels were simply through force of circumstances mixed up in the affair, and knew that it would end in disaster for all concerned. I am happy to be able to add that my informant came out all right, and I saw him late, in the summer employed on board of a Saskatchewan steamer and doing well. The mail came in to-night and we got letters and papers from home, and after the news had been discussed, the most of us dropped off to sleep, knowing that we had a hard row next day.\n\nAbout 3.30 on the morning of the 9th, we, leaving our camp standing, and with a guard of about one hundred men including some of our \"light duty\" men to look after the place, the remainder\nof the force marched off in the direction of the river, passing through \"One Arrow's\" reserve and some deserted half-breed houses, near which was a burial ground, we headed towards the river. About 8:45 a.m., a blank charge was fired from one of Captain Drury's guns as a signal for the \"Northcote\" steamer which was supposed to be somewhere in the vicinity of Batoche, and then edged down toward the river banks, then following the river in about a north-easterly route we passed another fine lot of houses which unfortunately we had to destroy. The operation was simple, some light wood was broken up placed in a corner and set on fire, the glass of the windows was broken so as to create a draught and the house being built with wood soon blazed up. This may seem wanton destruction to some, but it must be remembered that we were in a comparatively unknown country, and dealing with a foe who were up to every twist and turn, and who, had they managed to outflank and surround us, would have used these very houses as a means of annoyance against us; hence we were justified in destroying them. About nine o'clock one of \"A\" battery guns put a shell through the roof of a house by the side of the trail, making some of the enemy who were inside take to the bush; advancing a little further we came out on an open space of ground on which was built a wooden church, school house, and I think a post office. This church was named St. Antoine de Padreé, and was the Parish Church of St. Laurent. Some Indian Tepees near the edge of the bush was fired upon by the Gatling gun and the occupants left without waiting to finish their breakfast, four Priests and five Nuns or Sisters of Mercy came out of the Church, and begged for protection which it is needless to say was given them. One of the Reverend gentlemen on being interviewed by the General told us that the \"Northcote\" steamer had passed through Batoche early in the morning and had been attacked by the rebels. Some of my French Canadian battery friends were meanwhile talking to some of the other Priests who told them that Riel had visited the Church early that morning, and told them to come into his camp for protection saying if they did not do so that on the arrival of the soldiers the Priests would be killed and the women suffer a worse fate. They said that Dumont had paid them a visit on the previous evening. Advancing close up to the river we unlimbered the guns and commenced firing at the houses on the north bank of the river and we soon saw the people making for the bush, during this time everything was quiet around us, and we thought we were in for any easy time, as we afterwards found out now would have been the time to have taken the rifle pits below the Church, as they were empty, all the enemy being engaged firing at the \"Northcote\" further down the river, and moreover it was afterwards ascertained that we were expected to come by another route. After a short interval our ideas of a good time were dispelled by the war whoop.\nof the Indians which once heard is not forgotten in a hurry, and soon a storm of bullets and buckshot was whistling around our ears, however, as they fired high no damage was done. Here one of our 9-pr. guns missed fire for a few times through some defects in the friction tubes and the fire slackened a little; a party of Indians and Breeds jumped out from the edge of the bush raising a whoop and firing a volley among the gunners which had the effect of startling the horses in the limbers and creating a little confusion. Captain Peters hurried up the Gatling gun and on Lieut. Howard taking charge of it he turned it full in the direction of the enemy at the edge of the bush and made things lively for them, and no more was seen of them. The 90th Sharpshooters were sent to support the Gatling gun, while French's scouts and \"A\" Battery were extended down the ravine to the left of the guns, supported in rear by the 90th. The 10th Royals in skirmishing order on the right front of the Church, with the Winnipeg Field Battery and Boultton's Mounted Infantry on the extreme right, the two companies of the Midland Battalion being reserve. Taking our cover in the conlee as well as circumstances would allow we commenced popping away, here again we were heavily handicapped, the enemy from fifty to sixty yards in front of us having rifle pits which they had strengthened with logs, leaving loop-holes to fire out of, while we had to be contended with the cover afforded by a scrubby bush. Other devices were used by them to tempt us to expose ourselves to their fire, as for instance, putting a hat on a stick, and putting a coat on the edge of the pits to represent the top part of a man, one of those coats was picked up afterwards and on examining it four or five bullet holes were found in it; one of these deceys evidently lurred poor Philips to his fate for in his excitement he got upon his knee crying out \"there he is\" and after he had fired, some of his opponents in the pits who were doubtless watching for a chance like this shot him. Some of the enemy's people on the opposite side of the river had also got the bulge on us and were firing pretty lively. Here while lying around and watching for a chance was to be seen the different characteristics of men, some lit their pipes, one Irishman observing that if had to be shot \"he might as well have a comfortable smoke any way,\" while one of our old soldiers exclaiming that it was not like English soldiers to lie behind bushes, but to charge the enemy at once and to give weight to his words went away down as near as he could get to the rifle pits in company with one of French's Scouts, meantime French's men on our were hanging away. Captain French being up in the front along with them, at this part of the fight Cook of the Scouts got struck and his leg was broken, he shouted out \"boys I'm hit come and help me out,\" then in a second or two afterward he called out \"never mind, I'll crawl out some way or other, you'll get shot if you come near me,\" in less time than it takes to tell this, French\n\nKilled.- Serious Wounded Injured\n\nThe which he\nran over to where he was lying wounded, and lifting him on his back amid a perfect storm of bullets carried him to the rear. We hardly knew which to admire most, the pluck of Cook or the courage of Captain French.\n\nAfter hanging on to this position for over four hours we were ordered to fall back and, while doing so, two of \"A\" Battery men, Twohy and Fairbanks, got wounded; returning to the end of the church we fell into line and Captain Peters begged to be allowed to charge the rifle pits, but the General would not sanction this. Lieut.-Col. Williams was ordered to send down his two companies of the Midlanders (whom I mentioned as forming the reserve) into the ravine and draw the enemy's attention off the battery men, who were ordered to advance in extended order to get Phillips out. Lieut.-Col. Williams begged hard to be allowed to lead his men, but was told to send his senior captain in charge. After our stretcher bearers were told off, we again advanced towards the ravine, the brave Midlanders advancing and keeping up a rapid fire and, after getting over the crest where things were made warm enough, Coyne and Beaudry of \"A\" Battery laid hold of poor Phillips and carried him out, but alas! poor fellow, his brave heart was stilled forever. It being decided that we should encamp close to the scene of the days fighting, Boulton's Mounted Infantry were despatched off to our last night's camping place to escort in our camp equipment and stores. Charpontier, one of our gatling gun-men, was shot in the leg, dying, poor fellow, in the Saskatoon hospital afterwards. During the afternoon another Halfbreed gave himself up to us and was interviewed by the General, he gave particulars corroborating, in many particulars, the Halfbreed's story whom I have mentioned as giving himself up the night previous. Our camp equipment arriving, the \"A\" Battery men proceeded to bury Phillips, all his old comrades attending his funeral, the Rev. Mr. Gordon reading the burial service, and a most impressive one it seemed to all of us, being the first time in our lives that many of us had seen a comrade buried on the battle-field, and that while the battle was still raging; so amid the crash of the gatling gun, the crack of the Winchester and Snider rifles, which at times nearly drowned the reverend gentleman's voice, Phillips was laid down in his lonely grave never again to awake until the last great reveille shall sound.\n\nOur day's casualties for \"A\" Battery were as follows:\n\nKilled.—Gunr. Phillips.\nSeriously Wounded.—Gunr. Charpontier.\nWounded.—Gunrs. Towhy and Fairbanks.\nInjured by a gun wheel passing over him.—Driver Stout.\n\nThe 10th Royals, the 90th Battalion, and gatling detachment, which had all this time been bearing the brunt of the fighting, now\nretired in splendid order to the zareba followed by the enemy, who evidently thought that we were retiring from them as beaten, as they followed us up firing; they were quickly undeceived, however, receiving a heavy fusillade from us. Some of them got into the bush and fired a few stray shots, wounding one man and two horses, retiring as darkness fell. The picquets were posted around the four faces of the zareba, each face in charge of a field officer, and after we got some blankets we lay down in the trenches and the night passed over quietly. On the morning of the 10th the infantry advanced and commenced firing, it was found that the enemy were in stronger force than on the previous day, they had also thrown up some fresh rifle pits during the night, and had otherwise strengthened their position. Our two 9-prs. went out in the forenoon and shelled a house and some bluffs on the opposite side of the river where the enemy had been seen, and in the afternoon the guns of the Winnipeg Field Battery shelled the cemetery which had been taken possession of by the enemy in the night time. Some of the 90th sharpshooters took a position in shelter trenches, which had been thrown up in front of our camp and as the infantry retired at night, followed up by the rebels, the sharpshooters opened a heavy fire which drove the enemy back again. All day long the men who had been in the zareba had been strengthening their position by throwing up entrenchments, the teamsters cutting deep trenches underneath their wagons. The Land Surveyors scouts, about fifty strong, under Captain Dennis, came into camp this afternoon and were received with hearty cheers by all of us. On the morning of the 11th, after sending out the infantry, the General started off with Boulton's Mounted Infantry and the gatling to reconnoitre. One of the priests, Father Moulin, was brought into our camp on a stretcher, having been wounded by a Winchester bullet from the rebels. Some of the Midlanders, led by the brave Col. Williams, drove the Indians out of the rifle pits beyond the cemetery, capturing a lot of blankets and a dummy, which had been doubtless used to draw our fire, and one of our guns shelled the cemetery and rifle pits near the church. In the afternoon the two guns of the Winnipeg Field Battery went out accompanied by an escort of dismounted gunners, and took up a position behind a clump of bushes. In this expedition we were accompanied by the General and the Reverend Mr. Gordon (\"The Fighting Chaplain\" we called him.) Bringing the guns to bear on Riel's Council house, which was conspicuous by its having a white flag flying on it, we soon got the range and blazed away; the people around the houses taking to the woods. The common shells fired with the Royal Laboratory Percussion Fuzes burst nearly every time in the building, but failed to set it on fire. During this operation only a few stray bullets were fired among us, and these from the opposite side of the river.\n\nThe next day we went out reconnoitring in the morning, one party going one way and the other would go another way besides. \"Big Bill\" was forced to go with us. On the way back with the General and reconnoitring the rifle pits we came across what was supposed to be a mine. This place was continued to be mined and would have answered some purpose if some of our men had not fired up the mine and he would have been buried in dark clouds of smoke. We returned to camp about noon and the Sun rose up bright. It has been very hard on our infantry, they have misused their arms and don't practice much, they were more accustomed to under fire than the cemetery. We have no time to spare for Grenades, etc., Grassetts, etc., etc., etc., a cheer, and then the battery answered the fire from the enemy's infantrymen, but the 90th company and cannon crew fellows kept cool, however, and the Winnipeg Field Battery was disbanded, taking it easy. Infantry.\nThis day's fighting showed a decided gain for us, as far as position went, but the rank and file were beginning to get tired of the advancing in the morning and retiring at night, thinking if they could get one good dash among the rifle-pits they would manage to end it one way or the other, and considering that the loss of life in a final dash would not be any more than it was in the manner we were going on—besides stories were beginning to circulate around the camp about \"Big Bear's\" Indians being about to make a junction with Riel's forces, which would have made things more complicated with us.\n\nOn the morning of the 12th May the whole of the mounted men, with one gun of \"A\" Battery and the gatling, accompanied by the General, left camp and started off for the ground which had been reconnoitered on the previous day, and extended, firing on the rifle-pits with the gatling and the 9-pr. During the firing a flag of truce was sent in to the General, carried by Astley, one of Riel's prisoners. This gentleman had a message from Riel, who said that if we continued firing on the houses, killing the women and children, that he would massacre his prisoners. The General promptly sent back an answer that if the rebels would place the women and children in some building and state where it was, that the place would not be fired upon. Astley returned with the message to the rebels, saying he would try to assist his fellow-prisoners, who were confined in a dark cellar, with a trap-door over them and a lot of stones on the door to keep it down. At this part of the day's fighting Kippen, of the Surveyor's Scouts, was killed, and the force returned to camp.\n\nIt has been said that the General's order to attack the rifle-pits with our infantry while he was engaging the enemy on the right, was misunderstood and the order was not carried out; this, of course, I don't pretend to know anything about. After dinner the infantry were moved down to the old position, two companies of the Midlands, under Col. Williams, extended on the left and moved up to the cemetery, and the Grenadiers, under Lt.-Col. Grassett, prolonged the line to the right, the 90th Battalion supporting the Midlanders and Grenadiers. The Midlanders and Grenadiers, led by Williams and Grassett, the whole led by Lt.-Col. Straubenzie, dashed forward with a cheer, driving the rebels out of the rifle-pits in front of the cemetery and the ravine to the right of it. During this time the enemy from the opposite bank of the river kept up a heavy fire upon our men, but it was kept down by a few of the Midlanders. One of the 90th companies was sent to support Lt.-Col. Williams on the left and came in for the full brunt of the fight. Meantime our gallant fellows kept pushing on until they came to the houses. Before this, however, Lieut. Fitch of the Grenadiers was killed. One of the Winnipeg 9-prs. now commenced shelling the houses, but the gun was disabled after firing a few rounds, one of \"A\" Battery guns taking its place, the 90th Battalion, the Surveyors Scouts, Boulton's Infantry and French's Scouts prolonging the line to the left. Lieut.\nRivers was ordered to bring the Gatling gun up in the front of the 90th regt., which he did in gallant style, firing a few volleys, after which a general advance was made. While storming one of the houses the gallant Captain French was shot through the heart, exclaiming as he fell, \"remember, boys, I led you\"; and I only think, echo the sentiments of all my comrades when I say that amongst the brave fellows who shed their blood for Canada in the North-West rebellion, none was more sincerely mourned for than gallant \"Jack French.\" Riel's prisoners, whom I have mentioned as being confined in a cellar, on hearing the cheers of our men, commenced hammering for the troops to let them out, and soon the trap-door was smashed open and the poor fellows emerged from their prison more dead than alive, shaking every one by the hand with whom they came in contact with. One of them afterwards told us that on hearing the noise outside they thought it was the war-whoop of the Sioux Indians, and that their last hour had come. Twenty-five of the rebels were found dead on the ground around the houses and two more on the river bank below the graveyard. Among the killed were two of Riel's Council; Riel and Dumont had escaped. A company of the 90th, a company of the 10th Royals and the Gatling gun detachment bivouacked for the night around the buildings. The dismounted men of \"A\" battery having to form part of the reserve force on the afternoon, were excluded from taking part in the closing part of the fight, did the only thing that could be done, cheered their brave comrades on their return to camp; and so after four days' fighting ended the battle of Batoche, and all of us knew that the campaign, as far as the half-breeds were concerned, was finished. Our foemen were at least worthy of our steel, fighting bravely, and doubtless had they been supplied as we were with artillery and Gatling guns, they would have held out much longer and many more of us would have come to grief. Next day, 13th May, was taken up by the General interviewing the prisoners who had either been taken or voluntarily surrendered themselves to our force, and by some of our fellows who paid a visit to the scene of the late conflict. With the exception of a few crazy old shot-guns not worth a few cents each, I did not see any of the much-talked-of \"loot\" that such a howl of indignation was raised over. Perhaps the guns I have mentioned might have been used at some bygone date, but at the time when I saw them must have been more dangerous for the party firing them than for the party fired at.\n\nTaking a walk round the camp I saw Captain French's body with a bullet mark through his buckskin jacket, through which oozed his hearts blood, near him was poor Kippen and Fitch—all alas! gone forever.—Several wounded Indian prisoners were lying on stretchers around the hospital tent, our Medical Officer doing everything for their comfort. The principal talk amongst all of us now was the capture of Riel and Dumont, and there was among lots of our fellows lurking about, it was thought, that we hoped to find this block of wood be able to stand this morning. We had dupoys, and our skirts were tied up as that done by the men from Haldimand, that division of the Marching Battalion I was under, who wore houses, blankets, and pitch-pots over the entire body. A heavy rainstorm detached the detachment being camped that afternoon by the creek, whereabout they simply sat down. General Macdonald over him. The Middlesex men in their tents for several days. The news and newspapers that night next day heard to be going to be true after heard the prairie, and the battle, and we marched up to the section, and 190 of our comrades, our favourite ending in Camped to Albert.\nlooking unexpressed hope that Gabriel would get away; I suppose it was the soldiers feeling for a brave man. Riel on the other hand we hoped to be able to capture, so that if he was responsible for all this bloodshed and misery we saw around us on every side, we would be able to hand him over to the laws of our offended country. Next morning 14th we marched out of our entrenchments towards \"Gar-dupoy's\" Crossing on the Saskatchewan, and striking an open plain skirted the edges of the thickly wooded river banks, where the rebels had dug rifle pits all made to bear on this open place. It seemed to us that these pits had been built or dug to intercept us had we come from Humboldt on the Batoche trail, luckily we did not come in that direction or it might have been so much the worse for us. Marching through a half-breed settlement north of Batoche, which I was unable to find the name of, and which contained some good houses, barns, farming implements, &c., we camped for the night and pitched our tents for the first time in five nights, having lain in the entrenchments with our blankets around us for the last few days. A heavy rain fell to-night, the first we had had since we left Fish Creek. Next day the 15th the mounted men and the Gatling gun detachment went out on the hunt after Riel and Dumont, the former being captured and brought into camp about four o'clock in the afternoon by Howie and Armstrong, who doubtless had an idea of his whereabouts before hunting him up,—he made no resistance but simply said, \"take me to your General.\" After being interviewed by General Middleton he was placed in confinement and a guard put over him, Lepine his Lieut. surrendered himself to us about 7 o'clock. The Midland Battalion crossed over the river this afternoon, pitching their tents. Prince Albert is to be our next stopping place for a few days. The mail came in to-day and we had a good time with letters and newspapers. Next day crossing the river the battery encamped at night near where the Midland Battalion camped yesterday. We heard to-day for the first time of Poundmaker's attack on the teams going to Battleford, but did not believe it, although it turned out true after all. Next day being Sunday we went to Church, and heard the Revd. Mr. Gordon preach, the Church being the open prairie, and for seats we had the green sward. Next day Monday the battery men who wanted cash got paid and about eleven o'clock we marched off toward Prince Albert. Our casualties in the column up to this amounted to 18 killed, 12 died of wounds received in action, and about 80 wounded, while the enemy's loss was 60 killed and 190 wounded. To-day we were cheered up on the march by our comrades of the Winnipeg Field Battery singing songs, the favourite being \"We don't want to go over there any more,\" and ending in a good chorus, in which we all shouted ourselves hoarse. Camped to-night at \"Beaver Creek,\" eighteen miles from Prince Albert. Before leaving Beaver Creek this morning at 5.45 a.m.,\nthe following telegram from Lord Wolesley, commanding the troops in Egypt, was read out to the different corps on parade:\n\n\"To General Middleton, Batoche,\nBest congratulations to you and my old gallant comrades of Canadian Militia.\nSgd. Wolesley.\"\n\nThe following telegrams were also received from His Excellency the Governor-General, Lord Lansdowne, and from Sir A. P. Caron, Minister of Militia and Defence.\n\n\"Accept my hearty congratulations on your success, you have had a task of exceptional difficulty, please tell your gallant soldiers that as the Queen's representative here, I congratulate them on their behaviour, not only in this action but during the toils and hardships of the advance. The list of casualties is I fear heavy, we can ill afford to lose such officers as Captain French; my sincere sympathy is with the wounded, and I will be glad of any information as to their condition.\"\nSgd. Lansdowne.\"\n\nThe Major-General has much pleasure in communicating to the troops, the following message from the Minister of Militia to the force as well as himself.\n\n\"Accept for yourself, your officers and men our congratulations for the brilliant victory you have achieved, I mourn the loss of so many brave men fallen in the field of honor in defense of law and order. Do every thing that can be done for the wounded, and let me know as soon as possible how they are doing. With regard to the above message the Major-General has already by word of mouth informed the troops of his appreciation and thanks for their conduct on the 12th inst., but he wishes to put them in record in general orders, and to add that he feels very little if any thanks are due to him, as he considers that he owes all the success of that day to the pluck and dash of the officers and men.\" Extract from Division Order 14th May 1885.\"\n\nSo much for telegrams—now for the road, starting off we soon came into a different country from that we had just left. Settlers houses and ploughed fields, giving everything a more home like look than we had been used to for some time past. Some of the settlers had ventured out of Prince Albert on to their farms, but in most cases their houses were empty and the land lying uncultivated. Soon we got covered with the black dust which rose from the trail in a cloud and made us look like a lot of coal heavers; it was next to impossible to get a drink of water, and all of us were nearly choked with thirst, the battery men being worse off in this respect, as we were walking in the clouds of dust raised by our horses and guns. At last about eleven a.m., we entered into a long irregular street of houses skirting the river, the 90th Battalion band playing music, relieved by the drum and fife band of the 10th Royals, passing the Mounted Police and Prince Albert Rifles, who, under command of Col. Irvine were drawn up to welcome us in, we got the command to \"halt,\" \"front,\" and after an eighteen mile march we were in Prince Albert.\nCHAPTER IV.\n\nFROM PRINCE ALBERT TO FORT PITT.\n\nPrince Albert or the \"Missou:\" The few words I shall write on this subject are copied from my notes which say:—It is a straggling looking place, the principal street being built facing and parallel to the south bank of the North Saskatchewan River. Up to a few years ago it was a village of a very few houses, until some enterprising priest or minister started the sale of the township lands, a land \"boom\" broke out and the place grew up as if by magic. All the evidences of civilized life are here: a jail, post office, bank (Branch of Montreal,) and stores, where it is just possible you will have to pay pretty dearly for everything you buy. It is needless to say that the Hudson Bay Company have a store in the town. The population is a mixture of whites and half-breeds, and I should think would number from fifteen hundred to two thousand. Taking a stroll from camp, in company with Matt. Coyne, we called into the Prince Albert Rifle Barracks, and Matty coming into contact with one of his Red River comrades we were soon at home; we washed some of the black dust from our countenances, the volunteers treated Matt. and I to tea, we fought Fish Creek, Batoche, and the Red River expedition over again, and were happy. At this place I learned for the first time that the volunteers had had their arms taken from them and the corps disbanded on the plea of inefficiency the previous summer. The volunteers spoke in no measured terms of the mean policy of the authorities for doing so. We heard to-day that in all probability Middleton's column would proceed to Battleford to bring Poundmaker to reason. May 20th, Captain Drury kindly sent round a letter, which he had received from Col. Cotton, for our perusal, in which the Commandant after giving a few words of praise to the battery on their behaviour, went on to give a graphic account of the blowing up of the \"Ice Bridge\" at Cap Rouge, and a lot of interesting news connected with the doings of the people at head-quarters. We were visited by large crowds of people who came to have a look at our 9-pounder guns, but the great object of curiosity was the gatling gun, it being the first machine gun that had ever been up in that part of the world. On the 21st, \"Beardy,\" the indian chief came into camp and as his explanations about his share in the Duck Lake not being considered satisfactory, General Middleton took\naway his \"treaty\" medals from him. About 6 p.m., the Right Division of \"A.\" Battery with one field gun and a gatling was ordered to parade for embarkation on the steamer \"North-West\" for transport to Battleford, after marching a distance of three miles we embarked, and taking off our accoutrements commenced to take in and stow away gun and small-arm ammunition, which kept us going until eleven o'clock at night, after which we had tea and went to sleep on our oat sacks. Next morning Boulton's troop came on board with their horses, and the Midland Battalion, numbering about three hundred of all ranks, with their stores; so we were pretty tightly packed, over four hundred men in the hold, the horses on the freight deck playing a tattoo over our heads, making it anything but pleasant at night, especially when we wanted to sleep. In addition to the before mentioned troops we had with us General Middleton and his staff. About 10.30 a.m., we steered away up the river towards Battleford, which is a distance of about one hundred and seventy miles from Prince Albert. The description of boat used on the Saskatchewan is the stern wheel pattern, which draws a light draught of water, about four feet, with a hold for freight, freight deck, saloon or passenger deck, and a hurricane deck on which is built the wheel-house. The shifting sandy bed of the river makes the navigation difficult, and it is no uncommon thing for the steamer to get stuck on a sand bar, and then she has to be \"poled\" off. All of the boats carry with them what for want of a better word I should call a navigating lieutenant, whose duty it is to make soundings with a pole marked in feet, and shouting out every now and then to the steersman something like the following,—\"five feet, five feet scant, no bottom,\" and so on; some of our fellows soon caught up the cry, and soon \"six feet scant, no bottom,\" was being sung all over the steamer. Wood is burned for fuel, and large depots of it are placed at intervals along the river banks. As night travel on account of the sand bars is impracticable the steamer is hitched up to a tree from dark to daylight; as the nights are comparatively short in this higher latitude, this makes but a small delay. All along the river banks is a dense bush which comes right down to the water's edge. On Saturday 23rd we had a messenger from Poundmaker, who boarded us under a flag of truce, Poundmaker offering to give up his prisoners and plunder, but as the General wants him to give up his arms, no proper understanding was come to. A heavy rain fell, we fixed the gatling on the saloon deck, and fixed things upon the freight deck so as to be well under cover in case we got fired upon from the banks.\n\nNext day, Sunday, 24th, we had divine service, which was conducted by General Middleton, and was concluded by us singing the National Anthem in honor of Her Most Gracious Majesty, Queen Victoria, whose birthday it was. Afterwards we were visited by some Halfbreeds who came on board, and at sundown we reached\nBattleford. On Monday, the 25th, we disembarked and marched to our camping ground where we pitched our tents; afterwards turning out for a field day, firing 21 guns, and winding up with the usual march past in quarter column of battalions as follows:—Bolton's Horse, Mounted Police, Dismounted men of R. C. A., Queen's Own, and Midland Battalion. Battleford appeared to us at that time one of the loveliest spots which we had yet seen in the North-West. The settlement is built on a peninsula of land between the North Saskatchewan and Battle rivers; opposite our camp was \"old\" Battleford, which place the Indians had looted at the commencement of the troubles; this part of the settlement contained Government House, the seat of the North-West government before it was transferred to Regina. Poundmaker's prisoners are coming into camp and we expect that to-morrow we will see that redoubtable chief come into Battleford. Captain Howard told us to-day that another month would see us home and that we would fire the Dominion day's salute in Quebec, how far this tale came true we all know. This afternoon Poundmaker sent in the Battleford mail which he had detained since April. On Tuesday, 26th, a lot of Halfbreed prisoners from Poundmaker were sent into our camp, and about noon that gentleman, with about twenty of his councillors, came in and a great \"pow wow\" ensued. After things being sifted out Poundmaker, with two of his chiefs, were made prisoners and sent into the police barracks for safe keeping. The murderer of Payne, farm instructor to the Stony Indians, gave himself up to us, acknowledging his guilt; he pleaded in excuse for the act that his child being sick, without anything to eat, he went to Payne asking him for food, this being refused, with an intimation that if he did not clear out he (Payne) would shoot him, he said that he shot the instructor in self-defence, adding, when he acknowledged his guilt and gave himself up to justice, \"do with me as you wish, but be kind to my wife and family.\" I, of course, do not vouch for the truth of the Indian's story, but can vouch for being present at the pow-wow and hearing his language translated to the General. In addition to the prisoners, about 250 stands of arms were brought into camp and handed over to the police. As it was well known that there were more arms in the possession of his braves Poundmaker, on being questioned as to their whereabouts, replied that about one hundred and twenty of his young men had kept them and had gone off to join \"Big Bear,\" another rooster whom we expected to \"square yards\" with. I have said somewhere in these notes that I did not think much of the Indians, but I make an exception in favor of the Cree Chief, Poundmaker, being the most noble looking and dignified red man I had seen on the plains; nothing seemed to move him, and he sat amongst his councillors seemingly the most unconcerned of all the dusky crowd. Having some curiosity as to the origin of his name, I made enquiries and found out the following:—Some years ago, when the\nbuffalo were plentiful on the plains of the North-west, they were staple articles of use and commerce for the Indians. Poundmaker, then a young man, had acquired great skill as a hunter, and as powder and shot were not to be easily had, he contrived a plan of a \"pound,\" and, driving the animals into this place, shot, or otherwise killed them; hence the name, \"Maker of the Pound, or Poundmaker.\" Several people having asked me the origin of the, to them, strange name, I have ventured to give this explanation in hopes that it may be new to some.\n\nNext day we were visited by lots of Indians, and our fellows did a great trade with them in the way of buying \"euros.\" The 90th Battalion came in yesterday from Prince Albert; a foot-ball match was played today between the 90th Battalion and the Queen's Own Rifles, resulting in a victory for the latter corps. On Thursday, 28th, the remainder of \"A\" Battery joined us, having come up from Carleton by boat. Orders were issued to-night calling for volunteers to serve in the North-West for a short term—men from the permanent corps not eligible. As our clothing was nearly played out we got fitted up with a kind of canvas suit and bloomed out into prairie dudes. On Saturday night, 30th May, a mounted messenger arrived from General Strange asking for re-inforcements, and soon we were all in hurry and bustle again, being ordered to embark at midnight, but this order was changed to embarkation in the morning, and a good thing it turned out to be morning, as the night set in wet some of our fellows who went on fatigue getting drenched to the skin. On Sunday morning, therefore, we embarked on board the steamers \"North-West,\" and \"Marquis,\" the \"Alberta\" being loaded up with supplies.\n\nOur forces consisted of about the following number of troops. On board the \"North-West,\" General and Staff, Midland Battalion, 35 men of \"A\" Battery, 35 men of \"B\" Battery with two gatling guns and about two hundred thousand rounds of small arm ball cartridge, and gatling gun ammunition. On board the \"Marquis\" were the 90th Battalion, 10th Royals, Teamsters and their teams, Boulton's Horse, Surveyor's Corps, Mounted Police, and French's Scouts, proceeding to Fort Pitt by the trail. Fort Pitt is distant from Battleford about one hundred and thirty miles by river, and ninety odd miles by trail, and the country looks from the river pretty much as it did in the journey from Prince Albert to Battleford. On our Sunday journey, we had a messenger from General Strange, who gave us a pretty good idea how things were looking in that quarter. Next morning we got under way, and going on a little way picked up a barge containing ammunition, and in which was a party of 65th (Montreal) and some half-breeds. On arriving nearly opposite General Strange's position, the news came on board that \"Big Bear\" had cleared out, leaving his camp \"all standing,\" and here was a nice state of affairs, as instead of having to fight him...\nat Frenchman's Knoll, we would have to chase him to the woods — perhaps potter around all the best part of the summer. Early this afternoon General Strange started off in pursuit, leaving his Infantry to occupy Big Bear's camp, who had left nearly all his stuff, taking with him the white and half-breed prisoners, including the McLean family. Shortly after eight o'clock next morning the troops from the steamers disembarked and took up a camping ground at about four hundred yards from the north side of the river bank and awaited further orders. This afternoon I saw the Revd. Mr. Quinney and Mrs. Quinney, who both had made their escape from the Indian Chief's camp. To-night the \"Alberta\" dropped down the river to Battleford for provisions. Our column numbered including General Strange's force at this time over seventeen hundred men of all ranks. On the morning of the 3rd June, the mounted men of the column started off to hunt up the enemy, taking with them six days' provisions for man and horse, provisions being carried principally on pack saddles. The mounted force were composed of three hundred and eighty men, and were taken from the following corps, Surveyor's Corps, Boulton's Mounted Infantry, French's Scouts, Major Steel's Cowboys, and Mounted Police, fifty men of each Battalion, 1 Gatling gun, Captain Peters, Captain Howard and Mr. Rivers went off to join General Strange as a reserve for the mounted men. Early on the morning of the 4th, getting up steam on the \"North-West\" we steamed up, coming alongside the river bank, opposite the ruins of Fort Pitt, the troops who were encamped, marching up the river side, and camping within a mile of it. Steel's men had a brush with the enemy to-day, killing thirteen or fourteen of them. The report came here that the prisoners were to be killed, but this atrocity was prevented by the intervention of the \"Plain\" Crees.\n\nNext day the \"B\" Battery gatling gun went out, a whole lot of prisoners came in from Big Bear's camp, and among them were Mrs. Delaney and Gowanlock, the latter, went on board the \"North-West,\" the others camping opposite the landing, the 150 men who went out on the third, returned to-night, the trail, for dismounted men, having been found impracticable. A lot of fellows from Edmington who were unloading ammunition on board the \"North-West\" struck for higher pay, being at the time in receipt of $5.00 per diem. On Sunday 7th the Midland Battalion proceeded up the River to \"Frog Creek\" by steamer, thence by march to Frog Lake, six or seven miles inland, to the scene of the late massacre, so that in the event of the enemy making this place a base of operations things would be made lively for him. A report reached us this afternoon that the Queen's Own Rifles and the mounted divisions of \"A\" and \"B\" Batteries had left Battleford for Turtle Lake to intercept the Indians should they attempt to make their escape in that direction. The \"Alberta\" came in to-night having a Mail on board, starting\nnext day for Edmington. News came in from the front this afternoon that our column had come across a lot of the enemy's camp equipage, wagons, buck-boards, &c., which they had left behind them in their flight. Our column left all their tents, &c., behind them, only taking with them a single blanket so as to get over the ground quickly. The river rose about six feet during the night, bringing down everything with it in the shape of lumber. Depots for provisions had now been made all along the line of march at intervals of about eighteen miles, and our fellows were about eighty miles from the Head-Quarter camp of Fort Pitt. Newspaper and other reading material being scarce at this place some of the fellows fell back upon their natural gifts and invented a few good lies, dressing up old ones and serving them up as new. On Thursday 11th news came into camp that the General finding the forest impracticable had retraced his steps, this report was verified by the return of the troops to camp on the following day. On Monday, June 15th, a company of the 10th Royals went up the river to Frog Lake on the steamer \"Alberta\" returning at night; a party of the 90th Battalion going out to Big Bear's late encampment, accompanied by teams, brought in three waggon loads of provisions which that gentleman had left in his hurry. A report came into camp this afternoon that over two hundred of the Chipawayan Indians had surrendered themselves to General Middleton. 16th June—The steamer \"Baroness\" with two companies of the Midland Battalion and a lot of boxes containing articles from the friends of the Volunteers came up from Battleford, as a lot of the boxes and other things had been \"gone through\" there was no end of a row, but for all that the fellows in camp had a good time at night.\n\n17th. The companies of the Midland battalion who arrived here yesterday went on to Frog Lake by steamer.\n\n18th. Some of General Strange's men in camp today, their headquarters are at \"Hen\" Lake. More provisions sent away to General Middleton's camp. A fearful thunder storm set in to-night, the rain falling in torrents and drenching us all to the skin.\n\n19th. The \"North-West\" went up the river today having provisions for the troops on board, taking in addition twenty thousand rounds of Snider and about five thousand rounds of other ammunition with her. News reached camp this afternoon of the release of Big Bear's prisoners. The General arrived in camp to-night.\n\n20th. Release of Big Bear's prisoners confirmed, the General and a party of mounted men going out to meet them, taking with them boxes of clothing for the use of those who stood in need of these articles.\n\n22nd. Big Bear's prisoners arrived in camp this morning (the McLean family being among the number) and went on board the \"Marquis.\"\nFrom this on to the 30th of June nothing of any importance took place; the different corps kept coming into camp leaving for their different homes, it having been decided to give up the chase; as is well known Big Bear was captured by the North-West Mounted Police at Carleton in the beginning of July. The \"A\" and \"B\" Batteries of Artillery, with the \"C\" School of Infantry, left Fort Pitt for Battleford on the forenoon of the 29th June, arriving at their destination on the 30th, and here we were joined by our comrades of the mounted division, who had been out with Col. Otter, and compared notes about our last month's doings. And now, for us, commenced a long spell of garrison duty in Battleford, relieved only by an occasional day's shooting or a cricket match. We had our annual course of rifle practice, gun practice, fatigues at the police barracks, and drills, and lived in daily expectation of being called home, but that comfort was denied to the men of the batteries, for on Saturday, the 12th October, a telegram from the D. A. General, at Ottawa, was received, ordering \"A\" Battery to occupy government house for the winter, and \"C\" School of Infantry, who had been our comrades for the winter, were ordered home to Toronto.\n\nAnd now, in concluding these few notes, imperfect as they are I hope they will give to any one who cares to read them a fairly accurate idea of our trip from Quebec to Fort Pitt. I have omitted many details, thinking that they might not be possessed of sufficient interest to be read I hope I have avoided dwelling on the gloomy side of things, believing that nothing is so bad but what it might be worse. For my old comrades of \"A\" Battery I shall always have the hail fellow well met feeling of a soldier I hope. And while remembering the living, to the memory of the gallant battery-men who lost their lives in behalf of Canada, I echo the poets words—\n\n\"Their good swords rust,\nTheir bones are dust,\nTheir Souls are with the Lord we trust.\"\n\nTHE END.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_92684.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 46, "total-input-tokens": 70472, "total-output-tokens": 26662, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2560, 3], [2560, 3678, 4], [3678, 3678, 5], [3678, 4053, 6], [4053, 5022, 7], [5022, 7410, 8], [7410, 10639, 9], [10639, 13186, 10], [13186, 15212, 11], [15212, 18574, 12], [18574, 19323, 13], [19323, 21145, 14], [21145, 24114, 15], [24114, 26435, 16], [26435, 29727, 17], [29727, 32821, 18], [32821, 35850, 19], [35850, 38949, 20], [38949, 41642, 21], [41642, 44083, 22], [44083, 46417, 23], [46417, 49437, 24], [49437, 52505, 25], [52505, 55339, 26], [55339, 59403, 27], [59403, 62400, 28], [62400, 65346, 29], [65346, 68363, 30], [68363, 71485, 31], [71485, 74264, 32], [74264, 78198, 33], [78198, 81330, 34], [81330, 85091, 35], [85091, 88104, 36], [88104, 91063, 37], [91063, 93490, 38], [93490, 96524, 39], [96524, 99587, 40], [99587, 102557, 41], [102557, 105553, 42], [105553, 108357, 43], [108357, 110355, 44], [110355, 110355, 45], [110355, 110355, 46]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, false, true, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 270, 0, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]