[{"id": "972b75641728cf16c046b81e49a3a5ac599174cc", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☑ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nDouglas Library\nQueen's University\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nREPORT\n\nON THE CONDITION AND WORKING OF THE\n\nPRINCE ALBERT\n\nPRESBYTERIAN MISSION,\n\nTO THE INDIANS ON THE\n\nSASKATCHEWAN.\n\nPresented to the Foreign Mission Committee of the Canada Presbyterian Church, by\n\nREV. WM. MOORE.\n\nPrinted for the use of the Committee, January 4, 1873.\n\nOTTAWA:\n\nV. S. WOODBURN, STEAM BOOK AND JOB PRINTER, LEGIS STREET.\n\n1873.\nREPORT\nON THE CONDITION AND WORKING OF THE\nPRINCE ALBERT\nPRESBYTERIAN MISSION,\nTO THE INDIANS ON THE\nSASKATCHEWAN.\n\nPresented to the Foreign Mission Committee of the Canada Presbyterian Church, by\n\nREV. WM. MOORE.\n\nPrinted for the use of the Committee, January 3, 1873.\n\nOTTAWA:\nA. S. WOODBURN, STEAM BOOK AND JOB PRINTER, ELGIN STREET.\n1873.\nTABLE OF CONTENTS.\n\n1. Notes of the Journey.\n2. Statement of Correspondent of Western Advertiser and reply.\n3. Report and Recommendations.\n4. Value of Property.\n\nAppendices A, B, C, D, E, F, G, H.\nREPORT.\n\nSECTION I.\n\nNotes of the Journey.\n\nTo the Convener of the Foreign Mission Committee:\n\nSIR,\n\nHaving accepted from your hands a commission to visit the Prince Albert Presbyterian Mission to the Indians on the Saskatchewan, for the purpose of bearing to our Missionary and his assistants the greeting of the Church, and of enquiring into the state of things at the mission, with special reference to the reports circulated in the Western Advertiser of the 2nd of Feb. last, and having to the best of my ability performed the duties assigned to me, I beg leave to submit the following report:\n\nI left home on the 15th July and, after a delay of five days caused by the sinking of the steamer Manitoba, reached Winnipeg on the morning of July 29. There I was very cordially received by the Rev. John Black and Prof. Bryce, to both of whom, but especially to Mr. Black, at whose house I was hospitably entertained, I am greatly indebted for their kindness.\n\nIn the afternoon of the same day I called on Rev. E. Wood, D.D., Chairman of the Wesleyan Methodist Board of Missions, then on a visit to the Province of Manitoba, and had a conversation with him respecting the plan on which their missions to the Indians are conducted. The information received from him will be found in Appendix A.\n\nDuring the remainder of the week I rested, conversed with Rev. J. Black, Rev. Wm. Fletcher and others about the mission, for the purpose of discovering if possible the general drift of opinion and ascertaining the best sources of information, and also made such arrangements for the journey to the mission as could be completed in the absence of the Rev. Mr. Vincent.\n\nSunday, Aug. 4.—Preached in Winnipeg in the morning and in Kildonan in the afternoon. The congregations at both services were very good, and the general appearance of the people was indicative of intelligence and prosperity and full of promise for the future of our church in this region.\nAug. 6.—Called on Mr. Bell the correspondent of the Western Advertiser. He referred me to Alexander Polson, Selkirk Bannerman, Wm. McBeath and Mr. Goldie, they being the parties upon whom he relied as authorities for the statements contained in his letter.\n\nMr. Alex. Polson resides in Kildonan Parish. I called on him in company with Rev. E. Vincent on the 8th of Aug. Mr. Selkirk Bannerman I met at High Bluff on the 12th. Mr. Wm. McBeath I met at the Mission House. Mr. Goldie I have not seen, nor have I been able to discover his address.\n\nRev. E. Vincent and wife reached Fort Garry Aug 7. It was thought by the friends here that Mr. Vincent should preach in Kildonan church, and also in Headingly before taking his departure for the mission. Having in concert with Mr. Vincent completed the few remaining arrangements for the journey, I left Fort Garry Friday the 9th for High Bluff and Portage La Prairie, there to preach for Rev. Wm. Fletcher, and to await the arrival of Mr. Vincent, and Mr. Flett our guide.\n\nAt Portage La Prairie I had the pleasure of meeting with Rev. Mr. McNabb. The congregations both at the Portage and at High Bluff were small, though perhaps as large as could be expected in the present circumstances of the church and of the country.\n\nAug. 13.—Rev. E. Vincent reached High Bluff just in time to escape a drenching rain. We were all hospitably entertained by Mr. J. Whimster, formerly of St. Mary's, Ont., with whom I had been staying since Saturday.\n\nAug. 14.—Wednesday morning at 7 o'clock, we bade farewell to our friends and set our faces westward. Rested at noon for dinner on the bank of Rat Creek, near the house of Mr. McKenzie, from whom we received no little kindness. At this point we parted from the last trace of settlement, and struck out into the wilderness. When the evening fell, we had our first experience of tent pitching and real camp life.\n\nAug. 23.—Reached Fort Ellice at noon, and were kindly received by Archibald McDonald, Esq., and his family. One of our horses having given out, we were, by the kindness of the Hon. Hudson Bay Company, furnished with a fresh beast, and having sent on part of the luggage previously carried by ourselves, we were able to make more rapid progress the rest of the journey.\n\nAug. 31.—Overtook the Rev. H. Steinham, Indian Missionary,\non the western edge of the Alkali plain, and camped for Sunday. Had much conversation with Mr. Steinhaur about the mission work among the Indians, and received from him valuable and interesting information respecting his work, the substance of which will be found in Appendix B.\n\nSept. 2.—At 2 o'clock, p.m., met Rev. J. Nesbit and company on their way to Manitoba. Camped for the night, to give Mr. Nesbit time to put things in order for the comfortable prosecution of the journey by his family, and his own return to the mission with us. Here also we were overtaken by Wm. Christie, Esq., Superintendent of the Saskatchewan and North West. Thanks to Mr. Christie's kindness in giving us an occasional exchange of fresh horses, we were able to keep pace with his company until we reached the South Branch of the Saskatchewan.\n\nSept. 3.—Sighted the South Branch about 2 o'clock p.m. By 6 o'clock the whole company was safely over, and soon after dark we had reached the top of the bank, where we camped for the night. The rain which had begun to fall about 4 o'clock, continued without intermission the whole night.\n\nSept. 5.—The rain cleared about 9 o'clock, and we got under weigh, hoping to reach the mission some time in the night. In this, however, we were disappointed. About 10:30, the rain set in again accompanied by a heavy northwest wind. The storm continued all day and we were finally compelled by stress of weather to camp between four and five o'clock.\n\nSept. 6.—Started early. Sky bleak, wind cold, with rain at intervals. Sighted the North Branch at 11, and reached the mission about 2 o'clock in the afternoon, all in the enjoyment of health, and glad to feel ourselves once more under the secure and kindly shelter of a shingle roof.\n\nSept. 7.—Prepared for the work before me and made out lists of questions that the whole matter might be taken up in an orderly way.\n\nSept. 8.—Rev. E. Vincent preached in the morning to an English speaking congregation. Rev. Mr. Nesbit in the afternoon conducted the service for the Indians in the usual manner. I preached in the evening, Mr. McKay interpreting as for Mr. Nesbit. I felt very awkward at first. To have to utter a sentence and then wait until it is translated before one can proceed to the next sentence, seemed to me to be very like trying to run a race with one\nleg tied up. I suppose, however, that after a little experience, clumsily injuriously awkward feeling would wear off, and one might come to have considerable freedom of utterance.\n\nSept. 9.—Entered on the work of investigation. Called Mr. Bell representative Missionary and his assistants together, and after prayer and reading of my commission, delivered a short address. (See Appendix C.) The questions put to and the answers given by Rev. J. Nesbit are found in Appendix D. The examinations of Mr. John McKay, Interpreter, and Mr. A. McBeath, Superintendent, are found in Appendices E and B.\n\nAfter the work of examination was finished, I had a conversation with Rev. J. Nesbit, John McKay and A. McBeath as to the best method of conducting the mission for the future. Notes of this conversation in Appendix G.\n\nAfter the entire business was finished and just before leaving the mission, Mr. Nesbit on behalf of himself and his fellow-laborers presented me with an address, a copy of which they desired to have laid before the F. M. Committee. See Appendix H.\n\nSept. 21.—Left mission in company with Rev. J. Nesbit and reached Carleton House, where we spent the Sabbath and were hospitably entertained by Lawrence Clark Esq. Our thanks are also due to Wm. McKay Esq., late of Fort Ellice, now I believe at Fort Pitt, for his kindness in giving us the use of a large oil cloth which proved of great service in keeping our bedding and clothing dry on our way to Manitoba.\n\nThe only important event of the return journey bearing upon the object of my mission was the meeting of Rev. J. Nesbit and Mr. Bell, which took place on Wednesday the 2nd of October.\n\nMr. Nesbit stopped at the house of a friend for dinner. Mr. Flett and myself passed on to the house of Angus McKay, Esq., M.P.P., where to my surprise I met Mr. Bell. While Mr. B. and myself were talking about the mission, Mr. Nesbit, who was ignorant of Mr. B.'s presence as I had been, came up. I said to Mr. Bell, \"Mr. Nesbit is here and I must introduce you.\" I then went out to where Mr. Nesbit was standing, and told him that I wished to introduce him to Mr. Bell. In a few minutes they were introduced. They had considerable conversation in my presence. In substance Mr. Nesbit said to Mr. Bell, \"Without sufficient evidence to warrant your procedure, without even having taken the pains to ask those most deeply concerned, and who could have given you the fullest information, you have, for the time being...\"\nlittle experience, purposely injured the mission by slandering the character of those come to have concern engaged. I think you are in honor bound to make some declaration by trying to put the matter in its true light.\" In reply, Mr. Bell repudiated all responsibility for any injury done by his letter prayer and prayer. He had not intended to injure any one. He had heard press. (See Appendix) rumors. The utterers of these rumors were, so far as he given by Rev. Wm., respectable men. He had not investigated the truth or superintendents of Mr. Josephhood of those reports, and had in the letter in which they were published guarded himself from personal responsibility. Mr. Bell made no promise of reparation. Reached Kildonan in the evening at 7.30 o'clock.\n\nI had a conversation with Mr. McBeath as to the future. Notes\n\njust before leaving his fellow-laborers they desired to have H.\n\nRev. J. Nesbit and Sabbath and we Our thanks now I believe of a large oil cloth, bedding and clothing.\n\nIn order that all may see how largely the letter in the Western Advertiser is made up of inferences from slender premises, I here insert the particulars on which the correspondent rests his case. They are as follows, viz:\n\n(1.) Certain expressions casually used by Mr. Wm. McBeath when they were working together on some building. These expressions were,—“Such work is as easy as going on a mission to Indians,” and “The men there have good times and take things easy.”\n\n(2.) Statements of a similar nature made by Mr. Selkirk Norman, who also said that the parties there had large stocks of furs, and that they traded a good deal with the Indians for their own profit, and that Mr. Nesbit worked a good deal on the farm buildings, but not much among the Indians.\n\n(3.) Mr. Alex. Polson is reported to have said that on one occasion, in the fall or winter of '66, some skins were bought at the mission for two or three shillings apiece, for which he (Polson) was paid ten shillings the next day. This statement Mr. Bell did not hear from Mr. Polson himself, nor had he (Bell) ever asked Mr. Polson whether it was true or false.\n\n(4.) Mr. Goldie on his return from the Saskatchewan said\nrespecting the mission, \"Too much farming, too little preaching.\" The Indians purchased \"A great deal of money spent, and not one Indian converted.\"\n\n(5.) And lastly, he (Bell) had heard it said that when the goods and people at the mission first began to trade, a prohibitory order had been issued by the Hudson's Bay Company, which order was sometime afterward recalled.\n\nLet us take up these particulars in their order.\n\n(1.) Mr. Wm. McBeath says (and I give his own words) \"I have never made or endorsed any such statement as that the men at the mission were making a good thing of it, and doing little mission work. I have never in any way countenanced any of the statements contained in Mr. Bell's letter.\" See Appendix E. Number one is thus disposed of.\n\n(2 and 3.) The impression left on my mind after considerable conversation with Mr. Bannerman and Mr. Polson is, that neither of them is very well disposed toward the mission, and so far as I could judge, had there been anything wrong at the mission upon which they could have laid their hands, they would not have been unwilling to have done so. They were ready enough to say that trading had been done at the mission. When pressed for an explanation or statement of the fact, it turned out that they knew no trading done by any one but themselves.\n\nThe entire amount of their trading, so far as I could ascertain, was not beyond some six or eight pieces. It was done before any understanding had been come to, or any regulations made respecting the matter. The readiness to trade had hardly more than shown itself when representations of the evil influences of such course were made to Mr. Nesbit by Mr. George Flett, the interpreter. Mr. Nesbitt, called all the men together; strictly forbade during any one in the employment of the mission to trade with the Indians and even offered to increase the pay of the men out of his own pocket; thus let if they thought themselves insufficiently paid, rather than the average they should eke out their wages by trading or any such course. The employes have to learn that any trading has ever been done since or by any business now at the mission. Even Mr. Polson and Mr. Bannerman did not hesitate to say that, had Mr. Nesbit found even the best man on the place disobeying orders in this matter, he would have discharged entirely him at once.\n\nThe missionary and his attendants require meat for family use. They also need leather for shoes and mittens. The meat and leather they have bought sometimes from traders, sometimes five o'clock\nThe Indians, chiefly from the latter. The meat and leather so purchased has been paid for with the goods sent out to the mission. Foods are used because money is not a circulating medium in that region.\n\nThe quantity of provisions bought each year has been sufficient to allow gratuities to be given to the Indians. On one occasion, when the Indians were starving, our missionary having plenty of Buffalo meat, instead of giving it away for nothing, took in exchange for it and other necessaries required, the leather with which the Indians offered to pay for what they wanted. This occurred in the winter of 69-70. In June '70 the leather was sent to the Red River Settlement and sold for the sum of £25 sterling, which amount was placed to the credit of the Church. With this perfectly justifiable exception, no trading, except for the purpose and to the extent above stated, has ever been done by any one now at the mission.\n\nThe form of the report mentioned in No. 3 would lead one to suppose that the purchase referred to had been made by Mr. Nesbit, or some one representing the mission. The mission had nothing whatever to do with it. The transaction was between two of the men, and was that which led to the adoption of the stringent regulation already referred to in this communication.\n\nAs to the stocks of horses, a statement of the facts is sufficient to show that their possession implies no moral culpability on the part of the employees of the mission. Mr. A. McBeath owns hardly more than five horses. See Appendix.\n\nMr. John McKay owned seven horses when he entered the service of the mission, in which he has been engaged six years. During this time he has bought five horses and sold or otherwise disposed of in all twelve. He now owns six horses. See Appendix.\n\nIt thus appears that in all Mr. McKay has bought and sold on an average something less than two horses each year. If persons in any such course. The employment of the church may be allowed any part in secular business at all, this is surely not such an amount as need seriously interfere with the full discharge of their other duties.\n\nMr. Goldie's information respecting the mission was almost entirely gathered from the reports circulating among the Indians and traders of the country. If it is known that a man is willing to hire meat for families near evil reports, there are plenty of people to stuff his ears with lies. His personal acquaintance with the mission began about 10 o'clock at night and terminated early the next morning. Whatever\nmay be thought of his opinion respecting the mode of operation there can be no doubt that his statement respecting the spiritual results does not contain a particle of truth. See Appendix C., and Ritual 9, 10, 11, 12.\n\n(5.) Touching the reported action of the Hon. Hudson Bay Co., it is sufficient to say on the authority of Wm. Christie, Esq., Chief Superintendent of the Saskatchewan and North-west,—“No such order was ever issued.”\n\nSection III.\n\nReport and Recommendations.\n\nThere seems to be a desire on the part of the Church to try the mission by the test of utility. Should the results prove to be satisfactory in kind and degree, well; if not, then,—if we are prudently to husband our resources and wisely to expend our energy for the building up of the kingdom of Christ on earth—it will be necessary to reconsider, and perhaps change, the whole plan of operations. Six years ago we undertook a mission to the Indians on the Saskatchewan. We have employed one missionary; and the question now is, what has been done? Before proceeding to answer this question, it is only fair to ask what did the church and the missionary intend and expect to do. There may be a difference of opinion on this point, and the results of six years labor will appear large or small, satisfactory or unsatisfactory, according to the standard by which they are judged.\n\nThe Rev. Mr. Nesbit, regards himself simply as a pioneer whose duty it was to prepare the way for others by establishing a home and a base of operation and supply in some advantageous position, and at the same time to do such evangelistic work as the immediate vicinity of the mission required or offered opportunity for. Whereas it seems to have been the opinion and expectation of the Church at large, whatever may have been the understanding with the members of the then existing Committee, that his work was to be chiefly of an evangelistic character, and that the erection of buildings, &c., though necessary to the comfort of the missionary and permanence of the work, was only to occupy a comparatively short period of time.\nmode of operation shall portion of his time and attention. Take the mission estab-\nlishing the spiritual movement as it stands, including both the material results and the\nspiritual interests which have gone out from it, and judge it by the standard aimed at by Mr. Nesbit, and he has achieved a splendid\n\nHon. Hudson Bay success. There is a large and convenient mission house, sufficient\naccommodate two missionaries and their families, or one missionary family and a large number of Indian children; a house for the in-\nterpreter; another with suitable accommodation for the farmer, with\nthe necessary appurtenances in the way of outbuildings, barns and\nsheds for the preservation of the produce and the protection of the\nstock. The farm is beautifully located on a rich bottom; has a\nwater front of twenty-six chains on the north branch of the Sas-\nkatchewan, with abundance of wood in front on the opposite side\nof the river. No more desirable location for a farm or base of\nsupply could have been chosen. On this property there is also a\nsmall little building, which, in the meantime, does duty both as a\nschool house and church, but which was originally intended for the\nbetter purpose alone.\n\nAs one looks at the place, and sees how much of the comfort\neverywhere visible is due to the exertions of the Rev. J. Nesbit\nhimself, the truth of Mr. Traill's remark, \"that he has been a hard\nworking, in fact an overwrought man,\" is easily realised. He seems\nto have been the head and the foot of the establishment. Simulta-\nneously with this manual labor, the work of evangelisation has been\ncarried on as opportunity offered. Service has been held every\nLord's day at the mission, except when Mr. Nesbit was preaching\nat Carleton House, where he had a regular monthly appointment\nuntil circumstances arose which, for a time, rendered its discon-\ntinuance necessary. One prayer meeting, and some times two, each\nweek, has also been kept up. The Indians camping in the neigh-\nborhood, have been visited, and the spiritual wants of a rapidly in-\ncreasing nominally Christian settlement has been cared for. There\nhave been ten adult Indians and thirty-nine Indian children baptised.\nThere are at this moment twelve Indian communicants, besides\ntwenty-one others, whites and half-breeds, making in all a congrega-\ntion of thirty-three members. The educational necessities of the\nIndians and colonists have received attention, and have been in some\nmeasure supplied. The missionary was at first met with suspicion\nand hostility. Mr. Nesbit's course has been so prudent and concil-\niatory that this ill will has almost entirely disappeared. The\nIndians regard him as their friend, and will, I believe, cordially wel-\ncome any one whom he may introduce.\nIn speaking thus of Mr. Nesbit's exertions, I do not wish to be understood as casting any reflection on the other members employed at the mission. Mr. McKay, the interpreter, is in every way abundantly qualified for his position and work, and he has proven himself a most efficient and active co-laborer, and seems to take lively interest in the welfare of the mission.\n\nMr. McBeath is also an able and efficient manager, and as such I presume, he has done his duty. We have been in the habit of regarding him as the farmer—of course some expected him to do more. According to his own view, he is not the farmer, but the superintendent.*\n\nAs a superintendent, I have no doubt he is fully competent to manage successfully a much larger establishment than ours. I am, however, decidedly of the opinion that our farming operations are and must be on a scale far too small to afford scope for the profitable employment of his abilities.\n\nWhile I have thus endeavoured fairly to estimate and to set forth the importance of the work actually accomplished, I am in duty bound to say that my satisfaction is tinged with regret, that more has not been done in the way of preaching the Gospel. The chief hindrances by which evangelistic operations have been impeded are, in the first place, the lack of missionaries, and in the second place, the large amount of manual labor personally undertaken by our missionary. A great deal more might have been done for nearly the same outlay, had there been two missionaries instead of one. There are several important points within easy reach at which stations ought to have been established. One missionary, however, could scarcely be expected to overtake so large a circuit, as all the stations would require attention about the same time. To have given our missionary a fair chance to husband his resources, and make the most of his time, he should have had a helper from the first. As it is, he has been compelled to work at a very serious disadvantage.\n\nThe manual labor undertaken, and actually performed by our missionary has been, as I take it, the weak spot in our enterprise. I know that the building and farming were necessary, and had Mr. Nesbit not done with his own hands very much of what has been done, the expenses of the mission would have been seriously increased. I believe that in following the course adopted by him, our missionary did what he in all good conscience before God believed to be for\n\n*See Appendix G\nBut, at the same time, I also believed it would have been best if our members employed had the manual labor been left to mechanics, and had Mr. Nesbit, in every way, given the whole, or at least the greater part of his time to spiritual work, and he has proved it. No doubt it would have cost the church a good deal more money, but expenditure in such case would have been the truest economy, and would, I am convinced, have given far more satisfaction to the church. But the mistake of the past, if the course of action in the habit of renewed may be so regarded, is one that cannot be repeated in the future. The mission buildings are finished; the farm is in good order, and our missionaries are now free to devote themselves exclusively to the special work to which they have been called. Both the hindrances of the past have been providentially removed, and the outlook for the future is encouraging.\n\nIn order to put things on a more satisfactory footing and to increase the efficiency of our mission, I beg leave to suggest the following recommendations, viz:\n\n1. That the services heretofore kept up at the mission house be maintained.\n\n2. That new stations be opened at Sturgeon Lake, Big White Lake and Swampy Lake. To give greater stability to the arrangement, and to increase the comfort of the missionary, a small house or shanty should be built at each of these points. An early Indian should be allowed to live in the shanty for its better observation; he should also be encouraged to cultivate a small patch of ground near the house. At the same time, let him distinctly understand that the house belongs to us. Having one thus permanently located others would gather round him, and a settlement would be formed in course of time.\n\n3. As to the distribution of labor, that might, perhaps, be left to Mr. Nesbit and Mr. Vincent to arrange between themselves. If, however, it were thought better that the Committee should allot their fields to each of these gentlemen, the mission and settlement might be given to Mr. Nesbit, and the outlying stations to Mr. Vincent, he being the younger man.\n\n4. The psalms and hymns used in public worship should be translated into the native tongue, and the Indians should be taught to sing. At present the Indians can take no part in the service of praise, and are constrained to be silent in the sanctuary. No psalms have been translated by our missionary, and none of the hymns prepared by other Christian churches are used.\n5. The shorter catechism should be translated and printed in the syllabic character; also a few suitable tracts, of a catholic character, should be prepared for circulation on the plains.\n\n6. A school for the education of the Indian children and youth should be established, and in this school the pupils should be taught to read and write their own language, as is done at the Rev. Mr. Steinhaur's mission. Our Indians are not taught to read the scriptures in their own tongue. On Sabbath the Word is first read in English by Mr. Nesbit, and then translated by the interpreter. It might be well to have the scriptures read out from the syllabic text, and to omit the English in the service held for the Indians.\n\n7. One of the Missionaries, accompanied by his interpreter, should go to the plains every summer and stay there through the hunting season. The people are at that time away from the lakeshore, so that the trip to the plains would not interfere with the work in the vicinity of the stations.\n\n8. Another Interpreter must be engaged immediately on the return of Rev. J. Nesbit. The services of a second Interpreter will be required until Mr. Vincent masters the Cree language.\n\n9. The region of country, of which the \"Dead Woods\" is the centre, should be occupied at once if a Missionary can be secured.\n\n10. There is also an excellent opening for a Missionary in the neighborhood of Fort Polley, and I would recommend that the services of Mr. George Flett be secured as Catechist for this region. He would be an efficient Catechist, and many circumstances point him out as being a desirable man for this particular field.\n\n11. The Missionary should be expected to remain at his post at least five years from the time he enters upon his duties before asking leave of absence, and furloughs should not be granted by the Committee oftener than once in five years unless required by very peculiar circumstances.\n\n12. No leave of absence should be granted to the Interpreter except when his Principal is off on furlough unless absolutely necessary. The propriety of this regulation is easily seen. Until the Missionary has learned the Cree language he can do nothing without his Interpreter. To give the Interpreter leave of absence is simply to disable the Missionary and to compel him to suspend his work.\n\nII THE FARM.\n\nThe keeping of a farming establishment in connection with the...\ntranslated and printed mission can be justified only on two grounds: 1. That it is necessary\ntracts, of a catholic character, the support of the Missionary and his assistants; 2. That it may\nbe plains.\n\ntraining school or model farm for the christianized Indians.\n\nWhen the Mission was established the farm was desirable for\npupils should be taught of these purposes, and as respects the first it was a necessity,\ndone at the Rev. Mr. being no farms in the neighborhood, or within reach, from\nought to read the scriptural supplies could be procured.\n\nSince that time, however, the circumstances of the locality have\nby the interpreter. There are now in the immediate neighborhood of\nout from the syllables Prince Albert Mission a number of excellent farms. An \"In-\nheld for the Industrial Farm\" or training school is no longer required. All the\ninterpreted by his interpreter advantages of such an institution are now within the reach of the\nstay there through winters, and instead of instruction in farming being a burden to the\naway from the lake church, the settlers will gladly pay the customary wages to such of\ninterfere with the workmen as have any desire to work. The circumstances which obviate\nnecessity for the existence of the farm as a training school also\nits importance as a source of supply to the Mission.\n\nThe chief reasons for its continuance for a few years longer are,\nthe convenience of the Missionaries; (2) the support of the\n\"Dead Woods\" is the Indian children, to which purpose the profits accruing from the\ncan be secured.\n\nThe farm might be managed in any of the following ways, viz:\n1. It might be thrown entirely into the hands of the Mission-\nwith leave to work at their own expense and risk, charging\nsuch a rate per year as would suffice to keep the stock,\nlements, out buildings, &c., in their present state of repair and\nefficiency; or\n2. It might be let on shares, under some such arrangement\ncustomary in such cases; or\n3. It might be run as an independent establishment, the cost of\nbeing a first charge on the produce.\n\nShould either No. 2 or 3 be adopted, the share of the produce\nto us, or the portion sold to pay running expenses, and\nthat remained thereafter should be a store from which the mis-\nsionaries and the employees of the mission might have the first\nright of purchase. My impression is that in this way the farm, if\nmanaged might yield a sufficient revenue to cover the\nexpense of the maintenance of the Indian children kept at the\nmission and thus form an auxiliary to the church, as well as a con-\n\nin connection with the service to the mission.\n4. A shanty should be built immediately on the North side opposite the mission, in order to secure a claim for wood-land when the country is surveyed. If any one were to put up a shanty there, before us, we would be compelled in all likelihood to go further back, for wood. The loss of the water front would be a serious inconvenience.\n\nIII. Salaries.\n\nIII. The readjustment of the relations presently existing between the farm and the mission, and the employment of another missionary—necessarily lead to a reconsideration of the salaries here before and at present paid to the gentlemen in the service of the mission. Under the present contract the interpreter is entitled to a sum of $375 and free house, together with an allowance of $75 in cash to cover cost of groceries, and so much farm produce or \"plain provision\" or meat as may be necessary for the use of himself and family. The farmer or Superintendent receives $375 and board for himself and family. The Rev. J. Nesbit receives $860 per annum, and free house. Sixty dollars of this amount is applied toward the payment of a matron or servant to care for the Indian children in the mission; the balance is his own salary. In addition to seven, amount he has received also for the greater part of the time a free supply of groceries, farm produce and meat for his family, with the exception of the sum of $25, which he has had to pay the churchwarden on account of groceries; and the use of his cows, the whole produce of which has been used for the mission, as he says, free charge.\n\nIt thus appears that all in the mission have lived together as a family, that the meat, farm produce, &c., has formed a common stock from which each and all have drawn, according to their several desires, and also that beside their salaries they have received almost their entire living from the church.\n\nThe present arrangement can continue no longer. It has perhaps wrought well enough heretofore owing to the fact that all parties to it are relatives. I need not say how difficult it will be to preserve the harmony of the mission under such an arrangement now that another missionary has been appointed, even granting the existence of the largest charity and good will. It is far better that each family should have its own stated allowance.\n\nI propose therefore (1) that those entitled under contract to allowances above mentioned should receive an equitable cash equivalent for the meat and produce heretofore furnished, and that in\nEngagement hereafter made the Committee promise to pay a specified amount, said amount being of course sufficient to afford a decent and comfortable living.\n\nThat the missionaries be paid a cash salary and have a free claim for wood-land in the service of the mission work may require, it being understood that the missionary is to keep himself and his family, find his own conveyance, &c., &c., at his own expense, and to have no recourse to the Committee except for the erection of such buildings as the extension of the mission work may require, and estimates to the Committee and receiving their approbation.\n\nBy the adoption of some such arrangement as I now propose, the salaries hereinafter mentioned will be placed on precisely the same footing as ministers at home. The harmony of the mission will be promoted and the annual expenses will be reduced to a much smaller sum, and the accounts of the mission greatly simplified.\n\nIn the way of report it only remains to add the list of salaries which follows:\n\n| Name                  | Salary |\n|-----------------------|--------|\n| J. Nesbit             | £860   |\n| George Flett          | £241   |\n| Adam McBeath         | £60    |\n| John McKay            | £40    |\n| Alex Polson           | £40    |\n| Adam McKookis         | £15    |\n| James Nesbit          | £160   |\n\nIt has been found necessary for the use of his cows, the whole payment of salaries paid to the missionary and those of his assistants who were engaged by the year.\n\nSalaries, 1866-67.\n\n| Name                  | Sterling |\n|-----------------------|----------|\n| J. Nesbit             | £860     |\n| George Flett          | £241     |\n| Adam McBeath         | £60      |\n| John McKay            | £40      |\n| Alex Polson           | £40      |\n| Adam McKookis         | £15      |\n| James Nesbit          | £160     |\n\nIt has been found necessary for the use of his cows, the whole payment of salaries paid to the missionary and those of his assistants who were engaged by the year.\n\nSalaries, 1867-68.\n\n| Name                  | Sterling |\n|-----------------------|----------|\n| J. Nesbit             | £860     |\n| George Flett          | £241     |\n| Adam McBeath         | £60      |\n| John McKay            | £40      |\n| Alex Polson           | £40      |\n| Adam McKookis         | £15      |\n| James Nesbit          | £160     |\n\nN. B.—Adam McBeath’s salary was more than covered by school fees. Tuition and board this year amounted to $500.\n### 1868-69\n\n| Name                  | Salary |\n|-----------------------|--------|\n| John McKay            | 60     |\n| Adam McBeath          | 60     |\n| Wm. McDonald          | 40     |\n| John McDonald         | 40     |\n| Jas. Nesbit           | 100    |\n\n£360\n\nN. B.—Adam McBeath's salary was more than covered by school fees. The amount received for tuition and board this year was $500.\n\n### 1869-70\n\n| Name                  | Salary |\n|-----------------------|--------|\n| John McKay            | 75     |\n| Groceries              | 10     |\n| Adam McBeath          | 75     |\n| John McDonald         | 35     |\n| Rod'k McBeath         | 20     |\n| James Nesbitt         | 160    |\n\n£375\n\n### 1870-71\n\n| Name                  | Salary |\n|-----------------------|--------|\n| John McKay            | 75     |\n| Groceries              | 10     |\n| Adam McBeath          | 75     |\n| Philip Bear            | 36     |\n| Roderick McBeath      | 53     |\n| James Nesbit          | 160    |\n\n£409\n\n### 1871-72\n\n| Name                  | Salary |\n|-----------------------|--------|\n| John McKay            | 75     |\n| Groceries              | 15     |\n| Roderick McBeath      | 42     |\n| Adam McBeath          | 75     |\n| James Nesbit          | 160    |\n\n£367\n\n### 1872-73\n\n| Name                  | Salary |\n|-----------------------|--------|\n| John McKay            | 75     |\n| Groceries              | 15     |\n| Adam McBeath          | 75     |\n| Wm. Bruce             | 40     |\n| James Nesbit          | 160    |\n\n£365\nSECTION IV.\n\nValue of Property.\n\nThe following valuation of the assets of the mission is that given by Mr. Nesbit and his assistants, and was, I believe, furnished to the Committee in the Missionary Report for the year ending December 31st, 1871:\n\nBuildings and improvements ........................................ £700 00\nFarming implements, &c ............................................. 120 00\nHorses and cattle ....................................................... 225 00\nCarts, sleds and harness .............................................. 50 00\nHouse plonishing or furniture ......................................... 80 00\n\n£1,245 00\n\nThis does not include the church edifice, for which see appendix.\n\nThe above amount probably is a close estimate of the prime cost of buildings, &c., included in the list of assets.\n\nIn order to ascertain the present worth of the property, the above amount will have to be made for wear, &c. For example, in figuring out the above amount we have to count in the prime cost of the wooden ploughs, at £5 14s. sterling each, with freight added at the rate of £1 per cwt., each plough averaging about 150lbs.\n\nTwo of these ploughs are now worn out and useless, and the other remaining one is thrown aside and its place supplied by an iron plough the better. The other implements, the reaper, threshing machine, and flour mill and fanning mill are in a good state of preservation, though all of them are subject to the ordinary deterioration from use.\n\nProbably the cash value of the whole establishment, including buildings, (except the church,) improvements, stock, &c., would not exceed the sum of £1,000 sterling.\n\nThe land is not as yet of any value, but must in a short time become very valuable property. If held for a few years it may be sold for such a figure as will re-imburse the church for all the present day.\n\nIn conclusion permit me to say, that as your representative I everywhere received with cordiality, and experienced great kindness at the hands of our ministers and the church generally in the Province of Manitoba. I have to thank the Rev. J. Nesbit and\nhis assistants for the kindly spirit in which I was met, and for the readiness with which they furnished the required information. The thanks of the Committee are also specially due to the Hon. D. Smith, the Governor of the Hon. Hudson's Bay Co., and to William Christie, Esq., Superintendent of the Saskatchewan and North West, and in fact to all the gentlemen at the various posts with whom I had the pleasure of meeting, for the assistance so liberally given during the journey.\n\nAll the facts ascertained by me are now before you with suggestions as seem to me to be necessary for the prosecution of the work in the future. It may be that some points of interest and importance have escaped my notice, or that some things are not plainly stated as they might be. Should any further information be required I shall be happy to answer any questions relating thereto in so far as I may be able to do so.\n\nWm. MOORE.\n\nIn the case of some persons who have been established in horsemanship, him, in any manner, in case he has been discovered to be merely concerned in the spread thereof.\n\n---\n\nReprinted from the National Observer, March 18th, 1879.\n\nPrincipal Editor, Mr. Lindsay.\n\nAt the Office, Saturday Evening.\nAPPENDIX A.\n\nWINNIPEG, July 29.—Called on Rev. E. Wood, D. D., Chairman Wesleyan Methodist Board of Missions, and had a conversation with him respecting the plan on which the Wesleyan Methodist missions to the Indians are conducted.\n\nThe salary ranges from $800 to $1,000 per annum. Eight hundred being paid to single men; a thousand to married men.\n\nThe Wesleyans keep no industrial farms, believing them to be a mistake. They have only one now, that at Munceytown, which costs Church $1,000 per annum, in addition to the Government grant of $800.\n\nIn the North West each missionary is provided with a house. In some instances the entire cost of the house has been paid by the Church; in other cases, however, a portion of the amount required has been made up by the neighborhood in which the mission is established. The missionary keeps the house in repair; finds his horse, or other conveyance, and pays for all manual labor done him, out of his salary. He receives no gratuity of any kind. Any money should accrue from the neighborhood, as is sometimes the case when there are a few white settlers ministered to, it goes to the credit of the Church. If the missionary does any farming, it is purely at his own risk and expense, and so far as his own labor is concerned, it must be to a limited extent, as his whole time is expected to be given to his duties as missionary.\n\nAPPENDIX B.\n\nRev. Henry Steinhaur has under his charge three Mission Stations, viz.: (a) White Fish Lake. (b) Lac la Beach, and (c) Good Fish Lake. Has his headquarters at White Fish Lake, which is the principal resort of about 200 Indians. Service is held in Cree every Sunday.\n\nAt Lac la Beach, there are but few Indians. Service once a fortnight. Distant from White Fish Lake, 46 miles.\nAt Good Fish Lake, many Indians reside. It is eight miles from White Fish Lake, and service is held every Sunday.\n\nIn summer, sponds eight or nine weeks on the plains. All the Indians are there, except a few who are left at home to take care of the property of the settlement.\n\nTakes the whole establishment, church and school.\n\nThe school is open every day as usual.\n\nReligious services every day, morning and evening, attended by all the mission Indians, and often by others. On Sundays, services three times. The entire service, reading scripture, prayer, singing, &c., is in the native tongue.\n\nA missionary who does not move round among the Indians, is not likely to do much good. He must follow them from camp to camp at first, at any rate.\n\nAt all the Mission Stations, the Indians are gradually becoming permanent settlers. It is a slow and, to the missionary, a toilsome process. The Indian must be looked after like a child; to get him to build a house, or cultivate land, or make a garden, it is not enough to give directions; we must take hold and show him how to do it.\n\nMr. Steinhaur cultivates land, but not many acres. He makes a \"bee\" at each Indian's place successively, and, of course, his own among the rest. The Indians have a \"big work\" and then a \"big feast,\" which latter they like amazingly well. All the cost of cultivation, both in labor and implements must be borne by the missionary. The church pays no part of the expense.\n\nDoes not trade himself, nor does he allow any one on or about the Mission premises to do so.\n\nIt would compromise the position of the missionary in the eyes of the Company, with whom it is exceedingly desirable to be on good terms; partly because of their influence for good or evil over the Indians; and partly because of the great assistance they can render in many ways to the missionary.\n\nIt would compromise his Christian character in the judgment of the Indians, who would regard him as a trader in the guise of a teacher, and thus hinder his work.\n\nAnd lastly the church pays for spiritual work, and justly expects us to give our whole time to it.\n\nHave been 32 years engaged in mission work, 15 years as teacher, 17 as preacher; was ordained in 1855. This is my first time out since my ordination.\nEighty-two or one hundred and twenty-six (I forget which) church members, most of whom are direct converts from heathenism, being the children of Christian parents.\n\nOur present school teacher, Mr. Snyder, teaches the English in usual branches taught in English. This is done for the purpose of enabling our people to hold intercourse with the whites. They are all taught to read and write the Cree language in the Arabic character. Many write and read Cree with as much facility as one of us would the English.\n\nMany of the heathen Indians can read and write. They are very proud of their accomplishment and like to use it.\n\nThe society gives toward teachers' salary the sum of $250. Each year the Indians paid enough to make up with this the sum of that is, $100. Mr. Snyder now, after three years of close application, speaks the Cree fluently and correctly. He was 19 when he was sent out. Think this the best, in fact the only successful way of training men for this work.\n\nAt a conference in Manitoba, it was resolved to send out only married men, for reasons which readily suggest themselves.\n\nWe have a children's meeting for prayer once a week, and the parents bring them to class meeting.\n\nAPPENDIX C.\n\nCHRISTIAN BRETHREN—It is part, and an exceedingly pleasant duty of my duty to bear to you the greetings of the church, to assure you of the continued interest felt in your work, and of our sympathy with you in the hardships you are necessarily called to endure in its prosecution. The peculiar difficulties connected with such a mission as this can only be inadequately realised by those at home. Because of this our sympathy may seem to those engaged to fall far short of what they have a right to expect. Any seeming coldness, if such there be, is not due to any real lack of interest, but to our unavoidable ignorance of the conditions under which the work of the mission must be carried on. So far as we know what the work actually requires, we shall, I trust, ever be found ready to give, with both heart and hand, an ungrudging and liberal support to all the missionaries.\nOne of the chief drawbacks to your success heretofore has been the lack of laborers. I trust this want will be in some measure supplied by the presence of the Rev. E. Vincent, by whom I am accompanied, and who, after his own self-consecration, has been ordained to the work of the Lord in this region. I trust, also, that since the work of breaking down prejudice and disarming opposition to the mission, has been accomplished, your hearts, and the heart of the Church, may be rejoiced by an increasing measure of positive success in the conversion of souls, and that in due course, in the good providence of God, a native ministry may be raised up to perpetuate and extend your labors. Our constant prayer is that the Word may have free course to the glory of God; that a wide effectual door may be opened to this mission, and that you, whose lives have been consecrated to this service, may be abundantly honored with enduring success.\n\nYou are not unaware of the fact that various painful rumors touching the character of this mission, have been in circulation for some time past. It is part of my duty to investigate the condition of things here, in order to ascertain as far as possible the facts of the case. I need not say how painful it is to me to have to act as part of an Inquisitor. But you yourselves know how important it is that, since such a work must be done, it should be done thoroughly, and I hope you will therefore acquit me of any spirit of unkindness in the conscientious discharge of my duty to you and to the Church. It is to your interest, as well as to the interest of the Church at large, that the clearest light should be thrown upon all departments of your work. Only when all the facts are known can your righteousness go forth as the noon day.\n\nI propose, therefore, in detail, to inquire into the working of each department of the mission, to examine separately the heads of each department, and to scrutinise their accounts; and I trust you will, as both interest and honor require, lend me every assistance in your power. I feel confident of your co-operation, and I am sure that as honest men and true Christians you have no fear of the result, but rather rejoice that now an opportunity is afforded you to vindicate the mission from the charges brought against it. I also ask that, pending the course of this investigation, you hold no conference with each other on the matters in hand, so that all appearance of collusion may be avoided.\n\nOnce more I beg you to believe me to be actuated by a sense of duty and a spirit of brotherly love. While endeavoring\nAPPENDIX D.\n\nEXAMINATION OF REV. J. NESBIT.\n\n1. Name and number of employees of the mission, with members of their several families.\n\nRev. J. Nesbit, wife and four children; John McKay, wife and five children; Adam McBeath, wife and child; Wm. Bruce, wife. Occasional servants—Joseph Bear, engaged for three months, beginning July 15. Domestic servants not paid by mission. Mrs. Bruce, in family of Mr. Nesbit; Christina R. Anderson, Mrs. McBeath. In the absence of Mrs. Bruce with Mrs. Nesbit, Sarah Badger does her work at the mission. Sarah Badger, by Mr. Nesbit out of the allowance granted by the Committee.\n\n2. Salary of each, with perquisites.\n\nRev. J. Nesbit, salary $860. Groceries at first, up to 1868, reported by self. Since 1868, have used a portion of the groceries bought by the Committee for the use of the mission, for which payment has been made in cash and use of personal property. Cash yearly $25.\n\nAnd me every assistance in cooperation, and I am sure into the working separately the heads of accounts; and I trust you will find me every assistance in cooperation, and I am sure you will have no fear of the humanity is afforded you, and brought against it. In this investigation, you matters in hand, so\n\nWhile endeavoring to discharge my duty to the Church, I shall strive to do it in a manner, as shall not unnecessarily wound the feelings of any parties concerned. May God give us grace and wisdom to be in the present emergency. After the examination is over, I shall ask you to a conference, for the purpose of receiving such questions as, in view of your practical knowledge of the requirements of the position, you may deem requisite to the more energetic prosecution of the work.\nAdam McBeath cash, £75—$375, and board and house rent, £12 per month, for self and family. This includes the entire living of self and family, except clothing, washing and domestic service.\n\nWm. Bruce, £40 cash—$200—Board and lodging, but no wages paid for working or any other attendance. Mr. Bruce's wife being in the service of Mrs. Nesbit, her board is included in the household expenses.\n\nOccasional servants—Joseph Bear, £4 per month and board at The Smiths for having. See farm account.\n\n3. How employed—Farm, school and mission?\n\nMr. Nesbit, missionary and general manager.\n\nMr. McKay, interpreter, and to go the plains for the purchasing of dry and fresh meat when required. Mr. McKay's original contract dated May 1, 1866, runs as follows: \"To accompany Mr. Nesbit on his mission; to take the general direction of the party during the journey; and, when the mission is located, to erect buildings, attend to farm work, procure fish and other provisions at the proper season and take the oversight of the station in the absence of Mr. Nesbit and his interpreter, and to have no objection to act as interpreter when required, and further the interests of the mission so far as in him lies.\"\n\nOriginal salary £60, sterling, and board. The contract to take effect for two years. The new contract with increase of salary, is dated May 1, 1869.\n\nMr. Adam McBeath, engaged \"to serve in the work of teaching, even in the Sabbath and day schools; to take the general oversight and direction of the farming, care of cattle &c., building and bargaining at the mission.\" Since this contract was entered into he has been ordered by order of the Committee, released from the teaching department (which reduced the number of farm hands to one besides himself instead of two as before.) Original contract, dated April 22, 1867, covered teaching, and Sabbath and day school, and other lawful work which he may be able to do. That he will be careful of all stock or other property that may be committed to his care, that he will take an interest in the welfare of the mission, and see that nothing will go to waste or injury, so far as he can prevent. The contract to run for two years at £80 per annum and board. The second and present contract as above entered.\n\nNot married when engaged, and the contract does not include board of wife and family, though this has been heretofore allowed.\nWm. Bruce—General farm servant—entered service August 16,\n\nentire living of self\n\ndomestic service.\n\nHow many preaching places, and how often is service held\n\nand lodging, but no written place?\n\nwife being in the service two, viz: Station and occasional preaching at Carleton House,\n\nhousehold expenses\n\nservices at Station every Sabbath, and prayer meeting and lecture\n\non Wednesday evening. In winter a service in one of the\n\nat West end of the settlement on Monday or Tuesday. Carleton\n\nHouse—during first four years regular appointment, once a\n\nwhen possible. Since that, only occasional service. (Reason\n\ngiven for this cessation if required.)\n\nmanager.\n\nfree at each service up to last winter, '71-'72. Since then\n\nMcKay's original service being interpreted. At communion seasons, all the ser-\n\n\"To accompany\n\ndirection of the party\n\nDistance of each place from mission and from each other?\n\nprovisions at the present\n\nin the absence of\n\nobjection to act as\n\nNumber of journeys to Indian camps each year. Number\n\ninterests of the mission families visited—Indians, half-breeds, whites?\n\nDuring last two years, no missionary journeys have been\n\ntaken, except to Carleton House and to Sturgeon Lake, twenty-\n\nmiles North-West—the fishing ground of our own Indians.\n\nstudies visited, including those at Mission, Lake, and Carleton, num-\n\ntwenty-eight—pure Indian, nine owning houses; half-breed six-\n\nbuilding and bargaining by immigration from Red River. All these families seen\n\ninto he has been annually, but a stated pastoral visit is made once each year.\n\nteaching department during first four years no missionary journeys undertaken except to\n\none besides himself, and a visit to Edmonton in the first year of the mission.\n\ndated April 22, 18—\n\nschool, and other laws\n\nwill be careful of\n\nis estimated that for the last three years not fewer than\n\nIndians have visited the Mission in the course of each year. The\n\nnumber at the Mission at any time was about 250. Fre-\n\nthere are as many as 120 encamped at the Mission.\n\nper annum and board. These Indians are gathered from widely separated points and\n\nevery direction; Long Lake, two days journey Eastward by\n\nCandle Lake, two days north; Sturgeon Lake twenty miles\n\nheretofore allowed North-West; Big White-fish Lake, two days North-West; Carleton,\nsixty miles west; Moose Woods on South Branch, four days South West; Battle River, six days West; Jack-fish Lake, seven days West; Fort Pit, ten days West; and a few from Victoria and Edmonton (within bounds of Wesleyan Methodist Mission,) twenty-one days West.\n\n8. Are the Indians locating? To what extent, and where?\n\nThere are three houses at Sturgeon Lake; at Mission, eight Indian houses. Some of these (5) Christian Indians from Red River Settlement, and the remaining three families are pure Plain Cree. Besides these there are four families—\"Wood Indians\"—Cree who though they have not yet built, cultivate patches of land, spend a considerable portion of their time at the Mission, and may be considered as locating; also one Indian family from the Plains has wintered here the last two winters and attended ordinances regularly. They will likely locate here. There seems to be a disposition on the part of the Plain Indians to settle, provided the Government or other parties render adequate assistance, (which means build houses, break up lands, furnish cattle and implements gratis.)\n\n9. How many adult baptisms? Were these converts from heathenism, or had they, previous to your intercourse with them, any knowledge of Christianity?\n\nTen adults, all converts from heathenism. Some knew a little of Christianity from intercourse with Christians, but had not been under instruction at any Mission Station. Many applicants refused on account of ignorance and unchristian conduct.\n\n10. Number of children baptised, Indian, half-breed, white? How many of the whites were children employees of mission?\n\nSeventy children, mostly infants, but in case of Indians, a few youths from 11 years and under, 39 Indians; 28 Half-breeds and 3 Whites. Of these 5 children are members of families belonging to the Mission.\n\n11. Church members—Indians, half-breeds, whites? How many of these connected with the work of the mission?\n\nAugust 25, 1872. Total number communicants, 33; viz., 6 Whites, 15 Half-breeds and 12 Indians. Of these, 5 Whites, Half-breeds, and 6 Indians received by letter; 1 White, 4 Half-breeds and 6 Indians received on examination. The 6 Indians are converts from heathenism. Of the White communicants, 5 are connected with the Mission, and 1 of the Half-breeds.\nBranch, four days South of Black-fish Lake, seven days from Victoria and five days from Red River. There are at least sixteen Indians known to be favorably disposed toward the Christian religion, and who may be termed \"converts,\" viz:\n\n1. Uskachas and his two wives,\n2. Mistawasis (big child,) (2 wives)\n3. Sikaquanyan (skunk skin or old skunk)\n4. Maskitihthimun (broken shoulder)\n5. Kakinaaparoot,\n6. Ayahtoowau (wayoo) (ventriloquist,)\n7. Musinastes, (spotted,)\n8. Asiqananau, (fine quilled,)\n9. Kamachiquananat, (a bird plucker,)\n10. Machaquachis, (the bat,)\n11. Ooya-pa-cha-pau, (white boar,)\n12. Kipoodiul and wife, (closed up,)\n13. Thomas Bird's Brother, (Brother of old Krane)\n\nBesides these, many have been spoken to by Mr. McKay, when visiting the Plains, and who seem to be enquiring after the truth.\n\nHow are the services conducted—in Cree or English? Singing in English, the substance of the psalm sung is repeated to the Indians in their own tongue previous to singing. Owing to this, the Indians do not take part in the singing. The sermon and prayers are interpreted sentence by sentence.\n\nNumber on School roll, and average attendance?\n\nEnglish school opened August 1867, before that the children about the mission were taught by Mr. Nesbit. Rolls for 1868, '69 and 70 are missing. As near as can be ascertained, statistics are as follows, viz:\n\n| Year | Total on Roll | Average attendance |\n|------|---------------|--------------------|\n| 1867 | 14            | 14                 |\n| 1868 | 18            | 18                 |\n| 1869 | 27            | 20                 |\n| 1870 | 30            | 23                 |\n| 1871 | 41            | 25                 |\n| 1872 | 41            | 25                 |\n\nPupils—how many Indians, half-breeds, whites, and of these how many belong to the mission?\n\nCommunicants, 33; viz., of these, 5 Whites, 1 Half-breed; 1 White, 4 Half-breeds. The 6 Indians and 5 communicants, 5 are converts, 1 half-breed.\nOf the 41 children above stated for the last two years, 18 were Indians, 22 were half-breeds, and one was white. The only white child at school was connected with the mission.\n\n16. Studies in English and Indian?\n\nThe usual class books in use in Canada. During the time the school was under the care of Mr. McBeath, classes were taught in reading, arithmetic, geography, history, English grammar, spelling, English composition and book-keeping. Since that time reading, writing and arithmetic. The other branches only partially.\n\n17. To what extent is the syllabic character taught? To children? To adults?\n\nAt first it was taught to all the Indian children, but it was found that they were picking up the English more quickly, and Nesbit considered it more beneficial to keep them at the English exclusively in the meantime.\n\nAdult Indians have been urged to learn, but very few have availed themselves of the offer of the mission to this date.\n\nIn the winter of 1869, a night school was taught five nights a week. It was attended by about 18 Indian youths of both sexes. Lessons were given in syllabics and English, and many of them very well. Since more accommodation has been provided, this school might be resumed with good results.\n\n18. Indian children in mission, age when received? How long kept?\n\nThe following is a complete list of the Indian children received by the mission, with the time each child remained at the mission:\n\n1. John Squirrel (Mistaniquachas) aged 11 years. Received Aug. 1866; remained one year. Came back and remained months in the summer of 1868; in all 15 months.\n\n2. Robert Burns (Myatisis) aged 8 years. Received May 1867. Still kept by mission.\n\n3. Anne Turner, aged 5 years. Received May 1867; kept until May 1868, one year.\n\n4. Isabella Turner, aged 5 years. Received May 1867. Kept 18 months; died March 27, 1869, having been away for several months.\n\n5. Charles Bird, aged 14 years. At different times, several months in all.\n6. Nancy Bird, aged 12 years. At different times, about two years in all.\n\n7. Henry Bird, aged 8 years. Received 1869; kept six months.\n\nDuring the terms 8 & 9. A brother and sister from the South Branch Indians, classes were taught aged 11 and 9 years. Received winter of 1869-70, and kept English grammar, seven months.\n\nSince that time 10. Ustiquan, Tom Boots' son, aged 12. Received July 1870, and kept till July 1871, one year.\n\nTo date 11. Nuhtisquasis, aged 14 years. At different times, about two years in all.\n\nchildren, but it was 12. Kismanisis, aged 8 years. Received summer 1869; more quickly, and kept six months.\n\nthem at the English 13 and 14. James Simpson, aged five years, and his half-sister, Angelique Hullet, aged 9 years. Son and daughter of Vachenes. Received Sept. 27, 1869; forcibly taken away by their mother, May 8th, 1870, having remained nine months.\n\nhas taught five nights 15. Magdalene Albertson, aged 8 years. Received May 8, 1870. Still at the mission.\n\nand many of them 16. Baptiste Albertson, aged 8 years, Received May 5, 1871. Still at the mission.\n\nreceived? How long still at the mission.\n\nthe Indian children 17. Donald McVicar, aged 7 years. Received May 5, 1871.\n\nchild remained at 18. Elizabeth Esson (half-sister to D. McV.) Received May 5th, 1871. Still at the mission.\n\naged 11 years. Received June 19. Henrietta Black, aged 6 years. Received June, 1871: still at the mission.\n\nback and remained 20. John Black, aged 3 years. Received June, 1871.\n\nElizabeth Olson (half-breed), aged six years. Received May 1867. Returned to her parents August 28, 1872, having been five years and three months.\n\nTotal children 21; aggregate time 32 years and 8 months.\n\nReceived May 1867; kept still in mission, 7.\n\nBoxes of donations? What done with? Any portion having been away for partly used in paying wages of regular and occasional employees.\n\nAt different times, partly clothing the Indian children kept by the mission.\n\npartly given as gratuities to aged, infirm, and necessitous persons and their families.\nAnd lastly a large proportion used in the purchase of \"provisions\" and leather from Indians and half-breeds for the hunt, the mission.\n\n20. Estimated cash value of stuff annually given to Indians—how many since foundation of the mission?—how many Starvation years—how many since foundation of the mission?\n\nThere have been since the foundation of this mission at least three years in which both Indians and settlers have been in want. These years commonly called \"starvation years.\"\n\nIn 1868, at least 300 bushels of turnips, also some potatoes, barley and wheat were given away. In spring of 1868 I believe that at least 2,000 lbs. dried meat was given to the Indians. No records have been obliged to give to such an extent since in way of \"provisions.\"\n\nIn 1870 all the turnips raised were given away, about 500 bushels; also, some potatoes, barley and portions of wheat, and more than four or five cwt. of pemican and dried meat until spring when they received provisions for \"pitching off,\" amounting to about 100lbs. of pemican besides turnips, barley and wheat, a portion to each of about fourteen tents or families.\n\nThese donations for the \"pitching off\" have to be replaced each year and do not differ greatly in amount.\n\nSeveral carts are also loaned to the Indians to enable them bring home and store the provisions obtained on the plains.\n\n21. Provisions, how procured, and what value each year?\n\n\"Plain Provisions.\" When we have goods and are able to the plains our provision never cost more than from £1½ to £2 per lb. Usually a trip to the plains costs about £30 to £35. expenditure covers dried meat, grease and pemican, together expense of the trip. Mr. McKay and two boys with four carts and five or six oxen or horses are usually sent. The boys are paid for the trip at from 2s. 6d. to 3s. per day, with board. In October, when possible, we make a second trip to the plains \"green provisions,\" that is, fresh meat for winter use. This costs about £25, there are employed on it the same as above and generally six carts. Mr. McKay runs the buffalo, sometimes assistance is hired at so much per head, killed.\n\nThe fresh meat generally costs, including all charges, one per lb., and the quantity brought in is about 6,000lbs.\n\nFor the last two years, having no goods, we could not go to plains, and have been obliged to purchase from the French\nThe purchase of \"half-breeds for the hunters at the rate of 7d. per lb. for pemican and 5d. per lb. for dried meat, so that our dried provisions last year cost over £130, of which was paid in goods and farm produce excepting cash order.\n\nAll goods sent into this mission are paid for by the Committee or settlers have been in cash donations, and the freight on all goods, both donations and since in way of \"advances of missions at an advance of two or three per cent on all charges added.\n\nHas any trading or trapping been done at the mission? Value of furs traded or trapped? by whom? to whom? How proceeds applied?\n\nThe hired men have not know of any trading or trapping. The hired men have allowed to set traps after working hours, but so that they did interfere with their work. Only three have used this privilege knowledge.\n\nWith regard to trading all employees are strictly forbidden by indentures, and I have no reason to believe that they have their contract in any case.\n\nDo you know anything of a \"pack\" having been made up on mission premises and sold to Mr. Clark for the sum of £14 sterling. I am aware that one of the young men trapped skins and them to Mr. Clark. This occurred the first winter we were there and the skins were not bought or traded for, but was the result stopping after hours. Three beaver skins and one otter skin is all I know of. Beyond this I am positive that nothing has been done in the way of trading. These four skins were bought for personal use and were not re-sold either here or elsewhere.\n\nThere are reports to the effect that furs have been bought by those in the employment of the mission, which have been quietly purchased by their friends trading in this neighborhood. Do you know anything of this? I have not the slightest reason to suspect anything of the kind, and am satisfied that nothing of the kind could be done without my knowledge. All of us when opportunity offered to send to the Settlement, and when there happened a surplus stock here, have bought from the mission a buffalo\nrobe or moose skin which we have given as a present to our friend Beyond this nothing.\n\n24. At what points are Indians encamped for any length of time each year?\n\nThe mission is a rallying point for Indians at New Year, spring, after sugar making and the harvest weeks.\n\nThe Indians visit Carleton House for the sale of the produce of the hunt. Their stay is short and they may come and go without our knowledge.\n\nAt Sturgeon Lake there are three or four families of friendly but heathen Indians camping while the fishing lasts, say two months each winter, December and January. These families also cultivate small patches of ground at the lake.\n\nWhite-fish Lake is also a resort of Indians during the fishing season, December and January.\n\nJack-fish lake, a large fish lake, wooded on north and south, and in the midst of the buffalo plains.\n\nBattle River, a winter post of the Hudson Bay Company.\n\nFort Pitt would also be a good centre for a mission.\n\nDISTANCES.—\nSturgeon Lake 20 miles from mission; Big White-fish about two day's journey, with horses from mission; Sturgeon lies between Big White-fish Lake and the mission and is in the of travel. Taking Jack-fish Lake as centre, Battle River and Pitt, Jack-fish Lake is about three days journey from Carleton and Fort Pitt three days beyond Jack-fish.\n\n25. What furloughs have been granted? When did they begin? When end?\n\nMr. McKay was allowed to take his wife and family to Indians River, for medical advice June 25, 1870. Returned to the Mission on October 14th of same year; but on account of his wife's ill and the weak state in which he left her, he was allowed to go to Red River for the winter. He and family arrived at mission July, 1871.\n\nMr. McBeath suffered from chest disease all the winter of '70, and summer of '70, not recovering, rather getting worse. Harvest, leave of absence was granted, and he left accordingly, 14th October, 1870. It was found that he had arrived just in time to save his life. He returned to the mission Sept. 8th, 1871, ha\na present to our friend obliged to remain in the settlement longer than he otherwise would have done, on account of the non-arrival of the goods for the mission, having been absent in all nearly 11 months.\n\n26. Were full salaries allowed to parties on furlough?\n\nThe full salary was continued. They were recommended, in the absence of finding employment while on furlough, to lighten the expenses of the mission to the amount of their earnings.\n\nMr. McKay was employed and has placed to the credit of the mission the sum of £12, $60, being the balance of wages earned after deducting Doctors' bills. Mr. McKay, while on furlough, received an allowance for groceries, and a small part of his ordinary allowance for board. The salary was paid during his absence, on the understanding that McKay should re-engage for five years, and only under this condition was the salary allowed to run. Should he leave the service of the mission before the end of that time, Mr. Nosbit would be bound in honor bound to refund the amount of salary not already paid.\n\nMr. McBeath was employed as returning officer at the election in the winter of 1870-71, but did not earn enough to cover the expense of medical attendance.\n\nIt should also be stated that he offered to teach in Keldonan school, so far as health permitted, and that a considerable portion of his time before leaving Red River was given to mission business in connection with the goods—that is to say, got them passed the customs and hired freighters, and accompanied goods during transportation to Battle River and Carleton. He received no allowance on account of board during his absence—nothing but salary.\n\n27. How was the work of the mission carried on in their absence? Mission work? Farm work?\n\nServices conducted in English. Ordinary intercourse with Indians carried on through Mr. Roderick McBeath, then in the absence of the mission.\n\n28. What stock have you on the place?\n\nCan not say how many young cattle—Mr. McB. can tell. I own two cows and two horses, Brought these simply for the purpose of saving expense to the mission. All they have produced—milk, butter and cheese—has been used for the benefit of the mission, getting worse.\n\nLeft accordingly, on Sept. 8th, 1871, having added to his duties.\nAnd so with the horses—no charge has ever been made for work done by them. Mr. Nesbit's horse has been sent to the plains, and has been the only one used on the mill, except when threshing, when another another was also used.\n\nMr. McBeath has never taken anything for the use of his horses.\n\nMr. McKay has been allowed, when on long trips half pay for his horses. Company's full allowance, 1 skin per day, 2s. 6d. Mr. McKay's allowance is about 1s. per day.\n\n1. Does Mr. McBeath pay anything for servant's board?\n   No, she is counted as one of the family.\n\n2. Are all the horses and cattle fed on the hay stacked in the yard?\n   Yes, all the horned cattle. Of the horses only the one used on the mill.\n\n3. At what hour do the hands go to work?\n   In winter about daylight. In summer during the busy season the hours are long.\n\n4. Who runs the mill?\n   I do myself. Mr. McBeath's chest is so weak that he cannot stand the cold and the dust necessary to the work.\n\n5. What was the character of the stuff brought out by Mr. McBeath on his return to the mission in 1871—I mean his own private property?\n   Flour, several hundreds of which were afterwards sold to the mission. At what price? Red River price, with freight added.\n\n6. Are Cree bibles constantly kept in stock? Yes.\n\nAPPENDIX E.\n\nEXAMINATION OF JOHN MCKAY, INTERPRETER.\n\n1. Salary? Perquisites? Family?\n   £75 or $375, with house and board for myself and family; get an allowance of £10 or $50 on account of groceries; get an additional £5 this year on same account. Wife and five children.\n\n2. Duties? Interpretation of sermons? Conversation?\n   A sermon is interpreted at least once every Sabbath. Almost every day conversation is held with the Indians.\n3. What translations prepared?\n\nThe short Catechism has been translated, and also the first book of lessons, (Reader) in the national series, both written out in the syllabic. These translations were used for some time, but their use has been discontinued for the last two years. In the Sabbath school a class is taught in the Cree language. The children in the house are taught in English. The average attendance in the Cree class is about six, and their ages vary from eight to fourteen years. The class is made up of both boys and girls.\n\n4. What translations revised?\n\nNothing has been done in the way of revision.\n\nWhat is your opinion of the present Cree Bible?\n\nThere are too many languages mixed up in it. It is not pure Cree but a mixture of Cree with Chippewa and Swampy, and a great deal of English. The Cree is one of the largest, if not the largest tribe of Indians in North America. I consider the Cree a difficult language for an adult to learn.\n\n5. Journeys undertaken for evangelistic work?\n\nHave not been in the habit of making journeys for the purpose of visiting Indian encampments.\n\n6. Is there much room for this kind of work and can you mention places where, and times when Indians are to be met with in considerable numbers?\n\nA great deal might be done by visiting the camps. There are fishing grounds and wintering places where the Indians remain for some time and are to be met with in considerable numbers. And also on the plains in summer a great many Indians, gathered from many parts, might be seen and talked with. Have seen as many as 500 tents in one camp. Any summer during the hunting season from 100 to 200 tents can be reached in a day's journey. The hunting season for buffalo begins about the first of June and lasts until the first of November, at which time the Indians return to their winter quarters. As a general thing even the heathen Indians rest on Sunday. They hunt during the week and feast on Sunday, consequently they would be reached easily by a missionary. Often less, but frequently thirty, forty, fifty and even a hundred tents may be found in the places where they take up their winter quarters. They remain in these places most of the winter. The men as necessity requires go out for a few days at a time to hunt on the plains, but their families — the women and children — remain in one place.\nWINTERING PLACES:\n\n(1.) Eagle Hills, six days journey west.\n(2.) Eagle Hill Creek, six days west, one from here and one and a half or two days south of the hills.\n(3.) Devil's Lake, (a great many Indians,) eight days journey south.\n(4.) Bad Hills, west, two days journey from Devil's Lake.\n(5.) Tramping Lake, two days journey north of Bad Hills.\n(6.) Dead Woods, one day's journey east of Bad Hills, two days from Tramping Lake and two days from Devil's Lake.\n\nThe Dead Woods is a central place from which these other places, above named, may be easily reached and is itself a great resort for Indians during winter.\n\nNone of these points are yet occupied by missionaries of any church.\n\nTaking Prince Albert as centre the chief points of rendezvous in winter are, (1.) Sturgeon or Fishing Lake, twenty miles; (2.) Big White-fish Lake, distant from Sturgeon Lake two days journey; (3.) Swampy Lake, distance supposed to be about one day's journey from Big White-fish. Have not been there, but believe it to be a considerable gathering place.\n\n7. Do many of the christian and heathen Indians read, and can suitable tracts be circulated to advantage?\n\nMany do read. They teach each other. Having once learned to read they are fond of reading and tracts would be of great use, and might be circulated in considerable numbers. Nothing of this kind has been done hitherto.\n\n8. How often do you go to the plains for the purchase of provisions?\n\nI go to the plains every fall, in October, for fresh meat. The first four years of the mission I went out to buy dry meat, pemican, and fat for winter stores. This trip was made in July. This trip has not been made the last two years. The reason for its discontinuance was the saving of time and expense effected thereby. When bought on the plains the dried meat, &c., cost on an average about three cents per lb. This covers all the expenses of the trip. When bought here, pemican and fat costs seven pence per lb., and dried meat five pence per lb.\n\n9. What quantity is laid in, each season?\nAbout 700lbs. pemican, 700lbs. dried meat and 200lbs. of fat. These are quantities purchased here.\n\nIn 1867, bought on the plains 1,114lbs. of \"hard fat\" or tallow and 1,718lbs of dried meat for making pemican.\n\nLast fall from the October hunt brought in twenty cows, average weight 400lbs. Taking one year with another this is about the average quantity of fresh meat, cost about three cents per lb.\n\n**PROCEEDS OF TRIP TO PLAINS, JUNE 7TH, 1869.**\n\n| Item                        | Quantity |\n|-----------------------------|----------|\n| Pounded meat                | 392 lbs. |\n| Dried meat                  | 3,082 \"   |\n| Hard Grease                 | 1,668 \"   |\n| Soft Grease                 | 354 \"     |\n|                             |          |\n| 18 parchments               |          |\n| 11 half buffalo skins, dressed |        |\n| 3 \"half-dressed\"            |          |\n| 160 sinews                   |          |\n|                             |          |\n| Value of goods paid for the above | £12 14s. 9d. |\n| Flour and barley             | 3 0 0    |\n| Cost of trip                 | 11 10 0   |\n|                             |          |\n| Leather and sinews           | £5 10s. 0d. |\n| Provisions                   | 51 14 9   |\n|                             |          |\n|                             | £57 4s. 9d. |\n\nMaking the provisions to cost a trifle over 2½d. per lb.\n\n**PROCEEDS OF TRIP TO PLAINS WITH HORSES AND CARRIAGES, JULY 5TH, 1869.**\n\n| Item                        | Quantity |\n|-----------------------------|----------|\n| Dried meat                  | 2,262 lbs. |\n| Pounded meat                | 75 \"      |\n| Hard Grease                 | 327 \"     |\n| Soft grease                 | 63 \"      |\n| 12 parchments, &c., say     | 96 \"      |\n| 107 sinews                   | 21 \"      |\n|                             |          |\n| Whole weight                | 2,844 \"   |\n|                             |          |\n| EXPENSE                     |          |\n| Goods, flour, &c.           | £7 8s. 6d. |\n| Use of horses and carts      | 3 2 6     |\n| Men's wages                 | 9 0 0     |\n| Provisions                  | 2 0 0     |\n|                             |          |\n| Deducting for parchments and sinews | £21 11s. 0d. |\n|                             |          |\n| Leaves a balance of         | £18 16s. 0d. |\n| as the price of 2,728lbs. of provisions, or nearly 1¼d. per lb. |\nProvisions bought on the plains are paid for in goods furnished to the mission by the Committee. When bought here, payment is made partly in goods, partly in produce of the farm.\n\n11. Can you give an idea of the price set on produce so exchanged?\n\nPotatoes. 4s.; barley, 6s.; turnips, 4s.; wheat 10s., sterling per bushel.\n\n12. To whom does the skins of animals killed on the plains belong? Do you regard them as belonging to yourself, or to the mission?\n\nTo the mission; those killed when the fur is good are dressed and counted as goods belonging to the mission.\n\n13. Are servants hired expressly for this trip, or do you take men from the farm? what wages are generally paid them?\n\nThey are hired for the trip. Generally paid one skin per day; a skin averages 2s. 6d. Paid in goods. Generally take two boys. Some time I hire help on the plains to shoot Buffalo. We pay by the day or by the head. Pay by the day, two skins—by the head, two skins. Better to pay by the head, as in this case only the animals killed count, and we have no risk for damage done to man, horse or gun by accident.\n\n14. How often have you been absent on furlough.\n\nOnce since I came into the employment of the mission. I left the mission about the 15th of July, 1870, and returned on July 3rd, 1871. I came out to the mission with a train of goods in October, 1870, but went back to Red River immediately.\n\n15. What amount of freight was brought through in October?\n\nAs near as I can remember about 400 cwt.\n\n16. Were you earning wages when in Red River, and how were the proceeds applied?\n\nI was in the Government employment 10 days on a trip to the Northwest Angle. Vaccinating Indians in Spring, two weeks; was not otherwise employed. I received 10s. per day on the trip. Out of this I paid the doctor's bill, and accounted to Mr. Nesbit for $65, which was the balance in my hands after paying this bill. For the two weeks in the Spring I got $5 per day, but had to pay for provisions for self and horse. I used my own horse, for which I received $1 per day—the horse hire is counted in the $5 above stated.\n\n17. In your absence, how was the work of the mission carried on?\nIn ordinary conversation, Mr. Nesbit's intercourse with the Indians was carried on through persons living in the house; but, so far as I know, there was nothing done in the way of lectures, nor of religious conversation to any extent.\n\n18. What private property have you on the premises, or in the neighborhood? and how acquired?\n\nI have six horses; no oxen; no cows.\n\nI am in the habit of buying and selling horses. The first year after I came here the neck of one of my \"runners\" was broken on the plains. The mission bore half the loss, and paid me £15. In 1868, sold another horse for £25. In 1869, sold two horses, one for £12, the other for £14. In 1870, sold a horse for £10. In 1871, sold four horses—one for £10; another for £14; another for £7; another for £60. In 1872, sold three horses; one for £33; another for £20; another for £10. This last sale was really a trade with one of the neighbors, in which I received £10 \"boot.\"\n\nWhen I came here I had seven horses; brought three of these with me in the fall of '66, and the remaining four the next summer. And during the six years I have been in the service of the mission I have altogether bought five. The additional horses not accounted for by purchase and possession were colts bred here.\n\n19. Do you know anything of trading or trapping said to have been done at the mission? What was done the first year?\n\nAll the trapping that has been done so far as I know was done the first year. Some of the boys brought out traps and some poison with them. I also brought some poison with me. The animals killed by poison and trapped by the boys, both wolves and foxes, might be about six in all as near as I can remember. I killed ten wolves, the value of the skins is 2s. for wolf and 4s. for fox. They were all sold to the company. No regulations having been made about trading up to this time, Mr. Nesbit now made a rule strictly forbidding all trading except for personal use. This rule has been ever since an article in the engagement of all the employees of the mission, and so far as I know I believe that this article of the agreement has been faithfully kept.\n\nSince the transactions specified above no furs have been bought here or sold to the Hudson's Bay Company or at Red River, or to parties trading between here and Red River. This statement I am ready to testify to on oath if necessary.\nSTATEMENT OF WM. McBEATH.\n\nSeptember 11th, 1872.—I was employed at the mission during the first year. There was a little trading the first year. The Indians were all round us, and we bought some things from them for our own use. I bought two moose skins from an Indian for which I gave a blanket and shirt. Used these skins for making pantaloons. I know that Mr. Polson bought moose skins for pants and moccasins. He got some beaver skins also, how many I do not know. I bought one from him, from which I made a cap.\nAPPENDIX F.\n\nEXAMINATION OF ADAM McBEATH, ESQ.\n\n1. How many acres are included in claim?\n\nTwenty-four chains frontage.* As yet, no claim has been taken for woodland. This claim can be taken up most prudently after the treaty has been made.\n\n2. How many acres have you under cultivation, specifying the quantity under each kind of crop; wheat, oats, hay, roots?\n\nAbout forty acres, or about the sowing of 86 bushels of wheat. This year, we have 15 acres of wheat; no oats; 12 acres of barley; half an acre of turnips; planted 50 bushels of potatoes; the hay is cut from the plains within a mile and a half from the house.\n\n3. How many hands employed in working? Of these, how many constantly employed? How many occasionally?\n\nJohn McKay, Wm. Bruce and myself; also an Indian boy, who is one of the mission children about 14 years of age. Also one young man from Mr. Drever, five days ploughing. This service was paid for by the loan of one yoke of oxen after the mission crops were in. In January, February and up to 15th March was assisted in the farm work by Roderick McBeath; most of his time during these two and half months was spent in preparing stuff for the church. Sometimes he brought in wood; sometimes took care of animals—anything required. Hay-making—occasional services by different persons,† equal to 12 days work. Joseph Bear, aged 17, 6 weeks beginning on 20th of July. Harvesting—besides the regular servants there have been employed three men two days each, to be paid in goods. Also assisted by Mr. Drever and three men for three days already, and may be a day more, whose labor is repaid him in kind by Mr. McBeath and the mission people. Also two Swampy Indians employed to take out the stumps and roots from one of the fields—they worked one week, and were paid with a bag of pomican.\n\n4. Wages of Superintendent? Of regular servants? Of occasional?\n\nSuperintendent, £75, $375—house room, living for self and family. Regular servants—Wm. Burns, £49 year, $200, and board. The boy belonging to the mission was simply clothed and fed.\n\n*According to Mr. Nesbit, the farm has a water front of twenty-six chains.\n†The Smiths referred to by Mr. Nesbit.\nRoderick McBenth, at the rate of £40, $200, per year and board. Haymaking—12 days, 36s. and board of men. Joseph Bear, £3 10s. per month—$17 50—engagement to run three months. The three men (Smiths) 2 days each at 4s. per day. Pemican, if bought or sold for cash at company rates, is worth £4 per bag. Cost to mission 12½ skins, or not more than 35s.\n\n5. What perquisites besides salary?\n   No perquisites or privileges beyond those noted above.\n\n6. What implements?\n   Threshing machine, worth laid down at time of purchase, £97; that is cost of machine, £75; transport, 22 cwt., £22; actual cost of machine £66 9s.—$332 25. Grist mill (small iron mill), prime cost and transport. Fanning mill, cost laid down £7 12s.—$38. Three ploughs; cost laid down, £6 10s. each. Harness, home made leather, cost here 16s, $4. Scythes, spades and hay-forks, £5 5s.—$26 25.\n\n7. Expense of seed?\n   No expense this year—last year 13s. for garden seeds. Year before about same amount for garden seeds; 1869, potatoes £2 10s. $12 50. 1868, no expense.\n\n8. Animals required for work?\n   The whole working stock in the way of animals, is six oxen and four horses.\n\n9. What other stock kept on place? Horses, oxen, cows? How many belong to the mission?\n   Besides working stock, there are 5 cows, belonging to the mission; one bull; six young animals (cattle) three years old and under, and three calves. Mr. McBeath at present owns five horses; no cows; no oxen. Mr. McKay, six horses; no oxen; no cows. Mr. Nesbit, two horses; five cows; no oxen; two yearling heifers and two calves.\n\nOnly those animals are stabled that are in actual use. The horses when not in use “find themselves” on the plains both summer and winter.\n\nAll the cattle are housed in winter.\n\nJohn McKay stabled one horse last winter for two months and a half, for which he paid to the mission £2 15s., $15 75. This was paid because the horse was doing nothing for the mission.\n\n10. Returns wheat, oats, hay, roots, other produce, butter, cheese, beef?\n\nThis year, 1871, the yield of hay was equal to only 120 bushels. It was made last year. I paid for beef, etc., enabled by the raised wages and hand.\n\n11. surplus\nThat is with flour meat?\n\nOut Bay Co. or $10 assumed of the\n\nIn the same,\n\nIn changed.\n\nNo other teaching pauper\n\naway\n\nfour cost these\n\nmade\n\nRet\n\nI left\n\nat all\nThis year fair crops but cannot yet estimate quantities. Last year, 1871, about 330 bushels of wheat, no oats, 80 bushels of barley; of hay year by year we lay in about 160 cart loads, (three cart loads equal to one good waggon load,) potatoes about 350 bushels, turnips 120 bushels. From eight cows last year sufficient butter and cheese was made to supply the want of all the families at mission for the year. Last year, 1871, two of Mr. Nesbit's oxen were killed for beef, (not charged to mission.) This year one mission ox, disabled by accident, was killed for beef. The largest wheat crop ever raised was in 1868, 600 bushels from 17 bushels sown—cradle reaped and hand threshed, thereby greatly reducing the return.\n\n11. Has any of the produce been sold? Has there been any surplus over and above the living of the families at the mission? That is to say if there was more wheat than what supplied mission with flour what was done with it? How much used for buying meat? How much used for paying freight? How much was for the work on the farm and buildings?\n\nOut of crop of 1868, £50 or $250 worth was sold to Hudson's Bay Company. And to other parties there was sold in all about £20 or $100. Most of this was exchanged for provision and stuff consumed by mission. Whatever balance there was, was to the credit of the mission in account with the Hudson's Bay Company.\n\nIn 1869, some produces exchanged for plain provisions, 1870 same, 1871 same. No freight paid in produce.\n\nIn each year a considerable quantity of the produce was exchanged for labor, giving small quantities for occasional days labor. No account kept except when there was balance on one side or the other. For much of this the labor was required for the sake of teaching the Indians to work and to correct a tendency to voluntary pauperism.\n\n12. Leave of absence, Farmer? How many times has he been away from mission? On what business?\n\n*Left here May 6th, 1869, after the spring work, took along four carts and seven oxen, and two young men hired for trip at a cost of £16 or $80, brought back eleven carts and eleven oxen, of these nine belong to mission, two belong to Mr. McBeath—no charge made for use,—(four horses used more or less, no charge made.) Returned to mission August 17th. The leave of absence began when I left mission, on account of accident, which happened at South Branch\n\n*This trip occupied with mission work and strictly speaking was not a \"leave of absence\" at all.\nyear before, and general lowness of health induced thereby. Left Red River to return about middle of August, 1871. Mr. McBeath was absent at this time eleven months.\n\n13. If for freight? How many cwt? When brought out?\nBrought out in 1869, 97 cwt. of freight.\n\nIn 1871, brought 55 cwt. freight, about half of this amount was freighted by myself, and with my own horses and carts. I was paid for this work the sum of £16 or $80. The other half was paid for at the usual rate, £1 or $5 per cwt. The reduction on the first mentioned half was made by Mr. McBeath, because part of it was personal property, and also because he had the assistance of one man servant belonging to mission, whose pay began from date of departure from Red River.\n\n14. Did salary run on during their absence?\nYes, I was paid salary during this time though it was not promised when I left.\n\n15. In your absence who managed farm? Did it entail additional expense in way of hired labor?\nMost of the time the farm was managed by R. McBeath and Mr. McKay after his return in spring. Principal work done was seeding, hay-cutting and part of harvesting.\n\nMr. R. McBeath would not have been here if I had been here. Philip Bear was here the whole time I was off; also, as Mr. McKay was not here a third hand was engaged for a few days. Philip Bear's wages were £40 and board per annum. Roderic McBeath also, had £40 and board.\n\n16. In what were you engaged during this time? And did any part of the wages earned go to the credit of the mission?\nI was Returning officer at the local election in December, 1870, three and a-half days, and also in February, two days at last election. I received for these services the sum of £7 10s., which I applied to personal use.\n\n17. Trading? Any furs bought? To whom sold? Any meat over the wants?\nI am ready to testify on oath that the letter and the spirit of my contract has been faithfully kept. I have only bought sufficient fur to make one cap, one pair mits and to trim one overcoat. In reality I bought only one of these skins, the other two were given to me as presents by Indians; but, for them I paid double their value\nto show that I had not taken them with a view to resell for profit, and the Indians knew that I was not a trader.\n\nI do not know of any trading by anyone else. I am positive that no trading has been done since my arrival. I have been here now five years. No poison has been used. No trapping has been done off the premises. Traps have been set with view of destroying wolves prowling about the premises.\n\n18. Have you ever heard, on reliable authority, of trapping done by parties connected with mission before you came?\n\nThe young men who did it told me of it themselves. They also used poison which was the occasion of a slight disturbance, but nothing of the kind has been done since.\n\n19. What private property have you on mission premises besides the horses already mentioned?\n\nNothing.\nAPPENDIX G.\n\nNOTES OF A CONVERSATION, HELD ON THURSDAY EVENING,\nSEPTEMBER 12TH, 1872.\n\nHaving called the missionary, interpreter and farmer together, for the purpose of conference, touching the best method of managing the concerns of the mission, so as to give the greatest possible guarantee for harmony among the missionaries, and satisfaction to the Committee, and prospect of success in the work of evangelization, I asked their opinion of the following plan, which, lend by this investigation, I was inclined to recommend.\n\nSeparate farm and mission. Pay the farmer and his employees out of the produce of the farm. The farmer to keep a strict account of the entire cost of production; to take account by weight and measure of all farm produce, and to keep it as a store from which the missionaries might purchase at the ruling market price, paying for all stuff bought as they would pay if buying from any other dealer or merchant.\n\nThe farmer's salary and perquisites to be carefully and accurately entered in agreement, and that besides the duty of superintendent he should be \"farmer\" and give his time and strength to manual labor, as a farmer would.\n\nThe missionaries to be paid a good living salary, sufficient to cover all the expenses, but have no extra allowance or perquisites of any kind. The Committee to find house and salary, he to find groceries, vegetables, grain, meat provisions of every kind, horse, carriage, &c., and in every respect to paying his own way as a minister at home—with leave to garden, keep cows and stock, provided always that such labor and stock keeping do not interfere with the discharge of his duty as missionary.\n\nI also inquired whether the present employees if such a plan were adopted would be willing to take an equitable cash payment yearly in lieu of the boarding &c., now provided.\n\nMr. Nesbit and Mr. McKay thought such a plan probably the best that could be adopted.\n\nMr. McKay expressed his readiness to enter into any arrangement whenever the Committee could perfect the plans, there being sufficient time allowed beforehand to enable all concerned to make their arrangements accordingly.\nMcBeath demurred, and thought the present plan less expensive, and though, perhaps, less perfect theoretically far more practicable.\n\n1. The chief objections to the proposed plan are first that there is no store from which employees having cash in hand could purchase goods.\n\n2. That the cost of transport and difficulty of getting goods, and liability of disappointment of persons ordering under the present circumstances of the country and\n\n3. There is no mill at which grain can be ground.\n\nAnswer to these objections:\n\n1. So long as the men prefer \"goods\" to cash in payment of labor or wages, goods can be furnished them for this purpose by the Committee, instead of cash.\n\n2. Cost and difficulty of transportation is no greater under proposed arrangement than at present. Missionaries and others could order together and the goods be sent in one case or under one way bill.\n\n3. The farmer could run the mill, as is done by the mission at present.\n\nMr. McBeath also stated that in the event of such an arrangement being ordered he would at once resign his position.\n\nHe considered his position to be that of Superintendent, and while willing to lend a hand to further any work needed (as he had always done) he did not regard it as his duty to perform the manual labor required of a farmer, and would not engage to do it.\nAPPENDIX H.\n\nBefore the present examination shall close I deem it my duty to express, in my own name and in the name of those associated with me in the work, the satisfaction that we feel in having been permitted to bring all the affairs of the mission so fully under the notice of one, appointed by the Committee to enquire into its condition and working; and we wish to express our appreciation of the kind and gentlemanly, yet minute and thorough manner in which the Rev. Mr. Moore has discharged the duty laid upon him.\n\nWe sincerely trust that the very full and, we believe, accurate information given and received will lead to a higher appreciation of the importance of this mission on the part of the church. In it we may not have done all that might have been desired and expected; but we have done what we could. We trust we have been enabled to lay a pretty broad foundation for future operations.\n\nSo far as we can see, opposition and prejudice are no longer manifested by any of the Indians. The mission is known and respected by the Indian population throughout a wide extent of territory, as will be seen by the statistics; a few have been hopefully converted, and others are known to be enquiring into the way of salvation.\n\nEncouragement has been given to settlement, and as a consequence a few Indians are making trial of a settled life, and of procuring part at least of their living from the soil, while the settlement of half-breeds and whites progresses much more rapidly than was at all anticipated.\n\nWe have made a beginning in the matter of receiving into the mission and educating Indian children, while the education of the settlers has not been overlooked.\n\nBut we have regarded our whole work as of a preparatory kind, paving the way for the entrance of other laborers into the field, and for the establishment of branch stations in other parts of this extensive district of country.\n\nWe have striven to organize a farm that might at once be an example and an encouragement to the Indians to adopt a settled mode of life, a means of teaching husbandry to the Indian youths, who may from time to time be residing at the mission, of rendering the mission to a certain extent self-supporting, and that it might in the\nfuture be a source of supply for other missions or stations that may be established in less eligible parts of the country.\n\nWe have labored to erect suitable and sufficient buildings, including a church, so that succeeding missionary laborers may be able to devote their energies the more fully to purely evangelistic and educational work; while, at the same time we have always kept before us the salvation of precious souls, the education of the people, and the organizing and building up of a Christian congregation.\n\nHow far we have succeeded in these various aims and objects it is for the respected deputy to judge and thereon to report to the Committee and to the church.\n\nFinally we have to thank the Committee for selecting such an able and efficient deputy to perform the difficult and somewhat delicate duties assigned to the Rev. Mr. Moore, and we thank Mr. Moore himself for the thorough and efficient, yet kindly and considerate manner in which he has discharged those duties.\n\nJAMES NISBET.\n\nWe fully and heartily concur in all that is contained in this document.\n\nJOHN McKAY,\nADAM McBEATH.\n\nPrince Albert, Saskatchewan,\nSeptember 13th, 1872.\nCost of Material, Building, &c., of Church at Presbyterian Mission, Prince Albert, Saskatchewan.\n\n| Description                                                                 | £   s  d. |\n|----------------------------------------------------------------------------|----------|\n| *80 pieces building wood at 1s. 6d.                                        | 6 0 0    |\n| 150 planks for floor, &c., at £4 5s. per C.                                 | 6 7 6    |\n| 350 boards for ceiling and sheeting at £3 per C.                            | 10 10 0  |\n| *Wood for seats                                                             | 0 0      |\n| *6 windows, with glass, &c., at £1 each                                     | 6 0 0    |\n| *Door with lock and hinges                                                  | 1 14 0   |\n| *Roof spars and couple backs                                                | 1 10 0   |\n| Nails for all purposes                                                      | 8 0 0    |\n| *20 bushels lime at 2s. per bush                                            | 2 0 0    |\n| Shingles from Hudson's Bay Company                                          | 15 2 6   |\n| *190 days by Mission servants at 5s. per day                               | 47 10 0  |\n| 23 days work—gratis—by settlers                                             |          |\n| Board at Mission of above settlers at 2s. per day                          | 2 6 0    |\n\nNet cost of Church .................. £113 0 0\n\n* Cut and delivered by stated employees of Mission.\n\nWork in preparing or making windows, door, &c., done in winter, and not counted in the 190 days.\n| £ | s. | d. |\n|---|----|----|\n|   |    |    |\n| 6 | 0  | 0  |\n| 6 | 7  | 6  |\n| 10| 10 | 0  |\n| 8 | 0  | 0  |\n| 6 | 0  | 0  |\n| 1 | 14 | 0  |\n| 1 | 10 | 0  |\n| 8 | 0  | 0  |\n| 2 | 0  | 0  |\n| 15| 2  | 6  |\n| 47| 10 | 0  |\n|   |    |    |\n|   |    |    |\n|   |    |    |\n\nTotal: 13 0 0\n\n- Hunter, and\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30478.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 60, "total-input-tokens": 94264, "total-output-tokens": 27459, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1541, 3], [1541, 2645, 4], [2645, 2995, 5], [2995, 2995, 6], [2995, 3338, 7], [3338, 3535, 8], [3535, 5488, 9], [5488, 7814, 10], [7814, 10147, 11], [10147, 12623, 12], [12623, 14805, 13], [14805, 17351, 14], [17351, 19882, 15], [19882, 21971, 16], [21971, 24720, 17], [24720, 27187, 18], [27187, 29666, 19], [29666, 32062, 20], [32062, 34664, 21], [34664, 37150, 22], [37150, 39629, 23], [39629, 41157, 24], [41157, 43279, 25], [43279, 44493, 26], [44493, 46261, 27], [46261, 48521, 28], [48521, 50613, 29], [50613, 53209, 30], [53209, 54920, 31], [54920, 57304, 32], [57304, 59612, 33], [59612, 61894, 34], [61894, 63863, 35], [63863, 65828, 36], [65828, 67877, 37], [67877, 70238, 38], [70238, 72279, 39], [72279, 74299, 40], [74299, 76560, 41], [76560, 78276, 42], [78276, 80628, 43], [80628, 82662, 44], [82662, 85093, 45], [85093, 87248, 46], [87248, 89611, 47], [89611, 90128, 48], [90128, 92299, 49], [92299, 94631, 50], [94631, 97098, 51], [97098, 99231, 52], [99231, 100023, 53], [100023, 102171, 54], [102171, 103498, 55], [103498, 105741, 56], [105741, 106899, 57], [106899, 108558, 58], [108558, 108860, 59], [108860, 108860, 60]], "primary_language": ["None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]