[{"id": "c59ef019934a5316cafd1741da6a84d97debf38a", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"A SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nMr. BLAKE. Before you proceed, Sir, to the other business of the House, I think it my duty to avail myself of my parliamentary right to make a substantive motion in order to raise an important question, as I consider it to be, a question both of gravity and of urgency, which the state of the public business, the order of the House and the procedure which has been pursued, preclude my raising in any other way. I refer to the duties of the Government and the rights and the obligations of this House with reference to information as to past events in the North-West leading up to the troubles which have recently taken place. I have not, since I entered this House, used, for any purpose, the motion which I am now about to use, always believing as I did and do believe, that the use of it should be a sparing use, that it should be reserved for questions and situations, such as the present situation and the present question. I believe that there subsists either a misconception or a misinterpretation of what the duties and obligations and rights of the Government and the House are with reference to this important question, and it is necessary that that subject should be cleared up, and that we should come to an understanding, if possible, as to what our relative position is in the matter.\n\nThe most limited conception of the fundamental function of Government is the maintenance of security to the citizen against attack from abroad, and against internal discord, and this includes his right to the full enjoyment of justice in the land. Our own constitution acknowledges and rather magnifies that limited conception of the functions of Government, by declaring, as it expressly does, that this Parliament is authorised to make laws for the peace, order and good government of our country; and if it be that peace has been broken, that public order—\nSir JOHN A. MACDONALD. In order that we may know the regularity or the irregularity of the hon. gentleman's speech, I must ask that he will make the motion on which he is going to speak.\n\nMr. BLAKE. I do not know that the hon. gentleman is entitled to have the motion placed in your hands, Sir, but I have no objection to state my motion. I am about to move that the House adjourn. It is the only motion I can move that will enable me to make this statement. It is the only regular motion, and that being so I thought that the hon. gentleman would have known it. If, as I was saying, the public peace has been broken, if the public order has been disturbed, if the authority of the Government has been violated, if insurrection has raised its head in Canada, I hold it to be the duty of the Government to give, and the duty of this House to demand, and its right to obtain, all the particulars, so that we may ascertain how these things have happened, so that we may deal with the whole subject, as it includes both the Government of the country, and those they rule, so that we may fix the responsibility upon the right shoulders, or share it, if it be a mixed responsibility, among the right shoulders; and I hold it to be the duty of the Government, and our right, that we should be placed in a position to form that judgment at the earliest possible moment. More than eight weeks have now elapsed since the insurrection broke out, and from that time out I have been constantly pressing for those pieces of information which might enable us to reach conclusions upon this subject. We all felt it to be our duty heartily to agree, heartily to assist in measures to restore the public authority, and we felt that that was a duty emergent and doubly incumbent upon us in the particular condition of the North-West country. We did so; whatever the Government proposed to us, they received without an instant's delay, and they received as well the moral support and countenance of every member of Parliament and of the people at large in taking the earliest, the most active, the most energetic, the most complete steps that they could devise in order to the restoration of public authority. But while we have been doing that we must not lose sight of this very important duty of ours, nor must we lose sight of this very important obligation of the Government. I say the obligation of the Government to bring down to Parliament the materials upon which Parliament may pronounce a judgment, is clear and plain. They have full power to govern, and it is difficult to presume that without some neglect, or delay, or wrong, such results as have taken place.\nplace, could have taken place. But I quite admit it to be true that they may have taken place without neglect, without delay, without mistake, without misgovernment. That is indeed possible; but if there is to be a presumption, the presumption must, at the moment, be against those in authority. The Government of the day may rebut that presumption, but they are obliged to undertake the task, and the condition upon which alone they can accomplish such a rebuttal, is full information and full materials on which a judgment can be reached. We have the right of judgment, and we have the duty of judgment; we are to pass between our fellow citizens lately in arms and their rulers on the political question, and we are to pass on the questions between the Indians and their rulers. Besides having that right, we have a great responsibility, as the last court of appeal, in this matter. We are the people's representatives, the great inquest of the country, upon whom it devolves to enquire thoroughly into such large questions as these. I say the duty of the Government is obvious on general principles. It flows from their position and ours. It has been frequently admitted and acted upon in England. It has been admitted and acted upon here. It was acted upon here by the hon. gentlemen themselves on the occasion of the former disturbance in 1870. We had at that time a disturbance, a serious disturbance, though much less serious than the present one, in connection with our acquisition of the North-West. When we met Parliament on the 15th February, 1870, Louis Riel was in possession of the Red River settlement, as the president of the Government which he had assumed to form in that country; negotiations were going on with the people of the country; an armed force was being organised, or was contemplated at any rate, for progress there in the spring. In that condition of things the Parliament met on the 15th February, 1870. On the 24th day of that month, the Government brought down by Message, not upon solicitation, not upon instance, not upon pressure, but voluntarily by Message from His Excellency, the documents connected with and throwing light upon the causes of that outbreak up to the latest date, and comprising a mass of papers which, when printed exceeded 150 pages of print. The Government did not think that they were justified in picking and choosing for themselves; they felt that the situation was one which entitled both sides of the House to know all that had transpired, and they therefore brought down all the papers. They proposed, on the day on which they brought them down, the formation of a select committee, struck from both sides of the House, on which were the late lamented Mr. Holton, my hon. friend\nthe present member for East York (Mr. MacKenzie) and myself, from the Opposition side of the House, to go over the papers which were brought down in the Message, in order that they might report to the House what papers it would be expedient to publish at that time. They felt that, in that peculiar condition, it was for the House to decide, through the medium of a committee struck by the House, and in which both sides had confidence, what papers should be withheld; and they, therefore, brought down all, and left to that committee the duty of deciding what, in the public interest at the moment, ought not to see the light. In a very few days—as I have said, this transaction took place on the 24th, nine days after the opening of the Session—within a very few days thereafter, that select committee reported, and recommended the publication of all the papers brought down, with the exception of one single despatch from the provisional Lieutenant Governor, the Hon. Mr. Macdougall, and the names of two or three persons occurring in two or three places in some of the correspondence, which names were replaced by asterisks. Almost immediately upon the opening of the Session, my hon. friend from East York moved for other papers—not knowing, of course, what the Government would bring down—other papers connected with some details as to the surveys and other points. That motion was granted, and those papers were brought down within a very brief period.\n\nWhat were these papers? What was the general character of these papers and of this information which the Government, upon the occasion to which I refer, with reference to the outbreak that had taken place in the North-West, to prevent our entry into and assumption of the government of that country, with reference to a condition of things in which there was a de facto government assumed to be established there, and which was assuming to act; while negotiation was going on for settlement; while an armed expedition was arranged to proceed in the spring—what was the general character of the papers then brought down? They professed to be everything that threw light on the cause of the trouble, that threw light on the conduct of the Government, that threw light on the conduct of the Hudson's Bay Company, that threw light on the conduct of the population, that threw light on the conduct of the officers of the Government; all the instructions, all the despatches, all the correspondence, all the papers from which this House and this country could form its judgment as to how that trouble had arisen, as to what it was due to, as to who were responsible for it, and as to what course\nshould be taken in regard to it, were voluntarily brought down by the Government of the day in discharge of what they felt to be their public duty, their bounden duty, their obvious obligation to the country and to Parliament. I shall trouble the House with a few references to the papers so brought down, in order that I may show by those references the kind of papers that were thought fit to be brought down, and at the same time incidentally throw some light upon the present situation. That situation differed very much from the present. We had bargained for the transfer of the territory, but we were not in control of it, and, as I have always thought, due precautions had not been taken either by the Government of this country or by the Hudson's Bay Company in that respect. I believe that proper preliminary communications with the Hudson Bay Company's authorities and with the people at large, did not take place before those steps were taken, which resulted so unfortunately, the steps with reference to surveys, the steps with reference to the entry of the Governor. I believe that due information with reference to the intentions of the Government as to the constitution to be proposed, and the plan of government of the new Territory, as to the rights of the people in their lands, was not communicated at the proper time. I believe that the surveys, the making of the surveys, the attempt to make the surveys without the extinguishment of the Indian title, and in the condition of feeling amongst certain classes of the population, was a very great mistake, as was the making of them, without full and authoritative and authentic communication to the settlers as to the intentions and object of the surveys, although such information was, to some extent, communicated by Colonel Dennis. As I have said, I believe the Hudson Bay Company's authorities were also to blame. They were to blame for not communicating to the Government of Canada, and, if necessary, to the Imperial Government, the facts which they knew, or ought to have known, as to the condition of feeling among the people, and for not advising the course it would have been proper to take under the circumstances. Now, Sir, these papers, amongst others, contain proofs which seem to me to indicate, as I have said, two things. First, the kind of information which the Government felt it its duty to bring down in order that the House might judge whether it had been right or wrong in its procedure; and, secondly, some things which would help us to a judgment when the time arrives for judgment on the present difficulty. They comprise, amongst others, a letter from Col. Dennis, who had been charged with some duties in connection with\nthe surveys, to Mr. Macdougall, in his capacity as Minister of Public Works at Ottawa, on the 21st August, 1869, a letter written from the Red River settlement, in which he says:\n\n\"I find that a considerable degree of irritation exists among the native population in view of surveys and settlements being made without the Indian title having first been extinguished. You will, no doubt, have become aware that the half-breeds lately, in a public meeting, called the company here to account in the matter of the money paid for the transfer to Canada.\n\n\"Whatever may have been the views of the Government as to the character of the title to be conveyed by the deed of transfer, whether the expense may or may not be fairly chargeable to the company, I am satisfied that the Government will, in the first place, have to undertake the extinction of the Indian title.\n\n\"This question must be regarded as of the very greatest importance. In connection therewith I would reiterate to you my conviction, as expressed while at Ottawa, that nothing should be lost. The necessity for prompt action is more apparent to me now than it seemed even then. Supposing the transfer from the company to have been complete, it is possible that the object may be carried out yet, this fall. There can be no question as to the prejudicial effects in retarding the settlement of the country, should the half-breeds and Indians assume a position of hostility to any extent whatever towards the incoming settlers, or towards the Government.\n\n\"The difficulties of the position may be much enhanced by giving the discontented parties the winter to brood over and to concert measures in opposition to the views of the Government. In the meantime, the French half-breeds who constitute about \\( \\frac{1}{3} \\) or \\( \\frac{1}{4} \\) (say 3,000 souls), of the settlement, are likely to prove a turbulent element. This class have gone so far as to threaten violence should surveys be attempted to be made.\"\n\nThen, on the 20th of August following, the same gentleman writes to the same Minister a letter, from which I also read a brief extract:\n\n\"In the first place I had proposed, until fully advised as to the system of farm surveys which might be adopted by the Government, to employ the time in surveying the belt of lands granted by the company which embraces a strip of two miles in width on each side and extending up the Red River for the distance of say, 40 miles from the mouth, and also along the Assiniboine in the same way for many miles. This I have hesitated to go on with at the present time, in consequence of much of the land being under crop; going through which would involve more or less injury to individual settlers, a measure which, in the present temper of the half-breeds, is to be deprecated.\"\n\nAgain he says:\n\n\"I have again to remark an uneasy feeling which exists in the half-breeds and Indian element, with regard to what they conceive to be the premature action taken by the Government in proceeding to effect a survey of the lands without having first extinguished the Indian title, and I beg permission to reiterate the conviction expressed on a former occasion, that this must be the first question of importance to be dealt with by the Government. I have, of course, taken every opportunity to assure this element as to the intention of the Government to deal honorably and fairly in the matter in question, and shall go on quietly with my work. Should, however, this feeling be likely to result in any opposition of a character likely to prejudice a settlement fraught with importance to the immediate future of this country, I shall at once cease operation and await your future orders.\"\nOn the 22nd of September following, Mr. Macdougall as Minister of Public Works, sent a memorandum to the Council stating:\n\n\"Mr. Dennis, after consulting with the Crown Lands Departments, both in Canada and the United States, in accordance with the above instructions, has forwarded certain papers embracing a proposed system of surveys and sub-divisions of public lands in that part of the Dominion.\"\n\nOn the 11th October, 1869, Colonel Dennis sends a memorandum giving the circumstances connected with the active opposition of the French half-breeds in this settlement, to the prosecution of the Government surveys:\n\n\"This day, about 2 p.m., a messenger arrived, a former chainbearer of Mr. Webb's party, employed in surveying the base line or parallel of latitude between townships 5, 6 and 7, bringing the unwelcome information from Mr. Webb that his further progress with the survey had been stopped by a band of some 18 French half-breeds, headed by a man named Louis Riel.\"\n\nI read then another extract:\n\n\"He was ordered by the leader of the party at once to desist from further running the line, and in fact notified that he must leave the country on the south side of the Assiniboine, which country the party claimed as the property of the French half-breeds, and which they would not allow to be surveyed by the Canadian Government.\"\n\nWell, Mr. Dennis goes on to say that he applied to Mr. Cowan, who was a magistrate, for magisterial assistance, and he adds:\n\n\"I remarked to Mr. Cowan at the same time, that I questioned whether, owing to the unsettled state of the land tenure as regards the half-breeds and Indians, and the peculiar irritation or sensitiveness that existed on the part of the French half-breeds in view of the transfer of the territory, and the assumption of the Government by Canada, it would be politic to take harsh measures towards the offenders in this case.\"\n\nOn the 12th October, 1869, Governor Macdougall wrote a letter to Mr. Smith, Secretary of the Hudson's Bay Company, from which this is an extract:\n\n\"I am also sorry to inform you that some of the people here have stopped one of Colonel Dennis' surveying parties, and as usual, of course, the colonel came to us for redress. The men who have thus interfered say they know the survey could proceed without any injury to anyone; but stopping it is always a beginning, and they are desirous to let the Canadian Government know 'that it is not wanted by them,' that they consider, if the Canadians wish to come here, the terms on which they were to enter should have been arranged with the Local Government here, as it is acknowledged by the people in the country.\"\n\nMr. Cowan, on the 15th October, 1869, replied to Colonel Dennis:\n\n\"I very much regret to say that we have failed entirely in our endeavors to get over the opposition of the French Manitoba settlers to the survey.\"\n\nOn the 12th February, 1870, Colonel Dennis made a long\nreport upon the whole subject to the Minister of Public Works at Ottawa, from which I read a short extract:\n\n\"I should here state that I had previously explained the object of such survey to the people, that the survey was not to disturb boundaries or possession, but to ascertain each man's actual occupation, and make a plan thereof, so that the Government would be in a position, at the earliest possible date, to carry out their intention to confirm Government deeds, and all bona fide occupants of land.\n\n\"The English speaking people appeared to understand and appreciate the necessity for the measure, and the boon it would be to have their titles perfected, and showed every facility to the surveyors employed at the work.\n\n\"I gave strict orders, however, not to survey in that portion of the settlement occupied by the French half-breeds and although I had, as early as the day after my arrival from Canada, on the 21st August, called on the dignitaries of the Roman Catholic Church, at the palace of St. Boniface, on which occasion I saw Père Tissot, Père Allard, and the other priests, and explained the same thing to them, and those gentlemen had also expressed themselves most favorably toward the measure, and promised that they would explain the same to their people, and recommend them not to throw any difficulties in the way of these necessary surveys being effected; still, as the outbreak occurred a few weeks after, and I had every desire to avoid any further possible cause of offence to that party, I gave the orders above, and to my knowledge they were not departed from by either of the gentlemen employed.\"\n\nThat finishes the extracts which I think it material to read, showing the degree of information supplied, and the condition of things upon the question of surveys, from August, 1869, onwards. On the 27th October, 1869, Mr. Dennis communicated to Mr. Macdougall, when outside the Territory, I think in the neighborhood of Pembina, a statement in which he declares:\n\n\"The attitude of the English speaking portion of the colony may, I think, be fairly stated as follows:—\n\n\"They say, we feel a disposition to extend a sincere welcome to the Hon. Mr. Macdougall, as the gentleman who has been selected for our future Governor.\n\n\"We regret sincerely that the good name of the colony should be prejudiced by any such action as we are told is contemplated by a portion of the French half-breeds.\"\n\nThen another extract:\n\n\"We feel this way—we feel confidence in the future administration of the Government of this country under Canadian rule; at the same time, we have not been consulted in any way as a people, in entering into the Dominion.\n\n\"The character of the new government has been settled in Canada without our being consulted. We are prepared to accept it respectfully, to obey the laws, and to become good subjects; but when you present to us the idea of a conflict with the French party, with whom we have hitherto lived in friendship, but not as, as they would be, by the Roman Catholic Church, which appears probable by the course at present being taken by the priests, in which conflict it is almost certain the aid of the Indians would be invoked, and perhaps obtained, by that party, we feel disinclined to enter upon it, and think that the Dominion should assume the responsibility of establishing amongst us what it, and it alone, has determined upon,\"\n\nNext, Mr. Macdougall wrote to Mr. McTavish, who was the\nlocal head of the Hudson's Bay Company at Fort Garry, a letter in the month of November, in which he pointed out that he thought the duty of the Government was to proclaim the fact that Canada was now the proprietor and the Government of the country. Governor McPavish, on 9th November, 1869, answered Mr. Macdougall, in a letter, from which I will read two extracts:\n\n\"The Act in question referred to the prospective transfer of the Territory, but up to this moment we have no official intimation from England or the Dominion of Canada, of the fact of the transfer, or of its conditions, or of the date at which they were to take practical effect upon the Government of this country. In such a state of matters, we think it is evident that any such act on the part of the Red River authorities as that to which we point, would necessarily have been marked by a great degree of vagueness and uncertainty; it was felt that it might affect injuriously the future, as well as the present Government; and we therefore deemed it advisable to await the receipt of official intelligence of the actual transfer of the country, and of all the details which it concerned us to know.\"\n\nAgain:\n\n\"It is unquestionable that the preservation of the public peace is the paramount duty of every Government; but while in ordinary circumstance it might be reasonable enough to cast upon us the exclusive responsibility of preserving the public peace, it may perhaps at the same time admit of doubt whether some degree of responsibility did not also rest upon others in a case of so exceptional a character as this,—a case in which not merely a whole country is transferred, but also, in a certain sense, a whole people, or where at least the political condition of the people undergo such a great change; and it may moreover be a question whether, on the part of the Government the preliminary arrangements for introducing that change have proceeded upon such a just and accurate appreciation of the condition of the country and the peculiar feelings and habits of its people, as on such an occasion was desirable, if not absolutely essential; and whether the complications by which we are now surrounded may not, to a great extent be owing to that circumstance.\"\n\nNegotiations were then entered into by the Government at Ottawa with a view to sending out commissioners to deal with the people of the country, and amongst those was Very Reverend Grand Vicar Thibault, to whom, as a part of his instructions, on December 4th, 1869, the late Secretary of State addressed a letter, from which I will read some extracts:\n\n\"That the disturbances which have taken place at and around Winnipeg and Fort Garry have grown out of vague apprehensions of danger, incident to the transition state of things which the action of the Imperial Government and Parliament rendered inevitable, there is no reason to doubt; but it is quite apparent that, underlying what is natural and pardonable in this movement, there have been agencies at work which loyal subjects cannot countenance, and that artful attempts have been made to mislead the people by the most flagrant and absurd misrepresentations. Had the Queen's Government or the Government of the Dominion imitated the rash and reckless conduct of some of those who have taken part in this disturbance, there would ere this have been bloodshed and civil war in Rupert's land with the prospect of the flame spreading along the frontier as the fire spreads over the prairie. For-\ntunately calmer counsels have prevailed both in England and at Ottawa. The proclamation of the Queen's representative, with copies of which you will be furnished in French and English, will convey to her people the solemn words of their Sovereign, who, possessed of ample power to enforce her authority, yet confides in their loyalty and affectionate attachment to her throne.\"\n\nAnother extract:\n\n\"All the Provinces of the British Empire which now enjoy representative institutions and responsible government have passed through a probationary period, till the growth of population and some political training prepared them for self-government. In the United States the territories are ruled from Washington till the time arrives when they can prove their fitness to be included in the family of state and, in the halls of congress, challenge the full measure of power and free development which American citizenship includes. It is fair to assume that some such training as human society requires in all free countries may be useful, if not indispensable, at Red River; but of this you may be assured, that the Governor General and his council will gladly welcome the period when the Queen can confer, with their entire approbation, the largest measure of self-government on her subjects in that region, compatible with the preservation of British interests on this continent and the integrity of the Empire.\"\n\nA proclamation dated December 6th, 1869, referred to in the dispatch from which I have read some extracts, contains these words:\n\n\"Her Majesty commands me to state to you that she will be always ready through me as her representative to redress all well founded grievances, and that she has instructed me to hear and consider any complaints that may be made, or desires that may be expressed to me as Governor General. At the same time she has charged me to exercise all the powers and authority with which she has entrusted me in the support of order and the suppression of unlawful disturbances.\"\n\nThen again:\n\n\"And I do lastly inform you, that in case of your immediate and peaceable obedience and dispersion, I shall order that no legal proceedings be taken against any parties implicated in these unfortunate breaches of the law.\"\n\nOn the day following, namely, December 7th, 1869, the Secretary of State wrote to Mr. Macdougall a letter, from which I take two extracts:\n\n\"You will now be in a position in your communications with the residents of the North-West to assure them (1) that all their civil and religious liberties and privileges will be sacredly respected; (2) That all their properties, rights and equities of every kind, as enjoyed under the government of the Hudson's Bay Company, will be continued to them; (3) That in granting titles to land now occupied by the settlers, the most liberal policy will be pursued.\"\n\nAgain:\n\n\"(8) That the present Government is to be considered as merely provisional and temporary, and that the Government of Canada will be prepared to submit a measure to Parliament, granting a liberal constitution as soon as you, as Governor, and your Council have had an opportunity of reporting fully on the wants and requirements of the territory.\"\n\nA question arose at this time as to whether the Imperial\nGovernment should pay over to the Hudson's Bay Company the purchase money which had been placed at their disposition to be paid over upon the transfer by the Canadian Parliament, the sum of £300,000 sterling; and in considering that question and in response to the letter of the home authorities upon the subject, and a committee of the Privy Council on December 16th, 1869, made a report which was approved and transmitted to the Colonial Secretary, and which is signed by the right hon. gentleman (Sir John A. Macdonald). From it I will read some extracts:\n\n\"That there would be an armed resistance by the inhabitants to the transfer was, it is to be presumed, unexpected by all parties; it certainly was so by the Dominion Government. In this regard the company cannot be acquitted of all blame. They had an old and fully organised government in the country, to which the people appeared to render ready obedience. Their Governor was advised by the Council, in which some of the leading residents had seats. They had every means of information as to the state of feeling existing in the country. They knew, or ought to have known, the light in which the proposed negotiations were viewed by the people under their rule. If they were aware of the feeling of discontent, they ought frankly to have stated it to the Imperial and Canadian Governments. If they were ignorant of the discontent, the responsibility of such wilful blindness on the part of their officers must rest upon them. For more than a year these negotiations have been actively proceeded with, and it was the duty of the company to have prepared the people under its rule for the change—to have explained the precautions taken to protect the interest of the inhabitants, and thus have removed any misapprehensions that may have existed amongst them. It appears that no steps of any kind in that direction were taken. The people have been led to suppose that they have been sold to Canada with an utter disregard of their rights and position. When Governor McTavish visited Canada in June last he was in communication with the Canadian Government, and he never intimated that he had even a suspicion of discontent existing, nor did he make any suggestions as to the best mode of effecting the proposed change with the assent of the inhabitants.\"\n\nAgain:\n\n\"Any hasty attempt by the Canadian Government to force their rule upon the insurgents would probably result in armed resistance and bloodshed. Every other course should be tried before resort is had to force. If life were once lost in an encounter between a Canadian force and the inhabitants, the seeds of hostility to Canada and Canadian rule would be sown, and might create an irreducible hatred to the union of the countries, and thus mar the future prosperity of British America. If anything like hostility should commence, the temptation to the wild Indian tribes and to the restless adventurers who abound in the United States (many of them with military experience gained in the late civil war) to join the insurgents would be almost irresistible. Already it is said that the Fenian organisations look upon this rising as another means of exhibiting their hatred to England. No one can foresee the end of the complications that might thus be occasioned, not only as between Canada and the North-West, but between the United States and England. From a sincere conviction of the gravity of the situation and not from any desire to repudiate or postpone the performance of any of their engagements, the Canadian Government have urged a temporary delay of the transfer. This is not a question of money—it may be one of civil war. It is one in which the present and future prosperity of the British possessions in North America is involved, which prosperity hasty action might permanently prejudice.\"\nAgain:\n\n\"The Committee would also request your Excellency to assure Lord Granville that the Government have taken and are taking active measures to bring about a happier state of affairs.\n\n\"They have sent on a mission of peace to the French half-breeds now in arms, the Very Reverend Mr. Thibault, Vicar General (who has labored among them as a clergyman for thirty-nine years), accompanied by Colonel De Salaberry, a gentleman well acquainted with the country and with the manners and feeling of the inhabitants. These gentlemen are fully informed of the benevolent intentions of the Canadian Government, and can disabuse the minds of the people of the misrepresentations made by designing foreigners.\"\n\n\"(Signed) JOHN A. MACDONALD.\"\n\nOn the 17th of December the Government at Ottawa issued a commission to the Hon. Donald A. Smith, who was well known to and familiar with the country and its people, in his capacity as a resident of many years, and as occupying a responsible position in the Hudson's Bay Company. In that commission it was said:\n\n\"And whereas it is expedient that enquiry should be had into the causes and extent of such obstruction, opposition and discontent aforesaid, and also to enquire into the causes and discontent and dissatisfaction alleged to exist in respect to the proposed union of the said North-West Territories with the Dominion of Canada; and further to explain to the inhabitants of the said territory the principle on which the Government of Canada intends to administer the government of the country, according to such instructions as may be given to you by our Governor in Council in this behalf; and to take steps to remove any misapprehension which may exist in respect to the mode of government of the same, and to report to our Governor General the result of such enquiries, and on the best mode of quieting and removing such discontent and dissatisfaction; and also to report on the most proper and fitting mode for effecting the speedy transfer of the government and the country from the authority of the Hudson's Bay Company to the Government of Canada, with the assent of the inhabitants.\"\n\nWe passed the Manitoba Act during that Session, and that Act declares in its 31st clause:\n\n\"And whereas it is expedient towards the extinguishment of the Indian titles to the land in the Province, to appropriate a portion of such ungranted lands to the extent of 1,400,000 acres thereof, for the benefit of the families of the half-breed residents, it is hereby enacted that, under regulations to be from time to time made by the Governor General in Council, the Lieutenant Governor shall select such lots or tracts in such parts of the Province as he may deem expedient, to the extent aforesaid, and divide the same among the children of the half-breed heads of families residing in the Province at the time of the said transfer to Canada, and the same shall be granted to the said children respectively, in such mode and on such conditions as to settlement and otherwise as the Governor General in Council may from time to time determine.\"\n\nThe 32nd section dealt with the settlers' titles. The Hudson Bay freehold grants were turned into freehold grants from the Crown; the Hudson Bay grants, less than freehold, were turned into freehold grants from the Crown; titles by occupancy with license of Hudson's Bay Company, when the Indian titles were extinguished, were turned into freehold\ngrants from the Crown; those who were in peaceable possession of lands, in which the Indian title was not extinguished, were declared to have a preemptive right, at a price to be fixed by the Governor in Council; and the hay and common rights were to be recognised, and it was declared that they should be commuted by grants in fee simple. With the view of carrying out the arrangements of the Manitoba Act as to half-breed grants, on the 29th of July, 1870, the late Sir George E. Cartier recommended to Council the appointment of Lieutenant Governor Archibald as administrator of Manitoba Crown lands:\n\n\"And that he be required to report when called upon, on the regulations to be made under the Manitoba Act for the selection and division of the grant among the children of the half-breed heads of families residing in Manitoba at the time of the transfer to Canada, together with the mode and conditions as to settlement and otherwise which he may consider desirable to embody in such regulations.\"\n\nThere was an Order in Council made on the 2nd of August, 1870, based on that recommendation, and on the 4th of August the Secretary of State, pursuant to that order, wrote to Lieutenant Governor Archibald, communicating the Order and saying:\n\n\"I have to request that you will have the goodness at your earliest convenience to report the regulations, etc., etc., in terms of the above Order in Council.\"\n\nDetails were required, in order to the Lieutenant Governor's carrying out this provision, and on the 4th of August, 1870, a letter from the Secretary of State was sent to Lieutenant Governor Archibald, conveying him his instructions, also the 9th paragraph being as follows:\n\n\"In order to enable you to select, under the provisions of the 31st section of the Act, and under the regulations to be, from time to time, made by the Governor General in Council, such lots or tracts from among the ungranted lands in such parts of the Province of Manitoba as you may deem expedient, to the extent mentioned in the said section, and divide the same among the children of the half-breed heads of families residing in the Province at the time of the transfer of the same to Canada—you will cause an enumeration to be made of the half-breed heads of families residing in the said Province at the time of such transfer, and of their children respectively.\"\n\nOn the 1st of October, 1870, the Lieutenant Governor, pursuant to those instructions, divided the Province for enumeration purposes, and appointed the enumerators; and in the same month issued the instructions and forms to the enumerators. Those instructions included the direction to count anyone whose dwelling house or place of residence was within the Province at the time of the transfer, though, at the time he might have been, or may now be temporarily absent, and the enumeration so far was proceeded with at a comparatively early date, although, of course, it turned out afterwards to be defective, by reason of certain persons not\nhaving been in the Province at the time, and evidence not having been brought forward by them at the time of the general enumeration. In the following Session there was brought down also a letter from Hon. Donald A. Smith, in the capacity of chief officer, I presume, of the Hudson's Bay Company, addressed to the Lieutenant Governor, as to the District of Saskatchewan. The letter was written at Fort Garry, and dated 9th September, 1870. In that letter he says:\n\n\"For several years past outrages have been of frequent occurrence there, with which the authorities have been powerless effectually to deal; and such are at present the latent elements of disorder that it is impossible to predict how long a general outbreak may be delayed, similar possibly in many respects to that of recent occurrence in this place.\"\n\nAnd he cites a number of instances. First, a murder on Christmas, 1866; second, liquor riots and orgies; third, encounters between Assiniboines, Crees and Blackfeet, annually becoming more perplexing to the Hudson's Bay Company's people; fourth, the existence of a settlement of French half-breeds at a place named St. Albert, a collision between the inhabitants of which and the Indians had already occurred, while a repetition of such events was much to be dreaded; fifth, the Hudson's Bay Company's people were not likely to be able to live long at peace with the Indians, and he mentions that in 1867, Fort Pitt was forcibly entered by 200 Blackfeet, who pillaged the fort and afterwards the trains of supplies of the fort hunters; sixth, shortly after a Blackfoot severely wounded a clerk at Carlton by a gun shot; seventh, in the spring of 1870 an encounter took place between the Blackfeet and the Crees involving serious danger to the Company's Factor Christie at Edmonton; eighth, in the spring of 1870 W. E. Traill, a clerk at Fort Pitt was savagely assaulted by a half-breed servant, and hit on the head with a hatchet; ninth, advances are a necessary of life to the half-breeds, whose improvidence obliges them to live during the winter on the prospective summer's profits; and the refusal to make these advances would expose the company's stores to certain pillage; tenth, a generally mutinous conduct throughout the settlement. He adds:\n\n\"The miners, the missionaries and others who have founded isolated settlements on the Saskatchewan live in the midst of personal dangers far more serious than those which menace the lives of the Company's servants at their posts.\"\n\nAnd he requests a force of fifty men at once at Edmonton and a like force next spring at Carlton to meet the pressing difficulties of the case. Now, Sir, these papers, as I have said, sufficiently indicate the character of the information which the Government thought it its duty to bring down, and which was supplied to Parliament at that time;\nand thus, as I have indicated rather than related, in the end, after the spilling of some blood, though a drop only in comparison with that which has been lately shed; after the expenditure of much treasure, though a trifle only in comparison with that of which we have now to face the expenditure; after the running of great risks; after the creation of much ill-feeling; a small Province—because we must remember what was then done was to create only the original Province of Manitoba—was hastily formed, and a solution of the pressing difficulties was found, though the consequences of the errors then committed have extended far beyond the time of that solution. We bought, Sir, a very dear experience, and with that experience we began our course of governing the great territory of the North-West. Since that time 15 years have elapsed, and we must ask ourselves, how we have used the experience that was acquired, how we have fulfilled our mission, how we have exercised our power; and those questions are to be answered soon. I state them only to-day; I do not propose to attempt to answer them to-day, because my contention is that it is the Government's duty to furnish us authentic means for answering. I state them to-day; but even their statement requires some exposition. As I have said, the actual terms of settlement embraced only the area of a small Province; but beyond that small Province there were vast regions, dotted over here and there with Indian tribes, and here and there, though in very few quarters, with small settlements, if one can call them so, of half-breeds or whites, with a mission, or a Hudson Bay post. As the great settlement of the North-West Territories in the east was on the Red and the Assiniboine rivers, so the great settlement, if you may call it so, in the western part of those Territories was on the mighty Saskatchewan river, and for the same cause. At several points on the Saskatchewan there were very early settlements. The land was very fertile, the river was the great artery of the internal trade of the country, limited though that trade was; and it was also for the people, during a large portion of the year, a chief means of communication. Many years before 1870 the churches had occupied the field. The Church of England, the Roman Catholic church, and other churches, had established missions, some in the very neighborhood of the focus of the present disturbance, and there had been pioneers—some of mixed blood, but very few—there for many years. The settlement was then composed—besides Hudson Bay officials, where they had posts, besides the missionaries—of half-breeds—French, Scotch and English, whom you might call settlers, but who were largely freighters and hunters, and some of\nwhom also farmed a little—and of some old Hudson Bay employés, and other pioneers from Ontario, Quebec and elsewhere. To that settlement had naturally extended under its circumstances the same system of occupying the river fronts which had obtained in the Province of Manitoba. It had not originated there; for Canadian purposes, at any rate, we may say, it had originated in the Province of Quebec, where that system obtained from the very early settlement of the country, and probably for obvious reasons—for the reason that protection from Indian attacks, society and good neighborhood, the facility of communication by the great river which was the chief means of communication, the facility of obtaining what they wanted and going where they wanted, were largely served, by the people living tolerably close together on the edge of the stream; and so you found a system of narrow frontages on the river, and the farms extending a long way back. Both from habit and custom, as well as from reason, those plans of action were adopted in the North-West; and there may be found another reason, for this system gave the advantage of river flats, with meadow lands belonging to them, and a variety to the farm which would be important to the comfort and prosperity of the settlers. Now, the solution which was reached for the Province of Manitoba itself, on any points in which the condition of things was similar in substance would, in equity and in the natural expectations of the people, apply to the territories beyond. If there were just the same class of persons similarly circumstanced as to race, as to claim, as to situation, and as to occupancy, outside of the bounds of Manitoba, as those within that Province, it was not unnatural to say that they should expect similar treatment; and it was not unnatural to suppose that what was just for the one would be just for the other. Under these circumstances, with reference to the extinguishment of the Indian title of the half-breeds, with reference to the rights of occupancy and settlement, with reference to the river front question, and with reference to the question of surveys—upon the jealousy and suspicion attending which I have already indicated the strong view of that class of the population in the early days—on all these questions, I say, we had had experience which should have been profitable to us, and we had established precedents which were calculated at once to raise expectations and to furnish a method of settling difficulties. Of this vast territory to which I have referred, we have for 15 years now had the control; there is no Hudson Bay Company government to blame now; we must bear our own burden, and\nthe control we have had has been that of a paternal or autocratic Government working from Ottawa, and no doubt with large, I may almost say with unlimited powers; for whatever powers it felt in want of, it asked from this Parliament, and whatever powers it asked from this Parliament, this Parliament unflinchingly, and at once, granted to it. This being so, Sir, having so entered into possession and control, and having for 15 years so ruled that country, how stands the case today? What has been and what is the condition of affairs? We know how the case has stood since the middle of the month of March. We know that the condition which I suggested hypothetically awhile ago has been the actual state of things; we know that the public peace has been broken, that the public order has been violated, that the public authority has been defied, and that insurrection has raised its head in that country. We know that 5,000 Canadians have been put in battle array by the Government, with the willing support of the Parliament and the people of the country; we know that bloody engagements have been fought; we know that the lives of some of the best and bravest of our sons have been lost; we know that many of those best and bravest have been wounded; we know that some have died, and that many more, in the natural course of events, will suffer permanently from the hardships incidental to war, those hardships which are its chief scourge, which furnish the chief loss in war, a loss far greater than that which is to be traced on the field of battle. We know that those hardships and those difficulties and those infirmities, so produced, have been borne uncomplainingly; and we must remember that though they do not give the honor of a wound, they strike as severely and as hard as any wound can strike. We know that the families and the friends of these volunteers have suffered, not only in feeling but in comfort; we know that the pittance they are paid in many cases does not support them, and that the public of various localities has been obliged to come forward in order to keep the wolf of hunger from the door of the wives and children of those who are fighting our battles in the North-West. Now, Sir, in the course of these transactions, our troops have done nobly. It is not, perhaps, now the time, we have not now the opportunity, the information, to enable us, if we were capable of doing so, to criticise the military conduct of the campaign; but we have quite sufficient information, from the unvarying testimony which reaches us from even quarter, to say so much. We know that in endurance, in the character and rapidity of their marches, in pluck, in\ndash, in steady courage, in military aptitude, those whom we have sent into the field have surpassed even our glowing expectations, and as they are the flower, from a military point of view, of the Canadian people, they are a flower of which, though it be tinged with a bloody hue we may not like, we have a right to be proud. And let us be just to their foes. They, too, wrong, deeply wrong, in what they did, misled, misguided, unhappy men—they, too, fought with skill, with bravery, and with determination. It would be doing less than justice to our own forces to say less than that, because the character of their deeds depends largely upon the determination, and the force, and the skill, and the power of those with whom they had to contend. They fought desperately, and they, too, have bled and died in numbers. This is not all. Besides horrid war, there has been more horrid murder. The savage Indian has donned his war paint and opened up his career of slaughter, of rape and pillage; and age, nor sex, nor sacred office, nor faithful friendship has availed to prevent the outrages which he calls war. Horrors have occurred which make the blood run cold, and which the tongue almost refuses to portray; and against these, too, our people, both those who were called by their avocation to resist and those who stood forward at the moment as volunteers, have done nobly. The casualties in these combats, considering the number engaged, have been very great. The deaths, from wounds in battle or from assassination, seem, by the accounts I have seen in the papers, to be on the side of the loyal forces and the people, 66 or more, and the wounded on the same side number 119; and the deaths on the side of the insurgents, at and near Batouche, are said to be 68 or more, and the wounded to be 191, and other deaths there were on that side earlier. Besides this, it is stated that 105 Indians graves were counted after the attack upon the camp of Poundmaker. We have no information as to the numbers wounded on that side upon that occasion. Assuming that a proportion much less than the usual proportion of deaths to wounds occurred there, it seems the lamentable probability that there have on the whole been about 250 deaths and 400 wounded, representing, so far, this phase of the transactions in the North-West during the last two months. I have said that the casualties on the part of the loyal forces are extraordinary in proportion to the numbers. They exceed those recorded of some great historic combats. Instances will occur to every one, but one case came under my notice within a day or two with which I had not been before familiar; I refer to the great battle of Isly which was fought in Algiers, about forty years ago by\nMarshal Bugeaud, against the forces of the Moors, against the Empire of Morocco. The French troops in that fight, numbered 6,500 foot and 1,500 horse, while the Moors mustered about 50,000 horse and a small body of foot. An obstinate combat took place which lasted several hours. Repeated attacks were made upon the small bodies, sometimes more or less detached, of the French forces. The French forces ultimately obtained a decisive victory, remaining on the enemy's ground with a loss in all of 27 killed and 96 wounded, losses which compare most favorably with those which have occurred on the side of the troops of the people of Canada, who have been fighting the battle of Canada in the North-West. I have said that we rejoice over our soldiers' valor; it is perhaps the one fruit and gain from all this loss and woe. But still while we rejoice, we rejoice, I, at any rate, rejoice with chastened and sober feelings, when I reflect that these are conflicts fought on Canadian soil, that they are conflicts fought between Canadian citizens and subjects, in part with our fellow citizens, in part with our Indian wards, and that the blood shed on both sides is the blood of the commonwealth of Canada. Surely, in the state of circumstances I have depicted, there can be no question more urgent, no question more important than that which I have suggested as the duty of the Government to state and the duty of this House to consider and resolve, how can these things be in Canada? How can these things be in free, self-governing, peaceful, law-abiding Canada? But great as were the perils and toils of the soldier, and deep as is the sympathy of the people which flows out to him, and to those dear to him; yet his fate is in the line he has chosen, in the path allotted and undertaken duty. But the perils and the hardships have not been confined to the soldier; far from it. The perils and the hardships have extended far beyond; they have extended to the peaceful settler who has gone forth with wife and children to make a home in the wilderness, to the pioneer who undertook long and wearisome journeys, who encountered isolation and privation, but who looked for safety and security in every corner of our country. He too and those near to him have suffered; he, too, and those near to him, so far as our information goes, have done well in the great emergencies to which they were exposed. The lives of some have been lost, and, generally, over a wide area, terror, desolation, destruction, privation have prevailed, and of course, over a very much wider area still, anxiety and suspense. Smiling homes have been destroyed, and the labor of years has been swept away in a week, and over a vast district, all the vaster because of the\nvagueness of information in that country, the ominous cloud of an Indian war has spread. Now let me read you from a local paper, the *Battleford Herald* of the 23rd of April, the account which it gives of the condition of things in its immediate locality:\n\n\"One short month ago, the fairest field in Canada was the Saskatchewan country; today it is the most desolate. And brightest and most prosperous in all her settlements was the Battle River Valley, whose sons hailed the opening of spring with joy and thankfulness, rejoicing in the prospects of the coming year, impatient to begin the labors that were to bring them their reward. But in one brief day their hopes were blasted; instead of being the masters of peaceful and happy homes, they were at one blow bereft of everything but manhood; reduced from a condition of plenty to one of absolute penury, houseless, homeless and penniless. Blood stains the soil, and the air is thick with the smoke of desolation. Nearly a score of our citizens have been slain without a moment's warning, by ingrates whose interests they guarded as carefully as they did their own, and whose hands were daily open in charity to the men they looked upon as unfortunate and to be pitied. In the town itself, or that part of it lying south of Battle River, there is only enough left to remind the sufferers of their once comfortable homes, and to recall the fact that many things of peculiar value are irretrievably lost and cannot be replaced. Their loss was that they were whites; the penalty imposed was death. Of all the fair farms that covered the land, but few remain. Some of these lie under the guns of the fort, while others are held by men in alliance with the Indians; for on no other ground can their owners hope for exemption from the universal ruin. With the exception of these, there is not a home that has not been raided, scarcely a house that has not been burned. It has always been the boast of this district that, taking their numbers all through, their horses and cattle were better bred than in any other district on the Saskatchewan; the people were generally well-off, and made improved stock a specialty in their system of farming; but today they are not owners of a hoof. They are afoot and the marauders mounted; their dairies are bare, while their herds are being ruthlessly slaughtered by the thieves. The work of extermination has begun, evidently without a thought for the morrow.\"\n\nNor, while that is the condition of things with reference to the settler in the disturbed districts, or those districts which have been the centres of disturbance in three or four points in the North-West, are we to suppose that those who have risen against their countrymen had not, many of them too, a stake to lose, or sufferings for wife and children, hearth and home, to endure. Let us be just again. Let me read you the correspondence of the *Mail* newspaper of last month in regard to a scouting party after the battle of Fish Creek. The correspondent says:\n\n\"General Middleton, with Lord Melgund, Boulton's cavalry and Captain French's scouts, left at 9 o'clock sharp today, on a reconnoitering expedition down the river. The force was about 80 strong, all mounted. There are two trails down the east bank of the Saskatchewan, one a mile or so distant from the river, which runs through a succession of bluffs and openings; the other nearer the River bank, which, until Gabriel's Crossing is reached, is almost entirely through open plains. We went down the first mentioned trail, returning by the other. The land is of excellent quality, dotted here and there with well built log houses of Metis, near which, in every instance, is land broken...\"\nand almost ready for the seed it will not receive this spring, averaging from two to twenty or thirty of forty acres. These homes, however, were lonely and deserted, and with what haste their occupants fled, the disordered state of the contents only too plainly told. In nearly all, only such household goods as could not be easily carried off were left. One house almost represented all. A stove, table, chairs, in some even these latter were taken, a bedstead, a mattress, but no blankets. In some, those nearer the scene of that fatal Friday's fight, only a few articles were missing. In one place, the table utensils were neatly left in the cupboard. In another, seed wheat half filled the one room, which usually is the sleeping, dining and parlor of the household. A cat, meowing plaintively, had been left behind in another when the family fled in their haste. At several, hens and their broods of chickens were found, some of the houses were locked, others left with their doors wide open, some people tarried to board up the windows, others to crossbar them as a gaol-window is barred. A few had neatly packed in boxes what they could not take with them, but nearly all showed evidence of a very hurried removal. From each house came the trails of the carts or waggons in which the fugitives had been made. All was still, lonely, deserted, but on every hand were to be seen signs of thrift and industry, and even of prosperity. There was an air of comfort and solidity about these places which compared more than favorably with the homes of their compatriots, or even of the average white settler, of Manitoba. Each place was snugly, warmly built; each farm had its byre, each its storehouse, while some had separate, mud-covered, tent-shaped ovens. Two or three had been enlarging the size of their houses, others had not been neglected, as the huge piles of felled-timber and the loaded pickets testified. To sum up their condition, I need only use the involuntary expression of one of the cavalry as we rode along—'What fools these people must be to leave such homes!' Of course, there was no elegant ease, but there was better; a good plain living without extraordinary exertion. We had not gone many miles when a lot of feathers, the contents of a home-made bed, were found; and near at hand the interior of a moss-bag, that useful contrivance in which the rising generation of the North-West spends its earlier days. Both had been torn to pieces to make bandages for those wounded in the Fish Creek affair.\n\nAt noon, we reached Gabriel Dumont's Crossing, although he does not run it now, having sold out to a native Manitoban named Vandal, but it still retains his name. About a mile this side of the place, the scouts reported that five half-breeds had hastily left a house and, mounted on their fleet ponies, galloped away Batoche-ward. By the time the scattered little column was collected, the fleeing Metis were disappearing from view. They apparently had seen our slow approach before we noticed their hasty departure. The vacated house was visited, and we found that we had been ungentlemanly enough to disturb their mid-day meal. A fire was burning briskly in the store, on which the kettle steamed. Some meat, which was at first thought to be horse-flesh, was being cooked; and on the table was a newly baked bannock. Outside the door were discarded strips of old linen clotted with blood, bandages to wrap the wounds of those engaged in the recent fight.\"\n\nThen again:\n\n\"At the crossing there are several buildings, a double one being used as the residence of the 'boss.' The facings of the windows and doors are painted a bright blue, the only attempt at ornamentation we have yet come across. On the left is an open storehouse, and immediately in front on the main entrance is a goodly sized store. In this latter, much to our surprise, is a billiard table, with cues, chalk, pool balls, and all the paraphernalia for rolling the ivories. Dumont's residence was also entered. It was plainly, but for this country nicely furnished. As in nearly all the other domiciles, a sewing machine occupied one corner, and the walls were decorated with cheap colored prints, amongst others vignettes of the Marquis of Lorne and the Princess Louise. In\nanother house nearer the ferry were found some letters addressed to Gabriel Dumont, one being from Judith Rossin, Montana. There was also one from the Dominion Lands Office, Prince Albert, in reference to patents, and another from a Saskatchewan firm threatening to sue Gabriel if he did not at once pay a long overdue account. So this self-sacrificing patriot is no better off than the rest of us, and even in his lonely life on the plains is as much subjected to duns as is the average Winnipegger.\"\n\nThen again:\n\n\"The reconnoissance corroborated the previous impression we had formed that the rebels were overwhelmingly defeated at Fish Creek, and fled in utter demoralisation. All along the route there must have been hurried flitting, and removal of women and children to safer quarters.\n\n\"The warriors took care of their own safety. Whether they have gone to Batoche's or not, cannot, of course, be ascertained, but appearances indicate that they have, and that there they will give us battle if at all. In the meantime, as one passes through this desolate but fertile land, and sees the happy homes deserted, the fields untouched, the byres empty, he cannot escape experiencing a feeling of pain that these misguided Metis have taken the suicidal course that they have; of sorrow that so many circles should be rudely broken up; of regret that such well cultivated farms should lie idle and unproductive; of sympathising pity that these unfortunate men should be plunged into deep misery and poverty for the next year or two.\"\n\nNow, Sir, all over the country, in the regions of the disturbance with the Indians, property has been taken; and if you look at the amount of property taken and destroyed, and count in the year's labor almost lost by those settlers by the want of opportunity to seed, you have a vast amount of present and of potential loss in this regard. Confidence, also, has been shaken. The charm of peace, the habit of submission on the part of the Indian has ended, and our relations to him now from this time forth assumes a new and more difficult phase. While the half-breed rising, as an organised rising is over, the Indian war is not yet over. How long it may last, we cannot state, and it may turn out in the end that hunger, cold, and the want of ammunition may prove our best allies. With us ourselves, as to some parts of the North-West, and still more with those abroad who do not know our magnificent distances, and who cannot realise the fact that there are vast unsettled areas in that country fit for cultivation and so far removed from the scenes of disturbances as to render it utterly impossible that they can be affected—I say with those abroad to whom we may be looking for settlement, and who find it difficult, in view of the smaller ranges of distance by which their vision has been bounded in the past, to realise that fact, our prospects for immigration have been impaired, a blow to immigration has been given which may have effects enduring for a considerable time, and may require us, to some extent, to revise our plans for securing the rapid development of the North-West. The North-West has thus been thrown back.\nback at a time most critical for that country, for the Canadian Pacific Railway, and for Canada at large. Millions of the public treasury have been expended or engaged, and as yet we are not in a position to criticise that expenditure. Millions more, in the nature of increased annual charge, are to be demanded for the North-West, and to repair in part so far as it is reparable, the damage done. And thus at the very moment when we are called on to abandon our golden dreams of early and large returns from Custom duties and from land sales, we find increased charge the order of the day, so that both sides of the national balance sheet will at the same instant be adversely affected. That is not all, Sir. Canada's good name among the nations has suffered. The Government has boasted that we knew best of all how to deal with the settler; that we gave him superior advantages, and gave him great consideration, and had produced in him a feeling of content and satisfaction. The Government has boasted that we knew best of all people how to manage the Indian, and by justice, liberality, firmness, and wisdom, at once to satisfy, improve, tame and develop him. The Government has boasted that we treated the early explorer, the pioneer, the man of mixed blood, wisely, liberally, prudently and paternally; that he had no ground for discontent; that he, too, was happy. The Government has proclaimed that in the great North-West there were no grievances—nothing but peace and prosperity, and what you would see all through that wide extended country, was that \"content basking on the cheek of toil.\" Several Ministers and several high officers of the Government, made their progresses through that country a few months ago. All well! was the cry of those sentinels of Canada in the discharge of their duty there. The Minister of Public Works went up at the desire of his chief, the leader of the Government, to spy out the grievances, if even his microscopic eye could discover that any grievances were there. He called for the grievances, he sought for the grievances, he almost implored the grievances; and he summed up the results of those his arduous labors in a speech in which he said that he had met two men who were discontented, and, if I rightly remember, the ground of discontent which he gave was that there were not enough ladies in the North-West. Some of us thank God that there are no more there now. All well! said the Minister. Now, what is the contrast to those smooth speeches? What is the contrast to those flattering tales? I ask you, Sir, I ask the House, I ask the country; whether the contrast I showed you a moment ago, does not demand an early explanation. The task of the Govern-\nment, Sir, was one of special responsibility, commensurate with the vast power which they had claimed and obtained. It has been well remarked by a publicist of considerable reputation, that while the parliamentary system is the best for those who are represented, it is the worst for those who are not represented. That is a truth which, it cannot be denied, added largely to the responsibility of the Government, because for a country having as its rule representative and parliamentary institutions, to attempt to govern a part of its home domain on paternal and autocratic principles, necessarily added to the charge and the responsibilities of those who undertook that task. And still more care is required when it is the case that free institutions exist all around—in the neighboring Province, in the country which governs, in the neighboring States, in the continent at large—in this continent, which, indeed, seems hardly to tolerate any other form of rule. Still more, Sir, is that responsibility increased when you are attempting so to govern men who, besides finding the air of freedom blowing all around them with the vast sweep and force of the wide continent itself, have been accustomed, in their earlier lives, in the Provinces from which they came themselves, to drink full draughts of that vital air. And if you turn even to the pioneer and to the half-breed, the need for care and the consequent responsibility of the Government is not relaxed, because they, too, had lived under an easy rein, they had the power, if not the form, of freedom, they had order almost without law, and but little sense of governmental interference. They were a little like the hunter of the border Western States who came one day to his cabin and said to his wife: \"Mary, we must move out; we are getting crowded.\" \"Why,\" said she, \"how is that?\" \"Yes, we are getting crowded; I heard the crack of a rifle to-day.\" And such is the intolerance of the crowded haunts of men and of nations, of what are deemed happiness and comfort in what we call civilised society, that those men living as they did on the vast plains had a peculiar freedom which we cannot well appreciate. Still further do we see the need for care in this special case when we remember that, disquieted by the events of 1869-70, and not all recognising the new order of things, many of these men receded before the eastern wave of civilisation and immigration, and departed to the plains to enjoy still the rude freedom to which they had been accustomed. But there was yet another element which added still further to the responsibility of the Administration—the Indian question. The question of the Indian, the aboriginal inhabitant, the untamed savage, resentful of his lost sovereignty, of his\nappropriated lands, of his vanished subsistence, of his shackled liberties, of the constraints imposed upon him, of the dependence to which he is reduced—whose loyalty in the nature of things must be largely due to policy or fear; whose war is murder, whose tender mercies are cruel; the Indian unaccustomed to labor and not yet resigned to starve—to manage him demands care and vigilance, indeed, and adds to the responsibility of those who undertake the task. When to all this you add a policy of settlement widely extended, sparse, isolated, defenseless, bringing the Indian and the settler at once into close contact at many points, of course, the responsibility is still further increased. There is yet another element which added to the responsibilities of Ministers, and it was that the work of government was to be performed from a very great distance. It was to be performed from this point, by letters, by agents, by officers, and by clerks. And they had therefore, knowing what is likely to happen under such circumstances, to take precautions against, and by their own vigilance and energy to overcome, the evils of officialism, of red tape, of carelessness, of procrastination, of favoritism and of fraud, which all are apt to encrust a departmental and routine system. I say, then, that these conditions required, aye imperatively demanded, from the Government a high degree of energy, of vigilance, of tact, of promptness in arriving at decisions and reaching conclusions, and seeing that those were acted upon with respect to the North-West Territories. However, the Government had some advantages, and considerable advantages. They had, as I have said, the dearly bought experience of 1869. They had learned from that something of the feelings of the people, something of the jealousies existing among them, something of their suspicions, something of their customs. They had the advantage of the settlement made in 1870 for the Province of Manitoba and its application to the North-West Territories. They had all the money they chose to ask, and all the officers they chose to name, and they had plenty of time, years upon years of time, before the questions, even after they were raised, assumed the form of extreme urgency. They had also the advantage of utilising the link between the white men and the Indians—the half-breed. I know that in some cases there has been some jealousy between the half-breeds and the Indians, but those most experienced in the relations, the more recent relations of the half-breeds and the Indians in the North-West, have, from their places in this House, not infrequently stated that such is not the rule. I recollect the hon. member for Provencher (Mr. Royal), more than once stating in the strongest manner that there was an\nassistance which was of the utmost consequence, and of which he deeply regretted the Government did not sufficiently avail themselves, namely, the half-breeds in relation to the Government and in relation to the Indians through the Government; and I recollect his being answered by the First Minister assentingly; and of late years the course has been to some extent adopted by the Government of appointing half-breeds to such positions. I say they had that advantage. They had also the advantage of the missionaries with both; and I believe if there was one thing more than another which has helped us to keep the peace with the Indians and the half-breeds for so long a time, it is the good effect of the missions throughout the North-West from very early years. Those were great advantages they had. As I have said, they had time also; for at Prince Albert, the neighborhood of which was the focus of these disturbances, settlement increased at first but slowly. The incoming tide rose but gradually for some years after the transfer, and nothing was done early with the old settlers. However, in 1878, if I remember rightly, a special survey of a portion of the Prince Albert settlement was made. Meantime many of the half-breeds had moved from Manitoba to various points in the North-West Territory, and some to the neighborhood of Prince Albert. Meantime, also, there had been the survey and location of the Canadian Pacific Railway by the Yellow Head Pass, and that had stimulated for a season the immigration to the banks of the Saskatchewan. Many people came in hoping to be along the line of the projected railway, and the tide of immigration rose for a season. All that was changed in later years, and the change, of course, caused disappointment and difficulty. But a large number in the meantime had come in, had come many hundreds of miles in wagons, had come in to be the first, and as they hoped, to live in the most progressive part of the country in consequence of the great fertility of the lands and the great advantage it had in many ways if it was to be considered as a railway centre as well. Difficulties, as I have said, arose during those years. Many questions were raised which one after another, and many of them together, came forward for solution, and those are the questions upon which it seems to me the Government is bound, as I have repeatedly stated this Session, to give to, and the House is bound to insist on receiving the fullest information as to what was represented, what was said, what was done during those years in regard to those questions, so that we may judge how it is, to whom it is due that those unhappy results which I have depicted have at length arisen. There came\nmany questions. The claims of the half-breeds of the territories to scrip for lands, and thus to be placed in the same position as those of Manitoba in regard to the Indian title. The claims of the Manitoba half-breeds, who were omitted from the old enumeration and not provided for out of the 1,400,000 acres granted, of whom many moved to the North-West Territories and have been residing there off and on, some of them altogether and some temporarily since. The half-breed question of surveys on river fronts. I admit that is not exclusively a half-breed question; but it is largely a half-breed question, at all events, in so far as the actual difficulties have arisen, because the first settlement involved, in the view of the Government of that day, a recognition of the same rule as had been applied in the Red River and the non-user of the general rectangular settlement and the special settlement survey along the river front. Then there are the half-breed settlements generally and the surveys of those settlements, and the adjustment of the claims of the half-breeds to the land by virtue of occupation and settlement. And there are the white settlers' claims of the same character. Then there are the claims with reference to colonisation companies. The hon. Minister, when, a while ago, I mentioned the question of colonisation companies, objected to my doing so. He said that showed the spirit in which I was speaking, and he asked what had that to do with the question of the Metis. I am sorry to say that what it showed was not the spirit in which I treated the question, in the sense of the hon. gentleman, but how little the hon. gentleman knew of what the essentials of the question were; because if he had regarded the memorials and representations which had been made on that subject he would have seen—I am not now judging of any of those claims—but he would have seen, as to the colonisation companies, that the claim was made years ago by the people of this very district, that there were grievances and injustice connected with them; and he would have known that, so far from its having nothing to do with the Metis, it was intimately connected, as it is intimately connected, with the difficulties of the half-breeds as well as the white settlers. Then, Sir, there was the question of the great, the enormous block of railway reserves made early at the instance of the Canadian Pacific Railway Company, involving—I cannot remember the exact number of acres—but I think some 16,000,000 or 17,000,000 acres of odd sections in that northern district, which were reserved for them at an early day, in order that they might get a land grant out of it. Then, Sir, there were claims for assistance—for mail accommoda\ntion, claims for local improvements, claims for river improvements. Then there was the Indian question, complicated by the questions I have alluded to, complicated by settlement, complicated by the reservations, complicated by starvation; and as to which there is a memorial sent in November indicating the feeling of the people upon it. Then there were questions of police protection, of the homeguard, and there was also the question of the militia and volunteer corps—all points necessarily engaging the attention of the Government, upon which they have taken action at different times, action which as I have pointed out more than once requires explanation, and in respect of which reports have been received, as we are informed by the departmental reports and otherwise. Then after all that, with reference to all these questions, an event occurred in the month of June last, which in a sense accentuated the whole situation, and added enormously to the responsibility of the Government from that time forth. I allude to the coming of Louis Riel into the settlement, and his remaining there from that time forth. It is not necessary, Sir, for me to use language of my own upon that subject, because we do not forget the statement of the First Minister of the feelings of those people towards Louis Riel, the influence he had over them, and the things he was doing in the North-West during the summer and fall and winter of the year. I will not now trouble the House by repeating what is to be found in the reports of the Debates, by repeating the various pieces of information which I have suggested as certain, as probable, as due; the reports from officers, the orders to the Government officers, the reports from the North-West Council, the petitions and memorials of the people, the declarations and representations of important personages, official and unofficial—I say I will not now weary the House—though I have here a list of those papers, by repeating that list in respect of which I desire to refer to the Debates to the efforts we have made to elicit this information from time to time. But I do say that the statement of facts which I have given indicates in my humble opinion, as a clear and inevitable conclusion, that there is much to explain, much to discuss, much which can be explained and discussed only on the production of the documents and papers which are, or ought to be, in the hands of the Government of the day. There was, Sir, an enormous responsibility upon them, and also upon their officers in that country, and it is due to those officers, as between themselves and the Government of the day, it is due to those important personages in the country, who hold unofficial positions, that we should have their reports\nand statements and communications, which would throw light on the condition of things amongst the people, on their state of feeling, and show the action recommended to the Government from time to time. I say it is due to these persons that we should see what they did say, in order that we may judge whether they did their duty or not. It is due also from the Government to us, in order that we may see whether those demands were made by the Government for information which the notorious facts rendered it their duty to obtain. Now, for these papers I have been pressing almost continuously for the last eight weeks. The hon. gentleman has brought down a few of the less material papers, but the bulk of those papers he has not brought down, and from day to day he has said that they are being copied, that they are being prepared, that they will be ready soon, that he will bring down those which are not confidential, and so forth and so forth. But I cannot compliment him on his having given me or the House a satisfactory answer, with reference to the papers he will bring down and the time when they would be brought down. The Session advances, and it is necessary that those papers should be in our hands in order that we may have the case of the Government, the case of their officers, the case of the people in that country, studied and examined with a view to pronouncing judgment in the great cause which comes before us as the grand inquest of the nation. I have said that the questions to which I have referred demanded care, demanded vigilance, demanded energy, tact, and liberality, from the Government. They demanded promptness too. In these great concerns of state we must not forget the rules which regulate ordinary affairs. Each man's individual concern is dealt with and looked at by him with reference to those rules, and it is proverbial that there should not be delay. He that giveth quickly giveth twice; justice delayed is justice denied; an ounce of prevention is worth a pound of cure; a stitch in time saves nine, are four homely proverbs; they excite the laughter of the hon. gentleman, but they are the language of the people. They express the way the people look at their concerns, and the way in which they expect to be dealt with, whether by the Government or by their own neighbor or friend or opponent. Now, the white settlers as pioneers, and as disappointed pioneers by reason of the change of the route of railway, were entitled to consideration. The half-breeds as early colonisers and as disappointed men, remembering the events of 1870, and remembering also that link of connection to which I have referred, which was so potent for good or evil, the\nlink between them and the Indian—they were also entitled to be dealt with on the principles to which I have referred. And, therefore, while I am not saying—whatever I may think, whatever information I have been able to accumulate from outside, whatever conclusion that information leads me to, while I am not today expressing it, while I am not saying today that the Government has not done its duty, I do say that their duty was such as I have described, and that we have a right to the facts in order that we may judge how they have done their duty. Since the Government took power, 1878, 1879, 1880, 1881, 1882, 1883 and 1884 have passed, and what has been done—that is the question? In the last of these years, as I have said, a very striking event—the invitation to Louis Riel and his appearance,—took place, and what has been done since that time? Surely that sounded a warning note. Surely it became then, even if it had not been before, the most pressing and paramount duty of the Government without delay, if there had been delay, to redress grievances if grievances there were, to remove misconceptions if misconceptions existed, to attend to precautionary measures. Once again, what are the facts? What was said; what was done? What was done in the way of redress, in the way of removing misconceptions, in the way of security? The Government have, as I have said, hosts of officers in that country; what did they say or do from the Lieutenant Governor down? It has a council there, what did it say or do? It has unofficial but important helps, the ministers of religion, the officials of the Hudson Bay Company, all deeply interested in seeing that a sound policy was pursued, and whose lives and property and dearest interests were concerned in the keeping of the peace. What did they say? What did they do? I have said I do not attempt to answer these questions from my own information; I have some information, which, perhaps, I may submit to the House on another day, upon some other motion; but just now I have been trying to show the House, as I hope I have succeeded, that there is a duty on the part of the Government to inform us, and to inform us fully and very soon, so that we may judge between the people and the Government, between the Government and its officers, and decide the momentous questions which these issues involve. I beg, Sir, to move the adjournment of the House.\n\nMr. BLAKE. In reply. Before my motion is put I desire to say just one or two words with reference to the reply made by the First Minister. The hon. gentleman, not for the first, or second, or third time this Session, has addressed to us language which is wholly unparliamentary, and which would\nbeneath the dignity of his position, even if he were the humblest member of this House, and which is still more beneath the dignity of his position as the leader of this House. I have not hitherto either commented upon or retorted upon the hon. gentleman when he has adopted this style of argument; but I think the time has arrived, or nearly arrived, when forbearance ceases to be a virtue; and when an hon. gentleman, in his position, chooses persistently and continuously to address such offensive language to an hon. member opposed to him, it is time that an understanding should be reached as to whether that method of conducting the business of Parliament is to be continued. The hon. gentleman said to-day: What care I whether there are people dead or alive in the North-West; and in several other parts of his address he imputed to me the basest, meanest and most unworthy motives for my course in this House. I shall only say to-night, as to my views of the hon. gentleman's conduct, that I believe the hon. gentleman, intoxicated by vanity and by the adulation of his followers, is forgetful of his own dignity, and of the decencies of debate; and I warn him that he will not be suffered unscathed to pursue an unparliamentary course. With reference to the hon. gentleman's statement as to the reasons why he had delayed to produce a portion of these papers, and the reasons why he was not about to produce another portion of them, I have just one or two observations to make. He says, of the delay in the production of the papers which he says will be brought down, that delay is excused in this matter, the most important which has come before the Parliament this Session, which has perhaps ever come before the Parliament of the country, on the ground that there is a deficiency in the copying powers of the Department. It is not necessary to do more than state that excuse to demonstrate its utter absurdity and flimsiness. Are we to be told by the First Minister, eight weeks after the demand is made, that it is because he cannot find men enough to copy the papers that we have not got them? As to the other class of papers, which he has not brought down and says he will not bring down, because he says they are papers, the production of which may imperil the lives and interests of persons in the North-West, I have two observations to make. The first is this; that no papers which should show that the writers of them believed that the half-breeds had grievances or in which they advised the Government to remedy those grievances—no papers which gave a fair and plain statement of the circumstances of the case—could by any possibility, if published, injure or impair the standing of those people in the community in which\nthey live. It is perfectly clear that those papers could but strengthen them in the confidence of the people among whom they live, instead of impairing it. The second observation is this: that we found precisely the same difficulty in the year 1869-70, and the way in which the Government got over that difficulty on that occasion was not by taking upon itself not to produce these papers, but by bringing them down and striking a select committee, composed of members on both sides of the House, who should decide how much of those papers it would be in the interest of the public and of individuals to publish. At that moment Louis Riel, as I said, was the president of the de facto Government of the country; he was exercising a certain authority there, and we know how it was exercised, and under those circumstances the Government brought the papers down; but, they said, we will appoint a select committee, which shall go over the papers, and shall expunge such as, for the moment, cannot be published without detriment to the interest of individuals there; and there was an expurgation of certain names and an omission of a certain document which might, if produced, have had that result. That is the precedent of the hon. gentleman himself, set by himself, to deal with the very case he now says he is going to meet without bringing down the documents.\n\nIn the third place, and it is the last observation I will make, the hon. gentleman, in order to make out any case at all for this argument of his, which I have proved to be no argument, affirmed that the half-breeds were still in insurrection, and that there was still danger, and that they were still and would be still inciting the Indian population to warfare. That must strike us all with a painful surprise, because we have observed, with feelings of gratification, I am sure, that the General in command had freed a large number of persons who came in, and told them to return to their homes. If it be the case, as the hon. gentleman has stated, that the half-breeds are still organising, I do not think that was a very prudent thing to do; but I do not think it is the case. I adhere to the statement with which I opened my remarks; I believe General Middleton pursued a prudent course; I believe there was no danger, and in that, as in other respects, the hon. gentleman's argument is wholly without foundation.\n\nPrinted by McLean, Roger & Co., Parliamentary Printers, Wellington Street, Ottawa.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30166.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 37, "total-input-tokens": 57970, "total-output-tokens": 21878, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1538, 3], [1538, 4058, 4], [4058, 5919, 5], [5919, 8572, 6], [8572, 11317, 7], [11317, 13968, 8], [13968, 16685, 9], [16685, 20375, 10], [20375, 23301, 11], [23301, 26755, 12], [26755, 30251, 13], [30251, 33513, 14], [33513, 37339, 15], [37339, 40769, 16], [40769, 43765, 17], [43765, 46614, 18], [46614, 49367, 19], [49367, 52056, 20], [52056, 54730, 21], [54730, 57471, 22], [57471, 60215, 23], [60215, 63920, 24], [63920, 68187, 25], [68187, 71356, 26], [71356, 74066, 27], [74066, 76829, 28], [76829, 79609, 29], [79609, 82329, 30], [82329, 85065, 31], [85065, 87817, 32], [87817, 90509, 33], [90509, 93209, 34], [93209, 95951, 35], [95951, 98417, 36], [98417, 98417, 37]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]