[{"id": "c99e637d80d0d845db5a310172dd0a58bbdc6f7f", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e. other than blue or black)/\n  Encre de couleur (i.e. autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [ ] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- Additional comments:/ Commentaires supplémentaires: Les pages froissées peuvent causer de la distorsion.\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     | 24X | 28X | 32X |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier pli et en terminant soit par le dernier page qui comporte une empreinte d'impression ou d'illustration, soit par le second pli, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par le première page qui comporte une empreinte d'impression ou d'illustration et en terminant par le dernière page qui comporte une taille empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrant la méthode.\nREMARQUES\n\npubliées dans le Québec Mercury\n\nNos. 2, 3, 4, 5,\n\n1827,\n\nEN RÉPONSE A UN ARTICLE PUBLIÉ\n\nDANS LA\n\nGAZETTE DE QUÈBEC DE M. NEILSON,\n\nDU 28 DÉCEMBRE, 1826,\n\nINTITULÉ,\n\n\"SESSION PROCHAINE DU PARLEMENT PROVINCIAL DU BAS-CANADA,\"\n\nRELATIVEMENT AUX DIFFICULTÉS EXISTANTES DANS LA LEGISLATURE PROVINCIALE SUR LES MATIÈRES DE FINANCES QUI ONT RAFFORT AU SOUTIEN DU GOUVERNEMENT CIVIL DE LA PROVINCE.\n\nQUÈBEC:\n\nImprimé par T. CARY & Co. Salle des Franc-Maçons.\n\n1827.\n\"SESSION PROCHAINE DU PARLEMENT PROVINCIAL DU BAS-CANADA.\"\n\n\"La question en issue dans ce moment, sous quelque forme que l'esprit humain puisse la présenter, se réduit à celle-ci : peut-on disposer des gens dès à présent payés, ou qui doivent l'être par la suite par les Habitans de cette Province, en vertu des loix passées dans le Parlement de la Mère-Patrie ou dans cette Colonie, sans le consentement des Représentants du peuple, du Conseil Législatif, et de Sa Majesté composant l'autorité Législative de cette Province.\"\n\n(Ancienne) GAZETTE DE QUEBEC, du 28 Décembre, 1826.\n\nIl est très certain que telle n'est pas la question actuellement en débat, ni rien même d'approchant. Ce n'est qu'un de ces exposés spécieux sous lesquels les partisans ardents de la démocratie—de cette démocratie suprême et absolue, trouvent à propos de la déguiser. La question ne porte pas non plus sur telle ou telle administration, ni sur les droits inhérents (comme l'article cité semble le porter) des Sujets Britanniques.\n\nAucuns de leurs droits ne sont intéressés immédiatement, ni menacés dans la question, dans le sens dans lequel cet article voudrait le donner à entendre, ils sont toutes fois grandement concernés dans un sens diamétralement opposé à celui sous lequel la Gazette les envisage. Leurs droits à l'intégrité de la constitution,—leur droit d'être gouvernés par les trois branches de la constitution, et non par une seule—leur droit à ce que les pouvoirs et les privilèges, qui, pour leur avantage, sont confis aux autres branches de la constitution, non moins précieux aux sujets Britanniques que ceux dont la branche représentative est revêtue, soient également respectés et inviolables,—Leur droit de voir que, sous le prétexte d'avancer en leur nom des droits qui ne sont pas compromis, ceux qui les reclament ne deviennent pas eux-mêmes les agresseurs et ne travaillent pas à les dépouiller d'autres également importans au bien-être de la constitution—ce sont ces droits-là qui sont le sujet en discussion et qui méritent notre attention la plus sérieuse.\n\nLa question, ou pour mieux dire, les questions, car le sujet en contient plusieurs, se rapportent dans leurs liaisons immédiates à des droits bien différents de ceux que (l'ancienne) Gazette de Québec semble prendre intérêt à défendre—Les droits du Roi et du Parlement de la Grande-Bretagne ;—la souveraineté du Gouvernement impérial en cette Province ;—le droit que les Sujets de Sa Majesté natifs de cette Province, aussi bien que les anciens Sujets qui y font leur résidence par choix, ont de considérer le Gouvernement et le Parlement de la Grande Bretagne comme un modèle à suivre par la Législature Provinciale, et de reclamer leur protection contre toute tentative de la part d'aucune des branches de la Législature d'enfreindre les droits et les privilèges des autres branches.\n\nLa question n'est pas de savoir si telle ou telle administration sera suppor-\ntée ou opposée, comme populaire ou non ; mais bien si aucune administra-\ntion du Gouvernement Britannique ne sera maintenue et censée ne devoir\nêtre dans cette Province constitutionnellement et légitimement supportée,\nque lorsqu'elle accédera aux termes qu'il plaira à la branche populaire de lui\ndicter annuellement,—dans l'application, tant des argens déjà appropriés par\nacte du Parlement Britannique pour le maintien du Gouvernement Civil,\nque de ceux votés annuellement à la réquisition du Gouvernement pour com-\npletter la somme nécessaire pour le même objet.\n\nLa question est encore de savoir si les termes dictés, et sur lesquels on\ninsiste, sont conformes aux principes du Gouvernement mixte sous lequel\nnous vivons ; si, en s'y soumettant, le Gouvernement n'abandonnerait pas le\ndroit en vertu duquel il exerce la souveraineté, et gouverne la Province d'une\nmanière stable et si son existence ne dépendrait pas de la volonté annuelle et\nprécaire du peuple et de son bon plaisir—s'il ne serait pas par là exposé à être\nsupporté ou rejeté suivant l'humeur du peuple et les idées du jour :—En un\nmot, si, dans un tel cas, tandis que nous nous imaginons jouir des avantages\nd'une constitution mixte de Gouvernement, composée de trois branches,—\nnous ne serions pas de fait une république, gouvernée par une seule branche\nqui se sert des deux autres qui, se soumettent à ses volontés pour mettre en\nforce des maximes républicaines.—En apparence, un Gouvernement mixte—\nen réalité une république.\n\nIl n'est pas douteux que le concours des trois branches ne soit nécessaire\nà l'appropriation de tous les argens prélevés sur les sujets de cette Province\nqui ne sont pas appropriés par des actes, soit du Parlement Britannique ou\nde la Législature Provinciale.\n\n(L'Ancienne) Gazette va cependant un pas plus avant et suivant elle, en\npratique, ce concours des trois branches est nécessaire, tant à l'égard des\nargens déjà appropriés pour le soutien du Gouvernement Civil (et comme\ntels, appartenant exclusivement au Roi pour cet objet) qu'à l'égard des ar-\ngens non appropriés : c'est-à-dire que les argens appropriés, n'importe par\nquelle autorité (Parlement Britannique ou Législature Provinciale) pour le\nsoutien du Gouvernement Civil, ne peuvent cependant pas être appliqués à\ncet objet sans la direction et l'appointement de la Chambre d'Assemblée,\ndont les prétentions, de la manière dont la question est posée, ne sont pas\naussi apparentes que leur réalité le requiert. Si elle n'aspiraient pas plus\nhaut qu'elles paraissent, modestement accouplées avec les droits des deux\nautres branches, elles ne seraient pas de grande importance.\n\nToutefois la question en débats n'est pas si le consentement des trois bran-\nches est nécessaire pour l'appropriation ou le payement des argens prélevés\ndans la Province et à la disposition de la Législature—mais la question qui\nreste encore à débattre sous quelque forme que l'esprit humain puisse la pré-\nsenter, se réduit à ceci :—Les fonds déjà appropriés par l'acte du Parlement\nImpérial pour le soutien du Gouvernement Civil Provincial, seront-ils actuel-\nlement desappropriés par le fait d'une branche (populaire) de la Législature\nProvinciale, et tout le Gouvernement Civil sera-t-il par là bouleversé, pour\nêtre par après réorganisé et rajeuné de telle manière qu'il plaira à cette\nbranche de dicter ? la question porte plutôt sur le rappel d'un acte qui a déjà\npourvu à l'appropriation que sur la façon d'un acte Légitif. Il s'agit plutôt de défaire que de faire un acte Légitif. Puisque les droits inhérents des Sujets Britanniques sont mis en avant comme objet de controverse, voyons si c'est réellement le cas, et prenons bien garde si, ceux-là qui les invoquent, n'en sont pas eux-mêmes les premiers et les plus hardis violateurs. Ces zélés partisans des droits ne sont rien moins que scrupuleux sur les moyens, quelques injustes, quelques atroces qu'ils soient, lorsque leurs intérêts ou leurs passions sont engagés. Suivant eux, tout se justifie par la maxime qu'un petit mal est permis pour un grand bien. Ne perdons pas de vue notre droit indubitable à ce que l'opinion des trois branches de la Législature quant à la façon ou au rappel d'un acte Légitif ou d'une loi, doit être libre de tout contrôle ; et que toute tentative de la part d'aucune de ces branches de forcer sa volonté sur l'autre relativement à la confection d'une nouvelle loi ou au rappel d'une ancienne, est une violation manifeste de nos droits. Qu'une tentative, lorsqu'elle a lieu n'en n'est pas moins odieuse pour être faite sous le prétexte spécieux de maintenir les droits inhérents des Sujets Britanniques, ni plus excusable pour être sous leur nom.\n\nQuoique la question se présente dans l'ancienne Gazette de Québec, sous une forme qui paraît beaucoup embrasser, tout l'article est distinctement dirigé sur la difficulté qui existe dans ce moment au sujet des dépenses requises pour le soutien du Gouvernement civil de la Province, et par conséquent cet article se bornera pareillement au même sujet.\n\nLes argens publics prélevés dans cette Province consistent principalement en droits d'importation sur les articles de commerce, imposés par des Actes du Parlement Impérial et de la Législature Provinciale. Quelques uns de ces argens sont appropriés. D'autres ne l'étant pas, restent à la disposition de la Législature.\n\nLes droits prélevés dans la Province sous un des Actes Britanniques, (14e. Geo. III. chap. 88,) se montent annuellement à environ £25,000 sterling, dont le cinquième passe au Gouvernement du Haut Canada. Ces droits constituent un fonds approprié* par l'Acte, au soutien du Gouvernement\n\n---\n\n* L'Assemblée ne prétend pas mettre en doute l'appropriation, mais elle insiste qu'elle a le droit d'en apprécier et d'en diriger la distribution aux fins de son appropriation ; c'est-à-dire, d'appliquer le fonds dans des items aux différents Officiers en liaison avec l'administration de la Justice et le Gouvernement Civil, qu'ils dirigeront annuellement. Elle ne donne pas ce pendant un compte satisfaisant de la manière dont les Lords Commissaires de la Trésorerie ont été dépouillés de ce droit arrogé, donc, par l'acte, ils sont reçus, pour le transporter à l'Assemblée. On peut consulter l'acte même pour se satisfaire quant au droit d'appliquer le fonds en question, et à cet effet on en donne ici un extrait, comme suit :\n\n\"Que tout l'argent qui sera perçu à raison des dits droits (excepté les dépenses nécessaires à faire pour le lever, le percevoir, le recouvrer, le cautionner, le payer, et en dresser les comptes) sera payé par le Directeur des Douanes de Sa Majesté, entre les mains du Receveur-Général de Sa Majesté, en exercice en la dite Province, et servira, en premier lieu sur une application certaine et proportionnée à subvenir aux dépenses de l'administration de la Justice, et au soutien du Gouvernement Civil dans la dite Province et que le Seigneur Grand Trésorier, ou les Commissaires du Trésor de Sa Majesté, ou tous ou plus en exercice, seront et sont par ces présents autorisés, d'ordonner pour l'avoir, par ordre signé de leur mains, que le argent, provenant des dits impôts, sera appliqué à payer les dites dépenses, et que le résidu des dits impôts restera et sera réservé entre les mains du dit Receveur-Général de Sa Majesté, à la disposition qu'en fera le Parlement à l'avenir.\"\ncivil de la Province de Québec, à présent les Provinces du Haut et Bas-Canada. Il y a en outre une appropriation de cinq mille livres sterling annuellement pour l'administration de la justice de cette Province, par Acte de la Législature Provinciale (35, Geo. III. chap. 9), laquelle somme ajoutée à la portion du produit du premier de ces deux Actes qui appartiennent au Bas-Canada, formant ensemble un peu plus de £25,000 sterling, constituent un fonds permanent pour le soutien permanent du Gouvernement civil de cette Province.\n\nLes droits imposés par l'Acte Britannique, n'ont fait que remplacer des droits préexistants, qui au moment et avant la Conquête étaient prélevés dans la Colonie et appartenient au Roi de France. Par cet événement et d'après le traité, ils sont dévolus au Roi d'Angleterre, mais par l'Acte ci-dessus mentionné, ils ont été discontinués et remplacés par d'autres (tels qu'ils existent actuellement) comme fonds destiné à défrayer l'administration de la justice et au maintien du Gouvernement civil.\n\nOutre ceux-ci, il y a encore beaucoup d'autres argens prélevés dans la Province, tant en vertu d'Actes Britanniques qu'en vertu d'Actes Coloniaux, mais comme ils ne sont pas appropriés, ils restent naturellement à la disposition de la Législature Provinciale. À leur égard, il ne peut donc pas y avoir de doute, que suivant les propres paroles de l'ancienne Gazette de Québec, ou ne peut \"en disposer sans le consentement des Représentants du peuple, du Conseil Législatif et de Sa Majesté, qui forment l'autorité législative établie dans la Province\"; — doctrine qui n'a jamais été niée. Aussi le débat ne porte-t-il pas sur ces argens non appropriés. Les prétentions, comme nous l'avons déjà observé plus haut, s'étendent plus au loin : Elles tendent à déposséder le Gouvernement du fonds approprié, qui quoique, en la possession du Roi longtemps avant la constitution actuelle de la Province, ne doit plus pour le présent être appliqué (si les prétentions sont admises, et ce sont les prétentions de la seule Assemblée) sans le concours des trois branches, quoique cette doctrine ne soit soutenue que par une seule, les deux autres la désavouant. Mais allons plus loin. L'Assemblée, en insistant sur ces prétentions, que les deux autres branches rejettent et opposent, quant au fonds en question, soutient que sans son autorité et son consentement toute application des argens de ce fonds est inconstitutionnelle, donnant à entendre par cette subtilité que le manque de son autorisation et de son consentement à une loi préexistante (émanée d'une autorité supérieure) était suffisant pour suspendre et rappeler cette loi.\n\nCe fonds, consistant en droits substitués à d'autres auxquels le Roi, dans l'opinion du Parlement, avait un droit indubitable, a toujours été appliqué annuellement par le Gouvernement de la Province, pour aussi loin qu'il pouvait aller, à l'objet pour lequel il était approprié, c'est à dire, au payement des frais de l'administration de la justice et des salaires des Officiers Civils. L'Assemblée a reçu régulièrement tous les ans l'état de l'emploi de ce fonds, mais le gouvernement a constamment refusé à ce corps toute espèce de contrôle sur son application, comme n'étant ni son don ni son acte, mais bien, comme en en jouissant indépendamment de la Législature Provinciale.\n\nL'insuffisance de ce fonds et l'offre volontaire de l'Assemblée en 1810, de\nprendre sur elle la charge du Gouvernement civil, engagèrent le Gouvernement en 1818, à accepter l'offre qui lui avait été faite à cet égard. Le déficit qui devait être rempli par la Législature Provinciale, provenant des argens non-appropriés de la Province ne peut être constitutionnellement obtenu que par le concours des trois branches, attendu qu'elles ont le contrôle absolu sur ces fonds, desquels par conséquent, comme dit le texte \"on ne peut disposer sans le consentement des Représentants du peuple, du Conseil Législatif et de Sa Majesté, formant ensemble l'autorité législative de la Province.\"\n\nIci cependant, deux difficultés sont survenues. D'abord l'Assemblée ne veut voter la somme requise pour la Liste Civile que d'année en année, ne voulant point consentir à adopter le principe reconnu et suivi en Angleterre au commencement de chaque règne, de fixer la Liste Civile pour la vie du Roi. En second lieu elle ne veut voter aucun des argens non appropriés à l'appui du fonds approprié, à moins que ce dernier, qui n'est pas leur don, ne soit appliqué de la manière qu'elle jugera à propos d'appointer et ordonner.\n\nA l'égard du subside qui peut être accordé du fonds non approprié, en aide du fonds approprié, pour le soutien du Gouvernement Civil, la doctrine générale que les Communes peuvent limiter, appointer et ordonner leur octroi comme elles jugeront convenable, lui est applicable jusqu'à un certain degré. Si toutes fois les termes et conditions (sous prétexte du droit d'appointer, et d'ordonner) auxquelles le subside est offert ne sont pas telles qu'elles puissent être acceptées par les autres branches, tant pis—Il faut alors que le Gouvernement fasse comme il peut. Si les communes ne veulent pas donner ce qui leur appartient à des termes que les autres branches reconnaissent être constitutionnelles, c'est refuser le leur propre, refus peut-être trop obstiné et au risque de la dissolution du Gouvernement,—mais encore un coup c'est refuser le leur, et rien de plus.\n\nMais ce n'est pas tout. Comme si ce n'était pas assez de ne vouloir se départir du leur qu'à des conditions auxquelles les autres branches ne peuvent consentir, l'Assemblée voudrait enlever au Gouvernement ce fonds qui lui appartient exclusivement, tout insuffisant qu'il soit pour son soutien, et quoi qu'il ne le tienne pas de la largesse de la Législature Provinciale. Dans la poursuite de ce projet on dit que le consentement des trois branches de la Législature Provinciale est indispensable pour l'application du fonds approprié. Mais dans la marche ordinaire de la Législation sur des mesures fiscales, avant que ce consentement des deux autres branches soit demandé, la branche populaire va exercer son droit préalable de diriger, limiter et appointer les divers salaires qui doivent être payés sur ce fonds, et dans l'exercice de ce pouvoir dirigeant, limitant et appointant, l'Assemblée s'est arrogée le droit de réduction ou d'exclusion totale de certains Offices du Gouvernement Civil qui étaient en existence longtemps avant celle de la constitution actuelle. C'est à l'exercice de ce pouvoir sur ce fonds, auquel les autres branches refusent leur consentement. Ce n'est pas parce que les deniers sont appliqués sans le consentement des trois branches,—mais bien parce que ces argens sur lesquels l'Assemblée n'a aucun contrôle, étant déjà appropriés et leur application fixée par un acte du Parlement Impérial, sont\nappliqués sans leur consentement, dont l'appropriation préalable a détruit la nécessité. Les deux autres branches ne veulent pas consentir à la dictée de l'Assemblée pour la désappropriation d'argens appartenant au Roi, sous le prétendu droit de cette dernière, de les appliquer, et c'est ce que l'ancienne Gazette appelle une question sur la disposition des argens sans le consentement de la Législature établie, comme si, disposer de son propre, ou déposséder la Couronne de ses argens, n'étaient pas des questions tout à fait distinctes.\n\nL'Assemblée juge à propos de renier le droit du Gouvernement à l'application de son propre fonds aux objets de son appropriation, et s'approprie ce droit à elle même. Les deux autres branches à leur tour lui refusent ce droit, et sur le refus des deux autres branches de reconnaître le droit que la branche populaire veut s'arroger, l'ancienne Gazette avec une agilité qui lui est toute particulière, se jette tout à coup et se retranche derrière la doctrine à laquelle elle a réduit la question, comme si la doctrine voudrait justifier toute espèce d'excès qui serait tenté sous ses auspices.\n\nC'est parce que les deux autres branches de la Législature refusent leur sanction à cette mesure de l'Assemblée, qui tend dans le fait à déposédier la Couronne de son revenu héréditaire dans la Province, pour s'en saisir elle-même, et l'appliquer suivant sa volonté, diminuant quelques salaires et en en réduisant tout à fait quelques autres, qu'on vient nous dire que la question en débats, est telle qu'on la trouve dans la citation en tête de cet article. C'est parce que les deux autres branches refusent leur sanction au rappel d'une loi par laquelle la Couronne a la disposition entière et exclusive du fonds en question, et à ce que ce fond soit soumis au contrôle absolu de l'Assemblée, que la question en débat est ainsi faussement représentée dans l'ancienne G. de Québec.\n\nQuelques personnes bien intentionnées, et d'ailleurs bien éclairées, égarées par le point de vue sous lequel la question est présentée, qu'elles admettent cependant comme vraie, défendent avec chaleur la doctrine qui y est exposée, comme si on la niait absolument. Elles ne prennent pas garde que la doctrine promulguée et la pratique qu'on s'efforce d'introduire, sont discordantes entre elles et même contraires.—Que, tandis qu'on leur dit avec assurance que la question peut-être réduite simplement à ceci ; \"Les argens payés par les habitans de la Province seront ils employés sans le consentement des Représentants du Peuple, du Conseil Législatif et de Sa Majesté, formans ensemble la Législature établie,\" elle est cependant essentiellement différente, et que, c'est en préchant ceci que l'Assemblée insiste sur d'autres prétentions très extraordinaires et inconstitutionnelles, dont cette proposition raisonnable est le prétexte.\n\nElles ne s'aperçoivent pas que \"les droits inhérents des Sujets Britanniques,\" ne sont que des mots de ralliement pour égarer ceux qui ne sont pas sur leur garde, et que ce ne sont pas ces droits, mais bien les droits de leur Roi, droits également importans à la tranquillité, au bien-être et au bon Gouvernement de ses sujets que les leurs mêmes, qui sont le vrai sujet de la controverse. Elles ne font pas attention que la question n'est pas, comme on le prétend, sur la disposition des argens sans le consentement de la Législa-\nture, mais bien sur la tentative que l'on fait de contraindre les deux autres branches de la Législature à coopérer avec la troisième à déposséder le vrai propriétaire de ce qui lui appartient : — ce n'est pas de donner dont il est question, mais bien d'élire : — ce n'est pas la passation d'une loi du consentement des trois branches de la Législature pour la disposition des argens, mais bien effectivement pour s'emparer d'argens déjà disposés par une loi, et pour abroger cette loi par le seul Acte d'une de ces branches. Tandis qu'on veut nous persuader que le point contesté porte sur le consentement des trois branches à la distribution des argens prélevés sur les habitants, la dispute est en effet sur l'effort d'une des branches, par son seul Acte de déposséder, contre le gré des deux autres, le Gouvernement de ses argens appropriés. Le consentement auquel l'ancienne Gazette fait allusion n'est pas tant ce qui est nécessaire pour faire une loi, que pour enfreindre une loi.\n\nMais au lieu de poser et réduire la question sous la formule de l'ancienne Gazette ; ne serait-il pas aussi bon de la présenter et la réduire sous celle-ci ? Un Acte du Parlement qui donne à Sa Majesté des argens dont le Parlement a incontestablement le contrôle, pour le soutien du Gouvernement civil, serait-il abrogé par aucun autre qui ne serait pas revêtu du consentement du Roi, du Conseil Législatif et des représentants du peuple, formant ensemble la Législature de la Province ? Qui ne sait pas que le consentement des trois branches n'est pas moins nécessaire pour rappeler que pour faire une loi ?\n\nDans la pratique qui découlerait de l'introduction de cette doctrine ainsi réduite, la courtoisie constitutionnelle et d'usage de s'adresser au Roi à l'effet d'obtenir le consentement libre de Sa Majesté, pour la réduction des salaires ou l'abolition des offices qui ne paraîtraient pas nécessaires à la branche populaire serait entièrement mise de côté, et son libre arbitre et jugement à cet égard serait comptés pour rien comme s'il n'avait l'exercice ni de l'un ni de l'autre. Le pouvoir dirigeant et appointant est tout, et il faut que le Souverain cède à ce pouvoir. Son honneur et la foi due à d'anciens serviteurs (dont il pourrait trouver bon d'abolir les offices, sur une adresse dans laquelle on soumettrait à sa considération les motifs de la demande de leur suppression) et les justes prétentions de ces derniers à quelque récompense par voie de pension ou autrement, ne valent pas la peine qu'on y pense plus que s'il n'existait chez lui ni honneur ni bonne foi, ou que s'il existait quelque chose de pareil, ce n'avait aucun droit au respect de la branche populaire. Au lieu de maintenir cette considération, à laquelle, en sa qualité d'une des branches de la constitution et de chef du Gouvernement exécutive, le Roi a droit, et que même pour le bien de ses sujets, il est tenu de soutenir, il faut qu'il renonce à toute idée d'avoir une opinion à lui, tout comme s'il n'avait aucun droit d'en avoir une sur ces matières — qu'il renonce à être un Agent libre, et à n'avoir pas même le Veto dans la législation, du moment que le pouvoir dirigeant et appointant déploie ses bannières et se met en campagne contre lui.\n\nL'Ecrivain dans l'ancienne Gazette, en appelle à la pratique des autres Colonies. Il aurait du être plus explicite à cet égard et nous en avoir donné quelques exemples. Il y a tout lieu de croire qu'il n'existe dans aucune d'elles (à l'égard d'argens appropriés et semblablement situés que l'est le\nfonds en question) aucune pratique de nature à le supporter dans la politique spoliatrice à laquelle il fait allusion et qu'on s'efforce d'introduire sous le système dirigeant et appointant.\n\nLe Haut Canada a sa part du même fonds en question, cependant nous n'avons jamais compris que le pouvoir dirigeant et appointant y ait jamais prévalu à l'égard de son application. La pratique dans cette Province, dans un cas précisément semblable au nôtre, est diamétralement contraire à l'ancienne Gazette : Si ce n'est pas, qu'il vienne en avant avec les preuves. Dans cette Province-là, ou à raison de croire que le fonds de la Couronne, c'est le nom qui lui est donné, qui consiste en partie de ces argens prélevés dans le Bas-Canada, et appropriés par l'acte de la 14e Geo. III, chap. 88, est sujet à tout ordre du Gouvernement de Sa Majesté, et cela même à l'exclusion totale de l'Assemblée. Le revenu casuel et territorial dans cette Province, qui correspond au revenu sous la même désignation dans celle-ci, n'est pas considéré être en aucune manière sous le contrôle de la Législature Provinciale et jusqu'à présent il n'en a encore été rendu aucun compte à ce corps, si ce n'est dans une occasion récente et cela avec permission spéciale, ce qui par conséquent ne peut pas servir de précédent. Le peuple du Haut-Canada est-il moins jaloux de ses droits \"inconstables,\" ou moins disposé à les maintenir et à repousser toute atteinte qu'on voudrait leur porter, que celui du Bas-Canada. Il y a tout lieu de croire que dans la Nouvelle-Ecosse, l'Assemblée admet distinctement que tous les argens prélevés dans la Province par Actes du Parlement antérieurs à la 18e Geo. 3, chap. 12, sont hors de son contrôle et que comme tels, ils ne peuvent pas être appropriés par la Législature. Le cas est naturellement différent à l'égard des argens qui y sont prélevés par des actes du Parlement Britanniques subséquents à cette date.\n\nOn a vu par ce qui précède que la question ne porte pas effectivement sur le concours des trois branches de la Législature à un Acte d'appropriation, pour disposer de deniers prélevés sur le peuple de la Province (ce que personne n'a encore jamais nié,) mais plutôt une question de désappropriation et si on peut déposséder le Roi d'un fond qui lui appartient légitimement. Que ce n'est pas tant un débat sur la manière dont doit être donné au Roi un aide additionnel aux fonds appropriés au soutien du Gouvernement Civil de la Province, que sur les voies les plus efficaces pour s'emparer des fonds insuffisants qu'il possède déjà pour cet objet. Que ce n'est pas tant pour assister la marche constitutionnelle du Gouvernement, que pour le paralysier absolument, afin qu'il puisse être remis en mouvement à la volonté de l'Assemblée, sous le système dirigeant et appointant. Qu'en un mot la matière telle qu'exposée dans l'ancienne Gazette, n'est pas dans le fait la question, mais bien la question déguisée.\n\nL'Assemblée insiste sur son droit d'appointer et de diriger l'application des fonds appropriés et appartenant à sa Majesté pour le maintien du gouvernement Civil de la Province ; mais les deux autres branches de la Législature rejettent formellement cette prétention comme tendant à déposséder le Roi d'un revenu dont-il est en possession indépendamment de la Législature de la Province. C'est cette réjection d'une telle prétention d'une des branches de\ndésapproprier les fonds en question et d'en faire l'application comme il lui plait, qui a donné naissance à la forme sophistique sous laquelle la question est présentée, savoir : \"disposera-t-on des argens prélevés sur les habitans de cette Province sans le consentement de la Législature établie.\" Ce qui dans le fait n'est nullement la question. La question n'en est point une concernant la disposition des fonds par appropriation, mais bien une de spoliation.\n\nIl est à espérer que le lecteur appercevra la différence qu'il y a entre la doctrine représentée comme l'objet de la dispute et le point effectivement en question, telle qu'on a essayé de la mettre en pratique sous cette couleur ; que la doctrine ne justifie nullement la pratique qu'on a en vue, et que lorsque l'ancienne Gazette parle de la pratique des Colonies ce ne peut être la même pratique que celle qu'on voudrait introduire ici sous la prétention du droit et pouvoir dirigeant et appointant de l'Assemblée sur les argens appropriés.\n\nIl était du devoir de la Gazette en faisant cette assertion de nous montrer des exemples d'une pratique dans aucune Colonie telle que celle pour laquelle on se querelle dans cette Province, à l'égard des argens appropriés. Faute de preuve de sa part, son ipse dixit tombe à plat sur ce sujet comme sur quelques autres points.\n\nIl est au contraire probable qu'il ne serait ni long ni difficile de donner des exemples que ces argens prélevés dans les Colonies et appropriés par le Parlement Britannique ont été depuis bien des années (et peut-être depuis plus d'un siècle) et jusqu'à ce jour, appliqués par le Gouvernement Exécutif de la Colonie où ils avaient été prélevés, sans l'intervention de l'Assemblée ou même de la Législature de la Colonie en manière quelconque. Il est possible de trouver un exemple de cette sorte dans la Jamaïque même, sur laquelle les Avocats du système dirigeant et appointant se plaisent à se fonder comme un précédent.\n\nL'Assemblée du Haut-Canada (dont le Gouvernement, comme il a été déjà observé, participe dans le fonds en question) se contente d'exercer son droit de diriger et appointer sur la provision qu'elle fait en aide de ce fonds ; mais elle n'a jamais pensé à s'arroger ni essayé de s'arroger le moindre contrôle sur le fonds même ; soit que le peuple du Haut-Canada n'entende pas ses droits et privilèges dans la constitution aussi bien que celui du Bas-Canada ; ou que le peuple de cette dernière Province, par faveur et par privilège tout particulier, ait le droit d'exercer des pouvoirs constitutionnels plus étendus que celui de la première : c'est aux Casuistes à décider, s'il reste aucun doute à cet égard.\n\nIl est peut-être intéressant de tracer l'origine et les progrès de la doctrine dirigeante et appointante telle que conçue à l'égard de son application aux fonds appropriés : car elle n'est pas, comme Minerve à sa sortie du cerveau de Jupiter, arrivée tout d'un coup à son état de perfection actuelle. D'autres anomalies relatives à la liste civile méritent aussi quelque attention afin de mettre le lecteur en état d'apercevoir de quel côté se trouve le malentendu, si on peut le pallier sous ce nom, existant.\n\nLe Gouverneur Sir John C. Sherbrooke, dans sa harangue, à l'ouverture de\nLa Session de la Législature en 1818, s'exprima de cette manière à ce sujet : \"J'ai reçu l'ordre de S. A. R. le Prince Régent, de demander à la Législature Provinciale de voter les sommes nécessaires pour les dépenses ordinaires annuelles de la Province.\" Il ajouta pareillement qu'en conséquence de ces instructions qu'il avait reçues du Gouvernement de Sa Majesté, il ordonnerait qu'il soit mis devant l'Assemblée un état estimatif des sommes requises pour défrayer les dépenses du Gouvernement Civil de la Province pendant l'année 1818, \"et,\" dit-il en s'adressant énergiquement à l'Assemblée, \"Je désire, au nom de Sa Majesté, que vous ayez à pourvoir d'une manière constitutionnelle aux subsides qui seront nécessaires pour cet objet.\"\n\nPar cette harangue il informait donc la Législature qu'il avait l'ordre de lui demander \"de voter les sommes nécessaires pour la dépense annuelle ordinaire de la Province,\" auxquelles il désirait que l'Assemblée pourvut \"d'une manière constitutionnelle.\" Quel était le sens manifeste de ces derniers mots ? C'était sans contredit de la manière qui par la pratique de la mère patrie, avait été établie comme manière constitutionnelle. Cette manière constitutionnelle par laquelle au commencement de chaque règne (depuis la révolution) la dépense annuelle ordinaire de la liste civile, une fois pour toutes est fixée et limitée pour la vie du Roi. Elle ne doit pas être pourvue annuellement durant le règne du Roi. Mais la dépense annuelle au commencement de chaque règne doit être pourvue, fixée et limitée une fois pour toutes, pour toute la durée du règne. C'est ce que le Gouverneur doit avoir voulu dire être,—la pratique constitutionnelle du Parlement Britannique.\n\nCes paroles du Gouverneur en Chef d'alors ont été par la suite tout différemment interprétées, et misérablement perverties de leur vrai sens et signification, afin d'établir sur cette fausse interprétation la doctrine que l'Assemblée a depuis avancée et sur laquelle elle insiste au sujet de la Liste Civile.\n\nL'Etat estimatif pour 1818, tel que mis devant l'Assemblée pour la guider dans son vote pour le subside en aide du fonds déjà à la disposition du Gouvernement, se montait en tout à £73,646 8 9 courant, pour subvenir auquel le Gouvernement estimait le montant probable de son fonds approprié pour l'année à £33,383 courant, laissant ainsi une balance de £40,263 8 9 courant, à couvrir des fonds non appropriés à la disposition de la Législature.\n\nOn s'est long-temps débattu sur ce sujet, mais la conclusion en a été une adresse \"pour représenter à Son Excellence que la Chambre ayant pris en considération la recommandation de Son Excellence au sujet des dépenses du Gouvernement Civil de cette Province pour l'année 1818, a voté une somme n'excédant pas £40,263 8 9 courant, destinée à défrayer les dépenses du Gouvernement de cette Province pour l'année 1818, en outre de la somme déjà appropriée par la loi ; mais que les circonstances particulières qui ont empêché que la Chambre n'ait plutôt reçu l'état estimatif de la Liste Civile, du revenu et les comptes publics, et l'état avancé de la Session ne lui permettant pas de passer un Bill d'appropriation à cet effet,\n\"elle priait Son Excellence de vouloir bien ordonner que la dite somme\nn'excédant pas £40,263 & 9 courant, soit prise sur les deniers non ap-\npropriés qui se trouvent actuellement ou qui pourront par la suite se trou-\nver entre les mains du Receveur Général de cette Province, aux fins sus-\ndites; et elle assure Son Excellence que cette Chambre en fera bon à la\nSession prochaine du Parlement Provincial.\"\n\nNulle prétention n'est avancée dans cette Adresse. La manière dont la\nListe Civile doit être pourvue, soit annuellement par un vote à cet effet ou \"en\nla manière constitutionnelle\" de voter une fois pour toutes \"les sommes néces-\nsaires pour la dépense annuelle ordinaire de la Province\" tel que l'exprime la\nharangue du Gouverneur, y est en effet indéterminée et ouverte à une consi-\ndération ultérieure : mais on n'y trouve encore aucune expression indicative\nd'aucune intention de la part de la Chambre de devier de la \"manière consti-\ntutionnelle\" telle que pratiquée dans la Mère-Patrie. \"Les circonstances par-\nticulières\" seules ont empêché l'Assemblée de pouvoir dans cette Session là\nà la Liste Civile, (laquelle elle avait en 1810 offert de son propre mouvement\nde prendre à sa charge) \"d'une manière constitutionnelle\". Le droit diri-\ngeant et appointant, ne s'y montre pas encore à l'égard même des deniers\nnon appropriés, et encore moins les prétentions déposessoirs à l'égard du\nfonds approprié, et au droit prétendu de diriger et d'appointer son ap-\nplication. On ne pensait pas encore sérieusement à de telles choses.\nLa demande du Gouvernement se montait à un peu plus que quarante\nmille livres et l'Assemblée lui a accordé la somme exacte demandée, sans au-\ncune autre limite que de ne pas excéder £40,263 & 9 courant, ni sous au-\ncune direction ou aucun appointement autre que cette somme serait employée\n\"à défrayer les dépenses du Gouvernement Civil de cette Province pour l'an-\nnée 1818, en sus des sommes déjà appropriées par la loi.\" Jusqu'à cette\npériode donc les sommes déjà appropriées par la loi, ont été inviolablement\nrespectées.\n\nDans la Session suivante de la Législature (1819) cette somme qui, en\nconséquence de l'Adresse de l'Assemblée, avait été avancée et prise sur les\ndeniers non appropriés entre les mains du Receveur Général, et employée\n\"à défrayer la dépense du Gouvernement Civil de la Province pour\nl'année 1818, en sus des sommes déjà appropriées par la loi pour\ncet objet\" a été sanctionnée par un acte passé à cet effet, (sans le moindre\ndébat dans l'une et l'autre Chambre) dans lequel nulle mention n'est faite,\nni de l'application précise qui avait été faite du montant pris et payé en vertu\nde ce vote, ni de direction ou appointement prescrit à ce subside.\n\nIl est digne encore de remarque, que la somme mentionnée et donnée comme\nsubside en aide du fonds approprié \"devait\" par cet acte, être chargée\nsur les argens non appropriés dans les mains du Receveur Général de\ncette Province qui auront pu être levés, prélevés et perçus sous et en\nvertu d'aucuns actes de la législature de cette province,\"—Telle\navoir été jusque là la circonspection avec laquelle la Législature s'était abs-\ntenue de s'immiscer dans l'emploi des deniers prélevés sous l'autorité d'actes\ndu Parlement Impérial, ou sous toute autre autorité que la sienne.\n\nCependant ce fut dans cette Session (1819) que se sont élevées ces diffi-\ncultés qui ont continué depuis à agiter la Province. L'Assemblée passa un Bill dans lequel étaient spécifiés par items tous les salaires attachés à tous les emplois pour le cours de l'année, sans en omettre le moindre, non plus que les contingents attachés à chaque. Il fut avancé que telle était la manière constitutionnelle de pourvoir à la dépense ordinaire annuelle de la Liste Civile de cette Province, n'importe quelle soit la manière adoptée, soit en Angleterre ou dans aucune autre Colonie Britannique ; mais on insista, néanmoins, que la méthode adoptée était analogue à et d'accord avec la pratique des autres Colonies en pareil cas.\n\nTelle fut l'origine de la doctrine dirigeante et appointante. Mais elle ne fut pas portée dans cette Session jusqu'à la perfection déposessoire à laquelle elle est parvenue depuis. On ne fit pas tout de suite l'essai de diriger et appointer l'application des deniers ; et il ne fut pas mentionné que le subside accordé dut être pris sur les argens non appropriés : on évita avec soin toute distinction entre les argens appropriés et les non appropriés, afin que le contrôle sur les uns et les autres fût voilé sous des termes généreux. En conséquence le Bill passé par l'Assemblée à cette occasion pourvoyait généralement \"que des argens publics qui sont actuellement ou qui viendront entre les mains du Receveur Général de cette Province, les sommes d'argens suivantes seront appropriées et seront respectivement payées, pour défrayer les dépenses du Gouvernement Civil de cette Province, et les salaires des divers Officiers ci-après mentionnés, à dater du 1er de Novembre prochain, 1818, jusqu'au trente-et-un d'Octobre, 1819, inclusivement.\" Le pouvoir retranchant et excluant, fut toutes fois exercé par l'omission de certains offices, lesquels, n'étant pas contenus dans le Bill, étaient en conséquence considérés comme abolis.\n\nSous la dénomination générale et compréhensive d'argens publics, le fonds approprié se trouvait par implication inclus et comme tel (quoique sans termes exprès) devait être limité, dirigé et appointé, dans son application parmi les Officiers spécifiés dans le Bill. Des appropriations que la Législature Provinciale avaient faites ci-devant, étaient traitées moins scrupuleusement, comme étant une matière moins délicate que de s'immiscer hardiment dans les appropriations par acte du Parlement Impérial, et par le pouvoir dirigeant et appointant que l'Assemblée s'était attribué, elles devenaient partie des argens publics dans leur application d'après le Bill. Par exemple les cinq mille livres sterling, appropriées d'une manière permanente par le Statut Provincial de la 35. Geo. III chap. 9, pour défrayer les dépenses pour l'administration de la Justice et le soutien du Gouvernement Civil, étaient incluses d'une manière spécifique, et devaient faire partie des argens appropriés pour l'année sous la dénomination d'argens publics, comme aussi les deniers prélevés pour l'année courante sous les actes de la 45e. Geo. III chap. 12, et de la 57e. Geo. III. chap. 12, et par ces actes d'appropriation pour les dépenses continues de la maison de Trinité et le paiement des salaires des Officiers y appartenans.\n\nLe Conseil Législatif rejeta ce Bill comme étant inconstitutionnel, et dérogeant à l'usage suivi par la Mère-Patrie en pareils cas.\n\nLa Session de 1820 se passa sans transaction d'affaires publiques, l'Assem-\nblée s'étant déclarée incompétente pour agir, par le manque du retour d'un Représentant pour Gaspé.\n\nMais la question qui à cette période agitait principalement la Législature, était, si la dépense civile devait être poursuivie d'une manière permanente ou temporaire ; la matière dirigeante et appointante, n'étant pas encore arrivée à sa maturité, ni le fonds approprié attaqué directement, était comparative-\nment dans le moment actuel un sujet de moindre importance. C'était la grande question dont l'opinion publique s'occupait, et qui était encore indé-\ncise.\n\nEn conséquence à l'ouverture du nouveau Parlement Provincial (lors de l'accession du Roi au trône) en Décembre 1820, le Gouverneur en Chef (Lord Dalhousie) dans sa harangue observa à l'égard de ce sujet.\n\n\" Messieurs de la Chambre d'Assemblée,\n\n\" J'ai donné ordre que les comptes de la dépense générale de l'adminis-\n\" tration du Gouvernement, durant le cours des deux dernières années et\n\" des revenus prélevés, soient mis devant vous en la manière accoutumée.\n\" Je vous soumettrai pareillement les comptes de la dépense encourue,\n\" pour le payement des salaires et des contingens des Officiers civils établis\n\" en permanence pour le service et le soutien du Gouvernement de Sa Majes-\n\" té en cette Province, dans lesquels sont aussi inclus les payemens occasio-\n\" nels qui sont inévitables, (charge £45,000.) J'y ajouterai un état du\n\" produit annuel des taxes permanentes et du revenu territorial héréditaire\n\" de la Couronne, (Revenu £23,000.)\n\n\" De ces documens, formés d'après un terme moyen des six années der-\n\" nières, vous appercevrez que le revenu annuel permanent n'égalé pas le\n\" montant de la charge annuelle permanente sur la Liste Civile Provinciale\n\" à £22,000 près ; et j'ai ordre de Sa Majesté de vous dire, que Sa Majes-\n\" té ayant, d'après l'expérience du passé, la confiance la plus entière dans\n\" votre loyauté, dans votre zèle pour son service et dans votre attachement\n\" aux principes de la constitution, ne doute nullement que vous ne fassiez\n\" une provision convenable et permanente pour suppler à ce déficit, et le\n\" mettre par là en état de supporter le Gouvernement Civil de cette Pro-\n\" vince avec honneur et à l'avantage de ses sujets.\"\n\nEn réponse à ceci, l'Assemblée observa.\n\n\" Nous croirions, toutes fois, manquer à la sincérité due à la franchise\n\" du caractère de Votre Excellence—à ce devoir et à ce respect que nous\n\" devons à notre Souverain, par l'ordre duquel Votre Excellence a soumis\n\" la proposition d'une appropriation additionnelle et permanente, laquelle\n\" jointe à celle déjà faite excéderait la moitié du montant ordinaire de la to-\n\" talité du revenu provincial—si même dès les premiers pas dans cette pro-\n\" cédures, nous ne représentions pas très humblement que l'opinion déclarée\n\" de nos constituans et ce que nous devons à notre postérité et à cette cons-\n\" titution de Gouvernement ; à la sagesse et la bienfaisance de la mère\n\" patrie ont conféré à cette Province, ajoutés à l'incertitude du montant vari-\n\" able de ce revenu, qui, aussi bien que nos ressources, dépendent d'un com-\n\" merce qui dans ce moment est particulièrement précaire, ne nous permet-\n\" tent pas de faire autre chose qu'une appropriation annuelle pour la dépense\n\" générale de la Province, conformément à la recommandation du Gouvernement de Sa Majesté, telle que signifiée au Parlement de cette Province par Son Excellence Sir J. C. Sherbrooke, ci-devant Gouverneur en Chef, dans sa harangue délivrée du Trône à l'ouverture de la Session le 1er Janvier 1818.\"\n\nTel est le germe de cette interprétation palpablement fausse qu'on a donnée à l'appel fait par Sir J. C. Sherbrooke à l'Assemblée de pourvoir à la liste civile, et qui a été hardiment mise en avant, avec un sophisme que rien ne peut surpasser.\n\nSir J. C. Sherbrooke, comme il a déjà été remarqué, a demandé à \"la Législature Provinciale de voter les sommes nécessaires pour la dépense ordinaire annuelle de la Province ; et il a exprimé son désir que \"la Chambre d'Assemblée\" au nom de Sa Majesté \"pourvoie d'une manière constitutionnelle aux subsides nécessaires pour cet objet.\" Ici cependant l'Assemblée le représente comme ayant demandé une appropriation annuelle, pour la dépense générale de la Province, et refuse d'en faire aucune autre, comme si réellement sa demande avait été telle. Mais les propositions sont très distinctes Sir J. S. lui avait demandé de voter la dépense annuelle ordinaire, et pour prévenir toute espèce de doute sur ce qu'il voulait dire, il \"désira\" que cela se fit d'une \"manière constitutionnelle,\" c'est-à-dire, une fois pour toutes de voter et fixer pour le cours du règne de Sa Majesté la dépense annuelle ordinaire de la liste civile suivant la pratique constitutionnelle du Parlement Britannique en pareil cas. Voilà ce que l'Assemblée, après un intervalle de deux ans, vient actuellement (1820) interpréter à faux, prétendant que S. E. n'avait simplement demandé qu'un vote annuel pour la totalité de la dépense du Gouvernement Civil, et c'est pourquoi il est dit dans la même adresse \"nous prions Votre Excellence d'agréer l'humble assurance de la disposition inaltérable de cette Chambre de voter annuellement d'une manière constitutionnelle, suivant cette recommandation et l'offre solennel de l'Assemblée en an 1810, toutes les dépenses nécessaires du Gouvernement Civil de Sa Majesté dans cette Colonie au maintien honorable et permanent duquel personne ne s'intéresse plus profondément et plus sincèrement que les sujets loyaux de Sa Majesté que nous avons l'honneur de représenter, et dont le vœu le plus ardent est de mériter la continuation de cette confiance qu'il a gracieusement plu à Sa Majesté d'exprimer dans notre loyauté et dans notre zèle pour son service.\" Fortes raisons en vérité !! Le profond et sincère intérêt senti pour le soutien honorable et permanent du Gouvernement de Sa Majesté est donné pour motifs de cette manière constitutionnelle de voter annuellement la totalité des dépenses nécessaires du Gouvernement Civil dans cette Colonie !!\n\nL'Histoire d'aucune nation nous trace-t-elle un seul exemple que les dépenses nécessaires à son Gouvernement annuel y soit laissées au hazard d'un vote annuel ? Il n'en est pas une seule ; même sous la forme la plus républicaine. C'est un pouvoir qui porterait avec soi sa propre dissolution, et que nul peuple, nulle Législature ou nul Gouvernement ne voudrait confier ni à lui même ni à aucune de ses parties constitutantes annuellement, comme compromettant sa propre existence. Les États-Unis nous fournissent-ils un exemple de cette sorte de gouvernement ? Non, car ils ont toujours eu une Constitution qui leur a permis de gouverner de manière stable et efficace.\nsorte. ? Tout essentiellement républicain qu'en soit le Gouvernement Civil, sa dépense est sur un pied tel qu'aucune des branches constitutantes de sa constitution ne peut l'ébranler sans la concurrence des autres.—Quelques soient les autres points qui peuvent parfois agiter le corps politique, tous sont d'accord sur ce que les opérations ordinaires du Gouvernement procèdent dans leur marche indépendamment des points en débats et qu'elles ne soient pas laissées au hasard d'être suspendues par des médisances annuelles entre aucunes des branches de la Législature, quelque important qu'en puisse être le sujet. Mais ici une telle doctrine est représentée comme absurde.—Le peuple est tout et tout doit céder au peuple ou à ses représentants, comme si le Gouvernement n'avait d'autres droits dans la Colonie que ceux que le peuple ou ses représentants trouvaient bon de lui accorder. Leur céder, ce n'est, suivant une phrase sans prétention récemment usitée, que \"marcher de concert avec la communauté à la poursuite de sa propre prospérité.\"—Le peuple naturellement ne doit pas devier de son chemin pour procéder d'accord avec le Gouvernement qui n'a dans le fait d'autre existence dans la Province que celle que le peuple veut bien lui laisser !!! On retrouve dans toutes les procédures subséquentes de l'Assemblée les mêmes efforts pour pervertir le sens et pour perpétuer l'illusion volontaire qui en découle, des mots en question, toutes et quantes fois que le sujet a été discuté dans ce corps. Par exemple dans la Session de 1824,\n\n\"Résolu que c'est l'opinion de ce Comité qu'en 1818, le Gouverneur en Chef Sir J. C. Sherbrooke, a exprimé de la part de Son Altesse Royale, de présent notre très Gracieux Souverain, au nom du Roi, le désir que l'Assemblée de cette Province pourvoye aux dépenses civiles du Gouvernement et qu'elle vote à cet effet les appropriations nécessaires pour la dite année 1818.\"\n\nOr, Sir J. Sherbrooke n'a pas \"au nom du Roi\" désiré l'Assemblée \"de pourvoir aux dépenses civiles du Gouvernement et de voter à cet effet les appropriations nécessaires pour la dite année.\"—C'est ce qu'il n'a pas fait. Mais il a demandé, en ce nom, à la Législature Provinciale comme il a déjà été observé, de \"voter les sommes nécessaires pour la dépense annuelle ordinaire de la Province.\" Il dit qu'il ferait mettre devant la Chambre l'état estimatif pour 1818, et immédiatement après, au nom de Sa Majesté, il demande que la Chambre pourvoye d'une manière constitutionnelle aux subsides nécessaires pour cet objet. C'est ainsi qu'en supprimant et donnant une fausse interprétation, on mutile et présente à toute la Province un langage et des documents officiels qui n'exposent qu'une moitié de la vérité et cachent l'autre, tandis qu'il est important que le public en ait pleine et entière connaissance sous tous ses rapports; et c'est ainsi qu'on aveugle le peuple et qu'on l'induit en erreur.\n\nIl n'est cependant que trop vrai que ce n'est que sur des exposés exparte du sujet ainsi qualifié et déguisé, qu'on en appelle au jugement du peuple, toujours juste dans sa manière de sentir, mais susceptible d'être souvent mal guidé par de faux signaux. Et c'est sur des jugements prononcés d'après de tels exposés de la cause, que l'ancienne Gazette de Québec s'écrie dans la joie de son cœur, \"La masse entière du peuple a, dans trois élections générales,\"\n\"confirmé solemnellement les décisions de ses Représentants.\" Le peuple n'a jamais prononcé une opinion sur ce sujet, car il ne lui a jamais été soumis de bonne foi et avec impartialité, de manière à le faire comprendre ; et considérant le défaut général d'éducation qui prévaut dans les Paroisses de Campagne, ce ne sera qu'avec le temps qu'on en pourra mettre les habitants en possession de la véritable question. En attendant leur opinion, si on peut appeler cela une opinion, sera arçaparée et gouvernée par ceux sur lesquels, vu leur propre incapacité de juger par eux mêmes sainement de l'objet en question, ils doivent de toute nécessité se réposer. Ils seront susceptibles d'être poussés ça et là, suivant les suggestions de ceux qui possèdent leur confiance et cette confiance sera sujette à être abusée jusqu'à ce que la masse du peuple soit devenue assez éclairée pour penser et raisonner par elle même sur des matières de cette nature. Faites circuler dans les Campagnes le bruit que le Gouvernement est dans l'intention d'imposer des taxes, de prélever des argens sur les habitans et d'employer les deniers mal à propos et d'une manière inconstitutionnelle, et que leurs Représentants ne se débattent que pour prévenir ce grand mal et vous exciterez naturellement un sentiment qui se révolte contre une semblable injustice ; car quoique les habitans ne soient pas suffisamment instruits en fait de matières publiques pour pouvoir découvrir le mensonge, ils connaissent et sentent parfaitement la valeur de l'argent. Mais, d'un autre côté demandez leur s'ils sont disposés à devenir volontairement les instruments mis en œuvre pour déposérer leur Roi de ses droits ;—mettez-les en état de comprendre clairement que tel est le point en débat.—que ce ne sont point leurs propres droits qui sont en question, mais bien la violation des droits du Roi.—que ce n'est pas pour résister à une injustice, mais pour en commettre une que l'on en appelle à lui,—et soyez certain que l'habitant Canadien, dans l'honnêteté de son cœur, n'hésitera plus un moment sur ce sujet.\n\nMais revenons au progrès des prétentions dérigeantes et appointantes. Le Bill passé dans la Session de 1820—1, par l'Assemblée, quoiqu'en fait de forme il fut différent de celui de 1819, était déjà tant soit peu plus distinct et se rapprochait davantage de l'objet en vue. Les items spécifiques avaient été omis, et les offices étaient classés par chapitres ou têtes, suivant, ou à peu près, l'état estimatif qui avait été envoyé d'en haut et une somme ronde était assignée à chaque chapitre, toutes fois, omettant les salaires qui appartaient à ces offices qui devaient être exclus de la liste civile. Ceci n'était pas très satisfaisant pour quelques uns, qui auraient voulu aller plus ouvertement en besogne, de manière que l'intention pleine et entière de l'Assemblée parut à la face du Bill, afin de ne plus laisser aucun doute sur leur intention d'exclure celui-ci, celui-là et cet autre office pour lequel on était déterminé à ne pas pourvoir, comme charge publique inutile.\n\nCeci fit naître une autre doctrine toute neuve et qui s'éleva tout à coup à cette occasion. On prétendit que l'intention dans les votes d'argens, soit qu'elle soit ou non explicitement énoncée dans le Bill d'appropriation, constitué par soi même une loi obligatoire pour l'Exécution qui, en parlant le langage de la constitution, était tenue de consulter les journaux de la Chambre, afin qu'il puisse s'assurer de l'esprit et des motifs de ce corps, pour lui servir de guide dans l'application des deniers suivant les items couchés dans les\nLe peuple avait été soumis à entendre; et les paroisses de ces habitants, si on peut dire, sur lesquels, pour l'objet en question, susceptibles de répandre leur influence sur la masse des citoyens, elle même ne pouvait pas le bruit de cette prélevée sur une somme et d'une nature telle que pour le peuple qui se réunissait ne pouvait pas être couvert le lendemain. Mais, pour éviter seulement les débats, ne permettez les débats que ce ne serait pas une violation de la liberté de parole pour en faire un sujet tant Canadien que de ce sujet, de cette province. Le peuple a fait de cette distinction entre ceux qui avaient été prélevés, ou à qui une ronde de dette appartenait, ou qui n'était pas encore pleinement payé, une parution de son d'exécution, et situé à ne pas être.\n\nUn coup à la tête nous, soit pour le peuple, soit pour le langage de la Chambre, qui lui serait dans les journaux, comme étant les seuls pour lesquels la Chambre, dans l'exercice de ses prérogatives dirigeantes et appointantes, avait eu l'intention de pouvoir. Que les argens appointés pour paiement ne pouvaient être payés que pour et à compte des salaires de ces offices mentionnés dans les journaux, et que ceux qui n'y étaient pas mentionnés, ne devaient pas par conséquent être payés des deniers appropriés. Il y en avait bien quelques uns qui avaient quelques doutes sur l'orthodoxie de cette doctrine; mais n'importe; elle était assez plausible; il se pouvait qu'elle ne fut pas strictement d'accord avec la loi du pays; mais par implication c'était une loi entre le donnant et le recevant, les deux parties les plus immédiatement concernées. C'était constitutionnel—et en tous cas si ça ne l'était pas, il était temps de le rendre tel, et pour cet effet, il suffisait d'insister sur ce qu'il le fut, ainsi que sur d'autres points en liaison avec la matière également consonnans avec cette doctrine.\n\nLa totalité de la somme votée pour l'année se montait à £44,080 10s 2d sterling; et dès lors pour la première fois, les prérogatives dirigeantes et appointantes furent mises en avant et portées en plein contre les fonds appropriés pour le maintien du Gouvernement Civil de la Province. L'opinion du peuple ne s'était pas jusqu'à là assez clairement prononcée, quant à la constitutionnalité d'un essai aussi hardi que décisif de déposséder, par Bill, le Gouvernement des argens appropriés; et à cet effet les clauses suivantes furent insérées comme faisant partie du Bill.\n\n\"Que, des argens prélevés, levés et perçus dans cette Province, qui sont actuellement ou qui pourront ci-après être entre les mains du Receveur Général de cette Province pour le temps d'alors, les sommes suivantes seront par un ou plusieurs warrants, &c., appropriées et payées pour détruire les dépenses du Gouvernement Civil de cette Province du 1er Novembre dernier (1820) jusqu'au 31e Octobre prochain (1821) les deux jours inclus.\"\n\nNous voyons ici que \"les argens prélevés, levés et perçus dans la Province,\" sans distinction aucune, sont tous inclus. Le mot appropriées pourrait toutes fois avoir laissé quelque doute si, après tout, on n'avait entendu rien autre que les argens non appropriés; mais, pour prévenir toute équivoque à cet égard, la clause suivante fut introduite, comme proviso explicatoire:\n\n\"Pouvoir toujours, et qu'il soit de plus statué par l'autorité suscitée, que les argens ci-avant appropriés par la loi pour le soutien du Gouvernement Civil de la Province, qui sont actuellement ou qui pourront par la suite venir entre les mains du Receveur Général de cette Province, seront appliqués en partie du paiement pour les fins de cet Acte, et le reste sera rempli et pris sur aucun des argens non-appropriés qui sont actuellement ou qui pourront par la suite venir entre les mains du Receveur Général de la Province pour le temps d'alors: pourvu toujours que tels de ces argens qui resteront non dépensés entre les mains du Receveur Général de la Province seront et demeureront à la disposition future de la Législature.\"\n\nLe Conseil Législatif rejeta ce Bill comme inconstitutionnel, comme il avait fait celui de 1819.\n\nLe Gouverneur en Chef à l'ouverture de la Session suivante (Décembre\n1821) exprima plus amplement que jamais le sens de Sa Majesté à l'égard de la manière en laquelle la liste civile devait être pourvue.\n\n\"J'ai ordonné dit-il, que l'état estimatif pour l'année prochaine vous soit pareillement soumis sans délai, et il m'est de nouveau enjoint de la part de Sa Majesté de vous informer que Sa Majesté, toujours pleine de confiance dans votre loyauté et votre affection pour sa personne et son Gouvernement, est fermement persuadée de votre disposition à pourvoir aux dépenses nécessaires du Gouvernement Civil aussi bien qu'à celles également nécessaires pour maintenir l'honneur de sa Couronne. Il m'est pareillement enjoint par Sa Majesté de recommander que telle provision qui paraîtra nécessaire pour ces objets soit accordée pour la durée de la vie de Sa Majesté.\"\n\n\"Il a été établi dans le Parlement Britannique comme principe de la constitution, que la liste civile serait accordée durant le cours de la vie du Roi, et il m'est ordonné d'insister fortement dans cette occasion sur la recommandation de Sa Majesté, que tel principe de la constitution soit adopté et observé à l'avenir comme pratique dans cette Province.\"\n\nIl n'est pas possible au langage d'énoncer plus clairement les principes et les vues du Roi à ce sujet. L'Assemblée pouvait à peine s'attendre à une expression aussi distincte, et, dans son Adresse en réponse à la harangue, ne dit pas un mot de l'appropriation annuelle d'aucuns argens publics pour cet objet. Elle se contenta d'assurer que Sa Majesté pouvait toujours placer la confiance la plus entière dans la disposition invariable de la Chambre de pourvoir aux dépenses nécessaires de son Gouvernement Civil ainsi qu'à celles nécessaires à l'honneur de sa Couronne.\" Elle ajoutait encore ce qui suit.\n\n\"Nous recevons avec due humilité la communication de la présente recommandation de Sa Majesté, que telle provision qui paraîtra nécessaire pour ces objets soit accordée d'une manière permanente pour la vie du Roi ainsi que l'information qu'il a été établi dans le Parlement Impérial que la liste civile doit être accordée pour la vie du Roi et la recommandation sur laquelle il a été enjoint à Votre Excellence d'insister fortement sur l'adoption et observation dans cette Province de tel principe de la Constitution Britannique. Nous sommes pleinement reconnaissants de la confiance avec laquelle il plait à Votre Excellence de se reposer sur notre loyauté et notre attachement bien connus aux principes de la Constitution Britannique, et nous assurons très respectueusement Votre Excellence que dans la décharge conscientieuse de notre devoir envers nos constituens sous l'Acte du Parlement Britannique en vertu duquel nous sommes constitués et assemblés, les recommandations de Votre Excellence auront toujours le poids qui leur est du avec nous.\" Ce fut ainsi que les Communes s'exprimèrent. Quant à ce qu'elles ont voulu dire il faut le recueillir de leurs Actes subséquents. Il est cependant digne de remarque que dans cette occasion elles ont gardé un profond silence sur le sens dans lequel l'appel fait par Sir John Sherbrooke à la Législature pour la \"dépense annuelle ordinaire de la Province,\" avait été perverti en un appel pour voter annuellement toutes les dépenses nécessaires du Gouvernement Civil de la Province.\n\nIl ne fut rien voté cette année pour la liste civile. L'Assemblée se contenta\nd'une Adresse au Roi à ce sujet dans laquelle elle offrait ses raisons contre l'adoption du principe du Parlement Britannique par la Législature Provinciale. La Chambre passa une série de résolutions explanatoryes de ses vues de non parité entre les matières dans cette Province et celles de la mère patrie, à l'égard de la liste civile qui, dans l'opinion de l'Assemblée, prévient la nécessité de pourvoir à la liste civile pour la vie du Roi.\n\nIl ne convenait pas cependant d'abandonner cette chimère de sa propre création, que l'intention des Gouverneurs (Sir John Sherbrooke et le Duc de Richmond) en 1818 et 1819, dans leur appel à la Province pour la dépense civile, n'avait été que de demander à l'Assemblée de la voter et approprier annuellement et non autrement. Cette notion fut en conséquence rafraîchie par une nouvelle résolution et celle-ci avec la série des résolutions de non parité avec lesquelles elle fut accouplée, furent corroborées par celle aussi argumentative que conclusive que \"la Chambre ne peut et ne doit pourvoir aux dépenses du Gouvernement Civil de Sa Majesté que annuellement et non autrement.\"\n\nVoici les résolutions auxquelles on vient de faire allusion telles qu'elles sont consignées dans les Journaux de l'Assemblée.\n\n\"Re'solu, Que c'est l'opinion de ce Comité que dans la situation dans laquelle cette Province se trouve, la Chambre ne peut et ne doit pourvoir aux dépenses du Gouvernement Civil de Sa Majesté que d'une année à l'autre et pas autrement.\"\n\n\"Re'solu, Que c'est l'opinion de ce Comité que, en conformité à l'offre de l'Assemblée de cette Province faite en l'année 1810, et acceptée par Sa Majesté en 1818, et aux termes des harangues des Gouverneurs de cette Province à l'ouverture des Sessions de la Législature Provinciale à années 1818 et 1819, les sommes nécessaires pour le soutien du Gouvernement Civil de Sa Majesté en cette Province doivent être votées et appropriées annuellement et non autrement.\"\n\nComme il ne fut fait aucune appropriation par l'Assemblée dans cette Session (1821.2) principalement pour les raisons alléguées, le pouvoir dirigeant et appropriant ne fut pas pour le moment déployé, et comme c'est principalement sur ses progrès que l'attention du lecteur est dirigée nous allons en conséquence y retourner.\n\nMais quoique cette assumption ne fut pas en action positive pendant la Session, son influence qu'elle avait eue par le passé ne fut pas pour cela oubliée. La réjection mentionnée des Bills d'appropriation, avait mis le Gouvernement Exécutive dans la nécessité de prendre de la caisse et sur sa propre responsabilité les sommes nécessaires pour faire marcher les affaires publiques. Par rapport à ceci il fut résolu par l'Assemblée.—\"Que cette Chambre tiendra personnellement responsable le Receveur Général de Sa Majesté de cette Province et toutes autres personne ou personnes de tous les argens prélevés sur les sujets de Sa Majesté dans cette Province qui peuvent être légitimement venus dans ses ou leurs mains, et payés par lui ou eux sous aucune autorité quelconque à moins que tels payemens ne soient ou n'aient été autorisés par une provision expresse de la loi.\"\n\nCette résolution embrassait sans distinction \"tous argens prélevés sur les\n\"sojets de Sa Majesté dans cette Province,\" sans faire aucune différence entre les appropriés et les non-appropriés et par conséquent la menace de \"te- nir personnellement responsable le Receveur Général de Sa Majesté et toutes et chacune personnes concernées,\" était bien significative pour ne pas dire plus. Il est pourtant vrai que les derniers mots \"à moins que tels paiements ne soient ou n'auraient été autorisés par une provision expresse de la loi,\" constituent une espèce de défaite, mais toujours cette provision expresse de la loi doit être et était entendue suivant elle, devoir signifier un Acte de la Législature Provinciale, vu que sans cela, c'est à dire sans le consentement et l'autorité, (comme plus distinctement énoncé dans les progrès et la promulgation de la doctrine à une époque subéquente), des Représentants du peuple, nuls argens prélevés dans cette Province ne peuvent être appliqués même pour les objets pour lesquels ils auraient été préalablement appropriés.\n\nEn excuse de n'avoir pas même voté le subside annuel pour l'année (1822) l'Assemblée fit une Adresse au Gouverneur portant en substance que les procédés du Conseil Législatif (qui avait dans la Session précédente adopté certains ordres permanents par lesquels il était déterminé qu'il ne discuterait aucun Bill de l'Assemblée pour la provision de la liste civile à moins que cette provision ne fût pour la vie du Roi) avaient violé ses droits, elle ne pouvait plus voter l'aide nécessaire. Elle concluait par \"assurer Son Excellence qu'ausitôt que cette Chambre sera réintégrée dans la pleine jouissance de ses droits et privilèges et que Son Excellence aura communiqué à cette Chambre l'acceptation gracieuse de Sa Majesté de l'offre renouvelée de cette Chambre de voter annuellement les dépenses du Gouvernement Civil dans cette Province elle ne manquera pas de décharger fidèlement ses engagements.\"\n\nLa détermination de l'Assemblée d'approprier annuellement et non autrement pour le soutien du Gouvernement Civil, et ses prétentions sur l'application du fonds approprié, dans la vue d'en déposséder le Gouvernement, et ainsi, sous le pouvoir dirigeant et appointant, de retrancher et exclure selon son bon plaisir les offices publics, sans consulter le Roi, ont probablement induit l'Exécution à introduire la distinction entre les établissements permanents et ceux locaux.\n\nAyant dans le revenu approprié ci-dessus mentionné un fonds permanent, quoiqu'insuffisant, pour subvenir aux dépenses de l'Administration de la Justice et pour le maintien du Gouvernement Civil, il devenait, sous les circonstances du moment, nécessaire de déterminer quels étaient les établissements permanents appartenant à l'Administration de la Justice et au Gouvernement Civil, qui devaient proprement être à la charge du dit fonds autant qu'il pourrait aller ; comme aussi ceux, qui n'étant pas compris dans son objet, formaient une classe moins essentielle aux opérations principales du Gouvernement et devaient par conséquent être pourvus par la Législature locale. Delà la dénomination d'établissements permanents et locaux.\n\nLa distinction des classes qui est née de la distinction des fonds n'aurait probablement jamais eu lieu, si l'Assemblée par sa négligence à l'égard de ces derniers et en se tenant d'accaparer et diriger l'application du tout sans distinction, n'eut pas forcé le Gouvernement d'adopter la mesure.\n\nCette distinction fut observée dans l'état estimatif soumis à l'Assemblée\ndans la Session de 1823. Les offices à la charge du fonds approprié et permanent se montaient à £32,083 11s 3d à la décharge de laquelle somme Son Excellence informait la Chambre que le fond serait presque, sinon tout à fait, suffisant. La somme requise pour les établissements locaux se montait à £30, 225 19s 5d sterling et c'était à cette somme que se bornait la provision demandée par Son Excellence à la Législature, ayant déjà à sa disposition des moyens suffisants pour couvrir la première.\n\nLa crise dans laquelle la constitution existante de la Province se trouvait alors, par l'intention des Ministres de réunir les Législatures des deux Canadas et que pour l'opposer il avait été dépêché deux des Membres les plus accrédités de l'Assemblée, (qui étaient alors encore en Angleterre) chargés de requêtes, peut avoir eu probablement quelque poids sur ce corps. La somme requise fut votée, au moins à peu de chose près, pour les établissements locaux. Mais en procédant au vote des deniers, l'Assemblée par une suite de résolutions placées en tête de leur vote d'argent, annonça plus distinctement que jamais ses prétentions sur tous les argens prélevés dans la Province. Ceci peut être qualifié de l'époque de leur maturité. Voici les résolutions dont il est ici question.\n\n\"Re'solu, Que c'est l'opinion de ce Comité que nulle loi imposant des droits ou taxes sur les sujets de Sa Majesté dans cette Province, pourvoyant d'une manière générale des fonds pour défrayer les dépenses du Gouvernement Civil de Sa Majesté et celles de l'Administration de la Justice ou de la Législature dans cette Province, ne peut être considérée comme conférant à qui que ce soit le pouvoir ou le droit d'appliquer les argens qui en proviennent ou de faire aucune appropriation ou distribution sans le consentement et l'autorité de la Législature.\"\n\n\"Re'solu, Que c'est l'opinion de ce Comité que cette Chambre ayant très humblement fait l'offre à feu Sa Majesté le Roi George Trois de glorieuse mémoire, de pourvoir aux dépenses du Gouvernement Civil de Sa Majesté d'accepter l'offre de cette Chambre, et que sa volonté Royale à cet égard a été signifiée à cette Chambre par Son Excellence Sir John Coape Sherbrooke, Gouverneur en Chef de cette Province, dans la harangue à l'ouverture de la Législature Provinciale le 7e Janvier 1818, et que toute appropriation des argens publics ou d'aucune portion d'iceux au payement soit des dépenses du Gouvernement Civil ou de l'Administration de la Justice, soit de toute autre charge publique de cette Province, sans la participation et le consentement de cette Chambre est une violation manifeste des droits et privilèges de cette Chambre.\"\n\n\"Re'solu, Que c'est l'opinion de ce Comité, que cette Chambre a tous jours été et est encore disposée de remplir fidèlement ses engagements envers Sa Majesté en accordant annuellement à Sa Majesté tout le subside nécessaire pour défrayer toute la dépense du Gouvernement Civil, de l'Administration de la Justice et des autres objets de charge publique dans cette Province, quand et aussi souvent que cette Chambre en sera requise par le Representant de Sa Majesté dans cette Province.\"\n\nBeau moyen en vérité de \"remplir fidèlement ses engagements envers Sa Majesté.\"\nMalgré que la Chambre eut consigné dans ses journaux ces prétentions si pompeuses, elle ne se souciait pas de s'exposer au danger de voir son Bill rejeté par le Conseil Législatif, en y introduisant ; et d'un autre côté elle ne voulut pas envoyer de la Chambre au Conseil un Bill qui semblerait se départir de ces prétentions. La clause d'appropriation fut en conséquence couchée en ces termes.\n\n\"Et qu'il soit statué que les argens ci-après mentionnés et appropriés seront pris du et chargés sur le fonds général * de la Province, provenant d'aucuns Acte ou Actes en force en icelle et d'aucuns des revenus de Sa Majesté applicables aux objets ci-dessus mentionnés.\"\n\nOn s'imagina dans l'Assemblée que les termes de FONDS GENERAL de la PROVINCE étaient assez complètement explicites pour inclure leurs prétentions sur le revenu approprié. Le Conseil Législatif les considéra comme ne comprenant que ces argens seulement, qui étaient non-appropriés, et comme tels à la disposition de la Législature, et nul autre. Le Conseil Législatif passa donc le Bill qui ensuite reçut la sanction Royale.\n\nLe Bill pourvoyait pour les établissements locaux par items. L'appropriation n'étant que pour l'année seulement, mais comme (quelqu'en ait pu être l'intention) il n'affectait pas légalement le fonds permanent pour le soutien du Gouvernement ni aucun autre que les argens non-appropriés dont la direction et l'appointement était le droit incontestable de l'Assemblée, et il passa.\n\nAinsi donc jusque là l'Assemblée s'était efforcée d'emporter d'emblée son point de diriger et appointer l'application du fonds permanent et approprié au soutien du Gouvernement Civil, en le soutenant comme son droit, mais sans accuser l'Exécutif de prétentions illégales par sa résistance à sa volonté à ce sujet. Le Bill reconnaissait virtuellement l'appropriation du fonds permanent, ainsi que le droit de l'Exécutif d'en faire l'application.\n\nMais dans la Sess'ion de 1824, les choses furent poussées bien plus loin que jamais. Dans l'état estimatif envoyé à l'Assemblée, la même distinction entre les établissements permanens et locaux avait été observée comme dans la Session précédente. La Chambre s'était contentée de voter les sommes demandées et pas plus, déclarant par une résolution \"que n'étant pas requise par Sa Majesté ni par son Représentant dans cette Province de pourvoir à la dépense totale du Gouvernement Civil, de l'Administration de la Justice et des autres charges publiques pour la présente année, mais seulement à une partie de ces dépenses, s'abstient par cette seule raison de pourvoir à la totalité de cette dépense, et qu'autrement elle y aurait volontiers pourvue.\"\n\nDans cette Session, cependant, quoiqu'on ne lui demandât pas plus que ce qu'on avait fait dans la précédente, elle voulut, qu'on le lui demande ou non, que ce soit bien ou mal, voter la totalité de la liste civile d'un bout à l'autre, déclarant par une résolution \"qu'elle ne doit pas accéder à la demande à elle actuellement faite de ne pourvoir qu'à quelques-unes de ces dépenses tant que le Gouvernement Colonial persistera dans la prétention illégale de disposer d'une manière permanente sans la concurrence de la Législature, d'une portion considérable annuellement variable du revenu public.\" En conséquence toute la liste fut passée en revue d'un bout à l'autre, réduisant les\n\n* Voyez Note (A) à la fin.\nLe lecteur a vu ce qui s'entendait par cette concurrence de la Législature, dans son application au fonds approprié, — savoir : le prononcé absolu de l'Assemblée. Cette prétention illégale, dans laquelle on persistait, [n'était autre que la résistance à l'assomption dépossessive en vertu d'un droit que l'Assemblée s'était arrogé de diriger et d'appointer.]\n\nLe Bill à ce sujet envoyé au Conseil Législatif fut rejeté comme les autres dont il a été ci-devant parlé.\n\nTel était l'état des prétentions de l'Assemblée à la clôture de la Session de 1824 : — Appropriations annuelles pour la totalité de la liste civile et contrôlée absolue et illimitée sur le fonds approprié dans la direction et appointement spécifique de son application. Cette dernière doctrine, qui avait paru assouplie pour un temps, reprit tout à coup une telle vigueur que dans l'opinion de l'Assemblée, même persister à y résister devenait une prétention illégale, autant pour la tolérance (démocratique) !\n\nOn a vu ce qui, suivant le sens de l'Assemblée, est la manière constitutionnelle de pourvoir au soutien du Gouvernement Civil de la Province. On a pareillement vu que la manière dont la demande a été faite au nom du Roi par Sir John Sherbrooke, de voter la dépense annuelle ordinaire d'une manière constitutionnelle, avait été pervertie par l'assemblée en un appel à cette assemblée de voter annuellement les dépenses du Gouvernement Civil. Le lecteur a encore vu la manière avec laquelle on s'est conformé même à ce dernier appel supposé de voter annuellement, aussi bien que l'origine et les progrès de l'assomption dirigeante et appointante, et de la tentative de desapproprier le revenu approprié appartenant au Roi, depuis l'époque où cet objet devait avoir été englobé sous la dénomination générale d'ARGENS PUBLICS, jusqu'à celle où la résistance soutenue contre ces empiétements est devenue, dans l'opinion avouée de l'assemblée une prétention illégale de la part du Gouvernement de Sa Majesté.\n\nTel était la situation des affaires (et c'est au lecteur à déterminer par l'agence et les prétentions de qui) lorsque l'administration (par le départ du Gouverneur en Chef pour l'Angleterre en vertu d'un congé) échut au Lieutenant Gouverneur, Sir Francis Burton : charge qui n'était certainement rien moins qu'enviable.\n\nCe serait perdre son temps que de l'employer à discuter le Bill de subside passé par l'Assemblée dans l'année 1825. Le Lieutenant Gouverneur le croyait sans doute constitutionnel ou bien il ne lui aurait jamais donné sa sanction ; et Sir Francis Burton, n'était pas non plus le seul de cette opinion. La manière décidée avec laquelle, après la passation du Bill, il informe le Ministre \"que la méintelligence qui avait si longtemps subsistée entre les Corps Législatifs relativement aux matières de finances avait été terminée à l'amiable\" est bien indicative de la persuasion où il était que l'arrangement désiré s'était effectué, mais après tout à quoi ça se monte-t-il ? Qu'il y avait peut-être une apparence (et on verra tout à l'heure que ce n'était rien de plus, quand bien même on admettrait, dans ce cas-ci seulement, l'exposé de l'an...\ncienne Gazette) d'un arrangement sans garantie de sa stabilité—arrangement qui pouvait, aux yeux du Lieutenant-Gouverneur, agissant d'après son meilleur jugement et pour le mieux, paraître satisfaisant—mais cependant non tel que Son Excellence aurait sanctionné s'il avait précisément compris les vues du Ministre à ce sujet—non cet arrangement que le Ministre avait en contemplation, ni en conformité \"des instructions spéciales qui avaient été données par l'ordre de Sa Majesté au Gouverneur Général dans ses dépêches du 11 Septembre 1820 et du 13 Septembre 1821.\" C'est le manque d'une pleine connaissance et possession de ces instructions qui constitue actuellement la défense du Lieutenant Gouverneur auprès du Ministre pour avoir sanctionné ce Bill ; car avec la connaissance et la possession de telles instructions spéciales données par l'ordre de Sa Majesté, il n'aurait jamais voulu le faire et ni aucun de ses amis ni ceux qui lui voulaient quelque bien, n'auraient pu vouloir l'induire à y contrevenir.\n\nSa réponse à une adresse du 19 Février 1825, par laquelle l'Assemblée lui demandait communication des \"Instructions, dépêches ou parties d'icelles relatives à la provision convenable et permanente pour le Gouvernement Civil, comme mentionné dans la harangue du Gouverneur du 16 Décembre 1820, et à la provision pour le même objet durant la vie du Roi du 11 Décembre 1821,\" et consignée dans les journaux de la Chambre ; \"fait foi qu'il ne les avait pas. Qu'elles étaient néanmoins en existence, ne peut être révoqué en doute, vu que la lettre du Lord Bathurst du 4 Juin, met fin à toute question qui pourrait s'élever à cet égard.\n\nLorsque donc, l'ancienne Gazette parle de \"mésintelligences ainsi si pernicieusement renouvelées,\" (faisant allusion à la dernière Session de 1826) et observe que \"toute la Province en approuvait la terminaison\" (se référant à la Session de 1825) \"et regrettait de les voir renaître,\" il falsifie le cas. Elles n'ont jamais été terminées, quelqu'en ait été l'apparence dans le temps. Elles ne pouvaient jamais l'être, jusqu'à ce que l'arrangement ait été effectué conformément aux instructions spéciales ou, jusqu'à ce que Lord Bathurst ait jugé à propos de les révoquer et de ne plus insister sur leur exécution ; ce que la lettre à laquelle il est fait allusion, montre avoir été bien éloigné de l'intention de sa Seigneurie.\n\nOn ne peut pas dire non plus que la mésintelligence ait été renouvelée, vu que la lettre du Lord Bathurst fait voir que, loin d'être parvenue une terminaison, elle n'avait pas même été suspendue et encore moins terminée ; mais qu'effectivement elle était encore dans le même état, et peut-être même pire qu'auparavant. Les \"instructions spéciales\" données \"par l'ordre de Sa Majesté au Gouverneur-Général\" n'ayant pas été consultées et faute d'y avoir adhéré, sa seigneurie dit que \"il n'est pas en son pouvoir de considérer cet arrangement (le Bill) comme en aucune manière satisfaisant.\" La mésintelligence ne pouvait se terminer sans la participation du Ministre. Que ces instructions n'ont pas été consultées et qu'on n'y ait pas adhéré, personne ne prétend ou n'a voulu prétendre que le blâme en tombait le moindre sur le Lieutenant-Gouverneur, puisqu'il n'en avait pu trouver à la place où on avait tout lieu de s'attendre qu'elles devaient être, mais où on ne les trouvait pas. Mais toujours, comme elles existaient, quoique le Lieutenant-Gou-\nverneur ou toute autre personne à sa place ait pu faire, dans l'espérance et dans la vue de bien faire, s'il s'est fait quelque chose néanmoins, en contradiction à ces instructions ou sans s'y conformer, cela n'a pu en aucune manière terminer la méintelligence. La tentative de vouloir faire paraître que la méintelligence était terminée par le Bill de subside passé en 1825 et renouvelée par la rejection de celui de la dernière Session 1826, est donc tout d'une pièce avec toutes les autres matières mentionnées comme ayant quelque liaison avec ce sujet depuis le commencement, et il est impossible de se méprendre sur le but qu'on se propose dans ce moment en les remettant sur le tapis.\n\nQuelque soit l'interprétation que l'on puisse donner au Bill de subside passé en 1825, rien n'est plus certain que le Lieutenant-Gouverneur était bien loin de le comprendre dans le sens de l'Assemblée, ou plutôt, comme l'ancienne Gazette peut le faire. Son Excellence elle-même n'entendait pas céder le moins du monde à l'assomption dirigeante et appointante dans le sens auquel il a été fait allusion. Loin de s'imaginer que cette assumption était virtuellement et décidément exercée sur le fonds approprié, il ne vit aucune raison de soupçonner qu'il était exercé de fait et d'intention sur le subside, en aide du dit fonds accordé sur le revenu non approprié, autrement que dans la direction générale que c'était \"pour les fins de défrayer les dites dépenses du Gouvernement Civil de cette Province et de l'Administration de la Justice dans icelle et les autres dépenses de la dite année\" (1825). L'aide était en effet indéfini, mais le Bill n'était pas entravé par les assumptions dirigeantes et appointantes et les termes englobans d'argent publics et de fonds général y étaient entièrement omis. Quoique Son Excellence ne fût pas en possession des instructions mentionnées dans la lettre du 4 Juin 1825, dans lesquelles il aurait vu la nécessité sous laquelle le Gouverneur en Chef en conformité des ordres du Roi, avait été obligé d'agir depuis 1820, n'en était pas moins convaincu que le contrôle sur le fonds approprié appartenait exclusivement à l'Exécutive, et qu'en conséquence il n'aurait pas souffert qu'il y fut touché. En sanctionnant le Bill, il était, comme il se voit dans sa lettre au Lord Buthurst, dans la persuasion la plus intime, que l'Assemblée par le Bill de subside avait \"décidement reconnu le droit de la Couronne de disposer du revenu provenant de la 14 Geo. III. chap. 88\" et qu'ainsi son intégrité n'était d'aucune manière compromise.\n\nSi, donc, d'un côté le Lieutenant-Gouverneur, en donnant sa sanction à ce Bill, avait conçu que la disposition exclusive du fonds approprié était décidément reconnue appartenir à l'Exécutive et que son intégrité n'était en aucune manière compromise ou affectée ; et si l'Assemblée, dont les prétentions, sous les assumptions dirigeantes et appointantes n'étaient aussi de son côté nullement affectées et restaient dans toute leur vigueur et force telles que consignées et non rappelées dans ses journaux) naît d'un autre côté qu'une telle admission fut même virtuellement et encore moins décidément reconnue dans le Bill, et soutenue qu'elle n'avait pas eu la moindre idée d'admettre que l'intégrité et le contrôle du fonds approprié devaient être laissés exclusivement au pouvoir de l'Exécutive, la méintelligence était en réalité bien loin d'être terminée. Les parties étaient en effet plus loin que jamais de bien s'entendre, puisque l'une et l'autre procédaient sous une conception erronée de leurs vues réci-\ncirconstance qui ne pouvait manquer de conduire à un éclaircissement. Quoique l'Assemblée n'ait pas présenté l'Adresse au Lieutenant-Gouverneur pour lui rendre compte des réductions dans le montant du subside requis par l'état estimatif, les circonstances subséquentes prouvent très positivement que le pouvoir excluant était en action, certains offices ayant été omis dans les votes de l'Assemblée, lesquels, quoique non spécifiés dans le Bill, étaient cependant consignés dans les Journaux de la Chambre, auxquels, comme loi obligatoire pour l'Exécutif dans cette matière, on devait s'attendre à ce que ce dernier se référerait et se guiderait en conséquence dans l'application de la totalité de la somme mentionnée dans le Bill.\n\nSi le Lieutenant-Gouverneur aurait ou non consenti à être guidé par les votes de l'Assemblée tels que portés dans les journaux, dans le cas où il aurait continué à la tête de l'Administration du Gouvernement et où il aurait été libre de suivre son opinion, sans égard aux vues du Ministre, c'est ce qu'il est bien difficile de décider. L'ancienne Gazette s'explique distinctement à cet égard et dit que l'assemblée s'attendait à ce qu'il le ferait indubitablement. En supposant que son attente se soit trouvée frustrée, ce qui n'est pas chose très improbable (car quelqu'un ait été l'opinion du Lieutenant-Gouverneur quant à la convenance de consulter les votes, il n'aurait jamais voulu, en toute probabilité, les considérer comme loi au point d'exclure de la liste civile ou d'abolir aucun office, que le Ministre dans une occasion précédente et par l'ordre du Roi, avait expressément refusé d'exclure et d'abolir, mais bien au contraire avait expressément signifié être nécessaires au Gouvernement Civil de la Province), la méconnaissance se serait renouvelée, à moins que l'Assemblée n'ait abandonné in toto les prétentions dirigeantes et appointantes, ce que cependant, nulle de ses procédures ne paraissaient indiquer.\n\nEn tous cas le renouvellement, (comme s'exprime l'ancienne Gazette) de la méconnaissance aurait eu lieu lors de la dernière Session (1826) quand bien même le Lieutenant-Gouverneur fut resté à la tête de l'Administration du Gouvernement. Quelque déplaisant qu'il eut été pour Son Excellence de refuser sa sanction à un Bill semblable en forme et en substance à celui qu'il avait sanctionné dans la Session précédente, il eut été, d'après la lettre que le Lord Bathurst lui avait adressé du 4 Juin 1825, dans la ne cessité de le faire, à moins qu'il ne fût parvenu à prévaloir sur sa seigneurie de changer d'opinion—événement bien peu probable, d'après les progrès que les prétentions ci-dessus exposées avaient faits dans les sept années précédentes, qui ne pouvaient pas avoir échappé à l'attention de sa seigneurie.\n\nLe renouvellement prétendu de la méconnaissance lors de la dernière Session ne pouvait avoir été évité, dans quelque main qu'ait été placée l'Administration du Gouvernement; la même ne cessité (telle que mentionnée dans la lettre du Lord Bathurst) qui \"avait été imposée au Gouverneur-Général\" dans les dépêches de 1820 et 1821, existait encore dans toute sa force. La réprobation de la part du Ministre du Bill de subsides de 1825, est attribuée par l'ancienne Gazette au défaut d'information correcte, avec quelques insuffisances que des informations incorrectes avaient été données à sa seigneurie. Mais quelque soit la nature des informations qui ont pu ou non parvenir à sa seigneurie sur ce sujet par d'autres voies, il est évident que sa seigneurie ne\npouvait être sous l'influence d'aucune erreur au sujet de ses propres dépêches de Septembre 1820 et de Septembre 1821, et ce n'est qu'à celles-là seules qu'il se réfère dans sa dépêche du 4 Juin 1825, dans laquelle il exprime sa réprobation du Bill, parce qu'il n'y était pas conforme.\n\nAttribuer le renouvellement de la méconnaissance au défaut d'informations correctes ou de fausses informations, est donc purement gratuit et ne conduit à rien, les motifs de la réprobation du Bill par sa seigneurie reposent entièrement sur ses propres dépêches à des dates antérieures de cinq et quatre années et dont il était en pleine et entière connaissance. Dans le fait, le mal quel qu'il soit, ne doit pas être imputé à un défaut d'information ou à des informations incorrectes données au Ministre, mais bien plutôt vice versa — à un défaut d'information du côté du Lieutenant-Gouverneur, non par sa faute, et ce serait peine perdue inutilement que de chercher à découvrir à qui est la faute, s'il y en a quelque part, puisque quand bien même elles auraient été dans la possession du Lieutenant-Gouverneur, l'ancienne Gazette ne pourra pas dire que l'Assemblée aurait agi différemment pour se conformer aux vues du Ministre, qu'elle n'a fait sans référence aux dépêches, dont la substance lui avait d'avance été communiquée sans effet, par le Gouverneur en Chef dans sa harangue du trône. La connaissance et la possession pleine et entière des \"instructions spéciales qui avaient été données par l'ordre de Sa Majesté\", aurait imposé au Lieutenant-Gouverneur la nécessité de refuser sa sanction au Bill. La méconnaissance préexistante aurait, il est vrai continuée, mais sans avoir empiré ; tandis que la terminaison apparente n'ayant rien de réel et n'étant fondée que sur un mal entendu, comme il a été montré, devient une source additionnelle de discorde et éloigne plus que jamais les parties du terme de leurs débats.\n\nL'ancienne Gazette admet en substance, que sous aucunes circonstances on ne pouvait s'attendre à ce qu'on aurait suivi une autre marche, puisque c'eût été \"abandonner son droit héréditaire — la prospérité absolue dans ses biens et effets — en un mot se promulguer le seul peuple depuis le détroit de Magellan jusqu'à la Baie de Hudson indigné d'un Gouvernement libre.\" Dites plutôt, son droit héréditaire de désappropper un fonds approprié appartenant au Roi ! — de le déposséder de son droit dans le fonds et de faire prononcer à son Gouvernement Colonial sentence contre lui-même, comme le Gouvernement mixte le plus précaire et le plus instable de l'univers, et comme tel le plus indigne et le plus incapable de prendre rang même parmi ces Républiques chancelantes qui s'élèvent sur ce continent.\n\nLe sens clair et littéral de la lettre du Lord Bathurst est aussi perverti dans l'article de l'ancienne Gazette qui fait l'objet de cette discussion. Par exemple il y est dit \"si le Lord Bathurst avait eu des informations correctes, il n'aurait pas pu parler du revenu prélevé sous des Actes Coloniaux, comme étant le seul revenu à ta disposition de la Législature Coloniale. — Il n'aurait pu parler de tous les revenus permanents comme déjà appropriés ce qui n'a encore jamais été prétendu.\" Sans entrer dans le mérite intrinsèque de ces propositions quant au fonds, il suffit de nier que sa seigneurie ait dit telles choses. Lord Bathurst a parlé du revenu \"comme sous le nom de revenu permanent.\" Lorsqu'il est mention dans cette Province du revenu permanent à\nl'égard de la liste civile, il est bien compris que ce revenu consiste dans les droits imposés par l'Acte du Parlement de la 14e Geo. III. chap. 88, qui établit un fonds permanent pour le soutien du Gouvernement Civil de la Province. Nous distinguons particulièrement ce revenu par le nom de revenu permanent ; étant définitivement qu'il y a d'autres revenus sous des Actes tant Coloniaux que Britanniques, qui n'étant pas appropriés, sont à la disposition de la Législature.\n\nLord Bathurst ne dit pas ni ne veut dire par cette lettre, \"que tous les revenus permanents étaient déjà appropriés ; sa seigneurie parlait du revenu provenant de la 14e Geo. III. chap. 88,\" qu'il cite spécialement et de nul autre. Il dit \"Le Gouvernement Exécutive a envoyé un état estimatif dans lequel il n'a été faute aucune distinction entre les dépenses chargées sur le revenu permanent de la Couronne et celles qui restaient à être pourvues des revenus prélevés sous les Actes Coloniaux.\" Sa seigneurie n'est pas aussi explicite qu'il aurait sans doute été s'il avait été interpellé de nier les propositions mises au jour dans l'ancienne Gazette. Si on observe que le revenu provenant de la 14e Geo. 3, est particulièrement désigné, les six derniers mots de sa seigneurie \"(revenus prélevés sous des Actes Coloniaux)\" ont un sens plus étendu qu'ils ne paraissent avoir au premier abord, et signifient en général la totalité des revenus non-appropriés de la Province, d'une nature tant permanente que temporaire, qui restent à la disposition de la Législature, soit qu'ils soient prélevés sous des Actes Britanniques ou sous des Actes Coloniaux, mis en opposition avec le revenu approprié et permanent.\n\nLa lettre de sa seigneurie est très explicite et décisive en deux points : le premier—que le revenu provenant de l'acte cité, constitue un fonds appartenant exclusivement au Roi, et applicable par lui au soutien du Gouvernement Civil de la Province * Le second—que ce fonds constituant \"le revenu permanent du Roi à certaines charges qui lui sont assignées.\" Quelqu'inconsistance que l'écrivain de l'article dans l'ancienne Gazette de Québec puisse imaginer dans l'objection du Lord Bathurst contre la \"forme\" de l'état estimatif envoyé en bas en 1825, que cet écrivain prétend être en substance la même que ceux de 1819, 1821 et 1822, il n'en est pas moins vrai que dans tous ces États dans le premier comme dans le dernier, le revenu permanent dont il est question, est inviolablement considéré comme appartenant exclusivement à la Couronne, et comme tel applicable par elle généralement à la décharge de la somme totale requise par le Gouvernement pour la dépense de l'année. Ce n'a été en effet que dans l'année 1823, que les prétentions dépossessionnaires et le refus de l'octroi d'un subside autrement qu'à des conditions dirigeantes et appointantes, conditions considérées par les autres branches être inconstitutionnelles, et comme telles équivalentes à un refus positif de tout aide, que le Gouvernement s'est trouvé dans la nécessité de déterminer quels seraient les charges assignées ou les établissements qui, suivant l'intention et le sens de la loi qui pourvoit au fonds, devaient être à la charge de ce fonds. La lettre du Lord Bathurst de Juin 1825, prouve bien positivement que cette mesure avait son approbation. Si on ne l'avait pas fait plutôt qu'en 1823, il est possible que c'ait été parce qu'on avait espéré que les mesures de l'Assemblée\nen auraient prévenu la nécessité. Une fois adoptée, il est certain que, si elle n'a pas été ordonnée en premier lieu par sa Seigneurie, (car il n'en paraît aucune indice par les documents publiés) au moins est-il certain qu'elle a eu son approbation décidée, autrement il n'est pas probable que le ministre aurait aussi fortement disapprové la déviation aux états estimatif des années précédentes, dans lesquels les charges permanentes sur le fonds permanent étaient distinguées et spécifiées.\n\nL'Ancienne Gazette avance encore que, faute d'information correcte, Lord Bathurst à \"confondu deux choses parfaitement distinctes, les résolutions et les votes de l'Assemblée, qui ne lient pas légalement l'exécutif et l'acte de subside qui seul le lie.\" Sa Seigneurie ne les a pas confondues. Il cite les mots \"montant des votes\" probablement d'après la lettre du Lieutenant Gouverneur à ce sujet, et alors il procède à l'exposé de ses objections au Bill, dont il cite une sentence, et de la manière dont il envisage le tout. Mais quand bien même sa seigneurie l'aurait fait il n'aurait pas eu un si grand tort; puisque, indépendamment du Bill, les votes de la Chambre, comme il a été déjà observé, sont censés, dans l'opinion de la plus part de ses membres, constituer une loi obligatoire pour l'Exécutif, dont l'infraction donnerait naissance à chaque Session subséquente à de nouvelles querelles et à des médisiances sans fin.\n\nUne des raisons alléguées au soutien de la doctrine déposessoire est afin que ces argens ne soient pas appliqués au payement de personnes qui ne rendent aucun service à la Colonie, ou même n'y résident pas. D'anciens services ne doivent-ils donc compter pour rien? Ces individus, s'ils s'en trouvent quelques uns, ont du sans doute avoir quelque droit à la faveur Royale avant d'être revêtus d'offices et d'obtenir des salaires. Mais supposons même que ce ne soit pas le cas, ils sont en possession d'offices sous l'autorité du Souverain et ont sa foi qu'ils n'en seront pas déposés sans quelque compensation. Est-ce que la foi du Souverain ne doit compter pour rien? En outre, il a été expressément signifié, et cela par son ordre, que quelques uns de ces offices qu'on a essayé d'éteindre par l'exercice du pouvoir excluant, sont, dans son opinion, nécessaires à la marche du Gouvernement, nonobstant toute opinion de l'Assemblée à ce contraire.\n\nIl n'y a pas le moindre doute qu'on aurait en tout temps tous les égards que méritaient de justes représentations à ce sujet comme à tout autre, mais il faut qu'elles soient basées sur la justice due à l'individu comme sur celle due au public. Le Gouvernement local ainsi que celui de la mère patrie ne refuseront jamais de remédier aux abus,—mais que ces remèdes ne soient demandés que contre des abus, autrement ils en deviendraient eux mêmes de bien plus grands s'ils étaient improprement appliqués.\n\nCe n'est pas l'intention ici de réfuter les tableau calamiteux que fait l'ancienne Gazette de la situation de la Province et des embarras dans lesquels nous nous trouvons plongés. Ils peuvent être considérables, mais la Province n'en est pas moins dans un état florissant et il suffit de la simple observation de chacun pour s'en convaincre. Il est bien vrai que le Gouvernement est en effet retardé dans ses opérations, ce qui se doit aux prétentions ci-dessus exposées, et les améliorations publiques doivent en conséquence s'en ressentir jus-\nqu'à ce qu'on en vienne à un accommodement. Si les maux sont parvenus au degré tel que représentés dans l'ancienne Gazette, la Province est certainement dans un état déplorable ; mais le remède en est bien simple et à la portée de l'Assemblée. Qu'elle cesse d'aspirer à la souveraineté absolue de la Province et qu'elle se contente de la place que la loi lui assigne comme branche de la constitution.\n\nEn même temps faisons bien comprendre la véritable question aux habitants du pays comme le pas le plus important vers un éclaircissement bon et durable. Il existe dans la matière elle-même un principe de rédemption qui doit acquérir de la force si le peuple en est seulement bien informé. Qu'on adopte les moyens de mettre les personnes éclairées et qui ont le plus de poids dans les compagnies, en état de comprendre le point précis en dispute. Que chacun y prenant intérêt cherche des informations à ce sujet et communique franchement et sans crainte celles qu'il peut posséder lui-même avec sa propre opinion. Que le respectable Clergé dans toutes les Paroisses de campagne en soit mis en possession ainsi que conviendrait de la justice de la cause (et ce n'est que sous le point de vue de justice que la question doit leur être présentée) et guidé par leur inclination et par leur devoir envers le Roi, chacun deux déclare candidement son opinion, leur influence dans une cause équitable, et elle ne doit être requise dans aucun autre, est décisive. Les droits du Clergé et de la Couronne sont alliés et inséparables — et sont également inviolables. Le maintien et soutien des droits de l'un sont le gage de la stabilité de ceux de l'autre. — Le renversement ou l'invasion accompagnée de succès des droits du Roi, laisseraient ceux du Clergé sans sure garantie. Mais encore une fois, ce n'est pas tant dans ce sens que d'après simple conviction de la justice du cas, qu'il est à désirer que ce corps respectable réfléchisse et raisonne sur ce sujet.\n\nQu'un chacun qui peut penser et raisonnner par lui même sur ce sujet parle hardiment, sans se laisser intimider par la multitude qui, égarée par de faux signaux et fière du nombre, crie le plus haut, et qui s'imagine que parce qu'elle fait le plus de bruit et que la supériorité numérique est de son côté, la raison l'est pareillement et qu'elle l'emportera à la fin. Que personne ne soumette son propre jugement parce qu'il ne peut parvenir à convaincre son adversaire ; ni ne cède au préjugé obstiné, cette opinion qui ne céderait pas à la force de l'argument. Mais que surtout personne ne désespère de la cause parce qu'elle est entourée de difficultés. Elle finira par triompher parce qu'elle est celle de la vérité.\n\nQu'on se souvienne que ce n'est pas parce que le Roi dont nous sommes les sujets, porte une Couronne, tient en main un sceptre (qui ne sont que des emblèmes de la Royauté) et est investi du pouvoir que nous devons respecter sa personne et ses droits. Regardons le tel que tout Sujet Britannique devrait de raison doit le regarder. — Comme l'individu que la providence, pour notre bonheur et notre protection à tous, a placé dans un poste éminemment exalté et vraiment honorable comme Chef Magistrat du Royaume, mais qui lui impose des devoirs accompagnés de soins continuels et de soucis pénibles : — Comme l'individu qui est chargé de l'auguste responsabilité de maintenir à lui seul une sit des Branches de la Constitution et du pouvoir Exécutive de notre patrie, et qui à ce titre, a un double titre à notre confiance, à notre respect et à notre\nreconnaissance.—Que s'il était possible qu'il compromît ces droits que nous appelons les siens, mais qui appartenant plutôt à la Royauté qu'au Roi lui-même, sont essentiellement les nôtres et pour notre propre avantage, il mettrait nos droits en danger et en cela nous ferait une grande injustice.—Que, il est dans l'obligation de soutenir inviolablement et d'une main ferme non seulement sa propre part, (comme Roi) dans la constitution, mais encore la constitution dans toute son intégrité et de la transmettre immaculée à son Successeur et à nos descendants comme leur patrimoine le plus cher et le plus précieux.—Que nos droits et nos libertés ne sont pas moins concernés dans sa fermeté que dans celle de nos Représentants.—Que la faiblesse, toujours un vice dans ceux dont les devoirs, subordonnés aux siens, sont déterminés par la loi, serait en lui encore bien pis.—Enfin que c'est le devoir de tout sujet qui a une tête pour penser et un cœur pour sentir, de rechercher dans un esprit calme et impartiale, si, dans la dispute dans laquelle la Législature est engagée, le Roi et ses serviteurs agissant sous son autorité sont, par des motifs illégaux, vicieux et corrompus en contestation dans une mauvaise cause, pour un objet injuste et inconstitutionnel; ou si au contraire ils ne sont pas occupés à repousser une agression injuste et inconstitutionnelle et à maintenir à bon droit et vertueusement constitutionnel ce qu'ils ne peuvent abandonner qu'avec la souveraineté de la Province.\n\nPour adopter dans la matière actuelle quelques uns des derniers mots de notre immortel Nelson, dans un conflit important d'une autre nature, dans lequel les droits de notre Roi et de notre pays sont aussi vu enjeu, on peut, dans la crise du moment proclamer avec bien de l'apropos que \"le pays s'attend à ce que chacun fasse son devoir.\"\n\nSi on abandonne ce point, il est difficile de prédire quel autre point d'importance majeure sera l'objet de la prétention suivante. [La concession d'un droit à un antagoniste présomptueux est souvent faussement interprétée par lui en un droit de compter sur la concession ultérieure d'un autre droit, pourvu qu'il persiste dans ses prétentions.] Quelque lenteur que les autorités législatives puissent mettre à parvenir à un compromis équitable et permanent (car à moins qu'il ne soit permanent il vaut mieux qu'il n'y en ait pas) sur cette matière si importante sous un point de vue constitutionnel, il est certain que les serviteurs responsables du Roi, ne peuvent s'oublier ni n'oublieront le respect qu'ils se doivent à eux mêmes et leurs devoirs envers leur maître au point de permettre dans cette question que les droits communs de Sa Majesté, de leur patrie et de tous les Sujets du Roi dans cette Province comme en faisant partie, soient le moins du monde compromis. Leur détermination ne peut avoir été que la conséquence d'une mure délibération et d'après une connaissance pleine et complète du cas sous tous ses rapports, et il y sera sans doute persévééré avec sagesse mais aussi avec fermeté.\nIl convient cependant d'observer que le Conseil Législatif en passant ce Bill proteste fortement contre. Ce qui suit est extrait des Journaux de cette Chambre :\n\nRESOLU, \"Que le Conseil Législatif voit avec grande inquiétude et surprise, que les Bills envoyés de l'Assemblée, intitulés, \"Acte pour mettre Sa Majesté en état de défrayer certaines dépenses de dépendances qui appartiennent au Gouvernement Civil de la Province,\" et \"Acte qui approprie certaines sommes d'Argens à l'effet de mettre Sa Majesté en état de défrayer certaines dépenses du Gouvernement Civil de Sa Majesté en cette Province pour l'année 1823,\" renferment des matières susceptibles de beaucoup d'objections, en ce qu'ils accordent des Argens sur les Fonds Généraux de la Province, des fonds d'une somme considérable dénomination n'existant pas légalement, et en ce que les Titres, les Préambules et les Clauses d'Octroi et d'Appropriation contenus dans les dits Actes sont couchés en termes si généraux et ambigus qu'ils indiquent encore une présomption ou un dessein de laisser un doute sur le droit que prétend avoir l'Assemblée de disposer des Argens prélevés et déjà appropriés par un Acte ou des Actes de la Législature Impériale, ou par Sa Majesté, pour ce qui a rapport aux Droits et Revenus de Sa Majesté, et aux Amendes et Confiscations, ou par un Acte ou des Actes de la Législature Provinciale contenant des appropriations permanentes, ou dans lesquels les amendes qu'ils imposent ne sont pas réservées pour sa disposition future. Le Conseil Législatif proteste solennellement contre toutes semblables usurpations et prétentions, soit que ce soit directement ou indirectement, ou dans un langage ou sens clair ou couvert, ou de toute autre manière quelconque, qu'elles soient exprimées, faites, ou qu'elles puissent s'entendre.\"\n\nRESOLU, Que le Conseil Législatif a concouru dans les dits Bills, comme une mesure de nécessité qui résulte de l'état très-avancé de la Session, et de l'impossibilité qu'il y eût, s'ils étaient rejetés, à en passer d'autres avant la prorogation ; et de plus, qu'il n'y a concouru que pour prévenir la détresse générale et individuelle qui aurait inévitablement résulté de la réjection des dits Bills. Mais en donnant ainsi sa concurrence, le Conseil Législatif déclare qu'il conserve intact tous ses droits et privilèges, et qu'il n'admettra pas à l'avenir, sans quelque circonstance que ce puisse être, une procédure si contraire aux règles et à la méthode du Parlement.\n\nLes mots \"Fonds Généraux de la Province\" se trouvent dans un Acte porté sur le Livre des Statuts Provinciaux (39 Geo. III, chap. 9) lequel Acte est dormant n'ayant pas eu son effet, attendu qu'il ne devait en avoir que lorsque la Législature Britannique aurait rappelé l'Acte du Parlement Impérial de la 14e Geo. III, chap. 88, condition préalable stipulée dans l'Acte Provincial, ces Fonds Généraux devaient consister dans une consolidation de droits parmi lesquels devaient être compris ceux de la 14e Geo. III, chap. 88, dont le montant ne constituait pas un fonds considérable. Mais il faut aussi observer que dans le Statut de la 14e Geo. III, chap. 88, qui pourvoit le fonds pour subvenir aux dépenses de l'administration de la Justice et du Gouvernement Civil de la Province de Québec, le Haut-Canada, qui faisait partie de l'ancienne Province de Québec était et est encore intéressé, et qu'en conséquence le Parlement Britannique ne pourrait par aucune mesure, sur un simple Acte Législatif conditionnel de la part de cette Province, et sans une démarche correspondante de la part de l'autre Province, rappeler un Acte dans lequel cette dernière a un intérêt considérable, et qui ne peut qu'augmenter par la suite. Le rappel de l'Acte Britannique à la demande d'une seule des parties concernées, et n'étant requis ni par la nécessité ni sous un rapport politique, aurait été préjudiciable et injuste envers la Province supérieure, laquelle, en cas de méfiances en matière de finances avec le Bas-Canada, énumère la partie qui aurait vraisemblablement le plus à souffrir, à cet égard le plus grand droit aux soins et à la protection du Parlement Imperial.\n\nL'Acte de la 14e Geo. III, chap. 88, qui établit un fonds pour défrayer les dépenses de l'administration de la Justice et le soutien du Gouvernement Civil de la Province de Québec, n'est en aucune manière altéré ou affecté, soit en termes exprès, soit par implication par l'Acte de la 18e Geo. III, chap. 12, et encore moins par la 31e Geo. III chap. 31, communément appelé l'Acte Constitutionnel ; Le fonds étant légitimement acquis et établi par un Acte Parlementaire en faveur du Roi pour le soutien de son gouvernement dans la Province, (auquel, par la conquête il a été substitué aux droits du Roi de France, dans cer-\ntains droits qui appartenient à ce dernier à cette époque) n'était ni ne pouvait s'entendre être affecté par un Acte qui bien loin d'avoir un effet rétroactif avait une direction tout à fait contraire. Par la 18e Geo. III chap. 12, il est simplement déclaré que \"le Roi et le Parlement de la Grande Bretagne n'imposeraient aucun droit, taxes ou cotisations quelconques payables dans les Colonies de Sa Majesté, &c., sans aucune expression générale de leur intention de rappeler aucun des droits prévus dans les Colonies, à l'exception de celui sur le thé, tels qu'imposés par la 7e Geo. III chap. 46, qui ont été spécialement rappelés. Il faut observer que les droits sur le thé, étaient pour contribuer à la défense générale de l'Empire,\" et que quoique le Parlement les ait rappelés, il ne l'a fait que parce que les circonstances le rendaient expédient ; mais ces droits sur d'autres articles qui existaient depuis nombre d'années dans les Colonies du nord et dans les Îles de l'Amérique et qui étaient transmis annuellement en Angleterre pour la défense générale de l'Empire, sont restés et restent encore tels qu'ils étaient entendus être : un fonds destiné uniquement et exclusivement à l'objet interne de défrayer l'administration de la justice et du soutien du Gouvernement Civil de la Province elle-même est certainement un objet tout à fait différent de celui que le Roi et le Parlement avaient en vue, comme se rapprochant à la défense générale de l'Empire et ce n'est que pour cet objet qu'ils déclarent qu'ils n'imposeront aucun droits, en donnant pour raison de cette renonciation volontaire à un Droit qu'ils croyaient indubitablement avoir (ou bien pourquoi y renoncer) la persuasion où ils étaient que \"les fidèles sujets de Sa Majesté\" pourraient néanmoins être disposés à reconnaître la justice de contribuer à cette défense commune.\n\nLa 31e Geo. III chap. 31e (Acte constitutionnel) réserve expressément à Sa Majesté et au Parlement de la Grande-Bretagne le pouvoir d'imposer des droits pour le règlement de la Navigation et du Commerce, qui laisse le produit net de tous les droits qui seront ainsi imposés à la distribution de la Législature Provinciale pour son application. Mais où trouve-t-on l'intention de désapprouver et de déposséder soit dans cet Acte soit dans l'Acte précédent de la 18e Geo. III chap. 12e. À l'égard du fonds établi et approprié par celui de la 14e Geo. III chap. 88. Les meilleurs légistes constitutionnels d'Angleterre, ont donné leur opinion bien décidée à ce sujet et cette opinion est complètement confirmée par le Gouvernement Britannique et le sera aussi décidément par le Parlement Britannique, si jamais il devient nécessaire de soumettre le sujet à sa sagesse. Il est vrai que ces opinions se trouvent opposées par deux autorités imposantes celles de — la majorité de l'Assemblée et de — l'ancienne GAZETTE de QUÉBEC !\n\nL'opinion du Parlement Britannique (qui ne date pas plus loin que l'année 1822.) Sur ce point est très clairement exprimée dans l'Acte du commerce du Canada. Le préambule de la 27e Section de cet Acte, répétant le titre de l'Acte de la 14e Geo. III chap. 88 mentionne que les droits que cet Acte impose, \"doivent,\" d'après cet Acte \"être apportés sous l'autorité du Lord Grand Trésorier ou des Commissaires de la Trésorerie de Sa Majesté.\" La partie statutaire de la même section pourrait en termes exprès que \"Les Lords Commissaires de la Trésorerie de Sa Majesté pour le Royaume Uni de la Grande Bretagne et d'Irlande pour le temps d'alors, peuvent énoncer les ordres relativement à la portion dans laquelle ceux-ci\" (les droits prélevés sous l'Acte de la 14e Geo. III chap. 88) \"seront dépensés dans chacune des dites Provinces respectivement aux fins mentionnées dans le dit Acte comme ils le jugeront convenable.\"\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_52196.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 41, "total-input-tokens": 63598, "total-output-tokens": 33302, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1706, 3], [1706, 4145, 4], [4145, 4145, 5], [4145, 4616, 6], [4616, 4616, 7], [4616, 7548, 8], [7548, 10963, 9], [10963, 14917, 10], [14917, 18332, 11], [18332, 21768, 12], [21768, 25160, 13], [25160, 28691, 14], [28691, 32082, 15], [32082, 35336, 16], [35336, 38531, 17], [38531, 41899, 18], [41899, 45304, 19], [45304, 48564, 20], [48564, 52042, 21], [52042, 55418, 22], [55418, 59016, 23], [59016, 63191, 24], [63191, 66568, 25], [66568, 69804, 26], [69804, 73280, 27], [73280, 76523, 28], [76523, 79908, 29], [79908, 83059, 30], [83059, 86486, 31], [86486, 90061, 32], [90061, 93597, 33], [93597, 97079, 34], [97079, 100528, 35], [100528, 103953, 36], [103953, 107481, 37], [107481, 110525, 38], [110525, 115302, 39], [115302, 119100, 40], [119100, 119100, 41]], "primary_language": ["None", "en", "en", "en", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]