[{"id": "7192832f966e37b1c43a0563f44ba1e47ffb6b96", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e., other than blue or black)/\n☐ Encre de couleur (i.e., autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| 10X | 14X | 18X | 22X | 26X | 30X |\n|-----|-----|-----|-----|-----|-----|\n|     |     |     |     |     |     |\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nTHE HISTORICAL & SCIENTIFIC SOCIETY OF MANITOBA.\n\nTRANSACTION No. 28. SEASON 1886-87.\n\nTHE FRENCH ELEMENT IN THE Canadian Northwest,\n\nBY LEWIS DRUMMOND\n\nPriest of the Society of Jesus.\n\nA PAPER READ BEFORE THE SOCIETY ON THE EVENING OF NOVEMBER 25TH, 1886.\n\nPRICE 25 CENTS.\n\nWINNIPEG:\nThe Northwest Review.\n1887.\nTHE FUTURE\n\nThat day has come at last—directly after the death of Dr. Bryce. It now appears that I am somewhat late in addressing this letter to my friend. I have been engaged at my mother's house, and with my family.\n\nDay, I cannot nor wish to justify my doubts. I cannot Saxon race cordially admired elsewhere.\n\nLADIES—The word of months justify part of are the much less have in-\n\ndence of oft-repeated of so less Society wide and try, his history, literary all of that will together acouate. But the determined treaty\nA PAGE OF HISTORY.\n\nTHE FRENCH ELEMENT IN THE CANADIAN NORTHWEST.\n\nPREPATORY NOTE.\n\nThanks to kind suggestions made directly after the delivery of this lecture by Dr. Bryoe and Mr. Alex. McArthur, it now appears corrected up to date and somewhat enlarged, though the form of address is preserved. In answer to some of my friends, who said they were amused at my making common cause with my mother's race, after identifying myself with my father's race on St. Patrick's Day, I can but say that I have no power nor wish to alter or extenuate the facts of my double origin. My only regret is that I cannot claim kinship with that Anglo-Saxon race, which is at once the most cordially hated and the most sincerely admired element in the modern world.\n\nTHE LECTURE.\n\nLADIES AND GENTLEMEN.—Allow me a word of apology at the outset. Fifteen months in this great Northwest hardly justify a man in giving a lecture on any part of its history. The old inhabitants are the best authorities on the past life of a land where oral tradition has so much larger a share than it is wont to have in long-established centres of civilization. Hence it was with great diffidence that I accepted the urgent and oft-repeated invitation of the President of so learned a body as the Historical Society has proved itself to be. His own wide and varied knowledge of this country, his labors in the field of science and history, his familiarity with the literary master-pieces of the past, all combined to make me fear that whatever I could say would be altogether too unworthy of an audience accustomed to his most interesting lectures. But there was one consideration which determined me to yield to his kind entreaty. The subject suggested by Dr. Bryoe was \"anything on the French people in the Northwest, their history, language, or mode of settlement.\" Nothing could be more congenial to me, seeing that my mother was a French Canadian, that for more than eight years I read and taught the Ancient Classics in French, and that circumstances have afforded me unusual opportunities of studying the French race both in Europe and in America. I suppose the best preparation for understanding the history of a colony is to belong to the race from which the colonists sprang. It is so hard for an outsider to enter into the feelings of men whose blood is alien to his. Of course innate largeness of mind combined with travel may transform a stranger into what Ulysses was, \"many-sided,\" so that he may be able to put himself into the very same frame of mind as men of other nationalities; but this is at best but an imitation, a substitute for the natural fellow-feeling that comes of having the same forefathers. Thus it happens that men in whose veins the blood of two, three, or, as in my case, four races commingle, are by nature prepared to take an impartial view of the history of a mixed population such as ours. As a descendant of the early French settlers in Canada, I am prone to seize on all the good points of the French race, while an admixture of Irish, Scotch, and German blood effectually shields me from that insane prejudice against other nationalities which is the darling heritage of narrow minds.\n\nTHE FIRST EXPLORERS.\n\nHaving premised this much, ladies and gentlemen, by way of bespeaking an indulgent hearing from you, I begin immediately with some important dates, and to understand the value of these dates I would just remind you that the Honorable Hudson's Bay Company received its charter in 1670. How the company came into being we shall see presently. What I want to call your attention to now, is\nthe fact, that fourteen years before the famous date of this charter, that is, in 1656, while Cromwell was still arbiter of England, Jean Bourdon, sometime chief engineer and procureur of New France, is said to have penetrated as far as the shores of Hudson's Bay, and to have taken possession of the neighboring territory in the name of Louis XIV. Five years later, but still nine years before the birth of the honorable company, Despres Conture accompanied an expedition sent out by D'Argenson, the then governor of Canada, with a view to find the northwest passage to Japan. This exploring party was composed of French gentlemen under the guidance of the Jesuit fathers, Druillettes and Dablon. Not having succeeded in their quest, they returned to the east; but Couture started again in 1663 with five companions, and safely reached Hudson's Bay, where, to confirm the prior occupation, he buried at the foot of a big tree, some say, a French flag and a sword, others, the arms of the king engraved on a plate of copper enclosed in two sheets of lead. Who knows if the Hudson's Bay Company may not soon dig up these relics of the past? The only difficulty would be to find the tree; the fact of its being a big one may help the search along a coast where forest giants are rare.\n\n**DES GROSELIERS' CAREER.**\n\nThe story of these two travellers belongs to the domain of probable, not certain facts. In 1662, however, we come upon a well-known name, that of Des Groseliers, or Des Groiseliers, as it is variously written. He is commonly represented as a Huguenot adventurer more remarkable for restless bravery than for loyalty to any particular crown. We are told that he distributed his allegiance pretty equally between Louis XIV. and Charles II. As the Grand Monarque made a cat's paw of the easy-going Charles, so Des Groseliers seems to have fooled them both according to the impulse of his own convenience. This is the view the generality of books on the Northwest, written in English, give us of his character. Some people also pretend that he went to Hudson's Bay, through Rainy Lake, Lake of the Woods, Winnipeg River and Lake, and Nelson River. Both this view and these assertions are, I think, incorrect. The Relations des Jesuites, the Journal des Jesuites, the Letters of Marie de l'Incarnation, the registers of the Parish of Three Rivers and other similar contemporary records show that Medard Chouart, who afterwards called himself \"Sieur de Groseliers,\" was not only a Catholic, but for many years an assistant to the Jesuits in their missions near Lake Superior. He baptized several children among the Indians, and we find him frequently acting as godfather in the Catholic parish church of Three Rivers. Probably what led to his being considered a Huguenot was the fact that his brother-in-law, Radisson, was one. But Des Groseliers, whose children were baptized in the Catholic church, whose first wife was the daughter of Abraham Martin, the man who is supposed to have left his patriarchal name to the plains of Abraham, near Quebec, certainly lived and died a Catholic. As to his character, he was not precisely a hero, but he was evidently a daring explorer, and there is nothing in his life that can be called disloyal, though there may be some tricks of pardonable diplomacy. If he went over to England, it was mainly a matter of business that does not appear to have damaged him in the eyes of Louis XIV., who was then at peace with Charles II. I can find no proof that he ever travelled to Hudson's Bay by land. But he undoubtedly did reach the Bay by the sea in 1662, one year before the alleged voyage of Conture, and established a trading post there six years before the first English settlement, which he himself helped Capt. Gillam to make. My authority for this statement is the Relations des Jesuites, corroborated, as it is, on this point by the Journal of the Jesuit house in Quebec. The value of this diary is all the greater because it was drawn up day by day, according to the custom still observed in all Jesuit houses, was never intended for publication, and was printed without the permission of the Jesuits, out of whose hands it had passed. The \"Relations\" tell us that in 1660 one of the missionaries in the Saguenay region met an Algonquin who had spent the previous winter on the shore of Hudson's Bay, and who had returned by Lake St. John. By the way, this return route by the head waters of the Saguenay shows that James Bay and not Hudson's Bay proper had been visited by this Indian. The distinction, though very important, as I shall have occasion to explain further on, is often overlooked by chronicles of the period. Almost directly\nafter this great piece of news the missionary came back to Quebec, and there fell in with Des Groseliers, who had just returned from Lake Superior with sixty canoes laden with the costliest furs. While wintering in the neighborhood of the great lake Des Groseliers may have heard of Hudson's Bay. At any rate the missionary's announcement determined him to fit out a barque, and the Journal des Jesuites states that a Frenchman called Chouart Des Groseliers set sail from Quebec for Hudson's Bay in the summer of 1683. Casting anchor at the mouth of Hayes River, he remained there during the ensuing winter. After seeing what a splendid region lay about him for the fur trade, he hied him to Quebec with Radisson and eight men, leaving his nephew, Chouart, at Nelson River with five men, and thus providing for the continuance of this the first settlement at the Bay.\n\nFOUNDING THE H. B. COMPANY.\n\nDes Groseliers had hoped that the Quebec authorities would help him found a company for the Hudson's Bay trade; but, not meeting with any encouragement, he sailed for France. In Paris, where the Home Government, too, seems to have given him the cold shoulder, he was more fortunate with the English Ambassador, who eagerly grasped at the Frenchman's suggestions, gave him letters of introduction to Prince Rupert and sent him to London. Thanks to these letters and to his own glowing accounts of the territory he had explored, he induced the Prince and other noblemen to inaugurate that historic company, which was once such a power in this land. In 1668 he embarked as pilot in an English ship commanded by Captain Gillam. On reaching Hudson's Bay they built a little stone house, which they called Fort Charles. The royal name and the material out of which it was built are its only claims to precedence over the shelter built by Des Groseliers, six years before, near Hayes River. In the June of the following year, 1669, Des Groseliers sailed back to England, where the King was so pleased with him, and so convinced of his being the originator of the Hudson's Bay trade, that he dubbed him Knight of the Garter, made him a present of twenty thousand crowns, and in May, 1670, signed the company's charter. While Des Groseliers is regaling his English friends with many a yarn of his adventures during the past twenty-five years, listen to what is written of him in the second volume of the Lettres de Marie de l'Incarnation, First Superioress of the Ursulines of Quebec. What she says about his going to New England probably refers to a journey he made in that direction in 1663, and the writer seems to have inadvertently combined two distinct expeditions into one. I will take the liberty of reading the original text of this passage from a work, which, since its publication ten years ago, has come to be acknowledged as indispensable to those that want to know the state of Canada from 1639 to 1672. She writes from Quebec, on the 27th of August, 1670, a few months after the granting of the Hudson's Bay charter:\n\n\"Il y a quelque temps qu'un Francois de notre Tourelle, nommé des Groseliers, se étant en France, et voyant une occasion de fortune, il lui prit une fantaisie d'aller en la Nouvelle-Angleterre pour tacher d'y en faire une meilleure. Il y faisait l'homme d'esprit, comme en effet il en a beaucoup. Il fit esperer aux Anglais qu'il trouverait le passage de la mer du Nord, dans cette province, et qu'il pourrait leur envoyer en Angleterre, ou on lui donnera un vaisseau avec des gens, et tout ce qui était nécessaire à la navigation. Avec ces avantages il se met en mer, ou au lieu de prendre la route que les autres avaient coutume de prendre, et qui est la plus courte et la plus valable, elle s'orientent, et a bien cherché qu'il a trouvé la grande baie du Nord. Il y a trouvé un grand peuple, et charge son navire ou ses navires de pelleterie pour des sommes immenses. Il est retourné en Angleterre, où le roi lui a donné une pension de 200 livres, et fait chevalier de la Jarretière, qu'on dit être une dignité fort honorable. Il a pris possession de ce grand pays pour le roi d'Angleterre, et pour son particulier il voila riche en peu de temps. L'on a fait une gazette en Angleterre pour louer cet aventurier français.\"\n\nWith the subsequent career of Sir Medard Chouart Des Groseliers I am not now concerned. The one fact I wish to insist on is, that this well-known French citizen of Three Rivers was, in the truest possible sense, the originator of the Hudson's Bay Company, and that he was the first to establish trading-posts in the countries discovered by Hudson, Button, Fox and James.\n\nNEW FRANCE AND HUDSON'S BAY.\n\nTwo years after the granting of the charter, in 1672, Father Albanel was the first missionary and probably the first white man to reach the bay by the Saguenay route. The part he reached was, of course, James Bay, the southeast end of which is not half as far from Quebec as is York Factory of Hudson's Bay proper. This comparative nearness of James Bay explains how it is that from the last quarter of the seventeenth century onward we often read of French\nCanadians trading near \"La baie du Nord\" or even \"La baie d'Hudson,\" whereas we have no authentic records of regular French Canadian inland trade in the vicinity of Nelson River or of Fort Churchill till several years later. To dwellers in what is now the Province of Quebec, Hudson Bay, unless any special fort is mentioned which we know to have been further west, means James Bay. We gather, then, that from 1662, the date of Des Groseilliers' first expedition, New France, besides stretching in name to the Arctic Circle, had, in reality, advanced to the shores of Hudson's Bay; and this position of affairs was virtually recognised by that provision of Charles II.'s letters-patent which exempted from the operations of the company any actual possessions of any Christian prince or state. This was the theory; in practice there was much fighting over the disputed territory. Fifteen years after the charter, the Hudson's Bay Company had five forts on the shores of the Bay; but the very next year, 1686, Pierre le Moyne, Sieur d'Iberville, a native of Montreal, the toughestest chieftain Canada ever produced, headed an expedition which captured three of these forts and several British vessels. We cease to wonder that he should have done so, when we think of the blood that was in him, as many as six of his brothers having won immortal fame among the Iroquois, in Newfoundland, in Louisiana, and in other parts of America. Three of these seven warlike brothers took part in this first attack, another Chateauguay came with his elder brother, D'Iberville, in 1694, and was mortally wounded while preparing the siege that resulted in another victory for the French. Finally, in 1697 D'Iberville conquered the whole country, and the treaty of Ryswick, that same year, confirmed the claims of France, claims which France herself abandoned in 1713 at the treaty of Utrecht. Some rather curious details about the raid of 1694 are given in a letter of the Jesuit, Gabriel Marest, who acted as chaplain for the two men-of-war, the Poli and the Salamandre. There seems to have been nobody wounded or killed except the brave young Louis Le Moyne de Chateauguay; but to the elder brother, D'Iberville, who was 15 years his senior, and who, we are told, had always loved him tenderly, his death was a heavy price to pay for the otherwise easy triumph.\n\nAs soon as the French had levelled their cannon and sighted their mortars against the fort, they courteously sent a messenger with a flag of truce offering excellent conditions. There were fifty-three Brit- ishers in the fort, of whom Fr. Marest says they were all fairly tall and handsome—\"tous assez grands et bien faits\"—but better hands at trading than at making war, so much so that they even forgot to ask for their arms and their flag. Their minister had drawn up the capitulation in Latin, which Fr. Marest interpreted to the soldiers. The use of the language of Cicero as the only medium of communication between men of different nations was not yet abandoned at the end of the seventeenth century, nor was the day yet come when, as at the close of the last century and at the beginning of this, every English gentleman was expected to be able to speak French.\n\nTHE FRENCH LANGUAGE IN CANADA.\n\nThis letter of Fr. Marest's gives us one of the earliest instances of native Canadian expressions grafted on the mother-tongue. In speaking of the climate near Hudson's Bay he uses the word poudrerie, adding in a parenthesis: \"C'est ainsi qu'on appelle une petite neige qui s'insinue partout.\" This most expressive name for a storm of fine, hard, drifting, powdery snow has not yet been recognized in France; but French Canadians, having now a literature of their own, can afford to dispense with the approval of the French Academy, pretty much as Americans don't scruple to use words and phrases which are racy of the soil, and which have no adequate equivalent in Dictionary English. Already some of our best Canadian words, such as char-dortoir instead of wagon-lit for \"sleeping-car\" have found their way into that paragon of pocket manuals, Bellows' French and English Dictionary. I am not denying that there are faults in our Canadian French, as commonly spoken. I am simply combating an erroneous notion that prevails among people whose knowledge of the French language is shadowy. I mean, the notion that Canadians speak a sort of patois. Some years ago, when I lived in New York, I was not a little amused to hear Americans say that, anxious though they were to see their children learn French, they were afraid to send them to Canada lest they should come home with nothing but a barbarous jargon. My answer usually was that the majority of educated Canadians speak\nFrench quite as well as the majority of educated Americans talk English. I might have said more, for I am not aware that there is any such common and widespread fault in French Canada as the use of will for shall, and would for should. But in the main the parallel holds good even in the matter of accent. For the chief characteristic of the French Canadian, as well as of the American, accent, is the tendency to drawl, to be monotonous, and to exaggerate the number of nasal sounds. But these peculiarities are not confined to this continent of ours. They exist in Normandy and many other parts of France; they are not by any means so faulty as the Provençal or Gascon accent. I have met highly educated men from the North of England whose accent was as nasal as if they hailed from Idaho or Arizona. In fact I am inclined to think that in all European countries and particularly in France, Italy, Germany and Spain, the farther you wander away from the great centres of culture, where the concourse of highly trained minds stimulates men to perfection in the use of their vocal organs, the more likely you are to find nature's great law of following the line of least resistance assert itself in drawling and nasality. However, in this respect as also in a more correct use of French prose—that most subtle and delicate of all modern vehicles of thought—Canada has improved wonderfully in the last quarter of a century and is improving every day. If the United States can point to a revival of letters heralded in the present day by such skillful artists as James, Howells and Cable, French Canadians may well be proud of Judge Routhier, Benjamin Sulte, Chauveau, Marmette, the two Taches (our archbishop and his brother), and Louis Honore Frechette.\n\nTHE DISCOVERY OF THE RED RIVER.\n\nI have just mentioned a name that is closely connected with the sequel of this historical sketch. The Archbishop of St. Boniface is a descendant of one of the nephews of La Verandrye, the discoverer of this Red River Valley. The merit of prior discovery has, I know, been claimed for Henry Kelsey by Dr. Bryce in his learned volume on Manitoba (page 119). But the author is too well informed to venture upon any definite assertions. He deals in vague generalities: Kelsey, in 1691, \"crossed the Assiniboine and Sioux country,\" saw buffaloes and grizzly bears, and \"discovered under English auspices the country so strongly claimed by the North-westerners as theirs by discovery;\" not a word as to his coming upon a great sheet of water such as Lake Winnipeg. This vagueness is easily accounted for by the character of Kelsey's diary. (Report of committee on condition of countries adjoining Hudson's Bay, 1749.) He is in friendly pursuit of Indians wandering hither and thither in search of game. He gives no indication of the course he followed, whether it was south, west or northwest. The fights with grizzly bears prove that he travelled more or less towards the west, but are no proof that he went far south. \"The Assiniboine and Sioux country,\" two hundred years ago, reached nearly up to the shores of Hudson's Bay, and the Assiniboines in particular often traded with the forts near the Bay. The best argument, however, against Kelsey's having discovered any part of the present Province of Manitoba may be stated thus: He is acquainted with two species of the genus \"bos,\" one \"to the northward, with horns growing like an English ox,\" the other with \"black and short\" horns. But the only region where these two species were ever near one another lies west and north, not south of the Churchill River, from which Kelsey set out. As we know that there is but one kind of buffalo in this country, these two species can be no other than the musk-ox and the buffalo. Kelsey calls them both buffalo, a mistake which in those days was often made, and is the less surprising here, because his journal shows him to have been an ignorant, though painstaking and accurate young man. To anticipate the objection that buffaloes never wandered so far north, I may say that Archbishop Tache tells me it is only thirty years since he ate flesh of buffalo killed on the spot as far north as Athabasca Lake and the Great Slave River. Furthermore, though Kelsey walked some five hundred miles, he met with but one shallow river, less than 100 yards across, and a few ponds. Now, the only direction in which one can travel from the mouth of the Churchill and meet so little water, is west-north-west. The region between the Assiniboine and Hudson's Bay is the exact contrary, a network of rivers and lakes, the latter being sometimes very large. Very likely Kelsey tramped\nabout in every direction, as he was continually following erratic Indian parties, and several times he was in dire want of food, and had to go wherever game was to be had. But, if he kept to any general course, that course must have been to the west, and not to the south. The fact that Samuel Hearne, eighty years later, starting from the mouth of the Churchill in a northwest by west direction, met at first with the same general features, (clumps of poplar, ponds, scarcity of game) would seem to point to the same conclusion. Besides it was only natural that Hearne should attempt to be the continuator on a large scale of Kelsey's journeys, which, insignificant as they have turned out to be, yet marked an epoch in the chronicles of a company, whose chief factors, finding so few men disposed to travel into the interior, would be sure to make the most of Kelsey's exploits. At any rate it is physically impossible, from Kelsey's own boyish journal, that he could ever have explored the Winnipeg country.\n\nAs to the Ellis map, in which Dr. Bryce finds a \"striking confirmation\" and \"conclusive evidence\" of the Hudson's Bay Company's \"intimate knowledge of the interior,\" the arrangement of its lakes and rivers is ridiculous enough to have been drawn from the Indians' fanciful tales; far from \"indicating no knowledge of a route between Lake Superior and Lake of the Woods,\" the map shows a river reaching from the latter to within a hair's breadth of the former, so that the gap may be quite accidental, and, at all events, taken in connection with the general inaccuracy of the rest, does not furnish the ghost of an argument; and, finally, whatever in this odd little sketch map approaches the reality may very easily have been borrowed from La Verandrye's reports, because it was published fifteen years after his discoveries.\n\nTHE CAREER OF LA VERANDRYE.\n\nHow different is the first authentic record of an exploration here! Pierre Gaultier de Varennes, Sieur de La Verandrye, was born at Three Rivers on the 17th of Nov., 1685. His father, who was then governor of the town, had emigrated from France; but, as both his mother and maternal grandmother were Canadian born, he can surely be claimed as a native. He early embraced the profession of arms, and at 24 years of age he fought so bravely against the terrible Marlborough that he was left for dead on the bloody field of Malplaquet, pierced with nine wounds. He recovered, and, returning to Canada, he married in 1712 a Canadian lady, the daughter of the Seigneur of Ile Dupas. The four sons that were the fruit of this marriage ultimately joined their father in the Northwest. The great object of these explorations was what had been fermenting in the heads of all practical geographers during well nigh two centuries and a half, the finding a waterway to the Pacific Ocean. As a base of operations the government of New France had already several posts extended towards the West. One of these, on Lake Nipigon, north of the western extremity of Lake Superior, had been confided to La Verandrye. There he heard of a great river flowing into the \"Grand Ocean.\" The prevalence of such a groundless rumor north of Lake Superior shows that no white man had ever as yet been near the Red River Valley; else the French, who were all agog for the Northwest passage, would have been sure to hear of it, and would therefore have known that no river of the west, at least for a long distance beyond Lake Superior, emptied into the Pacific Ocean. But the rumor was there, and La Verandrye immediately communicated it to Father de Gonor, who, as every learned man of the time would have done, gladly clutched at the preferred hope, and persuaded de Beauharnois, the then Governor of Canada, to let La Verandrye have 60 men and a missionary. The brave soldier was poor and his only resource was the prospective profit of the fur trade, which proved to be more than precarious. However, nothing could damp his ardour. In 1731 he crossed Rainy Lake and built Fort St. Peter near where Fort Francis now stands, and in 1732 on the western shore of the Lake of the Woods he erected Fort St. Charles. In 1733 he paddled down the mouth of the Winnipeg River into the lake of that name. We read that, after he had crossed a portion of the lake, he ascended a river that empties into the lake and built a fort 15 miles from its mouth. A glance at the map shows that, besides the Winnipeg, no other river large enough to build a fort upon empties into this part of Lake Winnipeg except Red River. This fort must, then, have been somewhere in the neighborhood of Selkirk.\nMr. Bernier in the series of able articles he published last year in Le Manitoba gives the reasons why His Grace of St. Boniface thinks this was Fort Rouge. On the other hand your distinguished president, Dr. Bryce, in his valuable paper on the Five Forts of Winnipeg, reduces many technical points in favor of Fort Rouge having really been in that spot on the south bank of the Assiniboine, which is now called Fort Rouge. When doctors differ, what can amateurs like myself do, but wait for further developments? However, not to insist on the argument that formerly the Assiniboine was supposed to empty into Lake Winnipeg, while the Red River was merged in the Assiniboine where now stands this city of ours—an argument, the force of which Dr. Bryce must fully recognize, since he says in his \"Manitoba\" (p. 80): \"the explorers ascend from Lake Winnipeg the river of the Assiniboins, now the Red River, the name Assiniboine having been since confined to a branch entering the Red River some forty-five miles higher up—there is just one little point made by Dr. Bryce, as to which I would respectfully desist. Speaking of one of the maps which he has reproduced in his paper, your learned President says: \"We again notice on the site of Fort Rouge, a fort marked and described as 'Ancien Fort,' 15 or 17 years having sufficed to give it its antiquity.\" Now to me, who have spoken French from the cradle, \"ancien\" does not imply antiquity in this case; it simply means \"old\" in the sense of \"unused,\" \"no longer used as a fort,\" \"abandoned.\" For example, when the new college of St. Boniface was opened, the old building was immediately called \"le vieux\" or \"l'ancien college,\" and it would have borne that name even if it had existed only one year before it ceased to be used as a college. But, if \"ancien fort\" means a fort that was abandoned, then the reasons given by Mr. Bernier have their full weight in showing that LaVerandrye would not have abandoned such an advantageous position as that which the meeting of two rivers afforded, and therefore they would rather lead us to infer that the draughtsmen who sketched these maps from hearsay and at a distance, were not sufficiently accurate, an inference which the striking divergence between the two maps of 1740 and 1750 would tend to confirm. However this may be, certain it is that in 1738 La Verandrye's three sons, under instructions from their father, made their way up the Assiniboine, which was then called Assiniboilles, and built Fort de la Reine, which most people identify with Portage la Prairie. The five years since 1733 had been years of cruel grief and disappointment to La Verandrye. One of his sons had been killed by the Sioux; his funds were exhausted; the trade in furs did not prosper, because he could only make it a secondary object, exploration being the primary one; his men would not follow him; the king would not help him; and, meanwhile, he was harassed by government officials anxious for results, and by shareholders eager for the interest on their money. La Verandrye's only wealth was his fair fame, his hereditary ability, and the valor of his noble sons. On these he now determined to rest his hopes. I cannot detain you with the recital of all his efforts. Still, I must say a word about one expedition which has made two of his sons immortal. The eldest and another who was styled \"le chevalier,\" started with two other Canadians on the 29th of April, 1742. On New Year's Day of the following year they, the first among white men, sighted the eastern spurs of the Rocky Mountains of the North. Twelve days later they stood at the foot of these \"Montagnes de Pierres Brillantes,\" as they used to be called on account of the peculiarly dazzling sparkle of their summits in the sunlight. Here, alas! just when they expected now at length to catch a glimpse of the blue ocean from those dizzy heights, they were forced to turn back. The Bow Indians, who had volunteered to guide the four pale-faces to the land of the Serpent tribe, against whom the Bows were on the war-path, found the Serpent country abandoned, and, fancying that the Serpents had gone to the Bow country to massacre those that were left behind, they would not scale the mountains, and insisted on making haste homewards. Without guides the two La Verandryes and their companions were powerless. It is enough for our Canada that they reached the Rockies just 50 years before Sir Alex. Mackenzie and more than 60 years before the Americans, Lewis and Clark.\n\nThis discovery completed the occupation by France of all the north, the centre and west of this continent. It was a fit complement to the discoveries\nof Marquette and LaSalle and Jolliet, of Champlain and Druillettes and Dublon—for it was, as they had all been, made for no mere sordid motive of gain, but for glory, either temporal or eternal, and, like its predecessors, this discovery was made with next to no material resources. Tact, prudence, dauntless valor, straightforward friendliness to the Indian—these were the means used so successfully by the French and Canadian explorers. An American writer has noted the fact that the French missionaries had carried Christianity as far as Sault Ste. Marie five years before Elliot had spoken the good tidings to the Indians who were only six miles from Boston harbor. No doubt the Anglo Saxon race has since developed a wonderful spirit of enterprise; but it is always backed by plenty of money, and generally plenty of food. English exploring expeditions are the Nasmyth steam-hammer cracking a nut—a vast display of force, which must prevail; the French and Canadians in those days cracked the nut with nothing but their teeth; they faced journeys of thousands of miles amid unknown savages with nothing but what they carried in their hands or on their backs.\n\nTHE HUDSON BAY OFFICIALS.\n\nIt is this contrast which explains an otherwise inexplicable fact. How came it to pass that the Hudson's Bay Company waited more than an entire century before they attempted to penetrate into the Winnipeg basin? Doubtless the exploits of Iberville and the uncertain tenure of their forts for sixteen years afterwards must have kept them in hot water; but from the treaty of Utrecht in 1713 they were free, and yet their own chronicle of their first arrival in this Red River region places it eighty years later, in 1793, 123 years after the Charter. They certainly were most anxious to push far inland. There are a number of letters from the managers in England offering special rewards to those who should go into the interior. Despatches were transmitted from headquarters promising pensions to the widows of the men who might fall in such expeditions. Once in a while, at long intervals, some brave fellow of the Kelsey or Hearne stamp would turn up; but most of the company's men were like Sandford, of whom Sergeant, governor of Charlton Island writes in answer to a letter from London offering special bounties: \"Neither Sandford nor any of your servants will travel up the country, although your honors have earnestly desired it, and I pressed it upon (on the strength of) those proposals you have hinted (offers of large rewards).\" How can this supineness be explained? The answer, to my mind, is simple enough. The hum-drum and comfortable life in the forts naturally led to a rooted distaste for the discomforts, difficulties and dangers incident to a life of adventure, such as that which the Canadian voyageurs readily embraced. Some of these \"courreurs des bois,\" as I have already pointed out, seem to have traded near James Bay even before La Verendrye discovered the Winnipeg plains, and after he had explored this country, they were not slow to take advantage of this new field of operations. They were in friendly communication with the Indians. They treated them on a footing of equality. With that light-hearted bravery and cheerful fortitude which is so common among the descendants of the French they sought out the savage in his wigwam, they often spent the whole winter with him, bearing with all his rudeness and caprices, and winning their way to his heart before they asked for his furs. Sprung from a race which then was the acknowledged leader of European civilization, and which still is the cleverest and most versatile in the world, they carried with them an hereditary polish which had filtered down to the lowest strata of the Canadian people. Quick to learn the Indian languages and the tricks of Indian life, fertile in expedients, they were loyal and warm-hearted to the core. They were not mere calculating machines or animated money-bags. Instead of waiting for the savage they met him on his own ground and began by making him presents of trinkets and tobacco, and not till they had put him in good humor did they broach the question of trade. On the other hand, the Hudson's Bay men were utter strangers to the Indian and his mode of life. Far from daring to emulate the wonderful ascendancy the French had won over these fickle tribes, they kept themselves blockaded within their forts. They were like interlopers encamped in a hostile region. We have seen how Mr. Marest spoke of them in 1694 as good natured merchants who knew little or nothing of the value or use of firearms. They don't seem to have made much advance in the next fifty\nyears. From 1710 to 1750 the instructions from the head office repeatedly enjoin upon their chief factors to see that their men learn, from the Indians if necessary, how to kill the wild geese that flew over their forts in such immense flocks. The home authorities were at a loss to understand—and small wonder that they should be—how it was that the men could not shoot these birds.\n\nThe ease with which La Perouse captured the two forts, Prince of Wales and York, in 1782, shows how difficult it must have been to rouse the dormant spirit of the Hudson Bay officials. True, there were only 39 men in Prince of Wales fort; but they had 42 cannon and plenty of ammunition. They surrendered without a struggle, the British flag was lowered and a table cloth from the Governor's table hoisted in its stead. York Fort also capitulated without firing a gun, though a successful resistance might have been made against the French troops who were harassed with marching through thickets and bogs in which most of them had left their shoes. Meanwhile the company's ship, which was lying at anchor in the roads, prudently shaped her course for England, unperceived by the three French vessels. We are told that La Perouse's politeness, humanity and kindness won him the affection of all the company's officers, and helped to console the comfort-loving victims of this facile victory. The fact is the\n\nORGANIZATION OF THE COMPANY was too wooden, too much on the London counting-house plan. There was no spontaneity, no adjusting of means to an altered environment, nothing of what Mr. Parkman calls \"that pliant and plastic temper which (in the French) forms so marked a contrast to the stubborn spirit of the Englishman.\" (Conspiracy of Pontiac, vol I., p. 77.) With a view to isolating their officials, the company forbade their entering an Indian lodge. At least one man was flogged for lighting his pipe at an Indian's tent. The factors feared the interior as a land of unknown dangers. Terrible stories were circulated to keep up this fear of the Indians and of the French. Minute instructions were given to the men to protect themselves, especially in winter. Scouts were to reconnoitre every day, and, did they not return by night-fall, everything was to be get ready for a siege. At all times the cannons were to be in order, and all obstructions that might impede the view from the fort were to be cleared away. One of the governors, having kidnapped a young Indian, began to instruct him and to prepare him for baptism, hoping that he might one day be an ambassador to the tribes of the interior, and thus meet the wishes of the General Court in England. But as soon as the General Court got wind of this, it ordered the governor to take away the books from this little savage and let him grow up in ignorance. It would seem that the mounting wave of dread had crossed the Atlantic; that child one day might instruct his tribe and teach them to rise against the English in favor of the French. How seldom the Hudson Bay officials attempted any such conquests to the gospel may be gathered from a rather sly remark made by Matthew Serjeant, one of their employees. He says he has heard Indians pray in French but never in English. Once, seeing an Indian kneel down, he asked him why he did that. \"I don't know,\" was the answer, \"but some French traders who came here used to do so, and they told me that if I knelt down and raised my eyes to heaven every night, I should be saved from danger in the end.\" This same Matthew Serjeant's favorite methods are hardly commendable on the score of morality. \"In the opinion of the witness,\" we read in the report of 1749, \"if they would give to every Indian leader a gallon of brandy, and for every Indian of the nation of the Poets a gallon and a half, it would induce the nation to come down and consequently enlarge the trade.\" When the choice was to be made between two classes of men so diametrically different, it was only natural that the Indian determined to sell his furs to the French and Canadians who were near him, who were friends and brothers, rather than travel away up to the Hudson's Bay forts, there to be stiffly received by a man who spoke to him through a wicket, and whose manner seemed to say: Be off as soon as you have been fleeced. Some indeed of the Indians used to saunter into the shore-bound forts; but they were often dressed in French clothes, and they had, as a general rule, nothing but the refuse which the French would not take, or the skins that were too bulky for canoe transport. Year after year the General Court wrote urging upon the factors the need of\nother furs than beaver and otter, which were almost the only ones they could get. All the most valuable peltry passed through French hands.\n\nAFTER THE CONQUEST.\n\nWe have now reached the date of the English conquest of Canada. The next sixty years are replete with incident and adventure, into the details of which I would fain enter; but the limits of this lecture and of your patience, ladies and gentlemen, do not allow of my giving more than a few sketches of salient features in the history of the French element in the Northwest. I will therefore quote a brief summary of this period which I find in Capt. G. Mercer Adam's \"Canadian Northwest,\" published last year. Having shown how the Rocky Mountains, the Assiniboine and Saskatchewan districts, the Upper Mississippi and other parts of the continent had been covered by the operations of the French traders and discoverers, he adds: \"In short, the whole country was probed and made known to the outer world by the enterprise of the French and the French Canadians. As a consequence, any maps of the interior that were at all trustworthy were those of the French; the charts of the English, until long after the conquest, were ludicrously inaccurate. Hence the opposition to the assumptions of the Hudson's Bay Company, and the hostile rivalry which it engendered. After the conquest, it is true, the French for a time abandoned their western possessions; but the old trading habit returned, stimulated by the sturdy Scotch and the organization of the Canadian 'Nor'-Westers.' The French Canadian and the half-breed eagerly entered the employment of the Northwest Fur Company—which was \"entirely a Canadian venture, a private joint stock company, composed of French, Scottish, and, to some extent, half-breed traders, organized in 1783.\" While the H. B. shares sank very low, this new company was rapidly coining money. \"Long and unweariedly\" did the French Canadian and the half-breed work in its interests. \"For a time no other race or class of men could have been more serviceable to the company. They were insured against hardships; they were at home in the woods; their relations with the Indians were of the happiest; and they were never homesick, or out of humor with their surroundings. Furthermore, they were always loyal to the company.\" Here I beg to interpolate an important remark. In the long run the Northwest Company behaved in a most atrocious manner towards the Colonists. This seems to be the growing verdict of history. But to get to that verdict much evidence pro and con has to be weighed. A gentleman who has published interesting sketches of this period tells me that it took him years of research before he was convinced that, in the conflicts of the early part of this century the Nor-Westers were the chief offenders. Now, if the case is so intricate to one who studies it without prejudice or passion, the French Canadians cannot surely be blamed for their fidelity to the masters who were, of course, careful to give the deepest possible color of justice to their violent proceedings. Capt. Adams continues: \"With zest did they enter into the feuds between\n\nTHE N. W. CO.\n\nand its rival, the H. B. C., which had finally awakened from its lethargy\" \"and with equal zest did they take up their masters' unfortunate quarrel with Lord Selkirk and his colony. * * In these engagements forts were fired and fur depots destroyed. For a time hostilities were keen and continuous, and on both sides ruinous. Finally, the Hudson Bays and Nor-westers coalesced; and from 1821 the amalgamated corporations traded under the old English title and charter of the Hudson's Bay Company. This coalition of the Nor-Westers with its English rival gave great strength to the united company. It brought it an accession of capable traders and intelligent voyageurs and discoverers.\"\n\nA CRITICISM OF PARKMAN.\n\n\"Intelligent,\" \"capable,\" \"loyal,\" \"inured to hardships\"; these adjectives of Capt. Adam's sum up his view of the French element in the Northwest some 70 years ago. Mr. Parkman thinks differently. Contrasting the Canadian voyageur with the English colonist, that brilliant writer says: \"In every quality of efficiency and strength, the Canadian fell miserably below his rival; but in all that pleases the eye and interests the imagination, he far surpassed him. Buoyant and gay, like his ancestry of France, he made the frozen wilderness ring with merriment, answered the surly howling of the pine forest with peals of laughter, and warmed with revelry the groaning ice of the St. Lawrence. Careless and thoughtless he lived\nhappy in the midst of poverty, content if he could but gain the means to fill his tobacco pouch, and decorate the cap of his mistress with a ribbon.\" (Conspiracy of Pontiac, vol. I, p. 48.) And so on for page upon page, the picturesqueness increasing as the truth decreases. For Mr. Parkman belongs to a school of historians with whom truth is quite a secondary consideration. Gibbon with his pompous show of scholarly knowledge was their leader; Macaulay's neatly balanced sentence and startling antithetical effects made them popular; Froude's rich word-painting continued to share this popularity until he had the misfortune to drop down into the arena of living, present facts in his Oceana, when a New Zealander held him up to scorn as a describer of things that are not; and now Mr. Parkman's historical romances still are paramount among the profanum vulgus in America, though his second-rate poetical prose seems to have damaged him in England. Such histories are made to sell, and they do so remarkably well, even as regards those that buy them. The writers give plenty of facts; only they group them in their own way. Facts, no doubt, are the basis of history; but the truth of history depends on the way you see them. If I long to see a dear friend, it would be a mockery to show me his foot or his hand, or to let me see his face all blackened, scarred and begrimed. But the historical school I am speaking of does not hesitate to sacrifice facts themselves to the balance of a sentence or to the ideal consistency of the view they have evolved from their inner consciousness. They know that the vast majority of their readers being but half educated, will take it for granted that such fascinating descriptions must be correct. How could Mr. Parkman deny to the Canadian voyageurs efficiency and strength? We have seen that they were so efficient as to make the Northwest company a terror to the Hudson Bay Company; so strong as to be \"inured to hardships\" beyond any of their fellow-trappers. Owing to the French Canadian's persuasive ascendancy over the Indians, and to the general influence of the French element, the Northwest Company obliged all its servants to speak French, and, when it imported some lad from Scotland, it took care to make him learn the language in some priest's or farmer's house in Lower Canada. Hence it happened that, while the Hudson Bays were known as \"les Anglais,\" the North-westers were called \"les Francais.\" Either Mr. Parkman was not aware of these facts, and yet he is famous for his historical documents; or he has chuckled over his skill in patting a man on the back with one hand while he slaps him in the face with the other, and then we had better leave him to the judgment of posterity.\n\nBut there is one question on which no such remote decision need be waited for. Mr. Parkman gives his readers to understand that the number of French-Canadian half-breeds about the middle of last century was very considerable. \"The French,\" he says, \"became savages. Hundreds betook themselves to the forest never to return. These overflowings of French civilization were merged in the waste of barbarism, as a river is lost in the sands of the desert. The wandering Frenchman chose a wife or a concubine among his Indian friends: and, in a few generations, scarcely a tribe of the west was free from an infusion of Celtic blood.\" Conspiracy of Pontiac, Vol. I. p. 78. True to his pet process of generalizing widely from the most slender particulars, Mr. Parkman favors us with one word only that looks like something definite. He says \"hundreds\" of Frenchmen became savages and had half-breed children. Now \"hundreds\" must imply two or three hundred at least. True, this passage occurs in a chapter devoted to a general view of French, English and Indians during the century and a half between 1608 and 1763, and consequently the \"hundreds\" may be scattered over all this period of 155 years and over all the immense region then occupied by the French. If so, the general proposition that the French who lived with the Indians became savages themselves really means that those who did lapse into barbarism were proportionately very few, on an average about two every year in all the north, west and southwest of this continent; and this would be exactly the reverse of what the author sets himself to prove. Evidently this cannot be his meaning. The very next paragraph indicates that the North-west is the country he had specially in his mind; for it begins with these words: \"The fur trade engendered a peculiar class of men, known by the appropriate name of bush-rangers, or 'courreurs de bois.' * * * Many of\nthem, shaking loose every tie of blood and kindred, identified themselves with the Indians, and sank into utter barbarism.\" The collective term \"many,\" connected with the \"hundreds\" above, necessarily implies a large number, say a couple of hundred, who must have left at least as many half-breed families behind them. In the teeth of this fantastic estimate, I do not hesitate to affirm that neither Mr. Parkman nor anybody else can establish, even on probable grounds, the existence of ten French half-breed families in the Northwest in the middle of last century. At present I must rest with this categoric denial. The subject is too important to be handled without carefully collated statistics. These are accumulating in my hands, and will furnish matter at some future date for a paper in which I shall prove by facts and figures that the number of French half-breeds in the Northwest as late as the beginning of this century has been vastly exaggerated by the generality of historians.\n\nTHE VOYAGEURS' MORALITY.\n\nA word about the morality of the average Canadian \"voyageur des pays d'en haut.\" It were absurd to pretend that he was a saint. Far from it. All I do maintain is that he was certainly not more immoral, probably much less so, than traders of other nations, and that he did not give up his faith in Christianity. The proof of this last assertion is that when the Catholic Missionaries renewed in this century the hunt for savage souls which had been put short 45 years before by the suppression of the Society of Jesus, they found everywhere from St. Boniface to the McKenzie River, the seed of the faith sown in many Indian or half-breed families by the apparently reckless Canadian. Careless he may be about amassing a fortune—and who can prove that he is wrong if he sees no earthly utility and much unearthly danger in a life of anxious drudgery that ends in death?—but he is seldom careless about the main chance. Bishop Provencher used to tell the story of a man named Tourangeau, who had married a half-breed pagan of Lake Athabasca. Through a mistaken spirit of non-interference he had never spoken to her of religion. But one day she heard a man named Morin reading about hell from the New Testament, and making comments on what he read. She asked for further information, which so startled her that she could not sleep that night, and when her husband returned from a few days' hunt she begged him to tell her if he really had known all these years that there is a hell. \"Of course I knew it all along,\" said he, \"and it is to avoid that place that you see me pray morning and evening.\" She gave him no peace until he promised to take her to St. Boniface, where Monseigneur Provencher then was. Thus, thanks to the good words of Antoine Morin, who not only read his Bible but understood it, she and her husband travelled 1,800 miles that they might not be eternally lost.\n\nTHE FIRST WHITE WOMAN.\n\nMeanwhile an event had taken place which was to have a lasting influence on the French element in the Northwest. In the summer of 1806 the first white woman came to the Red River. Her husband, J. B. Lajimoniere, after five years spent in the Northwest, had returned to Maskinonge, in the Three Rivers district, to visit his family. There he fell in love with Marie Anne Gaboury and married her on the 21st of April, 1806. About a fortnight after the wedding, this brave Canadian woman consented to accompany her lord without any prospect of ever coming back. To an imagination that can reconstruct the status of this country eighty years ago, the first of her sex who thus went into lifelong exile is little, if at all, short of a heroine. Her adventures in the prairie whither she followed her husband for many years, her sterling piety throughout her whole life, her hair-breadth escapes from Indians, from a buffalo stampede, from Fort Douglas after the sanguinary conflict in which Gov. Semple and 20 of his men were killed, would furnish forth matter for a thrilling novel. Fr. Dagast's biography of Mme. Lajimoniere gives the unvarnished truth. I cannot dwell upon its chief points here. Suffice it to say that she lived till the age of 96 at St. Boniface, that her eldest daughter, Mme. Petrin, the first white woman born in this country, is still living and was eighty last Twelfth Night (1887), that there have come into the world 632 children, grandchildren, great grandchildren, and great-great-grandchildren of Madame Lajimoniere, that about 500 of these descendants are still living in Canada, and that most of the families sprung from her, number from 12 to 18 children each.\nOn Thursday, the 16th of July, 1818, Fathers Provencher and Dumoulin stepped out of a canoe in front of Fort Douglas. Mme. Lajimoniere, who for twelve years had not seen a priest, was beside herself with joy. All the Catholic colonists had long been looking forward to this first coming of the priests to settle here. Two days after their arrival the Catholic children under six years of age, to the number of about a hundred, received baptism, and, as Mme. Lajimoniere was the only baptized woman in the colony, she stood sponsor for them all; so that, for long years after, all the children used to call her \"Ma Marraine.\"\n\nFrom the arrival of Father Provencher dates the steady development of the French race throughout the Northwest. Now that there were priests in the land to administer the sacraments and say Mass, Canadian women were no longer afraid of bringing up their children in religious destitution. Any man with the sacerdotal character would have added to the colony this invaluable element of stability; but Father Provencher, who soon became Bishop Provencher, was no ordinary priest. There appeared in Le Manitoba of the 11th November, a letter of his that stamps him as one of those straightforward and intrepid heroes of humility whom the world—that world, I mean, which our Blessed Lord denounced—cannot understand. He was too honest and single-minded to be appreciated by the common run of pamphleteers who have prated of the Northwest. They have preferred to unite in what we may call a world-wide conspiracy of silence, which consists in quietly ignoring whatever makes against the writer's prejudices. But the wise men on the spot in those days have not chosen to remain unjustly silent. As Lord Selkirk was the first to propose and to bring about the establishment of the Catholic Mission here, so the Hudson Bay officials, following in the footsteps of their great chief, were, with few exceptions, most obliging and generous in helping the devoted priests. They spoke with the unmistakable testimony of gifts in hard cash. The Hon. Company, seeing the abject poverty of Bishop Provencher in those early years, gave him of their own accord, without any request on his part, £50 stg. a year from 1825 to 1835, and from this latter year till 1844, the date at which Bishop Provencher tells us this, they were making it a round hundred, and kept this up until his death. They also, quite unsolicited, contributed 200 pounds to the building of the old cathedral, while several of their officials privately contributed from £5 to £10 each. Sir George Simpson was the chief instigator of this enlightened charity, and he never wavered in his admiration of Mgr. Provencher. At the time of the latter's death he wrote to Mgr. Tache a letter of enthusiastic praise of the departed prelate, which is the more valuable because Sir George's temper of mind as well as his high station did not admit of his yielding to the influence of any ordinary embodiment of virtue. Thus did Sir George Simpson confirm the forecast made in 1821 by Mr. Halkett, Lord Selkirk's brother-in-law, and one of the principal agents of the Hudson Bay Company. This gentleman writes to the Archbishop of Quebec at a time when Fr. Provencher, who was then in the east, was hesitating to accept the episcopal dignity: \"Mr. Provencher's return to the Red River cannot but be of great importance to the general prosperity of the settlement; and no one is more fully sensible than I am of the good which has already arisen from the Roman Catholic mission.\" These blessings were to multiply during twenty-three years under fostering care of twelve secular priests, who nobly seconded their venerable chief; and then was to come the heroic age of the young Bishop Tache, of the Oblate Fathers, toiling in the wilds of the North and West as far as Edmonton, Athabasca and Fort Good Hope, on the Arctic Circle. Of this later period I cannot trust myself to speak, even had I not trespassed too far on your kindness. I can only say with reverent allusion: \"But the rest of all the acts of Alexander Antonine, and all his journeys and all that he did, and the souls that he and his brothers save, are they not written in the book of the 'Vingt-Années de Mission dans le Nordouest de l'Amérique?'\" Yes; all is there until 1865. For the twenty years since that date, who can tell the tale better than he?\n\nFRENCH CANADIANS NOT FOREIGNERS.\n\nTo speak of the living is a difficult and delicate task. Still, I feel bound to refer once more to His Grace of St. Boniface as a remarkable example of what this paper is meant to prove. You must have seen, ladies and gentlemen, that the drift of this imperfect sketch is to show\nthat the French Canadians were the first to take possession of this Great Lone Land, its best explorers, its most able trappers, and that they have multiplied exceedingly with very little immigration. Now to them who have been so long here, who have for generations looked upon this country as their home, who come from a stock which had become a nation before Irish, Scotch or English had made any notable settlement in the Province of Quebec, it was a cruel blow to be told, as they were told some time ago in the Manitoba Legislature, that they are \"foreigners.\" Foreigners, fersoonth! The consummate impudence of such a taunt hardly deserves an answer. But I will give one, and the answer will be the genealogy of a prelate of whom Manitoba is justly proud. Archbishop Taché is the great-grandson of the granddaughter of Jolliet, the discoverer, with Fr. Marquette, of the Mississippi; he is the great-grandson of the grand-niece, and also the great-great-grandson of the first cousin of La Verendrye, who was himself a Canadian born, and whose grandmother, Mgr. Taché's ancestor, was the first white woman born in Canada, more than 250 years ago. The Archbishop is, moreover, a descendant of the Martins, the Couillardes and the Hoberts of the same remote period. If he is a foreigner, where are your natives? Of course we do not all go back so far; but most of us can trace our French ancestry to long before the conquest. For instance, I am a descendant of Captain de St. Onra, who came to Canada with the Carignan regiment in 1665. All these facts are open to the public; they are to be found in Tanguay's Genealogical Directory, a work like ef which is not known in any other country of the world. Thanks to the Church's regularity in registering and keeping records of births, marriages and deaths long before the civil law came in to regulate vital statistics, every French Canadian family can trace its history to the first of its name that came to Canada.\n\nNo, we are not aliens or foreigners. Thirty years ago, we, who speak French, were called by everyone purely and simply \"Canadians;\" others were known as English, Scotch or Irish. Lately the fashion has grown up of calling others Canadians and distinguishing us as French. We are not purely and simply French, any more than Americans are Englishmen. If people don't choose to call us simply \"Canadians,\" though we are the original emigrants from Europe, then let them at least call us French Canadians. Doubtless we love what is lovable in our French ancestors; but we thank God that our race was planted here before the French manners were corrupted by the vices of the last century, and before the French mind was unsettled and dwarfed by the follies of the French Revolution. If France wishes to send us men of the lewd, half-monkey, half-demon type, such as those who are secretly misgoverning her at present, we beg of her to keep them at home. We are deeply grateful for the conquest, because it saved us from irreligion and from French radicalism.\n\nIn thus urging our right to be fairly treated, I am not, I trust, implying any dislike or disparagement of the other elements that make up our population. The spirit that makes a man to dislike another because his nationality is different, is just as odious to me in a French Canadian as in anyone else. I wish the Scotch and the Irish and the English to get the credit of all their good qualities; but I want them to respect the claims of others, too. By all means let each race cherish its traditions; only let us be careful not to attack one another. No race is faultless; but if each race admires in the other the qualities it lacks itself, we shall develop a true patriotic spirit that will blend us into one harmonious nation. Social contact and intermarriages between different races that are one in faith would tend to break down the barriers of unreasoning prejudice, and to make us\n\n\"Great hearts hold a people heart to heart.\"\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30251.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36980, "total-output-tokens": 15739, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1678, 3], [1678, 2784, 4], [2784, 3097, 5], [3097, 3619, 6], [3619, 7218, 7], [7218, 11910, 8], [11910, 17018, 9], [17018, 21745, 10], [21745, 26396, 11], [26396, 31014, 12], [31014, 35683, 13], [35683, 40357, 14], [40357, 44995, 15], [44995, 49592, 16], [49592, 54250, 17], [54250, 58865, 18], [58865, 63564, 19], [63564, 67527, 20], [67527, 67527, 21], [67527, 67527, 22]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]