[{"id": "990981e5cf97badd4540152d474960566bec7145", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- Coloured covers/Couverture de couleur\n- Covers damaged/Couverture endommagée\n- Covers restored and/or laminated/Couverture restaurée et/ou pelliculée\n- Cover title missing/Le titre de couverture manque\n- Coloured maps/Cartes géographiques en couleur\n- Coloured ink (i.e. other than blue or black)/Encre de couleur (i.e. autre que bleue ou noire)\n- Coloured plates and/or illustrations/Planches et/ou illustrations en couleur\n- Bound with other material/Relié avec d'autres documents\n- Tight binding may cause shadows or distortion along interior margin/La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- Coloured pages/Pages de couleur\n- Pages damaged/Pages endommagées\n- Pages restored and/or laminated/Pages restaurées et/ou pelliculées\n- Pages discoloured, stained or foxed/Pages décolorées, tachetées ou piquées\n- Pages detached/Pages détachées\n- Showthrough/Transparence\n- Quality of print varies/Qualité inégale de l'impression\n- Includes supplementary material/Comprend du matériel supplémentaire\n- Only edition available/Seule édition disponible\n- Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThe following items have been microfilmed at reduced size because of their condition or size.\n\nOriginal copies of documents and maps which are too large to be included in the above selection, may be microfilmed separately and will be available via TINUL. Maps often appear with different enlargements in the same selection. Additional comments should describe only the specific aspects of the item which require separate microfilming.\n\nMaps often appear with different enlargements in the same selection. Additional comments should describe only the specific aspects of the item which require separate microfilming.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol \\(\\rightarrow\\) (meaning \"CONTINUED\"), or the symbol \\(\\nabla\\) (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole \\(\\rightarrow\\) signifie \"À SUIVRE\", le symbole \\(\\nabla\\) signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nHUDSON'S BAY COMPANY.\n\nCOPIES of CORRESPONDENCE that has taken place between the Colonial Office and the Hudson's Bay Company or the Government of Canada, in consequence of the Report of the SELECT COMMITTEE on the AFFAIRS of the COMPANY, which sat in the last Session of Parliament.\n\n(Mr. Roebuck.)\nHUDSON'S BAY COMPANY.\n\nRETURN to an Address of the Honourable The House of Commons,\ndated 16 February 1858:—/for,\n\n\"Copies or Extracts of any Correspondence that has taken place between\nthe Colonial Office and the Hudson's Bay Company, or the Government of\nCanada, in consequence of the Report of the Select Committee on the\nAffairs of the Company which sat in the last Session of Parliament.\"\n\nColonial Office,\n22 February 1858.\n\nH. LABOUCHERE.\n\n(Mr. Roebuck.)\n\nOrdered, by The House of Commons, to be Printed,\n26 February 1858.\n| Number in Series | From Whom | Date       | Subject                                                                 |\n|-----------------|-----------|------------|------------------------------------------------------------------------|\n| 1               | Herman Merivale, Esq., to John Shepherd, Esq., Governor of the Hudson's Bay Company. | 20 January 1858 | -- Informing him of the Conditions on which Her Majesty's Government are prepared to advise Her Majesty to renew the existing Licence of the Hudson's Bay Company, for a further Term of Twenty-one Years from its approaching expiration, on the 30th May 1859 |\n| 2               | Herman Merivale, Esq., to John Shepherd, Esq., Governor of the Hudson's Bay Company. | 20 January     | -- Stating that it is the intention of Her Majesty's Government to advise the exercise of the power reserved to the Crown to Repurchase and take Vancouver's Island from the Hudson's Bay Company, and requesting that Her Majesty's Government may be furnished with a Statement of the Sums expended on the Island, for which the Directors may claim Repayment |\n| 3               | John Shepherd, Esq., to the Right Hon. H. Labouchere. | 21 January     | -- Conveying the acquiescence of the Directors in the Conditions laid down by Her Majesty's Government for the renewal of the existing Licence of the Company |\n| 4               | John Shepherd, Esq., to the Right Hon. H. Labouchere. | 21 January     | -- Acknowledging Mr. Merivale's Letter, informing him of the views of Her Majesty's Government in regard to Vancouver's Island, and adding that the required statement shall be prepared and transmitted as soon as possible |\n| 5               | The Right Hon. H. Labouchere to Governor-General Sir E. Head. | 22 January     | -- Enclosing copies of the preceding Correspondence for his consideration, and that of his Council, with General Remarks on the whole subject |\nCOPIES or EXTRACTS of any CORRESPONDENCE that has taken place between the Colonial Office and the Hudson's Bay Company, or the Government of Canada, in consequence of the REPORT of the SELECT COMMITTEE on the AFFAIRS of the COMPANY which sat in the last Session of Parliament.\n\n— No. 1. —\n\nCOPY of LETTER from Herman Merivale, Esq., to John Shepherd, Esq.\n\nSir,\n\nDowning-street, 20 January 1858.\n\n1. HER MAJESTY'S Government have had under their consideration your letter of the 22nd December 1856, containing an application on behalf of the Governor and Committee of the Hudson's Bay Company, for a renewal of their license for exclusive trading with the Indians in the north-western territories of America. They have also, since the receipt of that letter, paid full attention to the Report of the Select Committee of the House of Commons appointed during the last Session of Parliament, to consider the state of the British possessions under the administration of the Hudson's Bay Company. And I have now to acquaint you, by direction of Mr. Secretary Labouchere, with the result of their deliberations on the whole subject.\n\n2. They are disposed to advise Her Majesty to execute the powers vested in Her by the Act 1 & 2 Geo. 4, c. 66, by renewing the existing license of the Hudson's Bay Company for a further term of 21 years from its approaching expiration on the 30th May 1859, on the following conditions:\n\n3. The reservation, as in the present license, of any territories which may be formed by Her Majesty's Government into colonies.\n\n4. Vancouver's Island to be excepted from the license, as already constituted into a colony. On the subject of this island, I am to refer you to another letter, of even date herewith, in which the views of Her Majesty's Government in relation to it are communicated to you.\n\n5. I am further to state, that Her Majesty's Government consider it very desirable to ascertain, by the decision of some competent authority, the boundary between the province of Canada and the territories claimed by the Company under their charter. It has been suggested by Her Majesty's law advisers, that this might be effected through the intervention of the Judicial Committee of the Privy Council, on their being moved to entertain the question. You stated in your letter addressed to me on the 18th July last, that the directors of the Company were prepared to recommend to their shareholders a concurrence in this course. But I have no authority to state that the province of Canada is also prepared to concur in it, unless allowed at the same time to discuss the farther question of the validity of the charter itself, a question which, on public grounds, Her Majesty's Government do not consider themselves authorised to raise. If, therefore, any parties in Canada propose to take measures towards contesting the Company's rights to the full extent before a legal tribunal, Her Majesty's Government must leave them to take that course on their own responsibility. If, on the other hand, Canada thinks it expedient to agree to the course now proposed, namely, that of trying the question of boundary alone, with the consent of the Hudson's Bay Company, Her Majesty's Government will afford every facility in their power for its determination. It is therefore Mr. Labouchere's intention, in the first place, to submit this proposal to the option of the colony.\n\n6. But supposing that no such proceedings are taken, and that the colony declines to contest the naked question of boundary in the manner suggested, Mr. Labouchere is of opinion that the objects recommended by the Committee may be attained by another course. He will then be prepared to propose to\n\nCanada,\nCanada, and to the Company on the part of Her Majesty's Government, as a further condition for the renewal of the license, that the Company should surrender to the Crown such portions of the territory now claimed by it under the charter as may be available to, and required by Canada for purposes of settlement.\n\n7. It is stated in the Report that the districts likely to be required for early occupation are those on the Red River and Saskatchewan. If that should be the case, the portion of territory thus generally indicated should be rendered free for annexation to Canada. Such annexation to take place whether in this or any other direction, when Canada has made a road or other line of communication connecting the territory she requires; and when Canada has given satisfactory evidence of her intention to take steps for laying out townships and settling and administering the affairs of these districts. Thus the annexation might be gradual, in case it should be found to suit the convenience of the several parties interested.\n\n8. For the purpose of ascertaining the satisfactory performance by Canada of the terms thus required, the period when such annexation should consequently commence, and the manner in which it should be carried into execution, Mr. Labouchere would propose the appointment of a Board of three Commissioners, one to be nominated by the province of Canada, one by the Company, and one by Her Majesty's Government.\n\n9. The same Board should be authorized to consider and report on the following question; viz. the amount of pecuniary compensation which, under all the circumstances of the case, may become justly payable to the Company, in consequence of such contemplated annexation, and in respect of property which they may be required to surrender.\n\n10. The Commissioners should be instructed to dispose of further questions connected with the transfer which in the course of these proceedings it may appear desirable to refer to them.\n\n11. Her Majesty's Government have further to propose that, if it should at any time be made known to them that there is good reason to believe that mining operations or fisheries may be advantageously conducted in any portion of the territory held by the Hudson's Bay Company under their charter, facilities should be afforded to Her Majesty's subjects for engaging in those pursuits, within limited districts. For this purpose, it would be necessary that Her Majesty's Government should be authorized to grant licenses or leases, or in some other manner, which may be arranged by mutual consent, to place the parties engaging to prosecute such undertakings in possession of the land required for the purpose, any territorial rights of the Company notwithstanding. On the other hand, it should be fully understood that Her Majesty's Government will not grant any such facilities unless the parties applying for them give to Her Majesty's Government and the Company substantial proof of their competency, and of the bond fide nature of their intentions, nor unless proper security be taken against the interference of such parties with the fur trade of the Company with the Indians. The mode of carrying into execution these arrangements would be matter for subsequent consideration, if the Company should agree to the principles now suggested.\n\n12. If the Company should signify through yourself their willingness to consent to these proposals, Her Majesty's Government will proceed forthwith to submit them to the local Government of Canada for their consideration, and in the event of their concurrence, they will be prepared to take the necessary means for carrying them into effect.\n\nI have, &c.\n\n(signed) H. Merivale.\n\n— No. 2 —\n\nCopy of LETTER from Herman Merivale, Esq., to John Shepherd, Esq.\n\nSir,\n\nDowning-street, 20 January 1858.\n\nWith reference to my letter of this day's date, respecting the proposed renewal of the Hudson's Bay Company's license of trade in north-western America,\nAmerica, I am further directed by Mr. Labouchere to inform you that, in pursuance of the recommendation of the Committee of the House of Commons, referred to in that letter, it is the intention of Her Majesty's Government to advise the exercise of the power reserved to the Crown by the existing grant of Vancouver's Island, to repurchase and take that island from the Hudson's Bay Company, at the approaching expiration of the Company's present trading license, namely, on the 30th May 1859.\n\nI am therefore to request that the directors will, at their earliest convenience, furnish Her Majesty's Government with a statement of the sums for which they may claim repayment as \"laid out and expended by them in and upon the said island and premises, and as the value of their establishments, property and effects thereon,\" according to the terms of the grant.\n\nI am, &c.\n(signed) H. Merivale.\n\n— No. 3 —\n\nCOPY of LETTER from John Shepherd, Esq., to the Right Honourable H. Labouchere.\n\nSir,\n\nHudson's Bay House, 21 January 1858.\n\nI have the honour to acknowledge the receipt of Mr. Merivale's letter of the 20th instant, communicating the result of the consideration which Her Majesty's Government had given to my letter of the 22nd December 1856, and adverting to the full attention paid to the Report of the Select Committee of the House of Commons, which inquired last Session into the state of the British possessions under the administration of the Hudson's Bay Company, detailing the conditions on which Her Majesty's Government are prepared to advise Her Majesty to renew the existing license for a further term of 21 years, and informing me, that if the Company should signify their willingness to consent to these proposals, Her Majesty's Government will proceed forthwith to submit them to the local Government of Canada for their consideration, and, in the event of their concurrence, will be prepared to take the necessary measures for carrying them into effect.\n\nIn reply, I beg leave to state that, after full consideration with my colleagues in the direction, we shall be prepared to recommend to our proprietary body—\n\n1st. To agree to the reservation, as in the present license, of any territories which may be formed by Her Majesty's Government into colonies.\n\n2d. To agree to the proposed exception of Vancouver's Island from the license; and, upon this subject, we beg to refer you to the answer to the communication which you have forwarded to us, conveying the views of Her Majesty's Government in relation thereto.\n\n3d. We concur in your suggestion, that in the event of the Government of Canada declining to be a party to the proposed reference of the boundary question to the Judicial Committee of the Privy Council, upon the footing which Her Majesty's Government are prepared to recommend, and which this Company has already expressed their willingness to adopt, the objects recommended by the Committee of the House of Commons may be attained by another course, the detailed arrangements of which should be carried out under the supervision of three Commissioners, one to be appointed by the Crown, one by the Canadian Government, and one by the Hudson's Bay Company.\n\nI trust that the ready acquiescence of the Hudson's Bay Company in the plan proposed for meeting the requirements of the Canadian Government will be accepted as an earnest of their desire to be on terms of harmony and friendship with their countrymen in Canada.\n\n4th. In communicating this assent on the part of the Hudson's Bay Company, it is, however, right to notice that the territories mentioned as those that may probably be first desired by the Government of Canada, namely, the Red River and Saskatchewan districts, are not only valuable to the Hudson's Bay Company as stations for carrying on the fur trade, but that they are also of peculiar\npeculiar value to the Company as being the only source from which the Company's annual stock of provisions is drawn, particularly the staple article of pemican, a regular supply of which is absolutely necessary to enable the officers of the Company to transport their goods to the numerous inland and distant stations, and to feed and maintain the people, both European and Indian, stationed thereat. It is proper, therefore, that I should draw your attention to the fact, that the ultimate loss of these districts will most probably involve the Hudson's Bay Company in very serious difficulties, and cause a great increase of expense in conducting their trade. The Company assume that the Canadian Government will be responsible for the preservation of peace and the maintenance of law and order in all the territories ceded to them, and that they will prevent lawless and dishonest adventurers from infringing from thence the rights of the Company over the remaining portions of their territories.\n\n5th. With respect to the 11th paragraph of your letter, in which it is proposed that Her Majesty's Government should be authorized at any time to grant licenses or leases, or in some other manner which may be arranged by mutual consent, to place parties engaging to prosecute mining operations or fisheries in possession of the land required in any portion of our territory for the purpose, any territorial rights of the Company notwithstanding: assuming that the principles stated in the 9th paragraph as applicable to cessions to Canada apply equally to any cessions which may take place in virtue of this 11th clause, I beg to state that we shall be prepared to recommend our shareholders to concur in this proposal.\n\n6th. In conclusion, allow me to refer to the sentiments expressed in the fifth and last paragraphs of my letter of the 18th July last, as explanatory of the continued views of myself and colleagues. We are willing to enter upon a new tenure of our engagements under the renewed license, upon being assured of the support of Her Majesty's Government, and of the cordial co-operation of the neighbouring Government of Canada, in maintaining tranquillity and order among the Indian tribes, and protecting the frontiers of the whole adjacent British territories from foreign encroachment.\n\nThe interests of the Hudson's Bay Company, we are convinced, are closely united with the real prosperity of Canada, and we trust that the humane and beneficent objects of Her Majesty's Government will prosper under our united exertions.\n\nI have, &c.\n(signed) John Shepherd, Governor.\n\n— No. 4. —\n\nCOPY of LETTER from John Shepherd, Esq., to the Right Honourable H. Labouchere.\n\nSir,\n\nHudson's Bay House, 21 January 1858.\n\nI have the honour to acknowledge the receipt of Mr. Merivale's letter of yesterday's date, communicating the intention of Her Majesty's Government in reference to Vancouver's Island colony; and, in accordance with your request, a statement of the sums for which the Hudson's Bay Company may claim repayment according to the terms of the grant, will be prepared and transmitted as soon as possible.\n\nI have, &c.\n(signed) John Shepherd, Governor.\n\n— No. 5. —\n\nCOPY of DESPATCH from the Right Honourable H. Labouchere to Governor-General Sir Edmund Head.\n\nSir,\n\nDowning-street, 22 January 1858.\n\nIn sending for your consideration and that of your Council a correspondence which has recently passed between the Directors of the Hudson's Bay Company and\nand this department, on the subjects embraced by the investigation of a Committee of the House of Commons in the last year's Session of Parliament, it is not necessary that I should add much to the information which that correspondence conveys.\n\nThe relations in which the Company is placed both towards Canada and towards Her Majesty's Government in this country, have naturally attracted, in no common degree, the attention of the Canadian community; and they were also carefully investigated by the Committee to which I have referred.\n\nIt is the anxious desire of Her Majesty's Government to take the opportunity afforded by the approaching termination of the Company's license of exclusive trade over what is termed the Indian territory, for placing these relations upon such a footing as shall be consonant with justice, and at the same time conducive to the satisfaction and to the interests of the great Province under your Government.\n\nIt is for the purpose of promoting these objects that I have carried on the correspondence which I now transmit to you. And I make no question but that it will be considered in a similar spirit by the Legislature and people of Canada.\n\nI do not propose to discuss the question of the validity of the claims of the Company in virtue of their charter over the whole territory known as Rupert's Land. Her Majesty's Government have come to the conclusion that it would be impossible for them to institute proceedings with a view to raise this question before a legal tribunal without departing from those principles of equity by which their conduct ought to be guided. If, therefore, it is to be raised at all, it must be by other parties on their own responsibility.\n\nWith regard to the question of boundary, as distinguished from that of the validity of the charter, Her Majesty's Government are anxious to afford every facility towards its solution—a mode of accomplishing which is indicated in the correspondence—if such should be the desire of Canada.\n\nBut I trust that in any case a machinery may be provided, through the course now proposed, which will afford to Canada the means of obtaining any districts which she may require for the purposes of settlement, and to which she may be able to afford the benefits of administration and protection. The tracts claimed by the Company under its charter are conterminous on the north and west with the whole of that great Province which is now united under your Government. I therefore look to the gradual aggregation of such portions of those tracts as may be found available to that Province which contains within its limits the noble water communication afforded by the Lakes and the St. Lawrence to the Atlantic.\n\nI recommend this important subject to the early consideration of yourself and your advisers.\n\nHer Majesty's Government can have no other wish regarding it than, consistently with the principles of good faith, to promote the prosperity and consult the feelings of the people of Canada in this matter, as well as to provide for the security of law and order in those vast regions, in the maintenance of which Canada has herself so deep an interest.\n\nI have, &c.\n\n(signed) H. Labouchere.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_38282.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 14, "total-input-tokens": 23470, "total-output-tokens": 6159, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3318, 3], [3318, 5889, 4], [5889, 5889, 5], [5889, 6189, 6], [6189, 6719, 7], [6719, 8634, 8], [8634, 12332, 9], [12332, 16300, 10], [16300, 20148, 11], [20148, 23627, 12], [23627, 26822, 13], [26822, 26822, 14]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, true, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, true]}}]