[{"id": "08ee230f8a429a8f70f83d6e0784adc77075d9ab", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below:\n\n| Reduction Ratio |\n|-----------------|\n| 10X             |\n| 12X             |\n| 14X             |\n| 16X             |\n| 18X             |\n| 20X             |\n| 22X             |\n| 24X             |\n| 26X             |\n| 28X             |\n| 30X             |\n| 32X             |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"A SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, pianches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nJAMES McGILL\nAND THE ORIGIN OF HIS UNIVERSITY.\n\nBY J. W. DAWSON, LL.D., F.R.S., F.G.S.\n\nCondensed from papers in Barnard's American Journal of Education, 1859,\nand The Dominion Monthly, 1870.\n\nIn young and progressive communities, the demands which material things make on the capital and labor of the people are too great to permit much to be done for the cause of literary and scientific culture. Hence, in the neighboring States of the Union, though a few great foundations, like those of Harvard and Yale, date from an early period, the tide of financial prosperity has only recently set in the direction of the Colleges, and no previous period of similar length can, like the last five years, boast of fifteen million of dollars given to educational institutions. In Canada the stream of this liberality has scarcely begun to flow, and the name which stands at the head of this article is still almost alone in its eminence in this respect. It is, on this account, all the more to be honored, more especially since McGill bequest can be shown to constitute the real centre and rallying point of English education in the Province of Quebec during the last half century.\n\nJames McGill was born on the 6th October, 1744, in Glasgow, Scotland. He received his early training and education in that country, but of these little is known. He arrived in Canada before the American revolution, and appears, in the first place, to have engaged in the North-west fur trade, then one of the leading branches of business in Canada. Subsequently he settled in Montreal, and, in partnership with his brother, Andrew McGill, became one of the leading merchants in the little town of about nine thousand inhabitants which then represented our commercial metropolis. His settlement in Montreal and his marriage with a lady of French parentage, the\nwidow of a Canadian gentleman, occurred a little before the beginning of this century; and from that time till his death in December, 1813, he continued to be a prominent citizen of Montreal, diligent and prosperous in his business, frank and social in his habits, and distinguished for public spirit and exertion for the advancement of the city. His name appears in several commissions relating to city matters—for instance, that for removing the old walls of Montreal. He was Lieutenant-Colonel and subsequently Colonel of the Montreal City Militia; and in his old age, on the breaking out of the American war of 1812, he became Brigadier-General, and was prepared in that capacity to take the field in defence of his country. He represented for many years the West Ward of Montreal in the Provincial Legislature, and was afterwards a member of the Legislative and Executive Councils.\n\nMr. McGill is described by his contemporaries as a man of tall and commanding figure—in his youth a very handsome man, but becoming corpulent in his old age. He was a prominent member of the association of fur magnates known as the \"Beaver Club.\" A reminiscence of a gentleman, then resident in Montreal,* represents him, when a very old man, at one of the meetings singing a voyageur's song with accurate ear and sonorous voice, and imitating, paddle in hand, the action of the bow-man of a \"North canoe\" in ascending a rapid. But though taking his full share in the somewhat jovial social life of that early time, Mr. McGill was always esteemed a temperate man. The remembrance of another contemporary represents him as much given to reading and full of varied information; and it is certain that he cultivated and enjoyed the society of the few men of learning from the mother country then in the colony. There are, indeed, good reasons to believe that his conferences with these gentlemen had an important influence in suggesting the subsequent disposal of a large part of his fortune in aid of education. In this connection it may be stated that Mr. McGill's resolution to dispose of his property in this way was not a hasty death-bed resolve, but a mature and deliberate decision. He had taken a lively interest in the measures then before the Government for the establishment of an educational system in the Province of Quebec, and had mentioned, many years before his death, his intention to give, during his lifetime,\n\n* Mr. Henderson, of Hemison, to whom I am indebted for several other facts.\na sum of twenty thousand dollars in aid of a college, if these measures should be carried out by the Government. But many delays occurred. From 1802, when the act to establish the \"Board of Royal Institution for the Advancement of Learning\" was passed, until the time of Mr. McGill's death, the persistent opposition on the part of the leaders of one section of the people to any system of governmental education, and the apathy of some of the members of the Council, had prevented the appointment of the Board, or the completion of the liberal grants of land and money for educational purposes which had been promised. Mr. McGill was apparently weary of these delays, and feared that he might be cut off by death before he could realize his intentions. He had also the sagacity to foresee that a private endowment might force the reluctant or tardy hands of the members of Government to action. Accordingly, in his will, prepared in 1811, more than two years before his death, which took place on Dec. 19, 1813, he bequeathed his property of Burnside, and a sum of ten thousand pounds in money, to found a college in the contemplated Provincial University, under the management of the Board of Royal Institution; but on condition that such college and university should be established within ten years of his decease. Three leading citizens of Montreal, the Honorable James Richardson, James Reid, Esq., and James Dunlop, Esq., and the Rev. John Strachan, afterwards Bishop of Toronto, were appointed trustees under the will.\n\nThe wise liberality of a good man is often far more fruitful than he could have anticipated. Mr. McGill merely expressed a wish to found a college in connection with a university already provided by the generosity of the British Government; but governments in those days were as weak-kneed in the cause of true progress as they still are. The grants to found a university and public schools were not given; and, in deference to the claims of the Roman Catholic priesthood to control the education of the country, the English settlers in the Province of Quebec were deprived of the provisions for education made by the liberality of the Crown in other colonies. In the providence of God, Mr. McGill's bequest came in to avert some, at least, of the evils arising from this failure. In consequence of his will, a pressure was brought to bear on the Government, which resulted in the appointment of the Board of Royal Institution in 1818; and\nthough, from the ecclesiastical opposition to the plan, the Board was almost entirely English and Protestant in its composition, it proceeded to the establishment of non-denominational schools. These schools were never very numerous—about eighty being the maximum number; but they formed the beginning of the present school system. The Royal Institution, being a Government Board, had, on that account, too little of the popular sympathy, especially among the settlers in the Eastern Townships; and the Local Legislature practically refused to acknowledge it, and set up in opposition to it the denominational system of \"Fabrique schools\" in the French parishes; and, finally, its functions were restricted to the McGill College alone, by the new educational act which followed the rebellion of 1837.\n\nIn so far as the McGill College was concerned, the Royal Institution at once took action by applying for a royal charter, which was granted in 1729, and prepared to take possession of the estate. This, however, owing to litigation as to the will, was not surrendered to them till 1829. They also demanded the grants of land which had been promised, and received fresh assurances; and, as an earnest of their fulfillment, the Government of the day was authorized to erect a building for McGill College, and to defray the expenses out of the \"Jesuit's estates.\" But the hopes thus held out proved illusory, and the college buildings had to be begun with the money left by Mr. McGill, and were at length completed only by the liberality of another citizen of Montreal, Mr. W. Molson.\n\nIn the year of Mr. McGill's death, the population of Montreal was scarcely 15,000; and of these a very small minority were English. One-third of the houses were wooden huts, and the extent of the foreign trade may be measured by the nine ships from the sea, of an aggregate of 1589 tons, reported as entered in the year 1813. The whole English population of Lower Canada was very trifling. There was no school system, and there were no schools, with the exception of the seminaries of the Church of Rome, and a few private adventure schools. It seems strange that, in such a condition of affairs, the idea of a University for Montreal should have occurred to a man apparently engaged in business and in public affairs. Two circumstances may be mentioned in explanation of this. The first is the long agitation on the part of some of the more enlightened of the English Colonists\nin behalf of the establishment or a university and a system of schools. As early as 1787 the Legislative Council had taken action on the matter, and had prepared a scheme, which was, according to the testimony of the Abbé Ferland, in his life of Bishop Du Plessis, \"strangled in its cradle\" by the Bishop and seminary of Quebec, in a remonstrance written by Du Plessis. In 1801, the infant project was revived, and the act for the establishment of the Royal Institution was passed; but the new scheme was for the time foiled by the refusal of the Roman Catholic clergy to act on the Board; so that, as another learned priest, M. Langevin, informs us in his \"Cours de Pedagogie,\" it was without result, \"thanks to the energetic vigilance of the Roman Catholic clergy.\" Mr. McGill was familiar with these movements, and no doubt was equally disgusted with the \"energetic vigilance\" above referred to, and the cowardly submission of the government in giving way to such opposition. He knew all that colleges and a school system had done for his native country, and that the absence of such a system from this Province would involve semi-barbarism, leading to poverty, discontent, superstition, irreligion, and a possible war of races. In so far as these evils have been averted from Lower Canada, he has certainly contributed to the result more than any other man of his time.\n\nA second circumstance which may have aided Mr. McGill in his resolve, was of a different character. In 1797, Gen. Simcoe, the first Governor of Upper Canada, and his Executive Council, had decided to establish a seminary of higher learning in that Province. They had invited Mr. Strachan, a graduate of St. Andrew's, to organize this institution. He arrived early in 1799, but only to find that his patron, Gen. Simcoe, had been removed, and that the plan had fallen to the ground. Greatly disappointed by this, Mr. Strachan opened a school in Kingston, and subsequently occupied as a clergyman of the Church of England, the Mission of Cornwall, and commenced the grammar school at that place, where many men subsequently of note in Upper Canada were educated. A year before McGill's death, Strachan was transferred to Toronto, of which diocese he was afterwards the Bishop. He was an intimate friend of Mr. McGill and connected with him by marriage, his wife being the widow of Mr. McGill's brother. Besides this the young scholar who had come to Canada with such bright hopes of educational usefulness,\ndestined for the time to be disappointed, and the wealthy citizen meditating how best to disarm the opposition which had so long deprived Lower Canada of the benefits of education, had much in common. It seems at least highly probable that Strachan had a large share in giving to Mr. McGill's wishes the form which they afterwards assumed, and there are some reasons for believing that Mr. McGill had hoped that his college might have attracted to it the abilities of the young teacher who seemed slighted in Upper Canada. It is also known that, in the first attempt to organize McGill University in 1823, Strachan was invited to a professorship; but the career opening to him in Upper Canada was already too tempting to permit him to aid in this way the project of his old friend.\n\nUnder its Royal charter, and having obtained possession of the McGill estate, and with large promises of public aid, the college entered on its existence with much apparent vigor and promise of success. The opening ceremony was held in Burnside House, the former residence of the founder, in 1829, and was largely attended. The inaugural addresses of the principal and other officers, were characterized by a broad and liberal spirit and practical good sense, which augered well for the success of the infant institution. The Faculty of Arts, as organized on this occasion, consisted of the principal and two professors; and on the day of the inauguration an important addition was made to the university, by the union with it of the Montreal Medical Institute, as its faculty of medicine. This institution had already four professors and an established reputation.\n\nAs might have been anticipated, from the fortunes of similar efforts elsewhere, the prospects of the young university were soon overcast, and it had to struggle through a long period of difficulty and danger. Mr. McGill had given his endowment under the expectation that, in accordance with the provisions of an act passed several years before his decease, and in the preparation of which he no doubt had a part, large grants of public land would have been placed at the disposal of the Royal Institution to supplement his bequest, as well as to provide for the general interests of education. This, however, the legislature failed to do, and for a long time the McGill endowment constituted the only source of revenue to the university. Nor has this failure been fully remedied up to the present time. While the legislatures of the neighboring provinces of Upper\nCanada and New Brunswick have, without any aid from private benefactors, bestowed large permanent endowments on provincial universities; Lower Canada has allowed McGill College to struggle on unaided save by precarious annual grants, burdened with a large number of government scholarships; and even these grants have, in great part, been given only within the last few years, when the increasing importance of the institution forced its claims on the government. Probably in no other part of America would a benefaction so munificent have been so little appreciated; and the reason is to be found not in any indifference to education, but in the numerical weakness of the British and Protestant population of the province, for whom the university was chiefly designed; and in those divisions of race and creed which have hitherto operated as barriers to vigorous and united action in behalf of education in Lower Canada. Left to its own resources the governing body found it necessary to expend a large portion of the available means of the university in buildings, and were unable at that early period to obtain from the landed property any considerable amount of annual income. The charter also had many defects, and was also too cumbrous for the management of an infant institution in a colony. These disadvantages, and the errors of judgment, and differences of opinion, inevitable in a new educational experiment in untried circumstances, long rendered the efforts of the Royal Institution and the Board of Governors of little avail; and for more than twenty years the university lingered on with little real growth, though, during a part of this period, it was attended by what, for the time, might be regarded as a respectable number of students in arts; and the Medical Faculty continued to maintain its reputation, and to increase its classes.\n\nFor a long time the languishing condition of the university was a subject of deep regret and uneasiness to the friends of education in Montreal, many of whom were earnestly desirous for its revival, and fully impressed with the importance of the public benefits which might result from an efficient college; but there appeared to be no practicable means of elevating it, under the existing charter and with it a want of sufficient revenue.\n\nAt length, in 1850, a number of gentlemen, resident in Montreal, determined to grapple with these difficulties. The character and result of their efforts may be learned from the following statements\nby Hon. Justice Day, LL.D., one of their number, and now president of the board of governors, in an address to His Excellency Sir Edmund W. Head, on occasion of his presiding as visitor at the inauguration of Burnside Hall:\n\nThe utterly prostrate condition of the university at length attracted attention, and, in 1850, the provincial government was moved by a number of public spirited gentlemen to aid in an endeavour to place it on a better footing. As a strong antagonism has always existed between the royal institution and the majority of the governors of the college upon subjects essentially affecting its conduct and prosperity, it was deemed advisable, as a first step, to reconstruct the board of the former corporation. New appointments were therefore made to the royal institution, of persons selected on the score of their interest in the cause of education. Of these, several entered upon the duties of their office with zeal and energy. They drew up an elaborate report on the condition of the university, and the course which they thought should be followed for its amelioration, and their recommendations were made the basis of all that has since been done. A draft of a new charter was prepared, which was finally adopted, and executed by Her Majesty in 1852; and thus the college, by its improved constitution, was placed in a position to be revived, and to enter upon a new and useful career. The new charter was received in August, 1852; its most prominent and important provision is that by which the members of the royal institution are made governors ex-officio of the university. This provision, vesting the whole power and control of the two corporations in the same hands, removes all possibility of the recurrence of the difficulties which prevailed under the old system. Before the arrival of the charter in this province, a full board of managers of the royal institution, ten in number, had been constituted. Immediately upon its reception, the governors began the labors of their trust. There was a great deal to undo, and much to build up. The college was involved in great pecuniary embarrassment, chiefly from the accumulation of arrears of the salaries of its officers; and its income fell far short of its current expenditure. The college buildings were incomplete; and, from their situation and construction, so ill-adapted for their intended purposes that it became at once evident that a new building must be erected. As to its character and usefulness in the business of instruction, it had none. In so far, then, as the state of the university was concerned, the prospect was sufficiently discouraging; but the governors possessed certain extrinsic advantages, which justified a hope of success. The provincial government was favorably disposed to aid them in their undertaking: and there seemed to be abroad a general feeling of approbation of the choice made of the persons to constitute the board, and of confidence in their earnest endeavor to discharge the duties of their trust efficiently. The first step taken was, at once to stop all useless expense. The only salary continued was one of small amount to the vice-principal, which was necessary, in order to prevent the college doors\nfrom being closed. A law was obtained modifying the statute of 1804, under which the royal institution was erected, and introducing a more simple and convenient machinery for the exercise of its powers; and authority was also taken to sell such portions of the real estate bequeathed by Mr. McGill as the governors might deem advisable, for a perpetual ground rent, with permission to mortgage the college property in security for a loan to the amount of £3,000. Under the sanction of this law, sales have been effected of a sufficient extent of the college lands to yield, when added to the former income, a revenue of £900. Application was also made to the legislature for pecuniary aid, and the sum of £1,300 was granted; £1,000 to be applied toward the payment of the debts of the college, and £300 to meet its annual outlay. This sum, although far below what was necessary to place the institution in the position which the governors wished, was nevertheless of great assistance in diminishing its liabilities nearly one-half. It also enabled them to make arrangements for avoiding immediate pressure, and gave an opportunity to begin the work of providing an efficient and liberal course of instruction. With a view to that end, the statutes of the university were completely recast, in a manner to introduce a more simple administration, and absolutely to do away with all religious tests and privileges.\n\nIn the year 1854, an urgent appeal was made to the provincial government, setting forth at length strong grounds of a claim for liberal pecuniary assistance. The memorial then presented showed that the university could not be organized and maintained upon any proper footing of efficiency unless a grant of at least £4,000 were made toward the reduction of its debts, and £1,000 given annually, to aid in defraying current expenditure. In the following year the application was renewed. The result was partially successful. It is due to the head of the government and gentlemen who composed the provincial ministry at that time, to say that a friendly interest was manifested by them in our efforts, and every disposition shewn to extend to us all the aid which circumstances permitted them to bestow. The sums received were, however, very much less than those specified, and they were inadequate to the necessities of the institution, and the importance and magnitude of the objects to be accomplished. The governors continued nevertheless to advance the course originally determined upon, of modifying and enlarging the system of education in the university, and they have gone on, until it has attained a completeness for which three years ago they had scarcely dared to hope.\n\nAs reorganized, under its amended charter, the university rests on the broad basis of British protestantism, without sectarianism; and endeavors to embrace within itself all the elements of a collegiate and professional education, on the methods of the British universities, but modified with especial reference to the condition and requirements of the people of Canada.\nIt appears from the above statement of the history of the university, that its present prosperity dates from its reorganization under its new charter in 1852. The contrast between that time and the present is sufficiently striking. In 1851, the committee of the royal institution reported that the buildings were unfinished and threatening to fall into decay; the grounds were uninclosed and used as a common. The classes in art contained only six students. Even the students in medicine, owing to the establishment of a rival school, had fallen off to thirty-six. Only one course of law had been delivered in connection with the university. It had no preparatory school. Its total income was estimated at £540 per annum, while the expenditure, even with the small staff then employed, amounted to £792. There was consequently a large and increasing debt. The medical faculty was self-supporting, and maintained a high reputation. The faculty of arts was sustained solely by the exertions of the vice-principal.\n\nIn 1859, the university presented a different picture. Its original buildings were still unfinished, but were kept in use and in repair, and others more suitable to the present wants of the university had been added. Its grounds were inclosed and improved. Its faculties were fully organized and largely attended by students. It had a flourishing preparatory school,* and affiliated normal and model schools. Its revenues from property and fees of tuition had been increased more than tenfold. A library, apparatus, and collections in natural history had been accumulated. It had a staff of thirty-two professors and regular teachers, and more than two hundred regular students. This great expansion was achieved in seven years, by the ability and energy of the governing body, and by the liberality of the citizens of Montreal, sparingly assisted by public grants; but the university was then still in its infancy, and its subsequent growth has fulfilled this early promise.\n\nI have avoided dwelling on the early history of the university in detail. Its struggles and its failures are profitable now only for the lessons that they teach. But in this point of view they are not unimportant. The questions then agitated respecting the religious character of the university—the best method for its establishment, whether by commencing with a preparatory school or by organizing a colle-\n\n* Since transferred to the Protestant Commissioners of Schools.\ngiate faculty or faculties as an initial step—the policy of erecting expensive and imposing buildings, or of waiting until the staff of the college should be efficiently organized—the proper form and constitution of the governing body—were all of vast importance, and all of such a character, that gentlemen interested in education, and regarding the subject from different points of view, might be expected, previous to experience, to answer them differently. They were here, as in most similar cases, slowly and painfully worked out by long discussion; and the present position of the university owes much of its stability to the fact that the ground has been prepared by this long conflict of opinion.\n\nWith respect to its religious aspect and its form of government, it is remarkable that this university has, as the result of these controversies and experiences, arrived at a position not precisely identical with that of any similar institution in British America. Two of our universities, that of Toronto, and that of King's College, New Brunswick, are altogether national in their character. The others are all connected with special ecclesiastical bodies. McGill College occupies an intermediate position. Under the control of no particular church, and perfectly open in the offer of its benefits to all, it is recognized as an institution concentrating the support of all the Protestant denominations, and representing their common views as to the nature of the higher education. I confess that on many grounds I prefer this basis, both to those that are narrower and those that are wider. It is exempt from the contracting influence and limitation of field incident to the former, and from the opposing opinions and interests that are so liable to clash in the latter; and it is especially suited to the present condition of society in Lower Canada, where the Protestant minority is united on this subject by being imbedded in a Roman Catholic population, which provides for its own educational wants on its own principles.\n\nThe form of government of this university is another result of long trial of an imperfect system. The Governor-General of Canada is Visitor of the University on behalf of the Crown. The management of its financial affairs by a resident body of educated and business men, who have associated with them, in the more purely educational business, representatives of all the faculties and departments and affiliated institutions and also of the body of graduates, affords a\nstable and efficient ruling body, exempt on the one hand from the deficiency of business talent often so conspicuous when merely college men rule, and from the injudicious despotism sometimes practiced by public boards, when freed from college influence. No better system could be devised, in the present circumstances of the university, for avoiding the evils of a double jurisdiction, and for securing vigorous and harmonious action.\n\nBut of all that has grown out of the early struggles of McGill College, its broad character as a university, in the fullest sense of the term, is the most important point. No question can now arise as to whether it should strike deep its roots into society by preparatory schools. The success of its high school and its normal and model schools, gives sufficient practical proof of the value of these departments of its work. No question can arise as to whether it should extend its field of operations into the preparation of young men for special professional pursuits. It has already done this more extensively than any other university in British America, and with large and manifest benefit both to society and to its own interests. Nor, on the other hand, can it any longer be maintained that scholastic and professional studies alone are required in Canada. The increasing number of undergraduates in arts shows that classical, mathematical, scientific and philosophical culture are more and more desired, as preparatory to professional and public life.\n\nWe have ceased to inquire which of these several things should be done, and have learned that we can do all better than we can do any one alone. Without its course in arts, as at present organized, the institution could not fulfill its functions as a university. Without its schools and professional faculties and special courses, it could not give those kinds of education most urgently required, and could not maintain a prosperous and progressive character. Such conclusions, it is true, do not depend on experience in Canada alone. They rest on the nature of man, and on the structure of society. They have approved themselves to the ablest thinkers on educational subjects on both sides of the Atlantic; and they stand forth as the true mean between that extreme and narrow view which would make the higher education merely industrial, and that equally extreme and narrow view which would make it purely literary and abstract. That there are difficulties attending our position in these respects it would be\nuseless to deny. These chiefly concern the Faculty of Arts. They result from the prevalent disinclination to devote the necessary time to a course of college study, and from the necessity on the one hand of maintaining a high standard of classical and mathematical attainments, and on the other of giving that broad, scientific, and literary culture now absolutely required in every educated man. In surmounting these difficulties, the following means are those chiefly relied on. Firstly.—Offering every practical facility to young persons desirous of passing through the course in arts along with professional studies. Secondly.—The influence of good preparatory schools in furnishing students well-grounded in elements. Thirdly.—A judicious combination of tutorial training with professional lectures, according to the nature of the subject studied, and the age and qualifications of the students. Fourthly.—Insisting on a regular and systematic course of study in the first and second years, and permitting options and honor studies freely in the senior years. The details of the arrangements bearing on these points it would be impossible to introduce here. They are contained in the annual publications of the university.\n\nThe value of the property bequeathed by Mr. McGill was estimated, at the time of his death, at £30,000; it has since become much more valuable, owing to the growth of the city, and has formed a nucleus for much larger benefactions. The sum was not large in comparison with many other educational bequests; but it would be difficult to estimate its value to Canada in general, and to Montreal in particular. Gathering around it the gifts of other liberal men, it has sustained the McGill University, and carried it on to its present point of usefulness and success as a source of literary and scientific culture. Hundreds of professional men, in all parts of Canada bear testimony to its value; and the city derives from it much of its higher character as a centre of learning and practical science. Indirectly, it has benefited the cause of common and grammar-school education, through the action of the Royal Institution, through the services of students and graduates as teachers, and through the McGill Normal School, which, though supported by Government would scarcely have been established but for the influence of the college. Those who have in these ways received its educational benefits are to be found in all parts of the country, contributing by superior skill and intelli-\ngence to the common good. If the future may be anticipated from the past, its utility will, in the time to come, go on increasing and widening, growing with the growth of our country, and prevailing all departments of useful and honorable occupation. An endowment of this kind is, probably, of all investments of money, that which yields the richest returns and most surely advances the welfare of mankind. The experience of older nations has shown that such endowments survive changes of religion, of dynasty, of social and political systems, and go on bearing fruit from age to age. It will, doubtless, be so here also, and the time will come when the original endowment of McGill will appear but as the little germ from which a great tree has sprung—the spring which gives birth to a mighty river.\n\nAlready, through Mr. McGill and those who have followed his example, as benefactors to this University, the English of Montreal may boast of having created a collegiate institution, second to none in the Dominion; and no one who knows them can doubt that, with God's blessing, they will carry their work forward in a degree commensurate with the growth of the city, and with the many demands of society for higher culture, more especially of those kinds which can be made directly applicable to the spiritual, intellectual and material progress of mankind.\nfrom\nand\nall\nof\nfields\nkind.\nments\nlems,\nso\nof\nhas\n\nhis\nMontreal\nnone\nwith\ncom-\nlands\nwhich\nand\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_23636.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 32694, "total-output-tokens": 8403, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1111, 3], [1111, 3588, 4], [3588, 5423, 5], [5423, 7915, 6], [7915, 10383, 7], [10383, 12846, 8], [12846, 15326, 9], [15326, 17840, 10], [17840, 20335, 11], [20335, 23570, 12], [23570, 26635, 13], [26635, 29098, 14], [29098, 31603, 15], [31603, 34115, 16], [34115, 36630, 17], [36630, 37989, 18], [37989, 38085, 19], [38085, 38085, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]