[{"id": "8ed6c3772b7c5777fbdcc4aadced5dfd9f94d86d", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- Coloured covers/Couverture de couleur\n- Covers damaged/Couverture endommagée\n- Covers restored and/or laminated/Couverture restaurée et/ou pelliculée\n- Cover title missing/Le titre de couverture manque\n- Coloured maps/Cartes géographiques en couleur\n- Coloured ink (i.e. other than blue or black)/Encre de couleur (i.e. autre que bleue ou noire)\n- Coloured plates and/or illustrations/Planches et/ou illustrations en couleur\n- Bound with other material/Relié avec d'autres documents\n- Tight binding may cause shadows or distortion along interior margin/La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X ✓ 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"A SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nFIRST READING BOOK\n\nFOR\n\nSCHOOLS AND FAMILIES.\n\n---\n\n\"Let the little children come unto me, and forbid them not; for of such is the kingdom of God.\"\n\nThe Words of Jesus. Mark v. 14.\n\n---\n\nPrinted at OONIKUP, by permission of\nGeo. Morish, 20, Paternoster Row, London.\nMDCCCXC.\nAs this book has not been composed for spelling, but for reading and instruction, the writer has not limited himself to words of three letters in the first pages, but simply to words of one syllable. The fact is, that reading is not really learnt by means of spelling, but by familiarity with the form of the word and the sound given to it. Spelling should be a separate exercise from reading, for correct spelling belongs more to the art of writing. Let the teacher endeavour to fix the scholar's attention on the form of the word, giving him the sound of it; then he will find him in a short time making easy and rapid progress without the tedious mode of spelling every word. The above principle also allows of the introduction of more advanced reading in the same book. Children learn to read much faster than they get understanding. It is the parent's and teacher's office to seek to exercise the intelligence of the child by explanations.\n\nThe instructions in this book are not given so fully as they would be if the sole object had been to explain truth; therefore the teacher must supply the lack in this, and by questioning, and explaining, and illustrating in a simple way, impress on the young minds the truths of the word of God, which are here but briefly touched upon.\n\nMay all who teach the young remember that it is for eternity they labour, and be led to teach with the high aim of leading sinners to Jesus, that they may have eternal life. Above all, forget not that it is only in dependence upon the Lord, who alone can by His Holy Spirit quicken the soul, that any should engage in this blessed work.\nFIRST READING BOOK.\n\nNistum Ayméchikáwe Mussimuhikun.\n\na b c d e f g\nh i j k l m n\no p q r s t\nu v w x y z\n\nA B C D E F G\nH I J K L M N\nO P Q R S T\nU V W X Y Z\n1. God is great. God is good.\n2. God is just. God is love.\n3. God made the dry land and the sea.\n4. He made the sky.\n5. He made the sun, and the moon, and the stars.\n6. He made the trees.\n7. He made man.\n8. He made all that we can see.\n9. God made all that we do not see.\n10. God made all things by His word.\n11. He said, \"Let there be light\" and there was light.\n12. He can see all men.\n13. No one can be hid from God.\n14. He can hear all we say.\n15. He can do as He will.\n16. He is near to us all.\n17. God made man good.\n18. He said that all He had made was good.\n\n1. Munito kichayewew. Munito meyoatisew.\n2. Munito kwiuskwatisew. Munito sakohewawinewew.\n3. Munito kē oosētow ka pakwuchak uske mēna kiehe kume.\n4. Kē oosētow kēsik.\n5. Kē oosehāo kēsikowe pēsimwa, mēna tipiskowe pēsimwa, mēna uchukoosa.\n6. Kē oosehāo mistikwa.\n7. Kē oosehāo ayesēyinewa.\n8. Kē oosētow kakeyow ka waputumuk.\n9. Munito kē oosētow kakeyow āka ka waputumuk.\n10. Munito kē oosētow kakeyow kākwiwa oot itwāwin oche.\n11. Kē itwāo, \"Kitta wē wastāo,\" ākose kē wastāo.\n12. Kuskētow kitta wapumat kakeyow ayesēyinewa.\n13. Numoweyuk kitta kē kasoo āka kitta wapumikoot Muntooowa.\n14. Kuskētow kitta pātuk kakeyow ka itwāyuk.\n15. Kuskētow kitta totuk ā isse itāyētuk.\n16. Kissowak ke wēchekapowistakoonow kakeyow keyanow.\n17. Munito kē oosehāo ayesēyinewa ā mēyoatisseyit.\n18. Kē itwāo kakeyow ka kē oosētat kē meywasin.\n19. He made Eve to be with the man.\n20. He told them to eat of all the trees but one.\n21. One tree made man to know good and bad.\n22. This was the tree that man was not to eat of.\n23. God said man must die if he eat of it.\n24. Eve took of it and gave to the man.\n25. It was sin to eat what God said man was not to eat.\n26. Man did eat of it.\n27. So now sin is in man.\n28. Man dies now, for sin is in him.\n29. Sin is in us all, for we are born from the first man.\n30. Sin in us makes us do what is bad, and so we have no love for God.\n31. God will not let sin be near Him.\n\n19. Kē oosehāo Eve kitta wēcheayamayit umihe napāwa.\n20. Kē wētumowāo kitta oche mēchesoooyit kakeyow mistikwa pāyuk piko nunoweya.\n21. Pāyuk mistikwa kē issehik ayesēyinew kitta kiskāyētuk mēyo kākwi mēna muchekākwi.\n22. Jwukwunihe mistikwa āka kitta kē oche mēchisoot ayesēyinew.\n23. Munito kē itwāo piko kitta nipit ayesēyinew kēspīn mēchesooche ākota oche.\n24. Eve kē oche ootimun mēna kē mēyāo umihe napāwa.\n25. Muchētewin āwuko kitta mēchik umimāyew ka kē itwāt Munito āka kitta mēchit ayesēyinew.\n26. Ayesēyinew kē oche mēchisoo.\n27. Iwak' oche ākwa muchētewin kikiskak ayesēyinew.\n28. Ayesēyinew ākwa oche nipew, chikāma ā kikiskakoot muchētewin.\n29. Muchētewin ke kikiskakoonow kakeyow, ayis ke nētoweke-hikowinanow nistum napāo oche.\n30. Muchētewin ka kikiskakoooyuk ke sēkiskakoonow kitta totumuk unima ka mayatuk, ākose'se numoweya ket ayanow sakehewāwin Munitook isse.\n31. Munito nunoweya kitta itāyētum kitta ētukwuk muchētewin kisewak itta ka ayat.\n32. No one can be with God till his sin is put from him.\n\n33. To do our own will is sin.\n\n34. To take what is not our own is sin.\n\n35. To say a bad word is sin.\n\n36. You are of an age to know good from bad.\n\n37. You know when you do wrong.\n\n38. Man can in no way put his sin from him.\n\n39. God gave a law to tell man what he ought to do.\n\n40. Man did not keep the law, for sin was in his heart.\n\n41. The law could not take sin from man.\n\n42. The law finds out the sin, and says man must die.\n\n43. God sent His own Son to take sin from man.\n\nNumoweyuk kitta kē wēchāwāo Munitoowa patima kē ēkutānikatākeoomuchētewin.\n\nKitta totumuk keyanow ket itāyētumooowinenow muchētewin āwuko.\n\nKitta ootinumuk umima āka ka tipeyuwāseynuk muchētewin āwuko.\n\nKitta itwāyuk pāyuk mucheayumewin muchētewin āwuko.\n\nAssi ākotato ke pipoonwan kitta kiskāyētumun mēyo kākwī ispēch muche kākwī.\n\nKe kiskāyētān ispē muche kākwī ket itofān.\n\nAyesēyinew numoweya kuskētow nantow isse kitta ēkutānumasoot oo muchētewin.\n\nMunito kē mākew ooyussoowāwin kitta wētumakoot ayesēyinew tanse oo ka isse ayatai.\n\nAyesēyinew numoweya kē tipetotum umima ooyussoowāwin, chikāma muchētewin ākikiskakoot oo tāik.\n\nUmima ooyussoowāwin numoweya kē ēkutānumak muchētewin ayesēyinewa oche.\n\nUmima ooyussoowāwin miskumumum umima muchētewin, ākose itwāmukun piko kitta nipit ayesēyinew.\n\nMunito kē pā issitissowāo Wēya kāchewak oo Koosisa kitta ekutānumowayit ayesēyinewaumimāyewmuchētewin.\n1. Jesus Christ is the Son of God.\n2. Jesus Christ came from God.\n3. Jesus was very good.\n4. He was never bad.\n5. Jesus was full of love, and was very kind.\n6. He took little children into His arms, and blessed them.\n7. He is glad now when little children come to Him.\n8. Jesus was once a little child.\n9. He was never a rude child.\n10. He always obeyed His parents.\n11. When He became a man, He went about doing good.\n12. Jesus always did the will of God His Father.\n13. There was no sin in Him.\n14. He never had a bad thought.\n15. There was no need for Him to die, for there was no sin in Him.\n\n1. Jesus Christ Munitoowekoo-sisanewew.\n2. Jesus Christ Munitook kē ochēw.\n3. Jesus naspich kē mēyoatisew.\n4. Numma wēkach kē oche muchatisew.\n5. Jesus kē sakuskināskak sakehewāwin, mēna naspich kē kisāwatisew.\n6. Kē ootināo upistowasisa oo spitoonik, mēna kē sowāvinnāo.\n7. Mēywāyētum kāyapich ispē ā pā natikoot upistowasisa.\n8. Jesus pāyukwow kē upistowasisēwew.\n9. Numma wēkach kē oche muchowasisēwew.\n10. Mosuk kē nunahetowāo oo nēkehikwa.\n11. Ispē ka napāwit, kē pupamootāo ā mēyo itotuk.\n12. Jesus kakekā kē totum oot itāyētumoowineyew Munito oo 'toweya.\n13. Numoweya kē oche kikiskum muchētewin.\n14. Numoweya wēkach pāyukwow kē oche muche mamitoonāyētum.\n15. Numoweya ochetow Wēya kitta nipit, chikāma numoweya kē oche kikiskum muchētewin.\n16. But He did die—He was nailed to a cross.\n\n17. His side was pierced with a spear.\n\n18. His blood was shed.\n\n19. It was for our sin that Jesus died, and shed His blood.\n\n20. Nothing but the blood of Jesus can take away sin.\n\n21. Jesus was taken from the cross, and put into a grave.\n\n22. A large stone was put before the door of the grave.\n\n23. Men with swords were sent to take care that no one broke open the door.\n\n24. But the angel of the Lord came, and took the stone from the door of the grave.\n\n25. The men did shake for fear of him, and were as if they were dead.\n\n26. But Jesus rose from the dead.\n\n27. He came out of the grave, and left all the grave clothes behind Him.\n\n---\n\n16. Maka sakooch kē nipew—kē sukowow pimitaskwuhikunik.\n\n17. Kē takumow oo spikak michekewa oche.\n\n18. Oo mik kē sēkinckatāyew.\n\n19. Keyanow ke muchētewinenow oche Jesus ka kē oche nipit, mēna ka kē oche sēkimuk oo mikoom.\n\n20. Numma kākwi piko oo mik oche Jesus itta muchētewin kā kē oche ootinikatatāk.\n\n21. Jesus kē nētinow pimitaskwuhikunik oche ākose kē ayow yikwauskanik.\n\n22. Mistussine kēayow iskwatāmik ākota yikwauskanik.\n\n23. Napāwuk sinakunikoomana oche kē issitisssowowuk kitta kunowapuchekāchik āka oweyuk kitta pasketāwāpuhuk unima iskwatām.\n\n24. Maka oo kiche utooskāyakuna ka Tipāyēchekāt kē pā itootāyewa, ākose kē ootināyewa unihe ussinea iskwatāmik yikwauskanik oche.\n\n25. Unike napāwuk kē nunumepuyewuk ā ispēche koostachik, ākose tapiskoochānipichik kē isse ayowuk.\n\n26. Maka Jesus kē wuniskow oonipewa itta oche.\n\n27. Kē pā wnyuwew yikwauskanik oche, mēna kē nukutum kakayow yikwauskane ayoonwinisa ootanak.\n28. Mary and others who saw Him die, and saw Him put into the grave, saw Him alive again.\n\n29. Jesus often talked with those who loved Him after He rose from the dead.\n\n30. At last He left them and went up into Heaven.\n\n31. As He was talking to them He was taken up in a cloud.\n\n32. He went and sat down on the right hand of God.\n\n33. Those who saw Him ascend kept looking up into Heaven.\n\n34. And two angels told them that this same Jesus would come again.\n\n35. When Jesus went back to His Father, God sent His Holy Spirit.\n\n36. Jesus told those who loved Him to wait for the Holy Spirit.\n\n37. While they were all in one place the Holy Spirit came.\n\n---\n\n28. Mary mēna kotukuk ka kē wapumachik ā utte nipecit, mēna ka kē wapumachik ā kē nahenemēt, kē wapumāwuk ā pimatiseyit kētwam.\n\n29. Jesus mēchātwow kē ayumehāo unihe ka kē sakehikoot mwāstus ka wuniskat oo-nipewa itta oche.\n\n30. Pēyis kē nukutāo mēna kē ōopiskow kiche kēsikook isse.\n\n31. Mākwach ā ayumehat unihe kē ootinow ispimik isse wnskook.\n\n32. Kē nutowe upew oo kicheniskeiyik Munitoowa.\n\n33. Unike ka kē wapumachik ā utte oopiskayit soke kē tustusapewuk kiche Kēsikook isse.\n\n34. Akose nēsoo kiche ntooskāvakunuk kē wētumowāwnk āwuko owa Jesus kā pā itootāt mēna.\n\n35. Ispe Jesus ka kēwātōtotowat oo Taweya, Munito kē pā issitissowāo oo Kunache Achakwa.\n\n36. Jesus kē wētumowāo unihe ka kē sakehikoot kitta pāhayit ka Kunatiseyit Achakwa.\n\n37. Mākwach kakewow pāvukwunook ā ayachik ka Kunatisit Achak kē pā itootāo.\n38. They then began at once to tell all about Jesus.\n\n39. They told how He had died and rose again.\n\n40. This made those who heard it think about their sins.\n\n41. It made them cry out and ask, What shall we do?\n\n42. Have you cried out, What shall I do to be saved?\n\n43. The Bible says, Believe on the Lord Jesus Christ, and thou shalt be saved.\n\n44. Till we believe in Jesus, we have nothing but sin and death in us.\n\n45. Jesus, the Son of God, has life.\n\n46. This life will last for ever and ever.\n\n47. If we do not get this life, we shall die, and go into hell, for ever and ever.\n\n48. We get this life by faith in Jesus.\n\n49. If Jesus had not died, we could not get this life.\n\nAkose sāmak kē mache achi-māwuk Jesusa missewā isse.\n\nKē achi-moo-wuk tanse ka kē isse nipeyit mēna ka kē isse wuniskavit mēna.\n\nKē išsēlikwuk ooma unike ka kē pātukik kitta kē oche manitoonāyētukik oo muchē-te-wine-wowa.\n\nKē totakwuk kitta tāp-wāchik mēna kitta kukwāchikāmoo-chik, Kākwi kā totumak?\n\nKēya chē ke kē tāpwan, Kākwi kā totuman kitta pimachē-hikoweyan?\n\nKiche Mussinuhikun itwāmu-kun, Tapwatow ka Tipayē-chikāt Jesus Christ, ākose ke ka pimachē-hikowin.\n\nPatima Jesusā tapwātowayuk, numma kākwi ke kikiskakoonow piko muchē-te-win mēna nipoo-win.\n\nJesus, Munito oo Koosisan, kikiskum pimatis-sewin.\n\nOoma pimatis-sewin kitta pinnipuyew kakekā mēna kakekā.\n\nKēspin āka ayayuko ooma pimatis-sewin, ke ka nipinanow, ākose ke ka itootanow muche iskotāk, kakekā mēna kakekā.\n\nKet oche aotinanow ooma pimatis-sewin tapwātumoo-win oche Jesusik isse.\n\nKēspin Jesus āka kē nipit, mumoweya ke ka kē ayatanow ooma pimatis-sewin.\n50. But God loved us so much, that He gave up His Son for us.\n\n51. He was lifted up on the cross and died, that anyone who believes on Him may live and not die.\n\n52. Someone had to die for our sins, or we must have died for them ourselves.\n\n53. If we die for them, we cannot put them away.\n\n54. Our sins will be upon us in hell forever if we die in them.\n\n55. Jesus could put away sin; so, when He had put it away, He rose from the dead.\n\n56. God takes away the sins of all who believe in Jesus, so that they are clean in His sight.\n\n57. They also have eternal life.\n\n58. All who believe have eternal life.\n\n59. God says so in His word; and what He says is true.\n\n50. Maka Munito ā ispēche sake-hikooyuk, kē oche pukitināo oo Kōosisa keyanow oche.\n\n51. Kē oopaskoowow pimitaskwuhikunik mēna kē nipew, piko oweya ā tapwātakoot kitta kē pimatiseyit mēna āka kitta nipeyit.\n\n52. Kē itustāo nantow oweyuk kit-ta nipitkemuchētewinenowa oche, owāka keyanow kāche-wak piko kitta nipeyuk ā-wukwune oche.\n\n53. Kēspin keyanow nipeyuko ā-wukwune oche, numoweya ke ka kē ēkutāstanow.\n\n54. Ke muchētewinenowa ke ka kikiskakoonanow muche is-kotāk kakekā kēspin ni-penyuko ākota ā ayayuk.\n\n55. Jesus kē kuskētow kitta ēkutāstat muchētewin; āwuk’ oche, ispe ā kē ēkutāstat, kē wumiskow oonipewa itta oche ā ayayit.\n\n56. Munito oopimā ustow oo muchētewinewowa kakeyow ka tapwātowachik Jesusa, ā-wuk’ oche ookoo pākisewuk oot astumēwinik.\n\n57. Akose mēna ookoo kakekā pimatisewin ayowuk.\n\n58. Kakeyow ka tapwātukik ayowuk kakekā pimatisewin.\n\n59. Munito ākose itwāo oot itwāwinik, ākose umima ka itwātapwāwinewun.\n60. When you have faith in Jesus, you have life: and you will never go into hell.\n\n61. When you have faith in Jesus, God forgives all your sins at once.\n\n62. It is very sad to go on in sin, and not believe in Jesus.\n\n63. All who will not have this eternal life will be cast into the lake of fire.\n\n64. All who have this life will be with Jesus in heaven for ever.\n\n65. Those who have this life, and the pardon of their sins, love God.\n\n66. They love Jesus.\n\n67. They hate sin.\n\n68. They do not any more like their old bad ways.\n\n69. They love to do good.\n\n70. They love all who love God.\n\n71. They are kind and gentle.\n\n72. They are patient and forgiving.\n\n---\n\n60. Ispē ā tapwātowut Jesus, ket ayan pimatisewin: ākose numoweya wēkach ke ka itootan muche iskootāk.\n\n61. Ispē ā tapwātowut Jesus, Munito poonāyētum kakeyow ke muchētewina sāmak.\n\n62. Naspich muchāyētakwun kitta pimootāyun muchētewinik, akose āka kitta tapwātowut Jesus.\n\n63. Kakeyow āka kā ayachik ooma kakekā pimatisewin kitta isse wāpinowuk muche iskootāk.\n\n64. Kakeyow ka ayachik ooma pimatisewin kitta wēchāwawuk Jesusa kiche kēsikook kakekā.\n\n65. Unike ka ayachik ooma pimatisewin, mēna poonāyētumakoowin oo muchētewinewowa oche, sakehāwuk Munitoowā.\n\n66. Sakehāwuk Jesusa.\n\n67. Pukwatumwuk muchētewin.\n\n68. Nunoweya owussimā saketowuk kuyatā oo muche itotum-oowinewowa.\n\n69. Meywāyētumwuk kitta mēyo itotukik.\n\n70. Sakehāwuk kakeyow ka sakohayit Munitoowā.\n\n71. Kiāwatisewuk mēna yoospisewuk.\n\n72. Sēpāyētumwuk mēna poonāyētumakāwuk.\n73. They serve the living and true God.\n\n74. They wait for His Son to come from heaven, to take them to be with Him for ever.\n\n75. They love to talk about Jesus. They try to get others to know Jesus, and to believe in Him.\n\n76. Dear Reader, ask yourself, Do I love Jesus? Do I know that He has died and risen again? Do I believe what I have heard about Jesus?\n\n77. Oh, do not put off this great blessing of being saved at once! Jesus is ready to receive you—God is willing to forgive you. Do not delay. God asks you to hear His voice and believe His words \"to day.\"\n\n73. Utooskowāwuk ka pimatiseyit mēna ka tapwāweyit Munitoowa.\n\n74. Pāhāwuk oo Koosisēyewa kitta pā itootāyit kiche Kēsikook oche, kitta ootinavit kitta wēchāwachik kakekā.\n\n75. Saketowuk kitta ayimoomachik Jesusa. Kukwā sēkimāwuk kotuka kitta kiskāyimayit Jesusa, mēna kitta tapwātowayit.\n\n76. Ka sakehitan ootayumēchikāo, kukwāchimissoo, Ne sakehow chē Jesus? Ne kiskāvētān chē ā kē nipit mēna ā kē wuniskat mēna? Ne tapwātān chē ooma ka kē pātuman Jesus oche?\n\n77. Oh, ākoweya wāpina ooma kiche sowāyētakoosewin sāmak kitta pimachehikoweyun! Jesus kwayatisew kitta ootinisk—Munito itāyētum kitta poonāyētumask. Akoweya pāhoo. Munito ke kukwāchemik kitta nutootumun oo pātakoosewin mēna kitta tapwātumun ootitwāwina \"unooch ka kēsikak.\"\nPARABLES.\n\nWhen Jesus was upon the earth He often spoke to the people in parables, that is, He taught the truth in simple stories.\n\nIn the fifteenth chapter of Luke there are three beautiful parables that tell us of God's love for poor lost sinners.\n\nThey tell us how God seeks after the lost ones, how He receives them, and what joy there is in heaven when a sinner returns to God.\n\nThe first parable tells us how Jesus the good shepherd seeks the lost one till He finds it, and then carries it home.\n\nThe second parable tells us that God, by His Spirit, spares no pains in seeking very diligently till the lost one is found.\n\nThe third parable tells us that God the Father joyfully welcomes the returning prodigal, and makes him fit to be in His house as a son.\n\nUSPAHAKAMOOWINA.\n\nIspē Jesus oota uskēk ka ayat wawēpuch kē ayumehāo ayesēyinewa ā uspahakāmoot, ooma oote, kē kiskinohumowāo unima tapwāwin ka wātuke achimoowina oche.\n\nMetatut-neyanunooosap matimumakunik Luke ētukwunwa nistoo ka mēyonakwuke uspahakāmoowina ka wētumakoooyuk Munito oo sakehe-wāwin oche ka kitemakisichik oomuchatisewa oche.\n\nKe wētumakoonow tamse Munito ka isse nunatoonat ka wunesineyit, ka isse ootinat, mēna ā isse mumatakoosenanewuk kiehe kēsikook ispē pāyuk oomuchatisew pā kēwāo Munitook isse.\n\nUnima nistum uspahakāmoowin ke wētumakoonow tanse Jesus uma mēyo okunowāvemayuchikwāo ā isse nutoonowat ka wunesineyit pēyis ā miskowat, ākose kēwātahāo.\n\nUnima kotuk uspahakāmoowin ke wētumakoonow Munito, oot Achakwa oche, numoweya munachehissōo mitoone ā nutoonikāt pēyis ka wunesineyit ā miskāmēt.\n\nUnima uskooch uspahakāmoowin ke wētumakoonow Munito Otawemow munatakoosēwe kawe ootināo ka pā kēwāyit oomāschepuhoowa, ākose tapukāyimāo wēkēk kitta ayayit tapiskooch oo koosisa.\nThe following are the three parables of the Lost Sheep, Lost Piece of Money, and the Prodigal Son.\n\n1 Then drew near unto Him all the publicans and sinners for to hear Him. 2 And the Pharisees and scribes murmured, saying, This man receiveth sinners, and eateth with them.\n\n3 And He spake this parable unto them, saying, 4 What man of you, having a hundred sheep, if he lose one of them, doth not leave the ninety and nine in the wilderness, and go after that which is lost, until he find it? 5 And when he hath found it, he layeth it on his shoulders rejoicing. 6 And when he cometh home, he calleth together his friends and neighbours, saying unto them, Rejoice with me; for I have found my sheep which was lost. 7 I say unto you, that likewise joy shall be in heaven over one sinner that repenteth, more than over ninety and nine just persons, which need no repentance.\n\nAwukwunihe oohoo kā utte pimittsuhikatāke uspahakāmoowina Ka Wunesik Mayuchik oche, Ka Wunehēt Sooneyow oche, mēna Oomāschepuhoowe Koosisan oche.\n\n1 Akose kissewak kē pā natāwuk kakeyow sooneyoweyinewuk mēna oomuchatisuk kitta kē nutootowachik. 2 Akose unike kistāyimoowe ootayumehowuk mēna oomussinuhikāwuk kē mētowāwuk, ā itwāchik, Owā napāo oofināo oomuchatisa, mēna wēche-mēchesoonāo.\n\n3 Akose kē achimooostowāo ooma uspahakāmoowin, oomisse ā itwāt, 4 Tan’ una napāo oona ka ituseyāk, ā ayowat metatutoomitoonow mayuchikwa, kēspīn wunehāo pāyuk ā-kota oche, numma chē nukutāo kākat metatutoomitoonow mēna kākat metatut ka pakwuchayik uškēk, akose nutoonowāo umihe ka wunesimeyit, pēyis ā miskowat? 5 Akos’ ispē ā miskowat, tātayāo oo ‘titimunik, ā mumatakoosit. 6 Akos’ ispē pā kēwāo, nutoonmāo oo totāma mēna oo wētupemakuna, ā itat, Wēche-mumatakoosik nēya; chikāma ā kē miskowuk ne mayuchikooma ka kē wunesik. 7 Ket itinowow akose kē kitta mumatakoosenanewun kiche kēsikook pāyuk oomuchatisew oche ka metatuk, owussimā ispēh kākat metatutoomitoonow mēna kākat metatut ookwiinskitarisēwe ayeseyinewuk, āka ka kwētumachik metatumooowin.\nEither what woman having ten pieces of silver, if she lose one piece, doth not light a candle, and sweep the house, and seek diligently till she find it? And when she hath found it, she calleth her friends and her neighbours together, saying, Rejoice with me; for I have found the piece which I had lost. Likewise, I say unto you, there is joy in the presence of the angels of God over one sinner that repenteth.\n\nAnd He said, A certain man had two sons: And the younger of them said to his father, Father, give me the portion of goods that falleth to me. And he divided unto them his living. And not many days after the youngerson gathered all together, and took his journey into a far country, and there wasted his substance with riotous living. And when he had spent all, there arose a mighty famine in that land; and he began to be in want. And he went and joined himself to a citizen of that country; and he\n\nApoo tan' una iskwāo ā ayowat metatut ka wapiskisichik sooneyow-apiskwa, kēspin wunehāo pāyuk ka pēsapiskisichik oche, numma chē suskahum wasuskotānikun, mēna wāpuhum unima waskuhikun, mēna mitoone nutoonikao pēyis ā miskowat? Akos' ispē ā miskowat, nutoomāo oo totāma mēna oo wētupemakuna, ā itwāt. Wēche-mumatakoosik nēya; chikāma ā kē miskowuk una pāyuk ka pēsapiskisichik oche ka kē wunehuk. Ket itinowow, ākosē 'se, mumatakossenanewun oot astumēwine-wak Munito oo kiche utooskāyakunuk pāyuk oomuchatisew oche ka metatuk.\n\nAkose kē itwāo, Pāyuk napō kē nēsēyewa oo koosisa: Akose uma oosēmimow kē itāo oo taweya, Nota, mēyekun unima puke ket ayana ka itustāk kitta ayayan. Akose kē matnumowāo oo wāyootisewina. Akose numoweya mēchāt kēsikowa mwāstus uma oosēmimow kē mowuchētow kakeyow, akose kē sipwātāo wayow uskēk isse, akose ākota kē nisewunachētow oo wāyootisewina kēskwāatisēwe-pimatisewinik isse. Akos' ispē ka māstinuk missewā, mistuhe kē nootākotanewun ākota uskēk; akose kē utte kwētowe-mēchesoo. Akose kē nutowe wēchāwāo pāyuk ootuskēwa ākota uskēk; akose kē issitissuhook oo kistikanimeyik kitta ussumat kookoosa. Akose\nsent him into his fields to feed swine. And he would fain have filled his belly with the husks that the swine did eat: and no man gave unto him. And when he came to himself, he said, How many hired servants of my father's have bread enough and to spare, and I perish with hunger! I will arise and go to my father, and will say unto him, Father, I have sinned against heaven, and before thee, and am no more worthy to be called thy son: make me as one of thy hired servants. And he arose, and came to his father. But when he was yet a great way off, his father saw him, and had compassion, and ran, and fell on his neck, and kissed him. And the son said unto him, Father, I have sinned against heaven, and in thy sight, and am no more worthy to be called thy son. But the father said to his servants, Bring forth the best robe, and put it on him; and put a ring on his hand, and shoes on his feet:\nAnd bring hither the fatted calf; and kill it; and let us eat, and be merry: for this my son was dead, and is alive again; he was lost, and is found. And they began to be merry. Now his elder son was in the field: and as he came and drew nigh to the house, he heard music and dancing. And he called one of the servants, and asked what these things meant. And he said unto him, Thy brother is come; and thy father hath killed the fatted calf, because he hath received him safe and sound. And he was angry, and would not go in: therefore came his father out, and entreated him. And he answering said to his father, Lo, these many years do I serve thee, neither transgressed I at any time thy commandment: and yet thou never gavest me a kid, that I might make merry with my friends: but as\n\nAkose pāsewik oota ka tachepoot mistoosis, mēna nipahik; akose mēchesootan, mēna moochekāyētutan: ayis owa ne koosis kē nipew, akose pinatisew mēna; kē wunehow, mēna miskowow. Akose kē utte moochekāyētumwuk. Akwa una oostāsimow kistikanik kē ayow: akose ā utte pā itootāt mēna kissewak ā utte pā natuk unima waskuhikun, kē pātum kitoochekāwin mēna nēmchitoowin. Akose kē nutoomāo pāyuk unihe utooskāyakuna, mēna kē kukwāchimāo tanāke wāche ēkēk oohoo kākwia. Akose kē itik, Ke ’sēm tukoosin; akose k’otawe kē nipahāo ka tachepoot yit mistoosisa, chikāma ā kē ootinat ā pimatiseyit mēna ā mēyo ayayit. Akose kē kisewasew, mēna numoweya oche itāyētum kitta pētookāt: āwuk’ oche kē pā wuyuwēyewa oo ’taweya ā pukoosāyimikoot. Akose wēya ā nuskwāwushehāt kē itāo oo ’taweya. Chēst, oohoo mēchāt uskēwina ket utooskatin, mēna numoweya ne kē oche pēkoonān nantow ispē ket itussoowāwin: āywāk maka numma wēkach ke kē oche mēyin apoo pāyuk mayuchikoosis, kitta kē oche moochekāyētuman ne totāmuk ussiche: maka ispē ā pā\nTHE FOOLISH RICH MAN.\n\n(Luke xii. 16-21.)\n\nThis parable shews us the folly of thinking only of enjoying this world's goods, and forgetting God.\n\nIt is very foolish to provide only for the body, and neglect the soul, because God may this night require your soul.\n\n16 The ground of a certain rich man brought forth plentifully: 17 And he thought within himself, saying, What shall I do? because I have no room where to bestow\n\nsoon as this thy son was come, which hath devoured thy living with harlots, thou hast killed for him the fatted calf. 31 And he said unto him, Son, thou art ever with me, and all that I have is thine. 32 It was meet that we should make merry, and be glad: for this thy brother was dead, and is alive again; and was lost, and is found.\n\nKA KUKAPATISIT WAYOOTISEWE NAPAO.\n\n(Luke xii. 16-21.)\n\nOoma uspahakāmoowin ke waputevikoonow unima kukapatisewin ā mamitoonayēchikatāk moche kitta apuchētak ooma uskēwe-wayootisewina, ākose kitta wunekiskisetotāt Munito.\n\nNaspech kukapatisenakwun kitta astachikook piko ooma mēyow oche, ākose kitta achistowāyimēt a-chak, chikāma Munito unooch ka tipiskak kitta kēnutoonāoketachakwa.\n\n16 Oot uskēyew pāyuk ā wāyootisit napāo kē nētowikichikāmukuneyew mistuhe: 17 Akose oomisse kē isse kukwāchiminsoo, ā itwāt. Kākwi kā totuman? chikāma numoweva net ayan ā towak itta kitta kē naustāyan ne mēmisima.\nmy fruits. And he said, This will I do: I will pull down my barns, and build greater; and there will I bestow all my fruits and my goods.\n\nAnd I will say to my soul, Soul, thou hast much goods laid up for many years; take thine ease, eat, drink, and be merry.\n\nBut God said unto him, Thou fool, this night thy soul shall be required of thee: then whose shall those things be, which thou hast provided? So is he that layeth up treasure for himself, and is not rich toward God.\n\nTHE PARABLE IN THE HOUSE OF SIMON, THE PHARISEE.\n\n(Luke vii. 36-50.)\n\nIt is the sinner who feels the need of a Saviour that knows most about the grace and love of Jesus, and therefore loves Him most.\n\nSimon thought too well of himself, therefore he thought too little of Jesus, so Jesus rebukes him with the para-\n\nUNIMA USPAHAKAMOOWIN OO WASKUHIKUNIK SIMON, UNA KISTAYIMOWE OOTAYUMEHOW.\n\n(Luke vii. 36-50.)\n\nOomuchatisew ka moosētat ā isse kwētumat Oopimachehewāwa āwuko ka kiskāyētuk nowuch mistuhe oo kisāwatisewinēyewa mēna oo sakehewāwinēyewa Jesusa, āwuk' oche maka nowuch mistuhe sakehāo.\n\nSimon oosam mistuhe kē itāyimisoo, āwuk' oche oosam upisēs kē itāyimāo Jesusa, āwuk' oche Jesus kitahumowāo unima uspahakamoowin oche nēsoo oo-\nAnd one of the Pharisees desired Him that He would eat with him. And He went into the Pharisee's house, and sat down to meat. And, behold, a woman in the city, which was a sinner, when she knew that Jesus sat at meat in the Pharisee's house, brought an alabaster box of ointment, and stood at His feet behind Him weeping, and began to wash His feet with tears, and did wipe them with the hairs of her head, and kissed His feet, and anointed them with the ointment.\n\nNow when the Pharisee which had bidden Him saw it, he spake within himself, saying, This man, if he were a prophet, would have known who and what manner of woman this is that toucheth him: for she is a sinner. And Jesus answering said unto him, Simon, I have somewhat to say unto thee. And he saith, Master, say on. There was a certain creditor which had two debtors: the one müssimuhikāwuk oche.\n\nAkose pāyuk unihe kistāyi-moowe Ootayumehowa kē pukoo-sāyimik kitta wēche-mēchesoomat. Akose kē pētookāo wēkeyēk unihe kistāyinoowe Otayumehowa, mēna kē nāupew kitta mēchesoonanewuk. Akose, poote, pāynk iskwāo ākota ootānowik, ka kē muchatisit, ispē ā kiskāyētuk Jesusa ā upeyit ā mechesoooyit unihe kistāyinoowe Ootayumehowa wēkeyēk, kē pātow usinmeussewuchekun tumuskoowin ā ussewutāk, mēna kē nēpowēw oo 'siteyik ootak ā matoot, mēna utte kisepākisitānāo ochehowape-wina oche, mēna kē kasēnum wāstukaia oche oo 'stikwanik, mēna kē oochātum oo 'sitēyewa, mēna tumuskoonum unima tumuskoowin oche. Akwa ispē una kistāyinoowe Ootayumehow ka kē nutoomat ā waputuk, kē wēchepēkiskwāmissoo, ā itwāt, Owa napāo, kēspin kē ookiske-wāhikāwit, oo ka kē kiskāyētā owāyewa mēna tantoowa iskwāwa oohoo ka saminikoot: ayis oo-muchatisewa. Akose Jesus ā nuskwāwusehwāt kē itāo. Simon, net ayam nantow kākwi kitta ititan. Akose itwāyewa. Ooke-mow, pōkiskwā. Kē ētow pāyuk ootutowāo ka kē ayowat nēsoo oommussimuhikāwa: uma pāyuk\nowed five hundred pence, and the other fifty. And when they had nothing to pay, he frankly forgave them both. Tell me therefore, which of them will love him most? Simon answered and said, I suppose that he, to whom he forgave most. And He said unto him, Thou hast rightly judged. And He turned to the woman, and said unto Simon, Seest thou this woman? I entered into thine house, thou gavest me no water for my feet; but she hath washed my feet with tears, and wiped them with the hair of her head. Thou gavest me no kiss; but this woman since the time I came in hath not ceased to kiss my feet. My head with oil thou didst not anoint; but this woman hath anointed my feet with ointment. Wherefore I say unto thee, Her sins, which are many, are forgiven; for she loved much: but to whom little is forgiven, the same loveth little. And He said unto her, Thy sins are forgiven. And they that sat at meat with Him began to\nsay within themselves,\nWho is this that forgiveth\nsins also? 50 And He said\nto the woman, Thy faith\nhath saved thee; go in\npeace.\n\nMIRACLES.\n\nWhen Jesus healed\nthe sick He did not use\nany medicine, He only\nspoke the word that they\nshould be healed, or if\nHe did not speak, He\nwilled it, and immediately\nthey were well.\n\nHe cured a great mul-\ntitude of sick people.\n\nHe made the lame to\nwalk, the blind to see,\nthe deaf to hear, the\ndumb to speak.\n\nHe turned water into\nwine, and even the winds\nand sea obeyed His voice.\n\nHe cast out devils, bid-\nding them go where He\npleased.\n\nHe fed many thou-\nsand people with only\nfive loaves and two\nfishes.\n\nHe raised the dead to\nlife again.\n\nIspē Jesus ka nunatowehat\nootakoosewa numoweya oche a-\npuchētow muskēkēa, kē pēkisk-\nkwāo piko kitta kē kēkāhēchik,\nowāka kēspin numoweya oche\npēkiskwāo, kē moche itāyētum,\nākose sūmak kē mēyo ayow-\nuk.\n\nKē nunatowehāo naspich mē-\nchāt ka akooseyit ayeseyinewa.\n\nKē isseshāo oomaskisitāwa kitta\npimootayit, āka ka wapeyit kitta\nwapeyit, ka kukāpetayit kitta pā-\ntumeyit, numma nētowāwa kitta\npēkiskwāyit.\n\nKē kwāskinum nipe soominapook isse, mēna apoo yootinwa mēna kiche-kumēa kē nutootak.\n\nKē wuyuwētissowāo muche a-\nchakwa, ā itusoowatat kitta itoo-\ntayit ittā ā kē itāyētuk.\n\nKē ussumāo mēchātwow kiche\nmetatutoomitoonow ayeseyinewa\nneyanun pukwāsekuna mēna nēsoo\nkinoosāwa piko oche.\n\nKē wumiskanāo oonipewa pima-\ntisewinik isse mēna.\nIn the gospels we are told of three cases in which Jesus raised the dead, and that you may have it impressed upon your mind that Jesus is the one who can and who will raise the dead, you shall read of these three cases.\n\nTHE WIDOW'S ONLY SON RAISED TO LIFE AGAIN.\n\nLuke vii. 12-15.\n\nNow when He came nigh to the gate of the city, behold, there was a dead man carried out, the only son of his mother, and she was a widow; and much people of the city was with her. And when the Lord saw her, He had compassion on her, and said unto her, Weep not. And He came and touched the bier; and they that bare him stood still. And He said, Young man, I say unto thee, Arise. And he that was dead sat up, and began to speak. And He delivered him to his mother.\n\nMēyo achimoowinik ke wētumakowinanow nistwow oche Jesus ā kē wuniskanat oonipewa, ākose kitta kē mussimuhikatāk ke mitoonāyēchikunik Jesus āwuko una ka kuskētat mēna kā totuk kitta wuniskanat oonipewa, keyam ke ka ayumetan ooohoo nistoo oche.\n\nOONUPUTAPEW OO PAYUKO KOOSISANA A KE WUNISKANIMET PIMATISEWINIK ISSE MENA.\n\nLuke vii. 12-15.\n\nAkwa ispē kisewak ā utte oofētuk iskwatām ootānōwik, poote, ā nipeyit napāwa ka wuyuwētahimēt, oo pāyuko koosisanēyewa oo 'kaweya, ākose wēya ā oonputāpit: ākose mēchāt ayeseyinewa ākota ootānōwik oche ā wēchākoot. Akos' ispē ka Tipāyēchikāt ā wapumat, kē kitemakinowāo, mēna itāo, Akoweya matoo. Akose kē pā samimum unima tatimikun: ākose unike ka kē pinootutachik kē keyamekapowewuk. Akose oonisse kē itwāo. Ooskenēkew, kītitin, Wuniska. Akose una ka kē nipit kē simutupew, mēna kē machē pēkiskwāo. Akose [Jesus] kē pukitimmunowāo oo 'kaweyewa.\nTHE RULER'S ONLY DAUGHTER RAISED TO LIFE AGAIN.\n\n(Luke viii 41-56)\n\n\"And, behold, there came a man named Jairus, and he was a ruler of the synagogue: and he fell down at Jesus' feet, and besought Him that He would come into his house: for he had one only daughter, about twelve years of age, and she lay a dying.\n\nWhile he yet spake, there cometh one from the ruler of the synagogue's house, saying to him, Thy daughter is dead; trouble not the Master.\n\nBut when Jesus heard it, He answered him, saying, Fear not: believe only, and she shall be made whole.\n\nAnd when He came into the house, He suffered no man to go in, save Peter, and James, and John, and the father and the mother of the maiden.\n\nAnd all wept, and bewailed her: but He said, Weep not; she is not dead, but sleepeth.\n\nAnd they laughed Him.\n\nOO PAYUKO TANISIMA KA TIPAYETUK A KE WUNISKANIMET PIMATISEWINIK ISSE MENA.\n\n(Luke viii 41-56)\n\nAkose, chēst, kē pā itootāo pāyuk napāo Jairus ā isseyikasoot, akose āwuko pāyuk ka kē tipayētuk ayumehāwekumikwa: akose kē pukisin oo 'siteyēk Jesusa, mēna kē pukoosāyimāo kitta kē pā pētookāyit wēkēk:\n\nAyis ā ayowat pāyuk piko oo tanisima, nantow metatutnēsoosap ā tatoo pipoonwāyit, akose pimsinēyewa ā utte nipewit.\n\nMākwach kāyapich ā pēkiskwāt, pā itootāyewa pāyuk wēkēk oche ka tipayētuk ayumehāwekumikwa, ā itikoot, Ke tanis assi nipew; Akoweya mikooskache owa Ookimow. Maka ispē Jesus ka pātuk, kē nuskwāwuschāo, ā itwāt, Akoweya koostache; tapwāta piko, akose kitta issehow kitta mēyoo ayat.\n\nAkos' ispē ka pā pētookāt waskuhikunik, numoweya kē oche ēyinumowāo oweya napāwa kitta pētookāyit, piko Petera, mēna Jamesa, mēna Johna, mēna oo tiawēyewa mēna oo kawēyewa unīhe ooskenēkiskwāsisa.\n\nAkose kakēyow kē matoowuk, mēna kē mowekatāwuk: maka kē itwāo, Akoweya matook; numoweya nipew, maka nipow.\n\nAkose kē mmatook-\nto scorn, knowing that she was dead. And He put them all out, and took her by the hand, and called, saying, Maid, arise. And her spirit came again, and she arose straightway; and He commanded to give her meat. And her parents were astonished: but He charged them that they should tell no man what was done.\n\nTHE RAISING OF LAZARUS.\n\n(John xi. 32-45.)\n\nThen when Mary was come where Jesus was, and saw Him, she fell down at His feet, saying unto Him, Lord, if thou hadst been here, my brother had not died. When Jesus therefore saw her weeping, and the Jews also weeping which came with her, He groaned in the spirit, and was troubled, and said, Where have ye laid him? They said unto Him, Lord, come and see. Jesus wept. Then said the Jews, Behold, how He loved him!\n\nA WUNISKANIMET LAZARUS.\n\n(John xi. 32-45.)\n\nAkose kē wuyuwētissowāo kakeyow, mēna ootināo oo chēchevēk, mēna tāpwaō, ā itwāt, Ooskenēkiskwāsis, wuniska. Akose kētwam kē ootētik oot achakwa, mēna sāmak kē wuniskow: akose kē itussoowatumeyewa kitta mēyēt mēchewin. Akose oo nēkehikoomowuk kē manuskatumwuk: maka kē itussowatikwuk [Jesusa] āka kitta wētumowachik oweya kākwi ka kē tochekatak.\n\nAkose ispē Mary ka tukossēk itta Jesusa ā avayit, mēna ka wapumat, kē pukisin oo sitoyēk, oomisse ā itat, Ka Tipāyechikāyun, kēspin oota kē avayun, ne 'chewam mumoweya oo ka kē nipē. Ispē maka Jesus wēapumat ā matooyit, mēna Jewa ussiche ā matooyit ka kē pā wēchawayit [Marywa], kē mumapināo oot achakook, mēna mikooskatāvētum, mēna kē itwāo, Tantā ka kē pukitinayāk? Oomisse kē itāwnuk, Ka Tipāyechikāyun, pā waputa. Jesus kē ocheckowapew. Akose kē itwāwuk Jewuk, Chēst, ēyekook ka sakehat! Akose atēt wēya-\nAnd some of them said, Could not this man, which opened the eyes of the blind, have caused that even this man should not have died? Jesus therefore again groaning in Himself cometh to the grave. It was a cave, and a stone lay upon it. Jesus said, Take ye away the stone. Martha, the sister of him that was dead, saith unto Him, Lord, by this time he stinketh: for he hath been dead four days. Jesus saith unto her, Said I not unto thee, that, if thou wouldest believe, thou shouldest see the glory of God? Then they took away the stone from the place where the dead was laid. And Jesus lifted up His eyes, and said, Father, I thank thee that thou hast heard me. And I knew that thou hearest me always: but because of the people which stand by I said it, that they may believe that thou hast sent me. And when He had thus spoken, He cried with a loud voice, Lazarus, come forth. And he that was dead came forth, bound hand and foot with\n\nwow kē itwāwuk, Numma chē owa napāo, ka kē pasketānumwat oo ’skēsikooyewa āka ka wapeyit, oo ka kē kuskēta kitta kē issēchikāt apoo oo hoo nāpāwa āka kitta kē ni peyit? Jesus maka kētwam ā mumapināt pēchayik, pā itootāo yikwauaskanik isse. Etukwunopun watēkan, akose ussine kē tātustāo takooch. Jesus kē itwāo, Ootinik ussine. Martha, ootowāmowa umihe ka kē ni peyit, oo misse itāo. Ka Tipāyēchikāyun, assi etokā wēchākisew: ayis nipew ākwa nāo kēsikowa. Jesus oomisse itāo, Numma chē ke kē oche wētumatin, kēspin kē tapwātumune, kitta kē waputumun oo kistāyētakoosewin Munito? Akose kē ootināwuk ussineā ākota oche itta oonipewa ā kē pukitinimēt. Akose Jesus kē tustusapew, mēna itwāo, N’ota, ke nunaskoomitinchikāma ā kē nutootoweyun. Mēna ne kē kiskāyētān mosuk ā nutootoweyun: maka chikāma ayesēyinewuk oche kisewak ka nepowichik ne kē itwan, kitta kē tapwātukik ā kē pā issitissuhooyun. Akose ispē ākose ka itwāt, kē tapwāo ā kisēwāt, Lazarus, pā wuyuwē. Akose una ka kē nipit kē pā wuyuwēw, ā tukoopissoot oo chēchēk mēna oo sitēk yikwauaskane\ngrave-clothes: and his face was bound about with a napkin. Jesus saith unto them, Loose him, and let him go.\n\nThen many of the Jews which came to Mary, and had seen the things which Jesus did, believed on Him.\n\nLet your reading be always something good, and very often in God's book. It is said of Timothy, that from a child he knew the holy scriptures, which are able to make us wise unto salvation through faith which is in Christ Jesus. (2 Tim. iii. 15.)\n\nMay you soon know these holy scriptures, and may God bless you, dear reader, and make you His own, and then we shall meet each other in heaven to tell of His wondrous love.\n\nayooowinisa oche: mēna oo 'stikwan ā wāwākinumoot wape-pukewuyan oche. Jesus oomisse itāo, Āpuhook, mēna keyam kitta pukitimow. Akose mēchāt unike Jewuk ka kē pā natachik Marywa, mēna ka kē waputukik unihe kākwia Jesusa ka kē totumeyit, kē tapwāto-wāwuk.\n\nKevam ket ayumēchikāwin mosuk kākwi ā mēywasik kitta wē issenakwun, mēna wawēpuch Munito oo mussimuhikunik. Timothy itow, ā owasisēwit oche kē kiskāyētum kunache mussinuhikāwina, kā kē issehikoo-yuk kitta yipwakayuk pimache-hikoowinik isse tapwātumooowin oche ka ayak Christ Jesusik. (2 Tim. iii. 15.)\n\nPitunā wēpuch ke ka wē kiskāyē-tān ooohoo kunache mussinuhikāwina, mēna Munito ke ka wē sowāyininik, ka sakehitan ootayumēchikāo, mēna ke ka wē issehik kitta ayowisk, akose ke ka nukiskatoonanow kiche kē-sikook kitta achimoostatooyuk oo mamuskache sakehewāwin oche.\nThe text appears to be in a language other than English, possibly a Native American language. It seems to contain paragraphs with words like \"stik,\" \"pu,\" \"yam,\" \"chât,\" \"nata,\" \"usa,\" \"wato,\" which might be part of a larger sentence or story. Without more context, it's challenging to extract meaningful content from this snippet.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30195.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 35, "total-input-tokens": 59020, "total-output-tokens": 17463, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1520, 3], [1520, 4040, 4], [4040, 4040, 5], [4040, 4316, 6], [4316, 5937, 7], [5937, 6097, 8], [6097, 7492, 9], [7492, 9029, 10], [9029, 10475, 11], [10475, 11820, 12], [11820, 13440, 13], [13440, 14922, 14], [14922, 16534, 15], [16534, 18130, 16], [18130, 19635, 17], [19635, 20940, 18], [20940, 22705, 19], [22705, 24721, 20], [24721, 26771, 21], [26771, 27668, 22], [27668, 29468, 23], [29468, 30828, 24], [30828, 32046, 25], [32046, 33925, 26], [33925, 34845, 27], [34845, 36267, 28], [36267, 37901, 29], [37901, 39732, 30], [39732, 41400, 31], [41400, 43387, 32], [43387, 44845, 33], [44845, 45177, 34], [45177, 45177, 35]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]