[{"id": "cd8d131b47180aaa88b5deeb78ec6bb1fc8ebe25", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [x] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 |     |     |     |     |     |     |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [x] Relié avec d’autres documents\n- [ ] La reliure serrée peut causer de l’ombre ou de la distorsion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d’une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n’ont pas été filmées.\n\nPages discoloured, stained or foxed/\nPages détachées/\nShowthrough/\nTransparence/\nQuality of print varies/\nComprend du matériel supplémentaire/\nSeule édition disponible/\nPages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nThis item is filmed at the reduction ratio checked below.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 |     |     |     |     |     |     |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nA DISCUSSION\n\nOF THE\n\nGENERAL PRINCIPLES INVOLVED\n\nIN THE\n\nCONSTRUCTION AND ACTION\n\nOF THE\n\nIsometrical Truss Bridge.\n\nBY\n\nCHARLES MACDONALD, C.E.\n\nPHILADELPHIA:\nT. ELLWOOD ZELL.\n1867.\nTO THE PUBLIC.\n\nAn experience of nearly a quarter of a century in constructing and reconstructing railway bridges under the most difficult circumstances, and the observations of a professional career extending over a much longer period, having convinced the subscriber, that there are more errors in bridge architecture from the employment of elements which are superfluous and deranging, than from the lack of those which are sustaining and reciprocating, a series of experiments was instituted, extending through several years, under circumstances favorable to obtaining reliable data for the purpose of establishing principles which were not generally admitted; and which have resulted in the \"Isometrical Bridge Truss,\" herewith submitted, for which a patent has been obtained. The review, by Mr. Charles Macdonald, civil engineer, of the principles, both mechanical and economical, which are involved, will be found not only interesting to the professional reader, but also useful to bridge builders at large.\n\nA company, composed chiefly of the younger members of the profession, has been formed for the purpose of introducing the new system into use; and as it\nrests its claims for popular favor on the solid basis of practical experience, governed and harmonized by accurate science, great confidence is felt in the advantages which will accrue to the railway interests at large, and to all who desire a \"bridge to carry them safely over,\" from its general introduction and extended use.\n\nJ. Dutton Steele,\nCivil Engineer.\nINCORPORATION.\n\nThe Isometrical Truss Bridge Company has been incorporated under the act of Assembly of the State of Pennsylvania for such purposes made and provided, and the business objects of said company are fully set forth in the following extract from the corporate agreement:\n\n\"In order that we may be and remain a body corporate, under the name and style of The Isometrical Truss Bridge Company, for the purchase and sale of United States letters-patent, granted to J. Dutton Steele, on the 9th day of April, A.D. 1867, for the Isometrical Bridge Truss, and also for the purchase and sale of other United States letters-patent for improvements in truss bridges, the sale of rights and granting of licenses under said patents, or any of them; also for the construction of bridges, and for enjoying all the rights and privileges conferred by said act of Assembly.\"\n\nThe Board of Managers being desirous of offering every facility to parties wishing to test the merits of the Isometrical Truss, will furnish plans and estimates and, if desirable, secure the erection of bridges upon this system in any part of the United States.\n\nThe office of the company is situated in Pottstown,\nMontgomery County, Pennsylvania, and all applications for licenses should be addressed to\n\nW. D. Evans, Esq.,\nSecretary Isometrical Truss Bridge Company,\nPottstown, Pa.\n\nCopies of the accompanying pamphlet can be obtained by addressing the Secretary as above, who will also be in a position to furnish any other information which may be desired.\nTHE\n\nISOMETRICAL TRUSS.\n\nWe propose in the following pages to give a brief description of the peculiarities of a combination in bridge construction, to which the name of The Isometrical Truss has been applied; and to the proper understanding of the same, it will be necessary to look somewhat in detail into the general theory of strains in girders having horizontal flanges.\n\nThe writer approaches a subject, which in its entirety involves so much to interest the engineer, with caution, and, it is to be hoped, a due proportion of modesty. The object to be attained is simply truth; and if in this attempt, a just and searching criticism shall have demonstrated the fallacy of the views expressed, some good will at least have been done in exposing the errors of a few for the benefit of all.\n\nThe general laws regulating the action of strains in a beam supported at both ends and loaded throughout its length, have been thoroughly investigated by some of the most eminent physicists of the day. And it may not be premature to assume that the conclusions arrived at are briefly as follows:\n\nAll beams uniformly loaded and supported at both ends, are subjected to horizontal and vertical strains. The horizontal strain is a maximum at the central cross section, and decreases toward each point of support in proportion\nto the ordinates of a parabola. The vertical strains are zero at the centre, and increase directly with the distance toward each point of support, where they become equal to one-half the uniform load. In case the load is not applied uniformly, but becomes transient, as in the case of a moving train, the horizontal strain varies with the progression of the load, but becomes a maximum as before, at the centre, when the load shall have covered the entire beam. The vertical strains are so modified as to equal one-half the applied load at each extremity, and gradually to decrease toward the opposite supports, becoming zero at some point beyond the centre, and at a distance from it, varying according to the proportion borne by the weight of the beam itself to the applied load.\n\nThese laws being general in their application, form the basis of the whole theory of the action of strains in horizontal girders. We have, therefore, but to apply them to existing combinations in order to determine the relative merits of their construction.\n\nBeginning with the horizontal strain, it will be observed that all parallel girders are furnished with a top and bottom chord, which, being horizontal, are in the best possible position for opposing a horizontal strain, hence no theoretic advantage may be hoped for in any radical change in the position of the chords. It is not pretended that no practical improvement can be effected in the arrangement of the details of either the top or bottom members of wood or iron girders, but that any such improvements can have no effect in diminishing the amount of strain theoretically called for in such members. Hence it may be assumed, that if any advantageous changes are to be effected in the present most approved forms of girders, it will be proper to look for them in the web, or vertical system which connects top and bottom chords.\n\nIn Fig. 1 let it be assumed that a girder sustaining a uniform load, $W = \\frac{1}{2} w$, shall have been divided in the centre, by a vertical plane at right angles to the plane of the structure, and that portion to the right, removed. In order to preserve the remaining portion in equilibrium it\nwill be necessary to exert a horizontal force, $P$, at the centre of gravity of the top chord, equal to\n\n$$P = \\frac{WS}{8h}$$\n\nThis value of $P$ is the maximum strain to which the chords are subjected, and being applied at the point $P$, it must necessarily pass through the members of the web before reaching the point of support; hence it becomes at once apparent, that the particular arrangement of material in this web is a matter of the first importance, and we shall soon see wherein some of the present well-known combinations are defective in this respect. Since we have to deal with a horizontal force, the total horizontal section of the web from the centre to the abutment must be capable of resisting it; and since a vertical plate will fulfil this condition with the greatest economy, theoretically speaking, we should be led at once to the conclusion that a plate-girder was the best combination possible: but a practical question arises which places the plate-girder far in the rear of many other competitors. A vertical plate which would be only sufficiently thick to resist the force $P$, would buckle, hence vertical stiffening members must be introduced, which in effect transform this species of web into a series of posts and ties, the peculiarities of which we shall presently examine. It may also be mentioned that it would be quite impracticable to introduce a thin plate-web in wooden bridge construction, and as this subject will engage\nthe most of our time, this particular combination may be left out of the question.\n\nFig. 2.\n\nFig. 2 represents a case in which the load $\\frac{1}{2}W$ is communicated to the top chord by means of vertical ties; should the load be applied directly to the top chord, struts would be substituted for ties. The force $P$, evidently tends to produce rotation about the lowest points of the vertical members, and no resistance whatever is opposed by these members to such change of form in the structure; but by the introduction of a diagonal brace, as in Fig. 3, equilibrium is assured, and a web-system rendered complete, so far as a uniform load is concerned.\n\nShould the verticals be transformed into struts, and the diagonals into ties, as in Fig. 4, the strains will be simply reversed, but their amount and the condition of equilibrium will remain the same. Although there is really\n\nFig. 3.\n\nno theoretic advantage possessed by either of these arrangements over the other, still there are peculiarities connected with the kind of material made use of in the web\nand its connection with the chord, sufficient to warrant the systems being called by different names. Fig. 3 presents the main features of what is familiarly known as the Howe Truss, without the counter-brace system; and Fig. 4 applies similarly to the old Pratt bridge, somewhat better known, under a slight modification, as the Whipple; see Fig. 10. But as we have seen, all vertical members, be they ties or braces, involve an expenditure of material which is not in a position to resist the action of the force, $P$, in the most economical manner, and a consideration of this fact in all probability led to the introduction of what is known as the Warren girder.\n\nAn inspection of Fig. 5 will suffice to show that a diagonal arrangement of both struts and ties is the most economical for the requirements of a web; and it is equally evident, that the angle made by the diagonals with the vertical, must have an important bearing on the relative efficiency of diagonal systems having different inclinations. It has been clearly demonstrated, both theoretically and\npractically, that the most economical angle with the vertical in a triangular system is $45^\\circ$, hence, if all other things were equally appropriate, the proper form for a parallel girder would involve a right-angled triangular web. In practice, the nearest approach to this is the Warren girder, in which the triangles of the web are equilateral; and inasmuch as the relative economy of this system is only 15 per cent. greater than the theoretical case, its many practical advantages have earned for it the first position.\n\nThe question is now reduced to the Warren girder as the most economical form of bridge truss, having parallel flanges, and the conclusion is general in its application whether the structure be of iron or wood. At a subsequent period of the investigation we shall see that economy is not the only advantageous circumstance connected with a triangular system. Fig. 6 will serve to represent what is known in this country as the triangular truss. It differs from the original Warren in the introduction of vertical ties and posts, which are rendered necessary in order to afford intermediate points of support between the apexes of the main triangles. It is evident that so long as the spans to which the simple Warren combination is applied, remain within such limits, that the unsupported distance in each panel shall not require additional strength in order to enable it to sustain the distributed load, the vertical members in Fig. 6 may be dispensed with; but unfortunately for the success of the system this condition limits the extreme spans to a very small margin. Thus in the case of a railroad bridge required to sustain a rolling load of one and a half tons per lineal foot, and at the same time to present sufficient resistance in any one panel to the weight of the heaviest locomotive—say forty-five tons—as applied at the points of contact of the driving wheels, we should be obliged almost from the start to introduce vertical supports, or otherwise increase the dimensions of the chords beyond what would be required to resist a horizontal strain due to the whole load, since the panel load per lineal foot may greatly exceed, possibly even double that quantity. Assuming, then, that the vertical members are a practical\nnecessity for all cases within the reach of our present investigation, and that their introduction was not rendered theoretically necessary in order to sustain the uniform load; in other words, that they are totally incapable of opposing any resistance to change of form in the panels; therefore the material thus applied is a dead load upon the useful members, and consequently necessitates an additional amount of material in them to transfer this load to the abutments. So much for the question of economy; but there is another feature in the use of a single system of triangles, which begins to assume important proportions as soon as the spans are increased beyond the ordinary limits now considered safe; which is due to the increasing dimensions of the diagonals nearest the points of support. It is evident, from a consideration of Fig. 6, that these members must be capable of sustaining a strain equal to one-half the entire load upon the truss multiplied by the ratio between the diagonal and perpendicular. Now as the span increases, all other things being proportional, so must this strain increase, and as a natural consequence the sectional area of resisting material; and when this area reaches a certain limit it becomes necessary to introduce expensive appliances to fulfil the necessary conditions. In the case of a Howe truss, this limit is reached at a span of one hundred and fifty feet, as will be seen in the discussion of that particular system in a subsequent portion of this paper. Bearing these facts in mind, it is presumed that we are now in a position to appreciate the introduction of two independent systems of triangles in the arrangement of the web. Referring to Fig. 7, it will be observed that the diagonals represented by full lines, form, with the top and bottom chords, a continuous Warren girder, precisely similar to Fig. 6, with the exception of the vertical members. These members, we have seen, are rendered practically necessary in the transmission of intermediate load to the diagonals. They add to the dead weight to be carried, and do not in any way increase the general strength of the structure. Suppose, as in Fig. 7, that these verticals be dispensed with, and a second Warren system introduced\nas represented by the dotted diagonals; it is perfectly clear that the first system will be relieved of one-half the load which it would otherwise be called upon to sustain, and that this amount will be taken up and carried to the abutments by the second system; at the same time all the practical considerations involved in the vertical members have been done away with, and no more sectional area, and consequent material, is required in the diagonals than would be called for in the single full system (Fig. 6), supposing it practically capable of being adapted to a moving load without the use of intermediate supports. Hence, since all members which do not assist in preserving the general equilibrium have been removed, and the remaining ones subjected to an equal share of duty imposed in very nearly the proper theoretical direction, it may with safety be assumed that a web system involving a double set of triangles, substantially as indicated in Fig. 7, possesses both theoretical and practical advantages over any other now in use, commending it to general introduction.\n\nSuch are the main features of what has been called the Isometrical Truss. The principles upon which it is constructed being general, it is equally applicable either in wood or iron; but as the requirements of railroad enterprise in this country demand more than any other the introduction of a cheap and substantial wooden railroad bridge, we shall devote the greater portion of our remaining space to the application of the isometrical principle to wooden bridge construction.\n\nWithin the limits of a mere pamphlet, it would be quite impossible to attempt anything like an extended examination of the different kinds of bridges in use throughout the country. Suffice it to say, that although there are a great variety, and many of them fulfilling all the requirements of the original design, yet practically there are but a very few systems acknowledged to combine sufficient advantages to insure their continued adoption; and it is with these we propose to occupy our readers' attention, by way of instituting a comparison between their internal economy and that of the Isometrical Truss.\nThe Howe bridge is probably the most extensively adopted wooden truss in the United States. Why it is so is probably owing to a variety of circumstances, some of which may possibly not have their origin in the scientific merits of the combination; but the fact of its continued success must be taken as evidence in its favor, and it may therefore be assumed to be one of the best wooden bridges in general use. The original Howe truss is too familiar to those interested in bridge construction to need any minute description. Fig. 9 will serve to illustrate its general design. Previous to its invention, what was generally known as the Burr bridge, commanded the greatest share of attention; but upon the introduction of railroads, it became necessary to devise a structure possessing the elements of stability under a moving load to a greater extent than could be obtained in the Burr. The Howe patent certainly effected a great improvement in dispensing with the arch in combination with a parallel truss, and in the practical application of the counter brace, so as to admit of a certain amount of rigidity under a moving load; but it soon became evident that even this arrangement was not adapted to spans of more than one hundred and fifty feet, if confined to the simple truss, by reason of the difficulty in providing for the increased vertical strain near the points of support. This will appear more clearly when a particular case is subjected to the test of calculation. Suppose a single-track railroad bridge to be required of one hundred and fifty feet span, the weight of a maximum applied load being taken at one and a half tons per lineal foot, and the weight of structure at a half ton, making a total load of two tons per lineal foot of bridge. The total weight to be sustained by the bridge will be three hundred tons; and since very nearly one-half of this strain is transmitted to the abutments through the web on each side the centre, it will be necessary to proportion the rods and braces in the last panels to resist such strain. The exact figures are one hundred and forty tons for each end of the bridge; taking a divisor for safety of five tons per square inch of section in iron, we require twenty-eight\nsquare inches in all for the end rods. In general practice there are six rods in the last panels, or three for each truss. Dividing twenty-eight by six we have $4\\frac{1}{6}$ square inches for each, or $2''$.44 diameter for round iron. The strain upon the braces will of course be increased by the ratio of the diagonal to the perpendicular; but these members being in wood, do not oppose the same practical difficulties to an increase of section as in the case of the vertical rods. Round iron of this size $2''$.44 in diameter, is practically quite as large as it is desirable to employ; and any increase in the span, carrying with it as it does an increased demand for resisting material, makes it necessary to introduce expensive appliances for the purpose of increasing the number rather than the diameter of end members.\n\nIt may be insisted that the assumed rolling load of one and a half tons per lineal foot is excessive, and in justification of the objection reference might be made to exceptional cases wherein the Howe truss had been used for railroad purposes, on somewhat greater spans and much less dimension of rods; but we are compelled to adopt this seemingly high limit, from a practical knowledge of the extreme load which is sometimes brought to bear on the bridges of the Philadelphia and Reading Railroad, and from a desire to maintain the practice of bridge building fully up to the requirements of the age. In order to overcome the difficulties above mentioned, what was called an improvement in the Howe truss was effected by falling back upon the discarded arch of the Burr in combination with the Howe; and this new arrangement has been attended with a measure of success; but that there are serious objections to the combination of the arch and truss for railroad purposes no practical bridge builder will deny; and it is only because no better system presents itself that the Improved Howe retains the field. This is written with a somewhat intimate knowledge of the peculiarities of other wooden bridges, which, in theory, may possibly lay claim to merit. For example, the McCallum Inflexible Arch Truss, as explained and illustrated by the inventor, is one of the most beautiful of wooden-bridge combinations, and\nyet when subjected to the test of time it is utterly impracticable; witness the McCallum bridge carrying the Northern Central Railway over the Susquehanna River above Harrisburg, which has just been replaced by an Improved Howe.\n\nNext to the Howe, and in many particulars superior to it, is the Whipple Truss, a modification of the Pratt (Fig. 10), which we have seen is but a substitution of the diagonal rod and vertical post, for the vertical rod and diagonal brace of the Howe. The practical advantages possessed by this truss over the Howe, consist for the most part in a saving of material over the piers in case of a through bridge, and in the first two panels beyond the pier in the case of a deck bridge; there are also some minor advantages in the connection of the posts and rods with the chords, but the important fact remains the same, that the end rods and braces must sustain the entire load upon the truss, and of course the same difficulties as were experienced in the Howe truss for long spans may be expected in the Whipple. Other systems might be mentioned, presenting many points of interest to the practical observer, but as the two already noted cover as much ground and are probably better understood than any other systems in general use, we shall not weary the reader with further examinations. Both these trusses involve diagonal and vertical members in their web, and consequently are compelled to furnish and carry much additional material above what is absolutely required in the transmission of the load to the points of support, if effected by the most economical lines; and no amount of perfection in workmanship or ingenious appliances can by any possibility remove the defect, since it is inherent in the general design and must continue as a characteristic of the structures.\n\nAgain, we have seen that the limiting span in each of the above systems is about the same; and here let it be thoroughly understood that the term limiting span in this connection, is not intended to apply to the theoretical limit to which a wooden girder of either pattern may be built, but the practical limit beyond which the ordinary sizes of\nround iron in general use become too small for the members of the web nearest the points of support; beyond this the cost of workmanship becomes severe.\n\nA few years ago, spans of one hundred and fifty feet might possibly have expressed the limit of engineering requirements, but it must not be assumed that in such an advanced age, when railroads are being projected and built across continents (and even, possibly, under the very ocean itself), that such contracted facilities will long be tolerated. And it behooves the engineer to look well to his laurels that the profession of his choice is not suffered to lag behind in the march of improvement.\n\nIn the discussion of Fig. 7 it has been shown that the double diagonal system, involved in the Isometrical Truss, possesses greater claims to rigidity and economy than any other web system in use, and also that in the distribution of the strains upon the web members a great economy of sectional area was effected; thus, for example, the rods and braces $a, b, c, d, e, f, g, h$ (Fig. 7), are called upon to perform half the work of the braces and ties of the other systems, hence their sectional area need not exceed one-half that of the corresponding members in the others. In order to apply to this question of economy the more exact test of figures, we have calculated the strains upon the three systems, as represented in Figs. 8, 9, and 10, and having the common data as below:\n\n**SINGLE-TRACK THROUGH BRIDGE.**\n\nSpan, 165.2 feet.\nCentre to centre of chords, 20.438 feet.\nLength of diagonals, 23.6 feet.\nLength of each panel, 11.8 feet.\nWeight of bridge, half ton per lineal foot.\nRolling load, one and a half tons per lineal foot.\nNumber of panels, 14.\n\nThe numbers attached to the different members represent the maximum strain, in tons of two thousand pounds, to which they can possibly be subjected by the action of the moving load and the weight of the bridge itself; and\nthe signs + or — represent compression and tension respectively. It will be observed that the central members of the Isometrical Truss are subjected to both + and — strains. This, of course, is to be understood as due to the counteraction of a moving load, and is provided for in the other systems by members introduced expressly for the purpose. In the Howe truss we have indicated the counter braces, which are not theoretically required, by dotted lines; they are always introduced in practice, but are not required unless it be to hold the angle blocks against which the main braces abut. The method by which the strains were calculated in Figs. 9 and 10 is too well known to need any explanation. In Fig. 8 each system of triangles was treated independently, and the load upon each panel, including the weight of panel itself, was supposed to be applied at the point of each panel division. This is not strictly true in practice, since that portion of the load which is fixed will be partly sustained at the top of each division by the brace, but the error in effect is insignificant.\n\nIt may be interesting to notice that the effect of a change of load from the bottom to the top chord would be to transfer the amount of the minus strains with the signs changed to the compression members in each panel, and vice versa. The first thing that attracts attention in the examination of these figures is the great disparity between the strains upon corresponding members of the Isometrical Truss and the other two; but in order to reduce these figures to a tangible shape it will be necessary to determine the actual amount of material required to resist the strains, in each system, and then determine the relative percentage. This may be effected with sufficient accuracy for our present purpose by adding the total strains having the same signs in each, and multiplying the result by the theoretic length of the members corresponding. Thus the total minus strain in the Isometrical including counter system is 444 tons; assuming a divisor, for safety, of 5 tons per square inch for wrought iron, this will require $88\\frac{6}{10}$ square inches, which, multiplied by 23.6 feet, the length of a diagonal,\nand divided by 144, gives $14\\frac{6}{10}$ cubic feet of wrought iron for one-half the bridge. In the same way the amount of iron in the Howe truss is found to be $17\\frac{9}{10}$ cubic feet, and in the Whipple $20\\frac{9}{10}$ cubic feet. For the plus strains wood has been assumed as the resisting medium, and a corresponding divisor for safety of one-half ton per square inch.\n\nThe results for compression are—\n\n| Name       | Relative economy of iron | Relative economy of wood | Average economy | Remarks                  |\n|------------|--------------------------|--------------------------|-----------------|--------------------------|\n| Isometrical| 100                      | 100                      | 100             | Web system alone in each case. |\n| Whipple    | 143                      | 120                      | 131\\(\\frac{1}{2}\\)|                           |\n| Howe       | 122\\(\\frac{1}{2}\\)      | 187                      | 154\\(\\frac{7}{10}\\)|                           |\n\nThus it appears that the Whipple involves an expenditure of 43 per cent. more iron than the Isometrical in the web system, and 20 per cent. more wood, and the Howe truss 22\\(\\frac{1}{2}\\) per cent. more iron and 87 per cent. more wood. It is possible that some slight variation of these figures might be obtained by a different arrangement of the number of panels, but nothing in general practice will warrant a more favorable expectation for either the Whipple or Howe.\n\nAgain alluding to the subject of ordinary limiting span, we find the end diagonals (Fig 8), subjected to a strain of 95 tons. Taking as before, a divisor of 5, this will require 19 square inches of cross-section, and as there are three rods in each panel, or six in all, we have for each 3.16 square inches, or 2\" round iron. Figures 9 and 10 give for corresponding members 153 and 152 tons, which for the same divisor and number of rods, call for 2\\(\\frac{54}{100}\\)\" round iron,\nwhich, as we have seen, is beyond the ordinary limit of size; while on the other hand, the Isometrical might be increased very considerably in span before the limiting size of $2\\frac{1}{2}$ would be required.\n\nThe above results are but the reduction to figures of the general conclusions arrived at in the earlier part of the discussion, and although they are confined to but three systems of wooden bridges, it is believed that sufficient evidence has been deduced to establish the claim of the Isometrical Truss to the first position among structures of this class.\n\nAlthough our remarks have been confined to two prominent types of wooden bridges, by way of comparison, the same conclusions will apply to structures in iron possessing the same general features. Thus, for example, in the double system of wrought iron columns and diagonals made use of by Mr. Linville in his magnificent bridge across the Ohio at Steubenville, involving a central span of 320 feet, and still later, in the Connecting Railroad bridge across the Schuylkill at Philadelphia of 250 feet span, we find the vertical members of the Whipple repeated, to which, in a great measure, may be attributed the excessive expenditure of $31\\frac{1}{2}$ per cent. of material over the Isometrical. It is true, however, that the introduction of a double system permits an economy of material in the web, over what it would be practicable to effect in the single system of Fig. 10, by enabling the angle between the diagonal and vertical to be increased to its most economical limit, or $55^\\circ$ very nearly. Still another advantage is effected by this double system, the importance of which has been fully discussed in the previous comparisons, namely, the increased facilities for long spans, and in this respect the Isometrical has only a very slight advantage over the Linville truss. For the purpose of instituting an economic comparison between these two bridges in iron, a Linville truss has been arranged and calculated, as in Fig. 11, having the same general data as before mentioned; and one word in this regard, before passing to a comparison of figures. In order to prevent a multiplicity of diagrams, the same height\nof truss and number of panels were assumed for the Linville as the Isometrical, so far as height is concerned, any change would effect both equally in the comparison, but it is possible, that in a practical case, Mr. Linville might introduce a different arrangement of panels in order to bring the diagonal angle more nearly equal to its economical limit of $55^\\circ$. But it is believed that any slight variations of this nature could not affect the result materially.\n\nThe method of procedure in determining the following percentages is precisely similar to that which was adopted in the previous cases, namely, by comparing the absolute quantities of material as determined from the strains marked on the diagrams.\n\n| Name          | Relative economy, Tension | Relative economy, Compression | Average economy | Remarks                  |\n|---------------|---------------------------|------------------------------|-----------------|--------------------------|\n| Isometrical Truss | 100                      | 100                          | 100             | Web system alone in each case. |\n| Linville      | 158                      | 77                           | 119             |                          |\n\nThe result, as will be observed, is not by any means so startling as in the previous cases, since there is an absolute saving of (23) per cent. of material in the compression members against a loss of 58 per cent. in tension, the difference, or 19 per cent., is the proportion of increased expenditure in the web system of the Linville truss over that of the Isometrical.\n\nThe fact that bridges built upon this principle, have fully realized the most sanguine expectations of their projectors, and the public generally, is no argument in favor of the theoretical accuracy of their design nor of the practical economy of their construction, but rather that they are the best applications of the principles upon which they are constructed to practice, and most certainly entitle their originator to a very high rank in the special branch of the profession to which he has devoted his attention.\n\nIt is not by any means claimed for the Isometrical Truss that it is a perfect combination, and consequently superior\nto any and every other now in use, as the writer is well aware, that in the almost infinite variety of circumstances which the engineer is called upon to provide for, the parallel girder must frequently be laid aside for other and more appropriate appliances. But of this we feel compelled to insist that it is the most practical application of the true theory of the action of forces in a parallel girder now in existence.\n\nHitherto our comparative investigations have been confined to the two questions, of economy of construction and adaptability to long spans, and in these we have shown the Isometrical Truss to be founded on sound principles. But there are other considerations involved in the discussion, which are of great importance in arriving at a proper conclusion, and they may be generally expressed by the terms compensation and adjustability.\n\nThe first is understood to be the ability of a structure to adapt itself to the varying circumstances of a changeable temperature and load; and the second, relates to the facilities presented for restoring it to a normal condition, rendered necessary by the deteriorating influences of time. In regard to compensation, the very nature of the construction of the Isometrical Truss, involving as it does, equal equilateral triangles in all directions, involves perfect uniformity of action under either circumstance of change of temperatures or load, hence there can be no distortion of figure within the limits of a maximum load, and the truss is therefore practically rigid.\n\nIn order to illustrate the necessity of proper adjusting facilities in a truss, the following diagram shows the change which takes place in any one panel of a parallel girder, under the action of a load or the deteriorating influence of time.\n\nA deflection below the normal position of the truss manifestly causes a compressive strain on the diagonals $a, a, a$, and a tensile strain upon $b, b, b$. So long as this strain does not exceed the elastic limit of the material, these members will of themselves force a return to the normal immediately upon the removal of a load, and since\nthey are placed in the direction in which the panel changes form, they will require to exert less effort in accomplishing the object than in any other position. For the same reason, if the truss, after a lapse of time, shall have become permanently deflected, we have but to screw up the diagonals $b, b, b$, to secure entire adjustment. The manifest superiority of this system over others involving an adjustment through vertical members, is now apparent, since the best possible way to apply force to $b, b, b$, in order to shorten them, is in their own line of action, and if it becomes necessary, as in the Howe truss, for example, to shorten the vertical rods in order to effect the same result, much greater expenditure of force is required, and this accounts for the fact admitted by all practical bridge builders, that when a Howe truss becomes permanently deflected below the horizontal, expensive false works are necessary to effect a restoration. We shall have occasion to notice the truth of this observation in the discussion of some experiments upon models.\n\nDuring the earlier consideration of some of the questions treated of in this paper, the writer was fortunate enough to secure the perusal of an ably-written analysis of four well-known iron bridges by Mr. C. Shaler Smith; and feeling that the conclusions therein arrived at would warrant a more extended range of favorable comparison for the Isometrical Truss, the Synopsis of Results (see Table III) has been transferred direct. And it is perhaps needless to add that Mr. Smith's well-established reputation is a sufficient guarantee for the correctness of results therein contained.\n**Table III.** (From C. Shaler Smith's Bridge Analysis.)\n\n**SYNOPSIS OF RESULTS**\n\nArrived at from a comparative analysis of the Strains in the Fink, Bollman, Murphy, and Triangular Trusses, and an assignment to each of the exact amount of material in each part necessary to resist the same, according to the conditions of the case, viz., that each Truss shall be able to sustain a load of one ton per foot over the whole of its length, and a concentration of 84,000 lbs. on any panel of its length, without straining any part to more than one-fifth of its breaking weight.\n\n**OVER GRADE BRIDGE.**\n\n| NAME OF TRUSSE | WEIGHT OF MATERIAL IN EACH TRUSSE | WEIGHT OF PER TOWER, EXCEPT BY THE TRUSSE | ACTUAL WEIGHT OF MATERIAL REQUIRED FOR CALCULATION | SURPLUS STRENGTH | DEFICIT IN STRENGTH | WEIGHT OF LOAD AS SUMMED UP IN THE CALCULATION | LOAD-BEARING CAPACITY OF THE TRUSSE AS PORTIONED | RELATIVE ORDER AS TO ADJUSTABILITY | RELATIVE ORDER AS TO STABILITY AND POSITIONS | RELATIVE ORDER AS TO FIRST COST | REMARKS |\n|----------------|----------------------------------|------------------------------------------|-------------------------------------------------|----------------|-------------------|-------------------------------------------------|---------------------------------------------|-----------------------------|---------------------------------|-----------------------------|---------------------|\n| Fink           | 280,992                          | 22,600                                   | 258,392                                         | 272,000        | 13,608            | 448,000                                          | 461,608                                     | 1.78                        | 1                              | 2                              | 1                               | The compensation of the Bollman is superior to that of the Murphy for short span. |\n| Triangular     | 214,640                          | 2,200                                    | 242,440                                         | 272,000        | 29,560            | 448,000                                          | 477,560                                     | 1.97                        | 2                              | 5                              | 2                               | |\n| Murphy         | 285,618                          | 22,600                                   | 263,018                                         | 272,000        | 8,982             | 448,000                                          | 456,952                                     | 1.73                        | 3                              | 4                              | 3                               | |\n| Bollman        | 363,815                          | 22,600                                   | 341,215                                         | 272,000        | 69,215            | 448,000                                          | 378,785                                     | 1.11                        | 4                              | 1                              | 4                               | |\n\n**UNDER GRADE BRIDGE.**\n\n| NAME OF TRUSSE | WEIGHT OF MATERIAL IN EACH TRUSSE | WEIGHT OF PER TOWER, EXCEPT BY THE TRUSSE | ACTUAL WEIGHT OF MATERIAL REQUIRED FOR CALCULATION | SURPLUS STRENGTH | DEFICIT IN STRENGTH | WEIGHT OF LOAD AS SUMMED UP IN THE CALCULATION | LOAD-BEARING CAPACITY OF THE TRUSSE AS PORTIONED | RELATIVE ORDER AS TO ADJUSTABILITY | RELATIVE ORDER AS TO STABILITY AND POSITIONS | RELATIVE ORDER AS TO FIRST COST | REMARKS |\n|----------------|----------------------------------|------------------------------------------|-------------------------------------------------|----------------|-------------------|-------------------------------------------------|---------------------------------------------|-----------------------------|---------------------------------|-----------------------------|---------------------|\n| Fink           | 261,949                          | 3,200                                    | 258,749                                         | 272,000        | 13,251            | 448,000                                          | 464,251                                     | 1.78                        | 1                              | 2                              | 1                               | |\n| Triangular     | 265,404                          | 10,200                                   | 255,204                                         | 272,000        | 16,796            | 448,000                                          | 464,796                                     | 1.82                        | 2                              | 3                              | 2                               | |\n| Murphy         | 296,136                          | 22,600                                   | 273,536                                         | 272,000        | 1,536             | 448,000                                          | 440,464                                     | 1.63                        | 3                              | 4                              | 3                               | |\n| Bollman        | 371,193                          | 3,200                                    | 367,993                                         | 272,000        | 95,993            | 448,000                                          | 352,007                                     | 0.96                        | 4                              | 1                              | 4                               | |\n\n**Note.** —The weight of pier tower used in the foregoing estimate, and made common to all the Trusses except the Triangular, is that of a set of towers now in use under a bridge of this span and depth of truss. By using the single pillar, movable on its pedestal, for the Murphy, instead of the fixed tower, a saving could be made for that bridge of several thousand pounds of cast iron; but the arrangement is not equally stable and safe.\nThe triangular truss mentioned in this connection, is precisely the same as has been noticed in Fig. 6, and the marked superiority of the Isometrical system over this arrangement has, we trust, been fully established. From our previous discussion of the provisions for compensation and adjustment in this system, we feel compelled to assume the responsibility of placing it absolutely first in every respect except, perhaps, its adaptability to all spans and positions; and in this particular an equality is claimed with the Fink.\n\nThe original application of the Isometrical principle to iron bridge construction, is believed to have been made on the Philadelphia and Reading Railroad, in the year 1863. A series of experimental trusses of 60 feet clear span were constructed by the patentee in the shops of the company at Pottstown, and afterwards put up at different points on the line, where they were subjected to the most severe trials capable of being applied in practice, and the results were in all cases highly satisfactory. These same bridges, it may be remarked, are now carrying the heavy trade of this well-known railroad without the slightest indication of weakness or the expenditure of a dollar for adjustment. It was not, however, until the summer of 1865 that any attempt was made to apply these principles to wooden bridge construction, but the results then obtained, although through the medium of experiments upon models, were full and conclusive. A brief description of these experiments may not be uninteresting to our readers. The first model was constructed in the Philadelphia and Reading Railroad Company's shops, at Pottstown, on the general design represented in Fig. 7. It consisted of a single truss of 25 feet span, having its parts proportioned upon a scale of \\( \\frac{1}{8} \\) the size of a bridge 200 feet span, but no provision was made for a system of counterbracing. After placing the model firmly on its supports, and confining the upper chord so as to prevent buckle, a uniform load of castings was applied to the lower chord, of 3500 pounds, producing a deflection of \\( \\frac{1}{8} \\) inches; but in order to test the effect of a want of counterbracing, the castings from one-half the\ntruss were removed, and it was noticed that the braces nearest the middle became loose. In order to remedy this evil, the entire load was removed and iron tie-rods introduced alongside of the braces, and in order to make room for them, their entire section had to be cut out of the chords, top and bottom. After this had been accomplished, and all the parts brought to a proper bearing, the uniform load of 3500 pounds was again applied, but, singularly enough, the truss scarcely deflected \\( \\frac{1}{2} \\) of an inch, and more remarkable still, the rods which had lately been introduced in the direction of the main braces, were evidently carrying a certain proportion of strain. This was manifest to all who witnessed the experiment, both from the tightness of the rods themselves, and the crushed appearance of the wooden washers upon which their bolt heads rested. Feeling confident that some new element of strength had been introduced, it was determined to gradually increase the applied load to the breaking point, if possible, in order to ascertain the conditions of failure; but after occupying all the available space on the chords with castings to the weight of 7600 pounds, and noting a deflection of only one inch, it was thought best to test the effect of time upon the structure under such a load, and in the mean time prepare a Howe truss of same dimensions for comparison. This was accordingly done, but in order to make this truss complete by the introduction of a counterbrace at once, it was found impracticable to retain more than two pieces in the main braces of each panel, while the Isometrical retained three, thus giving it a superiority of one-third the amount of brace timber; in all other respects both trusses were alike, so far as the nature of their designs would permit. Although this single exception is to be regretted, it is not believed that the vast difference between the results obtained can be attributed, even in part, to it, since the tensile system was the same in each, and the Howe truss had not had its chord section decreased one-ninth by the addition of brace-rods, as in the case of the first model. After being set up in place close to its fellow, this truss was loaded in the same manner as\nthe other, with castings accurately weighed for the purpose, but upon the application of 3400 pounds, it was observed that the bottom chord had become so badly bent near the abutments, and depressed in all 1½ inches in the centre, that a complete rupture was feared on the instant, and to prevent entire loss, supports were introduced under the chord until such time as the weight could be removed. A subsequent examination of the model showed the bolt heads connected with the vertical rods badly crushed into the chords, although the bearing was complete throughout, and the original camber of the chords had been permanently changed into an undulating curve, similar to the cross-section of a corrugated plate. The writer attempted to restore the structure to its original position by tightening the vertical rods, but the most violent exertion with a heavy wrench failed to accomplish the object. In fact, the structure was in a condition to require the introduction of false works on a small scale.\n\nTurning to the Isometrical Truss with its load of 7600 lbs. still upon it, a close inspection failed to detect the least indication of weakness, except perhaps the crippled condition of the temporarily introduced wooden washers attached to the brace tie-rods, the curve of deflection in the chord was slightly concave at the centre; but at the ends where the curvature in the Howe was most severe, there was no indication of any depression whatever. The effective area of this chord at the centre was four square inches; the height from centre to centre of chords, 3.05 ft. Hence by the equation of moments:\n\n\\[ P = \\frac{S W}{8 h} = \\frac{25 \\times 7600 \\text{ lbs.}}{8 \\times 3.05} = 7787 \\text{ lbs.} \\]\n\nBut for a divisor of 1000 lbs. per square inch, this would call for \\(7\\frac{7}{10}\\) square inches of chord section, or nearly double the amount actually existing. We are well aware that from the circumstances connected with the construction of models, it is impracticable to extend any numerical results which may be obtained from experiments upon them, directly to the full-sized structures which they may\nrepresent; and for that reason it is not proposed to draw any inferences in favor of the original design for two hundred feet span of which this truss is a model; but viewing these results in the light of a comparison of systems, the evidence is undoubtedly in favor of the triangular web. This after all is but the verification by experiment of the general conclusions arrived at in the earlier discussion of the subject, and the later numerical results obtained by a comparison of strains.\n\nWe therefore feel qualified in passing to general conclusions eminently favorable to the Isometrical Truss. And in submitting these views to members of the profession who may honor them with a careful inspection, we desire again to repeat that if they can be demonstrated to be clearly at variance with correct reasoning, we shall be only too glad to profit by the criticism.\n\n**GENERAL CONCLUSIONS.**\n\nThe Isometrical Truss, founded as it is upon the most practically accurate web system, is necessarily the most economical form of parallel girder now in use, either of wood or iron. And from a comparison of four well-known iron bridges as instituted by C. Shaler Smith, and submitted in Table III, this remark may be extended to cover the best examples of suspension trusses.\n\nNext to economy of construction comes the question of general availability for all spans and positions. We have not thought it necessary to discuss at any great length the comparative merits of the different trusses in this respect, since it involves an amount of detail which would be anything but interesting, and at best quite unnecessary to the formation of a generally accurate opinion; and after all the great desideratum of a perfect web carries with it advantages which are equally applicable to short or long spans through or deck bridges.\n\n**COMPENSATION AND ADJUSTMENT.**\n\nAs to the elements of compensation and adjustment in the Isometrical Truss, we have seen that owing to the equi-\nlateral arrangements of its internal members, no possible distortion of figure can take place under a change of temperature; hence the relative strength of the structure always remains the same. In the iron truss the only effect of a high temperature is to increase the total length of the chords; but in the application of the principle to wood, since one of the diagonals in each panel must be iron and the other wood, the effect of an expansion of the iron is simply to lighten the original camber of the truss to a sufficient extent to bring the brace again into play, and the rigidity of the structure remains unchanged. In fact this is the only case in which compensation is rendered necessary, since in the iron truss, supposing wrought iron to be used throughout, all parts expand equally, and consequently no camber is lost.\n\nAdjustments are rendered necessary when, by reason of the shrinkage of a portion of the material, as in a wooden bridge, or from defects in workmanship, the structure is deflected below the horizontal; and to effect this the diagonals pointing downward towards the centre must be shortened, since we have seen that a lengthening of these members by a rise in temperature will cause depression in a wooden structure, hence reversing the operation will certainly restore the proper elevation. It would scarcely seem necessary, after the general discussion of the action of strains in the web, to devote more time to the question of adjustment, but to add the evidence of experiment we will mention that the model Isometrical Truss was subjected to a variety of trials, by the writer, with a view to determine the facility with which it might be restored to its proper camber, after a supposed shrinkage. All the diagonals were brought to a proper bearing, and the camber of the bottom chord noted carefully, afterwards the entire truss was caused to assume a heavier camber by simply screwing up the diagonal rods, heretofore mentioned, with the thumb and finger, and it was easily seen that any desired elevation within practical limits could be secured by this means. On the other hand, the application of a wrench, with great force, to the rods of the model Howe, alongside,\nhad no other effect than to sink the bolt heads and their washers into the chords, and no change of camber was produced whatever.\n\nThe large plate accompanying this paper represents one span of a single-track through bridge, now being built by the writer, for the Perkiomen Railroad Company, over the Schuylkill River near Phoenixville. All the parts are proportioned to resist the strains, as represented in Fig. 8, and particularly in the braces, is a large margin added above the requirements for safety. It will also be noticed that the connections over the pier and the anchorage involve a considerable expenditure of material beyond what is generally called for in the best railroad bridges. This has been added as a measure of safety, and while in all ordinary cases this item of expense might be dispensed with, the increased feeling of safety in the reduction of the effective span twenty feet, and the perfect immunity from the action of wind, will fully compensate for the increased expenditure of material.\n\nThe several isometrical sketches will serve to illustrate the arrangement of braces and ties, counter braces and counter ties. The angle block is believed to combine advantages over either the original oak block or the later cast-iron Howe, in insuring a uniform bearing over the entire chord without the danger of fracture, as in cast-iron, or of rapid decay, as in the simple oak bearing. We have proposed locust as the best material for the filling of this block, but there are many other species of wood which would answer almost as well; circumstances of convenience had much to do with its selection in this case.\n\nThe connection of the diagonal rods with the bottom chord by means of a 2\" pin directly through the centre of the chord, admits of a considerable saving of material in the bearings, and the application is only rendered possible by the reduced strain involved in this system. It would, of course, be out of the question to admit of attachments of this kind in either the Howe or Whipple, unless the chords were considerably increased beyond the requirements for horizontal strain. A similar remark might be extended\nto the bearing block connections on the top and bottom chords. In the original Howe bearing block, it was found that the material of the chord was eventually crushed and destroyed at the plane of contact, owing, of course, to the enormous strain on the braces and rods near the points of support; but as we have seen that the Isometrical principle permits a reduction of 50 per cent. of this strain, it will readily be admitted that this element of safety fully compensates for all such disturbing causes. In packing the chords with oak blocks and keys, the writer is well aware that there is great liability to rot at the planes of junction, by reason of the deleterious acids contained in the natural oak, but being in a position to test the effect of the Burnettizing process, in neutralizing this destructive tendency, the experiment is made, with an eye to its future application to such parts of the truss as may not be subjected to transverse strain. But inasmuch as the annexed plan of bridge was intended merely as an example of the application of the principles involved in the Isometrical system, it will be unnecessary to examine further into practical details, which, after all, must be left to the test of extended experience, and which cannot affect the general conclusions already submitted.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_24828.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 45, "total-input-tokens": 70514, "total-output-tokens": 14295, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2425, 3], [2425, 3531, 4], [3531, 3531, 5], [3531, 3531, 6], [3531, 3531, 7], [3531, 3531, 8], [3531, 3531, 9], [3531, 3716, 10], [3716, 3716, 11], [3716, 4884, 12], [4884, 5247, 13], [5247, 6434, 14], [6434, 6780, 15], [6780, 8100, 16], [8100, 10276, 17], [10276, 11740, 18], [11740, 12804, 19], [12804, 13872, 20], [13872, 16135, 21], [16135, 16135, 22], [16135, 18383, 23], [18383, 20558, 24], [20558, 22790, 25], [22790, 25035, 26], [25035, 27194, 27], [27194, 29131, 28], [29131, 29131, 29], [29131, 29131, 30], [29131, 31339, 31], [31339, 33290, 32], [33290, 35489, 33], [35489, 37718, 34], [37718, 39840, 35], [39840, 41498, 36], [41498, 47585, 37], [47585, 49814, 38], [49814, 52059, 39], [52059, 54181, 40], [54181, 56151, 41], [56151, 58362, 42], [58362, 60518, 43], [60518, 61826, 44], [61826, 61826, 45]], "primary_language": ["en", "en", "en", "en", "None", "None", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]