[{"id": "8fc771f4811ef8d8476f79a1ac8140b31220f8d2", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e. other than blue or black)/\n  Encre de couleur (i.e. autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [x] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"A SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nExtract from the Minutes of the Council, October, 1872.\n\n\"Alderman Henderson has taken possession of the property occupied by the understanding that the expense of arranging the Mayor, Alderman Henderson, and are hereby directed to make the purpose of the meeting and further, to see fit to make such alterations as may be necessary.\"\n\nA meeting was held at the Town Hall, October, 1872, when Alderman Henderson, Chairman.\n\nMr. Cumberland, Secretary.\n\nMr. Alderman Henderson moved that the question in hand be postponed until referred to them again.\n\nMr. Cumberland seconded the motion, the question in hand being one which he wished to deal with the sanction of the Council, and the statement he was about to make.\n\nThe Chairman said that it would be more convenient to deal with the question for the present, and that he understood that Mr. Cumberland wished entirely without prejudice.\n\nMr. Cumberland then rose and said:\nTHE QUEEN'S WHARF DEPOT LANDS.\n\nThe Corporation of Toronto, and the Northern Railway Co.\n\nAPPOINTMENT OF COMMITTEE OF ENQUIRY.\n\nExtract from the Minutes of the Corporation on Monday, the 7th day of October, 1872.\n\n\"Alderman Turner, seconded by Alderman Hamilton, moved, that whereas considerable delay has taken place in the meeting of the Arbitrators in the matter of the violation of the corporation property occupied by the Northern Railway Company of Canada, and whereas it is desirable that an understanding should be come to with the Company without further delay, and if possible without the expense of arbitration or litigation. Be it resolved, that a select Committee, consisting of His Worship the Mayor, Aldermen Hamilton, Moffatt, Henderson, Thomson, Coatsworth, Kerr and the mover, be and are hereby appointed to wait upon the Managing Director of the Northern Railway Company, for the purpose of taking into consideration the whole matter, and with a view to its speedy settlement; and further, that the Committee report the result of their interview with any recommendation they may see fit to make to this Council for consideration and approval, which was carried.\"\n\nA meeting of the above Committee was held at the City Hall, on Monday, the 28th day of October, 1872, at which were present:—Alderman Turner, Chairman, Aldermen Moffatt, Thomson, Henderson, Hamilton, Kerr and Coatsworth\n\nMr. Cumberland, the Managing Director of the Northern Railway was in attendance.\n\nMr. Alderman Turner having taken the Chair, invited Mr. Cumberland to make any statement which, on behalf of his Company, he was prepared to submit to the Committee on the question referred to them.\n\nMr. Cumberland said he was quite prepared to submit the views of his Company, but that as the question involved many references to dates, public documents, and the like, he should be glad, with the sanction of the Committee, to secure for his own information, a verbatim report of the statement he was about to make, and with that view was accompanied by a reporter.\n\nThe Chairman thought there could be no objection to that course, indeed it might be a great convenience to the Committee to have such a report before them when they came to consider the question for the information of the Council; at the same time it might be well to have a clear understanding that any statements made on either side during the discussion were to be regarded as entirely without prejudice to the rights of either party.\n\nMr. Cumberland having assented to that understanding proceeded to address the Committee, and said:\nMr. CHAPMAN AND GENTLEMEN.\n\nI am much obliged to you for the opportunity which you are so good as to give me by your invitation to discuss this question and to state the views of my Company in regard to the claim of the city for payment for the lands we occupy, because it is high time that some decision should be arrived at upon a matter which may be said to have been an open wound, a sort of running sore, between your Corporation and mine for many years, a subject of contention between us inconvenient and injurious to all the interests involved. Originally invented, a good many years ago, by some municipal hustings orator, it has since been speculatively but systematically revived at each annual election, until that which was at first the mere chance hazard of a municipal candidate searching for a grievance and a cry, has come, insensibly and without knowledge, to be regarded as a real and substantial claim against my Company. It was subsequently submitted to and immersed in the learned and technical argument of the law, and there it has been drifting for a tedious period without much satisfaction to anybody, and without much hope of a solution. I think, therefore, that it may be well to bring the matter to the tribunal of plain common sense, to the judgment of plain business men, in order that by a simple review of the facts and of the real position of the case we may endeavour to reach an understanding of it irrespective of those ingenuities and subtleties of legal statement which so often, and sometimes so justly, defeat themselves by reason of the suspicion attaching to them that more is due to the skill of the advocate than to the merits of the case.\n\nMy opportunities have of course been very ample for acquiring a knowledge of the whole history of the matter in contention, and I am vain enough to fancy that I know all about it. I need scarcely say that in speaking to you today I do not presume to offer you a legal argument—for I know no more of law than any of the rest of you—I only propose to lay before you a plain statement of what I believe to be the facts, and (guided and fortified by the high legal authorities by whom it has been my good fortune to be advised) to state the bearing of the law, as I understand it, upon those facts so far as a layman like myself may venture to apprehend and to apply the bearing of the law upon them; and I am not without hope that the whole question will be found to be so plain in all its material features as to lead you to appreciate and adopt the views which have induced my Company to ignore the claims which have been urged on behalf of your Corporation to the slightest semblance of a right in regard to the lands which have been the subject of contention.\n\nIt may be well for us to start by enquiring how it was that the Northern Railway Company came into possession of these lands, whether the original owners of them were parties to that possession, and by what authority and under what procedure and conditions we took and now occupy them.\n\nBy reference to the original Charter of the Company, assented to by Her Majesty in Council on the 30th July, 1849, and proclaimed in Canada on the 29th August, 1849, you will find that the Company had power, under Clauses 10, 11, 12, 15, and 16, to take and acquire property, whether belonging to the Crown or otherwise, necessary to the construction of their line and works.\n\nAccordingly we find that in pursuance of those powers the then Directors took the necessary and proper steps for acquiring the lands now under discussion, and that by a Board Minute of the 5th October, 1851, \"a letter was read from the Chief Engineer, dated, 28th September, 1851, reporting his opinion as to the quantity of land required for the Freight Terminus on the east side of the Queen's Wharf, and enclosing a plan of the same * * * and recommending also that when application is made to the Officers of Ordnance they be also requested to grant the two acres of land marked A and B adjoining the Provincial Lunatic Asylum.\"\n\n\"The Secretary reported that in pursuance of instructions he had directed the Chief Engineer to put himself in communication with the Officer commanding the Royal Engineers with a view to determining the questions referred to,\"\n\n\"That he had also communicated to the Commanding Officer of Engineers, the authority so given to the Chief Engineer to act in the matter on the part of this Company.\"\n\"ORDERED, that the recommendations of the Chief Engineer be hereby adopted, and\nthe proceedings of the Secretary thereon in pursuance of his instructions be confirmed.\"\n\nSubsequently to this Mr. Philpotts, Solicitor, was instructed by Board Minute of the 9th Nov.,\n1851, \"to proceed forthwith to Montreal and make the best arrangements possible with the\nrespective Officers of Ordnance, in regard to the necessary lands at the Asylum and\nQueen's Wharf, for the purposes of the Company.\"\n\nNow, previous to this, and to pave the way for these negotiations, the then President of the\nCompany, (the Honorable Henry John Boulton,) had by letter of the 27th October, 1851, notified the\nBoard of Ordnance that these lands would be required by the Company. In that letter he made ap-\nplication for \"certain portions of the Military Reserve in Toronto, which the Company require for a\ncertain portion of their line, and for convenient sites for Stations, Work-shops, and other\nappurtenances.\"\n\n\"Your Honorable Board,\" he says, \"will perceive by the Act incorporating the Com-\npany that it received the special assent of Her Majesty in Council on 30th July, 1849,\npromulgated by proclamation in Canada on 29th August, 1849.\"\n\n\"The Clauses relating to the acquisition of property belonging to the Crown or other-\nwise are numbered 10, 11, 12, 15, and 16, and to which the attention of your Honorable\nBoard is respectfully called.\"\n\nThat then was ample and sufficient notice, from the Company to the Board of Ordnance, of\nan intention to take, under the powers of their Charter, the lands referred to and then vested in that\nBody;—it was a clear intimation that, should the exercise of those powers be necessary—that is to\nsay, should the Officers of Ordnance decline to acquiesce in the taking of these lands by the Com-\npany—the Company would nevertheless take the lands under the authority of its Charter.\n\nBut the Officers of Ordnance did acquiesce, and we find that the Lieutenant-General command-\ning in Canada made a Minute on the 14th November, 1851, on the above application, to the effect\nthat the Lieutenant-General commanding has no military objection to the proposed\nmeasure, * * * that the value of the land is estimated at £200 currency per\nacre, * * * that no revenues are derived from it, * * * and that\nthe matter has been sent home for the decision of the Board of Ordnance.\"\n\nAccordingly, we find that on the 9th January, 1852, the Secretary of the Board of Ordnance,\nin London, addressed a letter to the Secretary of State for the Colonies, recognizing the right of the\nCompany to take these lands, and providing for their transfer in the following terms:—\"It seems\nfrom these reports, (from the Inspector General of Fortifications, the Ordnance Store-\nkeeper, and the Ordnance Solicitor) there is no doubt that under the provisions of the\n10th clause of the Act to incorporate the Ontario Simcoe and Huron Railway Company,\nthe Company cannot be considered to have acted illegally in entering the reserve without\nprevious consent, and that the Department can only insist upon compensation in the\nmanner prescribed by the Company's Act, which will be to demand of the Company\nsuch a sum as may be considered the fair value of the land taken, and if refused, to\nhave the price fixed by the Chairman of the General Quarter Sessions, and the Justices\nas provided by the 17th Section of the Railway Act, allowing whatever sum may be so\nrecovered to be paid into the military chest to the public credit, * * * in which\nproposition the Master-General and Board request the acquiescence of the Secretary of\nState, and through his Lordship, of the Secretary of War.\"\n\nThereupon an order of the Board of Ordnance, dated 2nd February, 1852, was sent to the\nCompany, transmitting a copy of the above letter, and approving of the proceedings of the respective\nOfficers of Ordnance, at Montreal, under which \"the Ontario Simcoe, and Huron Railway Company\nhad taken possession of that portion of the Ordnance Reserve, at Toronto, which they\nrequired.\"\nWell, sir, the order of the Directors, in relation to the lands \"which they required,\" is to be found in a Board Minute of the 23rd December, 1851, in the following words:\n\n\"ORDERED. That the Chief Engineer be required forthwith to enter into and upon and to set out and appropriate the necessary quantity of land on the Bay shore, immediately east of the Queen's Wharf, for a Freight Depot, including all necessary accessories for the uses of the Company, and to prepare plans and specifications for the necessary wharves, warehouses and other buildings thereon, to be submitted to the Board as early as practicable.\"\n\nImmediate possession was therupon taken of all the land to the south of Front Street, lying between the Queen's Wharf and the west side of Brock Street, produced to what is known as \"the Windmill line,\" Mr Alfred Brunel and myself being personally present and directing the procedure in pursuance of the Board's order above recited.\n\nI contend then that these lands were, on the 23rd December, 1851 (and the date is of some importance), possessed and acquired by the Company under the powers of its Charter, in all due and sufficient form, and with the sanction of the then occupiers and owners of the property, viz., the Imperial Ordnance authorities.\n\nAs the claim of the city to any control of or rights in regard to these lands is based solely on a License of Occupation granted to it by the Government of Canada on the 29th March, 1853, it becomes important to note that we entered upon possession on the 23rd December, 1851, and to enquire in whom the title to these lands then was.\n\nNow it is beyond all question that the title of all lands set apart as \"Military Reserves\" (of which the lands in question indisputably formed part) had always been in the Crown until by the passing of the Act, 7 Vic., cap. 11, (1844), the same were vested in \"the Principal Officers of Her Majesty's Ordnance,\" and all lands set apart for Military Reserves, which had not been disposed of by the Crown previously to the passing of that Act, were then and thereby vested in the said Officers; and they continued so vested until the passing of the Act, 19 Vic., cap. 45, (June 1856), which transferred some of them to Her Majesty's Principal Secretary of State, and vested the remainder in Her Majesty for the benefit of the Province. From 1844, therefore, until June, 1856 the Military Reserves were vested in the Officers of Ordnance, and it was only at the latter date (June, 1856) that the Provincial Government came into any control or authority over them; whilst the Act (19 Vic., cap. 45) which gave them that control expressly declares that the transfer thereby made of the Military Reserves from the Officers of Ordnance to the Provincial Government shall be subject to all sales, agreements, &c., already entered into with or by the Principal Officers, and specifically and in words reserves the rights of the Ontario, Simcoe, and Huron Railway Company in regard to the lands then occupied by them.\n\nI contend then that it is indisputable that the title of these lands was in the Crown until 1844; that then, by the Act, 7 Vic., cap. 11, the title passed to the Principal Officers of Ordnance, and that it continued vested in them until June, 1856, when, by the Act 19 Vic., cap. 45, the title again passed (in part,) to the Provincial Government, but subject to \"all sales, agreements, &c., then already entered into with or by the Principal Officers;\" and inasmuch as we entered upon these lands on the 23rd December, 1851, under the powers of our Charter and with the acquiescence of \"the Master General and Board of Ordnance,\" of the Secretary of State and of the Secretary of War (as expressed in the documents I have recited;) that the License of Occupation granted by the Provincial Government to the City on the 29th March, 1853, upon which alone your Corporation rests its claim, had and could have no force or effect in regard to these lands.\n\nBut, you will naturally ask, what then was the meaning of this License of Occupation so issued by the Provincial Government? If the title to these lands was not then (March, 1853) vested in the Government, to what lands did they, by that instrument, intend to convey to your Corporation a right of occupation?\n\nviz.: to those lands which were at that time in the hands of the Imperial Ordnance authorities, and which would have been transferred to the City by virtue of the Ordinance of 1856.\nAnd here it may be well to direct your attention to the particular reservations made in that License, which you will find is made \"subject to any claims that may be established by the respective Officers of Her Majesty's Ordnance, by the Military Authorities, and also to the occupation by the Ontario, Simcoe and Huron Railway Company of such space as may be necessary for them for the purpose of a Terminus, and which has already been taken possession of by them.\"\n\nNow, in my humble judgment, these reservations, taken in connection with the chain of the title as I have already set it out, yield the whole question as regards the land then already occupied by my Company; for at the date of that License we were already in possession, under agreement with the Officers of Her Majesty's Ordnance, who were, moreover, the owners of all the Military reserves until June, 1856, or upwards of three years after the License was issued.\n\nBut the lands of which we became possessed on the 23rd December, 1851, were in truth of two kinds, viz., \"land\" (dry land), and \"land covered with water,\" an expression and distinction which you will find set out in words in the License itself.\n\nNow whilst we contend that the title of the \"land\" was in the Officers of Ordnance, we quite admit that the title of \"the land covered with water\" was in the Provincial Government; and we submit that by keeping this distinction in view, and thus only, the language of the License is consistent with the exclusion of the land (as vested in the Ordnance) from its operation, and with the evident intention of the Government to License to the city all and whatever lands, and land covered with water, between the Queen's Wharf and Brock Street, as were not then vested in the Ordnance, or subject to any claims or agreements made and established by them.\n\nI believe this interpretation to be the true one, for it is monstrous to suppose that when granting the License the Government was ignorant of the fact that the \"land\" was vested in the Ordnance, and utterly beyond their control and authority; whilst it is quite reasonable to assume that it was the intention of the Government to convey all the land and lands covered with water over which it was then competent for them to exercise jurisdiction.\n\nI repeat (for the point is of importance) that there seems to me to be no other solution of the difficulties involved in the language of the License, taken in connection with the facts of the case, and the position of the titles; for it is absurd to pretend that in March, 1853, the Provincial Government should assume to deal with property altogether beyond its jurisdiction—to give a License of occupation to lands vested in another and a higher authority, and already occupied \"in perpetuity,\" and under Charter powers by another corporation—reserving nevertheless the rights of both—and notwithstanding that it reserves the occupation by my Company and the rights of the Ordnance from whom we acquired the land) yet directs payment of the value of those lands to the city.\n\nAccording then to my reading, the License, in effect, says to the city \"we convey to you whatever lands we possess and control,\" and to the Company it says \"you shall be protected and maintained in the possession of your lands, but you must pay to the Ordnance whatever claim they have against you for the land (dry land) taken from them, and you must pay to the city for the remainder (the land covered with water) the fair value thereof at the time you took it, to assist the city in the construction of the public works, in aid of which the License is granted.\n\nI ask you then, gentlemen, to observe that I assume so far, to have established two positions, viz.: 1st, That you have no claim whatever in connection with the land taken from the Ordnance; and 2nd, That your claim is limited to the land covered with water to which alone it was competent to the Government to convey to you any rights at all.\n\nWe will now, if you please, proceed to consider the nature and extent of your claim in respect of the land covered with water observing, however, that the argument I propose to present to you, would have equal force in regard to the dry lands were they not dismissed, as I have dismissed them, altogether from the case.\nBy a survey and report made by Mr. Sandford Fleming (who was the Engineer of the Company and Surveyor to the Ordnance) it appears that in addition to the 1165 acres of \"land\" taken from the Ordnance there were about 20 acres of land covered with water, to be reclaimed from the Bay by breast-work and earth-filling; and it is these 20 acres to which I am about to apply the terms of the License of Occupation.\n\nNow the original intention when the License of Occupation was granted, is admitted by Mr. Dalton (your own Counsel) in his letter of the 1st January, 1864, to have been in view of, and as a provision for, the construction of an Esplanade by the City to the Queen's Wharf. The Report of the Executive Council, approved by the Governor-General on the 9th December, 1852, and upon which the License of Occupation of the 29th March, 1853 was subsequently based, contains the following language:\n\n\"The Committee have taken into consideration the Report of the Commissioner of Crown Lands dated 10th August, 1852 on an application by the Mayor and Corporation of the City of Toronto, for a grant of the water frontage opposite the said city, and extending from the entrance of the Harbor at the Queen's Wharf to Simcoe Street, for the formation of a continuous Esplanade, by filling out to a certain line to meet the increasing commercial business of that City, and for other public purposes.\n\n\"The Committee humbly advise that pending an application to Parliament for authority to convey water lots to the Corporation at a nominal price to enable them to carry into effect great public improvements, a License of Occupation be granted to the Corporation of the City of Toronto for the unpatented water lots on the following conditions. 1st. That the Esplanade contemplated to be made along the said water frontage shall commence within a period of one year, and be duly proceeded with and properly maintained upon a plan to be submitted to and approved by your Excellency in Council.\"\n\nAgain in a subsequent Report of the Executive Council, approved by His Excellency on the 29th March, 1853, \"The Committee of Council recommend that the License of Occupation be issued as prayed for to the Mayor, Aldermen and citizens of Toronto, subject, however, to any claims which may be established by the respective officers of Her Majesty's Ordnance, or by the Military Authorities, and subject also to the occupation by the Ontario, Simcoe and Huron Railway Company, of such space as may be necessary for them for the purpose of a Terminus, and which has already been taken possession of by them and subject generally to the other conditions imposed by the Order in Council of 9th December, 1852.\n\nAnd finally, the License of Occupation itself, after describing the water lots to be transferred to the City, comprising the whole frontage from the east of Peter Street to the Queen's Wharf; contains the following terms, viz.: \"To have and to hold the aforesaid parcels of land unto the said Mayor, Aldermen and Common Council of the City of Toronto, and their successors in office for and during pleasure, subject nevertheless to the following limitations and conditions, that is to say—\n\n1st. That the Esplanade contemplated to be made along the said water frontage be commenced within a period of one year, and be duly proceeded with and properly maintained upon a plan to be submitted to and approved by me in Council.\"\n\nWe thus see that in the Reports quoted, as well as in the License itself, the transfer of the water lots between Peter and Bathurst Streets was conditional upon the construction by the City of an Esplanade \"along the said water frontage,\" and further, upon the commencement of that work within one year from the 29th March, 1853.\n\nNow that order in Council, as I believe you will admit, has never been altered, it has never been amended, it has never been rescinded. It remains today just what it was when issued; whatever its merits then were, whatever rights it then gave, or whatever conditions it then imposed are neither increased nor diminished, and if you have any title at all under that instrument, you must take it just as it stands, with all its conditions; you cannot take its benefits and reject its burdens, you cannot claim under one clause and repudiate the provisions of another, you must accept it as a whole.\nand without evasion of any part. It is as clear as noonday that the intention of the License formed and framed on the petition of the Corporation itself was precisely what the words express—that you should get a License of Occupation to certain lands in order to assist ten to construct, and on condition that you constructed, a \"continuous Esplanade from the Queen's wharf to Simcoe Street,\" and, that you should commence its construction within one year from the date of the License. Have you done this? And not having done it, do you now repudiate your liability to do it, and claiming exemption from the conditions imposed upon the grant, yet seek to secure to yourselves all its advantages.\n\nAnd here it may be convenient for me to note that in corroboration of the condition so to construct that Esplanade, there is a further condition in the License in the following words, viz: \"2nd\n\n\"that a right of way be secured to the public, or to such Public Corporations over such portions of the said tracts or parcels of land, and for such purposes and subject to such regulations as shall be approved by me in Council.\"\n\nNow everybody knows that the object of that provision was to secure to the Grand Trunk Railway, as well as to the Great Western and the Northern Railways, a right of way from the west into the City, and we find this object specifically set out in a Report of the Committee of the Executive Council approved on the 2nd of September, 1859, where it is stated that \"the Committee have had under consideration a communication dated June, 1858, from the Board of Railway Commissioners, containing a proposal to bring the Great Western, the Grand Trunk and the Northern lines of Railways, under one fence passing to the North of the old branches to the block of land and water frontage lying to the South of the present Parliament Buildings in the City of Toronto;\" and further on it says \"that the Grand Trunk Railway shall make all the necessary arrangements without charge to the Government for a more convenient approach to the City, and to the proposed site for the Passenger terminus, in the manner shown in the plan submitted,\" which plan showed that the lines of the Railways were to be carried over and upon the \"continuous line of Esplanade from the Queen's Wharf to Simcoe Street,\" which, under the conditions of the License, the City was bound to construct.\n\nWe accordingly contend that the License of Occupation was conditional upon these three provisions: 1st, The construction of the continuous line of Esplanade from the Queen's Wharf to Simcoe Street; 2nd, Upon the commencement of that work within one year from the date of the License; and 3rd, The granting of a Railway right of way upon that Esplanade after it should be constructed; and we say that as none of these conditions have been complied with, you have no rights whatever to or in connection with the lands covered with water dealt with in the License, and that the License is forfeit.\n\nBut it has been contended on behalf of the City that the condition in the License requiring the City to construct the Esplanade did not involve the construction of it on the frontage granted, and from the Queen's Wharf to Simcoe Street; but that the condition has been satisfied by the construction of the Esplanade East of Brock Street as now existing.\n\nUnfortunately for that view, however, I shall be able to show that you yourselves recognized your liability to construct the continuous Esplanade from the Queen's Wharf Eastward, in various public documents, and over and over again. Why, your own Counsel (Mr. Dalton) in a letter addressed to the Commissioner of Crown Lands dated 1st January, 1864, admits that the License was originally granted in view of, and as a provision for, the construction of an esplanade, by the City, to the Queen's Wharf; and in another letter (9th April, 1863) he says that \"the esplanade to Brock Street, mentioned in the agreement of 21st June, 1856, is substituted by the effect of all that took place for the Esplanade mentioned in the License,\" namely, an Esplanade to the Queen's Wharf; but that \"whatever rights the Northern Railway had under the License still remain, because the Northern Railway was not a party to the agreement mentioned,\" which I take to mean that if we were called upon under the License to pay the City for the lands taken, we had a right to demand from the City the construction of the Esplanade as a condition precedent to the payment.\nIn this same letter, growing bolder as he goes, and remembering the condition of the License as to a right of way, he demands, amongst other things, that \"the continuation of the Esplanade, and the track of the Grand Trunk thereon, from Brock Street to the Queen's Wharf should be preserved.\" And upon this point he says: \"I beg to refer to the contract between the City and the Grand Trunk Railway Company, dated 30th August, 1856, by which the City relying on the License of Occupation became bound to the Grand Trunk to furnish them a right of way to the Queen's Wharf from Brock Street Westward, along the present [sic.] line of the Esplanade.\" The \"present line of Esplanade!\" Why, sir, it is we who have done the work, it is my Company that has built the breastwork and filled in the water and made it land! And yet Mr. Dalton claims for the City all the advantages to the City of the License—that is the right in the lands and the right to be paid for them by us—because the License requires them to give a right of way to the Grand Trunk, which they have not given, over works which by the same instrument they were bound to construct, but which we, not they, have constructed at our own cost!\n\nIt is clear that when Mr. Dalton claimed in that letter that \"the License of Occupation should be carried out\" he forgot that if the Northern was called upon to pay for the land it took, the City, as a condition precedent thereto, was also called upon, as he admits, to construct an Esplanade in front of that land; and upon that Esplanade, so constructed, to give a right of way to the respective Railway Companies.\n\nBut I shall be able to show that when the City entered into the agreement of the 30th August, 1856, limiting the construction of the Esplanade to the frontage East of Brock, it had been discovered that the cost of the Esplanade thence to the Queen's Wharf would be immensely in excess of the most exaggerated value to be attached to the lands for which they would thus acquire a right to payment; and that it was in the economical interest of the City to forfeit all the advantages of the License and all claim to the lands West of Brock Street, rather than to undertake the construction of the Esplanade as originally required by the License.\n\nI shall proceed to establish this by reference to various public documents setting out the policy and action of the City in this matter.\n\nBy the Report (No. 5) of the Standing Committee on Wharves and Harbors, dated 22 April, 1854, and signed by the Honorable G. W. Allan, Chairman, the Committee gives a review of \"the subjects connected with the undertaking\" (the Esplanade), the nature of the Tenure by which the Corporation holds the water lots, &c., and proceeds to state that \"by a License of Occupation issued by the G. G. on the 27th March, 1853, in conformity with previous orders in Council, the City acquired the right to occupy all the water lots between the west side of Peter Street and the Queen's Wharf subject, however, to the following conditions\" (amongst others), \"namely, that the Esplanade to be built along the water frontage of these lots should be commenced within a year from the date of the License of Occupation;\" and it proceeds to say that \"powers were given to the Corporation by the Act 10, Vic. cap. 219 to contract for the building of the Esplanade across the water lots held under the License of Occupation according to the provisions of the said License.\" But a new plan of the Esplanade having been adopted, \"the City had only the power to contract for the construction of the Esplanade, according to the new plan, along that part of the water frontage held under the License of Occupation and extending from Brock Street to Simcoe Street,\" thus showing that the portion west of Brock Street to the Queen's Wharf had been abandoned.\n\nAgain on 11th September, 1854, the 12th Report of the Committee on Finance and Assessment and signed by E. H. Rutherford, in giving a statement of \"unproductive property\" includes \"the water lots between Peter Street and the Queen's Wharf for the purpose of an Esplanade, and for which the only title yet given is a License of Occupation.\"\n\nAgain, on the 12th March, 1855, a Select Committee was appointed, with Mr. Adam Wilson as Chairman, to furnish \"the fullest information on the subject of the Esplanade,\" and to whom all papers connected therewith were referred,\" and in the Report of that Committee we find that whilst the Esplanade Act of 1853 was before the Legislature \"the City obtained a License of Occupation...\"\nof certain water lots and strips of land between Rees' Wharf and the Queen's Wharf, subject, among other conditions, to the condition of commencing the Esplanade within one year from the date of the License, and building the same upon a plan to be submitted to and approved by the Governor-General in Council.\n\nThe Esplanade Act of 1853 was then passed upon the petition of the Corporation; and giving power to the City to contract with any one to erect and build an Esplanade in front of and upon the water lots in the City described in the letters patent and License of Occupation.\n\nAnd further on it states that \"at the request of the Committee on Wharves and Harbors Mr. Shanly prepared a plan and specifications for the construction of an Esplanade between the Queen's Wharf and Berkeley street, the site being the original line according to the Letters Patent from Berkeley Street to Simcoe Street, and from thence it was continued in a direct line to a point on the Queen's Wharf, distance about 450 feet from the Shore.\"\n\nAnd again \"Mr. Thomas also prepared a plan of Esplanade on the same site as Mr. Shanly,\" and \"Mr. Howard also prepared a plan of Esplanade commencing at a point on the Queen's Wharf about 178 feet further South than Mr. Shanly's, and running from thence to Simcoe Street in a direct line.\"\n\nTenders were received on 10th September, 1853, for constructing the works on the respective plans of these Engineers; the lowest being on Mr. Shanly's plan, £100,000, and on Mr. Howard's plan, £75,000.\n\nI have troubled you with these extracts to show that up to the 10th September, 1853, the city recognised the condition imposed upon it by the License of Occupation to construct the Esplanade to the Queen's Wharf,—it obtained legislative powers for the purpose, it instructed the Engineers to embrace that portion of the work in their designs and estimates; and it even went so far as to receive tenders from contractors for its construction.\n\nBut now there came a change, and we find from the same report that none of the tenders received on the 10th September, 1853, were accepted, but that on the 7th October, ensuing, a new tender was made for an Esplanade, \"commencing at Brock Street and extending to the Eastern extremity of the City;\" thus suddenly, and for the first time abandoning that portion of it West of Brock, and crossing the lands granted by the License.\n\nI have no desire to stir up the dirty water agitated at the time by this famous report of Mr. Adam Wilson, but I may be permitted to observe that your own Committee, of which he was chairman, did not hesitate to impute the change to a desire to escape from the construction of the most difficult and costly portion of the whole work, namely, that between Brock Street and the Queen's Wharf, where as the report states, the water was deepest.\n\nAt any rate that work was abandoned, and on the 4th January, 1854, a contract was executed for an Esplanade \"commencing at Brock Street,\" and in referring to this limitation of the work the Report proceeds to explain that \"the whole distance between the Queen's Wharf and Brock Street, has been abandoned, a distance of rather more than 1700 feet, the cost of which, including the jetty at the Queen's Wharf would be, according to Mr. Shanly's estimate, £25,799.\"\n\nMay I not say, gentlemen, that here at length we have reached the secret and the justification of the default of the City to conform to and fulfil the conditions of the License, which was to give them a right to payment for these lands, and to give them nothing more. Why at the above estimate (and who would doubt the accuracy of Mr. Shanly's estimate?) of nearly £26,000, the outlay in works necessary to secure payment of the value of the land would have been ten times as much as the lands were worth, even at a most extravagant valuation; and so most people would conclude, as I think was the fact and the motive, that the Corporation, in the interest of economy, did well and wisely in receding from so expensive a bargain.\n\nBut I must tax your patience a little further upon this part of the subject.\nNot very long after the construction of the Esplanade from Brock Street had commenced, difficulties arose between the Corporation and its contractors, and these difficulties culminated in the quashing of the contract of the 4th January, 1854. It was, as all will remember, of the utmost public importance that the Eastern and Western portions of the Grand Trunk Railway should be connected at Toronto without delay; and so we find that the Railway Commissioners represented by the Honorable Mr. Killaly united with the Corporation and the Grand Trunk Company in devising some measures for allaying the disputes which had arisen, and for securing the early resumption and completion of the works; and these efforts resulted in the execution of a second contract made directly with the Grand Trunk Company, and dated 30th August, 1856, which contract was again for an Esplanade, commencing at Brock Street, and again abandoning all that portion of the original proposition between Brock Street and the Queen's Wharf required by the conditions of the License of Occupation.\n\nI advert to this part of the proceedings, because it has been urged that the presence and influence of Mr. Killaly, acting for the Railway Commissioners and the Government, and his participation, in promoting the contract for \"an Esplanade, commencing on Brock Street,\" was a waiver of the condition of the License, which required \"a continuous Esplanade from the Queen's Wharf,\" and consequently (as Mr. Dalton puts it), that \"the License continues to the City free of trusts.\"\n\nBut I am led to doubt whether that learned authority was quite as industrious as I have been in hunting up the facts, else he would have observed that long before the contract was entered into with the Grand Trunk, (August, 1856,)—before Mr. Killaly had any connection whatever with the matter—and under the terms of the original contract, executed on the 4th January, 1854, the Corporation had of its own judgment and motion, in its own interest, and without assistance, interference, or recognition of the Government, voluntarily \"abandoned\" the Esplanade from the Queen's Wharf, and had voluntarily receded from the conditions of the License. In the absence of any authoritative \"waiver\" of the conditions of the License—and I have never seen or heard of any—I venture to submit that Mr. Killaly's implied assent to the second or any other contract would be wholly insufficient to invalidate the conditions of the License, and to grant these lands to the City \"free of the trusts,\" under which they were to receive them.\n\nOn the revision of all the facts I think you will come to the conclusion that the Corporation did a very wise, prudent, and economical thing, when they withdrew from all the liabilities imposed upon them by the License, and thus purposely and of policy allowed the License to be forfeited by failure of its conditions; for supposing (I say \"supposing\" for I make no proposition)—supposing that you could retrace your steps and that in order to secure payment for the land you were invited to pay to my Company, the actual cost of the works which as a condition of the License you were to execute, but which we have constructed and paid for,—would you do it? I assume not, and if not, then, the conclusion would seem to be inevitable that you justify and vindicate the action of your predecessors, in avoiding a very bad bargain, and in placing the burden of the works upon us.\n\nBut however that may be, we contend that the License has been forfeited, that you now have no locus standi in connection with it, and no claim whatever upon us: nay, we go further, and say that as we have constructed the works demanded by the License, and have transferred the Railway right of way to the other Railway Companies, as required by its terms, we are equitably entitled, and that the Patent ought to issue to us.\n\nHere my statement of the case might stop, but it may be interesting and convenient to you that I should discuss some further points in relation to the actual value of the lands; and to whom, if at all, payment should be made.\n\nReverting to the Report of Mr. Fleming we find that the area of \"land\" (as distinguished from \"land covered with water\") originally taken by my Company in December, 1851, was 11.65 acres, of which 6.25 acres have since been transferred to the Grand Trunk and Great Western Railways free of charge as a right of way from the Queen's Wharf to Brock Street; leaving a balance of 5.40 acres of the land originally taken and now in possession of my Company. This land I contend, as you will remember, was Ordnance land, and whatever may be paid for it must, as stated in the letter of the Secretary of the Board of Ordnance of the 9th January, 1852, be paid \"into the Military Chest to the public credit.\" Now the respective Officers of Ordnance reported\non the 15th November, 1851 that these lands were worth £200 per acre. But the lands included in this valuation comprised those east of Brock Street to Peter Street, upon which the offices of Ordnance and Ordnance stores were then located; and these lands were of much higher value than those west of Brock Street, which were then an open and broken front, unoccupied by any class of buildings; and it can be established by evidence that $250 or $300 per acre would have been regarded as a high valuation. But assuming $500 as an outside figure, then we have 5.40 acres at $500 per acre = $2,700; and taking the date of the order of the Board of Ordnance (2nd February, 1852) as the date of transfer from which interest ought to be computed say to 2nd February, 1873, we have 21 years interest at six per cent, or $3,602; giving a total sum, principal and interest, of $6,102 for the 5.40 acres taken from the Ordnance.\n\nThis payment if made to anybody must be made, on the original terms of the order of the Board of Ordnance, to the Imperial \"Military Chest to the public credit,\" for not only does the License of Occupation reserve the claims of the Respective Officers of Ordnance, but the Act 19 Vic., cap. 45, transferring the Military Reserves to the Provincial Government makes like reservation, whilst the Esplanade Act of 1853 itself declares by the 10th Section that it shall not apply to or affect any lands or property vested in the Principal Officers of Her Majesty's Ordnance.\n\nSo also it may be worth while to consider what value might be attached to the 20 acres of land covered with water which we also took in December, 1851, and payment for which might have been claimed by the City if the License of Occupation had not been forfeited by non-fulfilment of its conditions. Now we know that in the eastern portions of the City where property rules very high, there were many water lots which, after they were filled, would not sell for the amount which it cost to fill them; and we know that some water lot owners preferred to forfeit their lots rather than pay that cost. If, then, the land of the Ordnance—good sound terra firma—was not worth more than $500 per acre in 1851, we may very safely assume that the land covered with water (to an average depth of ten feet, and, therefore, most costly to utilize) was not worth more than $100 per acre, at the highest. At that rate we should have 20 acres at $100 = $2,000 and with interest for 21 years, say $2,520, a total sum of $4,520, or an aggregate amount for all the lands now occupied by my Company, of $10,622—subject to reduction in regard to the Railway right of way, to which in any event we were freely entitled. You will see, therefore, that the question at issue as a mere money question is not one of any vital importance even if the question of \"right\" did not intervene.\n\nTo sum up,—I contend:\n\n1st. That were you entitled, which we deny, to payment for the \"land,\" and \"land covered with water\" now, of right, in occupation of my Company, the amount at the highest computation (principal and interest) cannot, on deduction for \"Railway right of way,\" exceed $8,000; a sum in itself utterly insignificant in comparison to the advantages we have conferred upon the city by our enormous outlay in utilizing those lands, and thus directly contributing under assessment of those works an average sum of very nearly $6,000 per annum to your revenues. Nor can I forbear from adding that whilst you have been strangely led to claim payment from us, even for the \"right of way,\" (which under your License you were to have provided, but which we have made for ourselves), you have never, so far as I know, attempted to exact a like payment from the other Railway Companies who have entered upon and now occupy 6½ acres of these same lands as \"the right of way\" to which they are entitled.\n\n2nd. I submit that the \"land\" originally taken under agreement with the Ordnance authorities, and which we (and the other Railway Companies) now occupy, was not within the jurisdiction of the Provincial Government at the date of the issue of the License upon which alone you base your alleged rights; but that the title of that land was actually in the \"Officers of Ordnance\" until three years and three months after that date, and even then, that the transfer protected all the rights of the \"Officers of Ordnance,\" and was \"subject to all sales, agreements, &c,\" previously entered into with or by them; and we accordingly contend that if payment is to be made to any one, it must be to the Imperial Ordnance authorities, or (in the language of the order), \"into the military chest to the public credit.\"\n3rd. I further submit, as to \"the lands covered with water,\" the title of which at the date of the License was undoubtedly in the Provincial Government, that the License was conditional.\n\n1. Upon your constructing and maintaining a continuous esplanade from the Queen's Wharf to the Eastward.\n\n2. That you should commence that work within one year from the date of the License.\n\n3. That you should grant a free right of way throughout the frontage, and upon the works so constructed to the respective Railway Companies.\n\nAnd, I say, that inasmuch as you have not complied with any of these conditions, and have evaded the outlay necessary thereto, you are not entitled to any of the advantages which the License might otherwise have conferred upon you.\n\nAnd finally, having reference to like cases as between private owners of water lots and the Corporation in regard to the Esplanade, I contend that inasmuch as my Company has taken upon itself the burden of the works dictated by the License,—has constructed and is maintaining them,—and has transferred a \"right of way\" to the other Railway Corporations:—has in fact satisfied all the conditions of the License, we are equitably entitled to the Patent and ought to receive it.\n\nSuch, Sir, is our view of the position which I respectfully present to the consideration of the Committee; observing that we are most anxious to reach some friendly settlement of the question, if such be possible; for whilst (and I say it with all possible deference) we shall, if need be, defend our rights to the highest appeal to which they can be carried, we yet feel that it would be in the public interest as well as to the advantage of my Company to accomplish such a friendly adjustment of the difficulty as would avert recourse to litigation; a recourse we should not fear, but which for many reasons we should much regret.\n\nI thank you for the patient hearing you have so kindly given me, and shall be happy to the utmost of my power to afford you any further explanation or assistance towards an understanding of the case, in the hope that together we may perhaps happily discover some measure of agreement under which the Patent may at once issue.\n\nThe Chairman, whilst reserving any expression of opinion upon the case as presented, expressed the thanks of the Committee to Mr. Cumberland for the manner in which he had submitted it; and said that the Committee would at an early date take the whole subject into careful consideration, and would be glad to receive the report of the statement so soon as it had been prepared.\n\nThe Committee then adjourned.\nthe date of the conditional.\n\nQueen's Wharf\n\nLicense.\n\non the works so\n\nhave\n\nand have\n\nwhich the\n\nlots and the\n\ntaken upon\n\nthem,—and\n\nsatisfied all the\n\nit.\n\nof the question,\n\ndefend\n\nwould be in the\n\nfriendly adjust-\n\nfear, but which\n\nhappy to the\n\nunderstanding\n\nagreement\n\nomitted it; and\n\nconsideration,\n\nshared.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25157.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 19, "total-input-tokens": 30620, "total-output-tokens": 12887, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1532, 3], [1532, 4009, 4], [4009, 4934, 5], [4934, 7526, 6], [7526, 11968, 7], [11968, 16014, 8], [16014, 20480, 9], [20480, 24771, 10], [24771, 29122, 11], [29122, 33610, 12], [33610, 38173, 13], [38173, 42286, 14], [42286, 47144, 15], [47144, 51815, 16], [51815, 54416, 17], [54416, 54735, 18], [54735, 54735, 19]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]