[{"id": "0f9760629cf985cb686afcb8a144f20d050e747a", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La re liure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/\n☐ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| 10X | 14X | 18X | 22X | 26X | 30X |\n|-----|-----|-----|-----|-----|-----|\n|     |     |     |     |     |     |\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| 12X | 16X | 20X | 24X | 28X | 32X |\n|-----|-----|-----|-----|-----|-----|\n|     |     |     |     |     |     |\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\n☐ Pages de couleur\n\n☐ Pages damaged/\n☐ Pages endommagées\n\n☐ Pages restored and/or laminated/\n☐ Pages restaurées et/ou pelliculées\n\n☑ Pages discoloured, stained or foxed/\n☐ Pages décolorées, tachetées ou piquées\n\n☑ Pages detached/\n☐ Pages détachées\n\n☑ Showthrough/\n☐ Transparence\n\n☐ Quality of print varies/\n☐ Qualité inégale de l'impression\n\n☐ Includes supplementary material/\n☐ Comprend du matériel supplémentaire\n\n☐ Only edition available/\n☐ Seule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n☐ Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nDIRECTORS REPORT.\n\nThe Directors of the St. Lawrence and Ottawa Grand Junction Railroad Company, in laying before their Stockholders and the Public the Report of their Engineer in Chief, avail themselves of the opportunity to place record a brief summary and explanation of the origin, progress, and present prospects of their undertaking.\n\nThe Charter of Incorporation under which this Company exists, was obtained from the Legislature in 1850, by the Montreal and Lachine Railroad Company, with a view to the extension of the Road they had then in operation in the direction of Prescott. The charter, which is an exceedingly liberal one, authorized the company to construct a Railway \"from any convenient place in the Parish of Lachine, to some place at, or as near as conveniently may be to Prescott, in Upper Canada; either in the direction of St. Anne's, Vaudreuil, Rigaud, and towards Hawkesbury, and thence to some place at, or as near as conveniently may be to Prescott—or in the direction of St. Eustache, St. Andrews, Grenville, and thence to some place at, or as near as conveniently may be to Prescott, aforesaid, in whatever\n\"line may, by the said company, be found most convenient.\" The Act also authorizes the company to construct and run steamboats in connection with their road upon either or both of the rivers Ottawa and St. Lawrence.\n\nThe capital stock of the Company is fixed by the Act at £750,000 currency, or about £7,600 per mile of road; and authority is given to borrow a further sum of £750,000, and to pay a rate of interest as high as 8 per cent. for the same if required.\n\nThe Act further provides:\n\n1st. That the road may be divided into sections, and any section may be made and worked before the other sections are commenced—and for this purpose parties may subscribe conditionally for a particular section.\n\n2nd. The Directors may establish and regulate from time to time, the tolls and charges to be levied for the transport of goods and passengers.\n\n3rd. The Company are allowed until the 10th of August, 1856, to commence, and until 10th of August, 1863, to complete their road.\n\n4th. All Corporations, whether ecclesiastical or civil, are authorized to take stock in, or loan money to the company.\n\n5th. A quorum of the Directors is empowered to unite, connect with, or purchase any other railroad now or hereafter to be chartered in any portion of the country between Montreal and Prescott, and thereupon further to increase their capital stock to the extent of that of the road purchased.\n\n6th. Lastly, the Act does not contain any provision\nauthorizing the Government to assume possession of the road upon any conditions, as is the case in the charter of most other companies.\n\nThe charter above described was granted on the 10th day of August, 1850, to the Montreal and Lachine Railroad company, but that company were too much engaged with the extension of their road from Caughnawaga, to avail themselves at once of the powers conferred upon them. The agitation of the Trunk Line to Kingston and Toronto, which ensued in the following year, tended still farther to delay action under the charter until this line also should be definitely located.\n\nApparently in anticipation of these contingencies, the Legislature provided in the charter that, if the Montreal and Lachine Company declined, or were unable to proceed with the road, it would be competent for certain gentlemen therein named, to organize an independent company, who should possess the powers and privileges of the charter so soon as the latter was formally relinquished by the Directors of the Montreal and Lachine road. This relinquishment having been duly made, the present company has been organized without loss of time, and—inasmuch as the charter contemplated the extension of the existing road from Lachine westward—the new company, among their first acts, have availed themselves of that provision of the charter, expressly made to meet the case, which authorized them to connect with other roads, and have entered into a written agreement with the Montreal and New York Railroad for the use of that portion of their track lying between Montreal and Lachine; by which act the St. Lawrence and Ottawa\nGrand Junction Railway Company have secured all the advantages of a terminus within the City of Montreal.\n\nThe Directors would here take occasion to state, that throughout the initiation and organization of this Company they received the unanimous support of the Press, and they believe, of their fellow-citizens generally, and their project was hailed with satisfaction throughout the line of the proposed Road. The Prospectus and public notices were printed in both languages, and to those documents the Directors would now appeal, conscious that no subsequent act of the Company has in any way conflicted with the principles therein expressed.\n\nShortly after the election of Directors and appointment of the Officers, an opposition sprang up in Montreal, wherein exception was taken to the position of this Company upon the following grounds:\n\n1st. It was objected that the Charter only authorized the construction of a road from the Parish of Lachine up the Ottawa, and that therefore the road could not terminate in Montreal.\n\nIn reply to this objection, the Directors would state that they took the Charter as they found it—that it was the then only existing one under which an Ottawa Railway Company could be organized—that they had organized under it with the full approbation of the Press and public of Montreal, and had given the fullest publicity to the origin, nature, and provisions of the Charter. It would therefore have been more just to them had this objection been raised at an earlier date. This objection, which was a necessary consequence of the independence of this Company, has been entirely removed by the\nagreement made with the Montreal and New York Railroad.\n\nThe second objection raised was, that the Lachine route would divert trade from the City of Montreal.\n\nThe reply to this objection will be found in the Report of the Chief Engineer. The Directors would in addition state, that had the charter been retained and acted upon by the Montreal and New York Company—it might have been assumed that an undue preference would have been shewn to the southern connections of that line: but that company having placed the charter at the disposal of the citizens of Montreal, and an independent company having been organized, the latter is as free from extraneous influences as it could possibly be made. With respect to the Lachine route, as a route, the Directors are convinced that it is the only one by which an Ottawa Railway should enter Montreal. But while the Directors believe it to be the true interest of the road to secure to it all the advantages of an uninterrupted communication with the city of Montreal, they are not unmindful of the other interests of which they are the guardians—nor can they suppose that there exists upon the part of the citizens of Montreal a desire to place a great highway of communication with the Ottawa upon any other footing than one of liberal and enlightened commercial intercourse.\n\nThe last objection raised was, that the road ought to go direct to Bytown, instead of striking the Ottawa trade at Kemptville. To the Engineer's Report the Directors would again refer for a full and complete reply. This company have proposed to avail themselves of the powers\nof their Charter, by connecting with the Bytown and Prescott road at or near Kemptville, because such a connection was manifestly contemplated—these two roads having been chartered at one and the same time,—and because the two roads coming from Kemptville and Grenville respectively toward Prescott, would necessarily approach near to each other for some distance before reaching the latter point. The proposed junction therefore would create the least interference between these roads and also with the Grand Trunk Line.\n\nThe Directors therefore with confidence affirm that the exceptions taken to the policy of this company by certain parties in Montreal, are not only untenable, but that the so called objections are in fact strong arguments in favor of the commercial importance and value of this road. It will be proper however, to allude to the action taken by the dissentients and its bearing upon the position of this Company. Petitions were signed in Montreal, Terrebonne, and Bytown, for a charter for a road which should leave the former city by the route of the north east end of the Mountain, and passing through the county of Terrebonne, ascend the Ottawa river to Bytown. Such a route would not have interfered with this company—even if there existed any reasonable probability of its being carried into operation. When however the new Bill was printed, the Directors of this company were surprised to find that although the preamble described such a route as being the object sought for by the petitioners, the enacting clauses gave the chartered parties power to construct a road between Montreal and Bytown upon any route which might be deemed expedient. While this\ncompany could not but feel flattered that their route was thought worthy of being embraced within the provisions of the charter of the new company, the Directors felt it their duty to the stockholders to oppose a measure which would have enabled the Montreal and Bytown Company to locate their line upon the precise track of this company as far as Grenville. This they have done successfully;—but, waived all opposition on condition that the new Company were confined to the route for which they had petitioned, viz: \"by the north east end of the Mountain and through the County of Terrebonne.\" This amendment was made accordingly—but in the event of the Bridge over the St. Lawrence being placed much above its proposed site, the Terrebonne line has been empowered to abandon its entrance into Montreal, and reach the bridge by connecting with the Grand Trunk Line at or above Lachine. The occurrence of this remote contingency would bring the Terrebonne line into competition with this company for the trade of St. Eustache only,—for all other points, the superior directness and character of the St. Lawrence and Ottawa Grand Junction route would defy competition. But there is every reason to suppose that the trade of Terrebonne will seek the line of this company by a connection at St. Eustache, rather than incur the unnecessary expense of another line between this point and Lachine.\n\nTurning from this unfortunate but they trust temporary dissension in the city of Montreal—the Directors congratulate the stockholders and citizens at the hearty approval and welcome with which this enterprise has been received by the agricultural districts along the line.\nThe counties council of the United Counties of Stormont, Dundas and Glengary offered to subscribe £50,000 to the stock of this company if a particular route were adopted. Following this, the council of Two Mountains have passed a resolution for taking £100,000 stock in this road, and have applied to Parliament for the necessary powers to enable them to do so. The inhabitants of the county of Prescott have expressed a willingness, by vote at a public meeting, to subscribe £15,000;—and lastly, three Townships, Lochiel, Finch, and Winchester, on the line between Hawkesbury and Kemptville, have subscribed, in the necessary legal form, £35,000 to the Stock of this Company.\n\nThe towns of Perth, Merrickville and Kemptville, have in consequence of the organization of this company, applied for a charter for a railway connecting these towns, and thus bringing them in direct communication with Montreal.\n\nThe Directors have now only to announce that the preliminary surveys have been completed as far as Grenville, and that the location surveys are nearly completed. The result is extremely favorable, inasmuch as there will be no gradient as high as thirty feet per mile—the earthworks are of the lightest description, and with the exception of the crossing of the Ottawa, the mechanical structures are few in number and of slight importance.\n\nIn virtue of the provisions of their charter they have decided to take up that section of the line between Lachine and Grenville, running through St. Eustache, and thence through the heart of the county of Two Moun-\ntains, to St. Andrews, Carillon, Chatham, and Grenville.\n\nThe preliminary exploration of the route between the Ottawa River and Kemptville has also been commenced. This section will be taken up as soon as the action of the Municipalities along the routes is finally known; provided that such action (as there is every reason to believe it will) encourages the company to proceed further at present under their charter.\n\nAll of which is respectfully submitted.\n\nWM. F. COFFIN,\nPresident.\nST. LAWRENCE AND OTTAWA\nGRAND JUNCTION RAILWAY.\n\nPresident.\nWM. F. COFFIN, Esq.\n\nVice-President.\nL. H. HOLTON, Esq.\n\nDirectors.\nHon. PETER McGILL.\nHon. THOS. McKAY.\nHon. JOHN YOUNG.\nHon. CHAS. WILSON.\nWM. MOLSON, Esq.\nJOHN TORRANCE, Esq.\nWM. DOW, Esq.\nD. L. McPHERSON, Esq.\nDAVID DAVIDSON, Esq.\nJOHN McKINNON, Esq.\nH. H. WHITNEY, Esq.\n\nSecretary.\nG. F. COCKBURN, Esq.\n\nEngineer in Chief.\nTHOS. C. KEEFER, Esq.\n\nCounsel.\nA. CROSS, Esq.\n\nBankers.\nBANK OF MONTREAL.\nST. LAWRENCE AND OTTAWA\nGRAND JUNCTION RAILWAY.\n\nENGINEER'S REPORT.\n\nTO THE SECRETARY ST. LAWRENCE AND OTTAWA GRAND\nJUNCTION RAILWAY COMPANY.\n\nSIR,\n\nI have the honor to report the completion of the Survey\nof the Saint Lawrence and Ottawa Grand Junction Rail-\nroad as far as Carillon. The company were in posses-\nsion of minute surveys of the sections between Lachine\nand St. Eustache by one route, and between Carillon\nand Grenville by no less than three lines. The present\nsurvey has therefore been directed to the connection of St.\nEustache and Carillon (which has been done by two lines)\n—and also to the examination of a line from Montreal to\nSt. Eustache by the route of the north-east end of the\nMountain. This latter survey was undertaken for the\npurpose of ascertaining whether this route would be pre-\nferable to one via Lachine, in order that, if circumstances\nshould render such a course desirable, the company\nmight take steps for the necessary alteration of their char-\nter; but if otherwise, to satisfy the public that the southern\nroute via Lachine was not adopted without full consid-\neration and substantial reasons.\n\nException having been taken to the route for approach-\ning the other terminus of the road, viz.: that via Kempt-\nville—I have been requested to report to the company\nwhether it would be desirable for them to change their line by amending their charter so as to make Bytown the terminus.\n\nSince my instructions were received, the advocates for a Montreal and Bytown route via Terrebonne have obtained a charter to enable them to carry out their views;—this company is therefore relieved from those importunities which always beset the location of every important Railway. It is proper that parties in favor of a route and policy differing from those entertained by this company should endeavour to carry out their own views, rather than to lay hold upon both ends of the Ottawa and St. Lawrence Grand Junction Railway and convert it into an inferior and wholly different project altogether.\n\nIn attempting to carry out a great project such as the present, connecting different localities, holding diverse and perhaps adverse views as to their own interests, it cannot be supposed that the views of one only of the parties to the question will be adopted by the other contributors to the enterprise. The interests of town and country should be identical, but unfortunately, from the too exacting assumptions of either party, these be arrayed against each other, material injury is inflicted, which falls heaviest upon the most dependent of the two. It would be extremely unfortunate therefore if by any action of the citizens of Montreal, the agricultural districts upon which she is dependent should be led to believe that any exclusive monopoly of their trade would be attempted by forced routes and inconvenient terminal arrangements in this city. Nor would it be politic to make such a confession of weakness or admit anything so derogatory to the just pride of every citizen, as that the commercial metropolis of Canada—the largest city of British North America, would force a railway to enter her suburbs behind a mountain, for the acknowledged purpose of evading the rivalry of an Indian village not ten miles from\nher seaport. The impolicy of thus estranging the feelings of the agricultural districts lies in the fact that Boston and New York are not only open to them as markets, but that both these cities are making extraordinary exertions to establish a direct trade with every country town in Canada, thereby sapping the foundations on which the prosperity of this city must rest. It is also evident that the agricultural districts will not sympathise in the mistaken fears entertained by some respecting the diversion of trade from this city. They are sufficiently alive to their own interests to perceive that if Lachine gives them a choice of markets or even the slightest semblance of advantage, this would be to them the strongest argument in favor of that route.\n\nThese remarks are made not in disparagement of the proposed line of railway connecting the northern part of this city with Terrebonne and Bytown (which if practicable is a laudable project in itself) but in defence of the route of the St. Lawrence and Ottawa Grand Junction Railroad Company which has been assailed as one intending to divert trade from Montreal by means of the ferry at Caughnawaga, a charge which is equally applicable against the Grand Trunk or any other railway which is compelled by the natural formation of the island and mountain of Montreal to enter this city by the southern or Lachine route. This charge has been practically withdrawn by the amendment of the charter of the Terrebonne line so as to enable that line under certain conditions to embrace the facilities afforded by the Lachine route. Under this amendment the Terrebonne line may, to a certain extent, be brought into competition with this company, and as that line has claimed especial favor at the hands of the citizens of Montreal by proposing to protect them from Caughnawaga competition by a \"north-east end of the mountain,\" terminus, it is to be presumed that if it abandons this route for the one via\nLachine, both projects will stand upon an equal footing before this city.\n\nIt may be urged, however, that the St. Lawrence and Ottawa Grand Junction Company propose to unite with the old Lachine road for the purpose of entering the city, and that they thereby become identified with the Caughnawaga interests of that road to the prejudice of Montreal.\n\nThe articles of agreement recently entered into between these two companies secure the complete independence of the St. Lawrence and Ottawa Grand Junction Company, by enabling it to run in and out of the city with the same facility as the Lachine Road, and upon terms much more favorable than the alternative of constructing an independent track.\n\nEvery consideration of prudence would dictate the husbarding of capital by making use of a track which at present is not half employed, upon a rental rather than laying out over £100,000 at the outset of a new enterprise (requiring all its available resources) to secure the same object.\n\nThe St. Lawrence and Ottawa Grand Junction Company might have applied for powers to construct an independent track, and have obtained them as readily as they were granted to the Montreal and Kingston and the Grand Trunk Co's., but such a proposition would have betrayed an extravagance of management little likely to induce confidence on the part of the municipalities who were to be invited to aid in the enterprise, and who, so far from partaking of any jealousies of Lachine, naturally prefer a route which, they have high authority in Montreal for believing, will give them a superior market.\n\nBut if the Terrebonne line avails itself of its amended form, and becomes a branch of the Grand Trunk at or above Lachine, in what respect is it more a Montreal project than the other? If one is under the influence of\nthe Caughnawaga route, the other is under the double influence of the Grand Trunk and of the St. Lambert one. The bridge will carry the trade intended for New York and Boston, to be transshipped at St. Lambert instead of at Lachine. Under this view of the case, the project of a railroad intended to secure the Ottawa trade from the competition of Ogdensburgh, degenerates into a rivalry between two companies on the south side of the St. Lawrence for the lion's share of the carriage of this freight. It would be simply a transfer of a well known rivalry now existing upon the south, to the north side of the St. Lawrence.\n\nIf the St. Lawrence and Ottawa Grand Junction is considered a branch of the Montreal and New York road, (the greater a branch of the less—which is absurd) still more must the Terrebonne line in its amended form, be looked upon as a branch of the Grand Trunk and of the Champlain and St. Lawrence roads. The former line has an advantage in that it offers but one diversion of trade, whereas the latter gives at least two. The transhipment from the broad to the narrow gauge will take place either at Lachine or St. Lambert; the one is by railway practically as near the city as the other, and it is difficult to see that either point should have any preference in the eyes of citizens not interested in those localities.\n\nThe presumption then is, assuming the charge of dependence against the Ottawa Company to be sustained, that the interests of Montreal are as safe in the hands of the Montreal and New York Company composed of her own citizens and having one terminus at least in this city, as in those of the Grand Trunk Company, whose interests would lead them (as far as they could control the direction of freight) to carry every thing past here and make Point Levi, or Green Island the seaport—instead of Montreal.\n\nI have not entered into these comparisons of position because I attach any importance to them, or have any\nfears that the trade which legitimately belongs to this city, when once upon the island of Montreal, will be diverted from it by the fact that a ferry is here, or a bridge there, or that a railway enters in a particular suburb, or leaves town by a particular street. The trade of a district like the Ottawa which has (by means of Ogdensburgh) a choice of markets, can only be retained for Montreal by making it the interest of that district to trade here. There is very little sentiment in commerce; the republican dollar, will outweigh the sterling half-crown. We have the advantages of proximity, affinity of interests social and political, and it is only by utter neglect or bad policy that we can be deprived of what is as surely within our reach as are the suburbs of Boston, New York, or London, to those cities. By offering the facilities of a railway and the enhanced markets attendant upon it to a district which has the means of supporting one, and which at the same time possesses no equally advantageous channel of communication, we cannot fail to secure its trade to such a road.\n\nBelieving that unless an immediate home market be offered to the trade of the Ottawa, by a railway communicating directly with this city—that trade will go to Ogdensburgh—I propose to consider what route is most reliable for effecting this object, and what one is the most feasible in execution. The question is a public one of the first importance to this city, and must be treated without reference to the interests of proprietors upon competing routes, or the rivalry of railroad companies.\n\nIf Caughnawaga be a superior market to Montreal, no effort upon the part of the latter can prevent the trade of Two Mountains, &c., from reaching the former. The route between them is favourable, and nothing further is needed to produce the inevitable result. I have said I attach little importance to the ability of railroad companies to divert the Ottawa trade from Montreal when\nonce it has started for this point. If it is intended for Montreal it will come here;—if not intended for this market it is surely no worse for Montreal that it should go south, via Lachine or St. Lambert, instead of via Ogdensburgh; on the contrary, Montreal may hope to derive something more than incidental benefit from a trade brought so near her. The railway which is a mere carrier, controls the route of export and import only when there is no competition, but in the present case, it is the shipper or owner of the freight who decides whether he will send to Montreal, or via Montreal to the south, instead of via Ogdensburgh.\n\nI consider that the business of Lachine and Caughnawaga, of St. Lambert and Longueuil, will be as truly a Montreal business, as that of Brooklyn or Jersey city is a New York one. The principal terminus of the great New York and Erie road is Piermont, (many miles from the city), on the Hudson. A mother might as well be jealous of her child as Montreal of Lachine. Instead of this internecine warfare, the true policy of this city is to encourage all such, and make them thriving suburbs in order that she may have home customers to depend upon instead of foreign ones. There is no prosperous city without suburban villages,—and in no intelligent community will such be looked upon as rivals;—on the contrary, if offshoots thrive, their prosperity must react upon the parent stem until in time they become united within a common boundary.\n\nI propose to show why this company should not seek to enter the city by the north east end of the mountain,—or change their course from Grenville to Bytown in preference to Kemptville; and further, that the route proposed for the St. Lawrence and Ottawa Grand Junction is unobjectionable with respect to excellence of character and economy of construction,—that its commercial prospects are superior,—its feasibility in a financial point\nof view greater,—and its influence on the trade and prospects of Montreal more extensive and valuable than any other route which has been or can be proposed for the purpose of securing the Ottawa trade.\n\nIn examining a route leaving Montreal by the northeast end of the mountain, I felt restricted to the shortest possible line, inasmuch as the survey was exposed to a comparison with the Lachine route. Lines were therefore run, a single glance at which would be sufficient to prove their unfitness, but as it had been asserted that Logan's farm offered a feasible route—and as I was well aware that unless an actual survey were made of every possible route which was shorter than the one adopted, exception would be taken—I commenced by running a line from Visitation street at its intersection with the line of Craig street produced, up the gully on Logan's farm. It has been stated in the public prints that a point has been discovered on this farm only sixty-six feet above Craig street. From the Côte à Barron reservoir, to the toll gate on the Papineau road, the level of the ground is very uniform and is 130 feet above the harbor, or 100 feet above Craig street at the Viger market. That part of Logan's farm above the côte is one hundred instead of sixty-six feet above Craig street, and beyond this farm there is a further elevation of sixty feet to be encountered before the summit at the quarries is overcome. The summit upon this route is 194 feet above the harbor, and the route involves grades, exceeding seventy feet per mile, and these can only be obtained by cuttings and embankments of twenty feet.\n\nThe second line starting from the same point crossed the Papineau road at the foot of the hill below the toll gate, and struck the Côte de la Visitation road three-fourths of a mile north of the junction of these two roads. On this line the summit is 190 feet above the harbor, and the grades over seventy feet with twenty feet cuts and fills.\n\nThe third line ascended the côte about half-a-mile north\nof the Papineau road, and crossed the Côte de la Visitation road about half a mile to the northeast of the second line. On this line the summit is 188 feet, but the grades are reduced to fifty-one feet with cuts and fills as above.\n\nIt was evident from inspection, that neither of these lines above described would have even been surveyed by any engineer designing to take a road out of the city by the northeast end of the mountain,—because if this route were once decided on, a line with easy grades and a low summit would be selected, for the same reason that the Grand Trunk lengthens its route, between St. Ann's and Montreal, by passing around the cotes, via Lachine, instead of attempting to climb over them and come in direct, via Monklands, and Dorchester or Sherbrooke streets. The first three lines above described were surveyed therefore not with the expectation of their proving feasible, but for the purpose of allaying all further agitation of them. Neither the grades or summits are insurmountable, but as both are to be avoided by lengthening the line, they would be unnecessary, and would not be seriously entertained after the question of a competing route was settled. The principal reason for condemning these lines, however, is the position of the grades and curves rather than their strength. Any railway at a main terminus should have an approach of a mile or more which ought to be level or practically so; but each of these lines, for the purpose of getting over the spur of the mountain, must start out of city limits with grades varying from fifty to seventy feet, and with curves at the foot of these grades.\n\nA fourth line was then run on the shortest route which could be found to attain a line of a certain character, viz:—one on which the grades would not exceed forty feet by employing cuts and fills of twenty feet. This line runs north 10° east, for a distance of three miles from Visitation street before it ascends the côte. Then bearing north west it strikes the Côte de la Visitation road about two and a\nquarter miles north of its junction with the Papineau road. The summit on this line is at Côte St. Michel, and is 140 feet above the harbor. The point where such a line can round the north east end of the mountain is about five miles north of the Place d'Armes. The whole distance to St. Eustache by the north east end of the mountain, starting from the Place d'Armes as the centre of the city, will be greater than that from the same point by the south west end of the mountain, in the parish of Lachine. The summit of the northern route is forty feet higher, and the maximum grade, with the same cuts and fills, three timesavier than that via Lachine.\n\nWith respect to the general question of a terminus for the Ottawa road at the north end of the city, the survey made shews that this route would be longer from any central point in the city, would be inferior in grades, and more expensive to construct mile for mile than one via Lachine. The passenger terminus could not be placed further off than the Viger Market, to reach which the right of way must be purchased through one and one-fifth miles of city property, cutting the lots diagonally, before any street could be made use of. A freight-terminus should be in connection with the navigation, for which purpose it would be necessary to run a branch to Hochelaga Bay, and construct the necessary wharves there. These wharves would be subject to the drawback of being overflowed in winter, and would not therefore be adapted for permanent warehouses, without which any railway wharves are of little value.\n\nAs, however, the bridge must be above the harbor, and the general railway terminus at Point St. Charles, any railway entering the city by the north must connect with these points, in which case it will be unnecessary to construct a freight terminus at Hochelaga, because Point St. Charles offers much better facilities for such a purpose. At Point St. Charles, docks, basins and permanent warehouses can\nbe arranged communicating with railway tracks, all above the winter floods of ice. Starting from this Point the Lachine route is two miles shorter than the northern one. To reach Point St. Charles the road must be extended from Viger Market through Craig street to the commencement of St. Antoine street, thence crossing Bonaventure st., and passing north of the Lachine station, so as to avoid crossing the track of that road, its shortest route would be to cross St. Joseph street a little beyond Dow's brewery, and strike the junction of Seminary and McCord streets. From Craig street to this point, a distance of about half a mile, the route must be opened through valuable city property. The traffic on such a route could only be conducted by means of horse power. The numerous and constant crossings on the line of Craig street, which divides the city almost equally, would forbid the employment of locomotives. This consideration alone should be sufficient to induce the Company to abandon any idea of entering the city by the north—but exclusive of this burden on the traffic, and without taking into account the greater length and inferior grades of this route, there is, in my judgement, a conclusive reason for adopting the Lachine one; and this is the relative amount of capital required upon the two routes.\n\nNo consideration of utility, commerce, or convenience gives a preference to the northern route. In every respect it is inferior to the southern one—but it is presumed that the city of Montreal would aid this route from fear of the Lachine one. I cannot believe that after investigation a majority of the citizens of Montreal will prefer a northern route; but should prejudice prevail over reason, the highest amount which the city of Montreal could under any circumstances be expected to contribute to such an undertaking, would fail to compensate this company for the additional outlay required upon the northern over the southern route:—because it would be necessary to expend,\nin the purchase of property, &c., within the limits of the city, more than Montreal would contribute. So far, therefore, from entertaining the northern route, the company will find it their interest to take advantage of the track already laid to Lachine; for if their means are limited they will find that without aid from Montreal they will reach St. Eustache with less financial difficulty; and if their means are abundant, it would be policy to pay a heavy contribution to escape the disadvantages of the northern route.\n\nIt has been urged in support of the northern route that St. Helens island is a probable site for the bridge. A bridge connecting St. Helens Island with the city must be at least 100 feet over the water. The bridge would therefore be inaccessible from any point until it were extended over the city to strike the level of Cote à Barron, at which point it could not be reached by the Grand Trunk at all, with the grades and curves adopted upon that line. For all the benefit Montreal would derive from such a bridge, it might as well be at Lachine, for no railway coming down to the level of our streets could reach it in much less time. The above considerations are sufficient to shew the absurdity of the St. Helens site, but it may also be remarked that the necessary piers to carry a railway bridge, if placed in St. Mary's current, would put our wharves under water; and further, that a bridge or a railway to be of any use to this city must be in immediate connection, and upon the business level with our warehouses and our harbour.\n\nThe only argument then which can be urged in favor of a northern route is the assumption that it will divert less trade from this city than one via Lachine. There is far more reason for supposing that a route by the northeast end of the mountain through Terrebonne would divert trade from Montreal to Quebec, than that a southern one would divert it to Caughnawaga. Quebec is the\nnatural market for the lumbering districts—all their connections are there. The travel in connection with the lumber trade between the Ottawa and Quebec is now conducted wholly through Montreal and is one of the most important resources of our hotels, steamers, shopkeepers, and carters. Quebec has not hesitated to declare her desire to push the north shore line up the Ottawa behind Montreal, and has fortunately refused to unite in the northern route scheme. If Montreal aids in bringing down an Ottawa line into Terrebonne, will not the connection between such a line and the \"north shore\" railway, by the north of river Jesus, inevitably follow—and turn the Quebec and Ottawa traffic altogether away from this city? Thus we would throw away a trade which is well known to exist, and of which we have felt the benefit, in an attempt to flee from the imaginary evil of having a trade which we do not possess, carried on through Caughnawaga.\n\nNo bridge will be built above the Lachine rapids—and for all trade going across a bridge below this point, it cannot be supposed that the Caughnawaga ferry will be able to compete with a bridge if the latter be liberally managed; nor can it be shewn that Montreal will derive any more benefit from what goes directly over the bridge than if it crossed at Lachine.\n\nAgain, the attempt to evade Lachine by a northern route is as unavailing as it would be unwise. If a long line of traffic is brought down the Ottawa it must pass within twenty or twenty-five miles of Lachine, and if Caughnawaga offered the attraction, the \"tap\" would be inevitable as soon as it was shewn to be desirable.\n\nHaving examined the question of the route approaching Montreal from Grenville and St. Eustache, I will now take up that of the extension of the same from Hawkesbury westward so as to secure the largest share of the Ottawa traffic and the most economical route:—also\none which proffers the largest amount of municipal aid, thereby uniting in a common bond of interest the greatest population for customers to the road and to Montreal.\n\nThe proposition to make Bytown the terminus of the route, instead of seeking the trade which supports Bytown at Kemptville, arises from the supposition that the former is the centre of the trade and population of the Ottawa—because it is the largest Town. The passenger travel with Bytown will be important, but as this is nearly all which a direct route from Grenville to Bytown could depend on, it will not authorize the construction of sixty miles of railway, particularly when this passenger traffic is as effectually secured by following a route which can also supply a good way business.\n\nA railroad through Two Mountains can be made to pay good dividends upon the capital invested, and can be arranged so as to earn a large revenue from the transport of raftsmen from Carillon to Grenville. At this latter point it strikes steamboat navigation and will command the trade of both shores of the Ottawa until we approach Bytown. To continue the road upon either bank of the Ottawa to Bytown, will be unnecessary, except for the purpose of gaining an hour's time for the passenger travel to that place. The population on the banks of the river between Grenville and Bytown is insignificant, and wholly insufficient to support a post road—much less a railway. On the north shore the rivers have never been bridged, and the commonest road is yet wanting. On the south shore it is only within the last three or four years that a waggon has been able to pass from Bytown to L'Orignal. The Bytown business therefore must be shewn to be sufficient to authorize the construction of sixty miles of road upon a rougher and more expensive route than is usually found in Canada. It may be presumed that a railway at Bytown, would command the\nexport trade of the Ottawa country, but this is an error. Bytown is in this respect altogether different from any other town of similar importance. Prices are as high there as in Montreal; the purchases are not for exportation but for a local market: it has therefore no exports to give a railway. Produce from Lanark and the rear townships of the St. Lawrence counties is taken back to Bytown to be forwarded up the river for the supply of the lumbering shanties. It is in these townships therefore that the exports for a railway are to be sought—those immediately around Bytown not producing enough for their own market.\n\nUnless a railway from Montreal penetrates the surplus producing townships south of Bytown, their produce when not required for the latter market will go to Ogdensburgh; to which point, on the opening of the Bytown and Prescott railroad, the cars (being on a similar gauge), will be transferred upon barges constructed for the purpose. It must be remembered that almost all that is valuable of the Ottawa country, lies between the Ottawa and St. Lawrence rivers—not north of the former. Bytown is the northern and Prescott the southern limit and the export markets are to the south. It is evident, therefore that a Railway at Bytown would not attract produce away from Ogdensburgh, to seek Montreal via Bytown, for the simple reason, that this produce would reach Ogdensburgh as cheaply as it could reach Bytown, and would be worth more for exportation at the former than at the latter place.\n\nIn the appendix I give some extracts from my unpublished report on the Montreal and Kingston railway. The same arguments which I then urged against the Bytown route for the trunk line apply with equal force against the Grenville and Bytown route. The trunk line must run through the front townships of the St. Lawrence, in order to maintain its directness. With several hundred\nmiles of feeder from above, it will have full employment, and will not be able to afford the facilities to, or exercise that influence upon the development of the rear townships, which it is important for Montreal to secure. With the trunk line running on the St. Lawrence which is populous, it would be manifestly absurd to attempt to remedy the inability of that line to open up the interior by running a line upon the sparsely populated banks of the Ottawa. We would thus have two \"coast lines,\" with the interior or heart of the country untouched and but slightly influenced by their construction. If the back townships are obliged to go out to the front for a market,—as it will be but a few hours further drive, the neighbouring stations upon the Ogdensburgh road will offer them one nearly, if not quite as good as that in Montreal, and probably better than that at the way stations upon the Grand Trunk line. Viewing a railway up the Ottawa, therefore, in the light of the purest selfishness, it is evidently the policy of Montreal so to locate this road as to bring the largest amount of traffic directly into this city. We have seen that the route as far as Grenville is a most desirable one, but that to continue upon the Ottawa river beyond that point, would be skirting the extreme northern edge instead of penetrating the interior of the desirable district. Moreover, it has been shewn that this northern route will not bring up produce from the townships south of it; and further, that these townships are the only quarter from which supplies are to be expected. The true course, therefore, is to bear down into these townships and secure their trade, which we can do without losing any of that to the northward. A line from Hawkesbury, which will command the trade of the rear townships of Glengarry, Stormont and Dundas, will not only prevent this trade from reaching the Ogdensburgh road, but will pick up all the trade to the north of it, that of Bytown included, and, by offering a better route, turn it to Montreal.\nThe following statement shews the population of the townships upon the banks of the Ottawa, between Grenville and Hull, on the north side—and between Hawkesbury and Bytown, on the south side of that river.\n\n**NORTH SHORE.**\n\n| Seignory of Petite Nation | 3,356 |\n|---------------------------|-------|\n| Lochaber                  | 1,082 |\n| Lochaber, Gore            | 225   |\n| Buckingham                | 2,204 |\n| Templeton                 | 1,711 |\n\nTotal, .................................. 8,578\n\n**SOUTH SHORE.**\n\n| Seignory of L'Orignal     | 1,406 |\n|---------------------------|-------|\n| Township of Alfred        | 584   |\n| Township of N. Plantagenet| 1,202 |\n| Township of Clarence      | 508   |\n| Township of Cumberland    | 1,659 |\n| Township of Gloucester    | 3,005 |\n\nTotal, .................................. 8,364\n\nThe frontage on the Ottawa, occupied by the above population, is about sixty miles, and the depth back from the river will average upon the north side about fifteen miles, on the south about ten, giving 900 square miles for the 8,578 souls on the north side, or a population of less than ten to the square mile; and on the south shore 600 square miles for 8,364, or under fourteen to the square mile. Another generation must pass away before the ban's of the Ottawa, between Grenville and Bytown, can support a railway.\nThe township of Gloucester is given to the south shore road, but as the Bytown and Prescott road passes through the most populous part of this township it would undoubtedly receive the greater share of its business. For the business of Bytown, and that of the townships of Nepean and Gloucester, the Montreal line must compete with the Prescott one. But giving this whole population, viz.:\n\nThe town of Bytown........ 7,760\nTownship of Nepean....... 3,800—11,560 and adding population of south shore as above, 8,364 we have a population upon the route of the —— railway amounting to.................. 19,924,\n\nbut from the competition of the Bytown and Prescott line, not much more than half of this population could be claimed for the Ottawa river route.\n\nThe route of the St. Lawrence and Ottawa Grand Junction Railway will command the trade of the following townships:\n\nHawkesbury, E. and W.,...... 5,694\nLochiel.......................... 4,174\nKenyon............................ 3,842\nRoxboro'......................... 2,141\nFinch............................. 1,450\nWinchester....................... 2,565\nMountain......................... 2,764\nSouth Gower..................... 863\nOxford......................... 4,496\n\n—— 27,989\n\nIt would also be the best outlet for the business of the following townships:\nOsgoode, ......................... 3,050\nRussell, .......................... 503\nS. Plantagenet, ................. 643\nCaledonia, ....................... 958\nMontague, ....................... 3,356\nMarlboro', ...................... 2,053\nWolford, ......................... 3,259\nN. Gower, ....................... 1,777\n\n15,599\n\n43,588\n\nThe people of Perth, Merrickville, and Kemptville, have declared in favor of a railway to join the Bytown and Prescott one at the latter place—this would place the whole trade of Lanark with a population of 27,317 at the command of a Montreal and Kemptville road.\n\nBy referring to the accompanying map on which the population of each township is laid down, the commanding position of the St. Lawrence and Ottawa Grand Junction is at once apparent, and also the importance of Kemptville, which is the centre of a circle embracing within a radius of thirty five miles, a larger population than any other similar circle between Montreal and Toronto.\n\nKemptville lies upon the navigable waters of the Rideau canal; directly beyond it are the villages of Merrickville, Smith's Falls, and the county town of Lanark—Perth. The townships on each side of the Rideau are amongst the most fertile and populous of any in the valley of the Ottawa. This rich country, the only surplus producing section of the Ottawa, must find a market either by a direct road to Montreal, or through Ogdensburgh. Upon the opening of the Bytown and Prescott road Kemptville will become the centre of their trade, and unless they find there the means of reaching Montreal, they have no\nother resource but to take the cars of the Bytown and Prescott road, which being on the narrow gauge can be transported to the Ogdensburgh line. Without reference to the St. Lawrence and Ottawa Grand Junction Railroad, the people of Perth, Smiths' Falls, and Merrickville, will most probably connect with the Bytown and Prescott road at Kemptville, instead of building a new line to Brockville—because they can reach Kemptville in less distance—upon a more populous route—and when there, secure a road both to the Ottawa and St. Lawrence.\n\nIt is vain to hope that the Grand Trunk Line at Prescott can turn this trade via Montreal;—the break of gauge there is fatal to the interests of the latter. Ogdensburgh is in continuous railway communication with New York and Boston, via Lake Champlain, and will soon have another connection with Watertown, Rome, and the interior of New York; and, lastly, is projecting a far more formidable line than either, which will give the Ottawa country direct communication with the city of New York. The following extract from the Prescott Telegraph shows what Montreal has to expect.\n\nOGDENSBURGH SOUTHERN AND WESTERN RAILROAD.\n\nWe commend, says the Ogdensburgh Republican, to the attention of our readers the subjoined article from the Prescott (Canada) Telegraph, of the 23d ult., on the subject of a southern railroad from this place. We trust the proposition will receive a hearty response along the projected route. The city of New York has a great interest in this enterprise. Boston capital has not only built a road to this place, but is aiding in the construction of the Prescott and Bytown road.\n\n\"Our neighbours across the St. Lawrence are agitating the question of a southern and western railroad connection. Several routes are talked of, viz: Rome, Utica,\nand Herkimer. As we on this side have a great interest in this matter, perhaps quite as much as they, and as a good natured discussion of the subject can do no harm, but may be productive of good by exposing the merits of the projected lines, we shall be indulged in presenting a few simple facts for consideration.\n\nApplication is to be made at the present session of Parliament for a charter of the railway from Bytown westward up the Ottawa, in continuation of the Bytown and Prescott railway.\n\nThe distance from Bytown to New York, in a direct line, is no greater than from Montreal to New York.\n\nPrescott is the best, if not the only point on the St. Lawrence for an uninterrupted communication between the States and Canada, the river seldom if ever freezing at the point which has been selected as the southern terminus of the Bytown and Prescott railway; and the distance to the opposite shore is only one mile.\n\nWith these facts before us, it is evident that if a direct railway can be had from Bytown to New York, via Ogdensburgh, the trade and travel of the Ottawa and the intermediate country, for many miles east and west, must come to Ogdensburgh, to say nothing of that which will take the trunk railway east and west at this point. The question then is, can a direct line be obtained? Let us see.\n\nMiles.\n\nCommencing at Bytown, we have the Bytown and Prescott railway, soon to be completed, which brings us to Prescott, say,................. 53\n\nThence from Ogdensburgh through the counties of St. Lawrence, Lewis and Herkimer, following the valleys of Black river and west Canada Creek, to Little Falls or Herkimer, say................. 130\n\nThis would give us the most direct connection with the present railway lines leading to New York;\nbut continue the line through the counties of Schoharie, Greene, Ulster, and Orange to Goshen, a station on the New York and Erie railway, say from Herkimer. Thence to Jersey City by the railway already constructed.\n\nMaking a line from Bytown to New York, of... and from Ogdensburgh to New York, of... against the one via Rome and Troy, of... a difference in favor of the former, of...\n\nThe accompanying map will more clearly illustrate this new attack on the \"preserves\" of Montreal.\n\nThe tone of the Prescott paper indicates clearly that the sympathy of every river and lake town is more with their trade across the St. Lawrence to the United States, than with that to Montreal. Thus Brockville is projecting a line through Smith's Falls and the county of Lanark to Arnprior on the upper Ottawa. This line is not intended as a \"feeder\" for the Grand Trunk; but is in connection with a magnificent scheme for bridging the St. Lawrence, which (upon the strength of a couple of islands in the river opposite) is entertained by that ambitious little town. This bridge is to be connected with the line of railway leading to Albany and Buffalo.\n\nFrom similar views of policy Kingston proposed in 1851, to arrest the trunk line at that point and transfer its trade to cape Vincent. Belleville is taking stock in a line of steamers to the American ports. Cobourg and Port Hope have regular communications with Rochester opposite, and look more to the American trade than to the trunk line for the success of their back lines to Peterboro'.\n\nIn the appendix will be found some special and valuable returns taken from those prepared for the United\nStates Senate, in connection with the Reciprocity question. These tables give information not to be obtained in our official returns, and shew the extent of the trade between ports above Montreal and the United States, giving the quantities and values of both exports and imports, and also a comparative exhibit of the sea and inland trade of Canada.\n\nThe broad guage system was adopted by the province with the expectation that it would turn the trade of Upper Canada through Montreal to Portland. The little city of Portland—which possesses more public spirit, energy and shrewdness than population or trade—clearly foresaw that if the narrow guage were adopted for the Montreal and Portland line, no effort of theirs could prevent Boston and New York, by tapping such a line in the valley of the Connecticut, from \"reaping where they had not sown.\" They foresaw that trade, if not trammelled by guage, would as certainly gravitate toward the larger markets of New York and Boston, as that the larger cloud attracts the smaller one. It has never been shown that any practical advantage has been obtained by the broad over the narrow guage:—on the contrary the latter has the majority, as well as the best of the opinions in its favor. If Montreal were the only route of communication between Upper Canada and the United States, a break of guage here would be an advantage to her. But as there are a dozen, or more, ports above her on the line of the Grand Trunk, all of which have facilities for transhipment and connection with American lines of railway opposite,—the result of a necessity for transhipment here will simply be to enforce it above us at the point where the produce is collected, and send it by a shorter route.\n\nAgain, if Montreal were a market of sufficient magnitude to attract the trade of Upper Canada, in preference to New York or Boston, a break of guage here would be comparatively unimportant; but as the reverse is the case\nand the markets of the latter control ours, it is evidently vain to attempt by extraordinary guages—to furnish a substitute for a market. The cities of New York and Boston, and the manufacturing districts of New England, are not only the best markets, but, for coarse grains, vegetables, poultry, &c., &c., and the great bulk of those articles which will constitute railway freight, they are the only markets large enough for Canada. We cannot export these products by sea, nor will they find a market (even if they could bear the railway carriage) on the route toward Halifax. But although Montreal cannot furnish the market for the immense supplies of Upper Canada, it will be her own fault if she does not furnish a route to that market.\n\nThe effect of a bridge over the St. Lawrence at this city would be to turn a very large portion of the trade, between Upper Canada and her markets in New York and New England, via Montreal, if the cars could pass between these points without transhipment. Montreal is not upon the direct route between Upper Canada and her markets, but the facility of crossing the St. Lawrence without break of guage would more than compensate for the increased distance. But if cars loaded in Upper Canada for a southern market are obliged to break bulk here, they will in preference make the transhipment at once above us, and take the shorter route of the American narrow guage lines. The true policy of Montreal under these circumstances is to push forward an interior line away from the St. Lawrence, and open up the back townships. One of the principal advantages which Canada is promised from the construction of the Grand Trunk by English stockholders, is that the resources of municipalities will be applicable to their local wants. There are two ways in which the back townships may obtain railroad facilities, and Montreal is deeply interested in the selection which they may make.\nOne system is by the construction of branches to join the Grand Trunk. As this line is on the front of the lake and river townships,—those in the rear have not only to build a road through their own townships, but also through the front ones to make their connections; and as the destination of their exports is eastward they are no nearer this point when they reach the Grand Trunk than when they started for it. Again, these short branch lines could not give the required facilities unless they were constructed through every tier of townships; and, although within ten miles of each other they will be separate and independent roads, having each their stations and termini, their engines and cars, and expenses of management, so that with the highest rates charged but few of them could hope to pay dividends. The only escape from this is to have them leased or worked by the trunk line; in which case the back townships after building their own roads will have their trade controlled not according to their wishes but for the interests of the main line. But if the independence of these branch lines be maintained,—in winter always, and in summer, (unless they terminate at some shipping port upon the St. Lawrence where they can have access to American routes opposite), the trade which they drop upon the trunk line will be subject to any tariff which the latter may establish, before it can reach its market.\n\nThe system of branches to the main trunk line, therefore, is the most expensive, and to the back townships the least satisfactory mode of getting to a market: but if another policy is followed, about one half of the number of miles of railway will produce a much better result. The back townships instead of short and expensive branches running north and south, will have a great central route running east and west, putting them upon a main Telegraph line, with the most direct route to Montreal and the west.\nThis policy Toronto has successfully applied to Hamilton. Instead of allowing the Great Western railway, by branch lines, to take the trade of Guelph, Stratford, Sarnia, &c., she has pushed a parallel line north of the Great Western, making its main outlet at Toronto. This line is now to be made a section of the Grand Trunk. By a precisely similar policy, if Montreal would make an effort to regain that Upper Canada trade which is fast slipping away from her through the frontier ports, she should strike for the interior of the country where she is sure to obtain the sympathies of the back townships, and their cordial co-operation in aiding her to carry out so important a project.\n\nNo better instance of the propriety of this course can be cited than the result of the agitation of the Montreal and Kemptville route; while meetings were held in Bytown tendering sympathy and advice to a Bytown and Montreal \"direct\" railway, and appropriating £250 to a Bytown and Pembroke survey, the intelligent and spirited inhabitants of three of the back townships, on the line between Hawkesbury and Kemptville, have passed their by-laws for subscribing £35,000 to the project—condemning the branch line system, and enunciating their preference for direct communication with this city. Shall this appeal to the wealth and intelligence of Montreal be disregarded? or must these secluded settlers be told that the merchants of this city disdain their trade, and will leave them to find their way to the Ogdensburgh road?\n\nThe best indication of where a route for securing the Ottawa trade should be laid, is this—the money test. Bytown will approve but not endorse by the necessary subscription, the river route to Grenville. The intermediate townships upon the banks of the Ottawa we have shewn to be incapable of subscribing. Montreal can do no more than carry the road to Grenville,—so that,\nin agitating the extension beyond that point, this important consideration of financial practicability is the first thing to be considered. There is every probability that one hundred thousand pounds can be raised by local subscriptions on the route from Hawkesbury to Kemptville, while there is little probability that one tenth of this sum can be raised upon the river route to Bytown.\n\nThus, while the Kemptville route proves, by the subscriptions upon the line, that there is a people to aid in constructing, and to sustain by their trade after construction, a railway, the river route up the Ottawa possesses neither of these indispensible requisites. The time will come, undoubtedly, when the route between Montreal and Bytown should be shortened, but a direct route can now neither be carried out, or sustained if constructed, nor is it indispensible, since an indirect one secures not only the same results, but far greater ones—and once which a direct one would altogether fail to attain.\n\nMontreal will be sure of the co-operation of the back townships through which the line will run, and since the front townships are not interested in the Trunk line, but are great landowners in the back townships they may favor a central route. The tendency of our legislation is toward establishing the system which prevails in New York and the Western States—that of a general railroad law enabling parties to construct roads wherever capitalists are willing to invest their money in them. This is the true test of the expediency of a route; for unless this central line can be shewn to be a desirable and necessary one, it will not be undertaken; but if it be proved so, and parties are disposed to carry it through, it ought not to be impeded.\n\nThis great central line will not stop at Kemptville or Perth, but will be in time continued to Peterboro', Lakes Simcoe and Huron. It will be sufficiently distant from the Grand Trunk to give each an independent area for\nsupport. That company cannot consistently oppose such a route, nor can the Government do so upon the plea of a provincial interest in the Trunk line—because, within the last session a charter has been granted to the Toronto and Sarnia line, which is a much closer competitor to the Great Western—one of the oldest sections of the Trunk line. This parallel line north of the Great Western has not only been established with the consent of the Government and the Grand Trunk Company, but is to be, by proclamation, made the Trunk line par excellence, without benefit of guarantee.\n\nIn the appendix will be found the statistics of the Upper Canada Counties lying between the Ottawa and St. Lawrence,—on this side of Kingston. An inspection of this table, together with the map, will prove, that neither a St. Lawrence or an Ottawa River route can satisfy such a country; nor, considering its proximity to Montreal, can anything short of direct communication be accepted. The questions now to be decided are, whether the time has arrived for such a line, and upon what route it should be constructed. The present juncture, when the tendency of the large supplies of the precious metals derived from California and Australia is to reduce the value of money and increase that of real estate and stocks of every description,—when Canadian stocks and bonds are in good repute, and while the municipalities are yet not committed too deeply to the branch-line system,—seems to be the most favorable one for the commencement by Montreal of such an enterprise.\n\nI have the honour to be,\n\nSir,\n\nYour most obedient Servant,\n\nTHOS. C. KEEFER,\n\nEngineer.\nAPPENDIX.\n\nExtract from Report on Montreal and Kingston Railway, dated January, 1852.\n\nThat a railway from Montreal through the Ottawa valley to Bytown, and thence by Perth to Kingston is desirable, will be admitted, but that such a route is preferable to one by the St. Lawrence, or that in fact it would be, in the present position of the Ottawa country, justifiable at all, requires proof. With respect to the intermediate proposition of a route via Grenville, and thence direct to Kingston, as this appears to have been abandoned for the more comprehensive scheme via Bytown and Perth, it may hardly be necessary now to allude to it; but as it constitutes a third candidate for a part of a trunk line which can only embrace one, it may be advocated by some as a sort of compromise between the two. It is natural that where one line only can receive the advantages connected with the grand trunk, every effort should be made by different localities to secure those benefits to themselves, but it would be a great and fatal error to assume that, because there is only one \"grand trunk\" there will never be more than one railway, and therefore to locate this grand trunk with a vain attempt to satisfy all local interests, and all present and future prospects. To future roads may be assigned the care of future interests, and we should do as we have done with more ordinary communications—construct the first where they are most generally useful.\n\nThe Ottawa, as a lumbering district, could not, for some time, contribute any considerable amount of agricultural exports; and its staples timber and lumber cannot afford railway transportation in competition with the river. At present the amount of freight going up is greater than that shipped down from Bytown. Compared with exports, our imports are the least profitable for a railway, because, although the value may be equal or greater, the bulk, or weight, (which is the measure of the cost of transportation,) is about 3 to 1 of the former as compared with the latter.\n\nThe products of the forest, which form the staple of the Ottawa exports, will not, with the exception of ashes, bear railway transportation, and those of agriculture are required for home consumption in the prosecution and extension of the lumber trade. Those townships of Carlton and Lanark from which would come a surplus for a distant market, are the nearest to the St. Lawrence route, and to the most of these this route to Montreal will be as short as one via Bytown and\nGrenville. Bytown has taken steps to provide an outlet for herself, and the route to Montreal for Perth is as short by the St. Lawrence as by the Ottawa.\n\nUpon the Ottawa the pursuits of agriculture and lumbering are mingled, often to the prejudice of both. The St. Lawrence counties are almost exclusively agricultural. They have a surplus for export, which will never go back to an Ottawa road for shipment to Montreal so long as the Ogdensburgh road lies in front of them. To adopt the Ottawa route would, therefore, be virtually to surrender the most populous and wealthy counties to a foreign and a rival road. The St. Lawrence route, on the contrary, secures the front without losing the rear, and sound policy suggests that we should first secure that trade which is in jeopardy, even though we are thereby compelled to neglect that which is less exposed.\n\nNotwithstanding the fact that the road would derive a much greater support from the exporting front counties, than from the importing lumbering ones of the rear, I must repeat that the real argument in favor of the front route in a purely local view, is that all the export and import trade of the rear must cross this route, and its position is therefore such as to secure the largest amount of business which any one route is capable of doing.\n\nThe population of the country lying between the Ottawa and the St. Lawrence, including the counties of which Kingston and Montreal are the capitals, numbers—upwards of one quarter of a million of souls tributary to this line.\n\nA statement taken from the returns of the Ogdensburgh Customs' District, may also be useful as showing the extent to which this road is becoming an outlet for the \"back country\" of Montreal.\n\n**Comparative Statement** of principal entries of Canadian Produce at Ogdensburgh Custom House for the year ending 31st December, 1851, and half year ending 30th June, 1851.\n\n| Description of Articles | Year ending 31st Dec., 1850 | Half Year ending 30th June, 1851 | Annual Ratio of Increase |\n|-------------------------|---------------------------|---------------------------------|--------------------------|\n| Oats, Bushels           | 7,061                     | 21,934                          | 620 per cent.            |\n| Potatoes, do            | 517                       | 11,733                          | 4,500 \"                  |\n| Barley, do              |                           | 2,552                           | 25,000 \"                 |\n| Eggs, Dozen             | 140                       | 16,137                          | 22,000 \"                 |\n| Butter, lbs.            | 52,039                    | 37,182                          | 40 \"                     |\n| Cattle, (meat) No.      | 2,876                     | 1,758                           | 25 \"                     |\n| Swine, No.              | 185                       | 353                             | 880 \"                    |\n| Wool, lbs.              | 6,879                     | 5,549                           | 62 \"                     |\n| Rags, lbs.              | 7,065                     | 14,015                          | 400 \"                    |\n| Sawed Lumber, Feet B. M.| 195,573                   | 230,735                         | 240 \"                    |\n| Undressed Skins, value. | $113                      | $203                            | 360 \"                    |\nIt will be seen that this statement includes nearly every article of agricultural produce, and is an index of the future way traffic of the route. In addition, I may add that perishable articles for immediate consumption in Montreal, fresh meats and fish, vegetables, fruits and milk, will all be important items of way traffic. Also marble, pressed hay, charcoal, fuel, and all the minor manufactures of wood for which the timber and water power upon this route afford every facility, and for which Montreal should be a market of supply instead of demand. From its proximity to the city, the way freight upon this section must be more comprehensive and profitable than upon more distant sections of the Trunk line.\n\nIn up freight, the saving of time and cartage would give all the supplies for the villages upon and north of the line to the railway, and would offer new articles of consumption to these counties. The extension of this road to Toronto, and the country to the north-west of that city will give this line a preference in the export business of the whole north shore of Lake Ontario during the suspension of navigation.\n\nThe monthly statement of receipts of produce at Montreal shew that the greater portion reaches here before the first of August, and is, therefore, the produce of the preceding year which has been held over during winter in Upper Canada. This fact must have an important bearing on the freighting business of the Canadian railways, and particularly of the one under discussion, as it will be the winter outlet of the nearest section which now affords any important surplus for market. That it will be so used can hardly be doubted, because it will enable this city to become a perennial produce market, which she must become to maintain a position in competition with other markets, Boston; New York, Philadelphia and Baltimore, all of which have now secured uninterrupted communication, throughout the winter, with the produce regions of the west. With three railways leading from the St. Lawrence into the consuming districts south of 45°, it is impossible that this city can supply any continued demand, during the five months in which the St. Lawrence is closed, without such a road. The energies of this city will have been directed, hitherto to the destruction of her foreign commerce, unless some adequate \"feeders\" be provided to replace the vacuum caused by the southern exhaust pipes. The railway enterprise looking toward the Atlantic can but have the effect of destroying her independent position as a seaport.\n\nThe surplus wheat crop of Canada, in 1851, probably exceeded five millions of bushels, and as the consumption must have been nearly\ndouble this amount, this province now holds equal rank with the first wheat producing States of America. Canada West furnishes not only the whole of the surplus, but fully a million of bushels to supply the deficiency in Canada East; there cannot, therefore, be a better point to strike out for than the western section of this province, or one which holds out so many inducements to Montreal. Compelled by considerations of climate to hold over the greater part of her surplus, guarded by the St Lawrence and Lake Ontario from the inroads of American lines, the whole fertile stretch of country from Montreal to Guelph at least, is placed on advantageous terms, within the reach of the enterprise of Montreal during those months in which all her energies may be concentrated upon this trade. About ten millions of bushels of wheat are required to supply the flour markets of New England, and that part of New York adjacent to the Canada line. Now, surrendering the seaports of the Atlantic and the southern portion of New England and the Hudson, to other routes, there is yet here at our very doors, a market sufficient for our present surplus, an exporting as well as a consuming market, and which therefore must have an uninterrupted supply by immediate railway communication, from the nearest quarter from which that supply can be obtained. This quarter is the north shore of Lake Ontario—from Belleville to Guelph. The principal agricultural products of the whole of this district will bear railway transportation to a winter market. The present is the first winter in which the New York central line of railways has been permitted to carry freight free of tolls, and according to a Buffalo paper, freight is piled up at that point, beyond the capacity of even those well equipped lines.\n\nIn connection with this subject, I give a list of articles which constitute winter freights from the southern shores of Lakes Ontario and Erie to New York, and the prices of which these articles are carried to that city from Cape Vincent, opposite Kingston. The prices are per 100 lbs., unless otherwise mentioned.\n\n| Articles                  | Price |\n|---------------------------|-------|\n| Pelts                     | .74   |\n| Poultry                   | .82   |\n| Pork and Beef in bbls.    | .57   |\n| Do Fresh                  | .63   |\n| Apples, green or dried    | .70   |\n| Butter and Cheese        | .64   |\n| Lard and Tallow           | .64   |\n| Eggs                      | .69   |\n| Leather                   | .60   |\n| Flax Seed                 | .64   |\n| Pot and Pearl Ashes      | .56   |\n| Whiskey                   | .50   |\n| Wheat, Rye, Peas          |       |\n| Beans and Potatoes        |       |\n| per bushel                | .21   |\n| Corn                      | .10   |\n| Barley                    | .18   |\n| Clover and Grass Seed     | .16   |\n| Oats                      | .14   |\n| Rye Malt                  | .16   |\n| Barley do                 | .15   |\n| Flour, per barrel         | .70   |\n\nIn Mr. Shanly's report on the Bytown and Prescott railway there\nis the following statement:—\"Many of the principal Merchants of Toronto, Hamilton and other rising towns in Western Canada are beginning to import their goods by way of Boston, bringing them through in bond over the Ogdenburgh road. The quantity of adventure goods that have been brought, and are now under contract to come over that road this season is enormous. There are forwarding houses in Boston now making contracts with Merchants in Toronto and elsewhere in Western Canada, to deliver goods direct from England at £5 per ton, or if brought per mail Steamer as \"express goods\" for £8 per ton, to be delivered at Toronto in sixteen days from Liverpool.\n\nIf this business can be done from Boston, via Ogdenburgh, and thence by water to Toronto, to better advantage, than via Montreal, and thence by water, it is high time the Montreal and Kingston road were constructed. The Ogdenburgh route for upward freight is not necessarily cheaper than the Montreal one, but it is quicker, and this recent element of time, is encroaching so rapidly on the ancient one of cost, that for the future greater attention must be given to it.\n\nTaking a more extended view of the enterprise, and viewing it—as the similar great works which connect the Atlantic cities with the west are viewed—as the main link which will connect Montreal with that great centre of commerce, the western lakes, we may consider it in connection with our great canal system, both because there may be presumed an approach to antagonism, and because justice cannot be done to the one interest without the aid of the other. From the report of the directors of the Ogdenburgh road, June, 1850, the following extract is taken: \"Considerable has been said during the past year in relation to the construction of a ship canal from the St. Lawrence to Lake Champlain, and it has been supposed by some that if this project was carried out it would be detrimental to the interests of this company. Very different opinions are entertained as to the practicability of constructing such a canal, but whether practicable or not, we are satisfied that no evidence exists that any such work will be carried out. Should such a canal be made, it would have a beneficial, rather than injurious effect upon our road, as it would essentially aid in turning western trade in this direction. Trade is always accompanied by travel, and whatever might be the course of the freight, the travel would all pass on the railroad.\"\n\nThe last two paragraphs are worthy of all attention. The Ogdenburgh road can be considered a rival only for the local business of the Montreal and Kingston line. For the great western trade that\nroad is a powerful ally. The battle between the St. Lawrence and the Erie canal and railroad is, as Mr. Ex-Comptroller Flagg, observes, to be fought upon the lakes. If it can be brought into the St. Lawrence, and must then stop at Ogdensburgh, it will only be because it ought not to come to Montreal. \"Trade is always accompanied by travel?\"—the latter is the railroad's monopoly—and it might have justly been added that trade cannot be maintained where there are not facilities for travel. Where competition is so close in price, and the choice of routes so numerous, slight personal considerations will govern the direction of shipments, and even there were no risks attached to shipments by the St. Lawrence, at the precise period when such shipments are heaviest, (I mean in November), at that period travelling by water is unpleasant, by land, insupportable; and the mere want of a railway for the \"travel which accompanies trade\" would be fatal to the route. But when the vessel loaded at Chicago, desires to pass Buffalo and Oswego, and make the attempt to reach Montreal, prudence decides in favor of the New York canals,—where a cargo \"frozen in\" can be transhipped and forwarded by rail.\n\nBut, if by means of the railways south of the St. Lawrence, the wholesale supplies of Montreal be kept at the summer level, and access to these supplies from Upper Canada be perfect, there is every inducement for the western dealer to maintain his account here, in preference to purchasing in the Atlantic Cities. What the town is to the country, Montreal should be to the Province, and as the country dealer does not find it his interest to import his little stock direct, so the Provincial dealers generally will find it their interest to repair to their commercial metropolis, provided they be enabled to do so upon equal terms with other quarters—because that metropolis should be by position, the best market for their consignments in exchange; and because they may thereby avoid the inconvenience and extra expense of comparatively small imports under foreign regulations;—and lastly, because their interests are protected by familiar laws over which they can exercise some control.\n\nIf—in addition to her direct trade by sea, the supply of the lower Colonies, shipments to Britain, and the West Indies,—Montreal becomes a flour market for New England, and a depot of her manufactures, as surely she ought to become, (for to no other point as near New England can flour be delivered as cheap, and from no other point can manufactures for the west be distributed so rapidly, extensively, and with so little injury from transhipment, or land carriage), then whether the auxiliary assistance of the rail be invoked in a greater\nor less degree for this freighting business, the \"travel which follows trade,\" must be the undivided perquisite of the \"swift and sure\" line. About two and a half millions of barrels of flour, upwards of nine millions of bushels of wheat, and seven and a half million bushels of corn, have gone eastward to a market in 1851, through Dunkirk, Buffalo, Oswego, Ogdensburgh and Montreal. It has been proved that the New England Markets can be supplied to better advantage by a route north of Champlain, than by one south of that lake,—because of 400,000 barrels of flour which descended from Lake Erie, (through the Welland Canal), into Lake Ontario, 270,000 came to Ogdensburgh, and only 130,000 stopped at Oswego. This was American flour, and while it passed almost in sight of Montreal to a market, 259,000 barrels of Canadian flour went to Oswego, and 30,000 barrels to Ogdensburgh. During the last 3 years, 800,000 barrels of Canadian flour, almost wholly from Lake Ontario, and two and a half millions of bushels of Canada wheat from the same quarter, have gone to Oswego and Ogdensburgh.\n\nOn the other hand, the receipts of flour and wheat at Montreal, shew a respectable increase over the one of 1850, but are still below the figures of 1845. There is also an important increase in the export of flour, corn, pork, and butter, from Montreal to B. N. A. Colonies. Notwithstanding this, one half of the flour consumed in those colonies is imported from New York and Boston, the greater part of it probably being Canadian flour from Lake Ontario, sent through Oswego and Ogdensburgh.\n\nAt the present moment flour is carried by railway from Cape Vincent, opposite Kingston, to New York for 3s. 6d. per barrel. While these movements are going on around us, while the enemy is approaching by parallels to cut off our legitimate supplies, and compassing us about with numerous rivals, the Portland road is about to be opened only to find that at the very season when the railway is most needed it will be powerless; that while—within 24 hours run of a freight engine from Montreal—hundreds of thousands of barrels of flour, and all descriptions of provisions and dairy products are stored in Canada West, these are inaccessible until the navigation opens, when most probably they will be found to have disappeared, during the previous winter, by railway through Niagara, Rochester, Oswego, Cape Vincent, and Ogdensburgh. A barrel of flour may be transported by railway from Toronto to its market in New England for about 4s. currency, and we cannot too soon begin to consider the effect of the completion of the numerous roads which connects our frontier with the American sea board. It will I believe be found\nthat throughout the winter a very large and constant freighting business will be carried on over these roads, in almost every article which now supports the navigation, besides many others for which the navigation is too slow. The day has long since passed when western business can be suspended for 5 months, and the day is rapidly hastening when the business of these five months will exceed that which is now done in the seven summer ones. Montreal must therefore, if she would retain her customers be placed in a direct and constant communication, winter and summer, with that quarter from which she draws her exports and supplies, and to which she sends her imports or her manufactures. When the Portland road is opened we may hope to supply the remaining half of the flour consumed in the Lower Colonies during the winter months, as well as those parts of New England where transportation from other quarters is a more serious matter than the American tariff; and lastly, we may hope to load the vessels of Maine, Nova Scotia, and New Brunswick with flour to exchange for the sugar, molasses, coffee, and fruits of the West Indies or South American ports. But how shall we supply the flour?—for if we thrive as a seaport, our shipping should carry off what arrives while the navigation is open, and if not, we cannot, we dare not purchase in the face of a falling market in November.\n\nWith respect to passengers and mails the necessity for immediate construction of this road is scarcely less urgent. Irrespective of profits it seems to be demanded by national convenience, and by a national pride. The travel between the head of Lake Ontario and Montreal is now limited in winter to a minimum, and even this performed through the state of New York. Little wonder that when the two sections of the politically united Province are thus physically divided, there should be both commercial and social estrangement, and that the rapidly increasing wealth and energies of the western section should be forced into the lap of aliens and rivals. It has not been proved that there is any inevitable necessity for this preference, for if Ogdensburgh is a better route than Buffalo or Oswego for New England business, we have shown that Montreal is not necessarily inferior to Ogdensburgh. The pre-eminence of New York is not an answer, because those markets which are nearer to Montreal than to New York, are more than sufficient for the former.\n\nIn a very short time some half a dozen railways between Lake Champlain and Portland will be put in direct communication with the St. Lawrence at Montreal. It will be the interest of these roads\nto reach the west through Canada, in preference to the State of New York, because the Capital of the latter State will ere long draw down 'o herself the traffic which is found westward of Lake Champlain. The Canada route has now the sympathy and, if required, would obtain the material assistance of numerous corporations, representing many millions of dollars, whose roads must yet look to the St. Lawrence and to Montreal for a large share of their business.\n### Statistics of Counties in Upper-Canada, between the Ottawa and St. Lawrence rivers, for which the St. Lawrence and Ottawa Grand Junction Railway, with its extension to Perth, will be in whole or in part an outlet.\n\n| Counties | Population | Cultivated acres | Land Held | Wild acres | Asses'd value for Taxation 1852 |\n|----------|------------|------------------|-----------|------------|--------------------------------|\n| Leeds     | 30290      | 18023            | 226690    | 886504     | 259893                          |\n| Grenville | 29776      | 69872            | 12271     | 439361     | 115960                           |\n| Dundas    | 13811      | 43645            | 388570    | 111799     | 21432                           |\n| Stormont  | 14613      | 44951            | 122862    | 406852     | 97459                           |\n| Glengarry | 17596      | 69018            | 155758    | 511327     | 142455                           |\n| Prescott  | 10497      | 35920            | 90115     | 201491     | 144901                           |\n| Russell   | 29701      | 6925             | 37469     | 565201     | 9814                            |\n| Carleton  | 31397      | 91094            | 241904    | 102270     | 294461                           |\n| Lanark    | 9415       | 36890            | 135159    | 161157     | 64441                           |\n| Renfrew   | 173523     | 634411           | 11512447  | 4496847    | 1228931                         |\n| York      | 209742     | 1369969          | 3311186   | 2065113    | 70883                           |\n| Essex     | 1569430    | 41168           | 1569430   | 41168      | 70883                           |\n| Middlesex | 157143     | 177896           | 1569430   | 41168      | 70883                           |\n| Hastings  | 157258     | 177896           | 1569430   | 41168      | 70883                           |\n| Frontenac | 157374     | 177896           | 1569430   | 41168      | 70883                           |\n| Leeds     | 157491     | 177896           | 1569430   | 41168      | 70883                           |\n| Grenville | 157608     | 177896           | 1569430   | 41168      | 70883                           |\n| Dundas    | 157725     | 177896           | 1569430   | 41168      | 70883                           |\n| Stormont  | 157842     | 177896           | 1569430   | 41168      | 70883                           |\n| Glengarry | 157959     | 177896           | 1569430   | 41168      | 70883                           |\n| Prescott  | 158076     | 177896           | 1569430   | 41168      | 70883                           |\n| Russell   | 158193     | 177896           | 1569430   | 41168      | 70883                           |\n| Carleton  | 158310     | 177896           | 1569430   | 41168      | 70883                           |\n| Lanark    | 158427     | 177896           | 1569430   | 41168      | 70883                           |\n| Renfrew   | 158544     | 177896           | 1569430   | 41168      | 70883                           |\n\n#### Wheat—bushels.\n- Leeds: 4155\n- Grenville: 14070\n- Dundas: 12222\n- Stormont: 29742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Barley—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Rye—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Peas—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Oats—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Malize—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Buckwheat—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Potatoes—bushels.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Horses.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Neat Cattle.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Sheep.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Swine.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Butter—lbs.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Cheese—lbs.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Beef—lbs.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Pork—lbs.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Wool—lbs.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Fullled Cloth—yards.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n\n#### Flannel and unfulled Cloth—yards.\n- Leeds: 14306\n- Grenville: 17706\n- Dundas: 207122\n- Stormont: 39742\n- Glengarry: 26851\n- Prescott: 11731\n- Russell: 4162\n- Carleton: 10141\n- Lanark: 18150\n- Renfrew: 51352\n### Comparative Statement of Exports, inland and by sea, from Canada in 1851, shewing the principal articles.\n\n| Articles                  | By sea from Montreal and Quebec | From inland ports | Total |\n|---------------------------|---------------------------------|-------------------|-------|\n| Ashes, Pot and Pearl      | $765,924                        | $65,992           | $831,916 |\n| Ash Timber                | 14,896                          |                   | 14,896 |\n| Birch                     | 18,464                          |                   | 18,464 |\n| Deal Ends                 | 18,684                          |                   | 18,684 |\n| Elm                       | 196,420                         |                   | 196,420 |\n| Oak                       | 189,876                         | 14,620            | 204,496 |\n| Pine, white               | 1,518,528                       | 160,864           | 2,095,644 |\n| Pine, red                 | 416,232                         |                   | 416,232 |\n| Staves, Standard          | 64,488                          | 16,624            | 81,012 |\n| Staves, other             | 358,844                         | 1,372             | 360,216 |\n| Plank and Boards          | 937,480                         | 774,116           | 1,711,596 |\n| Spars, Masts & Hand spikes| 50,216                           | 6,116             | 56,332 |\n| Lath and Firewood         | 32,076                          | 39,800            | 71,876 |\n| Shingles                  | 260                             | 20,732            | 20,992 |\n| Cows and other cattle     | 40                              | 140,176           | 140,216 |\n| Horses                    | 200                             | 136,848           | 186,048 |\n| Wheat                     | 144,184                         | 491,760           | 635,944 |\n| Flour                     | 1,450,148                       | 1,181,494         | 2,631,632 |\n| Indian Corn               | 26,056                          |                   | 26,056 |\n| Barley and Rye            | 440                             | 75,596            | 76,036 |\n| Beans and Peas            | 40,208                          | 41,588            | 81,796 |\n| Oats                      | 2,272                           | 135,708           | 137,980 |\n| Butter                    | 19,5728                         | 38,004            | 233,732 |\n| Eggs                      |                                  | 38,008            | 38,008 |\n| Wool                      |                                  | 41,896            | 41,896 |\n| Copper, fine and pig      |                                  | 42,752            | 42,752 |\n| Copper ore                | 35,000                          | 17,620            | 52,620 |\n| Unenumerated              | 1,359,372                       | 1,808,704         | 3,168,076 |\n\nTotal: 8,323,076\n\nThe returns of exports inland are very imperfect, and will not correspond with the United States imports from Canada.\n\nIt will be seen at the bottom that there is a \"direct export\" from inland ports, which was neither to the United States nor from Montreal and Quebec. It is to be presumed that this was cargo sent to sea from inland ports and not reported at Montreal or Quebec, although such report is compulsory on all inland craft proceeding to sea.\n### Comparative Statement of Imports inland, via United States, with Imports by sea, via St. Lawrence 1851, distinguishing the principal articles.\n\n| Articles                  | Sea, Montreal and Quebec | Direct at inland ports from Sfa. | Total Imports by Sea. | Inland imports via U. S. | Total imports by Sea and inland. |\n|---------------------------|--------------------------|----------------------------------|-----------------------|-------------------------|---------------------------------|\n| Tea                       | $152,556                 | $15,528                          | $168,084              | $893,216                | $1,061,300                      |\n| Tobacco                   | 18,924                   |                                  |                       |                         | 422,784                         |\n| Cotton Manufactures       | 2,218,364                | 799,968                          | 3,018,332             | 565,124                 | 3,583,456                       |\n| Woollen do                | 1,719,872                | 581,944                          | 2,301,816             | 439,960                 | 2,741,076                       |\n| Hardware do               | 1,237,340                | 389,868                          | 1,627,208             | 318,844                 | 1,946,052                       |\n| Wooden-ware               | 11,612                   |                                  | 11,612                | 53,734                  | 65,336                          |\n| Machinery                 | 6,764                    | 88                               | 6,852                 | 85,708                  | 92,620                          |\n| Boots and Shoes           | 6,512                    | 356                              | 6,868                 | 42,592                  | 49,460                          |\n| Leather Manufactures      | 26,196                   | 26,960                           | 53,156                | 47,388                  | 100,544                         |\n| Hides                     | 1,164                    |                                  | 1,164                 | 89,204                  | 90,368                          |\n| Leather, tanned           | 46,312                   | 128                              | 46,440                | 126,232                 | 172,672                         |\n| Oils, not Palm            | 135,440                  | 268                              | 135,708               | 47,804                  | 183,512                         |\n| Paper                     | 53,180                   | 12,048                           | 65,228                | 32,996                  | 98,224                          |\n| Rice                      | 12,396                   |                                  | 12,396                | 19,600                  | 32,316                          |\n| Sugar                     | 586,804                  | 125,804                          | 712,408               | 278,468                 | 990,876                         |\n| Molasses                  | 60,968                   |                                  | 60,968                | 19,296                  | 80,264                          |\n| Salt                      | 23,792                   | 2,188                            | 25,980                | 79,816                  | 105,796                         |\n| Glass                     | 77,124                   | 1,136                            | 78,260                | 18,828                  | 97,088                          |\n| Coal                      | 101,176                  |                                  | 101,176               | 38,652                  | 139,828                         |\n| Furs                      | 82,116                   | 7,916                            | 90,032                | 44,264                  | 134,296                         |\n| Silk Manufactures         | 401,904                  | 5,588                            | 407,492               | 80,768                  | 488,260                         |\n| India Rubber do           | 156                      | 233,168                          | 233,324               | 53,960                  | 287,284                         |\n| Dyestuffs                 | 38,916                   |                                  | 38,916                | 12,680                  | 51,596                          |\n| Coffee                    | 13,632                   |                                  | 13,632                | 116,988                 | 130,620                         |\n| Fruit                     | 53,552                   | 752                              | 54,304                | 81,144                  | 135,448                         |\n| Fish                      | 71,260                   |                                  | 71,260                | 17,544                  | 88,804                          |\n| Unenumerated              | 4,159,580                | 940,608                          | 5,100,188             | 4,780,372               | 9,880,560                       |\n| Goods in Transit for U. S.| 755,588                  |                                  | 755,588               |                        | 755,588                          |\n\nTotal: 12,073,000\n\nThe large amount of \"unenumerated\" values renders this statement but approximate, because the enumeration of sea imports is much fuller than those inland—where, at some ports, no enumeration of articles is made.\n### Statement showing the value of Imports into Canada from the United States\n\n#### PORTS\n\n| Port                  | Value |\n|-----------------------|-------|\n| Sault Ste. Marie      |       |\n| Bruce Mines           |       |\n| Goderich              |       |\n| Sudbury               |       |\n| Sandwich              |       |\n| Chatham               |       |\n| Amherst               |       |\n| Humber                |       |\n| Rowan                 |       |\n| Dorval                |       |\n| Dunnville             |       |\n| Cobourg               |       |\n| Fort Erie             |       |\n| Quinte                |       |\n| Niagara               |       |\n| Duluth                |       |\n| Hamilton              |       |\n| Oakville              |       |\n| Credit                |       |\n| Toronto               |       |\n| Whitby                |       |\n| Dublin                |       |\n| Newmarket             |       |\n| Hope                  |       |\n| Cobourg               |       |\n| Milford               |       |\n| Wellington            |       |\n| Belleville            |       |\n| Supreme               |       |\n| Picton                |       |\n| Bath                  |       |\n| Kingston              |       |\n| Hamilton              |       |\n| Brockville            |       |\n| Prescott              |       |\n| Elliot                |       |\n| Mounttown             |       |\n| Pickens Landing       |       |\n| Cornwall              |       |\n| St. Regis             |       |\n| Shefford              |       |\n| Coteau du Lac         |       |\n\n#### Total\n\n| Value |\n|-------|\n| 541698 |\n\n### Statement showing the Quantity and Value of the Principal Articles Exported from Canada\n\n#### PORTS\n\n| Port                  | Value |\n|-----------------------|-------|\n| Sault Ste. Marie      |       |\n| Bruce Mines           |       |\n| Goderich              |       |\n| Sudbury               |       |\n| Sandwich              |       |\n| Chatham               |       |\n| Amherst               |       |\n| Humber                |       |\n| Rowan                 |       |\n| Dorval                |       |\n| Dunnville             |       |\n| Cobourg               |       |\n| Fort Erie             |       |\n| Quinte                |       |\n| Niagara               |       |\n| Duluth                |       |\n| Hamilton              |       |\n| Oakville              |       |\n| Credit                |       |\n| Toronto               |       |\n| Whitby                |       |\n| Dublin                |       |\n| Newmarket             |       |\n| Hope                  |       |\n| Cobourg               |       |\n| Milford               |       |\n| Wellington            |       |\n| Belleville            |       |\n| Supreme               |       |\n| Picton                |       |\n| Bath                  |       |\n| Kingston              |       |\n| Hamilton              |       |\n| Brockville            |       |\n| Prescott              |       |\n| Elliot                |       |\n| Mounttown             |       |\n| Pickens Landing       |       |\n| Cornwall              |       |\n| St. Regis             |       |\n| Shefford              |       |\n| Coteau du Lac         |       |\n\n#### Total\n\n| Value |\n|-------|\n| 564116 |\n## Principal Articles Exported from Canada to the United States, from Ports above Montreal in 1851.\n\n| Class       | Wool | Wheat | Flour | Barley and Retro | Beans and Peas | Oats | Butter | Eggs |\n|-------------|------|-------|-------|-----------------|----------------|------|--------|------|\n| Value       |      |       |       |                 |                |      |        |      |\n| Pounds      | Value |      | Value | Value | Value | Value | Value | Value |\n|             |       | Padle |       | Barlet |       |       |       |       |\n|             |       | Fails |       |          |       |       |       |       |\n\n### Wool\n\n- Value: \n- Weight: \n\n### Wheat\n\n- Value: \n- Weight: \n\n### Flour\n\n- Value: \n- Weight: \n\n### Barley and Retro\n\n- Value: \n- Weight: \n\n### Beans and Peas\n\n- Value: \n- Weight: \n\n### Oats\n\n- Value: \n- Weight: \n\n### Butter\n\n- Value: \n- Weight: \n\n### Eggs\n\n- Value: \n- Weight: \n\n### Total Value\n\n- Value: \n\n---\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_22408.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 70, "total-input-tokens": 109898, "total-output-tokens": 29061, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2897, 3], [2897, 5460, 4], [5460, 5460, 5], [5460, 5460, 6], [5460, 5460, 7], [5460, 5460, 8], [5460, 5460, 9], [5460, 5460, 10], [5460, 5460, 11], [5460, 5460, 12], [5460, 5460, 13], [5460, 5460, 14], [5460, 5460, 15], [5460, 5460, 16], [5460, 6598, 17], [6598, 8043, 18], [8043, 9677, 19], [9677, 11307, 20], [11307, 12907, 21], [12907, 14591, 22], [14591, 16257, 23], [16257, 17820, 24], [17820, 18307, 25], [18307, 18770, 26], [18770, 20071, 27], [20071, 22025, 28], [22025, 23985, 29], [23985, 25791, 30], [25791, 27746, 31], [27746, 29717, 32], [29717, 31631, 33], [31631, 33653, 34], [33653, 35698, 35], [35698, 37668, 36], [37668, 39670, 37], [39670, 41614, 38], [41614, 43514, 39], [43514, 45417, 40], [45417, 47312, 41], [47312, 49349, 42], [49349, 50706, 43], [50706, 52021, 44], [52021, 53612, 45], [53612, 55416, 46], [55416, 57173, 47], [57173, 58813, 48], [58813, 60765, 49], [60765, 62684, 50], [62684, 64612, 51], [64612, 66501, 52], [66501, 68469, 53], [68469, 70108, 54], [70108, 72611, 55], [72611, 76040, 56], [76040, 78730, 57], [78730, 81815, 58], [81815, 84480, 59], [84480, 87211, 60], [87211, 89920, 61], [89920, 92558, 62], [92558, 93019, 63], [93019, 99741, 64], [99741, 103140, 65], [103140, 108802, 66], [108802, 108802, 67], [108802, 112079, 68], [112079, 113030, 69], [113030, 113030, 70]], "primary_language": ["None", "en", "en", "en", "None", "None", "None", "None", "en", "None", "None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, true, true, false], "is_diagram": [true, false, false, true, false, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]