[{"id": "8039e9dc9da3537eaab719d7a70c7e91cba0f4d8", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nDISCOURS\nDE\nM. LE JUGE ROUTHIER\nAU\nCONCERT DE CHARITÉ\nDONNÉ A QUÉBEC\nPAR\nMADAME ALBANI\nLe 13 mai 1890\n\nQUÉBEC\nIMPRIMERIE GÉNÉRALE A. COTÉ ET Cie\n1890\nDISCOURS\n\nPRONONCÉ\n\nAU CONCERT DE MME ALBANI\n\nLE 13 MAI 1890\n\n---\n\nMESDAMES, MESSIEURS,\n\nLe grand fabuliste LaFontaine, surnommé le Bon, quoiqu'il fût très malin, a raconté dans une fable, qu'on est convenu de trouver charmante, mais qui me semble vilaine, la démarche infructueuse de la cigale auprès de la fourmi, sa voisine.\nVous connaissez tous ce tableau malicieux d'une malheureuse aventure :\n\nLa cigale ayant chanté\nTout l'été,\nSe trouva fort dépourvue,\nQuand la bise fut venue.\nPas un seul petit morceau\nDe mouche ou de vermisseau.\nElle alla crier famine\nChez la fourmi, sa voisine,\nLa priant de lui prêter\nQuelque grain, pour subsister\nJusqu'à la saison nouvelle.\n—\"Je vous paierai, lui dit-elle,\nAvant l'Août, foi d'animal,\nIntérêt et principal.\"\nLa fourmi n'est pas prêteuse,\nC'est là son moindre défaut.\n—\"Que faisiez-vous au temps chaud,\nDit-elle, à cette emprunteuse?\"\n—Nuit et jour, à tout venant,\nJe chantais, ne vous déplaise,\n—Vous chantiez, j'en suis fort aise,\nEh bien ! dansez maintenant !\n\nMesdames et Messieurs, cette fable est, à mon avis, une calomnie atroce et contre la cigale et contre la fourmi.\n\nVous partagerez mon opinion quand vous réfléchirez que la cigale remplit sa mission en chantant, comme la fourmi est fidèle à la sienne en travaillant et économisant.\n\nVous serez de mon avis, surtout ce soir, si vous songez que l'apologue cache une allégorie, que la cigale représente ici l'artiste, et que la fourmi symbolise le peuple des travailleurs de la glèbe et de tous ceux qui peinent courageusement et honorablement à faire fortune,\nPour moi, c'est précisément parce qu'elle chante toujours, parce qu'elle est une infatigable artiste, que j'aime la cigale ; mais j'aime aussi la fourmi — surtout la fourmi canadienne — parce que, si économe qu'elle puisse être, elle est aussi préteuse et obligeante ; et quand la cigale, la fidèle chanteuse, vient à sa porte crier famine, non pas pour elle-même, mais pour les enfants orphelins, pour les vieillards infirmes, pour les pauvres auxquels la maladie interdit tout travail, pour tous les déshérités de la fortune, la fourmi québecquoise ne lui répond pas « eh bien ! dansez maintenant ! » non, elle lui répond : « Chantez encore, et je vous donnerai ; chantez toujours, et je vous ouvrirai ma bourse et mes greniers. »\n\nEt pourquoi la cigale ne serait-elle pas la bienvenue auprès de la fourmi ?\nChanter, n'est-ce pas aussi travailler ? Et pour arriver à bien chanter, ne faut-il pas le travail le plus ardu et le plus persévérant ?\n\nDemandez-le plutôt à la grande artiste que vous venez entendre, et qui est devenue une de nos gloires nationales.\n\nD'ailleurs, la cigale a-t-elle vraiment autre chose à faire en ce monde ?\n\nL'histoire naturelle nous apprend que c'est un insecte, mais un insecte qui a des ailes, qui aime la lumière éblouissante, qui adore le soleil et ses chauds rayons. C'est un insecte qui vibre sous la caresse d'un rayon lumineux, comme la harpe éolienne au moindre souffle de l'air ; qui chante, comme les artistes, comme les poètes, comme les orateurs, et qui n'a été créée que pour chanter ; qui, dans sa chanson,\nbénit le ciel dont la chaleur mûrit les raisins,\ndore les moissons et fait épanouir les roses ; qui\nne se nourrit pas de mouches et de vermissaux,\nmais d'un peu de rosée, c'est-à-dire de cette\ngoutte d'eau pure qui descend du ciel, et qui,\nau lieu de tomber sur la terre souillée, se pose\net se parfume dans le calice des fleurs ! c'est\nl'insecte ami du laboureur, qui le suit dans son\nchamp pour lui répéter sa chanson, le distraire\ndans son labour, et lui annoncer l'heure du\ndîner ; c'est un insecte qui ne vieillit pas, parce\nqu'elle n'a ni chair, ni sang,—image de ces\ngrandes artistes qui restent toujours jeunes\nparce que leur vie est chaste, et dont le type est\nsi rare dans le monde des coulisses, que l'Euro-\npe a dû venir jusqu'en Canada pour en trouver\nun modèle ! Oui, la cigale ignore la vieillesse et\nles maladies ; elle se dessèche presque subite-\nment sur l'arbre natal quand l'été finit, et elle meurt de ne pouvoir plus chanter quand le soleil s'en va réchauffer d'autres latitudes.\n\nAh ! je ne suis pas étonné que les poètes les plus illustres de l'ancienne Grèce, Homère, Anacréon, Théocrite, aient célébré la cigale dans leurs chants, et je me demande pourquoi l'abbé Delille et La Fontaine l'ont vilipendée.\n\nJe n'en sais rien, mais je crois le deviner. C'est que tous deux avaient des femmes fort acariâtres, qui les tourmentaient sans cesse, et qu'ils auront confondu les gronderies perpétuelles de leurs charmantes moitiés avec les chansons des cigales.\n\nIls avaient d'autant plus tort que, s'il faut en croire les naturalistes, ce sont les cigales mâles\nqui chantent, et non les femelles, qui n'ont pas de voix.\n\nSi j'étais malin, je dirais : heureux peuple des cigales dont les femmes sont muettes ! Mais je ne le dirai pas ; je n'ai pas le droit de le dire ce soir, dans cette brillante réunion où le beau sexe est mieux représenté que le mien, tant sur la scène que dans l'auditoire.\n\nQuoi qu'il en soit, il est un grand poète du Midi, Autran, qui a noblement vengé la cigale des injustes attaques de LaFontaine. Ecoutez cette jolie épître à l'insecte ailé :\n\n\"O fille du soleil, qui, la chaleur venue,\nRecommences chez nous ta cantate connue ;\nChanteuse aux longs couplets, aux refrains toujours prêts,\nPréférant la lumière à l'ombre des forêts,\nEt vivant tout le jour oisive, mais frugale,\"\nDis-moi, qu'avais-tu fait, ô ma pauvre cigale,\nAu copiste d'Esope, à ce rimeur sournois,\nQui, dès ses premiers vers sur le sol champenois,\nTe montre allant prier la fourmi, ta voisine,\nDe te prêter le grain qui manque à ta cuisine ;\nEt n'ayant obtenu ni grain, ni petit ver,\nGrelottant de misère à la bise d'hiver ?\nTu le laissas parler, ne daignant lui répondre ;\nDeux mots pourtant auraient suffi pour le confondre.\nMoins discret, j'aurais dit peut-être à ce conteur :\n\"Bonhomme, d'où prends-tu ce récit imposteur ?\nQuand la bise revient et sévit à la ronde,\nJ'ai fini ma chanson et ne suis plus au monde ;\nOn me recherche en vain, soit dans le sillon creux,\nSoit parmi les rameaux de l'olivier poudreux ;\nJe ne suis plus alors, moi, l'artiste qu'on vante,\nQu'une membrane vide ; et fussé-je vivante,\nJe n'irais point d'ailleurs, pour en faire un repas,\nQuêter ni grain, ni ver, dont je ne mange pas.\nFabuliste distrait dont la bévue est grande,\nApprenez que je vis seulement sur ma lande,\nDe la brise qui passe et de l'azur du ciel.\nSobre je suis la sœur de cette mouche à miel\nQui du parfum des lis et des roses s'enivre,\nEt dont le nom se trouve à peine en votre livre.\nVous songiez trop, poète, aux animaux gloutons ;\nVous parliez trop des loups courant sus aux moutons.\nVous avez moins connu l'exquise poésie\nDes insectes ailés qui vivent d'ambroisie,\nEt quand l'âpre saison revient les tourmenter\nAiment mieux expirer que de ne plus chanter.\"\n\nMesdames et Messieurs, vous avez saisi,\nn'est-ce pas, tout l'à-propos de cette réhabilitation de la chanteuse des champs dans la fête intellectuelle et artistique qui nous réunit ce soir ?\n\nVous avez deviné que c'est l'Art, sous ses formes multiples, chant, musique, poésie, éloquence, que j'ai voulu défendre contre les dédains et les mépris des hommes trop positifs.\nVous avez compris que c'est le moment de venger l'idéal, trop souvent méconnu, quand il est si admirablement représenté ce soir ; quand nous avons parmi nous une femme à la voix d'ange, dont les chants ravissent l'oreille, un ange au cœur de femme, qui prend pitié des malheureux et qui vient les couvrir de ses ailes.\n\nEst-ce que l'occasion n'est pas bien choisie pour vous dire que les artistes, chanteurs, musiciens, poètes, orateurs, ne sont pas des êtres inutiles en ce monde, et que leur mission sociale est d'un ordre supérieur et réel ?\n\nOui, sans doute, un peuple comme le nôtre est et doit être une fourmilière, c'est-à-dire, une réunion d'hommes laborieux, sobres, économes, prévoyant le lendemain, et réservant pour les\nmauvais jours une part du fruit de leurs la-\nbeurs.\n\nMais parmi ces fourmis qui travaillent, il\nfaut des cigales qui chantent, c'est-à-dire des\nartistes dont les œuvres rendent l'idéal visible\net embellissent notre vie. Sur cette terre d'exil,\nbagne où l'homme est condamné aux travaux\nforcés, il faut des voix qui nous rappellent la\nvraie patrie, comme ces chants d'oiseaux qui\nrappellent le pays natal aux malheureux pros-\ncrits. Au milieu des luttes pénibles que les\ntravailleurs livrent à la nature et qui les cour-\nbent vers la terre, il faut des amants de l'idéal,\nqui les relèvent et qui les transportent sur les\nsommets, où le soleil est plus ardent et la lu-\nmière plus vive.\nEt, n'allez pas vous imaginer que ces âmes choisies,\n\nQui portent le flambeau sacré des poésies,\nqui chantent leurs aïeux, leur patrie, leur Dieu,\nne contribuent pas au progrès des nations.\nN'allez pas croire qu'il soit moins nécessaire pour\nl'avenir d'une race de cultiver les arts et les\nlettres que de défricher le sol. Ce serait une\ngrave erreur.\n\nMais, voyez donc la France : n'est-ce pas la\nmeilleure part de sa gloire d'avoir su marcher à\nla tête de la civilisation en cultivant les arts et\nles lettres ?\n\nN'est-ce pas un des titres les plus glorieux de\nl'Eglise catholique d'avoir été pendant les siè-\ncles de barbarie la protectrice des sciences, des\nlettres et des arts ?\nSans doute, la prospérité matérielle et la richesse sont des forces qu’une nation doit acquérir ; mais elles ne suffisent pas à lui donner la grandeur et l’éclat.\n\nIl y a quelque chose qui est plus puissant que les dollars, ce sont les idées. C’est par elles qu’un peuple grandit, progresse et devient glorieux.\n\nEtudiez donc la matière elle même, et dites moi où se trouvent les forces mystérieuses et incalculables qui accomplissent ses admirables évolutions ? Elles se trouvent dans ses éléments les plus immatériels et les moins visibles !\n\nVoyez cette locomotive qui emporte avec une vitesse vertigineuse une longue file de lourds chariots. Où donc est le secret de sa force ? Est-il dans ce mécanisme qui semble lui don-\nner le mouvement ? Est-il dans cette bouilloire qui respire bruyamment et qui mugit comme une bête fauve ?—Non, le secret de sa force est dans un peu de vapeur presque immatérielle, comprimée dans un tube.\n\nEt qu'y a-t-il de plus beau en ce monde que la lumière ? Qu'y a-t-il de plus puissant que l'électricité ? Et, cependant, ce sont des fluides invisibles, impondérables, qui semblent n'avoir rien de matériel.\n\nLe même phénomène se retrouve dans les êtres vivants. Sans doute, il leur faut un corps et des organes, mais c'est l'esprit qui les habite qui leur donne le mouvement et la vie.\n\nEh ! bien, Mesdames et Messieurs, il en est de même pour les nations. Ce sont leurs élé-\nments les plus immatériels qui leur assurent la vitalité, l'influence et l'illustration.\n\nLes races vraiment glorieuses sont celles qui gravitent autour de cet astre qu'on appelle le Beau, splendeur de l'Infini, et qui en reflètent l'éclat, comme les planètes rayonnent de la lumière qu'elles empruntent au soleil.\n\nRegardez ce globe obscur que nous habitons : il est opaque, brumeux, enveloppé d'ombres, de déserts incultes, de forêts noires, d'océans pleins de tempêtes, de villes enfumées ; et, cependant, quand les habitants des autres planètes abaissent vers nous leurs regards, ils demandent à leurs savants : quelle est donc cette belle étoile qui scintille là-bas dans le bleu firmament, comme un diamant dans un écrin\nde velours ? Et les savants répondent : c'est la Terre !\n\nVoilà comment les rayons du soleil transforment notre sombre séjour en un globe lumineux.\n\nOr, je dis que les peuples aussi deviennent des astres quand ils se rapprochent assez du Beau idéal pour en refléter les rayons ; et je ne ferai que rendre à la race canadienne-française un hommage mérité en ajoutant qu'elle a déjà manifesté pour les Beaux-Arts des aptitudes et des attractions incontestables.\n\nVoilà pourquoi je garde une confiance inébranlable dans notre avenir national.\n\nJe crois très fermement qu'après avoir produit des artistes comme Albani, des musiciens\ncomme Gagnon, Lavallée et Desève, des peintres comme Hamel, Bourassa, et leurs disciples, des sculpteurs comme Hébert, des poètes comme Crémazie, Fréchette et Lemay, des orateurs comme Chapleau et Laurier, des écrivains comme Garneau, Chauveau, Taché, Casgrain et vingt autres, notre race a conquis le droit de cité sur les bords du Saint Laurent, et que les accents glorieux de notre langue ne cesseront jamais d'y retentir !\n\nSi les rudes et courageux colons qui, traversant les mers, vinrent fonder ici le berceau d'une France nouvelle, pouvaient sortir de leurs tombeaux et prendre part à nos grandes fêtes, dont le triple caractère est toujours religieux, intellectuel et artistique, il me semble qu'ils nous diraient :\n« Enfants, nous sommes contents de vous.\nSur le sol que nous avons arrosé de nos sueurs et de notre sang, vous recueillez les fruits de la paix que nos guerres vous ont achetée. Vous cultivez à la fois vos terres et vos intelligences, vous entretez un doux commerce avec les Lettres sans négliger celui des affaires, vous favorisez le double culte du progrès industriel et des Beaux Arts : c'est bien, nous sommes contents de vous.\n\n» C'est un peuple d'agriculteurs et de lettrés, de travailleurs et d'artistes, que nous avons voulu former, et, dans la couronne qui brille à votre front nous voyons déjà s'entrelacer les épis de froment et les feuilles de laurier. Nous sommes contents de vous, et, grâce à ce double travail qui féconde à la fois le sol natal et le génie\nnational, vous ressemblerez un jour à ces pins séculaires de vos forêts dont les racines plongent profondément dans le sol et dont la tête se perd dans le ciel.\"\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_12826.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 29, "total-input-tokens": 49658, "total-output-tokens": 5486, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 944, 3], [944, 2068, 4], [2068, 2068, 5], [2068, 2218, 6], [2218, 2218, 7], [2218, 2546, 8], [2546, 3101, 9], [3101, 3787, 10], [3787, 4597, 11], [4597, 5340, 12], [5340, 6204, 13], [6204, 6921, 14], [6921, 7663, 15], [7663, 8655, 16], [8655, 9484, 17], [9484, 10216, 18], [10216, 10901, 19], [10901, 11583, 20], [11583, 12310, 21], [12310, 12993, 22], [12993, 13720, 23], [13720, 14349, 24], [14349, 15074, 25], [15074, 15846, 26], [15846, 16008, 27], [16008, 16008, 28], [16008, 16008, 29]], "primary_language": ["en", "en", "en", "en", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]