[{"id": "d611e0bfb958a6289df3282994d3edbd5019a2fe", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Relié avec d’autres documents\n- [ ] La reliure serrée peut causer de l’ombre ou de la distortion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d’une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n’ont pas été filmées.\n\nPages discoloured, stained or foxed/\nPages détachées/\n\nQuality of print varies/\nQualité inégale de l’impression\n\nIncludes supplementary material/\nComprend du matériel supplémentaire\n\nOnly edition available/\nSeule édition disponible\n\nPages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtront sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nREPORT OF THE VISIT\n\nOF THE\n\nBRITISH ASSOCIATION\n\nTO THE\n\nCANADIAN NORTH-WEST.\n\nDescription of the Trip to the Rocky Mountains,\nAddresses Presented, Report of Speeches\nDelivered, Doings in Winnipeg\n\nBY R. L. RICHARDSON,\n\nJOURNALIST.\n\nWinnipeg, Manitoba:\nMcIntyre Bros., Book and Job Printers,\n\n1884.\nSPECIAL NOTICE.\n\nIt will be observed that a limited number of business cards, together with a few advertisements, have been placed in this pamphlet, and it might be stated that none but the most prominent and responsible firms are mentioned. They were inserted for several reasons: firstly, to indicate the wealth of the city, by showing what firms do the business therein; secondly, as a guide to those into whose hands this pamphlet is likely to fall, and who may desire to transact business in Winnipeg with any branch represented. To those so desirous, we take the liberty of recommending any firms represented in the pamphlet. Following is a list of the firms whose cards appear:\n\nAGENTS—ESTATE, FINANCIAL, ETC.\nScoones & Wolf.\nS. Polson.\nCarruthers & Brock.\nG. W. Girdlestone.\nH. W. A. Chambre & Co.\n\nAGRICULTURAL IMPLEMENTS.\nWesbrook & Fairchild.\nA. Harris, Son & Co.\nThe Watson Manufacturing Co.\n\nBANKS AND BANKERS.\nBank of Montreal.\nMerchants Bank of Canada.\nMacArthur, Boyle & Campbell.\n\nBARRISTERS, SOLICITORS, ETC.\nAikins, Culver & Hamilton.\nBain, Blanchard & Mulock.\nMcArthur & Dexter.\nMcDonald & Tupper.\n\nBOOTS AND SHOES.\nAmes, Holden Company—Wholesale.\nThos. Ryan—Wholesale and Retail.\n\nCLOTHING—WHOLESALE.\nW. E. Sanford & Co.\nH. Shorey & Co.\n\nCROCKERY AND GLASSWARE.\nPorter & Ronald—Wholesale and Retail.\n\nDRY GOODS, ETC.—WHOLESALE.\nR. J. Whitla & Co.\nCampbell, Spera & Co.\nHodgson, Sumner & Co.\n\nFARM LANDS.\nHudson's Bay Co.\nThe Canada Northwest Land Co.\nCanadian Pacific Railway Co.\nManitoba & Northwestern R'y Co.\nDominion Government.\n\nFURNITURE.\nBishop & Shelton.\nThomas Scott.\n\nGROCERS—WHOLESALE.\nTurner, McKeand & Co.\nThompson, Codville & Co.\nLyon, Mackenzie & Powis.\nJames Bissett & Son.\nSutherland & Campbell.\n\nHARDWARE.\nJ. H. Ashdown—Wholesale and Retail.\nMulholland Bros.\nJames Bissett & Son—Wholesale.\n\nHOTELS.\nThe Queens—O'Connor & Brown.\nThe Leland House—Douglas & Co.\n\nMISCELLANEOUS.\nOgilvie Milling Co.—Flour and Grain.\nE. L. Drewry—Beer and Ale Brewer.\nNorthwest Mounted Police—Rates, etc.\n\nNEWSPAPERS.\nManitoba Free Press.\n\nSTATIONERY.\nParsons & Ferguson.\n\nSTOVES AND METALS.\nThe E. & C. Gurney Company.\nINTRODUCTORY AND ARRIVAL.\n\nThe visit of so distinguished a body of men as the British Scientific Association to our Dominion, and the holding of their Annual Convention in our metropolis, is an event of no small importance in the history of Canada; and no one who has heard the expressions of opinion regarding the country, which have fallen from the lips of the leading members of the Association, can doubt that great benefits will accrue to the Dominion from that visit. The most important result of the visit will not be the impetus given to the study of science in the Dominion, although all will admit the great importance of that result, but rather the opportunity afforded to Canada of demonstrating to the leading and thinking men of England, that with her great natural resources, she is the most desirable field for immigration now competing for the great surplus population of Britain. Always keenly alive to the interests of the great Northwest, and realizing the importance of the visit of the Association to Canada, and the desirability of having its members traverse the great fertile belt from Winnipeg to the Rocky Mountains, the Canadian Pacific Railway with its proverbial courtesy and enterprise placed its line, and its palatial sleeping cars at the full disposal of the Association, and invited its members to travel and see for themselves. It will readily be surmised that the members of the Association, possessed of the greatest influence and enterprise, availed themselves of the opportunity afforded of traversing the great Dominion from the Atlantic almost to the Pacific. They did so, and it is particularly with that visit that we have to deal in this pamphlet.\n\nIt was on the evening of the 6th of September, 1884, that the party, after having travelled over the Eastern Provinces and visited the principal towns and viewed the sights both there and in Ontario, embarked at Sarnia, Ont., on the magnificent iron steamer Alberta, which\nis owned by the C.P.R., and set sail or Port Arthur, the northern port of Canada of the greatest body of fresh water on the continent—Lake Superior. After an uneventful trip, rendered interesting by the beautiful scenery encountered at Sault Ste. Marie and along the St. Mary River, before Lake Superior is reached, the party landed at Port Arthur on the following Monday. Here they were met by Mr. J. M. Egan, General Superintendent of the Canadian Pacific Railway, who had a special train of seven magnificent sleeping cars in waiting to convey them right through to the Rocky Mountains and return, a distance of 3,000 miles, 1,500 each way. The special train reached Winnipeg, nearly 500 miles west of Port Arthur, early on the following Wednesday. Winnipeg is the capital of the Province of Manitoba, now admitted by Canadian statesmen destined soon to be the central province of the Dominion in importance, as she now is in location. It is scarcely a decade since this thriving western city of 25,000 population was known as Fort Garry, a Hudson Bay trading post at the junction of the Red and Assiniboine Rivers, with perhaps 200 of a population. It may be asked to what is the phenomenal progress of Winnipeg due? We answer, to the remarkable fertility of the soil surrounding it for many miles, and to the enterprise of the Canadian Pacific Railway, which now supports at this point in connection with its works, offices, and on the division, at least six thousand individuals.\nTHE TRIP TO THE ROCKIES.\n\nThe writer of this pamphlet, through the courtesy of Superintendent Egan, was fortunate enough to secure passage with the party, and for convenience of diction the narrative is continued in the first person plural. It was about five o'clock A.M. when we steamed out of the C.P.R. station and commenced our journey westward over the great fertile plains of Manitoba and the Northwest territories.\n\nIt may be as well at this stage to give a list of the gentlemen who comprised the party. It is as follows: Earl of Rosse, Sir Richard Temple, Major-General Laurie, Dr. Ashe, The Bishop of Ontario, Prof. J. P. Sheldon, Prof. Fream, Prof. B. Dawkins, Dr. Royle, Dr. W. P. Cheadle, Prof. H. Shaw, E. B. Elliott, Miss Winch, C. Calder, W. M. Beauford, A. S. Reid, G. Johnson, V. Kinahan, J. Symes, Professor J. Macoun, M. Rivard, G. Slater, R. C. Pilling, T. Hare, S. Bourne, A. Robertson, R. S. Broker, R. M. Barrington, A. Kinnear, H. M. Muller, E. Frankland, C. C. Prance, W. H. Pallows, M. Blair, A. W. Scott, H. Marsh, S. S. Turner, Prof. Macadam, G. Chatterton, G. P. Hughes, Miss Stalker, H. T. Menwell, A. W. Bennett, J. A. W. Oliver, W. A. Blackhouse, C. C. Leach, R. C. Brown, J. Cameron, C. Swanford, M. C. Clark, W. J. Dollas, Rev. H. H. Winwood, J. Robbins, Rev. H. A. Pickard, E. F. King, D. A. Louis, W. H. Leach, J. H. Handle, Rev. H. Swanzy, F. H. Stockwell, Dr McNab, Edgbert de Hamel, J. Burdus, R. A. Robinson, H. Bowerman, H. Dubois, W. Hurst, A. D. Ottwell, S. E. Dobson, S. W. Blowman, J. Frewson, C. Lawrie, T. H. Thomas, W. H. Merritt, J. F. Taylor, C. H. Kelmand, S. McIntyre, A. Desjardines, G. B. Longstaff, W. H. Leach, W. Unwin, W. S. Fellow, E. Withers, S. F. Harmer, Mrs. M'Ilrie, F. W. Harmer, C. A. Hirshfelder, Dr. A. C. Maybury, O. Jones, M. Brown, E. Farnsworth, T. W. Newman, A. Traile, W. Brownhard, W. Topley, J. D.\nCrawford, J. W. Leahy, B. Williamson, W. Whitaker, Rev. Canon Ellegood, E. W. Jollas, R. Hazzard, W. Anderson, Mrs. Anderson, George and Jasper Anderson, Grace and William Anderson, F. Fargeau, F. Cummings, M. Argue, C. M. Pittman, A. Tate, Rev. H. Jones, Mr. Alexander Begg, General Immigration Agent for the Canadian Pacific Railway at London, England, was also with the party, his object being to traverse the country and familiarize himself with its resources and most advantageous points, in order to possess himself of that information, which it is so essential for a gentlemen occupying so important a position, to secure. Mr. Begg's office is No. 88 Cannon Street, London, where he can be seen or reached by communication. He is always ready to give any information in his possession regarding the country, as he is always possessed of the latest information in reference thereto. It might be mentioned that besides the scientists, Dr. Thorburn and Miss Thorburn, of Toronto, also participated in the trip.\n\nThe train left Winnipeg at five o'clock in the morning and breakfast was secured at Carberry, a town one hundred miles west.\n\nAT BRANDON\n\nThere was a delay of one hour in order to give the entire party an opportunity of \"doing\" the town. Some of the party gathered wild flowers and botanized, others captured insects in nets which they had brought for the purpose, the majority visited the stores and public buildings, and one gentleman who had a lens with him photographed views of points of interest. When the train was under way again, members of the party were heard to express surprise at the wonderful growth of Brandon, which they were informed only took three years to attain its growth.\n\nBROADVIEW.\n\nBy the time Broadview was reached, which was 3 o'clock, the travelers were very hungry, and it is therefore no wonder that the excellent spread in the Canadian Pacific Railway dining-room was relished by all hands.\nAfter dinner, and while the train was waiting, the party were greatly amused by the presence of a number of Cree Indians who were loitering about the station. An effort was made to purchase ear-rings and rings from the squaws, but they would not sell for any price. The photographer of the party tried to secure a couple of views of the natives, but when they perceived what was intended they retired. After giving the poor Crees a shining coin and a friendly bon jour, the travellers were soon whirling rapidly westward.\n\nON BOARD OF TRAIN WEST OF GLEICHEN,\n\nThursday, September 11.\n\n\"Breakfast can be had at Medicine Hat!\" roared the porter about 6 o'clock this morning. In less than an hour all those on board the train were washed and dressed and eagerly awaiting arrival at the station named. The point was reached about 8 o'clock and a rush was made for a couple of hotels, there being no regular dining-room connected with the station. After breakfast we all started out to visit the camp of a band of Cree Indians, who were located in the valley bordering on the eastern shore of the Saskatchewan. An interesting half hour was spent among the tents of the Indians. The scientists appeared immensely pleased with the natives and readily purchased any little Indian trinket or relic they could secure. The natives were much pleased with the attention shown them and the squaws and children laughed merrily when anything of a ludicrous nature occurred. Very little of interest occurred as the train journeyed westward. Occasionally a Canadian Pacific Railway experimental farm was passed, where evidences of the fertility and productiveness of the land were witnessed. On most of the farms the grain has been harvested, although not placed in stacks yet.\n\nGLEICHEN\n\nWas reached about 2:30 P.M. Here an excellent dinner was served, tender prairie chicken being the chief dish. After dinner half an hour was spent inspecting the experimental farm at this point and visiting a\nnumber of Indian camps. The inmates of the latter excited the curiosity of the visitors, many of whom caressed and even kissed the little papooses, remarking that they had children of their own. The train was soon under way again, heading rapidly for Calgary. Meantime a drizzling rain commenced to fall, and when the train stopped to take water there was not such a general rush out upon the prairie to gather plants and grasses. It was five o'clock when\n\nCALGARY\n\nWas reached. There were quite a large number of citizens upon the platform, notwithstanding the unpropitious state of the weather. It was soon whispered about that an address was to be presented to the association, and soon all hands crowded to the platforms of two adjoining cars to listen to the proceedings.\n\nMr. James Walker, chairman of the Civic Committee, ascended one of the platforms and read the following\n\nADDRESS.\n\nTo the British Association:\n\nThe people of Calgary and vicinity take this opportunity of expressing to the members of the British Association their best wishes upon the occasion of the visit of the main body of the association to this interesting portion of the Dominion. A few weeks ago we had the pleasure of meeting Capt. Pim, who was in charge of the advance guard of the association, and although upon that occasion no formal address was presented to that distinguished gentleman and party, yet an expression of the kindliest feelings both towards himself and the members of the advance guard, as well as the association whom they represented, found voice in a telegram which now forms part of the record of the visit to our district of the distinguished association of which you are members. The citizens of Calgary welcome you on your trip over the great transcontinental road which is soon to connect the surging waves of the Atlantic with the blue waters of the Pacific. It is not for the people of a young frontier town like this to dwell upon the importance which the people of the Dominion of Canada as well as those of the United States attach to the visit of the British Association. It is sufficient for us to remind you that living as we do, in the very foothills of the\ngreat Rockies, in sight of the eternal snows which glisten on those silent peaks, we feel it our pleasing duty to express our inmost appreciation of the objects of your visit to this continent, especially to this portion of it, and we sincerely trust that when you return to the east you will regard with the fondest recollections the occasion of this, your first visit to the great snow-capped rocks which are among the great wonders of our globe. We trust that your trip over our great Canadian highway, which is now being constructed by enterprising capitalists under the protecting care of our Government, will continue to be pleasant and profitable; and wishing you a safe return beyond the seas and many very happy days.\n\nWe remain on behalf of the citizens of Calgary,\n\nYours sincerely,\n\nJames Walker,\nChairman Civic Committee.\nG. C. King,\nGeo. Murdoch,\nA. Henderson.\n\nSir Richard Temple, on behalf of the Association, replied to the address, thanking the citizens for the expressions set forth in the address. After referring to the objects sought by the association in visiting Canada, he referred to what he had seen in this country. They saw a vast prairie being rapidly converted into a paradise. They had seen the golden wheat fields and the busy harvesters at work with the most improved machinery laying it down and preparing it for the thresher. They were much struck with the remarkable progress being made in civilization. They had seen cattle and a great many horses grazing on the land so well adapted for that purpose. Everything they saw filled them with surprise. The majority of the party, eminent and well learned men, who were making observations as they journeyed, and who would not fail to report faithfully on all they had seen and would see. These men, who, he could assure the citizens of Calgary, had been astonished at what they had seen, would not forget to proclaim on their return to England what a grand and glorious country this was. The result would be that an excellent class of people would be induced to come to this country to settle. Besides the remarkable progress in the agricultural line which was being made, the party could not help but marvel at the phenomenal growth of the score or more of towns and cities which had sprung into existence during the past year or two. By no means the least of these\nwas Calgary, the town at which he was privileged to speak, and commanding as it did such a magnificent situation on the Elbow River, and so near the Bow River, its future great progress was beyond ken. (Cheers.) Three cheers were then given for the British Association, which were returned by three rousing cheers from the travellers for the town of Calgary. Amidst the cheering the train moved westward.\n\nTHE BOW RIVER.\n\nAnd now we have entered the Bow River valley, and are heading for the snow-capped hills of the Rockies. The cold, drizzling rain has turned into snow.\n\nImmediately after leaving Calgary we plunge into immense hills of sand and gravel formed by the washings from the mountains during many thousand years.\n\nDuring the first forty miles west of Calgary the track crosses the Bow River in several places. The stream, although comparatively narrow, flows swiftly, its deep blue waters in many places rushing over the jagged rocks of the river bed and forming rapids of considerable dimensions.\n\nThe course pursued by the railway is quite sinuous, winding in and out, and dodging formidable hills very adroitly. Floating down the Bow River considerable rafts of timber were observed at various points. Plateau after plateau was passed, each succession increasing the grade. Many of these plateaus are covered with timber, and would make magnificent parks. The gap of the Kicking Horse Pass had not been reached before night closed in, but as the storm had cleared away the mountains could be observed with tolerable satisfaction. The covering of snow which they had received during the storm set them off to advantage. It was a magnificent sight to see the great piles of rock towering up heavenward. It seemed as if the peaks forced themselves through the clouds, vieing for the highest eminence. The platforms of the cars were crowded by the passengers, all anxious to miss none of the sights. Soon the darkness was complete, and the passengers retired to the cars, where they remained until Canmore was reached. Here an excellent supper was secured. Half an hour later the train was moving on, and The party were tucked up in their berths.\nON BOARD THE TRAIN AT LAGGAN, NEAR THE SUMMIT,\n\nFriday, Sept. 13.\n\nThe train arrived here at four o'clock this morning, but we were not aroused for breakfast before six o'clock. A very fair meal was secured in the Grand Central Hotel, a place composed of canvass and basting, besides a tolerably sized dining room, a good sized tap-room, which possesses a pool and a billiard table. After breakfast and two hours delay, the party again boarded the train, which swept on up the pass. Mountain after mountain, the peaks covered with snow, was passed. A heavy fog had prevailed since the previous night, and although the sun seemed struggling to reveal himself, there was great doubt whether or not he would succeed. Gradually, however, he assumed the mastery, and the thick clouds of condensed vapor which were clinging about the mountains began to disappear. It took but a few minutes for the train to reach the summit. Here was observed the change occasioned by the height of land. The turbulent waters of the Bow appeared in an instant to change their course and run west instead of east. \"We are now in British Columbia,\" observed Mr. Egan, who was a regular encyclopaedia to the party. The train swept on about twelve miles farther and drew up at the Canadian Pacific Railway sawmill, where all the timber necessary for construction is manufactured and where the supplies for the workmen are kept. As it was not deemed wise to run the sleepers down farther, and as no arrangements had been made for the transportation of the party to the end of the track, they all started walking westward along the line, intending if possible to reach the end and witness construction operations.\n\nScattered along the line over about eight miles of track, could be found groups of the party, all admiring some magnificent view, which presented itself. The English vocabulary does not afford sufficient scope to describe the beauty and grandeur of the mountains. Nestling in some gigantic crevice near the top of the more stupendous hills could be seen the colossal and eternal glaciers ready to descend in the night and crush everything encountered in the fall. Here and there down the side of some mountain could be seen the track of a glacier which in its descent had not stopped to ask questions about the right of way, but had adopted an air-line course and swept all before it as clean as if the destroying angel had unsheathed his mighty sword and hewn all vegetation close to the earth. The glittering rays of the sun\nas it struck the snow peaks added glory to the scene already superbly grand. The peaks do not appear distant as one surveys them, but upon questioning about the matter, it was stated by those who know that the nearest could not possibly be less than three miles away. The stream which flows down the valley through which the road is built, although narrow and composed of a small body of water, is very turbulent. It rushes along with lightning speed, dashing down steep inclines, tumbling over precipices, gliding down shady valleys, and anon is lost in some glade obscured by the thick growth of fir and spruce. There is an abundance of excellent timber on either side of the track, and very easy to be obtained. This is fortunate, as an immense amount of timber is required in the construction of trestle work and bridges.\n\nOn the Train between Langevin and Medicine Hat,\n\nSaturday, Sept. 13.\n\nIt was about four o'clock this morning when the train started from Laggan, returning from the mountains. Although everyone had orders to be up at that hour to view the scenery during the descent, it is safe to say that not eight out of the entire party bestirred themselves at the hour named. When we were all astir we found the scenery very fine, and we were told that the best had been passed. The atmosphere was exceedingly frosty, and there appeared upon the pools of water passed a thin sheeting of ice. At Calgary it was thought a war-dance would be given by the Indians, but some hitch in the arrangements had occurred, and although the party waited nearly an hour, the redskins did not appear, and so the train had to move on. A telegram was sent ahead to Gleichen to arrange for a pow-wow. The train arrived at that point about noon. Here Crowfoot, the great Indian chieftain, was found. When it became known that such a distinguished warrior was on the platform, there was a general rush to see him. Everyone shook hands with him, and all who could afford it purchased some trinket from him as a memento. One gentleman purchased his tobacco pouch, a long buckskin article, for three dollars, a lady bought his necklace for one dollar, a gentleman bought his wig for two dollars, a lady bought his ear-rings for three dollars, another gentleman secured his moccasins (leaving the chief in his sock feet) for $1.75, a man cut off a lock of his hair, a photographer took his photograph, and a reporter...\ntried to buy his shirt. The latter garment His Highness refused to sell. Presently a large company of Indians were observed galloping across the prairie towards the town. When they arrived they were formed in line and reviewed by Crowfoot, who addressed them. They had not brought their instruments with which to give the pow-wow, and for their negligence Crowfoot administered a severe rebuke. After the photographer had taken a picture of the group on horseback the engine whistled, and in a few minutes the train was pursuing its way eastward.\n\nTHE GAS WELL.\n\nA halt was made at Langevin station, to give the travellers an opportunity of viewing the gas well there, which was struck at a depth of 1,165 feet while boring for water. The gas, which was blazing away, was pronounced by experts to be of a very good character. It was thought that it arose from a long time buried marsh.\n\nSASKATCHEWAN COAL.\n\nThe next halt was made at the switch which leads to the Saskatchewan coal mine. A carload of coal was standing upon the track close by. The coal was inspected closely by the experts of the party, who pronounced it very good. They all agreed that it was not fair to call it lignite, as it was much better than that. They carried samples away with them, intending to analyze it when opportunity affords. Medicine Hat was reached about nightfall, where a glorious sunset was witnessed. Here an excellent supper was secured, after which the train was soon under way again, and steaming rapidly eastward in the darkness.\n\nDR. CHEADLE.\n\nThe result of an interview with this well-known gentleman will be found of sufficient interest to publish. It will be remembered that Dr. Cheadle, in company with Viscount Milton, crossed this continent in 1862. The account of their trip and the observations they were enabled to make are contained in a work entitled \"The Northwest Passage by Land.\" The doctor is a fine-looking and genial Englishman of striking appearance. He appears to be the soul of good nature, and is always found in a happy mood and with a perpetual smile on his face. Replying to a question as to what induced him to make the trip in 1862, Dr. Cheadle said he came out more for his own amusement than anything\nelse. They came via Detroit, Chicago and Milwaukee. The railway did not go beyond the last point then, so that they were obliged to go by water to St. Paul. They travelled from St. Paul to Georgetown by stage, from which point they travelled in a canoe to Winnipeg. They took a Red River cart and journeyed on to Edmonton, living mainly on pemican during the trip. They wintered at Carlton, and in the spring proceeded across the mountains, taking the Yellowhead Pass. They travelled on pack-horses. They left Edmonton on the first of July and reached Kamloops in British Columbia about the first of September. So dense was the forest that they had to cut their way through with axes. For weeks at a time they were not able to make more than two or three miles a day, and very often they could only accomplish but one mile a day. Along the prairie before entering the mountains they killed many buffalo, which were very numerous at that time.\n\nOn board Train at Broadview,\nSunday, September 4th.\n\nThe train reached Moose Jaw about seven o'clock this morning, before any of the Moosejawians were astir. A very fair breakfast was secured, and time was allowed to take a stroll about the town. Moose Jaw seems to be one of those prairie towns which are making progress. Evidences of activity can be seen as one strolls about the place. After a run of an hour and a half or two hours from Moose Jaw, Regina, or the police barracks, which are two miles west of the place, was reached. Here a guard of Mounted Police was waiting to receive the party and escort the members to the barracks. As it had been announced that service would be held in the chapel for the benefit of the party, all on board readily crossed the prairie to the barracks. Colonel Irvine, with a carriage, escorted Sir Richard Temple and one or two other members to the barracks. One of the large mess rooms was extemporized for a chapel, and in a few minutes we were all gathered in the apartment worshiping Him whose marvellous works we had so recently had an opportunity of admiring. A pleased expression overspread the faces of the travellers as they heard the familiar words:\n\n\"All people that on earth do dwell,\"\n\nAnd heard the well-known tune \"Old Hundred,\" played on the organ. His Lordship the Bishop of Ontario, read the prayers; Rev. Canon\nElegood read the hymns, and Sir Richard Temple read the lesson. The last hymn,\n\n\"Nearer my God to Thee,\"\n\nwas sung lustily, all following the lead of an excellent choir, composed of Mounted Police, and assisted by a piano. At the close of the prayer, Rev. H. Jones, a member of the party, addressed a few practical remarks to the company. Service over, Colonel Irvine escorted the company about the barracks, calling attention to all the points of interest. The whistle of the engine warned us that we must make haste back, and in a few minutes we were on board the train again and whirling eastward.\n\nTHE BELL FARM.\n\nWord had been sent on to Indian Head that the train would stop there in order to give the party an opportunity of viewing the Bell Farm. It was about one o'clock when the train reached the station. Here about fifteen spring wagons and carriages were in waiting to convey us to the village and about the farm. At the hotel a capital free lunch was spread for those who wished to partake of it. The main body proceeded to the residence of Major Bell, the popular manager of the farm. Here we were received in the spacious parlor of the comfortable homestead by Mrs. Bell, the winning hostess of the establishment. After some social chat, we were invited to the dining room, where a spread that would do credit to a palace was in waiting. Numerous delicacies of the choicest character filled the table, together with viands of a more substantial nature. The choicest wines and some excellent Bass' ale were also upon the table. It is needless to say that the latter was readily absorbed by the scientists, some of whom have been regretting the loss of their ale for the last few days. After lunch and kindest regards to the hostess, we visited the stables connected with the establishment, and after viewing the internal arrangements, we all re-entered the wagons again, and following the carriage of Major Bell, which contained besides the Major, Sir Richard Temple and Professors Fream and Sheldon, of agriculture, proceeded to drive about the colossal farm. The following figures are given in relation to the farm: It consists of 64,000 acres of probably as excellent land as can be found in the Territory. Of this, 7,000 acres are under cultivation, 5,000 growing wheat this summer and other 2,000 being sown with oats. This amount of cultivated land makes an area ten miles square. Besides this, 5,000 more\nacres have been broken within the past year. When this is backset next summer and seeded down there will be 12,000 acres under crop. We drove along good roads between fields of wheat which extended in many instances farther than the eye could reach. Samples of grain were procured by all those interested in agriculture. We reached the station about four o'clock, and before embarking Sir Richard Temple publicly thanked Major Bell for his kind hospitality and attention shown the party during the visit to the farm. He called for three cheers for the Major and Mrs. Bell, which were given in a rousing manner. In a few minutes, after much handshaking, the party was again aboard and hurrying eastward at a rapid rate.\n\nFor the better information of those in England who like to ascertain all the facts they can in connection with such an enterprise as the Bell farm, the following article from the pen of a well-known English agriculturist who has been travelling over this country in the interests of the British Government for the past two summers is given. The gentleman is Professor Tanner of the Institute of Agriculture in England. Following is his article:\n\n\"I have now to report upon a colonization scheme in which the work is being carried out by a company having the command of a large capital. The general scheme is to bring the land into cultivation, dividing it into 300 farms, each having a comfortable residence with stabling and shedding enough for the stock. When this has been accomplished these farms, with the stock and implements upon each, will be fairly valued, and the men who helped to carry out the improvements will each have the offer of his own farm at the valuation price, he paying for the same in five or ten annual instalments as may be arranged. In the meantime each man receives wages to the rate of £84 a year, and he has his house and one acre of garden rent free. This scheme is being carried out upon the Bell farm, in the Qu'Appelle Valley, in the Province of Assiniboia, under the direction of Major Bell, the originator of the system. The size of the farm is 64,000 acres, or 100 square miles. There is consequently a magnitude about the work which it is difficult to realize, but as we learn what has been done we become better prepared to accept the anticipations of the future.\n\nIn May of last year this tract of open prairie land was more than 200 miles from any railway station. The ploughs commenced breaking the turf on the 15th of June, and the buildings were started on the 13th of August. When I visited this farm at the commencement of September in this year, no less than forty homesteads had been built, over 7,000 acres were under the plough, and of this quantity 3,000 acres had produced excellent crops of wheat, yielding an estimated produce of\n90,000 bushels of very superior corn. A main line of railway was running through the centre of the farm, and a town of considerable importance has been built near the railway station. If in May, 1882, any one had said that these results would be secured within sixteen months from that date, very few would have accepted his remarks as very probable. Proceeding then from what has been accomplished, I may now draw attention to what has been arranged for, and for these details I have to thank Major Bell, who has kindly expressed a doubt whether they will be accepted, except by those who have visited the scene of operations and informed themselves as to its capabilities:\n\n| Acres under corn | Horses on the farm | Estimate of corn produced |\n|------------------|--------------------|--------------------------|\n| August           |                    |                          |\n| 1883             | 3,000              | 103                      | 90,000                     |\n| 1884             | 9,000              | 200                      | 180,000                    |\n| 1885             | 18,000             | 300                      | 360,000                    |\n| 1886             | 25,000             | 350                      | 500,000                    |\n\nThese figures are undoubtedly astounding, but they are entitled to the highest respect. To watch twenty-one of Deerings' self-binding reapers, each drawn by three horses, and working away at a 700 acre field of wheat, is a sight which will not be soon forgotten by those who witnessed it this harvest, but it certainly prepares the mind for dealing with large results. Nor was it less surprising to learn how very simple the preparation of the land had been for producing such a crop. The 3,000 acres of turf had been simply ploughed over about three inches deep, in the previous summer, and it had remained untouched until the spring, when the ground was seeded by twenty broad-cast sowing machines, each drawn by one horse, followed forty-six sets of spring-tooth harrows, each drawn by two horses. The costs of cultivation were therefore excessively moderate. The quality of the wheat, however, is remarkably good, for it is ranked in the highest grade for the production of the much prized Minneapolis flour. The soil of this farm is a rich, deep, black loam, resting on a clay sub-soil. It is not Major Bell's intention to grow wheat continuously, but he proposes to give the land a summer fallow every third year, and thus, whilst the land will be kept clean, it will probably produce as much wheat as if it had been under corn year after year. Under this system he is able to increase the size of each farm from the usual quantity of 160 acres (one-fourth of a square mile) to 213 acres.\n\nWell may Canada be proud of having the largest farm in the world, but she may be much more gratified to know that this farm is also remarkable for producing an enormous yield of wheat, at the smallest known cost, and of the highest quality; at the same time as a colonization scheme it will be very largely profitable to her capitalists, and will settle 300 farms under conditions which will secure their future success. The Qu'Appelle valley has been generally recognized as one of the\nchoicest portions of the fertile Northwest, and in a few years we shall doubtless find that popular judgment very fully justified, by a large number of luxuriant and profitable farms which are being established within its boundaries.\"\n\nAT PORTAGE LA PRAIRIE.\n\nIt was about seven o'clock on the morning of Monday, the 15th, when the train reached Portage la Prairie, a town of considerable importance on the line of the Canadian Pacific Railway, sixty miles west of Winnipeg. Carriages were in waiting at the station, and the party was conveyed to different hotels, where breakfast was provided. Upon returning to the station the company assembled in the waiting room there, where the following\n\nADDRESS WAS PRESENTED:\n\nTo Sir Richard Temple, President of the British Association.\n\nThe people of Portage la Prairie tender you and the members of your scientific body a hearty welcome on this your first visit to our country. Individual members of your association have within the last month visited our town and surrounding country, which has been a great source of pleasure to us. They have, invariably expressed themselves as greatly pleased with the present prospects and future greatness of this locality.\n\nHere, we cannot show you the great, grand and picturesque scenery that you lately have had the pleasure of viewing in the mountainous district of these vast possessions of Her most gracious Majesty. Nevertheless, though here the grand scenery is absent, yet we wish to impress on you the fact that you are now in the garden of the Dominion of Canada, you are now in that part of the Dominion that, when once placed under proper cultivation, and in a few years when the Hudson's Bay railway is constructed and in operation, will supply the over-populous and manufacturing districts of Great Britain with the necessaries as well as the luxuries of life.\n\nWe sincerely regret that you have not the time to see our fields of golden grain, to examine the fertility of our soil and be convinced that the Portage district is destined to be the bread producing field for millions of our fellow countrymen in the dear old Fatherland as well as the happy homes of thousands of the same race.\n\nWe trust that your scientific body will be greatly benefitted from your visit to our country. We feel that you must be amazed at the rapid construction of that gigantic undertaking, the Canadian Pacific Railway, that transcontinental highway, the iron band which in the bonds of love binds our various provinces together, and also, that this country be benefitted by your visit.\nIn conclusion, we wish you a safe and happy journey across the seas to your homes in the free and happy land of our most Gracious and beloved Queen.\n\nSir Richard Temple was the first to respond. He said: Mr. Mayor and Gentlemen, I am sure that all the gentlemen present, members of the British Association, have listened with the greatest satisfaction to the address just read. We cannot help but admire your fields which are bright with the golden harvest. As we passed through here, about a week ago, we had an opportunity of taking a bird's-eye view of your golden fields. As to the fertility of your soil there can be no two opinions about it, as we had an opportunity of judging it as we passed along your streets this morning (laughter). Some of us had the advantage of driving about your town. You are only about three or four years old, and yet you have churches, schools, banks, fire-stations and other public buildings; you have shops of all kinds, and you now possess a paraphernalia of civilization. You have magnificent agricultural machinery. We observed it scattered about your streets with all the names—mowers, binders, horse-rakes, etc., etc. Upon all these tangible evidences of progress we heartily congratulate you. We are glad to observe that a commencement has been made in Horticulture and Arboriculture; you cannot make any mistake in pursuing these two branches, as they will prove of great ultimate benefit to you. We have seen Calgary, Moose Jaw, Regina, Qu'Appelle, Brandon and now Portage la Prairie, and although we have greatly admired the progress of all these towns, we think Portage la Prairie has the advantage and must have a great future, as it is nearer the centre of civilization than any of the places named. What you want is branch lines, as highways, to bear away your produce. (Applause).\n\nMr. S. Bourne, of Surrey, and a member of the British Association, was the next speaker. He said: It has given me peculiar pleasure to be afforded an opportunity of visiting this country and judging for myself of its great resources. For years past it has been my intention to come. I have often realized and pointed out the necessity under which the old country was placed, of disposing of her superabundance of population; and where could she send them where they would succeed better, than to this country (hear, hear). From the time the railway was commenced I have been anxious to see this country and to traverse it\nfrom its eastern to its western limits. You have done great things in Canada, but you were British and we expected great things from you. (Hear, hear). We congratulate you upon the success which has resulted from your enterprise and energy, but it is only the commencement. When I look upon the vast extent of your country and the excellence of the crops which are produced from it, and think of the thousands who are sacrificing themselves in our own country at home, because of the overcrowded state of the cities and towns, I cannot but feel sorry that such should be the case, and resolve that my influence shall be used in the direction of sending our people to a land where plenty reigns. You are bound to have a great future, because you raise such an excellent grade of wheat and so much of it. Then, you have the advantage of living under the protection of the British flag. Let me say that we shall go to our homes with a sense of the warmest gratitude for the hospitable manner in which we have been received and treated wherever we went in your domains. We shall think of you when we return to our own home, where we are surrounded by all the comforts of life. I believe that through these colonies the old country will be renewed. Let me say, that as an ardent advocate of temperance, I have been able to traverse these lands from end to end without seeing the evidence of intoxicating liquors. For this we will carry back a feeling of thankfulness. (Applause)\n\nProf. Boyd Dawkins spoke next. He said: I feel that I should not delay you by congratulating you upon the points already spoken of. There is one thing I wish to speak of, and it is the view we ought all to take: the Englishman is an Englishman, not because he was born in England, but because he is an Englishman by blood or training. There are three classes into which the Englishmen might be divided. The first is the English of the past; then there is another class which we call the English par excellence at the present time; and there is the new English represented in this country. An Englishman is none the less an Englishman because he may happen to be born here. It is not a political bond which unites us, it is the bond of race. I feel that in coming to Canada we are visiting friends and kinsmen, and I feel consequently quite at home in this vast region. I believe the great English-speaking race is destined to cover the whole world. (Applause.)\n\nMr. Shaw, a distinguished civil engineer and a member of the asso-\nciation, was next introduced. He said: We have heard remarks about this wonderful railway and the means of locomotion. What has struck me more than this is the genius displayed in the invention of implements adapted to the cultivation of your land, and as labor saving machines. I have been able to examine the way in which you have used materials in the marvellous construction of machines adapted to the soil. Your implements are not surpassed in any country in the world. I heartily congratulate you, gentlemen, on developing your resources by means of such excellent machinery. By this means alone you could have developed this vast country, and it is by this means only that you can turn this land into one peopled with the right kind of population. I also have been able to observe that this land is blessed with an independent and enlightened press. I heartily congratulate you upon what you have attained. There is every prospect that you will be one of the first agricultural countries in the world. You have besides your agricultural advantages, probably the richest mineral country in the world. Besides possessing in the bowels of the earth a store of coal sufficient to supply the country, while it exists, this country is one of the greatest centres of mechanical civilization. (Cheers.)\n\nProf. Sheldon, a distinguished agriculturist being introduced said: I have been struck as we passed along the line of railway with the richness of the soil, the character of the country and the facility with which it can be drained. You possess within your borders every facility for producing the necessaries of life, and you have here fields of sufficient extent and fertility to produce food for the whole world. From what I have seen of this district in days gone by, I think you have about here one of the richest portions in the whole of the Northwest. Winnipeg of course is destined to be, as it now is, the most important city in the Northwest, but you may reasonably expect to be the second place of importance. We all feel as if we were one family although we are separated by 3,000 miles of water. I am sure, sir, that you look upon the Old Country with very great pride. She is the mother of us all and the wonderful mother of nations. She is the mother of the United States, a nation rapidly assuming such an important place in the world, and a nation bound to be one of the most important if not the most important in the world. (Applause.)\nThe Bishop of Ontario made a few remarks. As a Canadian member of the association and as a Canadian of 35 years' experience, he had no hesitation in saying that in his opinion notwithstanding all that had been said about the country, the half had not been told. He had been able to witness the marvellous resources of the country. It was himself that influenced the Canadian Government, and the C. P. R. to extend the courtesies they did to the association.\n\nPRESENTATION.\n\nWhen the train arrived in Winnipeg, the members of the association presented Superintendent Egan with an address expressive of gratitude for the courtesy he displayed to them during the trip. It was also intimated to Mr. Egan that a gold watch would be forwarded to him from England as a more tangible recognition of his good services. Mr. Egan replied suitably.\n\nLUNCH AND SPEECHES.\n\nAfter a few hours spent in visiting the points of interest in the capital, and inspecting the Historical exhibition prepared by the Historical and Scientific Society of Winnipeg, the members of the association returned to the C. P. R. station and sat down to lunch in the magnificent dining room connected therewith. The repast was provided by the city of Winnipeg. Many distinguished Canadian statesmen were present, in addition to the members of the British Association. Hon. Mr. Aikins, Lieutenant-Governor of Manitoba, occupied the chair. Lunch concluded, and the national toasts disposed of, the health of \"Our Guests\" was drunk with enthusiasm.\n\nSIR RICHARD TEMPLE.\n\nSir Richard Temple, in acknowledgment, said: My Lord, ladies and gentlemen, I have obtained from His Honor the Lieutenant-Governor an injunction to the effect that I am to be excused from making a speech on this occasion, because the fact is I am held in reserve for a meeting in the Opera House this evening, which I shall have to address at length. While my friends and colleagues are whirling through the forest in order to catch the train for Toronto, I shall be in all the agonies of rhetoric (laughter), therefore, as I have got to run a\nrace of oratory this evening, I am to be let off at a sort of feeble preliminary canter now (laughter.) But what is far better for you, you will be addressed by some of the most eminent among my colleagues. In the first place I hope that Dr. Cheadle will represent history and will tell you a few words regarding the wonderful contrast between the past and the present of the Northwest. You will also be addressed briefly by Professor Sheldon, who is an eminent authority on agriculture and will explain to you something of the mighty agriculture resources with which Providence has enriched this land. Then a few words will be spoken to you by Mr. Topley, of the Geological Survey of England, and he will say something respecting those coal resources of which we saw something and of which we might have seen much more. Lastly you will be addressed briefly by Professor Boyd Dawkins, of Owens College, Manchester, who will say something as to the illimitable resources with which nature has endowed you both on the surface of and beneath the earth. But although our speeches may relate to diverse subjects, we shall yet all breathe one common aspiration for the future of the Northwest. We shall all reciprocate the most kind sentiments which have been expressed by his Honor the Lieutenant-Governor and we shall all be animated by the same thankfulness for the kindness and hospitality which we have received throughout Canada from the mouth of the St. Lawrence to the summit of the Rocky Mountains, which kindness and hospitality will I have no doubt attain its culminating point in the capital city of Winnipeg (applause). I trust that on behalf of the host I may be allowed to call upon\n\nDR. CHEADLE.\n\nDr. Cheadle—When I visited this country before, it exercised upon me such a remarkable fascination that my great wish and longing was to come to it again. That vision and hope of the future was postponed year after year by the pressure of professional work and other engagements. Now, at last my dream has been realized and I visit these shores once more, thanks to the opportunity afforded me by the meeting of the British Association. (Hear, hear.) Now, gentlemen, it is hard for you to understand the little knowledge there was of this country twenty years ago, and not only that, but the mistaken impression which prevailed with regard to it; the impression that the country\nwas a desolate region bound up by frost, an inhospitable country which scarcely grew anything fit for the use of man except the fur-bearing animals. And if you understood this you would, I think, value still more the visit of this association, because it will pour upon our country a flood of evidence which will I have no doubt absolutely convince the people of England of the extreme value of this great region. Well, I came here with that idea impressed upon me, but a little experience and observation of the country very soon rectified my mistake. In the Red River settlement, as Winnipeg was then called, I found wheat growing yielding enormously, 20, 30, 40 and 50 bushels to the acre, and in some places I was informed cropped ten years in succession and yielding the last year almost as abundantly as the first. Then passing on I found the resources were stored along the Saskatchewan. I found the district almost unequalled for pastures where cattle not only wintered out, but grew fat. When I went there, I took horses from here, and travelling day by day, arrived at Fort Galton just at the beginning of winter, the horses being in a state of exhaustion and even emaciation with hard work. We turned them out in the most inhospitable fashion just as the snow began to fall. We did nothing for them, save to watch their course and keep mark of them. In the spring they came out very different objects to what they were when we turned them out, fat, and fit for the journey across the mountains. Then going further still we came upon evidence of valuable mineral resources, coal fields jutting out for hundreds of miles on the Red River, and since have been discovered on the Souris River, and further still we came upon the mineral resources of the Rocky Mountains, gold, silver, and iron resources not yet fully developed, but which will be, no doubt, when this Canadian Pacific Railway is further extended to the heart of that region. This great country when taken as a whole, seemed to possess resources of every kind in itself. The only want one could see was the want of outlet; for the only means of entrance to the country was through the United States by way of the Red River valley. Now, thanks to the enterprise of the Canadian Government and the Canadian Pacific Railway, free exit for all your produce will be provided, which will carry it straight to the Atlantic Coast, where it may be shipped to any market you wish. (Applause.) There is one point to which I should like to call your attention, because I fear some of our members may go away with a somewhat mistaken impression of the country altogether. They have\nseen only the magnificent prairie region which sketches by way of Portage la Prairie, Brandon, Medicine Hat, and Calgary, to the Rocky Mountains. But there is another district which differs a little in character from others, and I am sorry it has not been possible to show my companions through the whole country. I mean the country of the Saskatchewan. That is a country of hills and valleys, of lakes and streams and woods, and there is a great forest stretching away to the north, to the Arctic circle, I believe. Perhaps this can be hardly realized by those making this excursion across the great plains. The Canadian Government or the people of Manitoba appear to be behaving like the boy at school and keeping the plum to the last. The Saskatchewan is the plum of the whole. (Hear.) I believe a railway is already projected, in fact partly carried out, which will give access to that beautiful and fertile region. There is one other point. You have seen in the Rocky Mountains some magnificent scenery, and yet the district has been imperfectly explored. I have seen it north and south on the present occasion from the Kicking Horse Pass. But although we have seen all the glories of the great Range rising from the plain we know little or nothing of the beauties which lie hidden in the recesses of the mountains. Plateaus, glaciers and upland valleys and lakes probably lie hidden there; and there is in the district a splendid health-recruiting ground which will rival Switzerland. And I can anticipate the time, perhaps, if I should ever come to this country again, and I hope I may, it may be on my third visit, I shall find the citizens of the great city of Winnipeg and probably from all parts of Canada, spending in the recesses of those mountains their time of leisure, and dissipating there, probably, pleasantly enough, some of the wealth which will no doubt accrue to them with extraordinary rapidity. Tha happy time I hope to see, and my desire to return again will be upon me as strong as ever.\n\nOne remarkable point of difference between my former and present visit, and which was brought before me with great force, is the difference in the commissariat. (Laughter.) When I was here before it was with difficulty we maintained the struggle for life, by providing with great labor the means for subsistence in the form of food. This time, on the contrary, our great struggle has been rather to avoid taking too much. (Laughter and applause.) It seemed to me that the further we advanced from sunlight, almost the greater has been the luxury with which we have\nbeen surrounded. (Hear.) We found even in the heart of the mountains, food which would have whetted our appetites even if we had not been in such favorable conditions for their development. (Hear, hear.) I can only, in conclusion, quote the cordial words which have proceeded from Sir Richard as to our reception. It has been hospitable, generous, liberal, beyond expectation and belief. (Applause.) This great excursion to the Rocky Mountains is beyond anything which has ever before been dreamed of; entertainment on the most gigantic scale and of the most enjoyable character. I think we have all enjoyed it thoroughly and shall bear away with us the most pleasant recollections. And should any of you think it good to return our visit in the Old Country we shall welcome you heartily. (Applause.)\n\nPROFESSOR SHELDON,\n\nAn eminent agriculturist, said: It may be possible I shall utter some remarks this afternoon in which the bulk of the members of the British Association will not find much warm sympathy on the question of Agriculture, which is hardly understood very extensively by many. But I think I may make one remark in which all will sympathize, and that is: we have had, thanks to the Canadian Pacific Railway Company, a magnificent journey. (Applause.) I may say, sir, that although this is my fourth visit to Canada, that I have enjoyed it much more than any previous one. So much hospitality and kindness have I received from Canadians in all the Provinces that the very name will be dear to my heart hereafter. (Hear, hear.) It has fallen to my lot, some years ago, to speak publicly of the resources of Canada, in the course of a pamphlet I wrote for the Canadian Government, and that pamphlet was circulated very extensively in England. So that in all probability I am responsible to some extent for much of the population you find in this country now. In the town close to my home, Buxton, in Derbyshire, a name familiar to many of you, especially you who came from the old country, no fewer than sixty came out in consequence of the pamphlet, and the number from all England will be very large indeed. At the same time, I am confident of this, that however many have come out influenced more or less by my recommendations of this country, that all who were in distress, as families not infrequently are at home, have found they have done a good thing in leaving England, which is so full of people, for this magnificent country where there is room for everybody. I\nmay, sir, congratulate not only Canada but the Government of Canada especially, and also the syndicate of the Canadian Pacific Railway, on their magnificent highway through this vast country. They have now—the Government, I presume, standing responsible to a great extent for the construction of the line—the Government and the people have constructed the longest railway line in the world. (Applause.) Now the land you have in this Northwest Territory, vast and fertile, as no doubt much of it is, would have been of no practical good whatever but for the opening up of this railway. I may remark inter alia, that the Canadian Pacific Company have set you Winnipeg people a good example in making a grand highway through this country, which you might worthily follow through your beautiful town. (Hear and laughter.) The weather—very unfavorable to-day, which we all regret—has caused many to feel considerable trepidation in traversing your streets. One of the members of the association came, very much to his disgust and very unintentionally on his part, into a very undignified position on the pavement. I hope, sir, the example set by the Government will be followed by the people of Winnipeg, and the next time we visit the city we shall be able to walk about the streets without danger of breaking our necks. (Hear.) You will expect me to say a little about what I conceive to be the agricultural possibilities and prospects of this vast continent, or at least, the Canadian part of it. I have been delighted with the views we obtained of the beautiful rolling land you have in the foothills of the Rocky Mountains, land covered with a natural herbage far superior to anything I have ever seen in any country before. I did not think it possible indeed that such herbage could be grown in a purely natural manner as that which I saw growing, although of course I could not examine it in the foothills of the Rockies. It seems well adapted for ranching purposes and is being so adopted. The land is also rolling, with hills here and there, giving much natural shelter, so that cattle in ordinary winters will be able to live out there without artificial shelter. But it seems to me, and I have been led to understand from those practically experienced in these things, that it is advisable, in your Northwest Territory, not to trust entirely to Providence with regard to winters, but to provide sufficient artificial shelter and food that when the evening comes you will be prepared to meet him. With regard to the great plain stretching from here to the Rockies, I think I can perceive a great deal of very excellent land which will be magnificent for the raising of wheat, oats, and barley in all probability, and not only so, but of various\nkinds of roots, turnips particularly. Now here you have the first principles necessary to successful agriculture. We saw yesterday—and I am sorry to say it happened to be Sunday—that very extraordinary exhibit of agricultural enterprise at the Bell Farm. I was particularly struck with it, because I had not before seen on this continent or anywhere else, anything so large. I consider, sir, from what opinion I was able to form of the magnificent farm from a cursory view, that it has been conducted on sound commercial principles. At the same time remarks were made to me by Major Bell of a very startling nature in reference to the future of English farms. He said one thing to me which it will be my duty to place before the public. After allowing for eight per cent on capital he will be able to deliver wheat in Liverpool at twenty shillings a quarter, that is at about half the present price of wheat. If that can be done by Major Bell on the farm it can also be done by hundreds of thousands on other farms where the land has been opened up by the railway. I tremble to think of the result of all that on English farmers. Sorely cast down as they have been since 1877, by serious seasons, they will be hopelessly out of the race if the words of Major Bell are realized. It is a matter of the deepest importance to English farmers to consider what shall be done if that dream, if it be only a dream, or that prediction, be realized. Well, sir, you want population in this country; we in England have a great deal too much of it, and many suffer on account of being overcrowded. Of course we have a great many classes that would not suit you. You want agriculturists first of all, for the development of your agriculture is the first thing to which you must turn your attention. It has been, is, and yet will be the glory of the Dominion: therefore the development of your soil, your natural capacities in regard to the growth of wheat and other agricultural products must be the first thing to which you must turn your attention. For that purpose you want here a people who understand something about agriculture and are able to enter on the work which we have seen so successfully started. We cannot spare you many of the best classes of these people, but I feel sure there are numbers of farmers who are struggling in England to make things meet; their position is like that of an old wall that will stand so long as you leave it where it is, but will fall directly you touch it. Such people would, I think, relieve their minds of much crushing and terrible anxiety, if they would give up their farms in England, and give up associations for\nthe time being, and come here, where, as a speaker has stated, every man can eat in peace the food which he produces under his own vine and fig-tree. (Hear, hear.) I believe, sir, that not only will this Dominion be a great wheat-producing country, the great granary, decidedly of Canada and England to a great extent, but I think you may very successfully go in for cattle-raising. Your ranches out in the Northwest when due precaution has been taken to avoid disaster, have turned out successful, and I think that from Winnipeg right to the foothills of the Rockies, your whole prairie is adapted for the raising of cattle. I was informed by a rancher at Calgary that it was in contemplation to start a herd of dairy cows and let them out to dairy-men at so much per head, or for half profits, or such like. Now dairy farmers should go hand in hand with the cattle raisers. An animal should do something more than raise her own offspring. This whole territory, particularly some parts of it where the land is good enough for agriculture, is adapted not only for wheat growing, but for cattle raising. There is one thing against which I should like to warn you Canadians, and that is to be careful not to introduce the various bovine diseases rampant in the United States. It will be a great drawback to your agricultural development if you once admit them. Therefore it behooves you, for your own preservation, to be careful how you admit cattle from their markets at all. If we in England once know that you have disease here amongst your cattle, we must schedule you and not receive your stock alive. I do not know that I can say anything more on this subject particularly, but I may conclude by thanking you most heartily for the kindness received on all hands, and especially thanking the Canadian Pacific Company for the great treat extended to me (applause) and also Mr. Egan for his courtesy and gentlemanly kindness throughout our entire journey. (Applause.) I may say, sir, that whatever may be the future of Canada politically whether she remains attached to the old country (cries of \"She will,\") or whether as an independent land, she chooses to unite her destiny elsewhere, (loud cries of \"No, no,\")—well I am glad to hear that \"No,\" and I am sure that England herself will rejoice to be assured that such an emphatic No exists in the minds of all Canadians,—but whatever may be the political future of Canada, I am sure of this, sir, that your agricultural and commercial future contains elements of very magnificent achievements. (Loud applause.)\nMR. TOPLEY,\n\nof the English Geological Survey: Before proceeding to the special subject which Sir Richard Temple has allotted to me, and which I shall treat very briefly at this late hour, I hope I may be permitted to add my most cordial thanks to those previously expressed by members of the association in acknowledging the most generous hospitality extended to us, not only by the city of Winnipeg, but by Canada generally; and also to the Canadian Pacific Railway Company, which has enabled us to see the country in the very advantageous manner in which we have done. The trip is one which will throughout our lives form a fragrant spot in our recollections. I have been asked to speak upon geology specially. Geology in a certain sense lies at the foundation to a large extent of the material riches and development of a country. The shape of a country depends upon the structure of the country, and that is a geological question entirely. The development of a country depends upon its mineral wealth; the agriculture of a country depends upon its soil, which is entirely due to geological causes. Unfortunately we have gone rapidly through the country and have not investigated with the minuteness which we could wish, all these causes and consequences. But we have seen enough to teach us valuable lessons. Most fortunately we have been accompanied by a most distinguished geologist, Dr. Selwyn, the Director of Canadian Survey. Canada is fortunate in having secured his services, and the issues of its survey take a high rank in geological literature. They are very numerous, and I am afraid are better known out of Canada than within your borders. I can only advise those who are interested in the future development of the country to study your survey report. By the able assistance we have had, we have been able to see much better than we otherwise could have done many of the things which, as geologists, we desired to see. Sir Richard Temple spoke of coal growing in many places along the western line, Of course coal is one of the most important things with which we have to do, and it is fortunate that there are enormous deposits of coal of various qualities cropping up in different places up to the foot of the Rockies and in some of the recesses of the mountains themselves. Theoretically it is important to find out how it differs in different places. To geologists this is particularly interesting; but the point in which Canadians will be most interested is to know that the\ncoal is there. Partly—it is what is called ignite, though it deserves a better name than that, and partly it is anthracite further west. And in all these developments of the country whether concerning coal or other matters, information which geologists can give is very considerable, and it is pleasant to know that investigations are rapidly extending, over the wide area, and we shall soon know much more than we now do. Among other points in which geology can help in the development of Western Canada is the ticklish one of water supply. (Hear, hear.) Unfortunately there are places of the area where water is not so good as it might be. I think false impressions are brought about with regard to this question. The water does not do the harm to cattle that is supposed; still over a large area the water might be better than it is, and I certainly think that by geological investigations we shall learn where to find water and how to find it. The agricultural western district at present depends upon the natural resources of the soil and will for a long time do so. That is a question not touched upon by the geologist, although it cannot have been absent from his mind that the natural resources of the country will have to be augmented as in other countries. I hope this will be a long distant time, but the lesson of Eastern Canada was that it is possible to farm too long a time over any soil without any amelioration. It is fortunate that along this line there is within reach, particularly by the railway, some important mineral wealth which will aid in the improvement of the soil. There are those wonderful deposits of phosphate near Ottawa which are supplied to other parts of the world, but not to the extent which might have been expected of Canada. There is this great resource of mineral wealth which the railway, when completed along the north of Lake Superior, will be able to attract to the Western States. Then there is lime which must in future be used and ought now, I think, to be used on some of those western farms, by which their produce would be enormously increased. Here you have an enormous deposit of lime-stone. Now this is interesting as building stone and I think it will by and bye be used as a road stone. It is deemed interesting now for its fossils, but there is a mine of wealth here for agriculturists which can be carried along west and will be some day extensively used. The United States Consul has alluded in very felicitous terms to the gathering at Montreal. I object to call it International because we come to Canada, but it is international to the large extent to which\nAmericans came. Geology is peculiarly an American science. By that I do not mean that geology is confined to America, but it has been cultivated with enormous success in America. (Hear, hear.) It has added enormously to the interest of our meetings, and one can only be very glad that science is thus a great bond of union among the nations. It transcends all national ties, and one does not think of the national character of the man in accounting the position he shall hold in scientific ranks. (Applause.) To a certain extent literature must be national, and one can only hope that by and bye Canada, when it has time to think of other things besides material wealth, will develop a literature of her own worthy of that which has sprung up in the United States, and worthy of that of which we as Englishmen are so justly proud. (Hear, hear.) Literature may, however, keep for a time, although one must hope that it will come, but the development of science is necessary to the development of a country, and I think that geology in this particular takes no second place. (Applause.)\n\nSIR RICHARD TEMPLE\n\nbriefly proposed the health of the Lieutenant-Governor and his wife, which was heartily drunk and suitably acknowledged.\n\nHON. MR. NORQUAY,\n\nthe Premier of Manitoba, replied. He said: Sir Richard, ladies and gentlemen—It may be considered superfluous on my part to attempt to supplement the hearty welcome extended to the association by his Honor the Lieutenant-Governor, but still I would consider myself lacking in duty did I not on behalf of the people of this Province welcome this large, important and influential association here to the Province of Manitoba. We welcome them also for the purpose of accentuating certain duties upon them when they leave the Province, which duties I think from the tone of their utterances they will cheerfully perform. One is to dispel the erroneous reports and ideas that have been circulated regarding Manitoba and the great Northwest, of which we feel so proud, and justly, too, I believe. (Hear, hear.) We also expect, and in this I think we shall not be disappointed, that a large amount of useful information will be disseminated most cheerfully regarding the resources of this part of the Dominion of Canada. We appreciate fully the responsibility thrown upon our shoulders as Canadian people, of\ndeveloping this portion of Her Majesty's Dominions, and we welcome every source of assistance that comes amongst us. None do we welcome more cheerfully than the British Association, whom we have the honor of entertaining to-day. (Applause.) It is perhaps true that the hospitality we have been able to extend at so short a notice, is not worthy to be presented by the Province to so influential a body, but they \"must on this occasion take the will for the deed. (Hear, hear.) On account of the inclemency of the weather, moreover, we anticipate your visit will not be of so pleasant a character as it might have been. But taking all drawbacks into consideration, we feel satisfied that they have seen in their visit to the Northwest enough to convince them of the magnificent resources yet undeveloped of this portion of the Dominion of Canada. And there is no medium through which or by whom we would better like to be represented to the world than through that association, which has so proud a prefix as its distinguished character. (Applause.) An offshoot of the parent country, our institutions are all of that national character that we cherish so sacredly. Our social and educational institutions have that feature attached to them; and we welcome all and everybody British, especially an association whose main object is the dissemination of useful information. And considering this potential fact, our highest ambition is that our resources should be known, and that our institutions should be understood, and we are not afraid of the result. (Applause.) Without occupying your valuable time any further, I will simply express our hope that their journey will be as successful to the end as it has been to the present time, and that they may never meet with any worse fate than that which the Manitoba people wish them. (Applause.)\n\nSIR RICHARD TEMPLE,\n\nproposing the toast of \"The Canadian Pacific Railway,\" said: Now, my friends, we have so often sung praises to this celebrated company that it would really be gilding the gold to sing those praises again. (Applause.) But I must propose the toast with one word only, and it is this: That it is owing to the Canadian Pacific Railway Company that that momentous and difficult excursion was projected and undertaken, and which you are celebrating at this moment the successful termination.\n\nThe toast was received with reiterated cheering, after which the proceedings were adjourned to the exhibition.\nAT THE EXHIBITION.\n\nOn Monday afternoon at the Historical Exhibition Hall a public reception was given to the members of the British Association. The Lieutenant-Governor and Premier Norquay delivered addresses of welcome. The Mayor and Council through their clerk presented the following\n\nADDRESS TO THE ASSOCIATION:\n\nTo the President and Members of the British Association for the Advancement of Science.\n\nGentlemen,—The progress of science, the genius of inventors, and the enterprise of the age which has linked in bonds of union the old and the new worlds, enables us, citizens of the most northern city of the western hemisphere, to greet you, the representatives and exponents of science in the east, upon the confines of western civilization, so lately reclaimed from wilderness. Nor is it a matter of congratulation only, that rail and steam should render such approximation possible, but we are proud to remind you that our meeting is upon British soil; and although separated from your homes by the width of an ocean and half a continent, that you are welcomed by those who, equally with yourselves, belong to that great nationality upon whose territories the sun never sets, and whose flag floats o'er every sea! In the name of the City of Winnipeg, the capital of the Province of Manitoba, we, its Mayor and corporation, bid you a hearty welcome.\n\nIn your visit we recognize that spirit of enterprise which is instinct in all true scientists, and which leads not only to the progress of civilization, and the march of intellect, but to the union of nations, creating an universal platform of truth, independent of race or creed, and superior to nationalities.\n\nWe greet your coming especially as representatives of every department of science; in the expectation that your practised eyes may see the glorious future that lies before our country; and that by your unbiased testimony the truth may spread, and be the means of bringing hither the overflowing population of the motherland; where, under the British flag and kindred institutions, they may develop and achieve the wealth which is latent in our soil.\n\nWe have watched with great interest the progress of your deliberations at Montreal, and trust that the important labors in which you were there engaged may bear fruit towards the advancement of science. We hope that your brief visit to this city may be attended with profit as well as pleasure, and that in our hastily gathered exhibition you may have a more comprehensive glance at our resources, than your limited time for investigation could otherwise afford.\nIn conclusion we would express the hope that as members of the great British family, we may ever draw nearer together in heart and aspirations, and that our intercourse may lead to the advancement of science, and the promotion of peace, progress and universal happiness.\n\nA. LOGAN, MAYOR,\nFor the Corporation of the City of Winnipeg.\n\nREPLY.\n\nSir Richard Temple said: I have the pleasure and honor to reply on behalf of the British Association for the Advancement of Science to the two most interesting and remarkable speeches which have just been delivered and to the eloquent address which has been read. We congratulate ourselves that we are met in this noble hall which is so abundantly adorned with everything representing the past history, the glorious present, and the prospective future of this city of Winnipeg and this Province of Manitoba. (Applause.) The weather was brilliant in the Rocky Mountains, and we have on the whole during our sojourn in the Northwest been extremely favored in this particular, and although his Honor deigns to regret the existence of mud in this city, let me assure you that it is not astonishing to us who come from England. The only thing is this: The mud of Winnipeg is much lighter for the horses and wheels than the mud of Europe, and without speaking quite seriously, I may remark that it is quite interesting to scientific agriculturists to observe the remarkable ingredients of which the earth is made up here. (Laughter.) It contains great strength, lightness and fertility. It is all very well for you to talk about your soil, but if you knew the heavy clay soil of England, you would understand the superiority of the new country over that of the mother land. Besides that you have a good pavement of wood which is both smooth, strong and finished, and you have good wooden crossings from one side of the street to the other. Then, may I assure you that I and all my colleagues will most conscientiously discharge those duties which appertain to us and which the Lieutenant-Governor so justly reminded us of in his behests, and which we should on our return home most fully obey in making known to our countrymen all the glory and greatness we have seen out here. Gentlemen, I personally am a native of the Midland counties in the neighborhood of Birmingham, and it will be my duty constantly to address large political meetings regarding our colonial and foreign affairs; and I know well I shall be called to a strict account by my political supporters as to\nall I have seen and heard here. And as I most fully endorse all that has been said regarding the resources of the Northwest, you can imagine the account I shall have to give. (Applause.) These resources are illimitably great. They are already developed largely by the hand of man, and are susceptible of an infinite development in the future. We most cordially reciprocate all the kind expressions that have fallen from the Governor, from the Prime Minister, and from the Mayor. We are animated by the most brotherly feelings towards our colonial fellow subjects, and shall endeavor to induce all those who cannot find a living at home, to seek a livelihood in this land of plenty; and let me assure you that neither wet, nor chill, nor cold, nor cloud, nor darkness can dim the brightness of your reception or diminish the warmth of our gratitude. (Applause.)\n\nTHE MAYOR,\n\nas President of the Scientific Society of Manitoba, explained that the hall had been fitted up so as to present in a small compass some of the salient features of our country. In the field of geology we have a considerable collection, possibly the only collection in the Northwest. We have also some ornaments representing the ethnology of the country lying north and west of Lake Superior. They include Indian arms and curiosities, not only of the present race, but also of a former race which inhabited our territory. We have also striking instances of what may be of philological interest to the association; and last but not least we have our agricultural products. We have a number of vegetables, and I am sure that one single cabbage would be sufficient to dine the whole of your association. And they are not particularly striking instances with our country. Many old residents can remember to have seen much larger cabbages than you see here. Our samples of wheat are said to be remarkably good in character, by those killed in these matters, and we want the association to tell what they have seen. (Applause.)\n\nPROFESSOR DAWKINS:\n\nI did not intend to take any very large share in what I believe is only known in this part of the world as a great pow-wow. (Laughter.) But I feel that it is a singular gratification to me to speak a few words in this place in answer to the kind reception which has been given us by the Historical Society and the Scientific Association to which this hall and\nits contents are due. I feel that in expressing our thanks to you, I am but feebly expressing the feelings which animate us all. And I would say that the peculiar advantage of our meeting in this room consists in this fact, that here we have the past, present and future of this country brought forcibly together before our minds. You have here in the trophies on the walls pictures of what this great area was before the great English race in its passage ever pushing westward, flooded over into the valley of the Red River. But that is a condition of things of the past. Looking to those trophies turned from the soil by the plough, there you see the condition of things at the present time. In the collection of fruits and in those gigantic cabbages you have presented agriculturally the enormously important position which this district now holds. But now for the future. It seems to me that just as the bison and the grizzly bear, and the wapati have disappeared before the face of the farmer, so will these great solitudes, if so I may call them, crying out for population, echo with the voices of many thousands of human beings, and these trophies, which I have no doubt are the result of a very small area of cultivation, will be scattered over thousands of square miles. We have heard to-day of the serious effects which will be produced in the mother country by the low price of wheat caused by the teeming fields of this glorious region. Now, I do not think that is a thing to be regretted at all. (Hear, hear.) It seems to me that if the British farmer is to be of any good at all, if he is able to carry out the position which he ought to hold in this universe, if he is unable to procure wheat at the price in the Old Country at which it can be produced in the new, the remedy is before his very face. He must come to that region where the land invites him; and I for one do not see why the British farmer should be exempt from those commercial laws, those laws of supply and demand which are imperative on all other classes of the community. (Applause.) If, therefore, he cannot afford to compete with the great Northwest, with the \"great lone land,\" let him disappear if he cannot come here and better himself. I would only add just one other word. We members of the British Association have tried a great experiment, an experiment which has turned out in the most satisfactory manner possible; and it seems to me that although when we go back we shall speak of this country as we find it, and shall be believed when we say what we shall say, because nobody will think we are land sharks, or men going about trying to sell land at five dollars\nan acre, which cost them only one; besides all that, I mean to say that the educational effect upon ourselves is of the very highest value. [Hear, hear.] We have learned what this country is ourselves, and have seen everywhere that true warmth of feeling which must have made us all realize that whether we were born in England or in Canada, we are going from one cousin's household to another. (Applause.)\n\nSIR RICHARD TEMPLE DELIVERS AN ADDRESS UPON THE COUNTRY.\n\nCitizens of Winnipeg with their proverbial shrewdness are always ready to take advantage of every opportunity which offers itself to advertise the country, and acquaint the world with its vast resources. It is no wonder therefore that when the distinguished scientists returned a reception was proposed, at which the more prominent members of the party were asked to speak, and give the public the advantage of their observations and impressions formed during the trip. The Princess Opera House was secured and upon the night of Tuesday, the 16th of September, Sir Richard Temple delivered the following address to an audience, which for magnitude and enthusiasm has never been excelled in Winnipeg. Upon the platform were Hon. Mr. Norquay, Premier of Manitoba; Hon. J. C. Aikins, Lieutenant-Governor of Manitoba; His Worship Mayor Logan, of Winnipeg; Hon. Mr. Brown, U. S. Consul Taylor and others. Hon. Mr. Norquay, as chairman, introduced Sir Richard Temple, who said:\n\nMr. Chairman, ladies and gentlemen, I am sure a great deal of what I am about to say you are already familiar with, but one finds in travelling over your magnificent country so much to talk about that I almost feel under an obligation to you for affording me this opportunity of relieving myself of the burden of good things I have to say about you. I purpose dividing my lecture into eighteen subjects, which I shall deal with separately. The first I shall speak of is\n\nTHE EXCURSION\n\nof a section of the British Association to the Rocky Mountains. This was one of the longest, if not the longest, excursion ever undertaken, and in that respect was suitable to the land in which it was made. The excursionists were about one hundred in number, and were all men of more than ordinary education. Now that they are no longer present I might say about them what I had not dared to say to their\nfaces, that they are a thoroughly accomplished, learned and scientific body of men. They proceeded most carefully, thoroughly and conscientiously, and saw everything that could possibly be brought within the range of their vision in the most complete manner. Among them were many who carry weight at home, and whose opinions are listened to throughout England. Therefore it can be judged whether it is not a great advantage to this country in the present state of public opinion to have such a cloud of witnesses now returning to England—men who have faith in the Northwest of Canada, and who will give before all England a scientific reason for the faith that is in them. I know their reports will be favorable in the extreme. We came here with high anticipations, and those anticipations have been more than fulfilled. We were quite struck with admiration of all we saw and heard, and I am quite sure our evidence will be satisfactory to the well-wishers of the Northwest in the highest degree. It should, however, be remembered that we have, after all, hardly seen the best of the country. We have seen what might be called the southern section, but we have heard that there is another section still finer, grander and richer. What would have been our admiration if we could have seen the glorious whole? Nevertheless we have heard on authentic evidence of the greatness of the northern region; and we can measure its greatness by considering what we have actually seen.\n\nTHE LONE LAND A LAND OF PROMISE.\n\nI beg to refer, secondly, to the remarkable contrast presented, the beautiful country until recently called \"The Lone Land,\" now being considered a land of promise. It is but a very few years since the places which are now the haunts of civilization were the runs and wallowing places of bands of buffaloes. The country is vast. The popular idea in England now is that the Northwest of Canada could sustain a population of 100,000,000 of Anglo-Saxons. I do not know exactly how they got the figure of 100,000,000; nevertheless it is very possible that it might be realized in the not very remote future. Indeed, considering the cultivable area of the Northwest, including both the Northwest Provinces and Manitoba, which can hardly be less than a million square miles, and reckoning a population of 100 to the square mile, which is not a high average, the result would be a total population of 100,000,000. This vast area might fairly be compared with some of the neighboring States of North America, fully equalling probably that of Dakota, Idaho, Minnesota and Washington, which are constituting a land of promise to our American kinsmen.\n\nTHE SCENERY.\n\nThe scenery of the prairie impressed all the excursionists with its vastness. There is a beauty in mere immensity; although the surface of the ground might not be diversified, yet it is a wonderful sight to see the sun rise and set on a tract perfectly level on all sides—as it were an\nocean of vegetation. The approach to the Rocky Mountains from the prairie is perhaps the most remarkable in the world. I do not want to give exaggerated ideas. People here probably think the Rocky Mountains the greatest in the British Empire, but the British Empire is a very large place. They are scarcely more than a third as high as the Himalayas, nevertheless the approach to them from the prairie is truly wonderful; for they rise as masses of rock right out of the prairie. During the greater part of the year they are covered with snow. Even now, at the end of the summer, the rocks are mainly snow-capped. As we approached the mountains we actually saw about 150 miles of continuous snow-clad hills, which, rising straight out of the prairie, constitute a sight which is quite unique. There is only one parallel to it—namely, the approach to the Caucasus from the steppes of Russia, and even this is not so fine, as there is first a range of low hills, then another a little higher, and again above all the summits of the snow-clad peaks of Caucasus. Perhaps at some future time I may give a lecture upon the scenery and topography of the mountains themselves, but for the present I must confine myself to the remark that the effect of all this scenery upon the minds of those who live in that region is very impressive. I believe that the contemplation of this magnificent scenery—magnificent in extent at least—has a very elevating effect upon the Anglo-Saxon mind, enlarging the ideas, brightening the imagination and elevating the sentiments. In the short addresses which we received on the way, there was a loftiness of expression almost amounting to grandiloquence, to which I had hardly been accustomed in the addresses which I have received in other portions of the British Empire. The wonders I have described are wonders of nature, but to our British eyes and patriotic minds, the greatest of all wonders was the spectacle of Anglo-Saxon, British-Canadian enterprise spreading itself over the surface of this vast country and writing its marks in letters of flame, as it were, upon the book of nature. (Applause.)\n\nTHE MINERAL RESOURCES.\n\nSome of the mineral resources we have not seen. I allude particularly to the iron ore of which we have seen specimens at the exhibition in Winnipeg; but we have seen something and heard much of the coal resources. I believe there are coal mines within a short distance of the line of the C. P. R. I understand that there are coal resources within a very moderate distance of it, and that there is quite on the line, within a hundred yards, superior ignite which will burn very well when mixed with bituminous or anthracite coal. When these coal mines are worked you will be independent of Pittsburg and the United States in respect of coal, and I need not say that this will be a great advantage.\n\nTHE PRAIRIE.\n\nThe prairie is fast becoming a thing of the past in this part of Canada.\nIn that respect it is following the example of the herds of buffalo, and of the poor Indians who are receding before the face of the white man. When we left Winnipeg we saw a few miles of real prairie; owing, we were told, to the fact that the lands were in the hands of speculators who were reserving them for future use. When we got beyond this limited area we really saw no prairie at all for several hundred miles when we crossed the Saskatchewan. I mean that we never passed for a mile together on the plain, without seeing a homestead, or field, or the marks of human occupation. It was only when we crossed the Saskatchewan that we saw real prairie, and then it was only so in a modified sense. From the moment the homesteads and golden fields ceased, the cattle ranches began. I understand that almost the whole area from the Saskatchewan to the foot of the mountains is really in the hands of the cattle ranchers. Here again we saw signs of the Anglo-Saxon, in his cattle and his herds. The vegetation of the prairie, so far as we were able to see it in the intervals of uncultivated land, was not remarkable, but still was very rich. Some of the more enthusiastic of the party said it was the richest wild vegetation they had ever seen, but I think this was due to their enthusiasm, because the vegetation in the steppes of Russia is quite as rich, if not richer. Still, the flora of this country is such as to promise an abundant return for agricultural labor.\n\nTHE SOIL.\n\nAlmost everywhere we saw rich soil. Most of us expected that we would find tracts of arid waste, or that if we saw rich soil it would be largely interspersed with specimens of gravel, rock and soil not suitable for cultivation; but this idea proved entirely false, for I declare without exaggeration that on the whole way from Winnipeg to the foot of the Rockies—a distance of 1,000 miles—there is hardly a foot of ground that did not seem to be capable of being turned to human use. Estimating the distance to the foot of the Rockies at a thousand miles, there is for this distance one unbroken area of land more or less fertile and capable of being turned to the advantage of man.\n\nPASTURAGE.\n\nMost of the party are of opinion that the pasturage is splendid and thoroughly suited for cattle; we were surprised that we did not see sheep as well. The grass is not very long, and promises a rich reward to the hay cutter. The cattle generally seem to be quite healthy, and of very good breeds, many of them coming from the neighboring states, and apparently bred from some of the best stock in England. Sometimes complaints are heard in England that Canadian and American cattle dealers purchase some of their best animals, but it is not to be regretted, seeing that a high considerance has to be paid for them. We were all impressed with the necessity of being careful about cattle diseases. We heard much on the way regarding\ndiseases that have broken out among cattle in various parts of the United States, reminding us of what has been in England; but we heard that Canada was free from them. For Heaven's sake take precautions to prevent their importation. I speak freely upon this subject, because in England we have failed to prevent the importation of diseased cattle, and the losses in consequence has been incalculable. We enquired a good deal as to ensilage, as the food for animals is becoming so fashionable in the United States and is being introduced into England; but we were told that no such food was necessary, because the supply furnished by nature is so very abundant.\n\nAGRICULTURE.\n\nI wish to speak of two kinds of crops, cereals and roots. Cereals are grown upon many farms exclusively; some of the greatest farms in the country are wheat farms almost entirely. We saw in many parts of the country specimens or exhibits of the products of the farm. The Canadian Pacific Railway Company has set a very excellent example by having model or pattern farms close along the line of railway, to show what the country is capable of producing. In inspecting these, while we found nothing to equal the monster cabbages shown at the exhibition here in Winnipeg, yet we saw good turnips and potatoes. We heard in England that there would be great difficulty in growing wheat at the altitude of this country, it being too high above the sea, but this idea was entirely falsified by what we saw, for wheat grows well 2000 feet above the sea; at Calgary at 3,000 feet, and at Padmore at 3,500 feet. Hence there is nothing in the altitude of this country to prevent wheat being grown on an immense scale. We inquired of farmers regarding many things which we have at home, namely, rotation of crops periodically, manuring and weeding, and we were indignantly told these things might be very necessary in the Old Country, but were not required in this new land. The same crop, it is said, has been grown year after year from land without injury. Manure, it is said, is not necessary in the virgin soil which accumulates so many advantages and has such richness in the soil, the subsoil, and the soil underneath that, that the crops will grow without manure. As to weeds, it is said that there are none of consequence. We asked about the ploughing, and said that we had to plough very deep in the old country. We were told that nothing of the kind was necessary here, that if the ground were just scratched over, crops would grow. We were told these things by practical men. The virgin soil here is a very abundant inheritance which has come down from what might be called a geological period, thousands of years having looked down upon these beautiful plains. The consequence is that for the time many of the old world devices, such as deep ploughing, manuring, weeding, and rotation of crops, can be dispensed with.\n\nLABOR.\n\nThe want of laborers is a great difficulty in the interior of the North-\nwest, and it has had this effect upon the farmers, that it has compelled them to exercise their wits and employ machinery to save labor. The agricultural machinery and implements in this country are among the most remarkable things to be seen. Every kind of implement and machine is there at work—with all their rough-sounding names, as scufflers, harrows, reapers, mowers, threshers, and the like—forming a most gratifying spectacle. We have seen them in the fields at work, in the towns outside the shops for sale, and inside the factories being repaired. The sight would make an old world man first laugh, and then feel envious. I will give one single example. In England when we reap the grain we have to stack it in order that the grain may ripen and after that we thresh it. The Northwest farmer does nothing of the kind. He brings the threshing machine to bear upon the sheaves, furnished ready to his hand by the harvesting machine. Then, having threshed the wheat, he stores it for the time in a temporary wooden structure in the field, and there he allows the grain to remain and harden until the snow falls deep and becomes fit for sleighing. Then, he draws it easily over the hard snow to an elevator, from which it is shot into railway cars placed beneath and carried away for exportation. The ingenuity, convenience and rapidity of the process gives the new world a great advantage over the old world. The consequence of this machinery and the labor-saving appliances is that the average cultivation per head is extremely high in this country. One would be inclined to say there must be a great population, judging from the area of cultivation, but on the contrary there are only a few thousands of Anglo-Saxons settled in the country. The fact is the average of acres of cultivation per head is several times as great as in the old world, every man having many acres under command, owing to the labor-saving appliances.\n\nTHE FARMS.\n\nSome of the farms are great, extending over many square miles of wheat cultivation absolutely unbroken by any fence or hedge. Nevertheless we had the pleasure of seeing many small farms in the best cultivated districts. At Portage la Prairie we understood that small farmers owned the land and worked upon it with their own hands. The farm houses are well-built, well-aired, and I understood, well-warmed in winter; and are very comfortable, both within and without. As to cottages, we asked for them, but really there were no cottages, because there are few men so low in the social circle as to require them. The country is absolutely without farm laborers. Around the houses of the peasant proprietors we saw market gardens with cabbage beds, turnip beds, and the like, just enough for the farmers' families. There is a good supply of fuel, though one might expect that on the prairie there would be nothing but grass or vegetation. Fortunately, there is low scrubby brush suited for fuel. The soil is entirely suited for the making of excellent bricks. To the great advantage of the farmers, there is small limestone\nscattered over the plains, from which excellent lime for masonry can be obtained. The subject of land speculation has attracted a great deal of unfavorable notice through the press. I have heard something of it in England, and still more in Montreal, but after all my impression is that the story must have been greatly exaggerated. With a vast area, a wise Government and a wise people enjoying popular representation, you should make provision for the future, so as not to allow the land to get too much into the hands of individuals or corporations. From the experience of the Old Country leading to the springing up of communism, Canada should take care to prevent anything of the kind happening here. While the State is generous, giving land without stint or grudge to every good applicant who asks for it, nevertheless it ought to keep something in its own hands. It seems to me that that duty has as yet been fairly performed; at all events it has not been left unformed in the way some people imagine. As to the land concession of the Canadian Pacific Railway Company, it should be remembered that without that concession the railway could not have been constructed. I find that the whole of the land has not been made over to the company, but only alternate blocks, the intervening ones belonging to the State; and that the total is but a fraction of the vast area. Remarks have been made about this company's concession to a great land company, but I find that this is only a small part of the land at the disposal of the State to give away or make disposition of as it may see fit, according to the wants of the coming generation. Hence I shall feel bound to say in England that no essential harm has been done by land concessions; and it is only fair to the Government and the Administration to say this.\n\nTHE CLIMATE.\n\nOne objection in England against this country is that of the winter. The summers are known to be hot, but this the people are not so much afraid of as they are of the supposed length, dreariness and wretchedness of the winters. I believe from inquiries that this description of your winter came from the portions of country lying under the Rocky Mountains, where the chinook winds make the winters somewhat like those of England, which are proverbially dull. In the rest of the country the winters are rather bright and cheery. The snow falls and hardens on the ground, and there is bright weather with blue sky overhead, so that the people walk about with the utmost facility, and on the whole have a cheerful time in the winter. In many parts of the country the residents tell me that the winter is the nicest season they have. (Applause.) From the very kind applause I judge that the description is correct, and if so it is very important that this description should be known at home, for the prevailing impression there is doing some harm to emigration.\n\nTREE CULTURE.\n\nSome say that the summer is somewhat too dry, but, if so, the drouth might be mitigated by planting trees. The experience of every part of\nthe globe proves that where the trees are swept away drouth follows, but where they are planted copiously, the early and the later rains are vouchsafed in due season. If the farmers and settlers would take precaution by planting trees, either in groves, or, better still, in long-stretching avenues, they would have the rains in good time. If arboriculture is to be successfully carried out, you must be careful to select those trees that will grow, because great harm has been done to the theories of aboriculturists by selecting unsuitable trees. Not those which have their roots deep down in the ground; but those which spread out their roots, as the poplar and maple ash, are the trees for the prairie. The heavy, long-continued snow and severe frost are great aids to the farmer. In England we have to sow in the autumn, and farmers have to look after their land sown with so much labor and expense, all through the winter. All sowing here is, however, done in the spring, and that is an advantage. During the long winter the snow prepares the ground, and the timely frosts pulverizes the clay and renders it suitable for the plough.\n\nIn the last two or three winters in England there has been very little frost, and one great pulverizing agency was lost, which you here never fail to enjoy. (Laughter and applause.) At the Montreal meeting of the association a Canadian professor read what was on the whole one of the most remarkable papers that I have heard in regard to tree-planting, showing how, with special reference to the Northwest, on every farm a grove of trees might be planted, with little patches here and there, so as to interrupt the breezes blowing from every quarter, and demonstrating how this would improve the climate, mitigate the severity of the winter, and afford shelter in every way. He illustrated all this by carefully drawn diagrams.\n\nI hope the principles which have been thus enforced by practical science will be adopted by your farmers. Then they ought to try to preserve the primeval forest which still remains. It is the universal testimony of all Canadians that these are being recklessly cut without regard to the future. The forests which we have seen between here and Lake Superior and at the Rocky Mountains are poor ones, but we understand there are magnificent forests farther to the north. There is a consensus of opinion among all Canadians that these forests are being used up without regard to future requirements; and there is an equal consensus that nothing whatever has been done by any Legislature or Government throughout the Dominion for the preservation of the forests. We could not but accept the report which we have received from competent witnesses. If it is true I will venture to utter one word of warning as to the consequences which must result to Canada if the fatal policy is pursued. Forests are very consumable things. Like the herds of wild buffaloes which disappear before the white man, they will disappear before before the wood cutter if precautions are not taken to prevent it, I have seen several examples of whole regions desolated by deforesting. It is too fatally possible\nto uproot the trees in such a manner that in a few years no trace of them will be left. What made the prairie? Do you suppose that it was made so by the hand of God? It has no doubt been covered with trees of a certain height, but probably by forest fires the broad plains which were once clothed with timber as a sheep's back with fleece, are now desolate. I am not speaking for the sake of England, but for the sake of Canada. England will never want for wood. In Scandinavia, which is separated from Britain by only a narrow strip of sea, there is the most magnificent forest preservation in the world. I have recently travelled over the whole of Norway and Sweden, and the system of forest conserving has filled me with envy and admiration. There is no trace of fires, and no reckless cutting; and everything is done methodically and scientifically. I saw the old forests and the new ones coming up; and everything is provided for the use of the present and the prospects of the future. Canada not only supplies the Northwest, but also exports a vast quantity to England; and it would be a melancholy thing to see her lumber trade pass into the hands of Scandinavia, owing to the neglect of Canadians themselves. Then, besides, you would have to use expensive stone and masonry for many purposes for which we now use wood. Every member of the association thinks as I have expressed in regard to this matter, and they have done everything they could at the Montreal meeting to ventilate the subject.\n\nTHE TOWNS.\n\nI will not undertake to describe Winnipeg; but we have seen the various towns along the railway, inspecting Portage la Prairie, Brandon, Qu'Appelle, Medicine Hat, Moose Jaw and Calgary; and I will add, Regina and Broadview. I am bound to congratulate you heartily on the condition of those rising places. Truly it is wonderful the manner in which these towns have sprung up. The streets are well laid out, and the houses are clean and tidy and picturesque in their architecture. Villas are springing up in the suburbs, and every villa has a cordon of trees springing up around it. We have observed the schools, the churches, the banks and civic buildings, and various other institutions; and we have seen also the shops full of all the paraphernalia of civilization. We have been particularly struck with the stocks of agricultural machinery already mentioned. Altogether the condition of those places is most satisfactory. We observed also in many places factories, and in every direction perceived signs of what might be truly called culture. I congratulate the people of Winnipeg on the exhibition here. Culture was exactly the thing which was most likely to prove wanting in a young community. Really the manner in which the exhibition has been got up, the variety and beauty of the objects exhibited, and the careful and scientific manner in which they have been displayed, are eminently creditable to this community, and shows that you have reached culture in the truest sense of the term. I think the British Association might be congratulated on the fact that it was\nfor their honor and edification that the citizens of Winnipeg kindly undertook to get up this exhibition. If our coming to Winnipeg has no other result than this of inducing you to get up that exhibition, we have been instrumental in doing good to you as well as to ourselves in rendering our visit memorable.\n\nCOMMUNICATION BY LAND AND WATER.\n\nIt would be like gilding fine gold if I were to praise the Canadian Pacific. Generally in Canada a railway administration is not thought by outsiders to be one of the strong points of the country. The fact is that in the new country with a vast area and a scanty population, railways are extended beyond the power of managing them up to the standard of the United States, or more particularly that of England. The Canadian Pacific Railway seems to be an exception. Passing by one or two accidents, beyond the control of any person or persons, I am bound to give the highest and most favorable testimony regarding the management of the Canadian Pacific Railway. But we are anxious to impress the consideration that the Canadian Pacific Railway is only the beginning of the vast railway system, nothing more or less than the main artery from which must branch out many veins, the backbone of the body politic, the limbs, arms, toes and fingers being yet to come. The Canadian Pacific Railway runs through a rich country no doubt, but still not the richest—the richest country is far to the north, and to that country branches must extend.\n\nCritics say that the main line ought to have been taken farther north; but no doubt the wisest course has been followed, because the main trunk runs nearly as straight as an arrow from ocean to ocean. The remaining work of constructing branches to the north is what might be called the crying want of the Northwest. (Applause.) We have heard remarks by many farmers to the effect that branch railways are wanting towards the south from the main line of the Canadian Pacific Railway, so as to make connection with the railways advancing upwards from the United States. The great and pressing importance of these matters should receive consideration. We are aware that the Canadian boatmen so celebrated in song and story are beginning to pass away and be superseded, inasmuch as boats must yield to the iron horse on land. Nevertheless we have observed that there is much steamer communication on the Assiniboine and Saskatchewan rivers right up to Medicine Hat. I heard also that there is excellent lake communication up to Winnipeg and along one branch of the Saskatchewan. Long experience has convinced me that canal or river navigation can not in the long run compete with railways; nevertheless it is a great advantage to a country intersected by railways to have a few navigable rivers and canals also, because, although they can not compete with railways, yet they carry things cheaply, and have a beneficial tendency as regards the public in keeping down railway charges for freight. In reference to Hudson's Bay ocean navigation—(applause)—I am aware that a committee of\nexperts is sitting upon this project, and considering whether it is practicable. If the committee reports that it is practicable, good; but if not, I would never abandon the hope that it might be found practicable by those who come after. (Prolonged applause.) I feel convinced that it must be practicable, because Hudson's Bay Company ships have navigated there for many generations, and what was practicable for them must be practicable for the steamships and Atlantic racers of the present day. The objections amount to this—that the harbors along Hudson's Bay are only open during a very short time each year. Still, the Hudson's Bay Company ships come pretty much at will all through the summer months, and why cannot a steamer do the same thing? Suppose at the worst the open season is but for a short time, nevertheless the route would be an advantage. In the old country there are waters open but for four months in the year, in which, still, a mighty traffic is done, as arrangements are made accordingly, and trade adapts itself to them. Even if there is but three or four months of open navigation, during the season ocean-going ships would come from Liverpool to Port Nelson or some other harbor there, that circumstance will make a world of difference to the Northwest, and entirely change the condition of the country, introduce a new factor into your political life, and altogether be very important to you, placing you at Winnipeg almost in direct communication with Liverpool by water. It would have immense effect upon the rich northern district I have been describing, and especially along the lower valley of the Saskatchewan. I regret that I have not been able to visit that country and enforce my remarks by practical observation; yet, notwithstanding, I am bound to state what I shall state in England,—my conviction and that of thousands of others. (Applause.)\n\nTHE TARIFF.\n\nI am not surprised to hear most of the farmers from England complain of the present tariff. They dislike having to pay the duty on agricultural implements, and think it pretty hard that there should be so much taxation on canned provisions. The duty on the latter is somewhat hard; but it seems that the agricultural implement question might be found to involve the fate of Canadian manufacturers. It must be for you Canadians to judge as a community whether it is or is not worth while to pay somewhat higher prices than you would otherwise have to pay in order to foster your rising manufacturers. That is a question on which an outsider would be careful about offering an opinion. I, as an economic scientist, must say that economic science is against a protective tariff, but science is not always applied to politics, and I admit that you are handicapped with many difficulties owing to your commercial relations with the United States. Nevertheless it is for you to judge whether you would consent or could afford to pay something in order that your young and rising Canadian manufacturers may be cherished during their infancy. If you think you can you must be\nprepared to bear a certain amount of sacrifice. After all you must remember that Providence has endowed you with many advantages which older countries do not possess, and perhaps you might be content to bide your time in hope that your friends down at Ottawa will try to temper the wind to the shorn lamb, and try to make the duties as convenient and light to you as they possibly can in view of your contentment and your being reconciled to a certain amount of national sacrifice for the sake of the young manufactures on the banks of the St. Lawrence. If you are not pleased with the tariff at present, you might be inclined, perhaps, to bear your fate meekly, because, taking communities one with another, there are few so blessed as you are. If other portions of the Dominion have authority over you, it is possible that in the not distant future you may become so great as to have authority over them. Although I am interested in the great future of Ontario, Quebec, New Brunswick, Nova Scotia and all other parts of this Dominion, in none do I see any future comparable to yours. With this land, which has the brightest prospect, before any other land in the British Empire stretching out around you, you might be prepared to acquiesce in certain sacrifices, if it were judged better by those in authority. Though I am a Conservative in English politics, I am personally an out-and-out-free-trader. Though we believe it is right to have a free trade policy, yet if we suggest that other nations should adopt the same, it is more for the good of the latter than our own. It was because other nations chose to put on their protective tariff that England remained queen of all the neutral markets in the world; and it is owing to those protective tariffs that she has managed to get into her hands the ship building industry, so that she builds 70 or 80 per cent. of all the ships that are built on earth. That business is extremely important and has been absolutely thrown into her hands by the protective tariffs, which, in defiance of economic science, other nations have adopted. The moral advantages of free trade to England are even greater than the material; because British manufacturers, knowing that they are wholly unprotected and can rely upon nothing except their own skill, industry, resources, and capital are exerting themselves with an inventiveness and fertility which is not, I believe, equalled on earth. It is impossible to give an idea of the ceaseless exertions Englishmen are making to preserve their proud place at the head of the industries of the world, because they know they have nothing to rely on but themselves. Their rivals in Europe and elsewhere hope that a false economy will induce England some time to put on a protective duty, because they know that things would then become dear in England, and England would no longer command the neutral markets. Competition would cease if England once adopted a protective system. It is not for our own sake that we would advise you in the humblest manner. If other nations choose to make things dear, let them do so, it is their own business; but England will continue to make her commerce as free as the air, and remain the indisputable and indisputed head of the industries of the world.\nCONDITION OF THE PEOPLE,\n\nThe condition of the people of the Northwest seems to me perfectly satisfactory, and you must be congratulated thereon. I have observed everywhere churches springing up. Some are wonderfully well-built, though others are rude and humble; yet the Divine Majesty is no respecter of churches; there are living institutions, clergy, congregations and ecclesiastical arrangements which seem to be excellent. The whole country is parcelled out into episcopal sees, and in all of them clergy are accumulating. Excellent provision is being made for education. There are large schools in the towns; and even in the sparsely inhabited country in the interior there is a school system. The ecclesiastical, religious and educational provisions are most creditable to the Northwest of Canada. In connection with the moral condition of the people, I ask permission to congratulate you heartily upon all the restrictions that you have been able to maintain in Manitoba respecting the manufacture and sale of spirituous liquors, and still more upon the prohibition which you have righteously enforced throughout the Northwest. I believe that prohibition had been introduced originally out of a charitable and humane regard towards the Indians; but I believe it was just as good for your own people as for the Indians. The authorities had assured me that the Canadian Pacific Railway could not have been constructed so quickly and efficiently as it was had there been no such thing as prohibition, and had the free use of whiskey been permitted. I asked the Mounted Police, and they informed me that their men were all temperance men. I do not know whether the word was used in any particular sense here, but, at all events, they said that their men were sober and temperate as a body, and I believe the officers did them no more harm than justice. I attribute the sobriety and good conduct of the men to the prohibition existing in respect to liquor. It has not been affirmed that the men would not drink liquor if they could get it, but they had difficulty in getting it, and being well-disposed men they reconcile themselves to abstinence. As you have this great advantage, I urge you for God's sake to keep it. You have a chance which they do not possess in the old world. There the use of intoxicating liquors has been for many centuries inveterate; and when it is once established it can with difficulty be eradicated, but that it must be by the gradual progress of enlightenment and education. You have been keeping liquor out of the country, for God's sake use that advantage. I am desirous to influence public opinion. We heard in every direction this prohibition was being greatly infringed and entrenched upon, and that eventually it would be taken away, and that free drinking would have scope. I hope that this will not be the case. I heartily congratulate you on the advantage you have, and I earnestly beseech you to keep it as long as you can.\n\nIMMIGRATION.\n\nImmigration to the Northwest is of two kinds, for the cattle ranche and for the farm. You are getting most excellent—the best possible\nclass, for cattle ranching. Sons of gentlemen who found every profession at home overstocked, who could not enter the army in the face of the competitive examinations, or who could not succeed at the bar, or in the church, and who found the counting-houses and banking establishments all filled with clerks, are already thinking they could better their mark by taking to cattle-ranching. I would far sooner see my son a farmer, active on horseback, making a little money and becoming independent before he was thirty years of age, than sitting still in a lawyer's office at home. I have made the acquaintance of several young men well educated and well-bred, working away on cattle ranches, healthy, blooming and hearty as young Englishmen ought to be, and who have lost none of their good English manner, or good original culture. Even several men high up in the professions at home are investing their capital in these ranches. My friend, Mr. Staveley Hill, has a splendid cattle ranch near Calgary. He is an eminent member of the English bar, and a member of Parliament also, and altogether one of the most rising men in the profession, nevertheless he is investing in this Canadian enterprise. I came out in the same ship with Mr. Inderwick, a Q. C., and a member of Parliament, who has settled his son on a cattle ranch near Fort MacLeod. That class of men you are likely to get in increasing number. As regards farmers and farm laborers, I apprehend, there will be difficulty, because in England they rather want all the farmers they have. Farm laborers are not the class they can conveniently spare. Artisan laborers are not wanted in the Northwest, but are more suited for Ontario. Men in privation, who could not get on, who had fallen into misfortune through bad seasons, although they had no special fitness for agriculture, might undergo a practical training at technical schools. The British people are beginning to think of Canada as a country with a great promise. Hitherto the United States has had the lion's share of the emigration, especially since the development of their Northwestern States. Now it is probable that public attention is so much turned to the Northwestern Provinces that there will be an ever-increasing stream of immigrants, but I doubt if they will be suited to agriculture. Although they may not understand farming, yet they may have stout hearts and strong hands, and an aptitude for learning, if you only make provision for teaching them. Canada was little known a few years ago in England, but is well-known now. At the mention of Canada before an English audience men and women prick up their ears. After coming to Canada a few years ago, as soon as I got home I was required to give account of what I had seen. I then stated what I had to say regarding Quebec and Ontario, but was obliged to withhold a report of the Northwest, which I had not seen. No doubt in my native country of Worcestershire, and in Birmingham, a strict account will be exacted from me on my return from the Northwest. Knowing I have before me an audience of experts I have carefully abstained from fine\nlanguage and restrained my enthusiasm. It is difficult to praise people to their faces, but I will be under no such disadvantage when I re-cross the Atlantic. Then I will be able to praise you to my heart's content, behind your backs, and I will give full vent to the enthusiasm in my heart. I will indulge in what are sometimes called \"hifalutin\" expressions regarding the boundless prairies and the grand Rockies, and I will be able to attempt a poetic description of the glories of this land of promise, and I will urge my friends and neighbors who can not get on at home to try their luck out here. As I have had the advantage through the kindness of my hearers of rehearsing my performance before them this evening, I hope that I may be able to perform it with much more vivacity and energy than I have been able to display on this occasion. I will be able to give a sincere and hearty report regarding the future which lies before you, and advise with all earnestness my countrymen at home to take part if they can in these great enterprises.\n\nTHE FEELING IN ENGLAND.\n\nThere is a feeling amongst Canadians that they had been disparaged among the people at home; but I am not aware of such disparagement, and will venture to give some contradiction to the assertion. I assure you that it is not the case, although my friends at home are not accurately acquainted with Canada. It is a large country, the maps are very uncertain and the old ones are all wrong. I think the Canadians themselves hardly have an idea of all its geographical features, and the people of the eastern provinces would hardly be able to pass a satisfactory examination on the geography of the Saskatchewan, the Peace, and the McKenzie rivers, hence I can hardly be surprised if this were the case in the Old Country. Yet people have visionary ideas of countries with which they are not actually acquainted; poetic ideas regarding things of which they have not accurate knowledge, as great, glorious and grand, though they do not exactly know in what the greatness, glory and grandeur consists. I am sure that no description which I can give would exceed the conception the people at home already have in their own imagination. They imagine you vaguely to have a great country with a perfectly immense development before it. It will be my duty in return for all the kindness and hospitality I have received here, to give them these particulars, and whether my account will be correct or incorrect the audience will be able to judge from what I have been telling you this evening. If my report is favorable it will gladden the hearts of our countrymen at home and make their breasts swell with patriotic fervor and their eyes glisten with sympathy for you, their fellow countrymen. They feel the greatest pride in their colonial—I will not say dependencies—but dominions which form a part of their great empire. They do not regard you as subject, but as fully equal to themselves and as partaking of all the privileges of the mother land. Whatever you achieve of happiness or\nprosperity will always be a source of gladness to them. They will rejoice when you rejoice, and weep when you weep. They feel a patriotic and brotherly sentiment toward you in common with all the colonies of the British Empire. (Prolonged applause.)\n\nNORTHWEST RAILWAYS.\n\nFor the information of many that are not acquainted with the railway facilities of Manitoba and the Northwest, it might be stated that the Canadian Pacific Railway, which extends from the head of Lake Superior to Winnipeg and thence west past the summit of the Rocky Mountains, together with its several branch lines, there are two other railway lines in operation. The Manitoba & Northwestern Railway, which taps that vast fertile region lying to the north of the country traversed by the Canadian Pacific Railway, and known as the valley of the Saskatchewan, has fifty miles in operation and another fifty miles, the grading of which is rapidly approaching completion. The line branches off from the Canadian Pacific Railway at Portage la Prairie and takes a northwesterly course, being built to Minnedosa, a thriving town, and located right on the Prince Albert district where the north and South Saskatchewan rivers join, and flow on to Lake Winnipeg. The distance is 320 miles. The company has secured a land grant from the Dominion Government of three million acres, all of the finest quality. The Manitoba Southwestern Railway, formerly a colonization road, extends about sixty miles into Southern Manitoba, and it has been surveyed all through that fertile region to the coal fields of the Souris country over 200 miles. The construction of this latter line will be vigorously prosecuted next summer.\nBUSINESS DIRECTORY.\n\nHUDSON'S BAY CO'Y\n\nFarming, Grazing, Coal and Mineral\nLANDS FOR SALE\nIn the Province of Manitoba and the Northwest Territories.\n\nThe Company are entitled to 7,000,000 ACRES in the Great Fertile Belt extending from the International Boundary northward to the North Branch of the great Saskatchewan River, and from the Eastern Boundary of Manitoba to the Summit of the Rocky Mountains. The whole of the lands are offered for sale On Easy Terms of Payment and Without any Conditions of Settlement or Cultivation.\n\nTOWN LOTS FOR SALE\nIn the following flourishing and rising Centres of Trade:\nWinnipeg, Rat Portage, Colville, West Lynne, Elphinstone, Edmonton,\nPortage la Prairie, Fort Qu'Appelle, Prince Albert, etc.\n\nMaps and Plans with full information in regard to these lands can be obtained either personally or by letter, at the Company's Office, 208 Main Street, Winnipeg.\n\nC. J. BRYDGES, Land Commissioner.\n\nThe Canada North-West Land Company, L'd\n\nOFFER FOR SALE\nSELECTED FARM LANDS\nIN MANITOBA AND THE NORTHWEST TERRITORIES\nNear the Canadian Pacific Railway Main Line.\n\nFor information, prices and maps, apply at the offices of the Company,\n21 Hill Street, EDINBURGH, Scotland;\n75 Lombard Street, LONDON, England,\n181 Main Street, WINNIPEG, Man.\n\nW. B. SCARTH, Managing Director in Canada,\n\nCANADIAN PACIFIC RAILWAY TOWN LOTS.\n\nThe TOWN SITE TRUSTEES offer for sale BUILDING SITES at all Stations on the main line of the above railway between Brandon and Calgary.\n\nW. B. SCARTH, TRUSTEE.\nManitoba & North-Western Railway Company\n\nLAND DEPARTMENT.\n\nOFFICES 622 MAIN STREET, WINNIPEG.\n\nThe Land Grant to the Manitoba & Northwestern Railway amounts to\n\n2,750,000 ACRES,\n\nOut of which grant 512,000 acres are now for sale, and the purchaser may select the best lands out of the entire grant.\n\nCHEAP PRICES! LONG CREDIT!\nREBATE FOR CULTIVATION AND NO RESTRICTIONS!\nGOOD SOIL! GOOD TIMBER! GOOD WATER!\n\nTERMS OF PAYMENT: If paid for in full at time of purchase, a discount will be allowed, but the purchaser may pay one-sixth in cash and the balance in five annual instalments, with interest at six per cent per annum payable in advance.\n\nFor further particulars, Maps, Folders, etc., apply to\n\nARTHUR F. EDEN,\nLand Commissioner,\nWINNIPEG, MAN.\n\nA. HARRIS, SON & CO. (Limited)\nManufacturers of and Dealers in all kinds of Agricultural Implements.\nWHOLESALE AND RETAIL.\nPRINCESS STREET, WINNIPEG, MANITOBA.\n\nFACTORY AT BRANTFORD, ONTARIO.\nNorth West Head Office, Winnipeg, Manitoba.\nBRANCHES AT EVERY IMPORTANT POINT THROUGHOUT THE CANADIAN PROVINCES.\nBUSINESS DIRECTORY.\n\nWESBROOK & FAIRCHILD,\nWHOLESALE AND RETAIL DEALERS IN\nAGRICULTURAL IMPLEMENTS.\n\nWAGONS,\nSEEDERS,\nHAY RAKES,\nHARROWS,\nSLEIGHS.\n\nJOHN DEERE\nMOLINE, ILL.\nTRADE MARK.\n\nWholesale Agents for the celebrated John Deere Plows.\nTHE BEST IN THE WORLD.\n\nCatalogues and Price Lists sent free on application.\n\nPRINCESS STREET, WINNIPEG, MANITOBA\nBranch Warehouses at all points in Manitoba and the North-West.\n\nMANITOBA BRANCH\nOF\nTHE WATSON\nMANUFACTURING CO.,\n[LIMITED.]\nAYR, ONTARIO.\n\nYou are invited to call at our warehouse,\nMarket Square, Winnipeg,\nor at our agencies at\nAll Principal Points West,\nAnd see the best and cheapest assortment of\nBINDERS,\nReapers, Mowers, Rakes,\nHarrows, Plows, Wagons,\nFanning Mills, Seeders,\nBarbed Wire for Fencing,\netc., etc.\nBUSINESS DIRECTORY.\n\nMACDONALD & TUPPER,\nBarristers, Attorneys, &c.,\nMcARTHUR & DEXTER,\nBarristers, Solicitors, &c.,\nSolicitors for the Canadian Pacific Railway Land Department, Manitoba Southwestern Railway, Winnipeg and Hudson Bay Railway and the Merchants' Bank.\n\nOffices, Over the Merchants Bank of Canada, WINNIPEG, Man.\nJ. B. McARTHUR, Q. C.   HUGH J. MACDONALD.   J. STEWART TUPPER.   H. J. DEXTER.\n\nAIKINS, CULVER & HAMILTON,\nBARRISTERS, &c.\nSolicitors for the Canadian Pacific Railway, The Imperial Bank, Manitoba Northwestern R'y, &c.\n\nOffice, over Imperial Bank, Main Street, Winnipeg.\nJ. A. M. AIKINS.   W. H. CULVER.   C. E. HAMILTON.   P. MCCARTHY.   G. G. MILLS.\nA. V. McCLENEGAN.   W. H. LONG.\n\nBAIN, BLANCHARD & MULOCK,\nBarristers, Attorneys, Solicitors, &c.,\nOffice, 354 Main Street, Winnipeg, Man.\nSolicitors for The Bank of Montreal, The Hudson's Bay Company, The Merchants Bank, American Express Company, London & Canadian Loan and Agency Co., Manitoba Investment Ass'n.\n\nJOHN F. BAIN.   SEDLEY BLANCHARD, Q. C.   W. REDFORD MULOCK.   EUGENE D. CAREY.\nE. HOWARD MORPHY.   W. E. PERDUE.\n\nMACARTHUR, BOYLE & CAMPBELL,\nD. MACARTHUR and W. L. BOYLE, Cashiers\nTransact a General Banking Business.\nHave superior facilities for making collections. Buy and sell Town, School and County Bonds\nCorrespondents: NEW YORK, Merchants Bank of Canada; LONDON, Boyle, Campbell, Buxton & Co.\n\nMain and Bannatyne Streets, Winnipeg, Manitoba.\nDUNCAN MACARTHUR.   LIONEL R. C. BOYLE.   W. L. BOYLE.   LORD GEORGE CAMPBELL.\nBUSINESS DIRECTORY.\n\nMERCHANTS' BANK of CANADA.\n\nCAPITAL (paid up), $5,700,000\nRESERVE FUND, $1,250,000\n\nHEAD OFFICE, MONTREAL.\n\nANDREW ALLAN, Esq., President.\nROBERT ANDERSON, Vice-President.\nGEORGE HAGUE, General Manager.\n\nAGENCIES in all the Principal Cities and Towns in the Dominion.\nBranches in Manitoba—Winnipeg, Emerson, Brandon.\nBankers in Great Britain—The Clydesdale Bank (Limited), 30 Lombard Street, London, Glasgow and elsewhere.\nA general banking business transacted.\nMoney received on deposit, and current rates of interest allowed.\nLetters of Credit Issued, Available in China, Japan and Other Foreign Countries.\n\nBANK OF MONTREAL.\n\n(ESTABLISHED IN 1818.)\n\nCAPITAL (all paid up), $12,000,000.\nRESERVE FUND, $6,000,000\n\nHEAD OFFICE, MONTREAL.\n\nG. F. SMITHERS, President.\nHON. D. A. SMITH, Vice-President.\nW. F. BUCHANAN, General Manager.\n\nAGENCIES in all the Principal Cities and Towns in the Dominion.\nAgents in Great Britain—London, Bank of Montreal, 9 Birchin Lane, Lombard Street, C. Ashworth, Manager. London Committee—E. H. King, Esq., Chairman; Robert Gillespie, Esq., Sir John Rose, Bart., K.C.M.G.\nBankers in Great Britain—London—The Bank of England; The London & Westminster Bank; The Union Bank of London. Liverpool—The Bank of Liverpool. Scotland—The British Linen Company and Branches.\nIssue Circular Notes and Letters of Credit for Travellers, available in all parts of the world.\n\nG. F. CARRUTHERS. J. H. BROCK.\n\nCARRUTHERS & BROCK,\nFinancial & Insurance Agents.\n\nMONEY TO LOAN on easy terms and at reasonable rates.\nInsurances effected in first-class English, Canadian and American Companies.\nEstates managed and Investments made.\nLong residence and an intimate knowledge of the Northwest enable the firm to deal intelligently with all matters placed in their hands. Correspondence solicited.\nP. O. Drawer 1227.\nOffice, 26 McDermot Street East, WINNIPEG, Man.\n\nS. POLSON,\nREAL ESTATE AGENT.\n\nSpecial attention given to the purchase and sale of lands in the vicinity of Winnipeg.\nLands bought and sold on commission.\n\nOpp. City Hall. Office, No. 258 Main Street, WINNIPEG, Man.\nGeneral Insurance Agency\nOF\nG. W. GIRDLESTONE.\n\nCapital Represented $65,000,000.\n\nFIRE OFFICES:\n\"City of London,\" England.\n\"Northwest,\" of Manitoba.\n\nLIFE: \"Life Association of Canada.\"\n\nOCEAN STEAMSHIP AGENCY: Cunard, Anchor and Beaver Lines.\nGoldie & McCulloch's Safes and Vault Doors.\nSub-Agencies throughout the Province and Northwest Territories.\nOffice: 5 Lombard Street, WINNIPEG.\n\nOSLER, HAMMOND & NANTON,\nWINNIPEG, MANITOBA, & TORONTO, ONTARIO.\n(MEMBERS TORONTO STOCK EXCHANGE.)\n\nFinancial Agents,\nAnd Dealers in Railway & Municipal Debentures.\n\nGENERAL MANAGERS\nNorth of Scotland Canadian Mortgage Co.\n\nGENERAL AGENTS\nOntario & Qu'Appelle Land Co.\n\n200,000 Acres Qu'Appelle Land for sale on Easy Terms.\n\nH. W. A. CHAMBRÉ & CO.,\nLAND & STOCK BROKERS\nAnd Financial Agents,\nWINNIPEG, MANITOBA.\nP.O. Box 146.\n\nFunds carefully invested on First Mortgage Security, Etc., Etc.\nReferences given either in England or Canada, on application.\n\nPARSONS & FERGUSON,\nImporters and Wholesale Dealers in\nStaple and Fancy Stationery,\nSCHOOL BOOKS,\nWrapping, Printing and Wall Papers, Paper Bags, Twines, etc.\nWINNIPEG, MANITOBA.\nR. J. WHITLA & CO.,\nImporters of—\nDRY GOODS,\n14, 16 & 18 Albert St., 22 McDermot St., Opp. Post Office,\nWINNIPEG.\n\nCAMPBELL, SPERA & CO.,\nManufacturers and Importers of\nGents' & Ladies' Furnishings, Fancy Dry Goods\n&c., &c.\nCorner of William and Princess Sts., WINNIPEG, Man.\n\nSUTHERLAND & CAMPBELL,\nWHOLESALE GROCERS\nAnd Commission Merchants,\nImporters of Teas and Coffees. Princess Street, near McDermot St.\n\nJAMES BISSETT & SON,\nTea Importers and Wholesale Grocers,\nALSO\nWholesale Heavy Hardware and Metal Merchants,\nBar Iron, Steel, Tin, Canada Plates, Zinc, Nails, etc.\nCorrie's Block, Princess Street,\nWINNIPEG.\nBUSINESS DIRECTORY.\n\nTURNER, MACKEAND & CO.,\nWHOLESALE GROCERS,\n35 and 37 Bannatyne Street and 36, 38, 34 and 36 Rorie Street,\nWINNIPEG, MANITOBA.\n\nG. F. & J. GALT,\nWHOLESALE IMPORTERS OF\nTeas, Wines, Brandies and\nGENERAL GROCERIES.\nPrincess Street, Opposite Grand Union Hotel,\nWINNIPEG.\n\nLYON,\nMACKENZIE\nand POWIS,\nIMPORTERS,\nWHOLESALE GROCERS\nAND\nProvision Merchants\nCor. McDermott & Albert Sts.,\nWINNIPEG.\n\nTHOMPSON, CODVILLE & CO.,\nWHOLESALE GROCERS,\n26 McDermott Street,\nWINNIPEG, MANITOBA.\nHODGSON, SUMNER & CO.,\nIMPORTERS OF\nBritish, French, German & American Dry Goods,\nSmall Wares and Fancy Goods,\n25 & 27 Princess St., WINNIPEG.\n\nW. E. SANFORD & CO.,\nCLOTHING MANUFACTURERS,\n45, 47, 49 King Street, HAMILTON, Ont.,\n24 McDermott Street, WINNIPEG, Man.\n\nH. SHOREY & CO.,\nWholesale Clothiers\nAND MANTLE MANUFACTURERS,\n33 Post Office St., WINNIPEG.\n\nTHE AMES, HOLDEN COMPANY,\nWHOLESALE DEALERS IN:\nBOOTS & SHOES\nGerrie Block, Princess Street,\nWINNIPEG, MANITOBA.\n\nAMES, HOLDEN & CO., MONTREAL.\nJAMES REDMOND, WINNIPEG.\nA. C. FLUMERFELT, WINNIPEG.\nJAS. H. ASHDOWN,\nWHOLESALE DEALER IN\nHARDWARE,\nStoves, Tinware, Paints, Oils, &c.\nCor. Main & Bannatyne Streets. WINNIPEG, MANITOBA.\n\nMULHOLLAND BROTHERS,\nWHOLESALE AND RETAIL\nHARDWARE MERCHANTS,\nStoves and Tinware, House Furnishings.\n468 MAIN STREET, WINNIPEG.\nAgents for the Washburn & Moen Manufacturing Company's Celebrated Galvanized Steel Barbed Fence Wire.\n\nPORTER & RONALD,\nDIRECT IMPORTERS OF\nCrockery, Glassware, China,\nLamps, Chandeliers, Cutlery,\nSilver-Plated Ware and Fancy Goods.\n330 MAIN STREET, WINNIPEG.\n\nTHE E. & C. GURNEY CO.\n(LIMITED.)\nMANUFACTURERS OF\nStoves, Ranges & Furnaces.\nWholesale Warehouse, Rupert St. West,\nWINNIPEG, MANITOBA.\nFoundries: Hamilton & Toronto, JAS. BURRIDGE, Manager, Winnipeg.\nTHOS. SCOTT,\nImporter and Dealer in\nFURNITURE,\nWHOLESALE AND RETAIL.\nLargest and Best Assortment in the City.\nFactory, Cor. Graham and Vaughan Streets.\nWarehouses, 276 Main Street.\nWINNIPEG, MAN.\n\nBISHOP & SHELTON,\nManufacturers of and Dealers in\nFURNITURE,\nWHOLESALE AND RETAIL.\nFurniture Manufactured to Order a Specialty.\n298 MAIN ST, WINNIPEG.\n\nTHOS. W. TAYLOR,\nTHE PIONEER PAPER RULER\nAND\nBlank Book Manufacturer\nOF MANITOBA AND THE NORTH-WEST.\n13 OWEN STREET, WINNIPEG, MANITOBA.\n\nOGILVIE MILLING CO.\nMAMMOTH MILL AT POINT DOUGLAS, WINNIPEG.\nCapacity 750 Barrels per day.\nOFFICE—Corner King & Alexander Streets, Winnipeg.\n\nA Full Stock of Patent Hungarian, Strong Bakers' and Spring Extra Flour;\nOatmeal, Pot and Pearl Barley, Graham Flour, Cracked Wheat, Bran, Shorts,\nGround Feed, Oats and Barley.\nWheat Buyers at all Shipping C.P.R. Stations. Heaviest Exporting Firm\nin Canada.\nRYAN,\nTHE Boot and Shoe MAN.\nThe Largest Retail Boot and Shoe Dealer in the Dominion of Canada.\n\nWINNIPEG, MANITOBA.\n\nGRAND UNION HOTEL.\nThe most commodious and best arranged House in the Northwest.\nSteam Heating throughout. Baths. Closets, &c.\nMagnificent and Convenient Location.\nThe Tourist's Favorite. Prices graduated.\nCorner Princess and Ross Streets,\nWINNIPEG, MANITOBA.\n\nTHE QUEEN'S,\nWINNIPEG, MAN.\nThe Palace Hotel of the Northwest.\n\nO'CONNOR & BROWN,\nProprietors.\nN. W. MOUNTED POLICE.\n\nFollowing are the Rates of Pay paid to officers and men of the Mounted Police for which recruits are constantly wanted:\n\nNON-COM. OFFICERS:\nStaff Sergeants, $1.00 to $1.50 per diem.\nSergeants, $1.00\nCorporals, $8\n\nCONSTABLES:\nRegular Pay. Good Conduct Pay. Total.\n1st year... 50 c. 50 c. per day. 50 c.\n2nd \" 50 c. 50 c. 50 c.\n3rd \" 50 c. 50 c. 50 c.\n4th \" 50 c. 50 c. 50 c.\n5th \" 50 c. 50 c. 50 c.\nDuring re-engagement 50 c. 50 c. 50 c.\n\nRATIONS, PER MAN.\nBeef, Bacon, or Ham... 1 lb., 8 oz. per man.\nPemmican or Dried Meat... -\nFlour... 4 oz.\nBread... 4 oz.\nPotatoes... 2\nOil... 2\nDried Apples... 2\nTea... ½ oz. Salt, ¼ oz.\nCoffee... ½ oz. Pepper, ¼ oz.\nSugar... 3\nRice... -\n\nLELAND HOUSE.\n\nW. D. DOUGLAS & CO., Proprietors.\nGeo. A. Whitehead, Chief Clerk.\n\nTHE FINEST HOTEL IN THE NORTHWEST.\nHeated by Steam throughout; Hot and Cold Baths, Closets, etc., on each floor.\n\nGraduated Prices.\n\nCorner of City Hall Square and Main Street.\n\nWINNIPEG, MAN.\n\nBus to and from Trains.\nStreet Cars pass the House.\nThe Manitoba Free Press.\n\nDAILY & WEEKLY.\n\nTHE LEADING PAPER OF THE CANADIAN NORTH-WEST.\n\nTHE OLDEST ESTABLISHED. THE LARGEST CIRCULATION.\n\nThe Best Advertising Medium\n\nThrough which to reach the people of the Great Canadian North-West, and the best paper to read to gain information about that country.\n\nSUBSCRIPTION RATES.—Weekly, one year, $2.00; six months, $1.25; Daily, one year $10; six months, $5; three months, $3, both invariably cash in advance. Mailed free of postage to any address in Canada and Great Britain. Remittances may be made by registered letter or post office money order. Advertising rates on application.\n\nKENNY & LUXTON, Publishers, - Winnipeg, Manitoba.\n25,000,000 ACRES!\n\nCANADIAN PACIFIC RAILWAY COMPANY.\n\nLAND DEPARTMENT.\n\nOFFICE IN NEW STATION BUILDING,\nWINNIPEG.\n\nTwenty-Five Million Acres of SELECTED Wheat, Meadow and Grazing Lands.\n\nThe Company offer their lands for sale within the forty-eight mile belt along the Main Line\n\nWITH OR WITHOUT CULTIVATION CONDITIONS,\n\nAt the option of the purchaser. Prices range from $2 per acre upwards, with conditions requiring cultivation, and without cultivation or settlement, at liberal figures, based on close personal inspection by the Company's Land Examiners.\n\nWhen the sale is made subject to cultivation A REBATE of one-half of the purchase price will be allowed on the quantity cultivated, and will be applied on the next payment falling due.\n\nTERMS OF PAYMENT:\n\nPayments may be made in full at time of purchase, or in six annual instalments. Land Grant Bonds can be had from the Bank of Montreal, or any of its Agencies, and will be accepted at 10 per cent. premium on their par value, and accrued interest.\n\nMaps showing the townships open for free entry under the Government regulations, and homesteads already taken therein, can be seen at the office of the Company at Winnipeg.\n\nThe Land Department have Agents stationed at the principal towns along the Main Line who will furnish particulars as to lands for sale in their Districts.\n\nLocal Land Agents are not authorized to receive, or receipt for, any monies in behalf of the Company, or to bind the Company by any agreements or acts whatsoever. Parties purchasing can remit by Express from any Express Office on the C.P.R. at the Company's expense, to the Land Commissioner at Winnipeg.\n\nFor further particulars, and also for Folders, Sectional Maps, Pamphlets and Guide Books, apply in person or by letter to CHARLES DRINKWATER, Secretary, C. P. R. Co., Montreal; to ALEXANDER BEGG, General Immigration Agent of the Company, 88 Cannon Street, London, England; and to the undersigned, to whom all applications as to prices, rebates, and the purchase of land generally, should be addressed.\n\nJ. H. McTAVISH,\nLand Commissioner,\nCanadian Pacific Railway Company, WINNIPEG.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25858.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 75, "total-input-tokens": 121096, "total-output-tokens": 36192, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2382, 3], [2382, 4861, 4], [4861, 4861, 5], [4861, 5161, 6], [5161, 7298, 7], [7298, 9265, 8], [9265, 10751, 9], [10751, 12626, 10], [12626, 14566, 11], [14566, 16545, 12], [16545, 18725, 13], [18725, 21076, 14], [21076, 23235, 15], [23235, 25748, 16], [25748, 28157, 17], [28157, 30381, 18], [30381, 32697, 19], [32697, 35124, 20], [35124, 37929, 21], [37929, 41189, 22], [41189, 43760, 23], [43760, 46216, 24], [46216, 48720, 25], [48720, 51178, 26], [51178, 53254, 27], [53254, 55640, 28], [55640, 58281, 29], [58281, 60862, 30], [60862, 63347, 31], [63347, 66097, 32], [66097, 68748, 33], [68748, 71312, 34], [71312, 73810, 35], [73810, 76432, 36], [76432, 78781, 37], [78781, 81243, 38], [81243, 83830, 39], [83830, 86341, 40], [86341, 88716, 41], [88716, 91376, 42], [91376, 93706, 43], [93706, 96657, 44], [96657, 99599, 45], [99599, 102510, 46], [102510, 105487, 47], [105487, 108556, 48], [108556, 111602, 49], [111602, 114755, 50], [114755, 117846, 51], [117846, 120908, 52], [120908, 123975, 53], [123975, 127245, 54], [127245, 130364, 55], [130364, 133486, 56], [133486, 136538, 57], [136538, 138219, 58], [138219, 139734, 59], [139734, 140791, 60], [140791, 141561, 61], [141561, 143084, 62], [143084, 145193, 63], [145193, 146315, 64], [146315, 146933, 65], [146933, 147429, 66], [147429, 147986, 67], [147986, 148710, 68], [148710, 149597, 69], [149597, 150071, 70], [150071, 151100, 71], [151100, 151782, 72], [151782, 153911, 73], [153911, 153911, 74], [153911, 153911, 75]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]