[{"id": "2a47eed0f95e04c956f0142af5233f447827fbf3", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\n☐ Couverture de couleur\n\n☑ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X ✓ 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shell contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier pli et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second pli, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE AGRICULTURAL DEPRESSION\nAT HOME,\nAND THE\nRESOURCES, CAPABILITIES, AND PROSPECTS\nOF THE\nCANADIAN NEW NORTH-WEST.\n\nA LECTURE DELIVERED BEFORE THE BALLOON SOCIETY OF GREAT BRITAIN,\nAT THE ROYAL AQUARIUM, ON FRIDAY, FEBRUARY 9, 1883.\n\nBY\n\nJOHN PEARCE.\n\nWITH ADDITIONAL INFORMATION IN AN APPENDIX.\n\n\"The growing importance of the great self-governed Colonies of England is recognised by every Englishman of whatever party or class.\"—The Earl of Derby.\n\n\"To be ignorant of the North-West is to be ignorant of the greater portion of our country.\"—The Marquis of Lorne.\n\nLONDON:\nH. SELL, 167, FLEET STREET, E.C.\n\n1883.\n\nPRICE ONE SHILLING.\nTO THE EDITOR\n\nThe accompanying pamphlet discusses topics of considerable importance from the following points of view:—\n\nAGRICULTURE,\nFOOD SUPPLIES,\nEMIGRATION,\nCOLONIAL DEVELOPMENT.\nAND\nNATIONAL PROGRESS.\n\nIf you notice the little work (which is suggestive rather than exhaustive), as I hope you will, seeing that the questions it discusses are of national concern, the author will be glad to receive a copy of your paper containing the reference addressed as under:—\n\nMr. JOHN PEARCE,\nc/o H. SELL, Esq.,\n167, Fleet Street,\nLondon, E.C.\nTHI\n\nRE\n\nCAI\n\nA LECT\n\n\"The\n\nrecognis\n\nDERBY.\n\n\"To\n\nour coun\n\nH\nTHE AGRICULTURAL DEPRESSION\nAT HOME,\nAND THE\nRESOURCES, CAPABILITIES, AND PROSPECTS\nOF THE\nCANADIAN NEW NORTH-WEST.\n\nA LECTURE DELIVERED BEFORE THE BALLOON SOCIETY OF GREAT BRITAIN,\nAT THE ROYAL AQUARIUM, ON FRIDAY, FEBRUARY 9, 1883.\n\nBY\nJOHN PEARCE.\n\nWITH ADDITIONAL INFORMATION IN AN APPENDIX.\n\n\"The growing importance of the great self-governed Colonies of England is recognised by every Englishman of whatever party or class.\"—The Earl of Derby.\n\n\"To be ignorant of the North-West is to be ignorant of the greater portion of our country.\"—The Marquis of Lorne.\n\nLONDON:\nH. SELL, 167, FLEET STREET, E.C.\n1883.\nBRITISH AGRICULTURE\nAND THE\nCANADIAN NEW NORTH-WEST.\n\nOn Friday, February 9, 1883, Mr. John Pearce delivered a lecture before the Balloon Society of Great Britain, at the Royal Aquarium. Captain Bedford Pim, R.N., occupied the chair.\n\nThe Chairman said the question was one of great importance to all classes of our people. He had much pleasure in aiding to make known the great advantages which the British North-West afforded to emigrants. After the lecture a full opportunity of discussion would be allowed. He then called upon\n\nMr. John Pearce, who said—Ladies and Gentlemen,—The balloon has been the subject of much thought, experiment, and speculation. As a means of transit at present it is of no practical value. The currents of air cannot be depended on; and apart from them a motive force has to be discovered, or at all events to be applied. Dr. B. W. Richardson recently declared his conviction that the problem will be solved on lines somewhat similar to those on which the dandy-horse of our grandfathers has been developed into the bicycle and tricycle of today. The attention of practical balloonists has of late been chiefly directed to the value of the balloon as an engine of war; but, believing in the preservation of human life rather than in its destruction, we will avail ourselves of the apparatus, or Society rather, for a few minutes this evening, in exploring the wonderful grain and food producing district known as Manitoba and the Great North-West.\n\nProbably few persons present have a practical knowledge of agriculture or are much interested in the subject. The primeval calling or occupation, it retains its rank and position even in our own age of material progress. Every other trade or calling is dependent upon agriculture. That being the case, we are all indirectly interested in the subject. No doubt the cultivation of the land is our natural vocation. Following that we have health, and perhaps a greater amount of happiness than we get in any other walk of life. Happiness, I say, not wealth. The pursuit of wealth is followed, not for its\nown sake, but as a means of happiness or road to it. The wealth is oftener missed than gained; but even when secured, the happiness is generally farther off than ever. And not infrequently the bubble wealth bursts in the hand as it is grasped.\n\nIn our own land agriculture has been the most important occupation for a thousand years, and the land is more productive today than it was when our Saxon forefathers broke up the maiden soil. Farming is an art; in an old country like this, to be successful, it must be something more—a science. The elements abstracted from the soil by the plant have to be returned to it in the form of manure; a rotation of crops has to be observed; the seasons have to be studied; and the farmer has to forecast, as best he can, the probable dryness or wetness of the coming months. The tenant farmer then is an important personage. Upon his skill, experience, energy, application, and perseverance, the success or failure of his occupation largely depends. He is subject, however, to extraordinary vicissitudes; and in recent times he has laboured under heavy disabilities. Two other classes are directly associated with him in agriculture—the landowner and the labourer. Our system has seemed, as far as it is possible to secure anything in this world, the interest of the landowner, and his rent or share in the results of the cultivation of his land by others is certain. The farmer takes all risks of seasons, markets, loss of stock, failure of crops, &c.; and indirectly the risk is shared by the banker or capitalist who lends him money, the tradesman who gives him credit, and also by the labourer who tills the soil or tends his stock.\n\nThe repeal of the Corn Laws—a beneficial measure to the artisan, manufacturing, and trading classes—has been a great hardship to the agriculturalist. Free trade in corn has prevented the farmer from recouping himself in bad seasons for diminished quantity of produce, from the enhanced price which would otherwise have followed scarcity. This loss has been borne by the farmers, and, to a certain extent, by the labourer; but it has not in any way affected the landowners. The law of distress; the custom or law which has prevented farmers from selling certain produce in the best market; the non-liability to the outgoing tenant for unexhausted improvements, have secured the landlord \"his pound of flesh,\" if I may be permitted to use the expression.\n\nAgriculture is admitted to be in a desperate condition. A bad season not only means no profit to the farmer, it generally means diminished capital. A series of bad seasons therefore mean total loss of capital. We are told by those who are anxious to glaze over the serious condition of things that the seasons go in cycles of seven years; that we get seven bad years and then seven good ones; but, as Mr. C.S.\nThe Results of a Good and Bad Season.\n\nRead points out, we have now entered upon the eighth bad season in succession. The recent report of the Agricultural Commission intimates that it is probable that large tracts of arable land in the Eastern Counties will go out of cultivation. I have a return from an intelligent tenant farmer, who was bred up to his calling, which shows the value of produce in a good and bad season respectively. His farm, which is in Buckinghamshire, is 176 acres in extent. The land is light. It is farmed on the five-course shift, viz.: 1-5th turnips, 1-5th grass, 3-5ths corn. Hay and straw are spent on the land.\n\n1.—Season, 1876-7.\n\n| Acreage | Yield, qrs. | Yield per Acre, qrs. | Price per qr. | Total Value of Produce |\n|---------|------------|---------------------|--------------|-----------------------|\n| Wheat   | 35         | 134                 | 3½           | £2 14 0               | £361       |\n| Barley  | 35         | 167                 | 4½           | 2 1 6                 | 317        |\n| Oats    | 31         | 219                 | 8             | 1 3 7                 | 294        |\n| Peas    | 5          | 14                  | 3             | 1 18 6                | 27         |\n| **Total** | **106** | **564**             |              |                       | **£1029** |\n\n2.—Season, 1881-2.\n\n| Acreage | Yield, qrs. | Yield per Acre, qrs. | Price per qr. | Total Value of Produce |\n|---------|------------|---------------------|--------------|-----------------------|\n| Wheat   | 40         | 100                 | 2½           | £2 2 0                | £210 0     |\n| Barley  | 18         | 51                  | 3             | 1 11 0                | 95 15 0    |\n| Oats    | 28         | 252                 | 9             | 1 2 0                 | 277 0      |\n| Peas    | 20         | 40                  | 2             | 1 15 0                | 70 0       |\n| **Total** | **106** | **416**             |              |                       | **£618 15 0** |\n\nThis return includes tail corn averaged with the rest. The yield per acre does not go into fractions, but the total value of produce is quite accurate. Put another way, we find that wheat yielded £10 8s. 9d. per acre in 1876-7, and only £5 5s. in 1881-2; barley, £9 17s. 1d. in 1876-7, and £5 2s. in 1881-2; oats, £9 8s. 8d. in 1876-7, and £9 18s. in 1881-2; peas, £5 8s. in 1876-7, and £3 10s. in 1881-2. The average return from all crops per acre in 1876-7 was £9 14s. 5d., and in 1881-2 it fell to £6 2s. 3d.; the difference being £3 12s. 2d. It is noticeable that the price of corn was higher in the good year than it was in the bad one. And this illustrates the great disability under which our agriculturalists labour. It is evident from these statistics that a rebate of 10, 20, 25 or even 50 per cent. on the rental, does not touch the main difficulties. The situation must be faced, and agriculturalists will have to admit the improbability of their being able to compete with new lands in growing corn.\nThe Earl of Carnarvon recently advised feeding sheep on oil-cake to enable them to resist the deleterious influence of the present wet season, pointing out the loss which will otherwise accrue to the farmer from the ravages of \"rot\" among his flocks. Very good advice, but of little value to the impoverished agriculturist, who is overburdened with rates and taxation from which his landlord is practically exempt. It reminded me of the suggestion of our revered monarch King George III.—who some believe would have made a better farmer than king—when the people were starving. Told that they could not buy bread,\" the king is said to have replied, \"Well, let them buy biscuits.\"\n\nIn 1882 we paid £34,237,099 for imported wheat, and £10,631,982 for flour; £5,541,498 for barley, and £6,522,070 for Indian corn, making a total of £56,902,599 for breadstuffs, barley and Indian corn. We paid £6,224,909 for bacon, £1,862,495 for lard, £11,339,226 for butter, £4,742,867 for cheese, £2,381,882 for eggs—a total of £26,550,821 for what may be termed dairy produce. Imported potatoes cost us £998,876 and we also imported other vegetable and fresh fruit largely. Imported cattle, cows, sheep, and swine cost us £9,110,771. In view of the unequal contest between the English tenant farmer and the settler on the prolific wheat regions of the New World, our agriculturalists might with advantage turn their attention to the extension of dairy farming, to vegetable and fruit growing, and to the increased production of beef, mutton, and bacon with better chances, against their foreign competitors. It is certain that large and substantial measures of relief will have to be applied to this important class, and even then farmers must avail themselves of every appliance and improvement calculated to advance their position and prospects, or they will go to the wall.\n\nI mentioned the agricultural labourer as indirectly bearing with the farmer the risks attendant on agriculture in this country. That is so. He suffers in diminished wages, and when the worst comes to the worst, he goes on the parish at the expense of the community. And I will take this opportunity of saying that no class in the community works harder for poor remuneration, or deserves better than the agricultural labourer. My experience leads me to the opinion that he is industrious, thrifty, and intelligent in all that relates to his calling. He acquires skill and experience of great value to the community, but of little pecuniary advantage to himself. If he is not enlightened and educated, that is not his fault. Bred on a farm myself, I can speak of the labourer as I knew him in Buckinghamshire a quarter of a century ago. The men employed by my father were an intelligent, hardworking set of fellows, who did a fair day's\nwork without the amount of supervision necessary in some other callings. Some of them were skilled as rick builders and thatchers, others as hedgers, others as stock-men, and all were decent, respectable, self-respecting men. I have known one of them, when engaged late on piecework in the spring, to work in his own garden by lantern light, after he reached his cottage! If those I have subsequently met with have not appeared to be quite so thrifty or worthy, that may result from the lessened opportunities I have had of becoming thoroughly acquainted with them. But I am not one of those who view with alarm the proposed admission of this class to the rights of citizenship. They are quite as well qualified to vote as many who now possess the franchise; and very much better than some. These men are useful citizens. Goldsmith called them \"their country's pride,\" and Sir William Jones declared that \"they constitute a State.\" We don't know their full value; and when we allow them to emigrate to foreign countries we make handsome presents to the lands of their adoption. If our own Colonies present sufficient advantages and attractions to the agriculturalist who, disheartened by the condition of things at home, is casting about for a new land in which to settle, then the Empire manifestly gains. The emigrant retains his citizenship, and our Sovereign retains her subject: the change being one to the mutual advantage of the State and the individual. Believing that equal, if not superior advantages are now presented by the newly-opened up\n\nBRITISH NEW NORTH-WEST\n\nto those which any foreign country can afford, I have undertaken to briefly present some of the more striking features of that wonderful land this evening.\n\nThe Dominion of Canada, excluding Newfoundland, which, by its own desire, remains a Crown Colony, extends from the Atlantic to the Pacific Ocean. It is about equal in size to the United States, and comprises some 3,470,000 square miles. Its population in 1881 was 4,324,810. We cannot stay to examine the condition and prospects of the older portions of Canada. If the progress there has not been so rapid as might have been expected, at least it has been of a steady and substantial character. Its corn, fruit, fish, and meat have for years found a ready market in the old country; but the recent opening up of vast tracts of prairie land—at one time belonging to the Hudson's Bay Company, and which were generally regarded as being only useful for hunting and the production of fur—has brought Canada to the front among the eligible places for Emigrant occupation. Since the transfer in 1870, from the Company to the Dominion Government, settlement has rapidly pro-\nceeded. Then there were no means of railway transit, no post office or telegraph systems, no towns, and but few villages. The province of Manitoba, forming the eastern portion of the North-West, has fittingly been called the Gateway to the New Territory, which extends right away to the Rocky Mountains, a distance of 1,200 miles. This immense plain is naturally broken into three great divisions. At the south-eastern extremity (Emerson) it is 700 feet above the level of the sea; it gradually rises until an altitude of nearly 4,000 feet is reached at the base of the Rocky Mountains. The area of the Territories is 2,665,252 square miles (or 1,705,761,280 acres). Of this land it is estimated that about 200,000,000 acres are fit for tillage, while 50,000,000 acres are admirably suited to grazing and stock raising purposes.\n\nThe vast area west of Manitoba and east of British Columbia was, by an Order of Council last year, divided into four districts or territories. The five North-Western Territories consequently are—\n\nManitoba (123,200 square miles).\nAssiniboia (95,000 square miles).\nAlberta (100,000 square miles).\nSaskatchewan (114,000 square miles).\nAthabasca (122,000 square miles).\n\nThe greater portion of the country has been surveyed and divided into townships of six miles square.\n\nThe following is a summary of the latest regulations for the disposal of public lands in the Canadian North-West Territories:\n\nThe country is surveyed into \"townships\" of six miles square, each containing thirty-six square mile lots or sections. These sections are numbered consecutively one to thirty-six; two in each township are reserved to defray the expenses of education, and are sold by auction from time to time, and two others belong to the Hudson's Bay Company, which Corporation offers its lands for sale at prices ranging from 14s. to 21s. per acre, on deferred payments. The London office of the Hudson's Bay Company is at 1, Lime Street, E.C. For twenty-four miles on each side of the railway (now being made) across the continent, the remainder of the odd-numbered sections in each township belong to the Canadian Pacific Railway Company, who dispose of their large land grants on favourable terms of purchase. Full particulars can be obtained from the London offices of the Company, 101, Canon Street, E.C. The remaining even-numbered sections in each township (sixteen) are held exclusively by the Government for free grant and pre-emption purposes. These sections are each sub-divided into four quarter sections of 160 acres, two being available for free grants, and two for pre-emptions. Any male or female who is at the head of a family, any male member of a family 18 years old, or any other person who has attained that age, can obtain a free grant of 160 acres, and can also make an entry for pre-emption rights to the adjoining 160 acres at the Government price of 2 dols. 50c. per acre, payable in cash at the end of three years. For office fees to cover the cost of survey, docu-\nments, &c., a charge of 10 dols. is made in each case at the time of entry. Outside the railway belt alluded to above, the even-numbered sections are also held for free grants and pre-emptions, the odd-numbered being designated \"public lands.\" Such pre-emptions and public lands are offered for sale by the Government at 2 dols. per acre, the money in the former case being paid at the end of three years, and in the latter at the time of purchase. The title to the free grant is given at the end of three years. The conditions to be fulfilled are: residence on the land six months annually for the three years; the erection of a house; and the general cultivation of the land, but the settler is not bound to put any specified quantity under crops.\n\nSettlers having no wood on their lands are permitted to purchase timber lots in area not exceeding 20 acres, at 5 dols. per acre, for cash.\n\nSpecial and advantageous arrangements are made for the sale of tracts of land to companies or to individuals having in view the colonization of the country, upon certain conditions, with powers of protection for advances made to settlers on free grant lands to the extent of £100.\n\nNumerous accounts of the New Territories have been published; the most comprehensive and exhaustive being \"Manitoba and the Great North-West,\" by Dr. John Macoun, for nine years Government explorer of the region. I am indebted to Dr. Macoun for much of my information regarding the North-West. His chief positions are, however, amply supported by official or independent testimony.\n\nThe Soil\n\nIs a very rich alluvial deposit, of extraordinary depth. It is extremely fertile, and much of it is especially adapted to wheat growing. The experience of farmers has quite confirmed the theoretic excellence of the soil as disclosed in the following analysis of Dr. Macadam, of the Edinburgh University:\n\nAnalytical Laboratory, Surgeon's Hall,\nEdinburgh, 14th December, 1876.\n\nAnalysis of Sample of Manitoba Soil.\n\n| Moisture | 21·364 |\n|----------|--------|\n| Organic matter containing nitrogen equal to ammonia, 23 | 11·223 |\n| Saline matter: |\n| Phosphates | 0·172 |\n| Carbonate of lime | 1·763 |\n| Carbonate of magnesia | 0·937 |\n| Alkaline salts | 1·273 |\n| Oxide of iron | 3·115 |\n| Total | 7·560 |\n\nSilicious matter:\n| Sand and silica | 51·721 |\n| Alumina | 8·132 |\n| Total | 59·853 |\n\n100·000\n\nThe above soil is very rich in organic matter, and contains the full amount of the saline fertilizing matters found in all soils of a good bearing quality.\n\n(Signed) Stephenson Macadam, M.D.,\nLecturer on Chemistry, &c.\nIt will be seen from the analysis that the soil is rich in organic, saline, and silicious matters, and is of unusual depth. The silica, which exists in a large proportion, indicates that the soil is specially adapted to wheat growing. An official examination of its nature and depth has been made every 20th mile for 1,200 miles, and the results, which are unexampled, have been published by the Canadian Government. About 100 farmers have also given information regarding its depth on their lands. Some speak of its being black loam, from 4 to 5 feet in depth; one states that he has dug down 12 feet without reaching the bottom; the general depth averages about 18 inches. The great fertility of the land is attributed to three causes: the droppings of birds and animals on the plains, the ashes left from the annual prairie fires, and the accumulation of decayed vegetable matter.\n\nWith such a rich soil it is not to be wondered at that manures are not as a rule needed. It is said that in some of the earlier Red River settlements as many as eighteen successive crops of wheat have been grown without its use. But a wise system of farming will restore to the soil the elements abstracted from it by the growing plant, before signs of exhaustion set in. On land, however, such as we are describing, the manure question will not become an important one for many years to come, and this is a great advantage to the pioneer farmer who, as owner of the land he tills, has every inducement not to work it to the point of exhaustion. Remarking on the practice which obtains among some of the farmers of burning the straw as soon as the corn is threshed, Mr. C. S. Read observes that the ashes of these fires make no perceptible difference to the next year's crop, an evidence of the native richness of the soil, and its present independence of manure.\n\nThe General Produce of the North-West embraces peas, barley, oats, rye, potatoes, flax and hemp, beetroot, turnips, onions, and cabbage, all of which flourish, some in an extraordinary degree. Beans, including the famous haricot, arrive at great perfection. We read of cabbages weighing 49 lbs. each; carrots weighing 11 lbs. each; turnips 32 lbs. each (and 1,000 bushels per acre), and potatoes 4 lbs. each. Fruits do not yet present a very wide range; but strawberries, whortleberries, cranberries and plums abound, and the apple and other fruits are being introduced with success. Salad plants flourish and bees thrive well.\n\nThe Wheat Yield is extraordinary. Throughout the North West it averages from 25 to 30 bushels per acre, while in individual cases it\nThe Yield in Canada and in the United States.\n\nrises to 40 and 46; and the bushel weighs from 58 to 66 lbs. By comparing these figures with the yield in celebrated wheat growing districts in the United States, it will be seen that the Canadian land of promise distances by far the most prolific of them. Taking the averages, we find—\n\n| State          | Average Weight |\n|----------------|----------------|\n| The Canadian North-West | 26 bushels per acre, 66 lbs. |\n| Minnesota      | 17 \"           |\n| Massachusetts  | 16 \"           |\n| Pennsylvania   | 15 \"           |\n| Wisconsin      | 13 \"           |\n| Iowa           | 10 \"           |\n| Ohio           | 10 \"           |\n| Illinois       | 8 \"            |\n\nThe average yield of wheat in 1881 in the United States, as given in the returns published at Washington, was 10-1 bushels per acre. Some of the older Eastern States of the Union must produce very light crops indeed to bring the average down to so low a point. Professor Macoun gives, in a tabular form, the returns supplied to him by farmers in the North-West showing the yield per acre for four years (1877-80), and they fully bear out the average yield as before stated.\n\nBarley.\n\nIn addition to the area suitable for wheat, at least 100,000,000 acres are said to be adapted for barley, a grain of great value for feeding purposes. According to the returns of the agriculturists quoted by Dr. Macoun, the yield for 4 years ranged from 20 to 70 bushels per acre; the average yield being 40 bushels of 52 lbs. weight per acre. Compared with the returns from the chief States of the Union, the following is the result:—\n\n| State          | Average Weight |\n|----------------|----------------|\n| The Canadian North-West | 40 bushels per acre. |\n| Minnesota      | 25 \"           |\n| Iowa           | 22 \"           |\n| Wisconsin      | 20 \"           |\n| Ohio           | 19 \"           |\n| Indiana        | 19 \"           |\n| Illinois       | 17 \"           |\n\nOats.\n\nThe crops of oats are luxuriant and abundant. The yield for the same period ranged from 15 to 100 bushels per acre, the average being 60 bushels of 38 lbs. weight per acre. The comparison with America is as follows:—\n\n| State          | Average Weight |\n|----------------|----------------|\n| The Canadian North-West | 60 bushels. |\n| Minnesota      | 37 \"           |\n| Iowa           | 28 \"           |\n| Ohio           | 23 \"           |\n\nMaize has also been grown successfully in some parts.\n\nThe American Consul at Winnipeg recently forwarded to this country four samples of wheat grown in the North-West\nwhich have been on view at the office of the Toronto Globe, 86, Fleet Street. The first specimen was from Fort Dunvegan, a post on the Peace River, 1,200 miles north-west of Winnipeg. It was Scottish Fyfe wheat, sown May 1st and harvested August 20th, 1882. The second was from Fort Saskatchewan, near Edmonton, 1,000 miles north-west of Winnipeg. The third was from Battleford, 700 miles north-west of Winnipeg; and the fourth was from Fort Pelly, 300 miles north-west of Winnipeg. The first sample was the best, but they were all good. They have excited so much interest, and so many persons have begged small quantities that only a few grains of each remain. In order, however, that you might have some specimens before you, I applied to Mr. Alexander Begg, the representative of the Canadian Pacific Railway in London, for the loan of samples on view at the offices of the company; and by his courtesy you are enabled to see and examine wheat, barley, oats, peas and grass seeds grown in various parts of the Territories.\n\nGrass and Hay\n\nare necessities to the farmer. Without hay he would not be able to feed his cattle or horses in the winter. The prairie hay is said to be plentiful and very rich in nutritious qualities. Professor Macoun enumerates 96 varieties of grass, several of which are remarkable for luxuriosness of foliage. They have but little stem, but are prolific in leaves. The value of this will at once be apparent to those skilled in\n\nStock Raising.\n\nWhile it is possible our home supplies of meat will be increased owing to large areas of land at present under cultivation being in future laid down as pasture, the question of supplemental supplies is of considerable importance. In recent years we have looked to the United States as the chief stock-raising country. Australia and New Zealand possess great natural advantages, but their distance from us has hitherto proved a barrier to anything like large importations in a marketable condition. The Canadian North-West, as a field for stock raising, has been hitherto overlooked. There, however, we find in an eminent degree the necessary conditions for that important pursuit. It is estimated that there are at least 50,000,000 acres of pasture land admirably adapted for stock-raising and sheep farming.\n\nMr. A. Begg, who has thoroughly explored the country, contributes a very interesting chapter to Professor Macoun's book on this subject; and his previous experiences as a practical Canadian farmer qualify him to speak with something like authority on stock-raising. He is well acquainted with the principal cattle-ranch districts in Montana and Texas, and he carefully compares their capabilities with those of the\nnewly opened up Territories. His statements deserve, and will no doubt receive, the attention and consideration of English stock farmers. The Bow River district, lying east of the Rocky Mountains, contains \"the best pasture lands belonging to the Dominion of Canada.\" Tracts of rich grazing lands extend eastward for over 100 miles to the Cypress Hills, and northwards to North Saskatchewan, Athabasca, Peace, and Mackenzie Rivers. Winter is reported to be milder in this district than in Montana. Cattle owners from the latter place, who have resided in the Bow River district for several seasons, some of whom have raised stock west of Fort McLeod and north as far as Calgary, declare the superior advantages of the new Territories.\n\nThe following quotation gives the present position of this pursuit:\n\nStock raising in this region is only in its infancy. Up to April, 1881, the number of cattle in the Bow River district only amounted to about 3000; since then, up to spring, 1882, they have increased by importation and the formation of new ranches to nearly 15,000. By spring, 1883, it is expected the number will reach 75,000. 300 breeding mares were imported by the \"Cochrane Ranch Co.\" in 1881. This progress is considered satisfactory. The cattle have so far wintered out remarkably well. None were lost through severe weather during the winter of 1880-1 in the Bow River district, although many perished in Montana and farther south.\n\nOf this immense tract of pasturage, and its adaptability for stock raising, it is stated:\n\nThe natural features of the country are most favourable. Nutritious grasses in the greatest abundance, up to the base of the snow-capped \"Rockies,\" penetrate gorges which frequently open into valleys walled in by perpendicular cliffs, or grow in lonely glades amongst evergreen spruce and other trees which clothe their lofty sides. Sheltered ravines leading from the bottom lands or valleys of creeks and rivers, to the higher levels of the prairie, afford ample protection from storms when they occur. \"Chinook Winds,\" from the Pacific coast rush through the Kootanie, Crow's Nest, Bow River, and numerous other passes along the head waters of hundreds of crystal streams and around the ends of longitudinal ridges, which divide the mountain ranges, forming channels or conductors for those warm winds to increase the temperature and dissolve the snow as if by magic.\n\nThe writer directs attention to sheep farming, which has not yet been tried in the Bow River district. He holds that the industry could be made as successful there as it is in Montana, where an experiment in sheep farming returned a profit of 35 per cent. the first year, 47 per cent. the second year, and 60 per cent. the third year. He says, and practical farmers whose flocks suffer so much from our wet seasons, damp atmosphere, and swampy soil, will be able to appraise the value of his statements:\n\nOur mountain spurs and ridges, with their fine succulent grasses, pure water, gravelly creeks, and dry atmosphere, are peculiarly adapted to sheep husbandry, and under whose conditions a healthier stock and better wool is obtained than the soil and climate of lower lands can produce. The principal conditions of a sheep ranch are shelter, water,\nand dry grazing grounds. Sheep love a dry climate, and the higher and drier the soil, the better it is for them.\n\nThe Canadian Government is leasing these grazing lands, which are situate in the Alberta Territory, as ranches, for the term of 21 years, at the nominal rental of 1c. per acre. Under the conditions 10 acres of land are allowed to each head of cattle, the stock must be on the ground within three years of the date of the lease, and such tracts of land are in no case to exceed 100,000 acres in extent. Dr. Macoun quotes from a lecture of Professor Brown, delivered before the Farmers' Club, at Markham, Ontario, December 6, 1881, advice regarding the selection of stock, and the methods to be followed in successful ranching, of great value to those who take up the industry. He also quotes an estimate of the cost and probable returns of an experimental ranch of 2,000 acres. The capital required Professor Brown sets at something under £4,000, and this provides stock, plant, homestead, farm implements, &c., and maintenance and labour for two years. The net increase at the end of two years and a half he estimates at £2,400—a very handsome return on the capital, skill, and labour expended. We are reminded that \"a bite of hay\" is necessary, in addition to the \"keep\" during the severer parts of winter. Probably experience will demonstrate the practicability of preserving fodder in a green state for winter use by what is known as the Ensilage process. In the Eastern States of the Union, and in the dairy districts, maize, rye, and other grasses are successfully preserved in this manner, and the food is found to be of so much value that milch cows fed on it give an equal quantity of milk in winter to that given in summer, while store cattle are kept in good condition. Professor Rogers, M.P., in his valuable lecture before the Society of Arts last week, thus summarised the advantages of Ensilage:\n\nThe use of a silo secures the farmer from the caprice of the weather, gives him what is practically identical forage all the year through, serves him with an agricultural saving, enables him to increase his stock four-fold, and to fertilize his land indefinitely, and all this at greatly diminished cost.\n\nIf the Ensilage process can be introduced into the North-West with advantage, it will most likely be resorted to. Dr. Macoun gives other estimates of the results of stock raising, which show a still greater profit. He strongly recommends that provision should be made for winter food, because the loss to the stockowner from one exceptionally severe winter might be greater than the cost of cutting hay for ten years.\n\nHe also advises that herders and caretakers should be properly housed, and made as comfortable as possible. And in concluding his interesting paper he says:\n\nThe Canadian North-West, from its situation and advantages, it is evident, is destined to become the chief stock-raising country in America.\nThe Bishop of Saskatchewan on Stock Raising.\n\nIn a few years it will be difficult to find a vacant range in Wyoming, Nebraska, or Montana, suitable or capable of sustaining 5,000 head of cattle. The Dominion of Canada, on the other hand, has \"limitless\" ranges waiting to be taken up and occupied.\n\nThe meat made on the slopes and plains eastward of the Rocky Mountains, when the Canadian Pacific Railway is completed, and the suggested line of steamers from Hudson's Bay to Liverpool are running, will be quickly and cheaply brought to our markets, and prove perhaps the most valuable additions yet made to our own supplies.\n\nThe Bishop of Saskatchewan, at his recent lecture before the Colonial Institute, said on this subject:\n\nIt is an understood thing that there will be no difficulty in making use of the Saskatchewan river for conveying heavy freight, such as wheat and dead meat, down the river, until you come to the Grand Rapids, where they will be transported across by tramway into Lake Winnipeg. The course of the railway will be only 350 miles. That railway will convey the freight up to Churchill, and it will be shipped from there and carried through Hudson's Bay right over to Liverpool. This is an important question. Hudson's Bay is just 1,000 miles long; it is 600 miles wide, with an area of 500,000 square miles. It drains three millions of square miles of country, and is free from shoals, reefs, and rocks. There are Hudson's Straits. They are 500 miles long. There is a strong tide and current there, which has a tendency to break up the ice and let the steamers pass. And it is beyond question that these straits are open to steamers three or four months in the year. What is the conclusion to be drawn from this? In the first place the Churchill harbour has a very fine channel at its entrance, half a mile wide. It is 12 fathoms deep; and it can float vessels drawing 30 feet of water. That harbour is just midway between the Atlantic and the Pacific. It may be at first sight difficult to believe, but it is still a fact that Churchill harbour is sixty-four miles nearer to Liverpool than is Montreal, and it is 111 miles nearer to Liverpool than is New York, and the reason is that the meridians converge as they go north, and Churchill is in the centre of the American continent.\n\nI may add that the Bishop confirms the favourable view of the prospects of stock-raising in the Alberta Territory. He gives the following statement, made to him by a settler, remarking that it presents \"a kind of information that he did not remember ever having seen published before.\"\n\nHe (the settler) has a ranch, or farm, about two miles from the old Fort Macleod. He has 1,000 acres fenced and under cultivation. He began with 15 head of cattle five years ago and has raised 500. No stabling is required during winter, except for young and weakly calves. The cattle are very fat, even when feeding out in the winter. The snow does not lie on the ground, so that carriages with wheels are used all the winter. He raises fine pigs from milk and pasture, and all kinds of poultry thrive. The land produces good wheat, oats, and barley. If the wheat is good seed and put in early in the spring, there is not much risk from frost. He has made a successful beginning in rearing sheep—the average yield of wool from each sheep being 8½ lbs. The country here all along the rivers is well adapted for ranches (stock farms). He considers Montana the best stock-raising country in the United States, but that this country is far superior to it. He was worth only 1,000 dols. when he came here, all told. He would not sell what he has now for 10,000 dols. He has 1,500 dols. worth of farming implements alone. He\nsays that the Cochrane Company is to bring a superior stock of cattle and horses into the country. They are to begin with 3,000 head this year, and to have 10,000 head next year. A man worth 1,000 dols. should buy his stock in Montana; he would not have to pay duty, being a settler. The best time to commence is in the spring. The numerous rivers here water the country thoroughly. In Montana the rivers are farther apart—here there is a river every few miles. In Montana the rivers mostly freeze in winter; here, although they freeze, yet there are often places sufficient for stock to drink. This arises from the rapid current of the streams rushing down as they do from the Rocky Mountains. The climate is dry. In winter the cold is not felt much, owing to the light wind and pure air. The snow never lies long. The Chinook wind, which comes from the Rocky Mountains from the Pacific coast, blows it away or evaporates it; there is no thaw except in January.\n\nMineral Resources.\n\nIn his recent lecture on British Columbia before this Society, Mr. Peter O'Leary brought into prominent view the extensive mineral resources of that Province, predicting that at no distant period a Wolverhampton would arise there. Undoubtedly the mineral wealth of Columbia will be brought into requisition by the rapid development of the North-West Territories. But these territories themselves possess mineral resources, which greatly enhance their future prospects. Coal has been discovered at various points, the greatest find being a belt which averages about 280 miles in breadth, and it is calculated that 150,000 square miles are underlaid with the \"black diamonds\" to which so much of our own wealth is due. Limestone, gravel, and sand are plentiful. Clay suitable for brickmaking is abundant, and that industry is in active operation at Emerson, Rapid City, Portage la Prairie, and in other districts. Iron exists throughout the coal region, gold is found on the sand-bars of the North Saskatchewan River, and there are indications of it in the streams from the Rocky Mountains; although the truest wealth of this grand prairie land undoubtedly lies in the cultivation of the soil.\n\nRegarding coal, the Bishop of Saskatchewan, in the lecture already referred to, said, and his remarks are apposite and suggestive:\n\nI may say that in crossing the river I observed a very good coal mine. I saw a seam of coal a mile long stretching down the bank of the river and as I should judge about 9 feet thick. I observed that one of the settlers had been digging the mine; he had gone about 30 feet, and had formed a chamber like a large room. Coal above, coal below, coal on either side, coal beautiful and bright—I saw it burning. I was in Fort Macleod for some time, and the military officers who entertained me burned this coal every day. I saw no difference between that coal and what I see in England. Now, the coal in that part is simply unlimited, and all through the country there are seams of coal. Away farther north, near Edmonton, there is a seam of coal 200 miles long. I do not think it so good as the coal I am speaking about, but it is a fairly good coal. I would ask you if you do not think that there is a wonderful arrangement of Providence in this behalf? Why, the forma-\ntion of the coal is evidently the sign that the country is to be largely colonised. How came the coal? I could not help, as I took up a bit of the coal handed to me, allowing my mind to wander back through centuries of bygone ages. Philosophers tell us that on the banks of these rivers, it may be 10,000 years ago, there were waving vast forests. As these trees grew they drank in the rays of the heat and light of the sun; then came great convulsions that embedded them in the bowels of the earth; and then a great change came on—a chemical change which resulted in these very trees being turned into coal. Now, when the time comes, as it has nearly come—we are on the very eve of it—when British enterprise and capital shall have disentombed coal and scattered it by our railway system all over this magnificent region of the North-West, destined to brighten up and lighten so many hearths and homes of the English people, what would it be, I ask, but a resurrection, so to speak, of the heat and the light that came from the sun thousands of years ago—heat and light that have been buried in a sepulchre from which English enterprise has rolled back the stone?\n\nAnother source of food supply should not be overlooked. The lakes and rivers swarm with fish. The jack is found weighing from 6 to 30 lbs.; trout, from 5 to 30 lbs.; white-fish, from 3 to 11 lbs.; pickerel, sturgeon, and many other varieties of fish, of great value as food, are plentiful. River ducks, plovers, pigeons, prairie chickens, gulls, and other wild fowl are abundant in some districts, affording sport and sustenance to the settlers. And although the buffalo is practically extinct, there are a good variety of animals, some of which are of value as food; while all of them are appreciated by the sportsman. The grizzly bear and the great grey wolf are really formidable antagonists, but they do not willingly come into contact with man.\n\nClimate, Water Supply, and Fuel.\n\nSome 200 agriculturists, settled in the Provinces, have testified to certain facts regarding the soil, climate, and resources of the country, and their statements have been published in a report issued by the Canadian Government. Undoubtedly, after all, health is the truest wealth, and the North-West is declared to be healthy by the unanimous voice of the settlers. The report pertinently remarks that:\n\nOne of the most desirable features in a country is to have a healthy climate. What matters to a man to have untold wealth and prosperity presented before him, if in order to enjoy them he has to jeopardize his own life and the lives of his family. He will rather go to a poorer country and enjoy good health. The North-West, however, is particularly favourable in this respect. Epidemics are not prevalent as in other countries, nor are there any diseases peculiar to the country. In spring the weather is uniformly pleasant, the summer warm with cool refreshing nights, and the winter, owing to the dryness of the atmosphere, is particularly healthy and bracing.\n\nIn April the sun exerts a powerful influence. The snow and frost rapidly disappear before it, the land quickly dries and is ready for the plough. Ploughing and seeding go on simultaneously, and every hour of daylight is utilized to the utmost. What is known as the wet season occurs in the month of\nJune. Under the combined influence of sun and shower the crops grow and mature with rapidity to which we are strangers. Fine weather sets in early in July, and continues throughout August, enabling harvesting operations to be proceeded with uninterruptedly. It must be a new sensation to the English farmer settled in the Canadian North-West to be relieved of the anxieties and annoyances occasioned by our own fickle and uncertain climate during harvest. In this respect the New Provinces are highly favoured indeed. They have practical immunity from wet during the harvest season—in itself a great advantage to a grain-growing district.\n\nThe mean temperature at Winnipeg in June, July, and August is $62^\\circ$; at Penzance, in Cornwall, during the same period, it is $60^\\circ$. Summer heat is usually about $76^\\circ$, although the thermometer occasionally rises to $100^\\circ$, but the nights are cool. In winter the temperature sometimes falls to $30^\\circ$ or $40^\\circ$ below the freezing point. It is a singular fact, however, that Europeans do not feel the cold as much as Canadians do, and this is most likely in consequence of the dryness of the atmosphere.\n\nOne of the most important factors in regard to health is a good water supply, which the Territories enjoy in a peculiar degree. To the home this matter is of first importance. The housewife will lose her temper, the children will be dirty and neglected, and everything will go wrong, if the water supply be short. For the farmer and stock-raiser too the water question is of equal moment. Rivers, streams, lakes, and lakelets abound; but when these are too far off, or the water is brackish, as some of it is, a constant supply of pure water may be had by digging 8 or 10 feet into the earth.\n\nNext in importance to water in the house come wood and fuel. Wood can always be had by good management. In some districts it is scarce, but a few miles of carriage is the only real difficulty. Settlers, in selecting plots, should, however, choose situations near growing woods. The grain farmer knows that it is more to his advantage to have prairie land, rather than woodland, to bring into cultivation; and it is much easier for him to fetch his fuel 20 or 30 miles even than to have to clear his farm. The general testimony of the resident farmers is, however, that \"wood is plentiful;\" but it has to be fetched a few miles. Timber fit for building has to be brought longer distances, but in many parts of the Provinces even that is plentiful enough. There is an extensive Wood-section stretching from Red River eastwards to Lake Superior, and there are also immense forests in British Columbia. The timber trade is already a flourishing industry, and extensive Saw Mills are in active operation.\n\nOur time has been occupied in glancing chiefly at the agri-\nWinnipeg.—The Canadian Pacific Railway.\n\ncultural capabilities and prospects of the New North West. Agriculture cannot progress, however, without other industries and callings flourishing with it. Every kind of useful art is consequently called into requisition in the new country. Cities, towns, and villages are springing up with astonishing briskness.\n\nWINNIPEG,\n\nthe chief city of Manitoba, has rapidly risen from a fort and a cluster of huts in 1870 to an important centre of industry. In 1870 its population was 215; now it numbers 20,000. It is built at the junction of the Red and Assiniboine Rivers, and it is well laid out with wide and handsome streets. It is already able to boast of elegant buildings, and others are projected or in progress. It has schools and churches quite equal to the needs of the place; and a university and three large colleges have been established. From its stores, furniture and household requisites, wearing apparel, and food can be purchased. Its institutions supply the inhabitants with all the arts of refined life. It will interest Mr. Edwin Chadwick, and other sanitarians, to learn that a sanitary association has been formed at Winnipeg, to ensure a complete system of drainage; and that the Hudson's Bay Company have made a grant of £100 to enable the services of a competent sanitary engineer to be secured. Two daily papers are published at Winnipeg. Over a dozen steamers ply the river, and a regular service of trains is established. Among other flourishing towns in the North-West, Emerson, West Lynne, Morris, Selkirk, and Gladstone may be mentioned.\n\nThe Canadian Pacific Railway\n\nwill run through the entire country connecting the Atlantic with the Pacific. It supplies an element essential to the success of a new grain-growing country; since without the means of transit to the markets of the world, the most fertile soil will be of little value. In accordance with the terms of purchase of the tract of land from the Hudson's Bay Company, the Canadian Government undertook to connect the Pacific Province with the eastern portions of Canada, and the works were to be completed within ten years of the date of purchase. After entering upon the work, the government saw that it could be completed more successfully by private enterprise, and accordingly it entered into an agreement with the Canadian Pacific Railway to construct the line. As a subsidy, the Government handed over to the Company the works in progress, 25,000,000 dollars, and 25,000,000 acres of land. It is thus that the Railway Company are part owners of the New North-West.\n\nThe progress of the line has been unprecedented in\nRailway history. The main line has been constructed 600 miles west of Winnipeg, and is being pushed forward at the rate of 3½ miles a day. When completed its branches will intersect the country, tapping the principal grain-growing districts. By a recent return I find that the present position of this gigantic undertaking is as follows: 347 miles of line from Montreal to Callander are completed, and the track is laid to Sturgeon River, a further distance of 40 miles. From Sturgeon River to Thunder Bay, a distance of 610 miles, the line will be completed in 1886. The important section connecting Thunder Bay with Winnipeg, 485 miles in length, is now completed and in operation, although the line will remain in the hands of the contractor until the spring of 1883, when it will be handed over to the Canadian Pacific Railway Company. From Winnipeg westward to Swift Current, a stretch of 512 miles, the line is completed, and the track is laid a further 94 miles. It is fully expected that the 325 miles of line from thence to the base of the Rocky Mountains will be completed this year; and that by 1885 the line will be finished to the Pacific terminus, Port Moody. The rapid development of the North-West is largely, if not entirely due to the opening up of the country by the Canadian Pacific Railway. The rivers and lakes also supply an important means of water carriage, forming as they do an aggregate of 6,305 miles of navigable water.\n\nTime altogether fails to allow the numerous advantages of those territories to be stated; but it is only fair to ask, is there not another side to the picture?\n\nOf course there is. I have not been speaking of Paradise, but of a part of this old earth. But if any portion of it possessed all the advantages of the New North-West, without any drawbacks, Paradise would be regained in this present existence. That, however, was not intended by the Creator, who placed man on the earth to subdue and cultivate it.\n\nDifficulties and Drawbacks\n\nthere are, and it is well to bear them in mind. The climate at times is severe. It has long been our habit to regard Canada as a small Siberia; but the climatic difficulty, like many another lion in the way, diminishes as we approach it. As before stated, settlers give a very good account of the climate. Of all the farmers who testify to its general healthiness only two say, \"It is hard on consumptives.\" Against that I will quote from a letter in the Edinburgh Scotsman, October, 1881, by Dr. Bryce, who says:\n\nThe dryness of the climate and the clear air are taken advantage of frequently by consumptives, who come from other parts of America and are cured. I can name several persons of my acquaintance who, on coming to the country, were said to be far advanced in con-\nsumption, and who have now recovered. The dry, clear air gives an elasticity to the frame, noticed by all who visit the North-West. As to the sensation of cold, I have stood outside with hands and face uncovered, and throat bare, looking at the thermometer registering ten degrees below zero, and have had no feeling of discomfort whatever. It is in my recollection of having driven my sleigh to a country parish about fifteen miles from Winnipeg on a Christmas day, and of having been engaged in visiting from house to house all the day with the thermometer standing at 40° below zero. The horse was left outside in most cases, simply with the buffalo robe thrown over him, and suffered nothing; while myself and driver, though going in and out from cold to hot and hot to cold, felt no inconvenience.\n\nThe fact is, either extreme heat or extreme cold can be borne easily and without discomfort, when the atmosphere is dry and still. The Turkish bath is a good illustration of the former. I have remained for several minutes in one of the hot rooms at Jermyn Street, heated to above the boiling point, without any ill effects. But if any moisture had been there a temperature lower by 50 could scarcely have been endured. A Canadian winter illustrates equally well the facility with which a cold dry atmosphere can be not only borne but enjoyed.\n\nPrairie fires are another drawback. The most stringent regulations are in force against the practices which lead to them, and settlers are fully instructed how to protect their holdings from these perils. As the land is brought into cultivation, however, the chances of this kind of disaster will diminish, and the fires will belong to the things of the past.\n\nReptiles are neither very troublesome nor dangerous. A species of the rattlesnake is said to be found near the forks of the Bow and Red Deer Rivers; but Dr. Macoun failed to find any. Lizards infest some regions, but they are not venomous. Toads and frogs are general.\n\nAmong insects, the mosquito, and a fly named by the half-breeds \"the Bull Dog,\" are real plagues, causing great irritation to man and beast, principally in July. They are mainly confined to the neighbourhoods of swamps and low-lying districts. By day, a bird known as the cowbird, follows man and cattle, riding on the backs of the cattle and horses, and they catch the flies as they settle.\n\nThere is very little danger to human life from wild animals. The grizzly bear is no mean antagonist, but he seldom or never acts offensively; and the hunter must take the chances of the chase. The panther, lynx, and prairie wolf never attack man. These animals, together with the skunk, badger, fox, moose, and hare, afford sport for the hunter, and are by no means to be wholly regarded as drawbacks.\n\nIndians are considered by some as a drawback. I do not so view them. They are quite tractable and amenable to kindness, and fair treatment which they have not always received from our people. They trust a Canadian or an Eng-\nlishman, but they distrust a Yankee. Hence while travellers from the South are in danger of molestation, those from the North are perfectly safe. The Americans crossed the boundary with their spirits and demoralised the red man, but the Dominion Government has stepped in and the spirit trade has been declared illegal. The Bishop, in his lecture, thus speaks of the Indians:\n\nWithout the least exaggeration, I venture to say that there is no part of her Majesty's dominions where an unprotected traveller can pass to and fro with more perfect safety than through this very Indian country of the great North-West. And I attribute this very largely to a most wise provision of the Dominion Government. They knew that the poor Indian could not withstand the temptations and seductions of strong drink, and they passed a law making it criminal for any white man, on any pretext whatever, to give strong drink to the Indian. They make it criminal to take strong drink into the country without the express licence of the Government; and the result has been that whereas formerly the Indians were in a continued state of poverty and beggary, and almost on the point of famishing, now they are beginning to acquire property. This was well illustrated by one of the chiefs, who said: \"We are very thankful to the white man's government for keeping the whisky traders out. We are not able to resist the whisky: bring it in and we must drink it. Keep it out and we are safe, and we thank you for keeping it out. There are some of my tribe on the American line, where they are allowed to buy whisky, who are very poor; they have no horses or robes, whereas we can show our kindred our horses and cattle, and how well we have prospered, and if they were wise they would no longer deal with whisky any more than we are doing now.\" The principle on which the Dominion Government acts is this: that these Indians are unable to care for themselves in the matter of drink, they cannot stand it. It is too tempting for them, and therefore the Government steps in wisely and forbids the traffic.\n\nIn some districts the Indians are taking to agriculture. They pride themselves on the success they achieve, and already a spirit of emulation has taken root among them.\n\nTaking into account these drawbacks—what are they as against the advantages? Nothing; they fade away, or rather they may be reduced to a minimum by spirit, energy, and determination. Difficulties are useful; they give a zest to life. Without them existence would be dull and monotonous—devoid of much of its interest. Looked at fairly, the Canadian Territories offer advantages to be found nowhere else. Immense tracts of fertile land are there awaiting the hand of man. Our countrymen should step in and take possession.\n\nThe delegates appointed by English farmers to investigate the resources and prospects of the North-West have favourably reported of it as a land of promise.* It is not to be wondered at that unfavourable reports are circulated. These come from persons interested in the settlement of other lands, or from the ne'er-do-well class who expected to reap\n\n* Extracts from the Reports of Professor Sheldon and Mr. Anderson are given in Appendix.\ngolden harvests without an effort. Such persons were aptly described by His Excellency the Marquis of Lorne, in his speech at Winnipeg, when he said:—\"They have been failures in their own country; they are failures here, and they will be failures wherever they may go.\"\n\nAgriculturalists can migrate to the New North-West with the greatest benefit to themselves and advantage to the State. They will lay the foundation of the future success and wealth of the New Territories; and the emigration of a perceptible proportion of our agriculturalists will contribute to the settlement of agricultural difficulties at home. Those who go will be benefiting themselves and, at the same time, their friends who remain at home. The young tenant farmer will have a splendid future in the new land. And if any word of mine could reach or influence the agricultural labourer, I would urge him to make every possible effort to reach the New North-West, where his labour will be adequately remunerated, and where, by the exercise of the qualities he possesses, he will naturally become a free-holder to the extent of 160 acres. To the manufacturer, skilled artizan, and trader also, good prospects are presented—in short, men, especially young men, of every class, ready and willing to work, will find ample scope for their energies, and a fair reward for their labour, in the \"illimitable vastnesses\" of the Canadian New North-West.\n\nThe Chairman, in moving a vote of thanks to the lecturer, expressed his pleasure at having presided on the occasion. No more important question could occupy their attention. He cordially concurred in the reference made to free trade. The agriculturalist had suffered keenly from the repeal of the Corn Laws. But he would go further than the lecturer had gone. He believed free trade to be an entire mistake. Regarding the New Territories, about which so much valuable information had been laid before them, he was alive to their vastness, resources, and prospects; and with a view of making our thinkers and men of science acquainted with them, he had carried a resolution making Montreal the next meeting-place of the British Association for the Advancement of Science. He hoped, in spite of obstacles thrown in the way of that proposal, that the meeting would yet be held there, especially as the President of the Canadian Pacific Railway had promised to take the entire party through the Territories to the foot of the Rocky Mountains free of charge. Influential Englishmen would thus acquire a personal knowledge of that prolific land.\n\nThe proposal, after being seconded by Mr. George Moore, was adopted, and a cordial vote of thanks to Captain Bedford Pim was also enthusiastically carried.\nAPPENDIX.\n\nA.—NEW SETTLERS IN 1882.\n\nA supplement of the Winnipeg Daily Sun, to hand since the delivery of the foregoing lecture, contains facts and statements regarding the rapid development of the new North-West of more than ordinary interest. Printed on the spot, and circulated throughout the Provinces, its data is not likely to be inaccurate. On the authority of Mr. W. C. B. Grahame, it is stated that during the past season 44,000 immigrants have reached the New Territories. Of these 9,000 were Europeans, mostly British, although a fair sprinkling of them were Germans and Scandinavians. The United States contributed 8,500, while 27,000 were from the older parts of the Dominion. The class of settlers is declared to be superior in every respect to that of the preceding year, the only exception being the Russian refugees, who are said \"not to be worth the ground they stand on.\" It is estimated that the aggregate capital of these 44,000 settlers amounted to £2,000,000. The prospects of the further settlement and development of the new lands during the present year (1883) are declared to be unprecedented.\n\nB.—WHO WILL SUCCEED THERE?\n\nHis Excellency The Marquis of Lorne, Governor-General of Canada, in a speech delivered at Winnipeg, October 10, 1881, said:\n\nIt is well to remember that the men who will succeed here, as in every young community, are usually the able-bodied; and that their entry on their new field of labour should be when the year is young. Men advanced in life, and coming from the Old Country, will find their comfort best consulted by the ready-provided accommodation to be obtained by the purchase of a farm in the old provinces. All that the settler in Manitoba would seem to require is, that he should look out for a locality where there is good natural drainage, and ninety-nine hundredths of the country has this and that he should be able readily to procure in Winnipeg, or elsewhere, some light pumps like those used in Abyssinia for the easy supply of water from a depth of a few feet below the surface. Alkali in the water, will never hurt his cattle, and dykes of turf and the planting of trees would everywhere insure him and them the shelter that may be required. £100 should be his own to spend on his arrival, unless as an artizan he comes here, and finds that, like the happy masons now to be found in Winnipeg, he can get the wages of a British Army colonel by putting up houses as fast as brick, wood, and mortar can be got together.\n\nMessrs. Read and Pell, the Assistant Commissioners, who visited America in 1879, under instructions from the Duke of Richmond and Gordon, say:\n\nTo the young and vigorous, and the courageous, who cannot get a comfortable living in England, Manitoba offers a home that will soon provide all the necessaries of life, and in a few years of steady and well-directed toil, will probably ensure a competency, and, possibly, a moderate fortune.\nWho Should Go? Rapid Vegetation.\n\nIt may be a good country for a farm labourer to settle in, but it appears especially adapted as a field for the practical, hardworking, stalwart young farmer who has a few hundred pounds in his pocket, and who would know how to spend it to the best advantage.\n\nMr. R. H. B. P. Anderson, of Listowel, Co. Kerry, Ireland, one of the practical agricultural delegates to Canada, in his report, says:\n\nIf I am asked who ought to go to Manitoba and the North-West, I unhesitatingly say, any man who for any reason intends to emigrate to any place, and is not afraid of hard work and some discomfort for a few years, and whose family can get on for a time without the aid of female servants. Such a man will, if he has £100 or £200 in his pocket, he may expect to enjoy a prosperous and happy home in the immediate future. Anyone who cannot \"rough it,\" or dislikes having his face blotted now and then by mosquito bites, any \"ne'er-do-weel,\" or drunkard, had better stay at home, or, for the benefit of humanity, drown himself on the way out, as he has no chance of succeeding.\n\nMr. Thomas Spence, Clerk of the Legislative Assembly of Manitoba, in his \"Useful and Practical Hints,\" points out that Pruck and Muscle, united by capital, can achieve much in the new territories. He says:\n\nGreat as are the unquestionable advantages which a union of money industry possess, there is no country under the sun where unaided muscle, with a plucky purpose, reaps greater rewards than under the bright skies and helpful atmosphere of this fair land. Feeling himself every inch a man, as he gazes upon the unclaimed acres which shall reward his toil, the settler breathes a freer air, his bosom swells with a prouder purpose, and his strong arms achieve unwonted results. Any man whose capital consists on his arrival of little but brawny arms and a brave heart, may do as others have done before him, select a homestead in some of the many beautiful and fertile regions westward, and into which railroads will rapidly penetrate; after which, being allowed six months before settling upon the land, he may work upon the railroad and earn enough of money to make a start in a small way; and by the time he produces a surplus, the railway will be within a reasonable distance to take it to market;* he finds himself the proud possessor of a valuable farm, which has cost him little but the sweat of his brow.\n\nC.—RAPIDITY OF VEGETABLE GROWTH.\n\nProfessor J. P. Sheldon, of the College of Agriculture, Downton, Salisbury, one of the practice agricultural delegates to Canada, in this valuable report, says:\n\nI was in time to see the latter part of the harvesting, and I was certainly struck with the excellent crops of wheat and oats which were grown with the crudest cultivation. On the day after my arrival (September 3) I saw a new string-binder at work in a crop of wheat in the Kildonan Settlement, near Winnipeg; it was a very nice even crop, and would average, say, 25 bushels per acre of grain, whose quality was very good; the wheat was the \"Scotch Fife\" variety, not a heavy headed kind, but it was a nice even crop, the straw rather short and weak, but clear and bright, and the grain was plump, well-fed, bright, and fit for the mill at once. This crop was sown on the 22nd of May, on first prairie sod—that is, on prairie land just then ploughed up for the first time—and as such sod is very tough at first, it may be imagined that the surface of the field was rough, and that the seed had been imperfectly covered; yet the seed was sown and the crop dead ripe within a period of 15 weeks. It is, however, no uncommon thing for wheat to be twice in the bag within 90 days—that is sown, harvested, and threshed within that period. I saw also a crop of oats—\n\n* At the rate at which the C.P. Railway is being pushed forward, the railway will soon be in advance of the settler.\nwhich was sown at intervals, as the land was ploughed, from the 7th to the 17th of June; the oats were the black tartarian variety, and though not ripe when I saw it, I should say the crop would reach 45 bushels per acre. It was a strong, well headed crop, and the oats promised to be a good sample. This crop, too, was on first prairie sod.\n\nD.—MARKET GARDENING AND THE PRODUCTION OF ROOTS.\n\nMarket gardening will be a profitable industry, as, when the railway communication is completed, produce can be sent eastward and even exported.\n\nProfessor J. P. Sheldon says:\n\nOutside the city of Winnipeg I saw a large market garden run by a Yorkshireman named Longbottom, in which very large crops of onions, potatoes, carrots, peas, beans, tomatoes, celery, and a hundred other things were grown in a rough and ready sort of way, but very profitably; there is a good market in Winnipeg for all kinds of garden stuff, and the earliest sorts command very high prices, so that our Yorkshire friend, as I was told on the best authority, is reaping a rich reward of his skill and industry.\n\nThe potato is not a successful crop in the United States. The yield there is estimated at about 88 bushels per acre, while in the Canadian provinces, with scarcely any care or cultivation, it is four or five times greater.\n\nMessrs. Read and Pell, say in their report as Assistant Commissioners:\n\nIn Manitoba, on the farms near the Assiniboine, we saw splendid specimens of the potato in the ground, the yield on one farm being stated by the owner to have never fallen below 300 bushels, and to have reached 400 bushels in 1879. These crops had not even been moulded up.\n\nMessrs. Sutton and Co., of Reading, the well-known seedsmen, gave the following certificate on the 21st December, 1880, regarding roots grown in Canada:\n\nWe were honoured by the Canadian Government forwarding for exhibition on our stand at the Smithfield Club Cattle Show, 1880, a collection of roots, &c., grown in Manitoba and Ontario, of the following weights, when harvested:\n\n| Root Type          | Weight (lbs) |\n|--------------------|--------------|\n| Squash             | 313          |\n| Long Red Mangel    | 75           |\n| Long Yellow Mangel | 65           |\n| Yellow Globe Mangel| 60           |\n| Field Pumpkin      | 37           |\n| Citron             | 30           |\n\nThese enormous specimens proved objects of great interest to the British farmers, and we believe the weights far exceed any on record.\n\n(Signed) Sutton and Sons.\n\nE.—DAIRY FARMING.\n\nDairy farming is sure to be developed in connection with cattle ranching in Alberta and other districts. It will be a profitable department of agriculture in the New Territories.\n\nProfessor P. J. Sheldon says:\n\nThe Canadian dairy farmer has several important advantages over his English contemporary, not the smallest of which is this: he can grow, at a very moderate cost, very large crops of forage for winter use; clovers and timothy flourish well on most soils, and I should say that rye grasses would also, though I did not find they were much employed, if at all, in the growth of forage; I think they might be used to advantage. It is also\nDairy Farming.—How to Break the Soil.\n\nclear, from what I saw in many places, that he can raise abundant crops of swedes and mangels, and very good ones of carrots, parsnips, and the like. Here, then, after the question of water, are the first requisites for successful dairy farming.\n\nMr. Thomas Spence, who from his official position is well enabled to judge, is of opinion that:\n\nDairy farming must become in a few years an important source of wealth. It is now conducted on a very large scale in the other Provinces, in connection with cheese and butter factories for European consumption. In the Province of Ontario alone no less than 200 cheese factories being in operation, that Province deriving an income of nearly two million of dollars a year from this single article of produce, and the quality esteemed almost as highly as the best English cheese. With the progress of improved communications, what a vast field is presented for the development of that branch of agricultural enterprise in this great grazing country.\n\nMr. R. H. B. P. Anderson's reports that:\n\nBoth cattle and crops are wonderfully free from disease; in fact, neither horned cattle, sheep, nor horses seem to be affected with the diseases to which they are usually liable in these countries. [Great Britain and Ireland.]\n\nF.—FIRST OPERATIONS, THEIR COST AND RESULT.\n\nFrom heavy expenses attendant on agricultural operations in this country, persons may infer that farming in the new North-West is equally costly. This is not the case. Here the farmer has to wait practically a year for a return on his expenditure; there, as Professor Sheldon says, wheat is often again in the sack 90 days after it was sown.\n\nMessrs. Read and Pell state that:\n\n\"The cultivation of wheat on unbroken prairie land is of the simplest description. If the settler's land is not fenced, he will have to trust in the law in force in certain districts for protection from the inroad of cattle, under which each owner is required to herd or tent his cattle so that they shall not wander among the crops of his neighbour. The improvements needed will be a house and premises adapted to the size of occupation, &c. . . . The land is broken in summer by a sulky plough constructed in part on the same principle as the old Dutch or fen plough; with a wide share and rather stout steel breast, turning a shallow furrow of the land, 14 inches in width, laid flat, and showing no crease. . . . The driver is seated, reins in hand, within reach of a lever, by which the depth of the furrows may be adjusted without stopping his team. With this implement and a pair of horses about 2½ acres are turned over in the course of the day.\n\nDr. Macoun gives the following as the latest method of simultaneously breaking and seeding prairie land:\n\nRecently it has been discovered by successful experiments that seeds sown on the prairie grass and then ploughed in lightly, will yield good crops the same season. This is a most important discovery, as it shows that an immigrant arriving on his claim in the spring can begin to realize a return from his labours almost as quickly as if the land had already been cultivated and improved. The novelty of the operation is, that the grain is first sown on the prairie grass, and then the \"breaking\" is done. A rather light sod is turned, and the buried grain quickly finds its way through . . .\n\nA Mr. Daly, near Big Stone City, sowed ten acres of oats, two bushels and a half per acre. He harvested 420 bushels, which paid the expenses of \"breaking,\" and left him some £15 besides. Another gentleman near him sowed buckwheat in the latter part of May, and he had a magnificent crop. This valuable discovery will be worth much to the beginner. It will enable him to realize sufficient for his expenses the first year.\nAppendix.\n\nFrom a recent publication, \"Manitoba and the Canadian North-West,\" I take the following interesting details respecting the requirements of settlers, and profit attending their operations:\n\nHOW TO COMMENCE A FARM.\n\nA new settler arriving in the country in April or May will find his time fully occupied at first in choosing a good location for his farm, and in purchasing the necessary supplies to commence work. The general opinion of settlers is that the end of May and the months of June and July are the best time for breaking. The land then broken ought to be backset in September. Land should be broken shallow and turned back deep. If the settler wishes he can get a partial crop the first year sufficient to pay expenses, oats being the best seed to sow. In July sufficient hay ought to be cut for winter fodder for the cattle. It is not necessary to fence the broken land until a crop is put in, but the settler will find it to his advantage to fence his fields as soon as possible, either with wire or rails.\n\nThe family can live in tents very comfortably till October, but the settler should be careful to commence early in the fall—not later than middle of August or 1st of September—to erect a warm house and stables for the winter. The former can be purchased ready-made in Winnipeg for about £60, or it can be constructed of logs and made very warm; the latter can be made of logs or sod. The first winter over, the rest is plain sailing.\n\nA SETTLER'S FIRST EXPENSES.\n\nOn leaving for the Canadian North-West a settler should burden himself with as little luggage as possible. He can purchase everything he requires at reasonable prices in Manitoba, and obtain articles better suited to the country than anything he could bring with him. The following is an approximate estimate of his first outlay in a moderate way:\n\n| Item                        | Cost |\n|-----------------------------|------|\n| Provisions for one year, say | £50  |\n| Yoke of oxen                | 37   |\n| One cow                     | 7    |\n| Wagon                       | 16   |\n| Plough and harrow           | 7    |\n| Sundry implements           | 5    |\n| Cooking-stove, with tinware | 5    |\n| Furniture, &c., say         | 12   |\n| Sundry expenses, say        | 10   |\n\n£149\n\nTo the above must be added first payment on land, unless he takes a homestead and pre-emption; but an energetic man will find time to earn something as an offset to a portion of his first expenses, either on the railway or by working for neighbouring farmers; and, in addition to this, there is the chance of obtaining a partial crop the first year. A settler, therefore, who can boast of having £500 on his arrival in Manitoba, is an independent man, and cannot fail to succeed with ordinary care and energy. Many settlers on arrival cannot boast of a tenth part of that sum, and yet they succeed.\n\nPROFITS OF FARMING IN THE CANADIAN NORTH-WEST.\n\nIn the following calculations every care has been taken not to over-estimate what can be done with care, perseverance, and energy:\n\nFIRST YEAR.\n\nExpenditure of settler with family of say five, for provisions, &c., one year: £50\nOne yoke of oxen: 37\nOne cow: 7\nBreaking plough and harrow: 7\nWagon: 16\nImplements, &c.: 5\nCook-stove, &c., complete: 5\nFurniture: 12\nSundries, say: 10\n\nOutlay for first year: £149\nAt the end of the year he will have a comfortable log house, barn, &c., cattle, implements, and say twenty acres of land broken, ready for seed.\n\n**SECOND YEAR.**\n\nWill realize from 20 acres—600 bushels of grain at 80 cents £96\n\nExpenditure, say 60\n\nTo the good, besides living £36\n\nAnd he will have an additional 20 acres of land broken.\n\n**THIRD YEAR.**\n\nForty acres will give him 1200 bushels of grain at 80 cents £96\n\nExpenditure, including additional stock and implements 100\n\nTo the good, besides living £92\n\nAnd he will, with his increased stock and other facilities, be able to break at least 30 acres.\n\n**FOURTH YEAR.**\n\nSeventy acres will give him 2100 bushels of grain at 80 cents £335\n\nLess expenditure for further stock, implements, and other necessaries 120\n\nTo the good £215\n\nAnd another 30 acres broken.\n\n**FIFTH YEAR.**\n\nOne hundred acres will give him 3000 bushels of grain at 80 cents £480\n\nLess same expenditure as previous year 120\n\nTo the good £360\n\nAt the end of the fifth year he will stand as follows:—\n\nCash or its equivalent on hand £703\n\nOne hundred and sixty acres of land increased in value to at least £1 per acre 160\n\nHouse and barn, low appraisal 50\n\nStock, including cattle and horses 120\n\nMachinery and farm implements, 50 per cent. of cost, say 30\n\nFurniture, &c. 30\n\n£1103\n\nLess—outlay for hands if he purchases from Railway Company 94.10.1\n\nTo credit of farm £1008.09.8\n\nSo that, according to the above, even should there be a deficiency in the yield of crops or amount of land broken, the settler at the end of five years would find himself with a good farm well stocked, all paid for, and in addition a considerable sum of money to his credit in the bank.\n\nMr. Thomas Spence supplies the following interesting details regarding the breaking and the cost of working land:\n\nThe following is as near correct an estimate of the cost of operating a prairie farm in Manitoba, or the North-West, and the methods of farming, as we can give:—\n\nBreaking from June 1st to July 20th, cost per acre 10s. to 12s.\n\nBacksetting, same breaking in August and September, per acre 8s.\n\nSeeding (getting seed in the ground following spring), per acre 3s.\n\nCutting, binding, and shocking at harvest, per acre 10s.\n\nCost of raising 1 acre of wheat, say 43s.\n\nTwenty bushels (low estimate) wheat 56s.\n\nProfit per acre on first crop, in round numbers 13s.\nFor subsequent years it will be the same as above, less the cost of breaking, 12s. per acre, and there will be an increase in yield of 10 per cent. a year for three years, where it remains for ten years following.\n\nG.—INCREASED VALUE OF IMPROVED LANDS.\n\nWhen a farm has been brought into cultivation, it is saleable at an enhanced price, which gives a very good profit on the farmer's labour.\n\nProfessor J. P. Sheldon says:\n\nI was much surprised to find among the Manitoban farmers one of my old Cirencester pupils. He had bought a farm of some 400 acres, a few miles west of Winnipeg, paying, as was thought, the extravagant price of $20 dollars (£4) an acre. He declared, however, to me that he had the best farm in the locality, which may be taken as evidence of his being satisfied with it; and he was growing crops of turnips, potatoes, &c., which were already a theme of conversation in the Province; this was done by better cultivation than the land of Manitoba is used to, and it is clear that the soil will produce almost any crop in a very satisfactory way, providing it is properly attended to. And yet, how can we expect the rank and file of farmers to cultivate the soil carefully in a country which has such a superb abundance of magnificent land still unoccupied? In time, no doubt, better farming will prevail, and I hope my old pupil will set an example which will be worth extensive imitation; but at present land is too cheap and plentiful to admit of microscopic cultivation as we have it in England and Scotland.\n\nReverting to the same subject, he says:\n\nLand increases rapidly in value near to the city. For his farm near Winnipeg, Mr. Ross paid £73; now he wants £600 for it. It is 240 acres in extent, and the owner has put up a small house and a building or two on it, besides breaking up about half of the land.\n\nII.—STATISTICS RELATING TO WINNIPEG.\n\nThe recently issued Supplement to the Winnipeg Daily Sun contains a mass of statistical information relating to Winnipeg, from which the following items are taken:—The trade of Winnipeg for the year 1882 amounted to £4,000,000; the value of foreign imports was £1,644,585; the duty collected thereon amounted to £317,465. The value of the material imported, free of duty, for use in the construction of the Canadian Pacific Railway was £252,739. The foreign imports were about equally divided between Great Britain and the United States. The business done in goods of Canadian manufacture amounted to £2,400,000. The Canadian Pacific Railway brought from St. Vincent to Winnipeg, during the first nine months of 1882, 5,898 first-class passengers and 26,587 immigrants—a total of 32,385 persons.\n\nAmongst the industries of Winnipeg the following may be noted:—Brickmaking: last season 18,000,000 bricks were made there. Furniture: the two firms in this line produced £50,000 worth of goods, part was sold to outside towns and villages. Tent making is active; the annual output of Messrs. Hope and Brownley reached £25,000. The iron trade employs a large number of hands; the value of the manufactures of two firms is given at £80,000; while a third firm, employing 100 hands, made no return of its business. Artificial stone and cement pipes are\nproduced to the value of £9,000. Lumber, saw and planing mills, &c., employ over 1,000 hands, and the value of their productions is returned at £580,000. The Ogilvie and Co. flour mill, can turn out 750 barrels of flour per day; the engine is of 360-horse power, and 60 men are employed there. The biscuit works of Messrs. Chambers and Co. employ 30 hands, and the goods made are of the annual value of £24,000. The machine shops of the C. P. Railway give employment to 500 hands.\n\nAmongst the evidence of thrifty habits, the record of the savings bank may be mentioned. There are 2,200 depositors in the Winnipeg Savings Bank, the total amount standing to their credit at the end of last year was £114,568. During the year the deposits amounted to £203,610, and the withdrawals to £135,405. The deposits are mostly made weekly, in sums ranging from £1 to £4. Railway men, employed away from the city, sometimes deposit as much as £75 or £100 in one sum on their return. The average balance to the credit of depositors is about £50, very few reaching the highest limit permitted, £500. The savings bank deposits by no means represent the surplus earnings of the labouring classes. Large sums are invested in commercial undertakings, which pay higher rates of interest, or loaned in private channels.\n\nThe provisions for education are ample. Beside a college and normal school, there are Protestant and Catholic schools and six public schools. The buildings for the latter have cost £17,000 exclusive of sites.\n\nThe religious needs of Winnipeg have not been overlooked. Several new churches are projected, in addition to the following accommodation for public worship already existing:\n\n| Church of England (4 places of worship) | 2000 |\n| Roman Catholic | 2500 |\n| Canada Methodist (4 places of worship) | 2800 |\n| Presbyterian (2 places of worship) | 2200 |\n| Congregational | 1200 |\n| Baptist | 1200 |\n\n11,900\n\nThe Marquis of Lorne, in his famous speech at Winnipeg, thus described the natural advantages, position and prospects of the \"Heart City of the Dominion\":\n\nUnknown a few years ago except for some differences which had arisen amongst its people, we see Winnipeg now with a population unanimously joining in happy concord, and rapidly rising to the front rank amongst the commercial centres of the continent. We may look in vain elsewhere for a situation so favourable and so commanding—many as are the fair regions of which we can boast. There may be some among you before whose eyes the whole wonderful panorama of our provinces had passed—the ocean-garden island of Prince Edward, the magnificent valleys of the St. John and Sussex, the marvellous country, the home of \"Evangeline,\" where Blomidon looks down on the tides of Fundy, and over tracts of red soil richer than the weald of Kent. You may have seen the fortified Paradise of Quebec, and Montreal, whose prosperity and beauty are worthy of her great St. Lawrence, and you may have admired the well-wrought and splendid province of Ontario, and rejoiced at the growth of her capital, Toronto, and yet nowhere can you find a situation whose natural advantages promise so great a future as that which seems ensured to Manitoba and to Winnipeg, the Heart City of our Dominion.\nI.—WAGES IN THE PROVINCES.\n\nThe following information about wages is taken from the Winnipeg Sun. Being published on the spot, it may be regarded as accurate:\n\n|                      | Summer | Winter |\n|----------------------|--------|--------|\n|                      | Per Day | Per Week, with Board | Per Day | Per Week, with Board |\n| Carpenters           | 12s. to 16s. |        | 10s. to 14s. |        |\n| Bricklayers          | 14s. to 24s. |        |                |        |\n| Stonecutters         | 16s. to 20s. |        | 12s. to 16s. |        |\n| Machinists           | 14s. to 16s. |        | 12s. to 16s. |        |\n| Moulders             | 12s. to 14s. |        |                |        |\n| Shoemakers           | 10s. to 12s. |        | 10s. to 12s. |        |\n| Blacksmiths          | 10s. to 12s. |        | 8s. to 11s.   |        |\n| Teamsters (railroad) | 35s. to 40s. |        | Bush          | 35s.   |\n| City                 | 10s.     | 18s.   |                |        |\n| Labourers            | 10s. to 12s.|        |                |        |\n| Tailors              | 10s. to 12s.|        |                |        |\n| Farm labourers       | 40s. to 45s.|        |                |        |\n| Railroad labourers   | 11s. to 12s.|        |                |        |\n| Brickmakers          | 12s. to 20s.|        |                |        |\n| Swampers (bush)      |          |        |                | 35s.   |\n| Choppers (dush)      |          |        |                | 30s. to 35s. |\n| Cooks (men)          |          |        |                | 45s. to 75s., without board |\n| Hewers               |          |        |                | 15s. to 50s. |\n\nBoard in Camp, 16s. to 18s. per week.\nBoard in City, 18s. and upwards, with lodgings.\n\nThe following is a statement of wages paid to females in Winnipeg:\n\n|                      | Per Month |\n|----------------------|-----------|\n| General housework, with board | £3 to £1 |\n| Waitresses           | 4 „ 8     |\n| Chambermaids         | 3 „ 5     |\n| Laundresses          | 3 „ 5     |\n| Cooks                | 6 „ 8     |\n| General helpers      | 3 „ 5     |\n| Shop girls           | 6 „ 9     |\n\nPrinted by W. King & Sell, 12, Gough Square, Fleet Street, London, E.C.\nfrom the\nregarded\n\nPer Week,\nwith Board.\n\n35s.\n\n30s., 35s.,\n40s., to 45s.,\n45s., to 75s.,\nwithout board\n45s., to 50s.\n\nFemales in\n\nMonth.\n12\n8\n5\n5\n8\n5\n9\n\nLondon, E.C.\nHOUSE AND HOME,\nA POPULAR JOURNAL OF SOCIAL AND SANITARY REFORM.\nEDITED BY JOHN PEARCE.\n\nFirst of Series, complete in Four Volumes, price 16s.; or the Four Volumes in Two, cloth, 14s. Separate Volumes on sale as under:—Vol. II., in fancy cloth, 2s.; Vol. III., in cloth, 2s. 6d., in paper, 1s. 6d.; Vol. IV., in cloth, 4s., in paper, 2s.\n\nSecond Series, complete in One Volume, cloth, 6s.\n\nProf. W. H. Flower, F.R.S., F.L.S.—\"It seems a periodical calculated to diffuse a great deal of sound and useful knowledge, and I trust that it will gain a good circulation.\"\n\nLord Aberdare.—\"Excellently calculated to do public good, and I heartily wish it a wide circulation.\"\n\nMr. Thomas Burt, M.P.—\"Such a periodical cannot fail to do good, and I should be glad if it could find its way into every home in the country. I shall order it of my newsagent for my own family.\"\n\nArthur Arnold, Esq., M.P.—\"I wish you all success in connection with a work which seems to me to have a most beneficent object, and to be admirable in its purpose and endeavour.\"\n\n\"The Editor of House and Home is doing good service towards the advancement of hygienic principles in the homes of the working classes by the weekly issue of his interesting periodical.\"—Medical Press and Circular.\n\n\"House and Home is a very excellent magazine, with much instructive and interesting reading in it for the improvement of family life—physical, mental, and moral. Its object is to popularize those principles, arts, and appliances which tend to augment human happiness, to improve the species, and to make life better worth the living.\"—Evening Standard.\n\n\"House and Home aims at the improvement of the homes and condition of the people. It affords much useful and beneficial reading, and contains a large amount of interesting reading. The biographies are specially well written, and the 'gems of thought,' selected from the greatest writers of all ages, constitute another good feature.\"—Daily Chronicle.\n\n\"Its aim is to promote reform in all matters pertaining to the household. Its articles are clearly and forcibly written from a common-sense point of view. It may be read by every one, and to advantage.\"—The Graphic.\n\nSIR CHARLES W. DILKE, Bart., M.P.,\nA Biographical Sketch, with Portrait. By John Pearce. Price 3d.\n\nLONDON: WALLER & BAINES, DR. JOHNSON'S HOUSE, GOUGH SQUARE.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30696.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 43, "total-input-tokens": 71702, "total-output-tokens": 24248, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1562, 3], [1562, 4044, 4], [4044, 4680, 5], [4680, 4680, 6], [4680, 5219, 7], [5219, 5282, 8], [5282, 5895, 9], [5895, 5895, 10], [5895, 7977, 11], [7977, 10818, 12], [10818, 13863, 13], [13863, 16661, 14], [16661, 19363, 15], [19363, 22369, 16], [22369, 24957, 17], [24957, 27569, 18], [27569, 30165, 19], [30165, 32866, 20], [32866, 36125, 21], [36125, 39074, 22], [39074, 42792, 23], [42792, 46068, 24], [46068, 49389, 25], [49389, 52215, 26], [52215, 54869, 27], [54869, 57636, 28], [57636, 60636, 29], [60636, 63847, 30], [63847, 66565, 31], [66565, 69493, 32], [69493, 73394, 33], [73394, 76562, 34], [76562, 80363, 35], [80363, 83700, 36], [83700, 86071, 37], [86071, 89294, 38], [89294, 92540, 39], [92540, 94795, 40], [94795, 94962, 41], [94962, 97307, 42], [97307, 97307, 43]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]