[{"id": "f79304e936330bed1e87df0ed60e1b81bf19a39f", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☑ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa re liure serrée peut causer de l'ombre ou de la distortion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\nPages de couleur\n\n☐ Pages damaged/\nPages endommagées\n\n☐ Pages restored and/or laminated/\nPages restaurées et/ou pelliculées\n\n☑ Pages discoloured, stained or foxed/\nPages décolorées, tachetées ou piquées\n\n☐ Pages detached/\nPages détachées\n\n☑ Showthrough/\nTransparence\n\n☐ Quality of print varies/\nQualité inégale de l'impression\n\n☐ Includes supplementary material/\nComprend du matériel supplémentaire\n\n☐ Only edition available/\nSeule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right; and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier pli et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second pli, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE EVOLUTION OF THE RELATION BETWEEN CAPITAL AND LABOR.\n\nThe object of this paper is to sketch, as plainly and briefly as possible, the various changes which have taken place in the relation of capitalist and workman, to point out as well the various causes which have led to these changes, and to indicate the significant bearing which these facts have upon the solution of the labor problem of the present day. The relation of capitalist and workman has gone through some very interesting phases of development during the last century and a half. I hope to be able to show, not as a matter of theory, but as a matter of fact, that the present aspect of it is not a haphazard one, but the necessary outcome of its previous phases. Hence it will be from a careful examination of that evolution that we must hope to determine the future. We may thus be able to avoid some of the disastrous consequences which overtook our not very remote forefathers, much to their surprise.\n\nTo the thinking men and women of the day the restless movements of our laboring thousands are of the deepest interest. Most of these will admit that the question of the workman's position in the industrial world, or his relation to the capital of the country, is the most important which presents itself to modern society for solution. Other questions, such as those of land and population, are certain to have great interest for the future of our\ncountry, as they are beginning to have for the present of some of the older countries. To determine the future relations of capital and labor, however, is the industrial problem which has fallen to our lot for solution.\n\nThe present position of the workingman is one of unstable equilibrium. The labor and capital of the country are far from being at peace with each other. They are gradually drawing off into separate camps, and organizing their forces for active hostilities. From time to time they come into open conflict with each other. This serves to increase the bad feeling, while it also teaches them much as regards their methods of warfare which will enable them to make a general conflict most disastrous. All this while we are ever being told by a certain class of persons that there can be no real conflict between capital and labor,—that such is impossible on the face of it. They will demonstrate to a certainty that their interests are identical. Doubtless they are identical, but it is in the same sense as that in which the interests of the King of France and of the Duke of Burgundy were identical when they both desired the same town. Stated in general terms, the present relation between capital and labor is this: The capitalist, on his side, regards the workman as he does any other agent in production. It is his object, and a natural one, to get his machinery to turn out as much as possible at the smallest cost; but just in this same light does he regard his workmen. The workmen, on the other hand, have usually no other object than to make as good a living as possible, with as little exertion as need be. This is not at all a bad motive in the abstract, but they make no distinction between an employer and a natural agent. Indeed, the great source of conflict is the fact that both capitalists and workmen treat each other as they do natural objects and powers, namely, as sources of wealth or income. Given ordinary human nature, and the conditions of the wage system, it is impossible that anything but a condition of hostility could be the practical outcome. Under such conditions, no amount of lecturing, or ever so persuasive argument, will bring capital and labor into general harmony. The capitalist is working for his profits, the laborer for his wages. Where both shares have to come out of the same fund, it follows that if one is increased the other must be diminished by just that amount. Where the capitalist and laborer are so far removed from personal contact with each other and intimate understanding of each other's position as at present, what more natural—what more inevitable—than\nthat there should be difficulty over the division of the joint products. Now here there is need to note carefully that the difficulty is not to be laid at the door of the competitive system. The relation between capitalist and workman is not one of competition. Competition consists in outbidding one another in the purchase of goods, or underselling one another in the disposing of goods, and this applies to whatever a man requires to buy, or whatever he has to sell. Competition, then, takes place between one capitalist and another, or between one workman and another, but not between capitalists and workmen. Employer and employed work together in the production of wealth, hence there is no competition there. They quarrel over the division of the products, and there is no competition there. The difficulty is not to be got over by abolishing competition, however desirable that may be on other grounds. The problem resolves itself into this: How are we to do away with the absolute antagonism between capitalist and laborer which results from the quite arbitrary division of products which at present prevails? This principle of division plainly rests on the ground that \"might is right, and justice the interest of the stronger.\" But before we can proceed to suggest any solution for the problem we must ask how long this condition of affairs has prevailed, what it was that brought the industrial world to such a pass, and what it is that keeps it there. For unless we know something of these conditions our attempts at remedy must be mere gropings in the dark. They may even tend to aggravate the evil. At any rate, they cannot hope to be lasting and progressive unless we understand the conditions of our progress up to the present. If we find the evil to rest with man alone, if it is a moral or social one, the remedy must be of a moral or social nature. But if the evil is due to the material conditions under which man exists, then it must be our endeavor to modify, as best we can, these material conditions.\n\nIn considering the causes which have led up to the present relation between capitalist and laborer, our concern is more directly with the industrial development of the last century. But this can be explained only by going still further back. Let us see, then, what were some of the earlier phases of industrial development. Here, as in other historical matters, we must refer to Europe, and especially to Britain.\n\nDuring the Middle Ages industrial competition was almost unknown, except in a few important European centres of distribution, and even there it was limited. The wage system also seems\nto have been as little known. The first definite mention we have of wages in Britain is about the middle of the thirteenth century. Cooperation, and not individualism, was the rule in the production and distribution of wealth. The great monastic institutions which controlled so much of the land and wealth of the country were more or less communistic, or at least co-operative, in their industrial capacity. The industrial side of the feudal relation was also essentially co-operative. There was, of course, a marked social distinction between the feudal lord and his dependants, yet not so marked or so odious as the relation which was afterwards established, and which Carlyle has aptly termed the \"cash-nexus.\"\n\nIn England the decline of the feudal system was marked by the growing independence of those who cultivated the land, and these formed the bulk of the population. Their military service was no longer exacted, and their dues or rent became fixed in amount, though payable in the products of their labor. Such, in outline, was the condition of affairs, particularly in England, at the beginning of the fifteenth century, which is usually supposed to mark the close of the Middle Ages.\n\nThe fifteenth century, by the common consent of social historians, contained the golden age of the lower orders in Britain. In the lower orders are included all who did not belong to the aristocratic class. Up to this time there were really but two classes in Britain, the aristocracy and the masses. The cultivators of the soil cannot be distinguished from the workmen, who in almost all cases had plots of ground, even those in the towns. They had, too, a general right to pasturage on the common lands, which were then extensive. Now we find that never before, or since, did the lower class live in such comfort, and even luxury, as during the fifteenth century. Compared with some of their later representatives, they were \"clothed in purple and fine linen, and fared sumptuously every day.\" Indeed, the government thought it necessary to pass sumptuary laws limiting the extravagance of the lower orders in the matters of clothing and food. Yet, strange as it may appear, this golden age was brought about, in great measure, by no less terrible agencies than war and pestilence. The wars with France and Scotland, together with internal strife, but chiefly those dire epidemics known as the \"black death,\" which, from time to time, had scourged a people of unsanitary habits, had so reduced the population that those who were left found themselves able to make their own terms with the upper class. Besides, the restless, thriftless portion of the men had\nbeen taken as retainers by the nobles who were fighting the Wars of the Roses. These conflicts seem to have affected but slightly the real prosperity of the country. An extensive exchange of goods would have been impossible, but then there was little need for it in those days. The people in almost every part of the country produced their own food, built their own houses, and made, throughout, their own clothing. What else they required could be obtained from the craftsmen in the nearest village. Most modern luxuries were denied them, but they were content to have the necessaries of life in abundance.\n\nNext we have to ask what it was that brought about the fall of the lower class from a position of affluence to one of poverty, accompanied by pauperism. First of all, we note that the fifteenth century, with its high wages and low prices, made possible the rise of the middle class by industry and thrift. With them there comes the accumulation of capital and the first marked influence of a capitalist class. It was at the close of this century that America was discovered, and that commercial enterprise and the shipping industry made such rapid progress, all of which partly resulted from and greatly stimulated the rise of the capitalist middle class. For a long time, however, capital concerned itself mainly with the exchange of goods. Most of the manufacturing was done by individuals, assisted by apprentices, and perhaps by a few journeymen, all, however, within trade guilds. At that time it was the object of both masters and workmen to keep down competition. Their guilds were fenced about by legal enactments and their own regulations, thus making it impossible to work independently of them, and yet difficult to secure an entrance to them. The master workmen in these unions were, of course, among the members of that middle class which began to control the production and exchange of goods. But there was as yet almost no opposition between masters and men. They worked together as a unit, their interests being identical. The beginnings of capitalism were not marked by that antagonism between masters and workmen which is so prominent a mark of its modern form. Neither were there a few masters with a great many workmen, but many masters, with a few men each. This general system, with certain minor changes which we shall note later on, prevailed down to the last century, and represents, in its later form, the first relation of labor and capital in America, though the new conditions here made it more lax than in England. But while the masters retained and continued to better their posi-\ntion after the fifteenth century, the workmen did not fare so well. Their position was tolerably good till well on in the sixteenth century; then various causes began to work which soon brought him low indeed, wherever he was not protected by the guilds. War and pestilence had passed away, and population rapidly increased, especially among the working-classes and cultivators of the soil. The nobles, their wealth greatly reduced, in many cases wholly gone, in consequence of their struggles with each other, were compelled, both by law and poverty, to disband their hordes of retainers. These increased the number of laborers, or became thieves and vagabonds. Then, too, the great monastic institutions were abolished, and their lands divided among the existing aristocracy or court favorites, who were soon found to be much harder landlords than the monks. The troops of hangers-on round these monasteries were also added to the growing company of laborers.\n\nAgain, the landed gentry, some eager to repair their fortunes, others influenced by the growing desire for wealth, began to inclose the common lands before shared among the laborers, and thus a considerable source of the workingman's income was taken away. Under the influence of a growing commerce, the value of English wool rapidly increased, with the consequence that the large land-holders turned as much as possible of their land from agricultural to pasture uses. Now when we remember that the working population of England consisted very largely of agricultural laborers, we can imagine the effect which those joint influences had upon the position of the working people. Many were deprived of the opportunity to make a living, or part of it at least, from the soil, and many more of the opportunity to get employment. The general result was that the number of those seeking employment was much greater than the number of those who could find it. Cobden clearly summarized the height of good fortune for the workingman as \"two masters after one workman,\" and the depth of his bad fortune as \"two workmen after one master.\" The first was the position of the workingman in Britain at the beginning of the sixteenth century, the latter his position at the close of it. But while in this position, the worst blow of all fell upon him. This was the debasement of the coinage begun by Henry VIII, and continued during the next two reigns. The immediate effect was to increase the price of everything in demand, which meant to increase the price of the necessaries of life, but not the price of labor. The base money was issued by weight, so that while the laborer seemed to get the\nsame wage as before, it was really reduced. In the language of \"Political Economy,\" the nominal wage remained the same, the real wage was greatly reduced. The government, however, did not get all the advantage of the debasement of the coinage. The capitalist employing class secured the remainder, through the increased price of their goods in proportion to the cost of labor. Thus, considerably within one century, were those who virtually formed one class in society divided into two, and forced so widely apart that they have ever since remained distinct, and only of late have a minority of the lower class been able to raise themselves out of their precarious position. At that time, too, pauperism first made itself felt in England, and has ever since been a curse to the country. When the condition of the wage-earning portion of the population falls below a certain point, it is impossible for them to improve their condition through competition with the upper and middle classes, because they have not the necessary capital, and their very competition with each other for the means of living prevents them from ever acquiring it.\n\nI have directed attention at some length to the condition of the workingman during the fifteenth and sixteenth centuries, for it shows us, on the one hand, that it is possible for society to exist without a large portion of the working population being in poverty, and, on the other hand, that it was through no fault of his own, nor from any direct necessity of Nature, that the workingman was brought low. But, being once brought down, it was impossible for him to regain his old position. It was doubly hard for him in Britain, for, being once reduced, he was held down by stringent acts of Parliament. He could not combine to raise wages; he could not move about from one part of the country to another to seek employment; he could not even emigrate, except as a virtual slave. There was but one possible course left, and that was for the lower class to restrict its numbers until wages increased, from the demand for labor, and independence was once more made possible. This course we could hardly expect the laborers to follow, and hence they remained in their low position right on to the present century. This general position I find verified by Professor Thorold Rogers, in his \"Six Centuries of Work and Wages.\" Speaking of the laborer's position, he says: \"For more than two centuries and a half the English law, and those who administered the law, were engaged in grinding the English workman down to the lowest pittance, in stamping out every expression or act which indicated any organized discontent, and in\nmultiplying penalties upon him when he thought of his natural rights.\" Against these conditions the laborer had no appeal, and they have been removed only within the last seventy years.\n\nWe have before us the general relation of capital and labor down to about the middle of last century. We may now note briefly the next phase in the evolution of that relation. As I have stated, manufacturing for the most part was done by master-workmen, their apprentices, and journeymen. Ordinary laborers were engaged to procure raw materials and perform the various services not immediately connected with the technical part of production. There were thus a great many manufacturers in proportion to the quantity of goods produced. As communication between the various parts of the country was improved and the trading class increased in importance, competition began to exert its influence and to break up the power of the old guilds. The writings of Adam Smith and other early economists hastened this change. It was pointed out that these artificial arrangements hampered trade; and under the changing conditions of trade they certainly did. The principle of laissez-faire, of absolute freedom in all matters of trade and production, was advocated, and soon held all but complete sway. Not long after the time of Adam Smith competition reached its zenith. As the mechanical contrivances for aiding production were as yet simple and inexpensive, the number of manufacturers was very large. On the other hand, a great many dealers were competing with each other for the profits of distributing the manufactured articles. These manufacturers and merchants, though numerous, were able to become, if not wealthy, yet very well to do. Very few of them needed to suffer from want if they were reasonably industrious. They formed the great body of the middle class whose rise we have already noticed. We are now considering them when competition has become the ruling principle in all industry. The old form of coöperation was found to be too binding, and discredit had been thrown upon it by the many cumbersome acts of Parliament with which industry had been fenced about. The cry for freedom had prevailed. The results justified the demand. The assumption was natural that the greatest good was to be secured to each and all by allowing every one to take his own way to make money, provided that he respected the ordinary laws of property. This is akin to the moral argument that if each one seeks his own greatest happiness the greatest happiness of the whole community cannot fail to be secured. This, however, is in both cases to make the individual\neverything, to teach man that selfishness is the watchword of life. Still, this principle of laissez-faire was a better one than that which had preceded it. It introduced a necessary stage in industrial evolution. It did nothing, however, to better the lot of the too numerous workers. The workman was not on a competitive footing with his master. He could compete only with his fellow-workmen, and the more vigorous this competition the worse became his lot. But free competition between manufacturers developed modern enterprise and invention, because the manufacturer could effectually appeal to Nature for help if only he had the art to persuade her. Nature could help him with steam and water power, and by means of an indefinite number of mechanical contrivances known as machines he could get Nature to help him to a truly wonderful extent in his competition with his fellow-producers. Thus free competition both drove men to seek out these inventions and enabled them to make the best use of them when discovered. But the fact of a man being able to get Nature to exert her powers for him made it possible for him to quite surpass his competitors. For a time the power of competition was arrested by the actual monopoly which the man with Nature for his ally had secured. Thus did competition bring about its own defeat.\n\nThis defeat brings us to the second great change in industrial society. The conditions of the sixteenth century had divided the lower portion of society, depressing the peasant and laborer, and elevating the middle class. In the first half of this century the conditions which brought about the defeat of competition produced a similar division in the middle class, chiefly in the manufacturing, and to a less extent in the distributing, portions of it. The mechanical devices and machines which were introduced, along with the application of steam power, enabled some of the wealthier or more ingenious manufacturers to drive their fellows out of the field of production. The number of producers was thus greatly diminished. Then came the question, What must the others do? They could not remain idle and starve, hence they were forced by the very pressure of circumstances out of the master class into the laboring class. They had now to seek employment from their former competitors and to increase the competition in the ranks of labor. A few of them would find employment as foremen and managers, and, as sometimes happened, might regain an entrance to the employing class as partners in the business. Certainly the wealth of the country was enor\nmonously increased, but it is not hard to discover who benefited by it. The capitalists soon became very rich, as we find in both Britain and America, and yet the laborers were not greatly benefited. In Britain they were for some time worse off than ever, and would have been in America had population been excessive.\n\nNow the principle of competition had tended to make men individualistic, selfish, caring for no one else. It had also tended to make them greedy of gain and envious of each other. Their success only heightened the passion for wealth and distinction. They seemed to care nothing as to how they ground down their workmen. Indeed, they were being further and further removed from a true knowledge of their position, and knew them only as instruments of production. The sole idea of the capitalist was the reduction of the cost of manufacture. This is quite a praiseworthy purpose as regards the agency of Nature, for Nature can stand such reduction to any extent. Man, however, cannot endure a constant reduction in his wages without soon ceasing to exist, and, worst of all, enduring a great deal of misery before he actually gets to the ceasing point. Not many, however, actually get to that extreme directly; they usually remain at the miserable stage. This was the case of the English workmen at the time of the development of modern industry. When they appealed to their employers they were met with the not very encouraging reply, that the matter was all in their own hands. \"The fact is,\" said the employers, \"you are too numerous. At any time there is, according to an economic law, so much money to be spent as wages. Thus the wages of each workman will be determined by the number of workmen among whom the whole amount is to be distributed. Political economy tells us,\" they urged, \"that the wage fund cannot be increased, therefore, our dear friends, you will clearly perceive that we cannot help you. Your only remedy is to diminish your numbers.\" Having thus shifted the responsibility from themselves to Nature, or to the workingman himself, they could enjoy the prospect of their ever-increasing thousands without any qualms of conscience. But, as Carlyle says in \"Sartor Resartus,\" \"there must be something wrong. A full-formed horse will in any market bring from twenty to as high as two hundred Friedrichs-d'or; such is his worth to the world. A full-formed man is not only worth nothing to the world but the world could afford him a round sum would he simply engage to go and hang himself.\" Yes, there was something wrong; the\nlaborer felt sure of it; and when he was allowed to combine with his fellows in order to sell his labor as dear as might be, he was not long in discovering that those laws styled \"natural\" and \"inexorable\" were not so adamantine after all. He made the important discovery that wages could be increased without diminishing population, increased, namely, at the expense of the employer's profits. Naturally enough, the workingman began to look on Political Economy as no friend of his, but as simply an organized defense of the rich man's position and methods with regard to wealth. It is only recently that the workingman is beginning to recognize that true Political Economy is not his foe, but considers his case quite impartially, and that the study of economic principles is as much to his advantage as to that of his employer. Of course he must recognize that there is a ground of truth in the position that his wages may be affected by his numbers, and that even combination will not save him when they are too large; but all this on different principles than those urged by the capitalists who took refuge in the wages-fund theory.\n\nNow the repeal of the laws against the combination of laborers, which took place in 1824, marked the end of general competition among laborers. So long as there were more laborers than could find employment easily, so long it was impossible for any advance in wages to take place, because no individual could induce an employer to raise his wages when the employer could get others to take his place. The engaging or not of an individual workman made no difference to the employer who had plenty of men seeking to enter his service. But the having or not having employment was a most serious matter to the individual workman. So from the sixteenth century to the nineteenth the employer had it all his own way, and would have had it even yet had not the laborer been allowed by combination to produce an artificial dearth of laborers, and thus cause wages to rise.\n\nBut through the operation of trades unions, following the breaking up of the old system of production, a feeling of antagonism has been developed between workmen and employers. This is partly due, also, to the utter lack, in these days, and especially in America, of such personal interest in each other as formerly existed, and which made it an inhuman thing for an employer to set his workmen adrift whenever he pleased. All social bonds between the two have been severed. All fellow-feeling, all human sympathy, is gone. Many an employer takes less interest in his workmen than in his machines. His machines\nare his and their injury or destruction brings loss to him. His workmen, however, are like hired machines, out of which the most that is possible is to be taken, and for whose loss or injury he is not responsible. The cash-nexus has taken the place of all other bonds. Its conveniences are that it may be very easily broken, and it carries with it no responsibility beyond a cash payment. Such is the state of things against which Carlyle so vehemently protests in his \"Past and Present.\" Look at some of his statements on this point. \"It must be owned, we for the present with our Mammon-Gospel, have come to strange conclusions. We call it a society; and go about professing openly the totallest separation, isolation. Our life is not a mutual helpfulness; but rather, cloaked under due laws-of-war, named 'fair competition' and so forth, it is a mutual hostility. We have profoundly forgotten everywhere that cash-payment is not the sole relation of human beings; we think, nothing doubting, that it absolves and liquidates all engagements of man. 'My starving workers?' answers the rich mill-owner. 'Did not I hire them fairly in the market? Did I not pay them to the last sixpence, the sum covenanted for? What have I to do with them more?'—verily Mammon-worship is a melancholy creed. When Cain, for his own behoof, had killed Abel, and was questioned 'Where is thy brother?' he too made answer, 'Am I my brother's keeper?' Did I not pay my brother his wages, the thing he had merited from me?\" Again with prophetic insight he says: \"In brief, all this Mammon-Gospel of Supply and Demand, Competition, Laissez-faire, and Devil take the hindmost, begins to be one of the shabbiest gospels ever preached, or altogether the shabbiest... Laissez-faire, Supply and Demand, one begins to be weary of all that. Leave all to egoism, to ravenous greed of money, of pleasure, of applause! it is the Gospel of Despair! Man is a Patent-Digester, then; only give him Free Trade, free digesting room; and each of us digest what he can come at, leaving the rest to Fate! My unhappy brethren of the Working Mammonism, my unhappy brethren of the Idle Dilettanteism, no world was ever held together in that way for long. A world of mere Patent-Digesters will soon have nothing to digest; such world ends and by Law of Nature must end in 'over-population;' in howling universal famine, impossibility, and suicidal madness as of endless dog kennels run rabid.\" Nowadays things are somewhat changed. As Carlyle saw, the world could not remain in a condition of money-hunting and pleasure-hunting by the capitalist and land-holding classes\nalone. The working class, when reinforced by the majority of the small manufacturers and relieved from the restraints of law, began to look to themselves for the bettering of their position. Competition between workers began to be replaced by combination between them. Then the capitalist began to perceive that the workman was a factor to be counted upon, not in competition, but in opposition. The history of the relation during the past sixty years has been marked by growing power on the part of the laborer and lessening profits on the part of the manufacturer. This makes the opposing forces more nearly equal in their strength, consequently a general conflict is more to be feared. The problem has altered but is still far from being solved. We have not yet got beyond the danger of falling into Carlyle's \"impossible\" state. Indeed, we seem to be coming nearer to it. His prophecy still holds good that no world was ever held together in that way for long, and unless we bring our pyramid of society into a position of stable equilibrium, destruction and anarchy still await us. In what direction, then, must we move? Is the workingman justified in combining to keep up his wages? We cannot deny that he is. Does not the whole history of his position since his golden age proclaim most emphatically that it is his only possible salvation? Without it he would lapse back into virtual slavery or pauperism. Yet it is possible for him to carry his efforts in this direction too far, and by their natural reaction to bring destruction upon himself, as he has partially done already in some cases. Is the capitalist, then, chiefly to blame for the present condition of war? In the past the capitalist was certainly largely to blame, though his responsibilities were often hid from him by ignorance and greed. In the present he is much less to blame, as a class. His power is much diminished, relatively, and his profits, except in the case of monopolies, have been cut down. But here in America within the past few years competition within the capitalist class is being replaced by combination. More and more of late have pools, rings, combines, and trusts been formed among capitalist producers and distributors to fix prices, regulate production, and oppose the labor combinations. Now, as stated at the beginning of this paper, it is precisely this organization in both camps which makes the present position of the relation between capital and labor very unstable, and the outlook for the future threatening. No world was ever held together in that way for long. The evil is not now one of oppression, but one of war. The workman is becoming more and more a match for the capitalist, and when he\ngets him in his power he does not spare him. This is not quite to\nthe credit of the workman, but it is the natural outcome of the\nwar relation in which the two forces stand to each other. When\nthe workman finds his employer in a position favorable for attack,\nwith large contracts on his hands, with brisk demands for goods,\nthen the screws are applied, and wages are either increased or great\nloss ensues to the producer, and even, through him, to the workman\nhimself. But the capitalist has his opportunity when business is\ndull. When there is temporary over-production, and the manu-\nfacturer does not need to care much whether he shuts down or\nnot, then he either lowers wages or throws the workman out of\nemployment.\n\nWhat, then, must be the remedy for this? Can we return to\nthe peaceful though primitive condition of the fifteenth century,\nor to the independent though small producing stage of the last\ncentury? Evidently not. The perplexities of manhood are not\nto be escaped by a return to the careless condition of the child.\nOur safety lies in progress, our salvation must be wrought out.\nPerfect competition is evidently a thing of the past. We are\nmoving in the direction of combination. The extensive use of\nmachinery has made it impossible for small industries to live in\ncompetition with the larger. Great factories and mills filled with\nmachinery, minute division of labor, centralization in production,\nwill be the rule for the future. If, then, the workmen are not to\ngive in to the capitalist, if they cannot return to the condition of\nsmall, independent producers, and if the present attitude of hos-\ntility is disastrous and wasteful now, with a worse outlook for the\nfuture, what is to be done? What else than for the opposing\nforces to combine, and, instead of wasting their energies in the\nendeavor to circumvent and overcome one another, to unite in\novercoming natural powers and agents, conquering them for their\nmutual benefit. What millions are lost to America every year\nthrough strikes and lockouts! What millions, too, are lost through\nbad work, carelessness, lack of interest, and want of industry in\nworking for an enemy! Does it not appear plain that there is\neverything to be gained by the combining of capitalists and laborers\nin a common production?\n\nBefore considering how this is to be brought about, let us look\nat two other proposals for overcoming the existing difficulties.\nFirst, it is proposed to set up boards of arbitration to mediate\nbetween capitalists and workmen, to settle their disputes, to say\nwhen wages must be increased and when they must be lowered, to\ndecide the number of hours during which they must work, and settle minor difficulties. This would, of course, be a great advance on the present position, and it is a principle which is being put into practice in many localities of late, with benefit to both parties. But it can never be more than a temporary measure, because it affords no permanent solution of the difficulty. In its very terms it recognizes, and even exaggerates, the opposition between the parties to the arbitration, since it draws attention so plainly to the opposition itself. Arbitration is simply a temporary means of escape, a putting off of the evil day. Yet it may prepare the way for a real solution, and is certainly the first and easiest step to be taken in establishing a basis of agreement between the hostile forces. The other proposition is, that the workmen should cooperate among themselves — should join their capital and labor in independent productive enterprises, from which they would derive both profit and wages. This implies, however, that the workmen have the necessary capital to start such an undertaking, and the skill and business capacity needed for its management. They certainly lack the capital, and cannot give security enough to borrow it as cheaply as their opponents, the manufacturers already established. Besides, granted that they have skill and business capacity, yet it is still a mere capability requiring development. Then, again, they have not the experience necessary for such an undertaking, and in gaining the experience they may be ruined. In most business transactions nowadays there is not a very large margin to work upon, and the great gains of the capitalist, which make the workmen so envious, are, in most cases, due to a small percentage of returns on a large capital rapidly circulating. True, the returns are often great in the case of monopolies, whether natural or artificial. But it is very certain that a cooperative company of workmen could not for a very considerable time enjoy any such monopolies. Such a company would have to start in some industry open to all alike, in which the profits would not allow of the borrowing of money at high rates, nor make up for any blunders in the management. Hitherto the efforts of workmen in the direction of cooperation have not been successful. It is necessary for them to pass through some intermediate stage before they can hope to both produce and dispose of their goods for themselves. The element of success lies not in merely producing goods, but rather in knowing what goods to produce, in what quantities to produce them, and how to dispose of them to the\nbest advantage. It is here that we find the function of the captains of industry. The successful manager, if not a capitalist when he begins, invariably ends by being one, either for himself or in partnership with his employer. This latter circumstance is quite common now. The manager who proves his ability is almost invariably admitted to a share in the business, and this is everywhere admitted to be an advantage to both parties. Now if it is of advantage to the capitalist to admit his higher employees to a share in the business, will it not pay him, from a purely mercenary point of view, to admit at least all his competent employees to a share in it also? I am quite aware that, in the present state of society, it is of little use to present any higher motive than a purely mercenary one, either to employers or workmen, as an inducement to change their business methods. Only when industrial society has reached a less hostile state of existence than the present, can we begin to present higher motives of action with any hope of success.\n\nOn grounds of pure mammonism, then, here are some of the advantages to be derived from profit sharing, which I take to be the most practicable, and yet, at the same time, most progressive and permanent method of solving our industrial problem. It is well known among business men that when manufacturers undertake to fill large contracts, and especially when they undertake to fill them within a given time, they must take into consideration the possibility, and even the probability, of a strike among their workmen. They must, therefore, insure themselves against such risks, and tender at a higher rate than the normal one. If, now, a firm or single capitalist is working on the profit-sharing principle, there is no such risk to be considered; for now it is as much to the workman's interest as to his employer's that the contract should be filled within the specified time. Such an employer and his men are therefore able to take the contract away from the others without risk of loss. Then, again, in the ordinary manufacture of goods for the market, the profit-sharing producers can sell cheaper, and yet make more for both capitalist and workmen than the others. They are delivered from all the loss, on both sides, incident to strikes and the machinery connected with them. Besides, the efficiency of the workmen would be greatly increased. Knowing that they were to share in the profits of their work, they would have every inducement to work diligently and cheerfully. They would be careful of the machines or other instruments of production which now represent so much capital. They\nwould avoid all possible waste of material, either in the raw condition or in the manufactured state. There would be no difficulty in getting them to do extra work when business was pressing, or to lose a little time each day when it was slack. Besides, they would not only be industrious and careful themselves, but they would see to it that their companions were so also. As things now are, manufacturers or other employers are often unable to discharge useless workmen, or even to lower their wages, because a strike would be the result. If it is asked what is to become of the useless or incapable workmen, I reply, that, while the transition is going on from the ordinary wage system to the profit-sharing system, they will simply fall to the lot of the non-profit-sharers. By the time the transition is complete, they will either have learned the necessity of becoming capable and reliable, or will simply sink into the lower grades of unskilled workmen, and be left to find a living as best they can. Profit sharing is not presented as a cure for all social evils. It is simply offered as a solution for the difficulty which exists between laborers who are capable of recognizing their rational interests and the capitalists who employ them. As to what is to be done with social incapables introduces an entirely new question. Profit sharing simply aims at saving to the two hostile forces what they spend in fighting each other, and what is lost through lack of interest on the part of workmen in the work which they are performing. The workmen's unions need not be broken up; but they could put off their warlike character and become mutual insurance and benevolent associations. They might even develop into associations for the improvement of their intellectual and social life, or for the discussion of various practical and scientific questions bearing on their occupations. When the whole of their attention was no longer taken up with fighting capitalists and devising means for their circumvention, they would have time for these other matters. Socially, the improvements brought about by profit-sharing would be very great. Consider what a different country America would be if the antagonism between workmen and capitalists were removed, and in its place a common interest established. The present position also tends to exaggerate the importance of mere wealth, and to make the getting of money the great object of life. Carlyle has well said that the Englishman's hell is the failing to get money, his heaven the securing of it. It seems to be even more true as applied to Americans. Mammonism is here, indeed, the only whole-souled worship, with\nits heaven of getting money and its hell of failing to get it. But with the disappearance of the opposition between capital and labor mammon-worship would receive a severe check, and the advancement of a higher worship be made possible. The initiative to profit-sharing must, of course, come from the capitalists, and if they would but simply consider fairly its advantages, there is every reason to believe that it would soon be adopted. I know of no cases where the system has been given a fair trial and has failed. No doubt there are many who cannot be brought to accept it voluntarily; but if a considerable number of capitalists take it up, as of late they seem more inclined to do, the others will be forced to follow, or go down to the hell of Mammonism.\n\nAdam Shortt.\n\nQueen's University, Kingston, Canada.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25861.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 23, "total-input-tokens": 38088, "total-output-tokens": 11015, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2871, 3], [2871, 5311, 4], [5311, 6735, 5], [6735, 9369, 6], [9369, 11995, 7], [11995, 14655, 8], [14655, 17276, 9], [17276, 19922, 10], [19922, 22585, 11], [22585, 25226, 12], [25226, 27808, 13], [27808, 30371, 14], [30371, 32987, 15], [32987, 35611, 16], [35611, 38314, 17], [38314, 40926, 18], [40926, 43568, 19], [43568, 46215, 20], [46215, 48882, 21], [48882, 49698, 22], [49698, 49698, 23]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]