[{"id": "0fb36ef598dc838ad79e892ab41dd42a865e30c8", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Relié avec d’autres documents\n- [ ] La reliure serrée peut causer de l’ombre ou de la distorsion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d’une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n’ont pas été filmées.\n- [ ] Commentaires supplémentaires:\n\nLes pages totalement ou partiellement obscurcies par un feuillet d’errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originels sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"A SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustreront la méthode.\nCANADA RAILWAY LOAN ACT (1867).\n\nRETURN to an Address of the Honourable The House of Commons,\ndated 26 April 1870;—for,\n\n\"COPY of any DESPATCH or DESPATCHES from the Colonial Office to the\nGovernor General of Canada containing the OPINION or OPINIONS of\nthe LAW OFFICERS of the CROWN respecting the INVESTMENT of MONEY\nraised under the Authority of the CANADA RAILWAY LOAN ACT (1867).\"\n\nColonial Office,\n17 May 1870.\n\nW. MONSELL.\n\n(Mr. Monk.)\n\nOrdered, by The House of Commons, to be Printed,\n18 May 1870.\n### SCHEDULE.\n\n#### DESPATCHES FROM THE GOVERNOR.\n\n| No. in Series | Date and Number | Subject |\n|---------------|-----------------|---------|\n| 1             | 30 May 1869 (No. 66.) | Transmits an approved Minute of the Privy Council of the 20th May 1869, and also a Memorandum by the Minister of Finance with reference to the measures adopted by the Canadian Government to provide temporary investment of the money raised under the Imperial guarantee, until it shall be required for actual outlay. |\n| 2             | 20 June 1869 (No. 67.) | Forwards a Minute, dated 16th June 1869, adopted by the Privy Council of Canada, deprecating the construction which has been placed on their action, as well as objecting to the opinions expressed, and the instructions given in the premises by Her Majesty's Government. |\n| 3             | 24 June 1869 (No. 70.) | Adverting to the Minute of the 27th August 1868, encloses Correspondence respecting the Intercolonial Loan, and Minutes of Council of the 26th May and 18th June. These documents furnish, among other parts of the Privy Council of Canada, replies to the queries, as to what extent, and in what way, the loan had been employed, and contain the observations which Mr. Rose and his colleagues offer as the explanations of the course they have pursued. |\n| 4             | 28 October 1869 (No. 112.) | Transmits Minute of the Privy Council of 12th August 1869, enclosing Minute of the Treasury Board, dated 11th August, on the subject of the Intercolonial Railway Loan. |\n| 5             | 30 October 1869 (No. 117.) | Forwards a Minute of the Privy Council of Canada, dated 2nd October 1869, respecting the investment of the Intercolonial Railway Money. |\n| 6             | 22 Dec. 1869 (No. 168.) | Explains how the delay in forwarding the Minute of Council of 12th August occurred. |\n| 7             | Telegram (Received 20 April 1870). | Has requested Sir F. Hinck's to give a correct version of his remarks, and the Ministers to furnish a statement of the present position of Intercolonial Railway Loan Funds. |\n| 8             | 21 April 1870 (No. 79.) | With reference to Earl Granville's telegram of the 18th April, encloses a statement, furnished by Sir Francis Hincks, respecting the investment of the loan. |\n\n#### DESPATCHES FROM THE SECRETARY OF STATE.\n\n| No. in Series | Date and Number | Subject |\n|---------------|-----------------|---------|\n| 1             | 1 June 1860 (No. 97.) | Requests to be informed to what extent, and in what way, the loan has been employed under the authority of the Minute of 27th August, and instructs the Governor to refuse his concurrence in any mode of dealing with the money remaining in the hands of the Government other than that of investment properly so called. Would be glad to receive from Mr. Rose any observations respecting the Minute of 27th August, which he may consider calculated to remove the strong objections which at first sight attach to it. |\n| No. in Series | Date and Number | Subject |\n|--------------|----------------|---------|\n| 1            | 8 July 1869 (No. 129.) | Acknowledges Despatch, No. 47, of 20th June, in relation to Lord Granville's Despatch, No. 107, of 1st June, relating to the disposal of money raised under Imperial Guarantees. Requests Sir John Young to assure his Advisers that his Lordship never had any intention to call in question the financial integrity of the Dominion of Canada, still less the personal honour of Mr. Rose and his colleagues. Encloses two opinions of the Law Officers of the Crown, sought and given with no unfriendly feeling towards the Canadian Government, and expresses an opinion as to the propriety of placing the money in the slope of a distinct fund. |\n| 2            | 30 Nov. 1869 (No. 216.) | Acknowledges Despatch, No. 112, of the 28th October, enclosing a Minute of the Privy Council, of 12th August, on the subject of the Intercolonial Railway Loan. This being a subject of much interest to the Imperial Government, his Lordship would have been glad to have received the Minute at an earlier date. |\n| 3            | 15 Jan. 1870 (No. 12.) | With reference to the delay in forwarding the Minute of the 12th August, states that Sir J. Young's Despatch, No. 103, of the 22nd December, furnishes a full and complete explanation of the delay. |\n| 4            | 19 April 1870 (No. 98.) | Forwards copy of Telegraphic Despatch sent to Sir John Young on the 18th April: \"Early explanation requested of Statement by Minister of Finance in Budget Speech; that Law Officers' opinion as to Railway Loan will not be followed.\" |\n\nCORRESPONDENCE BETWEEN THE COLONIAL OFFICE AND SIR JOHN ROSE, K.C.M.G.\n\n| No. in Series | From whom | Subject |\n|--------------|-----------|---------|\n| 1            | Colonial Office, 10 May 1870. | As it is proposed shortly to lay before Parliament certain Papers relating to the investment of the Intercolonial Railway Loan, Lord Granville would be glad to be furnished with any statement with regard to the actual expenditure and progress of the Railway works, and of the obligations assumed up to the present time, which Sir John Rose, from his intimate knowledge of the subject, may be able to supply. |\n| 2            | Sir John Rose, 12 May 1870. | Forwards a statement of the progress of the Intercolonial Railway, of the expenditure on it, and the obligations assumed up to the present time, in compliance with the letter of Sir Frederic Rogers of the 10th May. |\nDespatches from the Governor.\n\n— No. 1. —\n\n(No. 56.)\n\nCOPY of a DESPATCH from Governor General the Right Honourable Sir John Young, Bart., o.c.b., to The Earl Granville, k.g.\n\nOttawa, Canada, 30 May 1869.\n\n(Received, 14 June 1869.)\n\nMy Lord,\n\nI have the honour to enclose, for your Lordship's information, an approved Minute of the Privy Council, relative to the measures adopted by the Canadian Government to provide temporary investment for the money raised under Imperial guarantee for the construction of the Intercolonial Railway.\n\nI have, &c.\n\n(signed) John Young.\n\nEnclosure in No. 1.\n\nCOPY of a REPORT of a Committee of the Honourable the Privy Council of Canada, approved by His Excellency the Governor General on the 29th May 1869.\n\nThe Committee have had under consideration the annexed Memorandum from the Honourable the Minister of Finance, having reference to the measures adopted by the Canadian Government to provide temporary investment for the money raised under the Imperial guarantee for the construction of the Intercolonial Railway, until it should be required for actual outlay, and they respectfully express their entire concurrence in the statements made and the views expressed in the said Memorandum; and advise that a copy thereof be transmitted by your Excellency to the Right Honourable the Secretary of State for the Colonies, for the information of Her Majesty's Government.\n\nCertified,\n\nW. A. Hinsworth,\nAssistant Clerk, Privy Council.\n\nSub-Enclosure in No. 1.\n\nThe Minister of Finance has had his attention called to an inquiry in the House of Commons, whether the Governor General has approved of a \"Recommendation of Council, that money raised under the Imperial guarantee, for the construction of the Intercolonial Railway, should be applied to the payment of the general debts of the Canadian Dominion, and whether such application is not in contravention of the Canadian Railway Loan Act, 1867;\" and he thinks it proper to call your Excellency's attention to the circumstance in order that the imputation which is impliedly made on the good faith of the Government may be promptly repelled.\n1. The Act of Union provided that \"it shall be the duty of the Government and Parliament of Canada, to provide for the commencement, within six months after the Union, of a railway connecting the River St. Lawrence with the city of Halifax, in Nova Scotia, and for the construction thereof without intermission, and the completion thereof with all practicable speed.\"\n\nThe Government felt it to be their duty to carry out this provision of the constitution with all possible diligence. A great portion of the route had been so far surveyed in former years that it was believed it could be placed under contract in the course of last summer or autumn.\n\n2. It was, however, necessary, before doing this, to place the loan; and the Finance Minister, in the course of his negotiations with the Imperial Government in July 1862, intimated that he would only raise one-half the authorised amount until the progress of the works made it necessary to provide the remainder.\n\n3. In the course of negotiations with the financial agents, Messrs. Baring and Glyn, the Finance Minister endeavoured to postpone the payments on the loan to as remote a date as possible; but it was thought that this would militate against the success of the operation if the last instalments were deferred beyond April 1869, or if the privilege of paying by anticipation were not accorded to the subscribers.\n\n4. When the loan was contracted for, a considerable number of the subscribers availed themselves of this option, and a large amount of money was paid in by anticipation.\n\nAs interest on the entire loan of two millions (three-fourths bearing four per cent., and one-fourth bearing five per cent.), began in July 1868, and was payable by Canada from that day, it became the obvious duty of the Government so to place the money received as that an undue loss of interest might be avoided.\n\n5. The Minister of Finance accordingly requested Messrs. Baring and Glyn, the financial agents, to endeavour to do so at the best rates they could, \"compatible with perfect security and immediate convertibility,\" but these gentlemen informed the Government that in the present state of the money market, and consistently with these conditions, they could not obtain a higher rate of interest than one per cent. per annum.\n\nHad they been able to have placed the deposits at any reasonable rate, the Government would have been relieved from the necessity of seeking other means of temporarily employing the instalments.\n\n6. Under the circumstances mentioned, the Government had, however, to consider what other means, on the like conditions of immediate convertibility and perfect security, were open to them as a temporary investment.\n\n7. The Government of Canada was, at that time, about issuing securities to provide for certain engagements of the Dominion which it was desirable to fund or otherwise meet; and it was considered that no better or more perfect security than those adverted to could be provided in which to place a portion of the moneys, lying comparatively unproductive, until these moneys were required to be disbursed to the contractors on the works.\n\n8. The Government had not ceased to urge the completion of the surveys with all possible speed, and they endeavoured to push on the letting of the works as rapidly as possible. All the sections, on which the location surveys were sufficiently advanced, were accordingly let last winter by public tender. They are seven in number, 102 miles in length, and the cost is estimated at $5,000,000 dollars. On these sections operations are being actively prosecuted, and the contractors are entitled to payment as the works proceed.\n\n9. The engineers have been continually engaged in locating the remaining sections, and these will be placed under contract as rapidly as possible. On one portion of the route a railway had been already built by a private company, about 36 miles in length. The propriety of acquiring this line, and making it a portion of the Intercolonial, was always contemplated as a possibility, and if the negotiations having that object in view, which began some time ago, are concluded, it will involve an immediate large cash outlay, in addition to the payment of the current works, out of the Intercolonial Fund.\n\n10. It will thus be seen that the most energetic steps were taken from the outset to accelerate the progress of the works, and that the Government are not open to the suspicion of having deferred their prosecution for one hour, but that on the contrary they have endeavoured to carry out, with the utmost promptitude and good faith, the obligations entailed upon them by the Act of Union, with reference to the Intercolonial Railway.\n\n11. It may be asked why the loan could not have been postponed for some months, or a less amount issued, insomuch as it now appears that the whole of the money will not be spent for some time? To this inquiry there are obvious and conclusive answers. The Government could enter into no contracts, nor negotiate for the acquisition of any intermediate portion of the line, until they saw that the money was available. A considerable sum had actually been spent on surveys, &c., &c., by anticipation. The money market was then unusually favourable, and it might have been a most serious matter, in a pecuniary point of view, to the Dominion, if the loan had been deferred until a condition of things arose which might have entailed on Canada the payment for 35 years of a higher rate of interest. The financial agents of the Government considered the time unusually opportune. Her Majesty's Government were in full possession of all the circumstances, and gave their unqualified\nunqualified consent to the operation on the terms and to the extent to which it was carried out.\n\n12. The Government of Canada had therefore, under these circumstances, to deal with the alternative, of allowing the large deposits to remain unproductive and entail a loss of about $350,000 dollars a year; or of placing them temporarily, and in a way that would be available as the money was required for actual outlay.\n\nIt was not unnatural to be supposed, that if the Imperial Government had sufficient confidence in Canada, to guarantee or endorse her bonds, that confidence also extended to trusting her with the outlay of the money on the work for which it had been raised; a work which was declared to be essential to the consolidation of the Union of British North America, and a condition of the nascent thereto, of Nova Scotia and New Brunswick; and one to the completion of which the good faith and interest of every Province of the Dominion were pledged.\n\nIf the Imperial Government had conveyed the intimation that Canada could not be entrusted with the money for the prosecution of its own works, or had sought to impose restrictions on its outlay, which would necessarily have presupposed that distrust, the Finance Minister believes it would have been the unanimous opinion of the people of Canada, that the guarantee of Her Majesty's Government to the loan, however highly they might have prized the granting of it, and however advantageous it might have been, ought not to have been accepted on such a condition.\n\n13. The meaning of the inquiry made in the House of Commons plainly is, that, under the pressure of financial necessity, Canada used the Intercolonial money; if indeed the inquiry be not meant to convey the imputation that Canada raised the loan prematurely with that object. The Minister of Finance believes it to be his duty to repel an insinuation which would be alike unworthy of the Government, as it would be utterly opposed to the character for good faith and straightforward integrity which the people of every Province of the Dominion have justly earned, and for the maintenance of which they have ever held the representatives in whom they place confidence to a strict observance.\n\n14. It is only necessary to advert to the financial condition of Canada at the time, to prove how irreconcilable with the actual facts such a supposition is.\n\nIt is true that there was a certain amount of floating liability due by the Dominion, but only to its fiscal agents in London; its bankers in Canada, and a small amount to one of the Provinces of the Dominion.\n\nThis liability, so far from being pressing, was one which the public creditor would have too gladly allowed to remain, but the Government thought it proper to make provision for its gradual funding, partly out of deposits in the Government savings banks; partly out of deposits required from insurance companies, under the law, and by other equally certain means. Had they been disposed to place a loan for the purpose on the market, it could have been successfully accomplished without any difficulty; for the only loan issued since the Union (except the Intercolonial) was promptly taken up in Canada; the six per cent. stock being now readily saleable and in continued demand at a premium of eight to nine per cent.; and the Government has been compelled to decline repeated applications for further issues.\n\nA certain amount of bonded debt also fell due last autumn, for which ample provision had been made, but the great bulk of the holders expressed in advance their wish either to renew it or convert it into the Dominion Stock already mentioned; an offer which the Government thought it proper in the public interest to decline.\n\n15. It is unnecessary to say more to prove how unfounded any imputation is that the motive of financial necessity had any part whatever in inducing the arrangements with reference to the temporary investment of the Intercolonial money, or to show that the Government was influenced solely by the one single consideration of finding a temporary investment for it, on the condition of perfect security and immediate convertibility, by which a heavy loss of interest might be avoided.\n\nIn carrying this out, the Government took unwonted and exceptional precautions in order that by no possibility whatever might there be any doubt that the money borrowed would be as safe and us immediately available as it would have been were it deposited at call in the Bank of England.\n\n16. Some of these precautions are indicated in general terms in the Order in Council, approved of by his Excellency the Governor General in August last, a copy of which, with the accompanying report of the Minister of Finance, it is presumed, was transmitted to the Secretary of State for the Colonies by his Excellency.\n\nThe Minister of Finance is not aware that any exception has ever been taken to the arrangements so made.\n\n17. It is proper briefly to recapitulate the means immediately and prospectively available to the Government of Canada for the purposes above mentioned.\n\na. The Government have a cash balance in the hands of their bankers of upwards of $2,750,000 dollars, a portion of which they are now endeavouring, though so far unsuccessfully, to place on special deposit at interest.\n\nb. They have a further special deposit with their bankers, at 4 per cent. interest, of $1,800,000 dollars.\n\nc. They...\nc. They have in the hands of Messrs. Baring and Glyn an amount estimated by\nthe last advice at $2,900,000 dollars.\n\nd. They have India Bonds in the hands of Messrs. Baring and Glyn worth about\n$750,000 dollars.\n\ne. They have preferential securities, of undoubted value, payable in 1, 2, 3 and 4\nyears from January last, with interest, of the Great Western Railway Company of\nCanada, amounting to $2,750,000 dollars.\n\nf. They have receipts from the Post Office Savings Bank, which since their estab-\nlishment have averaged about $6,000 dollars per month, and which in the course of\nthe next year are estimated (beyond the cash in hand) at $600,000 dollars.\n\ng. They have deposits by insurance companies of consols, stocks, and bonds, about\nto be converted into cash within two years, of $1,000,000 dollars.\n\nh. They have purchased bonds, in anticipation of the requirements of the Inter-\ncolonial Sinking Fund, to about $270,000 dollars.\n\ni. They have provided, over and above the foregoing means, special credits with\nthe bankers and financial agents of the Government for the express purpose of meeting\nany possible call on Intercolonial account, to wit, with\n\nMessrs. Baring and Glyn, $1,250,000 dollars.\nThe Bank of Montreal, $2,500,000 dollars.\n\nIt will thus be seen that the statement of having applied the money raised under\nthe Canada Loan Act, 1867, in payment of the general debts of the Dominion in contra-\nvention of that Act, is without a shadow of foundation.\n\nThe credit of the Dominion of Canada stands too well to render the recourse to any\nindirect or unworthy means for the payment of her debts necessary, and she prizes her\nreputation for good faith too highly to resort to them. Canada has but to offer her own\nsecurities to her own people, or on the London money market, as she may think most for her\nadvantage, to find whatever means are needed for the maintenance of the public credit, or\nfor the prosecution of enterprises which her people think can be prudently and advan-\ntageously undertaken. And while her obligation to complete the Intercolonial Railway will\nbe fulfilled to the letter, she claims the right of making such subsidiary arrangements,\nwhether in regard to the loan or the works themselves, as her own interests may require.\n\nHer Majesty's Government has hitherto extended a most generous confidence to\nCanada in connection with all the antecedent negotiations on this subject, and she has no\nreason to believe that in future that confidence will be abridged. This feeling induced the\nMinister of Finance to recommend to his Excellency the propriety of making the extra-\nordinary and unanticipated provisions already referred to; provisions which under ordinary cir-\ncumstances need nor have been made, and it now impels him to submit these observations\nfor your Excellency's consideration, in order that Her Majesty's Government may have the\nmeans of justifying the confidence which in this matter as in all others they have invariably\nreposed in the good faith of the inhabitants of British North America.\n\nIt is the duty of Canada to see that the amount of the loan is faithfully expended on\na work in which Her Majesty's Government and the Dominion have confessedly a common\ninterest. Of that duty Canada is fully sensible, and it will be performed with the most\nexact integrity.\n\nOttawa, 29 May 1869.\n\nJohn Rose, Minister of Finance.\n\n— No. 2. —\n\nCopy of a DESPATCH from Governor General the Right Honourable Sir\nJohn Young, Bart., G.C.B., to The Earl Granville, K.G.\n\nOttawa, 20 June 1869.\n\nMy Lord,\n\nI have the honour to acknowledge the receipt of your Lordship's Despatch of\nthe 1st June instant, No. 97,* and to transmit, in reference thereto, a Minute\nadopted by the Privy Council of Canada, deprecating the construction which\nhas been placed on their action, as well as objecting to the opinions expressed\nand the instructions given in the premises by Her Majesty's Government.\n\nI have, &c.,\n(signed) John Young.\nEnclosure in No. 2.\n\nCOPY OF A MINUTE OF THE QUEEN'S PRIVY COUNCIL FOR CANADA, ADOPTED 18 JUNE 1869.\n\nMay it please Your Excellency,\n\nThe Privy Council have had under consideration the Despatch of the Secretary of State for the Colonies, under date of the 1st June, on the subject of the Intercolonial Railway Loan, which was referred to them by your Excellency, and have now the honour to report as follows:\n\nThe Secretary of State wishes to learn from your Excellency to what extent the Loan has been employed under the authority of the Minute of Council of the 27th August last, and conveys his instructions to refuse concurrence in any mode of dealing with the money other than that of investments, properly so called; and he desires to receive from the Minister of Finance any observations respecting the Minute in question which he may consider calculated to remove the strong objections which in the opinion of the Secretary of State at first sight attach to it.\n\nYour Excellency's Advisers, while they will most readily afford the fullest information on the subject of the Loan, and respecting the manner in which it has been dealt with, would desire at the outset to say that they are all equally responsible with the Minister of Finance for the arrangements, as well touching the Loan as for the subsequent employment of any part of the moneys; that they participated in recommending to your Excellency's predecessor the course which was taken with reference to it, and they cannot recognize the principle of permitting one of your Advisers to be charged with a special measure of responsibility, or to be individually called on to account for acts which they collectively approved.\n\nOn the subject of the alleged temporary application of the money to the purpose of defraying the general debts of the Dominion, your Excellency's Advisers would say that the facts are so fully set forth in the Minute of Council approved of by your Excellency on the 29th May last, that it would be superfluous to repeat them here. They cannot but believe that the explanations given in that Minute will be satisfactory to Her Majesty's Government, and that the Despatch now under review was written without a full cognizance of all the circumstances connected with the proposed possible temporary investment of a portion of the money.\n\nIt may not be unadvisable, however, again to call attention to the fact, that the Intercolonial Loan Act provided that Canada, and not the Imperial Government, should raise the Loan; that the duty of determining the mode in which the road should be constructed devolved wholly on Canada; that she has accordingly provided, with the sanction of the Imperial Government, that the work shall be done by a Commission appointed by Canada, and responsible only to the Government and Parliament of Canada.\n\nIt is further required that Canada shall provide for the raising, appropriation, and expenditure of the money; and by the Act of the Canadian Parliament, it is provided that payment for the works shall be made by the Receiver General to the Commissioners, in such way as the Governor in Council may direct.\n\nThe only reservations which Her Majesty's Government would appear to have considered it necessary to make in the Intercolonial Railway Act, were, that the interest on the guaranteed portion of the Loan should be a charge on the Consolidated Revenue of Canada in a specified order; that provision should be made for a sinking fund, which might be invested in securities either of the Province of Canada, Nova Scotia, or New Brunswick, issued before the Union.\n\nThe whole scope of the legislation, as well of the Imperial as of the Dominion Parliament, shows that it was intended to impose on Canada the entire responsibility of raising and managing the Loan for constructing the road. In this essential feature it is in direct variance with the former guaranteed Loan of 1842, which was raised not by Canada but by the Imperial Government itself, and managed by it; whereas in the present case, the Imperial Parliament would appear to have purposely dissociated Her Majesty's Government from all connection either with the work itself, the raising of the loan, or the management of the fund. So implicit indeed would the confidence in Canada appear to have been, that it was provided that the sinking fund might be invested in the securities of the Dominion, thus practically accepting the credit of Canada as the sole security, not only for the construction of the work, but for the ultimate repayment of the money.\n\nThe negotiations attending the Loan in July last were conducted obviously in the spirit of this legislation. Her Majesty's Government wished only to reserve their approval of the route before endorsing the bonds.\n\nIt was thought proper, however, that the proposed terms of the Loan should, in the minutest particulars, be communicated to Her Majesty's Government, exhibiting the amount proposed to be raised, the mode and time of paying the instalments, and even the form of bonds to be issued. It was at that time perfectly apparent that the moiety of the Loan which was then raised would not all be required for a considerable interval of time, inasmuch as the sanction of Her Majesty's Government had only then been given to the route; until which sanction no contracts could be entered into, or outlay incurred.\n\nThe Privy Council would invite attention to the fact that although every detail was in possession of Her Majesty's Government, no objection whatever was made to the terms so proposed;\nproposed; it was not suggested that the Loan was premature or needlessly large, nor did they on any occasion express any wish whatever to participate in controlling or managing the appropriation of the moneys in the interval. That duty had beyond all question been delegated to Canada alone.\n\nIf Her Majesty's Government had evinced a confidence in Canada more limited than Parliament had reposed, or, by seeking to interpose a joint control, had exhibited a distrust either of the credit of Canada or of its good faith in expending the money on the work: as rapidly as they could be pushed forward, the duty of your Excellency's advisers would have been plain; they could not have accepted the guarantee on these terms.\n\nBut no such distrust was ever suggested; nor the faintest wish expressed on the part of Her Majesty's Government, to direct the temporary administration of the money.\n\nIf any suggestions in the spirit of extending co-operative advice, as to providing temporary accommodation for the instalments had been made on the part of Her Majesty's Government, they would then, as now, have received fitting appreciation.\n\nThe Privy Council cannot but regret that after arrangements conducted in this spirit have been completed, and after the entire responsibility of managing the funds has been thrown on Canada, your Excellency should now, for the first time, be called upon to interpose your authority for the purpose of refusing your concurrence in the mode of dealing with the money, which the Canadian Government have deemed it expedient to adopt.\n\nYour Excellency's advisers have throughout these negotiations been perfectly unreserved with her Majesty's Government, and have, besides, taken the promptest and most energetic steps to further the prosecution of the work.\n\nIt is unnecessary to repeat the circumstances attending the contemplated temporary investment of a portion of the money, or the extreme precautions which the Minister of Finance took to provide for its immediate return, in case it was deemed advantageous to invest any portion of it in the securities of the Dominion.\n\nThese precautions were dictated by a desire to provide for contingencies, which, though within the range of possibility, were not reasonably to be anticipated, and to guard against any possible loss to Canada, in replacing the money, should circumstances make it more for her interest to use for a time a portion of the receipts of the Intercolonial Loan, lying unproductive and idle, rather than have recourse to the other means which were always available, and which Canada has always at command to meet any temporary drafts on the Treasury.\n\nIn compliance with your Excellency's wishes, the Privy Council have caused a statement to be made showing the extent to which that portion of the Intercolonial Loan guaranteed by Her Majesty's Government may be considered to have been drawn on.\n\nIt is proper to state that all the receipts from Loans and from other sources, go into the ordinary cash balances in the hands of the bankers and fiscal agents of the Dominion, out of which all calls are met, and it cannot therefore, be said, in strictness, that any portion of such balances has been specifically used for one purpose or another.\n\nIn former statements it has been assumed that the Intercolonial money would be available for the payment of a certain part of the debt since redeemed without reducing the ordinary bank balances at all. In the statement now transmitted to your Excellency, the Intercolonial payments are included in the bank balances, and these balances are regarded as available for the Intercolonial Fund so guaranteed.\n\nKeeping this explanation in view, it will be perceived, that after deducting the expenditure on the road since Confederation, the Intercolonial Bonds and other investments, and the cash balances, at no time since the Loan was contracted has the amount raised on the Imperial guarantee been really drawn upon; and it was only during the first few weeks, when the proceeds of the Loan, as paid in to the fiscal agents more than covered the amount by which they were in advance to Canada, and before the instructions for other investments could be carried out, that this has even apparently been the case.\n\nIf, as formerly stated, certain redemptions of the Public Debt were considered as being made out of a portion of the Intercolonial payments, the Bank balances became correspondingly larger than if these redemptions had been met out of ordinary funds. But if a close examination is made into the state of the banking accounts, the very important fact is disclosed that the ordinary Bank balances, wholly irrespective of that portion of the Intercolonial money raised on the Imperial guarantee, have at every date (except during a portion of the quarter ending 30th September, when there was a small difference of about 1000 dollars, or £9657. sterling) been more than adequate to meet the requirements of all other payments whatever, without using one shilling of the guaranteed Intercolonial money. In other words, the Government have always, except at that one date, and by that limited sum, had at call in their banker's hands more than the amount of the loan raised on the Imperial guarantee; and it may be literally said that, except as to the sum of £9657. sterling, no part of the guaranteed loan has ever been used. That sum was almost immediately replaced by further incomings of ordinary revenue.\n\nIt is true that, in this view, the possession of the Intercolonial money permitted the Government to allow their bank balances to run lower than they would otherwise have done, but it is equally true that the bank credits at the disposal of the Government were more than ample to have met any possible demand without relying on the Intercolonial money even as an available reserve.\n\nThe annexed statement (No. 3), prepared by the Auditor, the Deputy Inspector General, and the Deputy Receiver General, shows that in the quarter ending 30th September 1868,\nthe payments on the guaranteed Intercolonial Loan, after deducting a portion only of the expenditure on the work, amounted to $2,997,773 while the funds on hand were $2,588,058\n\nIn the quarter ended 31st December 1868, the payments had amounted to $5,406,523 while the funds on hand and invested, were $5,497,608\n\nIn the quarter ending 31st March 1869, the payments had amounted to $6,488,105 while the funds on hand were $6,972,881\n\nAnd up to the 16th June instant, the payments have been $7,363,034 while the funds on hand were $9,032,655 whereof $2,000,000 dollars will be required for the payment of interest at an early day.\n\nFrom this official statement it is therefore manifest, and your Excellency's Advisers deem it their duty to re-affirm, that the possible measures contemplated in the Minute of August last, were prompted not with the object of providing for any temporary necessities of Canada, but solely as a means of avoiding the loss of interest which would otherwise have arisen. Ample arrangements had been made previous to floating the Loan for meeting the accruing engagements of Canada. These arrangements were actually countermanded, the maturity of other loans was anticipated, and payments made in advance, when the possible expectancy of floating the Loan or a portion of the Intercolonial instalments forced itself upon the consideration of the Canadian Government.\n\nAs to the means provided for making such portion of the Loan as might have been or may be used, instantly available, it is perhaps even less necessary again to enumerate them in view of the facts disclosed in the reports of the Auditor General and the Deputy Receiver General.\n\nThe work of the Intercolonial Railway is admitted to be one for the benefit of the empire at large, as well as of Canada, and it is certain that for many years it will be a heavy charge on the Canadian Treasury.\n\nThe Government of Canada believe they would have been greatly wanting in their duty had they not sought to avail themselves of every proper means of making the burden, in the way of interest, as light to the Dominion as possible during the progress of construction, especially at the present moment, when the consolidation of British interests in North America by union of new resources and the addition and growth of new territories creates an increased strain on the resources of the country. Had they merely allowed the money to remain unemployed without making an effort to invest it temporarily on the condition of perfect security and instant convertibility, or declined to consider it as an available reserve, they believe they would have exposed themselves to the just censure of the Parliament, to which alone they are responsible for the management and prosecution of the work, and to which they must look for the means of meeting the Loan; and they cannot believe that it either was, or is the deliberate wish of the Imperial Government to have subjected them to any such loss.\n\nAs the matter now stands, it has been shown above that the Government has at all times had available cash to the full extent of the uninvested portion of the proceeds of the Loan; but a very considerable reserve must always be kept in the hands of the bankers in Canada, and agents in London; and if instead of placing all the moneys received in one account, a separate account had been kept of the proceeds of the Intercolonial Loan, the effect would have been that, to this extent, the Dominion would have been saving the agent five per cent. on their advances, whilst they were allowing one per cent. on the special deposit. There would have been a similar loss of interest with the bankers in Canada; a loss which the Government did not feel itself justified in incurring for the sake of a nominal separation of the accounts.\n\nNo other investment is either so available at a like rate of interest as the securities of Canada, nor is there any in which the Government of Canada felt it could with such entire confidence place a portion of the surplus funds at its disposal. For every further not otherwise invested, Exchequer Bills were delivered to the Receiver General, and held by him specially for the Intercolonial Fund under an Order of Council. The Exchequer Bills were held in case the other means provided should by any possibility be inadequate, over and above the cash balances in the hands of our bankers and fiscal agents, which were always available to the full extent of the Loan. They are receivable in payment of duties of customs and excise, amounting to about $1,000,000 per annum, and it is, therefore, beyond all question that the amount would be forthcoming, even from that source alone, to meet any sums needed to replace the Intercolonial Loans. In truth, the entire revenue of the Dominion were pledged by anticipation to meet any part of the Intercolonial Loan which might be temporarily used.\n\nYour Excellency's Advisers think they may not unreasonably suggest whether the solicitude evinced by Her Majesty's Government respecting the custody of the money may not have its origin in the extreme precautions taken by the Canadian Government, and in the arrangements they made to provide for a much larger amount of that Loan than it has been in their power to invest, with a due regard to the conditions of perfect security and immediate convertibility.\n\nThey now challenge the fullest investigation into the sufficiency of the provision they have made for the instant availability of the moneys to the Treasury, for the purpose of being expended on the works.\n\nWill your Excellency's Advisers thus assert the right, and believe it to have been their unquestionable\nunquestionable duty to have dealt with the funds in the manner they have done, and to a much greater extent than it has been practicable for them to do, they would be unwilling that any issue of an unsatisfactory nature should arise between them and Her Majesty's Government.\n\nIf the right of controlling the funds had been asserted by Her Majesty's Government before the Loan was issued, your Excellency's Advisers have already indicated what their duty would have been; but now that the securities have been actually issued, and that obligations of good faith on the part of both Governments as to this instalment of the Loan make the issue irrevocable, and when the amount cannot be returned to the public, grave difficulties arise, and they will await the judgment of Her Majesty's Government on the facts now communicated to them, before submitting any recommendation to your Excellency on the subject.\n\nMeanwhile they cannot, with a proper regard to the responsibilities of their position, recede from the assertion of what they believe to be their undoubted right and bounden duty, or continue to control and manage the Loan to the exclusion of all other authority, however much they may regret that the necessity of making such an assertion is now for the time forced upon them.\n\nIn conclusion, your Excellency's Advisers feel that it is no light thing at the outset of the new career on which Canada is entering, that any suspicion should attach to its reputation for financial integrity and upright dealing; and they cannot but express their deep regret, that in a matter which in their judgment admits of no possible question, and of which they believe neither the right nor propriety is open to controversy, expressions should have been publicly used, having a tendency to throw doubt on the scrupulous exactitude of the Government in its financial dealings.\n\nThey do not doubt that, on due consideration, Her Majesty's Government will frankly recognise that Canada has the undoubted right to control and manage the fund in question; that considerations of what is due to her own honour, and the trust under which that fund was received, must alone guide her; that no arrangements have been made or proposed with reference to it, which are open even to criticism; and that the opinions expressed and instructions given to your Excellency under a misconception of the facts will be recalled.\n\n(signed) Wm. H. Lee,\nClerk of Privy Council.\n\nSTATEMENT, No. 1—Of the Intercolonial Railway Account.\n\nThe proceeds of the International Loan went into the General Cash Balances in the hands of the financial agents in London and in Canada; but by Order in Council a special account was to be kept, without distinguishing the proceeds of the £500,000 of the Guaranteed Loan from the £500,000 raised for the same purpose on the sole security of Canada. The account was to be credited with the proceeds of the loan as received, and debited with the charges incidental to the negotiation, and with the expenditure on the works. Certain securities were to be held as an investment, and certain special receipts, apart from ordinary revenue, viz., the deposits in Government Savings Banks, the deposits under the law by Insurance Companies, and the repayments of the original loan to the Great Western Railway Company, were to be further invested as they came in. Any balance of the special account not covered by such investments was to be invested in Exchequer Bills, bearing five per cent. interest, and receivable for all public dues. A statement is made once monthly of the account, including interest accrued, and the investment in Exchequer Bills is revised monthly, either by the cancelling of those already issued, or by a further issue, as the state of the account may require.\n\nThe Intercolonial Loan Account and the corresponding investment stood as follows on 1st June 1869, since which date instructions have been sent to the financial agents in London to purchase a further amount of £50,000 of Canadian securities; and a further investment of £50,000 dollars has been made by special deposit in the Bank of Montreal at four per cent. On the 1st July the Exchequer Bills will be reduced by a similar amount.\n\nINTERCOLONIAL RAILWAY ACCOUNT.\n\n| Dr.                                      | Dols. ets. |\n|------------------------------------------|------------|\n| To charges of negotiating Loan           | 108,058 04 |\n| To expenditure on works                  | 220,081 64 |\n| To investments, India Bonds              | 691,338 82 |\n| To investments, Canadian securities purchased in London | 243,333 83 |\n| Less—applied to Sinking Fund             | 36,000 00 |\n| To investments, Canadian securities purchased in Canada | 209,883 88 |\n| To invested with Bank of Montreal        | 1,500,000 00 |\n| To Balance invested in Exchequer Bills   | 7,027,010 18 |\n| Total                                    | 10,481,083 18 |\n### CANADA RAILWAY LOAN ACT (1867)\n\n| Cr. | Dols. cts. |\n|-----|-----------|\n| By Loan of 2,000,000 L sterling | 9,785,398 34 |\n| By premium | 645,978 92 |\n| By interest accrued on investment | 151,076 02 |\n| **Total** | **Dols. 10,681,448 18** |\n\n---\n\n**Statement, No. 2—Of the Canadian Debt redeemed since 1st July 1868, and of the Proceeds of other Loans and Special Deposits available for that purpose.**\n\nAs the whole proceeds of this Loan went into the general cash balances, no portion of it can be said to have been specifically applied to any particular purpose; but the following statement will show what changes have been made in the debentures and floating debt of the Dominion since 1st July 1868, leaving out of account the proceeds of the Guaranteed Loan.\n\n| Imperial Guaranteed Loan redeemed | 681,988 32 |\n| 7 per cent. Debentures redeemed | 878,200 00 |\n| Other redemptions | 110,700 00 |\n| Balances due Messrs. Glyn, Mills & Co., repaid | 284,988 36 |\n| Ditto - ditto Harings - ditto | 1,077,818 33 |\n| Special advances, Bank of Montreal, ditto | 2,500,000 00 |\n| **Total** | **Dols. 5,636,538 01** |\n\n| ¼ of net proceeds of Intercolonial Loan, being the proportion of Canada | 2,597,918 13 |\n| Debentures not guaranteed | 1,814,606 92 |\n| Deposits of Insurance Companies | 848,659 92 |\n| Savings Banks deposits | 534,800 00 |\n| Provincial Notes issued, less 25 per cent. as a specie reserve | **Total** | **Dols. 5,525,678 57** |\n\n---\n\n**Statement, No. 3—Of the Proceeds of the Guaranteed Intercolonial Loan, and of the application of it at the end of each quarter, and at the present date.**\n\n| Dols. cts. |\n|-------------|\n| Net proceeds of Loan to 30 September | 3,970,473 09 |\n| ¾ as proceeds of Guarantee Loan | 2,977,854 82 |\n| Expenditure on Works to date since Confederation | 50,081 04 |\n| **Total** | **Dols. 2,927,773 18** |\n\n| Dols. cts. |\n|-------------|\n| Cash Balance available in Canada, 30 September | 2,688,058 97 |\n| Net proceeds of Loan, from 30 September to 31 December | 3,454,381 14 |\n| ¾ as proceeds of Guarantee Loan | 2,600,750 01 |\n| Balance from last Quarter | 2,927,773 18 |\n| **Total** | **Dols. 5,518,523 70** |\n\n| Dols. cts. |\n|-------------|\n| Expenditure on Works during Quarter | 50,000 00 |\n| **Total Available** | **Dols. 5,468,523 70** |\n\n| Dols. cts. |\n|-------------|\n| Cash Balances available in Canada, 31 December | 2,507,810 93 |\n| In Financial Agents' hands in London | 2,038,037 95 |\n| Investments in London, advance for Sinking Fund | 243,859 35 |\n| Ditto - Canada | 27,160 67 |\n| Ditto - India Bonds | 681,988 33 |\n| **Total Available** | **Dols. 5,407,888 11** |\n\n---\n\n244.\n### PAPERS RELATING TO THE\n\n| Description                                                                 | Dols.   | cts. |\n|-----------------------------------------------------------------------------|---------|------|\n| Net proceeds of Loan from 31 December to 31 March                           |         |      |\n| 2 as proceeds Guaranteed Loan                                               | 1,465,189 | 17   |\n| Balance from last Quarter                                                   | 6,485,528 | 79   |\n| Expenditure on Works during Quarter                                         | 6,568,165 | 67   |\n| Cash Balances available in Canada, 31 March                                  | 2,484,998 | 62   |\n| In Financial Agents' hands, London                                          | 2,085,124 | 74   |\n| Investments, as above                                                        | 951,888 | 33   |\n| Special deposit, Bank of Montreal                                           | 1,600,000 | 00   |\n| Total                                                                        | 6,072,881 | 89   |\n| Net proceeds of Loan, from 31 March to 10 June                               |         |      |\n| 2 as proceeds Guaranteed Loan                                               | 918,489 | 09   |\n| Balance from last Quarter                                                   | 6,485,165 | 67   |\n| Expenditure on Works to date                                                | 7,403,654 | 76   |\n| Cash Balances available in Canada, 16 June                                  | 3,657,894 | 33   |\n| In Financial Agents' hands, London                                          | 3,022,828 | 26   |\n| Investments and special deposits, as above                                   | 2,451,838 | 33   |\n| Additional, Bank of Montreal                                                 | 500,000 | 00   |\n| Total                                                                        | 9,082,055 | 95   |\n\nOf this available cash, about 2,000,000 dollars will be required to pay the July interest, leaving still available $7,682,055.\n\nN.B.—The expenditure on works only represents the expenditure by the Commissioners since the Union, and does not include the large outlay for surveys and other preliminary work previously made. No payments on contracts now in progress will be made till after 1st July.\n\n(signed) T. D. Harrington,\nDeputy Receiver General.\n\nWm. Dickinson,\nDeputy Inspector General.\n\nJohn Langton,\nAuditor.\n\n---\n\n**No. 3.**\n\nCOPY of a DESPATCH from Governor the Right Honourable Sir John Young, Bart., G.C.B., to The Earl Granville, K.G.\n\nMy Lord,\n\nGovernment House, Ottawa, 24 June 1869.\n\n(Received, 7 July 1869.)\n\nOn the 20th instant I briefly acknowledged your Despatch of the 1st instant, adverting to the Minute approved by my predecessor, of the 27th of August last,† and making inquiries as to the alleged application of money raised under the Imperial guarantee for the construction of the Intercolonial Railway, to the purpose of defraying, temporarily, the general debts of the Dominion.\n\nI send several additional copies of the papers which I enclosed, viz., correspondence respecting the Intercolonial Railway Loan, and Minutes of Council, of dates 29th May and 18th June. These documents furnish, on the part of the Privy Council of Canada, replies to the queries, as to what extent, and in what way, the loan has been employed under authority of the Minute of the 27th of August of last year, and contain the observations which Mr. Rose and\n\n* This is printed as Enclosure to Governor's Despatch, No. 56, of the 30th May 1869, page 1.\n† This is printed as Enclosure to Governor's Despatch, No. 67, of 20th June 1869, page 5.\nand his colleagues unite in offering as the explanation of the course they have pursued.\n\nIn compliance with your Lordship's wish to learn from me to what extent, and in what way, the loan has been employed under the Minute of the 27th of August, I can only say that the statements, 1 and 2, appended to the Minute of the 18th instant, are derived from distinct and independent sources, and seem to furnish the required information.\n\nStatement No. 1 shows in what way the total (guaranteed and unguaranteed) Intercolonial Loan has been invested; and it will be seen that in addition to the special securities set apart by the Order in Council of August last, Exchequer Bills, amounting to 7,637,900 dollars, are held for account of the total loan.\n\nThese Exchequer Bills, of which I enclose a form, being receivable in payment of all public dues, would seem to form a security of as high a character as it is possible to procure, and to be readily convertible into cash, irrespective of any reliance on the Bank Credits.\n\nAs to the extent of the application of the guaranteed Loan for the purpose of defraying the general debts of the Dominion, it appears, by Statement 2, that the receipts of the Dominion from other sources (and wholly irrespective of its ordinary revenues) have been sufficient to defray all these debts, without relying on the guaranteed portion of the loan at all (except by about 2,000l. sterling); and against this 2,000l., besides the ordinary cash balances in hand, a credit of 250,000l. was at any moment available in London, and twice as much more in Montreal.\n\nI have, &c.\n(signed) John Young.\n\nEnclosure in No. 3.\n\nCORRESPONDENCE respecting the INTERCOLONIAL RAILWAY LOAN, &c.\n(Laid before Parliament by Command of His Excellency the Governor General.)\n\nThis Correspondence will be found printed in House of Commons Paper, No. 272—1. of 1869.\n\n— No. 4. —\n\n(Copy of DESPATCH from Governor the Right Honourable Sir John Young, Bart., G.C.B., to The Earl Granville, K.C.)\n\nGovernment House, Ottawa, Canada,\n28 October 1869.\n\nMy Lord,\n\nWith reference to previous correspondence I have the honour to transmit a copy of a Minute of the Privy Council on the subject of the Intercolonial Railway Loan.\n\nI have, &c.\n(signed) John Young.\nEnclosure in No. 4.\n\nMinute of the Treasury Board of the 11th August 1869, on the Intercolonial Railway Loan, and the Minute of the Honourable the Privy Council thereon, of 12th August 1869.\n\nCopy of a Minute of the Honourable the Privy Council, adopted in Committee on the 12th August 1869.\n\nThe Committee of Council have given their attentive consideration to the annexed Memorandum, dated 11th August instant, from the Honourable the Board of Treasury to whom was referred the Despatch of the Right Honourable Her Majesty's Secretary of State for the Colonies, No. 129, dated 8th July 1869, communicating to your Excellency the opinion of the Law Officers of the Crown in England, and the views of Her Majesty's Government on the subject of the temporary investment of a portion of the moneys raised under the Imperial Guarantee for the construction of the Intercolonial Railway.\n\nThe Committee entirely concur in the opinion expressed by the Treasury Board in their said Memorandum, and advise that a copy of that Memorandum and of the present Report be transmitted by your Excellency to Earl Granville, as embodying the views entertained by the Canadian Government on the important subject to which they refer.\n\nMinute of the Treasury Board, adopted 11th August 1869.\n\nMay it please your Excellency,\n\nThe Treasury Board have had under consideration the Despatch of Earl Granville of the 8th July 1869, on the subject of the Intercolonial Railway Loan, transmitted to the Privy Council by his Excellency the Governor General, and referred to the Board for its consideration and report. The Board have to express their satisfaction at the declaration of his Lordship, that it was not the intention of Her Majesty's Government to call in question the financial integrity and upright dealing of the Dominion of Canada with reference to the employment of those moneys.\n\nHis Lordship transmits copies of two opinions of the Law Officers of the Crown which, in his judgment, lead to the conclusion that the Canada Loan Act of the Imperial Parliament, by using the word \"appropriation,\" required that the money should be kept or invested as a distinct fund applicable to the construction of the road, and to no other purpose.\n\nThe conclusion arrived at by the Law Officers would appear to be threefold:\n\n1st. That it was not the intention of the Imperial Act that the money should be invested at all, but that it should be set apart or appropriated.\n\n2nd. That the only sort of investment within its provisions would be one, the rate of which does not fluctuate, but which is convertible at any moment without loss.\n\n3rd. That the temporary application of a portion of the loan to the redemption of the debt of Canada (in other words, the acquisition of Canadian securities) may be a useful investment but is not an appropriation of the loan.\n\nThe Board have given careful attention to the statements of the law officers, and have, in the first place, to notice that it would appear that their opinions are based solely on the wording of the Imperial Act, and that they make no allusion to the Act of the Canadian Parliament, 31 Vict. c. 13.\n\nThe Board would observe that the Imperial Act is silent as to the investment or custody of the moneys to be raised under the guarantee. It provides that the guarantee shall not be given unless and until \"an Act has been passed by the Parliament of Canada, providing, to the satisfaction of the Commissioners of Her Majesty's Treasury, for the raising, appropriation, and expenditure\" of the loan.\n\nA Canadian Act was passed making provision for the \"raising, appropriation, and expenditure\" of the loan, and it \"satisfied\" the Commissioners of Her Majesty's Treasury, as is evidenced by the fact that the guarantee was given.\n\nThe terms of the Imperial Act are, therefore, complied with; that Act is executed; its force is spent, and it appears to the Board that reference must now be had to the Canadian Act, and the financial system which obtains in Canada for direction as to the proper custody and disposition of the money raised.\n\nHer Majesty's Government having once accepted that Act as sufficient, the Canadian Government is bound by its terms, and it is its duty, temporarily, to administer the money in the same way as other moneys at its disposal, having due regard to its ultimate expenditure on the railway.\n\nThe Canadian Act contemplated the ordinary action of the constitutional power of Parliament to be from time to time exercised in appropriating the public money under its control. The construction of the railway; the contracts and payments were left to the control, and are within the jurisdiction of the Canadian Parliament, without any other limit.\nlimit or restriction on the part of the Imperial Government than the general power of the Crown to disallow its Acts. It is not contended that the Act of the Canadian Parliament has not been complied with by the Government in dealing with the loan, or that the ordinary mode of administering trust moneys by that Government has been departed from.\n\nThe Board do not think it necessary, in discussing an objection which is now limited to a point of technical construction, to dwell further on this view, which appears to them so well founded, that the measure of discretion which the Government may exercise in the management of the fund, is to be looked for in the terms of the Canadian, and not of the Imperial Act of Parliament.\n\nThe Board deem it respectful, however, briefly to advert, seriatim, to the three points they have noted as embraced in the opinions which accompanied Earl Granville's Despatch.\n\nFirst.—That there should be an appropriation in specie kept distinct and apart.\n\nIf this view is the true one it would appear to be equally objectionable to place the money for safe keeping into the hands of the agents of the Government, or to deposit it in any bank whatever. It would merge, in either case, into the general mass of deposits; would not be \"kept aside and kept apart,\" but would be invested by them, on their discretion and responsibility, with other moneys in their hands. The merging of the loan by the Government with the other moneys in their hands cannot, surely, be more objectionable than the merging of it with the ordinary money of any bank into which it might be placed. The only mode of complying literally with the Act, as sought to be construed by the law officers, would appear to be to place away the identical money received from the lenders in packages, to keep these physically separate during the entire period of construction, and to pay away the same money to the persons employed in the prosecution of the work. Anything less would fail to carry out, literally, the view of the law officers as to the complete setting aside and separation of the loan from other moneys, which is, in their opinion, implied by the word appropriate.\n\nIt can hardly be supposed, however, that the Imperial Parliament had any such operation in view. If it had not, then the keeping of distinct accounts, and the expenditure, without commingling or equalising to that extent, on the road, would seem to be a satisfactory and rational compliance with the provisions of the Act.\n\nThe public revenue is the produce of loans and taxes, and is not distinguishable in respect of its origin. That revenue or fund has been increased by the amount of the railway loan; the construction of the work is being proceeded with. Parliament has authorised the \"payment\" of the requisite amount out of that general fund to meet the outlay.\n\nThe Board cannot regard the appropriation by Parliament as a direction to deal with it in specie, but only as an authority to the proper officer to pay out of the general fund for the specific object for which the appropriation is made.\n\nSecond.—But the Law Officers would appear to admit that there may be some sort of an investment into which the loan could properly be placed, viz., one \"the rate of which does not fluctuate, and which is convertible at any moment without loss.\"\n\nIf this be granted, it is a sufficient answer to say that the Board consider the securities which have been set apart as of that character.\n\nIf, in the realisation of these securities, there would be any loss, that loss would not fall on the Intercolonial Fund, but on the general revenue of Canada.\n\nIt would seem as if the Law Officers of the Crown considered that any loss in the value of the securities would be charged to the Intercolonial Fund, and diminish it by so much; and that the Government of Canada was not under the obligation of making the loss good.\n\nThe Board cannot take so restricted a view of the responsibility of the Canadian Government.\n\nOn the contrary, they believe that the duty of managing the fund devolved on them, and that it carries with it the corresponding obligation of making it good against loss and disaster of every kind, and of expending the total sum raised on the work, no matter what intermediate diminution from failures, depreciation or other losses, may take place.\n\nThe Canadian Government know that the securities set apart are convertible at any moment before the money is required, with certainly no loss whatever to the fund, and probably no loss even to the Government.\n\nThird.—The Law Officers consider that the temporary application of the loan to the reduction of the debt of Canada is not an appropriation of the money.\n\nThe Board cannot but take exception to the form in which the operation is made to appear by the expression which the Law Officers, in their first opinion, made use of, viz., \"paying off with the Railway Loan Canadian Provincial debts,\" inasmuch as there was really an investment in the Exchequer Bills of the Dominion of the Intercolonial money to the extent to which it was applied in reduction of debt. For the payment of these Exchequer Bills the whole revenues of the Dominion are pledged by anticipation.\n\nThe Law Officers admit that the money may be invested in some form, and that there may be a class of investment within the provisions of the Imperial Act. They add, that the securities of the Government of Canada may be a useful investment of the money raised, but do not seem to be an appropriation of it.\n\nIf it be admitted that the loan may lawfully be invested at all, and that securities, which are immediately convertible and not of a fluctuating nature, would be an investment within the provisions of the Act, the only other question would seem to be, who is to judge whether\nwhether those conditions have been satisfied. Her Majesty's Government, or the Government of the Dominion, on whom the responsibility of making good any losses that may arise, rests?\n\nThe Board fail to see why, if an investment in securities of the character described by the Law Officers would be within the provisions of the Imperial Act, an investment in the securities of Canada, which, in the opinion of its Government fulfill, and which it has never been alleged do not fulfill, the conditions which the Law Officers lay down, should not be equally within its provisions.\n\nEarl Granville, in the conclusion of his Despatch, expresses the hope, that the Canadian Government, even if they do not concur in the views he has been led to entertain, will acquiesce in the propriety of avoiding all occasion of evil, by placing the money in the shape of a distinct fund applicable in its entirety, and at any moment, to the object for which it is destined.\n\nThe Treasury Board, while sensible of the courteous terms in which his Lordship expresses this hope, and in which he declares his full conviction in the power of the Canadian Government to replace at any time the sums which have been employed by it, believe that Her Majesty's Government would not desire to suggest the adoption of any course which, on due consideration, might be shown to involve an abnegation, on the part of the Canadian Government, of their constitutional responsibility, or which would inflict unnecessarily a heavy loss on the Canadian Exchequer.\n\nThe Board fail to see, after the fullest consideration of all the arguments that have been used, that, in dealing with the money, Canada has exceeded its constitutional right, or that the Government have done anything which was not their bounden duty; and they equally fail to see that there has been any technical departure from the wording of the law. The case has been put as if a permanent application of a portion of the loan to another purpose had taken place, or been contemplated, instead of, as is the fact, that Canada wished to procure some temporary return for moneys which she could not at the time, by any possibility, employ for the purposes of the work; and which, if not placed in security, would have been unproductive, and thereby have subjected her people to serious loss. The ability of Canada to meet the obligations of the present is now acknowledged by Her Majesty's Government; the most rapid prosecution of the work practicable is unquestioned, but it is yet asked that the money may not be used in the interval at all; that it may be set aside and kept intact without any regard to the question of productiveness; that this loss of interest must be incurred, although an opportunity of investing a portion productively has offered, and although the character of the investment is admittedly undoubted!\n\nIf, at the time the loan was contracted, the Government of Canada could have placed the amount with their bankers at a reasonable rate of interest, they would undoubtedly have done so, and made other arrangements respecting the maturing debt. They were, however, compelled to avail themselves of the only safe investment which offered, their own bonds, which they were about issuing, and they desire to call Lord Granville's attention to the fact that they did, by Order in Council, at that time create a distinct fund for the loan, and set the securities in which that fund was invested aside, to be applied when realised to the object for which the loan was destined. As those securities mature, or can be advantageously placed, the cash will, in like manner, be set aside as a distinct fund.\n\nWhile ready to give every consideration to any suggestion on the part of Her Majesty's Government, the adoption of which may not be at variance with the duty which the Government of Canada believe is imposed upon them of managing this fund, subject only to their constitutional responsibility towards the Parliament and people of Canada, the Board would desire to call his Lordship's attention to the aspect of the case which is now presented, and to the fact which is shown in the previous Minute of Council, that ever since the money was advanced there has existed during a very brief interval, by a very insignificant amount, been a larger sum available at their bankers than the total amount of the guaranteed loan. They would also remind his Lordship that the Government have special credits beyond this, amounting to 750,000 L sterling, which are practically so much money on call with their bankers, available at any moment for the purposes of the work, while securities of the most undoubted character, on which they could obtain further advances or dispose of at any moment, have been set apart to meet the drafts on this loan.\n\nThey would further call his attention to Statement Number 1, attached to the Minutes of Council of the 18th of June last, by which it will be seen that a special account is kept in the books of the Canadian Treasury for this loan. The Government have already made full provision to meet the outlay on the work to the extent of the loan, and the amount stands in the books of the Treasury as a separate fund, distinguished from the accounts for all other works. They cannot but believe that these arrangements already made fully carry out the hope expressed by his Lordship that the amount raised should be placed to a distinct fund, available at any moment to the object for which it is destined.\n\nIt is unnecessary to say that it has been, and is, the anxious wish of the Canadian Government to fulfil with impartial exactitude all the duties in sense both the letter and the spirit of all their undertakings towards Her Majesty's Government connected with this loan. The Board are therefore unwilling to believe, in view of the fuller explanations now given, that Earl Granville will fail to recognise in the measures which were adopted at the outset for placing this fund beyond the reach of any possible loss, not only a practical evidence\nCANADA RAILWAY LOAN ACT (1867).\n\nevidence of this desire, but a satisfactory compliance with the law. They feel assured that his Lordship will acknowledge it to be their duty to guard the public Exchequer of Canada from unnecessary loss, and that he would not urge any course which the Canadian Government might conceive to conflict, not only with that duty but with the constitutional obligations they owe to Parliament.\n\nTreasury Board, Ottawa, 11 August 1869.\n\n— No. 5. —\n\n(No. 117.)\n\nCopy of DESPATCH from Governor the Right Honourable Sir John Young, Bart., G.C.B., to The Earl Granville, K.G.\n\nGovernment House, Ottawa, Canada,\n30 October 1869.\n\nMy Lord,\n\nWith reference to previous correspondence, I have the honour to transmit to your Lordship a copy of a Minute of the Privy Council of Canada, respecting the investment of the Intercolonial Railway money.\n\nI have, &c.\n(signed) John Young.\n\nEnclosure in No. 5.\n\nCopy of a Report of a Committee of the Honourable the Privy Council, approved by His Excellency the Governor General, on the 2nd of October 1869.\n\nThe Committee have had under consideration the accompanying Report, dated 11th August 1869, from the Honourable the Minister of Finance, submitting certain correspondence had by him with the Bank of Montreal, on the subject of the balances in the hands of that institution, and the disposal to it of, or the advance by it on, the bonds of the Great Western Railway Company, and recommending the same for your Excellency's approval.\n\nThe Committee respectfully report their approval of the arrangements made by the Minister of Finance, as stated in the correspondence, and recommend that the bonds of the Great Western Railway Company be delivered to the Bank of Montreal, on their being obtained from that company.\n\n(Certified) Wm. H. Lee,\nClerk, Privy Council.\n\nThe Minister of Finance has the honour to bring under the consideration of his Excellency in Council the correspondence had by him with the Bank of Montreal, on the subject of the balances in the hands of that institution, and the disposal to it of, or the advance by it on, the bonds of the Great Western Railway Company, and to recommend the same for his Excellency's approval.\n\n(signed) John Rose,\nMinister of Finance.\n\nOttawa, 12 August 1869.\nDear Sir,\n\nOttawa, 5 August 1869.\n\nReferring to the conversations we had on the subject of the balances at the credit of the Government with the Bank of Montreal, on which the Government desired to obtain interest, and to the difficulty under which the bank laboured in meeting its wishes, owing to the large amount of unemployed money at its disposal, and to the existing arrangements as to the surrender of the arrangement now concluded with me, colleagues, and now submit a memorandum of the arrangements which the Government is prepared to make.\n\nYou will perceive that we propose to embrace in this plan the payments on account of the Intercolonial Railway from the balances we have in hand, and on account of which loan it is our object to provide some return.\n\nWhile the Government anticipate that these payments will extend over a considerable period, yet they cannot guarantee that they will do so; but the amount must be considered at the disposal of the Government for the purpose of the work, whenever required; and you will understand that these payments may involve the considerable one at an early day, on account of the purchase of the Eastern Extension Railway, should the Government decide to acquire that work. With respect to the rate of interest to be allowed, which we have more recently discussed, the Government would have been glad if the bank could have seen its way to make it four per cent.; but they have given consideration to the point you mentioned, that the payments on Government accounts may considerably exceed the amount of the new Great Western Railway Bonds, and thus have been disposed in addition to that extent at a low rate of interest. Having due regard to this possibility, and believing it desirable to make provision, at a certain fixed rate, for having the entire amount of the bonds available as a cash balance for the construction of the Intercolonial Railway, they think the rate of 3½ per cent., on the whole to be fair, and acquiesce in it accordingly.\n\nYou will perceive that the first proposal contemplates the transference from current account of a sum beyond what is now held in special deposit.*\n\nIf the arrangement now proposed is carried out, the Government would not contemplate using the credit for 500,000 l., referred to in a previous correspondence.\n\nI am, &c.\n\n(signed) John Rose,\nMinister of Finance.\n\nE. H. King, Esq.,\nManager, Bank of Montreal, Montreal.\n\nMEMORANDUM.\n\n1st. The bank to renew the amount now at special deposit, and to receive such further amount as may be agreed on by transfer from the ordinary account. The bank, in addition, to place to the credit of the Government the amount of the Great Western Railway Company's bonds at par. These bonds are to be handed over to the bank, and the bank may either purchase them at par, with the guarantee of the Government for their payment at maturity, or may regard the amount as an advance made to the Government for the term of these bonds, the bank continuing to hold the bonds of Canada, now in its possession as a guarantee for the payment at maturity of the Great Western Railway bonds in either case; it being understood that if the bank elects to make an advance, the rate of interest on such advance shall not exceed 4 per cent. per annum.\n\n2nd. These sums to be placed to a special account, to be called Intercolonial Railway Construction Account, and to be drawn on solely for the purpose of the railway, according to the progress of the works; the amounts at the credit of the account to bear 3½ per cent. interest until the entire sum is exhausted.\n\n3rd. The bank to make arrangements for the payment of such money as may be required at the points on the line of the Intercolonial Railway, which may be indicated by the Commissioners; the bank having the use, free of charge, of the building at Chatham, recently leased by the Government, not to be subject to any other charge than the actual cost to the bank of making such payments.\n\n(signed) John Rose,\nMinister of Finance.\n\nOttawa, 5 August 1869.\n\nDear Sir,\n\nMontreal, 9 August 1869.\n\nI have the honour to acknowledge the receipt of your letter of the 5th instant, accompanied by a memorandum of the arrangement which the Government is prepared to make for the purpose of providing for the expenditure upon the construction of the Intercolonial Railway, out of the following sources:\n\n1st. From the special deposits now held by this bank.\n\n* I should be glad if you would inform me whether you acquiesce in this, or still desire to limit the transfer to the sum held in special deposit?\nCANADA RAILWAY LOAN ACT (1869).\n\n2nd. From the sale at par, with the guarantee of the Government, of the bonds of the Great Western Railway Company, bearing interest at 4 per cent. per annum to the extent, as I understand, of about 500,000 £ sterling, or a loan for an equal amount for the term of these bonds by the bank to the Government, at a rate of interest not exceeding 4 per cent. per annum; the bank continuing, in either case, to hold the bonds of Canada, now in its possession, until the maturity of the Great Western Railway bonds.\n\n3rd. From a further special deposit derived from the current balances at the credit of the Receiver General.\n\nI am prepared on the part of the bank to meet the wishes of the Government, so far as the first and second sources, from which the amount is to be derived, and in the meantime, make a loan upon the Great Western Railway bonds at par, for the term they have to operate.\n\nI do not see, at present, that the bank could make an absolute purchase of these bonds at par; but I shall be glad to retain the option.\n\nWith regard to the third source, from which this sum is to be derived, I regret that it is not possible for the bank to meet the wishes of the Government. The bank has been embarrassed for some months past with about four or five millions of dollars of gold, absolutely idle, and for a good portion of which the bank has been paying interest to the Government on special deposits. There is no safe and profitable employment for this large surplus in Canada, combined with the certainty of prompt realisation in case of need; and I may mention that the bank has at this moment under consideration the propriety of making a considerable reduction in the rate of interest upon short advances, covered by railway receipts and bills of lading, with a view of finding temporary employment for its funds. I trust, therefore, that it will be satisfactory to the Government to carry out the proposal arrangements, subject to the above exception.\n\nThe balances at the credit of this proposed account will bear interest at the rate of 3½ per cent. per annum.\n\nI am, &c.\n\nE. H. King,\nMinister of Finance.\n\nOttawa, 11 August 1869.\n\nDear Sir,\n\nIn reply to your letter of the 9th instant, I beg to say that, though I regret that you are not prepared to accept a transfer of a further amount from the present large current balances now in deposit with the bank, the Government, after due consideration, is prepared to assent to the modified terms suggested by you in that letter, with this qualification, that we wish to have the option of maintaining and receiving interest on the balances proposed to be placed to the credit of the Intercolonial Railway Fund; in other words, to deposit from time to time to its credit, from our current balances, amounts equal to the expenditure on account of that fund, if the state of those working balances will permit.\n\nAs you cannot acquiesce in my proposal to transfer a further amount from the current balances, to the credit of the special account, I beg you will be good enough to remit, on the most favourable terms in your power, as early as may be, the sum of 100,000 £ sterling to Messrs. Darling Brothers & Co., for account of the Government, advising me, in due course, of details.\n\nI am, &c.\n\nE. H. King, Esq.,\nManager,\nBank of Montreal, Montreal.\n\n(signed) John Rose,\nMinister of Finance.\n\n— No. 6. —\n\n(No. 163.)\n\nCopy of DESPATCH from Governor the Right Honourable Sir John Young, Bart., o.c.u., to The Earl Granville, k.g.\n\nGovernment House, Ottawa, 22 December 1869.\n\nMy Lord,\n\n(Answered, No. 12, 16 January 1870, page 23.)\n\nWith reference to your Lordship's Despatch of 30th November (No. 216*), acknowledging the receipt of my Despatch, No. 112,* of the 28th October last, enclosing a copy of the Minute of Council, dated the 11th August, on the subject of the Intercolonial Railway Loan, and observing that you would have been glad to have received the Minute at an earlier date,—\n\nI have the honour to state, in explanation, that though the Minute bears date as having passed the Council on the 12th August, it did not receive my assent until the 2nd October. The delay occurred in this way: I had left Quebec for the Maritime Provinces before the 12th August, and the Minute did not reach...\nreach me until my arrival in Halifax some weeks later. When it did reach me I was in doubt whether it would prove in exact conformity with your Lordship's instructions, and I held it over, Mr. Rose having left Ottawa, until I could personally confer with the Premier. He was indisposed during the few days I passed in Ottawa between my tour in the Maritime Provinces and that which I had engaged to make in Ontario. So that, after all, my doubts had to be resolved by correspondence, which they accordingly were; and on the 2nd October I returned the Minute, approved, from Niagara, where I was at the time. On my return to Ottawa I transmitted the Minute so soon as I received the authenticated copy from the Clerk of the Privy Council.\n\nThe delay was therefore occasioned, in the first instance, by my absence from the seat of Government at so great a distance as Halifax; and secondly, by my anxiety not to give my approval to any disposition of the funds in question until I could be fully assured that it was in conformity with your Lordship's instructions.\n\nI have, &c.\n(signed) John Young.\n\n---\n\nNo. 7.\nRight Hon. Sir John Young, Bart., G.C.B., to Earl Granville, K.G.\n\nCOPY of TELEGRAM from Governor the Right Honourable Sir John Young, Bart., G.C.B., to The Earl Granville, K.G.\n\n(Received, 30 April 1870.)\n\nI have requested Sir F. Hincks to give me a correct version of his remarks, and the Ministers to furnish for your information a statement of present position of Intercolonial Railway Loan Funds.\n\nOttawa.\n\n---\n\nNo. 8.\nGovernor Sir J. Young, Bt., G.C.B., to Earl Granville, K.G.\n\nCOPY of a DESPATCH from Governor the Right Honourable Sir John Young, Bart., G.C.B., to The Earl Granville, K.G.\n\nGovernment House, Ottawa,\n21 April 1870.\n(Received, 6 May 1870.)\n\nMy Lord,\n\nWith reference to your Lordship's telegram of the 18th instant—\n\n\"Early explanation required of statement by Minister of Finance in budget speech, that Law Officers' opinion as to railway loan will not be followed.\"\n\nI have the honour to enclose a statement furnished to me by Sir Francis Hincks.\n\nFrom this paper it appears, that of the unexpended balance of the Imperial Guaranteed Loan for the Intercolonial Railway, amounting to $5,733,763 dollars 76 cents, there are lying on deposit in the Bank of Montreal, $4,799,784 dollars.\n\nIn India bonds in London - - - - - - - - 681,333\n\nMaking - - - - - - - - - - - - - - 5,481,117\n\nParagraph 2 of an instruction to the Montreal Bank, dated 2nd October 1869, a copy of which was sent in my Despatch, No. 117,† 30th October 1869, states, with regard to the first of the above items,\n\n\"There seems to be placed to a special account, to be called Intercolonial Railway Construction Account, and to be drawn on solely for the purpose of the railway, according to the progress of the works; the amounts at the credit of the account to bear 3½ per cent. interest until the entire sum is exhausted.\"\n\nFurther, there is in deposit at call in the chartered banks a sum of $1,814,769.\nCANADA RAILWAY LOAN ACT (1867).\n\n1,814,769 dollars 90 cents, more than covering the unexpended balance of the Guaranteed Intercolonial Railway Loan. So that the Intercolonial Railway money is more than covered without referring to the Imperial Guaranteed Bonds (200,000 l. sterling) for the purchase of the Hudson's Bay Territory, which have not yet been negotiated, although the full amount has been deposited.\n\nSir J. Rose was authorised by the instructions he received from the Canadian Government to offer explanations in England, and negotiate in reference to the matter in hand. A copy of these instructions was duly transmitted to your Lordship in my Despatch, No. 98, 4th September 1869, and the Ministers here understood, unofficially, of course, from Sir J. Rose, that he had offered explanations which were accepted as satisfactory at the Treasury. I was not informed of their having been offered, nor of their result, and considered myself still bound by your Lordship's instructions of 1st June 1869 (No. 97). No opportunity, however, was afforded for acting upon those instructions, for no paper has come before me, nor a proposition of any kind been submitted in reference to these moneys since I wrote my Despatch of 30th October 1869, No. 117.\n\nI have, &c.\n\n(signed) John Young.\n\nEnclosure in No. 8.\n\nIn obedience to your Excellency's instructions that I should enable you to reply to Earl Granville's telegram requesting an explanation of some remarks made by me in the House of Commons on the 7th inst., in my speech on the Budget, to the effect that the opinion of the Law Officers of the Crown regarding the impropriety of the Intercolonial Railway Loan had been disregarded, I have the honour to report that, after consulting several newspapers, I find such a discrepancy in the reports, that I think it will be more satisfactory if I should explain substantially what passed on the occasion referred to. Before doing so, I may observe that all the transactions connected with the Intercolonial Railway Loan occurred before I became a Member of the Government. I had ventured to hope that, as no intimation to the contrary had been given to the Canadian Government, the Minute of the Treasury Board of the 11th August 1869, approved by the Privy Council Minute of the 20th of that month, had been deemed satisfactory by Her Majesty's Government; and when the Opposition Members renewed, during the present Session of Parliament, the attack on the policy of the Government regarding the Intercolonial Loan which they had commenced during the previous Session, I considered it my duty to maintain and defend that policy.\n\nThe subject had not in any way been referred to by me in my speech on the 7th inst., bringing forward the Budget, but at a later hour of the evening the Opposition demanded explanations on the subject of the Intercolonial Loan, and especially as to whether there had been any opinions which had been given by the Crown Law Officers. These opinions, however, could have been given, viz., that it had not been found possible to act in accordance with those opinions, but that, as no reply had been received to the Minute of the Canadian Government pointing out the impracticability of acting in accordance with the opinions of the Crown Law Officers, we had a right to assume that the Imperial Government were satisfied with our explanations, and that we had made no change in our arrangements.\n\nOn reference to the Canadian Treasury Minute of the 11th August 1869, to the Despatches of Earl Granville, and to the opinions of the Law Officers, it will, I think, be apparent not only that it would be impossible to give effect to those opinions, but that Earl Granville has not instructed your Excellency to adopt any measures with a view of trying to do so. The Law Officers declare: \"We think that it was not the intention of the Imperial Legislature that the money should be invested at all; it was to be appropriated or set aside.\" Again, \"The only sort of investment within the provisions of the Imperial Act would be, we think, an investment (if any such exists or can be created), the value of which does not fluctuate, and which is convertible at any time without loss.\" The Law Officers were evidently of opinion that no such investment, as in their opinion was allowed within the provisions of the Imperial Act, was to be found, or could be conceived; but they failed to give any intimation as to what, in their opinion, would be a legal disposal of the money.\n\nThe Treasury Minute has, in my opinion, shown conclusively that it would be quite impossible to act on the opinion of the Law Officers.\n\nBut I submit that Earl Granville has not instructed your Excellency to attempt to give effect to that opinion. His Lordship, in his Despatch of 8th July 1869, points out to your Excellency that \"the first of those opinions more than bears out the conclusion at which I had arrived,\" and which was communicated to your Excellency in his Lordship's previous Despatch of the 1st June, which was, \"to refuse your concurrence, in any mode, of dealing with the money remaining in the hands of Government, other than that of investment properly so called.\" In the Despatch of 8th July, his Lordship hoped that the Canadian Government would avoid all occasion of censure, \"by placing the money in the shape of a distinct fund, applicable in its entirety, and at any moment, to the object for which it is destined.\"\n\n244.\nI submit that there is a very wide difference between the instructions of Earl Granville, and the opinion of the Crown Law Officers. Earl Granville distinctly recognises the propriety of investing the money, provided it can be made applicable at any moment to the object for which it is destined. The Law Officers declare that it was not the intention of the Imperial Legislature that the money should be invested at all, and that no investment would come within the provisions of the Act, unless one which does not fluctuate, and which is convertible at any moment without loss. I do not find, in any of the Despatches, a suggestion as to the kind of investment which, in the opinion of Earl Granville, would meet the requirements of the Act.\n\nIt is clear that the securities, which have been always held to be the best in England, and in which trust funds of all kinds are habitually invested, would not satisfy the requirements of the Law Officers; and I submit that the Canadian Government has, from the first, literally complied with the requirements of Earl Granville. There has always been \"a distinct fund, applicable in its entirety, and at any moment, to the object for which it is destined.\"\n\nEarl Granville has never prescribed any particular mode of investment; and I own that I fail to comprehend how the Imperial Government can object to a mere temporary investment in Canadian Securities, when they have sanctioned the investment of the sinking fund in similar securities. I believe that the objection originally taken to the transaction was founded on misconception.\n\nIt was assumed that the money had been employed in paying off a debt of the Dominion, and that no special fund had been created.\n\nThe real facts were these: the Dominion had a floating debt at the time, which there would not have been the slightest difficulty in funding, but considerable sums were likely to be paid into the Canadian Treasury at a comparatively early period, which rendered it undesirable to issue debentures at a long date. The Canadian Parliament had agreed to issue stock at par to insurance companies, to be held as a special deposit for the security of policy-holders, and it was known that there would be an early demand for such stock. There was likewise a large debt due to the Government by the Great Western Railway Company, which, by agreement, was to be paid off at an early period, and which was in the shape of negotiable bonds.\n\nIt was, therefore, deemed more expedient to issue Exchequer Bills, which, being receivable for all debts due to Government, were equivalent to gold, instead of being a loan, payable at a distant period. All these arrangements would have been made without reference to the Intercolonial money. When it became necessary to invest that money temporarily, these Exchequer Bills were considered the most eligible mode of investing the money, and the correctness of Sir John Rose's anticipations has been proved by the fact that upwards of $3,000,000 dollars of these Exchequer Bills have been already paid off. It is no doubt true, that the money invested in the Exchequer Bills was used for paying off a floating debt of the Dominion, which would otherwise have been paid off with the money which was subsequently used to redeem the Exchequer Bills. In the absence of all information as to what are the views of Her Majesty's Government as to the kind of investment that they consider admissible, I am unable to judge whether Earl Granville would be satisfied with the present position of the Intercolonial account, but I have no doubt that your Excellency would wish me to state exactly how it stands. The proceeds of the Imperial Guaranteed Loan, as stated in the Minute of 18th June 1869, were 7,403,654.76 Dollars.\n\nExpended on works to this date - - - - - - - - 1,000,801\n\n6,732,763.76 Dollars.\n\nTo meet this there is at interest in the Bank of Montreal, on the condition that it is to be drawn for as required for the Intercolonial Railway - - - 4,709,764 Dollars.\n\nIndia Bonds in London - - - - - - - - 681,333\n\n5,481,117 Dollars.\n\nThere is in deposit at call in the chartered banks a sum of $1,814,700.00, and the Imperial Guaranteed Bonds (300,000 sterling), for the purchase of the Hudson's Bay Territory, have not yet been negotiated, although the full amount has been deposited. The expenditure on the work will, for some time to come, be met out of the money the receipt of the Government with the chartered banks, not having been erased. I must observe that a portion of the special deposit in the Bank of Montreal consists of the Great Western Railway bonds, which the bank made an advance on to the full amount. Sir John Rose having been of opinion that it was more desirable to have that sum at call in the bank than in bonds of a railway company.\n\nI trust that the foregoing explanation will supply your Excellency with the information which you require.\n\n20 April 1870.\n\nF. Hincks, Minister of Finance.\nDespatches from the Secretary of State.\n\n— No. 1. —\n\n(Copy of DESPATCH from The Earl Granville, K.G., to Governor the Right Honourable Sir John Young, Bart., G.C.B.)\n\nSir,\n\nDowning-street, 1 June 1869.\n\nThe Treasurer of the Dominion has recently transmitted to this Department a paper presented to the Canadian Parliament, containing, among other documents, a Minute of the Privy Council, approved by the Governor General on the 27th of August last.* It would appear that under that Minute money raised under Imperial guarantee for the construction of the Intercolonial Railway was to be temporarily applied to the purpose of defraying the general debts of the Dominion.\n\nThis mode of employing a loan guaranteed by the Parliament of this country for a specific purpose appears to Her Majesty's Government not to be justifiable. I wish, therefore, to learn from you to what extent and in what way the loan has been employed under authority of that Minute, and I have to instruct you to refuse your concurrence in any mode of dealing with the money remaining in the hands of Government other than that of investment properly so called.\n\nI should also wish to receive from Mr. Rose any observations respecting the Minute of 27th August which he may consider calculated to remove the strong objections which at first sight attach to it.\n\nI have, &c.\n\n(signed) Granville.\n\n— No. 2. —\n\n(Copy of DESPATCH from The Earl Granville, K.G., to Governor the Right Honourable Sir John Young, Bart., G.C.B.)\n\nSir,\n\nDowning-street, 8 July 1869.\n\nI have acknowledged your Despatch, No. 67,† of 20th June, transmitting a Minute adopted by the Privy Council of Canada in relation to my Despatch, No. 97,‡ of 1st June, relating to the disposal of moneys raised under Imperial Guarantee for the construction of the Intercolonial Railway.\n\nI desire, first, to explain that in requesting you to submit this question to Mr. Rose for his observations, my only object was to obtain information from that member of your Government who was presumably most competent to give it, and not, as your Ministers appear to suppose, to fasten on Mr. Rose any special or personal responsibility.\n\nYou will assure your Advisers that I have never had any intention to call in question the financial integrity and upright dealing of the Dominion of Canada, still less the personal honour of Mr. Rose and his colleagues.\n\nI have been led to the conclusion that the spirit, if not the letter, of the Canada Loan Act (30 Vict. cap. 16, Imperial) required that all money raised under it should not only be expended on the construction of the Intercolonial Railway, but \"appropriated\" to that purpose; that is, that it should be kept or invested as a distinct fund applicable to that construction, and to no other purpose.\n\nI enclose copies of two opinions of the Law Officers of the Crown, sought and given, I can assure you, with no unfriendly feeling towards the Canadian Government, nor any wish to impose on them any obligation beyond what is implied in the terms of the arrangement as sanctioned by Parliament.\n\nYou\n\n* Vide House of Commons Paper, No. 472—I. of 17 June 1869, page 18.\n\n† Page 4.\n\n‡ Above.\nYou will observe that the first of these opinions more than bears out the conclusion at which I had arrived, and that this opinion is not altered by the Minute of your Privy Council which I at once referred to them.\n\nI have full confidence in the power of the Canadian Government to replace at any time the sums which have been so employed, under a belief that there could be no doubt as to the propriety of that course. The opinions of the Law Officers and the Treasury, whom I have consulted, show that that belief is not well founded.\n\nWith these opinions before them, your Advisers will, I am sure, see that my Despatch was not written hastily or without necessity. And even if they do not concur in the views which I am led to entertain, I hope they will acquiesce in the propriety of avoiding all occasion for evil by placing the money in the shape of a distinct fund applicable, in its entirety, and at any moment, to the object for which it is destined.\n\nI have, &c.\n\n(signed) Granville.\n\nEnclosure 1, in No. 2.\n\nMy Lord,\n\nTemple, 28 June 1869.\n\nWe are honoured with your commands signified in Sir Frederic Rogers' letter of the 17th instant, stating—\n\n1. That he was directed by your Lordship to request that we would favour your Lordship with our opinion upon the following case.\n\n2. That by the Imperial Act, 30 & 31 Vict. c. 16, the Commissioners of Her Majesty's Treasury were empowered to guarantee payment of interest at a rate not exceeding 4 per cent., per annnum, on any principal money not exceeding 3,000,000 l. sterling, to be raised by way of loan by the Government of Canada for the purpose of the construction of a railway connecting Quebec and Halifax.\n\n3. That by the 3rd section of the Act, this guarantee was not to be given until certain provisions had been embodied in an Act of the Parliament of Canada, and that he was directed to call our attention to the first of these provisions which related to the \"Appropriation,\" for the purpose of the construction of the railway, of a loan not exceeding 3,000,000 l. sterling.\n\n4. That an Act of Parliament of Canada was in due course passed, 31 Vict. c. 13, and that a copy of it was annexed for reference.\n\n5. That it would be seen that the Act was in operation, and that it might be assumed that that Act fulfilled the requirements of the Imperial Act, though it had not received as yet the formal sanction of Her Majesty.\n\n6. That subsequently to the passing of that Act a loan was raised, and the substance of the terms and conditions upon which the loan was raised, and the form of debentures, would be seen from the letter of the 11th July 1868, from Mr. Rose, the Financial Minister to the Treasury, and from the reply thereto of the 15th July, and that copies of those letters were annexed for reference.\n\n7. That from a Minute of the Privy Council of Canada, approved by the Governor General on 27th August 1868, it appeared that the money raised under the Imperial guarantee for the construction of the railway, was to be temporarily applied to the purpose of defraying certain debts of the Dominion bearing a high rate of interest, and that a copy of such Minute was annexed for reference.\n\n8. That the Minute gave rise to an inquiry in the House of Commons, whether such application was not in contravention of the Canada Railway Loan Act, 1867, and a full report from Mr. Rose, the Financial Minister, which was approved of by the Privy Council of the Dominion, had lately been received in answer to such inquiry, and that a copy of such report was annexed for reference.\n\n9. That under these circumstances our opinion was requested on the following questions:—\n\n1. Whether this appropriation of the proceeds of the loan was in contravention of the Canada Railway Loan Act, 1867, or;\n\n2. Whether in the absence of any special provision as to the custody or investment of the proceeds of the loan until they were wanted for the purpose for which they were raised, the Canadian Government were, or were not, within their legal rights in making this temporary use of the paid-up instalments?\n\nIn obedience to your Lordship's commands we have considered the questions submitted to us, and have the honour to report,\nCANADA RAILWAY LOAN ACT (1867).\n\nThat we regret to be unable to advise that the investment of the money, under the Minute of the Privy Council of Canada, is in conformity with the Imperial Act of 30 & 31 Vict. c. 16.\n\nWe think that it was not the intention of the Imperial Legislature that the money should be invested at all; it was to be appropriated or set aside. The only sort of investment within the provisions of the Imperial Act would be, we think, an investment (if any such exists or can be conceived) the value of which does not fluctuate, and which is convertible at any moment without loss. Paying off with the railway loan, Canadian Government debts bearing a high rate of interest, may be, perhaps, an useful investment of the money raised, but does not seem to us to be an appropriation of it; and we think, therefore, that the spirit and intention of the Canada Railway Loan Act, 1867, has not been complied with.\n\nWe have, &c.\n\nThe Earl Granville, K.G.\n\nMy Lord,\n\nWe are honoured with your commands signified in Sir F. R. Sandford's letter of this date, stating that he was directed by your Lordship to forward an enclosed copy of a Despatch from the Governor General of Canada transmitting a copy of a Minute adopted by the Privy Council of Canada on the 18th June last, on the subject of the Intercolonial Railway Loan, and further stating that your Lordship requested to be informed, at the earliest possible date, whether the Minute affected the opinion expressed by us in our letter of the 28th June.\n\nIn obedience to your commands we have the honour to report,\n\nThat the Minute does not affect the opinion expressed by us in our Report of the 28th June.\n\nWe have, &c.\n\nThe Earl Granville, K.G.\n\n(No. 216.)\n\nCOPY OF DESPATCH from The Earl Granville, K.G., to Governor the Right Honourable Sir John Young, Bart., G.C.B.\n\nSir,\n\nDowning-street, 30 November 1869.\n\nI have the honour to acknowledge the receipt of your Despatch, No. 112, of the 28th October, enclosing a copy of a Minute of the Privy Council, dated the 12th of August, on the subject of the Intercolonial Railway Loan.\n\nAs this is a subject in which the Imperial Government is much interested, I should have been glad to have received the Minute at an earlier date.\n\nI have, &c.\n\n(signed) Granville.\n\n(No. 12.)\n\nCOPY OF DESPATCH from The Earl Granville, K.G., to Governor the Right Honourable Sir John Young, Bart., G.C.B.\n\nSir,\n\nDowning-street, 15 January 1870.\n\nI have to acknowledge your Despatch, No. 163, of 22nd December, explaining the cause of the delay in forwarding a copy of the Minute of Council of 12th August, on the subject of the Intercolonial Railway Loan.\n\nYour Despatch furnishes a full and complete explanation of the delay.\n\nI have, &c.\n\n(signed) Granville.\nNo. 5.\n\nEarl Granville, K.C.B., to Governor Sir John Young, Bart., G.C.B.\n\n19 April 1870.\n\nCOPY of DESPATCH from The Earl Granville, K.G., to Governor the Right Honourable Sir John Young, Bart., G.C.B.\n\nSir,\n\nDowning-street, 19 April 1870.\n\nI sent on the 18th instant, at 4 p.m., a telegraphic Despatch to you in the following words:—\"Early explanation requested of statement by Minister of Finance in Budget Speech, that Law Officers' opinion as to Railway Loan will not be followed.\"\n\nI have, &c.\n\n(signed) Granville.\n\nCorrespondence between The Colonial Office and Sir John Rose, K.C.M.G.\n\nNo. 1.\n\nSir Frederic Rogers, Bart., K.C.M.G., to Sir John Rose, K.C.M.G.\n\n10 May 1870.\n\nCOPY of a LETTER from Sir Frederic Rogers, Bart., K.C.M.G., to Sir John Rose, K.C.M.G.\n\nSir,\n\nDowning-street, 10 May 1870.\n\nI am desired by Earl Granville to inform you that it is proposed shortly to lay before Parliament certain papers relating to the investment of the Intercolonial Railway Loan, and that it appears to his Lordship desirable that an account of the actual expenditure and progress of the railway works, and of the obligations assumed up to the present time, should be annexed to these papers.\n\nShould it be in your power to furnish such a statement, Lord Granville would be glad to receive it at your early convenience, together with any other information which your intimate knowledge of the subject may supply.\n\nI am, &c.\n\n(signed) Frederic Rogers.\n\nNo. 2.\n\nSir John Rose, K.C.M.G., to Sir Frederic Rogers, Bart., K.C.M.G.\n\n12 May 1870.\n\nCOPY of a LETTER from Sir John Rose, K.C.M.G., to Sir Frederic Rogers, Bart., K.C.M.G.\n\nSir,\n\nLondon, 12 May 1870.\n\nI have the honour to acknowledge receipt of your communication of the 10th instant, written by direction of Earl Granville, in which you inform me that his Lordship would be glad to receive a statement of the progress of the Intercolonial Railway, of the expenditure on it, and the obligations assumed up to the present time, together with any other information which my knowledge of the subject may enable me to supply.\n\nIn\nIn reply, I have now the honour to say, that it is somewhat difficult to state, with precision, the exact position of the undertaking, and the obligations existing in respect of it. These are daily changing, and the last official reports, of which I have any knowledge, relate chiefly to the considerations which affected the selection of the route, the manner of letting the contracts, &c. I have, however, been favoured with the perusal of statements prepared by the Secretary and one of the Intercolonial Commissioners, giving a very full explanation of the operations up to January last, which I shall have great pleasure in placing at Earl Granville's disposal, and the substance of which I will now communicate.\n\nIt will be remembered that up to July 1868, when the Intercolonial Loan was raised, the route which the Railway would take was undetermined, three lines being then proposed; the one by the Valley of the St. John, the other through the centre of New Brunswick, and the third that now being constructed. Previous to, and during the summer of, 1868, Canada had gone to great expense in exploring these three different routes, in order to place before Her Majesty's Government sufficient information as to the character of the country, the engineering difficulties, and the considerations of national advantage affecting each, so as to enable them to select intelligently the one which would be the most advisable. When Her Majesty's Government did decide on the third route, and authorised the loan, it became necessary to have more minute surveys, with a view to the actual location of the line, and the letting of contracts. The more general explorations had gone as far as it was possible to push them, previous to the decision of the Imperial Government, as to the adoption of the line, and the new location surveys were prosecuted simultaneously at various points, with the largest force available, and without the loss of a day. Advertisements were issued to intending contractors that the profiles, &c., were being prepared, and notifying them to examine the ground for themselves, in anticipation of the accurate reports of the surveys. When it is considered that the greater portion of the line is through a wilderness of forest, and that the working season is very short, it will be admitted that the surveys and engineering preparations made extraordinarily rapid progress. The total length of the road finally sanctioned is about 4884 miles. As soon as small sections were surveyed, and finally located, advertisements were issued for tenders, and the progress and engagements up to this time, as stated in the report of the Commissioner to whom I refer, will show how rapidly the works have been pushed forward.\n\nBy this report it appears—\n\n1st. That a section of 37½ miles, partly undertaken and constructed by an independent Company, has been purchased, and has been running for more than a year, the cash already paid for it being about $800,000.\n\n2nd. That twelve contracts were let in the early part of the year 1869 for 232½ miles more, on all of which substantial progress has been made; the amount of these contracts being about $3,547,022.\n\n3rd. That tenders have been invited by advertisement, for rolling stock estimated to cost $800,000, part of which it is believed is now in course of being built, and that as respects the remainder, offers of ready-made stock may be accepted, and be required to be paid for at any day in cash.\n\n4th. That the rails now being contracted for are estimated to cost $2,500,000.\n\n5th. That the buildings in course of erection, and lands in course of payment, are estimated at $400,000.\n\n6th. That the engineering expenses are about $400,000, making a total outlay or obligations contracted, and in course of payment so far, of $8,537,000, or about 1,750,000 l. sterling. The amount actually paid in cash, exclusive of disbursements for surveys and explorations at the date of the last return, is believed to be about $1,670,000, irrespective of what may have since been paid on the various engagements contracted as already stated.\n\nWhen the character of the work and the severity of the climate which prevents active operations in winter, the difficulty of obtaining labour, of moving materials and plant in many places through an almost impassable forest,\nforest, and of procuring supplies, &c., as well as the peculiar difficulties in the way of locating the exact position of the line, and ascertaining the character of the soil and works to be performed, are considered, it will be admitted that the most untiring energy has been used in pushing on the work. Mr. Brydges, the Commissioner to whom I refer, says in his report:\n\n\"You will see from this statement of what we are doing, that the work is being proceeded with as rapidly as possible, quite as rapidly as is wise in so large an undertaking. If we were to attempt to hurry it more than is now being done, we should let contracts upon insufficient plans, and besides, disturb the labour market, which is very likely to be difficult enough to deal with as it is. I have no doubt we shall get the entire line completed, and in working order during the summer of 1872. It would not be possible, except at an enormous expense, if it could be done under any circumstances, to have it completed before that date.\"\n\nIt will be remembered that the general course of the road was only determined, and the loan for half the estimated cost of the work authorised in July 1868; and if within four years the whole line of 488 miles, running through a country, which by some was stated to interpose such serious physical obstacles as to make them pronounce the undertaking impracticable, is completed and working, it will be admitted that the operations have been prosecuted with remarkable celerity and vigour.\n\nHaving thus detailed the facts as far as they are accessible here, with reference to the progress of the work, it may be considered superfluous to prolong this communication, but as His Lordship has requested me to furnish any other information which my knowledge of the subject may supply, I would briefly say that I think a perusal of the papers noted in the margin, and which are doubtless in His Lordship's possession, will establish the following points:\n\n1st. That the work was one in which it was admitted Imperial interests were concerned, but the execution of which was thrown wholly on Canada and that the utmost possible diligence has since been used by Canada to further its progress.\n\n2nd. That it was necessary to contract the loan at the time it was done; that the conditions of its issue, the dates and manner of payment, and placing the instalments, were left wholly to Canada, on whose Government the entire responsibility of completing the work was devolved.\n\n3rd. That it was never proposed to control Canada in regard to the temporary employment of the money; that any such proposal would have been unwarranted by the provisions of the Act authorising the guarantee; and had it been made, that Canada could not properly have accepted the guarantee coupled with any such conditions.\n\n4th. That the financial agents, Messrs. Baring Brothers & Co. and Messrs. Glyn, Mills, Currie & Co., being only able to obtain interest at the rate of 1 per cent. while Canada was paying 4 per cent., that Government made the most judicious temporary use in its power of the amounts deposited, by investing them, partly in anticipating the sinking fund, partly in its own securities, partly in Exchequer Bills which were intended to be issued to the public to pay off liabilities maturing, partly in India Stock, and partly in special deposits at 4 per cent. with its bankers.\n\n5th. As a special, and perhaps superfluous, measure of precaution, and to meet any possible delay in the realisation of any of these securities, the Canadian Government provided credits with their bankers available on demand, for 750,000 l. sterling, and also specially laid aside, by order of Council, other securities due by third parties and belonging to the Government, and incomings from special sources of revenue, amounting to upwards of 1,000,000 l. sterling more.\n\n6th. That these precautions were dictated by the desire to place the money in the condition of most perfect security while returning some interest that they were at the time deemed to be, and have since been shown, by the result, to have been, wholly unnecessary; because, at no time has Canada had less money lying in cash at her bankers than the amount of the loan, less the expenditure on the works, and she could at any moment have paid the entire amount on demand.\n\n7th. That\n7th. That the special sources of revenue anticipated to come in before the money could be spent on the works and the other securities which were laid aside to meet the outlay have much exceeded the estimated amount, and the securities have actually been realised and are now in the shape of cash deposits with the Dominion bankers, on the condition of being drawn for as required for the Intercolonial works.\n\nI learn that the special cash deposit amounts at the present time to about $4,800,000, the India stock to about $690,000 beyond a general balance of about $1,800,000 cash at call with the Dominion bankers, while the Government also holds 300,000 l. sterling of Imperial guaranteed bonds, representing an equal amount paid to the Hudson's Bay Company out of its own funds. It thus appears that the amount of cash specially deposited and actually available to meet the outlay on the works, represents, with the India stock and the sums spent, about the full amount of the guaranteed loan.\n\nThis, I believe, exhibits in general terms, and as accurately as the means of reference at my command here permit me to give, the actual financial bearings of the case. Under ordinary circumstances I should hesitate to trouble his Lordship with any further observations than a reference to these specific facts; but as the mode in which the money was temporarily used has led to some discussion, I may perhaps be permitted to add one or two words.\n\nThe good faith and credit of Canada have never been questioned. She has met all her engagements with punctuality, and the only other amount guaranteed by England has been paid off long ago. Her revenues are ample for all her expenditure. The Imperial Government was satisfied of this fact, because before the guarantee was authorised an examination was made into her affairs, and the Treasury reported their entire satisfaction with them, and actually authorised the investment of the Sinking Fund, applicable for the redemption of the loan, in her own securities, devolving on Canada the undivided duty of constructing the work, and purposely declining all participation in the operations attending it.\n\nThe guarantee being given, it would seem to suffice, after this admitted ability to repay the loan, if the money raised was expended on the work as rapidly as its nature warranted; and that complaint would be premature until the work was delayed or left undone, or that there was clear evidence of permanent misapplication.\n\nI am not aware that any of the States, whether European or American, who guarantee the bonds of railway corporations, and who devolve on these corporations the sole duty of performing the works—disclaiming all control or interference with them—enquire into the application of the amounts deposited during the construction of the works, provided these are prosecuted with diligence and good faith.\n\nIt is obviously for the interest of the surety that the debtor should so employ the money as to derive a benefit from it, rather than add to his liabilities by the amount of interest unnecessarily lost.\n\nBut, apart from the question of interest, it appears to be emphatically stated by Canada that she would not have accepted the guarantee, nor undertaken the work, if it had been accompanied with any such distrust as the controlling of the funds raised would necessarily have implied.\n\nIt is said, however, that the difficulty is a technical one, founded on the provision of the Imperial Act which directs an \"appropriation\" of the money. It is contended that this wording requires a setting aside in specie of the identical money received, and will not warrant any intermediate use of it whatever.\n\nWhether such an interpretation of the law be critically accurate or not, I fail to discover in what way it would be practically possible to carry it out, except by a course of dealing exceptionally invented for this case, and utterly at variance with the system of monetary affairs throughout the commercial world.\n\nThis point is noticed at length in the Minute of the Treasury Board of Canada of the 11th August 1869, and need not be enlarged upon here.\n\nThe system of payment by cheques and through clearing houses, of depositing money with bankers, the use which it is notorious bankers invariably make of their deposits, must all be set aside if the critical interpretation contended for is to be given to this wording of the Act.\nIt is said that the money could only be invested, if at all, in securities which do not fluctuate. But Consols fluctuate; even the precious metals themselves fluctuate; and could it be supposed to be the intention of Parliament to require this loan to be kept wholly apart in specie, and unproductive during the interval before its disbursement for the purpose it was destined could possibly take place.\n\nApologising for troubling his Lordship with a communication of so much length, I would but finally remark that it appears from these observations that the sufficiency of the securities provided for the temporary employment of the money is shown by the fact of the conversion of the greater part of them into cash long before the time when the money could be expended on the work; that the greater part of the amount is in special deposit in the only way in which the banking usages of the world permits it to be; and that the balance, partly invested in India Bonds, and represented by cash in the general balances at the credit of Canada with her bankers, is equally available at call.\n\nI have, &c.\n\nSir Frederic Rogers, Bart., K.C.M.G. (signed) John Rose.\n\n&c. &c. &c.\n\nCOPY OF DESPATCHES FROM THE COLONIAL OFFICE TO THE GOVERNOR GENERAL OF CANADA, CONTAINING THE OPINIONS OF THE LAW OFFICERS OF THE CROWN RESPECTING THE INVESTMENT OF MONEY RAISED UNDER THE AUTHORITY OF THE CANADIAN RAILWAY LOAN ACT (1867).\n\n(Mr. Monk.)\n\nOrdered by the House of Commons, to be Printed,\n\n18 May 1870.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_32393.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 37, "total-input-tokens": 58798, "total-output-tokens": 29485, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2115, 3], [2115, 4558, 4], [4558, 5064, 5], [5064, 5064, 6], [5064, 8030, 7], [8030, 10542, 8], [10542, 12672, 9], [12672, 18352, 10], [18352, 23774, 11], [23774, 27739, 12], [27739, 33295, 13], [33295, 39315, 14], [39315, 44985, 15], [44985, 49912, 16], [49912, 52555, 17], [52555, 56305, 18], [56305, 58563, 19], [58563, 63275, 20], [63275, 69082, 21], [69082, 75118, 22], [75118, 77396, 23], [77396, 81977, 24], [81977, 86277, 25], [86277, 89285, 26], [89285, 94746, 27], [94746, 99711, 28], [99711, 102878, 29], [102878, 107079, 30], [107079, 109843, 31], [109843, 111924, 32], [111924, 116255, 33], [116255, 120595, 34], [120595, 125007, 35], [125007, 126499, 36], [126499, 126499, 37]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]