[{"id": "a5416501bd09867b7978b66264486d7330e085dc", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [✓] Coloured covers/\n- [✓] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [✓] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol \\(\\rightarrow\\) (meaning \"CONTINUED\"), or the symbol \\(\\nabla\\) (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n\\[\n\\begin{array}{ccc}\n1 & 2 & 3 \\\\\n4 & 5 & 6 \\\\\n\\end{array}\n\\]\nMANITOBA\n\nHISTORICAL AND\n\nScientific Society.\n\nPUBLICATION No. 4.\n\nWINNIPEG COUNTY.\n\nIts Discovery and the Great Consequences Resulting.\n\nREV. PROFESSOR BRYCE, M.A., LL.B.,\nHead of Manitoba College; Délégué de l'Institution Ethnographique de Paris; Corresponding Secretary\nManitoba Historical Society, &c.\nWINNIPEG COUNTRY\n\nIts Discovery and the Great Consequences Resulting\n\nBY REV. PROFESSOR BRYCE, M.A.\n\nAt a well attended meeting of the Historical and Scientific Society last Thursday, the following paper was read by Rev. Prof. Bryce, of Manitoba College. In introducing his paper the Professor spoke of the subject as relating to our own country, and thus coming within the scope of the society, and as being historical and at the same time practical in its tendency. He regarded the history of the North-West as more remarkable than that of any other part of Canada, unless perhaps, the French settlements of the Provinces of Quebec and Nova Scotia.\n\n\"THE WINNIPEG COUNTRY.\"\n\nFrom my title you will gather that it is not my purpose this evening to enter largely into the life of the great discoverer of the Winnipeg region, but rather to show the effect of the discovery of the countries about Lake Winnipeg, in awakening interest and stimulating adventure in the whole region from Hudson's Bay to the Rocky Mountains. It may not have occurred even to those somewhat familiar with the voyages of Verandrye, to connect these with a brilliant era of daring exploration and extensive trade that is found in the Hudson's Bay territories during the latter half of the eighteenth century. It may be necessary, though elsewhere I have endeavored at such length as space permitted, to give a sketch of the work of the brave Verandrye and that of his family, to notice shortly the silent voice of these discoveries. I venture to do this, the more so a number in our rapidly growing community may not be familiar with them, absorbed as they are more in making money than in historic research upon even so interesting a subject as the life of the explorer who, first of white men, set his foot upon the site of the\n\nCITY OF WINNIPEG.\n\nGualtier de Varennes, Sieur de la Verandrye, was a French officer who had distinguished himself in the Marlborough wars, and had come out to the French colony of Canada to seek his fortune. Fortune did not smile upon him. Westward like many another he pushed his way, and in 1730 he was following a fur trader's life at the frontier posts of Michilimackinac and Ste. Marie Lake Superior. He was well known at this time as a trader; there had been a post at Kaministiquia 60 years before this time, as well as a trading station at Nipigon. On the 26th of August, 1731 Verandrye left the shores of Lake Superior at a point 45 miles west of where Fort William now stands. He had an Indian guide, who had submitted to the French government or in Quebec a birch bark map of the route by which he engaged to lead Verandrye. During the first year of his voyage Verandrye reached Rainy Lake; in 1732, Lake of the Woods; and thence he descended Winnipeg River to Lake Winnipeg. The date cannot be recovered without a more diligent search in the archives of Marine and the Colonies, in Paris, when he first reached the junction of the Red River and the Assiniboine. There seems ground for placing it about 1735. In that year he probably built\n\nTHE RED FORT,\n\nin what has now become a part of the City of Winnipeg and which resolves its name Fort Rouge from Verandrye's early fort. In 1738 near the site of the present town of Portage la Prairie the explorer and his party built Fort de la Reine. With the true spirit of voyageurs, one section of these pioneers pushed on, ascended the Souris River in 1742, reached at length the Coteau of the Missouri, and then the Missouri itself. One trembles to think of the danger these travelers unknowingly passed through in leaving the country of the peaceable Ojibeways at Red River and penetrating the district of the Sioux, called by a later traveler the \"Tigers of the plains.\" But further yet their spirits of adventure carried them. Ascending the Missouri they at length came in sight of the Rocky Mountains, and were the first white men north of Central America to set eyes upon them. Verandrye himself and his party in 1748 ascended the Saskatchewan, but when he was about to undertake the crossing of the Rocky Mountains, he died on the 6th of December, 1749.\n\nSuch a record is an extraordinary one. Verandrye's name has not received one tithe of the honor due it. In eighteen years he and his sons traversed from 1,500 to 2,000 miles of a \"terra incognita,\" and yet no monument preserves his memory. While the heroes of war have statues erected in scores in the streets of our great cities, it is only in the last half century that it has occurred to men that the explorers who fights with his difficulties and overcomes them is as worthy of honor as the successful soldier. Verandrye's discoveries filled the people of the United States, then the British Colonies, with envy, while the merchants of England and France saw possibilities of increased trade and larger profits rising out of them. We now proceed to show how the bringing to the knowledge of these\nnations the regions known from the first by the names Winnipeg (spelt Ouinipique) and Assiniboine (spelt in no less than a dozen different ways in the old books and maps,) resulted in a period of enterprise and activity which awakened the echoes of this wide north land. One of the first results we shall notice was the finding in 1742 a route from\n\nLAKE SUPERIOR TO HUDSON'S BAY.\n\nIf previous to Verandrye no white man had ventured over the route from Lake Superior to Lake Winnipeg, much less likely was any one to have undertaken the maze of the lakes and rivers lying between Lake Superior and Hudson's Bay. It is true that in the words of some French Canadian historians, and also in the special pleadings founded on these of the Canadian Government, when engaged in obtaining the North-West from the Hudson's Bay Company, statements are made to a contrary effect. The object of these statements is too evident. It is stated by these writers that two Frenchmen, Groselliers and Radisson, who in 1688 accompanied Gillim in his voyage to Hudson's Bay, and who had undoubtedly been in the Lake Superior district, crossed from Nipigon on Lake Superior to Hudson's Bay. De la Poterie de M. Tremblay made such statements, but their invention to maintain the early claim of France to Hudson's Bay is evident. No account of their journey is given; no route is laid down; and the statements of the different writers are so contradictory and confused as to render them perfectly untrustworthy. Again the Hudson's Bay Company claims to have sent explorers from the shores of Hudson's Bay to the prairie country west of Lake Winnipeg, and a fair case is made of an adventurer named Kelsey in having done so, but no one whose journey is recorded had yet gone from Lake Superior to Hudson's Bay. The first to go was a French Canadian half-breed named Joseph La France, in 1740. The success of Verandrye had stimulated this adventurer, who belonged to the neighborhood of Sault Ste. Marie, to undertake the journey. In a very rare book on \"The Countries Adjoining Hudson's Bay,\" published by Hon. Arthur Dobbs in 1744, we have a most interesting account of the journey of La France. The voyager was at the time spoken of 36 years of age. He was born at Michilimackinac, and when five years of age had been taken to Quebec to return next year to the West. At the age of 16 he had visited Montreal again, to sell the furs and peltries of his father who had lately died. After this early journey he had returned to Michilimackinac and engaged in trading from post to post till his 27th year. When 28 years of age he had gone to the Straits of Erie (Detroit), passed through Lake Erie, carried his cargo of furs around Niagara Falls, and gone to Oswego on Lake Ontario (or Frontenac, as it was then called). He was what was known as a free trader. The French authorities looked upon him as a smuggler. In 1738 he had been seized by the Governor and a party of soldiers, whom he happened to meet on one of his expeditions in the Nipissing River, but from whom he escaped, making his way with his gun and only five charges of powder and ball to Sault Ste. Marie.\n\nThis was the man, and the training which fitted him for making the long and memorable journey to Hudson's Bay from the shores of the Great Lake.\n\nHe had lost everything on his seizure by the Governor, and so, says the narrator, \"he determined to go to the English in Hudson's Bay by passing through the Indian nations west of the Upper Lakes, until he should arrive by those lakes and rivers which run northward, at York Fort on Nelson River.\"\n\nAfter journeying along the north shore of Lake Superior, he found La France at Lake Du Pluis (Rainy Lake), and from this time we give the interesting narrative of our author, making such remarks or explanations or selections as may be needed for clearness or brevity.\n\nDobbs proceeds: \"The Lake Du Pluis is so called from a perpendicular waterfall, by which the water falls into a river southwest of it, which raises a mist like rain. The river Du Pluis (Rainy River), which falls from the lake, is a fine, large river, which runs eastward, and is about three furlongs in width; its course is about 60 leagues before it falls into the Lac du Bois, or Des Iles, (Lake of the Woods) and is free from cataracts, having only two sharp streams. He was ten days in going down it in his canoe; the whole country along its banks is full of pine woods, in which are a great variety of wild fowl and beasts, as wild beaver, stags, elk, deer, etc., and the river and adjoining lakes full of excellent fish. This river falls into the Lac du Bois, where he arrived about the end of May. This lake is very large and filled with fine islands. He was 30 days in passing its fishing and hunting as he went among the natives. On the southwest of this lake is the nation of the Sioux Indians.\n\nTHE RIVER OUINIPIQUE (WINNIPEG) which passes out of this lake, is as large as the river Du Pluis, but is much more rapid, having about 30 falls or sharps upon it, where they must carry their canoes. Two or three of them are carriages of a league or two, the others are very short. Upon that account he was 15 days going down the river, which runs northwest about 100 leagues. It also runs through a fine woody country, having many sorts of timber trees of great bulk. On the southwest side, at some distance, is a flat country full of meadows. (Note: The Red River country.) He arrived at the great Ouinipique (Winnipeg) Lake in September. After going half-way through it, he joined the Crees or Christinaux (Cree) Indians, who live on the northeast side, and went on shore and hunted beavers all the Autumn. On the west (south) side of the lake the Indians told him a river entered it, which was navigable with canoes. It descended from Lac Rouge the Red Lake, called so from the color of the sand. (Note: This is one derivation of the name Red River; another attributes it to the Red Fort of Verandrye; while others say it is from the red willows upon\nThe country west of the Ounipique Lake has dry islands or hills with marshy bottoms, full of wood and meadows. Upon the west side of Lake Ounipique are the nation of the Assiniboines (Assiniboines) of the Meadows, and further north is that which is the Assiniboines of the Woods. The Indians on the east side are Chetistinaux. All these nations go naked in summer, and paint or stain their bodies with different figures, anointing themselves with grease of deer, beavers, bears, etc., which prevents the muskitoes (sic), serpents or other vermin from biting them, they having an antipathy to oils. The great Ounipique Lake was frozen over in winter. He made his canoe in the Spring, at the north end of this lake, and went down to the little Ounipique (Winnipegoais) in the beginning of Summer. The course of this lake is from south to north through a woody, low country. In all these countries are many kinds of wild fruits as cherries, plums, strawberries, nuts, walnuts, etc. The Winters here are from three to four months, according as they happen to be more or less severe. By lake and river now he turns towards Hudson's Bay, through Lakes Du Siens and Carlboux, until he reaches Pachegola. Pachegola is the lake where\n\nALL THE INDIANS ASSEMBLE\n\nIn the latter end of March every year to cut the birch trees and make their canoes of the bark, which then begins to run, in order to pass down the river to York Fort, on Nelson River, with their furs. He, in company with the Indians at Lake Pachegola, cut the bark for their canoes, and then hunted for some time for provision. They began to make their canoes the 1st of April (new style), which they finished in three days. On the 4th he, being appointed one of their leaders by the Indians, set out with 100 canoes in company for the factory at York Fort, and after the usual incidents of travel La France reached York Factory on the 20th of June, 1742.\n\nSo much for the great first voyage from Lake Superior to Hudson's Bay.\n\nBut not only among the natives and the half-breed voyagers has Verandrye's discovery stimulated interest, what might almost be called an excitement was created in England about the country lying west of Hudson's Bay. What we may call a\n\nHUDSON'S BAY FEVER\n\nfilled the minds of the English merchants, and especially those of London. This excitement took, as was inevitable, the shape of opposition to the Hudson's Bay Company, which for seventy years had been pursuing a prosperous trade on Hudson's Bay, except when interrupted by raids of French vessels during the last decade of the seventeenth century.\n\nARTHUR DOBBS, 1743,\n\nto whom we have already referred, made every effort to show a spirit of energy on the part of the company in conducting trade on the shores of Hudson's Bay, and also that the Company had not penetrated the country as it was bound to do. This supineness was regarded as all the more remarkable that Verandrye and his Frenchmen were making such headway in the far West.\n\nDobbs says, 1743: \"I enclosed a letter to a friend in London to be delivered to a nobleman of the first distinction to acquaint him of my intention of proposing to have settlements upon Hudson's Bay, and to lay open the trade, and by that means we should recover that part of our fur trade which the company had lost to the French, and in time secure the whole, and break off the communication between Canada and the Mississippi through the lakes.\" It was not to be supposed that the Hudson's Bay Company would give any great countenance to an expedition fitted out avowedly to make their territory more known as a desirable hunting ground, and possibly to end in their being dispossessed of their special privileges. Dobbs had succeeded in having an expedition sent out to Hudson's Bay, under the favoring care of the Government, and with a Capt. Middleton in charge. He found that the company, in 1741, issued instructions that this expedition should be treated with nothing more than courtesy, and to make matters worse for him, that Middleton had proved a traitor to his trust. The expedition returned, but nothing had been gained, Middleton having worked in the interests of the great company. The enterprising promoters were not satisfied to give the matter up, though thus thwarted, and so fitted out another expedition under\n\nHENRY ELIOT, 1746.\n\nThis expedition was undertaken by a company, which received £280,000 from the Admiralty, and raised £10,000 in shares. Its object was to explore Hudson's Bay, and if possible find a northwest passage. The moving spirit of this combination, as of the previous enterprise, was Arthur Dobbs, who was not to be diverted from his purpose, and who was one of the executive committee of the new company. The expedition sailed in the two vessels, the \"Dobbs Galley\" and \"California.\" With the particulars of the voyage we are but little concerned at present. The strong persuasion of Dobbs after visiting the coasts of Hudson's Bay, was that the company was losing ground by not penetrating into the interior, and the accounts of the westward progress of the French were well known to him. He says: \"The company discourage their factories from extending the trade, and give themselves no sort of trouble to prevent the French, who are making daily encroachments upon them, from settling on their rivers, and intercepting the choicest kinds of furs, such as otters, martens, or sables, which they purchase because they are lightest, and consequently fittest for carriage, as the places where they buy are at a great distance from the French settlements, so that heavy and coarse goods would scarcely turn to any account and they have the fullest opportunity that can be of doing this, because the natives are always inclined to deal with them preferable to the English.\" The same animus is here seen against the Hudson's Bay Company, but it is plain that the explorations of Verandrye and the French fur traders were urging to in-\nincreased activity. To such an extent did the interest in England rise in the regions of the far West, that a parliamentary enquiry as to the trade on Hudson's Bay was obtained, resulting in a mass of evidence found in the Bluebook or 1740.\n\nWe need not enter at length into the evidence of this Bluebook. The enquiry was granted by Parliament, in response to the petition of \"the merchants of Great Britain.\" One of the points on which the company was required to give answers was: \"What encouragement they had given for the making discoveries of the country up the rivers about the Bay; and what discoveries had been made?\" While in their replies given, some account of explorations made to the interior seem to have been established, it was plain that no trade inland had been engaged in, and the charge was not disproved \"that the French carried away many of their rich furs from the inland at the heads of their settlements; that by not sending up persons to trade upon the rivers and lakes great numbers of deer and buffalo skins were lost.\" (The mention of buffalo skins shows it to have been probably the Winnipeg country that is here meant, as it is the buffalo producing region nearest to Hudson's Bay.) Were further statements necessary to show the very great anxiety in England as to the loss of the western trade, through the discoveries of Verandrye and his companions, the account might be referred to of the \"Surveyor and Supervisor of the buildings of the Hudson's Bay Company,\" who had lived six years on the shores of Hudson's Bay:\n\nJOSEPH ROBSON, 1782,\nwho says:—\"The French, who are grasping at universal dominion, watch every opportunity for extending their trade, and secure all those countries which we abandon. But tamely to suffer them to dispossess us of this important source of wealth and power is, besides the loss, a disgrace not to be borne by Britain.\" It is abundantly evident from these statements, which are taken from the original works printed at the dates named, that Verandrye's discoveries were not stirring the minds of the colonists of New France alone, or of the Ministry in Paris, but were creating so great an interest in Hudson's Bay, that a public sentiment was created in England, which compelled the Hudson's Bay Company, as we shall see a little later, to penetrate the interior.\n\nBefore entering upon this inland search of the Hudson's Bay Company, it may be well to follow shortly the MONTREAL MERCHANTS, as they penetrate the country in the wake of Verandrye. The ambition and the avarice of the rulers of New France were stimulated by the great discoveries from 1731-49. The Government of New France was utterly selfish and venal. The one idea of monopoly dominated in every enterprise. The men in office were greedy Cormorants. That embalmment of cupidity—the Intendant Bigot—was keen upon the scent of the struggling trappers and traders as they urged their way further and further into the country north and west of Lake Superior.\" After all their toil and trouble, the Verandryes were replaced, at the command of the intendant, by Messrs. Marin and St. Pierre. Speaking of the wretched condition in which they were left by an ungrateful Government, one of the Verandryes says: \"My brother who was assassinated some years ago by the Sioux is not the most unfortunate of us.\" The successors, named to the Verandryes, established in 1752, Fort La Jonquiere at the Rocky Mountains, and at the time of the conquest not ten years after, the French are said to have had two settlements on the Saskatchewan, Pasqua, near Carrot River, at present a favorite place of settlement, and Nepowee. It was a righteous retribution, which in 1759, by the brilliant victory of Wolfe, overtook the rulers of New France for all their misrule and tyranny. The nest of devourers was swept out of existence, and trade given that freedom, which England has usually given it.\n\nIt was inevitable that the removal of the French fur-traders' monopoly and the change of Government should result in a prostration of some years of the fur trade. But this could not last long. The taste for North-Western adventure was among the people, and in memory of Verandrye's discoveries was kept alive in the minds of the French-Canadian voyageurs. About this time there found their way to Canada a number of the daring Highlanders, whose Jacobitism, after 1745, and \"gory Culloden\" made Scotland an uncongenial home. These men became the leaders of the hardy voyageurs in opening up a vast trade from Montreal to the North-West. The first merchant whose name is mentioned as taking up the trail, left unused for so many years, was Thomas Currie, who, in 1760, with four canoes, penetrated to Fort Bourbon on the Saskatchewan. Sir Alexander Mackenzie remarks: \"From this period people began to spread over every part of the country, particularly where the French had established settlements.\" A trader named Finlay, in 1767 reached Nepowee, on the Saskatchewan, still farther West. Another of the Montreal merchants, who became a leading part in this revived fur trade, was Frobius. In 1775, having pursued his journey far North of Lake Winnipeg, he intercepted the Indians on their way down to Hudson's Bay. It will be remembered that Washington Irving makes mention of Frobius in his account of the fur trade given in \"Astoria.\" Among the best known of these Montreal merchants was a violent but enterprising trader—Peter Pond—who, in 1778, reached Athabasca. While a shrewd trader, Pond seems to have approached nearer the ideal of a \"border ruffian\" than that of the merely adventurous trader. Even murder was among the crimes attributed to him in the pursuit of the fur trade. After a terrible destruction of the natives of the country by small-pox between 1780 and 1783, the several Montreal merchants trading in the interior in the end of 1783 formed \"The North-West Fur Company,\" familiarly known as the\n\nTHE NORTHWEST COMPANY.\n\nA union of the majority of the Montreal fur traders had resulted in this company,\nand the two brothers, Benjamin and Joseph Froboisher, and Mr. Sin. n Mo- \ntavish were entrusted with the manage- \nment of the new company. A number of \nindependent traders still held aloof, \namong whom was the celebrated man \nafterwards knighted as Sir Alexander \nMackenzie. In 1787, however, all entered \nthe Norwest Company, and for a short \ntime a \"happy family\" prevailed. This \ncontinued till 1798, when the company be- \ncame divided into two rival camps, while \nin 1803 another offshoot of the Norwesters \nbecame the X Y Company. With the \nfurther expansion of the Norwest Company \nwe have nothing more to do at present. \nWith the closing years of the last century \nwe find them a wonderfully vigorous and \nenterprising company. Their traders \nthreaded all the \"watery ways\" of the \ninterior; their posts reached the Rocky \nMountains and Mackenzie River country, \nand they laid claim to having no less than \n5,000 employees. They were the followers \nin a direct line of the French traders, who \nhad followed in the course of Verendrye in \nhis discovery of the great North-West.\n\nWe have already referred to the fact, \nthat while this remarkable movement was \ngoing on from Montreal there was a paral- \nlel stream of interest running to the \nsame country by way of Hudson's Bay. \nWe have seen that much interest attached \nin England to the trade to Hudson's Bay \nbetween 1740-1760, largely stimulated by \nthe reported French explorations. The \nHudson's Bay Company, smarting under \nthe attacks of Dobbs, Ellis, Robson and \nothers, and likewise beginning to feel more \ncertainly the interference with their trade \nby the diversion of much of it to Montreal, \nsucceeded in overcoming to some extent \nthe unwillingness of their employes to \nleave the shores of the Bay and venture \ninland. Accordingly they dispatched to \nthe interior.\n\nSAMUEL HEARNE, 1771.\n\nHearne has been called the North Ameri- \ncan Park. The accounts of his north- \nwestward journeys are among the most \ninteresting in our possession. One can \nhardly imagine the ideas or feelings of \nmen living on the coast of a country—in \nstrongly fortified posts—only acquainted \nwith the interior from the stories of the \nnatives, which are given notably to mis- \nrepresent and exaggerate, when unwill- \ningly these men are called on to leave the \nbase of supplies, and throw themselves \nupon the chances of a barren country, with \nuncertainty as to food, and the possibility \nof meeting bands of hostile, or what is \nworse, of treacherous savages. Further, \nthe little knowledge supposed to be pos- \nsessed of the interior, is usually unreliable. \nFor example Dobbs states in his work, to \nwhich we have referred, that the Western \nOcean lay about 25° of longitude to \nthe west of Hudson's Bay, while really \nthe Pacific is some 45°. While, moreover, \nBritish travelers have been proverbially daring and suc- \ncessful in all parts of the world, even in \npenetrating the most dangerous and dis- \nmal scenes, yet it is probably no self-lauda- \ntion for us, as Canadians, to say that \nthe native of the new world is better \nsuited for the rough, uncertain life of the \ninterior than the fresh-caught English- \nman. Gen. Wolseley, at any rate, is re- \nported to have said that he longed for \nthe assistance of two or three regiments of \nthe Canadian Volunteers of the Red \nRiver Expedition, while he was struggling \nwith the difficulties of the route in the \nAshantee War. Hearne was a novice at \nthe sort of travel he was engaged in, and \naccordingly he was compelled to make a \nthird voyage, where, had he known how \nto travel, perhaps one would have sufficed.\n\nHearne, before starting on his journey \nin 1770, received full instructions from \nMontreal, Prince of Wales Fort, on Churchill River. Talking \nwith him the escort provided, he was to \ncultivate friendly relations with the In- \ndians. His instructions say, \"to smoke \nyour callumut of peace with their leaders \nin order to establish a friendship with \nthem.\" He was provided with instru- \nments and was required to take account \nof latitude and longitude of the chief \npoints visited; he was to seek for a pas- \nsage (the North-West) through the conti- \nnent, while the following extract from \nhis instructions shows the real import of \nthe expedition: \"Be careful to observe \nwhat mines are near the river, etc., the \ncopper mines, what water there is at the \nriver's mouth, how far the woods are \nfrom the seashore, the course of the river, \nthe nature of the soil, and the produc- \ntions of it; and make any other remarks \nthat you may think will be either neces- \nsary or satisfactory. And if the said \nriver be likely to be of any utility, take \npossession of it on behalf of the Hudson's \nBay Company, by cutting your name \non some of the rocks, and also the date \nof the year, month, etc.\"\n\nOn November 6th, 1770, the explorer set \nout with his party, and this, which in its \nconsequences was a really great event, \nwas celebrated with a salute of seven \ncannon from the Fort. He had not pro- \nceeded far upon his journey, however, \nwhen his companions became dissatisfied. \nHe was deserted by one Indian guide and \nthen by another, and at last the bulk of \nhis party left him, stealing at the same \ntime several bags of ammunition, his \nhatchets, chisels, files, etc., His leading Indian companion \nrejoicing in the euphonious name of \nChawchinahaw, having advised him to \nreturn to the Fort, also left him in order to \nproceed southwestwardly, and, as Hearne \nsays, \"Set out making the woods ring \nwith their laughter, and let us to wander, \nour unhappy situation nearly two hundred \nmiles from Prince of Wales Fort, all \nheavily laden, and in strength and spirits \ngreatly reduced by hunger and fatigue.\"\n\nJourneying weariedly back, he says: \"We \narrived safe at Prince of Wales' Fort on \nthe 11th December, to my own great mor- \nification, and to the no small surprise of \nthe Governor.\n\nSECOND JOURNEY.\n\nOn the 23rd of February, 1770, Hearne set \nout with five Indians as his party. His \njourney was a succession of short stages, \nwith a day's rest between—how to kill \ndeer, again to seek for fish under the ice \nwith nets; on one occasion to build a perma- \nnent tent and wait \"till the geese\nbegan to fly.\" About the 10th of June the party abandoned the rivers and lakes, their course having been in a general northwestward direction from Churchill; and now they were to pursue a land journey over a barren country. The following is his description of the first meeting with the musk ox, that now rare denizen of the northern latitudes:\n\n**THE MUSK OX.**\n\n\"We had not walked above seven or eight miles before we saw three musk oxen grazing by the side of a small lake. The Indians immediately went in pursuit of them, and, as some of them were expert hunters, they soon killed the whole of them. This was, no doubt, very fortunate; but, to our great mortification, before we could get one of them skinned, such a fall of rain came on as to put it out of our power to make a fire, which, even in the finest weather, could only be made of moss, as we were near a hundred miles from any woods. This was most comfortless for people who had to break their fast for four or five days. Necessity, however, has no law; and having been before initiated into the method of eating raw meat, we were the better prepared for this repast; but this was by no means so well relished, either by me or the Southern Indians, as either raw venison or raw fish had been; for the flesh of the musk-ox is not only coarse and tough, but smells and tastes so strong of musk as to make it very disagreeable when raw, though it is tolerable eating when properly cooked. The weather continued so remarkably bad, accompanied with constant, heavy rain, snow and sleet, and our necessities were so great by this time the weather permitted us to make a fire that we had scarcely eaten to the amount of one buffalo quite raw.\"\n\nThe hardships endured by the traveler were of the most severe description. He says: \"It will be only necessary to say that we have fasted many times two whole days and nights; twice upwards of three days, and once while at Shethaunee, near seven days, during which we tasted not a mouthful of anything except a few cranberries, water, scraps of old leather, and burnt bones. On those pressing occasions I have frequently seen the Indians examine their wardrobe, which consisted chiefly of skin clothing, and consider what part could best be spared; sometimes a piece of an old half-rotten deerskin, and others a pair of old shoes, were sacrificed to alleviate extreme hunger.\"\n\n**QUADRANT BROKEN.**\n\nIn the midst of his great sufferings and difficulties, when the traveler had reached a point some 500 miles north-west of Churchill, a disaster of a serious kind occurred on the 11th of August. He says: \"It proving rather windy about noon, though exceedingly fine weather, I let the quadrant stand, in order to obtain the latitude more exactly by two altitudes; but to my great mortification, while I was eating my dinner, a sudden gust of wind blew it down; and as the ground where it stood was very stony, the bubble, the sight-vane, and vernier, were entirely broken to pieces, which rendered the instrument useless. In consequence of this misfortune, I resolved to return again to the Fort.\" After a wearisome journey he reached Churchill again. Here he met the friendly Chief Matonabee, who attributed his misfortunes to his not having taken any women with him in his journey. The views of this child of nature, while he perhaps commending themselves to us all, are charming in their directness and simplicity.\n\n**THE GENTLER SEX!**\n\nSaid Matonabee: \"When all the men are heavy laden, they can neither hunt nor travel to any considerable distance; and in case they meet with success in hunting, who is to carry the produce of their labor? Women, added he, were made for labor; one of them can carry, or haul, as much as two men can do. They also pitch our tents, make and mend our clothing, keep up the fires at night, and, in fact, there is no such thing as traveling any considerable distance or for any length of time, in this country, without them. Women said he, again, though they do everything, are maintained at a trifling expense, for as they always stand cook the very licking of their fingers in scarce times is sufficient for their subsistence.\"\n\n**DOG FROZEN.**\n\nIt was near the end of November before Hearne arrived at the Fort. On the 21st he thus describes the weather: \"That night we lay on the south side of Egg River, but long before daybreak the next morning, the weather being so bad, with a violent gale of wind from the north-west, and such a drift of snow that we could not have a bit of fire; and as no good woods were near to afford us shelter, we again proceeded on our way, especially as the wind was on our backs; and though the weather was bad near the surface, we could frequently see the moon and sometimes the stars, to direct us in our course. In this situation we continued walking the whole day, and it was not until after ten at night that we could find the smallest tuft of wood to put up in; for though we well knew we must have passed by several hummocks of shrubby wood that might have afforded us some shelter, yet the wind blew so hard, and the snow drifted so excessively thick, that we could not see ten yards before us the whole day. Between seven and eight in the evening my dog, a valuable brute, was frozen to death; so that his sleigh, which was a very heavy one, I was obliged to haul. On this second journey the explorer had broken his quadrant and had accomplished nothing.\"\n\n**THIRD JOURNEY.**\n\nThough twice baffled, Hearne was still determined to proceed on his inland quest. The Governor, Norton, had now no confidence in the explorer, but the brave man was not dismayed. His plan for the third journey was to obtain the assistance of the Indian Chief, Matonabee and a few of his best men. On the 7th of December, 1770, the start was made, but on this occasion with no firing of cannon from the fort. With many adventures, cultivating the friendship of Indians...\nwhom they met, and taking part in one great hunting place in \"smiling deer in a pound,\" or great stockade, they spent the Winter, constantly making a slight advance. In April, 1771, supplies of birch wood staves for canoe poles, and birch bark and timbers for building canoes, were obtained, journeying more rapidly now, a rendezvous at a place called Clowey was reached, and from this point the final push for the Coppermine River, the object of search, must be made. At Clowey some hundreds of Indians joined the party to proceed to the Coppermine, and thus changed the exploring party into a military expedition, bent on attacking the Equinox, should they be found.\n\nARCTIC SEA REACHED.\n\nAt last, on the 14th of July, the long desired spot was reached, and descending the river on the 18th of the month, the mouth was reached, and the persevering traveler looked out upon the Arctic Ocean. Hearne says:\n\n\"In these high latitudes, and at this season of the year, the sun is always at a good height above the horizon, so that we not only had daylight, but sunshine the whole night; a thick fog and drizzling rain then came on, and finding that neither the river nor sea were likely to be of any use, I did not think it worth while to wait for fair weather to determine the latitude exactly by an observation. For the sake of form, however, after having had some consultation with the Indians, I erected a mark and took possession of the coast on behalf of the Hudson's Bay Company.\" A return home completes the three journeys of the explorer, which are told in a most interesting manner by himself. Hearne's scientific attainment was not, however, equal to his powers of narration. It has been ever a reproach to him that he placed the latitude of the mouth of the Coppermine, instead of at about 67° degrees north, at nearly 71 degrees. His own apology was that after the breaking of his quadrant on the second expedition, the instrument which he used was an old Elton's Quadrant, which had been knocking about the Prince of Wales' Fort for nearly thirty years. I suppose it is impossible to throw the mantle of charity over a scientific mistake so glaring.\n\nHUDSON'S BAY COMPANY ENTERPRISE.\n\nThe first step, having thus been taken, the company, with much energy, proceeded the building of posts and extension of its trade. Hearne was again sent West, and we are told by the traveler Henry that Cumberland House, on the Saskatchewan, had been built in the year 1774 by our explorer, and that the Fort was garrisoned by men from the Orkney Islands. The design in building this house was to prevent the Indians from dealing with the Canadian merchants and to induce them to go to Hudson's Bay. By the end of the century Hudson's Bay Company posts had been planted side with North-Western forts at the chief trading places. It may be of interest to state that a Hudson's Bay Company post called Brandon was built not far from the mouth of the Souris, along side a North-Western fort, in the year 1791. I am informed the spot is still marked by debris. In 1790 a post was placed by the H. B. Company on the Assiniboine and another on the Red River in 1790. Thus in twenty-five year, we find the Hudson's Bay Company extending its forts from Hudson's Bay to the Red River, and likewise North-Westward as far as Edmonton, the Saskatchewan, and Lake Athabasca. It remains to speak of one more name—a name second to none in the annals of North-Western discovery:\n\nMR. ALEXANDER MACKENZIE.\n\nHe was successor and the counterpart in many ways of Verandrye. It is usually stated that it was Hearne's interesting work that stimulated Mackenzie to enter upon his career of extended discovery. The account of Mackenzie's explorations is much better known than most of those we have been describing, and we shall but briefly notice them. Engaged enthusiastically in the fur trade, Mackenzie found himself at Fort Chipewyan, on Lake Athabasca, in 1789. Fitting out four canoes, manned by French Canadians as well as by a number of Indians with their wives, he started in June, and by the end of July, after adventures with strange Indians, and pestered by the treachery and unreliability of his own party, reached the Arctic Sea. On his return from the north he determined to journey to London and spend a year in acquiring the necessary knowledge of instruments to enable him to carry out another great enterprise he had in mind. Arrived at Chipewyan again in October, 1792, he started up the Peace River to cross the Rocky Mountains and reach the Pacific. Wintering on the Peace River, trading in furs, he was ready in the early Spring to prosecute his journey up the Peace River. He crossed the Rocky Mountains, thence by Portage he reached a small stream running south-westward, but this he left and crossed by land to the coast. With vermilion and melted grease on the face of a rock on the Pacific coast he inscribed in large letters: \"Alexander Mackenzie, from Canada by land, the twenty-second of July, one thousand seven hundred and ninety-three.\"\n\nSUMMING UP AND CONCLUSIONS.\n\n1. The discovery of the Lake Winnipeg region by Verandrye led to the exploration within ten years of an area half as wide again in extent as had been explored from Quebec westward in the 125 years intervening between Champlain and Verandrye.\n\n(a.) The Winnipeg, Assiniboine, Souris, Upper Missouri and Saskatchewan Rivers were in this period discovered and a number of forts built along them.\n\n(b.) Lakes Winnipeg, of the Woods, Winnipegoosis and Manitoba were explored.\n\n2. One of the first results and within the same period was the opening up of a route from Lake Superior to Hudson's Bay. This was the opening up of a route over which the trade of the vast interior was conducted for upwards of a hundred years.\n\n3. A direct consequence of the vigorous explorations of Verandrye was the extension of the fur trade done from Canada. The French Canadian trade until the\nconquest, and the Scot-French movement from Montreal after Canada became British, gave promise of great vigor in making use of this truly Canadian inland line of great water stretches.\n\n4. The direct result of this trade movement from Montreal, which was within thirty years of Verendrye's time, was to stimulate interest in British goods. Robson, Elliot, and the Parliamentary Inquiry of 1749 leave no room for doubt on this score. As a result of this public interest and also of the effect the French discoveries were having upon their trade at the Bay itself, the Hudson's Bay Company decided to adopt a more expansive policy. Hearne became the pioneer explorer as well as fort builder of the Company. In twenty-five years the Hudson's Bay Company dotted the whole region from Hudson's Bay on the east to the Rocky Mountains on the west, and from the Red River on the southeast to Athabasca on the northwest, with the main posts still retained. Though a hundred years old at the time of this inland movement this great Company of North America showed that it yet retained the energy of youth, since within time another (10) years were to find it still by its means in its decrepitude, but laying its plans for another century of successful trade.\n\n5. The energy displayed by the Hudson's Bay Company throughout the whole Northwest, enabled them to regain a good part of their lost trade, especially along the Northern watercourse from Athabasca to Churchill. The Montreal merchants felt their weakness in having to compete with one another and also with their gigantic antagonist from England. A movement among the Canadian traders we have seen, took place to unite their forces. This resulted in the formation of the \"Northwest Company\" as we have described. With all the traditions of the French explorers as theirs, with the enormous adaptability of Colonists, and with a strong feeling of rivalry to the Hudson's Bay Company, the Canadian Company so extended their operations even with smaller resources than their antagonists, that when the two companies put an end to their serious—even bloody—struggles by a union in 1821 the North-westers had 97 posts to 36 belonging to the Hudson's Bay Company.\n\n6. The basin of Lake Winnipeg was found by the Hudson's Bay Company to have the currents of the fur trade converging in it, and running to the outpost at Fort York, on Hudson's Bay, while the Nor'westers found the same; with their outpost at Fort William, on Lake Superior. Lake Winnipeg receives the three great rivers from east, south, and west that drain the vast area of North-West—the Winnipeg, the Red, and the Saskatchewan. Trade has always followed these great arteries, with this alternative, that from the west the Assiniboine has outlined a land trail over the prairies, which has proved a rival to the Saskatchewan.\n\n7. The basin of Lake Winnipeg has still the position as regards general trade and the development of a new country that it occupied under the fur trading days. With an increase of people, it is true, new wants have arisen, and a diversion of trade into new channels might reasonably have been expected. It is surprising to find how nearly on the old lines the currents of trade seem shaping themselves. From the East we look for timber and minerals; from the West, by way of the Saskatchewan, the furs still find their outlet, while the replacing of the Assiniboine trail by the iron way, and its divergence to the south has made the Saskatchewan still more than it has been in later years, the highway of commerce. From the West we must have coal, and perhaps iron. In the Lake Winnipeg basin, at the junction of the prairie and the wood country, we have the converging point of these several forces. If these estimates be true, then the great city of the region north and west of Lake Superior will be in the basin of Lake Winnipeg.\n\n8. Where is this great city to be situated? Had the Hudson's Bay route been the only means of reaching the North-West, as it was for the Hudson's Bay Company for a long period of its existence, as it was at the time of the immigration of the Selkirk colonists, then a point on Lake Winnipeg, probably at the mouth of the Saskatchewan, would have been the meeting place of commerce. But the Hudson's Bay route is still only a problem. The currents of trade are South to the United States, and East through our own territory to Lake Superior. Had the matter to be settled by theory rather than by actualities, the point where a straight line crosses Red River, drawn from Rat Portage to Portage la Prairie, might have been selected, although the entrance of the Assiniboine into the Red River would always have left it doubtful whether a point chosen on such an arbitrary assumption that trade follows a straight line would gain the ascendancy. But when the fact that the railway system of a country—especially a prairie country—chooses a centre from which to radiate seven separate lines, is added as a factor to the traditions of the trade of three quarters of a century, and the fact that there is a settled country to the South with vast solitudes to the north of Lake Winnipeg, it is plain that the mouth of the Saskatchewan has little ground, nor can other places on the Red River claim any indulgence in maintaining that the great city of the North-West is to be any other than the City of Winnipeg.\n\nThe reading of the paper having been concluded, the Lecturer resumed his seat amid applause, and a discussion of matters connected with the subject of the paper followed.\n\nRev. Prof. Hart moved a vote of thanks to the Lecturer. In expressing the pleasure which the reading of the paper had afforded him, mentioned the fact that he had himself gone over a portion of the country referred to, namely, that lying to the east of the Lake of the Woods and up Rainy River. He thought the country owed a debt of gratitude for the courage and perseverance manifested by those early explorers.\n\nMr. J. Hoyes Panton seconded the\nmotion. In doing so he observed that it seemed strange that while so many distinguished pioneers had known so much of the country, it had since remained to so great a degree unheard of until quite recently. He proceeded to speak of the coal fields and mineral deposits as having been apparently kept back from the knowledge of men by a wise Providence until a certain time should be reached in the development of the world. He referred to the circumstances which were operating to lead men to emigrate from the old countries and from Ontario; to the great migration to this country last year, and the still larger which might be expected this year, and dwelt upon the prospects held out to those who might come by the richness of the Red River Valley, the vastness of the coal fields and the extent of the mineral wealth, in the development of which the men of Winnipeg had such unbounded faith that they had already expended nearly a hundred thousand dollars toward its development.\n\nThe resolution of thanks was then unanimously carried.\n\nMr. Allan Macdougall, C.E., commented on the indomitable perseverance of the early explorers referred to in the lecture, and compared with their experience that of Livingstone and others in Africa. He did not think that Hearne should be too harshly criticised for his inaccuracy respecting the latitude of the mouth of the Coppermine River, as with inferior instruments and poor opportunities for observing an erroneous calculation was not not a very surprising thing.\n\nMr. R. A. Wilson was highly pleased with the paper. He had traveled over the country between here and the Rocky Mountains, and as far north as the Peace River. He was interested in a railway, a charter for which had been obtained from the Dominion Government, to extend from Lake Athabasca to Churchill, a distance of 250 or 300 miles.\n\nSeveral questions were asked by gentlemen present and answered by the lecturer, after which the meeting adjourned.\n\nAt the next meeting a paper is promised by Mr. Allan Macdougall, C. E., on \"Roadways and Carriageways.\"\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30234.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 26836, "total-output-tokens": 12206, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1050, 3], [1050, 2222, 4], [2222, 2528, 5], [2528, 2528, 6], [2528, 7455, 7], [7455, 13477, 8], [13477, 19432, 9], [19432, 25468, 10], [25468, 31698, 11], [31698, 37626, 12], [37626, 43570, 13], [43570, 49569, 14], [49569, 51637, 15], [51637, 51637, 16]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, true]}}]