[{"id": "c6f1527732868b9694c84c066425fdb8d1525045", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X ✓ 26X 30X 12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nYoung Men's Reform Club.\n\nBANQUET\n\nIN HONOUR OF\n\nHon. E. BLAKE, M.P.\n\nAT THE\n\nWINDSOR HOTEL,\n\nMONTREAL.\n\nTUESDAY, 29th MARCH, 1881.\nTHE BLAKE BANQUET.\n\nWINDSOR HOTEL, 29th MARCH, 1881.\n\nEnthusiastic Reception of the Liberal Leader.\n\nGRAND LIBERAL REUNION\n\nCommittees.\n\nReception Committee.—Young Men's Reform Club: John J. MacLaren, Q.C., President; Prof. J. Clarke Murray, LL.D., Robert Mackay, 1st V.P.; Edward Holton, M.P.; Denis Barry, 2nd V.P.; Alex. Moffatt, 3rd V.P.\n\nClub Nationale: A. E. Poirier, President; Edmond Lareau, Philippe H. Roy, F.G. Bouthillier, M.P.P.; Wm. Scallon, Achille Dorion, N. Dandurand.\n\nClub Letellier: Antoine Favreau, President; Jos. N. Bienvenu, Ernest Tremblay, Alfred Roy, fils, L. Mederic Houde.\n\nAnd the following gentlemen: Thomas Cramp, Hon. J. R. Thibaudreau, Hugh Mackay, Joseph Duhamel, James Stewart, James McShane, M.P.P.; Hon. H. Mercier, M.P.P.; Alfred Perry.\n\nAdvisory Committee.—Hon. Edwd. Goff Penny, Hon. R. Laflamme, Q.C., Hon. L.S. Huntington, M.P.; Hon. H. Mercier, M.P.P.; James McShane, M.P.P.\n\nToast Committee.—John J. MacLaren, Q.C., Hon. J. R. Thibaudreau, Edward Holton, M.P.; Ewan McLennan, Wm. Scallon, Denis Barry, Selkirk Cross.\n\nFinance Committee.—David Seath, Treasurer; Robert Mackay, Alex. Moffatt, Selkirk Cross, Chas. Parmelee.\n\nPrinting Committee.—M. Hutchinson, James G. T. Cleghorn, J. G. B. Dillon, Alex. Munro, M.D., Arch. McGoun, Jr.\n\nMusic Committee.—Alex. Moffatt, David Seath, John H. Rogers, Fred. Massay, R. Dandurand.\n\nSeating Committee.—James N. Greenshields, W. Fred. Ritchie, Mederic Houde, W. Scallon, C. E. A. Patterson, Alfred Perry, N. Dandurand.\n\nDecoration Committee.—Robert Mackay, Alex. Moffatt, Robert Reid, James Morgan, Jr., C. E. A. Patterson.\n\nTHE BANQUET.\n\nOn Tuesday evening, 29th of March, the dinner given to the Honourable Edward Blake, under the auspices of the Young Men's Reform Club, came off at the Windsor Hotel, and was, as prognosticated, a great and brilliant success. The desire of the members of the Liberal party, to do honour to the talented and able Chief of the party, taxed not only the seating, but the standing-room capacity of the Windsor's large dining-room. In fact, notwithstanding the skill displayed by the Committee of Arrangements to find place for all those attending the banquet, so that they might be in a position to hear the eloquent addresses which were made by the leaders of the party, they were forced to send many of their friends into the gallery with the band, while hundreds more, mounted on chairs, were in the corridors, listening to the speeches as best they could. Seldom has there been seen such a rallying together of Liberals as last night. The meeting held at the Queen's Hall a few months ago, when the same great statesman addressed his countrymen on the Pacific contract, surpassed the meeting of last night in numbers, but not in enthusiasm, for the Liberal cause and its patriotic principals. That meeting was a manifestation of the con-\nfidence and respect which the people had in the course pursued by the Liberal leader and his supporters in protecting the patrimony of the people. Last night that confidence and respect was made the firmer, and will assuredly give the Chief of the party more strength and encouragement to stand fast and fight out to the end the battle of the people's rights. On all sides could be seen young and old standing shoulder to shoulder and weighing well the words of wise counsel and advice which fell from the lips of the speakers. To many youngsters, indeed, it was of much advantage to hear, from such masters of the politics of the country, the true history of the Reform party; its battles in the past and its triumphs; of the men at the party helm in the past, and how they achieved, in the face of many obstacles, Constitutional Government for the people. The difficulties in those days were greater than now; yet the party, guided by such noble-minded men as Mackenzie, Baldwin, Lafontaine and others, advocating the rights of the people, came through the ordeal with honour and credit, and gained for us the liberties which we now enjoy, and which every true Liberal and lover of his country is bound to see maintained. The clouds round Liberal heads then were dark and lowering, as they have been over us for the past few years, but as there is a silver lining to every cloud, so brightness and light is once more beginning to break over the fortunes of the Liberal party. As the leaders of the party in the past were guided by high and noble motives for the country's good, and eventually were victorious, so those of to-day follow in their footsteps, and look to the young men of the Liberal party to sustain them in the noble work they are seeking to carry out. The Young Men's Reform Club of this city are desirous of doing their duty, and in this they are encouraged by those staunch men of Liberal principles whose hair has become grey in the service of the party, and who are glad to see the young generation taking hold of the work which for years past they have nobly borne the burden.\n\nThe formation of the Young Men's Reform Club, as soon as it was started, received every assistance and countenance from the fathers of the party in the city. Advice and counsel were ever at hand, and, in a few weeks' time, the members of the young Club sprang, as if by magic, into existence, found themselves in such a strong position as to undertake to invite the honoured leader of the party to a closer acquaintance. The idea was no sooner broached than it was quickly acted upon, and, with the co-operation of their elders, they had, last night, the distinguished honour of having as their guest their leader and Canada's greatest statesman, the Hon. Edward Blake. In doing him honour they honoured themselves, their city and their country. They have also seen the leader to whom their allegiance is due, one whom we feel certain, from the manner in which they received him, they will follow with confidence wherever he may lead, for it will only be the path of honour he will ask them to tread. The demonstration of last night was one the Young Men's Reform Club may think of with pride in after years. The arrangements for the dinner were as complete as could be desired. Considering the immense number which the \"Windsor\" had to cater for, the banquet was in every respect all that the most critical could have anticipated.\n\nThe tables had been arranged in what is called rake fashion, the invited guests' table running the whole length of the large dining-room, and twelve smaller ones running at right angles to it, at which were seated the subscribers. The Chair was taken by Mr. J. J. Maclaren, Q.C., having as Vice-Chairman Messrs. Robt. MacKay, Denis Barry and Alex Moffatt, Vice-Presidents of the Club. Acting as Chairman at the other tables were Messrs. J. G. T. Cleghorn, J. C. McCorkill, S. Cross, Dr. A. Munro, A. Lare, J. N. Greenshields, W. Scallon, P. H. Roy, E. C. Monk, D. R. Ross and J. G. B. Dillon. Seated on the right of the Chairman were the Hon. Edward Blake, the guest of the evening: Hon. R. Lafamme, Mr. Scrivener, M. P., Hon. H. G. Joly, Hon. F. Langellier, Jas. McShane, M. P. P., R. Prefontaine, M. P. P., F. G. Bouthillier, M. P. P. On the left were Hon. W. Laurier, Hon. L. S. Huntington, Hon. R. Thibaudet, Ed. Holton, M. P., Hon. H. Mercier, Hon. F. G. Marchand, H. A. Nelson, M. P. P., R. G. Meikle, M. P. P. Seated on either side of these were Messrs. Porter, Favreau, E. McLennan, Ald. Hagar, J. H. Mooney, Wm. Darling, Prof. Murray, F. X. Archambault, G. A. Geoffrion, W. Prevost, Hugh MacKay, F. MacKenzie, Thor Cramp, J. K. Ward, Ald. Gilman, F. W. Thomas, N. W. Trenholme, Ald. Proctor, Ald. D. Brown, J. Hodgson, H. Lyman, Edward MacKay, James Shearer, Thos. Workman, Jos. Barsalou, R. W. Shepherd, James Stewart, Joel Leduc, J. H. Joseph, Jas. McCready, Louis Tourville, O. O. Perrault, W. W. Robertson, Jas. O'Halloran, Q. C., R. French, D. Morrice, Thos. Leeming, Ald. J. C. Watson, and A. A. Ayer.\nThe following is the list of subscribers to the banquet:\n\nA\nF. X. Archambault, S. J. Andres, L.D.S., Q.C.\nChas. Ault, M.D., A. A. Ayer,\nJ. R. Alexander, M.D. Robert Archer.\nDr. Geo. Armstrong, O. R. Anderson,\nGeo. Alderidge, Wm. Angus.\n\nB\nAld. David Brown, Chas. Byrd,\nF. L. Beique, Q.C.,\nW. F. Badenach,\nJos. Barsalou,\nC. Beaumoleil,\nJ. Stevenson Brown, Honore Beaugrand,\nJ. E. Brais,\nO'Hara Baynes, N.P., F. G. Bouthillier,\nGeorge Baynes, M.D.\nC. R. Black,\nW. M. Blaiklock,\nDenis Barry,\nGeo. Bury,\nR. J. Brown,\nFrank Brennan,\nJ. H. Browning,\nGeo. Bishop,\nJohn Beattie,\nJonathan Brown,\nThomas Bowes,\nJ. M. Bucknall.\n\nT. V. R. Brown.\n\nC\nJohn Crawford,\nThomas Cramp,\nArch. M. Cassile,\nJames Cratherm,\nT. James Claxton,\nT. A. Cratherm,\nC. E. Chandler,\nSelkirk Cross,\nFrank Caverhill,\nThos. Christie, M.D.,\nJ. F. Cotton,\nLachute.\nJ. G. T. Cleghorn,\nGeorge Caverhill,\nC. C. Clapperton,\nS. Carley,\nT. H. Christmas,\nJ. B. Cantin,\nH. M. Childs,\nJ. Cochenthaler,\nDr. C. L. Cotton,\nCowansville,\nP. A. Crosbey,\nJames Crankshaw.\n\nD\nJoseph Doutre, Q.C., M. Davis,\nWilliam Darling,\nG. DeSole,\n\nE\nT. Day,\nWilliam Drysdale,\nJoe. Duhamel, Q.C.,\nAchille Dorion,\nJ. G. B. Dillon,\nAdam Darling,\nJohn Dunlop,\nH. Thoe. Duffy,\nO. J. Devlin,\nJ. M. M. Duff,\nJohn Dillon,\nDavid Drysdale,\nL. G. P. Desroisiere, A. L. Desaulniers,\nM.D.,\n— Duchesneau,\nThos. M. Dougall,\nDr. Duchesneau.\n\nF\nWm. Ewan,\nJames Ewan,\n\nG\nDr. Fisher,\nR. French,\nJohn Fair,\nAntoine Favreau,\nRoswell Fisher,\nJohn Fraser,\nC. A. Geoffrion, Q.C., J. B. Galipeau,\nJ. N. Greenshields,\nRev. T. Gales,\nAld. F. E. Gilman,\nJ. E. Gaboury, N.P.,\nGeo. W. Gardner,\nHon. Felix Geoffrion,\nThos. P. Gorman,\nD. Graham,\n\nH\nHon. L. S. Hunting-Gavin Houston,\nEd. Holton, M.P.,\nW. DeCourcy Har nett,\nJonathan Hodgson,\nEdward Hagar,\nCaptain L. Howard H. A. Hutchins,\nDassel,\nThos. E. Hodgson,\nAld. Chas. Hagar,\nC. D. Hanson,\nJ. C. Holden,\nAntoine Hamilton,\nJas. Hughes,\nJ. C. Holden,\nJames M. Hall,\n\nI\nGeorge Iles,\nJ. H. Isaacson,\nAlfred Isaacson,\nF. C. Ireland.\nJ. H. Joseph, Edgar Judge, Horace Joseph, Henry Jonas,\n\nA. L. Johnson, H. Joseph, E. R. Johnson, W. James Jarvis,\n\nK\n\nFred. W. Kelly, G. R. W. Kittson, W. Fred. Kay, John M. Kirk, A. Kerosch,\n\nL\n\nHon. F. Langelier, W. J. Learmont, Hon. R. Laflamme, H. H. Lyman, Q.C., D. L. Lockerby, Henry Lyman, Wm. Lavers, Jos. B. Learmont, H. Labelle, J. L. Lafentaine, Seth P. Leet, M.P.P., G. C. Lumley, Edm'd Lareau, Q.C., L. A. Lavers, W. D. Lighthall, Lynn T. Leet, W. M. Lemesurier, Daniel Lyons, Leon Larue, M. Longtin, Fred. S. Lyman Thos. Liggett Calixte Lebeuf, Chas. Levine, Joel Leduc, Geo. R. Longeway, — Lanigan, Thos. Leeming, Dr. Lawder, Cowans-H. Lovell, M. P. P. ville. F. X. Lecavallier, Dr. Laberge, M.P.P., J. B. Leslie.\n\nM\n\nHon. F. G. Marchand, R. G. Meikle, M.P.P., M.P.P., Geo. A. Mooney, Prof. J. Clarke Murray, LL.D., James Morgan, Jr., Geo. W. Moss, E. C. Monk, W. G. Martin, Alex. Munro, M.D., Charles Martin, Ald. J. H. Mooney, M. Michaels, Hon. Honore, Mercier, M.P.P., Paul G. Martineau, Charles Martin, L. L. Maillet, R. Miller, Jr., David Morrice, Fred. Massey, W. L. Maltby, W. E. Muir, W. F. Mewhort, L. Munro, T. R. Marshall, P. R. Martineau, Maxwell Murdoch, J. W. Mills, Ralph Merry, F. H. Matheson, Frank Mooney, Richard Mooney, W. Synes Miller.\n\nMc\n\nEdward Mackay, Murdoch McKenzie, H. S. Macdonald, Geo. McBean, Ald. McShane, M.P. H. Mackay, Jr., P., J. A. McKinnon, Eneas McMaster, A. Macarthur, Hugh Mackay, Alex. Mackenzie, J. J. Maclaren, James Maclaren, Ewan McLennan, John Maclean, Wm. McLaren, John McKergow, A. G. McBean, James McCready,\n\nRobert MacKay, James McDougall, John S. McLachlan, Wm. McLachlan, Arch. McGoun, Jr., John Macintosh, Wm. McCallum, C. J. McIntyre, Richard McKeown, B. C. Maclean, John McLean, J. Chas. McCorkill, James McLennen, A. C. McIndoe, John McQueen, G. D. MacKay, R. W. McDougall, John Macnish, John S. McLachlan, R. W. McLachlan, Wm. McLachlan.\n\nN\n\nH. A. Nelson, M.P.P., Fred. E. Nelson, Albert D. Nelson, H. Newman, James Neville, W. H. Nolan.\n\nO\n\nJames O'Halloran, L. S. Odell, Q. C., John Ostell, J. B. Owens.\n\nP\n\nHon. E. G. Penny, Alfred Perry, Ald. C. D. Proctor, J. W. Patterson, C. O Perrault, Frank Pritty, R. Prefontaine, M.P.P., Louis Perrault, A. E. Poitier, Ernest Paquet, Wilfrid Prevost, Chas. H. Parmelee, Robert Pinkerton, H. A. Plamondon, E. Z. Paradis, Q.C., C. E. A. Patterson, E. G. Penny, Jr., Eustache Pare, L. P. Poitras, Jr., Joseph Percival, W. D. Pettigrew, A. J. Post, G. S. Page, George Phillips.\n\nR\n\nHon. D. A. Ross, W. Fred. Ritchie, R. A. Ramsay, Thomas Robin, W. W. Robertson, Jos. Rielle, Robert Reford, John A. Robertson, Robert Reid, H. B. Rainville, Philippe H. Roy, J. Y. Roy, C. J. Root, D. R. Ross, J. H. Rogers, James M. Reid, J. H. Redfern, Cote W. Lord Ross, St. Antoine, James Reid, J. E. Robidoux, Wm. Reid, F. O. Rinfret, Alfred Roy, fils, John Ralston, John Reid, — Roe, A. Racine, — Roy, Arthur Roy, J. C. Robillard.\n\nS\n\nJulius Scriver, M.P., Wm. Smith, Brooks Sanborn, Geo. Sumner, John Stirling, Chas. Sullivan, Ald. G. W. Stephens, Jos. Ste. Marie, A. D. Stevens, M.D., J. Alex. Stevenson, G. Stevens, S. D. Stewart, John G. Savage, Wm. Scallon, J. H. Semple, C. H. St. Louis,\nThe tables were handsomely decorated with choice hot-house plants, and presented a tempting appearance. The viands were all that could be desired by the most exacting epicure, and were amply done justice to. During dinner, the band of the 65th Battalion, which was placed in the gallery at the West-end, played a choice selection of music in excellent style. About eight o'clock the guests filed into the dining-hall and took their seats, some 500 being accommodated. As the honoured leader of the party entered, accompanied by the President of the Club, Hon. Messrs. Huntington and Laurier and the officers of the Club, the whole of the members sprung to their feet and cheered vociferously, while the band played \"Hail to the Chief.\" All being seated, the order to fall to was given, and the following menu was amply discussed:\n\n**MENU**\n\n**SOUP**\n- Mock Turtle\n- Consommé à la Royal\n\n**FISH**\n- Boiled Saguenay Salmon à la Normandie\n- Fillets of Halibut au gratin\n- Pommes à la Parisienne\n\n**BOILED**\n- Leg of Mutton, Caper Sauce\n- Tongue\n- Corned Beef and Savoy Cabbage\n- Chicken, Parsley Sauce\n\n**ENTREES**\n- Filets de Boeuf, pliées aux Champignons\n- Ris de Veau, glace au petits pois\n- Pigeon braisé, au haricots verts\n- Foie de Dinde, saute aux truffes\n- Macaroni au parmesan\n\n**ROAST**\n- Beef with Yorkshire Pudding\n- Turkey, Cranberry Sauce\n- Spring Lamb, Mint Sauce\n- Cincinnati ham, Champagne Sauce\n\n**GAME**\n- Black Duck, with Jelly\n- Quail, Bread Sauce\n\n**COLD DISHES**\n- Roast Mutton, Veal, Ham, Ox Tongue, Corned Beef, Fillets of Beef\n- Boned Turkey with Jelly\n- Game Pie with Jelly\n\n**MAYONNAISE**\n- Salmon\n- Potato\n- Lobster\n- Chicken\n\n**VEGETABLES**\n- New Bermuda Potatoes\n- Potatoes, plain and mashed\n- Asparagus, Stewed Tomatoes, Spinach, Sweet Corn, Mashed Turnip, Onion, Lettuce, Celery, Radishes, Sliced Tomatoes\n\n**PASTRY**\n- Plum Pudding, Brandy Sauce, Rhubarb Pie, Charlotte Russe, Apple Pie, Maraschino Jelly, Raspberry Tartlets, Jelly Puffs, Cocoanut Slices, Fancy Kisses, Fruit Cake, Lady Fingers\n\n**DESSERT**\n- Oranges, Apples, Malaga Grapes, Raisins, Figs, English Walnuts, Almonds, Filberts\n- English Cheese, American Cheese, Gruyere Cheese, Vanilla Ice Cream, Roman Punch\n\n**COFFEE**\n\n**TEA**\n\nAfter due justice had been done to the viands, etc., the Chairman called the meeting to order, and gave the first toast of the evening.\n\n**THE TOASTS**\n\nThe Chairman then proposed the toast of \"The Queen,\" which was received with cheers, the band playing \"God Save the Queen.\"\n\"The Prince and Princess of Wales and the Royal Family,\" brought forth three more rousing cheers, the band playing \"God Bless the Prince of Wales.\"\n\n\"The Governor-General\" received three cheers and a tiger, the band playing \"The Campbells are Coming.\"\n\n\"The Army, Navy, and Volunteers,\" was greeted with three cheers, the band playing \"Rule Britannia.\"\n\nCol. Marchand responded in a happy speech for the honour conferred upon him in being asked to respond to this toast. Although he was now in the position of a retired militiaman, although not now in active service, he still felt, in a political point of view, that he was a private in the great political army of our country.—Canada. (Cheers.) He briefly referred to his military career; in his early military history, he had been called to command one of the most valiant brigades that ever faced the enemy—the Fifth Royals. (Cheers.) He had also under his command the Prince of Wales and the Victorias, young and valiant men, who were in all respects worthy to represent the youth of Canada, and as he had told them, victors in love and victors in war. He concluded by again thanking them. (Applause.)\n\nAt this point the Secretary, Mr. A. McGoun, read the following letters and telegrams from those unable to be present:\n\nThe following letters were read:\n\nTORONTO, March 25, 1881.\n\nDear Sir,—I received yours of 22nd yesterday, inviting my attendance at a dinner to be given to the Hon. Edward Blake on the 29th instant.\n\nI regret that I am compelled to decline the invitation, as I have at present to avoid long and fatiguing journeys; and also public gatherings of any sort, unless circumstances should make it absolutely necessary.\n\nWishing you a prosperous gathering,\n\nI am, yours faithfully,\n\nA. MacKenzie.\n\nARCH. McGOUN, Esq.,\nMontreal.\n\nAfter the reading of this letter the entire audience rose to their feet, and cheered and shouted, waving their hands and glasses, and it was several minutes before the enthusiasm excited by Mr. MacKenzie's name could be controlled.\n\nOTTAWA, March 12, 1881.\n\nDear Sir,—It will afford me much pleasure to accept the invitation of the Young Men's Reform Club of Montreal, to attend a public dinner to be given in honour of Hon. Mr. Blake, should it not be absolutely necessary for me to proceed home directly after the prorogation of Parliament. I have explained to Mr. Holton, M.P., the circumstances, which may render my immediate return home necessary.\n\nI remain, dear sir,\n\nYours truly,\n\nT. W. Anglin\n\nARCH. McGOUN, Jr., Esq.,\nSecretary Y. M. Reform Club, &c., &c.\n\nThe Hon. Mr. Anglin, since writing this letter, has expressed his great regret that urgent family affairs have rendered it absolutely impossible to remain and be present at the dinner.\n\nOTTAWA, March 24, 1881.\n\nDear Mr. Secretary,—I very much regret that pressing professional engagements prevent me from accepting the invitation of the Young Men's Reform Club of Montreal, to be present on the occasion of the dinner in honour of the Hon. Mr. Blake. Hoping that the meeting may be a grand success,\n\nI am,\nYours faithfully,\n\nR. W. Scott.\n\nMONTREAL, March 28.\n\nMy Dear Mr. Secretary:\n\nIt is with a great deal of regret that I feel obliged to absent myself from the interesting meeting of Liberals, which is to take place to-morrow night. Be assured that nothing but physical weakness would prevent me from taking part by my presence on an occasion so full of hope for the future of the party, and what is of more consequence, for the future of the country. The younger men, who are to-day coming to the front are those, on whom reliance must shortly be placed, if our public affairs are to be saved from ruin by the depredations of interested parties. Events warn us that the generation of public men to which I myself belong is rapidly passing away. Our sons must supply its place.\n\nWith the warmest hope that you and your distinguished guest, whom it would be an honour to myself if I were able to honour in the slightest degree, will enjoy a very pleasant evening on Tuesday. Believe me,\n\nYour very obedient servant,\n\n[Signed.] Edw. Govt Penny.\n\nA. McGoun, Esq.\n\nThis letter was also received with the greatest enthusiasm, and cheer after cheer went round the hall.\nThe Hon. Mr. Fraser, who was also invited, has been obliged to decline, his physician having ordered him positively to avoid using his voice in addressing any public meeting.\n\nLetters were also received from Senator Bureau, Hon. D. A. Ross, Quebec; James MacLaren, Buckingham; W. Fred. Kay, Phillipsburg; Thomas Christie, M.D., La-chute.\n\n[TELEGRAM.]\n\nSecretary Blake Dinner:\n\nThe members of the Quebec Reform Club send greetings to the Hon. Edward Blake on the occasion of the banquet tendered him as Chief of the Reform Party. Under his leadership they look with confidence to the future.\n\nF. X. LEMIEUX.\n\nSecretary Blake Dinner,\nWindsor Hotel:\n\nWe unite with you in the warmest expression of good-will to our distinguished Leader, and wish you every success.\n\nCHAR. LANGEUER,\nACHILLE LARUS,\nR. J. BRADLEY,\nJULES TESSIER,\nED. LACROIX,\nF. X. LEMIEUX,\nD. BARRY,\nJos. TREMONT,\nAnd others.\n\nAlso, one from Hon. F. Geoffrion, M.P.\n\nA letter was also received from Mr. Bourassa, M.P., of St. Johns, P.Q., the oldest member of the House of Commons.\n\nThe next toast was the toast of the evening, \"Our Guest.\"\n\nMr. MACLAREN, in proposing this toast, spoke as follows:—Gentlemen: I deem it a high honour that, as President of the Young Men's Reform Club, it is my privilege to preside at so magnificent a demonstration to the distinguished leader of the Liberal Party of the Dominion. (Loud applause.) This is a red-letter day in the history of our Club, in the history of Montreal, and in the history of the Reform Party in the Dominion. During Mr. Blake's visit to Montreal in January last, he gave some words of counsel to the Young Men's Reform Club, on the occasion of the presentation to him of an address. It might be summed up in three words: Organize! Organize! Organize! At that time our Club was in a dormant state, and numbered but about fifty members, and today we can boast of a membership of about 350. In less than three months it has increased sevenfold, and to show that the interest is not waning now, let me tell you that at the last meeting of the Club there were forty-three new applications for membership. When we first invited Mr. Blake to this dinner, there was no regular Reform Association to take the lead in such a matter, but I trust that the one organized this afternoon in the Mechanics' Hall, will hereafter lead in matters affecting the Party generally. I cannot say how gratified I am to see such a numerous attendance here tonight; we first thought of 200, or at most 250 guests, and nobody was more astonished than I was to see the applications come in so rapidly, until, for want of space to accommodate our guests, we have had to deny many applicants. Thanks to the Reform party and the popularity of our great leader, our guests are only limited by the capacity of this room. This hall has witnessed many notable gatherings and receptions; dinners to Lord Dufferin, the Marquis of Lorne, and many noted political and social receptions and festivities, but I am proud to say that we have 120 more guests tonight than were ever gathered at any public dinner previously given in Montreal. This is a great tribute to our leader, and abundantly testifies to the estimation in which he is held by the people of this city and Province. He has accomplished much since his last visit among us. He has set a brilliant example of fearlessly doing his duty under most trying circumstances. The enthusiasm evoked here proves that he has the personal magnetism which is needed to draw men to his standard, and which is so essential to the success of public leaders. With a comparative handful in the House of Commons, he has shown that he possesses those qualities of leadership which would ensure victory for those who would be led by him. The Liberal Party is bound together by common opinions and principles. Conservatives may boast that there is, perhaps, a greater devotion on the part of his followers to the person of their chief. It resembles the influence of a Highland chief over the members of his clan, but the reception tendered to the Liberal leader shows not only that he has the completest confidence of that party, but possesses the magnetic power to inspire enthusiasm among his followers. I wish then to propose the health of Hon. Edward Blake, our honoured guest.\n\nThe toast was received with the most vociferous cheering, and three times were\nthe cheers given with a royal will, and when\nthe hon. gentleman arose the scene was one\nof wild enthusiasm which beggars descrip-\ntion.\n\nThe Hon. EDWARD BLAKE, in rising\nto return thanks, was received with loud\nand prolonged applause, the whole audience\nrising to their feet, and cheering him in a\nmost enthusiastic and loyal manner. He\nsaid:\n\nI beg to return you, Mr. Chairman and\ngentlemen, my most grateful and heartfelt\nthanks for the kindness of the terms in\nwhich you, sir, have been pleased to pro-\npose, and this distinguished company have\nbeen good enough to accept, the toast of\nmy health. I am very conscious, sir, that\nall this is due to your kindness of heart,\nand that it is to the warmth of your affec-\ntion to the cause we are met together to\npromote, that these expressions of sym-\npathy and confidence have been evoked.\nI regard it as an omen of the accessions\nof strength in the future and of the triumphs\nof our cause and principles, that you have\ngathered in such numbers and in such\nenthusiasm, in order to make the demon-\nstration, not in favour of any man or any\nset of men, but in substance and\nin reality in favour of the principles\nof the Liberal cause in Canada. (Cheers.)\nI had occasion already in this city, this\nafternoon, to address an important repre-\nsentative gathering of delegates and others\nfrom the various constituencies comprised\nin the district of Montreal, met for the im-\nportant, the vital purpose of perfecting\ntheir party organization, and it became my\nduty to discuss at some length the circum-\nstances which have been present to the\nminds and thoughts of all those who took\nan interest in public affairs for the last few\nmonths; and under these circumstances, as\nI presume many who where there are now\npresent here, I shall dwell upon those mat-\nters very briefly upon this occasion.\nReferring, then, without further preface, to\nthe subject which formed the principal\ntopic of discussion during the session, I am\nrelieved in this audience, I know, from the\nnecessity of enlarging upon that topic be-\ncause, as you, sir, have observed, I had an\nopportunity a little time ago, during the\ncourse of the discussion of the sub-\nject, of presenting to the people of Montreal\nmy views as to the course that the public\ninterest required to be taken in that mat-\nter. The views, which I did not disguise\nfrom you I even then entertained, as the\nresults of the struggle have been duly veri-\nfied; a great public misfortune has since then\nbeen instituted, and I may go further and\nsay a great public crime has been commit-\nted. (Applause.) I promised you then, in\nthe name of the Liberal party, that every\nopportunity which full discussion, which\nelaborate investigation, which reasonable\ndelays, which propositions exposing the ob-\njectionable character of the terms sub-\nmitted to us could give, should be given to\nthe majority of the House of Com-\nmons. That pledge, which was all\nthat we could give in the interests of the\ncountry, was redeemed, and every oppor-\ntunity was given to those who formed the con-\ntrolling element in the House of Commons\nto consider and reconsider the vital and\nmomentous character of the Act which they\nwere called upon to sanction. And I do\nnot speak without having weighed my\nwords, when I say that my belief is that\nthere was not merely outside that House\nbut also within its walls, at one time, a pre-\nponderance of opinion adverse to that con-\ntract. (Hear, Hear.) By what means?\nunder what circumstances? By what pres-\nsure? I don't accuse any one of baseness;\nI don't accuse any one of impropriety, but\nthere was a rallying to the support of the\nGovernment which deliberately chose to\npledge itself to the carrying of that con-\ntract. What that preponderating influence\nmay have been it is not for me to state; it\nis for the country to judge. It has had an\nample opportunity of hearing the merits of\nthe question, and it will have further op-\nportunities in the discussions which between\nthis time and the next general election\nmust take place; and, will be called upon,\nafter hearing the question, to decide as\nto whether or not we are in the right.\nAs I said to you in January, there was,\nin my opinion, no comparison between\nthe merits of the two plans that were\nproposed from the two sides of the House.\nWe offered to the consideration of Par-\nliament and the country this proposition:\nThat we should build the works neces-\nsary to get a communication with the prai-\nries of the North-West, already under way;\nthat we should proceed with the railway\nthrough the fertile territories as rapidly as\nthe colonization and development of these\nterritories required them; that we should\nsubsidise a Company to build the road to\nthe Sault, so that from East to West there\nwould be a railway connection with that\ncountry. To these comparatively moderate\nand limited objects we submitted that we\nshould devote all our energies, and not em-\nploy them upon an expensive scheme of\ncommunication and colonization, rather\nproceeding to the practical development\nof the North-West, so as to put into that\ncountry the people who would make it val-\nuable. You know you have been told time\nand again that the land which has been\ngiven away is not to be counted as worth\nvery much, because its value depends upon the railway which is not built there, but we said, \"Then do not give it away; but build the railway through the fertile belt to give the land the value which you admit it will bear the instant the railway is built.\" We pointed out that we would be in an infinitely better position by adopting that course than we would be by the construction of the line along the part which, for some years, will not be productive of any benefit to the country. That was our view, and against that view was set nothing but this, that it was necessary to make the contract at once—not the contract for building at once, because this work is not to be completed for a period of ten years—but that it was necessary to make the contract at once, and to enter into the engagement. They said that the engagement must be entered into at once, an engagement by which we gave work and money to the value of $60,000,000 and land to the extent of 25,000,000 acres, and privileges, exemptions, monopolies which largely increase the value of the land given to the Company, and largely diminish the value of this country. All these things, we were told, we must finally and forever, and at once convey to the Company. Then there was an alternative proposition. When it was seen what the margin of profit was likely to be to the Company, and as soon as the character of the engagements the country was to enter into became known, there arose a feeling amongst a number of substantial, influential and patriotic Canadians that it would be better that something should be done to make better arrangements for the country. A counter proposition was sent in to the Administration, as you know, by men of unquestioned financial ability, who showed their good faith by the deposit of over $1,400,000 in cash in the banks. I say a proposal was sent in, not such as I should like, and containing some of the blemishes of the contract, but infinitely better than the contract—better by $3,000,000 in hard cash, better by 3,000,000 acres of solid land, better by the abrogation of divers exemptions, monopolies and other particulars with which all of you are familiar. That alternative was before the Administration, but the Government's answer was, \"It is too late to save the money, or to save the land, or to get rid of the exemptions, the monopolies and the other objectionable features.\" Now, why was it too late? This offer was made within five weeks from the time at which the Administration had made known the fact that any such conditions would be listened to at all. No person had any motion until that contract was put before the Parliament that any such terms, so entirely different from what all former suggestions had been as to the terms of the contract, would have been accepted. You know that these gentlemen had had no preliminary opportunity to tender for the work, and that within that short space of time they had combined themselves, had made their offer, and deposited their money. Why was it too late? The Government had not been authorised by Parliament to pledge the public faith by the execution of such a contract. That was admitted in the event. It was admitted also in the event that this contract was not made under the authority of any Act of Parliament, or under the operation of any special resolution of the House of Commons. It was an Executive Act, entirely unauthorized, and which would only derive legality from being passed openly by the three branches of the Legislature. Before that Bill had been passed upon, it had been introduced, but before its final reception the second proposal was before the House, and before that same House of Parliament, to whom the first contract was submitted for acceptance or rejection, and the question to be submitted was indubitably within the competence of Parliament. That House was told that the terms of the contract were not the best terms that could be obtained, and it had before it still better terms, but it turned deliberately from the light and preferred the darkness; it turned from the good and preferred the evil; it turned from that which was advantageous to the country and deliberately preferred the worse and less advantageous bargain. (Loud applause.) Now, as I said to you in January, what we wanted was to prevent this result. We used every effort, and strained every nerve, to prevent it; we declared that our wish and desire was, by any means, by any statement we could make, by any attitude we could take on this question, to induce the Government of the day to act as the great majority of the people of this country believe it would have been in the public interest for them to act. We have not yet learned that Governments are infallible, or that they were in any sense bound, when they found that an error had been committed, when they found that far better terms than those which they proposed might be obtained, that they were bound to force those inferior terms upon the House and upon the country. Why did they do this? Was it such a great object to the Syndicate? If it was, we have an additional evidence of the character of the bargain. These terms were expressly to be subject to the approval of Parliament, and I believe that the Govern-\nment would have consulted its own true dignity, and I believe it would have consulted its own true interests best, and I know it would have been consulting the interests of its party best, and I am sure it would have been consulting the interests of the country if, this new state of things having arisen, it had yielded to our request. Such a course would have been accepted with a sense of relief both outside and inside of the House. Well, there remains nothing except for the public to judge upon this matter. There remains nothing except the deliberate judgment which, whether at any bye-elections or at the general elections, the voters in this country will be called upon to give as to the attitude of the two parties, and upon the question, whether the administration which has so dealt with the material, the vital interests of this country deserves to have the confidence of the people. [Loud applause.] I warned you at that meeting in Montreal that the situation of this country with reference to its public expenditure, was critical, and I pointed out to you that in former years, as in 1873, there had been a very large increase in the permanent public charge, and that that increase was excused by those who made it upon the ground that there was a large surplus of revenue, and that they were entitled to calculate on a financial surplus, and in the year 1873 they did calculate upon a continued rate of prosperity and an increment of the public revenue, and a satisfactory state of things. I pointed out at that time that such calculations were wholly fallacious; that the rate of progress in this country, any more than other countries similarly circumstanced, could not be definitely fixed; that in this country, as in other countries there were obvious and well-marked periods of undue stimulus, of great excitement, of great apparent prosperity, of large importations, and consequently great revenues, followed always and necessarily by periods just the reverse, periods of reaction, periods of depression, periods of poverty and economy, periods of reduced purchasing power of diminished revenue; and I said in public and in private that it was prudent to regard the general average rate of progress of the country as the true rate upon which we ought to calculate, and that we would not be acting in the right in making permanent additions to the public charges upon a conjecture, upon a supposed prosperity which was falsified by experience, that we were going on at a rapid and natural rate. All those arguments were proved in fact to be truths, for every proposition was realized not very long after, and it happened, unfortunately for the Liberal party, that they had to bear the brunt of it; for that period of depression and reaction, which was the inevitable consequence, came while they were in power, and those who had created that period of depression and reaction, who had made it more difficult to bear by adding to the people's burdens, those who sat on the other side of the House, permitted themselves to rebuke the Liberal party because there was a deficiency in revenue. Now I am not one of those who say that it is possible, in the existing state of things in this country, to carry it on without some additions to the public charges, or who say that all such additions are unnecessary, because the services require development, but I am one of those who say that, in our present financial condition, every proposed addition of a permanent character to the public charges ought to be watched with the utmost jealousy, because we are under very heavy engagements; we are under engagements which are very shortly to mature, which have been placed under Legislative enactment. With reference to the Pacific Railway, it will add very largely to the public debt and to the existing charges, and with reference to the development of the North-West Territories additions have been made in the same direction. Every addition that is made to the annual rate of public expenditure is serious. But, Mr. Chairman, having this overflow of revenue, these considerations have no more weight to-day than they had in 1873. But there is an additional circumstance which ought to give them more weight. That circumstance is this—that the surplus revenue now produced is not due solely to the recurrence of a period of activity, to the circumstance that we have exported an enormous excess of grains, of timber, of animals, of produce, and received a great deal of money into the country, which has enabled us to have the surplus. It is not due solely to these causes, but it is due to a cause beyond that; it is because there has been a very serious increase in the rate of your taxation. That is the reason why you have this surplus, as I said to my friends this afternoon, and credit is taken by the Government for having this surplus of revenue. They would almost have you believe that they had made the money—that they had earned it without its being any charge upon you. I really have been inclined to ask the question in the House, whether they believed that they had made a present to the people of this country of that amount; but in truth, in some way or other, in some shape or other, it is taken out of your\npockets, and the great art while they have displayed, and the great bene'at which they think they have conferred upon a grateful people, is that they have found out how to put a few lines in the Statute Book to add to the rate of taxation and to take something out of your pockets and put it into the Treasury for the public use. The Finance Minister deserves the gratitude of the people for this. He says to each of you, \"Sir, while you have heretofore paid so much in respect of importations, I call upon you to pay half as much again, and I take a great deal of credit to myself that I have found out that way of making a demand upon you.\" Now gentlemen, I say that, as the tariff has been adjusted, although the average rate or increase upon articles of importation or consumption appears to be from forty to fifty per cent., yet the taxation is so adjusted as to make the increment something like eighty per cent., and I believe it is laid on such classes of goods that the greater part of that surplus has been derived from the poorer classes of the community. It is obtained by taxes upon the prime necessaries of life; it is obtained by taxes on the raw materials of manufacturers; it is obtained by a system of taxation which is quite contrary to the principles of political economy, whether we belong to the protection school or the free-trade school; and it is obtained in a manner, in my judgment, most unscientific and bungling; in a manner which those who are the authors of the tariff have themselves indicated to be incorrect, because each session we have had a Tariff Bill, whilst each session we are told that the tariff is now perfect. I suspect we shall have another Tariff Bill next session, and another Tariff Bill after that, and then, I hope, in the good time to come, that we will have still another Tariff Bill. The situation has been made more critical by this increase of the public charges, because every such increase being of a permanent, or practically of a permanent character diminishes the available margin. As an illustration, you may compare it with the case of a landed proprietor who has a large extent of land from which he derives a somewhat fluctuating rental, and on which he has to pay from year to year a fixed rate of interest on mortgages. Thus he lives on a fluctuating margin—the margin between his rents and the interest, the interest being a permanent charge—and thus, in the same way, if our public permanent charges are, in a period of prosperity, to be recklessly increased and further charges be imposed, when the second period of adversity comes the difficulty will be still more serious than it was in the case of 1873. I feel, therefore, that if it be the fortune of the Liberal party once again to be called upon to deal with the finances of this country under circumstances of depression, and if, indeed, it be their fortune to deal with them under any circumstances, their task in regulating the public affairs, so far as our tariff is concerned, will be seriously complicated by the course which is now being taken, by which the burden of the public charges has been increased. If we are told that we have ourselves increased the public charges, we answer that, in our opinion, it is not right that the Finance Minister who, in 1878, declared that $22,500,000 was all the money that would be required for the public services, and that we were censurable because we were spending some $23,500,000, should subsequently come before the people of this country and say in 1881, \"We want $26,500,000 or $27,000,000.\" But I believe it to be injurious that we should have a large surplus in this country from year to year. In the first place, we do not want to put any more money into the Treasury than it absolutely requires, for the money is better in our own pockets than in the Treasury; and, in the second place, if it comes into the Treasury it furnishes a very easy excuse for an extravagant use of it. So long as you permit the system of a large surplus to be estimated for from year to year, so long will you find the Government declining to resist, or, at any rate, not resisting, every proposal to increase the public charges. If you choose to pay your money when you know it is unnecessary, then you have yourselves to blame if it is needlessly used. Now I have stated these considerations with reference to the finances in this country, and indicated that if this Government continues still in its present course, for two years to come at any rate, we must contemplate the raising of a very high revenue; and that the revenue must be raised, as it has been both before and since Confederation, by taxation from the Customs and the Excise. I say further, that revenue will have to be raised from the Customs duties imposed upon a great variety of articles. The doctrine is generally recognized by statesmen who have investigated the subject of finances, that, in Canada, revenue must continue to be raised from indirect taxation upon a large number of articles. There is no doubt whatever that this will continue until there is some new scheme of raising the revenue propounded, and that thus there will be a very considerable amount of incidental protection as an essential result from the very condition of things. You know, I suppose, my sentiments with reference to free-trade and protection. I have never disguised them, and it is not here, even in this city of Montreal, that I\nshould disguise them for an instant. (Hear, hear.) But I am not prepared to allow those who oppose us to distort the state of things or the attitude of the Liberal party on this subject, and I make those plain statements of what I believe to be absolute and essential conditions as to the mode of raising the revenue, as my contribution to the subject. At the same time I declare to you that it is my opinion, first, that in the interest of all parties, in the interest of the country as a whole, of all indeed, but an infinitesimal proportion of the people of this country, there ought to be very considerable modifications of the tariff. I believe it will be found to be right, and that it will be found to be advantageous to those who are engaged in various branches of manufactures throughout this country, that the increases which have been made to the tariff should be altered, and that it was not advantageous that those increases should have been made, coupled with the increases which have been made upon the raw materials of their trades; that these increases, in the interest of protection, which have resulted from the tariff, positively are hurtful, and that in many trades the cost of production has been increased, without any corresponding advantage to the persons engaged in the trade. I believe it will be found that the working of this tariff has mischievous results—that very mischievous results, which I do not intend to attempt to trace to-night, will flow from its operation. I stated as long ago as 1879, when I did not hold a seat in Parliament, that the people of this country, by a majority at the polls, and by an overwhelming majority in Parliament, had determined to try for themselves the experiment of a very high restrictive tariff, and that as the experiment was to be tried, it behoved us to pay for our experience and get the benefit of the lesson. I believe it behoves each one of us with unprejudiced minds to watch the working of this experiment. My own opinion is very strong that it will be found that the experience of other countries might have served us for a guide, but we have determined to buy our own experience, and we ought to take advantage of the lessons for which we have paid. If we take a case of a country where there is a large manufacturing interest, and another country where there is a large consuming interest, and if we have an anxious desire to ascertain what the working of this system is, in order to reach a sound conclusion upon it, we must not go far. All that I desire is that, in making investigations, the people of this country, whether they look at the subject from one point of view or the other, should endeavour to embrace both. Those who maintain the importance of a high restrictive tariff have always this advantage, that they can point to concrete results; they can point to the manufactories, to the hands employed, to the goods produced, and say, \"There is our argument.\" That, it is admitted, is not the whole case, and it is acknowledged there is another side to the question and another point of view; but the difficulty is that, in order to bring that other point to view, opponents must not use the same method. They have a different eyesight, they have arrived at their conclusion, and have based their process of reasoning and investigation upon it. Now, what is it that makes this magnificent city of Montreal? It is not your merchants' warehouses; it is not your large manufacturers; it is not the number of rich capitalists; it is not the artisans that you have here. It is the people who consume the goods. (Laughter and applause.) All your interest is bound up with theirs; your interest is bound up in their prosperity; as they prosper so will your trade prosper, and as they feel themselves less able to buy, so will your trade become more dull. It is important to you, in the narrowest sense, looking to your own interest, to your own individual interest, to consider the condition of the community upon which your prosperity depends, and to consider the effect of the general scheme of tariffs upon the general prosperity of the consuming community. (Applause.) I do not investigate this subject further now than merely to throw out this suggestion for your consideration, and to ask you to consider the subject in its full scope, and endeavour to investigate the subject from every point of view; and not to form a judgment either upon one side or the other, except upon full consideration. Now we have declared in Parliament our opinion that this enormously heavy tariff ought not to be continued at its present rate; that it ought to be reduced, so as to create something like an equilibrium between the revenue and a reasonable expenditure. We hold, in fact, that the tariff presses most unequally upon the different sections of the Dominion, and I suppose you will all agree with me that taxation ought, as far as possible, to press equally upon all parts of the country, that the burden ought to be borne equally by all. We say that the class of taxes which presses hardest upon the masses of the population is a very high tax upon the necessaries of life, and that is the class of taxes which are at once the most oppressive to the consumer and the least productive to the revenue. We believe that that\nis a general statement of the principles which ought to animate you in the investigation, and I believe that that statement would meet the approval of all the people in this country. (Applause.) But, sir, you will find, no doubt, that objections will be raised by some industries. My opinion is, that, as the experience which we are obtaining gets a little older, a little riper, a little more mature, other views may develop themselves, and that the strength of the cause of those who object to this particular tariff with its provisions, will be increased. For us of the Liberal party, our hereditary opinions are in favour of liberty, liberty of the nation, liberty of the person and liberty of property. (Hear hear.) We believe that a cause which calls upon us to restrict any of those liberties requires us to believe and to profess the opposite of these principles. We believe that, prima facie, it is right for each one of you to be secured in the liberties to which I have referred, and amongst the most valuable liberties in connection with property is freedom to sell or exchange it to the best advantage, freedom to dispose of it where you will, whom you will, upon the best terms you can. (Applause.) It may be in the public interest that that freedom should be restricted, but we Liberals are entitled to call upon those, who ask us that freedom should be restricted, to give us a very plain and obvious reason why. (Applause.) There is another principle upon which we are at issue with our adversaries, and upon which we have different opinions, that is, as to the effect of the operations of commerce and of exchange. We think that a free and voluntary exchange is to the mutual benefit of both parties who effect the exchange, and we believe that that position is established by the mere fact that it is a voluntary exchange, because if it had not been suitable to both parties it would not have taken place at all. The very fact, we say, of an exchange indicates to you that, if it be free and voluntary, both parties to that exchange thought that it was to their benefit that the particular exchange should take place; that is our opinion of commerce. Our belief is that there is no restriction needed, and that in a fair exchange each party profits by the operation; each pays that which he is willing to give for what he wants, whether it be in the form of goods or in the form of money. Our belief is also that this action is recognized often by those who sometimes oppose us. Why were we anxious to obtain Confederation? Why were we anxious to enlarge the boundaries of the Dominion of Canada? Why, we wanted to abolish the Customs' lines between Quebec and Nova Scotia and the other Provinces, and we thought it would be to the benefit of all parties if that Customs' line should be abolished. We thought it would be for the benefit of Quebec; we thought also that it would be for the benefit of Nova Scotia that there should be mutual exchange for the mutual benefit, and therefore we are of opinion that a free exchange is for the advantage of all parties. Nor are we of opinion that it necessarily follows that the limits of a free exchange are reached when we reach the boundaries of our own soil. If another country has greater natural facilities for producing any article, and can produce it cheaper, and if we can get it cheaper from that country, and if that country finds that we have greater natural facilities for producing some other article, and can make it cheaper than it can, then our belief is that a free exchange should take place between these countries. I believe that each of us would profit most by engaging in that industry which would be of most value to the other, and that the whole nation will profit most by its individuals being similarly engaged. We think that if a nation puts restrictions upon its trade with other nations, and when these restrictions which are imposed prevent free exchange, then there is a loss to both countries, because, if you had not instituted that tariff, the free exchange which would have been beneficial to the parties mutually engaging in it would have continued, and if you fix a tariff, then the other country will not allow you to have free exchange with its people, therefore the loss will weigh upon you both, and the effect of it really is as if a man were to say, \"If you will not allow me to sell my goods to you, and if you insist upon my losing $1, I shall insist upon losing $2.\" Now these are the abstract views that are entertained of the practical operations of the fiscal affairs of this country. It is obvious that, for many years to come, we shall have to raise a large revenue in this way, but I desire to say this, that we should take care in raising that revenue that we inflict the least injury and impose the fewest restrictions, which we can, and none which can be avoided. (Applause.) Now, I have one more suggestion with reference to the future. My belief is that whatever may be the ebbs and flows of public opinion on these questions throughout the world, the great forces are with the cause which we advocate. The material forces of nature are in its favour—steam, the railway, the telegraph line, every improvement in production, in transport, is in favour of the general principles to which I have alluded—and if the potent advantages of these mighty factors are in its favour, then we cannot but believe that the day is\nnot far distant when we shall see countries taking juster views than they do at present of those principles which regulate the commercial and fiscal affairs of nations. Speaking at the instance of the Young Reformers of Montreal, I will be permitted to address to them a few words upon the general principles of reform. [Hear, hear.] One of the most eminent English Reformers not long since described Reformers as men who desire to subordinate personal and sectional interests to the national interests. Now, on what is that hope which is the first and leading characteristic referred to in this definition founded? It is founded on the indefinite—I will not say infinite—but the indefinite possibilities of improvement in the intellectual nature of man, in his condition, in his width of view, in his view of all questions with regard to which the doctrines and standard of public virtue are disseminated among the community. We know what has been done in the way of invention and improvement in the last 50 years. I briefly alluded to a score of great and important improvements a moment ago, but we know also that the practical inventor may adopt wonderful theories, but his theory will not always work; it will be defective in some respects, and will not always carry out in practice if he does not make allowance always for some things. If he does not make allowance for the resistance of the air, if he does not make allowance for the power of gravitation, if he does not make allowance for a specific degree of tensile or other resistance in materials—all these allowances must be made, but they are in their very nature almost fixed, and a scheme, however admirable it may look, must fail if the inventor has not made these allowances.\n\nBut the task of the Reformer who engages in the improvement of the political institutions of the people, and of the machinery under which they are governed, and of the different Governments under which they live, is more complicated, while it is a more noble task. Why is it more complicated and more noble? Because the indefinite possibilities of improvement in the moral domain are infinitely greater than in the physical. The inventor cannot alter the resistance of the air, he cannot alter the law of gravitation, he cannot improve the conditions of the tensile resistance of a material, but we know that the material upon which we work is capable of indefinite improvement, and, therefore, it is our happy privilege to aspire to an ideal beyond that which we feel may be at this moment realized, and strive towards that which may not be attained in a very short time, by which it is our privilege to look forward and upward to—to look for such an improvement in the condition of the people amongst whom and for whom we live,—to hope that institutions and conditions may be created which we know cannot at this time successfully work, because the conditions under which the people live will not permit it, and which, since they have not as yet sufficiently improved, may work successfully in the future. (Applause.) I hope the Young Reformers will see that it is their duty to elevate the mental eye and to grasp at the higher ideal and recognized possibilities of improvements to which I have referred. I believe that that is the practical, the present and the definite end which they ought to have, and by which they ought to work, not, indeed, that these are the final ends, because we ought to look forward beyond the task in which we are engaged, and they will find in their sphere of action that the horizon does open out and widen upon us, and that there are heights of ideas and principles attainable by us if we have honestly persevered beyond those which are present to us at the moment. (Hear, hear.) If we do not do this, we run into some danger, for those who have been ardent Reformers in their youth may become suddenly Conservatives in their old age. I have seen men who, having placed before them some definite ends, have never advanced beyond their immediate attainment, and have made them their sole goal, and have not looked beyond them, and have thought that their attainment was the work of a lifetime, and perhaps thought that, when these things were attained, perfection had been reached. They believed that there was nothing further in the future, that it was time to \"restand be thankful,\" as Lord John Russell said, after the Reform Bill of 1832, unconscious that there was to be a Reform Bill in 1867, and another afterwards. These observations may be, to some extent, illustrated by the suggestion which has been made that the Conservative party today are the legitimate successors and inheritors, and are proceeding upon the lines of eminent Reformers in the past. We know they claim to be the political heirs of Baldwin and Lafontaine. (Hear, hear.) We know what the struggles of Baldwin and Lafontaine were. (Applause.) We know the 20 years' struggle for Responsible Government, a very important thing of that age. No doubt it was the most important change possible, and the most important change likely to obtain in that generation. But we know that during all that time, during all those struggles and the other struggles which made these men's names famous in this land, they did not receive any very warm\nmeasure of support from these men, not even from the present living members of the party who now claim to be the true inheritors of their title. (Applause.) We know that the introduction of Responsible Government was opposed by those men who now claim to occupy the place which Baldwin and Lafontaine would occupy if they were still alive. I am old enough to remember a gathering in the city of Montreal which occurred a great many years ago,—I was only a lad at the time—it was when the long struggles for the people's rights had culminated in a glorious victory at the general election; and those gentlemen were reaping the rewards of their labour, and were engaged in maturing legislation beneficial to the community. But I think that they did not receive any very warm support from some of these gentlemen who now speak differently of them. I think I recollect that there was a banquet, and upon that occasion Baldwin and Lafontaine did not receive quite the reception they deserved in the city of Montreal from these men of which these gentlemen speak. We know the struggles and the measures with which the names of Baldwin and Lafontaine are identified; we know that they were the strugglers for responsible Government and for the secular relations of King's College of Upper Canada. I am glad to be able to say to you that the effect of the measures with regard to the Upper Province, to which I have alluded still lives, and that it bears important fruit, and that although difficulties have been interposed in the way, it has been very beneficial to the country. And one of the most important proofs of the wisdom of the scheme is to be found in the fact that within a few days from this time there has been in accordance with the provisions of that measure, the affiliation of the Roman Catholic College of St. Michael's with the secularized University of Toronto, as representative of the only denominational institution of King's College. I say, therefore, that these are measures, for which we are in Ontario, and for which you in Quebec, will ever regard Baldwin and Lafontaine with respect, but those gentlemen who now speak so of them cannot boast that they helped them on in their work. Now I would ask the young Reformers to look at these institutions under which we now live, and to see what the real vigour and substance of them are and what flows from them. It is just as well to take a Radical view of these things. A Radical is one who looks at the root of the matter; a Radical is one who considers the form and substance, and understands the real form and features of things, both those that he admires and those which he does not. What is it which endears us to the principle of a Constitutional Monarchy? It is because we believe that under it substantially we have the fullest development of the doctrine of self-government. It is because we believe under the form of a Constitutional Monarchy we have in a very efficient way the old and benevolent name of a Commonwealth; that it is the Commonwealth that governs us. Now what is our plan of carrying out this system of self-government? We have a Legislature elected by and which ought to be, as it is said to be, representative of the people, and we have an Executive chosen out of that Legislature, and responsible to it, and through it to the people, and we have an independent Judiciary. These are the three elements of them, and we enjoy these in their essence and in their substance. But I think there is yet something to be done, to which Young Reformers may well look forward as the work of their lives. Having that self-government, there are some important matters in the disposition of which we have no part or control. You know, with reference to our foreign policy, with reference to our commercial treaties, and with reference to all those things which are called matters of Imperial concern, it is not the Empire at present which decides but it is the Ministers of the Crown who reside in England. It is not all the subjects of the Empire who have to pass upon the matter, and in which they are deeply interested, but it is the Ministers of England and the representatives of the English constituencies to whom they are responsible. We are, in this particular respect, in a subordinate and dependent position; we are not merely subjects of the Queen, but we are the subjects of the Queen's subjects. (Laughter and applause.) For my part, I don't feel comfortable so long as that state of things exists. I quite agree in the suggestion made by Mr. Mercier, this afternoon, that we ought to have a voice in the making of the commercial treaties, and that we ought to have a voice in the making of treaties which affect ourselves, and that in all these matters which affect the common interest of the Empire, these four millions of British on this side of the Atlantic ought to have some voice in their disposition. (Applause.) It is a long time since I pointed out that we were drifting on this subject, and since I ventured to point out danger in drifting, my belief was, and my belief is to-day that we ought to take up this subject as one of vital and pressing importance, and that it ought to command our best efforts and our best\nenergies in order to reach some solution of it. What are the facts of the case? We are said to belong to a partnership; but the great element of a partnership is that all of the firm shall have a voice in the concern; but that is not the case with us for we have not a voice in the concerns which affects us, and I say that the time is coming when the people of Canada will decline to submit exclusively to the government of other people in matters in which those people have no concern. It will be in the remembrance of most of you, that there is a story of the Sibylline books, where the Sibyll first offered five books, which were refused, and then four and so on, until she got the same price for the one as she had first asked for the five. So it may be with us upon some questions, It may even be that many of the Sibylline books have been burned. It may be we can find a mutual ground; one would be the question of common defence, and if it were so I would say you might rely upon it that Englishmen of every shade on this side of the water would join in the idea of a banded Empire, having its local affairs managed by local Parliaments, but banded together inseparably always and for ever for the common defence. I believe that such a confederation would be a good omen for the future, would be a good omen for the preservation of the Empire upon the reasonable grounds of giving satisfaction to all its subjects, and a good omen of peace and progress and prosperity for the world at large. The question is being broached from other quarters; it is being considered in other parts of the Empire. Does anybody suppose that the Irish question is going to be settled by a Land Bill? Does anybody suppose that if the Land Bill is just in its provisions that that will dispose of that question? No. What is wanted is what Mr. Gladstone foreshadowed in his speeches in Scotland before the general election, an honest attempt to deal with this subject, to remit the local concerns to local bodies and to remit Imperial concerns to an Imperial body. (Applause.) Now, as to this negociation of our commercial treaties, what were we told last session? We were told that we were going to have an advantageous commercial treaty with France, that Sir Alexander Galt was at Paris, and that it was on the point of being done, but whilst the question was being considered by the Foreign Office, the critical moment passed, and the occasion and the treaty was lost. I never heard a stronger argument than that to enforce what I say. The only reason given was that the Ambassador was not there to close the bargain, at the time the bargain could have been closed, and for that reason the favourable moment had passed, and we have to wait for the recurrence of another favourable moment. (Loud applause.) Turning, however, to our own institutions, we are supposed to have a representative body, representative of the public opinion of the people. We know also that that system is defective, because the arrangements are such that it does not give fair representation of the people at the polls. What do we find? Why, that in the Province of Quebec, in Ontario, and, indeed, in the whole of the Dominion, at the last general election there were almost as many people voted for the Reformers at the polls as for the Conservatives, but there was an overwhelming majority in Parliament for the other side. Is that creditable? Is that an adequate and fair representation of the people? Is it proper, that whilst they should be registering their decisions, that the arrangements should be made that though their numbers are equally balanced at the polls, there should be an overwhelming majority in the House? It is argued that this system works fairly, because it is just that small minorities ought to be represented, but, in my opinion, the Parliament ought to be a mirror of the people it represents; it ought to reflect the various shades of opinion, and in that way it ought to be a complete representation of the sentiments of the people. It is quite possible, upon a fair investigation of the matter, to give a fair chance to small minorities, to give them an opportunity of representation, but we find by the present system, that in certain districts they are so represented far beyond their strength and far beyond their numbers, and that in that way Parliament is not the mirror of the people it represents that it ought to be. I think the Young Reformers of Montreal and elsewhere may well occupy themselves with these investigations, and I believe that they will find that the machinery which has been adopted in this country is defective, and that some plan should be established for improving our institutions in this respect, and make Parliament more really representative. The only objection which I have heard to a scheme of combination in this matter is that it would be too complicated, but I believe that the subject is worthy of discussion, and that some system could be adopted by which we should succeed in having a thoroughly representative House of Commons. (Applause.) Again, they ought to consider the question of the authority of the Executive, or I consider that there is too great power vested there. Unless you insist that measures shall be brought down at such a time that\nfor that reason the bill had passed, and we may look forward to the recurrence of another session. (Loud applause.) We have our own institutions, and we have a representative form of government. The public opinion of the country knows also that that arrangement is not because the arrangement is not that it does not reflect the wishes of the people. What do we find? In the province of Quebec, in the constituency of the member for the general election there was a large majority of people voted for the Liberal party. As for the Conservative party, they had an overwhelming majority in the constituency for the other side. Is it not evident that an adequate and representative government of the people? Is it not evident that they should be registered and represented? Is it not evident that the arrangements made by the government though their numbers may be small at the polls, there is an overwhelming majority in the constituency that this system works well. It is evident that small minorities can be represented, but, in my opinion, it ought to be a mirror of the people, it ought to reflect the wishes of the people, and in that way give a complete representation of the people. It is quite evident that the investigation of the question is a chance to small minorities to find an opportunity of representing themselves in districts they are so numerous in, and that their strength and numbers, and that in that way it is not the mirror of the people's sentiments that it ought to be. The Young Reformers are doing good work where they may well occupy a prominent position in the investigations, and I believe that they will find that the measures which have been adopted in this country, and that some plan for improving our institutions, and make Parliament more representative. The only thing we have heard to a scheme for this matter is that it is complicated, but I believe that it is worthy of discussion, and that such a system could be adopted so that we should succeed in having a thoroughly representative House of Commons. (Applause.)\n\nI now consider the question before the Executive, for I consider that great power vested in the hands of the executive at such a time that there shall be a full discussion, and an opportunity given for the popular view being obtained before Parliament finally passes upon a measure, you practically reduce the House of Commons into a machine for registering the decrees of the Government, instead of a real representative legislative body. (Applause.) I have seen Act after Act passed at periods when under circumstances when discussion was practically impossible, when communication with the country was impossible, and when grave mistakes were made and great and momentous errors of policy placed upon the Statute Book just because the Executive acted upon a policy of delay, and chose to bring down measures too late for Parliament efficiently to do its work.\n\nIt is right to insist that Parliament shall not be called upon to decide upon any measures brought down too late for fair consideration. If Parliament is to subserve its real purpose there must be an absolute power of dissent, and to resist the encroachment of the Executive upon the Legislative power. It is a very gratifying circumstance in public life that there is in Parliament a strong disposition to discountenance any personal animosity, and that whatever differences of opinion there may be between us on political matters, we may exercise courtesy towards each other, but still there can be no doubt that a nobler style of friendship than that of those who agree on such matters cannot be imagined. It is twenty-five years ago since I read Sallust, but I think he says, \"Idem velle atque idem nolle de republica, ea demum firma amicitia est.\" You have associated yourselves as a band of brothers; on public questions you encourage an independent spirit, but you desire to unite to do what is best for the interests of the country. Our duty is to recognize and encourage you in this task; everywhere unity is essential; we require union in order to succeed; with union we shall succeed. You know it is said that \"little drops of water and little grains of sand make the mighty ocean and the solid land,\" and any one, however insignificant, however small he may be, and unable to do anything alone, if he will join himself to a mighty mass, if he will incorporate himself in a great body, seeking to promote great public interests of the country, and a noble party, hence will be irresistible in the cause of truth and justice. (Loud and prolonged applause, during which the hon. gentleman resumed his seat.)\n\n\"The Senate and House of Commons\" was the next toast, and was proposed by Mr. R. MACKAY. He said:—\n\nMR. CHAIRMAN AND GENTLEMEN,—There is another toast which, as loyal Canadians and good citizens, we should drink with enthusiasm. If there is one thing more than another of which we should feel proud, it is of the liberty and equality guaranteed the people of this Dominion under our constitutional form of Government. I need not refer here at any length to the noble struggle of early Reformers like Baldwin and Lafontaine to establish representative institutions in this country on a sure and solid foundation. History will do justice to their names. Reform principles in those early and more exciting times are in effect the principles of the Reform party today—principles which every true Reformer is bound to assist in upholding and perpetuating. There is more than one gentleman in this room, whom I need not name, whose public life has been devoted to maintaining and extending the privileges of Constitutional freedom for which our fathers contended. It is especially fitting, then, that we have here to-night, to reply to the toast of the Senate and House of Commons of Canada (the embodiment of our representative institutions), public men whose fortune it has been to bear a prominent part in the contest for Constitutional Government. Gentlemen, \"The Senate and House of Commons.\"\n\nThe toast was received with loud cheers.\n\nHon. Mr. THIBAUDEAU replied for the Senate in a happy speech. He said that he was sorry that he was called upon to make a reply in a language of which he was not a master. The Senate, he could say, was a non-committal body on all occasions. (Laughter.) He was pleased that the Young Men's Reform Club had been so successful in their banquet to the honoured Chief of the party. (Cheers.) The Liberal party was to be congratulated on the fact of Mr. Blake having assumed the leadership, and under his guiding hand he trusted the day was not far distant when the great Liberal party would once more wield the destinies of their common country. He desired to make his speech short, so would not detain them with any long account of the virtues of the Senators. (Loud laughter.) He again congratulated the Young Men's Reform Club on the success of their effort that evening, and trusted they would go on and achieve greater things.\n\nThe Hon. WILFRED LAURIER next addressed the assembly as follows, in response to the same toast:—He referred to the unqualified success of the dinner in proof of the vitality of the Reform party in Montreal. The success of the dinner should be considered, as it was the dawn of a new era in the history of the Reform party. The great reverse sustained by the party at the elections of 1879, the loss of\nsome of its most gifted leaders, a few deserts and other events, contributed, without doubt, to a great extent, to throw some despondency into the ranks of the party. The Liberal party in the Commons had been reduced during the last session to insignificance in point of numbers, but he was glad to say that, notwithstanding these uncontrollable circumstances, the representation of the party in the House had fought nobly for the cause of the people, and none of them was entitled to greater thanks than the hon. gentleman who was their guest this evening. The Liberal party was led by principles, and it was a noble satisfaction that those principles had been professed by such men as Lafontaine, Baldwin and Papineau, and that it was due to their triumph that Canada had obtained responsible government and the great boons which followed in its train. They had one satisfaction of which they were justly proud, and that was that they had\n\nALWAYS ACTED WITH JUSTICE,\n\nand that their only object was the triumph of the people's cause. The Liberal party's pride and satisfaction was to fight the people's cause, and that alone was incontestible proof of the sincerity of their motives. He did not desire to be classed as an evil prophet, but he was profoundly convinced that the policy of the Conservative party was driving the country on the verge of a financial crisis, which would inevitably fall on them in a short time if they remained in power. The Reformers of to-day are the successors of the great figures of Canada's statesmen in the past, who appeared as gigantic monuments in the constitutional struggle. It was their duty to uphold those principles for which their forefathers fought on the battle-field, defended at every possible moment, and for which some of them went to the gallows. The day was brightening up for the Liberal party all over the Dominion, and, as representative of Quebec, the old capital, he could assure them that there were no constituencies that would remain more faithful to the flag than Quebec East and Centre. The loss of Bellechasse should not be considered as a sign of their decay, and he hoped that at the next election Bellechasse, as well as the country, would return Liberal members in great majority.\n\nThe Hon. Mr. HUNTINGTON was then called for, and mid hearty cheers began as follows:—\"Mr. Chairman and gentlemen: I do not rise to make a speech; my great leader has eclipsed all efforts at oratory, and I can add nothing to what has been said. I remember other dinners, many and great dinners, given by the Liberal party, all indicative of strong feeling of regard for the principles of the party, but I have never seen one which in any way equals the dinner given to-night. I remember occasions when great leaders have failed to electrify this Province, but that time is past; we now have a leader on whom all can freely unite. Why, even the Tories would, many of them, be glad to follow our leader if they could do so in common decency. The day for the stupid old-fogy ideas as to the correct order of things was gone, and people now thought for themselves. There are young men in the Liberal party who hope to go to Ottawa, sent by their people, with freedom to use their own ideas, and not merely go as paid overseers, at so much per month, to interpret any set ideas but their own; and there are young men in the Conservative ranks to-day—many of the young Bleus who are hovering around the door and looking at this splendid gathering—who would gladly join with us under such a leader as we now have. I believe that the demonstration to-night is the initiation of that action which will revolutionize the party in Canada. There are no unfavourable impressions against this leader among the habitants of Lower Canada. I do not believe there is a man in the Dominion who would be less inclined to do a wrong to Lower Canada than Mr. Blake. There is\n\nA GROWING BELIEF\n\nin Lower Canada that there is no Conservative following for any length of time; and there are few who would not willingly accept the leadership of Mr. Blake. (Cheers, and cries of \"Hear, hear.\") It seems by that, then, that this fact, which we thought a secret, has leaked out, or, as Sir John would say, \"a little bird whispered it.\" I heard it whispered in rumour, but it seems I am not the only one who has heard it. The people of Lower Canada are an honest people; some of them do not agree with some of my views, and some of them think that I would curtail their religious liberty, or interfere with it; but they have no such fear about Mr. Blake, whose father fought so valiantly for Lower Canada in 1849. They have not forgotten the services which he rendered them then, and will show their gratitude by sustaining and aiding the son who follows so closely in the footsteps of his father. But I do not intend to make a speech. Confidentially, I may as well tell you that I am sick, and ought to be in bed. I am proud of this gathering and this Club; it is the legitimate offspring of the speeches made by our great leader during his former visit to Montreal, in January. The like has never been seen before. The Gazette says that there is no Liberal sentiment among the people of Montreal; that party exigency is the only cause recognised. Well, all I\nhave to say is that those who read the Gazette will be misled. In speaking of the representatives of Montreal in the House, the gentleman mentioned the name of Mr. Gault, M.P., and, in making a gesture, he accidentally knocked over a bottle on the table; he quickly remarked, \"That is only an empty bottle,\" and the audience seeing a chance for a double entendre, took up the joke and laughed heartily. After humorously alluding to the Gazette's article of yesterday, in which the Hon. Leader of the Liberal party was asked for his programme, the speaker went on to say: In England it has been said that this independence of thought and diversity of opinion really indicates that the Liberal party is disunited, that it represents so many differences as to make homogeneity impossible and that its personnel in the House of Commons does not represent its diversified opinions in the country. He (the speaker) thought the record of the party in England, and its achievements of the past 50 years were an ample refutation of this theory. But in Canada, at any rate, there was no embarrassing want of union, and to find a party made up of hostile and conflicting elements in the country, though acting together in the House, one would have to search for such among their opponents than themselves. (Loud cheers.) At any rate, party administration of public affairs was a patriotic duty, whether in office or opposition. The responsibilities of the party were most serious, and that responsibility of the whole party immediately obtained to the whole of its members. (Hear, hear.) Voluntary associations added to its strength, but did not relieve individual responsibility, and so the young men of Montreal, in the work on which they were entering so successfully, were nobly obeying the behest of party and duty. (Loud cheers.) He was proud to give them his hand and welcome them to the field of battle. The party was not strong now, but its cause was just, and he believed the people were growing daily more eager to recruit its ranks when an opportunity should arise. (Cheers.) Its days of adversity would not frighten them. Men who were worthy of success would not be disheartened. Though their numbers were few, their principles were eternal, and proud should be the man who might be permitted to give a hand in bringing the grand old party back to power. (Loud Applause.) But though they were brave in spite of their misfortunes, there was no denying that misfortunes had overtaken them, as if indeed, it were intended, they should be tried as by fire. He alluded not so much to accidental disasters which had befallen them at the polls, as to the loss of the good men who had fallen by the way—the calamity of their recent dead. Theirs were as well public, as personal bereavements, and in the past few months the Liberal party had been dreadfully afflicted. No wonder that a wall of grief and discouragement had gone up from all over the land, when such men as Holton, Brown, and Letellier, were called prematurely away. So far as we could see their work, though well done, was but half done. The country could ill spare them to the inexorable destroyer. But they live among us as exemplars still. Be ours the duty in emulating their zeal, their patriotism and devotion to the country's weal. If any can equal their virtues let them be proud of it, and let all strive to accomplish the task they set themselves—being useful to their fellow-men, and thus serving their country. (Cheers.) Politics do not admit of mathematical exactness, and men will always differ as to the events of these good men's lives; but no one will say they were wrong, as they stimulated the people' to high and disinterested efforts of tolerance and forbearance to our mixed communities. Your task, gentlemen, as an association and as individuals, will have been well fulfilled when you have gone and done likewise, and placed the citizenship of your countrymen before all class distinctions, and seeking to work out the highest development of your country's good have struggled to achieve and maintain for your countrymen the equal rights which were guaranteed them by the Free Constitution under which they live. Your fathers struggled for that constitution and that freedom against obstacles relatively more powerful than our adversaries can bring against us to-day. It is left us rather to preserve our liberties than to win them. The Reform party welcomes you as co-labourers in the great work, and demands constant faith and vigilance, and you will thus earn the ample reward of conscious right and the approval of the good men of your time.\n\nMr. D. BARRY, Second Vice-President, in a few brief and well-pointed remarks, proposed the \"Provincial Legislature.\"\n\nHon. Mr. JOLY, who was enthusiastically cheered on rising, said, in response, that he thanked the Club for giving him the pleasure of being present, and for the honour they had paid the Hon. Edward Blake. It will strengthen his hand and heart, and redouble his efforts in the work of the Liberal party. He wished to thank them for the loyal support they had given him (the speaker) and his colleagues in 1878-9. He had not been able to thank them before,\nbut he did so now, and did it most sincerely. (Cheers.) It would be a difficult matter for him to speak of the whole of the \"Provincial Legislature,\" as there was one part of it, the \"Legislative Council,\" he could hardly reply for, considering his relations towards that body. He had to thank that body, and a few men who had been returned to support him and his colleagues, for now having to speak as the Leader of the Opposition. However, whether in office or not, he would always be found true to the principles of the Reform Party. (Cheers.)\n\nMr. MoSHANE, who was loudly called for, said that he felt very proud at being called upon to speak for the Provincial Parliament. The small band of Liberals there were true to their principles and were well rid of the traitors. (Cheers.) He thanked the Young Men's Reform Club for doing honour to a countryman of his, one who, in the near future, would rule over the Dominion as its Prime Minister. The speaker paid a high tribute to the fair play which Mr. Joly had dealt out to all creeds and nationalities while he was Premier, and this fact alone had made that gentleman more popular than ever. He warned them to be prepared for the fight in 1883, for as sure as water ran and grass grew, the Liberal party were going back to power. (Cheers.)\n\nMr. MOFFAT proposed—\"Our Mercantile and Manufacturing Interests.\"\n\nMr. E. C. MONK, in a few well-chosen remarks, gave—\"The Reform Association of Montreal.\"\n\nHon. Mr. MERCIER, replying, said he felt proud to be called upon to answer to the toast, before such a brilliant assemblage and in the presence of their distinguished Chief, the Hon. Edward Blake. (Cheers.) He could say for the Reform Association that the members were pleased to see the young waking up and taking an active part in the welfare of the country. He had every hope that the organization of the party, on the basis which marked the proceedings of the Convention, would have beneficial results for the whole Province and country. Nothing could be won without proper organization and discipline. They wanted in the party for the future less speeches and more real, earnest, active work in all the constituencies. The battle which they would have to face in a short time in this Province would be a sharp one, but they must face it like men, and nail their colours to the mast. (Loud cheers.) The aid of the young men in the struggle would be of great advantage, and he was pleased to hear that they were in a good state of organization for the contest. The speaker then referred in eloquent terms to the labours of the party in the past, and of what had been gained for the people through the persistent and watchful care of the Liberal party. He was not a believer in fate, yet he firmly thought that kind Providence has destined that the Liberal party shall be the means of saving the country from ruin. He was glad, also, to know that there were enough honest and noble men in Montreal to come forth and do honour to the honest man. The young men of the Reform Clubs of the city were highly talented, full of courage for the future, and were, above all, most patriotic. (Cheers.) With such sentiments animating them, three strong Clubs in this city, working for the same cause and under the same flag, the party could not fail of success. (Cheers.) Let them always remember that they were, above all things, Canadians, whether of English Scotch or French extraction. This land was their common heritage, and was worth having and dying for. They had a leader who possessed the confidence of every one of the party, because he was well-known to be a strong lover of his country, was a Canadian above all things, and was a lover of fair play. (Loud cheers.) Under such a leader, and with proper organization the party would soon be strong again and capable of protecting those rights so dear to all freemen. (Cheers.) He once more congratulated the members of the Young Men's Reform Club upon the grand success of the evening.\n\n\"Our Sister Clubs\" was proposed by Mr. JAMES N. GREENSHIELDS.\n\nHon. Mr. LANGEUER on behalf of the Reform Club of Quebec, and Mr. A. E. POIRIER and FAVREAU replied in clever and interesting speeches.\n\nMr. SELKIRK CROSS proposed \"The Press,\" which was duly responded to by Mr. BEAUGRAND, of La Patrie, and the representatives of the HERALD and Witness.\n\nMr. W. F. RITCHIE proposed \"The Ladies,\" which was neatly replied to by Mr. B. C. MACLEAN.\n\n\"The Young Men's Reform Club,\" proposed by Hon. Mr. MERCIER and Hon. L. S. HUNTINGTON, was replied to by Mr. J. J. MACLAREN, the President of the Club.\n\nThis ended the festivities, and the singing of \"God Save the Queen\" and \"Auld Lang Syne\" brought this grand Liberal reunion to a close.\n\nDuring the delivery of the speeches the gallery was crowded with ladies, many of them being provided with seats in the room. One and all remained to a late hour, and apparently took a deep interest in the proceedings. The dinner is pronounced by outsiders who saw it to be the finest ever given in this Province to a public man.\nADDRESS TO MR. BLAKE.\n\nThrice welcome to our Chief!\nWith loyal hearts we greet him here to-night—\nOur leader in the earnest fight;\n'Tis ours to wage for truth and right,\nFor progress—marching side by side\nWith freedom's ever broad'ning tide;\nFor principles we share with those\nWho in a darker age uprose,\nAnd fought as true Reformers flight—\nFor justice, liberty and right.\n\nBehold them—men like Russell, Hampden,\nPym—\nThrough tardy centuries have their crowns grown dim;\nA Fox, a Burke, a later Russell see,\nWith all the glorious galaxy\nOf Liberal Chiefs the ages down,\nTill Gladstone and our Blake we crown\nAs worthy of the mantles cast\nBy those great giants of the past.\n\nAye worthy—one the helm of England sways—\nEre long our Blake shall wear the victor's bays;\nWhen comes the conflict let our war-cry be,\n\"A Blake! a Laurier! Blake and victory!\"\nBlake, with the stainless name;\nBlake, on the roll of fame;\nHigh placed already with the glad acclaim,\nOf all who feel a patriot's pride,\nIn truth and honesty well tried,\nIn lofty powers, in breadth of view,\nIn honour, stainless as the morning dew,\nIn all that makes a statesman great, and wise and true.\n\nWith such a Chief, my brothers, shall we dream\nOf aught but victory, when the battle's gleam—\nThe peaceful conflict surges through the land;\nWhen Eighty-three shall summon us to stand\n\nLike veterans to our guns?—No, firm and strong;\n'Tis ours to court the battle's bloodless throng;\nStrong in our cause—our Chief—\nStrong in the firm belief\nThat vict'ry ours—the forces of the Boon\nShall suffer then a crushing Waterloo.\n\nAnd, as to-night, with warm and earnest zest,\nWe hail our Chief—we greet our honoured guest,\nLet East Northumberland the story tell\nHow Blake can fight a giant wrong, how well;\nFirst gun from Old Ontario, first note\nOf warning, ominous to those whose vote\nPlaced a huge vampire at the throat\nOf our North-West. We hail the sign\nAs presage fair, that all along the line\nOur leader's sturdy blows shall rout the foe,\nAnd lay the authors of that deep-dyed treason low.\n\nAnd as he plans the coming campaign, we—\nWe pledge ourselves to work for victory;\nThis talisman we take—\nOur battle-cry is \"Blake!\"\nBlake, with the stainless name;\nBlake, free from blot or blame;\nBlake, whom we all proclaim,\nWorthy the people's trust;\nBlake, whom the future must\nSee deep enshrined within the people's heart,\nWise, upright, just—great Gladstone's counterpart;\nBelieving this, then let our welcome be\nWorthy ourselves, whole-souled, outspoken, free,\nAnd one step more, embracing all the rest—\n\nA WELCOME WORTHY OUR THRICE-HONOURED GUEST.\nTHE LIBERAL CONVENTION.\n\nA LARGE ATTENDANCE.\n\nTHE LEADERS OF THE PARTY PRESENT.\n\nOn Tuesday afternoon, March 29th, a very largely attended meeting of representative men of the Liberal party of the district of Montreal and vicinity, was held in the Mechanics' Hall, for the purpose of completing arrangements in organizing for the coming general elections in the Province and Dominion. Among those present we noticed Messrs. Thomas Cramp, Adam Darling, A Perry, James Stewart (Herald), H A Nelson, M P P, Jas McShane, M P P, Ald Gilman, O J Devlin, Ed Holton, M P, Denis Barry, E R Johnson (Stanstead), Arthur Jenkins, Robt Mackay, N W Tremholme, Hon Henry Starnes, Thomas Darling, James O'Halloran, Q C, J Scriver, M P, J McLean, W E Boyd, N B Corse, Alex Seath, R Seath, T Lyman, A McGoun, E C Monk, Hon R Laflamme, C R Black, H Lovell, M P P, A Isaacson, D Lyons, S Quinn, Hon H Mercier, M Mercier, Ald Stephens, Hon J R Thibaudet, W S Walker, F G Boutilier, M P P, Peter Fulton, T Robin, Sidney Fisher, J J Maclaren, Q C, J H Joseph, C Cushing, T H Turton (Globe), Edgar Judge, E Idler, J Duhamel, Q C, J Howley, C S Burrows, J Shea, Eneas McMaster (Scotstown), Hon W Laurier, M P, R G Meikle, M P P, Hon L S Huntington, F X Archambault, J N Greenshields.\n\nLetters of regret were read from Hon. Senator C A P Pelletier, P B Casgrain, M P, L'Islet; F X A Biron, St Cuthbert; M Matheson, J H Marchesault and others.\n\nThe meeting was called to order about two o'clock, the Hon. J R. Thibandeau moving that Ald. Granier act as Chairman of the meeting. The motion was carried with loud applause.\n\nOn the platform, with the Chairman, were Messrs Lovell, McShane, Marchand, Langelier, Holton, Dr Laberge, J O'Halloran, Meikle, Laurier, Boutilier, O J Devlin, Perry, A Darling, T Cramp, H Muckay, H Mercier, J N Greenshields, F X Archambault, W S Walker, J Scriver, F X Langelier, Marchand, Poirier and others.\n\nThe Chairman expressed his pleasure at the honour done him, and after referring to the necessity of the Liberal party at once organizing for the approaching election, requested the Hon. Mr. Mercier to address the meeting.\n\nHon. Mr. Mercier, on rising, was greeted with loud applause. He began by stating that he was more than pleased at the intelligent complexion of the meeting and at the large numbers present. He, as well as others of the Liberal party in the district and vicinity, thought it a good time to begin organizing for the coming general elections in the Province and the Dominion, and, to that end, had sent invitations to the representative men of the party in the district and vicinity. The present meeting was in no sense a public one for the discussion of public questions, but one for the purpose of completing an electoral organization of the party, with the view of combating their adversaries at the coming Federal and Provincial elections, in which contest he trusted they would come out victorious. He pointed out that it was of vital importance to the cause that the Liberal party should have organizations complete in every parish and county through the Province, so that they might be able to guard and uphold the grand old principles of Reform, which had been handed down to them as a precious heritage by their forefathers. (Loud cheer.) He strongly advised them to at once appoint a strong-working Committee of capable and honest men, of all creeds and nationalities who had the confidence of the electors of the division, and to aid and assist them in bringing out strong, upright and loyal candidates who would advocate and vote Liberal principles when duty calls. (Cheers.) To aid and assist these Division Committees he would also recommend a Central Executive Committee, to be composed of the Senators and members of Parliament of the party, and of a well-selected number of leading gentlemen of the province, whose duty it would be to direct...\nthe campaign. In past years the party had suffered disasters for want of proper organization. He trusted, however, that all that over-confidence in the honesty of their adversaries was at an end, and that henceforth they would stand and fight together for the popular rights of the people. (Cheers.) The meeting to-day was a happy omen for the future of the party in this Province. It was a meeting of intelligent and honest men, whose sole aim was the good of their common country, and he was convinced would meet with the appreciation of the country. He was not at that time going to speak of a programme for the coming elections that would come in good time. They would profit by the occasion. It would not do to give the enemy a chance. The Conservatives had again and again accused the Liberal party of being a party of revolutionists, but he denied the charge, and would point their accusers to the long and noble record of Liberal triumphs, and always in favour of the people's rights. (Loud cheers.) The Liberal party were for maintaining the Constitution in all its grandeur, while at the same time jealously guarding the patrimony of the people.\n\nAt this moment the Hon. Edward Blake accompanied by Hon. L. S. Huntington arrived, and, as they came upon the platform, the whole assembly rose and cheered the great Liberal leader for some moments. The Hon. Mr. Blake bowed his acknowledgments of the warm welcome accorded him.\n\nHon. Mr. Mercier, continuing his remarks, said the Liberal party were for upholding just laws and good Government for all men, without distinction of creed or nationality. It was a purely Constitutional party, devising a general progressive policy for the administration of public affairs. The question of tariff was a Federal question, which they had not to decide just now, because the organisation was rather Provincial, but the day was coming when the Liberal party would have something to say on this great question. Tariffs should have a permanent character, and every party should endeavour to lessen the burdens of the people, but, at the same time, should not forget the vested interests of the manufacturers, and care should be exercised in the revision of the tariff in order not to ruin well-meaning manufacturers. For revenue purposes the tariff would have to be pretty high. Another question was that of public instruction. The fate of the Liberal party depended upon the education of the people. Ignorance was the basis of absolute government, while education was the right of progress. The people of Canada were a working peo-\nselves together for the purpose of bringing about those great results. If they were to be successful they required, not only hopeful hearts, not only good principles, not only fidelity to their principles, and a determination to do their duty, but also to form an organisation to bring to bear the strongest power they could upon the convictions of those whom they addressed, and in every way to enable the principles they professed to exercise their proper influence. They required to rally themselves round their principles, so as to make success secure in the future. Especially was this needed in this Province, for they had had good reason to say that it was not the garden of liberal ideas; they need not attack men whom they esteemed, but who did not subscribe to the same doctrines that they proposed, but knowing as they did the difficulties they had to encounter, they required not only earnestness and faith in the future, but the agency of an organisation such as that they were assembled to promote. In this Province they had seen some reaction of public opinion, and in Ontario they had seen also a bouleversement of opinion; they had seen that reaction in the other provinces; and it was only in this great Province of Quebec that the Government was so strong, and, therefore, it behooved them to exert every effort to promote their principles. (Applause.)\n\nHon. Mr. Thiriaudeau read the following resolutions for the organization of the party management for the ensuing year, which, on being put to the meeting, were unanimously adopted:\n\n\"That the direction of the Reform Association of the District of Montreal be entrusted to a Committee of Management composed of persons chosen at the yearly meeting called by the President and officers, Liberal Senators, Legislators, Councillors, Deputies and the Presidents of the Reform Clubs of this District.\n\n\"That this Committee of Management choose from among its members an Executive Committee composed of as many as it may deem fit, and from among whom to name its officers.\"\n\nMR. BLAKE AS LEADER.\n\nMr. Duhamel, Q.C., moved, and Mr. McShane, M.P.P., seconded the following resolution:\n\n\"That this Association is glad to welcome as its Leader of the Liberal Party the Hon. Edward Blake, whose talents and integrity give reason to hope for the ultimate triumph of the national cause.\"\n\nThe resolution was carried with loud cheering, which was redoubled when Mr. Blake rose to return his thanks for the honour done him.\n\nHon. Edward Blake said that it was with no ordinary feelings of gratitude with which he received the expressions of good-will, warmth and sympathy which had been conveyed to him in the resolution recognizing him as leader of the Liberal party. He would endeavour to come as near as possible to the flattering picture they had drawn of him. He would attempt to deserve what had been said of him. He had been very glad to learn what the character of the meeting was. It was necessary to organize the Liberal party. It should be understood that the Liberal party was not a sectional but a national party (loud and prolonged applause), but still they might, quite consistently with that character on an occasion of this kind, deal with these questions of local interest which affected the adherence of the local party, rather than the Liberal party as a whole. It was their pride and glory that their course had always been dictated by principles of right and wrong. They had not yet had an opportunity of learning what was the precise form of the resolutions with regard to the organization of the party, but to the general spirit and tone of them he gave his hearty assent and concurrence. The duty of the Liberal party was to secure for all full freedom and liberty; they regarded those as their sacred rights; they took that as their platform, insisting each for himself, and insisting equally for others, on the securing of their rights; on the principle of fair play from man to man. It had long been the boast of the Liberal party that it insisted in securing liberty of opinion, liberty of the person, and liberty of property. That it insisted on respecting to the utmost, difference of creed and in not making distinctions of nationality. While each might boast of his hereditary nationality they all felt as he felt, and he believed, the Liberal Party felt that they were to-day constrained by a more living link which tied them together, as citizens of our land, as Canadians. Those of his audience who spoke the French language generally spoke of themselves as \"Canadien,\" but he must be permitted to say that he could not allow them to monopolize the title and make it exclusively their own; they had conferred it upon all. \"Moi aussi, messieurs, je suis Canadien,\" said the speaker, amid a roar of laughter and applause long continued. They would all be brother Canadians from this time forward. They should feel the stronger tie between the living than between the living and the dead, working together as one people for the accomplishment of one\nglorious destiny. He endorsed the view of his friend, the Hon. Mr. Mercier, that it was necessary to respect the Provincial rights in the Federal system. He was not one of those who maintained these rights and this system because he believed that they tended to the obliteration of those bonds of unity to which he had referred, but because his earnest belief was that these rights and systems gave the people of this country a better chance of being united heart to heart. They gave in a country of the vast extent of ours a reasonable distribution of powers; to the local Governments the power to control their own local affairs, and gave to the whole country a power to control the affairs which were common to all, and gave them the best opportunity for carrying out the principal of the Liberal party, a practical and actual self-government; government by the people according to the wishes, the well-ascertained wishes of the people. It would be impossible to control these local affairs at our central legislature, the chances of there being necessary reforms introduced, the opportunity of carrying on the doctrines of progress, than they could hope to obtain by any other means. The speaker dwelt upon the responsibilities inseparable from the privileges of this form of Government. He thought, perhaps, the Province of Quebec would yet see its way to follow the example of the Province of Ontario. With regard to the second Chamber, he had never been able to reconcile the existence of this Upper House with the principle of self-government. The existence of a Senate nominated by the advisers of the Government for the time being, holding their seats for life and responsible to no one, is contrary to the principles of representative Government. No doubt there were able men among them, men who they will be glad to see serving their country more efficiently in the position to which they were called by the public suffrage. Passing to the consideration of Federal matters, the honourable gentleman said we find ourselves in a most dangerous position. Previous to 1873 the present Government had acted upon the idea that the country was in a permanent and normal condition of large importations, and permanent burdens of the country were increased to an alarming extent. The Liberal party came into power just as the tide of depression set in, and were charged by their opponents with being responsible for the state of affairs. Now the tide has turned, and the same policy of reckless expenditure is being again adopted. Contrasting the policy of the Government and the Opposition in regard to the Canadian Pacific Railway, the speaker said that it was impossible to compare them without a decision in favour of that of the Opposition. Referring to the offer of the second Syndicate to build the road, he said they were told they were too late. \"But they never had a chance before.\" \"No matter; it is too late.\" \"But is it too late to save three millions of money and three millions of acres of land; too late to save the country from the hands of a monopoly?\" \"Too late!\" But when the country comes to pass upon the question the verdict will be that the offer was in time (cheers), and I ask when you render that verdict, to punish, if you think well, those unjust stewards who have taken the onerous bargain and have left the good one. (Cheers.) The hon. gentleman concluded with wishing the organization every success, and resumed his seat amidst loud cheering.\n\nThe following resolutions were unanimously adopted:\n\nMoved by Hon. Mr. Mercier that the Canadian Liberal party is exclusively political, having for its chief object the defence of the constitutional liberties which are the only safeguard of all religious and national interests in a country like ours, peopled by various races, professing different religious creeds;\n\nThat, therefore, the Liberal party not only respects our religious and civil institutions and protects their acquired rights, but still defends them against whatever may tend to destroy or obstruct their beneficial action on society.\n\nMoved by the Hon F G Marchand, M P P, Hon H Mercier, M P P, James McShane, M P P, Hon E G Penny, Ed Lareau, Ernest Tremblay, F X Archambault, Jas Stewart, J E Robidoux, H C St Pierre, G J Barthe, C F Papineau, Dr P O'Leary, Dr J L P Desrosiers, Dr E P Lachapelle, F L Beique, G A Geoffrion, J B Brousseau, Odilcn Desmarais, V Gladu, Dr Mercif, L P Dufresne, J B R Dufresne, A Larimee,\n\nSeconded by J Hodgson, Robert Mackay, R E Fontaine, F O Kinfret, M E Bernier, L F Morrison, Dr A Raymond, L C Lebeuf, A E Poiret, Arch McGoun, Jr, N W Trenholme, J J Maclaren, D Barry, J S McCorkill, A Magnan, O J Devlin, J B Resther, J B Galipeau, Antoine Favreau;\n\nWhereas, every representative system presupposes an enlightened electoral body able to judge the questions submitted to it;\n\nWhereas, there is but one method of placing a free people in a position to govern itself well, viz, education and the want of education among a people, jeopardizes even the representative system of government;\n\nWhereas, in shedding light abroad amongst our people by a huge system of\nprimary and industrial instruction, the Government of this Province will consolidate our political institutions and render them more effectual;\n\nResolved, That primary instruction in this Province is not sufficiently endowed; that the grants in favour of our common schools should be increased, and that special arts' and trades schools' should be created and endowed by the Province in order to spread theoretical and practical knowledge amongst our working-classes, so as to enable them to act the important part belonging to them in our society.\n\nMoved by F G Boutilier, M P P, Hon H Mercier, M P P, Hon L S Huntingdon, M P, Hon E G Penny, Hon G R Thibaudeau, Hon A H Paquet, Hon R Lafamme, Wilfrid Prevost, Hugh Mackay, James Stewart, Jonathan Hodgson, C A Geoffrion, C W Scallan, R Gohier, F Lalonde, C F Beauchemin, Auguste Guibault, Antoine Gauthier, Pierre Beliveau, Dr A Beaupre, C E Beausoleil, H Neven, F X Mathieu, Dr Forest, A Decarie,\n\nSeconded by E Laberge, M P P, Hon F G Marchand, R Metkile, M P P, G J Barthe, L H Lafleur, Leon Desserre, A Catudal, Dr Marcil, A Rochon, T B Foran, Dr Christie, P G Martineau, Achille Dorion, P R Goyette, F O Dugas, L P Brodeur, Ed P Frechette, P A Fautenx, J A Lapierre, F X\n\nPrenoveau, D Seath, Cyrillo Lajoie, J O Turgeon, John Balston,\n\nThat the Federal Constitution guarantees the complete autonomy of each Province, and every tendency of the Federal Government to lessen this self-government, the only safeguard of our religious and national interests, should be condemned and resisted with firmness and energy.\n\nMoved by E Laberge, M P P, seconded by Mr T B Godin,\n\nThat the most rigid economy in all branches of administration in this Province has become an absolute necessity, seeing the impaired condition of our finances and the rapid increase of our indebtedness;\n\nThat all disbursements which are not strictly indispensable should cease, and that an effectual reform should be made in the Civil Service;\n\nThat the Q, M, O & O Railway should be run with prudence and economy, in the interest of the public and not of individuals;\n\nThat this meeting regrets to see that the Government of this Province is fast raising the annual expenditure to the sum expended under the previous Conservative Administrations, which the Joly Government had succeeded in reducing so considerably, and which they were about to reduce still more.\nThe Constitution guarantees the independence of each Province, and the right of the Federal Government to interfere in self-government; the rights of religious and national minorities have been undermined and resisted.\n\nMr. MPP, seconded\n\nThere must be economy in all Departments of the government in this Province at this juncture of necessity, seeing that we are faced with our finances and the question of our indebtedness;\n\nProjects which are not essential should cease, and economies should be made in every Department.\n\nThe Quebec Railway should be closed down for economy, in the interest of the Province, not of individuals; it is a matter of regret to see that the Quebec and Labrador Province is fast raising its taxes, in addition to the sum expended by the previous Conservative Government, while under the Joly Government there has been reducing so considerable an amount of money were about to re-\nYOUNG MEN'S REFORM CLUB\nOF MONTREAL.\n\nPresident,\nJOHN J. MACLAREN, Q.C.\n\n1st Vice-President.\nROBERT MACKAY.\n\n2nd Vice-President.\nDENIS BARRY.\n\n3rd Vice-President.\nALEX. MOFFATT.\n\nTreasurer.\nDAVID SEATH.\n\nCommittee.\n\nEDWARD HOLTON, M.P.\nROBERT REID.\nJAMES DARLING.\nJ. N. GREENSHIELDS.\nTHOMAS E. HODGSON.\nJAMES G. T. CLEGHORN.\nCHAS. H. PARMALIE.\nA. SELKIRK CROSS.\nE. W. P. GUERIN.\nHORACE JOSEPH.\n\nM. HUTCHINSON.\nALEX. MUNRO, M.D.\nHUGH DOLAN.\nJOHN H. ROGERS.\nC. E. A. PATTERSON.\nJAMES McSHANE, M.P.P.\nH. MACKAY, Jr.\nJ. G. B. DILLON.\nW. F. RITCHIE.\nFRED. MASSEY.\nD. R. ROSS.\n\nARCH. MCGOUN, JR.,\nSecretary.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_08869.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 37, "total-input-tokens": 61098, "total-output-tokens": 28984, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1541, 3], [1541, 4018, 4], [4018, 4018, 5], [4018, 4150, 6], [4150, 4150, 7], [4150, 7012, 8], [7012, 12063, 9], [12063, 14049, 10], [14049, 17243, 11], [17243, 19747, 12], [19747, 23981, 13], [23981, 28364, 14], [28364, 33598, 15], [33598, 38851, 16], [38851, 44091, 17], [44091, 49541, 18], [49541, 54849, 19], [54849, 60285, 20], [60285, 65575, 21], [65575, 70800, 22], [70800, 76090, 23], [76090, 83493, 24], [83493, 88775, 25], [88775, 93977, 26], [93977, 99032, 27], [99032, 101631, 28], [101631, 105520, 29], [105520, 108099, 30], [108099, 113139, 31], [113139, 118283, 32], [118283, 120672, 33], [120672, 121584, 34], [121584, 122186, 35], [122186, 122186, 36], [122186, 122186, 37]], "primary_language": ["None", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]