[{"id": "4f294c69420809380a2114f97f8e8a412762c1ec", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\nPages de couleur\n\n☐ Pages damaged/\nPages endommagées\n\n☐ Pages restored and/or laminated/\nPages restaurées et/ou pelliculées\n\n☑ Pages discoloured, stained or foxed/\nPages décolorées, tachetées ou piquées\n\n☐ Pages detached/\nPages détachées\n\n☑ Showthrough/\nTransparence\n\n☐ Quality of print varies/\nQualité inégale de l’impression\n\n☐ Includes supplementary material/\nComprend du matériel supplémentaire\n\n☐ Only edition available/\nSeule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d’errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThe following items have been microfilmed at the request of the depositor:\nThe following items have been microfilmed at the request of the depositor:\n\nOriginals of this publication may be obtained from the Depository Library of Congress, Washington, D.C. 20540, or other Depository Libraries listed in the first page of this publication.\n\nThe copyright law of the United States (Title 17, United States Code) shall be construed so as not to interfere with fair use in accordance with Title 17, United States Code, Section 107. For purposes hereof, \"fair use\" includes reproduction by means of reproduction, in copies or phonorecords, for purposes such as criticism, comment, news reporting, teaching, scholarship, or research, reproduction is limited to reasonably necessary uses, such as reproduction by libraries and archives.\n\nMaps, charts, and other graphic materials may be reproduced in different sizes without permission of the copyright owner. Reproduction of text materials requires written permission and payment of specified fees. Reproduction fees are available upon request from the Copyright Office, Library of Congress, Washington, D.C. 20540.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n---\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"A SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmées à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nMEMORANDUM\n\nON\n\nCHOLERA,\n\nADOPTED AT A\n\nMedical Conference held in the Bureau\nof Agriculture, in March, 1866.\n\nPRINTED BY AUTHORITY.\n\nPRINTED FOR THE BUREAU OF AGRICULTURE AND STATISTICS.\n\n1873.\nMEMORANDUM\n\nON\n\nCHOLERA,\n\nADOPTED AT A\n\nMedical Conference held in the Bureau\nof Agriculture, in March, 1866.\n\nPRINTED BY AUTHORITY.\n\nPRINTED FOR THE BUREAU OF AGRICULTURE AND STATISTICS.\n\n1878.\nMEMORANDUM ON CHOLERA,\n\nAdopted by a Medical Conference convened at Ottawa, the Seat of the Government of Canada, by the Honorable the Minister of Agriculture, pursuant to an Order of His Excellency the Governor General in Council.\n\nMARCH, 1866.\n\nMEMBERS OF THE CONFERENCE.\n\nDr. MacDonnell, Chairman.\nDr. Van Cortland.\nDr. Hill.\nDr. Landry.\nDr. Dickson.\nDr. Aikins.\nDr. Beaubien.\nDr. Grant,\nDr. Taché, Reporter.\n\nPRELIMINARY REMARKS.\n\nSince the recent outbreak of Asiatic Cholera in the Levantine regions, and its spread into countries more directly connected with the localities of its origin, all the vexed and complicated questions arising out of the consideration of this terrible scourge have been re-agitated throughout the world.\n\nIt is not the intention, in this memorandum, to examine any of the many hypothetical opinions and systems arising from such a fertile subject of discussion; but to collect in a somewhat condensed compass, for the guidance of individuals, associations, corporations and civil authorities, such practical information as is undisputed amongst unbiased and well-informed minds, about the character of the disease and its ordinary way of propagation, about the duties of every one towards himself and his fellow-creatures in time of pestilence, about the best means of preventing or delaying its appearance and\nmitigating its effects. These were the objects of the calling together of this Conference by the Government, and are consequently the subjects dwelt upon in this document.\n\nIn answer to the questions naturally arising in everyone's mind, as to whether it is probable that this continent will be visited by cholera this year, and whether the disease is likely to be more or less disastrous than formerly, many very contradictory though very decided opinions have already been given through the public press and medical periodicals. However, as there is some danger in the promulgation of opinions which cannot be founded on any tangible or well-defined reasons, it seems better to candidly acknowledge that such eventualities are not within the reach of human science to unravel, but that they must be accepted as they are to happen with a submissive and courageous spirit; and it is wise to be prepared for the worst.\n\nAnother question, upon which volumes of contradictory arguments have been written, scores of laws enacted, amended, repealed and re-enacted, whether strict quarantine can secure immunity to a country against the importation or spread of pestilential disease, appears to have been answered by experience in this sense: that, although the strictest quarantines (as a general fact) have certainly failed in securing, *in toto*, the advantages promised by the extreme partisans of such measures, these measures, nevertheless, have always proved themselves to be highly beneficial in delaying the time of the invasion of the malady, in mitigating its effects and preventing that extension which is known to take place where no such precautions are observed.\n\nNo one denies that every reasonable separation of infected persons or things from the healthy and clean, generally speaking, is beneficial; and every one admits that hygienic measures are extremely advantageous at all times. It is, therefore, with such views and with the determination of carefully avoiding the counsels of carelessness, on the one side, and pusillanimity, on the other, that the investigations connected with the adoption of this memorandum have been prosecuted.\n\nIt is earnestly hoped that the following short chapters and paragraphs (though containing nothing assumed to be new for persons acquainted with moral, medical and social sciences) will not be without good results, intended specially as they are:\n\n1st. To confirm the public mind against useless and dangerous fears, by showing that the first duty, as well as the better understood interest of every one, is to meet manfully, with a truly devout spirit, the threatening scourge;\n\n2nd. To diffuse amongst the people a sufficient knowledge of what ought to be done to alleviate the calamity and to guard against errors which are so apt to pervade a community in times of such visitations.\n\nShould everything be followed out that is recommended in this Memorandum and be executed, and should the threatened pestilence not invade Canada, it could never become the subject of the slightest regret, as being so much time and expense uselessly thrown away; because all the measures are calculated, in every respect, to improve generally the moral, the domestic, and the social habits of our population.\nCHAPTER I.\n\nPESTILENTIAL DISEASES.\n\nTo make use of the happy expression of M. Tardieu, \"It is well to bear in mind that pestilential diseases are not of that class of which it has been given to man to penetrate the origin and to understand the principle.\"\n\nFrom time immemorial the world has been periodically subjected to the ravages of epidemic or pestilential diseases, varying in their intensity and peregrinations, mysterious in their origin, and from whose occasional recurrences mankind, in all probability, will never be free.\n\n§ 1.\n\nEXTERNAL CHARACTERS OF CHOLERA.\n\nAny discourse of a purely scientific nature would be out of place in such a document as this; but it is of all importance to insert in this Memorandum such information as would render the disease, in its ascertained character and effects, generally understood by members of the community at large: because no one knows to what extent even a small amount of knowledge may become useful in removing painful and dangerous fears or equally perilous feelings of blind security, also in avoiding fatal errors, and thus making in many instances and many ways its possessors serviceable to himself, relatives and fellow-creatures generally.\n\nCholera is apt to appear in every climate (very few countries, indeed, having escaped its visitation); it attacks both sexes, every age, and all conditions of life, the poorest and the wealthiest, the weak and the strong.\n\nGenerally, but not always, it appears more fatal where misery, filth and crowding are to be met with, and intemperance and other vices are sure to render its blows more disastrous.\n\nThe approach of Cholera is often preceded by contagious, endemic or epidemic diseases and a more than usual prevalence of affections of the stomach and bowels, and oftentimes also by diseases of a disastrous nature (epizooties), attacking domestic animals.\n\nOccasionally the appearance of Cholera seems to have a marked effect either in increasing or diminishing the intensity of other concomitant diseases, at other times it appears to fail to exercise the slightest effect on them. The experience of Canadian medical practitioners has gone, however, so far to establish that Cholera has generally superseded in a great measure all other diseases.\n\nThere are only two circumstances connected with this scourge which seem to observe a determined character of constancy, these are the ratio of mortality to the number of persons attacked, and the influence of continual cold on the duration of the pestilence.\n\nThe ratio of mortality almost at all times and in all countries is never\nbelow one-third, and sometimes averages from forty to fifty deaths for every one hundred cases of confirmed Cholera. The appearance of the cold season invariably checks the intensity of the malady in moderate climates, and generally stops it entirely in severe climates. Whether these well asserted facts are of the negative, the dubial or the positive category, it is well that they should be made known to the public, to prepare the minds of all to see things as they are, in time of trial, and to guard against too illusory and hopeful expectations as well as against foolish fears; for a great many have fallen, and a great many are apt to fall easy victims of Cholera through imprudence and carelessness caused by an optimist view of the state of the matter, as well as through terror and despondency brought on by an exaggerated idea of the existing danger.\n\nIt is well that a general elementary knowledge of the real symptoms of Cholera should be possessed by every member of the community. Generally speaking, then, an attack of Cholera is preceded by a kind of malady called Cholerine, which may end, however, without a full development of the disease, but which seems to act ordinarily as its precursor.\n\nThe symptoms of Cholerine, also called premonitory symptoms, are the following, not always, however, to be met with in the same order, nor all at one time, nor the same in every person affected:—Noisy motions in the bowels, pains in the belly, loose evacuations, generally bilious, sense of general uneasiness and weakness, loss of appetite, whiteness of the tongue, sometimes there is headache and very frequently inclination to vomit.\n\nIn connection with these symptoms it should be remembered that, in time of Cholera, there is a great disposition to looseness of the bowels, which, if not attended to carefully, is apt to terminate in Cholerine, as well as Cholerine in confirmed Cholera.\n\nWhen the premonitory symptoms are followed by a real attack of Cholera, and when Cholera comes on without it, the progress of the disease is characterized by successive stages, which are respectively designated by some authors by the names of—1st, period of invasion; 2nd, period of state or collapse; 3rd, period of reaction; 4th, period of termination; or simply first, second, third and fourth stages.\n\nThe period of invasion is characterized by several or all the following symptoms: diarrhoea, vomiting, pains in the regions of the stomach, cramps, general diminution of animal heat, coolness of extremities, increasing constricting sensation in the regions of the stomach, anxious expression of countenance, with alteration of the voice very peculiar to the malady, pulse quick and growing weaker and weaker, eyes depressed and sunk in their orbits, livid and contracted appearance of the face, irresistible thirst and desire for cold water and suppression of urine.\n\nThe period of state (or collapse) is characterized by an increase in the severity of the former symptoms, the skin in general becomes livid and blueish in color and bedewed with cold perspiration, the skin of the fingers assumes the same appearance as those of a drowned person, the pains and cramps increase to agony, the evacuations become of a whitish fluid, like thin gruel or rice water, they are often passed without the knowledge of the patient, whole body is much quicker state\n\nsymptoms with more moderate nature injected congestion\n\nthe secret symptom absence of A\n\ntaken\n\ndetected have and such\n\nepithelial membrane desiccated\n\nother methods to the skin some who were\npatient, the skin emits a fetid smell, a squalid appearance pervades the whole surface of the body, the breath is colder and colder, the respiration is much labored, a profound prostration of every vital action follows, and death quickly closes the scene; but the intellect remains almost as perfect as in state of health nearly to the last.\n\nThe period of reaction, when it fortunately occurs, shows the following symptoms: the pulse rises gradually, the blue coloration of the skin disappears with the returning warmth of surface, the respiratory movements become more regular, the voice is by degrees restored to its normal tone, a warm moderate perspiration shows itself on the skin, the countenance is more natural and the face becomes more or less turgid, and the eyes somewhat injected. Sometimes the reaction is too violent, and then there is danger of congestion of internal organs, especially of the brain.\n\nThe period of termination is characterized by a gradual return towards the normal state and by the re-establishment of the urinary and bilious secretions, coupled with the disappearance of the flushed and violent symptoms of reaction. But here again, there is danger of this short convalescence merging into a secondary affection somewhat resembling typhoid fever.\n\nAll these symptoms may vary a little in form, they vary a great deal in intensity, and somewhat also in order of succession: they may be all present and well marked in many cases, whilst in others some few symptoms may be absent, or nearly so; but taken several at one time, they are characteristic of Asiatic Cholera.\n\nDeath may happen at any one of these four periods, but most generally takes place in the second stage.\n\nThe fatal termination of the disease, as well as recovery from it, may be determined in a few hours, and may be delayed for a few days. Deaths have been recorded to have happened after four hours of confirmed Cholera, and cases of seventy hours of sickness have also been reported; however, such short and long duration are both extremely rare exceptions.\n\n§ 2.\n\nPROPAGATION OF THE DISEASE.\n\nThis is not the place to discuss whether Cholera is a contagious, epidemic or infectious disease; from all we know about this mysterious malady, it may possibly partake of the three characters intended to be defined by these words.\n\nIt is certain that, first noticed in India, the scourge is exotic for all other countries than south-eastern Asia, from which continent it takes its much-dreaded name, known throughout the world as Asiatic Cholera. From the place of its birth, the scourge, at unfixed and varied periods, starts on its tour around the globe, following the grand routes of travel and commerce, sometimes accompanying an army on its march, sometimes following in the wake of pilgrims going to the rendezvous of their devotions, or a caravan of merchants: ascending or descending large rivers and crossing the wide ocean.\nstopping at all the centres of population and spreading terror and death along its passage.\n\nWhen Cholera began its migrations, it went first from India to Persia, then easterly to the end of the continent of Asia, and to the islands of the Indian Archipelago, and westerly to Russia, Poland, and Germany, and from central Europe to its northern portions and the British Isles. It then moved south-easterly, ravaging France, Spain, Italy and the neighbouring countries, and traversing the Mediterranean it went to North Africa; at the same time having crossed the Atlantic Ocean, it found its way to America, and thence returned to Asia through Egypt.\n\nThe above-described peregrination of Cholera was the first one undertaken by this terrible traveller. He walked sometimes slowly, at other times advanced by steady or rapid strides, resting occasionally, however, until he had accomplished his voyage, which began in the Delta of the Ganges, in the year 1817, and terminated in the vicinity of the Red Sea in 1834.\n\nSince its first appearance as a cosmopolitan travelling scourge, Cholera, varying in some instances the course of its progress, has no less than five times visited the European and American continents, in spite of all measures adopted by different countries to exclude its presence, and at all times preserving its incognito about everything appertaining to its nature and personality.\n\nMany discussions are still maintained as to the manner in which Cholera is carried in its voyages through land and over water. There being no doubt that it is portable, it is wiser to act under the admission that it is carried by persons, effects, and merchandise, and even by the winds of the air and currents and streams.\n\nAt the present time, Cholera is on its sixth general tour. It appears to have left Asia for the West with the Mahometan pilgrims of Mecca last year; then, after ravaging Egypt, it visited Turkey, Italy, and much of the Mediterranean coasts; it has since entered France by Toulon and Marseilles, has gone as far north as Paris, and crossed the Atlantic Ocean to extend its calamities to some of the islands of the Caribbean Sea. The probability of its coming as usual to Canada has called for new preparations on the part of our Government and our municipal authorities. The only countries which have enjoyed a kind of immunity from the visitation of Cholera are the extreme regions of the North and South, the remote interiors of continents, and the elevated regions of mountainous countries. The lines of its predilections are the navigable rivers; and many authors are of opinion that, generally speaking, the sea and lake sides and the vicinity of water courses, are localities of choice for Cholera.\n\nNotwithstanding some exceptional facts to the contrary, the disease makes more ravages wherever intemperance and other vices are to be met with, and wherever want, misery, crowding and filth are dominant. Cholera is apt to return to localities shortly after its disappearance thence, although ordinarily it travels on regularly; and although it commonly goes steadily from place to place in the line of its general course, it does, however, occasionally make a jump over distances of several hundred miles.\n\nThe direction of the winds seems to have very little influence, if any, on\nthe propagation of Cholera, nor is it at all proved that the geological formation of a country nor its meteorological phenomena have any marked influence on its prevalence or intensity.\n\n§ 3.\n\nFORMER VISITATIONS OF ASIATIC CHOLERA IN CANADA.\n\nThe first epidemic of Cholera visited Canada in 1832.\n\nIts existence and its ravaging influences in many parts of Europe had at last excited fears to be entertained about the probability of its coming to our own shores; and in October, 1831, a communication from the Imperial authorities was made public by the Executive of Lower Canada. Whereupon a meeting of the medical profession took place at Quebec, immediately after which, Dr. Tessier, of Quebec, was despatched to New York, to study the sanitary measures adopted in that large community against the threatened scourge.\n\nThe first commission of a sanitary nature against the introduction and spread of Cholera, was established at Quebec in February, 1832, and was composed of Drs. Morrin, Parent, and Perrault. Subsequently, a rather numerous Board of Health was organized, and regulations passed for the inspection and sequestration of ships coming from infected ports. The Cholera—having previously appeared in New York, Boston, and other places in the United States, notwithstanding that it has been reported to the contrary by some writers—made its first appearance in Canada at Quebec, where it was introduced by the shipping on the 8th of June, and spread at once its destructive influence in the neighbouring parishes.\n\nIt was in Montreal on the 10th of June. Thence it extended its ravages to mostly all the localities of Upper and Lower Canada, and disappeared entirely at the end of the month of October, having lasted in all about four months.\n\nThe second Cholera followed the first within a very short time, and took place in 1834. At its first appearance, in the latter part of May, in the Quarantine Station at Grosse Isle, it affected so mild a character, that it was not considered to be confirmed Asiatic Cholera, and it preserved its mild form for a short period. It assumed, however, a more violent character through Canada at the end of July and during the month of August, but finally disappeared with the month of September, the Sanitary Commissioners having had a High Mass of thanksgiving chanted in the cathedral of Quebec on the 2nd of October. The above fact is most important, as furnishing conclusive evidence of the cessation of the malady at a fixed date. This second sojourn of the pestilence in Canada having also lasted about four months.\n\nThe third Cholera—which is for us the Cholera of 1849, while for some countries it is the scourge of 1847 and for others of 1848—seems to have entered Canada by Kingston, where it made its appearance at the end of May, 1849. The pestilence had, previously to that date, appeared in several parts of the United States, and was at that time rapidly ascending the Mississippi and the Missouri Rivers.\nSome slight cases occurred in Quebec on the 11th of July, and a few more on the 12th; then it spread through almost the whole of Canada, its ravages being in some places greater, but in many places less, and also generally less destructive than in 1832. It seems to have disappeared entirely about the middle of October, after a few days of recurrence in Montreal, having lasted in all this time, about four months and a half.\n\nThe fourth epidemic of Cholera in Canada took place in 1851. It was introduced through the States, and Quebec was the last of our cities to receive it. The appearance of the plague took place under a rather mild form in August, and the last cases were observed no later than the first days of October. It lasted only about two months, taking Canada as a whole, and only five weeks at Quebec, from the 25th of August to the 2nd of October, having caused 206 deaths in that city.\n\nOn one of the last days it existed in Quebec, a ship, the Perthshire, sailed for England; almost immediately after her departure from Quebec the pilot was seized with cholera and died. The captain and one sailor having also been attacked, the mate anchored the ship at l'Isle Verte; but in a few days both patients got well and the vessel started again without any further case, and completed her voyage.\n\nThe fifth epidemic took place in 1854. It first entered Canada at Quebec on the 20th of June, and for this attack we have the whole history of the importation of the malady, in a Report of Drs. Landry and Jackson and Mr. Gauthier, Commissioners appointed to investigate the facts connected with the introduction of Cholera in 1854 into Canada.\n\nTwo emigrant ships, both from Liverpool—the Glenmanna and the John Howell—having each a medical attendant, arrived at Grosse Isle before the middle of June. The Glenmanna had cholera on board and had lost a number of passengers at sea; the John Howell had no cholera, but had lost five passengers at sea from measles. They both disembarked their sick at the Quarantine, and two or three days after proceeded to Quebec with the rest of their passengers. The two ships were inspected on the same day, the 17th of June, in the port of Quebec, and found free from all sickness; two infants, however, having died of debility on board the John Howell between the Quarantine and Quebec. The two ships apparently remained exempt from all sickness for two days, and were admitted to pratique on the 19th. The immigrants went ashore, some of them returning to the ships for meals and to sleep, when, on the 20th, the cholera broke out almost simultaneously in both ships, whence several cases were immediately sent to the Marine Hospital. Then it appeared on board some other ships, and subsequently spread.\n\nFrom Quebec, and apparently following the course of the immigrants in their journey west, the cholera seems to have appeared in the under-mentioned cities at these respective dates:\n\nAt Montreal, on the 22nd of June, among immigrants first.\n\nAt Kingston, on the 25th, on the person of a resident, having had no other communication with the immigrants than looking at them on the wharf, but being a man of intemperate habits and in miserable circumstances.\n\nAt Toronto, on the 25th, on two residents, who were not known to have had communication with the immigrants.\nIn Hamilton, on the 23rd and 24th June, on immigrants.\n\nThe cholera of 1854 ended in the latter part of the month of September, having lasted about three months. The Central Board of Health closed its labors on the 22nd of September by formal resolution.\n\nThe Report from which these informations are gathered speaks of the immunity from cholera enjoyed by the town of Brockville, on the St. Lawrence, although situated on the same grand route as the ravaged cities, towns and villages bordering the river side, and although immigrants had been allowed to go ashore in passing by.\n\nA fact of some importance is also recorded in the same Report, which it is well to insert:\n\nThe cholera appeared in the Provincial Penitentiary at Kingston on the 21st of July—that is, nearly a month after it had commenced its ravages among the inhabitants of the surrounding neighborhood.\n\nThe number of deaths from cholera throughout the whole of Canada during this last epidemic, as recorded in the minute book of the Central Board of Health of 1854, is put down at 3,483; a figure which, from the enormous difficulties to be met with in collecting correct statistical informations, must of necessity fall a good deal short of the reality.\n\nThe difficulties—insurmountable when the small localities have to be accounted for—have rendered impossible any attempt at gathering in this Memorandum figurative statistics of the former cholera epidemics, besides the figures above given.\n\nThese figures may convey a deductive idea of the losses inflicted by cholera on our country, when it is known that the number recorded is necessarily below the mark, and that the epidemic of 1854 was about one of the mildest of the five.\n\nCHAPTER II.\n\nPUBLIC AND PRIVATE DUTIES AS CONNECTED WITH CHOLERA.\n\nThe impending danger of a public calamity, and still more, its appearance in the midst of a community, in adding to the ordinary wants, adds necessarily to the duties of all.\n\nThe State, the municipal corporations, the different associations, some professional corps and private individuals, have each special duties, more or less onerous, more or less dangerous oftentimes to perform.\n\nCholera being, as it is, one of the most awful of all scourges, cannot appear, not even be simply threatening, without a general call for the performance of such duties, in the accomplishment of which it is within the province of every one to render eminent services to his fellow-citizens. Besides, it needs the concurrence of every one; for, in vain the State would try to do its part, if the municipal and other public bodies were refusing their concurrence, or,\nwhich amounts to the same thing, were derelictant in doing their share of the work; in vain would the municipalities and public bodies, in harmony with the State, attempt to accomplish their part, if institutions, families and private individuals were careless of their own.\n\nThere is a community of interest to be subserved in averting the common danger; there must also be a community of action in preparation and defence for such an object.\n\nOn the Government devolves the duty of the general organization, of the gathering of the forces, of the promulgation of general information, of the external surveillance. It is its duty to keep the grand watch, and to defend the approaches, if they can be defended. The law embodied in chapter 38 of the Consolidated Statutes of Canada and the laws relating to Quarantine have defined what part the State is to take in such measures, besides what appertains to the nature of State administration.\n\nTo bring to bear on the subject wise views and judicious counsels for all, to remind the minor bodies and the public at large of what is required from them by the law of the land, are also a part of the duties of the State; it is also its duty to institute a Central Board of Health, with whom all other Boards, and even individuals, can correspond, in order to impart to the composing portion of the whole body unity of purpose and uniformity of action.\n\nSuch observations are made not to teach the State, but rather to warn people against the too common error of expecting more from the Government than the Government can possibly perform, and thus individuals or corporations might neglect what is most needed in such circumstances.\n\nMore special duties devolve upon municipal bodies; but they are restricted within narrower limits as to space. Each corporation is to see that every possible thing for the salubrity of their locality is done, that the poor are furnished with the necessaries of life, and, in case of sickness, with the necessaries called for by their painful situation: they have to invite to their assistance the counsels of men who, by their position and their avocations, can advise them in devising local measures and calling for general action from the higher authorities, if wanted.\n\nPublic institutions, families and individuals have to show themselves willing and obedient in accomplishing what is required from them, in avoiding what is forbidden and in extending to others such help as is within their reach to dispense.\n\nIt is a constant duty for every citizen of a community to guard against everything which could be offensive or detrimental to his neighbors or to society in general; but that duty becomes a great deal more stringent in case of calamity, when the difficulties and the burdens of human life have become much heavier.\n\nThere is in such time more responsibility in every act of private and civil life, when the neglect of wanted precautions, when the indulging in something dangerous, when the diffusion of a simple foolish joke or an ill-timed rumor can bring into the bosom of your own family or to the fireside of your neighbour sorrow, terror and even death.\nA time of pestilence, when the hand of the Almighty is laid upon us, ought to be a time of more than ordinary composure, sobriety of mind and body, of simplicity and dignity of manners, of watchfulness over ourselves and of charity to fellow creatures.\n\nThe remainder of this memorandum is devoted to outline the general principles by which the conduct of public bodies and private individuals should be directed during an epidemic. Intended for all and being of necessity restricted to generalities, this paper is not supposed to impart a profound knowledge of things which are not, and which cannot be, otherwise than the exclusive privilege of men devoted to the special study of medicine.\n\nMoreover, it would be dangerous to say more than what can be sufficiently well understood by the people at large, because otherwise a misinterpretation of an unavoidably half acquired notion might lead to very fatal mistakes.\n\nIf fully impressed of its tenor and honesty actuated by a high sense of duty, they will always know when (either in a public or in a private capacity) they can take upon themselves to act, and when they should call to their aid the counsels or administration of men whose specific mission is to acquire for all, what all cannot, by any possibility, be made to acquire for themselves.\n\nCHAPTER III.\n\nMEASURES AGAINST CHOLERA.\n\nIt is useless and also highly detrimental (this cannot be too often repeated) to flatter ourselves with the idea that, if such a particular thing were done in such a particular manner, complete immunity from this disease would be attained; it is equally dangerous to despond under the depressing belief that nothing can be done to mitigate the evil.\n\nCholera has visited almost the world entire (continents and islands) at least five times, in spite of all measures adopted by the most enlightened and civilized countries to prohibit its introduction. It must be accepted, then, as a truth, that Cholera must and will prevail whenever the higher counsels of the Almighty decree that it shall be so.\n\nBut God has given to man a certain power over things natural, in accordance with the general laws established by Him; and the legitimate use of such power, if not always attended with complete success, never fails, however, to be followed by some good results.\n\nIt has been even so with Cholera. A happy disposition of soul and mind, good salubrious conditions of life, caution and hopeful faith, moderate and temperate habits, have saved, and will always save, thousands from the effects of this and other scourges. Notwithstanding that the same views have already been enunciated, it is thought important to bring them again and again before the notice of the public, even at the risk of being considered tedious.\nThe measures to be adopted against Cholera, and in fact against any contagious epidemic or endemic disease, may be classed under the following headings:—1st, Sequestration or Separation; 2nd, Hygienic precautions; 3rd, Diffusion of sound ideas and judicious advice, and inculcation of obedience thereto; 4th, Prophylactic timely interference; 5th, Intelligent curative treatment.\n\nThe measures of the first class are evidently appertaining to the functions of the Government and municipal bodies, as defined by law; the measures of the second, third, and fourth classes necessitate the co-operation of the community generally, and of all its members individually; the measures of the fifth and last relate to duties which devolve on members of the medical profession, and, under their guidance, on health officers, Sisters of Charity, and other attendants on the sick, and on them alone.\n\nIf every one could pause to reflect on the importance of the performance of his own duties, do them well and not embarrass others in the accomplishments of theirs, and if all were to work in harmony, good will, devotion, and forbearance, without assuming other than their own task, at the same time fulfilling it unflinchingly, it would be no great stretch of prophecy to predict grand results for present and future good.\n\n§ 1.\n\nSEQUESTRATION.\n\nThe means of sequestration or separation, as a preventive measure, are of two kinds: firstly, those employed against the introduction of pestilence from infected countries; and, secondly, those which are adopted in centres of population, within a country already invaded by an infectious or epidemic disease. The first are effected by the establishment of Quarantine or Lazaretos; the second, by the establishment of temporary special hospitals or refuges in isolated situations, if possible.\n\nSuch measures, it has been already said, are useful and extremely advantageous; but it would be a dangerous fallacy to calculate upon their absolute success, and to neglect the far better measures of a moral, sanitary, and hygienic character.\n\nA few remarks and observations would be sufficient to convince every unsophisticated mind of this truth. To be satisfied of the infallible result of a Quarantine would require that the certainty of the disease being contagious be thoroughly established; or, if simply infectious, it would require a certain positive knowledge of the nature of its mode of transmission, of the time it can lay latent on persons or things, and a close insight into the nature of chemical or other agents capable of destroying the virus. It would again require the certitude of its being incapable of travelling on the winds and with the currents of running waters, or, if otherwise, to be fully aware of the exact distance at which the virus cannot be any more hurtful by having lost its propagating influence.\nIt would also necessitate an absolute prohibition of every intercourse, immediate or immediate, between all persons or things appertaining to the country to be protected, and also of every thing or person started from all suspected or infected regions, and even from all persons and things connected with the Quarantine station itself, such station becoming ipso facto an infected spot.\n\nEven if we were entirely conversant with the mysterious propagation of those maladies, such total prohibition of intercourse between countries in constant intercourse with one another would be, in itself, a great calamity.\n\nThe recent successful instance of sequestration at New York, on board the English ship Atalanta, connected as it is, perhaps, with political, social, and commercial tendencies of the day (not altogether medical), has received amongst our republican neighbours, an advocacy of absolute prohibition by means of extremely rigid quarantine and non-intercourse. To adopt extreme measures on the isolated experience of the case of the Atalanta would be indulging in the very fatal philosophical error of arguing of the general by the particular; and possibly the non-spreading of the disease in the case of the Atalanta may, after all, be attributed to the presence of the cold season.\n\nAll this reasoning, nevertheless, is not a plea for the abandonment of the principle of sequestration and of measures of quarantine, as already and repeatedly enunciated. Happily, however, there is a middle course that can be observed, equally distant from extreme determination called for by most opposite opinions.\n\nIt would be impossible, even if it were of absolute necessity, to guard the country against the importation of Cholera on the line of our inland frontier, extending over hundreds of miles. But here it may be said that our neighbours, in defending themselves from such an importation into their own territory, are virtually making us participants of the same advantages. That argument, however, cannot apply to our numerous ports situated along the coast of the Gulf and the lower St. Lawrence, such as are the free port of Gaspé, the ports of Paspébiac, Percé, Rimouski, Escoumins, and the ports of the Counties of Saguenay and Chicoutimi. A medical health officer chosen on the spot might perhaps be appointed at each of these ports, with instructions to inspect every ship, and in case of sickness, to stop each ship from pratique, and by instituting the ship herself as quarantine ground for the master and crew, whilst those on board may be submitted to special treatment, till the sickness has disappeared, providing for any case in which, by death, the crew is reduced to an insufficient number of hands.\n\nThe point, however, at which a quarantine is of all importance, as proved by the constant experience of former epidemics, is on the St. Lawrence, at the entrance of the port of Quebec. The Government possesses already, and very fortunately, at that very point an admirable establishment, which only requires to be made at times of more than ordinary dangers adequate to the circumstances. A better selection for a Quarantine than the Grosse Isle Station cannot be made, situated as it is at some thirty odd miles from Quebec, on an island of about 600 acres superficies, with deep water and good anchorage, at least three miles distant from any parish or village, and yet sufficiently near to prompt and commodious public means of communication.\nThere can be practiced a reasonable sequestration embracing, on one side, the relative security from infection which quarantine measures can afford, and, on the other side, neither vexations nor ruinous to commerce and international intercourse. The rules to be adopted to carry on such a reasonable quarantine, need not be laid down in this Memorandum; they constitute no new science to propound, being well considered and set down in the works of many authors and in the codes of most nations. This document, being intended for all, cannot enter into lengthy details; and moreover, as this part of the preventive measures devolves upon the State, the Executive has already and can always have at its command, the means of information sought for to determine its action.\n\nThere is, as connected with the Quarantine, a question on which it is important that the public should possess some practical information, in order to prevent one-sided notions taking possession of the public mind, and thus become a subject of very serious embarrassment. This question may be thus written: What rules shall apply to steamers of passenger lines frequenting the ports of Quebec and Montreal, one of which—the Canadian Ocean Steamship Company's Line—is subsidized by our Government and carries our European weekly mail?\n\nIt seems impossible to exempt them entirely from quarantine when coming from a country laboring under the scourge; but a strict quarantine for such ships may prove very disastrous, even absolutely ruinous for the company and calamitous for commerce in general.\n\nThis simple expose of the question at once suggests that it is one of no small importance, and one which is fraught with serious difficulties.\n\nWithout any attempt to solve the question in this Memorandum, it will not prove useless, it is hoped, to suggest a measure, the adoption of which may result (if not always, at least in several instances,) in the avoidance of the greatest danger, on one side, and of immense losses to the company, passengers, and merchants, on the other.\n\nThis measure is suggested by the practice for a long time adopted by the Austrian Government towards their company of steamers trading between Smyrna and Trieste. This practice would secure an increased efficiency in the case of our steamers, from some modifications of a more stringent nature, and from the fact of the greater length of the passage between Liverpool and Quebec than between Smyrna and Trieste. To follow this practice would require that a special medical health officer is placed on board each steamer, which will then be, whether there is disease or not on board, assimilated to a quarantine station. This officer to be appointed by Government, at the first warning of Cholera, for a limited required time, besides the ordinary physician of the ship.\n\nDuring the storage of the cargo, sanitary precautions would have to be enforced and preventive disinfection practiced in a way not to damage the goods, by the use, for instance, of dry hypochloride of lime or some equally efficacious disinfectants, and whitewashing of ship and boxes with lime water. These recommendations are not made in ignorance of what can be said against the real efficacy of such measures, but it is assumed that the wiser course is to incline towards the safer side.\nEvery day of the passage sanitary measures would have to be resorted to, according to regulations made to that effect; and amongst others, the goods and effects of the passengers in daily use would have to be ventilated on deck.\n\nIn the case of five days having elapsed since the last attack of Cholera on board, at the moment of arrival at Grosse Isle, all those yet on sick and convalescent lists being landed, the ship, without further detention, would be permitted to proceed to Quebec, and if free from Cholera on her arrival at Quebec, then allowed to pratique; if not free from Cholera, ordered to remain at anchor at the mouth of the St. Charles, to be dealt with according to the orders of the inspecting physician at the port after consultation with the Quebec Board of Health.\n\nIn the case of detention at Grosse Isle a shorter period, less stringent measures of purification to be adopted for these ships than with ordinary vessels. Even partial admission to pratique might be allowed them.\n\nNow comes the consideration of the second sort of sequestration which has been indicated at the beginning of this section, that is, isolated Cholera Hospitals in cities.\n\nVery little requires to be said on the subject in this Memorandum, further than that the adoption of such hospitals, and several of them in large cities, is a measure of paramount importance. These hospitals, of course, are destined to receive the poor, to avoid the formation of focuses of Cholera in the small, filthy, and crowded lodgings. Refuges for convalescents of the same class ought also to be procured, for a convalescent is a vehicle to carry and impart the pestilence.\n\nIt devolves upon the municipalities of towns and cities to create such temporary establishments, and it is for the Local Boards of Health to see that they are well ventilated, properly kept and attended to, according to peculiar local circumstances.\n\n§ 2.\n\nHYGIENIC PRECAUTIONS.\n\nThe Sanitary measures to be adopted can be conveniently classified under two heads, viz.: Public and Private measures, and these can again be conveniently subdivided into two other classes: measures relating to persons, and measures relating to things.\n\nNecessarily the information or advice imparted in the following lines, are restricted to general principles, intended to serve as a compendium on subjects upon which the reflections of all and the serious studies of some, are to be directed. Sanitary measures concern every locality and every place, they apply even to isolated country dwellings of farmers and others, but they particularly apply to villages, towns, and cities, because the larger the agglomeration of population in a given place, the more those measures become necessary, from the fact that the actual number of lives exposed is greater; and also that the agglomeration increases the danger in a far greater ratio.\nthan that of numbers alone. Everything being equal, a population of so many thousands gathered into a smaller space, will, in time of pestilence, suffer a greater loss than an equal number of persons spread over a larger superficies.\n\nIt is a matter of public security to have everything of a dangerous nature removed from the centres of population and vicinity of human abodes; such as are contents of cess-pools, composts, offals, heaps of manure, carcasses of animals, soakage; in one word, every sort of vegetable or animal matter in actual or impending decomposition.\n\nIn reference to the disturbing of such matters when occurring in masses, a very important remark is to be made. Such masses should be carted away to farms in cold season. But if in time of actual pestilence it is better not to disturb them at all, but to resort to the means of disinfecting the surface, and covering them with a sufficient layer of dry earth.\n\nPools of stagnant water, open sewers, discharged ditches of establishments of industry are also vicinities of dangerous character; therefore to drain or to cover, or to disinfect them, are salubrious measures of great importance.\n\nThere is a numerous class of trades and manufactures which being in their very nature offensive, ought not to be allowed to be carried on in the midst of towns and cities, such are the slaughtering of animals, collecting and storing of old rags and debris, manufacturing lime, vegetable charcoal and animal charcoal, acids, coal oil refineries, tanneries, making of artificial manures, soda and candle factories, and many other branches of industry, especially those connected with the transformation of parts of animals, which debris are not to be collected in quantities without being submitted to inspection and sanitary precautions.\n\nLarge stables, collections of cattle intended for slaughter, and especially piggeries, are very objectionable in cities: as the establishment of the first mentioned class cannot be prohibited, it is necessary that stringent regulations for the very frequent carting out of town of litters and manure be enforced.\n\nThe question of carrying off the surface water, always more or less impregnated with putrescent matters in towns and cities, and the daily mechanical removal of the night soil; in other words, the question of drainage and sewerage generally is as important in a sanitary point of view, as it is difficult of a satisfactory solution in a scientific and financial light. Evidently such complicated problems are not to be treated of in a paper like this; wherever a village, town, or city, can undertake such comparatively vast works, its municipal authorities must have recourse to professional men to deal with the question on the spot.\n\nIn the absence of under drainage, open drains ought to be established to dry the soil, and in the absence of perfect sewerage (an extremely rare advantage), disinfectants and interment, when practicable, are to be applied; if in conjunction one with the other, so much the better.\n\nAfter having thus enumerated the principal objectionable materials, trades, and manufactures which ought to be prohibited, let every one be\n\n---\n\n* appears in the original text but is not part of the main content.\n\noccurred in the original text but is not part of the main content.\n\nsupplying the Hospital. The latter was not a little near Hampstead Vauxhall, the house\nreminded of things which are to be provided, and especially of the very great importance of obtaining an abundant supply of water which should be of the best quality.\n\nEvery possible means to furnish plenty of good wholesome water to the population of villages, towns, and cities, ought to be put in requisition by the municipal authorities, in order to provide for an abundant supply of this commodity wanted at all times, but singularly indispensable in time of pestilence.*\n\nSuch an enunciation bearing on measures of so self-evident a necessity, may appear to many nothing else than the useless uttering of truisms and common place remarks, but the daily neglect of these measures, the apathy entertained about them, the constant evils resulting from such apathy and neglect, are a sufficient proof of the necessity of their being repeatedly brought before the public. Let these suggestions be continually dwelt upon lest, after having been carelessly heard, they should be entirely forgotten.\n\nThe cleaning of streets, yards, public buildings and private houses ought to be thorough before the hot season sets in and before the malady has made its appearance. There is in most of our Villages, Towns and Cities quantities of old wooden pavements, planks and other decaying timber, lying in the streets and in and about the back grounds in a state of partial decomposition and absolutely saturated with filth and moisture of all sorts which should be burned, or carted out in open country early in the spring, should it be considered available for anything useful.\n\nThe sanitary or precautionary measures may be mostly all expressed by two collective words: Cleanliness and Ventilation. Cleanliness of the streets, passages, yards, dwellings (public and private), infers the removal of all matters which are factors of decomposition, either as ferments or as fermentable bodies. Every remain, either vegetable or animal, is susceptible of decomposition, and consequently, when out of place, becomes a fertile cause of insalubrity and disease. Out of place, is intended to mean where they are not wanted for actual and immediate use; for example, collections of hides and bones are out of place everywhere else than in the establishments where they are to be converted into leather, glue, animal charcoal, or any other industrial product; and the establishments themselves are out of place in the midst of centres of population; again, manure and composts are out of place anywhere else than on the farms they are destined to fertilize.\n\n* Dr. Dundas Thomson says, in reference to the subject of the influence of water on the appearance of Cholera in London:\n\n\"But, perhaps, the most terrible example on record of the fatal effects of impure water, occurred in 1854. I found that the Southwark Company's water was of a different composition from the water of the Lambeth Company. When I applied a piece of muslin over the supply pipe of the Southwark Company to the cistern in my laboratory at St. Thomas's Hospital, a large quantity of human excrement was detained, and the impurity in solution was much greater in the Southwark Company than in the Lambeth water, which contained little or no matter in mechanical suspension. The Lambeth water was obtained from Hampton, while that of the Southwark Company was pumped up from the river near Vauxhall Bridge. These two Companies possessed mains in the same streets, and supplied the houses indiscriminately. Analysis alone enabled me to detect the two waters, as the\nCleanliness is obtained by scratching away, washing off, and carting to the fields, all offensive matters. In the cleaning of polluted places the use of a little chloride of lime in the water may be of great benefit. The same remark, however, which has been made about disturbing masses of matters during hot weather and in time of pestilence, also applies to filth collected on walls and other surfaces of dwellings and premises when under the immediate influence of extreme heat and moisture, putrefaction and diffusion of miasm, acquires an immense impetus under such circumstances, consequently it might not be unattended with danger to undertake any extensive hot water washings of these dwellings during sultry weather; and it might be better to cover the surfaces of such dwellings or their appurtenances with a thick coat of paint or lime.\n\nAs several allusions have already been made to disinfectants, it is just as well to remark, so that it be well understood; firstly: that substances called disinfectants in common language, are not all possessed of such properties: Secondly, that even real disinfectants, (like all other precautionary measures) although of beneficial use, are not in themselves infallible resources—they are simply good adjuvants. Thus the acquiring of the best conditions of salubrity is not a simple but a complex problem, the result can only be obtained by the operations of various forces converging towards the same point of action.\n\nBut few of the best disinfectants will be mentioned here, in order not to create confusion in the mind of persons not deeply versed in these matters, and also in order that special attention being concentrated on a few, more certainty of an ample supply of them is obtained, and the prevention of possible speculation imposing on the credulity of the people.\n\nQuick Lime is recommended for its cheapness, for its being so readily obtainable everywhere, for its easy application and for its being so familiarly known to every one. It is well also to mention purifying qualities of powdered charcoal.\n\nChloride of lime, sulphates of iron and copper, and permanganate of potash, or Condy's fluids, are the other disinfectants recommended; and it is hoped that they will be imported (not being yet manufactured in the country) by druggists and merchants, in ample quantities and sold at a reasonable trade price.\n\nThese substances are not to be employed indiscriminately in places actually occupied by people; they are specially intended for sewers, heaps of dirt or manure, outside privies, night pails, &c. If otherwise employed they ought to be so under the direction of medical men or apothecaries.\n\nInhabitants, without consulting their water receipts, were unable to state the source of supply. And although the population supplied by the two companies was precisely in the same condition, except as to water, the Cholera deaths in the houses supplied by the Lambeth Company were 37 to every 10,000, and in those by the Southwark Company 130 to 10,000, or as one to every three and a half. I conclude from this data supplied, that 2,500 persons were destroyed by the Southwark water, who would have been saved if they could have obtained the Lambeth water. It is a remarkable fact that the Lambeth water, in the epidemic of 1848-49, was more fatal in its effects than the Southwark, the Lambeth Company taking their water lower down the river at that time. The mortality in houses supplied by the Lambeth water was 123 in 10,000, while the deaths in houses supplied by the Southwark water were 118 in 10,000.\"\nChloride of lime may be used in the proportion of one pound of Chloride to a gallon of water, and it is assumed that a pound of chloride of lime so diluted is sufficient to partially disinfect one thousand gallons of running sewerage; when used for washing a much weaker mixture is to be made, say an ounce to a gallon of water, and the articles are to be well rinsed and cleaned in pure water, and well exposed afterwards. In every case the chloride must be well mixed with water.\n\nSulphates of iron and copper may be used in the proportion of a pound to a gallon of water for disinfecting filth and sewerage. Condyl's strong or red fluid may be diluted in the proportion of one gallon to fifty gallons of water, and the weak or green fluid in the proportion of one to thirty gallons. However strong may be the faith in disinfectants, in spite of what is alleged against them, they can never supersede or cause to be overlooked the more reliable measures, as are cleanliness and ventilation for instance.\n\nGood ventilation infers, firstly, perfect cleanliness of dwelling; secondly, the avoidance of crowding, coupled with a free circulation of wholesome air.\n\nThe enunciation of this broad principle is suggestive of advice in a general form: that crowded and long standing gatherings of people are to be (as much as religious, educational, military and civic duties can permit) avoided during the reign of pestilence, especially at night, and that this precaution or rule applies not only to the interior of buildings, but even to meetings in the open air. Of course, in the application of such a principle no one ought to indulge in pusillanimity and the drawing of extreme consequences.\n\nTimes of epidemic are not times to fly from the service of God in his own house; and they are no excuse for dereliction of other public duties, but they are times for prudence on the part of legitimate rulers, and of obedience on the part of other members of the community. It would be a desirable measure that, during the prevalence of Cholera, colleges and schools should be closed and vacated.\n\nIt is a rule to be always observed during mild seasons, that churches, public halls, and rooms in ordinary dwellings, when not actually occupied, should be open by means of their windows to the access of currents of fresh air, as sweeping as the state of the atmosphere and artificial means when at command can allow. This suggestion is not to be understood as recommending the introduction of cold draughts or direct strong currents of air where persons are standing, sitting or reposing; but under these circumstances ventilation should be effected quietly as well as steadily. Fresh air is a commodity which men can use and abuse.\n\nIn the present state of science no fixed formula can be given for the space of room allowance requisite for each person, nor is there any one admitted method of ventilating buildings, for the simple reason that ventilation depends on a multitude of circumstances, varying with the external ambient air, the habits, temperaments, healthy or unhealthy condition of persons, the dispositions and situations of tenements, and so forth.\n\nA man can be ventilated to death by fresh air in a box and can be suffocated by foul air in an immense hall. It devolves upon every one in his public or private capacity to adopt measures of this kind, and upon the\nlocal Boards of Health during the prevalence of epidemics to see that no uncommon evils resulting from deficiencies of space and ventilation are allowed to endanger the public health.\n\nA special mention is to be made here of the annoyance and discomfort very often met with by our travelling community, which may be, in time of pestilence, the source of great danger—that is, the overcrowding of cars on Railways, and sometimes of Steamers with passengers. In such times there should be no more than one person for each bed of a sleeping car, and no more passengers in any other vehicle than there are seats to accommodate. While speaking of Railways, it is deemed of the utmost importance to revert to the necessity of remedying the abominable nuisance of privies of all our Railway Stations, and to the detestable habit of soiling the approaches of every stopping place on our Railroad tracks.\n\nThe privies of Cars and Steamers should also be the object of very special attention and supervision.\n\nWithout a great display of dogmatical science it is easy to pronounce whether the atmosphere of an apartment is close, overloaded with noxious gases or odors, either too hot or too cold, too dry or too moist, for ordinary purposes. Besides it would be impossible to alter at once, or for many years to come, even if it were a necessity, the permanent circumstances of dwellings public or private. So it is better to leave aside those questions of discussion, and to resort in addition to the simple and common means of keeping everything clean, of making use of the doors, windows, wickets, and also of large fans to agitate the air of the inside, where the surrounding external atmosphere is still and heavy. It is a great criterion to judge of the sanitary condition of any lodging, that its inhabitants who have dwelt in it for a reasonable time (all other things being equal) have a comparatively looking clean, strong and healthy appearance. Under these circumstances, there is every reason to believe that the perils of residing in such a dwelling are not great, even if there were something evidently susceptible of being ameliorated. This, of course, would be no reason to abandon any idea of progressive improvement, but it would be a sufficient cause not to adopt vexatious measures against the proprietor or inmates of such tenements.\n\nIt is a precaution of the utmost importance (the abandonment of which might be felt fatal to many lives) that the stoves or heating apparatus of dwellings should be kept during all season in good working order, so that they can be used moderately in case of sudden lowering of the temperature and also in case of extreme dampness. For although ordinary and gradual diminution of temperature and continuous action of cold season such as heralds the approach of winter has a marked effect on the stopping of the disease, the same effect is by no means produced by an abrupt change from a hot day to a few hours of summer cold; such change, besides its depressing effect on the animal functions, especially those of the stomach and bowels, seems to act by the way of reaction as an intensifying agent on the decomposition of organic matters, which cannot be entirely removed from the immediate vicinity of human abodes. It is not needless to remark that a heating apparatus is also a most useful means of effecting ventilation.\nIt is an important duty devolving on the municipal authorities of towns and cities to see that all adulterations and alterations of articles of food and common beverages are prevented. A large town or city ought to have a medical inspector, who, being a practical chemist and microscopist, should watch over the buying and selling of all alimentary substances in common use.\n\nAs to preservations of a purely hygienic character applying particularly to ordinary daily regime, they do not differ from those which apply at other times, with the exception that some innocent indulgences, such as friendly gatherings, might perhaps better be avoided, as well as anything indifferent in itself which is known by every one to have a depressive effect on the natural functions of the organism, and particularly any over-exertion of the mind and body.\n\nAgain and again let it be repeated that drunkenness, immoderate use of food and drink, excesses and vice in general are per se predisposing causes of sickness, cholera specially and fatal complication of the malady.\n\nThere is no necessity in time of epidemic for a change of customary habits and diet, provided they are good; far from it, there may be danger in making any important change.\n\nBut if the habits or diet are bad, it is of much moment that they should be modified, and that such modification should take place before the appearance of the scourge, in order that all the functions of the body harmonize with such changed state of things before the time of trial has arrived.\n\nEvery article of food and every beverage or preparation known by a person as having on his bowels a loosening effect or producing constiveness are to be avoided; the first on account of their actual action, the second as necessitating afterwards the use of aperient medicines, or being apt to bring a reaction to the same effect. Care should also be taken not to fast when attending the sick, nor to remain too long without food at any time during pestilence.\n\nOccasional use of bathing and the constant habit of daily cleanliness of person are evidently needed, but caution should be observed against too prolonged and frequent bathing.\n\nIt is well to wear warmer than ordinary summer clothing, especially flannel next the skin, because there is in times of Cholera a predisposition to sudden chilliness, against which it is wise to be constantly guarded; the use of flannel belts on the belly is often recommended, and great care should be taken not to allow the feet to become cold and damp, especially when not in actual bodily activity.\n\nAs seen in the preceding lines, the principles of hygiene are in the main very simple, still their being enforced with strict observance on the public requires not a small share of industry and understanding on the part of those who are entrusted with that duty. The execution, however, of some of the measures (as applied to local circumstances) required in case of epidemic are exclusively within the province of the medical profession, and it stands to reason that there should be a comparatively large proportion of its members in the composition of the local Board of Health. This is not to grant a\nfavor, but rather is it an onerous and responsible duty imposed on a class of the community more strictly obliged by the nature of their avocation to undertake it.\n\n§ 3.\n\nINSTRUCTIONS AND ADVICE.\n\nOne of the evils connected with the appearance of public pestilence is the indulgence in spreading reports, rumours and opinions of all sorts. Thence timid people are frightened, and excitable people lose their self-possession.\n\nMen of systematic ideas propound wild theories, and credulous persons adopt them as absolute truths. Speculators are also apt to take their chance of such times, and long before the appearance of Cholera, advertisements are seen offering for sale all sorts of remedies and specifics for that scourge. Patent medicines, previously announced as curative compounds against almost every known ailment, are presented with a new placard, in which the word Cholera is added to the already long catalogue of fever, debility, inflammation, gangrene, diabetes, suppression of urine, constipation, diarrhoea, &c., &c., all of which are to be cured under all circumstances, real, possible or imaginary. Thus and in many other ways charlatanism is opening its meshes to credulity and fears.\n\nTo lend a too credulous ear to all these reports, rumours, predictions and promises becomes the source of much danger. The press should be guarded from giving countenance to such parties, for the injurious effects therefrom resulting, could they be realized, would be found to be of alarming magnitude.\n\nThe duty of every one is very simple, and to accomplish it is the only means of expecting immunity for ourself and of being useful to others. The laws of the country have provided that public bodies should be selected in each locality, to collect information, to watch over the progress of the malady and to give orders for the execution of all necessary measures; the wisest course, surely is to look to these persons for information, if needed, and to accomplish cheerfully and faithfully what is recommended or ordered by them.\n\nIf sickness should come, there is a class of men whose minds have been directed to the study of the functions of the human frame and the cure of disease; their duty as well as their interest is to effect all that human skill can do to restore health, and on their success rest their honor, peace and comfort; it is true they may be unsuccessful in their efforts, but far less risk will be incurred than at the hands of irresponsible persons.\n\nSome advice is much needed in relation to the attendance on the sick during Cholera, because cowardly fear may lead people even to forget what they owe to their fellow-creatures and even to their near relatives; and, on the other side, ill-advised devotedness may expose people to unnecessary danger. A very simple rule previously offered to the reflections of a sound intellect and to the feelings of an honest heart may do a great deal of good,\nWhoever is the sick, and wherever he lies the prey to the malady, whatever your station in life, you owe to him help and comfort; if he is in need of medical assistance, seek it; if he requires anything in your power to give, give it to him; if he has no attendance, attend to him or procure it for him. But if the sick person happens to be well provided and attended to, then there is no occasion to go near him unless he is a bosom friend or a relative. This place is just as good as any other to insert a remark which is to be taken as one of paramount importance. The articles of clothing and bedding which have been soiled by the dejections of the sick are to be first disinfected, and then washed carefully; if of small comparative value they had better be burned or buried. The dejections of the patients are to be received in pails containing some disinfectants, and are not to be thrown into sewers, privies or cess-pools, but are to be interred at some depth.\n\nThe crowding of people around a sick bed is especially bad in regard to Cholera. In duty and honor you are bound to face every danger when called upon for a good purpose; in duty you are bound to avoid the smallest risk when there is no useful object to be attained. If we except unwholesome crowding, there is not, generally speaking, so great danger as people may fancy in the attendance on the sick, and provided that the precautions indicated in this memorandum are observed, there is hardly any more peril than in the mere walking the streets of a locality under the scourge. Most of the medical men, sisters of charity and attendants of hospitals in the country, have weathered several Epidemics without having been seriously ill, although living in close communication with the sick day and night for months; their secret has been to avoid fear, to be calm, cleanly and prudent.\n\nIn time of Cholera Cemeteries must be the subject of very strict attention and are not to be allowed as places of public resort; it is better not to attend funerals in large numbers. Once on this subject it is well to guard against precipitate as well as too long delayed burials. The medical members of local Boards can frame instructions to persons connected with such a service; the inspection of a medical man is sometimes absolutely necessary. With proper precautions, there would be no danger in allowing families who have the means of going into the expenses necessitated to carry on such precautions to have the consolation of having their dead buried in the usual way adopted by them, and be allowed the usual church service.\n\n§ 4.\n\nPROPHYLACTIC TIMELY TREATMENT.\n\nIn time of Cholera epidemics the stomach and bowels are apt to be easily deranged, and great care should be taken to remedy, at once, such derangements, without fancying any danger when there is actually none. Sometimes Cholera is preceded by Cholerine or premonitory symptoms, and sometimes it comes on without warning, even sometimes without many of its most striking characteristic symptoms.\n\nIn every case of a sudden ailment, whenever medical aid can be obtained,\nit should be procured. But in the absence of such assistance, there are measures and simple treatment some of which may be administered by the patient himself, and others by any assistant; it is necessary that, therefore, such measures should be known by everybody.\n\nAnyone attacked by pains in the stomach or bowels, cholics, diarrhoea, however slight in appearance, should moderate his diet, and even abstain from strong or any food, he should avoid fatigue, cold and dampness, clothe himself warmly, and make a moderate use of some warm aromatic drink like infusion of tea, chamomile, ginger, mint, coffee or similar substances.\n\nIf the symptoms increase, or even at the onset of the complaint, there is a sensation of chill and inclination to vomit, then the patient must be put in a warm bed between woollen blankets or sheets. The use of aromatic drinks are to be continued and frictions under the bed-clothes, not uncovering any part of the body, and every other external means of warming the skin are to be applied.\n\nIt has been deemed wiser to abstain from offering any suggestion concerning treatment by medicines or drugs, on account of the danger accompanying the use of such agents by other than medical practitioners.\n\nOnce on the subject of duties connected with attendance on the sick, it is proper to remark that whilst it is at all times the duty of the physician and others to maintain a cheerful and encouraging demeanor towards a patient, yet it would be exceedingly culpable, especially with such a prompt malady as Cholera, to conceal from the patient his true condition.\n\nCertain precautionary public measures of a prophylactic or preventive character, which may be adopted with immense advantage everywhere, and which are of absolute necessity in large towns and cities have to be indicated in general terms.\n\nAmongst such measures the appointment of a medical health inspector stands first. The duties of such officer would be to examine beforehand, and during the prevalence of epidemic, the streets, yards, edifices, dwellings, wells and other water supply, to see whether such hygienic conditions, which are of a feasible nature under the circumstances have been adopted, and to report thereon to the local Board of Health and to the Municipal Corporation.\n\nThis officer would also be entrusted with the duty of imparting generally to the people such information as is likely to be of use in warning some against incurring unforeseen dangers, in alleviating the terrors caused by the apprehension of exaggerated or totally imaginary perils, and in detecting incipient sickness and enforcing treatment. Such service has been already established with good results in several European countries under the title of preventive domiciliary visits.\n\nThe establishment of temporary public dispensaries in different parts of large cities, under the immediate control of the local Board of Health is also a measure of the utmost importance, where everyone could be furnished with such remedies as are recommended for the treatment of premonitory symptoms, or with those prescribed by a medical attendant at a cheap price for all, and gratuitously for the poor. The same establishment could also be made a\ndeposit of disinfectants, and of flannels and other articles for the destitute, to be delivered on the production of a ticket from the local authorities at the cost of the municipality. In large communities it would be also advisable to have always in requisition proper vehicles or ambulances for the removal of the sick, such conveyances could be in connection with the service of both Cholera hospitals and dispensaries.\n\n§ 5.\n\nCURATIVE TREATMENT.\n\nThe treatment of Cholera is one of the most difficult of all therapeutic efforts which can be required from even the most experienced medical man. To enunciate such a proposition is to say that none but a professional practitioner should undertake such a task. To meet the symptoms of the malady as they appear in their protean form, in accordance with the general laws which govern the human body and the pre-acquired knowledge of the many agents employed as medicines, is the problem, to solve which is not a little perplexing for the most accomplished physician.\n\nThence the wisest counsel which can be given to the family, friends or charitable attendants of any person apparently laboring under an attack of Cholera is:—Send for the physician!\n\nBut there are many people in the new settlements and in the backward parts of the country (and the case may also happen in older and nearer parishes and townships) who cannot obtain the advice or ministration of a physician and there are a great many more who by no possibility, can procure such help in time, for these parties some advice may become of great value, if not in teaching what is to be done at least in warning them of what they ought not to do.\n\nIn the preceding section the prophylactic and primary treatment of premonitory symptoms or incipient Cholera has been described, and such treatment, in the total absence of a physician or while waiting his arrival, can be undertaken by any intelligent person, and is to be resorted to without fail; but now we have to deal with the confirmed malady, when the symptoms have changed and when the disease is undergoing a rapid succession of phases, calling consequently for a succession of modes of treatment different from one another.\n\nIn the absence of a physician then, the four stages of Cholera may be treated in the following manner. At the period of invasion and during the following period of collapse the external measures recommended for premonitory symptoms are to be continued, that is to say, keeping the sick in a recumbent position in bed between woollen sheets or blankets dry and warm—frictions under the bedding to avoid the action of cold air, the use of hot bricks, sinapisms, turpentine stipes and other stimulating agents not however carried to vesication or blistering the skin; in one word, appliances to the surface of the body to restore the animal heat.\nAt this stage ordinary stimulants may be used internally to endeavor to revive the pulse and powers of the organization generally.\n\nThe period of reaction when well characterized by subsidence of the worst symptoms and not accompanied with congestion requires no special treatment.\n\nIn case of sign of congestion and non-reappearance or continuous scarcity of urine, the only remedies which can be attempted without danger by a stranger to medicine would be the warm foot bath, friction with mustard or other rubeficient to the feet and calves of the legs, and diluent drinks like linsed tea not too thick, poultices in the region of the kidneys (or hollowed part of the back) in order to restore the urinary functions.\n\nCongestion may be detected by non-medical attendants sometimes by noticing an extra turgescence and redness of the face, if the head is threatened, or by a sensation of fullness if another part is the seat of the rush of blood, and increased anxiety in both cases.\n\nIf the period of termination is accompanied with no unfavorable symptoms and if the urinary functions are well established, the better plan is to let the patient alone as far as medication is concerned, and to begin feeding him gradually—but if symptoms of a typhoid type supervene, which may be noticed principally by the oppressed aspect of the patient, anxiety, unsteadiness, and a somewhat stupid appearance of countenance, accompanied or followed by delirium, some stimulants in small quantities are to be given to the patient, and beef tea administered to him, as exhaustion and want of action is generally the cause of the complication at that period of Cholera. Of course such remarks are only intended for the guidance of people in the absence of medical attendance.\n\nTo attempt more than such a simple treatment carried out with care, attention and perseverance would be, to say the least, risking a good deal.\n\nA precept to be invariably followed is to leave the sick entirely to nature's care, rather than to try drugs and remedies, the effects and results of which are almost perfectly unknown and at unascertained periods of the malady.\n\nIt has been thought a duty not to close these remarks without touching a point of great magnitude as well as of great delicacy, that is, in case of the actual death of a pregnant woman the Cesarean section ought to be performed, if allowed by the family; although there is probably very little chance of saving the child, for the reason that no harm is done on one side, and that a great result may possibly be obtained on the other.\n\n§ 6.\n\nA SERVICE TO BE RENDERED TO SOCIETY.\n\nMedical science being founded in a great measure on the study of facts grouped together, the importance of collecting the facts connected with the\nlamentable events of such a noticeable character as the passage of Cholera in a country become self evident. Unfortunately very little has been recorded of the statistics of former epidemics in Canada, and this very little even can only be gathered by the very tedious, imperfect, and not very reliable mode of collecting them from the several newspapers of the time, with the exception of some interesting official reports and papers, which are, however, limited to special points.\n\nIf Canada is again visited by the threatening scourge, precautions should be taken that the experience acquired during its prevalence be not lost to science.\n\nStatistics ought to be collected by local Boards and directed to the Central Board. Even the most limited fields of observation are very apt, when brought together, to throw light on a subject of such interest. It has been ascertained in some European countries that the observations made in small localities, when collected by men of real tact, have a particular interest, being generally more accurately made. The officers charged with such labour in large cities are over burdened with work, and not being so well, and often not at all acquainted with the persons and their circumstances cannot sometimes give certain interesting particulars which are so easily ascertained in small places where everything is of public notoriety.\n\nBlanks of a uniform plan should be furnished, to be filled by every clergyman, medical practitioner, hospital official, health officer, sexton and other persons connected with the service of the sick and dead.\n\nThe returns of sickness and death ought to contain, as much as possible the following information: the number of cases of real cholera and the number of cases of other diseases, the number of deaths from cholera and the number of deaths from other diseases.\n\nThe date of the attack, the date of recovery or date of death, the age of the patient and sex, his profession or trade, his general habits, his nationality, the duration of the ailment.\n\nTo these statements might be added any remarks the collector of such statistics could furnish, which would appear to him of any value.\n\nVery interesting and very useful information could also be recorded; the way the cholera was introduced into the locality and the precise moment (if possible) of its appearance and disappearance; what was the dominant sickness before the appearance of Cholera, and whether sickness and mortality from other causes have decreased or increased during the prevalence of the disease, and whether they have kept away or returned back, as the case may be, after the disappearance of the scourge. The apparent effect of certain local influences and of the hygienic conditions on the malady, the description of the measures adopted for the prophylaxis or the mitigation of Cholera and all other information in regard to the sanitary conditions of the locality as a whole and of the dwellings and premises.\n\nIt would be very useful to collect thermometrical, and when possible, barometrical and hygrometrical observations made from day to day before, during and after the epidemic. A description of the locality; the quality\nand distribution of its waters, rivers, lakes, marshes, &c., and the quotation of number of cases and of deaths compared with the geographical situation.\n\nIf such a mass of information could be accurately brought together, it would be paying to science and to mankind a tribute every country owes to the human confraternity, by not allowing to be wasted such dearly acquired experience.\n\nJ. C. TACHE,\nReporter.\n\nOTTAWA, BUREAU OF AGRICULTURE,\nMarch, 1866.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_47058.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 38, "total-input-tokens": 62390, "total-output-tokens": 19875, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3901, 3], [3901, 6262, 4], [6262, 6457, 5], [6457, 6457, 6], [6457, 6652, 7], [6652, 6652, 8], [6652, 7996, 9], [7996, 11246, 10], [11246, 13843, 11], [13843, 17405, 12], [17405, 20340, 13], [20340, 23658, 14], [23658, 26631, 15], [26631, 29954, 16], [29954, 32580, 17], [32580, 35734, 18], [35734, 38497, 19], [38497, 41362, 20], [41362, 44831, 21], [44831, 48146, 22], [48146, 51021, 23], [51021, 54428, 24], [54428, 57948, 25], [57948, 61531, 26], [61531, 64905, 27], [64905, 68277, 28], [68277, 71456, 29], [71456, 74387, 30], [74387, 77488, 31], [77488, 80712, 32], [80712, 83554, 33], [83554, 86319, 34], [86319, 89506, 35], [89506, 89962, 36], [89962, 89962, 37], [89962, 89962, 38]], "primary_language": ["None", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]