[{"id": "6c5bb6f500cbe8eb54dc461a6af6aa0b6fe9071d", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☑ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nBRITISH TREATY\n\nWITH AN APPENDIX OF STATE PAPERS WHICH ARE NOW FIRST PUBLISHED\n\nAMERICA:\nPrinted, unknown where, or by whom sold.\n\nLONDON:\nRE-PRINTED FOR JOHN JOSEPH STOCKDALE, 41, PAUL'S WHARF.\n1808.\n\nPrice 3s. 6d.\nTHE ADVERTISEMENT TO THIS EDITION.\n\nTHE affairs of the United States become every day more interesting to Great Britain. The men, and the manners of the United States, their principles, and proceedings, have acquired an importance, during the present crisis, which they had not obtained, till they became the rivals in commerce, and the challengers in war, of the British people.\n\nSuch were the considerations which induced the present publisher of the following tract to give it to the Public. It is written with so much acuteness, and ability; and displays in so many new lights the leaders of the United States, with their modes of reasoning and acting, that the Publisher presumed to think it would be a welcome present to all those who wish to see the great questions now at issue between the two countries fairly discussed, and perfectly understood.\n\nThis tract was transmitted by a friend at Philadelphia to the present Publisher. It appears not from the title page, or otherwise, where, or when it was printed, published, or distributed. From that circumstance, we may infer the importance that was annexed to it, within the United States: and from that circumstance, the English reader may determine, whether the American or the British press be the most free.\n\nIf any one should entertain the least doubt of the genuineness of this pamphlet, he may satisfy himself, by inspecting the original work, in the hands of the present Publisher.\n\nHe presumed to think, he only did justice to the subject, and a service to the reader, by annexing to this republication, an Appendix of State Papers; consisting of—first, The Commercial Treaty with the United States, in 1794; secondly, A specification of the various changes which the recent treaty has made of the old, so as to give a perfect view of both; thirdly, His Majesty's Explanatory Notes which forms an essential explanation of the new Treaty; fourthly, Mr. Merry's Letter to a Friend at New York is now subjoined; as it throws a light upon the whole.\n\nT. Gillet, Printer, Wild Court.\nTO\n\nTHOSE MEMBERS OF CONGRESS\n\nWHO HAVE\n\nTHE SENSE TO PERCEIVE\n\nAND THE\n\nSPIRIT TO PURSUE\n\nTHE\n\nTRUE INTERESTS OF THEIR COUNTRY\n\nTHIS PAMPHLET IS DEDICATED.\nPREFACE.\n\nTHE matter of the following sheets was long since prepared, but the publication was suspended from unwillingness to interfere in the measures of government; and from the apprehension that such interference, instead of doing good, might produce evil. A majority of our countrymen seems determined to approve whatever our rulers do; and even to give praise for what they leave undone. We believed, therefore, that, borne on a tide of popularity, they would disdain what we could say; and might pursue their course, still more pertinaciously, should we declare our opinion that it leads to ruin.\n\nThis, though an evil, was not the greatest which we apprehended. We have long seen the American people acting and thinking under an impression, that the wisest and most virtuous among us have an interest distinct from their fellow citizens; that they wish to tyrannize and oppress; that they want to be lords and kings. And although it is acknowledged, that nothing could be more absurd, than a scheme to establish monarchy or aristocracy, it has been taken for granted, that men noted for their judgment are engaged in that ridiculous project. If this produced no other effect than to exclude them from the national councils, we should consider it as a misfortune. We should, however,\nconsole ourselves with the hope, that a quiet course of things would render the employment of their talents unnecessary; or that, if storms should cloud the political horizon, they would, as virtuous citizens, be ready at the call of their country. But we have seen a more serious consequence result from the false direction of public sentiment. The measures which such men recommend are considered as part of the system attributed to them. And when they exercise the common right, and perform the common duty of freemen, to express their opinion of any measure of government which appears to them unwise or improper, it is attributed to a desire of making mischief between the people and their friends. Indeed, a singular advantage has been taken even of their talents, to render their exertions ineffectual. Such, it is said, is their power to persuade, that those who listen are lost; wherefore the people must turn a deaf ear to their arguments. And such, it is said, is their power to misrepresent, that the President and his friends dare not indulge themselves in explaining the principles of his conduct. But since the people know he is their sincere friend, the ablest and best man in America, they cannot act more prudently than to repose confidence in him; and adopt the maxims which emanate from his mind. Hence it has happened that, generally speaking, whatever those who administer the government have thought proper to say or do, has been received\nand adopted as perfectly wise; from which, at length, has resulted the very great evil, that where their opinion or conduct has been traced up to maxims dangerous and false, error has been adopted as an article of faith. Seeing all this, we could not but apprehend that it might be dangerous to publish the matter contained in the following pages. We feared that, from blind confidence on one side, and blind enmity on the other, false notions might prevail and be established respecting our exterior relations, of which foreigners would not fail to take advantage. But it is no easy matter to get loose from treaties with a great power. And although it is a misfortune to be bound by treaties unequal and injurious, that is not the only misfortune. The jealousy of rival powers is excited, and they take every convenient occasion to make us feel their resentment.\n\nA late event has roused public indignation; and Americans, waking from their long dream, appear desirous of knowing their condition. We see with honest pride the spirit of our country. Neither submission to insult with the view to save money, nor the disgraceful expedient of purchasing delusive tranquillity, have yet unnerved the public mind.\n\nIt may be expected that we should say a few words on this event. We put aside what preceded the assault on the Chesapeake, because, even if our government had been in the wrong (a subject on which as yet we form no opinion), the attempt to\nsearch a public ship of war appears to us unjustifiable; and more especially so on our own coast. We firmly believe the British will not attempt a justification; but will, for their own sakes, grant satisfaction. We do not mean to say that they can be bullied into submission. They are a high-spirited nation, and will not be bullied. If anything prevents them from giving satisfaction, it will be a demand in terms so injurious as to put us in the wrong. Then, indeed, we may be answered in a tone to repel the insult of threatening language; which, as it is addressed to fear and not to justice, implies the opinion that we have to deal with scoundrels and cowards. When, therefore, we express an opinion, that the British government will, for its own sake, give satisfaction, it is from the condition expressed by Admiral Berkeley, and which would at any rate have been implied, that they are willing in their turn to submit their ships of war to search. This, we believe, they never will submit to, and therefore presume Admiral Berkeley will lose his commission for making the offer.\n\nWe may be mistaken in our view of the course of events. Things may be brought to the alternative of submitting to insult or going to war. In that case, not pretending to conceal the misfortunes which must attend hostility, we think everything is to be done and suffered to vindicate the national honour. These are the constant sentiments of our hearts, unmoved by irritations of the\nmoment. These, also, are the deliberate conclusions of our judgment. If any gentlemen suppose the war will be feeble and harmless, they are deceived. It must be severe and bloody. But it must be sustained manfully. And we have so good an opinion of England, that we think she will not like us the worse for fighting her on the point of honour. In the mean time, it becomes us to sustain the dignity of our character by the language and deportment of self-respect. Let it be remembered that foul and abusive terms come with propriety from the mouths of none but prostitutes and cowards.\n\nIn the following sheets we have endeavoured to avoid reproach and crimination. In some instances indignation has burst forth. We might, it is confessed, now soften the terms. But really there are occasions, on which wholly to restrain the warmth of expression, implies a defect of honest sentiment. And there are subjects also, to treat which in the cool style of narration, is to betray the cause of virtue.\n\nAware that it may be said we are personally hostile to the administration, we think it proper to put the question at rest, by declaring candidly our opinion. We consider, then, Mr. Gallatin as an efficient man of real talents. We did not approve, neither do we now approve, of his appointment; but we forbear to assign the reasons, because, as far as it has come to our knowledge, his conduct\nis not reprehensible. We believe, moreover, that he is not swayed by pecuniary motives. We are convinced that he touched nothing in the Louisiana concern, and have no reason to suppose he will pocket any part of the sum to be expended in purchasing the Floridas. We consider Mr. Maddison as a man of considerable genius, though somewhat slow, and of great industry. We approved of his appointment. We knew indeed that he was a man of feeble mind; and had seen with concern that he gave himself up to Mr. Jefferson, without reserving the use of his own judgment. When we first knew him he was a youth of ingenuous temper, whose ignorance of the world exposed him to become the prey of any sharper (of either sex) by whom he might be assailed. From a defect of firmness in the texture of his mind, and perhaps also from a defect of education, he was not in the habit of recurring always to fixed principles for a decision on conduct and opinions. So long, however, as he hung on the arm of Washington, his course was steady, and gained him honour. But the instant he let go that hold, he fell into a rickety condition, from which he never recovered; and is now in a deep decline of character, for which we fear there is no remedy. The first violent symptom was a panegyric on the French constitution: the more extraordinary, as that instrument, in all its prominent features, was opposite to the constitution he had assisted in making, and\nlaboured earnestly and successfully in persuading us to adopt. It would be painful to mark the steps by which this gentleman has descended to his present condition; the mere instrument of Mr. Jefferson. We believe him still honest and well disposed. We think he would make an excellent first clerk in the Secretary of State's office, and sincerely regret the want of qualities and talents for the place he occupies. Mr. Jefferson is a man of pleasing, modest, unassuming manners. His conversation, generally amusing, is frequently instructive. Though not deep in any one science, he has that acquaintance with them all which becomes a scholar and adorns a gentleman. He has a considerable share of genius; and there is, in his deportment, an air of frankness and of deference to others, which are agreeable to all, and are sure of captivating the young and inexperienced. If there be blemishes in his private character, we have nothing to do with them. We consider him as a public man, and in this view he has great defects. Like others who have fallen into the idle habit of questioning established truth, his faculty of weighing evidence is impaired. Hence such an astonishing degree of credulity, that he could not only believe the French were free while suffering oppression the most cruel and bloody that ever poor wretches groaned under, but (finding it printed in a French book) he believed, and gravely told the Congress, there is a great mountain of salt in Loui-\nMr. Jefferson has also the misfortune to be a schemer, perpetually occupied with some strange out-of-the-way project. If this were confined to speculation, it would be a harmless foible; but he tries to carry his projects into effect. Sometimes he prevails on the Congress to adopt them, and then poor sailors are sent a-ducking over the ocean in gun-boats. At other times he is less successful, as when he proposed to stow away ships of the line upon shelves. He labours also under such defect of mental vision, that he seldom sees objects in their natural state and true position: just as when we look through a fog, many things near us are not perceived, and those we see appear larger and nearer than they really are.\n\nWe have said Mr. Jefferson is not deep in any science. He is more deficient in that of politics than in any other; and indeed it is impossible he should ever become a statesman; because a clear, distinct, and comprehensive view of objects, with a ready conception of their bearings on each other, is a needful pre-requisite. A second pre-requisite is, so to weigh evidence, presumption and probability, as properly to give or withhold their faith: in short, to believe what we ought, and no more. A third is never to indulge notions which have not experience to recommend them: for though it be possible that after the many years which history numbers, and the many thousand events it records, something new in the science of ethics may be\nTHE BRITISH TREATY.\n\ndiscovered, it is not likely; and if it were, the maxim of physicians should be adopted, to make experiments on bodies of little value, and not on the body politic. If any gentleman assume as a principle that mankind can be governed by reason; and insist, notwithstanding the evidence of all history, ancient and modern, sacred and profane, that we may prudently rely on reason for the defence of nations, we would advise him to commence a course of experiments with his own family, and see how far reason will go there. If successful, let him proceed to those with whom he transacts business. Let him reason them into the support of his pecuniary or political views, without any regard to their own interest. If again successful, let him go or send to such a man as Buonaparte, and tell him 'tis unreasonable that boys should be taken from their parents to fight and perish in the plains of Poland. That, instead of employing large armies, it would be cheaper and better to pick out a few able negotiators, if any can be found among his own subjects; but if not, to borrow Messrs. Armstrong and Munro, and send them to persuade the Emperor of Russia and King of Prussia to surrender their dominions. That a proposition so reasonable in itself, and supported by so much eloquence, could not be rejected. If Napoleon, being persuaded himself, should in this quiet, friendly way, persuade his brother Alexander, the specific would indeed have the sanction of fair\nexperiment, and might safely be adopted. It would surely be a great improvement. Happy condition! without fleets or armies, judges or constables, laws or executioners, to sit secure and happy under the broad shade of reason! But if it should prove, on trial, that neither in a family, a city, a national assembly, or with a leader of nations, the force of reason can be relied on; if it should again, for the ten thousandth time, be demonstrated, that what has been true since the world began, remains true at the present hour, and the gentleman still insist on his project, he could not be much respected as a politician. But though Mr. Jefferson is not, and, from the reasons just mentioned, can never become a statesman, he is a man of great address. Having a quick sense of danger, he has studied the means by which it may be avoided. Knowing the instability of popular opinion, he knew that to rely on it was unsafe. He determined, therefore, to avoid responsibility. This is the cardinal point by which the course of his administration has been directed, with undeviating attention. Consistently with this plan, he associated the house of representatives in the exercise of his functions. The leaders to whom he applied, were charmed with the mark of confidence, and beyond all measure delighted with that republican spirit which, instead of seeking unlawful power, so freely and frankly discharged itself of the unlawful power with which it had been invested. When, over and above that excessive\ncondescension, the patronage of office was laid at their feet; when they were invited to select the proper subjects for appointment; and when they were told that they, the immediate representatives, were the organs through which he wished to learn that will of the people which it was his pleasure and pride to obey, how could they suspect the motive to be selfish? It was natural to believe the fountain pure when its waters were so refreshing. In this way, however, the house of representatives was brought to initiate executive business, and, taking responsibility from his shoulders, to invest him with unlimited power. Like a sly animal in the fable, who likes roast chesnuts, but will not put his paws in the fire, he crept behind the curtain, and persuaded a friendly cat to undertake that part of the business; content, provided he gets the nuts, to leave with others all the honour of raking them out of the embers. By this course of conduct, Mr. Jefferson has not only injured the constitution, and established a system of corruption; but (extending the web of intrigue to influence elections over the whole country) he has composed a congress of such materials, that respect for the national government is much diminished. He has placed himself also in a state of dependance, whereby he is driven to do unrighteous things, and which disenables him from becoming useful, should any course of events restore him to the love of honest fame.\n\nOf the other members of our administration\nnothing need be said; neither shall we take notice of those who are occasionally charged with communicating the President's wishes to the Legislature: a sort of ministers whom Mr. Randolph has described in terms of no little acrimony. Having mentioned this gentleman's name, we will add, that he appears to possess, in an eminent degree, some distinguishing traits of the Virginia character: A lively genius, a bold spirit, a high and haughty mind, with the habit of thinking for himself, and commanding others. Unfortunately for him, he took up false notions at an early period, and committed himself to such an extent, that he finds it difficult to eradicate the impressions from his mind, or free himself from the perplexities with which they entangle his conduct. The executive government, having studied his character, were glad to employ him. He was their sword and shield. But there were some views and plans which it was deemed unsafe to confide to a person of his temper. His indignation at the discovery was exprest in terms not easily mistaken. But though he flounces, he cannot break loose. He is not deficient in personal courage; but he dares not leave his party. Indeed, he is haunted by the panic fear, that the high and honourable sentiments he has expressed will lead the world to believe him a federalist. This apprehension, though whimsical, is not singular. It has, though with far less reason, laid hold of a kind of up and down man, who writes letters to his constituents in Vermont.\nTHE BRITISH TREATY.\n\nTHE gentlemen now in power used formerly to insist that republics should have no secrets. Times have changed, and they have changed with the times. We have secrets in abundance. Indeed, we have little else. The state of our affairs with foreign nations, and the conduct pursued towards them, are concealed with sedulous attention. But notwithstanding the care of our rulers, a corner of their curtain is sometimes lifted up. We have learnt a few state-secrets; and may, perhaps, in due time, bring them to light. For the present, however, curiosity must rest satisfied with The British Treaty; suspended, as every one has heard, on doubts and apprehensions in the President's mind. We make this communication, because, among other reasons, stories have gone abroad which are not true. We are far from desiring that our rulers should, on all occasions, tell all they know. But we think they should on no occasion give currency to falsehood. The treaty is said to have been sent back because a note delivered by the British negotiators required us to make common cause against France. No such note was delivered. It has been\nreported also, that our non-importation law drove the minister of his Britannic Majesty into the required concessions. This also is among the things which are not. Without stopping to notice other aberrations from truth, we proceed to give the purport of that treaty, with a few observations.\n\nThe first article, like the first of that concluded on the 19th November, 1794, by Mr. Jay, is merely formal; and the second confirms the first ten articles of the old treaty. It is, therefore, proper to give a glance at them.\n\nThe first, as is already mentioned, is merely formal; and the second is executed.\n\nThe third gives to each party the right of passing through the territories of the other, in America, except within the limits of the Hudson's Bay Company. We find in it the following clause. \"But it is understood, that this article does not extend to the admission of vessels of the United States into the sea-ports, harbours, bays or creeks of his Majesty's said territories, nor into such parts of the rivers in his Majesty's said territories as are between the mouth thereof and the highest port of entry from the sea, except in small vessels trading bona fide between Montreal and Quebec, under such regulations as shall be established to prevent the possibility of any frauds in this respect: nor to the admission of British vessels from the sea into the rivers of the United States beyond the highest ports of entry for foreign vessels from the sea. The\nriver Mississippi shall, however, according to the treaty of peace, be entirely open to both parties: and it is further agreed, that all the ports and places on its eastern side, to whichsoever of the parties belonging, may freely be resorted to and used by both parties, in as ample a manner as any of the Atlantic ports or places of the United States, or any of the ports or places of his Majesty in Great-Britain.\"\n\nThe fourth article, after mentioning that \"it is uncertain whether the Mississippi extends so far to the northward as to be intersected by a line to be drawn due west from the Lake of the Woods, in the manner mentioned in the treaty of peace,\" provides \"for a joint survey of the northern part of that river;\" and agrees, that, \"if on the result of such survey it should appear that the said river would not be intersected by such a line,\" the parties will regulate the boundary in that quarter by amicable negotiation.\n\nThe fifth article, after mentioning that \"doubts had arisen what river was truly intended under the name of the River St. Croix,\" provides for ascertaining that river, and the latitude and longitude of its mouth and source.\n\nThe sixth, seventh and eighth articles have been executed.\n\nThe ninth provides for persons holding lands in the dominions of one of the parties who are subjects or citizens of the other; and the tenth is a\nstipulation in favour of moral honesty, viz. that neither party shall sequester or confiscate debts or property in the funds, &c.\n\nThe third article of the new treaty provides for and regulates commerce between the United States and the British East-Indies, in the same terms as the thirteenth article of the old treaty, except that the words, *and sailing direct from the ports of the said States* are inserted in the first clause, which now runs thus: \"His Majesty consents that the vessels belonging to the citizens of the United States of America, and sailing directly from ports of the said States, shall be admitted and hospitably received in all the sea-ports and harbours of the British territories in the East-Indies,\" &c.\n\nThe fourth article of the new treaty is the same as the fourteenth of the old one, and stipulates for a general liberty of trade between the United States and the British dominions in Europe.\n\nThe fifth article of the new treaty is the same as the fifteenth in the old one (regulating the duties on ships and merchandize), with two exceptions: the first reserves to the United States the right previously reserved to Great-Britain, of imposing a tonnage duty equal to what shall be imposed by the other party. The second is made by substituting a new clause for the reservation, formerly, made by Great-Britain, of \"the right of imposing on American vessels, entering into the British ports in Europe, such duty as may be adequate to\n\"The British Treaty.\"\n\n\"countervail the difference of duty now payable\non the importation of European and Asiatic\ngoods when imported into the United States in\nBritish or American vessels.\" Instead of this,\nthe following words made part of the new article.\n\"And in the trade of the two nations with each\nother, the same duties on exportation or impor-\ntation of goods or merchandize shall be imposed,\nand the same drawbacks and bounties allowed\nin either country, whether the exportation or im-\nportation shall be in British or American vessels.\"\n\nThe sixth article of the new treaty states that\nthe parties cannot agree about our trade to the Bri-\ntish West Indies; but that \"while they will attempt\nan amicable agreement, both may exercise their\nexisting rights.\"\n\nThe seventh of this, like the sixteenth of the\nother treaty, provides for the appointment of con-\nsuls, &c.\n\nThe eighth of this, like the seventeenth of the\nother, provides for speedy decision on the capture\nand detention of vessels suspected of carrying\nenemy's goods or contraband of war. There is\nadded a promise on the part of Great-Britain, that,\nhereafter, indemnification shall be granted for un-\njust seizure, for detention and vexation.\n\nThe ninth article is the same as the eighteenth\nof the old treaty (respecting contraband), only that\ntar and pitch are excepted from the catalogue, un-\nless when going to a place of naval equipment.\nThe tenth article is the same as the eighteenth of the old (respecting blockade), with the addition, that passengers, not in the military service of an enemy, shall not be taken and made prisoners.\n\nBy the eleventh article, citizens of the United States may carry European goods to the colonies of enemies of Great-Britain (from the ports of the United States), provided that both vessel and cargo be, bonâ fide, American property, that the goods shall have been unladen within the United States, and that (in addition to that part of the duty already reserved from the drawback on exportation) the further sum of one per cent. ad valorem, on such goods shall be paid. They may also export, from the United States to Europe, the produce of colonies of the enemies of Great Britain, provided they, being neutral property, shall have been unladen as before, and that two per cent. ad valorem, be paid on exportation in addition to what is reserved on the drawback. After the expiration of the treaty, all antecedent rights on these subjects are to revive.\n\nThe twelfth article extends to ships of Great-Britain, and of all nations who shall adopt the same regulation, the protection of our neutrality from a marine league to five miles from our shore.\n\nThe thirteenth article is substantially the same as the nineteenth of the old treaty, regulating privateers.\nThe fourteenth is the same as the twentieth of the old treaty, respecting pirates.\n\nThe fifteenth article of this treaty, like the twenty-first of the other, prohibits the subjects or citizens of one party to accept commissions from enemies of the other, and to commit acts of hostility.\n\nThe sixteenth, like the twenty-second of the other, forbids reprisals before a demand of satisfaction.\n\nThe seventeenth is the same as the twenty-third of the old treaty, which, after stipulating that \"the ships of war of each of the contracting parties shall at all times be hospitably received in the ports of the other,\" provides that American vessels driven by \"stress of weather, danger of enemies, or other misfortune,\" to seek shelter, shall be received in ports into which such vessels could not ordinarily claim to be admitted. This stipulation is now made reciprocal.\n\nThe eighteenth article, like the twenty-fourth of the old treaty, prohibits the armament of privateers belonging to the enemies of either, and the sale of their prizes in ports of the other party.\n\nThe nineteenth is the same as the twenty-fifth of the old treaty, permitting ships of war to bring in their prizes and take them away again without payment of duties, and prohibiting the entry of ships of the enemies of either party, which shall have made prize, unless driven by stress of weather; in which case they are to depart as soon as possible.\nThe twentieth is the same as the twenty-sixth of the old treaty, providing for merchants and others in one country when war breaks out with the other.\n\nThe twenty-first of this, like the twenty-seventh of the other, relates to giving up persons charged with murder or forgery.\n\nThe twenty-second is a new article respecting shipwrecks, and promising humane treatment.\n\nThe twenty-third secures to each the rights of the most favoured nation, and declares that \"all treaties hereafter made by either with any nation, shall, ipso facto, be extended in all their favourable operations to the other.\"\n\nThe twenty-fourth engages to join in abolishing the slave trade.\n\nThe twenty-fifth contains the stipulation that this treaty is not to interfere with antecedent engagements. And,\n\nThe twenty-sixth limits the duration to ten years from the exchange of ratifications.\n\nIt is dated the 31st December, 1806; but previous to the signature two notes were given, by the British to the American commissioners. The first keeps open for future discussion a claim of Britain not to pay more on goods sent from Canada or New-Brunswick, into the territories of the United States, than is paid on the importation of such goods in American ships. The second note declares that the King of Great-Britain has directed his commis-\nsioners, before they sign the treaty, to deliver that note, in order that a fair understanding may be had by all parties of his Majesty's views, in consequence of the blockading decree, to which the attention of the American commissioners is invited. The decree is so recent in point of time, and so novel and monstrous in substance, that his Majesty is at a loss to calculate on events; but supposing, however, that it will be formally abandoned, or totally relinquished by Bonaparte, or, in case he is mistaken in that supposition, he rests with confidence on the good sense of the government of the United States, that they will not submit to an innovation so destructive of the rights of neutral commerce. Should he, however, be mistaken in all these points, and the enemy should actually carry into execution his threats, and neutral nations acquiesce in such usurpation, he may probably, though reluctantly, be obliged to retaliate. The treaty secures to the United States so many privileges of neutral commerce, that, at a time when his Majesty and all neutral nations are threatened with such extension of belligerent pretensions from his enemies, without any explanation from the United States what they will do in case Bonaparte attempts to force on them his decree, his Majesty must reserve to himself to act according to contingencies in that particular, the signing of the treaty notwithstanding. And as the distance of the American commissioners from their government renders a previous explanation\nimpossible, his Majesty authorises his commissioners to finish the treaty. This is done under the fullest persuasion, that, before the treaty returns to Europe, from America, ratified, time will discover the formal abandonment or tacit relinquishment, of the enemy, of his pretensions; or in case that should not take place, that the government of the United States, by their conduct or assurances, will secure his Majesty that it will not submit to innovations so destructive of maritime rights. But in case Bonaparte enforces his decree according to its tenor, and if neither by the assurances nor conduct of America a disposition is shown to oppose it, his Majesty wishes it to be fairly and clearly understood, that he will not consider himself bound by the signature of his commissioners to ratify; or in case he ratifies, he will not and cannot be precluded from adopting such measures as may seem necessary for counteracting the designs of his enemy, whenever they shall occur, and be of such an extraordinary nature as to require extraordinary remedies.\n\nBefore we notice particular parts of this treaty, it seems proper to observe that the signature of ministers, confidential agents, under immediate control of the chief executive magistrate, imposes on him the duty to ratify what they have done. Cases may indeed be put in which this duty, resulting from principles of good faith, does not attach. Thus, when the agents employed have either foolishly or corruptly betrayed their trust, and vio-\nlated their instructions, he, from whom their authority was derived, has, in reason and conscience, the right to disavow them: for it is well understood that the general power conferred, by his commission, on a diplomatic agent, is specially limited by his instructions; so that if he promise what they do not authorize, his principal is not bound by the unauthorized engagement. Hence, the prudential reserve, that treaties shall be ratified before they take effect. But in a case of this sort, it follows, of course, that the agents be recalled as well as disavowed. Otherwise it is fairly to be inferred, that they have not exceeded or varied from their instructions, but that their master breaks his faith to remedy the mischief resulting from his improvidence.\n\nIt cannot be forgotten how strenuously the gentlemen now in power used to insist that America, happily placed at so great a distance, should keep herself free from the negotiations and the wars of Europe. The phrase was \"let us have nothing to do with them.\" A respectable federalist once replied. \"Very well, gentlemen. But how will you prevent them from having something to do with you?\" Indeed this, like other maxims of the same origin, is not only questionable on the ground of policy, could we conform to it, but is utterly impracticable. It was used, however, with considerable advantage on certain occasions. If, for instance, it was said of any one whom these gentlemen did not like, he is well versed in the\npolitical concerns of Europe, it was promptly and pertly asked, What have we to do with Europe? And if it was observed that such men should be employed to negotiate our treaties, the complete answer was, We want no treaties. Sometimes it was added, with characteristic sagacity, let us take care of ourselves. But how? Without entering into broad questions of expediency, or examining how far we should connect ourselves with other nations, we shall only remark, in this place, that our administration after publishing those notions as sage maxims of state, year after year, before they came into office, have been occupied in negotiation ever since. With what ability we presume not to say. With what success will hereafter appear.\n\nA prudent man, called on to transact business with which he is unacquainted, applies to skilful persons for assistance. But if in the common affairs of life, with which all are in some degree conversant, prudence dictates the propriety of employing agents of skill and experience, how much more are we called on to entrust such persons alone, with the negotiation of national concerns; seeing that these can be but little known to the greater part of mankind. It would require a diplomatic treatise to show in how many ways an ignorant negotiator may be deceived, to the injury of those whom he represents: a treatise which such negotiator would perhaps disdain to read, and which would therefore be useless, for able men do not\nwant it; and the great mass of the community have sufficient employment in their own concerns. To give, however, some general idea on this subject, we will take one of the usual stipulations in a commercial treaty, viz. that which grants to both parties all the rights of the most favoured nation. This seems, at the first blush, fair and equal. Whether it be so in reality, must depend on what those rights are; and to acquire a knowledge of them, the treaties which each has formed with other nations must be carefully examined. That we may not, on this occasion, offend any particular sect of politicians, we shall seek an example in the farthest regions of Asia. The Emperor of China opens to foreigners only one port in his dominions, where he treats them all alike. All participate in the scanty permission to trade with an exclusive company of Chinese merchants; and all feel the contempt of that people and government for every stranger. Let us suppose a treaty made with the Emperor, by the United States, in which the above mentioned clause should be inserted; and let us also suppose, that by a treaty with some other power, Prussia for instance, reciprocal liberty of trade had been given; each party paying, in the ports of the other, no greater nor other duties than native citizens. The Emperor might, in that case, claim for his subjects, a right to trade with every part of our country as freely as our own citizens, and yet\nconfine us to a single port of his dominions, permit us to trade with none but particular merchants in that part, and oblige us to pay higher duties than his own subjects. True it is, we might object to his claim, and insist that he should pay for a free trade with us the same reciprocity with which it had been purchased by Prussia. We will not enter into the argument, because the main bearing of it is not now before us. We mean only to show, by a plain case, that he who negotiates a commercial treaty ought to know something of the situation in which the other contracting party stands. It would not be amiss, also, that he should know a little of commerce, and of the law of nations.\n\nWe proceed now to make a few observations on the treaty above communicated; and, for the greater perspicuity, shall notice in their order the provisions it contains, and then something which it does not contain.\n\nOn the first and second articles of the old treaty there is nothing to be said; but the third merits a little attention. It is, however, to be premised, that, standing among those which were made perpetual, the British negotiators might have objected, had it been proposed, on our part, to expunge it; although by the course of events it had become void in some respects, and unreasonably burdensome in others. These events, however, entitled us to insist on certain modifications. It will be recollected that this article, after granting the reciprocal right\nof passing through the territories of each other in America, formally excepts the country lying within the limits of the Hudson's Bay Company, and (in consistence with the British colonial system) prohibits American ships from entering the ports or navigating the rivers of his Britannic Majesty; with this single exception in our favour, to pass between Quebec and Montreal in small vessels, subject to British regulations. We, on the other hand, give them a right to enter all our rivers, and to navigate freely to the highest ports of entry: But, with respect to the Mississippi, it was stipulated that it should remain (according to the treaty of peace) open to both parties, with a reciprocal right of resort to all the ports and places on its eastern side.\n\nA person who cursorily views the subject may wonder at the last mentioned stipulation: and indeed the clause relating to the Mississippi in the treaty of peace itself, has, to some, been a matter of surprise. Information, therefore, may not be improper. It is well known, that, by the treaty of peace, the Mississippi, down to the thirty-first degree of north latitude, became our western boundary; and that, by the provisional articles executed the 30th November, 1782, (long before the peace between England and the other belligerent powers) it was stipulated that they should be inserted in, and constitute the treaty of peace. This, however, was not to be concluded until terms of peace\nshould be agreed on between Britain and France. These were so long on the anvil, that our definitive treaty was not concluded until the 3d of September, 1783; near a year after signing the preliminary articles. The Floridas had (as every one knows) been ceded to England, in 1763, and taken by Spain in the course of our revolutionary war. It is an acknowledged principle of public law, that conquest of territory is not complete until a cession of it is made by the treaty of peace. Britain had, therefore, when our provisional articles were signed, a postliminary right to the Floridas; and she had the intention to enter again into possession, which intention was communicated to us. Consequently, when the British and American negotiators stipulated with each other for the free navigation of the Mississippi, each gave a real substantial right, and each received a real substantial compensation. That Great Britain intended to reserve to herself the Floridas, appears from a secret article relating to them in the provisional articles; and her treaty with Spain was negotiated, and agreed to, conformably with that intention. It was stipulated that Spain should restore them, and receive an equivalent. But circumstances, foreign to the present inquiry, having led his Britannic Majesty to decline granting the equivalent proposed, he at length consented to cede the Floridas in full right to Spain. According to our construction of the provisional articles, Spain received that country\nsubject to the right of navigation which we had acquired. She, however, might well contest the point, because the grant was made to us by a power not in possession at the time, nor at any time after. The controversy with Spain respecting that navigation cannot be forgotten. We of course availed ourselves of every argument, and among others asserted the supposed right of those who dwell on the banks of navigable rivers to pass through the territory of their neighbours in their progress to the sea. This question, often agitated, has been decided differently, in fact, according to the different relations of power; but in principle and general practice it has been held that no such right exists. A strong case in point is that of Denmark, who exacts a duty from ships of all nations passing to and from the Baltic. The grant of Britain, therefore, being one ground of our claim, then unsettled with Spain, Mr. Jay prudently inserted a recognition of it in his treaty. The stipulation, in so far as it related to any right conferred on Britain, was indeed a nullity; because the Mississippi, not extending so far north as had been supposed, she did not possess one inch of territory on its shores: neither had she any right, or even pretext to enter its mouth, then in peaceable possession of his Catholic Majesty.\n\nSuch was the state of things when the old treaty was made; but circumstances have materially changed. We have purchased, not only that part\nof West Florida which joins the Mississippi, but the island of New Orleans also. It is true, that, from conduct which we shall not, on this occasion, develope, we have furnished to Spain a good pretext, perhaps a good reason, for withholding our share of West Florida. But let those matters be settled as they may, it is unquestionable that we have acquired the right to exclude the British from the Mississippi. Should it be pretended that the stipulations in the old treaty give them a right to navigate the river, it may be answered, first, that the stipulations are made in reference to, and conformity with the treaty of peace; and, secondly, that our grant extended only to things which we possessed, and can by no fair construction embrace what we might afterwards acquire. This principle of common sense forms an acknowledged maxim of public law.\n\nWe conceive it evident, therefore, that British vessels have no more right to enter the Mississippi than American vessels have to enter British harbours in the West Indies. Whether it would be wise to grant such right may be questionable; but certainly we ought not to grant it without an equivalent, much less in the very article, and, as it were, in the same breath by which we renounce our claim to enter and navigate the St. Lawrence. We have on the shores of this river, and of its tributary waters, a great extent of valuable land; yet, by the sweeping clause which confirms, without modification, the\nfirst ten articles of the old treaty, we should resign all claim to navigate the St. Lawrence from the sea, and afford to the British a pretence to navigate the Mississippi through its whole extent. Such would, we presume, be the construction of British commentators. If denied on our part, it might become the source of cavil, perhaps of quarrel. If admitted, we should discover that the concession of a great and valuable privilege had been unwittingly made, without the slightest equivalent. Should Great Britain wish to trade with us on the Mississippi, she would certainly pay for it, by granting us a like permission on the St. Lawrence. This would do her no injury, nor even occasion any inconvenience. Nay, it might, under certain circumstances, be advantageous to her. To us it is of great and growing importance. Our territory on the waters of the St. Lawrence is worth much more than what we purchased from France, and have now to dispute with Spain, under the name of Louisiana. Our citizens who inhabit that part of America, would be materially benefited if their produce could be sent, in American bottoms, free from war-freight and insurance, to seek the best markets. They are at present confined to the ports of Montreal and Quebec, where they must take the prices British merchants choose to give, or transport their goods one hundred and fifty miles to Albany.\n\nThe fourth article of the old treaty was framed\nto obviate difficulties in the second article of the treaty of peace, fixing as our northern boundary a line to be drawn due west from the Lake of the Woods to the Mississippi. And the fifth was framed to obviate difficulties respecting our eastern boundary.\n\nSubsequently, however, to the year 1794, a survey of the interior of America, by British merchants established in Canada, under the name of the North-West Company, had proved that a line due west from the Lake of the Woods would run north of the Mississippi; so that no further measures were needful to ascertain that point. The River St. Croix, also, had been identified. Two points, however, remained to be settled; the line from the Lake of the Woods to the Mississippi, and the termination of that which was to run north from the source of the St. Croix, on which depends a large tract of country in the district of Maine. Connected also with our eastern boundary, is an object of little intrinsic value (Moose Island), but important to the trade of Massachusetts, and to the revenue of the United States. Another matter of considerable importance, particularly to the State of New-York, had remained unnoticed. This was the ascertaining those islands in Lake Erie, Lake Ontario, and the River Saint Lawrence, which belong to the United States. Much time must elapse before the north-eastern corner of Maine, or the regions at the source of the Mississippi, can be cul-\ntivated or sold; but it was discovered in 1801, that depredations were committed on islands in the St. Lawrence, producing excellent white pine, and on islands near the mouth of Detroit, covered with valuable red cedar. It is, moreover, self-evident, that a tract of doubtful jurisdiction, extending upwards of one hundred and twenty miles along the northern frontier of New-York, from the village of St. Regis to the head of Grand Isle, must impede the regular course of justice, and encourage to the commission of crimes by the hope of impunity.\n\nIn the first year of Mr. Jefferson's administration this matter was brought before Congress, and, after due investigation, appeared of such importance, that \"a sum not exceeding ten thousand dollars was appropriated to defray the expense which should be incurred in negotiating with the government of Great-Britain, for ascertaining and establishing the boundary line between the United States and the British province of Upper Canada.\" This law was approved by Mr. Jefferson on the third day of April, 1802. The object of the Legislature could not be mistaken, for the appropriation of money shows they did not contemplate merely a convention between the American minister in London and the British cabinet, that would cost nothing. The amount of the sum granted proves also that it was the intention of Congress to have the business performed in a solid and durable manner. The President must therefore have known, even if the\nobject had not been specially declared by those who brought it forward, that it was the desire of Congress to ascertain and establish the boundary line by commissioners, who should repair to the spot, designate the limits, and cause proper monuments to be erected. Every one acquainted with our public proceedings knows that a grant of authority is considered as an injunction to perform the act specified. That gentle manner of expressing the public will was adopted from respect for the first magistrate. Moreover, if the two houses should require anything which he deems improper or inexpedient, he will of course withhold his assent; wherefore his approbation implies a promise that he will comply with their wishes. Thus then the law just cited amounts to an order of Congress, and a promise of the President to ascertain and establish the boundary between the United States and Upper Canada. It remains to inquire whether that engagement has been complied with; and if not, what were the impediments.\n\nInstructions were given to the American minister in London, which embraced all the matters above mentioned, excepting only, those contemplated by the law. The minister accordingly treated with the British government; and such was their confidence in him, and their liberality towards us, that he was desired to frame a convention agreeably to his own wishes. He drew it in the very words of his instructions, and it was\nimmediately executed. Every thing asked was granted, and there can be no doubt that, if the object of the law had been brought forward, it would have been as readily and as satisfactorily adjusted. At present it remains as it was, the evils daily increasing.\n\nThe convention, however, made complete provision for the subject matter of the fourth and fifth articles of the old treaty. It fixed our eastern boundary, settled the course of a line from the Mississippi to the Lake of the Woods, and confirmed our title to Moose Island. It was duly sent over to America; was received, and was mentioned by the President to the Congress as a satisfactory arrangement. So far all went on smoothly. But previous to a ratification, the Louisiana treaty came forward, and seems at once to have fascinated our administration. Instead of considering the conditions of this costly bargain, they considered only how they should secure the merit of making it, to themselves. And instead of adopting prudent measures to possess the valuable tract east of the Mississippi, which was clearly within the grant, they set their fancies to work in stretching the boundary north and west, so as to reach the polar circle and Pacific Ocean. Careless of the centuries which must roll away before we can populate our old domain, the President, in his anxiety not to lose one acre of those prodigious deserts which extend from Lake Superior to Nootka Sound, refused to ratify\nthe convention, lest it should be supposed that something was thereby surrendered of what we had purchased under the name of Louisiana. This may seem incredible, and we will not vouch for the truth. The true cause of his refusal may be one of those mysteries which it is convenient to hide from the people. But it is a fact that the convention was not ratified, and that the President assigned, for the omission, the reason just mentioned. Whether it will satisfy our fellow-citizens we cannot pretend to guess. Perhaps, like other things which pass our comprehension, it may be sanctioned by that confidence in his wisdom which numerous individuals and respectable bodies so eagerly announce to the world. We believe, and not without reason, that it gave great umbrage to the British court. They considered themselves as trifled with, and could not help considering those who administer our government as capricious and inattentive to the rules of good breeding and the principles of good faith. When we compare the tenour of the note, above mentioned, from his Britannic Majesty, with this deportment of our President, the advantage, we are sorry to say it, is all on the monarch's side. His commissioners had agreed to a treaty; but, at the moment of signing, a circumstance of extraordinary nature arose, leading to a belief, that, should the claim set up by his enemy be acted upon, and should we submit to threatened plunder, the great duty of a sovereign to protect\nhis subjects might compel him to adopt measures of retaliation. Under circumstances of that sort, the injury we might sustain would be justly imputable to our own conduct. We could not, therefore, have complained: and no previous explanation on his part was necessary. Yet, so scrupulous was the King, so anxious that his reputation for good faith should be not only unsullied but unsuspected, that he provided against all possible imputation by a clear and pointed declaration. Our President, on the contrary, after ordering negotiation, after obtaining a convention, in the very terms he had dictated, and after publicly declaring his satisfaction with it, all at once refuses to ratify. What excuse he may have made, or whether he made any, we pretend not to know; but we hope he did not assign the reason above mentioned; because it is not only insufficient, but dangerous. It is predicated on the false position, that covenants respecting territory we possess will be obligatory as to that which we afterwards acquire. Whence it would follow, that the purchase of Louisiana, and that which we are about to make of the Floridas, must endure to the benefit of England for every commercial privilege in the treaty of 1794.\n\nHaving taken this cursory view of the ten permanent articles in the old treaty, we proceed to those matters, the provisions relating to which had expired. It will be recollected that the gentlemen by whom, and under whose auspices the new\ncompact was formed, had selected, from the whole of Washington's administration, the treaty with England as the object of their peculiar censure, and most pointed crimination. That treaty, though negotiated under circumstances of peculiar difficulty and disadvantage, was devoted to popular odium without examination. It was said to curtail our trade, drain our treasury, surrender our seamen, restrain our manufactures, discourage our agriculture, involve us in war, and degrade us to the state of British provinces. That treaty, concluded by a statesman of sound sense, consummate prudence, and incorruptible honesty; approved by a Senate of no mean talents, and ratified by the illustrious Washington; that treaty, for defending which, men respected for their discernment, their judgment and fidelity, were exposed to the insult of an enraged and misguided populace; that treaty is no more. After fulfilling the hopes of good men, and falsifying the predictions of others; after procuring a surrender of the western posts, and thereby terminating Indian wars; after closing the wound our public faith had received, by laws contravening the treaty of peace; after obtaining, for injury done to our trade by British cruisers, a compensation greater than anything which had ever been paid by one nation to another; and, above all, after securing us from an alliance with France, by which we could have gained nothing, but must, like her other allies, after the loss of our wealth, our\ncommerce, our industry, and our morals, have sacrificed our independence on the altar of Gallic ambition; that misrepresented, decried, and vilified treaty has expired. It expired when its enemies had exclusive possession of the government; when, by the influence of party, they had unlimited power; and when a majority of the people, renouncing the use of reason, reposed in them unbounded confidence. It expired when England, whom they had portrayed, in 1794, as on the verge of bankruptcy, and in the last stage of decrepitude, was not only laden with a new and accumulated burden of debt, but was engaged, singly, in a war against France, Spain and Holland. America, on the contrary, had increased in strength and wealth beyond all example, and possessed resources beyond all hope. In a word, we were released from our engagements with Britain, at the moment of all others, when those now in power, had their opposition been founded in reason or truth, were bound to perform what they said it was so easy for their predecessors to accomplish; and for the omission of which, they branded with foul imputation the ablest and best men in America; men who would do honour to any age or nation. In these circumstances it might be asked, if our rulers have remedied (in 1806) the evils which (in 1794) they imputed to their predecessors as criminal neglect. It might be asked whether England had ceased to impress seamen from American\nvessels, and permitted our ships to protect the goods of her enemy? Whether she had reduced the impost on our raw materials, or taken off the excess of duty on her own manufactures exported to America, beyond what they pay on going to other countries? Whether she has permitted us to enjoy a free trade with her colonies, or modified her navigation act in our favour? Whether she has discontinued the exercise of her right of search, or relinquished her system of blockade? To these questions no satisfactory answer can be given. We shall not, therefore urge them. It is not our object to be severe; for if it were, we should say, Gentlemen, you complained of sacrifices made by the treaty of 1794; and not only opposed the ratification, but tried hard to excite opposition, after it had been ratified, and thereby become the supreme law of the land. Now, then, point out distinctly those sacrifices, if you would exculpate yourselves from the charge of uttering falsehood to excite sedition. And having designated them, give good reason for bearing patiently, now, when there is nothing to be gained, and nothing to be feared, what you insisted should not be submitted to then, for valuable consideration, and to avoid impending danger. In the alternative to which you have reduced yourselves, say—were the American people deceived then, or are they betrayed now? This would be the language of crimination. But we have no wish to criminate. We really believe these\ngentlemen complained so much because they knew so little.\n\nWe proceed, therefore, coolly and impartially to examine what they have done, and to compare it with what they denounced. If their work be better, let them, notwithstanding the more favourable circumstances, have praise and glory. If worse, let us pity and forgive. They insisted, that with respect to our India trade, the old treaty had worked material injury, by depriving us of privileges enjoyed before—That it took away the benefit of coasting between the different ports of Asia, and prevented us from supplying Europe with commodities direct from India—That it was a grievous hardship to be obliged to return home, and unlade the cargoes of the East before they could be vended abroad—That a little intelligence would have taught our negotiator the importance of the privileges he gave up, and a very little firmness have enabled him to secure them. To prove his incapacity, or infidelity, it was observed, that immediately after the treaty was made, an act of the British Parliament bestowed, gratuitously, on all the world, more than we had obtained by great sacrifices. It was vain to reply, that what one law had granted, another might resume—That to secure great objects, by surrendering small ones, was better than to leave both at the discretion of those who might take them away—That although the interest of Britain led her, at that moment, to per-\nmit, that we, and others, should enjoy more than she had granted to us by treaty; yet her interest might change, or new men might adopt new measures, from false or partial views, from pique or caprice. To this, and to every thing else, a deaf ear was turned. The object was not to reason, but to condemn; and therefore assertion was accepted for proof, and clamour for argument. Let us then compare the third article of this new treaty with the thirteenth of the old one, and see how our India trade will stand. Worse than before—much worse. Every old restriction remains, and a new one is added of most serious effect. Our vessels trading to India must now sail direct from ports of the United States. Formerly they could be fitted out and laden in Europe. They could proceed from Germany or Holland to France and Spain, take in brandy, wine, and bullion; thence to Madeira, and so on. This cannot now be done; they must sail direct from the United States.\n\nIt has already been mentioned, that the fifth article of the new treaty contains regulations respecting the duties on ships and merchandize. To estimate their worth, we must compare them with provisions made, on the same subject, by the fifteenth article of the old treaty. This reserved a right to Britain of countervailing, by duties on our vessels entering her ports, the excess of duties paid on European and Asiatic goods in her vessels entering our ports: a difference which operated\nstrongly in our favour, and made us, almost, the exclusive carriers of articles for our own consumption. Britain saw, with concern, the flourishing state of our navigation; and tried to restrain it by making regulations according to the right she had reserved. But the attempt was vain; for she could not lay a burthen on the articles carried to her in our ships, without injuring her general system of trade and manufactures. Thus, although each enjoyed equal rights, ours could be, and were, exercised with advantage; her's were useless. A difference of this sort must exist, when nations, under circumstances materially different, make reciprocal covenants of the same import. Of this the new article before us presents an instance of no common magnitude. It declares that the same duties, drawbacks, and bounties shall be allowed, by both parties, in the trade of the two nations, whether the exportation or importation shall be in British or American vessels. By these few, but potent words, our relative situations are completely reversed, and a few years of peace would nearly annihilate our navigation. This, apparently, liberal provision was always a favourite object of the late Mr. Fox, whose intuitive genius saw clearly its effect. Indeed, rather than fail of obtaining it, he was willing to open, on the same terms, their West Indies to our shipping. It was a favourite also with our President, because it has a sort of philosophic appearance: perhaps also, because it seems to favour those who cultivate\ntobacco. That it would injure them, as well as every other class of the community, is evident, both from reason and experience. It is evident from reason, because that commodity must, like others, be reduced in price, when one nation has a monopoly of the trade; and that must happen when the navigation of the world belongs to one nation. It is evident from experience, because the price of tobacco has advanced as American navigation has increased. But without spending time in seeking the reasons for particular opinions, let us examine the article. There was a time when ships could be built, in the United States, cheaper than in Europe; and although they were navigated at greater expense, yet the advantages of sailing derived from their construction, and the superior activity of our seamen, enabled us to compete for freight with the Dutch and English. But circumstances have greatly changed. Ships, from the high wages given to our mechanics, and the high price to which timber has risen, cost more than in Europe. Sails and rigging are out of all proportion dearer, and so are seamen's wages. In time of peace, insurance will also be cheaper on British than on American ships. Thus, then, we are to contend for the carriage of our produce, and of the articles we consume, with a nation possessing the advantage over us in equipping and navigating ships, as well as in the insurance. Perhaps it may be said that we can build as cheap as the English;\nand it shall, for argument's sake, be admitted that we might build even a little cheaper. But this circumstance would be of little avail when opposed by others so much more powerful. Nay, were they all equal, the superior capital of Britain, and the resulting lowness of interest, would be decisive in her favour. It may be said that trade and money seek a level, which in time would be found. In other words, that the wages of ship-carpenters, black-smiths, rope-makers, sail-makers, and seamen, would fall so low, from being out of employ, that, notwithstanding the higher price of hemp, iron, copper, duck, and cordage, our merchants might (at some future day) resume the contest with better chance of success. Rare consolation! Our merchants being ruined, and, in consequence, the dependent members of our country's commerce reduced to misery, these poor people, to obtain bread for their families, must work lower than men of the same description in Europe, so as thereby to compensate the higher price of materials: in which case a merchant may begin again, if he shall have been so prudent or fortunate as to save a little from the wreck of his affairs. On general principles this result might be admitted. But is it certain that our sailors would remain idle rather than embark in British bottoms? Is it certain that the numerous artificers now employed in building and equipping ships, would quietly starve, instead of seeking other employment? Is it certain that young\npersons would continue to learn trades of such little hope? We acknowledge that different impressions are made upon our minds. We believe that the blow given to our trade and navigation by this improvident concession, would throw them back to what they were twenty years ago. And we have no shadow of doubt, that by the prostration of our commerce, every order of our fellow citizens would be grievously afflicted.\n\nBut if the fifth article of the new treaty be of such portentous import in itself, what is it when connected with that which immediately precedes, and that which immediately follows; or rather, what is it not? We have seen that our ships trading to India must sail from and return to our own ports; and that, in the trade of the two nations, equal duties shall be imposed, be the ships British or American. When these conventions are ratified, nothing more will be needful for Britain, to perfect her system, than to modify the monopoly of her India Company, so far as to permit all her merchants to trade freely with Asia, provided they do not bring Chinese and Indian wares to Europe. A British ship could then sail from London, pick up in the way whatever might be needful to the assortment of her cargo, traffic along the coast of Malabar and Coromandel, proceed to China, and at length come full fraught with tea, coffee, sugar, spices, silks and cottons to the United States. She could undersell her own adventures in our own\nports, and return, laden with our most valuable commodities, and our coin, to reward the industry of those who live under a wise government. If any one should imagine, that we could trade to India, under such disadvantages, we intreat him to apply for information to an intelligent merchant in whom he has confidence. We could show, by facts amounting to a demonstration, the truth of what we advance; but it would occupy too much space.\n\nWe refer to merchants, without regard to their political sentiments. But the India trade requiring large capital, it is possible that small dealers may, under the influence of envy, be not unwilling that foreigners should run off with the benefit which has hitherto cheered and cherished our commercial enterprize. Let such persons look at the next succeeding article, which states, that as the parties cannot agree about our trade to their West Indies, they will attempt an amicable arrangement, and, in the mean time, both may exercise their existing rights. A more cutting irony was never perhaps inserted in a national compact. What are the existing rights? That of the British is to exclude us from their islands; a right they will certainly exercise. If, in return, we prohibit them from bringing the colonial produce from the islands direct to us, we must go and fetch it from Europe; paying, of course, in addition to the prime cost in the islands, a freight across the Atlantic in their ships. But the mischief would not stop there. They would\nnot give us the trouble of fetching it, but would themselves bring it out; for which we must also pay. They could underwork us, for the reasons already assigned; besides, their ships, which must otherwise come in ballast to take a cargo of lumber to the West Indies, or other bulky produce of the United States, would for a very light freight bring us rum and sugar. Nay, they would have a still greater advantage. Returning to Falmouth from the West Indies, they would only go through the ceremony of entry and clearance, and, saving all charges and commissions, come directly over to the United States. To exercise our right, therefore, in this way, would only do us mischief. It may, perhaps, be supposed, by some, that we could supply our wants from the French or Spanish islands. But it is easy to see, that every other nation would be as eager to secure to itself the whole advantage of its colonial trade as Great Britain, and indeed we have found it so by experience. Besides, it is a strange way of conducting business to make a very bad bargain with one, in the very uncertain hope of a better bargain with his neighbour. We have, however, another right which is not impaired by the treaty. It leaves us at liberty to make them pay roundly on the export of our produce to their islands; but this would be a bounty on the agriculture and arts of Canada and Nova Scotia, than which nothing could be more agreeable to the British government. Such duty, however, cannot be laid;\nfor although the right is not impaired by the treaty, the exercise of it is inhibited by the constitution. To say, therefore, with apparent equity and equality, that both may exercise their existing rights, is bitter mockery to men in our pinching condition.\n\nIt has often been remarked by observers of human nature, that the fond and foolish many (in the blindness of ignorant passion) run counter to their own wishes, and do precisely what they strive to avoid. If such inconsequence were chargeable only to those who, enrolling themselves under the banners of faction, have the prescriptive right to be absurd, it would be so much in the common order as not to deserve a moment's notice. But the beli-wethers of the flock are, generally speaking, as poor and simple cattle as the rest. It is supposed, that they who direct our affairs, if they have any special sentiment beyond the desire to continue in office, are moved by a snarling, snappish humour towards England. Indeed, they have reason to be somewhat angry with the British government, because its measures have defeated their claim to the character of statesmen. It is certainly owing, in some degree, to the efforts of that government, that England has neither become bankrupt, nor been enslaved, nor starved, nor subdued by France; all which they have constantly predicted for the last fifteen or twenty years, with a zeal and perseverance the more laudable, as they derived no support from reason, truth, or probability. Men who look\nonly skin-deep for motives, and take words for the evidence of things, were led to suppose that they who coupled Washington and Britain together, for the sake of abusing both, were as much the enemies of one as the other; and that, when in power, their measures would be marked by wrath against the lords of the ocean. But no opinion could be more unfounded: so far, at least, as action is concerned, the hostile temper, if it really exist, has produced only acts of friendship and good will. There has indeed been much complaint, much cross language, and not a little of idle, empty menace. But what evidence have our rulers given of a disposition to injure Britain, or even to secure our country against her power? Have they prepared a fleet to join other powers in vindicating the liberty of the sea? Have they fortified our ports against that aggression which we have to apprehend from Britain alone? Have their regulations at home, or negotiations abroad, assisted the spirit and enterprise, which have raised us to be the second naval and commercial nation? Surely they have not. They have boasted, negotiated, been flattered, and duped. They have laid our commerce and navigation at the feet of Britain; so that a stranger who, deaf to the clamour, should attend only to the conduct of our rulers, might suspect that some of that British gold, so much talked of, had found its way into their pockets. We take this occasion, however, to declare, that we harbour no such unworthy idea.\nIn the eighth article, after agreeing, as in the seventeenth of the old treaty, that all proper measures shall be taken to prevent delay in deciding the cases of ships and cargoes brought in for adjudication, on the suspicion of enemy's property or contraband of war, and in the payment or recovery of any indemnification adjudged or agreed to be paid to the master or owners: the British commissioners have added, on the part of their sovereign, a promise, that hereafter indemnification shall be granted for unjust seizure, and detention, and vexation. This gratuitous covenant is a master-piece. The tribunals were bound by the principles of public law to award, adjudge, and enforce prompt payment of indemnification for the injuries specified. What, then, is the effect of this promise? It neither imposes a new obligation on the admiralty courts, nor invests them with a new authority; but rather implies a doubt with respect to the law; because, if that be acknowledged, no auxiliary promise can be required, unless indeed the national justice be questioned; in which case no promise can be relied on. Thus, then, the law, which, founded on reason and equity, would be liberally construed, is reduced to a gratuitous engagement; which being penal, as regards delinquents, will be construed strictly. Wherefore the power of the court remaining as it was, the exercise of it is restrained; and our right is rendered less clear, and must become less productive. Such appears to us the necessary\neffect of any such provision, be the form what it may. But the British commissioners, by inserting the word hereafter, have taken from us the claim to compensation for injury, already, sustained. And our negotiators, by admitting that word, have given up thousands due to their fellow-citizens. American suitors, in the British courts of Admiralty, will now be told, that under the law of nations, as it stood before this treaty, violence would have been punished, and indemnification been granted for injuries sustained; but the two nations having agreed to bury the past in oblivion, the hands of the judge are tied up by the act of his superiors. That he cannot grant, neither ought they to ask, what the two governments have agreed to relinquish.\n\nThe dexterity of the British commissioners is again displayed in the eleventh article. The questions which gave rise to a pamphlet called War in Disguise, and to a book written by Mr. Maddison, are fresh in the recollection of all. This book, indeed, as was shrewdly observed in the house of representatives, gave up the matter in dispute at the very outset. By quitting the ground of right, derived from, and the appendage of, national sovereignty, to rely on a supposed general consent, which results from convenience and changes with circumstances, our Secretary of State unfortunately played his game into the hands of his adversary. We cannot admit, however, that a weak argument\nshall destroy a good cause. The case has been stated by others, whose reasons we will neither repeat nor refer to; because the question is recent, and because the general opinion (not only of America but of Europe) is well established. The right of a neutral to proceed from his own ports to those of a belligerent, with articles his own property, not contraband of war, is admitted; and the pretended right to examine how he came by the goods, is considered as an odious usurpation. It is, we say, a principle, generally, assented to, as resulting from the nature of sovereignty, that no person shall inquire into the means by which, or the place from which, property has been brought within the territory of a neutral state, further than as it may serve to cast light on the question, whether it belong to a neutral or belligerent. This principle seems to be so intimately blended with the national sovereignty, that it cannot be surrendered. We have no view to the convenience or profit of merchants. On the proper occasion we shall pay those gentlemen the respect to which they are entitled; but we do not consider this as the proper occasion. We are now engaged in matter of a higher order than commercial interest; one which is not to be tested by considerations of profit and loss. We must, therefore, examine the article in its relations to a national right, which, in our opinion, it has surrendered.\n\nIt begins by permitting us to carry European goods to the colonies of enemies of Great-Britain,\nfrom the ports of the United States. Thus one point is given up; the right of trading freely from one port of a belligerent to another; a right acknowledged and asserted by all good writers on public law. It is not our object to please a party, but to establish truth. We anxiously wish that our country may take a firm stand on principle: and that her honour, dearer to us than the blood which warms our heart, may not be compromised in a contest of doubtful complexion. Wherefore, that we may be well understood, and that we may not be misunderstood, we promise and acknowledge, that, while the powers of Europe maintain their colonial system, and relax from it, occasionally, under the pressure of necessity, or from the prospect of advantage, there is a presumption that trade carried on by neutrals, between a belligerent country and her colonies, is merely a cloak and cover injurious to the other belligerent. He therefore can, rightfully, exact strong evidence that the property is neutral. And since melancholy experience proves that, on such occasions, perjury appears, at the call of interest, to protect fraud, it ought not to be wondered at, that he should so far extend the force of presumption as to receive it in contradiction to testimony. When, under this aspect, the matter is discussed with the neutral government, both stand on fair ground. The neutral, whose right of sovereignty is not questioned, will, from a sense of justice, agree to regulations by which the property in goods shall be more clearly ascertained.\nAnd since, after all possible checks, fraud will be committed when the opportunities are inviting, he may, from the same sense of justice, be induced to admit, that the circumstances attending such a trade are sufficiently strong to justify the induction of the belligerent. And it would not be at all improper for him to agree on severe penalties, to be exacted from those who persist in covering the goods of one enemy from the pursuit of another. We venture to believe, that this fair and candid course would subserve the interest of the neutral himself. If, however, from an interested connivance in the fraud, or from partiality to the other belligerent, he will not enter into fair stipulations, the rights of the adverse party not only remain, but are strengthened; and he may justly extend the exercise of them: always understood, that the neutral who thinks himself aggrieved may resort to arms. In this fair course there is no assumption of superiority on one side, no submission to insult on the other. The independence of the neutral is not questioned; his sovereignty is not violated. The fiscal result would, indeed, be the same, whether it be assumed as sufficient proof of French property, that goods on board an American ship were going from Bordeaux to Martinique, or declared that the trade not being permitted in time of peace, the property, though American, shall be confiscated; but the consequence, as it affects our honour, would be widely different. Besides, the former principle\nis of necessity bounded within narrow limits; but\nthe maxim, that a neutral shall carry on, only, his\nusual and accustomed trade, may be extended so as\nto embrace whatever the belligerent may desire.\nOnce agree to it as a principle, and attempts to\nlimit the operation will be vain. Moreover, it must\nbe always remembered, that a stipulation in one\ntreaty is more fatal to the question of right, than\nthe pillage of a dozen wars. The pillager may in-\ndeed cite, as a precedent, his former violence on\nevery new occasion. The argument that one injury\nwill justify another, has been frequently urged, and\nas frequently refuted; but when, by solemn com-\npact, one party acknowledges as a right the inju-\nrious claim of another, he is bound by his own act,\nand must submit to the consequence.\n\nThe article before us permits the carriage of\nEuropean goods, from our ports, to the colonies\nof enemies of Great-Britain, under three conditions.\nThe first is, that vessel and cargo are bonâ fide\nAmerican property. This condition is proper and\nconsonant to public law. Had the subsequent re-\nstrictions been stated as conventional evidence of\nthat fact, they would, in the present point of view,\nhave been unexceptionable. But standing as they\ndo, distinct additional conditions, they are the ac-\nknowledgment, on our part, that we have not the\nright to carry our own property from our own\nports to the colonies of a belligerent; an acknow-\nledgment which ought not to be made.\nThe second condition is, that the goods shall have been unladen in the United States. Here another unfounded claim of Britain is admitted; a claim which, with all the deference due by citizens of one country to the government of another, we presume to believe she was wrong to make, because she would hardly permit it to be exercised against her own merchants. We feel a strong persuasion, therefore, that if this point (which had been assumed by her courts) had been properly represented to her ministers, they would have abandoned it. But certainly, even if, from prudential motives, we should submit to such an exercise of power, we ought never to acknowledge that it is legitimate. The stipulation in this treaty is precisely what Britain must desire, and, every way, injurious to us. In relation to our claims for the past, her courts will say, you have deliberately assented to our principles. In future wars they will set it up anew, and insist, that as we submitted before from rational conviction, (and we shall hardly be disposed to stultify and brutify ourselves by alleging that we acted from folly and fear,) we ought again to submit. But, should it so happen that we, being at war, while Britain is at peace, should claim the privilege she takes, her government would resist; and we should find ourselves in the wrong. They would frankly admit, that, to promote the interests of the war in which they were engaged, they had found it necessary to\nmake an extraordinary stretch of power. That we had, indeed, complained, and our government had, for the form sake, remonstrated; but, wishing well to their cause, and desirous of promoting their success, as far as it could without breaking with friends at home, or making enemies abroad, had thought it, on the whole, most advisable to submit. They would go on, in support of this assertion, to observe, that when matters came to be adjusted, by treaty, an article was inserted confirmatory of the practice. But so far were the parties from admitting any general principle, or supposing that we should ever think of retaliating, that the article related solely to us, provided for a special case of the moment, and contained no reciprocal stipulation. We should then be politely told, that, to make the cases analogous, we must show that preponderance of force to which we had thought it reasonable and just to submit. This would be no easy matter. But, a matter much more difficult would be to bend the high spirit of England, and persuade her to brook national degradation. While on this part of the subject, it may not be improper to add, that the language which, under the circumstances supposed, it might be competent to Britain to hold hereafter, it is competent to France to hold now. Our assent to this unequal stipulation may be considered as evidence of partiality. Our government may, in proof of its love to France, quote its friendly professions;\nbut, whether Napoleon and Benevento repose in the President's professions that confidence which many among us express in his talents, may admit of some doubt.\n\nThe last condition under which we are permitted to exercise our right, is, that we shall lay an export duty of one per cent. on European goods sent from the United States to colonies of the enemies of Great-Britain. Hitherto the sacrifices made affect only commercial interest and national honour; objects, for which much indifference has formerly been expressed by some great men of the day. They freely declared, that for neither they would risque the chance, nor bear the expense of war. They were, nevertheless, loud in expressions of love for the constitution. That constitution, once the theme of their execration, is now the idol of their affection. And with reason; for they have found out the secret of turning it to good account. But the constitution says, in express terms, \"no tax or duty shall be laid on articles exported from any State.\" And the treaty exacts, as a condition on the carriage of goods from the United States to the islands, that in addition to the duty reserved on exportation from the drawback, the further sum of one per cent. ad valorem shall be paid. We are not among those who consider the restriction in our constitution as wise. We know it to be among those which, unreasonably, insisted on by some members of the national\nconvention, was submitted to by others, from \"that\n\"deference and concession which the peculiarity\n\"of our political situation rendered indispensable.\"\nThe clause, however, is there. Legislative inge-\nnuity will, no doubt, be exerted, if needful, in re-\nconciling it with the article of the treaty. Mer-\nchants will perhaps be told there is no compulsion.\nThey may pay or let it alone. If they pay, the\ncustom-house will give a certificate. If not, they\nmay depart and take their chance. Perhaps, in\ngreater tenderness for the constitution, it may be\nthought advisable that the legislature be silent,\nleaving matters to be settled between the execu-\ntive and the merchant. This would be an excel-\nlent contrivance; for it would enable the Presi-\ndent, and two thirds of the Senate, who (as every\nbody knows) have unlimited confidence in him, and\nwere chosen for that very reason, to tax the good\npeople of these United States; provided they can\nget the assistance of a stout maritime power. It\nmight be asserted, on the part of Great-Britain,\nthat the soldiers of Napoleon, who undergo hard-\nships scarcely credible, and have entreated their\nenemies to terminate at once their misery and ex-\nistence, would certainly revolt, if physical as well as\nmoral means were not employed to secure their\nobedience—That the narcotic effects of tobacco,\nwhich they use in profusion, have astonishing in-\nfluence in calming nervous irritation; whence it is\nevident that Napoleon's troops could not bear up\nunder their calamities, without a pipe of tobacco. This argument has the merit of resembling that by which it has been demonstrated, that France carries on the present war with sugar and coffee received from this country. It would, therefore, equally justify the prohibiting our merchants to furnish the enemies of Great-Britain with tobacco, under the usual penalty of confiscation. After a few months more of able negotiation, a new clause might be tacked to the treaty, allowing tobacco to go free, provided an export duty were paid of ten per cent. This would enable the collectors, always, however, with the merchant's consent, to levy the ten per cent. Experience has proved, that, if no direct application be made by the tax-gatherer, this enlightened nation cares not what is collected, nor how it is applied. Some of them, indeed, suspect that possibly they may pay, in the price of necessaries they consume, a small part of the duty on imports. But this new contribution would come so completely out of the merchants, that it would be quite delightful. It might, moreover, be applied at the discretion of the President, and save the necessity of asking Congress for appropriations to objects undefined. This would be another prodigious advantage. For although such appropriations once supposed to be unconstitutional and dangerous, are now found to be proper and very convenient; yet some friends of government feel a little squeamish, look a little\nawkward, and have somewhat of a qualm in voting for them. Wherefore, as it is troublesome to deal with men of timorous conscience, it would be no small improvement on our system, so to arrange matters as that business might go on smoothly without their assistance. It would, moreover, be of use to the poor men themselves, who find it rather difficult to satisfy certain troublesome creatures, called constituents, that the new congressional game of blind-man's-buff is altogether fair. Hitherto, indeed, they have got through tolerably well by the aid of that excellent word confidence; but since nothing human is immortal, so it begins to be suspected that confidence, even in the President, may at length expire. Some new expedient, therefore, ought to be adopted. And what so proper as to raise taxes by treaty?\n\nThe article having provided for our trade with the belligerent colonies, and prudently left the trade from them unnoticed, so that, from any thing which appears, Britain may seize colonial produce coming, from her enemy's ports, to the United States, goes on to regulate the export of such produce to Europe. It is permitted under conditions similar to those just noticed. The goods must be unladen, and they must pay an export duty of two per cent. ad valorem. Let it not, we pray, escape the reader's notice, that the conditions imposed by no means affect what is called the neutral carrying trade; that is to say, the unfair practice of covering, as\nneutral, the goods of a belligerent. They neither arise out of the right which one enemy has to attack and destroy the commerce of another, nor do they tend to check the abuses about which we have heard such loud complaint. If, indeed, enemies' goods were subjected to the charges of landing and relading, together with the duty on export, while bona fide neutral goods were exempted, it would doubtless discourage the illicit trade. But this was not the object. The whole scope and tenor of the article is to lay our trade under impositions and disadvantages, so as to favour and encourage the trade which the English (by connivance of their government) carry on with their enemies.\n\nWe have before us a copy of royal instructions to the Lieutenant-Governor of Jamaica, dated at St. James's, the fifth day of July, 1804, in the forty-fourth year of his Majesty's reign. They run thus:\n\n\"Whereas we have thought it expedient that permission should be given to vessels belonging to the subjects of his Catholic Majesty, having not more than one deck, to trade between the free ports established in the island of Jamaica and the Spanish colonies in America, according to the regulations of the several acts for establishing free ports in our West-India islands, notwithstanding any hostilities that may occur; and whereas we have thought it expedient, that, notwithstanding such hostilities, permission should likewise be given to British vessels, navigated according to the laws\n\"now in force, to trade between the said free ports\n\"in the island of Jamaica and the Spanish colonies\n\"in America, provided such British and Spanish\n\"vessels shall have a license from the Lieutenant-\n\"Governor or Commander in Chief of the island of\n\"Jamaica, and provided such British and Spanish\n\"vessels shall import, into the free ports in the island\n\"of Jamaica, such goods only as are hereafter enu-\n\"merated, viz. wool, cotton wool, indigo, cochi-\n\"neal, drugs of all sorts, cocoa, tobacco, logwood,\n\"fustick and all sorts of wood for dyer's use, hides,\n\"skins and tallow, beaver and all sorts of furs,\n\"tortoise shells, hard wood or mill timber, maho-\n\"gany and all other woods for cabinet ware, horses,\n\"asses, mules and cattle being the growth and pro-\n\"duction of any of the colonies or plantations in\n\"America belonging to the crown of Spain, and all\n\"coin or bullion, diamonds or precious stones,\n\"coming from thence; and provided such British\n\"and Spanish vessels shall export from such free\n\"ports only the said goods and commodities,\n\"and also rum, the produce of any British island,\n\"and also all goods, wares, merchandizes and ma-\n\"nufactures, which shall have been legally import-\n\"ed, except masts, yards and bowsprits, pitch, tar,\n\"turpentine, and all other naval stores and to-\n\"bacco.\n\n\"We do hereby authorize you, our Lieutenant-\n\"Governor, or Commander in Chief for the time\n\"being, of the island of Jamaica, to grant licences\naccordingly. And do further require and en-\njoin you to give all necessary encouragement and\nprotection to such Spanish vessels, and likewise\nto all British vessels trading between the free\nports in the said island of Jamaica and the Spa-\nnish colonies in America, under the regulations\nherein before prescribed.\"\n\nA perusal of these instructions will show the\ntrue value of what has been said in courts, and\nprinted in pamphlets, about reducing the enemies\nof Britain by destroying the resources of their\ncommerce, and about the injury done to her mili-\ntary and naval operations by the unjust and unlaw-\nful interference of those wicked neutrals. Go to\nthe bottom of the business, and we find a merchan-\ntile struggle for money, in which the government\nassists by its power, its influence, and its negotia-\ntions. Mere counting-house politics. Not the most\nremote idea of injuring France or Spain, by inhibiting\nan intercourse with their colonies, but a scheme\nto engross that trade to themselves. Accordingly,\nwhen they negotiate with us, the single object is\nto burthen and trammel our trade with such\ncharges and regulations as may give their mer-\nchants a preference. Our negotiators have kindly\ngone along with theirs, and, in the excess of their\ncomplaisance, have ceded, not only the interests of\ntrade, but the attributes of independence.\n\nThat nothing might be wanting to complete the\ngoodly work, this eleventh article closes with a de-\nclaration, that, after the expiration of the treaty, (viz. in ten years) all antecedent rights on these subjects are to revive. And thus we acknowledge as rights, provided the exercise be suspended for ten years, claims which should never be admitted under any pressure of necessity. We may, nay, we must, submit to superior power; unless, as in our war for independence, it will please the Almighty to smile on and reward our resistance of oppression by his holy favour. But there can be no necessity, use or advantage, in acknowledging oppression to be justice. If we dare not resist, let us quietly submit. But let us not kiss the rod, or, like prisoners of the inquisition, applaud its clemency while we writhe in torture.\n\nThe twelfth article, considering the love of peace which our rulers profess, and the defenceless condition to which they have reduced us, passes all comprehension. It extends to Great Britain, and to all other nations who would adopt the same regulation, the protection of our neutrality from a marine league to five miles from our shores. This being agreed on, if a Spanish cruizer should, at four miles distance, take a British ship, what are we to do? According to the treaty she must be restored. According to general practice she is a good prize: And if we judge from experience, captors are more inclined to keep bad prizes, than to surrender good ones. They would undoubtedly and justly refuse to give up the British ship. The British minister\nwould as undoubtedly and as justly insist on the performance of our stipulation. What are we to do? Shall we go to war for the recovery of a British ship lawfully taken by a Spaniard, while we permit the same Spaniard, and every one else, unlawfully to take our own ships? Moreover, if the President should determine to take and restore the prize, what are his means? His frigates are fast in the mud. He has no public force at command, and it has been the undeviating policy of his administration not to have any, lest he should be held accountable for the use of it; or rather, for suffering it to look idly on, while our fellow-citizens are insulted, plundered, killed. What are we to do? The British insist. The Spanish refuse. Take what side we will, we must be in the wrong. The President might indeed make excuses and apologies. He is said to be able in that line. But the English are not in the habit of receiving apologies instead of cash. We should be charged with perfidy. We should be threatened with reprisals. What are we to do? Nothing remains but the old expedient of paying for peace. Congress must then appropriate to that object some of the money collected from trade; for they have no other. And thus our merchants, after being pillaged by both parties, must pay them for plundering each other.\n\nThe clause in the twenty-third article which declares, \"that all treaties hereafter made by either\n\"with any nation shall, *ipso facto*, be extended in all their favourable operations to the other,\" is very broad. By the second article of our treaty with France, \"the King and the United States mutually engage not to grant any particular favour to other nations, in respect of commerce and navigation, which shall not immediately become common to the other party, who shall enjoy the same, freely, if the concession was freely made, or on allowing the same compensation, if the concession was conditional.\" Our treaty with Sweden contains the same clause. The unlimited terms of this new stipulation, especially when compared with those more guarded of preceding compacts, will support a claim of Great Britain to possess, without compensation, privileges we may grant to others for valuable consideration. To say the covenant is reciprocal is a fallacy; for it is one thing to be reciprocal in form and words, but another to be reciprocal in fact and effect. If we mistake not, it is substantially the same as if we had stipulated, solely and gratuitously, that Britain shall enjoy every privilege we may allow to any other nation. Indeed, our agreement with France and Sweden, though more fair, was not quite safe. Let it be remembered that old nations have long since formed their systems of finance, commerce, and navigation; which, by the aid of experience, and in the lapse of time, have been made to accord with their extent, population, soil, climate, productions, and\nmanufactures. There is, then, little probability that any change will be made, from which we can derive advantage. But the case with us is widely different. That our power and wealth must increase; if our union be preserved, and we are governed with tolerable discretion, can admit of no doubt. We shall probably both acquire and grant privileges in our diplomatic transactions. We ought not, therefore, to tie up our hands, by prospective conditions with any nation, and least of all with Great Britain; because she has long since brought her commercial system to perfection. The covenant on her part must be sterile. We can derive nothing from it; but are bound by it to treat with the rest of the world, under her pleasure, and for her benefit. We preclude ourselves from granting an exclusive privilege, whatever advantage might be gained, or evil avoided. If the proposition be made, we must answer, it is not in our power; we are already bound to England, and must ask her permission.\n\nThe twenty-fourth article presents to us a fair flower of philosophy. We agree to join in abolishing the slave trade. As a comment on this article, we take leave to introduce what we consider as a contemporaneous exposition. In the British House of Commons, on the twenty-third day of February, not two months after the treaty was signed, Lord Howick (the British minister for foreign affairs), after stating that the slave trade was both unjust and\nimpolitic, founded in robbery, kidnapping, and murder, and afforded incentives to the worst passions and crimes, and, therefore, ought to be abolished, added, that there were some general points that had been adduced in its support to which he was desirous of adverting. Amongst these was the argument which had been urged, with earnestness, that the principle of the abolition of the trade would lead to emancipation. To this objection the minister frankly replied, that at present the negroes were not in a condition to be immediately emancipated; but he had no doubt, and would not conceal his opinion, that the effect of abolishing the trade would be to abolish slavery itself. We are not the advocates of slavery. We do not consider ourselves authorized to hold our fellow-creatures in bondage. But we do not arrogate the right of judging others; nor presume to make our conscience a rule for theirs. We are bound by compact to our brethren in the Southern States, and cannot in good faith attempt to wrest from them what they consider as property, and without which their other property would be good for nothing. Nay, if we had lawful authority to emancipate the slaves south of Pennsylvania, we should, with the example of St. Domingo before our eyes, proceed with caution, and tremble with the apprehension, that, in remedying an evil, we should let loose a legion of crimes. Europeans can speculate at their ease on events so distant, as to appear more like history than action.\nIt is otherwise with men on the spot, who see the rage of incarnate devils, and hear the shrieks of their victims. When statesmen of wisdom and experience speak the language of enthusiasm; when they who can resort to arms for a few seal-skins on the other side the globe, are thrown into spasms of sensibility for the sufferings of negroes, who are dancing all the while to the sound of their banjos, there is reason to suspect something beside sentiment. If we take the trouble to examine facts, we shall find the British colonies full manned with Africans, while those of their rivals want hands. St. Domingo must, when subdued, be peopled anew. Moreover, if all these colonies were sunk in the sea, it would but enhance the value, and increase the revenue, of the British dominions in Asia. To abolish the slave trade, therefore, is good sound British policy. To bottom the measure in argument, on these efficient principles of interest, would not sound so well as to boast of philanthropy, and express the detestation of robbery and murder. But what motive have we to make the above-mentioned compact, and what is to be its effect? Was each party, in the apprehension that his conscience would not keep him to his duty, desirous of bolstering up the moral sense with diplomatic engagements? Or was it intended to preclude debate in Parliament and in Congress? If domestic operation alone was intended, diplomatic engagements were neither necessary nor proper. The\nrespective legislatures should have been left at liberty. If it was intended to form an alliance offensive and defensive against the slave trade, our ministers should have inquired a little into our means and situation. Are we, we, the pacific, to commence a career of knight-errantry for black dulcineas? Are we, we, who keep thousands in bondage, to declare that no one shall follow our example? Truly it would seem as if we were doomed to fight for every thing except our own interest, our own rights, and our own honour.\n\nWe pass over the rest of what this treaty contains, to consider what it does not contain; previous to which, however, we must observe that, notwithstanding our willingness to excuse the administration, by imputing its defects to the gentlemen negotiators, we are deterred by a belief that such imputation would be unjust. If, indeed, those gentlemen had been recalled, we should be convinced the fault was theirs. But they are continued in office. The administration, therefore, considers them as still deserving of confidence. They have then conformed to their instructions, and the treaty is such as they were directed to make. Hence we are driven, in spite of ourselves, to conclude that what has been said is true.—That the treaty was sent back, not from any disapprobation of its contents, but because it does not contain a relinquishment, by the King, of his claim to take British seamen from the merchant vessels of America. If\nit be true that our government have taken their stand on this ground, and for the reasons just assigned, this seems to be unquestionable, we are brought to a point which demands our serious consideration. If reason be against the British claim, let it be resisted; but if otherwise, God forbid we should engage in war to establish injustice.\n\nThe question is two-fold; whether England can rightfully compel her native subjects to man her fleets, and, if so, whether she can lawfully exercise that right over such of them as are in the ships of another country. Let it be premised, that as they pretend no right to take a native American, that case is not within the scope of our inquiry. Let it also be premised, that when nations are agreed respecting matters of right, the way is open to expedients for mutual convenience. Matters of interest frequently interfere, and require appropriate arrangements by mutual concession, for mutual advantage. But matters of right are of different nature and sterner stuff. They cannot interfere, unless where nations are at war; because it cannot be right for one to prevent what another has a right to perform: Wherefore the right being established, submission is implied. Were it otherwise, war must be the natural condition of man; because the right to do on one side, and the right to oppose on the other, constitute precisely the state of war.\n\nIt is a first principle of every government, that it can rightfully command the military service of its\ncitizens and subjects. If this be not admitted in America, we are in a wretched condition. We have no fleet; we have not, and, it is to be hoped, we never shall have, a standing army. If, therefore, the militia cannot be compelled to defend their country, what is to become of us?\n\nBut it is said that, admitting the general principle, an exception is to be made in favour of those who leave one State and swear allegiance to another. The British government, however, insists, that no man can divest himself of the duties which he owes to his country. Other nations maintain the same principle; which, both by reason and by general consent, forms a maxim of public law. The usual stipulation in treaties, that the subjects or citizens of one of the contracting parties shall not engage in the military service of an enemy of the other, rests on this foundation, and would, without it, be an idle phrase. It is true that a different doctrine is maintained by some who pretend to instruct us in matters which concern our intellectual nature, our moral duties and political rights; matters which, having escaped the statesmen and sages of antiquity, have (as they say) been lately discovered. We, however, are not disposed to adopt novel doctrines, but presume that those who have gone before us, came into this world with as much sagacity as those lately born. And we know that many of them, with equal opportunities for reflection, had greater advantages of experience in national affairs.\nPutting aside, however, the objection of novelty, others present themselves to the most cursory observer, which it would be tedious to enumerate. Suppose that Arnold, after swearing allegiance to the King of Great-Britain, had returned to this country, and claimed the rights of a British subject. Surely there would have been but one sentiment, but one voice. Light minds may amuse themselves in blowing up the bubbles of metaphysical wit, but sober men will not stifle those chaste and righteous sentiments which bind them to their country. They will not permit rash innovators, \"clothed in 'a little brief authority,'\" to abolish maxims, venerable, alike, for their antiquity and wisdom. In a word, they will not relinquish the undoubted right of America to the military service of her citizens. If, however, it should be deemed proper that each be at liberty to take advantage of the social compact while it suits his convenience, and to release himself from its obligations when called on to perform them, let it be so enacted. It will then be law for us; but it will not thereby become law for other nations.\n\nIt may be said that a man has a natural right to change his country and his allegiance. But it will be difficult to adduce proof that will not equally prove each individual to be above the law; or what is tantamount, that each can, at his pleasure, release himself from its authority: whence it must follow, that the law, binding only those who choose\nto be bound, is a nullity; a thing which not only does not exist, but which cannot exist. And after all, even if we should adopt that extravagant theory, the difficulty must remain: other nations will not dispute with us the doctrinal points we assume to govern or to amuse ourselves; but they will not permit us, under cover of our doctrines, to invade their rights. It behoves us, therefore, before we carry such notions into practice, to inquire whether we are prepared to force them upon other nations; for we must either embark in that extreme project, or acknowledge the rights which they exercise over their own subjects. So little, indeed, are the advocates for the supposed right of expatriation in harmony with themselves, that they have, on a different but notable occasion, strongly insisted that no one nation has a right to interfere in the domestic arrangements of another. We do not admit this axiom in its fullest extent, because we conceive that when it is a domestic arrangement of one nation to subjugate others, all have a right to interfere, on the common principle of self-preservation. But no man, we believe, ever claimed for England a right to determine what laws the French Republic should make or repeal respecting French citizens. Neither has it, as yet, been directly asserted that such power can be justly exercised over us by the French Republic. We conclude, therefore, it will not be pretended that we have such right over Britain. And if we have\nnot, it must be admitted that an Englishman, coming to America, comes subject to the obligations imposed by the laws of his native country; which obligations are known, and of course excepted in the compact by which he becomes an American citizen. If this be admitted, and it can hardly be denied, the difficulty about certain papers given to seamen, and called protections, must vanish. The protection cannot avail against the prior right of his native country. Indeed, the facility with which it is obtained, in many of our sea-ports, is a sufficient reason why it should not be respected. It is frequently granted to men just arrived from the British dominions, whose language betrays the fraud; and who, when afterwards questioned by a British officer about the alleged place of their nativity, cannot tell whether it is to be found in New-England or Virginia. Surely it cannot be expected that a powerful nation, whose existence is staked on the chance of war, will be the dupe of such clumsy contrivance.\n\nIt has been already observed that a British subject cannot, according to the laws of that country, disengage himself from the obligation to render military service; and that we cannot release him, because we cannot make or repeal the laws of England. To this it will be replied, that, having uncontrollable authority to legislate for ourselves, our act of naturalization, by conferring the right of citizenship, cancels anterior incompatible duties. And\nthis being a case in which supreme authority has made contrariant provisions, the last must prevail. Certainly it must, if they who made it had a right to do what they are supposed to have done. Enough has already been said on the right. We shall only add here, that no question can arise while the party continues in America, because the British government cannot seize him within our territorial limits. Neither can a question arise if he should return home, because he would then be where we have no jurisdiction. But it may be asked, what will be the condition of an Englishman, naturalized here, who may have been brought, by force, within the power of his native country? Unquestionably it must be that which the law of England provides; for we cannot interfere, unless he was seized in our dominion.\n\nHere, then, arises the second question, whether, admitting that England possesses the right she claims over her native subjects, it can properly be exercised in American ships. Those who hold the negative contend, that, taking a man from under the protection of our flag is a violation of our territory. It becomes proper, therefore, to inquire into the nature and extent of this protection. And here the first leading circumstance is the common right to navigate the ocean, whereby all are there at home. It is by virtue of this right, that powers at war take property of their enemies in a neutral ship. The ocean belonging as much to the one as\nto the other, if the neutral says the capture was made in my dominion, the belligerent replies, it was made in mine; and the arguments to support one assertion establish both or neither. Until lately, it was not attempted to take enemy's goods in the territory of a neutral power; and it is worthy of remark, that this has been done by the nation which, for half a century, has urged the establishment of a maxim, that neutral ships shall protect enemy's goods. The conduct of Napoleon on this occasion is rather an example to be avoided, than a precedent to be pursued, and cannot strengthen the right of search. But it does not weaken that right. Let it, however, be remembered, that although it is usual to stop and search merchant ships, a similar practice towards public vessels of war is inadmissible. These are national fortresses, and bear (in the proper sense) the national flag. To such vessels alone, the idea of protection, by the flag, is applicable. The distinction between them and merchant ships is material to the present subject. Nations justly claim respect to their vessels of war, and, from that claim, corresponding duties arise. When anything wrong is done by them, the national honour is bound to make satisfaction: but the case with merchant vessels is widely different; and the condition of sovereigns would be wretched and base if every trick and fraud of a smuggler could implicate their honour. Yet, if we insist on the same respect to a private ship of trade as to a public ship of war,\nwe must hold ourselves equally accountable for the conduct of both. Hence the universal consent, that merchant vessels may be examined, detained and confiscated, according to the nature of the case; and where they are injured, to compensate by money. For money being the object of trade, the national character is, in no wise, affected by what is done or suffered in the pursuit. Seeing, therefore, that a power at war has a right to take the ship and bring it into port, he must have a right to take his own subject out of the ship. It would be idle to suppose that a flag which cannot protect the ship itself, could protect the persons on board; or that it would be a violation of sovereignty to take part, when it is no violation to take the whole. But even if such distinction could be established, the matter would not be mended. If, for instance, Great Britain should admit that one of our merchant vessels enjoys, while in the open sea, such an emanation of sovereignty, that, to take away one of the crew, would be tantamount to an invasion of our country; reserving, nevertheless, the established right for which the ship may, for adjudication of doubtful points, be sent into a British port: by exercising that right the ship could be brought within those limits where the exclusive territorial authority attaches. The suspected man would then, after examination, be regularly put on board a man of war, and nothing would, of course, be allowed for detaining the ship, and taking her out\nof her course. Hence it is evident, that, by abandoning the known principles and usage of nations, we should involve ourselves in a labyrinth of difficulties, for no good purpose, and to considerable loss.\n\nBut, it is said, there is manifest absurdity in pretending that, because goods may be taken, and, after due trial, be confiscated, men may be taken and condemned without trial. It is monstrous to submit the dearest thing we have, our liberty, to the will of military men, who have an interest in taking it away. This argument is ingenious, but, in our apprehension, not solid. If British subjects only are impressed, it is none of our concern. Englishmen may do with each other what they please. If an American be impressed, it is, probably, from mistake, and he suffers a misfortune incident to his profession; being one of those evils, by reason whereof he is intitled to, and receives extraordinary wages. We will not, however, elude the argument, but meet its full force. We say, then, that if the violence be intentional, and done by order of the sovereign, it is a legitimate cause of war, and ought so to be considered and treated. But if done by the officer, without the order of his government, it is one among the many wrongs, for redress of which, resort must be had to the tribunals. The officer impressing does it at his peril, and the impressed seamen would, we believe, obtain ample compensation from a Westminster jury. We ven-\nture to add our opinion, that if a few clear cases of this sort had been prosecuted at the public expense, it would have done more to correct the practice, so far as real American citizens are concerned, than all the clamour of the last ten years. At any rate, nothing can fairly be imputed to the sovereign, until his courts refuse to do justice. If an officer in our navy should assault and imprison a British subject, and application were made to our Secretary of State, by the British Minister, would he not be referred for redress to our courts of justice? Surely the President would not, on a complaint, though supported by exparte affidavits, break an American officer without trial.\n\nTo this it may be replied, and with much weight of argument, that although the officer is personally accountable to the injured individual, the government he serves is also accountable for repeated injuries, though done without its order; because, in arming officers with power, and cloathing them with authority, it is a duty to provide against and prevent abuse. This we admit, and deduce from it the consequence that Britain, in exacting the military service of her subjects, ought to respect the rights of our citizens. Here, however, we must, in fairness, consider those circumstances which are inseparably connected with the question. Speaking as we do, the same language; our manners and customs also being the same; there is real difficulty in distinguishing a British from an American sea-\nman, even when the officer acts with pure and upright intentions. Moreover, the very mode adopted to mark out our citizens has increased, instead of diminishing the difficulty. Seamen carelessly lose, or wantonly destroy, or fraudulently dispose of their protections; so that while many, whose countenance and pronunciation declare them to be (what they really are) native Americans, have no protections; their comrades, from Scotland and Ireland, whose looks and language clearly designate their country, present their protections in proper form. On application, therefore, to the British government, and the consequent inquiries, facts frequently appear of such nature as might puzzle a discerning judge, much more a plain sea officer.\n\nThus, by the peculiarity of its attending circumstances, the question is brought to a kind of dilemma; and, principles being acknowledged, it is contended, on our part, that Britain ought to forego a right which, from her own shewing, cannot be exercised without invading the rights of America—That she, being the actor, is bound to adopt regulations by which our citizens may be secured from violence. The case, considered in this aspect, is certainly strong. But to the proposition that she shall forego her right, she replies, that without supposing, much less asserting, that the United States contemplate the seduction of her seamen into their service, it is impossible not to see that such would be the result—that without regarding the loss of\none country and gain of another from that event, a consequence far more important commands her attention—That she is at war with the most powerful monarch on earth, who threatens invasion and conquest—That she has but slender means of defence at land, and may (should the invasion take effect) be blotted from the list of nations—That, even if not subdued, she would be exposed to imminent peril and most grievous calamity—That her only defence, her fleet, can no longer be relied on, if her present resources, for manning it, be destroyed. Therefore, the exercise of her right cannot be relinquished, without hazarding her existence—That without insisting, as she might, on the interest we ourselves have in her success, and on the certainty that, if she is crushed by the weight of Napoleon's arms, we also must become French provinces, she can safely appeal to our reason and justice, to decide whether it is fair and right to place the convenience of one party on a line of equality with the existence of another. She declares her willingness to enter into any equitable arrangements to secure the rights of our citizens. But, if no expedient can be devised which will produce the desired effect, she must exercise the right of self-preservation; though from circumstances, not of her making nor under her control, we are subjected, by it, to inconvenience and even to injury. In fine, that if we insist on her relinquishing her only means of defence, she must, though reluctantly, join in an appeal to the God of battles.\nWe have already observed, that when parties are agreed as to matter of right, the way is open to arrangements for mutual convenience. We now add our sincere belief, that men of integrity and good sense, who would candidly seek, would certainly find, expedients to reconcile the exercise of her rights with the security of our citizens. We see, however, with much concern, that instead of endeavouring to remove, pains are taken to increase and multiply obstructions in the way of a fair and honest arrangement; and that, instead of simplifying the question, it is endeavoured, by the use of general terms and severe invectives, to persuade the people of America that Great Britain ought to relinquish a right, on the exercise of which, materially depends her national existence.\n\nHitherto we have discussed the question on principles of public law, and have not permitted any breath of interest to blow either way. Let it not, however, be forgotten, that our ships of war go freely into British ports, are hospitably received, and are suffered to depart without question, though manned in a great proportion by British subjects. Surely they have as good right to demand their seamen as we have to demand ours.\n\nBut it may be asked, if this be a true state of the question on the ground of right; and if it be doubtful on the ground of policy, whether we should strenuously insist on our right; whence came the clamour, and whence the cry of oppression? We\ndo not conceive ourselves called on to account for so vain a thing as clamour. But, since the occasion is of portentous import, we will state the facts. We gain much, during the war, on trade which usually flows in other channels. Hence an extra demand for seamen, which America cannot supply; so that this lucrative commerce will be less extensive than our merchants desire, if they cannot procure seamen from other countries. Other neutrals are actuated by similar motives. We, however, speaking the same language, can have no want of British seamen, if, besides high wages and security from capture, we can protect them against impressment by British ships of war. Our merchants, therefore, have easily persuaded themselves to believe that a British seaman, with one of the protections above mentioned in his pocket, ought not to be taken out of their ships. In this faith they clamoured. Some of them, whose moral and political notions are peculiarly agreeable to those who manage our affairs in the way they like best, have contrived to enlist the government in this scheme of traffic. But if, by contending on such bad ground, we are brought into war, our merchants will be the first to suffer. Such of them as have property must tremble at the consequence. The cry, however, will be kept up by those whose de-ranged affairs find an interest in confusion; and by the fiery spirits, who readily sacrifice their country to their ambition. But what will be our condition, if we walk on in this crooked path? We have advanced a claim, which, however the agents of\nthose who wish to embroil us may pretend to approve, will be scouted by all the world: for the position we take is not only untenable in itself, but opposed to the interest of other nations. Nevertheless, to establish this claim, though without any chance of success, we shall perhaps be committed to a dangerous course of events. If Britain, struggling for life, be driven to desperation, she must strike. At the first blow our commerce is gone. She would be enriched with millions of our spoil, and we should, in a few months, acknowledge the rights which our rulers seem disposed to resist by the last extremities: for it is absurd to suppose the American people will bear the privations and hardships of war, to support a scheme of injustice.\n\nOne good consequence has, however, resulted from the notion assumed by our rulers. There is too much reason to believe, that, if the usual course had been pursued with regard to the treaty, a constitutional majority of the Senate (from the confidence which they were chosen to exhibit in the President) would have given their ready approbation. That onerous contract would then have been fastened about our necks for ten years, and some of its evil consequences for ever. That we are not at this moment the commercial vassals of England, is, therefore, in no small degree, to be attributed to the extravagant notion, that America is bound to protect every vagabond against the lawful authority of his own country. If, in the exercise of the British claim, or in any thing else, our sovereignty and independence are in\nvaded, let no thought of consequences prevent us from asserting our honour. To preserve that, is our first duty, our highest concern. With it, we shall enjoy liberty, peace, and commerce. Without it, we shall enjoy nothing long; for a nation which loses her honour, cannot preserve her independence. But we forbear to urge what we conceive to be unnecessary, when speaking to a high-minded people.\n\nWe intreat our fellow citizens to consider seriously the situation in which they stand—to suspend the rage of party strife—to examine facts—to reason for themselves. We put in no claim of merit. We solicit not their favour, much less their suffrage. Let them honour those whom it pleaseth them to honour. But let them not forego the use of their understanding. They may perhaps be told that we are enemies to the people. Be it so. Wise men consider those as their friends who give them useful information. But, admitting us to be enemies, reason and truth, even in the mouth of an enemy, are still reason and truth. The people may believe of us what they please, and call us by whatever odious name their favourites may select or invent. All we ask of them is to show their friendship to themselves, by attending to what concerns themselves; instead of sitting still, their eyes closed, their ears shut, while they are bought and sold like miserable slaves.\n\nTHE END.\nAPPENDIX, &c.\n\nTREATY of Amity, Commerce, and Navigation, between His Britannic Majesty and the United States of America. Signed at London, the 19th of November, 1794.\n\nHis MAJESTY'S Ratification.\n\nGEORGE R.\n\nGEORGE the Third, by the grace of God, king of Great Britain, France, and Ireland, Defender of the Faith, Duke of Brunswick and Lunenburgh, Arch-treasurer and Prince Elector of the holy Roman empire, &c. To all and singular to whom these presents shall come, greeting: whereas our right trusty and well-beloved counsellor, William Windham, Baron Grenville of Wotton, our principal secretary of state for foreign affairs, &c. &c. did, on our part, together with the plenipotentiary of our good friends the United States of America, conclude and sign at London, on the nineteenth day of November, one thousand seven hundred and ninety-four, a treaty of amity, commerce, and navigation, between us and our said good friends: and whereas a certain additional article has, on the part of the said United States, been proposed to be annexed to the said treaty as a part thereof; to which addition\nwe are willing to consent; the said treaty and additional article being in the words following:\n\nHis Britannick Majesty and the United States of America, being desirous, by a treaty of amity, commerce, and navigation, to terminate their differences in such a manner as, without reference to the merits of their respective complaints and pretensions, may be the best calculated to produce mutual satisfaction and good understanding; and also to regulate the commerce and navigation between their respective countries, territories, and people, in such a manner as to render the same reciprocally beneficial and satisfactory; they have, respectively, named their plenipotentiaries, and given them full powers to treat of and conclude the said treaty; that is to say, his Britannick Majesty has named, for his plenipotentiary, the Right Honourable William Windham, Baron Grenville of Wotton, one of his Majesty's privy council, and his Majesty's principal secretary of state for foreign affairs; and the president of the said United States, by and with the advice and consent of the senate thereof, hath appointed for their plenipotentionary the Honourable John Jay, chief justice of the United States, and their envoy extraordinary to his Majesty, who have agreed on and concluded the following articles:\n\nArticle I.—There shall be a firm, inviolable, and universal peace, and a true and sincere friendship between his Britannick Majesty, his heirs and\nsuccessors, and the United States of America; and between their respective countries, territories, cities, towns, and people, of every degree, without exception of persons or places.\n\nArticle II.—His Majesty will withdraw all his troops and garrisons from all posts and places within the boundary lines assigned by the treaty of peace to the United States. This evacuation shall take place on or before the first day of June, 1796, and all the proper measures shall in the interval be taken by concert between the government of the United States and his Majesty's governor-general in America, for settling the previous arrangements which may be necessary respecting the delivery of the said posts: the United States, in the mean time, at their discretion, extending their settlements to any part within the said boundary line, except within the precincts or jurisdiction of any of the said posts. All settlers and traders within the precincts or jurisdiction of the said posts shall continue to enjoy, unmolested, all their property of every kind, and shall be protected therein: they shall be at full liberty to remain there, or to remain with all or any part of their effects; and it shall also be free to them to sell their lands, houses, or effects, or to retain the property thereof, at their discretion. Such of them as shall continue to reside within the said boundary lines shall not be compelled to become citizens of the United States, or to take any oath of\nallegiance to the government thereof, but they shall be at full liberty so to do, if they think proper; and they shall make and declare their election within one year after the evacuation aforesaid. And all persons who shall continue there after the expiration of the said year, without having declared their intention of remaining subjects of his Britannick Majesty, shall be considered as having elected to become citizens of the United States.\n\nArticle III.—It is agreed, that it shall at all times be free to his Majesty's subjects, and to the citizens of the United States, and also to the Indians dwelling on either side of the said boundary line, freely to pass and repass, by land or inland navigation, into the respective territories and countries of the two parties on the continent of America, (the country within the limits of the Hudson's Bay Company only excepted) and to navigate all the lakes, rivers, and waters, thereof, and freely to carry on trade and commerce with each other. But it is understood, that this article does not extend to the admission of vessels of the United States into the sea-ports, harbours, bays, or creeks, of his Majesty's said territories; nor into such parts of the rivers in his Majesty's said territories as are between the mouth thereof and the highest port of entry from the sea, except in small vessels trading bona fide between Montreal and Quebec, under such regulations as shall be established to prevent the possi-\nbility of any frauds in this respect; nor to the admission of British vessels from the sea into the rivers of the United States, beyond the highest ports of entry for vessels from the sea. The river Mississippi shall, however, according to the treaty of peace, be entirely open to both parties; and it is further agreed, that all the ports and places on its eastern side, to which soever of the parties belonging, may freely be resorted to, and used by both parties, in as ample a manner as any of the Atlantic ports or places of the United States, or any of the ports or places of his Majesty in Great Britain.\n\nAll goods and merchandize, whose importation into his Majesty's said territories in America shall not be entirely prohibited, may freely, for the purposes of commerce, be carried into the same, in the manner aforesaid, by the citizens of the United States; and such goods and merchandize shall be subject to no higher or other duties than would be payable by his Majesty's subjects on the importation of the same from Europe into the said territories. And, in like manner, all goods and merchandize, whose importation into the United States shall not be wholly prohibited, may freely, for the purpose of commerce, be carried into the same, in the manner aforesaid, by his Majesty's subjects; and such goods and merchandize shall be subject to no higher or other duties than would be payable by the citizens of the United States on the importa-\ntion of the same, in American vessels, into the Atlantic ports of the said states. And all goods not prohibited to be exported from the said territories respectively, may, in like manner, be carried out of the same by the two parties respectively, paying duty as aforesaid.\n\nNo duty of entry shall ever be levied, by either party, on peltries brought by land or inland navigation into the said territories respectively; nor shall the Indians, passing or repassing with their own proper goods and effects, of whatever Nature, pay for the same any impost or duty whatever; but goods in bales, or other large packages unusual among Indians, shall not be considered as goods belonging bona fide to Indians.\n\nNo higher or other tolls of rates of ferriage than what are or shall be payable by natives, shall be demanded on either side; and no duties shall be payable on any goods which shall merely be carried over any of the portages or carrying-places on either side, for the purpose of being immediately re-embarked and carried to some other place or places. But as by this stipulation it is only meant to secure to each party a free passage across the portages on both sides, it is agreed, that this exemption from duty shall extend only to such goods as are carried in the usual and direct road across the Portage, and are not attempted to be in any manner sold or exchanged during their passage across the same; and\nproper regulations may be established to prevent the possibility of any frauds in this respect.\n\nAs this article is intended to render, in a great degree, the local advantages of each party common to both, and thereby to promote a disposition favourable to friendship and good neighbourhood, it is agreed, that the respective governments will mutually promote this amicable intercourse, by causing speedy and impartial justice to be done, and necessary protection to be extended to all who may be concerned therein.\n\nArticle IV.—Whereas it is uncertain whether the river Mississippi extends so far to the northward as to be intersected by a line to be drawn due west from the Lake of the Woods, in the manner mentioned in the treaty of peace between his Majesty and the United States; it is agreed, that measures shall be taken, in concert with his Majesty's government in America, and the government of the United States, for making a joint survey of the said river from one degree of latitude below the falls of St. Anthony, to the principal source or sources of the said river, and also of the parts adjacent thereto; and that if, on the result of such survey, it should appear that the said river would not be intersected by such a line as is above-mentioned, the two parties will thereupon proceed, by amicable negotiation, to regulate the boundary line in that quarter, as well as all other points, to be adjusted between the said\nparties, according to justice and mutual convenience, and in conformity to the intent of the said treaty.\n\nArticle V.—Whereas doubts have arisen what river was truly intended under the name of the river St. Croix, mentioned in the said treaty of peace, and forming a part of the boundary therein described, that question shall be referred to the final decision of commissioners, to be appointed in the following manner, viz.\n\nOne Commissioner shall be named by his Majesty, and one by the president of the United States, by and with the advice and consent of the senate thereof, and the said two commissioners shall agree on the choice of a third; or, if they cannot so agree, they shall each propose one person; and of the two names so proposed, one shall be drawn by lot in the presence of the two original commissioners: and the three commissioners so appointed shall be sworn impartially to examine and decide the said question according to such evidence as shall respectively be laid before them on the part of the British Government and of the United States. The said commissioners shall meet at Halifax, and shall have power to adjourn to such other place or places as they shall think fit. They shall have power to appoint a secretary, and to employ such surveyors or other persons as they shall judge necessary. The said commissioners shall, by a decla-\nration under their hands and seals, decide what river is the river St. Croix intended by the treaty. The said declaration shall contain a description of the said river, and shall particularise the latitude and longitude of its mouth and of its source. Duplicates of this declaration, and of the statements of their accounts, and of the journal of their proceedings, shall be delivered by them to the agent of his Majesty, and to the agent of the United States, who may be respectively appointed and authorized to manage the business on behalf of the respective governments: and both parties agree to consider such decision as final and conclusive, so as that the same shall never thereafter be called into question, or made the subject of dispute or difference between them.\n\nArticle VI. Whereas it is alleged, by divers British merchants, and others his Majesty's subjects, that debts to a considerable amount, which were bona fide contracted before the peace, still remain owing to them by citizens or inhabitants of the United States, and that, by the operation of various lawful impediments since the peace, not only the full recovery of the said debts has been delayed, but also the value and security thereof have been, in several instances, impaired and lessened, so that, by the ordinary course of judicial proceedings, the British creditors cannot now obtain, and actually have and receive full and adequate compensation\nfor the losses and damages which they have hereby sustained; it is agreed, that in all such cases where full compensation for such losses and damages cannot, for whatever reason, be actually obtained, had and received by the said creditors in the ordinary course of justice, the United States will make full and complete compensation for the same to the said creditors: but it is distinctly understood that this provision is to extend to the losses only as have been occasioned by such lawful impediments aforesaid, and is not to extend to losses occasioned by such insolvency of the debtors, or other causes, as would equally have operated to produce such loss if the said impediments had not existed, nor to such losses or damages as have been occasioned by the manifest delay or negligence, or wilful omission, of the claimant.\n\nFor the purpose of ascertaining the amount of any such losses and damages, five commissioners shall be appointed, and authorized to meet and act in manner following, viz. Two of them shall be appointed by his Majesty, two of them by the president of the United States, by and with the advice and consent of the senate thereof, and the fifth by the unanimous voice of the other four; and if they should not agree in such choice, then the commissioners named by the two parties shall respectively propose one person, and of the two names so proposed one shall be drawn by lot in the presence of the four original commissioners.\nWhen the five commissioners thus appointed shall first meet, they shall, before they proceed to act respectively, take the following oath or affirmation, in the presence of each other, which oath or affirmation being so taken and duly attested, shall be entered on the record of their proceedings, viz.\n\n\"I, A. B. one of the commissioners appointed in pursuance of the sixth article of the treaty of amity, commerce, and navigation, between his Britannic Majesty and the United States of America, do solemnly swear and affirm, that I will honestly, diligently, impartially, and carefully examine, and, to the best of my judgment, according to justice and equity, decide all such complaints as under the said article shall be preferred to the said commissioners; and that I will forbear to act as a commissioner in any case in which I may be personally interested.\"\n\nThree of the said commissioners shall constitute a board, and shall have power to do any act appertaining to the said commission, provided that one of the commissioners named on each side, and the fifth commissioner, shall be present; and all decisions shall be made by the majority of the voices of the commissioners then present. Eighteen months from the day on which the said commissioners shall form a board, and be ready to proceed to business, are assigned for receiving complaints and applications; but they are nevertheless authorized in\nany particular cases, in which it shall appear to them to be reasonable and just, to extend the said term of eighteen months, for any term not exceeding six months, after the expiration thereof. The said commissioners shall first meet at Philadelphia; but they shall have power to adjourn from place to place as they shall see cause.\n\nThe said commissioners, in examining the complaints and applications so preferred to them, are empowered and required, in pursuance of the true intent and meaning of this article, to take into their consideration all claims, whether of principle or interest, or balances of principal and interest, and to determine the same respectively, according to the merits of the several cases, due regard being had to all the circumstances thereof, and as equity and justice shall appear to them to require. And the said commissioners shall have power to examine all such persons as shall come before them, on oath or affirmation, touching the premises; and also to receive in evidence, according as they may think most consistent with equity and justice, all written depositions, or books, or papers, or copies, or extracts thereof, every such deposition, book or paper, or copy or extract, being duly authenticated, either according to the legal forms now respectively existing in the two countries, or in such other manner as the said commissioners shall see cause to require or allow.\nThe award of the said commissioners, or of any three of them as aforesaid, shall in all cases be final and conclusive, both as to the justice of the claim, and to the amount of the sum to be paid to the creditor or claimant: and the United States undertake to cause the sum so awarded to be paid in specie to such creditor or claimant without deduction; and at such time or times, and at such place or places, as shall be awarded by the said commissioners; and on condition of such releases or assignments to be given by the creditor or claimant, as by the said commissioners may be directed: provided always, that no such payment shall be fixed by the said commissioners to take place sooner than twelve months, from the day of the exchange of the ratifications of this treaty.\n\nARTICLE VII. Whereas complaints have been made by divers merchants and others, citizens of the United States, that, during the course of the war in which his Majesty is now engaged, they have sustained considerable losses and damage, by reason of irregular or illegal captures or condemnations of their vessels and other property, under colour of authority or commissions from his Majesty; and that, from various circumstances belonging to the said cases, adequate compensation for the losses and damages so sustained cannot now be actually obtained, had, and received by the ordinary course of judicial proceedings: it is agreed, that in all such cases where adequate compensation cannot, for\nwhatever reason, be now actually obtained, had and received by the said merchants and others in the ordinary course of justice, full and complete compensation for the same will be made by the British government to the said complainants. But it is distinctly understood that this provision is not to extend to such losses or damages as have been occasioned by the manifest delay or negligence, or wilful omission of the claimants.\n\nThat, for the purpose of ascertaining the amount of any such losses and damages, five commissioners shall be appointed and authorized to act in London, exactly in manner directed with respect to those mentioned in the preceding article, and after having taken the same oath or affirmation (mutatis mutandis) the same term of eighteen months is also assigned for the reception of claims, and they are in like manner authorized to extend the same in particular cases. They shall receive testimony, books, papers and evidence in the same latitude, and exercise the like discretion and powers respecting that subject; and shall decide the claims in question according to the merits of the several cases, and to justice, equity, and the laws of nations. The award of the said commissioners, or any such three of them as aforesaid, shall, in all cases, be final and conclusive, both as to the justice of the claim, and to the amount of the sum to be paid to the claimant; and his Britannick Majesty undertakes to cause the same to be paid to such claimant in specie, without\nany deduction, in such place or places, and at such time or times, as shall be awarded by the same commissioners, and on condition of such releases or assignments to be given by the claimants, as by the said commissioners may be directed.\n\nAnd whereas certain merchants and others, his majesty's subjects, complain, that, in the course of the war, they have sustained loss and damage by reason of the capture of their vessels and merchandise taken within the limits and jurisdiction of the States, and brought into the ports of the same, or taken by vessels originally armed in ports of the said states;\n\nIt is agreed, that in all such cases, where restitution shall not have been made agreeably to the tenor of the letter from Mr. Jefferson to Mr. Hammond, dated at Philadelphia, September 5, 1793, (a copy of which is annexed to this treaty) the complaints of the parties shall be, and hereby are referred to the commissioners to be appointed by virtue of this article, who are hereby authorized and required to proceed in the like manner relative to these as to the other cases committed to them; and the United States undertake to pay to the complainants or claimants in specie, without deduction, the amount of such sums as shall be awarded to them respectively by the said commissioners, and at the times and places which in such awards shall be specified; and on condition of such releases or assignments to be given by the claimants as the said awards may be\ndirected. And it is further agreed, that not only the now existing cases of both descriptions, but also all such as shall exist at the time of exchanging the ratifications of this treaty, shall be considered as being within the provisions, intent and meaning of this article.\n\nArticle VIII. It is further agreed, that the commissioners mentioned in this and in the two preceding articles shall be respectively paid in such a manner as shall be agreed between the two parties; such agreement being to be settled at the time of the exchange of the ratifications of this treaty. And all other expenses attending the said commissioners shall be defrayed jointly by the two parties, the same being previously ascertained and allowed by the majority of the commissioners. And in the case of death, sickness, or necessary absence, the place of every such commissioner respectively shall be supplied in the same manner as such commissioner was first appointed, and the new commissioner shall take the same oath or affirmation, and do the same duties.\n\nArticle IX. It is agreed, that British subjects, who now hold lands in the territories of the United States, and American citizens who now hold lands in the dominions of his Majesty, shall continue to hold them according to the nature and tenure of their respective states and titles therein; and may grant, sell or devise the same to whom they please, in like manner as if they were natives; and that\nneither they, nor their heirs or assigns, shall, so far as may respect the said lands, and the legal remedies incident thereto, be regarded as aliens.\n\n**Article X.** Neither the debts due from individuals of the one nation to individuals of the other, nor shares, nor monies, which they may have in the public funds, or in the public or private banks, shall ever, in any event of war or national differences, be sequestered or confiscated, it being unjust and impolitic that debts and engagements contracted and made by individuals having confidence in each other, and in their respective governments, should ever be destroyed or impaired by national authority, on account of national differences and discontents.\n\n**Article XI.** It is agreed between his Majesty and the United States of America, that there shall be a reciprocal and entirely perfect liberty of navigation and commerce between their respective people, in the manner, under the limitations, and on the conditions specified in the following articles.\n\n**Article XII.**—His Majesty consents, that it shall and may be lawful, during the time hereinafter limited, for the citizens of the United States to carry to any of his Majesty's islands and ports in the West Indies from the United States, in their own vessels, not being above the burthen of seventy tons, any goods or merchandizes, being of the growth, manufacture, or produce of the said States, which it is or may be lawful to carry to the\nsaid islands or ports from the said States in British vessels; and that the said American vessels shall be subject there to no other or higher tonnage duties or charges than shall be payable by British vessels in the ports of the United States; and that the cargoes of the said American vessels shall be subject there to no other or higher duties or charges than shall be payable on the like articles, if imported there from the said States in British vessels.\n\nAnd his Majesty also consents, that it shall be lawful for the said American citizens to purchase, load, and carry away, in their said vessels, to the United States, from the said islands and ports, all such articles, being of the growth, manufacture, or produce of the said islands, as may now by law be carried from thence to the said States in British vessels, and subject only to the same duties and charges on exportation to which British vessels and their cargoes are or shall be subject in similar circumstances.\n\nProvided always, that the said American vessels do carry and land their cargoes in the United States only, it being expressly agreed and declared, that during the continuance of this article, the United States will prohibit and restrain the carrying any molasses, sugar, coffee, cocoa or cotton, in American vessels, either from his Majesty's islands or from the United States, to any part of the world, except the United States, reasonable sea stores excepted.\nProvided also, that it shall and may be lawful, during the same period, for British vessels to import from the said islands into the United States, and to export from the United States to the said islands, all articles whatever, being of the growth, produce or manufacture of the said islands, or of the United States respectively, which now may, by the laws of the said States, be so imported and exported. And that the cargoes of the said British vessels shall be subject to no other or higher duties or charges than shall be payable on the same articles, if so imported or exported in American vessels.\n\nIt is agreed, that this article, and every matter and thing therein contained, shall continue to be in force during the continuance of the war in which his Majesty is now engaged; and also for two years from and after the signature of the preliminary or other articles of peace by which the same may be terminated.\n\nAnd it is further agreed, that, at the expiration of the said term, the two contracting parties will endeavour further to regulate their commerce in this respect, according to the situation in which his Majesty may then find himself with respect to the West Indies, and with a view to such arrangements as may best conduce to the mutual advantage and extension of commerce.\n\nAnd the said parties will then also renew their discussions, and endeavour to agree, whether in\nany or what cases neutral vessels shall protect enemy's property; and in what cases, provisions and other articles, not generally contraband, may become such. But, in the mean time, their conduct towards each other, in these respects, shall be regulated by the articles hereinafter inserted on those subjects.\n\n**Article XIII.** His Majesty consents, that the vessels belonging to the citizens of the United States of America shall be admitted and hospitably received in all the sea-ports and harbours of the British territories in the East Indies. And that the citizens of the said United States may freely carry on a trade between the said territories and the said United States in all articles, of which the importation or exportation respectively to or from the said territories shall not be entirely prohibited. Provided only, that it shall not be lawful for them, in any time of war, between the British government and any other power or state whatever, to export from the said territories, without the special permission of the British government there, any military stores or naval stores, or rice. The citizens of the United States shall pay for their vessels, when admitted into the said ports, no other or higher tonnage duty than shall be payable on British vessels when admitted into the ports of the United States. And they shall pay no other or higher duties or charges on the importation or exportation of the cargoes of the said vessels than shall be pay-\nable on the same articles when imported or exported in British vessels. But it is expressly agreed, that the vessels of the United States shall not carry any of the articles exported by them from the said British territories to any port or place, except to some port or place in America, where the same shall be unladen: and such regulations shall be adopted by both parties as shall, from time to time, be found necessary to enforce the due and faithful observance of this stipulation.\n\nIt is also understood, that the permission granted by this article is not to extend to allow the vessels of the United States to carry on any part of the coasting trade of the said British territories; but vessels going with their original cargoes, or part thereof, from one port of discharge to another, are not to be considered as carrying on the coasting trade. Neither is this article to be construed to allow the citizens of the said States to settle or reside within the said territories, or to go into the interior parts thereof, without the permission of the British government established there; and if any transgression should be attempted against the regulations of the British government in this respect, the observance of the same shall and may be enforced against the citizens of America, in the same manner as against British subjects, or others transgressing the same rule. And the citizens of the United States, whenever they arrive in any port or harbour in the said territories, or if they should be\npermitted, in manner aforesaid, to go to any other place therein, shall always be subject to the laws, government, and jurisdiction of whatever nature, established in such harbour, port, or place, according as the same may be: the citizens of the United States may also touch, for refreshment, at the island of St. Helena, but subject, in all respects, to such regulations as the British government may from time to time establish there.\n\n**Article XIV.** There shall be between all the dominions of his Majesty in Europe, and the territories of the United States, a reciprocal and perfect liberty of commerce and navigation. The people and inhabitants of the two countries respectively, shall have liberty freely and securely, and without hindrance and molestation, to come with their ships and cargoes to the lands, countries, cities, ports, places, and rivers, within the dominions and territories aforesaid, to enter into the same, to resort there, and to remain and reside there, without any limitation of time; also to hire and possess houses and warehouses for the purposes of their commerce, and generally, the merchants and traders on each side shall enjoy the most complete protection and security for their commerce, but subject always as to what respects this article, to the laws and statutes of the two countries respectively.\n\n**Article XV.** It is agreed, that no other or higher duties shall be paid by the ships or merchandise of the one party in the ports of the other,\nthan such as are paid by the like vessels or merchandise of all other nations. Nor shall any other or higher duty be imposed in one country on the importation of any articles, the growth, produce, or manufacture of the other, than are or shall be payable on the importation of the like articles, being of the growth, produce, or manufacture of any other foreign country. Nor shall any prohibition be imposed on the exportation or importation of any articles to or from the territories of the two parties respectively, which shall not equally extend to all other nations.\n\nBut the British government reserves to itself the right of imposing on American vessels entering into the British ports in Europe, a tonnage duty equal to that which shall be payable by British vessels in the ports of America; and also such duty as may be adequate to countervail the difference of duty now payable on the importation of European and Asiatic goods when imported into the United States in American or in British vessels.\n\nThe two parties agree to treat for the more exact equalization of the duties on the respective navigation of their subjects and the people in such manner as may be most beneficial to the two countries. The arrangements for this purpose shall be made at the same time with those mentioned at the conclusion of the twelfth article of this treaty, and are to be considered as a part thereof. In the interval, it is agreed that the United States will not impose any\nnew or additional tonnage duties on British vessels, nor increase the now subsisting difference between the duties payable on the importation of any articles in British or in American vessels.\n\n**Article XVI.** It shall be free for the two contracting parties respectively to appoint consuls for the protection of trade, to reside in the dominions and territories aforesaid; and the said consuls shall enjoy those liberties and rights which belong to them by reason of their function. But before any consul shall act as such, he shall be in the usual forms approved and admitted by the party to whom he is sent; and it is hereby declared to be lawful and proper, that in case of illegal or improper conduct towards the laws or government, a consul may either be punished according to law, if the laws will reach the case, or be dismissed, or even sent back, the offended government assigning to the other their reasons for the same.\n\nEither of the parties may except from the residence of consuls such particular places as such party shall judge proper to be so excepted.\n\n**Article XVII.** It is agreed, that in all cases where vessels shall be captured or detained on just suspicion of having on board enemy's property, or of carrying to the enemy any of the articles which are contraband of war, the said vessel shall be brought to the nearest or most convenient port; and if any property of an enemy shall be found on board such vessel, that part only which belongs to\nthe enemy shall be made prize, and the vessel shall be at liberty to proceed with the remainder without any impediment. And it is agreed, that all proper measures shall be taken to prevent delay, in deciding the cases of ships or cargoes so brought in for adjudication; and in the payment or recovery of any indemnification adjudged or agreed to be paid to the masters or owner of such ships.\n\nArticle XVIII. In order to regulate what is in future to be esteemed contraband of war, it is agreed, that under the said denomination shall be comprised all arms and implements serving for the purposes of war, by land or by sea, such as cannon, muskets, mortars, petards, bombs, granadoes, carcasses, saucisses, carriages for cannon, musket rests, bandoliers, gunpowder, match, saltpetre, ball, pikes, swords, head-pieces, cuirasses, halberts, lances, javelins, horses, horse-furniture, holsters, belts, and generally, all other implements of war; as also timber for ship-building, tar or rosin, copper in sheets, sails, hemp and cordage, and generally, whatever may serve directly to the equipment of vessels, unwrought iron and fir planks only excepted; and all the above articles are hereby declared to be just objects of confiscation, whenever they are attempted to be carried to an enemy.\n\nAnd whereas the difficulty of agreeing on the precise cases in which alone provisions and other articles, not generally contraband, may be regarded as such, renders it expedient to provide against\nthe inconveniencies and misunderstandings which might thence arise: It is further agreed, that whenever any such articles so becoming contraband according to the existing laws of nations, shall for that reason be seized, the same shall not be confiscated, but the owners thereof shall be speedily and completely indemnified; and the captors, or, in their default, the government under whose authority they act, shall pay to the masters or owners of such vessel the full value of all articles, with a reasonable mercantile profit thereon, together with the freight, and also the demurrage incident to such detention.\n\nAnd whereas it frequently happens, that vessels sail for a port or place belonging to an enemy, without knowing that the same is either besieged, blockaded, or invested; it is agreed, that every vessel so circumstanced may be turned away from such port or place, but she shall not be detained, nor her cargo, if not contraband, be confiscated, unless after notice, she shall again attempt to enter: But she shall be permitted to go to any other port or place she may think proper; nor shall any vessel or goods of either party, that may be entered into such port or place before the same was besieged, blockaded, or invested by the other, and be found therein after the reduction or surrender of such place, be liable to confiscation, but shall be restored to the owners or proprietors thereof.\n\nArticle XIX. And that more abundant care\nbe taken for the security of the respective subjects and citizens of the contracting parties, and to prevent their suffering injuries by the men of war or privateers of either party, all commanders of ships of war and privateers, and all others the said subjects and citizens, shall forbear doing any damage to those of the other party, or committing any outrage against them; and if they act to the contrary they shall be punished, and shall also be bound in their persons and estates to make satisfaction and reparation for all damages, and the interest thereof, of whatever nature the said damages may be.\n\nFor this cause all commanders of privateers, before they receive their commissions, shall hereafter be obliged to give, before a competent judge, sufficient security by at least two responsible securities, who have no interest in the said privateer, each of whom, together with the said commander, shall be jointly and severally bound in the sum of fifteen hundred pounds sterling; or if such ship be provided with above one hundred and fifty seamen or soldiers, in the sum of three thousand pounds sterling, to satisfy all damages and injuries, which the said privateer, or officers, or men, or any of them, may do or commit during their cruise, contrary to the tenor of this treaty, or to the laws and instructions for regulating their conduct; and further, that in all cases of aggressions, the said commissions shall be revoked and annulled.\n\nIt is also agreed, that whenever a judge of the\ncourt of admiralty of either of the parties, shall pronounce sentence against any vessel or goods or property belonging to the subjects or citizens of the other party, a formal and duly authenticated copy of all the proceedings in the cause, and of the said sentence, shall, if required, be delivered to the commanders of the said vessel without the smallest delay, he paying all legal fees and demands for the same.\n\nArticle XX. It is further agreed, that both the said contracting parties shall not only refuse to receive any pirates into any of their ports, havens, or town, or permit any of their inhabitants to receive, protect, harbour, conceal, or assist them in any manner, but will bring to condign punishment all such inhabitants as shall be guilty of such acts or offences.\n\nAnd all their ships, with the goods or merchandizes taken by them, and brought into the ports of either of the said parties, shall be seized as far as they can be discovered, and shall be restored to the owners, or the factors or agents duly deputed and authorized in writing by them (proper evidence being shewn in the Court of Admiralty for proving the property) even in case such effects should have passed into other hands by sale, if it be proved that the buyers knew, or had good reason to believe or suspect that they had been piratically taken.\n\nArticle XXI. It is likewise agreed, that the subjects and citizens of the two nations shall not do\nany acts of hostility or violence against each other, nor accept commissions or instructions so to act from any foreign prince or state, enemies to the other party; nor shall the enemies of one of the parties be permitted to invite, or endeavour to enlist in the military service any of the subjects or citizens of the other party; and the laws against all such offences and aggressions shall be punctually executed. And if any subject or citizen of the said parties respectively shall accept any foreign commission, or letters of marque, for arming any vessel to act as a privateer against the other party, and be taken by the other party, it is hereby declared to be lawful for the said party to treat and punish the said subject or citizen, having such commission or letters of marque, as a pirate.\n\nArticle XXII. It is expressly stipulated that neither of the contracting parties will order or authorize any acts of reprisal against the other, on complaints of injuries or damages, until the said party shall first have presented to the other a statement thereof, verified by competent proof and evidence, and demanded justice and satisfaction, and the same shall either have been refused or unreasonably delayed.\n\nArticle XXIII. The ships of war of each of the contracting parties shall, at all times, be hospitably received in the ports of the other, their officers and crews paying due respect to the laws and government of the country. The officers shall\ntreated with that respect which is due to the commissions which they bear; and if any insult should be offered to them by any of the inhabitants, all offenders in this respect shall be punished as disturbers of the peace and amity between the two countries. And his Majesty consents, that in case an American vessel should, by stress of weather, anger from enemies, or other misfortunes, be reduced to the necessity of seeking shelter in any of his Majesty's ports, into which such vessel could not, in ordinary cases, claim to be admitted, she shall, on manifesting that necessity to the satisfaction of the government of the place, be hospitably received and permitted to refit, and to purchase at the market price such necessaries as she may stand in need of, conformably to such orders and regulations as the government of the place, having respect to circumstances of each case, shall prescribe. She shall not be allowed to break bulk or unload her cargo, unless the same shall be bona fide necessary to her being refitted: nor shall she be permitted to sell any part of her cargo, unless so much only as may be necessary to defray her expenses, and then not without the express permission of the government of the place; nor shall she be obliged to pay any duties whatever, except only on such articles as she may be permitted to sell for the purpose aforesaid.\n\nArticle XXIV. It shall not be lawful for any foreign privateers (not being subjects or citizens of\neither of the said parties) who have commissions from any other prince or state in enmity with either nation, to arm their ships in the ports of either of the said parties, nor to sell what they have taken, nor in any other manner to exchange the same; nor shall they be allowed to purchase more provisions than shall be necessary for their going to the nearest port of that prince or state from whom they obtained their commissions.\n\nArticle XXV. It shall be lawful for the ships of war and privateers, belonging to the said parties respectively, to carry whithersoever they please the ships and goods taken from their enemies, without being obliged to pay any fee to the offices of the Admiralty, or to any judges whatever; nor shall the said prizes, when they arrive at and enter the ports of the said parties, be detained or seized, neither shall the searchers or other officers of those places visit such prizes (except for the purpose of preventing the carrying of any part of the cargo thereof on shore, in any manner contrary to the established laws of revenue, navigation or commerce) nor shall such officers take cognizance of the validity of such prizes; but they shall be at liberty to hoist sail, and depart as speedily as may be, and carry their said prizes to the place mentioned in their commissions or patents, which the commanders of the said ships of war or privateers shall be obliged to shew.\nNo shelter or refuge shall be given in their ports to such as have made a prize upon the subjects or citizens of either of the said parties; but if forced, by stress of weather, or the dangers of the sea, to enter therein, particular care shall be taken to hasten their departure, and to cause them to retire as soon as possible. Nothing in this treaty contained shall, however, be construed to operate contrary to the former and existing public treaties with other sovereigns or states: But the two parties agree, that while they continue in amity, neither of them will in future make any treaty that shall be inconsistent with this or the preceding article.\n\nNeither of the said parties shall permit the ships or goods belonging to the subjects or citizens of the other to be taken within cannon shot of the coast, nor in any of the bays, ports or rivers of their territories, by ships of war, or others having commission from any prince, republic, or state whatever. But in case it should so happen, the party, whose territorial right shall thus have been violated, shall use his utmost endeavours to obtain from the offending party full and ample satisfaction for the vessels or vessels so taken, whether the same be vessels of war or merchant vessels.\n\nArticle XXVI. If at any time a rupture should take place (which God forbid) between his Majesty and the United States, the merchants and others of each of the two nations residing in the dominions of the other, shall have the privilege of\nremaining and continuing their trade so long as they behave peaceably, and commit no offence against the laws; and in case their conduct should render them suspected, and the respective governments should think proper to order them to remove, the term of twelve months, from the publication of the order, shall be allowed them for that purpose, to remove with their families, effects and property; but this favour shall not be extended to those who shall act contrary to the established laws; and for greater certainty it is declared, that such rupture shall not be deemed to exist while negotiations for accommodating differences shall be depending, nor until the respective ambassadors or ministers, if such there shall be, shall be recalled or sent home on account of such differences, and not on account of personal misconduct, according to the nature and degrees of which both parties retain their rights, either to request the recal, or immediately to send home the ambassador or minister of the other; and that without prejudice to their mutual friendship and good understanding.\n\nArticle XXVII. It is further agreed, that his Majesty and the United States, on mutual requisitions by them respectively, or by their respective ministers, or officers authorized to make the same, will deliver up to justice all persons, who being charged with murder or forgery, committed within the jurisdiction of either, shall seek an asylum within any of the countries of the other, provided\nthat this shall only be done on such evidence of criminality, as, according to the laws of the place where the fugitive or person so charged shall be found, would justify his apprehension and commitment for trial, if the offence had there been committed. The expense of such apprehension and delivery shall be borne and defrayed by those who make the requisition, and receive the fugitive.\n\nArticle XXVIII. It is agreed that the first ten articles of this treaty shall be permanent, and that the subsequent articles, except the twelfth, shall be limited in their duration to twelve years, to be computed from the day on which the ratifications of this treaty shall be exchanged, but subject to this condition:—That whereas the said twelfth article will expire, by the limitation therein contained, at the end of two years from the signing the preliminary or other articles of peace which shall terminate the present war in which his Majesty is engaged; it is agreed, that proper measures shall, by concert, be taken for bringing the subject of that article into amicable treaty and discussion, so early before the expiration of the said term, as that new arrangements on that head may by that time be perfected, and ready to take place. But if it should unfortunately happen, that his Majesty and the United States should not be able to agree on such new arrangements, in that case all the articles of this treaty, except the first ten, shall then cease and expire together.\nLastly, This treaty, when the same shall have been ratified by his Majesty, and by the president of the United States, by and with the advice and consent of their senate, and the respective ratifications mutually exchanged, shall be binding and obligatory on his Majesty, and on the said states, and shall be by them respectively executed and observed with punctuality, and the most sincere regard to good faith. And whereas it will be expedient, in order the better to facilitate intercourse and obviate difficulties, that other articles be proposed and added to this treaty, which articles, from want of time and other circumstances, cannot now be perfected, it is agreed, that the said parties will, from time to time, readily treat of and concerning such articles, and will sincerely endeavour so to form them, as that they may conduce to mutual convenience, and tend to promote mutual satisfaction and friendship; and that the said articles, after having been duly ratified, shall be added to, and make a part of this treaty.\n\nIn faith whereof, we, the undersigned Ministers Plenipotentiary of his Majesty the King of Great Britain and the United States of America, have signed this present treaty, and have caused to be affixed thereto the seal of our arms.\n\nDone at London, this Nineteenth day of November, One thousand seven hundred and ninety-four.\n\nGrenville. (L. S.)\nJohn Jay. (L. S.)\nSir,\n\nPhiladelphia, Sept. 5, 1793.\n\nI AM honoured with yours of August 30. Mine of the 7th of that month assured you, that measures were taken for excluding from all further asylum in our ports vessels armed in them to cruise on nations with which we were at peace, and for the restoration of the prizes, the Lovely Lass, Prince William Henry, and the Jane, of Dublin; and that should the measures for restitution fail in their effect, the president considered it as incumbent on the United States to make compensation for the vessels.\n\nWe are bound by our treaties with three of the belligerent nations, by all the means in our power, to protect and defend their vessels and effects in our ports or waters, or on the seas near our shores, and to recover and restore the same to the right owners when taken from them. If all the means in our power are used, and fail in their effect, we are not bound by our treaties with those nations to make compensation.\n\nThough we have no similar treaty with Great Britain, it was the opinion of the president, that we should use towards that nation the same rule, which, under this article, was to govern us with the other nations; and even to extend it to captures made on the high seas, and brought into our ports, if done by vessels which had been armed within them.\n\nHaving, for particular reasons, forbore to use all\nthe means in our power for the restitution of the three vessels mentioned in my letter of August 7th, the president thought it incumbent on the United States to make compensation for them. And though nothing was said in that letter of other vessels taken under like circumstances, and brought in after the 5th of June, and before the date of that letter, yet, when the same forbearance had taken place, it was and is his opinion, that compensation would be equally due.\n\nAs to prizes made under the same circumstances, and brought in after the date of that letter, the president determined, that all the means in our power should be used for their restitution. If these fail, as we should not be bound by our treaties to make compensation to the other powers in the analogous case, he did not mean to give an opinion that it ought to be done to Great Britain. But still, if any case shall arise subsequent to that date, the circumstances of which shall place them on similar ground with those before it, the president would think compensation equally incumbent on the United States.\n\nInstructions are given to the governors of the different states, to use all the means in their power for restoring prizes of this last description found within their ports; though they will of course take measures to be informed of them, and the general government has given them the aid of the custom-house officers for this purpose, yet you will be sen-\nsible of the importance of multiplying the channels of their information, as far as shall depend on yourself, or any person under your direction, in order that the governors may use the means in their power for making restitution.\n\nWithout knowledge of the capture they cannot restore it. It would always be best to give the notice to them directly; but any information which you shall be pleased to send me also at any time shall be forwarded to them as quickly as distance will permit.\n\nHence you will perceive, Sir, that the president contemplates restitution or compensation in the cases before the 7th of August; and after that date, restitution, if it can be effected by any means in our power: and that it will be important that you should substantiate the fact, that such prizes are in our ports or waters.\n\nYour list of the privateers illicitly armed in our ports, is, I believe, correct.\n\nWith respect to losses by detention, waste, or spoliation, sustained by vessels taken as before-mentioned, between the dates of June 5th and August 7th, it is proposed, as a provisional measure, that the collector of the customs of the district, and the British consul, or any other person you please, shall appoint persons to establish the value of the vessel and cargo at the time of her capture, and of her arrival in the port into which she is brought, according to their value in that port. If this shall\nbe agreeable to you, and you will be pleased to signify it to me, with the names of the prizes understood to be of this description, instruction will be given accordingly to the collectors of the customs where the respective vessels are.\n\nI have the honour to be, &c.\n\n(Signed)  \nTHOMAS JEFFERSON\n\nADDITIONAL ARTICLE.\n\nIt is further agreed between the said contracting parties, that the operation of so much of the twelfth article of the said treaty as respects the trade, which his said Majesty thereby consents may be carried on between the United States and his islands in the West Indies, in the manner and on the terms and conditions therein specified, shall be suspended.\n\nWe therefore, by virtue of these presents, do approve and ratify the said treaty, together with the said additional article, as the same are respectively set forth in this instrument of ratification; promising and engaging our royal word, that we will faithfully and religiously perform and observe all and singular the things agreed upon in this treaty, and that we will not suffer the same to be violated by any one, as far as lies in our power. For the greater testimony and validity whereof, we have caused our great seal to be affixed to these presents, which we have signed with our royal hand.\n\nGiven at our court at St. James's, the twenty-\neighth day of October, one thousand seven hundred and ninety-five, in the thirty-fifth year of our reign.\n\nG. R.\n\nRATIFICATION OF THE UNITED STATES.\n\nGeorge Washington, President of the United States of America,\n\nTo all and singular to whom these presents shall come, greeting.\n\nWHEREAS a certain treaty of amity, commerce, and navigation, between the United States of America and his Britannick Majesty was concluded and signed between their plenipotentiary the honourable John Jay, chief justice of the United States, and their envoy extraordinary to his said Majesty, and the plenipotentiary of his Britannick Majesty, the Right Honourable William Windham, Baron Grenville of Wotton, one of his Majesty's privy council, and his Majesty's secretary of state for foreign affairs, at London, on the nineteenth day of November, in the year of our Lord one thousand seven hundred and ninety-four; which treaty is word for word as follows; to wit,\n\n[Here follows the treaty.]\n\nAnd whereas the senate of the United States did, by their resolution on the twenty-fourth day of June, in the year of our Lord 1795, (all the sena-\ntors of the United States being then present, and two-thirds thereof concurring) \"consent to and advise the president of the United States to ratify the treaty of amity, commerce, and navigation, between his Britannick Majesty and the United States of America, concluded at London the nineteenth day of November, 1794, on condition that there be added to the said treaty an article, whereby it shall be agreed to suspend the operation of so much of the twelfth article as respects the trade which his said Majesty thereby consents may be carried on between the United States and his islands in the West Indies, in the manner, and on the terms and conditions therein specified.\"\n\nAnd whereas it will satisfy, and be conformable with the said advice and consent of the senate, if there be added to the said treaty an article in the following words, that is to say,\n\nAdditional Article.\n\n\"It is further agreed between the said contracting parties, that the operation of so much of the twelfth article of the said treaty as respects the trade which his said Majesty thereby consents may be carried on between the United States and his islands in the West Indies, in the manner and on the terms and conditions therein specified, shall be suspended.\"\n\nNow, therefore, I, George Washington, president\nof the United States of America, having seen and considered the treaty and additional article aforesaid, do, in pursuance of the aforesaid advice and consent of the senate of the United States of America, by these presents, ratify, accept and confirm the said treaty and the said additional article, as the same are herein before set forth.\n\nAnd I do moreover hereby declare, that the said treaty and the said additional article form together one instrument, and are a treaty between the United States of America and his Britannick Majesty, made by the president of the United States, by and with the advice and consent of the senate thereof.\n\nFor the greater testimony and validity of all which, I have caused the great seal of the United States of America to be affixed to these presents, and have signed the same with my hand.\n\nGiven at the city of Philadelphia, the fourteenth day of August, in the year one thousand seven hundred and ninety-five, and of the independence of the United States of America the twentieth.\n\n(Signed) Geo. Washington.\nBy the president of the United States of America.\n\n(Signed) Edm. Randolph,\nSecretary of State for the United States of America.\nHIS MAJESTY'S FULL POWER.\n\nGeorge R.\n\nGeorge the Third, by the grace of God, king of Great Britain, France and Ireland, defender of the faith, duke of Brunswick and Lunenburg, arch-treasurer and prince elector of the holy Roman empire, &c. To all to whom these presents shall come, greeting. Whereas, for the perfecting, confirming and rendering perpetual the peace, friendship and good understanding between us and our good friends the United States of America, for adjusting and terminating all subsisting differences and disputes, from whatever cause the same may have arisen between us and the said United States, or between our subjects and the people or inhabitants of the said States; for removing the grounds of future dissensions, and for promoting and extending the mutual intercourse of trade and commerce between our dominions and the territories of the said United States, we have thought proper to invest some fit person with full powers on our part to confer, treat, and conclude with John Jay, esquire, the envoy extraordinary of the said United States, to our court, now residing at our said court, and duly authorized in that behalf on the part of the said United States. Now know ye, that we, reposing especial trust and confidence in the wisdom, loyalty, diligence and circumspection of our right trusty and well-beloved counsellor William Windham,\nBaron Grenville of Wotton, and our principal secretary of state for foreign affairs, have nominated, constituted and appointed, and by these presents do nominate, constitute and appoint him our true, certain and undoubted commissioner, procurator and plenipotentiary: Giving and granting to him all and all manner of faculty, power and authority, together with general as well as special orders (so as the general do not derogate from the special, nor on the contrary) for us and in our name to meet, confer, treat and conclude with the said minister, furnished with sufficient powers on the part of our said good friends the United States of America, of and concerning all such matters and things as may be requisite and necessary for accomplishing and complicating the several ends and purposes herein before mentioned; and also for us and in our name to sign such treaty or treaties, convention or conventions, or other instruments whatsoever, as may be agreed upon in the premises, and mutually to deliver and receive the same in exchange; and to do and perform all such other acts, matters and things as may be any ways proper and conducive to the purposes above-mentioned, in as full and ample form and manner, and with the like validity and effect as we ourself, if we were present, could do and perform the same; engaging and promising on our royal word, that we will accept, ratify and confirm, in the most effectual manner, all such acts, matters and things, as shall be so transacted and\nconcluded by our aforesaid commissioner, procurator and plenipotentiary, and that we will never suffer any person to violate the same, in the whole or in part, or to act contrary thereto.\n\nIn testimony and confirmation of all which, we have caused our great seal of Great Britain to be affixed to these presents, signed with our royal hand.\n\nGiven at our palace at St. James's, the seventeenth day of November, in the year of our Lord one thousand seven hundred and ninety-four, and in the thirty-fifth year of our reign.\n\nFULL POWER OF THE UNITED STATES.\n\nGEORGE WASHINGTON, President of the United States of America.\n\nTo all and singular whom these presents shall concern, greeting, Know ye, that, for the purpose of confirming between the United States of America and his Britannic Majesty, perfect harmony and a good correspondence, and of removing all grounds of dissatisfaction, and from a special trust and confidence in the integrity, prudence and abilities of John Jay, chief justice of the United States, I have nominated, and, by and with the advice and consent of the senate, appointed the said John Jay, envoy extraordinary of the United States to his Britannic Majesty, hereby giving and granting to\nhim full and all manner of power and authority, as also a general and special command, at the court of his said Majesty, for and in the name of the United States, to meet and confer with the ministers, commissioners or deputies of his said Majesty, being furnished with sufficient authority, whether singly and separately, or collectively and jointly, and with them to agree, treat, consult and negotiate of and concerning all matters and causes of difference subsisting between the United States and his said Majesty, whether the same respect the inexecution or infraction of the armistice declaring a cessation of hostilities between the United States of America and his Britannic Majesty, at Versailles, on the 20th day of January, 1783, or the definitive treaty of peace made between the United States and his said Majesty on the 3d day of September, 1783, or the instructions of his said Majesty to his ships of war and privateers, of whatsoever date, but especially on the 39th of June, 1793, the 6th of November, 1793, and the 8th of January, 1794; or restitution or compensation in the cases of capture or seizure made of the property of the citizens of the United States by the said ships of war and privateers, or retribution for the injuries received therefrom by any citizen of the United States: and also of and concerning the general commerce between the United States and the kingdoms and dominions of his Britannic Majesty, wheresoever they may be; and to conclude or sign a treaty or treaties, conven-\ntion or conventions, touching the premises; transmitting the same to the President of the United States of America for his final ratification, by and with the advice and consent of the Senate of the United States.\n\nIn testimony whereof, I have caused the seal of the United States to be hereunto affixed. Given under my hand, at the city of Philadelphia, this sixth day of May, one thousand seven hundred and ninety-four, and of the independence of the United States of America the eighteenth.\n\n(L. S.) (Signed) GEO. WASHINGTON.\n\nBy the President of the United States of America,\n\n(Signed) EDM. RANDOLPH,\nSecretary of State.\n\nNOTE.—The undersigned Henry Richard Vassal, lord Holland, and William, lord Auckland, plenipotentiaries of his Britannic Majesty, have the honour to inform James Monroe and William Pinkney, commissioners extraordinary and plenipotentiaries of the United States of America, that they are now ready to proceed to the signature of the treaty of amity, commerce, navigation, on the articles of which they have mutually agreed. But at the same time they have it in command from his majesty, to call the attention of the commissioners of the United States, to some extraordinary proceed-\nings which have lately taken place on the continent of Europe, and to communicate to them officially the sentiments of his majesty's government thereupon. The proceedings alluded to, are certain declarations and orders of the French government, issued at Berlin, on the 21st of November last. In those orders the French government seeks to justify or palliate its own unjust pretensions, by imputing to Great Britain principles which she never professed, and practices which never existed. His majesty is accused of a systematic and general disregard of the law of nations, recognized by civilized states, and more particularly of an unwarrantable extension of the right of blockade; whereas his majesty may confidently appeal to the world, on his uniform respect for neutral rights, and his general and scrupulous adherence to the law of nations, without condescending to contrast his conduct in these particulars, with that of his enemy; and with regard to the only specific charge, it is notorious, that he has near declared any ports to be in a state of blockade, without allotting to that object a force sufficient to make the entrance into them manifestly dangerous. By such allegations, unfounded as they are, the enemy attempts to justify his pretensions of confiscating, as lawful prize, all produce of English industry or manufacture, though it be the property of neutrals; of excluding from his harbours every neutral vessel which has touched at any port of his majesty's dominions though employed in an inno-\ncent commerce; and of declaring Great Britain to be in a state of blockade, though his own ports and arsenals are actually blockaded, and he is unable to station any naval force whatever before any port of the United Kingdom. Such principles are in themselves extravagant, and repugnant to the law of nations; and the pretensions founded on them, though professedly directed solely against Great Britain, tend to alter the practice of war among civilized nations, and utterly to subvert the rights and independence of neutral powers. The undersigned cannot therefore believe that the enemy will ever seriously attempt to enforce such a system. If he should, they are confident that the good sense of the American government will perceive the fatal consequences of such pretensions to neutral commerce, and that its spirit and regard to national honour, will prevent its acquiescence in such palpable violations of rights, and injurious encroachments on its interests.—If, however, the enemy should carry these threats into execution, and if neutral nations should, contrary to all expectation acquiesce in such usurpations, his Majesty might probably be compelled, however reluctantly, to retaliate in his own just defence, and to issue orders to his cruisers to adopt towards the neutrals any hostile system to which those neutrals shall have submitted from his enemies. The commissioners of the United States will therefore feel,\nthat at a moment when his majesty and all the neutral nations are threatened with such an extension of the belligerent pretensions of his enemies, he cannot enter into the stipulations of the present treaty without an explanation from the United States of their intentions, or a reservation on the part of his majesty in the case above mentioned, if it ever should occur. The undersigned, considering that the distance of the American government, renders any immediate explanation on the subject impossible, and animated by a desire of forwarding the beneficial work in which they are engaged, are authorized by his majesty to conclude the treaty without delay. They proceed to the signature under the full persuasion that before the treaty shall be returned from America, with the ratification of the United States, the enemy will either have formally abandoned, or tacitly relinquished, his unjust pretensions, or that the government of the United States by its conduct or assurances, will have given security to his Majesty, that it will not submit to such innovations in the established system of maritime law; and the undersigned have presented this note from an anxious wish, that it should be clearly understood on both sides, that without such abandonment of his pretensions, on the part of the enemy, or such assurances or such conduct on the part of the United States his Majesty will not consider himself bound by the present signature of his commissioners to ratify the treaty,\nor precluded from adopting such measures as may seem necessary for counteracting the designs of his enemy whenever they shall occur, and be of such an extraordinary nature as to require extraordinary remedies. The undersigned cannot conclude, without expressing their satisfaction at the prospect of accomplishing an object so important to the interests and friendly connections of both nations, and their just sense of the conciliatory disposition manifested by the commissioners of the United States during the whole course of the negotiations.\n\n(Signed) Vassal Holland.\nAuckland.\n\nJames Monroe, &c.\nWilliam Pinkney, &c.\n\nDec. 31, 1806.\n\nThe following are the Articles of the New Treaty, which differ from the Treaty concluded by Mr. Jay, in 1791.\n\nThe first article, like the first of that concluded on the 19th of November, 1794, by Mr. Jay, is merely formal; and the second confirms the first ten articles of the old treaty.\n\nThe third article of the new treaty provides for and regulates commerce between the United States and the British East Indies, in the same terms as the 13th article of the old treaty, except that the\nwords \"and sailing direct from the ports of the said States,\" are inserted in the first clause, which now runs thus:—\"His Majesty consents that the vessels belonging to the citizens of the United States of America, and sailing direct from ports of the said States, shall be admitted and hospitably received in all the sea-ports and harbours of the British territories in the East Indies,\" &c.\n\nThe fifth article of the new treaty is the same as the fifteenth of the old one (regulating the duties on ships and merchandize), with two exceptions: the first reserves to the United States the right previously reserved to Great Britain, of imposing a tonnage duty equal to what shall be imposed by the other party. The second is made by substituting a new clause for the reservation formerly made by Great Britain, of the right of imposing on American vessels entering into the British ports in Europe, such duty as may be adequate to counteract the difference of duty now payable on the importation of European and Asiatic goods, when imported into the United States in British or in American vessels. Instead of this, the following words make part of the new article:—\"And in the trade of the two nations with each other, the same duties on the exportation or importation of goods or merchandize shall be imposed, and the same drawbacks and bounties allowed in either country, whether the exportation or importation shall be in British or American vessels.\"\nThe sixth article states, that the parties cannot agree about the American trade to the West Indies, but that \"while they will attempt an amicable agreement, both may exercise their existing rights.\"\n\nThe ninth is the same as the old, respecting contraband, only that tar and pitch are excepted from the catalogue, unless when going to a place of naval equipment.\n\nBy the eleventh article, citizens of the United States may carry European goods to the colonies of enemies of Great Britain (from the ports of the United States), provided that both vessel and cargo be bona fide American property; that the goods shall have been unladen within the United States; and that (in addition to that part of the duty already reserved from the drawback on exportation) the further sum of one per cent. ad valorem on such goods shall be paid. They may also export from the United States to Europe, the produce of colonies of the enemies of Great Britain, provided they, being neutral property, shall have been unladen as before, and that two per cent. ad valorem, be paid on exportation, in addition to what is reserved on the drawback. After the expiration of the treaty, all antecedent rights on these subjects are to revive.\n\nThe twelfth article extends to ships of Great Britain, and to all nations who shall adopt the same regulation, the protection of neutrality from a marine league of five miles from the American shore.\nThe twenty-second is a new article respecting shipwrecks, and promising humane treatment.\n\nThe twenty-third secures to each the rights of the most favoured nation, and declares, that \"all treaties hereafter made by either with any nation, shall ipso facto be extended in all their favourable operations to the other.\"\n\nThe twenty-fourth article engages to join in abolishing the slave trade.\n\nThe twenty-sixth limits the duration of the treaty to ten years, from the exchange of ratifications.\n\n---\n\nCopy of a Letter from Mr. Merry, late Minister from the Court of Great Britain to the United States, received from him by a Gentleman at New York.\n\n\"Clarges Street, August 11, 1807.\n\n\"I have been favoured with your letter, to which I have deferred replying, in the daily expectation that some official accounts from America, would have enabled his Majesty's Government to have determined on the line of conduct that it may ultimately appear expedient to pursue, in the critical state of our relations with that country. For a definition of the manner in which the question stands at this moment, and will remain until official information be received respecting the pretensions of the American Government towards an adjust-\nment of the complaint on their part, occasioned by\nthe affair between his Majesty's ship Leopard and\nthe Chesapeak frigate, I cannot do better than\nrefer you to the explanation given last night by Mr.\nCanning, in the House of Commons.\n\n\"To that statement; however, it may be satis-\nfactory I should add, that as Government have, in\ntheir explanation with the American minister here,\ndisavowed the principle upon which Admiral Ber-\nkeley has acted, and recalled him, in consequence\nof the orders he issued, there is great room to hope\nthat this affair will be settled in an amicable way.\"\n\nTHE END.\n\n'T. Gillet, Printer, Wild Court.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_38163.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 155, "total-input-tokens": 247134, "total-output-tokens": 48479, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1539, 3], [1539, 2645, 4], [2645, 2861, 5], [2861, 4907, 6], [4907, 5064, 7], [5064, 5064, 8], [5064, 6354, 9], [6354, 7816, 10], [7816, 9268, 11], [9268, 10741, 12], [10741, 12131, 13], [12131, 13569, 14], [13569, 15042, 15], [15042, 16505, 16], [16505, 17988, 17], [17988, 19491, 18], [19491, 20984, 19], [20984, 22491, 20], [22491, 23635, 21], [23635, 25100, 22], [25100, 26471, 23], [26471, 27938, 24], [27938, 29351, 25], [29351, 30711, 26], [30711, 32130, 27], [32130, 33441, 28], [33441, 34954, 29], [34954, 36461, 30], [36461, 37946, 31], [37946, 39409, 32], [39409, 40851, 33], [40851, 42316, 34], [42316, 43771, 35], [43771, 45263, 36], [45263, 46723, 37], [46723, 48187, 38], [48187, 49616, 39], [49616, 51050, 40], [51050, 52528, 41], [52528, 53956, 42], [53956, 55405, 43], [55405, 56878, 44], [56878, 58343, 45], [58343, 59828, 46], [59828, 61261, 47], [61261, 62727, 48], [62727, 64151, 49], [64151, 65600, 50], [65600, 67119, 51], [67119, 68579, 52], [68579, 70058, 53], [70058, 71506, 54], [71506, 72998, 55], [72998, 74483, 56], [74483, 75983, 57], [75983, 77474, 58], [77474, 78973, 59], [78973, 80410, 60], [80410, 81917, 61], [81917, 83456, 62], [83456, 84961, 63], [84961, 86430, 64], [86430, 87890, 65], [87890, 89351, 66], [89351, 90772, 67], [90772, 92265, 68], [92265, 93725, 69], [93725, 95195, 70], [95195, 96673, 71], [96673, 98125, 72], [98125, 99574, 73], [99574, 101053, 74], [101053, 102468, 75], [102468, 103947, 76], [103947, 105389, 77], [105389, 106878, 78], [106878, 108346, 79], [108346, 109807, 80], [109807, 111300, 81], [111300, 112789, 82], [112789, 114257, 83], [114257, 115738, 84], [115738, 117204, 85], [117204, 118660, 86], [118660, 120177, 87], [120177, 121675, 88], [121675, 123126, 89], [123126, 124617, 90], [124617, 126107, 91], [126107, 127634, 92], [127634, 129090, 93], [129090, 130656, 94], [130656, 132222, 95], [132222, 132222, 96], [132222, 132222, 97], [132222, 132222, 98], [132222, 133589, 99], [133589, 134689, 100], [134689, 136139, 101], [136139, 137608, 102], [137608, 139078, 103], [139078, 140535, 104], [140535, 141951, 105], [141951, 143388, 106], [143388, 144751, 107], [144751, 146181, 108], [146181, 147639, 109], [147639, 149051, 110], [149051, 150465, 111], [150465, 151939, 112], [151939, 153439, 113], [153439, 154906, 114], [154906, 156352, 115], [156352, 157816, 116], [157816, 159261, 117], [159261, 160655, 118], [160655, 162128, 119], [162128, 163635, 120], [163635, 165124, 121], [165124, 166595, 122], [166595, 168068, 123], [168068, 169555, 124], [169555, 171009, 125], [171009, 172514, 126], [172514, 173953, 127], [173953, 175416, 128], [175416, 176884, 129], [176884, 178298, 130], [178298, 179795, 131], [179795, 181279, 132], [181279, 182754, 133], [182754, 184150, 134], [184150, 185511, 135], [185511, 186951, 136], [186951, 188360, 137], [188360, 189688, 138], [189688, 190810, 139], [190810, 192104, 140], [192104, 193282, 141], [193282, 194651, 142], [194651, 196150, 143], [196150, 197364, 144], [197364, 198883, 145], [198883, 200091, 146], [200091, 201612, 147], [201612, 203044, 148], [203044, 204534, 149], [204534, 205665, 150], [205665, 207121, 151], [207121, 208539, 152], [208539, 209763, 153], [209763, 210395, 154], [210395, 210395, 155]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]