[{"id": "a865fccbc236fab118c1ce03b380b3346420e521", "text": "FARMING IN THE NORTH WEST\n\nMANITOBA\nASSINIBOIA\nALBERTA\nSASKATCHEWAN\nHOW TO PURCHASE RAILWAY LANDS.\n\nRegulations for the Sale of Lands of the Canadian Pacific Railway Company.\n\nThe Canadian Pacific Railway Company offers for sale some of the finest Agricultural Lands in Manitoba and the North-West. The lands belonging to the Company in each Township within the Railway belt, which extends twenty-four miles from each side of the main line, will be disposed of at prices ranging\n\nFROM $2.50 PER ACRE UPWARDS.\n\nDetailed Prices of Lands can be obtained from the Land Commissioner at Winnipeg.\n\n(These Regulations are substituted for and cancel those hitherto in force.)\n\nTERMS OF PAYMENT.\n\nIf paid for in full at time of purchase, a Deed of Conveyance of the land will be given; but the purchaser may pay one-tenth in cash, and the balance in payments spread over nine years, with interest at six per cent. per annum, payable at the end of the year with each instalment.\n\nGENERAL CONDITIONS.\n\nAll sales are subject to the following general conditions:\n\n1. All improvements placed upon lands purchased to be maintained until final payment.\n2. All taxes and assessments lawfully imposed upon the land or improvements to be paid by the purchaser.\n3. The Company reserves from sale, under these regulations, all mineral and coal lands; and land containing timber in quantities, stone, slate and marble quarries, lands with water power thereon, and tracts for town sites and railway purposes.\n4. Mineral, coal and timber lands and quarries, and lands controlling water power, will be disposed of on very moderate terms to persons giving satisfactory evidence of their intention and ability to utilize the same.\n\nThe Canadian Government contemplates granting bonuses to Bona Fide settlers from Europe, on lands in the Province of Manitoba and Western Territories of Canada and British Columbia, and it is recommended that Booking Agents be asked for particulars in regard to this matter.\n\nLiberal rates for settlers and their effects will be granted by the Company over its Railway.\n\nFor further particulars apply to\n\nL. A. HAMILTON, Land Commissioner,\nCanadian Pacific Railway Co., Winnipeg.\n\nSOUTHERN MANITOBA LANDS.\n\nFor those desirous of purchasing, the LAND GRANT of the MANITOBA SOUTH-WESTERN COLONIZATION RAILWAY COMPANY, only now placed on the market, offers special attractions. It consists of over 1,000,000 acres of the choicest land in America, well adapted for grain growing and mixed farming, in a belt 21 miles wide, immediately north of the International Boundary, and from Range 13 westward. That portion of this grant lying between range 13 and the western limit of Manitoba is well settled, the homesteads having been long taken up. Purchasers will at once have all the advantages of this early settlement, such as schools, churches and municipal organization. The fertility of the soil has been amply demonstrated by the splendid crops that have been raised from year to year in that district. The country is well watered by lakes and streams, the principal of which are Rock Lake, Pelican Lake, Whitewater Lake, and the Souris River and its tributaries, while never-failing spring creeks take their rise in the Turtle Mountain. Wood is plentiful, and lumber suitable for building purposes is manufactured at Desford, Deloraine and Wakopa, and may be purchased at reasonable prices. At the two latter points grist mills are also in operation.\n\nThe terms of purchase of the Manitoba, South-Western Colonization Railway Company are the same as those of the Canadian Pacific Railway Company.\nFARMING\n\nIN THE\n\nNORTH-WEST\n\nMANITOBA, ASSINIBOIA,\n\nALBERTA,\n\nSASKATCHEWAN.\n\n(Montreal 1890)\nThe Canadian North-West.\n\nWHERE FARMING PAYS.\n\nActual results have demonstrated beyond dispute that there is no better country than the Canadian North-West for the farmer-immigrant. Certainly there is no more advantageous territory on the continent of America for the investment of capital in agricultural pursuits, or for the man without capital to attain independence by intelligently directed industry.\n\nThe superior quality of the wheat and other cereals grown upon these lands and the greater yield per acre, when compared with any other portions of the continent, is now universally acknowledged, and, while the crops obtained are greater, the amount of labor required to produce them, owing to the nature of the soil, is less than in any other country. The climate and natural pasturage are both highly favorable to stock-raising, and as a result no finer cattle are to-day shipped across the Atlantic to the English market, than those which have matured upon the plains of Manitoba and the North-West territories.\n\nThe question, then, before the intending emigrant, is not whether it is a good thing to go to the Canadian North-West, but simply in what part of that great country it will be best to make his home; what particular line of agricultural industry he shall engage in, and how best to prepare for it.\n\nThe object of this publication is to lay before the intending colonist reliable information concerning the subjects of which it treats, and the better to attain that object a large number of letters and statements from farmers and others now residing in the country, are introduced.\n\nBEGINNING FARMING IN THE WEST.\n\nColonists from Europe, having arrived in Canada, are able to travel to new homes in Ontario, Manitoba, the North-West, or British Columbia in nearly as great comfort as first-class passengers.\nThe cars devoted to the use of colonists are taken upon the same fast trains with the first-class cars. They are convertible into sleeping cars at night, having upper and lower berths constructed on the same principle as those of the first-class sleeping cars, and equally comfortable as to ventilation, etc. They are taken through, without change, all the way from Montreal to Manitoba. No other railway in America can do this. No extra charge is made for the sleeping accommodation. Second-class passengers, however, must provide their own bedding. If they do not bring it with them, a complete outfit of mattress, pillow, blanket and curtains will be supplied by the agent of the Company at the point of starting, at a cost of $2.50—ten shillings. The curtains may be hung around a berth, turning it into a little private room. In addition to this, men travelling alone are cut off from families by a partition across the car near the middle; and smoking is not permitted in that part of the car where the women and children are.\n\nAt short intervals, the train stops at stations where meals are served in refreshment rooms, and where hot coffee and tea, and well-cooked food may be bought at very reasonable prices. The cars are not allowed to become over-crowded, and the safety and welfare of colonist or second-class passengers are carefully attended to. The baggage arrangements are the same as for first-class passengers, and every possible care is taken that the colonist does not go astray, lose his property or suffer imposition. Where a large number of colonists are going to the west together, special fast trains of colonist sleeping cars are dispatched.\n\nNo other railway in America offers such good accommodation to second-class, or colonist passengers, as does the Canadian Pacific.\n\nThe train is met upon its arrival at Winnipeg by the agents of the Government and of the Canadian Pacific Railway Company, who take charge of colonists and give them all the assistance and advice they require in regard to their new home.\n\nIn cases where they have already fixed upon some locality for settlement, where friends are awaiting them, they are shown how to proceed directly to that point. If they have not decided upon such a locality, but intend to seek a home somewhere further west, they should immediately call upon the Land Commissioner of the Canadian Pacific Railway Company. The price of the railway lands for sale, their nearness to a railway station or market, the amount of settlement, the nationality of people in the neighborhood, and the exact character of the soil can be learned at his office. Every quarter section of the whole vast area owned by the Railway Company has been gone over by official inspectors and reported in detail.\nAll this information is open to the intending settler. If the land of a certain section is unsuitable for a certain class of farming, he is told so; if it is good land for grazing, he learns that; if it is thoroughly fertile and desirable, this will be pointed out. In short, the whole truth can be learned from the maps and surveyor's notes shown in this office.\n\nMost men, nevertheless, naturally wish to examine for themselves the section which seems to them from these reports most suitable, and this is strongly recommended in every case. They are then told what is the quickest and cheapest way to reach it (special facilities being provided for this purpose), and, when necessary, are furnished by the Dominion Government Intelligence Officer with a guide, who either accompanies them all the way from Winnipeg, or meets them at the nearest railway station, and goes with them to the designated locality. If they are pleased (which is usually the case) all the arrangements for taking up the piece of land chosen, or for its purchase, are made at once at the nearest agency, and they can immediately take possession. Only a very few days, therefore, need elapse between the arrival of an immigrant in Winnipeg and his settlement upon the land of his choice.\n\nMeanwhile, his family and baggage can remain at the immigrant house in safety and comfort. Providing themselves with food in the city markets, they can cook their own meals upon the stoves in the house; and, with the bedding which has served them during their journey, they can sleep in comfort in the bunk-bedsteads with which the rooms are fitted. Should they prefer, however, to stop at a hotel, they will find in Winnipeg public houses of all grades, where the total cost for each person varies from $1 (4s.) to $3 (12s.) a day, according to accommodation desired.\n\nIt sometimes happens that the immigrant has not much more than sufficient money to carry him as far as Winnipeg. In that case he will be anxious to begin immediately to earn some money. The Dominion Government has an agency in Winnipeg whose business it is to be informed where labor is needed. Societies representing almost all the nationalities of Europe have been formed in Winnipeg, and will welcome and see to the welfare of their respective countrymen.\n\nThe arrival of a party of immigrants is always announced in advance, so that contractors who are employing men in building, railway construction, or in some other work in the city of Winnipeg or neighborhood, may take as many of the newcomers as choose to go to work with them. At Portage la Prairie, Carberry, Brandon, Moosomin, and other stations further west, farmers are generally on the lookout for parties of immigrants, in the hope of finding among them one or more able assistants, to whom wages are paid according\nto qualifications. The average wages paid to experienced farm hands is about $20.00 per month, with board. Of course much higher wages prevail during the harvest season. Women and girls who are accustomed to housework, and of a willing mind, are always in great demand in Winnipeg and other towns, and can earn $8.00 to $20.00 per month and board. There is no reason, therefore, why honest, industrious and capable men or women should not be able to find steady employment within a very few days after their arrival.\n\n**Necessaries.**\n\nThe following table will afford a criterion as to the probable cost of necessaries for a family. It will be found that in any centre purchases may be freely made on the figures named:\n\n| Item                                      | Price per Unit |\n|-------------------------------------------|----------------|\n| Grey cotton, 36 in.                       | $0.05 to $0.10 |\n| White                                     | $0.07 \" $0.15  |\n| Duck or drill, oz                         | $0.15 \" $0.25  |\n| Ticking                                   | $0.15 \" $0.25  |\n| Print or calico, fast colors              | $0.07 \" $0.15  |\n| Gingham                                   | $0.07 \" $0.25  |\n| Flannel                                   | $0.15 \" $0.45  |\n| Cottonades                                | $0.85          |\n| Tweed                                     | $0.50 \" $2.00  |\n| Full cloth                                | $0.50 \" $0.85  |\n| Men's long boots, strong                  | $2.00 \" $5.00  |\n| Boys'                                     | $1.50 \" $2.50  |\n| Men's lace boots, \"                       | $1.25 \" $4.00  |\n| Boys'                                     | $1.00 \" $2.50  |\n| Women's shoes, good and strong            | $1.00 \" $2.00  |\n| Men's woolen socks                        | $2.25 \" $3.00  |\n| \" stockings                               | $2.00 \" $4.00  |\n| Men's suits, good, serviceable and warm   | $10.00 \" $15.00|\n| Men's overcoats, good, serviceable and warm| $8.00 \" $15.00 |\n| Sugars                                    | $0.08 \" $0.11  |\n| Teas                                      | $0.25 \" $0.60  |\n| Tobacco                                   | $0.50 \" $0.60  |\n| Coffee                                    | $0.30 \" $0.50  |\n| Flour                                     | $2.90 \" $3.75  |\n| Prunes                                    | $0.08          |\n| Currants                                  | $0.10          |\n| Rice                                      | $0.06 \" $0.07  |\n| Raisins                                   | $0.10 \" $0.13  |\n| Nails, cut                                | $0.04 \" $0.05  |\n| Hinges                                    | $0.10          |\n| Building paper                            | $0.03          |\n| Cooking stove, wood or coal, without utensils | $18.00 \" $25.00|\n| \" with utensils                           | $23.00 \" $30.00|\n| Parlor stove, \"                           | $5.00 \" $35.00 |\n| Set dishes, complete                      | From $2.50     |\n| Table                                     | $2.00 upwards  |\n| Chairs                                    | $6.00 to $9.00 |\nBedstead .................................................. $2.00 to $5.00\nSideboard .................................................. $12.50 upwards.\nLumber .................................................. per M. 18.00 to 20.00\nRough boards .............................................. \" 20.00\nDressed lumber .......................................... \" 21.00\nDimension stuff, joists, scantling, etc ............ \" 20.00\nSiding and flooring ..................................... \" 22.00 to 24.00\nBricks at kiln .............................................. \" 9.00\n\nFor those who wish to live in idleness, or expect to get rich in some uncertain way without work, the North-West is no place.\n\nCAPITAL REQUIRED.\n\nAs is shewn by the appended statements, many a man has gone into the west with no money at all, and succeeded in attaining independence by taking up land and working steadily for a few years. But, while a new comer can do all this by thrift and industry, it will prove much easier to accomplish if he has a small capital to begin with. It will also save him valuable time.\n\nThe question \"How much is necessary?\" is a difficult one to answer. It depends upon circumstances. Hundreds have succeeded on none at all, others have failed on ten thousand dollars. Good or bad management is the secret. Some statements of what can be done upon a certain capital, say 500 dollars (£100) or 1,000 dollars (£200) or 3,000 dollars (£600) may, nevertheless, be advantageous.\n\nThis information has been given by many writers, in tables of various kinds and for various localities; but all amount to about the same conclusion, namely:\n\nThat 500 dollars (£100) will set a man down upon some western quarter-section, either a free homestead, or one chosen among the cheaper lands belonging to the Railway Company, and enable him to build a house and stay there until his farm becomes productive and self-supporting. With this capital, however, the purchase of land is not usually advisable if a suitable free grant can be obtained.\n\nIn this connection a practical farmer of some years residence in Manitoba speaks as follows:\n\n\"Land can be purchased cheaply here, or it can be had for nothing by homesteading. A single man can start on an outlay of $385, made up as follows: One yoke of oxen and harness $115; plow, harrow, etc., $40; stove and kitchen furnishings $40; bedding, etc., $20; lumber, doors windows, etc., for log house $50; provisions $90; seed $30. A\nfarmer with a family of five would have to lay out $240 more, bringing his outlay up to $625.\n\nA farmer can come in about the middle of March, select his land and build his shanty; he can commence to plough about the fifth of April; he can break ten acres and put it under crop on the sod; he can continue breaking for two months after he puts the ten acres under crop, and can break thirty acres, and backset the forty acres in the fall ready for crop in the spring. He can raise enough on the ten acres to give him a start; he can cut hay enough for his oxen and a cow in July, and it will cost him about $60 additional to seed the forty acres in the spring.\n\nSuppose he puts in 30 acres of wheat, and raises 25 bushels to the acre, at 80 cents per bushel, it will be worth $600; say 5 acres of oats at 40 bushels per acre at 35 cents per bushel, $70; say 1 acre of potatoes, 200 bushels, at 40 cents, $80; 3 acres of barley, 40 bushels per acre, worth 40 cents, $48; and 1 acre of garden stuff at $120; total $918. After deducting expenses of harvesting and the whole original outlay the farmer will still have something to the good to start with next year.\"\n\nNote.—This pamphlet is one of a most useful series published by the Canadian Pacific Railway Company. The series comprise the following pamphlets:—\"Dairy Farming and Ranching,\" \"A Scotch Farmer's Success,\" \"100 Farmers Testify,\" \"The Manitoba Land Folder,\" \"British Columbia,\" etc., also publications of a similar nature printed in French and German.\n\nThese contain much valuable information, are handsomely illustrated, and have been carefully revised and corrected up to the close of 1890. No effort has been spared to make them as complete and reliable as possible, and every intending colonist should have them. Copies of one, or all, of these pamphlets will be mailed free to any address, upon application to any agent of the Canadian Pacific Railway.\nManitoba.\n\nITS SOIL, CLIMATE, PRODUCTIONS AND GENERAL CHARACTERISTICS.\n\nManitoba is naturally divided into four general districts; the valley of the Red River, which wends northward near the eastern border and is the well known country populated by the fur-traders, their half-breed employees and Lord Selkirk's colonists a century ago; second, the southern portion drained by the Souris and Pembina Rivers and including the Souris Plain; third, the valley of the Assiniboine and Little Saskatchewan rivers, or western middle portion traversed by the main line of the Canadian Pacific; and fourth, the low, marshy district surrounding lakes Manitoba and Winnipeg, and the timber lands of the northern part of the Province.\n\nTHE RED RIVER VALLEY\n\nThis district can be disposed of in a few words, as its extraordinary fertility is sufficiently well known. Actual farming is confined chiefly to the lands along the banks of the Assiniboine and Red Rivers, where, at Silver Heights, St. Boniface, Kildonan, St. Andrew's, Selkirk, and other spots within the limits of the old Scotch and Red River settlements, farms were flourishing half a century ago. Away from the river banks, the lands south to Morris, and west to Raeburn, owe their chief value to the nutritious native grasses, which furnish at once most valuable pasturage and an unlimited quantity of choice hay to supply the City of Winnipeg and adjacent towns, and surrounding farms. Still, the richness of the soil has latterly been attracting the attention of in-coming farmers anxious to locate near an important centre like Winnipeg, and as a result neat farm buildings are dotted all over what was only a short time ago an unbroken meadow.\nSOUTHERN MANITOBA.\n\nThis district is penetrated by two railways. The Manitoba South-western runs from Winnipeg up the Assiniboine Valley (but some distance south of that river) to Carman, Treherne, Holland, and Glenboro its present terminus, a station 105 miles from Winnipeg, and not far from the mouth of the Souris. An extension of this line is now under construction, westward from Glenboro to the mouth of Plum Creek, a tributary of the Souris. This line will pass through the centre of a rich tract of territory known as the Elliott settlement. The Pembina Mountain branch after crossing the Assiniboine diverges at Rosenfeld from the railway constructed from Winnipeg to Morris and Gretna along the western banks of the Red River, and thence runs westward through the Pembina Valley to Deloraine, distant about 200 miles from Winnipeg. Excepting the wooded hills and hollows of the broken and picturesque plateau called Pembina Mountain, through which the river has cut a deep and winding ravine which the railway crosses, and some other limited spots, the whole of this vast region is undulating prairie covered with luxurious grass. There are many living streams, chief of which are the Pembina and Souris, and in the southern part several large lakes, one of which, Pelican, is the largest of a chain of half a dozen or more strung together in what was once the channel of a powerful river. This lake is thirteen miles long, and bordered by steep and lofty cliffs, which are densely wooded, and the resort of deer and game birds, while the water abounds in fine fish and flocks of wild fowl. These lakes are bordered by a line of elevations called the Tiger Hills, which furnish wood in abundance. The next largest body of water is White-water Lake, near Deloraine, many miles in breadth, shallow, and bordered by marshes that attract countless flocks of geese, swan, crane, wild duck, etc., etc. Many lesser lakes dot the landscape. These are surrounded by luxuriant grass, affording the settlers natural hay in abundance and an unfailing supply of water for stock, for which this district is admirably adapted. In many spots, dry during all the summer months, moisture enough gathers to promote a plentiful growth of forage, so that the sowing of hay or other fodder is never thought of. Two tons of this wild hay per acre is not an unusual amount to cut. The Souris Valley is well occupied, and good roads traverse the country in every direction; though, for that matter, one can drive across the prairie anywhere. Along the lower Souris are many villages, where a post-office, stores, blacksmith shop, school and church, form the centre of a farming community, whose houses dot the surrounding knolls as far as the\neye can reach. These extend all the way westward to the Moose Mountain settlements.\n\nThe climate of this part, which has been appropriately called \"the garden of Manitoba,\" is not greatly different from that of the west, except that its southerly latitude gives an advantage in respect to earlier springs and later autumns.\n\nGovernment lands in this part of Manitoba are almost all taken, but much desirable land remains to be bought from the Railway Company at from $2.50 to $10.00 (10s. to £2) an acre, according to distance from railway, etc. Improved property can be bought near the railway at from $5 to $15 (£1 to £3) an acre. The soil is deep and of almost inexhaustible richness. The growth of grasses and prairie herbage is remarkable, and astonishing crops of cereals and roots are recorded. Generally speaking, it is a very deep sandy loam, dark with the deposit of centuries of burned herbage, overlying coarse clay. The streams and most of the lakes and sloughs furnish clear and sweet water, and the banks are gravelly. Wells strike excellent water at a moderate depth. Every crop belonging to western Canada or the northern United States can be grown there to advantage.\n\nPotatoes and all classes of vegetables grow and reach amazing sizes.\n\nOn the Pembina Mountain Branch Railway is a long line of flourishing villages—Morden Manitou, Pilot Mound, Cartwright, Killarney (by the picturesque lake of that name), Boissevain and Deloraine, with lesser intermediate stations.\n\nMorden is a brisk town of 1,000 people, and stands just east of the Pembina Mountain district, that is, on the eastern borders of the second prairie steppe. Fine farms surround it, and one source of its prosperity is in trading with the Mennonite settlements.\n\nThe Mennonites are a body of emigrants from Russia (though of German origin), who fled from persecution on account of their religion, which is a primitive form of Lutheranism. The Dominion Government, in 1876, set apart a large reserve for them between Morden and the International boundary, and loaned them sufficient money to make a beginning. They have fully justified the wisdom of this welcome and aid, and have overcome by their industry and perseverance every obstacle to success. They are a very peaceable, contented and industrious people, and have prospered so well that their settlement has now become a very important one, extending over 18 townships and including 648 square miles of land, while their numbers have increased to over 9,000 persons. The isolation and almost patriarchal form of local government under which they lived at first is being gradually abandoned, and there being no longer any necessity for the mutual protection, which in the beginning led them to combine\ntheir property, many individuals now possess independent homesteads and wealth. They have established among themselves schools, stores and every facility for obtaining supplies from persons of their own nationality; but latterly the English language is being taught in their schools, where formerly only German was spoken, and this, it is hoped, will lead to a more social intercourse with their fellow Canadians.\n\nManitou is the next important village and has some thirty stores, shops, implement agencies, etc., and two elevators and a flour mill.\n\nPilot Mound takes its name from a mound of earth about 100 feet high, a mile north of the station, which served as a landmark to prairie travellers. It has shops, schools and elevators.\n\nKillarney, besides being the market town for its district, is a place of pleasure-resort, due to the prettily wooded and broken country that environs its lake.\n\nBoissevain and Deloraine are flourishing centres, and are the shipping and supplying points for Turtle Mountain, the vicinity of Whiteswater and Pelican lakes, and the upper Souris valley. Both have good stores, implement agencies, elevators, hotels, livery stables, and a rapidly increasing population.\n\nIn September, 1887, a party of some 200 representative farmers from eastern Canada, notable for their intelligence and wealth, went to Winnipeg, and thence scattered through the country on tours of inspection. About seventy went into southern Manitoba, to Deloraine and back.\n\nThe residents of the towns along the route arranged very creditable displays of produce at the stations, where the train stopped in each case long enough to let the excursionists examine the specimens.\n\nA number of farmers and others interested in agriculture, got on board the train at different stations along the route for the purpose of meeting old friends, and describing to them the agricultural resources, fertility and facilities for settlement offered by their respective districts. Mr. W. Stevenson, one of the largest threshers in southern Manitoba, was one of these, and, on being asked the average yield per acre as shown in the threshing, said that in no case, so far, this season, had he threshed less than thirty-two bushels of wheat to the acre. He had threshed for Mr. Samuel Humphrey, at Miama, 670 bushels, being the yield of ten acres. This was the highest, although in several years he had threshed fifty bushels off the acre.\n\nOn the return of the party, many of the principal members gave their opinion of what they had seen, in the following brief way:\n\nA. T. BARNETT, Guelph, Ont.\n\n\"The country is certainly better than I anticipated; and I find the farmers have made greater advancement than they could possibly have done in a country like Ontario, in the same length of time.\"\nHENRY JARVIS, Brantford, Ont.\n\n\"The country far surpassed my most sanguine expectations; I have seen nothing, so far, in the natural features objectionable. As to roots, and I may say crops in general, I never saw their equal.\"\n\nDAVID LAMBKIN, Brantford, Ont.\n\n\"It is the best district he has ever seen. In fact,\" he says, \"I do not think one could find a finer country. The produce I have seen on this trip could not be beaten.\"\n\nDAVID NICHOL, Farquhar, Ont.\n\n\"I like the appearance of the country very much; and am of the opinion that the settler has good chances of success.\"\n\nJOHN LAMBKIN, Brantford, Ont.\n\n\"Look at those stacks of grain; we have nothing to touch them in Ontario.\"\n\nTHOMAS PRIER, Exeter, Ont.\n\n\"Any man, who has fair health, and is at all industrious, is pretty sure to make a success. I think the soil the blackest and richest I have ever seen.\"\n\nTHOMAS SHAW, Cainesville, Ont.\n\n\"My impressions are very favourable; and do not think I could speak too highly of the country. The improvement since I last visited the Province, seven years ago, is wonderful.\"\n\nWILLIAM CONNELL, Poole, Ont.\n\n\"I may begin by saying that I am a native of Scotland, but have lived in Ontario for forty-four years, and could I have begun in such a country as Manitoba, I am certain I should be in a far better financial condition to-day.\"\n\nGEORGE PERDUE, Fenelon Falls, Ont.\n\n\"I would advise any of my friends, who contemplated moving, to move to southern Manitoba, as I consider the land very suitable for agricultural purposes.\"\n\nF. E. AVYS, Seaforth, Ont.\n\n\"I really think the country we have visited is as fine as any part I have seen. I have travelled through the principal portions of Dakota, but, in my estimation, Manitoba beats it.\"\nMr. Kelly, Reeve of Blyth.\n\n\"Taking southern Manitoba as a whole, I do not think it can be excelled for farming purposes, and I have travelled over a large portion of the Northwest.\"\n\nJames Martin, Bruce Agricultural Works, Teeswater, Ont.\n\n\"I think a great deal of the country. I found all the farmers greatly pleased with the change they have made in settling in Manitoba.\"\n\nArchibald Johnson, Eramosa, Ont.\n\n\"The appearance of the country struck me at once. The ease with which the land can be brought under cultivation is surprising. The small percentage unfit for plow is remarkable; and the excellent condition of the cattle, as seen from the train, gives unmistakable evidence of the strength of Manitoba's grasses. I was surprised at the growth of roots and vegetables.\"\n\nTaking this district as a whole it is one of the most prosperous in Manitoba, and it is not beyond the truth to say that from Red River to Deloraine, a distance of about 140 miles in a straight line, it is almost one continuous wheat field. What promises to be an additional attraction to this district is the recent discovery of coal on the western slope of the Turtle Mountains. This mine is now being developed preparatory to the construction of a railway from Deloraine to the coal, which on completion will assure cheap fuel to the farmers of the entire district.\n\n---\n\nTHE CENTRAL PRAIRIE REGION.\n\nThe central prairie region, or \"second steppe,\" extends from Carberry, on the Canadian Pacific, westward to Moose Jaw, a distance of nearly 300 miles, and includes the most thickly settled part of the prairie region. The principal towns along the main line of the railway are Carberry, Brandon, Griswold, Oak Lake, Virden, Elkhorn, Moosomin, Broadview, Grenfell, Qu'Appelle, Regina, and Moose Jaw.\n\nIn general it may be said that this region has a lighter soil than that of the Red River Valley and southern Manitoba. It is less sticky, not so black, as a rule, dryer, but none the less fertile. There\nare some tracts of sandhills, but these are utilized for grazing, and form but a small percentage out of the vast area of suitable surface.\n\nCarberry is a village of some 800 people, and forms the market town and shipping point for the great level tract known as Beautiful Plains, which is almost entirely under cultivation. It has five large elevators, a flour mill, churches, schools, etc., etc. In one year no less than 1,050,000 bushels of grain were marketed at this point.\n\nBrandon is the next in size to Winnipeg, and numbers between four and five thousand people. It is growing rapidly, and is one of the pleasantest of western towns. It is located at the crossing of the Assiniboine River, 132 miles west of Winnipeg. The many fine farms and handsome dwellings, and neat school-houses and churches give the country around the city a long-settled appearance.\n\nThe city possesses a large grain storage capacity, the different mills, elevators and warehouses affording storage for over two hundred thousand bushels.\n\nThe trade of Brandon extends to a great distance southward. After the Brandon Hills have been crossed, as good a soil as anywhere in the Assiniboine or Souris valleys is found. Five hundred acres in a single field of wheat is not an uncommon sight in this neighborhood.\n\nThe place of next importance west of Brandon, on the Canadian Pacific Railway, is Moosomin, which is close to the western boundary of Manitoba; but Griswold, Oak Lake, Elkhorn and Virden, are all railway stations and market centres, approaching it in consequence. In the neighborhood of Virden, particularly, will be seen some of the richest farms and best houses anywhere in the prairie region.\n\nThis is an exceedingly fertile country, dotted with small lakes, and provided with an abundance of grass and timber. The soil is of a most excellent character, and houses are within sight of one another in all directions. It is probable that no region of the prairie offers greater inducements at the present time to agricultural immigrants than that tributary to the villages between Brandon and Broadview.\n\nThe Canada Northwest Land Company owns an extensive tract of land here, which it is offering upon very advantageous terms. The best Government land is pretty well taken up, within a reasonable distance of the railway, but lands owned by the Canadian Pacific can be bought at from $2.50 to $6 an acre. Well improved farms are rarely in the market, but usually bring about $12 an acre. These will have from 30 to 60 acres under crop, with dwellings and stables sufficient for ordinary purposes.\n\nThe valley of the Pipestone bears a great resemblance to that of the upper Souris, and is largely occupied by Scotch and English people, who have churches and schools, and among whom are scattered many\nfamilies of large means. Moosomin and Grenfell are the stations for these settlements. The former is the most convenient for Moose Mountain, sixty miles southward, at the foot of which lie English settlements numbering several hundred people, who have devoted themselves successfully, not only to farming, but to the raising of cattle. They have postal facilities, stores, mills for grinding flour and sawing lumber, and form the nucleus of what will quickly develop into a populous and wealthy district. The South-western branch of the Canadian Pacific is pointing in that direction, and within two or three years, probably, this fine country will become directly accessible by rail. Much Government land is still free for homesteading in that neighborhood, and other lands can be purchased at very cheap rates. The soil is unusually fertile, and the character of the country makes cattle raising and mixed farming peculiarly advantageous there.\n\nAt Indian Head, some distance beyond Moosomin, is the great Bell farm, concerning which so much has been written. This farm harvested enormous crops last year, the average of which, in both quality and yield per acre, was quite as high as that anywhere in the whole region, while the cost of production was somewhat less.\n\nThe next station beyond Indian Head is Qu’Appelle. This place is peculiarly pleasant, on account of the great number of trees standing in the village and diversifying the surrounding landscape. The village is provided with excellent churches, schools, shops and factories. This is the station for stages to Fort Qu’Appelle, eighteen miles northward, where, around the old Hudson’s Bay post, on the banks of the Fishing Lakes, has grown up a village of some 500 people, the centre of a great stock-raising and farming district. The banks of the Qu’Appelle are peculiarly adapted to sheep pasturage and cattle-ranching, and the country northward and westward is an exceedingly fertile one, where settlement is progressing rapidly.\n\nAround Regina and Moose Jaw there is much less tree growth than on the prairies eastward. The soil, however, is marvellously rich, and is especially adapted to the raising of wheat, of which a great quantity has been produced the present year. Beyond Moose Jaw, except in the neighborhood of Calgary, agriculture has not been tried to any great extent. But this section of country is particularly favorable for stock-raising in all its branches, and for dairy-farming. The Canadian Pacific Railway Company has published a pamphlet entitled “Dairy Farming and Ranching,” which treats more fully of this part of the country and may be obtained upon application to any of the Company’s agents.\nSYSTEM OF SURVEY.\n\nThe Provinces of the North-West have now been accurately surveyed by the Dominion Government, and parcelled out into square and uniform lots on the following plan:—The land is divided into \"townships\" six miles square, the eastern and western bounds of which are true meridian lines forming the eastern and western boundaries of the ranges, while the northern and southern sides follow parallels of latitude. Each township contains thirty-six \"sections\" of 640 acres, or one square mile each, which are again subdivided into quarter sections of 160 acres. A road allowance, one chain wide, is provided for between each section running north and south, and between every alternate section east and west, making a net-work of public roads crossing at right angles, those north and south, one mile apart, and those east and west two miles apart. In the earlier surveys, road allowances of one and one-half chains (99 feet) are left between all sections, so that the roads in both directions are only one mile apart. This system applies to the greater portion of the Province of Manitoba.\n\nIt will thus be seen that the sections in each township are apportioned as follows:—\n\n**Open For Homestead and Pre-Emptions.**—Nos. 2, 4, 6, 10, 12, 14, 16, 18, 20, 22, 24, 28, 30, 32, 34, 36.\n\n**Canadian Pacific Railway Sections.**—Nos. 1, 3, 5, 7, 9, 13, 15, 17, 19, 21, 23, 25, 27, 31, 33, 35.\n\nNos. 1, 9, 13, 21, 25, 33 along the main line, Winnipeg to Moose Jaw, Canada North-West Land Company, with some additional sections throughout Manitoba to make up their purchase of 2,200,000 acres.\n\n**School Sections.**—Nos. 11, 29, (reserved by Government solely for school purposes.\n\n**Hudson's Bay Sections.**—Nos. 8 and 26.\n\nThe surveyed lands are marked on the ground itself by iron and other kinds of monuments at the corners of the sub-divisions, and so soon as the new comer makes himself acquainted with these, he can instantly determine the position and extent of his own or any other farm on the prairie.\n\nThe following diagram illustrates this, and shows how the ownership of the land is divided within \"the fertile belt,\" which extends\nalong the Canadian Pacific Railway, with a breadth of twenty-four miles on each side of the line:\n\n### TOWNSHIP DIAGRAM.\n\n|       | 31 | 32 | C.N.W. or C.P.R. | 34 | 35 | C.P.R. | Gov. |\n|-------|----|----|------------------|----|----|--------|------|\n| N.    |    |    |                  |    |    |        |      |\n| 1 Ml. |    |    |                  |    |    |        |      |\n| Square|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| Schools|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.N.W.|    |    |                  |    |    |        |      |\n| or    |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.N.W.|    |    |                  |    |    |        |      |\n| or    |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.N.W.|    |    |                  |    |    |        |      |\n| or    |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| H.B.  |    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.N.W.|    |    |                  |    |    |        |      |\n| or    |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| schools|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n| Gov.  |    |    |                  |    |    |        |      |\n| C.N.W.|    |    |                  |    |    |        |      |\n| or    |    |    |                  |    |    |        |      |\n| C.P.R.|    |    |                  |    |    |        |      |\n\nC. P. R.—Canadian Pacific Railway Company's Lands. Gov.—Government Homestead and Pre-emption Lands. Schools.—Sections reserved for support of Schools. H. B.—Hudson Bay Company's Lands. C. N. W.—Canada North-West Land Company's Lands for as far west from Winnipeg as Moose Jaw only. Sections 1, 9, 13, 21, 25 and 33, from Moose Jaw westward, still belong to the Canadian Pacific Railway Company.\n\nThe whole plains region is furthermore divided by five \"meridians,\" which serve as base-lines for accurate surveying. The first of these is near the true meridian of 97° 30', about 12 miles west of Winnipeg; the second, a short distance west of the western boundary of Manitoba, in longitude 102°; the third crosses Assiniboia near Moose Jaw, in longitude 106°; the fourth passes through the Cypress Hills (long. 110°); and the fifth is the longitude of Calgary, 114° west of Greenwich. Between these meridians, the ranges are numbered consecutively from east to west; while the tiers of townships are numbered continuously from the United States boundary northward.\nas far as they go. To designate one's exact locality, therefore, it is only necessary to say, for example, that he is in section 23, township 10, range 19, west of the first meridian, which is the site of Brandon.\n\nFor disposal of the public lands under this system, by free-grant, pre-emption or sale, the Dominion has established the following agencies, at which all the business in relation to lands within the district of each must be transacted:\n\nDOMINION LANDS OFFICES.\n\n(FIGURES ARE INCLUSIVE).\n\nWinnipeg and Dufferin Districts combined.—Includes all surveyed townships, Nos. 1 to 25 north; ranges—all east of 1st meridian., and ranges 1 to 8 west; also townships 1 to 4, ranges 9 to 14, and townships 5 to 7, ranges 9 to 12 west. Agent, Winnipeg.\n\nSouris District.—Township 5, ranges 13 to 18, townships 6 and 7, ranges 13 to 2nd meridian, townships 8 to 12, ranges 9 to 2nd meridian. Agent, Brandon.\n\nTurtle Mountain District.—Townships 1 to 4, ranges 15 to 2nd meridian, township 5, ranges 19 to 2nd meridian. Agent, Deloraine.\n\nLittle Saskatchewan District.—Townships north of and including 13, ranges 9 to 22 west. Agent, Minnedosa.\n\nBirtle District.—Townships north of and including 13, ranges 23 to 2nd meridian. Agent, Birtle.\n\nCoteau District.—Townships 1 to 9, ranges 1 to 30 west 2nd meridian. Agent, Cannington.\n\nQu'Appelle District.—Townships 10 to 23, ranges 1 to 30 west 2nd meridian. Agent, Regina.\n\nTouchwood District.—Townships 24 to 31, ranges 1 to 30 west 2nd meridian, townships 32 to 36, range 1 west 2nd meridian to range 6 west 3rd meridian, townships 37 and 38, 2nd meridian, to range 5 west 3rd meridian. Agent, Saltcoats.\n\nSwift Current District.—Townships 1 to 30, ranges 1 to 30 west 3rd meridian, township 31, ranges 1 to 6 west 3rd meridian. All business transacted at Regina.\n\nCalgary District.—Townships 13 to 18, range 24 west 4th to B. C., and townships 19 to 30, range 1 west 4th; townships 31 to 42, range 8 west 4th meridian to B. C. Agent, Calgary.\n\nEdmonton District.—Township north and including 43, range 8 west 4th to B. C. Agent, Edmonton.\n\nBattleford District.—Townships 31 to 36, range 7 west 3rd meridian to 7 west 4th meridian; townships 37 to 38, range 6 west 3rd meridian to range 7 west 4th meridian; township 34 northwards, range 11 west 3rd meridian to 7 west 4th meridian, Agent, Battleford.\nPrince Albert District.—Township 39 northwards, range 18 west 2nd meridian to 10 west 3rd meridian. Agent, Prince Albert.\n\nLethbridge District.—Townships 1 to 18, ranges 1 to 24 west 4th meridian, and townships 1 to 12 between westerly limit of range 24 and boundary B. C. Agent, Lethbridge, N. W. T.\n\nAt the offices in the districts, detailed maps will be found, showing the exact homestead and pre-emption lands vacant. The agents are always ready to give every assistance and information in their power.\n\nThe disposal of Canadian Pacific Railway lands in all parts of the North-West is in charge of L. A. Hamilton, the Company's Land Commissioner at Winnipeg; and settlers arriving in Winnipeg should, before going west, call at the Land Department of the Company, the office of which is in the station, where they can ascertain the location of the Government intelligence offices, and other information.\n\nFor the convenience of applicants, information as to prices and terms of purchase of Railway lands may also be obtained from all station agents along the Company's main line and branches. When the agent is not supplied with full information upon any particular point, he will telegraph the Land Commissioner. In no case is an agent entitled to receive money in payment for lands. All payments must be remitted directly to the Land Commissioner at Winnipeg.\n\nCLIMATE.\n\nThe seasons in the North-West are well marked.\n\nThe summer months have bright, clear, and often very warm weather; but the nights are cool. The days are very long on account of the high latitude, and grain has some hours more each day for ripening than in southerly latitudes, thus making up for the comparatively shorter season. Harvesting begins about the middle of August and ends early in September, all the grains coming pretty well together. The autumn months are considered the finest of the year. The atmosphere is serene and free from moisture, frequently for periods of several weeks.\n\nThat the winter is cold, there is no doubt, but the atmosphere is buoyant, the sun shines almost every day, and when it is very cold there is seldom any wind; the air is extremely bracing and health-giving. \"Blizzards\" are scarcely known, and cyclones, which periodically sweep over the Western and North-Western States and Territories of the United States, leaving destruction and desolation in their path, have never visited this portion of Canada.\nThe mean temperature of Winnipeg in June, July and August, is 62.8 F.; at Penzance, in Cornwall, during the same period, it is 60.90. Summer heat is usually about 70°, although the thermometer occasionally rises to 100°, but the nights are cool. In winter, the temperature sometimes falls to 30° or 40° below zero. It is a singular fact, however, that Europeans do not feel the cold as much as Canadians do, and this is most likely in consequence of the dryness of the atmosphere.\n\nThis dryness of the air is the secret of the degree of comfort experienced even when the mercury is very low, for that sensation of penetrating chill which makes the cold weather of coast regions so unpleasant and unhealthy, is rarely felt. Snow never falls to a great depth, and the railway trains across the plains have never been seriously impeded by it. As this snow is perfectly dry, a person never has wet feet or soaked clothing by it. There is no thawing after winter sets in—say the last of November; only steady, bright frost until March. Men travel with teams everywhere, taking their grain to market, hauling fuel, building and fencing material, and doing all their work. Stock thrive well out of doors, so far as the cold is concerned, and along the base of the Rockies, where warm dry Chinook winds from the west absorb the snow rapidly, herds of horses and cattle have hitherto been left out all winter, to shift for themselves. Calves and lambs are born on the open prairie in January and February, and not only live, but grow fat. Everyone unites in testifying to the healthfulness of the country. Ploughing can often be commenced about the end of March, but generally not before April 5. The snow disappears rapidly, and the ground dries quickly. Winter closes promptly and decisively, and does not \"linger in the lap of spring.\" Sowing is done during almost the whole of April, and is finished early in May.\n\nFUEL.\n\nThere is a more or less generous supply of wood throughout the North-West. In addition to this, practically inexhaustible deposits of coal have been found at many points so conveniently situated as to appear almost as though specially designed by nature for distributing centres. Prominent among these are the following:—In Manitoba, Turtle Mountain, in Southern Assiniboia, the immense deposits distributed along the Souris River; in Western Assiniboia, the coal measures on the South Saskatchewan River, near Medicine Hat; in\nAlberta, the soft coal deposits at Lethbridge, where the output from the mines reaches 1,000 tons per day. Coal of this character can be found at innumerable points throughout Alberta, and, in addition, this district has the anthracite coal measures of the Bow River Valley to draw from. Large deposits of soft coal are also located on the Rosebud, the Red Deer, the North Saskatchewan, and the other rivers of the northern portion of Alberta, thus insuring to all parts of the North-West an abundance of cheap fuel for all time to come.\nAgricultural Capabilities.\n\nWHEAT RAISING.\n\nThe soil, the climate and other natural conditions of Manitoba are peculiarly adapted to wheat raising. This is now recognized as a fact of vast importance by those who are interested in the success of the world's bread supply. The future wheat fields on this continent lie north of the International boundary line; and it is now recognized as a scientific fact that the farther north wheat can be grown and fully matured the better is the quality. That wheat is grown hundreds of miles north of the northern boundary of Manitoba is undoubtedly the fact; this means that in the magnificent areas of north-western Canada, comprising millions of acres of the most fertile virgin prairie, capable of producing the best quality of wheat the world has ever seen, the wheat fields of America are in the near future to be found. Up to the present the North-West is without a rival in the soil and other conditions it enjoys for wheat culture. The following figures compiled from the report of the United States Department of Agriculture and other sources clearly demonstrate this. The yield of Spring Wheat in the following places for the years 1882 to 1889 inclusive, is given as follows:\n\n| State     | Yield per Acre |\n|-----------|----------------|\n| Manitoba  | Nearly 20 bushels |\n| Ontario   | 15.6 \"          |\n| Minnesota | 14.7 \"          |\n| Dakota    | 13.0 \"          |\n| Wisconsin | 12.5 \"          |\n| Nebraska  | 11.8 \"          |\n| Iowa      | 11.3 \"          |\n\nThe surface is a rich alluvial deposit, varying from 8 to 20 inches in depth, with a clay subsoil. Very rarely is any difficulty met in bringing the land under cultivation. The absence of trees, stumps, roots, stones, etc., make the cultivation of the land much less laborious than in most other countries. The soil is known to possess those qualities that are requisite to produce the finest sample of wheat.\nThe berry is a moderate size, of a fine amber color and possesses those qualities that render it most profitable for flour making. The soil is very rich, and with proper husbandry yields handsome crops without fertilizers. The annoyance of lodged crops may be said never to occur here. The straw is strong and stiff, often exceeding five feet in height, while the heads are long and plump. It will be easily inferred that a field of 500 or 600 acres of growing wheat is a beautiful sight, and when it promises an average of 30 bushels to the acre (that has often been exceeded) it is to the owner in reality a golden prospect. The general fertility and productiveness of the country is conclusively established; those people going there now, know exactly what has been done and what they may accomplish. They may enjoy the advantages of all the knowledge that has been acquired by thousands of intelligent, energetic farmers, and be in a position to carry on future operations upon the most approved methods as well as to secure land on the most favorable terms.\n\nTherefore it may be stated without fear of successful contradiction, that Manitoba can show a higher average yield per acre of wheat, oats, barley and roots than any other portion of the American continent. The wheat is in quality unexcelled. It not infrequently averages 64 pounds to the bushel. It can be raised at a minimum of cost. Such a field for operation should attract the world.\n\nAs an evidence of the advance the Province is making in the production of grain, official figures may be quoted as follows: The total acreage under crop in 1887 was 668,764, while in 1890 it had increased to 1,082,794 acres, a difference of 419,030 acres.\n\nThe harvest bulletin for 1890, issued by the Department of Agriculture for the Province of Manitoba, shows a yield throughout the Province of an average of 24.6 bushels per acre. The bulletin issued by the Department of Agriculture of the United States, shows for the State of Dakota an average of only nine bushels per acre, for Minnesota 12 bushels and Wisconsin 12½ bushels. These are official figures, and from them farmers can draw their own conclusions as to which part of the American continent possesses the best wheat lands.\n\nOTHER GRAINS, ETC.\n\nIn addition to wheat, which is the standard and most largely cultivated grain (Manitoba red Fyfe wheat brings a higher price in Liverpool than that of any other place on the globe) the soil of the North-West yields bountifully of barley, oats, rye, millet, timothy-grass, lucerne, peas, beans, flax, hops, every sort of root-crop, and all\nkinds of garden produce; while the women and children are delighted to find themselves able to cultivate flowers to any extent. Mushrooms are plentiful and often of gigantic size. Barley and rye give a magnificent yield, often forty bushels to the acre. Oats are very generally cultivated and often form the first planting of the new settler. They incline to shorter straw and heavier heads than in the east, and produce fifty to seventy bushels per acre. Millet and similar small grains grow excellently; as, also, do the fodder-plants, though these have been little cultivated, because there has been little need to supplement the natural hay-grasses. Hemp plants are indigenous all over the plains, so that it is not surprising to find that flax does exceedingly well in the North-West, requiring ninety days to mature. In Manitoba the Mennonites planted it with their first crops, and now cultivate it to a large extent, both for fibre and seed; for the latter there is always a good home market, linseed-oil mills having been built in Winnipeg. Elsewhere flax and hemp are grown in scattered quantities, the total area of which is steadily widening.\n\nWild hops, pronounced by brewers to be of excellent quality, attain a luxuriant growth in many localities, the soil and climate of Manitoba, in particular, seeming peculiarly well fitted to them. Cultivated vines of this wild stock give as fine large hops as the vines of Kent, and their regular cultivation will prove highly profitable.\n\nIn respect to root-crops, it probably is not too much to say that no part of the world produces potatoes, turnips, onions and every kind of garden vegetables belonging to the cooler half of the temperate zone, with so great a luxuriance, and of so fine a quality, as the Canadian West.\n\nThe Department of Agriculture has published a statement respecting the suitability of Manitoba as a place for settlement, based upon the answers of 100 farmers, whose names and addresses are given, and to whom reference may at any time be made. A copy of this statement in pamphlet form, entitled \"100 Farmers Testify,\" will be furnished post free by any of the agents of the Canadian Pacific Railway. These farmers testify, among other things, to the amazing yield of root-crops, ninety-two of them reporting an average crop of 318 bushels of potatoes to the acre. W. H. Swain, of Morris, has produced 800 to 1,000 bushels of turnips to the acre, and sixty bushel of beans have also been raised by him per acre; S. C. Higginson, of Oakland, has produced cabbages weighing 17½ lbs. each; Allan Bell, of Portage la Prairie, has had cabbages 45 inches round, and turnips weighing 25 lbs. each; Thos. B. Patterson has realized forty tons of turnips to the acre, some of them weighing as much as 20 lbs. each; Robt. E. Mitchell, of Cook's Creek, raised a squash of six weeks' growth, measuring 5 feet 6 inches around the centre; Wm. Moss, of\nHigh Bluff, has produced carrots weighing 11 pounds each, and turnips measuring 36 inches in circumference; James Airth, of Stonewall, states that the common weight of turnips is twelve pounds each, and some of them have gone as high as thirty-two and a half pounds; Isaac Casson, of Green Ridge, has raised 270 bushels of onions to the acre; John Geddes, of Kildonan, states that he has raised 300 bushels of carrots and 800 bushels of turnips per acre; John Kelly, of Morris, has produced from 800 to 1,000 bushels of turnips to the acre; Joshua Appleyard, of Stonewall, also states his crops of turnips to have been 1,000 bushels per acre, the common weight being 12 lbs. each; Ed. Scott, of Portage la Prairie, raised 400 bushels of turnips from half an acre of land. W. H. J. Swain, of Morris, had citrons weighing 18 lbs. each; Francis Ogletree, of Portage la Prairie,, produced onions measuring 4½ inches through the centre; A. V. Beckstead, of Emerson, gives his experience as follows: mangel-wurzel weighing 27 lbs. each, beets weighing 23 lbs. each, cabbages weighing 49 lbs. each, onions each 1½ lbs. in weight; W. B. Hall, of Headingly, has raised carrots 3 inches in diameter, beets weighing 20 lbs. each, and gives the weight of his turnips generally at 12 lbs. each; Philip McKay, of Portage la Prairie, took 200 bushels of turnips from one-quarter of an acre of land, some of them weighing 25 lbs. each; he has produced carrots 4 inches in diameter and 14 inches long, has had cabbages measuring 26 inches in diameter, solid head, and four feet with the leaves on; his onions have measured 16 inches in circumference, and cauliflower heads 19 inches in diameter. James Lawrie & Bros., of Morris, have produced turnips 30 inches in circumference, onions 14 inches, and melons 30 inches; they had one squash which measured about the same size as an ordinary flour barrel. James Owens, of Point du Chene, had turnips 30 lbs. each, onions 14 inches around, and cucumbers 18 inches long; Neil Henderson, of Cook’s Creek, has raised 1,000 bushels of turnips to the acre, carrots 5 inches in diameter and 18 inches long, while his onions have frequently measured 5 inches through; James Bedford, of Emerson, has raised 1,000 bushels of turnips to the acre. It must be remembered, moreover, that none of the farmers mentioned above used any special cultivation to produce the results described, and that the experience further west proves that everywhere from Winnipeg to the Rocky Mountains, garden products of the same kind flourish.\n\nEven the less hardy kinds succeed well. You will see tomatoes growing out of doors and ripening well all over the prairies. Farmers of Edmonton and Qu’Appelle grow them as well as they do at Winnipeg or Emerson. Asparagus, tobacco, maize, melons of all kinds, and everything ordinarily in a garden, can be seen wherever a careful attempt has been made to make these more tender plants grow.\nWild fruits attain to great perfection in Manitoba, Assiniboia and Alberta. Wild plums, raspberries, cherries, cranberries, and other berries abound, and are of luscious quality.\n\nApiculture is successfully carried on in the North-West, of course, as bees require just such a clear, dry atmosphere and wealth of flowers as they find on the prairies. The honey secreted solidifies and becomes ready for sealing sooner than in a warm, moist climate, and is consequently sweeter. Bee culture will always take an important place among the home industries of the West. It has been said that the natural food products of the Canadian North-West include twenty-one indigenous plants, thirty-two species of animals, eighteen fish and eighty-nine birds.\n\nIn connection with the farm, the raising of cattle, horses, swine and poultry, can be carried on most advantageously, as all the land not under cultivation is pasture, and there are few quarter-sections unsupplied with good drinking water. Pairs of working oxen weighing 3,500 pounds or more can be seen almost anywhere. The complete absence of any diseases is a point which should not be forgotten; and every care is taken by the local government to prevent its introduction and to encourage live stock breeding generally.\n\nDAIRY FARMING.\n\nOne special resource which deserves every farmer's attention, is dairying. For milk, there is at present less demand than will come later, when the towns have grown into cities; but butter and cheese can be made for export with great profit. Cheese factories have been established at several points and are doing very well. The butter of Manitoba is famous for its excellence, and is sent not only to all parts of the prairie region, but shipped east in large quantities, and even to Japan. At the Dominion Exhibition of 1887, in Toronto, the butter of Manitoba took the first prize, in competition with all Canada, greatly to the surprise and chagrin of some of the professional dairymen of Ontario. Items like the following, from a newspaper of Winnipeg are everyday occurrences, and show what butter-making amounts to there:\n\n\"James Kelly, of Arnaud, Man., sold 2,149 pounds of butter to the Hudson's Bay Company, which they pronounced to be the best butter bought by them this season, and for which he got the highest price in the market. He has been in Manitoba twelve years, and commenced farming here in 1880 with only one yoke of cattle, one log chain, a plow and $1 capital. He has now twenty-two milch cows, and has in all eighty-three head of stock, and has no debts and no incumbrances on his property. He advises all his countrymen to come and farm in Manitoba.\"\nMUNICIPAL MATTERS.\n\nManitoba has a provincial government elected by the people. The qualification for voting is practically manhood suffrage, so that every man may have a voice in framing the laws of the country.\n\nThe people of Assiniboia, Alberta, Saskatchewan and Athabasca, manage public affairs through a small representative body, the majority of whom are elected by the people. The Assembly meets once a year at Regina, the capital of the Territories, and is presided over by a Lieutenant-Governor appointed and paid by the Dominion\n\nSCHOOLS.\n\nThere are most liberal provisions made by the Government for schools. Two sections, making 1,280 acres in each township, are set apart by the Dominion Government, the proceeds of which, when sold, are applied to the support of schools.\n\nThere is a superintendent in each district, and teachers are required to pass a rigid examination. The result is that public schools throughout the West are highly creditable and effective. Academies and colleges are found in Winnipeg and several of the larger towns, some of them under the control of religious bodies, others in the form of private enterprise. Thus a thorough practical education is placed within the reach of all.\n\nTAXATION.\n\nThe matter of taxes is another most important point of difference in favor of the Canadian settler. By the very simple municipal organization of communities (as fast as settlements require any government at all), local affairs are managed at home with but little expense. A reeve and council are elected each year by the people, and this organization takes charge of all local matters, the most important item of which is road building and repairing. There being no turnpike trusts, each landholder works out his road-tax by his own labor, or the labor of his teams. Government aid has hitherto been given towards the few expensive bridges or other public works called for by the people. Courts and police are also provided by the Government. These facts and the favorable situation in general, coupled with the extremely simple form of government, naturally make taxation very light.\nRELIGIOUS MATTERS.\n\nChurches are supported by the voluntary contributions of the people. Every man is free to worship according to the teachings of his own creed, for places of worship of every denomination are abundant. In fact the number of these bears eloquent testimony to the high regard in which religion is held in this new country.\n\nSOCIAL SURROUNDINGS.\n\nNo matter from what part of the world the colonist may come, he will have no difficulty in finding and locating among fellow-countrymen. Every nationality of Europe is represented among the citizens of the larger centres, and scattered throughout the country are thriving settlements of English, Irish, Scotch, Welsh, French, Germans, Austrians, Swedes, Norwegians, Danes, Hungarians, Bohemians, Roumanians, Icelanders, Belgians, Russians, etc., etc., each forming pleasant little communities of their own, but all working peacefully and harmoniously for the general good.\n\nThe toils of these people are not so severe as to compel them to forego all or any of the little social pleasantries which add so greatly to the enjoyment of life. Game of many varieties is so plentiful that a holiday with the gun will furnish pleasure and a most acceptable addition to the farmer’s larder. In the English settlements in particular, the young men, true to the teachings of the mother land, while farming successfully, yet manage to find time to devote to fox-hunting a la mode, to racing, and shooting chickens, etc., and larger game. The ease with which really good sport may be obtained is frequently a powerful inducement to young Englishmen to make their homes in this country.\n\nIn conclusion, the reader is earnestly recommended to study carefully the several letters contained in the appendix to this pamphlet. They are from reliable and representative men, and are better evidence of the real condition of things than volumes of descriptive writing. In any case where an intending colonist desires more particular information about a certain locality, he is further advised to write to one or other of the residents whose names are given.\nThe Harvest of 1890.\n\nProsperity and Contentment—The Farmers Tell the Story.\n\nMANITOBA.\n\nA. Houck, Alcester:—\"The yield of wheat per acre is 25 bushels.\"\n\nW. A. Rouw, Souris:—\"Estimated wheat yield 25 to 30 bushels per acre.\"\n\nR. H. Blackwell, Virden:—\"Crops are a good average all round. Wheat fully 25 bushels per acre.\"\n\nGrant Lang, Langvale:—\"The average yield of wheat will be 30 bushels per acre. The sample is good.\"\n\nA. H. Soonten, Raven Lake:—\"The average yield of wheat per acre will be between 25 and 30 bushels.\"\n\nJames Armstrong, Carberry:—\"The average yield of wheat in this district will be about 23 bushels per acre.\"\n\nEdward Shaw, Heaslip:—\"Wheat will average 25 to 30 bushels per acre, oats 40 to 50 bushels, barley 35 bushels.\"\n\nJ. E. Mayhew, Stratherne:—\"The crops in this vicinity are good. The average for wheat is about 30 bushels per acre.\"\n\nW. H. Bennett, West Hall:—\"The crop in this district is a very good one, and will average from 25 to 30 bushels per acre.\"\n\nGeo. H. Clark, Two Rivers:—\"We have fine prospects this year. Our crops are heavy and the yield will be about 30 bushels per acre.\"\n\nWm. Neevin, Shadeland:—\"The average of grain will be: Wheat, between 23 and 25 bushels per acre; oats, 40 bushels; barley, 35 bushels.\"\n\nW. J. Burgess, Minnedosa:—\"General prospects good. Average, wheat from 25 to 35 bushels per acre; oats, 50 to 60 bushels; barley, 25 to 30 bushels.\"\n\nThomas Naismith, Woodlands:—\"The crops are very good; wheat will average about 30 bushels per acre, oats about 40 bushels, barley about 35 bushels.\"\n\nJ. McKelvie and Sons, Cornwallis:—\"Wheat will average 25 bushels per acre, oats 50 bushels, barley 40 bushels. Root crops are also abundant.\"\n\nJames Stodgill, Woonona:—\"Crops never looked better than this year. Average for wheat, about 30 bushels per acre; on some farms considerably more.\"\nW. G. Onions, Elkhorn:—\"All crops in this vicinity are very good—above the average. Wheat should average from 25 to 35 bushels per acre.\"\n\nA resident of Oakburn:—\"Wheat will average from 25 to 30 bushels per acre, oats from 50 to 60 bushels, and barley about 40 bushels. Potatoes are a good crop.\"\n\nThos. Norquay, St. Andrews:—\"The average wheat yield will be about 25 bushels per acre. The yield in other cereals and roots will also be very large. The hay crop is excellent.\"\n\nF. W. Robertson, Erinview:—\"There is a very good crop of wheat and oats. The average is about 23 bushels per acre. Barley, it is feared, will be discolored, but there is a good crop.\"\n\nN. Morrison, Oak Bank:—\"The crops in this neighborhood are the heaviest that have been known for many years. Wheat will yield about 35 to 40 bushels per acre; oats, 65 to 70 bushels.\"\n\nE. B. Kett, St. Andrews:—\"On August 1st I estimated the yield as follows: Wheat, 25 bushels per acre; oats, 50 bushels, and barley, 35 bushels. I have every reason to think the yield will be fully up to my estimate.\"\n\nOliver Nicol, Toddburn:—\"In my experience of ten years in Manitoba I have never seen finer crops than we have this season. I think I am safe in saying that wheat will average 30 bushels per acre, oats from 50 to 60 bushels, and barley 40 bushels.\"\n\nW. D. Drew, Napinka:—\"Crops are really good. Wheat will average about 25 bushels per acre, oats fairly good, roots and garden crops splendid. The late rains will leave the land for next season in the best form for growth it has been in for years.\"\n\nWm. McDonald, Sr., Rossburn:—\"Taken as a whole the crops are good. Wheat will yield over 30 bushels per acre. There are a few places where it will not exceed 25 bushels per acre, but the average may be taken at 30 bushels all round. All other crops are very good.\"\n\nNEPAWA, Nov. 7th.\n\n\"Following is the yield of grain on Robert Johnston's farm in Glendale. One thousand four hundred and eighty-five bushels of wheat were threshed off thirty acres, or an average of 49½ bushels to the acre, and 1,100 bushels of oats off twelve acres or an average of 92 bushels to the acre.\"\n\nTobias Collins, Suthwyn:—\"On the whole, the crops are magnificent in this section. Potatoes and vegetables are splendid, and oats and barley good. Wheat will average about twenty bushels per acre, oats sixty, barley forty bushels. I have farmed in Ontario, but must say that crops here are far ahead of anything I ever saw in Ontario. There is abundance of grain, hay and vegetables, thus giving to this vicinity prosperity and contentment.\"\n\nWHEAT AT RAPID CITY.\n\n\"Threshing is proving far more satisfactory than was expected. A yield of 35 bushels of wheat or 70 of oats is quite common. Davidson who lives a few miles west, threshed 3,200 bushels of wheat from 80 acres of land, while Messrs. Sawyer, J. B. Brown, J. Spearin and numbers of others were rewarded with from 35 to 38 bushels to the\nacre. Mr. Jas. Spearin's oat crop turned out an acre average of 75 bushels. All over this section the yield is enormous, and the sample cannot be beaten in the Province. Old settlers and new are more than ever satisfied that they made no mistake when they settled in the Rapid City district.\"\n\nASSINIBOIA.\n\nHenry Dixon, Chickney:—“The average yield of wheat will be about 27 bushels to the acre, oats 40 to 50 bushels, barley 30 bushels.”\n\nGeo. Cook, Hill Farm:—“Wheat will average 25 to 30 bushels per acre, oats 50 to 60 bushels, barley 40 bushels. Potatoes and all other root crops and wild fruits abundant.”\n\nJ. F. Middlemiss, Summerberry:—“Wheat will average at least 20 bushels per acre, and oats between 40 and 50 bushels. All root crops, potatoes, etc., a grand crop.”\n\nJ. A. Stutt, Fairmede:—“The average yield of wheat is about 27 bushels per acre, although the continued wet weather of late may somewhat injure the sample, which is unusual in Eastern Assiniboia.”\n\nAlec. Duncan, Moffat:—“In this district it is mostly mixed farming. Crops of all kinds are far ahead of anything we have had here since 1884. Wheat will average about 25 to 30 bushels per acre. Potatoes a fair crop. Gooseberries, strawberries, raspberries, saskatoons and choke-cherries, were all very plentiful. The hay crop was splendid.”\n\nG. W. Gibson, Hillburn:—“The crop is one of the best, if not the best, ever grown here. Wheat will average 25 to 30 bushels per acre, oats about 50 bushels or more, barley 30 to 35 bushels. The root crop is extra good and of very superior quality. Wild fruits very abundant. Cultivated currants and gooseberries, a very large crop—fruit large and of fine flavor.”\n\nALBERTA.\n\nMilton Fierheller, Midnapore:—“We have here the granary of Canada as far as growing wheat is concerned. The average this year is about 30 bushels per acre, No. 1 hard wheat. I helped to thresh 52 bushels per acre last year on one farm. All other grains are good in proportion. Roots grow to an enormous size.”\n\nW. R. Hull, Calgary:—“This year I have under crop 225 acres, principally oats, but have also barley, potatoes and roots, and am pleased to be able to say that my crops are a splendid lot. I have oats that stand five feet, ten inches, and will average from 45 to 55 bushels per acre, and much of the crop will, I believe, thresh over 65 bushels per acre.”\nSam. Ray, Pine Creek:—“The crops in the Pine Creek district this year are equal to any I have seen in the North-West, and that is saying a good deal. Wheat, barley and oats, potatoes, roots, etc., are extra good crops. Oats are generally estimated to yield on an average in our district from 50 to 75 bushels per acre. Oats too that will weigh from 40 to 49 lbs. per bushel.”\n\nNelson Bebo, Fish Creek, Calgary:—“I have been nine years in the Calgary District, and have farmed since my arrival. This year I had 120 acres under cultivation, including wheat, oats, barley and roots. I have this, and every other year, succeeded in growing first-class crops. Wheat has averaged from 35 to 53 bushels per acre. Barley averaged 40 bushels per acre. Oats last year yielded 65 bushels per acre, weighing 42 lbs. per bushel. My root crop has been enormous each year.”\nEvidence in Detail.\n\nLetters from Practical Men.\n\nGeorge Lounsberry, a South Dakota farmer, visited Manitoba during September, 1890, and spent some time inspecting farms, etc., of the Province. Upon his return he took with him samples of Manitoba's products to show to his friends. The result is best told in his own words:\n\n\"Westport, South Dakota,\n\"Sep. 27th, 1890.\n\n\"My Dear Sir,—I reached home all right. I found lots of my friends to meet me. My trunk was carried to the hotel and there opened, and by the time they were through looking at the exhibit, most of the contents were in other parties' arms, and they all declared that they must take them home and sample them.\n\n\"It was a big advertisement for Manitoba and her vegetables, for they could not help believing their own eyes!\n\n\"Since my return from Manitoba, farmers are coming here every day enquiring about Manitoba. I have just threshed my grain:—wheat averaged two and a half (2½) bushels per acre; oats and barley one (1) peck to the acre, and that is about the average for this (Brown) County. McPherson County is not so good!\n\n\"Several are going out to Manitoba from here this fall, and there are several families going to start in a few days and drive through.\"\n\n\"GEO. LOUNSBERRY.\"\n\nREGINA, N. W. T.\n\n\"I came to Regina, N.W.T., Canada, from England, in September, 1882. For the first two years I followed my own trade, building and contracting. In January, 1884, I took up a homestead and pre-emption 320 acres. For the last six years I have been farming successfully. The farm I have has plenty of timber for building stables and out-buildings and also plenty of hay and water. Every year I have good crops of grain, roots and vegetables. In 1888 I had a field of oats that yielded 130 bushels per acre and weighed 48½ lbs. to the bushel. I have\na good house, stables and other buildings, and every farm implement required to work the farm.\n\n\"I believe this to be the best country in the world for cattle, both for milk and beef; they are always fat and healthy. Cattle and horses will run out all winter and keep in splendid condition. Pigs and sheep also do very well here, better than I ever saw them do in the old country.\n\n\"Potatoes and other vegetables grow to perfection; tomatoes, corn, watermelons, cucumbers, all ripen and grow in abundance.\n\n\"All this and no rent to pay. What more could a man desire?\"\n\n\"Now in conclusion, I think I have been in this country long enough to give an opinion. I can strongly recommend it as a desirable place for settlement for farmers, mechanics, laborers and domestic servants, good wages. And I believe it to be the healthiest country in the world.\n\n\"THOMAS BARTON.\n\n\"Hednesford,\n\"Sec. 28, 19, 17.\n\n\"Sept. 21st, 1890.\"\n\nFROM MOOSOMIN, N. W. T.\n\n\"MOOSOMIN, N. W. T.\n\"Oct. 17th, 1890.\n\n\"Range 30 and 31, Township 14, four miles from station. Came to the country in 1883, and settled in present location. Amount of capital, $12,000. Acreage now owned, 4,000. Under crop in 1887, 600 acres. Present capital, $40,000. Yield per acre, 1887, 30 bushels, average. Live stock, 14 horses. I am pleased to give my experience since I came to this country. My success has been far beyond my expectations. I am fully convinced for extensive farming, wholly grain or mixed farming, it cannot be surpassed. I think Moosomin district is equalled by few and surpassed by no other point in Manitoba or the North-West Territories. Moosomin is a first-class grain market and is growing rapidly in importance.\n\n\"My operations for the years '88 and '89 were very successful. This year my yield will be about 25,000 bushels, 15,000 wheat, 10,000 oats and barley. My barley will pay all expenses, giving me a handsome surplus for the year. I think this will show that farming for a business will give as good results as any other business will show with same amount of capital. I have no desire to withdraw my capital from N. W. farming. I consider it with good management the safest investment open to me.\n\n\"Yours truly,\n\n\"J. R. NEFF.\"\n\n\"GRENFELL, ASSINIBOIA, N. W. T.\n\"Oct. 20th, 1890.\n\n\"I came to Manitoba from Berkshire, England, in 1883. Myself and Mr. Tryon farm together. Our place comprises 250 acres and is called 'Ceylon Farm.' This year we had 120 acres under crop, prin-\ncipally oats, which averaged 60 bushels per acre of fine quality. All the several varieties of garden vegetables, etc., do remarkably well. Currants are of choice quality, but gooseberries are not so good. The usual garden fruits are excellent. We have some apple trees but they have not borne fruit as yet.\n\n\"An astonishing quantity of wild fruits flourish in this district, consisting of strawberries, saskatoons, cranberries, etc., etc. I consider the prospects all that could be desired and am well satisfied with the country. Men as a rule do best, I believe, upon the larger farms. Farm laborers, that is, men accustomed to work upon farms in England, can do well here. Would advise all such to start first working for farmers here at standard wages, until they become acquainted with the methods followed in this country, and then begin on their own account. Following this system, intelligent men willing to work should have no difficulty in improving their condition.\n\n\"Stock pays well in this district. Cattle and horses give good returns, and sheep paid us eighty per cent. profit the first year.\n\n\"B. H. Skrine.\"\n\n---\n\n\"Grenfell, Assiniboia, N. W. T.\n\n\"October 23rd, 1890.\n\n\"I came from Hampshire, England, and settled in Manitoba in 1885. I had fifty acres under crop this year. Twenty acres of wheat averaged thirty bushels per acre, and thirty bushels of oats averaged fifty bushels per acre.\n\n\"Garden products cannot be excelled. One acre of Swede turnips yielded fifteen tons without manure.\n\n\"At present I have seven cows and seven horses, and find stocks profitable. Sheep pay best of all, from fifty to seventy per cent. profit being the usual return, when they are properly looked after.\n\n\"My impressions are that there is a great future before this country, and that fine openings are available for practical farm hands.\n\n\"W. H. Ball.\"\n\n---\n\n\"Grenfell, Assiniboia, N. W. T.\n\n\"October 28th, 1890.\n\n\"We came here from Lancashire, England, in 1883, and secured two sections of land. One hundred and twenty-five acres were cropped this year with wheat and oats, both of which were good crops. Garden vegetables, etc., etc., were very good indeed.\n\n\"Stock raising is, perhaps, the most profitable branch of farming for this district. Cattle and horses pay well, the latter running out all winter without any care.\n\n\"We like the country immensely and are satisfied that it must succeed. Practical workers, if steady reliable men, could do well here. Good wages are paid, and an honest man starting with no capital and saving carefully from his wages, should find himself fairly upon his feet on his own account, in at most five years.\n\n\"Col. P. G. B. Lake.\n\n\"R. L. Lake.\"\n\"Grenfell, Assiniboia, N. W. T.,\"\n\n\"October 26th, 1890.\n\n\"This is my first season in the country, and I am located in the Pipestone District, having secured a section and a half of excellent land. This season only twenty-seven acres were cropped, and the result was a fine yield of oats of good quality.\n\n\"I like the country very much; think it is all right, and have no doubt in regard to its future prosperity. Agricultural laborers are wanted badly, and there are most promising openings awaiting men with sufficient capital to invest extensively.\n\n\"C. Bushe, M.D.\"\n\n---\n\n\"Grenfell, Assiniboia, N. W. T.,\"\n\n\"October 25th, 1890.\n\n\"I came to Manitoba from Somersetshire, England, in 1882, and secured three sections of land in the Pipestone Valley. This season I had 120 acres under crop. Sixty acres under wheat averaged thirty bushels per acre, and the same amount of land under oats yielded forty bushels per acre. Vegetables and all garden produce were excellent.\n\n\"Cattle, horses and sheep all pay well if properly managed.\n\n\"Viewing the situation from a purely business point, I am satisfied with the profits to be made, and I like the country and find the climate healthful. Good honest laborers, and men with more or less capital, are wanted, and if they possess a practical knowledge of agriculture, so much the better.\n\n\"P. Skrine.\"\n\n---\n\n\"Broadview, Assiniboia, N. W. T.,\"\n\n\"October 20th, 1890.\n\n\"I came from County Durham, England, in 1882. When I reached Winnipeg I had just $200 in my pocket. To-day I am worth $3,000. This year I had forty acres under oats and got a fine crop of extra good grain, which averaged 45 bushels to the acre. I had ten acres of wheat which yielded 22 bushels per acre of first-class grain. I consider the chances as most promising. I have done well myself, much better than I could ever have done in England, and anyone willing to work can do the same.\n\n\"Charles Dodd.\"\n\n---\n\n\"Cotham, Qu'Appelle Valley, Assiniboia,\"\n\n\"October 26th, 1890.\n\n\"I came to this part of Assiniboia from Staffordshire, England, in 1885, and homesteaded 160 acres. I do not go in for wheat or other cereals, as I think cattle and horses more profitable, the horses paying the best and surest returns.\n\n\"I could grow splendid grain here, but am so far from a market\nthat I prefer to feed everything to stock and make the beasts carry it in the shape of flesh and fat to market.\n\n\"I had a little capital to start with, but only very little, and think that anyone with enough to start upon in a small way can do well in this country. At present I have 36 head of cattle and 18 horses, all well-bred animals. I do not care for inferior stock, as it is just as easy to raise a good beast as a bad one.\n\n\"I would not recommend this part of the country to men utterly without means, but consider it a fine territory for Englishmen of small means who desire to live as gentlemen farmers. It is a beautiful country to look at and a pleasant one to live in; with a most healthful climate, and affording unsurpassed opportunities for sport with the gun.\n\n\"In this climate cattle and horses remain out in safety all through the winter and do well. I have at present one ox, a grade Shorthorn, which is the finest animal I have yet seen. He is fit for Smithfield as he stands, yet he has never been stabled and has fattened solely upon the nutritious native grasses.\n\n\"E. Kendrick.\"\n\n\"Nievervill, Man.\n\n\"I emigrated from Russia in 1876; I now own 480 acres of land; about the half is hay land; I like mixed farming. I have 6 horses and 44 cattle; keeping cows and raising calves pays well. I threshed this year 1,300 bushels wheat, 700 bushels oats, 200 bushels flax-seed; potatoes produce well; I raised from a quarter of an acre that I measured 95 bushels of potatoes, some weighing two pounds.\n\n\"When I came here I had $730.00; now I am at least worth $7,300.00. The climate is healthy; although the winter is cold, it is dry, that the cold is not so much felt. Spring sowing generally commences about the 15th April.\n\n\"Jerhard Kliver.\"\n\n\"South Brandon District, Man.,\n\n\"October 17th, 1890.\n\n\"SIR,—I came to this country from Toronto in 1880. This year I cropped 120 acres, and obtained a fine yield, both wheat and oats being good. I think this is the country of countries for anyone willing to work, and am perfectly satisfied.\n\n\"GEO. H. HALSE.\"\n\n\"Brandon, Manitoba,\n\n\"October 14th, 1890.\n\n\"Gentlemen,—I came to Manitoba from Oxford County, Ontario, in 1881, and my sons followed me in 1883. This year we had 500 acres under crop; 400 acres of wheat averaged from 25 to 30 bushels per acre; 100 acres of oats averaged 60 bushels per acre. I consider the outlook good, and am satisfied that anyone willing to work can get along all right in Manitoba, no matter whether they start with or without capital.\n\n\"THOS. MERRITT.\"\n\"Fish Creek, Calgary District, Alberta,\n\"August 29th, 1890.\n\n\"I have been nine years in the Calgary District and have farmed since my arrival. This year I had 120 acres under crops, including wheat, oats, barley and roots. I have this and every other year succeeded in growing first-class crops.\n\n\"Wheat has averaged from 35 to 53 bushels per acre. Barley averaged 40 bushels per acre. Oats last year yielded 65 bushels per acre, weighing 42 lbs. to the bushel, and my present crop is the best I have had. My root crops have been enormous each year.\n\n\"Nelson Bebo.\"\n\n\"Fish Creek, Alberta,\n\"August 28th, 1890.\n\n\"I have been five years in Alberta. This year I have forty-five acres under cultivation and I have a magnificent crop of wheat, oats and barley. I have every confidence in the future of the Calgary District as a farming country and especially as a wheat and barley growing country.\n\n\"Those seeking a new home need not be afraid of coming to Alberta. I believe it to be the best country on the Continent.\n\n\"Edward Nelson.\"\n\n\"Pine Creek, Alberta,\n\"August 29th, 1890.\n\n\"In reply to your request, I am able to state that the crops in Pine Creek District this year are equal to any I have seen in the North-West, which is saying a good deal. Wheat, barley, oats, potatoes, roots, etc., etc., are extra good crops. Oats are generally estimated to yield on an average in our district, from 50 to 75 bushels per acre. Oats, too, that will weigh from 40 to 49 lbs. per bushel.\n\n\"Sam. Ray.\"\n\n\"Calgary, Alberta,\n\"August 27th, 1890.\n\n\"This year I have under crop, 225 acres, principally oats, but have also wheat, barley, potatoes and roots, and am pleased to state that my crops are a splendid lot. I have oats that stand 5 feet 10 inches, and will yield on an average from 45 to 55 bushels per acre, and much of the crop will I believe, thresh over 65 bushels per acre.\n\n\"W. R. Hull.\"\n\n\"Grierson P.O., Calgary District, Alberta,\n\"August 23, 1890.\n\n\"I came to Alberta in June, 1889, and having examined the country thoroughly and being fully converted to its adaptability for grain and\nroot growing by the crops I saw, I concluded to sell out my farm in the east and make my home in Alberta. I purchased from the C. P. R. 960 acres of land, and have never had cause to regret having done so, the land all around me having gone up in price from $1 to $3 per acre during the past year.\n\n\"I put up last year about 100 tons of hay, and also brought my family out to Alberta. This spring I cleared $600 out of my hay alone, which was quite a good start. I have three acres of wheat on sod breaking, and I can tell you it is a grand crop. I also put in 30 acres of crop on a neighbor's farm, and have good crops of oats, barley and potatoes.\n\n\"I consider this as good a farming country as Ontario and the best country in the world for stock and dairy farming. My former home was in Leeds County, Ontario, and I must say I am glad I came West. My family enjoy the best of health and are in love with the country.\n\n\"Every one has his choice, but Alberta is good enough for me. I can't see why a man with even small capital should not get on well here, if he is practical and willing to work. If you are anxious to succeed, come to Alberta where prices for farm produce are good.\n\n\"E. Burke.\"\n\n---\n\n\"CALGARY ALBERTA.\n\n\"In reply to your questions relating to the country in the vicinity of the Rocky Mountain House, having lived at the Hudson Bay Company's Fort there for 12 years, I am able to speak with experience. Coming to the North-West in 1861, and being at Oxford House, Norway House and York Factory, have seen considerable of the north.\n\n\"My experience of the Mountain House leads me to believe that for a country suitable for mixed farming, it exceeds in the luxuriance of its grasses, its plentiful supply of timber, its beautiful mountain streams abounding in fish and the productions of its soil, any portion of Alberta that I have seen; that it will, in the near future, be a thickly settled and wealthy district I have no doubt. During the last two years of my stay there we grew barley, potatoes, cabbages, carrots turnips and beets, the equal of which I have never seen. From the Red Deer to the Mountain Fort, the county resembles old country parks, clumps of trees and open glades.\n\n\"Angus Fraser,\"\n\n---\n\n\"DUNBOW, ALBERTA.\n\n\"As you wish to have my experience in Alberta, as to farming and ranching, I would say that we have harvested good crops for the past four years; this fall we threshed from the \"Welcome\" variety of oats, sixty-five (65) bushels per acre, weighing forty-nine and a half (49½) lbs. per bushel, and of the early \"Race Horse\" variety, seventy (70) bushels per acre, weighing forty-nine lbs. per bushel. \"Champlain\" wheat, forty (40) bushel per acre, weighing sixty-five (65) lbs. per bushel. Red Fyfe wheat, thirty (30) bushels per acre, weighing sixty-two (62) lbs. per bushel. Barley, forty (40) bushels per acre, weighing fifty-six (56) lbs. per bushel. Owing to dry season, potatoes were below the average; from one and a half (1½) acres we gathered four...\"\nhundred bushels of extra fine potatoes. We milked six cows, and from five months' make, we sold $175 worth of butter, besides keeping all the milk and butter we required for our family of eight adults. This is one of the best dairy and cattle districts on the continent; of course cattle require proper care during the winter; we have not lost one animal since we settled here.\n\n\"We remain, yours,\n\n\"JOHN PATERSON & SONS.\n\nA. HUTCHINGS, of Poplar Lake, came from the Village of Newboro, County of Leeds, Ontario, to the Edmonton district in the fall of 1875, and was engaged in trading until the spring of 1880. Then took up his present farm about six miles north of Edmonton. Now has 420 acres of land with house and outbuildings, 40 acres under cultivation, 40 horned cattle, 6 horses, self-binder, mower and rake, waggons, plows, harrows and all other necessary farm machinery. Has raised a crop every year since 1880 and never had a failure of oats or barley. Had two partial failures of wheat in ten years. Last season had over 40 bushels of wheat to the acre. His wheat has averaged 30 bushels to the acre eight years out of the ten. Has made butter and raised cattle extensively ever since starting farming. Considers this region far superior for dairying and stock raising to his native place in Ontario. There is a longer milking season, a larger flow of milk and it is richer in butter. There is plenty of green grass, as a rule, from the 15th of May to the 1st of November. The ground is bare from the 15th of April. Hay is abundant and can be put in the stack by contract at $2.50 a ton. Cattle raising is doubly as profitable here as in Ontario. Killed 2½ year old steers in September of last year, an exceptionally dry season, which dressed 650 pounds.\n\nM. MCKINLAY, of Sturgeon settlement, Edmonton, was raised at Strathalban, P. E. Island. Came to Edmonton in 1883, and settled on a farm of 320 acres of clear prairie. The quality of the soil is unsurpassed and it is close to timber and coal. The climate is favorable for grain and root crops and the yield per acre in wheat, barley, oats and potatoes exceeds that of the most carefully tilled soil on the island. In 1888, Daniel McKinlay (brother of Malcolm) raised 1,100 bushels of oats from 12 acres. Cattle raising is very profitable on account of the great growth of wild grass for summer pasturage. Has cut a winter supply of hay from the same ground over which the cattle grazed during the summer. Sowing commences generally in the early part of April; the weather is clear and dry until June which is termed the rainy season, when vegetation makes a rapid growth. Harvesting commences in August and the ground freezes in November. The first sleighing may be looked for about Christmas. The winter season is more pleasant than that of the Island on account of its dryness and serenity.\n\nMALCOLM McLEOD, of Edmonton, owns a steam thresher and has threshed during the seasons of '89 '88 '87 and '86 at Edmonton. In '85 and '84 threshed at Wolseley, Assiniboia, and in '83 and '82 at Gladstone, Manitoba. Has threshed heavier yields of wheat, barley and oats at Edmonton than at either Wolseley or Gladstone, and the quality of grain has been equal to the best he has seen anywhere.\nIn 1887 threshed for T. G. Hutchings, of Belmont 1,500 bushels of oats from 12 acres of land. In '88 threshed for Geo. Sutherland of the Sturgeon River settlement, 55 bushels of white Fife wheat to an acre from a field of five acres. In the same year, threshed for Geo. Hutton of the Sturgeon, 125 bushels oats to the acre. Took no account of the yields of barley, but some ran over 50 bushels to the acre. In '89 the yield was light but threshed 80 bushels of oats to the acre for T. G. Hutchings and A. McLeod.\n\nJellet & Ottewell, of Clover Bar settlement, south side of the Saskatchewan, in the season of 1886, threshed 681 bushels of oats from six acres, a yield of 114 bushels per acre. In 1887 they threshed 2,690 weighed bushels of oats from 26½ measured acres, a yield of 101½ bushels to the acre. The oats weighed 42½ pounds to the measured bushel. In 1888 they threshed 3,262 bushels of barley from 55 acres, a yield of 59 bushels. 17 lbs. to the acre; four acres of wheat yielded 163 bushels, 42 bushels to the acre; and 42 acres of oats yielded 4,123 bushels, or 98 bushels to the acre. Of the oats, however, one field of 15½ acres yielded 1,758 bushels or 113½ bushels to the acre. In 1889 they threshed 1,500 bushels of barley from 50 acres of a volunteer crop.\n\n\"Calgary, 26th August, 1890.\n\n\"To J. G. Fitzgerald, C. P. R. Land Agent, Calgary:\n\n\"We, the undersigned, members of the Ontario Farmers' Union, delegation from Waterloo County, having visited Calgary and the surrounding country, wish to manifest hereby our satisfaction with the appearance of the country as well as the crops, and desire to express our opinion that as far as our judgment can determine from what we have seen, this country would be a desirable place for our Ontario people to emigrate to, providing they wish to make their homes on prairie land or on good grazing land. We found this country rolling and undulating, very much like the finest of our Ontario land; the crops which are now being harvested are on the whole very fine indeed, not so long in the straw, but exceedingly well headed, and the quality of the grain first-class.\n\nThe situation is such that lumber is as cheap as in Ontario, as also are fence posts (cedar). Coal mines are close to hand, making fuel cheap.\n\n\"In short, we are all favorably impressed with this country.\n\n\"John F. McKay, Menno Bricker,\n\"Alex. Peterson, Henry Brubacher,\n\"James Taylor, Jos. Bingeman,\n\"Matthew Durrant, Levi Stauffer,\n\"Henry Hamilton, Izaac Groh,\n\"W. I. Moody, Samuel Moyer,\n\"Peter W. Glennie, John Shuh,\n\"Alex. A. Glennie, Josiah Shantz,\n\"Solomon Erb, Eli Clemens,\n\"Jacob E. Clemens, E. Ziegler,\n\n\"Agricultural Society of Waterloo.\"\n\"Edmonton, Alberta, November 12th, 1889.\n\n\"I have been farming in the Edmonton District for the past seven years, and have, during that time, succeeded in growing good crops of wheat, oats, barley, potatoes, turnips, cabbages and various other garden vegetables.\n\n\"My average crops of wheat have yielded 34 bushels per acre, and this year I had a yield of 40 bushels per acre. My average crops of barley range from 40 to 60 bushels per acre; oats from 50 to 60 bushels per acre, and potatoes 500 bushels per acre. I had 700 cabbage plants this year, and 200 heads weighed 15 lbs each, and the balance weighed from 10 to 12 lbs each. I consider the district well adapted for mixed farming, dairying, etc. Cattle and horses, pigs and sheep do well.\n\n\"Any practical man with a capital of from $500 (£100) upwards, who is willing to work, has every chance of succeeding here if he engages in mixed farming.\n\n\"This year I have been making cheese from the milk of five cows, and have sold what I made at 22 cents per lb. (about 11d).\n\n\"When I established here I had no capital other than health, perseverance and industry.\n\n\"I like the country and climate and have succeeded here.\n\n\"Hugh McKay.\"\n\n\"Pine Creek, South of Calgary,\n\n\"18th November, 1889.\n\n\"Dear Sir,—After a residence of twelve years in Manitoba, I came to Alberta in 1883 and took up a homestead and pre-emption in the neighborhood of Pine Creek, about twelve miles south of Calgary, and have since been farming there. My crops each year have been good, wheat and oats exceptionally so. In 1888 I had 35 acres under crop of oats, wheat, barley, alfalfa, potatoes and garden vegetables. Oats returned a yield of 45 bushels per acre, wheat 30, barley 30. I had under cultivation this year, 1889, about 50 acres of grain and 3 of roots, and have now 1,000 bushels of oats, 350 bushels of wheat, and 60 bushels of barley, 300 bushels of potatoes and 200 bushels of turnips. I have grown alfalfa for two years and found it a good crop; during January, 1889, it grew over half an inch, and was green fully a month before the native grasses in the spring. I believe the country is well adapted for its growth, and that it will be a valuable crop here.\n\n\"From my experience of Alberta, I consider it the best part of Canada for general farming, and think any practical farmer coming here with a little capital will never regret the move, as Alberta is bound to be the most prosperous province in the Dominion, as well as having the most enjoyable climate.\n\n\"Yours truly,\n\n\"(Signed), Peter Cleland.\"\n\n\"Edmonton, Alberta.\n\n\"I have resided in the Edmonton district for the past eleven years. My former home was in Carleton County, Ontario. I have been engaged in mixed farming the greater part of the time since my\narrival here, and have succeeded in growing good crops of wheat, barley, oats, potatoes and roots every year, my wheat averaging 45 bushels per acre; barley, 48 bushels per acre; oats, from 75 to 125 bushels per acre, and potatoes, from 450 to 500 bushels per acre. I have 32 cows. This year I milked 10 of them, and have sold over $600 worth of butter, besides keeping sufficient for my family use. I have also 8 horses, 14 pigs, 14 sheep, and fowls of different kinds.\n\n\"I have succeeded in the country, and consider that any practical farmer can make a good living here, with, say, a capital of $1,000 to start with. I am a married man, and have six children, and they enjoy the advantage of attending a school equal at least to any country school in Ontario. We have churches of every denomination, and large stores carrying every line of goods. We have a good climate, plenty of timber and coal at one's door, water and grass good and abundant everywhere. I know of no country which offers greater inducements to practical industrious farmers. My wife and myself could not be induced to return to Ontario again. The climate is healthy and good, and life is in every way enjoyable. I have been connected with the District Agricultural Society since its organization, eight years ago, and we have had eight annual exhibitions. The farm products shown each year would make a creditable display at any exhibition in Canada. Wages for good, steady farm hands have always been good here, from $26 to $40 per month the year round. The settler coming to Alberta will, if he is industrious, never regret his choice of location.\n\n\"ROBT. McKERNAN.\"\nDOMINION LANDS REGULATIONS.\n\nHOMESTEAD REGULATIONS.\n\nAll even numbered sections excepting 8 and 26 are open for homestead entry.\n\nENTRY.\n\nEntry may be made personally at the local land office in which the land to be taken is situate, or, if the homesteader desires, he may, on application to the Minister of the Interior, Ottawa, or the Commissioner of Dominion Lands, Winnipeg, receive authority for someone near the local office to make the entry for him.\n\nDUTIES.\n\nUnder the present law, homestead duties may be performed in three ways:\n\n1. Three years' cultivation and residence, during which period the settler may not be absent for more than six months in any one year without forfeiting the entry.\n\n2. Residence for three years within two miles of the homestead quarter section and afterwards next prior to application for patent residing for three months in a habitable house erected upon it. Ten acres must be broken the first year after entry, 15 acres additional in the second, and 15 acres in the third year; 10 acres to be in crop the second year, and 25 acres the third year.\n\n3. A settler may reside anywhere for the first two years, in the first year breaking 5 acres, in the second year cropping said 5 acres, and breaking additional 10 acres, also building a habitable house. The entry is forfeited if residence is not commenced at the expiration of two years from date of entry. Thereafter the settler must reside upon and cultivate his homestead for at least six months in each year for three years.\n\nAPPLICATION FOR PATENT\n\nmay be made before the local agent, any homestead inspector, or the intelligence officer at Moosomin or Qu'Appelle station.\n\nSix months' notice must be given in writing to the Commissioner of Dominion Lands by a settler of his intention, prior to making application for patent.\n\nIntelligence Offices are situate at Winnipeg and Qu'Appelle station. Newly arrived immigrants will receive at any of these offices information as to the lands that are open for entry, and from the officers in charge, free of expense, advice and assistance in securing lands to suit them.\n\nThe Canadian Government contemplates granting bonuses to Bona Fide settlers from Europe, on lands in the Province of Manitoba and Western Territories of Canada and British Columbia, and it is recommended that Booking Agents be asked for particulars in regard to this matter.\n\nAll communications having reference to lands under control of the Dominion Government, lying between the eastern boundary of Manitoba and the Pacific Coast, should be addressed to\n\nThe Secretary of the Department of the Interior, Ottawa, or the Commissioner of Dominion Lands, Winnipeg, Man.\nTHE CANADIAN PACIFIC RAILWAY.\n\nIs the most Substantial and Perfectly Built Railway on the Continent of America, and superbly equipped with the finest rolling stock modern skill can produce. Coaches, Dining and Sleeping Cars are triumphs of luxurious elegance, and excel in Stability and Beauty of Finish any in the world.\n\nCOLONISTS\n\nReceive special attention by this route, which is the Best, Safest, Fastest, and only route carrying colonists without change of cars all the way from Montreal to Manitoba.\n\nFREE COLONIST SLEEPING CARS\n\nAre provided. These are the best of their kind in the world, and are taken through upon the same fast trains as first-class coaches.\n\nThrough Tickets from HALIFAX, QUEBEC, MONTREAL, OTTAWA, PRESCOTT, BROCKVILLE, TORONTO, HAMILTON, LONDON, and all points in Canada; also from NEW YORK, BOSTON, and all the principal points in New England States, to VANCOUVER, VICTORIA and other points in British Columbia, and to PORTLAND, Ore., PUGET SOUND PORTS, SAN FRANCISCO, etc.\n\nBusiness Correspondence invited, and will meet with prompt and courteous attention if addressed to any of the undermentioned Officers or Agents.\n\nR. KERR, General Passenger Agent,\nW. & P. Division, WINNIPEG.\n\nE. V. SKINNER, General Eastern Agent,\n353 Broadway, NEW YORK.\n\nC. E. McPHERSON, Asst. Gen. Pass. Agt.,\nNew Brunswick Div., &c., ST. JOHN, N.B.\n211 Washington St., BOSTON.\n\nJ. F. LEE, District Freight and Pass. Agt.,\n232 South Clark St., CHICAGO, Ill.\n\nD. McNICOLL, General Passenger Agent,\nMONTREAL.\n\nG M. BOSWORTH, Asst. Freight Traffic Mgr.,\nO. & A. & L. Divisions, TORONTO.\n\nW. R. CALLAWAY, District Passenger Agt.,\n118 King St. West, TORONTO.\n\nW. F. EGG, District Passenger Agent,\nWindsor Street Station, MONTREAL.\n\nC. SHEEHY, District Passenger Agent,\n11 Fort Street West, DETROIT, Mich.\n\nGEORGE OLDS, General Traffic Manager,\nMONTREAL.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/farminginnorthwe00cana.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 60, "total-input-tokens": 83132, "total-output-tokens": 28070, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 68, 1], [68, 3601, 2], [3601, 3601, 3], [3601, 3601, 4], [3601, 3694, 5], [3694, 3694, 6], [3694, 5524, 7], [5524, 8286, 8], [8286, 8286, 9], [8286, 11105, 10], [11105, 14288, 11], [14288, 16755, 12], [16755, 18675, 13], [18675, 18675, 14], [18675, 20375, 15], [20375, 23104, 16], [23104, 25848, 17], [25848, 25848, 18], [25848, 28634, 19], [28634, 30374, 20], [30374, 32360, 21], [32360, 35156, 22], [35156, 35156, 23], [35156, 37848, 24], [37848, 40000, 25], [40000, 43853, 26], [43853, 46206, 27], [46206, 46206, 28], [46206, 48630, 29], [48630, 51075, 30], [51075, 51613, 31], [51613, 51613, 32], [51613, 53540, 33], [53540, 56145, 34], [56145, 56145, 35], [56145, 59065, 36], [59065, 62001, 37], [62001, 62001, 38], [62001, 64664, 39], [64664, 66781, 40], [66781, 68881, 41], [68881, 68881, 42], [68881, 70732, 43], [70732, 73670, 44], [73670, 76029, 45], [76029, 76888, 46], [76888, 78706, 47], [78706, 81164, 48], [81164, 83852, 49], [83852, 86136, 50], [86136, 88685, 51], [88685, 90770, 52], [90770, 93777, 53], [93777, 97031, 54], [97031, 99711, 55], [99711, 102473, 56], [102473, 104116, 57], [104116, 104116, 58], [104116, 106797, 59], [106797, 108653, 60]], "primary_language": ["en", "en", "None", "None", "en", "None", "en", "en", "None", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "None", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, false, false, false, false, true, false, false, false, false, true, false, false, false, true, false, false, false, false, true, false, false, true, false, true, false, false, false, true, false, false, true, false, false, true, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]