[{"id": "bd805edd85a72f3a7c37fb08c8fcd8062d6ff112", "text": "On the Commercial Progress and Resources of Central British America; the Lake Winnipeg and Saskatchewan Districts. By Henry Youle Hind, M.A., F.R.G.S., Trinity College, Toronto.\n\n[Read before the Statistical Society, 19th January, 1864.]\n\nCONTENTS:\n\nI.—Résumé of the History of Central British America to the Year 1858 ... 82\nII.—Action of the United States Government, the State of Minnesota, the British and Canadian Governments, and the People of Red River, up to 1863 ... 86\nIII.—The Agricultural Capabilities of the Red River and Saskatchewan Districts ... 88\nIV.—Their Mineral Wealth ... 90\n   a. Salt\n   b. Lignite Coal\n   c. Iron Ores\n   d. Bitumen or Petroleum\n   e. Gold\nV.—The Winnipeg Gold Field, and the Saskatchewan Gold Field ... 91\nVI.—Communication with Central British America ... 93\n   a. Communication via St. Paul\n   b. City Superior\nVII.—The Canadian Emigrant Route across the Continent ... 94\nVIII.—Comparison between British and United States' Routes across the Continent ... 96\nIX.—Communication between Canada and Central British America ... 100\nX.—Communication via Hudson Bay ... 100\nXI.—No other Area suitable for extensive Settlement in British America, besides the Lake Winnipeg and Saskatchewan Districts ... 101\nXII.—The Progress of Minnesota, Dakota, and Nebraska ... 102\nXIII.—Indian Population of Central British America ... 103\nXIV.—General View of British America ... 103\n\nI.—Résumé of the History of Central British America to the Year 1858.\n\nA century and a quarter has elapsed since the French Government sent an expedition from Canada through the interior of the American continent, with a view to reach the Pacific Ocean by an overland route.\n\nM. de la Verandèrie, the chief of the expedition, did not succeed in getting as far westward as the Rocky Mountains, but he and his successors constructed a fort three hundred miles west of Lake Winnipeg for the purposes of trade; and about the same time other fortified trading posts were established by the French, still further to the west, the most remote of which was situated near the junction of the north and south Saskatchewan, in long. 103° W.\n\nPrior to this occupation of the Saskatchewan valley, the French had, successfully, attempted to reach Hudson's Bay overland, both from the St. Lawrence and Lake Superior. These expeditions were undertaken when the population of the whole of Canada was less than one-fifth part of the present population of Montreal, and, consequently, less than one-half the population of Toronto.\nThat the early French colonists were pre-eminently distinguished by their desire for the extension of their territory, the following extracts from the Paris documents will establish beyond doubt, and at the same time convey some idea of their activity and enterprise in the infancy of Canadian history, and also of the projects they formed, and the conceptions they entertained of the extent of the country they intended to colonize as new France, north of the great lakes, more than one hundred years ago.\n\nAs early as 1646, we read that Sieur Bourdon, with three Frenchmen, was sent overland from Quebec to take possession of Hudson's Bay for France. The French had already established a trade with the Indians of Hudson's Bay, and in a few years induced them to come to Quebec to barter their furs.\n\nIn 1661 the Rev. Claude Dablon set out overland for Hudson's Bay via the Saugenay, but he succeeded in reaching only the head waters of the Nebouka, 300 miles from Lake St. John.\n\nIn 1663 the Indians of the Bay du Nord (Hudson's Bay) returned to Quebec in further quest of Frenchmen, and M. Davaugour sent thither Sieur de la Couture with five men, who proceeded overland to the said bay, possession whereof he took in the King's name, noted the latitude, planted a cross, and deposited at the foot of a large tree his Majesty's arms engraved on copper, and laid between two sheets of lead, the whole being covered with some bark of trees.\n\nIn 1671 Père Albanel was despatched overland to Hudson's Bay by the Intendant Talon (via the Saugenay river); and in the same year (1671) Sieur de St. Lusson was sent by M. Talon to Sault St. Marie, where he made a treaty with \"seventeen Indian nations.\" The Intendant in his report states that the place Sieur de St. Lusson reached is not supposed to be 300 leagues from the extremities of the countries bordering on the Vermilion or South Sea. He continues: \"The countries bordering on the Western Ocean appear to be no farther from those discovered by the French, according to the calculation of the distance made from the reports of the Indians; and by the maps there does not appear to be more than 1,500 leagues of navigation remaining to Tartary, China, and Japan.\" Even at so early a period in the history of Canada did the French look forward to establishing communication, overland, with the \"South Seas,\" to command the trade of Western Asia; and in another half century the French Government were so impressed with the idea of an overland route to the Pacific that they sent instructions to Quebec to have the exploration effected.\n\nDu Chesneau writes in 1681: \"They (the English) are still at Hudson's Bay, on the north, and do great damage to our fur trade.\"\n\nIn 1683 M. de la Barre writes to M. de Seignelay: \"The English\nof Hudson's Bay have this year attracted many of our northern Indians, who for this reason have not come to trade to Montreal. When they learned by expresses, sent them by Du L'hut on his arrival at Missilimakinak,* that he was coming, they sent him word to come quickly, and they would unite with him to prevent all the others going thither any more. If I stop that pass (Lake Superior to James Bay), as I hope, and as it is necessary to do, as the English of that Bay excite against us the savages, whom Sieur du L'hut alone can quieten, I shall enter into arrangements with those of New York for the surrender to me of any guilty fugitives, but we are desirous to obtain an order to that effect from the Duke of York.\"\n\nAnd in the same year (1683) M. de la Barre writes to M. de Seignelay as follows: \"A small vessel has just arrived from Hudson's Gulf, 200 leagues further north than the Bay. * * * It is proper that you let me know early whether the King desire to retain that post, so that it may be done, or the withdrawal of the French, for which purpose I shall dispose matters in order to aid them overland beyond Lake Superior, through Sieur du L'hut, and to send to them by sea to bring back the merchandise and peltries.\"\n\nIn Governor Dongan's Report on the State of the Province, in 1687, we find a notice of the Hudson's Bay in the New York Colonial Manuscripts:† \"Last spring he (the Governor of Canada) sent one De la Croa with fifty soldiers and one hundred young men of Canada to the North-West Passage, where, I am certainly informed from Canada, they have taken three forts.\"‡ In Mr. Nelson's memorial about the state of the Northern Colonies of America, dated 1696, he says, \"there are actually, this instant, now at Versailles, six Sagamoes, or chiefs, sent from Canada, Hudson's Bay, and Nova Scotia, to solicit such help and assistance against us,\" &c., &c.\n\nM. de la Verandèrie was sent on an overland expedition by the desire of Count Maurepas, in the year 1738, to discover the Pacific Ocean. He set out with his party from Montreal, passed through Lake Superior, and, proceeding nearly due west, ascended the Assiniboine river, and directed his course towards the Rocky Mountains. Without reaching the Rocky Mountains, M. de la Verandèrie was obliged to abandon the prosecution of his expedition. Three hundred miles west of Lake Winnipeg, on the Assinniboine river, the French erected Fort la Reine. Three others were built further\n\n* Michillimakinak, Green Bay, and Lake Huron.\n† Documents relating to the Colonial History of the State of New York.\n‡ Governor Dongan refers to Chevalier de la Troye—an account of whose expedition to Hudson's Bay, in 1686, is contained in Charlevoix's History.\nwest, the most remote of which stood on the bank of the River Paskoyac.*\n\nMackenzie speaks of Canadian missionaries who penetrated \"2,800 miles from the civilized parts of the continent long before \"the cession of the country to the English in 1763!\"\n\nThe names of several lakes and prominent hill ranges date from the occupation of the country west of Lake Winnipeg by the French, prior to the conquest. Such as Dauphin Lake, Dauphin Mountains, Fort Bourbon, on the Saskatchewan, near the west end of Cedar Lake. The most remote of the French settlements on the Saskatchewan appears to have been \"at Nipawee, in lat. 53½, \"long. 103.\"†\n\nWhen we consider these great enterprises in connection with the population of Canada at the time, we cannot fail to be astonished at the energy of the French colonists, and the desire they exhibited to extend their empire even to the frozen north, and to secure the overland trade with Hudson's Bay and the far unknown west—even to \"South Seas.\"\n\nDuring the period when they were undertaken, the population of Canada, from 1666 to 1738,‡ was as follows:—\n\n| Year | Total Population | Men Bearing Arms |\n|------|-----------------|------------------|\n| 1666 | 3,418           | 1,344            |\n| '67  | 4,312           | 1,566            |\n| '68  | 5,870           | 2,000            |\n| '79  | 9,400           |                  |\n| '85  | 17,100          | 3,000            |\n| 1738 | 45,000          |                  |\n\nAt this period Upper Canada and a large portion of Lower Canada was a wilderness, and yet the French sought to extend their territorial jurisdiction to the shores of Hudson's Bay; and some years later had visions of grasping the Indian and China trade from the shores of the Pacific, which they hoped to reach overland from Canada.\n\nThe most important particulars of the history of Central British America, from the date of the formation of the North-West Company\n\n* Foot note to New York Colonial Manuscripts; Paris Doc.\n\n† The name \"Nipawee\" is perhaps the same as Nepowewin or \"The Standing Place,\" the present name of the mission opposite Fort à la Corne. Before the conquest the French had settlements at Dauphin Lake, the Pasquia (near Carrot river or Root river), and at Nipawi, \"where they had agricultural instruments and wheel carriages, marks of both being found about the settlements.\"—Mackenzie's Voyages.\n\n‡ Paris Documents.\nof Montreal in 1783 to its union with the Hudson’s Bay Company in 1821, are related in the Blue Book containing the Report of the Committee of the House of Commons on the Hudson’s Bay Company’s Affairs, published in 1858, and in other accessible documents. It is also well known that partially successful efforts were made by Lord Selkirk to establish an immigrant agricultural colony on the Red River of the North, which, in the year 1857, numbered 7,000 souls, by the natural increase of the population and the settlement of the servants of the Company. Up to this period, however, namely, the appearance of the Report of the Committee of the House of Commons, in 1858, no other future was admitted to be possible for this vast central region of British America than that of a preserve for the interests of the fur trade.\n\nII.—Action of the United States’ Government, the State of Minnesota, the British and Canadian Governments, and the People of Red River up to 1863.\n\nIn the winter of 1858-59 the machinery, furniture, and timbers of a steamer were transported by American citizens from Crow Wing, on the Upper Mississippi, to Fort Abercrombie, on the Red River of the North, where the vessel was built; and in 1859, the first steamer reached Fort Garry.\n\nEighteen months after the publication of the Parliamentary inquiry, and the preliminary reports of the British and Canadian Exploring Expeditions of 1857 and 1858, the New York Chamber of Commerce turned its attention to Central British America, and published a brief description, slightly coloured, of the advantages it possessed. An extract from this report is embodied in an executive document recently published by the United States’ Government, entitled “Relations between the United States and North-West British America.” The first voyage of the American steamer was made in June, 1859, from Fort Abercrombie to Fort Garry. Fort Abercrombie is about 200 miles north-west of St. Paul. In the executive document, to which allusion has just been made, the following brief résumé is given of what has been done in the United States with respect to Central British America. “This incident” the voyage of the steamer to Fort Garry, “was the legitimate sequel to events in Minnesota which had transpired during a period of ten years. Organized as a territory in 1849, a single decade had brought the population, the resources, and the public recognition of an American State. A railroad system connecting the lines of the Lake States and provinces at La Crosse, with the international frontier on the Red River at Pembina, was not only projected, but had secured in aid of its construction, a grant by the Congress of the United States of 3,840 acres a mile, and a\nloan of state credit to the amount of 20,000 dollars a mile, not exceeding an aggregate of 5,000,000 dollars. Different sections of this important extension of the Canadian and American railways were under contract and in process of construction. In addition the land surveys of the Federal Government had reached the navigable channel of Red River; and the line of frontier settlement, attended by a weekly mail, had advanced to the same point. Thus the Government of the United States, no less than the people and authorities of Minnesota, were represented in the north-west movement.\n\nThe foregoing statement of the condition of things at the beginning of 1860 is not materially changed. The Palmerston Ministry has not prosecuted to effect the masterly and comprehensive policy of Sir E. B. Lytton. The commerce of Minnesota with Selkirk and the Saskatchewan valley has increased, being double in 1861 what was transported in 1860. Selkirk settlement is still unrecognized as a province of England, its population not materially enlarged, and mostly by American emigrants.\"\n\nThe resolution of the House of Representatives of the 20th May, 1862, is well worthy of attention. It is as follows:\n\nResolved,—That the Secretary of the Treasury be, and he hereby is requested, to communicate to this house any information in the possession of his department which he may judge to be in a form suitable for the consideration of the House of Representatives upon the relations between the United States and North-West British America, particularly the central districts of the Red River of the North and the Saskatchewan.\"\n\nMr. Chase replies,—\"In compliance with the spirit and terms of this resolution, I have caused to be prepared an abstract of the reports of James W. Taylor, Esq., special agent of the Treasury Department, and of other papers on file relating to the subject, which abstract, together with the papers referred to, I have the honour to transmit herewith.\"\n\nThese papers, occupying eighty-seven pages of print in octavo form, close with the recommendation, emanating from Mr. Taylor, that it would be an instance of well directed legislation for the Congress of the United States and the Parliament of England to unite in a liberal subsidy, say of $200,000 by each government, for the transmission of a weekly mail from the limits of navigation on the Mississippi river, and the British coast of Lake Superior by an international route to the centres of the gold districts of British Columbia and Washington Territory.\" Similar reciprocity of action has led to unity of interests and sentiments on the opposite coasts of the\n\n* \"Relations between the United States and North-West British America.\" Executive Document, House of Representatives, 1862.\n\"St. Lawrence and the Great Lakes, itself an effective bond of peace. Why not disarm the whole frontier of the North by constant multiplication of such ties and guarantees of international concord?\"\n\nIn Canada, the charter of the North-West Transit Company has not yet expired, and it is in contemplation to obtain a renewal with increased powers during the approaching session of the Provincial Parliament.\n\nThe magnificent and eminently patriotic plans of the New Hudson's Bay Company, as described in their prospectus, for the construction of a telegraph and the establishment of a postal communication across the continent within the limits of British America, and to open for settlement the rich agricultural areas drained by Red River, the Assinniboine, and the Saskatchewan are well known here, and require no reference at present.\n\nIn 1863, the people of Red River Settlement presented a \"Memorial to the British and Canadian Governments,\" praying for the opening of communication between Canada and British Columbia entirely within British territory. This memorial, with remarks on the colonization of Central British America, and the establishment of a \"great territorial road,\" by Mr. Sandford Fleming, C.E., was printed by order of the Legislative Assembly of Canada in 1863.\n\nIt will thus be seen that great projects relating to Central British America are proposed by the Congress of the United States, the State Government of Minnesota, the Canadian Government, and the Hudson's Bay Company, and it now remains to consider the natural resources of that distant region which it is intended to bring within reach of the great commercial centres.\n\nIII.—The Agricultural Capabilities of the Red River and Saskatchewan Districts.\n\nIn estimating the agricultural capabilities of the basin of Lake Winnipeg, I bring to bear on the subject the result of personal observation from the head waters of the Winnipeg river, 104 miles west of Lake Superior, to the elbow of the south branch of the Saskatchewan (long. 108 W.) a distance, measured along the centre of the fertile belt of land which crosses the basin of the Winnipeg from the Lake of the Woods to the foot of the Rocky Mountains, of about 750 miles. West of the forks of the Saskatchewan to the Rocky Mountains, about 300 miles, I have based my estimate upon the reports of Captain Palliser and his associates and upon other reliable sources. A residence of many years in Canada has afforded me, I venture to believe, sufficient experience to admit of my forming a tolerably correct opinion respecting the general features of soil, its fitness for cultivation, and the amount of labour required to make its cultivation remunerative. But\nwhen I say that there exists within the basin of Lake Winnipeg an area of cultivable land greater than that which can be found within the province of Canada, I have in view the expenditure over a considerable area of an equal amount of manual labour, in one form or another, to bring it into a proper state for cultivation; the labour in Canada being devoted to clearing away the forests, in the basin of Lake Winnipeg to drainage. But there are many thousand square miles in the fertile belt of Central British America fitted for the plough in their present natural condition. Those great advantages which belong to a wide extent of immediately available prairie lands of the richest description, which have led to the rapid peopling of Illinois State, belong also to the Winnipeg and Saskatchewan districts, and the climate of those districts is in no way inferior to that of the central portions of Canada, where winter wheat is successfully grown.*\n\nThe agricultural capabilities of the basin of Lake Winnipeg may be summed up as follows:\n\n| Description                                                                 | Acres       |\n|---------------------------------------------------------------------------|-------------|\n| On the route from Fort William, Lake Superior, to the Lake of the Woods, including the valley of Rainy river | 200,000     |\n| The fertile belt, stretching from the Lake of the Woods to the flanks of the Rocky Mountains, and as far north as the 54th parallel, on the Athabasca, west of McLeod’s river (80,000 square miles) | 51,200,000  |\n| Isolated areas in the prairie plateau, south of the Assinniboine           | 2,000,000   |\n| Isolated areas in the great plain plateau, the extension northwards of the great American desert, and in the valleys of the rivers flowing through it | 1,000,000   |\n| Total area of land available for agricultural purposes                     | 54,400,000  |\n| Approximate area suitable for grazing purposes                             | 30,000,000  |\n| Total approximate area fitted for the abode of civilized man              | 84,400,000  |\n| Approximate area of the basin of Lake Winnipeg, within British territory   | 199,680,000 |\n| Area fitted for the abode of civilized man                                 | 84,400,000  |\n| Desert area unsuitable for the permanent abode of man                      | 115,280,000 |\n\nComparing this extent of surface with Canada, we arrive at the following results:\n\n| Description                                                                 | Acres       |\n|---------------------------------------------------------------------------|-------------|\n| Area of the province of Canada (340,000 square miles)                      | 217,600,000 |\n| ,, occupied by the sedimentary rocks (80,000 square miles)                 | 51,200,000  |\n| ,, crystalline rocks                                                       | 166,400,000 |\n| If we suppose that one-sixth of the area occupied by the crystalline rocks is capable of cultivation, as regards soil and climate (an estimate probably in excess), the total amount of land in Canada available for the purpose of settlement will be approximately | 78,900,000  |\n| Showing an excess of land fitted for the permanent abode of man, in favour of the basin of Lake Winnipeg over the province of Canada, of | 5,500,000   |\n\n* Winter wheat has been grown at Red River settlement with success, 1862.\nIn Upper Canada, with a population of 1,396,091, there are 13,354,907 acres held by proprietors, of which only 6,052,619 acres are under cultivation, cropped, or in pasture. If the whole quantity of land fit for cultivation were occupied in the same proportion, the population of Canada would exceed eighteen millions. At the same ratio of inhabitants to cultivable and grazing land, the basin of Lake Winnipeg would sustain a population exceeding 19,000,000, or leaving out of consideration the land suitable to grazing purposes, its capabilities would be adapted to support 12,000,000 people. If European countries, such as France and Great Britain, were taken as the standard of comparison, or even many of the States of the American Union, the number would be vastly greater.\n\nWith reference to the climate of a large part of the Saskatchewan district, M. Bourgeau, the accomplished botanist who accompanied Captain Palliser's expedition, says:—\"In effect, the few attempts at \"the culture of the cereals already made in the vicinity of the \"Hudson's Bay Company's trading ports demonstrate by their \"success how easy it would be to obtain products sufficiently abun- \"dant to largely remunerate the efforts of the agriculturists. There, \"in order to put the land under cultivation, it would be necessary \"only to till the better portions of the soil. The prairies offer \"natural pasturage as favourable for the maintenance of numerous \"herds as if they had been artificially created.\"\n\nIV.—Their Mineral Wealth.\n\nI now proceed to glance at the mineral wealth of this central region of British America. The little that is known of it already establishes the great fact that within 100 miles of the entire length of Lake Winnipeg, on the west side, there are salt springs sufficient to produce as much of that important material, at a very small cost, as will be required for generations to come. Iron ores of the best description for common purposes are distributed over vast areas adjacent to workable beds of lignite coal. Some of the beds of coal are 12 feet in thickness, and have been recognized in the western part of the basin of Lake Winnipeg over several degrees of latitude and longitude.\n\nIt is important to bear in mind that with the lignite coal the vast deposits of clay iron-stone are associated. These extend much further east than the lignite layers, which have been removed by denudation, and form a very peculiar and important feature in the rocks west and south of the Assinniboine, after it makes its north-westerly bend.*\n\n* The vast deposits of iron ore belonging to the cretaceous series of the basin of Lake Winnipeg, acquire especial importance in consequence of their being associated with equally widely distributed deposits of lignite, and are found not very\nA large part of the region drained by the north and south branches of the Saskatchewan is underlaid by a variety of coal or lignite. On the North Saskatchewan coal occurs below Edmonton in workable seams.\n\nA section of the river bank in that neighbourhood shows in a vertical space of 60 feet three seams of lignite; the first, 1 foot thick, the second, 2 feet, and the third, 6 feet thick. Dr. Hector, who made the section, states that the 6-foot seam is pure and compact.* Fifteen miles below the Brazeau river, a large tributary to the North Saskatchewan from the west, the lignite bearing strata again come into view, and from this point they were traced to the foot of the Rocky Mountains. On the Red Deer River the lignite formation was observed at various points. It forms beds of great thickness; one group of seams measured 20 feet, \"of which 12 feet consisted of 'pure compact coal.'\"—(Dr. Hector.) These coal beds were traced for ten miles on Red Deer River. A great lignite formation of cretaceous age, containing valuable beds of coal, has a very extensive development on the upper waters of the North and South Saskatchewan, the Missouri, and far to the north in the valley of the Mackenzie. Colonel Lefroy observed this lignite on Peace River, and Dr. Hector recognized it on Smoking River, a tributary of Peace River, also on the Athabaska, McLeod River and Pembina River, all to the north of the Saskatchewan, \"thus proving the range of this formation over a slope rising from 500 to 2,300 feet above the sea, \"and yet preserving on the whole the same characters, and showing \"no evidence of recent local disturbance beyond the gentle uplift \"which has effected this inclination.\"†\n\nV.—The Winnipeg Gold Field and the Saskatchewan Gold Field.\n\nI now approach a subject of especial interest, and I may be pardoned if I dwell upon it with some degree of minuteness, and an appearance of individual interest in the distribution and probable extent of the gold-bearing rocks of the Winnipeg basin. In 1857, on my return from the Red River Settlements, I brought with me a small nugget and some particles of gold, which were given to me by a half-breed, who stated that they had been found in the bed of Sturgeon creek, a small tributary of the Assinniboine.\n\nI submitted these specimens of gold to the proper authorities in Canada, stating, however, at the time that I had no geological grounds for the belief that they were found, as alleged, in the vicinity of Fort Garry.\n\nremote from apparently inexhaustible stores of bitumen and petroleum (on Clear Water River), which as a fuel adapted to raising elevated temperatures in a regenerating furnace has no equal.\n\n* \"Proceedings of the Geological Society, 1861,\" p. 421.\n† Ibid., p. 420.\nOn my return to Red River, in 1858, in charge of the Assinniboine and Saskatchewan expedition, I had the possible existence of gold-bearing rocks near Lake Winnipeg in view, and on the 28th September of the same year quartz veins penetrating palaeozoic rocks (Silurian) were discovered by me, forming islands in St. Martin's lake, some thirty miles west of Lake Winnipeg. Struck with their importance, I made a short but ineffectual search for gold, the season being too far advanced to admit of a prolonged investigation. I named these islands St. Martin's Rocks, and gave a tolerably minute description of them in my report, which was first published in Canada in 1859, again in London in 1860, in the form of a Blue Book, and also embodied in my narrative of the Canadian expedition, published by Longman, in the same year.\n\nIn 1862 several members of the Canadian emigrant party, which left Fort Garry in June, 150 strong, traversed the valley of the Saskatchewan, crossed the Rocky Mountains by the Leather Pass, descended the Frazer, and reached New Westminster in the autumn of the same year, discovered gold in fine particles on the Assinniboine, the Qu'appelle river, near the Touchwood hills, on numerous tributaries of the North Saskatchewan, and in the flats of the great river itself.\n\nHaving received information respecting these discoveries, on which I thought reliance could be placed, I drew up a paper with illustrative maps, in June last, and submitted it to a member of the Canadian Government, explaining to him verbally my views respecting the origin of the gold on the Assinniboine river.\n\nIn July last I was informed by a gentleman holding a high and responsible office in the Hudson Bay Company, and who had just arrived from Fort Garry, that gold in scales had been discovered near Fort Ellice, a few miles from the spot where it had been found in fine particles by the Canadian emigrants. This additional evidence from an unimpeachable authority led me to append a note to the paper previously prepared, to the effect that I considered the discovery of gold in scales, near Fort Ellice, afforded complete scientific proof that there existed an eastern or Winnipeg gold-bearing area, wholly distinct from the Rocky Mountain gold fields; that the St. Martin's Rocks formed part of this area, and that it extended in a north-westerly direction towards Lake Athabaska, in the form of a narrow belt of intrusive gold-bearing quartz veins penetrating Silurian and probably also Devonian rocks, and resembling, in some important particulars, the auriferous region in Victoria, as described by the Government geologist of that colony. It is proper to state that the gold hitherto found over wide areas in the basin of Lake Winnipeg has been obtained solely from the drift, but the drift covering the valley of the Saskatchewan, west of Lake Winnipeg, even as far as\n100 miles from the Rocky Mountains,* has travelled in a south-westerly direction, and was derived originally from the eastern side of the Lake Winnipeg basin.\n\nSome of the gold found at Edmonton, also in many of the tributaries of the North Saskatchewan, has a Rocky Mountain origin; and auriferous alluvium on the banks of the rivers coming from that range penetrates and overlaps the auriferous drift derived from the Winnipeg gold field. Already numbers of young men have left the Red River Settlements and established themselves near Edmonton, where I have been informed, from a reliable private source, they were obtaining, in July last, $15 a-day in fine gold, by simply washing the alluvial mud of the River Saskatchewan.\n\nThe existence of a Winnipeg gold field acquires particular importance at the present time for several reasons, prominent among which is the certainty of American progress, westward of the 100th degree of longitude, being arrested by conditions of soil and climate, and its diversion northwards, towards and into the basin of Lake Winnipeg.\n\nVI.—Communication with Central British America.\n\nThe questions which relate to the facilities for communication between the Lake Winnipeg basin and this country, through British or American territory, and the extension of that communication across the Continent to the Pacific, may now be discussed.\n\nIt has already been stated that, with the single exception of 200 miles of road traversed by well appointed stage coaches, the communication from Liverpool to Fort Garry, or indeed the grand falls of the Saskatchewan, can be made by steam.\n\nThe successive steps in this route are as follows:\n\n| Step | Route                                      | Days |\n|------|--------------------------------------------|------|\n| 1    | Liverpool to Quebec, steamer                | 10   |\n| 2    | Quebec to La Crosse, railway                | 3    |\n| 3    | La Crosse to St. Paul, steamer              | 1½   |\n| 4    | St. Paul to Fort Abercrombie, stages        | 3½   |\n| 5    | Fort Abercrombie to Fort Garry, steamer     | 4    |\n\nThe following route is also practicable:\n\n1. Liverpool to Superior City by steamer.\n2. Superior City to Fort Abercrombie, road.\n3. Fort Abercrombie to Fort Garry, steamer.\n\nThe present difficulty of this route is the nature of the road between Superior City and Crow Wing, which, being cut through a\n\n* Dr. Hector.\nwooded country, is still, in the language of the country, rather \"rough\" as yet.\n\nThe next link in a route across the Continent is from Fort Garry to the New Westminster, in British Columbia. And in order to illustrate the singular and wholly unexpected topographical facilities which exist in the basin of Lake Winnipeg, the Rocky Mountains, and British Columbia for commercial intercourse, I shall venture to describe, in as brief a manner as possible, the journey of the Canadian emigrants of 1862 through that vast extent of country. My brother, Mr William Hind, who accompanied me on an exploration into the interior of the Labrador Peninsula in 1861, went with this party for the express purpose of sketching the passes through the Rocky Mountains and all natural features of interest on the line of route.\n\nVII.—The Canadian Emigrant Route across the Continent.\n\nThe Canadian emigrant party assembled at Fort Garry in June, 1862, travelling thither by Detroit, La Crosse, St. Paul, and Fort Abercrombie, by rail, stage, and steamer. At Fort Garry they separated into two parties; the first division contained about one hundred emigrants, the second division, sixty-five persons in all. The first party took the northern route, by Carlton to Edmonton, the second, the southern trail. At Edmonton they all changed their carts for horses and oxen, and went thence in a straight line to the Leather Pass (lat. 54°), through which they took 130 oxen and about 70 horses. They suddenly found themselves on the head waters of the Frazer river, and so gentle was the ascent that the only means they had of knowing they had passed the dividing ridge of the Rocky Mountains was by unexpectedly observing the waters of the rivers flowing to the westward. When in the mountains, they killed a few oxen for provisions; others were sold to the Indians at Tête Jaune Câche, on the Frazer, and others were rafted down the Frazer to the forks of the Quesnelle.\n\nAt Tête Jaune Câche a portion of the party separated from the rest, and, with fourteen horses, went across the country, by an old well-worn trail, to Thompson's River, and thus succeeded in taking their horses from Fort Garry, through the Rocky Mountains, through a supposed impassible part of British Columbia, to the wintering station on Thompson's River for the pack animals of the British Columbia gold seekers. With this party of more than 150 people were a woman and three little children. The little children were well cared for, for the emigrants took a cow with them, and these infant travellers were supplied with milk all the way on their long journey to the Leather Pass in the Rocky Mountains. I look upon the successful journey of the Canadian emigrants of 1862, across the\nContinent, as an event in the history of Central British America of unexampled importance. It cannot fail to open the eyes of all thinking men to the singular natural features of the country which formed the scene of this remarkable journey. Probably there is no other continuous stretch of country in the world, exceeding 1,600 miles in length, and wholly in a state of nature, which it would be possible for 150 people, including a woman and three children, to traverse during a single short season, and successfully, and, indeed, easily overcome such apparently formidable obstacles as the Rocky Mountains have been supposed to present.\n\nThe Leather or Miette Pass lies in latitude 54°, and has long been known to the employés of the Hudson's Bay Company, and is called by them the \"Old Columbia Trail\" or \"Jasper Pass.\" It will be observed that it forms an immediate and direct connection with the great artery of British Columbia, namely, the Frazer river. The other passes to the south connect with the Columbia river, which flows for many hundred miles through Washington territory. It will not fail to be noticed, too, that the existence of this route, via the Leather Pass, has only very recently appeared on published maps. It is shown on Arrowsmith's map of British Columbia, published in 1860, but the success with which its long established connection with the Frazer was concealed by the late Hudson's Bay Company is a singular instance of the unity of purpose which has pervaded all the actions of that powerful corporation, during their long tenure of absolute control over a portion of British America, containing more land suitable for the abode of man than the province of Canada itself, and which has already cost in its defence from aggression many millions of money and many thousands of lives. It seems remarkable that the Leather Pass, and its easy connection with the Frazer river, escaped the attention of the exploring party sent by the British Government, under Captain Palliser, in 1857, 1858, and 1859. If the existence of this unobstructed communication between the Athabaska valley and British Columbia had been made known to the world as one of the results of that expedition, probably long ere this the British Government would have taken measures to establish a separate Government in Central British America, and open a communication across the Continent through British territory. Dr. Hector actually passed the \"Old Columbia Trail,\" but neither his guides nor the people at St. Ann's or Edmonton appear to have informed him of its existence. Fortunately the Leather Pass has now been traversed by men, a woman, children, and numerous oxen and horses. The Frazer river has been safely descended for 400 miles from its source, in canoes and on rafts, by a very numerous party, and it has been ascended in a boat from Cariboo to the Tête Jaune Câche; and from this last-\nnamed place there is a well-known trail for horses to the Thompson's River, and thence to New Westminster, which has also been traversed by Canadian emigrants with horses; and more recently, according to Victoria papers, by Lord Milton, with thirteen horses. The difficulties of the Rocky Mountains have, in great part, melted away, and the \"impossibilities\" of the overland route have vanished, just as the \"uninhabitable deserts and swamps\" of the Saskatchewan have given place to boundless fertile prairies, which will probably become—even in our generation—the seat of an enterprising and prosperous people.\n\nVIII.—Comparison between British and United States Routes across the Continent.\n\nNot only is the track of the Canadian emigrants suggestive as to the nature of the country they traversed so easily, but in comparison with the explored routes for a Pacific railway within the limits of the United States it assumes a new importance. The present President of the Southern States, when Mr. Secretary Davis, summed up the comparisons of the different routes in the United States, as regards the character of the country they traverse. The following is an abbreviation of the summary:\n\n| Route near the 47th and 49th parallels, from St. Paul to Vancouver | Miles |\n|---------------------------------------------------------------|-------|\n| Number of miles through arable land                           | 374   |\n| Number of miles through land generally uncultivable, arable soil being found in small areas | 1,490 |\n\nThe greatest number of miles of route through arable land on any one of the lines surveyed is 670 miles, in a distance of 2,290 miles. The least number of miles of route through generally uncultivable soil is 1,210, on a line of 1,618 miles in length, near the 32nd parallel.\n\nFrom the Lake of the Woods, or from Pembina, a line in British territory instead of passing through a desert incapable of supporting human life, would traverse a fertile belt of country, averaging 100 miles in breadth, fully able to sustain five times as many people as Canada now possesses, and leading directly towards the lowest and by far the most facile pass in the Rocky Mountains.\n\nThe arid region of the Missouri valley commences west of the 100th degree of longitude, but the 100th degree of longitude divides the United States into two nearly equal parts on the 40th parallel of latitude. The eastern half is the present fertile and peopled part of the country. The western half is a comparative desert all the way to the Pacific.* It is in comparison with this immense desert that the\n\n* The cause of the aridity and unfitness for settlement of fully one-third of the United States has been ably discussed by distinguished meteorologists. This\nfertile belt at the edge of the woods, stretching in the Saskatchewan valley from the Lake of the Woods to the Rocky Mountains, stands out in such surprising contrast. The cause of this exceptional character is, in great part, due to the drift deposits which cover the fertile belt. There is, therefore, a geological as well as a climatological reason. Sixty thousand square miles of arable land in Central British America mark out the true pathway across the continent, which alone is capable of sustaining an efficient means of communication, whether in the form of a stage road or ultimately of a railway, by the growth of a local population. But the favourable comparison does not rest here. The mountain region, remarkable feature, extending over a portion of the American continent within the limits of the United States of more than 1,000,000 square miles in area, is highly important in relation to the valley of the south branch of the Saskatchewan, to a large part of which the same peculiarity belongs. The physical geography of the arid region in the United States has been very admirably described by Dr. Joseph Henry.*\n\n\"The general character of the soil between the Mississippi river and the Atlantic is that of great fertility, and as a whole, in its natural condition, with some exceptions at the west, is well supplied with timber. The portion also on the western side of the Mississippi, as far as the 98th meridian, including the States of Texas, Louisiana, Arkansas, Missouri, Iowa, and Minnesota, and portions of the territory of Kansas and Nebraska, are fertile, though abounding in prairies and subject occasionally to droughts. But the whole space to the west, between the 98th meridian and the Rocky Mountains, denominated the Great American plains, is a barren waste, over which the eye may roam to the extent of the visible horizon with scarcely an object to break the monotony.\n\n\"From the Rocky Mountains to the Pacific, with the exception of the rich but narrow belt along the ocean, the country may also be considered, in comparison with other portions of the United States, a wilderness unfit for the uses of the husbandman; although in some of the mountain valleys, as at Salt lake, by means of irrigation, a precarious supply of food may be obtained sufficient to sustain a considerable population, provided they can be induced to submit to privations from which American citizens generally would shrink. The portions of the mountain system further south are equally inhospitable, though they have been represented to be of a different character. In traversing this region, whole days are frequently passed without meeting a rivulet or spring of water to slake the thirst of the weary traveller.\n\n\"We have stated that the entire region west of the 98th degree of west longitude, with the exception of a small portion of Western Texas and the narrow border along the Pacific, is a country of comparatively little value to the agriculturist; and, perhaps, it will astonish the reader if we direct his attention to the fact that this line, which passes southward from Lake Winnipeg to the Gulf of Mexico, will divide the whole surface of the United States into two nearly equal parts. This statement, when fully appreciated, will serve to dissipate some of the dreams which have been considered as realities as to the destiny of the western part of the North American continent. Truth, however, transcends even the laudable feelings of pride of country; and in order properly to direct the policy of this great confederacy, it is necessary to be well acquainted with the theatre on which its future history is to be enacted, and by whose character it will mainly be shaped.\"\n\n* \"Meteorology in its Connection with Agriculture,\" by Professor Joseph Henry, Secretary of the Smithsonian Institution.\nwhich offers such a difficult barrier to communication between the Pacific and the valley of the Mississippi, possesses peculiarities in British America which are in themselves of a very striking character, and quite sufficient to establish the line of route, cutting diagonally the 50th, 51st, 52nd and 53rd parallels, as far superior in point of physical conformation to any other lines of route which have been explored in British America or the United States.*\n\nThe candid opinion of Professor Joseph Henry regarding the adaptation of a large portion of the United States for settlement is confirmed and strengthened by the following excellent summary, from the pen of Major Emory of the United States and Mexican Boundary Commission. It will at once occur to the reader that a knowledge of these facts gives great additional value to the truly fertile valleys of Red River, the Assinniboine, part of the Qu'appelle, and portions of the south and north branches of the Saskatchewan. It determines also the direction in which efforts should be made to people this great wilderness, and guide the progress of settlement in such a manner as will render the country available for that grand desideratum, a route across the continent:\n\n\"In the fanciful and exaggerated description given by many of the character of the western half of the continent, some have no doubt been influenced by a\n\n* Table of comparison between the different passes in the Rocky Mountains, in the United States and in British territory, north of latitude 38°:\n\n| United States— | Altitude of Pass. |\n|----------------|------------------|\n| Surveyed route between the 38th and 39th parallels of latitude | 10,022 feet |\n| Route between the 41st and 42nd parallels | 8,373 |\n| \" 47th and 49th \" | 6,044 |\n\n| British territory— |\n|-------------------|\n| Kananaski Pass, from the South Saskatchewan to the Kootanie river | 5,985 |\n| Kicking Horse Pass, from South Saskatchewan to the Columbia River | 5,420 |\n| Vermillion Pass, from the South Saskatchewan to the Kootanie River | 4,944 |\n| \" Old Columbia Trail,\" or Leather Pass, from the Athabaska to the Frazer—the Canadian emigrant route—probably below | 4,500 |\n\nThe breadth of country forming a continuous mountain region is far greater in the United States than in British America. The United States is crossed by three great systems of mountains, extending generally from north to south. The first system, beginning with the Sierra Madre, and terminating in the Black Hills of Nebraska territory, is partially gorged by the Rio Grande, completely cut through by the North Platte and the Sweet Water Rivers, and turned by the Missouri. It does not extend into British America. The total breadth of mountainous country, in the proper acceptation of the term, within the limits of the United States, varies from 500 to 900 miles. In British Columbia, the distance is not more than 380 miles from the Leather Portage to the Pacific; and the distance, in an air line from the Leather Portage to the extremity of Belhoula inlet, the possible terminus, of a route, does not exceed 400 miles.\ndesire to favour particular routes of travel for the emigrants to follow; others by a desire to commend themselves to the political favour of those interested in the settlement and sale of the lands; but much the greater portion by estimating the soil alone, which is generally good, without giving due weight to the infrequency of rains, or the absence of the necessary humidity in the atmosphere, to produce a profitable vegetation. But be the motive what it may, the influence has been equally unfortunate by directing legislation and the military occupation of the country, as if it were susceptible of continuous settlement from the peaks of the Alleghannies to the shores of the Pacific.\n\n\"Hypothetical geography has proceeded far enough in the United States. In no country has it been carried to such an extent, or been attended with more disastrous consequences. This pernicious system was commenced under the eminent auspices of Baron Humboldt, who, from a few excursions into Mexico, attempted to figure the whole North American continent. It has been followed by individuals to carry out objects of their own. In this way it has come to pass that, with no other evidence than that furnished by a party of persons travelling on mule back, at the top of their speed, across the continent, the opinion of the country has been held in suspense upon the subject of the proper route for a railway, and even a preference created in the public mind in favour of a route which actual survey has demonstrated to be the most impracticable of all the routes between the 49th and 32nd parallels of latitude. On the same kind of unsubstantial information, maps of the whole continent have been produced and engraved in the highest style of art, and sent forth to receive the patronage of Congress, and the applause of geographical societies at home and abroad, while the substantial contributors to accurate geography have seen their works pilfered and distorted, and themselves overlooked and forgotten.\"\n\n\"The plains or basins which I have described as occurring in the mountain system, are not the great plains of North America which are referred to so often in the newspaper literature of the day, in the expressions, 'News from the Plains,' 'Indian Depredations on the Plains,' &c.\n\n\"The term 'plains,' is applied to the extensive inclined surface reaching from the base of the Rocky Mountains to the shores of the Gulf of Mexico and the valley of the Mississippi, and form a feature in the geography of the western country as notable as any other. Except on the borders of the streams which traverse the plains in their course to the Valley of the Mississippi, scarcely anything exists deserving the name of vegetation. The soil is composed of disintegrated rocks, covered by a loam an inch or two in thickness, which is composed of the exuviae of animals and decayed vegetable matter.\n\n\"The growth on them is principally a short but nutritious grass, called buffalo grass (*Systelaria dyctaloides*). A narrow strip of alluvial soil, supporting a coarse grass and a few cotton-wood trees, marks the line of the watercourses, which are themselves sufficiently few and far between.\n\n\"Whatever may be said to the contrary, these plains west of the 100th meridian are wholly unsusceptible of sustaining an agricultural population, until you reach sufficiently far south to encounter the rains from the tropics.\n\n\"The precise limits of these rains I am not prepared to give, but think the Red River (of Louisiana) is, perhaps, as far north as they extend. South of that river the plains are covered with grass of larger and more vigorous growth. That which is most widely spread over the face of the country is the grama or mezquite grass, of which there are many varieties. This is incomparably the most nutritious grass known.\"*\n\n---\n\n* \"Report on the United States and Mexican Boundary Survey, made under the direction of the Secretary of the Interior,\" by William H. Emory, Major First Cavalry and United States' Commissioner. Washington, 1846, pp. 43—47.\nIX.—Communication between Canada and Central British America.\n\nIn Canada we are separated from the fertile part of Central British America by six degrees of longitude, which must be traversed before we can reach the edge of the fertile belt. This barrier has frequently been upheld as an insuperable objection to a practicable commercial communication between Canada and Central British America, in the absence of correct knowledge of the physical features of the country. The utmost length of the barrier which requires the construction of a road scarcely exceeds 200 miles. From its western extremity there is an unobstructed navigation, with but one break, to the edge of the fertile prairies of Central British America via Rainy River and the Lake of the Woods; and its eastern extremity is connected uninterruptedly with the sea by the great lakes and the St. Lawrence. The highest point over which the road from Lake Superior to the northern indent of Rainy Lake must pass is not 900 feet above Lake Superior; and for the first 30 miles it would traverse a country susceptible of tillage for several miles on either side, and part of it already occupied by settlers. Then follows a sudden rise, marked by the great drift bank of Dog Lake, which forms the eastern limit of a drift-covered country stretching in a north-east and south-west direction, and having a breadth of about 90 miles where the road would cross it. This accumulation of drift covers the height of land to a depth certainly exceeding 150 feet, as shown by the hills at the summit level at Prairie Portage, 885 feet above Lake Superior, and the highest point on the line of road. There are no serious physical impediments to overcome between Lake Superior and the northern indent of Rainy Lake, either for a waggon road or a railway; and this short link of 200 miles completed, the distance between Fort William on Lake Superior and the commencement of the arable prairies of the valley of Red River would be reduced to 200 miles of road or railroad, and 180 miles of steam navigation. Here, then, we see no formidable impediments, which an impression derived from the custom of traversing the country in canoes through the rocky channels of rapid rivers or hill-embosomed lakes had created in the minds of the few who have traversed that region;—impressions which have been too readily accepted by the public at a time when no particular commercial interests were at stake, except those of the fur trade, and when a policy diametrically opposed to that now entertained by the existing Hudson's Bay Company was pursued with singular success by their predecessors.\n\nX.—Communication via Hudson's Bay.\n\nIn contemplating the future of Central British America one important feature appears to be neglected, if not entirely overlooked.\nWhile Lake Winnipeg is 2,500 miles from the sea board of the Gulf of St. Lawrence, and lies exactly in the centre of the American continent under the 51st parallel, its northern extremity is only 380 miles from the tide waters of Hudson’s Bay.\n\nThe mouth of the Saskatchewan is as near to the open sea as Fort Garry is to the western extremity of Lake Superior. The passage from Norway House, at the northern extremity of Lake Winnipeg, to Hudson’s Bay is made in nine days with loaded boats. It is not unreasonable to suppose that by the introduction of tramways over the portages the journey may be made in four days, thus bringing Lake Winnipeg within four days of the sea, yet the nature of the communication now followed is such that it would not admit of vessels much larger than freighters’ boats being employed. The navigation of Hudson’s Bay for sailing vessels is safe for a period not exceeding six weeks—for steamers it may be double that time. Hitherto the mode of communication adopted by the fur traders between Norway House and Hudson’s Bay has been sufficient for the exigencies of the fur trade; it is not at all improbable that more easy means of communication with the sea board exists than those which are now pursued. Under any circumstances it is a fact of the highest importance that Lake Winnipeg is actually within a week’s journey of the ocean, over a natural road by which troops have already entered and departed from Central British America. It is more than probable that whenever the necessity arises, the communication between Lake Winnipeg and Hudson’s Bay, and thence to the Atlantic, by the aid of steamers, will be made easy and speedy for at least three months in the year.\n\nThe outlet by which the waters of the Saskatchewan and Lake Winnipeg reach the sea is Nelson River. The chief reason which induces the Hudson’s Bay Company to send their cargoes of furs to York Factory by Hayes River is stated to be the difficulties and dangers of the tracking ground on the banks of Nelson River, arising from impending masses of ice on the precipitous banks. The head of tide-water in Nelson River may yet become the seat of the Archangel of Central British America, and the great and ancient Russian northern port—at one time the sole outlet of that vast empire—find its parallel in Hudson’s Bay.\n\nXI.—No other Area suitable for Extensive Settlement in British America besides the Lake Winnipeg and Saskatchewan Districts.\n\nLet it be observed that one great fact can be no longer overlooked, viz., that there is no other unoccupied part of North America, “whatever may be said to the contrary,” other than the Lake Winnipeg and the Saskatchewan districts, where the establishment and growth of a new nation is possible. The same aridity\nwhich renders the United States a desert west of the 100th degree of longitude converts many of their great rivers, so prominently marked on the maps, into detached ponds during the summer season,* while the Saskatchewan, which flows from west to east across the basin of Lake Winnipeg, is navigable far above Carlton during six weeks in the year for steamers of shallow draught; in spring and autumn it is not navigable further than Carlton. It is important to bear in mind that the Saskatchewan attains its maximum in July, and before and after that month its waters are considerably lower than during its \"summer rise.\" This fact will account for the difficulties in navigating the Saskatchewan, which have been described by travellers as occurring in the spring or autumn, before the melting snows of the mountains reach Edmonton, or after they have passed it on their way to the sea.\n\nXII.—The Progress of Minnesota, Dakotah, and Nebraska.\n\nThe State of Minnesota and the territories of Dakotah and Nebraska border on the districts of Lake Winnipeg and the Saskatchewan. Minnesota was organized as a territory in 1849, admitted into the Union as a State in 1857, and, with an area of 83,531 square miles, it has now a population exceeding 200,000 souls.† The census valuation of the real and personal property in the State in 1860 was $52,294,413. The State income for eleven months in 1861 was $106,462, and the expenditure for the same period was $110,732.\n\nIn 1863 the projected railroads in this frontier State extended over 1,167 miles, and the sum already expended on them at that date (1st January, 1863), was $3,200,000.§ The quantity of wheat produced in 1860 was 5,101,432 bushels, nearly 3,000,000 bushels of oats, and 3,143,577 bushels of Indian corn.\n\nThe contribution of Minnesota to the volunteer army has already reached the following large numbers:—\n\n| Description                          | Number of Men |\n|--------------------------------------|---------------|\n| 10 regiments of infantry             | 9,065         |\n| 1 regiment and 3 companies of cavalry| 1,485         |\n| 2 batteries of artillery             | 212           |\n| 2 companies of sharpshooters         | 195           |\n| **Total**                            | **10,957**    |\n\n* See papers by Dr. Joseph Henry, Secretary of Smithsonian Institution, and by Major Emory, of the Mexican Boundary Survey, on this subject. These papers are published in the \"Transactions of the Smithsonian Institute,\" and in the \"Report of the Mexican Boundary Survey.\" See also Reports of the Pacific Railway, and Lieutenant Warren's exploration in Nebraska and Dakotah.\n\n† 173,855 by the census of 1860.\n\n§ \"American Railroad Journal.\"\nThese men have all engaged for three years, or for the war. The total number of forces Minnesota has sent into the field since the commencement of the war amounts to 11,887 men. Such are the resources of the new State of Minnesota, bordering on the Lake Winnipeg district. Twelve years since it was for the most part an uninhabited wilderness; now it has sent an army of nearly 12,000 men into the field.\n\nDakotah territory, which lies west of Minnesota and whose northern boundary is conterminous with part of the districts in British America referred to in this paper, was organized in 1861. Its area is 325,000 square miles. Much of it lies within the limits of the American desert, and will never be peopled with white men. It contains a population of 44,501, of which 39,664 are Indians.\n\nNebraska territory lies west of Dakotah; in 1860 its population was 28,841, besides 5,072 Indians. The aridity of this territory will forever prevent it from assuming any great commercial or political importance.\n\nXIII.—Indian Population in Central British America.\n\nGreat misapprehension exists as to the numbers of the Indian population of Rupert's Land. They do not exceed 40,000 in all. The number inhabiting the prairies and plains of the Lake Winnipeg and Saskatchewan districts do not exceed 20,000 at the present time. Under proper management the Indian would become the most useful and tractable protectors of a telegraph line. Once impressed with the idea that it is something supernatural, they would cherish it, protect it, and reverence it as a \"manitou,\" or superior spirit, exercising a control over their fortunes and even lives.\n\nXIV.—General View of British America.\n\nThe total population of British America at the present moment approaches four millions, and the quantity of land available for agricultural purposes is approximately 267,000 square miles—or more than twice the area of the United Kingdom of Great Britain and Ireland; and equal to France (including Corsica), Belgium, Holland, and Portugal combined.\n| Area in Square Miles | Estimated Population, January, 1864 |\n|----------------------|-----------------------------------|\n| New Brunswick        | 27,620                            | 295,000                          |\n| Nova Scotia and the Island of Cape Breton | 18,600                            | 352,000                          |\n| Newfoundland         | 36,000                            | 140,000                          |\n| Prince Edward Island | 2,133                             | 95,000                           |\n| **Total area**       | 84,353                            | 882,000                          |\n| Estimated area available for agricultural purposes | 52,000                            | —                                |\n| Upper Canada         | 140,000                           | 1,520,000                        |\n| Lower „              | 200,000                           | 1,200,000                        |\n| Estimated area available for agricultural settlement | 90,000                            | —                                |\n| Basin of Lake Winnipeg and Valley of the River Athabasca | 400,000                           | 15,000                           |\n| [Exclusive of Indian population, 40,000] | —                                | —                                |\n| Estimated area available for agricultural settlement | 95,000                            | —                                |\n| British Columbia and Vancouver's Island [Exclusive of Indian population, 60,000] | 210,000                           | 50,000                           |\n| Assumed area suitable for agricultural purposes | 30,000                            | —                                |\n| **Total area**       | 1,034,353                         | 3,667,800                        |\n| Estimated area available for agricultural purposes | 267,000                           | —                                |\n\nOr about nine times the area of Great Britain and Ireland. But throwing out what may be called the inferior and desert portion of this immense territory, we find the area of the agricultural portion to be approximately 267,000 square miles, or as large as France, Holland, and Denmark put together, with an aggregate population approaching four millions.\n\nSix years only have elapsed since public attention in England and America was first directed to the Lake Winnipeg and Saskatchewan districts. During that period not only has satisfactory evidence been obtained of the existence of mineral wealth, in the form of coal, iron ores, salt, and gold, but there are good scientific grounds for the belief that the original matrix of the auriferous drift will be found to extend far north of the Saskatchewan district, towards and perhaps beyond Lake Athabaska. The Hudson’s Bay Company, in the recent report of the committee, state that “they are prepared to meet the wishes of Her Majesty’s Government and the spirit of the times, by assisting in the settlement of any portion of the territory which may be fit for it, or by facilitating the transmission\n\"of intelligence by post or telegraph, and aiding general communication where it may be practicable to do so.\"\n\nWho can foresee the importance, or estimate the value of telegraphic communication with our Pacific posts, now that the British Pacific fleet finds a suitable station in our own territory? Now that British Columbia has assumed the position of a gold-exporting colony, and that numerous parties of gold-seekers from the Pacific Slope have already passed to the east side of the Rocky Mountains, and invaded the Saskatchewan valley, like the Indian of American pre-historic times, coming from the west.\n\nFrom private inquiries which have been made to me recently, I am impressed with the conviction that many of the most prominent citizens in Minnesota are fully alive to the vast importance of the Winnipeg and Saskatchewan districts, and they will spare neither energy or money to continue and increase their commercial intercourse with them. On the boundary line, their military post, Pembina, 65 miles from Fort Garry, is now occupied with United States troops, numbering 350 men. While these will insure the preservation of order among the Indian tribes which have so recently disturbed the frontier settlements in Minnesota, they will familiarize the Red River people, now numbering 10,000 souls, with all the advantages of commercial intercourse.\n\nI have refrained from making any allusion to the fur trade, which has so long been a source of wealth to the Hudson's Bay Company. The districts in which that lucrative trade can be carried on with increasing profit under judicious management, lie wholly beyond the area whose resources form the subject of this paper. With prompt and energetic action on the part of those who in a measure rule the destinies of this valuable portion of the empire, Central British America will rapidly acquire an important commercial and political status, independently of its being the high road for postal and telegraphic communication between the Atlantic and the Pacific, lying wholly within the jurisdiction and influence of British rule.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/2338592.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 37176, "total-output-tokens": 15623, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2523, 2], [2523, 5304, 3], [5304, 8029, 4], [8029, 10432, 5], [10432, 13158, 6], [13158, 15922, 7], [15922, 18625, 8], [18625, 22072, 9], [22072, 24864, 10], [24864, 27618, 11], [27618, 30503, 12], [30503, 32916, 13], [32916, 35656, 14], [35656, 38562, 15], [38562, 41319, 16], [41319, 45147, 17], [45147, 48260, 18], [48260, 52318, 19], [52318, 55123, 20], [55123, 57892, 21], [57892, 60605, 22], [60605, 62634, 23], [62634, 65736, 24], [65736, 67828, 25]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]