[{"id": "551deb0176fda00ee4845ba60877b91954939f3f", "text": "oil and blubber suit the Esquimaux constitution far better than coffee and tea, and that as long as they can get that congenial nourishment they are able to endure any amount of cold and hunger or hardship; but as soon as they endeavour to live as Europeans their constitutions begin to get enfeebled. They and their dogs are subject to severe epidemics. As illustrations of the progress of civilization among the Esquimaux, the Rev. gentleman produced copies of Testaments, Prayer-books, and hymns, printed in the Esquimaux language, and stated that the people were very fond of music, possessed good voices, and had excellent memories. They were also very good draughtsmen, in proof of which he had in his possession a chart of 100 miles of the coast, the work of a native; and they also wrote very well. He had with him a very curious book, mainly the production of a Greenlander, illustrated with woodcuts, containing an account of a tradition handed down from generation to generation, in reference to an invasion of Greenland by the Scandinavians six or seven centuries ago. It was known that the Scandinavians formed settlements, built churches and houses, and that after some centuries they disappeared. This book professed to give an account of this incursion of the Scandinavians, of the disputes and wars that took place in consequence, and of the final extermination of the invaders. In conclusion, he stated that Labrador produced a beautiful kind of spar, also hornblende, anthracite, granite, porphyry, jade, serpentine, and other minerals.\n\nThe President reminded the Meeting that before Mr. Hall went to examine the so-called Frobisher Strait, he was told by the Esquimaux that it was a bay. It was quite clear, therefore, that the natives were not bad geographers, and were acquainted with the coast-line of their country. He had now to call upon Dr. Rae, who was the first to bring to this country certain very important relics of the Franklin expedition, to read a Paper upon the countries of the Red River and the Saskatchewan.\n\nDr. Rae said he wished to make a remark upon the Paper of Mr. Hall. He fully concurred in all he had said as to the truthfulness of the Esquimaux. When he first brought home information he had gained from them, they were called liars and story-tellers. He knew better. He never in his life found an Esquimaux tell a falsehood unless it was to gain some particular object; and when they did tell a falsehood, it could easily be detected by a little cross-questioning. Where they had nothing to gain by suppressing the truth, you could fully rely upon their statements.\n\nThe second Paper read was—\n\n2. A Visit to Red River and the Saskatchewan. By Dr. John Rae, M.D., F.R.G.S.\n\nDr. Rae's Paper briefly described a hunting excursion to the prairies of the Saskatchewan River, undertaken by two young English gentlemen, whom he accompanied, and during which he established the latitudes of several points on the route, and rectified the positions of other places. He described two lakes of considerable size (both salt), situated among the elevations of the \"Coteau du Prairie,\" which had not previously been placed on the maps. He named them the \"Chaplin\" and \"Johnstone\" lakes. He explained what he believed would be the chief difficulties to be met with in colonising the Valley of the Saskatchewan, and in the formation of an\noverland route through it, from the Atlantic to the Pacific. He also gave an estimate of the probable time that would be occupied and the expenses incurred in travelling by this route, as compared with the voyage from England to Vancouver Island via Panama—viz., 43l. and 51 days against 33l. and 37 days, or 10l. and 4 days in favour of the Panama route.\n\nThe President congratulated the Society upon the fact that Dr. Rae, while accompanying two or three gentlemen on a buffalo shooting excursion, had fixed, by astronomical observations, the latitude and longitude of places which were before very imperfectly laid down on the maps. They were therefore much indebted to Dr. Rae for his communication.\n\nThe Meeting was then adjourned to April 27th.\n\nEleventh Meeting, Monday Evening, April 27th, 1863.\n\nSIR RODERICK I. MURCHISON, K.C.B., PRESIDENT, in the Chair.\n\nELECTIONS.—Lieut.-Colonel John Charles Downie Morrison; William Hatfield; Henry Perenil Le Mesurier; George Loch; Henry Salt; and Cromwell Fleetwood Varley, Esqrs., were elected Fellows.\n\nACCESIONS.—Among the donations to the Library and Map-Rooms since the former Meeting were—Holmes’s ‘Magneto-electric Light applicable to Lighthouses;’ Pugh’s ‘Queensland Almanack’ for 1862; Map of the Mekran Coast, from Kurrachi to the Persian Gulf; and continuations of Admiralty Charts and Ordnance Maps.\n\nEXHIBITION.—McLeod’s ‘Geological Map of England and Wales.’\n\nThe President said he had received a letter from Mr. Tinné, in reference to the explorations of the Dutch and English ladies, his relatives, up the White Nile, which he would read.\n\n“Being unable to attend your next Meeting, I have much pleasure in giving you, as requested, some further information regarding my lady relatives, of whose return from Gondókoro to Khartum on the 20th of November last you have already been apprised.\n\n“Their last letter is to the 5th of February, at which date they had started on a fresh expedition up the White Nile, but were stopped, about three hours’ sail from Khartum, by an accident which happened to one of their boats and threatened to swamp her. This was caused by the captain and the pilot, who, on being examined, were made to own that they had bored a hole in the bottom, being unwilling to go up the White Nile.\n\n“The damage having been repaired, and a new crew engaged, they were on the point of proceeding on their voyage again.\n\n“One of the ladies remained at Khartum, and Madame Tinné and her daughter were accompanied by Mr. D’Ablaing, a Dutch gentleman, who had come across from Abyssinia; by Mr. Heuglin, whose communications from Africa are known to the Royal Geographical Society; and by another German gentleman (whose name I am not yet acquainted with), a medical", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/1799310.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4704, "total-output-tokens": 1490, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3376, 2], [3376, 6119, 3]], "primary_language": ["en", "en", "en"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]