[{"id": "afd7031c726b8bde02e65bde7b99d7626e8af4cf", "text": "The Papers read were:—\n\n1. *Progress of the British North America Exploring Expedition, as far West as long. 109° on the Lower Saskatchewan River.* By Captain John Palliser, F.R.G.S.\n\nCommunicated by the Rt. Hon. H. Labouchere, M.P., F.R.G.S., H. M.'s Secretary for the Colonies.\n\nMontreal, Canada East, 8th Dec., 1857.\n\nSir,—In continuation of my Report of the 27th July, 1857,* I have the honour to inform you of the farther progress of the British North America Exploring Expedition.\n\nOn September the 28th I arrived at San Josef, an American town about 7 miles south of the British frontier line. The population consists of British as well as American half-breeds, whose chief dependence is on the proceeds of the buffalo hunt; and, while the more youthful part of the male population are away on the hunt, the then defenceless inhabitants are subject to the inroads of the Sioux Indians. These Indians last year attacked that settlement, stole almost all the horses, and shot a woman and the schoolmaster: indeed, hardly a year passes without some similar depredations. Although that bend of the Pembina River, on which San Josef is situated, is inside the United States' territory, yet the greater part of the river's course is through the British dominions. It is an important river, and may hereafter prove valuable, as affording facilities for navigation. I have, therefore, had its course correctly laid down in our charts.\n\nOn the 4th August we reached Turtle Mountain, a hill rising out of the prairie to about 300 feet; it is 30 miles long, 10 broad. This hill is one of a series that we have since traced scattered irregularly in a line from south-east to north-west. The boundary line passes through the summit of this mountain, throwing the \"Souris\" or Mouse River into the British possessions. This river has hitherto been wrongly laid down in all maps; and I have, therefore, also paid strict attention that its course should be carefully laid down in our charts.\n\nAugust 15th.—We reached Fort Ellice on Beaver Creek. Here I found the men I had sent direct from Fort Garry with the ten horses, and, as they had now rested more than a week, I took these ten horses on an expedition to \"La Roche Percée,\" leaving the horses, that had been hitherto travelling with myself, to recruit.\n\nProceeding on a south-west course from Fort Ellice, we arrived on the 18th of August at Moose Mountain, one of the chain of hills\n\n* See Proceedings, No. I., vol. ii.—Ed.\nabove mentioned. It, like the Turtle Mountain, is covered with dense woods, lakes, and swamps.\n\nOn the 20th August we arrived again on the Mouse or \"Souris\" River, and here Dr. Hector first discovered coal of a very fair quality. From this point of the Mouse River an hour's ride brought us to the \"Roche Percée.\" A singular appearance is here produced on the rocks and stones by the combined action of the atmosphere and water; the layers of sand and clay forming these, being unequal in hardness, are worn accordingly into grotesque shapes, affording more astonishment to the Indians and half-breeds visiting the spot than interest to the geologist on a more close examination.\n\nHere I was visited by a large number of Stone Indians, celebrated as the greatest horse-thieves in the country: however, I concealed all apprehension for my horses. I also discovered that meat was a very scarce article among them, as they had not fallen in with buffalo for many days. I had, however, been fortunate enough to kill two bulls that morning, and secured their good offices and the safety of my horses by giving them the meat, inviting them to cook and prepare their own feast, to which I added some tea, sugar, and flour, desiring them in return to guard my horses all night, which injunction they regarded as a compliment, and faithfully performed.\n\nThe following day we returned, and reached Fort Ellice on the 25th of August.\n\nOn examining the horses I had left behind at this post when I started for \"Roche Percée,\" I found them not sufficiently recruited to proceed westward to the Elbow: I therefore determined to wait a few days longer. I likewise found that my guide and interpreter was so frightened at the prospect of entering the Blackfoot country, that he gave me very false interpretation as to the facilities of the route I intended (according to my instructions) to adopt. I therefore started a messenger to Mr. Christie, the chief officer of the Hudson Bay Company, requesting the services of Mr. M'Kay (the officer in charge of Fort Ellice) as an interpreter to accompany me on the expedition. Mr. Christie, on receiving my letter, rode three days' journey to meet me at Fort Ellice, and brought with him a gentleman to put in Mr. M'Kay's place, thereby placing the valuable services of the latter at my disposal. In the mean time, on the 7th of September, finding my horses sufficiently rested to resume operations, I started the expedition under Dr. Hector for the \"Qui Appelle\" lakes, and remained behind at Fort Ellice until I should see or hear from Mr. Christie, whose subsequent arrival on September 9th, set Mr. M'Kay at liberty; and, after accounts were\nmade up and transferred, I started on horseback, accompanied by M'Kay and two of my men (who had remained behind for the purpose), and overtook the expedition in three days at the Qui Appelle lakes, about 135 miles west of Fort Ellice.\n\nOn Sunday, September 13th, we remained at the Qui Appelle lakes. Here the Hudson Bay Company have a small trading-post, the most western fort in the territory; and there we found a large camp of Crees arrived for trading. I sent for Mr. Pratt, the missionary, requesting him to come and pay us a visit. He is a pure Cree Indian, educated at Red River. He reports the Crees as beginning to apprehend scarcity of buffalo, and many are most anxious to try agriculture. He thinks that if they had agricultural implements, such as spades, hoes, and ploughs, they certainly would commence operations. This opinion I found pretty general among the people of the Hudson Bay Company; and I am persuaded much good could be done by importing the simpler kinds of agricultural implements. Pratt has set the Indians an excellent example himself, and grows capital Indian corn, barley, and potatoes. The Qui Appelle lakes may be considered the most western part of the territory east of the Rocky Mountains to which the Hudson Bay Company trade: westward of this I may say is unknown, and the whole country in this latitude is untravelled by the white man.\n\nAmong the Indians that had come to trade was a man Mr. M'Kay was acquainted with. This man was a remarkable exception to the generality of Indians: they call him the \"peace-maker,\" and twice within the last two or three years he pushed his way alone into the Blackfoot country, and walked into the enemy's camp unarmed, with the peace-pipe in his hand, exhorting them to peace, and offering them the alternative of killing him. The result on each occasion was a treaty of peace to the Crees and a present of horses to the peace-maker. I engaged this Indian to guide us to the Elbow.\n\nOn September the 14th we started from Qui Appelle lakes for the Elbow, on the south branch of the Saskatchewan, sometimes called the Bow River. On September 16th we again camped on Mouse or Souris River, at a tributary called by the Indians, Moose Jaw Creek, in longitude 106°. Up to this point in our journey we had suffered no inconvenience from want either of wood or water; here, however, our guide, the peace-maker, advised us to bring wood along in our carts, as we should see no more until we came to the Saskatchewan, which we first came in sight of at sunset on the 21st of September.\n\nWe were now in the heart of the buffalo country. This region\nmay be called a buffalo preserve, being the battle-ground between the Crees and Blackfeet, where none go to hunt for fear of meeting enemies, and where those who go to war abstain from hunting. The whole region, as far as the eye could reach, was covered with buffalo, in bands varying from hundreds to thousands. So vast were the herds, that I began to have serious apprehensions for my horses, as the grass was eaten to the earth, as if the plain had been devastated by locusts. However, the timber on the small tributaries of the river kept off the buffalo, and so a little grass was obtained for the horses, for the buffalo shuns the timber until midwinter.\n\nAt the Elbow I found a large tributary flowing from the east into the Saskatchewan, and I dispatched Dr. Hector with one or two men to trace the course of this river, which I find flows from the most western of the chain of Qui Appelle lakes, being navigable to large boats the whole way. Hence I have been able to ascertain that there exists a valuable water communication between the south Saskatchewan and Red River, and that a good-sized boat, and even a small steamer, might descend from the south Saskatchewan, ascend to the west Qui Appelle river, cross the Qui Appelle lakes, and then descend the Qui Appelle into Red River.\n\nAfter the Doctor's return from exploring the western Qui Appelle, we commenced our ascent from the Elbow, and reached the 109th meridian of longitude on the 28th of September. This magnificent river rivals the Missouri in size and volume, and even at this (the lowest state of water during the whole year) was navigable for craft of any size, as I found by sad experience, having been so unfortunate as to lose one of my waggons in the channel of the river at a depth of sixteen feet, where I subsequently crossed it. All particulars of this river—its timber, capabilities, &c.—will be found in my journal, which I hope to have the honour of forwarding to England next spring. The 109° meridian is the farthest point to the westward that I have this season explored. At this point I crossed the river to the north side, and started on a north-east course for Carlton, my winter quarters, where we arrived on the 8th of October.\n\n* * * * *\n\nI started from Carlton (Upper Saskatchewan) October 11th, reached Touchwood Hills October 15th, Fort Pelly October 18th, Fort Ellice October 23rd, and on the 1st of November arrived at Red River. This portion of my journey was very cold, accompanied with snow almost every day, yet not sufficient to delay me or cause me much inconvenience. At Red River I found very great\ndifficulty in obtaining horses and a guide to Crow Wing, Minnesota territory, but at length succeeded, for the sum of 65l., in obtaining the services of a half-breed named Robert Tate, and his horses, to take me there, a distance of about 520 miles. For this sum I was supplied with a horse to ride, besides the horses necessary to carry our baggage, bedding, and provisions. Unfortunately my horse was killed at Pembina, and I had to go on foot about 450 miles of the way: the snow, however, was so deep, and the weather so cold, that it did not much signify; and we arrived at Crow Wing on the 19th of November.\n\nFrom Crow Wing there is stage conveyance to St. Paul and Prairie Le Chien, partly by coach and principally by waggons and sleighs. At Prairie Le Chien is the railway terminus, from which I proceeded via Chicago and Detroit to Montreal.\n\n* * * * *\n\nWhile I was at Red River on my way to this, I made my arrangements for proceeding next spring with the expedition, by engaging twenty men, and ordering them to proceed on the 10th of March, 1858, with a sufficient number of dog-sleighs to convey their provisions up to Carlton House, in order that all may be in readiness for as early a start as the season will permit. My course will be, in the first instance, to visit Eagle Hills, and thence to strike for the south branch of the Saskatchewan, and renew my explorations at that point where I left off at the end of September. I regret that I am obliged to engage so many men, as their pay and small rations will increase the expense of the expedition; but with a smaller number it would be the height of imprudence to venture into the south-western part of the Blackfoot and Peagan country. A smaller number would only invite the Indians to attempts on the horses. It is true I have hitherto only travelled with thirteen men, but the Indian camps I have met (with one exception, at Roche Percée) were small ones; next year the camps I shall fall in with will be much larger, and to meet this I must increase the number of my men to thirty in all, viz., four men at Carlton, one man at Red River still under pay, five at Carlton to commence pay on April 1st, 1858, at 15l. for six months, and twenty from Red River to commence pay March 10th, 1858, at 20l. for six months. After this dangerous country shall have been traversed, much fewer men will suffice, by returning to the settlement on the Hudson Bay Company's beaten track, via Edmonton. But the country the expedition will have to traverse next year, in order to fulfil its objects, will be so dangerous, that it would be impossible to fulfil my orders\nof sending the expedition back in time to reach St. Paul in the fall of 1858.\n\n* * * * *\n\nThe President.—You will agree with me, Gentlemen, that Captain Palliser is admirably qualified for such a difficult enterprise as the one he is proceeding on. He is a capital buffalo hunter, thoroughly inured to everything that a man can suffer in North American travel, well practised in all the sports of the country, and a man of great strength and endurance. I am sure he will realise all those objects which the Royal Geographical Society had in recommending him to Her Majesty's Government. I am in hopes that next year this expedition will proceed towards the Rocky Mountains, and come into direct communication with the other expedition under Captain Hawkins, R.E., which the Government is about to send out to explore the boundaries between the United States and the British territories. We have among us on the present occasion gentlemen who are acquainted with this territory, and among them my old and distinguished friend Mr. Featherstonhaugh, who, with Colonel Mudge, was employed on that frontier in 1846.\n\nMr. Featherstonhaugh.—I did not know on entering the room that this Paper was to be discussed; but Sir Roderick having called upon me, I rise to observe that I have been at various times in different parts of the country laid down in the map, but have never penetrated west of Lake Winnipeg, in the direction of the Rocky Mountains, where Captain Palliser proposes to go next year. I have, however, crossed from the Mississippi to Red River, and thence to its junction with Lake Winnipeg. Lord Selkirk planted a colony of Scotchmen at Pembina: those I saw appeared to me to be industrious and meritorious men, fitted to contend with a rigorous climate, and who by ingenuity and economy could flourish in despite of it. They had ploughs and other agricultural implements, and had barns full to repletion with barley, but could get no market for it. The potatoes were excellent; I never ate better. Beef cattle they had not as yet, as they could supply themselves with buffalo meat. Hereafter they will have cattle; for where you can have barley and potatoes you can have domestic animals. Some of these men spoke to me of the coal they had found in the neighbourhood; and, as an old geologist, I should certainly have gone to the locality, but winter was at hand, and I was obliged to hasten out of the country.\n\nBefore I take my seat I will, if I am permitted, briefly allude to some considerations of a more general character. It is known that, under the dominion of Great Britain, in North America, there is a vast region, extending from the United States frontier north, and from the Atlantic to the Pacific. This immense territory, including the Canadas, Labrador, and the possessions belonging to and frequented by the Hudson Bay Company, is much larger than the United States. This expedition of Capt. Palliser, sanctioned by Her Majesty's Government, and so cordially encouraged by the Royal Geographical Society, leads naturally to the discussion of a question of great public interest, viz., whether this imperial domain is capable of sustaining an industrious population? For several degrees beyond the most northerly part of the frontier of the United States this question may be answered in the affirmative. In the valleys I remarked a great fertility of soil, proper to the cultivation of barley, oats, a peculiar kind of Indian corn that ripens in eight weeks, called Mandan corn, and potatoes. Nothing is more nourishing to cattle and sheep in the winter than the sweet fodder of Indian corn. Farther north the short summers are not favourable to cultivation; but wherever settlers are in possession, they will soon find their way to the deposits of copper and other valuable minerals; and such is the facility of water communication, that these will in time be brought to the settlements and exchanged for provisions.\nand other necessaries with the inhabitants to the south, living in milder latitudes. I look upon this exploring expedition of Capt. Palliser as highly meritorious; it will open up a territory of whose physical geography and intercommunication and juxtaposition of streams we are at present ignorant, but the knowledge of which will be hereafter highly useful.\n\nWith reference to the approaching extermination of the buffalo, the Indians are to blame. Ever since white traders went amongst them, they kill the buffaloes wherever they meet them—not for food, but to sell their skins. In prairies 160 miles in extent I have seen in every direction skeletons of buffaloes slain in this destructive manner.\n\nI desire to conclude these remarks with my conviction, derived from a long experience of the progress of mankind under nearly similar circumstances, that industrious colonists in those regions would in time establish a regular and profitable commerce favourable to the interests of Great Britain.\n\nColonel Lefroy, F.R.G.S.—I only rise for the purpose of adding my testimony to the valuable contribution to our knowledge of that region which has been given us by Mr. Palliser: one more substantial than we have had from any other source for a long period. I leave to geologists to estimate the value of the discovery of coal, which I have a vague recollection of having heard of when I was in the country. But what impressed me most was the discovery of a navigable water communication between the Saskatchewan and the Red River by means of the Qui Appelle waters. They seem to traverse a large extent of country, and if the discovery be substantiated, will greatly facilitate our means of communication with those western regions towards the Rocky Mountains; but it will hardly be safe to assume that the depth of water found by the travellers where they sounded is to be met with generally along them, the Saskatchewan itself being full of shallows. I differ from many as to the destination of that region with regard to the support of an increasing population. I am one of those who think it never can support a dense agricultural population, or one in any degree comparable with that of Canada. But there is a fact mentioned by Mr. Palliser which struck me: it is that he found Indian corn ripe at Fort Ellice. I believe Indian corn has not been found to ripen with any certainty on the Red River. It is a very interesting point to find within the limits of the British territory a region where it will do so. With regard to the abundance of buffaloes spoken of, it was mentioned to me as a positive fact by Mr. Heriot, that a brigade of boats was delayed three whole days in going up the river in consequence of the immense herds of buffalo crossing the stream. This was in 1841 or 1842. In all these respects Mr. Palliser's account agrees with our previous information, and he has added to it most materially. It must be gratifying to this Society to have been the means of sending out a traveller so observant and intelligent.\n\nThe President.—I may observe, with reference to this expedition, that Captain Palliser is accompanied by two or three men of science of considerable distinction. Dr. Hector is a good naturalist and geologist; Mr. Sullivan is a gentleman capable of making physical and astronomical observations; and our Associate Lieutenant Blakiston is making all the magnetical observations. So that we may hope for considerable additional results. The main feature of the present communication is the discovery of this remarkable water-shed, proceeding from the Qui Appelle lakes—the waters flowing both to the east and west. It was previously unknown to geographers, who must see the importance of this discovery, as regards the future destiny of that country, in the facility it may afford for the transport of merchandise to and from the interior.", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/1798858.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 12084, "total-output-tokens": 4803, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2472, 2], [2472, 5146, 3], [5146, 7767, 4], [7767, 10377, 5], [10377, 13003, 6], [13003, 16949, 7], [16949, 20822, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]