[{"id": "6dc4e5c6f58b489b9edbadc08c25eb01821e4d1e", "text": "AUX DAMES DE SAINT-BONIFACE ET DES PAROISSES ENVIRONNANTES !\n\nNous désirons attirer votre attention sur le fait que nous avons ajouté à nos autres départements celui des modes. Comme c'est notre première saison dans cette ligne, vous pouvez compter voir chez nous les dernières façons Françaises, Anglaises et Américaines.\n\nNous avons eu l'heureuse chance de nous assurer des services de Melle McMullen, (autrefois chez Alexander, de cette ville), comme première modiste. Melle McMullen est trop favorablement connue des Dames de Winnipeg pour qu'il nous soit nécessaire de la recommander.\n\nRespectueusement à vous,\n\nPRESTON & NORRIS.\n\nRemarquez l'adresse :--Maison d'un seul prix, vis-à-vis le bureau de poste, 452 rue Principale, Winnipeg.\n\nLE MAGASIN BLEU\n\n426 RUE PRINCIPALE, WINNIPEG.\n\nAU PUBLIC.\n\nUn fonds considérable de Banquise acheté à 50 cents dans la pâtre, et se vendant aussi à moitié prix.\n\nVoyez les prix suivants :\n\nDes Harengs de 10 livres 80 cents pour 3.50\nDes Harengs de 10 livres 70 cents pour 3.50\nDes Harengs de 10 livres 60 cents pour 3.50\nDes Harengs de 10 livres 50 cents pour 3.50\nDes Harengs de 10 livres 40 cents pour 3.50\nDes Harengs de 10 livres 30 cents pour 3.50\nDes Harengs de 10 livres 20 cents pour 3.50\nDes Harengs de 10 livres 10 cents pour 3.50\nDes Harengs de 10 livres 00 cents pour 3.50\n\nVenez et jugez par vous-même.\n\nL'assortiment de Paris est le plus beau et le meilleur marché qui soit à Winnipeg.\n\nN'oubliez pas l'endroit :\n\nLE MAGASIN BLEU, 426 rue Principale Winnipeg.\n\nJ. B. LAUZON,\n\nBoucher,\nCoin de l'Avenue Tache et de la Rue Dumoulin.\n\nEN GROS ET EN DETAIL.\n\nToujours en moins de viandes de première qualité.\n\nBEUF, VOLAILLE, MOUTON, LARD, SOUCISSES, VIANDE FUMÉE, VEAU, ETC., ETC., ETC.\n\nVACHES A LAIT ET BEUFS DE TRAVAIL\n\nA vendre en tout temps.\n\nNous achetons, Au Comptant, tous les produits de la campagne.\n\nJ. B. LAUZON.\n\nGRAINES, GRAINES.\n\nKEITH & CIE.,\n214 Rue Principale, fine porte au nord du Bureau de Poste, Winnipeg.\n\nGRANDS AVANTAGES OFFERTS AU PUBLIC A L'ENSEIGNE DES CISEAUX D'OR,\n\nChez MM. LANGEVIN & GAREAU.\n\nUN IMMENSE ASSORTIMENT DE HARDES-FAITES, CHEMISES, CRAVATES, CORPS, CALECONS, CHAPEAUX, ETC., VENANT D'ETRE REVU, DEVRA ETRE VENDU A TRES BAS PRIX VU LA BARETE DE L'ARGENT.\n\nDEPARTEMENT DE TWEEDS :\n\nDes ouvriers de première classe sont employés à la confection des habillements. — Une visite est respectueusement sollicitée.\n\nLANGEVIN & GAREAU, 324 Rue Principale 324.\n\nEn face de la Rue Notre-Dame. L'ENSEIGNE DES CISEAUX D'OR. BLOC HARGRAVE, WINNIPEG.\nLE MANITOBA.\n\nAVIS\n\nCONTRAT DE LA MALLE.\n\nNOUVEAUX COLONS.\n\nMARIAGE\n\nAffaires Municipales.\nLE MANITOBA\nLA MAISON DU BON MARCHE.\n\nLES VENTES A SACRIFICES SE CONTINUENT TOUJOURS\nPOUR FAIRE PLACE AUX IMPORTATIONS DU PRINTEMPS!\n\nNous invitons spécialement nos amis de la campagne à nous venir faire une visite.\n\nNOS PRIX DEFIENT TOUTE CONCURRENCE.\nCacheeries, Étoffes à Robes, Broderies, Chemises, Corsets, Vêtements de dessous, Rubans, Dentelles, Toiles à Table, Flanelles, Couvertes, Couvre-pieds, Étc., Étc.\n\n432, Rue Principale, Winnipeg. P. A. D'AUTEUIL. 432, Rue Principale, Winnipeg.\n\nChronique Locale.\n\n—M. G. Arisi, est à faire agrandir son hôtel.\n—M. R. Laytonner occupe dans sa maison ancien targeur, m. de M. Guillaud, blanc Lardivere.\n—M. Arisi fait un crustacé marin et ses amis se font donc dire une variété de touristes commerciaux.\n—Un maître de l'industrieitté Boas, regard à une partie de sa tête. Retrouve qu'il y manque ses bords, de la part du temps.\n—M. Saïd à l'honneur d'annonces qu'il sert lait pour le peuple, l'humanité se fera des avantages sur la place chasse.\n—M. Turner et Dampier viennent de recevoir deux charos de nouvelles marchandises : vaisselle, épices, conserves alimentaires. Les prix sont les plus réduits.\n—Pendant le mois de mars, les dépôts mensuels de la Banque de la province de Winnipeg ont été de $847,560. Le gestionnaire est chaud, après le succès des argentiers sous $346,153.\n—Il y aura assemblée de la Société de la Saint-Pierre le mercredi de cette semaine, à 9 heures, dans l'ancien hôtel Saint Louis, rue Principale. Il est demandé au public d'être présent à ces séances.\n—La ville de Ville-Émery accueille par le président de la section locale, dont les taxes de l'an dernier ne ont pas encore été payées. Elle sera rendue le 10 courant. Aussi, toutes les taxes pour propriétés à propriété ou à logement, d'ici à une semaine ; ce faisant, les contribuables intéressés devraient être en mesure de régler.\n—La perception de retrançage de rentes sur les pensionnaires de la maison Merville, pour le mois de mars, est de $5,338.\n—Le cimetière de Sainte-Anne-de-Bellevue est immergé dans une atmosphère de réjouissance, à l'occasion du centenaire de la fondation de la paroisse.\n—L'église de Sainte-Anne-de-Beaupré est en travaux de reconstruction.\n—La municipalité de Winnipeg prévoit d'investir $250,000 pour les café aménagements futurs.\n—Le journaliste de la Nation annonce que le marché du bétail a connu une baisse de 10 pour cent.\n—L'école de musique publique de Winnipeg est ouverte pour les cours de cette année scolaire.\n—Les pompes de la ville de Winnipeg sont en permanence en service, assurant une distribution fluide de l'eau.\n—La Compagnie de la manufacture de pneumatiques annonce la nomination de M. Henri Dufresne comme directeur général.\n\nENCANS.\n\nM. Louis Lenoir, président de la compagnie de l'état, est chargé de l'exécution des encans, pour le compte de la municipalité de Winnipeg.\n—La municipalité de Winnipeg, sous la présidence de M. Thomas McCaul, a été pleinement active au cours de cette session.\n—La municipalité de Winnipeg donne rendez-vous à tous les citoyens à une grande fête nationale, les jeudis de cette année.\n—La municipalité de Winnipeg décerne une médaille de bronze à M. Thomas McCaul, pour son service à la ville.\n—La municipalité de Winnipeg déclare officiellement le 1er mai journée internationale du travail.\n—La municipalité de Winnipeg annonce la fin de la saison de pêche sur les rivières de la ville.\n—La municipalité de Winnipeg annonce l'ouverture de la nouvelle école de musique publique.\n—La municipalité de Winnipeg annonce la nomination de M. Henri Dufresne comme directeur général.\n—La municipalité de Winnipeg annonce l'ouverture de nouveaux établissements commerciaux.\n—La municipalité de Winnipeg annonce la nomination de M. Henri Dufresne comme directeur général.\n\nCONTRATS DE LA MAISON.\n\nDES SOUMISSIONS doivent être effectuées pour les travaux suivants :\n\n- Pour la construction de la nouvelle école de musique publique.\n- Pour la réfection du marché de la ville de Winnipeg.\n- Pour la construction de nouveaux établissements commerciaux.\n- Pour la réfection de la route de l'avenue Provancher.\n\nDÉJEUNERS.\n\nENCORE MEILLEUR MARCHE.\n\nFIN DE LA SAISON. VENTE SANS RESERVE.\n\nPour faire place aux Nouvelles Importations du Printemps, je vendrai, à Grands Sacrifices, toutes les Marchandises suivantes :\nCOUVERTURES DE LAINE, FLANELLES, TWEEDES, ÉTOFFE À ROBE, ÉTOFFE À MANTEAUX, TRICOTS DE TOUTES ESPECES, ETC., ETC.\n\nHARDES-FAITES. - PARDESSUS DE TOUTES SORTES. - HABILLEMENTS POUR ENFANTS.\n\nFOURRURES, FOURRURES :\nCAPOTS CHAT SAUVAGE, ASTRACAN, OURS DE SIBERIE, MOUTONS.\n\nMANTEAUX ASTRAÇAN,\n\nCASQUES, COLLERETTES, MANCHONS, ETC., ETC., ETC.\n\nUNE VISITE EST SOLlicitÉE.\n\nF. E. VERGE\nAvenue Provancher, St Boniface.\n\nAVIS.\n\nAux Maîtres de Maisons dans les Territoires du Nord-Ouest et dans Manicouagan.\nDès le début de juillet prochain par un éclaireur une carte touristique, et pour payer sa taxe, le passager s'adressera à M. Lazare Blanchet, Directeur de l'Office de Tourisme des beaux territoires de Manicouagan.\n\nJAMES E. FRIDGENGERAST.\nAvocat, Redacteur en Chef.\n80 avenue Provancher.\n\nSAINT-JOHN.\n\nSAINT-BONIFACE.\n\nAVIS.\n\nJean-Barthélemy,\nSaint-Jean-Baptiste.\n\nDONNE PUBLIC AVIS que les personnes âgées de plus de 50 ans et leurs familles, ainsi que les personnes âgées de plus de 35 ans et leurs familles, soient tenus d'accepter à leur domicile de sous les assistants sociaux les collecterions de la ville de Winnipeg. Ces personnes devront être accompagnées de l'un de leurs proches parents ou de leur Lettre de Garantie.\n\nALFRED DOUGLAS.\n\nTél. 4.1.88.\n\nCONTRAITS DE LA MAISON.\n\nDESSOUS-DIAPRES achetés par les dames de la Société de Mutualité, pour 10 francs chacun, seront vendus à partir du 1er mai, pour 5 francs chacun.\n\nCONTRAT DE LA MAISON.\n\nW. W. MILLIGAN,\nImportateur des biens de l'Europe, ouvrant une nouvelle boutique à St Boniface, jeudi 11 mai.\n\nSTEEL BROS & CO.\n\nSEEDS.\n\nALL LEADING MERCHANTS.\n\nSTEELE BROS & CO.\n**AGRICULTURE**\n\n*Quatorze semaines mal-étreint.*\n\n— Eh bien ! Baptiste, as-tu fini les semaines ?\n\n— Oui, je ne peux pas mettre en terre mes céréales de graine. Mais, j'attends que le temps se soit un peu amélioré.\n\n— Tu as raison, mais il est temps que tu entres en culture. La plupart des agriculteurs ont commencé à planter leurs semences. Tu devrais suivre leur exemple.\n\n— Je ne peux pas encore planter mes semences. Le temps est trop froid et la terre est trop humide.\n\n— Tu as raison, mais il est temps que tu entres en culture. La plupart des agriculteurs ont commencé à planter leurs semences. Tu devrais suivre leur exemple.\n\n**LOTERIE NATIONALE DE COLONISATION**\n\n*Mercredi, 18 avril 1888, à 2 heures P.M.*\n\n*Valeur des lots $50,000.*\n\n**1ère série — Valeur des lots $50,000.**\n\n**2ème série — Valeur des lots $50,000.**\n\n**DEMANDE DE BILLETS**\n\n*À vendre à M. Lefebvre, 36, rue Saint-Joseph, Montréal.*\n\n**ECURIE DE LOUAGE**\n\n*110 Garret, Winnipeg, No. 110*\n\n**LIBRAIRIE KEOBACK**\n\n*Par Dominique, Saint-Boniface.*\n\n**RICHARD & CIE**\n\n*Importateurs de Vins, Liqueurs et Cigares, 365, Rue Principale, Winnipeg.*\n\n**La Conception du Beurre**\n\nUn petit guide américain donne des conseils sur la façon de conserver le beurre.\n\nLe beurre doit être conservé dans un endroit frais et sec. Il ne doit pas être exposé au soleil ou à la chaleur. Il est recommandé de le mettre dans une boîte hermétique ou de le envelopper dans du papier d'aluminium.\n\n**La Conservation du Vin**\n\nLes amateurs de vin savent que le vin doit être conservé dans un endroit frais et sec. Il est recommandé de le mettre dans une cave ou de le garder dans un réfrigérateur.\n\n**AVIS**\n\n*Pour les propriétaires de terrains à vendre ou à louer.*\n\n**MUNICIPALITÉ DE SAINT-ANNE, VENTE DE TERRAINS POUR TAXES.**\n\n*Description, Section, Lot, No. d'Adresse, Ares, Total, Patented or Un-patented*\n\n**AVIS**\n\n*Pour les propriétaires de terrains à vendre ou à louer.*\n\n**VENTE DE TERRAINS POUR TAXES, Municipalité de St. Anne, 1888.**\n\n*Description, Section, Lot, No. d'Adresse, Ares, Total, Patented or Un-patented*\n\n**AVIS**\n\n*Pour les propriétaires de terrains à vendre ou à louer.*\n\n**RESTAURANT ST. BONIFACE**\n\n*Géo. E. Fortin, Avocat, 361, Rue Principale, Winnipeg.*\n\n**NEW INVENTION**\n\n*BINDER TWINE!*\n\n*Manufactured by The Dartmouth Hopwood Co., Halifax, Nova Scotia.*\n\n**BLUE RIBBON**\n\n*Should be used only by*\n\n*PARNERSHIP*\n\n*Should be used only by*\n\n*NEW INVENTION*\n\n*Manufactured by The Dartmouth Hopwood Co., Halifax, Nova Scotia.*\n\n**CHUSTER GLASS**\n\n*Selvatico, Selvatico.*", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/LMT_1888041201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6916, "total-output-tokens": 3628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2534, 1], [2534, 2625, 2], [2625, 8582, 3], [8582, 11139, 4]], "primary_language": ["fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]