[{"id": "815c512dbff95a715c867a6fa1bd06e35c4691d2", "text": "MANITOBA AND THE NORTH-WEST FRAUDS.\n\nCORRESPONDENCE\n\nWITH THE\n\nDEPARTMENT OF AGRICULTURE,\n\n&c., &c., &c.,\n\nRESPECTING THE IMPOSTURES\n\nOR\n\nPROFESSOR JOHN MACOUN\n\nAND OTHERS,\n\nBY\n\nHENRY YOULE HIND, M.A.,\n\nformerly in Charge of the Assiniboine and Saskatchewan Exploring Expedition.\n\nWINDSOR, N.S.\n\n1883.\nTO THE PUBLIC.\n\nThe reasons which compel the publication of the following correspondence will be found in the reply (No. XII.) to the communication received from Lieutenant-Colonel de Winton, R. A., the Governor General's Secretary.\n\nThe \"Death and Mutilation Roll\" is very incomplete, but sufficiently harrowing to arouse public sympathy and suggest active inquiry.\n\nH. Y. H.\nNO. I.\n\nDEPARTMENT OF AGRICULTURE.\n\nMEMORANDUM.\n\nFROM JOHN LOWE TO HENRY YOULE HIND, ESQ., &C. &C.,\n\nWindsor, N. S.\n\nYou state, on the 4th page of your printed letter addressed to the Secretary of State, and dated 8th inst., (1) that copies of your various printed communications have been \"furnished to the Dept. of Agriculture and special attention drawn, &c., &c.\"\n\nThis reference is apparently to a list of letters numbered from I to IV on same page of printed letter referred to.\n\nNone of these letters or documents have ever been received by this Department. Perhaps in view of this fact and the reference you have made to this Department, you would have the kindness to either furnish a copy of those letters or afford directions as to how they can be obtained.\n\n5,000—9—1 '83.\n\n(1) Note by H. Y. H.—This is the Extract referred to by Mr. Lowe in his Memorandum.—(H. Y. H.)\n\n\"Among the Dead Sea fruit of cozening the public servants, you have before your eyes the collapse of many North-West Territory Colonization Companies, the sickening of the Duke of Manchester's adventure, and the stern prophetic truths which are now being told by numerous leading English papers concerning the probable future of similar organizations. (4)\n\nI respectfully submit printed copies of letters relating to the false information officially distributed in England and elsewhere by Sir Alexander Galt respecting the North-West Territory.\n\nI.—To the Right Honourable Earl Granville, K. G., Her Majesty's Principal Secretary of State for Foreign Affairs; and the Right Honourable the Earl of Kimberley, Her Majesty's Secretary of State for the Colonies, dated Windsor, Nova Scotia, May 27th, 1881, with accompanying \"Argument.\"\n\nII.—To the Right Honourable the Earl of Kimberley, Her Majesty's Secretary of State for the Colonies, dated Nov. 5th, 1881.\n\nIII.—To the Right Honourable the Earl of Kimberley, Her Majesty's Secretary of State for the Colonies, dated Nov. 27th, 1881.\n\nIV.—Letter to His Grace the Archbishop of Canterbury, relating to the \"Colonists' Handbook—Canada,\" enclosing among others the following letters. [Transmitted in August, 1882.]\n\n1.—To the Rt. Hon. the Lord Mayor of London, dated Nottingham, April 12th, 1882, with enclosures.\n\n2.—To J. C. Bancroft Davis, Esq., Assistant Secretary of State, Washington, D. C., dated Nottingham, 12th April, 1882.\n\n&c., &c., &c., &c.\n\nYou will gather from these communications that the grossest misstatements and falsifications of physical facts concerning the Canadian\n\n(4) The relations of some of the officers of the Royal Colonial Institute, particularly Sir J. Rose, Sir Alex. Galt, the Duke of Manchester and Mr. Silver ought to be made public in connection with the transactions which surround the formation of the Duke of Manchester's Company. The history of this Company is a blot on certain hereditary Rulers at home, and this, with other matters, makes one think that some of England's noted names are on the swift downward grade, and all for money.\nNorth-West have besmirched the proceedings of various distinguished Societies in England under venal and unprincipled influence. Among these Societies are the Royal Geographical Society, the Royal Colonial Institute, the Society for the Propagation of the Gospel in Foreign Parts, the Society for the Promotion of Christian Knowledge. Even the Imperial Colonial Office has not been safe from Canadian official misrepresentation. All of these practices have apparently the one object, namely: to distort and magnify the physical features of Manitoba and the North-West Territory for the purpose of inducing immigration, or disposing of property in Land, or shares in Companies.\n\nThe solitary groundwork for the acceptance of most of these frauds is that the statements are \"official,\" and lavishly spread by such magnates as Sir Alex. Galt, G. C. M. G., Canadian High Commissioner, Sir John Rose, formerly Finance Minister of Canada, Mr. G. Stephen, Mr. H. S. Northcote, &c., &c., backed by the conniving authority of the Department of Agriculture of Canada. * * *\n\nI beg to ask your particular attention to the delusions successfully propagated by using the name of the United States Consul at Winnipeg, respecting the climate of the North-West Territories. When the statements of this officer are compared with known facts and the official records kindly furnished to me from the office of the Chief Signal Officer at Washington, in compliance with the reference made by the United States Assistant Secretary of State, the nature of the imposition will be understood. The use of this imposition by the Department of Agriculture is simply vile.\n\nAlthough copies of my various printed communications have been furnished to the Department of Agriculture, and special attention drawn to the erroneous conclusions of the United States Consul, to whom falsified Meteorological data were supplied, yet the Department of Agriculture has not only pooh-poohed the exposures of the imposition practised upon the United States Consul at Winnipeg, and the shocking use made of those impositions, but has very recently greatly falsified that officer's figures, and added the information, \"Nothing can be more striking than the statement of facts contained in his letter, (Consul Taylor) and they are as unquestioned as they are unquestionable.\" (Page 24—Canadian North-West. Climate and Productions—Published by the Department of Agriculture of the Government of Canada, 1883.)\n\nThe Department of Agriculture has taken the liberty to add 12 degrees to the Consul's representation of the mean temperature of January at Winnipeg; 24 1-2 degrees to the mean temperature of February at Winnipeg; 20 1-2 degrees to the mean temperature of February at Battleford, and a corresponding number of degrees to the mean temperature of the year at both of these localities.—And after making these ameliorating and utterly misleading changes the Department announces that \"his\" statement of \"facts\" is \"as unquestioned as they are unquestionable.\" This bold lie is promulgated in the face of fact and known official records to the contrary, published by our own Dominion Meteorological Service.\n\nOn page 5 the Department announces that \"the summer mean of Manitoba is 67°-76 Fah. which is about the same as that of the State of New York.\" The Department uses my own figures for one locality at Red River in 1857, which I stated were unreliable fully 20 years ago. (See page 40—Letter to the Archbishop of Canterbury). On page 20 the Department reproduces the false figures of the charlatan Macoun, exposed in my letter to the Earl of Kimberley, dated 9th Nov., 1881. On page 26, the Department states that \"Between 50,000 and 80,000 settlers from the older Provinces of Canada, the United States, the United Kingdom and parts of Europe, have gone in (to Manitoba and the North-West) during 1882; and it is expected that the influx will be far greater in 1883, the territory to be occupied being about as large as the whole Continent of Europe, and the equivalent on the Continent of America of that of Europe north of Paris, comprising the most powerful kingdoms and empires on the Globe.\"\n\nNow I respectfully submit that it is of the highest importance to deal at the earliest possible moment with the erroneous and falsified statements\nissued by the Department of Agriculture, and circulated so largely by your conscious and abetting High Commissioner in England. The matter is too serious to be neglected, it is beginning to be understood at home, as you may gather from the recent remarks of some of the London papers of influence. Canadian credit and Canadian diplomacy and Canadian Government will soon become a bye-word if these perversions are permitted to continue.'—Extract from printed letter to the Secretary of State, dated Feb. 8th. 1883, and sent to all members of the House of Commons.\n\nNO. II.\n\nREPLY—MR. HIND TO MR. LOWE,\n\nWindsor, Nova Scotia, 24th Feb., 1883.\n\nJohn Lowe, Esq., Secretary Department of Agriculture, Ottawa.\n\nSir:—I have this day received from you an office \"Memorandum\" without date, numbered 5,000,—9—1 '83, in which you state that certain letters or documents referred to in my recent letter to the Secretary of State, dated Feb 8, 1883, have never been received by the Department of Agriculture.\n\nIn reply I have to say that these documents were duly posted to the address of the Department of Agriculture, Ottawa, either from Canada or England, according to the locality where they were written, and about the date of their being made public.\n\nBeing conscious of the great importance of the subject to which my letters related, and of the diplomacy which not unfrequently seeks to evade the consequences of an abuse of trust, I have guarded in several ways against the force of the statement you have made respecting the alleged non-reception of my communications.\n\nFirst—I have adopted the plan of multiplying the copies by printing them before transmission, and sending a copy to many interested individuals, some being officially connected with the Department of Agriculture; also to the leading papers of the public press.\n\nSecond.—To ensure knowledge of delivery and reception, I have in some instances registered these communications in accordance with postal regulations. You will find printed on one of the most important letters a notice of registration. I hold the certified copy of the register.\n\nThird—I have personally handed, in some instances, the letters and documents in presence of a witness, specially retained for the purpose, to parties interested.\n\nFourth—I hold acknowledgement of the reception of important documents from officers connected with the Department of Agriculture, for instance, the High Commissioner in England.\n\nBut even supposing that you can not trace the whereabouts of the communications sent to the Department of Agriculture, yet, in the matters to which my letters relate, there is no visible excuse for the publication, or official distribution by the officers of the Department of Agriculture, of palpably false and misleading statements respecting physical facts of material consequence touching Manitoba and the North-West Territory.\nIn respect of Meteorological data, you have had before you for ten years past the official records of the Dominion Meteorological Service, and yet you have published and re-published in your Emigration Pamphlets the inventions or delusions of amateurs, charlatans and impostors.\n\nIt has appeared to me that the fabrications of the impostor Macoun, are so palpable, that it is only by the exercise of blinded or perverted intelligence that any one dealing with the subject as you have done, and the Department of Agriculture has done, could escape noticing their falseness and their misleading tendencies in one direction.\n\nThe same remark applies to Map making, and Map emanations from the Departments of Agriculture and the Interior, noticed in my communications.\n\nEver since it was pointed out to me that I had been entrapped at Ottawa, in 1878, by Colonel Dennis with his false maps and statements respecting the alleged discoveries of the officers of the Canadian Pacific Railway Survey in the far North-West, I have endeavoured to repair the evil and mischief which the use made of my theoretical deductions or garbled quotations from my \"evidence,\" might occasion in unscrupulous hands.\n\nThe ruin and misery created by misleading publications issued under authority is incalculable, and it becomes inexcusable when consciously pursued in the face of open remonstrance and evidence to the contrary.\n\nAccompanying this response to your \"Memorandum\" and request are copies of the documents you seek, as enumerated in the subjoined list.\n\nIt will be my duty to notify and call the attention of the Minister of Agriculture to this letter and enclosures; also the attention of the Emigration Committee of the present Canadian Parliament, and also that of His Excellency the Governor General to the same.\n\nBe so good as to acknowledge the receipt of this letter and the accompanying documents at your earliest convenience.\n\nI have the honour to be,\n\nYour Obedient Servant,\n\nHENRY YOULE HIND.\n\nJOHN LOWE, Esq.,\nSecretary to the Department of Agriculture, Ottawa.\n\nENCLOSURES.\n\n1.—Letter to the Rt. Hon. Earl Granville, K. G., and the Rt. Hon. the Earl of Kimberley—with Argument—dated Windsor, N. S., May, 27th, 1881.—(Printed).\n2.—Letter to the Rt. Hon. the Earl of Kimberley, dated Windsor, N. S., Nov. 5th, 1881.—(Printed).\n3.—Letter to the Rt. Hon. the Earl of Kimberley, dated Nov. 27th, 1881,—(Printed).\n4.—Letter to the editor of the Nottingham Daily Guardian, dated Nottingham, April 12th, 1882.—(Printed).\n5.—Letter to His Grace the Archbishop of Canterbury, entitled \"An Outcome of the Lambeth Conference,\" dated June 20th, 1882,—but transmitted in August, 1882.—(Printed).\n6.—Letter to the Standing Committee of the Society for the Propagation of the Gospel in Foreign Parts, and the Tract Committee of the Society for Promoting Christian Knowledge, dated Windsor, Nova Scotia, Oct. 12th, 1882.—(Printed).\n\nNO. III.\n\nMR. HIND TO THE CHAIRMAN OF THE COMMITTEE ON IMMIGRATION AND COLONIZATION, HOUSE OF COMMONS, OTTAWA.\n\nWindsor, Nova Scotia, Feb. 26, 1883.\n\nSir:—I have the honour to inform you that I have this day sent to your address, for the information of the Committee on Immigration and Colonization, copies of printed letters named in the margin, relating to false representations of physical facts concerning Manitoba and the North-West Territories circulated by the Department of Agriculture. Duplicates of these documents have been transmitted to Mr. John Lowe, Secretary to the Department of Agriculture at his request.\n\nI have notified Mr. Lowe that copies of the same documents would be sent to your Committee for their information, also to His Excellency the Governor General.\n\nMr. Lowe's request arose from statements made by me in a printed communication to the Secretary of State, dated Feb. 8, copies of which were sent to every member of the Canadian House of Commons.\n\nThese statements relate to the false representations in the pamphlet recently issued by the Department of Agriculture entitled—\"The Canadian North-West—Climate and Productions.\"\n\nIn my letter to His Excellency the Governor General I have alluded to impending physical disasters in the valley of Red River, which demand serious and immediate attention.\n\nI have the honour to be,\n\nYour Obedient Servant,\n\nHENRY YOULE HIND.\n\nENCLOSURES.\n\n1.—Letter to the Rt. Hon. Earl Granville, K. G., and the Rt. Hon. the Earl of Kimberley—with Argument—dated Windsor, N. S., May 27th, 1881.—(Printed).\n2.—Letter to the Rt. Hon. the Earl of Kimberley, dated Windsor, N. S., Nov. 5th, 1881.—(Printed).\n3.—Letter to the Rt. Hon. the Earl of Kimberley, dated Nov. 27th, 1881.—(Printed).\n4.—Letter to the editor of the Nottingham Daily Guardian, dated Nottingham, April 12th, 1882.—(Printed).\n5.—Letter to His Grace the Archbishop of Canterbury, entitled \"An Outcome of the Lambeth Conference,\" dated June 20th, 1882,—but transmitted in August, 1882.—(Printed).\n6.—Letter to the Standing Committee of the Society for the Propagation of the Gospel in Foreign Parts, and the Tract Committee of the Society for Promoting Christian Knowledge, dated Windsor, Nova Scotia, Oct. 12th, 1882.—(Printed).\nNO. IV.\n\nMR. HIND TO HIS EXCELLENCY THE GOVERNOR GENERAL.\n\nWindsor, Nova Scotia, Feb. 26th, 1883.\n\nMay it please your Excellency:—I have received from Mr. John Lowe, the Secretary to the Department of Agriculture, a communication stating that the documents referred to in my letter to the Secretary of State, dated the 8th inst., and relating to false representations circulated by the Departments of Agriculture and the Interior respecting Manitoba and the North-West Territory, have not been received by the Department, and requesting copies.\n\nI have fittingly replied to this customary device of those who deal in fraudulent representation, and have pointed out the futility of such a screen in the presence of the facts of the case.\n\nThese prominently present themselves in the selection by Mr. Lowe and the Department of Agriculture of palpably false and illusory statements and authorities, with the true official record of physical phenomena before them, coupled with the further falsification of erroneous data.\n\nMr. Lowe and the Department of Agriculture ought now to be preparing to face and mitigate the effects of a calamity which, humanly speaking, and drawing conclusions from reliable premises, threatens to bring the punishment for intentional falsehood and perversion of fact with terrible force upon the country.\n\nWithin two months or thereabouts, the repetition of the periodical inundations of the valley of Red River, probably on a scale of unrecorded magnitude and disastrous consequences, will afford a harrowing commentary on the Departmental work of some of your Excellency's responsible advisors and their subordinates.\n\nSo far as the constitutional powers of a Governor General permit, I feel sure that the humanity of your Excellency will lead you to spare no efforts to restrain that course of merciless deception of the public which now threatens the country with the sorest of troubles.\n\nI have sent to Mr. Secretary Lowe, in compliance with his request, the documents numbered in the margin. (1 to 6.) I enclose for your Excellency's information duplicate copies. Similar copies I have transmitted to the Chairman of the Parliamentary Immigration and Colonization Committee for the information of that responsible body.\n\nThe request on the part of Mr. Secretary Lowe brings the selection, preparation and distribution of false and misleading North-West Literature by the Department of Agriculture fairly under the official cognizance of your Excellency, as now herewith represented.\n\nThere can be no doubt whatever that the interests of the British as well as of the Canadian investing and emigrating people, ought to insure the closest scrutiny of the matters herein noticed; and, in view of approaching physical, with possibly financial calamities, the earliest unbiased attention and the most public exposition of results adapted to mitigate impending evils.\n\nThe documents herewith transmitted are first efforts,—annotated\nas I possess them, ready for inquiry—they furnish numerous and potent additional facts, to a degree which establishes beyond doubt or cavil the danger and the criminality of the deceptions circulated by the agents of the Department of Agriculture, and others interested in the abnormal development of the Canadian North-West.\n\nThe motives for this open inquiry now transcend those which concern mere political delinquency, they touch and comprehend the dictates and demands of humanity.\n\nWhen your Excellency dispassionately considers the character of the official work which has been systematically pursued since 1872 in Canadian Public Offices by Mr. Commissioner Whitcher, Mr. Commissioner Bouchette, Mr. Commissioner Johnson, Mr. Secretary Lowe, Lieutenant-Colonel Dennis, &c., &c., capped by the use made of that official work and the proceeds it has temporarily secured, your Excellency will not fail to recognize in realized or approaching disaster, the workings of that merciful law of retribution which governs the unjust actions of mankind.\n\nI have the honour to be,\n\nYour Excellency's Obedient Servant,\n\nHENRY YOULE HIND.\n\nEnclosures—(as before enumerated in No. II.)\n\nNO. V.\n\nMR. HIND TO THE HONOURABLE THE MINISTER OF AGRICULTURE,\nOTTAWA.\n\nWindsor, Nova Scotia, March 6th, 1883.\n\nSIR:—I have the honour to solicit your serious attention to the letter I had occasion to address to Mr. Lowe, Secretary to the Department of Agriculture, on the 24th ult., in reply to a communication from that officer.\n\nDelay in the transmission of this request has arisen from the reception of the recently published work by Mr. John Macoun, entitled \"Manitoba and the Great North-West;\" dedicated by special permission to His Excellency the Governor General.\n\nI found in this work, not merely the repetition of the leading falsified and misleading Meteorological data, with conclusions therefrom, noticed in my letter to the Secretary of State dated Feb. 8th, 1883, and in the various printed and published communications already sent to the Department of Agriculture at Mr. Lowe's request, but, besides these, other misrepresentations of so gross and deceitful a character, as to call for immediate action on account of the mischief they were liable to produce.\n\nApart from the dishonest perversions in the pamphlet recently issued by the Department of Agriculture entitled the \"Canadian North-West—Climate and Productions,\" to which I have already\ncalled attention, I deeply regret to have further to point to very inconsiderate and deluding references to the periodical floods which occur in the valley of Red River.\n\nTwenty-three years ago I called particular attention to peculiar Geological evidences of periodical inundations in the valley of Red River (page 392, Vol. II., of my narrative of the Canadian Exploring Expeditions), and in the valley of the Souris River, (Ibid, page 295-6, Vol. I.) which prove the certainty of their repeated occurrences in the remote past and their recurrence during the present epoch, with liability to submersion and possibly to destruction, of whatever artificial obstacles may oppose the free passage of water and ice at or near the site of the city of Winnipeg.\n\nThese evidences you will observe are quite distinct from human records of great floods in the Red River valley during the years 1776, 1790, 1800, 1826, 1852, 1861 and 1882. They are also distinct from other natural records I have long ago publicly described and discussed.\n\nBut since I wrote those warnings, based on recognized Geological evidence of marked character, the danger to be apprehended from inundations to the city of Winnipeg have been artificially increased tenfold by the railway embankments of the Canada Pacific and its branches.\n\nThe Louise Bridge is situated in the throat of the funnel formed by different railway embankments radiating from Winnipeg. Down the narrow extremity of this funnel nearly all the flood waters of an area approaching that of Great Britain or about 75,000 square miles, which do not overtop the railway embankments or back up the bridged tributaries, must pass in the form of a destructive and probably ice-bearing torrent.\n\nThe fate of artificial obstructions such as now exist, exposed to ice-bearing currents in the throat of the narrow outlet thus created, appears to be certain, sooner or latter, this year or the next succeeding. The same remark applies to much of the city of Winnipeg.\n\nI repeat what I published as the result of recorded Geological evidence in 1860—\"There is no possibility of guarding against these inundations,\" and now the concentration of their effects has been artificially secured by the railway embankments.\n\nMr. Sandford Fleming gives on page 269 of his official report for 1880, a startling record of measurements and facts, which ought to have led the writer of the Departmental Pamphlet on the \"Canadian North-West,\" to a more humane and rational representation of contingencies, with associated calamities, sooner or later sure to happen.\n\nThe excess of precipitation throughout the extreme North-West of the United States, including Northern Dakota and Minnesota, during October, November and December, 1882, has amounted, according to the United States Signal Service, to the equivalent of 16 inches of snow more than the average of previously recorded annual precipitations. This is the equivalent of 1.60 inches of water for the last quarter of the year just past, in excess of the average of several preceding years.\n\nThere are other present climatic conditions connected with this excess of precipitation suggestive, if not alarming, in relation to Red\nRiver inundations, and inundations in the United States. These con-\njointly point to an unusual overflow of Red River and the Souris in\nthe spring of this year. Against the impending calamity these con-\nditions predict there is now, I regret to say, little chance of guard-\ning, but it would be an act of obligatory humanity, especially in-\ncumbent on the Department of Agriculture, if the probability of\nan unusual and disastrous inundation this spring were to be officially\npointed out, so that immigrants and the poorer settlers might be\non their guard and have time to prepare.\n\nIt is my duty to call your serious attention to this threatening\nmatter, for I am sorry to say that in all the data relating to climate\nand its contingencies, there has been introduced, with surprising\nuniformity, into the numerous issues of so-called \"Information for\nIntending Immigrants\" circulated by the Department of Agriculture\nrespecting Manitoba and the North-West, the one-sided specu-\nlations of the incompetent amateur, or the grosser perversions of the\nunscrupulous charlatan, in place of the trustworthy observations of\nscientific observers, and the records of a well ordered Dominion\nMeteorological Service, and a neighboring National Service of un-\nsurpassed compass and arrangement.\n\nYou are aware that it is stated, until very recently no systematic\nenforced registration of deaths has taken place in Winnipeg, a city\nreported to contain from 25,000 to 30,000 inhabitants.\n\nThere is reason to believe that numerous deaths and dreadful in-\njuries from freezing and exposure have occurred during the present\nwinter throughout Manitoba and the North-West, arising largely\nfrom misleading information and consequent unpreparedness.\n\nSome of these distressing consequences are noticed in the public\npapers, but it is more than probable that the greater number have\nstill to be publicly recorded. This is a subject on which I have\nelsewhere enlarged and the document has been forwarded to you.\n\nI have to state in conclusion that my published communications\npointing out the previous mis-statements embodied in the leading\npublications issued by the Department of Agriculture, have been\nnoticed in various ways by portions of the Public Press of Canada,\nEngland and the United States, in some instances by those papers\nwhich are quoted by the Department of Agriculture and come under\nthe special notice of its agents.\n\nThese agents report as the result of their efforts, an enormous\nprospective immigration created by the \"information\" they have\nsupplied.\n\nPossessing, as I claim to do, personally acquired and reliably\ngathered knowledge, as far as it goes, of the physical phenomena\nand the physical characteristics of Manitoba and part of the North-\nWest, the instincts of duty and humanity enforce me to continue\nto protest by open publication, other efforts having failed, against\nthe cruelly travestied and in some instances mutilated records offi-\ncially presented for guidance in all the leading publications issued\nand patronized by the Department of Agriculture.\n\nI do this in the presence of the recent repetition of this wrong as\nfurnished by the Departmental issue of the pamphlet entitled \"Ca-\nnadian North-West—Climate and Productions,\" and Professor Ma-\ncoun's \"Manitoba and the Great North-West.\" I do it for the purpose of mitigating impending troubles and sorrows; also to restrain further imposition upon uninstructed people.\n\nI have the honour to be,\n\nYour Obedient Servant,\n\nHENRY YOULE HIND.\n\nFormerly in charge of the Assiniboine and Saskatchewan Exploring Expedition.\n\nNO. VI.\n\nWindsor, Nova Scotia, March 5, 1883.\n\nMR. HIND TO HIS EXCELLENCY THE GOVERNOR GENERAL, OTTAWA.\n\nMAY IT PLEASE YOUR EXCELLENCY:—Two days after I had despatched my letter, dated Feb. 26, 1883, to your Excellency, I received a copy of Professor John Macoun's new work on \"Manitoba and the Great North-West,\" dedicated by special permission to your Excellency, and published by the \"World Publishing Company, Guelph, Ontario.\"\n\nTo my extreme surprise and regret I not only found in this work the misleading falsification of the United States Consul Taylor's Meteorological figures and conclusions therefrom, (page 160) noticed in my letter to the Secretary of State, dated Feb. 8, 1883, but also some of the other perverted and misleading meteorological data described in my letter to the Rt. Hon. the Earl of Kimberley, dated Nov. 27, 1881, and the Nottingham Daily Guardian, dated April 12, 1882, (pages 159, 145, 167, 168, &c.) together with additional instances of false representations of recorded physical facts possessing grave misleading tendencies, some of which had been previously pointed out in my printed letter and argument addressed to Earls Granville and Kimberley, dated May 27, 1881, and other communications.\n\nAdded to these perversions and frauds, which no longer belong to mere charlatanism, in Professor Macoun's \"Manitoba and the Great North-West,\" I find numerous and varied deceptions which can only tend to dupe and inveigle immigrants, shareholders in Companies, investors and the public generally.\n\nOn pages 594 to 596 of Professor Macoun's book, \"Manitoba and the Great North-West,\" I find re-published the greater portion of my so-called \"evidence\" in 1878, with the passages I had emphatically repudiated in my printed letter to the Rt. Hon. the Earl of Kimberley, dated Nov. 5, 1881, and at the time and shortly afterwards publicly distributed.\n\nYour Excellency has been supplied with copies of these letters from the date of May 27, 1881, up to the date of Sir Alex. Galt's reply to my general charges, dated London, May 3, 1882. A duplicate copy of Sir Alex. Galt's reply is enclosed.\n\nThe re-production by Professor Macoun of my repudiated \"evidence\" in connection with his falsified Meteorological data, conclusions and misleading statements generally, now published and circulated under the great influence of your Excellency's official name\nand patronage, becomes a matter of such important personal moment to myself, as to leave me no alternative in responsive action, even on the grounds of humanity alone.\n\nTherefore, besides duly informing your Excellency of the facts of the case, being persuaded that your Excellency has been deceived and misled in the matter, I have this day instructed my solicitor, as in duty and humanity bound, to bring the subject in proper form and bearing under the notice of the Guelph Publishing Company, and under the notice of Professor John Macoun, M.A., F.L.S., \"Dominion Field Naturalist and Botanist, and for nine years past Government Explorer of the North-West, formerly Professor of Botany in Albert University, Belleville.\"\n\nBut there is a matter which lies beyond all I have stated, and that is the great influence for harm created by the cruel misleading of uninstructed people in England, Canada and elsewhere, either as immigrants, investors, shareholders in Companies or property holders, through the numerous false and falsified statements and conclusions in Professor Macoun's work, under the patronage and influence of your Excellency's special permission as regards the dedication of the book.\n\nThe distress certain to arise from the continued spread of false representations of physical facts under the exalted patronage of your Excellency, suggests I venture respectfully to submit, open and unrestricted parliamentary inquiry respecting my public statements, made and proved from time to time concerning the North-West delusions which have been created or protected by servants of parliament, among whom there appears to be none more unscrupulously guilty than the High Commissioner in London.\n\nConsidering the character of the efforts of the High Commissioner to spread misleading information of the Macoun type, and secure thereby past, present and future immigration in the face of open warnings, the commonest impulses of humanity appear to suggest this course, and delay in so doing can only lead to the increase of that general, physical and financial distress which now seems to be imminent.\n\nOn page 609 of his work, your Excellency will observe that Mr. Macoun makes a very important statement respecting the Hon. Mr. Mackenzie's caution to him. On page 612 he makes similar important statements regarding the cautions and the views of Sir J. A. Macdonald, Mr. Mackenzie and Mr. Blake. In the same paragraph he announces Sir Charles Tupper's faith in Mr. Macoun, and the encouragement Sir Charles gave to him. Your Excellency now knows that Mr. Macoun is an impostor, and that he has deceived your Excellency and the country, and that much of what he alleges he conceives to be \"the truth\" is manufactured falsehood and fraud.\n\nI have the honour to be,\n\nYour Excellency's Obedient Servant,\n\nHENRY Y. HIND.\n\nFormerly in charge of the Assiniboine and Saskatchewan Exploring Expedition.\nCOPY OF SIR ALEXANDER GALT'S REPLY.\n\nDominion of Canada.\nOffice of the High Commissioner,\n9, Victoria Chambers, London, S.W.,\n3rd May, 1883.\n\nSir,—Sir Alexander Galt desires me to acknowledge the receipt of your letter of the 29th April, and to inform you that he does not propose to take any notice of the communications to which you refer.\n\nThe advantages of the Great North-West are, Sir Alexander considers, sufficiently proved by the large emigration thither from the Province of Ontario, and Canada generally, and by the success of the settlers.\n\nRespecting the other matters alluded to in your so called \"charges,\" Sir Alexander does not at present intend to add anything to what he has already written.\n\nI am, Sir,\n\nYour obedient servant,\n\n(Signed) Jas. G. Colmer.\n\nProf. H. Y. Hind,\nInns of Court Hotel, High Holborn.\n\nNO. VII.\n\nMr. Hind to His Excellency the Governor General, Government House, Ottawa.\n\nWindsor, Nova Scotia, March 6, 1883.\n\nMay it please your Excellency:—It is proper that I should inform you that in the letter my solicitor has transmitted to the \"Guelph Publishing Co.\" concerning Professor John Macoun's book entitled \"Manitoba and the Great North-West,\" the following passage relating to your Excellency occurs:—\n\n\"I am also instructed to inform you that this matter, in its entirety, has been presented by Mr. Hind to His Excellency the Governor General as patron of Professor Macoun's work, and the attention of the Governor General has been drawn to the injury done to the country by the misrepresentation of known physical facts which Professor Macoun has thought fit to originate.\"\n\nIn reviewing to-day, the copy of the letter I had the honour to send to your Excellency yesterday, I found a passage in which I had apparently omitted the word \"through,\" or an equivalent. In order to prevent misapprehension I ask leave to repeat the passage entire.\n\n\"But there is a matter which lies beyond all I have stated, \"and that is the great influence for harm created by the cruel mis-\"leading of uninstructed people in England, Canada and elsewhere, \"either as immigrants, investors, shareholders in Companies or pro-\"perty holders, through the numerous false and falsified statements \"and conclusions in Professor Macoun's work, under the patronage \"and influence of your Excellency's special permission as regards \"the dedication of the book.\"\nI have prepared a brief statement respecting the character of the North-West Literature issued by the Department of Agriculture for the Honourable the Minister of Agriculture, also an earnest appeal in the interests of the country and intending immigrants and investors, which I have addressed to the Rt. Hon. Sir John A. Macdonald, to be publicly heard and freely examined before an open Parliamentary Committee, with freedom of reply to objections or counter statements, respecting the general subject of misrepresentations in the various documents issued by the Department of Agriculture or the Department of the Interior, concerning Manitoba and the North-West Territories. I trust that in the interests of the country and of humanity, your Excellency will be pleased to urge the granting of this request at the earliest moment.\n\nI have the honour to be,\n\nYour Excellency's Obedient Servant,\n\nHENRY YOULE HIND.\n\nFormerly in charge of the Assiniboine and Saskatchewan Exploring Expedition.\n\nNO. VIII.\n\nJOHN LOWE, Esq., to Mr. Hind.\n\nDepartment of Agriculture,\n\nOttawa, Canada, 3rd March, 1883.\n\nSir:—I have to acknowledge your letter of the 24th ult., together with enclosures of printed papers numbered from I to VI, as per list at foot of your letter, which you have had the goodness to send to me at my request; none of these papers—with the exception of that marked No. VI, addressed to the Standing Committee of the Society for the Propagation of the Gospel—had been previously received in this Department; my attention having been drawn to them as intimated in my memorandum to you by a statement in a printed letter to the Secretary of State received the day before my memorandum—which should have been dated 20th of February, but this was accidentally omitted.\n\nI have the honour to be, Sir,\n\nYour Obedient Servant,\n\n(Signed) JOHN LOWE,\nSecy. Dept. of Agric.\n\nH. Y. HIND, Esq.,\nWindsor, N. S.\n\nNO. IX.\n\nMR. HIND TO MR. LOWE.\n\nWindsor, N. S., 8th March, 1883.\n\nTo John Lowe, Esq., Secretary to the Department of Agriculture, Ottawa.\n\nSir:—I have the honour to acknowledge the receipt of your letter of the 3rd inst., and to thank you for your prompt reply.\nSince sending my communication of the 24th Feb. I have ascertained a very important fact relating to the appearance of Consul Taylor's re-falsified figures in Mr. Macoun's book on \"Manitoba and the Great North-West.\"\n\nI infer from the publication of this work, prior to the Departmental issue of the pamphlet entitled \"Canadian North-West—Climate and Productions,\" that Mr. Macoun must be held responsible for the original perpetration of that outrage, and the remarks with which he introduces those altered tables, but I do not find the words \"they are as unquestioned as they are unquestionable,\" which appear in the Departmental pamphlet.\n\nI have ascertained that Mr. Macoun has, in numerous other instances, introduced into his work grossly misleading meteorological data previously and publicly exposed by me, also statements and deductions of so gross and deceiving a character as to leave me no alternative in the interests of the country and justice to myself, but to place the matter in the hands of my solicitor, who has already addressed the publishers on the subject.\n\nI regret to say that Mr. Macoun's transgressions far exceed the sins of a mere charlatan. Considering the widespread influence for harm to emigrants, investors, the public and myself his unchallenged false statements are liable to produce in various ways, I am compelled to press the matter to a public and possibly a legal issue.\n\nI beg to call your particular attention to the letter I have addressed, under date March 6th, to the Minister of Agriculture, especially to that portion which relates to the inconsiderate and deluding passages in the Departmental pamphlet concerning the periodical floods in the valley of Red River. There are conditions therein pointed out which may exert a very serious and disastrous influence on the immediate future of Manitoba and the North-West, suggesting humane action of an incumbent character by the Department of Agriculture and all who have misled by means of untrue or suppressed information.\n\nYour various Departmental Agents, as appears by notices in the public press and elsewhere, predict and report as the result of their efforts, an enormous prospective emigration and immigration created by the \"information\" they have supplied.\n\nI should be glad if you would bring the subject of this letter under the notice of the Committee on Colonization and Immigration. It affords me much satisfaction to know from you that you received my letter addressed to the Standing Committee of the Society for the Propagation of the Gospel, &c., and I have to thank you for acknowledging the receipt. None but those who understand the nature of that implicit faith which the uninstructed people of England place in printed statements issued by authority, or under the impress of the great Church Societies, can form any conception of the heartless abuse of trust, with its attending misery, such emanations of misleading information carry and ensure, by whomsoever furnished.\n\nI am deeply pained to learn that numerous cases of the saddest description have already occurred in Manitoba and the North-West, arising largely from the want of proper instructions to immigrants.\nI fear that many heartrending instances of death from freezing, or mutilation of limbs from the same cause will come to light in the spring.\n\nI should be glad to learn that it is the intention of the Department of Agriculture to take early steps to remedy the evils pointed out and seek to mitigate impending distress.\n\nI have the honour to be,\n\nYour Obedient Servant,\n\nHENRY Y. HIND.\n\nX.\n\nMR. HIND TO THE Rt. HON. SIR JOHN A. MACDONALD, K. C. B., FIRST MINISTER, OTTAWA.\n\nWindsor, Nova Scotia, March 8th, 1883.\n\nRIGHT HONOURABLE SIR:—In a letter I had the honour to address to His Excellency the Governor General, dated the 6th inst., concerning statements of the impostor John Macoun in his book entitled \"Manitoba and the Great North-West,\" dedicated by special permission to His Excellency, I adverted to an \"appeal in the interests of the country and of intending emigrants and investors,\" which I was about to make to you as first Minister of the Dominion of Canada.\n\nI have the honour now to present this appeal as subjoined.\n\nThe Book entitled \"Manitoba and the Great North-West; The field for Investment; The Home of the Emigrant, &c., &c., &c.,\" by John Macoun, M. A., F. L. S., Dominion Field Naturalist and Botanist, &c., &c., is a fraud of the grossest and most inveigling character.\n\nAmong the names of those whose communications are published in recommendation of Mr. John Macoun, as a suitable man to write this work, I notice your own under date, Ottawa, March 24, 1882. But I also notice with profound satisfaction that Mr. Macoun credits you (1) with imparting to him such salutary words of caution, and with giving expression to such feelings of doubt, as would suffice to make him especially careful of a strict adherence to fact.\n\nI note with the same satisfaction that Mr. Macoun records the strong caution of the Hon. Mr. Mackenzie (2) and the doubts of the Hon. Mr. Blake. But I regret to notice that Sir Charles Tupper's faith in Mr. Macoun is alleged to have been so established as to recommend Macoun to \"stick to what he conceived to be the truth.\" (3)\n\nI shall now point out to you, in the interests of the country, what Mr. Macoun conceives to be \"truth.\"\n\nIn an appendix (A) from which I have cut out all irrelevant matter,\n\n(1) Page 612.\n(2) Pages 609 and 612.\n(3) Page 612.\nI submit printed expositions of some of Mr. Macoun's re-published meteorological falacies which I circulated a year and a quarter ago, and before Mr. Macoun's work was in print.\n\nI have now to say that all the leading meteorological tables contained in Mr. John Macoun's work referred to, are similarly falsified and grossly misleading, producing in some important instances, when correctly given, as pretended only by him, conclusions exactly the opposite of those he has announced as deducible from the false data and incompatible elements he has aggregated and compared.\n\nI have further to state that all the broad generalizations advanced by Mr. Macoun, as based upon his false meteorological data, are not merely untrue, but deceitfully misleading to investors, projectors of railways, intending emigrants and others.\n\nI find, in addition to these misrepresentations, numerous cleverly disguised impostures of a very serious character, but so palpable when attention is directed to them, that their baneful influence becomes at once apparent.\n\nAn important feature in this reproduction of falacies and untruths by Mr. Macoun, under the patronage of high authority, is the endorsement given to the same and to similar misleading representations, officially distributed to an enormous extent respecting Manitoba and the North-West, previously to the issue of Mr. Macoun's work, and from which it may be properly inferred many cases of individual distress, mutilation of limbs and death have originated.\n\nI notice the introduction by Mr. Macoun into his work of certain misleading paragraphs, dissociated from context, which are stated to emanate from me. These, as they are presented, taken in connection with other matter of kindred character, pointedly lead to the inference that they are designed to impose upon the public for nefarious purposes. Their introduction into the work, \"Manitoba and the Great North-West,\" has compelled me to instruct my solicitor to communicate with the Publishers of Mr. Macoun's Book in regard to this matter.\n\nApart from the commendatory letters from yourself and others, circulated in connection with Mr. Macoun's book, I find in that book, a map bearing your official name, also a dedication to the Governor General, by special permission, and the whole authenticated by Mr. Macoun's official title, all of which tend to convey a false impression of the veracity and honesty of Mr. Macoun's book and his work generally.\n\nTherefore, I have the honour respectfully to ask that you as first Minister, whose commendation of Mr. Macoun, and whose map bearing your official name, directly and indirectly carry vast influence, will be pleased to cause me to be summoned before a Parliamentary Committee, to prove \\textit{in extenso}, and with full liberty to reply to counter statements, and to produce and compel the production of authorities for the same, in the most public manner, my various allegations in the matter.\n\nOr, failing this, according to your judgment, that you will be pleased to take such ample public measures as may be fitted to arrest the circulation, destroy the injurious and untruthful influence,\nand mitigate the injuries and distress certain to arise from the continued issue and circulation of Mr. Macoun's deluding work under the powerful auspices named.\n\nI have the honour to be,\n\nYour Obedient Servant,\n\nHENRY YOULE HIND.\n\nFormerly in charge of the Assiniboine and Saskatchewan Exploring Expedition.\n\n[NOTE.—The voluminous appendix (A) above referred to has already been printed for fifteen months, and distributed among interested parties. It points to the proofs of most of the leading meteorological impostures the scamp Macoun has been practising for years. It is too bulky to re-print here.]\n\nNO. XI.\n\nTHE GOVERNOR GENERAL'S SECRETARY TO MR. HIND.\n\nOffice of the Governor General's Secretary,\nOttawa, 6th March, 1883.\n\nSir:—I am commanded by His Excellency to acknowledge the receipt of your letter of the 26th ultimo, and to inform you that any future communications which you may wish to address to the Governor General must be of a public character and sent through the proper channel, namely, the Governor General's Secretary.\n\nI have the honour to be, Sir,\n\nYour most obedient servant,\n\nF. DE WINTON,\nLt. Col., R. A.,\nGov. Genl's. Secretary.\n\nHENRY YOULE HIND, Esq.,\nWindsor, Nova Scotia.\n\nNO. XII.\n\nREPLY OF MR. HIND TO THE GOVERNOR GENERAL'S SECRETARY.\n\nWindsor, Nova Scotia, March 14, 1883.\n\nTo Lieut. Col. F. de Winton, R. A., the Governor General's Secretary.\n\nSir:—I have the honour to acknowledge the receipt of your favour of the 6th inst. informing me of the reception of my letter of the 26th ult., and that any future communications I may wish to address to the Governor General must be of a public character and sent through the proper channel, namely, the Governor General's Secretary—that is, through yourself.\n\nI do not think it necessary to make any comment on that portion of your communication which would seem to imply that it is possible to assign any other than a public character to the letter I had the honour to address to His Excellency.\n\nBut, lest such a view should even faintly present itself to any one\nelse, I ask leave to quote two paragraphs from my letter which distinctly specify its urgent \"public character.\"\n\n\"The request on the part of Mr. Secretary Lowe brings the selection, preparation and distribution of false and misleading North-West Literature by the Department of Agriculture fairly under the official cognizance of your Excellency, as now herewith represented.\n\n\"There can be no doubt whatever that the interests of the British as well as the Canadian investing and emigrating people ought to insure the closest scrutiny of the matters herein noticed; and, in view of approaching physical, with possibly financial calamities, the earliest unbiased attention and the most public exposition of results adapted to mitigate impending evils.\"\n\nThis misconception on your part leaves me now no alternative but to publish immediately the entire correspondence, in order that it may meet the eye of His Excellency. You will further discover, I feel sure, that this step is a necessary consequence, not merely of the interpretation you choose to put upon my communication, but of the strategic view you were pleased to take some time since of a prior letter, indicated in the margin. (1)\n\nAs to transmitting any further communications of a \"public character\" through yourself, it will also doubtless occur to you that they might not only meet with the unexplained fate noticed in the margin, but the act would elevate you to a dignity superior to that of the Canadian Secretary of State, which might excite unfavourable comment.\n\nWith a view to establish in your eyes the public character of my communication to His Excellency and its importance, I much regret being compelled to press upon your notice the distressing consequences which have arisen from the abuses to which I have de-\n\n(1) LETTER FROM LIEUT.-COLONEL DEWINTON, GOVERNOR GENERAL'S SECRETARY, TO MR. HIND.\n\nGovernment House, Ottawa. 3rd November, 1881.\n\nSIR.—I am desired by His Excellency the Governor General to acknowledge the receipt of your letter of 29th October, 1881, and its enclosures consisting of two printed copies of a letter to myself dated 25th October, 1881, and a printed copy of a letter addressed to the Right Honourable the Earl Granville, Secretary of State for Foreign Affairs, and the Right Honourable the Earl of Kimberley, Secretary of State for the Colonies, dated 2nd August, 1881.\n\nI have the honour to be, sir,\n\nYour most obedient humble servant,\n\nSigned— F. DEWINTON,\n\nLieut.-Col R. A., Gov.Gen's. Secy.\n\nHenry Youle Hind, Esq.,\nWindsor, Nova Scotia.\n\nREPLY FROM MR. HIND TO LIEUT.-COL. DEWINTON.\n\nWindsor, Nova Scotia, 7th November, 1881.\n\nSIR.—I have the honour to acknowledge the receipt of a remarkable letter from you, dated 3rd November, 1881, in which you say that you \"are desired by His Excellency the Governor General to acknowledge the receipt of your letter of 29th Oct., 1881, and its enclosures, consisting of two printed copies of a letter to myself, dated 25th October, 1881, and &c., &c.\"\n\nI have to remark on this communication that my letter of the 29th Oct. was a brief explanatory note to the Marquis of Lorne. The accompanying printed letter addressed to His Excellency the Governor General was for the information of Her Majesty's Government, as stated in the first paragraph of that communication. The duplicate was for the Earl of Kimberley, in order the more readily to convey that information. But how you arrived at the conclusion that these copies were intended for yourself, both being under cover to His Excellency, is one of those subtleties of diplomatic reasoning I shall not attempt to fathom. The erroneous conclusion, however, may be productive of inconvenience, as the matter touched upon in the letter to His Excellency of the 25th Oct. is important and urgent.\n\nI have the honour to be your obedient servant,\n\nHenry Youle Hind.\n\nLieutenant-Colonel F. Dewinton,\nGovernor General's Secretary, Ottawa.\nsired to draw His Excellency's attention. I should gladly have preferred to have been spared the necessity for the following melancholy enumeration, but I know of no other method of meeting your diplomacy, or of arousing a sympathy which appears to be unnaturally dormant, or reviving a sense of manly duty which seems to be dead.\n\nLet me ask you to read the following Death and Mutilation Roll of those who, uninstructed in the insidious severity of North-Western winter's cold, have died as victims, or live as mutilated sufferers; and largely from a withheld knowledge of its dangerous power, and the selfish deceptions and teachings of beguiling men.\n\nYou will please to bear in mind that the instances I present are merely culled from a few unsmothered records which have been permitted to meet the public eye. They furnish but a feeble insight into the measure of that loss and ruin of life which the future may disclose, or careful and conscientious collaboration would even now secure.\n\nYou will reflect while you read, that these instances are the vanguard of that army of victims whose fate I described nearly a year ago, with a sadly close prevision (2) and a painfully exact appreciation of the probable relations between inexcusably manufactured cause and inevitable natural effect.\n\nIncidental Notices of Death, or Mutilation by Freezing in Manitoba and the North-West during Dec., Jan. and Feb., 1882-83.\n\nDecember, 1882.\n\n1.—Frozen on the Prairie—Joseph Robinson, of Brandon—Body found thirty miles from Brandon on the Prairie—Frozen stiff.\n\n2.—An elderly man froze to death close to his tent, on the prairie near where Joseph Robinson's body was found.\n\nJanuary.\n\n3.—On the 23rd January the larger number of the voters in the Birtle District were frozen, some of them seriously. \"It is stated that four-fifths of the 200 who voted in Minnedosa were severely frost bitten.\n\n4.—Winnipeg Hospital is so crowded that some of the patients have to lie upon the floor. A considerable number of the inmates are suffering from frost bites.\n\n5.—Winnipeg, Jan. 26. Over a dozen people will lose limbs, mainly through carelessness.\n\n6.—Mr. G. B. Elliott, of the Brandon Mail, who was brought to the Winnipeg Hospital a few days ago with his feet badly frozen, had both feet amputated on Saturday.\n\n7.—Dr. Delahaye of Portage la Prairie lost several of his toes on the same day.\n\n(2) I respectfully desire to call the attention of those Church of England Clergymen in England to whom I transmitted my letter to His Grace the late Archbishop of Canterbury, to this matter; and particularly to the responsibility attaching to those who cautiously interested themselves in leading uninstructed English Emigrants, in all their unpreparedness, to the dangers of a Manitoban or North-Western winter, by the unguarded distribution of the \"Colonists' Handbook,\" published by the Tract Committee of the Society for Promoting Christian Knowledge.\n8.—A man named Thompson was brought from the Lake of the Woods recently, will lose the greater portion of both feet from the same cause.\n\n9.—Frank Marshall, from near Emerson, caught in a Blizzard—Hands and feet severely frost bitten—it is feared both hands will have to be amputated and possibly one of his feet.\n\n10.—Alfred Bird, from near Portage la Prairie, frozen to death.\n\n11.—Three deaths said to have taken place at Rat Portage about this time, through dissipation and exposure.\n\nFEBRUARY.\n\n12.—Mrs. Spence, of Rockwood—frozen to death. Mrs. Spence, daughter and child, attempted to walk to a neighbour's, three miles off. Mrs. Spence became exhausted and died. The daughter reached the neighbour's with the baby, but her arms and hands were frozen.\n\n13.—James Wylie, a brick-maker of Selkirk—from Scotland in the spring—lost in a Blizzard while on his way to visit a sick friend. Both hands amputated.\n\n14.—Five men from Lake in the Woods—Feet badly frozen, involving loss of feet or toes.\n\n15.—The following extract from a private letter has been permitted to appear in the newspapers—it would be well if more of these sad records were made public to warn the uninstructed and the unwary. The letter is dated \"Pense, North-West Territory,\" Feb. 14, 1883. Pense is on the line of the Canada Pacific Railroad and not far from Regina:—\"I very much regret to report that lives have been sacrificed out here during the cold wave of a few weeks ago, but, after all, it was not so much the fault of the country as that of the unfortunate persons who rashly exposed themselves to its rigors in an open plain. Three men left Maple Creek with a pony and sleigh to attend a dance at Fort Walsh, 28 miles distant. By some mishap the sleigh gave out. They all reached within three miles of the Fort, when two of them gave up in despair, saying that they would 'Pass in their cheques here.' The third man, with dying courage, wrapped his blankets around him, mounted his pony and reached the Fort, giving the alarm. When a party with a wagon reached the scene they found the two men in the embrace of death, wrapped in their snowy winding sheets. During the same blizzard four American deserters perished near Fort Walsh, and were found dead. Another party of three are missing, and beyond a doubt have shared the same sad fate.\"\n\nMARCH.\n\n16.—Mr. F. N. Gisborne, Jr., son of Dominion Inland Superintendent, engaged on telegraph construction in the North-West, had his face badly frozen a few days ago when the thermometer fell to 53 below zero. One eye and the muscles of one side of his face had to be removed.\n\n17.—A man named Bolton had his feet frozen recently while in bed, at his home at Pembina Crossing.\n\n&c., &c., &c., &c.\nI omit, among others, the heart-rending report published about Mr. John Woods and his family, trusting that there may be some mistake in that harrowing recital.\n\nI think I may safely say that there have come under my own very limited observation notices of twenty deaths and many more mutilation of limbs requiring amputation, besides a hundred and fifty cases of severe frost bites, whose termination is not recorded. But what is the spring to reveal in the outlying and remote districts of Manitoba and the North-West? I have no doubt whatever that the extracts I have given lie at the surface merely of the sufferings which have been endured and the deaths which have occurred in the great expanse of country covered by immigrants uninstructed as to the awful severity of the winter's cold of Manitoba and the North-West. This intense winter cold is not exceptional but the normal feature of the Manitoban winter.\n\nIs it not well worth considering what those people are to do who have had their hands and feet amputated; and where the responsibility lies for guiding them to a helpless life by means of painted delusions?\n\nA good many cases of loss of life took place the previous winter which were not noticed by the Winnipeg Press, and therefore did not come within the knowledge of the public.\n\nEven Macoun says, \"During the past winter, (1881–2), a number of individuals lost their lives by not fully recognizing the danger they ran in exposing themselves on the prairie, when a severe wind storm (Blizzard) was in progress.\" (Page 646, Manitoba and the Great North-West).\n\nThis was in the winter of 1881–2 when comparatively few inexperienced immigrants were on the prairies, and yet the Government explorer has to notice the loss of a number of lives through unpreparedness and want of knowledge even then. But no public record of these calamities was permitted to come to the light, all was kept hidden and dark.\n\nSo far back as the Dominion Meteorological Report for 1877 we read (p. XIII) that the Superintendent says, \"I have received an application from Winnipeg for the establishment of a cautionary Storm Signal there, in order to give warning of the probable approach of those terrible 'BLIZZARDS' which sweep over the prairies in winter and cause so much destruction to life and property. It is stated that were such a station established, many lives might be saved, as people would not venture on a journey across the prairies if timely notice were given of an approaching storm.\"\n\nThus you see that the loss of many lives has long been a smothered prairie horror, well concealed from the public view.\n\nNow, Colonel de Winton, please bear in mind, that under the shadow of such a Death and Mutilation Record as I have foretold, presented, and further foreshadow, the requirements of humanity permit me to write to you of things which the ordinary courtesies of life would otherwise entirely preclude. In the presence of that vast emigration to the North-West which is represented as about to take place this year from Europe, gathered and accumulated as it is from all quarters by the authoritative distribution of false and\ndangerous information, the knowledge which I possess of the subject demands that no restrictions of servile civilization or heartless \"Society\" should curb the free expression of opinion respecting cause and effect in such cases of great and accumulating disaster.\n\nThe details of the \"Colonists' Handbook\" published by the Tract Committee of the Society for Promoting Christian Knowledge, were furnished by Sir Alexander Galt. This Handbook tells the English emigrant that in Manitoba \"The weather is not felt to be colder than in the Province of Quebec, nor so cold as milder winters in climates where the Frost, or even a less degree of cold than Frost, is accompanied with damp or wind. The testimony is universal on this point.\" The English emigrating classes know little or nothing about \"30° or 40° below zero,\" but they know what the words I have quoted mean.\n\nLook at the following table, it is taken from the official annual published Returns of the Dominion Meteorological Service. All the temperatures given are below zero. Contrast this table with the statement in the \"Colonists' Handbook\" which I have italicized in the foregoing paragraph. Think of submitting uninstructed and unprepared English Emigrants to the horrors of these below zero temperatures in every month from November to April—six months.\n\n**Below Zero Temperatures.**\n\n*Table showing the Monthly Mean and the lowest Monthly Temperatures, all below Zero, during the years and months named, at Winnipeg, Manitoba, for ten years.*\n\n| November | December | January | February | March | April |\n|----------|----------|---------|----------|-------|-------|\n| Lowest   | Mean     | Lowest  | Mean     | Lowest | Mean  | Lowest |\n| 1871     | -29.0    | -6.8    | -34.0    | -31.0  | -26   | -6.0  |\n| 1872     | -30.0    | -9.0    | -34.0    | -38.0  | -26   | -5.6  |\n| 1873     | -26.8    | -9.8    | -4.7     | -39.4  | -21.3 | -5.6  |\n| 1874     | -32.8    | -37.7   | -6.5     | -40.6  | -38.2 | -5.6  |\n| 1875     | -34.6    | -32.2   | -16.2    | -39.4  | -44.1 | -22.3 |\n| 1876     | -32.7    | -4.8    | -36.5    | -38.6  | -28.0 | -13.1 |\n| 1877     | 0.0      | -1.0    | -7.0     | -47.6  | -28.0 | -13.1 |\n| 1878     | -23.6    | -18.8   | -53.5    | -35.1  | -28.5 | -14.0 |\n| 1879     | -6.0     | -18.8   | -53.5    | -35.1  | -38.1 | -1.0  |\n| 1880     | -22.1    | -0.9    | -42.1    | -28.0  | -1.7  | -35.1 |\n\nYou are reported in the public papers to be directly or indirectly interested in North-West Territory property. This may or may not be true. It is further publicly stated that as soon as your term of service with the Governor General expires, you are going to establish yourself for an indeterminate period in the North-West. Whether this be true or not it has an effect in directing favourable attention to the North-West.\n\nBut, every death on the prairie which can be traced to immigration under the lure of false information is veiled manslaughter. Every pound taken from the Immigrants by similar information is veiled robbery. Every share consciously sold by a promoter or agent in Companies formed under the glozing pictures embodied in the official \"Information for Intending Immigrants,\" is a cruel swindle. Finally, every conscious inveigler of poor, uninstructed and unprepared immigrants to settle without foreknowledge, on free grant prairie farms under the aggregated attractions scattered\nthroughout England by Sir Alexander Galt, is a man fit for the dock.\n\nIn all this, I have no doubt that just and feeling men will agree with me, therefore I am now going to show you that to circulate the inventions of such a charlatan and rogue as Macoun, is to palter with every attribute which makes a man.\n\nI am first constrained to point out with careful detail the reasons which compel me to interfere so strongly in the matter of false representations of Manitoba and the North-West by Government officials.\n\nFirst.—Respecting Summer Climate.\n\nAmong the most important meteorological tables used to illustrate the supposed summer climate of Manitoba and deceive intending Emigrants and Investors, there are those which are based upon my own figures.\n\nI have pointed out in many ways that my figures collected 25 years ago are incorrect in themselves and otherwise unfit for comparison. At the time I published them in my official Reports and in my Narrative I noted some of their infirmities, and subsequently, when discovered, their enormous inaccuracies. Captain Blakeston, R. A., a competent authority, first detected, in 1860, that the figures resulting from Mr. Gunn's observations at Red River, used by me, had not been properly reduced, and were consequently very misleading. This has been explained again and again, but because the summer temperatures for 1855-6, given in my Reports and Book published in 1860, are inordinately high and excessive, being higher than the mean of any subsequent official observations recorded, they supply seemingly authorized data for urging the conclusion, by means of a trick hereafter described, that the summer temperatures of Manitoba are in excess of those, not only of Toronto, but of large portions of various States of the American Union.\n\nThe first comparison was made by the United States Consul, Mr. James W. Taylor, in an official report to his Government sometime about 1862. Mr. Taylor did not heed my caution about the figures I gave for Red River Settlement, but made his comparisons as if my figures were correct. This was quite excusable then, because Mr. Consul Taylor did not pretend to be a scientific man, and there were no special money interests involved to supply a motive for coarse exaggeration.\n\nIn 1863 Mr. Sandford Fleming reproduced Consul Taylor's table of comparative temperatures between one place in Red River Settlement and various towns in different States of the Union, with my uncorrected figures at the head of the list and the basis of comparison. You will find them on page 15 of Mr. Fleming's \"Memorial of the People of Red River,\" printed by order of the Legislature of Canada in 1863, exactly 20 years ago.\n\nSubsequently, a certain Canadian writer took Consul Taylor's comparative table, struck out the names of the towns he gives where the observations were made, leaving the name of the State only, and retained the Consul's conclusions. In consequence of these changes you read on page 159 of Professor Macoun's work entitled \"Manitoba and the Great North-West,\" dedicated by special per-\nmission to his Excellency the Governor General, the following conclusions respecting the Red River drawn from this altered table.\n\n\"It will thus be seen that the summer is warmer than that of \"Northern Illinois, Western Wisconsin, Northern New York or \"Toronto,\" and the table as altered shows it.\n\nBut if you take my corrected figures for Red River Settlement, or make proper comparisons with more recent and accurate data and compatible localities, you will find that they establish exactly contrary conditions to those deduced from the false comparisons presented to the reader by Macoun. The summer climate of Red River settlement comes out greatly below those of the parts of the States named.\n\nAgain, if you examine the figures given by Macoun, you will find my August temperature of one place in Red River Settlement raised from $63^\\circ.8$ to $68^\\circ.03$; this we will suppose is a misprint, because the details when added together, do not give my erroneous mean $67^\\circ.76$, which Macoun has retained, but a still higher mean, namely, $69^\\circ.43$. The summer mean, $67^\\circ.76$, is about three degrees too high, as you will discover by reference to Capt. Blakeson's Report, published in 1860; also to the Smithsonian contributions, where Mr. Gunn's figures are properly reduced. Vol. XXI, 1876, page 4.)\n\nComparison also shows that while introducing as the standard my uncorrected, and exaggerating figures of 1855-56, these men of Science, so-called, by changing the tenths to hundredths have reduced the means of all the other Stations, and selected fresh figures for Toronto.\n\nFor instance, Consul Taylor's original table, copied by Mr. Sandford Fleming in 1863, has the record as given below in the first line; Macoun and his tribe have altered it so that it reads as given in the second line, and then compared it and others with my uncorrected figures for one station at the old Red River Settlement.\n\n| June | July | Aug. | Summer Mean |\n|------|------|------|-------------|\n| 1st—Utica, New York, | 64.2 | 68.5 | 66.7 | 66.5 |\n| 2nd—New York, (State) | 64.02 | 68.05 | 66.07 | 66.05 |\n\nBy this process they not only change the bearing of the observations from a single Town to that of a State, but they reduce the value of the observation by nearly half a degree. In a similar manner they have altered the locality from Muscatine, Iowa, to the State of Iowa, and Kenosha, Wisconsin, to the State of Wisconsin, and then they triumphantly point to the superiority of Red River Summers. These falsified tables are enormously scattered by means of the Departmental North-West Literature, and all the important Meteorological information respecting the North-West thus circulated by the Department is of similar misleading type.\n\nIn the \"Information for Intending Emigrants,\" prepared in the Department of Agriculture itself, my old fallacious summer mean of 1855-56, namely, $67^\\circ.76$, for one spot on Red River is paraded as applying to the Province of Manitoba. In the 5th Edition of this decoy, on page 5 it is stated—\"The summer mean (of Manitoba) is $67^\\circ.76$, which is about the same as that of the State of New York.\" This false statement is persisted in with the Records\nof the Dominion Observatory at hand, and it is stretched from one place to cover a vast Province.\n\nMacoun credits this altered and deceiving table to the Rev. Æneas McDonell Dawson, but there must be some great mystery in the matter, for I find the same introductory words—letter for letter—in the Official Document entitled, \"Information for Intending Emigrants,\" over the name of the Hon. J. H. Pope, published in 1872. You will be able to trace the same paragraphs on page 23 of the brochure published in 1872, and on pages 157 and 158 of Macoun's \"Manitoba and the Great North-West,\" published in 1882, and in many other pamphlets distributed by the Department of Agriculture. They nearly all embody the same corrupt and misleading thing, the same profitable lie.\n\nTherefore, you will not fail to recognize that I am compelled to continue to protest most vigorously against this imposition on the public, because my figures of 1855-6 are made the basis of the false representations. If they were correctly used, they would establish conclusions precisely the opposite to those advanced, and in my opinion save millions of money and hundreds, if not thousands of lives. These figures are made, jointly with falsified winter temperatures, the groundwork for most impudent and false representations respecting the summer and winter climate of Manitoba and the North-West. When pointed out to Sir Alexander Galt, he replies that \"he does not propose to take any notice of the communications to which I refer.\"—(See page 14). But he and his friends continue to entice emigrants; to sell their land 'lots,' and to form Companies. These details were published in the Nottingham Daily Guardian eleven months ago.\n\nYou must admit that this evasion is not only injustice but actually criminal, for Sir Alex. Galt and a host of others possessing landed property, or other interests in Manitoba, enjoy the fruits the imposition secures them; multitudes of trusting persons suffer, and more will be made to suffer for the arrogant and arbitrary swindle. I have made extraordinary efforts for a long time to check this dishonourable injustice to the investing public and to emigrants,—it being a part of much other deception,—but as yet without avail. I intend to go on until I succeed, as a matter which humanity presses.\n\nSecond.—Respecting Winter Climate.\n\nConsul Taylor published in 1878 a letter to the St. Paul's Pioneer Press, in which he made use of certain erroneous tables foisted upon him. I confine myself to the winter temperatures he gives, having discussed the entire table elsewhere. (1)\n\nConsul Taylor gives the Mean monthly winter temperatures at Winnipeg for 1878-9, as subjoined.\n\n| Month     | Temperature |\n|-----------|-------------|\n| December  | 11.97       |\n| January   | 6.10 Below Zero |\n| February  | 12.32 Below Zero |\n\nAnd for Battleford:\n\n| Month     | Temperature |\n|-----------|-------------|\n| December  | 6.48        |\n| January   | 0.45        |\n| February  | 10.25 Below Zero |\n\n(1) See letter to His Grace the Archbishop of Canterbury.\nProfessor Macoun has reproduced Consul Taylor's figures in his \"Manitoba and the Great North-West,\" but he has made the January temperature for Winnipeg $6^\\circ.10$ above Zero, instead of below; the February temperature $12^\\circ.32$ above Zero, instead of below; and the February temperature of Battleford $10^\\circ.25$ above Zero, instead of below. After making these changes he has made the Mean annual temperature of Winnipeg $36^\\circ.67$ instead of $34^\\circ.76$ as the Consul gives it, and the Mean temperature for Battleford $36^\\circ.46$ instead of $34^\\circ.82$.\n\nThe effect of these changes is to make the January temperature of Winnipeg 12 degrees warmer than the Consul has it, and of February 24 degrees warmer than the Consul makes it; also the February temperature of Battleford 20 degrees warmer than the Consul can afford.\n\nNow the Department of Agriculture has copied Macoun's altered figures in the recently issued pamphlet entitled the \"Canadian North-West—Climate and Productions,\" adding the words \"they are as unquestioned as they are unquestionable.\" These are scattered everywhere, leading uninstructed people to suppose that the climate of Manitoba and the North-West is not so terribly extreme, or even abnormally cold as the true records represent. The worst feature of the whole matter is that this unexampled and most cruel roguery is done under the impress of official authority. Strange to say no visible public steps have yet been taken to counteract the injury to the country it is sure to inflict. Every touter and agent selects and dwells upon the most favourable aspect of Manitoba's climate presented to him, and the poor deluded immigrants have to suffer. The country ought to know who told or bribed Macoun to alter these Temperature Records.\n\nIn the public notices heralding the issue of Professor John Macoun's work, it is stated of this trickster that \"For years he has been considered the only reliable authority on the North-West, and not a Government or Colonization pamphlet but quotes from him as proof.\"—(Guelph Herald, April 5, 1882.)\n\nAgain:—\"Professor Macoun and _______ are the only men who could write this book, and whatever they say can be relied upon.\"—(Toronto Weekly Mail, 7th April, 1882.) I leave one name a blank, because I conceive that the owner has been misled in his relation to this scientific scamp.\n\nOnce again:—\"Professor Macoun has long been considered the most reliable authority on this very important section of the Dominion. Both Government and Colonization Pamphlets refer to him, and his statements have never been challenged.\"—(Montreal Gazette, April 4, 1882.)\n\nYou can scarcely be surprised that under such blazoned authority the Canadian Pacific Railway people state in their advertisement respecting the sale of $10,000,000 worth of stock, thus:—\"The Mean Temperature of Winnipeg approximates closely to that of Montreal and St. Paul\"; or that they say in their recently issued and highly illustrated time table that \"The Mean Winter Temperature is almost precisely the same as that of St. Paul and Montreal,\" with other monstrosities of similar character. Naturally they would\nappeal to \"official\" statements if their allegations were questioned. Our own newspapers are misled in the same way, and I have read some melancholy notices of the Government pamphlet, \"Canadian North-West—Climate and Productions.\" But I have had long before my eyes the Death and Mutilation Roll, and the awful consequences which were certain to follow the leading of uninstructed and unprepared people into a Manitoban and North-West Winter as it is, not as it is painted by cruel and designing men.\n\nIt is, I think, quite clear that neither Professor Macoun, the Rev. Eneas MacDonald Dawson, Mr. Lowe of the Department of Agriculture, or any other person whatever, has any right to use my figures, published from 23 to 26 years ago, and then stated to be unreliable, as the basis of impostures in physical geography; or use them for unfittingly describing the capabilities of a vast country for the purpose of attracting emigrants, or for any other similar purpose whatever. I conceive that it is my duty to resist this imposture by every legal means in my power. But when this imposture is associated with such infamous meddling with the figures of others as I have described, and the quoting of original conclusions from altered data, it becomes a crime of high order, particularly when it leads to mutilation and death.\n\nMacoun's Wheat Country.\n\nOne word with respect to Macoun's representation of the agricultural adaptation of the country to produce wheat over a vast area, and the method he employs to show it.\n\nOn page 145 Macoun gives a meteorological table in which he compares the temperatures of Winnipeg, Fort McLeod, Norway House and Fort Simpson, referring the reader to the Meteorological Report for 1878 as his authority.\n\nNow, when you trace out his figures you find that in this, as in all other leading cases, the scamp has compared different selected years, which bear out the view he wants to propagate, and he has given a wrong authority. He has presented the temperatures\n\nOf Winnipeg, for the year 1876, (See Meteorological Report for 1876.)\nFort McLeod, \" \" 1876, (\" \" do. do. )\nFort Simpson, \" \" 1875, (\" \" do. do. )\nNorway House, \" \" 1841 & 1847, (Smithsonian Contributions, Vol. XXII., 1876, page 4.)\n\nYet he refers you to the Meteorological Report for 1878 where you will not find them. And after selecting different years, he says—\"We see that the summer temperature in the North-West Territories is exceptional.\"\n\nOn page 200 of his book, he applies this \"exceptional\" table to prove the adaptability of an immense area in the North-West Territories as suitable for the cultivation of wheat, with this monstrous generalization, \"Now in the tables given in the chapter on climate, it is shown that in every part of the Territory the temperature exceeds this.\" (Sixty degrees for July and August.) On page 141, he says his remarks apply mainly to an area of 667,600 square miles—and to prove his conclusions for the greater portion of this area, say ten times as big as England, he gives you the incompatible temperatures of four places in three different years.\nThere are plenty of passages in the book which show that when he wrote that and other statements he knew that he was lying. Now, who bribed him to lie?\n\nThe title of Macoun's Book is \"Manitoba and the Great North-West.\" This title appears at the top of every even page. But in furnishing his readers with the names of \"respectable and intelligent farmers in the North-West,\" as wheat growers, he has selected his witnesses from residents in Manitoba.—(p. 206, 207). He has repeated the outrage I have long since pointed out as perpetrated by the deceiving author of the Government pamphlet, \"What Farmers Say.\" Who bribed these rogues thus to deceive the public? Mr. Lowe ought to know.\n\nNo man who possesses a medium knowledge of physical geography and who would submit to public cross examination on the subject, or cross examination in the witness-box, dare assert that five-sixths of the area assigned by Macoun to the profitable cultivation of wheat, as far as our present knowledge goes, are not made extra hazardous by climate, or wholly precluded by water, or rock, or morass, or nature of the soil.\n\nYou can prove anything you like about climate, within certain limits, by adopting the process of selection. This charlatan, Macoun, pursues this process in all important cases of illustration he advances respecting his falacies about Manitoba and the North-West.\n\nTake Peace River, and remember Macoun's description of the whole of the Peace River Country, (page 101 Handbook for Emigrants) and of Dunvegan and its \"crops.\"\n\nThis is the official record of the mean monthly temperature of Dunvegan for 1880, you will find it in the Dominion Meteorological Report for that year:\n\n| Year, 1880. | Fort Dunvegan—Mean Monthly Temperatures. |\n|------------|----------------------------------------|\n| January    | 30.5 Below Zero. Lowest Temp. -62.4    |\n| February   | 3.6                                    |\n| March      | 9.0                                    |\n| April      | 29.3                                    |\n| May        | 49.2                                    |\n| June       | 56.8                                    |\n| July       | 63.1 (Summer Mean 58.3.)                |\n| August     | 55.6 (Mean of July and August 59.0.)    |\n| September  | 44.6                                    |\n| October    | 39.3                                    |\n| November   | 19.0                                    |\n| December   | 16.5 Below Zero. Lowest Temp. -21.8     |\n| Year       | 27.90                                   |\n\nLook at the Summer Mean;—the Annual Mean four degrees below the freezing point of water—the minimum temperature ranging from 21° to 62° below Zero, and continuing through November to April. The Mean 59° for July and August, and Macoun's great invention about 60° prevailing everywhere. Shame on the men who would parade the Peace River Country as a farming or pastoral region clamoring for railways and people.\n\nThink of vast farming in a country where the mean annual temperature falls four degrees below the freezing point of water. The\nsubsoil must be permanently frozen, if this mean prevails throughout a brief aggregate of years.\n\nNow let me point out to you an extraordinary association of events which has been disclosed, and may lead to important results.\n\nAbout the time I was pointing out in England to the English public in the spring of 1882, through the Nottingham Daily Guardian, and in other ways, some of the leading impostures I have described, certain Canadian newspapers were heralding the appearance of Professor Macoun's work in terms of unqualified laudation.\n\nSir Alexander Galt, although pressed by me in language which a knowledge of his complicity in heinous fraud could alone justify, not only forbore to take any steps to arrest the re-publication under the highest auspices of these impositions on the public, but he refused in writing to \"notice my communications,\" from May 1881 to April 1882. (See page 14). He went to Canada early in May, 1882, and permitted Macoun's work to appear without modification. He allowed, after they had been pointed out to him, the falsehoods of this rogue to be reproduced under the auspices of the Governor General of Canada by special permission.\n\nIs not Sir Alexander Galt morally, if not legally, responsible in a large measure for the formation and subsequent ruin of some of the Canadian Colonization Companies? Is he not responsible for the present condition of the Duke of Manchester's Canada North-West Land Company, (including the \"Land Corporation of Canada\") whose prospectus was issued last July, and whose shares, with 80 shillings paid up, are now quoted (March 12th) in London at 59s. and in Montreal at 56s.? Is he not morally responsible for much of the mutilation, if not some of the deaths, which have occurred in Manitoba and the North-West through the unpreparedness of uninstructed immigrants arising from the distribution of information known at the time to be false? Witness the \"Colonists Handbook.\"\n\nThese are questions which a competent jury can decide when the proper time arrives.\n\nIt is reasonable to suppose that if Sir Alexander Galt had taken the manly course of looking at and acting according to my statements, many financial disasters would not have occurred, for public exposition of the false data, upon which the adventures were based, would have prevented their organization. Hudson Bay Company's stock would not have bounded up to 39 and sank to 29. It is equally clear that the emigrants forewarned, would have been in great part deterred, or forearmed. But to have announced the impostures with authority, would have prevented Sir Alexander Galt and his friends from securing the proceeds of their special adventures. It would have spoiled their game.\n\nOne word about Mr. Consul Taylor. This gentleman is a pleasant writer, very fond of dabbling in temperatures and drawing astounding conclusions from any thermometric records handed to him which may be interesting to his numerous friends. He occupies a prominent official position and he has long been made the speculators cat's-paw.\n\nBeing an elderly gentleman of very amiable character, his friends\nsupply him with figures, the Consul draws his conclusions and his marvellous discoveries are bruited abroad under the imposing influence of his official name and his alien position, which is represented as a guarantee of his \"unquestioned and unquestionable\" accuracy.\n\nThere is now no \"Meteorologist\" in Europe or America upon whose name adulation has been showered from sordid motives, so well known among the emigrating classes in England as that of the United States Consul Taylor. This has been effected by the literature circulated under the auspices of interested parties, particularly Sir Alexander Galt and the Canadian Department of Agriculture; also the infamous delusions perpetrated by Col. Dennis.\n\nThe United States Government have done everything that comity requires in such a matter, as you will discover by reference to my letter addressed to the late Archbishop of Canterbury, entitled \"An Outcome of the Lambeth Conference.\" The United States Government, through the United States Signal Service, have directed all the attention needed to the meteorological imperfections of their Consul—and I have shown you what Macoun has done and the writer of the Departmental Pamphlet, entitled \"Canadian North-West—Climate and Productions\"—with these same imperfections—they have immensely magnified them, and then said they were reliable.\n\nYou are aware that prior to the reception of your letter to which this communication is a reply, I dispatched two registered letters to His Excellency the Governor General, dated respectively March 5th and 6th, (Nos. VI and VII), in which I have adverted to new and important matter.\n\nI noticed in the first of these communications the occurrence of numerous other grave misrepresentations in Professor Macoun's work. These are misleading reproductions of falsifications previously pointed out in publicly circulated printed documents.\n\nAll the leading tables prepared by Macoun and his conclusions therefrom are nothing less than the concoctions of a scientific rogue. They are designed to mislead unread and ignorant people respecting the physical characteristics and features of an immense area of country it is sought to present before the public eye as merchantable, and a suitable field for profitable commercial speculations and investments. These rascally inventions are paraded under the authority of high names and official stamp. They are nothing but traps for the unwary and unconscious believers in the honesty of high sounding or well known names. They are circulated to an immense extent, with knowledge of their criminality, by Sir Alexander Galt throughout the British Isles, and they will prove disastrous to numerous investors. (1).\n\nI fear that the trusting people who have not time or bent to look into these matters will have to suffer financially for this roguery in addition to the sufferings of the Immigrants.\n\nThe heartless speculators, promotors, leeches, parasites and \"pa-\n\n(1) Your attention is particularly directed to the list of letters given in the accompanying Appendix B, which relate to Sir Alexander Galt's operations in England, embody warnings, and point out fraudulent misrepresentations. These letters will be available at the proper moment.\ntricts\" will be all right, but it will be at the cost of future skeletons in the closet.\n\nPerhaps the worst financial feature in the whole matter, arising from the inhumanity of the design and the gilding of the proceedings, will be found in the effect produced in Europe on Canada as a whole, when the Bubble finally bursts.\n\nThe circulation of the purchased frauds manufactured by Macoun, Dennis, Bell, Begg and others, in Emigration Pamphlets, in the Proceedings of distinguished Societies and by Religious Incorporations has been enormous, amounting to millions of copies.\n\nThe writings and delineations of these false witnesses have been permitted to invade sacred precincts under atrocious and sordid influence. All this must be stoned for, for this vicious work is associated with financial intrigues, whose temporary success confers on a few, vilely won distinction and splendour, but whose ultimate failure is ruin to tens of thousands, accompanied by a death and mutilation roll of terrible import.\n\nI think there can be no doubt that the loss of life from freezing, and the mutilation of limbs from the same cause, among the immigrants in Manitoba and the North-West since November and up to the middle of March, will considerably exceed the losses at Tel-el-Kebir, which gave Egypt to the civilization of our conquering race.\n\nI fear that before the winter closes five hundred will scarcely cover the list of killed and wounded in the unequal warfare with Manitoban and North-Western Winter's cold by unprepared and uninstructed immigrants. And when you think of the condition in which many thousands were described to be living—in tents—throughout the Souris and the Qu'apelle country, during the lovely but fleeting autumnal September and part of October, you can not think this estimate too high.\n\nWinter came, as it always comes there, with a sudden and inexorable grip. Think of a mean zero temperature for four months in tents, or small boarded dwellings, or hastily built log, or turf huts, and very little dry fuel available within easy reach, or near at hand. All this, with the temperature often sinking to $30^\\circ$, $40^\\circ$ and even $50^\\circ$ below zero, when mercury freezes, trees crack with a sharp report, ponds and small lakes and brooks become solid; while insufficiently protected human life, with all its aspirations and knowledge, sinks a succumbing victim to cold it cannot escape.\n\nThe present outlook in the Souris and Qu'apelle country is harrowing; and no violence of invective, or furious rage of speculator, or declamation of touter will conceal the ruin. The revelations of private correspondence must come to the light, and open inquiry disclose the reason for, and the agents of, this brutal inveiglement.\n\nYou will bear in mind that I published in August last, with much illustrative detail, certain conclusions based on acknowledged physical premises, which conclusions showed that a large number of the immigrants who had gone to Manitoba and the North-West Territory in 1882, must, in the natural course of events be mutilated or frozen to death. I pointed out that this result was inevitable in consequence of the misrepresentations made to them and\ntheir unpreparedness to meet winter cold both intense and assured. I besought special attention to the subject, and begged that the emigrants might be cared for. In order to draw attention to the matter I went so far as to style these deluded people in advance, \"The Murdered Victims of Protected Fraud.\" (See page 92—Emigration, Land and Railway Frauds—An Outcome of the Lambeth Conference of 1878,\" being a letter addressed to the late Archbishop of Canterbury concerning the \"Colonists' Handbook\").\n\nThe roguery of Macoun, the dreadful laxity of Mr. Lowe, and the black responsibility of Sir Alexander Galt and others, will begin to dawn upon you soon.\n\nYou have to consider the present year. Mr. Lowe is alleged to have stated in his recent evidence before the Colonization and Immigration Committee that the prospects for European emigration this year \"were very bright.\" The European Agents report an enormous emigration to Canada, as the result of their unhallowed efforts. In addition we have the remarkable proposition by Mr. G. Stephen, President of the Canadian Pacific Railway. Mr. G. Stephen's letter in the London Times of March 2nd, (Mail), I relegate to a foot-note, (1) merely remarking that to send the 50,000 of the class of Irish spoken of, to the Canadian North-West, would be equivalent to sending one-fourth, or 12,500, to mutilation or probable death from freezing before next Christmas.\n\nAs to the 160 acres \"of the very best quality of farming land free of cost,\" I can only say that Mr. George Stephen should be put in the witness box and questioned exhaustively about his Canadian North-West Literature distributed in England, describing the soil, his own Official Memorandum describing the climate, and the authorities he can produce for the cruel lies he has told and sanctioned.\n\nIn December, 1881, Mr. George Stephen was furnished by me with a printed letter (registered) elucidating the falsehoods of Professor Macoun, and pointing out in detail the proofs of the rogueries of this charlatan. Mr. George Stephen was further cognizant of my action in London during April and May, 1882, in relation to the Mansion House Committee for the \"Emigration of the Unem-\n\n---\n\n(1) IRISH EMIGRATION.\n\nTo the Editor of the Times,\n\nSir,—Will you permit me to offer a practical suggestion with reference to the deplorable condition of a large portion of the small farmer class in Ireland, which Mr. Trevelyan describes in his speech in the House of Commons last night in the following words:—\"The condition of the poorest class of farmers was more deplorable than that of any class of people living in any civilized country. There were, he said, \"67,000 farms of from one to five acres, and 160,000 from five to 15 acres; and in the latter case, in many cases, there were not more than from two to two and a half acres of arable land.\"\n\nAssuming that these unfortunate people are really farmers accustomed to work at the cultivation of the land, and that they are able and willing to work at it, I would suggest that 10,000 of them, with their families, say, 50,000 in all, be sent out to the Canadian North-West and landed there during the months of May and June, at the expense of the Government. If that were done, I think I am safe in saying that every family could be provided with 160 acres of the very best quality of farming land free of cost, and that arrangements could be made with the railway, land, and colonization companies interested in the settlement of the country, by which each farmer would be advanced the capital necessary to build a small house and to give him a start in his new life. I am, Sir, yours faithfully,\n\nGEO. STEPHEN,\nPresident of the Canadian Pacific Railway Company.\n101, Cannon-street, E.C., Feb. 26.\nployed,\" and the correspondence which passed. (1) Mr. George Stephen permitted himself to ignore all these representations, and to hug and profit by the delusions he so persistently propagates.\n\nIn his moments of sickness and sinking health, when courage and self-reliance begin to fail, and fears and doubts to take their place, Mr. George Stephen will probably see the spectres of many a frozen eye ceaselessly fixed on him.\n\nI have now to point out to you a most important fact connected with the method pursued to deceive emigrants and investors in England. There is pasted or inserted in most of the Government Pamphlets, issued by the Government Agents, a yellow slip of paper on which the following words are printed:\n\n\"The Canadian Government, with a view of affording Correct and Reliable information to intending Settlers and of giving them every facility in obtaining it, have opened commodious offices at 15 Water Street, Liverpool, where Statutes, Government Returns, Sessional Papers, Reports on Trade, Maps, Specimens of Grain and other Products, Samples of Soil, and in fact, all conceivable matters of interest to visitors to the Dominion, whether with view to permanent settlement or not, may be consulted and inspected. The Government Agent of the Dominion will also be ready to give advice and assistance.\"\n\n&c., &c., &c., &c.\n\nThe slip is inserted in those atrocious delusions—\"What Farmers Say\"—\"A Hand-book for Emigrants,\" &c., &c. In these documents you will find Macoun's falsehoods, and false meteorological tables, &c., &c., printed for the emigrant's and investor's guidance. In the mazed and embarrassing Sessional Papers to which the Emigrant is referred for proof—he will find that many of the leading statements thus advanced are FALSE. (2)\n\nYou will further observe that in my letters to Sir J. A. Macdonald (No. X), and to His Excellency the Governor General (No. VII), I have pleaded for a public examination to enable me to prove this statement, and thus assist in removing the causes of sore distress in many ways to our fellow-countrymen.\n\nSuppose, if it be possible, that this reasonable request be not granted, and, as in the case of Sir Alexander Galt, it elicits the response, \"no notice will be taken of your communications.\" What will the public think of the matter? Is there any other conclusion possible, than this—All my statements are true; the men implicated dare not face the inquiry; immigrants and investors must continue to suffer in order to shield them; Mutilation and Death must be upheld in their sway for fear of breaking the wings of half a dozen Harpies.\n\nThe comments of a portion of the English press on some of the abuses and perversions alluded to have been noticed in Canada and in the Canadian House of Commons. Therefore it is quite unne-\n\n(1) See printed \"Correspondence relating to the Emigration of the Unemployed.\"\n(2) For a tolerably complete outline of these deceptions, with references to the Sessional Papers which reveal them, see my letter to His Grace the late Archbishop of Canterbury, entitled \"An Outcome of the Lambeth Conference.\" A much fuller account is found in the annotated copy—and numerous illustrations in the various letters enumerated in the communications referred to in this letter.\ncessary for me to point out the very obvious termination of those adventures which are largely based upon the gross misrepresentations already publicly paraded and specially pointed out. Neither is it necessary to allude to the very inconvenient and harassing position which may become the lot of some promoters.\n\nIt is known in properly informed circles, that Manitoba and the North-West embrace a tolerably well described and defined area of land fitted for present farming purposes by a gradual process of cautious settlement, consistent with the extreme character of the climate and the very scanty fuel and water resources of the prairie portion of the country suitable for that purpose.\n\nBut the most grievous imposition or crime a scientific man, professionally employed by the State, can commit in his line of business, is to falsify scientific data relating to physical geography, suppress, distort and misapply information, and then authoritatively publish conclusions therefrom, in order, regardless of dangerous consequences, to influence the life actions of a multitude of uninstructed people and unduly promote gigantic commercial speculations.\n\nThis has been done by Macoun; in a less degree by other Government employees.\n\nTo accept and propagate, with consciousness of their defects, these manufactured frauds, and to act upon them for sordid purposes or any purpose whatever, thereby endangering human life, limb or property, is to become an accomplice. (Particeps criminis).\n\nThis is the position of Sir Alexander Galt and some of his allies.\n\nI make this statement and charge after nearly two years continuous labour in fruitless endeavors to stay the progress of the deceptions faintly outlined. Deceptions which have already resulted most mournfully and disastrously to many, and if continued, promise distress, mutilation or death to many more.\n\nMy efforts, persisted in ceaselessly throughout the period named, under numerous forms of discouragement and opposition, having been met with scornful indifference, culpable diplomacy or direct refusal, compel me in the interests of humanity publicly to press them in the manner now presented.\n\nI say in relation to Macoun, that it seems to me to be the same of cruelty, further to permit this poor trickster's impostures to influence the public under official glamour. They cannot fail to lead more uninstructed immigrants to mutilation or death, and more confiding investors to probable ruin, merely for sordid purposes, or, to save from exposure and obloquy those who have encouraged him in his nefarious work and used his perversions and falsehoods to increase their wealth. I am advised that this kind of co-operative work is equivalent to COMPOUNDING FELONY; and when this desperate stratagem leads to further destruction of life or limb by neglect, it becomes exceedingly grave.\n\nTherefore, I have to press upon you the absolute necessity for communicating, without delay, my letters to His Excellency the Governor General, in order that he may exercise that just and wise\ndirection in the matter which his humanity will suggest and his uprightness secure.\n\nI have the honour to be,\n\nYour Obedient Servant,\n\nHENRY YOULE HIND.\n\nFormerly in charge of the Assiniboine and Saskatchewan Exploring Expedition.\n\nPOST SCRIPT.—Since the foregoing was written I find the following notice in the Montreal Witness of the 16th March, 1883. It gives special force to much of the matter in my letter:\n\nOTTAWA.\n\n(Special to the Witness, March 16.)\n\n\"Mr. Richardson and Mr. T. DeWinton, brother of Col. DeWinton, military secretary to His Excellency the Governor General, leave to-night for the North-West to take up farming lands. Col. DeWinton is interested in the project also.\"\n\nYou will observe that the repetition of the announcement of your personal interest in North-West Speculations gives a colour to your position which requires your special attention.\n\nI learn from the papers that Mr. Peter White, M. P., is chairman of the Committee on Immigration and Colonization. I presume that my letter (No. III) to the Chairman of this Committee for the information of its members, with enclosures, has been communicated to that important body; also that Mr. Lowe, in accordance with my request, (No. IX.) has brought the general subject under the notice of the Committee. The urgency and importance of the matter demand immediate action.\n\nI see from the papers that two more frozen bodies have been found in the snow, one near Winnipeg and one near Selkirk.\n\nH. Y. H.\n\nNOTE ON THE RED RIVER FLOODS.\n\nI append to this letter a note respecting a statement reported to have been recently made in Scotland by Sir Alexander Galt, in relation to the Red River Floods.\n\nThe statement is quoted in the St. John Telegraph of March 9th, 1883, as appearing in a Scottish paper.\n\nSir Alexander Galt is reported to have said, \"There had been extensive floods in the Red River Valley, which is a very exceptional circumstance. They have not occurred for twenty-five years before, and are not likely to occur again.\"\n\nI give you now the facts of the case.\n\nThe following are the recorded great flood years in the Valley of Red River—some authorities are given on page 393, Vol. II, of my narrative of the Canadian Exploring Expeditions, published in 1860. These are again found with startling measurements by competent engineers, and with important additional data in the official Report of Mr. Sandford Fleming for 1880, pages 264 to 265. Numerous details were published by me, over my name, in the St. John Telegraph of Feb. 2nd, 1876, under the heading, \"Considerations affecting the Canadian Pacific Railway.\"\n\n| Flood Years | Period of Interval |\n|-------------|-------------------|\n| 1776        | On the authority of Mr. Nolin. |\n| 1790        | Indian Tradition. 14 years. |\n| 1809        | Indians living in the Settlement when Ross wrote. 19 years. |\n| 1826        | Missionary Register, Dec. 1836. 15 years. |\n| 1859        | Notes on the Flood by the Bishop of Rupert's Land. 26 years. |\n| 1861        | Living Residents. 9 years. |\n| 1880        | Living Residents. 21 years. |\nThese flood years do not include the years of minor floods. Some of these are noticed in Mr. Fleming's Report.\n\nHis Grace Archbishop Taché is perfectly correct in his illusions to Flood \"Records of this country\" in his letter to the Rev. Father Nugent, because the country had no \"records,\" in the proper sense of the term, which would go back to 1776. But in Physical Science, well authenticated tradition, strengthened by geological and geographical evidence, is a record which must be received respecting natural occurrences.\n\nEverybody should read the Archbishop's description of the winter climate of the Prairie Region in His Grace's \"Sketch of the North-West of America.\" It would open men's eyes. His Grace says, \"Winter has arrived in the beginning of November and continues more or less in April, and, Great God! what winter! One must travel in the midst of these vast plains and camp out during entire weeks in the midst of these snowy oceans to understand how scarce wood is there, and yet how necessary it is.\"\n\nThese \"snowy oceans\" this year, in the region of the Grand Coteau de Missouri, and over the country which drains into the Souris, are unusually storm tossed. The excess of precipitation over an average of years in the extreme North-West of the United States for the months October, November, December and January, amounts to nearly two inches of water. February, March and April may increase instead of diminishing this excess. Should the advent of spring be sudden, there seems to be no escape from a devastating flood. The Geological Records on the Souris, the Assiniboine, and Red River, the water marks on the South Antler Creek and in the Lower Qu'apelle, all tell, like writing on the wall, what is to be the fate of Winnipeg; sooner or later—this year or the next—or the next. You will find marked on my map of Red River Settlement, published in my Report for 1867, the approximate limits of the area (in the parish of St. Andrew) never known to be devastated by floods.\n\nWe find from the authorities quoted on page 31 of the \"Canadian North-West—Climate and Productions,\" that the lateral expansion of the flood wave has been effectually prevented by raising the Railway embankments. This is equivalent to saying, 'everything has been done to concentrate the full effects of future flood waves on the city of Winnipeg, situated in the throat of the artificial funnel down which these flood waves must discharge their waters.' In 1826 the level of the flood waters above the prairie north of St. John's Church, before limiting embankments were made, was eight feet, north of Kildonan Church seven feet, at Point Douglas seven feet, at the mouth of the Assiniboine five feet. (See page 269 Canadian Pacific Railway Report, under date 24th Sept., 1879). What will now be the height and force of floods within the confining embankments?\n\nAPPENDIX B.\n\nLETTERS REFERRED TO IN THE FOOT-NOTE ON PAGE 32:\n\n1.—To Frederick Young, Esq., Hon. Sec., Royal Colonial Institute, London, England, dated Windsor, Nova Scotia, 13th Dec., 1881.\n2.—To the same, dated 14 Dec., 1881.\n3.—To Sir Alexander Galt, dated 14th Dec., 1881.\n4.—To the Duke of Manchester, Vice President Royal Colonial Institute, dated 14th Dec. 1881.\n5.—To Robert G. Webster, Esq., L. L. B., dated 14th Dec., 1881.\n6.—To Fred. Young, Esq., Hon. Sec Roy. Col. Inst., dated Windsor, Nova Scotia, Feb. 3rd, 1882.\n7.—To Fred. Young, Esq., Hon. Sec. Roy. Col. Institute, dated Inns of Court Hotel, London, March 22nd, 1882.\n8.—To the same, dated Inns of Court Hotel, London, March 25, 1882.\n9.—To the same, dated Inns of Court Hotel, London, March 25, 1882.\n10.—To the same, dated Inns of Court Hotel, London, March 29, 1882.\n11.—To S. W. Silver, Esq., Member of the Council of the Royal Colonial Institute, London, dated Inns of Court Hotel, March 31, 1882.\n12.—To S.W. Silver, Esq., office of the \"Colonies and India,\" Sun Court, 67 Cornhill, London, dated Inns of Court Hotel, London, March 31, 1882. (Mr. Silver is not only a member of the Council of the Royal Colonial Institute but publisher of their Journals).\n\nThe letter to the late Archbishop of Canterbury, entitled \"An Outcome of the Lambeth Conference,\" foreshadowed in detail, in July, 1882, the nature of some of the calamities which happened in December, 1882, and during the past winter in Manitoba and the North-West. It is an octavo pamphlet of 118 pages. An annotated edition is nearly ready for the press, and may be presented to the public during the ensuing summer, with sufficient verification of the very obvious conclusions from the data presented.\n\nThe correspondence relating to the \"Emigration of the Unemployed,\" is also embodied in an \"Outcome of the Lambeth Conference.\"\n\nSome of the letters enumerated in the foregoing list referred to the contemplated operations of the Duke of Manchester, Sir John Rose and others, in relation to the formation of North-West Territory Land Companies, pointing out the Frauds and the inevitable GULF if continued.\n\nThe attention of the Rev'd Mr. Bridger, of Liverpool, and the Rev'd Mr. Panckridge, of London, is particularly directed to a consideration of the opportunities they have possessed for correctly informing themselves, how they have used those opportunities, of their relation to the \"Colonists' Handbook,\" and of the condition of Frost-Mutilated Emigrants influenced by them.\nCONTENTS.\n\nReasons for Publication..................................................................\n\nNo. I.—MEMORANDUM from Mr. John Lowe, Secretary to the Department of Agriculture, to Mr. Hind requesting to be furnished with copies of letters relating to Manitoba and North-West Territory Frauds. Also—Extract from printed letter addressed by Mr. Hind to the Secretary of State enumerating prior letters on the same subject and announcing additional fraudulent representations and alterations of figures respecting the Winter Climate of Manitoba and the North-West, in documents circulated by the Department of Agriculture..........................................................\n\nNo. II.—Mr. Hind to Mr. Lowe.......................................................\n\nNo. III.—Mr. Hind to the Chairman of the Committee on Immigration and Colonization..........................................................\n\nNo. IV.—Mr. Hind to His Excellency the Governor General..............\n\nNo. V.—Mr. Hind to the Hon. the Minister of Agriculture..................\n\nNo. VI.—Mr. Hind to His Excellency the Governor General respecting the dedication of Professor Macoun's work, entitled \"Manitoba and the Great North-West.\"............................................\n\nSir Alexander Galt to Mr. Hind.....................................................\n\nNo. VII.—Mr. Hind to His Excellency the Governor General..............\n\nNo. VIII.—John Lowe, Esq., Sec. of the Department of Agriculture, to Mr. Hind..........................................................\n\nNo. IX.—Mr. Hind to Mr. Lowe.....................................................\n\nNo. X.—Mr. Hind to the Rt. Hon. Sir J. A. Macdonald........................\n\nNo. XI.—The Governor General's Secretary to Mr. Hind...................\n\nNo. XII.—Mr. Hind to the Governor General's Secretary enumerating a preliminary Death and Mutilation Report of immigrants in Manitoba and the North-West during the present winter, and pointing out the cause and the consequences..........................................................\n\nNote on the Red River Floods........................................................\n\nAppendix B..................................................................\n\nERRATA.—On page 8, first line in foot-note, for \"Among the Dead Sea fruit of cozening the public servants,\" read \"Among the Dead Sea fruit of cozening public servants.\" On page 10, a few typographical errors, easily recognized, will be seen to have escaped correction.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/manitobaandnort00goog.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 71698, "total-output-tokens": 26789, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 302, 3], [302, 679, 4], [679, 3691, 5], [3691, 8002, 6], [8002, 10886, 7], [10886, 13568, 8], [13568, 16058, 9], [16058, 19017, 10], [19017, 21462, 11], [21462, 24661, 12], [24661, 27926, 13], [27926, 30634, 14], [30634, 33541, 15], [33541, 35918, 16], [35918, 38085, 17], [38085, 41275, 18], [41275, 43583, 19], [43583, 46739, 20], [46739, 48790, 21], [48790, 52732, 22], [52732, 55673, 23], [55673, 58402, 24], [58402, 61546, 25], [61546, 64954, 26], [64954, 68039, 27], [68039, 71247, 28], [71247, 74313, 29], [74313, 77475, 30], [77475, 80570, 31], [80570, 83650, 32], [83650, 86772, 33], [86772, 90009, 34], [90009, 93212, 35], [93212, 96970, 36], [96970, 100248, 37], [100248, 103297, 38], [103297, 106387, 39], [106387, 109482, 40], [109482, 111774, 41], [111774, 114279, 42]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]