[{"id": "644bb13ad11ec732b8670749bf59f2303d2b4dcf", "text": "THE TIMES.\n\nMOOSE JAW, N.W.T., JANUARY 24, 1890\n\nFor Bargains in\nPLUSH GOODS\nof all kinds go to\nFRED G. HEALY\nA Large Assortment to choose from.\nJAMES BRASS,\nContractor and Builder.\nPlans and Specifications Furnished.\nSASHES, DOORS, FRAME & BLINDS, etc.\nFor Sale by:\nG.M. ANNABLE\nImporters and Dealers in\nBrass Fixtures & Carriage Harnesses\nNEW LIVERY.\nFUR GOODS.\nBargains in Remnants.\nT.W. ROBINSON,\nMain Street, Moose Jaw\n\nClearing Sale!\nDRY GOODS!\nThe balance of my Stock of Dry Goods Will be sold at about\nCOST!\nEXCEPT A FEW STAPLES.\nR. BOGUE,\nE.A. BAKER & CO.,\nGRAIN MERCHANTS\nWHOLESALE & RETAIL — DEALERS IN —\n\nGROCERIES,\nPROVISIONS,\nFLOUR AND FEED,\nHARDWARE, STOVES, PAINT, OILS, ETC.,\nESTABLISHED 1863.\n\nLIVERY, FEED AND SALE STABLES,\n\nHORSES, PONIES AND CATTLE\nFOR SALE,\nBALED HAY ALWAYS ON HAND.\nWM. WALSH\nMAIN STREET\n\n---\n\nONE WORD.\nCall at the\nCity Drug Store,\nTO DIARY\nFOR FREE\nA Full Line of School Books,\nSchool Bags,\nStationery,\nJUST ARRIVED.\n\nDO YOU LIKE A GOOD SMILE?\nVisit the Falstaffian Trade\n\"Dr. Eadie's Stove Pipe,\" \"Buckingham\"\nFREE DELIVERY EVERYWHERE\n\nSEE OUR\n25c. WINDOW.\n\nGent's Ties 25 cents.\nGent's Broaches 25 cents.\nGent's Fine Wool Socks 25 cents.\nGent's Felt Mitts 25 cents.\nChildren's Wood Mitts 25 cents.\nChildren's Wool Boots 25 cents.\nChildren's Fur Caps 25 cents.\nThese Goods are all Worth from 30 cts to $1.00\n\n---\n\nARTESIAN WELLS.\nAt the annual meeting of the Moose Jaw Board of Directors, Mr. Spence was elected president of the board, and Mr. Mowat was re-elected as vice-chairman of the same. Mr. Spence will serve as chairman of the board during the current year, while Mr. Mowat will continue as chief of the organization.\nThe election took place after a short discussion of the merits and qualifications of each candidate. Mr. Spence was unanimously elected to the position as representative of the Moose Jaw Board of Directors, and Mr. Mowat was elected as their chief officer.\nMr. Spence, who has been connected with the Moose Jaw Enterprise since its inception, is well known throughout the community for his sound judgment and ability as an administrator. He has been actively engaged in the affairs of the board for many years, and has served as chair man during several terms of office.\nMr. Mowat, who was elected as chief of the board, is also well known throughout the community for his integrity and honesty. He has been engaged in the affairs of the board for many years, and has served as chief of the organization for several terms of office.\n\n---\n\nFINANCIAL PROBLEMS.\nThe Editor of The Times has expressed a wish to see more emphasis placed on the importance of the Canadian dollar. He points out that the value of the dollar is the key to the success or failure of Canadian industry, and that the Government should be more attentive to the needs of commerce and trade.\nIn response to the Editor's request, the Board of Trade has issued a statement indicating that the Canadian dollar is in a strong position, and that Canadian industry is in a good position to meet the demands of the world market.\nThe Board of Trade has stated that the Canadian dollar is now worth $1.00, which compares favorably with the dollar's value of $0.96 at the end of last year. This increase in the value of the dollar is due to the favorable trade balance between Canada and the United States, as well as the world demand for Canadian goods.\nThe Board of Trade has also stated that it is working closely with the Canadian government to ensure that the dollar remains strong, and that Canadian industry will continue to prosper.\n\n---\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/MJA_1890012401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 2, "total-input-tokens": 3228, "total-output-tokens": 989, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3575, 1], [3575, 3575, 2]], "primary_language": ["en", "en"], "is_rotation_valid": [true, true], "rotation_correction": [0, 0], "is_table": [false, false], "is_diagram": [false, false]}}]