[{"id": "09217f8ae59621ae3f53973649b9523a03a59942", "text": "Watches and Clocks\n\nGIVEN AWAY!\n\nRead this—it will pay you—as an inducement to our customers to pay OASHE and save us discounts and Book-keeping, we will give the following prizes on all goods purchased for each at retail prices, Flour, Sugar and Bacon Exce., t.d.:\n\nFor $1.50 one day Time Clock.\n\nFor $2.00 a Gents Nickel Key Wind Watch.\n\nFor $5.00 a Gent's Stem Wind Watch.\n\nFor $2.00 a Ladies Silver Stem Wind Watch.\n\nSample of above goods can be seen at our store.\n\nTO ARRIVE—Walnut Clock which we will give away.\n\nT. W. ROBINSON,\n\nMain Street, Moose Jaw\n\nClearing Sale!\n\nOF DRY GOODS!\n\nThe balance of our Stock of Dry Goods will be sold at about COST!\n\nEXCEPT A FEW STAPLES.\n\nR. BOGUE\n\nE. A. BAKER & CO.,\n\nGRAIN MERCHANTS.\n\nALL KINDS OF:\n\nSeed Wheat, Peas, Oats and Barley For Sale.\n\nWHOLESALE & RETAIL—\n\nDEALERS IN—\n\nGROCERIES,\n\nPROVISIONS,\n\nFLOUR AND FEED,\n\nHARDWARE, STOVES, PAINT, OILS, ETC.\n\nESTABLISHED 1883.\n\nLIVERY, FEED AND SALE STABLES,\n\nFOR SALE,\n\nBALED HAY ALWAYS ON HAND,\n\nW. WALSH,\n\nNIC STREET, MOOSE JAW.\nTHE STORY OF A WOMAN-HATER.\n\nColonel Frederick Chambers was not a man to be trifled with. He had been educated at Eton, and his manners were those of a gentleman. He was a bachelor, and his life was spent in the pursuit of pleasure. He had a great deal of money, and he liked to show it off. He was very fond of women, and he would do anything to get one. He had been married once before, but he had divorced her because she was not good enough for him. Now he was engaged to be married again, and he was very excited about it.\n\nOne day, while he was out for a walk, he met a young woman who was very attractive. She was very kind to him, and he fell in love with her immediately. He asked her to marry him, and she said yes. They were very happy together, and they lived happily ever after.\n\nBut then, one day, Colonel Chambers received a letter from his former wife. In the letter, she said that she was still interested in him, and she wanted him back. Colonel Chambers was very angry when he read the letter, and he decided to end his engagement with the young woman. He told her that he could not marry her because he had a wife already.\n\nThe young woman was very hurt by this news, and she went to see Colonel Chambers again. This time, however, he was very rude to her. He told her that he did not want to see her anymore, and he walked away without saying another word.\n\nThe young woman was very upset by this, and she decided to go home. As she was walking down the street, she saw a group of men who were talking about her. They were saying that she was a bad person, and that she should not have been so rude to Colonel Chambers.\n\nThe young woman was very angry when she heard this, and she decided to confront Colonel Chambers. She went to his house, and she knocked on the door. When he opened it, she told him that she was very upset by what had happened, and she asked him to explain himself.\n\nColonel Chambers was very surprised when he heard this, and he tried to explain himself. But the young woman was not interested in hearing his excuses, and she left his house.\n\nThe young woman was very upset by this, and she decided to go to the police station. She told them what had happened, and they promised to investigate the matter.\n\nIn the end, Colonel Chambers was found guilty of assault and battery, and he was sentenced to six months in prison. The young woman was very relieved when she heard this, and she knew that justice had been served.\n\nENDLESS STEEL WALLS.\n\nThe Story of a Woman-Hater.\n\nMiss Stover's Last Lay.\n\nJOHN BUNYAN.\n\nPEALS OF TRUTH.\n\nWife and What the Author of \"Pilgrim's Progress\" Said About Her.\n\nMrs. Johnson's book, \"Pilgrim's Progress,\" is a classic of English literature. It tells the story of a man named Christian who goes on a journey to find salvation. Along the way, he meets many people who try to help him, but there are also many obstacles that he must overcome.\n\nOne of the most famous characters in the book is Mrs. Christian. She is a strong and independent woman who refuses to be dominated by anyone else. She is very intelligent and resourceful, and she always does what is right.\n\nMrs. Christian is very similar to the author of the book, John Bunyan. Both of them were very religious people, and both of them wrote books that were very popular during their time. However, there are some important differences between them.\n\nFor example, Mrs. Christian is very different from the other women in the book. She is not afraid to speak her mind, and she does not allow anyone else to control her. This makes her a very admirable character.\n\nOn the other hand, John Bunyan was very different from the other men in the book. He was very humble and modest, and he never tried to impress anyone else. This made him a very respected figure.\n\nIn conclusion, both Mrs. Christian and John Bunyan are very important figures in the history of literature. They are both very admirable people, and their stories will continue to inspire people for generations to come.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/MJA_1890021401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6502, "total-output-tokens": 1331, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1025, 1], [1025, 1025, 2], [1025, 5038, 3], [5038, 5038, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]