[{"id": "03436195d7b90ae24734a7bfe647baca119d21c6", "text": "LE METIS\n\nDIEU ET MON DROIT.\n\nN. D. Gagnier & Cie. Éditeurs-Propriétaires.\n\nAlléchon\n\nLa Sainte-Chapelle est une église de Paris, située sur la rive gauche de la Seine, au cœur du quartier historique de l'Île de la Cité. Elle est célèbre pour sa nef gothique et son chœur roman, ainsi que pour ses vitraux médiévaux. La Sainte-Chapelle a été construite entre 1243 et 1248 par le roi Louis IX de France, également connu sous le nom de Saint Louis, pour abriter les reliques de la Vraie Croix et de la Robe de Christ. Elle est un exemple exceptionnel de l'architecture gothique en France et est considérée comme l'un des plus beaux édifices religieux de l'Europe médiévale.\n\nLa Sainte-Chapelle est ouverte au public tous les jours de l'année, de 9h à 17h. Les visites guidées sont disponibles en plusieurs langues, notamment en français, anglais, allemand, espagnol et italien. Des expositions temporaires et des concerts sont également organisés régulièrement.\n\nLa Sainte-Chapelle est un site classé au patrimoine mondial de l'UNESCO depuis 1979. Elle est également un monument historique de France, protégé au titre des monuments historiques depuis 1862.\n\nLa Sainte-Chapelle est un lieu de culte catholique et est toujours utilisée pour des célébrations religieuses. Elle est également un lieu de rencontre culturel et touristique, attirant des millions de visiteurs chaque année.\nLe Metis\n\nSamedi, 30 Août 1874\n\nLa politique fédérale.\n\nLe gouvernement de tous les pays, mais ceux qui parlent au Canada sont compris d'ailleurs, est le gouvernement de la Confédération, sous la direction du gouvernement fédéral, c'est-à-dire celui qui existe sous l'autorité du gouvernement provincial, et qui est composé des provinces qui ont été formées en vertu de la Constitution de la Confédération. Ce gouvernement est le plus important du Canada, car il est le seul qui soit en mesure de faire face à toutes les situations qui peuvent survenir, et qui est le mieux adapté pour assurer la paix et la sécurité des citoyens du Canada.\n\nTrois pour un...\n\nLundi matin, à 5 heures du matin, John Ingram, battu du parti libéral, accusé de fraude électorale, a été arrêté par la police à Saint-Georges, près de Winnipeg. Il a été emmené en prison, avant que le lendemain matin, à 10 heures, il ne soit traduit devant le tribunal de justice de la ville de Saint-Georges.\n\nLa Proclamation.\n\nNous trouvons dans nos échanges de Montréal les détails qui suivent sur la proclamation du Parlement d'Ottawa qui a eu lieu le 13 du courant :\n\nL'Orateur prend soin de dire à 3 h 15 du matin que le Honorable M. McKenzie se lève pour présenter une résolution lors de l'ouverture du Parlement. Le Honorable M. McKenzie se lève pour présenter une résolution lors de l'ouverture du Parlement. Le Honorable M. McKenzie se lève pour présenter une résolution lors de l'ouverture du Parlement.\n\nUn voile attrape.\n\nLe 16 de ce mois, un individu qui s'appelait le Honorable M. McKenzie est arrivé à Montréal avec une lettre du Honorable M. McKenzie qui lui a ordonné de prendre des mesures contre le Honorable M. McKenzie qui est maintenant en prison à Montréal.\nSaskatchewan.\n\nNous apprenons avec étonnement que le navire de la Compagnie de la Saskatchewan a sombré dernièrement avec une immense cargaison. C'est là une nouvelle qui peut être considérée comme un triste accident qui va retarder la navigation dans cette mer intérieure.\n\nNous n'avons pas encore eu des nouvelles de ce bateau depuis plusieurs semaines et nous espérons que les recherches ne devront pas s'interrompre trop longtemps. C'est dans le lac du Nord-Ouest, à l'embouchure de la rivière Rouge, que le navire a été trouvé. Le capitaine du navire a été sauvé mais le navire est perdu.\n\nNouvelles du Lac Labiche.\n\nDes lettres du Roi, Pierre Colignon, datées du 15 Mai 1873, nous apprennent que le Roi, Pierre Viger, était déjà en route pour le Lac Labiche. Ces lettres plus récentes nous disent heureusement que le digne monarque est toujours en bonne santé et même en convalescence.\n\nNOUVELLES RELIGIEUSES.\n\nLe Cardinal Audet a envoyé un message aux États-Unis, une lettre dans laquelle il exprime son profondément affecté des manifestants de sympathie qu'il a reçus de ses enfants dans cette terre éloignée.\n\nNOUVELLES DIVERSES.\n\nLa récolte du blé des États-Unis est évaluée à deux cent vingt millions de livres.\n\nUn certain nombre de signalements ont été faits au sujet de Lord Elgin, condamnant un certain nombre de personnes à être pendues pour avoir frappé de leurs coups de canne un membre de la famille royale.\n\nNOUVELLES LOCALES.\n\nM. W. T. Urquhart, greffier du Conseil du Nord-Ouest, a déclaré que le gouvernement de la province de la Saskatchewan avait été informé de l'arrivée de plusieurs nouveaux habitants.\n\nComme M. Bastow a reçu tous les appareils médicaux nécessaires pour exercer son art de dentiste, il est maintenant prêt à poser des dents artificielles sur les patients qui en auront besoin.\n\nInformations.\n\nNous avons appris avec joie que S. G. Macdonald, ancien président du comité des travaux publics de la Province de Québec, est de retour à Winnipeg après une longue absence.\n\nLes professeurs du Collège de St. Boniface, sont arrivés hier soir à la ville de Winnipeg, où ils ont passé quelques jours avant de reprendre leurs cours.\n\nLe lac Labiche est une destination idéale pour une excursion de plusieurs jours.\n\nANNONCES NOUVELLES.\n\nJ. W. BASTOW,\nChirurgien, Dentiste.\n\nDésirez annoncer aux habitants de Winnipeg et de la région de Saint-Boniface, que je serais heureux de leur offrir mes services de chirurgien et de dentiste.\n\nJ. W. BASTOW,\nChirurgien-Dentiste.\n\nPITON & ISMAY,\nGrande Rue, Winnipeg.\n\nBUREAU DE POSTE, MAISON DE L'ÉGLISE ET BUREAU DES TERRES.\n\nCONSEIL DES TERRITOIRES DU NORD-OUEST.\n\nL'Assemblée nationale du Conseil des Territoires du Nord-Ouest, aura lieu à l'Hôtel du Gouvernement de Fort Garry, le 15 Septembre prochain, pour le compte de l'élection et l'élection des Élus du Parlement provincial de la Province de Manitoba.\n\nWILLIAM J. URQUHART,\nSecrétaire du Conseil du Nord-Ouest.\n\nM. THEODOR J. BOURDEAU,\nNouveau magasin à St. Boniface.\n\nMAGASIN GENERAL A ST. BONIFACE.\n\nD'ÉPICERIES ET DE PROVISIONS\n\nLARD, POUVOIR, VIANDS SÈCHES, FARINE, BEURRE, FROMAGE, PAIN.\n\nAVANT DE FAIRE VOS ACHATS\n\nA MEILLEUR MARCHE QUAILLEURS.\n\nAVIS PUBLIC\n\nPar le présent, je donne à TOUS les citoyens de la Province de Manitoba, de la ville de Winnipeg et des environs, une invitation à se rendre à la réunion annuelle qui se tiendra à l'Hôtel du Gouvernement de Fort Garry, le 15 Septembre prochain, pour le compte de l'élection et l'élection des Élus du Parlement provincial de la Province de Manitoba.\n\nJ. S. DENNIS,\nArbitre du Conseil des Territoires du Nord-Ouest.\n\nAVIS AUX ENTREPRENEURS ET AUX CONSTRUCTEURS.\n\nLES SOUS-SIGNÉS donnent avis à tous les citoyens de la Province de Manitoba, de la ville de Winnipeg et des environs, que nous sommes en mesure de fournir des services de construction et de bâtiment.\n\nJ. S. DENNIS,\nArbitre du Conseil des Territoires du Nord-Ouest.\n\nM. THEODOR J. BOURDEAU,\nNouveau magasin à St. Boniface.\n\nMAGASIN GENERAL A ST. BONIFACE.\n\nD'ÉPICERIES ET DE PROVISIONS\n\nLARD, POUVOIR, VIANDS SÈCHES, FARINE, BEURRE, FROMAGE, PAIN.\n\nAVANT DE FAIRE VOS ACHATS\n\nA MEILLEUR MARCHE QUAILLEURS.\n\nAVIS PUBLIC\n\nPar le présent, je donne à TOUS les citoyens de la Province de Manitoba, de la ville de Winnipeg et des environs, une invitation à se rendre à la réunion annuelle qui se tiendra à l'Hôtel du Gouvernement de Fort Garry, le 15 Septembre prochain, pour le compte de l'élection et l'élection des Élus du Parlement provincial de la Province de Manitoba.\n\nJ. S. DENNIS,\nArbitre du Conseil des Territoires du Nord-Ouest.\n\nAVIS AUX ENTREPRENEURS ET AUX CONSTRUCTEURS.\n\nLES SOUS-SIGNÉS donnent avis à tous les citoyens de la Province de Manitoba, de la ville de Winnipeg et des environs, que nous sommes en mesure de fournir des services de construction et de bâtiment.\n\nJ. S. DENNIS,\nArbitre du Conseil des Territoires du Nord-Ouest.\nLE METIS.\n\nIMPRESSIONS!\n\nOn exécute à l'imprimerie du \"Metis.\"\n\nDes impressions de toutes sortes telles que BLANCS DE COUR POUR AVOCATS, GREFFIERS, NOTAIRES\n\nFactums, ROLES D'EVALUATION, Listes Alphabetiques\n\nBLANC DE COMPTES, Cartes d'affaires Circulaires, LETTRES FUNÉRAIRES\n\nCARTES DE VISITES, D'ADRESSES, DE COMMERCE, ETC. ETC.\n\nPROGRAMMES,\n\nAFFICHES\n\nLIVRES, BROCHURES.\n\nLa variété et le nombre de variétés que possède l'établissement nous permettent d'exécuter les impressions qui nous sont confiées, de manière à satisfaire les goûts les plus difficiles, et sous les plus courts délais.\n\nWm. Chambers WINNIPEG.\n\nChemins de fer Great Western DU CANADA\n\nAller et retour de Manitoba.\n\nLe meilleur service de l'Est est celui de la Compagnie de la Grande-Occidentale, Toronto, Hamilton, et le Pont Sud.\n\nQuelques trains Express chaque jour aller et retour.\n\nLe tarif est modéré, l'expédition prompte, et le service camping complet, tous les derniers inventoires.\n\nAttention spéciale et tarif particulier pour les immigrants.\n\nW. K. MUIR,\nBureau du G.W.R., Hamilton, Oct. 1872\n\nETAL DE BOUCHERIE ET CHARCUTERIE.\n\nSAUCISSES.\n\nM. MACMILLAN ROGAN, agent de libre-service, informe les éleveurs du Manitoba de l'ouverture de son Étal de Boucherie à la Société Agricole de Winnipeg, situé au 3e étage de la Grande Rue, Winnip. Il vend des saucisses de qualité supérieure, ainsi que des viandes fraîches et des poissons.\n\nJAMES STEWART,\nSecrétaire à A.J.P.\n\nWINNIPEG, 22 Avril 1873.\n\nJ. J. MARSHALL,\nCONSTRUCTEUR ET CONTRACTEUR.\n\nLa variété et le nombre de variétés que possède l'établissement nous permettent d'exécuter les impressions qui nous sont confiées, de manière à satisfaire les goûts les plus difficiles, et sous les plus courts délais.\n\nWinnipeg, 16 Avril 1873.\n\nW. G. FONSECA,\nPOINTE DOUGLAS.\n\nPrintemps et été, 1873.\n\nA. G. B. BANNATYNE,\nGRANDE RUE, WINNIPEG.\n\nMARCHAND EN GROS ET EN DETAIL.\n\nA ce même endroit, nous vendons les premiers fruits de la saison, ainsi que des articles de qualité supérieure, qui sont importés dans cette Province, consistant en quantités variées de:\n\nMARCHANDISES SECÈS.\n\nOBJECTS DE FANTASIE.\n\nEPICERIES DE TOUTES SORTES.\n\nVINS ET LIQUEURS.\n\nBIÈRE, AILES ET PORTER en bouteilles.\n\nCIGARES ET TABAC.\n\nBRAPS CANADIENS ET ANGLAIS.\n\nBARDES FAITES.\n\nBOTTES, BOTTONES ET SOULIERS.\n\nQUINCAILLERIE.\n\nOUTILS de Charpentiers et Menuisiers.\n\nFECHES, FELLES, TOUCHEES, BOULES.\n\nACHETER ET VENDRE.\n\nFARINE ET PROVISIONS, PEMICAN, ROBES ET PEUX.\n\nLOTS DE VILLE A VENDRE.\n\nEnseigne du Pavillon Blanc.\n\nNOUVEAU MAGASIN à l'ancienne épicerie de M. Boyd, Grande Rue, WINNIPEG.\n\nVENTE POUR ARGENT COMPACT.\n\nGIABOT & CIE.,\nMarchands-bouchers, et entrepôt de Marchandises séchées en général.\n\nL'assortiment est considérable, élevé, nouveau, et toujours des premiers marques.\n\nTWEDS ANGLAIS, FRANÇAIS ET CANADIENS, DANS FINS, ETC.\n\nAinsi un assortiment choisi de Hardes, Facons et autres articles pour Messieurs.\n\nSOQUES NOIRRES, TOUFFES A ROBE, INDIENNES, CORDONS, etc., en grande variété.\n\nBONNETS, CASQUES, et un assortiment général de JOUJOUERIE et articles de FANTASIE.\n\nLe Département de Tailleurs est très complet. On fait de l'entretien et de la réparation des habits, et suivant les patrons les plus demandables.\n\nCHARPOT & CIE.,\nEntreprise du Familial Blanc, Grande Rue, WINNIPEG.\n\nUne variété considérable des grands articles de qualité supérieure.\n\nJAMES STEWART,\nPHARMACIEN.\n\nRUE GARRY,\nvis-à-vis l'Église Méthodiste, WINNIPEG.\n\nDROGUES.\n\nMEDICINES ET PARFUMERIES.\n\nTOILETTES ET ARTICLES DE GOUT.\n\nARTICLES DE TOILETTES EN GRANDE VALEUR.\n\nUn soin spécial pour la préparation des prescriptions.\n\nJ. H. ASHDOWN,\nEN FACE DE LA PHARMACIE DE DR. BIRD.\n\nA un même endroit, vente de POULES ET USTENSILES de cuisine de la meilleure qualité et des plus durables.\n\nFOURNAIRES.\n\nHUILE DE CHARBON,\n\nQUINCAILLERIE,\n\nFERBLANTERIE,\n\netc., etc., etc.\n\nQu'il vendra aux plus bas prix au comptant.\n\nUne visite est respectueusement sollicitée.\n\nWinnipeg, 1er Août 1872.\n\nBOIS, BOIS.\n\nLE SOUS-SIGNE VIENNE d'apporter une somme de 500 $ pour l'acquisition de terrains de la Compagnie de la Baie d'Hudson, en face de la Cathédrale de St. Boniface, et propose de vendre ces terrains à des prix raisonnables, et non pas sur les terres de la rivière de même nom, et qu'il se propose de construire un\n\nMoulin à Scie,\n\nqui comprendra toutes les descriptions mentionnées ci-dessus, et qui sera situé à la limite de la rivière de même nom, et qu'il se propose de vendre.\n\nVoici la liste de ses prix:\n\nPanciers................. 40 $ le paquet\nNo. 2, de dimension........... 40 $\nNo. 3, de dimension........... 40 $\nNo. 4, de dimension........... 40 $\nNo. 5, de dimension........... 40 $\nNo. 6, de dimension........... 40 $\nNo. 7, de dimension........... 40 $\nNo. 8, de dimension........... 40 $\nNo. 9, de dimension........... 40 $\nNo. 10, de dimension........... 40 $\nNo. 11, de dimension........... 40 $\nNo. 12, de dimension........... 40 $\nNo. 13, de dimension........... 40 $\nNo. 14, de dimension........... 40 $\nNo. 15, de dimension........... 40 $\nNo. 16, de dimension........... 40 $\nNo. 17, de dimension........... 40 $\nNo. 18, de dimension........... 40 $\nNo. 19, de dimension........... 40 $\nNo. 20, de dimension........... 40 $\nNo. 21, de dimension........... 40 $\nNo. 22, de dimension........... 40 $\nNo. 23, de dimension........... 40 $\nNo. 24, de dimension........... 40 $\nNo. 25, de dimension........... 40 $\nNo. 26, de dimension........... 40 $\nNo. 27, de dimension........... 40 $\nNo. 28, de dimension........... 40 $\nNo. 29, de dimension........... 40 $\nNo. 30, de dimension........... 40 $\nNo. 31, de dimension........... 40 $\nNo. 32, de dimension........... 40 $\nNo. 33, de dimension........... 40 $\nNo. 34, de dimension........... 40 $\nNo. 35, de dimension........... 40 $\nNo. 36, de dimension........... 40 $\nNo. 37, de dimension........... 40 $\nNo. 38, de dimension........... 40 $\nNo. 39, de dimension........... 40 $\nNo. 40, de dimension........... 40 $\n\nW. J. MACULAY,\nWinnipeg, 17 Août 1873.\n\n200,000 BARDEAUX A VENDRE.\n\nConsidérablement au-dessous du prix courant, pour clore une consignation.\n\nATTENDU CHAQUE JOUR UN ASSORTIMENT DE PORTES, CHASSIS OUVERTS, MOULURES, ETC.\n\nR. GERRIE & Co.,\nEntreprise de Meubles de Manitoba.\n\nWinnipeg, 23 Août 1873.\n\nTERRIERS DANS LES LIMITES DE L'ÉTABLISSEMENT.\n\nAVIS PUBLIC: Le présent document est le fait de propriétaires qui s'installent en tant que propriétaires des terres inconnues dans les limites de l'Établissement de la Province de Manitoba, et qui ont été vendus par le gouvernement provincial. Ces propriétaires ont été vendus par le gouvernement provincial, et toute personne qui fait le moins de preuves de sa propriété ou de sa résidence sur ces terrains ne doit pas être considérée comme un propriétaire légitime.\n\nPar ordre,\n\nJ. B. DENNIS,\nAgent de Terres de la Province.\n\n24 Mars 1873.\n\nÀ TRAVERS PAR LE SELKIRK.\n\nMARCHANDISES DE PRINTEMPS ET D'ÉTÉ\n\nTOUTES SORTES\n\nMAGASIN DE WM. DREVER\n\nMARCHANDISES SECÈS,\n\nEPICERIES,\n\nBARDES FAITES,\n\nCHAPEAU,\n\nCHAUSSEURS DE TOUS GENRES,\n\nVAISSELLES,\n\nVERGERIE.\n\nA grand marché pour argent comptant\n\nRUE DREVER—EN FACE DU BUREAU DU LIBERAL.\n\nROYAL ET DUBUC\nAvocats et Notaires\nDE LA PROVINCE DE MANITOBA\n\nMM. Royal et Dubuc, avocats et notaires, de la province de Manitoba, ont été désignés pour représenter les intérêts de leurs clients. MM. Royal et Dubuc, avocats et notaires, de la province de Manitoba, ont été désignés pour représenter les intérêts de leurs clients.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/MTM_1873083001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6410, "total-output-tokens": 4897, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1381, 1], [1381, 3124, 2], [3124, 8028, 3], [8028, 15517, 4]], "primary_language": ["fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]