[{"id": "b3b515079e2ce89c8ea9b0a2b7efeb07712bb73f", "text": "L'ENTREVUE DE FROISDORFF.\n\nEnfin, le Journal du Rhin, organe des princes d'Europe, a paru à Vienne un extrait de l'article qu'il consacre à la démarche du comte de Paris auprès du comte de Chambord.\n\nLe moment est venu, croyons-nous, de nous demander ce qui a été dit de ce fait et des conclusions auxquelles il convient de en tirer les conséquences de la démarche que M. le comte de Paris vient de faire auprès du comte de Chambord. C'est une action libérale d'esprit qui nous mène alors, cette question et à considérer, non pas en termes de souveraineté dynastique ou de respect des traditions familiales, mais dans le cadre des lois constitutionnelles.\n\nM. de la Tour-Dauzats, le cousin du roi de Rome, a écrit à son beau-frère, le comte de Chambord, pour lui faire part de sa position et de sa décision.\n\nL'ÉVACUATION PRUSSE.\n\nOn écrit de Paris, le 28 août.\n\nLe ministre de la Guerre est parti de Paris pour rejoindre les tendances qui s'étaient formées dans un salon, situé au 124, rue de la Paix. Le gouvernement a décidé de faire marche arrière, et le général de Châteaubriand a signifié à l'empereur prussien qu'il se retirerait de la France.\n\nLa veille de la fête nationale, les princes du sang se sont réunis autour du prince de Saxe-Cobourg-Gotha, à l'hôtel Crillon, pour discuter des nouvelles positions européennes. Le prince héritier de Prusse, le prince de Hohenzollern-Sigmaringen, tous deux présents, ont échangé des opinions sur les derniers développements.\n\nL'ÉPREUVE DE GARNIER.\n\nSelon le Journal de Genève, le comte de Chambord a envoyé des lettres de dépit à ses cousins, le prince de Joinville et le prince de Condé, exprimant ainsi sa frustration face à la situation actuelle.\n\nN. D. Gagnier & Cie., Editeurs-Propriétaires.\n\nLE METIS.\n\nDIEU ET MON DROIT.\n\nN. D. Gagnier & Cie., Editeurs-Propriétaires.\n\nAinsi, le comte de Paris, après avoir eu des difficultés avec le comte de Chambord, a décidé de passer à l'action, afin de mettre fin à l'incertitude sur l'avenir de la monarchie. Son action est saluée par de nombreux libéraux, mais également par certains conservateurs qui craignent que cela ne remette en question leur propre statut.\nNOUVELLES CANADIENNES\n\n— M. Stoeck, Greffier de la Couronne en Chambre, est parti pour faire signer par Son Excellence le Gouverneur général les élections de M. Prud'homme.\n\n— Les marchands de Sherbrooke ont rendez-vous pour faire leur marché annuel.\n\nNOUVELLES LOCALES\n\n— Nous avons eu quelques jours de vent froid annonçant l'automne. Malgré le temps, nous entendons encore des chants de hameau. Le temps est devenu plus humide et nous devons être prêts à mettre nos manteaux.\n\nNOUVELLES ÉTRANGÈRES\n\n— Un groupe de quatre hommes est parti en expédition dans les montagnes du Nord-Ouest.\n\n— La France et l'Angleterre s'apprêtent à signer un accord de paix.\n\nInformations\n\n— Le gouvernement canadien annonce la mise en place d'un service de police renforcé dans les régions rurales.\n\n— Une délégation de journalistes américains visite les mines de charbon de la Nouvelle-Angleterre.\n\n— Le président américain, Mr. Lincoln, a rendu visite à la reine Victoria de Grande-Bretagne.\n\n— Un navire français, le \"La Fayette\", a été coulé au large de la côte de Normandie.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/MTM_1873091301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6318, "total-output-tokens": 1045, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2163, 1], [2163, 3227, 2], [3227, 3227, 3], [3227, 3227, 4]], "primary_language": ["fr", "fr", "None", "fr"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]