[{"id": "98f42821d3631905b56f24695cf2d351a1deb1bc", "text": "OFFICIAL\nGUIDE BOOK\nTO THE\nCANADIAN PACIFIC\nRAILWAY LANDS\nIN\nMANITOBA AND PART OF THE N.W.TERRITORY\n\n—COMPILED—\n\nFROM MANUAL OF SURVEY AND C.P.R. LAND EXAMINATION REPORTS.\n\nWINNIPEG:\nTHE BISHOP ENGRAVING AND PRINTING COMPANY.\n1883.\n## INDEX\n\n| Topic                                      | Page |\n|--------------------------------------------|------|\n| LAND AGENCIES                              | 3    |\n| \" OFFICES                                  | 3    |\n| SURVEY, system of                          | 5    |\n| TOWNSHIPS, how numbered                    | 5    |\n| SECTIONS, how numbered                     | 5    |\n| POST MARKINGS                              | 7    |\n| LAND EXAMINATIONS, system of               | 9    |\n| CARBERRY AGENCY, reports on                | 11   |\n| BRANDON AGENCY,                            | 17   |\n| VIRDEN                                     | 26   |\n| MOOSOMIN                                   | 32   |\n| BROADVIEW                                  | 36   |\n| WOLSELEY                                   | 43   |\n| REGINA                                     | 48   |\n| MOOSEJAW                                   | 54   |\n\n### MAPS\n\n| Topic                                      | Page |\n|--------------------------------------------|------|\n| GRETNA Town Site, Map facing               | 10   |\n| MARQUETTE Town Site, Map facing            | 10   |\n| CARBERRY AGENCY,                           | 11   |\n| SIDNEY Town Site,                          | 13   |\n| MELBOURNE Town Site,                       | 14   |\n| CARBERRY                                   | 14   |\n| BRANDON AGENCY,                            | 17   |\n| SEWELL Town Site,                          | 18   |\n| CHATER                                     | 20   |\n| VIRDEN AGENCY,                             | 26   |\n| VIRDEN Town Site,                          | 28   |\n| ELKHORN Town Site,                         | 30   |\n| MOOSOMIN AGENCY,                           | 32   |\n| MOOSOMIN Town Site,                        | 34   |\n| BROADVIEW AGENCY,                          | 36   |\n| WHITEWOOD Town Site,                       | 38   |\n| BROADVIEW                                  | 41   |\n| GRENFELL                                   | 42   |\n| WOLSELEY AGENCY,                           | 43   |\n| SINTALUTA Town Site,                       | 46   |\n| REGINA AGENCY,                             | 48   |\n| Qu'APPELLE Town Site,                      | 48   |\n| REGINA                                     | 52   |\n| MOOSEJAW AGENCY,                           | 54   |\n| MOOSEJAW Town Site,                        | 54   |\nGUIDE BOOK TO C. P. R. LANDS.\n\nDESCRIPTION OF AGENCIES AND OFFICES.\n\nTo facilitate settlers who are desirous of purchasing lands from the Railway Company, the Main Line Belt has been divided into Agencies, within the limits of which, land can be purchased from the Agents of the Company at the stations hereinafter indicated.\n\nAGENCIES.\n\nCARBERRY—All lands in main line belt, ranges 11 to 15 (inclusive) west of first meridian.\n\nBRANDON—All lands in main line belt, ranges 16 to 23 (inclusive) west of first meridian.\n\nVIRDEN—All lands in main line belt, ranges 24 to 28 (inclusive) excepting townships 14, 15, 16, west of first meridian.\n\nMOOSOMIN—All lands in main line belt, ranges 28 (part of) to 33 (inclusive) west of first meridian.\n\nBROADVIEW—All lands in main line belt, ranges 1 to 7 (inclusive) west of second meridian.\n\nWOLSELEY—All lands in main line belt, ranges 8 to 13 (inclusive) west of second meridian.\n\nREGINA—All lands in main line belt, ranges 14 to 23 (inclusive) west of second meridian.\n\nMOOSEJAW—All lands in main line belt, ranges 24 to 30, west of second meridian.\n\nLAND OFFICES.\n\nThe land offices for the agencies in the order in which they are given, together with their distances from Winnipeg are: Carberry,\n106 miles; Brandon 133 miles; Virden, 180 miles; Moosomin, 219 miles; Broadview, 264 miles; Wolseley, 295 miles; Regina, 357 miles; Moosejaw, 398 miles; the first three being in the Province of Manitoba, the remainder in the Province of Assiniboia, Northwest Territory.\n\nThe agents at the land offices will have for free distribution maps showing the lands open for sale, and those already disposed of, plans of the Town Plots and pamphlets, giving descriptive notes of the lands within their agencies; these notes are compiled from the field notes of land examiners, employed by the company during the past season.\n\nThe notes in detail of any particular section can be seen at the head land office of the company in Winnipeg, and at the office for the district in which the section lies. These notes have been collected with the greatest care, and every precaution was taken by the officers of the company to see that the work was accurately done. Whilst referring to the examiner's notes in these high terms, it is to be distinctly understood that the company does not guarantee their exactness, and it is their wish that all intending purchasers should, if possible, see the lands for themselves before buying.\n\nFor the assistance of those who are not conversant with the country, guides will be stationed at the main land offices, for the purpose of directing intending purchasers to such lands as they may desire to see for themselves.\n\nTo further facilitate the settlers in making a selection, a short outline of the system adopted in the survey of public lands, and the manner in which the land examinations for the company are conducted, is given.\nSYSTEM OF SURVEY.\n\nThe Dominion lands are laid off in quadrilateral figures, called Townships, containing 36 sections of 640 acres, or one square mile in each.\n\nTOWNSHIPS AND SECTIONS—HOW NUMBERED.\n\nTownships are numbered in regular order, northerly from the International boundary, or 49th parallel of latitude, and lie in ranges numbered west of certain meridian lines.\n\nThe First or Principal Meridian lies about twelve miles west of Winnipeg. The Second Initial Meridian forms the boundary line between Moosomin and Broadview Agencies. The Third Initial Meridian forms the western boundary of the Moosejaw Agency.\n\nThe Sub-division Surveys are of two classes: those made under the old and those under the new system. The difference consists chiefly in having the road allowances in the new system reduced in width from 99 feet to 66 feet; and the striking out of each alternate road leading east and west.\n\nSurveys in the Carberry, Brandon, Virden, and Moosomin agencies were made under the old system. Each section has therefore bounding it a road allowance of 99 feet in width.\n\nWith the exception of townships north of township 18 and west of the 2nd Meridian to range 13, the lands in the Broadview, Wolseley, Regina and Moosejaw Agencies are divided under the new system, and have therefore road allowances of 66 feet on every section line running north and south, but only on every alternate section line running east and west.\n\nEach section is divided into quarter sections of 160 acres, or a half mile square; but the lines quartering the sections are not surveyed in the field, the points only from which they start on the section lines being indicated by a post or mound.\n\nBefore proceeding with the work of sub-division, the area to be surveyed is blocked out into townships. These are laid out the precise width of 489 chains under the old system of survey, and 483 chains under the new, on what are known as base lines. Such base lines are formed at the distance of four townships apart. The International boundary being taken as the first base, the second is\nbetween townships 4 and 5, the third between townships 8 and 9, and so on northerly in regular succession. Section posts are planted on these lines, giving to each section its width of one mile. These become the governing points for the after subdivision of the townships.\n\nThe meridians are drawn from the base lines north and south, to the depth of two townships; but owing to their not being parallel, they do not meet, that is to say, the meridian drawn north from the first base line to the depth of two townships would not meet the meridian line drawn south from the second base, thus creating the jogs between the township and section outlines, noticeable on all maps of Manitoba and the North-west Territory. It will therefore be seen that the jogs occur on the township lines running east and west, which are equidistant from the bases, or twelve miles therefrom. These are termed correction lines.\n\nA reference to the Index Map will bring this out clearly.\n\n**Bearings of Township and Section Lines.**\n\nIt will be of sufficient accuracy for the purposes of this work to say that the boundaries of the sections are true North and South and East and West lines.\n\nSettlers should bear in mind that the lines are astronomical, and not magnetic, the variation of the compass needle from the true north in the Territories is east, varying from $14^\\circ$ at Winnipeg to $20^\\circ$ at Regina.\n\nAs an illustration—Should the settler desire to run a north and south section line, say at Regina, with the pocket compass, the needle should point $20^\\circ$ East of the arrow head on the dial marking the north point, the arrow and not the needle will then indicate the true direction of the line.\n\nThe following table shows the approximate variation at the Land Offices, and is sufficiently accurate for all practical purposes:\n\n| Location    | Variation |\n|-------------|-----------|\n| Carberry    | $15^\\circ$|\n| Brandon     | $15^\\circ$|\n| Virden      | $16^\\circ$|\n| Moosomin    | $17^\\circ$|\n| Broadview   | $18^\\circ$|\n| Wolseley    | $19^\\circ$|\n| Regina      | $20^\\circ$|\n| Moosejaw    | $21^\\circ$|\n\n**Posts and Mounds.**\n\nSurveyed lines on the prairie are marked by posts with mounds of earth built around them.\nExcept in the case of correction lines section posts and mounds are so placed that lines connecting the cardinal points of the compass will pass through their angles. (See diagram.)\n\nOn correction lines they are placed square with the line.\n\nSections surveyed under the old system have their corners indicated by wooden posts, but owing in a great measure to these being destroyed by prairie fires, it was considered advisable in changing the system of survey to use posts made of iron (gas pipes being used for this purpose). These are generally therefore found in surveyed land west of the 2nd meridian.\n\nIn a timbered country the mounds are dispensed with, and the lines marked by blazing the trees on the side next the line, and the direction in which it is run, the corners being established by wooden posts, the position of which are defined by bearing trees.\n\nOnly a single row of posts to indicate the corners of the townships or sections (except on correction lines) is placed on any surveyed line. These posts are placed in the west limit of road allowances leading north and south, and in the south limit of roads leading east and west.\n\nOn correction lines posts are planted on each side of the road allowance, and marked independently for the townships on either side.\n\nIt frequently occurs that a section corner falls into a lake, slough, or stream. In this case the surveyor builds a circular witness mound on the shore at the point nearest to the true position of the section corner, the post standing in the mound being marked W. M., the bearing and distance to the site of the true corner being written thereon.\n\nPOST MARKINGS.\n\nWooden posts are marked with Roman numerals cut into their faces.\n\nWhere iron posts are used, the figures are punched on a square plate of tin, which rests on the top of the mound, the post passing through its centre. In addition to the section numbers, the plates are marked with the letters N. S. E. and W., and it is necessary, in ascertaining the number of a section, to see that the plate is turned so that these letters correspond with the cardinal points, which they are intended to indicate.\n\nQuarter section corners are designated by wooden posts, flattened\non two sides. They are marked with the fraction $\\frac{1}{4}$, and stand with their flattened sides facing the direction in which the section line is run.\n\nThe position in which the mounds and posts stand with reference to the section lines, and the manner in which they are marked, is shown in the annexed diagrams.\nDIAGRAMS showing the road allowance, and the manner in which the sections are numbered.\n\n| Township as surveyed under Old System |\n|--------------------------------------|\n| 31 | 32 | 33 | 34 | 35 | 36 |\n| 30 | 29 | 28 | 27 | 26 | 25 |\n| 19 | 20 | 21 | 22 | 23 | 24 |\n| 18 | 17 | 16 | 15 | 14 | 13 |\n| 7  | 8  | 9  | 10 | 11 | 12 |\n| 6  | 5  | 4  | 3  | 2  | 1  |\n\n| Township as surveyed under New System |\n|---------------------------------------|\n| 31 | 32 | 33 | 34 | 35 | 36 |\n| 30 | 29 | 28 | 27 | 26 | 25 |\n| 19 | 20 | 21 | 22 | 23 | 24 |\n| 18 | 17 | 16 | 15 | 14 | 13 |\n| 7  | 8  | 9  | 10 | 11 | 12 |\n| 6  | 5  | 4  | 3  | 2  | 1  |\nDiagram shewing manner in which posts are marked\nSURFACE.—Broken by the valley of the Souris River. The valley is full of scrub and patches of timber. North bank of river 50 feet high, south bank from 15 to 40 feet. That part of sec. west of river lies in the valley. Strips of high land at north is gently undulating. That S. and E. of river forms two plateaus 'descending' to the valley.\n\nSOIL.—Sandy loam from 10 to 18 inches deep with sandy subsoil. Rates No. 2.\n\nTIMBER.—The timber along the Souris will cut about 1000 cords of wood. A good deal of it consists of black poplar and cotton wood, which does not burn well. The best of the elm is cut by settlers.\n\nWATER.—Abundance of water in river and coulee. There is an excellent spring in fenced field, as shown on diagram.\n\nGRASS.—A fair growth of prairie grass. No meadows.\n\nIMPROVEMENTS.—The S. E. ¼ is claimed by J. McCauley, who bought it from the C. P. R. in August, 1881. Has about 45 acres broken and backset, twelve of which were under crop this year. He has a good frame house 15x20 and stable.\n\nCAPABILITIES.—A fair section for general farming.\nC. P. R. LAND EXAMINATIONS.\n\nThe examination of the Company's lands is carried on by parties consisting of a chief, three assistant examiners, a cook and teamster. Before commencing the season's work the parties are brought together and formed into one camp, for the purpose of working together on standard sections, to insure uniformity of rating throughout the staff.\n\nFor convenience of description, every section is divided into square forty acre lots, and each of these is to be examined by running accurate lines across the same, or at least one boundary line thereof, and in broken or wooded country at least two boundary lines; but in all cases enough lines are to be run over the section to acquire a thorough knowledge of it.\n\nExaminers are instructed to represent on the diagram the position, form and exact location of every lake, pond, marsh, meadow, swamp, bluff, hill or valley, timber, brush and open land, the position and course of every stream of water or drain, indicating in the case of a rapid current the possible water power and fall of the stream.\n\nFollowing the diagram, notes are written as to surface, soil, timber, water, grass, stone, minerals, improvements, area of arable land, and the general adaptability of the section for farming purposes.\n\nIt will be observed that each forty-acre lot is marked with a number expressing its relative value, judged by the following rule: No. 1, best obtainable; No. 2, good; No. 3, fair; No. 4, poor; No. 5, worthless; the fractional parts $1\\frac{1}{2}$, $2\\frac{1}{2}$, etc., being used where doubt exists as to which division the tract properly belongs.\n\nThe relative value is not what each of the forty-acre lots bear to each other, but when placed in contrast with land A No. 1 in every respect.\n\nA standard No. 1 consists of a tract in which the soil, surface, location, and adaptability for farming purposes is of the best rating obtainable in the territory. In addition to this, a forty-acre lot must in its natural state be such as will permit the whole of it being brought under cultivation.\n\nIf through the presence of alkali, swamps, marshes, sloughs, ponds, stone, gravel, or thick willow brush, only thirty-five acres can be cultivated, this would reduce the rating one half: per example—a first-\nclass forty-acre lot in every respect would rate No. 1; a first-class tract, with five acres of swamp, stone, etc., would rate No. $1\\frac{1}{2}$; one with ten acres of swamp, stone, etc., No. 2; and so on.\n\nThe rating of the soil is given in the written notes, under its proper heading. Heavy clay or sandy loam, with clay subsoil, is rated No. 1; light clay or sandy loam, with a small percentage of gravel and clay subsoil, No. $1\\frac{1}{2}$; Shallow clay or sandy loam, with or without a small percentage of gravel and a subsoil of sand, No. 2. Pure sand or gravel will not be rated, it being sufficient to state in the notes that the soil is one or the other of these.\n\nIn taking the topography, every feature is shown exactly as it is found at the date of examination. Ponds and marshes of less area than one acre are omitted, but these are taken into account in striking the relative value, and are computed in summing up the acreage of arable land.\n\nAs ponds and marshes are represented as found, the opinion of the examiners is given as to whether these can be readily removed by drainage, or whether at a later date, owing to evaporation and natural drainage, they will disappear and give place to hay meadows. If the latter conclusion be arrived at, the rating is not lowered, provided the section is in a district where there is not a superabundance of hay.\nREPORTS ON TOWNSHIPS.\n\nCOMPILED FROM C. P. R. LAND DEPARTMENT FIELD NOTES.\n\nCARBERRY AGENCY.\n\nRange 11 West of 1st Meridian.\n\nTp. 7. Surface is almost level with a soil of sand and clay loam, and a clay subsoil. It is fairly well watered, but wood is rather scarce. The land throughout may be classed as medium farming.\n\nTp. 8. Is well watered by the Assiniboine flowing east, and the Cypress, one of its tributaries, flowing in a north-easterly direction, joining the former in section 21. The north half is considerably broken by the banks of Assiniboine Valley and sand hills. The south half is undulating with a soil of sandy loam. A limited quantity of scrub oak, poplar and spruce may also be found in this part of the township; some bush may also be found in the vicinity of the rivers. South and east of the two rivers is the only part of the township fit for settlement.\n\nTp. 9. Is badly broken by sand hills ten to sixty feet high. A small quantity of oak, spruce and poplar scattered over the face of township. Soil is altogether too light (being chiefly sand) to admit of successful farming, and can scarcely be recommended as grazing lands.\n\nTp. 10. The surface is broken with sand hills, with numerous marshes lying between, some of them yielding a fair growth of hay. Sections 21 and 27 are densely wooded with small poplar, suitable for fence rails; and several quarter sections are suitable for farming. On the whole, however, this township cannot be recommended for farming, but is well suited for grazing purposes.\n\nTp. 11. The line of the C. P. R. crosses the northern portion of this township, bringing the land within easy reach of the settler and\nR. 11.\n\nmaking it available for settlement. Notwithstanding its somewhat low classification by the examiners, there are a number of good farms to be disposed of; 15, 25 and 35 are sections which may be converted into good farms.\n\nTp. 14. The P. W. and N. W. R. crosses the township in a north-westerly direction. Gladstone, a county town, is located on section 32.\n\nThe C. P. R. Company have only fractional sections 23 and 25 and all of 35 to offer for sale. Surface of these is somewhat low, and consists chiefly of hay land. The soil is a black loam on a clay subsoil. Rates 1.\n\nTp. 15. The lands in this township are being drained by Government, and will soon be amongst the most valuable in the Province.\n\nR. 12.\n\nTp. 7. The Cypress River, flowing north-easterly to the Assiniboine, drains the township. Surface is broken by sand hills, with patches of small tamarac, spruce and poplar. Soil is much too light to be of value for farming purposes. A portion of 35 might possibly answer the purpose, but no other section need be thought of.\n\nTp. 8. Is drained in the north by Assiniboine, and in the south-east by the Cypress River. The township is badly broken by sand hills and is altogether unfit for cultivation, and would be worthless were it not for a number of wood lots, about which settlers might do well to enquire. Sections 27 (S. §), 31 and 33, will cut in the order named—500, 1,800 and 1,100 cords of wood. Remainder of township can only show a few scrub oak, spruce and poplar.\n\nTp. 9. The Assiniboine intersects the township in the south-east corner. Sand hills (in some places 60 feet high) render it useless as a farming district. Wood is scattered over the face of the township.\n\nTp. 10. This township is badly broken by sand hills, with intervening swamps and muskegs. The only sections suitable for farming purposes are E. half 13, whole of 23 and W. half 27, and these require to be cleared of a dense growth of brush. Occasional patches of small poplar and oak are to be found on sections 23 and 27.\nR. 12.\n\nTp. 11. The surface varies from gently undulating in the north to hilly in the south. The soil is of fairly good quality, being chiefly a sandy loam, with clay subsoil. Good natural drainage throughout; an abundance of good water, and a sufficient quantity of wood for domestic purposes.\n\nThe line of the C. P. R. crosses from north-east to south-west, no part of the township being more than four miles from Sidney Station. Sections 25, 31 and 35, when cleared, will make good farms. Several other sections, 1, 7, 9, 17 and 33 are also suitable for agricultural purposes.\n\nTp. 14. This township, on account of the shelter afforded to cattle by the numerous patches of bush, excellent grass and water, is better adapted for stock than general farming.\n\nTp. 15. The surface is gently rolling. The greater portion of the township has been disposed of by the Government to actual settlers. South-west quarter of section 3 and three-quarters of section 5 are the only remaining lots to be disposed of; but these are not all that can be desired for general farming purposes.\n\nR. 13.\n\nTp. 7. Is chiefly undulating, with occasional patches of poplar and willow scrub in the south, and medium-sized bush in the north-half. The north-east corner is broken by sand hills. The soil is a good sandy loam, with sandy clay subsoil. Sections 1, 3, 9, 13, 15, 21 and 23 are well adapted for general farming purposes, while the remainder of the township is good grazing land. Soil rates $1\\frac{1}{2}$.\n\nTp. 8. Is traversed in the north by the Assiniboine River, with high and rugged banks. The soil is principally sand, in many places drifted into hills seventy feet high. Only that portion of the township lying in the valley of the river is fit for cultivation. Section 25 will cut 900 cords of wood; the remainder of the township bears only a sprinkling of spruce and poplar, too scattered to be valuable.\n\nTp. 9. The surface is considerably broken by sand hills, ponds and marshes. A limited quantity of spruce, tamarack and poplar, large\nR. 13.\n\nenough for domestic uses, scattered throughout the township. Altogether unfit for farming.\n\nTp. 10, Melbourne Station, on the line of the C. P. R., which cuts off the north-west corner of the township, is situate on section 33, making a convenient market for settlers in any portion of the township. Although sand hills and marshes are too numerous to make it really good, yet 9, south half of 13, whole 17, 19 and 31 are sections fairly well adapted for general farming purposes. A sufficient quantity of oak and poplar for settlement purposes may be found throughout the township.\n\nTp. 14. Is chiefly rolling, and consists of sandy loam, with clay subsoil. On west half of 23, 25, 27, 33 and 35 may be found a sufficient quantity of timber to supply settlers' wants. These are also the only sections which can be utilized for general farming purposes. The line of the P. W. and N. W. R. runs along the north boundary of the township.\n\nTp. 15. Only a few sections, 1, 3, 5 and 9 are in the market. The surface is gently rolling, dotted here and there with bluffs of medium-sized poplar, suitable for fencing and fuel. The soil is a sandy loam, on a sandy clay subsoil. Excellent hay and good water on all the sections. Better adapted for stock than general farming purposes.\n\nR. 14.\n\nTp. 6. Only the north tier of sections included in railroad belt. North half of 31 can be utilized for mixed farming; remainder is open marsh. North half of 33 and 35 is good farming land; remainder suitable for grazing. Soil is a black sandy loam, with sandy clay subsoil.\n\nTp. 7. The Assiniboine River, 250 feet wide and 8 feet deep, drains the north-westerly portion of township. The surface is generally rolling, broken in some places by sand hills and marsh. Although, as a whole, the township is a poor one, yet the south half of section 1, composed of rich black mould, 14 to 20 inches deep, north half of 3 and part of 31 are lots which will make good farms.\nR. 14.\n\nTp. 8. The surface is broken by sand hills. The Assiniboine traverses the township diagonally. Fuel in considerable quantities may be had in almost any part of it, while the river offers every facility for transporting it to market. Parties desiring wood lots will find it to their advantage to inspect the \"Field Notes.\"\n\nTp. 9. Pine River, a tributary of the Assiniboine, waters the township; in all other respects it is similar to preceding. (Neither suitable for farming purposes.)\n\nTp. 10. Carberry, the county town of Norfolk, is situated in the north-west corner of the township, on the main line of the C. P. R. It has grown amazingly within the past year and in the near future is destined to become an important business centre. Wm. Logan, the local agent for the C. P. R., has already disposed of a large number of \"town lots\" under building contract and the purchasers have shown their faith in the future of the town by erecting good, substantial dwellings and business houses. The Big Plain, so-called, a magnificent stretch of agricultural country stretching away to the north and west, as well as the excellent farming lands of this township, are all tributary to Carberry station.\n\nThe soil is a dark sandy loam, 10 to 20 inches deep, with a sandy clay subsoil; is well watered by Pine creek, and has a sufficient quantity of timber within easy distance to meet the requirements of settlers.\n\nTp. 11 and 12. General features same as preceding. Exceptionally well drained. Capital farming district. Only a few sections available.\n\nTp. 13. Consists of sand hills. The township is of no value excepting for the timber, which grows to a considerable size. Those wanting wood lots might find it to their advantage to examine the field notes.\n\nTp. 14. Is broken in the south with sand hills. The whole township is well wooded, chiefly with poplar, although some scrub oak may be found scattered throughout. Is only valuable on account of timber.\nR. 15.\n\nTp. 6. Section 35 is the only one for sale. Undulating, with a soil of black mould on a clay subsoil. Oak creek crosses west half of section, emptying into Oak lake on east half. Not well adapted for farming.\n\nTp. 7. Is traversed in the north by the Assiniboine river, and in the south by Oak creek. Timber—oak, elm and spruce—for settlement purposes may be found in the vicinity of the river. The soil is a rich dark loam, well adapted for general farming.\n\nTp. 8. The southern part of this township is drained by the Assiniboine river. Scattered throughout the township may be found some small spruce, poplar and oak. The surface is rough and hilly; the soil light and sandy, not at all adapted for agriculture.\n\nTp. 9. A considerable quantity of timber suitable for building, fencing and railroad ties may be found in this township. It is not to be recommended for farming purposes. Pine creek marsh and a range of sand hills comprise a large portion of the surface.\n\nTp. 11. Has a sandy clay soil, well adapted to farming purposes. The greater portion of this township is settled, only a few inferior sections being left.\n\nTp. 12. Is the centre of that magnificent stretch of country known as the Beautiful Plain. The only available sections in this really fine township are a part of 5, 13, 23 and 35, and are composed of a sandy loam with a sandy clay subsoil, fairly well adapted for general farming purposes.\n\nTp. 13. Sections 1 and 27 are the only lands held by the Company in this township. Surface of 1 is generally rolling, bearing occasional bluffs of poplar; the soil is a sandy loam. 27 (except that it is without wood) is similar to 1. Both sections are suitable for farming.\nBRANDON AGENCY.\n\nR. 16.\n\nTp. 7. The Souris river and Springbrook in the north-west and Oak creek in the north-east corners afford an ample supply of good water to settlers in their vicinity. The surface is chiefly rolling with soil of a rich dark loam and clay subsoil. Patches of oak, spruce and poplar are scattered over the north half large enough for domestic uses. Excellent farms may be made of section 1, north-east quarter 25, west half 27, and north half 35. Owing to its many advantages this township is nearly all settled.\n\nTp. 8. Millford, a thriving village with grist and saw mills, is on the boundary line between townships 7 and 8.\n\nThe township is well watered by the Assiniboine flowing easterly and the Souris flowing northerly and emptying its waters into the former, four miles north of Millford. A belt of mixed timber—Ash elm, oak and maple—extends along the banks of both streams as well as numerous bluffs of good poplar suitable for fencing in other parts of the township. Surface, soil, etc., similar to preceding.\n\nTp. 9. Soil very light and sandy; not suitable for agriculture. Numerous tamarac and spruce groves scattered throughout the township fit for fencing and fuel.\n\nTp. 10. Sewell station on section 35 is on the main line of the C. P. R. Township consists of sandhills in the north and low wet lands in the south.\n\nTp. 11. Is open rolling prairie, breaking into sandhills in the east; soil is a rather light sandy loam; township cannot be recommended for farming.\n\nTp. 12. Only a few sections left. Surface is rolling; soil a sandy and gravelly loam; water and grass good; suitable for farming.\n\nTp. 13. Is high rolling prairie; soil, black loam with clay subsoil. Section 5 is well adapted for farming.\nR. 16.\n\nTp. 14. Is rolling prairie interspersed with a mixed growth of poplar and willow. Soil is a rich dark loam on a clay subsoil. Good grass and water on most of the sections. Soil rates $1\\frac{1}{2}$; average relative value, 2.\n\nR. 17.\n\nTp. 7. Is gently rolling prairie except where broken by the banks of the Souris river which runs diagonally through it (south-west to north-east). The soil is a rich dark loam one to two feet deep with a clay subsoil. A choice agricultural township.\n\nTp. 8. The Assiniboine River flowing south-easterly cuts off the north-east corner. Surface is chiefly level prairie, with a soil of rich dark loam and clay subsoil. A large percentage of this township was under crop last year, (1882), nearly all the land—railway as well as Government—being taken by actual settlers.\n\nTp. 9. This township, south-west of the Assiniboine river, which flows diagonally from north-west to south-east, is rolling prairie with a light sandy soil, not to be highly recommended for general farming purposes. Some oak, poplar, etc., grows along the banks of the river. Considerable muskeg in north part of township.\n\nTp. 10. Chiefly undulating prairie, with soil of a light sandy loam. A large muskeg (say 1000 acres) lies in north-east corner. Occasional patches of small poplar. An inferior township and not to be recommended for agricultural purposes.\n\nTp. 11. Is gently rolling prairie, well drained by a number [of small ravines. Soil is a rich dark loam with clay subsoil. Good water may be obtained from ponds in any part of township. Well adapted for general farming purposes.\n\nTp. 12. Sold.\n\nTp. 13. Surface is rolling prairie, dotted at intervals with poplar bluffs suitable for fencing and fuel. An abundance of good water. The soil is chiefly a rich dark loam with clay and gravel subsoil, well adapted for general farming purposes.\nR. 17.\n\nTp. 14. Is gently rolling, covered to a great extent with willow and poplar scrub. Timber suited to all domestic requirements may be found in almost any part of the township. Ponds containing water of fair quality abound; good water may also be obtained by digging 12 to 25 feet. The soil is a dark loam, ten to twenty inches deep, with clay subsoil. When cleared this will make a good farming township.\n\nR. 18.\n\nTp. 6. Sections 27 and 33 only are for sale; 27 is badly broken by the banks of the Souris River, which are well wooded with poplar varying in size from 2 to 8 inches; 33 is considerably broken by ravines bearing a limited quantity of timber. Both sections are too much broken to be worked as farms.\n\nTp. 7. The south-east corner is cut off by the Souris River. On its banks and slopes of the valley is a belt of small poplar. The surface is undulating and broken with ponds. The soil is a rich dark loam, one to two feet deep, with clay subsoil.\n\nTp. 8. Is considerably broken on the west by the Brandon hills, which rise in some places to a height of sixty feet, giving to the settler a plentiful supply of timber for domestic purposes. Remainder of township is open undulating prairie, with soil of a dark sandy loam; clay and gravel subsoil. Well adapted for agriculture.\n\nTp. 9. Almost the whole of this township is open rolling prairie, with a soil of rich dark sandy loam, clay and gravel subsoil; suitable for the growth of cereals, being naturally warm and with sufficient moisture to keep the crops in a thriving condition. The \"Blue Hills of Brandon,\" touching the south-west corner, rise to a height of two hundred feet, and their well-wooded slopes assure the settler of a plentiful supply of fuel, fencing and building material. The Little Souris, a stream of pure spring water rising in the Brandon hills, flows through the southern part of the township.\n\nTp. 10. Is well drained by the Assiniboine River, and Willow Creek, one of its tributaries. The line of the C. P. R. runs across\nR. 18.\n\nthe northern part of the township, with Chater Station, in the Grand Valley, on section 27.\n\nThere is a good deal of meadow land, which will cut from one to two tons per acre of excellent hay, also considerable bush land in the vicinity of the river. The surface is gently rolling, with a soil of dark sandy loam, one to two feet deep, with clay and gravel subsoil. The proximity of this district to the important city of Brandon naturally enhances the value of its farming lands.\n\nTp. 11. This particularly fine agricultural township is undulating open prairie, well drained, with a soil of rich black loam, and clay subsoil. Good water in the ponds.\n\nTp. 12. Is rolling prairie, well drained, with a good growth of poplar, &c., in northern part. Patches of meadow land, which will cut from one and a half to two tons of hay per acre, are quite common. Ponds contain an abundant supply of good water.\n\nThe soil is excellent, consisting of a rich dark loam, one to two feet deep, with a clay and gravel subsoil.\n\nTp. 13. Is rolling prairie; 5, 19 and 35 are the only available sections. The soil is a clay loam, on a clay subsoil. Section 19 is fairly well wooded with poplar, suitable for settlement purposes. All of them fit for farming purposes.\n\nTp. 14. Sold.\n\nR. 19.\n\nTp. 6. Surface on the north side of Souris River, which flows through the township in a south-easterly direction, is broken by ravines and hills. On the banks of the river and in the ravines is a sparse growth of oak, elm, poplar, &c.\n\nThe soil is a dark gravelly loam, with gravelly clay subsoil.\n\nTp. 7. Is high rolling prairie, with a soil of dark loam, from one to two feet deep (in some places containing a small percentage of sand) with clay and gravel subsoil. A small growth of poplar in the northern part of the township affords a limited supply of fuel and fencing.\n\nNumerous ponds, containing good water; and meadow land, which\nR. 19.\n\nin some places will cut two to three tons per acre of excellent hay, will perhaps offer to the stock raiser greater attractions than it may have for the general agriculturist.\n\nTp. 8. Is high rolling prairie, breaking into hills in the north-east. Considerable bush, chiefly poplar, suitable for settlement purposes in the east half.\n\nThe soil is a sandy loam, with a gravelly clay subsoil.\n\nTp. 9. Is rolling prairie. The Brandon hills to the south-east will supply the settler with building material, fencing and fuel, while the Little Souris, a never failing stream of pure water, flowing northerly through the township, with a fringe of oak, elm, etc., along its banks, makes this a particularly desirable locality for farming purposes.\n\nThe soil is a dark sandy loam, with gravelly clay subsoil.\n\nTp. 10. Is rolling prairie with considerable oak, elm and ash, along the banks of the Assiniboine which traverses the township from west to east. The city of Brandon, one of the most important points on the line of the C. P. R. west of Winnipeg, is beautifully situated on the south bank of the river, on section 23. A magnificent view of the \"Blue Hills of Brandon\" to the south, Grand Valley to the east, and the line of the Little Saskatchewan to the west and north may be obtained from any elevated point in the city.\n\nThe soil is a dark loam, 10 to 24 inches deep, with a gravelly clay subsoil.\n\nTp. 11. A very choice township consisting in gently rolling open prairie, without any waste land whatever; the soil is a rich black loam, 1 to 2 feet deep, with a subsoil of clay and limestone gravel. Surface water is somewhat scarce, but a plentiful supply may be obtained by digging 10 to 20 feet.\n\nTp. 12. Is principally open prairie with occasional patches of scrub poplar in the west. Good water in a number of ponds. Soil, a rich dark sandy loam with gravelly clay subsoil.\nR. 20.\n\nTp. 9. Is undulating open prairie. A good growth of poplar on south part of section 27. The soil is a rich dark sandy loam, one to three feet deep, with a clay subsoil. The township is rather low and wet for general farming, but is splendidly adapted for stock.\n\nTp. 10. Is traversed by the Assiniboine, and the Little Saskatchewan, 75 to 100 feet wide, with a swift current, joins it in section 33. A belt of ash, elm, &c., grows along the banks of both streams. Surface varies from level to rolling, with soil of a rich dark loam, and gravelly clay subsoil.\n\nNote.—In south-west quarter, poplar suitable for building, &c.\n\nR. 21.\n\nTp. 6. Consists of open prairie, partly level, partly rolling, with a soil of rich dark loam, one to three feet deep, and a subsoil of clay, mixed in some places with a little gravel. Is well drained by a number of small ravines running into a creek, which in turn empties into the Souris, in the adjoining township north.\n\nA plentiful supply of excellent water is furnished by streams and ponds. This is a capital township for general farming purposes.\n\nTp. 8. Is undulating open prairie, with a soil of rich dark loam, one to three feet deep, and clay subsoil, mixed in some places with sand and gravel. Plum Creek, flowing in a south-easterly direction, cuts off the south-west corner and drains a large portion of the township. Good water is to be found in the ponds. Hay at the rate of two to three tons per acre on any of the numerous meadows in the northern part, while remainder or southerly portion of the township is well adapted for general farming purposes.\n\nAdjacent to Plum Creek are a number of islands of good-sized poplar, suited to settlers’ wants.\n\nTp. 9. This township is composed of level and undulating prairie, with numerous ponds and meadows of good water and hay. The soil is chiefly a dark sandy loam, with gravelly clay subsoil. Especially well suited for grazing purposes.\n\nTp. 10. Is chiefly undulating open prairie, with a soil of dark loam and sandy clay subsoil. The northerly part is traversed by the As-\nR. 21.\n\nAssiniboine River, with a fair growth of timber along its banks, suitable for fuel and fencing. Alexander Station (section 17) on the line of the C. P. R., which crosses the southern part, is convenient to any part of the township south of the Assiniboine River.\n\nTp. 11. Is very hilly and broken by the valleys of the Assiniboine and Little Saskatchewan. The only timber is along the banks of the rivers; a mixed growth of ash, elm and oak. The bottom lands consist in a very rich dark soil, chiefly alluvial, while the upland is lighter, and rather stony.\n\nTp. 12. Is traversed in a south-westerly direction by the Little Saskatchewan. The current is very strong and rapid. There are a number of mill sites on the stream, particularly one on section 15, which at no distant date must become valuable properties. Surface is gently undulating, with a soil of sandy loam and sandy clay subsoil.\n\nR. 22.\n\nTp. 7. This township is all disposed of but section 31. The south half of the section is low; north half rolling, with deep marshes. The soil is a light sandy loam. A meadow, two hundred acres in extent, in south half, which will cut one to one and a half tons per acre of good hay.\n\nTp. 8. Is traversed by Plum Creek, which has well-defined banks five to thirty feet high, and water five feet deep. Surface is undulating, with a soil of sandy loam on a sandy clay subsoil. Numerous meadows and ponds in the township, giving a good supply of hay and water. Some of the sections are well wooded. On the whole, it cannot be recommended for farming purposes.\n\nTp. 9. Griswold, in the north-west corner of the township, is on the line of the C. P. R. Surface is undulating, with a soil chiefly of sandy loam, with sandy clay subsoil.\n\nSections 9, 27, 33 and 35 are suitable for cultivation. Remainder of township only fit for grazing.\n\nTp. 10. The Assiniboine River, with a strong current, its banks well wooded with large ash, elm and oak, enters this township on\nR. 22.\n\nthe west boundary, at the quarter section post of 19, and flows in a north-easterly direction. Except where broken by banks and ravines of valley, the township is undulating open prairie, with a rich soil of dark loam and clay subsoil, mixed in some places with gravel or sand.\n\nTp. 11. Is chiefly open prairie, well watered in the south-east by the Assiniboine and in the south-west by Oak River. There is a good growth of ash, elm and oak along the banks of the former stream, and in the west part of the township occasional bluffs of poplar. The soil is good, being a rich dark loam, with clay and sand subsoil.\n\nTp. 12. Is traversed by Oak River in the south-east. Although it is chiefly open prairie, a sufficient quantity of timber for settlement purposes may be found in small bluffs scattered throughout the township. The soil is a good dark loam, with a gravelly clay subsoil, well adapted for general farming purposes.\n\nTp. 13. Except that there is no stream, the township is the same as the preceding.\n\nR. 23.\n\nTp. 6. Is traversed diagonally by the Souris River. All the lands are sold but sections 17, 19, and 31. The first of these is cut by the river, and is well suited for farming: 19 is all meadow land, which will cut from one and a half to two tons per acre; 31 is nearly all marsh, which is excellent grazing land.\n\nTp. 7. The Souris river, which cuts off the south-east corner, has a strong and rapid current with a small quantity of oak, poplar, etc., along its banks. There are extensive meadows with numerous ponds of good water. Soil is a dark loam, with sandy clay subsoil.\n\nOn the whole, this township is best adapted for grazing purposes.\n\nTp. 8. Is chiefly rolling, breaking into sandhills in the north. Numerous marshes and hay meadows make this township better adapted for stock than ordinary farming purposes.\n\nTp. 9. The Assiniboine river runs through north tier of sections.\nR. 23.\n\nThe valley is well wooded with elm, poplar, etc. North half of township is composed of rich dark loam, with clay and gravel subsoil. South half is similar to preceding township.\n\nTp. 10. Is chiefly taken up by the Indian reserve. South part is rolling prairie with a soil of rich dark loam, one to three feet deep, well adapted for general farming purposes. The Assiniboine river, its banks well wooded with ash, elm and oak, forms the south-east boundary of the Indian Reserve.\n\nTp. 12. Sold.\n\nTp. 13. All sold but west half of section 7. Surface is rolling, with a soil of sandy loam, and clay subsoil. Good water and grass in ponds and meadows.\nVIRDEN AGENCY.\n\nR. 24.\n\nTp. 6. The Souris river, flowing north-easterly, cuts off the south-east corner. Patches of poplar and scrub oak dot the surface which is also broken by sandhills and marshes.\n\nTp. 7. Is very much broken by sandhills. The soil throughout is so light as to be worthless for farming purposes. Indeed there is nothing of value in the township except the timber in the vicinity of Oak Lake and Plum creek. Parties desiring to purchase wood lots may examine field notes and ascertain where the best is situated.\n\nTp. 8. Oak lake is partially situated in this township. A large marsh lies on the east side of lake. On sections 3, 5 and 35 there is some bush land. Township is only fit for grazing.\n\nTp. 9. Oak Lake station on the line of the C. P. R. is located on section 23. The north-east corner is traversed by the Assiniboine river with a quantity of good elm and maple along its banks. Township abounds in large hay marshes which will cut one and a half to two and a half tons per acre. North half is adapted for stock farming; south half is very inferior.\n\nTp. 10. Is well drained by the Assiniboine river which runs in a south-easterly direction through the southern portion and a creek which flows through north-west corner and joins the river in the south-east. Timber is found in considerable quantities in the vicinity of the Assiniboine and of sufficient size for settlement purposes. Surface is generally rolling with a soil of rich sandy loam and sandy clay subsoil. Sections 9, 15 and 35 are well adapted for general farming purposes; remainder best suited for grazing.\n\nTp. 11. All sold.\n\nTp. 12. Is chiefly rolling prairie with occasional poplar bluffs; a number of lakes of good water are to be found in the township. The soil is a dark sandy loam with a gravelly clay subsoil, well adapted for general farming purposes.\nR. 24.\n\nTp. 13. The south half is high rolling prairie with numerous poplar bluffs suitable for building purposes, fuel and fencing. There is a beautiful lake, surrounded by bush in section 7. North half is gently rolling with sufficient timber to meet the wants of settlers. Soil is a dark loam with clay subsoil, in some places mixed with sand and gravel. Well adapted for general farming purposes.\n\nTp. 14. Same as preceding.\n\nR. 25.\n\nTp. 5. Sold.\n\nTp. 7. Consists chiefly in hay marshes and meadows, which will cut from two to three tons per acre of good hay. There are numerous ponds of water. On the whole, the township is only fit for grazing purposes.\n\nTp. 8. Is traversed by Pipe Stone Creek. Oak Lake, a fine sheet of water, is partially in the north-east corner. Occasional islands of timber, suited to settlers’ wants, may be found in the northerly part of the township. Large hay marshes and meadows throughout, making a choice district for grazing purposes.\n\nTp. 9. Most of this township is marsh and hay meadow, which will cut from one and a half to two and a half tons per acre. A large number of ponds are scattered throughout. Sand hills in the north. Occasional patches of bush, fit for fencing, &c. The line of the C. P. R. crosses the north-east corner. Sections 33 and north half of 35 are well suited for farming; the remainder is best adapted for stock raising.\n\nTp. 10. Is traversed by the Assiniboine River, in the vicinity of which is to be found a good growth of oak, elm, &c., with a number of poplar bluffs in other parts of the township. The line of the C. P. R. cuts off the south-west corner. Good water is to be found in almost any part of the township. Well adapted for mixed farming.\n\nTp. 11. Is traversed on the west side by the Assiniboine River, with a mixed growth of oak, elm, ash and poplar along its banks. The surface is generally rolling, with a soil of dark sandy loam on a\nR. 25.\n\nclay and gravel subsoil. A fair growth of grass and good water throughout the township. Is fairly well adapted for general farming purposes.\n\nTp. 12. Is cut on the west side by the Assiniboine River. In all respects same as preceding.\n\nTp. 13. Is rolling, in some places hilly, with occasional patches of poplar bush. The soil is chiefly a dark sandy loam, with a sandy and gravelly subsoil. Arrow Creek cuts off the north-west corner. There are a number of good hay marshes and meadows, and plenty of good water. Taken altogether, the township is adapted for general farming purposes.\n\nTp. 14. Is well drained by a number of ravines. Arrow Creek flows through the east half of the township. The surface is undulating, with occasional bluffs of medium-sized poplar scattered over it. Soil, &c., same as preceding.\n\nTp. 15. Section 5 is the only available one in the township. Is gently undulating, with an occasional patch of small poplar. The soil is a black loam, with clay subsoil. Water and grass good. Well suited for farming.\n\nR. 26.\n\nTp. 6. Generally low, with numerous hay meadows, which will cut two tons per acre. This township is best adapted for stock raising.\n\nTp. 7. Is a light sandy loam, with a light subsoil. The surface is broken in the north by the banks of Pipe Stone Creek, which are 175 feet high. This township cannot be recommended for general farming purposes.\n\nTp. 8. Is traversed in a north-easterly direction by Pipe Stone Creek. The surface, as a rule, is undulating, with a number of marshes and meadows, which grow large quantities of hay. The soil is rather light, consisting of a sandy loam. The township is better adapted for grazing than general farming purposes.\n\nTp. 9. Is undulating open prairie, with a soil of sandy loam and a sandy clay subsoil. Sections 17, 19 and 33 are well adapted for\nR. 26.\n\ngeneral agricultural purposes; remainder best adapted for grazing purposes.\n\nTp. 10. Is gently rolling prairie, traversed by Boss Hill Creek. The soil is generally a sandy loam, with a sandy clay subsoil. Virden, a station on the line of the C. P. R., is located on section 22. Almost all of this township is fit for farming purposes.\n\nTp. 11. Gently rolling prairie, with a soil of dark sandy loam and gravelly clay subsoil, with sand in some localities. Water and hay in numerous ponds and meadows good. A capital township for general farming purposes.\n\nTp. 12. The north-east corner is traversed by the Assiniboine River. Banks of valley and ravines are fairly wooded. In addition to water in river, there are a number of ponds. The township is generally rolling; the soil and subsoil same as preceding.\n\nTp. 13. The Assiniboine flows through the township in a south-easterly direction, while Arrow Creek runs south-westerly and empties into the river near the centre of the township. Sufficient timber for settlement purposes may be found in the vicinity of the river and creek. Surface rolling; soil same as preceding.\n\nTp. 14. Is gently rolling prairie, with numerous bluffs of poplar suitable for building and fencing purposes. Good hay meadows and small ponds are numerous. The soil is a rich sandy clay, with sandy clay subsoil; well adapted for farming.\n\nR. 27.\n\nTp. 7. Is chiefly undulating prairie; soil a sandy clay loam, with gravelly clay subsoil. There are numerous hay meadows, which will cut one to two tons per acre; water is plentiful. 13, 15, 31 and 35 are excellent farming sections; the remainder is best adapted for grazing.\n\nTp. 8. Is chiefly undulating prairie, well watered. Numerous small meadows are scattered throughout the township. Well adapted for mixed farming.\n\nTp. 9. Is hilly in north-east corner; remainder is undulating open\nR. 27.\n\nprairie, with a rich dark sandy loam, subsoil gravelly clay in some places, mixed with sand. Water and grass same as preceding. Seventy-five per cent. of township adapted for general farming purposes.\n\nTp. 10. Rolling prairie, traversed in the south-west by a small stream. Soil, as a rule, is a sandy loam, with a sandy clay subsoil. There are several small poplar bluffs in vicinity of creek. Numerous good hay meadows and ponds of good water make it a very desirable township for stock grazing.\n\nTp. 11. Undulating to hilly, with numerous ponds of good water and small hay meadows. The soil is generally a dark sandy loam, with sandy clay subsoil, well adapted for general agricultural purposes. Sections 3, north half of 13, 21, north half of 25, 27 and 35 are amongst the most desirable.\n\nTp. 12. Sold.\n\nTp. 13. The Assiniboine River flows down the east side. Its banks are fairly well timbered with a mixed growth of oak, aspen, &c. Occasional patches of small wood may be found in other parts of the township. Surface is generally rolling, with a soil of rich dark loam and clay subsoil, sometimes mixed with gravel. Well adapted for general farming purposes.\n\nTp. 14. Is traversed by the Assiniboine River, with a belt of good timber, oak, elm, &c., along its banks. Except part broken by river, the surface is rolling prairie; soil dark loam, with clay subsoil. A number of excellent hay meadows and ponds of good water at intervals throughout the township. This township is well adapted for mixed farming. 9, 17, 19, 21 and 23 are the best sections.\n\nR. 28.\n\nTp. 7. Is undulating, with numerous ponds of good water and meadows of excellent hay. The soil is chiefly sandy loam, with clay and gravel subsoil; best adapted for grazing.\n\nTp. 8. Same as preceding.\n\nTp. 9. Is traversed by Pipe Stone Creek, with a limited quantity of poplar, &c., along its bank. Small meadows and ponds occupy the larger portion of the surface on the north-east side of the creek,\nR. 28.\n\nwhile the north-west side is comparatively dry. Soil is a dark sandy loam, with clay and gravel subsoil; in some places sandy clay subsoil. Well adapted for mixed farming.\n\nTp. 10. Surface is well drained by a number of small ravines running in a south-easterly direction. Undulating prairie, comparatively dry. Soil and subsoil same as preceding. Adapted for general farming.\n\nTp 11. Undulating prairie, with small ponds and hay meadows. The line of the C. P. R. crosses the township in a south-easterly direction. Surface is generally undulating, with a good soil of dark loam and clay subsoil, sometimes mixed with sand and gravel. Nearly all the township is suited for agriculture.\n\nTp. 12. Open rolling prairie, with numerous ponds and hay meadows. Soil sandy loam, better adapted for grazing than general farming purposes. Elkhorn Station, on the line of the C. P. R., is situated on section 3.\n\nTp. 13. The west half of 7 and east half of 31 are the only lands unsold. Surface is rolling, with a soil of sandy loam and gravelly clay subsoil. Water and grass good. Suitable for farming.\n\nTp. 14. Sold.\n\nTp. 15. Is chiefly undulating prairie, broken on the east by the banks of the Assiniboine Valley. Timber in sufficient quantities to supply settlers' wants may be found in the vicinity of the river. The township is traversed west to east by Scissors Creek, a tributary of the Assiniboine. The soil is a dark sandy loam, with a subsoil of clay and gravel. By reason of numerous hay meadows and ponds, this township is better adapted for grazing than general farming purposes. Section 17 is choice farming land.\n\nTp. 16. Is light sandy loam, traversed by the Assiniboine River and Beaver Creek. Bluffs of small poplar, &c., are scattered throughout the township, especially in the neighborhood of the rivers. On the whole, this township cannot be recommended for general farming purposes.\nMOOSOMIN AGENCY.\n\nR. 29.\n\nTp. 8. Is a rich dark loam, 6 to 20 inches deep, with clay subsoil. The surface is rolling open prairie, traversed by a small creek containing good water. There are a number of choice hay meadows in various parts of the township, particularly along creek bottom, which will cut from one to two tons per acre. 1, 3, 17, 19, 31 and 33 are the best sections, and will make excellent farms; remainder of township better adapted for stock raising.\n\nTp. 9. The Pipe Stone River cuts off the north-east corner. Surface is generally rolling, with a soil of dark loam and gravelly clay subsoil. A small quantity of scrub oak and poplar along banks of Pipe Stone Valley. 5, 7, 13, 17, 19, 27, 31 and 33 are sections well adapted to agriculture; remainder for mixed farming.\n\nTp. 10. Is gently rolling prairie, with a good sandy clay loam and gravelly clay subsoil. There are several mill sites in this township on the Pipe Stone, which intersects south-west corner. Numerous good hay meadows and ponds. This district, too, is well opened up by one of the oldest trails in the country—that from Brandon to Moose Mountain and other points in the far west. For stock farming it would be difficult to find a more desirable locality than this township.\n\nTp. 11. Superfluous water may be readily drained into two ravines which traverse the township in a southerly direction. Shallow ponds and good hay meadows are numerous. The soil is a rich loam, with gravelly clay subsoil. Sections 1 and 31 are particularly choice.\n\nTp. 12. The line of the C. P. R. crosses in a north-westerly direction, and a creek flowing south-easterly drains a large portion of the township. The surface is gently rolling prairie, with a soil of dark loam, clay and gravel subsoil. An abundance of good water and hay makes it desirable for mixed farming.\nR. 32.\n\nwith building material, fuel, &c. The soil is a rich dark loam, with gravelly clay subsoil. On account of its numerous meadows and ponds and splendid shelter, the township is better adapted for grazing than general farming.\n\nR. 33.\n\nTp. 11. Is well drained by the Little Pipe Stone, which traverses the township from east to west, and a number of coulees which empty into it from north and south. Timber in limited quantities may be found in the vicinity of the stream. The soil is a rich dark loam, with a good clay subsoil, occasionally mixed with gravel. An abundance of good water and numerous small meadows, which will cut an excellent quality of hay, are to be found in almost any part of the township. This is a really good township for general farming purposes.\n\nTp. 12. Is undulating prairie, with a soil of rich dark loam and clay subsoil. A number of ponds and meadows give a good supply of water and hay. The township is well suited for farming.\n\nTp. 13. Timber suitable for fencing, fuel, &c., may be found in the neighborhood of the Pipe Stone, which flows through the north part of the township. Soil, water and hay same as preceding.\n\nTp. 14. The line of the C. P. R. cuts off the north-east corner. The surface is chiefly rolling, with numerous groves of poplar and willow. A branch of the Pipe Stone traverses the township in a southeasterly direction. Good water in ponds and excellent hay in meadows make it a desirable grazing locality, although 19, 23, 33 and 35 are good sections for general farming purposes. The soil is a dark sandy loam, with gravelly clay subsoil.\n\nTp. 15. Wapella (section 10) is on the line of the C. P. R., which crosses the township in a north-westerly direction. The surface is rolling, with a soil of dark sandy loam and sandy clay subsoil. Numerous hay marshes and meadows, a plentiful supply of good water and excellent shelter, are sufficient reasons for classing this amongst the best grazing townships in the North-west.\nBROADVIEW AGENCY.\n\nR. 1, west of 2nd I. Meridian.\n\nTp. 11. Surface gently rolling; the soil throughout being a black sandy loam, varying from six to 20 inches in depth, with subsoil of clay and small percentage of gravel. There are numerous ponds in this part of the township (though many of them can be readily drained), and, taken on the whole, it is well suited for stock raising. There is a fair amount of timber to be had, section 25 being estimated to cut about eight hundred cords.\n\nTp. 12. The surface is gently rolling prairie. The soil in the northern part of the township is a rich black loam, from one to two feet deep, while on the southern part it is more of a sandy loam. In the month of June, when the examinations were made, a number of ponds were found; but many of them, with drainage, could be easily transformed into excellent hay meadows. The township is sufficiently wooded to meet the requirements of settlers, and on some sections as much as 500 cords of wood can be cut. It is well adapted for farming and grazing purposes.\n\nTp. 13. Surface is rolling, somewhat broken in the north-east by the banks of the Pipe Stone Creek, which runs through that part of the township. The soil is principally a gravelly loam, with clay subsoil. Water is plentiful and of good quality, and there are many natural drains running through the township, making the reclaiming of low and wet lands an easy matter. There is a scattering of aspen and willow on a number of the sections, some of which would answer for fence rails. Most of the sections are well suited for general farming purposes, and those that are not would do well for grazing.\n\nTp. 14. Is rolling prairie, traversed by natural drains, which can be utilized in reducing the area of wet land. The soil is a black sandy loam, mixed with gravel, and the subsoil is clay, in which there is a small percentage of gravel. The grass is plentiful and of fair quality, as also is the water; and sections having an excess of ponds and low land can be drained at a small cost. Many of the\nsections are well timbered, and will afford an ample supply of firewood and fence rails for settlers. The township is well suited for general farming purposes.\n\nTp. 15. Surface is rolling prairie, considerably broken by marshes and drains. The soil is principally a black loam, with clay subsoil, which in some places is mixed with a percentage of gravel. There is a good growth of prairie grass on the uplands, and the edges of ponds and marshes will yield an average crop of one and a half tons per acre of good hay. Water is abundant both in marshes and running creeks. The low and wet land can be cheaply reclaimed. The C. P. R. runs through the north-west part of the township, and Burrows Station is located on section 31, so that this locality is a desirable one on account of railroad facilities. The township may be considered a fairly good one for agricultural and stock raising purposes.\n\nR. 2, West of 2nd I. M.\n\nTp. 12. Surface features, soil, water and grass same as preceding.\n\nTp. 13. Is rolling prairie, broken by ridges and marshes. The soil is a dark sandy loam, with clay and gravel subsoil. Grass on the uplands is abundant, and plenty of hay can be cut on the meadows. Water of fair quality can be had on every section in such abundance at present as to render the township as a whole more desirable for stock raising than general farming purposes. Sections 5, 19 and 23 are mentioned by the examiners as suitable for tillage.\n\nTp. 14. Surface is rolling prairie, breaking into hills on the southwest. General slope is towards the Pipe Stone River, which runs through sections 19, 17, 16, 9, 10, 11 and 12. The soil is a dark sandy loam, with clay subsoil, in which there is found a small percentage of gravel. There is a good growth of grass on the uplands and sufficient hay in the meadows and around the margins of the marshes to supply every requirement of settlers. Water is to be found in the ponds and marshes, while that of the Pipe Stone River is pure, ever running water. Timber, both for firewood and fencing, abounds in the township. The majority of the sections are well adapted for general farming; remainder reported as more suitable for stock raising.\nR. 2.\n\nTp. 15. Is rolling prairie, with occasional patches of poplar, suitable for fencing or fuel. In other respects same as preceding.\n\nTp. 16. Is rolling prairie, much broken by sloughs and marshes. The soil is a dark sandy loam, with a sandy clay subsoil. Good grass on the uplands and the margins of the marshes and meadows. There is a small growth of poplar scattered over the township, but not in sufficient quantity to be taken into consideration.\n\nWhitewood Station, on the C. P. R., is located on section 7. This township would need a good deal of drainage to make it an agricultural one. Meantime it is best adapted for stock raising.\n\nR. 3, west of 2nd I. M.\n\nTp. 12. Is rolling prairie, intersected by natural drains, containing water of fairly good quality. The soil is chiefly a dark sandy loam, with clay subsoil, containing a small percentage of fine gravel. Grass on the uplands is fair; and small marshes, that dry up in the summer, afford sufficient hay land. Taken as a whole, this half of the township is well suited for general farming.\n\nTp. 13. Is gently rolling prairie, splendidly drained by creeks, which run north and empty into the Pipe Stone River. The soil is a dark sandy loam, on a sandy and gravelly clay subsoil. Water is plentiful and of good quality. Good grass and plenty of hay land for all requirements. This is a first-rate township for general farming.\n\nTp. 14. The surface is gently rolling, intersected by natural drains and creeks, the latter joining the Pipe Stone River, which runs through the north-east quarter of the township. The soil is a rich dark sandy loam, with clay and gravel subsoil. The water is very good; and owing to the numerous creeks and natural drains, all low and wet land can be easily and cheaply reclaimed. Grass on the uplands is good, and the bottom lands of creeks and margins of marshes will give sufficient hay. (The estimate of timber at the time of examination was as follows: Section 13, one hundred and fifty cords; section 19, forty cords; section 25, two hundred cords; section 27, three hundred cords and four thousand to five thousand\nR. 3.\n\nfence rails; section 31, one hundred and fifty cords; section 33, sixty cords; section 35, three hundred cords.) This is a capital township for general farming.\n\nTp. 15. The surface is rolling, with occasional patches of small poplar and numerous marshes and meadows. There are several natural drains running through the township, which will be available for reclaiming wet lands. The soil is a black sandy loam, with subsoil of clay and gravel. Water is plentiful and good, and the grass on the uplands is of fair growth, while the meadows will give a large yield of hay. This township, until drained, will be best adapted for mixed farming. It lies within easy reach of Percival and Whitewood, both stations on the line of the C. P. R.\n\nTp. 16. The line of the C. P. R crosses the township in a northerly direction. Percival Station is located on section 19. In other respects the township is the same as the preceding.\n\nR. 4, west of 2nd I. M.\n\nTp. 12. The surface is rolling prairie, with very little wet land. The acreage of arable land is much above the average. The soil is a light clay, somewhat sandy, with a gravelly clay subsoil. Water is good and plentiful. There is a fair growth of prairie grass, and hay can be cut on the edges of the marshes and drains. Its proximity to Moose Mountain will enable settlers to obtain fuel without difficulty. This part of the township is well adapted for general farming.\n\nTp. 13. Is open rolling prairie. The soil is sand and clay loam, with subsoil of clay. There is plenty of water, and natural drains which can be utilized for carrying off the surplus. The grass on the uplands is good, but that around the marshes is coarse and mixed with weeds, so that hay would be inferior. Altogether the township is well adapted for general farming purposes.\n\nTp. 14. Is gently rolling prairie, much broken by marshes; these however can be drained towards the Pipe Stone Creek, which runs past the north end of the township. The soil of the south half is a black loam, with clay subsoil; that of the north half is sand and\nR. 4.\n\nclay loam, with clay subsoil. There is good water and plenty of it. Grass on the uplands is good, but is coarse around the marshes. The township, as a whole, is best adapted for grazing, but section 9 is reported as choice for general farming purposes; and as to section 15, the examiner says: \"It would not require much labor to drain this section, when it would be superb for agricultural purposes.\"\n\nTp. 15. Surface is gently rolling prairie. The soil is a clay loam, mixed in some places with sand and clay, with sandy clay subsoil. Water is plentiful and good, especially in Pipe Stone Creek, which flows through the south half of the township. There is a fair growth of prairie grass on the uplands, and the meadows will cut about two tons of hay per acre. This township is fairly well suited for general farming purposes, though some sections, by reason of low wet land, are better adapted for grazing purposes.\n\nTp. 16. Is gently rolling prairie, broken by ponds and marshes. The soil is a sand and clay loam, with a subsoil of clay, mixed in some places with a percentage of gravel. Water is good in the ponds and marshes. There is an average growth of grass on the uplands, but the hay about the lowlands will be coarse. A good deal of draining is necessary before this township can be farmed. Section 19 is reported by the examiners as \"a superb section for farming purposes; and what few low lots there are, can be easily drained.\"\n\nR. 5, west of 2nd I. M.\n\nTp. 12. Surface is rolling prairie. The soil is a light gravelly clay, with gravelly clay subsoil. The grass is of fair quality and growth on the uplands, but there is very little hay land. This part of the township is well suited for general farming purposes.\n\nTp. 13. Surface is rolling, with a deep marsh in the north half. Water and grass are both good and plentiful. The soil is a sandy clay loam. Except for marsh, the township is adapted for general farming purposes—soil rating $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 14. Is rolling prairie, with patches of poplar bush (in the north-east part of the township) sufficiently large for fence rails and\nR. 5.\n\nfuel. The soil is a sandy loam, with sandy clay subsoil. Much of the land is low, with a superbundance of water. In its natural state this township can only be recommended for grazing purposes. There is plenty of good hay. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 15. The Pipe Stone River runs in an easterly direction. 75 per cent. of the surface is covered with a dense growth of small poplar and willow. Numerous marshes and ponds occupy a large portion of the remainder. This township cannot be recommended for general farming purposes.\n\nTp. 16. The line of the C. P. R. crosses the north part of the township, with Broadview, a rapidly-growing town and terminus of a railroad division, located on section 25. Weed Creek, taking its rise in a lake of the same name, winds its tortuous course through a valley about five chains in width and thirty to forty feet below the prairie level, on its way to join its waters with the Qu'Appelle, a little east of Crooked Lake.\n\nWeed Lake, charming and picturesque, is located chiefly in the south-east corner of the township. At certain points the banks are bold and precipitous, with a rugged rock-bound shore; at others, a gentle upward slope from the gravelly beach backward to the sky line, a distance of forty chains, with an occasional oak and poplar grove to lend variety to the scene and enhance the beauty of a most delightful spot. Some of the sections bordering on the east side of the lake are very beautiful, section 1 being reported by the examiner as the choicest.\n\nThe township is chiefly open prairie, with a soil of sandy loam, and well adapted for settlement.\n\nR. 6, west of 2nd I. M.\n\nTp. 13. Is rolling prairie, with a soil of dark sandy loam and gravelly clay subsoil. The south half is not so rich as the north. There is an abundance of hay and water. The entire township, except sections 1, 3, 5, 17 and 19, which are good grazing sections, is well suited for settlement.\n\nTp. 14. Same as preceding.\nR. 6.\n\nTp. 15. The Pipestone River, flowing through a gorge one hundred and thirty feet deep, cuts off the north-east. Surface is rolling, breaking into hills in the north. A considerable quantity of bush is to be found growing in bluffs throughout the township. The soil is a dark sandy clay loam. Rates $1\\frac{1}{2}$, relative value 3.\n\nTp. 16. The C. P. R. cuts off the north-east corner of the township. Oakshela Station is located on section 33. The Pipe Stone River touches the south-west corner. The southerly part of the township is broken by the Weed hills, which are well wooded and furnish an ample supply of fencing, fuel, &c., for settlers. The north half is chiefly open prairie. The soil of the entire township is a sandy clay loam, suitable for farming. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nR 7, west of 2nd I. M.\n\nTp. 13 and 14. Open rolling prairie, with a soil of dark sandy clay loam and a sandy clay subsoil. Splendid hay meadows and ponds of good water make these townships desirable for grazing purposes.\n\nTp. 15. Is partially in the Weed hills. Twenty to twenty-five per cent. of the surface is covered with small poplar, suitable for settlement purposes. Soil, etc., same as preceding.\n\nTp. 16. Is broken in the south-east by the Weed hills, which are fairly well wooded, the timber being sufficiently large for settlement purposes. The Pipe Stone River flowing south-easterly, with a good supply of water, drains the township. The soil is chiefly a sandy clay loam, with gravelly clay subsoil. Taken altogether, the township is best adapted for grazing purposes.\n\nTp. 17. Grenfell, a station on the line of the C. P. R., is situate in the south-west corner of the township. The surface is rolling; and water and grass good and plentiful. The soil is a dark sandy loam, with gravelly clay subsoil. The township is well adapted for farming purposes.\nWOLSELEY AGENCY.\n\nR. 8, west of 2nd I. M.\n\nTp. 13. Consists of gently rolling prairie, with a soil of clay loam six to sixteen inches deep, and a gravelly clay subsoil. The ponds are perhaps not sufficiently numerous, but the water is good. A really fine township for general farming purposes. Soil rates $1\\frac{1}{2}$, relative value, 2.\n\nTp. 14. Is rolling prairie, well drained by a tributary of Moose Mountain Creek. Ponds of good water are to be found at intervals throughout the township. The soil is chiefly clay loam (in some cases mixed with a little gravel) and a gravelly clay subsoil. With the exception of one or two sections, the township is well adapted for general farming purposes. Soil rates $1\\frac{1}{2}$, relative value 2.\n\nTp. 15. Is traversed by Summer Berry Creek. The surface is rolling, interspersed with numerous ponds and rich meadow lands. There are also several small but very beautiful lakes in the township. The Weed hills, a few miles to the north-east, are well wooded, furnishing material for building and fencing, and plenty of fuel. The soil is a rich clay loam, mixed, on the uplands, with a small percentage of gravel, and a clay subsoil. Although the township, as a whole, is better adapted for grazing than general agriculture, yet sections 5, 7, 17 and 19 will make capital farms. Soil rates $1\\frac{1}{2}$, relative value, 2.\n\nTp. 16. Is partially in the Weed hills. The south half is well wooded with poplar, suitable for fencing, fuel, etc. A lake of good clear water is situate in the southern part of the township. The Qu’Appelle trail crosses the north half, which is almost entirely open rolling prairie, with an excellent soil of sandy clay loam, every section of which may be cultivated. The south half can only be recommended for grazing purposes. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nTp. 17. The C. P. R. (Summerberry Station section 7) crosses the south half of this really fine agricultural township, offering every convenience to settlers for the conveyance of farming implements and other things necessary for the successful prosecution of their work.\nR. 8.\n\nThe surface is rolling, with a soil of dark loam six to sixteen inches deep, and a gravelly clay subsoil. The township is splendidly drained by a number of small ravines which traverse it in various directions. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nR. 9, west of 2nd I. M.\n\nTp. 13. Is traversed by Moose Mountain Creek, fifty to seventy-feet below the prairie level. The surface is chiefly open rolling prairie, with a soil of gravelly clay loam and a clay subsoil. Throughout the township rich meadow lands alternate with dry uplands, offering excellent facilities for mixed farming. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 14. Is rolling prairie, with a soil of sandy clay loam and gravelly clay subsoil. The south half, which is well adapted for general farming purposes, is well drained by two deep coulees. The north half contains numerous ponds and grass marshes, which render it a capital locality for grazing purposes. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 15. Wolf Creek (having its source in this township) flows north into the Qu'Appelle. The surface is rolling, broken by numerous ponds and hay marshes. The soil is a sandy clay loam, with gravelly clay subsoil. 23, 27, 33 and 35 are the only sections that can be recommended for general farming; the remainder is well adapted for general grazing purposes. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 16. Wolf Hills, so called, lie almost wholly within this township; in point of fact, however, the surface, instead of being hilly, is simply high rolling prairie, beautifully drained by a number of coulees which intersect it. The soil is generally a dark sandy loam, with a gravelly clay subsoil. Ninety per cent. of land is all that can be desired for farming purposes. There are several bluffs of small poplar on the east side of the township. Soil rates $1\\frac{1}{2}$, relative value, 2.\n\nTp. 17. The C. P. R. crosses the south half. Wolf Creek cuts off the north-west corner. In other respects the township is identical with the preceding.\nR. 9.\n\nTp. 18. Is traversed by the magnificent Qu'Appelle Valley, with its wondrously rich bottom lands of alluvial deposit. Wolf Creek, emptying into the river in this township, and a number of ravines, make the drainage perfect. Timber for domestic purposes may be had in the neighborhood of the streams. The surface is rolling, with a soil of rich clay loam, in some places containing a small percentage of sand, and clay subsoil. The entire township is good, but sections 27, 31, 33 and 35 are superb. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nTp. 19A. The surface and soil is the same as the preceding township. No timber. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nR. 10, west of 2nd I. M.\n\nTp. 13. Is rolling prairie, with a soil of clay loam, mixed in some places with sand, in others with gravel. There are numerous meadows of excellent hay and ponds of good water, making it more valuable as a grazing than a general farming district. 15, 21 and 27 however will make good farms, especially 27, which is choice. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 14. Is traversed in a south-easterly direction by Moose Mountain Creek, and well watered by numerous ponds. Large hay meadows are numerous. The soil is a sandy loam. This township cannot be highly recommended for agricultural purposes.\n\nTp. 15. The north half consists of poplar and willow bush and open prairie. Hay marshes and ponds of good water abound. The south half is equally wet. The surface is rolling, with a soil of rich dark loam and a clay and gravel subsoil. Altogether it is a capital grazing township, but cannot be recommended for agriculture.\n\nTp. 16. Wolf Creek cuts off the north-east corner. The surface is rolling, with numerous bluffs of small poplar and willow in the south half. North half is open prairie, with plenty of water and grass. The soil is a rich dark loam, eight to eighteen inches deep. Sections 13, 25 and 27 are choice farming lands. The remainder of the township is best adapted for grazing. Soil ranges $1\\frac{1}{2}$, relative value 3.\n\nTp. 17. Wolseley Station, on the south-east corner of the township, on the C. P. R., is the centre of a fine agricultural district. The\nR. 10.\n\nsoil is a rich dark loam, with a gravelly clay subsoil. Wolf Creek traverses the township in a north-easterly direction on the east side, with some poplar bush in the immediate vicinity. Well adapted for general farming purposes. Soil rates 1, relative value 2.\n\nTp. 18. The Qu’Appelle River enters this township at section 31, and flowing in a south-easterly direction, leaves it at section 13. A sufficient supply of timber may be had along the banks of the river and other parts of the township to meet the wants of settlers. The surface is rolling, dotted here and there with islands of poplar and ponds of good water. A very desirable township for general farming purposes. Soil rates 1, relative value 2.\n\nTp. 19A. Is rolling prairie, with a rich clay loam. The Qu’Appelle Valley lies adjacent to the south boundary of the township. Good wood, good water, good hay. Desirable in every respect for general farming purposes.\n\nR. 11, west of 2nd I. M.\n\nTp. 13. The surface is rolling, largely interspersed with grass marshes and ponds of good water. The soil is a sandy clay loam and gravelly clay subsoil. Sections 23 and 25 will make good farms; remainder of township, until drained, only fit for grazing. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 14. The north half is traversed by Moose Mountain Creek, which expands, in section 25, into a beautiful spring-water lake, with gravelly bottom and stony shore. The surface is generally rolling, broken with numerous marshes and meadows. The soil is a sandy loam, with a subsoil of sandy and gravelly clay, well adapted for grazing purposes.\n\nTp. 15 and 16. Indian Reserve.\n\nTp. 17, Sintaluta Station, section 34, is on the line of the C. P. R. Indian Head hills break into the south end. The remainder of the township is rolling, with a soil of rich dark sandy loam and gravelly clay subsoil. Except south tier of sections, which are excellent grazing lands, the entire township is specially adapted for general farming purposes. Soil rates 1, relative value 2.\nR. 28.\n\nTp. 18. The Qu’Appelle River touches the north-east corner. The banks of the valley are well wooded with poplar suitable for fencing, fuel, etc. Occasional patches of same kind of timber in other parts of the township. The C. P. R. cuts off the south-west corner. The soil is a rich dark sandy loam, with gravelly clay subsoil. Suited in every respect to the wants of the agriculturist. Soil rates 1, relative value 2.\n\nR. 12, west of 2nd I. M.\n\nTp. 14. The north-east corner is intersected by Moose Mountain Creek. A number of small lakes are to be found in the north half. The surface, which is chiefly rolling, is dotted with numerous marshes and small ponds. The soil is a sandy loam, with gravelly clay subsoil. Sections 9, 17 and 19 are well adapted for farming, while the township, as a whole, is best suited for grazing purposes. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 18. The line of the C. P. R. crosses the south half of the township. In other respects same as preceding.\n\nR. 13, west of 2nd I. M.\n\nTp. 14. Is undulating open prairie with a soil of rich dark loam, six to sixteen inches deep, with a clay and gravel subsoil. A number of small ponds and meadows give a good supply of water and grass. Admirably adapted for general agriculture. Soil rates $1\\frac{1}{2}$, relative value 2.\n\nTp. 18. Is undulating, with occasional patches of poplar bush. The soil is a rich friable dark loam, with a gravelly clay subsoil. INDIAN HEAD (section 13), a thriving town on the C. P. R., is situated in the heart of one of the richest districts in the North-west, and bids fair to become, in a short time, a large business centre.\n\nEvery section in the township is good farming land. The head quarters of the Bell Farming Company is on this section, and that company alone have more than two thousand acres ready for crop this year. Soil rates $1\\frac{1}{2}$, relative value 2.\nREGINA AGENCY.\n\nR. 14, west of 2nd I. M.\n\nTp. 14. The surface is undulating. Several large coulees traverse the township in a south-easterly direction. The soil is a sandy clay loam, with a clay subsoil, mixed with a small percentage of sand and gravel. The whole township may be classed as medium farming land. Soil rates $1\\frac{1}{2}$, relative value 2.\n\nTp. 15. Is undulating open prairie, with a soil of good sandy clay loam, on a gravelly clay subsoil. Good water is to be found in any of the numerous ponds, and capital meadows, which will cut from one and a half to two tons per acre of excellent hay, are not uncommon. The entire township is medium farming land, not a section but will admit of cultivation. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 16. Surface is rolling, with soil same as preceding. A hay marsh, on section 23, will cut a large amount of hay. Water of fair quality is plentiful. The township is medium farming land, except on sections 23, 25, 27 and 33, which are best adapted for grazing. Soil rates 2, relative value 3.\n\nTp. 18. Qu’Appelle Station (section 21) on the C. P. R., which crosses the township from east to west, is the central point of an extensive and really fine agricultural district. The surface is rolling, in some parts densely wooded, while in other parts open prairie and bush alternate. The soil is chiefly a clay loam, twelve to twenty inches deep, with a clay subsoil. Soil rates 1, relative value $2\\frac{1}{2}$.\n\nR. 15, west of 2nd I. M.\n\nTp. 14. Is traversed by the Wascana River (\"Pile of Bones\"). The surface is undulating, with a soil of sandy clay loam and gravelly clay subsoil. The township is fairly well adapted for general farming purposes. Soil rates 2, relative value $2\\frac{1}{2}$.\n\nTp. 15. Same as preceding.\n\nTp. 16. The trail from Wood Mountain to Fort Qu’Appelle crosses\nR. 15.\n\nthe township from south to north. The surface, soil, etc., is the same as the preceding.\n\nTp. 17. All sold.\n\nTp. 19. All sold.\n\nTp. 20. South tier sold; remainder, Reserve—Pasquaw's Band.\n\nTp. 21. The most westerly of \"the fishing lakes\" of the beautiful Qu'Appelle Valley stretches across the township from west to east. The banks of the valley are two hundred feet high, in many places precipitous, and well wooded with a growth of poplar sufficiently large for settlement purposes. The soil is a dark loam of great richness, on a subsoil of clay. Soil rates 1, relative value 2.\n\nNote.—This township is fractional; all south of the Qu'Appelle being included in Indian Reserve.\n\nTp. 22. Is rolling prairie, with a plentiful supply of good water and excellent hay. Several bluffs of small poplar in south half. The soil is a dark clay loam and clay subsoil. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nR. 16, west of 2nd I. M.\n\nTp. 18. McLean Station (section 13) is on the line of the C. P. R., which crosses the south half of the township. The surface is rolling, interspersed with numerous ponds and meadows of good water and hay, and patches of bush land, suitable for fuel, etc. Sections 17, 19 and 25 are good farming lands; remainder better adapted for stock grazing. Soil rates $1\\frac{1}{2}$, relative value 3.\n\nTp. 19. About sixty per cent. of the south half is covered with a dense growth of poplar (large enough for fencing, fuel, etc.) and willow brush. The north half is chiefly open prairie; there are, however, a number of bluffs of small poplar scattered throughout. The surface is rolling, with a rich soil of dark loam and clay subsoil, mixed in some places with a small percentage of gravel. As the township stands, the two north tiers of sections only are suitable for general farming purposes; but if the remainder were cleared, it would be quite equal to the north end. Soil rates 1, relative value of two north tiers $1\\frac{1}{2}$, relative value of remainder $3\\frac{1}{2}$.\nR. 16.\n\nTp. 20. Is rolling prairie, interspersed with numerous patches of small poplar, suitable for settlers' wants. The soil is chiefly a rich clay loam, with clay subsoil. Soil rates 1, relative value 2.\n\nTp. 21. Is traversed by the Qu'Appelle River, through the centre from west to east. The river is the boundary line between the Reserve of Muskowpeetung's band and the northerly part of the township. The surface north of the river is gently rolling, with a soil of dark sandy loam and gravelly clay subsoil. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 22. Sections 1, 3, 5 and 9 are the only railroad lands in the township. They are excellent farming lands. The surface is gently undulating, with an exceedingly rich soil of clay loam, on a clay subsoil. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nR. 17, west of 2nd I. M.\n\nTp. 17. Is traversed by a number of coulees through the entire township. The surface is open rolling prairie, with a soil of sandy clay loam and gravelly subsoil, and well adapted in all respects for general farming purposes. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 18. Is intersected in the south half by the C. P. R. Balgonie Station is situated on section 3. The surface is rolling, and the soil is chiefly a good gravelly loam, with gravelly clay subsoil. Water and hay plentiful. Soil ranges $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 19. The surface is rolling. About twenty per cent. of the township is covered with bush suitable for fencing, fuel, etc. The soil is a rich dark loam on a gravelly clay subsoil. Soil rates 1, relative value 3.\n\nTp. 20. Is undulating, with numerous bluffs of small poplar. Soil etc., same as preceding. Well adapted for general farming. Soil rates 1, relative value $2\\frac{1}{2}$.\n\nTp. 21. Is traversed by the Qu'Appelle. Two large creeks, one flowing north and the other south, join their waters with the Qu'Appelle in section 18. North of the river the surface is chiefly open rolling prairie, with an occasional poplar bluff. The soil is a very\nR. 17.\n\nRich clay loam, with clay subsoil. Soil rates 1, relative value $1\\frac{1}{2}$ and 2.\n\nTp. 22. Sections 1 and 3, on the north limit of the main line belt, are choice farming lands. The surface is open level prairie, with a soil of rich clay loam, on a clay subsoil. Highest possible rating.\n\nR. 18, west of 2nd I. M.\n\nTp. 14. Is gently undulating prairie, with a wondrously rich soil of clay loam, two to four feet deep, and a clay subsoil. A large marsh in the east half of the township swarms with water fowl of every description, affording famous sport for a lover of the gun. The whole of 25 and portions of 23 and 15 are included in marsh. A first-rate township. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nTp. 15. Wascana River (Pile of Bones) cuts off the north-east corner of the township. The surface is undulating open prairie, with a soil same as preceding. Good hay marshes on sections 1, 3, and 7; remainder first-class land. Soil rates 1, relative value $1\\frac{1}{2}$.\n\nTp. 16. The Wascana River traverses this township from south-east to north-west. Farming qualities same as preceding.\n\nTp. 17. The south half of this township is the same as the above. The north half is crossed by the C. P. R., with Pilot Butte Station on section 33. Several small ravines, besides Spring Creek, traverse this part of the township. Although not so fertile as the south half, yet sections 19, 21, and 31 are good, and will make capital farms. Remainder of north half is poor grazing land.\n\nTp. 18. Is open rolling prairie, with a soil chiefly of gravelly loam, in some places sandy, with gravelly clay subsoil. About fifty per cent. of the township is good agricultural land; the remainder is best adapted for grazing. Soil rates $1\\frac{1}{2}$, relative value 3.\n\nR. 19, west of 2nd I. M.\n\nTp. 13. Only the north tier of sections in this township is included in railroad belt. The surface is undulating, with a very rich clay soil, one to two and a half feet deep, and a clay subsoil. That it is excellent farming land goes without saying. Highest rating.\nR. 19.\n\nTp. 14 and 15. Are undulating open prairie, with a deep rich clay soil. In all the fertile Canadian North-west there are no lands to surpass these in richness and fertility. Here the soil is practically inexhaustible.\n\nTp. 17. Regina, the metropolis of Assiniboia, the head-quarters of the North-west Mounted Police, &c., is partially located on section 19, on the main line of the C. P. R., and must at no distant date become the distributing point for a large extent of country. The company have projected a line from this point to Prince Albert, on the Saskatchewan River. The Wascana River traverses the township in a northwesterly direction. Soil, &c., same as above.\n\nR. 20, west of 2nd I. M.\n\nTp. 13. Same as preceding.\n\nTp. 14. Same as preceding.\n\nTp. 15. Same as preceding.\n\nTp. 17. Regina is partially located on section 25, on the main line of the C. P. R. The township is traversed by the Wascana River. The water is good and plentiful. Soil, etc., same as preceding.\n\nR. 21, west of 2nd I. M.\n\nTp. 17. Is cut on the west side by Cottonwood Creek, and is on the main line of the C. P. R., which crosses the centre of the township. Grand Coulee Station is located on section 15. Surface, soil, etc., first-class.\n\nR. 22, west of 2nd I. M.\n\nTp. 16. Is undulating open prairie, with a soil of strong rich dark clay, two to three feet deep. The perfection of farming land.\n\nTp. 17. Pense Station (section 9) is located in this township, on the line of the C. P. R. Cottonwood Creek cuts off the north-east corner of the township. Soil, etc., same as preceding.\n\nTp. 19. Is traversed in an easterly direction by the Qu'Appelle River, with a limited quantity of mixed timber in its vicinity. The\nR. 22.\n\nbottom lands are very rich and fertile, and the banks of the valley light and gravelly. The surface is chiefly undulating, with a soil of sandy loam and sandy clay subsoil. On the whole, this township cannot be highly recommended for farming purposes.\n\nTp. 20. Is high rolling prairie, with a soil of light sandy loam and sandy clay subsoil. Rather light for farming.\n\nTp. 21. Same as above.\n\nR. 23, west of 2nd I. M.\n\nTp. 16. The line of the C. P. R. cuts off a corner of section 31, on which the Station of Belle Plain is located. The surface is undulating, with a soil of strong rich dark clay. First class in every respect.\n\nTp. 17. The C. P. R. crosses the township near the south boundary. In all other respects same as preceding.\n\nTp. 19. Is traversed by the Qu'Appelle River, which here is ten to fifteen feet wide, and three to four feet deep. A few scattered ash and elm are to be found along its banks; but practically the township is without wood. The surface is rolling, with soil of a sandy loam and a sandy clay subsoil, except in the bottom lands of the river, where it is a heavy rich black clay loam. Water of good quality can be found in any part of the township. Fairly well adapted for general farming purposes.\n\nTp. 20. The north half is traversed by the Little Arm River. The surface is rolling, and the soil a sandy loam, on a sandy clay subsoil. Cannot be highly recommended.\nMOOSEJAW AGENCY.\n\nR. 24, west of 2nd I. M.\n\nTp. 16. The C. P. R. crosses the township near the north boundary. The surface is undulating, with a soil of strong rich dark clay. All first-class farming land.\n\nTp. 17. Moosejaw Creek, which finds its entrance into the township and runs northerly towards the Qu’Appelle, cuts off the north-west corner. A small quantity of maple may be found in the neighborhood of the stream. Surface and soil same as preceding.\n\nTp. 19. Is traversed by the Qu’Appelle River, which flows through a valley a mile and a half to two miles wide and 300 feet deep. A small quantity of elm and ash may be found scattered through the valley of the river and on the banks of the ravines. The township, as a rule, consists of rolling prairie, with a soil of sandy loam on a gravelly clay subsoil. Soil rates $1\\frac{1}{2}$, relative value 3.\n\nTp. 20. Is rolling prairie, with soil and subsoil same as preceding. Moderately well adapted to farming. Good water and hay throughout the township. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nR. 25, west of 2nd I. M.\n\nTp. 16. The C. P. R., with Pasqua Station (section 27), crosses the township about a mile south of the north boundary. This is a first-class farming locality. Surface, soil, etc., same as 16-24.\n\nTp. 17. Up to date only four sections, 7, 9, 17, and 19, have been examined. These are gently rolling, with a soil of deep rich clay, on a clay subsoil. Highest rating.\n\nTp. 19. Buffalo Lake cuts off the south-west corner. On the southwest side of the lake the soil is a heavy clay, while on the north-east side it is a sandy loam. All well adapted for farming. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp. 20. Is rolling open prairie, well drained. Soil a sandy loam, with a sandy or gravelly clay subsoil. Meadows and ponds afford a supply of good hay and water. Soil rates $1\\frac{1}{2}$.\nR. 26, west of 2nd I. M.\n\nTp. 16. Is splendidly watered by two streams; one, Moosejaw Creek, flowing in a north-westerly, the other, Thunder Creek, in an easterly direction, to their confluence in section 33, where the division town of Moosejaw, is located. The C. P. R. runs adjacent to Thunder Creek all the way across the township. Soil same as 16-25, first class.\n\nTp. 17. Surface, soil, etc., same as preceding.\n\nTp. 19. Buffalo Lake, a fine sheet of water fifteen miles in length by one mile in breadth, lies in a valley one hundred and fifty feet below the prairie level, with an occasional patch of timber on its banks. Its waters are teeming with fish, while wild fowl, especially the various kinds of duck, may be seen in myriads throughout the season. The surface of the township is undulating, with a soil of a heavy rich clay loam. Highest rating.\n\nTp. 20. Buffalo Lake cuts the township diagonally. On the south-west side the soil is the same as the preceding, while on the north-east it is a light sandy loam on a sandy clay subsoil. Soil of north-east rates $1\\frac{1}{2}$, relative value 3.\n\nR. 27, west of 2nd I. M.\n\nTp. 16. Thunder Creek traverses the township, with the line of the C. P. R. running close by. The two south tiers of sections are considerably broken by sand hills; the remainder is good farming land, with a mixed soil of sand and clay, the latter largely predominating. Soil rates $1\\frac{1}{2}$, relative value $2\\frac{1}{2}$.\n\nTp 17. Is undulating, with a soil, except a few sections in the south, of a strong rich clay, two to three feet deep. Highest rating.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/officialguideboo00cana.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 126, "total-input-tokens": 178524, "total-output-tokens": 29251, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 232, 9], [232, 2629, 10], [2629, 2629, 11], [2629, 2629, 12], [2629, 3869, 13], [3869, 5525, 14], [5525, 7602, 15], [7602, 9824, 16], [9824, 12038, 17], [12038, 12355, 18], [12355, 12996, 19], [12996, 12996, 20], [12996, 12996, 21], [12996, 12996, 22], [12996, 13045, 23], [13045, 13045, 24], [13045, 13045, 25], [13045, 14108, 26], [14108, 16388, 27], [16388, 17759, 28], [17759, 17759, 29], [17759, 17759, 30], [17759, 17759, 31], [17759, 17759, 32], [17759, 17759, 33], [17759, 17759, 34], [17759, 19429, 35], [19429, 21455, 36], [21455, 21455, 37], [21455, 21455, 38], [21455, 23490, 39], [23490, 25450, 40], [25450, 25450, 41], [25450, 25450, 42], [25450, 25450, 43], [25450, 25450, 44], [25450, 27415, 45], [27415, 29115, 46], [29115, 29115, 47], [29115, 29115, 48], [29115, 30857, 49], [30857, 32722, 50], [32722, 32722, 51], [32722, 32722, 52], [32722, 34743, 53], [34743, 36663, 54], [36663, 36663, 55], [36663, 36663, 56], [36663, 38554, 57], [38554, 40633, 58], [40633, 42605, 59], [42605, 44522, 60], [44522, 45178, 61], [45178, 47036, 62], [47036, 47036, 63], [47036, 47036, 64], [47036, 48956, 65], [48956, 50795, 66], [50795, 50795, 67], [50795, 50795, 68], [50795, 52667, 69], [52667, 54645, 70], [54645, 54645, 71], [54645, 54645, 72], [54645, 56549, 73], [56549, 58390, 74], [58390, 58390, 75], [58390, 58390, 76], [58390, 60374, 77], [60374, 62426, 78], [62426, 62426, 79], [62426, 62426, 80], [62426, 64616, 81], [64616, 66735, 82], [66735, 66735, 83], [66735, 66735, 84], [66735, 68807, 85], [68807, 70954, 86], [70954, 70954, 87], [70954, 70954, 88], [70954, 72952, 89], [72952, 74849, 90], [74849, 74849, 91], [74849, 74849, 92], [74849, 74849, 93], [74849, 74849, 94], [74849, 76968, 95], [76968, 79059, 96], [79059, 81266, 97], [81266, 83310, 98], [83310, 83310, 99], [83310, 83310, 100], [83310, 85222, 101], [85222, 87088, 102], [87088, 87088, 103], [87088, 87088, 104], [87088, 87088, 105], [87088, 87088, 106], [87088, 89113, 107], [89113, 91186, 108], [91186, 93254, 109], [93254, 94964, 110], [94964, 94964, 111], [94964, 94964, 112], [94964, 96373, 113], [96373, 98277, 114], [98277, 98277, 115], [98277, 98277, 116], [98277, 98277, 117], [98277, 98277, 118], [98277, 99876, 119], [99876, 99876, 120], [99876, 99876, 121], [99876, 99876, 122], [99876, 99876, 123], [99876, 99876, 124], [99876, 99876, 125], [99876, 99876, 126]], "primary_language": ["None", "None", "None", "None", "None", "None", "en", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "None", "None", "en", "en", "en", "None", "None", "None", "None", "None", "None", "en", "en", "None", "None", "en", "en", "en", "None", "None", "None", "en", "en", "None", "en", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "en", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "en", "None", "en", "en", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "None", "None", "en", "en", "en", "None", "None", "None", "en", "None", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, true, false, false, false, true, false, false, false, false, false, false, false, true, false, true, false, true, false, false, true, false, false, true, false, true, false, false, true, false, false, false, true, false, false, true, false, true, false, false, false, false, true, false, false, true, false, false, false, true, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, false, true, false, false, true, false, false, true, false, false, false, false, true, false, false, false, true, false, true, false, false, false, false, false, true, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false]}}]