[{"id": "68766f9d8af592574a1345daf2c068ae8323f8c2", "text": "REPORT\n\nON A\n\nTOPOGRAPHICAL & GEOLOGICAL\n\nEXPLORATION\n\nOF THE\n\nCANOE ROUTE\n\nBETWEEN\n\nFORT WILLIAM, LAKE SUPERIOR, AND FORT GARRY, RED RIVER; AND ALSO OF\nTHE VALLEY OF RED RIVER, NORTH OF THE 49TH PARALLEL,\nDURING THE SUMMER OF 1857.\n\nMADE UNDER INSTRUCTIONS FROM THE\n\nPROVINCIAL SECRETARY OF CANADA;\n\nBY\n\nHENRY YOULE HIND, M.A.,\nGEOLOGIST AND NATURALIST TO THE EXPLORING EXPEDITION\n\nToronto:\nPRINTED BY STEWART DERBISHIRE & GEORGE DESBARATS,\nLaw Printer to the Queen's Most Excellent Majesty.\n\n1858.\nTO THE HONORABLE T. J. J. LORANGER, M. P P.,\nPROVINCIAL SECRETARY.\n\nSIR,—I have the honor to submit a final Report on my department of the Canadian Red River Exploring Expedition.\n\nIn a letter addressed to your predecessor, the Hon. T. L. Terrill, M. P. P., dated St. Paul, Minnesota Territory, Oct. 28, 1857, I furnished a general scheme of a Report comprising some topics not mentioned in my instructions.\n\nOn returning to Toronto, I waited upon the Hon. Mr. Terrill, who, with reference to the general plan of this Report, expressed his concurrence and approval.\n\nThe introductory chapter contains an outline of its contents as well as the general results of what is therein illustrated and expressed in detail.\n\nI have the honor to be, Sir,\n\nYour most obedient servant,\n\nHENRY YOULE HIND, M. A.\nGeologist and Naturalist to the Canadian Red River Exploring Expedition.\n\nToronto, February 6, 1858.\nINTRODUCTION.\n\nThe exploration of the Route between Fort William, Lake Superior, and Fort Garry, Red River, having been made in canoes, the description of the line of communication between those distant points necessarily refers to the available water facilities which were found to exist, so that in the following sketches of the topography of the country bordering the Route, only as much is described as was actually visible from river or lake, when in canoe, or from the summit of hills which were ascended at the different portages and camping places whenever opportunity offered. At the most therefore, a very narrow stripe of country is comprehended in succeeding delineations, but from the nature of the region through which the stripe runs, it is highly probable that it represents the general character of a very large portion of the area between the valleys of Lake Superior and Winnipeg, as far as the Lake of the Woods; and the right bank of the Winnipeg River.\n\nThe speed at which we were obliged to travel in order to accomplish our voyage within a stated time, very considerably lessened the number of opportunities which might otherwise have been offered, for acquiring more ample knowledge of many parts of the country bidding fair to reward a minute exploration. The distance between Fort William and Fort Garry is about 699 miles, and the time occupied in traversing this great extent of country was thirty-three days, including a stoppage of two days and a half at Fort Frances, one day at Garden Island, and two days at Islington Mission, Winnipeg River; so that the time actually spent in canoe was twenty-seven and a half days, which gives an average of 251 miles a day. This average refers solely to the different canoes I occupied at the several stages of the voyage, which were in order, a five fathom North canoe with the main party, from Fort William to Fort Frances, a distance of 303 miles; a small canoe carrying three persons, in company with Mr. Dawson similarly equipped, from Fort Frances to Islington Mission, 190 miles; and a small canoe, alone, from the Mission to the Stone Fort, Red River, a distance of 187 miles. The average daily progress being in the large canoe 20 miles and in the small canoe 47 miles. But the average daily progress of the large canoes along the whole Route was 25 miles.\n\nThe valley of the Kaminitiquia below the Grand Falls, contains an area of good land probably exceeding 20,000 acres. It will doubtless acquire much importance as a terminus of any line of communication, whether by boats or Winter road, which may eventually be established between the valleys of Lakes Superior and Winnipeg.\nFrom the prevalence of shoal water for a long distance in the Kaminitiquia and the great length of the portages at the height of land, it may not happen that this Route will be selected for improvement as a boat communication, but from the considerations which will soon be noticed, Fort William and the valley in which it is situated may become under any circumstances points of special interest. Arrow Lake, on the Pigeon River route, formerly pursued by the North West Company, is within 40, and Gun-Flint Lake within 60 miles of Point des Meurons on the Kaminitiquia, as shown on the map.\n\nBetween the Grand Falls of the Kaminitiquia and Fort Frances, a distance of 273 miles, very few areas of cultivable land occur on the water communication; but it is probable that many areas of limited extent might be found, if sought for, on the shores of the lakes and on the banks of the rivers.\n\nThe Country as a whole must be regarded as a sterile waste, offering no inducements for settlement beyond those which a mining interest might foster, or small village stations on a line of communication create.\n\nThe valley of Rainy River is by far the most important tract seen, and I do not think that the estimate of 220,000 acres of good land assigned to the British side in this Report, is too much.\n\nThe islands in the Lake of the Woods, offer some spots available for cultivation, many of which are now occupied by Indians, who cultivate Indian corn, potatoes, squashes and pumpkins.\n\nThe Winnipeg River until within a few miles of its mouth, flows through a desolate and irreclaimable rocky waste, furnishing a very small supply of timber for lumbering purposes in proportion to its length of 163 miles.\n\nSmall patches varying from 50 to 300 acres of excellent drift clay, occur at and below the Islington Mission, but within a few miles of the mouth of the river an extensive area of good arable land is to be found.\n\nThese areas, both large and small, will possess only a local importance; the country through which the Winnipeg flows, the character of the river, with its rapids and cascades, having a fall of 333 feet, altogether preclude the hope of its being made available as a permanent means of communication with the valley of Lake Winnipeg.\n\nThe distance from the North-West corner of the Lake of the Woods to Fort Garry cannot exceed one hundred miles, while by the Winnipeg the distance from the same point is 282 miles. Whatever may be the result of Mr. Dawson's exploration of the route between those points, it is very probable that as a station on a Winter route, the North-West corner of the Lake of the Woods will occupy a very prominent position.\n\nOf the valley of Red River I find it impossible to speak in any other terms than those which may express astonishment and admiration.\nThe descriptions which I had read previous to my arrival there, certainly did not in any way prepare me for the magnificent country at present occupied and controlled by those whose interests, no one seeks to deny, have been necessarily opposed to settlement, or communication with what may be termed the outer world.\n\nI entirely concur in the brief but expressive description given to me by an English Settler on the Assinniboine, that the valley of Red River including a large portion belonging to its great affluent, is a \"paradise of fertility.\"\n\nDuring my visit to Assinniboia, a District embracing the settlements on both Rivers, I paid particular attention to the objections which have been urged against the climate and soil of the country with reference to agricultural operations; and I have no hesitation in saying that erroneous impressions respecting the available area of cultivable land, the soil, the crops and the climate still exist and find publicity.\n\nI do not wish it to be understood that these descriptive errors result from a determination to misrepresent facts, but they arise either from unconsciousness of the true nature of existing physical impediments to settlement, or an indisposition to explain how those impediments were produced or may be remedied.\n\nI was frequently referred to the \"Big Swamp\" as forming an insurmountable barrier to the rearward progress of settlement from Red River. This \"Big Swamp\" I found to be maintained by a mill dam at its chief outlet, and while reference was constantly made to the evil, the cause which produced it was ignored, or really unknown.\n\nIn suggesting to Residents at Red River the drainage of the \"Big Swamp,\" two objections were urged, the first that its height above the river would not admit of drainage; the second that if drained, it would require expensive bridges to be erected over the gullies which would soon be formed by its waters seeking their outlet to Red River.\n\nThe first objection was soon answered by my assistant Mr. John Fleming, who ascertained instrumentally, the relative heights of the Big Swamp, the Prairie and Red River at the middle Settlement.\n\nHe found the elevation of the Swamp to be 27 feet above the river level. Section No. 6, shows these relations; and I may here remark, that as far as my observations enabled me to form an opinion, all other swamps on the Assinniboine, or on Red River, may with equal ease be drained.\n\nThe second objection proceeded from a retired factor of the Honourable Hudson's Bay Company, and a member of the Board of Public Works at the Settlement.\n\nHe admitted the practicability of the measure, but stated that the gullies formed in the yielding clay of the Prairie would require expensive bridges to\nmake them passable for settlers, the cost of which might amount to two or three hundred pounds.\n\nI have no doubt that the swamps on the east side of the river would be as easily drained as the one to which I have referred at length.\n\nThe origin of these swamps is, I think, simply explained in the following way. Red River occupies a trench which it has cut for itself about 30 feet below the level of the beautiful prairies through which it flows. Its banks are fringed with heavy timber for a depth of perhaps a quarter of a mile or more on one side or the other, and during the lapse of many years, occasional overflows have \"silted up\" the wooded banks for perhaps a foot above the level of the prairies; so that in some places the river flows for miles between banks which are a little higher than the prairies beyond them. When, therefore, a great flood occurs, as in 1826 and 1852, the prairies are flooded, and the low natural levee, on the immediate bank, prevents the return of the waters to the bed of the river, and forms a \"Swamp.\"\n\nIt is to be well observed that the \"Big Swamp\" did not assume its present formidable dimensions until after the flood of 1852; and the construction of the mill dam at Mill Creek now effectually prevents it from drying up, and restoring many thousand acres of admirable pasture land to the public grazing grounds of Red River.\n\nI mentioned this impediment to the drainage of the \"Big Swamp\" to the owner of the mill, who is one of the most wealthy and influential residents; but he did not think the removal of the dam would assist in draining the Swamp, \"it was too big.\"\n\nThe summer climate of this Region appears to be very well adapted for agricultural operations.\n\nThe summer temperature is nearly 4 degrees warmer than at Toronto, as ascertained by a comparison of corresponding observations.\n\nIndian corn if properly cultivated and an early variety selected may always be relied on.\n\nThe melon grows with the utmost luxuriance without any artificial aid, and ripens perfectly before the end of August.\n\nAnd yet with these natural and most truthful registers of climate, we are accustomed to hear of late spring and early autumn frosts, deplored, lamented and held up as one of the great drawbacks of Red River.\n\nThe opinions expressed at the settlement by different individuals on the soil, climate, and natural productions of the country, are often of a very opposite character; and I found invariably, that descriptions and opinions were remarkably affected by [the relation which the individual bore to the Honourable Hudson's Bay Company.\nIn making these statements I do not wish it to be supposed that any attempt was ever made intentionally to mislead, but the habit of decrying every thing not connected with the Fur Trade, appeared to have become a second nature to many of the old residents, whose interests are locked up in it.\n\nAll kinds of farm produce, common in Canada, succeed admirably in the District of Assinniboia; these are wheat, oats, barley, Indian corn, hops, flax, hemp, potatoes, root crops and all kinds of common garden vegetables.\n\nThe potatoes, cauliflowers and onions, I have not seen surpassed at any of our Provincial Fairs; an enumeration of the weight of some of these productions of the garden and farm will be found in the text, and numerous specimens accompany this Report.\n\nThe character of the soil in Assinniboia within the limits of the ancient Lake Ridges, cannot be surpassed. It is a rich black mould 10 to 20 inches deep, reposing on a lightish coloured alluvial clay about 4 feet deep, which again rests upon lacustrine or drift clay to the level of the water, in all the rivers and creeks inspected.\n\nI frequently examined the soil some miles distant from the rivers, along my line of route, as shown on the map, and I invariably found the prairie portion to exhibit a uniform fertility.\n\nThe area occupied by the fertile prairies I visited and saw certainly exceeds 1,500,000 acres; and as will appear from an inspection of the map of Minnesota, the greater portion of the rich and available prairie land in the valley of Red River lies within British Territory, while the valley of the Assinniboine is wholly within it.\n\nThe altitude of the valley of Red River above the sea is about 680 feet, or 320 feet less than the elevation given to it by high authority, and from which erroneous conclusions respecting its climate in relation to agriculture, have been drawn.\n\nAs an agricultural country I have no hesitation in expressing the strongest conviction that it will one day rank among the most distinguished.\n\nThe present state of society and the condition of the people in the settlements is far from being a pleasing or encouraging subject.\n\nThe European and Canadian element have been gradually diminishing for years, and the Half-Breed population is apparently drawing closer to the habits and tastes of their Indian ancestry.\n\nThat Agriculture and all the simpler Arts have been discouraged is but too apparent.\n\nThe Interests of the Fur Trade are necessarily opposed to the centralization and settlement of the Half-Breed and Indian Hunters, and it is everywhere evident that those Interests have been upheld at a great sacrifice of means, and by the practise of a far-seeing and skilful policy.\nRed River has been settled for 40 years and now contains a population of about 7,000 souls, yet no single branch of Industry, common even in the thinly settled parts of Canada, is practised there.\n\nWhatever efforts were made in time past, and these have been many, they have terminated in failure, and it is difficult to resist the impression that these failures were designed by some in authority.\n\nSuch artifices appear to have been thought necessary when the controlling authorities were weak, and indeed almost powerless in the face of a strong but irresolute and uneducated people.\n\nThe valley of Red River is capable of supplying all the great necessaries of life with the exception of iron for some years to come. The most important want is fuel, but there is much probability that on the upper Assinniboine and the Little Souris river, one of its affluents, Tertiary coal or lignite, will be found in available quantities.\n\nThe whole question of a boat communication between Fort William and Red River will be fully discussed in the reports of my colleagues, but having enjoyed the opportunity of seeing the country between Crow Wing in the State of Minnesota, and the settlements at Red River, open throughout the year, I may perhaps venture to introduce a few remarks with reference to a Winter road on British territory.\n\nIt is well known that many years since the Honorable Hudson's Bay Company commenced to cut out a Winter road between Red River and York Factory, Hudson's Bay, a distance of perhaps 600 miles, with a view to admit of the transport of articles of export during the long Winter months. The project, however, was abandoned, but the idea still remains strong in the minds of some of the settlers at Red River.\n\nA Winter road from Fort Garry to the Lake of the Woods would not exceed 100 miles; it is a Route which is often travelled in the Winter, and the cattle at Fort Frances were brought that way. Once on the Lake of the Woods, the road is open for 170 miles, requiring only two or three detours into the Forest to escape that portion of Rainy River which never freezes. The other detours from lake or river would necessarily be at the Portages along the line of boat Route, or near them.\n\nThe recommendation which a Winter road in conjunction with a summer boat communication enjoys, is that the poor or floating population of Red River would easily be induced to settle at the different posts on the Route, which would be necessary at stated intervals, with a view to accumulate supplies of provisions, hay, &c. during the summer months. It would be merely transferring their rude industry from the open prairies, where they are often compelled to live in misery during the winter, to a settled village life which might\nsoon become self-supporting, and continually assist in improving the means of communication.\n\nThe following tables shew the respective lengths of different Routes traversed or which might be suggested, between Lake Superior and Fort Garry, Red River.\n\nI. The Canoe Route followed by the Expedition from Fort William to Fort Garry, about........................................... 699 miles\n\nII. Canoe Route from Fort William via Milles Lacs to the North-West corner of Lake of the Woods......................... 431 \" Road from the North-West corner to Fort Garry............... 100 \"\n\nTotal 531 \"\n\nIII. Road from Point des Meurons, 10 miles from Fort William, to Gun-Flint Lake on the Pigeon River Route in an air line.................................................................. 58 \"\n\nBoat Route from Gun-Flint Lake to N. W. corner of the Lake of the Woods .................................................... 296 \"\n\nRoad from North-West corner to Fort Garry..................... 100 \"\n\nTotal 454 \"\n\nIV. Winter Road side by side with the last named Route... 454 \"\n\nV. Point des Meurons to Gun-Flint Lake on Pigeon River Route................................................................. 58 \"\n\nBoat Route via the Winnipeg to Fort Garry, in the event of a Summer Road not being at present practicable from Fort Garry to the North-West corner, Lake of the Woods.................. 564 \"\n\nTotal 622 \"\n\nVI. Route from Fort Garry to St. Paul, Minnesota........... 530 \"\n\nAir Line from Fort William to Fort Garry....................... 377 \"\n\nDifference between Air Line and Route No. III............... 77 \"\n\nThe country between Point des Meurons and Arrow Lake, or Gun-Flint Lake, or even Lake Seiganagah on the Pigeon River Route, acquires great interest when viewed in connection with the facilities which already exist at Red River for supplying without delay the matériel required to establish a boat communication on that Route.\n\nThe Private Freighters of the settlements could, and no doubt would dispatch their boats of four or five tons, fully equipped and appointed, to Gun-Flint\nLake (P. R. R.) or near to it, if reasonable remuneration were guaranteed. The only point of present difficulty, appears to lie in the communication between Point des Meurons and Gun-Flint Lake; or perhaps even Arrow Lake, only 38½ miles in an air line from that part of the valley of the Kamanitiquia. But little reliable information is accessible concerning this tract of country.\n\nThe experience possessed, when assisted by the means at the disposal of the Private Freighters of Red River, may render their services very valuable auxiliaries in opening a line of communication without much present outlay. Their employment might be regarded as a necessary preliminary step towards establishing a permanent commercial connexion between Canada and the valley of Red River.\n\nIn conclusion, it affords me very great pleasure to have this opportunity of expressing sincere thanks to my Assistant, Mr. John Fleming, whose zeal and industry have never for a moment flagged from the day of our departure to the present hour.\n\nIn addition to the duties to which I referred in my Report from Fort Frances, Mr. Fleming levelled across the valley of Red River from the \"Big Swamp\" to the Lake Ridge, while I was engaged on the Assinniboine; and all the views and sketches of Forts, Cascades, Rapids, Portages, Churches and Implements, are from Mr. Fleming's Pencil.\nLETTER TO THE HONOURABLE T. J. J. LORANGER, M. P. P., PROVINCIAL SECRETARY, ON SOME RESULTS OF THE CANADIAN RED RIVER EXPLORING EXPEDITION.\n\nSIR,\n\nIn compliance with your request that I should furnish you with a plain and concise summary of the results recorded and views expressed in my Report on the Red River Exploring Expedition, I have the honour to submit the following in relation to—\n\n1st. The Means of Communication and Transport between Lake Superior and Red River;\n2nd. The Areas of Cultivable Land on the Route;\n3rd. The main Geological Features of the Country;\n4th. The character of Red River Valley as an Agricultural Country;\n5th. The Climate;\n6th. The present Condition of its Inhabitants;\n7th. The importance of Red River.\n\nI. Means of Communication.—The most advantageous Routes between Fort William, Lake Superior, and Fort Garry, Red River, appear to be the following:\n\n1. From Point des Meurons, near Fort William, to Gun-Flint Lake, on the Pigeon River Route, by road, about .................................................. 60 miles.\n   Gun-Flint Lake to Fort Garry, by the Red River Freighters' boats of 4 to 5 tons ........................................... 564 \" Total 624 \"\n\n2. Fort William to Gun-Flint Lake, by road ............... 60 \"\n   Gun-Flint Lake to the North-West corner of the Lake of the Woods, by Freighters' boats............................ 296 \"\n   Road from the North-West corner of the Lake of the Woods to Fort Garry............................................. 100 \"\n   Total 456 \"\n\n3. A Winter Road side by side with the last Route....... 456 \"\nII. Areas of Arable Land:\n\n1. Valley of the Kaminitiquia, at the Lake Superior Terminus, about 20,000 acres;\n2. Small detached areas, from 50 to 200 acres, on the Route between the Kaminitiquia and Rainy River;\n3. Rainy River Valley, exceeding 200,000 acres;\n4. Detached areas on the Winnipeg, varying from 50 to 300 acres, until near the mouth of the River, where 20,000 acres may be found available;\n5. The area of cultivable land of the first quality in the valley of Red River and its affluent the Assinniboine, within British Territory, exceeds one million two hundred thousand acres. This does not include the Upper Assinniboine or its affluents. The area well adapted for grazing purposes in the same valley exceeds 3,000,000 acres.\n\nIII. The Geological Features.—The Primary Unfossiliferous rocks, consisting chiefly of Gneiss, Micaceous Schists and Chloritic Schists, with intrusive Granite and Syenite, occupy the country, and are nearly everywhere exposed between Kakabeka Falls, 30 miles from Fort William, and Fort Frances, Rainy River, a distance of 270 miles. Drift clays, capped by alluvial deposits, occur for 70 miles on Rainy River, holding boulders and unworn fragments of limestone. From the source of the Winnipeg to near its mouth, a vast area of intrusive Granite, followed by the unfossiliferous rocks before mentioned, occurs. This region may be considered hopelessly barren, with the exception of the small areas of Drift before noticed. Limestone of Silurian age appears on Red River, and probably underlies the greater part of its valley. It affords abundant and excellent building materials.\n\nNo promising indications of metaliferous rocks are known to occur on the Route, except at Gun-flint Lake and Iron Lake, on the Pigeon River Route. Salt exists in great abundance on Manitobah Lake, near Lake Winnipeg. Tertiary coal (Lignite), containing about 8 per cent. of ash, is reported to exist in abundance on the Little Souris and the Assinniboine River, not 200 miles from the Settlements on Red River.\n\nIV. Valley of Red River as an Agricultural Country.—Enjoys a vast area of remarkably fertile, deep and permanent arable soil. All crops cultivated in Canada succeed well, and often show an average yield far in excess of Canadian returns. All necessaries of life, with the exception of iron and fuel, are found in great abundance in Red River valley. The probable existence of Tertiary coal or Lignite is noticed above.\nV. Climate.—The climate of the agricultural season is well adapted for all the operations of Husbandry. Corresponding observations show that the summer temperature is three or four degrees warmer than at Toronto. The winter climate is very severe.\n\nVI. The present condition of the Inhabitants of Red River Valley.—The majority of the people are gradually becoming poorer, and approaching nearer to the Indian state; a result which seems to spring from the hitherto almost hopeless circumstances under which Husbandry has been conducted, and a quiet, unostentatious suppression, chiefly by means of competition through importations, of every kind of Industry which might lead to the selection of permanent homes by the Half-Breed and Indian hunters. The better class of people are looking with much anxiety to some amelioration in their condition, and to remuneration for home Industry, irrespective of the Fur Trade. The male population is fast diminishing, the European and Canadian element more particularly: enterprising young men seek their fortunes in the United States. Trade with the United States has lately acquired a growing importance. Red River cattle and horses are there exchanged for goods of different kinds. As a grazing country, Red River has, perhaps, no equal during summer and autumn, yet sheep are fast diminishing in numbers, wool being comparatively worthless in consequence of the general absence of even the simplest household machinery for the manufacture of \"homespun.\"\n\nThrough the munificence of the Home Missionary Societies, the interests of Religion and Education are well sustained amongst the resident population.\n\nVII. The importance of Red River.—By far the larger portion of the valley of Red River available for extensive Agricultural Industry lies within British Territory. The region drained by the Upper Missouri has been shown to be incapable of supporting a large population, and the progress of settlement in the United States will soon begin to flow northwards, from the valley of the Mississippi to that of Red River. But Red River unnwaters a comparatively insignificant portion of the vast area tributary to Lake Winnipeg. This region spreads over 400,000 square miles; is intersected by magnificent navigable rivers; and is represented, on good authority, to be fertile in soil and rich in mineral wealth. Red River is the key to this Great Valley, and with it, by means of a Winter road, following the Route of a Summer boat communication, Canadians can scarcely fail to establish\na permanent junction; and prepare the way for the more speedy and ample resources of communication which will probably soon be required.\n\nI have the honour to be, Sir,\n\nYour obedient Servant,\n\nHENRY YOULE HIND.\n\nToronto, February 22nd, 1858.\n\nTORONTO:\nPRINTED BY STEWART DERBISHIRE & GEORGE DESBARATS,\nLaw Printer to the Queen's Most Excellent Majesty.", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000349.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 17, "total-input-tokens": 26058, "total-output-tokens": 6625, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 500, 3], [500, 500, 4], [500, 1400, 5], [1400, 4062, 6], [4062, 6864, 7], [6864, 9607, 8], [9607, 12202, 9], [12202, 14912, 10], [14912, 17667, 11], [17667, 19761, 12], [19761, 21118, 13], [21118, 22714, 14], [22714, 25168, 15], [25168, 27701, 16], [27701, 28053, 17]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]