[{"id": "6a661f06018f835ff32f5afaa69aa0547266e903", "text": "MEMORIAL\n\nOF—\n\nREV. GEORGE McDOUGALL,\n\nINDIAN MISSIONARY\n\nTO THE\n\nSASKATCHEWAN,\n\nHIS TWO LAST LETTERS.\n\nPresented to the Teachers and Scholars of the St. James St. Sabbath School.\n\nMONTREAL:\n\nWILDESS PRINTING HOUSE, ST. JAMES STREET.\nREV. GEORGE McDOUGALL.\nMEMORIAL OF THE LATE\n\nREV. GEORGE McDOUGALL.\n\nBY REV DR. DOUGLASS.\n\nThe Methodist Church of Canada has not the advantage which arises from age, or those grand traditions which come from a long line of illustrious dead, and yet she can record a few names in her calendar as worthy to be held in remembrance for their heroic spirit, missionary zeal and effective labors. It has been the honor of Canadian Methodism to lead the way and stand in the van in work of evangelizing the aborigines of this land. Some sixty years ago, the venerable Case, animated by the spirit of Christ, was drawn out in sympathy for the perishing Indians. The work which he so well began was carried forward by Evans, Rundle and Hurlburt, who went out into the North-West, and at great sacrifice planted the banner of the Cross amongst the benighted children of that \"great lone land.\"\n\nIt was reserved for the late lamented George McDougall to win a foremost place of imperishable honor in the ranks of our Indian missionaries, and this fact, with his tragic end, must in the coming years make his name an inspiration to many who will read the story of his life labor, and weep over his tragic end.\n\nConcerning the early life of the deceased but little is known. His ancestors belonged to the north of Scotland, and followed the sea. In how large a measure he inherited the dauntless spirit of his sea-going ancestry let the record of his missionary labors declare. For a courage which never quailed, for a spirit of adventure which no advance of age could impair, for a heroic love of the grand prairie lands of the West, and for a gentleness and refinement which was made beautiful by a true and exalted piety, the deceased was distinguished, and will long live in thousands of hearts as a sacred memory.\n\nEarly converted to God, he at once entered on his life work of the Indian missionary. Onward to the West he went, planting stations, till beneath the shadow of those mountains that lift on high their jewelled heads in upper air, he laid him down to die, and be forever with the Lord.\n\nAs evidence that he was endowed with the spirit of his Divine Master, who said, \"Suffer little children to come unto Me,\" one of his last life-works was to prepare for the establishment of an orphan asylum, where the perishing little ones might be saved from suffering and death.\n\nDuring his last visit to this city a\nliving bond of union was established between the St. James Street afternoon Sabbath School and his mission and orphanage schemes. Under the direction and fostering care of the venerable Superintendent, the Hon. James Ferrier, the missionary contributions were consecrated to the McDougall missions; and thus, in the annals of the Centre Church of Methodism in this city, the names of Ferrier and McDougall are inseparably entwined together in the work of rescuing the perishing.\n\nMorleyville, Bow River,\nRocky Mountains.\nDecember 17th, 1875.\n\nHon. James Ferrier, Montreal:\n\nDear Sir,—If our young friends of Great St. James will just glance at the map, and follow their Missionary in his wanderings since we parted on that delightful Sabbath evening, I am persuaded they will need no apology for my not having written sooner. The journey to Winnipeg is an old story; there we parted with our mutual friend, the venerable Dr. Wood, and I, accompanied by Brother Manning and the school teachers, struck out for the \"Great North-West.\" After travelling with the party for some days, I left them as we approached Fort Ellice; and, having a commission to visit the Crees and Stonies, I made all possible haste to reach Fort Carleton. Here you will observe we had to cross the South Saskatchewan, a river which was formerly a terror to the traveller. More than once I have had to make a canoe out of buffalo rawhide, and ferry goods and carts across the rapid stream; now there is a ferryboat. After visiting the Indians of Carleton, and explaining to them the great Queen's letter, I proceeded down the river fifty miles to the Prince Albert Presbyterian Mission, where I also met the Indians of that part of the country, and was treated with great kindness by Mr. McCellar, the missionary. Here I had the pleasure of taking a leading part in the opening services of a new church, and was forcibly struck with the fact that our country is greatly indebted to the missionary for its material development. When I passed through this country eleven years ago, all was wild and desolate; now there are three churches in the settlement, and where the prairie grass waved but a few years ago, there are now vast fields of the finest wheat; the settlers expect to have thirty thousand bushels. Most of these people are mixed bloods, but there are quite a number of Indians who regard \"Prince Albert\" as their home. Having completed the work in that section of the country, in company with a gentlemen of your city, Mr. Ellis, the geologist, I started westward, following up the South Saskatchewan. Now, in your favored land of railroads and steamboats, it may appear but a very small matter to travel from Carleton to the Rocky Mountains, and the day will soon come when it will be but a small matter here; but to me it was a very serious one. The buckboard was our mode of conveyance, the tent our lodging place. There is not a twig or a bush for hundreds of miles, owing to the Indians having followed the buffalo so far out into the big plain; and we were therefore obliged to spend weeks in a woodless country. Now just look at the influence of the Elk or Red Deer River. Here I met with a deeply interesting people, the \"Plain Stony\"; they had seventy leather wigwams. These children of the prairie were greatly pleased when I told them what the Gospel had done for their brothers of the Mountains. Now run your finger along the map in a westerly direction, and your eye will catch a place called Buffalo Lake; some call it Hill's Lake. Here, by appointment, I met our missionary party, and also my son from Morleyville, and a large number of Christian Indians from Whitefish Lake and Victoria. My next journey was north, to old Fort Edmonton, hence east to Victoria. At every point I met with a most cordial reception from our Indian friends, who were all delighted to hear that the \"Great Ogemah\" was going to treat with them for their lands. From Victoria we proceeded straight to Morleyville by Edmonton. Now, just look for old Bow Fort, or Bow River; six miles east of that stands your mission. Having spent three or four days amongst the Stonies, accompanied by my son I started for Fort McLeod. You will observe that, running nearly parallel with the mountains, there is a vast range of hills called the Porcupine. To find a road through the great valley which divides the hills from the mountains, was one of the objects of our journey.\nWe were guided by the Stony interpreter, James Dixon, a very remarkable man, who for years has been the patriarch of his people. James, in a five days journey, could point out every spot of interest; now showing us the place where, more than twenty-five years ago, the venerable Rundle visited them and baptized many of their people; a little further on, and the location was pointed out to us as where his father was killed by the Blackfeet; then again, from a hill, our friend pointed out the spot where a company of German emigrants, who, while crossing from Montana to the Saskatchewan, were murdered—not one left to tell the painful story. This occurred seven years ago. How wonderful the change! We can now preach the Gospel to those very people, who, but a few years ago, sought the life of every traveller coming from the American side.\n\nJust examine the latest Canadian map, and see if you can find Playground River. Here is the place where we hope to establish our new mission. This beautiful valley and river is named after the wonderful Nahneboshojou, the Indian deity. The redman believes that while this great personage was on an inspecting tour, he was so delighted with the prospect presented at this place, that he rested, and amused himself by playing with some stones; some of these were pointed out to us, and I should think they are quite as large as the mountain in the rear of your beautiful city.\n\nFrom the Playground of the deity we could see the mountains of Montana, the great valley of the Belly River, and the boundless prairie away towards the rising sun and thousands of buffalo grazing on the plains; in the rear of us, our guide pointed to the place where the Stony hunts the wild goat, and the bighorned sheep, the black tail, the white tail, and the graceful antelope. No wonder the poor Indian sighs while he tells you the story of the past—a great change is now rapidly passing over this paradise of the hunter; yonder stands Fort McLeod at the mouth of the Playground River, the grand old Union Jack waving over that very spot, where, only two years ago, I witnessed the sad effects of a drunken fight between the whiskey trader and the Blackfeet. Here we visited a large camp of Blackfeet, and informed them that we hoped soon to open a mission for their benefit. The head Chief, who is quite an intelligent man, spoke of the future with anxious forebodings, and I think his statements were correct; let me illustrate his position by comparison. Just suppose that all supplies were cut off from Montreal; all factories closed because there was nothing to manufacture; the markets forsaken, because there was nothing to sell; in addition to this neither building material nor fuel to be obtained; how sad would be the condition of the tens of thousands of your great city! Now, the situation of these prairie tribes is exactly analogous to this state. For ages they have lived upon the buffalo; with its pelt they made their wigwams; wrapped in the robe of the buffalo they feared not the cold; from the flesh of this wild ox they made pemmican and dried meat; while they possessed his sinews they needed no stronger thread; from its ribs they manufactured sleighs. I have seen hundreds of Blackfeet boys and girls sliding down these hills on this kind of toboggan. The manure of the buffalo is all the fuel they had,—in a word they were totally dependent on the buffalo. Now, these unfortunate tribes behold with amazement the disappearance of these animals upon which they have existed for ages. Unfortunate people! nothing but their abandonment of paganism and conversion to Christianity can save them. Well, now let us go back to Morleyville. We shall go straight across the bare prairie. There is no fuel, but we shall carry a few small sticks for our first encampment, and hope on the second evening to reach the timber. Our journey was far from pleasant; at times the storm swept past us, and at night we had but very little fire to warm us. November 6th, we reached the encampment of our friend Dixon; there were 380 Stonies present. Next morning we held a service, and, though the frozen grass was the best accommodation we could offer our hearers, yet, no sooner was the announcement made, than men, women and children gathered round us, and sang with great energy, \"Salvation, Oh! the Joyful Sound.\" Here, I counted over 100 boys and girls who ought to be attending school, and who, I hope, will be, as soon as we can get a place erected sufficiently large to accommodate them. I must now tell you how I expect to pass the remainder of the winter. Since our arrival we have built a workshop, and fitted up a room for each of the families. Fortunately my schoolmaster is a good carpenter, and I am an old hand at building, so we have resolved to assist my son in completing the Mission Church. The only appropriation made for this important mission\nwas $500; the improvements now in progress will cost considerably over $3,000. We cannot ask the Society for another appropriation under existing circumstances; so, if the Lord gives us health, we intend to do the work ourselves. Perhaps my young friends may enquire, \"Why do not you hire somebody to do the work?\" The answer is simply this: In a country where the Mounted Police are paying mixed bloods ninety dollars per month as guides and interpreters, and where a stock-raiser pays his herder $150 per month, it is not easy for missionaries to procure laborers. Some future day, when this great country is filled with Christian men and women, we shall be able to build churches just as you do in Montreal. At present, if your missionaries would succeed, they must not be afraid of a little manual labor. I expect next week to visit the Mounted Police on Bow River; if spared to return, I have a number of Indian facts which I hope to send you.\n\nYour affectionate friend and missionary,\n\nG. McDougall.\n\nMorleyville, Bow River,\nRocky Mountains,\nJanuary 6th, 1876.\n\nHon. James Ferrier, Montreal.\n\nDear Sir, In the midst of much confusion and toil, I send you another paper for your model Sabbath School. I wrote you a short time ago; as to the matter or manner, I shall be thankful to receive any suggestions from you or the intelligent teachers of your school.\n\nLittle Ka-be-o-sense.\n\nThere is something that strikes on all hearts in the spectacle of a great man's funeral. The hearse, the solemn march of the procession, are both very impressive, and yet the subject of all this show may have been heedless of the great salvation, and if so, is now suffering the doom of a lost spirit. No feelings of this kind trouble the heart of the believer, as he follows the young disciple of Jesus to the resting place of the body—of these it can be truly said, \"Blessed are the dead that die in the Lord.\"\n\nReflections like these often cross the mind of the Indian Missionary, as he looks for the last time upon all that is mortal of one of his Sabbath School scholars. In the past twenty-five years, I have assisted at the burial of hundreds of these little red children. The squirrel now gambols in the boughs of the trees that overhang their graves, and the partridge whistles in the long grass that floats over the solitary place, but the incidents connected with their short pilgrimage cannot be forgotten.\n\nLittle Ka-be-o-sense was about three years old when his parents, and his grandfather, Ke-che-da-da, were converted on the south shore of Lake Superior, about sixty miles west of Sault Ste. Marie; and, at the first camp-meeting ever held in that country, on Sabbath afternoon, while the Rev. Peter Jones was conducting the communion service, the mighty power of God was so manifest that many were constrained to cry aloud. To use an Indian idiom, this was the hour when the relatives of Ka-be-o-sense first sighted the promised land. His mother, a very delicate young woman, but one susceptible of strong impression, there consecrated herself to Christ, and from that moment religion was to her not only a new life but a passion. Henceforth she talked to her little boy about the Saviour, just as she would about some very dear friend; she taught him to sing; she brought him regularly to class-meeting, and Sabbath School, and what is most gratifying to a pious mother, she observed that with the first awakening of the mind, the Blessed Spirit was influencing and moulding the heart. How fortunate when parents and teachers understand and sympathize with a sick child who longs to love the Saviour! This forest boy was taught the simplest truths of religion, and shortly we had scriptural authority for believing that our little friend was happy in the emotions of joy and peace. When nearly six years old, little Ka-be-o-sense caught a very bad cold, which, in a few short weeks, terminated in consumption. I was in the Sabbath School when a messenger from the cabin of Ka-che-da-da arrived, requesting that I should immediately visit the little sufferer. On arriving at his humble abode, I at once perceived that the struggle of life had nearly ended; the dear child received me with a smile, and pointing with his finger to a corner of the room, said, \"Jesus has sent for me; the heavenly people are waiting for me.\" His mother informed me, that for more than an hour he had been directing their attention to that part of the room, and telling them that the angels of the Great Mun-ce-doo had come for him. He then requested us to sing, and while the songs of the earth calmed and comforted the sorrowing friends, the redeemed and\nsaved spirit of little Ka-be-o-sense passed way to the realm of rest.\n\nWith deep emotion, we thought of the marvellous change which had taken place in a few moments. Present to the natural eye, was the humble home of an Indian child, the weeping friends and the lifeless body, but the eye of faith beheld the ascending spirit, the rejoicing angels, and above all, the welcome received from the Adorable One who said, \"Suffer little children to come unto me.\"\n\nBefore parting with Ke-che-da-da's family, I will briefly relate a circumstance showing the ardent desire of a native Christian to read the Word of God. I had noticed that the father of Ka-be-o-sense always brought his bible to church, and followed the reading of the lessons with marked interest, and the circumstance excited my curiosity. I knew he was what we termed an inland Indian, and that no schoolteacher had ever penetrated the wilderness where he was born. Approaching him after service, I said, \"You can read?\" and his answer was \"Yes.\" \"Who taught you the letters?\" \"I do not know them,\" was his reply. \"Then tell me how you can read?\" Without any embarrassment he replied, \"This is the way. I observed that when you pronounced any of our words, that they were broken up into small parts. (I would here state that at this time we used Peter Jones' translation, in which, though he employs English orthography, all the words are divided into syllables. That Muncedoo is written Mun-ce-doo.) When the white man says 'Indian,' you write it, 'U-h-ne-she-nah-ba.' When I went to my tent, I would take a hymn-book, and ask my wife to repeat one of the hymns she had learnt by heart, and I soon became acquainted with the form of all the syllables.\" Now, the simple fact flashed upon my mind, that this poor Indian, by intense and unremitting study, had mastered every syllable in his language. May not something of this kind have first suggested to the ingenious and indefatigable James Evans, the first idea of the syllabic character.\n\nAH-NEE-ME-KE.—THE SON OF WAH-BUN-NOO-SA.\n\nWhen the light of Christianity first reached this young pagan, he was about 18 years old, and the fire then kindled in his young heart was no transient flame. Very few in two short years have labored harder, or accomplished more for the good of their people. Often, since my lot has been cast amongst these wild, sensual tribes of the West, I have thought of zealous Ah-nee-me-ke, and felt constrained to plead with the God of Missions, that he would raise up and thirst out from amongst the Blackfeet, young men like Ah-nee-me-ke, filled with the Holy Ghost. My young friend was not what men called gifted; unlike many of his countrymen, he was a poor orator, and his gift of song was very limited, yet, wherever this young man went, a blessed influence followed, and, until his health entirely broke down, he was incessantly at work for the Master. I have heard him plead with the Sabbath School children, entreating them to give their hearts to Christ, until all were in tears. I have seen him kneel beside a hardened old conjuror, who had bewitched his people with sorceries for many years, until he trembled and began to pray. The secret of all this young man's power was his entire consecration to God. I can now recall my feelings, when, assisted by this devout young man, for though we greatly rejoiced in his success, we saw that he was rapidly slipping away from us. It was in the spring of the year when he was first confined to his humble bed. I daily spent an hour with him, and invariably came away blessed in my own soul by the conversation and experience of this dying Indian boy. The last time I called upon him, his father was sitting by his couch, the rest of the family being out in the sugar bush. Taking him by the hand, I enquired how he felt, and his reply was, \"You have just come in time, for I am dying.\" Just at that time, a Church of England minister entered the room. I informed my friend we were about to have prayer, and requested him to lead, which he readily did. Kneeling beside my native brother, I took his hand in mine, and, while the man of God was commending the departing soul to the Saviour which redeemed it, the young disciple fell asleep in Jesus.\n\nWhen we rose from our knees, I informed Wah-bun-noo-sa of what had taken place. In this old man there was still a leaven of paganism, yet he fully believed in Christianity. He said that three things had caused him greatly to rejoice: 1st.—That two ministers had been present when his son died. 2nd.—That his dear boy was so happy in the prospect of death. And lastly.—That the Great Mun-ce-doo had called his son away at exactly 12 o'clock; and, what specially filled his heart with gratitude, was that the sky was perfectly clear, allowing the depart-\ned a glorious ascent to the home of the Great Spirit. We did not, at that time, try to instruct this poor man by informing him that his son had coveted that land where there is day without night.\n\nI shall be glad, at some future time, to inform you about some of our living Sabbath School scholars, some who have been rescued from the deepest poverty and ignorance, and are now creditably filling positions of responsibility.\n\nWith kindest regards, I remain\n\nYour Missionary,\n\nG. McDougall.\n\nThe following is a detailed account of Mr. McDougall's death, received from an authentic source:\n\n\"The Rev. George McDougall was out on the plains with his son John procuring our winter's supply of buffalo meat. They were about thirty miles from home, and eight or ten from Fort Macleod, Bow River. On Monday, 24th January, in the afternoon, John ran the buffalo and killed three, and by the time they got them skinned and cut up it was long after dark. They then started for the tent, which was about four miles distant. When they had gone about two miles, Mr. McDougall said he would go on to the camp; so saying, he started ahead on horseback and left the sleighs to follow. It was very windy at the time, and\n\nTHE SNOW DRIFTING IN ALL DIRECTIONS, but the night was not very cold. Sad to say, he wandered far out on the plains and was lost. John, as soon as he came to the camp and found that his father was not there, commenced firing off his gun in hopes that his father would hear the report and come to him; but, alas, he was out of hearing. When morning arrived John took his horse and started in search, but the drifting snow left no trace. He searched in all directions until night, when he came to the conclusion that his father, not being able to find the camp, started for home; consequently he came home to see, but when he came into the house there was no father there; so he and his brother David and some others started back in haste, searched again, and found that he had been seen by some half-breeds who were cutting up buffalo out on the plains, on Tuesday afternoon. They said he passed close by them and got off his horse and led it along, and when he came near was seen to turn around, and get down on his knees, but, strange to say, they never went to see what was the matter. We suppose he was\n\nSNOW BLIND\n\nand could not see them. Some say that he was seen walking in the plain on Friday, but this we cannot believe, as the weather turned very cold on Wednesday morning, and it would be almost impossible to live in the cold without fire and food. There were about thirty persons searching for him. The Mounted Police turned out nobly from the Fort, but were not successful. His body was accidentally found by a half-breed who was driving to where he had killed a buffalo on Saturday, 5th inst. When found he looked as though all hope of life being gone, he had lain down stretched out, folded his arms by his side, closed his eyes, yielded up the ghost, and the spirit of a dear one had calmly and peacefully passed away from earth to be with God. Since we came out he has been living very near God, and was much in earnest for the salvation of souls; every morning we would hear him singing, 'I am waiting by the River.' He has crossed the river, and is singing a new song in that upper and better world.\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000775.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 14530, "total-output-tokens": 5801, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 234, 1], [234, 234, 2], [234, 257, 3], [257, 257, 4], [257, 2645, 5], [2645, 7083, 6], [7083, 11980, 7], [11980, 16623, 8], [16623, 21416, 9], [21416, 24741, 10]], "primary_language": ["en", "None", "en", "None", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, false, false, false, false, false, false, false]}}]