[{"id": "233f942d0b3efeec5eb9cabe60c9f92da9d16522", "text": "THE Historical and Scientific Society OF MANITOBA.\n\nTRANSACTION No. 33.—SEASON 1888-9.\n\nOriginal Letters and other Documents RELATING TO THE SELKIRK SETTLEMENT,\n\nREAD BEFORE THE SOCIETY JANUARY 17th, 1889,\n\nBY REV. DR. BRYCE AND C. N. BELL.\n\nWINNIPEG:\nMANITOBA FREE PRESS PRINT.\n1889.\nPAGES FROM THE PAST.\n\nSome Letters of Lord Selkirk hitherto unpublished, and some of the Early Laws of the Settlement.\n\nThe Historical Society had a night with Earl Selkirk, the founder of the Red River settlement on January 17th, 1889. It was a special meeting of the society, and it was held in the committee room of the city hall. Judge Ardagh presided, and C. N. Bell, 1st vice-president, A. Bowerman, Consul Taylor, Rev. Dr. Bryce, Rev. A. B. Baird, J. W. Anderson, W. G. Fonseca, and others were present.\n\nThe object of the meeting was to hear a number of original, and hitherto unpublished letters and documents relating to the early settlement of this country which have been collected by Rev. Dr. Bryce and Chas. N. Bell.\n\nRead by Dr. Bryce.\n\nLORD SELKIRK'S FIRST COLONIZATION SCHEME.\n\nAmong copies of the Selkirk letters read by Dr. Bryce were some which bear the date of 1802. Among these was one entitled \"A proposal tending to the permanent security of Ireland in a memorial addressed to His Majesty's Secretary of State by the Earl Selkirk.\" His idea in this letter is substantially that the more turbulent and restless characters in the disturbed districts in Ireland should be encouraged to emigrate to some part of America, not specified, where their religious and national prejudices would not be interfered with. The places in Ireland vacated by the removal of these colonists should be filled by English and Scotch Protestants. In this memorial he made no mention of the places where he proposed to found a colony, but in a supplementary memorial to the Secretary of State, dated in the same year, he says:\n\n\"The memorialist, in stating his plan for a colony of Irish Catholics in America, confined himself to the points of essential consideration and postponed, as a secondary question, any notice of the situation that may be proposed. This part of the subject, it must be admitted, is not altogether without difficulty, as no large tract remains unoccupied on the coast of British America except barren and frozen deserts. To find a sufficient extent of good soil in a temperate climate, we must go far inland. This inconvenience, however, is not an insurmountable obstacle to the prosperity of a colony and appears to be amply compensated by other advantages that are to be found in some remote parts of the British territory. At the western extremity of Canada, upon the waters which fall into lake Winnipeg, and meeting in the great river of Fort Nelson, discharge themselves into Hudson bay, is a country which the Indians and traders represent as fertile and of a climate far more temperate than the shores of the Atlantic under the same parallel and not more severe than that of Germany or Poland. Here, therefore, the colonists may with a moderate exertion of industry, be certain of a comfortable subsistence, and they may also raise some valuable objects for exportation. The soil and climate are similar to those of the Russian provinces, which supply most of Europe with hemp, and on which, after the experience of the late war, this kingdom cannot with prudence rely. Some of the British traders have extended their discoveries into a climate which appears well adapted even for the vine, the successful cultivation of which would save immense sums that go every year from this kingdom into the hands of its enemies. To a colony in these territories the channel of trade must be the river of Fort Nelson, which from the lake to its discharge is between 300 or 400 miles and a navigation interrupted by considerable obstructions, these, however, may probably be remedied. If any concurrence of circumstances should lead to the organization of territory on the Upper Mississippi, a communication might be opened from thence to the same port as the heads of that river interlock with the waters of Lake Winnipeg, in a level country where there would be little difficulty in connecting them. From the length of this inland navigation the expense of carriage will probably be too great for the export of corn, while the markets of Europe remain at a moderate rate. This, however, may have its advantages as it will turn the attention of the colonials to articles of greater value in proportion to their weight and of those none seem more promising than hemp which has been neglected in the Maritime Colonies chiefly, perhaps, because the sure ready market for grain has encouraged the inhabitants to continue the ample culture to which they had of old been accustomed. The greatest impediment to a colony in this quarter seems to be the Hudson Bay monopoly which the possessors cannot be expected easily to relinquish. They may however, be amply indemnified for its abolition without any burden, perhaps, even with advantage to the revenue.\"\n\nA GREAT WINTER JOURNEY.\n\nDr. Bryce also read a letter from Francis Talbot, ex-mayor of Wabasha, Minnesota. He enclosed the copy of a letter from Earl Selkirk, dated Fort William, Feb. 21st,\n1817. The original of the letter, which was recently destroyed by fire, belonged to Mr. David Cratte, of Wabasha, grandson of Captain Duncan Graham. The letter is one of instructions to Capt. Graham. Mr. Talbot also enclosed a sketch of a trip made by the late Mr. Alexis Bailey, of Wabasha, from Montreal to Fort William in 1818 with despatches from Lady Selkirk to her husband. The account stated that \"When Mr. Alexis Bailey was about 19 years of age, and while attending school at Montreal, Lady Selkirk fearing some conspiracy was brewing by which the life of the earl was in danger, sought in vain for some days the means of communicating with her husband. A thousand miles in winter was a formidable journey which no one seemed willing to attempt. The gallant heart of the youth offered his services to the lady * * * she gave him carte blanche.\" The account goes on to say that Bailey reached the Earl, who complimented him on his bravery, and after fitting him out for his return journey he entrusted him, not only with letters to Lady Selkirk, but with other important documents. \"On the return trip a beclouded sun for some days brought affliction and almost disaster to the party. The long detour from the right path of their journey almost exhausted their provisions, and for eight days their only satisfaction was out of the little sack of parched corn. The Frenchmen were determined to kill and eat the dogs, and it was only from the fact that Mr. Bailey, youth as he was, resisted sound sleep and with pistol in hand watched, not the dogs, but the voyageurs.\" Finally they ran across a trapper and secured sufficient venison from him to supply them with food. Thus supplied, he led his train in safety back to the metropolis to be received by Lady Selkirk, not only with verbal expressions of a gratified heart, but with a kiss of joyful approval. The letter stated that Mr. Bailey was an old friend of Gen. Sibley, Com. Kittson and others. Consul Taylor, who was present, said he knew Bailey very well.\n\nRead by C. N. Bell.\n\nBLUE LAWS OF THE SETTLEMENT.\n\nMr. Bell read a list of rules, drawn up by the H. B. Co. in the handwriting of Thos. Simpson, the explorer, for the guidance of the settlers. Its date is probably 1830. Some of the laws are slightly stringent and others very humorous, at least viewed from the present. Quotations are made as follows:\n\nSeveral instances have occurred within the last season of trip men and others forming engagements with different individuals at the same time. Such fraudulent conduct will in future be punished in the most severe manner.\n\nGreat mischief arises to the young timber and to the crops from the improper practices of allowing unringed pigs to roam at large. It is therefore directed that every individual finding these animals trespassing on his lands do seize the same for his own benefit; and the constables are further empowered and ordered to seize all unringed pigs which they may find straying in any part of the Settlement for their own use as a perquisite of office.\n\nAnother highly improper practice is that of catching horses belonging to other people and riding or driving them to a distance, which if continued must be severely punished. Many settlers have been robbed of their horses by Indians; this arises in a great measure from their own cowardice, every man being equally justified in pursuing and firing upon a horse-thief as upon robbers entering his house by force.\n\nFor the better observance of the Sabbath be it notified that no loaded vehicles or craft of any description whether belonging to or conducted by Protestants or Catholics shall be hereafter allowed to pass on that day; and all constables are hereby directed to seize and detain such as may make the attempt on the pain of forfeiting their, the said constables', offices.\n\nSome indolent persons it is observed very improperly throw out the manure from their stables upon the river during the winter season, thereby not only impoverishing their own land but driving away the sturgeon and other fish from the river; such highly reprehensible conduct shall be severely visited whenever it is repeated.\n\nThe heathenish and blasphemous practices of conjuring over sick persons it is to be lamented still manifests itself from time to time in the settlement. It is therefore notified that any settlers who will hereafter dare to admit such devilish rites into their houses shall be banished from the colony and the pretending jurors tried for their lives.\n\nADVERTISEMENT FOR THE FAIR.\n\nThis is to give notice that the half yearly fair will be held at the Frog Plains (Kildonan) on the 17th and 18th of this month. Half of the constables will attend the first day and the remainder on the second under David Livingstone and Charles Bruce, bailiffs, for the preservation of order, etc., and the regulation of the market. The bailiffs will attend at the New Fort Douglas on Monday, the 16th, when they will receive their salaries for the half year.\n\nBy order of the Governor,\n\nGRANT FORREST. Accountant.\n\nFort Douglas, May 7th, 1825.\n\nOTHER DOCUMENTS.\n\nMr. Bell also produced and read the following documents:—\n\nLetter from Lord Selkirk at Pembina to Allen Macdonell, governor of the colony, dated Sept. 14, 1817.\n\nLetter from Lord Selkirk, at Big Stone Lake, to the same, giving instructions about the colony, dated Sept. 28, 1817.\n\nLetter from Lord Selkirk, at Sandwich, Ont., awaiting his trial, dated Sept. 12th, 1818.\nLetters of 1816, addressed to Peter Fidler from Brandon, relative to the Selkirk troubles, from different parties.\n\nCopy of Lord Sherbrook's passport to the first R.C. missionaries, Frs. Provencher, Dumoulin and Edge, 1818.\n\nOriginal receipts for the annual payment of extinguishing the Indian title, signed by Indian chiefs, who append their totems; dates 1823 and 1831.\n\nLetter from Nicholas Garry, after whom Fort Garry was named; date 1824.\n\nLetter signed by Cuthbert Grant, leader of the half-breeds in the Seven Oaks battle.\n\nOriginal warrant for the arrest of A. N. McLeod, chief wintering partner in the Northwest Company, who opposed Lord Selkirk; dated at Montreal July 20th, 1818, and signed by F. W. Ermatinger, sheriff, for J. Monk, chief justice.\n\nContract for the delivery of the first cattle for the Red River valley cattle between Joseph Rollete, a famous Minnesota character, and the Governor of the Colony; also a similar contract between Alexis Bailey and the Governor.\n\nNotice to the heads of families from the H.B. Company that only 12 bushels of wheat will be taken from each family; dated 1843.\n\nCommission appointing constables, signed by W. B. Collman, His Majesty's special commissioner, sent to the Red River to act as intermediary between Lord Selkirk and the Northwest Company; dated Sept. 11th, 1817.\n\nContracts for the building of the new Fort Douglas in 1824.\n\nAppointment of Wm. Kempt, the first sheriff; Oct. 21st, 1823.\n\nReport of Capt. May, who was sent to Switzerland by Lord Selkirk to secure immigration for his colony. The report gives a description of those he had secured, and is dated Dort, Holland, May 24th, 1821.\n\nNotice at Fort Douglas, October 22nd, 1823, that grain will be taken from the settlers in payment of old debts at the following values: wheat, 10 shillings per bushel; barley, 7½ d.\n\nList of the wind mills in 1833 and the amount of grain the settlers had promised to supply that year.\n\nHead-quarters Fifth Regiment of Infantry,\n\nFort St. Anthony, June 19th, 1824.\n\nGentlemen,—I have this day received your letter of March 3, and shall immediately despatch an officer and party to reclaim the children of David Tully, who, I am informed, are under the protection of Mr. Jeffois, a half-breed, at Lake Traverse. I should send them to the Red river settlement by the nearest route; but the state of my command will not allow my furnishing an escort sufficient to ensure their safety. I have therefore directed that they shall be brought to this place, where they will remain under my protection until an opportunity offers of sending them home by the lakes. I shall not encroach upon the scanty portion of these orphans, by making any charge for their expenses while with me, on their way hither: I shall be amply repaid by the pleasure of having rescued them from Indian captivity, and restoring them to their friends.\n\nI beg leave to assure you that it will always give me pleasure to promote the interests of your respective governments, so long as it may be consistent with my duty to my own country; and I hope that the present amicable relations between England and America may long continue.\n\nI have the honor to be, gentlemen,\n\nYour obedient servant,\nJ. SNELLING,\nCol. Fifth U.S. Regiment of Infantry, commanding the posts on the Upper Mississippi.\n\nGeorge Simpson, Esq., Governor Northern Department, Rupert's Land;\nR. P. Pelly, Esq., Governor of Assiniboine.\n\nMEMORANDUM to be communicated to the Scotch settlers.\n\nAll the settlers in the Red river being bound to contribute to the support of a clergyman, I am of opinion that such of the Scotch settlers as do not belong to the Roman Catholic communion should, while unprovided with a Gaelic minister, give their assistance to the Protestant minister, the Rev. Mr. West. He intends commencing on Monday the 10th March to build a parsonage house, for the use and accommodation of the Protestant clergyman for the time being; and it will afford me great satisfaction, should I hear that the Scotch settlers above alluded to contribute towards that undertaking, by giving three days' labour, in such manner as may be directed by Mr. West.\n\n(Signed) A. BULGER.\n\nFort Douglas, 1st March, 1823.\n\nMay the 30th, 1823.\n\nIt is hereby agreed between Robert Sanderson, Captain Bulger and the Rev. John West, that the said Robert Sanderson will put up the parsonage house, raising the side walls, with upper and lower floors grooved and planed; put on the roof, and find what boards may be wanted, with making the doors and window-frames and partitions, so as to form four rooms; mud the walls, make the chimney, and finish the whole building by the middle of October next ensuing, for the sum of Sixty Pounds.\n\nThe mark X of ROBT. SANDERSON.\nJOHN WEST.\nA. BULGER.\n\nIt is further agreed that the colony shall find nails, glass, locks, and any iron-work that may be wanted, without extra charge, to the said Robert Sanderson, for the building of the said parsonage house.\nI, GEORGE SIMPSON, do hereby swear, that I will observe secrecy in all matters connected with the interests of this colony, which may be discussed or taken into consideration in the council chamber; and that I will not divulge, or cause to be divulged, the individual sentiments as expressed in council, of either the governor or any member comprising the council, upon any matters or person which may be brought before them from time to time.\n\nSo help me God!\n\nGEO. SIMPSON.\n\nSworn before me, at Fort Douglas, this twenty-first day of October, 1823.\n\nR. P. PELLY,\n\nGovernor of Assiniboine.\n\nMEMBERS OF COUNCIL—OATH OF SECRECY.\n\nDated at Fort Douglas.\n\nGeo. Simpson, 21st October, 1823.\nRobt. Logan,\nJohn Pritchard,\nThomas Thomas,\nWm. Hemmings Cook,\n(Rev.) David Jones,\nR. P. Pelly,\nCapt. Fredk. Matthey,\nAlex. MacDonell,\n\nSworn before\n\nGEORGE SIMPSON,\nGovernor Northern Dept. Rupert's Land;\nExcept his own, sworn before\n\nR. P. PELLY,\nGovernor of Assiniboine.\n\nYOU, ANGUS MATHESON, shall well and truly serve our sovereign lord the King, and the governor and council of the district of Assiniboine, in the office of constable for the settlement of Red river; and shall well and truly serve the office of constable until lawfully discharged therefrom. You shall also well and truly do and execute all things belonging to the said office to the best of your skill and knowledge.\n\nSo help you God!\n\nANGUS MATHESON.\n\nSworn before me, at Fort Garry, Red river settlement, the 23rd day of Oct., 1823.\n\nGEORGE SIMPSON,\nGovernor Northern Dept. Rupert's Land.\n\nCONSTABLES.\n\nSworn in by Geo. Simpson, at the Red river settlement.\n\nCapt. F. Matthey, 21st October, 1823.\nThos. Thomas,\nAlex. MacDonell,\nJohn Pritchard,\nWm. Hemmings Cook,\nRobert Logan,\n\nCONSTABLES.\n\nDated at Fort Garry, before George Simpson, Governor Northern Department.\n\nJohn Sutherland, 23rd October, 1823.\nAngus Matheson,\nJohn McIntyre,\nJohn McBeath,\nHugh Livingston,\nRobert Sanderson,\nJames Livingston, 12th May, 1824.\nGeorge McBeath,\nJohn Mclean,\n\nBAILIFF.\n\nDonald Livingston, 23rd October, 1823.\n\nSPECIAL CONSTABLES.\n\nSworn in by Geo. Simpson, at the Red river settlement.\n\nCuthbert Cummings, 19th October, 1823.\nCuthbert Grant,\nJames Hargrave,\nRaphael Farniant,\nAndrew McDermott,\nAugustin Nolin,\nDonald Gunn,\nJames Folster,\nJames Monkman,\nWilliam Tait, A.,\nWilliam Garrioch,\nMichael Heydon,\nAngus McGillie,\nLouis Denis Laronde,\nLouis Giboche,\nThomas Bunn,\nJohn Henderson, 3rd November, 1823.\nFrancis M. Dease, 19th\n\nNOTICE is hereby given, that the colony register is now prepared for the entry of title-deeds for land. Those of the settlers who have received titles, will bring them for examination and registry the first time they may visit the fort; and those who have as yet received no titles, may have them on application to the governor at new Fort Douglas.\n\nBy order of the governor.\n\nGRANT FORREST,\nAccountant.\n\nFort Douglas, 20th January, 1825.\n\nFollowing is a copy of a passport, allowing the Swiss settlers for the Selkirk colony to leave Switzerland. After reaching the Red river, in 1821, they remained until 1826, when they departed in a body for Minnesota.\n\n[Translation.]\n\nSWISS CONFEDERATION,\n\nUnder the direction of the central police of the town and republic of Berne, invites all the authorities charged with the maintenance of order for the good of the public, to give liberty of passage to the persons named in the following pages, all residents of Switzerland, to depart for the Red river, in Northern America, passing via Rotterdam, where they will embark under the direction of Captain Rudolphe. May of that city, with a recommendation to give them aid and assistance in case of need, which favor will be reciprocated.\nThis sheet has been delivered for the term of this voyage.\n\nMade at Berne the 3rd May, 1821.\n\nThe Director, in his absence,\nM. Steiger, Adjutant;\nThe Chief Secretary.\n\nThen follow the seals and signatures of public officials—\"Ministre de Riviere,\" \"Legation des Pays Bas le Maintcendra,\" \"Canton Basel,\" \"Stadt Coblenz.\"\n\nAlphonse Humbert Droz, number of family\n\nAbram Perret number of family\nJean Pierre Creutlet\nFrederic Louis Stram\nVeuve Susanne Aberli\nSigismond Flotron\nChretien Rychener\nAbram Louis Marchand\nJoseph Mundwyler\nBenoit Schaub\nDavid Houriet\nVeuve Lydie Fournier\nVeuve Phillipine Droz\nChretien Rothenbuhler\nPhilippe Schirmer\nSamuel Scheidegger\nJean Louis Ginand\nRodolphe Wyss\nJean Jacques Simon\nChretien Aebersold\nLouis Jacques Ostertag\nPierre Rindisbacher\nLouis Engel de Douanne\nJonas Pierre Guinand\nTheodore Duboir\nJean Daniel Tissot\nPhilippe Schirmer (twice set down)\nJean Nicolas Longchamp, number of family\n\nBenjamin Lizier number of family\nAaron Dubach\nDavid Hoerner\nVictor Robert\nFrederic Diaion\nAlfred Quinche\nFrederic Cuche\nJulien Sunier\nMarguerite Grimm\nJean Duwmun\nFrederic Henri Diaion\nJean Heber\nSalome Knechtly\nCatherine Banzly\nDavid des Combes\nDavid Monier\nLouis Chatelain\nCharles Junot\nNicolas Hoffman\nJacque Langer\nLouis Meroz\nEdouard Haine\nAuguste Guelberth\nCharlie Gobur\nJean Koebel\nEdouard Plaget\nJacque Lambiet\nJean Weiss\nMme. Jonas Pierre de Guinand\n\nTotal ........................................... 165\n\n\"Forks, Red River, July 15, 1822.\n\nSir.—The Scotch settlers having held a conference among themselves, previous to the meeting appointed for this day, they beg leave to submit to your consideration the following statements:\n\n1. A number of petitions has been forwarded to England from the settlers of Red river, on the subject of grievances, to which they never received no answer.\n\n2. From the first crop we sowed in the country there was a prospect of an abundant return, when we were driven from our lands and a great part of our property destroyed. On our return the following year, we were too late for seed-time, and consequently lost the returns of a second year's harvest. This depredations and losses, with the high prices of goods, has involved us in heavy debts, from which we are unable to extricate ourselves.\n\n3. We are anxious to know how we are to be supplied with goods, and if any reduction will be made from the present high prices; and also who will have the prizeing of our grains.\n\n4. There are upwards of fifty heads of families residing in Red river of the church of Scotland, most of which are Highlanders. These are anxious of having a minister of their own tenets, and preach in their own language.\"\n\nA true copy.\n\nR. Bulger.\n\nIn answer to the memorial of the Scotch settlers now at Red river, Mr. Halkett has to assure them in the first place, that he believes the petitions transmitted by them to England were all regularly received, and that every consideration was given to them there which the subject of them would admit of. He has not been in England since these were sent over; but a large packet of letters and petitions from the Red river settlers has lately been put into his hands, and which he will lose no time in attending to as much as in his power, and answer them for the executors of the late Earl of Selkirk as well as he can.\n\nIn the second place, he has to state with regard to the prices of goods, that it is uncertain at present how long the colony store will be permitted to continue; but while it does, those settlers who are industrious and worthy of encouragement, shall in time of distress receive some credit according to the state of the store at the time. The same indulgence, however, will not be allowed to persons who do not cultivate their lands, and endeavour by every reasonable means to provide for their families. The price of goods in the colony store is now to be reduced, the same to be seventy-five per cent. on the London prices (viz., the former York prices); and in order to encourage all the Red river settlers, Lord Selkirk's executors have resolved to remit the interest now due upon their debts, and further, to allow a reduction of twenty per cent. on\nthe payment of the principal sum due by them respectively on the 31st day of May, 1822.\n\nWith respect to the price of grain, the prices as recommended by Lord Selkirk (viz., ten shillings per bushel for wheat, seven and sixpence for barley and seven and sixpence for pease) will at present be continued to the settlers for all which they may furnish to the colony store.\n\nWith respect to the application of the Scotch settlers for a clergymen of their own persuasion, Mr. Halkett will state the circumstance to the executors when he returns to England, and an answer will be sent to them as soon as possible.\n\n(Signed)\n\nJ. HALKETT.\n\nForks, Red river, July 10th, 1822.\n\nLIST OF MEN belonging to the Red River Settlement, arriving in Hudson's Bay in 1811, and brought from York Factory, July, 1812.\n\nColin Campbell, aged 21, from Argyle, laborer.\n\nJohn McKay, aged 22, from Ross-shire, boat builder.\n\nJohn McLennan, aged 23, from Ross-shire, laborer.\n\nBeth Bethune, aged 19, from Ross-shire, laborer.\n\nDonald McKay, aged 17, from Ross-shire, laborer.\n\nWilliam Wallace, aged 21, from Ayr, laborer.\n\nJohn Cooper, aged 26, from Orkney, laborer.\n\nNich'l Harper, aged 34, from Orkney, laborer.\n\nMagnus Isbister, aged 21, from Orkney, laborer.\n\nGeo. Gibbon, aged 30, from Orkney, laborer.\n\nThos. McKim, aged 38, from Sligo, overseer.\n\nPat. Corcoran, aged 24, from Crosmalina, carpenter.\n\nJohn Green, aged 21, from Sligo, laborer.\n\nPat. Quinn, aged 21, from Killalla, laborer.\n\nMartin Jordan, aged 16, from Killalla, laborer.\n\nJohn O'Rourke, aged 20, from Killalla, laborer.\n\nAnthony McDonnell, aged 23, from Killalla, laborer.\n\nJames Toomey, aged 20, from Sligo, laborer.\n\n18 in all.\n\nPASSENGERS on board the Prince of Wales for Red River Settlement.\n\n1. Geo. Campbell, aged 25, from Archigle Parish, Creech, Sutherland.\n\n2. Helen, his wife, aged 20.\n\n3. Bell, his daughter, aged 1.\n\n4. John Sutherland, aged 50, from Kildonan. Died 2nd September at C. F., a very respectable man.\n\n5. Catherine, his wife, aged 46.\n\n6. George, his son, aged 18.\n\n7. Donald, his son, aged 16.\n\n8. Alexander, his son, aged 9.\n\n9. Jennet, his daughter, aged 14.\n\n10. Angus McKay, aged 24, from Kildonan.\n\n11. Jean, his wife.\n\n12. Alex. Gunn, aged 50, from Kildonan.\n\n13. Christine, his wife, aged 50. Died 20th September, C. F.\n\n14. William, his son, aged 18.\n\n15. Donald Bannerman, aged 50. Died 24th September at C. F.\n\n16. Christina, his wife, aged 44.\n\n17. William, his son, aged 18.\n\n18. Donald, his son, aged 8.\n\n19. Christina, his daughter, aged 16.\n\n20. Geo. McDonald, aged 48. Died 1st September, 1813, C. F.\n\n21. Jennet, his wife, aged 50.\n\n22. Betty Grey, aged 17.\n\n23. Catherine Grey, aged 23.\n\n24. Barbara McBeath, widow, aged 45, Borobal.\n\n25. Charles, her son, aged 16.\n\n26. Jenny (her daughter) aged 23.\n\n27. Andrew McBeath, aged 19.\n\n28. Jennet, his wife.\n\n29. William Sutherland, aged 22, from Borobal.\n\n30. Margaret, his wife, aged 15.\n\n31. Christina, his sister, aged 24.\n\n32. Donald Gunn, aged 65, from Borobal.\n\n33. Jennet, his wife, aged 50.\n\n34. (Transferred to Eddystone for H. B. Co. service.)\n\n35. Geo. Gunn, son to Donald, aged 16, from Borobal, Parish-Kildonan.\n\n36. Esther, his daughter, aged 24.\n\n37. Catherine, his daughter, aged 20. Died 29th August, 1813, C. F.\n\n38. Christian, his daughter, aged 10.\n\n39. Angus Gunn, aged 21.\n\n40. Jennet, his wife.\n\n41. Robert Sutherland, brother to William, No. 29, aged 17, from Borobal.\n\n42. Elizabeth Fraser, aunt to No. 30, aged 30.\n\n43. Angus Sutherland, aged 20, from Auchraich.\n\n44. Elizabeth, his mother, aged 60.\n\n45. Betsy, his sister, aged 15. Died 26th, of consumption. C. C. Argyleshire.\n\n46. Donald Stewart, from Parish of Appin. Died 20th August, 1813, at C. F.\n\n47. Catherine, his wife, aged 30.\n\n48. Margaret, his daughter, aged 8.\n\n49. Mary, his daughter, aged 5.\n\n50. Ann, his daughter, aged 2.\n\n51. John Smith, from Parish Kildonan.\n\n52. Mary, his wife.\n\n53. John, his son.\n\n54. Jean, his daughter.\n\n55. Mary, his daughter.\n\n56. Alex. Gunn, aged 58, from Parish of Kildonan, Sutherland.\n\n57. Elizabeth McKay, his niece.\n\n58. Betsy McKay, his niece.\n\n59. Geo. Bannerman, aged 22, from Kildonan.\n\n60. John Bruce, aged 60, from Parish of Clyne.\n\n61. Alex. Sutherland, aged 24, from Parish of Kildonan.\n62. Wm. Sutherland, his brother, aged 19. Died.\n63. Kate Sutherland, his sister, aged 20.\n64. Haman Sutherland, aged 13, from Kenacol.\n65. Barbara, his sister, aged 20.\n66. James McKay, aged 19, from Cain.\n67. Ann, his sister, aged 21.\n68. John Matheson, aged 22, from Authersakachy.\n69. Robt. Gunn (Piper) from Kildonan.\n70. Mary, his sister.\n71. Hugh Bannerman, aged 18, from Dackslury, Kildonan.\n72. Elizabeth, his sister, aged 20.\n73. Mary Bannerman.\n74. Alexander Bannerman, aged 19, from Dackslury, Kildonan.\n75. Christian, his sister. Died January, 1814, of consumption.\n76. John Bannerman, aged 19.\n77. Isabella, his sister, aged 16.\n78. John McPherson, aged 18, from Gaille.\n79. Catherine, his sister, aged 26.\n80. Hector McLeod, aged 19.\n81. George Sutherland, aged 18, from Borobal.\n82. Adam, his brother, aged 16.\n83. John Murray, aged 21, from Sirsgill.\n84. Alexander, his brother, aged 19.\n85. Helen Kennedy, from Sligo, Ireland.\n86. Malcolm McEachren, from Skibbo, Isla. [Deserted.]\n87. Mary, his wife. [Deserted.]\n88. James McDonald, blacksmith, from Inverness. (To Fort Augustus.)\n89. Hugh McDonald, carpenter. To Fort William. Died 3rd August.\n90. Samuel Lamont, millwright, from Bowmore, Isla.\n91. Alex. Matheson, from Kildonan.\n92. John Matheson.\n93. John McIntyre. (To Fort William.)\n94. Neil Smith, son of No. 31, from Isla.\n95. Edward Sheil, from Balyshannon.\n96. Joseph Kerrigan.\n93 and 94 enter the service of the H.B.C. July, 1814.\nNo. 89, Hugh McDonald, died 3rd Aug. at sea.\nMr. P. La Serre, surgeon, died 16th Aug.\nNo. 46, Donald Stewart, died 20th Aug.\nNo. 37, Catherine Gunn, died 29th Aug.\nNo. 20, George McDonald, died 1st Sept.\nNo. 4, John Sutherland, died 2nd Sept.\nNo. 13, Christian Gunn, died 20th Sept.\nNo. 15, Donald Bannerman, died 24th Sept.\nNo. 45, Betay Sutherland, died 26th Oct. of consumption.\nNo. 76, John Bannerman, died January of consumption.\nChristian Sutherland.\nWm. Sutherland, jr.\n\nNote.—This party landed at Churchill Factory, Hudson's Bay, about the 13th August, 1813, and the following spring went overland to York Factory and thence to the Red River Settlement.—C. N. B.\n\nLord Selkirk writes Miles Macdonald that he could not get a Catholic clergyman to go out to the settlement. Several had refused him.\n\nLondon, April 15th, 1814.\n\nDear Sir:\n\nSince closing my letter of the 12th I have again seen Mr. F. Clark, and I enclose a duplicate of the substance of what is written to Mr. Robt. Dickson about the cattle.\n\nI have also recollected that I have omitted mentioning that notice should be given to the partners or servants of the N. W. Co. at the Forks to quit possession in the manner pointed out in Burr's Justice, Article, \"Distress, head XIV., tenant holding over,\" considering them as tenants at will. This should be done in writing, and verbally also, before enough of witnesses to prevent any question as to the notice being received. The same should be done at all the other posts of the N. W. Co. within the territory of Assiniboia.\n\nI am, dear sir,\n\nYours very truly,\n\nMiles Macdonell.\n\nGeo. Bulger, writing Aug. 4th, 1822:\n\n\"As to what is styled 'Ft. Douglas.' It is well situated, though there is a better position for a fort about 200 yards higher up, upon the land which Mr. Prichard gave up. But as to the fort itself it is, as Mr. Halkett can tell you, the most filthy miserable place imaginable. It is, by at least 25 feet, too small, and the stockades are for the most part rotten and tumbling down. The buildings, except one, are mere log huts, very old and so full of holes as to be perfectly unsuitable. The only one that is of any value is what is called the new house, but even this is nothing more than the shell of a badly built log house, being nowhere boarded outside, and having but two rooms finished inside and so badly have these been done that the light may be seen through the walls in many places.\"\n\nAn application having been made to the executors of the late Earl of Selkirk from the non-commissioned officers and soldiers of the late Regiment de Meuron, now settled at the Red River, and which was transmitted to England last year, Mr. Halkett, on the part of the executors, declares as follows on the three several points of the said application:\n\n1st. As there does not appear to be any means of ascertaining here what quantity of working utensils or other articles were allowed by Government to discharged soldiers in Canada in the year 1816, Mr. Halkett (who is of opinion that the Regiment de Meuron is entitled to these allowances) will, without delay, apply through the Military Secretary at Quebec for a list of the same, and as soon as it is received the allowances shall be made up to those who are entitled to them.\n\nIt appears that these discharged soldiers now at this place have been already fur-\nnished with horses upon credit. And with respect to cattle, they must know that the late Lord Selkirk did everything in his power to get cattle brought to the colony. It has happened unfortunately that the person with whom a contract was made for supplying the colony with cattle failed in two attempts to bring them here. But it is hoped that he will be more successful in the third attempt which he means to make this season. If the cattle should arrive, a fair proportion of them shall be delivered to the de Meurons, who will hold them as the property of Lord Selkirk, until it is ascertained whether and on what terms of payment the military settlers in Canada were allowed cattle by the Government in 1816.\n\n2. Mr. Halkett knows nothing of any regular tariff formed, as the de Meurons say, by the late Earl of Selkirk, to regulate the prices of goods and grain in the colony. If the de Meurons have such a document they ought to produce it. At present all that Mr. Halkett can say is that the price of goods in the colony store is now to be reduced to seventy-five per cent, upon the London prices [the seventy-five per cent being to cover the expense of transportation from London to the Red River]. And with regard to grain, the price recommended by the late Lord Selkirk, viz., ten shillings per bushel for wheat, seven shillings and six pence per bushel for barley, and seven shillings and six pence per bushel for pease, will at present be continued to be credited to the settlers for all that they may furnish to the person in charge of the colony.\n\n3. It is very doubtful how long the colony store will be allowed to continue, but as long as it does there will be no objection to give to honest and industrious settlers, in seasons of distress, some credit for absolute necessaries only, so far as the state of the store at the time will allow. But those who do not, by the cultivation of their lands and every other fair means endeavor to discharge what they owe, cannot expect to be credited again. For the encouragement of all the settlers, the executors of Lord Selkirk have consented to take off the interest which has been charged upon their debts, and they will be credited with the amount thereof in this years' account. And upon the payment of the debts due by them on the 31st of May, 1822, a reduction will be allowed on the principal sum of their respective debts of no less than twenty per cent.\n\nJ. HALKETT.\nForks, Red River,\nJuly 16th, 1822.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000181.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 15822, "total-output-tokens": 9386, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 285, 1], [285, 285, 2], [285, 5248, 3], [5248, 10717, 4], [10717, 15694, 5], [15694, 19402, 6], [19402, 23577, 7], [23577, 27838, 8], [27838, 32646, 9], [32646, 35116, 10], [35116, 35116, 11]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]