[{"id": "3cb98ebb35564380acafc03329525676e7517ebe", "text": "MONTREAL, 25 Juillet 1872.\n\nMonsieur et bien vénéré Confrère,\n\nPermettez aujourd'hui au dernier d'entre vous, à un missionnaire du Saskatchewan, qui depuis plus de vingt ans a laissé son pays, avec ceux qu'il aimait, pour aller au secours de l'Indien du Nord-Ouest, permettez-lui, dis-je, de vous adresser ces quelques lignes pour implorer votre charité, pour son Evêque et ses missions. Malgré les circonstances difficiles du moment, et les quêtes continuelles, qui réclament votre secours de tous les côtés ; cependant, appuyé de l'approbation de votre charitable Evêque, j'oserai aller frapper à votre porte et à celle de vos paroissiens, fort de mes titres de compatriote et de ma vie, dont déjà une grande partie a été consumée parmi les Sauvages. Si ma demande est inopportune, vu ce que vous avez déjà fait pour nous, je saurai me soumettre et supporter un refus qui serait loin d'être injuste.\n\nOui Monsieur, je ne suis pas sans connaître vos charités de tous les jours, vos œuvres à soutenir, etc., etc., mais n'aurai-je pas le droit, moi aussi, de venir vous demander la charité, comme ceux qui sont venus d'Irlande, d'Afrique, de Syrie, etc., etc.? N'aurai-je pas la même hardiesse qu'eux, pour vous tendre la main? Vous me répondrez, et avec raison, que vous êtes fatigué et épuisé par ces quêtes continuelles, et moi, votre missionnaire, votre ami et votre compatriote, sans être arrêté par vos justes plaintes; je vous montrerai notre jeune Diocèse de St. Albert, nos missions qui commencent, le parti protestant qui s'empare de notre influence religieuse, je vous montrerai le statu quo dans lequel nous sommes obligés de rester, à cause des malheurs de la Propagation de la Foi en France, je vous montrerai cette vallée du Saskatchewan, où se trouve le siège de notre Evêché, je vous montrerai, dis-je, ce jeune pays, qui attend des prêtres canadiens, en ce moment, sa vie, son avenir,\nenfin l'espérance d'être un jour un nouveau Canada. Si vous prenez en considération tout cela, ne trouverez-vous pas encore une obole, dans le trésor de votre charité, pour avancer notre œuvre, qui est aussi la votre à tant de titres ? Je vous dirai aussi que celui qui est affamé n'a pas d'oreilles,.... Nous, vos missionnaires, ne devons-nous pas être affamés pour le salut du pauvre sauvage et des âmes confiées à nos soins, et que nous avons gagnées avec tant de fatigues ? Affamé, comme je dois l'être moi aussi, je ne recule devant aucune convenance, et comme le pauvre affamé, qui s'occupe peu, si on va le refuser, je viens demander en toute confiance. Le pauvre honteux aime mieux mourir de faim, que d'aller s'exposer à l'humiliation d'un refus, mais moi, quoique pauvre, il me semble que je ne dois pas avoir honte, et que ceux à qui je m'adresse comprennent ma position.\n\nIl y a une dizaine d'années un vénérable prêtre du Diocèse de Nesqually venait réclamer votre sympathie et l'influence de votre zèle pour sa patrie d'adoption. Vous avez entendu son cri de détresse, et aujourd'hui le Canada peut se glorifier d'avoir établi la Religion Catholique dans l'Orégon. Ce que ce zélé missionnaire vous demandait alors, pour son Evêque et les peuples de ce pays, moi aujourd'hui, fort de la même confiance, je viens vous le demander pour le mien et nos peuplades, dont une grande partie sont encore infidèles.\n\nPour vous mettre plus à même de connaître notre position et nos besoins, je me permettrai de mettre sous vos yeux un aperçu du Diocèse de St. Albert, pour lequel je viens implorer votre sympathie, ce qui vous permettra de juger combien nous méritons votre bienveillance et votre charité.\n\nCe Diocèse, formé d'une partie de celui de St. Boniface, a été canoniquement érigé, sous le titre de St. Albert, par le Souverain Pontife, dans le mois de Septembre dernier, c'est-à-dire Dimanche in albis dernier que Mgr. Grandin, transféré du siège de Satala, prenait possession du nouveau siège de St. Albert et en devenait le premier Evêque.\nCe nouveau Diocèse du Nord-Ouest comprend quatre grands districts, celui de Saskatchewan, de Cumberland, de la rivière aux Anglais et d'une partie d'York. Le District de Saskatchewan, dans lequel se trouve St. Albert, est celui qui offre le plus d'avenir, par sa position géographique, où passera plus tard le chemin de fer Pacifique. Cette parti va, chaque année, prendre plus d'importance que jamais, par l'émigration, qui doit y affluer.\n\nNotre grande douleur aujourd'hui, c'est de ne pouvoir y multiplier les missions, suivant le besoin, qui se fait sentir de plus en plus. Les ministres protestants profitent de notre faiblesse pour tâcher de s'emparer de notre influence, et ne cessent de dire aux Sauvages, que c'en est fait de nous. Dans ce moment présent, ne pas vouloir avancer, c'est reculer; et ce que nos adversaires gagnent aujourd'hui sur nous, ne nous reviendra pas, malgré ce que nous pourrions faire plus tard.\n\nSt. Albert, résidence de l'Évêque, est la principale station et se forme d'une population principalement composée de Métis—à 45 milles de là se trouve la mission du lac Ste. Anne, la plus ancienne des missions de tout le Nord-Ouest, elle a été fondée par le premier missionnaire de ce pays, le vénérable M. Thibeault, qui le premier a enseigné notre sainte Religion aux Métis, aux Cris, aux Assiniboines et aux Montagnais. Ce zèle et saint prêtre mérite, à plus d'un titre, le souvenir et l'estime de tous ceux qui marchent sur ces traces. La mission du lac Ste. Anne se compose de Métis et d'Assiniboines.\n\nDe St. Albert, à 8 milles se trouve le fort Edmonton, qui forme une desserte, ainsi que le fort des Montagnes Rocheuses, à 180 milles d'Edmonton, que nous visitons en différents temps—à 120 milles plus bas que St. Albert, sur la Saskatchewan, se trouve la mission de St. Paul des Cris, exclusivement pour ces Sauvages. Les missionnaires de cette place sont obligés presque continuellement d'accompagner les Indiens pendant leur chasse à la prairie. Ils sont, l'hiver et l'été, forcés de vivre comme leurs néophytes et de se soumettre à toutes les misères et privations de ces peuplades nomades. Il y en a déjà un bon nombre qui\nsont d’assez bons chrétiens, et ce nombre augmenterait vite, si nous pouvions faire quelque chose pour ces pauvres Sauvages. Si nous pouvions faire quelques dépenses, pour les aider à se former en réductions, nous aurions l’espoir de former des chrétiens sur un bien meilleur pied et avec bien plus d’avenir que nous ne pouvons le faire à présent.\n\nNous avons aussi dans le District de Saskatchewan, les quatre tribus des Pieds-Noirs, des Gens du Sang, des Piegan et des Sarcis, qui forment une seul et même nation, qui occupent le centre des grandes prairies, entre le Missouri et la Saskatchewan. Parmi ces sauvages, qui comptent encore 900 loges, nous n’avons malheureusement aucun établissement : Nous n’avons fait que les visiter, pour baptiser leurs enfants. Un missionnaire a déjà pu apprendre leur langue, en demeurant quelques temps au milieu d’eux, et il a pu parler au plus grand nombre en leur annonçant les premières vérités du christianisme. Mais qu’il y a loin, avant d’avoir parmi eux une vraie chrétienté, à cause de nos faibles moyens. Il faut donc attendre, et en attendant, nous verront bientôt, à notre grande douleur et chagrin, les ministres protestants s’emparer de ces âmes—mais enfin il y a une grande chose de faite pour les gagner à Dieu, c’est que nous sommes venus à bout de leur faire conclure la paix avec leur voisins, les Cris. Si elle n’est pas rompue; on peut dire que pour ces deux nations, il ne faut pour le christianiser et civiliser, que du dévouement et de la persévérance de la part du missionnaire et des secours pécuniaires de la part de nos bienfaiteurs. Si nous avions les moyens, déjà nous aurions commencé un établissement bien intéressant sur la rivière des Arcs, aux pieds des Monts Rocheux.\n\nÀ 400 milles plus bas que St. Albert, se trouve le fort de traite de Carlton, sur la Saskatchewan, où se forme en ce moment une mission, qui bientôt sera un poste important, vu que le commerce va se porter de ce côté. Déjà un grand nombre de famille métisses, faisant place à l’émigration à la Rivière-Rouge, viennent chercher des terres, plus proches du buffalos, et se ré-\nunissent autour des prêtres qui sont à la tête de cette nouvelle mission.\n\nLe District de Saskatchewan est desservi par sept prêtres et leur Evêque. Ces missionnaires sont aidés par cinq frères convers, qui s'occupent des travaux manuels. St. Albert possède un couvent de cinq Sœurs Grises, qui tiennent une école et un orphelinat, prenant soin en même temps de notre linge et de celui de nos chapelles. Elles se dévouent là comme partout ailleurs, aux œuvres de charité, avec un zèle admirable.\n\nLe District de la Rivière-aux-Anglais comprend deux établissements, celui de l'Ile à la Crosse et celui du lac Caribou. Ces deux missions se composent principalement de Montagnais et de Cris, qui sont presque tous chrétiens. Ces districts offrent moins d'avantages pour la civilisation et l'amélioration matérielle, que celui de Saskatchewan. Ces deux missions sont desservies par cinq prêtres, aidés par cinq frères. Il y a aussi à l'Ile à la Crosse un couvent de quatre sœurs Grises, qui ont une école et un orphelinat. Il y a encore quelques autres postes; qui dépendent de ces deux missions, et qui en peu de temps formeraient des chrétiens intéressants, s'il y avait des moyens pour bâtir. Pour préparer les voies à la civilisation dans tout cet immense pays, quel plus puissant moyen que celui employé par les missionnaires, formant de côté et d'autre, des chrétiens parmi les Indiens et les Métis, qui, plus tard, seront des centres, où de préférence viendront se grouper les émigrants canadiens.\n\nNos compatriotes, en nous encourageant dans les efforts que nous faisons et en nous aidant de leurs aumônes, préparent ainsi à leurs frères, les futurs civilisateurs de ce territoire, des stations de mission, où ceux-ci trouveront des amis, parmi les missionnaires et les Indiens, et des conseillers désintéressés, qui seront heureux de rendre service à leurs bienfaiteurs et aux nouveaux colons.\n\nDans les deux autres districts, celui de Cumberland et de York, nous n'avons pas de missions et ce n'est que très rare-\nment que nous avons pu y faire quelques apparitions. Cependant il y a là bien des âmes, que les protestants ont déjà commencé à gagner. Pouvez-vous voir cela, sans gémir, dans le fond de notre cœur de missionnaire ? Les Esquimaux de la Baie d’Hudson sont en partie dans notre Diocèse, et jusqu’ici nous n’avons rien pu faire pour eux, excepté qu’un de nos pères est allé passer une saison parmi cette tribu.\n\nLa belle et importante mission du Lac Labiche est aussi comprise dans le diocèse de St. Albert, mais pour le moment, cette partie est administrée par le Vicaire Apostolique de la Rivière McKenzie, car l’intérêt et le bien des immenses missions de l’extrême nord, exigent cet arrangement et cet entente avec les Évêques.\n\nN’est-ce pas, Cher Monsieur, que voilà un bien vaste champ à défricher et à ensemencer, et cela, avec notre peu de monde, mais surtout avec si peu de ressources ? En face des difficultés, allons-nous nous décourager, rester tranquilles et ne pas chercher à avancer l’œuvre de Dieu mise en nos pauvres mains ? Non, Cher et vénéré confrère et Ami, nous pouvons consumer nos forces, nous soumettre à toutes sortes de misères et de privations sans dire mot et nous plaindre ; mais avant de voir languir et peut-être tomber ce que nous avons commencé avec tant de travail, ne nous sera-t-il pas permis de venir vous faire part de nos alarmes et de nos craintes, en soumettant à votre jugement notre état actuel ? Dans vos mains et celles de vos ouailles se trouvent notre avenir et nos espérances. Si le diocèse de St. Albert, comme œuvre religieuse mérite les sympathies du prêtre canadien et des fidèles, comme œuvre nationale, elle n’en commande pas moins les affections de tout cœur canadien, depuis la réunion du nord-ouest à la Puissance.\n\nMonseigneur Grandin m’envoie aujourd’hui vers vous. Quoique Sa Grandeur m’ait chargé d’une mission bien délicate et bien difficile, je ne reculerai pas devant les difficultés, bien récompensé si par là, je puis être de quelques secours à nos pauvres missions. Avec l’approbation de NN. SS. Évêques si zélés\npour l'œuvre des missions, je me présenterai en toute confiance devant vous et vos pieux paroissiens. Autant que les circonstances peuvent le permettre, j'ose espérer que vous voudrez me prêter votre concours et appui, dans la mission que j'ai à remplir, en venant implorer la charité de mes compatriotes. S'il m'était impossible d'aller moi-même tendre la main aux bonnes âmes de votre paroisse, auriez-vous la bonté de faire faire la quête pour moi ?\n\nLes aumônes, que j'ai déjà recueillies, dans les paroisses où il m'a été possible d'aller, sont pour moi une preuve éclatante de la grande sympathie des curés et des fidèles pour nos missions. D'ailleurs, l'accueil cordial et les invitations charitables que j'ai reçues, confirment abondamment les espérances de mon Evêque et de son pauvre missionnaire.\n\nVeuillez agréer l'assurance de mon respect et de ma sincère affection.\n\nALB. LACOMBE, Ptre.,\nO. M. I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000644.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 14806, "total-output-tokens": 3969, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1902, 2], [1902, 3956, 3], [3956, 6122, 4], [6122, 8241, 5], [8241, 8241, 6], [8241, 8241, 7], [8241, 10261, 8], [10261, 12339, 9], [12339, 13249, 10]], "primary_language": ["None", "fr", "fr", "fr", "fr", "None", "None", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false]}}]