[{"id": "8967552c72eddd89760008cadad6c3bb6fdffb06", "text": "RETURN\n\n(IN PART)\n\n(43h)\n\nTo an ADDRESS of the House of Commons, dated 4th March, 1886;—For copies of all papers found in the Council Room of the Insurgents, or elsewhere at Batoche, especially including: 1. The diary of Louis Riel. 2. The minute book and Orders in Council of the insurgent council. 3. The correspondence of Louis Riel.\n\nBy Order.\n\nJ. A. CHAPLEAU,\n\nDepartment of the Secretary of State,\nSecretary of State.\n5th May, 1886.\n\n(Translation.)\n\nLETTER TO LOUIS RIEL FROM N. C. W.—INTRODUCING DEPUTATION, &c.—DECLARING NORTH-WEST IN A STATE OF REBELLION, AND PRAYING RIEL TO RETURN.\n\nSt. Louis de Langevin, 18th May, 1884.\n\nLouis Riel, Esq.\n\nDear Cousin,—This deputation sent to you I hope will not surprise you; you must expect conflicts, treated as the people of the North-West are by the Government, and you must know better than we do what is taking place in this part of the country. In the first place, I will not speak to you about all the acts of injustice and of the way the Government is treating us, and also the Indians; you know that better than we do.\n\nI shall speak to you of the uneasiness felt by everyone—everyone, French and English; I must not speak of the Indians, who are not the least to be feared; for my part I have always looked after them. The movement has been going on for four months, meeting after meeting; we wanted to unite the French and the English, not an easy thing to do at first sight. You know the English, they wanted to rebel at once; we wanted to bring them round to you. As to the English half-breeds, they have a great confidence in you, and they are numerous. They greatly regret that in the matter of 1870 they were against you. They are now the most eager of all.\n\nHence, my dear cousin, we may say that the part of the North-West in which we are living is Manitoba before the troubles, with the difference that there are more people, that they understand things better, and that they are more determined; you will form an idea as to the conditions upon which the people base their claims, for the reason that there are many people in the North-West whom the Government have recognized less than Indians; and yet it is these poor half-breeds who have always defended the North-West at the price of their blood and their sacrifices for a country which is stirring up the whole world today. They have been petitioning for the last ten years. I suppose the Government have looked upon the matter as\nmere child's play; despite formal documents and Acts of Parliament as a guarantee, the whole matter has been a farce; the honor of Parliament and of the Government has been trampled under foot when justice was to be done to the poor half-breeds.\n\nMy dear cousin, I think the solemn moment has come. For my part, I have closely watched the people of the North-West, as well as the Indians, and the one cry resounds from all; it is a spark over a barrel of powder. It is late, but it is the time now more than ever, for we have right and justice on our side. Do not imagine that you will begin the work when you get here; I tell you it is all done, the thing is decided; it is your presence that is needed. It will, in truth, be a great event in the North-West; you have no idea how great your influence is, even amongst the Indians. I know that you do not like the men much, but I am certain it will be the grandest demonstration that has ever taken place, and the English are speaking about it already.\n\nNow, my dear cousin, the closest union exists between the French and English and the Indians, and we have good generals to foster it. I may tell you that Mr. Lepine has a hand in the matter; and I need not speak of Mr. Gabriel Dumont, the delegate, you will learn the truth from him; you may believe him, he is a prudent and intelligent man. He was an old leader on the plains and has great influence with the half-breeds; he will inform you as to everything that is going on. My dear cousin, you have perhaps thought it strange that we did not send other men. I answer that a better choice was not possible than Dumont. As to Michel Dumas, you perhaps know him, he is well instructed in English and French. The others you can take just as they are, they are influential men, the chief man is M. Dumont; as to the English party, he is their choice. He is a most intelligent and devoted man, you may depend upon it. You will see by the documents that they have all their provisions; as to means, they are on hand and in abundance. Dear friend, you desire, of course, to be avenged, and not merely for vengeance sake, for that would be wrong; but this wretched Government has so abused its power and been so faithless to all its promises. No doubt had they done what they promised, you would have remained in your country and defended your people; but your banishment involved that of your whole people, and where is the half-breed who does not feel the blow of your banishment and is not ready to defend you to the last drop of his blood? The whole race is calling for you!\n\nI conclude, my dear cousin, by commending to you myself and your race and country you have so faithfully served, with the conviction that you will make a supreme effort, with the protection of the God of all Nations and of all Glory, for which history will award you, rank with the greatest heroes of this age. And you will most certainly come to the help of an unhappy race, which is being treated with contempt, and which its enemies are striving to extirpate,—the poor half-breed people.\n\nWith sincere good wishes,\n\nN. C. W.\n\nExcuse my orthography.\n\nLETTER FROM T. Z.—NO ADDRESS—EVIDENTLY TO MR. RIEL re AFFAIRS IN NORTH-WEST.\n\n(Translation.)\n\nSAINT LOUIS DE LANGEVIN, 20th May, 1884.\n\nMY DEAR FRIEND.—I am pleased to have an opportunity today of writing you a few lines. Being unable to forget the old links that united us closely of old, and enabled us to enjoy sweet leisure and so many delightful hours together, I would fain remind you of them all once more and revive them, if that were possible. I need not attempt to express to you the warm sentiments of my heart, you know them of old; they are still the same. They are equally sincere as in the past, and, I venture to say, more warm and heartfelt as time goes by. I desire, today, to give you a clear proof of this by telling you of the sedition news now stirring up the North-West.\nThis province has an arbitrary government which is harassing the poor half-breed people out of its very existence. Their most sacred rights are completely ignored. They are treated like slaves, and degraded as though they deserved the utmost contempt. But all these things have long been known to you. For this reason, the North-West Territory is, as it were, on a volcano just about to burst forth in eruption. The excitement is almost universal. Men's minds are everywhere excited. Since the month of March last public meetings have, time and again, been held. Eloquent and stirring addresses have been delivered. The French and English half-breeds are now united, the latter, especially, seeming to be more excited than the first named. We are all one party in support of the justice of our despised rights. It looks as though a real sedition were on the point of breaking out. All are crying out against injustice, demanding fair play and urging the granting of our rights. Mr. Charles Nolin, himself, one of our warmest champions, has declared, again and again, that in every part of the North-West, which he has visited, the half-breeds are prepared to rise to a man in vindication of their just claims. The cry in favor of the good cause is, therefore, universal. Now that all is settled unanimously by all parties, we need a head, a chief. No one of us feels himself qualified to undertake the task of making so great a protest against despotic authority. We all turn our eyes towards you, in whom our dearest hopes and deepest trust are centered, all except a few pretentious individuals of Prince Albert, who would fain be thought something above the common herd and who are afraid of being led by you. We elect you as our chief. We all cry out to you to come to our assistance, knowing that you alone are able to defend us. Not only do the half-breeds in general beseech you to listen to their prayer, but the people of the other races, who do not know you, beg us to express the same wishes on their behalf. Be good enough, therefore, to give a cordial reception to the delegation sent to you. Those who constitute it are all men who enjoy our confidence. There is, perhaps, one of them as to whom you may have some suspicion. Mr. Michel Dumas seems so devoted to our cause that he has won our confidence on this occasion. Mr. Louis Schmidt was at first to have gone in his place; but he was tempted and finally won over by a chance of making money. He got a situation in the Land Office which gives him $60.00 per month; this made him decline the honor of enjoying your presence. The two chief delegates are Mr. Gabriel Dumont and Mr. Isbister. They are appointed to make known to you our just claims. They will submit them for your approval or otherwise, and will abide by your decision. In any case, they are to bring you back to us and satisfy our eager longing to have you in our midst. If not, we beg you to state to our delegates why you cannot undertake the long journey, so that we may give to those who may be against you the sound reasons preventing your coming. Do not be uneasy as to the travelling expenses (should you decide to come), you will have nothing to fear in that respect, at least such is my opinion, though the delegation may not mention it.\n\nI have nothing further of interest to mention at this critical moment. I have now but to offer you the affectionate greetings of all who know you and who loudly proclaim themselves your subjects, and the friendly wishes of all my family.\n\nWith a cordial grasp of the hand I heartily subscribe myself your tender friend.\n\nT. L.\n\nP.S.—I have still many things to say if I could write myself, but being unable to do so, as you know, I shall reserve the narrative until you come.\n\nREPORT re AGITATION FROM JACKSON TO RIEL.\n\nPRINCE ALBERT, 23rd July, 1884.\n\nDear Mr. Riel,—I sent the reports off in good shape by mail last night. We telegraphed to Free Press to have your speech wired (about 1,000 words). I made a copy for the Mail and retained the original, in case they should wire us today. I met Mr. Beatty. Mr. Isbister introduced me, as he was starting for Carrot rive.\nand sent with him two letters, one to a prominent Conservative, the other to a Liberal, that they might act in unison. Without rousing any personal prejudice, I described the great benefits which you had conferred upon us, so I think they will not look a gift horse in the mouth, but suspend their judgment for the present and set to work. I invited them to make out their requirements and choose a delegate to Executive Committee, sending document and name to me. Mr. Beatty will set all going smoothly and then set out for his new home in Stony Creek District, where he will consolidate a strong North-West party. Beatty is the man who objected to my condoning Deacon's interference. You will remember, a good solid man.\n\nTo-day, I shall finish up work in town, and to-morrow start for the Lower States, &c. I will try and get out to your place toward end of week. Please be working up the petition into shape, and we will get it in neat form before the committee is called to endorse or alter it, as they see fit. I have received the Dominion Register, and the Consolidated Acts of Manitoba; will bring them out with me. There is a big work for us while the petition is waiting an answer, but I think we will be ready for a stiff campaign when the answer does come. A number of trimmers are waiting to see if the current in your favor will last. By the time they are satisfied it will be too late for them to bother us much, if disposed to do so.\n\nT. J. Agnew proposed to Macilse that the Conservatives should take counsel together, and adopt your platform under their party name. If they do so, they will be snared by their own subtlety. Men who are willing to betray their country for party ends are going to learn that it is a speedy form of political suicide. Just imagine their thinking that they understand our policy. What a mess they would soon make of it.\n\nMacilse is going to put his ideas into shape and hand them in to me.\n\nI settled matters, commercial and political, with J. F. Betts, shook hands with him, and cordially asked him to show his brain power in our work. He was somewhat astonished, I think, by my change of front, but I hope will shortly gather himself together and wire in.\n\nJ. O. Davis is thinking their mercantile as just out; also other merchants. I set Joe Knowles to work on the solution of the statistical problem, and I think he will do good work for us. I have seen Barker and other mechanics in regard to the effect of the Government's policy on trade. There is no necessity for awaiting statistics, of course, before drawing up the petition. That is a very simple matter, and could be done without any returns at all, in fact, for he who runs may read the numbers under which we labor. At the same time, I have circulated the fullest invitation for every man to hand in his list. The town may possibly not elect its delegates in time for our drawing up the petition, but they have been invited to do so, and I will try and bring a good man with me on their behalf. I shall be just as well pleased if they reserve their strength for the statistical work, and we will not be ready for that till Knowles and I have come to a focus. He has a good head for that kind of business. A clear, concise, logical petition will strengthen our hands more than a month of speechifying. Any bungling work will earn for us the contempt of the business men. I have got on a friendly footing with Owen E. Hughes,* and will cautiously try and induce him to give us his ideas. He is a shrewd businessman. I may write up a reassuring explanation of our work in a manner to disarm prejudice, and put it in the Times for the benefit of our home audience. I am in good health, except a slight cold, and enjoy good rest, and hope that you, also, are in good shape. We will not get much respite till after the petition, but we can rest calm and peaceful as to the result, while the enemies of our God are lying on their beds devising evil things against themselves. Clarke, Sproule & Co. have gone up to Battleford. They will inevitably prepare the good men to receive our doctrine, for they will associate with the oppressors of the people. The idea of sending an apostle in a quiet way up the run is suggesting itself to the minds of many, and I let it work. Providence knows the right man for the right work, and there is no use dictating to Him. Macilse wrote privately to Blake asking him not to stop at L. Clarke's, and Blake wrote back that his health would not permit him to visit the-\nNorth-West this summer. Your visit may cause him to change his plans, but I can keep posted through Maclese, who has kept up a correspondence with him since 1882.\n\nFisher is my lieutenant among the young men of the place, and keeps me posted as to the enemy's movements in that quarter. I think Deacon, who is a Methodist, has seen Mr. Parker, but Mr. Parker is too sound on principle to be lost to us. Mr. McWilliam, the Presbyterian minister, who has hitherto been a Liberal, stated last night at supper table that \"he has yet to learn what our grievances are.\"\n\nIt is the misfortune of clergymen that they see only one side of a man's character, and Mr. Sproule is a prominent pillar of the Presbyterian church.\n\nYet Mr. McWilliam is too good a man I think to be blinded for any length of time. I will leave him to form his opinion from events, and our petition may enlighten him as to our grievances.\n\nIt is Mr. Elliott's opinion that Mr. Jackson is too clever and lacks tact. My past line of action justifies that opinion, and it is perhaps as well that they are so well satisfied with a false key.\n\nDr. Porter's wife is a niece of Donald A. Smith, who is a close friend of Swanson's, and invests his money for him. These circumstances have their significance, but I believe their good hearts will carry them through. \"The smoking flax He will not quench.\"\n\nClark, the druggist, is apparently trying to serve God and Mammon. Let us pray that the best may prevail. The influence of an unprincipled friend is a terrible snare to a young man, especially one of keen intellect.\n\nThe Free Press has just wired for Riel's speech in full. I am going up with Ab. Parker after dinner. I have a great affection for Ab. I believe him to be a good, honest soul. I have got the prices paid to Hudson Bay Company contrasted with prices paid ordinarily for supplies, a valuable document; also the answer of the Secretary of State (Chaplean) to Norquay anent Manitoba demands.\n\nIf any of our friends think I am not getting through business fast enough, please reassure them. You know me and my work, and an element of discontent is dangerous to the cause. I think I see our way clear to raising all the funds we want.\n\nI think I have stated everything at present. I miss you very much, but it is as well that I learn to keep a close direct hold on the Father's hand.\n\nYour friend,\n\nWILL JACKSON.\n\nI can't find my seal; all right; yet the enemy will only use it to their own destruction, if they do intercept it.\n\n22nd March, 1884.—Swearing Secretoy.\n\n(Translated.)\n\nWe, the undersigned, solemnly swear before God that we will keep the secret of this meeting held at Abraham Montour's this 22nd day of March, A.D. 1884, that is to say, all that shall be and has been decided thereat, and in general all the decisions thereof.\n\nAlexandre + Arcan,\nmark.\n\nPierre + Garepy,\nmark.\n\nBaptiste + Pruneau,\nmark.\n\nPascal + Montam,\nmark.\n\nGabriel + Dumont,\nmark.\n\nIsidore + Dumont,\nmark.\n\nAbraham + Bélanger,\nmark.\n\nEmmanuel + Champagne,\nmark.\n\nBaptiste + Parentean,\nmark.\n\nBaptiste + Boucher,\nmark.\nT. E. JACKSON TO RIEL, RE AGITATION.\n\nPRINCE ALBERT, 2nd August, 1884.\n\nDear Sir,—The Opposition are endeavoring to excite the prejudices of those who are \"on the fence,\" by making capital out of the visit of Big Bear and Lucky Man, insinuating that you are encouraging an Indian outbreak. Will you please send me a private letter, which I can make public to those whom it is advisable to reassure, stating the facts of the case.\n\nI hear that D. H. Macdonald telegraphed to Père André to-day, or a day or two ago, stating that Sir John A. Macdonald had written to Dewdney, telling him that as soon as the Minister of the Interior (D. L. McPherson) returns from England, that he will look into the half-breed grievances, and I understand that Père André is advising the people he influences to be satisfied with this assurance; I regret this, and trust the reverend père will change his mind, or lose his influence. The promise of big things from the Government may infuse life into the Opposition, but comparatively few will be influenced. A favorable feeling toward the movement is growing every day among the mass of the people. Hoping to hear from you very soon,\n\nI have the honor to remain yours very truly,\n\nT. E. JACKSON.\n\nMR. LOUIS RIEL.\n\nLETTER FROM RIEL'S COUNCIL TO ENGLISH HALF-BREEDS ASKING THEIR CO-OPERATION.\n\nST. ANTOINE, 21st March, 1885.\n\nTo the English Half-breeds of Red Deer Hill, St. Catharines and St. Paul:\n\nDear Brothers in Jesus Christ,—The Ottawa Government has been maliciously ignoring the rights of the original half-breeds during fifteen years. The petitions which have been sent to that Government on that matter and concerning the grievances which our classes have against its policy are not listened to; moreover, the Dominion has taken the high handed way of answering peaceable complaints by dispatching and reinforcing their Mounted Police. The avowed purpose being to confirm in the Saskatchewan their Government spoliation and usurpation of the rights and liberties of all classes of men, except their resident oppressors, the Hudson's Bay Company and land speculators, by threatening our liberty and our lives. The\naboriginal half-breeds are determined to save their rights or to perish at once. They are supported with no doubtful energy by a large number of abler half-breeds, who have come to the Saskatchewan less as emigrants than as proscripts from Manitoba. Those of the emigrants who have been long enough in this country to realize that Ottawa does not intend to govern the North-West so much as to plunder it, are in sympathy with the movement. Let us all be firm in the support of right, humane and courageous, if in him to fight just and equitable in our views, thus God and man will be with us, and we will be successful.\n\nDear Brothers, in the council of the French Canadian half-breeds, now under arms at St. Anthony and in the Saskatchewan, have been most happy to receive your friendly communications through your Messrs. Scott, Ross and William D., sympathies for the stand which we are compelled to take. * * * The fact that your delegation and ours have crossed each other, affords convincing proof that our feelings are mutual.\n\nJustice commands to take up arms.\n\nSigned by Councillors, Secretary, &c.\n\nLOUIS \"DAVID\" RIEL, Exovede.\n\nMEETING AT ST. CATHERINES—RESOLUTIONS RE OUTBREAK.\n\nAt a public meeting held within St. Catherine's church on the evening of the 22nd March, 1885.\n\nRev. Mr. Matheson was appointed chairman, and Mr. Wm. Craig secretary to the meeting.\n\nThe chairman having stated that his object in calling the meeting was to ascertain the mind of the inhabitants and promote the interests of peace at the present crisis.\n\nA lengthened discussion ensued, after which, on the motion of Mr. Wm. Craig, seconded by Mr. Wm. Hodgson, it was unanimously resolved:\n\n1st. That the members of this meeting continue to sympathise as they have always done with the French half-breeds in their desire to obtain their legal rights by all constitutional means.\n\n2nd. That they don't approve of the resort to arms or the raising of the Indians, and wish to remain neutral.\n\n3rd. That a copy of this minute be despatched without delay to the officer in charge at Carlton, and another to Mr. Riel.\n\nSigned on behalf of the residents of St. Catherines,\n\nE MATHESON, Chairman.\nWM. CRAIG, Secretary.\n\nThe meeting appoint Messrs. Inkster and Hodgson also to sign on behalf of the whole meeting.\n\nGEORGE INKSTER,\nWM. HODGSON.\n\nThe undersigned concur in the above resolution on behalf of meeting at St. Catherines.\n\nCHARLES ADAMS,\nANDREW SPENCER,\nANDREW PETERSON.\n\nLETTER FROM ADAMS AND PRITCHARD, ENCLOSING RESOLUTIONS.\n\nSir,—Enclosed you will find resolutions, passed by a mass meeting, in our neighborhood. But we think a great deal depends on the wisdom and humanity of those at the head of affairs on either side.\n\nMay God give you wisdom to order things aright.\n\nCHAS. ADAMS, Chairman.\nJ. F. PRITCHARD Secretary.\nMEETING AT ST. ANDREW'S—RESOLUTIONS RE OUTBREAK.\n\nAt a mass meeting held in St. Andrew's school house, Monday, 23rd March, instant, to discuss the present critical situation,\n\nMr. C. Adams was called to the chair, and Rev. Mr. Pritchard and Mr. Stanfield, joint secretaries, the following resolutions were unanimously carried:\n\nProposed by Mr. Alex. McKay, seconded by Mr. Chas. G. Bird, sen., and unanimously resolved—\n\n1st. That while heartily sympathizing with the French in their endeavors constitutionally to get redress of their many grievances, we cannot endorse their present attitude in taking up arms for that purpose, and we hereby beg of them not to shed blood.\n\n2nd. That the opinion of this meeting is that, had the Government been just with the settlers, this disturbance would never have been.\n\n3rd. And further, had the influential citizens of Prince Albert joined the movement, instead of ignoring it, had they advised the Government instead of exciting it against the people, it is the opinion of this meeting that the Government would have settled all grievances long ere this.\n\n4th. That we, the English, half-breed and Canadian settlers, while advocating peace and remaining completely neutral as resorting to arms, do not for one moment lose sight of our grievances, and will henceforth use all lawful means for the redress of the same.\n\n5th. That a copy of these resolutions be sent to Major Crozier, and one to Mr. Riel.\n\nSigned on behalf of the settlers of St. Andrews, Red Deer Hill and surrounding country.\n\nJ. F. PRITCHARD, Secretary.\nALEX. STANSFIELD,\nRODERICK COOK,\nANDREW SPENCE.\n\nCHAS. ADAMS, Chairman.\nGEO. GLAISTER,\nTHOMAS MCCORRISTER,\nW. HODGSON.\n\nRIEL TO ENGLISH-SPEAKING PEOPLE OF PRINCE ALBERT,\nRE UNITING IN ACTION.\n\nMISSION OF THE SACRED HEART, 29th March, 1885.\n\nNOTES.—If the police could be isolated from the people at Prince Albert, we would make them surrender easily. I think we could keep them as hostage until we join them, without endorsing or taking up arms, if you feel too much repugnance to do it; but send us delegates to meet ours; we will discuss the condition of our entering into confederation as a province.\n\nThe emigrants, as well as the natives, have a clear case against the Hudson's Bay Company. Do not strengthen her monstrous monopoly by helping along her shrewd, miserable scheme, at the present crisis. If you leave the Hudson's Bay Company and the mounted police, you will see how far we will go to uproot her influence from the Saskatchewan.\n\nLet us unite in those interests which are common to the English and French half-breeds and to the emigrants, and we will celebrate in peace and in success the 24th of May.\n\nBut if we cannot unite, the struggle will grow. Indians will come in from all quarters, and many people will cross this line early this spring, and perhaps our difficulties will end in an American fourth of July.\n\nLOUIS \"DAVID\" RIEL, Exovede.\nS. G. CROZIER TO MACKAY GIVING A TELEGRAM TO BE FORWARDED IN CIPHER.\n\nPRINCE ALBERT, 30th March, 1885.\n\nDear Sir,—Telegraph the following cipher in my name to the Commissioner.\n\nRiel warned all settlers from farms, or would be forced to join him, or be shot, gave them forty-eight hours' notice. People flocking in. Irvine appointed me supply officer. Send flour, bacon to Troy, send 2,000 sacks flour via Calgary to Edmonton, and 4,000 lbs. bacon, if safe. Steamer from here will be sent up to bring it down. Carlton burned to the ground, have saved all furs and bulk of provisions, lot of goods destroyed. Population all in arms. Police here; tell my people I am safe; just got our dead in from Duck Lake, nine in all. Will wire every opportunity, provisions for further transport already at G. Lake.\n\nS. G. CROZIER.\n\nWm. Mackay, Esq., H. B. Co., Battleford.\n\nLETTER FROM PH. GARNOT, SECRETARY, TO A. MONKMAN, RE TREATMENT OF THE SIOUX INDIANS AND HALF-BREEDS, &c.\n\nBATOCHÉ, 2nd April, 1885.\n\nDear Brother,—Will you receive all Indians from Beardy's band and see about rations for them?\n\nWe are receiving, today, all the Sioux from Round Plain, and the half-breeds, and we shall be strong enough, and we are afraid to run short of rations, so we expect that you will treat them kindly and keep them under your order, and give rations to every one, and to his family as long as he or they will be under your control at the fort.\n\nLend them horses and cattle, if possible, to help them to get to Carlton.\n\nTake courage, and we would advise the keeping of guards on top of the hills.\n\nBelieve us, dear brother, your brothers in Jesus Christ.\n\nFor the Council.\n\nPH. GARNOT, Secretary.\n\nTo Exovede A. Monkman.\n\nN. NAULT AND OTHERS TO COUNCIL, RE INTOXICATING LIQUORS.\n\n(Translation.)\n\nBATOCHÉ P. O., 9th April, 1885.\n\nSt. Antoine de Padoue.\n\nTo the Members of the Council:\n\nGentlemen,—Several rumors having reached this side of the river, we deem it our duty to send you a few words anent the same; we mean as to the matter of drink. We have fault to find with you gentlemen, members of the council. We find drunken men on every side along the river. It seems to us it is the duty of all of you to see to this matter. It seems to us that you are inactive. What grieves us is to see you on the other hand quarrelling amongst yourselves and giving trouble to those who act right. From the way you are acting we fear greatly that you will dishearten many amongst us. The best course to take is to come to a clear understanding amongst yourselves, once for all. We promised to keep temperance in times of the hardest struggle, and now that things do not look quite so bad as they were we want to fall back! We rely on you to set matters right.\n\nYours truly,\n\nNAPOLEON NAULT,\nJOSEPH DELORME,\nPATRICE TOUROND,\nBAPTISTE OUDELETTE,\nPATRICE FLURIE.\nPROMISE OF NEUTRALITY &c., FROM V. VEGREVILLE, O.M.I.\nSt. Antoine de Padoue, 10th April, 1885.\n\n(Translation.)\n\nI promise to remain perfectly neutral, and that I will not leave this place without the consent of the provisional government.\n\nV. VEGREVILLE, O.M.I.\nP.M.A.\n\nPROMISE OF NEUTRALITY, &c., FROM J. V. FOURMOND, O.M.I.\n(Translation.)\n\n15th April, 1885.\n\nI, the undersigned, declare that I will remain neutral and will do nothing against the French Canadian half-breed movement.\n\nJ. V. FOURMOND, O.M.I.\n\nLETTER FROM THE WIFE OF GEORGE NESS TO LOUIS RIEL PRAYING FOR THE RELEASE OF HER HUSBAND.\n\n(Translation.)\n\nSt. Antoine, March, 1885.\n\nDear Sir,—Excuse me for troubling you like this, but you are the only person in whom I trust to have pity on me, who am so deserving of pity, left alone as I am with my three little children who are very young, no near neighbour to help me to take care of our little animals, and, also, you have arrested my husband when he was trying to get something for his little family. Oh! believe me, it is I who am the cause of your having taken him. The day before I told him and begged him to go and sell his horse to get provisions, and also several things of which we are greatly in want, such as shoes and clothing for my children. Thus, dear Sir, having great confidence in your devotion to the half breeds, I thought I would appeal to your charity to give me a little of what I need. Ah! Sir, were it not for the help of the grace of God, our common Father, I should die of loneliness and grief at being separated from my husband, who is so good. But may the holy will of God be done on earth as it is in Heaven. Dear Sir, oh, how happy I should be to see him, only to speak to him. No one but you can grant me that blessing.\n\nOh! I am sure that for the love of his children and me he would listen to me if I spoke to him. But, I repeat, I have not had the happiness of speaking with him since I told him to sell his horse. Your words, dear Sir, have remained imprinted in my heart. Yes, while I live I never shall forget the time you entered our house. But George is a half-breed, and I never can believe that my race will be cruel enough to kill my husband or keep him long a prisoner. Now, if he promises not to meddle, let him come and do his work, for I am in a position that I have need of him, I am not strong enough to work.\n\nAdieu, dear Sir, I will pray for you with all my heart.\n\nTHE WIFE OF GEORGE NESS.\n\nP.S.—Excuse me, I am short of paper.\n\nMr. Louis Riel.\n\nCut Knife Hill, 29th April, 1885.\n\nI want to hear news of the progress of God's work. If any events have occurred since your messengers came away let me know of it. Tell me the date when the Americans will reach the Canadian Pacific Railway. Tell me all the news that you have heard from all places where your work is in progress. Big Bear has finished his work. He has taken Fort Pitt. \"If you want me to come to you let me know at once,\" he said and I sent for him at once. I will be four days on the road. Those who have gone to see him will sleep twice on the road. They took twenty prisoners including...\nthe master of Fort Pitt. They killed eleven men including the agent; two priests and six white men. We are camped on the creek just below Cat Knife Hill waiting for Big Bear. The Blackfeet have killed sixty police at the Elbow. A half-breed who interpreted for the police having survived the fight, though wounded, brought this news. Here we have killed six white men. We have not taken the barracks yet, but that is the only entire building in Battleford. All the cattle and horses in the vicinity we have taken. We have lost one man, a Nez Percé killed, he being alone, and one wounded. Some soldiers have come from Swift Current but I don't know their number. We have here guns and rifles of all sorts but ammunition for them is short. If it be possible send us ammunition of various kind. We are weak only for the want of that. You sent word that you would come to Battleford when you have finished your work at Duck Lake. We wait still for you, as we are unable to take the Fort without help. If you send us news send only one messenger. We are impatient to reach you. It would encourage us much to see you and make us work more heartily. Up to the present everything has gone well with us but we are constantly expecting the soldiers to visit us here. We trust that God will be as kind to us in the future as he has been in the past. We, the undersigned, send greeting to you all.\n\nPOUNDMAKER,\nCOPINOW-WAY-WIN,\nMUSSINASS,\nMETAYWAYIS,\nPEEYAYCHEW.\n\nMr. LOUIS RIEL:\n\nWhen this reaches you send us news immediately as we are anxious to hear the news.\n\nIf you send us news send as many men as possible.\n\nA true and certified copy.\n\nCHAS. B. ROULEAU,\nStipendiary Magistrate for the N.W.T.\n\nDECISION OF THE COUNCIL—RIEL A PROPHET.\n\n(Translation.)\n\nMoved by M. Boucher, seconded by M. Tourond, That the Canadian half breed Exovidat acknowledges Louis David Riel as a prophet in the service of Jesus Christ, and Son of God and only Redeemer of the world; a prophet at the feet of Mary Immaculate, under the powerful and most favorable protection of the Virgin Mother of Christ, under the visible and most consoling safeguard of St. Joseph, the beloved patron of the half-breeds—the patron of the universal church; as a prophet, the humble imitator in many things of St. John the Baptist, the glorious patron of the French Canadians and of the French Canadian half-breeds.\n\nAyes:—M. Henry, M. Parentean, M. Dumont, M. Tourond, M. Jobin, M. Trottier, M. Boucher, M. Lépine, M. Carrière.\n\nM. Ouellette did not vote at all, but said that after a time, if his views changed, he would record his vote.\n\nDECISION OF THE COUNCIL.—Re CHANGING THE NAMES OF THE DAYS.\n\n(Translation.)\n\nCHANGING THE NAMES OF THE DAYS OF THE WEEK.\n\nMoved by Mr. Boucher, seconded by Mr. Jobin, That the names of the days of the week be changed as follows:—\nMonday to be named .......................................................... Christ Aurore.\nTuesday do ........................................................................ Vierge Aurore.\nWednesday do .................................................................... Joseph Aube.\nThursday do ......................................................................... Dire Aurore.\nFriday do .............................................................................. Dénil Aurore.\nSaturday do .......................................................................... Calme Aurore.\nSunday do ............................................................................. Vire Aurore.\n\nAyes:—M. Boucher, M. Jobin, M. Carrière, M. Tourond, M. Parenteau, M. Lépine, M. Ouellette, M. Trottier, M. Henry.\n\nNays:—Mr. Ross.\n\nDECISION OF COUNCIL.—SUNDAY TO BE RELIGIOUSLY OBSERVED.\n\n(Translation.)\n\nTRUTH OF SUNDAY.—25TH APRIL, 1885.\n\nMoved by P. Parenteau, seconded by D. Carrière:\n\nThat the Lord's Day be put back to the seventh day of the week, as the Holy Ghost appointed it, through his servant Moses; and that if there be any members of the \"Exovidat\" who are not as yet prepared to vote for this resolution, those of their brethren who this day take the lead cordially invite them to join as soon as they can conscientiously do so; and that, though their adhesion be delayed, it shall be accepted when it comes, as freely as if it had been given today. May these adhesions soon render unanimous the act by which the Canadian half-breed \"Exovidat\" restores, in God's name, the Holy Day of the Lord's Rest.\n\nAyes.—Messrs. Boucher, Dumont, Trottier, Parenteau, Jobin, Carrière, Henry, Tourond, Bte. Parenteau.\n\nNays.—Messrs. Ouellette, Ross, Lepine.\n\nLETTER FROM LOUIS DAVID RIEL TO \"DEAR RELATIVES\" RE DISARMING THE POLICE, SEIZING PROVISIONS, ETC.\n\nDear relatives,—We thank you for the good news that you took the trouble to send us.\n\nSince you are willing to help us, may God bless you, in all what is to be done for our common salvation.\n\nJustice commands to take up arms. And if you see the police passing by, stop it, and take away their arms.\n\nAfterwards, notify the Wood Indians that they might be surprised; let them keep ready to all events, in being calm and courageous; to take all the powder, the shot, the lead, the posts and the cartridges, from the Hudson's Bay stores at Nut Lake and Fishing Lake. Do not kill anybody. Do not molest nor ill-treat anybody, but take away the arms.\n\nFear not.\n\nLOUIS \"DAVID\" RIEL, Exovede.\n\nLETTER IN RIEL'S HANDWRITING.\n\n(Translation.)\n\nMonsieur F. X. Batoche.\n\nThe French half-breeds have taken up arms in masse. Not one of our people is against us. Tell our relatives the Indians to be ready to come to our help, if needed. Take all the ammunition of the company.\n\nTo the English Half-breeds of Red Deer Hills, St. Catherines and St. Paul:\n\nDear Brothers in Jesus Christ,—The Ottawa Government has been maliciously ignoring the rights of the original half-breeds during fifteen years. The petitions\nwhich have been sent to him on that matter and concerning the grievances which all classes have against its policy are not listened to; moreover, the Dominion has taken the high-handed way of answering peaceable complaints by reinforcing their mounted police, the avowed purpose being to confirm in the Saskatchewan their Government spoliation and usurpation of the rights and liberties of all classes of men, except these assistant oppressors, the Hudson's Bay Company and land speculators. They are supported with, no doubt, full energy by a large number of other half breeds who have come to the Saskatchewan less as emigrants than as proscripts from Manitoba. Those of the emigrants who have been long enough in this county to realize that Ottawa does not intend to govern the North-West so much as to plunder it, are in sympathy with the movement. Let us all be firm in the support of right; humane and courageous, if we have to fight, just and equitable in our views, thus God and men will be with us and it will be successful.\n\nDear Brothers, in the council of the French Canadian half-breeds now under arms at St. Anthony and in the Saskatchewan has been most happy to receive your friendly communication through your Messrs. Scott, Ross and William Paquin.\n\nThe fact your delegation and ours have crossed each other, affords convincing proof that our feelings are mutual. Justice commands to take up arms.\n\nPierre Paranteau, chairman,\nGab. Dumont,\nMoise Ouellette,\nAlbert Monkman,\nBte. Paranteau,\nNorbert Delorme,\nMaxime Lepine,\nDavid Tourond.\n\nCh. Nolin,\nBte. Boyer,\nDonald Ross,\nAmb. Jobin,\nPierre Henry,\nDamase Carrière,\nBte. Boucher,\n\nPH. GARNOT, Secretary.\nLOUIS \"DAVID\" RIEL, Exovede.\n\nSt. Anthony, 21st March, 1885.\n\n(Translation.)\n\nCOPY OF A LETTER TO ENGLISH AND FRENCH HALF-BREEDS AT LAKE QU'APPELLE.\n\nTo our brothers the English and French half-breeds of Lake Qu'Appelle and vicinity:\n\nDear Relations and Friends,—If you have not already heard, you shall hear the reasons which lead us to take up arms. You know that of old your fathers, at the risk of their lives, defended this country, which was theirs and which is ours.\n\nThe Ottawa Government took possession of our country fifteen years ago, they make a mockery of our rights and offend against the law of God by inflicting upon us endless injustice. The officials commit every species of crime; and the mounted police are the scandal of the world by their foul language and evil conduct. So corrupt are they, that our wives and our daughters are no longer safe in the neighborhood. The laws of decency are to them a mere matter of jest.\n\nO my friends, we must at all times trust in God; but today the measure of evil is full to overflowing, and we have special need to commend ourselves to our Lord. You will perhaps see things as we see them. Our country is stolen from us, and then it is so badly governed that, if we let things go on, it will soon be impossible to save ourselves.\n\nThe English half-breeds of the Saskatchewan are undoubtedly with us. The Indians are crossing to us and joining us on all sides.\n\nPurchase all the munitions you can. You can go to the other side of the line, if necessary, for them. Be ready. Do not listen to the offers the Ottawa Government will make to you; their offers are the offers of robbers. Sign neither papers nor petitions. Trust in God and in the circumstances which Providence is now bringing about on the Saskatchewan. We shall not forget you. If promises are\nmade to you, say that the time for promises is past. We have reached a point when we must have proof for everything. Pray; be good; keep the commandments of God and you shall want for nothing.\n\nRESOLUTION IN FAVOR OF ANNEXATION TO UNITED STATES.\n\nResolved,—That when England gave this country to the Hudson Bay Company, two hundred years ago, the North-West belonged to France, as history shows it. And when the Treaty of Paris ceded Canada to England, no mention of any kind was made of the North-West.\n\nAs the American-English colonies helped England to conquer Canada, they ought to have a share of the conquest, and that share ought to be the North-West, since, commercially and politically, the United States government have done more for England than ever England did; we ought to have annexation. Against England and Rome. Manitoba, French Canadian.\n\nRESOLUTION EXPRESSING FRIENDSHIP TOWARDS THE UNITED STATES, AND DOUBT AS TO ENGLAND'S OWNERSHIP OF THE NORTH-WEST TERRITORIES.\n\nResolved:—\n\n1. That our union is, and will always be, most respectful towards the American Government, their policy, their interest, and towards the territories government of Montana as well.\n\n2. That our union will carefully avoid causing any difficulty whatever to the United States.\n\nAnd will not conflict in any way with the constitution and laws of the Government. It is doubtful whether England really owns the North-West. Because the first act of government that any law ever accomplished over that North-West was to give it as a prey to the sordid monopoly of the Hudson's Bay Company 200 years ago.\n\nHer second act of government of any importance over that country was to give it in 1870 as a prey to the Canadian.\n\nOur union is, and always will be, most respectful towards the American.\n\nRIEL'S ANSWER TO INVITATION TO COME TO SASKATCHEWAN.\n\nGentlemen,—The goodwill you manifest towards me, and with which I know you to be animated for me, fill me with joy and do me great honor. Your voice is more than friendly; it is the voice of loving fellow-countrymen. Your voice which speaks to me is a sweet voice and very tender. It is not merely the voice of loving compatriots I hear when I listen to you, I say, but it seems to me the voice of my country itself. Yes, I tell you, it is the very voice of my country. You are, you say, delighted to see me once more; and you prove it to me. Believe me, I also am happy. What a joy for me to grasp your hands once more, and to embrace you. You are good enough to mention what I have done for Manitoba. It is true, I did my best to secure its happiness. But if I succeeded, it was because I had in you the support of friends, firm, generous, brave and independent; and whatsoever my place in history may be, I shall owe my reputation, under God, to you French Canadian half-breeds. You did not abandon me in my time of peril, and it was my duty to stand firm before every obstacle in order to help you. Though small in respect to numbers, the French-Canadian half-breed people have made a noble struggle. I am happy to see them at rest and enjoying prosperity; and let me congratulate you on your increase and the vigor you have acquired in the short space of ten years. I thank you for the flattering and delicate terms in which you invite me to live with you. It would most assuredly be very pleasant for me to spend my days in the midst of fellow-countrymen so grateful as you are. The love I have for my native land is strong enough to keep me here, but my adopted country has taken hold of\nmy heart, and I have promised to devote myself to it. I belong to it so long as I live. It knows that I love you, that I do not forget you; it approves of the legitimate, loyal and rightful love I bear to my native land. The more liberal my adopted country is towards me, the more am I bound to honor and to love it; and inasmuch as that country supports and is in favor of all that is lawful, loyal, just and reasonable, it will certainly permit me to give free scope to the love I have for you.\n\nRESOLUTIONS IN RE SENDING A DELEGATION TO LOUIS RIEL IN UNITED STATES.\n\n3. That the French and English natives of the North-West (those that have not participated in the Manitoba Lands Grant) want free patent for the land they possess and occupy at the present date, without any prejudice to any more grants to which they are entitled for the extinction of their Indian title to the lands of the North-West.\n\n4. That the natives, French and English, protest against the dues and charges on timber and forests until their rights within mentioned be recognized and granted by the Dominion Government.\n\n5. That the management of the Indians such as Indian agencies, instructorships or other offices for the benefit of the Indians in the North-West Territories be entrusted to natives, as they are more familiar with the habits, character and wants of those Indians, and to prevent any regrettable occurrences as have happened in the past.\n\n6. That the French and English natives of the North-West having never recognized any right to the lands of the North-West, assumed by the Hudson Bay Company or by the Dominion Government, claim an exclusive right to these lands along with the Indians.\n\n7. We the French and English natives of the North-West, knowing that Louis Riel has made a bargain with the Government of Canada, in 1870, which said bargain is contained mostly in what is known as the \"Manitoba Act,\" and this meeting not knowing the contents of said \"Manitoba Act,\" we have thought it advisable that a delegation be sent to said Louis Riel, and have his assistance to bring all the matters referred to in the above resolutions in a proper shape and form before the Government of Canada, so that our just demands be granted.\n\n(Translation.)\n\nRIEL'S ADVICE ON MOVEMENTS OF DEFENCE.\n\n22nd April, 1885.\n\nTo avoid, as much as possible, weakening our strong points on both sides of the river here, let a certain number of men be detached to watch the movements of Middleton's camp beyond Tourond's coulee. On the other side of the river also, let a certain number of men be detached to watch the movements of the mounted police. For my own part, with all the respect I have for the views of the council and the desires of the army, I wish, nevertheless, that no attack be made against the police now, because: 1st. The spirit which is good enough to guide me, has said to me: \"Not far from here;\" 2nd. Because that same spirit has told me that it would be good to bind the prisoners, which shows me that we should need all our men here. 3rd. Because that good spirit has said to me: \"By dint of hard blows, strive to defend every inch of ground,\" which also gives me to understand that we need all our forces here. 4th. Because it has been said to me: \"Let Gabriel Dumont pay attention.\" Now, this attention required from my uncle Gabriel applies not only to his wound, but makes me fear that, with his eager courage and his inattention to his personal safety in battle, he may expose himself too much and meet with some grievous mishap. If anything happened to Dumont, it would not only be a misfortune for his friends, but an irreparable loss for the future and for the whole people. If my uncle Gabriel were cured of his wound, I should be more willing to see him\nstart on an expedition of this kind. If we get reinforcements, I might change my opinion, I think, to a certain extent. Under present circumstances, I know, I understand, that it would be of great benefit to us to go and attack and harass the mounted police on the other side of the river, at Clark's Crossing; but that would weaken us here, and I fear that, meantime, from Prince Albert or elsewhere, some encounter may occur, in which we shall need all our strength.\n\nRespectfully, and in the frankest spirit of friendship, I offer these considerations to the attentions of the \"Exovidat,\" so that they may weigh my reasons. What I wish is, that my reasons be examined, but be convinced, Sirs and dear brothers in Jesus Christ, that when you have examined what I now submit to you, if you adopt a course contrary to my views, I shall look upon it as an expression of the permission of God, and I will help you, with all my strength, to carry out your views as though they were my own, to the greater glory of God.\n\nROLLS.\n\n| No. 1 COMPANY. | Alexandre Montour | 5 |\n|---------------|-------------------|---|\n| Isidore Dumont, Captain (R.I.P.) | Charles Faignant | 6 |\n| Nap. Nault | Raphael Parenteau | 8 |\n| Gabriel Parenteau | Baptiste Ouellet | 9 |\n| Louis Parenteau | Pierre Gervais | 10 |\n| Sam. Parenteau | Ambroise Dubois | 5 |\n| Leon Ferguson | Bernard Paul, Captain | |\n| Bpte. Deschamps | John Shen | 1 |\n| Athanase Lépine | Grégoire Lejour | 2 |\n| Maxime Dubois | Corbette Laplante | 3 |\n| Jean Baptiste Montour (R.I.P.) | Bien Montour | 4 |\n| No. 2 COMPANY. | Thomas Ouellette | 5 |\n| E. Dumont, Captain. | Hill Sansregret | 6 |\n| Moïse Parenteau | Alexis Dumont | 7 |\n| Boniface Leford | John Martin | 8 |\n| Jean Caron | Charles Martin | 9 |\n| Pierre Bollegarde | Pierre Martin | 10 |\n| Paul Déjarlais | Maxime Fidler | 6 |\n| Theophile Caron | Jonas Moureau, Captain | |\n| Louis Parenteau | Joseph Ouellette | 1 |\n| E. Tourond | Julien Oulette | 2 |\n| Louis Davis | William Piché | 3 |\n| No. 3 COMPANY. | Maurice Henney | 4 |\n| Ambroise Champagne, Captain. | Baptiste Larocque | 5 |\n| Joseph Vandal | Patrice Faingant | 6 |\n| Louis Lafontaine | Roger Goulet | 7 |\n| William Vandal | Joseph Montour | 8 |\n| Bpte. Vandal | Baptiste Hamelin | 9 |\n| William Delorme | Toussaint Laplante | 10 |\n| Alexandre Gosselin | No. 6 COMPANY. | |\n| Josué Ireland | Joseph Ouellette | 1 |\n| Modeste Laviolette | Julien Oulette | 2 |\n| Baptiste Letendre | William Piché | 3 |\n| Charles Laviolette | Maurice Henney | 4 |\n| No. 4 COMPANY. | Baptiste Larocque | 5 |\n| Antoine Lafontaine, Captain. | Patrice Faingant | 6 |\n| William Hamelin | Roger Goulet | 7 |\n| Joseph Bremnor | Joseph Montour | 8 |\n| Dan. Charrette | Baptiste Hamelin | 9 |\n| St. Pierre Parenteau | Toussaint Laplante | 10 |\n\n| No. 7 COMPANY. | William Boyer, Captain. | |\n|---------------|--------------------------|---|\n| Louis Rooss | Louis Rooss | 1 |\n| William Fidler | William Fidler | 2 |\n| Joseph Pilon | Joseph Pilon | 3 |\n| Corbet Fidler | Corbet Fidler | 4 |\n| Charles Thomas | Charles Thomas | 5 |\n| Joseph Sauvé | Joseph Sauvé | 6 |\n| Moïse Carrière | Moïse Carrière | 7 |\n| Jeremie Sauvé | Jeremie Sauvé | 8 |\n| Joseph Sauvé | Joseph Sauvé | 9 |\n| Gol. Sauvé | Gol. Sauvé | 10 |\n### No. 8 COMPANY\n\n- Baptiste Vandal, Captain.\n- Norb. Sanvè\n- Francis Vandal\n- Patrice Gervais\n- André Letendre\n- Louis Letendre\n- Louis Marion (deserter)\n- Pierre Tourond\n- Bapte. Ouellet, jun.\n- William Thorn\n- Alex. Fidler\n\n### No. 9 COMPANY\n\n- Corbet Flamant, Captain.\n- Modeste Rocheleau\n- Joseph Dumas\n- Pièrre Sanrégret\n- Norbert Turcotte\n- Solomon Boucher\n- Isidore Villeneuve\n- Elizard Parisien\n- Bte. Rocheleau\n- Magloire Boyer\n- Alexandre Bremner\n\n### No. 10 COMPANY\n\n- Daniel. Gariépy, Captain.\n- Joseph Trottier\n- Louis Bousquet\n- Alex. Cardinal\n- John Ouellet\n- Joseph Delorme\n- Baptiste Bousquet\n- Ignace Poitras\n- Bernard Ouellette\n- John Demarais\n- Joseph Flamant\n\n### No. 11 COMPANY\n\n- Philip Gariépy, Captain.\n- Jean Carron\n- Albert Trottier\n- Charles Trottier\n- William Bruce\n- Frederic Fidler\n- Napoleon Boyer\n- J. Bpte. Boyer\n- George Fidler\n- Auriel Gariépy\n- John Fagnant\n\n### No. 12 COMPANY\n\n- Bapt. Boucher, Captain.\n- William Swan\n- William Bremner\n- Moise Bremner\n- Esdras Parentean\n- Alexandre McDougall\n- Jerome Racette\n\n### No. 13 COMPANY\n\n- Laframboise (R.I.P.) Captain.\n- William Bremner\n- André Letendre\n- Charles Carrière\n- Jerome Pieton\n- Napoleon Parentean\n- Corbet Ross\n- Michel Poitras\n- Ed. Laframboise\n- Antoine Allard\n\n### No. 14 COMPANY\n\n- Calixte Lafontaine, Captain.\n- Francis Fidler, sen.\n- Joseph Well\n- Guillaume Laplante\n- Modeste Vandal\n- Barthélémie Pilon\n- Patrice Parentean\n- William Letendre\n- Ignacé Poitras\n- François Fidler\n- Jean Baptiste Parentean\n\n### No. 15 COMPANY\n\n- James Short, Captain.\n- Antoine Vandal\n- Pierre Landry\n- Joseph Vandal\n- Pascal Montour\n- Ls. Cayal\n- Isidore Boyer\n- Pierre Parentean\n- Jean Dumond\n- Joseph Ouellet\n\n### No. 16 COMPANY\n\n- Bapt. Primeau, Captain.\n- Basile Plante\n- François Primeau\n- Alexandre Bourassa\n- Napoléon Arcan\n- William Racette\n- M. Bourassa\n- Louis Bourassa\n- Baptiste Primeau\n- Gil. McKay\n- William Meckmoire\n\n### No. 17 COMPANY\n\n- William Fidler (sen.) Captain.\n- Bapt. Rochleau\n- William Fidler\n- James Ward\n- Baptiste Roy\nPierre Vandal ........................................... 5\nJ. Bapt. Rivard ........................................... 6\nJos. Vermette ........................................... 7\nPaul Schly ........................................... 8\nThomas Petit ........................................... 9\nFrançois Vermette ........................................... 10\n\nNo. 18 COMPANY.\n\nA. Belanger, Captain.\n\nJos. Lafournaise ........................................... 1\nVital Cayal ........................................... 2\nDaniel Gariépy ........................................... 3\nAlex. Lafournaises ........................................... 4\nNorbert Belangé ........................................... 5\n\nIn charge of horses on this side of river.\n\nAnt. Lafortune, Captain.\n\nWm. Hamelin ........................................... 1\nSt. Pierre Parentean ........................................... 2\nRaphaël Parentean ........................................... 3\nElzear Swan ........................................... 4\nNap. Gervais ........................................... 5\nNoël Turcotte ........................................... 6\nPierre Tourond ........................................... 7\nIgnace Poitras ........................................... 8\nEd. Dumond ........................................... 9\nOléoph. Champagne ........................................... 10\n\nTo the Secretary of the Council:\n\nCaptain Baptiste Primeau; To form a military company:\n\nBazile Plante ...........................................\nFrançois Primeau ...........................................\nAlex. Bourassa ...........................................\nNapoleon Arcan ...........................................\nWilliam Racette ...........................................\n\nModeste Bourassa.\nLouis Bourassa.\nBaptiste Primeau, jun.\nGuillaume McKay.\nWilliam Swan.\n\n(Translation.)\n\nREPORT OF M. LEPINE ON THE BATTLE OF 12TH APRIL.\n\nI corroborate the report of Mr. Dumont up to the moment of the departure of Mr. Riel, for Mr. Riel left it to the choice of the people, whether he was to go away or to stay. The answer he received was to go and assist the women and children. About half past eight in the morning, I started to get something to eat at the house of the widow Tourond, and about nine o'clock we left, Pierre Henry, Isidore Dumas and I, to come to the coulée. Our people made signs to us that the police were coming. Then we took up our position to wait for them, and we had hardly taken our places when shots were heard at the other end. As soon as we heard the shots we rushed to that side. When we got there our people were already all scattered and the battle had commenced. Not long after I saw that Jerome Henry was wounded, and we then took up a position in the coulée nearly on the bank, and I spent nearly the whole day there. The time seemed so long that I thought it was already evening, but on looking at my watch I saw it was only noon. Before noon we heard shots all around us; but we heard shots also from the direction of Tourond's, showing that there were still some of our people in that direction. In the afternoon we heard no more shots there, and I thought that our people on that side were all dead. Near us and towards Mrs. Tourond's we heard shouts, and I think it was Gabriel Damont and his people who were there. I know that Alexis Gervais was there, for I saw him come from that direction, and then we saw that we were surrounded, for we saw men on all sides; we then heard the bugle to the right of our position and we heard the soldiers coming in the wood of the coulée, for we heard the branches breaking, and there were others along the wood to the left; and we heard voices speaking all around us and in front on the prairie, and then I thought we were lost. And when they came into the wood we heard dreadful firing on every side. It was then between three and four o'clock in the afternoon. After that they retreated, and it seemed to me that the volleys were less frequent; and about five o'clock all was quiet for a good while, only a few sentinels seemed to be stationed at intervals watching us. During that period we thought they were getting ready to come and take us. After that we said to one another, we must try anyhow and kill one each if they come, and we must each of us fire a good shot. And Charles-Trottier counted the men there, and out of one hundred and sixty that we were at the beginning there remained but fifty.\nfour. I do not know whether he counted the wounded. And then we consulted as to how we were to get away and decided to wait until night and then to run the risk of breaking our way out. But we knew that many of us must be killed in that undertaking. And then we also thought of our wounded and it seemed to me that the only assistance I could leave them was the crucifix I had held in my hand all the day, but when I spoke of that no person answered me; and we were praying all that time, and I had the crucifix and I said: \"We shall commend ourselves to God and pray that we may have perfect contrition, so that if we die we may save our souls.\" And then I prayed; for I thought we were about to die and I had doubts as to the justice of our cause. And I thought all our people were dead and that our small party were all that remained. But Delorme did me good when he said to me: \"We must pray to God to take us out of this.\" And almost immediately they again commenced firing—not many rifle shots, but four cannon shots—and two or three out of the four seemed to me to burst over our heads. And all day the balls seemed to fall like hail. And after these four cannon shots all became more quiet, and we heard a man from among the police shout to us, speaking in the Cree tongue. He said, \"his name is Borie,\" and, it seemed to me, \"that we must be hungry;\" and he asked to be allowed to visit us. He also asked us to tell him how many we were. And some of the others answered him, but I do not remember what they said to him. But they would not let him come. I was inclined to let him come, and felt tempted to tell him to come, but I thought it better to say nothing for fear of making a mistake and being blamed afterwards. It occurred to me that while he was with us the police would not fire, and meantime night would set in and we should be able to get away. But almost immediately afterwards our people came up and the soldiers fled and did not fire again, and we came away.\n\nWe prayed all the day, and I think prayer did more than the bullets. Often when the soldiers appeared on the hillocks our people fired and that made them fall back and others came to remove them.\n\n(Translation.)\n\nREPORT ON THE BATTLE OF THE 24th APRIL, 1885.\n\nReport (but not sure) of the Battle fought at Gen. Middleton's Camp, 24th April, 1885.\n\nWe attacked them on the march at Tourand's Coulee. We had taken possession of the coulee. We attacked them in front and they made a strong resistance, but gained little ground. We had but one wounded of our people, Jerome Henry, a Cree, and two Sioux. The battle lasted three hours, that is from 9 a.m. till noon. They were about 200, and there were 18 tents on the other side of the river. They have a ferry boat, the Clark's Crossing scow, with them. We think they crossed some 50 men. We hold our position and intend to attack them again during the night. We think there are 30 or 40 dead and wounded in the enemy's camp.\n\nAll the news we have received up to this time, 9.15 p.m.\n\n(Translation.)\n\nREPORT OF TROTTIER ON BATTLE OF 24th APRIL.\n\nI corroborate the report of M. Dumont. Up to the arrival of the first horseman I was there with Gabriel. Then I went down to the coulée, signalling with my hand to our people, and calling out, \"run to the coulée, run to the coulée.\" Then we tied all our horses there, and we went up the hill on foot to fire, and we began to fire, I do not know how many shots. Suddenly I saw a Sioux killed quite close to me, then as the gun I was using was not good, I called out to another Sioux to take the gun of the dead Sioux, saying that I wanted to use it. He took the gun and lent it to me. It was a double gun with horn and shot-bag. We fired again, and, of a sudden, I saw Gabriel coming towards me (I saw him first on my right); he said he had no more cartridges; I gave him those I had, for I wanted to use the double gun,\nand I called out to the people, \"They want to pillage the coulée; we must go down and take all the horses and prevent them.\" And I told a young man to take Gabriel's horse, and I took mine; and going down the coulée I saw Gabriel, and he asked me where his horse was? I told him the young men were taking it away. It was the last time I saw Gabriel, and then I tied my horse in the wood and went up the hill on the south side, and firing began on both sides, and suddenly some one called out to me, \"There they are coming down the coulée with their cannon!\" I looked and saw them coming down, and I shouted to the young men, \"Take courage, take courage and pray to God.\" Then they began firing at us with their cannon and rifles, and the balls fell like hail. It was about two in the afternoon, and I began shouting \"fire, fire,\" and when our men began firing I saw that the police fell, and I heard the cry, \"They are going to run,\" and I called out \"fire, fire,\" and shouted for joy, and when the soldiers retreated out of the coulée, I asked the people where Gabriel was, but no one knew, and I asked continually where my children and nephews were, and I thought all our people had been killed except a few, for nobody answered me but two of my boys, and every time we stopped firing we prayed to God. Suddenly I heard a young man singing in French the song of the Bois Brulé, the song of the Falcon. That gave me courage. I kept shouting, \"courage, courage!\" Afterwards it began to rain and hail, and I said to the people, \"Don't fire now, we must wait until they come, and if they come near we'll fire altogether. It was about 5 o'clock in the evening, I called out, \"Where is Johnny?\" (my brother's boy), and I heard him answer about a hundred yards from us. Immediately after his answer they fired three cannon shots and some rifle shots in that direction. Some time afterwards I stood up and went to see all the people, and I said to them, \"my friends, we shall start away this evening, but before we leave this we must pray to God for our dead and our wounded, and also for ourselves, so that He may give us a way out of this,\" and I told them that \"as to the wounded, those who can walk we must not leave them, we shall carry them to the groves and cover them well, and we shall go away quietly all together.\" I then counted the men and found but 48, with the wounded, and I said to them, \"do not stir, I shall go and see my horse.\" He was only 40 or 50 rods from us. Then my nephew said to me, \"Uncle, come here, I want to speak to you.\" I answered, \"Do not stir, nephew, and do not fear; I will not leave you, I will go and see my horse, and then I will go to you.\" When I went to see my horse, my boy and another young Indian, followed me. I found my horse still standing and unhurt, but all the other horses around him were dead. It was then about sundown. My coat was on the saddle, and while I was untying it, I saw our people on the hill shouting joyfully. When they came up I shook hands with them, saying, \"We are only forty-eight, and I think many have been killed.\" As I spoke, I saw six of our people come out of another wood, bringing our number up to fifty-four. Then when our people had come, they wanted to follow them up, but I called out: \"Do not follow them, we have done enough for the present.\" They desisted and went to the battlefield to gather rifles and other things, and I said to them: \"We must try and find carts to take home the wounded this evening.\" And I found a cart and harness at Mrs. Tourond's house, and the men on foot started on in front, and the horsemen remained behind. I got a mattress from the house and put two wounded men in the cart; the other wounded were placed on a buck-board. I walked in front, leading the horse with a rope. When I had gone about two miles, a young man lent me his horse. He said he would lead the horse, as I was tired. I was very glad to get the horse. When we got together at Touronds' house, I found that there had not been many of our people killed; only four were missing. A man came and called out in Cree: \"What are you fellows doing there? Your people are all going?\" I said to our people: \"Let him talk away; don't answer him.\" Then he said: \"How many are you?\" I again told our men not to speak. He called out a third time, saying: \"You must be hungry, come and eat.\" I said to our people again: \"Do not speak.\" He spoke after the last cannon shots were fired.\n\nThere were not many of us in that wood, but God gave us a good road, and we reached the house in safety.\n(Translation.)\n\nREPORT OF GABRIEL DUMONT ON THE BATTLE OF 24TH APRIL.\n\nWhen we left this, we stopped near my place, to the rear. We said a decade of the rosary. Then we went on as far as Roger Goulet's.\n\nThere we killed a couple of cattle for food. After eating, we began to prepare to go to the enemy's camp. Mr. Champagne arrived. He said: \"We must wait a little and see what is to be done.\" He reported police coming from the direction of Little Mountain, on the Fourche Road. There he asked us for thirty men to come here. He asked Mr. Riel if he would come with them. Mr. Riel consented, asking for forty men. Nearly all the people wanted to come away. In the end some fifty came. After eating at Roger Goulet's, we sent the Sioux out as scouts. We then went on to Tourond's Coulee. We halted on the other side of the coulée, upwards. I, myself, rode on further. I went out of the moonlight into a tuft of trees; I came back again, hearing nothing but the flute. When I got back to our people they were on their knees praying; I also knelt down. When they finished, our scouts had not come in. As it was nearly day I gave the order to leave the place; we set out, taking the road to the left in the groves of trees; we went as far as the first houses, McIntosh's. It was already day, and as I saw it was impossible to get at them during the night, I told our people my plan was to return. Then we returned back to a low spot. I then borrowed a horse in order to go with Napoleon Nault to see the enemy's camp and to try and induce them to follow us. We went to within about half a mile of the camp, which seemed to be disturbed. We came back then to our people. Then I ordered our people to start back again for Tourond's Coulee, saying: \"We shall wait for them there.\" We killed an ox for breakfast, and got hay for our cattle. Before eating, we sent Mr. Gilbert Brabant to see if the enemy were coming. After we had eaten he came in. He said that the cavalry were coming on in front. We saddled twenty-seven horses. Then we went down the coulée and posted ourselves about half a mile from our people. There we waited some time. It was then between nine and ten in the morning. Sending out scouts on foot. Mr. Bte. Deschamps told us he saw a trooper passing alone and then some ten on the other side. Pierre Laverdure told us he had seen one also. We then mounted and prepared for a rush. While we were watching, one of them showed himself to me about 150 yards off. His horse turned sharp about and we rushed straight for him. Our men fired, as we started, two or three shots. I think they hit him at the first shot. He was no longer able to handle his horse; then I followed him and fired two shots at him. I turned then and made for the coulée towards our people. There we began exchanging shots with the enemy. We tied our horses lower down than the point where most of our people were. There we exchanged fire again for a short time. I then went to a little grove in order to fire at them again. The police then came down at once alongside a wood. I began to fire. There were four or five of us, we were nearly all scattered. I then went up the coulée and met some people coming down. They were nearly all Sioux. There I was told a Teton had been killed. I then went to the place where the bulk of our people were. I encouraged them, saying, \"God is strong.\" Then I went to the place where the Teton had been killed. I asked him, \"Are you dead?\" He answered me: \"No.\" I then went down the coulée passing near our people and encouraging them all the time, when I came near Maxime Lepine, he said he was troubled as to what he ought to do. I thought it was on account of the crucifix he had in his hands; I said to him: \"Pray for the cause of our religion and for its glory.\" Just then I was told that Jerome Henry had been hit. Then someone called out to me that the police were going to charge; thereupon we made for a small hollow and drew back into shelter. There I remained a short time, Napoleon Nault called out to me: \"Mr. Dumont, I think the Indians and the Sioux are going to run; you had better go and stop them.\" As I saw many of our people who were in good heart, I answered: \"Yes, I'll follow them.\" When I got near the horses, I found a lot of the people there: Sioux, Crees and\nsome half-breeds, going up the coulée ahead of the police in order to head them off. When I got to the hollow, I called out to them: \"Stay there.\" I tied my horse in the wood. We went up and stationed ourselves in the prairie, so that the police might not pillage the sides of the coulée. There we fought for a long time. With some of the Sioux and some half-breeds there were about fifteen of us. We remained about three hours and a-half. We fired slowly, but with steady aim. Then I said to those who were with me: \"I will go and see our people\"; and an Indian said to me: \"Do not leave us; if you do, many of ours will run away.\" I held on for a while, and then said to them: \"Try and fight by yourselves for a while; I will go and see our people, and I promise to come back to you. When I hear my men shouting sturdily I know they are in good heart, because God is helping them.\" Then I went down the coulée to the place where I had left the bulk of my people. There the police had already crossed the coulée with a cannon. I went into the thick bush where the horses were tied. There, towards the middle of the bush where our people were, there was a clearing. Meantime the police were firing at me with the cannon and rifles. There I stopped, where there were large trees, thinking how I could serve them, for it was too great a risk for me. I turned back and went again to the little party I had left. They were still there. We held out for a short time longer. Then I said to them: \"We can do nothing for our people here; let us go higher up in the coulée.\" We started out, following the coulée. We went up a little higher than Donald Ross' house; we saw the Sioux who had fled in front. Then we took the groves towards the river, after crossing the road. We found two of our people mounted on one horse. Then we gave them a horse. All the Sioux were leaving us, and would not listen to us any longer. We stopped in the groves in sight of David Tourond's house. My people said to me: \"Go by yourself and see if we cannot get to our people.\" I went. As soon as the police saw me across the coulée, they fired a cannon shot and rifles at me. Then I returned to see my people. When I got to them I said: \"The only way of rescuing our people is to stay here until night. We can go and eat at Calixte Tourond's, and then in the night, we shall attack. Then we went to the house, and food was prepared. Shortly before we began to eat, Moïse Ouellette and Philippe Gariépy joined us. Then I told them we intended to attack at night, and that I did not think many of ours would fall. Then we remained there. Moïse and Philippe told us that Mr. Riel was preventing the people from coming to our assistance; but their opinion was that Mr. Riel would not be able to prevent them. Then they said we ought to wait for our people who were coming. There were also some Sioux with us. Two of them started on horseback to see the fight, but they turned back and brought a wounded mare with them. The Sioux, Mad Ball, told me then that it was impossible to go there. Philippe told me the same thing, saying it was useless to go. I said to them again: \"We shall not go in daylight, but at night.\" Then Moïse Ouellette said: \"We must wait for our people yet; they will come.\" We waited a short time, and I said to them: \"Let us talk the matter over,\" and, thereupon, we decided to return to meet our people, and we set out. We met Mr. Boucher a little beyond Roger Goulet's, with Édouard Dumont. They told us they were quite sure our people would come. We went on our way without stopping. Then we met our people coming to our assistance. Then we turned back, going slowly, in order not to tire our horses. Then I said: \"Let us put the carts in front, and tell them to move on quickly.\" I took my position in the rear, in order to command them all. Meantime it was raining heavily, and I said: \"We shall stop at Calixte Tourmond's and dry our guns.\" Afterwards we set out again. Some of our men wanted to hang back, and I ordered them to advance. When we got near the coulée, I left my party, in order to go on in front. There were people on the left side of the coulée, and others on the right. I hastened, with an Indian, Yellow Blanket, to a spot where there were two horses tied. I said to him: \"Come down, nephew; let us each saddle a horse, so as to be ready sooner.\" He answered: \"Saddle them both, and I'll watch here for you. While I was saddling Pierre Parenteau's horse, Philippe Gariépy came up to us. I gave him the halter strap, saying: \"You take this one.\" Then I\ntied the other with the reins in the saddle, and started him off towards our people, who were behind us. On reaching them, we saw the police descending the other side of the coulée to surround our people. The latter called out: \"They are going to charge.\" I turned my horse, and rode towards Tourond, following the cart road upwards. I followed the wood on the slope. I met our people, who were in the coulée. Then I told them that it was the power of God that had saved their lives. Then I shook hands with them, and asked them if my brother Eli was alive? They answered, \"yes.\" I went up the hill saying: \"We must follow them.\" The men shouted out in reply: \"That's enough, don't go after them.\" Some of our people were ready to follow them, but I said to them; \"We have done enough, we must listen to our own men.\" Then I continued on up the hill to see the police—I saw them going away in retreat. Then we went to the groves to look for bodies and rifles. We found nothing but the wheel marks of the carts in which the bodies had been removed. Then I returned to the coulée where our people were. We determined not to leave any of our dead or wounded. We went to Tourond's house to warm ourselves, for we were cold. Then we went to Calixte Tourond's and got a waggon, with a cart and another small waggon to carry the dead and the wounded. Then I stopped all the horsemen, who wanted to return at once. I said to them: \"The people on foot will go on alone and we shall keep guard and wait for those who have gone for the dead and wounded.\" When they had brought them in I told them to start out with the carts in front. I remained all the time in the rear until we reached the place where I had met Mr. Boucher and Dumont. There I said to them: \"My friends, I am cold. I think my head will suffer.\" I asked them if they would let me go on in front? They said that a great many would follow me. I said: \"No, I will prevent them.\" Then I urged them not to separate, and I started away. When I got to the people in front, I said to them: \"Do not follow me.\" Five or six of them wanted to follow me, but I stopped my horse and said to them: \"Since you will not listen to me, you may go away by yourselves, I will stay with our people.\" Then André Letendre said: \"Go yourself, we shall stay.\" Thereupon I started Catching-up to some people on foot I told them I was going on in advance. On leaving the wood, I met eight or ten horsemen. Some of these came in with me, amongst others Napoleon Nantland Charles Trottier. When I got here, I found some men who had got in before us though I was not aware that they had left us. Then I went at once to the council house. After shaking hands with those who were there I asked for some hot tea. There was none to be had. I then returned to my own house. If there is anything incorrect in my report, I ask pardon of God, for it will not be by my fault.\n\n(True copy)\n\nPH. GARNOT, Secretary.\n\n(Translation.)\n\nRULES FOR KITCHEN SERVICE.\n\nRules which the cooks are to follow strictly:\n\nThey must 1st Have breakfast ready for 7 o'clock.\ndo 2nd do dinner do 12 do\ndo 3rd do supper do 6 do\ndo 4th Keep the kitchen perfectly clean;\ndo 5th Take good care of dishes and utensils entrusted to them by the Exovidat;\ndo 6th Admit into the kitchen only persons having special business with the Council, without seeking to impede their work;\ndo 7th Give food only to those who are on the list approved by the Exovidat, or to persons admitted by order of the Council;\ndo 8th Make, amongst themselves, as little noise as possible;\ndo 9th Be courteous, vigilant and careful in the discharge of their duties.\n\nBy order.\n\nPH. GARNOT, Sec. of Council.\nSUBMISSION OF ALBERT MONKMAN TO RIEL'S COUNCIL, AND HIS EXPRESSION OF BELIEF THAT RIEL WAS A PROPHET.\n\nBatoche, 26th April, 1885.\n\nThis is to certify that I, Albert Monkman, have given up myself to be treated by the exovidat council as they may see fit except execution, on account of a false idea that I did not believe that Louis David Riel was a prophet. I said if he will know what I think I had better desert. I would believe Mr. Riel and have read my conscience, and I believe him to be a prophet by the grace of God for our movement.\n\nYours truly;\nALBERT MONKMAN.\n\nANDREW TATE'S SWORN PROMISE THAT HE WILL NOT COMMUNICATE WITH PRISONERS.\n\nI, Andrew Tate, do make oath and promise that I will never again go and see any prisoner; and that I will try neither by sign, word nor any other way to communicate with one or more prisoners, especially Albert Monkman, and that I will keep to my place in every way.\n\nSworn before me at St. Antoine,\n27th April, 1885.\nPH. GARNOT,\nSecretary for the Council.\n\n(Translation.)\n\nLETTER TO THE ENGLISH AND FRENCH HALF-BREEDS OF BATTLE RIVER, FORT PITTS AND VICINITY.\n\nOur good God has always taken care of the half-breeds. \"I have fed them many days in the desert.\" It was Providence that enriched our prairies with the buffalo, and the abundance with which our fathers were supplied was as wonderful as the heavenly manna. But we were not sufficiently grateful to God, our good Father, and that is the reason we allowed ourselves to fall into the hands of a Government which had no thought for us except to plunder us. Ah, had we understood what God did for us before Confederation, we should have been sorry to see it come about. The half-breeds of the North West would have insisted on conditions of a nature to preserve in behalf of our children that freedom, that possession of the soil, without which no one can be happy. But fifteen years of suffering, impoverishment and covert malignant persecution have opened our eyes, and the sight of the abyss of demoralization into which the Dominion is daily driving us deeper and deeper, has suddenly, by God's grace, stricken us with horror. And more terrified by the hell to which the mounted police and their Government are striving openly to lead us, than by their firearms, which, after all, can only kill our bodies, we have risen. The voice of conscience has given the alarm and cries out to us; \"justice commands you to take up arms.\" Dear relatives and friends we advise you to be on the alert. Be ready for anything. Take the Indians with you. Bring them together from all sides. Take all the ammunition you can, wherever it may be stored. Murmur, protest and threaten. Stir up the Indians, and also render the police of Fort Pitt and Battleford powerless. We pray to God to open the way to us to get up to you, and when we enter that way, as we hope to do, we will help you to take Battleford and Fort Pitt. Have confidence in Jesus Christ. Place yourselves under the protection of the Blessed Virgin. Implore help from St. Joseph, for he is powerful with God. Commend yourselves to the powerful intercession of St. John the Baptist, the glorious patron of the Canadians and the half-breeds. Be at peace with God; keep His commandments; we beseech Him to be with you all and to give you success. Strive to give speedily to the half-breeds and Indians at Fort Pitt the news we send you, and tell them to be sure to be ready for anything.\n\nL.\n(Translation.)\n\nLETTER—MRS. SALOMON TO RIEL, COMPLAINING—HOUSE SACKED BY INDIANS.\n\nSt. Antoine, 25th April, 1885.\n\nDear Sir,—The Indians took possession of my house while I was away. They broke in the doors of the shed and took all the food I had in it. While I was away they did that, and in my presence they killed my hens. If you would kindly send me a cart to help me to remove what I have left, or if you could send me some guards to restrain them, I should be much obliged.\n\nMADAME SALOMON, V.\n\n(Translation.)\n\nA SCOUTING REPORT OF ALEX. CAGAN.\n\nReport of Mr. Alex. Cagan of Lake Muskeg, 26th April, 1885.\n\nI was at Pike Lake, and an Indian started out for Battle River. When he got there the Indians of that place were taking the contents of the stores. I state what the Indians told me. There was but one store near the Government fort which was not taken, but the Indians camped near that store. The next morning they set out to clean out all the stores, after breakfast. All the goods the Indians took they hauled to their camp as they took them. They started to take a camp which was on the other side of the river, but they arrived too late, for the Indians were already starting for the north side. I forgot to state that all the chiefs held a meeting before that, in order to ask the agent for ammunition for hunting. They asked quietly four times. The agent replied: \"I will not let you have any ammunition; live as you have been accustomed to live.\" Little Spruce said: \"Why? You promised to feed us. We asked you for this quietly in order to support our children; you are doing this to vex us. No one asked you to come here.\" Straw-man, another Indian, said: \"Yes, you shall soon see how we used to live in former times; we were great fools.\" And then they went away. The following day the agent and Peter Banatine took two sacks of flour and 50 lbs. of bacon to each chief. Straw-man said to Banatine: \"You are doing this to make fun of us and to vex us the more.\" The first they went to see was the farm instructor at Eagle Mountain where Red Pheasant is. The farmer fired first, but they made his shot go off in the air, and the son of Horned Bull, an Assiniboine, pierced him with an arrow, but Maringouin's son-in-law finished him with his tomahawk. An Assiniboine Indian named Yellow-Hair killed another farmer who had care of the cattle. They crushed his head also; these two events happened the same day. On the reserve of Chief \"Struck-in-the-back,\" Jos. McKay was the farmer, and they warned him that they did not want to do him harm, because they were too much accustomed to him, but they took everything there was there. Then they went to Straw-man's reserve. There was a farmer there, and before they spoke to him he tried to defend himself, but a Cree named Flowing-Leaf took the axe and gave him a blow on the cheek; the other turned round and yelled, but he gave him a second blow and finished him. Then some of them wanted to draw back, but their people sought to kill them. The Assiniboine wanted to kill the Crees who wished to draw back. He said to them: \"They have already killed one-half of us by hunger, you must not try to save them.\" In this way they all went together and no person would draw back. The name of the Indian who brought me that news is La Graine D'Origana. After that, I said to the Cree: \"Let us go and see about Battle River and the Lake Brocket people. And when we stopped on the other side of the river, after we got off our horses, they fired three times at us with their cannon. And when I saw that, there were some abandoned houses, and I told the Indians to burst open the doors and help themselves. The houses were well stocked with provisions and the Indians said: \"Riel is charitable, and that's why we have plenty to eat.\" A little way further down we helped\nourselves again, and I provided myself from the store of a trader of the company, taking everything there was. There was a barrel of powder. That one I was wrong in taking, for he is with you; but it was the company's property. And I started to come back this way; and after a day's journey my son and son-in-law turned back to get flour and pork at Battle River. If I had had certain news I would have made the Indians far more crazy. They wanted to start out again for a hunt in that direction. Then I came towards Muskeg Lake to the place where I met my brother. There on the day after my arrival, we broke up camp to go to the Mustawasis reserve, for they had no provisions. It was there I destroyed the pigs. When I was going to leave, my brother told me, he was not with the Government since he was with the half-breeds. He had not as yet meddled in the matter. \"But you see, he said, how I am in need of means. Many of the people are sick too.\" He further said: \"I am afraid of our people, the Crees, to go with the Government. We are but two brothers, and he was waiting for me to know what I would say to him. There is only one in whom I trust and that is God. If he wills that I should die of hunger, I shall die so.\" When the chief's people sent a runner to Lake La Peché, the agent replied: \"Since he wants to go with the half-breeds, let the half-breed feed him. Why did he not come with you Bélangers?\" He said that to the runner. I said to my brother: \"Neither have I meddled in the matter, but I do not want to hold back, for one of my boys is there; and if they want us they know what to do. Otherwise, I must be a coward, since my boy is there.\" I think they wanted to follow me at once, and I cannot go aside from that, and if you would be afraid, I also would be afraid. I have never had much affection for Canada and I have still less at present. I should still like to go away hunting, but if you think it better that I should be here I will not go; but there are a great many animals there. Bélanger is between two fires; he is afraid to go to Prince Albert and he is afraid to come here. I heard from an Indian, Big Bear, that Tom Quinn went to give the freight in the camp and that they killed him there. And then some Canada people wanted to escape at the Little Fort and they killed eleven of them. They took everything from a mail carrier and let him go. When that man left Fort Pitt to bring the letters, he saw the Indians attacking Fort Battleford. And when he left there the same Assiniboines took him and took away his letters, and he fled to the Graine d'Orignal reserve and reached that camp, and I reached it in the morning after he left. And when I got there the horse came in hobbled. I think it was the same Assiniboines who took him. The mail carrier told the Indians that all the forts are taken by the half-breeds and Indians towards Edmonton. Straw-Man took 350 head of cattle, and two Indians took 40 horses. They have a lot of horses. They have 340 guns and much ammunition. My brother has eleven guns. I think they have no rifles; we have three. I gave them a little too much powder. Big Bear has all the Montagnais with him.\n\nTranslation:\n\nSCOUTING REPORT—ALEX. PARENTEAU, BATOCHÉ.\n\nReport of Alexandre Parenteau, 30th April, 1885, written at Batoche.\n\nThe Indian camp is between the reserve of \"Man-who-was-struck-in-the-Back,\" and that of \"Straw-Man.\" I started from the Red Prairie Bend on Battle River. This is the tenth day since I started. Three Indians came and camped at my place. I asked them to tell me the truth, so that I might bring in reliable news. They answered that they had killed ten for certain, and that the first was the farmer of the Assiniboines, and that if I wanted to be convinced I need only look in the manure heap; that he was buried there. I told them I believed them. Alex. Salomon's pupil, with Smart, went to Winnipeg. The youth went on in advance with four other men and I saw them near the Indian camp. He had deserted. When he reached the camp the Indians took his horse and arms away from him. Then they asked him to tell the truth as to whether he had deserted to\ncome to the camp? He answered, \"yes.\" The Indians asked if he had seen any soldiers? He said, \"yes. I saw some between the river and the big grove. They said there were five hundred.\" It was they said that. When I left the grove the three Indians accompanied me as far as the end of the buttes. There we unharnessed in order to eat before parting. After going some distance I saw five horsemen and rushed towards them. When I got near they made sign to me to stop and I did not do so but kept on. And they began firing at me (it was twenty-five or thirty miles from Battle River) but I continued advancing upon them. They fired seven shots. They were lying on the ground in order to fire at me, and when they saw that I did not stop they mounted their horses and fled. When I got to the top of the hill I saw the camp. They were on horseback to chase me and I got away from there. In the spring I had left my horses in the grove and I went to look for them. I found them, and on the following day I left the place and camped beyond Eagle River in the buttes. Starting thence I unharnessed at Eagle River; then I camped at the spring. On reaching Pointe des Buttes de Sable I saw tracks of horses, the dung had not had time to dry. There were five of them. I did not see them and I do not think they saw me. They were going towards Clarke's Crossing. At the telegraph I saw thirty in the distance, and when I got there I counted the tracks. There I saw two blankets, one blue and one white. Nearer to me I saw one, he was alone and was flying as fast as he could go. I made for the river, got down the hills, and tethered my horses in some small maples. It is there I left my family. And when I left them I came and camped in the sand buttes a little way from the camp, and in the morning I got on top of a butte and saw Middleton's camp on this side of the river. Towards evening yesterday I left the place. I wanted to cross the road in the open in order to reach a grove. My wife became faint and we crouched down there. They did not see us. Thence I went to Mr. Bélanger's.\n\n(This report is made under oath.)\n\nList of Killed.\n\nKilled on 26th March, 1885:—Augustine Laframboise, he leaves a wife and two children; Isidore Dumont, he leaves a wife and some twelve children; J. Bte. Montour, he leaves a wife and two children; Joseph Montour, not married; Achiwagin, a Cree, a wife and five or six children.\n\n24th April, 1885:—St. Pierre Parenteau, a wife and no children; Joseph Vermette, a wife and four children; Michel Desjardins, wife dead, but leaves three children; Michel Boyer, a wife and children; two Sioux. I do not know whether they were married or not. (See Mr. Labombarbe.)\n\nDead of the Battlefield.\n\nAnderson, S. C. Elliot, Lawyer, John Wimeskirk, James Backie, Wm. Napier, Alex. Fisher, Bob. Midleton, Capt. John Merton, Dan. McKenzie.—R. I. P.\n\nLETTER FROM MONKMAN TO GARNOT, STATING THAT HE SENDS SET OF HARNESS, AND REFERRING TO THE CASE OF ARAND vs. ARCAND.\n\nMr. Garnot,—I send one pair of harness; that is all I have on hand to spare at present. Is Arcand vs. Arcand case dropped? I think that that case must be looked into, as I think it will make a hard feeling on one part—that feeling will be the means of some parties going back to their homes. As for my part, I don't wish to see any hard feeling on either side.\n\nYours truly,\n\nA. Monkman.\nLETTER FROM DOMINION LANDS AGENT TO JOSEPH VANDAL, INFORMING HIM THAT HIS PATENT IS READY FOR DELIVERY.\n\nDOMINION LANDS OFFICE, WINNIPEG, 30th December, 1879.\n\nSir,—The patent awarded to you under the provisions of the Act 37 Vic., cap. 20, is now ready for delivery at this office. Should you call for it in person, unless you should be personally known to the agent, you will require to be accompanied, with a view to identification, by someone known to that officer; or the patent will be delivered to an agent on your behalf, provided such agent file in this office a power of attorney, in proper form, duly executed in the presence of a justice of the peace, resident in the Province of Manitoba, Keewatin or the North-West Territories.\n\nProduce this circular on calling, either in person or by agent, for patent.\n\nI have the honor to be, Sir, your obedient servant,\n\nDONALD CODD, Dominion Lands Agent.\n\nTO MR. JOSEPH VANDAL, OF THE PARISH ST. AGATHE.\n\nLETTER FROM DOMINION LANDS AGENT TO BAPTISTE PRIMEAULT IN RE' LAND CLAIM.\n\nDOMINION LANDS OFFICE, PRINCE ALBERT, N.W.T., 12th April, 1882.\n\nSir,—I have the honor to acknowledge the receipt of your letter of the 3rd April referring to your claim on behalf of your son and yourself to the S.W. ¼ of Section 28 and to the N. ¼ of Section 21, Township 44, Range 8.\n\nIn reply I have to inform you that even numbered sections are open for homestead and pre-emption entry, and that, pending the decision of the Government regarding occupants of odd-numbered sections previous to the issue of the Order in Council withdrawing the same from settlement, your claim will be filed.\n\nI have the honor to be, Sir, your obedient servant,\n\nGEO. DUCK, Agent Dominion Lands.\n\nBAPTISTE PRIMEAULT, ESQ., DUCK LAKE, N.W.T.\n\nPASSES.\n\nAmyot, Arthur, to-morrow, 7 a.m., 28th March, 1885.\nAmyot, Arthur, 9 p.m. this day, 30th March, 1885.\nBremner, sen., pass until otherwise ordered.\nBoyer, Isidore, until otherwise ordered, 28th March, 1885.\nBelanger, A., until 9 p.m. this day, 31st March, 1885.\nCayal, L., until to-morrow, 2 p.m., 30th March, 1885.\nCayen, —, until 8 this evening, 30th March, 1885.\nChampagne, Amb., to-morrow morning, 30th March, 1885.\nDubois, Maxime, 29th March, 1885, until to-morrow morning.\nDumont, Edouard, to-morrow morning, 30th March, 1885.\nDumas, M., to-morrow morning, 3rd April, 1885.\nFerguson, Leon, to-morrow, 27th March, 1885.\nFaignant, Cuth., to-morrow morning, 28th March, 1885.\nFidler, Alex., until 5 o'clock, 29th March, 1885.\nFaillants, Patrice, until 11 o'clock, 29th March, 1885.\nFleurie, Patrice, until to-morrow morning, 30th March, 1885.\nFidler, J. Bte., until midnight, 1st April, 1885.\nFidler, sen., until otherwise ordered, 2nd April, 1885.\nGarriepy, to-morrow morning, 29th March, 1885.\nHenry, Jerome, to-morrow at noon, 27th March, 1885.\nHenry, Pierre, until to-morrow evening, 30th March, 1885.\nLaboucane, Alex., until 7 a.m. to-morrow, 28th March, 1885.\nLaviolette, Max., until noon, 29th March, 1885.\nLepine, Abbé, until to-morrow morning, 29th March, 1885.\nLaframboise, the younger, until 6 o'clock, the 30th, 1885.\nLafontaine, Ant., 7 o'clock this evening, 31st March, 1885.\nLaboucane, G., to-morrow noon, 31st March, 1885.\nLepine, Max. to-morrow morning, 3rd April, 1885.\nMonkman, Albert, and 2 men to go on guard at his house, 27th March, 1885.\nParentean, Louis, until to-morrow morning, 29th March, 1885.\nParentean, Isidore, until to-morrow noon, 29th March, 1885.\nParisien, Elzéar, until this evening, 30th March, 1885.\nParentean, Pierre, until to-morrow morning, 30th March, 1885.\nParentean, son of Daudais, until to-morrow morning, 30th March, 1885.\nPaul, Bernard, for two hours, 30th March, 1885.\nPilon, Joseph, until 7 this evening, 31st March, 1885.\nParentean, N., until this evening at 7, 31st March, 1885.\nRoss, Donald, until to-morrow evening, 27th March, 1885.\nRacette, Jérôme, until otherwise ordered, 28th March, 1885.\nSauvé, Linomme, until 7 to-morrow, 28th March, 1885.\nSmith, Gabriel, until to-morrow evening, 30th March, 1885.\nSt. Dennis, Joseph, until to-morrow morning, 30th March, 1885.\nSwan, William, until to-morrow morning, 1st April, 1885.\nVandale, Modeste, until to-morrow morning, 30th March, 1885.\nVandale, Roger, until to-morrow evening, 30th March, 1885.\nVandale, Thomas, for two days, 30th March, 1885.\nVandale, Baptiste, to-morrow evening.\nVilleneuve, J., for two days, 30th March, 1885.\nVandale, Pierre, until 10 o'clock this evening, 1st April; 1885.\nVandale, Joseph, a standing permit, 2nd April, 1885.\n\nORDERS IN COUNCIL.\n\nNo. 1.\nIt is ordered that all horses be gathered together, without exception, and be sent to the guard, under the direction of Joseph Parentean.\n\nM. D., for Secretary.\n\n10th April, 1885.\n\nNo. 2.\nTo send for Daniel Dumas and all the animals that may be at his place, 11th April.\n\nPHILIP GARNOT, Secretary.\n\nP.S.—Except one brindled cow and one red cow.—Ph. G.\n\nNo. 3.\nProposed by Mr. Boucher, seconded by Mr. Dumont, that Mr. Chamberland be furnished with a list of our people who have decided to take their meals here, and who have the right of coming into the council chamber.\n\nPHILIP GARNOT, Secretary.\n\n11th April.\n\nNo. 4.\nMr. Ambroise Champagne, you are appointed, with Mr. Joseph Vandale, inspector of Guards, by Order in Council.\n\nPHILIP GARNOT, Secretary.\n\n11th April.\nNo. 5.\nProposed by Mr. G. Dumont, seconded by Mr. Trottier, that two or three men be sent to Fort la Corne to ascertain the feeling at that place. Adopted—9 for; 1 against.\n\nN.B.—When this Act was passed, it was understood that if Mr. Edouard Dumont desired to go to Fort la Corne, he was free to do so, with one or two men. Adopted—8 for; 2 against.\n\nBATOCHÉ, 11th April, 1885.\n\nNo. 6.\nProposed by Mr. Parenteau, seconded by Mr. Dumont, that the brown horse which was captured at Hoodoo by the soldiers of the provisional government be brought here and kept for the use of Mr. Riel and placed in the hands of Mr. Parenteau to take care of. Adopted unanimously.\n\n11th April, 1885.\n\nNo. 7.\nAn Order in Council is given to cross over twenty head of cattle to this side of the river.\n\nBy order of the Council.\n\nP. GARNOT, Secretary.\nA. MONKMAN, Esq.\n\nST ANTOINE, 16th April, 1885.\n\nNo. 8.\nAn Order in Council is given to Salomon Boucher, Modeste Rocheleau and François Vermette to go and hunt up men, arms and ammunition as far as the McIntosh farm and its neighborhood.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary of the Council.\n\nST. ANTOINE, 16th April, 1885.\n\nNo. 9.—To whom it may concern:\n\nGENTLEMEN,—You are requested to give all firearms and munitions that may happen to be in your possession to bearer and we will not leave you without protection.\n\nBy order of the council of the provisional government,\n\nP. GARNOT, Secretary.\n\nST. ANTOINE, 16th April, 1885.\n\nNo. 10.\nGiven to Maxime Fidlar, and addressed to Joseph Parenteau, to deliver to him his horse which is under guard on the other side of the river.\n\nM. DUMAS, Assistant Secretary.\n\n17th April, 1885.\n\nNo. 11.\nOrder of the Council is given to Alex. Fidler to enable him to get his horse order addressed to Joseph Parenteau.\n\nM. DUMAS, Assistant Secretary.\n\nNo. 12.\nFerry across two cows for the use of Mr. Nap. Nault.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary.\n\n17th April, 1885.\nNo. 13.\nAn Order in Council is given that a sack of flour be delivered to Mr. Trottier, for his family.\n\nSt. Anthony, 17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 14.\nAn Order of the Council is given to deliver up to Mr. Ph. Garnot, Secretary of said Council, three bags of flour which he had lent.\n\nSt. Anthony, 17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 15.\nAn Order in Council is given to Mr. Michel Dumas to ferry over a cow and bring it here for his own use.\n\n17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 16.\nAn Order in Council is given to Mr. Jim Short to ferry over two cows, and keep them here for his own use, until otherwise ordered.\n\n17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 17.\nAn Order in Council is given to Mr. John Desmarais to ferry over a cow and to keep it for the use of his family, until otherwise ordered.\n\n17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 18.\nAn Order in Council is given that two men be sent to hide all the small boats, and that they be brought here as soon as possible; and that the ferry boat of Mr. Lepine be taken to pieces and the parts concealed in three or four different places.\n\n17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 19.\nAn Order in Council is given to Mr. Arthur Amyot to take a cow and keep her for the use of his family, until otherwise ordered.\n\n17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 20.\nAn Order in Council is given to the effect that Nap. Parentean should have a cow ferried over, and keep it for the use of his family, until otherwise ordered.\n\nSt. Anthony, 17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 21.\nAn Order in Council is given to bring here Alex. McDougall, jr., Louison Fontaine and Isidore Bargin, without fail, as well as McLeod's mara, and the grain, &c., that they will find there.\n\nSt. Anthony, 17th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 22.\nAn Order in Council is passed to make six or eight oars for the ferry boat, and as many for the small boats.\n\n17th April, 1885.\n\nPH. GARNOT, Secretary.\nNo. 23.\nAn Order in Council is given to Mr. J. Bte. Fidler, to enable him to withdraw his horse from the guard on the other side of the river, in order to bring it to this side.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 18th April, 1885.\n\nNo. 24.\nAn Order in Council is given to Mr. Napoléon Nault, to ferry over the waggons which are on the other side of the river, in order to bring them here.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 18th April, 1885.\n\nNo. 25.\nAn Order in Council is passed to give a cow to Mr. Swan for use of his family, until further orders.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 18th April, 1885.\n\nNo. 26.\nTo Mr. John Ross, Animal Keeper.\nAn Order in Council is passed to give a milch cow, if there is one, to the bearer, a Cree Indian.\n\nBy order of the Council\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 18th April, 1885.\n\nNo. 27.\nAn Order in Council is given to Capt. Edouard Dumont to make ready to go en reconnaissance up the river to watch General Middleton, and that he is to have command of the expedition. This order is to be read to the inspector of guards and given to E. Dumont.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 20th April, 1885.\n\nNo. 28.\nAn Order in Council is given to Mr. Jobin, with another man, to go to Mr. Bremner's for the horses belonging to the young men who have left, and others.\n\nBy order of the Council\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 20th April, 1885.\n\nNo. 29.\nAn Order in Council is given to the proper persons to haul in all the hay there may be between this place and that of Leonore Parenteau. And an order is also given to the young men that may be in the houses to haul in all the hay to be found further on.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 21st April, 1885.\n\nNo. 30.\nAn Order in Council is passed to deliver one cow to James Welsh for the use of his family, until otherwise ordered.\n\nPH. GARNOT, Secretary.\n\nTo Mr. John Ross, keeper of the animals.\n\nSt. Anthony, 23rd April, 1885.\n\nNo. 31.\nAn Order in Council is passed to lend a good horse to Mr. Alex. Cayen, in order that he may go and look for his people at Lake Muskeg.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 27th April, 1885.\nNo. 32.\nAn Order in Council is passed to lend an additional horse to Mr. Alex. Cayen, to go to Muskeg Lake.\n\nSt. Anthony, 27th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 33.\nAn Order in Council is passed to ferry over five head of cattle to be slaughtered.\n\nSt. Anthony, 27th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 34.\nAn Order in Council is given to Mr. Nap. Carrière to take possession of his tent wherever he may happen to find it, seeing that he has never sold or lent it.\n\nSt. Anthony, 28th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 35.\nAn Order in Council is passed giving Mr. Alex. Arcand the right to appeal under No. 34 of the council passed yesterday, when he has sufficient proof.\n\nSt. Anthony, 29th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 36.\nAn Order in Council is given to Mr. Alex. Fisher not to make a crossing in the ferry boat with less than eight persons in the boat.\n\nSt. Anthony, 30th April, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 37.\nSir,—Please deliver to the bearer seven bags of flour, belonging to Bte. Boyer.\n\nBy order of the Council:\n\nTo Mr. C. Fagnant.\n\nSt. Anthony, 1st March, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 38.\nAn Order in Council is given to Mr. Patrice Tourond, to deliver to Mr. Pierre Paranteau a pair of breechings, in compensation for those which the mail carriers took away from him. Give him the breechings which were taken from the mail at Hoodoo.\n\nSt. Anthony, 1st May, 1885.\n\nPH. GARNOT, Secretary.\n\nNo. 39.\nAn Order in Council is passed authorizing the families living down the river to kill a young animal of one or two years of age, and to divide it among them; and to take the animal out of those belonging to the people who fled the country.\n\nSt. Anthony, 3rd May, 1885.\n\nPH. GARNOT, Secretary of the Council.\n\nNo. 40.\nAn Order in Council is given to go and look for all the animals that there may be down the river, especially cows, and all the animals of those who have fled the country.\n\nSt. Anthony, 3rd May, 1885.\n\nPH. GARNOT, Secretary of the Council.\nNo. 41.\nPlease give the keys of the storehouse and shed to Mr. Damase Carrière to get some tea, salt and sugar, if there is any.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary.\n\nTo Madame Letendre.\nSt. Anthony, 3rd May, 1885.\n\nNo. 42.\nAn Order in Council is given to Mr. Damase Carrière to take from the store of Mr. Champagne one box of tea.\n\nBy order.\n\nPHIL. GARNOT, Secretary.\n\nSt. Anthony, 3rd May, 1885.\n\nNo. 43.\nAn Order in Council is given to bring F. St. Germain here to stay.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 3rd May, 1885.\n\nNo. 44.\nNames of persons to be looked up, by Order of the Council:—André Nolin, Jérôme Racette, Alex. Begu, Frederick St. Germain, Alex. Pilon, the oldest boy of Pierre Henry, Barthélémy Pilon, Patrice Parentean, Joseph Delorme, Alexis Gervais, François Gervais, Cléophas Champagne, Amb. Gareiçpy, Nazaire Champagne, Jas. Pilon, jr., Emmanuel Champagne.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 4th May, 1885.\n\nNo. 45.\nAn Order in Council is given to bring in the horses belonging to Mr. Emmanuel Champagne, and which are at his place, as well as those belonging to his son or other people.\n\nBy order.\n\nPH. GARNOT, Secretary.\n\nSt. Anthony, 5th May, 1885.\n\nNo. 46.\nSir,—Please deliver to the bearer six bags of flour belonging to Mr. Bte. Boyer.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary.\n\nTo Mr. Cuthbert Fagnant.\nSt. Anthony, 5th May, 1885.\n\nNo. 47.\nAn Order in Council is given to send three men below to bring in Wm. Bruce and his mare, and if he is not there then the mare of George Fidler, and to make a reconnaissance at the same time.\n\nPH. GARNOT, Secretary.\n\nBring along and look after André Jobin, Jérôme Racette, and Alexandre Boyer.\n\n—P. H. G.\nSt. Anthony, 5th May, 1885.\n\nNo. 48.\nSir,—Please deliver to the bearer the remainder of the flour belonging to Mr. Bte. Boyer.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary.\n\nTo Mr. Cuthbert Fagnant.\nSt. Anthony, 7th May, 1885.\nLETTERS.\n\nNo. 1.\nSir,—Your instructions are that you must take great care of the horses, and that the best horses be carefully spared, and that the mares with colt are not to be used at all; and that the young people are not to be free to do what they please with the horses. You are the master. And that no horse be given without an order from the council, or the inspector of the guard, but when an alarm is given then an order is not necessary.\n\nM. D., for the Secretary.\n\nMr. Joseph Parenteau.\n10th April, 1885.\n\nNo. 2.\nRev. Father Végeville,—The Council of the Provisional Government begs you to consider the interests of the French Canadian Metis with a more favorable eye; this you can do by declaring in writing that you will keep yourself at least perfectly neutral; that you will not withdraw from this place without the consent of the Provisional Government.\n\nGive in writing your word of honor that you will act in this way towards us; if you do not we will be compelled to treat you accordingly.\n\nPH. Garnot, Secretary of the Council.\n\nBatoche, 10th April, 1885.\n\nNo. 3.\nMy Very Dear Father Fourmand,—I send a courier in your direction to carry to you the terrible news of the death of Fathers Faïard and Marchand, who were killed by the Indians at Frog Lake.\n\nYou will apply in their case the prayers required by our rules. The Indians have risen in every direction and are massacring the whites. Eleven persons were killed around Frog Lake. It is a war of extermination which has begun and it is our Metis who have caused this trouble, and who bear the responsibility of all the blood that has been and will be shed.\n\nMy dear father, we must save the sisters from the fate which threatens them, and find means to send them to Prince Albert. I am ignorant how you are situated, but things have an extremely dangerous look; but you seem to fear nothing, and rest in perfect serenity.\n\nConsider, then, if there is any danger in making the sisters leave for Prince Albert, and see if you cannot find some willing men to escort them as far as the forks of the road which comes from Carlton. They have nothing to fear on the part of the people of Prince Albert, who never go there except to cut hay. It is the Indians whom I dread.\n\nPrince Albert, 12th April, 1885.\n\nNo. 3.\nDear Brother,—The exovedes in meeting decided that two or three men should be sent to Carlton, but they agree that you should not go yourself, they are of opinion that your presence here is necessary, although they are sure that you would be the best to go to Carlton. They really expect an attack at a very short period, and they know that your ability here will be of great necessity.\n\nScouts have been seen twice today already. We would also beg of you to keep a very close and good guard, because there might be danger on your side of the river. Sending you our best wishes, we remain your brother.\n\nFor the council,\n\nPH. Garnot, Secretary.\n\nTo Exovede Albert Monkman.\nSt. Anthony, 16th April, 1885.\nNo. 4.\n\nSir,—You are requested to attend the Council meeting to-morrow, as we have urgent need of you and of all the absent members of the Council.\n\nYour very devoted,\n\nPH. GARNOT, Secretary.\n\nTo Mr. AMB. JOBIN.\n\nST. ANTHONY, 16th April, 1885.\n\nNo. 5.\n\nSir,—Please take notice, that from this date, each evening you will give notice upon which side of the river you remain with the ferry boat, in order that guards may be placed in order to guard the cable and the boat.\n\nBy order of the Council.\n\nPH. GARNOT, Secretary.\n\nTo Mr. ALEX. FISHER.\n\nST. ANTHONY, 17th April, 1885.\n\nNo. 6.\n\nSir,—I give you notice that each crossing ticket (return ticket) should be sent every evening to the secretary or his assistant.\n\nYour devotedly,\n\nPHIL. GARNOT, Secretary,\n\nBy Oct. REGNIER, Assistant.\n\nMr. ALEX. FISHER.\n\nST. ANTHONY, 18th April, 1886.\n\nNo. 7.\n\nWe have received and considered yours concerning the friendly and generous offer of Chesorpen. We thank our relative, the old soldier, for his offer of good services. The Exovidate are of opinion that Middleton and his troops ought not to be treated as ordinary. It would be better to watch well their moves, to let them come when they please,—under the Almighty hand of Divine Providence—and when they are near enough to strike and work until, with God's and Christ's help, we have conquered them. A complete success over Middleton we have to ask from our Lady the Blessed Virgin Mary, and let us aim at such a decisive success—and considering the situation, we believe that it would be of great usefulness to send a party of découveurs to-night to watch the movement of Middleton, to-morrow morning, and during the whole day from your side of the river.\n\nProposed by Mr. Ross, seconded by Mr. Lepine, that a vote of thanks be voted to Mr. Monkman, for the creditable way in which he conducted himself in the command which he has across the river.\n\nPresent:—Messrs Tourond, Jobin, Trottier, Henry, Carrière, Boucher, Ross and Lepine.\n\nPH. GARNOT, Secretary.\n\nTo Mr. MONKMAN.\n\nST. ANTHONY, 19th April, 1885.\n\nNo. 8.\n\nReverend Fathers,—You are invited to come here, at nine o'clock in the morning, for the reasons given in the resolutions of which I send you a copy.\n\nA copy of the resolution of the 30th April is enclosed.\n\nYour very humble servant,\n\nPH. GARNOT, Secretary of the Council.\n\nTo the Reverend Fathers FOURMAND, MOULIN and VÉGÈREVILLE.\n\nST. ANTHONY, 30th April, 1885.\nNo. 9.\n\nSir,—Be so good as to tell your men, and take notice that every crossing ticket must be given up to the secretary, or to his assistant, because for a long time it is remarked that no tickets come here, and of 600 tickets we have received, but barely 100.\n\nDon't concern yourself about the distribution of tickets; but see that all the tickets are sent here every evening, and if the people of the other side of the river require tickets, they must ask for them.\n\nYours, &c.,\n\nPH. GARNOT, Secretary.\n\nTo Mr. Alex. P. Fisher,\nSt. Anthony, 4th May, 1885.\n\nNo. 10.\n\nSir,—Be so good as to see that Thomas Petit takes his meals and board with you, and we will board Parenteau on this side.\n\nBy order of the council,\n\nPH. GARNOT, Secretary.\n\nTo Mr. N. Nault,\nSt. Anthony, 5th May, 1885.\n\nMINUTES OF THE COUNCIL (BOOK).\n\nPrayer of the Council.\n\nO Lord, our God, Thou who art the Father of mercy and consolation, we are several French Canadian Métis, gathered together in council, who put our confidence in Thee; grant that we may not be covered with confusion, ever defend us from this, enlighten us in our darkness of doubt, encourage us in our trials, strengthen us in our weakness, and succour us in the time of pressing need.\n\nMinutes of the Council of the 30th March, 1885.\n\nExplanations are requested by Mr. Lepine in Council, asking Mr. Jobin for explanations why he gave up the position of assistant commissioner of the Provisional Government.\n\nBy Mr. Jobin..................\n\nProposed by Mr. Monkman, seconded by Mr. Boucher, that we move off to Carlton, and that this motion be kept secret until a decision has been arrived at to go to Prince Albert or elsewhere. Adopted—9 for, 1 against.\n\nProposed by Mr. Dumont, seconded by Mr. Boucher, that men be sent to examine the house of Ambroise Fisher, Magnus Barton, and François Piché, and to see if anything has been hauled away, either provisions or merchandise, &c., and to seize and bring here all suspected articles found in the house. Carried unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Jobin, that a detachment of fifty men be sent to Carlton to take possession of the fort, and that Mr. Monkman with another member of the Council be entrusted to carry out this expedition. Carried unanimously.\n\nProposed by Mr. Ouellette, seconded by Mr. Henry, that Mr. Ouellette should go with Mr. Grant or Mr. Dumas to accompany the expedition to Carlton. Carried unanimously.\n\nProposed by Mr. J. Bte. Boucher, seconded by Mr. Pierre Parenteau, that a man be sent to the other side of the South Branch of the Saskatchewan, and that he should carry provisions with him for the families, with the consent of Mr. Champagne. Carried unanimously.\n\nMinutes of the Council of the 31st March, 1885.\n\nProposed by Exovede Gabriel Dumont, seconded by Exovede Maxime Lepine, that we abandon for a time Duck Lake, and go and take up our position again at St.\nAnthony, to await there firmly the 315 policemen who are on the way, it would appear, and are marching against us. Adopted unanimously. Glory to Jesus Christ, honor and praise to Mary, to Joseph, to St. John the Baptist and to St. Anthony of Padua.\n\nMinutes of the Council of the 6th April, 1885.\n\nProposed by Mr. Lepine, seconded by Mr. Boucher, that the soldiers begin the work of making roads through the ice, and placing the ferry boat in position to establish the ferry. Adopted unanimously.\n\nProposed by Mr. Boncher, seconded by Mr. Parentean, that an Order in Council be publicly read requiring every man capable of bearing arms to be present here tomorrow during the forenoon. Adopted unanimously.\n\nProposed by Mr. Ouellette, seconded by Mr. Lepine, that a horse guard be organized, and that a captain, with his company, be appointed to this duty, and that Mr. Antoine Lafontaine be appointed. Adopted unanimously.\n\nProposed by Mr. Lepine, that Mr. Lafontaine's soldiers be chosen by the Council, in agreement with Mr. Lafontaine. Decided without being put to the Council.\n\nProposed by Mr. Lepine, seconded by Mr. Carrière, that no person have permission to see the prisoners without an order from the Council; and that the guard be notified to that effect; and that the friends of the prisoners be also notified to the like effect. Adopted unanimously.\n\nProposed by Mr. Ouellette, seconded by Mr. Delorme, that Mr. Joseph Parentean be appointed as captain of the horse guard on the other side of the river, and that Mr. Barbeau (Bte. Hunter) act as sergeant. Adopted unanimously.\n\nProposed by Mr. Delorme, seconded by Mr. Henry, that Mr. Regnier be set to work teaching school, and that the church be placed at his disposal as a schoolhouse, if thought necessary. Adopted unanimously.\n\nProposed by Mr. Jobin, seconded by Mr. Parentean, that some person be sent to Father Paquet to ask him to come to us. Adopted unanimously.\n\nProposed by Mr. Carrière, seconded by Mr. Jobin, that it be ascertained what the people who have just arrived have need of, and that an order be sent them on the store of Mr. Batoche to furnish what they require. Adopted unanimously.\n\nProposed by Mr. Jobin, seconded by Mr. Ouellette, that Mr. Charles Trottier be admitted a member of the Exovidat. Adopted unanimously.\n\nOrder in Council of the 7th April, 1885.\n\nProposed by Mr. Carrière, seconded by Mr. Lepine, that Alexander Fisher do place the keys of George Fisher's store in the hands of the Council. Carried unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Lepine, that Alexander Fisher be permitted to keep the ferry for the season, for eighty dollars per month, to be paid by the Council of the Provisional Government. Adopted unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Boucher, that Daniel Dumas be brought before the Council in order to give explanations as to a complaint lodged against him with the Council by John Desmaraux. Carried unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Ross, that the keys of Fisher's store be placed in the hands of Mr. Riel. Adopted unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Ross, that Mr. Zipher be allowed to take a portion of his house, and to occupy it with two men, who have been furnished him to work the ferry. Adopted unanimously (but afterwards scored out).\n\nProposed by Mr. Boucher, seconded by Mr. Ross, that the Provisional Government having had need of the house of Mr. Fisher and having occupied it up to this day, from this day forward leave one apartment free, which Mr. Fisher wants. Carried unanimously.\nOrder in Council, 6th April, 1885.\n\nProposed by Mr. Lepine, seconded by Mr. Ouellette, that two men be sent to Thunder Mountain and Qu'Appelle Lake, in order to make the people acquainted with the position of affairs here. Adopted unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Delorme, that two men be sent to Fort Battle, and, if it is possible to do so, destroy Fort Battle, seize the stores and munitions, and bring the forces and animals here. Carried unanimously.\n\nProposed by Mr. Parenteau, seconded by Mr. Charles Trottier, that Mr. Emmanuel Champagne be sent to Pembina with two men, as a messenger from the Provisional Government, with instructions which he will receive from the Council. Carried unanimously.\n\nProposed by Mr. Carrière, seconded by Mr. Dumont, that Mr. Dumas be sent into Montana to carry messages, and that he be accompanied by two or three men. Adopted unanimously.\n\nProposed by Mr. Ross, seconded by Mr. David Tourond, that scouts be sent to Prince Albert to destroy the steamboats if possible, and bring back news to the Council. Adopted unanimously.\n\nProposed by Mr. Carrière, seconded by Mr. Tourond, that the Provisional Government authorize the seizure of the goods in Mr. Batoche's store, keeping an account of the whole, and that the keys be handed to Mr. Riel. Carried unanimously.\n\nOrder in Council.\n\nProposed by Mr. Boucher, seconded by Mr. Parenteau, that the mortgage existing between Charles Nolin and Maxime Lepine be brought before the Council and examined as soon as possible. Proposal accepted. (Scored out.)\n\nProposed by Mr. Lepine, seconded by Mr. Parenteau, that Isidore Dumas be allowed to take a double sleigh, in return for the sleigh which was broken by the workmen of the Provisional Government. Adopted unanimously.\n\nIsidore Dumas claims from Kerr & Brothers for the following articles:\n\n| Item                  | Quantity | Price   | Total   |\n|-----------------------|----------|---------|---------|\n| 30 barrels of barley  |          | $1.25   | $37.50  |\n| 15 do of wheat        |          | $1.50   | $22.50  |\n| Amount due for a horse|          |         | $20.10  |\n\nTotal .................................................. $80.10\n\nIsidore Dumas heard before the Council.\n\nProposed by Mr. Lepine, seconded by Mr. Ross, that Isidore Dumas be paid out of the property which Kerr & Brothers have left behind; and that payment take place so soon as the animals and the other goods are collected. Adopted unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Parenteau, that it be two Indians who should go to Fort Battle; and that there be raised no objection to a Metis accompanying the two Indians. Adopted unanimously.\n\nIt is decided that two other Indians should go to Thunder Hills, to Lake Qu'Appelle, Hook Lake, Nut Lake and Long Lake.\n\nOrder in Council of the 8th April, 1885.\n\nProposed by Mr. Boucher, seconded by Mr. Delorme, that Mr. Pierre Parenteau be appointed to look for suitable horses to make the journey to Montana, with power to make the purchase as to him seems best. Adopted unanimously.\n\nEvening Sitting.\n\nAn Order in Council is passed to bring up the mare of Kerr and Brother, and the young Canons.\n\nMr. Canon objects for the reason that he had the mare to keep for the winter at $6 per month, and that he has had it for two months.\nProposed by Mr. Carrière, seconded by Mr. Monkman, that Mr. Canon should give a fat horse for the mare, and that he bring them here this evening. Carried unanimously.\n\nMinutes of the Exovidat, 9th April, 1885.\n\nA letter from Mr. Jackson asking to be set at liberty, with his brother, is handed to Mr. Riel. Mr. Riel explains that Mr. Jackson is too neutral to be allowed to go. By this he meant that Jackson should be kept.\n\nOrder in Council, 10th April, 1885.\n\nProposed by Mr. Boucher, seconded by Mr. Trottier, that the horses of George Fisher, which are under the care of Siniskisick, be brought before the Council. Adopted unanimously.\n\nProposed by Mr. Trottier, seconded by Mr. Boucher, that Madame Ambroise Fisher be sent for, and all her goods, animals and horses. Adopted unanimously.\n\nFather Végreville having been arrested, appears before the Council.\n\nProposed by Mr. Boucher, seconded by Mr. Lepine, that Mr. Joseph Vandale be authorised to bring J. Villeneuve and Ant. Vandale, jr., before the Council; and that an order do issue to that effect. Adopted unanimously.\n\nIt is decided that the chief White Bonnet be a member of the Exovidat.\n\nProposed by Mr. Boucher, seconded by Mr. Trottier, that a letter be sent to the Rev. Father Végreville, asking him to give his word of honor that he will not leave the place, and that he will do nothing against our party, and that he will keep perfectly neutral. Adopted unanimously.\n\nProposed by Mr. Tourond, seconded by Mr. Carrière, That if any person should capture a horse during a fight the horse shall belong to him, on condition that he leave it for the use of those engaged in the movement until the movement is over. Adopted unanimously.\n\nOrder in Council, 11th April, 1885.\n\nProposed by Mr. Boucher, seconded by Mr. Damont, that Mr. Chamberland be furnished with a list of our people who have the right of taking their meals here and of entering the council hall.\n\nOrder No. 5.\n\nProposed by Mr. G. Damont, seconded by Mr. Trottier, That two or three men be sent to Fort la Corne to ascertain the feeling of the people in that place. Adopted. —9 for; 1 against.\n\nN.B.—When this Act was passed it was understood that if Mr. Damont wished to go there he was free to do so, with one or two men (to Fort la Corne). Adopted —8 for; 2 against.\n\nM. DUMAS, U.S.L., &c.\n\nProposed by Mr. Parenteau, seconded by Mr. Dumas, that the brown horse which was captured at Hoodoo by the soldiers of the Provisional Government be brought here and kept for the use of Mr. Riel, and put into the hands of Mr. Parenteau to take care of. Adopted unanimously.\n\nMinutes of the Council, 13th April, 1885.\n\nFather Fourmand asked, through the intervention of Father Moulin, whether he could have his flour.\n\nProposed by Mr. Lepine, seconded by Mr. Boucher, that Mr. Gabriel Dumont be the only member of the Council having the exclusive privilege of issuing passes. Adopted unanimously.\n\nInformation was received from Mr. Elite-Landry respecting the brothers and the wife of Charles Nolin.\n\nProposed by Mr. Lepine, seconded by Mr. Ouellette, that a captain be sent to notify Father Moulin that his church will be taken for a school house until otherwise ordered. One against, five for.\nProposed by Mr. Tourond, seconded by Mr. Ross, that a filly, two years old, belonging to the Provisional Government be given to Mr. Joshua Bre'and in payment of a debt due by Kerr & Brothers. Adopted unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Carrière, that the passes each day be limited to twelve, that is to say six to go up the river and six to go below. Seven for, one against.\n\nMorning Session—Order in Council, 14th April, 1885.\n\nProposed by Mr. Carrière, seconded by Mr. Trottier, that fifteen head of cattle be ferried over and brought here for the use of the Provisional Government. Carried unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Henry, that Daniel Charette do accompany Father Végreville to see a sick person on the other side of the river, the wife of Joseph Charette. Carried unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Ross, that Pierre ———— be appointed to negotiate the exchange of animals and the purchase of animals for the slaughter house for the Provisional Government, as to him seems best. Adopted by the majority of the Council, 15th April, 1885.\n\nProposed by Mr. Boucher, seconded by Mr. Carrière, that Pierre Tourond be authorized to take the animal that is at Boniface Leforce's, belonging to Kerr Brothers, and to kill it for the use of the families whose names are mentioned in letter No. 4. Adopted unanimously.\n\nMorning Session, 13th April, 1885.\n\nProposed by Mr. Dumont, seconded by Mr. Lepine, that Louis Parentean and Thomas Petit be paid $30 per month, to work at harness-making, under the direction of Mr. Alex. Fisher, and he be paid at the end of every month. Carried unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Ouellette, that Mr. Phillip Garnot be requested, if he is willing, to go to St. Laurent, to establish guards there for the protection of the Rev. Fathers and the Sisters, and that the guards be so maintained until further orders. Carried unanimously.\n\nMorning Session, 10 a.m., 16th April, 1885.\n\nPresent:—Bte. Boucher, Moise Ouellette, Pierre Henry, Charles Trottier, Donald Ross, White Cap, Pierre Parentean.\n\nProposed by Mr. Boucher, seconded by Mr. Lepine, that ten full-grown head of cattle be distributed among the families on this side of the river. Carried unanimously.\n\nProposed by Mr. Trottier, seconded by Mr. Boucher, that two head of cattle be given to the Sioux, for the use of their families, and one to the Cree, for the use of their families. Carried unanimously.\n\nPromise of Neutrality.\n\nI promise to hold myself perfectly neutral, and not to withdraw from here without the consent of the Provisional Government. I will give my word that I will keep myself perfectly neutral and that I will do nothing contrary to the movement of the French Canadian Métis.\n\nN. TOUZÉ, Pt., O.M.I.\n\nSt. Antoine de Padoue, 15th April, 1885.—1 p.m.\n\nPresent:—Bte. Boucher, Moise Ouellette, Pierre Henry, Donald Ross, Pierre Parentean, David Tourond, Charles Trottier, M. Lepine.\n\nProposed by Mr. Boucher, seconded by Pierre Henry, that the three men sent to look up the absent soldiers go as far as the house of McIntosh and the neighborhood, to bring back the arms and munitions which may be found there. Carried unanimously.\nMinutes of the Morning Session, 17th April, 1885.—11 a.m.\n\nPresent:—Bte. Boucher, M. Ouellette, C. Trottier, P. Parenteau, D. Tourond, White Cap, D. Carrière, D. Ross.\n\nProposed by Bte. Boucher, seconded by D. Carrière, that the ten bags of flour that are in the cellar of Bte. Boyer's house be kept for the use of the Provisional Government. Carried unanimously.\n\nAfternoon Session.—2.30 p.m.\n\nPresent:—M. Trottier, Bte. Parenteau, A. Jobin, M. Lepine, D. Ross, D. Tourond, White Cap, M. Ouellette, P. Henry, Bte. Boucher, D. Carrière.\n\nProposed by Mr. Trottier, seconded by Mr. Tourond, that a letter be given to the ferrymen in order that they may give notice on the two sides of the river stating where the ferry is in order, that we may so place the guards as to assure the safety of the ferry by day and night, and that a man receive orders to make four pairs of cars in case anything happens to the cable, and that men be also sent to bring up all boats, and that the ferry-boat of Mr. Lepine be also taken to pieces and concealed, in order that no use may be made of it, and to bring away the cars that are there. Adopted unanimously.\n\nAfternoon Session.—2.50 p.m.\n\nPresent:—Jobin, Carrière, Lepine, Ross, Ouellette, Henry, Tourond, White Cap, Trottier, Boucher.\n\nProposed by Mr. Boucher, seconded by Mr. Carrière, that cows be loaned to the families, in order that they may have the benefit of the milk, until such time as the council may have need of them, and that application for cows be made to the Council. Carried—Seven for; three against.\n\nMinutes of the Evening Session, 17th April, 1885—2.45 p.m.\n\nPresent:—Ouellette, Ross, Henry, Lepine, Carrière, Jobin, Parenteau, Boucher, Tourond, White Cap, Trottier.\n\nProposed by Mr. Jobin, seconded by Mr. Boucher, that every person who is concerned in the movement do take an oath to be faithful to the movement and to the laws of the Provisional Government of the Saskatchewan. The oath to be taken to be according to the following form. Eight for, two do not vote.\n\nAfternoon Session.—3 p.m.\n\nPresent:—White Cap, Trottier, Boucher, Tourond, Parenteau, Ouellette, Jobin, Lepine and Henry.\n\nProposed by Mr. Lepine, seconded by Mr. Jobin, that a bail be loaned and placed in the hands of Mr. Joseph Pilon, for the use of the farms in the neighborhood. Carried unanimously.\n\nEvening Session, 8 p.m., 17th April, 1885.\n\nPresent:—Charles Trottier, M. Lepine, Baptiste Boucher, M. Ouellette, D. Ross, P. Parenteau, G. Dumont, D. Tourond, Amb. Jobin, D. Carrière.\n\nProposed by Mr. Lepine, seconded by Mr. Trottier, that an expedition of thirty armed men be sent to Fort la Corne, commencing preparations to-morrow (18th April), having at their disposal forty-five carts, well harnessed, to carry Messrs. Turner, Batoche, and Seine, with all their goods and effects, as well as the goods and merchandise of any other person whomsoever, and to set adrift every boat serving as a ferry and which might endanger the safety of the Provisional Government. Adopted unanimously.\n\nMorning Sitting—18th April, 1885.\n\nPrayers, and then some routine orders.\nEvening Session, 8.20 p.m.—19th April, 1885.\n\nPresent:—Tournond, Jobin, Trottier, Henry, Carrière, Boucher, Ross, Lepine.\n\nProposed by Mr. Ross, seconded by Mr. Lepine, that a vote of thanks be passed to Mr. Monkman, for the manner in which he has conducted his command on the other side of the river. Carried unanimously.\n\n20th April, 1885—Afternoon Session.\n\nPresent:—A. Jobin, M. Lepine, D. Carrière, P. Henry, G. Dumont, D. Tournond, C. Trottier, D. Ross, Bte. Boucher.\n\nProposed by Mr. Boucher, seconded by Mr. Henry, that three men be sent to the upper part of the river, in order to protect the families.\n\nProposed in amendment by Mr. Tournond, seconded by Mr. Lepine, that there be four men instead of three. Amendment carried—5 for; 4 against.\n\nPresent:—Messrs. Jobin, Lepine, Carrière, Henry, Dumont, Tournond, Trottier, Ross and Boucher.\n\nProposed by Mr. Dumont, seconded by Mr. Boucher, that twenty men be sent to reconnoitre on the upper part of the river, to watch General Middleton, and that Mr. Edouard Dumont have charge of the expedition. Carried unanimously.\n\nContinuation of the Afternoon Meeting of the 20th April, 1885.\n\nPresent:—Bte. Boucher, D. Ross, C. Trottier, G. Dumont, P. Henry, D. Carrière, D. Tournond, M. Lepine, A. Jobin.\n\nExamination of the complaint of the guards of St. Laurent against Father Fourmand.\n\nProposed by Mr. Boucher, seconded by Mr. Trottier, that Rev. Father Fourmand, and everybody at his mission of St. Laurent, be brought to the mission of St. Antoine to live there (with their property). Carried unanimously.\n\nEvening Session.\n\nPresent:—D. Ross, C. Trottier, P. Henry, G. Dumont, M. Ouellette, B. Boucher, A. Jobin, D. Carrière, M. Lepine, E. Champagne.\n\nFather Fourmand arrived and was examined.\n\nProposed by Mr. Boucher, seconded by Mr. Henry, that Mr. Jobin be sent, with one man, to look for the horses at Mr. Bremner's belonging to the young men who had left (one from Mr. Jobin and two from Mr. Bremner). Adopted unanimously.\n\nAfternoon Sitting—21st April, 1885.\n\nPresent:—D. Ross, C. Trottier, P. Henry, G. Dumont, M. Ouellette, A. Jobin, D. Tournond, M. Lepine and P. Parentean.\n\nProposed by Mr. Dumont, seconded by Mr. Jobin, that all the hay at Jos. Pilon's house be carted here, and that an order be given to him to get the hay further on hauled in by his boys. Carried unanimously.\n\nPresent:—P. Parentean, A. Jobin, D. Tournond, M. Ouellette, D. Ross.\n\nProposed by Mr. Parentean, seconded by Mr. Jobin, that Mr. Riel and the members of the Council be authorized to cross the river without passes when they ask to do so. Carried unanimously.\n\nAfternoon Session—22nd April, 1885.\n\nPresent:—Lepine, Jobin, Dumont, Henry, Parentean, Ouellette, Trottier.\n\nProposed by Mr. Dumont, seconded by Mr. Carrière, that the resolutions respecting the captains, as submitted by Mr. Riel, be accepted: Carried unanimously.\n\nPresent:—Tournond, Lepine, Jobin, Dumont, Henry, Parentean, Ouellette, Trottier.\n\nProposed by Mr. D. Carrière, seconded by Mr. Lepine, that a vote of thanks be passed to Mr. Carrière and Mr. Henry; and that they be permitted to visit their families and to report as to their wants. Carried unanimously.\nPresent:—Dumont, Trottier, Ross, Lepine, Jobin, Henry, Parenteau, Ouellette.\n\nProposed by Mr. Dumont, seconded by Mr. Jobin, that a good horse be given as a present to our brother Wechawecopewin, in recognition of the courageous, honorable and Christian conduct he showed in the reconnaissance at Clarke's Crossing. Carried unanimously.\n\nPresent:—Dumont, Trottier, Jobin, Ross, Lepine, Henry, Parenteau, Ouellette.\n\nProposed by Mr. Jobin, seconded by Mr. Trottier, that a vote of thanks be passed to our relative Yellow Blanket, Mr. Malaterre, and Mr. Parisien, in recognition of their services rendered in the reconnaissance at Clarke's Crossing; and because they performed all the work they were sent to do. Carried unanimously.\n\nEvening Session, 10 p.m., 22nd April.\n\nPresent:—Dumont, Jobin, Lepine, Ouellette, Ross, Parenteau, Henry.\n\nProposed by Mr. Jobin, seconded by Mr. Henry, that fifty cavalrymen under the command of a man of their choice be sent to Clarke's Crossing en reconnaissance. Adopted unanimously.\n\nThe 23rd was the day of the alarm and the 24th the day of the great battle of Tourond's Ravine.\n\nAfternoon Session, 2 p.m.\n\nMr. Riel thanks the members of the Exovidat for the zeal and courage they displayed yesterday.\n\nPresent:—Mr. Ross, Ouellette, P. Tourond, Lepine, Boucher, P. Parenteau, C. Parenteau, Trottier, Jobin, Carrière.\n\nProposed by Mr. Boucher, seconded by Mr. Lepine, that a vote of condolence and of sympathy be passed to all our brothers in Jesus Christ who have had the misfortune to have some one of their relatives killed or wounded in yesterday's fight, particularly Mr. Vermette, who has had the misfortune to lose his brother, but more particularly Mr. J. Bte. Parenteau, who has had the grief to lose his son, and who had also another of his sons wounded in the preceding fight. Adopted unanimously.\n\nEvening Session, 29th April, 1885.—8 p.m.\n\nPresent:—Bte. Boucher, M. Jobin, D. Carrière, Chas. Trottier, P. Henry, D. Tourond, M. Ouellette, D. Ross.\n\nProposed by Mr. David Tourond, seconded by Mr. Damase Carrière, that no crossing be made by the ferry boat unless eight persons cross at one time. Adopted unanimously.\n\nSession of the 30th April, 1885.\n\nProposed by Mr. Jobin, seconded by Mr. Dumont, That a letter of invitation be sent to the Reverend Fathers Moulin, Végreville and Fourmand, asking them if they will kindly come and publicly set forth their reasons on the subject of the reform that Mr. Riel has undertaken with the Exovidat of the French Canadian Métis in the matter of religion, to-morrow, at 9 a.m. Carried unanimously.\n\nPresent:—Henry, Dumont, Ouellette, Tourond, Trottier, Boucher, Jobin, Ross.\n\nReceived one Alex. Parentean, who came from Battle River, about 8 p.m.; 9 p.m. received a delegation from Battle River, composed of four men.\n\nMorning Session of the 1st May, 1885.\n\nThe reverend fathers arrived at 9 o'clock, in accordance with the letter of yesterday, asking them to do so.\n\nAfternoon Session.\n\nPresent:—Parentean, D. Ross, D. Tourond, A. Jobin, D. Carrière, J. P. Parentean, Chs. Trottier, M. Ouellette, G. Dumont.\n\nProposed by Mr. M. Lepine, seconded by Mr. Amb. Jobin, that seven men do accompany the three commissioners, who have come from Fort Battle, to wit:—\nIsidore Parenteau, Joseph Arcand, Alex. Cayen, Moïse Carrière, Pierre Vandale, Charles Trottier, and John L. Crow, who are to leave this evening. Carried unanimously.\n\nContinuation of the Afternoon Session.\n\nPresent:—Pierre Parenteau, M. Lépine, D. Ross, D. Tourond, A. Jobin, D. Carrière, J. B. Parenteau, Char. Trottier, M. Ouellette, G. Dumont.\n\nProposed by Mr. Bte. Boucher, seconded by Mr. M. Lepine, that Mr. Joseph Jobin be admitted a member of the Exovidat. Carried unanimously.\n\nAfternoon Session of the 3rd May—2 p.m.\n\nPresent:—Lepine, Carrière, Dumont, Boucher, Parenteau, Ross, Ouellette, Tourond.\n\nProposed by Mr. Gabriel Dumont, seconded by Mr. Damase Carrière, that the people of Lake Qu'Appelle, Flamand and Bresland, be kept here, and be not allowed to go away until the passing of a new Order in Council. For, 6, viz.: Lépine, Carrière, Dumont, Boucher, Parenteau, Ross. Against, 2, Ouellette, Tourond.\n\nSession of the 4th May—10 a.m.\n\nPresent:—Carrière, Parenteau, P. Ouellette, White Cap, P. Parenteau, Boucher, Ross, Lepine, Dumont.\n\nProposed by Mr. Parenteau, seconded by Mr. Boucher, that it is expressly forbidden to anyone to work at farming, except in the gardens, where the women alone will work. It is also ordered that everyone shall come here without distinction. Carried unanimously.\n\nA Sioux has arrived, and has made a report that is not believed, and it was decided by the Sioux themselves to keep him in confinement until he tells the truth.\n\nSession of the 5th May, 1885.\n\nOrders of the Day:—An expedition of cavalry, commanded by Mr. L. D. Riel, covering a distance of ten or twelve miles, bringing in several stray horses, without any other discoveries of interest. Also an expedition of some infantry, commanded by Gabriel Dumont, working at the construction of certain ambuscades as a defence against the enemy, which were almost completed.\n\nEvening Session, 6th May, 1885.\n\nPresent:—Dumont, Carrière, Henry, Boucher, Ross, Lepine, Ouellette.\n\nProposed by Mr. Carrière, seconded by Mr. Dumont, that the ox belonging to Albert St. Louis, in the hands of Nolin, and Lepine, be brought here for the use of the Provisional Government. Carried unanimously.\n\nSession of the 7th May, 1885.\n\nPresent:—Boucher, Rose, Dumont, Ouellette, Tourond, Parenteau, Lepine.\n\nProposed by Mr. Lepine, seconded by Mr. Dumont, that Philip Garnot give up to George Fidler the saddle which he has in his hands, the Council seeing that the said Philip Garnot has no right to keep it. Carried unanimously.\n\nRESOLUTIONS AND ORDERS IN COUNCIL (LOOSE SHEETS).\n\nReserve the tithe, and that if our priests who were among us, desire to submit to these resolutions, they return and be treated as well, if not better, than during the past. Adopted unanimously.\n\nProposed by Mr. Dumont, seconded by Mr. Delorme, that we leave for Duck Lake. The vote stood six for and six against; the President decided for.\n\nProposed by Mr. Lepine, seconded by Mr. Jobin, that Mr. Alex. Tourond be sent with necessaries for the family of Mr. M. Dumas, and care the stock and cart the hay of Capt. J. B. Boucher. Adopted unanimously.\nProposed by Mr. Lepine, seconded by Mr. D. Tourond, that Mr. Ambroise Jobin replace the commissioner during his absence. Carried unanimously.\n\n24th March, 1885.\n\nBélanger vs. Vandale. Decision respecting a gun. Mr. Laframboise is permitted to address the Council.\n\nProposed by Mr. Boucher, seconded by Mr. Delorme, that the first gun available be placed in the hands of Mr. Pierre Vandale.\n\nProposed by Mr. Ouellette, seconded by Mr. Champagne, that no soldier be permitted to go out without a pass or without the consent of his captain, and the captain himself should come and ask permission of the Council; and that the captain should replace those soldiers who are without arms.\n\nProposed by Mr. Boucher, seconded by Mr. Lepine, that the members of the Council recognize the perfect frankness of Mr. Laframboise. Carried unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. Tourond, that a proclamation be circulated, granting protection to any person joining us, and who may have been forced to enter the Mounted Police force.\n\nProposed by Mr. Damase Carrière, seconded by Mr. Donald Ross, that three men, a Métis, a Cree and a Sioux, be sent to Battle River with a letter. Votes, 8 for, 2 against.\n\nProposed, in amendment, by Mr. Lepine, seconded by Mr. Boyer, that the Sioux be struck out. Six for, 3 against.\n\nProposed by Mr. Ouellette, seconded by Mr. Tourond, that a Métis and a Cree be sent to Fort la Corne with a letter. Six for, 3 against.\n\nProposed by Mr. Ouellette, seconded by Mr. Carrière, that a Métis and a Sioux be sent to Prairie Ronde with a message. Five for, 4 against.\n\nMinutes of the Council, 25th March, 1885.\n\nProposed by Mr. Boucher, seconded by Mr. Pierre Henry, that the Commandments of God be the laws of the Provisional Government. That we recognize the right of Mr. Louis \"David\" Riel to direct the priests. That the Archbishop Ignace Bourget be recognized, from this day, by the French Canadian people of the Saskatchewan, as the Pope of the new world, and that the members of the Council. * *\n\nMinutes of the Council, 1st April, 1885.\n\nProposed by Mr. Lepine, seconded by Mr. Tourond, that we take measures to provide a boat to cross the shore ice of the other side of the river. Carried unanimously.\n\nSession of the Council of the 22nd April, 1885, of the Exovedes of Companies.\n\nProposed by Mr. Edward Dumont, seconded by Mr. Vandale, that the lower part of the council house which is now at the disposal of the Exovedes of companies, be occupied by them alone, except the employees of the Council, the cooks and the Sioux interpreter, during sessions. Carried unanimously.\n\nProposed by Mr. Dumont, seconded by Mr. Isidore Dumas, that each soldier take charge of his own horse, and the horses, above all things, be fed at the same time. Carried unanimously.\n\nProposed by Mr. Short, seconded by Mr. Calixte Lafontaine, that Mr. Joseph Delorme take charge of the grain and hay, when occasion arises. Carried unanimously.\n\nProposed by Mr. Isidore Dumas, seconded by Calixte Lafontaine, that James Short be selected to examine the horses. Carried unanimously.\n\nProposed by Antoine Lafontaine, seconded by Daniel Gariépie, that Edouard Dumont be appointed to choose the horses. Adopted unanimously.\n\nProposed by Joseph Delorme, seconded by William Swaine, that Charles Carrière be appointed to examine the horses and to place them at the disposal of the military exovide. Adopted unanimously.\nProposed by Isidore Dumas, seconded by Charles Carrière, that the horses that are too poor and unserviceable be sent adrift without a guard. Seven for, and five against.\n\nEvening Session, 22nd April, 1885.\n\nProposed by Isidore Dumas, seconded by William Boyer, that no soldier have permission to absent himself without the knowledge of his captain. Adopted unanimously.\n\nSession of the 27th April, 1885.\n\nProposed by William Boyer, seconded by Mr. Vandale, that the guards appointed for night service here be two, each to take his night; and that William Boyer and Baptiste Vandale be appointed to that service. Six for, four did not vote.\n\nThat the horses be guarded during the day and not during the night. Six for, four against.\n\nOne company is sufficient for the service, and that Damase Dumas be appointed for the service.\n\nOne company for the cattle is sufficient, and that Calixte Lafontaine be appointed to the service.\n\nOne company for the ferry boat and the cable, and that Trottier be appointed to this service.\n\nOne company to cart the hay and grain, and the goods of the people; and that Antoine Lafontaine be appointed to this service.\n\nOne company for the lower section, and that William Swaine be appointed to this service.—Carried.\n\nOne company for the Little Mountain, and that Philip Gariépie be appointed to this service.—Carried.\n\nThree companies to keep guard towards the camp of Middleton, and that Baptiste Vandale, Daniel Gariépie and James Short be appointed.—Adopted.\n\nMinutes of the Sessions of the Council.\n\nCouncil of the Provisional Government, formed at St. Anthony, the nineteenth day of March, in the year of our Lord eighteen hundred and eighty-five. Mr. Pierre Parenteau was elected President, Mr. Charles Nolin, Commissioner, and Mr. Gabriel Dumont, Adjutant-General. Members of the Council: Messieurs. Baptiste Boyer, Donald Ross, Damase Carrière, Amb. Jobin, Norbert Delorme, Moïse Ouellette, Bte. Parenteau, David Tourond, Pierre Gariépie, Maxime Lepine, Albert Monkman, Bte. Boucher, Philip Garnot, Secretary, and Eugène C. Boucher, Assistant Secretary.\n\n1st Resolution—It is resolved that G. Dumont, Adjutant General, be at the head of the army, having for assistants Messieurs Joseph Delorme and Patrice Tourond, and that Mr. Patrick Fleurie be entrusted with the inspection of the arms.—Carried—Ph. G.\n\n2nd Resolution—That Mr. Baptiste Boucher be sent to the Piegan. Carried.\n\n3rd Resolution—That two prisoners be sent back, and that they be Walters and his clerk.\n\n4th Resolution—That the Indian Agent be retained until otherwise ordered.\n\n5th Resolution—That Mr. Charles Nolin be appointed commissioner.\n\n6th. That a messenger be sent to invite Messrs. Normand, Ouellette and Dumont to the Council house, as a mark of respect.\n\n7th. Resolved that George Ness be liberated, but that his horse and his vehicle be detained.\n\nProposed by Mr. Boucher, seconded by Mr. Tourond, that Mr. Monkman be sent with two companies to invite the English Metis to join us. Adopted unanimously.\n\nProposed by Mr. Jobin, seconded by Mr. Tourond, that a list of the Indian chiefs disposed to join us be given to Mr. Monkman. Adopted unanimously.\nProposed by Mr. Lepine, seconded by Mr. Baptiste Boyer, that the council give full power to Mr. Monkman to act to the best of his capacity and judgment. Adopted unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Boyer, that Mr. Monkman be requested to tranquilize the families on his road. Adopted unanimously.\n\nProposed by Mr. Boucher, seconded by Mr. D. Carrière, that we desire to effect the capture of the fort without spilling any blood, and the greater our force the more certain we shall be of attaining our object, but in case we are compelled to fight, justice compels that they should take up arms; and do you join us, we have ammunition with us.\n\nProposed by Mr. Tourond, seconded by Mr. Carrère, that Madame Caron be rewarded and receive a yearly salary for her services in cooking, and that the sum be $28. Carried unanimously.\n\nProposed by Mr. D. Carrière, seconded by Mr. Jobin, that this Council desires to express its admiration of the conduct of Mr. Rochelien, in setting an example. Adopted unanimously.\n\nOrders in Council of the 31st March, 1885—Charles L'Heureux.\n\nOrders in Council of the 1st April, 1885.\n\nProposed by Mr. Jobin, seconded by Mr. Tourond, that two men be sent for the animals on the reserve near Muskeg Lake, belonging to the Government, and that three others be sent to the other reserves for the other animals, also supposed to belong to the Government. Adopted unanimously.\n\nProposed by Mr. Jobin, seconded by Mr. Monkman, that men be sent to the Government farm, to carry off all the provisions, the animals and other property that may be there. Carried unanimously.\n\nProposed by Mr. Monkman, seconded by Mr. Delorme, that the house of—— be visited and all the goods taken from the company, as well as the arms and ammunition, be brought here by the men of the Provisional Government.\n\nMinutes of the Council 27th March, 1885.\n\nProposed by Mr. A. Monkman, that a message be sent to our friends the English Metis, as also a letter from the prisoners to Drs. Miller, Bain and Porter. Adopted unanimously.\n\nProposed by Mr. A. Monkman, seconded by Mr. Boucher, that two prisoners be set at liberty with a letter to the commandant at Carlton, inviting him in the name of God and of humanity to come and dispose of the bodies of those who fell yesterday in the fight, and that he may come as far as the battle field, and that he may return from it not only without being molested, but that he be assured that our sympathy will accompany him while performing that duty to the dead. Adopted unanimously.\n\nProposed by Mr. Lepine, seconded by Mr. Parenteau, that the Exuvia of the French Canadian Metis believes firmly that hell will not last for ever, that the doctrine of everlasting future punishment is contrary to Divine mercy as well as to the charity of our Saviour Jesus Christ; consequently the Exuvia of the French Canadian Metis establishes the truth that however long hell may last, prolonged though it be for millions on millions of years it will come to an end one day by the goodness of God through the merits of Jesus Christ. Adopted unanimously.\n\nPH. GARNOT, Secretary.\n\nProposed by Mr. A. Monkman, seconded by Mr. Boucher, that Mr. Champagne be appointed president of the Council:\n\nProposed by Mr. A. Monkman, seconded by Mr. J. Bte. Boucher, that they are to remain here until the petition from Prince Albert arrives, unless there is anything to the contrary.\n\nProposed by Mr. Lepine, that we have four men at Batoche to receive the loads from the freighters, and that there be another man to carry messages to the Council.\nMinutes of the Council record the thanks of Council to Messrs. Nolin, Monkman and the soldiers.\n\nTHE PROVISIONAL GOVERNMENT VS. REV. FATHER VÉGREVILLE.\n\nDeposition of Mr. Gabriel Dumont.—Having met Father Végréville half a mile from here, he told me that the Indians were pillaging the goods of Madame Thibault, and that it was you people who were responsible for all that, because you invited the Indians, and that you would be held accountable for it. And on arriving at Duck Lake Madame Thibault came and asked me if I had ordered the Indians to take her hay.\n\nMr. Michel Dumas corroborates the deposition of Mr. Dumont in every particular.\n\nMr. Boucher.—It appears that Father Végréville told my son that all the people who had taken up arms in the movement were rebels and would find that it was their damnation, that he could not administer to them in their last moments. And I repeat this as being the most violent language that was uttered. Mr. Brennan, jr., was there, and the father ought to know that he sank down with weakness when hearing this spoken of.\n\nFor keeping the Father, Dam. Carrière, G. Dumont, M. Lepine, C. Trottier, D. Ross, P. Henry, Bte. Boucher, M. Ouellette.\n\nProposed by Maximo Lepine, seconded by J. B. Boucher, if God so wills, if He has so decided in His eternal designs, we desire nothing better than to be His priests and to constitute, if such is His desire and His holy will, the new religious ministry of Jesus Christ. And we at once establish the living catholic apostolic and vital church of the new world. Confident that by doing so we are doing a thing which is pleasant to Him, we adopt for the line of our conduct the three admirable letters from the Archbishop Ignace Bourget to Louis \"David\" Riel, written on the 13th January, 1874, the 14th July, 1875, and the 2nd January, 1876.\n\nBélanger vs. Vandale for a Gun.\n\nMr. Bélanger said he had commenced negotiations to trade a gun for a waggon with Pierre Vandale, and that he was to see the gun, and that if the gun pleased him he would take it, and that when he went to see the gun Vandale was not at home, and he went to see him at the house of his father-in-law, and had taken the gun, and that when the trouble began the nephew of Mr. Bélanger had taken it, and that Mr. Vandale had taken it from him. Mr. Vermette said the same thing. Mr. Vandale said that his gun had not been paid for, that he was to have had the choice of three carts, and that he had only seen two, and that he had not received them. I went to see the carts before he took the gun. He gave me my choice between a cart and a bob-sleigh.\n\nIn answer to Mr. Riel—I was wrong in telling him to go and see the gun.\n\nBélanger cross-examined by Mr. Riel.\n\nMr. Vermette repeats what he had said before.\n\nDecision of the Council—Mr. Lepine: That the gun belongs to the Bélanger. Mr. Boyer, Mr. Boucher, Mr. Delorme. Mr. Vandale give the gun to Mr. Bélanger, and the Council decides to give the first gun at their disposal to Vandale.\n\nProposed by Mr. Boucher, seconded by Mr. Delorme, that the first gun at our disposal be given to Mr. Vandale.\nSUPPLEMENTARY RETURN\n\nTo an ORDER of the HOUSE OF COMMONS, dated the 4th March, 1886;—For copies of all papers found in the Council room of the insurgents, or elsewhere at Batoche, especially including:\n\n1. The diary of Louis Riel\n2. The minute book and Orders in Council of the insurgent Council.\n3. The correspondence of Louis Riel.\n\nBy Command.\n\nJ. A. CHAPLEAU,\nDepartment of the Secretary of State,\nSecretary of State.\n\n11th May, 1886.\n\nDEPARTMENT OF JUSTICE, OTTAWA, 10th May, 1886.\n\nSir,—Referring to my communication of the 4th instant, I have the honor to transmit to you, herewith, a copy of the resolution passed at the meeting in Lindsay school house, which completes the return of all papers found at Batoche, in compliance with the order of the Honorable the House of Commons of the 4th March last.\n\nI have the honor to be, Sir, your obedient servant,\n\nGEO. W. BURBIDGE, Deputy Minister of Justice.\n\nThe Under Secretary of State.\n\nRESOLUTIONS PASSED AT LINDSAY SCHOOL.\n\nAt a mass meeting held at Lindsay schoolhouse, 23rd March, 1885, the following was unanimously adopted:\n\n1st. That a petition be sent to the Government setting forth that the French in this district have taken up arms.\n\n2nd. That the Indians, to a great extent, are in sympathy with them.\n\n3rd. That the English half-breeds and Canadian settlers likewise have grievances, and are in sympathy with them to get redress of grievances in a lawful manner, but not to take up arms.\n\n4th. That there is great danger of a civil war—an Indian war—and all that that means.\n\n5th. That the French have rights and are determined men.\n\n6th. That there is no way of settling this disturbance but by treaty or war.\n\n7th. That the neutral party, the English half-breeds and Canadian settlers who wish to remain at peace, and their wives and families, do beg of the Government to treat with the settlers giving them their just rights and save the destruction of their families.\n\n8th. That we have come to this country in good faith that we would have our rights respected as British subjects.\n\n9th. That the Government has refused to treat with settlers till our party could bear it no longer, and will have their rights or die.\n\n10th. We therefore beg of the Government to do justice to the settlers, treat with them and save the effusion of blood.\n\nTHOMAS F. MILLER, Chairman,\nWILLIAM MILLER, Secretary,\nAnd 455 others.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001588.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 78922, "total-output-tokens": 42489, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2454, 2], [2454, 6379, 3], [6379, 10532, 4], [10532, 15041, 5], [15041, 18118, 6], [18118, 20272, 7], [20272, 23089, 8], [23089, 26018, 9], [26018, 28855, 10], [28855, 31979, 11], [31979, 34803, 12], [34803, 37856, 13], [37856, 41342, 14], [41342, 44875, 15], [44875, 48642, 16], [48642, 51899, 17], [51899, 53933, 18], [53933, 58418, 19], [58418, 62316, 20], [62316, 66874, 21], [66874, 71177, 22], [71177, 75744, 23], [75744, 79416, 24], [79416, 82858, 25], [82858, 86686, 26], [86686, 90836, 27], [90836, 94204, 28], [94204, 97142, 29], [97142, 99527, 30], [99527, 101483, 31], [101483, 103486, 32], [103486, 105629, 33], [105629, 107638, 34], [107638, 109595, 35], [109595, 112582, 36], [112582, 115007, 37], [115007, 117914, 38], [117914, 121502, 39], [121502, 124826, 40], [124826, 128046, 41], [128046, 131268, 42], [131268, 134367, 43], [134367, 137544, 44], [137544, 140793, 45], [140793, 143914, 46], [143914, 147342, 47], [147342, 150513, 48], [150513, 154091, 49], [154091, 157198, 50], [157198, 157198, 51], [157198, 159585, 52], [159585, 159585, 53], [159585, 159585, 54]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]