[{"id": "2f9c710f088bdfb2bcda2930de80bd42332f5b9a", "text": "QUELQUES RENSEIGNEMENTS\nPOUR LES\nELECTEURS\nLES ORANGISTES\nET LA\nQUESTION RIEL\n\nLes libéraux et leurs alliés ont accusé le gouvernement d’avoir livré la tête de Riel pour assouvir la haine et les cris des Orangistes. On affirmait, le 16 novembre dernier, que les Orangistes avaient exercé une forte pression sur le gouvernement par les requêtes les plus pressantes.\n\nOr il y a 200,000 orangistes dans le Canada, y compris les femmes et les enfants ; ce qui représente à peu près 40,000 électeurs. Il y a, paraît-il, 2,000 loges orangistes. Sur ces deux mille loges il n’y en a qu’une seule qui ait envoyé une requête demandant au gouvernement de laisser la loi suivre son cours. C’est celle de Toronto. Elle est signée par une centaine de membres de cette loge, et la plupart des signataires sont des libéraux.\n\nLe secrétaire de cette loge, un conservateur, n’a pas voulu prendre la responsabilité de la requête, et a résigné.\n\nDeux autres requêtes ont été envoyées par les habitants de Regina et de Moosomin, dans le Nord-Ouest, et une lettre\nsignée par un individu de Cranbourne, dans la province de Québec.\n\nVoilà toute la part prise par les orangistes relativement à cette affaire.\n\nLes libéraux et leurs alliés ont donc impudemment trompé le public, en affirmant ce qu'ils ne savaient pas, où ce qu'ils connaissaient être faux.\n\nVoici ces requêtes :\n\nA l'Honorable Conseil Privé du Canada.\n\nMessieurs,\n\nVeuillez m'excuser de prendre la liberté de vous adresser cette lettre pour vous exprimer mes meilleurs souhaits.\n\nEt je prierai toujours Dieu pour votre bien-être,\n\nMes vénérés et illustres supérieurs, Sir John MacDonald surtout.\n\nJe regrette grandement et suis fâché de savoir que Louis David Riel, Dumont, Dubuc, Lépine, et de nombreux autres Métis et Sauvages, ont eu l'inexcusable et criminelle audace de faire une guerre de partisans contre nous, gens qui parlons l'anglais, si peu nombreux que nous soyons, depuis notre gouverneur-général jusqu'au plus humble des sujets.\n\nBien-aimés et vénérés supérieurs, je dois dire, et c'est la vérité, que nous qui parlons l'anglais, au Canada ou partout ailleurs que nous soyons, c'est leur vœu le plus cher de nous détruire s'ils le peuvent.\n\nEt vous savez qu'ils ont réussi à assassiner un grand nombre de nos gens depuis plusieurs années.\n\nEt le notoire Riel a eu un nombre spontané de gens dans les États-Unis (has had a spontaneous number of people in the United States).\n\nEt attendu que ces individus haïssent la forme monarchique de gouvernement, il s'en suit que vous êtes en danger avec cette classe.\n\nMais avec la bénédiction de Dieu, nous réussirons à conquérir le sauvage assoiffé de sang et tous ceux qui le poussent.\n\nEt tous nos frères qui parlent l'anglais, ou notre race, de quelque opinion politique que nous soyons, réussiront à s'entendre parfaitement, et de cette façon ne donneront aux barbares peaux\nrouges de l'Amérique du Nord, ou aux cannibales noirs du centre de l'Afrique, aucune chance de décimer.\n\nSi ce Riel, qui a tous les instincts français et sauvages, monte sur l'échafaud, la vie des citoyens de langue anglaise sera plus en sûreté.\n\nIls menacent de la guerre à outrance et viendra un temps où ils l'auront et où ils ne seront plus capables de faire ni menaces ni guerre.\n\nJe demeure, honorables messieurs du Conseil Privé du Canada,\n\nVotre très-obéissant et très-humble serviteur,\n\n(Signé,)\nCHARLES O'HARA,\nJournalier.\n\nCranbourne, 21 Septembre A. D. 1885.\n\nP. S.—Viendra un temps où les États-Unis et nous viendrons à une entente parfaite. Soyons tous justes et sans crainte.\n\nC. O'H.\n\nRegina, 2 Septembre 1885.\n\nA l'Honorable Secrétaire d'État du Canada.\n\nMonsieur,\n\nÀ la demande des citoyens de Regina, l'honneur de vous soumettre sous ce pli deux pétitions relatives à la sentence de Louis Riel.\n\nJe suis, Monsieur,\n\nVotre obéissant serviteur,\n\n(Signé,)\nN. F. DAVIN.\n\nA SON EXCELLENCE LE TRÈS-HONORABLE HENRY CHARLES KEITH PETTY FITZMAURICE, G. C. M. G. MARQUIS DE LANSDOWNE, GOUVERNEUR GÉNÉRAL DU CANADA.\n\nLa pétition des soussignés habitants de la ville de Regina, T N. O. et des environs, expose humblement :\n\nVos Pétitionnaires ont appris qu'on travaille en ce moment dans la province de Québec à faire signer des pétitions pour obtenir la commutation de la sentence de mort prononcée contre Riel pour haute trahison.\nVos pétitionnaires sont convaincus que le dit Louis Riel a eu un procès équitable et impartial, et que s'il n'est pas donné suite au verdict du jury, il y aura beaucoup de mécontentement dans ce pays et l'on courra grand risque de voir se renouveler les actes de trahison pour lesquels le dit Louis Riel a été condamné, et la confiance dans le gouvernement sera fortement ébranlée ;\n\nNous croyons qu'il est absolument nécessaire dans l'intérêt du Nord-Ouest, du Canada et de la loi dans le monde entier qu'il ne soit usé d'aucune clémence dans le cas de criminel comme Louis Riel qui, dans le passé, a bravé les lois du Dominion par une insurrection à main armée, causant au pays une dépense d'argent considérable et la perte de vies de plusieurs braves citoyens.\n\nC'est pourquoi vos pétitionnaires prient respectueusement que la sentence de mort prononcée contre Louis Riel ne soit pas changée, que la loi puisse suivre son cours et que l'exécutif refuse d'exercer son droit de clémence.\n\nEt vos pétitionnaires ne cesseront de prier.\n\n(Signé), A. B. Dunnet. (Signé), Alex. Sheppard.\n\" George Anderson. \" Robert Robson.\n\" F. Stanley Simpson. \" Daniel Mowat.\n\" A. A. Doig. \" John S. Laidlaw.\n\" J. R. Simpson. \" John Lyon.\n\" F. Arnold. \" William Russell.\n\" Heinrick Hollnick. \" D. N. Bole.\n\" Auguste Hollnick. \" A. D. Fergusson.\n\" Jenner A. Elliott. \" D. B. M. Fadyen.\n\" W. B. Cameron. \" J. Phillips Watts.\n\" Jas. Brown. \" R. S. R. Eden.\n\" Wm. J. Brine. \" J. W. Smith.\n\" Joseph Buckland. \" John Dawson.\n\" H. J. C. Innis. \" R. B. Fergusson.\n\" J. C. Metcalfe. \" James Sellick.\n\" Robert Anderson. \" Jos. C. Irvine.\n\" E. B. Read. \" Rimbler Paul.\n\" U. G. Pettingues. \" Thos. McNical.\n\" T. M. Grapper. \" G. B. Wallace.\n\nDÉPARTEMENT DU ÉCRÉTAIRE D'ETAT DU CANADA.\n\nOttawa, 8 Septembre 1885.\n\nMonsieur,\n\nJ'ai l'honneur d'accuser réception de votre lettre du 2 courant me transmettant une pétition à Son Excellence, le Gouverneur-Général, de la part de certains habitants de Regina, T. N. O., demandant que la sentence prononcée contre Louis Riel ne soit\npas changée, et je dois vous dire que la question recevra l'attention qu'elle mérite.\n\nJ'ai l'honneur d'être, Monsieur,\n\nVotre obéissant serviteur,\n\n(Signé), G. POWELL.\n\nA M. Nicholas Flood Davin, avocat,\nRegina, T. N. O.\n\n— Regina, T. N. O., 20 Août 1885.\n\nMonsieur,\n\nA la demande de la population de Moosomin, j'ai l'honneur de vous transmettre pour Son Excellence, le Gouverneur-Général, la pétition ci-jointe.\n\nJ'ai l'honneur d'être, Monsieur,\n\nVotre obéissant serviteur,\n\n(Signé) NICHOLAS FLOOD DAVIN.\n\nA l'honorable Secrétaire d'Etat du Canada.\n\n—\n\nA SON EXCELLENCE LE TRÈS-HONORABLE HENRY CHARLES KEITH PETTY FITMAURICE, C.C.M.G., MARQUIS DE LANSDOWNE, GOUVERNEUR DU CANADA.\n\nLa pétition des soussignés, habitants de la ville de Moosomin, T.N.O., et du voisinage, expose humblement ;\n\nVos pétitionnaires ont appris qu'on travaille en ce moment dans la province de Québec, à faire signer des pétitions pour obtenir la commutation de la sentence de mort prononcée contre Riel pour haute trahison.\n\nVos pétitionnaires sont convaincus que le dit Louis Riel a eu un procès équitable et impartial et que s'il n'est pas donné suite au verdict du jury, il y aura beaucoup de mécontentements dans ce pays et l'on courra grand risque de voir se renouveler les actes de trahison par lesquels le dit Louis Riel a été condamné, et la confiance dans le gouvernement sera fortement ébranlée.\n\nNous croyons qu'il est absolument nécessaire dans l'intérêt du Nord-Ouest du Canada et de la loi dans le monde entier qu'il ne soit usé d'aucune clémence dans le cas de criminels comme Louis Riel qui, dans le passé, a bravé les lois du Dominion par une insurrection à main armée causant au pays une dépense d'argent considérable et la mort de plusieurs braves citoyens.\n\nC'est pourquoi vos pétitionnaires prient respectueusement que la sentence de mort prononcée contre Louis Riel ne soit pas changée, que la loi puisse suivre son cours et que l'exécutif refuse d'exercer son droit de clémence.\nEt vos pétitionnaires ne cesseront de prier.\n\n(Signé), A. G. Hamilton. \" R. J. Nable.\n\" Thos. Beer. \" H. C. Buchaman.\n\" D. Macfarlane. \" W. J. Smith.\n\" B. Warwick. \" Jas. Paul.\n\" T. G. Carrecthus. \" Joseph Featheson.\n\" Thos. Ramsay. \" S. Sutherland.\n\" O. Neff. \" T. H. Bush.\n\" Geo. Packe. \" Richard Tees.\n\" Geo. Campbell. \" F. McPherson.\n\" Robert Shaw. \" John McKenzie.\n\" George McKennits. \" A. York.\n\" J. A. Rutledge. \" E. Treaves.\n\" C. H. Westbrook. \" F. G. Lewin.\n\" James Campbell. \" A. S. Rutledge.\n\" W. Dickie. \" A. S. Smith.\n\" R. W. McKennits. \" S. Field.\n\" E. H. McCrea. \" J. McCurdy.\n\" A. H. Richards. \" George Cowan.\n\" W. H. Maulson. \" John Campbell.\n\" W. H. Husband. \" David Carnaham.\n\" D. H. McCallum. \" A. McCormick.\n\" Alfred Elmore. \" Jas. Robinson.\n\" Colin McLean. \" William Thompson.\n\" Amos Rinsey. \" W. James Dickson.\n\" Jno. Hind. \" H. Lamb.\n\" John Smithers. \" J. Daniel.\n\" James Hart. \" John McGuire.\n\" E. B. McCrea. \" John Routty.\n\" R. D. McNaughtar. \" Richard Walsh.\n\" M. Morrison. \" John E. Scott.\n\" John Cummings. \" John Jretan.\n\" J. N. Berthelot \" J. R. Whittington.\n\" M. Dimwick. \" John Morrison.\n\" Robert Tucker. \" T. B. McAlpin.\n\" H. H. Fell. \" Robert Mills.\n\" Wm. Laidlane. \" A. Bell.\n\" Thomas H. Wilson. \" A. Galloway.\n\" F. T. Carneau. \" Wm. Hedmond.\n\" A. H. Sutherland \" C. J. Johnson.\n\" W. Bristol. \" Thomas Jones.\n\" J. W. McDerwid. \" H. Smith.\n\" J. F. Williams. \" W. J. Hains.\n\" T. N. Huddlestow. \" C. W. Crawford.\n\" Thos. Ewen.\n\nSECRETARIAT D'ETAT DU CANADA,\nOttawa, 27 août, 1885.\n\nMonsieur,\n\nJ'ai l'honneur d'accuser réception de votre lettre du 20 courant, me transmettant une pétition à Son Excellence, le gouverneur-général, de la part de certains habitants de Moosomen,\nT. N. O., demandant que la sentence prononcée contre Louis Riel ne soit pas changée et je dois vous dire que la question sera prise en considération.\n\nJ'ai l'honneur d'être,\n\nMonsieur,\nVotre obéissant serviteur,\n\n(Signé) G. POWELL,\nSous Secrétaire d'État.\n\nA. M. N. FLOOD DARIN,\nAvocat.\n\nREGINA, T. N. O.\n\nToronto, 3 Novembre 1885.\n\nA l'Honorable J. A. Chapleau, Secrétaire d'État, Ottawa.\n\nCher Monsieur,\n\nAFFAIRE RIEL.\n\nJe vous transmets sous ce pli une représentation du corps orangiste de Toronto-Ouest pour considération de la part de l'autorité compétente :\n\nVeuillez avoir la bonté de la soumettre à Son Excellence le Gouverneur-Général.\n\nVotre dévoué,\n\n(Signé), JAMES BEATY.\n\nLOGE ORANGISTE DU DISTRICT OUEST.\n\nToronto, 2 Novembre 1885.\n\nA James Beaty, Ecr., M.P., Toronto-Ouest.\n\nCher Monsieur,\n\nLes orangistes de ce district se permettent de vous parler respectueusement, comme notre représentant au parlement, relativement à l'affaire de Riel, à l'heure qu'il est condamné à mort à cause des violences, de l'effusion de sang et de la trahison dont il s'est rendu coupable.\n\nNous regrettons que, dans une affaire si claire, il soit nécessaire de rappeler d'avance au gouvernement ce qu'il doit faire, et d'exprimer nos sentiments unanimes sur cette question, mais le fait que des assemblées publiques ont été convoquées en faveur de Riel, et pour défendre sa conduite, dans la province de Québec, surtout par des catholiques romains, et que les efforts les plus énergiques sont faits par ces gens et par les amis de Riel pour obtenir une commutation de la sentence prononcée contre lui, nous fait un devoir impérieux comme association royale et protestante, d'exprimer au gouvernement nos opinions\net nos profondes convictions sur ce sujet. On a déjà pardonné à Riel une fois. On a déjà essayé l'exil de Riel. On a déjà éprouvé l'honneur de Riel, quand il a promis de ne jamais remettre les pieds au Canada, et tout cela a échoué misérablement. Ses idées sanguinaires n'ont fait que devenir plus sérieuses. Le pardon n'a fait que le porter à traiter les lois anglaises et la clémence anglaise avec mépris, et le meurtre de sujets anglais loyaux et soumis aux lois a été dix fois plus épouvantable que dans les premières occasions. Des hommes, dont même ce pays, si grand qu'il soit, n'est pas digne, sont là ensevelis, quelques-uns des meilleurs, des plus nobles et des plus fidèles des loyaux enfants du Canada.\n\nNous nous permettons donc de vous prier instamment d'employer toute votre influence auprès du gouvernement pour que la sentence prononcée contre Riel par ses compatriotes, confirmée par la Cour Suprême de la province, et appuyée par le Conseil Privé d'Angleterre soit exécutee.\n\nNous espérons, avec confiance, que vous prierez instamment le gouvernement de ne pas permettre que des pétitions, requêtes ou influences de la part des amis de Riel, ou venant de toute autre source, le décide à commuer la sentence, à en reculer l'exécution ou à modifier en aucune manière la juste sentence aujourd'hui suspendue sur la tête de cet homme qui a prononcé lui-même son arrêt.\n\nEt vos petitionnaires ne cesseront de prier, etc.\n\n(Signé) JAMES BODDY,\nSecrétaire du District.\n\nAu nom de la royale association orangiste de Toronto-Ouest.\n\nDÉPARTEMENT DU Secrétaire d'Etat.\n\nOttawa, 21 Novembre 1885.\n\nMonsieur,\n\nJ'ai l'honneur d'accuser réception de votre lettre du 3 du courant transmettant pour la soumettre à Son Excellence le Gouverneur Général, une communication qui vous a été adressée par la royale Association Orangiste de Toronto-Ouest, relative à la sentence prononcée contre Louis Riel, et de vous dire que cette affaire recevra l'attention qu'elle mérite.\n\nJ'ai l'honneur d'être,\n\nMonsieur,\n\nVotre obéissant serviteur.\n\n(Signé) HENRY J. MORGAN,\nFaisant fonctions de sous-secrétaire d'Etat.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001318.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 12590, "total-output-tokens": 4483, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1043, 1], [1043, 2877, 2], [2877, 4317, 3], [4317, 6361, 4], [6361, 8341, 5], [8341, 10048, 6], [10048, 11756, 7], [11756, 13861, 8]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]