[{"id": "097f7ba931aea4a63ca81fcefc7b06489e138681", "text": "REPORT\n\nOF THE\n\nSELECT COMMITTEE\n\nIn re\n\nCHARLES BREMNER'S FURS\n\nPRINTED BY ORDER OF PARLIAMENT.\n\nOTTAWA:\nPRINTED BY BROWN CHAMBERLIN, PRINTER TO THE QUEEN'S MOST EXCELLENT MAJESTY.\n\n1890.\nREPORT.\n\nThe Select Committee appointed to enquire into the statements made in reference to furs taken from Charles Bremner, a half-breed, residing at Battleford, beg leave to report unanimously:\n\n1. That during the North-West Rebellion of 1885 and on the day of the surrender of the Indian Chief Poundmaker, who had been in arms against the Government of Canada, a number of half-breeds came into Battleford, among whom was Charles Bremner, a half-breed trader and farmer, a resident of Bresaylor, twenty-two miles from Battleford, having in his possession a large quantity of valuable furs.\n\n2. General Middleton being in command of the Canadian forces engaged in the suppression of the rebellion and being in Battleford, and having information that these half-breeds had come in from Poundmaker's camp and that the furs were being carried away, gave orders that they should be put in charge of the Dominion Mounted Police, and they were accordingly placed in the Police Barracks at Battleford for safe keeping.\n\n3. Some weeks later, while General Middleton was at Fort Pitt, Mr. Hayter Reed (a member of his staff), who had then just returned from Battleford, called attention to the furs, and reminded General Middleton that the person from whom they had been taken was said to be a rebel. Thereupon, after consultation with Mr. Reed and Mr. Bedson (another member of his staff), General Middleton assumed to confiscate the furs.\n\n4. At the time of the confiscation General Middleton directed Mr. Reed to send an order in writing to the Police officer in Battleford who had charge of the furs. The exact wording of this order cannot be clearly established as it was destroyed a few days after it was written. But it is proved to have been of the following tenor:\n\nThat General Middleton had confiscated the furs, and had ordered that two packages of them should be put up for himself, one for Mr. Hayter Reed, one for Mr. Bedson, and one for another member of his staff, selecting the best; and that receipts should be taken for, or a memorandum made of, the furs thus distributed.\n\n5. Packages were put up in conformity with this order—two for General Middleton, one for Mr. Hayter Reed and one for Mr. Bedson. The furs thus put up were in quantity about one-eighth of the whole, but of much larger proportionate value.\n\n6. It has been proved before your Committee that the furs put up for General Middleton and Mr. Bedson were placed on board the steamer which conveyed General Middleton and Mr. Bedson from Battleford to Winnipeg. But it would appear that Mr. Bedson, who had promised to give a receipt for the furs, refused to do so, alleging that they had not reached Winnipeg; and your Committee find that the packages of furs so shipped for General Middleton were not received by him.\n\n7. The furs put up by Mr. Hayter Reed were forwarded to Regina and received by him there. He subsequently returned the package unopened to the Police authorities at Battleford, alleging as his reason for so doing that the propriety of the confiscation was questioned.\n\n8. Your Committee consider the confiscation of the furs unwarrantable and illegal; and in his evidence General Middleton admits that he has recently become satis-\nfied it was not legally justifiable. Your Committee are further of opinion that, if the confiscation had been legal, the confiscated property vested in the Crown; and, while your Committee believe that General Middleton acted under an unfortunate misconception as to his powers, they are of opinion that the appropriation of any portion of the property, under such circumstances, by General Middleton to his own use, and to that of the members of his staff, was highly improper.\n\n9. On behalf of Bremner it was stated to your Committee that he is willing to accept $4,500 inclusive of interest in compensation for his loss, and this your Committee consider a fair compensation.\n\n10. For the information of the House your Committee submit herewith the minutes of the evidence taken by them in this enquiry, also the minutes of the proceedings of the Committee, which, with this Report, they recommend to be printed.\n\nAll which is respectfully submitted.\n\nA. McNEILL,\nChairman.\n\nCommittee Room,\n23rd April, 1890.\nMINUTES OF EVIDENCE\n\nTaken by the Select Committee appointed to enquire into the statements made in reference to furs taken from Charles Bremner, a Half-breed residing at Battleford.\n\nHOUSE OF COMMONS, 19th March, 1890.\n\nThe Select Committee of the House appointed to investigate the alleged appropriation of furs belonging to one Charles Bremner, met at 10 a.m.\n\nMr. McNeill in the Chair.\n\nMr. Lister handed the Chairman a copy of the charges, which were read as follows:\n\n\"In compliance with the request of the Committee appointed by Parliament on the 3rd day of March, 1890, to enquire into the statements made in the House in reference to furs said to have been taken from Charles Bremner, a Half-breed, at Battleford:\n\nI beg to say that, upon perusal of the said statements, I understand the statements therein made to be as follows:\n\n1st. That certain furs belonging to the said Bremner were, by order of General Middleton, while commanding the Canadian forces in the North-West, taken possession of and placed in the barracks at Battleford for safe-keeping, and the same were, subsequently, by a letter written by one Hayter Reed, Assistant Commissioner of Indians, on the 4th day of July, 1885, addressed to one Warden, who was their Quarter-Master Sergeant of Police at Battleford, stated to be written by order of General Middleton, directed to be put up, two bales for General Middleton, one bale for S. L. Bedson, and one bale for the said Hayter Reed, a copy of which letter is as follows:\n\n\"Dear Warden,—General Middleton has instructed and authorized me to send you the present letter desiring that you put up bales of furs for the undermentioned: two bales for General Middleton, one for S. L. Bedson, and one for myself. Please select the best and pack them at once, as we will be down there to-morrow by boat.\n\nHAYTER REED,\nAssistant Commissioner of Indians.\"\n\n2nd. That on receipt of said letter by the said Warden the furs were put up and addressed in accordance with the directions contained in said letter, and shipped by the boat which took General Middleton, Bedson and Reed to Winnipeg.\n\n3rd. That this was not an isolated transaction, but was part of a series, comprising the following:\n\n(a.) That furs taken at Batoche were appropriated by General Middleton,\n\n(b.) That horses were taken by General Middleton and appropriated to his own use,\n\n(c.) That Bedson appropriated to his own use a pool table and horses taken from the settlers at Batoche.\n\n(Signed) J. F. LISTER.\n\nOn motion of Mr. Wood, seconded by Mr. Casgrain, clauses \"A,\" \"B\" and \"C\" of the charges in paragraph 3 were struck out, on the ground that there had been no authority given the Committee by the House to investigate such charges.\n\nThe Chairman—I ask General Middleton if he is ready to reply to this charge?\nMr. J. J. Gormully, representing General Middleton.—We simply say that the charge is not correct.\n\nMr. Lister.—Will the General make any explanation?\n\nMr. Kirkpatrick.—He wants to hear some evidence taken on the letter, then he will make a statement.\n\nMr. Lister.—It is the mere investigation, and if General Middleton has any explanation to give, I think in all fairness it should be made on the charge being made, either that there is no truth in that charge at all, or if there is some truth in it, if it can be satisfactorily explained. I think, in fairness to the Committee, General Middleton should now make an explanation. If he says there is no truth in that charge that is quite sufficient.\n\nMr. Gormully.—Of course, the charges as made there we do not admit, but the recollection of the General is not very clear. This is five years ago, in the heat of the rebellion, and the General has some recollection that there were furs belonging to the man called Bremner. That they came and asked him about some furs, that somebody came in and said they were taking furs or something of that sort. This was at Battleford, I think after Poundmaker had surrendered. I believe someone did come in and say to the General that they were taking furs, and suggested that the furs should be put in the barracks, and although he has no distinct recollection, he has no doubt but that the furs were put in the barracks. He says he does not actually recollect giving the order, but if they were put in the barracks, there is no doubt they were put there by his orders.\n\nThe Chairman.—That is the statement he makes through his counsel.\n\nMr. Casgrain.—My suggestion is this, that the charge be read in his presence.\n\nMr. Gormully.—He does not know what furs were put there. He went away.\n\nMr. Casgrain.—I think we ought to ask Mr. Gormully what is your answer to that statement?\n\nMr. Gormully.—I think I mentioned that, of course, the General, as a matter of fact, never saw the furs, and has never seen the furs to this day. He never saw them and, therefore, does not know what quantity was placed in those barracks. In some of the reports I have read, it was said that there were several cart loads of those furs and that people were taking them. The General then gave an order to put them in the barracks. He does not know who took them, or who was taking them. He has no doubt that he gave the order, although he has no distinct recollection of it. That occurred in May, and then he went in pursuit of Big Bear and came back to Fort Pitt after he had taken Big Bear, and he has a recollection that he was asked what was to be done with the furs that were in the police barracks and that were taken from this man Bremner, who was a rebel as they considered, and, believing he had the power, ordered them to be confiscated. Of course, he may have done wrong in that, or he may not. He does not recollect anything very distinctly after that. He has a sort of recollection that there was a request made for some of the furs, although he has no very distinct recollection of that. He might have given an order for some of the furs, giving a receipt to the storekeeper, so that either the receipt would be there or the furs. That is all he knows about it. He has never had any of those furs, and I do not think that the General has any recollection that he ever gave any written order. If there are, they will no doubt be produced. He has no recollection of it. It is all very well to sit around this table and listen to it now, but these people were in the North-West pursuing people with arms in their hands and in open rebellion. I have also stated that he never saw the furs, neither then nor thereafter, and never had any of Bremner's furs.\n\nMr. Casgrain.—The shorthand writer should be sworn. This declaration should be taken down at once and signed by the attorney; then we could ask General Middleton whether that declaration is correct or not. The point is, General, this declaration has been made in your presence. Do you admit the truth of it?\n\nGeneral Middleton.—Yes; it is substantially correct—I think it is substantially the facts of the case; but, of course, they are roughly put there. I do not know that I can make any alteration of it.\nMr. Lister.—I think that is a sufficient statement so far as General Middleton is concerned. I want to say one word to Mr. Girouard. I am sorry that he used the word \"stealing.\" If General Middleton thought he had the power to confiscate these furs it was not stealing. The object of the statement made here to-day is to prevent costs being incurred in bringing witnesses from the North-West, since every witness brought from Battleford will cost $208 in fares alone.\n\nThe statement made by Mr. Gormully on General Middleton's behalf was read over to him by the shorthand writer and its correctness acknowledged.\n\nThe shorthand writers employed to take the evidence were sworn to take down and faithfully transcribe the testimony given before the Committee.\n\nMr. Lister.—Mr. Hayter Reed is present. Does Mr. Reed desire to make any statement to this Committee? There is a charge made against him that he participated in these furs. Does he want to make a statement?\n\nMr. A. Ferguson.—I appear on behalf of Mr. Reed. In fact I have not got the charge, I only saw it this morning. There was no notice given to Mr. Reed of the charge and no copy of it was given to him. As far as the charges here made in this matter are concerned, I say, on behalf of Mr. Reed, that they are not correct. While he was at Fort Pitt, I think, in temporary charge of the transportation, the General being out, I think, in pursuit of Big Bear, he took a flying trip to Battleford in the course of his duty. While he was there, he saw certain furs in the Police storehouse. When he came back he reported to the General that there were furs in the storehouse. There was no name given, but it was said they belonged to some of the people who were supposed to be in the rebellion. In the course of his reporting this and in the course of conversation with the General, he also told the General there were other things there, and in the course of the conversation, the General said the furs should be confiscated, and that some portion of them might be put up for the General and his staff,—and that from that, and in pursuance of that authority and those orders, he did write a letter, but that the letter, a copy of which is embodied in this charge, is not the letter and does not correctly contain what were the contents of that letter; but he did write a letter to the officer in charge, the Quartermaster of the Mounted Police in charge of the stores, containing what I have said. That that letter was forwarded to the officer, who, I think, was Mr. Warden and that he, Mr. Reed, was not present when any action was taken upon the letter. There was a considerable quantity of furs there, in this place, open, and in a large room which was used as a sort of supply and provision establishment; a place also where the people were being rationed, as well as the troops coming in and getting their rations every day; that these furs were lying there in this place, and that he, himself has never received any of these furs. I do not think there is anything further to state in answer to the charge that was made. I do not wish to appear to be afraid to make a statement. I have nothing to keep from the Committee.\n\nMr. Ronald C. McDonald called, sworn and examined:\n\nBy Mr. Lister:\n\n1. Battleford is your home?—Yes.\n2. Your occupation?—A contractor.\n3. Were you employed by the Government during the year 1885, during the North-West rebellion?—No.\n4. What were you doing during that rebellion—where were you?—I was an officer in the regular militia in Battleford during the rebellion, I belonged to the Home Guard.\n5. You belonged to the Home Guards? Were you stationed at Battleford at any time during the rebellion?—I was there during the rebellion.\n6. What position did you occupy at Battleford?—I was quartermaster in the Home Guard.\n7. Do you know Charles Bremner?—Yes.\n8. Where does he live? Where did he live, and what was his occupation?—He was a farmer and trader living at Bressaylor, about 25 miles from Battleford.\n9. Do you know General Middleton and Hayter Reed?—I knew General Middleton to see him during the rebellion only. Mr. Reed, I had met before the rebellion and had known him.\n\n10. How long had you known Mr. Reed, was your acquaintance at all intimate?—Our acquaintance was not intimate. I simply knew him as an officer of the Government. I had known him about 5 years at that time.\n\n11. Did you remember seeing Charles Bremner near Battleford at any time during the year 1885 with furs?—At the time of the surrender of Poundmaker, he came within a couple of hundred yards of the barracks where my office was.\n\n12. Did you see him there?—Yes.\n\n13.—Did you observe whether he had furs with him or not?—Yes; I saw his furs there, I was over his camp.\n\n14. Can you give the Committee any idea of the quantity of furs he had?—Yes. Do you mean the value?\n\n15. Yes; the value and quantity. Can you form any idea of the quantity?—That is a difficult question to answer correctly. Do you mean the bulk of the furs, or the value of them? I judged they were worth $5,000, $6,000, or $7,000.\n\n16. Do you remember what they consisted of?—They consisted of beaver, bear, fisher, mink and other minor furs.\n\n17. Do you remember anything being done by General Middleton, or do you remember anything being done with regard to the furs, the possession of them?—Well, I saw General Middleton and Colonel Otter in conversation with Bremner's clerk.\n\n18. Who was that?—Caplette. I saw them at Bremner's camp.\n\n19. Otter and General Middleton were in conversation with Caplette at Bremner's camp?—Yes. The same day the furs were brought into the quartermaster's store, where I was also stationed—by the transport teams.\n\n20. By teams belonging to the Government?—Yes, in the employ of the Government by the North-West Mounted Police who had charge of them.\n\n21. And they were brought into where you were?—Yes.\n\n22. Where were they put?—They were placed in the corner of the quartermaster's store—that is the quartermaster of the North-West Mounted Police.\n\nBy Mr. Casgrain:\n\n23. Do you know the name of that policeman that you spoke of?—Yes; the transport teams were in command of Sergeant Ross who is now at Lethbridge or Fort McLeod, I cannot say.\n\n24. What is his Christian name?—Charles. He was in command of the teams that brought them in.\n\nBy Mr. Lister:\n\n25. They were brought in and placed in the quartermaster's room?—The store.\n\n26. How long did they remain there?—They remained there intact, until an order came presumably from General Middleton, a letter written by Mr. Reed. That was the 5th June, 1885, if I remember correctly; but I may be wrong as to the day and date.\n\n27. The 5th June, the furs were taken out?—That day they were given out.\n\n28. Do you remember when the furs were taken in?—No; I could only tell you by reference to date.\n\n29. Approximately?—I could only tell you by the day Poundmaker surrendered.\n\n30. They were taken there the day Poundmaker surrendered?—Yes.\n\n31. They remained intact until the 5th June?—Yes.\n\n32. What became of them then?—The day previous to this, a courier had arrived from Fort Pitt, where General Middleton, Reed and the staff were camped as far as we knew.\n\n33. The day previous to this a courier arrived from where it was supposed General Middleton was camped at Battleford. He arrived at Battleford?—Yes.\n\n34. What was his business?—The courier?\n\n35. Yes. What did he come to Battleford for?—He was sent down for a specific purpose.\n36. Did he bring any information from Fort Pitt of any kind?—Nothing beyond this letter.\n\n37. Nothing beyond a letter?—No.\n\n38. Now then, do you remember who the courier was?—No; I do not. There were a number of scouts in the employ of the Department, and I remember them coming in frequently.\n\n39. He brought a letter from Fort Pitt?—Yes.\n\n40. Will you look at the letter there and say whether that is substantially a copy of the letter you received, and that was brought down by this courier?—Yes; that is substantially the letter.\n\n41. You speak from recollection?—That was the tenor of it anyway.\n\n42. Did you know, and do you know Huyter Reed's handwriting?—I think I would know his handwriting.\n\n43. Would you know his signature?—Yes.\n\n44. Can you say the signature to that letter was in his handwriting or not?—Yes, it was.\n\n45. The copy of the letter is the letter set out in the charge. When that letter was received, what did you do?—We complied with the request or command, as it might be taken, of the letter sent down to put up bundles of furs for the parties mentioned in the note.\n\n46. You complied with the notice and put up bundles of the furs for the parties mentioned in the letter?—Yes.\n\n47. How many did you put up for General Middleton?—Three bales the first day for General Middleton.\n\n48. Go on and tell me what you did?—And a small one for Mr. Reed, and one for S. L. Bedson; but the day following the boat arrived from Fort Pitt, and I was not in the barracks at the time they came in.\n\n49. Who came in?—The boat. In connection with myself, to make my story intelligent, I may say that Warden was quartermaster for the North-West Mounted Police, and there was also a storeman, and I myself was in the capacity of quartermaster of the Home Guards. These furs were put up partly by myself, but chiefly by the storeman. He was there for that kind of work. The day following I was not in the barracks at certain hours in the morning, but in the morning I was told—\n\n50. Never mind what you were told. Tell me what you know then?—I know when I went back there were two boxes of furs put up and addressed to the boat for General Middleton. I was told by these people—\n\nMr. Kirkpatrick.—We do not want that.\n\n51. There were two boxes put up and addressed to General Middleton. What was the address on the boxes?—I do not remember distinctly, but I was satisfied at the time that they were intended—\n\n52. What was there to show they were for General Middleton?—His name.\n\nBy Mr. Weldon (St. John):\n\n53. His name, or anything else?—I would not say: I have not a distinct recollection.\n\nBy Mr. Lister:\n\n54. You swear that General Middleton's name was on the boxes?—I can swear distinctly they were on the packages, but I would not swear that they were on the boxes: but I am satisfied in my own mind that they were.\n\n55. What do you mean by packages?—The bales that were put up first. I wrote the name 'General Middleton' and anything more with my own hand.\n\n56. They put them up into bales the first day and he wrote General Middleton's name on two of these bales himself, and the next day they were put in boxes?—No; additional boxes. I presume so, that they were additional furs. These bales may have been put into the boxes, but I was told that they were not put into the boxes.\n\n57. You were there in the afternoon and saw the boxes—two boxes?—Yes; filled with furs.\n\n58. Where were the bales?—I did not notice them at that moment.\n59. But the day before you put up in accordance with this letter two bales which had General Middleton's name put on them?—Three for General Middleton and one for Reed and one for Bedson. I saw them put up.\n\n60. The day following you saw two boxes?—Yes.\n\n61. Additional?—Additional.\n\n62. Will you swear whether General Middleton's name was on those boxes?—I will not.\n\nBy the Chairman:\n\n63. I do not quite understand your evidence with regard to these bales and boxes. You say that there were certain bales put up and then you saw furs in two boxes next day. What reason have you for supposing that they were additional to the others?—I was going to state that the Quartermaster of the North-West Mounted Police told me emphatically that they were for General Middleton.\n\n64. You say you think that they were additional to the bales. Why could they not have been the bales that were in the boxes?—Because the bales would not fit boxes of that kind. They were not fitted or shaped to fit into square boxes.\n\n65. These furs were loose in the boxes?—They were pretty tightly packed in.\n\nBy Mr. Casgrain:\n\n66. Where did those boxes come from?—They had been used originally for excelsior saddles by the troops. The saddles had been taken out and left in the warehouse.\n\nBy Mr. Tisdale:\n\n67. Do I understand that the covers had been nailed on before you saw them?—No; I saw the furs.\n\nBy Mr. Casgrain:\n\n68. I want to know exactly from you as far as you can recollect what sort of furs were there?—In the bales or boxes?\n\n69. In the bales first and the boxes afterwards?—In the bales I had put up, the majority of the furs were beaver skins. After that fisher, and some otter. The great majority were beaver. I think there were ten fisher skins, or eight put up, and about the same number of otter. Those are very valuable, if you know anything about furs.\n\n69½. Were there any other furs of larger animals?—Not put in the bales. There were in the boxes, bear skins.\n\n70. Were there any other sort of skins of that description, large skins?—No—large skins.\n\nBy Mr. Kirkpatrick:\n\n71. How do you know they were fur skins?—I saw the furs.\n\n72. You only saw them after they were packed?—I saw them on top.\n\n73. What did you see on top?—Bear skins.\n\n74. You did not see what was below?—No.\n\nBy Mr. Lister:\n\n75. It was packed up?—Yes; I saw the top.\n\nBy Mr. Kirkpatrick:\n\n76. You did not examine to see what was below?—No.\n\nBy Mr. Lister:\n\n77. You put up the bales yourself?—Yes; myself.\n\nBy Mr. Wood (Westmoreland):\n\n78. Did you see the bales the second day?—I would not say. I have forgotten.\n\n79. You do not know yourself whether the bales were in the boxes or not?—No.\n\n80. Could they go in?—Not very well. It would be a waste of room to put them in. They were plenty large enough to contain the bales.\n\n81. And other furs?—Yes.\n\nBy Mr. Lister:\n\n82. Were there enough furs there for the filling of the boxes?—From Bremner?\n\n83. Yes. From furs that were there?—Yes; distinctly.\nBy Mr. Casgrain:\n84. Were they all taken?—No.\n\nBy the Chairman:\n85. What sort of bales were they?—Bound up in canvas.\n86. Would that be a very safe way of sending furs?—Yes; it is frequently done from the North-West. In fact, they were simply sent often in bales without canvas.\n87. Would boxes be safer than in canvas?—Well, it is very compact, and there will be less chance of knowing what is inside.\n88. It would be safer you think?—You could pack more up in a box. These boxes were about four feet square and four feet high. You can understand, you could pack more furs in there than by tying them up with sinew or rope.\n\nBy Mr. Kirkpatrick:\n89. What proportion of those packed up furs would they be of all the furs taken from Bremner?—In that order do you mean?\n90. Yes?—I should say a little over half.\n\nBy Mr. Wood (Westmoreland):\n91. In the bales and boxes both?—Yes; perhaps a little over half.\n\nBy Mr. Lister:\n92. That would be the proportion? Taking Bremner’s furs you would say that about half were packed up in that way?—Yes.\n\nBy Mr. Girouard:\n93. Would they be the best?—Yes.\n\nBy the Chairman:\n94. Would one of the boxes hold more than one of the bales?—Yes.\n95. Would the two boxes hold three bales?—Yes.\n\nBy Mr. Girouard:\n96. What was the size of the boxes?—About four feet square and four feet high.\n\nBy the Chairman:\n97. Do you remember seeing the bales?—No; I do not remember seeing them.\n98. Are you certain the bales were not in the boxes?—I am satisfied that no person would put them up in that way.\n\nBy Mr. Casgrain:\n99. Were there any other persons there besides yourself and those men mentioned?—Yes; there were two others who saw more of the furs than I did, perhaps.\n100. What were their names?—Warden was one and Arthur Dorion.\n101. Were they there with you all the time?—Yes.\n102. Did they know anything about this transaction as you do?—Yes.\n103. Where are they?—In the North-West.\n104. Where do they live?—Warden lived in Battleford; Dorion in Regina.\n105. Did they pack up the furs in your presence?—Dorion helped pack up the original bales, and Warden and Dorion, from hearsay to me, packed up the boxes.\n\nMr. Kirkpatrick—You can state only what you know.\n106. Were they packed up in your presence?—You have to discriminate and say whether you mean bales or boxes.\n107. Take bales?—Yes; in my presence and with my assistance.\n108. You did not see them put them in the boxes?—No.\n\nBy Mr. Lister:\n109. But he came back and saw the boxes were filled. What became of the rest of the furs?—I never heard. At least, a part of them I can tell you that they were given out on the orders of the Commanding Officers.\n\nBy Mr. Gormully:\n110. Is this hearsay evidence?—No; I gave them out myself on orders from the Commanding Officers to young officers commanding the corps who wanted one or two or three furs as souvenirs.\n\nBy Mr. Kirkpatrick:\n111. Written orders?—Yes.\n112. Where are they?—I presume Warden has them.\n113. You saw them?—I saw written orders.\nBy Mr. Tisdale:\n\n114. Can you remember what were in the orders? Read us as near as you can recollect?—This is a long time ago; but the general tenor was that \"General Middleton authorizes Captain or Colonel So and So to select four or five or six skins.\"\n\n115. Who would these be signed by?—I think on several occasions, if my memory does not fail me, that it was signed by General Middleton himself. \"Please allow Mr. So and So to take so many furs.\" These orders were filed by Warden.\n\n116. Were these officers commanders of the different corps?—Nobody besides General Middleton and Col. Otter issued orders.\n\n117. He was Commanding Officer there?—Yes.\n\n118. No general officers gave orders?—No; but they got the furs.\n\nBy Mr. Kirkpatrick:\n\n119. You swear that you saw an order signed by Col. Otter?—No; I do not say that. To the best of my knowledge it was signed in that way.\n\n120. Do you swear that Col. Otter signed those orders?—It was not intended that I should say Col. Otter signed those orders.\n\n121. You saw an order purporting to be signed by Col. Otter?—No; but we received orders day after day to issue these furs to different parties, and, as far as my recollection goes, they were signed by Gen. Middleton and Col. Otter. But I am not positive.\n\n122. After you had packed up these furs?—Yes.\n\n123. How many days after you had packed did these orders come in?—I believe General Middleton left next day and they would not come from him.\n\n124. Do you think Gen. Middleton signed any of those orders after he left?—No.\n\n125. You said that orders came in every day, some signed by Gen. Middleton?—No; I did not say anything of the kind. I said to the best of my knowledge they were signed, as far as my memory will serve me, on some occasions by Gen. Middleton and others by Col. Otter.\n\n126. On what occasion were they signed by Gen. Middleton and when by Col. Otter?—I am not sure.\n\n127. He could not have signed any orders after he left. That is General Middleton?—No; he left on the day following. If you will pardon me—if you want to facilitate this matter—I have no desire to keep anything back and I have no desire that you should twist any statement I should make; but if you wish to have those orders you can easily have them by referring to the Quartermaster of the North-West Mounted Police at Battleford, and who, I have no doubt, will bear out any statements I have made before this committee.\n\nBy Mr. Lister:\n\n128. The main point is that orders did come to the men in charge of these furs to deliver furs to officers of certain of the troops, and those officers did take furs out of this pile of furs?—Yes.\n\n129. And furs had been taken previous to packing up, and orders had been given and furs delivered to different officers previous to the day you packed them up?—I am not prepared to say. I do not think so.\n\n130. Then it would be after that day, according to your recollection, that they were delivered?—The majority certainly were.\n\n131. What is your recollection as to furs being delivered before bales were put up for General Middleton, Bedson and Reed?—I have an idea that Gen. Middleton sent some of those orders and I am positive he could not have done so after he left. Therefore, it must have been prior to this letter being received.\n\n132. You are satisfied that orders were signed, or purporting to be signed, by General Middleton, were sent to you?—They were addressed to Warden and handed to me subsequently.\n\n133. Your recollection is that these orders were signed by Gen. Middleton or Col. Otter?—Yes.\n\n134. Now we left off at that part of the statement where you were stating that the furs were packed up. What became of those furs that were packed up? You will remember what boat was running then?—\"The North-West,\" but I am not sure.\n135. This letter says \"we will be down there to-morrow by boat;\" do you remember whether they came down by boat?—Yes; they came down.\n\n136. Who?—Gen. Middleton and his staff, as I understood his staff.\n\n137. Can you speak positively about Gen. Middleton coming there?—Yes; I interviewed him that afternoon on another matter.\n\n138. So that you expected them to come down on the boat as indicated by that letter?—Yes.\n\n139. What became of the furs after they were packed up in the boxes?—I am not in a position to say from actual knowledge.\n\n140. You are not in a position to say?—No.\n\n141. Did they leave the barracks?—Yes.\n\n142. In charge of whom?—I did not see them leave—only from hearsay.\n\n143. You know as a fact they were taken from the barracks?—Yes; I know they were taken from the barracks.\n\n144. You cannot say where they went to?—No.\n\n145. Did you ever have any conversation with Mr. Reed about this letter—the letter mentioned in the charge—at Battleford?—Nothing directly. Mr. Reed came into the office of the quartermaster's store afterwards, and I gathered from the conversation, I think he admitted, that he had written a letter.\n\n146. Were you there?—Yes.\n\nMr. Kirkpatrick—What does he mean by afterwards?\n\nBy Mr. Lister:\n\n147. After the furs were packed up and shipped?—That is what I mean.\n\n148. Mr. Reed was in the quartermaster's place and admitted he had written a letter?—Not in those words—by inference only.\n\n149. What do you mean by inference only?—The subject was brought up that the furs had been shipped and Warden mentioned that he had shipped the furs, in consequence of a letter received by him—the letter written by Mr. Reed. Reed did not say he did not write it.\n\n150. Warden told him he had shipped these furs in accordance of a letter received from Reed, and Reed did not deny he had written a letter?—Yes.\n\nCross-examined by Mr. Girouard:\n\n151. You reside at Battleford?—Yes.\n\n152. When did you come down here?—Two months ago.\n\n153. What brought you down here?—I came down here representing Bremner, to endeavor to get this matter settled by the Government.\n\n154. You are the agent of Bremner?—Yes; practically.\n\n155. Have you any interest in this matter?—No, sir.\n\n156. If the claim is settled by the Government, do you expect to share by it?—Not directly.\n\n157. Directly, from Mr. Bremner, do you?—No; I do not.\n\n158. You came down here in Bremner's interest for nothing?—I expect my expenses will be paid if he receives it.\n\n159. That is all you expect to have?—Yes.\n\n160. What is your business in Battleford?—Contractor.\n\n161. Contractor for what?—Contractor of everything.\n\n162. Do you contract for the settlement of claims, too?—No, not that altogether.\n\n163. Can you say you saw that letter written by Mr. Reed. Excuse me, did you give the information to Mr. Lister in connection with this case?—Yes.\n\n164. You are the one who gave the information—\n\n165. Is Bremner in the city?—No, sir.\n\n166. Has he come to the city during the winter?—No, sir.\n\n167. You represent him?—He is represented by a solicitor.\n\n168. You gave your instructions to the solicitor?—He sent his instructions practically to his solicitor through me.\n\n169. Have you a power of attorney from Bremner?—His solicitor has. You say Mr. Reed sent—\nBy Mr. Kirkpatrick:\n\n169. Have you got a power of attorney?—Yes.\n\n170. Produce it at the next meeting?—I understood it was in my name.\n\nBy Mr. Girouard:\n\n171. Will you produce that power of attorney between now and the next sitting?—Yes.\n\nBy Mr. Kirkpatrick:\n\n172. You say you have no interest in this claim?—No.\n\n173. Has the solicitor an interest in it?—Nothing beyond his fees.\n\n174. Nothing beyond his fees? He made no arrangement with Bremner if he gets a certain sum you will get what is over?—No, sir.\n\n175. Nor the solicitor?—No, sir.\n\n176. Was there some such arrangement talked over?—Yes, there was. I refused positively to have anything to do with it in that way.\n\n177. What did Bremner offer you?—I think five per cent. of his claim. I would not take it in that way.\n\n178. Did he offer it to you?—He might have made such an offer. He said he had offered through Mr. Macdowall representing that district to accept $3,500. The man is starving. He offered to accept anything at all rather than not get anything. He said he would take $3,500, and he would give anybody what they could make over, and I positively refused to accept it in that form.\n\nBy Mr. Girouard:\n\n179. Why did you refuse?—I did not think it was right.\n\n180. Do you think it was not legitimate?—Yes, I do.\n\nBy Mr. Kirkpatrick:\n\n181. How are you employed in Ottawa?—As a sessional clerk in the buildings.\n\nMr. Lister.—He is a perfectly respectable man.\n\nBy Mr. Girouard:\n\n182. Now you say you saw the letter from Mr. Reed to Mr. Warden giving instructions to send some bales to General Middleton and others—you saw the letter?—I saw the letter.\n\n183. You recollect you say the letter mentioned in the charge is in substance the original you saw?—Yes.\n\n184. Will do undertake to swear that in that letter Reed did not mention that General Middleton had confiscated these skins or furs?—Well, I do not remember that term being used. I am satisfied if they were confiscated they should have been confiscated under proper and fair notice of confiscation.\n\n185. I am talking to you about the letter?—I do not remember.\n\n186. Was it mentioned in Battleford, where you were at the time, that General Middleton had confiscated these furs?—No, sir, I never heard it.\n\nBy Mr. Kirkpatrick:\n\n187. You never heard it there?—I never heard it.\n\n188. Did you ever state it was generally understood there that the General had confiscated these goods?—Not to my recollection.\n\n189. You never stated that?—I do not say I did not state it, I say I do not remember it.\n\n190. I want to know if he remembers making a statement that it was generally understood that General Middleton had confiscated the furs?—I think I can say safely now that the people who did not understand it might have thought so.\n\n191. Did you write such a letter as that?—I do not know if I have written a letter.\n\nBy Mr. Girouard:\n\n192. To whom? We want to see how far the witness is worthy of belief?\n\nMr. Lister.—If you want to contradict the witness as to writing you must show him the writing.\nMr. Kirkpatrick:\n\n193. It was a letter to Colonel Morris, of the North-West Mounted Police at Battleford. Did you state that it was generally understood that General Middleton had confiscated the furs?\n\nMr. Girouard.—What is the date of the letter?\n\nMr. Kirkpatrick.—It was 1888.\n\nMr. Girouard.—Where from?\n\nMr. Kirkpatrick.—Battleford.\n\nWitness.—It is quite possible, I do not remember. Colonel Morris came to me and wanted me to set out the facts of the case and make it as mild as possible when I wrote the letter.\n\n194. To make it as mild as possible?—No, not that; that is the inference I got.\n\n195. You can make it strong at one time and mild at another?—Most decidedly. You can color one way or another.\n\nMr. Casgrain—I rise to a question of order. The witness is here and as long as he gives his evidence he must be protected.\n\nMr. Kirkpatrick.—This is the extract of the letter:\n\n\"Next day, Monday, Mr. Reed called at the store and asked Warden for the order authorizing the packing of the furs. Warden professed not knowing where it was, keeping it I suppose for his own protection, as there was no other order either for receiving, storing or disposing of them, and it was generally understood that General Middleton had confiscated the furs.\"\n\nMr. Lister.—The letter has been read and it is now before the Committee. He cannot read an extract and keep back the letter.\n\nMr. Weldon (St. John).—The witness can be asked whether he made a statement in writing. The practice is that the judge in the court room may require the person to say if he has the original in his possession or if it can be produced. It seems to me if it is a copy, it is rather objectionable to read from the copy.\n\nBy the Chairman:\n\n196. Are you prepared to produce the original letter? I am prepared to say we can produce it. We want the whole of that copy.\n\nMr. Kirkpatrick.—The witness was asked if the word \"confiscated\" was used in that letter. If I remember right, the answer was, he did not remember; he had never heard the furs were confiscated goods, which ought to be done in some formal manner. What I asked him then was, if it was not generally understood in Battleford if they were not confiscated, and he said—no. Then I asked him if he ever made that statement.\n\nMr. Lister.—Reading from this letter?\n\nMr. Kirkpatrick. Yes.\n\nMr. Lister then read the letter, as follows:\n\n\"BATTLEFORD, N. W. T., 16th March, 1888.\n\nSir,—In reply to your request for a statement from me on a quantity of fur taken from one Charles Bremner in 1885, I have to say:\n\nDuring the rebellion of 1885 while acting as Quartermaster of the Home Guard I was by order of Col. Otter assisting the Quartermaster Sergeant of the North-West Mounted Police to issue rations to the settlers of this district, and that on the evening of Tuesday, 26th May, several loads of fur were brought to the police store from Mr. Bremner's camp. They were placed in a position by themselves and covered from view to ensure protection from theft.\n\nOn Saturday the 4th July, a messenger arrived overland from Fort Pitt, bearing a letter signed Hayter Reed, which stated that he (Reed) was ordered by Gen. Middleton to have Warden (the Police Quartermaster Sergeant) put up several packages of the furs placed in the store, one for S. L. Bedson, one for Hayter Reed, one for some name that I do not remember, and two for the General.\n\nWarden being busy asked me to have the fur put up, which I did, assisted by one Dorion, a storeman, and addressed them as above. Next morning the 5th, the boat...\"\nwith Reed and the General arrived from Fort Pitt; the General and Reed went to the Barracks.\n\nThe General was not satisfied with the quality of the furs prepared for him and had the packages supplemented by a large saddle box filled with choice furs, which with the packages were sent to the boat.\n\nThere were a few remnants of fur left; but I am under the impression that they were given out on the order of the General.\n\nNext day, Monday, Mr. Reed called at the store and asked Warden for the order authorizing the packing of the furs.\n\nWarden professed not knowing where it was, keeping it I suppose for his own protection, as there was no other order either for receiving, storing or disposing of them, and it was generally understood that General Middleton had confiscated the fur.\n\nI am, Sir, yours respectfully,\n\n(Signed) RONALD C. MACDONALD.\n\nTo Col. Morris,\nNorth-West Mounted Police, Battleford.\"\n\nMr. Lister.—I put that letter in.\n\nMr. Kirkpatrick.—I submit that is irregular. I am not objecting to it going in; but in cross examination you have the right to ask whether a certain portion of a letter was written, but the whole letter need not be put in.\n\nBy Mr. Kirkpatrick:\n\n196. I would like to ask the witness, did you see the General at the stores after the boat arrived?—No.\n\n197. Then that statement is not based upon your own knowledge?—No.\n\n198. He puts it in that letter that the General came and was not satisfied with the furs. Now, you never saw him and never heard him make that statement? No.\n\nBy Mr. Gormully:\n\n199. You say about one-half of the furs were taken away? Yes; I should judge that.\n\n200. What became of the other half?—I have explained of the other half that some orders were given to other officers. Of the balance left in the stores, I do not know.\n\n201. Was any portion returned to Bremmer?—I do not know.\n\n202. What is the quantity of the furs you saw in the camp first?—I can only judge.\n\n203. Did you count them?—No.\n\n204. You did not examine them one by one?—No.\n\n205. You cannot tell exactly the value?—No.\n\nBy Mr. Tisdale:\n\n206. How do you fix your value? You say you saw them packed in bales?—Yes.\n\n207. How do you account for their value?—After they were brought into the barracks they were brought to me and I placed them in rows. I should judge at least 50 or 100 beaver skins were packed together. Each were kept separate.\n\n208. What did beaver skins bring there by traders at that time?—$7 to $8.\n\n209. They would pay that for them in bulk at Battleford?—Yes, $7 to $8.\n\nBy Mr. Kirkpatrick:\n\n210. Were any furs taken by any persons before the General came down?—No.\n\n211. There were a great many people in and out of the stores?—Yes.\n\n212. You do not know whether any persons helped themselves?—I know they could not. The inner office was at one end and there were large doors that were not opened except when Warden, Dorion or myself were in there.\n\n213. If Mr. Warden says he cannot be responsible for them and says some were taken, you do not agree with him?—I was not there all the time. I was in and out. I differ in my judgment from that.\n\nAfter some discussion relative to the summoning of witnesses the Committee adjourned.\nHouse of Commons, 1st April, 1890.\n\nCommittee met. Mr. McNeill, in the Chair.\n\nStuart Henderson, Barrister, called, sworn and examined:\n\nBy Mr. Kirkpatrick:\n\n214. Have you, Mr. Henderson, in your possession any document signed by Mr. Bremner relating to these furs?—I think I have; I have not looked at the papers. There are a number of papers in my office in connection with the North-West.\n\n215. Is there a power of attorney?—I think there is a power of attorney, from Bremner to Mr. McDonald.\n\n216. Is there an agreement as to the amount he will take?—No. At least, I am not sure. I have several papers from different parties in connection with this. I think I have some of them in my office.\n\n217. Will you produce any agreement, power of attorney or papers?—I will produce any papers that does not reflect upon the interest of my client.\n\n218. This is not the interest of any client?—Yes. Mr. Bremner is my client, and I have papers at the office. I refuse distinctly to disclose, or I reserve that right distinctly. I might not show the papers, after I bring them.\n\nCol. Tisdale.—If you bring them to the Committee, the Committee will settle the question then. You bring the papers, and we will decide afterwards.\n\nBy the Chairman:\n\n219. Is there anything to prevent your getting the papers now?—I won't present any papers without consulting my client. I am a solicitor, you know.\n\nGeneral Middleton then made the following statement, after being sworn:\n\nGentlemen,—My object in asking the Government to grant this inquiry, was that, in justice to myself and others, the real facts of the case should be made public officially, and with that object, with your permission, I beg to make the following statement:—I must premise by pointing out that, owing to the lapse of time, nearly two years since the occurrences took place, I have experienced considerable difficulty in recalling all the circumstances connected with an affair, which, I confess, to me then, was considered of little importance; still I think the following embraces the principal and most important points. After making a prisoner of Poundmaker at Battleford on the 26th May, 1885, I was informed some half-breeds had come in from his camp and that there was some reason to believe them to be rebels, as some of them had been recognized as having fought against us at Cut Knife. Shortly after (the same day, I think) it was reported to me that the people about were carrying off furs belonging to these half-breeds, and it was suggested that the furs should be sent to the Police barracks, which I believe I ordered to be done and the matter passed through my mind. I may remark that, to the best of my belief, I never went near the half-breed camp, nor did I see nor speak to Bremner nor his clerk, though it is possible I may have done so. Two or three days after this I left for Fort Pitt, and started from there in pursuit of Big Bear; returning, finally, to Fort Pitt on the 19th June, 1885. It was some time between then and the beginning of July, that I received some information confirming the opinion that those half-breeds who had come into Battleford from Poundmaker's camp were rebels. I cannot remember exactly what all this information was but I remember that a rifle, belonging to one of the men killed at Cut Knife or the Eagle Hills, had been found in the possession of this very Bremner, and it was probably then that I ordered the whole of these half-breeds to be sent to Regina, and that Mr. Hayter Reed who had been down\nto Battleford, reminded me that the furs were in the Police barracks, and asked what was to be done with them. I cannot pretend to remember all that passed on this occasion, but I have no doubt now that I ordered the furs to be confiscated, and that I authorized some of my staff to take some of the furs and said I might have some myself, perhaps. I did not know what orders were sent to Battleford after this conversation, and from that time all thoughts of the furs passed from my mind. On arriving at Battleford on the 5th July, I landed with the funeral party of the late lamented Colonel Williams, and after the service was over I returned at once to the steamer, accompanied by Lieut.-Colonel Smith (now commanding at London, Ont.) and some other officers whose names I cannot remember now. I did not go to the Police stores at all, nor did I see or select furs whilst at Battleford; and any statements that have been made to that effect are wholly untrue. I remained on board until the steamer left for Prince Albert in the afternoon. If any furs were put on board the steamer at Battleford addressed to me it was done without my knowledge, and I can positively say that I never got such furs or any of them, and, to the best of my belief, never saw them. I fully believed at the time that, having directed the confiscation of furs belonging to a rebel, I was not exceeding my powers in allowing some of my staff to take a few of them as mementoes of the campaign, or even in taking some myself. The letters sent will show by whose orders the furs were taken, and the receipts will show the amount taken, the principal part of the furs remaining with their original custodian, as, I believe, can be proved by the late Quarter master Warden. I may add that the statement made the other day by Mr. McDonald, that he believed the remainder of the furs were disposed of by numerous orders for young officers to be allowed to have some, and that these orders were signed some by myself and some by Lieut.-Colonel Otter is, I believe, quite untrue. Col. Otter has authorized me to state that he never signed any such order, and I say that I, myself, never signed any. It will be remembered that I left Battleford by steamer on the evening of the 5th July, and it is not, I believe, insisted that the orders were given before that date. To the best of my belief I have never at any time received any of the Bremner furs. If it is in order, I should like also, as other cases were referred to, to make the same statement about the horse that I was said to have appropriated.\n\nCol. Tisdale—If the General makes a statement it will open up the whole question.\n\nMr. Lister—I have no objection to the General making a statement as to the Batoche furs, and the charge of having got furs at Batoche which were shipped from Prince Albert.\n\nThe Chairman—We cannot inquire into it.\n\nMr. Lister—If the statement is made I shall have to go into it, that is all.\n\nCol. Tisdale—It has already been decided that we cannot go into that.\n\nThe Chairman—That has been fully discussed and the Committee has already decided that we cannot go into that.\n\nMr. Casgrain—It has been decided that we cannot go beyond the range of Bremner's furs.\n\nMr. Weldon (St. John)—If the statement is made it is open to the parties to contradict that statement.\n\nGeneral MIDDLETON was then cross-examined:\n\nBy Mr. Lister:\n\n220. Who were your aides at Battleford and during the campaign, General Middleton?—Capt. Wise was until he was wounded, and then Capt. Freer.\n\n221. Was Bedson in any way employed under you?—Yes; he was employed as chief of the transport, I think that was the title he had.\n\n222. Was Mr. Reed filling any position?—Yes; Mr. Reed was also attached to me. He was lent to me by Mr. Dewdney and attached to my staff. He was with me for his knowledge of the country and his knowledge of the Indians.\n\n223. Were these two gentlemen with you from the time you left Fort Pitt up to the time you went to Battleford?—From what time?\n224. From the time you left Battleford to go to Fort Pitt?—They were both with me, to the best of my belief.\n\n225. Were they both with you when you returned to Battleford?—On my way down?\n\n226. Yes?—I think so. Yes; to the best of my belief, they were, as far as I can remember.\n\n227. You knew that Bremner was at the Fort?—When I returned?\n\n228. At the time when the furs were taken?—I knew he was there; I do not think I knew exactly whether he was or not.\n\n229. Do you remember who told you, who communicated the fact that Bremner was there?—After he had come in?\n\n230. Yes?—I do not know. It was reported to me by some one of my staff that those half-breeds were coming in from Poundmaker's band. I cannot remember who it was.\n\n231. Was it, or was it not, reported that there were a quantity of furs there?—Yes; I have stated that.\n\n232. What was the report made to you as to the furs?—Simply that those men had a lot of furs and they were being taken away.\n\n233. You ordered, what, to be done?—As far as I can remember, I suppose I must have ordered them to be taken to the Police barracks.\n\n234. Did you or did you not?—I do not remember, but I have not the slightest doubt, I ordered them to be taken into charge.\n\n235. How long after you ordered them to be taken in charge, assuming you did make such an order, or was it before you ordered the arrest of the half-breeds?—That I cannot say at all. I suppose it must have been about that time; I do not know whether he was left at his camp or not. I left two days afterwards.\n\n236. It would be before you left Battleford?—I think so—yes.\n\n237. Were these half-breeds arrested and taken to Regina?—I know as to that only by hearsay, I never saw them again.\n\n238. You ordered their arrest?—I believe I did. I must have done it, because I was the only person, I fancy there, who could have done it.\n\n239. Do you know of your own knowledge they were kept in prison at Regina?—I do not know anything about that.\n\n240. You left Battleford and went where, after taking in these furs?—I went to Fort Pitt.\n\n241. Did Reed and Bedson accompany you?—Yes, I think they both did. Bedson, I know, did. And I think Reed went up with him.\n\n242. You are positive about that?—Yes; I think so.\n\n243. Now, was anything said at Fort Pitt about these furs of Bremner; the furs that had been taken from the half-breeds that had been brought into Battleford?—Not until I had returned to Fort Pitt, after the pursuit of Big Bear.\n\n244. How long were you engaged in that?—I can easily tell by referring to some of my reports. I must have been a fortnight, or something of that sort.\n\n245. Then you returned to Fort Pitt?—Yes.\n\n246. Then the conversation took place respecting the furs?—Yes.\n\n247. Between whom did the conversation take place?—As far as I can remember, it was between Mr. Hayter Reed and myself, and some of the others. I suppose there were some of the others present.\n\n248. What was the conversation?—Simply that after having talked about those men being rebels, he reminded me that the furs were there. They were, he said, in bales in the Police barracks. He had been down to Battleford, I think.\n\n249. Reed had been down to Battleford, and he reminded you that the furs were there?—Yes.\n\n250. And those men having been proved to be rebels you decided that they were rebels?—Yes.\n\n251. There was no proof about it?—No.\n\n252. You ordered, what?—Some furs to be confiscated.\n253. In what manner did you indicate that order—by writing or by word of mouth?—By word of mouth.\n\n254. Was there any writing signed by you, directing that those furs should be confiscated?—Not that I know of.\n\n255. Did you give an order respecting the furs in writing?—Not to my belief. No; I did not.\n\n256. Did you direct Hayter Reed to give any orders?—Well, I told him that the furs were confiscated. He then asked what was to be done with them, and then, as far as I can remember, as I have said, some of the members of the staff might have some—they said they supposed they might have some.\n\n257. What members of the staff were to have them?—Well, the only ones I can remember who were there, were Mr. Hayter Reed, Bedson and Freer, I think.\n\n258. Did you say Freer was to have any of them?—I do not know that I said personally whose name.\n\n259. Do you remember whether you named Reed or Bedson?—I was talking to them.\n\n260. The furs were to go to them?—Yes.\n\n261. And they were to go to yourself?—I have no doubt I said I might as well have some too.\n\n262. You might as well have some too?—Not the slightest doubt.\n\n263. Did you ask Mr. Hayter Reed to instruct the man at Battleford as to what quantity he should put up for you, and what quantity he should put up for himself and Bedson?—No; I do not think I gave any directions at all further than the general ones. I had a lot to do, and my staff did everything regarding that, and after that the matter went away from my mind.\n\n264. Will you say, General, you did not tell Hayter Reed to have two boxes put up for you?—To the best of my belief I did not tell him that.\n\n265. Was there anything passed between you and Hayter Reed on that occasion or any other whereby it was agreed or understood that two boxes were to be put up for you?—Well, no; not that I can remember.\n\n266. Was the letter that was written by Reed, written in your presence? It was in a tent, was it not? Was it in a tent?—I do not know. I was in a tent.\n\n267. Was the letter written in a tent?—Not that I know of. I have not the slightest remembrance about the letter, or what was written or anything about it.\n\n268. Did Reed communicate to you at all about the quantity of furs at the fort?—No; merely they talked generally as to the quantity.\n\n269. As to the quantity?—As to the quantity.\n\n270. Did you know that Reed had sent the letter off by a courier?—Well, I certainly cannot remember. In the first place there was no other means of sending letters that were sent.\n\n271. Do you remember the fact?—No; I do not. I do not think he ever thought it necessary to tell me.\n\n272. You were to get the furs? Was anything said as to when they were to be delivered to you?—Not that I remember at all.\n\n273. You were going down on the boat, of course?—I was going down on the boat. Of course, I do not remember what day it was exactly.\n\n274. Was there anything said about the furs being ready for the boat as it went down?—Nothing at all that I can remember.\n\n275. Have you any recollection, General, as to what took place on that occasion at all, more than the general conversation that there was a quantity of furs, and you would take some of them and some of them might be put up for yourself and staff?—I have no general recollection of anything else.\n\n276. That is a general recollection?—That is a general recollection.\n\n277. You do not pretend to tell the Committee what was said literally on that occasion?—No.\n\n278. Now, if Reed did write a letter directing the man in charge, Warden, to put up these furs, two for General Middleton, one for Bedson, one for himself? You\nwill not say that these were not instructions given by you?—No; I will not say he was not justified in giving those instructions.\n\n279. You won't say that these were not instructions given by you?—I never gave any instructions that I was to have two boxes or two anything.\n\n280. If Hayter Reed wrote such a letter, he wrote it on his own responsibility without any instructions from you?—I considered he had received instructions. That I would confiscate the furs and might have some of them.\n\n281. Now, I suppose you are satisfied now you had no power to confiscate the furs?—Well, I suppose virtually, really and legally, I had not.\n\n282. When did you acquire a knowledge of that?—Only lately. I do not think I ever considered the point at all.\n\n283. You give the Committee to understand that at the time you gave these directions you believed you had the right to confiscate the furs—that is, to appropriate them to your own use?—Yes. I thought I was the ruling power up there, owing to the state of the country, owing to the state of war, that I could do pretty much as I liked, as long as it was within reason. I did not think it was unreasonable to allow a few of those furs to be taken and the bulk left behind.\n\n284. Was the bulk left behind?—That I do not know.\n\n285. You did not take the trouble to inquire?—I never asked any questions about it.\n\n286. Were you on the boat that day?—I came down on the boat.\n\n287. Did you see, or did you not see, any parcels there on board addressed to you?—No; distinctly not.\n\n288. Did you speak to either Reed or Bedson?—No; I did not. I do not think I saw Reed again; he was left behind.\n\n289. Did you speak to Bedson?—No.\n\n290. Nothing was said to Bedson, coming down?—No.\n\n291. Did Bedson and Reed go to the fort?—I do not know.\n\n292. Did you go to the fort?—I went wherever the funeral service was read.\n\n293. That was all?—Yes.\n\n294. Nothing said at all coming down—no mention made about the furs?—No; not that I remember.\n\n295. All that you remember about the furs is what took place in your tent on the day this letter was written by Reed?—That is all I remember.\n\n296. Did you give any receipt to Warden for the furs?—Who, me?\n\n297. Yes?—Certainly not, that I know of. I never did.\n\n298. Did you authorize anybody to give a receipt for them?—I do not know. I think that when I told them they could take the furs, I rather think I said they would have to give a receipt. I rather think I told them they would have to give a receipt.\n\n299. That they would have to give a receipt. Did you, prior to meeting on the boat that day from Battleford, ever give any order for furs to any of the officers?—No.\n\n300. Did you ever authorize anybody to give orders?—No, not to the best of my belief; I never did.\n\n301. Did you know that officers were getting furs there from time to time?—No, I did not.\n\n302. Do you know how many furs were left?—I had not the slightest idea.\n\nBy Mr. Casgrain:\n\n303. Did you know, as a matter of fact, whether any of your officers had any of these furs?—No, it was never told to me or brought to my notice.\n\nBy Mr. Lister:\n\n304. Where were the furs to go, General. You were on your way to Ottawa, I suppose?—Yes, I was on my way to Winnipeg.\n\n305. To Ottawa via Winnipeg?—I did not go to Ottawa then. I went to Regina first and then to the Rockies.\n\n306. Where were these furs to go?—Which furs?\n307. The furs of Bremner: the furs at Battleford?—I left them there, I never thought any more about it.\n\n308. Your instructions were to put up some furs for yourself, some for Reed and some for Bedson. Where were your furs to go—where were they to be taken to?—I do not know. I never gave any orders for them to be taken anywhere. I supposed they would be put on board the steamer.\n\n309. For Ottawa?—No, for Winnipeg: I was only going to Winnipeg.\n\n310. Did you ever make any inquiries about these furs?—No; I did not.\n\n311. Never inquired of the captain of the boat, coming across the Lake?—I never even saw them. My baggage was looked after by my aides-de-camp.\n\n312. Who were they?—Both were on board then—Wise and Freer. They would look after my baggage and make any inquiries or anything of that sort.\n\nBy Mr. Casgrain:\n\n313. Would they know about these two bales spoken of—whether they were on board?—Well, I should think so.\n\nBy Mr. Lister:\n\n314. Then you never saw the furs, to your knowledge?—Never.\n\n315. You have no personal knowledge as to whether they were put on the boat or not?—None whatever.\n\n316. The directions were that the furs might be put up some for yourself, some for Reed and some for Bedson?—That is the original.\n\n317. These were the original instructions. Did you sell furs to John Martin & Co., or any other person in Montreal?—No, I bought some from John Martin.\n\n318. Did you sell any?—No.\n\n319. Did you send any to him?—No, not that I know of. I never had anything to do with Martin in selling furs.\n\n320. Did you to Henderson & Co.?—I never sent any there at all.\n\n321. Did you ever authorize any to be sent?—I had some, I sent to Devlin; I do not know what he did with them. He told me he was going to send them to New York, I think.\n\nBy Mr. Casgrain:\n\n322. What Devlin is that. Is that the Ottawa man?—Yes.\n\nBy Mr. Lister:\n\n323. Were they sold to him?—I do not know—I do not know what Devlin did with them.\n\n324. How did Devlin get them?—I sent them to him.\n\n325. Did you sell them to him?—To sell them for me.\n\n326. Any in Toronto?—I do not know. I have not the slightest idea. I had some minks, and I did not want them. I had a great many of them, and I sent them down.\n\n327. Did you make presents of furs to different people?—Yes, a few.\n\n328. Did you telegraph to Col. Morris at any time to dispose of the furs left at Battleford?—No.\n\n329. You do not know whether your aides did or not?—No, I do not think so.\n\n330. Of course, you do not know how many furs were left at Battleford?—Not the least.\n\nBy Mr. Casgrain:\n\n331. What quantity of furs did you deliver to Mr. Devlin?—I do not know. I bought a lot of furs when I was up there, and had a great number given to me. There were some that I did not want to use—they were of no use—and the money I got from these was to pay for the dressing of the others.\n\n332. Were there any of the Bremner furs?—None whatever.\n\nBy the Chairman:\n\n333. I just want to ask the General whether, in point of fact, you knew that two bales of furs had been sent?—No, I did not.\n\nBy Mr. Kirkpatrick:\n\n334. You said that the furs you sent to Devlin were some that you bought in the North-West, and some had been given to you?—Yes.\n335. You are sure none of them were Bremner's furs?—I am perfectly certain.\n\nBy Mr. Lister:\n\n336. Why are you certain, General?—Because I know the exact number of the furs I bought and I know the exact quantity, and I also know that the furs I did get were most of them very bad and worth very little.\n\n337. The Bremner furs were good ones, were they?—I was told they were. And moreover, another thing which made me certain was, that there were beaver in Bremner's and I had very few beavers indeed.\n\n338. Bremner had not many beaver?—And I had no valuable furs whatever.\n\n339. You had 400 to 450 skunks?—Yes.\n\n340. 350 to 400 minks?—I do not know exactly.\n\n341. 500 to 600 muskrats.\n\nMr. Kirkpatrick—They were not Bremner's.\n\nThe General—I happen to know that I had forty-three and a-half beaver.\n\n342. You said the only furs you brought down were such as you had bought or which were given to you?—Yes.\n\n343. Do you state here that you did not get a quantity of furs from Prince Albert—the Batoche furs?—Part of those furs given to me were those taken at Batoche.\n\n344. Who gave them to you?—That is the thing I want to know now.\n\nMr. Lister—My instructions are that a cart load of these furs were taken from Batoche to Prince Albert, and they got into the hands of the General.\n\nMr. Kirkpatrick—It is very unfair to make a statement of that kind.\n\nGeneral Middleton—There is not the slightest truth in that.\n\nCol. Tisdale—If he asks the General about any other furs, in justice to himself, the General ought to be allowed to make a full statement.\n\nMr. Weldon (St. John)—Certainly, a full statement.\n\nCol. Tisdale—Mr. Lister stated if he was allowed to do that he would go into the whole question.\n\nThe General—I think I can make a statement and there will not be the least necessity to call witnesses to attempt to disprove it.\n\nMr. Lister—I wish to ask the General about the Batoche furs. If the Committee say they do not desire it, why that is an end to the matter.\n\nCol. Tisdale—We have already decided that that is irrelevant to this case.\n\nMr. Lister—If General Middleton wants to make a statement regarding the Batoche furs, I am quite content he should do so.\n\nGeneral Middleton—I would like very much to make a statement, merely with a view that this fact has been made public.\n\nBy Mr. Lister:\n\n345. Did you, or did you not get a quantity of furs at Prince Albert or Batoche, or at any other point in that portion of the country?—I afterwards did, but I would like to relate to you how. After Batoche was taken, of course, I am perfectly aware that there were furs and things taken at Batoche, and that I do not think is to be wondered at in the circumstances of the case. In the middle of hard fighting, the men found these things, but the private houses and property of loyal people, anywhere near the place, was not touched. But I did not consider it was my duty to protect the property of the rebels that we had just been fighting hard with. Had the men of the force not helped themselves to these things, they would have fallen into the hands of the teamsters and camp followers, who were always around. They would have carried everything off, and therefore nothing would have been safe. But all the property of the women and children who were left behind, and I suppose, the fighters put their most valuable property in the camps, where these women were to be taken care of, and these were taken care of by our men. I would like to take this opportunity of saying that I am perfectly certain in a general way that the conduct of the force during that campaign was most creditable. They did nothing that would not have been done by the highest trained troops in the world, and they behaved in that way. I am borne out in this, to a considerable degree by letters which I have, and which I was\nvery glad to get from Bishop Grandin. As I say, there is no doubt there were furs. When I got to Prince Albert, my aide-de-camp, who was wounded and put on the steamer, told me at Prince Albert, that somebody had put a box on board the steamer and said it was for me. I asked him, \"Do you know what it is?\" and he said, \"Yes, it is furs,\" and I said, \"Who put it on board?\" and he said, \"I have not the slightest idea; it was brought to me. It was a heavy box which was put on board, and I was told it was for you.\" I asked, \"where it was?\" and he said it was at the house he was staying at. He was staying at Macdowall's.\n\n346. Who was this person who gave you the information?—Captain Wise. I left it there with him. Of course, I supposed it was some of these furs from Batoche, but I did not trouble myself about it. It did not much matter when they were furs—I did not see them and went away. Afterwards he told me he had opened the box, to put in a buffalo head which Mr. Macdowall had given me, and he opened the box to put it in, then closed it, and afterwards sent it by team to Qu'Appelle, where it went down to await my arrival at Winnipeg. That was the box that was stated to have been sent to Qu'Appelle. That is all I know about it.\n\n347. Did that box come down?—Yes, I got that box. That box held those furs which you have down there on that paper.\n\n348. You did not know who put them up for you?—I have not the slightest idea—I have not the slightest doubt it was done by some men of the force who got them, and they thought it was a nice compliment to pay me, so they put in on board. I did not want to ask about it.\n\n349. The box came to Ottawa, and you got them, I suppose?—Having got so far as that, I would like to be allowed to touch also on the horse business. I was accused of appropriating a horse. I say it is perfectly true I used a horse that was taken—one of the rebel horses taken at Batoche. I used it during the rest of the campaign. You must remember that, as Major General in the field, I was entitled to five horses, whereas I contented myself with one, and I found the work so hard on this horse that I must get another horse, and I gladly took possession of this horse that was brought to me, so I used that horse all through the rest of the campaign. As soon as the campaign was over, I brought it down to Winnipeg, and it remained there while I went to the Rockies, and when I came back, and was starting from Winnipeg for home, I left the horse there. It was handed over to the Government auctioneer and sold. The horse I got is not a white horse. It was really a light iron-grey.\n\n350. Did you bring him to Ottawa?—No; I left him at Winnipeg.\n\n351. Did you bring any horse to Ottawa?—My own horse.\n\n352. That you took up?—I did not take any up. I got them all there.\n\n353. There were half a dozen horses?—No; certainly not.\n\nBy Mr. Casgrain:\n\n354. Do you know to whom that horse belonged?—I do not know. I do not know whether the man was killed at Batoche or not.\n\nBy Mr. Lister:\n\n355. The man who had the horse told you it was a horse he had found on the plains?—No. He said it was found in the stable with another horse belonging to one of my officers, who at Fish Creek, had got off his horse and lost it and the enemy had got hold of it, and the officer who brought it to me said he found two grey horses in the stable.\n\n356. Having lost one horse, he took two?\n\n357. Was it Captain Wise who told you these furs had been put on board at Prince Albert?—They had been put on board at Batoche.\n\n358. Were they not taken up at Prince Albert?—Captain Wise was on his way up from Batoche and took these furs with him. They were put on board and he went up to Prince Albert. Being wounded he remained at Prince Albert.\n\n359. Captain Wise took the furs up to Prince Albert?—Yes. They were put in a box for me, so Captain Wise told me.\n\n360. He was stopping at Mr. Macdowall's?—Yes.\n361. These furs were taken from Batoche to Prince Albert?—Yes; he took them out of the steamer.\n\n362. Who put them on the steamer?—That is what he says, he does not know—he never knew who put them on the steamer. He was told by one of the crew, who said, “There is a box for the General on board.” When he heard this it was the first he knew of it. I never gave any orders, and never had the remotest idea of it.\n\n363. The furs belonged to Batoche in the first place?—I suppose so.\n\n364. You went to Prince Albert with Captain Wise?—No; I did not.\n\n365. Did Captain Wise go to Prince Albert?—Captain Wise went on board the steamer, and I marched.\n\n366. These furs went to Prince Albert on the steamer?—Yes.\n\n367. Captain Wise told you the furs were on the boat?—I never saw Captain Wise on the boat.\n\n368. He told you the furs were on the boat?—Captain Wise told me he had landed these furs at Prince Albert.\n\n369. That he had landed the furs?—He told me the whole of this story, that some one had put these furs on board. He did not know who they were, and he had brought them on.\n\n370. He had never taken the trouble to look for them?—I fancy he must have known they were furs.\n\n371. That you might have them?—He said they were put on board for me.\n\n372. Did not say who put them on?—I did ask him who put them on, and he said he did not know.\n\n373. What quantity of furs were they?—I have got a list of them.\n\n374. A considerable quantity?—Yes; only they were a bad, inferior fur.\n\n375. (Producing a list.) Were these the ones?—I think so, what you read there.\n\n376. You said you authorized some one to sell some for you?—These were the minks.\n\nBy Mr. Weldon (St. John):\n\n377. Is it the same steamer that went down from Battleford?—It is a different occasion.\n\n378. Was it previous to this?—This was in May, the steamer left Batoche with Captain Wise and a few other people who were wounded and sick. I think it was the 30th May, and they went straight to Prince Albert and landed there. We marched.\n\nCol. Tisdale—The General knew nothing about it, until he arrived at Prince Albert.\n\nBy Mr. Weldon (St. John):\n\n379. Was that the same steamer that you afterwards went down from Battleford in?—The steamer I went in afterwards, was the “Marquis,” I think.\n\nBy Mr. Kirkpatrick:\n\n380. Did you get any furs when you went to the Rocky Mountains?—Yes, I bought a lot of furs at the Stoney Reserve.\n\n381. Did you know Mr. McLean?—I got some from him.\n\n382. He is the man at Fort Pitt?—The only order, I think I got from Mr. McLean at Fort Pitt.\n\nBy Mr. Weldon (St. John):\n\n383-4. Is that the same steamer that came down to Battleford?—I forget now. I came down from Fort Pitt to Battleford, I think, about the 2nd, or 3rd, or 4th of July.\n\nCol. Tisdale—This all happened in May.\n\nBy Mr. Weldon (St. John):\n\n385. What steamer was it you came in from Fort Pitt to Battleford?—I think it was the “Marquis.”\n\n386. Where did you first see this box Capt. Wise referred to—when?—In Ottawa. I never saw any of my baggage until I got to Ottawa.\n\n387. How many boxes or packages of furs had you?—They were contained in little boxes—three or four, as far as I can remember. The boxes were small ones put into a large one, so as to reduce the bulk of my baggage. That is, I believe,\nwhat was done. When I got down here I saw all these boxes, and that is the first time I had seen them opened, or had seen them.\n\n388. Was it only one large box or more than one?—I do not know at this moment—I cannot remember. I think there was one large box and one small one.\n\n389. And this large one contained the other packages inside, boxes or bales?—Boxes. Because, as it happens, I got a great many of these boxes. There were most of them small American boxes that we found in pursuit of Big Bear. He used to throw them away when they were hard pressed, and we used to find two or three of these boxes in different parts.\n\nBy Mr. Casgrain:\n\n390. Was it the large box used for packing saddles?—I do not think so. Whatever it was, I got it at Winnipeg.\n\nBy Mr. Kirkpatrick:\n\n391. You say McLean and other people gave you a lot of furs?—I had innumerable furs given to me.\n\n392. These were the furs that you sent to Devlin's?—These were the furs, and the ones that I got which were sent to me at Batoche. These were the whole of the furs I have ever had, and some of the furs I happen to be able to particularize. For instance, the only otter I had, were those I had got up at Stoney Reserve, and the fisher. I had only one fisher. I really did not know what a fisher was, and I got one that was shot, on the line of march, by poor Capt. French, and he skinned it himself, and gave it to me, telling me it was a fisher.\n\nBy Mr. Welton (St. John):\n\n393. You never saw Bremner at all?—To the best of my belief, I never did.\n\n394. Do you recollect seeing his clerk, Caplette?—I have no recollection whatever; he certainly never came to me, to complain about anything.\n\nBy Mr. Lister:\n\n395. Did you see him in Winnipeg about his furs?—Bremner?\n\n396. A little after he got out of prison?—Bremner? I never saw the man in my life, that I remember.\n\n397. He says he went to Sir Adolphe Caron, you and somebody else, about his furs, in Winnipeg?\n\nBy Mr. Kirkpatrick:\n\n398. Were you in Winnipeg when Sir Adolphe Caron was there?—I have been there every year.\n\nBy Mr. Lister:\n\n399. He says he went to see you in Winnipeg?—I am perfectly certain that if he had come to see me, I should have remembered. You cannot expect me to remember every trifling conversation that took place five years ago. I do not pretend to do that. Certainly, prominent things I can remember. If Bremner had come to me and spoken to me about the furs, I am perfectly certain I should have remembered it. Moreover, if he had come to me and appealed to me, I certainly should have listened to him.\n\n400. He says he did, General?—I never saw him at all, to the best of my belief.\n\nMr. Reed called and sworn, after which he made the following statement:\n\nI was on the General's staff, from Prince Albert west, during the North-West troubles in 1885. When we were at Fort Pitt in June, he placed me temporarily in charge of the transport service, while the troops were making a forced march after Big Bear's party. On the return of the troops to Fort Pitt, I made a hurried trip on Indian affairs to Battleford. While there I saw a lot of furs in a Police storehouse. Quartermaster-Sergeant Warden was in charge of this storehouse. I was told that these furs had been taken from persons who were rebels. On my return to Fort Pitt a day or two afterwards, I reported these facts with reference to the furs to the General. He then decided to confiscate them, and directed me to write, saying they were to be confiscated. He requested me, at the same time, to have some of them put up for himself, and he said that some might also be put up for members of his staff. I accordingly at once wrote a letter addressed to Warden, informing him of the General's order for the confiscation of the furs, and that he desired to have\nsome put up for himself, and also that some were to be put up for Bedson and myself, and I think another member of the staff, but I do not remember. I further requested Warden to take a receipt, or make a memorandum of who got furs, and the quantity. I gave a letter to the proper officer to be forwarded to Battleford, and I expected that the furs would be put up ready when we reached that place by boat in two or three days afterwards. We got to Battleford by boat on the following Sunday. The General was also on board. He did not, so far as I know, go to the storehouse. I went there, accompanied by Mr. Bedson, and saw one box, which I was told contained the furs put in in accordance with my letter, except the parcel for myself, which was not in this box. I cannot remember what I saw put in the second box, beyond a package of lynx and two or three small packages of mink furs. The contents of the two boxes would not, I believe, be more than one-eighth of the total quantity of furs in the storehouse at the time. When Mr. Bedson and I were in the storehouse the furs were loosely piled upon the floor. None of the furs in either of the boxes were for me. It was understood that Bedson was to give a receipt for the furs in the boxes, but as there was a great hurry to get off by steamer, he could not do so, but promised on arrival at Winnipeg, on knowing the contents of the boxes, to send a receipt back to Battleford. I do not remember whether I saw the boxes taken out of the storehouse or not, nor whether there was an address on them or not, but I think the first-mentioned box was addressed to the General. I do not know what became of them afterwards, except that I understood they went on board the steamer. The parcel of furs intended for me was not put on board the steamer, but was sent overland to me at Regina, reaching me several months afterwards. I kept none of the furs, but sent back the parcel to Battleford to the Police storehouse shortly after I got it, and I believe it has remained in the Police storehouse at Battleford ever since. After the steamer left Battleford, I myself remained there for two or three days on Indian affairs, and I then went west attending to my official duties, and was absent some months, when I returned to Regina. During the whole of my service connected with the North-West trouble I never received or obtained any furs, except one skin which was given to me for assisting in relieving the white people who were prisoners in Big Bear's camp, and this I received long after the rebellion was over and after I returned to Regina.\n\nCross-examined by Mr. Lister:\n\n401. Do you know who the furs in Battleford belonged to?—I believed they all belonged to rebels.\n\n402. To what rebel?—To the rebels.\n\n403. Did you not hear they belonged to Bremner?—I did.\n\n404. Then it was to a rebel—not rebels. You heard they were Bremner's furs. That is what they were called at the Fort?—Yes.\n\n405. Were you there when they were taken into the Fort?—I was not.\n\n406. How long afterwards was it, after they were taken into the Fort, that you first saw them?—It must have been at least two weeks, I fancy. I do not know when they were taken into the Fort only from what I heard.\n\n407. Did you examine the furs at all?—No.\n\n408. Did you look at them?—Nothing more than a casual glance.\n\n409. Where was it you saw General Middleton after the taking of the furs into the fort?—At Fort Pitt.\n\n410. What conversation took place between you and General Middleton respecting those furs?—I reported what I had seen.\n\n411. What did you report?—That I had seen those furs, and I was told to whom they belonged.\n\n412. You told him they belonged to Bremner; that is, you told General Middleton?—Yes.\n\n413. That you had seen the furs; did you intimate to him the quantity?—I think not.\n\n414. Will you swear you did not do that?—As far as I can remember.\n\n415. You did not tell him whether there was a large quantity or a small quantity of furs?—I may have said a large quantity.\n416. That was the truth—there was a large quantity?—Yes.\n417. Of valuable furs?—Well, I cannot tell, because I did not see the inside of them.\n418. You did not go over them?—No.\n419. They appeared to be good furs?—As far as a man could judge. They were packed in bales and things of that sort, inside out, as a rule.\n420. You told them they were Bremner's furs?—As far as I remember, I did.\n421. You knew that they were Bremner's furs before going to Fort Pitt?—Yes, I must have known that.\n\nBy Mr. Casgrain:\n423. Did you know Bremner at the time?—I do not think I ever saw Bremner before that time.\n\nBy Mr. Lister:\n424. You said they were furs taken from Bremner, and when you saw General Middleton, you told him that they were Bremner's furs? Now, who first commenced the conversation as to the confiscation of the furs? Who suggested that the Bremner furs should be confiscated?—I cannot remember that.\n425. Had you considerable talk about it?—There was talk.\n426. Who was present besides you and the General?—Mr. Bedson, and, I fancy, Mr. Freer, the General's aide.\n427. Do you remember that he was present?—I cannot swear positively.\n428. Will you swear positively that Bedson was present?—Yes.\n429. You are sure the General, Bedson and yourself were present?—Yes.\n430. Did Bedson say anything about furs?—I cannot remember the exact conversation which took place.\n431. What did you tell the General that induced him to confiscate them?—I don't know that I told him anything but saying that these furs were there.\n432. What more?—Nothing more that I know of.\n433. Did you tell him Bremner was a rebel?—I do not know as I did, because I thought the General understood.\n434. You do not remember, then. The idea of confiscation came from the General?\n435. What did he tell you to do?—He told me to write and confiscate them.\n436. And how to dispose of them?\n437. What did he tell you as to their disposition?—He told me to have some put up for himself, and some to be put up for Bedson and myself; and, it was understood, for his staff, if they wanted any.\n438. He authorized you to write that there should be some put up for himself, some for Bedson, and some for yourself. Will you swear he authorized you to put up any more?—It was understood that, if the others wanted them, they could have them.\n439. Do you know if any others wanted them, as a matter of fact?—Yes.\n440. Who?—Captain Hague wanted to get furs.\n441. Could he get them if he went there for them?—Went where?\n442. To Battleford. Could he have got the furs if he had asked for them?—If he had asked, he would have had some of these.\n443. Do you know if he got some of these?—I believe some were put up for him.\n444. Do you know if furs were put up for any other officers?—I cannot remember.\n445. Now, what you do remember is, that General Middleton directed you to order, that some of the furs should be put up for himself, some for yourself, and some for Bedson and the other officers. But you are not sure about that. Did you write the letter?—I did.\n446. Where?—At Fort Pitt.\n447. In the General's tent?—I think so.\n448. Do you remember that?—I must have been there, I fancy. I had not a tent of my own, and I had not writing material, and I fancy it must have been in the General's tent.\n449. Did you write the letter in the presence of General Middleton?—I think so.\n\n450. Have you any doubt about it, Mr. Reed?—If he was not in the tent, he was close by.\n\n451. Did you read the letter to him before sending it away?—I do not think I did.\n\n452. Did you intimate to him what the contents of the letter was?—He understood what the contents were.\n\n453. Did you, after writing a letter, intimate what the letter contained?—He knew at the time of writing.\n\n454. Then he knew the contents of the letter?—Yes.\n\n455. Did that letter direct that two boxes should be put up for General Middleton?—No.\n\n456. You will swear to that?—I will swear to that.\n\n457. Positively?—Positively.\n\n458. And that one should be put up for yourself and one for Bedson?—I will swear that they were not boxes; they were packages.\n\n459. How many of these for the General? Two for the General, one for you and one for Bedson?—Yes.\n\n460. Instead of boxes it was packages?—Yes.\n\n461. The letter directed that it should be two for the General, one for yourself and one for Bedson?—Yes.\n\n462. You are distinct on that?—Yes.\n\n463. Did you give any directions as to where and when they should be shipped?—Yes.\n\n464. How were they to be shipped, and when?—They were to be ready to be placed on the steamer as they went by.\n\n465. What steamer?—The steamer the General was on.\n\n466. Who was on the steamer with the General?—His staff.\n\n467. Did you go down?—I did not.\n\n468. You were not there?—I went as far as Battleford, but not further.\n\n469. You went as far as Battleford with the General?—Yes.\n\n470. Bedson, the General, and the rest of the staff, were on board?—Yes.\n\n471. Did you direct in your letter to pick out the best furs, to select the best furs?—I think I did.\n\n472. You did not want any common furs, I suppose, as they were going a long distance? Was the letter to this effect: That, by order of General Middleton, Warden was to put up four packages of furs, two for the General, one for yourself, and one for Bedson; that he was to select the best furs, and that they were to be shipped on the boat that brought the General down to Prince Albert?—Yes.\n\n473. Now, you reached Battleford with General Middleton?—Yes.\n\n474. Bedson was with you. Did you go up to where the furs were?—I did.\n\n475. Who accompanied you?—Bedson.\n\n476. Bedson and you went up to where the furs were? Why did you go there?—To see that they were shipped.\n\n476½. Had you any conversation with the General about the furs on the way down?—I do not remember.\n\n477. Will you swear that you did not or that you do not remember?—I do not remember.\n\n478. You do not remember having any conversation? At all events, you and Bedson went to Battleford to see that the furs were shipped?—Yes.\n\n479. Where did you find them?—In the storehouse.\n\n480. How were they packed?—When we went in, there was a box standing there, and I was told that the furs were in this box.\n\n481. All the furs?—I understood that, except the package for myself.\n\n482. Now, the furs were directed to be put up?—Yes.\n\n483. There was a package put up for you?—Yes.\n484. You saw that package?—I have no distinct recollection, but I believe there was one put up for me.\n\n485. Did Bedson ask, now, about the package for him?—I do not remember that.\n\n486. Did Bedson have a package put up for himself there at that time?—Yes.\n\n487. So, in addition to the furs in the box and the package for you, Bedson had another package put up for himself?—I do not know whether it was exclusively for himself. It was intended for himself and the rest of his staff.\n\n488. You saw them put up?—Yes.\n\n489. Did you go through the box of furs at all; were they looked over?—I do not know.\n\n490. Will you swear that Bedson did not look through the first box?—No; because I think it was nailed down when we got there.\n\n491. Did you open up your box of furs?—No; I think not.\n\n492. How many furs did Bedson have put up in this other package?—All I can remember is what I stated in this statement, a bundle of lynx and some minks.\n\nBy Mr. Weldon (St. John):\n\n493. That was in Bedson's package?—Yes.\n\nBy Mr. Lister:\n\n494. Now, your directions to the man at the barracks were, that the furs should be shipped on the boat?—Yes.\n\n495. Who did you give these orders to?—When the letter was written.\n\n496. Of course that letter was forwarded asking that they be ready for shipment by boat that brought down the General?—Yes.\n\n497. You saw the furs packed?—Yes.\n\n498. Was there anything said about when the boat would leave?—Yes.\n\n499. What was that?—I cannot say exactly what was said.\n\n500. Did you tell Warden the boat would leave at a certain hour, and to have the furs down there?—No.\n\n501. Did you hear Bedson tell him?—Yes; I think so.\n\n502. Have you any doubt at all but what the furs were taken down and put on the boat?—No.\n\n503. No doubt whatever?—No.\n\n504–5. Then your bundle of furs went to Regina and you followed?—Yes.\n\n506. Did you open the bundle?—No.\n\n507. How long was it after your visit to Battleford before you saw that bundle again—after the day those furs were put on board, how long was it before you saw this bundle of furs that had been put up for you?—Some months.\n\n508. They were sent to you at Regina?—Yes.\n\n509. How long did you keep them?—Two or three months, I think.\n\n510. Why did you not keep them altogether?—Because of a question of propriety. It was a question as to the confiscation, and I sent it back.\n\n511. You questioned the propriety of the confiscation?—The question was asked about the propriety of that confiscation.\n\n512. Who asked the question?—I heard it spoken of.\n\n513. The question of the propriety of the confiscation, was the question?—Yes.\n\n514. You immediately sent the furs back or kept them a couple of months?—I wish to explain this. I was intending to go to Battleford and I thought I would take them myself, and, finally, I found I could not go and they were sent up.\n\n515. Where were they taken to?—They were sent back to the storehouse.\n\n516. They were sent to Regina for you, and, after two months, the question of propriety arose, the legality of the confiscation, and you returned them to Battleford?—Yes.\n\n517. How many years ago was that?—That would be four years ago.\n\n518. You say they are there now?—I think so. My belief is they are there.\n\n519. When did you enquire?—I have been told by the police officers, and I have also been told by the officers in command, up there, that they are there.\n\n520. When?—On several occasions.\n521. Of late years?—Last year. I think I was told by Commissioner Herchmer himself, and I can remember distinctly that Major Cotton told me they were there.\n\n522. When was that?—A couple of years ago.\n\n523. How did you send them back—by rail?—No, through the police.\n\n524. How long did you remain at Battleford after General Middleton left Battleford on that day?—A few days.\n\n525. Were you ever in the room where these furs were again, between the time the General left and the time of your leaving?—Yes.\n\n526. Did you notice whether the packages had been taken off?\n\nCol. Tisdale—He said positively they were taken on the boat.\n\nWitness—They were not there, except the package for myself.\n\nBy Mr. Lister:\n\n527. The other packages had gone?—Yes. I did not see them.\n\n528. Do you know what became of Bedson's furs—the ones he got?—I do not.\n\n529. Did you ever have any talk with him about it since?—Except asking him for the receipt, and that is the first time I found out he had not received the furs, and that he did not give a receipt at Battleford, and I asked him for the receipt and he said he had not received them. He said they had been taken on the way down on the steamer.\n\n530. By whom—stolen?—He saw the box had been opened and that it was taken out on the way down.\n\n531. He never got them in consequence?—Yes.\n\nBy Mr. Cusgrave:\n\n532. That large box you saw, was there any address on it?—I think so, as far as my memory goes.\n\n533. What address was it?—General Middleton.\n\nBy Mr. Lister:\n\n534. One question, Mr. Reed. Did you ever see Warden about this letter afterwards?—Yes.\n\n535. Did you try to get that letter back from him?—Yes.\n\n536. What for?—Because it had some private correspondence in it.\n\n537. Any more correspondence than I have given you here, namely, that the furs were to be put up and shipped, and the quantities? Was there anything more in that letter than what I have stated?—Yes; I think there was.\n\n538. Will you swear there was?—As far as my memory goes.\n\n539. Your letter is, that by General Middleton's orders he was to put up so many packages of furs, and the best were to be selected, and they were to be shipped on the boat that brought the General and his staff down. Was there anything more in the letter?—I think I told Warden not to make this public.\n\n540. That was in the letter?—Yes.\n\n541. Was that done at the General's request?—It was.\n\n542. When was it that you saw Warden about getting that letter out?—When we came down from Fort Pitt.\n\nBy Mr. Welton (St. John):\n\n543. While you were at Battleford, these few days?—Yes.\n\nBy Mr. Lister:\n\n544. What excuse did Warden give for not giving up the letter?—He did give it to me.\n\n545. You got the letter, as a matter of fact?—Yes.\n\n546. Where is the letter?—It is torn up.\n\n547. When was it torn up?—At that time. I want to say this, it was only the private part, and I gave the formal order back to Warden.\n\n548. You got the letter and you gave him a copy of the letter with the exception of the private part, and Warden got back all, except what you consider private?—Yes.\n\n549. In order that he might hold it as a voucher for the furs?—Yes.\n\n550. The original letter contained the statement that this was not to be made public?—Yes.\n551. You got the original back, all but the order?—Yes.\n552. Was the original torn up?—The original was torn up, and the formal part rewritten and given back to Warden.\n553. Why was it destroyed?—Because he had shown this about, apparently, and owing to this private part in it.\n554. He had apparently shown it about?—Yes.\n555. You had heard he had been showing it, and owing to the private part you got the letter containing all, except that?—Yes.\n\nBy Mr. Girouard:\n\n556. Was the private part, that part that Warden was not to make it public, was there anything else in that private part?—No.\n557. Are you sure about it?—I do not know anything else.\n558. Did that letter mention that the goods were confiscated by order of the General?—Yes.\n\nBy Mr. Weldon (St. John):\n\n559. I understand that the original one you wrote from Fort Pitt was destroyed, and you wrote out a new one leaving out the parts you refer to?—Yes.\n\nBy Mr. Lister:\n\n560. Coming back to the letter, you say you destroyed that letter and it was last in your possession, that original letter that was written in the General's tent?—Yes.\n561. Now, was there one word in that letter about confiscation?—Yes.\n562. Do you say there was any?—Yes.\n563. Was there a word about confiscation. The original letter says, by order of General Middleton?—I think it went on that General Middleton had decided to confiscate and then it read on that he had directed me, &c.\n564. To put up, &c.?—Yes.\n565. And to select and to ship by the boat that would bring the General down. That was the letter was it? That was substantially the letter?—Yes.\n\nBy Mr. Girouard:\n\n566. The original letter?\nMr. Lister:—Here is a copy of the letter upon which we based the charge. The letter reads thus:\n\n\"DEAR WARDEN,—General Middleton has instructed and authorized me to send you the present letter, desiring that you put up bales of furs for the undermentioned: two bales for General Middleton, one for S. J. Bedson, and one for myself. Please select the best and pack them down, as we will be down there to-morrow by boat.\n\n\"HAYTER REED,\n\"Assistant Commissioner of Indians.\"\n\n567. Do you undertake to swear, Mr. Reed, that that is not the letter?—It is substantially correct, however, but I put in the word confiscation.\n568. Will you swear in writing the letter you put in the word \"confiscate\"? Be careful about your answer?—It is my firm belief I put in the word.\n\nBy Mr. Girouard:\n\n569. And in the re-written, too?—Yes.\n\nBy Mr. Lister:\n\n570. You will swear that in the re-written letter you put the word \"confiscate\"?—It is my firm belief.\n571. Are you sure that the letter you give there, in the original specifically contained the word \"confiscate\"?—I firmly believe that both did.\n572. Look at that letter, and say whether it is substantially a copy of the substituted letter?—I would not express myself in that way: \"General Middleton has instructed me or authorized me to send you the present letter.\"\n573. How would you express yourself?—I think it would be in this way: \"General Middleton has decided to confiscate the Bremner furs, and desires that these packages be made up.\"\n574. \"And please select the best\"?—I think it said that.\n575. And stating that the boat would be down next day with General Middle-\nton?—Yes.\n\n576. And not to make it public?—Yes. Then these names, as intimated in my\nstatement, were on there.\n\n577. You think there was some other officer?—Yes.\n\nBy the Chairman:\n\n578. Do I understand you to say you commenced the letter with the statement\nthat General Middleton had confiscated the furs?—Had decided to confiscate.\n\nBy Mr. Lister:\n\n579. That letter was written by order of General Middleton?—Yes.\n\nBy Mr. Girouard:\n\n580. Where is the second letter; is that in the hand of Mr. Warden?—I do not\nknow.\n\n581. Could you tell the Committee where it is?—No.\n\n582. Where did you see it last?—In the hands of the police.\n\n583. Which police?—In Battleford.\n\n584. You can give the name of the policeman?—Mr. Warden.\n\n585. That is where you last saw the re-written letter?—No; I would not say\nthat; I have seen that; I have seen it since.\n\n586. Where did you see it last?—I have seen that letter in Ottawa here.\n\n587. When did you see it?—because it is important we should have it—When\nand where?—In the hands of the police.\n\n588. What police in Ottawa?—In the North-West Mounted Police Department.\n\n589. In the Department of the North-West Mounted Police; who had it there?\nWhat is the name of the officer who had it?—Mr. Fortescue or Mr. White.\n\n590. You saw that letter in their hands?—I saw it since I have been down here.\n\n591. Within a week, or two weeks?—Six weeks or two months.\n\n592. Who gave it to that officer?—I do not know.\n\n593. You saw it in his hands?—I went there—\n\n594. To look at it?—No; to ask questions about this case.\n\n595. And they showed you the letter?—Yes.\n\n596. Do you know where it is to-day?—No.\n\nBy Mr. Lister:\n\n597. How long ago was this?—Six weeks ago.\n\n598. Was that Department presided over by Mr. Fortescue or Mr. White?—\nMr. White.\n\n599. Did you believe at the time you wrote this letter, and at the time these\nfurs were taken, that General Middleton had the power to confiscate?—I certainly\ndid, or I should not have taken action.\n\n600. You were acting in good faith?—Yes; and I sent this package back be-\ncause I thought I had no right to them.\n\nBy Mr. Weldon (St. John):\n\n601. Under what circumstances did you see this letter in the Department\nrecently?—I went to ask questions about this case.\n\n602. (Producing letter). This is the letter you wrote at Battleford, and which\nyou saw in the Department?—Yes.\n\n603. You recognise it as your handwriting?—Yes.\n\nBy Mr. Wood (Westmoreland):\n\n604. I understand you, Mr. Reed, that the General knew the contents of the first\nletter written?—Yes.\n\n605. Did he give instructions that it should be kept private and that that should\nbe inserted?—Yes.\n\n606. Did he know that you wrote the second letter?—No; he did not.\n\n607. That was issued without his authority?—Yes.\n\n608. Of your own motion?—Yes; that was done simply because his private\nclerk was in, and Warden had been showing it to people and it was being talked\nabout. I said “I will give you the formal part of the order.”\n\n609. This private part was not the formal part?—No.\n610. Do you think the General intended it should be part of the order?—He desired me to send that.\n\n611. You wrote this second letter of your own accord, because you had heard rumors?—Yes.\n\nBy Mr. Casgrain:\n\n612. Have you known Mr. Bremner since that time?—Yes.\n\n613. When did you see him first after this—after these furs were packed?—I had seen him before this.\n\n614. Did he claim those furs then?—I did not speak to him.\n\nBy Mr. Holton:\n\n615. Did you open the package of furs while it was in your possession?—No.\n\n616. Did you get a list of the furs from Warden put up for you?—No.\n\n617. Then you cannot speak of what was put up for you?—No.\n\n618. You do not know what the contents of your package were?—No.\n\nBy Mr. Tisdale:\n\n619. When you say that General Middleton knew the contents of this letter, what do you mean by that, that you showed it to him, or that he knew from the orders he had given you?—From the orders he had given me.\n\n620. You gave the Committee to understand that you had communicated its contents to him. He knew it from the orders he had given you?—Yes, I think so.\n\n621. Or do you mean you read it to him?—No, I did not read it to him.\n\n622. You acted within the orders he gave you, and under them you afterwards wrote the letter?—That is what I firmly believe.\n\nBy Mr. Welton (St. John):\n\n623. There was nothing in that letter except what you were ordered to write?—No.\n\nBy Mr. Kirkpatrick:\n\n624. You saw the quantity of furs that were in the storehouse?—Yes.\n\n625. What proportion did those packed up and that came down on the steamer that day bear to the whole quantity?—About one-eighth; something like that, or one-tenth.\n\n626. Bedson's package and yours?—These two cases and mine.\n\nBy Mr. Girouard:\n\n627. What became of the rest?—I do not know.\n\n628. Were they all confiscated, that is those that were in the room, as well as those that were on the steamer?—Yes.\n\nBy Mr. Casgrain:\n\n629. Do you know how those furs first reached that store?—No; I do not.\n\n630. Do you know of anybody who knows how they came there first?—No. I did not know they were there until I saw them.\n\nGeneral Middleton—I would like to say that I perfectly agree with all that Mr. Reed has said, with the exception of that part where he intimated that I directed him to say it should be kept quiet. I certainly never directed him to put that in the letter, to the best of my belief, neither did I think it necessary. At any rate, there was no secret made of the thing at the time about these furs, and I certainly do not remember ever having suggested to keep the thing quiet. I did not hear or see what he had written. I, merely having given the order, trusted the carrying of it out to him, and I never saw or heard what he had written. He says he wrote it in my tent. I cannot remember that. I think it is very likely he may have, but I certainly did not know the contents. Had I seen the thing, I certainly should not have let it go.\n\nGeneral Middleton was then further examined, as follows:\n\nBy Mr. Kirkpatrick:\n\n631. Was it an ordinary tent?—The Adjutant had a tent there. However, I dare say, he did write it in my tent.\n\nBy Mr. Wood (Westmoreland):\n\n632. The part you would object to would be the private part?—I do not think I suggested to him to keep it private.\n633. You would not have let it gone?—No, not this part.\n\nBy Mr. Tisdale:\n\n634. In other words, you gave him no authority to keep it secret?—Not to the best of my recollection.\n\nBy Mr. Girouard:\n\n635. Did you authorize Mr. Reed to say, in that letter you had decided to confiscate the goods?—I have no doubt I did. You see the conversation took place and I decided that they were to be confiscated, and he wrote this letter, whatever this order was, after the conversation we had had. He was quite justified I think, from the conversation we had had, in writing what he did, with the exception, that I do not think I ever told him to keep it secret, because it was not secret.\n\nBy Mr. Casgrain:\n\n636. Did you ascertain in what manner these furs reached that store—how they came to be in that store?—I do not quite understand you.\n\n637. Did you enquire or ascertain how these furs reached that store where they were stored in?—In what state do you mean?\n\n638. How they came to be there?—I have not the slightest idea, except that it was reported to me that they were being stolen, and, as far as I can remember, it was suggested that they should be sent to the Police barracks.\n\n639. They were put there for protection?—The only person capable of giving the order was myself; and therefore I assume I gave it: but as to the quantity that was put there I cannot tell you. The object was to prevent them being taken indiscriminately by people about.\n\nMr. Hayter Reed recalled, and further examined:\n\nBy Mr. Kirkpatrick:\n\n640. Identify that letter and say whether it is the letter you referred to as the second letter?—This is it.\n\n641. Read it?—It reads as follows:\n\n\"Fort Pitt, 1st July, 1885.\n\n\"To the Officer in charge of the property taken from Rebel:\n\n\"The General having decided to confiscate the furs now in your care and taken from Rebel, desires that you should make up a select bundle of beaver and fisher for him and a selection also for those of his staff. Have them properly packed and addressed, and keep a memorandum of what is packed.\n\n(Signed) HAYTER REED.\"\n\nBy Mr. Girouard:\n\n642. When did you write this?—After I went to Battleford the second time.\n\n643. How many months after the 1st July, 1885?—It was immediately after the General left—within a day or two after the General left on the steamer.\n\n644. Who told you to change this letter for the second one?—No one.\n\n645. You did that of your own motion?—Yes.\n\nBy Mr. Lister:\n\n646. This is not the shape of the letter at all. Will you swear this is a copy of the letter you wrote at Fort Pitt, in all respects excepting that it is not to be kept quiet?—And those names.\n\n647. Did not your letter from Fort Pitt commence \"Dear Warden?\"—I think it did.\n\n648. You do not pretend to say that is a copy of your first letter?—No.\n\n649. Either in phraseology or anything else?—So far as the formal order goes, it is the same.\n\n650. But it is not a copy of the letter you wrote at Fort Pitt?—No; that is not.\n\n651. That is the letter mentioned in Hansard. In that letter you stated there were to be two packages for General Middleton. Was it bales or packages?—I think it was packages.\n652. Will you swear it was packages?—I think it was packages. They are synonymous terms. If I said bale I meant package.\n\n653. In your original letter there were to be two bales put up for General Middleton?—Yes; it says so here.\n\n654. It does not. It says \"put up a select bundle of beaver and fisher?\"—Then it means two.\n\n655. Then it was two for General Middleton and one for yourself and one for Bedson? Now it means two bundles in this substituted order?—Yes; it means two.\n\nBy the Chairman:\n\n656. Do you recollect that that is not a correct copy of what you said with regard to letter in Hansard—I believe that it is not a verbatim copy, unless I were shown the original or some person swore it was. That would be the only way the doubt could be created in my mind. Otherwise I believe that is not a verbatim copy.\n\n657. Do you say you still recollect having said two bales for General Middleton?—Yes; to the best of my belief.\n\nBy Mr. Weldon (St. John):\n\n658. You addressed the letter \"Dear Warden\" and informed him that the General had confiscated the goods and directed him to put up two packages for General Middleton, one for yourself and one for Bedson?—Yes; and mentioning another name, I think.\n\nBy Mr. Girouard:\n\n659. What is the other name; do you recollect?—I do not know.\n\n660. Who do you think it was?—It would likely be Captain Hague. I know he was asking very frequently for furs.\n\nBy Mr. Casgrain:\n\n661. Why did you write that second letter?—Because there was a private part to the original letter.\n\n662. Where did you write it?—At Battleford.\n\n663. Did you put the former date to it?—Yes, I think so.\n\n664. Did you write that letter after having torn the other one?—Before.\n\nBy Mr. Weldon (St. John):\n\n665. When you applied for the receipt to Mr. Bedson, he told you that he had been plundered on the boat?—Yes.\n\nThe Committee then adjourned.\nHouse of Commons, 18th April, 1890.\n\nCommittee met: Mr. McNeill in the Chair:\nStuart Henderson recalled and further examined:\n\nBy Mr. Kirkpatrick:\n\n666. You have been sworn. Have you brought with you all the papers you have in connection with this case?—I have brought the paper under which I act. I have not brought any papers which disclose matters of evidence in connection with Mr. Bremner and myself, or between the gentleman with whom I do most of the correspondence—Mr. J. M. Skelton—and myself. Telegrams relating to witnesses I have not produced.\n\n667. Have you produced all the papers signed by Mr. Bremner?—Mr. Bremner signs as a marksman. I have to take a great deal of what he says through Mr. J. M. Skelton.\n\n668. What papers have you produced?—They are there.\n\n669. There is another paper. This is not the power of attorney. There is a power of attorney from him, as well as some other paper?—I have not got it in my possession.\n\n670. You had it in your possession?—No. I drew up a different paper from it altogether last year—an agreement. That agreement Mr. Bremner refused to sign.\n\n671. There is some other paper you had in your possession?—Signed by Mr. Bremner?\n\n672. Or made by his mark?—Yes; I have other papers signed by his mark.\n\n673. Relating to this claim of the amount he would take?—No; I had a telegram that I received since.\n\n674. To whom did you give it?—Mr. Macdonald must have it.\n\n675. Mr. Macdonald says you have it?—A power of attorney signed by Bremner?—No; not the power of attorney.\n\n676. What was it?—An agreement. I sent up an agreement last year, but Mr. Bremner would not sign it.\n\n677. I do not mean the one he did not sign, but the one he did sign?—I have not got it.\n\n678. Did you see one?—Yes? I think I have.\n\n679. When?—This Session.\n\n680. To whom did you give it?—Macdonald had it, and I had it. I read it over.\n\n681. To whom did you give it?—Macdonald must have it. I did not give it to anyone else.\n\n682. Who has it now?—I cannot tell you. Macdonald would be able to tell you that.\n\nBy Mr. Girouard:\n\n683. Have you any papers relating to this inquiry that you have not produced?—Yes.\n\n684. Will you produce them?—I would rather not. Surely no lawyer will ask me to produce them.\n\n685. Here we make no distinction. Have you any papers from your client or anyone else—not instructions from your client on the subject of this enquiry?—I have, but they are of that nature—\n\n686. Then produce them?—I will not produce them. Mr. Bremner has not a footing before this Committee. If I were counsel for one of the members before this Committee I would produce them; but Mr. Bremner has no footing before this Committee, and I will not produce them.\n\n687. What do you mean by no footing?—I positively refuse to produce any other papers than I have produced.\n\nBy Mr. Tisdale:\n\n688. Are these the only papers you have, showing the arrangement Mr. Bremner made to collect from him?—In my possession?\n679. Any others you have had are not now in your control?—I suppose I could get any papers from Macdonald that he had.\n\n690. There are none anywhere else, except those that Macdonald had?—No; I have not destroyed any.\n\nBy Mr. Kirkpatrick:\n\n691. There is another paper?—That paper has nothing to do with anything that comes up before this Committee. That paper has to do with a civil suit that may be going on.\n\n692. We want to see that paper. He admits that he has a paper signed by Bremner, and we want to know where that paper is. If he says there is no paper concerning this inquiry there is an end to it?—I say that that paper has no connection with this inquiry.\n\nBy Mr. Girouard:\n\n693. Has it no connection with the subject matter of this inquiry?—Yes; it has.\n\n694. Then they ought to be produced?—We have an abundance of papers coming in from men who wish to get a rap from the Government, and I have not read them all through.\n\n695. You should have done it since the last meeting. You were instructed to look into the papers.\n\nBy Mr. Kirkpatrick:\n\n696. I have never seen the paper. There is a paper which Mr. Henderson states that he has seen?—It is an agreement, not a power of attorney.\n\nMr. Kirkpatrick—I think this Committee ought to insist upon the production of that paper.\n\nThe Chairman—(To Mr. Kirkpatrick).—You say this is the paper you want?\n\nMr. Kirkpatrick—I suppose it is.\n\nThe Chairman—That settles it. Mr. Henderson says he has not got that paper.\n\nWitness—I sent an agreement which was binding both on Bremner and Macdonald, and Bremner refused to sign it, and another agreement was signed, which, in my opinion, was of no legal validity whatever; otherwise, I might have kept the paper. It was of no legal validity whatever.\n\nMr. Kirkpatrick—We want to find out why they are keeping this paper back.\n\nMr. A. M. Burgess, Deputy Minister of the Interior was called and sworn:\n\nMr. Kirkpatrick stated that he did not ask for Mr. Burgess' evidence, but Mr. Girouard stated that he wished to examine him.\n\nBy Mr. Girouard:\n\n697. Have you in your possession, Mr. Burgess, any papers relating to the subject matter of this enquiry?—Yes.\n\n698. What kind of papers are they? Will you produce them?—There is the evidence taken before, and the report made by, the commission appointed to inquire into the North-West Rebellion losses.\n\n699. You have the evidence under oath?—Yes; under oath.\n\nBy Mr. Cusgrave:\n\n700. These are the original papers?—Yes.\n\nBy Mr. Tisdale:\n\n701. Can you distinguish between those in this particular case?—Yes; the papers I have brought now are all in connection with this case.\n\nBy Mr. Girouard:\n\n702. You produce them?—Yes.\n\nMr. Tisdale—The papers state that the claimant was a party to his own loss—not allowed.\nMr. KIRKPATRICK—Here are counsel for Major-General Middleton and Hayter Reed. I submit that they should be asked if they have any statements to make. Have you, Mr. Gormully, on behalf of General Middleton, any statement to make?\n\nMr. GORMULLY—If further evidence is going to be taken I do not know what course we might pursue; but if the matter remains as it now is I do not think I have any further evidence to give. I have given the General's evidence, which I think is the best evidence I can give.\n\nMr. FERGUSON—I do not think there is any further evidence to give with respect to Mr. Hayter Reed.\n\nMr. GIROUARD—I think that the evidence of Mr. Bremner before the Claims Commission should be taken down in connection with this case.\n\nThe following documentary evidence, produced by Mr. Burgess, was then read:\n\n(No. 421.)\n\nNORTH-WEST REBELLION CLAIMS, 1885.\n\nBefore J. ALPHONSE OUIMET, Esq., of Montreal; HENRY MUMA, Esq., of Drumbo; THOMAS MCKAY, Esq., of Prince Albert, Commissioners, duly appointed and sitting as a Royal Commission at Battleford, District of Saskatchewan, North-West Territories, to investigate the said rebellion losses.\n\nPersonally came and appeared Mr. Charles Bremner, of Battleford, farmer and merchant, forty-seven years of age; married—Claimant.\n\nAnd the said Charles Bremner, said Claimant, being duly sworn, deposes and says as follows:\n\nI live at Bresaylor Settlement, between the two rivers, about twenty-two miles from town. I lived there at outbreak of rebellion, and was there on the 14th and 15th April, 1885. We sent a letter down here in April to the Chief of the Police, begged for an answer, but got none. I have no copy of this letter. We were ready to leave our property if he had said so, and we got the priest, Father Cochin, to write for us, and he told us that, perhaps, they were about through with the affair, and it might be that we would be all right if we did not leave the place. The letter was an application for assistance or advice. We got no reply, so we remained at my place. On the evening of the 13th April about 200 Indians came and said they had come for us, we refused to go; and that night they broke into my stable and took all my horses, and what I had in the pack (?) as well. The next day they went into my store alongside my house, and took my goods, and told us to get ready and go with them. So we had to go; they hitched up for me, and started to shoot the dogs, pigs and hens, and they took us away, driving with them at the same time about 300 head of cattle at least, mine among the rest. There were about 15 families taken then; they had all camped about my place, and we were all taken over Battle River to Poundmaker's Reserve. We remained there until the fight of Cut Knife Hill took place, when just before sunrise we heard the attack. Our little camp was about one-quarter of a mile from the Indian camp; the troops were about three-quarters of a mile across a big bridge from us, and I put up a big white flag; before this we had sent His C+B down Tom Dennison as a messenger to let the police know to come for us. Mark. and to say to them to not shoot at the square tents, but at the Teepees only.\n\nThe second cannon ball came near our camp. While with the Indians we were treated badly. I then hitched up the horse and sent my family away to hide themselves in a deep creek, and we went up into a high hill on horseback, intending to go to the police, and they fired at us twice with the cannon, and I saw some of our party of Half-breeds get ready to fight the police, and I said to them: \"The first Half-breed I see shooting at the police I will blow his brains out;\" and we went back, found our families, and had breakfast at our old camp of that night about 1 p.m. The police just then gave in, and a lot of Indians then got ready to follow them, when I told Poundmaker to stop his men, and he said he would. I came in then on the\nday Poundmaker came in and surrendered; we were kept with them until then, and were not able to leave; we had to follow the dancing tent like the rest. The food we got we had to buy from the Indians. All this time I was a prisoner against my will, and held by force. The Indians had 21 Canadians prisoners captured when the bull team was taken, and they were sent on ahead by Poundmaker with me and three or four others. I wanted him to come along, but he was scared, and I was told by Colonel Otter and Colonel Herchmer that if the Indians would let the horses and captured property go and give up their arms it would be all right. This was put in a letter and taken by Father Cochin and myself back to the camp and read to the Indians, and they were glad. We asked the chief to leave with our families; he said to leave myself and five men with him and he let the others go. We did so, and that evening he got news, and let us all go, and we came to our families who were on the way here. I was arrested here by order of Colonel Herchmer, because I had a rifle which I had bought from a Half-breed. It was a Government rifle, a Winchester, but I did not know it. I bought it from John Wells to keep it from the Indians. He is one of my neighbors. I was held here almost a month and was then sent to Regina for trial, and was held there, but no charge was made against me and we were let go to appear if called upon. I got home here about 18th September: came here same evening as released. I took no part in the Rebellion one way or the other, except as stated as to capture by the Indians. On my return I found my house and store barely standing—windows, stoves, furniture smashed, flooring gone and ceilings torn down. I saw a lot of new hats and clothing on the Indians when they came out of my store. They shot some of our cattle along the road to camp. I do not read, but I recognise the accounts now shown to me of goods that were in the store. I now file the original invoices from Winnipeg of goods sent to me in fall and summer before Rebellion, (Exhibit \"A\") and were all in my store on 14th April, except such as were sold. My books were lost. I find these invoices afterwards. I had them in a tin box. The goods from W. Macdonald were bought here, and I paid, as shown on these invoices. I paid $150.00 freight on these goods to the Canadian Pacific Railway to Swift Current, and $400 land freight to Bresaylor. Almost one-half of this stock remained unsold in my store on 14th April. The furs were at my place in the carts, and went with us to the Indian camp, but the Indians did not take possession of them. Middleton gave orders to put the furs in a safe place. I have not seen it since. I enquired for it, but have not recovered it. The list now read over to me is a correct list of my furs as list Exhibit \"B.\" The list now read to me is a true and correct statement of my losses in house and on farm separate from the store (Exhibit \"C.\") And Exhibit \"D\" is the general statement of my claim as at present put before the Commission. My residence is about 22 or 25 miles Chairman, from town. I have a farm, and had a store and house there; had been there four years last July. Was there at outbreak of Rebellion. There are in that settlement about twenty or thirty families altogether. I never heard word of the Rebellion until shortly or about the beginning of 1st April, 1885. When I heard of the Rebellion the settlers there in the Bresaylor were all on their farms; some of them came to barracks here, about ten or twelve families, for protection at once. I did not come here to barracks but remained on my farm with about ten or twelve families—John Wells, Andrew Pozer, Alexander Pozer, Cornelius Pruden, one Breland (name illegible), David Poitras, Narcisse Ducharme, Andre Ducharme, Louis Caplette, Lusette Genoux, and my own family, and James Bremner and their families, who remained in camp with me, and went to the Indian camp on Poundmaker's Reserve. We were notified by Edward Payton at midnight that they were hitching up, and that if we wanted to get away to come then. But my horses were away eighteen miles, and my own mother, 95 years of age, was with me, so I asked him to wait until the next night, when I could get my horses in; but he said he could not wait, there is quite a stir, and the Indians are coming and will kill us all. I sent for the horses, but they were lost and could not be found the next day; and this is the reason we did not come in with the others; the horses were\nafterwards found. I packed my furs as I bought them, and they were near the store; we did not leave to join Poundmaker for a while after this. Almost ten days, at least, had elapsed before I saw the 200 Indians. We could not come in when the horses were found because of Indians. I had no reasons not to come at once, instead of sending the letter to the fort. Father Cochin, already referred to, advised us to send the letter by the Brother. We remained there then until the store was pillaged, when we were forced to go with them. The priest was there, and went with us, and I remained there until about the time of Poundmaker's surrender. I was in my house on the 14th of April; when the pillage commenced my store was locked. I had no reason to try and prevent the pillage; the Indians were too wicked; they were all armed and broke open the store. The furs were there in the carts that day, but I am positive the Indians left in the morning, and I and all the people there as named went with them, and they took my goods along. The furs were in my carts, and I brought them with me along with the Indians. I can't say what became of the goods, but my furs were brought in here at the time of Poundmaker's surrender, and were delivered to the police here then. It was on the 2nd of May, at Cut Knife fight that I saw some Half-breeds preparing to fire on the police, and while I was in the Indian camp, I and all my party was armed; we refused several times to give up arms to the Indians. We had just a little bit of ammunition with us. I had a breech-loading gun. On my arrival here I was arrested, and sent to Regina, but I am sure no charge was made against me there. I do not remember to have pleaded guilty to any charge made against me there. No sentence was passed on us there. We were released on bail on our security of $400. I was brought with the others before Judge Richardson in the court room; the clerk read nothing to us; I can't recollect if the judge read anything to us, but I never pleaded guilty—I am positive of this.\n\nThe furs in Exhibit \"B\" are the furs I lost. I can't say if I had counted them all; I had counted what was packed. I made out my lists from memory as soon as released, when I went to Winnipeg, and I have not received any of them. Personally I can't say who took them. The prices mentioned for my furs are what I paid for my furs, and the prices mentioned for the goods are prices in Winnipeg and freight added. I sent my first claim about end of November last. I did not send my list of cattle at same time as other claim, as I wished to be paid for furs and goods first. I had hoped to find some horses and cattle after. I have made a statutory declaration in Winnipeg before James Fisher on November 9, 1885.\n\nMr. McKay. I swear that I never took part in the Rebellion in any way never aided or assisted them in any way while I was with them. I never took part in any of their movements, never acted as scout or went away with any party whatever of Half-breeds or Indians. I was coming (illegible) when La Fontaine, a Police scout, was captured, and my nephew Alexis B. Sayers, was with me, and the Half-breeds came and caught us when we were crossing the Battle River, and we crossed first, Sayers and I, and galloped off pretty lively when over, and came 7 or 8 miles this side of the river, and they again caught us, and we came with them a piece, until we saw the Police scouts and then went at once straight after the Scouts and I saw Fontaine then ahead. This party overtook me at the river; I did not know then that they were after the scouts they had started after the cattle only. When Fontaine went into the woods it was not me who told him if he came out he would not be hurt. I could have escaped at any time with the men on horseback, but we could not leave our families. When we sent our families away at Cut Knife the Indians sent a guard of 50 men after them and a lot of Indians came and watched us. It was Louis Sayers asked for Henry Sayers' rifle to shoot the Police; he is a young man; he was the only one I heard, but if he had begun, all would have begun. I know a party of Indians and Half-breeds, so I heard, came down here. Otter arrived when Rouleau's house was burnt, but I can't say who they were. I do not know anything about the raid on the teamsters. I do not know if any of our party had any Government or private property; I had traded my fur from all around,\nsome from Turtle Lake, Cold Lakes, other side of Frog Lake, from Chippenzo Indians, from the Big Mountains south of Fort Pitt. I had three men and myself trapping. I had six carts and two waggons when I went to the Indian camp and the same number when I came in here and was arrested. I can't say how many bales I had; I can't at all remember. I had over ten packs—pretty near twenty packs, I suppose. I had been with the Indians seven or eight days before Cut Knife fight. There were about twenty men of Half-breeds, and between 200 and 300 Indians in camp when it was fought.\n\nIn re James Bremner.\n\nI know the claimant. I know he has a claim. And I know he had and lost the articles mentioned in his claim as read to me. I saw the wages paid to the men. I paid him out of my store for (illegible); he was one of the settlers at the Bresaylor, but was away from home.\n\nAnd further deponent sayeth not.\n\nThe present deposition having been read to the witness, he declares it contains the truth, nothing but the truth, persists therein, and—— has declared he cannot sign.\n\nTaken, sworn and acknowledged before us. Commissioners duly appointed by Royal Commission as aforesaid at Battleford, District of Saskatchewan, North-West Territories, on the seventh day of June, in the year of Our Lord one thousand eight hundred and eighty-six.\n\n(Signed) J. Alphonse Ouimet,\n\" Thos. McKay,\n\" H. Muma,\n\nCommissioners.\n\nB.\n\nClaim of Charles Bremner—Schedule of losses of property stolen and destroyed during the Rebellion of 1885.\n\nMuskrats, 1,836, at $1.00 per doz........................................... $ 156.00\n10 Fishers, at $10.00 each...................................................... 100.00\n377 Lynx, at $3.00 each.......................................................... 1,131.00\n20 Wolf skins, at $1.25 each.................................................... 25.00\n54 Bear, at $10.00 each.......................................................... 540.00\n19 Martin, at $2.50 each.......................................................... 47.50\n479 Beaver, at $4.00 each....................................................... 1,916.00\n604 Mink, at $1.00 each.......................................................... 604.00\n239 Skunk, at 75c. each.......................................................... 179.25\n200 Red fox, at $1.25 each..................................................... 250.00\n3 Silver fox, at $50.00 each..................................................... 150.00\n6 Cross fox, at $5.00 each....................................................... 30.00\n8 Otter, at 10.00 each............................................................ 80.00\n35 Wolverine, at $4.00........................................................... 140.00\n21 Badger, at 75c. each.......................................................... 15.75\n\nTotal................................................................. $5,304.50\n\n(Signed) Charles X Bremner.\nNORTH-WEST REBELLION CLAIMS, 1885.\n\nBefore J. Alphonse Ouimet, Esq., of Montreal; Henry Muma, Esq., of Drumbo; Thomas McKay, Esq., of Prince Albert; Commissioners duly appointed and sitting as a Royal Commission at Battleford, District of Saskatchewan, North-West Territories, to investigate the said Rebellion Losses.\n\nPersonally came and appeared Mr. Charles Bremner of Battleford, merchant and farmer—Claimant. And the said Rev. Father Louis Cochin, of Poundmaker's Reserve, Missionary Priest, on behalf of the said Claimant, being duly sworn, deposes and says as follows:\n\nAt time of outbreak I was at Bresaylor Settlement. I know all the circumstances attending the capture of Charles Bremner and party by the Indians; I was in the camp at Charles Bremner's place with 10 or 12 Half-breed families, and I say they were not rebels. They did not come here, because they did not believe that the Indians would rob or injure them at all, and they had no certain news, they were separate from the others who came in here from the English Half-breed settlement near the river. Charles Bremner, I would say, was not a rebel at all. And those people acted on my advice. I told them that probably the best thing to do was to remain and work on their farms. A portion of them were willing to come here and the rest thought it best to remain there. Some of them were very poor, and had no horses, and while they were discussing what to do the Indians came. Before this I had written a letter to the Police captain signed by C. Bremner and H. Sayer, asking what we had to do, and we received no reply to this. The Indians forced us to go along with them. I was kept as a prisoner under guard, but not in a tent, but the camp was all guarded around and we could not escape; we were not close prisoners, and our camp was visited frequently to see if we were there. The Brother sent with the letter was kept at barracks and not allowed to return. These people have all lost property. James Bremner was the same, and was very quiet all through the trouble, and was with the party. Louis Caplette and the others, and John Wells, and all the party, lost their animals and property. Chas. Bremner had a large band of cattle, and lost many, and he had a large quantity of fine furs, I should say I saw from $2,000 to $3,000 worth. He had about 80 head of cattle, he had also a good stock of boots in his store, and had merchandise in his buildings as well. It was not a very large store, but can't say as to the amount, and I think it was all pillaged, and he has found some animals, but no goods, I think. Many of the animals I saw killed by the Indians.\n\nI was with Poundmaker during the entire time of the captivity of these people, and I did not see any disloyal act on his part.\n\nAnd further deponent sayeth not.\n\nThe present deposition having been read to the witness, he declares it contains the truth, nothing but the truth, persists therein, and has signed.\n\nTaken, sworn and acknowledged before us, Commissioners duly appointed by Royal Commission as aforesaid, at Battleford, District of Saskatchewan, North-West Territories, on the seventh day of June, in the year of Our Lord one thousand eight hundred and eighty-six.\n\n(Signed) J. Alphonse Ouimet,\nThos. McKay,\nH. Muma,\n\n(Signed) L. COCHIN, O.M.I.\n\nMr. Henderson, further examined:\n\nBy Mr. Casgrain:\n\n703. Have you any knowledge of the value of those furs as established by your client—the value of them?—No, sir; not the slightest.\n704. Have you any idea of the amount that he has claimed?—I think he has claimed too little.\n\nMr. Casgrain—I wanted to find out whether he would accept £3,500.\n\nThe Committee then adjourned until Wednesday, 23rd April, 1890.\n\nHouse of Commons, 23rd April, 1890.\n\nCommittee met: Mr. McNeill in the Chair.\n\nRonald C. Macdonald, recalled and further examined:\n\nThe Chairman—You are already sworn.\n\nBy Mr. Kirkpatrick:\n\n705. Have you any agreement signed by Mr. Bremner about these furs?—I have no agreement with me.\n\n706. Who has it?—My solicitor has it.\n\n707. Your solicitor said the other day, when under examination, that he did not have the agreement?—I had it then.\n\n708. You have since passed it to your solicitor?—Yes. It has no bearing upon this case whatever.\n\nMr. Kirkpatrick—Let the Chairman look at it?—The document was handed over to the Chairman.\n\nBy Mr. Kirkpatrick:\n\n709. What proportion of Bremner's furs do you think were put up on that order signed by Mr. Reed?—On the first order?\n\n710. Yes?—About one-eighth of the whole—I should say about that.\n\nBy Mr. Lister:\n\n711. There were two orders?—Yes; I stated so in my previous evidence.\n\n712. And so far as the written order was concerned, under that order one-eighth of the furs there at that time were put up?—Yes.\n\nBy Mr. Kirkpatrick:\n\n713. But none had been taken before that?—I have given my evidence on that point already; my memory does not serve me exactly, but it can be easily determined by referring to the order to Warden. To the best of my knowledge, it was subsequent to that time.\n\nBy Mr. Tisdale:\n\n714. The \"other\" person referred to who was to receive some of the furs was perhaps Col. Otter?—I said it was only hearsay. I was not there but I understood someone went to the Quartermaster's store and said there was not a sufficient quantity put up for the General.\n\nBy Mr. Weldon (St. John):\n\n715. I understand you to say that when General Middleton came down from Fort Pitt you saw him in the room where the furs were?—I did not see him there; I was only told he was there.\n\nMr. A. M. Burgess.—Recalled and further examined:\n\nBy Mr. Girouard:\n\n716. You were asked at the last meeting to produce copies of the evidence adduced before the Claims Commission by the Claimant Bremner and Caplette?—Yes.\n\n717. Have you those copies with you?—Yes.\n\n718. Do you produce them?—Yes.\n\n(For this evidence see page 35.)\n\n719. Have you got with you a list of the furs claimed by Bremner before the Claims Commission?—This is a copy of the original list furnished by the Royal Commission to the Department. (For this list see page 38.)\n\n720. The total amount claimed by Bremner for furs was?—£5,364.50.\n721. That is the amended claim?—That was the claim submitted to the Commission when it met at Battleford.\n\n722. Did you find in your Department another claim by Bremner for furs before this one?—Yes.\n\n723. How much does it come to?—$4,374.66. (For this claim see page 41.)\n\n724. Mr. Bremner, I believe, swore to the value of those furs as mentioned in Exhibit B and produced by you this morning?—Yes.\n\n725. Did not his clerk, Caplette, swear to the same effect?—Not before the Commission, I think. I think only Rev. Father Cochin and Bremner were examined before the Commission.\n\n726. Are you in a position to say whether this Schedule A is a correct copy of the claim originally submitted to the Commission by Bremner?—It is vouched for by me.\n\nMr. Lister.—I have no further evidence to offer. We accept the evidence given before the Royal Commission as evidence given before the Committee.\n\nMessrs. Gormully and Ferguson respectively said they had no more evidence to submit.\n\nThe enquiry was then closed.\n\n(Exhibit filed by Mr. Gormully.)\n\nClaim of Charles Bremner, Trader in Furs, for losses sustained during the late rebellion in the North-West Territories.\n\nThe Claimant resided at Bresaylor, near Battleford.\n\nCompensation is asked for furs taken by the Government authorities at Battleford at the time Claimant was arrested on certain charges made against him for complicity in the Rebellion. Claimant was discharged without trial, but has not since been able, he alleges, to recover his property.\n\nSCHEDULE A.\n\n| Statement of Claims | Amount Claimed | Amount recommended to be Paid |\n|---------------------|----------------|-------------------------------|\n| 371 beavers, at $4.00 | 1,484.00       | 8 cts.                        |\n| 9 wolverines, at 4.00 | 36.00          |                               |\n| 376 lynx, at 3.00    | 1,128.00       |                               |\n| 1,790 raccoons, at 1.00 per dozen | 144.00 |                               |\n| 100 red fox, at 1.00 | 200.00         |                               |\n| 494 skunks, at 1.00  | 494.00         |                               |\n| 5 wolves, at 1.25    | 6.25           |                               |\n| 10 fishers, at 10.00 | 100.00         |                               |\n| 4 common fox, at 2.00 | 8.00           |                               |\n| 31 bears, at 10.00   | 310.00         |                               |\n| 233 skunks, at 0.75  | 174.75         |                               |\n| 19 martins, at 2.50  | 47.50          |                               |\n| 23 badgers, at 0.50  | 11.50          |                               |\n| 8 otters, at 10.00   | 80.00          |                               |\n| 3 silver fox, at 50.00 | 150.00        |                               |\n| 60 days' use of horse by scout | 60.00 |                               |\n| Value of horse not returned | 200.00 |                               |\n\nSchedule B.\n\nTotal.\n\nCertified to be a true copy of the original document of record in the Department of the Interior.\n\nApril 15th 1890.\n\nA. M. BURGESS, D. M. I.\n\n1—1\n\n41\nMINUTES OF PROCEEDINGS OF THE COMMITTEE.\n\nHOUSE OF COMMONS, COMMITTEE ROOM,\nFriday, 14th March, 1890.\n\nThe Select Committee appointed to enquire into the statements made in reference to furs taken from Charles Bremner met.\n\nPRESENT:\n\nMessrs. McNeill, Casgrain,\nTisdale, Holton,\nWood (Westmoreland), Lister, and\nGirouard, Kirkpatrick.\nWeldon (St. John),\n\nOn motion of Mr. Tisdale, Mr. McNeill was chosen Chairman.\n\nMr. McNeill took the Chair, and the Order of Reference was then read, as follows:—\n\nHOUSE OF COMMONS,\nMonday, 10th March, 1890.\n\nResolved, That a Select Committee be appointed to enquire into the statements made in reference to furs taken from Charles Bremner, a Half-breed residing at Battleford, and that said Committee be composed of Messrs. McNeill, Tisdale, Wood (Westmoreland), Girouard, Weldon (St. John), Casgrain, Holton, Lister and Kirkpatrick—the last two mentioned without power of voting; and that the Committee have power to send for persons and papers, and to employ a short-hand writer to take down evidence, and that it is desirable that any witness to be examined by the Committee should be examined on oath.\n\nAttest,\n\nJ. G. BOURINOT,\nClerk of the House.\n\nThe Committee then discussed the Order of Reference, and it was agreed that Mr. Lister should prepare a statement of the charges and submit the same to the Committee at its next meeting, and that a copy of such statement, when prepared, be communicated to General Middleton and to Hayter Reed, so that they may be in a position to reply to the same either in person or in writing.\n\nThe Committee then adjourned until Wednesday next at 11 a.m.\n\nCOMMITTEE ROOM,\nWednesday, 19th March, 1890.\n\nCommittee met.\n\nPRESENT:\n\nMr. McNeil in the Chair. Messrs. Tisdale, Wood (Westmoreland), Girouard, Weldon (St. John), Casgrain, Holton, Lister, and Kirkpatrick.\n\nGeneral Middleton and Mr. Hayter Reed were in attendance.\n\nPursuant to the agreement arrived at by the Committee at its last meeting, Mr. Lister submitted the following statement of the charges made against General Middleton, which was read. (For this statement, see page 1 of the minutes of evidence).\n\nMr. Lister was heard in reference to his statement going beyond the charges specified in the Order of Reference.\n\nOn motion of Mr. Wood (Westmoreland), it was\n\nOrdered, That paragraph 3 and sub-paragraphs a, b, and c, of Mr. Lister's statement, be struck out, as being beyond the Order of Reference, and the Committee not being authorized to investigate the same.\n\nMessrs. Payne and Barrows, shorthand reporters, were present, for the purpose of taking down the evidence given before the Committee, and were sworn to take down and transcribe faithfully the same.\nMr. Gormully, counsel for General Middleton, made the following statement on behalf of General Middleton. (For this statement, see page 2 of the evidence).\n\nMr. A. Ferguson, counsel for Mr. Hayter Reed, made the following statement on behalf of Mr. Reed. (For this statement, see page 3 of the evidence).\n\nMr. Ronald C. Macdonald, of Battleford, was then called, sworn and examined by Mr. Lister and others. (For his evidence see Minutes of Evidence).\n\nOrdered, That the witness bring to the next meeting the power of attorney given to him by Charles Bremner.\n\nMr. Kirkpatrick referred to part of a letter written by witness to Col. Morris.\n\nOrdered, That the said letter be filed. (For this letter, see page 11 of the evidence.)\n\nOrdered, That the following persons be summoned to appear at Ottawa, and bring with them all papers in connection with the Charles Bremner fur enquiry:—Charles Bremner, Louis Caplette, Stephens Warden, Robert Macdonald, Arthur Dorion, Col. Morris, Major Steele and Pierre Boissonnault.\n\nThe Committee then adjourned to the call of the Chair.\n\nCommittee Room,\nTuesday, 1st April, 1890.\n\nCommittee met.\n\nPRESENT:\n\nMr. McNeill in the Chair: Messrs. Tisdale, Wood (Westmoreland), Girouard, Weldon (St. John), Casgrain, Holton, Lister and Kirkpatrick.\n\nThe shorthand reporters were in attendance.\n\nGeneral Middleton and Mr. Hayter Reed, and their counsel, Messrs. Gormully and Ferguson, were in attendance; as were also Mr. Ronald Macdonald and Mr. Stuart Henderson, solicitor for Charles Bremner.\n\nThe Chairman laid before the Committee, copies of the telegrams sent to J. M. Skelton, Battleford, summoning Charles Bremner, Louis Caplette, Stephens Warden and Robert Macdonald to appear and give evidence, and stated that after consultation with Mr. Lister and a majority of the members of the Committee he had for the present cancelled the order requiring the attendance of these persons, so as to save expenses.\n\nMr. Henderson was then called, sworn and examined by Mr. Kirkpatrick and others. (For his evidence, see Minutes of Evidence.)\n\nOrdered, That Mr. Henderson bring with him to the next meeting all papers in his possession in connection with this enquiry.\n\nGeneral Middleton was then called and sworn, and made the following statement. (For this statement, see page 13 of the Minutes of Evidence.)\n\nGeneral Middleton was then examined by Mr. Lister and others. (For his evidence, see Minutes of Evidence.)\n\nGeneral Middleton requested to be allowed to make and was permitted to make a statement with respect to a horse and furs alleged to have been appropriated by him at Batoche. (For this Statement, see page 19 of the Minutes of Evidence.)\n\nMr. Hayter Reed was then called and sworn, and made the following statement. (For this statement, see page 22 of the Minutes of Evidence.)\n\nMr. Reed was then examined by Mr. Lister and others. (For his evidence, see Minutes of Evidence.)\n\nMr. Reed filed a letter, dated Fort Pitt, 1st July, 1885. (For this letter, see page 31 of the Minutes of Evidence.)\n\nGeneral Middleton was then further examined. (For his evidence, see Minutes of Evidence.)\n\nMr. Hayter Reed was then re-called and further examined. (For his evidence, see Minutes of Evidence.)\n\nThe Committee then sat with closed doors; after which they adjourned to the call of the Chair.\nCommittee Room.\n\nFriday, 18th April, 1890.\n\nCommittee met.\n\nPRESENT:\n\nMr. McNeill in the Chair—Messrs. Tisdale, Girouard, Casgrain, Holton, Lister, Kirkpatrick, and Wood (Westmorland).\n\nThe shorthand writers were in attendance.\n\nOrdered, That Mr. Stuart Henderson, of Ottawa, be summoned to appear forthwith before the Committee, and to bring with him all papers relating to this enquiry.\n\nOrdered, That Mr. Ronald Macdonald be summoned to appear forthwith before the Committee.\n\nOrdered, That Mr. A. M. Burgess, Deputy Minister of the Interior, be requested to appear forthwith before the Committee, and to bring with him all papers relating to this enquiry filed with the Rebellion Claims Commission.\n\nAt the request of Mr. Casgrain the minutes of the last meeting were read.\n\nMr. Stuart Henderson appeared in obedience to the summons of the Committee, and was called and further examined by Mr. Kirkpatrick, and filed a paper signed by Mr. Macdonald, on behalf of Mr. Bremner, appointing Mr. Henderson to act for the said Bremner. Also a paper appointing Mr. Macdonald agent for the prosecution of the claims of the persons whose names are appended thereto, for losses incurred in the Rebellion of 1885, and agreeing to pay the said Macdonald 5 per cent. of the amount recovered. (For Mr. Henderson's evidence, see Minutes of Evidence.)\n\nMr. Kirkpatrick asked that all papers relating to this enquiry in the possession of Mr. Henderson be submitted to the Chairman, to ascertain if they had any bearing on the question.\n\nThe witness objected to produce these papers. Committee deliberated, and determined that Mr. Henderson be not required to produce these papers, insomuch as he declared that he had already produced all papers in his possession bearing upon the enquiry, except such as referred to a suit by Bremner against General Middleton.\n\nMr. A. M. Burgess appeared as requested, and was called, sworn and examined by Mr. Girouard and others, and put in the evidence of, and schedule of losses of, Charles Bremner, made before the North-West Rebellion Claims Commission; also the deposition of Reverend Father Louis Cochin, made before the same Commission. (For these papers, see page 35 of Minutes of Evidence.)\n\nOn motion of Mr. Girouard, it was\n\nOrdered, That the evidence and schedule put in by Mr. Burgess be copied and incorporated as part of his evidence. (For Mr. Burgess' evidence, see Minutes of Evidence.)\n\nMr. Kirkpatrick suggested that counsel for General Middleton and Mr. Reed now submit further evidence if they so desire.\n\nMr. Gormully filed a certified copy of Mr. Bremner's claim. (For this claim, see page 41 of the Minutes of Evidence.)\n\nMr. Henderson was further examined by Mr. Casgrain. (For his evidence, see Minutes of Evidence.)\n\nMr. Girouard moved, seconded by Mr. Casgrain,\n\nThat insomuch as the Committee have no evidence of what became of the case of furs addressed to Colonel Bedson—Colonel Bedson be summoned to appear and give evidence before this Committee, which was negatived on the following division:—Yeas, 2; nays, 3.\n\nOrdered, That Mr. Henderson appear at the next meeting.\n\nOrdered, That Mr. Ronald Macdonald (who could not be found this morning), be summoned to appear at the next meeting of the Committee, and to bring with him all the papers in his possession, and especially any agreement executed by Charles Bremner in relation to the matter now before the Committee for enquiry.\n\nThe Committee then adjourned until Wednesday at 11 a.m.\nCOMMITTEE ROOM.\nWednesday, 23rd April, 1890.\n\nCommittee met.\n\nPRESENT:\n\nMr. McNeill in the Chair—Messrs. Tisdale, Wood (Westmoreland), Girouard, Weldon (St. John), Casgrain, Holton, Lister and Kirkpatrick.\n\nThe shorthand writers were in attendance.\n\nMr. Stewart Henderson and Mr. Ronald Macdonald attended in obedience to the summons of the Committee.\n\nMr. Macdonald was called and further examined by Mr. Kirkpatrick and others. (For his evidence, see Minutes of Evidence.)\n\nMr. Macdonald submitted an agreement made by him with Charles Bremner to the Chairman, who stated that the matter contained therein was irrelevant to the enquiry. The agreement was then returned to Mr. Macdonald.\n\nMr. Tisdale moved,\n\nThat no more evidence be taken, and that the Committee now proceed to the consideration of its report.\n\nMr. Girouard moved in amendment,\n\nThat Mr. Burgess be called to give evidence in regard to the schedules put in.\n\nAnd the question being put on the amendment; it was agreed to on a division.\n\nMr. Burgess was accordingly called and examined by Mr. Girouard. (For his evidence, see Minutes of Evidence.)\n\nMr. Lister made the following statement:—\n\n\"I, for Bremner, state to the Committee that Bremner will accept $4,500 in full of his claim for furs.\"\n\nMessrs. Lister, Ferguson and Gormally, each stated in reply to the Committee, that they had no further evidence to submit.\n\nOn motion of Mr. Girouard, seconded by Mr. Weldon (St. John), it was Ordered, That the following be adopted as the report of this Committee, and reported to the House, together with the evidence taken and the proceedings of the Committee. (For this report see report, prefixed to Minutes of Evidence.)\n\nAttest,\n\nN. ROBIDOUX,\nClerk of Committee.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001859.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 50, "total-input-tokens": 69660, "total-output-tokens": 41194, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 189, 2], [189, 189, 3], [189, 3418, 4], [3418, 4429, 5], [4429, 7237, 6], [7237, 11480, 7], [11480, 15480, 8], [15480, 18953, 9], [18953, 22406, 10], [22406, 25374, 11], [25374, 28354, 12], [28354, 32137, 13], [32137, 35393, 14], [35393, 38419, 15], [38419, 41964, 16], [41964, 45150, 17], [45150, 48667, 18], [48667, 52675, 19], [52675, 56096, 20], [56096, 59702, 21], [59702, 63073, 22], [63073, 66272, 23], [66272, 70082, 24], [70082, 74000, 25], [74000, 77267, 26], [77267, 81050, 27], [81050, 85060, 28], [85060, 88321, 29], [88321, 91410, 30], [91410, 94813, 31], [94813, 98043, 32], [98043, 101227, 33], [101227, 104321, 34], [104321, 107599, 35], [107599, 110743, 36], [110743, 112609, 37], [112609, 115550, 38], [115550, 118307, 39], [118307, 122229, 40], [122229, 126756, 41], [126756, 131198, 42], [131198, 134157, 43], [134157, 137639, 44], [137639, 140309, 45], [140309, 143414, 46], [143414, 146121, 47], [146121, 149449, 48], [149449, 152943, 49], [152943, 154676, 50]], "primary_language": ["None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]