[{"id": "7fae5f088a648f83b885b4eef4b3a9888637d4d2", "text": "RIEL\n\nREPONSE\n\nMONSIEUR J. A. CHAPLEAU\n\n—PAR—\n\nERNEST TREMBLAY\n\nST-HYACINTHE\nDES PRESSES À VAPEUR DE \"L'UNION\"\n1885\nA l'honorable Monsieur Joseph Adolphe Chapleau\n\nSECRÉTAIRE D'ÉTAT\n\nMonsieur le ministre,\n\nSous l'en-tête Aux électeurs du comté de Terrebonne, vous venez de publier un manifeste non daté qui a jeté dans la stupeur et dans la consternation une quantité étonnante de personnes vous ayant jusqu'à présent honoré d'une confiance plus ou moins accusée. Je ne suis pas électeur dans le comté de Terrebonne, monsieur le ministre, mais je le suis dans le comté de St-Hyacinthe, lequel fait partie de mon pays, à l'administration des affaires duquel vous vous trouvez proposé grâce à la confiance dont je viens de vous parler. Puis, le sujet principal de votre écrit est un homme décédé dans des circonstances lamentables et au malheureux sort duquel je m'intéresse, comme vos commettants immédiats, avec la totalité de mes co-nationaux. Si je m'ingère à vous répondre, c'est donc que je m'y crois ainsi autorisé, et je vais m'efforcer de remplir ma tâche avec toute la somme de bienveillance que peut comporter la nature particulière de mon entreprise.\n\nVous faites partie d'un gouvernement qui applique à la gestion des affaires générales du Canada une doctrine à laquelle, avec mes co-religionnaires politiques qui forment la minorité apparente de la population, je suis résolument hostile. Avant le 16 du mois de novembre, les seuls libéraux canadiens donnaient—par leurs représentants dans les chambres—un effet pratique à l'opposition que provoque dans le pays votre administration. Les conservateurs—les uns avec hésitation, les autres avec une ardeur non dissimulée—vous accordaient l'efficacité de leur appui. Votre gouvernement était populaire, et, dans plus d'un quartier, vous étiez personnellement adulé. Que s'est-il passé depuis cette date pour modifier si considérablement les rapports qui existent entre vous et vos parti-\nsans? C'est ce que je voudrais expliquer avec autant de concision et de précision que possible.\n\nLa façon déplorable dont les affaires des territoires du Nord-ouest avaient été traitées par les fonctionnaires relevant de votre autorité et soumis à votre contrôle; la guerre civile provoquée par la négligence du gouvernement; l'impérition criminelle du lieutenant-gouverneur Dewdney et les forfaits innommables de vos émissaires de tous étages; les dépenses effrayantes que cette guerre a nécessitées et la grande effusion du sang des nôtres qui en a été la conséquence inévitable; l'incarcération dans les prisons et dans les pénitenciers—agrandis exprès—de ceux des Métis qui avaient été appréhendés pour avoir osé se défendre contre la soldatesque gouvernementale; tout cela n'avait pas ébranlé dans des proportions bien appréciables la confiance que vos partisans reposaient en vous. Louis Riel, le chef proclamé des insurgés, après avoir subi devant les singulières assises de Regina un procès plus singulier encore, a été, conformément ou non au verdict du jury, condamné à la peine capitale par monsieur Richardson, magistrat stipendié et stipendié. Cette étrange condamnation a créé dans toute Canada une profonde et émouvante sensation, mais la stupeur universelle n'a pas été jusqu'au point d'ébranler d'une façon décisive la confiance obstinée que vous aviez su insuoir au gros du public. On comptait fermement que vous sauriez bien empêcher l'exécution de cette sentence visiblement inique qu'on avait manifestement arrachée au tribunal pour en faire un sanglant outrage à la race, à la nationalité à laquelle Riel et vous, monsieur le ministre, vous apparteniez. On comptait aussi énormément sur la duplicité bien connue du chef du cabinet. Cette duplicité, elle fait depuis des années l'admiration opiniâtrement sereine de tous vos amis, et elle a, dans leur appréciation, tenu lieu au premier ministre de toutes les vertus, de toutes les capacités valables qu'on exige d'un homme d'Etat. \"Sir John, disait-on, saura bien encore escamoter cette muscade encombrante pour sa politique et déplaisante aux sectaires fanatiques sous les talons desquels nous paraissions aujourd'hui écrasés.\" Voilà les propos que l'on tenait, monsieur le ministre, que l'on a tenus jusqu'au jour fatal où Louis Riel a été par vos ordres accroché au gibet de Regina.\n\nEnfin Riel a été pendu; il est mort et repose aujourd'hui dans le sol de la patrie qui le pleure. Eh bien, monsieur, admirez la tenacité de la confiance dont vous aviez pénétré vos amis,—parmi lesquels je compte un grand nombre des miens,—de cette confiance\ndont je vous entretiens depuis que j'ai commencé à écrire ces lignes. Sur le contingent de ces amis il en est resté un bon quart qui n'ont pas voulu croire à la dépravation que vous attribuait les trois autres quarts de vos partisans de naguère. Ces fidèles répondaient à toutes les observations outrageantes pour votre caractère, qui se faisaient dans le public, que vous n'aviez pu agir de la sorte sans avoir de forts motifs, nullement entachés de véna- lité; que, incontestablement, vous ne pouviez vous dérober à la responsabilité constitutionnelle de la décision prise par le cabinet, puisque vous y aviez donné votre acquiescement; mais ils voulaient toujours vous trouver plus faible et plus malheureux que coupable intérieurement. C'est avec une anxiété fébrile que ces amis dévoués attendaient, dans le silence de leur cœur, les explications que la Minerve,—jadis la trompette de vos triomphes et maintenant le partevoux de votre défaillance,—promettait en votre nom. \"Vous verrez, disaient-ils; que s'il s'est montré comme ministre impropre à mériter davantage la confiance du public, il ne s'est pas conduit comme particulier de façon à se rendre indi- gne de nos douloureuses sympathies.\" Vous comprenez bien, monsieur le ministre, que ceux-là espéraient contre tout vestige d'espérance. À mes yeux, il n'y aurait eu que la résurrection de Riel, opérée par la force irrésistible de vos puissantes explications, pour justifier cette incroyable crédulité. Hélas! elles sont arrivées vos explications; et, loin de tendre à faire sortir du tombeau cette victime de l'oppression administrative, ce martyr de la cause de la liberté et de la justice, vous vous acharnez à le tuer de nouveau, et le dernier reste de vos amis les plus zélés n'ont plus pour vous que des paroles d'exécration. \"Mais ce n'est pas un homme ce Chapleau, disent-ils maintenant, c'est un chacal, c'est une hyène, car il n'y a que ces bêtes fauves qui déterrent les cadavre pour en repaître leur voracité.\" Voilà les exagérations de langage aux- quelles vous avez contraint vos adulateurs; voilà les excès de parole que j'hésite à vous transcrire ici parce que je suis ennemi de toute violence. Et n'allez pas croire que c'est par un artifice de rhétorique que je vous transmets cette expression des sentiments soulevés contre vous. C'est dans les rangs des vôtres qu'on vous reproche d'avoir recommencé le procès d'un homme qui a subi la peine de la sentence portée contre lui et à qui on ne peut plus demander, selon la formule, s'il a quelque chose à dire avant que la loi ait son cours. Car, dit Monseigneur Taché, dans un écrit qu'il vient de livrer à la publicité, \"pourquoi joue-t-on le rôle si inique\nde recommencer le procès de l'infortuné, exécuté devant le public, en invoquant les témoignages des Révérends Pères André et Fourmond, qui, mis sous serment à la cour, ont rendu un témoignage dont la conclusion naturelle n'était certainement pas l'échafaud? On va jusqu'à torturer l'âme si généreusement aimante de Monseigneur Grandin, en lui prêtant un rôle indigne de sa position et de son cœur. Et tout cela, on a l'audace de le dire, pour faire prévaloir la vérité. Qui donc, monsieur le ministre, joue le rôle si inique dont parle ici le vénérable archevêque? Qui donc prête à Monseigneur Grandin un rôle indigne de sa position et de son cœur? Quel est celui enfin qui prétend faire prévaloir la vérité par les moyens que vient de réprouver si énergiquement le prélat protecteur de la victime du gouvernement? C'est ce que nous aurons peut-être l'occasion de constater dans l'examen subséquent de votre mani-feste. En attendant, laissez moi vous demander ce qu'il y a de fondé dans cette assertion de l'Étendard faite au sujet d'un docu-ment analogue au vôtre, évidemment élaboré par le ministère, et signé du nom de l'ancien ministre de la justice, monsieur Campbell: \"Ce qui frappe tout d'abord en lisant ce long document, c'est que le gouvernement ne se montre si prodigue d'arguments qu'après la perpétration du crime qui lui est reproché.\" (L'Étendard 12 décembre 1885). Pourquoi, d'après l'affirmation du même journal, avez-vous choisi dans les documents supprimés au procès ceux qui paraissent défavorables au défunt, sans produire en même temps ceux de ces papiers qui auraient pu servir à la défense de celui dont le trépas violemment produit a clos la bouche pour toujours? Car il y a cela de particulier chez vous, monsieur le ministre, que vous faites aujourd'hui à Riel des reproches qui ne lui ont jamais été faits de son vivant; que vous voudriez que cette victime des circonstances créées par votre gouvernement eût été toute sa vie irréprochable dans sa conduite privée, impeccable dans sa conscience, alors que vous vous montrez si bien disposé à la miséricorde envers ceux que vos propres amis appellent ses persécuteurs et ses bourreaux. Se peut-il que tout vous soit permis et qu'il faille que ceux qui se mettent en opposition à vos actes administratifs soient plus purs que les anges? Car, \"où en serions-nous, demande la Presse, journal ami de votre cause, s'il faut faire le procès aux victimes au lieu de le faire au meurtrier; s'il faut démontrer par témoins que, dans le cours de sa vie, celui qu'on a tué n'a jamais eu à se reprocher ni une faiblesse ni une imprudence?\" Riel me paraît avoir sur vous, au point de vue des fautes de la conscience,\nun avantage marqué : il s'est repenti des siennes, pendant que vous semblez vouloir persister dans les vôtres. Vous conviendrez qu'il n'a jamais voulu convertir en vertus les vices que vous lui reprochez. Pourra-t-on jamais dire la même chose de ceux avec qui vous avez conjuré sa perte ? C'est l'opinion généralement répandue parmi vos partisans que votre manifeste est un tissu de diffamations et de calomnies contre la mémoire de Louis Riel. Or, il y a un fait dont vous ne contesterez pas l'existence, c'est que la mort de cet homme a jeté toute la nation dans le deuil. Même en supposant vraies les accusations non fondées que vous portez contre lui, comment n'avez-vous pas la décence de respecter la douleur—légitime ou non—de vos compatriotes ? Dans quel but essayez-vous de ternir l'éclat de nos larmes ? De quel droit venez-vous souiller nos pleurs ?\n\nVous avez remarqué, je l'espère, que ce n'est pas moi qui parle ici, mais que ce sont les sentiments mêmes de vos suivants, maintenant séparés de vous, que je signale à votre appréciation. Vous m'alléguerez peut-être que vous n'êtes pas complètement délaissé et qu'il vous reste encore quelques fidèles auxquels la Minerve sert de truchement. Je ne contesterai pas la chose ; il fallait s'y attendre. Il y avait là une occasion à saisir pour ceux qui ne pouvaient se signaler au public par la supériorité de leur intelligence ni par la splendeur de leur intégrité, cherchent à se distinguer par la transcendance de leur infamie. Le czar Nicolas voulait étonner le monde par la profondeur de son ingratitude, tout comme les rares approbateurs actuels du ministère veulent s'attirer l'attention et les faveurs de sir John A. Macdonald par la noirceur de leur ignominie.\n\nQue va-t-il sortir de tout ceci ? Les libéraux n'ont pas attendu la mort de Riel pour vous témoigner leur désapprobation. Nous avons constamment combattu la politique qui nous conduisait fatalement à cette catastrophe. Nous avons conjuré le gouvernement de revenir sur ses pas dans la voie périlleuse où il s'était bénévolement engagé ; nous l'avons supplié de rendre justice à ceux à qui justice était due ; nous lui avons demandé, dans nos journaux et dans les chambres, d'examiner les prétentions des Métis ; nous lui avons fait voir qu'après avoir paralysé toutes les forces vives du pays ; après avoir stérilisé les capacités de l'agriculture et entravé de la manière la plus funeste les mouvements du commerce et de l'industrie, il tarissait toutes les sources d'exploita-\ntion naturelles et légitimes et qu'il livrait la fortune publique à l'audace des faiseurs dont les opérations sont la cause la plus immédiate du soulèvement du Nord-ouest. Aujourd'hui, après la sombre tragédie dont Riel a été l'héroïque acteur, nous pouvons dire — quelles que soient les prétentions contraires — que nous sommes innocents de la mort de ce juste. Et pour cette déclaration nous n'avons pas besoin de faire venir le bassin symbolique de Ponce-Pilate pour nous laver les mains, car nous n'avons pas les mains souillées : elles n'ont pas trempé dans le sang de l'innocent.\n\nMaintenant, quelque soit le caractère lugubre de la question qui nous occupe ; quelles que soient les appréhensions simulées des fomentateurs intéressés de discorde de race, il faudra toujours que cette question se résolve en une simple affaire d'administration. C'est lors de l'examen du prochain budget que va se faire l'étude la plus sérieuse et la plus pratique de la situation que nous ont faite les derniers événements. La session qui va suivre offrira sous ce rapport un intérêt tout spécial. Si Louis Riel n'eût pas été exécuté, il est présumable que lorsque le ministère aurait demandé les crédits qu'il lui faut pour le futur exercice financier, les libéraux auraient invoqué, comme il vont le faire, les raisons qui militent le plus fortement contre le gouvernement. Ils auraient reproché aux ministres l'augmentation scandaleuse des frais annuels de l'administration, la progression vertigineuse de la dette publique, le fléchissement dont notre crédit est menacé, la dépréciation de la valeur des terres publiques causée par la guerre, l'effusion du sang et la quantité énorme de millions qu'il nous va falloir débourser pour solder le coût de toutes ces choses. Si, pour se justifier, le gouvernement eut invoqué le fait de l'insurrection ; s'il eut prétendu, et même s'il eut démontré qu'il avait fait tout ce qu'il avait pu pour éviter ce conflit après que le pays en eut été menacé, les libéraux auraient été encore bien fondés à demander la déchéance du cabinet en alléguant l'incapacité même et l'impuissance dont le gouvernement aurait excipé. Car enfin les gouvernements sont chargés de maintenir la paix, et ceux qui sont impuissants à remplir cette besogne, ne se trouvant pas à la hauteur des circonstances, doivent céder leur place à d'autres. Voilà ce que dit la logique et voilà ce qu'auraient demandé les libéraux en s'appuyant sur les principes du plus strict droit constitutionnel. Et si Riel n'eût pas été pendu, il est probable que le parti ministériel dans son ensemble aurait repoussé les prétentions du parti de l'opposition et aurait acclamé ce gouvernement modèle.\nqui a la complaisance grande de ne pas couronner par la pendaison des nôtres ses extravagances administratives. Mais Riel a été pendu, et cela amène au budget un chapitre de dépense imprévue pour l'acquittement de laquelle les conservateurs ne se montreront peut-être pas disposés à voter le crédit nécessaire. Il y aura, si la comptabilité est bien précise, un item porté comme suit : Acquisition d'une corde et un autre item mentionné de la sorte : Construction d'une potence ; ces items seront donnés dans les dépenses casuelles—contingencies—du département de la justice, et ils devront avoir en regard les noms du fournisseur et de l'entrepreneur favorisés de la clientèle du gouvernement. Si les conservateurs canadiens-français trouvent cette dépense non-seulement inutile et extravagante, mais encore odieusement intempestive, et s'ils jugent à propos de renverser le ministère qui n'a pas su l'éviter, je vous le demande, monsieur le ministre, n'auront-ils pas fait là un acte purement constitutionnel ; strictement parlementaire, et pourra-t-on raisonnablement les accuser d'avoir violé la constitution ou de s'être mis en état d'insurrection contre l'autorité ? Il me semble que voilà la question réduite à sa plus simple expression, et vous me pardonnerez ma curiosité si je veux savoir ce que vous auriez à répondre à ce petit énoncé. Dans le cas que je vous présente ici les conservateurs-ministériels seront devenus des conservateurs-oppositionnistes ; mais seront-ils devenus des traîtres, ou des imprudents ou des insensés, comme on le prétend dans certains endroits infiniment rares ? Pour moi, il paraît à mon ingénuité que, pour le grand parti conservateur, le bruit de la chute de Riel, brusquement arrêté dans l'espace par l'ignoble lacet signalé plus haut, a été le coup de foudre sur le chemin de Damas ; que l'éclair a dessillé les yeux de nos adversaires aveuglés par les éblouissantes fantasmagories de notre perpétuel premier ministre, et qu'ils voient maintenant comme dans le cristal le plus pur le caractère condamnable de la politique dont vous avez été le populaire interprète. Il est seulement profondément à regretter qu'il ait fallu pratiquer sur la personne de l'un des nôtres l'acte de brutale chirurgie qui a fait sortir le sang dont l'effusion a détruit cette déplorable léthargie. Pour faire déborder le vase qui contient les iniquités ministérielles, ce n'est pas une goutte d'eau—selon l'expression commune—qu'il a fallu ; c'est une goutte de sang. Et cela est beaucoup plus triste que vous ne paraissiez le croire. Une fois le mouvement de réaction commencé, nos contradicteurs de jadis semblent vouloir le pousser jusqu'à ses dernières consé-\nquences. Ils mettent à cette œuvre une impitoyable logique, et leurs aveux se succèdent avec une rapidité qui cause un véritable plaisir à tout ce que le pays compte d'hommes sincères. Je pourrais vous citer à l'appui de ce que je dis ici une foule d'organes de la presse conservatrice et une forte quantité de déclarations faites par des députés et des orateurs de votre parti. Mais vous les connaissez sans doute. Je vais me borner à vous citer ce qu'à dit le député de Bellechasse, M. G. Amyot, qui semble avoir mis dans l'émission de ces vérités toute la fougue, toute la pétulance qu'il mettait autrefois à vous manifester son enthousiaste admiration. Dans un discours prononcé à Bellechasse, le 29 du mois de novembre dernier, M. Amyot disait :\n\nLa mort de Ricl est donc un crime dans les circonstances.\n\nQui en est responsable ? Sont-ce les députés ? Non, ils ont protesté de toutes leurs forces, bien que leur temps d'agir soit surtout pendant les sessions de la Législature, et que les ministres ne les aient pas même consultés. Est-ce la presse ? Non, elle a noblement fait son devoir. Est-ce le gouvernement local ? Non, la question n'est pas de son ressort.\n\nLe gouvernement fédéral seul est responsable. C'est lui qui a préféré l'orangisme au monde civilisé. Sir John a exigé la pénalisation, à la demande de l'orangisme, et nos ministres ont concouru. Le premier coupable, c'est sir John A. Macdonald ; le deuxième, c'est le chef de notre province, sir Hector L. Langevin. À lui surtout incombaît le devoir impérieux de représenter nos vues dans le cabinet, et de les faire prévaloir quand elles étaient pour la clémence.\n\nAh ! malheureusement, ce n'était pas la première fois qu'il commettait de ces actes de faiblesse étonnante. Il n'est pas arrivé, du premier coup, à concéder la vie d'un compatriote. C'est mon pénible devoir de vous dire tout ce que j'en pense. Depuis longtemps sir Hector cédait systématiquement quand il s'agissait de nos intérêts.\n\nÀ l'origine de ce parlement il a consenti à n'avoir pas d'orateur français à Ottawa. La coutume introduite par sir George, de faire-présider l'une des deux chambres par un canadien-français avait invariablement été respectée ; céder sur ce point, c'était commettre une grande faute, car elle impliquait l'abandon d'un droit national et d'un principe. On nous demanda de tolérer : il ne fallait pas froisser Ontario, on aurait des compensations, un peuple doit avoir des vues larges ! Nous cédaimes le chagrin et la honte au cœur. On ne rompt pas du premier coup des liens vieux et puissants. Du reste, on nous promettait que ce n'était que pour peu de temps.\n\nPuis vint le bill des licences. Nous réclamâmes au nom de la lettre et de l'esprit de la constitution. C'était priver les provinces de droits indéniables et très importants. Rien n'y fit : sir Hector céda. Nos protestations furent telles que le gouvernement consentit à faire décider la question de droit par les cours. La Cour Suprême nous a donné raison. Le gouverne-\nment aurait dû se contenter de cette interprétation par notre plus haute cour et passer une loi pour enlever tout doute et déléguer aux gouvernements locaux tout pouvoir que pouvait prétendre le gouvernement central. Mais sir John tend à l’union législative, et il a porté appel au conseil privé. La cause n’y est pas plus tôt en délibéré, qu’il se rend précipitamment en Angleterre ! On verra l’effet de sa présence là.\n\nVint la question de l’octroi considérable au Pacifique. Nous étions favorables à cette mesure, mais nous avons demandé compensation pour les vieilles provinces ; nous voulions aider l’ouest pourvu que nous pussions aider l’est en même temps. Quelle lutte il nous a fallu faire ! Finalement on nous promit remboursement d’une partie de ce que nos chemins de fer avaient coûté. Mais sur le montant promis, on nous a gardé $1,000,000, et sir Hector y consent volontiers.\n\nNous avons demandé le terminus du Pacifique à Québec et une ligne courte sur le sol canadien. Sir Hector a consenti à nous laisser berner de la plus belle façon sur ce sujet.\n\nNous avons demandé un traité de commerce avec la France. Nous y avons un immense intérêt. Sir Charles Tupper avait obtenu le consentement de l’Angleterre et de la France. Mais sir John refuse et sir Hector cède sur ce point comme sur les autres.\n\nNous avons demandé une juste part dans les emplois du Nord-ouest. Il paraît que ça dérangerait bien des spéculateurs orangistes et sir Hector n’insiste pas pour ne pas déplaire à ces messieurs.\n\nEt quel travail énorme il nous faut faire en chambre pour empêcher une législation constamment centralisatrice ! Sir Hector l’a tolérée pour conserver et augmenter le respect qu’Ontario a pour ses vues larges !\n\nIl n’y a pas jusqu’à l’Intercolonial, pour la partie qui passe chez nous, où la faiblesse de sir Hector ne se fasse pas sentir. Il laisse enlever, un à un, à M. Macdonald, le digne surintendant actuel, tous ses pouvoirs. Aussi l’administration de ce chemin ne se soucie-t-elle pas du tout des besoins et du confort de cette partie du pays. Sir Hector était le protecteur naturel des Métis français. Il avait toute une province à sa suite pour lui donner la force de les protéger. Il les a laissé maltraiter sans protéger, sans nous informer de leurs souffrances. Son voyage au Nord-ouest n’a servi qu’à lui faire recevoir des adresses de félicitations.\n\nSir Hector devrait comprendre l’importance d’encourager l’émigration française vers les riches régions du Nord-ouest : il n’en fait rien.\n\nIl a consenti sous prétexte de rendre justice aux Métis, à ce qu’on leur donnait des scrips qui font la fortune des sociétés anglaises, mais qui, pour les Métis, ne sont qu’un moyen d’exploitation de leur crédulité et imprévoyance. En fin de compte, ces scrips n’ont été qu’un moyen de livrer gratuitement le sol du Nord-ouest aux spéculateurs étrangers.\n\nJe pourrais multiplier les exemples. Sir Hector semble avoir pour principe, depuis quelque temps, de céder toujours et partout. Pourquoi le fait-il ? Est-ce par manque de talent ? Non. On me dit qu’il espère, par\nce moyen, devenir premier ministre de la Puissance, et que cela contribue-\nrait à notre gloire nationale. Il peut avoir raison, mais je ne suis pas de\nson avis.\n\nCe spécimen des dispositions actuelles de vos amis doit suffire\nà vous démontrer que les exigences despotiques de l'esprit de parti\nn'ont plus de prise sur ceux que l'exécution de l'apôtre des revendications métisses a réveillés de leur ataraxie et qu'ils condamnent\nla politique générale du gouvernement sans se soucier plus que\ncela de l'approbation antérieure qu'il lui ont donnée.\n\nJe vais prendre maintenant la liberté d'examiner votre manifeste\npoint par point et de le soumettre à l'épreuve de mes commentai-\nres. Mais il convient, avant de commencer, de vous rappeler que\nla pendaison de Riel a été appelée dans toutes les assemblées\npubliques et par la quasi totalité des journaux de notre province,\nun meurtre politique, un assassinat juridique, un crime horrible\nde la perpétration duquel le gouvernement de sir John A. Macdo-\nnald, tel que composé lors de l'exécution, doit être tenu constitu-\ntionnellement responsable. MM. Trudel, Desjardins, Beaubien,\nGirouard, Vanasse, Armand, Bellerose, Bergeron, tous sénateurs\net députés conservateurs, ont été de cet avis et ont déclaré avoir\nété odieusement trompés par vous et par vos collègues. MM.\nAmyot, Tarte, Garneau, Faucher de St-Maurice et autres sommi-\ntés du parti ministériel ont fait des déclarations analogues. À l'as-\nsemblée du Champ-de-Mars, on a vu des hommes comme MM. J. L.\nBeaudry, Coursol, Malhiot, protester avec les orateurs libéraux\ncontre ce meurtre, contre ce crime épouvantable. Le Monde, mon-\nsieur le ministre, le Monde du 23 novembre a appelé la chose l'ou-\ntrage sanglant fait à notre nationalité. Aurais-je besoin de vous\nrappeler ce qu'ont pu dire les autres journaux conservateurs? Je\nne vous remets cela en mémoire que pour vous prévenir que\nsi, au cours de mes remarques, vous trouvez les mots assassins,\nmeurtriers ou leurs équivalents, ce n'est pas moi qui les ai inven-\ntés, puisqu'on les trouve dans tous les dictionnaires, et que ce n'est\npas moi non plus qui en ai inauguré ici l'application qualificative;\nmais que ce sont vos propres amis, dont je ne ferai qu'interpréter\nles sentiments en me servant de leur langage.\n\nVous débutez ainsi:\n\n\"Je vous ai promis un exposé franc et loyal des raisons qui ont guidé ma\nconduite dans cette affaire Riel, à laquelle on a donné malheureusement\nune tournure politique qu'elle n'aurait jamais dû avoir.\"\n\"Je m'empresse de vous faire parvenir cet exposé. Il sera la réponse aux appels passionnés qu'on a faits à votre sympathie, à votre générosité qu'on veut exploiter aux dépens de la confiance que vous avez jusqu'ici reposée en moi.\"\n\nCette entrée en matière est tout à fait conforme aux préceptes d'Aristote, de Quintillien et des autres rhéteurs, qui recommandent les exordes insinuants où l'on fait appel à la \"sympathie\", à la \"générosité\" de ceux à qui on s'adresse. Vos harangues populaires ne laissaient pas présumer que vous eussiez un tel souci des agréments du langage, et je constate non sans étonnement que votre manière actuelle est plus dans le goût d'Isocrate que dans celui de Bobèche. Au demeurant, vous n'abaissez pas outre mesure le-diapason de votre parole et vous faites sentir, comme il conviendrait, à vos électeurs que s'ils pensent donner à un mouvement quelconque \"une tournure politique\" qui n'ait pas votre approbation, ils sont enfouis dans la plus profonde de toutes les erreurs. Si votre empressement à exposer vos vues désintéressées à vos électeurs est suivi de leur part d'un empressement aussi vif à les adopter, vous devrez être au comble de la félicité. Quant à la franchise et à la loyauté de votre exposé, me sera-t-il permis de chercher dans la suite de votre discours la confirmation de cette rassurante affirmation ?\n\nVous dites :\n\n\"J'ai cru que ce n'était pas au milieu d'une assemblée convoquée dans un but politique, où les paroles ne seraient pas mesurées par la prudence, mais exagérées par le besoin de manière auprès de vous, que je devais vous dire ma pensée sur cette malheureuse affaire.\"\n\nIci, dans St-Hyacinthe, on a été frappé de la répugnance soudaine que vous éprouvez pour les assemblées publiques et du besoin que vous ressentez de \"mesurer vos paroles par la prudence,\" vous qui avez toujours tant aimé, même dans les circonstances les plus solennelles, même devant les assises, à vous livrer aux voluptueux hasards du verbe improvisé. Cette crainte des exagérations vous fait honneur, monsieur le ministre; mais il y a des gens qui regrettent que vous ne l'ayez pas entretenue avant l'exécution de Riel, acte qui paraît d'une exagération monstrueuse à une foule de personnes qui ne me semblent pas dépourvues de la clairvoyance ordinaire. Néanmoins, comme vous nous promettez de nous faire connaître votre \"pensée sur cette malheureuse affaire,\" je vais en profiter pour la faire connaître aussi à ceux qui n'ont\npas eu occasion d'en lire l'expression dans votre lettre du 6 juin à nos frères de Fall-River.\n\nPoursuivons donc :\n\n\"Je viens m'acquitter de ce devoir avec tout le calme que vous exigez quand on vient vous parler de choses qui intéressent votre conscience comme électeurs, vos sentiments comme citoyens d'une grande nation.\"\n\nLe calme, monsieur le ministre, voilà la qualité maîtresse, et vous ne sauriez croire comme je suis heureux de vous en voir pourvu. Seulement, il n'est pas hors de propos de vous demander si vous appelez calme la conduite de celui qui reste impassible en voyant le meurtre de son frère commis sous ses yeux. La délicieuse atmosphère des bureaux d'Ottawa est imprégnée de cette sereine tranquillité, et il n'y a pas jusqu'aux meubles capitonnés qui n'invite à ce repos dont vous paraissiez comprendre le prix mieux que tout autre. Mais pour certaines âmes, monsieur le ministre, le spectacle d'un échafaud, d'une exécution capitale—s'agirait-il du plus affreux chenapan dont les fastes des cours d'assises fassent mention—n'est pas fait pour leur inspirer cette indifférence stoïque à laquelle peuvent atteindre les caractères trempés à la façon du vôtre.\n\n\"Un vent de révolte souffle en ce moment avec violence sur la province de Québec, menaçant de renverser sur son passage, si on ne l'arrête, le parti conservateur et le ministère.\"\n\nIci, monsieur le secrétaire d'État, je me permettrai de vous demander ce que vous entendez par \"un vent de révolte,\" et d'où souffle celui dont vous parlez. Je suis citoyen dans ce pays, et à ce titre je me crois en droit de vous poser cette question : Qui êtes-vous ? êtes-vous mon maître, mon égal ou mon serviteur ? Si vous êtes mon maître, monsieur, établissez vos titres ; mais le jour où vous les aurez établis, comptez-moi immédiatement parmi les révoltés, car j'ai vécu jusqu'à présent sous l'empire d'une illusion qui m'est chère et dont je ne suis pas prêt à me séparer. Tous les jougs me pèsent, et celui qui me semble le plus lourd, bien que je ne l'aie jamais subi, c'est le joug du despote et de l'usurpateur. Nous vivons—du moins c'est en cela qu'a consisté mon illusion, si c'en est une—sous une forme de gouvernement constitutionnel, parlementaire et surtout responsable. C'est-à-dire qu'ici toute autorité procède du peuple, qui la délègue, dans ses commices, à des mandataires spéciaux appelés ministres, lesquels se trouvent nantis, non pas d'un pouvoir de maîtrise et de domination, mais chargés d'un\ndevoir, d’un service à faire. En sorte que, monsieur le ministre, non seulement vous n’êtes pas mon maître ; mais, en votre qualité de citoyen, vous êtes mon égal et, en votre qualité de ministre, vous êtes mon subordonné, puisque vous êtes mon serviteur. Indiquez-moi donc de quelle façon je pourrais me révolter contre mon domestique—serait-ce le modèle des valets—si je le chasse de ma maison, même par caprice.\n\nJe vous entends : le ministère est en péril et le parti conservateur est en danger. Mais quelle est cette doctrine qui fait du ministère une puissance perpétuelle et du parti conservateur une caste, la seule caste où se recrutent les soi-disants gouvernants ? Je vais vous recommander le calme à mon tour. N’ayez crainte : quand votre gouvernement sera détruit, nous en trouverons un autre. Et si, pour le composer, parlant à peu près comme Lamartine,\n\nIl faut des médecins, il faut des avocats,\nCes secours, grâce à Dieu, ne nous manqueront pas.\n\nLes libéraux ne sont pas des ilotes, monsieur le ministre. Ils forment dans l’Ontario un gouvernement qui ne fonctionne pas mal ; ils gèrent la chose publique sans accumuler de dette et sans créer de déficits. Il se peut que de pareils résultats administratifs, tout à fait en dehors de vos traditions, soient pour vous une preuve d’infériorité ; mais il faudra que l’esprit de parti, auquel vous faites un appel si déchirant, soit bien fort, pour que ceux qui viennent de vous abandonner d’une façon si éclatante préfèrent aux libéraux les assassins ; car—je me félicite maintenant de vous l’avoir rappelé—l’exécution de Riel a été proclamée un crime, un meurtre, un assassinat par les conservateurs mêmes à qui vous vous adressez ; et c’est vous qui avez ordonné cette pendaison.\n\nCe mot de révolte me revient sur le cœur. Permettez-moi d’ouvrir une parenthèse pour vous exposer ce qu’il m’inspire.\n\nDe 1873 à 1878, nous avons eu un gouvernement libéral. C’est mon opinion que ce gouvernement a été irréprochable et qu’il a fait tout ce qu’il était humainement possible de faire, pour administrer convenablement nos affaires passablement embrouillées, et surtout pour payer les dettes cassées par le ministère précédent—lequel ressemblait à s’y tromper au gouvernement actuel. Cependant, monsieur le ministre,—laissez-moi vous voler vos expressions—vous n’avez aucunement hésité à “souffler un vent de révolte” contre le cabinet, et à le renverser, ainsi que le parti libéral d’où il\némanait. C'est avec le cri protectionniste que vous avez opéré ce renversement. M. Mackenzie, alors premier ministre, était libre-échangiste. Comme moi, il était convaincu que le libre-échange est le principe primordial de l'existence naturelle des sociétés humaines. Se croyant sous le rapport économique, en pleine possession de la vérité absolue, il aurait pu—raisonnant comme vous—essayer de passer outre à la volonté du peuple, qui adhérait au protectionnisme. Mais pour nous libéraux, monsieur le ministre, le principe fondamental de la constitution, qui est la souveraineté du peuple, passe avant nos convictions les plus fortes, ou plutôt c'est la plus forte de nos convictions.\n\nM. Mackenzie s'est retiré devant la condamnation, injuste à son sens, que lui infligeait le peuple, et il ne lui est jamais venu à l'idée de dire que celui-ci s'était révolté contre ses serviteurs. Si ce n'est pas se révolter que de renverser un gouvernement équitable, qu'est-ce donc lorsqu'il s'agit d'un gouvernement prévaricateur comme le vôtre ? Travailler à renverser un tel ministère, non seulement ce n'est pas vouloir détruire la forme même de notre gouvernement ; c'est vouloir appliquer le principe sur lequel elle repose ; et, en prêchant la doctrine que je vous reproche ici, c'est vous, monsieur le ministre, qui vous mettez en état de révolte contre la constitution. N'avais-je pas raison de vous demander d'où soufflait la tempête que vous signaliez ?\n\nVous continuez :\n\n\"Plaise à Dieu que là seulement se borne le désastre, et que la nationalité à laquelle nous appartenons n'en soit pas la ruine la plus sérieuse. Un parti politique peut vite se réorganiser, un ministère est bientôt oublié et se remplace encore plus facilement qu'il ne s'oublie ; mais les blessures que la nationalité reçoit saignent longtemps et ne se guérissent jamais complètement.\"\n\nOh ! oh ! je vous comprends de mieux en mieux : à la politique de la strangulation devait nécessairement succéder la politique de l'épouvantement. Le ministère vient de commettre un meurtre : \"applaudissez, nous crient les ministres, sinon toute la nationalité pourrait bien y passer.\" La terreur est à l'ordre du jour. Où sont Robespierre et Fouquier-Tinville ? Robespierre est dans le cabinet et Fouquier-Tinville à Régina où fonctionne le tribunal révolutionnaire. Quant aux aimables chenapans qui composent notre Comité de salut public, tout le monde les indique du doigt ; mais on répugne à les nommer. J'aurais regret, monsieur le ministre, de me voir forcé de raviver vos souvenirs historiques ; mais je\nvous prie de songer que le règne de la Terreur n’a pas été éternel et que le 9 Thermidor est une date dans l’histoire de la Révolution. Je veux pousser l’audace jusqu’à essayer de raisonner contre la terrorisation. Les “blessures faites à notre nationalité”; mais ce n’est pas une blessure ordinaire, c’est un coup mortel qu’elle a reçu à Régina; et c’est vous qui le lui avez porté. Son salut viendra de son énergie à vous repousser. S’il lui en reste assez, elle est sauvée. Et non seulement elle, mais tout le pays. Car c’est en vain que vous cherchez à faire croire qu’un gouvernement peut se maintenir sans notre appui. C’est en vain aussi, monsieur le ministre, que vous voulez insinuer que les libéraux anglais vont prêter au ministère l’appui que les conservateurs français menacent de lui retirer. Je me flatte de connaître les libéraux mieux que vous; et si je n’avais pas leurs propres déclarations, je vous dirais encore que les libéraux seront toujours hostiles à votre gouvernement, non parce qu’ils sont anglais ou parce qu’ils sont français, mais parce qu’ils abhorrent l’iniquité et que, du commencement jusqu’à la fin, votre administration des affaires du Nord-ouest—sans compter vos actes de législation criminels portant sur d’autres matières—a été une iniquité sans nom qui s’est terminée par un meurtre épouvantable. De telles gens ne vous soutiendront jamais, j’en atteste leurs croyances les plus sincères; j’en atteste tout ce qu’ils ont d’intelligence, d’honneur, d’intégrité et de respect humain. Mais j’ai leurs déclarations. J’ai leurs écrits où ils disent que le mouvement dit national auquel vous et vos rares amis—de connivence avec les conspirateurs ministériels ontariens—attribuez gratuitement une portée qu’il n’a point, est un mouvement tout à fait constitutionnel, et qu’il a été provoqué par les abominations du ministère. J’ouvre les journaux et je vois qu’à l’inauguration de ce mouvement, à l’assemblée tenue le 19 novembre, dans la salle du Cabinet de lecture paroissial, à Montréal, l’honorable monsieur Beaubien, une des fortes têtes de votre parti, a déclaré: Il a été dur pour les conservateurs de briser les liens d’association qui duraient depuis si longtemps, mais ils ont eu assez de patriotisme pour rompre courageusement tous liens avec leurs anciens amis. Et monsieur Beaubien, voulant établir que c’est une légitime lutte constitutionnelle et non une guerre de race que l’on entreprend par ce mouvement, a dit expressément: Ce mouvement est unanime; nous voulons la justice et la liberté pour tous, même pour les Orangistes qui veulent nous en priver.\nVoilà le premier énoncé officiel qui a été fait au sujet de ce mouvement, par un homme autorisé.\n\nL'honorable monsieur Mercier déclare immédiatement après :\n\nIl ne s'agit pas d'une guerre de nationalité; il s'agit d'une revendication de nos droits...... Il faut que la manifestation projetée soit une protestation solennelle ralliant toute les opinions et toutes les nationalités. Toutes les nationalités, entendez-vous, monsieur, vous qui feignez de trembler pour la nôtre? Vous voyez bien que vos interprétations terrifiantes et intéressées reposent sur le néant; qu'il s'agit d'une œuvre nationale, dans la plus large acception du mot, pour nous habitants de la confédération canadienne, et qu'il n'est nullement question d'une entreprise sectionnelle. Monsieur Girouard, député conservateur de Jacques-Cartier, a dit : Le gouvernement nous a odieusement trompés...... Je le déclare hautement, je ne veux plus soutenir le gouvernement. Ce n'est pas parce qu'il est canadien-français que monsieur Girouard retire sa confiance au ministère; c'est parce que, dans son appréciation, le ministère est un odieux trompeur. L'honorable sénateur Trudel, dont la répugnance pour toute idée de révolte est bien connue, approuve ce qui vient d'être dit. Monsieur Laflamme, ancien ministre de la justice, donne sa adhésion à ce mouvement. Monsieur Desjardins, député conservateur d'Hochelaga, dit : Les ministres nous ont tenus dans une déception continue. Ce n'est pas des ministres anglais qu'il parle; c'est de vous et de vos deux collègues français dans le cabinet. Et il a terminé en s'écriant : Que la carrière de sir John qui a commencé en 1849, au reflet de l'incendie du Parlement à Montréal, aille finir derrière le gibet de Reil! Monsieur Fabien Vanasse, député conservateur du comté d'Yamaska et rédacteur en chef du Monde, organe ministériel, abonde dans le sens des orateurs que je viens de citer, et il dit : Je ne veux plus appuyer le gouvernement qui ne mérite plus la confiance des hommes bien pensants. Sir John emportera dans la tombe le déshonneur qui s'attache à son nom. Quant à moi, je suis prêt à remettre mon mandat à mes électeurs s'ils n'approuvent pas ma conduite.\n\nMonsieur Bergeron, autre conservateur, représentant le comté de Beauharnois à la chambre des communes, fit des déclarations absolument identiques. Il manifesta son hostilité au gouvernement et se dit prêt à résigner dans le cas où ses électeurs ne partageraient pas ses sentiments. Monsieur l'échevin Préfontaine, libéral, président du Club national, professe les opinions ci-dessus énoncées.\n\nDites-moi, monsieur le ministre, dans laquelle de ces déclara-\ntions vous trouvez contre l'élément anglais une provocation qui mette en péril les intérêts de notre nationalité.\n\nÀ Bienville, localité du comté de Lévis, il y a eu, le vingt novembre, un meeting très considérable. Les hommes les plus importants de la division de Québec s'y étaient rendus. Monsieur Desjardins y renouvela les déclarations qu'il avait faites la veille à Montréal. Monsieur Guilbault, député conservateur de Joliette, monsieur le sénateur Pelletier, libéral, monsieur G. Amyot, député conservateur de Bellechasse, monsieur Tarte, rédacteur du Canadien, journal conservateur, ont parlé dans le même sens que les agitateurs de Montréal. Pas un seul mot dans leurs discours impliquant que le mouvement ait le caractère dont vous voulez le souiller. Monsieur Tarte a dit explicitement : En 1837, nous avons eu pour nous des anglais et des français de France. En restant dans la constitution nous aurons pour nous la majorité des anglais bien pensants. Nous avons déjà pour nous les irlandais qui ont aussi le cœur et le sang chauds. Mais nous ne sommes plus avec les tories. Et je vais vous citer des faits incontestables qui nous donnent mille fois raison de nous séparer d'eux. En 1869, sir John, un homme éminent certes, mais aussi fourbe qu'il est éminent (bravos) fit venir de Rome Monseigneur Taché, pourquoi ? Pour tromper les Métis, au risque de ruiner ce prélat parmi les catholiques (honte ! honte !). Un autre fait historique est que les Métis sous sir John ont été traités en parias.\n\nUn autre trait de sir John, c'est sa lettre à son fils, dans laquelle, lui, l'un des conseillers de sa Majesté la Reine d'Angleterre, il faisait appel aux volontaires de Winnipeg et d'Ontario pour écraser les Canadiens français.\n\nDans tout cela, monsieur le ministre, je vois bien que les Canadiens-français ont été provoqués comme race par le premier ministre; mais je ne vois pas qu'ils aient provoqué qui que ce soit. Monsieur Tarte a ajouté : Messieurs, je suis le premier journaliste conservateur qui ai dénoncé sir John à mon parti, et pour vous prouver que depuis assez longtemps je connaissais cet homme, je vous rappellerai la part que j'ai prise à l'élection de votre député actuel.\n\nJe vous le répète, monsieur le ministre, je vois bien là des gens lasés mais je ne vois pas que cette lassitude provienne du fait que le premier ministre est de descendance écossaise. Ils le tiennent pour fourbe parce qu'il est fourbe, et c'est cette fourberie et non sa nationalité qui lui mérite ces manifestations hostiles. Enfin, monsieur\nle ministre, après ses réunions préliminaires, c'est à la grande assemblée du Champ-de-Mars à Montréal, que s'est fait voir dans tout sa signification le mouvement qui vous terrifie, vous et vos collègues, et dont vous faites semblant d'avoir peur pour nous. Je veux être aussi respectueux qu'il convient; mais—bien que je n'aime pas cette manière de procéder—Je vous mets au défi de me citer un seul mot de toutes les harangues qui ont été prononcées en cette occasion, justifiant vos craintes chimériques. Et je vais vous citer, au contraire, des énoncés d'intentions qui vont faire voir tout le néant des absurdes appréhension que vous simulez.\n\nVoici d'abord ce qu'a dit mon ami conservateur, monsieur George Duhamel, qui, à vos côtés, a livré naguère plus d'un combat contre nous:\n\nNous cherchons aux sources les plus pures, dans ce qu'il y a de plus élevé dans l'âme humaine, la base d'une politique d'union, de fraternité, d'une politique sage, éclairée et progressive.\n\nNous venons ici oublier, sacrifier sur l'autel de la patrie, nos divisions et nos haines d'hier, afin d'assurer une union indissoluble de tous les coeurs et de toutes les volontés, et assurer ainsi la chute du gouvernement qui vient de nous déshonorer en pendant Riel après avoir surgi trois fois à son exécution.\n\nIl n'y a rien dans cet exposé de l'opinion de monsieur Duhamel, qui implique l'intention de faire une guerre de race. Loin que ce soit nous qui voulions provoquer qui que ce soit, c'est le gouvernement \"qui vient de nous déshonorer etc.\"\n\nMonsieur Coursol, le député conservateur de Montréal-Est, qui abonde dans le sens réel de ce grand mouvement et qui a retiré publiquement son approbation au ministère, a dit:\n\nNous avons pris cette résolution, messieurs, parceque l'honneur et la justice nous l'imposent. Nous n'avons pas demandé la commutation de la peine de Riel seulement parcequ'il était Français, mais parcequ'il ne méritait pas la mort, parcequ'on n'exécute plus un condamné politique dans aucun pays du monde. Voilà la faute impardonnable de sir John A. Macdonald, la raison qui nous l'a fait abandonner.\n\nNous ne cherchons pas une guerre de race; nous ne réclamons qu'une chose: respect à notre race comme elle respecte les autres races; justice égale pour tout le monde sur la terre du Canada. Ceux qui ont demandé la tête de Riel devront bientôt courber la leur devant l'attitude et la protestation indignée de tout ce qu'il y a d'honorable non-seulement chez les Canadiens-français, mais chez tous les citoyens de la confédération à quelque origine qu'ils appartiennent.\nVoilà des expressions qui ne justifient guère vos assertions, monsieur le ministre.\n\nM. Malhiot, ancien ministre conservateur, a dit :\n\nJ'ai toujours suivi le drapeau conservateur, messieurs ; mais aujourd'hui je n'hésite pas à dénoncer les hommes responsables du crime contre lequel nous protestons ; je n'hésite pas à m'unir au mouvement qui se fait pour renverser le gouvernement des bourreaux de Riel ; c'est ce que nous avons à faire en ce moment ; quand nous l'aurons exécuté ce gouvernement, il sera temps de voir quels matériaux devront entrer dans la nouvelle organisation ; nous verrons quelles alliances meilleures que celles du passé nous devrons faire avec les partis dans la province d'Ontario.\n\nTrop longtemps la province de Québec a servi de marche-pied à ceux que nous avons eus pour alliés dans les autres provinces. Il semble être temps de chercher de nouvelles alliances.\n\nL'honorable monsieur Laurier a dit à son tour :\n\nLes journaux de l'Ontario voudraient aujourd'hui nous contester le droit de nous assembler pour protester contre les injustices commises, et cependant il n'est pas un canadien de l'Ontario, à quelque nationalité qu'il appartienne, qui ne s'accorde à dire que les Métis de la Saskatchewan ont été traités avec la plus grande injustice. Riel est véritablement victime d'un meurtre judiciaire et il est du devoir des Canadiens de toute nationalité de voir à ce qu'un semblable meurtre ne soit pas répété.\n\nNotre pays est un pays libre, et son gouvernement n'a pas le droit de commettre un meurtre judiciaire.\n\nIl est important de bien comprendre que la rébellion n'était pas une guerre de race, mais bien la revendication des droits d'une race. Les Métis ne demandaient pour eux que les droits accordés à toutes les autres races. Le crime de Régina sera certainement vengé non seulement par les Français, mais aussi par toutes les autres races. Ce ne sont pas des favoris que réclamaient les Métis, ils ne réclamaient que la justice pure et simple. Ils étaient aussi jaloux des libertés des autres que des leurs propres, et ils comprenaient que si ils toléraient qu'une injustice leur fut faite, on en ferait autant aux autres.\n\nAujourd'hui non-seulement nous Canadiens-français, nous sommes unis, mais nous comptons des alliés chez les Irlandais et les Anglais. Les meilleurs amis de Papineau n'étaient-ils pas des Irlandais et des Anglais ? O'Callaghan ne fut-il pas son ami fidèle ? Wolfred Nelson, qui commandait les rebelles à St-Denis, était un anglais et T.S. Brown en était un autre. Lorsque Lafontaine fut battu à Terrebonne, il fut élu par le comté de York, représenté aujourd'hui par M. Mackenzie. Lorsque le bill d'indemnité fut présenté devant le Parlement, son plus puissant avocat fut M. Hume Blake, le père de M. Edward Blake. Et, au cours de la dernière session, M. Blake défendit les intérêts des Métis avec un talent qui nous a montré qu'il était le digne fils de ce père illustre.\n\nLes Canadiens-français, tant qu'ils resteront dans les limites de la légalité, trouveront de puissants alliés dans toutes les autres provinces.\nLaquelle de ces paroles de M. Laurier recèle le péril dont vous parlez, monsieur le ministre? J'attends votre réponse, si vous voulez bien encore faire à la vérité l'honneur de l'outrager.\n\nM. Tarte, le rédacteur conservateur d'un journal ministériel, l'adulateur actuel du talent que l'on vous attribue, a fait, dans cette circonstance, la catégorique déclaration que voici:\n\nNous sommes ici constitutionnellement assemblés; nous faisons acte de liberté parlementaire comme nous l'avons fait ailleurs, comme demain nous le ferons. Et cependant, nous entendons des voix qui nous avertissent—et parmi celles-là, la voix du Mail est la plus forte—que notre conduite est de nature à provoquer contre nous une coalition de nos concitoyens des autres provinces et d'origine différente de la nôtre.\n\nQuiconque tient ce langage n'interprète pas dans leur signification vraie les libertés constitutionnelles dont nous jouissons et qui nous sont chères, à nous qui avons été les premiers à les réclamer pour notre pays. Nous élevons la voix sur une question de droit public: la question de race, de religion est à l'arrière plan dans ce grand débat. Nous soutenons que l'exécution de Riel est un outrage au droit des gens, tel que mis en pratique chez les peuples civilisés...\n\nNon, nous ne menaçons ni la confédération, ni l'ordre, ni la constitution, ni les autres nationalités.\n\nNous menaçons l'existence du gouvernement qui a commis un acte anti-britannique, anti-civilisateur et qui persiste à n'en donner aucune explication. Pour obtenir ces explications, pour arriver au châtiment des vrais coupables, comptez, messieurs, sur le concours du Canadien, à la tête duquel les circonstances m'ont placé.\n\nL'honorable M. Mercier, que la foule a applaudi à outrance, a dit aussi clairement:\n\nC'est que le temps est venu de s'unir dans un grand mouvement national, non dans une union de race contre race, mais dans une union qui puisse consolider les grandes destinées de ce pays.\n\nM. Robidoux, député libéral à l'assemblée législative de Québec, a parlé dans le même sens. Voici ce que je trouve dans sa harangue:\n\nTous les Anglais, les Irlandais et les Écossais qui ont à cœur la cause de la justice et de la liberté se joignent aux Canadiens-français dans le mouvement qui a lieu.\n\nMonsieur F.A. Quin, irlandais conservateur et catholique, repousse comme tout le monde l'idée que vous énoncez. Il dit:\n\nLa question qui nous occupe n'intéresse pas seulement la race canadienne-française, c'est une question nationale dans laquelle tout Canadien est intéressé, quelles que soient sa foi religieuse et son origine.\n\nDu discours de M. Edmond Lareau, libéral, je tire ceci:\nNous ne voulons pas mettre en antagonisme les divers éléments nationaux du Canada; mais nous voulons l'application de cette sage et démocratique maxime: droits égaux, justice égale pour tous. Ce que nous demandons au sujet de Riel nous le ferions pour tout homme placé dans les mêmes circonstances. Au fond il y a une question d'humanité et de justice qui intéressent tous les hommes de cœur; sans distinction de race ou de croyance.\n\nVoilà avec quelle précision absolue les organisateurs les plus autorisés du mouvement dont vous affectez de vous alarmer pour notre nationalité, en prétendant qu'il comporte un esprit d'antagonisme contre les autres races, en ont déterminé le sens. Voyons maintenant les résolutions mêmes qui ont alors été adoptées et qui reçoivent en ce moment l'adhésion de toute la population. Voici:\n\nAttendu que les Métis français et anglais avaient depuis longtemps des griefs qui ont été l'occasion de l'offense publique pour laquelle Louis Riel a été exécuté;\n\nAttendu que les peuples civilisés repoussent les exécutions capitales pour offenses politiques.\n\nConsidérant spécialement que le fait que Riel avait été recommandé à la clémence de la cour, par les six jurés de race et de croyances différentes à la sienne, auxquels l'Etat avait donné mission de le juger, imposait à ce dernier le devoir d'user de clémence à son égard.\n\nConsidérant qu'après avoir surgi trois fois à l'exécution, ce devoir était devenu encore bien plus impérieux.\n\nTenant en outre compte du fait que Riel s'était livré lui-même à la demande du général Middleton;\n\nConsidérant qu'il est évident que le gouvernement a fait de cette exécution un pur sujet de calculs électoraux; qu'il a supposé froidement combien de comtés lui rapporterait la tête de Riel, et combien de comtés une politique de clémence et de justice lui ferait perdre; qu'enfin voulant donner suite à ces calculs, il l'a sacrifié à la haine de fanatiques, leur permettant ainsi de soulever les unes contre les autres les diverses races qui, dans ce pays, vivent à l'ombre protectrice du drapeau anglais.\n\nRésolu:\n\n1o Qu'en faisant ainsi exécuter Louis Riel, le 16 novembre courant, le gouvernement de sir John A. Macdonald a commis un acte d'inhumanité et de cruauté indigné d'une nation civilisée, et a mérité la condamnation de tous les amis du droit et de la justice, sans distinction de race ou de religion;\n\n2o Que le consentement donné par sir Hector Langevin, sir Adolphe P. Caron et l'honorable Joseph A. Chapleau, à cette odieuse exécution, constitue une trahison nationale et mérite spécialement la réprobation de tous les citoyens de cette province;\n\n3o Que dans les circonstances il incombe aux électeurs de chaque comté d'exiger de leur représentant à la chambre des communes un engagement\nformel de combattre le gouvernement de sir John A. Macdonald, par tous les moyens constitutionnels à leur disposition ;\n\n4o Que, dans l'opinion de cette assemblée, les circonstances exigent que toutes les divisions de partis politiques, de races et de religions s'effacent, et que tous les hommes de bonne volonté, quelles qu'aient été leurs divergences d'opinions antérieures, se réunissent pour arriver au but indiqué dans les résolutions précédentes.\n\nRésolu :\n\nQue tous les conseils municipaux de la province, locaux et de comté, soient invités par la voie des journaux à saisir une occasion prochaine de qualifier l'exécution de Louis Riel, comme ayant été de la part du gouvernement de sir John A. Macdonald un acte de cruauté odieuse, et, en outre, de la part de sir Hector Langevin, sir Adolphe P. Caron et l'honorable J. A. Chapleau, une trahison nationale, et à transmettre les résolutions qu'ils adopteront à cet effet, à leurs sénateurs et députés.\n\nRésolu :\n\nQue les résolutions adoptées par cette assemblée soient communiquées à chacun des sénateurs et députés de la province de Québec avec prière d'y donner leur adhésion.\n\nMonsieur le ministre, c'est mon ferme sentiment que vous ne sortirez jamais du cercle où je viens de vous enclore par ces citations. Je vais maintenant m'efforcer de vous y murer par les déclarations écrites de ceux que vous prétendez être froissés et alarmés de ce mouvement, au point de se trouver disposés à prendre une attitude menaçante à l'égard de notre nationalité. Ceux-là, ce sont les libéraux anglais, car les tories, nous n'avons pas à les perdre : ils sont déjà contre nous, puisqu'ils sont pour vous. Or voyons si les organes autorisés de l'opinion libérale anglaise donnent à cette grande manifestation du sentiment public, l'interprétation que vous avez inventée de cœur joie pour nous épeurer, comme si nous étions des enfants qu'on effraie avec des chuchotements.\n\nLe principal organe des libéraux anglais, le Globe de Toronto, a mieux compris que vous la situation de Riel et la portée du mouvement qui vous atterre. Il disait, le 21 novembre, la veille de la grande assemblée du Champ-de-Mars :\n\nDe temps immémorial les gens de race anglaise ont été prêts à se révolter contre toute autorité qui n'acquiesçait pas promptement à leurs justes demandes ; il ont été les hommes les plus libres parce qu'ils étaient les hommes les plus portés à la révolte.\n\nS'il eut refusé d'aller au secours des siens, s'ils leur avait dit de s'en retourner et de souffrir l'injustice sans murmurer, jusqu'à ce qu'il eut plu à Dieu d'attendrir les coeurs de leurs gouvernants, Riel aurait été un être plus lâche et plus méprisable que ce qu'il a prouvé qu'il était sur l'échafaud de Régina.\nEt vous voudriez nous faire croire que des gens qui parlent de la sorte, approuvent l'exécution d'un homme qui a fait ce qu'il ne pouvait refuser de faire sans se montrer lâche et méprisable ! Mais poursuivons la citation de ce que dit le *Globe* :\n\nIl a été prouvé au delà de tout doute qu'il est retourné avec eux, non dans le dessein de devenir un brandon de discorde, mais pour organiser une agitation constitutionnelle........... la population de l'Ontario devrait reconnaître ceci comme vrai : les Canadiens-français ne demandent que la simple justice.\n\nPour emprunter les paroles de Grattan : \"la trahison des ministres contre les libertés du peuple était infiniment pire que la révolte du peuple contre les ministres.\"\n\nSi les habitants de l'Ontario ne font pas encore l'alliance des races en se joignant aux Français pour abattre les criminels d'État, tout comme les Français se sont joints aux Anglais pour abattre la rébellion, on aura établi un antagonisme de races permanent.\n\nAinsi, d'après le *Globe*, ce n'est pas en prétant main forte au mouvement qu'on s'expose à un conflit de race, c'est en refusant d'y prendre part. Vous avouerez, monsieur le ministre, que cela ne contenance pas du tout vos affirmations. Le 3 décembre, le *Globe* disait encore :\n\nRefuser de sympathiser avec nos concitoyens de la province de Québec ; prétendre que, parcequ'ils désirent punir le gouvernement, nous devrons le maintenir, serait la preuve quasi incroyable d'une étroitesse de sentiment de race, de préjugé et de bigoterie. S'il est essentiellement juste de condamner les ministres, il ne saurait être autrement que mal de les laisser aller en liberté sous prétexte que les Canadiens sont du côté du droit strict.\n\nDans le même numéro du *Globe* je trouve une lettre signée *Ontario*, écrite par un libéral anglais et contenant ce qui suit :\n\nMais les conservateurs les plus outrés devront admettre que comme hommes libres, les Canadiens-français ont parfaitement le droit d'avoir une opinion indépendante sur le compte de l'affaire Riel. Ils avaient droit de pétitionner comme d'autres l'ont fait, pour obtenir commutation de la sentence portée contre Riel. Ils ont parfaitement droit d'entretenir l'opinion qu'on aurait du faire droit à cette supplique. Ils ont droit de penser, comme la plupart des gens pensent, que ce n'est pas le suprême amour de la justice qui a porté sir John Macdonald à adopter le mode d'action qu'il a choisi au sujet de Riel, mais que ce sont des considérations politiques. Il lui fallait choisir entre la perte des faveurs des conservateurs orangistes d'Ontario, ou la perte des voix des Canadiens-français de Québec.\n\nC'est cette croyance que ce n'est pas l'amour de la justice, mais des intérêts de parti politique qui ont fait décider du sort de Riel, qui donne ce caractère à la manière d'agir du chef actuel qui a toujours eu pour loi suprême...\nme les expédients du partisan. Dans ces circonstances, est-ce que ceux qui croient que sir John a sacrifié Riel sur l’autel des expédients politiques, n’ont pas le droit de lui retirer leur confiance et leur appui sans se voir vilipendés et menacés de la guerre civile et de la dévastation par la presse conservatrice ultra loyale ?\n\nLes Canadiens-français du Bas-Canada sont nos concitoyens, unis à nous par un destin inexorable pour travailler à l’avenir de notre patrie commune. Tout ce qui met obstacle à la loyale et amicale coopération qu’il faut à cette œuvre va être dommageable à l’Ontario comme à Québec.\n\nLe Globe du 5 décembre disait encore :\n\nIl nous est facile de comprendre pourquoi l’indignation de nos concitoyens canadiens-français se manifeste sous la forme d’une protestation contre la mort de Riel. Il leur paraît personnifier les torts et les aspirations de leurs frères Métis. La longue carrière d’oppression et d’insultes de sir John envers les Métis, et de déception envers la race française et ses dignitaires ecclésiastiques les plus vénérés, a fait des héros des insurgés et de leur chef. On leur a laissé croire jusqu’au dernier moment que cet agitateur agraire serait traité comme un inculpé politique. Son exécution est tombée du ciel bleu comme un coup de foudre sur la soute à poudre des sympathies inflammables et des ressentiments ardents et secrets.\n\nCependant la cause de l’excitation qui règne dans la province de Québec ne provient pas seulement de l’exécution du chef rebelle, mais de l’oppression et des déceptions qui ont porté les métis au cœur simple à l’envoyer querir et à suivre ses témoignes avis.\n\nNous ne nous étonnons pas que les divisions de parti aient disparu dans la province de Québec, ce qui nous étonne, c’est qu’elles subsistent dans d’autres parties du Canada.\n\nIl n’y a pas que les Canadiens-français qui accusent le gouvernement d’avoir versé le sang.\n\nLe sang des volontaires qui sont tombés dans cette guerre fratricide demande autant l’expiation que celui de Riel.\n\nIl y a dans Ontario des veuves et des orphelins aussi malheureux que ceux de Riel.\n\nTous les Canadiens auront à payer leur compte des frais de la campagne.\n\nTous ces morts, toutes ces pertes crirent également vengeance.\n\nDe quoi ?\n\nDe ceux dont la négligence criminelle a rendu ces morts ou ces pertes inévitables.\n\nCe n’est pas une affaire d’orangistes contre bleus, ni de gits contre torries. C’est toute la population du Canada contre ses serviteurs infidèles.\n\nVoilà le mot de la situation. Le Globe a aussi commenté une lettre de M. Tarte au Mail, principal organe du parti conservateur anglais, qui nous a menacés de pulvériser toute la confédération si\nles conservateurs de la province de Québec votent contre le gouvernement de sir John A. Macdonald. M. Tarte développe dans cette lettre les sentiments qu'il a exprimés à l'assemblée du Champ-de-Mars, et le Globe dit :\n\nToutes les accusations portées par le Mail contre la population française, toutes les craintes de domination française qu'il prétend entretenir n'ont pas le moindre fondement dans tout ce qu'on dit les principaux hommes ayant pris part aux assemblées publiques qui ont eu lieu par toute la province ; il n'y a pas eu, croyons-nous, une seule phrase tendant à prouver qu'aucune partie de la population crût que, parce que Riel était français, il n'aurait pas dû être pendu, ou à prouver qu'ils veulent ou désirent qu'il y ait une loi pour les Français et une autre pour les Anglais.\n\nLe 10 décembre le Globe disait :\n\nUne fausse représentation en faveur auprès de la presse conservatrice est celle qui consiste à dire que les libéraux de la province de Québec ont l'intention de former un parti français ayant des fins et un but distincts... ni M. Laurier ni M. Mercier ne peuvent être cités comme ayant encouragé tel programme. Au contraire, ces deux messieurs ont formellement déclaré qu'ils refuseraient de prendre part au mouvement s'ils croyaient qu'il tend à semer des différends de race. Le seul danger d'une telle calamité vient de la tentative bigote et dépourvue de patriotisme de soulever un sentiment anti-français dans l'Ontario.\n\nLe Hamilton Palladium of Labour, organe des Chevaliers du travail, ordre, dit le Globe du 12 décembre, qui comprend des milliers d'ouvriers et de travailleurs d'Ontario, a dit, le 28 novembre, que \"le sens commun et l'intérêt personnel bien entendu devraient unir tous les ouvriers contre la tentative de soulever une guerre de race entre les Canadiens d'origine anglaise et française.\"\n\nCe journal dit :\n\nEst-ce que, sur les injonctions des politiciens sans vergogne et des écrivains stipendiés, qui n'ont jamais pu dissimuler leur hostilité au travail organisé, nous allons prendre part à un mouvement physique ou politique contre des gens qui ne nous ont jamais fait de mal, parce qu'ils parlent une autre langue que la nôtre et qu'ils font les cérémonies du culte à d'autres autels que les nôtres ?\n\nLe Huron Expositor, autre journal libéral anglais du Haut-Canada, dit :\n\nAucun réformiste ne peut honnêtement, en conscience, accorder par un vote sa confiance au gouvernement actuel, et chaque réformiste est tenu en honneur et en principe à voter non-confiance en ce gouvernement, quelque soit celui qui pose la proposition, et tous les députés réformistes qui refuseraient de le faire contrediraient directement leurs professions et leurs votes antérieurs.\nJe pourrais couvrir de nombreuses pages de citations du Times de Hamilton, du Free-Press d'Ottawa, de l'Advertiser de London, du Chronicle de Halifax et d'une foule d'autres journaux anglais libéraux, qui parlent absolument dans le même sens et qui mettent à complet néant vos terreurs feintes.\n\nDepuis que le mouvement national a été inauguré, les libéraux anglais de Middlesex-ouest se sont réunis, et ce n'est pas dans la résolution suivante adoptée par eux à l'unanimité, que l'on voit qu'il ont pris ombrage de ce mouvement :\n\nQue cette association se rappelle avec une patriotique fierté, la vivacité avec laquelle les volontaires du Canada ont pris les armes à l'appel des autorités, pour servir au Nord-Ouest; que la présence côte à côte des volontaires de Québec et Halifax, et de ceux de l'Ontario et du Manitoba était un acte de sacrifice personnel qui a été accueilli avec enthousiasme, surtout comme une preuve de la force d'esprit d'unité du pays; que malgré cela, cette association ne peut oublier le fait que la rébellion n'aurait pas eu lieu sans l'incurie du gouvernement dans ses négociations avec les occupants du sol, incurie d'autant plus criminelle que l'on sait que les terres de ceux qui se sont révoltés contre l'autorité, ont été gaspillées et distribuées à tort et à travers, entre les mains de compagnies de colonisation dont l'une avait comme officier et actionnaire M. Jamieson, gendre d'un ministre de la couronne.\n\nLes libéraux anglais de Montréal, qui sont plus que n'importe qui à même de juger de la portée du mouvement, n'ont manifesté aucune angoisse. Le Young men's liberal Club s'est réuni au Windsor le 10 décembre. Étaient présents : M. Edgar Judge, président ; MM. G. W. Stephens, M. P. P., W. A. Weir, S. Cross, D. Barry, J. Mitchell, Jonathan Hodgson, M. McKay, A. Perry, J. X. Perreault, R. Préfontaine, J. K. Ward, P. White, Ch. Drummond, H. Joseph, J. N. Hutchinson, S. J. Andress, T. H. Turton, Arch. McGoun, W. F. Ritchie, W. S. Walker, W. G. McBean, S. Boas, John Ralston, W. Lamson, N. E. Hamilton, D. Downie, J. Goldthorpe, A. Boyer, M. P. P., James Morgan, A. Cheeseman et nombre d'autres.\n\nAprès les affaires de routine, comme dit l'argot parlementaire, M. Selkirk Cross a proposé, avec l'appui de M. D. Barry, et il a été unanimement résolu :\n\nQue, vu sa mauvaise administration des affaires du pays, vu sa criminelle négligence après les nombreux appels de justice faits par les habitants du Nord-ouest, appels qui sont aujourd'hui reconnus bien fondés, le gouvernement actuel du Canada est directement responsable de la rébellion et de ses terribles conséquences, qui ont causé un si grand mécontentement chez la plus grande partie de nos compatriotes et qu'il est du devoir de chacun de ceux qui désirent avoir un bon gouvernement et une juste et impartiale\nadministration des affaires publiques de s'unir dans le but de chasser du pouvoir un gouvernement aussi corrompu qu'incompétent.\n\nIl est donc résolu que l'agitation constitutionnelle qui a pour objet de renverser l'administration actuelle pour sa criminelle négligence et son incapacité, est parfaitement justifiable, et que ce club accueillera dans les rangs du parti libéral tous ceux qui désirent s'unir à lui pour mettre à sa place une administration honnête et capable, s'engageant à diriger les affaires de notre patrie commune dans la voix d'une égale justice pour tous et d'une administration économique des affaires publiques.\n\nVoilà qui ne comporte pas d'ambiguïté. M. Ward a ensuite proposé, appuyé par M. McGoun, et il a été unanimement résolu :\n\nQue ce club déclare aussi qu'il condamne toute tentative, quelles qu'en soient les auteurs, faite pour soulever des préjugés de caste ou de race au Canada et pour troubler la bonne harmonie qui a toujours existé et qui existe encore parmi les diverses races de cette province.\n\nOr, c'est vous, monsieur ; c'est votre chef sir John A. Macdonald, dans sa fameuse lettre au Winnipeg Sifting ; c'est votre principal organe dans le Haut-Canada, le Mail, dans un article incendiaire où il a menacé de briser la confédération, de recommencer la conquête des Canadiens-français et, cette fois, de les priver à tout jamais de leurs institutions, de leur langue et de leurs lois dont la jouissance nous est garantie par le traité de 1763 ; c'est vous qui essayez de \" soulever des préjugés de caste et de race parmi nous \" plutôt que de vous laisser faire une opposition tout à fait loyale, tout à fait constitutionnelle, qui aura pour résultat manifeste le renversement de votre odieux pouvoir. C'est vous qui vous révoltez contre l'autorité populaire. Aux mille raisons que, dans leur opposition constitutionnelle, tous les libéraux invoquent pour obtenir la destruction du ministère dont vous êtes l'ornement, les libéraux anglais ajoutent \" la criminelle négligence et l'incapacité déployées par l'administration actuelle dans son opiniâtre refus de rendre justice aux habitants du Nord-ouest, qui s'est ainsi rendue responsable de la rébellion et de toutes ses terribles conséquences. \"\n\nParmi ces terribles conséquences de la rébellion provoquée par vous-même et par vos collègues, se trouve ce que vos amis appellent le meurtre d'un fou, la pendaison abominable d'un martyr, et c'est par respect pour la constitution, c'est par vénération même pour l'autorité légitime et immuable, celle de la nation, que, de concert avec les libéraux, ils conspirent énergiquement, mais loyalement votre perte. Ils peuvent s'appuyer pour justifier leur atti\ntude actuelle sur cet article de la *Minerve* publié le lendemain du suplice de votre victime :\n\nSi profonde est la répulsion qu'inspire l'idée seule de l'exécution de Riel, que jusqu'au dernier moment, hier, on espérait encore une commutation de la terrible sentence. C'en est fait des espérances de toute une race et de la pureté immaculée de notre blason national.\n\nIl n'a pu s'écouler 20 ans sans que le grand livre de la confédération canadienne fût maculé d'une tache de sang. C'est avoir perdu bien jeune sa beauté virginal! Aussi rien d'étonnant que la population soit émue jusqu'à se porter à des manifestations bruyantes même de sa colère.\n\nL'ère des supplications est passée. L'ère des récriminations ne saurait nous convenir; celle des déterminations inflexibles suivies de résultats pratiques peut seule nous satisfaire. La journée d'hier va fournir les éléments d'une page nouvelle de notre histoire.\n\nSur cet autre article du même journal publié le jour même de l'exécution :\n\n........Nous n'apprenons rien en disant qu'il se rendra des comptes à la prochaine session. Et nous le jugerons lui (sir John) comme les autres.\n\nSi c'est, comme nous le croyons, le parti orangiste qui a présidé à l'acte impolitique de ce jour, il y aura un règlement définitif entre ce parti et le nôtre, hormis que l'arrêté de compte date d'aujourd'hui même, ce que nous serions loin de regretter. Si le gouvernement a eu la main forcée par cette coterie maussade qui vit exclusivement de haine, il en subira les conséquences.\n\nSur ces paroles de M. Fabien Vanasse, député conservateur du comté d'Yamaska et rédacteur en chef du journal ministériel le *Monde*, paroles prononcées en ma présence, le 19 novembre dernier, dans la salle du Cabinet de lecture paroissial à Montréal :\n\nJe proteste contre l'exécution de Louis Riel. Je ne veux plus supporter le gouvernement qui ne mérite plus la confiance des hommes bien pensants. Sir John emportera dans la tombe le désbonneur qui s'attache à son nom. Quant à moi, je suis prêt à remettre mon mandat si mes électeurs n'approuvent pas ma conduite.\n\nIls peuvent encore s'appuyer pour vous combattre sur ces paroles du *Quotidien de Lévis*, journal ultra ministériel (16 nov.) :\n\nLa voix de l'humanité n'a pas été entendue. Le droit et la force triomphent, c'est vrai; mais la justice a les mains couvertes de sang.\n\nLe 20 novembre le même journal disait :\n\nEt si aujourd'hui nous n'avons plus le motif de sauver la vie de l'infortuné Riel, nous avons celui de venger sa mémoire et de sauver l'intégrité de l'honneur national.\n\nJ'emprunte aussi à l'*Évenement*, organe ministériel, qui disait le jour de l'exécution :\nNous sommes pour toutes les protestations légales, pour tous les moyens capables de prouver que nous réprouvons l'acte odieux perpétré ce matin.\n\nLe Courrier du Canada, organe de sir Hector Langevin, disait le 17 novembre :\n\nNous écrivions hier :\nC'est pour la Puissance du Canada un jour de deuil que celui où elle voit se dresser un échafaud politique.\nNous aurions pu ajouter que, pour la province de Québec surtout, cette date du 16 novembre était une date funèbre.\nEn effet, à Montréal, à Québec, dans tous les centres populaires, la nouvelle de l'exécution a été accueillie par une explosion de pitié et de colère.\nIl est clair que la province de Québec attendait une mesure de clémence. Son attente a été trompée, et voilà pourquoi elle s'agit.\n\nLe Nord de St-Jérôme, votre organe à vous, disait, le 26 novembre, au sujet de l'exécution de Riel :\n\nNous dénonçons le gouvernement Macdonald et n'exigeons sa déchéance.\nNous ne demandons pas autre chose, et, pour cela, nous croyons de bonne guerre de nous autoriser des déclarations du Nouvelliste, feuille conservatrice, représentant les idées de sir A. P. Caron, et qui disait le 17 novembre :\n\nMais la rage du tigre orangiste restait inassouvie !\nMaintenant elle est satisfaite.\nL'élément français et catholique a payé son tribut à la haine des sectaires.\n\"Ajoutons que le parti conservateur de la province de Québec a reçu la récompense de l'alliance politique qui a permis à cette minorité, méprise dans sa propre province, de partager avec lui l'honneur du pouvoir.\"\n\nNotre députation a le sentiment du patriotisme et de l'honneur national. Elle a la confiance du peuple. Qu'elle se concerte avec sagesse et agisse avec prudence, et elle peut compter sur l'appui de la Province dans tout ce qu'elle fera pour maintenir son prestige et lui assurer des alliances profitables.\n\n\"Car il est inutile de se le cacher, l'orangisme qui a toujours été un élément désorganisateur dans le parti conservateur, a creusé un abîme entre nous.\"\n\nLe Journal de Québec feuille actuellement conservatrice, prévoyant la portée que les intéressés au maintien du statu quo attribuerait perfidement au mouvement de réveil général qui menace l'existence de votre gouvernement, disait le 20 novembre :\n\nLe drame de Régina a posé un problème difficile à résoudre ; mais qu'il est pas au-dessus de la sagesse humaine.\nQuel est la nature de la difficulté et comment la solution peut-elle se trouver ?\n\nLa difficulté se trouve dans le fait que le mal commis est irrémédiable puisqu'il ne peut plus s'agir de commutation de peine pour Riel, puisque nous nous trouvons en face d'une potence, qui a fait une pendaison politique, malgré les protestations de la province de Québec.\n\nOn nous demande quelle attitude nous entendons prendre en présence de cette difficulté ?\n\nNotre réponse est facile à donner.\n\nDans le cas de Riel, il s'agissait d'une faute politique et le jury avait recommandé le prisonnier à la clémence.\n\nLe jury est le représentant du pays et sa voix n'a pas été écoutée, bien qu'elle méritât de l'être.\n\nC'est ici où est le mal qui a provoqué une agitation si générale dans la province de Québec.\n\nIl n'est pas étonnant que cette province soit si prompte à prendre feu en présence d'une telle procédure judiciaire.\n\nLa province de Québec a déjà eu ses exécutions politiques qui furent les atroces pendaisons de 1839, et la répétition aujourd'hui de semblables tueries a blessé d'autant plus que l'exécution de Régina est l'œuvre du fanatisme orangiste, le même qui dressa les gibets de 1839.\n\nOù est maintenant la solution ? Comment atteindre le but ?\n\nC'est une lutte contre l'orangisme qu'il faut entreprendre, et il s'agit de trouver les moyens de vaincre cette infime coterie qui exerce, aujourd'hui, une prépondérance relative, grâce à son esprit de corps et à l'union de ses membres.\n\nLes moyens, d'après nous, ne sont pas nombreux, et nous n'en voyons même qu'un seul : c'est de suivre l'exemple que nous donnent les orangistes eux-mêmes.\n\nSoyons unis comme eux. Adoptons un drapeau commun, celui qu'avaient nos ancêtres lors des grandes luttes constitutionnelles.\n\nLes Canadiens-français n'ont rien à redouter de cette union, et ils ne doivent pas écouter ceux qui leur disent que les autres nationalités pourraient en faire autant et se liguer contre eux.\n\nIl n'y a aucun péril dans cette éventualité.\n\nLes Canadiens-français unis n'auront jamais un programme injuste envers les autres nationalités.\n\nLes Canadiens unis ont obtenu, dans le passé, le gouvernement responsable au pays ; ils ont conquis toutes les libertés politiques, qui font actuellement l'orgueil et la prospérité des diverses races du Canada.\n\nLes Canadiens-français, s'insistant de nouveau, aujourd'hui, auraient encore pour objectif l'intérêt général, et à cette condition, ils ne manqueront jamais d'alliés pour triompher comme ils ont fait sous les Lafontaine, les Baldwin et autres.\nVous voyez bien, monsieur le ministre, qu'on peut combattre un gouvernement dénoncé en ces termes par vos feuilles sacro-saintes, sans soupçonner le moindrement qu'on est porté à cette importante besogne \"par un vent de révolte.\" Quoi de plus légitime que de vouloir la déchéance de ministres responsables d'un meurtre? Car vous ne pouvez vous soustraire à l'effet de ce dénominatif. Voici, pour votre édification sur ce point, l'opinion de Mgr Taché:\n\nLe gouvernement a laissé faire l'exécution, il en a donc la responsabilité et c'est une indignité de vouloir la faire peser sur d'autres, qu'on s'est donné garde de consulter à ce sujet. Pour ma part, une observation de vingt années m'a donné des convictions diamétralement opposées à celles que l'on invoque. J'avais trop de raisons d'étudier dans ses moindres détails les dispositions et les actes de mon infortuné protégé, pour pouvoir ne pas me rendre compte de ce qu'il était et de qui a pu le conduire à la voie déplorable qu'il a suivie. Il y a bien des années que je suis convaincu, au-delà de la possibilité d'un doute, qu'à côté des brillantes qualités de l'esprit et du cœur, l'infortuné chef des Métis était en proie à une mégalomanie et théomanie qui seules peuvent expliquer tout ce qu'il a fait jusqu'au dernier moment.\n\nSi je me suis appuyé si longuement sur ce petit paragraphe de votre manifeste, c'est qu'il m'a semblé y voir scintiller tout l'esprit qui vous l'a inspiré et que j'ai cru faire le plus gros de ma besogne en anéantissant jusqu'au dernier vestige de motif à l'intimidation que vous voulez créer. Permettez donc que je poursuive mon exploration à travers la luxuriante végétation de votre littérature officielle. Mais auparavant, laissez-moi vous citer encore ces mots de Mgr Taché, qui donnent au mouvement national la vraie signification que vous affectez de n'avoir pas aperçue:\n\n\"Les querelles de race et surtout de religion sont des instruments bien difficiles à manier... MAIS JE NE FAIS AUCUNE ALLUSION À UN MOUVEMENT QUI NE SERAIT QUE POLITIQUE ET ENFERMÉ DANS LES LIMITES DE LA CONSTITUTION, QU'CEUX QUI ONT DONNÉ VOTRE SOUTIEN AUX ENGAGEMENTS PARLEMENTAIRES, SOIT SUR LES HUSTINGS, PÈSENT TOUS DANS L'INTIMITÉ DE LEUR CONSCIENCE ET QU'ENSUITE ILS VOTENT SUIVANT LEURS CONVICTIONS.\"\n\nSi vous faites une nouvelle édition de votre œuvre, n'oubliez pas de l'enrichir de cette note. Vous continuez:\n\nAutant je respecte le sentiment national qui produit le mouvement actuel, autant je déplore la cause de ce soulèvement, autant je gémis sur les tristes conséquences qui peuvent-en résulter. La meilleure preuve que la cause est mauvaise, c'est qu'un esprit d'injustice semble la dominer. On soupçonne on accuse, on condamne d'anciens et fidèles serviteurs du pays sans les entendre, avant même qu'ils n'aient parlé.\nAh ! monsieur le ministre, vous ne déplorerez jamais autant que nous \"la cause de ce soulèvement\"; et c'est pour en détruire à jamais le germe que nous formons le projet d'écraser le ministère, afin de nous dérober, \"aux tristes conséquences\" qui, non-seulement peuvent en résulter, mais qui en ont résulté réellement. Vous dites : LA MEILLEURE PREUVE QUE LA CAUSE EST MAUVAISE, C'EST QU'UN ESPRIT D'INJUSTICE SEMBLE LA DOMINER! Nous ne sommes pas à faire des plaisanteries, monsieur, et je vous prie de ne pas renouveler ces calinotades. Puis, vous ne pourrez toujours pas, \"ancien et fidèle serviteur\", me reprocher de vous avoir condamné sans vous avoir entendu. À propos, comment conciliez-vous ce mot serviteurs avec votre veut de révolte? Je vous lis :\n\nDepuis dix-huit ans que je suis votre député, on n'a jamais mis en doute la sincérité de mon patriotisme et de mon dévouement au peuple. C'est une conviction qui n'a pas diminué chez moi que j'ai travaillé pour ce peuple dont je suis sorti et à qui je dois tout. J'ai été accusé souvent de prédilections exagérées pour la cause canadienne-française, parce que je faisais tous mes efforts pour donner à la province de Québec, les moyens de développer le plus rapidement possible ses immenses ressources, sous l'impulsion d'un puissant courant d'influence française. Je n'ai pas à regretter mes efforts, j'étais dans mon droit, car je n'attaquais pas les intérêts de mes concitoyens d'origine britannique. Stimulé par leur esprit d'entreprise, je voulais voir les miens marcher de pair avec eux dans le voie de la prospérité matérielle. Quand on m'accuse aujourd'hui de manquer à ce grand sentiment national, de le renier, c'est là une injure que je ressens profondément, que je ne mérite pas, et dont j'ai droit de me dire blessé.\n\nVous avez écrit cela sous l'empire de la plus profonde des illusions. Vous ne sauriez croire, monsieur, combien est considérable le nombre de gens qui, non-seulement mettent en doute la sincérité de votre patriotisme et de votre dévouement au peuple, mais encore qui vous nient obstinément ces qualités. Et je ne vous parle pas ici des libéraux, car vous devrez me conceder que ceux qui combattaient votre candidature et vos actes, entretenaient un certain doute sur la sincérité de votre patriotisme etc., mais je vous parle des conservateurs, des ultra-conservateurs, de ministériels forcenés, qui vous ont toujours pris pour un charlatan saturé de présomption et complètement dépourvu de capacité. Combien de fois, monsieur le ministre, ne vous ai-je pas défendu moi-même, contre les attaques violentes de gens qui appuyaient votre politique, mais qui vous contestaient avec aigreur ces belles qualités du désintéressement et de dévouement, dont vous croyez bien à tort avoir convaincu tout le monde. Parmi les choses que vous deviez\nau peuple d'où vous êtes sorti (vous avez fait stéréotyper cette déclaration) doit se trouver la simple justice que ce même peuple —dont je suis sorti comme vous, comme bien d'autres—vous demandait pour un pauvre condamné, sur la culpabilité duquel planait plus qu'un doute. En refusant cette justice je vois bien que vous avez cru travailler pour vous, mais je ne vois pas que vous ayez travaillé pour le peuple. De plus, il y a beaucoup de gens qui font consister vos \"prédilections exagérées pour la race canadienne-française\", dans le fait d'avoir grévé d'une dette énorme la province que vous avez administrée et d'avoir fait cette brillante opération : la vente pour sept millions à venir d'un chemin de fer qui coûtait quinze millions empruntés. Comme vous déclarez ne pas regretter les efforts que vous avez faits pour arriver à ces splendides résultats, je vais vous abandonner aux délices de la satisfaction que vous paraissiez éprouver en voyant les vôtres \"marcher de pair\"... avec les gens qu'on conduit généralement à la potence. Et vous qui prétendez ressentir si vivement les injures que l'on vous fait, comment voulez-vous que nous nous montrions insensibles à celles que vous nous infligez ?\n\nVous dites :\n\nOn me reproche d'avoir manqué à l'honneur en restant à mon poste, après que le cabinet fédéral eut refusé de commuer la sentence de la peine capitale portée contre Louis Riel par le tribunal, en un emprisonnement pour la vie ; et l'on traite mon refus de donner ma démission sollicitée par un grand nombre d'amis, comme une faute énorme dont je serais la plus grande victime. Je n'aurais pas parlé ici de cette affaire si un des chefs de l'opposition, M. Mercier, n'avait déclaré à l'assemblée du Champ-de-Mars, à Montréal, qu'il m'avait écrit qu'il serait prêt à marcher, avec ses amis, sous mes ordres, si je donnais ma démission comme membre du cabinet fédéral. Oui, j'en conviens, j'ai été pressé, sollicité par des amis dévoués et des adversaires politiques de prendre la direction de ce mouvement populaire. Ces offres étaient bien flatteuses pour moi. La perspective qu'elles m'ouvriraient était bien attrayante. Je me voyais accepté comme le défenseur reconnu de ma race, chéri, acclamé par tous mes compatriotes, interprète de leurs sentiments et de leurs aspirations. Dans ce rôle où tous me conviaient, je trouvais une éclatante réparation des opprobrés sans nom dont certains hommes m'ont abreuvi depuis trois ans. Mais entre le rôle séduisant qu'on m'offrait et moi-même, j'ai vu se dresser comme une barrière infranchissable, le serment que j'ai prêté de remplir mon devoir au risque de perdre amitiés et profits, et le sentiment intime, la conviction inébranlable, que ce que l'on me demandait était contraire à la justice et aux intérêts bien entendus de notre province. Je voyais, comme conséquence logique de ce mouvement, l'isolement, l'antagonisme d'une race, provoquant des représailles,\ndes luttes, des désastres. J'ai senti qu'il y avait plus de courage à braver le courant qu'à le suivre, et j'ai laissé passer, sans m'en émouvoir, les cris de traître et de lâche qu'on poussait contre moi. Qu'importe ma personnalité ? Dans les crises difficiles que traverse une nation, les hommes ne sont rien, le salut du peuple est tout. La responsabilité du pouvoir impose à ceux qui en sont chargés, l'obligation de voir au delà des intérêts du moment, de bien étudier si, en cédant à un entraînement populaire momentané, ils ne compromettent pas, pour bien des années, une cause sacrée.\n\nEh oui, monsieur, on vous reproche tout cela pour être resté au poste qui vous rapporte annuellement huit mille dollars, et j'ai la prétention d'avoir amplement établi par ce qui précède que ce reproche n'est pas immérité. Ils sont rares ceux qui vont croire que c'est pour remplir votre devoir et par respect pour votre serment que vous avez écrit à nos frères de Fall-River, la lettre dans laquelle vous disiez que les Métis n'avaient jamais fait de représentations constitutionnelles au gouvernement, alors que des centaines de suppliques, de requêtes, de pétitions de tous genres s'étaient accumulées depuis 1878 dans les casiers des ministères ; alors que M. Blake vous a contraint, vous, secrétaire d'État, d'en déposer 76 sur le bureau de la chambre. Non, monsieur le ministre, nous ne croyons pas à votre respect du serment ; nous ne croyons pas à votre sollicitude pour le devoir.\n\nCe qu'il y a de probable, ce qu'il y a de vrai, c'est que vous avez manqué de flair, de perspicacité, de prévoyance ; c'est que, vu vos antécédants, vu la patience du peuple qui vous a supporté, vous avez cru ce peuple bernable à merci, et qu'après l'avoir fait passer pardessus la corruption, pardessus le mensonge, pardessus la spoliation, vous le feriez encore passer pardessus l'assassinat. On dit, monsieur, que maintenant vous voulez sortir du cabinet et que vous guettez, à cette fin, l'occasion de faire une querelle d'allemand à sir John A. Macdonald. Groyez-moi, monsieur, restez où vous êtes. On ne croira pas plus à votre sincérité dans votre retraite qu'on n'a cru à votre sincérité dans votre persistance à ne pas l'effectuer en temps opportun. Ne feignez pas de vous repentir, vous souillerez la contrition. La pire des hypocrisies est l'hypocrisie du désespoir moral. Restez où vous êtes ; restez-y avec les confectionneurs de la Minerve, avec les autres grimauds de la presse ministérielle, que je me réjouis de voir hostiles au grand réveil du peuple parcequ'ils auraient déshonorer le mouvement de leur adhésion. Notre cause est celle de l'immuable vérité, de l'éternelle justice ; que les organes de l'iniquité et du mensonge\ns'en éloignent et qu'ils vous suivent! Ah! vous dites que vous voyez \"comme conséquence logique de ce mouvement, l'isolement, l'antagonisme d'une race, provoquant des représailles, des luttes, des désastres.\" Comme vous craignez les luttes! Je vous ai démontré le caractère chimérique des craintes que vous manifestez sournoisement pour les imposer au peuple. Et d'où vous vient cette prudence; cette circonspection soudaine qui vous fait commettre un meurtre politique par amour pour la tranquillité? Mais quand donc un ministre doit-il commettre l'imprudence de sortir d'un cabinet? Curtius était un imprudent, quand il se jetait dans un gouffre avec la persuasion de sauver le peuple romain; Régulus était un imprudent, quand il retournait à Carthage subir le supplice que ses ennemis lui avaient promis; Popilius était imprudent, quand il traçait autour d'Antiochus le cercle que vous auriez dû faire autour de votre maître; Napoléon était imprudent quand il franchissait le pont d'Arcole et risquait l'existence du chef de l'armée; et lorsque, plus tard, ce capitaine couronné portait ses légions jusqu'à Moscou, dont il s'emparait par un de ces brillants faits d'armes qui ont fait la gloire du grand homme en même temps que la ruine de la France, les Moscovites ont été imprudents de bruler leurs demeures pour ne pas subir l'humiliation de l'invasion et de l'oppression étrangères. Mais je m'aperçois que je vais chercher trop haut dans l'histoire les exemples que je vous cite et qu'on en peut trouver dans l'anecdote plus à la portée de votre cœur. Comme je crois que vous avez la prudence de ceux qui refusent d'éteindre les incendies de peur de mouiller leurs plastrons de chemise, laissez-moi rappeler à votre souvenir l'histoire de ce conseil municipal d'une petite commune, qui ayant fait l'acquisition d'une pompe à incendie, crût devoir en conséquence promulguer un règlement portant les quatre prudents articles que voici:\n\n1o La pompe à incendie est destinée à éteindre les incendies;\n2o Tout habitant de cette commune est pompier en naissant;\n3o En cas d'incendie, la pompe ne sera livrée aux pompiers qu'après une délibération du conseil municipal approuvée ensuite par le sous-préfet;\n4o La pompe devra toujours être essuyée la veille d'un incendie.\n\nVoilà, monsieur le ministre, l'image de votre sagesse, de votre circonspection, de votre prudence.\n\nSi, comme vous le dites et comme je le crois, \"les hommes ne sont rien, le salut du peuple est tout,\" quel mal vouliez-vous à ce\nque nous brisons les hommes qui ont compromis le salut du peuple? Vous parlez vainement des responsabilités du pouvoir; vous vantez inutilement la pénétration dont vous dites pourvu et qui vous fait préférer votre sentiment à celui de toute la nation. Il y a une chose que je redoute pour vous, monsieur le ministre, c'est votre surabondance de modestie; vous en serez un jour ou l'autre suffoqué; précautionnez-vous contre ces accès d'humilité qui pourraient vous emporter. Pour moi, qui pense que c'est précisément parce que vous avez cru l'entraînement populaire momentané que vous avez refusé de vous y confier, laissez-moi vous dire ceci: en sortant par la fenêtre du cabinet pour vous jeter sur les épaules du peuple, que vous croyez évidemment plus basses que le pallier de ce confortable réduit, ce n'est pas une chute que vous auriez faite, c'est une ascension; vous n'avez pas su le prévoir, voilà tout.\n\nJe continue à vous lire:\n\nExaminons un instant les faits qui ont motivé ma conduite et celle de mes collègues.\n\nLouis Riel a quitté, l'an dernier, les États-Unis, dont il s'était fait naturaliser citoyen, pour venir combattre les institutions, les lois, les autorités canadiennes. Il a levé l'étendard de la rébellion dans notre Canada, si tranquille et si heureux dans la paix.\n\nIci, monsieur le ministre, vous vous placez complètement en dehors de la vérité. Il n'est pas vrai que Riel soit parti des États-Unis pour venir combattre nos institutions.\n\nRiel s'est rendu dans le Nord-ouest pour aller rédiger une partie des requêtes que vous avez reçues et dont vous avez nié l'existence. Dans le mois de mai 1884, une assemblée a eu lieu à Lindsay, dans le territoire du Nord-ouest. Elle se composait de Métis français et anglais; il y avait là des colons venus de la province d'Ontario et qui prirent part à ce mouvement, lequel avait pour but d'envoyer quérir Riel dans le Montana pour lui confier la direction d'une agitation purement constitutionnelle, ainsi que le rapporte un journal de la localité. Cette délégation se composait de messieurs Isbister, Dumont, Ouellette et Dumas. Elle parcourut plus de 700 miles et parvint à la demeure de votre malheureuse victime. Riel répondit par écrit à la demande des délégués, et cet écrit établit clairement qu'il n'était pas l'instigateur du mouvement, comme vous le dites, mais qu'il en a été le simple instrument, qu'il ne voulait pas être autre chose. Riel dit dans cette réponse: j'accepte votre bonne invitation j'irai passer\nquelques mois parmi vous dans l'espérance qu'à force d'envoyer des pétitions, nous obtiendrons du gouvernement le redressement de tous nos griefs. O naïveté, o candeur d'un pauvre insensé! Il espérait obtenir justice par des moyens pacifiques du gouvernement de sir John A. Macdonald!\n\nEt c'est vous, monsieur le ministre, qui prétendez que cet homme n'était pas fou! Voici maintenant le rapport des délégués; il porte les quatre noms que j'ai mentionnés plus haut. On y lit les paroles suivantes: \"Les discours de monsieur Riel nous remplissent d'une grande confiance; mais tout en nous aidant il n'a aucun désir de susciter des difficultés au gouvernement.\" Il me semble que voilà une déclaration qui détruit la votre. Le major Crozier télégraphia au gouvernement le 8 juillet 1884. Son télégramme était ainsi conçu: Louis Riel est arrivé avec sa famille au Lac aux Canards.\n\nLes Métis l'ont amené ici pour être leur chef dans l'agitation qu'ils font pour obtenir leurs droits. Ainsi, d'après ce soldat du gouvernement, Riel travaillait de concert avec les Métis à l'obtention de leurs droits communs et ne conspirait pas contre la constitution, ni ne combattait \"les institutions, les lois, les autorités canadiennes.\"\n\nVoici ce que Riel dit lui-même dans son ouvrage sur les Métis publié quelques jours après sa mort, et confié avant le moment de son exécution à son confesseur: \"J'ai traversé les lignes sans armes et sans munitions, emmenant avec moi ma femme et mes enfants. Je ne pensais pas à la guerre, je voulais faire des pétitions.\" Et pour prouver que le mouvement devait avoir, dans l'intention des promoteurs, un caractère tout à fait pacifique, je vais vous citer, après monsieur Amyot, les raisons que messieurs Charles Nolin et Maxime Lepine ont données à Monseigneur Grandin comme cause de l'excitation et du mécontentement des Métis:\n\nNous ne désirons pas que M. Louis Riel vienne chez nous en révolté et pour diriger des révoltés, mais nous voudrions l'avoir à notre tête; le regardant comme capable de rendre service à son pays et à ses compatriotes, et pour cette fin nous voudrions lui voir quelque charge dans le gouvernement, soit comme membre du conseil du Nord-ouest, soit comme membre du sénat.\n\nEnfin Mgr Taché dit:\n\nJ'ai promis de dire la vérité sans tergiversation; aussi il me faut aborder le point le plus délicat de la question de nos troubles et parler de celui qui a été le plus en évidence et que l'on dit résumer toute la situation.\n\nLouis Riel a été choisi par les Métis comme leur chef. Ils sont allés le chercher sur la terre étrangère; ils l'ont amené au milieu d'eux, sur les bords de la\nSaskatchewan. Cette demande s'est faite par suite de l'inutilité des efforts tentés par les Métis et leurs amis pour faire reconnaître leurs droits. Les Métis, ne comprenant pas comment on s'obstinait à les ignorer, se sont persuadés qu'ils étaient joués par ceux même en qui ils avaient mis jusqu'alors leur confiance. Ils crurent que Riel étant des leurs, ayant souffert avec eux et pour eux, mettrait plus de zèle à faire valoir leur cause, et par cela même obtiendrait plus de succès.\n\nVous voyez, monsieur le ministre, que si les gens dont vous vous dites l'ancien et fidèle serviteur, ont cru à la vérité de vos assertions, ils sont sous une impression bien fausse.\n\nVous dites :\n\nOn vous a dit pour tenter de justifier la révolte de Riel : \"Les Métis avaient des griefs que le gouvernement ne voulait pas régler\"; je laisserai le Père André lui-même répondre à cette affirmation. Au procès de Riel il a déclaré que : \"Les réclamations des Métis ont souvent changé de forme après l'arrivée de Riel. Avant son arrivée, ils voulaient des patentes pour leurs terres, ensuite des scrips donnant des droits transférables sur des terres, comme il en avait été donné aux Métis du Manitoba, puis des terres le long de la rivière (river surveys) et exemption de la taxe du bois. Le gouvernement répondit à leur requête leur accordant des lots le long des rivières. C'était une concession très importante. La seule question qui restait à régler était celle des patentes et des droits aux coupes de bois et elle était en bonne voie de règlement.\n\nVers le 4 mars, un télégramme fut reçu annonçant que le gouvernement avait fait ces concessions.\"\n\nCes paroles du père André n'affectent en rien la criminalité du gouvernement. Qu'importe que les réclamations des Métis aient varié dans leur caractère, il n'en est pas moins vrai qu'ils les faisaient depuis 1878 et que ce n'est qu'en mars 1885 que le gouvernement, poussé par la force, fait semblant d'y faire droit. Du reste, il n'a rendu cette justice simulée, et qui lui a été arrachée, que sur un seul point : celui des arpentages ; et monsieur Blake a fait voir dans la chambre les longueurs et les distinctions odieuses qui ont accompagné cette concession. Je pourrais vous citer des pages entières des déclarations du père André contredisant les conclusions que vous cherchez à tirer de ces paroles. Vous poursuivez :\n\n\"Ainsi, d'après le père André, les principales réclamations étaient réglées et les autres étaient en train de l'être. Dès 1883, le gouvernement était décidé d'envoyer le chef du département des terres, M. Lindsay Russell, régler ces réclamations, mais un accident arrivé à cet officier l'empêcha de partir.\"\nVous paraissiez nourrir pour le Père André une affection si vive, que je ne puis résister au désir de vous citer un extrait d'une requête qu'il adressait lui-même au lieutenant-gouverneur du Nord-ouest en juin 1881 et dans laquelle, après avoir exposé les nombreux griefs des Métis, il dit :\n\nJe demande votre indulgence pour l'obligation dans laquelle je suis de vous faire connaître un grief personnel, qui cependant vous donnera une idée de l'état des affaires demandant un prompt remède. J'ai au Lac au Canards un espace de terre d'environ vingt acres dont j'ai été en possession depuis deux ans. La terre était clôturée et en avait coûté beaucoup d'argent et avait toujours été respectée comme étant la propriété de la mission catholique dans cette région. J'ai été l'un des premiers colons sur ce point, et grâce à mes efforts la colonisation a augmenté rapidement, et personne ne m'a jamais contesté la possession légale de cette terre jusqu'au mois de mars dernier, quand un homme du nom de Kelly s'emparant de mes droits et sans entendre mes protestations, reclama la terre comme lui appartenant, y bâtit une maison, s'emparant aussi d'une partie de ma terre. Et ce n'est pas le seul exemple de ce genre au Lac.\n\nComme votre honorable corps est assemblé à Battleford pour légiférer sur les mesures qui, vu votre prudence et votre sagesse, devront concourir au bien et au développement de cette contrée, permettez-moi de m'adresser à vous pour appeler l'attention du gouvernement, à Ottawa, sur cet état de choses, et le presser à prendre des mesures assez énergiques pour faire cesser ces griefs et décharger de ce fardeau les épaules du peuple, parce que s'il n'y porte de suite son attention, les affaires peuvent se tenir sérieusement. Souhaitant le meilleur succès à votre bonne volonté pour le bien du pays, etc.\n\nVous avez cité ce que le père André a dit dans le cours du procès, laissez-moi, à titre de réciprocité, vous citer ce qu'il a dit après l'exécution, dans une lettre écrite à monsieur Lemieux. Parlant de son pauvre défunt :\n\nIl a surtout été fort ému quand je l'ai informé que monsieur Fitzpatrick, à peine débarqué de son voyage en Angleterre, s'était rendu en toute hâte à Ottawa pour tenter un dernier effort en sa faveur. Mais rien au monde ne pouvait le sauver. La détermination de le détruire était un parti pris chez sir John A. Macdonald depuis longtemps, et les ministres canadiens-français, nos défenseurs naturels, cédaient avec empressement à la volonté despotique de leur maître !\n\nLe gouvernement ne pouvait mieux faire pour rendre immortel le nom de Riel et se couvrir d'infamie aux yeux de l'histoire, qu'en laissant exécuter la sentence comme il l'a fait.\n\nSir John, dans sa politique du Nord-ouest, a toujours eu le rare mérite de faire le contraire de tout ce que lui demandaient les vrais amis du pays, etc;\ndans cette circonstance, où de toutes parts on lui a dit que Riel mort serait cent fois plus dangereux que vivant, il a suivi son ancien principe d'avoir pour politique son caprice et sa volonté arbitraire.\n\nDans les dernières lignes que j'ai citées de vous, vous dites que dès 1883 le gouvernement voulait régler ces réclamations. Mais si en 1883 il y avait des réclamations à régler, c'est qu'il y en avait eu de faites. Alors, comment avez-vous pu écrire la phrase suivante, le 6 juin 1885, dans votre lettre à nos amis de Fall-River :\n\nSi les Métis avaient des griefs sérieux contre le gouvernement canadien, la voie ordinaire des pétitions leur était ouverte comme à tout citoyen libre. Ils ne s'en sont pas prévalus.\n\nVoilà de l'audace ou je ne m'y connais pas. En attendant que vous m'ayez expliqué cette contradiction si naturelle chez un homme pénétré de \"la responsabilité que le pouvoir impose\" et imbu du respect du serment, je vais continuer l'examen de votre intéressant travail où je trouve ces lignes :\n\nDans l'intervalle le gouvernement dut s'enquérir du meilleur mode de satisfaire les Métis, soit par l'octroi des terres non transférables, soit par des scrips comme au Manitoba, soit par des scrips pour une somme d'argent déterminée.\n\nQui, je pense bien que le gouvernement aurait dû s'enquérir etc., seulement tout concourt à démontrer qu'il ne s'en est pas enquise.\n\nVous dites :\n\nAu mois de janvier 1885 (le 28) le gouvernement passait un ordre en Conseil créant une commission chargée de régler toutes les réclamations des Métis. Le 4 février dernier un télégramme fut envoyé au Nord-ouest pour faire connaître la création de la commission, et quelques jours plus tard des circulaires étaient adressées aux maires de poste, aux prêtres de ces contrées pour les informer de l'arrivée prochaine de la commission.\n\nOn sait que celle-ci fut composée de MM. Street, Forget et Goulet, et qu'elle a réglé la plupart des réclamations. Riel qui était très bien renseigné sur tout ce qui se passait, se hâta de précipiter les événements afin d'empêcher un règlement qui aurait dérangé tous ses plans et tous ses calculs. Il est évident que son orgueil et son ambition ne trouvaient pas leur compte dans une solution si simple, si pratique qui aurait épargné aux Métis la mine, au pays une centaine d'existences, et plusieurs millions de dépenses dont vous aurez à payer le compte avec le reste de la nation.\n\nIl y en avait donc des réclamations ! Et ce n'est qu'en 1885 qu'on prend cette mesure, lorsque les requêtes se succédaient depuis 1878 !\n\nMais ce n'est pas tout : votre véracité devient de plus en plus éclatante. Vous dites que le 28 janvier 1885, le gouvernement a\nnommé une commission chargée de régler les réclamations des Métis et que le 4 février vous avez envoyé un télégramme transmettant au Nord-ouest la nouvelle de cette création. Cependant ce n'est que le 30 mars dernier qu'a été publié dans une édition spéciale de la Gazette Officielle l'avis de cette nomination. Cet avis était ainsi conçu :\n\n\"Avis est par les présentes donné que sur la recommandation de l'honorable ministre de l'Intérieur, il a, ce jour, plu à Son Excellence le gouverneur-général d'approuver la nomination des commissaires ci-après nommés, afin de faire l'énumération des Métis etc., etc.\"\n\nQuel effet pouvait avoir le 28 janvier, la création d'une commission officiellement nommée le 30 mars ? Il vous faudra, monsieur le ministre, vous inspirer encore du respect pour le serment et vous pénétrer des responsabilités qu'impose le pouvoir pour justifier pleinement, aux yeux du public, l'emploi de pareils procédés.\n\nVous dites encore :\n\nIl ne fit alors du reste que répéter ce qu'il avait fait en 1870.\n\nOn sait que Mgr Taché était accouru de Rome pour tâcher de pacifier son diocèse en insurrection. Arrivé aux Grandes Fourches, un malheureux accident lui arriva. Malgré les plus vives souffrances Mgr se mit en route pour Fort Garry. Riel en fut informé et sentant que son règne allait finir, il n'hésita pas à jeter un cadavre entre lui et la conciliation qui arrivait avec le saint missionnaire ; Scott fut immolé sang fut jeté comme un défi à toute tentative de rapprochement.\n\nIl vous sied bien vraiment de raviver les cruelles souvenances de 1870. Vous accusez aujourd'hui Riel d'avoir commis un meurtre ; je pourrais vous soutenir, avec force documents à l'appui de ma prétention, que le malheureux Scott a été exécuté au moyen de la fusillade après un jugement rendu par une cour martiale régulièrement organisée et entièrement soustraite au contrôle de Louis Riel, président du gouvernement provisoire, qui constituait alors l'autorité légitime dans le Manitoba. Mais cette démonstration n'est plus à faire ; un journal conservateur vient de vous en accabler. Mais admettons pour un moment que Riel ait commis un meurtre, comment se fait-il, monsieur, que vous ayez mis tant de temps à découvrir la chose ?\n\nVous dites que les meurtriers méritent la potence, pourquoi donc avez-vous accusé de barbarie l'honorable monsieur MacKenzie pour avoir maintenu pendant cinq ans Riel dans l'exil auquel il s'était lui-même condamné, de connivence avec sir\nJohn A. Macdonald ? Vous manifestez tout-à-coup pour les meurtriers une horreur que votre chef n'avait pas alors ; que vous n'aviez pas vous-même, puisque vous faisiez de cet abominable criminel le héros de vos fougueuses harangues.\n\nMonsieur le ministre, vous venez de piétiner sur un cadavre et vous piétinez actuellement sur la mémoire de votre fétiché sir George Etienne Cartier, en rappelant forcément au public que c'est des mains souillées de ce meurtrier que Cartier a reçu le mandat qui lui a permis, en 1872, de prendre dans la chambre des communes la position à laquelle ses électeurs de Montréal Est avaient refusé de le réélire. Il est toute-à-fait évident que, dans ce que vous croyez être votre intérêt du moment, vous êtes capable de tout. Jamais on a plus scandaleusement chanté la palinode. Vous brisez vos idoles au pied de l'autel du Mensonge, et, pour vous prouver que vous mentez à tout votre passé, je vais vous citer, après l'Étendard, après MM. Beaubien et Girouard, ce que vous disiez en 1874, en votre qualité de solliciteur général de notre province. Ce sont des extraits de résolutions que vous avez proposées et qui devaient former la base d'une supplique destinée au gouverneur-général. C'est au sujet du mouvement insurrectionnel du Manitoba. Voici :\n\nQue les chefs de ce mouvement se constitueront alors en gouvernement, et qu'un acte regrettable perpétré par l'autorité de ce gouvernement, a été exécution d'un des sujets de Sa Majesté ; qu'après cette exécution des représentants de cette population du Nord-Ouest furent reçus officiellement par le gouvernement de la Puissance qui négocia avec eux la condition de l'entrée de ce territoire dans l'union du Canada et qu'un acte fédéral sanctionna leur demande ; que cette population a vu avec surprise et douleur que des poursuites étaient dirigées contre quelques personnes impliquées dans ces troubles, leur attribuant une responsabilité personnelle allant jusqu'au crime d'homicide volontaire, pour des actes procédant de l'autorité du gouvernement créé dans ce mouvement.\n\nQue cet acte était tellement confondu avec les événements politiques de cette malheureuse époque qu'il est impossible de l'assimiler aux acts de Péronne que la loi punit ordinairement.\n\nCes résolutions sont consignées dans les procès-verbaux de l'assemblée législative de Québec, sous la rubrique : avis de motions, jeudi, 17 décembre 1874. Si vous voulez m'en croire, monsieur le ministre, nous allons laisser au public le soin de faire les commentaires que provoque la mise en regard de ces deux manières.\nd'agir adoptées par vous pour servir vos fins casuelles. Je ne connais pas suffisamment les ressources de la langue pour me flatter de pouvoir trouver des expressions propres à qualifier vos étonnantes contradictions.\n\nVous continuez :\n\nOn a beau dire que ce révolté avait un noble but, qu'il venait aider ses frères à revendiquer leurs droits ; en disant cela on lui prête des sentiments qu'il n'avait pas, on l'affuble d'un vêtement d'apparat pour cacher le rôle sinistre qu'il a joué dans le drame de l'insurrection du Nord-Ouest. S'il eut été mu par un patriotisme éclairé, il aurait suivi une autre voie, il aurait pris d'autres moyens, il aurait recherché et suivi d'autres conseils que ceux que lui donnait son ambition. Il savait où aller, il n'avait pas long chemin à faire pour trouver tout cela. Il savait le zèle et la tendresse de celui qui l'avait protégé et sauvé. Mais non : \"Une ambition effrénée qui a vicié son intelligence et l'a poussé jusqu'au délire, une soif désor- donnée de pouvoir, un orgueil insensé qui l'a conduit à l'apostasie, ont été \"le mobile de ses actes ;\" voilà ce qu'en a dit le plus grand prélat du Nord-Ouest. Un mobile pire encore, un mobile sordide, le faisait agir, si l'on en croit les témoignages les plus respectables. Le Père André, dont on ne saurait mettre en doute les sympathies pour Louis Riel a déclaré sous serment au procès de Régina, que ce prétendu défenseur des Métis l'avait prié à plusieurs reprises, de se servir de son influence auprès du gouvernement fédéral pour lui obtenir $100,000, et avait déclaré qu'en retour il s'engagerait à quitter le Manitoba pour aller où il plaisait au gouverne- nement de l'envoyer. Comme le Père André lui faisait remarquer l'énor- mité de cette somme, il n'hésitait pas à dire qu'il se contenterait de beaucoup moins. Quant aux réclamations des Métis, Rielsse bornait à dire : \"Je suis moi-même la question métisse, si je suis satisfait, les Métis le seront.\"\n\nJe ne crois pas que mes compatriotes, si chatouilleux sur le point d'hon- neur, si francs dans leur patriotisme, pardonnent cet acte de vénéalité. Je défi que l'on dise que c'était là une conversation oiseuse de Riel dont on ne s'est pas occupé ; c'est le contraire qui est vrai : on a donné suite à sa préposition vénale.\n\nCeux qui s'adonneront à parcourir ces lignes ont dû remarquer une chose qui m'a souvent frappé : quand un polémiste procède par cette phrase : \"On a beau dire,\" on peut invariablement être sûr qu'il ne s'en serait que parce qu'il n'a absolument aucune preuve pour contenancer sa réponse. C'est le style qui vous est propre, monsieur ; vous répétez à tous moments des locutions comme celle-ci : Je le dis parce que je le sais et je le sais parce que je le dis.\n\nCe n'est pas toujours fort concluant ; mais prononcé d'un ton résolu, avec la plus harmonieuse voix qui se puisse entendre,\nagrémentée de la plus élégante gestitulation qui se puisse voir, cela produit toujours un effet sur les badauds, qui ont été pour les neuf dixièmes dans la consécration de votre réputation d'orateur, à laquelle je reconnais n'avoir contribué que très médiocrement. Donc ce n'est pas avec des *on a beau dire* qu'on fait une démonstration, monsieur le ministre, c'est avec des preuves ; et c'est ce qui manque totalement aux assertions vôtres que je viens de citer. En calomniant ainsi votre victime, je vous l'ai déjà dit, vous insultez toute la population qui la pleure. Vous avez beau dire, monsieur le ministre, tous les écrits, toutes les paroles, tous les faits conspirent à vous donner le démenti. Vous soutenez que le but de Riel n'était pas noble. Que savez-vous de ses intentions, vous qui vous scandalisez si fort de ce que vos amis signalent au monde les motifs si évidents de votre dernière trahison ? Vous parlez de la vénalité de celui que vous avez livré après avoir touché d'avance les trente deniers qui vous assimilent au patron choisi par vous de propos délibéré dans l'histoire biblique. Vous avez l'air de sentir vaguement toute l'horreur que vous inspirez, et lorsque vous marchez dans votre isolement, ceux qui osent vous approcher prétendent lire sur votre front le vers du poète :\n\nLaissez passer Caïn, il appartient à Dieu !\n\nCar, ne le perdez jamais de vue, c'est le peuple qui a dit que l'exécution de Louis Riel était un meurtre judiciaire, un assassinat politique, un homicide électoral. S'il en est ainsi, comment voulez-vous que le peuple, aux titres de meurtrier et de fratricide, n'ajoute pas celui de mutilateur de cadavre à cause de la besogne où vous vous imprégnez des senteurs nauséabondes de la putréfaction ? Voici ce que dit Riel lui-même de son but dont vous contestez la noblesse. Après avoir établi que les Métis étaient les légitimes possesseurs, les maîtres naturels du sol que vos ignobles émissaires ont impudemment violé ; après avoir établi que jamais les Métis (et ici il corrobore la déclaration expresse de sir John A. Macdonald dans sa réponse au grand discours de M. Blake, dans la chambre des communes, le 6 juillet dernier) n'ont admis le fait de la cession comme valable en justice et conforme au droit des gens ; après avoir établi que la valeur des terres spoliées aux Métis était de plus de $150,000,000 ; après avoir démontré que la civilisation des voleurs avait détruit tout un ordre social établi sur une forme de gouvernement idéal, où la liberté et la justice remplaçaient avantageusement l'iniquité et l'oppression dont vous avez saturé.\nl'application de nos principes administratifs; après avoir démontré que cette civilisation a détruit la chasse du buffle, source de la sereine prospérité de ces naïves et libres populations; après avoir fait voir sous son sombre et véritable jour l'âpre cupidité de l'agglomération de chenapans et de corsaires des plaines, qui s'appelait Compagnie de la Baie d'Hudson; après avoir établi que c'est de ces illégitimes et rapaces détenteurs du sol des prairies, que vous tenez vos prétendus titres de propriété; après avoir établi que les traités conclus avec les indiens étaient de réels actes d'escamotage; après avoir démontré que le caractère relativement arrière de la population métisse était attribuable aux méfaits et à l'égoïsme des pirates de savane que je vous signale ici, qui calomniaient ces contrées au dehors et en interceptaient toute communication avec l'extérieur; après avoir montré qu'aux bandits de la Compagnie de la Baie d'Hudson ont succédé les bandits du gouvernement fédéral, Riel fait de la patrie cette magnifique définition: La patrie est la plus importante de toutes les choses de la terre et, de plus, elle est sainte par les ancêtres qui la transmettent. L'enlever au peuple qu'elle a produit est aussi abominable que d'arracher une mère à ses petits enfants dans le temps qu'ils ont toujours besoin de ses services. Mais la patrie s'appelle la patrie parce qu'elle est le don de Dieu notre père; héritage sans prix, je dois dire plutôt, héritage divin! le peuple qui prend à un autre peuple sa patrie, commet le sacrilège le plus grand, parce que tous les autres sacrifices ne me semblent que des parties de celui-là.\n\nDites si ce ne sont pas là de nobles idées; dites si ce ne sont pas là de nobles paroles, et si celui qui voulait—sur l'invitation pressante de ses frères—arracher cette belle patrie à ses farouches oppresseurs n'avait pas un noble but. Puis les moyens de revendication que vous indiquez, ils étaient tentés sans effet depuis 1878. Riel vous le dit dans son histoire des Métis écrite quelque temps avant sa mort et dans laquelle j'ai puisé ce que je vous dis en ce moment. Lisez:\n\nDans l'automne de 1878, ces pétitions se généralisèrent. Le Lac Qu'Ap-nelle, la Talle-de-harts-rouges, la Montagne-des-Bois, la Montagne-du-Cypres, Edmonton, Victoria, Battleford, le Lac-la-Biche, les Établissements de St-Laurent, Prince-Albert demandèrent justice. Respectueuses pourtant étaient leurs réclamations, mais elles furent traitées avec mépris. On ne daignait même pas répondre. Respectables pourtant étaient-elles ces réclamations d'un peuple chez lui, demandant humblement son propre bien aux intrus audacieux qui l'en avaient dépouillé.\nQu'avez-vous à répondre à cet éloquent énoncé de faits, vous qui avez déposé sur le bureau de la chambre les 76 requêtes qui en établissent la vérité? Que vaut donc tout le fatras dont vous accompagnez votre assertion si peu véridique? Je vous entends toujours: vous accusez Riel de vénalité. Monsieur le ministre, la vénalité est-elle un crime punissable de l'échafaud? Est-ce pour avoir demandé $35,000 que Riel a été pendu? Tous ceux qui se laissent fasciner par l'or et qui vendent leur conscience doivent-ils être hissés sur le gibet? Répondez dans la négative à moins que vous n'aimiez mieux aller vous livrer à l'exécuteur. Mais dans votre tentative de diffamation contre votre victime, non-seulement vous êtes à côté de la vérité, mais vous êtes aux antipodes de la vraisemblance. Riel aurait-il voulu avoir ces $35,000, qu'il avait droit de les exiger. Dans son manifeste ante-mortem il dit:\n\nLe gouvernement d'Ottawa avait fait avec moi en 1870, un traité dont il n'avait pas encore observé une seule clause à mon égard. Je venais pétitionner pour mes gens et pour moi, demander au gouvernement de la Puissance ce qui nous appartenait, dans l'espérance d'obtenir au moins quelque chose, si nous ne pouvions pas obtenir satisfaction complète.\n\nJe vous le demande encore, qu'avez-vous à dire à cela? Quand à l'histoire vraie des $35,000 et de la vénalité que vous cherchez à en inférer, voyons les faits. D'abord, je vous ai déjà rappelé que le père André, dont vous invoquez le témoignage, a déclaré que par cette exécution votre gouvernement s'était couvert d'infamie. Il a parlé du calme intrépide de Riel sur l'échafaud, qui cadre si peu avec le bas caractère de vénalité dont vous parlez et surtout avec le calme pusillamine dont vous vous targuez. Le père André nous dit que sur l'échafaud Riel était le seul à conserver un sang froid et une présence d'esprit, qui paraissent faire complètement défaut à l'auteur de la lettre aux électeurs du comté de Terrebonne. Les âmes vénales ne sont pas ainsi trempées, monsieur le ministre; et, pour me servir de votre expression favorite, vous avez beau dire, etc.; seulement je vais contempler ce beau dire par une preuve. Au cours de votre lettre vous parlez avec éloquence du valeureux et magnanime Gabriel Dumont. Or, le 1 décembre 1885, le Monde, —qui, s'il est suspect à beaucoup de gens, ne doit pas l'être aux ministres—publiait une lettre datée de Port-Arthur, le 26 novembre et signée Odilon Girard. Dans cette lettre où il est question d'une entrevue, antérieure à l'exécution, de l'auteur et de Gabriel Dumont, je lis ceci:\nPour lui (Gabriel Dumont) Riel est un grand homme et un brave. Il se fâche quand on lui rapporte ce que disent les journaux qui lui sont hostiles et il dit que tous ceux qui parlent contre Riel sont des menteurs.\n\nPrenez-en votre parti, monsieur le ministre. J'ajouterai encore ceci : l'Étendard, journal conservateur, a fait bonne justice de cette accusation de vénalité dirigée contre Riel pour le dépouiller, mort, des sympathies du public, comme on l'a dépouillé, vivant, de ses propriétés. Voici ce que disait ce journal le 15 décembre :\n\nAprès avoir vécu pendant cinq ou six ans, de la charité de ces amis, Riel va s'établir au Montan et y vit pauvrement, mais tranquillement. Les délégués métis viennent le trouver ; lui apportent-ils de l'argent ? Lui offrent-ils de lui payer un salaire ? Riel part avec sa famille, et depuis ce temps, il a toujours vécu chez des amis et des partisans, allant d'une maison à l'autre, reçu et hébergé avec l'hospitalité traditionnelle des Métis, sans jamais demander d'argent. Même dans ces actes inspirés par ses malheureuses hallucinations, ce désintérêt absolu subsiste. Il recommande à ses partisans de saisir les munitions et les vivres, ce qu'il faut pour l'entretien d'un corps armé ; voit-on, dans toutes ses lettres publiées par le gouvernement et par les journaux, une seule mention de l'argent qui cependant devait se trouver en une abondance relative, aux postes de la Baie d'Hudson ?\n\nVoilà qui me semble beaucoup plus concluant que votre on a beau dire. Mais il y a plus. Le 25 novembre dernier, un correspondant de l'Étendard lui écrit :\n\nMonsieur le Rédacteur,\n\nA propos des $35,000 piastres, voici ce que j'en connais, je ne crains pas d'être démenti. On sait que ce qui a ébranlé le cerveau de Riel, c'est de voir ses compatriotes disparaître, sa belle langue française menacée par la trahison et l'esprit de parti qui fermaient la bouche à une députation sur laquelle il avait compté. Un matin, il eut une vision, c'est ce qu'il déclara à l'un des missionnaires. La plume lui parut plus forte que l'épée. Pour sauver sa patrie, il lui fallait un journal pour faire connaître au monde toutes les souffrances de ses compatriotes ; il se rappela que Cartier lui avait offert $35,000 pour ses droits comme métis.\n\nSi on me les accorde, se dit-il, alors ma patrie est sauvée, je vais faire instruire des Métis qui m'aideront dans mon œuvre.\n\nIl revit le père André 20 fois après ; la vision ne revint plus qu'une seule fois seulement pour disparaître de nouveau.\n\nCeux qui sont au fait des \"plans\" de Riel, savent que la fondation d'un journal était son rêve...\n\nJe suis avec considération\n\nVotre, etc.\n\nUn Ami.\nUn journal, c'était son rêve ; la propagation de ces idées de justice et de vérité, l'instruction de ses frères les Métis, c'étaient son vif désir. Nolin a déposé, au procès, qu'il l'avait déjà entretenu de ce projet et qu'il voulait faire une tentative auprès du gouvernement pour avoir une partie des $100,000 qu'il en réclamait. Il savait sans doute que les deniers du gouvernement avaient déjà été employés à de pareilles bonnes œuvres, et il n'ignorait probablement pas que le Monde avait été acheté à ce prix, à même les fonds si secrets de ceux qui en sont ostensiblement les maîtres. Il a cru qu'avec son organe il pourrait faire autant de bien, au moins, que la feuille ministérielle, en respectant quelque peu davantage l'orthographe et les préceptes de la civilité ordinaire.\n\nVoilà pour la question de vénalité, et je continue à vous lire :\n\nLouis Riel n'en était pas, l'hiver dernier, à ses débuts dans cette voie de haute trahison. On se rappelle sa révolte de 1869, le meurtre inutile de Scott, qu'il fit exécuter lorsque ce pauvre malheureux était dans l'impossibilité de lui nuire. On se rappelle qu'il s'engagea, quelque temps après ces malheureux événements, en recevant une somme d'argent du gouvernement canadien, à ne plus revenir au Canada pour y faire de l'agitation. Au mépris de sa promesse, il revint au Canada à l'automne de 1884, et se mit secrètement, avec une habileté consummée, à préparer une nouvelle révolte.\n\nJe crois avoir, dans ce qui précède, répondu d'avance à ces inexactitudes, dont vous réitérez l'assertion sans les appuyer d'un semblant de preuve. Nous vous le demanderons toujours : pourquoi ne parliez-vous pas de cette façon en 1875 ? Riel n'a-t-il pas été puni par l'exil, de son insuccès lors de l'insurrection du gouvernement canadien contre l'ordre établi au Nord-ouest ? car cette plaisanterie de la prétendue révolte de gens qui ne veulent pas laisser envahir leur pays dure depuis trop longtemps. Les rebelles, monsieur, ce sont les ministres, ceux qui ont été les forts ; et ceux qui ont passé pour rebelles, ce sont les patriotes métis, qui ont été les vaincus. L'insolent triomphe de la force contre le droit trouve aujourd'hui en vous son apologiste, comme il trouvait jadis son dénonciateur. Car, pour faire usage d'un mot fameux, il est évident que vous êtes capable de tout, même d'une bonne action, pour servir vos fins politiques. Pour cette révolte, pour ce meurtre de Scott, vous avez demandé une amnistie complète, vous, vengeur de la justice et du droit. Pour la commission de ces prétendus crimes, Riel a été amnistié sous condition d'un exil de cinq ans, parce que l'honorable monsieur Mackenzie s'est trouvé à hériter...\nde la nécessité de régler des difficultés et des embarras que vos amis avaient créés en dépit des protestations du leader libéral !\n\nIci je vais ouvrir une petite digression rendue nécessaire par votre attitude actuelle et par les dires de vos organes.\n\nIl s'agit des $5.000 que M. Blake aurait offerts par suite de l'exécution Scott, pour la tête de Riel, comme disent vos organes. Car vos organes disent ceci : M. Blake a offert $5000 pour la tête de Riel. J'oppose à cette assertion la plus formelle dénégation. Jamais M. Blake n'a offert un sou pour la tête de qui que ce soit. Ces façons de procéder n'ont plus cours dans les pays civilisés. Les $5000 ont été offerts en récompense à ceux qui amèneraient à justice, c'est-à-dire qui feraient conduire devant les tribunaux les personnes qui étaient accusées de ce que vous appelez le meurtre de Scott. Cela ne voulait pas dire du tout que ces accusés devaient nécessairement payer de leurs têtes le fait de se trouver directement ou indirectement impliqués dans cette affaire. M. Blake était alors procureur-général de la province d'Ontario. En cette qualité, il était particulièrement chargé de la surveillance de l'administration de la justice. Une exécution avait eu lieu au Manitoba. Les uns appelaient cette exécution un acte de justice militaire ; les autres un crime de droit commun, un meurtre. La société avait intérêt à connaître la véritable signification de toute cette affaire. Les communications avec le Manitoba n'étaient pas aussi faciles qu'aujourd'hui, et les nouvelles n'étaient pas revêtues du caractère d'authenticité désirée. En outre, vous devez vous rappeler qu'on n'était pas encore fixé sur la véritable délimitation du Manitoba et du Haut-Canada. Beaucoup de gens croyaient que le Manitoba était enclos dans les limites de la province supérieure ; en sorte que M. Blake avait intérêt, en sa qualité officielle, de connaître si les faits survenus tombaient sous le coup de sa juridiction. Il voulait éclairer la justice, rien de plus. Si ce procès eut eu lieu ; s'il eut été prouvé que Riel n'avait pris part ni directement ni indirectement à la mort de Scott ; s'il eut été établi que Scott avait été fusillé conformément à la décision d'un conseil de guerre entièrement soustrait au contrôle de Riel ; si surtout il eut été établi que le gouvernement provisoire dont Riel était le président était le gouvernement légitime d'un pays sur lequel nous n'avions aucun droit de domination. Riel eut été rendu à la liberté et à sa patrie. Au lieu de cela, sir John A. Macdonald s'est livré à ses jongleries ordinaires ; il a trompé tout le monde. Il est entré\nen négociation avec Mgr Taché, qu'il a odieusement joué ; il s'est concerté avec les orangistes, qu'il a déçus d'une façon non moins odieuse.\n\nMonseigneur Taché, conformément au caractère de sa mission, voulait la paix et la conciliation. Sir John a profité des dispositions de cet éminent prélat pour faire exercer sur Louis Riel l'influence qu'il avait toujours eue, et pour engager ce dernier à s'évader, c'est-à-dire, aux yeux de ceux qui croyaient que son cas relevait de notre organisation judiciaire, à se rendre fugitif de la justice. Si l'offre de M. Blake eut eu son effet, les plus grandes probabilités sont que Riel eut été acquitté honorablement et qu'il aurait été libéré avec éclat, au lieu de passer pour un contumace. Les choses étaient en cet état de complication lorsque M. Mackenzie est arrivé aux affaires. Riel le contumace a été amnistié à condition de cinq ans d'exil. Monsieur le ministre, vous et les vôtres, vous avez accusé M. Mackenzie de barbarie pour n'avoir pas accordé une amnistie complète à Riel que vous appelez aujourd'hui meurtrier. Et pourtant, comment, dans les circonstances, le gouvernement libéral pouvait-il agir avec une plus miséricordieuse équité ? Aux yeux du pouvoir, l'évasion de Riel constituait un aveu de culpabilité ; d'un autre côté, il était constant qu'au moment même où sir John A. Macdonald exprimait à ses frères en orangisme le sauvage désir de pendre Riel de ses propres mains, il favorisait la fuite de l'inculpé et promettait à Mgr Taché une amnistie générale.\n\nLe gouvernement Mackenzie a donc pris le seul moyen terme recommandé par la prudence et par la justice ; le seul qu'il lui fût loisible de prendre à la suite des embarras créés par son prédécesseur. Ainsi donc, monsieur le ministre, vous ne seriez pas mieux fondé que vos amis et vos organes à reprocher à M. Blake l'offre des $5,000, même si cette offre avait eu pour effet de conduire Riel à la mort, puisque c'est vous qui venez de le déclarer coupable de meurtre. Mais vos organes disent encore : \"est-ce que Riel n'eut pas été exécuté si M. Blake eut été au pouvoir\" ? Je réponds résolument non.\n\nEt ici je ne parle pas des faits abominables du procès ; de la composition du jury ; de l'hostilité du juge ; des obstacles mis à la défense et de toute la scandaleuse procédure de Régina ; je dis que Riel n'aurait pas été pendu parce que, avec une administration libérale, l'insurrection qui a amené la guerre et le procès du captif n'aurait pas eu lieu. \"Ceci m'amène naturellement à\nparler de la façon dont les libéraux ont administré le Nord-ouest depuis que la doctrine odieuse des faits accomplis a enclavé cette contrée dans les limites de notre pays, et je suis d'autant plus porté à le faire que l'archevêque de St-Boniface a dit au cours de son digne manifeste :\n\nAmes yeux, les responsabilités de nos désastres et de nos hontes sont multiples. Elles pèsent non-seulement sur les agents actifs du soulèvement et les administrations qui se sont succédées au pouvoir, mais aussi sur bien d'autres.\n\nJe me permettrai de faire ici une respectueuse distinction et d'établir les faits dans leur naturelle simplicité. Mgr Taché est mieux que vous et moi en état de savoir ce qui se passe au Nord-ouest, et lorsqu'il fait peser la responsabilité de tout sur les administrations qui se sont succédées au pouvoir, je comprends que, d'après lui, sous le gouvernement libéral il s'est commis dans l'administration des affaires du Nord-ouest des choses répréhensibles. Je n'en doute aucunement : il est inévitable qu'il se commette de ces choses sous tous les gouvernements. Mais entre une chose qui se fait sous un gouvernement et une chose qui se fait par un gouvernement, il y a une différence notable sur laquelle j'appelle spécialement votre attention. Du temps que M. Mackenzie était au pouvoir, les communications avec le Nord-ouest étaient excessivement difficiles ; et si les employés se sont rendus coupables d'actes de négligence ou de commission condamnables, ils agissaient à l'encontre des instructions des ministres ; et encore, ces cas doivent avoir été très rares, et on ne voit rien, ni dans les documents publics ni dans les écrits privés, indiquant que, sous le gouvernement libéral, il s'est commis un seul acte ayant la moindre ressemblance avec ceux qui ont provoqué la rébellion. On pourra aussi difficilement prouver que les ministres aient refusé de répondre aux requêtes qui leur étaient présentées ni de faire droit aux réclamations de ceux qui avaient des griefs fondés. Je n'en veux pour preuve que ce qu'en dit elle-même Sa Grandeur. En effet, dans son manifeste, je lis les paroles qu'elle rapporte de lord Dufferin, paroles prononcées le 29 sept. 1877, dans son discours d'adieu au Manitoba :\n\nIl n'y a pas le moindre doute qu'une large part des bonnes dispositions existant entre les Peaux Rouges et nous-mêmes, est due à l'influence, à l'action de cette inappréciable classe d'hommes les Métis, habitants et pionniers du Manitoba (vifs applaudissements), qui combinent, comme ils le font, la vigueur, la force et l'amour des aventures, naturels au sang indien\nqui coule dans leurs veines, avec la civilisation, l'instruction et la force intellectuelle qu'ils tiennent de leurs ancêtres paternels, ont proclamé l'évangile de la paix, de la bonne volonté et du respect mutuel, avec des résultats également avantageux au chef sauvage dans sa loge et au colon dans son chantier. (Applaudissements renouvelés.)\n\n\"Ils ont été les ambassadeurs entre l'est et l'ouest, les interprètes de la civilisation et de ses exigences, vis-à-vis des peuples qui habitent les prairies, tout comme ils ont dit aux blancs quelle est la considération justement due aux susceptibilités, à l'amour propre si sensible aux préjugés, au désir inné de justice de la race sauvage. (Appl. continus.)\"\n\nLes bonnes dispositions dont parle ici l'ex-gouverneur général indiquent assez que le gouvernement libéral ne s'était pas conduit de façon à créer un conflit dans ces contrées. Puis Mgr Taché ajoute :\n\nSi les paroles précédentes avaient été mieux comprises, si la ligne de conduite qu'elles semblaient indiquer avait été suivie, le pays n'aurait pas eu à déplorer les maux qui sont venus fondre sur lui. Quand lord Dufferin a visité Manitoba, heureusement pour l'honneur des Métis, il n'y avait pas de chansons palais. Son Excellence a dû voyager comme on voyageait alors, et tout naturellement il a voyagé avec des Métis. Avec eux, il a parcouru la prairie, il a traversé la forêt, il a connu la charrette et le canot d'écorce, il n'a pas dédaigné de parler avec ses guides. Sachant le français, il n'a pas eu d'interprète ; intelligent, il a compris la population ; homme d'État, il a dit au pays et aux aviseurs des représentants de Sa Majesté : voici le passé des métis, leur utilité, quelques-unes de leurs nobles qualités ; voyez ce que vous devez faire à l'avenir.\n\nCeux qui ne se sont pas conformés aux conseils de lord Dufferin, ce sont les conservateurs qui ont pris le pouvoir dans l'année qui a suivi le prononcé de ce discours : et ce n'est que sous leur administration qu'ont commencé à devenir pressantes les représentations des Métis, qui se mirent à se plaindre non de quelques actes de négligence, mais de la cruelle oppression des représentants du pouvoir conservateur. Le gouvernement libéral a fait tout ce qu'il pouvait pour rendre justice au Nord-ouest. Monsieur Royal, député conservateur du Manitoba, a déclaré dans la chambre, à la dernière session, que le ministère Mackenzie avait donné à ces territoires une constitution admirable ; monsieur Girouard, député conservateur de Jacques-Cartier, dans un discours consacré à la défense politique du gouvernement actuel, reproduit avec force éloges par la Minerve et les autres journaux conservateurs, a dit, à Lachine, le 10 août 1885, que \"en 1875 l'administration Mackenzie changea la constitution du Nord-ouest, pour en accorder une qui était admirable et éminemment dans le sens populaire.\"\nJ'ai dit plus haut que les libéraux avaient hérité des embarras créés par la politique de sir John A. Macdonald lors de la prise de possession des territoires, politique contre laquelle ils avaient toujours protesté. Riel, monsieur le ministre, confirme mon assertion. Dans son discours devant le tribunal de Régina, Riel a dit en parlant des événements de 1869 : \"Les Américains nous étaient favorables. De plus l'opposition, au Canada, a fait de même et a dit au gouvernement : 'EH BIEN, POURQUOI ÊTES-VOUS ALLÉS DANS LE NORD-OUEST SANS CONSULTER LA POPULATION ?'\" Ce discours est reproduit par le Star du 11 août 1885. Cependant la Minerve du 12 septembre dernier disait :\n\nAccablés sous le poids des preuves que nous accumulons tous les jours pour établir à l'évidence que les Métis n'ont jamais eu de pires ennemis que les grès-rouges etc.\n\nVoici de quelle singulière façon M. Cameron, un de ces députés grits dénoncés si violemment par votre organe, se montrait le pire ennemi des Métis. Le 27 mars 1884, un an avant le soulèvement, M. Cameron voyant que les Métis demandaient justice et que des troubles devaient imminents, fit dans la chambre la proposition suivante dont j'emprunte la traduction aux procès-verbaux de la chambre des communes, 1884, page 429.\n\nM. Cameron (Huron) propose comme amendement, que tous les mots après \"que\" soient retranchés et remplacés par les suivants :\n\n\"La Chambre se forme en comité général pour prendre en considération la condition, les plaintes et les demandes du Manitoba et des territoires du Nord-Ouest, en vue de trouver les moyens de rémedier à tous les bien fondés et de faire droit à toutes demandes raisonnables.\"\n\nLe ministère et tous vos partisans ont repoussé cette proposition qui demandait justice pour les Métis. Mais j'aurais pu me dispenser de faire ces citations établissant que ni avant, ni pendant, ni après l'insurrection; les libéraux ont fait quelque chose qui put la provoquer et qui puisse faire retomber sur leur administration la moindre partie de responsabilité pour les crimes administratifs commis au Nord-Ouest et qui ont eu de si déplorables conséquences. \"Le 6 juillet dernier, dans sa réponse à M. Blake, sir John A. Macdonald a dit expressément :\n\nDurant cinq ans, monsieur l'orateur, ils (les Métis) ne connaissaient guère la misère qu'ils enduraient. Ils vivaient dans leurs maisons ou dans les bois sans se plaindre. Ils ne savaient pas qu'ils fussent opprimés ou maltraités. Durant les cinq ans que ces messieurs (les libéraux) ont été au pouvoir, ils (les Métis) ne se sont pas plaints.\nJe crois que cela est décisif. Mais je veux encore citer sir John A. Macdonald pour ceux de vos amis qui veulent absolument que M. Blake soit l'ennemi de Riel... Ce bizarre ennemi a fait, au cours de la dernière session, un discours de plus de six heures, dans lequel il s'est montré si fortement hostile à Riel et aux Métis, que sir John A. Macdonald, qui se contente de les faire pendre, a commencé ainsi sa réponse indignée au chef de la gauche :\n\nJe laisse à la chambre et au pays à décider si l'honorable député, dans son long et élaboré discours, a établi son droit de censurer le gouvernement, s'il a prouvé que nous nous étions rendus coupables de négligence, d'oppression et de mauvaise administration. Mais il y a une chose sur laquelle il ne peut y avoir le moindre doute de l'un ou l'autre côté de la chambre, c'est que l'honorable monsieur par son discours a fourni gratuitement aux avocats de Louis Riel un plaidoyer des plus habiles.\n\nJ'ose dire qu'aucun des avocats de ce malheureux ne pourra énoncer ni produire d'arguments semblables à ceux que l'honorable monsieur a faits aujourd'hui sans tenir compte des conséquences qui pourraient en résulter, comme il le sait.\n\nM. Lister : Qu'elles a provoquées ? Sir John Macdonald : Vous pouvez ricaner, mais vous verrez, cette chambre verra dans le discours des avocats de Riel, lorsque son procès aura lieu dans très peu de jours, que la substance, la base, le point culminant, et le fond de cette défense seront le discours de l'honorable monsieur.\n\nAinsi donc, monsieur le ministre, voilà, aux yeux de votre maître, le grand crime de l'honorable monsieur Blake : oser prendre la défense d'un accusé ; oser préparer une plaidoirie pour soustraire à l'échafaud Louis Riel, le même Louis Riel dont vos amis le proclament le plus grand ennemi ! Et ce même monsieur Blake est le chef reconnu, respecté, vénéré, sans être le dominateur despote du parti libéral ; de ce parti que vous faites attaquer par une presse subventionnée, qui ose—O comble de l'impudeur!—qui ose nous reprocher de ne chercher, dans toute cette affaire douloureuse, qu'à faire de l'esprit de parti ! comme si les libéraux devaient s'abstenir de combattre les criminels, précisément parce que ces criminels se trouvent être leurs adversaires politiques : comme si les libéraux devaient renoncer à leurs intérêts de partisans, parce que ces intérêts sont en parfaite harmonie avec l'intérêt général ! comme si, en face de votre ambition du mal, nous n'avions pas le droit d'avoir l'ambition du bien ! \"Oui, monsieur, nous avons l'ambition de faire descendre de leur insolent piédestal les prévaricateurs avilis qui déshonorent notre état social. \"L'ambition égare les philosophes comme les rois ; mais pour les philo-\n\"sophes aussi, c'est l'ambition qui enfante les grandes choses, les choses qui élevent et enrichissent l'humanité. Qui que nous soyons messieurs, méfions-nous de l'ambition, mais n'y renonçons jamais, ce serait abdiquer la plus haute puissance de notre nature, les plus grandes chances de notre destinée.\" C'est par ces paroles de Guizot que je clos la digression que vous m'avez permis d'ouvrir.\n\nVous dites :\n\nPour réussir, il commence à miner et à ruiner l'influence des prêtres sur les Métis, et lorsqu'il a aveuglé ces derniers, il les pousse à la boucherie. Après la dernière bataille, il n'a pas le courage de suivre Dumont dans sa fuite ; il préfère se laisser arrêter, pensant bien que la province de Québec, qui l'avait sauvé une fois le sauverait encore, même après une seconde révolte. Il se trompait dans ses calculs. Coupable de haute trahison pour la seconde fois, il n'avait plus de titres à l'indulgence qu'on a l'habitude d'accorder aux accusés politiques.\n\nMonsieur le ministre, vous êtes parvenu à anéantir chez moi une faculté, celle de l'étonnement. Bien que je vous connaisse depuis de longues années, je me surprenais encore parfois à m'étonner du sang-gène avec lequel vous violentez la vérité. Mais après les lignes que je viens de citer de vous au sujet de la poltronnerie de Riel, je renonce à l'hahurissement, puisque c'est décidément un parti pris chez vous d'émettre non seulement les propositions les plus inexactes, mais les paradoxes les plus insoutenables. Vous ne pouvez avoir puise l'idée de soutenir que Riel était un pleutre que dans les racontars de quelque scribe aussi profondément obscur que magnifiquement subventionné. Je ne m'attarderai pas à discuter la vraisemblance et l'évidence même ; je cite immédiatement les autorités qui vous contredisent. L'officier américain Howard, chargé de la mitrailleuse Gatling, a dit qu'au fameux siège de Batoche, Riel a déployé un courage au-dessus de tout éloge. Le père McWilliams, un fervent ami de votre administration, qui a assisté Riel à ces derniers moments, a dit, le 26 novembre, jour de son retour de Régina à Kingston, à un correspondant de journaux : \"Riel n'a jamais été un lâche, même en face de ces plus puissants ennemis à Batoche. Il n'a jamais redouté aucun homme mortel. C'était un homme supérieur à tous les points de vue.\"\n\nEt puis, monsieur le ministre, comment pourriez-vous concilier la cowardise dont vous parlez si gratuitement avec le récit de sa mort et de son attitude sur l'échafaud ? Le Regina-Leader, un journal anglais, lui a rendu pleine justice sur ce point. La Gazette\nde Montréal, organe du ministre de l'intérieur actuel, disait, dans une dépêche publiée le lendemain de l'exécution :\n\nBien qu'on ait dit qu'il ait manqué de fermeté sur le champ de bataille ou en face du danger, personne n'oseraient l'accuser de cela après avoir été ému de l'indifférence de son attitude et de la suavité de ses paroles en recevant le fait de sa condamnation. Le stoïcisme provenant du sang indien qui coulait dans ses veines lui a bien servi pour faire voir, dans ses derniers instants, que sa carrière avait été animée des motifs du patriotisme.\n\nIl me semble que voilà un journal de vos amis qui vous inflige un dénégation assez brutale. Mais le même journal dit dans un autre endroit de son édition du 17 novembre :\n\nIl y a quelques jours, il a reçu de sa vieille mère une lettre qui l'a visiblement affecté ; mais dans aucun autre moment du temps qu'a duré sa captivité il n'a montré des signes de la faiblesse qu'on lui a imputée lors de son arrestation.\n\nJe vous ai déjà dit ce que pensait de Riel l'héroïque Dumont ; je vais maintenant vous faire voir ce qu'en pense M. Coursol, de qui on n'a jamais prétendu qu'il ne se connaissait pas en fait de courage. Voici ce que disait le député conservateur de Montréal :\n\nEst à la grande démonstration du Champ-de-Mars :\n\nPendant quelque temps j'étais prévenu contre Riel qu'on nous avait représenté comme un lâche ; mais qui douterait aujourd'hui de la bravoure de cet homme, qui douterait qu'il ne se soit pas conduit en brave sur le champ de bataille après l'avoir si profondément admiré sur l'échafaud, après avoir vu l'héroïsme tout chrétien dont il a fait preuve à ses derniers moments au point de provoquer l'admiration et la sympathie de ses bourreaux eux-mêmes.\n\nIci je suis prêt à reconnaître que M. Coursol se trompe, car il y a de ses bourreaux qui ne veulent pas du tout manifester de pareils sentiments. Et quand vous invoquez contre lui le fait qu'il s'est livré au général Middleton au lieu de se sauver, vous prouvez contre votre propre assertion. Tous les documents établissent que Riel ne s'abusa pas sur le sort qui l'attendait et que, s'il s'est rendu, à l'invitation du général anglais dont vous avez si grassement payé les barbares services, c'était pour sauver les femmes et les enfants. Voici, du reste, ce qu'a dit le révérend père André quatre jours après la mort de Riel, dans une lettre adressée à M. Lemieux, dont je vous ai déjà cité des passages édifiants :\n\nMon cher Lemieux, notre pauvre ami Riel est mort en brave, en saint. Jamais mort ne m'a tant consolé et édifié que cette mort.\n\nIl a, si je puis me permettre cette expression, ennoblé et comme sanctifié l'échafaud.\nToute la nuit qui a précédé sa mort, Riel n'a pas manifesté le moindre symptôme de frayeur.\n\nComme je lui manifestais ma crainte de voir une crise survenir quand viendrait le moment suprême, il me disait avec force : \"Ne craignez rien ; je ne ferai pas honte à mes amis et je ne rejouirai pas mes ennemis ni les ennemis de la religion en mourant en lâche. Voilà quinze ans qu'ils me poursuivent de leur haine et jamais encore ils ne m'ont fait fléchir ; aujourd'hui moins encore, quand ils me conduisent à l'échafaud, et je leur suis infiniment reconnaissant de me délivrer de cette dure captivité qui pèse sur moi. J'aime assurément mes parents, ma femme, mes enfants, mon pays et mes compatriotes ; la perspective d'être libre et de vivre avec eux aurait fait battre mon cœur de joie. Mais la pensée de passer ma vie dans un pénitencier, mêlé à toute l'écume de la société, obligé de subir tous les affronts, me remplit d'horreur. Je remercie Dieu de m'avoir épargné cette épreuve et j'accepte la mort avec joie et reconnaissance. Un nouveau sursis, dans les dispositions d'esprit dans lesquelles je suis, m'affligerais grandement.\"\n\nIl s'écriait comme dominé par une sorte d'enthousiasme religieux :\n\n\"Laetatus sum in his qua dicta sunt mihi : in Domum Domini ibimus.\"\n\n\"Soyez tranquille, père André, je mourrai joyeux et courageux. Avec la grâce de Dieu, je marcherai bravement à la mort.\"\n\nVous, voyez monsieur le ministre, que votre assertion est aussi audacieuse que déplacée. Riel eut été un lâche de la plus triste espèce, si, étant secrétaire d'État, il eut, pour sauver son portefeuille, écrit à ses compatriotes de Fall River une épître outrageusement mensongère ; si, en qualité de ministre de la milice, et pour un motif analogue, il eut signé des ordres sanguinaires pour faire massacrer des gens qui avaient raison ; si, se trouvant ministre des travaux publics, il eut, toujours dans le même but, adjugé aux favoris du gouvernement des contrats pour la construction ou l'agrandissement des prisons destinées à ses compatriotes combattant pour la justice et pour la liberté. Mais Riel n'était rien de tout cela, et tout tend à prouver qu'il n'eut pas craint d'aller rendre compte de sa conduite à ses électeurs et qu'il ne ce serait pas sauvé dans un wagon obscur en Angleterre dans certaines circonstances particulières. Non, monsieur, Riel n'était pas un poltron ; mais vous avez bien fait tout en votre pouvoir pour forcer son noble courage à fléchir. Il est évident que vous ne lui avez accordé répits sur répits que pour provoquer chez lui des défaillances par des angoisses multipliées. Vous vouliez—c'est clair comme le jour—le priver de toutes ses forces afin qu'il parût nous déshonorer dans sa mort comme il avait su nous honorer dans sa vie. A moins que vous ne soyez prêt à admettre que\nlorsque vous lui accordiez ces nombreux sursis, c'est à vous même que vous accordiez le repit nécessaire à vos supputations électorales. C'est ce que je veux examiner plus loin. En attendant, je vais terminer cette partie de mon travail par cette réflexion:\n\nLe ministère Macdonald a pu meurtrir la personne physique de Louis Riel, mais il n'a pas entamé son entité morale, et votre victime a pu marcher à l'échafaud en répétant les paroles célèbres d'Achille de Harlay : \"Mon âme est à Dieu, et mon corps au pouvoir de la violence.\"\n\nVous dites :\n\nMais là n'est pas le trait le plus révoltant de sa faute. Personne ne nie que c'est lui qui a soulevé les tribus indiennes du Nord-ouest, et qu'il a été la cause d'un massacre affreux où nombre de personnes, dont deux missionnaires catholiques, ont péri victimes de la barbarie sauvage. Demandez à tous les prêtres, à tous les Métis du Nord-ouest, quel est le meurtrier des Pères Fafard et Marchand, et tous vous répondront : \"Riel.\" Lui seul avait pu persuader aux tribus sauvages de se soulever ; et il est responsable, au premier chef, des meurtres que ce soulèvement a causés ; or soulever les Indiens est regardé par tous les gouvernements qui en ont sous contrôle, comme un crime qui mérite la peine capitale, parce que c'est un crime contre toutes les lois de l'humanité, la guerre des sauvages étant une guerre d'extermination, sans quartier, sans merci pour les personnes sans défense, pour les femmes et les enfants. C'est le plus grand attentat possible contre la civilisation et un crime qui tombe en dehors de la classe des crimes politiques.\n\nMais oui, monsieur, tout le monde nie que ce soit Riel qui ait soulevé les tribus indiennes et qui soit responsable du massacre des missionnaires. C'est vous, messieurs les ministres, qui êtes responsables directement de ces sanglantes équipes. Je ne perdrais pas mon temps à vous faire de la métaphysique sur le droit constitutionnel et parlementaire et sur la responsabilité gouvernementale. Je cite tout de suite mes autorités. D'abord Mgr Taché. Voici ce que vient d'écrire celui que vous appelez vous-même le plus grand prélat du Nord-ouest.\n\nJe ne veux donc nullement justifier les Sauvages, mais puisqu'il est à propos que la vérité soit connue, et au risque d'étonner beaucoup, j'affirme que ces massacres n'ont pas été sans provocations du moins éloignées. J'invoque le témoignage d'une des victimes elles-mêmes. Le R. P. Fafard disait à un de ses confrères qui me l'a répété : Un tel est d'une brutalité indigne envers les Sauvages. Il se fera tuer quelque jour. Celui dont il était question a été tué et deux généreux missionnaires ont augmenté le nombre des victimes, qu'ils voulaient protéger.\nUn gentilhomme, contre la vérité duquel je ne puis avoir de doute, m'a assuré à moi-même que des Sauvages lui avaient dit, en 1834, que cet individu les traitait comme des chiens; et ce dernier lui aussi a été tué par un des Sauvages qui se plaignaient de lui. Je dis ces choses, si pénibles à dire, parceque les deux cas que je cite ne sont pas les seules exceptions aux bons traitements auxquels ces pauvres gens ont un droit moral, et je le dis, puisque je parle pour l'avenir encore plus que pour le passé.\n\nOr c'est vous qui êtes directement responsables de la conduite des fonctionnaires publics, parceque c'est vous qui les nommez à leurs emplois par faveur spéciale; et il est bien connu que ceux que vous avez envoyés au Nord-ouest n'ont eu pour titres à votre générosité que le manque de scrupule dont ils avaient fait preuve dans les luttes de la politique. Voici maintenant ce qui confirme le dire de Mgr Taché. Au mois d'août dernier le père André écrivait à M. Lemieux une lettre au cours de laquelle il disait:\n\n\"Métis et sauvages confondent leur race et joindront leur mains comme leur sang pour se défendre. Il est donc de la plus grande importance de les menacer et de ne pas les oublier en se montrant sévère à l'extrême à leur égard.\"\n\nCette lettre a été publiée dans l'Électeur du 12 août. Voyons de quelle façon le gouvernement et ses affidés savaient ménager les sauvages. L'honorable M. H. J. Clarke, ex-procureur général du Manitoba, un chef conservateur, a dit dans une entrevue qu'il a eue avec un représentant du Winnipeg-News, l'été dernier:\n\nDans bien des circonstances les indiens ont été traités de la façon la plus cruelle; ils étaient volés par les fournisseurs qui leur donnaient de la farine et d'autres aliments dont il était impossible de faire usage; la population du Canada payait pour fournir la meilleure farine, et l'agent des sauvages ne leur donnait que la pire qualité et se dérobait à toutes les enquêtes grâce aux influences occultes qu'il faisait jouer à Ottawa. On a nommé des chenapans bruts comme instructeurs agricoles des indiens; ils maltraitaient ces pauvres gens de la façon la plus ignoble, leur répondant par des coups de pied et par des soufflets accompagnés d'une averse de jurons et d'épithètes dégoutantes; les instructeurs agricoles tués par les sauvages étaient universellement connus comme de misérables brutes du genre de celles que j'ai mentionnées, et les prêtres ont été tués en essayant de les soustraire au courroux des sauvages.\n\nDans une lettre datée de Battleford, 20 juillet 1885, le père Legoff, missionnaire, écrivit à monsieur le docteur Fafard pour lui rendre compte du massacre des pères Fafard et Marchand. Voici ce qu'il dit dans sa lettre reproduite par tous les journaux:\n\n\"Seul l'agent oubliant qu'il n'était plus qu'un simple prisonnier eût\nmalheureuse idée de braver les sauvages et refusa de marcher, ce fut la cause immédiate du massacre. Possible que ce massacre eut eu lieu tout de même tôt ou tard. L'on prétend pourtant que sans cette vaine bravade qui mit le comble à l'exaspération des Cris, ceux-ci n'eussent jamais osé en venir à ces extrémités. En tout cas, l'agent refusant de marcher, fut tué immédiatement ; et, en le visant, son meurtrier donna ordre de tuer tout le monde.\n\nJe veux maintenant vous démontrer, monsieur le ministre, que même après les recommandations de Mgr Taché, du père André, de M. Clarke et de tous les missionnaires chrétiens, les fonctionnaires conservateurs traitaient les indiens plus brutalement que des chiens. Monsieur Gabriel DesGeorges, votre ancien secrétaire intime, est un de vos amis les plus sincères, les plus dévoués, les plus tenaces ; je puis vous l'affirmer. Pendant la campagne, il était officier dans le 65me et joignait à ce titre celui plus important encore de \"correspondant militaire du Monde.\" De plus il avait été nommé Commandant des Métis de St-Albert. Or, voici ce que ce fonctionnaire éminent a écrit sous sa signature dans le Monde du 29 août dernier, au sujet d'une rencontre qu'il a eue avec un paisible indien :\n\nJ'avoue, à ma honte, que je n'ai jamais éprouvé pour les sauvages autre chose que le plus profond mépris.\n\nSans avoir l'air de remarquer sa présence, je vins mettre pied à terre à dix pieds du fort, recommandant cependant au vieux Baptiste de bien s'assurer qu'il y avait huit balles dans sa carabine.\n\nLe chef se tenait debout, les bras croisés, à la porte du fort, sa carabine à côté de lui, appuyé sur le cadre de sa porte, il ne paraissait même pas soupçonner mon existence ; ses quatre compagnons étaient assis parterre à trois ou quatre pas de la porte, je le poussai légèrement de la main pour lui indiquer que je voulais passer, il céda d'abord à la pression, mais par un mouvement brusque il revint se mettre en place et me boucher cette fois complètement la porte.\n\nLa mauvaise volonté était évidente, et je compris qu'un coup de force devenait nécessaire ; saisissant vigoureusement mon sauvage par l'épaule gauche, je le fis vivement pivoter sur ses talons et je lui flanquai là où le dos change de nom, le plus formidable coup de pied donné jusqu'à ce jour dans tout le territoire du Nord-ouest.\n\nL'effet de ce coup de pied fut désolant pour la dignité du chef, il roula au milieu de ses compagnons qui riaient jaune, aux grands applaudissements du vieux Baptiste qui témoignait hautement son enthousiasme pour le beau coup.\n\nLa moutarde avait commencé à me monter au nez, mais devant la tenue plus que pacifique de mon adversaire, je dus me borner à des paroles.\nJe priai Baptiste de m'apprendre comment s'appelait une vache dans la langue des Cris, et je lui enjoignis de dire, de ma part, au chef et à ses guerriers, qu'ils étaient cinq vaches.\n\nJe m'arrête ici dans ma citation pour faire remarquer une chose. Je connais assez monsieur DesGeorges,—des procédés de qui je n'ai qu'à me féliciter,—pour dire qu'en cette affaire il a agi en toute candeur d'âme et qu'il ne croyait pas faire acte d'inhumanité en maltraitant ainsi un pauvre sauvage taciturne. Monsieur DesGeorges est conservateur. Comme vous, monsieur le ministre, il est fermement convaincu de la nécessité et de la légitimité de l'inégalité des conditions humaines, et le dogme de la fraternité universelle est, à ses yeux, tout au plus une drôlerie paradoxale. C'est là une doctrine que je repousse de toute la force de mon âme et que tous les libéraux vrais combattent avec un admirable acharnement. C'est en vertu de cette doctrine que vous avez escaladé les degrés qui vous ont conduit au poste de domination illicite que vous occupez. Vous croyez à votre droit inné d'exploitation illimitée sur le reste des hommes, et les plus intègres de vos coreligionnaires sont imbues de la maxime que, le monde se composant de dupes et de dupeurs, le rôle de ces derniers leur appartient en vertu d'un décret spécial du Destin. Cette croyance vous mène tout droit à l'odieuse théorie de la raison d'État, et, après vous être persuadé, ou à peu près, de la légitimité de l'existence du pouvoir que vous détenez par voie d'escamotage, de duplicité et de corruption, vous vous êtes persuadé aussi que pour conserver cette puissance, le mensonge, la spoliation et l'homicide vous étaient non-seulement permis, mais commandés.\n\nJe reviens à M. DesGeorges et à la conduite de vos agents dans le Nord-ouest. Il dit dans une lettre postérieure à celle que je viens de citer :\n\nIl est triste de voir certains agents du gouvernement comprendre si mal ses vrais intérêts, et on arriverait à penser que du moment où il s'agit des Métis, les plus coupables négligences sont permises.\n\nSans vouloir m'ingénier à concilier cette sollicitude pour les Métis avec ses façons de procéder envers les sauvages, je profite du fait qui cause ici la tristesse du commandant des Métis de St-Albert pour confirmer mon dire sur le sujet qui nous occupe.\n\nAi-je besoin de rappeler ici l'opinion du conseil du Nord-ouest, composé en totalité de conservateurs, qui vient de condamner la conduite odieuse des employés du gouvernement et dont l'un des\nmembres a dit que ceux des sauvages qui ne mouraient pas de faim étaient ceux qui consentaient à manger la viande pourrie que leur offraient les agents, au lieu de la viande de première qualité que nous, habitants du Canada et contribuables au trésor public, avions commandé d'acheter et pour laquelle nous avions payé le plein prix et bien au delà ? Ce n'est donc pas Riel qui est cause du soulèvement de la guerre indienne : ce sont les concussions et les barbaries sans nom des agents de votre ministère. A l'appui de cette prétention je vous cite une autorité que vous ne récuserez pas.\n\nLe Minerve du 12 décembre 1885 dit :\n\nCe que dit Mgr Taché des officiers publics ne saurait échapper à l'attention du gouvernement. Ce n'est pas la première fois que l'on affirme que les griefs des Métis et des sauvages peuvent être attribués en partie aux faits et gestes des employés. Le gouvernement est sans doute responsable de l'action de ses officiers, mais on avouera qu'il lui est difficile d'exercer un contrôle constant et rigoureux à la distance où ils se trouvent. Il importe donc que le choix des employés soit fait avec un soin excessif. Honnêteté, intelligence, affabilité : tels doivent être leurs principaux titres. Le gouvernement doit se montrer implacable envers les prévaricateurs.\n\nC'est précisément ce que je pense, en ajoutant comme corollaire que le peuple doit se montrer implacable pour les ministres qui, loin de se montrer implacables envers les prévaricateurs, les ont constamment protégés et favorisés et qui, pendant sept longues années, ont refusé opiniâtrement de prêter l'oreille aux suppliques de toutes sortes dans lesquelles les habitants du Nord-ouest se plaignaient de ces épouvantables prévarications.\n\nVous poursuivez :\n\nAvant l'exécution de Riel, ceux qui voulaient le sauver ont fait valoir à son profit la prétention qu'il était fou, et par là même, non responsable de ses actes. On a exigé du gouvernement, au dernier moment, qu'une enquête fût faite sur son état mental. Cette enquête a eu lieu ; Riel a été trouvé assez sain d'esprit pour avoir conscience de sa faute et les faits les plus récents ont confirmé le résultat de cette enquête. En effet, depuis son exécution, on se donne bien garde de le traiter d'insensé. On le met au rang des patriotes, des héros, des martyrs. On va même jusqu'à demander qu'on l'enterre sous le monument des nobles victimes de 37-38. Que diraient Cardinal, Duquet, de Lorimier, Chénier, si on leur proposait de partager leur gloire avec un homme qui voulait troquer la cause des siens pour de l'argent, qui terrorisait les religieuses et les prêtres, qui appelait les sauvages au massacre des blancs et qui faisait égorger de saints missionnaires ?\nTout ce que vous dites dans le paragraphe qui précède au sujet des saints missionnaires, de la vénalité de Riel et des actes des sauvages est la répétition des affirmations non fondées dont je n'ai plus à m'occuper, parce que je les crois entièrement anéanties. Pour ce qui est de Cardinal et des autres victimes de l'oppression gouvernementale de 1837, comme Riel l'a été de l'oppression administrative qui dure depuis 1878, il est maintenant dans la ferme croyance de tout le monde que vous les auriez pendus. Laissons donc dans leurs tombeaux vénérés ces morts illustres qui y ont été enfermés par vos pareils de cette sombre et glorieuse époque de notre histoire. Vous n'avez pas, je l'espère, de cadavres à fouiller ni à mutiler sous le monument des victimes de 1837-38, puisque les restes de ces héros doivent être complètement réduits en poussière. Abordons plutôt la question de la folie du supplicié de Régina, et parlons d'abord de la fameuse enquête dont vous faites une mention si fugitive. Où est le rapport de ceux qui ont conduit cette enquête? que ne le livrez-vous à l'édition du public comme vous y livrez vos manifestes inconsidérés? Le Star du 13 décembre 1885 a publié la dépêche suivante venue de Toronto:\n\nLa déclaration faite par sir Alexander Campbell à l'effet que le gouvernement avait fait faire secrètement une enquête minutieuse, conduite par des experts en médecine, sur l'état mental de Riel avant son exécution, a ravivé l'intérêt ici (à Régina) au sujet de la visite secrète des docteurs Valade et Levell. Toute l'affaire a été si mystérieuse que le docteur Valade s'est inscrit sous le nom supposé de monsieur Lavoie. Ces médecins ont eu deux longues entrevues avec Riel avant qu'il eut la moindre idée de leur mission et de leur qualité... Ils ont aussi interrogé le père André, le docteur Jukes et quelques-uns des gardiens. Dimanche, le 8 novembre, les commissaires-médecins ont eu une consultation, et, après avoir dîné avec le gouverneur, ils adressèrent chacun une dépêche télégraphique chiffrée à sir John A. Macdonald. On dit que le docteur Lavell, dans sa dépêche, a reconnu que le prisonnier n'était pas affranchi de l'aliénation, mais qu'il était responsable de ses actes, pendant que le docteur Valade a déclaré qu'il était complètement aliéné et incapable de faire la distinction entre le bien et le mal. On ne saurait contester que le père McWilliams, prêtre irlandais catholique d'Ottawa, et administrateur de sir John, qui était aussi à Régina, revêtu d'une mission confidentielle d'Ottawa, a fait un vigoureux appel au gouverneur-général et à sir John contre la pendaison d'un fou.\n\nJe livre ceci à votre méditation et à celle du public, que je me propose de mettre dans le secret de notre correspondance. La Presse journal conservateur rédigé par vos intimes, a dit le 18 décembre:\n\nDans sa lettre aux électeurs de Terrebonne, M. Chapleau s'appuie sur la décision d'une présumée commission médicale qui se serait réunie mystérieusement à Régina, pour affirmer urbi et orbi que Riel était parfaitement sain d'esprit.\n\nDans son memorandum au conseil privé, sir Alexander Campbell consacre à la discussion de l'état mental de Riel plus de 300 lignes sur 1,000; et il\ncite l'opinion médicale de plusieurs juges de la Cour du Banc de la Reine du Manitoba ; mais il paraît ignorer que trois médecins en titre se soient réunis et aient délibéré à Régina, sur l'ordre du gouvernement, au nom duquel il parle. L'acune étrange, plus qu'étange, dans un document destiné à rassembler tous les moyens de conviction contre Riel et tous les moyens de justification invoqués par ses bourreaux.\n\nQui faut-il croire de M. Chapleau ou de sir Alexander Campbell ?\n\nFaut-il croire que la commission méditée sur laquelle la lettre de M. Chapleau s'appuie ne s'est jamais réunie ?\n\nFaut-il croire que cette commission ait tenu à Régina des réunions qui auraient été connues de la partie française du cabinet et ignorées de sir Alexander Campbell et de ses collègues anglais ?\n\nFaut-il croire que la commission, réunie dans le plus profond mystère, s'est prononcée contre l'exécution de Riel ; et que sir Alexander Campbell mis en présence d'un faux à commettre, a refusé d'invoquer officiellement en faveur de la pendaison de Riel, l'opinion de médecins qu'il savait pertinemment s'être prononcés en sens inverse ?\n\nCette dernière hypothèse, qui semble confirmée par les faits connus, n'offre en elle-même rien d'inviscéable. Ce ne serait pas la première fois que les Anglais auraient associé à un esprit de vengeance sauvage et à un oubli complet des règles de l'humanité, nous ne savons quel reste de franchise, dans la barbarie, un vestige de fair play, dont il est douloureux de constater que nos ministres canadiens-français et leurs organes n'ont pas même eu le sentiment pendant tout le cours du procès.\n\nLa question n'en reste pas moins pendante et veut être éclaircie ?\n\nPourquoi sir Alexander Campbell n'a-t-il pas osé, ou pourquoi a-t-il refusé de s'appuyer sur la prétendue décision de la commission médicale ?\n\nEst-il vrai qu'il lui fut impossible de s'appuyer sur cette décision, parce que la majorité, c'est-à-dire deux médecins sur trois avaient télégraphié à sir John que Riel était absolument fou ?\n\nEst-il vrai, comme nous en avons l'assurance positive, que cette dépêche, ou pour parler plus exactement, ces deux dépêches avaient été reçues par sir John, à Ottawa, le samedi, 14 novembre ?\n\nQuelle est cette dernière et sinistre comédie ?\n\nOn nous a assuré que sir John, voulant faire semblant de dégager la paix de sir Hector Langevin, aurait consenti à la dernière heure à envoyer à Régina une commission organisée dans des conditions bien dérisoires ; bien décidé de se servir de sa décision comme d'un moyen de défense si elle déclarait qu'il fallait pendre Riel, et n'en tenir aucun compte dans le cas contraire. On nous a assuré que sir John, ayant reçu les deux dépêches qui déclaraient Riel fou, aurait mis ces dépêches dans sa poche, sans les communiquer à ses collègues et aurait laissé l'exécution suivre son cours.\n\nLa promesse faite aux orangistes le voulait ainsi !\n\nMais, s'il est vrai que cette infamie, qui expliquerait la fuite de sir John — s'il est vrai que sir John ait été commis et qu'un assassinat en soit résulté, comment expliquer que MM. Langevin et Chapleau ne soient révoltés ensuite, lorsque la vérité leur a été connue ?\n\nComment expliquer qu'ils n'aient point profité d'une circonstance si odieuse, pour rejeter la complicité d'un crime sur la nature duquel on les aurait induits en erreur ?\n\nComment expliquer qu'ils soient encore ministres ; et surtout que, dans sa lettre aux électeurs de Terrebonne, M. Chapleau se soit appuyé sur un rapport qui n'existait pas, et dont il serait impossible de donner le texte au public ?\nJe ne dis rien, monsieur le ministre, je cite. Et avant de passer à d'autres autorités, je rappelle à votre souvenir ce passage que je vous ai signalé du manifeste de Mgr Taché, dans lequel Sa Grandeur parle de l'état mental de votre victime. Lisez, je vous prie, ce que dit l'Étendard—j'aime à vous faire lire les journaux conservateurs—du 14 décembre 1885... Il dit.\n\nMais pour en finir avec la question de responsabilité de Riel, il faut voir quelle preuve a été faite sur ce point à Régina.\n\nIl serait trop long de reproduire ici les dépositions des experts : il suffira d'établir qu'ils étaient trois : le Dr. Clarke, de Toronto ; le Dr Wallace de Hamilton et le Dr Roy, médecin de l'Asile de Beauport.\n\nLa Dr Roy déclara carrément que, à son avis, Riel n'était pas responsable de ses actes ; le Dr. Clarke, qui n'avait passé que quelques heures avec Riel, déclara que, d'après ce qu'il en avait eu avait vu, il le croyait irresponsable, mais qu'il ne pouvait donner un avis formel sur ce point, vu le peu de temps qu'il avait eu pour l'étudier. Enfin le Dr Wallace le déclara responsable.\n\nAinsi, sur trois opinions, une est formelle pour la folie, une autre est formelle contre la folie ; quant à la troisième l'expert qui l'a émise, en affirmant pas d'une manière positive que Riel est aliéné, déclare qu'il le croit irresponsable. M. Wallace, d'un autre côté, tout en déclarant Riel responsable, donne une définition de la manie des grandeurs (megalomania) qui correspond exactement avec l'état de Riel, tel qu'il a été constaté à Beauport et au Nord-Ouest par une foule de témoins.\n\nLa couronne avait si bien compris la portée de ses dépositions, qu'elle a fait une contrepreuve pour les détruire. Et elle a interrogé qui ? Le général Middleton, des officiers de l'escorte de Riel, et des ex-prisonniers de Riel pour contredire le témoignage des experts. Avec un juge Richardson, cela suffisait, paraît-il, et le juge dans sa charge aux jurés, exprima formellement son opinion que Riel était parfaitement responsable de ses actes. Nous trouvons, à ce sujet, dans le Mail le fait suivant : Après avoir entendu le plaidoyer de Riel, le Dr. Clarke dit que s'il avait encore à donner son témoignage, il déclarerait bien plus positivement que Riel était fou.\n\nLe 25 août 1885, un correspondant du Mail qui signe Alpha a conclu de tous les antécédants de Riel, qu'il était fou. La Minerve a reproduit cette lettre avec infiniment de complaisance en la recommandant fortement à l'attention de ses lecteurs. On y lit des choses comme celles-ci :\n\nIl aspirait à devenir un grand chef, s'imaginait être un futur Napoléon et probablement le chef d'un nouveau monde religieux qui ébranlerait même le pouvoir du pape. Il était rempli d'ardeur et d'un caractère inconstant, tantôt s'attachant aux dogmes de l'Église Catholique, romaine, tantôt méprisant ses prêtres et ses cérémonies religieuses.\n\nVeuillez remarquer les mots que je reproduis en italiques et vous souvenir que de 1870 à 1879 Riel a été interné aux asiles d'aliénés de Beauport, de la Longue Pointe et des États-Unis. La Minerve du 21 septembre 1885 disait de lui qu'il avait \"la manie des grandeurs.\" Le 3 octobre de la même année, la Minerve publiait un ar-\nticle intitulé *Divagations* de Riel dans lequel elle reproduisait un écrit paru dans le *Pionnier de Sherbrooke* où l'on énumérait toutes les folies passées de ce pauvre chef métis.\n\nLe *Monde* du 6 novembre disait : \"Riel a la manie de la poésie comme celle des prophéties.\"\n\nVous avez pris sur vous la responsabilité d'exécuter la sentence de mort portée contre Louis Riel, malgré le verdict du jury qui l'avait recommandé à la clémence de la cour. Par ce fait vous vous êtes substitué au tribunal. Connaissant tous les faits concernant l'état mental de Riel ; connaissant la croyance généralement répandue que Riel était fou, comment se fait-il donc qu'il ne soit pas survenu un doute dans votre esprit—à vous qui... vous étiez fait tribunal supra-judiciaire pour décider du sort de cet infortuné—et que vous n'ayez pas accordé le bénéfice de ce doute à l'accusé, conformément au principe bien connu du droit criminel anglais ?\n\nMaintenant, à cette question si souvent posée : *Riel était-il fou ?* je me propose de vous offrir comme réponse une petite thèse mienne, dans l'exposé de laquelle je vous prie de ne voir—qu'elle que soit la nature des termes dont je veux à dessein me servir—aucune intention d'injure pour vous et pour les vôtres. C'est une de mes plus sincères et de mes plus fermes convictions que je vais vous exprimer. Voici ma réponse à l'interrogation que je viens de faire :\n\nOui Riel était fou puisqu'il était conservateur-ministériel. D'après les témoignages les plus authentiques et qui s'accumulent avec le plus de monotomie, les principales lubies de Riel étaient l'amour des grandeurs et l'hallucination religieuse. Qui osera dire que ce ne sont pas là les manies de votre tempérament et de celui des vôtres ? Vous êtes dominés—je vous l'ai fait voir plus haut—de l'idée de votre supériorité sur le reste des autres hommes, illusion dangereuse pardessus toutes et qui, dans votre cas et dans celui de vos deux collègues français, n'a pas le moindre prétexte à l'existence.\n\nCar, croyez-moi bien, il y a nombre de gens qui, par conviction libérale, sont bien forcés d'admettre que vous êtes leur égal ; mais qui sont fermement persuadés qu'en faisant cette concession à leurs principes, ils restent de beaucoup en deçà des limites de la modestie. Quant à la manie religieuse, elle a éclaté dans toute votre politique et elle en a été la base la mieux assise. Vous avez officié sur tous les tréteaux, pontifié dans toutes vos gazettes, fulminé contre tous vos contradicteurs ; comme Riel, vous avez mis la main sur l'encensoir et vous avez excommunié du haut de votre autorité illusoire tous ceux qui osaient contester votre infalibilité\nen matière temporelle et vous nier déterminément toute autorité dans les affaires spirituelles. Hélas ! que d'excommunications de cette sorte j'ai senti fondre sur ma tête coupable ! Comme Riel, vous avez adulé ou réprouvé les prêtres selon qu'ils se montraient ou non dociles à vos caprices ou favorables à vos ambitions. Puis, laissez-moi encore vous faire connaître cette conviction ardente de mon âme : quand un homme a de l'intelligence, de l'instruction, de l'intégrité et la connaissance des faits politiques de notre pays et que cet homme est conservateur-ministériel, c'est un fou.\n\nOr, vous ne niez pas que Riel avait de l'intelligence, qu'il était un lettré non dépourvu de talent ; qu'il était éminemment intègre et bien au fait de notre politique ; cependant il était partisan de votre ministère ; dans sa réponse au délégués de la Saskatchewan, en juin 1884, il dit qu'il espérait que, à force d'envoyer des pétitions nous obtiendrons du gouvernement le redressement de tous nos griefs. Entretenir une pareille confiance au bout de six années de déceptions cruelles et de rebuts humiliants, indique certainement aliénation. Et je ne vous soutiens pas ici une théorie en l'air. Il n'y a pas que Riel qui avoue avoir été aveuglé par cette confiance inexplicable. Monsieur le sénateur Bellerose, qui a soutenu constamment votre politique, nous a dit ici à St-Hyacinthe que depuis 20 ans il avait perdu toute confiance en sir John A. Macdonald et qu'il ne l'a appuyé de sa parole et de ses votes que par l'aveuglement produit par l'esprit de parti. Monsieur Amyot, dont je vous ai cité les déclarations au commencement de ce travail, a énuméré une foule de questions que ce déplorable aveuglement de l'esprit de parti lui a fait considérer au même point de vue que le gouvernement, malgré les éloquentes protestations de sa conscience. Monsieur le sénateur Trudel a écrit ceci dans son journal conservateur L'Étendard du 26 novembre 1885 :\n\nPlusieurs des organes du gouvernement, le Mail entr'autres, ont avoué plus de fautes d'administration qu'il n'en fallait pour vouer le ministère à une condamnation implacable.\n\nEt malgré tout cela les conservateurs de Québec s'entêtaient encore à lui pardonner.\n\nCe n'eut guère été grand'chose à leurs yeux que 7 années de négligence ou de dénis de justice criminels, commis au détriment de leurs frères, si au moins ils eussent consenti d'abord à y mettre un terme, ensuite à renoncer au projet diabolique de punir du pénitencier, de l'échafaud même les pauvres victimes de leurs fautes.\n\nC'est que la puissance des liens et des traditions de parti est bien forte ! On s'obstine même contre l'évidence sinon à justifier, du moins à excuser ses amis politiques. Et voilà ce qui explique cette impunité scandaleuse qui,\nau mépris de toute justice, au détriment de toute morale, maintient depuis des années au faîte du pouvoir certains hommes que leur méfaits eussent dû faire bannir à jamais de la vie publique.\n\nEt ce qui nous maintenant dans cet entêtement aveugle de l'esprit de parti, c'était surtout les ruses et les ignobles hypocrisies de sir John et de ses principaux organes.\n\nCe n'était ni par esprit de justice, ni par un sentiment d'honneur et de loyauté que sir John et ses organes nous manifestaient quelque semblant de sympathie. Ces gens-mêmes voyaient en nous une force qui leur assurait le pouvoir quasi à perpétuité. Et c'était évident tout ce qu'ils voyaient en nous.\n\nEn voilà quels étaient nos alliés ! voilà les hommes que, durant trente ans, notre influence et notre dévouement au parti conservateur ont maintenus au pouvoir.\n\nLes personnes qui parlent de la sorte n'étaient-elles pas prises de démence ? Lorsque des hommes de la position de M. Amyot, de l'expérience politique de M. Bellerose et de la haute respectabilité de M. Trudel s'abandonnent à de pareilles confessions, n'est-ce pas un aveu de folie qu'ils font au nom de toutes les honnêtes gens que contenait le parti conservateur ?\n\nMonsieur le ministre, je crois avoir établi au-delà de toute contestation qu'en ordonnant la mort de Louis Riel, non seulement vous avez fait exécuter un juste, mais que vous avez pendu un fou.\n\nPourquoi avez-vous pendu un fou ? Il y a une dette—dette forcée—que le parti libéral a contractée envers les ministres et leurs organes, dont je crois le temps venu de commencer l'amortissement. Vous nous avez gratuitement prêté toutes sortes de motifs inavouables. La question que je viens de vous poser me fournit l'occasion de vous donner un acompte. Vous avez pendu ce fou par le plus abominables de tous les motifs, par calcul électoral. Et je ne ferai pas comme vous dans vos attributions de mobiles non établis ; je vais contester mon assertion par une preuve. Je vous ai démontré qu'aucune des raisons que vous avez invoquées pour justifier ce meurtre ne pouvait soutenir le moindre examen. Sir John, votre seigneur, n'a jamais fondé sa conduite sur autre chose que sur des supputations électorales. Je ne vous rappelle ici que pour mémoire l'acte monstrueux de la délimitation des comtés de l'Ontario, et le bill du suffrage. À propos de ce même Louis Riel sir John a avoué à Mgr Taché qu'en 1871 il ne favorisait financièrement son évasion qu'en vue des élections. Mgr\nTaché a déclaré devant le comité de la chambre des communes chargé d'examiner la question de l'amnistie en 1874—je traduis de la version anglaise :\n\n\"Je suis venu à Ottawa au commencement de décembre 1871. Sir George y est venu aussi et je l'ai vu alors ainsi que sir John. J'ai eu plusieurs entretiens avec les deux, mais je m'en rappelle surtout un avec sir John ; c'était le 7 décembre, vers midi, dans son bureau ; je ne me souviens pas qui a commencé, mais il insista auprès de moi pour que je conseillasse à Riel de quitter le pays pour quelque temps, et il ajouta ces mots, autant que je m'en puis souvenir. \"Si vous pouvez réussir à le tenir hors de la voie pendant quelque temps, je ferai de sa cause la même et j'emporte-rai le point.\"\n\nMgr Taché déclare encore que, dans une conversation qu'il a eue avec sir George et sir John, ils lui ont dit qu'en faisant partir Riel, il était probable qu'ils obtiendraient un plus fort appui dans les élections et qu'ils seraient ainsi plus en état d'accorder l'amnistie ; et ils ont ajouté que cette absence de Riel devait durer tout le temps de l'élection.\n\nCeci prouve suffisamment que sir John n'agissait qu'en vue des élections alors.\n\nMaintenant, les déclarations et les aveux de MM. Bellérose, Trudel et Amyot justifient amplement ma prétention que, vu l'avènement antérieur de votre parti, vous étiez fondé à croire qu'il passerait pardessus la pendaison de Riel comme il avait passé pardessus tant d'actes de scéléратesse administrative desquels M. Trudel dit que le parti conservateur les a approuvés de ses votes par entêtement, même contre l'évidence, même au mépris de toute justice et de toute morale, par pur aveuglement causé par l'esprit de parti. Vous avez cru que le parti conservateur français était, comme je l'ai déjà dit, bernable à merci ; et je dois avouer que jusqu'au jour de l'exécution, l'attitude de tous les journaux ministériels français n'a pas peu contribué à vous maintenir dans cette dangereuse sécurité. A cette confiance aveugle que vous inspiraient à votre tour les complaisances criminelles antérieures de vos amis, vous avez ajouté les intimidations scandaleuses, abominables de cynisme que, sous forme d'articles de journaux, de suppliques dégoûtantes et de résolutions sanguinaires, la presse et les loges orangistes lançaient comme de rouges projectiles sur votre gouvernement. Car nous avons vu ce spectacle hideux, sans précédent dans les lugubres fastes des ignominies humaines, de gens, de chrétiens demandant, par requêtes à l'Exécuteur, la mise à mort d'un homme sur qui pesait une sentence de tribunal. Et c'est à ces requêtes épouvantablement ignobles que vous avez obéi. L'espace me manque pour vous citer\ntoutes celles qui sont venues à la connaissance du public; mais je vais toujours vous en citer quelques unes. Voici ce que disait l'Orange-Sentinel du 18 septembre dernier:\n\nDonc, quelle que soit la conclusion à laquelle en arrive le conseil privé sur les points de droits, la sentence judiciaire prononcée par le savant juge doit être exécutée à tout événement.\n\nAinsi, aux yeux de vos amis les Orangistes, il n'y avait aucune décision du plus haut tribunal de l'Empire qui pût tenir devant la nécessité—préconisée par les conservateurs orangistes—de pendre, coûte que coûte, Louis Riel. Absolument comme vous, monsieur le ministre, le même journal disait le 29 octobre : Le sang de Thomas Scott demande justice, et l'on voulait faire mettre à mort en 1885, pour un prétendu crime commis en 1869, un homme amnistié pour ce fait en 1875! Et vous vous êtes soumis à cette inique injonction. Le même organe des orangistes publiait le 10 septembre l'entrefilet suivant :\n\nUn correspondant qui signe \"un membre de L.O.: L.No 698,\" nous écrit de Pokes Bay, et nous suggère que des démarches devraient être faites avant les prochaines élections générales pour s'assurer des candidats aux honneurs parlementaires, l'engagement de favoriser l'incorporation de la société Orangiste. Notre correspondant pense aussi qu'on devrait faire circuler des requêtes dans les comtés, les faire signer et les envoyer au parlement. C'est regrettable, ajoute-t-il, de voir que les catholiques romains peuvent obtenir de la législature toutes les lois qu'ils désirent, pendant qu'une sociétée loyale ne peut obtenir d'être incorporée. On a fait beaucoup trop de dépenses pour le procès de ce vilain Riel. Le souvenir du meurtre atroce de ce pauvre Scott est encore frais à la mémoire du peuple du Canada, et s'il échappe encore une fois à la justice, il faudra tenir le gouvernement responsable de cela. Notre correspondant ajoute, que si Riel n'est pas exécuté, les députés conservateurs perdront presque tous leurs partisans.\n\nLisons maintenant une ou deux résolutions des loges.\n\nVoici—j'emprunte mes traductions à la Patrie :\n\nÀ une assemblée tenue à Dominion City, L.O. no 1449, le 22 septembre, il a été proposé par le fr. A. Scott, appuyé par le fr. A. C. Scott, et résolu : Que les membres de cette loge voient avec regret, que le gouvernement, par le gouverneur-général, a accordé un sursis à l'archi-traitre Louis David Riel, et qu'il prend des moyens pour détourner les fins de la justice. Nous refusons donc de supporter tout gouvernement qui permet à ceux qui sont impliqués dans la rébellion du Nord ouest d'échapper à la peine d'une juste sentence.\n\nLa résolution suivante fut adoptée par la loge no 300, le 22 octobre :\n\nRésolu que les orangistes voient avec des sentiments de crainte et de regret la tournure que prend l'affaire de Riel. Condamné à être pendu le 18 du mois dernier il est encore vivant, et cela malgré les nombreuses vies qu'il a fait sacrifier et malgré les milliers de dollars qu'il a fait dépenser au gouvernement. Nous recommandons fortement de repousser tout subter\nfuge : aucun délai ne doit être accordé à celui qui a été condamné comme chef de la rébellion. Nous désirons aussi fortement que nos frères, dans tout le Canada, se joignent à nous pour empêcher tout outrage à notre Reine et à notre patrie, que nous sommes tenus de chérir et de protéger.\n\nLa loge 1334, de Fonthill, a résolu le 12 octobre :\n\nLes membres de cette loge déclarent qu'ils ne supporteront aucun gouvernement qui ne verra pas à ce que la justice suive son cours contre ceux qui sont les auteurs des troubles du Nord-Ouest, et qu'ils le combattront à la prochaine élection.\n\nLes orangistes de Fenelon Falls, loge no 996, déplorent aussi la tournure que prend l'affaire Riel. Le rebelle a été condamné à être pendu le 18 septembre mais il est encore en vie ; il demande miséricorde ; nous espérons que cette prière ne sera pas accordée, mais que sa première sentence sera exécutée.\n\nJe pourrais couvrir de nombreuses pages avec des citations analogues ; mais j'écris une courte brochure, et je n'ai ni le temps ni les moyens de produire un volume. C'est en face de l'apathie coupable de la province de Québec et de la faible énergie des Orangistes d'Ontario, que vous vous êtes recueillis dans le cabinet pour faire le honteux calcul, ces supputations immondes qui vous ont fait donner la tête de votre frère à la courtisane grotesque qui vous vend ses faveurs. Vous avez cru par là jouir encore indéfiniment des lucratives et voluptueuses fainéantises de vos postes respectifs ; vous avez cru que désormais vous y pourriez dorloter perpétuellement votre vénalité et votre présomption. Je me crois maintenant autorisé à vous dire qu'avant une pareille maculation sur la conscience, vous et ceux qui seront tentés de vous appuyer de leur rapace bassesse, vous ne formez pas un parti politique, vous êtes une compagnie d'exploitation illicite ; vous n'êtes pas des hommes d'État, vous êtes des flibustiers ; vous n'êtes pas les représentants de la nation, vous êtes les détrompeurs du peuple.\n\nJe n'ai plus rien à relever dans le reste de votre lettre ; vous y répétez ce que j'ai démolé.\n\nJe le produis pourtant par conscience. Voici :\n\nLe vénérable évêque de St-Albert, Mgr Grandin, a dit que la conduite de Riel, pendant qu'il dirigeait l'insurrection, avait été odieuse et monstrueuse, et qu'il avait systématiquement persécuté la religion. Si c'est là le héros que l'on veut nous faire vénérer, je ne serais pas parmi ses admirateurs.\n\nOn veut aujourd'hui faire passer Riel pour un saint. Qu'il soit mort en bonnes dispositions, je l'espère, Dieu seul en est le juge ; mais nous n'avons pas à considérer comment il est mort, mais comment il a vécu ; or, sur cette dernière question, il n'est pas besoin que je me prononce moi-même. Je n'ai qu'à citer le témoignage des missionnaires du Nord-Ouest, qui, étant là sur les lieux, l'ont connu, ont pu juger de ses actes, de ses principes, de sa piété et de sa vertu, et certes il ne nous le donnent pas comme un saint.\n\nÀ part les citations que j'ai déjà faites, voici d'abord la lettre collective des missionnaires de la région de Prince-Albert, datée du 12 juin 1885. On paraît avoir oublié ce document important qui a pourtant été publié partout :\n\"Prince-Albert, 12 juin 1885.\n\n\"Nous, prêtres des districts qu'affecte plus particulièrement la rébellion, savoir : St-Laurent, St-Antoine, Graindind, Lac aux Canards et Batoche puisque c'est là, au milieu de notre population, que Louis \"David\" Riel avait établi ses quartiers généraux, désirons attirer l'attention de nos nationaux du Canada et d'ailleurs sur ces faits.\n\n\"Louis \"David\" Riel ne mérite pas les sympathies de l'église Catholique Romaine et des membres de cette Église, ayant usurpé notre mission de prêtres et privé notre population des avantages et des consolations que nous aurions pu lui offrir.\n\n\"Il a fait tout cela dans son intérêt purement personnel.\n\n\"Signé : RR. Pères André\n\n\"Touze,\n\n\"Moulin,\n\n\"Fourmond,\n\n\"Vegreville,\n\n\"Legor.\n\nEt le Père Fourmond, desservant Batoche même : \"J'ai été bien près de la mort, car si les balles et la fureur des révoltés m'ont fait défaut, la guerre, l'apostasie, l'hérésie, la persécution, l'incendie, le pillage, tout s'est déchaîné contre nous ; on se serait cru à la fin du monde. Déjà nous avions notre Ante-Christ dans la personne de ce fameux Riel, contre lequel il nous a fallu lutter, au péril de notre vie, pour détruire sa funeste influence sur nos pauvres gens.\n\n\"Mon Dieu ! quel homme, quelle hypocrisie, quelle impétuosité tout à la fois !\n\n\"C'est pour cela qu'il a ruiné nos familles chrétiennes par le pillage et l'incendie ; c'est par une conséquence horrible de ses plans diaboliques qu'a coulé le sang des blancs et celui des chers et zélés confrères, massacrés par les sauvages, sur ses ordres.\"\n\nCes témoignages si forts et accablants suffisent à édifier tout homme de bon sens sur le caractère et la conduite de celui qui a entraîné ses œuvres, les Métis dans les plus grands malheurs.\n\nPour condamner notre conduite, on pose en principe qu'on ne punit plus de nos jours de la peine capitale les crimes de haute trahison. C'est là une maxime nouvelle aussi étrange que dangereuse contre laquelle s'insurge la justice, protectrice de la paix et de la sécurité des sociétés. Proclamer que la haute trahison, qui entraîne avec elle le meurtre, le pillage, la ruine des populations, ne doit pas être punie de mort, c'est faire appel aux mauvaises passions des ambitieux, c'est provoquer la révolte en lui garantissant l'impunité.\n\nPretendre sérieusement qu'un homme, coupable une fois de haute trahison et de meurtre, gracié une fois et repris ensuite les armes à la main, doit compter d'avoir la vie sauve, c'est montrer une assurance que Riel lui-même n'a jamais eue, puisqu'en quittant le Montana il a déclaré que sa tête pouvait être le prix de la démarche qu'il entreprenait.\n\nCette doctrine de la miséricorde en faveur des criminels politiques ne saurait, même si elle était admise, s'appliquer à celui qui de sang-froid déchaîne sur ses compatriotes les hordes de tribus sauvages.\n\nQu'on ne vienne pas le justifier en disant qu'il avait foi dans sa mission, que sa volonté n'était pas criminelle puisque sa conscience guidée par son esprit, ne lui reprochait pas les actes effroyables qu'il a commis et fait commettre. Mais depuis quand est donc venue cette doctrine étrange qu'on ne doit pas punir les fautes de l'intelligence ? Les fautes de l'intelligence sont plus criminelles encore que celles du cœur.\nUne passion mauvaise avait vicié l'intelligence de ce grand coupable. Devant Dieu et devant les hommes, il était coupable d'avoir fausse dans son esprit les éternelles notions du juste et de l'injuste, du vrai et du faux, de l'obéissance et de l'insubordination ; cette première culpabilité ôte toute excuse à ses actes criminels qui en ont découlé.\n\nNon, il n'y avait qu'une excuse possible en sa faveur, c'était l'excuse de la folie. Il s'est chargé lui-même dans ses derniers moments, et il s'en est fait gloire, de prouver au monde qu'il était parfaitement libre de sa volonté, conscient de ses actes et de ses fautes. Il est mort en se répétant des crimes dont il avait été la cause, mais ce serait un outrage de lui faire partager l'auréole glorieuse des grands patriotes, morts pour la liberté en 37, de le mettre au rang des victimes de ces jours héroïques. Pour les hommes qui pensent et qui raisonnent, la conduite de Riel ne mérite aucune sympathie sérieuse. Aussi, dit-on de toutes parts : \"ce n'est pas pour lui que nous nous soulevons, nous n'avons pas de sympathies pour ce qu'il a fait, mais nous voulions que sa peine fut commuée parce que tous les Canadiens français demandaient qu'il ne subit pas la peine infamante de la mort sur l'échafaud.\"\n\nJ'avoue que j'ai été profondément touché du concert de pitié et de miséricorde qui s'est élevé en faveur de ce grand coupable, et qui ont monté jusqu'au pied du trône. Mais dans cet élan de générosité de toute une population, on a perdu de vue le fait important que le crime a été commis dans une région lointaine plus exposée que la nôtre aux brigandages, aux soulèvements des Sauvages. On a oublié que l'unique sécurité de la vie, de la propriété des citoyens, de ces contrées nouvelles, réside dans l'exécution rigoureuse des lois. On a oublié que les sauvages meurtriers du Lac à la Grenouille ne pouvaient être graciés, sans mettre toute la population blanche à la merci de ces tribus féroces qui croient encore à leur victoire, et d'un autre côté, on ne pouvait les livrer aux mains du bourreau, et accorder la vie sauve à celui qui leur fait prendre la hache de guerre. On a oublié les angoisses mortelles dans lesquelles toute une population a vécu de longs mois. On a oublié le deuil, la douleur, le désespoir des victimes de cette odieuse révolte. On a oublié que le sang des colons paisibles, des saints missionnaires, des soldats tombés sous les coups des révoltés criait vengeance et que la justice devait faire une réparation éclatante, si l'on ne voulait que la clamour déchirante partie des quatre coins de cette immense région, ne se changeât en un cri de désespoir et de haine.\n\nOn a oublié de se demander si dans cette question de la rigueur ou de la miséricorde de la loi, ceux qui avaient souffert, ceux dont les pères, les fils, les frères avaient par la faute du rebelle et dont l'avenir pouvait encore être menacé, n'avaient pas autant le droit d'être entendus que ceux dont la facile pitié peut s'exercer sans souci d'une réparation par le passé, sans le sentiment d'un danger pour l'avenir. On a même oublié qu'en Manitoba et dans les Territoires nous avons des compatriotes disséminés éparpillés au milieu d'une population qui leur est étrangère et que ces braves avant-coureurs de la conquête pacifique que nous rêvons pourraient bien ressentir fatalement le contre coup de l'agitation de notre province.\n\nPour Québec, c'est une question de sentiment : pour les habitants du Nord-Ouest, c'est une question de sécurité, une affaire de vie ou de mort.\n\nMinistre de Sa Majesté, j'ai dû penser à toutes ces choses, peser toutes ces raisons, envisager froidement la question sous toutes ses faces, et sous la responsabilité du serment solennel que j'ai prêté de faire mon devoir, de défendre la Couronne, et protéger mes administrés. Responsable devant ma conscience et devant Dieu de chacune de mes décisions, je n'ai pu trouver de justification ni d'excuse valable au crime du condamné. Ses avo-\ncats eux-mêmes ont déclaré que son procès avait été conduit d'une manière impartiale ; la question de folie étant écartée, malgré la demande de grâce, le gouvernement a cru devoir conseiller à Sa Majesté, dans la personne de son représentant, d'empêcher que la loi n'ait son cours.\n\nNous n'avions cédé en prenant cette décision, ni aux appels, ni à l'intimidation d'aucune secte ou faction, comme les ennemis du gouvernement se sont plu à le répéter. Nous n'avons pris conseil que de l'intérêt suprême de la société, le plus grand bien du pays, la tranquillité nécessaire au développement si désirable des immenses régions de l'Ouest et nous pouvons le dire en toute sincérité, le plus grand bien d'une province et de compatriotes qui nous sont chers.\n\nL'estime, l'affection, l'appui de nos concitoyens nous sont précieux dans l'exécution des devoirs publics qui nous sont imposés. C'est notre désir autant que notre intérêt, de les préserver intacts, et si, du poste le plus élevé que nous occupons avec la connaissance la plus étendue des besoins de la société, des écueils à éviter, des dangers à prévoir, nous avons cru prendre une décision qui nous était aussi pénible qu'à vous, au point de l'humanité, nous avions le droit de vous demander de nous donner le bénéfice de la confiance que vous avez toujours reposée en nous, et dont notre dévouement et notre conduite vous étaient les garants.\n\nEn nous exposant à encourir votre disgrâce, nous risquons notre avenir. On nous menaçait d'une chute certaine si nous consentions à l'exécution de la sentence du tribunal. Nous avons mis de côté l'attrait de la popularité et de la crainte de votre ressentiment pour rester fidèles à notre devoir.\n\nN'est-ce pas là une présomption de notre droiture, de notre bonne foi ?\n\nOn invoque les sentiments de race et de nationalité pour nous accuser de faiblesses et de trahison. Faire autrement que nous avons fait, eût été violer notre serment, sans profit pour le condamné, qui aurait été exécuté quand même tous les ministres français auraient résigné, sans profit pour le pays, sans profit pour notre province, avec le risque effrayant de compromettre pour toujours ses intérêts les plus chers.\n\nMa conscience me dit que je n'ai manqué, dans cette circonstance, ni à Dieu, ni au Souverain, ni à mes compatriotes. Le courage qui m'a porté à faire mon devoir sans faiblesses ne me fera pas défaut dans les tribulations pénibles dont on me menace.\n\nJe vous ai servis depuis dix-huit ans avec joie, avec orgueil. Je ne continuerai à le faire qu'à une condition : celle de garder ma liberté, mon honneur et le souci de ma dignité.\n\nJ.-A. CHAPLEAU.\n\nLe vénérable évêque de St-Albert a opposé sa formelle dénégation à ce que vous et vos organes avez dit. Du reste, ce n'est pas pour hérésie que Riel a été pendu, et je ne vois pas bien comment vous, qui venez de faire si bien les affaires des sectaires orangistes, vous puissiez invoquer les intérêts de l'Eglise dont ces fanatiques trament-la-rute. À la reproduction de la lettre des cinq missionnaires, je répondrai en vous rappelant qu'elle leur a été subtilisée par un agent du gouvernement qui voulait passer les lignes des ex-insurgés sans être molesté. Les missionnaires du Christ n'ont pas coutume d'enlever leurs sympathies aux condamnés à mort. On les trouve généralement sur les échafauds, à côté des infortunés qui y montent, ayant à la main l'image de Celui qui a pardonné à ses bourreaux, mais qui avait flagellé les Pharisiens, lesquels, de son temps, formaient le parti dominant.\n\nVoici, au surplus, les paroles de Mgr Taché que je vous cite pour la seconde fois :\nLes missionnaires ont souffert, mais les missionnaires ne savent pas crier vengeance. Les deux seuls qui ont été appelés en témoignage en cette cause, ont rendu témoignage dans le sens de la défense. Pourquoi joue-t-on le rôle si indigne de recommencer le procès de l'infortuné exécuté devant le public, en invoquant les témoignages des révérends pères André et Fourmond, qui mis sous serment à la cour, ont rendu un témoignage dont la conclusion naturelle n'était certainement pas l'échafaud ! On va jusqu'à torturer l'âme si généreusement aimante de Monseigneur Grandin, en lui prêtant un rôle indigne de sa position et de son cœur. Et tout cela, on a l'audace de le dire, pour faire prévaloir la vérité.\n\nLe gouvernement a laissé faire l'exécution, il en a donc la responsabilité et c'est une indignité de vouloir la faire peser sur d'autres, qu'on s'est bien donné garde de consulter à ce sujet.\n\nElles sont suivies de celles-ci qui expliquent assez dans quel désordre était l'esprit de ce pauvre Riel lorsqu'il a fait les choses que vous lui reprochez :\n\nPour ma part, une observation de vingt années m'a donné des convictions diamétralement opposées à celles que l'on invoque. J'avais trop de raisons d'étudier dans ses moindres détails les dispositions et les actes de mon infortuné protégé, pour pouvoir ne pas me rendre compte de ce qu'il était et de ce qui a pu le conduire à la voie déplorable qu'il a suivie. Il y a bien des années que je suis convaincu, au delà de la possibilité d'un doute, qu'à côté des brillantes qualités de l'esprit et du cœur, l'infortuné chef des Métis était en proie à une mégalomanie et théomanie qui seules peuvent expliquer tout ce qu'il a fait jusqu'au dernier moment.\n\nVous êtes bienvenu vraiment à parler de la sécurité à établir dans le Nord ouest ! Je vous demande un peu de quelle sécurité on peut jouir dans un pays dont le gouvernement autorise la spoliation des habitants, méprise leurs requêtes et fait pendre les fous ! Je crois avoir fait voir sous leur vrai jour votre droiture et votre bonne foi. Vous parlez du risque effrayant de compromettre pour toujours les intérêts les plus chers de notre province. Je vous entends toujours : vous et vos deux collègues français, vous êtes les trois sommets de notre nationalité. Vos visées sont plus élevées que celles de tous vos concitoyens, votre coup d'œil beaucoup plus pénétrant que le nôtre. Eh bien, je vous le dis en toute sécurité de conscience : ces assertions ne valent pas plus que toutes celles que j'ai mises à néant. C'est votre gouvernement qui a fait tout le mal ; c'est lui qui doit déchoir. C'est en vain que vous voulez terrifier vos amis en les menaçant de l'avènement des libéraux. Les libéraux ne sont pas ostracisés du pouvoir. Ils contribuent au trésor commun des sommes dont ils ont droit de connaître et de contrôler l'emploi. Ils forment la loyale opposition de Sa Majesté dans le Parlement. La constitution les reconnaît à ce titre comme parti; et l'application des principes de cette constitution leur appartient légitimement lorsqu'ils parviennent à établir à la satisfaction de la majorité du peuple, le caractère odieux de votre politique. Si vos prétentions étaient reconnues comme valables, ils pourraient refuser d'acquitter l'impôt et se former en société particulière. Ils sont rares ceux qui par suite des animosités ou des rancunes créées par les luttes du passé consentiront à pré-\nférer les homicides aux libéraux. Voici à ce sujet l'opinion de trois journaux conservateurs. La Vérité du 19 décembre dit:\n\nIl nous semble que le moment est bien mal choisi pour abimer les grits. Nous ne pouvons plus, sans perdre le respect de nous-mêmes, marcher avec les tories, et plusieurs de nos journalistes s'appliquent à rendre impossible toute entente avec les grits. Et ces mêmes journalistes prétendent avoir le monopole de la prudence, de la modération, de la sagesse et du sens politique!\n\nIls déplorent toute agitation de crainte que la province de Québec ne se trouve isolée, et ils font l'impossible pour empêcher une entente honorable entre la province de Québec et les grits.\n\nLe Journal des Trois-Rivières dit à son tour:\n\nNous sommes par le temps qui court témoins de contradictions véritablement phénoménales.\n\nNous ne voulons pas, pour le moment, parler du changement de front, si disgracieux pour l'honneur de la presse, opéré par plusieurs de nos confrères sur la question Riel, au moyen de caracoles plus ou moins souples; il s'agit d'un autre détail.\n\nCertains organes du cabinet fédéral, consacrent des colonnes entières depuis quelques jours à démontrer que M. Blake a commis un crime politique impardonnable en offrant $5,000 pour l'arrestation de Riel, y a quelques années et alors que les libéraux étaient au pouvoir.\n\nTout cela serait fort bien, mais ce qu'il y a de renversant, c'est que ce colossal travail d'argumentation est fait dans le but de justifier sir John et le cabinet actuel d'avoir sanctionné l'exécution du chef des Métis.\n\nOn ne paraît pas même se douter que s'il n'était pas permis à M. Blake de donner des primes pour l'arrestation de Riel, il l'était encore moins pour sir John et ses collègues de le pendre.\n\nOublie-t-on que plus on incrimine les premiers, plus on coule les seconds qui ont fait pire?\n\nIl est profondément humiliant pour des écrivains, d'ordinaire sérieux, d'être forcés par la position oblique qu'ils n'ont pas eu le courage de repousser, de se discréditer devant leurs lecteurs par d'aussi disgracieuses contradictions.\n\nComme il serait bien simple, plus honnête, plus honorable d'adresser franchement à chacun le blâme que lui mérite sa responsabilité; d'admettre sans détour que si M. Blake est condamnable pour avoir offert une prime pour l'arrestation injuste d'un citoyen, sir John et ses collègues le sont bien davantage pour l'avoir fait appréhender et conduire à la potence.\n\nCela éviterait pour soi-même les angoisses que ne peut écarter un esprit intelligent et honnête quand il entre dans la ligne courbe évidente; et pour le public, le spectacle-pénible d'un naufrage où l'honneur sombre avec la liberté et l'indépendance qu'il a droit d'attendre de ceux qui sont chargés de le renseigner et de l'éclairer.\n\nJ'ai fait voir en quoi consistait la fameuse affaire des $5,000. Enfin voici comment la Presse accueille ces deux opinions:\n\nLa Vérité et le Journal des Trois-Rivières s'expliquent avec autant de bon sens que de fermeté sur la déplorable campagne que les journaux ministériels ont entreprise contre les grits, et contre l'alliance des Canadiens-Français avec l'élément-grit d'Ontario.\n\nLe Journal des Trois-Rivières demande qu'on renonce à la mauvaise plaisanterie qui consiste à reprocher à M. Blake d'avoir offert $5,000 pour prendre Riel, et dit que c'est pitié de penser que des gens sérieux puissent\nchercher dans leurs attaques contre M. Blake, un moyen de prouver que les libéraux, ayant eu tort de vouloir emprisonner Riel, sir John A. Macdonald a eu raison pour cela de le faire pendre.\n\nPuis, ces libéraux dont vous craignez tant l'avènement, vos organes, qui les ont si souvent insultés, ne reculent pas devant l'humiliante nécessité de solliciter leur alliance dans le Haut-Canada pour repousser les justes prétentions de la province de Québec. Mais les libéraux du Haut Canada ont horreur de cette proposition de promiscuité. Avant de conclure je vais reproduire ces passages importants du manifeste de Mgr Taché :\n\nDes esprits, hélas ! trop superficiels ou trop insensés pour se livrer à un examen sérieux et impartial de nos difficultés, croient avoir satisfait à leur devoir de citoyens en s'écriant : \"c'est Riel qui est la cause de tout le mal, c'est lui qui a tout fait ; il a payé de sa tête, maintenant le pays est en sûreté.\" Cette explication est tellement déraisonnable que si elle était acceptée, nous pourrions nous attendre à de nouveaux troubles, dans un avenir prochain. Le récif sur lequel va se briser une embarcation n'est pas la seule cause de naufrage. Le mode de construction, la violence de la tempête, l'insuffisance ou la faiblesses de l'équipage, l'ignorance ou l'incurie des pilotes ; en un mot l'ensemble des circonstances dans lesquelles s'accomplit la navigation n'est pas étranger au désastre qui se produit sur un écueil.\n\nOn a confié des emplois même importants à des officiers qu'on n'avait aucune des qualités essentielles à l'accomplissement de leurs devoirs. Dans mon humble opinion, il en sera toujours ainsi tant que toutes les nominations se feront exclusivement au point de vue des partis politiques. Tout en nommant des hommes indignes, on a écarté ou laissé dans l'oubli d'autres éminemment aptes, et cela uniquement parce qu'il y a cinq, dix ou quinze ans, ils étaient des adversaires politiques.\n\nÀ cela je vais ajouter ce qu'a dit tout récemment M. Jackson, un des membres conservateurs du Conseil du Nord-ouest. M. Jackson est un tory qui, avant le discours dont je vais citer quelques lignes, ne s'était jamais montré enclin à dire un seul mot contre le gouvernement.\n\nLe Conseil, dit monsieur Jackson, a soumis à maintes reprises au gouvernement la nature sérieuse des reclamations non réglées des métis, mais on a prêté attention à aucune des requêtes. Toute l'attention portée à aucune des représentations de ce Conseil consiste en un télégramme de sir John Macdonald disant qu'aussitôt après le retour d'Europe du ministre de l'intérieur le gouvernement accorderait sa sérieuse considération aux affaires des Métis ! Ce n'est que lorsque le pays a été menacé de la guerre civile qu'une question de cette importance pour les territoires et pour le Canada a paru digne \"d'une sérieuse considération.\"\n\nIl faut que l'état des choses soit devenu bien intolérable pour que les évêques et les prêtres, les tories et les conservateurs qui sont en position d'en connaître et d'en apprécier le caractère, le dénoncent avec autant de vigueur. Même sans la pendaison de Riel, une pareille situation devrait, aux yeux des conservateurs, provoquer la déchéance du cabinet. Vous êtes, monsieur le ministre, constitutionnellement et criminellement responsable de cet état des affaires. Vous nous avez prêché la prudence dans l'é-\ncritique j'ai soumis à mon humble, mais sincère critique. Je vois, par la conduite que vous avez tenue lors de l'assemblée de St-Jérôme et par le voyage inattendu de sir John A. Macdonald en Angleterre, que, sur ce point, les membres du gouvernement savent jadis l'exemple au précepte. Je n'insisterai pas sur le fait qu'il y a un degré de la prudence qui devient de la pusillanimité. Je me borne à vous dire, en terminant, qu'un gouvernement qui fait évader ou qui fait pendre un homme par calcul électoral, se montrant par ce fait capable de tout, n'offre aucune garantie de sécurité à la nation, et que la suprême prudence pour celle-ci consiste à s'en débarrasser au plus tôt.\n\nVous avez sans doute trouvé dans le cours de cette Réponse des expressions dures portées à votre adresse. J'ai à faire, ici, avant de signer ces lignes, une distinction explicative que vos propres amis n'ont pas su faire et que je n'aurais pu placer dans le corps de mon travail sans paraître me livrer à des subtilités indignes de vous et de moi. J'établis une différence absolument tranchée entre monsieur Chapleau, particulier, et l'honorable monsieur Chapleau, ministre. C'est ce dernier que j'ai voulu attaquer, non pas l'adre sur les qualités individuelles de qui je suis suffisamment édifié pour n'avoir autre chose que des éloges à lui décerner. Vous êtes en ce moment l'incarnation d'une politique que je condamne et qui s'est clairement inspirée des théories de Machiavel, que je méprise, des tendances à l'absorption de Richelieu, que j'exécute, et du sanguinaire despotisme de Napoléon, que j'abhorre. J'admire la haute capacité de génie de ces grands hommes, mais il m'est impossible de les considérer autrement que comme des fléaux de l'humanité. Je ne vous infligerais pas l'outrageante ironie de vous comparer à ces géants de l'idée tyrannique; je constate seulement que vous vous êtes passionné pour leurs tendances et que ce sont les principes sortis de cette admiration funeste qui sont la cause de toutes les fautes criminelles que je vous ai reprochées et même de tous les défauts particuliers que j'ai eu la teméraire loyauté de signaler chez vous. Avec d'autres principes—les bons—and les puissants moyens d'ascendance qui vous ont été déparis, vous seriez—en faisant les sacrifices quelquefois durs de l'apôtre réellement épris de ses convictions—devenu grandement admirable; vous avez préféré être facilement admiré. Tout cela tient plus à votre éducation politique qu'à vos dispositions naturelles. Et c'est une grande infortune pour vous en même temps qu'un grand malheur pour votre pays.\n\nAgréez, monsieur le ministre,\n\nl'expression de mon entière réprobation de votre œuvre administrative et l'assurance de ma parfaite considération pour votre caractère privé.\n\nERNEST TREMBLAY.\n\nSt-Hyacinthe, décembre 1885.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001555.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 83, "total-input-tokens": 116620, "total-output-tokens": 62228, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 116, 3], [116, 116, 4], [116, 1947, 5], [1947, 4564, 6], [4564, 7253, 7], [7253, 9934, 8], [9934, 12444, 9], [12444, 15133, 10], [15133, 17821, 11], [17821, 20822, 12], [20822, 23905, 13], [23905, 26410, 14], [26410, 28882, 15], [28882, 31367, 16], [31367, 33817, 17], [33817, 36390, 18], [36390, 38997, 19], [38997, 41639, 20], [41639, 44186, 21], [44186, 46766, 22], [46766, 49851, 23], [49851, 52513, 24], [52513, 55287, 25], [55287, 58017, 26], [58017, 60903, 27], [60903, 63594, 28], [63594, 66319, 29], [66319, 69136, 30], [69136, 71835, 31], [71835, 74491, 32], [74491, 76843, 33], [76843, 79405, 34], [79405, 82211, 35], [82211, 85039, 36], [85039, 87973, 37], [87973, 90704, 38], [90704, 93206, 39], [93206, 95703, 40], [95703, 98336, 41], [98336, 101012, 42], [101012, 103867, 43], [103867, 106556, 44], [106556, 109034, 45], [109034, 111604, 46], [111604, 114471, 47], [114471, 117078, 48], [117078, 119763, 49], [119763, 122354, 50], [122354, 125022, 51], [125022, 127714, 52], [127714, 130349, 53], [130349, 132863, 54], [132863, 135469, 55], [135469, 138349, 56], [138349, 140921, 57], [140921, 143668, 58], [143668, 146257, 59], [146257, 148932, 60], [148932, 151747, 61], [151747, 154460, 62], [154460, 157288, 63], [157288, 160009, 64], [160009, 162527, 65], [162527, 165252, 66], [165252, 168469, 67], [168469, 172060, 68], [172060, 175282, 69], [175282, 177948, 70], [177948, 180718, 71], [180718, 183191, 72], [183191, 185899, 73], [185899, 188981, 74], [188981, 192191, 75], [192191, 195481, 76], [195481, 199466, 77], [199466, 203087, 78], [203087, 206507, 79], [206507, 209905, 80], [209905, 213280, 81], [213280, 216100, 82], [216100, 216100, 83]], "primary_language": ["None", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]