[{"id": "03a7053643503e9897ef3584d790f223dad4d086", "text": "NORTH-WEST CANADA.\n\nIn that part of North-Western Canada, which is comprised in the Dioceses of Rupert's Land, Saskatchewan, and Algoma, an enormous tract of fertile country has been recently opened to British enterprise. Attracted by a belt of virgin soil extending for 1,000 miles from east to west, immigrants are pouring into these regions in numbers without parallel in the history of any of the Colonies of the British Empire.\n\nAt present the great majority of these immigrants are settling in the Diocese of Rupert's Land, but the Canadian Pacific Railway is planting large settlements in the valley of the Saskatchewan, while the Diocese of Algoma has from its foundation waged a daily struggle, not so much to keep pace with present necessities as to overtake the neglect of past years.\n\nThe Society for the Propagation of the Gospel in Foreign Parts has assisted these Dioceses to the utmost of its ability, but their needs are exceptional, and the several Bishops are quite unable to provide for the spiritual welfare of the crowds of immigrants who are settling in their Dioceses.\n\nThe Standing Committee therefore look to Churchmen at home for a liberal and prompt response to this SPECIAL APPEAL.\nnow made for North-West Canada. All monies entrusted to their administration will be spent in providing the Ministry of God's Word and Sacraments for the comfort of our fellow subjects in the three above-mentioned Dioceses, according to their respective necessities.\n\nThe documents appended give full information of the condition of these Dioceses, and an attentive consideration of the facts which they set forth is respectfully invited.\n\nCheques should be made payable to the Treasurers of the S.P.G. or bearer, and be crossed Messrs. Drummond.\n\nH. W. Tucker,\nSecretary.\n\n19, Delahay Street, Westminster, S.W.\nNovember, 1882.\nI.—Letter of his Grace the Archbishop of Canterbury on the present Emigration to America.\n\nMy Rev. Brethren and Brethren of the Laity.—I am anxious to direct attention, from a Christian point of view, to the vast movement of people which has for some years been going on between Europe and the British colonies, and especially between England and America.\n\nOfficial returns show that, during the first nine months of the present year, 313,716 emigrants left the ports of Great Britain, nearly 200,000 of whom were British subjects. The destination of more than 158,000 of these emigrants was North America.\n\nIt has been proposed that a systematic endeavour should be made to establish more direct communication than at present commonly exists between the Church at home and the Church in our colonies and in America, with a view to the Christian welfare of the vast population which is continually passing westward from our shores.\n\nThe proposal is in accordance with the recommendations adopted by the Lambeth Conference in 1878. It has obtained the hearty consent of many of the Bishops and clergy of the Anglican communion in our colonies and in the United States, and I am anxious to commend it to the notice of the parochial clergy of England.\n\nThe scheme, which is still in its infancy, is at present under the management of a Joint Committee appointed by the Society for the Propagation of the Gospel and the Society for Promoting Christian Knowledge. Its objects, in outline, are as follows:\n\n(a) To supply the parochial clergy of England with accurate information respecting the various fields for emigration, including special reference to the religious and educational advantages which they severally possess.\n\n(b) To publish, in a cheap form, a series of simple Handbooks for the use of emigrants to our different colonies and to the United States, containing, together with other intelligence,\ncorrect information as to the clergy, churches, Sunday and day schools, &c., in the various places in which emigrants are now settling.\n\n(c) To make such arrangements as may be found possible for the due care of emigrants from England on their arrival in our colonies and in the United States. This would include the provision of commendatory letters from the parochial clergy in England to the clergy in whose neighbourhood the emigrants propose to settle.\n\nFull information respecting the scheme can be obtained on application to the Rev. J. Bridger, emigrants' chaplain, St. Nicholas' Church, Liverpool, to whom all communications on the subject should be addressed.\n\nIt is, I think, impossible to exaggerate the importance of this subject, and I therefore commend it to the earnest and prayerful attention of my brethren the parochial clergy of England, and the laity of our Church.\n\nI remain, your faithful brother and servant,\n\nA. C. CANTUAR.\n\nLAMBETH PALACE,\nDecember 20, 1881.\n\nII.—Letter from Lieutenant-General Lowry, C.B., to the Editor of the Times, October 24, 1882, on the Church in the Centre and North-West of British America.\n\nSIR,—How the Church can rise to the level of her duties to the emigrants now pouring so rapidly and in such numbers into the centre and north-west of British America, is one of the most important and pressing questions of the day. On our answer to it must very much depend the welfare of a country so grand in its size, so rich in its fertility, that we at home hardly at all realise the fulness of the heritage or the measure of responsibility it entails on us. Yet we are constructing a railway through its central and richest parts at this time, at the almost incredible rate of three miles a day, and our people\nfrom the eastern and settled parts of Canada, from Great Britain, and many from the United States, are pouring into it in one ceaseless stream of immigration. We read in the London papers of last week that the emigration from England to Canada already exceeds in this year by 53 per cent. that for 1881.\n\nThe Bishops of our Church—from Rupert'sland, Saskatchewan, Moosonee, Athabasca, Algoma—tell us that their own people are doing what they can to provide adequate Church ministrations, and that the longer settled dioceses of Canada, especially in the case of Algoma, so contiguous to them, are giving such supplementary aid as it is possible for them to offer. But these chief pastors, and notably the Bishop of Rupert'sland (Metropolitan) and the Bishop of Saskatchewan, in the greatness of the present needs and growth of population in their dioceses, and in the extreme pressure of the crisis now upon them, implore the prompt and large assistance of the mother Church.\n\nThe new settlers in these vast dioceses, for the most part, and at first, require all the means they can bring with them for temporal and pressing wants. They can scarcely afford maintenance, however scanty, for a clergyman; and to run up church, school, and parson's hut, and training college for their young clergy, and to supply Bibles and Prayer-books and works of simple Christian literature, is utterly beyond their present resources.\n\nThe Metropolitan of Central Canada writes that in the part of Manitoba, now being settled, fifty-two municipalities have been formed for local government; that in thirty-eight of these embracing over 700 townships, and covering thirty-six square miles each, there is no resident clergyman of our Church, and that in several other municipalities, with from twelve to forty such townships, there is only one clergyman.\n\nOther denominations of Christians are losing no time in planting religious colleges and schools, and in sending forth their ministry. Will not the National Church of Great Britain do her part as promptly, and by effort not unworthy of her position and of her privileges, seek to confer on that Greater\nBritain of the future, in this crisis of its early and marvellous growth, the blessings of her teaching and ministrations?\n\nBut a few years since, when danger seemed to threaten, Canada offered to send some thousands of her hardy, loyal sons to stand by the mother land. Let it be ours now to aid the development of that vast dominion, and to benefit our own people going forth from us in such numbers, by prompt largess for their highest good.\n\nAnd may it not be wisely left to the Church's most ancient almoners—the Society for the Propagation of the Gospel in Foreign Parts, 19, Delahay Street, and the Christian Knowledge Society, Northumberland Avenue—to apportion, as each sees well, whatever may be sent to either? These venerable Societies know well the needs here urged, and their admirable organisation enables them to apply funds to the best advantage. Only, I would add, let no response, however generous, to this appeal for central and north-western Canada, subtract one farthing from the much-needed and all too scanty support given to the general funds of these beneficent Societies.\n\nI am, Sir, &c.,\n\nR. W. LOWRY,\nLieutenant-General.\n\n25, Warrington Crescent,\nOctober 28, 1882.\n\nIII.—Letter from the Bishop of Rupertsland to His Grace the Archbishop of Canterbury.\n\nBishop's Court, Manitoba, Canada,\nAugust 21, 1880.\n\nMy Lord Archbishop,—Our Provincial Synod, anxious to connect our young branch of the Church as closely as possible with the mother Church of England, recognised the Primacy of the see of Canterbury. I, therefore, venture, through this letter to your Grace, as our Primate, to lay before the Church of England the peculiar circumstances of this Diocese.\n\nI am happy to feel that I am not writing of a land still altogether unknown. Various circumstances have in the past\nyear been bringing to the knowledge of the people in England its fertility and vast extent. It is also known that an emigration is coming to us, already considerable, but, to judge from the experience of the United States, likely to assume in a few years vast proportions. Still, I would place before your Grace a few very weighty facts.\n\n1. The land disposed of by Government from the establishment of a Land Office in 1872 up to October 31, 1877, was ... 1,400,000 acres. In the single year ending October 31, 1878, 700,000 \" 1879 1,000,000 \"\n\nBesides this large amount, mainly taken up in homesteads and pre-emptions, nearly two million of acres have been granted to meet claims by half-breeds and old residents.\n\nThe vast amount of land owned by the Hudson's Bay Company is also now in the market. Emigrants are, by purchase, entering on land from both these sources.\n\n2. In 1870 there were 16 Protestant common school districts established. In 1877 there were 38 established; in 1878, 100.\n\nThe number is continually increasing—showing the formation of new settlements of sufficient population for schools.\n\n3. In 1870 there were 19 post-offices established. \" 1878 58 \" \" 1879 120 \"\n\nA considerable number have been opened since.\n\n4. The city of Winnipeg, which had in 1871 only a population of 300, besides the military temporarily stationed in it, has now a population of 10,000. It stands ninth in the dominion of Canada in the list of ports for the collection of duty—leaving behind such cities as Ottawa and Kingston, and being only doubled by Quebec. This shows the amazing extent of business passing through it.\n\nI need not enlarge on the significance of these facts. It must be remembered, too, in connection with them, how greatly the\nfacilities for coming to this land are being increased. Within two years Winnipeg will have railway to Lake Superior on one side, and 200 miles west on the other. The province of Manitoba and a considerable section of country in this diocese west of the province are being covered with a sparse population. The difficulty of ministering to this population is almost inconceivable to outsiders.\n\nEach settler, if possible, takes 320 acres. Many of the settlers are single men living alone. In too many cases a proportion of the land is, from one cause or another, unoccupied. It is, therefore, very difficult, in the first years of a new settlement, to get together a congregation of any size or power.\n\nThen the population, sparse as it is, is composed of adherents of different denominations, one having a predominance in one district and another in another.\n\nThe practical outcome of the situation I have described is an impossibility of immediate self-support, or of anything approaching it, in any new settlement. The consequence of this is that any Church that cannot obtain at the present time practical help from outside must lose any chance of establishing or extending itself through the rural settlements in the great country that is rising up here. This is becoming more and more our own position. Members of our Church from the various dioceses of Canada and from England are to be found scattered in all directions over the face of the country. In several large districts containing from 400 to 1,000 square miles, mostly taken up by settlers, there is no minister of our Church to afford them the means of grace.\n\nWe need at the present time an additional sum of about £800 ($4,000) yearly to supply Missionaries for six large districts and spheres of work, now unoccupied, and relieve our General Mission Fund, which is severely strained.\n\nThe majority of the emigrants coming at present to this country are doubtless from the older Canadian provinces, yet in several of those districts a large proportion of the members of our Church are from England.\n\nI address this letter to your Grace with much anxiety. I\nwish my words to come home to the hearts of English Churchmen, that they may realize both the great future of this country and the position in which their Church finds itself. From all appearances we must mainly—I almost fear to say entirely—look to England for the next few years that are all important. I have applied earnestly to individual dioceses of the Church in Canada; but beyond a passing grant now and again of two or three hundred dollars, very gratefully received, and very helpful to our small Mission Fund, there has been but one practical answer. The Church in Canada has itself such needs and difficulties that it cannot help us. I trust, however, that the Provincial Synod may see its way to some organization for our aid.\n\nBut at present this is our position, that, while the Church of Canada has not yet been able to give us one Missionary, the Presbyterian and Methodist Churches in Canada are alone between them mainly supporting little short of fifty Missionaries in this diocese. When our members in many districts are left to the ministrations of other bodies, many of them must become estranged and the Church here be crippled for its future work.\n\nI only desire, further, to point out what is so peculiar a feature in our case.\n\nMost colonies have grown so gradually that, by the time they have reached any size, there has been some city and portion of country able to assist. Here there has sprung up within, I may say, two years, an enormous area covered with a sparse population, while every parish and settlement has only temporary buildings. Winnipeg lies in four parishes. Every one of these has only what I may call a temporary church. There is not a single parish that is not burdened with its own cares.\n\nOur farmers and men of business are all beginning life, struggling to find the capital they need, having more than they can manage, as a rule at present, in their own private buildings, common schools, roads, and other necessities.\nBut there is a country rising up here that will repay any effort—any aid.\n\nI write this letter with the conviction that there are many members of the Church of England who, if they only realized our position, could and would give us what would both fit us for the work of today, and cheer up many a future emigrant to our land.\n\nI am, My LORD ARCHBISHOP,\n\nYour Grace's most obedient servant,\n\nR. RUPERT'S LAND,\nMetropolitan.\n\nIV.—Appeals from the Bishop of Rupertsland to the Society for the Propagation of the Gospel in Foreign Parts.\n\nJune 12, 1882.—What is absolutely essential for the life and progress of the Church is the means of opening up Missions in our new and most sparsely occupied settlements. I must ask the Society to put aside wishes, and to look the truth in the face. We are almost entirely dependent on the action of your Society.\n\nSeptember 12, 1882.—The Bishop of Rupertsland asks the earnest consideration of Churchmen to the following statement:\n\nThe Diocese of Rupertsland includes within it the Province of Manitoba, and a large extent of the fertile land of the northwest territories of Canada.\n\nTwo facts respecting this country are now well known, not only in Canada, but in Great Britain—the almost boundless extent of fertile land ready for occupation, and the large emigration coming to it.\n\nIn the past year there has been extraordinary progress. The white population is supposed to have been nearly doubled. Winnipeg, the capital, is now, as regards the payment of taxes on imports, the third city in the Dominion. Its population has\nrisen from 12,000 to 20,000, and its assessed property from nine millions to thirty millions of dollars.\n\nWinnipeg has a railway for sixty miles south connecting with the lines of the United States, and another for 450 miles west over the fertile prairies of the north-west. It has also several branch railways. Almost all the land adjacent to these railways for a considerable breadth will be settled on this season, and very much behind. Winnipeg has also a railway for 450 miles east to Lake Superior.\n\nFifty-two municipalities have been formed for local government in the part of Manitoba now being settled. In thirty-eight of these, embracing over 700 townships, there is no resident clergyman of our Church—each township has thirty-six square miles. Yet there are few of those townships without settlers, and they are, as a whole, being rapidly taken up and sparsely settled on. In several other municipalities, with from twelve to forty townships, there is only one clergyman.\n\nBut the gravity of the position of the Church will be better understood from this further consideration. The Canada Pacific Railway is being carried still further west at the unprecedented rate of three miles a day. This season it will reach the south branch of the great Saskatchewan. The capital of the north-west territories has been removed from Battleford, in the diocese of Saskatchewan, to a new town called Regina, in this diocese. Regina is fixed on as the capital permanently of the new Province of Assiniboia, formed west of Manitoba. This province will be mainly in this diocese. The Canada Pacific Railway will cross its whole width this season, about 200 miles. A stream of emigrants goes with it and before it. Many Colonization Societies are settling townships further back. There is a Church Missionary Society Indian Mission at Touchwood Hills, about 100 miles north-east of Regina. There is not another clergyman of our Church in the whole of this province—not one for the new settlers! There ought to be a Bishop and a staff of clergy.\n\nNor is this all. The great deficiency of the supply of the means of grace by our Church thus described is simply the\nresult of the emigration and progress of settlement of the last two or three years. In even another year the story will be much worse.\n\nWhat means can we look to for meeting the ever-increasing emigration and supplying the ministry of our Church to the countless new settlements?\n\n(a.) England. We have received no new grants for Missions from the Society for the Propagation of the Gospel, or Colonial and Continental Church Society since 1879, except a grant lately from the Society for the Propagation of the Gospel of 100l. yearly for two years. The Society for the Propagation of the Gospel grants to the old Canadian dioceses are being reduced yearly. We had hoped that this diocese would have received a considerable additional grant yearly for some time from this source, but it has not. A lady in England is giving us a Missionary for the emigrants in Winnipeg. This will be very useful. The Society for the Propagation of the Gospel has most generously offered us 3,000l. in sums of 500l. for [clergy] endowment, if we raise three times the amount. Perhaps in the five years allowed we may do something, but at present the necessities of the day prevent us from taking up endowment.\n\n(b.) The Ecclesiastical Province of Canada. Till 1881 we did not receive in any year above a few hundred dollars. In 1881 we received $859. In 1882 we have already received $2,000, of which $1,000 is from the diocese of Quebec. But what we receive is still not given methodically, but in uncertain sums at uncertain times, and we do not know with any certainty what we may expect. The support given by the other denominations to their brethren here is on a totally different scale. Even such a comparatively small body as the Canadian Episcopal Methodists maintain fifteen Missionaries in this diocese. The Presbyterian and Wesleyan Churches must support in part from forty to fifty.\n\n(c.) Ourselves. Winnipeg is the only place in the diocese which can yet give us any help. It is prosperous, and we share in its prosperity; but it is, after all, a very small place in view\n\n1 Also £1,000 towards the endowment of St. John's College.\nof the country being described, and its citizens are mostly new settlers beginning life. It is growing so rapidly that it will have enough to do to supply its own needs. None of its parishes have permanent churches. One of them, Holy Trinity, has been expecting by the sale of its old site—part of an acre in the best business part of Winnipeg—to build a fine church. That piece of luck simply aids that congregation. Still Winnipeg will support two or three Missions outside of it.\n\nSome Missions may be able to release their grants wholly or partially within a year. But, on the other hand, from an arrangement made by the diocese with the Church Missionary Society, unless some of the Church Missionary Society lands become productive, we shall have some of their old Missions drawing more largely on the diocesan funds.\n\nAccording to statements in Canada a good many Churchmen have come to this country having some means, who used to be formerly helpful in their old parishes. We receive for our Mission fund no help from any such outside Winnipeg. The explanation, doubtless, is that they are simply lost sight of in the vast expanse of this country. At the most, with countless expenses upon them in settling on the bare prairie, they can only help in the individual Mission where they reside.\n\nThe population over the whole country is so sparse, owing to the large tracts of land given by the Government, or purchased, that it will be a considerable time before districts can be self-supporting, unless where a town rises up.\n\nThen there are other temporary, but most serious, difficulties in the way of the support of clergymen. The very prosperity of the country is making the expenses of living great. It is usually almost impossible to get a suitable house for a clergyman's family in a new district—even often to get lodgings for himself. The building of a parsonage is accordingly a necessity. We are proposing to raise a large fund to aid in this. Yet though this is always so pressing in a new district, the people will push at the same time for a church or churches.\n\nChurchmen are scattered everywhere over this country in varying proportion with other bodies—but by the census last\nyear the Church of England was numerically slightly the largest body. It is needless to add that unless a large additional yearly sum can be obtained for some years from England and the old ecclesiastical province of Canada, the Church must greatly suffer. English Churchmen and Canadian Churchmen emigrating to this country must be left without the ministrations of their own Church, and will in a great degree pass away from it. It is an old story. It is not unknown in Canada in the past—but here, owing to the great attractions for emigrants and the unprecedented rapidity of the opening up of the country, it is being repeated on an enormously larger scale. If things remain as they are, owing to the deep interest taken by other denominations in the progress of their bodies and the number of Missionaries being sent by them to this country, the Church of England is likely to suffer as it has never suffered before.\n\nV.—Extracts from letters from the Bishop of Saskatchewan to the Society.\n\nSeptember 10, 1881.—The railway is advancing on us, steadily and surely. We shall be simply at our wits' end to find means to bring the ministrations of the Church to bear upon the new communities that will spring up with marvellous rapidity along the fertile valleys of this vast Saskatchewan country.\n\nWhile I am urgent about your doing more, I am not forgetful of the debt of gratitude I owe the Society for the steady and liberal support the Church work of this Diocese has received from it ever since the Diocese came into existence.\n\nMarch 15, 1882.—There is every prospect of a large accession to the population of this Diocese within a few months. It is very evident that the Church here will soon be committed to an effort to extend her ministrations with scarcely any means for the purpose except what the Society for the Propagation of the Gospel can give.\n\nHad missions been established in the district of Saskatchewan before 1870—the date of the transfer of the land from the\nHudson's Bay Co. to the Dominion of Canada—we should have had a valuable endowment in land,—but no effort was made in behalf of the Saskatchewan till I was appointed Bishop in 1874. Only by this mail I received a communication from the Government that I should have to pay the usual price per acre for the land around Emmanuel College, as I was not in possession before 1870. We are thus reaping the natural fruits of the neglect shown towards the Saskatchewan district for so many years by the Church. Even the Presbyterians had established a mission in Prince Albert before 1870. They have thus secured a large and valuable tract of land which will be an endowment for their Church in this district.\n\nNovember 11, 1882.—I beg to lay before you the following facts relative to my Diocese of Saskatchewan.\n\nI.—Its Position and Extent.\n\nIt lies between the Diocese of Rupertslan and the Rocky Mountains. Its southern boundary is the State of Montana, U.S., its northern the Diocese of Athabasca. It forms, therefore, the central portion of the north-west territories of the Dominion of Canada. It is irregular in its outline but may be described as being about seven hundred miles square, or having an area of four hundred and ninety thousand square miles.\n\nII.—Its Importance.\n\nThe great fertile belt of the Saskatchewan runs through it. It contains many millions of acres of most fertile soil admirably fitted for raising grain, while its vast tracts of pasturage land in the region near the Rocky Mountains offer facilities for stock-raising not, I believe, to be equalled in the whole continent of America. The districts of Edmonton and Fort Macleod abound in coal.\n\nIII.—Its Population.\n\nSo great are the attractions of the country that settlements are rapidly forming in advance of the railway. In the district\nof Prince Albert, on the north branch of the Saskatchewan, the population has risen within the last two years from about eight hundred to between four and five thousand. At other leading points along the south branch of the Saskatchewan, at Battleford and Edmonton on the north branch, and especially all through the Edmonton district there has been a rapid increase. These settlers have travelled from three hundred to eight hundred miles without the aid of a railway so as to obtain the advantage of the first choice of land in the new settlements. The Canada Pacific Railway has now passed through the adjoining Diocese of Rupert's Land and reached the borders of my Diocese. In another year it will have opened up a large section of country within the Diocese of Saskatchewan for easy access to the emigrants. Unless the Society for the Propagation of the Gospel is in the meantime provided with means to support travelling Missionaries among our church people until they are sufficiently settled in their new homes to be able to undertake that duty for themselves, they will either drift away into the communion of other religious bodies, or be without any Christian teaching whatever.\n\nImmediate Want.\n\nEven now there is urgent need for several active Missionaries who might travel about among the scattered settlers in districts beyond the reach of our present staff of clergy. One is required in the Carrot River district, another in the neighbourhood of the South Branch, a third in the Battle River district, a fourth in the Edmonton and Victoria district, and a fifth for the settlers at Fort Macleod and the adjoining district stretching to the base of the Rocky Mountains. I believe that our true policy will be not to wait until each scattered settlement becomes sufficiently populous to require the services of a clergyman for itself, but without delay to send out men who shall visit different points in a large range of country periodically, holding services, administering the Sacraments, visiting the people and otherwise endeavouring to keep them loyally in\nconnection with the Church, until they themselves are able to make provision for a settled pastorate.\n\nThe Indians.\n\nThe Diocese of Saskatchewan has over twenty-two thousand Indians, the vast majority being still heathen. The Dominion Government has collected them into reserves of land, and has organized an excellent system of instruction to train them to agriculture and the arts and habits of civilized life. No better opportunity could be wished than this affords to bring the efforts of the Missionary and Schoolmaster to bear upon them. In the South-western section of the Diocese there is urgent need of several additional Missionaries. If the Society for the Propagation of the Gospel could at once place one among the Surcees, two among the Assiniboines, and two among the Blackfeet proper, a great opportunity would be taken advantage of, that will soon pass away, of bringing these poor heathens within the fold of the Church of England.\n\nEmmanuel College.\n\nThe origin of Emmanuel College was in the sense of need I entertained, for a trained band of Interpreters, Schoolmasters, Catechists, and Pastors, who, being themselves natives of the country, would be familiar with the language and modes of thought of the people. The plan was to select some of the most intelligent Indians of the various tribes, Cree, Sioux, Blackfeet, Assiniboines, and train them in the elements of theology, and also in the grammar and composition of their own language, with exercises in translation from English into Indian, in writing both languages from dictation as well as in original composition.\n\nThe buildings were begun in 1879, and by the 1st of November in that year two tutors were in residence, while I myself undertook to discharge the duties of Warden and Divinity Professor.\n\nIn the following year, the main building was opened by Divine Service, and an address at a public meeting in the\nCollege Hall by the Lieutenant-Governor of the North-West territories. Since that time the work of the College has steadily progressed. In addition to its primary object of training Native Helpers, we have a regular course of theology for candidates for Holy Orders, and a Collegiate School for boys and young men. During last winter term we had thirty pupils, of whom twelve were Missionary students, and eighteen pupils of the Collegiate School. Of the Missionary Students four were Cree Indians, all of whom are now engaged in the Mission Field—one of them having been ordained Deacon, and another being accepted as a candidate for Holy Orders when he has had further training at College. One was a Sioux Indian whom I publicly baptized in Church at the close of the College term. He came to the College two years before as a student on the Society for the Propagation of the Gospel list. He was a wild Indian, clothed in the blanket, with his face and limbs painted. Within the two years he became civilized in his manners and dress, and advanced sufficiently in knowledge to be able to act as a teacher among his heathen countrymen.\n\nI have already ordained six students of Emmanuel College, three of whom are Indians and three English or Canadian. Five other students have advanced in their studies sufficiently to qualify them for Lay Teachers, and are now engaged most usefully in that capacity.\n\nThere is urgent need for additional College buildings as well as for an Endowment Fund. 1,500l. would meet our present necessities for building, and 5,000l. for endowment.\n\nThe College, in its three great departments of training Native Missionaries, educating Students of Theology, and giving instruction in the higher branches of secular knowledge to the youth of the country, without distinction of religious creed, has, I trust and believe, a great future before it. It is more than five hundred miles distant from St. John's College, Manitoba, the nearest Church of England College, and with the approach of a vast population in the Saskatchewan district, it becomes a matter of great importance to the educational interests of the country to have it well sustained.\nVI.—Letter from the late Bishop of Algoma to the Society,\nDecember 30, 1880.\n\nAs I journey from place to place, whether on the Muskoka, the Parry Sound, or the Nipissing districts, along the shores of the Huron Waters, on the Great Manitoulin and St. Joseph's Islands, or on the Thunder Bay District, on the north shore of Lake Superior, I am painfully impressed with the spiritual destitution that prevails.\n\nAs year by year I make my annual visitation tours, and not infrequently, on visiting new settlements, for the first time hold service and administer the Holy Sacraments of the Church to those who have for years been deprived of the privilege, I find that there are others further back and beyond them who are hungering for the services of the Church into which they have been baptized, and to which they are so much attached.\n\nLet me give an instance:—At the close of a service in a village far back in the Muskoka District last winter, I was accosted by a man who told me that he had walked fifteen miles to attend the service, and also, as a deputation from the settlement of which he was a member, to ask if a Missionary could be sent to visit them from time to time.\n\nYou may imagine my feelings, as I was obliged to tell him that for lack of funds it was quite impossible. This same man walked thirteen miles on the following Wednesday, to meet me at another place, in quite a different direction, again to ask whether something could not be done to supply their spiritual wants. Let me mention another fact: on reaching a settlement last winter, which I had never visited before, I found no less than sixty (60) persons assembled, many of whom had travelled eight and nine miles on foot—men, women, and children—to meet me. The lower part of the log house, being partitioned off, was altogether too small to accommodate the congregation, so we adjourned, by means of a ladder and through a trap-door in the ceiling, to the loft above; and there, after extemporizing a reading-desk and communion-table, I baptized five infants,\nconfirmed six adults, preached, and administered the Holy Eucharist to no less than thirty (30) persons, several of whom told me afterwards that it was the first opportunity that they had had since they came into the bush, five, six, and in the case of one family, comprising five communicants, eight years ago. Here, as I could hold out no hope of sending them a Missionary, I appointed a lay reader and Sunday-school superintendent, chosen by and from amongst themselves, in a measure to fill up the void; and I hope, during the winter, to visit them, and once again afford them the privileges of which they have, for nearly twelve months, been deprived. This case is exceptional only in so far as numbers are concerned, being, in other respects, of too frequent occurrence. I am safe in saying that there are hundreds, ay, thousands, of our members scattered throughout this vast diocese, to whom the sound of the church-going bell is a thing of the past; thousands who are living and dying without any opportunity of participating in the means of grace. Is it to be wondered, if with these facts staring me in the face continually, I am importunate in asking for the means to send additional labourers into the field which is already white for harvest?\n\nThe Rev. W. Crompton, S.P.G. Missionary in Algoma, whose district extends over 2,000 square miles, wrote thus to the Society in 1880:\n\nOn Christmas Day I had a celebration of the Holy Eucharist in St. John's Church, Stisted, at 6 o'clock, A.M.; and I would that the thousands of England who are indifferent upon the subject of our Missions, could have seen my sixteen communicants plodding through the deep Canadian snow, with the thermometer at 30° below zero, their lanterns looking like will-o'-the-wisps in the dark bush! But had they been privileged to enter with these sixteen into their log church in these far-away back-woods, and seen the deep reverence, heard the cheerful Christmas hymns and the joyful \"Gloria in Excelsis,\" they would have realized then as to whether the services of our Church are appreciated here. The same morning I drove\nabout nine miles to Hoodstown, to give them a Christmas service. The Church here was not near completion; we had to sweep the snow off the seats, and I knelt on ice at the prayer-desk. The members of the Church here come from Lancashire, Yorkshire, and Staffordshire. When ready to commence, I stood on the altar-step and gave out the hymn, \"Christians, Awake,\" &c., sounded the first note with my voice, and—ah, who then thought of snow, or ice, or cold! Parson and people—people and parson—were once more at home, with the sound of Christmastide in our hearts. Spite of 30° below zero, we clasped hands at the conclusion, saying, \"Have we not had a beautiful service?\" It was indeed a joyful time for the eighteen who knelt at the Altar of the Lord. One old lady who was present with six of her up-grown children, could not help shedding tears, because, as she said, \"it does seem home now we have Church in full.\" But why go on. I could supply numberless cases, if time would allow, and your space could be granted. One man, when speaking about his church, said, \"Mr. Crompton, if I were but once more beside my old church at home, I do think I should beg pardon of the very stones for not going oftenér than I did when I had the chance; so you may guess, sir, what I feel now we are to have service, even if it is only once a month.\" I was riding up the township of Ryerson, when a man and woman came out of a house and said, \"Are you a minister, sir?\" \"Yes.\" \"But we mean, sir, are you a Church clergyman?\" \"Yes.\" They both grasped a hand each, and speaking together, said, \"Sir, we are glad to see you, glad to see you. But do you have service anywhere about here?\" \"Yes, at Midlothian, where I open a new church tomorrow\" (July 11th). Nothing would satisfy them but that I and my horse must have refreshment then and there. I left them with a heart stirred to its deepest depths, for they were verily children in their delight. At Nipissing the word \"dead, dead, dead,\" is the only word I can think of as appropriate. One poor woman brought her prayer-book to service; she turned this way and that, and at last burst into tears—she had forgotten how to use it, because it was fourteen\nyears since she had had a chance of attending the service of her Church! So soon as I could—that was April 12th—I went again to Magnetewan village, and held two services in the Orango Hall. The place was simply crammed, at night inconveniently so, and no man could have a more attentive congregation. I asked those who would like to see the Church service regularly in the village to meet me in my room at the hotel next morning, at 9 A.M. At that hour over thirty men attended, some having walked six, seven, and nine miles to be present. They spoke warmly and plainly, and appeared deeply roused. I told them I would do my best to get them some money towards a church building, if they would meet my efforts by their labour. In half an hour I had over 60l. worth of labour promised me. One poor man, only an English labourer, offered to do the whole of the work of building a stone foundation to the church, if the materials were placed on the ground; the value of this was at least 15l. The materials were soon promised; and the promises fulfilled. I have been there, and found the men working as busy as bees in the evening, when their farm work was done, some of the men walking five miles to give their labour. Though it will be far from finished, we hope to have the church so near completion as to hold service the first Sunday in January, 1881, and to have a confirmation therein at our next visitation. A congregation of over fifty is now regularly in attendance, thoroughly in earnest, and appearing to value the privileges once more placed within their reach.\n\nI have opened a station at Mr. Laxton's, in the north-east corner of Ryerson. After service there on Sunday, August 15th, Mr. Laxton said to me, \"Mr. Crompton, I was at the store in Katrine the other day, and I gave notice of your coming. There were a good many Methodists, and they made great fun of me, because they said 'the Church of England did not care whether her people were saved or not, or she would send more parsons.' But there was one man came up to me, sir, and asked, 'Is it true that a parson is coming to your shanty?' I said 'Yes.' He said, 'Do you think he would come our way? there\nare lots of us, and some children to christen.' 'Oh,' I said, sir, 'he'll come if there's any children to baptize. Where do you live?' He told me, and I said you would go to-morrow; it is only ten miles from Katrine, sir.\" Of course I thanked friend Laxton, and to save time went that night from his house, and slept at Katrine.\n\nNext morning, August 16th; I mounted my horse at 6.30 A.M., and set off to Ely, in the township of Armon. . . . A lovely country as heart could wish, with Pickerel Lake simmering in the sunlight, and the noble Magnottewan River, like a silver cord sparkling with jewels, winding through the bush. A country with clearings on every hand—clearings to the right, to the left, and before me, like beautiful green oases in the dark bushy desert—clearings telling me of hundreds and hundreds and hundreds of human beings, called Christians, living, breathing, and dying there without having one opportunity of using the means of Grace! I was told I was the only man, as a minister, who had as yet penetrated that part. People by the hundred! Sheep wandered from the fold, learning not only to neglect, but to despise the God who is showering down upon them His innumerable blessings; lambs of Christ's flock, bleating on the hills for that food which His brethren are too indifferent to give them. I sat down on a stone and wept, wept bitterly. I wept because I felt how utterly unable I was to meet and cope with the work now hero spread before me. I wept to think of the carelessness, nay, of the utter indifference to the welfare of their brethren in Christ, by those who call themselves the brethren of Christ. Now, alas! I went on in sorrow, and the delightful land had become to me a sore burden and a cause of distress.\n\nI reached Ely, held a service at which I baptized three children, but could not promise to go again, though pressed very hard to do so; rode eighteen miles through bush road, crossing swamps, &c. At this time I went a journey of over 300 miles, partly on horseback, partly in buckboard, taking more than three weeks for the work, during which time I held twelve services, baptized sixteen children and one adult, held\nfour Church meetings, talked with scores of settlers, and never slept twice in the same bed.\n\nWould that these my words could ring through England! Surely men would be roused to say, \"We will see that this shall be altered; money shall be given, and men sent to the work of the Lord.\" That clergymen are wanted, not only to hold service for those who are crying out for them, but also to instruct the ignorant, will be seen by the one instance I mean to give, although I could give many. A man and his wife had offered themselves for confirmation, and have been under instruction some time. They have both been members of a Methodist class, and leaders thereof; both have regularly attended what they call their Sacrament. Judge, then, my surprise and feelings at our first interview, when asked the question, \"Is it necessary for Mrs. —— to be baptized?\"\n\n\"Why,\" I asked, \"has she not been baptized?\" \"Oh no, sir, we were told it was not absolute necessary; she was as good a Christian without as with baptism!\" I had to begin with the very A B C of the Christian faith. The country is overrun with such teaching, and surely to my brethren in the Church comment is unnecessary. Add to this that it is not at all uncommon for me to meet with people who have not attended a place of worship of any kind for five, nine, twelve and sixteen years, then say what must be the outcome thereof? God forgotten, His word neglected, His worship despised, and Himself defied. Rom. I will tell the rest to the thoughtful mind.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 36624, "total-output-tokens": 10709, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1211, 2], [1211, 1839, 3], [1839, 3746, 4], [3746, 5506, 5], [5506, 7645, 6], [7645, 9449, 7], [9449, 11199, 8], [11199, 13325, 9], [13325, 15298, 10], [15298, 16866, 11], [16866, 19025, 12], [19025, 21153, 13], [21153, 23353, 14], [23353, 25340, 15], [25340, 27156, 16], [27156, 29234, 17], [29234, 31132, 18], [31132, 33308, 19], [33308, 35351, 20], [35351, 37463, 21], [37463, 39655, 22], [39655, 41830, 23], [41830, 44000, 24], [44000, 45513, 25]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]