[{"id": "2efcca4705ffa414c15e688f897ce4e2b6013754", "text": "DEPARTMENT\nOF\nMILITIA AND DEFENCE\nOF THE\nDOMINION OF CANADA.\n\nREPORT\nOF\nLIEUTENANT-COLONEL W. H. JACKSON,\nDeputy Adjutant-General,\nPrincipal Supply, Pay and Transport Officer to the North-West Forces,\nand Chairman of War Claims Commission,\nON MATTERS IN CONNECTION WITH THE SUPPRESSION OF THE\nREBELLION IN THE NORTH-WEST TERRITORIES, IN 1885.\n\nPRESENTED TO PARLIAMENT.\n\nOTTAWA:\nPRINTED BY MACLEAN, ROGER & CO., WELLINGTON STREET,\n1887.\nTo His Excellency the Most Honourable Sir Henry Charles Keith Petty-Fitzmaurice, Marquis of Lansdowne, in the County of Somerset, Earl of Wycombe, of Chipping Wycombe, in the County of Bucks, Viscount Calne and Calnstone, in the County of Wilts, and Lord Wycombe, Baron of Chipping Wycombe, in the County of Bucks, in the Peerage of Great Britain; Earl of Kerry and Earl of Shelburne, Viscount Clanmaurice and Fitzmaurice, Baron of Kerry, Lixnaw and Dunkerron, in the Peerage of Ireland; Knight Grand Cross of the Most Distinguished Order of Saint Michael and Saint George; Governor General of Canada, and Vice Admiral of the same, &c.\n\nMy Lord,—\nI have the honour to forward to Your Excellency the accompanying Report from Lieutenant-Colonel W. H. Jackson, upon matters connected with the Staff duties entrusted to him during the suppression of the insurrectionary movement in the North-West Territories, which is respectfully submitted.\n\nI have the honour to be, my Lord,\n\nYour Excellency's most obedient servant,\n\nADOLPHE P. CARON,\nMinister of Militia and Defence.\n\nDepartment of Militia and Defence,\nOttawa, 1st January, 1887.\nREPORT OF LIEUT.-COLONEL W. H. JACKSON, DEPUTY ADJUTANT-GENERAL,\nPRINCIPAL SUPPLY, PAY AND TRANSPORT OFFICER OF THE NORTH-WEST FORCES,\nAND CHAIRMAN OF WAR CLAIMS COMMISSION.\n\nOTTAWA, 24th December, 1886.\n\nTo the Honorable\nSir Adolphe P. Garon, K.C.M.G.,\nMinister of Militia and Defence,\nOttawa.\n\nSir,—In forwarding the various reports on War Claims, which have been\nacted upon, since former report under date of 25th February, 1886, it appears a\nfitting time to report in detail, so far as practicable (in what must necessarily be\ntold in as few words as possible) concerning matters which came under my observa-\ntion, and also my duties as head of the Commissariat Branch of the Militia in the\nNorth-West, (to which you were pleased to appoint me), during the operations in\nsuppression of the Rebellion in 1885. I, therefore, have the honor to submit the\nfollowing, as a record of events as near as possible in the order in which they trans-\npired. In presenting this report in diary form, and in order that it may be more\neasily understood, where subjects can be at once closed by continuing, they have been\nrun into subsequent dates, which are then given.\n\nSunday, 29th March, 1885.—On the evening of this day I received the following\ntelegram:\n\nOTTAWA, 29th March, 1885.\n\nProceed at once to Winnipeg in order that you may be available for the duty\nrequired there; your instructions will be forwarded to Winnipeg from here.\nAnswer?\n\nW. POWELL,\nAdjutant-General.\n\nThere being no through train until the following afternoon, I left London,\nOntario, my headquarters, on the afternoon of\n\nMonday, 30th March, proceeding through the United States, reaching Winnipeg\non the morning of,\n\nThursday, 2nd April, immediately reporting my arrival to Col. Powell, Adjutant-\nGeneral, Ottawa. The city appeared filled with excited people, but none in uniform\nwere to be seen. I then learned, the Major-General Commanding had a few days pre-\nviously, proceeded west with the Winnipeg Field Battery, and 90th Battalion. The\nWinnipeg Light Infantry, Lieut.-Colonel Osborne Smith, C.M.G., and the Winnipeg\nInfantry (then called the 91st Battalion), Lieut.-Colonel Thos. Scott, M.P., were being organized, and everything military appeared to be in a state of chaos. This proved an exceedingly busy day, having no officer, or other person to assist, and being in uniform, I found myself inundated with telegrams, contractors, and people from many parts of the country, who came to Winnipeg to urge the organization of various local bodies, for home protection, or active service, as might be required.\n\nCaptain John Stewart, of Ottawa, whom I met at St. Paul, and proceeded with on same train to Winnipeg, showed me your instructions authorizing him to organize the Rocky Mountain Rangers. During his stay in the city arrangements were made for supply of such Arms, Ammunition, Saddlery, &c., as he required, much of which had to be brought from a distance. I waited upon the Commissioner of the Hudson's Bay Co., Mr. Wrigley (as directed by telegram), who I found fully alive to the necessity of prompt action in all matters tending to facilitate operations. He kindly offered me the use of two or three rooms in the company's offices, which I availed myself of for a few days, until a more central and suitable building could be secured, where offices might be established. I also received a telegram from the Adjutant-General, giving number of troops en route, and from Lieut. Col. Montizambert asking to have horses purchased for \"A\" and \"B\" Batteries.\n\nFriday, 3rd April.—The Adjutant-General informed me of the appointment of Captain John Allen as Advising Officer. He reported for duty on the 6th. Captain Allen's long residence in the country, and general knowledge of military matters, enabled him to render valuable services. Owing to the want of assistance he was detailed for various duties, which he at all times performed promptly and satisfactorily. I found seven men of the Winnipeg Cavalry at Fort Osborne doing guard and fatigue duty, and assisting Lieut. Col. Peebles with the stores. The organization of Corps, proceeding with the same bustle of previous day. Reported myself by telegraph to the General Officer Commanding at Qu'Appelle, informing him of the position I was sent up to fill. Went with Captain John Stewart to Hudson's Bay Co., regarding equipment of Rocky Mountain Rangers. I was instructed by the Deputy Minister, Col. Panet, to pay for horses purchased for the Intelligence Corps on the certificate of His Honor Lieut.-Governor Dewdney, which was done from time to time, as certificates were presented. Major-General (now Major-Gen, Sir Fred.) Middleton, K.C.M.G., C.B., directed me to issue stores to Lieut. Col. Osborne Smith's Battalion.\n\nSaturday, 4th.—Instructed by the Adjutant-General, Col. Powell, to purchase eight horses for \"B\" Battery. Arranged with dealers to parade horses at Fort Osborne on following morning. Inspector Norman, of the North-West Mounted Police, assisted me in making these arrangements. This officer also continued to render valuable assistance in various ways during the whole period of service. Captain\nA. W. Morton, late of the Princess of Wales' Own Rifles, Kingston (now residing at Turtle Mountain), offered his services, which I was very glad to avail myself of, and took him on as Orderly Officer. This action was subsequently sanctioned by you. He also acted as Secretary, and discharged other duties, as circumstances required, in an efficient and satisfactory manner, continuing in the service until the 31st July.\n\nFifty Snider rifles and a large quantity of ammunition forwarded to Major-General Strange, and fifty saddles ordered from Chicago, for use of his command. As the Major-General Commanding ordered the issue of arms and ammunition for the protection of settlers at various points, for convenience of reference the following table of issues is attached:—\n## NORTH-WEST FORCES, 1885.\n\n### MILITIA ON ACTIVE SERVICE.\n\n**TABULAR STATEMENT**, shewing Arms and Ammunition issued to Corps of the North-West Forces, Settlers, and others, on requisition of Lieut.-Colonel W. H. Jackson, D.A.G., Principal Supply, Pay and Transport Officer, by authority of the Major-General Commanding, and Adjutant-General.\n\n| Issued to                          | Commanding or other Officer | Snider Rifles | Winchester Carbines | Winchester Rifles | Revolvers | Snider | Winchester | Martini-Henry | Revolvers | Gatling Gun | Date of Issue |\n|-----------------------------------|----------------------------|---------------|---------------------|-------------------|-----------|--------|------------|-------------|-----------|--------------|---------------|\n| D. L. S. Intelligence Corps       | Capt. Dennis               | 50            |                     |                   |           |        | 3,000      |             |           |              | April 9       |\n| Moose Mountain Scouts            | Capt. White                | 52            | 62                  |                   |           |        | 3,000      | 8,000       |           |              | do 14         |\n| Gov.-Generals Body Guard         | Lieut.-Col. Denison        | 72            | 72                  |                   |           |        | 28,000     | 2,000       |          |              | do 15         |\n| Gatling Guns                      |                            |               |                     |                   |           |        |            |            |          |              | do 9 & subsequently |\n| Rocky Mountain Rangers            | Capt. Stewart              | 42            | 50                  |                   |           |        | 6,000      |             | 550       |              | April 24      |\n| York and Simcoe Battalion        | Lieut.-Col. O'Brien        | 21            |                     |                   |           |        |            |             |          |              | May 15, 30    |\n| 91st Battalion, Winnipeg Rifles   | Lieut.-Col. Scott          | 155           |                     |                   |           |        | 80,160     |             |          |              | April 6-14    |\n| Toronto Brigade                   | Lieut.-Col. Otter          |               |                     |                   |           |        | 50,000     |             |          |              | do 7-9        |\n| Ottawa Company Sharpshooters     | Capt. Todd                 | 2             |                     |                   |           |        |            |             |          |              | do 8          |\n| 10th Battalion R. G.             | Lieut.-Col. Grasett        | 1             |                     |                   |           |        |            |             |          |              | do 8          |\n| Alberta Field Force              | Major-General Strange     | 200           |                     |                   |           |        | 100,000    | 56,000     | 7,000     |              | do 9 to 23    |\n| Winnipeg Light Infantry          | Lieut.-Col. Smith          |               |                     |                   |           |        | 46,520     |             |          |              | do 11         |\n| Winnipeg Troop Cavalry            | Capt. Knight               | 25            |                     |                   |           |        | 8,000      |             | 600       |              | do 23, 25     |\n| 7th Battalion                    | Lieut.-Col. DeR. Williams  | 48            |                     |                   |           |        |            |             |          |              | do 18         |\n| Halifax Battalion                | Lieut.-Col. Bremer         | 6             |                     |                   |           |        |            |             |          |              | do 27         |\n| Montreal B. G. Artillery          | Lieut.-Col. Oswald        |               |                     |                   |           |        | *31,850    |             |          |              | May 22, 30; June 23 |\n| Cavalry School Corps              | Lieut.-Col. Turnbull       |               |                     |                   |           |        |            |             |          |              | April 23      |\n| Grenfell Militia                 | Capt. Lake                 | 45            |                     |                   |           |        | 300        |             |          |              | do 25         |\n| Virden do                         | Capt. Woodworth            | 100           |                     |                   |           |        | 5,000      |             |          |              | do 5          |\n| Mcosie's Jaw Militia              | The Mayor                 | 75            |                     |                   |           |        | 3,500      |             |          |              | do 5          |\n| Broadview do                     | Capt. C. H. Lane           | 60            |                     |                   |           |        | 6,000      |             |          |              | do 5          |\n| Summerbury do                     | Capt. Phipps               | 45            |                     |                   |           |        | 3,000      |             |          |              | do 5          |\n| Location                  | Officer/Unit                      | Quantity | Total |\n|---------------------------|-----------------------------------|----------|-------|\n| Yorkton                   | Major Watson                      | 100      |       |\n| Minnedosa                 | Mr. Brisebois                     | 50       |       |\n| Regina                    | Capt. Scott                       |          |       |\n| Saskatoon                 | Dr. Willoughby                    | 25       |       |\n| Touchwood                 | J. Hollis                         | 50       |       |\n| Turtle Mountain Home Guard| J. P. Alexander                   | 200      |       |\n| Shoal Lake                | Wilson, McKay & Templeton         | 45       |       |\n| File Hills                | G. Richardson                     | 50       |       |\n| Moosomin                  | G. McHugh                         | 100      |       |\n| Gretta                    | W. Leslie                         | 50       |       |\n| Virden                    | J. Routledge                      | 50       |       |\n| Shell River               | G. B. Brown                       | 60       |       |\n| Winnipeg                  | Mr. Carruthers                    | 30       |       |\n| Fort Qu'Appelle           | J. C. Richardson                  | 50       |       |\n| Touchwood                 | R. Wishart                        | 50       |       |\n| Medicine Hat, N.W. Mounted Police | Supt. Motlree                   | 50       |       |\n| Supply Officer, Swift Current | Major-General Laurie             |          |       |\n| do Qu'Appelle             | Capt. Swinford                    | 600      |       |\n| Winnipeg Police           | Chief Murray                      | 25       |       |\n| Transport                 | Major Bell                        | 100      |       |\n| Totals                    |                                   | 2,738    |       |\n\n*6,850 blank included.\n\nW. H. JACKSON, Lieut.-Col., D.A.G.,\nP. S., P. and T. Officer.\nAt eleven o'clock at night I received instructions by telegraph from the Adjutant General, Colonel Powell, which, with others, included the following as forming a part of my duties: \"Take steps for the formation of a Commissariat Corps. Until you receive further instructions with regard to direct purchases, you will continue to receive necessary stores from Agent Hudson's Bay Company, and issue as required. Each Supply Officer going up with corps to report to, and receive instructions from you. Apportion to each their respective duties, viz.: Supply officers, transport, paymaster's branch, military stores, in such proportion as considered advisable, to carry out the following duties: Receipt and issue of supplies on the field, hire or purchase of transport, payments, regimental and staff pay, payment of orders received from, and vouched for by officers of, supply and transport branches, and all other payments on account of the force, stores, receipt and issue of camp equipment, clothing and arms.\" These instructions were carried out so far as practicable, without interfering with arrangements entered into by the General Officer Commanding, and the proviso contained in the instructions.\n\nSunday, 5th.—\"A\" and \"B\" Batteries arrived at Winnipeg this morning at eleven o'clock. Lieut. Col. Montizambert and Major Short accompanied me to Fort Osborne to purchase horses; a large number having been paraded to select from, eight superior ones were secured. The other horses of the Batteries were examined by a Veterinary Surgeon, shoes set on those required, and other repairs executed and necessaries procured, the corps leaving the same night by Canadian Pacific Railway for Qu'Appelle with 11 officers, 228 non-commissioned officers, and men, 35 horses and 4 guns.\n\nThe Adjutant-General informed me that Gatling guns might be expected on Tuesday. I telegraphed Major-General (now Major-Genl. Sir Fred.) Middleton, K.C.M.G., C.B., asking for instructions as to their destination. I was also ordered by the Adjutant-General to take over the duties of Deputy Adjutant General of Military District No. 10. (Sixty-two telegrams received and answered up to this evening, besides many letters.) Also authority for the organization of two additional companies for Lieut.-Col. Scott's Battalion.\n\nMonday, 6th.—Captain Allen reported for duty, and at once undertook to secure and fit up offices in a central locality; Sergeants Feron and Brown engaged to assist. The organization and equipment of the several corps going on briskly; clothing, utensils, &c., being purchased from local dealers. Applications from different parts of the country for arms and ammunition for local protection answered, and issues made as previously shown in tabular statement.\n\nOwing to the multiplicity of duties devolving upon me, necessitating continuous day and night work, I telegraphed the Adjutant-General, it was impossible to\nundertake the duties of Deputy Adjutant-General, Military District No. 10, and requested some other officer be appointed, this request was repeated on the 8th, but receiving no reply had to continue the duties which I carried on until the 16th July.\n\nTuesday, 7th.—Managed to get into office, not having military forms or books of any kind, picked up and improvised such as were available at local dealers, but owing to the great number of people constantly asking for information, much confusion prevailed about the office. Purchases of various kinds going on for which payments had to be promptly made.\n\nTwo Gatling guns, with fifty thousand rounds of ammunition, arrived by express (C. P. Railway), and arrangements were made for the purchase of horses, harness and saddles, for their completion for service. A guard from the Winnipeg Light Infantry mounted over the guns and ammunition. The want of sufficient Officers to do the Staff work (Captains Allen and Morton being the only ones assisting me), was causing much inconvenience. Lieut.-Col. T. C. Scoble, late Brigade Major at Toronto, and Lieut.-Col. A. P. Atwood, late Commanding Middlesex Light Infantry, whom I previously knew as efficient officers, having offered themselves for duty in any capacity where they could be useful, I was only too glad to avail myself of their offer, and appointed Lieut.-Col. Scoble Acting Brigade Major, and Lieut.-Col. Atwood, Acting Camp Quartermaster; this enabled me, as troops accumulated, to mount guards and carry on the duties of a garrison town. These two officers served most faithfully up to the 12th, when they found it necessary to retire. In the meantime Lieut.-Col. E. Lamontagne, D.A.G., Military District No. 4, and Lieut. H. G. Bate, G. G. Foot Guards, having arrived with Corps, as Supply Officers, I had the former act as Brigade Major, and the latter as Camp Quartermaster. Lieut. Col. Lamontagne continued until 4th June, when he left for Ottawa. During the period he discharged important duties and rendered me valuable assistance in various ways, acting at intervals, in April and May, during my illness, as Deputy Adjutant-General. Lieut. Bate continued on duty up to about 20th September. During the period he was sent west by Lieut.-Col. Whitehead to close up subsistence returns at various points on the Canadian Pacific Railway.\n\nMajor T. Charles Watson, who had arrived at Winnipeg the day previous, with your authority to organize one hundred militia at Yorkton, for service, reported to me, and set about making necessary arrangements. He and his Sergeant Instructor, Gardiner, were fitted out with certain necessaries and clothing, 100 stand of arms, and 5,000 rounds of ammunition; they took their departure for the colony on the 10th. I may be permitted to state Major Watson managed his organization financially most satisfactorily, everything having apparently been carried on in accordance with the Regulations and Orders, which was exceptional during the service.\n\n\"C\" Company Infantry School Corps, Lieut.-Col. W. D. Otter, and the Queen's\nOwn Rifles, Lieut.-Col. A. A. Miller, arrived this morning and departed for the west at 5 p.m.\n\nWednesday, 8th.—The 10th Royal Grenadiers, Lieut.-Col. H. J. Grassett, and the Ottawa Sharpshooters, Captain Todd, arrived this morning. After having been supplied with various articles departed for the west in the evening. Lieut.-Col. Lamontagne, Deputy Adjutant General, Military District No. 4, who accompanied Lt.-Col. Otter's command as Supply Officer, arrives and remains on duty at Winnipeg until 4th June, as noted under yesterday's date.\n\nMajor George Guy reported himself, with a letter dated 5th April, 1885, from the Adjutant-General, addressed to me, of which the following is an extract:\n\n\"I have the honor to inform you that the Minister of Militia has appointed Major Guy, formerly Paymaster at Halifax, to be Paymaster of the Forces on service in the North-West. Major Guy will leave here to night, and has been directed to report himself to you for orders.\"\n\nI at once placed a room at his disposal, which he set about fitting up as an office, with desks, safe, &c., and on the following day commenced his duties as head of the Paymasters; I providing him with sufficient credit from time to time, to meet the requirements of the service. This appointment proved a most valuable one, Major Guy's long experience, with a thorough knowledge of the regulations, aptitude and ability for work, were availed of to the fullest extent. The work, ever on the increase, appeared to reach its climax when the voluminous claims of the Hudson's Bay Company commenced to arrive, the auditing of which devolved upon this officer, assisted by one clerk, J. K. Strachan. As you declined making further advances to the Hudson's Bay Company, pending the audit which commenced about the 1st June, the urgency for payment being such as to necessitate continuous, arduous and responsible work daily, from early morning to mid-night, Sundays included; the other payments being carried on at the same time, which were largely augmented by meeting the demands of the various persons returning from service. Subsequently followed the payments recommended by the War Claims Commission and approved by you, all of which required continuous laborious work up to the time of leaving Winnipeg, on 7th December, 1885.\n\nCaptain A. L. Howard, of the United States National Guard, reported and presented instructions from the Adjutant-General regarding the Gatling guns, which I placed him in charge of. On examination, one was found to have received damage while en route. This was repaired under the supervision of Captain Howard, who also saw to the fitting of harness, saddles, &c. I detailed four men for duty, which were necessary to look after the nine horses, guns, &c. All being completed, the Battery left early on the morning of the 10th, by the Canadian Pacific Railway, for the west, in accordance with orders I had received from Major-General (now Major-Gen. Sir Fred.) Middleton, K.C.M.G., C.B. The different branches of the Commissariat and Brigade Staff having now been got into better working order, greater regularity was carried out.\nCaptain George W. R. White presented his agreement, signed by Major-General Middleton, regarding the organization of a corps of scouts, which were subsequently called \"The Moose Mountain Scouts,\" to be fifty-three strong, but one officer failed to appear. Complete outfit for fifty men, including Horses, Saddlery, Rifles, Revolvers, Accoutrements, Clothing, Blankets, Tents, &c., had to be purchased, which was done through the local dealers. The recruiting and fitting out of this Corps at the same time the two Battalions were being organized and other troops arriving and departing almost daily, added much to the confusion of the city and increased duties on the Staff, which had been augmented by Mr. James Anderson, whom you had sent up for service; and John Benson, a local man, had been taken on, by your orders, to assist in purchasing horses. These two, under Captain Allen and Captain White, completed the purchase of fifty-two horses. The men were enlisted and equipped, and, by order of the General Officer Commanding, left on 21st April, by Canadian Pacific Railway, for Qu'Appelle, en route to the post to which they were assigned, about eighty miles south of Qu'Appelle, for the purpose of patrolling between Moose Mountain and Old Wives Lake.\n\nOn returning from service this Corps handed over horses and stores to Lieut.-Col. Forrest, at Qu'Appelle, where they were paid off, and disbanded on 30th June.\n\nThe troops, at this date, having commenced to arrive rapidly, for convenience of reference, the following return will show at a glance, date of arrival and departure from Winnipeg; and in order to arrive at the number actually engaged in the various operations, all the Corps organized in Manitoba and the Territories, which were under pay, are included, together with an approximate number, as correctly calculated as possible, of those engaged on the Staff, Field Hospital and Ambulance Corps, Transport and Supply, (including Clerks, Teamsters, Horses and oxen) and others:—\n## NORTH-WEST FORCES, 1885.\n\n**Militia on Active Service.**\n\n**Return of Corps showing Strength, Date of Arrival at, and Departure from, Winnipeg for the West.**\n\n| Corps | Commanding Officers | Date of Arrival | Strength | Date of Departure | Strength |\n|-------|---------------------|-----------------|----------|-------------------|----------|\n|       |                     |                 | Officers | N.-O.O. and Men | Horses | Guns | Officers | N.-O.O. and Men | Horses | Guns | Remarks |\n| A and B Batteries G. A. | Lieut.-Col. Montizambert | April 5 | 12 | 228 | 27 | 4 | April 5 | 11 | 228 | 35 | 4 |\n| O Company, I. S. Corps | Lieut.-Col. Otter | do | 7 | 4 | 86 | | do | 7 | 4 | 88 | | 6 p.m. |\n| Gatling Guns | | do | 7 | | | | do | 10 | 1 | 4 | 9 | 2 |\n| 2nd Battalion, Queen's Own Rifles | Lieut.-Col. Miller | do | 7 | 17 | 263 | | do | 7 | 17 | 263 | | 5 p.m. |\n| 10th Battalion, Royal Grenadiers | Lieut.-Col. Grassett | do | 8 | 17 | 248 | | do | 8 | 17 | 248 | | |\n| Ottawa Company of Sharpshooters | Capt. Todd | do | 8 | 3 | 48 | | do | 8 | 3 | 48 | | |\n| D.L.S. Intelligence Corps | Capt. Dennis | do | 9 | 20 | 80 | | do | 11 | 20 | 30 | 50 | Horses procured after departure. |\n| 85th Battalion | Lieut.-Col. Ouimet | do | 10 | 26 | 289 | | do | 10 | 26 | 289 | 2 |\n| York and Simcoe Battalion | Lieut.-Col. O'Brien | do | 11 | 30 | 316 | 4 | do | 12 | 30 | 316 | 4 |\n| 9th Battalion Voltigeurs | Lieut.-Col. Amyot | do | 12 | 29 | 201 | | do | 23 | 28 | 198 | | 6 men left in hospital. |\n| Midland Battalion | Lieut.-Col. Williams | do | 14 | 34 | 348 | 4 | do | 14 | 34 | 348 | 4 |\n| Governor General's Body Guard | Lieut.-Col. Denison | do | 15 | 8 | 72 | 71 | do | 23 | 8 | 72 | 73 |\n| 7th Battalion Fusiliers | Lt.-Col. DeR. Williams | do | 16 | 26 | 237 | 5 | do | 23 | 22 | 244 | 5 |\n| Cavalry School Corps | Lieut.-Col. Turnbull | do | 19 | 8 | 45 | 33 | do | 24 | 3 | 45 | 32 | 1 horse died. |\n| Halifax Battalion | Lieut.-Col. Brenner | do | 22 | 32 | 351 | 5 | do | 29 | 33 | 350 | 5 |\n| M. B. Garrison Artillery | Lieut.-Col. Oswald | May 20 | 23 | 276 | 4 | May 26 | 22 | 275 | 4 | Chaplain attached. |\n\n**Totals:** 284, 3,040, 153, 6 | 279, 3,044, 223, 6\n\nW. H. JACKSON, Lieut.-Col., D.A.G.,\nP.S., P. and T. Officer.\nNORTH-WEST FORCES, 1885.\n\nMILITIA ON ACTIVE SERVICE.\n\nRETURN of Corps organized in Military District No. 10, with Headquarters at Winnipeg, shewing Strength and Date of Departure Westerly.\n\n| Corps                        | Commanding Officer | Date of Departure | Strength | Remarks                                      |\n|------------------------------|--------------------|-------------------|----------|----------------------------------------------|\n|                              |                    |                   | Officers | N. O. O. and Men. | Horses | Guns |\n| 90th Battalion               | Major Mackeand     | 1885              | 25       | 293                                          |        |      |\n| Winnipeg Field Battery       | Major Jarvis       |                   | 6        | 56                                           | 26     | 2    |\n| Winnipeg Light Infantry      | Lt.-Col. Smith     | April 16          | 29       | 298                                          | 9      |      |\n| 91st Battalion Winnipeg Rifles | Lt.-Col. Scott    | do 17             | 24       | 408                                          | 4      |      |\n| Moose Mountain Scouts        | Capt. White        | do 21             | 2        | 50                                           | 55     |      |\n| Winnipeg Cavalry             | Capt. Knight       | do 24             | 2        | 30                                           | 28     |      |\n| **Totals**                   |                    |                   | 83       | 1,134                                        | 122    | 2    |\n\nSUMMARY.\n\n| Distribution                  | Strength | Remarks                                      |\n|------------------------------|----------|----------------------------------------------|\n|                              | Officers | N. O. O. and Men. | Horses | Guns |\n| Corps from the East          | 279      | 3,044                                        | 223    | 6    |\n| Corps organized at Winnipeg   | 88       | 1,134                                        | 122    | 2    |\n| **Totals**                   | 367      | 4,178                                        | 345    | 8    |\n\nW. H. JACKSON, Lieut.-Col., D.A.G.,\nP. S., P. and T. Officer.\nNORTH-WEST FORCES, 1885.\n\nMILITIA ON ACTIVE SERVICE.\n\nRETURN OF CORPS ORGANIZED WEST OF WINNIPEG, SHOWING STRENGTH.\n\n| Corps                        | Commanding Officer | Strength | Remarks |\n|------------------------------|--------------------|----------|---------|\n|                              |                    | Officers | N.-O.-O. and Men | Horses | Guns |\n| Steele's Scouts              | Major Steele       | 3        | 61      | 64     |       |\n| Alberta Mounted Rifles       | Major Hatton       | 3        | 54      | 57     |       |\n| Boulton's Mounted Infantry   | Major Boulton      | 10       | 103     | 113    |       |\n| Rocky Mountain Rangers       | Capt. Stewart      | 9        | 104     | 113    |       |\n| French's Scouts              | {Capt. French}     | 2        | 35      | 37     | Capt. French killed in action. |\n|                              | Capt. Brittlebank  |          |         |        | Including an Asst.-Surgeon. |\n| Yorkton Company              | Major Watson       | 2        | 61      |        |       |\n| Birtle do                    | Capt. Wood         | 3        | 39      |        |       |\n| Battleford Rifle Company     | Capt. Nash         | 3        | 50      |        |       |\n| do Home Guard                | Capt. Wyld         | 7        | 130     |        |       |\n| St. Albert Mounted Rifles    | Capt. Cunningham   | 3        | 39      | 38     |       |\n| Scouts (Otter)               | Lieutenant Sears   | 1        | 27      | 28     |       |\n| Transport Scouts (Laurie)    | Chief Scout Donnelly | 1    | 20      | 21     |       |\n| Special Constables           |                    |          |         |        |       |\n| Totals                       |                    | 47       | 742     | 471    |       |\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nP. S., P. and T. Officer.\nNORTH-WEST FORCES, 1885.\n\nMILITIA ON ACTIVE SERVICE.\n\nRETURN OF THE STRENGTH OF THE STAFF, COMMISSARIAT, HOSPITAL AND AMBULANCE CORPS, AND OTHERS, AS SHOWN HEREUNDER.\n\n| Service                        | Strength | Remarks |\n|-------------------------------|----------|---------|\n|                               | Officers | N.C.O. and Men | Horses |\n| Staff                         | 39       |          | 45     |\n| Commissariat                  | 38       | 149      | 38     |\n| Hospital and Ambulance        | 140      | 73       | 37     |\n| Telegraph Operators and Linemen |         |          |        |\n| Scouts (not forming part of any Corps) |   |          |        |\n| Couriers                      |          |          |        |\n| Herders                       |          |          |        |\n| Miscellaneous                 |          |          |        |\n| Transport                     | $1,771   | $3,940   |        |\n| Totals                        | 117      | 2,631    | 4,309  |\n\nOperations on Navigable Waters.\n\nThe undernamed craft were used for transport purposes on the Saskatchewan River:—Steamers \"Northcote,\" \"Northwest,\" \"Marquis,\" \"Baroness,\" \"Alberta,\" \"Minnow,\" and 30 scows and barges.\n\n† During the operations the \"Northcote\" took part in the action of Batoche, and sustained considerable damage.\n\nW. H. JACKSON, Lieut.-Col., D.A.G.,\nP.S., P. and T. Officer.\n## NORTH-WEST FORCES, 1885.\n\n### MILITIA ON ACTIVE SERVICE.\n\n#### Recapitulation.\n\n| Service                                      | Strength          | Remarks                                      |\n|----------------------------------------------|-------------------|----------------------------------------------|\n|                                              | Officers | N.O.C. and Men | Horses | Guns |\n| Staff                                        | 39       |                | 45     |      |\n| Corps from the East                          | 279      | 3,044           | 223    | 6    | Including 2 Gatling guns. |\n| Corps organized in Winnipeg                   | 88       | 1,134           | 122    | 2    |\n| do West of Winnipeg                          | 47       | 742             | 471    |      |\n| Commissariat                                 | 38       | 149             | 38     |      |\n| Hospital and Ambulance                       | 40       | 73              | 37     |      |\n| Telegraph Operators and Linemen              | 27       |                 |        |      |\n| Scouts (not forming part of any Corps)       |          | 71              | 71     |      |\n| Couriers                                     |          | 76              | 76     |      |\n| Herders                                      |          | 102             | 102    |      |\n| Miscellaneous                                |          | 262             |        |      |\n| Transport                                    |          | 1,771           | 3,940  |      |\n| North-West Mounted Police                    |          |                 |        |      |\n\n**Totals**\n\n| Officers | N.O.C. and Men | Horses | Guns |\n|----------|-----------------|--------|------|\n| 531      | 7,451           | 5,125  | 8    |\n\nStrength not reported. Subsistence drawn from Militia whilst acting with them.\n\n---\n\nW. H. JACKSON, Lieut.-Col., D.A.G.,\nP. S., P., and T. Officer.\nWhether from defects when starting, or rough passage over the north shore of Lake Superior, on arrival of Corps the Arms, Accoutrements, Clothing, &c., all required more or less repairs or exchanges; also some boots, underclothing, mufflers, &c. All this added largely to the duties of my small overworked staff, which had now been augmented by Major J. Vaughan, of the retired list, who you authorized me to employ and who had been placed in charge of the Military Store Branch, which duty he discharged in a highly creditable manner, frequently assisting in making purchases and discharging other duties as required, continuing in the service up to 31st July.\n\nThe Major-General Commanding telegraphed me to send one hundred teams for transport service, and not to pay more than eight dollars per day. I engaged the teams at six dollars and fifty cents per day, which was the first reduction from ten dollars per day, paid to those previously hired, except any Major W. R. Bell may have engaged under Mr. Bedson's telegram to him of this date (8th April) limiting pay not to exceed eight dollars. With this difference, Bell offered and gave the maximum sum.\n\nThe camp equipment in Government stores having all been issued, as well as tents purchased from various parties, there was great difficulty in filling the many requisitions which were coming in from various points, frequently having to wait for the tents to be made.\n\nThursday, 9th.—The organization of the several local Corps continuing with vigor, great exertion being used to provide necessary clothing and equipment. Captain J. S. Dennis, with his Surveyors, arrived and proceeded west on the morning of the 11th. The issue of arms and ammunition to settlers proceeding as rapidly as possible.\n\nMajor-General Strange urges the forwarding of arms, ammunition and saddlery to Calgary, for use of Scouts which were being organized there. Stores shipped as fast as they can be got ready. The Major-General Commanding ordered me to send 65th Battalion (not yet arrived) to Calgary, other Corps to remain at Winnipeg for orders.\n\nFriday, 10th.—The 65th Battalion, Lieut.-Col. J. A. Ouimet, arrived, and as previously ordered by the Major-General Commanding, left by C. P. Railway for Calgary the same day, after having been supplied with boots, socks, caps, oil, &c.\n\nCaptain Joshua Wright, of the 43rd Battalion, who came up with this Corps as Supply Officer, reported in accordance with his instructions, and I detailed him to accompany the Battalion to Calgary and place himself under the orders of Major-General Strange, with whose column he continued to serve until the close of the campaign.\n\nReceiving increased numbers of telegrams and letters, on various subjects, great exertion made to meet all demands.\n\nSaturday, 11th.—The York and Simcoe Battalion, Lieut.-Col. W. B. O'Brien, arrived and went into Camp. Deficient equipment, arms and other stores made good. Lieut. H. G. Bate, Gov. Gen. Foot Guards, Supply Officer, arrives with this Corps and remains on duty at Winnipeg, where he was utilized in various capacities, as noted under Tuesday, 7th.\n\nThe Major-General Commanding orders the Winnipeg Light Infantry to be sent forward as soon as properly equipped; renewed exertions to comply; enlistments still going on, both in city and country.\n\nTelegraph operators and linemen commenced to arrive and apply for instructions, outfit and transport; all were forwarded to the front without unnecessary delay.\n\nSunday, 12th.—The 9th Battalion, Lieut. Col. G. Amyot, arrived and went into Camp, and at once commenced to complete outfit, which consisted of boots, socks, shirts, utensils and water bottles. There being no water bottles in store, large numbers had to be manufactured, with which most of the corps were supplied before proceeding west.\nThe York and Simcoe Battalion, Lieut. Col. O'Brien, left for the west, half for Qu'Appelle and half for Swift Current.\n\nMonday, 13th.—The enlisting and equipping of the Moose Mountain Scouts, and other local corps proceeding.\n\nThe General Officer Commanding telegraphed, eighteen miles from Humboldt, ordering field gun ammunition to be sent to Major-General Laurie, at Swift Current, and directing corps to be ready to move.\n\nGreat exertions were being used to complete outfit of all, much of which had to be made, requiring considerable time in its manufacture and all the men had not yet been enlisted.\n\nMr. John Woolsey, who came with the 9th Battalion as Supply Officer, proceeded to Swift Current for duty, subsequently going to Regina, where he remained until the withdrawal of the Montreal Brigade of Garrison Artillery.\n\nTuesday, 14th.—The Midland Battalion, under command of the lamented late Lieut. Col. Arthur T. H. Williams, arrived and was marching through the city to their camp ground, which had been selected in the west end, when I received a telegram from the Major-General Commanding, to send the Corps to Fort Qu'Appelle. The order reached Col. Williams on the street, which he read with apparent satisfaction, countermarched the Battalion, and at once took train for his destination, never to return alive. His subsequent death as is well known, having cast a gloom over the whole Dominion.\n\nLieut.-Col. D. A. Macdonald, of the Militia Department, came up with the Midland Battalion as Supply Officer, remaining on duty at Winnipeg up to the 18th May, when he left for Ottawa. This officer acted as Brigade Major and discharged various important duties as circumstances required. His assistance to me personally was highly appreciated.\n\nDr. T. G. Roddick, Deputy Surgeon General, with surgeons making preparations for departure west. Arrangements also being completed to send sick and wounded soldiers to Winnipeg hospital, quite a number having already been sent there.\n\nHon. Dr. Sullivan, Purveyor-General, arrived with medical supplies. As provision had been made in his instructions, to issue to hospital, or hospital corps, only, surgeons of corps had to be provided as best we could, from local dealers. Dr. Sullivan supervised some of the requisitions, and at all times cheerfully assisted me, when I found a difficulty in deciding as to issues. Dr. Sullivan, in his report, having referred to my refusal to issue a transport requisition to cover freight, on a car load of medical supplies from Montreal, I feel it my duty to say it was not because I doubted that gentleman's word for a moment, but because the regulations require all stores to be accompanied by the requisition covering the freight, and under no circumstances are duplicates to be issued. Knowing the contents could not be utilized, until the hospital corps proceeded west, and supposing the person who shipped the goods had sufficient knowledge of the service to comply with the regulations, I thought the requisition might follow, as they are sometimes detained a day or two by the railway people; but when the time came for the car to be moved, I took the responsibility of meeting the difficulty, which involved an expenditure of nearly nine hundred dollars.\n\nI cheerfully bear testimony to the anxious desire shown by Dr. Sullivan to guard the interests of the Department, and his willingness at all times, when with me, to discharge duties connected with the sick and wounded, which properly belonged to the surgeons, had they been present. His uniform kindness personally deserves my especial thanks; he also at considerable inconvenience (in the absence of other surgeons), and to save expense, medically examined the men enlisted to serve in the Moose Mountains Scouts. According to my memoranda Dr. Sullivan is in error as to date of his arrival at Winnipeg.\n\nThe work had now increased enormously, the great number of telegrams which generally reached me between midnight and day break prevented sleep, sometimes\nfor several consecutive nights, answers having invariably been dispatched immediately on receipt.\n\nThe correspondence had also become large, requiring much attention.\n\nI received the following telegram from the Deputy of the Minister of Militia and Defence:\n\n\" Lieutenant-Colonel Forrest has been appointed one of the Supply Officers and Paymasters, under your orders. Give him his instructions.\"\n\nLieut.-Col. Forrest having presented himself, I, through Major Guy (who you had appointed Paymaster to the Forces), placed a sum of money to his credit, with instructions to proceed and establish himself at Qu'Appelle, to make payments there, and especially to keep the troops with the Major-General Commanding paid up, as also such other corps as might be arranged between Major Guy and himself.\n\nWednesday, 15th.—The Governor General's Body Guard, Lieut.-Col. G. T. Denison, arrived and went into camp. The appointments of this Corps required many repairs, which local tradesmen worked at night and day to complete.\n\nAn unpleasant feeling having got among the Troopers, that the Enfield carbines were not equal to the repeating Winchesters, with which it was supposed the Indians and rebels were armed, and as a large number of Winchesters had been handed over to the Militia Storekeeper in Winnipeg, by the North-West Mounted Police, I authorized the exchange of carbines, and an issue of revolvers, which was subsequently approved of; and similar exchanges were made with all other Cavalry Corps, before they left for the front. After completion of service Lieut.-Col. Denison returned revolvers into store at Winnipeg. I may be permitted to say, this officer managed the financial affairs of his Corps strictly in accordance with the Regulations and Orders.\n\nWith great exertions, the enlistment and equipment of the Winnipeg Light Infantry, Lieut.-Col. Osborne Smith, C.M.G., had been completed, and the Corps left, by Canadian Pacific Railway, for Calgary. On the requisition of the Officer Commanding this Corps, I authorized the purchase of, and fitting up of a light buckboard, as an ambulance waggon, with linen top, which was sufficient to carry all surgical and medical appliances, and hospital tent, and could be utilized, if required to carry a wounded man. This was drawn by a pair of native ponies, which had been purchased. This arrangement proved much more economical than hiring by the day. A similar outfit was also provided Lieut.-Col. Scott's Battalion. I have no doubt the Surgeons in the North-West could improvise a cheap ambulance waggon, which would be very suitable for army use on the plains, and much better adapted than those of foreign manufacture.\n\nThursday, 16th.—The 7th \"Fusiliers,\" Lieut.-Col. DeRay Williams, arrived and went into camp. The usual refitting of arms, equipment and clothing proceeded with.\n\nCaptain W. Hudson, Supply Officer, accompanied this Corps.\n\nHis Honor Lieut.-Governor Dewdney, telegraphs for more ammunition to be sent to Major-General Strange. Large quantities already sent, and other stores being pushed forward as fast as possible.\n\nAbout this time, or a few days before, there were rumors through the press, and otherwise, that the tinned meat had been poisoned by Fenians, before it left the factory in Chicago. You telegraphed Mr. Wrigley on the subject, who informed me. This caused very grave anxiety, as much of the meat was then en route to the front, and more arriving, and if issue were stopped, to procure a substitute in time to prevent the troops from suffering was doubtful; consequently, after an anxious consultation with Mr. Wrigley, Commissioner Hudson's Bay Company, it was decided, cans from several different packages should be tested by the Public Analyst (Mr. J. E. Wright), which was immediately proceeded with. That officer's report, was so favorable, and the firms from whom the meats were purchased had such a high reputation, we concluded to take the responsibility of continuing the issue, which happily proved our judgment was correct.\nPeople in the East who had friends in the Force, commenced through the press, to complain, not only of the quality of the tinned meats, but of the quantity (which, however, was always in abundance); consequently a contract was entered into with Gallagher & Co., to accompany the troops serving in the Major-General's column, with a herd of beef cattle, to be slaughtered and issued as required. The first hundred were purchased in the States, and reached Winnipeg on the 20th April; Rumors were at once circulated through Winnipeg these cattle were diseased. At first, I thought no attention should be paid to these rumors, but it was so persisted in, I spoke to Mr. Gallagher. He expressed a desire that the herd should be examined by a Veterinary Surgeon. Mr. Little was instructed, by me, to perform this duty. He did so, and reported all a superior lot and healthy, except three, which had slight swellings on their jaws, but not supposed to be of any consequence. The contractors at once removed the three, and the balance went forward.\n\nI record these facts to show, what difficulties there were to overcome. There is no doubt the rumours in both cases had been started by rivals in trade, or would-be contractors.\n\nFriday, 17th.—The Winnipeg Infantry, Lieut.-Colonel Thos. Scott, having been completed to eight companies, and fully equipped, left for Qu'Appelle, 432 officers and men, the strongest Corps on service, and in appearance all that could be desired. Ambulance and ponies supplied same as for Lieut.-Colonel Smith's Corps.\n\nMajor-General Strange applies for self-cocking revolvers; there being none available, Colt's were substituted.\n\nTents in great demand, and expected from the East daily; in the meantime having them manufactured in the city, and purchased wherever they could be found.\n\nSaturday, 18th.—Major-General Strange very pressing for arms, ammunition and equipment, which are being forwarded as rapidly as possible; many articles had to be brought from a distance, and as there was but one train each week to Calgary, delays were unavoidable.\n\nGreat exertions being used to complete outfit of Moose Mountain Scouts.\n\nShipment of Arms and Ammunition to various points going on with rapidity. I inspected the Governor General's Body Guard, Lieut.-Colonel G. T. Denison. The repairs to equipment and change of arms had rendered this Corps quite prepared to take the field. The men, horses and general appearance, indicated a high state of efficiency.\n\nI also inspected the Moose Mountain Scouts, Captain White. The Corps had, with considerable difficulty, been recruited, horsed, armed and equipped, and appeared quite suited for the service for which they were intended.\n\nThe following instructions, transmitted through the Adjutant-General, Colonel Powell, reached me this morning. Copies of which were at once sent to the Staff Paymasters, and the information imparted to others interested:\n\n\"Department of Militia and Defence,\nOttawa, 11th April, 1885.\n\n\"To the Adjutant-General of Militia,\nOttawa.\n\n\"(Memo.)—Instructions for Lt.-Col. W. H. Jackson at Winnipeg, Principal Supply Officer to the Militia Forces on actual service in the North-West Territories:\n\n\"Credits with the Bank of Montreal, at Winnipeg, will be provided in favor of Lt.-Col. W. H. Jackson, Principal Supply Officer at Winnipeg, to enable him to pay services in connection with the Militia Forces on actual service in Manitoba and the North West Territories.\n\n\"A monthly account current, in duplicate, which shall show all receipts and expenditures, shall be rendered by him to the Department of Militia and Defence. Payments are to be supported by vouchers, and the receipts of the parties paid.\"\n\"and in cases when payments have necessarily to be made in cash, instead of by cheque, the receipts of the persons paid must be supported by the signature of a witness.\n\n\"Paymasters to the Forces in the field will make requisitions on him for money required for the pay of the officers and men to their Battalions, and the subsistence, transport, &c., of the Force to which they are attached.\n\n\"These Paymasters will account to him for those advances, which he must see fully accounted for in the Monthly Regimental Pay Lists, and the vouchers attached to their accounts.\n\n\"The Paymasters' accounts, after having been examined and certified to by the Principal Supply Officer, will be forwarded by him to the Department of Militia and Defence, in support of his accounts with the Department. The duties and responsibilities of Paymasters are defined in Militia Regulations and Orders.\n\n\"The forms for the cash accounts to be used are the following:\n\n\"Militia on Actual Service.\n\n\"Form A.—Principal Supply Officer or District Paymasters' Requisition on Department of Militia and Defence for advance of cash.\n\n\"Form B.—Requisition of a Captain of a Company on the Regimental Paymaster for the weekly advance of pay for his Company.\n\n\"Form C.—Company Pay List.\n\n\"5.—Contractors' Claims.\n\n\"20.—Out Station Receipts.\n\n\"26.—Account Current.\n\n\"Form D.—Regimental Paymasters' Requisition on Principal Supply Officer, or District Paymaster, for advance of cash for pay of officers and men.\n\n\"A supply of forms, ledgers, cheque books, &c., will be provided by the Militia Department, upon requisition from the Principal Supply Officer.\n\n\"Paymasters, and others, will make requisition on the Principal Supply Officer for the forms they may require.\n\n\"All claims for payment must be supported by the certificate of the Commanding Officer of the regiment, detachment, or commandant at the post, and even then, if not in accordance with the Regulations and Orders, or if deemed unnecessary or extravagant, payment must be refused, and the claims referred to the general officer for his decision, who will have the option of further reference to Headquarters at Ottawa.\n\n\"Claims for transport must be certified by the officer who received the transport, and claims for supplies or provisions must be certified as to the receipt of the articles by the officer in charge of the stores before payment.\n\n\"Lieut.-Col. Jackson is requested to send copies of these instructions for the guidance of Paymasters and Departmental Staff Officers, with the Militia Forces in the North-West Territories.\n\n\"C. EUG. PANET,\nDeputy Minister of Militia and Defence.\n\n\"To Lieut.-Col. W. H. Jackson, for his information and guidance.\n\n\"W. POWELL, Col.,\nAdjutant General.\"\n\n13-4-'85.\n\nSunday, 19th.—The Cavalry School Corps, Lieut.-Col. J. F. Turnbull, arrived, and take up quarters in an old livery stable. Captain H. Heigham came as Supply Officer with this Corps. Was taken with pleurisy and went into hospital on the 25th from which he was discharged on 15th May. Did duty at Winnipeg for a time.\nwhen he was sent to Touchwood, where he continued until the Cavalry School Corps were relieved from service in the North-West.\n\nMonday, 20th.—The Winnipeg Troop of Cavalry being got ready as fast as possible for service.\n\nMajor-General Strange's requisitions became so complicated, I refer to Major-General (now Major-General Sir Fred.) Middletons, K.C.M.G., C.B., for instructions.\n\nThere being no Surgeon with the Cavalry School Corps or Winnipeg Cavalry, I attached both to the Governor General's Body Guard for medical purposes, under charge of Surgeon Baldwin.\n\nTelegraphed Major-General Middleton, asking where he wished Supply Officers stationed.\n\nMany applications from wives and families of soldiers for payments on account, were being received. Although this was a Regimental matter, we did what could be done to meet the emergency, and information as to procedure was given.\n\nThe men of various Corps were re-examined by Surgeons at Winnipeg, and those rejected, as well as invalids, were applying for transport and subsistence to enable them to reach their homes. After the fighting commenced, the sick and wounded began to return, then these applications became more numerous. It being contrary to the Militia Act for men to go into a foreign country wearing uniform, and as they could not return through our own territory before the opening of navigation, caused much difficulty in dealing with these cases.\n\nThe allowance \"in lieu\" of subsistence as laid down in the Regulations was quite insufficient to meet the expense, unless rations were carried by the men. This, with invalids, was impracticable; so I authorized the utmost limit to be given in cash, which was frequently supplemented by employees of the office, who also assisted to procure civilian's clothing for some who insisted upon returning through the United States. Subsequently you were good enough to authorize an allowance in such cases of one dollar and fifty cents per day, in lieu of subsistence. This met the difficulty and money was never more justly or benevolently expended.\n\nThe Major-General Commanding telegraphed to send a Supply Officer to Clarke's Crossing. Captain Wm. Hudson was ordered to proceed at once, via Swift Current, as it was supposed the boats, which were then about starting from Saskatchewan Landing, would afford the quickest passage. He started on the following day, but I believe was detained at Swift Current by Major General Laurie for some weeks, consequently he did not reach his destination as soon as anticipated, or as soon as the General Officer Commanding may have desired, but Captain Hudson's orders were to proceed as rapidly as possible. Major-General Laurie may have had authority for this detention.\n\nTuesday, 21st.—The Moose Mountain Scouts, Captain G.W.R. White, proceeded west, by Canadian Pacific Railway, en route to their destination, to patrol between Old Wives' Lake and Moose Mountain.\n\nThe Adjutant-General telegraphed authority for appointing one Chaplain to each Corps. These gentlemen soon commenced to present themselves, and were provided, when necessary, with camp equipment, and transport to join their respective Corps.\n\nThe weather which had been very wet for some time, had now got so bad—water, several inches deep, covered the earth almost everywhere, added to this the discomforts of Winnipeg mud, and cold nights—the health of the troops began to suffer; consequently, it became necessary to house all we possibly could, there being at the time a large force to provide for. Quarters, however, were found and taken possession of, in the huts, at the Fort, by the Governor-General's Body Guard and Winnipeg Cavalry; the 9th Battalion and 7th Fusiliers were got into such buildings as could be secured, stoves and other fixtures being required. The troops had only got nicely settled into these places, when ordered forward, all having left by the 24th.\n\nWednesday, 22nd.—The Halifax Battalion, Lieut.-Col. James J. Bremner, arrived and went into quarters, requiring considerable outfit, which was provided as rapidly as possible.\nThe shipment of arms and ammunition to various settlements, as directed by the Major General Commanding, proceeding. Supply Officers, at different points, were asking for rifles and pistols to arm teamsters, who were becoming alarmed for their own safety.\n\nTeams were being pushed forward as fast as possible, more being required as the troops increased their distance from the railway.\n\nForms having previously arrived from Ottawa, Corps' were supplied as far as practicable, and all Paymasters fully instructed before leaving. Notwithstanding this, it was with great difficulty proper pay papers could be got. Large advances were constantly being asked for by Commanding Officers, without proper pay-lists; these were promptly met, until the sums got so large vouchers had to be insisted upon.\n\nField allowance to Officers was paid to all who applied, before they left for the front.\n\nThursday, 23rd.—The Governor-General's Body Guard, Lieut.-Colonel G. T. Denison, left by Canadian Pacific Railway, at 3 p.m., for Trey and Fort Qu'Appelle.\n\nThe 7th Battalion \"Fusiliers,\" Lieut.-Col. DeRay Williams, left at the same hour for Swift Current.\n\nA special messenger having arrived from Ottawa, this day, with maps for the Major-General Commanding, which were handed me to be forwarded, I entrusted them to the care of Lieut.-Col. Williams, with instructions to exercise great care and have them forwarded when he reached the trail, by the most safe and expeditious conveyance.\n\nThe 9th Battalion \"Voltigeurs,\" Lieut.-Col. G. Amyot, left for Swift Current at 6.30 p.m. The moving of so many Corps on one day was a great tax on the rolling stock of the Canadian Pacific Railway, which was met in a satisfactory manner. Mr. Egan, and other officials of the road, always showed great anxiety to render every possible assistance.\n\nQuite a number of sick from various Corps, had been placed in the hospital under the arrangements entered into by Dr. Roddick, Deputy Surgeon-General, Dr. James Kerr having been placed in charge, on or about the 14th inst., assisted by Dr. Mewburn, daily sick reports were sent to me regularly. The two latter Surgeons showed much zeal in the discharge of their respective duties. Later on, as the sick and wounded came from the west, Dr. Kerr was always ready either by day or night to superintend, when necessary, their removal from the railway depot. For his assistance to me, personally, I feel under a great obligation. During Dr. Roddick's stay in Winnipeg, he showed a great amount of energy in making the various medical arrangements which resulted so satisfactorily.\n\nFriday, 24th.—The Cavalry School Corps, Lieut. Col. J. F. Turnbull, and the Winnipeg Cavalry, Captain C. Knight, left by Canadian Pacific Railway, at 5 p.m., for Fort Qu'Appelle.\n\nThe Halifax Battalion is now the only corps in the city, from which all guards and fatigues are furnished, the latter being much required in assisting Lieut.-Col. Peebles, Superintendent of Stores, in packing and forwarding the many shipments which are being daily sent forward.\n\nMajor-General Laurie telegraphs for more ammunition for the Gatling guns. In response to my requisition the Deputy Minister of Militia telegraphed fifty thousand rounds ordered from New York, which arrived in due time, and was forwarded to destination. A quantity of boots sent to Supply Officer at Swift Current, for distribution as may be required.\n\nSaturday, 25th.—The news of the Battle of Fish Creek which took place yesterday, caused much excitement, which was added to as the various exaggerated reports were put into circulation. Telegrams enquiring about friends and relatives who were supposed to have been in action received from many parts of the country.\n\nI authorized the issue of twenty-five rifles and ammunition to the Winnipeg Police.\n\nThe Adjutant-General telegraphs for nominal rolls of the respective Corps on\nservice. Forms were prepared and sent with orders to the various commanders, now very much scattered. Postal arrangements so imperfect, much delay in mails must necessarily occur. Voluminous correspondence took place on this subject, resulting in a partial compliance with the order; the rolls being forwarded to the Adjutant-General as fast as received, copies always having been taken and retained.\n\nSunday, 26th.—The routine of garrison duty carried on. Excitement over the Battle of Fish Creek continues. Citizens anxious as to the safety of the city, and urge that more troops be sent.\n\nCorrespondence both by letter and telegram still very pressing, requiring night work to meet the demands.\n\nMonday, 27th.—A list sent by the Adjutant-General showing quantity of subsistence delivered to the respective Supply Officers, together with cash amounting to $16,100, with instructions to require each to render an account, was acted upon by writing to the parties who had become much scattered over the country. After considerable correspondence and delay, the greater number of the parties forwarded vouchers with cash to balance. In some instances the details were imperfect, but had to be accepted.\n\nAlarming rumors of anticipated attack on the city caused much anxiety.\n\nIn response to my request made when very ill, you were kind enough to send Lieut.-Col. E. A. Whitehead, of the Retired List, who reached Winnipeg on Saturday, and took over the Transport and Subsistence Branches today. The several departments had got into fair working order, and no change, to speak of, was necessary or made until about the 24th May, when Lieut.-Col. Whitehead entered into contracts to convey freight by the ton instead of by the day. The particulars of these transactions were dealt with in the report of the War Claims Commission, submitted on 25th February, 1886. Lieut.-Col. Whitehead always showed a desire to render me every assistance. His reports sent to you from time to time will, no doubt, have supplied you with the particulars of his several transactions.\n\nMy position of Deputy Adjutant-General necessitated my issuing large numbers of transport requisitions to various persons connected with the service, particularly invalids returning to their homes, and the various other duties connected with pay, clothing, and military stores, kept me fully occupied. Captain John Allen, Advising Officer, who had been so useful previously, was transferred to Lieut.-Col. Whitehead.\n\nTuesday, 28th.—Hon. Dr. Sullivan, Purveyor, left with medical stores for Swift Current, where a Hospital had been established.\n\nThe Director of Stores, Ottawa, advises me of a large consignment of Ammunition, Trousers and Boots.\n\nRepairs and addition to equipment of Halifax Battalion completed.\n\nWednesday, 29th.—The Halifax Battalion, Lieut.-Col. Jas. J. Bremner, left by Canadian Pacific Railway, at 4 p.m., for Swift Current.\n\nThe Major-General Commanding telegraphs, from Fish Creek, to have Sergeants, Helmets, Boots, &c., got ready for issue. There being none in store the Adjutant-General, Col. Powell, is advised accordingly, by telegraph.\n\nThe departure of the Halifax Battalion leaves the city without troops. Inspector Norman, North-West Mounted Police, with about ten recruits, quartered in Fort Osborne, is the only force available for the protection of the Magazine and military stores, which, having been gradually augmented, now constitute a large and valuable collection; consequently, much anxiety is felt for their safety, the rumors of the intended seizing of these stores and firing the city still being in circulation.\n\nThursday, 30th.—Major-General (now Maj. Gen. Sir Fred.) Middleton, K.C.M.G., C.B., telegraphs from Clarke's Crossing, to provide Chaplains with Camp equipage.\n\n\"If no available local force to guard magazine and stores, to retain Halifax Battalion (the Corps had moved the day before in compliance with previous orders).\"\n\n\"Send arms and ammunition to Shoal Lake, File Hills, Gretna and Virden,\" all of which were promptly attended to.\nLieut.-Col. Turnbull telegraphs, from Fort Qu'Appelle, \"File Hill Indians very uneasy;\" he is thinking of moving his command to Touchwood and urges Halifax Battalion to be sent in support.\n\nPrivate Achilles Blais, 9th Battalion \"Voltigeurs,\" who had been left in the Winnipeg Hospital, died today. Lieut.-Col. Lamontagne took charge of his effects and funeral; the latter took place the following day, to St. Boniface, where he was buried in the Roman Catholic Cemetery, the few soldiers in the city being in attendance. I have been informed friends in St. Boniface subsequently erected a fine monument to the memory of Blais.\n\nInquiries regarding killed, wounded and sick, continue to be made from many parts of the Eastern Provinces.\n\nTen thousand cigars, a present sent by Davis & Sons, of Montreal, for distribution among the troops, were divided and packed in quantities in proportion to the strength of the respective Corps, addressed to the different Commanding Officers, and shipped by Lieut.-Col. Lamontagne to Captain Swinford, Supply Officer at Qu'Appelle, for distribution, except a few packages which were retained for detached Corps; these were forwarded by Captain Morton. This liberal contribution was no doubt highly appreciated by the smokers, and speaks well for the forethought and liberality of the donors.\n\nIn connection with the foregoing, I have also great pleasure in bringing before your notice, the very liberal supply of tobacco (one and a-half pounds) presented to each Officer and man of the force, when leaving Winnipeg for the front. Although the quantity to each individual was not large, in the aggregate it amounted to several thousand pounds, showing the very liberal and patriotic spirit of the donors, Messrs. Geo. E. Tuckett & Son, Hamilton, Ontario.\n\nYesterday I arranged with some of the aldermen of the city to have about forty citizens mount guard at night over the Magazine and Military Stores at Fort Osborne, arms having been issued for the occasion and returned when the guard was withdrawn each morning. This guard was continued with reduced numbers until the Home Guard was armed, when the duty was performed by the latter which will be referred to hereafter.\n\nTwo hundred and sixty-eight telegrams and a large number of letters and returns had been received and answered to date.\n\nRev. Mr. Gordon, Chaplain 90th Battalion, left for the front today.\n\nI am now so broken down with overwork, the Doctors hold a consultation, and advise me for the second time to throw up all duties, but with the cheerful assistance of my Staff, I was enabled to struggle on, and overcome the difficulty.\n\nFriday, 1st May, and Saturday 2nd.—No troops in Winnipeg. Anxiety as to safety of City and Government stores continues. Various articles being prepared for shipment and forwarded as rapidly as possible.\n\nLieut.-Col. Macdonald and Major Guy proceeded to Qu'Appelle, to arrange with Lieut.-Col. Forrest regarding payments, and to gather information touching transport and supply. Mr. James Anderson accompanied, and remained to assist Lieut.-Col. Forrest.\n\nSunday, 3rd.—The Major-General Commanding authorized issue of 25 stand of arms, clothing and equipment to Major Boulton, for the increase of his Mounted Infantry, which are procured as quickly as possible and forwarded.\n\nLieut. H. C. Freer, \"B\" Company Infantry School Corps, left Winnipeg to join the staff of the Major-General Commanding.\n\nMonday, 4th.—News of Lieut.-Col. Otter's engagement with \"Poundmaker\" received.\n\nLieut. Blake arrived, with two car loads of comforts, sent by the citizens of Toronto, for the Queen's Own Rifles. He was given transport to Swift Current. Subsequently Mr. Morgis arrived with comforts, sent from the same source, for the 10th Royal Grenadiers and Infantry School Corps. He was given transport to Qu'Appelle, as you had previously instructed.\n\nTuesday, 5th.—Increased anxiety regarding the safety of Winnipeg. Your\ntelegram, \"Montreal Garrison Artillery will be sent,\" was received. In the meantime Inspector Norman, with a few police recruits and convalescent soldiers, undertook to guard Magazine and Military Stores.\n\nNominal Rolls of Corps were being copied and forwarded to the Adjutant-General and Deputy Minister, as rapidly as they could be obtained from Commanding Officers.\n\nWednesday, 6th.—At midnight of yesterday, I was waited upon by one gentleman of the city, accompanied by two prominent persons from a neighboring municipality, who reported great activity amongst those who were supposed sympathizers with the rebels, urging more protection for the City, which in their opinion was in imminent danger. After conversing for half an hour, I concluded these men were quite sincere in their belief as to the correctness of what they represented; but their information having been mostly all hearsay; I did not consider it altogether reliable, but of that character which ought not to be wholly disregarded. Consequently I consulted with Hon. Mr. Hamilton, Provincial Secretary and Mayor of the city. He had received such information through other sources, as to lead to the belief it was necessary to take precautions for immediate protection.\n\nDuring the day I received a requisition from His Honor the Lieutenant-Governor for 300 rifles and 3,000 rounds of ammunition, for the use of the Home Guard, which had previously been organized and formed into six companies. These stores were issued to Alderman Carruthers, who was in command, and a guard of fifty was detailed nightly for duty at Fort Osborne.\n\nThis action was reported to you and the Major-General Commanding. The latter had expressed his thanks to the citizens when the first guard, a few days previously, had been mounted.\n\nThe arming of so many men appeared to reassure the citizens and restore confidence. No doubt the moral effect on the lawless prevented them, had they such intention, from committing any overt act.\n\nThe remains of Lieut. Charles Swinford and Private A. W. Ferguson, of the 90th Battalion, the first wounded and subsequently died, and the other killed at Fish Creek, having been sent to their friends in Winnipeg, were buried today. His Honor the Lieutenant-Governor and his Ministers, all the military officers in the city, the Municipal Council, and many thousands of people, attended, thus sympathizing with the friends and showing respect to the deceased, who had sacrificed their lives assisting in the maintenance of law and order. All business was suspended, and the people appeared to be in deep mourning.\n\nMajor General Strange telegraphed, from Calgary, for a large quantity of ammunition and more Winchester rifles.\n\nMajor W. R. Bell, Transport Officer at Qu'Appelle, reported Indians raiding in neighborhood, and asked for arms and ammunition for protection of settlers.\n\nOwing to the heat which in some parts was becoming oppressive, officers commanding corps, were telegraphing for serge jackets and white helmets. There being none in store, Colonel Powell, Adjutant-General, was communicated with on the subject, and a few hundred immediately forwarded from Ottawa and Montreal.\n\nLieut.-Col. A. Fraser, 88th Battalion, reported himself, presenting a letter from the Deputy Minister of Militia and Defence, saying he had been sent to assist Lieut.-Col. Peebles, Superintendent of Stores at Winnipeg. He at once entered upon his duties.\n\nThe ordinary work of forwarding stores and supplies, making payments, receiving and answering telegrams and letters continued for the next three days.\n\nSunday, 10th.—Rumors of Major General (now Major-General Sir Fred.) Middleton's K.C.M.G., C.B., movements and fighting, at Batoche, began to get into circulation, causing much anxiety and desire for further information.\n\nThe Director of Stores advised me of shipment of gun ammunition in charge of the Montreal Brigade of Garrison Artillery.\nArms, Ammunition and Equipment, being shipped to Calgary on Major-General Strange's requisition.\n\nMonday, 11th.—Ramors were in circulation that two Gatling guns had been sent, by Rebel sympathizers, from St. Paul, United States, by rail, for some point on the southern border of the North-West Territories, with a view of having them hauled across country to Riel. A gentleman whose name I believe is Waterous, brought me the information, which had also been circulated in the American newspapers. Mr. H. G. McMicken kindly undertook to procure reliable information, which he did through one of the principal railway officials in St. Paul, who telegraphed no guns or ammunition had passed over any of the railways towards the point indicated, or for parties across the line.\n\nTuesday, 12th.—Major-General (now Major-General Sir Fred.) Middleton, K.C.M.G., C.B.; telegraphed he had ordered Lieut.-Col. O'Brien's Regiment to join him, and directed me to send the next Regiment that arrived to Troy, but before other Corps did arrive a change was made in their destination.\n\nNews of the continued fighting at Batoche, caused much anxiety and excitement among the citizens. Rumors of intended raids on the City, then without troops, continued; the only defense being a few mounted police recruits, convalescent soldiers, and the Home Guard.\n\nWednesday, 13th.—Lieut.-Col. Geo. T. Denison telegraphed from Humboldt: \"Will not be able to get answer from the General for two or three days regarding Montreal Garrison Artillery.\" This was in answer to a message sent the previous day, asking if this Corps should be sent on (it having been understood they were to garrison Winnipeg). Advice received saying several other Corps in the East were under orders for service, one of which could take the duty of the Artillery, should that Corps be sent to the front.\n\nCaptain Swinford telegraphed from Qu'Appelle: \"Lord Melgund says General Middleton requires Gatling Gun Ammunition and Beef to be sent across the country from there?\" This must have referred to requirements on or about the 8th, the day Lt.-Col. Lord Melgund left the Column, and as there appeared no doubt Gallagher & Co. had, by this time, reached the troops with his live cattle, which had left Winnipeg by rail about the 20th April, and as the Ammunition had been ordered from the east, it was not considered necessary to make any change in the existing shipments, which were going on as fast as possible.\n\nThe decisive victory of Major-General (now Major-General Sir Fred.) Middleton's, K.C.M.G., C.B., Column, at Batoche, after several days' fighting, which had kept people in anxiety, having been confirmed, caused a general feeling of satisfaction and relief.\n\nThe ugly rumors regarding the plundering of the Government Stores, burning the City and secret meetings of sympathizers, in outside quarters, gradually subsided, and a feeling of safety appeared to prevail.\n\nSergeant M. J. Feron started for Humboldt to discharge duties of Supply Officer.\n\nThursday, 14th.—Many telegrams received from various parts relating to Arms and Ammunition, which had generally been previously acted upon.\n\nInvalids who were now being discharged from Hospital, unfit for service, as they presented themselves, were provided with transport and subsistence allowance to cover the journey home, and in many cases advances on pay. This added much to the clerical work of the office, and required close attention to prevent complications in Regimental Paymasters' accounts.\n\nFriday, 15th.—News of \"Poundmaker's\" raid, and capture of a convoy, with teamsters, on the Battleford trail, with supplies for Lieut.-Col. Otter's Column, renewed much of the excitement which had been allayed by the success at Batoche, and created a fear that Otter's Column might be short of food before communication could be re-opened.\n\nA. R. McDougall, of Shoal Lake, telegraphed; Indians, and half-breeds in locality expected to rise, requesting a Company of Reserves might be placed on\nActive Service.—I recommended him to apply to the Hon. the Minister of Militia and Defence.\n\nSaturday, 16th.—News of the capture of the Rebel leader, Louis \"David\" Riel, yesterday, was received with expressions of gratification by the people.\n\nCommanders of Corps, urge issue of summer clothing and White Helmets.\n\nSunday, 17th.—The General Officer Commanding telegraphed from Guardupinis' Crossing, to hold all troops arriving at Winnipeg awaiting his orders.\n\nDonations of clothing, medicines, and comforts of various kinds, from many of the cities and towns in the Eastern Provinces, for the troops in the field, were arriving almost daily, and being forwarded to their destination.\n\nMonday, 18th.—Captain E. Palliser, proceeding to join Major-General Strange; Surgeon H. T. Corbett, proceeding to take charge of Base Hospital, Swift Current; Mr. Alex. McGibbon, Supply and Transport Officer, en route to Calgary, and Lieut. Francis Joseph Dixon, en route to join Major General Laurie, at Swift Current, left Winnipeg for their respective destinations.\n\nCaptain Swinford asks for blankets and tents, to be forwarded for use of Hospital Corps, previous supply having gone astray.\n\nThe Major-General Commanding telegraphed, to send Winchester rifles and ammunition to Major General Strange, all of which had previously been forwarded.\n\nTuesday, 19th.—Ordinary routine of making payments, answering telegrams and letters, and making various returns.\n\nWednesday, 20th.—The Montreal Brigade of Garrison Artillery, Lieut.-Col. W. R. Oswald, arrived, and went into camp near Fort Osborne; mounted guard over Magazine and Government Stores, and undertook the garrison duty of the city. Arrival reported to Major General Sir Fred. Middleton, K.C.M.G., C.B., at Prince Albert.\n\nIn consequence of the presence of this Corps, the following order was issued, relieving the Home Guard from further duty:\n\nBRIGADE OFFICE,\n\nWINNIPEG, 20th May, 1885.\n\nOn account of the arrival of the Montreal Brigade of Garrison Artillery, the City Guard, which has for some time been performing night duty at Fort Osborne, will be relieved.\n\nThe Major-General Commanding has already expressed his thanks, by telegraph, to the officers and men who have mounted guard so cheerfully during a period when there were no troops in the city, and the Deputy Adjutant-General (Lieut.-Col. Jackson) desires to express his thanks in like manner.\n\nE. LAMONTAGNE, Lieut. Col.,\nActing Brigade Major.\n\nIn answer to your telegram, I sent distribution of the various corps on service. I also answered your anxious inquiries regarding the reported murder of Mrs. Delaney and Mrs. Gowanlock, who were taken prisoners by \"Big Bear\" at the time of the Frog Lake massacre.\n\nThursday, 21st.—I received from the Deputy of the Minister of Militia and Defence a list, showing sums advanced to fifty-two persons connected with the Military, Medical and telegraph Services, and contractors for supplies, amounting to $728,917.94, with the following instructions:\n\nDEPARTMENT OF MILITIA AND DEFENCE,\n\nOTTAWA, 16th May, 1885.\n\nLieut.-Col. W. H. JACKSON,\nPrincipal Supply Officer,\nWinnipeg, Man.\n\nI have the honor to forward herewith, a statement of all cash advances up to the 11th instant inclusive, which have been made by this department to Supply\nOfficers, Medical Staff and other Officers, ordered on active service for the North-West Territories, also of payments made to the Hudson's Bay Co. for supplies, &c., all of which are to be accounted for to the Principal Supply and Pay Officer, Lieut. Col. W. H. Jackson, at Winnipeg.\n\nThe following instructions are transmitted for the guidance of that officer in the settlement of these and other similar accounts; copy of the same has been sent to the General Officer Commanding:\n\nINSTRUCTIONS.\n\nThe Regimental Supply Officers to be ordered to close their accounts, for all advances received from the Militia Department, for subsistence and transport of Militia Forces en route to the North-West Territories, and their unexpended balances are to be paid over to the credit of the Principal Supply Officer, Lieut. Col. W. H. Jackson, who will give receipts for the amounts.\n\nThe only expenditure chargeable against those advances will be, the necessary payments for subsistence, maintenance and transport of Militia Forces en route to the North-West Territories.\n\nAll claims for personal pay, or personal equipment, are to be deducted from the accounts, and unexpended balances must then be paid over as directed.\n\nSupply Officers who have been attached as Paymasters to the forces in the field, after having rendered these special accounts, will be allowed to carry the balances to their general accounts with the Principal Supply Officer.\n\nThe special accounts referred to, so soon as received, are to be forwarded to the Department of Militia and Defence at Ottawa.\n\nThe cash advances received by the Medical Staff, or individual officers, telegraph operators, or other employees, for personal expenses en route to the North-West Territories, are to be accounted for in the Pay-Lists of those officers or employees.\n\nThe advances are to be entered in the column of stoppages; the charges for transport and subsistence en route must be supported by vouchers, in duplicate, giving details.\n\nItems for personal equipment, or of expenditure not authorized by regulations, are to be deducted from these accounts, before payment is made of the balances, which may be due to these officers or employees.\n\nLieut.-Col. Jackson is now directed to call upon the Hudson's Bay Co. to render to him, their accounts in duplicate, for the transport, supplies, &c., furnished the Militia Forces. These accounts should be carefully examined and certified to by the proper officers, before they are forwarded to the Department of Militia and Defence. Please notify all concerned of these orders.\n\nC. EUG. PANET,\nDeputy Minister of Militia and Defence.\n\nThe several parties were at once notified. The settling of these advances entailed much correspondence and other work, extending from this date until close of operations, late in the autumn. With few exceptions, all were satisfactorily accounted for, the papers having been submitted from time to time for your consideration.\n\nFriday, 22nd.—There being no Surgeon available for service at Touchwood, at the request of Lieut.-Col Turnbull, Cavalry School Corps, Captain Heigham, who professed some knowledge of medicine, was provided with a quantity for both men and horses, and sent forward, to render such assistance as might be found practicable, in which capacity he served until the corps returned east.\n\nThe remains of Lieutenant Kippen, Corporal John Code, and Privates Fraser, Hardisty, and Watson, 90th Battalion, reached Winnipeg. In accordance with your instructions, the remains of Lieut. Kippen were forwarded to Perth, Ont., and Pte. Watson's to St. Catharines, Ont.\nNews received of Chief \"Poundmaker\" having delivered up teamsters whom he had captured with supply train, on the 14th, and offering to have a peaceful \"Pow-wow\" with the Officer-Commanding the troops at Battleford.\n\nSaturday, 23rd.—The Base Field Hospital was moved from Swift Current to Moose Jaw today, not on 23rd April, as stated in some previous reports.\n\nSunday, 24th.—The military funeral of the late Corporal J. B. B. Code, Privates Richard Hardisty and James Fraser, 90th Battalion, took place under the auspices of the Montreal Garrison Artillery, which turned out in full strength with Band. The Rev. Dr. Barolay, Chaplain of the latter Corps, officiating. This funeral was attended by many, the streets through which the mournful cortège passed were crowded with people, and the city was again thrown into deep mourning, similar to what took place when Lieut. Swinford and others were buried.\n\nMonday, 25th.—This was celebrated as the Queen's Birthday. I inspected the Montreal Brigade of Garrison Artillery, Lieut.-Col. Oswald, at 11.30 a.m. At twelve o'clock a feu de joie was fired in honor of the occasion, in presence of His Honor the Lieutenant-Governor and citizens. The Corps presented a fine soldierly appearance, and executed several movements with steadiness and precision.\n\nTuesday, 26th.—In compliance with an order received at 9.30 last night, from Major General Sir Fred. Middleton, K.C.M.G., C.B., Battleford, the Montreal Brigade of Garrison Artillery left Winnipeg for Regina, there to await further orders.\n\nThe remains of Lieut. W. Fitch and Private T. Moore, 10th Royal Grenadiers, were, in accordance with your instructions, forwarded to Toronto, Ontario, and those of Captain E. L. Brown, of Boulton's Mounted Infantry, to Peterborough, Ontario.\n\nWednesday, 27th.—Sergeant G. Strong and six men of the Midland Battalion, who had formed part of the escort with the prisoner Louis David Riel, from Batoche to Regina, arrived at Winnipeg, were quartered in Fort Osborne, and detailed to assist the few Mounted Police in guarding the Magazine and Government stores, also to go on fatigue in the stores when required by Lieut.-Col. Peebles. Invalids and convalescent soldiers who could not otherwise be provided for, or sent to their homes, were attached to this detachment for lodging and subsistence.\n\nNothing special occurred during remainder of May, except news of Major General Strange's attack on \"Big Bear,\" at Frenchman's Butte.\n\nStoves, chairs, clothing, &c., were forwarded to Hospital at Moose Jaw as requested by Major-General Laurie, or Purveyor the Hon. Dr. Sullivan.\n\nHelmets and other stores were issued to several Corps.\n\nMany invalids and Hospital dressers, who had been relieved from duty were provided with transport and subsistence money, to enable them to reach their homes, and various claims, now on the increase, were being settled as rapidly as possible.\n\nFour hundred and twenty-seven telegrams received, answered and acted upon to date, in addition to a great many letters.\n\nThursday, June 11th.—The ordinary work of supplying Corps' with clothing and other stores, and auditing of the Hudson's Bay Company's accounts, continued to date.\n\nDr. Almon, of Halifax, who had been discharging his duties as Inspector of Hospitals for some time at Winnipeg, received transport to enable him to return to Ottawa.\n\nTuesday, 16th.—As directed by you, the remains of Napoléon Carpenter, 65th Battalion, were forwarded to Montreal, Que.\n\nThursday, 18th.—The Yorkton Militia, Major T. C. Watson, paid off and relieved from further service.\n\nSpecial scouts employed by Major-General Laurie, and Lieut.-Col. Otter, for protection of supply trains, were demanding very large pay, which I declined to authorize, and referred the matter to the Major-General Commanding. Payment was subsequently made as he directed.\n\nThursday, July 2nd.—Dr. Henry Thomas Corbett, of the Field Hospital Corps,\nwho had been sent from Qu'Appelle to the Hospital at Winnipeg, having died, at 11:30 p.m., 29th June, was buried to-day. The officers of the Staff and the detachment of troops at Fort Osborne, attended the funeral, which took place to St. John's Cemetery. The Very Rev. J. Grisdale, B.D., Dean of Rupert's Land; having kindly given a burial plot, and also officiated at the funeral. I had previously appointed a Board to make an inventory of his effects, which were afterwards forwarded to his executrix, Miss Annie M. Corbett, Belleville, Ont., Dr. Corbett having made a will before his death.\n\nFriday, 3rd.—The remains of Private Hutchison, 90th Battalion, were forwarded to St. Thomas, Ont., as you had directed.\n\nSunday, 5th.—The remains of Private Wm. Ennis and George Victor Wheeler, of the 90th Battalion, were interred in St. John's Cemetery to-day.\n\nTuesday, 7th.—A list showing further advances made to eleven parties connected with the service (or contractors), amounting to $650,731.00, received from the Deputy Minister of Militia and Defence, with instructions to have the same accounted for and the necessary action taken. Subsequently the whole of these claims were settled, and reports forwarded for your information.\n\nSaturday, 11th.—I detailed Sergeant Strong and the six men of the Midland Battalion, who had been quartered for some time in Fort Osborne, as an escort to accompany the remains of their late lamented commander; Lieut.-Col. Arthur T. H. Williams to Port Hope, Ont., to report to Captain J. L. Reid, in charge at the depot.\n\nMajor-General Sir Fred. Middleton, K.C.M.G., C.B., with troops, now being en route by river and lake to Selkirk, and other corps having been ordered home, I made necessary arrangements for the payment of all. Lieut.-Col. Forrest, at Qu'Appelle, to pay Boulton's Mounted Infantry, French's Scouts, and other Mounted Corps, then en route from the north to Qu'Appelle. As soon as these were paid, he was to proceed to Calgary and be ready to pay the Alberta Mounted Rifles, and Steele's Scouts. It was important these payments should be made promptly, as any delay would add largely to the expense. Lieut.-Col. Forrest, after paying at Qu'Appelle, just reached Calgary in time to meet and pay the troops on arrival.\n\nIt having been understood the force with Major-General Sir Fred. Middleton, K.C.M.G., C.B., were to proceed east from Selkirk, I arranged with the Mayor of that town to have a large quantity of money in his safe, with which he kindly offered to cash official cheques, at par, thus enabling all to receive their pay, if so disposed.\n\nTuesday, 14th.—Major Guy accompanied me to Selkirk. The Registrar kindly placed his office at our disposal, and all arrangements were made for payment.\n\nWednesday, 15th.—The troops arrived during the forenoon of this day; when it was found only the Midland and 65th Battalions were to proceed east, from there, the remainder to go on to Winnipeg.\n\nThe Paymaster of the 65th Battalion having his pay-lists correctly prepared, was settled with in a few minutes, but the Officers preferred taking their cheques east to drawing the cash.\n\nThe papers of the Midland Battalion not being in a state for final settlement, Major, now Lieut.-Col. Smith; took a small advance of cash and awaited his arrival at the Corps headquarters, for settlement. Consequently, the Mayor's kindness in providing funds to meet cheques, resulted in considerable trouble and responsibility to himself, with little benefit to the troops, simply because they did not wish to be encumbered with, or take the responsibility of, carrying cash.\n\nThe remainder of the Corps, proceeded to Winnipeg; other Corps, had also commenced to arrive there from the west. During the night, exceedingly heavy rain commenced, and continued with slight intermission for several days, causing much discomfort and inconvenience to the Force, and necessitating the abandoning of the proposed review. All were settled with and paid during their stay, taking their departure for their respective headquarters as follows:\n\nThursday, 16th.—The Governor-General's Body-Guard (Cavalry), Lieut.-Col.\nGeorge T. Denison; the Halifax Battalion, Lieut.-Col. Bremner; the 9th Battalion \"Voltigeurs,\" Lieut. Col. Amyot.\n\nFriday, 17th.—York and Simcoe Battalion, Lieut.-Col. O'Brien.\n\nSunday, 19th.—Ottawa Company of Sharpshooters, Captain and Brevet-Major Todd; Montreal Brigade of Garrison Artillery, Lieut.-Col. Oswald; the Queen's Own Rifles, Lieut.-Col. Miller; 10th Battalion Royal Grenadiers, Lieut.-Col. Grasett.\n\nMonday, 20th.—Captain John Allen started to inspect supplies on the trails north of Qu'Appelle, in order that they might be secured and handed over to the Department of the Interior, Indian Department, or otherwise disposed of. Reports showing these transfers have been forwarded to the store branch for your information.\n\nTuesday, 21st.—7th Battalion \"Fusiliers,\" Lieut.-Col. DeRay Williams, departed for London, Ont.\n\nOn the 18th the remains of Privates Osgoode and Rodgers, of the Ottawa Sharpshooters, were forwarded to Ottawa, as you had directed.\n\nBetween the 24th and 29th.—The Winnipeg Infantry (now 95th Battalion), Lieut.-Col. Thos. Scott, was paid off, and the Companies forwarded to their respective headquarters.\n\nSunday, 26th.—The Cavalry School Corps, Lieut.-Col. Turnbull, reached Winnipeg from Touchwood Hills, and proceeded east, for Quebec, the same day.\n\nThis left the \"A\" and \"B\" Batteries Artillery, \"C\" Company Infantry School Corps, and Winnipeg Light Infantry, still on service. The latter Corps reached Winnipeg from Fort Pitt on the evening of 13th August, and went into camp; they were relieved from service on Monday, 24th August, during which period Lieut.-Col. Forrest had settled with and paid off the Battalion.\n\nFriday, 31st.—With a view of reducing the Staff to the minimum, I allowed Major Vaughan, in charge of Store Books, and Captain A. W. Morton, Orderly Officer and Secretary, to be relieved from further service. During the period they had proved themselves efficient and trustworthy Officers.\n\nAugust 1st to 20th.—Officers of various grades, telegraphers and other employees from out-stations, were presenting themselves for pay and transport, also many claims for equipment for several local Corps, which had been unsupported, were now being settled in accordance with the instructions of Major-General Sir Fred. Middleton, K.C.M.G., C.B.; but, in accordance with your instructions, all payments for teaming and freighting had been stopped, which caused considerable clamoring among claimants. Those from Calgary being the most pressing, and which covered others than for teaming, consequently it was thought advisable for Lieut.-Col. Whitehead and Major Guy to accompany me to Calgary and adjust such claims as were quite correct and reasonable, and which you had not otherwise directed.\n\nWhile en route on the 21st, I received your notice of appointment of the Commission to investigate and report upon claims.\n\nA number of persons were settled with while we were in Calgary, and we obtained such information as assisted subsequently.\n\nYou having now instructed me to submit for your approval all reports of the Commission before payment, we returned to Winnipeg on 3rd September.\n\nBefore leaving Calgary Lieut.-Col. Whitehead arranged with Major Hatton and Mr. J. K. Strachan to proceed over the trail north, to make inventory of stores at the various stations as far as Edmonton, Fort Saskatchewan and St. Albert, and hand them over, as had previously been arranged, to the North-West Mounted Police, the Department of the Interior, Indian Department, or otherwise secure them. The reports of these transactions have been forwarded to the Deputy Minister, or Director of Stores, for your information.\n\nThe trail from Calgary appears to have been a very expensive one in the way of waggon masters, herders, couriers and other employees, which were not considered necessary on other trails; but it should be remembered there was no telegraph line either north or south from this point.\nSeptember 7th.—The Commission had now settled down to their work in Winnipeg, the reports being forwarded to Ottawa daily for your consideration. Owing to the pressure for pay by the claimants, great exertions were put forth to meet their wishes, the work going on constantly until late at night, which did not cease even on Sundays.\n\nIn addition to the duties of the Commission, I was much pressed with various other matters connected with corps', or members thereof, claimants of various kinds, sick and wounded, supplies and pay to corps, still on service, &c., entailing an amount of labor which can only be understood by those who were actually engaged. In this I was ably assisted by Major Guy, Mr. E. B. Holt, Secretary of the Commission (who was indefatigable in his exertions) and Lieut. Francis Joseph Dixon, a graduate of the Royal Military College, who, on returning from duty on Major-General Laurie's staff at Moose Jaw, had reported at Winnipeg. Having found, after the departure of Captain Morton, it was impossible for me to get on without more assistance, about the 13th August I took on Mr. Dixon. He has proved himself a correct and painstaking officer, and by your special permission has continued with me up to the time of writing this report.\n\nMr. J. H. Metcalfe, auctioneer, whom you had instructed to dispose of surplus and unnecessary stores, horses, &c., continued paying to me proceeds of sales which were credited and shown in my monthly Accounts Current.\n\nWhen making the first payment on or about 7th August, Mr. Metcalfe reported he had, through error, paid some fifteen hundred and forty-one dollars and forty-eight cents, proceeds of sale of Hospital Supplies, to the Purveyor, Hon. Dr. Sullivan. It is presumed this money has been transferred to the credit of the Receiver-General in the usual way.\n\nOctober 20th.—\"C\" Company Infantry School Corps, Lieut.-Col. Otter, from Battleford arrived at Winnipeg.\n\nOn account of there being no boat for a few days from Port Arthur east, remained until 22nd, when they left for their headquarters, Toronto.\n\nHaving been informed of your intended visit to Winnipeg; and subsequently instructed to hold reports of Commission, pending your arrival, a large number quickly accumulated. You arrived on the 7th November, and remained until the 13th. During the period you considered reports covering many hundred claims, which represented a very large sum. The payment of those which received your approval, were executed with all despatch, and the Commission put forth great exertions to so far complete their work, as to be enabled with your sanction to close at Winnipeg on 7th December, to reassemble at Ottawa, where they continued in discharge of their duties until 28th February, 1886. The Preliminary Report submitted to you on 25th February, 1886, covered the proceedings up to that date.\n\nAs Principal Pay Officer, I approved payment of $9,974 claims.\n\nOf these payments were made by—\n\nStaff Paymaster Guy......................................................... 6,345\ndo do Forrest........................................................................... 629\n\nThese are exclusive of payments to the respective Corps, which were made by my instructions, under authority from Headquarters.\n\nSince the 25th February last, I have continued to act in my capacity as Chairman, and to submit to you for consideration from time to time, the various reports, herewith embodied, numbering 357, representing $975,686.61, (including $44,507.80 which have been reconsidered in accordance with your instructions,) from which $149,494.22 has been deducted or rejected, and the balance recommended for payment. There are also claims amounting to $29,518.99, which have not yet been reported upon. These have entailed a large amount of correspondence, but as yet the supporting vouchers are not sufficiently clear to warrant action. In the final adjustment of these, great care should be exercised, to guard the Department against excessive or duplicate charges. The duty has also devolved upon me as Chairman to answer all correspondence received from claimants and their attorneys, touching\nclaims or reductions, and information regarding correctness in a great many instances, has been obtained through voluminous correspondence with officers and others now in various parts of the Dominion, who were on service, and who knew something of the circumstances connected with the cases referred to them. All this has been going on from the commencement of the Commission, the work having largely increased during the period I have acted alone.\n\nTotal number of claims reported upon since the formation of the Commission, 1,559, representing $3,324,217.73, from which has been deducted or rejected, $408,522.85.\n\nIt would appear desirable the large number of books and papers connected with these transactions should be placed in charge of some person conversant therewith, or who would undertake to master the details. For a long time to come, answers to many references must necessarily be required, and duplicated or rejected claims would be liable to be paid unless they received the closest scrutiny of some one acquainted with the circumstances.\n\nIn addition to the officers previously mentioned, I feel it my duty to refer to the valuable services of Lieut.-Col. Peebles, Superintendent of Stores at Winnipeg, with whom I was in communication almost daily, from early morning until midnight. He was always found at his post pushing on the issues with the greatest rapidity.\n\nYour attention having been called to the names of the Superior Staff, in the report, from time to time, it is only necessary for me to submit the attached list of the names of the Subordinate Staff and employees who served in the Commissariat Office at Winnipeg, all of whom discharged the duties entrusted to them in a satisfactory manner. Without any disparagement to others, I would refer especially to the faithful services of Orderly Sergeant W. L. Bruce, who was ever at his post day and night, sleeping in his blankets on the office floor, which, added to the overwork in running on messages, was, in all probability, the cause of bringing on congestion of the lungs and typhoid fever, which has left him so enfeebled, he has not yet been able to earn a livelihood. I trust he will receive your favorable consideration.\n\nNORTH-WEST FORCES, 1885.\n\nMILITIA ON ACTIVE SERVICE.\n\nNominal Roll of the Subordinate Staff and Employees, who served in the Commissariat Offices, at Winnipeg, giving the capacities in which they served.\n\n| Rank and Name                  | Capacities in which they Served                                      |\n|-------------------------------|---------------------------------------------------------------------|\n| Mr. James K. Strachan        | Clerk to Major Guy, P.M. N.W.F.; subsequently S.O. at Edmonton.    |\n| Staff Sergt. M. Thos. Feron   | Departmental Clerk; subsequently S.O. at Humboldt.                  |\n| Staff Sergt. A. Kemey-Tynte   | S.O. Sergt. to Lieut.-Col. Macdonald, S.O., temporarily.            |\n| Staff Sergt. Chas. Potts,O.F.B| do do do Lamontagne, S.O.; subsequently Orderly.                   |\n| Staff Sergt. Francis Brown    | do Lieut. Bate, S.O. temporarily.                                   |\n| James Brown                   | Departmental Messenger, temporarily.                                |\n| Mr. J. W. Daly                | Clerk to Lieut.-Col. Whitehead, C.S. and T.O., temporarily,         |\n| Mr. C. H. Dancer              | do do in succession to Daly.                                        |\n| Mr. Neville Newton           | do do do Dancer.                                                    |\n| Mr. C. H. Maqon              | do do do Newton; served to finish.                                  |\n| Sergt. W. L. Bruce, W.L.I.    | Departmental Orderly Sergeant.                                      |\n| Private F. A. Cardow,W.L.I.   | Copyist, temporarily.                                               |\n| B. Carveth                    | Messenger and Telephone boy.                                        |\n\nW. H. JACKSON, Lieut.-Col., D.A.G.\nP.S., P. and T. Officer.\nThe expenditure in connection with the suppression of the Rebellion may be considered large by some, but the first few months of all wars cost very much more than for subsequent similar periods, when all have got into proper working order.\n\nThe enormous extent of uninhabited country over which sufficient supplies had to be hauled for 7,982 troops and teamsters, and 5,125 horses and oxen, together with considerable quantities distributed amongst settlers from whom the Indians had taken their all, should be taken into consideration.\n\nThe Canadian Pacific Railway was of great assistance, but after leaving that road the waggon trails were as follows:\n\n- From Qu'Appelle to Fort Pitt, via Clarke's Crossing and Battleford, 376 miles.\n- Qu'Appelle to Prince Albert, via Clarke's Crossing, 279 miles.\n- Swift Current to Fort Pitt, via Battleford, 393 miles.\n- Calgary to Fort Pitt, via Edmonton, 398 miles.\n\nAnd still many miles north of Fort Pitt, when the troops under Major-General Sir Fred. Middleton, K.C.M.G., C.B., were in pursuit of \"Big Bear.\"\n\nTaking these difficulties into consideration, and the fact that owing to there being no provisions to be had in the large extent of country over which the forces were scattered, several Depots of Supplies had to be established, so as to ensure against the possibility of want, and the rapidity with which operations were pushed and brought to a termination (time being money), for the results obtained the sum ought not to be considered excessive. Credit should also be taken for the large quantities transferred at the close of operations to the North-West Mounted Police, Indian Department and Department of the Interior. Had the Campaign been prolonged the percentage of expenditure would have been reduced to the minimum by extending the first charges over the whole period. Great advantages also accrued to the business of the Dominion by restoring the country to its usual condition of peace in the shortest possible time, in addition to relieving the citizens from the grave anxiety which must necessarily exist in all countries during the continuance of internal or external war.\n\nI have the honor to be,\n\nSir,\n\nYour most obedient servant,\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nPrincipal Supply, Pay and Transport Officer of the North-West Force,\nand Chairman of War Claims Commission.\nINDEX TO NAMES AND CORPS, IN REPORT OF LIEUT.-COLONEL W. H. JACKSON, D.A.G., PRINCIPAL SUPPLY, PAY, AND TRANSPORT OFFICER NORTH-WEST FORCES, AND CHAIRMAN OF WAR CLAIMS COMMISSION.\n\n| Name | Page |\n|------|------|\n| \"A\" Battery, R.C.A. | 4, 8, 12, 32 |\n| Adjutant General | 3, 4, 8, 20, 21, 22, 23, 24, 26 |\n| \"Alberta,\" Steamer | 15 |\n| Alberta Field Force | 6 |\n| Alberta Mounted Rifles | 14, 31 |\n| Allen, John, Captain | 4, 8, 9, 11, 24, 32 |\n| Almon, Surgeon | 30 |\n| Amyot, Lieut.-Col. | 17, 23, 32 |\n| Anderson, James | 11, 25 |\n| Atwood, A.P., Lieut.-Col. | 9 |\n\n| Name | Page |\n|------|------|\n| Baldwin, Surgeon | 22 |\n| Barclay, Rev. Dr. | 30 |\n| \"Baroness,\" Steamer | 15 |\n| Barges | 15 |\n| Base Field Hospital | 30 |\n| Bate, H. G., Lieut. | 9, 17 |\n| Battleford Home Guard | 14 |\n| do Rifle Co. | 14 |\n| \"B\" Battery, R.C.A. | 4, 8, 12, 32 |\n| Boll, W. R., Major | 17, 26 |\n| Benson, John | 11 |\n| \"Big Bear\" | 30 |\n| Birtle Company | 14 |\n| Blais, Achilles, Pte. | 25 |\n| Blake, Hume, Lieut. | 25 |\n| Boulton, Major | 25 |\n| Boulton's Mounted Infantry | 14, 25, 31 |\n| Bremner, Lieut.-Col. | 22, 24, 32 |\n| Broadview Militia | 6 |\n| Brown, E. L., Capt. | 30 |\n| do Sergt. | 8 |\n| do F. do | 34 |\n| do James | 34 |\n| Bruce, W. L., Sergt. | 34 |\n\n| Name | Page |\n|------|------|\n| Canadian Pacific Railway | 8 |\n| Cardew, F. A., Pte. | 34 |\n| Carpenter, Nap. | 30 |\n| Carruthers, Alderman | 26 |\n| Carveth, B. | 34 |\n| Cavalry School Corps | 6, 12, 21, 22, 23, 32 |\n| \"C\" Co., Infantry School Corps | 9, 12, 25, 32, 33 |\n| Name                                      | Page |\n|-------------------------------------------|------|\n| Chaplains                                 | 22   |\n| Code, John B.B., Corporal                 | 29, 30 |\n| Commisariat Corps                         | 15, 16 |\n| Commissioner H. B. Co                     | 4, 19 |\n| Commission, War Claims                    | 10, 32, 33 |\n| Corbett, A. M., Miss                     | 31   |\n| do H.T., Surgeon                          | 28, 30 |\n| Corps                                     | 13, 16 |\n| Couriers                                  | 15, 16 |\n| Daly, J. W.                               | 34   |\n| Dancer, C. H.                             | 34   |\n| Davis & Sons                              | 25   |\n| Delaney, Mrs.                             | 28   |\n| Denison, G. T., Lieut.-Col.               | 19, 20, 23, 27, 32 |\n| Dennis, J. S., Capt.                     | 17   |\n| Deputy Adjutant General                   | 8, 9, 24 |\n| Deputy Minister                           | 4, 19, 21, 23, 26, 28, 29, 31, 32 |\n| Dewdney, Lieut.-Governor                  | 4, 19 |\n| Director-of Stores                        | 24, 26, 32 |\n| Dixon, F. Joseph, Staff-Lieut.            | 28, 33 |\n| D. L. S. Intelligence Corps                | 4, 6, 12, 17 |\n| Egan, Mr.                                 | 23   |\n| Ennis, Wm., Pte                           | 31   |\n| Ferguson, A. N., Pte                      | 26   |\n| Feron, M. J., Sergt.                      | 8, 27, 34 |\n| File Hills Home Guard                     | 7, 24 |\n| Fitoh, W., Lieut.                         | 30   |\n| Forrest, W. H., Lieut.-Col.               | 11, 19, 31, 32, 33 |\n| Fort Qu'Appelle Home Guard                | 7    |\n| Fraser, A., Lieut.-Col.                   | 26   |\n| do Pte                                    | 29, 30 |\n| Freer, H. C., Lieut.                      | 25   |\n| French's Scouts                           | 14, 31 |\n| Gallagher & Co                           | 20   |\n| Gardiner, Sergt.                          | 9    |\n| Gatling Guns                              | 6, 9, 12 |\n| Gordon, Mr., Rev.                         | 25   |\n| Governor General's Body Guard             | 6, 12, 19, 20, 22, 23, 31 |\n| Gowenlock, Mrs.                           | 28   |\n| Grasett, Lieut.-Col.                      | 10, 32 |\n| Grenfell Militia                          | 6    |\n| Gretna Home Guard                         | 7, 24 |\n| Grisdale, J., Very Rev.                   | 31   |\n| Gay, George, Major                        | 10, 19, 25, 31, 32, 33 |\n| Name                                      | Page |\n|-------------------------------------------|------|\n| Halifax Battalion                         | 8, 14, 24, 25, 26, 34 |\n| Hamilton, Mr., Hon.                       | 28   |\n| Hurdisty, Pte.                            | 31, 32 |\n| Hatton, Major                             | 34   |\n| Heigham, H., Capt.                        | 23, 31 |\n| Herders                                   | 17, 18 |\n| Holt, E. B.                               | 35   |\n| Hospital and Ambulance                    | 17, 18 |\n| Howard, A. L., Capt.                      | 12   |\n| Hudson's Bay Co.                          | 6, 10, 31, 32 |\n| Hudson, W., Capt.                         | 21, 24 |\n| Hutchison, Pte.                            | 33   |\n| Kerr, James, Surgeon-Major                | 25   |\n| Kippen, Lieut.                            | 31   |\n| Knight, Capt.                             | 26   |\n| Lamontagne, E., Lieut.-Col.               | 11, 12, 27, 30 |\n| Laurie, Major-General                     | 20, 24, 25, 32 |\n| Lieut.-Governor, His Honor                | 28, 32 |\n| Little, Mr., V. S.                        | 22   |\n| Macdonald, D. A., Lieut.-Col.             | 20, 27 |\n| Major General Commanding                  | 6, 10, 12, 13, 19, 20, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34 |\n| \"Marquis,\" Steamer                       | 17   |\n| Mason, Chas. H.                           | 36   |\n| Malgund, Lord, Lieut.-Col.                | 29   |\n| Metcalfe, J. H.                           | 35   |\n| Mewburn, Surgeon                          | 25   |\n| Montreal Brigade Garrison Artillery       | 8, 14, 28, 29, 30, 32, 34 |\n| Montizambert, Lieut.-Col.                 | 6, 10 |\n| Moore, T., Pte.                           | 32   |\n| Moose Jaw Militia                         | 8    |\n| do Mountain Scouts                        | 8, 13, 15, 20, 22, 24 |\n| Moosomin Home Guard                      | 9    |\n| Morton, A. W., Capt.                      | 7, 11, 27, 34, 35 |\n| Morris, Mr.                               | 27   |\n| Middleton, Fred, Sir, Major-General       | 6, 10, 12, 13, 19, 20, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34 |\n| Midland Battalion                         | 14, 20, 32, 33 |\n| Miller, A. A., Lieut.-Col.                | 12, 34 |\n| Minnedosa Home Guard                      | 9    |\n| \"Minnow,\" Steamer                         | 17   |\n| Miscellaneous                             | 17, 18 |\n| McDougall, A. R.                          | 29   |\n| McGibbon, A.                              | 30   |\n| McMicken, H. G.                           | 29   |\n| Name/Title | Pages |\n|------------|-------|\n| 9th Battalion | 14, 19, 24, 25, 27, 34 |\n| 90th do | 5, 15 |\n| 91st do | 8 |\n| Newton, N. | 36 |\n| Norman, F., Inspector | 6, 26, 28 |\n| \"Northcote,\" Steamer | 17 |\n| \"North-West,\" do | 17 |\n| \"Mounted Police\" | 9, 18, 26, 28 |\n| O'Brien, Lieut.-Col. | 19, 20, 29, 33, 34 |\n| Osgoode, Pte. | 34 |\n| Oswald, Lieut.-Col. | 30, 32, 34 |\n| Ottawa Co'y of Sharpshooters | 8, 12, 14, 34 |\n| Otter, W. D., Lieut.-Col. | 11, 27, 32, 35 |\n| Ouimet, do | 19 |\n| Palliser, E., Capt. | 30 |\n| Panet, Col. | 6, 21, 23, 25, 27, 30, 31, 33, 34 |\n| Paymasters | 10 |\n| Peebles, Lieut.-Col. | 6, 25, 32, 36 |\n| Potts, C., Sergt. | 36 |\n| \"Poundmaker\" | 27, 29 |\n| Powell; Walker, Col. | 5, 6, 10, 22, 23, 24, 25, 26, 28 |\n| Queen's Own Rifles | 11, 14, 27, 34 |\n| Recapitulation | 18 |\n| Regina Militia | 9 |\n| Reid, J. L., Capt. | 33 |\n| Riel, Louis \"David\" | 30 |\n| Rocky Mountain Rangers | 6, 8, 16 |\n| Roddick, T. G., Deputy Surgeon-General | 20, 25 |\n| Rodgers, Private | 34 |\n| Saskatoon Militia | 9 |\n| Scoble, T. C., Lieut.-Col. | 11 |\n| Scott, Thomas, do | 6, 21, 22, 34 |\n| Scouts | 16, 17, 18 |\n| Scows | 17 |\n| 7th Battalion | 8, 14, 21, 24, 25, 34 |\n| Topic                                                                 | Page |\n|----------------------------------------------------------------------|------|\n| Shell River Home Guard                                              | 9    |\n| Shoal Lake                                                           | 9, 26|\n| Short, Major                                                         | 10   |\n| 65th Battalion                                                       | 14, 19, 32, 33 |\n| Smith, Lieut.-Col.                                                   | 33   |\n| Smith, Osborne, Lieut.-Col.                                          | 5, 6, 21|\n| Special Constables                                                   | 16   |\n| Staff                                                                | 17, 18|\n| Stewart, John, Capt.                                                 | 6    |\n| St. Albert Mounted Rifles                                            | 16   |\n| Steele's Scouts                                                      | 16, 33|\n| Stores                                                               | 10   |\n| Strachan, J. K.                                                      | 12, 34, 36|\n| Strange, Major-General                                               | 7, 19, 21, 22, 24, 28, 29|\n| Strong, G. Sergt.                                                    | 32, 33|\n| Sullivan, Purveyor-General                                           | 20, 26, 32|\n| Supply Officers                                                      | 9, 10, 25|\n| Summerbary Militia                                                   | 8    |\n| Swinford, Chas., Lieut.                                              | 28, 32|\n| do H., Capt.                                                        | 27, 29, 30|\n| Telegraph Operators and Linemen                                     | 17, 18, 19|\n| 10th Battalion, R. G.                                                | 8, 12, 14, 27, 34|\n| Todd, Capt.                                                          | 12, 34|\n| Toronto Brigade                                                      | 8    |\n| Touchwood Home Guard                                                 | 9    |\n| do Militia                                                           | 9    |\n| Transport                                                            | 9, 10, 17, 18|\n| do Scouts                                                            | 16   |\n| Tuckett & Sons, Geo. E                                               | 27   |\n| Turnbull, Lieut.-Col.                                                | 23, 25, 27, 31, 34|\n| Turtle Mountain Home Guard                                           | 9    |\n| Tynte-Kemey's, A., Staff-Sergeant                                    | 36   |\n| Vaughan; J., Major                                                   | 19, 34|\n| Virden Home Guard                                                    | 9    |\n| do Militia                                                           | 8, 26|\n| War claims commission                                                | 12, 34, 35|\n| Waterous, Mr.                                                        | 29   |\n| Watson, Pte.                                                         | 31   |\n| do T. C., Major                                                      | 11, 32|\n| Wheeler, Geo., Pte.                                                  | 33   |\n| White, G. W. R., Capt.                                               | 13, 22, 24|\n| Whitehead, E. A., Lieut.-Col.                                        | 26, 34|\n| Williams, A. T. H., do                                               | 20, 33|\n| do De Ray                                                            | 21, 25, 34|\nW\n\nWinnipeg, Cavalry .......................................................... 6, 8, 15, 24, 25\ndo Field Battery ............................................................ 5, 15\ndo Home Guard ............................................................. 9, 28, 30\ndo Infantry ........................................................................ 5, 10, 15, 21, 22, 34\ndo Light Infantry .............................................................. 5, 6, 8, 11, 15, 18, 21, 34\ndo Police ........................................................................... 9, 25\n\nWoolsey, John .................................................................. 20\nWrigley, Mr ....................................................................... 21\nWright, J., Capt .................................................................. 19\ndo J. E ............................................................................... 21\n\nY\n\nYork and Simcoe Battalion .................................................. 8, 14, 19, 20, 29, 34\nYorkton Militia .................................................................... 9, 11, 16, 32\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001470.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 46, "total-input-tokens": 67804, "total-output-tokens": 29689, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 436, 2], [436, 436, 3], [436, 1567, 4], [1567, 1567, 5], [1567, 3657, 6], [3657, 6724, 7], [6724, 7497, 8], [7497, 13009, 9], [13009, 15060, 10], [15060, 17980, 11], [17980, 21055, 12], [21055, 24189, 13], [24189, 26190, 14], [26190, 28446, 15], [28446, 30717, 16], [30717, 32569, 17], [32569, 33965, 18], [33965, 35925, 19], [35925, 39743, 20], [39743, 43764, 21], [43764, 47793, 22], [47793, 51494, 23], [51494, 54558, 24], [54558, 58641, 25], [58641, 62534, 26], [62534, 66594, 27], [66594, 70539, 28], [70539, 74469, 29], [74469, 78476, 30], [78476, 81769, 31], [81769, 85388, 32], [85388, 89320, 33], [89320, 93468, 34], [93468, 97415, 35], [97415, 101573, 36], [101573, 105611, 37], [105611, 107956, 38], [107956, 107956, 39], [107956, 109487, 40], [109487, 112074, 41], [112074, 114698, 42], [114698, 115892, 43], [115892, 119684, 44], [119684, 120811, 45], [120811, 120811, 46]], "primary_language": ["None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, false, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]