[{"id": "bf23d5b127cb2dad21d58b2c9c81819a7292206f", "text": "THE\n\nCANADIAN NORTH-WEST.\n\nBY\n\nCAPTAIN WILLIAM CLARK.\n\nReprinted by Permission from the \"Canadian Gazette.\"\n\n1886.\nThe Canadian North-West.\n\nThe following paper on the Canadian North-West was read in the Conference Hall of the Colonial and Indian Exhibition on October 19th, 1886, by Captain William Clark, the Dominion Grain Inspector at Winnipeg, who was, during the course of the Exhibition, in charge of the Canadian Agricultural Court. Sir Philip Cunliffe Owen, the secretary to the Royal Commission, presided, and there was a good attendance. In introducing Captain Clark, the chairman said he felt it almost unnecessary for him to carry out that formal duty in so far as many of those present were concerned, inasmuch as Captain Clark's name might now be said to be a household word in the Exhibition. To others, however, he would point out that Captain Clark first went to Canada in 1876. Again in 1877 he paid a visit to the Dominion, and in 1880 he decided to make Canada the land of his adoption. Since that time the Captain has closely followed up everything connected with the development of \"New Canada,\" as the North-West might be called. That he (Captain Clark) had had exceptional opportunities was evidenced by the fact that he had for some time filled with satisfaction the position of Government Inspector of Grain for Manitoba and the North-West. Captain Clark was also a member of the Board of Agriculture for the Province of Manitoba, and editor of the leading farming journal of the country. The Government of Canada had sent Captain Clark to England to take charge of the agricultural interests of the Dominion at the Exhibition, and from personal observation he (Sir Philip) believed the selection had been a wise one. They would now have an opportunity of judging for themselves. Captain Clark then proceeded to read his paper, as follows:\n\nProbably no portion of the British Empire has, during the last decade, received more publicity as a field for colonization than that part of our Dominion known as the Canadian North-West. The almost boundless and practically untouched resources of that great territory have been the theme of every visitor, while newspapers and periodicals have vied with each other in pointing out the future possibilities of what was recently termed \"The Great Lone Land.\" Any one at all acquainted with the North-West can readily understand how inviting this subject has become—a subject which has called forth, in praise and in prophecy, the highest oratorical efforts of Lord Dufferin; which perhaps more than any other still engages the thoughts and affections of his immediate successor, Lord Lorne, and which,\nin a most marked degree, has enlisted the championship of the present Governor-General of Canada, the far-seeing and practical Marquis of Lansdowne.\n\nTravellers like Butler, Milton and Cheadle, or Palliser had already given to the outer world stories of the extraordinary resources of the Prairie Country. Macoun, Grant, Gordon, and other Canadians, added to this their important testimony, reports of the unusual fertility of the soil had already come from the Selkirk settlement at Kildonan, and from the scattered adventurers who had braved the difficulties of the long trails which led the way into that attractive field; but it was not until the soldiers of Wolseley reached the Red River to stamp out the first Half-breed rebellion that settlement fairly began to develop. Until that time the Canadian North-West was practically the hunting ground of the Red man and the preserve of the Hudson Bay Company.\n\nFollowing upon the events of 1870 an arrangement was effected, whereby the North-West was transferred to the Dominion Government, the Province of Manitoba was constituted, and the country thrown open for settlement. The spirit of enterprise invariably displayed by pioneers speedily brought the district round Fort Garry into notice, many of the best men of Wolseley's battalions cast in their lot with the country, giving impetus to every enterprise to an extent which will forever associate their names with its early history. With limited facilities for communication on the Red River in summer, and by difficult trails in winter, the settlement made steady progress. Old Fort Garry changed its name to Winnipeg, the foundations of an important commercial centre were laid, and the wondrous adaptability of the country for successful agriculture established beyond a doubt. The subsequent completion of the Minneapolis and Manitoba Railway through Minnesota provided an easy means of access to the Canadian prairies, and from that time the rate of progress has been nothing short of marvellous.\n\nIt is noteworthy in this connection, that the men who took hold of and completed the railway through Minnesota, were Sir George Stephen and Sir Donald Smith, men whose public spirit Canada will ever gratefully acknowledge, and whose liberality towards the establishment of a permanent Colonial and Indian Institute all will heartily recognize; the men who, having completed for the time being the easiest route into the North-West, have not rested till they have been able to give Canada a railway from ocean to ocean. The Canadian Pacific will be their memorial to all time; their well-earned titles, the recognition of their Sovereign for the services they have rendered to the British Empire.\n\nThe geographical position of Manitoba is worthy of note. It is situated half-way between the Gulf of Mexico and the Arctic Ocean, and midway between the Atlantic and the Pacific. Manitoba has been called \"the bull's-eye of the Dominion;\" it might truly be called \"the bull's-eye of the North American Continent,\" and we might carry the rifleman's simile farther and predict that the agriculturist who hits that part of the western target will score the largest number of points and win the biggest prize.\n\nThe Province of Manitoba contains eighty millions of acres of what is acknowledged to be the finest agricultural land in the world. The greater part of this area offers no impediment to cultivation, being open prairie\nready for the plough. It is interspersed by numerous streams and lakes, the banks of which are fringed with woods of various kinds, while bluffs of timber dot the prairie at frequent intervals. The bottom land of the Red River, or first prairie steppe, which comprises the greater portion of the Province, is of unexcelled fertility. It is a rich black mould, an accumulation for centuries of decomposed vegetable and animal matter, varying from two to four feet in depth, and practically inexhaustible.\n\nThe first steppe, which, on the average, is about 800 feet above the level of the sea, begins about 70 miles east of the Red River, and terminates at the Pembina Mountains on the boundary line, running in a north-westerly direction through the Riding Mountain country. The second prairie steppe, which rises to 1,600 feet on its western boundary, begins on this alignment, and runs as far west as Moosejaw on the Canadian Pacific Railway, following the same direction from south-east to north-west. The soil of the second plateau is somewhat lighter than the first, easier to work, and very fertile; but it will not generally bear the continuous cropping without manure which the bottom lands are capable of. A large portion of this area may be described as rolling prairie of the very best kind, diversified by lakes and rivers, and in many places beautifully sheltered with trees, affording the perfection of location for mixed farming. Under this system, which is the safest of all kinds to follow, the land of this level will never require artificial manures, as the products of the farm will fully suffice to keep it in the highest state of fertility.\n\nThe third steppe, which has an average elevation of 2,000 feet, runs westward to the foot-hills of the Rocky Mountains in the district of Alberta, and rises to a height of 3,200 feet at its western limit in the vicinity of Calgary. This region embraces the already famous ranche district, with Fort Macleod as its centre, where the most encouraging success is being had in the rearing of horses, cattle, and sheep, who, on account of the salubrity of the climate, winter in the open air. It was generally believed that on account of its altitude, the third steppe would only be suitable for stock raising. The Railway Company, however, believed in its suitability for the growth of cereals. To prove this, a few years ago the Land Commissioner of the Canadian Pacific had experimental farms established at ten points on the line between Moosejaw and Calgary. The results of the operations, which were eminently satisfactory, have been published, and establish the claim of the far west to rank as a grain-producing district, and it is noteworthy that the finest sample of wheat shown in Winnipeg of the crop of 1884, was grown on the experimental farm of Dunmore, 2,406 feet above the level of the sea.\n\nThe enormous area thus described may be better realised when it is taken into account that the Province of Manitoba contains 123,200 square miles, the district of Assiniboia 95,000 square miles, that of Alberta 100,000 square miles, and Saskatchewan 114,000 square miles, while stretching away north-west along the eastern slope of the Rocky Mountains, and north of the great Saskatchewan, lies the district of Athabasca with an area of 122,000 square miles, including in it the famous Peace River country, which all authorities declare to be in the wealth of its undeveloped resources a most favourite portion of our western heritage.\nTo those accustomed to measure distances by the journey from Land's End to John O'Groats, it becomes exceedingly difficult to realise that on that Western Continent the British flag floats over a territory compared with which the areas of the greatest Empires in Europe dwindle into mere provinces—a territory not only wonderful in extent, but fertile beyond belief, blessed with all the natural advantages which constitute the foundation for future greatness, a land ready to receive and to feed a population larger by far than that of the British Isles, and capable of perfecting a manhood which shall show the highest development of the Anglo-Saxon race.\n\nThe extraordinary progress of the North-West has been due in a great measure to the means of communication afforded by the Canadian Pacific Railway. Six years ago the railway crossed the Red River—at that time there was practically no settlement to be found west of Winnipeg, except the outlying posts of the Hudson Bay Company along the various river-banks which, on account of the convenience of getting supplies, had drawn Colonists to the points occupied. Of these, Portage-la-Prairie was the only point touched by the projected line. Westwards, scarcely a shanty was to be found on that prairie stretch, but with the progress of the railway towns and villages sprang up as if by magic. Brandon, at the crossing of the Assiniboine, was christened on the location of the railway station there, growing in two years to be a town of nearly 3,000 inhabitants. Other places sprang up, keeping pace with the railway on its course, and the names of Broadview, Qu'Appelle, Regina, Moosejaw, Medicine Hat, and Calgary, besides those of lesser note, have become so familiar to the residents of the North-West that it is difficult to remember that these are but the growth of yesterday. Farming lands along the line were eagerly taken up as the work of railroad construction progressed, many adventurers going ahead of the line in the hope of securing homesteads near which stations might be located; till now, around every station as far west as Moosejaw, 400 miles west of Winnipeg, farming operators are in full swing. What occurred along the main line has repeated itself along the branches, and the same results are seen on the extensions of the Canadian Pacific Railway South-Western, and the Manitoba South-Western, the Stonewall, Selkirk, and Emerson branches, as well as along the line of the Manitoba and North-Western, which is steadily heading its way through a beautifully diversified country to the old settlement of Prince Albert, at the junction of the North and South Saskatchewan.\n\nIn 1880 the quantity of grain produced in the Canadian North-West was barely sufficient for the wants of the population. At that time not a single Grain Elevator had been erected. The milling capacity of Winnipeg consisted of two mills, each with four run of stones, and these with a few Grist Mills, hardly worth the name, scattered along the river settlements, constituted the whole milling power of the country.\n\nNow, besides supplying the wants of a greatly increased population, upwards of five millions of bushels of wheat of this season's crop are available for export; a small quantity when British wants are considered, but a quantity sufficiently striking to show the rate of agricultural progress during the short space of six years. Elevators for the economical handling and storage of the cereal crops, can now be seen rearing their lofty heads at every important railway station, and\nat Fort William on Thunder Bay the Canadian Pacific Railway Company have erected an elevator—the largest and best equipped on the American continent, and capable of storing 1,200,000 bushels of grain. Now splendidly built mills, furnished with the latest roller process machinery, can be counted by the dozen throughout Manitoba and the territories, while Winnipeg can boast of three flouring mills which in point of excellence of machinery will compare with anything in Buda-Pesth or Minneapolis. The mills of the Hudson Bay Company and the Messrs. McMillan have each a capacity of 350 barrels of flour per day, while that of the Ogilvie Milling Company is capable of turning out 700 barrels daily. Besides these specially confined to the manufacture of flour, Nairn's Oatmeal Mills are kept busy in the manufacture of another indispensable staple, and the linseed crushing mills of Body and Noakes, devoted to the manufacture of linseed oil and oil cake, show that attention is being paid to another industry which shall yet attain large proportions in the Canadian North-West.\n\nThe city of Winnipeg affords an excellent example of the progress of the country. With the advent of the railway, the city speedily began to put on a look of permanency. Important buildings of brick and stone took the place of the temporary wooden structures which mark the early years of all western towns. Improvements have gone on steadily, and population has increased till now it has become a city of about 30,000 inhabitants, having public and private buildings which would do credit to any of the older cities in the Dominion. There is no finer thoroughfare in any Canadian city than in Main Street; the business premises of its wholesale and retail merchants are the admiration of every visitor—mills, foundries, and workshops show the industrial side of the city life. Postal, telegraph, banking, and insurance facilities meet the requirements of commerce in these particulars. Its markets are stocked to repletion with every necessary of life, while luxuries and goods as fine as can be obtained in any English city are at the disposal of the purchaser. The latest news of the world is supplied by three daily newspapers; gas, electricity, water, tramway cars, and other amenities of civilisation adding greatly to the comfort of the citizens.\n\nChurches and educational institutions exhibit another feature of the city's life. Every leading denomination is represented by substantially-built edifices, some of great architectural beauty; the pulpits are filled by men of marked ability and earnestness, whose anxieties are not confined to the flocks under their charge, but who labour hard in order that opportunities for religious observance may keep pace with western settlement.\n\nThe schools are substantially built and thoroughly equipped. From thirty enrolled pupils in 1871, the number has increased to 2,300, taught by a staff of forty-five highly-qualified teachers. Regarding the free education received at these institutions the latest official report says, \"Its schools are, at the present time, acknowledged to be equal in efficiency and equipment to those of any city of its size on the American continent.\"\n\nWinnipeg has many attractions as a social centre. This might well be doubted considering its recent growth; but it must be kept in mind that the inhabitants are largely composed of persons and families accustomed to the routine of the best towns in Canada and the British Isles. They have brought\nwith them not only the energy and the enterprise which forms the backbone of Colonial life, but they have brought their ability to take part in and enjoy outdoor amusements, as well as the accomplishments which render home so attractive and enjoyable. The result is that all new-comers speedily find themselves in accord with their new surroundings, receiving, as they invariably do, a hearty welcome to a new country, which combines in a marked degree the attractions of Canadian and English everyday life.\n\nIn a community largely composed of young men, Masonic and other kindred societies occupy an important place. The National Societies of St. George, St. Patrick, and St. Andrew, each with a large membership, perform an important work in keeping alive all it is best to cherish, encouraging Englishmen, Irishmen, and Scotchmen, to emulate the best example of the land of their nativity in working out the destiny of the land of their adoption. Should necessitous cases occur, these societies are ever ready with a helping hand, and they are particularly careful of the interests of newcomers. A clause in the constitution of the St. Andrew's Society, defining the duties of one of the standing committees, reads as follows:—\"They shall also attend to the introduction of strangers, and look after Scottish immigrants arriving from Scotland and other parts of the world; give them such counsel and advice as they may require, and generally look after their interests, should they desire to settle in our midst.\" As president of that Society, I am pleased to state that this part of the Society's work has been in the highest degree helpful to new-comers, whatever may have been the purpose of their visit.\n\nWhat applies to the city of Winnipeg as thus briefly sketched is applicable to every town and settlement in the North-West in proportion to its importance. Colonists work hard and earnestly, as with a purpose to succeed, but interspersed with it all in proper season we find recreations of all kinds more than sufficient to satisfy those whose purpose it is to make life in the Colonies successful as well as pleasant.\n\nThe reasons for the growth of the Canadian North-West lie primarily in its suitability as a field for agricultural enterprise. It is, therefore, well to gather some facts from practical experience to prove how inviting the field is for those who may purpose pushing their fortunes in one or other of the Colonies of the Empire.\n\nFor ages countless herds of buffalo and other wild animals have roamed over this vast stretch, feeding on the nutritious grasses which grow there in such luxuriance. Myriads of birds have likewise made this isolated tract their resting-place. Their droppings and carcases have for centuries mingled with the rotting vegetation of each year to make up for the farmer of the present day a soil capable of producing to perfection the cereals, root crops, and grasses, which form the staple food of man and beast.\n\nThe testimony of experts, like Sir John Bennett Lawes and Professor Gilbert, and the published analytical reports of Dr. Stevenson Macadam, of Edinburgh, and Professor Emmerling, of Kiel, go to confirm the high opinion formed of the wonderful fertility of the North-West Prairie. In connection with the analysis of the latter, Senator Klotz, of Kiel, writes as follows: \"Annexed I give you an analysis of the most productive soils of Holstein, whereby you will see how exceed-\ningly rich in productive qualities the Manitoba soils are, and which fully explains the fact that the land of Manitoba is so very fertile even without manure. The chief nutriments are first nitrogen, then potash and phosphoric acid, which predominate there; but what is of particular importance is the lime contained in the soil whereby the nitrogen is set free and ready to be absorbed in vegetable organism. According to the analysis of Manitoba soil there is no doubt that, to the farmer who desires to select for his future home a country which has the most productive soil and promises the richest harvest, no country in the world offers greater attractions than the Province of Manitoba, in the Dominion of Canada.\"\n\nAnother important matter is the question of climate. Injudicious friends have been to blame in showing the winter climate in a milder light than is in accordance with facts, but the enemies of the North-West and the Agents of rival fields, have never ceased to paint, with marvellous ingenuity, exaggerated pictures of blizzards, snow, and ice, compared with which the records of Siberian or Arctic exploration appear almost in the light of tropical adventure. \"The climate, like everything else in the North-West, only requires that the truth be told. It is not necessary to make it better or worse than it is. No country is without its advantages, none without its drawbacks; and if the winter climate of the North-West is to be reckoned among the latter, it must be kept in mind that it is largely responsible for the many advantages which the country claims as a field for successful agriculture. The important part which winter plays can scarcely be over-estimated. Professor Fream, in speaking of this, says:—\"The frost which locks up the land for months in winter is really a serviceable friend to the prairie farmer. The moisture which permeates the soil expands in the act of freezing, and this causes a minute separation or disruption among the particles of ploughed earth, so that when the thaw comes they fall apart in a desirable state of tilth, which it is well-nigh impossible to bring about by the work of any agricultural implement. Frost is a good friend to the farmer, and one that works without pay. At home, a winter without frost is regarded by farmers of arable land, particularly of heavy clay soils, as a misfortune; they know well that it means much extra work on their fallow lands for both men and horses, and that with all their pains they cannot produce so effective a result as the frost is capable of bringing about.\" Thus winter works for the prairie farmer, not at intermittent times as in England, but year by year pulverising the earth so that the ordinary seed-bed of the prairie equals that of the finest flower garden, and while this process is going on the land enjoys absolute rest. The severity of the cold prevents vegetation from exhausting the soil. Winter is a period of recuperation. The balmy air of spring awakens the land like a giant from his long sleep strengthened to accomplish the work of the coming season.\n\nThat the climate is extreme does not admit of doubt. So warm in summer that the thermometer will stand for days at ninety degrees in the shade, so cold in winter that it will go down to forty degrees, and, in isolated cases, to fifty degrees below zero. The average Britisher can understand ninety degrees in the shade, and endeavours to exist when\nsuch a temperature visits his island home, but he freezes in feeling to a miniature iceberg the moment he contemplates the lowest winter readings in the Canadian North-West. He cannot understand, and never will until he has proved it, that these thermometrical readings, which mean misery and death in the moist atmosphere of the British Isles, are consistent with rude health and tireless energy in the dry clear air of the prairie. Accustomed to a climate where clouds are the rule, he cannot realise a land where, with scarcely an exception, every summer day from dawn to gloaming revels in unclouded light; where winter, holding the earth for months in his frosty grip, floods its snowy covering with constant sunshine, and where the moon, \"walking in brightness,\" sheds a lustre so clear that, almost unperceived, the glorious winter day glides into the more glorious winter night.\n\nThe climate so beneficial to growth is in the highest degree healthful. Probably it has not its superior anywhere. No healthier population can be seen, and instances can be multiplied to show the benefit that settlers have received from having made the North-West their home. The climate may be extreme, but being healthy, it should claim the first consideration in the mind of the intending Colonist. It is only uttering a truism to speak of health as a prime condition of existence. With robust health the battle of life is more than half won—without it success practically becomes failure.\n\nThe recent North-West campaign, undertaken to suppress the Half-breed and Indian uprising, afforded valuable evidence in favour of the climate. My own corps, the 90th Winnipeg Rifles, was suddenly ordered, on the 23rd of March last year, to proceed by rail to Qu'Appelle Station. On the arrival of General Middleton at that point a few days later, the march to the scene of the disturbance began, going by way of Fort Qu'Appelle, Touchwood Hills, the Salt Plains, and Humboldt, to the South Saskatchewan. From the every-day comforts of city life, the change to the hardships of a march at that season was such as might have told seriously on the health of the men. The marches were long and rapid, the camp at eventide was often pitched in snow-storms, the cold at night was severe, on one occasion falling to 15° below zero. We lived on soldiers' fare, marching through melting snow and swollen streams, growing stronger and cheerier as the task progressed, the marching chorus sounding loudest at the crossing of the deepest pools, till reaching the banks of the South Saskatchewan we rested a while—a bronzed and hardy corps, every man fit for duty—not a man in hospital.\n\nThe healthfulness of the climate so apparent on the march was further illustrated in the experience of the field hospital after the engagements of \"Fish Creek\" and \"Batoche.\" Men who were slightly wounded were scarcely invalided, and recovered with amazing rapidity. Many severe cases, which the surgeons declared would have been hopeless in ordinary hospital experience, were successfully treated, and not a few who were reported from the field as fatally wounded are alive and well to-day. Need I say that personally I rejoice in being able to stand here to testify to the surgical skill of our hospital staff, and the curative and recuperative powers of the climate of the Canadian North-West?\n\nThe question of soil and climate naturally leads on to the consideration\nof the staples these elements produce. First among these we may take the ordinary range of cereal crops, and of these wheat claims the premier place. The excellence of any product depends upon fertility of soil and suitability of climate, and it is an axiom that all products attain their greatest perfection the nearer they reach the most northerly limit of their growth. These combinations account for the excellence of the wheat grown in the Canadian North-West. The most valuable wheat belongs to what is known as the hard class. It is particularly rich in albuminoids, and is of that flinty nature which best suits the modern process of gradual reduction by rollers, which system, by keeping the granules intact, produces the finest quality of flour. Flour manufactured on this system from hard wheats always commands the highest price in the market, and wheat of this class is consequently in great demand. Although the growth of wheat extends over wide areas of every continent, the kinds produced generally belong to the softer grades. Hard wheat in Europe is confined to the south of Russia and the district which supplies the mills of Hungary. This class of wheat is grown in the United States only in Minnesota and Dakota, and it is from this source of supply that the milling centre of Minneapolis has built up its world-wide reputation. The Hungarian and Minneapolis millers require almost all that is grown in their respective districts, and, to obtain an adequate supply, British grain merchants and millers are now looking to the Canadian North-West. The area there for the production of this class is practically unlimited, and though enough of an inferior kind can be produced in other fields to supply the wants of Great Britain, it is only reasonable that she will prefer the best, and that demand will keep pace with production till the North-West becomes the hard-wheat granary of the world.\n\nThe average yield of from 20 to 25 bushels per acre does not represent what the soil is capable of producing. The average is pulled down from the fact that a large percentage of those engaged in farming are novices at the business, and conduct their operations with little or no knowledge of husbandry. The yields of 35 to 40 bushels per acre which frequently occur as the result of intelligent farming, prove that with practical experience the average returns will increase to a point more in keeping with the capabilities of the soil.\n\nOats grow to great perfection; samples are frequently shown weighing from 46 to 48 lbs. per bushel. With good farming the yield runs from 60 to 70 bushels per acre, though the average is considerably less. The quality for milling purposes leaves nothing to be desired, the oatmeal manufactured in Manitoba being equal to the standard of the Scotch article.\n\nBarley has also proved itself to be an excellent crop. It yields on the average about 40 bushels to the acre, weighs heavy, and, on account of the usually favourable harvesting weather, is of bright colour and in much request among brewers. This cereal is not likely for some time to find its way to the British market, as the Lager beer breweries of the United States will require more than can be produced for years to come.\n\nFlax or linseed has been sown over a considerable area for a number of years. As it has as yet only been sown for the seed, the loss in fibre, which is usually burnt, has been considerable. The usual yields have been from 18 to 20 bushels per acre. It has always found a ready market at high\nprices, as the percentage of oil it contains is larger than that of any seed grown elsewhere in America. Attention is now being given to the value of the fibre, and there can be no doubt that, with the introduction of capital and machinery, a large revenue will accrue from this industry. If facilities are only afforded to farmers for the disposal of the fibre, it need not be many years before the British market is independent of Russia for the supply of this staple.\n\nFlax is the best crop to sow on land when first broken. The usual routine is to break the prairie in early summer, leaving the grass roots exposed to the sun till autumn, when it is back-set and made ready for crop in the coming spring. Under this system no return can be got the first year, and attempts to sow the ordinary cereals on breaking have usually not been satisfactory. Flax is the only crop that succeeds on breaking; it will yield on this rough seed-bed from 12 to 15 bushels per acre, thus giving a profit on the first season's work.\n\nRegarding root crops, it may generally be said that, in the growing of these, the Canadian North-West stands unrivalled. Potatoes often yield upwards of 300 bushels to the acre, and though of large size are of excellent quality; dry, sound to the core, and perfectly free from disease. Turnips average about 600 bushels per acre, carrots about 350. Nothing strikes the farmer from the Mother Country more forcibly than the prolific growth of all kinds. He sees in ordinary field culture samples of potatoes, turnips, carrots, mangolds, beets, onions, cabbages, and such-like, equal, and in many cases superior, to the prize samples of English agricultural shows, which have been treated with artificial manures and tended with scientific care.\n\nTurning to another department, we find the country eminently suited for stock raising. Farmers who have lived longest there, maintain, from practical experience, that in this particular the North-West is without a single drawback. The healthfulness of the climate, the freedom from epidemic disease, the nutritious character of the prairie grasses, and the ease with which all kinds of food can be produced, render it a country intended by nature for the breeding and feeding of stock.\n\nAll the leading breeds of cattle have been largely introduced. Some of the finest strains of Short-horn and Hereford blood are to be found on the stock farms and ranches, while Ayrshires, Holsteins, polled Aberdeens, and even West Highlanders, are to be found in lesser numbers. Limitless supplies of prairie grass constitute their food in summer, and, prairie hay their winter keep, the animals with ordinary care turning out fat and sleek in the spring.\n\nDairy cows give remarkable results on prairie grass. The Canadian North-West affords a splendid field for dairying enterprise. Already several creameries and cheese factories are in operation, producing butter and cheese of excellent quality. This branch of industry is destined yet to attain very large proportions, as in this concentrated form the produce of the farm will bear, relatively, a longer carriage than less valuable commodities.\n\nSheep-farming is a branch of industry which has proved very profitable. The dry climate and the rich grasses seem admirably adapted for bringing this animal to a high state of perfection, whether as regards mutton or wool. The dry cold, which induces an extra weight of fleece, is not in the least degree hurtful to sheep, who in the most rigorous winter weather live in open\nsheds, and get fat on prairie hay. Ewes in Manitoba are unusually prolific. The dry weather in spring is particularly favourable for the lambing season, and the percentage of loss is less than is recorded anywhere.\n\nThe immense flocks to be found in Australia are not likely to be generally duplicated in the Canadian North-West. Large flocks will doubtless be fed on the rising grounds on the further west, but in Manitoba they are likely to be confined within the limits of mixed farming. Medium wools, such as the Southdown and Shropshire, are likely to be the favourite breeds. The wool-clip will in a few years be of considerable importance, and as woollen clothing must always be in large demand in that climate it naturally follows that woollen manufacture will become one of the important industries of the country.\n\nPigs are already largely bred, Berkshire being the favourite breed. Where food is so plentiful and good they feed rapidly and attain great weights. The quality of the product cannot be surpassed. Pork packing is already established in Winnipeg, and promises to be one of the leading industries of the future.\n\nPoultry of all kinds succeed admirably. Hens, turkeys, geese, and ducks are kept in large numbers on many farms. They feed largely in summer on insects and other food in the prairie grass, cost little for their keep, and as they are usually attended to by the farmer's family, give an interest to the children's life, besides bringing in a considerable yearly revenue.\n\nFarms devoted to the exclusive raising of cereals are to be found in the North-West. The most notable of these is the \"Bell Farm\" at Indianhead, where thousands of acres are devoted to the growth of wheat. This style of farming is, however, the privilege of the capitalist or the sharehold company, and does not concern the ordinary man of small or moderate means who purposes trying his fortune on the prairie. The Government free grant of 160 acres, with a pre-emption of a like amount, or at most a section of 640 acres, comes within the scope of his capital. His success will lie in what is termed mixed farming. By devoting part of his land to the cultivation of every kind of cereal and root crop, by having a small herd of cattle and a few dairy cows, a flock of sheep, and pigs, and poultry, he avoids the danger of \"putting all his eggs into one basket.\" Then let the season be ever so unfavourable for one particular interest, he is sure to pull through with the others, finding in the variety of his means of livelihood the surest road to independence. Cultivating his own acres, with no rent-day to face and no manure bills to meet, paying trifling taxes, employing labour-saving machinery, finding a ready market for what he so cheaply produces, he goes on improving and increasing the value of his farm. Every step in advance being for his own advantage, he obtains an interest in life unknown to the tenant-farmer of England, who, in order to exist, must command a capital larger than is required to make him independent from the outset on the North-West prairie.\n\nThe thirst for land is common to humanity; to own the acres on which he spends his effort is of all ambitions in man one of the most laudable. That ambition can be gratified in the case of those who, trained to agriculture, be they farmers or farm hands, choose the North-West for their \"home;\" and to those who, trained to other work, are able\nand willing to face the toils incident to farming life, the opportunity is given. But every man is not qualified for a successful Colonist, and it is well to consider who will best succeed. In the Colonies, as elsewhere, \"Life is real and life is earnest,\" and there is no royal road to independence. Success lies in determined and continued effort, and the reward in such case is sure. Men with or without means, who have an ambition and a purpose to succeed, are the men wanted—men who are determined to be better off than they are at home, who aspire to be something and to do something, who are willing, and ready, and able to take hold of the first opportunity which offers, no matter how lowly the work may be, making that a stepping-stone to something better—such men are wanted, and such will assuredly prosper. The men who come with a purpose to rise are sure to ascend. We search in vain for a single failure among such; their presence is a strength and a blessing to the land of their adoption, and their letters the best emigration agents the country can possess. The North-West is not a place for men with set notions, who will only do one kind of work and nothing else, or for those who, having acquired bad habits at home, are disposed to practise them abroad. Loafers, ne'er-do-weels, and the purposeless gang without end or aim in life, are not wanted; their presence becomes a curse instead of a blessing to the country, and their existence miserable and of short duration in a land that contains neither pauper nor poor-house.\n\nWhat future lies before that Territory it were idle to predict, but when capital and labour shall have opened up its wealth, when the products of the mine and the products of the field shall have set contingent industries in motion, marvellous results will ensue. Agriculture there has an area large enough for its operations to enable England to supply herself with all the breadstuffs, dairy products, and live stock she requires. The export trade of that prairie country will in a few years tax to the utmost the carrying powers of its trans-continental road. Ere long another route for her products will be found to the markets of the Old World through the waters of Hudson's Bay. Communication, north, south, east, and west, will bring to her marts the produce of every clime; and, wealthy by reason of her productive power, she will command in the midst of all the necessaries of life, the luxuries of the globe.\n\nThe Colonial and Indian Exhibition, and the continued efforts of its Royal President, have surely helped to hasten the time when closer relations will exist between the Imperial mother and the children who are working out the destinies of the Empire in distant lands; when the mother shall feel a warmer interest in her absent sons, and the sons will yearn for a closer fellowship with the old fireside; when it will be more directly advantageous in reality, as it is in sentiment, to belong to a British Colony, and when the pride of the Colonies will be their attachment to the land of their birth. Under a grand Imperial Federation, each will be charged with a higher destiny; and of all the splendid territory which the British flag enfolds, considering the work to be performed and the possibilities of its future, I can invite you to no fairer portion of that Imperial heritage than that which has formed the subject of this paper.\n\nThe Canadian North-West.\nFor further Information and THROUGH TICKETS apply to CANADIAN PACIFIC RAILWAY CO., 88, Cannon Street, London, E.C.; 17, James Street, Liverpool; 135, Buchanan Street, Glasgow.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001603.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 22696, "total-output-tokens": 8942, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 115, 1], [115, 115, 2], [115, 2669, 3], [2669, 6103, 4], [6103, 9606, 5], [9606, 13156, 6], [13156, 16666, 7], [16666, 20115, 8], [20115, 23551, 9], [23551, 26980, 10], [26980, 30511, 11], [30511, 34041, 12], [34041, 37471, 13], [37471, 40902, 14], [40902, 40902, 15], [40902, 41077, 16]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]