[{"id": "ab64782bd5711df36c947db1ddb1d7d03608a431", "text": "SOIR D'AUTOMNE\n\nPAR\n\nJAMES-E.-P. PRENDERGAST,\n\nEtudiant en Droit.\n\nQUÉBEC\nP.-G. DELISLE, IMPRIMEUR\n1881\nSOIR D'AUTOMNE\n\nPAR\n\nJAMES-E.-P. PRENDERGAST,\n\nEtudiant en Droit.\n\nQUÉBEC\nP.-G. DELISLE, IMPRIMEUR\n1881\nA MA MÈRE.\nSOIR D'AUTOMNE.\n\nLE POETE.\n\nVoilà qu'au firmament une étoile s'allume ;\nLe ciel dévoile aux yeux toute sa profondeur.\nSur les coteaux lointains la forêt vierge fume ;\nÀ leur pied se replie un lourd voile de brume,\nAu-dessus tremble encore une faible rougeur.\n\nComme un navire en proie au feu qui le dévore,\nLe soleil dans la nue enfonçant par dégré\nEt projetant au loin ses lucours, a sombré.\nEt la nuit qui surgit du côté de l'aurore,\nAinsi que des débris sur le flot empourpré,\nEfface les reflets qui surnagent encore.\nJ'aime ces soirs d'automne et leur pâle beauté,\nLe ciel revêt alors une teinte plus grave ;\nEt lorsque les rayons, comme une ardente lave,\nOnt glissé des versants inondés de clarté,\nLa nuit calme soudain les vents et les tempêtes\nEt le firmament bleu s'arrondit sur nos têtes,\nSplendide, empreint de calme et de sérénité !\n\nJ'appelle alors la vieillesse sereine\nDont ces beaux soirs sont un tableau vivant,\nCet âge heureux où la tempête humaine\nNe m'emportera plus dans sa course incertaine,\nOù se forme le lac des ondes du torrent.\n\nJe sens que l'âme est plus légère\nDevant cette nature où rien n'est tourmenté ;\nEt les étoiles d'or gravitant dans leur sphère,\nMe semblent doucement s'approcher de la terre\nEt sourire à l'humanité.\n\nEn été, le couchant a trop d'ardente flamme,\nLes bois trop de parfums, de murmures confus ;\nLes espaces profonds ravissent trop notre âme,\nEt la terre est trop belle à nos regards émus...\n\nPourquoi me semble-t-il que toute la nature\nCette nuit parle par ma voix ?\nQui chante ces accords sur mon luth qui murmure\nSans que ses cordes d'or frémissent sous mes doigts ?\nEst-ce toi qui m'appelles ?\nMa Muse, est-ce bien toi ?\nJ'ai cru voir l'ombre de tes ailes\nPalpiter près de moi...\n\nLA MUSE.\n\nC'est moi qui suis venue à cette heure béniée\nOù sur tous les buissons ton âme rajeunie\nComme l'oiseau se pose pour chanter ;\nCar la Muse aime aussi la vie et la jeunesse,\nL'enthousiasme saint, les élans et l'ivresse,\nTout ce qui ravit l'âme et l'aide à remonter.\n\nJe relève aussitôt l'homme faible qui tombe ;\nJe verse à flots pressés dans son cœur qui succombe\nComme un baume divin, la consolation.\nOn m'appelait la Muse avant de me connaître ;\nTu n'as qu'à m'appeler pour me voir apparaître :\nJe suis la Grâce et l'Inspiration !\n\nTu t'enivres un jour du vin de la jeunesse ;\nDemain fondra sur toi la stérile tristesse\nEtouffant de son poids les élans généreux.\nTon inutile ardeur ne poursuit que des ombres,\nEt tes espoirs déçus couvrent de leurs décombres\nL'objet vrai de tes vœux.\nÀ ta vie, à ton nom, ne mens plus ô Poète ;\nSurtout ne mens plus à ton cœur.\nEncore ce matin, brisé, le front rêveur,\nTu marchais dans les bois et ta voix inquiète\nAppelait en tremblant la voix qui la ropète\nEt lui répond toujours avec tant de douceur.\nInsensé ! cette voix c'est l'écho, c'est ton rêve\nQui s'émoult et qui pleure en ton cœur endormi\nEt tu crois que le chant qu'il commence s'achève\nSur les lèvres d'un ami.\n\nEt depuis quel long temps te penchant près de l'onde,\nEt n'y voyant que toi, ne penses-tu pas voir\nDans le cristal menteur quelqu'un qui te réponde\nEt s'approche du bord quand tu t'y viens asseoir.\n\nHélas ! ce n'est qu'une ombre, en ton ivresse amère,\nQue tu vois souriant dans ce miroir profond ;\nQui tend ses bras tremblants à ton ombre éphémère,\nEt dont le front brûlant s'approche de ton front.\n\nPartout, toujours, ou toute chose,\nTu penses voir un abri pour ton cœur ;\nUne fraîche espérance où l'âme se repose,\nOù l'homme plus heureux devient aussi meilleur.\nDans un ciel pâle et sans nuage\nOù tremble encore l'adieu du jour,\nDans une pauvre fleur sauvage,\nDans un beau cantique d'amour ;\nDans un mot de charité sainte\nTombant des lèvres d'Ariel,\nDans une âme pure où la plainte\nExpire en regardant le ciel ;\n\nDans tout tu vois un reflet de lumière\nÉchappé des splendeurs des cieux ;\nEt tu te dis combien doit être radieux\nCet immortel foyer de la beauté première\nQui projette ces flots de rayons lumineux.\n\n***\n\nTu recherches la voix des concerts séraphiques\nDans les accents pieux qui naissent de l'autel.\nQuand les crépuscules magiques,\nDéployant au couchant leurs richesses féeriques,\nComme une autre face du ciel,\nFont surgir à tes yeux des fontaines d'eau vive,\nDes fleuves dans leur lit roulant des diamants,\nDes rochers de saphirs, des îles dont la rive\nDécoupe en traits de feu les flots étincelants ;\nTu sens se réveiller et s'émouvoir ton âme ;\nTu trembles et comprends que tu n'es qu'un banni,\nEt tu voudrais sur des ailes de flamme\nTraverser en vainqueur ces champs de l'infini.\n\nPoète, il faut donner l'essor à la prière,\nRemonter en chantant vers la source première\nOù l'astre souverain rajeunit sa beauté ;\nIl faut planer et boire à des flots d'harmonie,\nEt courir librement sur l'aile du génio\nDans les champs de l'espace et de l'éternité.\n\n***\n\nTu t'approches de la fontaine\nOù vient boire le cœur humain.\nComme un vase portant ton âme dans ta main,\nTu penses la remplir de cette onde sincère\nEt noyer une soif qui s'apaise soudain.\n\nMais l'âme immense et souveraine\nFut faite si grande aux Six jours,\nQu'alors même qu'on croit qu'elle est tout à fait pleine\nElle se creuse encore et demande toujours.\n\nElle n'a pas de fin, ta belle âme immortelle ;\nL'immensité de Dieu seule peut la remplir.\nEt de tout ce qui tombe en elle\nSa soif ne saurait s'assouvir.\nNou, non, ne cherche pas la triste poésie,\nNi le Beau des mortels, ni l'astre, ni la fleur ;\nNi la pathère antique écumant d'ambroisie,\nVersant la paix des sens et l'ivresse du cœur.\n\nL'amour sans lendemain n'est pas de cette terre.\nL'homme emporte en mourant son rêve dans la nuit ;\nIl ne laisse de vrai que le cœur de sa mère,\nIl n'emporte de bon que son pâle suaire,\nTout le reste est menteur, lui promet et le fuit.\n\nMais cherche la Beauté pure, vrai, idéale.\nNous n'en voyons ici qu'un reflet fugitif ;\nMais même en paraissant sous son jour le plus pâle,\nElle fait éclater, brûlante et triomphale,\nL'hymne de liberté dans le cœur du captif.\n\nVoilà, voilà l'amour fidèle !\nLe seul être consolateur !\nLa source qui toujours croît et se renouvelle\nSelon que croît aussi la soif de notre cœur.\n\nElle est profusion, grandeur, magnificence !\nLe pardon qui descend remonte incessamment ;\nEt grossissant ses flots dans cette source immense,\nIl retombe toujours, merveilleuse abondance,\nD'autant plus généreux que l'oubli fut plus grand.\nCe pardon est trop haut à la nature humaine,\nL'homme peut bien donner, Dieu seul sait par-donner.\nRessentant comme toi les énneaux de sa chaîne,\nL'homme dans le passé peut bien abandonner\nLe souvenir du mal dont il est le complice ;\nMais c'est du Seigneur seul un attribut divin\nDe donner au-delà de ce que sa justice\nAvait remis pour nous de bienfaits dans sa main.\n\n***\n\nEt lorsque refoulant les plaintes de ton être,\nTendant toujours les bras aux mirages trompeurs,\nComme un oiseau d'hiver qui bat à la fenêtre\nTu passes mendiant un mot de tous les cœurs ;\n\nLorsqu'enfin l'âme vide et le visage pâle,\nTu reviens de nouveau, bien avant dans la nuit,\nT'assoir plus triste encore dans ton sombre réduit ;\nDis-moi, d'où vient alors le vent qui par rafale\nT'apporte son essaim d'anges consolateurs,\nComme l'on voit parfois sur la brise automnale\nRevenir de l'été quelques oiseaux chanteurs ?\n\nD'où descend donc la main qui change ta tristesse\nEn transports de félicité ?\nQui, soulevant le poids du tourment qui l'opresse,\nLaisse ton triste cœur respirer la gaieté ?\nQui remplit ta mansarde sombre\nDe chastes visions, de subtile clarté,\nD'archanges purs et beaux te souriant dans l'ombre\nEt sans voile à tes yeux découvrant leur beauté ?\n\nEt lorsque nul ami ne vient ouvrir ta porte,\nQuelle est la voix qui dit avec bonté :\n— \"Enfant la paix que je t'apporte\nVaut bien leur hospitalité ?\"\n\nPoète, il faut chanter ce Dieu que tout adore.\nLe cœur humain doit comme une mandore\nSuspendue aux rameaux le soir,\nTressaillir d'un écho sonore\nQuand un souffle d'en haut passe et vient l'émouvoir.\n\nLE POÈTE.\n\nEt quoi ! faut-il chanter ? quand la clamour humaine\nMonte dans un air corrompu ?\nChanter, quand la voix se déchaîne\nAinsi qu'un coursier dans la plaine,\nDont le frein s'est rompu ?\nQuand elle crie anathème,\nQu'elle ment aux aïeux,\nQuand elle hait dire que j'aime,\nÀ sa rage mêler mon thème,\nLeur dire de lever les yeux ?\nO borceau parfumé de sainte poésie !\nCollines de l'Hybla, champs féconds d'Ionic !\nLes luths résonnaient bien sous votre ciel d'azur,\nL'air que vous respiriez était limpide et pur.\nLes sons flottaient au loin sur la mer qui palpite,\nUn silence profond tenait tout asservi ;\nLa brise s'endormait dans l'arbro qu'elle agite,\nL'insecte sa taisait sous l'herbe qui l'abrite,\nEt le silence était ravi.\n\nLa lyre de Sapho chantant Lesbos la blonde\nCaressait en pleurant la mer des Aleyons ;\nLes Cyclades levaient la tête au sein de l'onde,\nEn entendant au loin ces modulations.\nLe torrent suspendait sa course vagabonde,\nEt la mer d'Icarie et la mer de Myrthos,\nCourant avec amour, des lèvres de leurs flots,\nS'en venaient déposer, tribut d'un autre monde,\nUn baiser sur les pieds de la blanche Lesbos.\n\nAujourd'hui de tous lieux, de la nature immense\nS'élève un cri de haine, une sombre rumeur ;\nEt ceux qui croient pourtant, pâles, sans espérance,\nCachés sous le manteau de leur triste prudence\nCraignent de dévoiler les pensers de leur cœur.\nL'avaré comprend bien que deux et deux font quatre,\nL'autre dans son orgueil sait comme il faut abattre\nEt broyer le cœur d'un enfant ;\nCelui-là sait combien se vend la conscience,\nComme il faut s'effacer quand parle une puissance\nPour être demain triomphant ;\n\nMais aucun d'eux ne sait, aucun d'eux ne devine\nQue dans son cœur, sous la ruine,\nL'infini puisse s'agiter ;\nQu'ils n'auraient, s'ils voulaient, qu'à frapper leur poi-\nPour en faire jaillir une source divine\nQue rien ne pourrait arrêter.\n\nOui, je sens sur mon front une céleste empreinte ;\nJe voudrais que mon cœur respirât sans contrainte\nDans l'amour et la liberté.\nLa mer ni le torrent, rien ne me désaltère ;\nQuelque chose m'appelle au-delà de la terre,\nJe crois à l'immortalité !\n\nLA MUSE.\n\nO pauvre cœur martyr, pauvre cœur de poète,\nC'est le cri des hauts lieux, c'est l'appel idéal !\nTu veux donner l'essor à ton âme inquiète,\nTu veux voir l'infini comme le vit Hébal,\nY courir, y plonger, et comme une comète,\nPromenant partout ton ardeur;\nMarcher toujours, voler sans cesse à la conquête\nDes cieux et de la profondeur.\n\nTu lèvre reste close à l'abreuvoir immonde;\nTu retires ton cœur de la tourbe du monde,\nEt ton regard est las de la clarté du jour.\nTon bras est fatigué de retourner la sonde,\nTu songes au rivage où la verdure abonde\nAu sourire élément d'un beau soleil d'amour.\n\n***\n\nEnfant, quand la forêt aux jours pâles d'automne\nBalance lentement son sommet empourpré,\nQu'elle laisse flotter son manteau qui rayonne\nAu vent qui le déploie et le ploie à son gré;\n\nLorsque le chêne éclate en célestes murmures\nQui vont se perdre au loin sous les dômes mouvants,\nQu'on écoute, penché, sous les brunes ramures\nCes tristes voix d'amour qui pleurent dans les vents;\n\nLorsque, comme une reine à la mort condamnée,\nLa nature se fait belle pour son trépas,\nEt qu'on la voit encore touchante et résignée\nS'efforcer de sourire aux choses d'ici-bas;\nLe vent soudain s'élève ! et partout dans la plaine\nVolent par tourbillons les larges feuilles d'or ;\nLa pourpre se déchire en lambeaux et se traîne,\nLe feuillage s'envole en poussière du chêne—\nPuis tout a disparu de ce brillant décor.\n\nLes murmures confus ne se font plus entendre ;\nLe silence descend triste comme l'oubli ; [dre,\nPlus de rayons plongeants, plus de voix douce et ten-\nMais à la branche noire on voit tristement pendre\nUn pauvre nid brisé d'où les oiseaux ont fui.\n\nC'est ainsi que ton âme, enfant, se faisait belle\nDe la couronne d'or de ses illusions.\nLa nature t'offrait une fête éternelle,\nEt ton cœur ressemblait à la mer de Cybèle\nQuand sur ses flots vermeils passent les alcyons.\n\nComme eux les doux pensers, la tendre rêverie\nSe venaient reposer sur ta jeune âme en fleur,\nEt tout écho des bois, toute voix attendrie\nRessortait plus sonore en passant par ton cœur.\n\nComme une fleur dont la corolle est pleine,\nAttendant que s'élève un souffle dans la plaine\nQui la fasse poncher pour verser son odeur ;\nAinsi tu n'attendais d'un être qui respire\nQu'un signe de la main pour accorder ta lyre\nEt chanter ton bonheur.\nDans tes veines la vie, en ondes magnifiques,\nCirculant librement, courait avec ardeur ;\nLa gloire te disait ses paroles magiques\nQui font monter au front les ivresses du cœur.\n\nL'aurore te plongeait dans une longue extase ;\nTu trouvais trop étroit le champ de l'avenir ;\nEt ton cœur était plein jusqu'au bord comme un vase\nD'où coulent des parfums qu'il ne peut contenir.\n\nPuis tu te fatiguas de ces faveurs suprêmes ;\nTes yeux baissés erraient sur le bord du chemin,\nTes rêves s'enfuyaient décolorés et blêmes,\nEt tu laisses un jour choir ton luth de ta main...\n\nTu ne remontes plus aux hauteurs de la joie ;\nJamais l'enthousiasme, ainsi que sur sa proie,\nVainqueur, ne font sur toi pour t'emporter au ciel.\nLes flottantes ardeurs de ton cœur sans constance\nPoursuivent au hasard un rêve de démence,\nEt tu laisses mourir la flamme sur l'autel.\n\n***\n\nMais sache-le, Poète, on m'appelle la Grâce ;\nJe sais toucher les cœurs et ne les force pas.\nÀ la porte parfois je frappe, et puis je passe,\nEt trop souvent le vent efface\nJusqu'au vestige de mes pas.\nQuelquesfois, cependant, avec sollicitude\nJe veille auprès du poète rêveur ;\nJe le suis dans la solitude\nOù je parle mieux à son cœur.\n\nQuand je le vois fléchir sous un poids qui l'écrase,\nQu'un désir infini revient le tourmenter,\nQu'il sent courir en lui comme un fou qui l'embrace,\nPréludant de ma voix je lui dis de chanter.\n\nLa musique toujours pacifie et console,\nElle repose l'âme et l'émoult à la fois ;\nSur son aile souvent la tristesse s'envole,\nEt l'on croit au bonheur en entendant sa voix.\n\nMais un jour près de lui le Maître me rappelle.\nM'approchant du poète et sur lui m'inclinant,\nJe revêts d'un rayon de la gloire immortelle\nSon front tantôt pâli qui brûle maintenant ;\nEt la pauvre muse infidèle,\nÀ la brise d'en haut déployant sa grande aile,\nLaisse son poète en pleurant.\n\n***\n\nTu ne veux pas chanter l'éternelle nature\nParce qu'une clameur couvre sa faible voix ?\nTu ne veux pas mêler ton triste et doux murmure\nAu refrain des lacs bleus, à l'écho des grands bois ?\nTu ne veux admirer qu'une image cachée\nAu dernier repli de ton cœur,\nPresser sur ta poitrine une souille arrachée\nQu'à ta porte une nuit conduisit le malheur ?\n\nEt parceque ton cœur a soif de sacrifice,\nTu veux toujours puiser dans cet amer calice\nDes espoirs immolés ?\nBoire en secret les larmes solitaires,\nEt remuer les dépouilles trop chères\nDes rêves envolés ?\n\nDédaignant l'univers; auguste sanctuaire\nOù Dieu t'avait mis pour prier ;\nRiant de l'autel où, victime volontaire,\nTu devrais te sacrifier ;\nRaillant les murs croulants du temple séculaire\nDont tu devrais être un pilier,\nTu ris de la ruine et ton âme sommeille ;\nEt sans voir la plaine vermeille\nOù le Seigneur va se lever,\nÀ tout propos d'espoir tu détournes l'oreille :\nTu veux dormir, tu veux rêver.\n\n***\n\nJ'ai dit quel est mon nom : je m'appelle la Grâce.\nJe console un moment, puis je remonte à Dieu.\nEt cependant, la tempête s'amarre\nLà-bas à l'horizon en feu !\nEt cependant il faut que l'épreuve se fasse,\nIl faut que la douleur et le non et l'enlace,\nIl faudra tôt ou tard que ton aigle t'embrasse,\nEt je serai loin dans un autre lieu.\n\nSi tu t'éveilles à cette heure\nDe ton rêve de volupté,\nOù ton ange qui souffre et pleure\nDans son ciel sera remonté,\nDis-moi, qui soutiendra ton âme ?\nQui saura t'abreuver d'espoir ?\nQui versera l'huile à la flamme,\nQui lavera les taches du miroir ?\n\nQui te rendra ta lyre d'harmonie\nQui se sera brisée en chantant les faux dieux ?\nQui baisera ton front aux heures d'insomnie,\nEt quelle autre pourra donner à ton génie\nEt l'éclat de la foudre et la splendeur des cieux ?\n\nRéveille-toi, Lyre ! le clairon sonne !\nLes archanges chantent en chœur !\nDes quatre coins la voix court et résonne,\nEt la terre créée entonne\nLe grand hymne du Créateur.\nLe Seigneur est jaloux du dieu des corybantes,\nJaloux des faux autels et jaloux du néant.\nIl veut, ô cœur nuet, qu'à sa gloire tu chantes,\nQue toute corde vibre au divin instrument.\nIl est jaloux de l'or, jaloux des dieux d'argile\nQui dérobent sa gloire et l'adoration ;\nIl appelle la mer et le roseau fragile,\nLa colline et la nue, et l'ombre et le rayon,\nTout ce qui souffre ou luit, bondit, voltige, oscille,\nAu chant de la création !\n\nLa voix du monde est horrible et blasphème ?\nPoète, alors, plus haut ! fais résonner plus fort\nTa lyre qui s'endort !\nCouvre de tes accents le cri de l'anathème,\nEtouffe leurs clamours dans un sublime accord,\nEt que l'hymne de vie alterne au chant de mort !\n\nSi leur voix te jette l'injure,\nSi leur rage te mord au flanc,\nChante ! laisse couler cette sainte blessure\nAfin qu'ils lavent leur souillure\nDans les flots chastes de ton sang.\n\nO sois tout charité, tout parfum, tout prière !\nLaisse blémir encore leur cynisme hardi ;\nSois beau comme un rosier sous sa fleur printanière,\nComme une vigne d'Engaddi.\nQu'importe si le vent souffle quand ta main sème,\nEt disperse le grain dans l'air ?\nQu'importe si l'angoisse a fait sur ton front blême\nPoser sa lourde main de fer ?\n\nQu'importe si parfois tu pleures sur la vie,\nSi ton cœur manque d'air dans sa froide prison ?\nSi ton nom est en butte à la haine et l'envie,\nSi l'arbre a passé floraison ?\n\nLes larmes sont la divine rosée\nQui rend jeune et fécond l'immobile désert.\nLe parfum se répand d'une plante brisée,\nSous le flot en fureur la perle est déposée :\nPour venir au repos il faut avoir souffert.\n\nIl faut avoir tendu, pâle, ses mains tremblantes\nEn appelant tout bas le rêve tant aimé,\nIl faut avoir baigné dans des larmes brûlantes\nSon cœur qui rajeunit plus tendre et parfumé ;\n\nIl faut avoir subi des angoisses sans nombre,\nS'être senti broyer sous la main du malheur ;\nComme il faut au couchant la nue épaisse et sombre\nQue le soleil colore et revêt de splendeur.\n\nTions-toi toujours tourné du côté de l'aurore :\nC'est de là que nous vient l'espérance, et l'amour.\nVois-tu comme déjà l'horizon se colore ?\nIl n'est si longue nuit que ne suive le jour.\n\nIl n'est si dure peine ici-bas qu'on ne puisse\nS'en dépouiller un jour ainsi que d'un manteau.\nPour l'homme la douleur est un sillon propice ;\nLa mort continuera l'œuvre germinatrice,\nEt tu verras plus tard fleurir le sacrifice\nDe l'autre côté du tombeau.\n\nEt riche de tes pleurs, plus fort de ta souffrance,\nPour le dernier sommeil tu pourras t'endormir ;\nTu fermeras les yeux pour mieux voir l'espérance,\nEt cesser de mourir.\n\n***\n\nToute chose a son terme ;\nTout meurt, mais non pas sans retour.\nEt la fleur qui tombe, renferme\nLa graine qui se brise et germé\nPour refleurir un jour.\n\nTout se courbe et se penche,\nMais pour se relever.\nUn souffle redresse la branche ;\nUn jour ton âme libre et blanche\nElle aussi pourra s'envoler.\n\nQuébec, 10 février 1881.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001004.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 36486, "total-output-tokens": 6855, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 104, 1], [104, 208, 2], [208, 208, 3], [208, 219, 4], [219, 219, 5], [219, 740, 6], [740, 1840, 7], [1840, 2751, 8], [2751, 3740, 9], [3740, 4592, 10], [4592, 5555, 11], [5555, 6589, 12], [6589, 7653, 13], [7653, 8509, 14], [8509, 9547, 15], [9547, 10486, 16], [10486, 11464, 17], [11464, 12605, 18], [12605, 13658, 19], [13658, 14645, 20], [14645, 15518, 21], [15518, 16400, 22], [16400, 17447, 23], [17447, 18467, 24], [18467, 19313, 25]], "primary_language": ["fr", "fr", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]