[{"id": "374ca3b6f4e52474134e1bcc29b8f7e96dcabcba", "text": "TO THE\n\nHONORABLE THOMAS WHITE,\n\nMINISTER OF THE INTERIOR,\n\nDOMINION OF CANADA.\n\nThe Memorial of THE QU'APPELLE VALLEY FARMING COMPANY, L'd,\nrepresented by WILLIAM LEWIS BOYLE, the President, and HERMANN JOSEPH\nEBERTS, the Secretary-Treasurer thereof,\n\nRESPECTFULLY SHEWETH:\n\n1. That your Memorialists are the proprietors of what is commonly known as the Bell Farm,\nin the North West Territories.\n\n2. That your Memorialists have carried on Farming in the said Territories on a very extensive\nscale, and had invested in their operations up to the Spring of 1885 over half a million of dollars.\n\n3. That your Memorialists, during the Season of 1884, caused to be prepared for cropping the\nfollowing Spring, upwards of Eight Thousand Acres of Land, in wheat chiefly, at a cost of $19,727 94,\nan average per acre of $2 37.\n\n4. That all preparations had been made during the Winter in providing the necessary Seed, and\nprocuring at a large outlay the additional implements necessary to enable your Memorialists to\ncommence operations so soon as the season had sufficiently advanced, and seed the entire area so\nprepared.\n\n5. That on the breaking out of the Rebellion in the North West, the greater part of the motive\nforce of your Memorialists, in Horses, Wagons and Men, were drawn off by the General in Command\nof the Forces, to do duty in assisting the movement of troops to the front.\n\n6. That owing to the crippled condition in which your Memorialists were left through such\nwithdrawal, the management were able to seed, during the seeding season, a small portion only, of\nthe lands so made ready, and, with every exertion, were able to cultivate properly only 1000 acres of\ntheir lands, while the additional implements purchased and the greater portion of their large stock on\nhand were forced to remain unused.\n\n7. In consequence of such non use the area of 7,300 acres, or so much thereof as could be\novertaken, had again to be plowed and harrowed for the coming year.\n\n8. Your Memorialists, therefore, not only lost the cost of the preparations of the previous year,\nand the profits naturally arising from its crop, but owing to the prolongation of hostilities and continued\nabsence of their staff, were unable during the season just passed to till the quantity of land which under\nother circumstances they would have done, in readiness for the year 1886.\n9. The Bell Farm has become widely known as a very important factor in the development of the North-West, and the effect of so many of their fields going to waste in 1885—considered by your Memorialists and the public generally as the crucial year of its existence—was not only a direct loss to your Memorialists, but jeopardized the credit of the Company to an alarming degree, compelling them to strain their resources to the utmost to pass through what otherwise would have proven a profitable season.\n\n10. Your Memorialists also respectfully state that the assistance rendered throughout the crisis in the North-West by the staff and material of the Bell Farm, more notably at the commencement of the troubles, was loyal and of incalculable service to the General in Command, enabling him to move with much greater rapidity than otherwise—without such a staff to draw upon—he could have done.\n\n11. Your Memorialists feel, and they believe justly, that under these circumstances their claim to compensation from the Government for the losses they have sustained should be favorably entertained.\n\n12. It may be urged at first sight that as a partial set off to these losses may be placed the sums received by your Memorialists in compensation for the work done in the transport service, but your Memorialists would point out that these earnings were minimized—(a) by the large sum paid their men in extra wages; (b) the heavy loss to their live stock through horses killed, maimed and rendered useless through casualties and exposure, and the extra wear and tear of wagons and harness; (c) the very great reductions made by the Commissioners on War Claims; (d) the serious straits in which the Company were placed through loss of credit; (e) the interest paid on capital not fully employed, and the entire loss of dividend and consequent disappointment of shareholders; (f) the very serious curtailment of their operations for the season of 1886, and general derangement of well settled plans; (g) the necessarily increased expenditure consequent on the attempt to overtake as far as possible the ground lost the preceding year; and (h) lastly the large number of acres which through non-cultivation have returned to their natural state.\n\n13. Your Memorialists respectfully present in a Schedule hereto affixed a fair representation of the direct losses incurred by them, as aforesaid, in addition to those set forth in the preceding paragraph.\n\nAnd your Memorialists respectfully submit—\n\n(a) That after deducting from the cost of preparing the gross acreage the proportion for the acreage employed, viz.: $2,377, they are entitled to compensation for the balance, that is to say, to $17,350.94, and interest thereon for one year at the rate most favorable in the North-West, eight per cent, $1,388.07.\n\n(b) That your Memorialists are entitled to compensation for the fair measure of net loss sustained through non-cultivation of their land, the particulars of which are fully set forth in the said Schedule, amounting to $38,690, making a total claim of $57,429.01.\n\n(c) Your Memorialists therefore respectfully ask your consideration thereto and pray for the payment of the claim presented.\n\nAnd your Memorialists, &c.\n\n(Signed)—W. LEWIS BOYLE,\nPresident,\nThe Qu'Appelle Valley Farming Co., Limited.\n\nH. J. EBERTS,\nSecretary-Treasurer,\nThe Qu'Appelle Valley Farming Co., Limited.\n\n(Dated)—WINNIPEG, MANITOBA,\nFebruary 26th, 1886.\n\nThe foregoing is the Memorial marked B referred to in the declaration of W. R. Bell, made before me, this 2nd day of March, 1886.\n\n(Signed)—JAMES HARVEY, J.P.\nThe Qu'Appelle Valley Farming Company, Limited.\n\nBELL FARM OFFICE.\n\nSTATEMENT OF CLAIM of the Qu'Appelle Valley Farming Co., Limited, for damages and loss caused by the withdrawal of their force from the Bell Farm on the 29th of March, 1885, by the General of the Forces. The Company being thereby prevented from carrying on their active operations as Farmers.\n\n| Description                                                                 | Amount   |\n|----------------------------------------------------------------------------|----------|\n| Amount actually expended in preparing 8,300 acres of land on the          | $19,727.94 |\n| Bell Farm in 1884 for cropping in the Spring of 1885                         |          |\n| Less the proportion of this amount on 1,000 acres cropped in 1885            | 2,377.00 |\n| Net loss in preparation                                                     | $17,350.94 |\n| Interest on this sum for one year                                           | 1,388.07 |\n| Value of Crop off 7,300 acres at an average of 18 bushels 131,400 bushels at 60 cents | 78,840.00 |\n| Deduct cost of seed per acre                                                | $1.50    |\n| \" seeding do.                                                               | 0.25     |\n| \" harrowing do.                                                             | 0.50     |\n| \" reaping do.                                                               | 1.50     |\n| \" stacking do.                                                              | 0.50     |\n| \" Threshing and Delivering do.                                              | 0.75     |\n| \" wear and tear do.                                                         | 0.50     |\n| \" 7,300 acres, at                                                           | $5.50    |\n|                                                                              | 40,150.00 |\n| Net loss through non-use of land                                            | 38,690.00 |\n| Amount of Claim                                                             | $57,429.01 |\n\nWinnipeg, February 26th, 1886.\nIn the matter of claim made by the Qu'Appelle Valley Farming Co., Limited, for damages and loss caused by the withdrawal of their force from the Bell Farm, on the 29th March, 1885, by the General in Command of Her Majesty's Forces.\n\nI, WILLIAM ROBERT BELL, of the Municipality of Indian Head, in the North-West Territories, Farmer, do solemnly declare:\n\nThat I am the General Manager of the Qu'Appelle Valley Farming Co., Limited, and as such have direct charge over and supervision of the Bell Farm, the property of the said Company;\n\nThat the statements made in the first nine paragraphs of the Memorial hereunto attached and marked B are true, to the best of my knowledge and belief;\n\nThat the Statement of Claim hereunto annexed and marked A contains, I verily believe, a fair statement of the direct losses to the said Company as set forth in the said Memorial and Statement;\n\nThat the items in the said Statement of Claim marked A are, I verily believe, truly represented therein;\n\nAnd I make this Solemn Declaration conscientiously believing the same to be true, and by virtue of an Act passed in the thirty-seventh year of Her Majesty's reign, intituled, \"An Act for the suppression of extra judicial and voluntary oaths.\"\n\nTaken and declared before me at Indian Head, in the District of Assiniboia, this second day of March, A.D. 1886.\n\n(Signed) JAMES HARVEY,\nJ. P., N.W.T.\n\n(Signed.) W. R. BELL.\n\nIn the matter of claim made by the Qu'Appelle Valley Farming Company for damages and loss caused by the withdrawal of their force from the Bell Farm on the 29th of March, 1885, by the General of the Forces.\n\nI, HERMANN JOSEPH EBERTS, of the Village of Indian Head, in the Provisional District of Assiniboia, North-West Territories, Accountant, do solemnly declare:\n\nThat I am the Secretary-Treasurer of the Qu'Appelle Valley Farming Company, Limited, and as such have charge of the books of the said Company, including those kept at the Bell Farm.\n\nThat the item of $19,737.94, mentioned in the Statement of Claim hereunto annexed and marked A, is taken from the books of the said Company, kept at the Bell Farm, and I verily believe is the true amount of the actual cost of preparation of the lands of the said Company in 1884, for cropping in the Spring of 1885, as arrived at from the labor returns daily made, and as distinguished from all other charges.\n\nAnd I make this Solemn Declaration conscientiously believing the same to be true, and by virtue of the Act passed in the thirty-seventh year of Her Majesty's reign, intituled, \"An Act for the suppression of voluntary and extra judicial oaths.\"\n\nDeclared before me at the Village of Indian Head, in the (County of) District of Assiniboia, North-West Territories, this second day of March, A.D. 1886.\n\n(Signed,) JAMES HARVEY,\nJustice of the Peace, N.W.T.\n\n(Signed.) H. J. EBERTS.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001528.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 6920, "total-output-tokens": 2710, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2360, 1], [2360, 2360, 2], [2360, 5955, 3], [5955, 8097, 4], [8097, 10941, 5]], "primary_language": ["en", "None", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, true, false], "is_diagram": [false, false, false, false, false]}}]