[{"id": "f44fd448373678a1a20a58ffe05bb6f1b967e154", "text": "PARTING ADDRESS\n\nTO THE\n\nPEOPLE OF CANADA.\n\nBY\n\nSIR FRED MIDDLETON, K.C.M.G., C.B.,\nLieut.-General, and late Commander of the Canadian Militia.\n\nToronto:\nPRINTED FOR THE AUTHOR BY\nHUNTER, ROSE & COMPANY.\n\n1890.\nPARTING ADDRESS\n\nTO THE\n\nPEOPLE OF CANADA.\n\nTo be silent under unmerited censure is often the part of a soldier, and had I merely been charged with indiscretion, or with having overstepped my powers as a commander in the field, I might have chosen to retire without saying anything in my defence, and to leave it to the justice and generosity of the Canadian people to balance my general services against a single error of judgment. But the bitterest of my assailants, and the organs of their party in the Press, have not stopped here. I owe it to my companions-in-arms, and to all Canadians, at parting, to show that the Canadian Militia has not been commanded by dishonour.\n\nAn indictment comprising four charges (vide page 1, Report of Select Committee), was brought against me by Mr. G. W. Lister, M.P., before a Committee of the House of Commons. Besides the instruction to Mr. Hayter Reed to confiscate Bremner's furs and to appropriate a few of them at Battleford, I was charged (a) with the appropriation of furs at Batoche, (b) with the appropriation of horses, (c) with having licensed the appropriation by Lt.-Col. Bedson of a pool table and horses taken from the settlers at Batoche.\n\nThe case of Bremner's furs, Mr. Lister said, \"was not an isolated transaction, but one of a series.\" The inference to be drawn from the series taken collectively, plainly was, that I had been guilty of systematic plundering or licensing plunder. Not a particle of evidence has been given in support of any of the last three counts, which are absolutely false. I never touched or saw any furs at Batoche, and the only horse I took was one to carry me during the campaign, and which was afterwards handed over to\nthe Government auctioneer at Winnipeg. As regards the billiard table, from copies of telegrams which I have lately come across I am enabled to state that the Minister of Militia had sent a telegram to me (which I have not kept), about the troops looting, and in answer thereto, I telegraphed as follows:\n\n\"CAMP FORT PITT,\n\"June 24th, 1885,\n\n\"The troops were not at Saint Laurent or Duck Lake. I find that a billiard table was taken out of Gabriel Dumont's house before it was burned, and one was taken at Batoche. They are both at Prince Albert, and certainly no woman's clothes were taken. The little property at Batoche was the property of undeniable rebels, who had just been shooting down our men, and, according to the usage of war, might fairly be taken by the soldiers. The half-breed women and Indian women with their children were admirably treated—not a thing was taken from them, and when they moved up on to the plain, the soldiers helped them to pack their goods and tents, and to bring them up. I issued an order forbidding plundering on the march, and have every reason to believe it was obeyed. My experience of the conduct of troops in the field permits me to say that, on this matter, my troops have behaved exceptionally well, as might be expected from their superior class and education as compared with other armies.\"\n\nI must then have received another telegram from the Minister relative to the disposition of these tables, as I find that on June 29th, 1885, I sent him the following telegram from Fort Pitt:\n\n\"As regards the tables, considering the way the white settlers and friendly breeds' houses and property have been treated by the rebels, I do not think it would be judicious, but I will carry out your wishes if you still desire it.\"\n\nSubsequently I received a telegram from the Minister, dated Ottawa, 30th June, in which the following passage occurred:\n\n\"About the tables, do as you think best.\"\n\nI found, on enquiry, that one of these tables had been used to assist in rendering bullet-proof the bulwarks of the steamer \"Northcote,\" which took part in the advance on Batoche, and, as far as I can remember, I took no further steps in the matter, which passed out of my mind.\n\nMr. Lister's last three charges were struck out by the Committee on the ground that there had been no authority given\nto investigate them, but, as they had been formally preferred, received and printed by the Committee I was surely entitled to a verdict on them, and on the general charge of plundering and licensing plundering, which they were brought forward to support.\n\nAs to the charge of licensing plundering, I have already stated that I issued strict orders against plundering on the march, and I may be permitted to cite the following extract from a letter from Monseigneur Grandin, Bishop of St. Albert, to me, dated July 30th, 1885.\n\n\"I was heart-broken at the sight of so much misery, but I ought to say that, if on the one hand I saw that which always shows itself after war, I was rejoiced by hearing what one rarely hears under such circumstances. I have heard, and frequently, the conquered praise the generosity of their conqueror. To hear the priest praise your moderation in victory, praise the officers in general, speak of your kindness in relieving the starving conquered, did not surprise, but I have heard the people in general.\n\n\"I tender you special thanks, General, because, at the entreaty of good Father Moulin, you spared the Church of St. Antoine and the Missionaries' house, although these buildings were an obstacle to you in battle. You have, General, by yielding to the entreaty of that good little missionary, rendered a true service to the colony, &c.\"\n\nThis will show the general spirit in which I acted, and how far I was from any disposition to license plunder.\n\nI did not know what amount of furs Bremner had, nor did I ever see them. I fully believed then that Bremner was a rebel. He had been in the camp of Poundmaker, who was in arms against us, and he only came in after I had made Poundmaker a prisoner. He was recognized as having been present at Cut Knife, and he was also found in possession of the rifle of a slain Mounted Policeman. I fully believed then that his property, as that of a rebel in arms, was forfeit, and that I was warranted in afterwards giving effect to the forfeiture. That the property of rebels was forfeit was certainly the rule which practically prevailed in India in 1857, when I served against the mutineers and rebels. Subsequently, as stated officially by Captain G. H. Young, Secretary to the Commissioners, Bremner's claim for compensation for the loss of his furs was rejected by the Commission of Rebellion Losses, who held that he (Bremner) \"was a party to, and respon-\nsible for his own losses, or in other words that he was a rebel,\" and this decision was arrived at by a Royal Commission, which took evidence at the time and on the spot.\n\nIt seems that my impression as to the extent of my powers was wrong, and of course I regret now that I exercised it as I did, but the impression must have been strengthened, not only by the telegram already referred to, authorizing me to do as I liked about the captured billiard-tables; and by the fact that my idea, given in the other telegram, as to the rights of the soldiers to any property found in Batoche, was not controverted from Ottawa, but also by a telegram from the Minister of Militia, dated June 12th, 1885, in which he says:\n\n\"I should like you to bring back some souvenirs of your campaign for Sir John, Sir Hector, and myself—leave to you to select whatever you consider of interest.\"\n\nThis request may have been meant to refer, and, from what the Minister of Militia told me the other day, probably did refer to souvenirs to be purchased, or received as gifts by me, but I certainly took it at the time to relate to anything captured from the rebels. In my answer I stated that I would do my best, but as a matter of fact, I forgot it, and did not comply with the request.\n\nThe confiscation of Bémer's furs was made with the concurrence, if not by the advice of Mr. Hayter Reed, who was lent to me by Lieutenant-Governor Dewdney, as a Government official, to assist me in my dealings with the Indians and Half-breeds, and who carried out the arrangements for the distribution of some few of the furs to himself and other officers.\n\nIt was under these circumstances that I sanctioned the disposal of a few furs as mementoes for myself and for the officers of my staff. As to my own share I never received it, asked for it, or thought about it afterwards.\n\nThe Select Committee considered the confiscation of the furs unwarrantable and illegal, and added that I admitted that I had recently become satisfied that it was not legally justifiable. I did admit that, on considering the matter lately I supposed really and legally I had not the power to confiscate the furs, but, after all, whether I had the power to confiscate them legally or not, I was\nobliged to put them in charge of the Mounted Police, and if I had not afterwards formally pronounced them confiscated, they would have still remained (as they did) in the hands of the Mounted Police, that is in the hands of the Government,—minus the few I had allowed to be taken as mementoes.\n\nAs regards the furs themselves, I may point out that their amount and fate seem wrapped in mystery. Bremner's own statement to the Claims Commission is to the effect that he was made to go to Poundmaker's camp, April 14th, 1885, and that the Indians took possession of his furs, which were then worth $4,374.00 (which valuation is derided in the North-west Territories). When he left Poundmaker's Camp to go to Battleford he was allowed to take his furs, but he did not know how many bales or packs he had then. It was, he said, over ten and nearer twenty bales. Doubtless it is only reasonable to believe that the Indians took some of the furs, and after the furs arrived at Battleford a quantity were taken by the people about before they were handed over to the Mounted Police for security, so that it is impossible to know how many were really given into their charge.\n\nBefore the Select Committee it was proved that only about one-eighth of the furs in charge were packed up as mementoes for the officers, that I myself never received any of them, and that the remaining seven-eighths disappeared, and yet it has been alleged, in part of the press of this country, that I had personally appropriated $5,000 worth of furs belonging to Bremner!\n\nIt has also been alleged that some furs, which Mr. Devlin, of Ottawa, took from me as part payment for dressing other furs, etc., were part of Bremner's lot. Of course they were not, and could not have been. They were not even of the same kind as those of Bremner, said to have been packed up at Battleford. They were part of some skins that had been given to me in the North-West, and some that I bought myself.\n\nAn attempt was made to connect me personally with these furs by the statement that I went to look at them at Battleford on my way home, that I complained that the best had not been put up for me, and gave a further order for a large saddle-box to be\nfilled with them for me. This is all false, and its falsehood is attested by Lieut.-Colonels Dawson, Smith (D. School) and Grasett, two of whom were with me during the whole day on which this is said to have occurred. Mr. Ronald Macdonald, who made the statement, had to admit, under cross-examination, that his statement was not based on his own knowledge.\n\nThis Macdonald was the only witness brought forward in support of the charge before the Committee. He was not a trustworthy witness, for he declared (vide page 9 of the Report), that he had no interest in the matter, whereas it came out (vide page 44 of the Report), that he had been appointed Agent for the prosecution of claims for losses incurred by Bremner in the rebellion, and that he was to receive five per cent. on the amount recovered; moreover, according to his own account, he was implicated in the disposal of the furs. It will be found that there are other prevarications and inconsistencies in his evidence calculated to cast doubt on its credibility.\n\nThe order for the confiscation of the furs had been lost, and its contents had to be supplied from memory. I did not see it at all, and I positively deny that any injunction of secrecy was inserted by my directions. Neither did I know to whom the order was addressed, but I naturally must have thought it was addressed to the officer of the Mounted Police at Battleford, who had been ordered by me to take charge of the furs, and who was really the person answerable for their safe custody, and not the Quarter-Master Sergt., who was only a subordinate. As I have already said, I never had the furs, I never saw them, and I never enquired after or thought of them after leaving Fort Pitt. I dismissed the whole matter from my mind, and have since had great difficulty in recalling it. How could a man, occupied as I was then, amidst the confusion and excitement of war, recollect accurately every small matter that was brought before his notice?\n\nFurthermore, it has been asserted that I have employed agents to destroy the evidence against me. This is a wicked invention. I have no agents, and there is no evidence to destroy. I have already protested against the Report of the Parliamentary Committee when tendering my resignation. The House of Commons is not\na court of justice, but a political assembly in which Party necessarily prevails, and if my character were at stake I should prefer a different tribunal. It is a patent fact that the bitterest attacks on me have proceeded from that party, and from most of the organs of that party, which protested against Riel's execution and courted the Rielite vote.\n\nBy those who demanded my dismissal, it has been urged that the appointment ought not to be held by an imperial officer, and that there are Canadians ready to fill my place. I hope there are, but surely this change might be effected without a political attempt being made to injure me, an attempt which I am sure no true Canadian would sanction or encourage, even to gain the appointment for himself. A false impression appears to have been created in some minds by my retention of office for two months after the Report of the Committee, as though I had clung to the position until forced to retire. I felt that an immediate resignation would look like a consciousness of wrong-doing on my part, and that I had better, as it were, challenge the opinion of the Government on my conduct by continuing to do my duty. My position was a difficult one, but certainly, after what had happened, retention of office had no place in my mind.\n\nThere is another point on which I wish to right myself before leaving the country. It is with pain that I have lately learned that I have lain under the imputation of having failed to do justice to my companions-in-arms in not having recommended any of them for promotion and honours, such as I myself received. Now this is very far from being the case, and I am sure that the Minister of Militia will himself help to clear me from such an unmerited charge. In reality I almost exceeded military official etiquette in my anxiety to obtain rewards for those who had so ably and gallantly helped me to obtain my own, as I shall proceed to show. In my despatches concerning the action at Fish Creek and the taking of Batoche, I brought to the notice of the Government the names of those officers who, by their rank, appointment, command, and conduct in my opinion best deserved it. In my final report of the whole campaign I again brought these officers to notice in the following terms:\n\"Nothing could have been better than the conduct of all the troops, both officers and men, engaged in this short campaign, but as it is impossible to name every one in a despatch, I must, in accordance with military usage, confine myself to bringing to your notice the names of those who from their rank, appointment, or special service are in my opinion deserving of such mention, and it will not be out of place if, in this despatch, I again record those already brought to your notice, and to whom my thanks are due for the zeal they displayed and for the services they so cheerfully rendered, together with others not before mentioned.\"\n\nThe despatches were all printed and given to the public in the Canada Gazette and public press. In the Imperial service a Gazette awarding honours and promotions to those named in despatches would have followed as a matter of course without further action by the General himself. But I did not let the matter rest there. I had an interview with the Minister of Militia and the Prime Minister, at Riviere de Loup, shortly after my return from the North-West, in which I pleaded for rewards for my officers. They decided against my request for two reasons, one being that they knew that only two or three C. M. G.'s would be granted, which would cause jealousy among those who did not receive them; the other, that I had not been able to include in the list for honours the names of the two officers commanding the French-Canadian regiments. This, I was given to understand, would occasion trouble, which it was not thought advisable to incur. The recommendations for brevet promotions were, I understood, to be considered. On the 16th December, 1885, I personally submitted a letter to the Minister of Militia in which I drew attention to the fact which I had since discovered, that a good many C. M. G.'s had been given for services in the Red River expedition of 1870, in which no fighting or loss of life had taken place. In this letter I gave a list of officers with a recommendation for such honours as might be deemed suitable, together with the names of officers for brevet promotions. On the 11th March, 1886, I addressed another letter to the Minister of Militia referring to my communication of the 16th December, 1885, and urging that some action should be taken thereon. I never received written official answers to my letters, but I had frequent conversations with the Minister on the subject. After one of\nthese conversations I again, as late as April, 1887, personally submitted a letter to the Minister in which I once more brought forward the subject of these rewards, drawing attention to the fact of its being the jubilee year of our Most Gracious Sovereign, when the Government might deem it an auspicious moment to ask for the decorations I begged to recommend, and to confer the brevet promotions also. The latter would in some cases necessitate certain alterations in the regulations, which I suggested should be made. In this letter I ventured to specify the decorations and promotions as follows:\n\nMajor-General Strange, Commander Alberta Column,\nMajor-General Laurie, Commander at Base,\nCol. Walker Powell, Adjutant-General H.Q.,\nLt. Col. Otter, Commander Battleford Column,\nLt. Col. Van Straubenzee,\nDr. Sullivan,\nDr. Roddick.\n\nTo receive the C. M. G.\n\nLt. Col. Otter,\n\" Van Straubenzee,\n\" Montizambert,\n\" Houghton,\n\" Grasett,\n\" Osborne Smith, C.M.G.,\n\" G. E. A. Hughes (65th Reg),\n\" J. Macpherson (Director of Stores).\n\nTo be Bt.Colonels.\n\nMajor Short, B. Battery, C. A.,\n\" Dawson, 10th R. G.,\n\" Smith, \"C\" Co., R. S. I.,\n\" Boswell, 90th Battalion,\n\" Hughes, Midland Battalion,\n\" Jarvis, Winnipeg \"F\" Battery,\n\" Boulton, Commander Scouts.\n\nTo be Lt.Colonels.\nCaptain Peters, C Battery, C. A.,\n\" Drury, \" \" \"\n\" Swinford, 90th Battalion,\n\" Young, Winnipeg \"F\" Battery,\n\" Wise, A. D. C.,\n\" Brown, Q. O. Rifles,\n\" Mutton, \" \" \"\n\" Rutherford, C. A\n\nLieutenant A. E. Doucet, A. D. C.,\n\" H. C. Freer, \"B\" Co., R. S. I,\n\" J. W. Sears, \"C\" \" \"\n\" Pelletier, C. A.,\n\" Coryell, Scout,\n\" Gray, G. G. F. G.,\n\" Ogilvie, C. A.\n\nDr. Sullivan,\n\" Roddick.\n\" Orton,\n\" Graveley,\n\" Bell,\n\" Strange,\n\" Pennefather,\n\" Ryerson,\n\" Codd.\n\nDr. Whiteford,\n\" Grant, G. G. F. G.\n\nTo be Majors.\n\nTo be Captains.\n\nTo be Brigade Surgeons.\n\nTo be Surgeons-Major with rank of Lt.-Colonel.\n\nTo be Surgeons.\n\nIn my letter of the 16th December, 1885, above alluded to, among those recommended for suitable honors appeared the names of Lord Melgund, who was chief of my staff, and Lt.-Colonel Mackeand, 90th Regiment (since deceased), and I added that, had Lt.-Colonel Williams lived, his name would also have appeared in the list.\nAt the request of the Minister, and to my great regret, the recommendation for the decorations was struck out, but I understood that the recommendations for promotions would be favorably considered.\n\nI also, on the 18th of June, 1886, wrote a letter to the Comptroller of the N.W. Mounted Police, bringing before him the names of those officers of that force who had come under my personal observation, and whom I considered deserving of special notice, or as having done good service. Their names are as follows:\n\nLt.-Col. W. Herchmer, \\{ deserving of special\nMajor Steele, \\} notice.\n\nInspector A. B. Perry, \\{ did very good service and showed\n“ Whyte Fraser, \\} great zeal.\n\nFrom the foregoing, I do not think I can be justly accused of having forgotten or neglected the interests of my old comrades.\n\nFRED MIDDLETON,\nLt.-General.\n\nOttawa, August 12th, 1890.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001502.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 18866, "total-output-tokens": 5333, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 211, 1], [211, 211, 2], [211, 1919, 3], [1919, 4247, 4], [4247, 6682, 5], [6682, 8923, 6], [8923, 11131, 7], [11131, 13420, 8], [13420, 15692, 9], [15692, 18153, 10], [18153, 19420, 11], [19420, 20353, 12], [20353, 21214, 13]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]