[{"id": "55cefb2d274871d58d6f81075f6778ad561a4ea5", "text": "OTTAWA,\n\nDEPARTMENT OF INDIAN AFFAIRS,\n\nLIBRARY.\n\n1. All books borrowed from the Library must be duly registered.\n\n2. Only one book allowed to be taken out at a time.\n\n3. Books borrowed to be returned within a fortnight.\n\n4. Books can be renewed for a fortnight if not required by other readers. Renewals must be registered.\n\n5. All injuries to books loaned, beyond reasonable wear, and all losses, shall be promptly made good.\nKATOLIK\n\nAYAMIHEWIMASINAHIGAN\n\nNEHIYAWEWINK\n\nLIVRE DE PRIÈRES EN LONQUE CRISE\n\nCUSTODIAM LEGAM TUAM SEMPER.\n\nKakike ni gu ganweyittten klt Itasiwewin.\n\nMONIYAK\n\nG. O. BEAUCHEMIN & FILS\n\nWetasinhikewâtjik\n\n1885\n\nTATTO PIPUN ASPIN KA NITTAWIKIT JESUS\nLETTRES DE L'ALPHABET CRISI.\n\nA. Long, v. g. apisissia, il ressuscite.\n\" \" \" à la fin d'un mot : niskâ, outarde.\nA. Bref \" anotch, aujourd'hui.\nB. \" \" nábew, homme, sisib, canard.\nC. \" \" náspitch, beaucoup, kitchi, afin que.\nD. \" \" kimodiw, il dérobe.\nE. Toujours accentué, v. g. tande ? où ? sipwette, parts.\nG. Masinahigán, livre.\nH. Sákihew, il l'aime.\nI. Long, sisib, canard.\nJ. Bref, nipiy, eau.\nJ. Kijemanito, Dieu, kijik, le jour.\nK. Kâkike, toujours.\nM. Mitoni, bien, kiyâm, c'est égal.\nN. Nawatch, plus, yotiu, il vente.\nO. Olinew, il le prend, oho, cela.\nP. Pâppiw, il rit.\nS. Sâwan, vent du sud.\nT. Tâpwe, c'est vrai.\nU. Comme ou, mustus, bœuf ; prononcez : moustous.\nW. Wâyo, loin, wiwa, sa femme.\nY. Yeyew, il respire, wiyâbâmâyek, vu que vous le voyez, nipiy, eau.\n\nTelles sont les lettres usitées, pour écrire les sons de la langue Crise. Quand des mots, qui n'appartiennent pas à cette langue, se rencontrent dans ce livre, alors on les écrit avec les lettres ordinaires, reste aux sauvages de les prononcer à leur façon, v. g. Marie, Mani, François, Pâncois, la farine, napayein.\nAPPROBATION\n\nNiya, Ketchi ayamihewiyiniwiyâu, ota mesinahikâsuyân, e ijihikâsuyân, e gih wâbatamâu oma nshiyawemasina-higan, mitoni ni tâpwewokeyiten oma ka itasinahikâték. Tasîpwa n'taweyînitakwaw, n't Awâssimisitik, kitchi gaganaawabatamek, kitchi ayamittayek, e ketsinahuyâu kitchi miyoâbatjihikuyek.\n\n† Vital, Evêque de St-Albert,\n\nAlberta, N. W. T.\n\nPatronage de St-Joseph,\n\n1886.\nPRIÈRE DE SAINT FRANÇOIS-XAVIER\n\nManittowil-Kejemanitowiyan, kakiyaw aylisyinlw wejihat, wikiski eyapitch e mitchetitlik nama otayamihawok. Tapwe mistahli klimakikiwok eka tchekwa e kiskeyittaklik klt ijtawawin. Mitchet wanihuwok e ji wayesihlikntlik matchi manitowa. Haw! kejewatilyan Manito, ekawlya wi-ganawabatta opistahuwiniwanwa, maka nawatch wi-kitabatta ki kosia Jesus omikkum kagth metchikawitit e gih wi-kakwatikhestamawit kakiyaw aylisyinlwa, tchi pikkuhat. Wi-klimakinawik aniki eka tchekwa eyamihatlik, pylv kita wi-kakwe-nissitaweyimisklik. Wi-klimakitta milsiwe otchi ka mawlmustokawiyan. Eok'otchi wi-klimakittawinan, niyan e tapwettatak; Espitcho'teniyak ki nantotamatinan kitchi wi-kaskihilitik nama otayamihawok, Jesussa kitchi witjetjilik ota ašlik, ekusi kitchi kljlkok kita wibamatiwik.\nOT AYAMIHATIK\n\nKijemanito, ka tibeyimiwet, ka ojihikoyak; ki ki miyikonow pimâtisiwin, kita otchi kiskeyimâyak, kita sakihâyak, kita atuskawâyak, ekusi ekuta otchi kita wâbamâyak nipiwâyaki. Eoko oma kekwây kitchi osâmi peyaku-âbateyittamak mina kitchi sakamo-otameyittainak, isko pimâtisiyaki.\n\nOma kitchi kekwây kitchi kaskittamâsuk, n'taweyitchikâtew, kiskeyittamowin, mina mawimustchikewin. Tchikema itastew ayisiyiniw tchi kiskeyimât kijemanitowa mina tchi mâwimustawât, kita wi-nisokkamâkut.\n\nEoko oma masinahigan ki kiskinohamâkuwaw, kita iji-kiskeyimâyek Kijemanito mina kita iji-mawimustawâyek. Kiskinohamatuwina asitji kak-wetjittuwina ota masinahikatewa, wâwâch nanântôk mawimustchike-ayâmihâwina. Nijweyak\nmawimystchikàniniw, emutchipikiskwek, mina e nakumuk, cokotchi ayàmihàwina asitji ayàmilèwinakamuwina masinahikatewa ota. Tàpwé akameyimuk kitchi kiskinohamasuyek ekusi tchi nandottamàwàyek nisokkamàkowisiwin kita ki ijiwebisiyek k’èji n’taweyittamàkoyek.\n\nEkusi tiyotameku, ki ka miyo ayànàwaw ota askik mina’kitchi kijikòk.\n\nMIYO-NIPUWIN\nPRIÈRES\n\nAYAMIHAWINA\n\nEyigok ka waniskâk, ekusi mina wa kawisimuki,\nekusi kita iji ayamihâniwan.\n\nAu nom du Père,\net du Fils, et du Saint-\nEsprit. Ainsi soit-il.\n\nWeyotawimit, mina\nWekosisimit, mina Meyosit Manitô o wiyowi-\nnik, Pitane ekusi ikik.\n\nPATERNOSTER.\n\nNotre Père, qui êtes aux cieux.\n1. Que votre nom soit sanctifié.\n2. Que votre règne arrive.\n\nN'olânân, kitchi-ki-\njikôk eyâyan,\n1. Pitane miyweyîljî-\nkâtek ki wiyowin.\n2. Pitane otchitchipâ-\nyik ki tibeyîljîkewin.\n3. Ka iji natotâkawiyân kijikôk, pitane ekusi iji waškit askamik.\n\n4. Anotch ka kijikâk, miyhinan nipakwejiganiminân, mina tattwaw kijikâki.\n\n5. Ka iji kâsinamâwakitwaw, ka gih matchitotakoyâkwaw; ekusi wi iji kâsinamawininân ka gih matchi totamâk.\n\n6. Pisiske yimînân kitchi eka matchi mami-toneyitamâk.\n\n7. Iyekatenamawininân ka mayatak.\n\nPitane ekusi ikik.\n\n3. Que votre volonté soit faite en la terre comme au ciel.\n\n4. Donnez-nous aujourd'hui notre pain quotidien.\n\n5. Et pardonnez-nous nos offenses, comme nous pardonnons à ceux qui nous ont offensés.\n\n6. Et ne nous induisez point en tentation.\n\n7. Mais délivrez-nous du mal.\n\nAinsi soit-il.\n\nAVE.\n\nKit atamiskâtin Marie, siyâkaskines kakuyan Manito o sâkîhitowin, ki tehîk ayaw Kije-Manito : eyigok kakkiyaw iskwewok kiya ayiwâk k’iteyitagusin ; ayiwâk mina iteyitagusiw Jesus ka kikiskawat.\n\nKitcitwaw Marie, Kije-Manito wekâwimisk, a-\n\nJe vous salue, Marie, pleine de grâces : le seigneur est avec vous ; vous êtes bénie entre toutes les femmes, et Jésus, le fruit de vos entrailles, est béni.\n\nSainte-Marie, Mère de Dieu, priez pour\nnous pécheurs, maintenant et à l'heure de notre mort.\n\nAinsi soit-il.\n\n**Credo.**\n\n1. Je crois en Dieu le Père tout-puissant, Créateur du ciel et de la terre;\n\n2. Et en Jésus-Christ son fils unique notre Seigneur;\n\n3. Qui a été conçu du Saint-Esprit, est né de la vierge Marie;\n\n4. A souffert sous Ponce Pilate, a été crucifié, est mort, a été enseveli;\n\n5. Est descendu aux enfers, le troisième jour est ressuscité des morts;\n\n---\n\nyamihestamawinân piyâstâhuyâk, anotch, mina wi nipiyâki.\n\nPitane ekusi ikik.\n\n1. Ni tapwewokeyimaw Kijemanito Weyotawimit, kakkiyaw kekwây nettawittât, kijik ka gih ojittât, askiy kiki;\n\n2. Jésus-Christ, Kijemanitowa ka peyakuokosisimikut, katibeyimikoyak;\n\n3. Ka Méyosiyit Manitowa ka gih wiyowihikut; ka kanatâtchâkweyit Mariwa, ka gih nittawikihikut;\n\n4. Gih gwatakihaw megwâtch e kitchi ayiwiyil Ponce Pilata; aymihewatikôk gih tchistahâskwâtaw, gih nipiw; gih nahinaw;\n\n5. Atâmaskamikôk gih nittagusiw; e gih nijo tibiskâyik, gih apisisin.\n6. Kijikôk gîh obiskâw, o kitchiniskiyik ciwe, est assis à la nahtapiw olâwiya nû droite de Dieu le Père spitch miyamâtawisiyit.\n\n7. Ekute kila ottuteewi - pe - wiyasuwâlat tatto pemâtisiyit, tatto mina nepiyit.\n\n8. Ni tapwewokeyimaw Meyosit Manito.\n\n9. Ni tapwewokeyiten Katolik ka iji aymihâk, ayamihestamâkewok o Kanatâtchâkwewok;\n\n10. Wi pakitchikâtewa matchi ittiwina;\n\n11. Kita âpisisinâniwiw.\n\n12. Taki kila pimâtisinâniwiw.\n\nPilane ekusi ikik.\n\n6. Est monté aux ciwe, est assis à la droite de Dieu le Père tout-puissant;\n\n7. D'où il viendra juger les vivants et les morts.\n\n8. Je crois au Saint-Esprit;\n\n9. La Sainte Eglise Catholique; la communion des saints;\n\n10. La rémission des péchés;\n\n11. La résurrection de la chair;\n\n12. La vie éternelle.\n\nAinsi soit-il.\n\nCONFITEOR.\n\nN'tâtjimisustawaw Kijemanito, nâspitch ka mâmâtâwisit, kitchitwaw Marie ka kanatâtchâkwet, kitchitwaw Michel, ka kitchi okijikowit, kitchitwaw Jean-\n\nJe confesse à Dieu tout-puissant, à la bienheureuse Marie toujours vierge, à Saint Michel archange, à Saint Jean-Baptiste, aux apôtres, Saint Pierre et Saint\nPaul, et à tous les Saints (et à vous, mon père) que j'ai grandement péché, en pensée, en parole, et en œuvre :\n\nPar ma faute, par ma faute, par ma très grande faute. C'est pourquoi je prie la bienheureuse Marie, toujours vierge, St-Michel archange, St-Jean-Baptiste, les apôtres, Saint Pierre et St-Paul, et tous les Saints, (et vous, mon père,) de prier pour moi le Seigneur notre Dieu.\n\nBaptiste, kitchitwaw Pierre, kitchitwaw Paul, kakkiyaw mina ka miyo ayâtkik kitchikijikôk, (kiya mina, n'ota,) kitâtjimisustâtin e gih matchi totamân ni mamioneyiljiganik, ni pikiskwewnik, n'titiwiwik :\n\nNiya ka totamân, niya katotamân, niya tibiyaw ka totamân. Eoko tchi'k'o kakisimototawakaw wa ka kanatâtkâkwet Marie, kitchitwaw Michel ka kitchi okijikowit, kitchitwaw Pierre, kitchitwaw Paul, kakkiyaw mina ka miyo ayâtkik kitchikijikôk, kiya mina, n'ota, ki kakisimototâtin, kitchi aymihestamâwiyan Tebeyitjiket ki Kijemanitomînow.\n\nNi ga wi-kitimâkeyimikonân Kejewâtisit Manitou, mina ni ga wi kâsinamâkonân ka gih matchi totamâk.\nDÉCALOGUE\n\nKIJEMANITO OT. ITASIWEWINA.\n\n1. Piyeyakut Kijemanito omanitomih; kitehik otchi mina sakih.\n2. Ekawiya wikkâtch wiyakim Kijemanito; ekawiya mina wiya kitamaw ot ojitjigana.\n3. Ekawiya ojitjike eyamihewikijikâki; peyat tik ayamiha.\n4. Ki nikihi kwok manâtjitotawik, kinowes kitchi pimâtisiyan.\n5. Ekawiya nipattâke; ekawiya apow mamitoneyita kitchi nipattakeyan.\n6. Ekawiya pisigwâtisi; ekawiya apow pisigwatchimitoneyita.\n7. Ekawiya kimotamàw awiyàk ot ayàna; ekawiya mina ganaweyita kekway e gih kimodinàniwik.\n8. Ekawiya wikkâtch, kiyàski; ekawiya mina matchiayimom awiyak.\n9. Peyakuhituk wiyekituyek; ekawiya pitus awiyak musitawinawik.\n10. Ekawiya gagayesinahike.\nCOMMANDEMENTS DE L'ÉGLISE\n\nAYAMIHEWITASIWEWINA.\n\n1. Manâtjitta kitchi kijikawa.\n2. Eyamihewikijikâki wawâch kitchikijikâki, wilji ayamihamâkàn ayamihêwiyiniw Lamesse etweji.\n3. Kakkiyaw ki matchi ittiwina atjimustawâk-kàn ayamihêwiyiniw seyâkes peyakwaw tattwaw askiwiki.\n4. Tattwaw âpisisino kijikâki ki ka wi kaskit-tamâsun kitchi saskamuhikawiyàn.\n5. Tattwaw askiwiki newaw kitchi payiki iyewanisihisukkàn miya nemitanaw kijikaw mayawes espayik Pâk, mina tattwaw wâpaki wi iji kitchi kijikaki, eyigok wittamakâwiyàni.\n6. Eyamihêwatîkokijikâki, ekawiya wiyâs mitjikkân.\n7. Kîta wi-miyaw ayamihêwiyiniw kitchi otchi pimâtjhut.\n\nGLORIA PATRI.\n\nPitane mamiteyittagusit Weyotawimit, mina Wekosisimit, mina Meyosit-Manito.\nOskatch ka gih iji mamiteyittagusit, anotch ka iji mamiteyittagusit mina taki, taki. Pitane ekusi ikik.\nACTES\n\nADORATION\n\nManatjihatâk Kijemanito.\n\nKiya ka omanitomimitân, ki peyaku manâtjihitîn; ni kiskeyiten e gih kijihiyân, nâspitch e tibeyimiyan, misiwe kekwây mina e tibeyitaman.\n\nFoi\n\nTapwettawâtâk Kijemanito.\n\nNi Manitom, soki nitâpwewokeyitten eyigok ka tapwetakwaw, mina ka kiskinohamâketwaw gwayask ka ayamihâtjik, wetjitawi tiyâpwemâgak kit itwewin.\n\nESPÉRANCE\n\nMamisitolawâtâk Kijemanito.\n\nNâspitch ni mamisin ki kijewâtisiwin, ni Manitom, wi sokiteheskawin ota askîk, kit itasiwe-win kitchi nanagataweyittamân, kijikôk kitchi pittukahiyân.\nCHARITÉ\n\nSâkihatâk Kijêmanito.\n\nNi Manitom, espitch otehiyân ki sakihilin,\nn’itji ayijiyiniwok wawâtch kakkiyaw, espiteyi-\nmisuyân n’tispiteyimâwok kiya otchi.\n\nCONTRITION\n\nKakwatakeyimutâk.\n\nNâspitch’ni kakwatakeyimun, Kijêmanito n’ota,\ne gih kichiwahitân kiya e kijewâtesiyan mina e\nsâkihigusiyân mamawîyes; iyepine e pakwâtat\nawiyak e matchi ijittwât, ni kiskeyiten; kiskisi\nmaka ki kosis Jesus ka gih iji-kakwatakîtât e wi\nkâkitjihisk niya otchi. Namâwiya ayiwâk ki ka\nkichiwatin, nisôkamawiyani, ni ka-wi otchi gwâ-\ntakihisun.\n\nREMERCIEMENT\n\nNanâskumatâk Kijêmanito.\n\nOsâm e gih miyotôtawiyan, ni Manitom, e gih\nayijiyiniwhiyan, e gih pe itisahamawiyan ki\nkosis kitchi pikuhit, ekwa mina e gih iteyimiyan\nkitchi witjihîweyân kit ijittwâwinîk, ki nanâsku-\nmiîn espitch otehiyân.\nOFFRANDE\n\nPakitinamawâtâk Kijemanito ettiyâk.\n\nNi Manitom, ki pakitinamâtin ni mitoneyitjigân, n’t on, n’t ittiwin, ni pimâtisiwin, misiwe n’t ijiwin, misiwe iji e note-atamihitân.\n\nHUMILITÉ\n\nPiweyimutâk.\n\nNi Manitom, e kiskeyitamân osâm e pakwâtamân ayiwâkeyimuwin, ki mawimustâtin kitchi iyekatenamawiyân eoko, tânisi kita iji piweyimuyân wi kiskînohamâwin.\n\nDEMANDE\n\nNatotamâketâk.\n\nKakkiyaw kekwây Nettawittayan, ki natotamâtin kita opimâtjhuyân, eka’ kitchi akusiyân, eka kitchi wayeskânisiyân; maka osâm iyinisiwin ki natotamâtin kitchi nahittâtân, wawâtch kitchi otittamân ka gih kaskittamawit Jesus-Krist. Pitane ekusi ikik.\n\nKitchitwaw Marie kitchi mawimustât.\n\nKijemanito wekâwimisk, ki mawimustâtinân kitchi ayamihestamawiyâk; ekawiya sakittowi-\nnāh ka iji n'taweyitamātāk, tiyagwatch winisokamāwinān osām e kitimākiśiyāk, wi kaskittamāwinān eka kitchi sākutjihikuyāk matchi ayiwiwin. Pitane ekusi ikik.\n\nOkijiko ka ganaweyimikoyak kitchi mawimustāt.\n\nWekijikomimitān, kiya ka gih miyikawiyan kitchi ganaweyimiyan, wi witjewin, kakike wi kiskinotahin kitchi miyo tagusiniyān eta ka n'taweyimikawiyān. Pitane ekusi ikik.\n\nKakike sakihātan nepustamākoyak.\nAYAMIHAWINA\n\nAVANT LA CONFESSION\n\nWA-ATJIMISUKI.\n\nOta k'o pe otjikwanapiyân anotch, ni Manitom, e wi atjimustawak kit ayamihewiyinim tatto ka gih petchi matchitotamân : wi otjikamâwin mitoni kitchi kiskisopayiyân kakkiyaw, gwayask kitchi metchi atotamân espitch otehiyân mina kitchi kesinateyitamân. Pitane ekusi ikik.\n\nAPRÈS\n\nPiyoni-âtjimisuki.\n\nNamawiya ekwa ki pakwâsin, ni Manitom, ki mâmâtawihâgan e gih kâsinamâwit, e gih kanât-jittamâwit nit atchâkwa ; kâwi ki miyweyimin, kâwi ki miyweyittamawin tatto ka miyo totasoyân e wi kitimakeyimigowisiyân ; ejî-kitimakisyân megwâtch e kikiskâkuyân matchi ittiwin, namawikkâtch pa gih kisipanopan ni gwâatakittawin atâm askamikôk. Maka ekwa e gih kâsinikâteki ni matchi ittiwina piko kitchi gwatakilhi-\nsuyàn waskit askamîk megwâtch e ayâyân, ekusi mitoni kitchi ganaweyimisuyàn eka kitwâm kitchi pâstahuyân. Haw! ni Manitom, wi sokiteheskawin, ka iji miyo omitoneyitjiganiyân anotch, isko pimâtisiyâni kitchi iji miyo omitoneyitjiganiyân. Pitane ekusi ikik.\n\nAVANT LA COMMUNION\n\nWa-saskamuki.\n\nKejewâtisiyan Jesus, e ata eka mosis wâbamitan, keyiwek ki tâpwewokeyimitin Eukaristiwiñk e ayâyân; kiya'kâ pe-nansiyan siyâskamuhi-kawiyâni, ni ketsinâhun. Tasipwa miyâmaskata-man eji kijewâtisiyan e wi iji miyototawiyân, e ata piweyilagusiyân. Ayiwâk mana e nipewisiyân miyâmmitoneyitamâni ka gih pe ijiwebisiyân. Ki mawimustâtin kejewâtisiyan, kitchi wi miyo-kâsinamawiyan. Nâspitch ki n'taweyimitin n'tehik taki kitchi ayâyân. Pitane ekusi ikik.\n\nAPRÈS\n\nPiyoni-saskamuki.\n\nPâskatch ki gwatate iji nanâskumitin ispitch mamattakuhîyan, e gih wi petchiteheskawiyan anotch, ni Manitom, e ata eka iteyitagusiyân kitchi iji-miyototawiyân. N'âskiganîk kit asiwasun. Haw! mitoni wi-ganaweyimin. Ka iji kisleymikawiyân kijikôk, ekusi nista taki ki wi iji kis-\nteyimitin. Namawikkâtch ki ka ki tebinanâskumitin, osâm e atamihiyan. Tebiyâk ekuyigok ni ka kakwe miyo ayiwin nawatch kakiyipa kitchi miyo kaskittamasuyân. Pitane ekusi ikik.\n\nAVANT LES REPAS\n\nWa-mitjisuki.\n\nKijemanito n’ota, ni ka wi-miyoskâkun oma anotch ka wi asamiyan. Pitane ekusi ikik.\n\nAPRÈS\n\nPiyoni mitjisuki.\n\nKejewatisiyàn Manito, ki nanâskumitin e gih asamiyan anotch kitchi opimâtjihuyân. Pitane ekusi ikik.\nLA SAINTE MESSE\n\nLAMESSE ET WEKI\nKITCHI MIYOWITJIHIWEK\nAYAMIHAWINA\n\nCOMMENCEMENT\nKelchi ilweki Lamesse.\n\nE ata piweyitagusiyân, ni Manitom, keyiwek ota ni pe pitukân e wi wâbatehitân espiteyimitân. E kiskeyitamân osâm e 'atamihiwakiyan wiyebinâsustakawiyani, ni tehik tebiyâk otchi ni wi witjihiwân oma anotch ka wi iji webinasustaka-\nwiyan. Tanisi ni ka gih omitoneyitjigani gih wâbamak megwâtch e âkwamut ayamihewâtikôk, Ana ka gih wi nipustamakoyâk; ekusi ni ka wi iji omitoneyitjiganin anotch. Wi kitimakeyimin, ni kitimâkisin.\n\nCONFITEOR\n\nIyâtjimisuki.\n\nKi kiskeyimin, ni Manitom, eji kitimâkisiyân, eji matchi ayiwiyân; osâm mitchetwaw e petjikichiwahitân. Ni pastahikun ni mitoneyitjigan, ni pastahikun n't'on, ni pastahikun n't'ittiwin,\nniya e totamân, niya c totamân, niya tapwe e totamân. Ki pettawin eji piweyimisuyân; wi kitimakittawin, wi kâsinamawin: Okanatâchâk-wewok ni mawimustawawok kakkiyaw kita wi ayamihestamâwitjik.\n\nKirie eleison etweki.\n\nNit atchâkunanak wejihatwaw, kitimakeyimik kit ojitjiganak; Weyotawimikawiyân, ki kijewâtisin, wi saweyimik kit awâssimisak.\n\nKiya ka gih kaskittamawiyâk pimâtisiwin e gih nipustamawiyâk, wi hisokamawinân kitchi nangataweyitamâk ka gih iji miyokaskittamawiyâk.\nKejewâtisiyan Jesus, ekawiya ataweyiminân e ata piweyitâgusiyâk; tiyakwatches kâsinamâwinân ni matchi ittiwininana.\n\nGLORIA IN EXCEESIS\n\nOkijiko wi-nakamuwin eyamitâki.\n\nKita wi, kisteyimaw kijikôk eyât Kijemanito; kita wi mamâtagusiwok waskit askamik ka miyo-tehetjik ayijîyiniwok. Namawiya eka taki kita mamitjimitân, Wekijemanitomimitân: nâspitch ki kisteyimitin; espitch otehiyân mina ki nanâskumilin e gih kitimâkeyimiyan, Piyeyakomañitowiyan, memâtlawisiyan, Weyotawimikawiyan.\nMenitowiyan Jesus, Piyeyako okosissimisk Tebeyitjiket; kakkiyaw kekway tebeyitaman, matchi ittiwinà kitchi pe kàsinamawiyàk, ki ki iji pe-itisahukawittay: haw! wi pikuhinàn, kiya piko nama kekwày ki pwàtawìtàn; kiya piko ki pa gih kaskihinàn osàm è màmàltawisiyan.\n\nDominus vobiscum.\n\nEyamihestamàgeki.\n\nKa natotamàskik Okanàtchàkwewòk e itwes-tamakoyàkwaw, wi miyhik; ka iji n'taweyitamàsk mina kit atuskeyàgan anotch, e'itwestama-koyàk, wi tàpwettaw. Oma nista ka witjihi-\nweyâⁿ, ni wi ayamihestamowâwok n't otemak, nitji ayijiyiniwok wâwâtch kakkiyaw; soki ki natotamâtin, Tebeyimiywâk, nete kitchi miyowabamitâk.\n\nL'Epitre eyamiltâki.\n\nNi Kijemanitom, ki gih kiskeyittamohin kit itasiwewin, e gih etchikâ ani ayiwâkeyimiyân niya, eyigok ole kutagak ka osâm ayititjik eka iskwa e kiskeyimiskwaw. Espitch otehiyân ni wi nanagataweyîten ki pekiskwewin e tâpwewokeyitâmân. E ikik mana, niyâk ka gih kiskeyitamo-hiweyan e wi ikik, ayiwâk ni mamattagusin:\nk'ejî; sâkihiskwâw Okanâtâtchâkwewok, pitane nista ekusi iji sâkihitân: ka gih iji n'daweyimi-kawiyan kayâs, ekusi kit iji n'daweyimitin anotch. Wi kitimâkittawin.\n\nL'Evangile eyamittâki.\n\nKejewâtisiyan Jesus, kiya tibiyaw ki pekisk-wewin ka miegwa ayamittât ayamihewiyiniw, tâsipwa nepâwiyân kita kiskeyîmikawiyân eji râpwewokeytamân. N'iskatikôk n't ayamihewâtikonamâsun eka wikkâtch kitchi nipewisistamân ki kakeškikemowin otchi; n'tonik, kitchi mami-tjittamân ayamihâwin; n'tehîk - kâkike kitchi\n'sâkittayân, kitchi ganaweyitamân wâwâch. K'êji n'daweyimiyan kitchi ittiyân, ni wi ittin : maka ayiwâk ni wi sâkujihikun matchi ayiwiwin : wi nisokamawin, wi sokiteheskawin kitchi sâkujittayân. Pitane ekusi ikik.\n\nCredo eyamittâki.\n\nTâpwewokeyitamowin.\n\nNi tâpwewokeyimaw Piyeyakumanitowit. We-yotâwimit, nâspitch ka mâmâtâwisit, kijik, askîy mina ka gih ojittât, wâwâch kakkiyaw kekwây niyogwaki, eka niyogwaki mina.\n\nNilapwewokeyimaw Jesus-Krist, Tebe'yimiko-\nyak, e peyaku-okosisimikut Kije-Manitowa; k'ei Manitowi'yit, k'ei mâmättawisiyit wâwâtch, wekosisinikut, ekusi wista eji manitowit, eji mâmättawisi't-mina. Taki gih ittaw, namawik-kâtch kita pont ittaw; gih pe ayijiyiniwihisuw, wiya tibiyaw e wi kiskinohamowât ayijiyiniwa; gih nipustanawew ekusi e wi iji kaskittamowât pimâtisiwin; gih âpisisin'; kijikôk gih obiskaw. Ekute otchi kita pewiyasuwtew ayijiyiniwa.\n\nNi tâpwewokeyimaw Meyosjt Manitow ka pimât-jihiwet, ka iyinisihiwet, ka Kijemanitowit k'ei Manitowi'yit Weyotawimimit, Wekosisimit mina.\n\nNi tâpwewokeyiten ka peyakumiywâsik ayami-hewijittwâwin Katolik ka iji-ikâtek: matchi itti-wina wi kâsinikatewa; wi âpisisinaniwiw, taki wi pimâtisinaniwiw. Pitane ekusi ikik.\nOffertoire\n\nPakitinamâgewin.\n\nWeyotawimimikuwiyan Manitô, osâm ni piwe-yitâgusin niya, kitchi pakitinamâtân anotch ka pakitinamâkawiyan; maka meskutch ni teh, ni yaw, nit atchâk, ki pakitinamâtin : wi peyakutibeyimin.\nLAVABO\n\nKâsitchitchevin.\n\nTebeyimiyâk, wi kanâljittamâwin nit atchâk, wi kitimûkeyittamâwin, eka wikkâtch kitchi iyepâtjihikut matchi ittiwin.\n\nWeyotawimimitân Manito, nâspitch ni pagusittân kitchitwaw webinâsûwin ka megwa pakitina-mâkawiyân, kitchi miyo-abatjihikuyân, tattô mina ka gwayask ayamihâtjik, kitchi miyo-abatjihikutwaw.\nPRÉFACE\n\nMamitjimiwewin.\n\nMiyamâtlâwisiyan Manito, kijikôk ki mamitjimikwok Okanâtâchâkwewok wâwâtch kakkiyaw; pâskatch namawikkâtch tebakeyimuwok espitch mâmattaguhatwaw. Niya wiya, e ata piweyitagusiyân, keyiwek, tanisi etiskwaw memitjimiskwâwi, nista ekusi ki wi ilitinî.\nSanctus.\n\nKitchitway! Kitchitwaw! Kitchitwaw! mâmas-kateyitagusiw kijikôk, mamaskâteyitagusiw was-kit askamik, Tebeyimikoyak Manito. Okijikowa mâmitjimik; Ayijiyiniwa mawimustâk.\n\nSiyewipitjikeki.\n\nKijamanito, Weyotawimimitâk., wi saweyimik ayamihewiyiniwok, nit otemak, tatto mina ka miyweyimitjik, tatto mina ka pakwâsitjik; wi kitîmakeyimik kakkiyaw.\nCONSECRATION\n\nMeskutchimuttâgewin.\n\nIskwayâtch Jesus ka gih witospamât o witjiwâgaña, e gih otinât pakwejigana, gih nanâskumuuw; ekusi e gih mâtinamowât o witospamagana, omisi itew: \"Otinik, Mowik Etasiyek, Eoko Oma Ni-Yaw.\"\n\nEkwa mina sominâpwîy e gih otinak kitchiwa minikwâtjiganik e asiwateyik, nanaskumuuw ekusi e itisinahamowât o witospamagana, mina itew: \"Otinamuk, Minikwek Etasiyek, Eoko Oma Ni Mik.\"\nÉLÉVATION\n\nOppinigewin.\n\nKejewâtisiyan Jesus, kiya tibivaw eji Manitowiyan, eji ayijiyiniwiyan mina, ka megwa opinikawiyan; ki nawokislâtin e manatjihilân. Ekwa tapwe niyokuttamawiyan espiteyimiyan, e pe webinisuyan ota, niya otchi.\n\nEoko anima ki mik ka, asiwatek kitchitwaw minikwâtjîganik; ka megwa oppinamik; ni nawokisten e manitokataman; eoko ka gih meschika-\nwittâyan niya otchi: namawikkâtch ni ka wani-\nkiskisin ki kijewatisiwin.\n\nNi Manitom Jesus, webinasuwinâtikôk eyâyan\nmegwâtch, ki nanaskumîtin ispîch otehiyân osâm\ne gih kitimakeyimiyan. Namawikkâtch ni ka\nwanikiskisin ayamihewatikôk e.gih nipustamawi-\nyan; ki mik e gih mestchikawittayan, e wi kas-\nkittamâwiyan nit atchâk eka kita matsustewebinit.\nNi mamaskâten eji kijewâtisiyan, osâm misiwe\niji e wi miyototawiyân, e ata matchi ayiwiyân.\nNâspitch ni kesinâteyîten tanisi e gih petji matchi\nijiwebisiyân: wi sokiteheskawin eka wikkâtch\nkitchi matchitotamân.\n\nOkâsinamâkewiskutek ka megwa gwatakittâjik,\nwi pikuhik, ekwa miyawâtikwanôk wi pitukah-\nhik; niya mina niyânk ki natotamâtin ki gîk\nkitchi pitukahiyan ela eyâtjik siyâkihiskwaw. Pi-\ntane ekusi ikik.\n\nPATER\n\nN'otânân eyamittâki.\n\nAyiwâk ni kitimakeyimigowisin, n't eyiten, e\notawâsimisimimiyan, ni Manitom, eta eyâyan ki\ngîk kitchi ayayân e iteyimiyan; miyâmitoneyitâ-\nmâni mana, ayiwâk ni miyweyîten. Misiwe ki\nka wi-kiskeyimikawim, misiwe ki ka wi manâtji-\nhikawin. Ni teh wi peyaku-tibeyitta. Ekawiya sa-\nkittowin kita opimatjibuyân. Metchitotakawiyâ-\nni ispîch otehiyân ni pakiteyîten mana, ekusi\nwi-ijt-pakiteyitamâwin metchitotamâni; wi soki-\nteheskawin eka kita sakutjihikuyan matchi mitonevitchigan. Wi iyekatenamawin matchi ittiwin; eoko osâm e kitimahiwemagak. Pitane ekusi ikik.\n\nCOMMUNION\n\nEyamihewi Saskamuki.\n\nKiyanishamowatwaw ayijiyiniwok o matchi ittiwiniwawa, wi kitimakeyimin taki kitchi nahittatâk, ki n’daweyitamatinân.\n\nEkuyigok meyo ayiwiyan kitchi witjiwakwaw\nka osāmimiyo ayiwitjik tattwaw kijikāyiki e kas-\nkittamasutwaw kitchi saskamuhitjik, ayiwāk ni\npa̱miyweyiten; maka osām ni piweyillāgusin\nekusi kitchi iji miyokaskittamasuyān. Kejewati-\nsiyan Jesus, kakkiyaw kekwily keskeyitaman; ki\n\nkiskeyimin nista nāspitch e n’daweyimitān anotch\nkitchi petjiteheskawivan: wi kāsinamāwin ni\nmatchi ittiwina; wi kanatātchukwehin. Ni gas-\nkeyiten nista e wi saskamuhigusiyān: ki tāpwe-\nwokeyimitin Eukaristiwinik; ki pagusihitin is-\npitch otehiyān, ki wi sākihitin laki. Pitane ekusi\nikik.\nKeji itweki Lamesse.\n\nKije-manito Weyotawimimitâk, ki nanâskumitîn, osâm e gih miyo totâwiyan, e ata êkâ iteyi-tâgusiyân kitchi iji miyoganawabamiyan. Nas-pitch ni miyweyiten e witjihîweyân wiyebinâsus-takawiyani. Kispin tanisi naspâtch n'toten anotch ota ka witjihîweyân, ki mawimustatin kitchi wi-kâsiuamawiyân. Tattwaw witjihîweyâni ni ga wi miyo-ayamîhân, wi sokiteheakawin eka kitchi sakujîlhikuyân naspâtch mitoneyitjîgan. Pitane ekusi ikik.\nCHEMIN DE LA CROIX\n\nAYAMIHEWATTIKOMESKANA\n\n(Air) SUIVONS SUR LA MONTAGNE SAINTE.\n\nTaki wi-pimitisawâtâk\nKi kitchi Kijemanitominow\nE ki iji-wi-kwatakittât\nKiyânôw (2) e wi-atâwet.\n\n(Devant l'Autel.) Wéhînâsuwinâtlikok tehîki kitchi ayamihâk.\n\nEkwa ka wi-agamîhâyâk, e wi-papamîtoneyittamak Jesus okwatakîlâwin. Kakwe mitoni keskisîtâk tânisi, ka ki iji-kwatakîhit kiyânôw otchi. Ki ka witjewânôw kitchîtwa Marie e pimitisahwât Okosissa e n'tawi-nipahimit.\n\nJesus ni Manitominân, e ki ijisâkihiyâk pâskatch k'o wi-kwatakîhikawîyan, e wi-pimâtjhîyâk, wi-kitimâkittawînân, anotch ka wi-nanagataweyittamâk ka ki iji-nagatamâwiyâk, taki tchi kiskisîtôtâtâk. Kitimâkeyimîk n'toteminânak, tatto kâssinamâkewiskutek eyâtjik keyâpitch; mina ki ka winisokkamâwâwok tatto eka tcheskwa eyamihâtjik, kita otinakwaw kit ayamihâwin.\n\nAta eka e matchi tôtak,\nMâmatchi itaw, wiyasuwâtaw,\nKiyâm kita tchistâhâskwâtaw,\nKâkiyaw (2) eji tepewewok.\nJésus condamné à mort.\nIre STATION.\n\nJesus naspitch ki manaijihitinân mina ki nanaskumitinân.\nKiya ka nipustamâwat ayisiyiniw e wipimâtjihat.\n\nJesus wiyasuwâtaw kita nipahit.\n\nNanagataweyittamwâtâk Jesus eka e ki naskwât, pikonata âta ekusi eji-misimit. Kiskisitan maka, namâwiya Ponce Pilate piko ka ki ijitepakimât kita nipahimit; kiyânow mina ka ki wiyasuwâtayak. Kakiyaw metchi pimâtisitjik ka ki totawâtjik o pâstâhuwiniwawa otchi. Ekusi itâtân maka ki tehinâk:\n\nMenitowiyan Jesus, ni kiskeyitten e ki nipahikawiyan ni matchi ittiwina otchi; wi-miyin kita kesinâteyittamân espitchotehiyân. Ekuyigok ni wi-kesinâteyitten, ni wi-kakwatakîhisun wawâtch tochi wi-kâsiñamâkowisiyân.\n\n\"N'otâwinân kitchi kijikôk eyâyan\" .... etc. itwâniw, mina \"kit atamiskâtîn Marie\" ....?\n\"Pitane mâmiteyittâkusit\" ....?\nTebeyimitâk, wi-kitimâkeyiminân.\nHawâl wi-kitimâkeyiminân.\n\nSâsây e ki wiyaguwâtit,\nWiwahaw ayamihewattikwa,\nAta'e wi-sâkotchihikut,\nMisiwe (2) iji-totawaw.\nJésus est chargé de sa croix.\n2de STATION.\n\nJesus nāspitch ki manātjihitinān mina ki, nanāskumitinān.\nKiya ka ki nipustamāwat ayisiyiniw e wipimātjihat.\n\nJesus wiwāhaw ayamihewāttikwa.\n\nOta māmitoneyittatān ki Manitominow e wiwahit ayamihewāttikwa. Ketchina osām mistahi ki wi-sākohikuw e ki kakiskiwepahut, eki papasastchut, eyiwek ki tebeyimow kitchi pwāwātahit ayamihewāttikwa.\n\nMeyosiyan Jesus namawiya kiya ata kitchi onikātat ayamihewāttik, maka niyān eji matchi ayiwiyāk. Tebiyāk miyinān peyattik kitchi navattamāk tatto kekwāy eyimak wetittikoyāk waskitaskamik ekuta otchi tchi kāssinamasuyāk\n\n\"N'otāwinān, kitchikijikok eyāyan\"......etc.\n\"Kit atamiskātin Marie \"......etc.\n\"Pitane māmiteyittāgusit \"......etc.\nTebeyimitāk wi-kitimākeyiminān.\nHaw? wi-kitimākeyiminān.\n\nPiyis nestūpinataw Jesus,\nK'o kawiskosut eji-pwāwatet,\nPasikotisahwaw eyiwek,\nAyiwāk (2) ekwatakihit.\nJésus tombé une première fois.\n3me STATION.\n\nJesus nāspitch ki manātjihitinān mina ki nanāskumitininān,\nKiya ka ki nipustamāwat ayisiyiniw e wipimātjihat.\n\nJesus nāstam kewiskosut.\n\nSāsāy Jesus mātji-amatjiwehaw, maka kiyipa ki kawiskosuw; tchikema osām e nestukwekawit, kekātch e ki metchikwekawit, ka ki papa-sastehut mina ka ki pasikwepitit. Namawiya mayo ki pasikow. Eyāpitch pakamapahwaw, takiskawaw, matchi espinemaw wawātch.\n\nNi kiskeyitten niya ka totātān, ni Manitom, osām mitchetwāw ni gih matchi pakisinin; ekokotchi k’o wi-kāwiskosuyan kitchi kassinamāwiyan.\n\nMeyosiyan Jesusē, misiwe iji ni wi-kitimahikawinān: Maskawishinān kitchi eka-sākoteheyāk. Sittoninān kitchi eka matchi pakisiniyāk, megwātch ota pemālisiyāk piyis kita witapimilātāk īte eyāyan.\n\n“N’otāwinān kitchi kijikok eyāyan”…… etc.\n“Kit atamiskātin Marie”…… etc.\n“Pitane mamitevittāgusit”…… etc.\nTebeyimitāt, wi-kitimākeyiminān.\nHaw! wi kitimākeyiminān.\n\nMegwātch e iji-kitimahit,\nWawātch e papakamāpahut,\nJesus okawiyā wāpamew,\nMariwa (2) e nakiskākut.\nJésus rencontre sa mère Marie.\name STATION\n\nJesus náspitchi ki manátjihitinan mina ki 'na-\nnáskumitinan.\nKiya, ka ki nipustamáwat ayisiyiniw e wi-\npimáljihat.\n\nJesus okawiya nakiskawew.\n\nJesus e ki pásikot atimuttew, ka nakiskawât\nOkawiya. Ekuta ki ispayiw kitchi kaskeyittamo-\nwin. Jesus mina Marie moskuhituwok, e wábattu-\ntijik ejí-kitimákinağusitijik. Tápwe piko ki kitimá-\nkisisiwok. Marie-osám ayimeyittam, maka náspitch o n't'aweyitte kitchi kitimákeyimikowâyak\nKitemanitowa, k'o pakitinât tchi nipahimit.\nKetimákinağusiyân, kejewâtisiyan Marie, ki\nnanáskumitin e ki pakitimáwiyan ki Miyó-\nJesus kitchi nipustamáwit. N'taka niyâk, ki ki\nsâkihin. Ekwa, Nega, ki pakitinamâtin ni teh,\nkitchi sâkihiłân, ki kosis mina kitchi sâkihak.\n\n\"N'otawinân kitchi kijikok eyâyan....\"\n\"Kit atamiskâtin Marie.......\"\n\"Pitane mâmiteyittâgusit.......\"\nTebeyimitâk, wi-kitimákeyiminân.\nHaw! wi-kitimákeyiminân.\n\nNáspitch kitchi mâmaskâtamik\nManito ka tibeyitçhîket\nPiko kitchi nisokkamât ekwa\nE nestut (2) osám e totât.\nSimon aide Jésus à porter sa croix.\n5me STATION.\n\nJesus nàspitch ki manÀljihitinàn mina ki nanàskumìtinàn.\nKiya ka nipustamàwat ayisiyiniw e wipimâtjihat.\n\nSimon ka Itlt., nayattamàwe ni Jesussa otaya-mìhowàttikomìlyiwa.\n\nMàmaskâteyimàtak Jesus e wi-nisokkamàkut ayisiyiniwa e ata pimâtjihiwet. Ekuta mina mosìse ki kiskinohamàkonow kitchi witje-kakwàtkeyittamwàyak, ekusi mina kitchi pakitinamàwàyak kakiyaw ki kitimákisisiwininowa.\n\nTebeyimiyàk Jesussè, ki ki note-kakwàtakihestamàwin, miyìn ekuyigok, kita-sàkihisuyàn eka kita wi-iyekatenamàsuyàn kitimákisisiwinissa ka olìttikuyàn. Kiyàm ni ga miweyitten ekusi tiyotàkawiyànì. Tchikema ni kiskeyitten ekusi iji piko ni ga ki tipahamàwaw Kijemanito; piyìs miyàwàttikwanok kitchi nokuttamàwit espitèyimitji.\n\n\"Nòtà'winàn, kitchi kijikok eyàyan......\"\n\"Kit atamiskàtin Marie......\"\n\"Pitane màmitèyittàgusìt......\"\nTebeyimitàk, wi-kitimàkeyiminàn\nHàw! wi-kitimàkeyiminàn.\n\nMegwàtch ejì-ispinemìmit\nOskijikoyìk e sikkwàtìnit\nPeyak iskwew kejewàtìsit\nJesussà (2) pe-kàssikkwenew.\nVéronique essuie la face de Jésus.\n6me STATION.\n\nJesus ki manâljihitinan mina ki-nanâskumiti-nân.\nKiya, ka nipustamâwat ayisiyiniw, e wipimâljihat.\n\nVeronique ka itlt. kassikkwehwew Jesussa.\n\nKiskisitan ka gih totak eoko iskwew. Sokki e wi-wâbamât Jesussa, ki iyekatenew simâganissa asitji omatchi pînâtisiwa e mitchetiyit. Osâm kitimâkînâwew Jesussa e mikkowikkweyt, e iyepatisikkwemit wâwâtch. Ekuta ka pe-kâssikkwehwât. Ekusi Jesus ki masinawekwesuw o kâssikwâganiyik.\n\nNi Manitom mamawiyes ketawâsissiyan, ki nawokistâtin, ki manâljihitin, ki mamaskâtîtin e wi-iyepatisikwâtikawiyan, k'otchi kiskinohamâwiyan, eyigok pekwâtikowisîyân, e pakitinak niłatchâk kita iyepâtjihihut matchi ultiwin; ki mawimuslâtîn kitchi ganâljittamâwiyan, mina kâwi kitchi miweyimiyan.\n\n\"N'otâwinân, kîtchu kijikok eyâyân......\"\n\"Kit atatamiskâtîn, Marie......\"\n\"Pitane mâmitêyittâgusît......\"\n\nTebeyimitâk, wi-kitimâkeyiminân.\nHaw! wi-kitimâkeyiminân......\n\nNameskwa âbittaw meškanaw,\nTakussin, katibeyitchiket,\nMina ka-kawiskosûi kittwâm\nMaka'ni (2) nama'wâtch kitow.\nJÉSUS TOMBE UNE SECONDE FOIS.\n7th STATION.\n\nJesus ki manâtjihitinan mina ki nanâskumilitinan.\nKiya, ka nipustamâwat ayisiyiniw, e wipimâtjihat.\n\nSâsây mina kawiskosuw Jesus.\n\nGanawâbâmâtâk ki Manitominow eyâpitch ke-wiskosut. Eyâpitch pimisin kitchi koppâtchihikut o nipattâkewa, ka kitimahikut. Ekusi ki wi nokuttamâkonow eyigok siyâkihikoyak; ki kiskinohamâkonow ejinâgusiwâyak, kâkike ka mamatchi papakisiniwâyak.\n\nMeskawisiyan Jesus, sâsây mitchetwaw ki ki asotamâtin eka kittwâm kitchi pastahuyân, maka kâkike ni mâmisiwântjihisun. Ekwa maka mitoni ki mâwimustâtin kitchi tapweyimiyan. Maskawisihin eka kita wânitâyân, ka ki kaskittamâwiyan, e ki kakwatakihestamawiyan.\n\nN'otawinân, kitchi kijikok eyâyan, etc.....\nKit atamiskâtin, Marie, etc.....\nPitane mamiteyittâgusit, etc.....\nTebeyimitâk, wi-kitimâkeyiminân.\nHaw! wi-kitimâkeyiminân.....\n\nEkawiya mawikâsikkék,\nItew anîhi niyo iskwewa;\nAyîwâk kitimahisowok.\nKa iji (2) kitimahitwaw.\nJésus console les femmes qui le suivent.\n8me STATION.\n\nJesus naspitch ki manâtjihitinân mina ki nanâskumâtinân,\nKiya ka nipustamâwaw ayisiyiniw e wipimâtjihat:\n\nJesus kakîtjhew atti miyo iskwowa e mawikâtikut.\n\nAtit miyo iskwêwok namawiya wijihiwewok Jesusa ka kwatakihimit. Kitimâkinâwewok e mawikâtâtjik. E ki asâbamikutwaw Jesusa omisi ki itikwok: \"Ekawiya mawikâsik, nawatch kitawassimissiwalwok mina kit otemiwa-wok kitchi mawikatâyekwaw.\"\n\nSiyâkihigusiyân Jesusé, kiya ka ki wi-kitimâkeyimalwaw kwetakîtâtjik, nisokkamâwin, pwe-tawittayân' mana haskeyittamowin. Ata ketimâkinâgusiyân, namawiya ketchina kiya kita mawikâtigusiyân, niyanân maka kekişkamâk mat-chi ittiwina. Miyinân kitchi mawikâtisuyâk e ki petchi pâstâhuyâk.\n\nN'otâwinân kitchi kijikok, etc.....\nKit atamiskâtin, Marie, etc.....\nPitane mâmiteyittâgusit, etc.....\nTebeyimitâk, wi-kitimâkeyiminân.....\nHaw! wi-kitimâkeyiminân.\n\nSâsây e ki tagusik tchiki\nEkule ke wi-tchistâhâskwâlt\nMaka pwâwâtahik ka nayât\nKeyâbitch (2) k'o kawiskosut.\nIX.\n\nJesus niesing pangishin tehbanatigo-mikanang.\n\nJESUS TOMBE UNE 3ME FOIS.\n9me STATION.\n\nJesus nāspitch ki manAtjihitinân mina ki nanaskumitinân,\nKiya ka nipustamâwat ayisiyiniw e wipimâtjihat.\n\nEkwa ništwnw e pakissk Jesus.\n\nSâsây Jesus âmatjiwehaw ispatinâk Calvaire, ka itamik. Misiwe itâbiw, mistahi e kakwâtâkeyimot. Atawiya tebeyimow tchi nipahigusit, maka ayiwâk ayimeyittam, niyânk e mâmitoneyittak pikonata e wi-nipustamâwat anihi ayisiyiniwa, eka kitchi sâkihikut. Sâsây ekuspi o kiskeyitte niyânk stâneyigôk ke misiwanâtjihisunâniwik.\n\nNi Manitom Jesus, osâm mitchetweyâk nista ki ki kitimahitin misiwe iji e ki matchi pâstâhuyn; ni mitâten maka ekwa; kitimâkittawin; kâssinamâwin, kitchi eka wanittâyân ka ki miyo kaskittamâwiyan.\n\nN'otawinân, kitchi kijikok, etc.....\nKit atamiskâtin, Marie, etc.....\nPitane mâmiteyittâgusit, etc.....\nTebeyimitâk, wi-kitimâkeyiminân.\nHawl wi-kitimâkeyiminân.\n\nEji-kitimâkinâgusit\nTâpwe ituke soki mojittaw\nMosis e ketasâkepitit\nMistahi (2) ki nepewisiw.\nJésus dépoillé de ses habits.\n10me STATION.\n\nJesus naspitch ki manatjihitinan mina ki nanaskumilinau.\nKiya ka nipustamawat ayisiyiniw e wipimatjihat.\n\nJesus ketayonisepitaw.\n\nAta Jesus sasay mistahi e ki mayilotat, atjipiko kwatakihik o nipattakewa. Ekwa ketayonisepitaw. Ayiwak ituke assone ki kakwatakeyittam Tebeyitchiket; tchikema e ki kakiskiwepahut astikweyakatosuw, ekusi misiwe wiyak papakwasipitaw osam maka nepewisiw e moseskatenit.\n\nPesikwatisiyek, eka wikatch ka nepewisiyek, wabamik ki Manitomiwaw, ejinagusit, kiyawaw, ka totawayek. Ekawiya anwettak e n'taweyimikoyek kitchi meskutch ijiwebisiyek.\n\nNi miyo Jesus, kiya piko otchi kotchipayik kanatatchakwewin, miyin tchi kiyamewisiyan; kita kustaman pisikwatisiwin.\n\nN'otawinan, kitchi kijikok, etc.....\nKit atamiskatin, Marie, etc.....\nPitane mamiteyittagusit, etc.....\nTebeyimitak, wi-kitimakeyiminan.\nHaw! wi-kitimakeyiminan.\n\nAyamihewattikok ekwa\nPimisin kitchi tchistahaskwatit\nWabamik ki Manitomiwaw\nKiyawaw (2) ka totawayek.\nJésus est cloué sur la croix.\nIlmo STATION.\n\nJesus naspitch ki manatjihitinan mina ki nanaskumitanan.\nKiya ka nipustamawat ayisiyiniw e wipimatjihat.\n\nJesus tchistahaskwatanaw.\n\nEka tcheskwa e ki pakiteyimit Jesus kitchi nipahit sisily n'tâweyimaw kita tchistahaskwâtit. Ekwa tapwe ekusi totawaw. Pemâtjihiwet nipahik anihii ayisiyiniwa, ka winipustamawat. Sekke pakitinisuw. Tatâstâweyâkaskitchichânestawaw, mina tatâstâweyâkaskîstenestawaw nisi sakahigana otchi. Pakamâhiskwâtamwân, wawâtch tchimayaw, ekusi e wi-kâkitchjhât anibi weyottawimât Manitowa.\n\nPâstâhuwin k'otchi nipahit ni Miyo Jesus. Matchi pâstâhuwin, osâm mitchetwaw ki sakotchihiwân. Mitchet olayamihâwok paskiyâwewok Judawiyiniwa, eji matchi pimatîsitjik.\n\nNi Manitom! Ni Manitom! ni mitâten ekusi nista eji matchi paskiyâkeyân.\n\nN'otâwinân, kitchi kijikok, etc.....\nKit atamiskâlin, Marie, etc.....\nPitane mamiteyittâgusit, etc, etc.....\nTebeyimitâk, wi-kitimâkeyiminân, etc....\nIlaw! wi-kitimâkeyiminân.\n\nNandottâk eji-kijewâtisit\nIspimik megwâtch e akotikut\nMiyo ayamihestamâwew\nAnihii (2) ka nipahikut.\nJESUS MEURT SUR LA CROIX.\n\nJesus agodjin tchibalatigong nibo gate.\n12me STATION.\n\nJesus naspitch ki manâtjihitinân mina ki nanâskumîtinân,\nKiya ka nipustamâwat ayisiyiniw e wi-pimâtjihat.\n\nJesus nipustamâwew nyislîyiwiwa.\n\nJesus e ki tchimayit, mistahi pâppihaw e sâsâskwâtit, maka namawiya wi naskwaw. Tiakwatch wi-ayamihesmâwew anîhi nepahikut. Pisim wiya' wanitibiskipayiw. Mistasiniyak tàtâskâpiskipayiwok. Misîwe iji mâmaskâtch itâbamonâniwiw. E wi-poni-pimâtisit Jesus, mistahi tepwew: \"Kakiyaw kekwây kijitjikâtew,\" e itwet, ekusi e ki nawoskweyit, iskwatâmow.\n\nIskwatâmow ki Manitominow! Ota'yamihâtik! namawiya ituke kit assinîwotehânâwaw. Apopotchika mistassiniyak tàtâskâpiskipayiwok-Seyakês kakwe-mojittâk ki tehiwâwâk e kiskisopayiyek e ki nipustamâkoyek Jesus. Tebevitchikeyan, ki ki nipustamâwin, eokotchi ki wi-pimâtisislamâtin.\n\nN'otâwinân, kitchi kijikok, etc.....\nKit atamiskâtin, Marie, etc.....\nPitane mâmiteyittâgusit, etc.....\nTebeyinitâk, wi-kitimâkeyiminân.\nHaw! wi-kitimâkeyiminân.\n\nNamatew Jesus, iskwatâmow,\nSilsây mitoni kisitipaham\nKi ki kispinâtamâkonow\nKijikôk (2) tchi itutteyak.\nJésus est descendu de la croix.\n13me STATION.\n\nJesus nàspitch ki manàtjihitinàn mina ki nanàskumitinàn.\n\nKiya ka nipustamàwat ayisiyiniw e wipimàtjihat.\n\nJesus netlinnu ayamihewàttikok otei 1.\n\nJesus e ki iskwàtàmot ayamihewàttikok ki natytinaw, atit o kiskinohamàwàganà è ki tòtàkut. Marie ekute ki wijihiwew. Mistahi ki kakwàtakeyìttam e ganàwàhamàt okosissa e ki nipahimit, maka e wi-pimàtjìttwàkoyak kit atchàkonowa, ki tebeyimow wista tchi kakwàtakihestamàkoyak.\n\nNega, ki nanàskumitinàn ekusi e ki kitimàkeyimiyàk, àtchipiko miyo totàwinàn; itwestamàwinàn kitchi àbatjihikowayàk Jesus okwatakittàwin.\n\nN'otàwinàn, kitchi kijikok, etc.......\n\nKit atamiskàtin, Marie.......\n\nPitane mâmileyittàgusìt........\n\nTebeyimitàk, wi-kitimàkeyiminàn.\n\nHaw! wi-kitimàkeyiminàn.\n\nNàspitch ki nawokistàtinàn\n\nJesus ota e pimisiniyan\n\nEkwa wi-nisokkamàwinàn\n\nKàkike (2) tchi sàkihitàk.\nJésus est mis dans le tombeau.\n14me STATION.\n\nJesus naspitch ki manâtjihitinan mina ki nanâskumitinan;\nKiya ka nipustamâwat ayîsiyiniw e wipimâtjihat.\n\nJesus wiyaw nahinamwan.\n\nJesus wiyawekî nettinamuth ayamihewâtikok otchi, ki weweginamwân kitchi nahinamuth; oskiwâtikânik pakitinamwân. Ekuta ka ki pimisik Manitowayisiyiniw, megwâch otatchâkwa atâmas-kamikok e itutteyit.\n\nNi miyo. Jesus, ekusi ki kisipan ki pimâtisiwin, e wi-kiskinohamâwiyâk kita ijiwebisiyâk. Os-ki wâtikânik ki ki nahinikawin, e n'taweyimi-yâk kitchi oski-oteheyâk e wi-petchiteheskawiyâk eyamihewisaskamoyâki. Wi-miyanân kita miweyittamâk kitchi nanagatâweyittamâk ki kwatakittâwin, ki nipuwin wawâch.\n\nN'otâwinân, kitchi kijikok.....\nKit atamiskâtin, Marie.....\nPitane mâmiteyittâgusit.....\nTebeyimitâk, wi-kitimakeyiminân.\nHaw! wi-kitimakeyiminân.\n\nEkawiya wanikiskisik\nAnotch ota ka ki wâbattamek\nTaki mamitoneyittamuk\nManito (2) kwa takittâwin.\nDEVANT L'AUTEL.\n\nNi Miyo Jesus, ki nanâskumitin, anotch ka ki miyokiskinohamâwiyan. Ni nepewis'n miyâmitoneyittamâni ka ki iji-kitimahitân. Osâm tâpwe ki ki sakihin ekusi e wi-kakwatakihestamâwiyan. Ni wi-pakwâten ekwa ni matchi ittiwina. Wi-ganâweyimin. eka kita misiwanâtjihisuyân kittwâm, piwis tchi kaskihuyân kita wâbamitân kitchi kijikok.\n\nPitane ekusi ikik.\nPRIÈRE DU MATIN\n\nKIKIJEBKA KA AYAMIHAK\n\nOTA ITATEYIMATAK KIJEMANITO, MANATJIHATAN.\n\nNâspitch ketchitwâwisiyân, piyeyaku kijemanitowiyan, e ata nistweyakihuyan, anotch kikijeb ki pe-mawimustâtin, weyotâwimitân. E ata piweyittâgusiyân, eyiwek ki wi-wâbatehitin eji manâljihitân.\n\nNanâskumatak Kijemanito kakiyaw kekwây ka miyo totâkoyak.\n\nNi Manitom, mitoni ki nanâskumitîn kakiyaw kekwây ka miyo totawiyan anotch isko. N’taka e kitimâkeyimiyan eyâbitch k’o wâbatamân anotch\nka kijikâk. Pitane misakâme alamihitân. Ekusi iji wi-nisokkamâwin. Ki miyitîn kisâtch ni mitoneyitchigan, ni pikiskwewîna, ni totamowîna mina n’tayimisiwîna, misiwe ni pimâtisiwin. Wisaweyitta eoko kakiyaw, eka kekwây naspâtch kita totamân anotch. Pitane maka eji pimâtisiyân k’eji n’taweyittamâwiyan.\n\nPitane ekusi ikik.\n\nKakwe tebeysmotân eka kittwâm kita matchi ni iylyak.\n\nSiyâkihigusiyân Jesus, kiya, ka ki pe-kiskinohamâwiyâk miyo pimâtisiwin, ni ga kakwe toten kita naspitatân. Pitane eka kittwâm kisiwahitân ni matchi pimâtisiwin otchi, eji mustawinamân tchi atamihitân.\n\nMawimustawatâk’Kijmanito kita nisokkamâkoyak.\n\nNi Manitom, ki kiskeyitten eji-nisowisiyân mana. Nama nando ni ga ki abatjihisun eka miyiyan ki nisokkamâkewîn. Ekawiya wi-sâkitlowin eji-gwitamâyiyan. Eoko wi-sokkastwâhin kitchi nitta-tabasittayân ka iji-kitahamâwîvan kekwây; wawâtch kita totamân tânisi ka iji-n’taweyittamâwiyan.\n\nN’otâwinân, etc….. Kit atamiskâtîn, Marie, etc…..\nNi tapwewokeyimaw, etc…..\nKitchitwa Marie mamisitotawatan.\n\nKitchitwa Marie, Kijemanito wekâwimisk, minaniya wekâwimitân, ki mamisitotâtîn, tchi aya-mihestamâwiyan. Wi-kitimâkittawin anotch ka kijikâk, kwayask kita pimâtisiyan, kitchi nanahiltawok ki kosis Jesus, 'isko pimâtisiyâni, mina nagatamâni ota askik, kita wâbamak kijikok.\n\nCANTIQUE DU MATIN\n\nKIKIJEBAAAYAMIHEWINAKAMUWIN\n\nAir : UT QUEANT LAXIS.\n\n1\n\nMiyo Manito\nHây ! Hây ! winâkoma\nKi pimâtjihin\nEyàbitch peyakwaw\nNi nanâskumon\nEspitchoteheyàn\nMiyo Manito.\n\n3\n\nMiyo kiskisik\nTattwaw kikijeba\nTebeyimiwet\nKakiyaw awiya\nKa pimâtjhât\nE kijewâtisit\nMiyo kiskisik.\n\n2\n\nNisokkamâwin\nAnotch ka kijikâk\nTehi mittmeyàn\nKit ayamihâwin\nKa ki mihiyân\nAnotch ka kijikâk\nGanâweyimin.\n\n4\n\nKutak kijikaw\nE wi-miyikoyak\nMiyoteh otchi\nWi-atamihâtâk\nNanâskumâtân\nSiyâkihigusit\nMiyo Manito.\nTebeyimiwet\nNakamustawâtâk\nKijemanito\nWi-nanâskumâtân\nAnotch ka kijikâk\nKa miyikoyak.\n\nLITANIES DU SAINT NOM DE JESUS\n\nTebeyimiyâk kitimakeyiminân.\nJesus, nandottawinân;\nJesus, wi-tâpwettawinân\nKijemanito weyotawimikawiyân\nKijemanito Wekosissimikawiyân\nKijemanito Meyomanitowiyân\nJesus, Kijemanito wekosissimisk\nJesus, tebeyimiyâk\nJesus, pemâtjihiyâk\nJesus, ka ki nipustamâwiyâk\nJesus, ka ki pe-atawestâwiyâk miyo pimatisi-\nwin ki mikkom otchi\nJesus, meyonisokkamâwiyâk\nJesus, eji-sâkihiyâk\nJesus, kejewâtisiyan\nJesus, siyâkihigusiyân\nJesus, miyâmâtâtâwisiyân\nJesus, ketchitwâwisiyân\nJesus, pemâtjihiwéyan\nJesus, meyiyâk kit ayamihâwin\nJesus, meyokiskinohamāwiyāk\nJesus, tewinamāwiyāk kijikok\nJesus, menitowayisiyiniwiyān\nJesus, kāssinamāwinān\nJesus, tāpwettawinān\nKakiyaw matchi kekwāy\nMatchimanito okakayehisiwina\nMatchi mitoneyitchigana\nMatchi nipuwin\nKitchitwa Marie e ki nittāwikihisk otchi,\nKi pimātisiwin otchi,\nKi kwatakittawin otchi\nE ki nipustamāwiyāk otchi\nE ki āpisinniyan otchi\nKijikok e ki oppiskāyan otchi\nEji-mamāttawisiyan kijikok\nMeyo Jesus, netta-kāssinamākeyan, Kitimākeyiminān.\nMeyo Jesus, netta-kāssinamākeyan, Tāpwettawinān\nMeyo Jesus, netta-kāssinamākeyan, kitimākeyiminān.\nJesus, tebeyimiyāk\nWi-kāskittamāwinān miyopimātisiwin.\n\nORAISON\n\nMawimustchiketan.\n\nJesus, meyo nandottawatwaw mewimustāskwaw, meyo mīyatjik nentotamāskik, espitchotehiyāk, ki mawimustatinān kitchi wi-miyiyāk, ka ki iji miyo kaskittamāwiyāk kit ayamihewāttikom otchi.\n\nPitane ekusi ikik.\nPRIÈRE DU SOIR\n\nWETAGUSIKI EYAMIHAKI.\n\nOta Hâteyimâtâk Kijemânto, manltoweylmâtân\n\nNi manîtom, anotch ka-tibiskâk, ki pe-otchikwanapistâtin, espiteyimitân eji-peyaku-kijemai nitowiyaa. Ki lâpwettâtin taki liyâpweyan; k, mamisitotâtin eji-kijewâtisiyan; espitchotehiyânki sâkihitin, iyepine siyâkihigusiyan, mina eji sâkihisuyân, n’tijisâkihaw n’it’jayisiyiniw, kiya otchi.\n\nNanâskumîtân Kijemânto, ka’klyaw kekwây ka pe-miyototâkoyak.\n\nNi manîtom, tânisi ki pa eji-tebi-nanâskumitîn wikkâich, kakiyaw kekwây ka miyo totawiyan, aspin k’otchiyân? ki ki ayisiyiniwihiin; ki ki miyin kit ayamihâwin; ki ki mekin ki pimâtsiwin ayamihewâtlikok e nipustamâwiyan kitehi pimâtjihiyan; mina tattwaw kijikâki eyâbitch ki gwitate eji miyo totawin, e âta anwetta-\ntân. Tânisi kita totamân ekuyigok kitchi nanâskumîtân ki kijewâtisiwina otchi? Kiyawaw, sâsây k'otaskiyek kijikok, wi-nisokkamâwik, manâwi kitchi mâmîjimâyak eji-kijewâtisit Manitô. Pitane ekusi ikik.\n\nNandotamâwâtâk Kijemanîto kitalkiskeyittamohkoyak kl matchî lttlwîlnlnowa.\n\nMeyo manitowîyan, kiya, kakiyaw kekwây keskeyittaman, wi-kiskeyittamohin kakiyaw ni pâstâhuwina. Wi-maskawisihin kita pakwâtamân matchî pimâtisiwin mina mistahi kita kustamân kittwâm tchi kisiwahîtân. Tânisi ka ki iji naspâtch totamân, wi kiskisohin.\n\nNanagatawey imîsûtân kl matchî lttlwîlnnowa kîta kîsîlyak, matchî mitoneyltchîgan otehl, matchî piklakwewîn otehl, matchî totamowîn otehl\n\nTebeyitchikeyan, mistahi ni nepewokeyimon nabetch ekwa e iji-matchî ayiwiyân. Ata ekwa mitoni ni mitâten ka iji anwettâtân, kiya ka iji sokhihiyan' mina eji-kijewâtisiyan, pâskatch e ki nipustamâwiyan. Ekusi etchikâni kit iji-tipahamâtîn ka miyo totawîyan? Eji-kesinâteyimisuîyân, e kisiwahîtân, sokki pitus ni wi-iijiwebisin.\n\nPitane eka wikkâtch ki kisiwahîtân, ni Manitom, notch maka ni webinen ni matchî pimâtisiwin, mina nisokkamâwiyanî, nama kittwâm ki ka kakwe kisiwahîtin isko pimâtisiyâni. Pitane ekusi ikik.\nNándotamawatâk Kijemanito kita miyo nipawâyak\n\nNi manitom, wi-saweyitta ni nipâwin, kita miyo nipâyân, eka kita matchi pawâtamân, wâbaki tchi miyo waniskâyân, ayiwâkês katawa kita atuskâtân. Eokotchî ki miyîlin misiwe ni pimâtisiwin, n’iyaw, n’tatchâk, kitchi ganâweyimiyan anotch ka tibiskâk mina isko pimâtisiyâni.\n\nAyamihestamâketâk.\n\nTebeyimiweyan, wi-miyo-kitimâkeyim ni kitchi ayamihewiyinim, mina wi-ganâweyimik ayamihewiyiniwok ota mana ka kiskinohâmâwitwaw; wâwâch wi-miyoganâwâbamik n’t’otemak kakiyaw; mina kakiyaw ayisiyiniwok eyamihâjik n’t’ayamihestamâwâwok; mina iyiniwok ekatcheskwâ e kiskeyittakwaw kit ayamihâwin, kita wi-ayamihâwok. Tatto kâssinamâkewiskutek eyâtjik, n’t’itwestamâwâwok pitane kiyipa kisi-kâssinamâsutwaw.\n\nLITANIES DE LA STE-VIERGE\n\nTebeyimiâyâk, kitimâkeyiminân\nJesus, nandottâwinân; Jesus tapwettâwinân.\nKijemanito, weyotâwimikawîyan,\nKijemanito, wekosissimikawîyan,\nKijemanito, meyomanitowîyan\nKijemanito, ejî-nistweyakihuyan\nKitchitwa Marie, Kijemanito wekawimisk,\nKitchitwa Marie, manitowiskihituwin siyakaskinoskakuyan,\nKilchitwa Marie, wesamikanatatchkweyan,\nKitchitwa Marie, e atamiskask okijiko\nKitchitwa Marie, eka wikkatch kekiskakuyan matchi ittiwin.\nKitchitwa Marie, naspitch siyakihisk Kijemanito,\nKitchitwa Marie, o ki oppikihat Jesus\nKitchitwa Marie, e mamitjimikawiyam misiwe waskituskamik,\nKitchitwa Marie, kijikok e nikaneeyimikawiyam ispitchi kakiyaw okijikowok,\nKitchitwa Marie, e nibawistawat Jesus e megwatachistaabaskwatiit,\nKitchitwa Marie, mayo e poni-pimatisiyan, e itutahigowisiyan kijikok,\nKitchitwa Marie, meyo ayaminestamakeyan,\nKitchitwa Marie, meyo nandottawat awiyak mewimustaski,\nKitchitwa Marie, eji sakihitak,\nKitchitwa Marie, eji mamisitotatak,\nKitchitwa Marie, kisteyimitak,\nKitchitwa Marie, kejewaltisiyan,\nKitchitwa Marie, wekawimitak,\nMeyo Jesus, netta kassinamakeyan, kassinamawinan:\nMeyo Jesus, netta kassinamakeyan, tapwetawinan.\nMeyo Jesus, netta kassinamakeyan, kitimakeyimi-\nKijemanito wekawimisk, ayamihestamawinan,\nPitane kita otittamak ka asotamakoyak J.-C.\nMemorare.\n\nO miyo kanatachàkweyan Marie, wi-kiskiši eka wik-kâtch tehèswa e pettàkwak, kitchi eka kitimàkittawat awiyàk mewimustàski, cokotchi nista ejì-mamìsitòtàn, ki natamototàtin ejì-kesinàteyimìsuyàn k'eji matchi ayi-wiyàn. Ki pe-mawimustàtin kitchi wi ayamihestàmàwiyàn; ekawiya wi-ataweyimin kiya wekàwimitàn, wi-kitimàkeyim kit awàssimis.\nPRIÈRE POUR UNE BONNE MORT\n\nKITCHI MIYO-NAGATASKEYAK.\n\nNi Manitom, ni kiskeyilten kita nipiyân nângutita, maka namawiya ni kwayaskweyitten tâneyigok mwelchi ke poni-yeyeyân. Eokotchi mistahi n’t’astâsin kitchi nandomiyan ketattawe eka asweyittamâni. Appo anotch ka t’biskâk namawiya ni ketchinâhun kittwâm kita waniskâyân. Pitane eka wikkâtch kikiskâkuyân matchi pastâhuwin, eka kita matchi nipiyân. Kiyâm, ni Ma-\nnitom, piko eyigok iteyittamani, ki ka otinen ni pimâtisiwin. Ki tchitchik ni pakitinaw nî'tatchâk, oma ka wi-nipâyân, mina-wi-nipiyâni, wi-otinikkan, kejewâtisîyan-Jesus. Kiya miûa, Marie Nega, kit awâssîinis; wi-ganâweyîm anotch, mina kâkike ota askik.\nCANTIQUES\n\nAYAMIHEWINAKAMUWINA\n\nAir : Assemblons-nous.\n\n1\nMamawi nakamumâmitjimâtâk\nManîto ka tibeyimiwel,\nMegwâtch ota askik e pimâtisiyak,\nKijikôk kitchi witapimâyak.\n\n2\nNâspitch mamitjimiteyittâgusiw,\nE kitchitwâweyittâgusit :\nMisiwe e tibeyimât iyiniwa ;\nWiya kakiyaw e ki ojihât.\n3\nO mamitoneyijiganik otchi,\nKijik, Aškîy wawâtch ojillaw;\nEkusi mina e wi naspisihisût\nAyisiyiniwa ka ojihât.\n\n4\nMayaw e ki kijihit ayisiyiniw,\nNittawikitchiganik ahyaw,\nKakiyaw ekuta e itakuniyik,\nTaki nàspitch kitchi miyo ayât.\n\n5\nSawanakeyimuw matchi-manito,\nIyiniwa eji ayâyit;\nEkusi kitimahew e sekiskimât\nMisiminisa kita midjiyit.\n\nAir: A servir le Seigneur.\n\n1\nNisokamâwinân,\nKijemanîto, n’ota,\nKitchi kiskeyittamâk\nKi kitchi itwewin:\nNisokamâwinân.\n2\n\nAkameyiminân\nTânisi ka ijiyâk\nKitchi wi tâpwetamâk\nEspitch otehiyâk ;\nAkameyiminân.\n\n3\n\nHäy ! häy ! winâkoma,\nE wi otittikoyâk,\nAnotch e natikoyâk\nKa Tibeyitjiket :\nHäy ! häy ! winâkoma.\n\nAir : Travaillez à votre salut.\n\n1\n\nNângalaweyîtamuk,\nManito ot itasiwewin,\nKiyawaw eyamihâyek,\nPeyaltik wi ijiwebisik.\n\nChœur.\n\nMisi kekwây e mayâtak\nNâspitch iyekatenamuk.\n2\nKa wi manitokasuyek,\nNàspitch ki matchitotenawaw.\nPeyakow Kijemanito,\nWiya piko omanilomik.\n\n3\nOsàm e kitimahisut\nAwiyak e kihiskwebeskit,\nWawàtch e pisigwàtisit,\nWawàtch e nittakisiwàsit.\n\n4\nKiya wesàmitoniyan,\nWi mitjimina kit eyanìy;\nKitji ayisiyiniwok\nKitchi eka gwatakimatwaw.\n\n5\nAyiman matchi-manito\nKàkike kitchi witapimit;\nE kagwatakeyittamik,\nKàkike iskutek e ayàk.\n\n6\nKitimàyimin n'ota;\nAnoteh e paguseyimitàn,\nKitchi kassinamàwiyan\nKa ki jiji kisiwahitàn.\nAir : Esprit-Saint descendez.\n\nCHOEUR\n\nWi petjiyàwestawinàn,\nNi Miyo-Manitom, wi petjinansinàn.\n\n1\nKispin nama ki witjiwinàn.\nNi ga wâwâneyitenàn :\nHaw ! kitimâkeyiminàn\nKitchi miyototamâk\nPetji iyinisihinàn.\n\n2\nKâkike ni wi wayesihikonàn,\nAna ka osâmi kakayesit :\nOta nâspitch ni kitimâkisinàn ;\nAstam, kiya, wi pepikkuhinàn.\n\n3\nKitchi miyo ayiwiyâk miyhinàn ;\nEkusi piko ke kaskihuyâk :\nTchikema, sokiteheskawiyâki\nNi ga maskâwisinàn.\nAir : Bénissons à jamais.\n\nCoeur.\n\nTaki sakihatâk\nKejewâtisit Jesus:\n\n1\nKijikôk eyâyêk\nKi kîskeyimâwaw\nE kijewâtisit ;\nKâkike mâmitjimik.\n\n2\nMisiwe otâwimaw ;\nMisiwe sakihaw ;\nTaki e noguttât\nOkijewâtisiwin.\n\n3\nPapami natonawew\nOt awâssimissa\nWenisimikoyit,\nMetchipimâtisiyit.\n\n4\nWawâneyilamowîn,\nNîyekatenamâk\nGaskeyittamâni,\nNi wi pe nistûsiskâk\nAyiwâk nit atchâkwa\nKitimâkeyimew\nSoki n’daweyimew\nKitchi miyo ayâyit.\n\n6\nAyiwâk n’t atamihik,\nE miyototawit,\nE kiskinotahit\nSekawâsik meskanâk.\n\n7\nE ata eka kekwây\nOsoniyâmiyân,\nNi wiwoteyimun\nE kitimâkeyimit.\n\n8\nKiwi nanâskumitip;\nKejewâtisiyan;\nTâsipwa etweyân,\nTaki wi sakihatâk.\nAir : Jusques à quand, enfants, etc.\n\nI\n\nKâkike tchi, iyiniwitik,\nKe awasisâtisiyek ?\nTaki tchi ke otamihuyek .\nTchi miyawâtamek piko ?\nNama tchi ke nissitotamek\nWipâtch tchi nagataskeyek ?\nMayaw e nogusit iyiniw,\n\"Ki ka nipin \" semâk itaw.\n\nCHŒUR\n\nTâpwe ! gustâtikwan\nMistahi gustâtikwan :\nNepiyeko, Manito\nK'o wiyasuwâtikoyék.\n\n2\n\nNâspitch ka ki wiyojisitjik,\nKa kitchi okimâwitjik,\nMisiwe askik e gustitwaw ;\nTande ka ayâtwaw anotch ?\nWipatch tâpwe ki pagisinwok,\nMistikowatikânesik\nTânisi ekwa âbatjihuwock\nK'o mamaskateyimitjik ?\nTatto kekwây ka sakittâyek,\nKitchi wiyo'tisiwina,\nMina miyawâtamowina;\nHây! ki ka nagatenâwaw.\nNâspitch ke ayimeyitamek:\nNama ki ka takunenâwaw:\nIyinitik, wi kiskisik.\n\nKit otemi'wâwok kakilyâw,\nAti iskwatâmunuyeku;\nTatto ka sakihikoyekwaw.\n\"Manito ni natomik ekwa\"\nAdieu! Adieu! itâyekwaw;\nKitâ mâtji kitchi mâtuwok;\nAta ki ka nipinâwaw.\n\nEkawiya wi sagweyimuk\nTchi pettanfek, iyinitik,\nMistikowatikânik askik\nTânisi k'ejî ayâyek.\nEkuta mistchet manitchosak\nSemâk ko mowikoyekwaw;\nMina pikiskatîtiyeku\nKi ka ajaskiwinâwaw.\nPe ilutek, kesteyimuyek,\nWawâtch pesigwâtisiyek,\nMate mistikowatikânik\nItâpik k’oji ayâyek.\nEoko mitoneyittamuk ;\nKi ka âbatjihunâwaw :\nMistchet ki kaskihuwo otchi\nKitchi miyo ayiwitwaw.\n\nPemâtjihweyan, Manito,\nE ata kitimahatwaw\nEkusi kit ojitjiganak,\nNama ki wi nagatâwok.\nTatto ka nantotâskîk ota\nKi ka apisismâwok\nE wi atamihatwaw ki kîk.\nWi miyhin tchi nantotatân.\n\nAir : Au fond des brûlants abîmes.\n\nWi kiskeytamohinân,\nWebînigowisiyek.\nNete atâmaskamikôk,\nKagwatakeyittamek:\nCHOEUR\n\nIyinitik,\nEka nanâspitawinân,\nEka pittukek ota.\n\n2\nNi gaskeyitenân ota,\nIskutek e ayayâk :\nMistahi ni tipahenân\nKa ki matchi totamâk\n\n3\nWipatch ki ponipayiwa\nMiyawatamowina ;\nNaŋma kiŋa ponipayiw\nGwatakittâwin ota.\n\n4\nNi kagwatakihikonân\nMatchi-manîqo ota ;\nTaki e kisiwâsiyâk\nNi kitimâkišinân\n\n5\nMamawîyes ka ayimak\nManîto e wanihit\nNama ni ka wâbamânân\nNete kitchi kijikôk.\n6\n\nNi wi sakihanàn ala,\nE ki ojihikoyàk :\nMaka e wëbinikoyàk\nAtchi ni pakwàtanàn.\n\n7\n\nKita nikànoyitagwan\nPoni pinâtisiyàk :\nMaka ketimahikoyàk\nNi pinâtjihikonàn.\n\nAir : L'encens divin.\n\n1\n\nKa wigiyek neté kitchi kijikôk,\nMate, wi kiskinohamâwinàn\nAnotch ekwa kiskeyitamohinàn,\nKa ijiyek ka miywâsik askìk.\n\nCHŒUR.\n\nHäy ! Hay ! iyinitik,\nMiyo askiy wi kakwe otìtamuk,\nHäy ! Hay ! iyinitik,\nOta piko pinâtisinànìw,\nHoma askiy, iyinitik, wi kiskisik.\n2\n\nTehi matuyâk, kitêhi gaskeyittamâk,\nNama wikkâtch ni ka mojitanân.\nÈokoni kitimâkîsiwina\nKit askiwâk e ki nagatamâk\n\n3\n\nTaki ota ni ga miyawâtenân,\nMenitowit e sâkihikoyâk ;\nNi tehinâk otchi ni sâkihanân,\nNaşpîtch tapwe e sâkihigusit.\n\n4\n\nKanak piko e ki gwatakihikoyâk\nTebeytjiket tehi nanlotawayâk ;\nTaki ekwa ni ga miyo ayanân,\nTaki ni wi atamihiikonân.\n\n5\n\nNamawiya nitta pittukew ota\nAna ka matchi sikkimikoyek ;\nÈka wikkâtch e petji nâtikoyâk,\nTapwe kiyâm ni pimâtisinân.\n\n6\n\nAgwamisik, meyo pimâtisiyek,\nIlâw ! kijikôk wi iteyimukek ;\nWi natotâmâwik Kijemanîto\nÈokoyiw kitchi miyhikoyek.\nAir : Reviens, pêcheur.\n\n1\n\nPe nansik ekwa, n'tawâssimisitik\nKayâs otchi ki pelitinaâwaw ;\nAyiwâk ki kitimakisinâwaw ;\nKi wi kitimakinâtinâwaw.\n\n2\n\nAkittamuk, Ayisyiniwitik,\nTattwaw ka ki âbatjihitakwaw.\nKi ki iji pakitinititâwaw.\nTakine kitchi miyo ayâyek.\n\n3\n\nTâmiki anî k'o anwetawiyek ?\nOtchitaw e n'daweeyimitakwaw :\nTâispi ki ki anwetâtinâwaw,\nKekwaya nentotamâ wiyeku ?\n\n4\n\nTâispi ki kisiwahititâwaw ?\nKa wi tapasistawiyek âtchi ;\nNiya ata ka ki ojilhitakwaw,\nNiya ka ganâweyimitakwaw.\n5\nMitchewa ki pastahuwiniwawa;\nSeyake kesinâteyitamuk;\nEkwoyigok ni pa kijewâlisin\nSemâk kitchi kassinamatakaw.\n\n6\nEkawiya itasi nipewisik;\nTiyakutch, kesinâteyitamuk,\nEkwa wi webinamuk matchitwâwin,\nKa osâmi kitimalikuyek.\n\n7\nNâspitch e wi tebiyawehitakwaw\nK'o akamewi-sikimitakwaw\nGwayask kitchi pimâtisiyek ekwa.\nTâbwetawik, n't awâsimissitik.\n\n8\nAyiwâk e nipewisiyân anotch,\nNi Manitom; e ki anwetatân\nEkwa maka, ki wi nanahittâtin:\nTâbwetawin, kitimâkeyimin.\nAir : Un Dieu vient se faire entendre\n\n1\nSokkan ayamitêhikewin\nKa ki pe-pakitinak\nMisiwe waskitaskamik\nKa tibeyimikoyak\n\nChorus.\nWi-kakiyaw ayamihâk\nMêwâsik nandomamuk\nK’otchi pe-pimâtisiyek\nTaki kitehi kijikôk.\n\n2\nEkawiya nakistamuk\nKa sikkimikawiyek\nEoko pimâtisiwin\nKa wi-miyikawiyek\n\n3\nWi-mâmîtoneyittamuk\nAyisiyiniwitik\nGwayask kitehi itutteyek\nEyigok nipiyeku.\n\n4\nMêwâsik ayamihâwin\nKakiyaw otinamuk\nKi ka kispinàtenàwaw\nTaki pimâtisiwin.\n\n5\nHaw ! ka libeyitchikeyan\nKitimâkeyiminân\nYâkkès kitchi tapwettamâk\nKit ayamitchikewin.\n\nAir : Le voici l'Agnéau si doux.\n\n1\nNakamutâk kakiyaw\nWi-mâmitjimâtân\nMâmâwi-K'otâwinow\nMânatjihâtâk.\n\n2\nKi ki miyikonow\nPimâtisiwin\nWi-nanâskumâtâk\nWi-sâkihâtân.\n\n3\nKi Manitominow\nTapwettâwâtâk,\nMonjak kiskisitâk\nKijemanito.\nNi sâkîhaw Jesus,\nKejewâtisit\nNi sâkîhaw Jesus,\nKa pimâtjihit.\n\nHây ! hây ! winâkoma\nManito, N'ota\nAnotch ka tibiskâk\nGanâweyimin.\n\nAir : Goutez, âmes ferventes, etc.\n\nTâpwe kijewâtisiw\nKa tibeyitchiket\nEji sâkîhikoyak\nWiyaw e webinak.\n\nCHORUS\n\nKâkike sâkihatâk\nJesus K'otâwinow\nE ki nipustamâket\nTêhi pimâtjihîwet.\n2\nOkijewâtisiwin\nKi ki miyikonow\nKa pimâtjihikoyak\nE ki tchistâhâskwâtit.\n\n3\nKakiyaw matchâyiyiwin\nMitoni sâkottaw\nE kispinâtamâwât\nAyisiyiniwa.\n\n4\nTâpwe Kijemanito\nKitimâkeyinew\nKa kitimâkisisiyit\nAyisiyiniwa.\n\n5\nKitchi wi-pakitinât\nO peyak’ossâna\nAyamihewâttikôk\nKitchi nipahimit.\n\n6\nE kitimâkisisitwaw\nKit awâssimissak\nWi-kitimâkinawik\nKitchi wâbamiskwaw.\n— 102 —\n\nAir : Les faits de ma journée.\n\nI\n\nN'tayamitchikàn\nEji alaminayàn\nNama ni nepewisin\nKita nokullâyàn\nKa ijittwâyàn mana\nTattwaw kijikâki.\n\n2\n\nKa wàniskàyànî\nSemâk n'tayamihàn\nE kiskisopayiyàn\nKa tilheyitchiket\nMamàwi Kotàwinow\nKa wi-pimâtjihit.\n\n3\n\nNi wi-witjihiwàn\nTattwaw Lamesse etweki\nN'tawi-manâtjihak\nKa tilheyitchiket\nJesus ka webinisnt\nTchi kassinamâket.\n\n4\n\nMegwâtch atuskeyàn\nKita pimâtjihuyàn\nKejewâtisit Jesus\nNi mawimustawaw\nKitchi wi-saweyittak\nN’tayimisiwin.\n\n5\nWâ-mitjisuyni\nPita n’tayamihân,\nKa kitinakeyimit\nE wi-nanâskumak\nTaki ka ayasanit\nHây! hây! winâkoma.\n\n6\nN’itjâyisiyiniw\nNi kitinakeyimaw\nKelînâkinâgusit\nYâyow ni sâkihaw,\nKejewâtisit Jesus\nE mitoneyimak.\n\n7\nTattwaw tebiskâki\nEkwa e wi-nipâyàn,\nN’otjikwanapistawaw\nE wi-nanâskumak\nAnolch kî tibiskâyîk\nE ganâweyinnit.\n8\n\nPemisiniyànì\nEkusi n’t’eyitten:\n“ Nànígulita nista\n“ Ni ga poni-yeyàn\n“ Askìwitchipayinàk\n“ Kita pimisinìyàn”\n\n9\n\nEkusi totamuk\nFkusi wi-kiskisik\nKitchi àbatjihuyèk\nGwayask pimàtisik\nKita miyo-nipiyek\nKitchi kaskittàyèk.\n\nAir: Conditor Alme.\n\n1\n\nKijikòk iteyimutàk\nEkute Jesus Manito\nKi n’taweyiminikonow\nKitchi miyo-totàkoyak.\n2\n\nMegwâch e pimâtisiyek\nWi-kitimàkeyimisuk\nEkawiya wi-wànittâk\nMamâwiyes kitchi kekwây.\n\n3\n\nEkawiya sàgweyimuk\nE ayimak ota askîk\nEkule kakwe-kàskihuk\nOsâm ka mïwâsik askïy.\n\n4\n\nOta tatto k’otaskiyek\nMina kijikôk k’âyâyek\nMâmitjimik k’otâwinow\nKa kitchi kijewâtisit.\n\n5\n\nMâmitjimik Weyotâwik\nMina Jesus Wekosissik\nMina Meyosit Manito\nTaki nàspitch mâmitjimik.\n— 106 —\n\nAm : Je me croyais au milieu de ma course.\n\nCarême,—Jeune.\n\n1\n\nTâpwe miwâsin kwatakihisuwin\nWâwâtch iyewanisihisuwin\nOtchitaw e kwatakihisuk\nEkusi e wi-kassina'mâsuk\n\n2\n\nJesus e wi-kiskinohamâkoyak\nNemitanow kijikaw ki totam\nKinwens e ki iyewanisihisut\nKita iji-kiskino-totamak\n\n3\n\nE kiskinohamâket ota askik\nOmisi itwew esa peyakwaw :\n\"Awiyak eka kwatakilisutji,\n\"Namawiya gwayask kita ituttew.\n\n4\n\nNamawiya piko mitjisuwwin otchi\nK'otchi kwatakihisunâniwik\nAwiyak wâwâtch e matchâyiwit\nKita ponittaw o matchittwâwin\nEkwa tapwe, ayisyiniwitik,\nMitoni kesinâteyittamuk,\nEkwa wi-iyewanishisunk\nKispin gwayask wi-itutteyeku.\n\nAir : Oh ! que j'ai douce souvenance.\n\nLE BAPTÈME\n\n1\n\nN'ota, N'ota ! n'takâwâten\nMistahi ke miweyittamân,\nYâyâskupeyâni kispin\nN'otânan\nKa kitchittwâweyittâkwak\nNipîy.\n\n2\n\nKayâs ata e otchi totak\nPâstâhuwin n'otchi kikiskên,\nKejewâtisiyan osâm\nN'otânan,\nN'tatchâk kâssihamâwin\nEkwa.\n3\n\nNiya, tibiya'w ni pastahun\nNama ni ki ganâtjihisun\nPitane ganâtjihiyân\nN'otânân,\nKi sikâhâtâkewinîk\nOtchi.\n\n4\n\nMatchi pastâhuwinîk otchi,\nKijemanito ni webinik,\nJesus osimimit kispin\nN'otânân,\nGanâtjittamâwin ekwa\nNi teh.\n\n5\n\nE ki pastahisuyân otchi\nNi pakwâtik Kijemanito,\nWi-okosissimin kâwi,\nN'otânân,\nNittâwikihikuyâni\nNipîy.\n\n6\n\nN'ota, N'ota, ki nâskumitîn':\nTâpwe kâwi okosissimin,\nIsko pimâtisiyâni\nN’otânâni,\nKi wi-sâkihitin kiya\nPiko.\n\n7\n\nE webinak matchi manito\nPitane eka tibeyimit\nPâpisiskeyimin taki\nN’otânâni,\nNama niwi-matchâtisin\nKittwâm.\n\nLA TEMPÉRANCE\n\nAIR : A la claire fontaine.\n\n1\n\nNâspitch La tempérance\nN’tatamihikun\nKa ki asotamân,\nNi wi-kakwe-toten\n\nCHŒUR\n\nJesus ni sâkihaw,\nNi ga nisokkamâk.\n2\n\nTâpwe La tempérance\nOsâmi miwâsin,\nAwiyak e totak\nManitowa otchi.\n\n3\n\nTaki La tempérance\nGanâweyittamuk,\nWi-abatjihisuk\nAtehi wi-nakamuk.\n\n4\n\nMatchiskuteuwâbuïy\nNâspîch pakwâtamuk,\nKetimahikuyek\nYakkês webinamuk.\n\n5\n\nAyisiyinitik!\nEka sagweyimuk,\nKitchi âbatan oma\nK'otchi iyinisik.\n\n6\n\nWi otchikkamâtuk\nAyamihâwinîk,\nKijikôk itâbik\nWi-âkanmeyimuk.\nKa tibeyimiyan,\nKitimakeyimin,\nKa ki asotamân\nKitchi atamihitân.\n\nLe Purgatoire\n\nAir : O digne objet de mes chants, etc.\n\n1\nAta meyo ayiwik\nTatto ayisiyiniw,\nOta askîk ka nagatak\nNamawiya semâk âskaw,\nPittukew kitchi kijikôk\nManitowa ka ayâyit.\n\n2\nEka kenâtâtchâkwet\nO pâstâhuwinissa,\nIyawis eka kassinamuth\nEyâbitch ka kipiskâkut,\nKassinamâkewiskutek\nPita kita ituttew.\n3\n\nEkute kita ayaw\nIsko ponipayiyik,\nO kesinâteyimowin,\nEka e tehipayiyik\nO miyo totamowina\nOta waskitaskamik.\n\n4\n\nEkute ka ayâtjik,\nMeskutch wa:kkitaskamik\nAyamihestamâwâwok\nNâspitch e nisokkamâtjik\nKîpa kitchi kijikôk,\nKitchi wi-pikkuhutwaw\n\n5\n\nLamesse otchi mistahî\nKa âbatjibitjik,\nEkuta otchi osâm mana\nKa miyo nisokkamâtaw\nAyamihestamâwikuk\nKa kijewâtisiyek.\n\n6\n\nMâskutch appo ekute\nMegwâtch itasi-ayaw\nPeyak kit’otemiwaw\nE kijikàssinamàsut\nKi pakuseyimikowaw.\nKitchi àbatjihâyek\n\nLES SEPT SACREMENTS.\n\nAir : Entends ma voix fidèle, etc.\n\n1\nJesus otayamihe-ijittwâwinik\nTepakup itattiniyiwa tàpwe,\nAyamihe nànâtawihuwinà\nE miyo iyinikkahikoyakwaw.\n\n2\nBAPTÈME.\nNistam Ayamihesikàtjikàsuwin,\nK’otchi otawàssimissimikoyak\nE kàssinamàkoyak pàstâhuwin\nKa ki petchi-kikinittàwikiyak.\n\n3\nPÉNITENCE.\nEkwa Ayamihewàtjimisuwin\nE ayamihesikàtjikàsuyak,\nMwestas metchi totamaki mana.\nEoko ki kàssinamàkonow.\n4\n\nEucharistie\n\nKitchitwa Ayamihesaskamuwin,\nMamawiyès ketchittwâweyittagwak,\nK'otchi wi-asamikoyak Jesus\nO manitowiwin, wiyaw mina\n\n5\n\nConfirmation.\n\nSokkiteheskâketominituwin,\nKa otchi wi-petchiyâweskâkoyak\nNisto wetjikâsut Manito meyosit,\nAsitji o kijewâtisiwina.\n\n6\n\nExtreme Onction.\n\nIskweyâtch ayamihetominituwin\nKekâtch e wi-poni-pimâtisiyak\nKitchi miyo-nisokkamâgowisiyak\nGwayask kita nagatamak askîy.\n\n7\n\nL'Ordre\n\nAyamihe wi-iijhituwin\nK'otchi mâmâtâwihiit awiyak,\nKita kitchi totawât ayisiyiniwa\nWawatch Lamesse mana kitchi ki itwet.\n8\n\nMariage\n\nAyamihewikitchi-wikittuwin\nNâpew iskwewa e kitchi wikimât,\nEka wikkâch kita paskewihitutjik\nIsko pimâtisitwaw tchi witjetutwaw.\n\nCommandements de Dieu.\n\nAir : Suivons sur la montagne sainte etc.\n\n1\n\nE peyakut Kijemanito\nPeyaku omanitomih,\nKi tehîk mina otchi sâkilîh,\nKakike (2) e tibeyimisk.\n\n2\n\nEkawiya mâna wiyakim\nKa ki ojihisk Kijemanito,\nMina eka wiyakittamaw\nNingotwa (2) ol'ojitjigan.\n\n3\n\nEkawiya wi ojitjike\nEyamihewikijikâki,\nPiko peyattik ayamiha\nKiskisi (2) tebeyitchiket.\n4\nKi nikihikwok manatjihik\nKinwens kitchi pimatisisyan,\nK'otawiy wi-nanahittaw,\nKikawiy (2) kitimakeyim.\n\n5\nEkawiya wi-nipattake,\nAppo kitchi wi-kisiwisayan,\nAwiyak matchi totaski\nKiya, ni (2) wi-miyo-tolaw.\n\n6\nEkawiya pisikwatisi,\nAppo kitchi wi-mustawinaman,\nEkawiya wikinotamaw\nAwiyak (2) otayawina.\n\n7\nEkawiya wikkatch kiyaski,\nEkawiya matchi ayinom,\nKit'jayisiyhiw mina\nMayatan (2) matchi ayimwewin.\n\n8\nKikike wi-peyakuhituk,\nKiyawaw mana wiyekittuyek\nEkawiya mina kakayehisik,\nEoko (2) takki kiskisik.\nPour une rerraite.\n\nAir : Un Dieu vient se faire entendre.\n\n1\n\nEkwa ayisiyinitik !\nKejiwâtisit Jesus\nAnotch ki nandomikowaw,\nEka wi-anwettawik.\n\nCHŒUR\n\nHaw ! ni miyo Manitom,\nNi kesinâteyimisun\nKi wi-kakwe-sâkihitin\nIsko pimâtisiyân.\n\n2\n\nEkwa, n’t’awassimissitik,\nPitus wi-pimâtisik,\nKi ka âbaljihunâwaw\nKwayask’lâtchihuyeku.\n\n3\n\nWi-mâmitoneyittamuk\nKayâs e pehitakwaw\nWi-kesinâteyimisuk\nTchi kâssinamâatakuk.\n4\nNiya ka ojihitakwaw,\nE tibeyimitakuk\nKakwe atuskawik ekwa\nEvigok otehiyek.\n\n5\nAtà metchi ayiwiyek\nKispin mawikkasiyek,\nKi kassinanatinaawaw\nKa ki kisiwahiyek.\n\n6\nAnotch wi-kiskisik tapwe\nKitchi nipiyek tcheskwa,\nKipa pe-kiwetotawik\nN'tawassimissitik.\n\n7\nAyiman ka ayatuskàt\nKa matchi manitowit,\nKi ka mamitatenaawaw\nIskutek eyayeku.\nCANTIQUES DE NOEL.\n\nAIQ : Sortez de vos hamaux.\n\n1\n\nMainaskâtch itakamikan\nOta anotch waskitaskamik ;\nEkwayâk e nittawikit\nKa wi kitimâkeyimiwet.\nNakamo mamitjimâtâk\nJesus ka pe natikoyak;\nMamawi mamitjimâtâk,\nNâspitch mamâttagusitâk.\n\n2\nE ata kitchitwâwisit\nE ata kisteyittâgusit,\nNama ki ataweyittam\nKitchi pe ayijiyiniwit:\n\n3\nE wi kaskittamâkoyak,\nNiyanân ketimakisiyak\nGwayask kitchi ituteyak,\nNagatamaki oma askîy.\n\n4\nAta kisteyittâgusiw,\nK’eyiwek wi awâsissiwiw:\nPijiskiwikamikosik\nMiyweyittam e nittâwikit.\n\n5\nOsâm kit atamihinân,\nKejewâtisiyan awâsis,\nE wi witjiwâmimiyâk,\nE ata matchi ayîwiyâk.\n0\n\nIsko pimâjisiyâki,\nNâspîch ki wi sakihitinan;\nIji musitawinatâk\nKijikôk kitchi wâbamitâk.\n\nAin : A l'exemple des anges.\n\n1\n\nWi mâmaâlagusitâk\nHo tibiskâk :\nJesus teheyimitâk\nNittâwakiw :\nE wi tebiyâwehitâk\nKa itasiyak\nE iniwiyak :\nWinâkoma. (ter.)\n\n2\n\nMisiwe mâmaâlagwan\nAnotch megwâtch :\nJesus e mâmitjimit\nIyininâk.\nMâmitjimatâk kistânow ;\nKitchitwâwisiw,\nE Manitowit.\nSâkihatâtâk, (ter.)\n3\n\nKa asawàbatamik\nKayâs otchi,\nEkwa otchitchipayiw\nAnotch ota.\nE awàsisìwihisut\nTebeyitchiket,\nE sàkilhiwet\nSàkilhâtâk. (ter.)\n\n4\n\nKitchi kijikôk wàwâtch\nMâmàttâgwan,\nOkijikowok nista,\nNakamuwok ;\nOsàm e miyweyitakik\nKa ikiniyik\nWaskitaskamik.\nWinâkoma. (ter).\n\n5\n\nOtchitaw pakwâtatatâk\nKa mayâtak,\nWi nipewisistatatâk\nKakebatak :\nAnotch ka pe natikoyak\nE iyinisit\nNaspitawâtâk\nSâkihâtâk. (ter).\n\n6\n\nSokki nanâskumâtâk\nMenitowit ;\nWi nanahitawâtâk\nIyepine :\nE pe kaskitlamâkoyak,\nKitchi kijikôk\nKitchi ayâyak,\nWinâkoma. (ter).\n\nAir : Ça bergers.\n\n1\n\nE megwa tibiskâyik\nJesus-Krist nittâwikiw :\nWiya ka pe miwehât\nMetchi manitowiyit.\nHaw ! n’dawi atamiskawâtâk,\nOmanitomimâtâk.\n\n2\n\nE ata kâsustâket\nK’eji kitchiwâwisit,\nEoko atawiya\nKa pe pikkuhiwet :\nManàtjihàtak elasiyak,\nE Kijemanitowit.\n\n3\n\nAwàsissiwihisuw\nE kijewàtisit :\nNama ataweyittam\nKitchi wewegapisut ;\nAyiwàk kisteyittàgusìw ;\nMaka piwinàkuhùw.\n\n4\n\nE kitimàkisiyìt,\nNikàu ka n’daweyimàt,\nKitchi n’dawàbamìkut\nE ata menitowit ;\nTchikema e kijewàtisit,\nE wi sàkihiçusìt.\n\nAIR : Il est né le divin enfant.\n\nCHŒUR.\n\nSàsìy Manito awàsis\nAyisiyininàk witjihiwew.\nSàsìy Manito awàsis\nBetlehemìk nìttàwikiw.\n1\nKayâs otchi ot âdjima,\nTaki ot osawâbamâlây :\nEkwa e otitikoyak\nMâmawi mâmitjimâtâk.\n\n2\nOsâm e katawâsisit,\nNamawâteh kita ki paskihât ;\nNamâ wikkâteh pettâgusiw\nE miyo awâsissiwit.\n\n3\nMustusôkamikôk wigiw ;\nMaskusîya onipewiniw ;\nMustusokamikôk wigiw :\nOsâm tâpwe piweyinuw.\n\n4\nKa n’daweeyittamâkoyak,\nEkawiya sâkittowâtâk :\nKîtehinowa wi ayaw\nWi pakitinamowâtâk.\n\n5\nKitchi okimâwok nisto\nWâyow otchi pe îtutlewok,\nE wimiyo totawâtjik,\nE manitoweyimâtjik.\nTebeyitchikeyan, Jesus,\nE ata awàssissiwiyan ;\nKi pe pagusehitinàn\nPeyaku tibeyiminàn.\n\nAir : Nouvelle agréable.\n\nRefrain.\n\nMiyo aljimowin\nAwàsis e nittàwkit,\nKi miyikawinow\nPimâtisiwin.\n\n1\n\nE tibiskâyik nogusìw,\nKiyànow e pe-nàtitak,\nMìwàtamuk, wi-sâkihik,\nAwàsis ejì-miyosit.\n\n2\n\nMatchayaw e ki sâkohât\nKakiyaw ayisiyiniwa\nMaka wiya pe-maskattwew\nAna meyosit Awàsis.\n3\n\nEkwa ki nandomikowaw,\nNânsik anotch ka kijikâk,\nEkawiya sâkweyimuk\nKi wi-pimâtjihikowaw.\n\n4\n\nNâspitch mamaskâlamuk\nKijemanito e totak,\nOkosissa e mekit\nKitch'otchi pimâtisiyak.\n\n5\n\nEkwa mâmâttâkumâtâk,\nMatchâyiwin e sâkottât,\nTaki nâspitch sakihâtâk\nEji kitcheytâgusit.\n\nAtk : Dans cette étable.\n\n1\n\nTâpwe mamaskâtch\nMustusokamikok\nWâbamik Jesus,\nSiyâkihigusit.\nManito Awâsis!\nKa pimâljihiyâk,\nKit atamiskâtînân\nE wi-nogusîyan\nWi-pikkuhinân.\n\n2\nMisiwe askik,\nE ki wanihuk,\nMaka’ni anotch,\nPimâlisinâniw.\n\n3\nAyisiyiniw,\nEkwa ânisihaw\nAyamihâwin\nE petwâgowisit.\n\n4\nMatchi manito\nNâspitchi miwehaw,\nE maskamit\nO maskawisiwin.\n\n5\nHây! winâkoma!\nWi-mâmâtâgusik.\nE nittâwikit\nManito Awâsis.\nCANTIQUES DE LA PASSION.\n\nAir : Au sang gu'un Dieu.\n\n1\n\nTatto ka pe nantotamek\nKa iji kwatakihit,\nJesus ki Manitominow\nKa nipustamàkoyak :\nWi nagalaweyittatàk\nEji kijewàtisit :\nKàkike wi sàkihàtàk,\nWi nipustamowàtàk.\n\n2\n\nNittàwikitchiganesik\nMàdji gwatakeyittam :\nAtawiya tebeyimuw,\nMaka ayimeyittam.\nPaskiyàkemaganiyiw\nOkijewàlisiwin;\nN’dawàtch wi nipuslamàlwew\nIyiniwa kakiyaw.\n\n3\n\nOwisakeljàko Juda,\nIspitch e sasìkisit,\nPàskatch e ki atawàket\nMisihew o oljemàt.\nJudas, ki naspitàk ana\nKa matchi pimàtisit;\nKàkayesiw ayamihaw,\nMayàtanìyiw o teh.\n\n4\n\nÈ ki olittinit Jesus,\nMistahi kwatakihaw,\nPakamàpahwaw, sikkwàtaw\nMàmatchi ispinemaw.\nAta tchi k’otehinàwaw,\nKa wi kwatakihàyek,\nMatchi Judawiyinitik,\nKa miyo tolàkoyek.\n\n5\n\nPapami ituttahéwok\nOt okimàniwàwa,\nEta e ayàyit mâna\nKitchi tepakimimit.\nKikik kita milâtamwok,\nOsâm e totawâtjik\nNanapâwis wiyaskutam\nPe wiyasuweyitji.\n\n6\n\nGwatate iji totataw\nE ata webinisut ;\nNista Pierre asemew nistwaw,\nOsâm e sakotehet :\nMaka kiyipi mitâlam\nE ki iji pâ-tahut,\nE muskohikut Jesussa\nE ganawâbamikut\n\n7\n\nPilate wikipiyik e pesit,\nAssône piweyimaw,\nE wi nikâneyimimit\nNipattâkesk Barahas.\nOsâm tâpwe koppatjihaw\nEji kitchitwâwisit\nKa wi nikâneyimimit\nPisigwâtchiwiyiniw.\n8\n\nE ki ketayonisenit\nKojewatisit Jesus;\nSokki miljimaskwapilaw\nE wi pâpasatehut,\nTiyakuteh wiya Manito\nKi ka assenikowaw,\nKi ka pasatehukowaw\nE pisigwatisiyek.\n\n9\n\nOkaminakasiwattik\nOtchi pasikwepitaw;\nWâwâtch mana pwâwâtahik\nAyamihewattikwa.\nKi nipewihawaw ana,\nKa wi kisteyimuyek,\nMamatchikastehuwina\nKa note kikiskamek.\n\n10\n\nGalverik amaljiwehaw;\nEkwa tehîstâhâskwataw;\nMisiwe iji pâppihaw,\nIspi e ki tehîmahit.\n\"Ni wi minikwân,\" e itwet,\nWisupiy ki minahaw;\nWekipeyek, iyinitik,\nKiskisikek coko.\n\n11\n\nKekâlch e wi iskwatâmut\nIspimik e itâbit;\nWi ayamihestamâwew\nAnihi nepahikut,\nTaki naspitotawâkak,\nPekwâtikawiyaku;\nKa iji kijewâtisit\nWi kijewâtisitâk.\n\nAir: Vexilla regis.\n\n1\n\nAnotch wi-ganâwâbamik\nKitchi ayamihewâtik\nKa ki pimâtjihikoyak;\nPe-otchikwanâpistawik.\n\n2\n\nAwahita miyo mistik,\nKa ki nayâl Manitowa,\nTchiki pe-nibâwistawik,\nO Tchistâhâskwâso Jesus.\n3\nTâpwé osâmeyîtlâkwan\nEspitchi kijewâltisit\nE ki wi-pakileyimut\nKitchi nipustamâkoyak.\n\n4\nWâbattamuk otchitchiya\nE payipayikâteyik,\nMisi piwâbkwa otchi\nE sâsabopayiyiki.\n\n5\nOsita nisi! watjistakâtch!\nSâsakahikâteyiwa,\nKwaskwetjiwaniyu mikko\nSokki e pakamahamuth.\n\n6\nAnakkâtch, ostikwân wâwâtch!\nEkâsisiniyik otchi,\nSokki pustastotinehaw\nOkâminakâsiwâtlik.\n\n7\nEki iskwatâmul Jesus,\nEkwa otek takkattamwân,\nNipîy-mikko otchikawiyiw\nE wi-iji-kisitjiket.\nEkwa ayamihewattik\nMoskistawattik kakiyaw,\nKesinateyimisutak,\nE ki matchi pastahuyak.\n\nAIR: Stabat Mater.\n\n1\nMarie o nibawistawa,\nOkosissa nepahimit\nAyamihewattikok.\n\n2\nE osami gaskeyittak\nNaspitch wi-nipaheyittam\nE kitimakinawat.\n\n3\nWissakitehew ayiwak\nE mawikkatat Jesussa,\nKa nagatikut sasay.\n\n4\nAyiwakikkin, assone!\nSokkiteheyittagusiw\nEji ganawabaket.\n5\nPapami matwemuw Marie,\nNâspitch e gwitaweyimât,\nKa wanihât siyâkîhât.\n\n6\n\" Nikose! Jesus, Nikose!\n\" Taneki k'o nagasiyan?\n\" Haw! kiyâm, ni ga nipin.\n\n7\nAwena eka ke moskuhit\nWiyâbamâtji Mariwa,\nKekwatakeyimnyit?\n\n8\nKiyawaw, ka otehiyek,\nWitjewâtâk ki kâwinow,\nGaskeyittamowininik\n\n9\nEyigok wi-nipiyâni,\nKitchi miyo-pikkohuyân\nMarie kaskittamâwin.\nAIR : Entends ma voix fidèle.\n\n1\n\nTaki sâkîhîk ka tibeyitchiket,\nAyisiyiniwa ka nipahîkut ;\nTâpwe misâyû o sâkihiwewin\nE nipustamâwât ka nipahîkut.\n\n2\n\nGanàwâbamik ki manitomîwaw,\nAyamihewâtîkok e âkwamut,\nPimâtîsiwiwîn ki wi-miyikowaw,\nNandottawîk, wi-kakwe-pimâtîsik.\n\n3\n\nEji mamâtîawîsit ata nepit,\nAskîy ki wanitibiskipayiw\nE kistâbiskâk ki tatâskipayiw\nE nokuttât e ejî-kitchâyiwit.\n\n4\n\n\"Sâsây mitoni ni kiji-tipahen\"\n\"Manîlo, N'ota, nitatchâk wi-otîn\";\nE itwet, ekusi nâmiskweyiw,\nSemâk askîy ka nanâmipayîyîk.\n5\nMaka kiyipi ka ki apisissik,\nEyábitch nemitano kijikaw,\nO witjewágana e kakeskimât,\nEkusi kijikôk ka ki oppiskât.\n\n6\nEkwa maka kijikôk e ayapit\nEji-manito-ayisiyiniwit,\nEkute e itwestamàkoyak\nKitchi saweyimigowisiwâyak.\nCANTIQUES DE LA RÉSURRECTION.\n\nAIR : O Filii et Filiæ.\n\nI\n\nApisisin, apisisin, apisisin.\nTâpwe Jesus apisisin\nKakkiyaw miyawâtatak\nEkawiya kustamukak.\nApisisin.\n\n2\n\nOsâm ki sâkîhikonow,\nKi kitimakinâkonow\nE ki nipustamàkoyak.\nApisisin.\n3\nWiyaw e ki pakitinak,\nE ki wi-metchikwekàwit\nWigik tehi miyawàtamuth.\nApisisin.\n\n4\nKit atamahigowisin,\nMarie, ki sakihigusin\nKi kosìs ka ki nipahit,\nApisisin.\n\n5\nMamoyàwestamignisiw,\nTàpwe sakihigowisiw;\nNama kittwàm kita nipiwiw.\nApisisin.\n\n6\nJesus nanatotawàtâk,\nTaki nasàspitawàtâk,\nWi miyo pimìtìsitâk\nApisisin\n\n7\nJesus monjak kiskisitâk,\nKijikôk ayitàpitân,\nKakwe-pimitisahwàtâk\nApisisin.\n141\n\naïu : Je te salue, O Pain de l'Ange.\n\n1\n\nJ. C. e ki apisissik\nNemilano kijikàwa\nE papami-kiskinohamàket\nKi ayaw waskitaskamik.\n\n2\n\nOt ayamihewiyininina\nE wàwittamàwàl mana\nTànisi ke ayitotàkeyit\nÉyigok ke nagatàlji.\n\n3\n\n\"Awiyak kassinamàwàyek\"\n\"O matchi totamowina\"\n\"Kita kassini kàteyiwa\"\n\"Ekusi kitchi kijikòk.\"\n\n4\n\n\"Eka kassinamàwàyeku\"\n\"Ekusi nista kijikòk\"\n\"Nama kitchi kassinamàwok,\"\n\"Kit iji-miyitinàwaw.\"\n5\nMeyosiyit Manitowa otchi\nEkwa sokkileheskawew,\nKitchi mistahî sokkastwâyit\nKa iji-mâmattâwihiât.\n\n6\nE nemitano kijikâyik,\nEkwa nandomew kakiyaw\nO kiskinohamâwâgana\nE wi-ayamihestamâwât.\n\n7\n\" Nâspitchi eyigokkweyimuk \"\n\" Awâhek, wi-papâmuttatâk \"\n\" Ni kiskinohamâkewina \"\n\" Misiwe waskitaskamik.\"\n\n8\n\" Awiyak sikâtjikâsutji, \"\n\" Tiyâbwewokeyitlaki, \"\n\" Kita otawâssimissininik \"\n\" Semâk Kije manitowa.\"\n\n9\n\" Ni ga tâpwettâkawin mana \"\n\" Tiyâpwettâkawiyeku, \"\n\" Ni miyo totâk awiyak \"\n\" Wa-miyo-totâkoyeku.\"\nE ki poni-pikiskwet Jesus,\nIskweyâtch wi-saweyimew\nEkwa ka oppiskât kijikôk,\nKakiyaw e wâbamikut.\n\nAIR : Quelle nouvelle et sainte ardeur.\n\nAyamihewiyiniwok,\nE ki oppiskâyit Jesussa,\nKiipa ka pe-nâtikutwaw\nKa miyosiyit Manitowa.\n\nCHŒUR\n\nKatholik ayamihâwin\nE peyaku-mîwâsik,\nNama kekwây pitus\nKijikôk tchi kaskihuk.\n\nEkute k’otchipayik;\nE ati-kiskinohanâkek\nNama kekwây nakistamwok\nE iji akameyîmutjîk.\n3\nE atâ metehihîtwaw,\nMisiwe-ji-kwatakihâwok\nAtchi piko mitchetiwok\nKatholik otayamihâwok.\n\n4\nAyamihewiyiniwok\nOskatch nânipahâwok mitchei\nAtchi ki petchi-ayâwok,\nE ayamiskestamâlutwaw,\n\n5\nPitus ka wi-ayamihâk,\nNamâ nando tehi ilâhatak,\nPeyakwan ayamihâwin,\nKatholik ka ijihkâtek.\n\n6\nTâpwe kitimâkisiwok\nPiskis ka kakwe-ijittwâtjik,\nKiyâm kita pe-natamwok\nKwayask katholik ijittwâwin.\n\n7\nKitchi ki miyo ayayek\nKijikôk mina askik,\nEoko ijittwâwinik\nKakiyaw ki ka miskenaâwaw.\nCantiques de l'Eucharistie.\n\nAir : O l'auguste sacrement.\n\n1\n\nAyamihesaskamun\nJesus ka ki ojittat,\nEjiji miyikoyak\nWiyaw mina o mikkom.\n\n2\n\nTàpwe mistahi kekwiy\nIji totàkàniwiw,\nE saskamonàniwik\nJesus wiyaw mina o mik.\n\n3\n\nEkusi e ki totakì\nOla askik e ayàt,\nE witjimitjisumàt\nAnihi ka askokut.\n4\nPakkwenew pakkwejigan\nE ayasamât tâpwe\nSominâhuîy minahew\nOmisi e ayitât :\n\n5\n\" Oma niyaw mâmijik : \"\n\" Oma ni mik minikkwek : \"\n\" Ka pe-webinâsuyân \"\n\" Tchi pimatjihitakwaw. \"\n\n6\nE saweyitchikâtek\nAnima ka saskamuk,\nEoko Jesus omik\nMina wiyaw ka mitjik.\n\n7\nAyamihewiyiniw\nWiya ka saweyittak,\nEkusi ka kweskimuk\nManito-pakkwejigan.\n\n8\nEkusi ka totamek\nMamitoneyittamuk\nKakwe kanâtâtchâkwek,\nKitehi atamihâyek\n9\n\nTâpwe kijewâtisiw,\nWiyaw e asakket,\nNâspîch e kitchitwâyik\nO kitchi wikokkewin.\n\n10\n\nMeyo manitowivan!\nKi maunoyâwestâtin\nKa miyo asamiyan\nAyamihesaskamun.\n\nAir : Adorons tous.\n\n1\n\nJesus ola e itâteyimitân,\nK'o wi-pe-otchitchikwanapistatân,\nNamawiya ki ka wi-ataweyimin\nE mawimustatân (kitimâkittawin) 2.\n\n2\n\nAyiwâk e kesinâteyittamân\nKa ki iji matchi-pimâtisiyân :\nEkawiya auwettawin, ni Manitow,\nKi kijewâtisin ; (wi-kassînamâwin) 2.\n3\n\nOsâm e matchi eyittâgusiyân,\nMaka nâspîch e nahittâgusitjik,\nEkute kijikok, ka witapimiskik,\nTâsipwa pitane. (itweslamâwitjik) 2.\n\n4\n\nEspîch otehiyân, ni mamitjinaw,\nKakiyaw ka tibeyittak Manito;\nTaki ni wi-nanâgałâweyittamwân\nOt itasiwewin, (ka ki petwâkoyâk.) 2.\n\n5\n\nWiya sokki e mamitoneyinâk,\nWiya piko nâspîch e wi-sâkîhak,\nNi ga wi-jyekatenamâk ka mayâtak:\nKa niwâsîk askîy (kitchi wâbattamân) 2.\n\nAir: Du roi des rois.\n\n1\n\nEkwa kekâtch n'otisâbamaw Jesus,\nNâspîch ka ki petji akâwâtak:\nCHOEUR.\n\nNi miyweyiten,\nN'tataminâi :\nAstam, Jesus, siyàweyimiyan\nAstam, Jesus, miyam tàkohiyan.\n\n2\nSâsîy esa piko n'otisâbamaw\nEkwa ke otjigwanapistawok.\n\n3\nAyiwâk e piweyimuyân ola ;\nKeyiwek e wi miyotolawit.\n\n4\nNâspitch kitchittwayiw e wikokkewin,\nMisiwe ot ijiwin asakew.\n\nAir : Heureux séjour.\n\n1\nKa wi kitimâkinâkoyak,\nKi pe kiyokâtikonow ;\nWetjitâwi manâtjihâtâk,\nWiya e tibeyimitak. (Bis).\n2\n\nKitchitwa wehinâsuwinik\nEpiyan, ki tapweletâtin,\nTâsipwa e nawokistatân\nE kisteyittâgusiyân. (Bis).\n\n3\n\nNâspitch ki mamoyâwestâtîn,\nE kitîmâkinâwiyan :\nKâkike e wi wekimîyâk.\nManito pakwejiganik. (Bis).\n\n4\n\nNi matchi eyittâgusinân,\nKiya, ki kitchitwâwisîn ;\nEyiwek ki wi wekimînân,\nEji kijewâtisiyan. (Bis).\n\n5\n\nAyiwâk ni sâkîhîgusîn\nIspitch kiyawaw kakiyaw,\nAyamîhewi saskamuyâni,\nWi mamoyâweslamâwik. (Bis).\nAir : Vole au plus tôt.\n\nI\n\nNit atchàkum, kijikòk iteyimu,\nEkute Jesus ki ndaweyimik ;\nK’èji atamihàt siyàkihikut,\nÈ wi iji atamihisk nista. (Bis).\n\nCHOÈR.\n\nKitimàkittawinàn,\nNi Manitom, Jesus ;\nKi mawimustàlinàn\nEspitch otehiyàk.\n\nSOLO.\n\nOsàm miyàsin ki teh,\nKit awàsimissak,\nKitchi anwetawatwaw\nMewimuslàskwàwi.\n\n2\n\nNama kekwày kitchi astahikuyan,\nNit atchàkum, ki kaskiluyani ;\nKiyàm wi kitimàhikawiyani,\nNamawiya kita ki ispayiw.\n3\n\nEkawiya itasi sagweyimu,\nE ayinak ota, ki wàbatten ;\nTaki e sakamu gaskeyittaman,\nNete pikò kiyàm ki ka nyàn. (Bis).\n\n4\n\nAwahe, wi kitimàkeyimìsu,\nNanahittaw ka Tibeyitchiket,\nWiya piyo ki ka tebiyâwchik,\nMiyiski kitchi wàbamàt. (Bis).\n\nAir : Quelle nouvelle.\n\nI\n\nOsàm ni mamàttàgusìn\nAnotch e petjìteheskawit ;\nKa tibeyimit Manito\nKita pe sokitcheskawit.\n\nCHŒUR.\n\nTaki isko pimâtisiyáni,\nWi ganàweyimikan :\nAyiwâk ni pa kitimàkisin,\nPoni wekimìyani.\n2\n\nIspitch e kijewâtisit\nAta piweyitâgusiyân,\nEka e ataweyimit\nEwi witjiwimit kâkike.\n\n3\n\nEkwa e wi webinamân,\nKakiyaw ni matchi ayiwin,\nKa pe kitimâhikuyân\nE sâkohikuyân ayiwâk.\n\n4\n\nNawatch ni ga miyweyitten\nAnotch ponî pimâtisiyân ;\nIspitch kita nagalitân,\nE sakihitân iyepine.\n\n---\n\nAir : Honneur; hommage.\n\nCoeur.\n\nNi ketsinâhun,\nOta eyâyan,\nEyigok e iliyan,\nJesuse, n’ota.\n1\n\nUkaristiwinik\nKit ayân ;\nK'o nawokistâtân,\nMamaskâtch.\n\n2\n\nKi mawimustâtin,\nManito,\nKitimâkeyimin\nKâkîke.\n\nAIA : Le voici l'agneau si doux.\n\nCHOEUR.\n\nAslam, ni miyo Jesus,\nWesimohiweyan ;\nNâspitch ki sâkihitin,\nWi saweyimin.\n\n1\n\nUkaristiwinik,\nKi tâpwetâtin,\nKa nittawittâyan\nKakiyaw kekwây.\n2\nKi mawimustâtin,\nWesimohiyan,\nWi kitimâkeyim,\nWeyolâwimisk.\n\n3\nE wi asamiyan,\nKit atamihin,\nMiyo asamatwaw\n(Okijikowok).\n\n4\nKi manâtjihikwok,\nKi gik eyâtjik ;\nKi kisteyimitin,\nEkusi nista.\n\n5\nEspitech miyosiyan,\nKi webinisun :\nNi teh ki miyhitin,\nPe tibeyimin.\n\n6\nGaskeyitamâui,\nKâkitjihikan,\nAgwâmisihikan,\nWi nipiyâni.\n7\nKa matchi ayiwit,\nKitwâmi nanusitji:\nTehi eka sâkohit,\nKaskittamâwin.\n\n8\nMeyosiyan Marie,\nItwestamâwin:\nNâspitch ni sâkîhaw\nKi kosîs Jesus.\n\n9\nNi'tji iyinitik,\nNawokislawik,\nNakamustawâtâk\nJesus mamawi.\n\n10\nEka kustamokkek,\nNipuwin ekwa;\nKa pimâtjihîwiêt\nE pe nâtitek.\n\n11\nTehi pimâtisiyek\nTaki kijikôk,\nKit asamikowaw,\nUkaristiwin.\n\n12\nKit awàssimissak\nPisiskeyimik ;\nSaweyimik ekwa\nSiyàkihiiskik.\n\nAir : Elevéz-vous mon cœur.\n\n1\nNil atchàkum, niàmàttàgusi anotch,\nE petji iyasistamàsk Jesus :\nWebinàsuwinàtìkòk e ayàt\nWiyaw e pe webinàsustàket. 2.\n\n2\nPakwejigan sàsày meskutchimuhaw,\nE ata keyàpìtch ijina hut :\nSominapwìy meskutchimutàniwiw,\nE ata keyàpìtch ijinamik. 2.\n\n3\nKi yaw, ki mik, misiwe kit ijiwin,\nOta astew, Ni Manitom Jesus,\nNi tàpweten, ni wi manitokâten ;\nTàsipwa wetjikwanapistamàn. 2.\nWekosisimikawiyau Manitou,\nKiya ka ki nipustamàwiyàk,\nKiya ka pe webinisuyan ola;\nKàkike ki wi sàkihitinàn. 2.\n\nPremière Communion.\n\nAir : Allons au banquet divin.\n\nRefrain.\n\nEkwa miyawàtatàk\nTebeyimitak wiyekomitak\nEkwa miyawàtatàk\nJ.-C. ki nandomikonow.\n\nI\n\nAstamitik : kit itikonow,\nKiyawaw, u’t’awàssimissitik,\nKa wi-asamitakwaw\nKe ki otchi pinnàtisiyek.\n\n2\n\nSokki mitoneyittamuk,\nEkweyàk oma ka wi-totamek,\nE wi-pittukahitakuk\nNàspitch kanàtjìtchëstawik.\n3\n\nAnotch kit asamitinàwaw\nNiyaw, ni mik, n'tatchâk misiwe,\nKi kàsustàtinàwaw\nTchi petchîyâweskâtakuk.\n\n4\n\nTchi sokkiteheskâgowisiyek,\nKi pe-otinamàtinàwaw;\nEkwa ki tehiwâwa\nMitoni wâwiyestanàwik.\n\n5\n\nMeyo Manitowiyan, Jesus,\nKi n't'aweyimitinan sokki,\nTchi wi-pittukawiyâk\nEkweyâk e wi-asamiyâk.\nCANTIQUES DE LA SAINTE VIERGE.\n\nBir : Nous vous invoquons tous.\n\n1\n\nKi nanàskunitin\nEspitch otehiyàn,\nNi Manitom ;\nE ki mamiyiyàk\nTchi okawimàyàk,\nKa miyosit Marie,\nWinàkkoma.\n2\n\nWi nisokamâwin,\nNi kitimâkisin,\nNi Manitom,\nWi iyinisihin\nKitchi nahittâtan,\nKitchi tabwetamân\nKit itwewin.\n\n3\n\nKi mawimustâtin,\nWi itweslamâwin,\nKanâtch Marie,\nKi sakihigusin,\nEkute kijikôk,\nKi nahittâk Jesus,\nWekâwimisk.\n\nAir : J'entends une voix attendrie.\n\n1\n\nOsâm tàpwé kijewâtisiw\nKa kanâtâtchâkwet Marie ;\nE wi \"otawàssimimitân\"\nNi tehik kimuteh e ijil :\nCHOCUR.\n\nKanàtch Maria.\nN’tataminàn,\nE otawàssimimiyan\nKi sàkìhitìn,\nKi nahittàtin,\nIsko pimàtìsiyàni. (Bis).\n\n2\n\nKa iji ispìteyimitàn\nIspìteyìmikan kista,\nN’tawàssìmis, kit’èyìmitìn\nNi gàwìy, iteyìmikan.\n\n3\n\nKetattawe wi sàsìkimìsk\nAna ka matchì ayìwit,\nKìta wi ponì sàkìhiyan,\n“ Ni tìbeyìnimik ” itàkkàn.\n\n4\n\nWi ponì pimàtìsiyàni.\nEkawiya kustamokàn.\nEka kìta abatjìhitàn,\nÈ kitìmàkèyìmitàn.\nNete kijikök ayàyani,\nNiya e itutahitân;\nKi ka mamàttàgusin tàpwe\nE ki okâwimât Marie.\n\nAir: Ave maris stella.\n\n1\n\nKit alamiskàtin,\nJesus Wekàwimisk,\nEkute kijikök\nKetchitwàawisiyan.\n\n2\n\nKetimàkisisiyàk,\nKi natomilinàn,\nNi gàwinàu, nàspitch\nKi sàkihitinàn.\n\n3\n\nKit awàssimissak\nWi pisiskeyimik,\nMegwàtch ota askik,\nE pimàtisitwaw.\n4\n\nPe nàtikoyàki\nKa matchi ayìwit,\nMeyosìyan Marie,\nNisokamàwikak.\n\n5\n\nKitchi sàkìhàyàk\nKi kòsis Jesus-Krist,\nKaskittamàwinàn;\nKiya ki nantotàk.\n\n6\n\nAti nipiyàki,\nPe kàkitjihinàn,\nPe abaljihinàn,\nTchì nàtitak ki gìk.\n\nAir: O vous, Vierge Marie.\n\nI\n\nKenàtìsìyan Marie,\nSiyakìhìsk Jesus,\nMiyoskineteheskàsk\nMeyosit Manito;\nWekawimikawiyàn\nTaki kenàtìjìhuyàn.\nCOEUR.\n\nKi pagusihitin\nNega, aantotawin.\n\n2\n\nMiyâmâttawisiyan\nEkute kijikôk,\nKeskinawâbamiskwaw,\nMiyo ayiwitwaw.\nKi kitijewâsiwin\nNama wawâtch kisipan.\n\n3\n\nKi sagaskineskâkun\nMiyo ayiwiwin;\nMarie, ki paskiyâkân\nEji miyosiyan.\nKitimakeyimowin\nNâspitch k’otayànin.\n\n4\n\nOkanatâtchâkwewok\nNekaneyimiskwaw;\nOkijikowok wawâtch\nMiyamîtjimiskwaw;\nKi kosis apotchika\nKi kisteyimik nâspitch.\nAir : Bénissions à jamais.\n\nRefrain.\nWi-màmitjimàtâk kénâtâtchâkwet Marie. (2.)\n\n1\nKanâtâtchâkwewin\nKi miyigowisiw,\nNama kikiskâkuw\nAppo pâstâhuwinis.\n\n2\nO kitehi ayiwiwin\nOsâmi misayiw\nKakiyaw iskwewa\nE iji-paskiyawât.\n\n3\nKa tibeyitchikeyit\nE ki okosissit,\nKi nittâwikipihew,\nJesussa ki ayawew.\n\n4\nOkijewâtisiwin\nMamaskatâskamik!\nEkute kijikok,\nE âbatjihikoyak.\nNâspîch sâkilîhûsîw,\nEji miyotehet,\nO kitchi wiyoûin\nK’opakâhâk wânînânôw.\n\nKi mawîmûstâtîn\nMarie, iyîniwok\nTchi ayamîhâtjik,\nAyamîhestamâwik.\n\nAir : A servir le Seigneur.\n\n1\nNisokkamâwinân,\nKitchitwa Marie, Nega,\nKitchi kiskeyittamâk\nJesus otîlwewîn,\nNisokkamâwinân.\n\n2\nAyamîtchikewîn\nKa peyakomîwâsîk,\nKitchi wi-tâlbwettamâk\nKitchi sâkittâyâk\nAyamitchikewin.\n\n3\n\nHây ! hây ! winàkkoma !\nTaki ni wi-nakamun,\nEji ataminâyân,\nE okâwimitân\nHây ! hây ! winàkkoma !\nJESUS OT IJITWAWIN.\n\nKATECIM KA ITAMIK.\n\nKISKINOHAMAKEWIN I.\n\nKakwetjiltuwin. Kit ayamihân tehi?\nNaskottuwin. Enh enh, n’tayamihân; winâkko-\nma e ki kitimakeyimit Kijemanito.\nK. Taniki ani, ni ki kitimakeyimik Kijemani-\nlo, k’o itweyan?\nN. Ayamihawin e ki miyhit; cokoyiw mama-\nwiyes kitchi kekwây ka ki miyhit.\nK. Mitchenwa tehi emiywasiki ayamihew\nijitwawina.\nN. Namawiya mitchenwa e miywasiki, e\nnayestow peyakwaniyik Kijemanito ot ijitwâwin.\nK. Tanisi ani ijihikâtek ka miywasik ayamihew\nijitwâwin?\nN. Katolik ijihikatew.\nK. Awena ka ki ojittât katolik ayamihewijit-\nwawin?\nJesus o kiskinohamakewiyiniwa e kiskinohamawat.\nN. Jesus-Krist, Kijemanitowa ka okosissimikut, ki ojittaw katolik ayamihewijitwawin; wiya tebiyawe nisto pipun e ki kiskinohamowat ayisiyiniwa, ekusi e ki mamattawihât ayamihewiyiniwa aniskâtch kitchi papami kiskeyitamohiweyt misiwe.\n\nK. Awena maka tapwe mitone eyamihât?\nN. Awiyak e tapwewokeyitak, espitch otchit, Jesus-Krista ot ijitwâwiniyiw; wawatch e sika-hâtjikâsnt, wawatch gwayask e itâljihut; eoko tapwe ka nitta ayamihât.\n\nK. Kekwâty otchi k’otchi nissittaweyimitwaw katolik ka ititjik?\nN. E ayamihewâtlikoketjik.\n\nK. Mate, ayamihewâtlikoke.\nN. Ṣ Weyotawimit, mina Wekosisimit, mina Meyosit-Manito, o wiyowinik, Pitane ekusi ikik.\n\nK. Tande otchi k’otchi kiskeyitamuth Jesus-Krist ot ijitwâwin?\nN. Kijemanito o masinahiganik otchi, mina ayamihewiyiniwok o kakeskikemowiniwâk.\n\nK. Aweniki gwayask ka kiskeyitamohiweytjik Jesus-Krista ot ijitwawiniyiw?\nN. Iyenatow ayamihewiyiniwok.\n\nK. Aniki maka papiskis ka ijitwatjik, tanisi kita ki iteyitamuth ot itjitwawiniwaw?\nN. Namawiya nandaw kita ki iteyitamuth, eka\nKije Manitoe nistweyakihut.\nnandow e itàbataniyìk; wiyawaw sokè e ki ojitwàsutjìk.\n\nKISKINONAMAKEWIN II.\n\nK. Tande ka otchi kiskeyitaganiwik eyigok osàm kitchi tàpwewokeyitamuth Jesus ot ijitwàwinìk?\n\nN. Ayamihewiyiniwok ot ayamihewitàpwewokeyitamowiniwàk: “Ni tàpwewokeyimaw Kijemanito &cet.,” ka iji kitchitìk?\n\nK. Awiniki ka ki ojittàtjìk ayamihewitàpwewokeyitamowin, “Ni tàpwewokeyimaw Kijemanito etc.,” ka iji kitchitìk?\n\nN. Nistam ayamihewiyiniwok ki mamawi ojittàwok.\n\n1. Ni tàpwewokeyimaw Kijemanito, Weyottàwìmit kakiyaw kekwày ka nittarittàt, kijik ka ojittàt askiy kiki.\n\nK. Awena ana Kijemanito?\n\nN. Kijemanito iyenatow Manitowiw, e pisìsìk atchàkowìt, wiya ka ki ojittàt, wawàtch ka tibeyìtak kakiyaw kekwày.\n\nK. Kekwày inaka otchi ka otchi ojittàt Kijemanito kakiyaw kekwày?\n\nN. Namawiya kekwày ki otchi abatjìttaw; èka iskwa kekwày e ki otchi ittakunìyiìk, piko e iteyìtak, mina e itwèt, ekusi kakiyaw ki ittakunìyiìw.\nK. Tantatto pipun ekwa aspin Kijemanito kakiyaw kekwây ka ki ojittât?\nN. Kekâtch ekwa ningotowâsikwawkitchimitatalo mitanaw tattô pipun, aspin ka kijittât Kijemanito kijik, askîy, wawâtch kakiyaw kekwây.\n\nK. Kinowes tehî ki otamihuw Kijemanito kakiyaw kekwây e wi ojittât?\nN. Ningotowasik kijikaw ki otamihuw; ekusi e ki tepakop kijikâtyik ki ayowepiwiw.\n\nK. Nama-tehi pa ki kaskittaw Kijemanito kakiyaw kekwây iskwatâm kita kijittât?\nN. Atawiya pa ki kaskittaw kakiyaw kekwây iskwatâm kita kijitât; iyepine e mamatawisit.\n\nK. Taniki ani ningotowasik kijikaw k'o wi otamihut Kijemanito kakiyaw kekwây e wi ojittât?\nN. Niyank e iteyitak ke ayitotamiyit ayisiyiniwa e wi miyât namingotowasik kijikaw kita atuskeyit; ekusi mana kita manadjittayit tattwaw tepakok kijikayiki e ayamihewikijikâtyik.\n\nK. Taki tehî ittaw Kijemanito?\nN. Euh enhi, taki ittaw Kijemanito, namawiya wikkâtch kita ponî ittaw.\n\nK. Tande eyât Kijemanito?\nN. Misiwe ayaw Kijemanito, kijikôk, mina waskit a-skamik.\nK. Kakiyaw kekwây tehi kiskeeyitam Kijemanito?\n\nN. Euh enh, kakiyaw kekwây kiskeeyitam; kakiyaw wâbalam, kakiyaw kaskittaw, nama wawâtch kekwây pwatlawittaw.\n\nK. Wâbamaw tehi Kijemanito?\n\nN. Namawiya wâbamaw eka e owiyowit.\n\nK. Tanisi ani ewi itwek anima ka wâbatagânîwik Kijemanito o masinahiganik: \"Kijemanito oskijikwa, mina Kijemanito o tsitsiya, &c.\"\n\nN. Kijemanito kakiyaw kekwây e wâbalak, eoko otchi, Kijemanito oskijikwa, k'o itwek; kakkiyaw kekwây mina e nitta ajittât, eoko otchi Kijemanito o tsitsiya k'o itwek; namawiya tapwe e oskijikot, mina e ositsit.\n\nKISKINONIAMAKEWIN III.\n\nK. Kekwây otchi k'otchi kiskeyimit Kijemanito?\n\nN. E wâbalamuth ot ojitjigana, iji mamiywâsiniyiki, wawâtch e ki wâbamimit okosisa, ayami-hawin ka ki pe kiskeyitamohiweyit; eokoyiw otchi k'otchi kiskeyimit Kijemanito.\n\nK. Taniki ani k'o itweyan, \"Ni tapwewokeyimaw Kijemanito Weyotawimit?\"\nKije Manitoe ki ojihat ayisyumuwa mina nai antok piji-kiwa.\nN. E ki okosisit ana ka nistamisit iji nistweyakisitwaw Kijemanitowintk.\n\nK. Mitchétiwok tehi Kijemanitowok?\n\nN. Namawiya mitchétiwok; peyukuw Kijemanito; maka nistweyakihuw, Weyotawimit, mina Wekosisimit, mina Meyosit-Manito.\n\nK. Tabiskotch tchi iji Kijemanitowiwok, iji nistitwaw?\n\nN. Enh enh, tabiskotch iji Manitowiwok.\n\nK. Nàspitch tchi mina tabiskotch kitchitwàweyitagusiwok?\n\nN. Enh, enh, mitone tabiskotch kitchitwàweyitagusiwok.\n\nK. Tatto ka itatiniyiki Kijemanito ot ojitjigana, tanimayiw ayiwiwà miywàsiniyiw?\n\nN. Okijikowa, Ayisiyiniwa wawàtch.\n\nK. Kekwayak aniki Okijikowok?\n\nN. Iyenatow atchàkowiwok, namawawàtch owiyowiwok.\n\nK. Nama-tchi nàspitch ki matchi totamwok ketatawe atit?\n\nN. Tàpwe mistahi ki matchitotamwok ketatawe atit, osàm ayiwakeyimutwaw; tàsipwa ka ki matsustewebinitjik.\n\nK. Tanisi kani ijilhikasuwok okijikowok ka ki matsustewebinitwaw?\n\nN. MATCHI-MANITOWOK itàwok.\nK. Tanisi ka ki ijihikasut nistam iyiniw?\nN. Adam, ki ijihikasuw.\nK. Tanisi ka ki ijihikasnt nistam iskwew?\nN. Eve, ki ijihikasuw.\nK. Eokonik tchi nijo ayisiyiniwok aniskâlch k’otchitwaw ayisiyiniwok kakiyaw?\nN. Enh enh, eokonik otchi.\nK. Tanisi ka totak Kijemanito nistam nabewa e wi ojihat?\nN. Ajaskiy ot awiwiniw, e wi itiskiwokinâl eji owiyowiyit e nabewiyit, ekusi otatchâkohew.\nK. Tanisi ani ijinagusiyit ayisiyiniw ot atchâkwa?\nN. Kijemanito ka ijinagusit ijinagusiyiwa; e ki’iji miyhimit kitchi eka kisipaniyik o pimâtisiwiniyiwiw.\nK. Nistam iskwew kita ojihit, tanisi am ka totak Kijemanito?\nN. Nabewa ospikekâniyiwiw e ki otinamwât, ot awiwiniw iskwewa kita otchi ojihimit.\nK. Taniki ani k’otchi pakitinikoyak Kijemani-to waskit askamik?\nN. Kita kiskeyimit, kita sâkihit kita nanahitât, wawâtch kita nâtit taki kitchi witapimit.\nKiskinohamakewin IV.\n\nK. Nistam ayisiyiniwok e ki kijibitwaw, tanda ka ki ayhitwaw?\nN. Nittawikitchiganik iyeyine meywâsiniyik, nanantok mistikwa e maminisiwiyit, ki ayhâwok.\nK. Tanisi ani ka ki itât Kijemanito nistam ayisiyiniwa, nittâwikitchiganik e ki ayhât?\nN. Nanantôk minisa mamitjikek, ki itew; ekusi e wâbatehât mistikwa tâwâyik e tchimasuyit, e minisiwiyit, ki kitahamowew kitchi eka mi tjiyit cokoni.\nK. Ki ayitiwok tchi tanisi ka ki ititwaw?\nN. Namawiya ki otchi ayitiwok tanisi ka ki ititwaw, e ki mitjitjik k’eyiwek anilhi, tâsipwa e ki misipâstahutwaw.\nK. Aweyiwa ka ki sikimikutwaw k’omominetjik anilhi?\nN. Matchi-Manitowa ka ki sikimikutwaw.\nK. Kinoves tchi ki pimâtisiw ADAM?\nN. Kekâtch kitchi mitatatatomitanâw nisto mitanaw ayiwâk, tatto pipun, ki pimâtisiw.\nK. Ki peyaku kitimahisuwok tchi nistam ayisiyiniwok e ki pâstahutwaw?\nN. Namawiya ki peyaku kitima hisuwok; kakiyaw mina ki kitimahewok ayisiyiniwa: tâsipwa e pe kikinittawikiyit e pâstahuwiniwa.\nNistam ayisiyiniwok e ki pâstahutjik wayawitisahwâwok miyonûk otchi.\nK. Tanisi ani ijihikatek anima pastahuwin?\nN. Sasibitaskiwin ijihikatew.\nK. Tanisi ani kit iji kitimahikunaw anima pastahuwin.\nN. Nipuwin, Akusiwin, Kaskeyitamowin, wawatch eka wikkateh Kijemanito kita wabamit, e miyhihikuyak.\nK. Tanisi iji kassinamakaniw pastahuwin ka pe kikinitawikik?\nN. E ayamihewisikahaljikasuk iji kassinamakaniw.\nK. Tanisi ka totawat Kijemanito nistam ayisiyiniwa nittawikitchiganik e ki pastahisuyit?\nN. Ki wayawiwebinew, kisik asotanawew kitchi papamikitmakisiyit.\nK. Tanisi ka ikik sasay e pe mitchetitwaw ayisiyiniwok waski askamik?\nN. Ayisiyiniwok sasay e pe mitchetitwaw wasket askamik, ki metchinistapawewok, misiwe e ki isikepeyik.\nK. Taniki ani k'o metchinistapaweljik ayisiyiniwok ekuspi?\nN. Otchitow Kijemanito ewi metsihât, osâm e kisiwahikut e pisigwâtisiyit.\nK. Kakiyaw tchi o pisigiwâtisittawaw ekuspi ayisiyiniwok?\nN. Peyak oskân namawiya o pisigwatisitta-\nEkuspi ka misi iski ek\nwaw; osâm oti Noe, e ijihikasul, ot awasimissa asitchi.\n\nK. Ki metsinew-tehi nista Noe, e ki iskipêyik?\n\nN. Namawiya ki otchi metsinew.\n\nK. Tanisi anu ka totak Kijemanito e wi gana-\nweyimat Noewa kitchi eka nistapâweyit?\n\nN. Ki atotew napikwân kita ojittâyîl, ekuta kita posi-\nhâyîl nanantok pijiskiwa nanijo.\n\nK. Sâsây kakiyaw e ki posiwit, tanisi ka totak Kijemanito?\n\nN. Ki kimiwanittaw nemitanaw kijikaw, eoko tattô tibiskaw; piyis ka pasitsipek misiwe, ayi-\nwâk ka ispâk waşiy ki ayiwakipew.\n\nK. Kakiyaw tehi ki metsinistapâwewok ekus-\npi ayisiyiniwok?\n\nN. Ayisiyiniwok kakiyaw, pijiskiwok wa-\nwâch misiwe askik ki metsinistapawewok; tattô piko napikwânîk ka ki positjik, eka ka nistapâ-\nwetjik.\n\nK. Tantatto pisim ki astew nipîy waskit askamîk?\n\nN. Ningotowâsik tattô pisim ki astew.\n\nK. Tanisi ka totak Noe e ki kapât?\n\nN. Noe, e ki kapât, webinâsuw, ekusi e wi iji nanâskumât Kijemanitowa, e ki pimâtjihikut.\nK. Tantatto pipun ki pimâtisiw Noe?\nN. Kekâteh kitchi mitatato mitanaw niyanano mitanaw ayiwâk tatto pipun ki pimâtisiw.\nK. Ta ispi ani ka ki iskipek?\nN. Kitchi mitataatomitanaw ayiwâk ningotawâsikwa mitataatomitanaw tatto pipun e ki kitchi askiwâk ka ki iskipek.\nC. E ki ponî iskipek, ayiwâk tchi pelchi miyo-pimâtisiwok ayisiyiniwok?\nN. Ayiwâk ki pelchi miyo pimâtisiwok, Kijemanitowa e astahikutwaw; maka e pelchi mitchetlitjik, ketatawe ki matchi pimâtisiwok.\nK. Name-tchi ki kustamwok mina kittwâm kilâ iskipeyik?\nN. Enh enh, ekusi ki iji kustamwok; tâsipwa ka ki wi ojittâtjik assiniywâskahigan nâspitch e ispâyik, ekuta e wi pitukeyamotwaw, kitchi eka nistapâwetjik, kittwâm iskipeyiki.\nK. O miyweyittefay tchi Kijemanito, e ojittâwit eokoyîw wâskahigan?\nN. Namawiya ki otchi miyweyitam esa; k'o mayakohât kakiyaw.\nK. Ki kijittaniw tchi eoko assiniywâskahigan?\nNamawiya otchi kijittaniw, iyiniwok ketatawe papitus e itatamutjik; eka enissitotatntjik, otjitow e ileyimigowisitjik, n'dawâtch nottow poyuwok.\nK. Ayiwâk tchi ki pelchi miyopimâtisiwok, e ki mayagusitjik?\nN. Namawiva ayiwâk ki miyopimâtisiwok; kekâteh kakiyaw e petchi waneyimâtwaw Kijemanitowa; pikwanata kekwây nanantôk e manitokatakawaw.\n\nK. Kakiyaw tehi ayisiyiniwok wasketaskamik ka ki ayâljik ekuspi, waneyimewok Kijemanitowa?\n\nN. Namawiya atawiya kakiyaw: ki nawasowâbamew Kijemanito atit e wi manâtjihikut.\n\nK. Tanisi ani ka ki ijihikasutwaw, aniki eka ka ki waneyimâtwaw Kijemanitowa.\n\nN. Judawiyiniwok ki ijihikâsuwok.\n\nK. Aweyiwa Kijemanito ka ki atotât Judawiyiniwa kita n’adawe kakeskimâyit?\n\nN. Moyisa ka ki atotât kita n’dawe wittamowâyit Judawiyiniwa tanisi gwayask kita iji pimâtisiyit, kisik kita âtjimustawâyit niyank ke wi ikiniyik.\n\nK. Taneki ani Kijemanito k’o nawasowâbamât Judawiyiniwa?\n\nN. Eokotowikânik e wi otchi otchiyit okosissa Jesusa, k’otchi nawasowabamât Kijemanito.\nJesus-Christ ka Tibeyimikoyak.\nKiskinohamakewin V.\n\n2. Jesus-Krist, Kijemanitowa ka okosisimikut, ka Tibeyimikoyak.\n\nK. Awena ana Jesus-Krist?\nN. Eoko ana Kijemanito okosissa ka manitowiyit, kisik ka ayisiyiniwiyit.\nK. Taneki k'o pe ayisiyiniwit Jesus-Krist?\nN. Ewi kispinatamâkoyak kitchi eka takine kisisuwâyak.\nK. Tanisi ani ka ki iji kispinatamâkoyak kitchi eka kisisuwâyak?\nN. Meskutch e ki mekit opimâtisiwin ayami-hewatikôk e ki tchistahaskwatîl.\n\n3. E miyosiyit Manitowa, ka ki miyorihikut; kit-chitwa Mariwa, ka ki nittawikihikut.\n\nK. Aweyiwa ka okosisimikut Jesus-Krist iji Manitowit?\nN. Kijemanitowa ka okosisimikut.\nK. Aweyiwa ka ki nittawikikut Jesus-Krist?\nN. Kitchitwa Mariwa ki nittawikihik.\nK. Awena ana kitchitwa Marie ka itit?\nN. Eoko ana iskwew ka ki osân kànâtâtkhâkwet, Kijemanitowa ka ki nawasonikut, okosisiyiwa kitchi nittawikihât.\nJesus o mittawikihikut kitchitwa Mariwa.\nK. Tanisi'ani ka ki otawâsimissit Kitchitwa Marie?\nN. Ka miyosiyit Manitowa e ki miyikut k'o okosisit.\n\nK. Namatchi ki otâwiw Jesus iji ayisiyiniwit?\nN. Namawiya otchi otâwiw Jesus iji ayisiyiniwit; maka kiteitwa Josepha ki ganaweyimik.\n\nK. Awena ana kitchitwa Joseph?\nN. Eoko ana kitchitwa Mariwa ka ki wekimât.\n\nK. Tandawik ka ki nittawikit Jesus?\nN. Otenâk Betléem ka ijihikâtek, pijiskiwikamikôk ki nittawikiw.\n\nK. Taniki ani pijiskiwikamikôk k'o wi nittawikit?\nN. E wi iji kiskeyitamohikoyak kitchi eka ayimeyitamwayak ketimâkisiyaki; wawâtch kitchi eka kisteyimuyak, kitimâkisiwinik k'o wi nittawikit.\n\nK. Ta ispi ani ka ki pe nittawikit Jesus ota askîk?\nN. Newaw kitchi mitatatomitanow tatto pipun e ki kitchi askiwiyik, ka ki nittawikit Jesus.\n\nK. Taniki ani wetchi nittawikit Jesus?\nN. Ewi kiskinohamâkoyak tanisi ke ki totamwâyak kita miyoayiwiwâyak, e wi osimohât wawâtch kit atchâkonowa.\nK. Tanisi ijihikateyiw kijikaw ka ki nittawikit Jesus-Krist?\nN. Noel, ijihikateyiw.\n\nKiskinohamakewin VI.\n\nK. Tanisi ka ki ikkiniyik Jesus ka ki nittawikit?\nN. Oganawepijiskiwok atit, Okijikowa e ki wittamâkutwaw Jesusa e nittawikiyit, ki n’dawâbamewok Betleemîk e wi omanitomimâtjik.\n\nK. Namatchi mina nandow ki otchi ikkiniyiw?\nN. Iyepine emiyosit atak ki nogusiw; ekusi nisto Okimâwok iteke eta e otchi sakâsteiyik e otaskitwaw, ki wâbamewok, kisik wittamâgowisewok Kijemanitowa okosisiyiwa e’ki nittawikiyit.\n\nK. Tanisi ani ki lotamwok atakwa e ki wâbamâtjik?\nN. Jerusalemik ki itutewok, Jesusa e wi n’dawâbamâtjik; maka eka e ki miskawâtjik, Bethleemîk, ki n’dawemiskawewok.\n\nK. Tanisi ani ki totawewok Jesusa e ki miskawâtjik?\nN. Ki otchigwanapistawewok, e wi omanitomimâtjik, kisik mamiythewok osâwâsoniyâ wa asitchi pikiwa e miyomâgusiyit.\nK. Tanisi mina ki lotamwek, e ki omanitomimâtjik Jesusa?\nN. Kiwi ki kiwewok ot askiwâk, ewi n’dawe âtjînatwaw Kijemanitowa okosisiyiwa e ki nit-tawikiyit.\nK. Jerusalemk e ki tagusikwaw, nametchi nandow ki otchi ikkininiyiw?\nN. Tâpwe Ilorod e itit, ann mamawiyes ka ki kitchi ayiwit ekute ekuspi, e ki pettak kutaka e ki nittawikiyit okimâwn, Jesus e ijihikâsuyit, mistahi sekisisiw esa.\nK. Tanisi ani ka totak Ilorod, e “samiseckisit”?\nN. O winipahâtây Jesusa, osâm c kustât kikkik otibeyitchikewin kita maskamikut.\nK. Ki kiskeyimew tchi Jesusa mwetchi eta e ki nittawikiyit?\nN. Ki kiskeyimew Bethleemik e ayâyit; maka namawiya otchi kiskeyimew mwetchi eta e ki ayâyit.\nK. Tanisi ka totak Jesusa e wi nipahât?\nN. Ki atuskemuw kakiyaw nabesisa eka ayiwâk e nijo pipunweyit, tatto etasiyit Bethleemik kita metchi nipahimit.\nK. Nista tchi ki nipahaw ekuspi Jesus?\nN. Namawiya ki otchi nipahaw ekuspi Jesus; Okijiko e ki n’dawe wittamowâl Josepha kita osimohâyit Ejiptik.\nK. Kinowes tehii ki ayawok Ejiptik?\nN. Nawatch oti, e yigok e ki nipiyit Heroda, kawi ka pe kiwetjik.\nK. Tanisi ani ka ki jji mamatawitotak Jesus, mitatat nijo sab e itatto pipunwet?\nN. E ki witjiwat okawiya Jerusalemik, e ndawe ayamihayit, ekute ki kiskinohamawew okiskinohamakewiyiniwa mamawiyes e iyinisiyit.\nK. Tantatto pipun ki witjiwew Jesus okawiya?\nN. Nisto mitanaw tatto pipun, ki witjiwew.\nK. Tanda ka ki ayat Jesus megwatch e witjiwat okawiya?\nN. Otenak, Nazareth e ijihikateyik, ki ayaw.\nK. Tanisi ani ka totak Jesus e nisto mitanaw itatto pipunwet?\nN. Ekwayak ka ki matji kiskinohamaket.\nK. Tanisi ani ka totak mayowes kiskinohamaket Jesus?\nN. Pakwataskamikak nemitanaw kijikaw ki ndawe iyewanisihisu, kisik e ayamihat.\nK. Aweyiwa pakwataskamikak ka nakiskawat Jesus?\nN. Kitchitwa Jean-Baptista ki nakiskawew e otami sikahatchikakeyit, ekusi ka nantotamawat kita sikahatakut.\nK. Tanisi ani ka ki ikiniyik Jesus ka ki sikahatat.\nN. Ki petlawaw mosis Kijemanito Weyotawimit ekusi e jtwet: \"Eokó ana ni kosis náspitch ka sakihak.\" Ekusi ka Miyosit-Manito e ki omimiwinakuhut, Jesusa ostikwáníyik ki petwehuw.\n\nK. Tantatto pipun ki kiskinohamákew Jesus?\nN. Nisto pipun ki kiskinohamákew.\n\nK. Tantatto ka nawasonát ayisiyiniwa Jesus, kita witjewát e papami kiskinohamaket?\nN. Milatat nijosáb e ki nawasonát ayisiyiniwa, ki witjewew e papami kiskinohamaket.\n\nK. Tanisi ka ki ijihikasutwaw aniki?\nN. Pierre, André, Jacques, Jean, Mathieu, Thomas, Jacques, Alphé okosisa, Simon, Jude, Juda, ki ijihikásuwok: gokonik nistam kitchi ayamihewiyiniwok.\n\nK. Nama tchi nandaw ki iji mamattawitotam megwách e papami kiskinohamaket Jesus?\nN. Tápwé, mitchetwaw ki mamattawitotam, e apisisimát enipiyit ayisiyiniwa, wawách e iyinikkahát kutaka enanekátisiyit.\n\nK. Tanjki ani ekusi ka ki iji mamattawitotak Jesus?\nN. Ekusi e wi iji kiskeytamohiwet kisik e Manitowit, kisik e ayisiyiniwit.\nJesus ki nipustamâkonow ayâmihewâtikok:\nKISKINOHAMAKEWIN VII.\n\n4. Ponce-Pilate megwâch e kitchi ayiwiyit; oya-\nmihewatikôk ki tsistahaskwâtaw; ki nipiw, ki\nweweginaw; ki nahinaw.\n\nK. Anihi tattô ka ki kiskinohamowâl Jesus; ki\ntâpwettâk tchi?\n\nN. Mitchet namawiya otchi tâpwettawewok.\n\nK. Awena ana ka ki wiyasuwatat Jesusa?\n\nN. Ponce-Pilate itaw, ana ka ki wiyasuwaatat.\n\nK. Tanisi ka totât Jesus, e ki wiyasuwatat?\n\nN. Ki pasastehwaw, ki pasikwepitaw okamin-\nnakasiwatikwa otchi, ayamihewatikôk ki tsista-\nhaskwataw, ki takkamaw.\n\nK. Taniki ani ayamihewatikôk k'otchi nipahit\nJesus?\n\nN. Ekusi e wi-iji-kaskitamâkoyak (kitchi eka\nn'dawi kisisuwâyak nipiyaki.\n\nK. Kakiyaw-tchi ayisiyiniwa ekusi ki iji miyo-\nkaskitamawew?\n\nEnh enh, kakiyaw, kispin mitoni ganaweyi-\ntamwân ot itasiwewin, namawiya kita n'dawi\nkisisuwanîwiw.\n\nK. Tande ka ki nipahit Jesus?\n\nN. Watchîk, Calver ka ijihikâtek; tsiki otenâk\nJérusalem ka itamik.\nK. Tânispi ani Jesus ka ki nipahit.\nN. E miyoskamiyik, nijo tikiskaw mayowes espayik Pâques.\nK. Tanisi ijihikâteyiw kijikaw ka ki nipahit Jesus-Krist?\nN. Kitchi ayamihewâtikokijikaw, ijihikâteyiw.\nK. Tantatto pipun ki pimâtisiw Jesus waskît-askîmik?\nNistomîtanaw-nisto sâb tattto pipun, ki pimâtisiw.\nK. Jesús e ki nipahit tanda ka ki astâwit wiyaw?\nN. Ki nahinamwân oskiwâtikânîk.\n\n5. Atâmaskamikôk ki nittagusiw; e ki nijo tibiskâyik, ki âpisisin.\n\nK. Jesús e ki iskwatamut, tanda ka ki ituteyit ot atchâkwa.\nN. Ki ituteyiwa eta e ayayit talto ka ki miyo-pimâtisiyit ayisiyiniwa e ni piyit aspin ka kitchi askiwiyik.\nK. Taniki ani ekute k’o ituteyi Jesus ot atchâkwa?\nN. E ndawi wittamowâyit ekwa kijikôk kita pitunkeyit, ekusi e ki iji kaskitamowât, ayamihe-watikôk e ki nipahit.\nK. Taniki ani ēka semāk k'o pittukētjik kijikōk, oskatch ka ki miyopimātisitjik.\n\nN. Ekipahikateyik, nistam ayisiyiniwā e ki, pāstahisuyit aspin; maka e ki yotenamākulwaaw Jesusa aymihewātikōt e ki nipahimit, ekwa ka ki pittukētjik.\n\nK. Tānišpi ku ki āpisisk Jesus-Krist?\n\nN. E ki nijo'tibiskāyik aspin e ki nipahit ka āpisisk.\n\nK. Tanisi ijihikāteyik kijikaw Jesūs ka āpisisk?\n\nN. Paques, ijihikāteyiw, mina āpisisinokijikaw.\n\nKISKINOHAMAKEWIN VIII.\n\n6. Kijikōk ki obiskaw, o kitchiniskiyik nāhapiw otawiya ka mamāttawisiyit.\n\nK. Tantatto kijikaw waskit askamik ki ayaw Jesus e ki apiśisik?\n\nK. Nemitanaw kijikaw.\n\nK. E ki nemitenaw kijikāyik, tanda aspin Jesus?\n\nN. Aspin kijikōk e obiskāt, ekuta e n'dawi nabapit okitchiniskiyik otawiya ka nāspitch mammalawisiyit.\nJesus iskweyatch ke wiyasuwasiwet\nK. O kitchi niskiw tchi Kijemanito?\nN. Namawiya okitchiniskiwiw, eka e owiyowit.\nK. Tanisi ewi itwek anima: “Jesus nahapiw okitchiniskiyik otawiya ka mamattawisiyit”?\nN. K’eji mamattawisiyit otawiya, ekusi iji e mamattawisit; k’eji Manitowiyit, ekusi iji e Manitowit niita, wi itwaniw.\nK. Tandé eyàt anotch Jesus?\nN. Misiwe ayaw iji Manitowit; maka iji ayisiyiniwit, kijikôk, mina kitchitwaw Eukaristiwinik, ayaw.\nK. Nagatam tchi kijik Jesus, kitchitwa Eukaristiwinik kitchi pe ayàt?\nN. Namawiya otchi nagatam; kijikôk, kisik Eukaristiwinik, ayaw.\n\n7. Ekuta kita otutew e wipewiyasuwatât tatto, pimâtisiyit, mina tatto nepiyit.\n\nK. Taneyigok mina Jesus mosis ke wàbamit waskit askamit?\nN. Eyigokponi askiwiyiki mina kita wàbamaw, e wipewiyasuwatât tatto e pimâtisiyit, mina tatto e nipiyit.\nK. Tanisi ami e wi itwek anima: “E wi pewi “yasuwatât tatto e pimâtisiyit, mina tatto e nipiyit”?\nN. Kakiyaw kita wiyasuwatow nyisiyiniwa, latto ka ki miyo-ayiwiyit, mina latto ka ki matchi-pimatisiyit, wi itwaniw.\n\nK. Tantattwaw ke wiyasuwatikawiyak?\n\nN. Nanijwaw ki ka wiyasuwatikawinanow; nihiyaki semak ki ka wiyasuwatikawinanow, eyigok-poni askiwiki, kittwam ki ka wiyasuwatikwinanow mamawi.\n\nK. Tanisi ke ayitiljik ayisiyiniwok ki wiyasuwatitwawi?\n\nN. Atit taki kijikok kita pimatisiwok, iyepine kitchi miyo-ayiljik; kutakak maka taki kita kitimakisiwok, matchi Manitowa e witapimatjik.\n\n8. Ni tapwewokeyimaw Meyosit-Manito.\n\nK. Awena ana ka Miyosit-Manito?\n\nN. K'ei niilitijik Kijemanitowinik, eoko ana peyak e Manitowit, k'ei Manitowiyitka okosisiyit, mina ka oyotawiyit Manitowa.\n\nK. Keko kijikaw nistam ayamihewiyiniwck Meyosiyi Manitowa ka ki natikutwaw?\n\nN. E kitchikijikayik Pentekok ka itaganiwik.\nKitchitwa Marie mina nistam otayamihAwok e'penatikutwaw Meyo iyit Manitowna.\nNistam kiic i ayamihewiyiiniwok e n'dawikiskinohamaketjik.\nKISKINOHAMAKEWIN IX.\n\nK. Tanisi eteyittkwak k’etwek: “Ni tapwe-wokeyitten katolik ka iji ayamihâk.”\n\nN. Omisi iteyittâkwan: E peyawkwak kita miwâsik ayamihewijittwâwin, katolik ka ijihikâték, ka ki petwâkoyak J.-C: Namawiya kwayask pa-atuskawew Kijemanitowa awiyak ojitaw eka katolik ijitwâtji.\n\nKISKINOHAMAKEWIN X.\n\n9. Ayamihestamâkewok okanatâtchâkwewok:\n\nK. Tanisi ani e wi itwek anima: “Ayamihestamâkewok Okanâtâtchâkwewok”? N. Abatjihituwok e ayamihestamâtutjik ka nitta ayamihâtjik.\n\nK. Nama tchi nandow kit iji abatjihikonowok kijikôk ka miyo-ayâtjik?\n\nN. Nâspîch’kit abatjihikonowok, taki e otami-ayamihestamâkoyakwaw.\nKitchi kijikôk, waskitashamik mina kâssinamâke-wiskutek-e iji-ayamihê-abatjihituk.\n10. Wipakitchikatewa matchi-itiwina; 11. Rita apisisinaniw.\n\nK. Tanisi iji pakilchikatewa melchi-itiwina?\nN. Eayamihewisikâhâtjikâsuk, otjitaw ka kwatakîhisuk, kisik e ayamihe âtjimisuk.\n\nK. Tanisi ke ikik poni askiwiki?\nN. Eyigok poni askiwiki, kita apisisinaniwiw.\n\nK. Tanisi ke ikik ki apisisinaniwiki?\nKakiyaw kittwâm kitta wiyasuwâlawok ayisiyiniwok.\n\n12. Taki kita pimâtisisinaniwiw.\n\nK. Apisisikwâwi ayisiyiniwok, kittwâm tchi kita nipiwok?\nN. Namawiya kittwâm kita nipiwok; takine kita ayawok, iji owiyowitjik, mina iji otatchâkûtik.\n\nK. Tande kita ayawok ayisiyiniwok iskweyâtki wiyasuwâtitwâwi?\nN. Tatô ka miyo-ayiwitjik kijikôk kita ayawok, takine kita miyo-ayâljik; tatô maka-eka ki miyo-ayiwitjik, kita matchustewebinaawok, takine kitchi kisisutjik.\n\nK. Ki poni askiwiki, namatchi mina âtit okâssinamâkewiskutek, ka itâgânîwik, kita ayâwok?\nJesus mamâttâwihew kitchitwa Pierra.\nN. Namawatch awiyak, e wi ponipayik eoko iskutew eyigok ponj askiwiki.\n\nK. Awena okassinamakewiskutek ka ayhit ketimakisisitji?\n\nN. Awiyak piko matchi-iliwinisa e kikišakakut eka eskwa e kijikwatakihisyt, o matchi iliwinina tchi pakiteyitamoth.\n\nK. Awena Kijikok ke itutet nipitji?\n\nN. Awiyak e ki sikahaljikasul, ispitch olehit Jesusa ot ijitwawiniyiw e tąpwewokeyitak, wawatch naspitch e kesināteyitak tanisi e ki petchi matchi itātjhūt.\n\nK. Aweda ka matchustewebinit takine klitchi kisisut nipitji?\n\nN. Awiyak eka e nanagataweyitak gwayask ayamihawin, taki e sekittat o matchi itātjhūwin, kitā matchustewebinaw.\nEyigok mewasik manawi ka mawimustchikek.\nDE LA PRIÈRE\n\nKISKINONAMAKEWIN XI.\n\nK. Ayamihe-mawimustchikewin, kekwâyeoko?\nN. E nanagataweyimit, mina eka wikkâch e poneyimit, Kijemanito kita inanâtjihit, mina kita paguseyimit, eoko oma ayamihe-mawimustchikewin ka itwek.\n\nK. Tanisi kita ki iji ayamihaw awiyak kita miywâsiniyik ot ayamihâwin?\nN. Espitch otehit kita nanagataweyitain k'ëji mawimustawât Kijemanitowâ-e paguseyimat.\n\nK. Tana ayiwâk ka kitchitwaweyitagwak ayamihe-mawimustchikewin?\nN. Ayamihâwin ka iji kitchitik: \"N'otanân\" kitchikijikôk eyâyan,\" eoko oma ayiwâk ka kitchitwaweyitagwak.\n\nK. Taniki ani N'otanân k'o itayak Kijemanito?\nN. E ki ojihikoyak wâwâch kakiyaw e mamiyhikoyak kita opimâtjihuwayak; N'otanân k'o itâyak.\n\nK. Kekwây netotamowâyak Kijemanito: \"Ptane-miyweyitchikâtek ki wiyowin\", etâyaki?\nN. Ki natotamowânow kita kiskeyimit, kita sakihit, kita nanahitât, kita manâtjihit misiwe.\nK. \"Pitane otchitchipayik ki tibeyitjikewin\": Tanisi ahi e wi itwek eoko?\n\nN. Ekusi etweyaki, ki natotamowânow Kijemanito ki tehinowâk kita wi astât o'sâkihituwin; eyigok mina nipiyaki, kijikôk kita wi otinikoyak.\n\nK. Kekwây ka natotamât Kijemanito: \"Ka iji 'nentotâkâwiyan kitchi kijikôk, pitane ekusiji waskit aškamîk\": etweki.\n\nN. Ekusi iji natotamowaw, kâti wi kitimakinawât, kita wi miyhat ayisiyiniwa ota askik kitchi nanahîtâkut, okijikowa, mina okanatâchâkwewa kijikôk k'ëji nanahîtâkut.\n\nK. Kekwây netotamowat Kijemanito: \"Anotch ka kijikâk miyhinân ni pakwejiganiminân,\" etweyani?\n\nN. Ni natotamowaw Kijemanito kita wi miyhit tattwaw kijikâki kita opimâtjihuyân, eji owiyowiyân, mina eji otatchâkuyân.\n\nK. \"Tanisi iji kâsinamâwâyâkik aniki ka matchi \"totakoyâkik, ekusi iji kâsinamâwinân e ki matchi \"totamâk\": Tanisi e wi itwek eoko?\n\nN. Ekusi etweyaki, ki mawimustawânow Kijemanito kita wi kâsinamâkoyak metchitotâmaki, k'ëji kâsinamâwâkitwaw ka ki matchitotakoyakwaw.\n\nK. Awiyak ka kisistawât witji ayisiyiniwa\nmetchitotâkutji, kita kâsinamâgowisiw tchi metchitôtaki?\n\nAwiyak eka ka nitta kâssinamowât witji ayisiyiniwa metchitotakutji, uista namawiya kita kâsinamâgowisiw; eyigok isko ke kisistawât witji ayisiyiniwa, namawiya kita kitimakeyimigowisiw.\n\nK. Kekwây netotamak: \"Pisiskeyiminân kitchi eka matchi mamitoneyitamâk\": etweyaki?\n\nN. Kita wi sokiteheskakoyuk Kijemanito kitchi tabasittayak matchi mitoneyitjigana wetitikuyaki, matchi pimâtisiwin kitchi šâkotchittâyak; kitiji natotenânôw.\n\nK. Kekwây netaweyitaman: \"Iyekatenamâwînîn ka mayâtak\": etweyani?\n\nN. Ni paguseyimaw Kijemanito kitchi kakike ganaweyînit, kitchi eka matchi totamân, kitchi eka kaskihiyit matchi-manitowa.\n\nKiskinohamakbwin XII.\n\nK. Awena ana ka ayamîhit: \"Kit atamiskatin Marie\": etweki?\n\nN. Kitchitwâw Marie, nâspitch ka ki kanatâchâkwet, Jesusa ka ki okawîmikut, ka ayamîhit.\n\nK. Abalan tchi kitchitwaw Marie e ayamîhit?\nN. Enh enh, abatan; ayiwâk e nanahitâgowisit kijikôk kekwây pegusestamakoyaki.\n\nK. Ka ispityimimit Kijemanitowa, ekusi iji tchi ispityimaw kitchitwaw Marie?\n\nN. Namawiya ekusi iji ispityimaw; piko epaguseyimit kita ayamihestamâket.\n\nK. Kiskeyitamwok tchi kitchitwa Marie, mina okanâtâtchâkwewok, mewimustâtwâwi?\n\nN. Enh enh, kiskeyitamwok, tchikema Kijemanitowa e kiskeyitamohikutjik.\n\nCOMMANDEMENTS DE DIEU.\n\nKISKINOHAMAKEWIN XIII.\n\nKijikôk tchi kita ituteuwok tatlo ka sikahâtjikâsutjik?\n\nN. Namawiya kakiyaw kijikôk kita ituteuwok, atit e ata sikahâtjikâsntjik, eka e tapwewokeyitakik ispîch otehitjik Jesnsa ot ijitwâwiniyiw; eka mina e ilâtjihutwaw Kijemanitowa k’eji n’taweyimikotwaw.\n\nK. Tantatto etatiniyiki Kijemanito ot itasibewina?\n\nN. Mitâlat itatiniyiwa: “Piyeayakut Kijemanito, &c.” ka iji kitchitik,\nK. Tâispi Kijemanito ka mekit ot itasiwewina?\nN. Ekwaw nistwaw kitchi mitatalomitanâw, ayiwâk newaw mitatalomitanaw kekatâch tattopipun, aspin Kijemanito ka atotâl Moyisa, kita masinabiskamiyit wawâtch kitâchi n’dawî kiskeyi-amohâyit Judawiyiniwa.\n\nK. Tanisi ka wi iji kiskeyitamohikoyak Kijemanito: “Piyeyakut Kijemanito omanitômih; ki tehîk otchi mina sâkih,” e itwe?\n\nN. Kiwi iji kiskeyitamohikonow e nayestow peyaku Manitowit, kita peyakû omanitominâyak, kita nâspitch sâkihâyak, kita peyaku-mâmisisîtô-tawâyak.\n\nK. Namatchi k’o manitomimânowok okanâtâtchâkwewok eyamibayakwâwi?\n\nN. Nama wawâtch k’omanitomimânowok; piko e mawimustawâyakwaw kita ayamihestamâkoyakwaw.\n\nK. Naspasinahiganak, ayamihewâtikusak, namatchi omanitomimâwok?\n\nN. Nama wawâtch omanitomimâwok eokonîk; maka tattwaw genâwâbamilwâwi, miyomîoneyitamopayinaniwan, miyo nanagataweyitâganiwan.\n\nK. Tanisi e wi itwek anima: “Ekâ wikkâtch wiyakim Kijemanito; ekâwiya mina wiyakittamâw ot ojitjigana?”\nN. Ekusi oma ka wi itwek: namawiya wikkâch pikwanata kita wiyhaw Kijemanito, namawikkâch kita matchipikiskwâtaw; ot ojitjigâna namawiya kita matchi pikiskwatamwân.\n\nK. Kita matchilotam tchi awiyak Kijemanitowa wiyhât ewi tâpwetâgusit e kitchitwâyik kekwây iyatotaki?\n\nN. Namawiya kita matchilotam Kijemanitowa wiylât e wi tâpwetâgusit, e kitchitwâyik kekwây iyatotaki; maka kita matchilotam wawiyhât oljîtaw e wi tâpwetâgusit, e âtu pikwanata mamiyakâtjimut, wâwis kiyâskâtjimulji.\n\nK. Wa kilîmakayîmigowisik askaw, asotamowaw Kijemanito kitchi kwatakihisuwit; miywâsin tchi?\n\nN. Enh ênh, miywâsin ekusi ka iji asotamakek; maka eka totamuth Kijemauilo k'ëji asotamât, pa matchitotaganiwan.\n\nK. Tanisi ka wi itwek anima: \"Ekawiya ojitjike ayamihew ikijikâki; piko peyatik ayamiha\"?\n\nN. Kitahamâgôniwan kitchi eka atuskek aymihewikijikâki piko tchi kakwe ayamihewâtisik.\n\nK. Tanisi ka wi iji sikimikoyak Kijemanito: \"Ki nikihiwkok manâtjilotawik kinowes kita pindtisiyan\": e itwet?\n\nKit iji sikimikonow kitchi manatjhâyakwaw: kitchi nanahitawâyakwaw, kitchi sakihâyakwaw ki njikihikonowok.\nK. Tanisi ka ki wi iji kitahamâkêt Kijemanîto:\n\"Ekawiya nipâtâko, Ekawiya mina mamitone-\nyita kitchi nipâtâkeyan:\" e itwet?\n\nN. Kitâhamakew kitchi eku nipâtâkewit, kitchi\neka kisistâtuwit, kitchi eka notinituwit.\n\nK. Tanisi ka wi iji kitahamâhagâniwik: \"Eka-\nwiya pisigwâtisi\": e.itwet?\n\nN. Kitchi eka pisigwâtisitotamik; mina kitchi\neka pisigwâtisimitoneyitamik.\n\nK. Tanisi kani ka wi itwek anima: \"Eka-\nwiya kimotamaw aviyak ot ayâna\"?\n\nN. Namawiya kita kimodinâniwan; Namawiya\nkita nisokamagâniwan kitchi kimotik; namawiya\nkita ganaweyitagâniwan kekwây ka ki kimotik;\nwawâsteh namawiya kita kâtâniwan e ki miskamik.\n\nK. Tanisi kita totagâniwan ki miskamiki\nkekwây?\n\nN. Kita kakwetjikemunâniwan, awena wetayâ-\nnikwe; namawiya ekusi iji soskwâch kita wi ot\nayâniwan.\n\nK. Tanisi ka wi iji kitahamâkoyak Kijemanîto:\n\"Ekawiya kiyâski:\" e itwet?\n\nN. Kit iji kitahmâkonow eka kita kiyâskiyak,\nmina kitchi eka matchi ayimweyak.\n\nK. Tanisi ka wi itwek anima: \"Peyakuhituk\nwiyekittuyek?\"\nN. Ekusi oma ka wi itwek : tatto ka wikitutwaw kita payakuhituwok ; namawiya pitus awiya kila wi musitawinawewok.\n\nK. \"Ekawiya wikkâtch kakayesinahike :\" Tanisi ka wi itwek eoko ?\n\nN. Namawiya kita kakayesihitunaniwan kekwây etâweki, niyeskutonamâtuki, esotamatuki.\n\nK. Aweniki ka nitta kayesinahiketjik ?\nNitta kayesinahikewôk ka osâmisasâkisitjik.\n\nCOMMANDEMENTS DE L'EGLISE.\n\nKISKINOHAMAKEWIN XIV.\n\nK. Eoko tatto tchi piko ayamihewitasiwewina ?\n\nN. Namawiya piko eoko tatto ; keyâpitch tepakop itatinwa kitchi ayamihewiyiniwok mamawi e ki-ojitâtjik.\n\nK. Ekusi tchi ki iji mamattawihâwok kitchi ayamihewiyiniwok, ayamihewitasiwewina kita ojitâtjik ?\n\nN. Enhâenh, ekusi ki iji mamattawihew Jesus-Krist e itisawât aniskâtch kitchi papami kiskeyitamohiweyt misiwe, gwayask kitchi ijîtwâwit.\n\nK. Tana anihi ayamihewiyiniwok otîtasiwewiniwawa ?\n\nN. Manâtjitta kitchikijika w k'etwek, &ct.\nK. Tanisi ani ewi itwek eoko: \"Manatjitta kitchikijikâwa\"?\n\nN. Iyenataw ayamihewikijikaw ka iji manatjit-tâk, ekusi iji kita manatjittâk kitchikijikâki.\n\nK. Tanisi ani kita ki iji manatjittâniwan ayamihewikijikaw?\n\nN. Tattwaw ayamihewikijikâki, wâwâtch kit-chikijikâki, kita wi pitukâniwan ayamihewika-mikôk, kita witji ayamihâmît ayamihêwiyiniw LAMESIKETJI; wâwâtch kitchi nandotamik ka iji kakeskikemut.\n\nK. Peyakwaw tchi piko kita âljimisustâsunani-wan tattwaw askiwiki?\n\nN. Seyâke peyakwaw tattwaw askiwiki; kita wi âljimûstasunaniwan; maka ayiwâkâbâtjihisunaniwan kakiyipa iyâljimisuki.\n\nK. Apisisinokijikâki tchi piko kita ayamihe saskamunaniwan?\n\nN. Namawiya apisisinokijikâki piko kita saskamunaniwan, maka ayâskaw kita wi kaskittâmasunâniwiw.\n\nK. Tanisi totâgananiwan iyewanisihisuki?\n\nN. Iyewanisihisuki, abilaw kijikâki eyîgok mitjisuñaniwan; welâgusiki mina saskamusina-niwan.\n\nK. Keko kijikaw eka ka mitjik wiyas?\n\nN. Ayamihewâtikokijikâki piko ekwa eka ka\nAyamikewinanatawihuwin\nka itamik,\neoko anima : otchistamâ-\ngowislwin eka\nniyokwak, kiškinowateyit-\nchigan niyo-\nkwak, ka ki ojittât\n\nJesus,\nkitn kitchitwâwisihât kit\natchâkonowa.\nmitjinaniwik wiyàs, maka Manitowikijikaw mwe-\ntchi ayamihewâtikokijikanok espayiki, wiyàs\nmitjinaniwan.\n\nK. Taniki ani k'o kawakatusohisuk?\nN. Otjitaw kita kwatakibisuk e wi kâsinam suk\nka ki iji matchi ayiwik: Jesus-Krist nikàn nemi-\ntanaw kijikaw ki iyewanisihisuw; omisi mina ki\nitwew: \"Eku kwatakihisuljì awiyak nama wîk-\n\"kâlch kijikôk kita pitukèw.\"\n\nK. Tanisi ewi itwek anima: Mitoni kita wi\nmiyaw ayamihewiyiniw tchi otchi pimâljihul\"?\nN. Ekusi oma ka wi itwek: otayamitchikewok\nkita wi mekiwok ayamihewikamikôk kita opiinâ-\njihuyit ayamihewiyiniwa; wâwâleh ayamihewi-\nkamik kita otchi pamittâwit:\n\nLES SACREMENTS.\n\nKISKINOBAMAKEWIN XV.\n\nK. Kekwây ani Kijemanilo o nanatâwiwu-\nwina, ka itâmik?\nN. Jesus-Krist ka ki pepikuha ol ojiljigana e\nwi otchi katawâsisihâl kit atchâkonowa, eoko ani.\nK. Tantatto elatiniyiki Kijemanilo onanata-\nwiuwina?\nN. Tepakop itatiniyiwa, eokoni: Ayamihewi-\nsikahâtjikâsuwin, Ayamihewisokiteheskakewito-\nminitowin; Ayamihiwikâsinamakewin, Kitchit-\nwawebinâsuwin, Ayamihewiskwayatchitominjito-\nwin, Ayamhewiyiniwijibitowin, Ayamihewiki-\ntchiwikitowin.\n\nK. Tanîma ayiwâk iyabatak itatiki?\n\nN. Ayamihewisikâhâtjikâsuwin, mamawiyes ka\nabatak; awiyak eka e sikâhâtjikâsut, namawik-\nkâtch Kijemanitowa kita ki wâbamew.\n\nK. Tanisi ani ekik ka sikâhâtjikâsuk?\n\nN. Ka sikâhâtjikâsuk, kakiyaw matchi itiwina\nkasinikatewa: matchî-itiwin ka pe kikinittawî-\nkik, wâwâtch tanisi ka ki jji seke matchitôtamik\nmayowes sikâhâtjikâsuk.\n\nK. Tanisi ani mina kit jji abatjihikunow Sikâ-\nhâtjikâsuwin.\n\nN. Kit jji abatjihikunow kichi otawâsimisimi-\nmikoyak Kijemanito, wâwâtch kitchi nîta witje-\nwâyak ot ijîtwâwinîk.\n\nK. Aweniki ka nitta sikâhâtâketjik?\n\nN. Iyenataw, ayamihewiyiniwok; maka eka\nsesik eyâtwâwi, kakiyaw awiyak pa ki sikâhâtâ-\nwew witji ayisiyiniwa, eka wi itâyitji.\n\nK. Tanisi totâgâniwan ka sikâhâtâkek.\n\nN. Nîpîy, sikinakâniwan miskattikök kisik\nekusi memutch itwâniw: \"Ki-Sikahatatîn,\n\"Weyotawimit, mina Wekosissimit, mina Mey-\n\"osit-Manito owiyowinîk.\"\nK. Tanattwaw kita ki sikahatatwaw awiyak.\nN. Peyakwaw piko.\nK. Taniki ani peyakwaw-piko k'o sikahatat awiyak?\nN. Ekawikkatch e wi kasiipayiyik ka ki iji kiskinowatjihimit ot atchakwa, peyakwaw piko k'o sikahatat awiyak.\nK. Ayamihewiyiniw awlya sekahatatwati, taniki ani wanaskutch ot eyaniyik, k'o astawat siwitaganis?\nN. K'o totawat, kitchi mamitoneyitamiyit ka ki iji asutamakeyit ot atchakwa ka ki kanatjihimimit sikahatjikasuwiniik, Kijemanitowa ot itasiwewiniyiw, kitchi nanagataweyitamiyit, wawatcheka wikkalch kitchi matchitoneyit.\nK. Taniki ani oskatikoyik k'o ayamihewatikonamawat?\nN. Oskatikoyik k'otchi ayamihewatikonamawat kitchi eka wanikiskisyiit Jesusa ayamihewatikok e ki nipustamakuyit wawatch kitchi eka nepewisistanowayit ot ijitwawiniyiw.\nK. Taniki ani mina k'o pitukahat ayamihewikamikok?\nN. Ekusi kita iji kiskeyitamik k'o pitukahatatto ka sikahatjikasutjik oma, anotch ka iji pitukahitjik ayamihewikamikok; ekusi ewi iji pitukahitjik kijikok gwayask itatjihutwawi.\nK. Taniki ani k'o ayamihewatikonamawat o tawokayik mina o teyikomiyik?\n\nN. Kitchi eka pisutamiyit metchi kiswatiimitji, mina kita miyweyitamiyit miyo-itaijihuwin.\n\nK. Taniki ani mina k'o ayamihewatikonamawat waskiganiyik, mina o tapiskokezyik?\n\nN. Eta e itateyitamowat otehiyiw k'o ayamihewatikonamawat, ispich otehiyiit Kijemanitowa kita sakihayit; o tapiskokezyik k'o ayamihewatikonamawat kitchi eka kisiwasiyit nandow ittiyitji; peyati k'tchi nayatamiyit kwatakitlawin; Jesus eka e ki ataweyitak ot ayamihewatikoma kita nayat.\n\nK. Taniki ani wabiskastotinis ostikwaniyik k'o astawat?\n\nN. Kitchi kiskeyitamik oma ka iji waskaminagwak wabiskastotinis; ekusi kita iji waskaminagusitjik kit atchekonowok, ki sikahatjikasuyaki.\n\nK. Taniki ani wassaskutenigan k'o miljimina-mohit ana ka sikahatat?\n\nN. Ewi kiskeyitamohit ekwayak e poni tibiskinak iskopimatisit, kita wi wasekwenaak e miyonanagataweyitak Jesusa ot ijilwawiniyiw.\nKitchitwa sokitchekaketominitowin.\nKiskinohamakewin XVI.\n\nK. Kekway ani eoko kitchitwawisokiteheskakewitominitowin?\n\nN. Eoko oma Kijemanito o nanatkwihuwjin peyak.\n\nK. Tanisi etabatjihikuyak kitchiwasokiteheskakewitominitowin?\n\nN. Ki miyikunow kilchi petjiy weskokoyak Meyosit-Manito o kijewatisisiwina kiki.\n\nK. Numetchi ki ki petjiyaweskakonow Meyosit-Manito ka ki sikahatjikasuyak?\n\nN. Atawiya, maka kitchitwawisokiteheskakewitominitowin miyihikawiyaki, ayiwak ki petchisakaskineska unow Meyosit-Manito o sakibitowin.\n\nK. Awena ka mekit kitchitwawisokiteheskakewitominitowin?\n\nN. Kilchi Ayamihewiyiniw.\n\nK. Tantaltwaw meyhituk kitchitwawisokiteheskakewitominitowin.\n\nN. Peyakwaw piko.\n\nK. Taniki ani peyakwaw piko ko miyhituk kitchitwawisokiteheskakewitominitowin?\n\nN. Eka wikkatche wi kasihikateyik ka iji kiskinow aljihitwaw iatto ka miyhitwaw kitchiawawisokiteheskakewitominitowin.\nK. Taniki ani osâm ka matchipimâtisitjik atî, atâ e ki miyâhtwaw kichitwawisokiteheskakewitominitowin?\n\nN. Ayîs! namawiya nanahitawewok Meyosiyî-Manitowa ka iji miyo sikimikutwaw.\n\nK. Tanisi ani ke totak awiyâk wa-miyâhtji kitchitwawisokiteheskakewitominitowin?\n\nN. Pitama kita wi kwayaskweyîtam Jesusa ot ijitwâwinîyiw; kita kanatatchâkwehîsuw; sekî kita nanagataweyîtam ka iji miyo totât; ispîch otehit kita iji ayamihaw:\n\nAyamihawin.\n\n\"Kijemanito, n'ota, ki tapwetatin, ni tapwe-wokeyîten mina kakiyâw ka ki iji kiskinohama-kawîyan. Kit atamiskatin, Meyosiyân-Manitô, ki ndaweylimîtin kitchi petjiyâweskawîyan; kitchi sakaskineskakuyân ki sakihîtowin. Ayiwâk e piweyitagusiyân, ka wi kitimakina-wiyan iji kijewâtisiyân; mitouî e kisinâteyi-tamân ka ki iji matchipimâtisiyân: ispîch ote-hiyân ki sakihîtin; pitane taki kano:kawi-yân; pitane otîtamân eta ka ki kispinatamâwit Jesus.\"\n\nK. Tanisi âni tolam kitchi Ayamihewiyîniw, kitchitwawisokiteheskakewitominitowin miye-kitji?\nN. Sowitchitsihestawew ostikwapiyik anihi ka miyhit, kisk ayamihestamowew; ekusi ayami-\nhewatikototawew, kisk e tominut oskatikoyik,\nekwa pasanawewesiw.\n\nK. Tanisi ani ekiniyik megwâch sowitchitsi-\nhestaket kitchi ayamihewiyiniw?\n\nN. Ekwayak petjiteheskakuyiwa ka Miyosiyit-\nManitowa.\n\nK. Taniki ani k'o ayamihewatikototawâl oska-\ntikoyik?\n\nN. Kitchi eka nepewisistamwâyit Jesusa ot ijit-\nwâwiniyiw.\n\nK. Taniki ani k'o pasanawewât?\n\nN. Kitâ wi sipeyitamiyit kitchi eka kisiwâ-\nsiyit meyitôlâmîtji, ekusi e ki iji kiskinowâtjisi-\nkiskamâkoyak Jesus-Krist.\n\nK. Tanisi ani ke totak awiyak, kitchitwawiso-\nkîteheskakewitominitowin ki miyhitji?\n\nN. Kitâ iyekatelew kita nauâskumât Kijema-\ntowa e ki kilimakinâkut, mitoni kita wi ayâti-\nnam ka ki iji miyotolât.\n\nAyamihewi-nândskomowin.\n\n\"Kit alamiskâtin, Meyosiyan-Manito, ki ma-\nmoyaweslâtin e ki kitimâkigawiyân, kitchit-\nwawisokîteheskakewitominitowin e ki miyika-\n\"wiyan ki mawimustatin kita wi miyogana\nweyiniyan kitchi eka sakotjitehemikuyan kek\nwily e muyatak Pitane itahjihuyan kijikok\nk'tchi otititan ni piyani.\"\n\nKISKINONAMAKEWIN XVII.\n\nK. Kekwiy coko ayamihewikasinamakewin?\nN. Kijemanito o nanatawihuwin k'otji kasina-\nmakuyak e ki sikahaljikasuyak mwestas metchitotamaki.\nK. Awena ani ka ki ojittat ayamihewikasinamakewin?\nN. Jesus-Krist ki ojittaw, ispi ka mamaltawihat ayamihewiyiniwa ekusi e itat: \"Awiyak\nkiyasinamdwayeku o matchi jtiwina, kita kassini-\nkateyiwa; eka kiyasinamdwayeku, namawiya\nkitat kassimikateyiwa?\"\nK. Tiniki ane wi iji mamaltawihat ayamihe-\nwiyiniwa ekusi e itat?\nN. Miyhew ekusi iji kakiyaw ayamihewiyiniwa\nkitchi kasinamdwayit witji ayisiyiniwawa met-\nchitotamiyitji.\nK. Tanisi ani ke tolak awiyak o matchi jti-\nwina kita kasinamuth?\nN. Kita nanagataweyimisuw, kita kesinâteyi-\nmisuw, namawiya kitâwiwâ ekusi ni ga itin, kita\niteyitam; kakiyaw o matchi-jiwiwâ kita âtjimus-\ntawew ayamihiweyiiniwa, kita kwatâkihiisuw.\n\nK. Tanisi ani ka wi ilwek: \"Kita nanagata-\n\"weyimisuw?\"\n\nN. Ekusi oma ka wi ilwek: kita mawâtjikis-\nkisiw ka ki iji matchilotak aspin e-otjit, apow\npiko iskwayâtch aspin ka ki kâsinâmât.\n\nK. Tanisi ke totamik, wi nanagataweyimisuki?\n\nN. Ka Miyosit-Manilo kita mawimustawaw\nkitchi kiskisohiwet matchi-ittiwina.\n\nK. Tanisi ani ke totamik kakiyaw kita mawat-\njikiskisk matchi-ittiwina?\n\nN. Kita mmîtoneyitaganîwao tanisi ka ki iji\npâstahuk mmîtoneyîteliîganik, pikiskiwewînk\nittiwinîk.\n\nK. Abatan tchi e miyonanagalaweîyîmisûk?\n\nN. Enh enh, nâspîch abatan; tchikema nama-\nwiya kita ki miyo-âtjîmîsûnaniwan, eka pitama\nayâtchi mawâtjîkiskisk ka ki iji matchîlitamîk.\n\nK. Tanisi ke-totamik piyoni nanagataweyimi-\nsuki?\n\nN. Ki tebi nanagataweyimisuki, kita kesinâte-\nyîmisûnaniwan ka ki iji pâstahuk,\n\nK. Taniki ani k'o kesinâteyitamîk ka ki iji\npâstahuk?\nAyamihewikassina'makewin.\nN. Osâm e kisiwâhit Kijemanîto tattwaw piyâs-tahuwitji, k'o kesinâteyilamik.\n\nTanisi ani ke iteyituk awiyak kesinâteyimisutji?\n\nN. Ekusi kita wi iteyiltam: \"namawiya kit-twâm ekusi ni ga itin, ni ga wi nisokamâk Kijemanîto matchi ittiwin kitchi pakwatamwok.\"\n\nK. Abatan tchi ka asutamawokeyitamik kitchi eka kittwâm pastahuk?\n\nN. Enh enh, naspîch âbatan; tchikema awiyak eka asutamawokeyituki kitchi eka kitlwâm pastahuk, namawiyu kita ki kasinamuth o matchi-ittiwinâ.\n\nK. Tanisi ani mina kitchi tolamik?\n\nN. Kitu n'dawi âtjimisunâniwan.\n\nK. Tanisi ani tolaganiwiw wa âtjimisuki?\n\nN. N'dawi otchikwanapista-waw ayamihewiyiniw; ayamihewâtikokaniwan: \"Ekwa saweyi-min, n'ota, e ki matchi pindâtissiyân;\" itwâniwan; ekwa mina ayamittâniwan ayamihâwin ka kitohitik, \"Nit âtjimisustawaw, &ct.\" isko ka pakamaskiganehusuk, ekusi ekwa mâlji âtjimisunâniwan.\n\nK. Kakiyaw tchi kita atotaganiwiwa matchi-ittiwinâ.\n\nN. Enh enh, mitoni kakiyaw kita atotaganiwiwa.\nK. Pa misipâstahunâniwan 'tchi otchitow kâtâk matchi-ittiwîn?\n\nN. Nâspitch misipâstahunaniwan matchi-ittiwîn ekâtâk.\n\nK. Tanisi ani ke itatotak awiyak omatchi-ittiwîna?\n\nN. Memutch' kita atotam. tàtlwaw ka ki iji matchitotak.\n\nK. Eka ki kâsinamât iskwayâtch ka ki âtji-misut, tanisi kita totâm. kittwâm n'dawi âtjimisutji?\n\nN. Kawi kita tepatotam iskwayâtch ka ki, atotak, kispin kutaka ayamihewiyiniwa âtjimisuslawâtji; eka e ki otchi kâsinamât.\n\nK. Tanisi ani ke totak piyoni atjimisutji?\n\nN. Piyoni âtjimisulji, nistwaw kita pakamas-kikanehusuw, kita kijiâyamittaw eokoyiw ayami-hâwin; mitoni kita wi nanagataweytam wawatch kita wi totam ayamihewiyiniwa tanisi itikutji, ekwa kita kesinâtchi-ayamihaw: \"Nâspitch m kakwatakeyimun,\" &ct.\" kita wi kwatakhihisuw.\n\nK. Tanisi kita ki iji kwatakhihisuw?\n\nN. Kita ayamihaw, kita iyewanisihisuw, kita wi kijewâtisitotâwew wetji ayisiyiniwa ka kitimâkisiyit.\nKiskinohamakewin XVIII.\n\nK. Kekwây ani kitchitwaw Eukaristiwin?\n\nN. Eoko oma Kijemanilo o nanatawihuwin mamawiyes e kitchitwayik; Jesus-Krist e misiweyât Eukaristiwiintk eji Manitowit, mina eji ayisiyiniwit.\n\nK. Awenâ ka ki ojittât Eukaristiwin?\n\nN. Wiya tibiyaw Jesus-Krist Eukaristiwin ki ojittaw.\n\nK. Tanisi ani ka totak Jesus-Krist Eukaristiwin e wi ojittât?\n\nN. Pakwejigan mina sominapûy e ki saweyit-tak, meskutsemultaw nayestaw wiyaw, o mik, ot atchâkwa, o kijemanitowiwin kitchi asteyik e ata keyâbitch pakwejigan mina sominapûy ejinamik.\n\nK. Taispi ani ka ki ojittât Jesus-Krist Eukaristiwin?\n\nN. Ki ojittaw iskwayatch ka witjimitjisumât o ayamihewiyinima, poskotibiskayik ka ki otitinit e wi nipahit.\n\nK. Taniki ami k'olchi ojittât Jesus-Krist kit-chitwaw Eukaristiwin?\n\nN. Ekusi e wi iji miyo asamikoyak ayiwâk kita sokisiyit kit atchâkunowa; wawatch taki kitchi ispayiyik o webinasuwin ka ki kiichipayi-\nyik ispi ka ki tchistahaskwâlit ayamihewâtikôk.\n\nK. Taneyikok ani ayamihewiyiniw wejittâl Eucharistiwin?\n\nN. Tattwaw Lamesse etwetji.\n\nK. Kekwây anima Lamesse ka itamik?\n\nN. Eoko oma kitchitwâwebinâsuwin Jesus-Krist kakiyaw otijiwiniw e mekit otawiya kitchi webinâsutatestamâkoyit ayamihewiyiniwa.\n\nK. Kekwây wetâwiwinit ayamihewiyiniw wi-yebinâsulji?\n\nN. Pakwejigan mina sominâpûy otawiwiniw, e meskulsemullâl Jesusa wiyowiyiw mina o mikuyiw kila ojittâl.\n\nK. Tanisi ani kitchi totakwaw ayamihewikamikôk ka apitwaw Lamesse etwewitji?\n\nN. Kijemanitowa kila pakitinamâwewok wiyoowiwa, ot atchâkowawa wrwâtch wiya piko kila mamitoneyimewok.\n\nK. Awenihi ka ayamihestamowât ayamihewiyiniw Lamesse etwelji?\n\nN. Tatto ka kwayask ayamihâyit waskit-aska-mik mina okusinamâkewiskutek ka ayâyit ayamihestamowew.\n\nK. Taniki ani k'o manitokâlamik kitchitwaw Eukaristiwin?\n\nN. Jesus-Krist e misiweskâl Eukaristinik k'o manitekâlamik.\nKitchitwa webinṣowin Lamesse ka itamik.\nK. Jesus tchi wiyow nayestaw ka asteyik pakwejiganik ka ijinamik?\nN. Wiyow, o mik, misiwe ot ijiwin asteyiw.\nK. O mik tchi nayestaw ka asteyik sominôpôk ka ijinamik?\nN. O mik, wiyow, misiwe ot ijiwin mina asteyiw.\nK. Nâspitch tchi kitchi tapwewokeyimit Jesus-Krist Eukaristiwinik?\nN. Enh enh, nâspitch mitehik kitchi tapwewokeyimit Jesus Eukaristiwinik: namawiya kwayask pa ijitwaw awiyak eka ekusi jji tapwewokeyitaki.\nK. Kekwây ani wetinamik eyamihewisasmuki?\nN. Jesus-Krist otinaw jji Manitowit, mina jji ayisiyiniwit: wiya ka jji misiwcayawihut.\nK. Nâspitch tchi ki miyototâkonow Jesus-Krist e petchitêheskakoyak siyâskamuhikawiyaki?\nN. Enh enh nâspitch ki miyototâkonow e sokiteheshakakoyak kita miyopimâtisiyak, e musitawinamuhikoyak kijikôk kitchi juteewayak nipiyaki.\nK. Tanisi ke totagik kitchi miyo saskamuhituk?\nN. Kita nanagalaweyimjsunûnjwan ekakekway e mayâtak mitehik kitchi kanaweyitâmik, kita\nkesinâteyimisunâniwan, mitoni kita âljimisunâniwan, kita tâpwewokeyimaw Jesus-Krist Eukaristiwinik, kita musitawinâganîwan kitchi saskamuk?\n\nK. Tanisi ani mina kitchi lotamik wa saskamuki?\n\nN. Wa saskamuki, kanâljihunâniwan, wawâtch namawiva ki mitjisunâniwan aspin e âbitaw tibiskâk mayowes saskamuki?\n\nK. Tanisi ani ke mamitoneyitak awiyak wa saskamuhitji?\n\nN. Ispitch otehit kita tâpwewokeyimew Jesus-Krista Eukaristiwinik, kita mamaskâteyitam espitch kijewâtisiyiit, espitch kitchitwâweyitâgnisiyit âtchi kita wi sakihew.\n\nK. Nâspitch tehi kita matchitolam awiyak kakayesisaskamut?\n\nN. Enh enh, nâspitch kita matchitolam, e wiya-kitowât Jesusa wiyo-wi-yiw, soki kisiwahew Kijemanitowa, takine kita kisisuw eka kesinâteyitaki.\n\nK. Awena ana ka kakayesisaskamut?\n\nN. Kakayesisaskamuw ana ka kakayesi-âljimisut, eka mina e-kesinâteyitak e ki pâstahut.\nKISKINOHAMAKEWIN XIX.\n\nK. Kekwây ani iskwayâtch ayamihewitomini-\ntowin?\n\nN. Eoko oma iskwayâtch ayamibewinanatâ-\nwihuwin ka miyhit awiyak wa kitimâkisitji?\n\nK. Tanisi ani etâbatjihikuyâk iskwayâtch ay-\namihewinanatâwihuwin?\n\nN. Kakiyaw ki matchi ittiwinisinowa ki kâssi-\nhamâkunow; Kijemanito o sâkihitowin ki miy-\nhikunow; ki sokatchâkwebikunow matchi-Mani-\nto kitchi eka sâkotchihihikoyak.\n\nK. Taniki ani ayamihewiviniw k'o ayamihe-\nwitominiwet miskijikôk, mitawâkâk, miskiwa-\nnik, ma yakaskitchitsânîk, mitonîk, mâskiganîk,\nunisîtîk mitchitjîk mina?\n\nN. Ayamihewitominiwew eta k'otchipayiyik\npâstahuwin; kisik e mawimustawât Kijemanito-\nwa kita wi kâssinamâkeyit tattwayak ka iji pâs-\ntahuwit.\n\nK. Peyakwâw tchi piko kita iswâyâtch ayami-\nhewitominaw awiyak?\n\nN. Miskawi kâwi iyiniwitji, kittwâm âkusî pa\ntotawâw, kittwâm âkusitji.\n\nK. Kekwây ani ayamihewiyiniwijihituwin?\n\nN. Eoko oma ka miyhit ana ka wi ayamihewi-\nAyamihewiskweyatch tominitowin.\nyiniwibii, Kije-manitowa aniskâtch kitchi atuskawât.\n\nK. Tanisi ka ki iji mamâławihâl Kijemanito ayamihewiyiniwa?\n\nN. Ki iji mamatawihew ot itasigewina misiwe kitchi kiskeyittamohiweyit, kitchi kâsinamowâyit witjiayisiyiniyiwa o matchi ittiwiniyiwawa, misiwe kitchi iji miyototawâyit mina kitchi Lamesse iteweyit.\n\nK. Kekwây ani ayamihewiwiktitowin?\n\nN. Eoko oma ayamihewinanatâwihuwin ka miyhitwaw ka kitchi wikitahitwaw kitchi sakihîtutwaw, kitchi nitta opikihâtwaw ot awâsimisiswawa eyawâtâwâwi.\n\nK. Awena wekitahâl'otayamitchikewa?\n\nN. Ayamihewiyiniwok ka kitchiwikitanâljik.\n\nK. Tanisi ani kitchi totakwaw ka wi kitchi wikitahitwaw?\n\nN. Kita wi kesinâteyimisuwok, mitoni kita kitimisuwok kitchi kanâtschakwehsutjik, ekusi iji piko kitchi kitimakeyimikowisitjik.\n\nK. Pa ki paskewihituwok tchi, ka ki kitchi wikitahitwaw?\n\nN. Namawiya kitchi paskewihitutwaw; misawatch ata paskewihitutwâwi; nama kulaka kita ki wikimewok.\nAyamihewi-ijihitowin. Kitchi ayamihewiyiniw nyi miheyiniw hew awiya.\nKiskinohamakewin XX.\n\nK. Kekwāy anj pāstahuwin?\nN. Łka e totamik Kijemanito ka iji miyosiki-miwe; apow e totamik ka iji kituhumākel, eoko oma pāstahuwin.\n\nK. Tanetatikwa pāpiskitsi pāstahuwina?\nN. Nijinwa pāpiskitsi pāstahuwina; pāstahuwin ka pe kiki nittawikik, mina seke ka iji pāstahuk.\n\nK. Kakiyaw tchi tābiskotch ispīteyiłākwanwa seke pāstahuwina?\nN. Namawiyā tābiskotch ispīteyiłākwanwa seke pāstahuwina, mistahi pāstahuwina mina pāstahuwinisa ayāwo.\n\nK. Nāspitch tchi kitimāhisow awiyak mistahi piyāstahutji?\nN. Enh enh, nāspitch kitimāhisow, e miyhisut Kijemanitowa takine kitchi pakwātikot, wawatch matchi Manitowa kitchi kisisuhikut.\n\nK. Piko e pāstahusik, misiwe tchi wanittawān Kijemanito o sākihitowin?\nN. Piko e pāstahusik, namawiyā atawiya misiwe wanittawān Kijemanito o sākihitowin; inaka keyiwek kita nanakataweyitagāniwan kitchi eka apow pāstahusik, Kijemanito iyepilne e pakwātak nanatok ka iji pāstahuwit.\nAyamihewikitchiwikiłowin.\nK. Pa ki totakaniwan tchi kitchi eka pastahuk Kijemanito eka nisokamaketji?\nN. Namawiya kitchi ki totamik; iasipwa Kije-Manito taki e mawinustat kita wi nisokamaket kitchi eka pastahuwit.\n\nK. Tanetatikwa mistahi pastahuwina?\nN. Tepakop itatinwa, mititisjwin, sasakisjwin, pisikwatisiwin, sawanakeyimuwin, kajakewin, kisiwasiwin, kittimiwin.\n\nK. Taniki ani ayiwak mistahi pastahuwina k'o iji itatiki anih?\nN. Ayiwak mistahi pastahuwina k'o iji itatiki, eokoni otehi e otchipayikwaw nanatok pastahuwina.\n\nKiskinoramakekewin XXI.\n\nK. Kekwiy ani mamitisjwin?\nN. E osimayiwakeyimuk k'o mayeyimitwaw, wawatch k'o piweyimitwaw kutakak, eoko oma mamitisjwin.\n\nK. Mistahi tchi pastahuw awiyak e mamitisit?\nN. Enh enh, mitchetweyak iji mistahi pastahuw awiyak e ayiwakeyimut, e piweyimuskit, e kisteyimut, e matchikastet, e wisaketsakokasut,\ne sasibitaskit; ekusi e ki iji pastahutwaw okijikowok atit k'o matchi manitowitjik.\n\nK. Kekway ani sasakisiwin?\n\nN. Osam e sakittak kakiyaw kekway, weyotisiwin e akawatamik, eoko oma sasakisiwin.\n\nK. Tanisi ani eji pastahut awiyak e sasakisit?\n\nN. Awiyak matchi sasakisiw eka e sakweyimukita kiyasket mina kitchi kakayesinahiket osam e note wiyojisit: paskatch Kijemanitowa ka wani-kiskisitotawat osam e otamikispinaljiket, e ata kiskeyimat witji ayisiyiniwa ekwelamayit, eka e kitimakinawat, e kimodiskit, wawatch e nitta aspihiwet.\n\nK. Kekway ani pisikwatisiwin?\n\nN. Eoko peyak mistahi pastahuwin tchikemana spitchi pakwatiwan eoko awiyak e pisikwatiimitoneyittak mina c ntaweyittak ekusi kitchi totak wawatch ekusi e tolawat witji ayisiyiniwa mislahi pastahuw, mina awiyak ka pisikwatiitnamut ekusi ayiwak pastaliuw.\n\nK. Naspitch tchi mistahi pastahuwin pisikwatisiwin?\n\nN. Enh enh, mistahi pastahuwin, pisikwatisiwin tusipwa peyakwaw Kijemanito e ki metchinistapaweyat ayisiyiniwa e pisikwatisiyit, mina aslam ispi e ki metchikasak niyanan otenawa, osam e pisikwatisiyit ekute ka olaskiyit.\nK. Kekwiiy ani sawanakeyimuwin?\nN. E kaskeyitamik apow e kisiwâsik wiyaabamitji awiyak e kisteyimit, e kitimakeyimigowisit apow; eoko oma sawanakeyimuwin.\n\nK. Peyakwaniyiw tchi ka sawanakeyimuskit o matchi ittiwin?\nN. Namawiyap eyakwaniyiw, niywâk mitcheniyiwa ka sawanakeyimuskit o matchi ittiwina; e nittâ matchi ayimomât, e piweyimât witji ayisiyiniwa; wawâch e miyweyitak metchi ayimomitji, peweyimimitji, osâm e ataminat metchi nakiskamâsuyijji, e piweyitamwât ot itâtjihuwiniyiw ata eka e mayâtaniyik.\n\nK. Kekwây ani kajakewin?\nN. Osâm e mistahi mitjisuk, mina osâm e mistahi minikwek; eoko oma kajakewin?\n\nK. Mistahi tchi matchitoltam awiyak e kajaket?\nN. Enhenh, mistahi matchitoltam ka akameyimitjisut ata sâsây e kilîispût; maka osâm e matchitoltam ka wikipet, iyepine e pakwâtak Kimanîlo kihiskwebewin.\n\nK. Kekwây ani kisiwâsiwin?\nN. Mitehîk sisikutch e matchimâmitoneyittamopayîk kitchi abehuk, eoko oma kisiwâsiwin.\n\nK. Matchi totakâniwan tchi ka kisiwâsik?\nN. Enhenh, matchi totakâniwan ka kisiwâ-\nsik, e mamatchipikiskwek, e nanotinikek, e nipattakek.\n\nK. Kekwâyi ani kittimiwin?\n\nN. Osâm e pakwatamik atuskewin, eoko oma kittimiwin.\n\nCONCLUSION.\n\nE wi ponipayik oma ayamihiwimasinahigan.\n\nK. Matchi-ittiwin e pakwatamik, ekuyikok tchi kwayask kitchi itâjihuk?\n\nN. Atawiya iyepine' kitchi pakwatamik matchi-ittiwin, kwayask ka wi itâtjihuk; maka mina misiwe ka iji miyototamik kita wi totakâniwan.\n\nK. Tanisi ani iji ayiwâk ka miyototakâniwik.\n\nN. Ayiwâk miyo totakâniwan e ayamibâk, e kihikusimuhisûk, e kijewâtisik; ekusi e ki itwet Jesus-Krist:\n\n1o Kitimâkeyitâkusiw awiyak e ata kwetamât, keyiwek e miyweyitak ekusi e ileyînikowisit.\n\n2o Kitimâkeyitâgusiw awiyak e miyôtehit eka kâ wi kisiwâsit, e ala mayitolât.\n\n3o Kitimâkeyitâgusiw awiyak ekesinâteyitak e ki matchitotak, Kijemanitowa e ki kisiwâshât.\n\n4o Kitimâkeyitâkusiw awiyak eka wikkâtch e kakwetchisihât witji ayisiyiniwa, wawâtch e miyonanagataweyitak Kijemanitowa ka iji miyosikimikut.\n5o Kitimakeyitakusiw awiyak e nittakitimakinawat witjiayisiyiwiwa ketimakisiyitji.\n\n6. Kitimakeyitakusiw awiyak e kanatjipimatistit, e pakwatak pisikwatisiwin, pisikwatchimitoneyitjigan, pisikwatchikijiwewin.\n\n7o Kitimakeyitagusiw awiyak eka e kisiwasiškit.\n\n8o Kitimakeyitagusiw awiyak pikwanata kwetakimitji, mina peweyimilji.\n\nAD MAJOREM DEI GLORIAM.\n\nKitchitwa Joseph ayamihestamawinan kitchimiyonipiyan.\n1re INSTRUCTION.\n\nDE LA FOI.\n\n(Ayamihewitâpwewokeyittamowin)\n\nSine fide impossible est placere Deo.\n(Heb. II.)\n\nÉka ayamihewitâpwewokeyittamuth namawiya kita ki atamihaw Kijemanito.\n\nN’t’awâssimissitik….. Ayamihewitâpwewokeyittamowinik otchî atchâk wasaskutenamâkowi-siw, wâwâtch tawinamâwaw pimâtisiwin, kitchipayîttoawaw kwayaskâtisiwin, ojitamâwaw pikko-huwin, tâsipwa k’etwet St. Paul : eka etłakukwe eoko, namawiya kita, ki miskawaw Kijemanito, nama kita ki kàkisimototawaw, mina nama kita ki atuskawaw; eokotchi anotch k’o wi-miyika-\nwiyek kiskinohamatuwina nistam Ayamihewitapwewokeyittamowinik otchi; ayiwak mina kweyaskweyittamuk ka tattweyukittik Ayamihewitapwewokeyittamowin. Mina Ayamihewinanatawhuwina ki ka mamiskotamakawindawaw; tchikema Ayamihewitapwewokeyittamowinik otchi k'otchipayiki eokoni, e ki ojitjikateki ojitaw tchi otchikkamakemakaki yakkes kita wi-tapwokeyittakaniwik.\n\nAyamihewitapwewokeyittamowin k'etwek, N'tawassimissitik, eoko ani Kijemanito omekewin, mina eoko ki'skeyittamohikowisiwin, k'o tapwewokeyimit Kijemanito wawatch k'o tapwewokeyittamuth ot itwewin, mina ka ki mammattawiwittamaket katolik-ijittwawinik, mina k'ejipakitinamakawiyak kitchi tapwewokeyittamik.\n\nAyamihewitapwewokeyittamowin, eoko Kijemanito omekiwin, itwaniw: tchikema kiyanow tibiyawe namawiya ki ka ki kaskittamasanow eoko iyinisiiwin otchi mina mitoneyitchigan, namawiya kita ki otchi miskakaniiwiw; anisikis piko kitchi mekit Kijemanito. Tasipwa k'o itwet Jesus-Krist \"nama awiyak ni ki pe-natik eka \"nottawiy, ka ki pe-ijitisahut, wisakkawatji.\" (St. Jean, 4), omisi itwew mina St. Paul: \"ntaka eki miyikowisiyek k'o ki tapwewokeyimayek Jesus-Krist.\" (Philip 1.)\nAyamihewitapwewokeyittamowin kiskeyittamohikowisiwin ijihikatew, tchikema e ki kijikana-makuyak kitchi nissitaweweyittamak kijikowimeskanaw, ka ki wittamakoyak Kijemanito, \"ka ki wisamikoyek wanitibiskanok otchi, tchi itutahitek ite ka mamattawiwassseyayik.\" (1 Pierre 2.)\n\nK'o tapwewokeyimit Kijemanito mina itwaniw; tchikema mitoni e tapwcwiniwik mina e ketchinhuk e ittat Kijemanito, naspitchi e mamisitolawayak: wawatch'k'o tapwewokeyittamuth ot itwe-win, Kijemanito oti kaki wittamawat ayisiyiniwa katolik-ijittwawinrik otchi. Eoko-katolik-ijittwawin namayiya kita ki kiyaskimagan e otchik-kamatak Kijemanito ka ki itwet: \"Isko ponii-askiwiki, takki ki ka witjetinawaw.\n\nEka otayamihewitapwewokeyittamowinit awiyak, namawiya kita ki kwayaskilatjihikowisiw, ekusi anisikis nama tchi pikkohut kitchi-kijikok. Omisi itwew St Paul: \"Eka ayamihewitapwewokeyittamik, nama kita ki atamihaw Kijemanito; tchikema kitchi natil Kijemanito, pila kitchi tapwewokeyimit e miyo-tipahamawat anibi nen-donakut.\" (Heb. II.) Jesus Krist ekusi itwew Miyowatjimasinahiganik: \"Awiyak eka tiyapwokeyittaki, sasay wiyasuwataw.\" (St. Jean, 3.) Ekwa ki wi-wittamalinawaw tantatto kekwaya kita ayamihewitapwewokeyittamik kitchi-kijikok tchi pikkohuk.\nNijweyaganiyiwa eokoni kitchi kiskeyittak awiyak; atit otjitaw piko tchi pakaski-kiskeyittak, eka pitus kita pikkohuk, atit maka ata pawine piko kiskeyittaki awiyak, eyiwek kita ki pikko-huw, kispin oti eka otjitaw eka e wi-kiskeyittak. Anihi nistam kekwaya, ka ki itamân eji sokkipaviwa, pâskatch eka kita pikkohuk, kispin eka kiskeyitchikâteki, kitchi tapwewokeyittamik. Eokoni osâm: Kijemanito e ittât, kita miyotipabamâwew kijikok awiya e ki sakihikut wasketaskamik, mina e ki atuskâkut, ekusi meskutch kita kwatakihew awiya eka e ki wi-tapwettâkut; wa-wâtch Kijemanito e peyakut ata e nistweyakihut, Weyottâwimit, mina Wekosisisimit, mina Meyosit-Manito; Jesus-Christ, Tebeyimikoyak, ka peyakokosissimikut Kijemanitowa, ka iyaskowit Kijemanitowinik, eki wiyâwihisut mina e ki ayisiyiniwihisut tchi pikkohât ayisiyiniwa. Wawatch eyabitch kitchi mitoni kiskeyittamik atchâk kâ-kike kita pimâtisit, mina pastâhuwin e ittakuk ka pe-kiki-nittâwikik. Kutaka maka kekwaya e ata eka nissitaweyittak awiyak eyiwek kita ki pikkohuw, kispin oti nama wi-kiskeyittam, tebi-yâk pakkwanow tapwewokeyittak. Eokoni ohî: nistam kitchi-ayamihewiyiniwok ot iji-tapwewokeyittamowiniwaw, ayamihewinanatâwihuwinâ, Kijemanito otitasowewina, ayamihewitasowewi-\nna. Kispin awiyak eka e wi-kakwe-kiskeyittak eokoni, o kittimiwin otchi, appo eka e tchikeyittak, mistahi patahaw. Eokonik ayisiyiniwok k'o eka kiskeyittakik otayumihawiniwaw, tchikema eka ewi-kiskinohamakusitjik. Eokotchi kispin ekusi jji nipitwawi, eka pita kesinuteytakwawi, nama kita wabamewok Kijemanitowa.\n\nKiyawaw wetawassimissiyek, ki pattenaawaw tchi, eyigok mana piyastahuyek, atil eka ka pisiskeyittamek, kita kiskinohamawekwaw kitawassimissiwawok appo nando kita kiskinohamakusitjik? K'otehinawaw tchi eka kokijewatatisiwiiniyek eka mana ka kaskeyittamek, kiyipa kitawassimissiwawok kitchi nissitaweyittakik tatto kekwaya ka n'taweyittamakutjik Kijemanitowa, tchipewwokeyittakik? Kanika kwayask ot itwa anah peyak nistam kitchi-ayamihewiyiniw: \"Kispin awiyak eka pisiskeyimajji otiyiniina tabisotch e assenak ayamihewitapwewokeyittamowin mina paskiyiwew kawotayamihawa.\" (1 Tim., 5.)\n\nAyamihewitapwewokeyittamowin ota mistahi ka n'taweyitchikatek tchi pikkohuk, namawiya pa tebipayiw, wawatch nama pa Abatan, kispin eka asitjipayiki miyototamowina. Ekusi itwemagan Manitowisinahigan: \"Tanisi ketabatjibikut ayisiyiniw kitchi tapwe kiskeyittak, kispin eka\n\"Kwayask tiyotaki? kita ki pimâljihikw tehi\n\"nayestaw tapwewokeyittamowin?\" Keji nipu-\nwâlan mâna miyaw, kispin atchâk sâsây e nakâ-\nlasket, mwetchi ekusi ijinâkwântapwewokeyit-\nmowin, kispin eka witjellumagaki tabiskotch\nmiyo-totamowina. K'alehi itwet St. Paul: \"Na-\n\"mawiya aniki nayestaw ka nandottakik mani-\n\"towiyasuwevin ke otinikowisitjik, maka ke -\n\"china cokonik piko kisik ka totakik.\" Namâ-\nwiya piko e itwek ka kwayaskopâyik, makukis.k\nka totanik. Ayiwâk ki tapweittaw eko Kijem:\nnitowokosissân e itwet: Tatlo ka ijitwaw mâna:\n\"Tebeyitchikeyan, Tebeyitch keyan, namuwîya\n\"kukiyaw kita pittukewâk Kijikowolendwewi-\n\"nik, mak i aniki piko ka totakwaw n'ollawiyâ\n\"ot iteyittamowiniyu.\" (7 Math.) Tapwe tchî-\nkâni, n'tawâssimissilik, eka kitchi abatjihisk\nkispin nayestaw tiyâpwewokeyittamiki Ayamiha-\nwin, ekusi eka tiyotam.ki. Tchikema e miyotc-\ntamik k'o pimâtak tapwewokeyittamowin. Mani-\ntowiskihiwewinik otchi n'taka k'o abatak ayâ-\nmihewitâpwewokeyittamowin. Eka siyâkihit Kij-\nmunito pikonatu tapwewokeyitlamwântot Ayami-\nhâwin. Ekusi mwetchi k'etakkamikisiljik Matchi-\nManitowok, atâ tapwewokeyittamwok e ittâyi:\nKijemanitowa ekusi eyiwek naspitchi webinikc-\nwisiwok.\nPisiskeyittamuk, n'tawàssimissitik, ekawiya m'ana tebeeyittamàsuk e'otchi kiskeyittamek Ayamihàwin, e tàpwewokeyittamek ata, asitji otinamuk miyopimàtisiwin. Ekawiya paskestàk eokoni nijo kekwaya, Ayamihewitàpwewokeyittamowin mina miyo-pimàtisiwin. Ekawiya ki ka witàtljhunàwaw tàbiskotch atit, ni tàpwewokeyimaw Kijemanìto, \"k'etwetjìk, ekusi ototamowiniwàwà 'wàk otchi assenewok.\" (Tit. 1.) Ka iji-n'taweyittamàkoyak Kijemanìto ayamihèwitàpwewokeyittathowinik kakwe totamowàtàk. Espitchotehiyak tàpwewokeyittattàk k'etikoyak Tebeyimiwet mina k'èji sikkimikuwayak catholik ijittwàwin. Soàkkastwàtàk tchi ayàtinamak eoko, appo wiotchinatikawiyak, kisik akameyimotàn takki kita itàtljhuyak k'ejitàpwewokeyittamak. Pitane maka miyikowisiyak mosis kitchi kanàwàbattamak tcheskwà kitchi-kijikok pawine piko ki wàbattamak waskitaskamik. P. E. I.\n2° INSTRUCTION.\n\nET EN JÉSUS-CHRIST, ETC.\n\n(Mina J. C. Kijemanitowa ka peyakokosissimikut)\n\nVocatum est nomen Jesus.\n\n(S Luc 2.)\n\nJesus ki ijihikdsuw.\n\nN'tawàssimissitik... anolch kitchi kwayaskwèyittamak tanekì, mina J. C. kijemanitowà ka peyakokosissimikut, k'o ilwek ayamihewitapwewokeyittainowinik. Pita kitchi miskawàsùmitakuk tanisi ka ki ikkiniyik oyekka nistam nijo ayisiyiniwok ka ki pastàhutjik, miyonòk ka ki pakitinkowisitjik, ekusi e ki wanitlwàsuljik eoko kakiyay miyo-ayàwin, e anwettawàtjik wejihikutwaw. E ki ojihikutjik Kijemanitowa kita naspitawàtjik, mistahi ki miyo-atchàkwewòk nisokkamàkowisiwin mina'kanàljihuwin e kikiskakik. Kitchi-iyinisìwin kitchi otchi kwayask omàmitoneyitchiganitjik o miyikowisìltàwaw.\n\nNamawìya kitchi-wàbatlakik àkkusìwìna, ayimisiwìna, nanekkàlìsiwìna, ki iji-pakilinamàkowisiwòk semàk. Ki asolamàkowisiwòk eka kita nipitjik wikkàtch, piyìs ekusi iji kitchi wàbamàt-\njik soskwâch Kijemanitowa kitchi-kijikok. Mina o iniskosâniwâwa kakiyaw ayisiyiniwa ekusi iji ki aspi-asotamâwâwok. Ata e, iji-miyomiyiko-wisitjik nistum kit otemibananinowok eyiwek o ti-beyittamâsuttawaw ot iteyitchiganiwaw. O kas-kittâlâwaw tânimâyu e wi-otinakik, mewâsiniyîk appo meyâtuniyik. Ki wi-kuteyîmikwok Kijemanitowa. Anima miyo-nittâwîwikitchiganik ite ka ka ki pakîlinikutwaw, ki miyikwok tchi mitjitjik k kkiyaw olchi mistikwâ e minissiwiyît, peyak pîko ki kitahamâkwok eka tchi sâminakik; eokoni mislikwâ ki ijihikâsuyiwa: \"Mistik k'o kiskeyittamik miyowâlisiwin mina matchâti-siwin\"\n\nMatchi-manito, eoko peyak okijikow ka ki matçhustewebinikut Kijemanitowa, ekî wayesi-kinebikkohut pekutchimew nistam iskwewa, piyis sakotchimew tchi kaskimat tchi mitjiyit ka ki kilâhamâkuyit Kijemanitowa. Pâskatch e iji-wayesimât, \"Kiyâm mitjik, matjikulîtan semâk\" tabiskôtch Kijemanito ki ka ijinâkusinâwaw, \"namawiya missawâtch ki kakilîmahisunâwaw.\"\n\nEve nikân tapwettawew Matchi-manitowa, e mitjit, ekusi n'tawi-asamew onâbema nista ka mitjiyit. Mayo e ki iji-totakik, ekweyâk ileyt-tâkwântokkâbiwok, e nissitaweyiltakik e-moses-katetjik. Ekwa nanabawi sekisiwok, e ki sâsibitta-\nswajiko tibeyimiwemiwaw,ka ki ijimiyotolakntjik. Semâk maka mistahi ki mâkohikwok, e kiputisahukutjik. Merkutch ekwa miyikowisiwok kakiyaw ayinisisiwina, kwatakittâwina, piyis tchi nipiljik, wâwâch eka wikkâch kita wâbamâtjik Kijemanitowa, iji wiyasuwâtikowisiwok, kanakeka e asoskamâkoyakik eokoyu o kwatakipâstâhuwininiwaw.\n\nTâpwe, n't'awâssimissitik, ki ki kitimahikawitânaw ekuspi! Tâpwe mistahi ki pikwakamikisiwok nistam ki nikihikonobaninowok e ijkâstâhikoyakik. Ekute k'otchipayik eoko k'elweskik mâna: pâstâhuwin ka-pe-kiki-nittâwikik. Ekuspi otchi kakiyaw pe-kiki-nittâwikinâniwiw eoko pâstâhuwin. Eokotchi ekwa k'o nittâ-sâkotchribi-wet Malchi-manito, eokotchi k'o kitimâkisik nisîwe waskitaskamik, k'o pakwâtitûk, k'o notinituk, k'o wayeskanisik, piyis k'o nipinâniwik. Eokotchi kweyâtji k'o pe-nittâwikik pâstâhuwinik.\n\nTâpwe kesinâtakkamikan ki mayipayiw ekuspi, nijo ayisiyiniwok kilchi iji misiwanâttchittwâketjik! k'o itwemakak manitowimasinahigan: \"Peyak ayisiyiniw otchi pâstâhuwin ki pittukepayiw waskitaskamik, asitji nipowio, ekusi kakiyaw ayisiyiniwok ki otittikuwok nipuwin,\"\n\"ekî pastahikutwaw eokoni nistam ayisiyiniwa?\" (Rom. 5.)\n\nMaka kejewâtisît Manilo namawiya nâspitchi ki wi-webjinew ketimâkisisiyit ayisiyiniwa. Ki kitimâkinawew ekusi semâk ki wi-ânisihew. Pimâtisiwin atchîyâw'ka ki wanittwâkoyakik nistam kit otemibanimowok, ki ki wi-misahamâkonow Kijemanito. Ki miskwêyittam o kijewâlisiwinik, kitchi iji-pik'kolhikoyak. Awena ke iteyittak eokoyu? \"Kije-manîto ki iji-sâkihew ayisiyiniwa pâskatch e ki mekit o peyakossâna\" (S. Jean 3). Etchikâni J. C. o nipustamâkewin otchi n'taka eyâbitch k'otawâssimissimikoyak Kijemanito. J. C. ki atâwew kiyâwinôwa, meskutch e pâkitinak o pimâtisiwin, ki ki tipahestamâkonow ka ki masinahikewâyak eoko pastâhuwin ka-pe kiki-nittâwikik, eka wikkâtch kitchi ki tebitipaha mâmayâk ottâwiya.\n\nMîna (ni tâpwewôkeyimaw) Jésus-Christ, Kijemanitowa ka peyakokosissimikut, Tebeyimikoyak, etc., itwâniwan, ayamihewitâpwewokeyiftamowinik, ekwa niywaw e paskittowek. Kijemanitowekosissimit ka ki pe-wiyâwihişût, Jésus-Christ ijihikâsuw. Jésus eoko owiyowiw, ekûsi Christ, k'etwek, eoko ot aspikâsuwin. Eoko pikiskwe-win Jésus, Pemâtjihiwet, e wi itwek, tchikema e ki pe-pimâtjihût ayisiyiniwa, ka, wi-otinikuyit Matçhi-manitôwa. Ki atâwestamâkew pimâtisiwin.\nOkijikow Gabriel, omisi ki etew kitchitwa Mariwa, ispi ka ki pe-atamiskawâl: \"Ekwa ki ka ayâwaw, mina ki ka nittâwikihaw wekosissiyan, ekusi \"Jésus ki ka ijihikâlaw.\" (Luc 1.)\n\nMina kitwâm e ayamihât kitchitwa Josepha, omisi ki itew: \"Ekusi kita ijihikâsuw, tchikema \"kita pikkohew ot iyinima o pastâhuwiiniyiwa otchi.\" (Math. 4.)\n\nEoko mamawies, kitchi wiyowin misiwe. Mayâ wetjikâteki eoko wiyowin Jésus, semâk kakiyaw kotjikwanipayihustamik, kijikok, waskitaskamik, mina kitchi-iskutek. Eoko wiyowin mistahi miweyittâkwan, e pimâtisiwiniwik. Nâspitch kitchitwâweyittâkwan, eokotchi k'o nawokiskweyistamik wellamiki mâna.\n\nWiya maka kutak piki-kwewin, Christ ka itamik, e ki aspihikâsut Kijemanitowokosissân, omisi kitchi ijiwittamik: Christ, itaw; tchikema mistahi e okimâweyittâkusit, wiya ka tibeyittak kakiyaw okitmâwiwina, eji-Kijemanito-ayisiyiniwit. Mina Christ itaw, e okitchi niyânk-kiskeyittamohikowisit, wâwâch e ki miyikowisit kita nikân kitchi-ayamihewiyiniwit. Tâpwe J.-C., ki kitchi-ayamihewiyiniwiw, e ki ayamihestamâwât ayisiyiniwiw e aspi-kâkisimot, o pimâtisiwin e mekit ayamihewâtikok. Ki okitchi niyânk-kiskeyittamohikowisiw niyânk e ki wittak tânisi\nke ayikkiniyik. Ki kitchi okimâwiw, e ki miyi-\nkut otâwiya iyawis tibeyimiwewin kijikok mina\nwaskitaskamik. Eji kijemanitêwit J.-C. otîtaw\nkitchi okimâwiw, mina eji ayisiyiniwit missa-\nwâch kitchi okimâwiw, e ki pe-nandopayistawât\nMatchi-manitowa, eki miwehât mina e ki maška-\nmât o libeyitchikewiniyu. K’etwek, ekuta k’o as-\npihikâsuyak, Chrétiens (otayamihâwok), ka itika-\nwiyak.\n\nN’tâwâssimissitik, Jésus, kitchitwa wiyowin,\neoko kitchi o mamisiwiniyak, mina kitchi o mâ-\nmâllâkusiwiniyak.—Jésus, etweyaki, Kijemanito\nokosissân, ki wiyanow, mina ki libeyimiwemi-\nnow, ki pimatjihiweminow. Tchikejma namatew\npitus awiyak kitchi pimatjihikoyak, tchikejma\nnamatakun pitus wiyowin waskitaskamik kitchi\notchippikkohuk (Act. 4.) Eoko ki Pimatjihiwemi-\nnow, ka ki miyikowisiyak, nâspitchi kijewâtisiw,\nmistahi e n’taweyittak tchi pikkohipoyak. Ka-\nkiyaw n’taweyimeu ayisiyiniwa tehi pikkohipoyit.\n(1 Tim. 2.) Eokotchi kitchi ki itweyak : “ J.-C.\n“ ni gi sakihik, mina ni gi nipustamâk.”\n(Galat. 2.)\n\nSâkihatâk J.-C., wiya nikân e ki sakihikoyak;\nekawiya wikkâch sakittawâtân kekwây piko\nk’ei-jî n’taweyittamâkoyak. Nanâskumâtân ka ki\nâbatjihikoyak, mayanok e ki otchi pesikoyak\nmiyo-pimatisiwinik-iji. Pitune kiyawaw ka witjewaganikkakoyek Jesus, eka wikkâtch nepewisistawâyek, maka âji sâkihâyek, piyis, ki tebituskwâwayeku waskituskamik, wâbamâyek kitchi kijikok. P. E. I.\n\n3me INSTRUCTION.\n\nLA SAINTE ÉGLISE CATHOLIQUE.\n\n(Kitchitwaw L'Eglise Catholik)\n\nEt uniam, sanctam, catholicam, et apostolicam Ecclesiam. (Synb. de Nicée.)\n\n(Ni tâpwewokeyîtten) mina l'Eglise piyeyakwak, ketchitwâwak, katolikiwâk, mina apostolikiwak.\n\nN't'awassimissitik, anotch mayowes ati kakeskweyân, ni mawimustawaw ki Tibeyimiwemiuw, kwayask kitchi ijililiâwok, oma ka wipikiskwâtamwok. Ayis, ki kiskeyittenâwaw, mistahi nayettâwan, niyân k'etoweyâk, kwayask kita kweskîtitâk, kiyawaw k'etoweyek. Atît.\nwemistikojimowina namawiya ki miskâganîwiwa, kita îbiskamâtumagaki nehiyâwewina. Ekusi wiyawaw kitchi ayamihewiyiniwok kita mitoni kanâweyittakwaw Ayamihâwin, anisikis mistahi kitchi pîsiskeyittakik eka pikonata kitchi ayitiltâkwaniyik. Eokotchi anotch nisto wemistikojimowina ni ga âbatjîtân, eka mitoni e ki nehiyâwettitâk, ekoni: L'Eglise, Catholik ekwa Apostolik, tcheskwâ kiyipa ki ka nissitottamohitînâwaw tânisi c wi-itwek.\n\nTattwaw c kijikâk, eyamîtâyeku ayamihewitâpwewokeyittanowin, omisi kit itwânâwaw: Ni tâpwewokeyitten L'Eglise Catholik. Eoko otna anotch ka wi otchi kakéskikkemokâkeyân, e wikakwe-kwayaskweyittamohitakuk, tânisi ketchina nessitottâkwak, k'etamek: Ni tâpwewokeyitten L'Eglise Catholik.\n\nOma L'Eglise, k'êtwek, njweyakittâkwan: peyakwâyi eoko, ayamihewikamik, ite ka ayanihâk mana, ite ka pittukek, e wi-mawimustchikek, ite ka ayât J.-C. e kâsustâket kitchitwa Eucharistîwinik, eoko peyakwayi L'Eglise, ka ijibikâtamik. Ekwa kutakwâyi, eoko anima kakiyaw mišiwe ot ayamihâwok, mâmawi o kitchi mawâjihituwiniwaw, e kiskeyimâtjik Kijemanitowa, e omanîtomimâtawaw, e atuskawâtjik. Oma k'êtweetâyân, anima iskweyâtch, eoko ketchina L'Eglise\nCatholik, ka wi-mamiskotamatakawaw anotch. Mitoni wi-nandottamuk.\n\nL'Eglise, nistweyakeyittâkwan : nistan L'Eglise ka mamâtâkosâkotchihiwemagak, ekuta otchi k'o ayâljik sâsây kitchi kijikok ot ayamihâwok, tattotota askik, ka ki sakottâtjik matchi itâtisiwina, eka e ki kaskihikutjik Matchi-Manitowa, piwis ka miyopikkohutjik; eakotchi ot oskânesiwiniwaw L'Eglise ka mamâtâko-se otchihiwemagak. Ekwa peyak L'Eglise ka itasi-kwataki-kaskeyittamomagak, ekute e witjihiwetjik tattotot ayamihâwok ka ayâljik kassinaîmakewiskutek, e itasi-kanâtâtchâkwehişutwaw, mayowes wâbamâtjik Kijemanitowa. Ekwa iskweyâtch ka iteyitchikâtek. L'Eglise; eoko.anima ka megwa-itakkamikisimagak, ekotowik e wetjehiwetwaw tattotwayâsk ot ayamihâwok wasketaskamik, ka megwa-atuskâtâkjik tchi pikkohutjik nipitwâwi. Eokotowikkân ketçhina L'Eglise ka wi-ayimotamâtakawaw.\n\nKakiyaw kwayâsk ot ayamihiwok wasketaskamik, ka mamâwiwitjettutwaw, e peyakuttâtjik piyeyakwaniyîk ayamihewinanâtâwihuwina, e pamittwâkutjik iyenaîo kwayâsk ayamihewiyiniwa, eoko anima L'Eglise ka megwa-itakkamikisimagak wasketaskamik. Wâwâtch mamâwiyes ka nikâni kitchi ayamihewiyiniwit Le Pape\nk'etil, eoko ka tibeyittak mina ka wiyasuwtatik eoko L'Eglise, tchikema wiya e ki miyokowisit mosis waaskitaskamik, tchi meškutapistawat Jesusa mina tchi ūniskestamawat kitchitwa Pierra, ka ki nistam le Papiwiyit.\n\nL'Eglise witjetuwiniwiw, tchikema nanantok otchi ayisyiniwok e tabitaweyittakik kwayask ayamihewijitawawin, eokotchi witjetuwin, ko ijihikateyik. \"Kakiyaw kwayask ot ayamihâwok, e peyakwaniyik ot iji-ayamihewitâpwe-wokeyittamowiniwaw\" itwaniw; tchikema kispin awiyak, eka kwayask ayamihâtji, e ata n'tayamihâw, e itastât, namawiya kita itakimaw ekotowik l'Eglise, eka e tapwewokeyittak, tanisi e iji-kiskinohamâkemaganiyik eoko l'Eglise.\" E peyakuttâtjik piyeyakwaniyik ayamihewina-natawihuwina,\" tchikema ekuta k'otchi ot otemiltuljik kwayask ot ayamihâwok, e peyakwaniyik e totchikasuwiniwaw, kakiyaw e sikâjikâsuk, kakiyaw e ayamihewâtjimisuk, kakiyaw e ayamihewisaskumuk, kakiyaw e wiya-mâtjik Jesusa, eka niyokusiyit ot okinâmiwaw; \"E pamittwâkutwaw iyenato kwayask ayamihe-wiyiniwa;\" tchikema awiyak iyenato kwayask ayamihewiyiniwa eka ot ayamihewininimitji, namawiya kita ki akimisuw kwayask ayamihâwinik, kwayask L'Eglise—k'etewewit. Wawatch\nkwayask ot ayamihaw kita nissitaweyimât mâmâwiyes ka nikâni kitchi ayamihewiyiniwiyit, Le Pape, ka itimit, mosis e tapistawâyit. Jesusa was+kitaskamik, e ki miyikuyit âniskâlch, kitchi ti-beyittamâkeyit ayamihewijittwâwin. Wâwâtch kitchi kiskeyimit eoko Le Pape, e âniskestamâwat Pierra, ekute otchi e tibeyimât mina e oye+yimât kakiyaw kitchi ayamihewiyiniwa, mina kakiyaw ot ayamihâwa.\n\nOma L'Eglise, appo kit ayamihewijittwâwininow kitchi itwek, peyâku-kwayaskopayiw, peyaku-tâpwemâgan, tchikema e tibiyâwewisimagak newo kekwâya, e ol ayânimagak: e peyakwak, e kitchitwâwak, e catholikiwak, mina e apostolikiwak. Eokoni otchi newo kekwâya k'o nissitaweyittâkwak e kwayaskopayik iyenato L'Eglise.\n\nIyenato peyakwan ki l'Eglisiminow, appo kit ayamihewijittwâwininow, tchikema peyakuw Jésus-Christ, ata eka niyokusit, ka ki ojitît, mina ka tibeyittak, mina peyakuyiwa-otapistawâgana Le Pape ka tibeyittamohât wasketaskamik, wâwâlch ka miyât, kitchi tapwettâkuyit kakiyaw ot ayamihâwa. Mina k'o peyakwak iyenato L'Eglise, tchikema e peyakwaniyik ot ayamihewinanatâwi-huwina misiwe wasketaskamik.\n\nIyenato L'Eglise ojitaw mina kitchitwâwai e ot'okimânik J.-C., ka kitchitwâwisiniwiniwit. Kit-\nchitwawan, o kitchitwâwebinâsuwin otchi, tallwaw kejikâyiki, Kijemanito Opeyakosâna wiyawiyu mina o mikkoyu, e pakitinamâkut iyenato ayami-hewiyiniwa. Kitchitwawan, ayamihowinanâwi-huwina otchi, k'o kassinarâkowisisitjik ayisisyini-wok, tchi kanâtâchâkweljik. Wâwâch kitchitwawan, o kiskinohamâkewin otchi e iji-kwayaskopayiyik, e wittamomagak tanima mewâsiniyik mina tanima meytaniyik. Mina kitchitwawan, k'o iteyitchikâtek iyenato L'Eglise, tchikema mitchet wiljewâganak eoko l'Eglise mistahi kitchitwâwisiwok, e kwayaskâtisitwaw, mitoni e totukik ayamihâwin.\n\nKiyawaw, n'tawâssimissitik, e witjihieweyek eji-kitchitwâwanôk, eyiwek tchi ki kitchitwâwi-sinâwaw, oma e wi-ilweyân, kwayask tchi ki-pimâtisinâwaw? Nametchi appo ki nepewittânâwaw kitayamihâwiniwaw, k'etâtjihuyek? Nametchi kiyawaw, ki totenâwaw k'o mattonewokeyit-tamik, nando naspâtch tiyotameku? Mâmitoneyimikuk kil'ayamihâmâganiwâwok mitchet misiwe wasketaskamik, e osâmi kanâtji-pimâtisitwaw, ki ka wi-yeyihikowâwok. Atawiya e matchi-ayiwit-jik âtit ot ayamihâwok, namawiya eokotchi astameyigok kita iteyitchikâteyu ayamihâwin, maka eyiwek nepewâkâtch awiyak meytotehel, wekâwimit kesinâteyittam kispîn e nepewthikut.\"ot\nawissimisea, eka e wi nandottakut ata kwayask e wi-oppikihit. Wawatch iyenato L'Eglise catholikiwan, e nehiyawettakasitilayin eoko oma wemistikojimowin, catholique, k'etwek. Catholikiwan iyenato ayamihawin, tchikema kakike e ki jiskuk, aspin J.-C., ka ki pe-kiskinohamakek, mina Aniekatch tukki e ki petchiayayit aymnihewiyiniwa, isko anotch, e papami kiskeyittamohiweyi; wawatch wama wikkatich kita ponipayiw isko kitchiponi askiwik. Catholikiwan iyenato ayamihawin tchikema misiwe askik e misittepayik. Kiyam piko ile etutteki, miskawawok catholik ot ayamihawok. Akamaskik, ekute ka manattawinokutchikemagak. L'Eglise catholik, osam Romik, otenak ile, ka ayat Le Pape. Kisipaskomikak tekusiniki, misiwe ka maininistikovik kitchikamik, ekute mina wabatchikatew catholik Ayamihawin. Sawuniyotinok itekke appo kiwetimok, sakasenak itekke appo pakisimonak, welittamiki, ekute nissilaweyitlakaniwiw L'Eglise catholik, misiwe e wabamiljik ayisiyiniwok catholik e aspi kiskinowatjibisatjik ayamihewattikonamasuwia.\n\nEkwa iskweyatch, iyenato L'Eglise Apostolikiwan itwatew, tchikema aspin nistam kitchi ayamihewiyiniwok, ka ki ayatljik, Les Apôtres, ka ilitjik, ka ki kitchipayittatwaw ayamihawin, kakike antis-\nkestamâtuwok kitchi ayamihewiyiniwok wâwâtch Les Papes, sakamô ki pe-tâpiskamâtuwok. Aspin S. Pierre, ka ki nistam le Papiwit, ekwa niywaw mitâtato mitano ayiwâk niyânano, mitano niyânanosâb, e ki pe-aniskâtch le Papiwitjik isko anotch, e asitakimit Leo XIII, k’ejihikâsot anotch ka osâmi-mân:âllâko-kanâweyittâmâket L’Eglise catholik. Catholik l’Eglisik Le lape mistikwâneyittâkusîw, e peyaku nikânisit, e tibeyimât kitchi ayamihe-wiyiniwa, mina kakiyaw ot ayamihâwa, wâwâtch e wiyasînwâtamâwâl, tanisi ke ayitotamiyit mana. Wiyawaw, kitchi ayamihewiyiniwok miskijiko-weyittâkusîwok, e kitâbattâmâwâtjik. ot ayami-hâwa ot iji-pimâtisiwiniyu, kwayask takki kitchi kiskinohâmâmit, wâwâtch-kitchi nisokkâmâwâtjik Le Pape ayamihewiyasuwevinik. Wiyawaw maka nayestow ayamihewiyiniwok mitoniwo-keyittâkusîwok, tchikema e otonikkâwâtjik ayisiyiniwa, e pikiskwâtâlwaw, e kiskinohâmâwâtjik : nametchi misiuce âskik itwewittâkwaniyu otonîwaw? Ekwa wiyawaw nayesto ot ayamiliâwok paskesiwiniwiwok, e’ mitchitchiwitjik, mina e misitiwitjik, e pimâljihatjik ayamihewiyiniwa, ka pamiltwâkutjik ayamihâwa. Ekusi ijinâkwan L’Eglise catholik, e witjetuwiniwik, e ki ijilât J.-C., kitchi kwayaskopayiyik ot ijittwâwin, kakike tchi tâpwemaganiyik.\nAnihi maka kutaka ayamihewijittwâwina, namawiya ekusi ijinâkwanwa; eokotchi namawiya kita ki tâpwemaganwa, wiya eka e ojittât J.-C.\n\nEka k'o tâpwemaguki pitus ayamihewijittwâwina, tchikema namawiya peyakwanwa. Kayâsis petchi âtit ayisiyiniwok, kikikittuwin otchi, mayo e ki paskewitâtjik oma catholik Ayamihâwin, ekusi semâk ki ati-paskewiyituwok, eka e tâpwetâtutjik animâ otchi pitus ijittwâwin, ka wi-ojittwâsutwaw. Tchikema eka.e wi-nanahittawâtjik le Pape, mina kitchi ayamihewiyiniwa, niya ni ga tâpwân, e iteyittakik, eokotchi k'o wanisikik, pâpitus e ati-miltimetjik, wiyawaw eteyittakwaw. Aniki piskis ka ayamihewijittwâtjik, namawiya kita kitchitwâwaniyu ot ijittwâwiniwaw, wiya osâm tatto ka sokkepayiyik ayamihewi-kekwnya, e nottepayiyik wâwâtch mistahi e ki matchi ayiwi-yit, tatto oskatch ka ki kitchipayittâtwaw kutaka ayamihewijittwâwina, pesissik matchi kekwây e notjittâtjik, ekusi e kilâhamâtwaw, iywe k'o webinakik catholik ayamihâwin. Ekusi mwetchi is. payiw, anotch k'o wâbamîljik ayisiyiniwok âtit, pitus e ayamîhâtjik; tchikema e asoskamâkutwaw mitjimutch otchi anihi nikân ka paskeyit.\n\nNamawiya kita ki catholikîwaniyu, wiya kayatte eka e otchi illakuniyik, astamîspi esa ayâskawi e ki pasketjik, l'Eglise catholik otchi, mina nama-\nwiya kakike kita ki ittakuniyu : piyis ati kita namatakuniyu, takki e'kiweiotakik L'Eglise catholik. Eokotchi namawiya catholik ki ijibikâtiawak, piskis'ka ayamihâtjik, tchikêma astamispi e atjîjîk, eka e wi-oyokâwitwaw L'Eglise catholik. Mina namawiya apostolikîwanîyu ot ijittwâwiniwaw, e ki webînakik nîstam kitchi ayamihewiyîniwa, ka ki wiyasuweyît, wâwîtch eka kekwâyîyenato ayamihewiyîniwa, tchi ot ayamihewiyînimitjik. Pîkonata ayisyîniwa, eka nando etotchikâsuyît kita ayamihewiyîniwîyît, epôkoni ot ayamihewiyînimîiwok. Ekusi mana maka nama kita ki kitchi totâkwok, mina nama kita ki kwayaskopayîyu ekotowikkân ayamihâwîn.\n\nKitchi kiskeytîtamêk, ni'tawassimissîtik, awiyak witjîhiwetji anima nikotowa ayamihewîjittwâwina, eka ka kwayaskopayîyîki, ata e kiskeytîtak eka kwayask e ayamihât, namawiya kita ki pikko'hûw. Piko îtyke awiyak kispîn pakwano-weyîttaî, ekusi kwayask ni witjîhiwâan îteyîttaî, eoko eyiwek mâskulch kita kîtimâkeyîttaîk Tebeyitchikeyît, ala eka kwayask e witjîhiwet, eyiwek kita kanâbattamîwân ot îteyîttaîmowin.\n\nEokotchi kiyanow ka ki kîki nîtâwîkiyak catholik ayamihâwinîk, kitchi nanâskomowokoyîttaîk taltwaw kejîkâki, e ki jîjî-kitimâkeyimikowisiyak. Kakîke espîtchotehîyek sakîttâk\nL'Eglise catolique ku otawàssimissimikuyek, nanahittamok; e ataminayek, e oyokàwiyek eoko ijìtwàwin: Tebevitchiket Jesus, \"ka ki kaskiltamawat ayisiyiniwa o mikkum.\" (Act. 20.) Ki kiki nittewikinàwaw, inina ki ka wi-kiki nipinàwaw, kitchi-miyo-pitukahikuyek kitchi kijkok. P. E. I.\n\n---\n\n4me INSTRUCTION.\n\nDES SACREMENTS.\n\n(Ayamihewinanatàwihuwina)\n\nDe plenitudine ejus, nos omnes accepimus et gratiam pro gratia.\n\n(S. Jean, 1.)\n\nOt ayiwakeyitdkusiwinik otchi kakiyow ki ki otchitamakawinonow eweyotchipayitivàkowisiyak, saweytimikowiwin.\n\nNì'aw ssimissilik, anotch n'tatamioàn è otchitchipayìhkuyàn, kitchi ayimotamàtakwaw ekwa ayamihewinanatàwihuwina. Ayis, eoko peyak kekwày mistahi ka ayiwakeyitchkàtek catholic ayamihewijìtwàwinik, kita kwayaskweyìltamik\nespayiki mana ayamihewinanatâwihuwina. Ot ayamihâw ayisiyiniw, sâsây ka ki totchikâsut âtit otchi ayamihewinanatâwihuwina, kiya miweyittam kâkittwâm e miskawâsomit, tânisi espitêyiîtâkwaniyik o totchikâsuwin. Eokolchi ekwa ki wi otchîstamâtînâwaw ayamihe-kakesikkemowin; espayiki ayamihewinanatâwihuwina. Weskatch mayowes ayamihâk waskitaskamik, eyiwek ki illâkunwa, totchikâsowinikkâna, e itâbatâkwaw ayisiyiniwok-tchi peyakweyitultwaw, ejî mumâweyitultwaw kekwanok manilo-mawimus-tchikelwâwi. Kayâsijîttwâwinik ki totâkaniwibani initchet nanâtâwihuwinikkâna, tchi kassiyâbawayehisuk, maka eoko kayâs ijîttwâwin Judawiyinivok ot ojîttwâwiniwaw ka îtamik, namawiya tâpwe ki âwanobân, piko tâbiskoteh niyâk e kiskinohamomagak, anotch ekwa ijîttwâwin ka ki tabapistâkumagak. Eokoni kayâs nanâtâwihuwinikkâna tâbiskotch' e tchikâstettikî, eyigok e tâpwemagakwa anotch iyenaço ayamihewinanatâwihuwina, eokoni piko e ikkiki kitchi tâpwe totchikâsuk ayamihâwinik jji.\n\nNanâtâwihuwina ijihikâlewa, e onanâtâwat-châkwewinik. K'ejî nanâtâwihuk mana wewiyâwik eyâkkusiki, ekusi mina wâwis tchi nanâtâwihuk wetatchâkuk, piyâstâhuki, k'ejî âkkusik miyâwik, ekusi mina iji ayaw atchâk, e âkkû-\nsiskâkot matchi ittiwin. K’eji ittakuki mana mas-\nkikiya, pâpitus etakîchikâteki kitchi nanâtâwi-\nwâkek, nando etâmatjihuki, ekusi mwetchi itta-\nkunwa manitowimaskikiya, kita nanâtâwatchâk-\nwek, e ânisîchiganiwik, eyâkkusiskâkemagaki\npâstahuwina.\n\nA yamihewinanâtâwihuwin, k’etamik, eoko ani-\nma: eka niyokwak otchistamâkowisiwin o kiskino-\nwâteyîchîgan niyokwak ka ki ijîtât J.-C., kita\n-itchitwâwisihât kit atchâkonowa. Kukwe-kwayâs-\nkweyittamuk k’etweyân, omisi: lo Ayamihewi-\nnanâtâwihuwin, eoko mina, eka niyokwok otchis-\ntamâkowisiwin o kiskinowâteyîchîgan niyokwak,\nîtwâniw, tchikema, ayamihewinanâtâwihuwin,\nekuta k’o ittakuk ke nokwak kekwây otchi, e wâ-\nbattamik appo e pettamik, appo e kiskeyittamik\nnando iji. Semâk kiskeyittâkwan: itchist ayami-\nhewiskâhatchikâsuwinik; nipiy ka îtabatak\nmana miyaw tchi kâssiyâbawâtâk, ekwa awâsis\nostikwânik e sîkinamuth, nokullâniwiw kiskino-\nwâteyîchîgan, e kiskeyittâkusit ka sikâhatchikâ-\nsut, tchi otchistamâkowisit, ot atchâkwa e kâssi-\nhamâkowisiyit pâstâbuwin ka pe kiki nittâwikit.\nKitchitwâsokkitêheskâketominîtuwinik, — anima\nkitchitwa pimiy ot awiwiniw kitchi ayamihewi-\nyîniw tchi tomiskattikwenât ayisiyîniwa, eoko\nkiskinowâteyîchîganîwiw, e aveyittamik k’eji\notchistamakowisitânâh ka kitchi tochikusût Mina,\neyâbîch ekusi ayamihewikassihamâkewinik:\nayisiyiniw ka âjîmisustâwât ayamihewiyiniwa e,\nkassihamâkut, eoko kiskinowâteyitchikâteyu tchi\nâweyittamuth kisik e kassihamâkut Kijemanitowâ.\nEkusi ati kutakâ ayamihewinanâtâwihuwina,\nkitchi ki itâstûk. 2o Ekwa ekusi itwâniwan:\nka ki ojitât J.-C. Tchikema J.-C., ânah ka ki\npe ayisiyiniwibisût, tchi ayisiyiniwimaniwit, wiya\npiko ka ki ojitât ayamihewinanâtâwihuwina,\nmissawâtch wiya piko tchi kâskittât. Awena\nmakâ pitus, eka ki Kijemanitowit, kita ki awet-\nâw uando kiskinowâtjihikâsuwin, kita otchista-\nmâkowisût? Namawiya esâni ayamihewiyiniwok,\nka ki ojitâlik ayamihewinanâtâwihuwina, piko\nki pukitinamâkwok Jesusa, e kanawiskottahî,\nkuttuw, tchi totamâketwâwâ. Eokotchi Trentâ\notchi ayamihewikitchimâwâtjihituwin omisi ki\npakitchimiwâniwiw e ki itwemagak: \"Kispia\n\"awiyak itwetji ayamihewinanâtâwihuwina, eka\n\"kakiyaw e ki ojitâyit Jesusa, kita webinikowi-\nsiw. (Sess. 7. Canon 1-3.) 3o Ekwa wâwâtch\nekusi itwâniwan: Kittu kitchitwâwisihât kit. atâhâ-\nkonowa. Atâ J.-C. o nipustamâkewin oôhi, e ku\ntebi-kâskittamâkoyuk kitchi pikkohûwayak, eyîn\nwêk ki pukitinam ayamihewinanâtâwihuwina\nkitchi otâbaljîjigâniwit, k'otchi otchistamâkoyak;\no miyo kaskittanakewina. Ayamibewinanatawihawinak ki ojitjikatewa, kitelki ki chitwawisihikuyak, \"e miyikuyak miyowatisiwak, mina e yakkimotiwakuyak, oppo weniltiyaki, lewi e mekinawatikoryak.\" (Como. Trad., khid.) Tepakop itatiqwa: ayamibewinanatawihawinak namawiya ayiwak mina namowiya astameyigok. Eokomi: Ayamibewisikabatchikasuwini, Kitelkwawisokkiteheskilkeleminituwin, Ayamibewiskissihomakewini, Kitchawa Eucharistiwin, Iskweyatch ayamibewilominituwin, Ayamibewiyiniwijihitwini, Ayamibewikitchiwikittuwini.\n\nTebeyimitak ki tepi kupitilaw ayamibewinanatawihawinak ketafiniyik, ot ayamibewina ot itatisiwiniyiya. Ayamibewisikabatchikasuwini nekanirwak, kittwini ki niduwikiwatchakwebikurow. Kitelkwawisokkiteheskilketominituwin, ki yakkimohikurow miyowatchakwewink, wawitch kit ayamaskibikurow ayamibewitapewewokeyita- mowinik. Kitchawa Eucharistiwin otchi asamikwisiw kihi atchikonow. Ayamibewiskissihomakewini ki nanahwatchawehikurow, e spasissihikuyak pistahuwink otchi. Iskweyatch ayamibewilominituwin ki sokkiketeshikikurow cyakkusiyaki, eka kilak leustamak nipuwini. Ayamibewiyiniwijihitwiniak otchi etinikasuwok ayamibewiyiniwok kiha pamititarjik Ayamiha win, mina kit-\nchi pamistâketjik. Ayamihewikitchiwikittluwinik otchi kitchi mitchetohitutjik ot ayamihawok. Ekuta otchi anotch k'etwâtamân ayamihewina nâtâwihuwina, kita kirk'yîllâkâniwiw, k'eji kwitamâk k'kwâya kitchi pimâtjiyâwek, ekusi mina kitchi pimâtatchâkwek: kitchi nîtâwikik, tchi yakkikik, tchi sokkikik, kitchi mitjîsuk, kitchi nanâtâwihuk eyâkkusiki, âlit ayisiyinîwok tchi oyâsuweljik mina tchi pamistâketwaw mina kitchi nîtâwikibituk, eka kita metchi poni-ayisiyiniwiw.\n\nEyiwek mistahi âbataniyu ot ayamihaw kitchi kweyaskweyîttâk kakiyaw ayamihewinanâtâwihuwina espayiyik, ata kakiyaw eka. kitchi ki otchi totchikâsul, osâm maka âtit.\n\nNijweyakittînwa ayamihewinanâtâwihuwina, nijo kekwaya oti e n'tâweyitchikâtekwaw ayamihewinanâtâwihuwininik, ot awiwinîwin, mino opikiskwewiniwin, k'o itwët kitchitwa Augustin: \"O pikiskwewiniwin welittamomagaki ot awiwinîwin, ekuta k'otchipayik ayamihewinanâtâwihuwin.\" Ot awiwinîwin k'ejhikâtek, eoko anima kekwây k'otawiwinik ketchitotâkâki, tabiskotch nipîy, kitchilwapimîy.... matchi iltiwina e atotchikâtekwaw. Opikiskwewiniwin maka, eokoni pikiskwewina kaâbatjîttâk, ispi wakitchitotâkeki. Ekuta ketchina k'otchipayik\nayamihewitotchikasuwin, e ayamihewipikiskwek otchi. Tchikema ata awiyak sakinamutji nipiy ostikwanik, namawatcho pa ayamihewisikahatchikasuw, kispin e ka itwewitji: \"Kit ayamihewisikahattatin Weyottawimit, etc., etc.\n\nKakiyaw ayamihewinanatawihuwina namawiya peyakwan ispityittakwanwa. Atit mami tchetwaw kita ki totchikasunaniwan. Alit maka papeyakwaw piko. Eokoni anihi mami tchetwaw ka miyituk: Ayamihewikassihaminakewin, kit chitwa Eucharistiwin, Iskweyatch ayamihewitominituwin, mina ayamihewikitchiwikittuwin. Papeyakwaw maka ka otilikuk, eokoni: Ayamihewisikahatchikasuwin, Kitchitwasokkiteheskaketominituwin, mina Ayamihewiyiniwijihituwin. Eokoni nisto papeyakwaw piko, k'o totchikasuk, tchikema k'oji naspitchi kiskinowatchakwehikowisik eka wikkatch tchi kassipayik, e ata pastahuki, mistahi matchi totamiki, appo webinamiki ayamihawin. Awiyak ka iji-kiskinowatchakwehikowisit nikotowa anihi nisto ayamihewinanatawihuwina nama wikkatch kita poni kikiskakuw otaaskik, mina awasite kutak pimatisiwinik. Meyo-ayiwitji, kita matnattakobikuw kitchi kijikok, metchi ayiwitji maka kita nipahinepewihikuw kitcki iskutek. Tchist awah ayisiyiniw siyekahatchikasut, wanihukwe, kita pimi-\ntisahokow o sikahalechikasuwin, misiwe e kiske-\nyittakusit e ki misiwandjifit, tabiskotch awiyak\nka wiyattalbic kanajimiyomiskwakly, ekusi ku\nn'tawiwiyepiskak.\n\nAkameyimek, a'kawassimissitik, kakiyipa\nkita kakwekaskittamasuyek ayamihewinanat-\nwihowina, keji iteyitlakusiyek. Talwaw eya-\nmihewAtjimisuyeke, mina talwaw eyamihew-\nsaskamoyeku, takki ayiwakes kakweniyopim-\ntisik, kakwe Atchiwinaok ki matebi ittiwiniwew-\nwa. Pitane'tapwe miyekakukuyek, talwaw edaky\nka kitichitokawiyek, eka kitkwam kita olitri-\nkuyek matchi Akkusiskakewi pastahowina!\n\nNijweyakanwa ayamihewinanatwihowina:\nAtit kesinateyimisu - ayamihewinanatwihowina,\nekusi kutaka \"Pimatlji-ayamihewinanatwihowina,\"\njilbikqteewa: Kesinateyimisu-ayamihewi-\nnanatwihowina, eokoni: k'otchi kassibamaskok\nmatebi igirwina, kispin mitoni kesinateyimisu-\nki. Nijowanwa, ayamihewisikahatchikasuwin, mina\nayamihewi-kassibamakewin. Pimatlji-ayamihewi-\nnanatwihowina, eokoni; eka kitchi ki tota-\nmilk, piko pilu kitchi kassibamaskok ejii-matebi\ntotumik. Tchikemak kispin awiyak n'tawi-kitchi-\ntotchikuyujji atu kiokeyittak eka e kanajitcha-\nkwet, misthi-pu pastahuw e metawaket ketchi-\nlwaniyik kekwily.\nEtatiki ayamihewinanatawihuwina, kitchitwa Eucharistiwin, eoko anima mamawiyes ka ayi-wakeyitlakwak, ka kisleeyitlakwak, mina ka kitchitwaweyitlakwak, ichikema ekotowik e ayat espitisiit J.-C., eji Kijemanitowit mina ejia-yisisiwiwit, e kasnalaket manito-pakkweinganik.\n\nAyamihewinanatawihuwiza namaawiya kakiyaw payakwan etabatanwa kitchi pikkobuk. Nijo osam mistahi ubatanwa. Nikan ayamihewisika hachikasuwini, eoko mamawiyes ka abateyitchikatek etaliki ayamihewikekwaya, tehikema eka sikahatchikasuk nama wikkach kilaki wabamanaw Kijemanito, k'o itasowet J.-C.: \"Awiyak eka kittwam niitawikitije nipiy otihi\" mina Meyosiyit-Manitowa otihi, namawiya kita \"pitukew kijikowotenawiyinik.\" (S. Joan., 3.) Ekwa iyaskutch ayamihewikasaibamakewin mina mistahi Abatan, ayis ekuta otihi piko ki ka ki kassihamasunanow matchi ittiwina, ka sikhatchikasuyak mwestaa piyastahuyuki.\n\nJesus-Christ mana maka ka ki ojilat kakriyaw ayamihewinanatawihuwina, maka ki pakitinama-wew ayamihewiyiniwa, e kapawiskboltsat wiyawaw piko e ki oyimat kita kilchitolakeyit. \"Tabis,\" \"koteh J.-C. opamistagana ni ga wi-itakimikokonan ayisiyiniw, mina Kijemanitowa o kitchi-\n\"twamiyiwa o mikinnwasiwewok, kiyan ni\nga iteyimikawinän.\" (1 Cor., 4.) Kakiyaw ka\nki kwayask ayamihewiyiniwihiitwaw, cokonj\npiko miyikowisiwok kita otamittatjik ayamihe-\nwinanatwihuwinna mina kita, totamowatjik ayi-\nsiyiniwa. Kispin awiyak ketchitotatji, peyak aya-\nmihewinanatwihuwin, e megwa miyo-kanata-\ntehâkwet, otchistnamkowisiw' kitchi wi otillikut\ntânisî elakitchikâteyik eoko totchikasuwin. Kis-\npin maka awiyak ketchitotatji, megwatch e ki-\nkiskâkul matchi illiwin, mistahi mayitolâsuw,\ne mayeyittamowâl Tebeyitchikeyit, o miyo totâ-\nkewiniyiwa.\n\nN'tawâssimissilik, mamitoneyittamuk mitoni\nâneyigok mana kitchi kakwe wâweyiltwasuyek\nmiyotehewin, miyowâlisiwin, miyomawikkâtis-\nsuwin, taltwaw wa-kitchitotchikasuyeku. Wi-\nnanâskomik ki Kijemanitomiwaw J.C. e ki\nojittamâkoyek eokoni kitchi ijitttwâwina. Na-\nnâskomik e ki kâskittamâkoyek eokoni miyo-\nabaljitjigana, kita otawiwiniwâyckâtchî pikku-\nhuâyck kitchi kijikôk. Ayamihewinanatwihu-\nwin ka kitchi totâkîwiyek mana,, ekuta olchi-\nakameyinuk ayiwâkes kita miyo-ayiwiyek, ayi-\nwâkes kitchi tapwewokeyitlamêk mina kitchi\nsâkittâyek, ayiwâkes kitchi sâkihiyek J.C.,\nmina k'itj'ayisiyiniwâwok, ayiwâkes kitchi kus-\ntamek matchi totamowin, matchi miloneyitchig-\ngan mina matchi pikiskwewin. Ekawiya wi-nas-\npitakuk aniki ot ayamiha'wok, o ata kakiyipa kit-\nchi tochikasutwaw tiyakwatch ajipiko matchi\nayiwiwok. Anotch awah ka ki n'tawi-ayamihewi-\nsaskamot; sasly ka matchitoneet. Tchikemleoko-\nwik ayisiyiniwok namawiya tapwe kwayaskweyit-\ntamok ka totakik. Pikonata waskitch tebiyak kis-\nkinowatehi ayittiwok, namawiya tapwe otehiwak\nmaniloweyittamok ayamihewinanatawihuwina.\nKiskisik, ot ayamiha'lik, tattwaw ka kitchitotaka-\nwiyek, eyigok nipiyeku, ki ka otchi wiyasuwat-\ntikowaw Tebeyitchiket tchi tipahamohitek. Kis-\nkisik mina kiyawaw eka wikkach ka n'taweeyit-\ntamek kita kitchitotakawiyek, tcheskwa mistahi\nki ka wa'waneytumohikowaw o kitchiwiyasu-\nwe-Manito.\n\nN'taweatch, eyikokkweyimotan kita kaskilla-\nmusuyak kakiyipa ayamihewinanatawihuwina,\ntehi miyo iyinikkahikowwisitwaw kit atchakono-\nwok waskitaskamik, tcheskwa kakike kitchi\npimatisitjik kitchi kijikok. P. E. I.\n5me INSTRUCTION.\n\nDE LA PRIÈRE; COMMENT IL FAUT PRIER.\n\nDomine, doce nos orare.\n\n(St. Luc, 13.)\n\nTebeitchikeyan kiskinohamawinän tchi iji mawimustchikeydak.\n\nN'tawassimissitik, ekwa anotch ki wi kiskinohamatinawaw kekotowiniwik mawimustchikewin. Ot ayamiha ayisisiyiniw, keskeyittaki kitchi iji tapwewokeyittak, mina kwayaskweyittaki Kijemanitowa ot itasowewiniyiwa, wawatch mitoni nissitaweyittaki etattiniyiki mina etabatanyiki ayanihewinanatâwiuwina, piko kitchi ketchinâheyittak eyigok e n'taweyittamâkowisit kita mawimustchiket, ekuta oichi kita mantolamâwât Tebeyitchikeyit, tchi nisokkamâkut. Eka nisokkamâkowisitji, namawiya kwayask kita ki ayamilhewitâpwewokeyittam, namawiya kita ki totamwew ejisikkimikuî Tebeyitchikeyit, mina eka miyikowisitji, namawiya kita ki kanâtji-otitlikuw ayanihewinanatâwiuwina. Eokotchi ekwa ki wi wittamâtinawaw eyigok e âbatak mawimuštchikewin. Nantolamâwâlâk mâmawi\nweyottawimâyak, niya kwayask kita kakwe ka-\nkeskimitakwaw, ekusi kiyawaw, kitchi wi kwa-\nyaskweyittamek, eokoni kakeskikemowina; ke\nmiyitakuk, mawimustchikewin otchi.\n\nKijemanito e miyikoyak ot ijitwâwin, neweyak iji ki iteyimikonow. tchi ayittiwayayak, wa-\ntotamwayaki, wiyasuwewinik, tapwewokeyittamowininik, totchikasuwinik, mawimustchikewininik. Ayis J.-C. ispi e pakitinamâket o kiskino-\nhamâkewin, ki itasitchikew tehi wiyasuwewini-\nwiyik, tchi tapwewokeyittamowiniwiyik, tchi\ntotchikasuwininiwiyik; mina tchi mawimustchike-\nwiniwiyik. Sasay nisto e ki tipotamatakwaw,\nekwa ni wi mamiskoten, anima iskweyâtk ka\nwetjikâtek, mawimustchikewin ka itâkâniwik.\n\n\"Kijemanito a nanâgataweyimit espitchote-\nhik, eji Kijemanitoweyittâkusit, e nanâskomit\nmina e nantotamât pimâtisiwin atchâk otchi mina\nmiyâk iji,\" eoko anima mawimustchikewin,\nka itwek. Niyananweyâk iji kita ki nanâkata-\nweyimaw Kijemanito. lo. E omânîtomimâyak\nmina e mâmitjimâyak. 2o. E âtjimâyak wâ-\nwâtkh e atotamwayak o kisteyittâkusiwîn, o mâ-\nmattâwisîwin, ot iyinisîwin, o kwayaskâtîsiwin,\no kijewâtîsiwin, kakiyaw o miyo ayîwiwîna: 4o.\nE nanâskomâyak kakiyaw otchi ka ki miyo to-\nâkoyak, mina eyâbîtch sakamo ka kitimâkéyi-\nmikoyak. 4o. E pakitinamawayak kit ayisiyiniwininow, kit ayawininowa, kit ittiwininowa, ki kwatakittawininowa, kiyaawinow, kit atchakonow, piyis kakiyaw kit ijiwininow. 5o. E nantotamawayak, eji kwitamawayak kekway eji ot atchakowayak mina eji o wiyowiwayak. Eoko tattwayak ka pakuseyimit Kijemanito mawimustatji. Wiya mana maka kakiyaw kekwaya tibeyittam, pimatisiwin mina kitchi opimatjihwit, tibeyittam, ekusi e mekit, kispin nantotamatji. Kispin ki ntaweyittenanow kita otinamakoyak kekway, eji kitimakisiswayak, nandotamawalak espitchotehiwayak, kitchi wi kitimakittakoyak. Eoko ki ka totenanow, kispin nitta mawimustchikeyak.\n\nNijweyaganwa mewimustchikewina, peyak, kimotch mitoneyitchigananimawimustchikewin, ekusi kutak waskitch ka pikiskwewiniwiw mawimustchikewin. Mitoneyitchigananimawimustchikewin, eoko mitehik nayesto k'otchipayik. Ka pikiskwewiniwak mawimustchikewin, eokoanima ka totchikatek miteyanik otchi. K'o pituteyittakwaki eokoni nijo mawimustchikewina, peyak wabatchikatew mawimustckikewin, pettatchikatew, pikiskwemottaniwiw, ekusi wiya kutak, nama nokwan, nayesto mitoneyitchiganik ikkin, e nanagataweyittamitehikowisik. Maka kita\nkakwe pisiskeyittakaniniw mawimustchikewin,\nka pikiskwemottak, tchi miwasik, piko kisik\nkitchi mitoneyitchiganiwiw, mileh asitji mit'on\ntchi witjetunagaki. Tchikema kispin mit'on\nnayesto mawimustchikaniniw, eka e abatjittak\niniteh, nayowisinaniwiw, pikouata kakayesimawimustchikewin. Kijemanito assenam, lasipwa\nk'o itwel: \"Eokonik ayisiniwok ni mamit-\njimikwok ot oniwak tebiyak, maka otehiwaw\n'wayo asteyu.\" (Math. 15.)\n\nMitoneyitchigani-mawimustchikewin, eoko ma-\nmawiyes mewasik, mina missawatch mamawiyes\niyabatak, wawatch watakame espayik, kispin\noti espitchotehik e totamik, mina wayatchaweit-\ntamik. Tapwe mana maka, ekusi iji, nawatch\nmamitoneyinisunaniwiw, nawatch mitjimeyi-\nmaw Kijemanito, mina nawatch kijatakaniniwa\nkekwaya, ka nantotamik. Awiyak mitoni otehik\notchi e mawimustchiket nit'a nantottakowisiw:\n\"Ayis, Kijemanito namawiya wi nandotam pi-\nkiskwewina, ka otchipayiyik mitonik piko otchi,\nmaka'anihi o'am mitehik ka otchipayiyik.\" (S.\nCyprien de Orat.) Ata mitoni e miwasik, e aba-\ntak, mina e wetlasik mitoneyitchigani-mawimus-\ntchikewin, namawiya eokotchi eka askaw kitchi\nmawimuschikek mutchiton. Tchikema e njwe-\nyakihuyak, eji ot atchakuyak, mina eji o wiyo-\nwiya, nakiskanomagan, eji o wiyoowiya, kita mamitjimayak Tebeyitchiket, mewimutawayaki.\n\nEn'taweyittak miteh namawiya atawiya ataweyittam piteyaniy, kitchi mamitchimayak, kitchi nanaskomayak, mina kitchi nantottamayak o nisokkamakewina. Maka sokki iteyittam mitehik kitchi otchi sipwepayiyik kakiyaw ittiwina, eka ekusi espayiyiki, namawiya, kita ki miweyittam. Tasipwa k'o itwet J.-C.: \"Mitehik otchi kita o Manitomimaw Kijemanito.\" (Jean, 4) \"Kakike mitehik otchi, tchi mawimustchikek.\" (Ephes., 6.)\n\nEkwa ki ka kakwe-kiskinohamatinawaw tanesi kekwaya, kitchi nantotamayak Kijemato newimustawayaki. J.-C. ki ki wittamakonow eokoyu o miyowatjimowinik, e itwet: \"Nikan n'taweyittamuk kitchi otittayek Kijemanito, mina kita olittikuwayek o miyowatisiwin.\" (Math. 6.) Anisikis nistam kitchi nantotamayak Kijemato kakike pimatisiwin kitchi kijikok, asitji nisokkamakewin, kitchi otittamik eoko. Eoko mamawiyes [nikan kitchi n'taweyittamik, pitus kekway, olak piko kita nantotamik. Eokotchi k'o itasinahikatek Manitowimasinahiganik: \"Kakike kita mawimustchikaniwiw.\" (Luc. 18.) Kitchi kaskittamasuyak eoko niyank miyo kekway kitchi kijikok, k'o wittamakowisiyak,\ntchi akameyimoyak, \"tchi nantonikeyak, tchi pakamahikeyak iskwâtemik.\" (Math., 7.) Ekuta eyâbitch otchi Tebeyimikoyak, k'o asotamâkoyak, \"piko iji kekwây nantotamâwayaki Ottâwiya e wiwòwinik otchi, kita totamâkoyak\" (Jean, 14.) Eoko kakike pimatisiwin otchi kita mâmaâwiyes nikâneyittamak, mewimustchikeya-ki mana.\n\nEkwa, n't'awâssimissitik, m'westas ki ka ki nantotamâwanow Kijemanito pimatisiwin ota assik, mina asitji kakiyaw kekwaya tchi otchi mi-yopayiyak. Eokotchi eyâkkusiki, mayâkupayiki, wâwâneyittamiki, kwetâkittaki, miwâsin mina âbatan, tchi nantotamâwayak Tebeyitchi-ket, kita wi miyikoyak, ka iji n'tâweyittamâ-wayak. Ekusi mana mewimustchikek; piko kisik omisi kitchi iteyittamik: \"Kispin iteyitta-ki Kijemanito....\" \"kispin kiskeyittaki, tchi âbatjihikuwok, ka nantotamâwok.\" Tchikema âtit ayisiyiniwok mewimustawâtwâwi Kijemani-towa; kispia eka miyikutwaw; ka iji n'taweyittakik, kaskeyittamok, iyimowok, appo iyiewuhuwok. Tapwe kakebâtisiwok; tiyakwatch eka nanâskumâtwaw. Ot âtchâkowâwa ituke otchi, mana piko eka o nantottâkowisittâwaw. Ekusi kit ikawinâwaw kiyawaw ka iteyittamek, mewimustchikeyekû: \"Nainawiya ki kiske-\nyittenawaw k'oji nantotamayek.\" (Marc, 20.) Kiyanow, e pakwanowisiyak, namawiya ki kiskeyittenanow, tanisi ke ayitliyak tcheskwa, mina tanisi ke iji miyo abatjihikuyak kekway nikani; eokotchi mitchetwaw ki nantotenanow kekway, \"mana piko ni ga miyo abatjihikun,\" e iteyittamak, maka namesani, ki tchisihunanow, ki miyikoyakubane, ki ka mitatenanow, nipiyaku. Eokotchi, ot ayamihatik, mewimustawayeku Kijemanito, kekway waskitaskamik tchi wi otiuamakoyek, takki omisi kisik iteyittamuk: \"Nolta, kiya, ki kiskeyitten tanisi kekway ke miyo abatjihikuyan, wi miyin anotch ka nantotamatan, kispin kitchi ki miyo abatjihut n'tatchak, kispin maka eka kitchi ayiwakes sakihitan otchi, ckawiya n'lawatch miyin.\" Namawiya wikkath ki ka mitatenawaw ekusi e ileyimayek kakiyaw kekway ka kwayaskweyittak; ayis wiya mitoni sabeeyittam tanisi kekway ke itabatjihikuwayek; naspitchi mina kljewatisiw, eteyittaki mana, ki ka kitimakittakowaw. Keskeyittaki tchi miyo abatjittawayek, ki ka miykowaw miyo ayawin ota askik, ekuta otchi tchi kaskittamasuyek kakike pimatisiwin kitchi kijikok. Namawiya kita wawaneyittam kita iji kitimakeyimikoyek; ekawiya mana osam kaskeyittamuk, wa mawimustchikeyekeku, k'ottawi-\nnow ka asamât piyesissa, ka pamihât kakiyaw pijiskiwa, wâwis ituke kita pisiskeyimew ayisi-yiniwa, kispin miyâmitoneyimikuiji. Ekusi wi mamitoneyittamuk nando ayittiyeku: \"Tebiyâk miyo kaskihuyân, kitchi wâbamak kitche kijikok;\" nista ka jji nantottestamatak waw ni tebik otchi. P. E. I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001624.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 296, "total-input-tokens": 413528, "total-output-tokens": 89801, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 428, 1], [428, 677, 2], [677, 1774, 3], [1774, 2160, 4], [2160, 2969, 5], [2969, 3687, 6], [3687, 4027, 7], [4027, 4504, 8], [4504, 5598, 9], [5598, 6576, 10], [6576, 7669, 11], [7669, 8696, 12], [8696, 9374, 13], [9374, 10198, 14], [10198, 10748, 15], [10748, 11531, 16], [11531, 12288, 17], [12288, 12696, 18], [12696, 13448, 19], [13448, 14495, 20], [14495, 14916, 21], [14916, 15251, 22], [15251, 15661, 23], [15661, 16139, 24], [16139, 16623, 25], [16623, 17098, 26], [17098, 17577, 27], [17577, 18077, 28], [18077, 18540, 29], [18540, 19267, 30], [19267, 19485, 31], [19485, 19818, 32], [19818, 20093, 33], [20093, 20447, 34], [20447, 20857, 35], [20857, 21223, 36], [21223, 22433, 37], [22433, 22768, 38], [22768, 23292, 39], [23292, 23740, 40], [23740, 23740, 41], [23740, 24666, 42], [24666, 24689, 43], [24689, 25628, 44], [25628, 25658, 45], [25658, 26507, 46], [26507, 26538, 47], [26538, 27538, 48], [27538, 27569, 49], [27569, 28547, 50], [28547, 28583, 51], [28583, 29575, 52], [29575, 29610, 53], [29610, 30627, 54], [30627, 30657, 55], [30657, 31571, 56], [31571, 31612, 57], [31612, 32578, 58], [32578, 32656, 59], [32656, 33582, 60], [33582, 33612, 61], [33612, 34578, 62], [34578, 34608, 63], [34608, 35654, 64], [35654, 35721, 65], [35721, 36767, 66], [36767, 36799, 67], [36799, 37643, 68], [37643, 37674, 69], [37674, 38567, 70], [38567, 38932, 71], [38932, 39405, 72], [39405, 40392, 73], [40392, 41197, 74], [41197, 41833, 75], [41833, 42683, 76], [42683, 43434, 77], [43434, 44621, 78], [44621, 45587, 79], [45587, 46667, 80], [46667, 47014, 81], [47014, 47428, 82], [47428, 47683, 83], [47683, 47968, 84], [47968, 48426, 85], [48426, 48791, 86], [48791, 49260, 87], [49260, 49697, 88], [49697, 50045, 89], [50045, 50329, 90], [50329, 50864, 91], [50864, 51388, 92], [51388, 51871, 93], [51871, 52255, 94], [52255, 52704, 95], [52704, 53302, 96], [53302, 53795, 97], [53795, 54259, 98], [54259, 54665, 99], [54665, 55021, 100], [55021, 55337, 101], [55337, 55696, 102], [55696, 56108, 103], [56108, 56499, 104], [56499, 56830, 105], [56830, 57191, 106], [57191, 57718, 107], [57718, 58107, 108], [58107, 58498, 109], [58498, 58828, 110], [58828, 59180, 111], [59180, 59551, 112], [59551, 59960, 113], [59960, 60453, 114], [60453, 60997, 115], [60997, 61494, 116], [61494, 62002, 117], [62002, 62412, 118], [62412, 62747, 119], [62747, 62893, 120], [62893, 63351, 121], [63351, 63745, 122], [63745, 64111, 123], [64111, 64478, 124], [64478, 64909, 125], [64909, 65368, 126], [65368, 65737, 127], [65737, 66102, 128], [66102, 66425, 129], [66425, 66726, 130], [66726, 67187, 131], [67187, 67641, 132], [67641, 68104, 133], [68104, 68508, 134], [68508, 68960, 135], [68960, 69317, 136], [69317, 69666, 137], [69666, 70183, 138], [70183, 70405, 139], [70405, 70641, 140], [70641, 71037, 141], [71037, 71455, 142], [71455, 71963, 143], [71963, 72366, 144], [72366, 72841, 145], [72841, 73136, 146], [73136, 73547, 147], [73547, 73986, 148], [73986, 74482, 149], [74482, 74880, 150], [74880, 75293, 151], [75293, 75727, 152], [75727, 76181, 153], [76181, 76559, 154], [76559, 76854, 155], [76854, 77177, 156], [77177, 77483, 157], [77483, 77984, 158], [77984, 78444, 159], [78444, 78741, 160], [78741, 78917, 161], [78917, 79282, 162], [79282, 79676, 163], [79676, 80007, 164], [80007, 80364, 165], [80364, 80746, 166], [80746, 81109, 167], [81109, 81436, 168], [81436, 81571, 169], [81571, 82149, 170], [82149, 82197, 171], [82197, 83218, 172], [83218, 83246, 173], [83246, 84152, 174], [84152, 85134, 175], [85134, 86017, 176], [86017, 86077, 177], [86077, 86976, 178], [86976, 87815, 179], [87815, 88789, 180], [88789, 88858, 181], [88858, 89755, 182], [89755, 89778, 183], [89778, 90695, 184], [90695, 91769, 185], [91769, 92564, 186], [92564, 92595, 187], [92595, 93421, 188], [93421, 93462, 189], [93462, 94362, 190], [94362, 95210, 191], [95210, 96178, 192], [96178, 97119, 193], [97119, 98060, 194], [98060, 98100, 195], [98100, 98982, 196], [98982, 99765, 197], [99765, 99765, 198], [99765, 99765, 199], [99765, 100533, 200], [100533, 100567, 201], [100567, 101456, 202], [101456, 102270, 203], [102270, 102347, 204], [102347, 102406, 205], [102406, 103033, 206], [103033, 103116, 207], [103116, 103970, 208], [103970, 104007, 209], [104007, 104622, 210], [104622, 104663, 211], [104663, 105531, 212], [105531, 106555, 213], [106555, 107449, 214], [107449, 108264, 215], [108264, 109233, 216], [109233, 110321, 217], [110321, 111302, 218], [111302, 112188, 219], [112188, 113158, 220], [113158, 113337, 221], [113337, 114188, 222], [114188, 114188, 223], [114188, 115325, 224], [115325, 116313, 225], [116313, 117239, 226], [117239, 117274, 227], [117274, 118127, 228], [118127, 119106, 229], [119106, 120019, 230], [120019, 120825, 231], [120825, 121860, 232], [121860, 121886, 233], [121886, 122838, 234], [122838, 123741, 235], [123741, 124657, 236], [124657, 124657, 237], [124657, 125578, 238], [125578, 125618, 239], [125618, 126528, 240], [126528, 127381, 241], [127381, 128301, 242], [128301, 128333, 243], [128333, 129258, 244], [129258, 129327, 245], [129327, 130253, 246], [130253, 130279, 247], [130279, 131111, 248], [131111, 132206, 249], [132206, 132206, 250], [132206, 132206, 251], [132206, 133218, 252], [133218, 134173, 253], [134173, 134582, 254], [134582, 135122, 255], [135122, 136258, 256], [136258, 137487, 257], [137487, 138728, 258], [138728, 139895, 259], [139895, 141080, 260], [141080, 141921, 261], [141921, 142838, 262], [142838, 144025, 263], [144025, 145125, 264], [145125, 146346, 265], [146346, 147520, 266], [147520, 148694, 267], [148694, 149399, 268], [149399, 150566, 269], [150566, 151708, 270], [151708, 152873, 271], [152873, 154064, 272], [154064, 155253, 273], [155253, 156459, 274], [156459, 157689, 275], [157689, 158948, 276], [158948, 160167, 277], [160167, 160927, 278], [160927, 162108, 279], [162108, 163330, 280], [163330, 164564, 281], [164564, 165746, 282], [165746, 166907, 283], [166907, 168093, 284], [168093, 169251, 285], [169251, 170397, 286], [170397, 171574, 287], [171574, 172540, 288], [172540, 173447, 289], [173447, 174643, 290], [174643, 175799, 291], [175799, 176986, 292], [176986, 178145, 293], [178145, 179287, 294], [179287, 180480, 295], [180480, 180767, 296]], "primary_language": ["en", "fr", "fr", "fr", "fr", "mi", "mi", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "en", "fr", "en", "fr", "fr", "fr", "fr", "ig", "mi", "en", "en", "mi", "ka", "mi", "mi", "fr", "ka", "fr", "en", "en", "fr", "en", "en", "mi", "en", "None", "fr", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "fr", "en", "fr", "fr", "en", "fr", "ig", "ka", "mi", "en", "fr", "mi", "fr", "en", "fr", "en", "fr", "fr", "en", "fr", "en", "fr", "fr", "fr", "en", "fr", "en", "fr", "fr", "fr", "en", "fr", "en", "en", "en", "fr", "fr", "en", "fr", "fr", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "fr", "fr", "mi", "fr", "fr", "en", "fr", "en", "mi", "en", "en", "en", "en", "en", "fr", "mi", "fr", "en", "fr", "en", "fr", "en", "fr", "en", "en", "en", "fr", "en", "fr", "fr", "fr", "fr", "fr", "en", "fr", "fr", "en", "fr", "fr", "en", "en", "en", "fr", "fr", "en", "en", "mi", "en", "ig", "en", "en", "en", "en", "lg", "en", "en", "en", "mi", "en", "ig", "ka", "ka", "mi", "en", "en", "en", "ka", "ka", "ka", "ig", "ka", "en", "en", "mi", "None", "None", "en", "en", "ig", "en", "en", "en", "en", "en", "en", "en", "en", "mi", "fr", "ka", "en", "fr", "en", "en", "en", "fr", "ig", "en", "ka", "None", "ig", "en", "en", "en", "en", "en", "mi", "en", "mi", "en", "en", "en", "mi", "None", "mi", "ig", "mi", "mi", "en", "en", "en", "en", "mi", "en", "en", "en", "en", "en", "en", "en", "en", "fr", "en", "ka", "en", "en", "en", "mi", "fr", "en", "mi", "en", "mi", "mi", "fr", "ka", "ka", "fr", "mi", "en", "mi", "mi", "ka", "mi", "fr", "en", "mi", "mi", "en", "en", "ka", "en", "ig", "en", "en", "fr", "en", "mi", "en", "en", "en", "ig", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, true, false, false, false, true, false, true, false, false, false, true, false, true, false, false, false, false, false, true, false, false, true, true, false, true, false, false, true, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, true, false, false, false, false, false, true, false, false, false, true, false, true, false, false, false, true, false, true, false, true, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]