[{"id": "b48e474f2123517b8eddf464982e808269210d3a", "text": "READER!\n\nIf a friend placed this pamphlet in your hand, and said \"I wrote it,\" you would trust his statements. No friend could more faithfully state the facts. Every intending settler who visited our townships has located there; and, better still, is satisfied.\n\nHaving possessed unusual facilities for making a selection of lands in the most desirable parts of the North-West—our original application covered four millions of acres. Subsequently we secured out of the above an allotment to the Company of one million acres of the choicest locations out of the original tract applied for. Finally, a special selection of twenty-five townships, situate in three different districts, was made out of the area so allotted. Not one dollar was paid for these until the lands had undergone a personal inspection.\n\nAs a gratifying result of the great care thus exercised, we have had the satisfaction of knowing that our settlers who went in during the season of 1883 were invariably well pleased, even when their introduction to pioneer life took place under circumstances of special difficulty.\n\nNow, I do not ask you to believe my unsupported assertions; but I invite you to read the testimonies at the end of this pamphlet, and be convinced. If it is your desire to engage in wheat or stock raising, nowhere in America can you do better.\n\nYours truly,\n\n[Signature]\n\nToronto, Canada, February 1st, 1884.\nTopographical diagram of Township 23, in Ranges 3 and 4, West of the Second I. M., forming part of Crescent Lake Location, in the tract of the Saskatchewan Homestead Company.\nTHE\n\nSETTLERS' GUIDE\n\nTO\n\nHOMESTEADS\n\nIN THE\n\nCANADIAN NORTH-WEST.\n\nBY\n\nJOHN T. MOORE.\n\nTORONTO:\nTHE SASKATCHEWAN LAND AND HOMESTEAD COMPANY (LIMITED),\n82 KING STREET EAST\n1884.\nTHE SASKATCHEWAN\nLAND AND\nHOMESTEAD COMPANY,\n(LIMITED.)\nCAPITAL $500,000.00.\n(5,000 SHARES OF $100 EACH.)\n\nDIRECTORS:\nJOHN J. WITHROW, ESQ., President of the Industrial Exhibition, etc., Alderman, Toronto.\nREV. A. SUTHERLAND, D.D., General Missionary Secretary and Secretary of General Conference, Methodist Church of Canada, Toronto.\nJOHN T. MOORE, Esq., Alderman, Member of Council of Institute of Chartered Accountants, Toronto.\nH. E. CLARKE, Esq., M.P.P., Alderman and Chairman of City Executive, etc., Toronto.\nEDWARD GURNEY, Jr., Esq., of E. and C. Gurney, Stove and Hollowware Manufacturers, Toronto and Hamilton.\nWARING KENNEDY, Esq., of Samson, Kennedy and Gemmel, Wholesale Dry Goods Merchants, Toronto.\nDANIEL MCLEAN, Esq., of D. McLean and Co., Wholesale Leather Dealers, Toronto.\nEDWARD LEADLAY, Esq., of E. Leadlay and Co., Produce and Grain Merchants, Toronto.\nC. H. GOODERHAM, Esq., of Gooderham Bros., Grain Merchants and Millers, Toronto.\nRICHARD BROWN, Esq., of Brown Bros., Wholesale Stationers and Bookbinders, Toronto.\nW. J. GAGE, Esq., of W. J. Gage and Co., Booksellers and Publishers, Toronto.\nDENNIS MOORE, Esq., of Moore, Robinson, and Co., Iron Founders and Metal Merchants, Hamilton.\n\nPresident: JOHN J. WITHROW, ESQ.\nVice-President: A. SUTHERLAND, D.D.\nBankers: THE IMPERIAL BANK OF CANADA, THE DOMINION BANK OF CANADA.\nSolicitors: BLAKE, KERR, LASH & CASSELLS, TORONTO.\n\nJOHN T. MOORE, Managing Director.\n\nCHIEF OFFICES:\n82 KING STREET EAST, TORONTO, CANADA.\nTHE SETTLERS' GUIDE TO HOMESTEADS IN THE CANADIAN NORTH-WEST.\n\nWHILE the life of an industrious farmer in Canada is generally one of prosperity and independence, any one adopting that avocation in the older provinces should possess a considerable amount of capital, to enable him to cultivate to advantage land which he must either purchase at a high price or lease at a figure that constitutes a formidable first charge on the profits of his undertaking. In Manitoba and the North-West Territories, however, owing to the liberality of the Dominion Lands law, it is possible even yet—though the opportunity may not last long—for a person willing to become a bona fide settler to acquire a farm, comprising 160 acres of the most productive land in the world, as a Free Grant—actually free, gratis, for nothing! Such a farm may indeed be secured, without money and without price, as\n\nA FREE HOMESTEAD,\n\nupon the sole condition that the settler shall reside upon and cultivate his land for the brief term of three years. The superior liberality of the Canadian homestead law, in this respect, will be better understood by placing it\nin comparison with that governing homestead grants in the United States, under which the settler in Dakota (or elsewhere south of the International Boundary) is not given the letters patent constituting his free title to the land until he has performed settlement obligations for the full period of five years. Moreover, a settler who has already acquired one homestead farm as a free grant in the Canadian North-West is now permitted to make entry for\n\nA SECOND HOMESTEAD\n\non like conditions: This means that a man possessing the requisite energy for pioneering—a life which has its own attractions—enjoys the opportunity of successively obtaining two homesteads in six years, under the Dominion Lands Act; while in Dakota it would occupy five years to obtain, as a free grant, a single farm of 160 acres. Another superior point of liberality in the Canadian law is that which permits a settler who is so fortunate as to possess sufficient capital to enable him to farm a larger area than the quarter-section (160 acres) granted him as a free homestead, the privilege of entering for an adjoining quarter-section as\n\nA PRE-EMPTION.\n\nHe may then occupy and cultivate the entire half-section (320 acres) without any payment for three years; and, at the end of that period, on applying for letters patent for the homestead quarter-section as a free grant, he will only be required to pay for the pre-emption quarter-section the price of $2.00 (8s.) an acre. Thus, in the Canadian North-West, it costs the pioneer settler who possesses adequate means only $320 (or £64) to obtain a farm of 320 acres. The occupant of this area, however, must command some capital—say $2,000 (£400) at least—to enable him to develop his holding, which would otherwise, by the extent of acreage that must lie waste, prove a burden to himself and a hindrance to the progress of the neighbourhood.\nWHERE CAN ONE HOMESTEAD?\n\nANYWHERE in the fertile North-West a person can take up, as his homestead, any quarter (160 acres) of an even-numbered section—excepting sections 8 and 26—that he finds unoccupied, whether within or without the limits of our townships. Our purchase affects the odd-numbered sections, which, furthermore, we have agreed to settle; but, in no sense does it interfere with pioneers obtaining free grants upon the even sections. The first brigade of settlers fill up the even sections, then later reinforcements find cheap homes upon our odd sections. To all comers we say that we enjoyed unparalleled opportunities for selection, and it is a fact that we own half a million acres of the finest lands in Canada, and all easy of access. They cannot be surpassed in this or any country. Only the most intimate knowledge and careful inspection enabled us to select twenty-five townships that have been pronounced the \"cream of the Territories.\" Is better land to be found? We answer in the most positive manner—No! Here then are 900 square miles of land, incredibly rich and inviting, whereout you can select a free homestead, and we bid you welcome. The pioneer settler can thus homestead under our auspices in absolute certainty that his rights will be respected and protected. Those seeking land will be interested to learn that\n\nTHE BEST OF THE COUNTRY\n\nhas, by no means, gone into the hands of railway corporations or speculative purchasers. Without detracting from the excellence of the Railway Belt, it is scant praise to the park-country, which arches northward, to say that it is much superior to anything along the line. Enjoying a genial climate, with immunity from the high winds which frequently visit the open prairie country, the settler will in this more desirable region find a prolific soil of practically inexhaustible fertility, having moreover a better supply of wood and a greater abundance of pure water than the country farther south. These advantages will be recognized by the least experienced as conditions essential to comfort and success, for the absence of which greater immediate proximity to a railway would be found very inadequate compensation. After a careful inspection and selection,\nTHE SASKATCHEWAN HOMESTEAD COMPANY\n\nacquired certain tracts which are unsurpassed in their natural advantages, a statement which will be found amply verified by the impartial and unsolicited eulogies of those who went to see for themselves and, being satisfied, have settled on farms of their own choosing. Any misapprehension that the Company, having secured possession of the very best portions of three different sections of country, now contemplate monopolizing them to the exclusion and injury of bona fide settlers, who would otherwise occupy and improve, is entirely unfounded on fact. Such a policy would violate the agreement with the Government under which the lands were granted, inflict a grievous public wrong, and prove utterly ruinous to the Company.\n\nTHE BEST INTERESTS OF THE SETTLER\n\nand those of the Company are not antagonistic, but reciprocal. It is indeed the deliberate purpose of the Company to promote by all possible means the welfare of the settlers within their grant. Consideration of the following facts will satisfy any intelligent reader that by taking up a homestead in a township within one of the Company's tracts he will certainly have more neighbours, and will, therefore, dwell in a settlement having more social and other advantages than if he were to locate in an ordinary township in the North-West. Investigation of the terms of the agreement with the Government reveals the fact that the Company must secure at least two settlers for each even-numbered section within their townships, on the identical\n\nLIBERAL TERMS\n\nof the Dominion Lands law already explained. It is also incumbent upon the Company to place two settlers upon each of their own (odd-numbered) sections. Furthermore, it is the direct pecuniary interest of the Company to fulfil this obligation as early as possible, because every such settler introduced into their tracts is worth $160 to the organization, as a rebate of purchase-money from the Government. An equally tangible and more important advantage to the Company, however, lies in the enhancement of the value of their odd-numbered sections, as the inseparable result of improvements made by enterprising farmers residing on the intervening lands. While settlers, therefore, can take up homesteads within the limits of the Company's tracts on exactly the same terms as in any other\ntownships in which this privilege may still be exercised, the conditions under which a farmer locates in the former are infinitely more favourable to his individual success as well as to the\n\nHAPPINESS AND CONTENTMENT\nof his family. It requires no great amount of argument to prove the assertion that exactly in proportion to the thrifty population of a township will be the facilities for establishing churches, schools, stores, mills, blacksmiths' shops, etc.; and that other essential requirements, such as medical attendance, improved roads, bridges, mail communication, social, municipal, and political advantages, will correspond to the numerical strength of a community. By dividing the cost of public works of local necessity among a large number of residents, the expense, whether in money or labour, is less burdensome to the individual. The advantages above set forth, as obtainable in such a district, must exert a direct influence on the\n\nVALUE OF THE LAND;\nand, therefore, a homestead secured in a closely populated township will, in the future, not only command a higher price than a farm surrounded by uncultivated lands, but also more readily find a purchaser. In the first place, prosperous neighbours are often desirous of increasing their estates, or will make special exertions to induce relatives or friends to acquire properties contiguous to their own. Secondly, outside buyers will invariably find greater attraction in a settlement which possesses social, educational, and business advantages. Appreciating, then, the primary importance of seeking a homestead in a locality which offers some guarantee that it will be well settled up in a reasonably short period, it behoves an intending settler to carefully consider the marked superiority of the advantages he will enjoy, by taking up his land in the Company's grant.\n\nCOMPARISON AND CONTRAST.\nBy locating where our method of settlement is not in operation the homesteader goes, with his eyes open, into some township—whether in the C. P. R. Belt or to the north of it—in which twenty sections out of the thirty-six it contains will surely be disposed of to purchasers under no obligation whatever to settle on or improve the lands which they buy. These speculators will continue to hold the lands until they can be resold at the enhanced\nprice they are expected to realize as the result of the investment of labour and capital by contiguous resident settlers. What sensible man would voluntarily place himself and his family in the position of social isolation exhibited in the following diagram of\n\nAN ORDINARY TOWNSHIP.\n\n|   | H31 | H32 | H33 | H34 | H35 | H36 |\n|---|-----|-----|-----|-----|-----|-----|\n| H30 | 29  | 28  | 27  | 26  | 25  |     |\n| 19  | 20  | 21  | 22  | 23  | 24  |     |\n| H18 | 17  | 16  | 15  | 14  | 13  |     |\n| 7   | 8   | 9   | 10  | 11  | 12  |     |\n| H6  | 5   | 4   | 3   | 2   | 1   |     |\n\nEvery township contains 36 sections, always numbered as above. A section is a square mile, and contains 640 acres. Quarter sections (160 acres) are shown on the ground by stakes every half mile.\n\nAs the Dominion Lands Regulations contemplate only two homestead settlers being established on each of the even-numbered sections (just sixteen in number, omitting the reserves), there will consequently be only thirty-two residents per township, whose locations are indicated by the letters HH in the diagram. Let the settler choose his location how he may, he must inevitably suffer the disadvantage of having at least four unoccupied contiguous sections (2,560 acres) within one mile of the section in which he resides lying uncultivated, until the speculative holders' greed is satisfied or the payment of taxes becomes too onerous. Should the homesteader, however, select his farm in either of the following sections, viz.: Nos. 4, 6, 16, 18, 22, 24, 34, or 36, he must necessarily have it in immediate proximity to no less than seven sections (4,480 acres) of unoccupied lands, 3,200 acres of which are in a solid lump. In fact, out of the total area of such a township (36 sections = 23,040 acres), there would be but thirty-two homestead settlers scattered over the available\neven-numbered sections of the township (16 sections = 10,240 acres), while the remainder of its area (20 sections = 12,800 acres) would pass into the hands of speculators, and probably remain unsettled and unimproved for years. Not so the settler who locates within the Company's grant, who has an entirely different and much more cheerful prospect before him, which may be readily understood by glancing at the accompanying diagram of\n\nONE OF OUR TOWNSHIPS.\n\nThe even-numbered sections (except 8 and 26) are the free grants. The odd-numbered sections (except 11 and 29) are bought by the Company from the Government, to sell to subsequent settlers.\n\nTHE letters H H represent the thirty-two homesteaders the Company are bound to place on sixteen of the even-numbered sections of each township they hold; and the letters S S the thirty-two settlers they are required to locate on the sixteen odd-numbered sections which they have purchased of the Government. It will be observed, therefore, that in any of our townships only four sections — the school and Hudson's Bay sections — out of the total of 36 can possibly remain unoccupied and unimproved. Consequently, every homesteader locating within the Company's grant has the positive assurance that he will very soon have neighbours settled on all the contiguous lands. To more fully realize the great superiority of the advantages possessed by settlers in our townships, the foregoing diagrams are placed on the succeeding page in juxtaposition:\nANOTHER CONSIDERATION.\n\nA FURTHER inducement to the rapid settlement of our townships exists in the marked advantages and many facilities extended to those seeking locations. The popularity of the Saskatchewan Homestead Company is attributable to the cheerful liberality of the Company, the utmost fidelity with settlers, and the progressive policy adopted. Promises are carefully made and more than fulfilled. The settler, in our grant is personally benefited by the substantial direct advantages arising from location and surroundings, while the value of the farm he has taken up is indirectly being continually enhanced by the enterprise exhibited by the Company in attracting new-comers to their townships—towards the expense of which, be it observed, he is in no way called upon to contribute. Those who have not considered the subject fully will naturally enquire how the management expect to recoup the shareholders for\n\nTHE LARGE OUTLAY INVOLVED\n\nin settling up their tracts, unless in some way at the expense of the settler, for no one will suppose that they would incur so much trouble, expense, and responsibility from considerations solely benevolent. The answer is simple. By a liberal expenditure in supplying the early wants of the settlers in respect of milling facilities, mail communication, trails, etc., we have been able, at a bound, to place our pioneers in a position of vantage only attained by homesteaders elsewhere when, after years of patient waiting, they have been able, by the increase and influence of population, to supply needs which our people have never experienced. The enjoyment of these superior advantages cannot fail to promote the contentment and prosperity of those benefited, and consequently, as the appreciation of the Company's policy extends, it must surely attract numerous additional settlers of the most desirable class. With accessions to the number of our settlers, and the prosperity they will enjoy, there must come enhanced value for every acre in the townships developed under so beneficial a system. No matter what benefit may accrue to the Company as the result of their operations, it must necessarily be in exact proportion to the advantage reaped by the individual settler, to which advantage the Company primarily contribute all in their power. In no degree is the settler impoverished to enrich the Company, but all concerned participate in the enriching result of energetic development, which the Company and settler alike rejoice to promote. It should be remembered\nthat profit to the Company implies profit to the settler, and the former is the logical sequence of the latter. It cannot be too much emphasized that the interests of the Company and the settler are mutual. In forming so reciprocal an alliance, the one should see that the other possesses the enterprise and resources essential to success.\n\nPROSPECTING FOR LAND.\n\nONE of the most serious difficulties attending pioneering in the North-West is the bewildering uncertainty which oppresses the new comer as to the direction in which he should go in order to secure a farm. The Government land offices are far apart, and the information in possession of officials as to the special characteristics of such lands as may still be unclaimed is usually of the most meagre description. The Saskatchewan Homestead Company have gone to the expense of having a special topographical survey made of every section in their townships, the benefit of which information is placed freely at the disposal of the intending settler. He is thus enabled to acquire a very fair knowledge of the features distinguishing any particular part of the tract in advance of his arrival on the spot—an important aid to making his personal selection of a homestead in due course. Many advantages result from having a positive destination in view, such as the opportunity to make arrangements for stock and other effects to accompany the settler, to provide for correspondence, etc. Large parties, moreover, bound for the same point in the North-West enjoy the benefit of travelling under the specially favourable arrangements for transportation that can always be made, where numbers are concerned, by an organization intelligently directed.\n\nFRIENDLY ADVICE.\n\nHE man who takes up an official map of the immense region known as the North-West Territories would be wise to consider the utter impossibility of making a complete personal examination of the many districts of fine country in which he is at liberty to select a homestead. Is it not, then, possible for him to decide before his departure from his home—whether in the Old Country or in Canada—as to what point he will make for? Not a little embarrassing uncertainty comes from reading and comparing the rose-coloured statements of the attractions of rival localities, as presented by their respective champions. Nevertheless, it should be possible for an\nintelligent man to satisfy himself, by the testimony of disinterested persons, confirming the reports of those specially concerned, that the lands in some townships, at any rate, possess all the advantages claimed for them. A man who goes out to discover for himself the best farm to be had in the North-West will travel for a long time before he is satisfied, but it is easy to predict where he will finally bring up. It will be just in that township—whether good, bad, or indifferent—where his money is gone, or in which he is discouraged from proceeding further, either because his horses are worn out, his waggon is broken down, or his provisions are exhausted. At this point he will make his location, and then repine over his waste of time and of the better opportunities of selection he has allowed to escape him. The man who will take the trouble to satisfy himself as to the right part of the country before he starts will find himself eventually this much ahead: (1) He will have in his pocket the money he would otherwise have spent on provisions and suitable outfit during a long search; (2) He will have saved the severe wear and tear of his horses, harness, and waggon during the same period; and (3) instead of having wasted just so much time, every day after his arrival in the country will have been profitably occupied in breaking, house-building, or putting in crops, representing good value for the labour thus expended.\n\nTHE COMPANY'S TOWNSHIPS.\n\nHAVING decided, for the substantial reasons already mentioned, that it is clearly to his interest to seek a location in a district respecting which he can obtain some precise intelligence beforehand, the intending settler has next to consider the inducements and advantages presented to him; and the SASKATCHEWAN HOME-STEAD COMPANY submit the following information, in full confidence that those interested will appreciate the candour with which it is set forth.—The lands which the Company have undertaken to colonize comprise over half a million of acres, contained in twenty-eight of the very finest townships to be found in the North-West. They present a choice of three different locations, as follows:\n\nCRESCENT LAKE SETTLEMENT (9 TPS.),\nIn Assiniboia, consisting of Townships 25 to 30, inclusive, in Range 1; Township 26, in Range 2; Township 23, in Range 3; and Township 23, in Range 4—all west of the Second Initial Meridian.\nNORTH ELBOW SETTLEMENT (6 TPS.)\n\nIn Saskatchewan, consisting of the portion of Township 39, lying north of the Saskatchewan River, in Range 8; the portion of Township 39, lying north of the river, and Township 40, in Range 9; Townships 39 and 40, in Range 10; and Townships 39 and 40, in Range 11—all west of the Third Initial Meridian.\n\nRED DEER SETTLEMENT (10 TPS.)\n\nIn Alberta, consisting of Townships 37, 38, and 39, in Range 26; Townships 36, 37, 38, and 39, in Range 27; and Townships 36, 37, and 38, in Range 28—all west of the Fourth Initial Meridian.\n\nTHROUGH being early in the field, the promoters of the undertaking had unusual advantages in making their selection, and were guided in their choice by certain leading principles. They knew that the proportion of desirable land lying south of the Canadian Pacific Railway formed but a very small part of what has been hitherto defined as the\n\nGREAT WHEAT-GROWING BELT\n\nof the Continent; and that, though there was good land within the C. P. R. reserve, there was still better country to the north of it. Besides good land, it was necessary for general settlement purposes to secure tracts in districts sufficiently well wooded with timber of useful size, and in those, moreover, having an abundant supply of pure water and also perfect drainage facilities. This last desideratum was only to be secured by choosing a location, as shown below,* on the second prairie steppe.\n\n*This illustration is a reduction of the diagram showing the profile of the 51st parallel of north latitude, as given in the Report of the Assiniboine and Saskatchewan Exploring Expedition, by Prof. Henry Youle Hind, M.A.\nBy having good natural drainage for his farm, the settler is not only safe against such floods as may occasionally submerge certain lands in the valleys of the Red and Assiniboine Rivers; but he can obtain a warm, dry soil, capable of producing earlier crops, which are more certain to reach maturity. He and his family will also enjoy the advantage of residing in a locality characterized by more healthful conditions than those of a low-lying country. As regards the wood supply, it was deemed essential to select townships that should contain such a proportion of timber, and so equally distributed, that every settler would have an abundant supply for building, fuel, and fencing purposes. This was considered highly important, also, because experience has proved that in the portions of the North-West with an abundance of growing trees there is an entire\n\nIMMUNITY FROM BLIZZARDS,\n\nwhich sometimes occur in the open prairie region. Groves of even moderate size constitute wind-breaks, and thereby contribute to the comfort of man and beast in a very appreciable degree. Special information, obtained at no inconsiderable trouble and expense, led to the belief, now fully confirmed, that in the region north-west of Fort Ellice there existed a country possessing all the features above enumerated, and also distinguished by a longer summer and milder winter than the country farther to the east—just as the climate of Ontario is less rigorous than that of Quebec. Lying rather out of the range of ordinary travel, and requiring a person, at that time, to provide his own facilities for transportation, land hunters had not explored this locality, a fact which sufficiently accounts for its substantial advantages, as well as park-like beauty, having been until lately very little known even in the Province of Manitoba, the western boundary of which approaches it quite closely.\n\nCRESCENT LAKE SETTLEMENT,\n\nEXHIBITED on the accompanying maps, consists primarily of the two townships which contain portions of Crescent Lake, appropriately so called on account of its being in the form of a quarter moon. This beautiful sheet of water, pure in quality and excellent for every domestic purpose, abounds with fish, the curing of which\nfor winter consumption used formerly to be carried on upon a considerable scale by provident Indians living in the vicinity. The soil of these townships is of a rich black loam; there is excellent drainage afforded by gentle descents; prairie and woodland are advantageously blended; good hay meadows abound; plenty of timber for fuel, fencing, and building purposes exists within the easy reach of every settler; while last, but by no means least, there are sufficient brick-clay, sand, gravel, limestone, and other material convenient for the erection of substantial and permanent buildings.\n\nSEVEN SPLENDID TOWNSHIPS\n\nlying to the north-east of Crescent Lake, and along the Second Initial Meridian, are in no sense inferior to Townships 23 in Ranges 3 and 4. They are distinguished by the following important features—rich soil, good water, plenty of wood (including poplar, maple, beech, and birch), and abundance of hay. The land of all the nine townships may be described as having a gently undulating surface. The soil is a rich clay loam, from 12 to 20 inches deep, resting upon a clay subsoil, thus constituting wheat-growing land par excellence, the secret of its great fertility being the large proportion of silica which it contains. The climate of Crescent Lake is such that spring comes from two to four weeks earlier than in Manitoba. A good many settlers have already found their way in, but, as the first arrivals only located in 1883, there is still an opportunity to select any particular kind of farm, according to whether the special object desired be agriculture, stock-raising, or the practice of both industries in combination. While it is not possible to go astray in the selection of a farm that must become a valuable property on its own merits, there is now the additional consideration of—\n\nGREAT RAILWAY FACILITIES\n\nbeing shortly enjoyed by residents within our townships, seeing that the projected routes of at least two important roads must traverse some portion of the Company's tract. Having regard to the objective points for which these lines are heading and the physical characteristics of the intervening country, engineering considerations make it impossible for our townships to be given the \"go by,\" even if there were any desire to ignore the claims of what must before long become populous settlements. Indeed, we have the best reasons for believing that the disposition of the projectors of these lines, who take a practical business view of the matter, is to extend every advantage\npossible to the townships likely to produce the most traffic for the railways in which they have invested their capital. It is\n\nNO AGGERA\n\nto say that in this favoured locality every condition of happy and prosperous settlement will be found. The Company, however, do not desire to base entirely on their own representations the peculiar advantages possessed by the townships they are colonizing; but would rather refer all who wish to satisfy their minds on the subject to the unbiased testimony which will be found in this pamphlet, particularly to the expressions of contentment with their choice emanating from settlers who went in during the season of 1883. It should be observed that many of the expressions quoted were not addressed to any representative of the Company, but are extracts from private letters to relatives and friends, the originals of which may be perused on application.\n\nTHE SPECIAL ADVANTAGES OFFERED.\n\nTHE Company have already been at no inconsiderable expense and trouble to relieve pioneers to as great an extent as possible from having unnecessary obstacles to encounter in their start. Their outlay includes such items as inspection, reports, surveys, topographical maps, opening of roads and trails, procuring the services of guides, purchase of saw-mill and wood-working machinery, arranging for transport, and the providing of tent and other accommodation for pioneer parties. The Company have, moreover, by importing waggons, ploughs, and other agricultural implements, wholesale and by the carload, been able to supply their settlers with such necessary articles at 15 per cent less than the retail prices in Winnipeg or Brandon. Special arrangements were also made for the establishment of mail-communication with Broadview, the nearest post office having a daily mail, so that our settlers were able to receive letters and newspapers with promptness and regularity. Those who contemplate proceeding to the Company's lands will be naturally interested in the question as to how Crescent Lake may be reached, which can be answered definitely and satisfactorily as follows. Our first party went through from Toronto to Qu'Appelle—a distance of 1,721 miles—in four days and eighteen hours, making the best time on record for a mixed train. Nowadays our settlers do not require to proceed by Qu'Appelle station and Fort Qu'Appelle to their destination, as a shorter and much better road has been opened up from Broadview station, on the Canadian Pacific Railway, as shewn on the index map upon next page.\nATEST information respecting transportation of intending settlers and their stock, or other effects, will be furnished on personal application at the chief office of the Company, 82 King Street East, Toronto, or on receipt of enquiries by mail addressed to \"John T. Moore, Toronto, Canada.\"\n\nCRESCENT LAKE\n\nwas the starting-point of the Company's operations. The site, which has already been surveyed, was selected on account of the great advantages of the situation as a centre of supply not only for the settlers in Township 23, in Ranges 3 and 4, but for the population that will shortly occupy the surrounding-country, including the Company's seven splendid townships to the north-east. Crescent is situate in Section 18, Township 23, Range 3, with beautifully picturesque and park-like surroundings, and it possesses every facility for perfect drainage. As a general table of distances will be found elsewhere, it is only necessary to mention here that Broadview Station, on the Canadian Pacific Railway, is distant about forty miles, and may easily be reached in a day's drive over a capital natural road. The crossing of the River Qu'Appelle is effected by means of a ferry established by the enterprise of the Company, and is at the disposal of settlers and others free of charge. The many incidental benefits enjoyed cannot be enumerated here, but it may be named that the Company have expended some money on the improvement of the ascents from the valley to the table-land, which rises to a height of 200 or 300 feet on either side. As the traveller from Broadview, bound for Crescent, approaches the southern limit of Township 23, he enters a country very attractive in its picturesque beauty. The broad and\n\nFERTILE PRAIRIE\n\nbecomes diversified with clumps and copses of wood. From every little pond or stream the mallard ducks rise in flocks, while every now and again prairie chickens (or, more properly speaking, \"pinnated grouse\") cross the road to seek fresh covert in the luxurious herbage. An occasional deer may come in view of the sportsman on the look-out for large game, but, as a rule, the \"antlered monarch of the glen\" must be sought in order to be\nfound. The vigorous character of the trees and the rank growth of the various grasses, with which will be found intermingled large quantities of wild vetches, pea vines, etc., fully attest the general excellence of the soil. In the meadow lands, however, grass is found growing so tall that a man on horseback becomes lost to view when he rides into it.\n\nCRESCENT LAKE\n\nhas already been mentioned, but it is difficult to describe in words, the beauty of the landscape of which it is the chief ornament. Unlike most of the lakes in the North-West, this beautiful sheet of water has a well-defined shelving beach, surrounded by a fringe of wood. On the islands in its centre there are some beautiful specimens of the ash-leaved maple and other indigenous woods.\n\nA SAW MILL,\n\nwith wood-working machinery for producing matched, dressed, and moulded building material, has already been set up at Crescent City; it is worked by an engine of 35 horse-power. There is a depot for waggons, harness, and agricultural implements of all kinds, a general store, and a blacksmith's forge. The canvass hotel in operation during the spring of 1883 did a thriving business, to be still carried on in a structure of a more substantial kind. Several mechanics, representing various branches of the building trade, have already taken up their abode in the settlement. Lime of local production will be available for the erection of concrete houses, for which durable and weatherproof class of dwelling the requisite material may be obtained in abundance on the spot. A clay of the most suitable kind for brickmaking is readily available, so that the building question presents no difficulties in this favoured locality.\n\nEMPLOYMENT DURING THE WINTER\n\nfor energetic settlers and their teams will be found in getting out logs for the saw mill at Crescent. It is proposed to make as large a cut as possible in order to supply the demand which must arise with the progress of settlement and increase of population. Among the miscellaneous industries already represented in the settlement, in addition to those already mentioned, are the trades of baker and confectioner, tinsmith, pump manufacturer, cabinet-maker, and machine repairer. So soon as the first business of breaking some land and erecting houses has\nprogressed sufficiently, the value of having in the community such a variety of handicrafts will become apparent. A very important item, however, in the future economy of the settlement is the erection of a\n\nROLLER LOURING MILL AT CRESCENT.\n\nNo expense is being spared in securing the most effective machinery. The mill will be completely equipped, according to the Hungarian roller system, with all recent improvements, so as to produce patent process flour of the very highest grade. This will prove a great boon to the settlement, and save the time and money of our people. In supplying this mill and other conveniences for the benefit of our settlers, it should be distinctly understood that the Company seek to establish no-monopoly, but that their purpose is simply to meet the requirements of pioneer settlers. Private enterprise will soon be equal to the task of supplying all the wants of the community.\n\nNORTH ELBOW SETTLEMENT.\n\nThe Company have secured at \"the Elbow\" of the North Branch of the great Saskatchewan River about six townships, as shewn in red on the annexed map.\n\nProf. John Macoun, writing of the locality, remarks: \"When digging up the prairie soil, even in the hardest clays, I could never get below the roots of the grass; and these\nwere so numerous that they seemed to fill the soil. Owing to the severe winter's frost and the light rainfall in spring, the young roots are enabled to penetrate the soil to a depth wholly beyond the belief of an eastern farmer. They seem to follow the pores opened by the frost right into the subsoil; and hence, instead of drawing their nourishment from four or five inches of soil, they draw it from eighteen or twenty-four inches.\" These townships are\n\nWELL TIMBERED\n\nwith poplar and other useful woods. \"Squatters\" would do well to bear in mind that the even sections in some of the above townships have been withdrawn from our control by a reservation in our agreement; it will consequently not be in our power to give free homesteads in these particular townships. The action of the Government, it is natural to suppose, has been based on the belief that\n\nAN IMPORTANT CITY\n\nmust necessarily soon rise to notice in the vicinity of the Elbow, and that the lands in the even-numbered sections were too valuable to be permitted to remain in the class available for acquisition as free grants. In this opinion most people will concur. The North Saskatchewan has already established its reputation as a valuable artery of communication between the east and west, being navigable, with few obstructions of consequence, from Lake Winnipeg to Edmonton, a distance of over 900 miles. The steamers, formerly belonging to the Hudson Bay Company, which ply on this stream throughout the summer season are now the property of the Manitoba & North-Western Transportation Company, whose fleet is constantly being augmented in number and power as the demands of passenger and freight transportation increase. Our settlers at the Elbow, however, will not long be without\n\nRAILWAY COMMUNICATION,\n\nas various projects are already in progress of realization which promise shortly to solve this question. The Manitoba & North-Western Railway, which is being built north-westward from Portage la Prairie, will certainly supply transportation facilities at no distant date to our farmers in Crescent Lake Settlement. At present Prince Albert is the objective terminus, but it is by no means unlikely that the Elbow may be substituted as a more suitable point at which to connect with the steamboat navigation of the North Saskatchewan. In such matters\ncommercial necessity will be found to invariably overrule all other considerations. The Canadian Pacific Railway Company, again, are more likely to carry their Assiniboine Branch, which also traverses our Crescent Lake Location, to the Elbow than to Fort à la Corne, as at present indicated on their maps, for the very sufficient reason that such branch would, if it reached the Saskatchewan at the former point, be well situated for continuation throughout the Great Wheat-growing Belt, while at Fort à la Corne it would have reached the northern limit of the country deemed attractive for agricultural settlement. There is, however, a project more definite than either of those already mentioned which promises to give our townships at the Elbow.\n\nAN EARLY CONNECTION\n\nwith the main line of the Canadian Pacific Railway. We refer to the undertaking of the Qu'Appelle, Long Lake, and Saskatchewan Railroad and Steamboat Company, which obtained a charter from the Dominion Parliament during the session of 1883. Section 2 of the Act incorporating the Company gives the following authority, which is quoted verbatim from the statute:\n\nThe Company, their agents, and servants may lay out, construct, and operate a single or double iron or steel railway from a point at or near Regina, the Capital of Assiniboia, in the North-West Territories, to some point on the North Saskatchewan River at or near the 107th degree of longitude, etc.\n\nTHE 107th degree of longitude crosses the North Saskatchewan River at the Elbow, and it is, therefore, clearly the expressed object of the promoters of this enterprise for their road to connect with steamboat navigation near that point. The provisional directors of the Company are prominent gentlemen largely interested in the development of the North-West. Finally, the Souris and Rocky Mountain Railway, whose charter authorizes it to be built according to the route shewn on the map, which has been approved by Order in Council, is now being constructed with considerable energy. This line starts from Melbourne Station, on the Canadian Pacific Railway, and passes, in a northwesterly course, through Rapid City and Fort Ellice. Continuing through the fine stretch-of-country north of the Qu'Appelle Valley, it will, no doubt, traverse some portion of Crescent Lake Settlement, as well as afford, at no distant date, communication of a very direct kind with our townships at the Elbow of the North Saskatchewan.\nTHE SETTLERS' GUIDE.\n\nLATEST information as to the best way for passengers and freight to reach our North Elbow Settlement will be furnished on application at the chief offices of the Company, 82 King Street East, or in reply to correspondence addressed to \"John T. Moore, Toronto, Canada.\"\n\nRED DEER SETTLEMENT.\n\nThe ten townships which, happily, have been secured on the Red Deer River, where it is crossed by the Fifth Initial Meridian of the Dominion Lands Survey system, though apparently the most remote of the three tracts composing the property of the Company, nevertheless promise to be ultimately of the greatest importance. According to various explorers the river at this point is over 150 yards wide, with clear water running over a pebbly bed. Blind Man's River, which joins its waters with those of the Red Deer in Township 39, Range 26, is about thirty yards wide.\n\nThe best authorities state that the Red Deer River is navigable from the Company's townships to its confluence with the South Branch of the Saskatchewan. Mr. Montague Aldous, D.T.S. (now surveyor-in-chief to the Hudson's Bay Company), who ran the Fifth Initial Meridian in 1880, reported officially of the locality to the Government in the following words:\n\n\"From Swan Lake to the Red Deer River, and south of the Red Deer River to the northern limit of true prairie land, in latitude 51° 50' N., is a magnificent stretch of partially wooded country, with a rich black loam soil. I am not prepared to say how far this particularly fertile belt may extend up or down the river; but, from personal observation, I know it extends downward at least as far as the mouth of Blind Man's River.\"\nWith reference to the river itself Mr. Aldous says:\n\n\"The Red Deer River is a fine stream, about 150 yards wide, similar in appearance to the North and South Branches of the Saskatchewan. I crossed it when the water was low, and found the depth varying from four to five feet. I have never heard of there being any rapid or other impediments to navigation between this point and its confluence with the South Saskatchewan, and I am of the opinion that steamers such as run up to Edmonton will, in the future, navigate at least as far up as this point.\"\n\nCapt. Palliser, R.E., who explored this region for the Imperial Government, reported having seen coal strata on both banks of the Red Deer—at many places fifteen feet thick. He says, \"It burns without flame, but keeps ignited for a considerable time and gives out good heat, leaving ashes similar to those of wood.\" The same officer describes this attractive neighbourhood as having \"rich soil and pasture.\" He also reports the river navigable from this point down to the South Branch of the Saskatchewan.\n\nTHE SOIL\n\nof our Red Deer Settlement is generally a rich black loam, and the land is well timbered with poplar and spruce. The prospects of early rail communication, as well as of steamboat navigation being soon established, are very promising. The official map of the Canadian Pacific Railway indicates a projected \"Calgary Branch\" from the main line at Calgary to Edmonton, to be continued on to the Peace River, traversing several townships of our tract and crossing at the confluence of the Red Deer and Blind Man's rivers; and there is every probability that construction will be commenced at no far distant date. The point on Red Deer River where the railway must cross cannot fail to become a very important commercial and\n\nMANUFACTURING ENTREPÔT,\n\nthe locality being the natural centre of distribution for the great prairie region to the south-east of the lumber to be manufactured and coal to be mined on the head waters of Red Deer River and its tributary streams. The unlimited supply of both wood and coal in this district may be to some extent understood by the following remarks of Capt. Palliser, with reference to Dead Man's Creek and the Red Deer River, into which the creek's waters flow from the south-east:—\"Spruce in fair abundance, and luxuriant vegetation in low valley of creek. Found coal-beds in this creek which were on fire, and far along the banks of Red Deer River, where coal appeared, the spontaneous fire was in activity.\"\nTHE best route by which to reach our Red Deer Location, at time of writing, is the Edmonton trail from Calgary, which passes through it. The distance is about eighty miles; and already a weekly line of stages affords excellent facilities for travellers and baggage. For latest information and special arrangements as to transportation, apply to \"John T. Moore, Toronto, Canada.\"\n\nTHE CLIMATE\n\nof the several tracts of the Company will necessarily exhibit a little difference, according to locality. There will be some identity found, however, in this respect in the settlements at Crescent Lake and the Elbow, experience showing that the spring sets in at least two weeks earlier than in Manitoba, thus affording longer time to the farmer to get in his seed, and diminishing the length of the period during which stock must be fed. The Red Deer Settlement, which will enjoy the benefit of the Chinook winds, as the soft breezes from the Pacific Coast through the Rocky Mountain passes are called, will be characterized by a climate milder than that of the other tracts, on account of which stock will do well out of doors for the greater part of the winter season. One advantageous peculiarity of the North-West, very interesting to the new-comer, is the\n\nEXTRAORDINARY LENGTH OF THE DAYS\n\nduring the summer time in these northern latitudes, resulting chiefly from the greater and more prolonged refraction of the sun's rays. Thus, during the summer months, daylight lasts from soon after 3 a.m. till 10 p.m. Consequently, it is possible for a judicious farmer to get through a fair day's work in the cool of the morning and evening, and arrange for himself and his team to enjoy a comfortable siesta during the heat of the day. Throughout the North-West Territories—the residents enjoy the luxury of cool nights even during the hottest weather, so that both men and animals are enabled to recuperate by refreshing sleep the energies exhausted by a hard day's toil. The great length of the days, together with the power of the rays of the sun exerted during the summer months, fully accounts for the rapid strides by which the various cereals reach maturity. Then, the cool night-time condenses such copious dews as astonish the stranger, and impart refreshment and stimulus to vegetation. The warm sunshine by day and the dewy bath by night furnish the key to the amazing growth and quick maturity peculiar to the climate.\nTHE AVERAGE YIELD\n\nper acre of crops in the North-West is shown by an official publication recently issued to be as follows:\n\n|                | CANADIAN NORTH-WEST | MINNESOTA | WISCONSIN | IOWA |\n|----------------|---------------------|-----------|-----------|------|\n| Wheat          | 28                  | 17        | 13        | 10   |\n| Oats           | 58                  | 37        |           | 28   |\n| Barley         | 38                  | 25        | 20        | 22   |\n| Potatoes       | 300                 |           |           |      |\n| Carrots        | 300                 |           |           |      |\n| Onions         | 250                 |           |           |      |\n| Turnips        | 800                 |           |           |      |\n\nN.B.—The United States make no pretension to compete with the Canadian North-West in root crops.\n\nThe comparative returns, based on official statistics, throw the boasted results of farming in the United States altogether into the shade.\n\nTHE LAND IS SO RICH\n\nthat fertilizers will not be required for many years, so the farmer enjoys a practical saving of a certain annual outlay required in the older Provinces. Still, we cannot approve the wasteful practice of certain farmers who have been accustomed to burn their straw and throw their stable manure into the river, instead of feeding the former to stock, and spreading the latter upon their land. It may be true that soil which has grown successive crops of wheat for eighty years shows no signs of exhaustion. Nevertheless, the stiff clay loam which can support such a drain would be all the more easy to work if it received an occasional admixture of an extraneous element.\n\nWILD FRUITS\n\nare found in abundance, according to season. The varieties include the strawberry, raspberry, whortleberry, black currant, plum, cherry, and the low and the high bush cranberry, as also a profusion of hazel nuts. Wild hops are also seen in many localities growing with great luxuriance, and by cultivation would become a very important product for commercial export. Sugar of the most palatable quality may be made from the maples growing at Crescent Lake.\n\nSTOCK RAISING\n\nwill be found as profitable an avocation as agriculture in either of our tracts, as the townships composing them were purposely selected on account of the nutritive natural\ngrasses growing on the land, and of the existence of sufficient timber to provide the necessary amount of shelter for animals. The third requisite—plenty of wholesome water—is also present in abundance.\n\nSCHOOLS AND CHURCHES\n\nare deemed prime essentials to the well-being of a new community in the North-West, and settlers are always ready to combine their labour and resources to secure these desiderata so soon as possible. Pending the arrival of the time when each denomination can organize in sufficient strength, they readily co-operate for the attainment of what are considered public requirements. At Crescent Divine Service has been regularly held upon Sunday, and a Bible-class of twenty-four members, conducted by a former Sabbath School Superintendent, is in successful operation. Before long a commodious church will afford ample facilities for all religious gatherings. The Company will give substantial aid to every project calculated to promote the educational, social, and moral welfare of the people. This fact alone will influence the decision of the better class of settlers, so that under the Company's auspices the most desirable neighbourhoods will be found—a matter of great moment to a man and his family.\n\nMARKETS\n\nfor the products of new settlements will in the first years of their formation always be largely local, as the newer arrivals must obtain their supplies for seed as well as sustenance from the pioneers who have preceded them. In this connection, the Roller Flouring Mill, already referred to, cannot be over-estimated. Farmers can take their wheat to the mill, and carry back home with them the product in flour. The various railway lines built and projected, as well as the facilities afforded by navigable rivers, guarantee the residents of our tracts against being shut out from the chief markets of the world. They will, at any rate, be assured of ample communication with the Eastern Provinces, and with the United States; and their grain of the future may reach Europe from ports upon the Atlantic-seaboard or on Hudson's Bay. Indeed, our tract at present the most remote—Red Deer Settlement—will, perhaps, eventually enjoy superior advantages, as its situation will render it an important point for shipping wheat and flour to the mining and stock-raising districts of Montana and Idaho; while the completion of the Panama Canal will, before long, afford a new route for transportation from the Pacific terminus of the Cana-\ndian Pacific Railway, an economic consideration of the highest importance. Now that hopes are held out of the completion of these great national undertakings by 1886, their bearing upon the prospects of settlers or investors in the Company's tracts may well be taken into present consideration.\n\nNO SPECULATIVE SQUATTERS,\n\nwhose object is to hold land without making the improvements required by law, will meet with encouragement from the Company. Indeed, every lawful obstruction will be placed in the way of a class whose operations are palpably prejudicial to the prosperity of the bona fide settler. In the interest of the latter, therefore, as well as to ensure the Company against loss of rebate through default on the part of persons obtaining homestead entries, every farmer applying for a homestead entry within our tracts is informed that he is expected to execute a certain minimum of improvements on his claim during each successive year.\n\nTHE TERMS FOR PURCHASE\n\nof the Company's own lands, which are comprised in the odd-numbered sections of the townships composing the several tracts, will be found to offer great inducements to those who desire to acquire farms in the midst of settled districts, in this way avoiding the temporary hardships and inconveniences which the pioneers who secure free grants have necessarily to put up with. After the even-numbered sections have been occupied and improved, purchasers of odd-numbered sections will in all cases enjoy the advantage of obtaining farms surrounded by lands already under cultivation and occupied by resident settlers. The accompanying diagram serves to show at a glance how one of the Company's sections is situate in relation to the farms of the surrounding homesteaders, the position of whose dwellings is approximately indicated by the letters HH. It will be seen that there must be at least eight resident neighbours within one mile of a section that the Company offers for sale. That number, however, suggests a minimum. In many cases we have been successful in establishing three settlers on each of the adjacent even-numbered sections, which has thus increased the number of resident families within one mile of the odd-numbered section placed in the market.\nA SPECIAL FEATURE,\n\nthat we submit for the consideration of well-to-do parents in Great Britain and Canada is the advantage which our system of settlement offers for establishing their sons as independent agriculturists on farms of their own. It is not an uncommon thing in England for three hundred guineas (about $1,500) to be paid with a youth articled to a profession. He is then expected to give his services, without remuneration, for five years, in consideration of the knowledge that he is afforded (more or less) opportunities of picking up. It is also not at all unusual for a gentleman to pay an equally large sum that his son may learn agriculture or stock-raising of some practical farmer, who would render no equivalent for the services of his pupil during the term. Now, both money and time can be saved by taking advantage of our method of colonization. The Company are prepared to sell farms in the odd-numbered sections of their townships on specially favourable terms to persons who will engage to settle on the lands themselves or establish their sons thereon. By availing themselves of this opening purchasers may secure properties in the heart of\n\nOUR SETTLED TOWNSHIPS,\n\nand, if not convenient to them to take possession in person, they can delegate to their sons the congenial duty of developing the estate. No special course of instruction for which money has to be paid out is at all required. A gentleman's son, taking possession of his father's farm in one of our odd-numbered sections, has only to watch the operations of the practical farmers resident upon homesteads in the contiguous even-numbered sections; and he will find them ever ready to impart the benefit of their knowledge and experience to anyone seeking it. They will, moreover, be willing to help a stranger to erect his house and outbuildings in exchange for such services in the field as he will be glad to proffer to his kindly mentors, if he be a young fellow of the right sort, in order that by actual experience of their methods he may \"get his hand in.\" If he should prefer to board with a family until his own domestic arrangements are completed, or if he should tire of\n\nTHE CHARM OF CAMP LIFE,\n\nhe can exchange the ennui of a too solitary picnic for the social attractions presented by some neighbouring farmstead, where refined tastes, and possibly bright eyes, may\nbe features of particular interest. It is something, at any rate, for parents to know that their boys, when entering upon the worthy avocation of bringing under cultivation the virgin soil of a new land—virtually making \"the wilderness to blossom as the rose\"—will not be condemned to social ostracism even at the outset of their undertaking. It will be gratifying to them also to feel assured that the adventurers will not be shut out from the\n\nRELIGIOUS AND MORAL INFLUENCES\nthat invariably exist in a community largely composed of families belonging to circles of the highest respectability in various parts of Canada. The Company will readily consent to act as the intermediary of settlers willing to receive young men as temporary boarders in their families and of those who desire to avail themselves of such accommodation; and their Local Agents will in all cases do their best to facilitate arrangements to the satisfaction of the parties mutually concerned. The requirements of capitalists wishing to purchase land for personal occupation, and as\n\nA PRODUCTIVE INVESTMENT,\ncan be accommodated. Farms may be purchased of the Company in sections of 640 acres upon condition that another settler besides himself be located by the purchaser on a separate quarter-section of such land. This arrangement will specially accommodate the purposes of capitalists who desire to bring their land under thorough cultivation in advance of their own occupation, or who wish to benefit relatives or friends by affording them temporary use of the property as an equivalent for improvements to be effected, while retaining the full rights of proprietorship in their own hands. Finally, the\n\nPRICE OF OUR LANDS\nwill necessarily vary according to the topographical features of the section in question, its situation, and the extent of settlement in its immediate vicinity; nor can the Company undertake to hold lands for any length of time at a fixed price. As settlement progresses under the system we have adopted, each stage of a township's development may be expected to produce a corresponding increase in the value of all the land within its area. The current prices of lands in the different tracts of the Company, together with the conditions of purchase, may always be ascertained by direct application to our head offices or by enquiry of our authorized agents in the tracts.\nWHEN TO ARRIVE.\n\nA MAN of means may advantageously take up land at any period of the year, as in winter he can devote himself to the erection of buildings, and to the getting out of fencing material. In his case, a few month's maintenance is a matter of very small concern. A person of limited funds, however, intending to homestead, should endeavour to go upon his claim as early in the spring as his oxen can find natural food—say about the middle of April. Unless the settler is in a position to purchase oats, he should work his land with oxen instead of horses until he has been able to produce a crop. From the beginning of April to the end of July is the proper period for \"breaking\" wild land, as the first ploughing is called. The sod will be found sufficiently rotted in September for \"backsetting\" to be done. Oats, beans, and potatoes may be raised with profit the first season, and fair crops of wheat have also been obtained; but, except in the case of roots and vegetables, the immediate cropping tends to retard the effectual rotting of the turf. The space at our disposal does not admit of our entering into full details in connection with the interesting subject thus lightly touched on; but anyone desiring full and trustworthy information can readily obtain (gratis) a valuable batch of literature, agricultural and statistical, by requesting \"The Secretary, Department of Agriculture, Ottawa, Canada,\" to forward pamphlets respecting the North West.\n\nLATEST information as to the best way for passengers and freight to reach either of the Company's settlements will be promptly furnished, on application, either personally or by letter, by\n\nJOHN T. MOORE,\nManaging Director\n\n82 KING-STREET EAST, TORONTO,\n\nCANADA.\nTRUSTY TESTIMONIES.\n\nTHE SETTLERS SPEAK.\n\nSpontaneous opinions, intended for the guidance of the friends and relatives of the writers, will prove more convincing than anything the Company might say. Could the reader of these pages peruse the scores of calm, earnest, and commendatory letters in our possession; he would be eager to share the advantages. More wonderful still, there is not a single dissenting voice!\n\nCRESCENT LAKE SETTLEMENT.\n\nMr. GEORGE MCBAIN (late of Toronto), writes:—\"I am most delighted with the country, and say you have not over-rated it one iota.\"\n\nMr. GEO. ADDISON (late of Galt, Ont.), writes:—\"Mr. Eakin says the Eldorado have a good section, and have sown some grain. They are pleased with their land.\"\n\nMr. THOMAS EVANS (late of Yorkville, Ont.), in a letter to his wife, says:—\"We saw the two farms, and are quite satisfied with them. As soon as Mr. Outhwaite had finished going round his land he said, 'Well, it's splendid.'\"\n\nMr. CHARLES BARRAS (late of Toronto), says:—\"Am very well pleased with the country; find it all as represented. The country looks splendid—never saw better farms anywhere.\" Mr. Barras, who settled on the R.W.½ of Sect. 6, Tp. 23, R. 8, returned to Toronto, in September, to complete arrangements for more extended operations upon his farm, and on the 19th of that month said:—\"The saw mill was actively running when I left. The settlers generally are preparing their winter quarters. A bountiful supply of hay has been put up.\"\n\nMr. W. EAKIN (late of Unionville, Ont., ex-Warden of the County of York), who settled on the N.W.½ of Section 10, Tp. 23, Range 8, referring to the district between the Canadian Pacific Railway and our settlement as to timber, lay of land, and quality of soil, says:—\"It is not nearly as good as what I have seen in our townships.\" He also writes—\"I thought it might be important news to inform you that I have cut and drawn from the banks of Crescent Lake some few poplar logs of a quality I did not expect to find in any portion of this section of country. I may honestly say, that the butts of some of the logs are tough enough to be made into first class axe-handles. In fact, I consider the timber so good that nothing is into flooring is not what it should be used for.\"\nMrs. JOHN ATKEY (late of Muskoka) writes:—\"My husband wrote to me since his arrival; he is quite pleased.\"\n\nMr. GEO. S. THOMSON (late of Toronto) writes:—\"I may say we are both thoroughly well pleased with the country. I have not seen better lands. Game is plentiful up here; and the boys say they have got quite tired of shooting them now, for they can easily knock them down with sticks. I have been in good spirits and splendid health since I came up here, having gained 10 lbs., and I never felt better in my life.\"\n\nMr. EDWARD OUTHWAITE (late of Yorkville) writes:—\"We are as happy as the day is long. Advise Mrs. Outhwaite to sell out; there is too much worry in business. Mr. Moore, I find this place just as you said. It is quite a park. I have not seen anything like it in Ontario. The land is good—wood is plentiful—water splendid.\"\n\nMr. THOMAS EVANS (late of Yorkville), writing to his wife and Mrs. Outhwaite, says:—\"Oh, it's glorious work planting your own 'faters' on your own land—and such land! Neither of us ever saw the like before. We have both got most beautiful farms, and Outhwaite has chosen a quarter section for Mrs. M. He says they are well worth $2,000.\"\n\nMr. WILLIAM H. THOMSON (late of Toronto), who went up in June, writes to a friend:—\"Well, we are at present very comfortably settled on our farms. We have got a very snug house up—12 x 15, and also a well dug six feet deep. We are blessed with the very best of water; that is one great advantage in this country. We have got twenty acres ploughed, or thereabouts. There are lots of prairie chicken, ducks, and geese. We had prairie chicken and rabbit for dinner to-day. When I got up yesterday morning I went outside, and there was a beautiful deer standing about 100 yards from our door, but he put off pretty lively.\"\n\nMr. GEORGE DEACON (late farming in the Isle of Man), who, with his son, has taken up the north half (320 acres) of Section 18, Tp. 23, Rge. 4, writes to a friend in Toronto:—\"It is all that is desirable. There is fine sport—all sorts of game you can name. The ponds on our land swarm with duck, and there are prairie hens like partridges. The lake is 8 miles long and full of fish 10 lbs. in weight. We have dry wood that would keep a house for five years without cutting a tree, and 200 acres to plough. The land here is the best I have seen—in fact, three feet deep of the best loam. These townships are all well timbered, and have good water by digging a few feet.\"\n\nMr. WILLIAM CROSS (late of Newtown, Staffordshire), who has settled on the S. W. ¼ of Sect. 14, Tp. 23, Rge. 4, writes to his brother and sister:—\"I have got 160 acres of good land—I have sunk a well and got good water, and I have got about 30 acres of good wood, so that I will not have to buy fuel as long as I live. This is a beautiful country. I wish you could get here. Save your money and try next spring.\"\n\nMr. ALEX. J. MCDougall (late of Berlin, Ont.) writes to his sister:—\"The chickens and ducks are all fit to kill now, and we are having a fat time of it. We have chicken three times a day; and it is just fine too, you can depend. We have been having venison for about five meals in succession. The raspberries and choke cherries are ripe here now, and they are really splendid. Mr. Salisbury was up on the other side of the lake shooting to-day, and had dinner on them. He says we could pick a train load of them in half a day. The black currants and hazel-nuts are also very thick. There was a speckled trout caught in the creek running into the lake, and it was not a small one either. There is an abundance of jackfish in the lake, and they are as solid as any trout I ever saw.\"\n\nMr. JORAM BOKARDT (late of Unionville, Ont.), who is settled on the N. E. ¼ of Sec. 24, Tp. 23, R. 4, arrived in Toronto. He says the land proves even better than he expected, and that the quality of the grasses is such that they produce far richer butter than can be made in Ontario. The settlers are putting up great quantities of hay, and have every facility for conducting successful dairy farms. The weather this fall has been delightful, and game of all kinds is abundant. One of the settlers purchased from an Indian 50 lbs. of splendid moose meat for 70\nThe trail between the settlement and Broadview is an excellent one. Mr. Eckardt started with heavy waggon from Crescent at 5 a.m., and reached the railway station at 8 p.m. the same day. The journey has been made in nine hours and a half with a lighter conveyance.\n\nMr. ARCHIBALD McDONALD, Chief Factor of the Hudson's Bay Company, residing at Fort Qu'Appelle, and whose opinion is entitled to the greatest confidence, in the Old and New Worlds alike, writes:—\"Nowhere in the North-West can there be found a finer agricultural district than that which extends along the Second Initial Meridian, from the Cut Arm and Leech Lake up to the White Sand River. No country could be better adapted for settlement. The soil is a deep black loam, with clay subsoil, while wood and water are everywhere convenient. It is far superior to the plain country to the south and west, and it is not surpassed anywhere. This locality presents facilities for stock-raising that the Bow River district does not possess. Being easy of access by rail or steamer, it will be speedily taken up.\"\n\nMR. CHARLES FALCONER MILES, D.L.S., at present, and for a number of years, in the Government service, engaged upon important departmental surveys in various parts of the Territories, including Bow River, and whose wide observation and mature judgment enhance his opinion, writes:—\"Some of your townships came under my immediate observation. The country is a rolling prairie, with abundance of wood and water, and easy facilities for drainage. The soil is excellent, consisting principally of rich black clay loam, with clay subsoil. No locality in the country is better adapted for settlement, or furnishes more advantages. These lands are easily accessible, and will be more so as soon as the projected branch of the Canadian Pacific Railway, via Fort Ellice, and also the Manitoba and North-Western Railway are constructed, both of which are expected to pass in close proximity to these townships.\"\n\nMr. J. LESTOCK REID, D.L.S., C.E., during the past eleven years has been engaged upon many and important Government surveys in the North-West, and for several years has resided at Prince Albert Settlement, N.W.T. His experience embraces Australia and other Colonies, as well as our own Territories, which renders his expression the more valuable. He knows whereof he speaks when he states as follows:—\"I have much pleasure in being able to congratulate the Company on securing such admirable lands for colonization as came under my inspection during the past summer. The Crescent Lake townships are in the heart of a magnificent farming country, being themselves the best part of it. The richness of the soil would astonish those who are contented with the plain country lying to the south and along the line of railway. They possess not only superiority in soil, but the incalculable advantage of an ample supply of fuel and fencing, as well as water convenient and pure. I cannot conceive any country better adapted to promote the comfort and prosperity of settlers; nor do I believe there is better in the world.\"\n\nThe Rev. JOHN MCDougall, for twenty-three years a missionary in the North-West, now resident at Morley, N.W.T., says:—\"The portions of this district crossed by me are superior in soil and water, and all that could be desired. From conversations with Mr. Archibald McDonald, of Fort Ellice, and Mr. McBeth, of Fort Pelly, I have found that they, in common with others who know the tract, regard it as unsurpassed for agricultural purposes.—The country I traversed is really very fine, and just suited for settlement.\"\n\nMr. WM. ECKARDT, a man of wide practical knowledge and excellent judgment, formerly of the township of Markham, near Toronto, but now a resident settler on Sect. 18, Tp. 23, Range 8, wrote as follows:—\"I have returned from an extended tour in the North-West, embracing the line of the Canadian Pacific Railway as far west as South Qu'Appelle and Troy. I also traversed, by buckboard, some 500 miles of the country lying between the railway and Fort Pelly, including Qu'Appelle Post, File Hills, Pheasant Plains, Beaver Hills, White Sand River, Leech Lake, and Fort Ellice. I made the examination on my own account, at my own expense, and for my own satisfaction and information; and I unhesitatingly pronounce your townships west of the Second Initial Meridian and around Crescent Lake the finest seen in my journey, and surpassing any\nother district visited by me. Their superiority consists in the richness of the soil, the convenience of suitable wood, and the supply of good water. The settlement of these townships will be an easy matter, for it will quickly follow upon their great fertility becoming known.\"\n\nMr. JOHN BENSON, an Englishman, settled on Section 4, Township 23, Range 8, writing on December 17, 1883, says:— \"The weather has been delightful. On the 9th of this month it rose to temperate, and most of the time since then I have worked out in the air without my coat. Not so bad for the North-West! I herewith enclose you sketch of my house, which is true to scale. I have got it plastered inside and out, and have laid double floors of wood, so that we are pretty comfortable. I thought you might like to take a sketch with you on your tour, to show what an Englishman—and a greenhorn at that—could do in a few months. Besides, no old countryman has any idea of log houses as good as this is, and I certainly never expected to get up as good a one as we have. In fact, I would not take three hundred dollars for it to-day.\"\n\nMr. S. W. SWITZER, located on Section 23, Township 23, Range 4, stated as follows on the 12th of January, 1884:—\"Having just returned from Crescent Lake, where I have been residing since May last, I am able to say that the weather has been pleasant up till the time of my leaving—26th of December. The cold is not such as to interfere with outdoor work in winter, and no extraordinary precautions are necessary. A very exaggerated idea of the effect of 20° or 30° below zero prevails in some people's minds. The country is really fine, combining all the advantages any man can want—good water, with plenty of hay and wood. The soil is a black loam. There is an abundance of fish and game, which is no small consideration. I have been over a good deal of the country, and from what I have seen do not think any more desirable place for settlement can be found than in these townships... This opinion is endorsed by those I have met who have visited other parts of the Territories not seen by me.\"\n\nMr. WM. H. ANDERSON, whose homestead is alongside that of Mr. Switzer, with whom he returned to Toronto, supplemented the above statement with the following remarks:—\"There was a flurry of snow on the 7th November, but not enough fell to make sleighing until the 17th. Eight snowfalls occurred since, from time to time. On the 26th December, when we left, snow lay to a depth of from eight to twelve inches. I found the weather pleasant throughout—even at the coldest. The lowest temperature in the middle of the day would not be below 20°. We did not suspend teaming during the coldest snap; nor did we then find it necessary to use overcoats.\"\n\nMr. WM. BEDFORD JONES, formerly of Ottawa, writes on the 1st October, 1883, as follows:—\"Since leaving this place (Crescent Lake) in July, it has been my duty to inspect, for the Hudson's Bay Company, the country extending from Leech and Crescent Lakes eastward to the Assiniboine River (some forty-five miles), and westward to the Beaver Hills (some thirty miles); whilst for the last ten days or so I have been inspecting lands north and north-east of Leech Lake. The soil in Ranges 1 and 2, Township 26, and Range 1, Township 25, I found to be in most cases a black loam, with a fair percentage of sand in it; an admixture which I think all old settlers prefer. It is from eight-to-sixteen inches deep; but in some instances I found a depth of nearly two feet. The subsoil is chiefly clay and sand, but is also in places gravelly. Every one, as a rule, upholds the locality in which he may be settled, and no doubt there is good land to be found in most districts. Now, all last season I inspected the country lying between Fort Ellice and Moose Jaw, from the Canadian Pacific Railway to Fort Qu'Appelle, and I must confess that neither then nor during this season have I come across any country which suits my ideas so well as that in which this portion of your land lies. Every man to his individual taste! Some make for the treeless, 'open prairie,' whilst others, like myself, will always prefer what is known as 'park scenery.' The former can be satisfied in Townships 25 and 26, Range 1; while the latter, who I think are in the majority, have five or six of the choicest townships in this locality from which to select a home; and I have no doubt that what I now say will be endorsed by those settlers who are\nfortunate enough to secure land within them next year. Those who have already settled around Crescent Lake seem perfectly well satisfied with their claims and with the way in which the Company have acted towards them. In confirmation of what I have said, permit me to conclude by asking your acceptance of my application to enter for the south half of Section 4, Township 26, Range 2, my friend, Mr. Tarbolton, having decided to enter for the north half of the same, being equally pleased with the locality and your very advantageous terms.\"\n\nMr. J. J. DALTON, of Toronto, Dominion Topographical Surveyor, who has enjoyed unrivalled opportunities of seeing the country while performing Government surveys in the North-West, writes as follows:—\n\n\"In the course of my sojourn in the North-West last season, I had an opportunity of thoroughly inspecting several of your townships along the 102nd Meridian, and, though I have been employed on extensive Government surveys for five previous seasons and have seen nearly all the chief settlements, I know of no place better adapted for farming than the townships to which I refer. This locality is remarkable for its abundant supply of fuel, good water, and fertile soil. The land is high and rolling, and is drained by alternate creeks and gentle elevations rising about thirty feet and about a mile apart, and running in a parallel north-westerly direction. The fuel is first-class, burning equal to any Ontario maple or beech. There is an abundance of excellent water. In digging a well four feet deep, I found fourteen inches of rich alluvial soil, twenty-four inches of mellow clay, and then limestone gravel full of most refreshing water. I found game exceedingly abundant, such as wild ducks and geese, and prairie chickens; also, fur-bearing animals, such as mink, badger, fox, skunk, and muskrat. Wild fowl are so numerous that I shot twenty-five ducks in four successive shots while proceeding with my work. I also killed three mink at one camping place with a stick; and a settler informed me that he killed six muskrats at one shot. We should have had very little trouble in securing quantities of fur, had we had time to attend to the skins. I spent a most delightful autumn, experiencing only three half days that were wet during a period of six weeks.\"\n\nMr. WILLIAM EAKIN, ex-Warden of the County of York, now settled in Township 23, Range 3, west of the Second Initial Meridian, wrote for the information of a friend living in Toronto as follows:—\n\n\"Crescent Lake, Dec. 25, 1883.\n\n\"Dear Friend.—As you are aware, we arrived at Qu'Appelle Station on the 2nd day of April. As the spring advanced, the ground that had been burnt over in the fall began to show signs of vegetation, and very soon the appearance of the country became beautiful and enchanting—grass brilliant green, trees in full leaf. The prairie was everywhere dotted over with roses and an endless variety of other kinds of wild flowers in full bloom; in fact, the whole of the open prairie resembled an endless flower garden.\n\n\"There was but a slight rainfall during the months of April and May, and but little rain during the month of June, the month that has been christened 'the rainy month' in the North-West. We had some showers in August and upon the 1st of September; but the season, on the whole, was a dry one. From the peculiar nature of the soil, if we have a day's rain, twenty-four hours afterwards the surface is quite dry, and therefore not slippery or disagreeable under foot, as results from similar rainfall I have experienced in Ontario. It has been a delightful spring, summer, and fall.\n\n\"About the middle of November we had a cold snap; since then beautiful weather, with an additional fall of snow. I think the average depth is from 10 to 12 inches at present.\n\n\"Soil.\n\n\"The soil is what I would call a black sandy clay loam, about 26 inches in depth, intermixed here and there with some limestone gravel on surface, having a clay subsoil. The soil is rich in those ingredients that invariably produce a fine sample of wheat, barley, and oats, as well as roots of various kinds. From this year's experiment—which, by the way, can hardly be called an experiment, as it was so very late in the season before any person was in a position to get the ground prepared for crop—\"\nI am satisfied a good yield per acre will be the result of land properly broken for a seed bed if broken in proper time. After the prairie sod has been once broken the land can be easily cultivated.\n\nLOCATION.\n\nThe location is rolling or undulating prairie, interspersed with clumps of poplar timber and willow scrub. No person, unless an eyewitness, can form any correct idea of the difference between a large tract of prairie, void of a single tree or twig as far as the eye can reach, and one that is dotted here and there with groves of timber. The open prairie, even in summer, is monotonous; but I assure you it looks dreary and repulsive in winter. The other is pleasing and inviting to the eye, and an air of comfort surrounds it that steals over you unawares, besides affording shelter to man and beast.\n\nADVANTAGES.\n\n\"The advantages of this particular situation are, a productive soil, dotted here and there with bluffs of timber available for fuel, fence-rails, and building purposes, and good water obtainable by digging a reasonable depth—say, on an average, 25 feet; being on the height of land; being within the great wheat-growing belt; and then being in the close vicinity of Crescent Lake, a beautiful fresh-water lake abounding in fish of a most delicious kind. We have also a healthy climate, occasioning no squeamish feelings at meal times. Here we are ready at any time for pork (fat at that!), potatoes, beans, and molasses.\n\n\"There is an abundance of natural grass for pasturage and hay. Although the winters are cold, I feel convinced that, with adequate protection, this is a good country for dairying or raising and fattening live stock.\n\n\"The beds of the creeks, the margin of the lake, are literally covered with good building stone, intermixed with limestone, while it is a rare thing to meet with stone on the uplands.\n\n\"In conclusion, I can but express the belief that there are hundreds, if not thousands, of farmers in the older Provinces of the Dominion who are paying a rental of from $4 to $6 per acre, who have to 'nigger' and slave themselves, their wives, their daughters, and their sons, in order to pay rent and make both ends meet, who, by disposing of their stock and migrating to the North-West, might in a few years be like Robinson Crusoe, monarchs of all they survey.\n\n\"If you would take a trip to Crescent Lake it might add some years to your life. I have not enjoyed as good health for many years.\n\n\"I hope you have enjoyed a merry Christmas; and I wish you a happy New Year.\n\nYours very truly,\n\n\"WM. RAKIN.\"\n\nNORTH ELBOW SETTLEMENT.\n\nThe Rev. JOHN MCDougall, of Morley, N.W.T., writing Oct. 7, 1892, says:—\"The North Saskatchewan at this point has well defined banks on both sides, from 12 to 15 feet above ordinary water level. The river is not crooked, but takes long sweeps. Bars occur in the river, but, nevertheless, navigation is not difficult anywhere along this stretch. At the easterly turn of the Elbow the banks are very high, making that point unsuitable for a town site. To the river there is a gravelly bottom, with good beachy banks backed by clay. At the mouth of a beautiful creek, a short distance east of Eagle River, there is an old camping-ground near a grove of ash-leaved-maple. This is where the old C.P.R. line strikes the river, and would naturally be selected if a town is located in this neighbourhood. Eagle River winds through a valley about a mile wide, and at low water is a stream about 2 feet deep and 20 feet wide. Even at the highest water it flows between well defined banks. It has quite a fall, which might be turned to account as a motive power. The walls of Eagle Valley are nearly 200 feet high. From the banks of the Saskatchewan the ground rises by several steps to the level of the prairie. As to soil, on the\nsouth side of the river the land on the lower levels is very rich. On the tableland it is lighter, and in places there are traces of gravel. While it is good agricultural land, it excels for pasturage. North of the river your townships are made up of prairie and woodland intermixed. The open would range all the way from one hundred acres up to one thousand, while the bluffs would run from ten acres up to one hundred. Along small creeks and coulees, which occur along the north bank of the river as well as around Redberry Lake, larger-sized poplar and birch are found, which would be useful for building material. The streams in this location, including those emptying into Redberry Lake, contain excellent water. The lake itself, which is slightly alkaline, has very luxuriant vegetation around it, and berries are here found in great profusion. The soil on the north side of the river is good throughout, and increases in strength and richness as you travel back from the river.\"\n\nMr. J. LESTOCK REDD, D.L.S., writes, February 16, 1883: \"The geographical position alone of the townships at the Elbow of the North Saskatchewan would entitle them to great consideration. Eleven years have given me considerable experience of the North-West. My travels have extended from the Lakes to the Mountains, and I pronounce your lands unsurpassed in that country.\"\n\n---\n\nRED DEER SETTLEMENT.\n\nThe Rev. JOHN McDOUGALL, of Mosley, N.W.T., writes, October 7, 1882: \"The country at this point is park-like all through, prairie and timber blending, without too much of the latter. It is watered by one of the finest streams in the North-West—at low water 2 feet deep and 100 yards wide. The lay of the country is simply grand, and in all the creeks the water is excellent. In two of the townships, prairie and wood are divided nearly equally; in the others prairie predominates. Considerable large-sized poplar, birch, and spruce are found right around Swan Lake. The high benches of the uplands slope down gradually to the fine banks of the river. All the soil is of the very best, being a black-loam-on-a-clay subsoil. The locality has been greatly admired, and is sure to catch the eye of any one who passes over it. In this vicinity coal abounds.\"\n\nThe Rev. A. SUTHERLAND, D.D., General Missionary Secretary of the Methodist Church, and Secretary of the General Conference, who speaks from an extensive personal knowledge of the North-West Territories, writes in the following terms: \"During the summer of 1880 I travelled with horses from Fort Benton, Montana, to Fort Edmonton on the North Saskatchewan, crossing the numerous streams that intersect the country, and fording the Red Deer River at 'McDougall's Crossing.' We had noticed a steady improvement in the soil and vegetation from the time we crossed the International Boundary Line; but the advantages for settlement seemed to culminate at the Red Deer. The soil was not surpassed by any we had seen; pea-vines growing luxuriantly and in great abundance; timber amply sufficient for building, fencing, and fuel; water, pure and abundant; rolling prairie, interspersed with clumps of willow and groves of poplar and spruce, with, here and there, tracts of rich hay land, which seem to mark it out as a very paradise for stock breeders. After travelling for miles through this beautiful tract, I said to a friend, 'What a magnificent site for a colony!' To which he promptly responded, 'I know this country from one end to the other, and there is no better spot in all the North-West.'\"\n\nThe Edmonton Bulletin, in the course of an article describing the features of the country, as observed in travelling by the trail from Calgary to Edmonton, makes the following remark applying to our townships on the Red Deer: \"The soil, the vegetable growth, and the appearance of the country, is very similar all the way from the 'Lone Pine' (indicated on recent Government maps) and the crossing (of the Red Deer). The intending settler could hardly make a mistake, no matter what part he\npitched on.\" Speaking of the soil, the writer says:—\"This latter contains more sand than that of the plain immediately to the south, and is therefore of a warmer nature, while the richness is shown by the rank growth of the wild vegetation upon it. The country is not so thoroughly drained as that to the south, and in the depression between the hills, as a general thing, ponds of good water or hay swamps are found. There are a few creeks, but they are of small size. The rising ground is perfectly dry, over three-fourths of the country being high, dry land.\" As regards climate, etc., the following paragraphs are quoted from the Red Deer correspondence of the Bulletin of the 29th December:—\"We have had a beautiful winter so far. Chinooks (as the warm breezes from the Pacific are called) are the order of the day. Rain here on the 15th. A bear hunting party, under the leadership of Dan Williams, started out, and succeeded in bringing in four black bears. Bears are numerous up the Red Deer.\"\n\nThe following is an extract from the report of the Rev. James Robertson, Superintendent of Presbyterian Missions, of his trip through the North-West Territories in the fall of 1883:—\"The Red Deer Settlement lies half way between Edmonton and Calgary. About sixty homesteads have been taken up, and the prospects are that the Settlement will grow rapidly, inasmuch as the land is fertile, there is plenty of timber, and abundance of the very best water. Arrangements were made to provide the people next spring with religious services.\"\n\nGENERAL OBSERVATIONS BY A HIGH AUTHORITY.\n\nThe Rev. JOHN McDOUGALL, in the concluding portion of the letter from which foregoing extracts were made, makes the following observations, pregnant with the weight of his long experience:\n\n\"Speaking generally of all your locations, in my judgment better selections could not be made in the country. With all my intimate knowledge of the whole Territories, I could not have chosen them to better advantage. Their manner of distribution at once suggests the utmost familiarity with the characteristics and resources of the country, as well as with its physical features and advantages. In short, were I permitted to select half-a-million acres of the choicest agricultural lands in the whole North-West, I would take the very locations that you have selected.\n\n\"In that western country the rainfall is principally in May and June; preparing the soil for the rapid growth that follows. The succeeding months are marked by copious dews, which in turn stimulate vegetation. During the month of August it rarely rains, thus affording an ample harvest time of favourable weather. The autumn is bright and bracing, and the winter, which moderates as you travel westward, is always invigorating, even when the temperature is at the lowest, while the depth of snow over the whole western district would only average about twelve inches. The climate throughout the entire year will be more appreciated when it is better understood. I anticipate that the Far West will soon become the favourite resort of the invalid, tourist, and sportsman, who will find both health and recreation in full sight of the Rockies.\"\n\nLATEST information as to the best way for passengers and freight to reach either of the Company's settlements will be promptly furnished, on application, by\n\nJOHN T. MOORE,\nManaging Director,\n52, KING ST. EAST, TORONTO, CANADA.\nThe Memorial\n\nOF SETTLERS IN THE TRACT GRANTED TO THE\n\nSASKATCHEWAN HOMESTEAD COMPANY.\n\nTO HIS EXCELLENCY\n\nTHE GOVERNOR-GENERAL\n\n(IN COUNCIL).\n\nMay it please Your Excellency:\n\nWhereas great ignorance prevails as to the nature and terms of the Colonization plan of December, 1881, and the Agreement thereunder, which ignorance extends, we regret, even to the North-West Council;\n\nAnd Whereas unfriendly and untrue representations of the whole Colonization work have been industriously circulated to serve personal and political ends, which statements, though not directed against any particular Company, nevertheless justice and decency compel us to give them a flat denial so far as concerns THE SASKATCHEWAN HOMESTEAD COMPANY.\n\nAnd Whereas the great and many real merits of the plan have been unwittingly or dishonestly concealed, and thus, by the general public not understanding the\nnumerous and valuable benefits that will ensue to settlers in these tracts, a serious wrong is done to a beneficent system:\n\nNow, therefore,\n\nThis Memorial of the undersigned,\nwho are\nACTUAL SETTLERS\nin the Tract granted by you to the Saskatchewan Homestead Company,\n\nHumbly Sheweth:\n\n(1) That, in their judgment, the Government Colonization Plan is wise and good, and tends to the welfare of the settler, the settlement, and the country.—That the stringent provision for two resident settlers upon each section—odd as well as even—secures a population more dense and uniform than has hitherto marked rural districts in the North-West, and, by reason of greater proximity and number, far superior social, educational, religious, and municipal advantages ensue. Already your Memorialists have experienced most beneficial effects in this respect.\n\n(2) That the Saskatchewan Homestead Company is entitled to unqualified approval for the course pursued by it in the settlement of this tract. The policy of the Company has from the first been liberal and patriotic, and speedy development is now going forward. Your Memorialists cheerfully testify that, individually and collectively, they have experienced almost indispensable benefits through the praiseworthy enterprise and liberality of the Company. The very considerable measure of prosperity now enjoyed, the harmonious and neighbourly spirit which prevails, and the contentment among the settlers\nprove, beyond question, that the plan is a good one when ably and honestly acted upon.\n\n(3) That unprecedented success will, in the opinion of your Memorialists, characterize the tract of a Company which discharges efficiently the duties assumed under the Colonization Agreement. Adverse criticism at so early a stage betrays an antagonism that would condemn untried. Your Memorialists have abundant evidence of increased prosperity in the future, and deplore that a laudable and wisely-devised system should be misunderstood and defamed. With entire confidence in and approval of the Colonization method, the Company itself, and its administration, your Memorialists enter heartily into the congenial work of developing and beautifying their respective farms in this fertile portion of the Canadian North-West.\n\nCrescent Lake,\nAssiniboia, N.W.T., November, 1883.\n\n| NAME          | West of 2nd Mer. |\n|---------------|------------------|\n|               | Sect. | Tp. | Rge. |\n| Wm. Eakin     |       | 10  | 23   | 3    |\n| George W. McBean |      | 36  | 23   | 3    |\n| S. H. Switzer |       | 28  | 23   | 4    |\n| NAME               | Sect | Tp. | Rge. |\n|--------------------|------|-----|------|\n| Edward Salisbury   | 22   | 23  | 4    |\n| Wm. Eckardt        | 18   | 23  | 3    |\n| Thos. O. Youngs    | 12   | 23  | 4    |\n| J. Geo. Phelps     | 10   | 23  | 3    |\n| Christ. C. Rogers  | 2    | 23  | 4    |\n| Geo. Addison       | 18   | 23  | 3    |\n| E. Ainsworth       | 4    | 23  | 4    |\n| William Cross      | 14   | 23  | 4    |\n| Frederick Baines   | 20   | 23  | 3    |\n| NAME                        | Sect | Tp. | Rge |\n|-----------------------------|------|-----|-----|\n| Anthony D. Eckardt          | 24   | 23  | 4   |\n| Richard Medealf             | 12   | 23  | 3   |\n| George Stephen Thomson     | 36   | 23  | 3   |\n| R. Murray McBean           | 26   | 23  | 3   |\n| William Maddock            | 24   | 23  | 3   |\n| Joseph Lucas               | 24   | 23  | 3   |\n| W. C. Middleton            | 22   | 23  | 3   |\n| G. H. Middleton            | 22   | 23  | 3   |\n| M. G. Middleton            | 22   | 23  | 3   |\n| NAME                        | Sect | Tp | Rge |\n|-----------------------------|------|----|-----|\n| Alexander Heggie            | 16   | 23 | 4   |\n| William H. Anderson         | 28   | 23 | 4   |\n| Thomas Bolton               | 4    | 23 | 3   |\n| Thomas Ambler Bolton        | 4    | 23 | 3   |\n| John Benson                 | 4    | 23 | 3   |\n| Edward Outhwaite            | 16   | 23 | 3   |\n| Thos. Evans                 | 16   | 23 | 3   |\n| John Athey                  | 6    | 23 | 3   |\n| Willard S. Eckardt          | 24   | 23 | 4   |\n| NAME                  | Sect | Tp. | Rge |\n|-----------------------|------|-----|-----|\n| Charles Mann          | 18   | 26  | 2   |\n| George Deacon         | 18   | 23  | 4   |\n| Henry Deacon          | 18   | 23  | 4   |\n| William H. Thomson    | 12   | 23  | 4   |\n| W. J. Dawson          | 32   | 23  | 4   |\n| S. C. McCollum        | 6    | 26  | 2   |\n| H. H. Watts           | 32   | 23  | 4   |\n| Alex J. Macdonagall   | 2    | 23  | 3   |\n| J. S. Farbotten       | 4    | 26  | 2   |\n| NAME               | Sect | Tp. | Rge. |\n|--------------------|------|-----|------|\n| Wm. Bedford Jones  | 4    | 26  | 2    |\n| Joram Eckardt      | 24   | 23  | 4    |\n| Chas. Barras       | 6    | 23  | 3    |\n| W. H. Moore        | 12   | 23  | 4    |\n## TABLE OF APPROXIMATE DISTANCES FROM THE COMPANY'S SETTLEMENTS.\n\n| Distance, in Miles, from | Crescent Lake | North Elbow | Red Deer Crossing |\n|--------------------------|---------------|-------------|------------------|\n| Battleford               | 570           | 60          | 349              |\n| Benton, Montana          | 520           | 380         | 350              |\n| Brandon                  | (Via C.P.R.)  | 175         | 205              | 756              |\n| Broadview                | 40            | 265         | 621              |\n| Calgary                  | (Via C.P.R.)  | 500         | 360              | 86               |\n| Carlton                  | 250           | 40          | 325              |\n| Chicago                  | 940           | 1100        | 1400             |\n| Churchill Harbour, Hudson's Bay | 670       | 475         | 908              |\n| Crescent                 | 590           | 300         | 661              |\n| Edmonton                 | (Via C.P.R.)  | 370         | 550              | 957              |\n| Emerson                  | 63            | 233         |                  |\n| Fort Elllice             | 60            | 175         |                  |\n| Fort Qu'Appelle          | 375           | 230         | 300              |\n| Fort Walsh               | (Via C.P.R.)  | 2550        | 2900             | 3170             |\n| Halifax                  | 400           | 240         | 240              |\n| Medicine Hat             | (Via C.P.R.)  | 1758        | 1948             | 2319             |\n| Montreal                 | (Via C.P.R.)  | 2121        | 2343             | 2730             |\n| New York                 | (Via C.P.R.)  | 2250        |                  | 275              |\n| Peace River (confluence with Athabasca R.) | 730     | 500         | 830              |\n| Portage la Prairie       | (Via C.P.R.)  | 445         | 468              | 833              |\n| Port Arthur              | 730           | 930         | 1320             |\n| Port Moody, B.C.         | Do.           | 1200        | 1000             | 758              |\n| Port Nelson, Hudson's Bay| 600           | 600         | 825              |\n| Prince Albert            | 240           | 80          | 355              |\n| Quebec                   | 1985          | 2205        | 2608             |\n| Red Deer Crossing        | 661           | 275         |                  |\n| Regina                   | 133           | 175         | 529              |\n| St. Paul, Minnesota      | 600           | 820         | 950              |\n| Swift Current            | 227           | 150         | 374              |\n| Toronto                  | (Via C.P.R.)  | 1860        | 1570             | 1350             |\n| Winnipeg                 | (Via C.P.R.)  | 904         | 534              | 885              |\n\nLatest information as to the best way for passengers and freight to reach either of the Company's settlements will be promptly furnished, on application, by\n\n**JOHN T. MOORE,**\n\nManaging Director,\n\n82 King Street East, Toronto, Canada.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001265.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 67468, "total-output-tokens": 24927, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1400, 2], [1400, 1400, 3], [1400, 1575, 4], [1575, 1753, 5], [1753, 3243, 6], [3243, 4373, 7], [4373, 6247, 8], [6247, 8487, 9], [8487, 10838, 10], [10838, 13155, 11], [13155, 15024, 12], [15024, 16522, 13], [16522, 16522, 14], [16522, 19054, 15], [19054, 21435, 16], [21435, 23838, 17], [23838, 25495, 18], [25495, 27731, 19], [27731, 30258, 20], [30258, 32797, 21], [32797, 34972, 22], [34972, 34972, 23], [34972, 37261, 24], [37261, 38523, 25], [38523, 40859, 26], [40859, 43310, 27], [43310, 44980, 28], [44980, 47497, 29], [47497, 49921, 30], [49921, 52288, 31], [52288, 54760, 32], [54760, 57000, 33], [57000, 59371, 34], [59371, 61746, 35], [61746, 63481, 36], [63481, 65747, 37], [65747, 69980, 38], [69980, 74426, 39], [74426, 78900, 40], [78900, 83221, 41], [83221, 87027, 42], [87027, 91058, 43], [91058, 94472, 44], [94472, 95358, 45], [95358, 96807, 46], [96807, 97925, 47], [97925, 98398, 48], [98398, 98952, 49], [98952, 99502, 50], [99502, 99997, 51], [99997, 100255, 52], [100255, 103358, 53], [103358, 103358, 54]], "primary_language": ["None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, false], "is_diagram": [true, false, true, true, false, false, false, false, false, false, false, true, true, true, false, false, false, true, false, false, false, false, true, false, true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]