[{"id": "e0dfc562eec5de90f62ee8d06ec534980c29a656", "text": "G. Beauregard,\n\nLe 9e Bataillon\n\nau\n\nNord-Ouest.\n\n1886.\nLE 9me BATAILLON\n\n— AU —\n\nNORD-OUEST\n\n(Journal d'un Militaire)\n\nPAR\n\nGEORGE BEAUREGARD\n\nSoldat de la Compagnie No. 3.\n\nQUÉBEC :\nIMPRIMERIE DE JOS.-G. GINGRAS & CIE.\n\n1886.\nLE 9me BATAILLON\n\nAU\n\nNORD-OUEST\n\n(Journal d'un Militaire)\n\nPAR\n\nGEORGE BEAUREGARD\n\nSoldat de la Compagnie No. 3.\n\nQUÉBEC:\nIMPRIMERIE DE JOS.-G. GINGRAS & CIE.\n1886.\nPREFACE.\n\nLe livre que j'offre aujourd'hui au public, et en particulier à mes confrères du 9ième bataillon, est absolument sans prétention. Je ne veux pas faire de la littérature, encore moins de la politique, d'abord parce que je ne m'en connais ni le goût ni la capacité, et ensuite parce que, en partant pour le Nord-Ouest, je n'avais en tête aucun de ces deux buts.\n\nMon travail a un caractère tout-à-fait intime. J'ai pris note, jour par jour, des événements qui avaient quelqu'importance pour le bataillon. Si je m'arrête quelquefois sur le récit des impressions que j'ai pu recevoir dans un moment d'humeur sombre, ou de disposition quelque peu à la plaisanterie, que l'on n'y voie pas le désir de faire des malices à qui que ce soit. Telle n'a pas été mon idée.\n\nSi le journal d'un militaire peut avoir quelque intérêt pour nos amis de Québec, qui nous ont toujours témoigné une si ardente et si franche sympathie, je ne regretterai pas d'avoir cédé aux instances de ceux qui m'invitaient à le publier.\n\nG B.\nLE DEPART.\n\nLe 31 Mars 1885, le lieutenant-colonel Guillaume Amyot, commandant du Neuvième Bataillon des Voltigeurs Canadiens, recevait l'ordre de se préparer à partir avec ses soldats, pour le Nord-Ouest, où l'insurrection venait d'éclater.\n\nÀ cinq heures de l'après-midi, même jour, nous étions à l'arsenal, pour choisir nos équipements, consistant en : Un képi, une tuque, une tunique, un pantalon, une capote et un casque. Chacun devait en outre mettre dans son havre-sac deux chemises, une camisole, deux paires de caleçons, trois paires de bas, une paire de souliers, une paire de cordons en réserve, un couteau, une fourchette, une cuiller, une serviette, un peigne, du savon, des aiguilles, du fil, etc., etc., etc. Le gouvernement nous fournissait trois couvertures en laine et une couverture imperméable.\n\nOn compléta notre équipement en donnant à chacun de nous une carabine \"Snider\", un sabre-baïonnette, une courroie, un sac à balles, un ceinturon, un havre-sac, un bidon, une bandoulière (cross-belt) et une gamelle.\n\nAinsi habillés, parfaits soldats des pieds à la tête, nous avions un air crâne qui aurait fait fuir à cent lieues tous les sauvages du monde.\n\nÀ sept heures et demie, nous étions tous réunis à la Salle d'Exercices. Le colonel nous dit que nous devions partir ce soir-là, mais que le départ avait été remis au lendemain, 1er Avril.\n\nLe lendemain, même manège. Il fallait se tenir prêts ; l'ordre d'embarquer pouvait venir d'un moment à l'autre. Avant de nous congédier pour le reste du jour, on nous avertit que le lendemain matin, 2 Avril, une messe basse serait dite à la Basilique. Le colonel désirait que tous, officiers et soldats, y communiaissent.\n\nEn effet, à 8 heures, le jeudi 2 Avril, nous quittions la Salle d'Exercices, musique en tête. M. l'abbé Bélanger, curé de St-Roch, alors vicaire à la Basilique, dit la messe, et chacun\nse fit un pieux devoir d'y recevoir la Sainte-Communion. Nous ne pouvions nous le dissimuler, en dépit de l'enthousiasme qui nous entraînait sur les pas de notre brave commandant, il y avait au fond du cœur de chacun une crainte vague : combien d'entre nous allaient peut-être laisser leurs os dans ces vastes solitudes du Nord-Ouest !...... Mais n'importe, hésitation et crainte, nous refoulions tout sentiment qui pouvait ébranler nos bonnes dispositions, et, réunis à la Table Sainte nous demandions au Dieu de la Force, à ce fils divin qui n'a pas hésité à sacrifier sa vie pour nous, le courage et l'énergie nécessaires pour bien faire notre devoir.\n\nAprès la messe, le bataillon a défilé par les principales rues de la ville. La musique jouait : Partant pour la Syrie. Nous avions fait la précieuse acquisition de deux officiers nouveaux, MM. Casgrain et Arthur de Blois. Notre petit corps, au complet, présentait un coup d'œil magnifique. Notre air martial semblait s'accentuer davantage à mesure qu'approchait l'heure du départ.\n\nNous étions au nombre de deux cents trente-cinq, répartis comme suit :\n\n**ETAT-MAJOR**\n\nLIEUT.-COL. GUILLAUME AMYOT, Commandant ;\nLIEUT.-COL. THOMAS ROY, Major ;\nLIEUT.-COL. ARTHUR EVANTUREL, Major ;\nMAJOR GEORGE DUGAL, Paie-maître ;\nCAPT. AIMÉ TALBOT, Quartier-Maître ;\nM. L'ABBÉ FRANÇOIS FAGUY, Chapelain ;\nCAPT. PHILIPPE du PERRON CASGRAIN, Adjudant ;\nDR. ARTHUR de BLOIS, Chirurgien ;\nJOHN HORN, Opérateur de télégraphe.\n\n---\n\n**Compagnie No. 1**\n\nCAPT. L. E. N. FRÉNETTE, LIEUT. GUST. F. HAMEL.\n\n---\n\n**SERGENTS**\n\nALFRED DEPIL, WILFRID LEBEL, LEONIDAS MORENCY.\n\n---\n\n**CAPORAUX**\n\nDAVID BLAIS, JEAN-BTE PARADIS, CHARLES VALIN.\nSOLDATS\n\nBrennon John.\nBoulanger P. F.\nBureau Jos.\nBrown Fred.\nCurodeau Alphonse.\nChartier Télesphore.\nDessane Alexis.\nDion Elzéar.\nFournier Charles.\nGagnon Arthur.\n\nGiguère Albert.\nLabadie Édouard.\nLortie Ulric.\nLeFrançois Jules.\nOuimet Eugène.\nParadis Napoléon.\nRoyal Paul Louis.\nRoberge Joseph.\nTurcotte Jos.\nWagner Henri.\n\nÉlisée Boulet, Sergt. Quartier-Maître.—Edouard Lebel, Sergt. d'Hôpital.\n\nCompagnie No. 2\n\nCAPT. CYPRIEN FISET, LIEUT. PERRAUL & CASGRAIN,\nLIEUT. EMILE FAUCHER DE ST-MAURICE.\n\nSERGENTS\n\nLouis Giroux, Bertrand Vienno Michaud, Charles Simard.\n\nCAPORAUX\n\nNapoléon Chamberland, Joseph Giroux, Narcisse Gingras.\n\nSOLDATS\n\nAubin Jos.\nBlais Jos.\nBoucher Jos.\nCorriyeau Jos.\nChamberland Camille.\nChamberland James.\nDelamare Charles.\nFortin Léon.\nFortin Nazaire.\nFortin Jean-Bte.\nGiroux Albert.\nLaRoche Cléophas.\nLaRoche Jos.\n\nLafrance Philéas.\nLasanté George.\nLefaivre Louis.\nMallard Gaud.\nMartel Abraham.\nNoël Cérénaus.\nPaquet Henri.\nSoucy Théo.\nSoucy Alfred.\nSirois George.\nTardif Alphonse.\nVaillancourt Ferdinand.\n\nLucien Miller; Trompette.\nCompagnie No. 3\n\nCAPT. JOS. DROLET, LIEUT. W.-D. BAILLARGE.\n\nSERGENTS\nLouis Chabot, Robert S. M. Bouchette, Jean-Baptiste Marcoux.\n\nCAPORAUX\nJ.-Bte Bilodeau, Jos. Biron, Auguste Thorn, C. H. Plante, caporal-lancier.\n\nSOLDATS\nBeauregard George. Laperrière Alfred.\nBarbeau Elzéar. Nolin Joseph.\nBérubé Joseph. Ouellette Ernest.\nCoulombe Alphonse. Patry Alfred.\nDussault Napoléon. Rousseau J. Canfield.\nGoulet Edouard. Turcotte Pierre D.\nLeMoine L. Alexandre.\n\nEusèbe Patry, Trompette.—Abdon Coté, Sergent Paie-Maitre.\n\nCompagnie No. 4\n\nCAPT. ELZÉAR GARNEAU, LIEUT. GEORGE A. LABRANCHE,\nLIEUT. ELZÉAR FISET.\n\nSERGENTS\nLouis Lachance, Philippe Miller, Olivier Matte.\n\nCAPORAUX\nF.-X. Jobin, Alexis Julien.\n\nSOLDATS\nBlais Elzéar. Dominique Octave.\nBlais Louis. Hardy Hector.\nBlais Jean-Baptiste. Jobin Prospère.\nBlais Alfred. Jouvin Léonidas.\nButeau Roméo. Landry Octave.\nBibault Jean-Baptiste. Marois George.\nCantin Onésime. Marois Théophile.\nCorriveau George. Pouliot Pierre.\nCartier Louis. Plamondon Pierre.\nDanjou Théophile. Smith Joséph.\nCompagnie No. 5\n\nCAPT. FRANK PENNÉE, LIEUT. G. VITAL DUPUIS,\nLIEUT. ARTHUR DION.\n\nSERGENTS\nG. GERMAIN, TELESPORE TRUDEL, EUDORE GOSSELIN.\n\nCAPORAUX\nVICTOR BERNIER, TELESPORE GUAY, EDMOND LAPOLTE, ALPHONSE NOLET.\n\nSOLDATS\nBonvouloir Thimothy.\nBois Edmond.\nBibault Alfred.\nBoucher Léon.\nCôté Édouard.\nCroreau Joseph.\nDubé Eugène.\nDamour Jules.\nGagnon Louis.\n\nJulien Napoléon.\nLandry Joseph.\nLetellier Joseph.\nLeChasseur Louis.\nLapointe Édouard.\nParent Edgar.\nRousseau Léonidas.\nSamson Telesphore.\nTanguay Joseph.\n\nERNEST TRUDEL, trompette.—OVIDE HAMEL, Sergent d'Ordonnance.\n\nCompagnie No. 6\n\nCAPT. ALFRED FAGES, LIEUT. AURELIEN SHEHYN.\n\nSERGENTS\nE. R. LAMONTAGNE, NAPOLEON LECLERC, J. E. GOSSELIN.\n\nCAPORAUX\nA. G. DEGUISE, JOS. GIÈRE, J. OCTAVÉ GIÈRE.\n\nSOLDATS\nAsselin Frs.\nDavis Alex.\nFournier Philéas.\nGagnon Herménégilde.\nGosselin Philéas.\nGingras Thomas.\nGuimond Zéphirin.\nGoulet David.\nLeclerc Louis.\n\nLizotte George.\nLaperrière Ed.\nMiles Thomas.\nMiller René.\nPapillon Samuel.\nParis Ernest.\nSimard Ed.\nSt-Pierre A.\nTerrien Laurent.\nCompagnie No. 7\n\nCAPT. L. F. PINAUT, LIEUT. PANTALÉON PELLETIER,\nLIEUT. JEAN CHARLES ROUTHIER.\n\nSERGENTS\nJoseph E. Chabot, Thomas Blondeau, Charles E. Damour.\n\nCAPORAUX\nJules Paradis, Alcide Poudrier, Philippe Jolicoeur.\n\nSOLDATS\nAlain Ludger. Godin Roger.\nBoucher Alexandre. Lemieux François X.\nBlais Achille. Laurencelle L'Alfred.\nBourget Joseph H. Lavoie Arthur.\nBourgoing Ludger. Pampalon Ovila.\nBeaudoin Louis Philippe. Poitevin Arthur.\nBastien Antoine. Poitevin Philippe.\nCollet C. A. Arthur Roy Henri.\nDorion Noel. Rouleau Japhet.\nDelisle Joseph. Rondeau Arsène.\nDeGuise Charles. Tanguay Narcisse W.\nEdge Joseph. Voyer Pierre J. A.\nGaumond Joseph.\n\nCharles Dénéchaud, Trompette.—Edmond Trudel, Sergent-Major.\n\nCompagnie No. 8\n\nCAPT. NAZAIRE LEVASSEUR, LIEUT. EUGÈNE LARUE,\nLIEUT. HENRI BEIQUE.\n\nSERGENTS\nJos. Triganne, Chs. B. Marcotte, Paul Briere.\n\nCAPORAUX\nJean-Baptiste Belanger, Edmond Savard, Chs. Vezina.\n\nSOLDATS\nBernard Onésime. Goulet George.\nCaraud Wilbrod. Rood Elzéar.\nDesrosiers Ed. Robillard Charles.\nDelamare Bruneau. Simard Joseph.\nQuand nous fûmes rendus à la salle d'Exercices, le colonel nous dit que les ordres venus d'Ottawa fixaient notre départ à dix heures, le même soir. Nous saluâmes cette nouvelle par trois hurrahs enthousiastes, puis nous partîmes en congé.\n\nJe n'essaierai pas de rapporter les efforts que l'on fit pour nous effrayer et nous dissuader de partir. Les personnes que nous rencontrions par centaines, dans les rues, nous disaient que nous allions faire la guerre à nos frères, à des français comme nous, que nous serions massacrés sans pitié, qu'on nous sacrifierait comme de la chair à canon, etc., etc. Ces bonnes gens s'imaginaient qu'il n'y a au Nord-Ouest que des métis français. C'est une grande erreur. Il y a parmi eux des anglais, des écossais, des irlandais.—Et d'ailleurs, nous n'avions pas à reculer. Notre devoir était d'obéir à la parole de nos chefs. Nous n'avions que faire des conseils qui nous étaient donnés si mal à propos. Nous ne pouvons mettre en doute les bonnes intentions de ceux qui nous parlaient ainsi, mais on avait assurément choisi une bien mauvaise heure pour venir nous peindre une perspective si peu gaie.\n\nÀ deux heures de l'après-midi, nous étions de nouveau réunis à la salle d'Exercices, où le colonel Duchesnay passa le bataillon en revue. Il nous félicita, en termes très-flatteurs, de notre bonne tenue.\n\nNotre service régulier était commencé. À cinq heures on apporta les rations ; car nous devions souper \"en camp\", à cause du départ, fixé à dix heures du soir. Personne ne pouvait plus sortir ; nous étions casernés. Le coup fut trop rude. Nous entourâmes le colonel, lui demandant de nous permettre d'aller dire un dernier adieu à nos parents, à nos amis. La permission accordée, chacun s'empressa d'en profiter. Le colonel nous avait dit : \"Si vous êtes des hommes d'honneur, vous serez ici pour huit heures.\"\n\nNous ne pouvions méconnaître la conduite si libérale de notre commandant, qu'en étant exacts à l'heure dite. Personne n'y manqua.\n\nQuelques instants après, nous avions fait les rangs, et, le fusil au bras, nous attendions le signal du départ.\n\nPlusieurs adresses nous furent alors présentées, auxquelles répondit le colonel au nom du bataillon, puis les membres\ndu Comité établi pour venir en aide aux familles des volontaires qui resteraient dans le besoin, nous firent cadeau d'un magnifique drapeau en soie, qui nous escorta jusqu'à la gare du chemin de fer du Nord.\n\nA neuf heures, le signal est donné, et nous sortons de la salle d'Exercices, accompagnés des musiques de notre bataillon et du 8ème Carabiniers Royaux, et escortés par tous les clubs de raquettes de Québec, qui s'étaient réunis avec des flambeaux et formaient au bataillon un cadre lumineux d'un effet splendide.\n\nUne foule immense stationnait le long des rues par où nous devions passer. Notre marche était très-difficile, chacun s'efforçant de briser les rangs pour dire adieu à un parent, serrer une dernière fois la main d'un ami qui partait......Enfin, après mille obstacles surmontés, nous arrivons à la gare. Nous avions défilé par les rues St-Louis, du Fort, Buade, de la Fabrique, St-Jean, Collins, Charlevoix, du Palais et St-Nicolas.\n\nDans la gare, la foule était si considérable, que nous eûmes de la misère à atteindre les chars.\n\nQuand nous eûmes pris nos quartiers à bord du train qui devait nous emmener loin de Québec et de tout ce que nous aimions, nous ne pûmes nous défendre d'un vif sentiment de tristesse. Nous partions là deux cent trente-cinq jeunes gens, la plupart non-mariés, laissant en arrière parents, frères, sœurs, amis, pour aller passer dans un pays sauvage un temps dont nous ignorions la durée, sans savoir si nous reviendrions jamais ou si nous ne trouverions pas au foyer les larmes du deuil et de la douleur remplaçant les douces joies que devait causer notre retour. Que de victimes la mort pouvait faire pendant notre absence ! Combien, peut-être, d'entre nous devaient attendre, dans ces plaines isolées du Nord-Ouest, le jour de la résurrection, sans une main amie qui viendrait prier sur leur tombe et y déposer la fleur du souvenir !\n\nCes pensées nous attristaient. Heureusement, le sifflet de la locomotive vint apporter une distraction à nos réflexions sérieuses.\n\nBonjour !—Bon voyage !—Prompt retour !......\n\nEt le train s'ébranle lentement. Nous sommes en route pour Winnipeg.\nLE VOYAGE.\n\nVendredi, 3 Avril.—Nous sommes arrivés à St-Martin à six heures et demie, ce matin. Après un arrêt de quelques minutes, nous continuons notre route vers Ottawa, sur un convoi de la Compagnie du Pacifique Canadien.\n\nÀ onze heures et demie, lunch à Calumet. Arrivée à Ottawa à six heures et demie. Les officiers ont eu la permission d'aller faire une courte promenade dans la ville. Nous n'avons pu voir que la gare, et encore était-ce de l'intérieur des chars, l'ordre formel ayant été donné de ne laisser sortir personne. À vrai dire, nous ne désirions guère voir la capitale du Dominion. Nous avions encore en tête les souvenirs du vieux Québec, souvenir trop frais pour permettre l'envie de voir Ottawa. Tout ce que nous demandions, c'était de partir le plus tôt possible.\n\nNous sommes repartis d'Ottawa à huit heures. Deux heures plus tard nous étions rendus à Carleton, où nous venons de faire un bon souper, dans un restaurant situé près de la gare. Le service s'est fait admirablement bien, nous avons fait honneur à la table abondamment servie. Après le souper, on nous a fait rentrer dans nos chambres... pardon, dans nos chars... où nous devons passer la nuit.\n\nNous pensions partir à minuit, mais il fait une grosse tempête, la voie ferrée est couverte d'une couche de neige trop épaisse pour que le convoi puisse se mettre en route.\n\nC'est le premier retard. Nous ne savons ce qui nous attend sur le reste du chemin, mais les physionomies semblent redevenir gaies et confiantes. L'impression pénible du départ et des adieux commence à faire place à la bonne humeur naturelle au soldat, quelque jeune qu'il soit pour la carrière militaire.\n\nSamedi, 4 Avril.—À cinq heures, nous étions sur pieds, frais et dispos; après avoir dormi comme si nous eussions été dans le duvet. Après la prière faite en commun, chaque compagnie séparément, nous allâmes déjeuner au restaurant où hier nous avions soupé de si bon appétit. Après le déjeuner, congé jusqu'à sept heures.\nCarleton est une jolie ville, petite, très petite même. Il y a cependant des manufactures de tweeds assez considérables, que nous sommes allés visiter, et où nous avons été très bien reçus.\n\nM. l'abbé Faguy, qui n'avait pu partir en même temps que nous, est arrivé cette après-midi. Nous avons été très heureux de le voir.\n\nÀ sept heures nous partons pour Mattawa, et, en passant à Ste-Pointe, nous sommes l'objet d'une très jolie démonstration, accompagnée d'un splendide feu d'artifice, mais nous n'arrêtions pas.\n\nDimanche, 5 Avril.—Nous sommes arrivés à Mattawa à sept heures ce matin. Mattawa est situé à deux cent mille en haut d'Ottawa. Divisés par bandes de vingt-cinq, nous allons prendre le déjeuner dans différents restaurants. Il ne faut pas perdre de temps, nous partons à neuf heures pour North Bay, où nous arrivons à onze heures et vingt minutes. Nous voyons en passant le lac Nipissing, long de trente lieues.\n\nÀ Buscotasing, où nous sommes arrivés à neuf heures, nous avons commencé à connaître un peu la misère. Il nous a fallu prendre le souper dans une pauvre cabane en bois rond ; le service n'était pas ce que nous avons eu depuis le départ. Mais n'importe, nous mangeons de bon appétit, et sans murmurer. Nous ne sommes pas soldats pour avoir une belle nappe blanche à chaque repas. Et pourvu qu'on nous donne de quoi satisfaire notre faim, nous ne pouvons trouver à nous plaindre. Si seulement nous étions certains de n'avoir pas à endurer de plus grande misère !\n\nC'est aujourd'hui la fête de Pâques. Nous la célébrons en vrais sauvages. Nous passons la journée dans les chars, et les fêtes religieuses semblent reléguées à l'état de souvenir du temps où nous étions tranquilles à Québec, chacun faisait sa petite affaire comme il l'entendait, sans s'occuper de celles des autres, tandis qu'aujourd'hui notre affaire, c'est d'aller faire la guerre dans un pays que nous ne connaissons pas, contre des gens qui ne nous ont rien fait. Mais le gouvernement sait mieux que nous ce qu'il a à faire. Puisqu'il a décidé d'envoyer des troupes contre les sauvages et les métis révoltés, c'est qu'il a ses raisons pour agir ainsi ; cela ne nous regarde pas, nous ne faisons pas de politique. La politique se fait généralement à\ncoups de livres bleus, et nous n'avons à notre disposition que des fusils. Nous n'avons donc pas d'opinions politiques.—Et d'ailleurs, pourquoi en aurions-nous? Nous n'avons pas à discuter les ordres qui nous viennent des autorités militaires. Tout ce que nous avons à faire, c'est de fermer la bouche, ouvrir les yeux et les oreilles, et marcher où on nous dira d'aller.\n\nEn avant!\n\nIl est dix heures. Nous partons pour Dalton.\n\nLundi, 6 Avril.—Nous avons pris le dîner à Dalton, à deux heures de l'après-midi, puis nous sommes partis pour le lac du Chien (Dog's Lake) où nous sommes arrivés à quatre heures.\n\nÀ Biscotasing, nous avions trouvé un peu dur de prendre le dîner dans un camp. Nous y étions cependant au petit bonheur, en comparaison des difficultés qui nous attendaient. Au lac du Chien, il nous a fallu laisser les chars pour prendre les traîneaux qui nous attendaient, chevaux et mules mangeant tranquillement leur fourrage avant de se mettre en route. Ces traîneaux sont à quatre patins et tirés par deux chevaux. C'est solide, mais c'est dur.\n\nAssis, huit par traîneaux, sur des planches qui servent de sièges, nous partons par des chemins affreux, sur la neige quand nous pouvons en trouver. Souvent il nous faut descendre de voiture et marcher pour soulager nos pauvres bêtes qui ont déjà assez de misère à tirer les traîneaux sur la terre détrempée. La nuit est belle mais froide.\n\nNous arrivons à East Ridout Camp vers minuit, et après avoir grignoté quelques biscuits, nous allons tâcher de dormir un peu. Nous l'avons bien mérité.\n\nMardi, 7 Avril.—À six heures nous étions sur pieds. On fit l'appel, puis nous repartîmes pour un autre trajet de quinze milles. Il tombait une pluie assez abondante, qui avait fini de gâter les chemins. Aussi étions-nous contents quand, à une heure cette après-midi, nos quinze milles parcourus, nous sommes arrivés à l'endroit où recommence la voie du Pacifique. Nous étions trempés jusqu'aux os. À sept heures nous avons repris le chemin de fer.\n\nMais quel chien de chemin nous avons fait! Imaginez une simple plate-forme autour de laquelle on a cloué quelques planches qui sont censées nous mettre à couvert. Ces espèces de boîtes, recouvertes d'une toile grossière, sont ouvertes à\ntous les vents. Il y fait un froid de Sibérie, la pluie y pénètre librement ; c'est à se croire dehors. Franchement si on nous eût fait voyager dans des chars à bestiaux, nous ne serions pas plus mal logés.\n\nNous étions une cinquantaine par boîte, entassés les uns sur les autres, ruisselants de la pluie qui nous tombait sur le dos par torrents. Pour la première fois, nous avons pu connaître ce que c'était que la misère. Pas moyen de nous réchauffer, nous avons à peine le courage de chanter pour nous remettre le cœur. S'il faut que les choses continuent ainsi, nous ne reviendrons pas tous au pays ; plus d'un parmi nous laissera ses os le long de la route.\n\nAh ! le foyer ! la maison paternelle ! comme le souvenir de leur douceur nous est pénible, quand nous sommes privés de tout, exposés à tous les désagréments d'une mauvaise saison !\n\nLes officiers n'étaient guère mieux logés que nous. On les avait fait monter dans une cabane à moitié disloquée où ils ont dû geler à leur aise, eux aussi. Il est bien vrai qu'ils avaient un poêle, mais quand un côté brûlait, l'autre devait être glacé.\n\nUn officier d'ordonnance, après avoir fait une tournée, rapporta au colonel quelle était notre situation. De suite l'ordre fut donné de nous distribuer des couvertures de laine.\n\nMercredi, 8 Avril.—Nous sommes arrivés à huit heures, ce matin, à la Baie du Héron, où le déjeuner excita l'enthousiasme général. Nous avons eu si froid la nuit dernière !\n\nPar bonheur le temps s'était remis au beau.\n\nAprès avoir fait dix milles, nous laissons le chemin de fer à Port Munroe et nous allons camper sur le bord du lac Supérieur.\n\nEn dépit du froid, un des nôtres, M. Charles DeGuise, a composé la chanson suivante, que nous chantons avec un enthousiasme à défier le temps le moins supportable :\n\nVIVE LE BATAILLON !\n\nI\n\nAu Nord-Ouest nous allons,\nOh gué, vive \"la loi\"\nComme de brav's garçons,\nVive \"la loi\" et la Reine,\nComme de brav's garçons,\nVive le Bataillon !\n\nII\n\nOn monte dans les chars,\nOh ! gué; vive \"la loi\"\nAux hôtels nous mangeons,\nVive \"la loi\" et la Reine,\nAux hôtels nous mangeons,\nVive le Bataillon !\nIII\n\nNous aurons d'la misère,\nOh ! gué, vive \"la loi\",\nQu'importe l' nous mont'rons,\nVive \"la loi\" et la Reine,\nQu'importe l' nous mont'rons,\nVive le Bataillon !\n\nIV\n\nSur nous il pleut à verse,\nOh ! gué, vive \"la loi\",\nQu'importe l' nous chant'rons,\nVive \"la loi\" et la Reine,\nQu'importe l' nous chant'rons,\nVive le Bataillon !\n\nV\n\nOn mange dans un camp,\nOh ! gué, vive \"la loi\",\nDes beans et du jambon,\nVive \"la loi\" et la Reine,\nDes beans et du jambon,\nVive le Bataillon !\n\nVI\n\nTout le long de la route,\nOh ! gué, vive \"la loi\",\nNous nous en repentons,\nVive \"la loi\" et la Reine,\nNous nous en repentons,\nVive le Bataillon !\n\nVII\n\nAh ! c'est à Winnipeg,\nOh ! gué, vive \"la loi\",\nC'est là que nous rirons,\nVive \"la loi\" et la Reine,\nC'est là que nous rirons,\nVive le Bataillon !\n\nVIII\n\nL's officiers nous écoutent,\nOh ! gué, vive \"la loi\",\nPour nous ils s'montrent bons,\nVive \"la loi\" et la Reine,\nPour nous ils s'montrent bons,\nVive le Bataillon !\n\nIX\n\nSi Riel fait des blagu's,\nOh ! gué, vive \"la loi\",\nContre lui nous march'rons,\nVive \"la loi\" et la Reine,\nContre lui nous march'rons,\nVive le Bataillon !\n\nX\n\nLes Métis sont des brav's,\nOh ! gué, vive \"la loi\",\nAvec eux nous rirons,\nVive \"la loi\" et la Reine,\nAvec eux nous rirons,\nVive le Bataillon !\n\nXI\n\nRevenus à Québec,\nOh ! gué, vive \"la loi\",\nLes dam's nous souriront,\nVive \"la loi\" et la Reine,\nLes dam's nous souriront,\nVive le Bataillon !\n\nXII\n\nDes fleurs et des bouquets,\nOh ! gué, vive \"la loi\",\nAux brav's elles jett'ront,\nVive \"la loi\" et la Reine,\nAux brav's elles jett'ront,\nVive le Bataillon !\n\nXIII\n\nNous voyant si fêtés,\nOh ! gué, vive \"la loi\",\nLes lâches pleureront,\nVive \"la loi\" et la Reine,\nLes lâches pleureront,\nVive le Bataillon !\n\nXIV\n\nQui a fait cette complainte,\nOh ! gué, vive \"la loi\",\nC'est un du bataillon,\nVive \"la loi\" et la Reine,\nC'est un du bataillon,\nVive le Bataillon !\nVraiment ! nous étions en appétit avant ce chant, mais je crois que M. DeGuise nous a servi là un bitter qui nous a fait manger, ou plutôt dévorer tout ce que nous avions sur le pouce. (Car nous sommes désormais au régime de la gamelle. Ce n'est pas si mal, après tout.)\n\nMes compagnons sont installés dans la cale d'une grande barge. Pour moi, j'ai le plaisir d'être de garde et toute la nuit il va me falloir me promener de long en large, ne goûtant du sommeil que l'envie d'imiter ceux qui ronflent à quelques pas. Pour ne pas trop m'ennuyer et faire diversion au terrible besoin de dormir qui ne cesse de me taquiner, je pense à Québec, aux amis, à la famille que nous avons laissés là-bas. Et mon cœur se serre malgré moi à ce souvenir........Mais, bah ! je reviendrai au foyer, je reverrai mon père, ma mère, mes amis, Québec, l'atelier où j'ai passé de si beaux jours, heureux, sans inquiétude. Oui, je reverrai tout cela...........à moins que la balle d'un sauvage, partie de quelque inégalité de terrain, ne vienne couper court à mon existence, et interrompre ma carrière militaire, pour laquelle je me sens de la vocation........depuis quelques jours.\n\nDormez, mes braves compagnons.—Ne rêvez pas trop aux absents. Cela donne le diable bleu quand on est éveillé. Dormez tranquille. Je continue ma garde.\n\nJeudi, 9 avril.—Tout le monde est sur pieds à cinq heures. Nous déjeûnons à la hâte, et, à dix heures, nous nous mettons en marche. Nous avons à faire vingt milles sur le bord du lac Supérieur.\n\nLe 35ème et le 65me bataillons nous précèdent. L'un d'eux n'a que vingt-quatre heures d'avance sur nous.\n\nNous sommes devenus de vrais militaires, brisés à la discipline. Aussi, recevons-nous à chaque instant des félicitations. Nous en sommes très fiers et nous nous promettons d'en mériter encore davantage.\n\nEnfin nous avons marché nos vingt milles, après avoir enduré des souffrances atroces. Le reflet du soleil sur la neige nous cause un mal d'yeux qui nous incommode grandement. Quel malheur que nous n'ayons pas fait provision de lunettes fumées ou de voiles verts ! quelle belle apparence nous aurions ! Ainsi équipés, à coup sûr, nous n'aurions pas de guerre à faire aux sauvages. Mesdames les Pieds-Noirs et autres grandes\ndames du Nord-Ouest seraient séduites à notre seule vue, et persuaderaient leurs époux de se ranger du côté d'un gouvernement qui aurait pu si bien équiper ses soldats......\n\nMalheureusement, nous n'avons ni lunettes ni voiles, et, à part le chagrin de ne pas rencontrer de sauvagesses à qui nous puissions faire un petit bout de cour, nos pauvres yeux souffrent horiblement. Si nous allions devenir aveugles, et nous tourner les uns contre les autres, chacun prenant son voisin pour un ennemi !\n\nLa prévoyance des autorités nous a épargné un si grand malheur. Après avoir marché nos vingt milles comme des braves, nous avons trouvé un autre tronçon du chemin de fer du Pacifique, où nous attendait un convoi de superbes plates-formes, chars-palais très-primitifs, et qui semblent être la grande mode pour les soldats, dans le pays que nous traversons. Nous sommes casés là-dedans, pressés comme des harengs, à peu près incapables de faire le moindre mouvement........Quand je vois un de ces chars, je sens un frisson mortel courir par tout mon corps. Il me semble être encore à cette nuit atroce que nous avons passée dans une cage à poules montée sur huit roues, et dans laquelle nous avons si bien senti le froid, que nous avons tous failli en crever à la peine ; ce qui serait bien réellement arrivé, si nos bons officiers n'avaient eu l'heureuse idée de nous distribuer un supplément de couvertures.\n\nLe chemin de fer nous a conduit jusqu'à Jack Fish Bay, où nous sommes arrivés à six heures, ce soir. La marche et le mouvement des chars, dont les ressorts ne paraissent pas être d'invention très moderne, nous ont mis en appétit. Nous faisons un excellent souper. Puis, il s'agit d'aller nous coucher. Ce mot, sur moi, eut un effet magique. Je n'oublie pas que j'ai dû avoir les deux yeux ouverts toute la nuit dernière. Aussi, je sens quelque chose comme du sable qui me roule sous les paupières, et je me propose d'en faire, un somme ! !... Dormir ! dormir dans un appartement bien chauffé, couché dans un bon lit, entre un matelas épais et une montagne de couvertures ! comme c'est bon ! On se déshabille lentement, en flânant ; on examine son mobilier, pour se dire comme on se sent bien, puis, après avoir appelé le sommeil de tous ses vœux, on se jette au lit, où une douce chaleur nous entraîne bientôt\nau pays des rêves. Ce n’est là que le sommeil du garçon, et pourtant il a déjà tant de charmes ! que sera-ce donc…… mais, halte là ! n’anticipons pas sur les bonheurs secrets de la vie domestique ; et rappelons-nous, d’ailleurs, que nous sommes ici en service actif, sous l’autorité du gouvernement du Dominion, lequel doit avoir quelque part un projet de loi défendant certains rêves, même quand il est éveillé, au pauvre soldat qui passe la nuit sur le dure, ayant pour lit de plume la terre (ou le plancher du hangar qui nous abrite ce soir) pour courte-pointe la grosse couverture de laine réglementaire, et pour oreiller son havre-sac. Si nos gouvernants n’ont pas encore fait de loi défendant ces sortes de rêves, je leur conseille d’y songer au plus tôt. Le réveil est par trop pénible !\n\nMais, malgré tout, il ne faut pas nous plaindre. Nous sommes au moins à l’abri, et, pour ma part, je suis certain que je vais dormir d’un sommeil de plomb. Bonsoir.\n\nVendredi, 10 Avril.—Hier, à pied, puis en chars. Aujourd’hui en traîneaux. C’est magnifique. Jamais un opulent voyageur, traversant le pays dans un palace-car, ne trouvera sa route aussi variée que celle que nous parcourons.\n\nAprès avoir pris un copieux déjeuner, nous sommes partis à midi, et à neuf heures ce soir, nous sommes arrivés à Mackay’s Harbour, après avoir parcouru vingt-huit milles. Nous ne sommes pas trop fatigués.\n\nNous mangeons la soupe, et, pour faire du changement, nous couchons ce soir dans le camp.\n\nSamedi, 11 Avril.—Décidément, l’uniformité dans le mode de voyager ne nous irait plus. Nous nous fatiguerions outre mesure à voyager à pied, et nous n’arriverions plus ; voyager en traîneaux, ça finirait par nous embêter. Vive les chars…… pour aujourd’hui ! Nous n’avons d’ailleurs fait que 65 milles sur ces charmantes plates-formes, qui nous rappellent assez les élégants tomberaux à charbon dont la musique chatouille si agréablement l’oreille de nos artistes et amateurs de Québec.\n\nIl y a une interruption, longue de quinze milles, sur la ligne du chemin de fer. Nous avons fait cette route à pied, sur le lac Supérieur.\n\nLa dernière partie de ces quinze miles nous a paru d’une longueur interminable.\n\nVoilà quatre jours que nous voyageons continuellement.\nsans prendre de repos, ayant à peine le temps de prendre une bouchée, à travers les bois, les marais, et tout le désagrément d'un pays à moitié sauvage.\n\nEnfin, à neuf heures et demie, ce soir, nous sommes arrivés à Port Arthur, où nous sommes bien contents de nous reposer un peu. Ces chars affreux nous ont brisé les côtes, et nous fatiguent, je crois, autant que la marche.\n\nMais il est minuit et nous recevons l'ordre de reprendre le train pour le Portage du Rat.\n\nDimanche, 12 Avril.—Nous sommes arrivés au Portage du Rat à deux heures, et après-midi ; on nous y a fait une très jolie réception. Une foule considérable s'était rendue à la gare. Il y avait là plusieurs sauvages. Franchement ces gens-là ne sont pas beaux.\n\nWINNIPEG\n\nÀ Winnipeg, où nous sommes arrivés à neuf heures, deux mille personnes, au moins, étaient venues nous rencontrer à la gare.\n\nAprès avoir formé les rangs sur la terrasse qui entoure la gare, nous sommes partis, le sac au dos, pour gagner l'intérieur de la ville. Nous sommes à l'encoignure des rues Maine et Selkirk, à un endroit appelé la Pointe Douglass. Nous logeons sous les tentes qui ont abrité le 65ème bataillon avant son départ pour Calgary.\n\nAvec les couvertures que l'on nous a distribuées et... du soin que l'on a eu la complaisance de nous donner, nous avons une litière très passable. Le temps est splendide, mais un peu sec. Nous allons bien dormir.\n\nLundi, 13 Avril.—Nous avons congé toute la journée. J'ai visité la ville en compagnie d'un de mes amis, soldat de la cinquième compagnie. Je n'essaierai pas de décrire Winnipeg. Le cadre de cet ouvrage ne me le permet pas, et d'ailleurs tout le monde connaît Winnipeg aujourd'hui, même ceux qui n'y sont jamais allés.\n\nMon compagnon avait un pieux devoir à remplir. Dans le cimetière de St-Boniface reposent les cendres de son frère, M. Odilon LeChasseur, décédé le 16 mai 1884. Il était bien connu à Québec, où il exerçait l'état de boucher, à la Halle\nBerthelot. Nous avons déposé sur sa tombe la fleur du souvenir, et une ardente prière est montée de nos cœurs vers le ciel, pour le repos de son âme.\n\nLa mort est toujours pénible, mais elle semble plus triste encore quand on meurt à l'étranger, quand le gazon qui recouvre la tombe n'est jamais foulé par les pieds d'un ami......\n\nMardi, 14 Avril.—Vie de caserne, aujourd'hui, nous avons fait quatre heures d'exercice, depuis dix heures jusqu'à midi, puis de deux à quatre heures de l'après-midi. Il paraît que ces exercices vont nous reposer du voyage que nous avons fait. Tant mieux, car nos membres raidis commençaient à s'en nuire.\n\nAprès le drill, cette après-midi, nous avons eu congé. Nous en avons profité pour aller visiter le Fort Garry, où Riel a fait sa première rébellion. Ce fort avait été primitivement construit en pierre ; mais aujourd'hui il est en ruine, et démolit en partie.\n\nQuand nous aurons quitté Winnipeg, nous allons pouvoir rester en communication avec le monde civilisé. Le commissariat a attaché au bataillon un opérateur de télégraphe, muni de tous les appareils nécessaires ; il nous sera d'une grande utilité pendant la campagne.\n\nNous avons eu une alerte qui s'est trouvée fausse. On avait annoncé que nous partions pour Calgary. Nous avions déjà commencé à faire nos préparatifs quand on nous a donné contre-ordre.\n\nLes officiers nous disent que le colonel Ouimet, commandant du 65e bataillon, qui vient d'arriver de Calgary, fait un bon rapport de cet endroit. Il paraît que les sauvages et les métis y sont très tranquilles. C'est peut-être pour cela qu'on ne nous y envoie pas.\n\nUne troupe de cavalerie de Toronto est arrivée aujourd'hui et a pris ses quartiers en arrière de notre camp.\n\nOn ne se croirait pas ici dans le voisinage des lieux où les troubles ont éclaté. Tous paraissent bien tranquilles. Personne ne s'occupe de l'agitation. Il faut avouer qu'on est plus à même de connaître les dispositions des sauvages. Il paraît que les divisions qui existent entre les différentes tribus seront assez fortes pour les empêcher de se réunir contre le gouvernement. Les pauvres diables feraient bien mieux de tâcher de\ns’accorder entre eux, et de faire la paix avec nous. Ils ne gagneront rien à nous montrer les grosses dents. Ils accusent le gouvernement de mauvaise administration, etc., etc. Cela peut-être vrai ; mais pensent-ils gagner leur cause, obtenir justice, en réclamant leur dû les armes à la main ? Ils doivent avoir plus d’esprit que cela, tout sauvages qu’ils sont. Il est bien évident que le gouvernement, avec les forces dont il peut disposer, restera maître du terrain, quoiqu’il arrive.\n\nQuant aux métis, ils sont choqués de certaines vexations qu’on leur a fait subir ; et quelques cerveaux échauffés semblent en avoir profité pour leur monter l’imagination. Ces pauvres métis peuvent avoir de justes raisons de se plaindre, je n’en sais rien ; mais je leur conseillerais tout de même de garder un peu leur sang-froid. La rébellion ne leur servira de rien, à eux non plus, et l’autorité devra faire respecter ses droits. Il en coûtera peut-être la vie à quelques-uns, mais, outre que nous n’avons pas à discuter les ordres qui nous viennent d’en haut, je crois que c’est un très mauvais système que de demander justice à un homme (à plus forte raison à un gouvernement) la loi dans une main, et un pistolet ou un couteau dans l’autre.\n\nMais voilà que je me mêle de faire des considérations politiques. Dieu ! si quelqu’officier venait à jeter les yeux sur ces lignes ! Je me hâte de les cacher au fond de mon havre-sac et d’aller me coucher.\n\nMercredi, 15 Avril.—Exercices, puis congé. Je suis allé visiter le bloc Cauchon, sur la rue principale. Quel dommage d’avoir eu tant d’argent pour tomber ensuite dans un état voisin de la misère !\n\nJeudi, 16 Avril.—Nous avons eu ce matin la première messe dite au camp. M. l’abbé Faguy, notre aumônier, officiait. L’autel a été dressé sous une tente. Le lieutenant-colonel Amyot et le major Frenette servaient la messe. Presque tous les membres du bataillon y ont communiqué.\n\nVendredi, 17 Avril.—Comme diversion à la monotonie de notre existence depuis que nous sommes à Winnipeg, nous avons eu la distribution faite par le gouvernement des objets suivants : une chemise, une paire de bas de laine, et un bidon avec sa courroie.\nParade dans la rue principale, à sept heures ce soir. Nous sommes allés jusqu'au bloc Cauchon. C'était assez joli.\n\nLe temps a été beau toute la journée. Pendant la parade, il était particulièrement délicieux. Il est possible que demain ne soit pas aussi agréable. De gros nuages noirs, qui couvrent le firmament, indiquent un orage prochain.\n\nSamedi, 18 Avril.—C'est une véritable tempête qui s'est abattue sur la ville, la nuit dernière. Ciel ! que d'eau ! quelle boue ! Du moment que vous y glissez un pied, il en sort gros comme votre tête. Il nous a fallu nous lever dans cette boue infecte, qui colle à tout ce qui la touche. L'intérieur des tentes même n'avait pas été épargné, et dans plusieurs on aurait pu naviguer avec assez de facilité.\n\nAussi nous a-t-il fallu déménager sous une pluie battante. Nous sommes allés établir nos tentes à trois milles de l'endroit où nous avions couché la nuit dernière.\n\nLa journée n'a pas été fertile en incidents, mais le souvenir de la connaissance que nous venons de faire avec la boue de Winnipeg restera longtemps gravé dans notre mémoire.\n\nDimanche, 19 Avril.—Il fait encore aujourd'hui un temps de chien : vent froid, et une pluie fine qui nous pénètre jusqu'aux os. La cavalerie de Québec, qui vient d'arriver, doit se faire une belle idée de Winnipeg. Il faut avouer que ce n'est pas absolument gai.\n\nNos pauvres nouveaux venus ont, comme nous, beaucoup souffert du mal de neige. Ils en ont pour quelques jours à être presque aveugles.\n\nMercredi, 22 Avril.—Enfin nous sommes à l'abri ! ce n'était pas sans besoin. Depuis quatre jours, nous logions sous la tente, sur l'hippodrome, exposés à toutes les intempéries de la saison, nageant dans une boue épaisse dans laquelle nous craignons à chaque instant de laisser nos bottes et même nos personnes. La pluie et le froid nous ont fait souffrir depuis quatre jours, et nous ont causé un ennui que je ne songe pas à décrire.\n\nNotre seule distraction est de courir les rues, et de conter fleurette, quand nous en avons l'occasion, aux jolies anglaises de Winnipeg, qui semblent revenues un peu de la surprise qu'elles ont éprouvée en entendant tant de monde parler français dans la plus grande ville du Manitoba. Je suppose que\nnotre bonne mine a dissipé leur stupeur, car nous sommes en grande estime auprès d'elles ; il faut voir, aussi, si nous flirtons ! Ce serait à se croire en pleine rue St-Joseph, par un beau soir d'été, où sur la Terrasse quand il y a musique.\n\nLe langage de l'amour à ses charmes ; mais, après tout, c'est un piètre dédommagement, dont nous sentons toute la vanité, quand nous retournons au champ, où l'eau qui nous envalit refroidit considérablement le courant de nos effluves amoureuses. Par bonheur, il n'en sera plus ainsi. Nos officiers, toujours prévenants, ont demandé que nous soyons changés de quartiers. À quatre heures, ce soir, on nous a conduits à l'ancien Board of trade Hotel, juste en face de l'hôtel du Canada. Qu'il fait bon de sentir sur sa tête, au moment où on se couche, un bon toit, à travers lequel la pluie ne passera pas ! Si c'était ici que devrait se terminer notre campagne, je serais disposé à être soldat toute ma vie. La caserne a au moins sur le camp l'avantage qu'on n'y vit pas en plein air, quelque temps qu'il fasse.\n\nLes salles que nous occupons, dans ce vieil hôtel, sont spacieuses. Nous nous y sentons parfaitement à l'aise ; nous y respirons à pleins poumons, sans crainte d'être abreuves sans avoir soif. Nous ne sentirons plus, la nuit prochaine, ce frisson glacial avec lequel nous a fait faire connaissance notre contact trop immédiat avec l'air du dehors.\n\nJeudi, 23 Avril.—Nous étions trop heureux. La nuit dernière nous a procuré de trop douces jouissances ; cela ne pouvait durer. À midi, aujourd'hui, nous avons reçu l'ordre de partir pour Swift Current. Cette nouvelle a été accueillie avec une joie mêlée d'un peu de regrets. Nous sommes heureux de partir, car notre inaction prolongée, quand tous les autres corps se rendent à la hâte sur le théâtre de la guerre, commençait à nous peser au cœur. D'un autre côté, nous ne laissions pas sans un léger sentiment de déplaisir ces grands appartements vides, où nous étions si bien après avoir enduré plusieurs jours de mauvais temps. Mais l'idée de marcher de l'avant l'emporta, et l'ordre de partir fut salué d'acclamations enthousiastes.\n\nNous partons donc sérieusement ; peut-être, d'ici à quelques jours, devrons-nous rencontrer l'ennemi, et faire le coup de feu comme de vieux troupiers. Bon nombre d'entre nous\nsont fermement convaincus qu'ils ne reviendront pas vivants à Winnipeg, s'ils y reviennent jamais. Ils n'en sont pas plus tristes pour cela. Ils semblent céder à la fatalité, et se dire que s'ils doivent mourir là-bas, d'une balle lancée au hasard, sur un sol inconnu, peut-être sans avoir un ami qui recueillera leur dernier soupir, ils n'en doivent pas moins tâcher de jouir des quelques jours qui peuvent leur rester à se battre les flancs, et à faire le right ou le left wheel sur la terre des vivants.\n\nL'impression que nous ressentions en quittant Québec renait aujourd'hui. Il n'y a plus les larmes de nos parents, de nos amis, de tous ces êtres que nous aimons plus que nous-mêmes ; mais nous comprenons plus que jamais que nous sommes soldats pour tout de bon et que notre vie n'est plus un jeu. Mais, après tout, s'il faut mourir, nous tomberons sur le champ d'honneur, comme des braves, avec la conscience d'avoir bien fait notre devoir. En attendant, nous chantons, nous répétons avec amour les bons vieux refrains que nous avons appris à Québec dès notre enfance, au grand étonnement de ces bons anglais de Winnipeg, qui n'y voient goutte, et nous regardent tout ébahis, en ayant l'air de ne pas comprendre comment nous pouvons chanter si galement dans cette circonstance, si loin du Home, Sweet Home.\n\nJuste au moment où j'écris ces lignes, je suis distrait par les gais échos de\n\nEn roulant ma boule,\n\nqui me viennent de la chambre voisine, poussés par vingt poitrines vigoureuses. Ça n'a pas la douceur de la brise se jouant sous le feuillage, par un beau soir d'été ; mais comme ça fait du bien, d'entendre les chants de son pays, à cette distance de Québec.\n\nÀ six heures et demie nous avons quitté Winnipeg. À notre départ de l'hôtel, un individu bien mis, ayant assez l'apparence d'un homme bien élevé, probablement le sang échauffé parce qu'il n'avait pas mis d'eau dans son vin, s'approcha de nous et commença à nous insulter. C'était un anglais, ennemi du nom canadien-français. Il a voulu porter l'enthousiasme jusqu'à frapper un de nos officiers. Mais on l'a prévenu ; un sergent lui a appliqué un coup de poing dont il se souviendra.\nlongtemps. Voilà ce qu'il a dû appeler, dans sa langue maternelle, short and sweet.\n\nTel a été notre adieu à Winnipeg. Nous sommes bien décidés à ne pas nous laisser insulter par le premier malotru venu, qui s'arroge le droit de venir nous cracher à la face ses lâches injures. Le soldat canadien est comme son confrère de la vieille France ; il a le cœur bon, mais, à l'occasion, le poing dur.\n\nÀ 9 heures, nous passons le Portage de la Prairie.\n\nSWIFT CURRENT\n\nVendredi, 24 Avril.—Nous avons fait du trajet aujourd'hui. À 10 heures ce matin, nous passions à qu'Appelle, où trois cents soldats sont casernés. L'endroit est assez joli. Nous n'y avons pas fait une longue station, et nous sommes repartis pour Régina, où nous sommes arrivés à midi. Nous prenons le temps de mesurer à l'œil le toit de la gare, et en route pour Moose Jaw (La machoire de l'Orignal). Nous avons trouvé là une bande de Sioux, qu'on dit s'être échappés des États-Unis, où ils avaient commis toutes sortes de mauvais coups. Ils sont à Moose Jaw depuis trois ou quatre ans, je crois.\n\nDire que ces Sioux sont beaux serait une calomnie atroce. En leur qualité de sauvages, ils peuvent avoir une certaine beauté ; mais, habitués que nous sommes à voir nos canadiens, et surtout nos canadiennes à la mine avenante, les Sioux nous ont paru affreusement laids; avec leur corps et leur visage peinturés de toutes les couleurs; et leur chevelure ornée de plumes et autres ornements, le tout d'un goût douteux.\n\nAprès avoir pris notre premier repas de la journée, nous sommes repartis à six heures pour Swift Current, et nous y sommes arrivés à huit heures. Soixante minutes plus tard, les tentes étaient montées. Notre camp présente un très joli coup-d'œil. À gauche sont les tentes des soldats, compagnie par compagnie, contenant chacune six soldats bien disposés à dormir. À droite sont dressées les tentes des cuisiniers, fonctionnaires dont le travail prend une importance considérable trois fois par jour. À la suite viennent les tentes des officiers de chaque compagnie, puis celle de l'hôpital, du télégraphe, et des officiers de l'état-major.\nIl paraît que la nuit va être très-favorable au sommeil. Les secousses réitérées éprouvées pendant un long trajet en chemin de fer nous faisaient désirer ardemment nos lits. Aussi je jouis à l'avance du bonheur...... que vont éprouver mes confrères. Pour moi, je suis de garde.\n\nSamedi, 25 Avril.—La nuit s'est passée bien tranquillement. Je n'ai remarqué rien d'anormal autour du camp. J'avais, pour accompagner mes réflexions, les ronflements sonores du bataillon tout entier. Ce n'était peut-être pas très beau comme harmonie, mais ça me donnait une furieuse envie de me joindre au concert.\n\nÀ quatre heures, cette après-midi, on nous a donné congé. Nous avons parcouru la ville, composée de cinq ou six maisons occupées par des marchands. On ne peut pas dire que le plaisir s'offre ici à nous sous toutes les formes. C'est un vrai pays à sauvages. Aussi, au lieu de faire comme de bons québécois, qui arpentent, de quatre à six heures, la rue St-Jean ou la rue St-Joseph, nous sommes allés nous promener dans la prairie, c'est le seul boulevard de l'endroit. Comme diversion, nous avons causé avec les sauvages, pour qui notre belle langue est du grec. D'ailleurs, pour nous rendre le change, ils nous répondent par un baragouinage auquel nous ne comprenons pas un traître mot.\n\nAprès nous être esclimés, pendant je ne sais combien de temps, désespérant de faire entendre raison à ces barbares, nous sommes revenus au camp, et comme il est dix heures, je vais me coucher, pour reprendre le sommeil perdu de la nuit dernière.\n\nDimanche, 26 Avril.—M. l'abbé Faguy, notre aumônier, nous a dit la messe, ce matin, à 9 heures. On avait dressé l'autel sous une tente au milieu du camp. La messe a été servie par deux officiers. Une cinquantaine d'entre nous y ont communiqué.\n\nLundi, 27 Avril.—Partis, au nombre d'une douzaine environ, pour aller faire une promenade dans la prairie, nous avons trouvé, à quelques arpents du camp, une fosse, ou plutôt une espèce de trou irrégulier, dans lequel étaient enfouis plusieurs cadavres de sauvages. La sépulture se fait ici d'une façon assez sommaire. On entortille le corps d'une couverture en laine blanche ; c'est à la fois son linceul et son cercueil. On\nentoure son cou d'un collier de perles, et à ses côtés on place un arc et des flèches, en cas qu'il lui prenne fantaisie d'aller chasser sous terre. Et la cérémonie est terminée ; chacun, comme dans la chanson, s'en retourne chez lui.\n\nCe matin, un métis français est venu trouver M. l'abbé Faguy et lui a demandé de baptiser un de ses enfants, âgé de quatre mois. Notre bon aumônier ne demandait pas mieux que de faire naître à la lumière de la foi cet enfant de la plaine, et se rendit avec bonheur au désir du métis. Vers dix heures, celui-ci est revenu avec sa femme, son enfant et six autres femmes. C'est un du bataillon qui servit de parain. Après la cérémonie, les femmes se confessèrent à M. l'aumônier.\n\nMais, il fallait fêter ce baptême, chose assez extraordinaire dans un camp. Le sergent-major Trudel fit une tournée, et revint avec deux sacs de biscuits, chaque soldat ayant généreusement donné une partie de sa ration. Inutile de dire que nos visiteurs sont partis enchantés de la réception que nous leur avions faite. Ce métis est très pauvre. Il est un de ceux qui ont refusé de prendre part à la rébellion.\n\nMardi, 28 Avril.—Notre séjour à Swift Current n'a pas été de longue durée. L'ordre est venu aujourd'hui de partir pour Calgary. La vie commençait à devenir un peu monotone. La prairie à perte de vue, entourant cinq ou six mauvaises baraquées ; décidément, ce n'est pas gai. Aussi n'étions-nous pas fâchés d'aller voir du pays nouveau, quitte à retrouver le même horizon banal : la prairie.\n\nÀ deux heures, le général Laurie a passé le bataillon en revue, et à cinq heures le signal du départ était donné.\n\nLe général est venu nous faire ses adieux, et la musique du bataillon Midland nous a salués de plusieurs des plus beaux morceaux de son répertoire.\n\nCALGARY.\n\nMercredi, 29 Avril.—Nous sommes arrivés à Calgary à neuf heures, ce matin. Quel beau pays ! Il y fait une vraie chaleur du mois de juillet à Québec ; mais le temps est sec, ce qui est bien préférable.\n\nAprès le déjeuner pris, nous avons monté les tentes, aux sons de la trompette. Du camp, nous apercevons les Mon-\ntagnes Rocheuses, dont nous ne sommes pas très éloignés. A nos pieds coule la rivière Bow, où nous avons eu le plaisir de prendre un bon bain, luxe que ne peuvent pas se payer, à cette saison de l'année, nos bons amis de Québec.\n\nIl y a ici beaucoup de Métis et de Pieds-Noirs. Loi, de nous regarder d'un mauvais œil, ils causent avec nous, et semblent animés des dispositions les plus amicales. Ils sont parfaitement indifférents à ce qui se passe dans le Nord-Ouest depuis le commencement de la rébellion. Les Métis, d'ailleurs, paraissent jouir d'un tempérament excessivement froid. Pourvu qu'on les laisse en paix faire leur petite affaire, ils ne songeront pas à se soulever, ayant assez de jugement pour comprendre que cela ne leur servirait pas à grand'chose.\n\nJeudi, 30 Avril.—Plaignez-vous, bonnes gens de Québec qui ne savez plus quel saint invoquer, quand vous trouvez qu'il fait trop chaud, dans la vieille cité de Champlain, le 15 juillet, alors que le soleil est dans toute sa force ; plaignez-vous que la sueur vous inonde, quand vous avez fait deux pas dans la rue ; plaignez-vous, jolies femmes qui osez à peine jeter un regard timide à travers les fentes de vos persiennes soigneusement closes, de crainte de vous évanouir au seul contact de l'air du dehors, auquel vous trouvez une chaleur suffoquante ; plaignez-vous, jeunes gens oisifs qui trouvez le temps détestable parce que l'ardeur du soleil peut brunir vos mains blanches ou votre teint de jeune fille. Plaignez-vous tous. Ici, nous ne sommes qu'au 30 avril, et il fait si chaud, qu'après nous avoir fait faire un peu d'exercice, nos officiers ont trouvé prudent de ne pas nous faire affronter d'avantage les rayons de Phebus. Et cependant nous ne nous plaignons pas. Notre teint est bruni, mais nous ne nous chagrinons pas pour si peu. Le soleil nous brûle, mais nous ne nous laissons pas envahir par l'idée traîtreuse de faire la paresse. Au contraire, nous n'avons jamais chanté avec autant d'enthousiasme : \"Vive la canadienne !\" Nous y pensons bien souvent, à cette belle canadienne. Chacun de nous a bien à son actif deux ou trois petits souvenirs d'amourettes envolés comme des feuilles à l'automne, pour renaître comme les fleurs, plus suaves, plus ardentes qu'à la saison précédente. Imaginez si le passé nous est venu à la mémoire, pendant cette grande journée que nous avons passé étendus sous la tente, n'ayant rien à faire; de par\nl'ordre de nos supérieurs, chacun caressant le souvenir de la belle jeune fille qu'il a laissé derrière lui, se rappelant avec bonheur et regret ces cheveux blonds ou châtain, ces yeux bleus ou noirs, qu'il a contemplés si souvent, cette main mignonne qu'il a pressée tant de fois sur son cœur... et sur ses lèvres, quand des regards indiscrets ne venaient pas troubler les confidences amoureuses qu'ils échangeaient alors.\n\nOn repasse dans son cœur ces doux propos, avant-coureur d'un bonheur longtemps désiré, promesses de félicités plus grandes ; et si parfois une larme vient mouiller la paupière du rêveur, il la refoule aussitôt pour se livrer à l'espérance de revoir bien-tôt celle qu'il aime.\n\nFranchement, pouvons-nous nous plaindre d'avoir passé une telle journée ? Il est vrai que nous serions encore plus heureux si la réalité était venue supplanter nos rêves. Mais, dans les circonstances actuelles, combien envieraient notre sort !\n\nVendredi, 1er Mai.—On nous a exempté de la parade aujourd'hui. La journée s'est passée en fatigue party, histoire de nous reposer, après avoir fait un assez long trajet en chemin de fer.\n\nLe bataillon a commencé à se désarmer. Les compagnies No. 1, No. 2 et No. 8 sont parties pour aller garder le fort McLeod, situé au sud-est de Calgary. Nous avions l'espoir que nous resterions tous ensemble pendant la campagne. Les autorités en ont décidé autrement. Il faut bien nous y conformer, et, par dessus le marché, ne rien dire, chacun devant s'occuper de ce qui le regarde, d'après un principe bien connu mais généralement assez mal suivi. Nous ne discutons rien dans les ordres qui nous sont donnés ; qui sait, si on nous permettait d'avoir une opinion, à quoi nous nous arrêterions ! L'un voudrait aller de ci, l'autre de là ; chacun marcherait de son côté, laissant le chemin libre aux ennemis, qui en feraient de belles en se riant de nous.\n\nIl n'en est pas moins pénible de nous séparer de nos compagnons. Nous leur avons serré la main non sans une certaine émotion. Partis ensemble de Québec, nous sommes accoutumés, depuis assez longtemps, à vivre comme des frères. Les mêmes souvenirs emplissent nos cœurs ; nous avons laissé en arrière, loin, bien loin d'ici, les mêmes affections. Leur départ nous\ncause un chagrin que tout homme de cœur comprendra aisément.\n\nFort McLeod est à 110 milles de Calgary. Les communications, si elles ne sont pas des plus commodes, sont toujours possibles. Nous espérons avoir souvent des nouvelles de nos amis, en attendant que nous soyons réunis encore une fois.\n\nSamedi, 2 Mai.—Il a fait aujourd'hui une chaleur écrasante. C'est à se croire en plein été. Aussi la journée n'a-t-elle pas été féconde en travail.\n\nNous avons eu congé, et nous en avons profité pour aller faire une promenade le long de la rivière Elbow. Nous sommes ensuite montés sur une petite montagne, d'où nous avions une vue magnifique des Montagnes Rocheuses. Quel panorama splendide ! Ces pics gigantesques, dont les sommets couverts de neige semblent toucher le ciel, et entre lesquels l'œil devine des abîmes sans fond, étonnent l'imagination, et nous font frémir. Quelle idée ce spectacle nous donne de la puissance de Celui qui a pu, par le seul exercice de sa volonté, créer de semblables choses ! La main de l'homme peut produire des merveilles, mais que vaut le trait de génie qui a enfanté St-Pierre de Rome, à côté de la pensée qui a créé les atomes formant le marbre dont est construit ce chef-d'œuvre de l'imagination humaine ?\n\nAprès avoir donné le jour à de si prodigieuses réflexions, on trouvera bon que j'aille me coucher.\n\nDimanche, 3 Mai.—À neuf heures, ce matin, le R. P. Claude, desservant de la chapelle de Calgary, est venu nous chanter la messe au camp. Il nous a fait un magnifique sermon, qui a été bien goûté de tout le monde. À trois heures de l'après-midi, nous avons eu les vêpres.\n\nDEUIL DANS LE CAMP.\n\nÀ cinq heures, il est arrivé une dépêche qui nous a plongés dans le deuil et la douleur. Théophile Marois, de la compagnie No. 4, vient de mourir, à l'hôpital de Swift Current.\n\nMarois était de garde, un jour, à Swift Current, quand, tout à coup, il s'affaisse sur lui-même. Quelques-uns de ses compagnons le transportèrent à l'hôpital, et quelques instants après, il se sentait beaucoup mieux. Quand nous avons quitté Swift\nCurrent, il voulait partir avec nous, mais on ne le lui permit pas, à cause de sa grande faiblesse. Nous n'avions plus eu de ses nouvelles depuis ; aussi grande a été notre surprise en apprenant sa mort.\n\nMarois était un excellent garçon, que tout le monde aimait, au bataillon. C'était un vrai type du bon soldat, le cœur dans la main, toujours le premier quand il s'agissait de faire quelque chose pour un camarade.\n\nLa misère que nous avons endurée pendant les premiers jours de notre voyage, sur les bords du lac Supérieur, avait achevé de miner sa constitution déjà ébranlée, et il est tombé première victime du devoir. Il laisse une femme et plusieurs enfants. Mort loin de sa patrie, de sa famille, de ses amis, il a éprouvé l'amertume de la solitude au dernier moment. Dieu lui tiendra compte, dans sa miséricorde, des souffrances physiques et morales qu'il a endurées.—Requiescat in pace.\n\nLundi, 4 Mai.—À huit heures, ce matin, M. l'aumônier a dit une messe de Requiem pour le repos de l'âme de Théophile Marois.\n\nDécidément, la fatalité nous poursuit. Le deuil qui régnait depuis hier dans le camp s'est augmenté encore par la mort d'un autre camarade, Achille Blais, que nous avions dû laisser à l'hôpital, à notre passage à Winnipeg. Il est décédé le 30 avril.\n\nM. l'abbé Faguy a aussi reçu une dépêche de Québec lui annonçant la mort de son père. Nos sincères condoléances à notre digne aumônier.\n\nCe triple deuil est vivement ressenti par le bataillon.\n\nMardi, 5 Mai.—Le corps de l'infortuné Marois nous est arrivé ce matin. Le colonel a décidé de le faire venir ici, afin que ses camarades ait la consolation de lui rendre les derniers devoirs. Nous sommes très-reconnaissants à notre commandant de cette preuve de bonté.\n\nUne voiture attelée de six chevaux et escortée de vingt soldats est allée chercher le corps à la gare, et l'a ramené ici, où il a été déposé dans une salle des casernes. Des soldats de sa compagnie ont fait la garde autour du cercueil. Le défunt est revêtu de l'uniforme du bataillon.\n\nÀ neuf heures tout le bataillon est allé réciter le chapelet dans la chambre mortuaire.\nNotre journée a, en outre, été remplie par deux événements d’une nature un peu moins attristante. Nous avons dû arrêter un soldat du bataillon d’infanterie légère de Winnipeg, dont deux compagnies sont aussi stationnées à Calgary. Cet individu, qui répond au nom de Ross, avait voulu se passer la fantaisie de décharger son revolver sur un des cuisiniers. Nous avons trouvé sur lui, outre son revolver, deux ou trois montres, deux chaînes, un médaillon, et près de mille piastres en billets de banque contrefaits.\n\nLe second événement fut une\n\nVISITE DES SAUVAGES.\n\nNous avons eu, hier soir, une alerte. Quelqu’un s’est écrié tout-à-coup que les sauvages marchaient sur Calgary, et que, dans quelques minutes, nous allions les avoir sur les bras. Grand émoi dans le camp, comme on peut se l’imaginer. En un instant chacun fut debout, la carabine à la main. Nous voyions déjà l’ennemi en face de nous, tatoué de la tête aux pieds, en grand costume de guerre, les yeux lançant un feu sombre et nous menaçant du terrible tomakawk. Notre enthousiasme ne connaissait plus de bornes. Nous allions donc enfin avoir une occasion de prouver notre bravoure !... Chacun supputait déjà dans son esprit exalté, le nombre de peaux rouges qu’il enverrait paître dans les grandes prairies de l’autre monde des sauvages, quand on vint jeter de l’eau froide sur nos imaginations en feu. Ceux que nous prenions pour des ennemis redoutables, dont nous voulions avoir si facilement raison, étaient tout simplement une tribu de Sarcis, composée de deux à trois cents sauvages, et qui, ayant appris notre arrivée à Calgary, avait résolu de venir nous faire visite au camp, pour nous prouver son attachement à la Reine d’Angleterre, souveraine légitime de ce pays, et à son représentant, le gouvernement du Dominion.\n\nLes sauvages campèrent en face du fort, à-peu-près à un mille de distance. Leurs tentes, sales, déguenillées, noircies par la fumée des feux qu’on allume à l’intérieur, présentent un coup d’œil qui n’est pas absolument désagréable.\n\nLes sauvages ont avec eux une quantité considérable de chiens qui nous ont fait, pendant toute la nuit, un vacarme\népouvantable. C'était à se demander si nous n'étions pas en présence d'un corps de l'armée infernale.\n\nIl a fallu faire bonne garde toute la nuit, de crainte d'un coup de main. Les sauvages que nous avons dans notre voisinage protestent de leur fidélité à la Reine, et de leurs bonnes dispositions à notre égard; mais il ne serait pas prudent de trop se fier à eux. Il pourrait fort bien leur prendre fantaisie de nous priver de nos précieuses existences, ce qui ne ferait pas du tout notre affaire.\n\nLa tribu a voulu nous donner une fête aujourd'hui. Nos dispositions d'esprit ne nous portaient guère à rire des contorsions de ces sauvages. Nous étions plutôt enclins à la tristesse. Le cadavre de notre ami Marois, exposé à quelques pas de nous, nous attire plus que toutes les réjouissances dont on peut nous régaler. Mais il a bien fallu céder aux besoins du moment. Nous avons ordre de ne pas mécontenter les sauvages que nous rencontrons. Or, refuser d'assister à leur fête, serait considéré comme une marque de mépris, une injure grave, et nous mettrait à dos ces braves gens que nous voudrions voir à tous les diables. Force nous a donc été de faire diversion aux idées tristes qui envahissent nos coeurs, et d'assister à la sarabande infernale que les Sarcis ont exécutée en présence du bataillon et d'une foule de curieux.\n\nLe chef de la tribu, véritable agent théâtral, était venu au camp, ce matin, en compagnie du R. P. Lacombe, et avait pris ses arrangements pour la représentation. Ce chef, qui s'appelle Tête-de-Taureau, est un grand diable, haut de plus de six pieds. Il porte un immense chapeau de feutre mou, campé sur l'oreille droite, et est vêtu d'un capot de laine bleue, orné d'un capuchon. Il fume continuellement, peut se donner le luxe d'un cigare de temps à autre, et, sans doute pour produire plus d'effet, a toujours la main passée dans la poche de son pantalon. Il vous a un air de matamore qui ne laisse rien à désirer. Si on lui disait que toute la terre lui appartient, il ne se ferait pas prier pour le croire, tant il paraît avoir une haute idée de sa puissance et de sa grandeur.\n\nAprès la parade de deux heures, nous avons vu arriver les sauvages, défilant sur une longue ligne, sales individus à la figure généralement repoussante, vêtus de haillons qui laissent voir leurs peintures d'un goût douteux, souvent leurs\ncorps, ayant dans les cheveux des plumes de toutes les couleurs, le cou, les oreilles, les bras chargés d'ornements en cuivre. J'en ai vu qui avaient pour boucles d'oreilles des clefs en fer. Pour compléter cet attirail bizarre, chacun tient à la main un fouet : ça m'a tout l'air d'une règle à laquelle on ne peut se soustraire. Toute cette foule chantait, criait, hurlait, comme une bande de possédés. Je ne sais comment nous avons fait pour ne pas nous enfuir, pris de frayeur.\n\nQuand ils furent rendus sur le théâtre choisi par le grand chef, un d'entre eux annonça que la fête allait commencer. Du moins, c'est ce que j'ai compris. Aussitôt, sur l'ordre de Tête-de-Taureau, tous s'accroupirent sur le sol, en formant un grand cercle, à l'une des extrémités duquel prirent place les sous-chefs. Au centre de ce cercle se mirent les musiciens et chanteurs. L'orchestre se composait d'un tambour, d'origine inconnue, et qui ne trouverait sa place dans aucun corps de musique de pays civilisés. Un des musiciens annonça alors que les sauvages allaient danser pour nous faire plaisir, parce que nous étions les amis des sauvages. Aussitôt s'éleva un cri formidable, accompagné du son du tambour, frappé par des bras vigoureux. Cela veut dire, en langue Sarcis, que le discours de l'orateur était approuvé.\n\nCe fut le signal du concert. L'orateur qui avait provoqué une si bruyante approbation de son discours attaquait une note qu'il alla prendre je ne sais où. Les autres l'imitèrent. Chiens, chats, bœufs, moutons, lions, tigres, et vous tous, animaux des forêts, et bêtes domestiques, vous étiez représentés à ce charivari qui doit nous donner une idée assez fidèle des tourments de l'enfer. Les oreilles m'en tintent encore. J'en suis tout abasourdi.\n\nPendant tout ce temps, la bande hurlante dansait et s'en donnait sur toutes les formes. La plupart s'étaient débarrassés du reste d'habillement qui aurait pu gêner leurs mouvements désordonnés, et nous avons eu sous les yeux les êtres les plus dégoûtants qui se puissent rencontrer. Ces individus, peinturés de diverses couleurs, des pieds à la tête, couverts de dessins baroques, ressemblaient moins à des êtres humains qu'à des suppôts de Satan. Et tout cela dansait, gesticulait, faisait mille contorsions ridicules, de l'air d'hommes qui accomplissent un devoir pénible, mais de la réussite duquel dépend leur honneur, ou même leur vie.\nCette monstrueuse représentation a duré deux grandes heures.\n\nLes femmes ne prennent pas part à la danse, non plus que les enfants et les chiens, qui pourraient cependant y jouer un aussi beau rôle que les hommes, après tout. Ce noble exercice est réservé aux hommes seuls, aux guerriers de la tribu. C'est dommage. Avec cette addition, le spectacle eût été plus complet ; mais l'aréopage de ces tribus en a décidé autrement. Les squaws, avec leurs babouins et les animaux se tiennent à l'écart, en arrière du cercle formé par les danseurs, mais tous ont le droit de se mêler au chant. Comme chez les nations civilisées, on laisse à la femme, chez les peuplades sauvages, la liberté de crier tant qu'elle peut. Les sauvages-ses savent en profiter comme les autres.\n\nPlusieurs sauvages ne se soucient pas beaucoup de danser. Ils préfèrent rester accroupis sur leurs talons et regarder faire les autres. Mais cela ne fait pas l'affaire des directeurs de ce cirque satanique, dont Barnum devrait se procurer des échantillons. Un vieux chef, armé d'un sabre de cavalerie dont il semblait très fier, ne cessait de gourmander les paresseux. Un des plus récalcitrants eut même sa couverture mise en lambeaux par les coups de sabre que lui appliquait son supérieur avec une générosité digne d'un succès plus grand. Le grand flandrin, qui se laissait ainsi maltraiter sans proférer une plainte, devait avoir son but pour agir de la sorte. Je crois même qu'il y voyait un moyen de se faire habiller à bon marché, car, au bout de quelques instants, nous vîmes un sauvage lui apporter une couverture neuve, dont il fera ses beaux dimanches, jusqu'à ce que la prochaine grande danse lui fournisse une nouvelle occasion de remonter sa garde-robe.\n\nAprès la danse, ce fut notre tour d'entrer en scène, et de montrer aux sauvages ce que nous pouvions faire. Sous les ordres du lieutenant-colonel Evanturel, nous avons fait l'exercice à la carabine et à la baionnette, au grand épanouissement de ces braves Sarcis, qui n'avaient jamais été témoins d'un spectacle semblable.\n\nLa cérémonie s'est terminée par la distribution des cadeaux. C'était là, pour les sauvages, la partie la plus intéressante de la journée. Le fait est que leur visite n'avait guère d'autre but, pauvres comme ils sont, un cadeau de biscuits, de vêtements\net de tabac, est une grande affaire pour eux. La distribution faite, nous avons éprouvé un grand soulagement en voyant sortir du camp cette horde infecte, que nous espérons bien ne pas rencontrer de sitôt. Leur malpropreté nous inspire des craintes sérieuses pour notre tranquillité, et leur présence est souvent le signal d'une invasion de voisins, petits à la vérité, mais d'une cruauté inouïe, et dont on se débarrasse assez difficilement.\n\nFUNÉRAILLES DE MAROIS.\n\nMercredi, 6 Mai.—Les funérailles de Théophile Marois ont eu lieu ce matin. À neuf heures, nous avons formé les rangs, et nous sommes allés à la caserne chercher le corps de notre ami. Une garde d'honneur escortait le cercueil entouré du drapeau anglais et placé sur une voiture attelée de six chevaux. Sur le cercueil on avait mis la coiffure et le sabre-baïonnette du défunt. Le cortège se composait du frère du défunt, qui conduisait le deuil, du 9ème bataillon, d'une compagnie du bataillon de Winnipeg, et de tous les officiers. Derrière les militaires venaient plusieurs citoyens de Calgary. Le convoi se rendit à la chapelle de la mission, décorée pour la circonstance.\n\nUn chœur nombreux, composé de presque tous les soldats du bataillon, chanta la Messe des Morts. M. le capitaine Le-Vasseur accompagnait à l'harmonium. Pendant la messe, les morceaux suivants ont aussi été chantés : Jusque à quand ; Je ne voyais au milieu de ma course ; Jesu salvator mundi, et A la mort, pécheur, tout finira.\n\nLe R. P. Lacombe officiait. Après l'absoute, il nous adressa l'allocution suivante :\n\n\"Frères et amis, il convient que devant cette tombe je vous adresse la parole. Je vous ai vu, dans le camp, j'ai conversé avec plus d'un d'entre vous, mais il était décrété que devant ce cercueil un vieux missionnaire, depuis trente-cinq ans dans ces vastes plaines du Nord-Ouest, loin de son pays, devait faire connaissance officie le avec des canadiens-français, ses frères de là-bas.\n\nIl nous était donné de verser ensemble des pleurs avec des prières sur les restes mortels de notre compagnon. Il était parti pour le feu, prêt à mourir l'arme au bras pour faire respecter l'autorité du pays, mais Dieu l'a frappé dans un hôpital solitaire, le long d'un chemin de fer. Y en aura-t-il même parmi ceux qui aujourd'hui brûlent du désir de se mesurer avec\nl'ennemi, qui tomberont sous les coups de la mort avant d'avoir aperçu le champ de bataille ?\n\nDes félicitations vous sont dues pour avoir fait venir le corps de votre camarade pour lui donner une sépulture digne d'un chrétien, et du bataillon qui fait honneur à la province de Québec.\n\nPauvre bon compagnon, nous lui devions bien cette dernière preuve de notre sympathie et de notre douleur ! C'était le premier d'entre nous qui devait manquer à l'appel, à notre retour ! Quand nous reviendrons à Québec, quand toute la population viendra nous recevoir, au milieu de la joie générale, dans la maison de Marois, il y aura de nouvelles larmes. Sa veuve, ses enfants, cachés au fond de leur demeure, sentiront se raviver la plaie de leur cœur; et l'allégresse des autres leur rappeler plus vivement encore celui qui dort désormais dans le cimetière de Calgary. Pauvre veuve ! pauvres orphelins ! consolez-vous. Votre protecteur n'est plus, il est vrai, mais sa mort a été celle d'un brave et d'un chrétien. Et la Providence vous dédommagera des larmes que vous aurez versées.\n\nAprès le libera, le cortège funèbre se reforma et prit le chemin du cimetière, situé à un demi-mille de la chapelle, dans la prairie. Le prêtre récita les prières, puis, le cercueil descendu dans la fosse, le piquet d'honneur tira trois salves d'adieu, et après avoir dit le dernier Requiescat in pace. Amen, nous repîmes le chemin de Calgary, émus de la cérémonie imposante dont nous venions d'être témoins.\n\nLa scène de l'enterrement avait été rendue plus grandiose encore par la présence d'un grand nombre de sauvages, Pieds-Noirs et Sarcis, attirés par la curiosité, et qui s'étaient échelonnés sur le flanc d'un mamelon.\n\nSur la fosse dans laquelle reposent les restes de notre malheureux ami, on a placé une croix noire portant ces mots :\n\nTHEOPHILE MAROIS\nDied May 3rd 1885.\n\nAchille Blais a succombé, lui aussi, aux misères que nous avons endurées le long du chemin. Le métier de soldat était\ntrop rude pour un homme aussi faiblement constitué. Aussi n'a-t-il pas pu y résister longtemps. Il lui a fallu rester à l'hôpital de Winnipeg, ses forces épuisées ne lui permettant pas d'aller plus loin. Nous l'avions quitté sans espérance de le revoir, mais nous pensions qu'il pourrait au moins aller mourir au milieu des siens. Dieu ne l'a pas voulu. Respectons ses desseins adorables. Quand nous repasserons à Winnipeg, nous ne manquerons pas d'aller prier sur la tombe du cher défunt, qui repose à 900 milles de distance du lieu où est enterrée la dépouille mortelle de cet autre victime de la fatalité Théophile Marois.\n\nQue Dieu, dans sa miséricorde, ait pitié de leurs âmes, et épargne de nouveaux deuils à notre bataillon déjà si éprouvé!\n\nLES PIEDS-NOIRS.\n\nNous avons reçu, dans l'après-midi, une seconde visite de sauvages. Cette fois, le nom était changé; nous n'avions plus les Sarcis, mais les Pieds-Noirs. La députation avait à sa tête Pità-pi (Aigle Assis). Il était accompagné d'une dizaine de femmes et enfants. La députation était présentée par le R. P. Lacombe.\n\nCes sauvages ne sont pas toujours des modèles de modestie. Nous avons pu en juger par le discours de Pità-pi. Il dit que le grand chef, Pied-de-Corbeau, et lui, sont les plus grands parleurs de la tribu. Je crois sans peine, car il m'a fait l'effet d'être un bavard interminable, une vraie machine à parler. Il déclaré que les Pieds-Noirs n'ont pas l'intention de faire la guerre aux blancs, qu'au contraire ils sont animés à leur égard des meilleures dispositions possibles. Ils ont d'ailleurs (toujours d'après le chef) un caractère très-pacifique, ne s'occupant qu'à chasser le gibier dont ils se nourrissent. On a bien voulu les inciter à entrer dans le mouvement de révolte contre le gouvernement; mais ils ne veulent que la paix.—Leur tribu était autrefois maîtresse du pays; sa richesse et sa puissance étaient immenses, elle pouvait alors faire des cadeaux magnifiques. Mais les temps ont changé. De maîtres, les Pieds-Noirs sont devenus sujets. Leur influence est restée considérable dans le pays, car le renom de la tribu s'est répandue au loin. Ils désirent être en bons termes avec les nouveaux maîtres de la\ncontrée.—Morale : \"Nous voudrions avoir de la poudre et des balles pour faire la chasse.\"\n\nC'est par là que finit toujours un discours de sauvage.\n\nMalheureusement pour lui, Pi-ta-pi reçut une réponse défavorable. Le colonel lui fit remarquer qu'il avait eu défense de distribuer des munitions à d'autres qu'aux soldats. Cette nouvelle parut le déconcerter joliment. Comme compensation, il leur fut faite une abondante distribution de vivres.\n\nTous ces sauvages sont d'une avidité insatiable. Plus on leur donne, plus ils veulent avoir. Ils ne se gênent pas de demander tout ce qui s'offre à leurs regards. Et si on n'avait l'œil sur eux, ils se gêneraient encore moins pour prendre ce qui les tente, sans en obtenir l'autorisation. Ils ont une singulière idée de la propriété... chez les autres, ne se faisant aucun scrupule de saisir tout objet qui se trouve à leur portée. Ils sont, par contre, d'une générosité excessive pour la distribution gratuite de la vermine qui les couvre des pieds à la tête. Car, qu'ils s'appellent Sarcis, Pieds-Noirs, ou autres, leur malpropreté est digne de remarque. Partout, ce sont les mêmes haillons sales, les mêmes figures barbouillées, etc. Cela change de nom, le genre reste toujours le même. Aussi peut-on dire avec certitude que le plaisir de les voir arriver, plaisir aiguillonné par la curiosité, n'est rien en comparaison de la satisfaction que nous éprouvons après leur départ. Il faut faire de l'air frais partout, si on ne veut pas courir le risque d'être empoisonné.\n\nNOTRE AUMONIER:\n\nJeudi, 7 Mai.—Le bataillon a fait chanter, ce matin, une messe pour le repos de l'âme de M. Faguy, décédé à Québec ces jours derniers. Tout le monde s'est fait un pieux devoir d'assister à l'office divin, célébré par notre aumônier lui-même, à qui nous devions cette marque de notre grande sympathie.\n\nM. Faguy a quitté ses paisibles fonctions de vicaire au faubourg St-Jean, pour venir remplir les devoirs pénibles d'aumônier d'un bataillon engagé dans une campagne difficile, au milieu d'un pays sauvage, où la vie, même pour les plus favorisés, n'est pas exempte de misères. C'était justement l'homme qu'il nous fallait. Il a toutes les qualités requises pour la\ncharge ardue qui lui a été confiée, et dont il s'acquitte en homme compétent et consciencieux. Par ses manières douces, il a su s'attirer tous les cœurs. Ses bonnes paroles, son exemple, nous remontent le moral, quand nous sentons un moment de faiblesses. Habile à diriger les âmes, il sait aussi nous rendre plus agréable la partie matérielle de notre existence de soldats. Toujours gai, sa douceur, son affabilité, sa familiarité qui ne diminuent en rien le respect que nous lui portons, ont toujours tenu notre courage au diapason de l'enthousiasme. Dans les chars où nous avons passé de si rudes quarts-d'heures, sur la route où nous sentions nos forces nous abandonner, il nous ranimait par son exemple, en marchant le premier dans les sentiers les plus difficiles, toujours le premier, aussi, à entonner un de ces chants qui rendent la marche plus légère. Nous avons pour lui tout l'amour qui est dû à un bon père, et toute l'amitié respectueuse que mérite un gentil et franc camarade.\n\nAussi ne sommes-nous pas peu affligés du malheur qui le frappe dans la perte de son père, mort loin de lui. C'eût été pour lui une si grande consolation de recevoir de la main de son fils le dernier pardon de ses fautes ! Mais la destinée l'a voulu ainsi. Nous avons tâché, par l'expression de notre sympathique affection, d'atténuer la douleur qu'éprouve notre aumônier bien aimé. Il le comprend, car il nous aime; lui aussi, de toute l'ardeur d'un prêtre soucieux du bien de ceux qui sont confiés à ses soins.\n\nNous avons uni nos prières aux siennes, et nous avons confiance que Dieu les a entendues.\n\nNous avons reçu aujourd'hui une malle volumineuse. Des lettres, des journaux, des cadeaux de nos familles ; tout cela est arrivé en si grande abondance, qu'il a fallu une voiture pour l'emporter du bureau de poste.\n\nVendredi, 8 Mai.—La compagnie No. 4, du bataillon d'infanterie légère de Winnipeg, est partie cette après-midi pour escorter un convoi de provisions à destination d'Edmonton. Ce détachement se rendra à 90 milles d'ici, à la rivière de la Biche, où il sera remplacé par une autre escorte que doit y envoyer le général Strange.\nFÊTE A CALGARY\n\nDepuis l'ouverture de la campagne, trois bataillons : le 65 de Montréal, le bataillon de l'infanterie légère de Winnipeg, et le nôtre, ont stationné à Calgary. C'est sans contredit le nôtre qui a produit la meilleure impression, et acquis le plus de sympathies de la population. C'est aussi le gême qui y est resté le plus longtemps. Nous sommes au mieux avec les habitants, pour qui nous avons tous les égards possibles, et qui ont la gentillesse de nous le rendre.\n\nLes dames de la ville ont voulu nous donner une marque de leur reconnaissance en nous conviant à un grand banquet, au rond à patiner. À huit heures, nous nous sommes mis en route pour la salle du festin. À la porte, nous avons rencontré une foule nombreuse de métis et sauvages, que la curiosité avait attirés ; ils ne paraissaient pas se douter de la signification de cette fête. Elle avait cependant, dans la circonstance, une importance réelle très-grande. Ce banquet est une preuve éclatante de l'union qui existe entre les diverses races qui forment la population du pays, union cimentée par l'existence du danger commun.\n\nÀ notre entrée dans la salle, brillamment éclairée, et ornée avec un bon goût qui fait honneur à ceux qui ont été chargés de la décoration, l'adresse suivante nous fut présentée :\n\nAu Lieut.-Col. Amyot, commandant du Fort Calgary, aux officiers, sous-officiers et volontaires maintenant en garnison à Calgary.\n\nNous, citoyens de Calgary, manquerions à notre devoir si nous ne nous efforçons pas de vous prouver que nous apprécions les services que vous rendez au pays.\n\nVous n'êtes pas des soldats salariés, mais des citoyens qui avez abandonné de paisibles occupations dans vos foyers lointains, vous avez revêtu l'uniforme pour faire respecter la loi et maintenir l'ordre dans cette patrie du pays.\n\nVous avez quitté vos demeures et supporté les fatigues d'un voyage de plusieurs mille milles, par des chemins difficiles ; vous vous êtes, sans murmurer, exposés aux inconvénients et à toutes les misères d'un si long voyage, pour vous rendre ici nous protéger des sauvages qui nous entourent.\n\nQuelques-uns d'entre vous avez mis de côté des sympathies profondes, et, comme de vraie patriotes, vous n'avez écouté que l'appel de la patrie et la voie du devoir.\n\nLes citoyens de Calgary vous souhaitent succès. Ils espèrent que vous, et vos camarades partis avant vous, reviendrez bientôt couronnés des lau-\nriers de la victoire et que notre nationalité Canadienne sera établie plus fermement que jamais, grâce aux nobles et patriotiques efforts de vous et de vos compagnons d'armes.\n\nDe la part des citoyens,\nGeo. Murdoch,\nMaire de Calgary.\n\nLe colonel Amyot se leva pour répondre à l'adresse. Il remercia le maire et les citoyens de Calgary des éloges qu'ils venaient de faire au bataillon, et dit que nous avions, il est vrai, laissé nos occupations, nos familles, notre province, pour venir dans cette partie éloignée du Canada, mais que nous ne regrettons pas les dangers que nous avons courus. Nous sommes venus défendre leurs foyers, afin de prouver à ceux qui ont fait des Territoires du Nord-Ouest une partie si importante du Canada, en venant s'y établir, combien nous admirons leur générosité et leur esprit d'entreprise. Le colonel termina sa réponse en assurant au maire et aux citoyens de Calgary que le 9ème bataillon n'oublierait jamais la réception cordiale qui nous a été faite par eux. Son discours fut vivement applaudi.\n\nLe lieut.-col. Evanturel parla à son tour, et dit qu'il était d'autant plus heureux de la manière dont les citoyens de Calgary apprécient la présence de notre bataillon dans leur ville, qu'en certains quartiers on a voulu mettre en doute notre loyauté.\n\nPuis, assis tous ensemble à la table du festin, nous avons fait une attaque vigoureuse contre les mets délicieux qui nous étaient si gracieusement offerts.\n\nCe banquet est certainement un des plus beaux qui aient été donnés à Calgary, où on ne sait pas faire les choses à moitié. Nous en garderons longtemps le bon souvenir.\n\nALERTE.\n\nSamedi, 9 Mai.—Peu après notre retour du banquet, vers une heure ce matin, le bataillon a été éveillé en sursaut par un appel d'une sentinelle.—Quoi ? Qu'y a-t-il ? Est-ce que nous sommes attaqués ? Y a-t-il des morts ? des blessés ? Les sauvages sont-ils dans le camp ?—Ces questions se croisaient en tous sens ; chacun les posait à son voisin.\nOn se lève ; il faut bien voir quelle est la cause de tout ce tapage. La sentinelle interrogée, déclare qu'elle a vu un espion. Il était là, de ce côté, se faufilant entre des piles de billots. On se met à sa recherche. Tout le monde est surpris de l'agilité du fameux espion, qui réussit à se dérober à nos minutieuses investigations. Finalement, l'individu demeurant introuvable, on décida de se remettre au lit.\n\nY avait-il réellement quelqu'un caché derrière ces billots ? Ou bien l'imagination de la sentinelle lui a-t-elle fait voir des choses qui n'existaient pas ? Qui pourrait le dire ? Toujours est-il que nous devons une bonne note à celui qui a donné l'éveil. C'est une preuve que nos sentinelles font bien leur devoir. C'est plus rassurant, dans les circonstances actuelles. Nous sommes au beau milieu du pays des sauvages. D'un jour à l'autre, nous pouvons avoir sur les bras quelque horde de ces barbares, capables de tout pour satisfaire leurs instincts plus ou moins féroces, plus plutôt que moins : que deux ou trois cents de ces sauvages prennent le camp par surprise, la nuit, et c'en serait fait de ce pauvre gêne.\n\nHeureusement nous n'avons aucune crainte à ce sujet ; si nous recevons, des Pieds-Noirs ou autres, quelque visite d'une nature par trop désagréable, nous sommes assurés que la vigilance de nos sentinelles nous donnera le temps de nous mettre en état de défense.\n\nDimanche, 10 Mai.—Le R. P. Lacombe est venu nous dire la messe, ce matin, et, à la suite de l'office divin, il nous a fait un très beau sermon. Il nous a dit qu'il fallait veiller et prier : veiller pour prévenir toute surprise de la part de l'ennemi commun de nos âmes, prier pour demander au ciel la force de combattre le mal et de résister victorieusement à ses attaques.\n\nTout le monde est enthousiasmé, et à bon droit, du R. P. Lacombe. Son zèle pour le bien de ceux qui lui sont confiés, sa charité sans bornes, son ardeur infatigable pour aller évangéliser ces peuplades barbares, auxquelles il fait des efforts surhumains pour inculquer la lumière de la civilisation chrétienne, arrachent des cris d'admiration de tous ceux qui sont à même de pouvoir apprécier ses immenses travaux apostoliques. La vie pour lui est un voyage continuel de tribu en tribu, à travers ces vastes plaines du Nord-Ouest, baptisant les nouveaux-nés ou ceux qui ont eu le bonheur de convertir à notre\nsainte religion, instruisant les néophytes, administrant les sacrements à tous ces sauvages toujours heureux de revoir la robe noire, dont la présence parmi eux est un présage de joie et de bonheur. Quand il a passé quelques heures dans un de ces villages ambulants, que les sauvages déplacent quelquefois de semaine en semaine, suivant les besoins de la chasse ou de la pêche, ou même de leur goût prononcé pour les changements de sites, le Père Lacombe, qui ne se repose de ses voyages qu'en travaillant au salut des âmes, repart pour une autre mission, mangeant quand il a du temps de reste, bien souvent des choses que les plus pauvres des habitants de nos villes soi-disant civilisées dédaigneraient. Et c'est ainsi que vit cet homme de Dieu, ne pensant jamais à lui-même, toujours absorbé par l'idée du besoin des autres, qu'il cherche à soulager. Aussi les témoignages d'admiration ne lui manquent-ils pas. Mais le saint missionnaire ne comprend pas que l'on puisse s'étonner de ce qu'il considère comme n'étant rien de plus que le strict accomplissement de son devoir.\n\nNous avons passé notre dernier jour à Calgary. Il nous est arrivé aujourd'hui une nouvelle qui ne chatouille agréablement l'oreille de personne. On envoie deux compagnies de notre bataillon remplacer un détachement du 92ème de Winnipeg, stationné, depuis le mi-avril, à Langdon, Gleichen, et Crowfoot. Il faut nous diviser encore une fois. Nous allons être désormais séparés en petits groupes, assez éloignés les uns des autres, échelonnés le long de la voie du Pacifique, jusqu'à ce que, de par l'avis des autorités auxquelles nous sommes soumis, on nous réunisse de nouveau. Ce jour-là comptera comme un des plus méritoires de notre campagne.\n\nAdieu, beau fort de Calgary, où nous avons coulé l'existence si douce, si exempte d'inquiétude, au milieu d'amis qui nous estiment, et avec lesquels nous aimons à vivre! Ici nous sommes encore en pays civilisé, quoique campés au milieu du territoire sauvage. Comment serons-nous là-bas? Rencontrerons-nous autant de sympathie qu'auprès des citoyens de Calgary? Ne nous y verra-t-on pas plutôt d'un mauvais œil? Nous en courons la chance.\n\nLe détachement qui laisse Calgary se compose des compagnies Nos. 3 et 4, divisées en trois groupes, comme suit:\n\n1er groupe : Lieut. Elzéar Fiset; sergent Philippe Miller;\ncaporaux Joseph Biron et Jean-Baptiste Bilodeau ; soldats Joseph Bérubé, Roméo Bureau, Louis Cartier, Théophile Danjou, Léonidas Jouvin, Ernest Ouellette et Pierre Pouliot.\n\n2ème groupe : Lieut.-col. Evanturel, commandant ; capt. N. LeVasseur, adjudant ; Lt. Labranche, payeur et quartier-maître ; Rév. M. Faguy, aumônier ; Dr. O. Cloutier, chirurgien ; Télesphore Trudel, sergent-major ; capt. Elzéar Garneau ; lieutenant Jean Charles Routhier ; sergent Louis Lachance ; sergent Olivier Matte ; sergent Jean-Bte Marcoux ; caporal François Jolin ; caporal Alexis Julien ; soldats Onésime Cantin, Elzéar Blais, George Marois, J.-Bte Blais, J.-B. Bibault, Alfred Blais, James Smith, Hector Hardy, Octave Landry, Prosper Jobin, Octave Dominique ; trompette Eusèbe Patry.\n\n3ème groupe : capt. Jos. Drolet ; Lieut. Perrault Casgrain ; sergent C. L. Chabot ; sergent R. S. M. Bouchette ; caporal A. Thorn ; soldats George Beauregard, C. J. Rousseau, H. Plante, N. Dussault, E. Goulet, P.-D. Turcotte, A. Patry, A. Coulombe, J. Nolin, E. Barbeau, A. Laperrière et A. L. LeMoine.\n\nCROWFOOT:\n\nLundi, 11 mai.—Nous sommes partis à onze heures, ce matin, après avoir échangé force poignées de mains avec ceux que nous laissions en arrière.\n\nAvant notre départ, en nous, lut l'ordre du jour suivant :\n\nORDRE DE BRIGADE.\n\nLt.-Col. Amyot, commandant.\n\nCalgary, 11 mai 1885.—\"Les détachements qui partent ce matin de Calgary pour Langdon, Gleichen et Crowfoot prendront respectivement par écrit les ordres dont sont chargés les détachements qu'ils vont remplacer.\n\n\"Ils ne doivent pas oublier qu'en temps de guerre, le moindre acte peut prendre des proportions énormes.\n\n\"La vigilance la plus constante, la prudence la plus sérieuse, une activité et une énergie sans égales, sont attendues d'eux.\n\n\"Il pourrait arriver qu'il leur faille user de discrétion ; leurs commandants respectifs devront s'y décider, s'il y a urgence, et s'ils ne peuvent communiquer avec les autorités supérieures.\n\n\"Le commerce avec les sauvages est strictement prohibé.\"\n\"Aucune liqueur, fermentée ou forte, ne devra être tolérée, pour quelle raison que ce soit.\"\n\n\"Chaque matin, un rapport télégraphique condensé devra être fait au commandant du poste, à Calgary.\n\n\"Les détachements devront apporter le plus grand zèle à se conformer aux ordres reçus et à ceux qu'ils pourront recevoir.\n\n\"Il ne sera permis à aucun sous-officier ni soldat d'avoir des revolvers, ni à aucun officier d'avoir des revolvers chargés en sa possession.\"\n\nÀ midi et vingt-cinq minutes, nous laissions le premier détachement à Langdon. Le second groupe débarqua à Gleichen, à trois heures, et un peu après cinq heures nous étions arrivés à Crowfoot, où le lieut.-col. Evanturel et le capitaine LeVasseur étaient venus nous installer. Ils sont repartis de bonne heure dans la soirée.\n\nNous montons trois tentes, auxquelles nous donnons le titre pompeux de \"notre camp.\" Nous allons rester ici assez longtemps, je crois, n'ayant autre chose à faire qu'à regarder les sauvages qui nous feront l'honneur d'une visite, et tâcher de les tenir en respect par notre air imposant. Nous avons l'ordre de les bien traiter. Et certes, nous avons pour eux tous les égards possibles. Nous y sommes d'autant mieux disposés que leur aspect repoussant nous donne le goût de nous tenir à une certaine distance. Que l'on ne redoute pas les familiarités compromettantes pour le respect dû aux représentants de Sa Majesté (car nous le sommes en réalité); la seule vue des sauvages que nous avons eus sous les yeux jusqu'ici est un gage assuré d'une continence absolue. D'ailleurs, nous voulons faire notre devoir, et nous sommes bien résolus à ne pas nous en écarter, advienne que pourra.\n\nNous avons le souper à la station, où il y a une maison de pension tenue par madame T. Sullivan. Notre hôtesse me paraît être une bien brave femme, et comme nous devons prendre nos repas chez elle, pendant toute la durée de notre séjour à Crowfoot, nous sommes assurés de n'avoir pas à nous plaindre; nous serons bien traités. Ce n'est pas chose à dédaigner, car, si nous en jugeons par l'apparence de la localité en ce moment, notre seule occupation, ici, sera de manger et de flâner. Ce sera aussi notre seul plaisir, je crois bien, l'endroit étant assez désert. Nous allons toujours tâcher de nous y ennuyer le moins possible.\n\nMardi, 12 Mai.—Nous nous sommes levés, ce matin en nous\ndemandant où nous étions. C'est généralement la trompette qui nous écorche les oreilles et nous ôte l'envie de rester au lit. La musique en est peu agréable, ses sons aigus nous déchirent le tympan. Aussi, ce matin, qu'elle n'a pas été notre surprise, en entendant le son d'une cloche! Comme nous ne sommes pas assez nombreux pour nous payer le luxe d'un trompette attaché au détachement, notre brave hôtesse nous a réveillés avec sa cloche, qu'elle agitait d'un bras vigoureux, pour appeler au déjeuner les employés de la compagnie du Pacifique, qui pensionnent chez elle. Nous n'avons pas été sourds à l'appel, et, à sept heures, nous étions assis devant une table abondamment servie, à laquelle nous avons fait honneur. Si cela continue, je ne crois pas que le restaurant Sullivan fasse beaucoup d'argent avec ses nouveaux pensionnaires, car nous jouissons tous d'un excellent appétit, que le grand air semble ne pas devoir diminuer.\n\nAprès le déjeuner, le capitaine nous annonça le programme de chaque jour, pour le temps que nous aurons à passer à Crowfoot. C'est très simple, et on ne peut plus facile à suivre : lever à six heures, déjeuner à sept heures, dîner à midi, souper à six heures et coucher à dix heures. Une vraie journée de rentier, quoi ! Notre seule besogne consiste, pour chacun de nous, à faire deux heures de garde par vingt-quatre heures, et quelques heures d'exercices.\n\nPour nous plaindre, il faudrait que nous fussions bien difficiles. Or, comme tel n'est pas notre défaut, nous nous déclarons satisfaits.\n\nNous avons notre liberté à peu près pleine et entière. Mais que faire ? Nous allons furieusement nous ennuyer, plus que nous n'en avons l'envie...... Enfin, puisque nous y sommes, il faut bien y rester.\n\nLes maisons n'abondent pas ici. On peut faire toutes les recherches possibles, il faudrait aller loin avant de trouver plus d'une maison, qui forme tout l'établissement de Crowfoot : c'est celle où nous prenons nos repas; le restaurant Sullivan.\n\nIl y a dans le voisinage quelques centaines de Pieds-Noirs. Nous pouvons compter sur leurs visites à peu près quotidiennes. Nous n'avons qu'à nous bien tenir. La patience pourrait bien nous manquer, parfois, si ces bons sauvages deviennent trop taquins.\nMercredi, 13 Mai.—Notre sergent de couleur s'est trouvé tout-à-coup malade aujourd'hui. Il a fallu envoyer à Gleichen pour avoir un médecin. Quatre soldats du bataillon sont partis en land-car, et ont ramené le Dr Cloutier, qui a donné au malade les soins que requérait son état.\n\nJeudi, 14 Mai.—Nous avons commencé à recevoir les visites des sauvages.\n\nIls se sentent ici absolument chez eux. Ils aiment à fureter partout, à voir de près tout ce qui s'offre à leurs regards. Il nous faut veiller de près pour les empêcher de nous enlever tout ce qu'il y a dans nos tentes. Car tout leur semble bon ; le moindre objet prend, à leurs yeux, une valeur réelle. Leur affreuse manie de s'orner les oreilles, le cou, les cheveux, les bras et les jambes, de colifichets de toutes sortes, trouve à se satisfaire des choses les plus insignifiantes. Ils trouvent de la place pour mettre tout ce qui leur tombe sous la main. Une clef de montre leur fait une superbe boucle d'oreille. Un clou de cuivre va enrichir la collection qui orne déjà la ceinture d'un peau-rouge. Il ne dédaignera pas une roue de montre, ou autres articles d'une valeur minime. Tout objet en métal a pour eux un prix considérable. Cela brille au soleil, et complète la belle tournure que leur donne le badigeonnage dont ils se couvrent le corps.\n\nComme ils ne sont pas riches, généralement, en argent sonnant, ils se procurent, aux dépens des autres, les gracieux ornements dont je viens de parler. Il faut user de beaucoup de circonspection, si on ne veut pas être victime de ces avides pillards. Aussi nous promettons-nous de faire bonne garde.\n\nIl nous est arrivé, vers quatre heures, cette après-midi, des nouvelles du détachement de notre bataillon qui est stationné à Fort McLeod. Nos compagnons sont enchantés de leur séjour à cet endroit. Ils ont été reçus par les citoyens d'une manière très-flauteuse, sont logés confortablement, et jouissent d'une excellente santé. Ils ont à leur tête un officier qui met tous ses soins à leur rendre la vie aussi douce que possible.\n\nTout le monde connaît ce bon gros major, un des plus populaires officiers du 9ème bataillon, aimé de ses collègues et de tous les soldats, poli, affable, toujours d'une humeur charmante, un vrai cœur d'or. Sur ce portrait, n'importe quel soldat reconnaîtra le lieutenant-colonel Thomas Roy, major du\n9ème bataillon. Avec cela, il est militaire des pieds à la tête. La discipline est pour lui un besoin ; il sait la faire observer, et, ce qui vaut mieux encore, il a le secret de la faire aimer de ses soldats. Ceux-ci n'ont que des éloges à faire de leur commandant.\n\nPendant les premiers temps du séjour du détachement à McLeod, il a fait une température des moins agréables : froid, neige, vent, pluie, rien n'y a manqué. Il y fait maintenant un temps splendide. Le vent s'est abattu, et le soleil leur fait oublier, par sa douce chaleur, le froid des premiers jours.\n\nMcLeod est une place importante, au point de vue commercial.\n\nLe fort est situé sur la rive nord de la rivière Belly. Le nombre des habitants est assez considérable. Il y a là actuellement une garnison de 118 hommes, dont soixante-dix-huit du 9ème bataillon. Ce sont eux qui sont les plus exposés, car ils ont à défendre une grande étendue de terrain, et, dans le cas d'une attaque des sauvages, qui sont en grand nombre dans cette partie du pays, leur position serait assez critique. Leurs voisins, pour le moment, sont assez pacifiques, et rien ne laisse croire à un soulèvement prochain.\n\nPlus nous allons, plus nous sommes surpris de l'attitude des sauvages. En partant de Québec, nous croyions avoir à les combattre à chaque pas que nous ferions dans le Nord-Ouest ; il en a été tout autrement. Partout où nous en avons vu, ils étaient de mœurs douces, s'occupant de leur nourriture, et n'ayant pas le moins du monde l'intention de se soulever. Tant mieux. Cela simplifie singulièrement notre tâche, et écarte de notre route les dangers que nous nous attendions à y rencontrer. Pour nous, c'est une question de prudence : il ne faut pas les mécontenter, mais faire, au contraire, tout en notre pouvoir pour leur donner la plus grande satisfaction possible, tout en veillant à ce qu'ils ne nous jouent pas de mauvais tours.\n\nVendredi, 15 Mai.—Il a fait aujourd'hui un temps magnifique. Le soleil s'est levé radieux et plus il avançait dans sa course à travers la route céleste, plus le firmament prenait cette belle teinte bleue si agréable à voir. Nous sommes décidément en plein été. Comme il fait bon vivre sous un beau ciel avec une température modérée, sans avoir à remplir\nune journée pénible ! L'air pur, la senteur embaumée de la végétation qui commence à renaître, nous donnent un regain de vigueur. Le cœur semble rajeunir, pour s'affadir, il est vrai, à l'automne ; mais au moins, pendant les longs jours d'été, il peut jouir des beautés de la création ; il semble oublier l'impression de mort qui est la compagne obligatoire de la saison d'hiver. Le renouveau fait fleurir dans l'âme les bons sentiments, tout ce qui fait homme honnête et noble. Chaque brin d'herbe qui pousse semble renfermer un atome de bonheur et d'espérance. Pour nous c'est aujourd'hui l'espoir du retour, des joies de la famille, du bonheur du foyer......\n\nLes sauvages ne sont pas venus nous voir aujourd'hui. C'est un charme de plus ajouté à ceux de la température.\n\n**CAPTURE DE RIEL**\n\nSamedi, 16 Mai.—Voici un événement qui va avoir sur la durée de notre campagne une influence considérable. On nous a apporté la nouvelle, vers midi, que le chef des métis a été capturé par les soldats de la police montée, et amené prisonnier au camp du général Middleton.\n\nLa prise de Riel devra nécessairement, et dans un laps de temps relativement très-court, mettre fin à la campagne et nous permettre de retourner tranquillement chez nous. Car Riel était l'âme de l'insurrection, c'est lui qui, avec une activité infatigable, conduisait tous les mouvements, avait organisé, dans tous ses détails le soulèvement des métis et des sauvages ; son plan était bien combiné ; il ne lui manquait que des armes et une armée suffisante pour rencontrer les forces du gouvernement.\n\nEt c'est un pauvre fou, un homme qui n'a pas la pleine et entière jouissance de sa raison et de son jugement, qui a fait cela ! Ce serait à n'en rien croire, s'il n'y avait des preuves palpables de sa folie. Il appartient à une classe d'aliénés que les savants appellent \"monomanes\" et qui ne sauraient être responsables de leurs actes, quels que criminels qu'ils puissent être.\n\nPauvre Riel ! Il doit tout de même être joliment désappointé de voir ses plans réduits à néant, sa liberté perdue, probablement pour toujours (car il n'est pas probable qu'on le\nrelâche). S'il est réellement aussi fou qu'on le dit et tout nous porte à le croire, tant mieux pour lui ; il souffrira moins de ses malheurs, et la privation de sa liberté, mêlée au souvenir du beau rôle qu'il a déjà joué une fois dans sa vie, sera moins amère pour lui.\n\nFranchement, si ce n'était la pensée de l'infortune qui pèse sur le malheureux chef de l'insurrection, je me réjouirais de sa capture. Elle désorganise les métis, qui, n'ayant plus personne à leur tête, vont être obligés de se soumettre. Quant à nous, il est probable qu'on va bientôt nous donner l'ordre de reprendre le chemin de Québec, à notre grande satisfaction.\n\nDimanche, 17 Mai.—Pas de messe aujourd'hui. M. l'aumônier n'est pas venu nous visiter de la journée, je ne sais trop pourquoi. Sa charge est loin d'être une sinécure. Le service de ses ouailles, dispersées sur un parcours de plusieurs milles, lui donne une rude besogne.\n\nLES SAUVAGES ARRIVENT\n\nÀ midi, on est venu nous avertir que les fils télégraphiques étaient rompus, et que cinq cents sauvages, au moins, marchaient sur le camp de Crowfoot. Aussitôt, le lieutenant Casgrain partit avec quatre soldats pour Gleichen, afin d'avertir le lieutenant-colonel Evanturel de ce qui se passait. Je faisais partie de ce détachement. Nous mîmes une heure à franchir en hand-car la distance entre Crowfoot et Gleichen, vingt milles bien comptés. Comme nous allions ! C'était un vrai plaisir de nous voir nous escrimer sur les manivelles. Nous étions en nage. Mais marche toujours !\n\nEn route, nous avons vu les fils télégraphiques cassés par les sauvages, à douze milles de Crowfoot. Il y avait aussi du feu dans la prairie.\n\nÀ sept heures nous repartions de Gleichen, et à notre arrivée ici, nous avons trouvé trois cents sauvages installés dans le voisinage de notre camp. Que veulent-ils ? Nous ne le savons pas. Ils n'ont encore fait aucune manifestation. Il faut nous tenir prêts à tout événement et nous attendre à une attaque. Il est possible, après tout, qu'ils n'aient aucun mauvais dessein contre nous. Leur présence ici, dans tous les cas, n'est pas rassurante pour nous. Nous nous couchons tout\nhabillés, la carabine à portée de la main, le sabre-baïonnette à la ceinture, et chacun ayant dans sa poudrière une ronde de vingt cartouches. Si nous sommes attaqués, nous vendrons du moins chèrement notre vie.\n\nNous avons cependant espoir qu'ils ne tenteront pas un coup de main. Ce sont des Pieds-Noirs. Comme nous sommes en bons termes avec cette tribu, nos voisins n'ont peut-être pas l'intention de nous attaquer, mais seulement de visiter notre camp, le plus rapproché de leur réserve.\n\nLundi, 18 Mai.—Mes prévisions d'hier ne m'ont pas trompé. Les sauvages ont voulu s'acquitter envers nous d'un simple devoir de politesse. Ils sont venus au camp aujourd'hui, et nous ont fait de grandes démonstrations d'amitié. Ils nous ont bien un peu ennuyés par leur curiosité parfois indiscrete et leur salmigondis de mots incompréhensibles, dans lequel nous ne voyons que de l'hébreu. Mais, à part cela, nous n'avons rien à craindre de leur part.\n\nÀ cinq heures, nous avons eu la visite du lieut.-col. Evanturel, accompagné de M. l'abbé Faguy et du Dr Cloutier. Le lieutenant-colonel, après le souper, fit l'inspection de notre détachement et se déclara enchanté de notre bonne tenue. Avant de partir, il nous apprit que, ce matin, le lieut.-col. Amyot a passé en revue les deux compagnies du bataillon d'infanterie légère de Winnipeg, et les trois compagnies du 9ème qui sont encore à Calgary. Il a fait un magnifique discours, éloquent comme toujours, dans lequel il a témoigné la satisfaction qu'il éprouve d'avoir à commander à des soldats fidèles à leur devoir et soumis aux officiers. Le major Lewis, du bataillon de Winnipeg, lui répondit en le remerciant de la manière dont il a traité ses soldats sous ses ordres, et lui a rendu ce témoignage qu'il n'avait encore jamais rencontré un officier supérieur aussi courtois que le colonel Amyot. Il termina en demandant trois hurrahs en l'honneur du 9ème et de son commandant.\n\nNous sommes fiers de voir un tel témoignage rendu à notre colonel. L'honneur retombe sur le bataillon.\n\nAprès le départ de ces messieurs, que nous sommes allés reconduire jusqu'à quelques milles d'ici, nous sommes allés faire une visite au camp des sauvages. Nous y avons rencontré quelques soldats venus de Gleichen. Nous avons trouvé le\ncamp désert, la plupart des sauvages étant allés célébrer, à quelques milles de là, la \"danse du tabac.\"\n\nLe camp couvre un espace assez considérable. Les tentes et quelques huttes de bois équarri sont éparées dans un enclos de piquets. Des sauvages étaient étendus ça et là sur le sol, les uns travaillant, les autres jouant aux cartes.\n\nLe village ambulant que nous avons visité compte à peu près huit cents habitants, commandés par un vieux sauvage, Natousapiw.\n\nL'agent de la tribu, M. Scott, nous donna une foule de renseignements, et nous fit voir en détail les tentes de quelques sauvages. Nous sommes revenus forts contents de notre promenade.\n\nMardi, 19 Mai.—Vers sept heures, ce matin, le commandant du détachement eut quelque difficulté avec un irlandais de la station, qui ne voulait pas lui permettre de prendre un hand-car dont il avait besoin. Il fallut des menaces pour le décider à donner son consentement. Nous partimes alors pour Gléichen, où le lieut. Casgrain fait son rapport au lieut.-col. Evanturel.\n\nMercredi, 20 mai.—Le feu mis par les sauvages dans la prairie continue toujours. Rien de beau comme ces grands incendies dont la lueur se répand au loin, vaste étendue sur laquelle ondule la flamme comme les vagues de l'océan. Elle court avec une rapidité vertigineuse à travers ces grandes herbes desséchées par un soleil d'été. Il ne fait pas bon se coucher sans prendre les plus grandes précautions. Le seul moyen d'éviter d'être englouti dans le désastre est de brûler une certaine étendue de terrain autour de soi. Quand le feu passe à l'endroit où se tient le prudent voyageur, celui-ci souffre beaucoup de la chaleur, la fumée le suffoque, mais du moins il parvient à en retirer sa peau. C'est déjà quelque chose. Mais si on s'endort dans la prairie sans avoir pris cette mesure, on court grand risque de tomber victime de son imprudence.\n\nDepuis notre arrivée, ici, j'ai remarqué une grande différence entre la température de ce pays et celle de Québec. Ici, les journées sont très chaudes, tandis que, la nuit, il fait un froid excessif. Nous passons aussi subitement du grand jour à la nuit. Mais ces journées sont longues ; souvent, à neuf heures et demie, on peut encore lire dehors. C'est assurément très\nagréable, mais il est entendu que pour nous, pauvres mortels, chaque plaisir porte sa peine. Dès que le soleil a disparu à l'horizon, la fraîcheur de la nuit se fait sentir, et on est obligé d'endosser la capote. Ce qui nous console, c'est que le temps est toujours sec. Personne ne transpire.\n\nJeudi, 21 Mai.—Nous avons changé d'officiers. Le capitaine Garneau est arrivé au camp ce matin, avec le lieutenant J.C. Routhier. Ils viennent remplacer notre capitaine et le lieutenant Casgrain, qui sont mandés à Gleichen.\n\nDans le cours de la veillée M. Horn, opérateur du télégraphe, est venu se joindre à notre détachement. Cela facilitera nos communications avec le reste du bataillon, et évitera à nos officiers l'obligation d'aller chaque jour à Gleichen faire leur rapport.\n\nIl a fait toute la journée un temps affreux. La pluie tombait par torrents. Cela a toujours eu un bon effet : nous n'avons pas été ennuyés par la visite des sauvages.\n\nVendredi, 22 Mai.—Nous avons reçu ce matin une dépêche du colonel Amyot, nous annonçant que trois cents sauvages se sont livrés avec leur chef, au général Middleton. La dépêche ajoute que Louis Riel va subir son procès devant une cour martiale, à Regina. L'impression générale semble être qu'il sera pendu ou fusillé. Pauvre diable! je ne voudrais pas être à sa place.\n\nSamedi, 23 Mai.—M. l'abbé Faguy est arrivé vers sept heures, ce soir.\n\nIl a plu toute la journée. Nous nageons dans l'eau. Si cela continue, nous aurons besoin de canots pour circuler dans la prairie.\n\nLe lieutenant Elzéar Fiset est venu prendre le commandement du détachement.\n\nDimanche, 24 Mai.—Basse messe à sept heures, ce matin.\n\nC'est aujourd'hui l'anniversaire de la naissance de Sa Majesté la Reine Victoria. La fête s'est passée bien tranquillement pour nous. À Québec, on lance des feux d'artifice, on s'amuse tant que l'on peut, chacun fait son possible pour contribuer à l'éclat de la démonstration. À Crowfoot, le programme a été des plus simples : toute la journée; rien ! À sept heures, nous avons tiré une salve de coups de fusils, en l'honneur de notre Gracieuse Souveraine. Puis nous avons pris le chemin\nde la réserve des Pieds-Noirs ; nous étions chargés de provisions que nous devions leur distribuer.\n\nCrowfoot en personne nous reçut dans son camp. Le vieux chef portait un uniforme rouge, et était coiffé d'un immense chapeau à plumé. Il paraît être un solide gaillard.\n\nLes sauvages se sont montrés fort satisfaits de nos présents, et, pour nous prouver sa reconnaissance, Crowfoot fit exécuter par ses sujets une danse qu'il a dû croire nous être très agréable, car nous avons ri à nous en tenir les côtes. On a beau avoir été plusieurs fois déjà témoin de cette sarabande infernale, qui constitue un des événements les plus graves de la vie sauvage, c'est toujours nouveau et toujours drôle. On ne peut trop regarder ces évolutions d'un genre si original, ces mille contorsions de figures déjà horribles, accompagnées de hurlements affreux à entendre, ces poses désordonnées. C'est un spectacle dont l'œil ne se lasse pas, bien qu'il ne soit pas un divertissement absolument propre à récréer l'esprit. La curiosité seule y attire, à l'exclusion de tout autre sentiment. La seule récompense que l'on en retire, c'est d'avoir plu aux sauvages en leur laissant croire qu'on trouve beau ce qui, en réalité, est détestable.\n\nAprès une longue conversation avec Crowfoot, et l'échange de force poignées de mains, nous avons quitté le camp des Pieds-Noirs, qui nous ont fait toutes les démonstrations possibles d'une amitié franche et durable. Nous nous en sommes déclarés très-honorés, et nous sommes mis à leur disposition pour tout ce qui serait de nature à leur être utile ou agréable. Nous avons là des amis, sur lesquels nous pouvons compter...... tant que nous n'en auront pas besoin.\n\nLundi, 25 Mai.—Notre détachement s'est accru d'un éclaireur. Il pourra nous rendre de grands services à l'occasion.\n\nUne dépêche nous apprend que Poundmaker s'est constitué prisonnier, avec ses sauvages, et qu'ils ont remis leurs armes au général Middleton. Cela n'a qu'à continuer, et avant longtemps nous n'aurons plus que des prisonniers dans ce pays. La rébellion est virtuellement terminée. Il ne reste plus qu'à soumettre quelques tribus plus entêtées que les autres. Elles verront bientôt que la paix vaut mieux que la guerre, dans les conditions actuelles. En effet, chacune de ces tribus est éloignée des autres ; les chefs n'ont plus personne pour les\nconduire, depuis que Riel a été capturé. Il ne leur reste plus qu'à se soumettre. Il est vrai que ce mot de soumission blesse toujours l'amour-propre, ce grand ennemi du repos de l'homme. Mais il faut toujours en finir par là ; autant vaut que la chose arrive le plus tôt possible.\n\nA cinq heures, cette après-midi, six soldats du détachement de Gleichen sont venus nous faire visite. Nous avons refêté l'anniversaire de la naissance de la Reine, absolument comme hier, en tirant deux salves de coups de fusils.\n\nMardi, 26 Mai.—Notre éclaireur est parti ce matin pour Gleichen. Je n'ai pas encore dit en quoi consistent ses fonctions. Toute la journée, son temps lui appartient ; il peut dormir ou flâner à son gré. Mais, le soir venu, son devoir commence ; il lui faut quitter le camp à la nuit tombante, et surveiller le pays jusqu'à une distance de vingt-cinq milles, afin de voir si tout se tient dans l'ordre, et si les sauvages ne méditent pas quelque mauvais coup. C'est une assez rude besogne, qui demande un homme clairvoyant, disposé à ne pas s'arrêter pour s'amuser. Il faut être actif pour exercer le métier d'éclaireur ; c'est sur lui que repose la sécurité des soldats. Ce sont les sentinelles avancées, qui doivent parer à tout événement, et venir donner l'éveil au camp, dans les moments de danger. L'éclaireur que nous avons à notre service semble préférer sa besogne du jour à celle de la nuit. Il me fait l'effet d'un franc paresseux.\n\nCrowfoot n'aime pas à être en reste avec ceux qui lui font l'honneur d'une visite. Il est venu au camp, aujourd'hui, avec un autre chef, Three-Bulls, nous rendre notre politesse du 24. Nous nous sommes montrés très heureux de le voir. Le fait est que, pour un sauvage, sa présence ne nous est pas désagréable comme celle de la plupart de ses congénères. C'est un sauvage qui serait très apte à prendre nos habitudes de civilisation, il cause bien, est doué d'un jugement sain, et susceptible de manières tout-à-fait passables ; un peu d'instruction en ferait un sauvage...... civilisé. Tel qu'il est, il semble assez content de lui-même, et les gens de sa tribu ont pour lui un respect qui tient du culte. C'est un vrai héros, aux yeux des Pieds-Noirs. Après avoir causé longuement, nous lui avons fait les honneurs ainsi qu'à ses compagnons, d'un plantureux goûter au lard, arrosée d'un énorme quantité de thé (c'est la seule liqueur qui ait\nses coudées franches dans le camp) dont ils ont paru fort satisfaits. Le thé est leur boisson favorite. Quand ils veulent lui donner une saveur plus piquante, ils mêlent dans l'effusion quelques pincées de tabac. Je n'ai pas eu le courage de goûter à ce mélange ; mais, à en juger par l'odeur, ce doit être quelque chose d'horrible. Ce que les sauvages en absorbent est impossible à décrire. Il faut les voir à l'œuvre pour en avoir une idée. Ils boivent jusqu'à ce qu'ils soient remplis comme des outres ; quand ils sont bien repus, (la consommation de viande est en proportion de celle du liquide) ils se livrent à des exercices violents, où se couchent sur le sol, suivant les habitudes de chacun, pour faire descendre la masse qui leur bouche l'estomac. Il faut véritablement être sauvage pour avoir un tel appétit.\n\nMercredi, 27 Mai.—Il a fait aujourd'hui un temps de paradis. Nous avons fait deux heures d'exercice, et notre journée de devoir était finie à midi.\n\nVendredi, 29.—A deux heures, cette après-midi, nous avons reçu du colonel une dépêche nous disant que le général Middleton désirait connaître les noms de ceux qui seraient disposés, les troubles finis, à rester en garnison au Nord-Ouest. Pas un seul d'entre nous ne consentirait à faire une si énorme sottise. Tant que nous sommes en service actif comme soldats du 9ème bataillon, nous faisons notre devoir, tous nos efforts tendent à bien mériter de nos supérieurs. Mais pense-t-on que nous voudrions voir nos compagnons partir pour Québec, tandis que nous resterions ici ? Va-t-en voir s'ils viennent !......\n\nNon, non. Personne n'a voulu faire cela. Il fait beau ici, nous avons du bon temps, les gens avec qui nous sommes en relations ont pour nous tous les égards, toutes les attentions possibles. On peut nous offrir de grands avantages, si nous restons ici ; on donnera peut-être à ceux qui s'enrôleront de nouveau des terres, quelques cadeaux considérables, pour payer le sacrifice qu'ils auront fait de la liberté, de la joie du retour au foyer, mais nous ne voulons pas de cela. Nous avons assez de cette vie militaire, que nous menons depuis deux mois. Elle ne nous pèse pas au cœur, mais, depuis que nous apprenons de tous côtés la soumission des sauvages et des métis révoltés, le désir de la maison paternelle, des amis, des parents, s'est emparé, plus fort que jamais, de nos\nâmes. Nous avons hâte de retourner à Québec. Et ce n'est pas pour des considérations pécuniaires que nous voudrions renoncer au bonheur de revoir bientôt nos familles, les murs de notre vieille ville, Québec qui est pour nous l'univers.\n\nMerci de vos offres généreuses, général; mais, notre devoir fini dans ce pays, nous ne voulons plus y rester.\n\nLà-bas, dans la vieille capitale de la province de Québec, nos pères et nos mères, nos frères et nos sœurs attendent avec impatience notre retour. Ils préparent des fêtes pour nous recevoir. Avant longtemps, dans quelques jours peut-être, vous allez donner l'ordre de nous ramener sur les bords du St-Laurent, où se sont écoulées notre enfance et notre jeunesse; ce jour-là, nous ne voulons plus être soldats.\n\nTelles étaient les pensées qui naissaient dans le cœur de chacun de nous, à la réception de la dépêche du colonel. Certaines, nous sommes de loyaux sujets de Sa Majesté. Tant qu'on nous gardera ici, que l'on aura besoin des services du gème Voltigeurs, pas un ennemi de la couronne ne restera libre de mettre en action ses projets de soulèvement; nous ne fail- lirons pas au devoir que nous avons accepté de bon cœur, mais, le jour où un ordre venu d'en haut nous dira de repren- dre le chemin du foyer, ce jour-là, personne ne voudra rester en arrière. Et nous l'appelons de tous nos vœux, ce jour béni où il nous sera permis d'embrasser nos parents, de donner une poignée de mains à nos amis. Puisse-t-il ne pas tarder à paraître!\n\nSamedi, 30 Mai.—Nous avons perdu notre éclaireur, le colonel Amyot l'a fait venir à Calgary.\n\nÀ sept heures du soir, quelques minutes après l'arrivée du R. P. Doucet, qui vient pour nous dire la messe demain matin, nous avons reçu une dépêche du colonel Amyot. On nous recommande de nous tenir sur nos gardes. Il paraît que nous allons être attaqués cette nuit. À cette nouvelle, le comman- dant du détachement a doublée les postes, ce qui me procure le plaisir de passer la nuit debout.\n\nLa menace d'attaque est-elle sérieuse, cette fois? La dépêche du colonel le dit assez. Qui allons-nous avoir sur les bras! Des Pieds-Noirs? C'est peu probable. Il est vrai qu'on ne peut se fier à ces gens-là, dont les dispositions peuvent changer d'une minute à l'autre. Nous avons cependant tout lieu de\ncroire que les sauvages de Crowfoot ne nous sont pas devenus hostiles...\n\nComme nous ne savons rien, faisons bonne garde, et attendons les événements, espérant que la Providence ne nous enverra rien de sâcheux.\n\nDimanche, 31 Mai.—Si nous n'avons pas vu d'ennemis, notre faction de la nuit dernière n'en a pas été moins pénible. Il a fait un temps affreux. Le tonnerre et les éclairs ne manquaient pas. Avec cela, il faisait noir comme dans un four ; on ne pouvait voir à dix pas devant soi. Il nous fallait rester bien éveillés, oreille au guet, tâchant de découvrir, dans un de ces mille bruits de la nuit, le pas des sauvages s'avançant dans l'ombre. À chaque instant, nous croyions apercevoir un ennemi. Quelle nuit affreuse !—Heureusement personne ne s'est montré.\n\nCes diables de sauvages semblent avoir juré de nous tenir continuellement en émoi. S'ils veulent nous attaquer, qu'ils y viennent donc de suite. Nous aviserons à leur faire une réception convenable. Nous avons des cartouches en nombre suffisant pour leur tenir tête pendant quelquestemps. Nous ne sommes pas nombreux, il est vrai, mais nous sommes courageux. Que les sauvages ou autres viennent nous attaquer en face, ils en auront la preuve.\n\nNous avons dressé un autel, ce matin, dans la salle à manger du restaurant Sullivan. C'est là que le R. P. Doucet nous a dit la messe. Tous les membres du détachement y ont communié.\n\nVers cinq heures, on fit une collecte dans le camp, afin de remettre au R. P. Doucet une aumône pour ses missions. Ces pauvres missionnaires des sauvages ont bien besoin qu'on leur donne des secours. Ils ont à endurer toutes les misères possibles, dans leurs longs voyages à travers la prairie, obligés de poursuivre leur œuvre d'évangélisation de tribu en tribu, vivant de la vie des sauvages, n'ayant assez souvent rien à manger, manquant absolument de temps pour se reposer de leurs longues et douloureuses fatigues. Leurs moyens sont très-limités ; aussi notre collecte, toute modeste qu'elle fût, a été acceptée avec reconnaissance par le Père Doucet. Avec la modique somme de dix piastres que nous lui avons donnée, le zélé missionnaire trouvera moyen de faire des merveilles parmi les sauvages ; que de choses elle va lui procurer pour\nses chapelles, ses écoles ! Et cependant, personne d'entre nous n'a souffert du léger sacrifice qu'il pouvait s'imposer en faisant ce cadeau ; au contraire, chacun se sent heureux d'avoir pu contribuer, quelque faible que soit sa part, à cette belle œuvre des missions sauvages, qui tous les jours ouvre à la lumière de la foi ces pauvres êtres que la nature fait païens.\n\nLe Père Doucet est parti à six heures, pour la mission de Cluny, située à dix milles d'ici.\n\nLes sauvages sont venus en grand nombre au camp, aujourd'hui. Ils ne semblent pas se douter que nous avons passé la nuit dernière dans l'attente d'une invasion de leurs congénères. Nous avons chaque jour de plus en plus raison de croire que ceux-ci ne sont pas à craindre. Ils sont décidément animés des meilleurs sentiments à notre égard. Nous sommes, pour eux, des amis, des frères ; ils nous appellent les \" vrais soldats de la Reine. \" Ils ne craignent pas que nous les molestation, et, par contre, nous n'avons rien à redouter de leur part. Comme c'est notre intention bien arrêtée d'entretenir chez eux ces bonnes dispositions, nous pouvons avoir confiance que nos relations amicales se maintiendront au même diapason pendant toute la durée de notre séjour ici. Il est bien vrai qu'ils ne sont pas des modèles de discrétion ; si quelque chose leur plaît, ils étendent bien la main pour s'en saisir avec un sans-gêne admirable, oubliant toujours d'en demander l'autorisation à qui de droit, mais nous passons facilement par dessus cela. Pour avoir la paix, nous consentons bien volontiers à leur pardonner leurs petites peccadilles, et à faire le sacrifice d'objets qui n'ont pas pour nous de valeur réelle.\n\nLundi, 1er Juin.—Autre dépêche, ce matin, nous disant que Gros-Ours, à la tête de huit cents sauvages marchait, sur Gleichen, et nous avertissant de nous préparer à repousser leur attaque, s'ils se passaient la fantaisie de pousser une pointe de ce côté. Nous avons passé toute la journée sur le qui-vive ; mais pas un sauvage n'a laissé voir sa laide figure.\n\nOn dit qu'il se prépare parmi les tribus un soulèvement général. Les sauvages veulent sans doute tenter un dernier effort pour se rendre maîtres du pays ; s'ils échouent dans leur tentative (et il y a dix à parier contre un qu'ils ne réussiront pas) ils n'auront plus qu'à se tenir tranquilles. Qu'ils y vien-\nnent ces sales moricauds. Nous leur ferons bien voir que c'est à nous à tenir le haut du pavé.\n\nLes Pieds-Noirs de la réserve de Crowfoot ne se sont pas montrés au camp de la journée. Est-ce que, par hasard, ils voudraient se joindre au mouvement ?\n\nMardi, 2 Juin.—Il est venu quelques sauvages, aujourd'hui, mais très peu. Ils protestent ne rien connaître de cette nouvelle de soulèvement dont je parlais hier, et nous jurent leurs grands dieux que, dans tous les cas ils ne s'en mêleront pas. Ils déclarent être nos amis fidèles et vouloir rester ainsi. En cas d'attaque, je ne sais pas si nous pourrions compter sur eux. Peut-être……comme adversaires.\n\nIl y a aujourd'hui deux mois que nous sommes partis de Québec. Deux mois ! comme le temps passe vite ! Deux mois déjà que nous avons dit adieu à nos familles, que nous avons déserté nos foyers pour obéir à la voix du devoir ! les jours ne se contentent pas de se passer, ils fuient comme une locomotive lancée à toute vapeur. Comme nous étions tristes, ce soir-là, quand, après avoir échangé les dernières embrassades, les dernières poignées de mains, nous avons senti s'ébranler le train qui nous amenait si loin de tous ceux que nous aimons. Que de pensées amères emplissaient nos cœurs ! que de larmes versées sur notre sort !……Et depuis, deux d'entre nous ont payé tribu à l'implacable mort. Pauvres malheureux ! Ils ne seront plus là, quand nous serons reçus dans cette même gare qui a été le théâtre de la triste scène du départ. Leur souvenir nous revient encore plus pénible. Leurs femmes, leurs enfants, leur disaient : Au revoir !……Et ils ne se reverront plus qu'au ciel……Comme la vie humaine est drôle ! Aucune joie qui ne soit suivie d'une peine proportionnée à la somme de bonheur que nous aurons éprouvée. Pas un seul cas où un individu puisse jouir d'un instant de félicité, sans que cette jouissance ait son contre-coup dans le malheur d'un autre.\n\nCependant nous comptons les jours qui nous restent encore à passer ici, et nous nous faisons d'avance une idée de notre joie, quand le chemin de fer nous ramènera à Québec, au milieu des nôtres.\n\nUn sauvage de la réserve des Pieds-Noirs est arrivé au camp, vers sept heures, ce soir, et nous a appris que la famille Crowfoot est en grand deuil. La fille du grand chef vient de\nmourir, à l'âge de dix ans. Son père avait pour elle une affection toute particulière, aussi ressent-il cruellement sa mort, arrivée dans des circonstances pénibles. La pauvre petite fille a été, il y a quelques mois, victime d'un accident. On lui a répandu sur le corps une grande tasse de thé bouillant, et elle vient de succomber à ses blessures. Crowfoot, oubliant sa dignité de guerrier sauvage, a versé des larmes abondantes sur le cadavre de son enfant bien-aimée. Il faut que sa douleur soit bien profonde, car les sauvages considèrent les pleurs comme une grande humiliation. Chez les femmes, la chose est permise, comme chez nous ; elles peuvent pleurer et siroter à leur aise, quand le cœur leur en dit. Mais un guerrier doit avoir l'âme assez forte pour refouler toute démonstration de ses chagrins.\n\nLe sauvage qui nous a apporté la triste nouvelle, était en grand deuil. Le deuil, chez eux, se porte sur les jambes. Tant qu'il dure, les hommes se promènent sans culotte, les jambes exposées à l'air. On ne porte, du reste, aucun ornement. Quant aux femmes, elles montrent leur douleur en se coupant le bout des doigts et en se meurtrissant les jambes. C'est une coutume qui ne manque pas d'originalité. J'ose espérer qu'on ne l'introduira jamais chez nous.\n\nLes officiers du détachement stationné à Gleichen, qui ont appris avant nous la nouvelle de la mort de la fille de Crowfoot, ont adressé au grand chef la lettre de condoléances suivante :\n\n\"Gleichen, 28 mai 1885.\n\n\"À grand-chef de la puissante tribu des Pieds-Noirs, Sapomaxika :\n\n\"Le commandant, les officiers et les soldats du 9ème bataillon de Voltigeurs de Québec, stationnés à Gleichen, Crowfoot et Langdon, ont l'honneur d'informer le grand-chef de la tribu des Pieds-Noirs qu'ils ont appris avec un profond regret la mort de son enfant, et qu'ils s'associent à la grande douleur qu'il doit éprouver et au deuil de sa famille.\n\n\"Les soldats blancs, se regardant comme les frères des Pieds-Noirs, n'ont pas voulu laisser passer cette occasion sans exprimer leur sympathie à leurs frères, dans le deuil qui les frappe dans la personne de leur chef estimé et respecté, ni sans leur réitérer l'assurance de leur amitié.\"\n\n{ Signé, }\nArthur Evanturel,\nLt.-Col. Commandant.\n\nN. Levasseur, Capt. Adjudant,\nDét. de Gleichen.\nCette lettre reflète absolument notre pensée. Notre sympathie pour Crowfoot, dans le malheur qui le frappe, est réelle. Crowfoot est un type de sauvage que nous aimerons toujours à nous rappeler. Il est doué d'une intelligence vraiment supérieure. Un peu de culture en ferait l'égal de bien des gens prétendus maîtres en civilisation.\n\nVendredi, 5 Juin.—Il n'y a eu absolument rien d'intéressant depuis mardi. Nous avons dormi, mangé, fait l'exercice, monté la garde à tour de rôle. Et chaque jour la même chose a été à recommencer.\n\nPour savoir ce que c'est que la garde, il faut y avoir passé. C'est à peu près le devoir le plus important du soldat, et, certes, ce n'est pas le plus agréable. Pendant que ses compagnons dorment en paix, à la sentinelle incombe la rude tâche de veiller à la sûreté du camp. La responsabilité est lourde; car, s'il arrivait quelque chose, on s'en prendrait à elle. Pour le soldat de faction, il n'y a plus d'amis. On ne pénètre plus dans le camp, après dix heures du soir, sans avoir le mot de passe, faute duquel on court le risque de voir sa poitrine venir en contact avec la pointe d'une baïonnette. L'accomplissement du devoir est parfois pénible, mais, entre le plaisir d'accorder une faveur à un retardataire et la crainte ou plutôt la certitude, d'une punition, on n'hésite guère. Le sentiment de l'honneur, d'ailleurs, pèse dans la balance. Il faut donc que la sentinelle marche ferme dans la voie du devoir, et évite de transgresser avec qui que ce soit.\n\nCes longues heures de garde de nuit nous paraissent avoir la durée d'un siècle. On est seul avec ses souvenirs. Pas un camarade avec qui on puisse causer. De tous côtés, le silence, l'obscurité, quelque chose qui nous parle de la mort...... Franchement, c'est un bon temps pour penser creux. Le jour, c'est encore passable. Mais la nuit, monter la garde devient un véritable supplice. On ressent l'impression de la solitude la plus absolue au milieu de l'univers, un véritable chaos des réflexions les moins gaies se fait dans notre esprit, on pense à la patrie, aux parents, aux amis absents. Entend-on le plus léger bruit en dehors du camp, de suite il faut prêter une oreille attentive, pour prévenir une attaque de l'ennemi, voir si un espion ne se faufile pas dans le voisinage. Le temps se passe dans des transes continuelles, et le pauvre soldat pousse un soupir de\nsatisfaction quand le soleil, apparaissant à l'horizon, vient lui rendre son devoir moins pénible.\n\nSamedi, 6 Juin.—Ces réflexions écrites hier soir, j'ai pu les faire toute la nuit dernière. Il faisait un temps épouvantable. La pluie tombait par torrents. Heureusement, au petit jour, le beau temps est revenu, et le soleil s'est levé radieux, pour nous faire oublier les désagréments de la nuit.\n\nOn nous apprend que nos camarades du 65ème bataillon (de Montréal) ont reçu le baptême de sang, dans une rencontre avec la bande de Gros-Ours. Ils se sont conduits comme des bravés, et il n'a fallu rien moins qu'une défense expresse pour les empêcher de faire sur l'ennemi une charge à la baionnette. Gros-Ours n'a pu résister à leur impétuosité, il lui a fallu déguerpir. Nous sommes heureux que quelques-uns des nôtres aient prouvé que les canadiens-français peuvent être braves tout comme les autres. L'honneur que vient de remporter le 65ème rejaillit sur nous tous. Nous n'avons qu'un regret : c'est que l'occasion ne se présente pas de faire comme eux. Il me semble que, nous aussi, nous ferions des prodiges. Les dames de Calgary ont paru surprises que des gentilhommes comme nous aient pu supporter les fatigues et les misères que nous avons endurées. Nous leur ferions bien voir que nous sommes assez forts pour en affronter d'autres plus considérables encore.\n\nNous sommes allés, aujourd'hui, au nombre de quatre, faire une visite à nos amis de Gleichen, avec lesquels nous ne voulons pas être en reste de politesse. Quelques-uns sont venus nous voir, il y a deux ou trois jours. Nous nous visitons assez régulièrement. C'est chose bien facile, d'ailleurs. Le chemin de fer est à notre disposition, et il ne nous en coûte pas un centimètre pour faire le trajet en char. Il est vrai que nous voyagions en hand-car, et que nous nous conduisons nous-mêmes ! mais, c'est réellement une bagatelle que de tourner la manivelle pendant une heure ou deux. C'est un exercice assez agréable après tout. Et comme nous ne nous forçons pas, outre mesure, tournant comme de simples amateurs, nous y trouvons un véritable plaisir.\n\nNos compagnons de Gleichen jouissent d'une santé qui ferait envie à bien du monde. Ils adorent leurs officiers, qui leur témoignent une bonté extraordinaire. Le temps se passe\ntrès-agréablement chez eux. Le fait est qu'ils sont mieux favorisés que nous sous le rapport des voisins. À Gleichen, au moins, il y a quelques maisons, des personnes avec lesquelles on peut entretenir le commerce ordinaire de la vie. Ici, point. Nous sommes seuls, en nombre infiniment petit, chacun se disant, pour tâcher de se consoler, que les autres s'ennuient peut-être plus que lui. Ce maudit ennui nous tient plus fort au cœur depuis que nous comptons sur la date prochaine de notre retour à Québec. Nous avons beau chercher à le combattre, nous n'y parvenons pas. Il nous empoigne, et, parfois, nous serre si fort à la gorge, qu'il nous faut un effort de courage pour refouler nos larmes. N'empêche que nous nous montrons tous gais, quand nous sommes réunis ; mais chacun semble lire sur la figure de son voisin le plaisir de revoir la patrie, notre bon vieux Québec, où on nous attend avec tant d'impatience. Cela ne peut pas durer. Nous avons tous au cœur le présentiment que le jour ne tardera pas à venir où l'ordre nous sera donné de plier bagage, et de filer vers Québec. Comme nous avons hâte à ce beau jour !\n\nDimanche, 7 Juin.—M. l'aumônier n'a pu venir nous dire la messe, ce matin, et comme personne ne s'est présenté pour le remplacer, nous avons passé comme de vrais païens le jour du Seigneur. Nous avons tâché de suppléer à l'office qui manquait en faisant notre devoir le mieux possible.\n\nDans l'après-midi, nous sommes partis, au nombre de quatre, pour aller pêcher sur la rivière Bow, à un mille du camp. La quantité de poissons à prendre ne nous importait guère ; nous n'y cherchions qu'un divertissement, une distraction. Nous avons eu ce que nous voulions : rien de plus, rien de moins. L'après-midi s'est aussi passée très-vite, et à six heures nous sommes revenus avec un appétit vorace, signe que notre excursion nous avait fait du bien.\n\nNous avons rencontré sur la route quelques sauvages. Bien qu'ils fussent en plus grand nombre, ils n'ont pas fait mine de vouloir nous faire un mauvais parti, mais ils nous ont, au contraire, parlé bien tranquillement.\n\nLundi, 8 Juin.—Temps superbe toute la journée. Pas un seul sauvage en vue, ce dont nous sommes fort reconnaissants à Dieu...\n\nMardi, 9 Juin.—On nous apprend que Crowfoot est allé au\ncamp de Gleichen, remercier le lieut.-col. Evanturel et le capitaine LeVasseur de la lettre de condoléances qu'ils lui ont adressée au nom de trois détachements de Gleichen, Crowfoot et Langdon, au sujet de la mort de sa fille. Il paraît que le vieux chef sauvage est bien abattu. Il n'a plus cet air martial que nous trouvions si imposant. Il n'a plus ce costume brillant, insigne de sa dignité, qui lui allait si bien et lui donnait l'apparence d'un souverain puissant. Son grand corps amaigri est enveloppé dans une immense couverture de flanelle. Son chapeau à plume est remplacé par un chiffon entortillé autour de sa tête. Il porté le grand deuil, à la façon sauvage.\n\nCrowfoot a été très-sensible au témoignage de sympathie que lui a envoyé le bataillon. Il dit que cette sympathie que nous ressentons pour lui dans le malheur qui le frappe, rend plus étroits encore les liens d'amitié qui l'unissent à nous. Il a promis qu'il n'oublirait jamais ce que ses amis les soldats ont fait pour lui.\n\nMercredi, 10 Juin.—J'ai passé une partie de la nuit dehors, à monter la garde. J'ai entendu, à plusieurs reprises, des cris dans la prairie ; mais il ne s'est montré personne. C'était probablement quelques sauvages qui avaient perdu la route, et qui s'appelaient pour se rallier.\n\nJeudi, 11 Juin.—S'il faut en croire les nouvelles que nous recevons aujourd'hui, il se serait commis, sur le théâtre de la guerre, des actes de barbarie épouvantables. On dit que les métis, sous les ordres de Riel et de Dumont, les deux chefs du mouvement avant la capture du premier, ont pillé et brûlé les maisons, massacré sans pitié les femmes et les enfants. Quelques-uns de mes camarades, qui sont allés à Gleichen cette après-midi, ont entendu le récit d'un métis nommé Primeau, qui avait refusé de se joindre au mouvement de l'insurrection. Étant allé dans le nord, chercher sa femme et ses enfants, il ne trouva que les ruines de sa maison. Sa femme et ses enfants avaient été massacrés. Il s'est alors enfui, pour ne pas partager leur triste sort, et est maintenant en route pour Calgary.\n\nIl paraît que, malheureusement, ce cas n'est pas isolé. Les métis ou les blancs qui ne veulent pas se mêler à la rébellion sont traités comme des ennemis. Il est temps que l'or mette fin à ces actes de cruauté et que l'on relance sans misér-\ncorde, jusque dans la partie la plus reculée du pays, s'il le faut, ces égorgeurs de femmes et d'enfants qui salissent leur cause par de semblables abominations.\n\nSamedi, 13 Juin.—Le R. P. Doucet est allé hier dire la messe à Gleichen. L'autel a été dressé dans un magasin appartenant à un M. Beaupré. Le bon Père est parti, après la célébration de l'office divin, pour aller exercer son saint ministère dans un autre endroit, mais il a dû revenir à Gleichen, n'ayant pu traverser la rivière Bow (l'Arc), dont les eaux sont grossies énormément.\n\nVeut-on un trait qui donne une idée du sans-gêne des sauvages en matière de propriété ? En voici un, le cas n'est pas rare :\n\nCette après-midi, une famille de Pieds-Noirs est venue planter ses tentes à un arpent des nôtres. Un sauvage qui était venu se promener dans le camp, voyant sur le sol une couverture de laine, s'en empara, la mit tranquillement sous son bras et reprit le chemin de son domicile, aussi fier que s'il l'eût payé un prix énorme. J'avais été témoin du fait, heureusement, et je pus reprendre la couverture. Le sauvage parut trouver la chose toute naturelle. Il n'y a pas eu de sa part la moindre récrimination. Le fait est qu'il croyait absolument n'avoir rien à se reprocher. S'emparer d'un objet à l'insu de son propriétaire n'est pas un vol, aux yeux des sauvages. Ils considèrent plutôt cela comme un bon tour. Chez eux, du reste il n'y a pas de propriété bien définie. Ce qui appartient à l'un est commun à toute la tribu. Et ils s'imaginent que chez nous ce doit être la même chose. Que de blancs sont sauvages sous ce rapport ! Seulement, dans les pays civilisés, ce qu'on a volé à autrui, on le garde soigneusement, et si son ancien propriétaire reprend possession de l'objet soustrait, le voleur crie à l'injustice.\n\nDimanche, 14 Juin.—Tout le camp est dans la plus grande activité. Nous avons passé une partie de la journée à l'ouvrage, chacun brossant, frottant à qui mieux mieux. Nous devons avoir demain une visite du lieut.-col. Evanturel, qui vient faire l'inspection de nos armes. Faut voir, aussi, comme nous avons travaillé pour nous faire beaux, absolument comme si de jolies filles devaient venir nous voir.... attendu que nous ne pouvons pas aller leur rendre visite. Ce soir nous sommes pro-\npres, reluisants comme les plaques de cuivre sur un vaisseau de guerre.\n\nLundi, 15 Juin.—Le lieut.-colonel Evanturel est arrivé; en effet, à midi, accompagné du capitaine LeVasseur, et de quatre soldats. Nous leur avons présenté les armes, et à une heure, l'inspection commençait. Chacun dut subir un examen minutieux; les habits, l'accoutrement, les armes, rien ne fut oublié. C'est long, passablement ennuyeux pour celui qui est sur la sellette comme pour ceux qu'attendent, mais nous avons tout lieu d'être contents du résultat. Le lieut.-colonel s'est déclaré très-satisfait de nous, et nous a félicités de notre bonne tenue, ainsi que de notre excellente conduite.\n\nAprès l'inspection, nos distingués visiteurs sont allés faire une promenade sur les bord de la rivière Bow; et à six heures ils repartaient triomphalement... sur le hand-car qui les avait amenés.\n\nSans doute pour nous récompenser de la bonne note que nous avons méritée à l'inspection, on nous a donné l'ordre de nous exercer à tirer au blanc, probablement dans le but de nous apprendre à ne pas manquer les noirs, si nous avons occasion de rencontrer l'ennemi.\n\nMardi, 16 Juin.—Nous partions à neuf heures, ce matin, pour Cluny, où nous avions l'ordre d'acheter, tout ce qu'il nous fallait pour construire une cible. Comme de raison, nous avons fait le voyage dans l'inévitable hand-car. À deux heures seulement nous avons pu prendre notre dîner. Il était grand temps, l'appétit, qui semblait augmenter à chaque tour de manivelle, commençait à prendre des proportions inquiétantes pour le restaurant Sullivan. On a eu beau nous donner double ration; nous avons tout englouti avec une avidité désespérante, au risque d'avaler les assiettes mêmes, et nos estomacs criaient encore famine. Défunt Gargantua se serait trouvé un petit garçon à côté de nous. Aussi avec quel bonheur avons-nous fait la sieste!\n\nNous ne nous sommes cependant pas reposés longtemps. À six heures, notre cible était terminée et mise en place, à deux cent verges du camp. Nous avons cinq cent cinquante cartouches à tirer. Comme nous ne sommes pas nombreux, nous allons en avoir chacun une ample provision. Notre habileté comme tireurs n'a pas encore été mise à l'épreuve. Beaucoup\nd'entre nous, sinon tous, vont souvent manquer le but. Gare à ceux qui se tiendront en arrière des tireurs inexpérimentés! Qui sait si une balle mal dirigée........ Mais ne parlons pas ainsi. Je puis être un des plus maladroits. Et alors, comme on rirait bien de moi!\n\nMercredi, 17 Juin.—J'étais de garde, la nuit dernière. J'ai du arrêter un métis français qui se trouvait dans le voisinage du camp. La nuit, le camp est comme ces usines sur la porte desquelles on lit : \"No admission,\" ce qui veut dire en français : Allez-flâner ailleurs.\n\nIl était à peu près deux heures quand mon métis m'a imposé cette tâche assez peu agréable. Je le conduisis à la salle de garde, où il eut tout le loisir de ronfler à son aise jusqu'à ce matin. À dix heures, le capitaine l'a interrogé, et comme c'était tout simplement un flâneur de la prairie, on l'a renvoyé.\n\nSamedi, 20 Juin.—Tous les matins, depuis que nous avons notre cible, nous sommes allés nous exercer au tir. Nous ne sommes pas si maladroits, après tout. Avec le temps et de la bonne volonté, ça ira.\n\nIl a fallu créer une nouvelle dignité dans le camp. Madame Sullivan étant partie pour les États-Unis, et les autorités ne voulant pas faire un nouveau compte avec la personne qui la remplace, nous allons préparer nous-même nos repas. Il est devenu nécessaire, en conséquence, de nommer un cuisinier. Tout le monde est furieux de ce contretemps. On ne se soucie guère d'exercer ces fonctions. Manger la soupe, fort bien ; mais la faire, personne n'en veut. Cependant les provisions envoyées de Calgary sont arrivées, et nous avons ordre d'aller, à dix milles d'ici, chercher du bois et du charbon. Quelque chagrin que nous en ayons, il va bien falloir mêler à nos devoirs de soldats ceux de cordons-bleus.\n\nDimanche, 21 Juin.—À trois heures, ce matin, nous recevons une dépêche du colonel Amyot contremandant l'ordre donné hier de faire notre cuisine au camp, et nous disant de prendre nos repas à la maison de pension, comme par le passé. C'est avec un plaisir inouï que nous avons fait reprendre à nos provisions la route de Calgary.\n\nDeux de nos amis sont venus aujourd'hui de Gleichen, à cheval, et sont retournés dans le même équipage. Ils avaient\nl'air passablement fatigués de la route parcourue. Le fait est que c'est long.\n\nLundi, 22 Juin.—Nous sommes allés à Cluny, dans l'espérance de voir le père Doucet. Mais nous avons été grandement déçus. Le bon père est parti pour Calgary, où il doit remplacer le père Lacombe, obligé de s'absenter. Il nous a fallu revenir comme le chien de la fable, \"honteux, l'oreille basse.\" Nous en sommes quittes pour avoir fait vingt milles pour rien.\n\nMardi, 23 Juin.—Vers quatre heures de l'après-midi, la pluie s'est mise à tomber en si grande abondance que nous avons dû employer des chaudières pour enlever l'eau qu'il y avait dans nos tentes. Nous n'étions pas loin de croire au second déluge. Nous avons eu au moins quatre ou cinq pouces d'eau. Heureusement, cette averse n'a pas duré longtemps. Le temps s'est remis au beau dans le courant de la soirée. Avec nos couvertures soigneusement étendues sur la terre, nous avons pu faire des lits passables, sur lesquels nous allons bien dormir, sans trop nous apercevoir de l'humidité. Cette nuit pourrait bien nous revenir à la mémoire plus tard, si jamais nous ressentons des attaques de rhumatisme.\n\nMercredi, 24 Juin—Glorieux St-Jean-Baptiste, vous n'êtes pas beaucoup connu dans ces parages. Votre fête s'est passée au Nord-Ouest le plus tranquillement du monde. Pas de messe, pas de procession, pas le plus petit air de fête! Le repas, l'exercice et la garde comme les autres jours, tel a été le 24 juin 1885, à Crowfoot. Assurément, ce n'était pas très divertissant.\n\nÀ dix heures, je partis pour Gleichen, avec un autre détachement. Nous devions faire la route à cheval. Nous n'avions encore parcouru que cinq ou six milles, quand nous vîmes un sauvage accourir à notre poursuite, armé d'une carabine. Nous n'étions pas de peine à reconnaître l'individu de qui nous avions loué nos chevaux. Nous étions convenus de lui donner une piastre chacun, pour aller jusqu'à Cluny, qu'est à mi-chemin entre Crowfoot et Gleichen. Le sauvage s'était douté de notre projet, et, aussitôt après notre départ, s'était mis à notre poursuite. Il voulut nous faire rebrousser chemin, à quoi il ne réussit pas, bien entendu. Nous lui dimes de nous\nsuivre jusqu'à Cluny, où nous arrangerions l'affaire. Nous savions rencontrer à cet endroit sept de nos camarades.\n\nEn effet, rendus à Cluny, nous contâmes l'affaire aux soldats du détachement, qui décidèrent que nous irions à Gleichen. Le sauvage dut y consentir, tout en disant qu'il nous retrouverait le soir à Crowfoot, mais nous étions déjà loin. Pour couper court à ses objections, nous avions sauté en selle et nos chevaux nous emmenaient au grand galop dans la direction de Gleichen.\n\nAvez-vous jamais fait quarante milles à cheval, dans la même journée ? Si oui, je vous plains ; si non, je vous conseille de n'en pas faire l'essai. On revient les jambes meurtries, courbaturé, et éprouvant un malaise particulier à certain endroit du corps humain qui ne s'appelle plus le dos. Il faut un long repos pour se remettre d'un semblable voyage. J'en profite pour aller dormir jusqu'à demain.\n\nVendredi, 26 Juin.—Il a fallu envoyer à Gleichen chercher le Dr Cloutier, pour un de nos camarades qui est malade. Le docteur nous a appris que le détachement d'Edmonton est de retour. Nos pauvres amis ont eu toutes les misères du monde pour se rendre à destination. Les chariots de provisions qu'ils escortaient calaient à chaque instant, jusqu'à l'essieu, dans les ornières. Il fallait un travail de géants pour les en retirer. Un peu plus loin, un bœuf tombait, et alors le brouhaha recommençait. La pauvre bête était tiraillée, poussée, foulée aux pieds, puis finalement étranglée, dans les efforts que l'on faisait pour la tirer de son mauvais pas.\n\nLes pauvres diables doivent être bien contents de se voir revenus à Calgary. Ils vont toujours pouvoir se reposer un peu.\n\nNous apprenons aussi que le lieut. col. Amyot, le lieut. col. Evanturel et cinq autres officiers sont partis de Calgary pour Fort McLeod, d'où ils ramèneront le détachement qui y est stationné. C'est la réunion du bataillon qui commence. Il est probable que notre tour viendra bientôt et que dans quelques jours nous recevrons aussi l'ordre de partir pour Calgary.\n\nIl paraît qu'avant de partir pour Québec, nous irons faire une course jusqu'aux Montagnes Rocheuses, aux frais du gouvernement. C'est une attention délicate que nous saurons apprécier en temps et lieu. Au retour, nous prendrons la route\ndes lacs, passant sur le territoire des États-Unis. Le docteur croit que nous partirons d'ici dans cinq ou six jours. Cette nouvelle est une fameuse médecine qu'il nous a administrée.\n\nNous avons vu aujourd'hui plusieurs centaines de sauvages. Ils ne nous ont pas causé le moindre trouble.\n\nSamedi, 27 Juin.—Les sauvages sont partis d'ici, ce soir, ils se rendent à Crowfoot-Crossing, où toute la tribu des Pieds-Noirs se réunit pour la \"danse du Soleil,\" qui a lieu le 1er juillet. C'est un grave événement pour eux. On dit que c'est assez intéressant. Nous nous promettons bien d'y assister, si on nous le permet.\n\nLes sauvages que nous avons vus n'ont pas perdu leur temps. Ils se sont occupés, pendant leur séjour ici, à ramasser des os, qu'ils vendent ensuite au gouvernement. Ils en ont expédié un char, ce qui leur vaut la somme de trente piastres. \"Tous les métiers mènent à la fortune.\" Chez les sauvages, il semble que ce soit tout le contraire : l'absence de fortune les pousse à exercer tous les métiers...... qui ne sont pas fatigants.\n\nLundi, 29 Juin.—Cinq soldats sont partis à une heure, ce matin, pour Calgary. Ils comptent faire le trajet en huit heures, arrêtant à Gleichen et Langdon, pour prendre des rafraîchissements. Le moyen de locomotion est, comme toujours, le hand-car.\n\nMardi, 30 Juin.—La St-Pierre a été célébrée, en grande pompe, ce matin, à Gleichen. Le R. P. Doucet a chanté la messe au camp.\n\nNos voyageurs ne sont pas allés plus loin que Gleichen, le capitaine Garneau leur ayant dit qu'il attend de jour en jour l'ordre de partir pour les Montagnes Rocheuses. Ils ont, en conséquence, repris la route de Crowfoot.\n\nAvant leur départ, ils ont assisté à une danse des sauvages. C'est le prélude de la \"Danse du Soleil.\" Il y a là au moins un millier de sauvages, en grand costume des jours de fête, tous plus barbouillés, plus hideux, les uns que les autres. À un moment donné, ils sont devenus tellement excités, que les officiers de l'endroit ont craint qu'il n'y eût du trouble. Pour les calmer, le capitaine LeVasseur leur a distribué du thé, du tabac et du sucre. Les Pieds-Noirs ont mélangé le tout et ont absorbé en un clin d'œil cet horrible breuvage. S'ils boivent\ncela sans faire la moindre grimace, ils peuvent en avaler bien d'autres.\n\nMercredi, 1er Juillet.—Pendant que je faisais la garde la nuit dernière, par un clair de lune comme on n'en voit pas souvent, je me figurais être à Québec, arpentant la rue St-Joseph, par un beau soir, et je jouissais d'avance du plaisir que nous y goûterons dans quelques semaines.\n\nVers deux heures, arrivent le capitaine Garneau et quatre soldats du détachement de Gleichen. Ils viennent nous avertir de nous tenir prêts pour le départ, dont l'ordre peut arriver d'une minute à l'autre.\n\nNous avons eu dans la soirée une invasion d'ennemis plus féroces que Gros-Ours et sa bande, êtres malfaisants dans toute la force du terme, dont la cruauté reste toujours inassouvie : les maringouins. Dieu ait pitié de nous et nous préservent des attaques de ces barbares ! Nous n'avons qu'un moyen de les combattre : la fumée. On ne saurait se faire une idée de la quantité de pipes que nous bourrons et des nuages épais dont nous cherchons à nous entourer, afin d'avoir quelques instants de repos. Par là, nous réussissons à éloigner les terribles maringouins, puis, quand le nuage se dissipe, il faut bourrer de nouveau les pipes, et mettre une nouvelle barrière entre les ennemis et nous. Dormez, avec ce jeu-là, si vous le pouvez !\n\nJeudi, 2 Juillet.—Nous avons rencontré aujourd'hui un métis, à quelque distance du camp. Interrogé par nous, il dit qu'il venait de Calgary et s'en allait au lac du Canard, distance de quatre cents milles. Il nous montra ensuite un billet du R. P. Lacombe disant de le laisser passer, qu'il était complètement étranger à la rébellion. Nous n'avons trouvé rien de mieux que de l'amener au camp, où nous l'avons fait souper.\n\nVendredi, 3 Juillet.—Un convoi du Pacifique nous a amené, ce soir, le R. P. Doucet et le capitaine Fiset, frère de notre commandant, qui arrive de McLeod. Il vient voir son frère dont il est séparé depuis deux mois, et est en même temps chargé de nous apprendre que nous partirons lundi ou mardi.\n\nLe détachement de McLeod est revenu à Calgary, de sorte que, lorsque nous y arriverons, avec ceux de Gleichen et de Langdon, que nous prendrons en chemin, le bataillon sera au complet.\nLundi, 6 Juillet.—Dans l'après-midi, un hand-car ramenait le lieutenant Fiset, qui était allé reconduire son frère à Gleichen. Il nous apportait en même temps notre part des effets que nous ont envoyés les dames de Québec. Bonnes québécoises ! elles n'oublient pas les absents. Nous reconnaissons bien là leur bon cœur, dont elles ont déjà tant de fois donné des preuves. Qu'elles acceptent l'expression de notre profonde reconnaissance.\n\nNous avons passé notre dernier jour à Crowfoot. Dans le cours de la soirée, nous avons reçu du lieut.-col. Amyot une dépêche nous disant de nous tenir prêts. Un train nous prendra à quatre heures, demain matin, pour nous conduire à Calgary. Nous avons passé le reste de la veillée à faire nos malles. Tout est prêt. Nous ne nous sentons ni le goût ni le besoin de dormir, tant nous avons hâte de faire ce premier pas qui va nous ramener vers la patrie.\n\nAdieu, beau pays de Crowfoot. Il est bien probable que nous ne te reverrons jamais. Puissent ceux qui viendront te peupler couler des jours aussi doux que ceux que nous y avons passés ! Adieu, Pieds-Noirs, nos amis ! Vivez en paix dans vos réserves ! barbouillez-vous tant qu'il vous plaira, cachez à votre aise, sous l'ocre aux mille couleurs et les ornements de toutes sortes que vous affectionnez, vos mâles et nobles visages ; dansez les danses du soleil, de la lune, des étoiles, du tabac, etc., nous ne viendrons plus vous déranger. Restez sauvages tant que vous voudrez, cela ne nous regarde pas, et nous nous donnerons bien garde de nous en mêler. Mais de grâce, pour l'amour de Dieu ! n'ayez jamais l'intention de vous révolter et de nous mettre dans le cas de revenir dans votre chien de pays !........ Nous vous serrons la main, souhaitez-nous bon voyage et prompt retour....... Adieu !\n\nJe reçois aujourd'hui une dépêche de Québec m'annonçant la mort de mon père, arrivée dans la nuit de samedi à dimanche. Il a succombé à un cancer de la mâchoire. Pauvre père ! il était déjà malade, quand nous sommes partis de Québec. Le médecin nous assurait même qu'il n'en avait pas pour longtemps à vivre. Mais je ne croyais pas que sa fin dût être si prochaine. J'espérais le voir encore, à mon retour à la maison. Mais la Providence en a décidé autrement. J'aurais aimé lui fermer les yeux, recueillir son dernier soupir, recevoir de lui\nme dernière bénédiction. Mais il m'a fallu partir quand même ; la voix du devoir a dû parler plus fort que celle de l'amour filial. Et au foyer, je trouverai une place vide, celle du chef de la famille. Au lieu d'une joie sans mélange, je verrai, moi aussi, des larmes quand je reviendrai...........\n\nAdieu, cher et vénéré père. Du haut du ciel, donnez à votre fils une bénédiction, afin qu'il fasse, à l'avenir, son possible pour soulager la douleur de sa bonne mère. Je prie Dieu qu'il vous accorde, dans sa toute-puissante miséricorde, le bonheur du repos éternel.\n\nMardi, 7 Juillet.—A une heure, ce matin, tout le monde était sur pied. Quelques instants après, nous prenions le déjeuner, puis les tentes furent descendues. A quatre heures, le bruit du train qui s'approchait faisait tressaillir nos cœurs de joie. Nous partions, heureux d'être enfin en route pour notre beau Québec. Je dois dire (à notre honte, croira-t-on peut-être) que nous n'avons pas éprouvé le plus léger sentiment de regret en quittant Crowfoot. L'égoïsme d'un bonheur comme le nôtre doit être bien excusable.\n\nNous sommes arrivés à Calgary à midi, après avoir pris en route les détachements de Gleichen et de Langdon, aussi heureux que nous de quitter leur campement respectif.\n\nQuoiqu'il ait plu à torrents toute la journée, nous avons pensé que c'était un beau jour. A notre arrivée, on nous conduisit sur le champ de parade où le lieut.-col. Amyot nous adressa la parole. Il nous félicita de notre bonne conduite, pendant notre séjour aux différentes stations où on nous avait envoyés, et termina en nous apprenant que nous partirions demain matin pour les Montagnes Rocheuses. Le gouvernement nous procure l'agrément de ce voyage pour nous récompenser de nos loyaux services.\n\nA trois heures, nous avons eu une parade, à la suite de laquelle on nous a distribué des helmets pour remplacer nos fameux scotch caps, et les immenses chapeaux de paille que nous avions portés depuis quelques jours.\n\nAprès le souper pris, dans les casernes, nous sommes allés prendre nos quartiers à bord du train qui doit nous amener, à deux heures demain matin, vers les Montagnes Rocheuses et la Colombie Anglaise.\nEDMONTON.\n\nUn soldat de la compagnie No. 5, formant le détachement d'Edmonton, M. Léonidas Rousseau, m'a fait le récit suivant de son voyage :\n\n\"Nous recevions ordre de partir le 28 mai, au nombre de 25, sous le commandement du capitaine Dupuis. Notre détachement comprenait aussi le sous-lieutenant Dion et le sergent-major Edmond Trudel. Nous avions l'ordre d'escrofter un convoi de provisions jusqu'à Edmonton, distance de 220 milles au nord de Calgary. Le pays que nous avions à traverser était couvert de nombreuses tribus sauvages, et comme le convoi représentait une forte somme d'argent, les autorités avaient jugé à propos de le faire accompagner d'un détachement assez considérable, afin d'empêcher les sauvages de céder à leur convoitise, s'il leur prenait fantaisie de s'emparer des effets dont nous avions la garde.\"\n\n\"Notre départ ne put s'effectuer que le 30 mai. Ce temps a été employé à transporter de l'autre côté de la rivière Elbow les deux cent-cinquante chariots dont se composait le convoi, sur un bac qui ne pouvait porter plus que deux voitures à la fois.\"\n\n\"Nous avions une bonne provision de vivres. Bien nous en avons pris, car nous ne nous attendions pas à faire un si pénible voyage.\"\n\n\"Notre caravane avait une longueur de deux milles à peu près. Le trajet fut d'abord assez agréable. Le chemin, sans être ce qu'il y a de plus beau, était cependant assez facile pour ne pas fatiguer outre mesure les hommes ni les bêtes.—À onze heures, le chef de la bande donna le signal d'arrêter. C'était le temps de songer au dîner. Cet ordre fut accueilli avec grande joie. Nous nous sentions en appétit. Le fait est que nous marchions depuis cinq heures et demie ce matin.\"\n\n\"Tout le monde se met à la besogne ; les uns vont chercher de l'eau au prochain marais pour faire le café. Les autres fendent du bois, (nous le ménagions comme la prunelle de nos yeux, sachant que nous n'en trouverions pas avant d'arriver à\nRed Deer (ou rivière La Biche), à mi-chemin entre Calgary et Edmonton. Pour faire la cuisine, nous enlevons quelques motes de gazon, et au-dessus du trou que nous avons fait, il suffit de poser une branche d'arbre sur deux piquets fichés en terre : c'est primitif, mais commode. Quand tout fut prêt, chacun se mit à table, c'est-à-dire s'accroupit sur ses talons ; le foin de la prairie nous servait de nappe, et les gamelles remplaçaient toutes les autres pièces du service. Les mets n'étaient peut-être pas des plus succulents, mais, l'appétit et la bonne volonté aidant, nous primes un dîner des mieux conditionnés. Chacun mangea comme s'il ne devait plus prendre une bouchée pendant plusieurs jours. Notre dîner se composait de lard fumé, de (corn-beef) bœuf préparé en boîte, arrosé d'une bonne tasse de café. On n'est pas encore trop à plaindre quand on a devant soi un tel repas, accompagné d'un bon biscuit de matelot, dont chaque bouchée nous arrive dans l'estomac comme des coups de poings de charreter.\n\n\"Après le dîner, il fallait songer au lavage de la vaisselle. Il n'y avait pas d'eau à gaspiller, les linges destinés à cet usage n'étaient pas en abondance. Le seul moyen était donc de passer dans nos gamelles une poignée d'herbe. \"Çà enlève toujours le plus gros,\" disait le sergent-major Trudel en nous donnant l'exemple. Cette opération terminée, venait le tour de la pipe. Chacun bourrait la sienne avec une ardeur incroyable, et bien-tôt tout le monde, couché sur le dos ou accroupi sur ses talons, envoyait vers le ciel un nuage de fumée aussi épais qu'il possible. Après une couple d'heures de repos, la caravane se remettait en marche.\"\n\n\"Quand arrivait le moment d'arrêter, au signal donné par le chef, chaque chariot venait se placer de manière que l'ensemble formât un grand cercle, au milieu duquel nous dressions nos tentes. Le souper se préparait de la même manière que le dîner, puis on choisissait les sentinelles pour la nuit. Notre brave capitaine ne voulut pas faire exception à la règle, et exigea qu'on lui comptât autant d'heures de garde qu'aux autres.\"\n\n\"Les éclaireurs qui nous accompagnaient faisaient de temps à autre une reconnaissance à quelques milles du camp. Heureusement, ils n'ont eu aucun danger à signaler, et chaque nuit, nous avons pu dormir tranquilles. Nous en étions bien\ncontents, car, le soir venu, nous ressentions tellement de fatigue que nous avions besoin de tout le temps qui nous était accordé pour nous reposer de notre longue marche.\"\n\n\"Outre la garde du camp, contre les dangers de l'extérieur, la sentinelle avait aussi à prévenir les troubles au dedans. Il lui fallait veiller à ce que rien ne fût enlevé dans les voitures par les charretiers, qui n'étaient pas des gens absolument scrupuleux.\n\n\"Tel a été le programme de chaque jour, tout le temps qu'a duré le voyage.\"\n\n\"A la veillée, des groupes se formaient sous chaque tente; on y discutait les questions du jour, en fumant la pipe, on chantait, on parlait des absents de Québec, de tous ceux que nous avions laissés là-bas, et qui attendaient sans doute avec impatience notre retour. Quelques-uns des charretiers canadiens-français se joignaient à nous, et prenaient part à la conversation. Il y en avait un surtout, un nommé White, alias Leblanc, qui aimait à venir parler avec nous. Il avait quitté Montréal à l'âge de quinze ans, et n'y est pas retourné. Depuis nombre d'années il n'a eu aucune nouvelle de ses parents, il ne sait pas même s'ils vivent encore. Je lui demandais un jour s'il ne viendrait pas bientôt nous faire visite à Québec. \"Je le voudrais bien, me répondit-il, car j'aimerais avoir des nouvelles de ma famille. Mais je ne puis amasser assez d'argent pour mes frais de voyage.\"—Malheureusement, ce pauvre garçon a le défaut de plusieurs autres : l'ivrognerie et le jeu leur font perdre tout le fruit de leur labeur. White me disait, le premier jour du voyage, qu'il avait perdu, la veille, $70 aux cartes.\"\n\n\"Nous avions, avec nous une quarantaine de charretiers, métis français et anglais. Ces braves gens voyagent en famille. Leurs voitures sont leurs demeures. Ils traînent partout avec eux leurs femmes et leurs enfants. Nous avions habitué quelques jeunes métis à venir causer avec nous, aux heures de repos ; il fallait, pour cela, un grand effort de volonté ; car ils sont excessivement timides. Ils étaient tout surpris, et nous écoutaient avec une attention religieuse, quand nous leur parlions de la manière de vivre des canadiens, de la ville de Québec, du grand fleuve dans lequel elle baigne ses pieds, des immenses navires qui sillonnent le St-Laurent. Ils nous écou-\ntaient bouche béante, et ne semblaient pas loin de nous regarder comme des princes. Ils sont ignorants des choses les plus élémentaires. Il ne leur manque que la pureté du sang pour être de vrais sauvages.\"\n\n\"Ces métis qui étaient avec nous avaient pour nous un grand respect et nous portaient une affection sincère. 'Vous êtes polis et pas mauvais du tout, nous disaient-ils souvent. Vous n'êtes pas comme les Rouges.' Ils voulaient parler des soldats de la Police Montée, qui ne les traitent pas toujours, paraît-il, avec une bonté remarquable. Nous avons toujours fait en sorte qu'ils n'aient pas à se plaindre de nous. Ces pauvres diables sont déjà assez malheureux d'être privés des bienfaits de la civilisation, que nous nous serions fait scrupule de leur causer le moindre chagrin.\"\n\n\"Ces métis sont très-durs au froid. Bien que les journées fussent chaudes, les nuits étaient très-froides. Nos charretiers n'avaient pas besoin de tentes. Ils se couchaient en plein air, et paraissaient parfaitement à leur aise, quand souvent nous grelottions. Et cependant, nous prenions d'assez grandes précautions. Nous mettions d'abord sur le sol nos toiles cirées, afin de nous protéger contre l'humidité. Comme matelas nous étendions trois couvertures de laine ; un nombre égal de couvertures servait à nous couvrir. Quand le terrain présentait trop d'inégalités, nous abattions les bosses à grands coups de maillet, histoire d'amollir nos lits. Afin d'avoir plus chaud, nous couchions deux par deux, ce qui donnait lieu à des incidents parfois comiques. Un soir, entre autres, deux gaillards ne pouvaient parvenir à s'entendre. L'un avait froid aux pieds l'autre à la tête. Chacun tirait les couvertures vers la partie de son individu qu'il voulait protéger plus spécialement. De là, grosse chicane... pour rire, et lazzis des confrères. La dispute finit par s'apaiser, et nous pûmes dormir en paix.\"\n\n\"Le deux Juin, à quatre heures et demie du matin, nous étions sur pied. Il y avait bien quelques retardataires, en particulier le caporal N... Nous avions cependant trouvé le moyen de le faire lever en même temps que les autres : il suffisait de lui jeter la tente sur le dos. Le moyen réussissait infailliblement. Il se levait furieux, on peut le croire, mais sa mauvaise humeur devait finir par céder devant nos railleries.\"\n\n\"La nuit avait été très froide, au point de gelér l'eau dans...\"\nnos gourdes. Mais dès que le soleil se fut montré; la tempéra-\nture changea subitement. La chaleur était écrasante, et le\ntemps magnifique.\"\n\n\"Le matin du trois, nous nous trouvâmes dans l'impossibilité\nde continuer notre voyage. Pendant la nuit, vingt-cinq che-\nvaux avaient trompé la vigilance de nos éclaireurs et s'étaient\nenfuis du côté de Calgary. C'était un retard de trois ou\nquatre jours. Quelques-uns soupçonnaient nos charreteries de\nnous avoir joué ce mauvais tour afin de gagner du temps. Ils\nsont payés $12 (douze piastres) par jour, à part leur nourri-\nture et celle de leurs chevaux. Plus le voyage est long, plus\nil leur rapporte d'argent.—Dans notre embarras, le capitaine\ndécida qu'une partie du détachement, sous les ordres du lieu-\ntenant Dion, resterait à l'endroit où nous étions campés, pour\nprendre soin de nos effets, en attendant les chevaux, tandis\nque l'autre continuerait sa route, avec le gros du convoi.\"\n\n\"Ce jour là, un de nos éclaireurs, en jouant avec son revol-\nver, se blessa assez gravement au doigt. Notre sergent d'hô-\npital, M. Royal, fils du député de Provencher, lui donna des\nsoins intelligents, et l'amputation ne fut pas nécessaire. Pen-\ndant trois semaines, le pauvre éclaireur ne put se servir de sa\nmain malade.\"\n\nLe quatre juin, nous repartîmes de l'avant. Le détachement\nqui était resté au campement reçut, dans la journée, la visite\nde Monseigneur Grandin, évêque de St Albert, qui se rendait\nà Winnipeg. Sa Grandeur leur dit la messe.\"\n\n\"Le lendemain, nous fîmes la rencontre d'un sergent du\n65ème bataillon. Il avait appris que nous devions arriver le\nsoir même à Red Deer, et il était accouru nous souhaiter la\nbienvenue. Il avait en même temps une mauvaise nouvelle à\nnous annoncer : dans une rencontre avec la bande de Gros\nOurs, la colonne commandée par le général Strange avait\nperdu plusieurs hommes. [nous avons appris plus tard que la\nnouvelle était sans fondement.]\n\n\"A six heures du soir, nous arrivions à Red Deer. Il ne\nnous fallut pas longtemps pour devenir bons amis avec\nles soldats du 65ème. C'était la première fois que nous nous\nrencontrions depuis le commencement de la campagne. Ils\nétaient très heureux de nous voir. Notre entrevue fut des\nplus cordiales.\"\n\"Le détachement de Red Deer se composait de trente hommes, commandés par le capitaine Normandeau, un charmant garçon que nous aurons du plaisir à revoir, si le hasard nous procure cette bonne fortune. Ils ont construit un joli petit fort, très bien fait, et capable d'en imposer à une forte bande de sauvages.\"\n\n\"Le détachement que nous avons laissé en arrière nous rejoignit dans la nuit. Nous ne pûmes partir de Red Deer que trois jours plus tard. La Rivière La Biche était tellement gonflée que nous ne pouvions songer à la traverser. Et d'ailleurs, le câble qui retient le bateau passeur (car le courant est très fort à cet endroit) s'était rompu.\"\n\n\"Notre séjour à Red Deer restera longtemps gravé dans la mémoire de deux de notre détachement. Quelques soldats du 65ème, étant de l'autre côté de la rivière, leur demandèrent d'aller les chercher en bateau. Voilà les deux braves partis. Malheureusement, leur science de la navigation n'était pas à la hauteur de leur bonne volonté. Comme ils étaient au beau milieu du courant... crac !..... le câble se rompit, et voilà nos amis à la dérive. Par bonheur, l'embarcation alla s'échouer à une petite distance.—Il est heureux que cet accident ne soit pas arrivé pendant qu'il y avait des voitures sur le bateau. Il aurait pu avoir des conséquences beaucoup plus graves. Il fallut nous mettre à l'œuvre pour replacer le câble. L'habileté du sergent-major Trudel nous fut très utile en cette occasion, et nous épargna bien des misères et bien des tâtonnements.\"\n\n\"Le câble posé, nous commençâmes à traverser. Mais à peine avions-nous fait passer quelques voitures, que le câble se rompit de nouveau. Force nous fut de recommencer l'opération du posage. Ce fut plus facile que la première fois.\"\n\n\"Le soir du même jour, nous campions sur le bord de la Rivière de l'Aveugle, à dix milles de Red Deer. Le brochet abonde dans cette rivière. Malheureusement, nous n'avions pas de lignes, et nous dûmes renoncer au plaisir de pêcher. Ah ! nous y revenons jamais !........\"\n\n\"La treize, nous étions rendus à la rivière Bataille, où était un second détachement du 65ème. Ces messieurs vinrent passer la soirée avec nous, et nous firent cadeau d'une couple de pains, ce dont nous fûmes enchantés. C'était une heureuse diversion au biscuit.\"\n\"De Red Deer à Edmonton, le pays est boisé. La prairie s'y fait rare. Plus on gagne vers le nord, plus le terrain est élevé. Le bois est généralement petit. Il y du frêne, du peuplier et du saule.\"\n\n\"Nous avons eu quelques fois le bonheur de faire un bon déjeuner. Le lièvre est très abondant dans ces parages. Le lièvre du Nord-Ouest est excellent ; son goût ressemble assez à celui du lapin. Il y a aussi, dans les lacs et les marais, une grande quantité de canards. Mais il est difficile de les abattre à coups de fusil. Nous nous en dédommagon en mangeant des poules d'eau, quand nous osions nous risquer à aller les prendre au nid, ce qui n'est pas toujours agréable, car il faut se plonger dans l'eau jusqu'au cou, et on en ressort invariablement couvert de sangsues. Le remède pourrait convenir parfaitement pour le traitement de certaines maladies. Je le signale à la faculté de médecine.\"\n\n\"Entre Red Deer et Edmonton, nous avons enduré beaucoup de fatigue et de misère, par suite des mauvais chemins. Les voitures entonnaient jusqu'à l'essieu dans des trous affreux, ornières insondables, auxquelles les habitants du pays donnent le nom de \"ventres de buffles.\" La surface en est très unie. De loin, rien n'indique au voyageur le danger de ces endroits. On s'y engage sans crainte, et dès que les voitures y sont, la surface unie cède sous le poids, et le véhicule enfonce quelquefois de deux pieds et plus. Il faut alors que tout le personnel de la caravane se mette à l'œuvre. On attache à la voiture une longue corde, sur laquelle tout le monde tire à la fois. C'est ce qu'on appelle \"faire la corde,\" ouvrage pénible, qu'il faut renouveler sans cesse.\"\n\nUne autre misère vint s'ajouter à celle de la \"corde.\" Les moustiques nous ont fait une guerre atroce, impitoyable. Nous ne pouvions guère nous en débarrasser qu'en fumant comme des Turcs, et encore trouvaient-ils moyen de s'introduire sous nos vêtements et de nous piquer affreusement. Il fallait alors voir chacun frotter sans relâche la partie du corps où l'insecte avait laissé trace de son passage, ce qui n'apportait aucun soulagement, et augmentait, au contraire, l'inflammation.\"\n\n\"Le onze, nous prîmes le dîner à Peace Hill (montagne de la paix) où est un détachement du 65ème, sous les ordres du...\"\ncapitaine Ethier. C'est à Peace Hill que se termine la ligne télégraphique de Edmonton, Battleford, etc. Cette ligne se rendra avant longtemps jusqu'à Calgary, reliant l'ensemble des forts disséminés sur une immense étendue du Nord-Ouest.\"\n\n\"Le lendemain, nous avions le spectacle d'un feu de prairie. Il faisait une chaleur suffocante. Nous avons pris le dîner sur la réserve des Cris de la Rivière Bataille. Un missionnaire, le R. P. Scollan, partagea notre modeste repas. Nous lui fimes un siège d'honneur, composé d'une boîte vide placée sur une chaudière renversée. Pour nous, nous préférons la posture orientale, que l'absence de tout meuble nous fait trouver plus commode. Tout le monde fit honneur au dîner, surtout le bon Père, qui n'avait mangé que deux biscuits depuis quarante-huit heures.—Avant de quitter le zélé missionnaire, nous lui donnâmes un gros sac de provisions qu'il voulut bien accepter.\"\n\n\"La réserve des Cris, où nous avons fait halte, est habitée par cinq cents sauvages, dont trois cents sont catholiques. Les autres sont méthodistes, presbytériens ou païens. Quelques jeunes gens de la réserve ont pris part à la rébellion ; les autres se sont contentés de piller les magasins du gouvernement. Ils ont été plus tard obligés de remettre ce qu'ils avaient volé.\"\n\n\"Les Cris sont grands et bien faits ; ils sont aussi, généralement, d'une grande propreté, si on les compare aux autres sauvages, et ont bien meilleure mine que les Pieds-Noirs et les Sarcis. Quelques-uns d'entre eux se livrent à la culture,\" nous dit le Père Scollan, qui nous a fourni ces renseignements.\"\n\n\"Le dix-sept, nous arrivâmes enfin à Edmonton, but de notre voyage.\"\n\n\"Edmonton est bâti sur une hauteur. Comme site, son apparence nous rappelle un peu la jolie ville de Lévis. Il y a une mission catholique, environ une cinquantaine d'habitations, et une scierie, dont l'exploitation a dû être interrompue à cause de la rébellion. Le fort est très grand et bien construit. Un vieux canon y montre sa gueule à travers la meurtrière d'un bastion. La place est gardée par un détachement du 65ème bataillon et une compagnie de l'infanterie légère de Winnipeg sous le commandement du lieut.-col. Ouimet. La compagnie de la Baie d'Hudson a à Edmonton des magasins considérables.\"\n\"Après avoir remis au commandant de la place notre convoi de provisions, nous nous remîmes immédiatement en route pour Calgary.\"\n\n\"Le dix-huit, il y eut de la pluie et du tonnerre toute la journée. Heureusement, le beau temps revint bientôt. Au retour, nous saluâmes en passant nos amis du 65ème stationnés à Red Deer, Peace Hill et à la Rivière Bataille.\"\n\n\"Le vingt-quatre, nous étions revenus à Calgary, après vingt-six jours de marche forcée. Nous étions noirs et sales à faire peur au diable en personne, mais nous étions heureux de revoir nos camarades, et aussi de pouvoir nous reposer un peu.\"\n\nAUX MONTAGNES ROCHEUSES.\n\nMercredi, 8 Juillet.—Au petit jour, ce matin, nous étions à cinquante milles de Calgary, et déjà nous pouvions apercevoir les montagnes.\n\nÀ six heures, déjeûner à Canmore, qui est une très jolie petite ville. Nous continuons jusqu'à Silver City, où nous n'arrêtions que quelques minutes, puis à Langgan. C'est le premier pas que nous faisons dans la Colombie Anglaise.\n\nLe spectacle est des plus beaux à voir. D'un côté, sur un parcours de trois à quatre cents milles, la rivière Elbow rouissant ses flots tranquilles. De l'autre, une muraille de granit, affectant les formes les plus variées. Nous montons une pente rapide, parfois nous nous trouvons à une hauteur considérable, ayant à gauche un précipice sans fond, à droite des pics dont les cimes se perdent dans les nuages. On ne peut se lasser d'admirer les merveilles que la nature offre ici à nos yeux. Le panorama qui s'offre à nos regards change continuellement.\n\nEt le train monte toujours, comme s'il ne devait s'arrêter qu'à la voûte du firmament. On est là, comme suspendu dans l'espace; on n'ose regarder ni en haut ni en bas. L'immensité du coup d'œil donne le vertige. Parfois la traversée d'un tunnel, long de sept à huit arpents, nous plonge dans une obscurité presque complète, mais nous avançons toujours à toute vapeur.\n\nÀ six heures, nous débarquons à Donald, et à sept heures souper au Selkirk House, dont je recommande la bonne cuisine à ceux qui feront le voyage après nous. Il y a à Donald un fort joli pont jeté sur la rivière Colombie.\nJeudi, 9 Juillet.—Nous avons passé la nuit à Donald, couchés dans les chars. Après le déjeuner, pris au restaurant, nous étions quatre ou cinq, debout à la porte de l'établissement et regardant les montagnes, dont nous semblions très rapprochés. Un pic énorme attirait surtout notre attention. Notre hôte vint à nous et nous demanda à quelle distance nous croyions être de cette montagne.—Une trentaine d'arpents, fut notre réponse.—L'hôte nous regarda en riant : \"Vous en êtes à vingt milles,\" dit-il.\n\nDonald est situé à quatorze cents lieues de Québec. Quelle distance il nous reste à parcourir pour arriver chez nous !\n\nLE RETOUR.\n\nA huit heures nous reprenons le train, et le départ, le vrai départ pour Québec, cette fois, commence.\n\nNous arrêtons, au retour, à Canmore, où, nous allons visiter les Trois Sœurs. C'est un triple monument, composé de pyramides hautes de trente pieds, et mesurant quinze pieds de diamètre à la base, il est à un mille de l'hôtel.\n\nEn arrivant à Cochrane, nous avons eu à combattre une armée de………moutons. Ils étaient au nombre de sept à huit cents. Comme le chef de file s'était mis en tête de traverser la voie ferrée; au moment de l'arrivée du train, toute la bande l'a suivie. Le train n'a pu s'arrêter pour si peu, et il nous a fallu en sacrifier une vingtaine, qui sont péris victimes de leur entêtement.\n\nA huit heures et demie, nous arrivions à Calgary. Nous visitâmes une dernière fois cette jolie petite ville, où nous avons trouvé tant de sympathie. A notre départ, qui eut lieu à onze heures, tous les citoyens se sont rendus à la gare, pour nous dire adieu et nous donner une dernière marque de leur amitié.\n\nVendredi, 10 juillet.—A minuit nous passions à Gleichen, puis à Crowfoot vers deux heures.\n\nA neuf heures, arrêt à Maple-Creek, où nous déjeunons. Le train repart avec une vitesse de soixante milles à l'heure.\n\nNous faisons une courte station à Swift Current. Pound-Maker et vingt-trois autres prisonniers sont détenus là. Nous avons pu les voir. Pound-Maker est un grand sauvage, à l'air intelligent. Il y a aussi un nommé Nadeau, canadien-fran-\nçais, que l'on dit être l'assassin des Pères Fafard et Marchand. Tous ces prisonniers sont en route pour Régina, sous la garde de douze hommes de la police montée.\n\nNous arrivons à Régina à neuf heures, pour en repartir une heure après. Nous allons rôder du côté de la prison, mais malheureusement il nous est impossible de voir Riel, qui y attend son procès.\n\nSamedi, 11 Juillet.—À huit heures, ce matin, nous arrêtons à Brandon, et nous prenons le déjeuner dans le \"Grand Central Hôtel,\" à dix heures nous partons et à midi et demie nous passons au Portage de la Prairie, et à trois heures, nous arrivons à Winnipeg. Les citoyens nous font une belle réception. Après avoir pris le dîner au restaurant de la gare, nous partons en procession, escortés par la fanfare du Cercle Provencher, de St-Boniface, et nous nous rendons jusqu'au bout de Queen street, où nous campons, en face du collège.\n\nDimanche, 12 Juillet.—À neuf heures, messe au camp, dite par notre aumônier, puis congé pour le reste de la journée.\n\nLundi, 13 Juillet.—Nous avons eu ce matin une messe de Requiem chantée à la cathédrale de St-Boniface, pour le repos de l'âme de notre malheureux ami Achille Blais.\n\nAprès le service, Monseigneur Taché a prononcé le sermon suivant :\n\nEuntes ibant et flebant, venientes autem venient cum exultatione.\n\nA leur départ on versait des larmes abondantes, mais leur retour est le sujet d'une grande allégresse.\n\nMessieurs,\n\nIl y aujourd'hui quinze jours, j'étais dans la noble cité de Champlain, dans ce vieux Québec que nous aimons tant. Tous ceux que je vis me parlèrent du 9ème bataillon. On me décrit l'émotion profonde et les larmes abondantes causées par son départ, cependant on semblait se consoler de ces déchirements du cœur par la pensée que ceux qui en étaient l'objet reviendraient prochainement répandre l'allégresse dans le sein de leurs familles, causer une joie d'autant plus vive que leur absence avait été plus sensible.\n\nNos Livres Saints ont des paroles pour toutes les circonstances. Aussi en récitant mes vêpres, ce jour-là même, j'y trouvai le texte que je viens de citer et qui me semblait parfaitement approprié à votre situation, messieurs. Je ne vous dissimulerais pas qu'en attendant les regrets exprimés sur votre départ, je mêlai mes larmes à celles que je vis verser, comme\nJe m'efforçai d'augmenter la joie du retour en les assurant qu'il allait se faire bientôt, et à la suite d'une campagne tout à votre avantage.\n\nJe comprends ce qui a été éprouvé à votre départ de Québec ; les vives appréhensions auxquelles étaient en proie tous ceux qui vous aiment. L'imagination guidée par un cœur affectueux est bien puissante à se créer des inquiétudes. On vous voyait, ce qui a eu lieu, exposés à toutes les fatigues de longues et pénibles marches, à toutes les privations d'une pénible campagne dans un pays peu habité ; on voyait, ce qui n'a pas eu lieu, exposés à la cruauté de féroces Sauvages ; on voyait, et tous ensemble nous bénissions Dieu de ce que la chose n'a pas eu lieu, exposés à combattre des frères pour lesquels vous avez de vives sympathies. Tous ces appréhensions sont maintenant dissipées et vous revenez d'une campagne qui certainement aura des charmes pour vous le reste de votre vie. Ces mots : Calgary, Gleichen, McLeod, Crowfoot, Langdon et Edmonton étaient pour vous des mots sans signification ; pour le reste de votre vie, ils seront des noms pleins de charmes et d'agréables souvenirs. Laissez-moi vous le prouver par une anecdote qui m'est toute personnelle.\n\nJ'étais encore âgé que des six ans lorsque mon aïeul fit sur mon esprit d'enfant une vive impression en me disant qu'il était devenu soldat pour la défense de notre pays pendant qu'il était encore élève au célèbre Séminaire de Québec ; et en me rappelant ce souvenir de son adolescence scolaire et militaire, l'œil du vieillard s'enflammait d'une ardeur juvénile. Il m'était facile de sentir, son cœur battre plus vivement, et je compris depuis que cette circonstance avait enrichi toute son existence d'un charme particulier.\n\nVous vous êtes préparé quelque chose d'analogique pour le reste de votre vie ; la plupart d'entre vous, vous êtes élèves de cette même institution vénérable qui s'appelle le Séminaire de Québec ; plusieurs, vous êtes encore actuellement des étudiants de l'Université-Laval, à laquelle nous souhaitons tant de prospérité et d'avantages. Vous vous êtes soustraits à vos études pour répondre à l'appel du devoir et marcher à la protection de notre pays. Au retour dans vos foyers dans quelques jours, quelques-uns pourront dire à leurs enfants tout ce qu'ils ont vu, tout ce qu'ils ont senti pendant ce voyage ; puis, la vie passée si vite qu'on peut dire que bientôt vous redirez à vos petits-enfants les noms des places que vous avez parcourues, les souffrances que vous avez endurées, le bien auquel vous avez contribué, et plus tard vos petits-enfants parleront de votre prise d'armes, comme je viens de vous parler de celle opérée par mon aïeul il y a bientôt un siècle.\n\nEn passant à travers la province de Manitoba, vous avez entrevu un point que nous désirons vous être cher, et que vous ne deviez, peut-être pas visiter officiellement en corps. Cet endroit c'est St-Boniface. Dieu a voulu que vous y vissiez, et pour ce, il a envoyé une épreuve qui vous est sensible à tous : il a retiré de vos rangs un de vos camarades, le jeune Blais, dont la dépouille repose dans ce cimetière et pour le repos de l'âme duquel nous venons tous de prier.\n\nUn écrivain célèbre a dit que l'homme s'attache à la vie par ses misères autant que par ses prospérités. Vous vous êtes attachés au Nord-Ouest parceque vous y avez souffert. Calgary est devenu un centre d'attraction pour vous parceque vos larmes ont coulé sur la tombe d'un camarade.\naimé. St-Boniface réclame le même privilège; en mêlant nos regrets nous mêlons nos sympathies et vous vous souviendrez de St-Boniface. Ailleurs, il vous a fallu conquérir l'estime, le respect et la confiance, et cette conquête, votre conduite l'a assurée.\n\nLaissez-moi vous féliciter du succès que votre bataillon a remporté sous ce rapport. Nous vous avons suivi d'un coup d'œil trop affectueux pour ne pas saisir le moindre détail de ce qui s'est passé là-bas, dans l'extrême Ouest. Votre bonne confiance fait qu'en partant vous avez laissé des regrets au milieu de ceux mêmes qui tout d'abord vous étaient de moins sympathiques.\n\nIci, Messieurs, un sentiment tout différent vous avait précédé: nous vous connaissions avant de vous voir, nous vous aimions avant de vous connaître, et vous aviez droit de ne pas vous attendre à autre chose qu'à l'intérêt affectueux que nous vous portons.\n\nMaintenant, vous devez partir. Retournez vers ceux qui vous aiment et plus sensiblement ici-bas, reprendre les occupations auxquelles vous êtes arrachés au prix de tant d'inconvénients. Retournez, mais permettez-moi de vous le demander: ne nous oubliez pas. Vous avez vu notre pays; vous avez compris la pauvreté et l'extrême dénuement de nos zélés missionnaire de l'Ouest; vous avez vu ce qui nous manque, et vous avez vu aussi ce que nous avons; vous avez compris que les Canadiens sont parfaitement à leur place ici; et puisque c'est surtout le nombre qui nous fait défaut, chacun de vous, en revenant ou en envoyant quelqu'un, aidera à combler le déficit qui rend notre position plus faible qu'elle ne serait d'ailleurs.\n\nAvant de partir, laissez-moi vous dire combien je suis convaincu que tous et chacun de vous, officiers et soldats, tenez à maintenir l'honneur de votre bataillon sans tache, et combien vous êtes déterminés à ce que les séductions d'une ville en fête ne viennent pas ternir l'éclat que votre bonne conduite a fait jaillir sur le corps auquel vous appartenez.\n\nA ces conditions, vous rentrerez dans vos foyers emportant un souvenir agréable que rien de pénible n'altérera, et puisqu'il nous faut nous séparer, permettez-moi de vous le répéter: partez, messieurs, mais qu'au moins quelques-uns d'entre vous reviennent et que la bénédiction du ciel soit sur vous tous. Au nom du Père, du Fils et du Saint-Esprit; ainsi soit-il.\n\nPauvre Blais! Il dort son dernier sommeil loin de sa patrie, loin de sa famille en deuil. Nous sommes allés nous agenouiller sur la tombe, demandant à Dieu d'avoir plié de lui dans sa miséricorde. Blais était un excellent garçon, d'un caractère extrêmement doux. Chacun l'aimait et l'estimait au bataillon. La Providence lui réservait cette suprême épreuve de mourir seul, loin de tous ses parents et ses amis, sans pouvoir leur dire un dernier adieu. Dieu, qui sait toujours récompenser les souffrances endurées avec résignation, lui a sans doute compter les dernières douleurs de sa vie, car il est mort en chrétien et en soldat.\nMercredi, 15 Juillet.—Le général Middleton est arrivé cette après-midi, par train spécial. Nous sommes allés le recevoir à la gare. Nous étions là deux mille soldats, rangés de chaque côté de la rue, et nous lui avons présenté les armes.\n\nNous sommes allés aussi, à six heures, rencontrer le 90ème bataillon de Winnipeg, qui arrivé du théâtre de l'insurrection. Nous les escortâmes à l'Hôtel-de-Ville, où le général Middleton nous félicita tous de notre belle conduite pendant la campagne. S'adressant aux citoyens qui assistaient en foule à la cérémonie : \"Vous le savez, dit-il, ces volontaires ont été arrachés à leurs occupations pacifiques, ont souffert galement les privations et les misères de la campagne. Du jour où je me suis mis à leur tête, je n'en ai pas entendu un seul murmurer. Aussi, quand je porte mes regards en arrière, et que je songe à ce qui a été accompli par ces soldats-citoyens, tout ce que je puis dire, en vérité, c'est que le Canada ne peut que se féliciter d'avoir de pareils fils, et je ne puis que me féliciter moi-même d'avoir été placé à leur tête.\"\n\n\"........Tous les volontaires brûlaient du désir de prendre part à l'action, mais ils n'ont pu se rendre tous.......... Vous ne pouvez guère vous imaginer le noble empressement qu'ils ont apporté à remplir les devoirs qui leur avaient été assignés. Ils étaient employés à l'expédition des convois, au déchargement des navires...... D'une certaine façon, ces hommes ont montré une perfection plus vive que ceux qui ont pris part à l'action avec tant de plaisir.\"\n\nNous sommes revenus au camp à dix heures, heureux des éloges que nous avait adressés notre général.\n\nJeudi, 16 Juillet.—Nous avons retrouvé Winnipeg, aujourd'hui, ce qu'il était lors de notre premier séjour : sale, boueux, infect. Quand nous nous sommes levés, à six heures, il pleuvait à boire debout. Il y avait au moins deux pouces d'eau dans nos tentes. Pas moyen de faire la cuisine au camp, qui était du reste à peu près inhabitable. Voyant cela, le colonel Amyot alla avertir du fait le général Middleton, et lui dit qu'il ne voulait pas laisser ses soldats exposés à tous les temps, et qu'il désirait retourner à Québec. Vers deux heures, le général lui fit réponse qu'un train serait à notre disposition à sept heures ce soir. Le temps était court, mais nous avons fait gaiement nos préparatifs, et à l'heure dite nous étions à la gare.\nNous avons serré la main aux amis venus pour nous dire adieu, et à huit heures nous quittions Winnipeg.\n\nVendredi, 17 Juillet.—Nous sommes arrivés à trois heures à Port Arthur, où nous avons laissé le chemin de fer pour prendre la route des lacs jusqu'à Owen Sound. Nous embarquons à bord du steamer Alberta, avec le bataillon Midland. La traversée est très belle. Il fait un temps magnifique. Nous sommes comme en pleine mer. Après le souper, nous avons marché longtemps sur le pont du navire, nous attendant à jouir d'une belle nuit d'été sur ces immenses nappes d'eau sur lesquelles nous voguons tranquillement.\n\nSamedi, 18 Juillet.—Le temps se continue au beau. L'Alberta vogue paisiblement sur les flots, nous jouissons des beautés du voyage.\n\nÀ deux heures cette après-midi, nous sommes passés au Sault Ste-Marie, où est la ligne de démarcation entre le Canada et les États-Unis.\n\nDimanche, 19 Juillet.—Notre voyage sur eau est fini. Nous sommes arrivés à neuf heures, ce matin, à Owen Sound. Là, nous avons quitté le steamer pour reprendre le chemin de fer. Les citoyens d'Owen-Sound sont venus nous recevoir au débarcadère et nous ont fait une très belle ovation. On avait dressé sur le quai deux arcs de triomphe. La fanfare de la ville nous précédant, nous nous sommes rendus dans une grande bâtisse où un lunch magnifique nous fut servi.\n\nÀ quatre heures nous laissions Owen Sound par le chemin de fer du Pacifique. Nous avons remarqué dans les rues de cette ville un détachement de l'armée du salut composée d'une dizaine d'hommes et d'autant de femmes. Ils chantaient, accompagnés par un corps de musique. Une des femmes portait sur le devant de sa robe l'inscription suivante : Ready when Jesus comes.\n\nÀ Markell, il nous faut arrêter, à six heures, pour recevoir les félicitations des citoyens. Une vingtaine de dames nous distribuent des bouquets et la musique joue God save the Queen.\n\nNouvelles réceptions à Dunkald, Orangeville et à Charleston, où on a dressé des arcs, orné de pavillons les rues et les maisons publiques et privées.\n\nÀ Carlton, nous étions, à huit heures et demie, l'objet d'une\nnouvelle ovation de la part des citoyens. De ravissantes jeunes filles nous offrent des bouquets, que nous sommes heureux d'accepter venant de mains si mignonnes. On nous a préparé un magnifique souper dans la salle à manger de la gare. Au moment où nous entrons, deux jeunes canadiennes-françaises entonnent le chant national : \"O Canada,\" avec accompagnement de piano et cornet. Nos cœurs tressaillent d'allégresse en entendant ces accents du pays. Nous sommes très-reconnaissants aux organisateurs de la démonstration d'avoir eu cette délicate attention de nous faire entendre, dans notre langue maternelle, un de nos chants populaires, le plus nouveau, mais à coup sûr un des plus beaux.\n\nLa salle où on nous a servi ce souper était très-bien décorée de pavillons français, de fleurs et d'inscriptions comme celle-ci : \"Braves volontaires, vous êtes les bienvenus.\"\n\nAprès une courte promenade dans les principales rues de Carlton, qui est une jolie petite ville, nous reprenons les chars à neuf heures et demie, et nous repartons à toute vapeur, défiant la locomotive de lancer des nuages de fumée aussi épais que ceux que nous tirons des excellents cigares distribués par le Comité de réception. Au moment du départ, nous avons dû accepter une nouvelle avalanche de bouquets présentés par les gentilles demoiselles de l'endroit. Nous acceptons sans nous faire prier, cela va sans dire.\n\nÀ onze heures, arrivée à Toronto. Cinquante mille personnes, au moins, s'étaient réunies à la gare pour nous saluer. Nous débarquons aux sons de l'hymne national anglais, joué par deux fanfares. Nous avions peine à former les rangs, toute la foule se pressait pour nous voir de plus près. Finalement nous avons pu réussir, et nous voilà partis, musique en tête, pour faire le tour des principales rues de la ville. Les rues étaient magnifiquement décorées. Partout des arcs, des façades de maisons couvertes de drapeaux, d'inscriptions ; partout aussi on nous jetait des fleurs. Jamais un général victorieux ne fit dans Rome une entrée triomphale plus brillante que notre marche à travers les rues de Toronto. Toute la ville était sur pied. On se pressait pour nous voir. De temps à autre nous entendions les acclamations suivantes : \"Vive St-Roch !..... vive Québec ! etc.\" Ces mots nous faisaient du bien au cœur. Dans cette ville essentiellement anglaise et pro-\ntestante, on nous rendait hommage, à nous français et catholiques. Nos voisins savent reconnaître notre dévouement à la cause sacrée de la patrie, notre amour du devoir.\n\nQuand nous fûmes revenus à la gare, on nous fit une ample distribution de bière. Ce n'était pas sans besoin. Après avoir dévoré la poussière du chemin, tout en savourant notre triomphe, nous avions le gosier passablement sec. Nous n'avons manqué de rien pour apaiser notre soif, car aujourd'hui la bière a coulé dans Toronto plus abondante que l'eau à Québec, dans les plus beaux jours du vieil aqueduc.\n\nNotre colonel prit alors la parole et remercia les citoyens de Toronto, au nom du bataillon, de la belle réception qu'ils nous avaient faite. Son discours fut vivement applaudi. Nous embarquâmes immédiatement et nous sommes en route pour Ottawa. Comme il passe une heure du matin et que nous sommes joliment fatigués, je n'ai pas besoin de dire que nous allons faire une bonne nuit de sommeil.\n\nLundi, 29 Juillet.—Nous sommes arrivés à Ottawa vers une heure de l'après-midi. Aussitôt débarqués, on nous a conduits aux bâtisses du parlement, que l'on nous a fait visiter en détail. Vers trois heures, le bataillon forma les rangs, et l'honorable M. Caron, ministre de la Milice, nous adressa la parole. Il nous félicita chaudement de la manière dont nous nous sommes conduits pendant la campagne, et nous remercia, au nom du pays, des services que nous avons rendus.\n\nPuis nous défilons par les principales rues de la ville. À la gare, M. Stanislas Drapeau, président de la Société St-Jean-Baptiste, nous a fait un très-joli discours.\n\nÀ cinq heures nous partons pour Québec !\n\nMe voici à la dernière page de mon journal. Nous avons été absents quatre mois. Que de changements peuvent être survenus pendant ce court espace de temps. Allons-nous retrouver à Québec toutes les affections que nous y avons laissées ? Oh ! assurément, les cœurs de nos parents sont les mêmes, nous allons retrouver nos amis tels qu'ils étaient le jour de notre départ. Mais ces cœurs, si dévoués, qui promettaient, au moment de la séparation, de nous être si fidèles, ont-ils gardé leur promesse ? N'avons-nous pas plutôt subi le sort des absents : n'avons-nous pas eu tort, tandis qu'un autre, plus fortuné, aura pris notre place ?—Cette crainte, sans doute,\nest pénible. Chacun va retrouver plus fort, plus solide que jamais, cet amour qu'il a laissé croître par les appréhensions d'une campagne lointaine et périlleuse. Gardons l'espérance au moins jusqu'au dernier moment. Si nous devons être victimes, conservons encore quelques illusions. Il est si doux de se dire : \"Je suis aimé !\"\n\nLa joie de mes camarades laisse un vide dans mon âme. J'arrive à Québec, mais comme mon retour au foyer domestique va être triste. Le deuil tout récent causé par la mort de mon père, va se renouveler. Mon cœur se trouble à la pensée de ma mère en larmes. Je suis heureux de rentrer à la maison paternelle, mais je redoute le moment où, en y mettant les pieds, je ne trouverai plus là mon père, l'âme de la famille.\n\nMon Dieu, cette douleur m'est bien pénible ; comme compensation, donnez-lui le bonheur que vous avez promis au ciel à ceux qui ont vécu et sont morts en bénissant votre Saint-Nom, et vous ont offert leurs souffrances en expiation de leurs fautes.\n\nA six heures du matin, le mardi vingt et un juillet, nous étions arrêtés quelques instants aux Trois-Rivières, pour prendre le déjeuner. A midi moins quelques minutes, nous étions à Québec.\n\nSi nous étions contents de rentrer dans nos foyers, on était heureux de nous revoir. Témoin : ce passage d'un article publié dans un journal du même jour :\n\n\"Ils nous reviennent ces enfants, ces frères, ces amis du 9ème bataillon, que depuis longtemps nous attendons anxieux. La trompette qui avait sonné l'heure de la bataille, sonne aujourd'hui l'heure du retour. Quelques-uns sont restés là-bas, victimes de la fatigue et du labour, mais leurs frères d'armes gardent leur souvenir et leurs derniers adieux. Ils nous reviennent le cœur content d'avoir servi la patrie et exposé leurs jours pour sa défense et pour sa gloire.\"\n\n\"Vos pleurs coulaient au jour du départ, mères attendries, mais les voilà ! séchez vos larmes. Chaque soir, à genoux, vous imploriez le ciel, priez encore, Dieu vous les a rendus.\"\n\n\"Ce soir même, ils seront rendus au foyer, près de vous, souriant à vos paroles, le cœur tantôt plein de soupirs, tantôt plein de pleurs de joie, mais toujours émus par l'idée d'un retour heureux et depuis longtemps désiré.\"\n\n\"La patrie est bien belle pour le voyageur qui revient à son hameau, mais pour celui qui s'est offert à sa défense et au succès de ses armes, et qui revient victorieux, son aspect est l'idéal de la grandeur et de la...\"\nbeauté. Tout Canadien aime son pays, mais celui qui s'est dévoué pour lui s'incline en le revoyant et se réjouit de l'avoir défendu. Nos pères furent des héros, car leurs ennemis étaient des étrangers ; nos volontaires sont des types de loyauté, car ceux qu'ils ont été combattre étaient des frères pris d'enthousiasme et guidés par l'imprudence. Cependant, conservant dans leurs cœurs l'esprit de leur noble devise, ils ont respecté la faiblesse de l'ennemi, et nul remords, nul acte de cruauté ne souille l'histoire de leur campagne.\"\n\n\"Aujourd'hui donc, le baiser du retour; aujourd'hui donc, l'expansion de la joie. En présence des acclamations de leurs concitoyens, des réjouissances de leurs mères, du sourire de leurs épouses ou de leurs fiancées, aux poignées de mains franches et cordiales qu'ils recevront de leurs amis sincères et dévoués, nos volontaires ne pourront s'empêcher de s'écrier du fond du cœur :\n\nAmitié ! nature ! patrie !\nQue celui qui vous injurie\nN'éprouve jamais vos douceurs !\nRégnez sur mon âme attendrie.\nQu'il me soit toujours inconnu,\nLe mortel qui sans être ému\nPrononce le nom de sa mère,\nEmbrasse un ami d'un œil sec,\nEt ne sourit pas à l'aspect\nDe la cabane de son père !\n\nNous sommes entrer en gare aux sons de la musique et au milieu des vives acclamations de la foule empressée de nous souhaiter la bienvenue. Il pleuvait abondamment. Après l'échange de nombreuses et chaleureuses poignées de mains, on nous fit descendre des chars, et dans la gare, M. Langelier, maire de Québec, entouré de l'élite des citoyens, nous lut l'adresse suivante :\n\nAu lieut. col. Amyot, aux officiers et aux sous-officiers et soldats du neuvième bataillon Voltigeurs de Québec.\n\n\"Il y a bientôt quatre mois, dans la plus mauvaise saison de l'année pour les opérations militaires, vous étiez soudainement appelés à prendre part à une expédition lointaine. Sans vous laisser arrêter par le soin de vos affaires personnelles, ni par les supplications de vos familles, sans vous laisser effrayer par les dangers que vous alliez avoir à courir de la part de l'ennemi, et à cause du climat, vous avez, sans hésiter, abandonné vos occupations, dit adieu à ce que vous aviez de plus cher, et endossant de bon cœur l'uniforme, \"vous étiez, après quelques heures d'avis,\" à bord du train qui devait vous conduire, d'étape en étape, jusqu'aux \"Montagnes Rocheuses.\"\n\nJe ne dirais pas la vérité si j'affirmais que nous vous voyions partir avec plaisir. Sans compter les regrets et les inquiétudes bien légitimes de ceux qui voyaient partir des époux, des fils, des frères, des amis intimes, nous\nne pouvions nous empêcher de voir avec peine que la guerre dans laquelle vous alliez être appelés à faire de si grands sacrifices, à courir de si grands dangers, était une guerre contre des compatriotes. Avec combien plus de plaisir nous vous aurions vu partir pour aller repousser un ennemi étranger !\n\nMais nous nous consolions à la pensée que puisqu’il fallait prêter main-forte à la loi et à l’ordre public, et que l’insurrection, quelqu’excusable qu’elle pût être, fut reprimée, “il y avait moins de dangers d’excès” contre les malheureux qui avaient pris les armes, “alors que la répression était entre vos mains.”\n\nAujourd’hui, votre joie est sans mélange de regrets et d’inquiétude. Au plaisir de vous voir revenus sains et saufs au milieu de nous, se joint l’orgueil de constater “que votre conduite a fait honneur à votre bataillon, à votre ville, à votre nationalité et à votre pays.”\n\nVous n’avez pas eu l’occasion de livrer de combats, mais vous avez fait et bien fait quelque chose de beaucoup plus difficile, surtout pour des gens nouveaux dans le métier des armes ; “vous avez enduré le froid, la faim, la fatigue, les misères de toutes sortes, vous avez, pendant plusieurs mois, supportés la vie de garnison dans des endroits éloignés de tout centre civilisé,” privés de tout ce qui peut rendre la vie agréable à des gens habitués à vivre dans une ville aussi sociable que la vieille capitale de la province. Pour livrer un combat, il suffit d’avoir du courage personnel, et il n’y a pas un homme digne de ce nom qui ne soit prêt à en montrer lorsque l’occasion s’en présente. Mais, pour endurer ce que vous avez enduré, pour faire ce que vous avez fait, il faut plus que cela ; il faut cette patience, cette froide persévérance, cette discipline qui font l’esprit militaire et qu’on ne saurait trop louer dans un corps-volontaire de formation récente, sans expérience du service actif. Si vous avez déployé de telles qualités pour une guerre à laquelle vous n’alliez que par devoir, et que vous ne pouviez que déplorer avec nous tous, que ne pouvions-nous pas espérer de vous si, “ce qu’à Dieu ne plaise,” vous étiez appelés à prendre les armes contre un ennemi étranger qui voudrait envahir notre pays et menacer nos forces ? Chacun de ceux qui se sont montrés si bons soldats, alors qu’il s’agissait de combattre des compatriotes égarés, “vaudraient quatre hommes” contre un ennemi pour lequel il n’éprouverait aucune sympathie !\n\nEn venant saluer avec joie ceux qui nous reviennent, nous ne devons pas oublier ceux qui, partis avec eux pleins de vie et d’espoir, sont allés mourir loin de leurs familles. Aux parents de ceux-ci, je puis assurer qu’ils ont les plus vives sympathies de toute la population de Québec.\n\n“Colonel Amyot, officiers et soldats du 9ème bataillon,” au nom de toute notre ville, je vous dit : “vous avez bien mérité de votre pays, nous sommes fiers de vous, et nous vous souhaitons la plus cordiale bienvenue.”\n\nVIVE LE 9ÈME BATAILLON.\n\nQuébec, 21 Juillet 1885.\n\nLe colonel Amyot répondit en termes éloquents. Il remercia M. le maire Langelier et les citoyens de Québec de l’accueil qu’ils nous faisaient. Il rédit en quelques mots la campagne que nous avions entreprise et contribué à mener à bonne\nfin, nos souffrances, les misères que nous avons endurées, notre joie quand nous recevions de bonnes nouvelles de Québec. Il termina en faisant l'éloge de son bataillon.\n\nLa procession se mit ensuite en marche, dans l'ordre suivant : la Brigrde du Feu, avec ses voitures et les hommes en grand costume ; le corps de musique du 87me suivi des officiers de ce bataillon ; le 8ème bataillon ; la Batterie de Campagne ; la Batterie \"A\" ; les zouaves, escortant le drapeau de Carillon ; le comité de réception ; le 9ème bataillon, puis enfin la Garde d'Honneur de St-Sauveur, fermant le défilé.\n\nLa rue St-Joseph avait revêtu un air de fête. Partout des drapeaux et des fleurs. Comme nous nous sentions heureux d'être accueillis avec tant d'enthousiasme ! De chaque côté, la rue était encombrée de personnes attirées plus encore par la sympathie, le désir de nous dire un mot de bienvenue, que par la nouveauté du spectacle.\n\nÀ l'église de St-Roch, il y eut un TE-DEUM solennel chanté par Monseigneur l'archevêque, assisté de M. l'abbé Faguy, notre digne aumônier. L'église était magnifiquement décorée : de la voûte partaient de nombreuses banderolles aux couleurs admirablement variées et qui offraient un coup d'œil splendide. Des drapeaux couvraient les murs, les colonnes, et donnaient à ce beau temple un aspect plus grandiose.\n\nAu sortir du lieu saint, nos regards furent frappés par la vue d'un bel arc-de-triomphe, élevé en face des salles de l'Union Commerciale, sur la rue de l'Eglise. C'était une imitation parfaite de la porte Kent, et ornée de drapeaux et de trophées militaires.\n\nDe là, nous montâmes à l'Arsenal, par la rue des Fossés et la Côte du Palais. Quand nous étions déposés nos fusils, le colonel nous fit un petit discours, nous félicitant de la manière dont nous avions accompli notre devoir, pendant l'expédition au Nord-Ouest, et nous remerciant de notre service. Puis il nous donna congé jusqu'au lendemain.\n\nPersonne, on peut le croire, ne se fit prier pour sortir. Nous étions libres, enfin ! Il fallait bien revenir le lendemain, en costume complet ; mais nous étions revenus à Québec, nous n'avions plus de service à faire, on ne nous appellerait plus à faire la garde, des marches forcées, de l'exercice pendant quatre ou cinq heures par jour, au soleil ou à la pluie. Nous étions\nl'bras ! Les quelques heures qu'on nous demanderait encore seraient pour recevoir des ovations, recueillir les applaudissements de la foule.—En un clin d'œil, nous fûmes dispersés à tous les coins de la ville; chacun cherchant sa mère, son épouse ou ses sœurs, à qui il voulait donner au plus tôt le baiser du retour. Je ne veux pas attrister le récit de notre retour à Québec, où tout ne respirait que la joie pour mes camarades, en redinant mes impressions lorsque je revins à la maison paternelle, vide de son chef. Le bonheur du retour était d'ailleurs un baume jeté sur la blessure qui faisait saigner nos cœurs.\n\nLe mercredi, vingt-deux juillet, nous remontions à la Salle d'Exercices, rue St-Louis, où le colonel nous avertit que nous devions nous réunir à sept heures du soir, sur la place Jacques-Cartier, à St-Roch.\n\nÀ l'heure dite, nous avions formé les rangs, et quelques instants après, nous partions, escortés de la musique du bataillon, de la Brigade du Feu, et des membres des clubs de raquettes, portant des flambeaux. Rendus au Pavillon des Patineurs, on nous servit un goûter délicieux, où nombre de santés furent portées et bues avec enthousiasme.\n\nLe lendemain soir, les fêtes recommençaient. Cette fois, nous allions faire une promenade dans le port. Le gouvernement avait mis à notre disposition le magnifique vapeur le Napoléon III. Le Vega, le Dolphin nous accompagnaient. Comme chacun de nous avait eu la permission d'amener une dame, cette soirée a été une des plus belles que nous ayons encore passées. La musique était à bord.\n\nLe dimanche, nous sommes allés, en corps, faire un pèlerinage à la chapelle de notre Dame de Lourdes, à St Michel de Bellechasse.\n\nLe lendemain, lundi, vingt-sept juillet, nous étions rendus, à dix heures, à la salle d'Exercices, où le lieut.-col. Duchesnay fit l'inspection du bataillon. Les félicitations à notre adresse recommencèrent comme de plus belle, et après le départ du colonel inspecteur, notre commandant nous dit que nous étions libres, et que pour nous récompenser de nos loyaux services, il prenait sur lui de nous permettre de garder nos uniformes; en souvenir de la campagne que nous venions de faire.\n\nAinsi se sont passés les fêtes de notre retour à Québec.\nAinsi s'est terminée cette expédition du Nord-Ouest dont nous garderons le souvenir toute notre vie.\n\nEn finissant, je ne puis faire autrement (et je crois en cela être l'écho du sentiment de tout le bataillon) que de remercier Dieu de nous avoir permis de revenir sains et saufs au pays. Nous remercions les citoyens de Québec de leurs boisées pour nous pendant la campagne et de la façon flatteuse dont il nous ont accueillis à notre retour. Nous remercions aussi nos officiers de la manière courtoise dont ils se sont conduits envers nous tout le temps que nous avons été en service ; nous leur devons ce témoignage : qu'ils nous ont traités plutôt comme des frères que comme des soldats soumis à leurs ordres.\n\nPour ma part, je remercie d'avance mes lecteurs de l'indulgence qu'ils voudront bien avoir pour l'auteur, en lisant ce petit ouvrage.\n\nFIN.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001332.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 107, "total-input-tokens": 137002, "total-output-tokens": 63700, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 56, 1], [56, 56, 2], [56, 228, 3], [228, 228, 4], [228, 394, 5], [394, 394, 6], [394, 1411, 7], [1411, 1411, 8], [1411, 3283, 9], [3283, 4954, 10], [4954, 6016, 11], [6016, 7053, 12], [7053, 8089, 13], [8089, 9145, 14], [9145, 11360, 15], [11360, 13496, 16], [13496, 15480, 17], [15480, 17724, 18], [17724, 19966, 19], [19966, 22079, 20], [22079, 23943, 21], [23943, 26186, 22], [26186, 28502, 23], [28502, 30750, 24], [30750, 32707, 25], [32707, 34867, 26], [34867, 37043, 27], [37043, 39271, 28], [39271, 41588, 29], [41588, 43748, 30], [43748, 45868, 31], [45868, 48069, 32], [48069, 50175, 33], [50175, 52596, 34], [52596, 54849, 35], [54849, 56913, 36], [56913, 59026, 37], [59026, 61168, 38], [61168, 63524, 39], [63524, 65921, 40], [65921, 68232, 41], [68232, 70546, 42], [70546, 72522, 43], [72522, 74726, 44], [74726, 76927, 45], [76927, 79066, 46], [79066, 81485, 47], [81485, 83454, 48], [83454, 85839, 49], [85839, 88174, 50], [88174, 90206, 51], [90206, 92567, 52], [92567, 94807, 53], [94807, 97150, 54], [97150, 99404, 55], [99404, 101533, 56], [101533, 103674, 57], [103674, 105942, 58], [105942, 108185, 59], [108185, 110324, 60], [110324, 112674, 61], [112674, 115072, 62], [115072, 117433, 63], [117433, 119721, 64], [119721, 121962, 65], [121962, 124313, 66], [124313, 126610, 67], [126610, 128905, 68], [128905, 131277, 69], [131277, 133578, 70], [133578, 135852, 71], [135852, 138176, 72], [138176, 140458, 73], [140458, 142684, 74], [142684, 144891, 75], [144891, 147069, 76], [147069, 149347, 77], [149347, 151555, 78], [151555, 153765, 79], [153765, 156100, 80], [156100, 158279, 81], [158279, 160215, 82], [160215, 162544, 83], [162544, 164846, 84], [164846, 167239, 85], [167239, 169472, 86], [169472, 171753, 87], [171753, 174031, 88], [174031, 176307, 89], [176307, 178452, 90], [178452, 180557, 91], [180557, 182869, 92], [182869, 186342, 93], [186342, 189316, 94], [189316, 191711, 95], [191711, 193827, 96], [193827, 196186, 97], [196186, 198500, 98], [198500, 200943, 99], [200943, 203548, 100], [203548, 206793, 101], [206793, 209104, 102], [209104, 211339, 103], [211339, 212194, 104], [212194, 212194, 105], [212194, 212194, 106], [212194, 212194, 107]], "primary_language": ["fr", "None", "fr", "None", "fr", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false]}}]