[{"id": "f938cb5ff9e4bad16094eafedc47bfcd594de778", "text": "RETURN\n\n(52f)\nTo an ADDRESS of the Senate, dated 7th April, 1886:—For copies of the Commission or Commissions, and instructions issued to the Commissioners appointed to enquire into and report upon the losses sustained in the North-West Territories during the recent rebellion.\n\nBy Command.\n\nJ. A. CHAPLEAU,\nSecretary of State.\n\nDepartment of the Secretary of State,\n13th April, 1886.\n\nCOPIES OF ALL LETTERS OF INSTRUCTIONS ISSUED TO THE COMMISSIONERS APPOINTED TO ENQUIRE INTO AND REPORT UPON THE LOSSES SUSTAINED IN THE NORTH-WEST TERRITORIES DURING THE RECENT REBELLION.\n\nDEPARTMENT OF THE INTERIOR, Ottawa, 26th February, 1886.\n\nSir,—I am directed by the Minister of the Interior to inform you that you have been appointed, along with Mr. Henry Muma, of Drumbo, Ontario, and Mr. Thomas McKay, of Prince Albert, District of Saskatchewan, to proceed to the North-West Territories for the purpose of considering any claims which may be presented to the Government for losses in connection with the recent Indian and half-breed insurrection.\n\nYou are yourself to be the chairman of the commission, and Captain George R. Young, of Winnipeg, Manitoba, will be the secretary.\n\nThe class of claims which it will be your duty to investigate may be briefly stated as claims for loss of property, or for imprisonment, or for forced emigration from the territory.\n\nAll the claims presented, whether they would seem to be included in the terms of the third paragraph of this letter or not, you should receive, with such evidence, to be taken under oath, as the claimants may desire to bring forward, but in forming your conclusions you will consider only such testimony as is applicable under the terms of the said third paragraph.\n\nThe claimant, as well as his witnesses, should be duly sworn, and his evidence taken either by yourself or by one or other of your colleagues, or by the secretary.\n\nIn cases where the claimant, for any valid reason, such as removal in the prosecution of his calling from the locality in which the loss is alleged to have occurred, is unable to appear personally before the commission to give his evidence, as provided in the next preceding clause, such evidence bearing upon the claim should be taken as the commission may be able procure, and the same should be submitted to the Minister of the Interior, with the opinion of the commission as to the manner in which the claim should be dealt with.\n\nEach claim submitted to you should be reported upon separately, with the conclusions of yourself and colleagues endorsed thereon, and every case should be numbered and docketed with the name of the claimant.\nIn the execution of your duty you should be guided by equitable principles rather than by technical rule, exercising discretionary power of judging, as a jurymen would, from considerations and circumstances not always appearing on the surface, as to the value of the evidence and the good faith of the claim. You should rather hear and judge than put yourself in the position of resisting a claim.\n\nThe principles to be applied to all cases may be briefly stated as follows:\n\n1st. Require all reasonable proof of every essential fact upon which a claim is founded.\n\n2nd. Allow for all proved losses which are the direct and immediate consequence of the insurrection, and not attributable to the fault or negligence of the claimant.\n\n3rd. Take a claimant's own sworn evidence as to the value of property lost, where of necessity such value was within his exclusive knowledge, but not otherwise.\n\n4th. Have regard to all facts of a public and general nature, which may tend to throw light upon the good faith of each claimant.\n\n5th. Claims for consequential damages, while they may be heard and the evidence noted, do not come within the scope of your duties, and in making your report you should disallow them.\n\nIt should be explained to all concerned that the object of your enquiry is to ascertain and pass upon claims for actual loss, but not for damages in the purely legal sense of that term.\n\nThere may be, of course, claims of an exceptional character, such as could not properly be ranked as coming under any of the definitions expressed in this communication. These should be submitted, through the Minister of the Interior, for the consideration of the Government, with a report of the views of yourself and your colleagues thereon.\n\nIt is desirable in the public interest that you should proceed to the North-West, on the business indicated in this letter, immediately.\n\nMr. Muma will accompany you to the North-West, and Mr. McKay, who is at present at Prince Albert, will be asked to join you at such place as you may notify him of by telegraph.\n\nUpon your departure for Winnipeg, Captain Young will be advised by telegraph to meet you there.\n\nA cheque for $ on account of expenses is herewith enclosed, and a sum of $ has been placed to your credit in the Bank of Montreal, at Winnipeg. You will, of course, have to produce duplicate vouchers, duly signed and witnessed, for all expenditure made in connection with this enquiry, and all such vouchers must be approved of by yourself as chairman.\n\nYour remuneration will be at the rate of $15 dollars per diem, with an allowance of $5 per diem for living expenses.\n\nI have the honor to be, Sir, your obedient servant,\n\nA. M. BURGESS, Deputy of the Minister of the Interior.\n\nJ. ALPHONSE OUIMET, Esq.,\nChairman of the Rebellion Losses Commission, Montreal.\n\n(Telegram.)\n\nOTTAWA, 14th September, 1885.\n\nMackay joins you on same terms and for same purposes as Ouimet and Herchmer and will be found very useful.\n\nHe should be specially consulted about claims from Prince Albert and South Branch before making your report.\n\nJOHN R. HALL.\n\nHENRY MUMA, Esq. care of Commissioner of Dominion Lands, Winnipeg.\n(Confidential.)\n\nOttawa, 10th July, 1885.\n\nDear Sir,—With reference to my confidential letter of this day's date, asking you to proceed to the North-West Territories upon the special mission therein mentioned, the Minister directs me to request that you and your colleagues will report to him, confidentially, from time to time, after your visitation to the several districts:\n\n1. Whether there are likely to be any cases of real destitution therein during the coming winter.\n2. Whether the destitution is likely to be confined to a few of the population of the district, or whether it is likely to be general.\n3. Whether, in your judgment, it would be necessary that relief should be afforded by the Government to people in destitute circumstances in the district. If so, what form should the relief take, for what time should it be afforded, and how many people, in each case, would it be necessary to assist?\n\nI have the honor to be, dear Sir, your obedient servant,\n\nA. M. Burgess.\n\nHenry Muma, Esq., Drumbo, Ont.\n\nP.S.—It may be desirable for you to communicate with me, especially on the subject of this letter, by telegraph, in which case please use Slater's telegraphic code, of which a copy is enclosed. The cypher will be sender add 300, receiver subtract.\n\nA. M. B.\n\n(Confidential.)\n\nDepartment of the Interior, Ottawa, 10th July, 1885.\n\nDear Sir,—As already informed verbally, you have been selected by the Minister of the Interior, along with Mr. Lawrence Herchmer, of Birtle, in the Province of Manitoba, and Mr. J. Alphonse Ouimet, of Montreal, in the Province of Quebec, to proceed to the North-West Territories for the purpose of privately investigating and ascertaining, for the information of the Government, the amount of damage suffered by persons in the Territories by reason of the recent half-breed and Indian insurrection.\n\nThe class of claims which it will be your duty to investigate may be briefly stated as direct claims for loss of property, or for imprisonment, or for forced emigration from the country.\n\nClaims for consequential damages will not be considered; and as these could only arise in connection with the last of the three classes of claims hereinbefore mentioned, that is to say claims for forced emigration from the locality within which the claimant resides, it is to be understood that the word \"forced\" shall not be considered to imply emigration from mere alarm, but from serious danger to life and property; that is to say, the object of your enquiry is to ascertain as far as possible what claims are likely to be made upon the Government for actual loss, but not for damage in the purely legal sense of that term. It is desirable that you should ascertain in each case the antecedents and attitude of the person claiming to have suffered, particularly whether he has been loyal in his action and utterances, or otherwise, or whether he has openly or secretly encouraged the agitation which led to the outbreak. Mr. Ouimet and yourself may act separately or together as you may find most convenient, but I suggest that it would be most advisable that Mr. Ouimet and yourself, on account of his knowledge of the French language, should be invariably together, and perhaps to Mr. Herchmer might be allotted a section of country in which the French language is not much used.\n\nMr. Ouimet will join you at Owen Sound tomorrow and will hand you this letter of instructions with a cheque for $200 on account of your expenses. The sum of $1,000 has been placed to your credit in the Bank of Montreal, Winnipeg, and the same can be drawn against from time to time, as necessity may require. If you should need a\nfurther credit, please to write, or telegraph, as the case may be, mentioning the amount.\n\nOn your arrival at Winnipeg please telegraph to Mr. Herchmer telling him by which train you will leave that city for the west, and asking him to meet you at the most convenient station on the railway. Immediately, of course, on his joining you, you will make him such advances on account of expenses as you may think fitting. Duplicate vouchers, duly signed and witnessed, will be required on account of all expenditure in connection with your commission, whether it has been incurred on your own account or on account of your colleagues.\n\nIt is, of course, understood that your enquiry is to be strictly private, and for the information of the Government, and it will be desirable that you should report to me from time to time, as your investigation progresses.\n\nThis letter of instruction, although addressed to you, is intended for the information and guidance of your colleagues as well.\n\nI have the honor to be, Dear Sir, your obedient servant,\n\nA. M. BURGESS, Deputy Minister of the Interior.\n\nHENRY MUMA, Esq., Drumbo', Ont.\n\nCOMMISSION\n\nAPPOINTING Joseph Alphonse Ouimet, Thomas McKay and Henry Muma, Esquires, Commissioners under 31 Victoria, Chapter 38, to examine into and hear evidence concerning any claim for compensation for loss or damage arising out of the late Half-breed and Indian Insurrection in the North-West Territories.\n\nCANADA.\n\n(LANSDOWNE.)\n\nVICTORIA, by the Grace of God, of the United Kingdom of Great Britain and Ireland, Queen, Defender of the Faith, &c., &c., &c.\n\nTo Joseph Alphonse Ouimet, of the City of Montreal, in our Province of Quebec, Esquire, Barrister-at-Law; Thomas McKay, of Prince Albert, in our District of Saskatchewan, Esquire; and Henry Muma, of Drumbo, in the County of Oxford, in our Province of Ontario, Esquire, and to all to whom these presents shall come, or whom the same may in any wise concern—GREETING:\n\nWHEREAS it is in and by an Act of the Parliament of Canada, passed in the thirty-first year of our reign, chaptered thirty-eight; and intituled: \"An Act respecting Enquiries concerning public matters,\" amongst other things, in effect, enacted that whenever the Governor in Council deems it expedient to cause enquiry to be made into and concerning any matter connected with the good government of Canada, or the conduct of any part of the public business thereof, and such enquiry is not regulated by any special law, the Governor may, by the commission in the case, confer upon the commissioners or persons by whom such enquiry is to be conducted, the power of summoning before them any party or witnesses, and of requiring them to give evidence on oath orally or in writing (or on solemn affirmation if they be parties entitled to affirm in civil matters), and to produce such documents and things as such commissioners deem requisite to the full investigation of the matters into which they are appointed to examine.\n\nAnd whereas we deem it expedient for you, the said Joseph Alphonse Ouimet, Thomas McKay and Henry Muma, to examine into and hear evidence concerning any claim for compensation for loss or damage arising out of the late outbreak in our North-West Territories of Canada, and that you be empowered to summon witnesses and to examine them under oath.\n\nNow know ye that under and by virtue of the powers vested in us by the said Act, passed in the thirty-first year of our reign, chaptered thirty-eight; and intituled:\n\"An Act respecting Enquiries concerning public matters,\" and by and with the advice of our Privy Council for Canada, we, reposing special trust and confidence in your loyalty, fidelity and ability, have nominated, constituted and appointed, and do hereby nominate, constitute and appoint you, the said Joseph Alphonse Ouimet, Thomas McKay and Henry Muma, to be our commissioners to examine into and hear evidence concerning any claim for compensation for loss or damage arising out of the late Half-breed and Indian insurrection in our North-West Territories of Canada.\n\nAnd we do hereby authorize and empower you as such commissioners to summon before you any party or witness and to require them to give evidence on oath, orally or in writing (or on solemn affirmation if they be parties entitled to affirm in civil matters), and to produce such documents and things as you, our said commissioners, shall deem requisite to the full investigation of the matters into which you are hereby appointed to examine.\n\nAnd we do hereby constitute and appoint you, the said Joseph Alphonse Ouimet to be the chairman of this our commission.\n\nTo have, hold, exercise and enjoy the said office, place and trust, unto you the said Joseph Alphonse Ouimet, Thomas McKay and Henry Muma, together with the rights, powers, privileges and emoluments unto the said office, place and trust of right and by law appertaining during pleasure.\n\nAnd we do hereby require you to report to our Minister of the Interior of Canada the names of the several persons who you may ascertain and determine to have claims for compensation for loss or damage as aforesaid, together with the evidence taken before you, and any opinions you may see fit to express thereupon.\n\nIn testimony whereof, we have caused these our Letters to be made Patent, and the Great Seal of Canada to be hereunto affixed. Witness, our Right Trusty and Entirely-Beloved Cousin, the most Honorable Sir Henry Charles Keith Petty-Fitzmaurice, Marquis of Lansdowne, in the County of Somerset, Earl of Wycombe, of Chipping Wycombe, in the County of Bucks, Viscount Caln and Calnstone, in the County of Wilts, and Lord Wycombe, Baron of Chipping Wycombe, in the County of Bucks, in the Peerage of Great Britain; Earl of Kerry and Earl of Shelburne, Viscount Clanmaurice and Fitzmaurice, Baron of Kerry, Lixnaw, and Dunkerron, in the Peerage of Ireland; Knight Grand Cross of our most Distinguished Order of Saint Michael and Saint George; Governor General of Canada, and Vice-Admiral of the same.\n\nAt our Government House, in our City of Ottawa, this twenty-fifth day of February, in the year of our Lord one thousand eight hundred and eighty-six, and in the forty-ninth year of our reign.\n\nBy Command,\n\nG. POWELL,\nUnder Secretary of State.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001376.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 7472, "total-output-tokens": 3569, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2632, 1], [2632, 5795, 2], [5795, 9449, 3], [9449, 12940, 4], [12940, 15715, 5]], "primary_language": ["en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]